{"Reviews": [{"Title": "Great upgrade to NEX-6", "Author": "JeffT", "ReviewID": "RXHOKAKLW2LCB", "Overall": "5.0", "Content": "Having pre-ordered and purchased this as an upgrade to a NEX-6, here are some initial impressions:First off, the biggest improvement by far is the autofocus.  They're not kidding - it is fast.  DSLR fast.  Even in low light situations that would leave the leave the NEX hopelessly hunting for focus, it can lock on.  Focus seems very accurate as well.Other enhancements:+ More ISO Choices:  The NEX-6 ISO settings were in 1-stop increments - 100/200/400/800/etc.  The A6000 offers 1/3-stop increments:  100/125/160/200/etc.  I'm sure this will come in handy.  In addition, it offers multi-frame NR as an additional option when selecting auto-ISO (though this option is not available when shooting in RAW/JPG mode)+ Better menu system:  It is now much easier to use, and resembles the menu system of the RX100.  I was able to get the camera set to my liking in a fraction of the time that it would have taken with the NEX-6, even today after using it for over a year and nearly 10,000 shots.+ Better low-light performance:  Shooting back-to-back with the NEX-6, the A6000 yields much cleaner JPG output at a given ISO.  I haven't yet had a chance to look at RAW.+ Burst mode:  WOW.  Continuous Shooting drive mode now offers three modes:  lo/mid/hi.  Speed priority is no longer there, I presume because of the much faster image processor and autofocus renders it unnecessary.  On \"Lo\" it feels about the same as the NEX.  On \"Hi\" it is like a chain gun.+ The viewfinder:  Yes, I think it is an upgrade.  I could not discern any lower resolution, but it definitely is faster on the refresh and better in low light.+ Auto-ISO:  As was pointed out by a helpful commenter, it IS now possible to change the default range limits that auto-ISO uses.  This is a much-needed upgrade, and will make this function usable for me now.Cons:- As another reviewer pointed out, the (legacy lens) manual-focus assist zoom button has vanished.  When using a legacy MF lens, they were a big help.  However, the C2 button can be repurposed for that function via the menus, and although it doesn't work 100% as before, it does the job.Overall, I'd give this camera six stars at this point if I could.", "Date": "April 22, 2014"}, {"Title": "An excellent camera that falls just barely short of perfection", "Author": "iburke", "ReviewID": "RDDRTSC04PRV9", "Overall": "4.0", "Content": "Let me start this review with some background of my photography experience. (Short story, I am an amateur, skip to “PROS” section)I bought a Nikon D40 and had it for several years before selling it in college and I was short on cash. Ever since then I’ve been relegated to my various cell phone cameras. I always had intentions of buying back into the hobbyist camera space at some point, and with an upcoming trip to Europe this summer, there was no time like the present to make a purchase.I had set a budget for myself that basically put my sights on the OM-D E-M10 and the Sony A6000, sans kit lens and spending the money (well worth it, we’ll get to that in a bit) to get a fast prime near the 50mm equivalent range.I never got a hold of an E-M10, so I will not compare the two, but will say that the APS-C sensor size of the A6000 was a key point for me. Without stirring the micro four thirds vs. the world debate, for me, sensor size still means something. Reality is that for the hobbyist, honestly, I don’t think you can choose incorrectly.The purchase was an A6000 (body only) with the well-reviewed SEL35F18 lens. I am forgoing the kit lens and intend to fill out my lens set (eventually) with the SEL1018 and another mid-range zoom. I cannot emphasize enough how great the SEL35F18 lens is. I am in love with it, and I think that it will really teach me to shoot correctly, rather than lean on the “zoom” crutch. If you have the extra cash, I would highly recommend this kit as a great starting point.I am not a professional, I have not taken photography courses, so I will cover the camera from the perspective of a guy looking to take photography to the next level. Let’s dig on in…PROS:-The A6000 is small. Coming from a rather chunky D40, I was pleasantly surprised by this. With the relatively small lens, a 35mm prime, it feels very well weighted, if just a tad plastic-y. Large lenses could upset the balance of the camera, but you wouldn’t have a 70-200 mounted for walk around use, anyways.-Controls…plenty of them. Spend some time while laying it bed to just mess with the settings and feel the camera out. DO NOT let your first experience with the camera be something special, such as a graduation or wedding. There’s a lot of options and flexibility here to make your photos shine, and keeping it in Auto or Superior Auto means you’re missing the point. That said, Sony does a good job of catering to the new photographer as well as those well versed in photography (and everyone in between). The controls allow you to grow and take more and more control as you learn (and less while you’re still figuring it out).-Menus: They go hand in hand with the controls I mentioned above, there’s a lot to them, but the layout is simple. Take some time to understand them, and you’ll be A-OK.-Viewfinder: You’re not going to mistake it for a traditional mirror box, but it gets the job done and it plenty functional. It’s not grainy or low quality by any means. Being my first OLED viewfinder, I have no comparison points but I’ve come away impressed so far. Though, the sensor that enables it is a bit too sensitive, can’t find a way to adjust that.-Focusing: Lightning fast. Allegedly a huge improvement over older compact system cameras, and for that I am grateful. Haven’t done any serious continuous AF shooting quite yet, but its done what it hasn’t skipped a beat.-Image quality: Given that I am an amateur, I am by no means a pixel peeper. So I think the IQ is fantastic. I think the JPG engine turns out somewhat dull images by default, but with a little tweaking, that can be easily fixed. We’re getting to the point where most any compact ILC can pump out decent images, and for me the A6000 certainly doesn’t disappoint.CONS:-I almost wish the grip was slightly bigger. I’ve got bigger hands, so things get tight after awhile. With a larger lens on the camera, I worry that the small grip won’t be sufficient to support the setup, forcing me to a 2-handed shot. The other benefit to the bigger grip would be an improvement in…-BATTERY LIFE. Through my use so far, I’d say it’s around ~300-325 shots. That’s not a lot. When I unboxed the camera I was shocked at how small the battery is. A slightly larger grip to fit a bigger battery would be a wise decision. A fine line between keeping the setup compact and improving the shooting experience, but I think Sony has some room to tip toe further towards that line, especially when you move beyond the tiny kit lens.-The Screen: To start, it’s a 16:9 screen and the sensor is 3:2. When reviewing images the on-screen image is pretty darn small. The screen itself is functional, bright, and effective; but the aspect ratio is a head scratcher. Also…-NO TOUCHSCREEN: The camera has nearly 200 AF points, and to pick a spot focus you use the tiny D-pad to the right of the screen. It is, to say the least, not intuitive, and slows down the act of taking a shot.-RAW+JPG Shooting: When shooting in JPG mode, you get the option to use some in-camera effects. Some are cheesy, others such as HDR can produce genuinely nice results. If you switch to RAW+JPG shooting, you lose the ability to use those effects for BOTH the RAW and the JPG image. Now, for the RAW image this makes sense, but it would be nice to be able to capture an unmolested raw file while still messing around with the in-camera effects/filters on the corresponding JPG file. From my understanding, competitors such as Olympus handle this much better.The rest is all gravy. Nit picks here and there that are more quirks than true cons.CONCLUSION:This camera rocks. It’s not perfect, hence the 4/5 rating, but it’s probably the best camera money can buy at the current MSRP (body only). It’s got a good size to it, plenty of controls and easy to navigate menus that allow you to grow into the camera, a viewfinder that’s unassumingly tucked away into the body (rather than atop it),  a great AF system, and excellent image quality. As for what could be improved, I’d like to see a bigger grip to accommodate larger lenses and a bigger battery to build upon the mediocre battery life. I think a touchscreen was a glaring omission that really slows down the shooting experience. And the fact that choosing JPG + RAW shooting mode disables most all in-camera effects, even for the JPG copy is a bummer. It’s basically Sony forcing you to either act like a professional, or act like a child, but you can’t mix work and pleasure. Competitors handle that aspect better.If you go with the A6000, skip the kit lens and spend some time with a fast prime. If not the SEL35F18, then look at the cheaper Sigma Primes. The kit lens may not be bad, but shooting with a prime really makes you think about your style and understanding of composition.Hope you found this a worthwhile review. Happy to answer any and all questions (Again, from an amateur perspective) in the comments.", "Date": "May 1, 2014"}, {"Title": "Sony A6000 - A backpacking camera", "Author": "A. Koenig", "ReviewID": "R3QOPL9171BTT9", "Overall": "5.0", "Content": "The usual background: I normally use a Canon 5D Mark III DSLR camera (5D) as a recreational camera - not professional, but I sure like to take good photos. I had upgraded from a Nikon D80 a few years ago and really appreciated the full sensor size and the much better low light on the Canon. I also have a Nikon Coolpix AW100 underwater camera when I need something rugged and really water proof.But taking a 4 pound camera on backpack adventures was too much, so I have been looking for a light weight camera that could give me as close to the same capabilities as the Canon 5D - a high standard.I have purchased and used a dozen or so of the point-and-shoot cameras. Canon Elf, Powershot, Nikon, Lumix, etc. They are not good enough for any of my serious photos - due to both the lack of viewfinder in bright scenes, the crappy controls for exposure/aperture/ISO shooting, and the compression artifacts on the captured scene. The Nikon Coolpix AW100 doesn’t take great photos, but better than an iPhone. They just don’t do raw. And you need real glass to take good pictures. I will continue to bring my waterproof Nikon camera with me for those really wet experiences, but I wanted something more than a point and shoot and less than a 4 pound professional camera.I wanted a camera that gave me a viewfinder - outside the LCD screens of all cameras just doesn’t work (additionally I need glasses to see up close and it was not easy taking outdoor shots and needing to put on my glasses to see the silly screen - or not see the screen in bright sunlight). I wanted light weight, RAW capture, full manual control in addition to shutter priority/aperture priority. I wanted one that could do decent video and focus during the shot while zooming.I wanted one that I could recharge via USB (I bring solar power with me for iPad GPS use - I have power to spare).I wasn’t sure if interchangeable lenses was important. A good built in would have been OK. Flash? Well OK if it was there - most built in are marginal at best, but in the back country it might be the only thing I had.So I settled on the Sony A6000. I went ahead and got two lenses - the starter lenses (16-50mm and a 55-210mm). I also got an extra Sony brand battery (more on this later).Canon 5D: 3.75 pounds (70-300mm lens, one extra battery)Sony A6000: 1.7 pounds (55-210mm lens, one extra battery) - but I will probably bring both lenses which brings it to 2.0 pounds and I will also have 16-50mm lens.So a 2 pound saving in weight - an expensive 2 pounds, but you also get the flash, a wifi remote control to an iPad, real video, and with an app the ability to do time lapse capture. And it is smaller. Much smaller.While I continue to think that the pictures from the 5D are better (especially in low light), the A6000 gives it a run for the money. The 5D can do spectacular video, but the 5D doesn’t do autofocus while capturing and I can’s see the back panel in daylight making the 5D almost useless for amateur event capturing. A6000 wins hands down for video for me - I focus on still images with an occasional video thrown in.I was concerned about not having through the lens SLR viewing, but honestly I like the A6000 just as much. The on-screen viewing and information is all I need to know the framing, the expressions,  if I have focus and how the exposure is going to turn out. The resultant pictures are always much better than what I see through the viewfinder. This is a big win for me. (I do wish there was an easy control to turn the big screen on/off - I want to conserve power so I use viewfinder only, but there are times I want to see the screen - the menu seems to be the only way to get there. Minor bitch. If Sony cares they could fix it in software.)The A6000 has a reasonable number placement and number of on-camera controls. Menu keys and quick access seems OK - not perfect, but nothing is. I don’t use it in auto mode - strictly A, S or M mode and they work just fine. I didn’t buy it to be a point and shoot. Pictures have been stunning so far. I will know more after my extended hike, but so far I’m pleased. WAY better than any other point and shoot I have owned.So there are some short term problems - I am an Apple Mac user so the software from Sony does not work on the latest operating system so I need to remove the SD card. So what -- it’s what I do most of the time with all my cameras. Apple has not released the software to read A6000 raw images so I only use the fine compression JPEG. Actually better than I expected, I will go to raw when the Mac software is upgraded.The A6000 does seem to really drain batteries. My 5D lasts a good week on a single charged battery and I don’t think A6000 will make it through a full day - but again I will know more after my extended trip. I purchased some spare cheap batteries, but the A6000 rejected them with a menu screen saying they were incompatible. I paid three times more for the Sony official battery - it worked. I also got an external charger - a good purchase.The A6000 has built in WiFi (no GPS) for communication to iPad/iPhones (and probably other devices). It’s cool to control and see what the camera sees and move pictures to a better display. Of course you can also take pictures with the iPad. Could just be a toy, but I like it. It is not that easy to set it up - but OK. It’s an ease of use thing…I am not impressed with the placement of the SD card in the battery case. It is right against the door so my fat fingers have trouble grabbing the card. I fixed it by putting a tag on the card so I can pull/hold it. That fixed it. Just a design flaw with an easy fix.I have noted that the sensor seems to attract dirt. I have needed to clear the sensor more than once. (I could see the dust footprint in images.) I don’t know if the static properties of the sensor are not resistant to dust or the placement of the sensor or I’m just a dirty person. I have not had this problem with the 5D. I’m going to the dusty grand canyon next week and it will be a real test.I’m pleased with the two lenses. I might get another prime lens, but I’m a bit worried about the dirt aspects. I am pleased the A6000 has interchangeable lenses. I do wish the A6000 was a bit more weather resistant, but I would trade light weight for the weather aspects. I would like to get rid of the back display - the viewfinder works just fine for me. I turn the back display off anyway to save batteries - and put it in airplane mode.I have not tested the flash.I really like the time lapse application that you can buy from the Sony App store. That looks like fun. I wish it could do 2fps capture, it seems to be minimum of 3 seconds per capture. It claims 1/second, but that didn’t work for me. I probably have some setting wrong.Sony uses strange language on their menu items. Probably all camera manufactures use non-standard language - so I will need to buy some book to explain what they mean. The users guide is useless IMHO. (i.e. DRO/Auto HDR — Compensates automatically for brightness and contrast. - so what does THAT mean?)All in all I’m very pleased with the A6000. I will continue to bring my 5D and my Nikon Coolpix AW100 underwater camera when I don’t need to go super light weight, but the A6000 can capture great images.If I learn more after a few hiking adventures I’ll share that in the future.", "Date": "May 4, 2014"}, {"Title": "A real review after a month of use", "Author": "William I. Levy", "ReviewID": "R1V17T2VZTA0JH", "Overall": "5.0", "Content": "Yes I own it and the 55-210 lens.This is a no frill review. I paid for this camera and was not comped it for review.I am a professional portrait photographer, now retired and travelling.I was looking for a larger sensor (crop) camera, way lighter than my full bodied Nikons that takes pictures nearly as well as a prosumer DSLR with kits lenses.I believe I have found it in this Sony, with caveats.Keep in mind...there is no perfect camera.It is the photographer who makes the picture, the camera just captures that moment.My uncle Louis and Michelangelo, using the same paints and brushes would have different results.So don't blame the camera for bad shots.....lol.To the review and the points....What it is not:-NOT a substitute for a Nikon or Canon prosumer DSLR with upgraded lenses. If you need to ask, then you will not see the differences.What it is:- Excellent build quality and ergonomics. Solid feel.- Fast shutter. No perceptible lag between shutter release and shot as with a DSLR.- A great general purpose camera that takes some incredible pictures (I have posted 3).- A great lightweight substitute for 85% of what you would get with a DSLR with comparable kit lenses.- The lenses are excellent for kit lenses. They take wonderful photos and the pancake 16-50 mm keeps the camera a great alternative for a bulky SLR or super zooms. After all, this is a big reason to make this purchase.Those reporting soft edges. So what? Most lenses, including some very expensive primes have soft edges. I have yet had anyone over my years of photography say....ooh, your photos have soft edges. Nonsense. Most photos are cropped and soft edges are lost on the cutting table....- High ISO graininess. Yes it is not great at 12,000 iso, but quite usable. Point is the camera takes fantastic night shots at 800 ISO and lower. Need 12,000 ISO for the .0005% of the pictures you would ever take at 12,000 ISO, then buy a 1.4 Leica lens for $1000. You will not need your 12,000.- The camera is a FAST focuser and accurate shooter. Great for capturing multiple frames of breaching whales and soccer kicks.You still need to manually set focus point for some action shots as you would with a DSLR.In Between:-Flash. Built in flash is weak, like on most cameras. The Sony dedicated FM20 flash works great as filler for outdoor shots and its flip up and down/ on off is actually a great feature. If you get a bigger, bulkier flash larger than the camera itself, you are taking away the reason why you got this small jewel. Caveat - Sony, the flash should swivel. Not all shots are horizontal!-Supplied Strap. Get an aftermarket. You do not want to be a walking billboard for Sony or target for thieves.-Battery. You will need a spare if you are shooting all day. Lots of electronics going on.-You can leave a tripod quick connect on the base and still change battery and memory.The BAD...and there is quibbling bad.1) The instruction manual is rubbish. It took me 10 minutes to find the IR remote control setting. And so on. Tons of features, little explanations. So play with the camera. It has lots of great features.2) Missed shots. Misreads from time to time. But so does any camera in automatic mode.3) LCD - Totally useless in daylight. Hence the Electronic Viewfinder is needed. Low to the ground shots in bright  sunlight requires belly crawls like with a DSLR. IT is not just Sony, most all LCD screens are useless in bright sun.4) Lag between the electronic viewfinder and real time movement. Yes is exists as in any electric viewfinder camera and it can be annoying taking pictures of fast moving objects, like children who move faster than rocket ships. But again it is a mirror-less camera, not a SLR.5) Video. Like all non single purpose video cameras,you will not get the silky smooth capture when walking and talking. But if you are standing still the video quality is typical Sony - excellent. Sound is so, so and wind is obvious.6) Bokah - sometimes great, sometimes really bad. Depends on f stop and background. Again these are kit lenses, not $2000 pro pieces of glass!7) Panorama. Works great AFTER you have have some practice. Watch out for exposure. Be sure iso is on automatic or manually set for extreme lighting conditions.8) Sony still over processes pictures. What that means is when you enlarge the photo, you get a rate of pixelation edge jaggedness and picture smear/ rough edges quicker than on a Canon or Nikon crop sensor camera SLR of same MP size.Summary - more great than 'not good'.Value - excellent.No I will not sell off my Nikon system for only this camera.It is the camera I will grab for walking around all day with and getting high quality photos for viewing on an HD Computer Monitor or Large Screen TV.Yes I would buy it again without hesitation and have already recommended it to friends.I rate the A6000 as a great 'everyday' substitute for a bulky DSLR. It is NOT however a camera for semi/ pro work as Sony and some 'paid' reviewers say.I will not put an adapter on it for my expensive lenses. Why you ask? If I did that, with the dramatic added weight, I would be better off with my bulkier, now only slightly heavier superior performing DSLR.I rate the A6000 a 90% for what it is - a neat, crop sensor'd body, great build, lightweight, fast focusing, quick shuttered, quality shooter.No more lead weight to carry around for everyday walk around use.Comment for future products:I would like to see short,compact zoom lenses that are small and hit F2.8 constant aperture.I love this camera.You will too.", "Date": "May 25, 2014"}, {"Title": "Excellent Upgrade from the NEX 5R series!", "Author": "Y. Wang", "ReviewID": "R2LYY7A8PPACWL", "Overall": "5.0", "Content": "I realize this is a replacement for the NEX 6/7 but I've never owned any of those so I cannot tell you the main differences between them. I have, however upgraded from my NEX 5R. I must say I am extremely satisfied with my purchase.Pros:Price. Compared to the NEX 6's release price of $750(body) and $900(with 16-50 kit lens), the a6000 is $650(body) and $800(with 16-50 kit lens). This is a full $100 cheaper and for a significant better camera with better features.Better ISO options. The NEX 5 line had ISO settings that doubled, 100, 200, 400, 800, 1600, 3200, etc. The a6000 has a LOT more options, 100, 125, 160, 200, etc. This is incredibly useful. While the difference between 100 and 160 is very low, at the higher ranges where the old NEX cameras would jump from ISO 1600 to 3200, having a lot more ISO settings in between is extremely useful.Auto-ISO. Auto ISO sets the ISO for you automatically depending on your exposure and the light scale. Even in manual mode. For example, set your exposure at 1/60 and the camera will pick out the right ISO for you automatically so that your light scale is always balanced. It almost defeats the purpose of manual shooting but with a plethora of ISO choices (see above), I can see how this would come out really handy in a pinch when you need the shot right away.Multiframe ISO Noise Reduction. This is so far my favorite feature. Multiframe ISO Noise Reduction basically shoots off 3 shots in quick sequence and compiles them into one photo. Kinda like HDR. The results of this feature are night and day. Whereas my regular ISO 3200 shots look like a grainy rainbow colored hot mess, my Multi NR 3200 ISO shots look like my ISO 800 shots. That said, the feature does seem to do a lot of noise correction and smoothing of textures. Zoomed in, a lot of textures look flat and uniform when they shouldn't be. However it's still a significant upgrade than normal shooting.FAST. Both in focus and continuous shooting. This camera locks on fast with phase and contrast detection. The NEX line were always slow with focus. Especially in low light circumstances. The difference now is noticeably better. Also this camera shoots continuously like machine guns fire bullets. I normally shoot on continuous mode (hold shutter down) so not to miss a shot and pick out the best one later. With this camera I need to be wary of how long I hold it down for because after a few seconds I have 20+ photos in my camera that are all essentially the same. I've tried and I can't shoot less than 3 shots with one push of the shutter. If you shoot moving objects you can almost make a flip-book or stop motion movie with this. Amazing speed.Viewfinder. This is great. The viewfinder helps conserve battery life by making you less reliant on the LCD. There is an eye detector so when you raise your eye to the viewfinder the LCD screen shuts off. Also when you shoot with a viewfinder the camera is closer to your body and  you get steadier shots.Better menus. The menus for this camera are SO MUCH better than the previous NEX menus. I'm used to the old ones now, but even still I sometimes had difficulty finding one obscure setting that I needed in the sea of menus. The new setting is a lot more logical.Battery life. The a6000 actually comes with a new updated battery. It's black and has different markings even though the size and port is the same as the previous. The specifications for the a6000 says that it's 420 shots whereas the old NEX 5R and 6 says 360. When looking at the battery, the new battery actually looks like it has less mah but is supposed to perform longer. I'm not sure how it works as I haven't gone through a whole charge/depletion cycle yet but so far I don't have any reason to doubt it.Construction. Overall the camera seems well built and sturdy. The original NEX 5 was good. The 5R was slightly thinner but seemed to be made of a lighter material and felt more flimsy and plastic. This one feels very good and solid. The old cover for the USB and hdmi ports were rubber and annoying is now a plastic flip door.Cons.Wireless. The NEX 5R also had wireless capabilities with wireless upload onto your computer and turning the camera into a wireless router so your smartphone can connect to it and act as a remote/remote viewer. The previous NEX cameras were criticized for having slow wireless and generally being a pain to initiate. I don't see much has changed with the a6000. Everything works but it's still slow and a PITA to start up.Battery life. Even though I mentioned that the battery life has improved somewhat, overall the battery life on all mirrorless cameras are still abysmal. The problem is, without a reflex mirror, whenever the camera is on, the sensor is on. The sensor not only takes the photos, it lets you \"see\" through the viewfinder or LCD. With regular SLRs, the reflex mirror angles the view into the purely optical viewfinder and only turns on the sensor during exposures. So a SLR will last you several days without charge with normal use, this wont last you the full day. I always keep a spare battery and an external charger around. If you buy this camera (or any other mirrorless camera), I suggest you do the same.USB cable. I think this is pretty trivial but annoys me severely. The USB charging/transfer cable that was included with this camera is ridiculously short. I guess this is a cost-saving ploy by Sony but I honestly don't know how much money they save by shaving a few inches off a USB cable. The new cable is several inches shorter than my old NEX 5R and it cannot reach the floor between my power strip and my standard height night stand.Overall this is a fantastic camera. I am very happy with my purchase. If you are hunting for a mirrorless camera, I'd say the two best out there are the Fuji X series or the Sony NEX/a3000/5000/6000/a7 line of cameras. The a6000 is simply the best in the entire Sony APSC mirrorless line.", "Date": "May 8, 2014"}, {"Title": "A6000 vs NEX-6... This is a great camera! Just one flaw....", "Author": "PR", "ReviewID": "RCH5W6J7N7XHG", "Overall": "4.0", "Content": "This is an amazing camera and has some great features. Some people may be wondering if it's worth buying this, or the discounted NEX-6. In short, it's worth the upgrade for the following reasons:PROS/REASONS TO BUY OVER THE NEX-6:1. It has a better OLED viewfinder (yes the NEX-6 had a higher resolution viewfinder, but the difference is not noticeable, and the colours are better in the new viewfinder... So overall it's better in the A6000)2. It has a much better menu layout and quick access to change settings via the fn button. With one click, you can access options like white balance, af points, ISO, etc.... If nothing else, the menu update is worth the upgrade.3. It's 24 megapixel sensor allows higher detailed images. Some might ask, but doesn't this increase the noise? The short answer: No. The noise control is better than the NEX-6.4. The Bionz X processor is better and faster. It is just overall faster, and leads to quicker processing and faster overall performance, especially when it comes to the autofocus system.5. The AF is fast! And I mean FAST!!!!!CONS:1. The A6000 has a serious flaw as did it's predecessor (the nex-6). I'm sure Sony knows about this problem, but didn't do anything to fix it. And that is the fact that it does not allow you to use the bracketing feature in conjunction with the self-timer. It's either one or the other. For example, if you set up you camera on a tripod, and want to take a 3 image bracketed sequence (say for an HDR image), then you cannot set the timer to fire off 3 consecutive shots in bracketing mode. Yes you can fire off 3 regular shots with the self-timer, but not 3 bracketed shots. You have to press the shutter button three times manually. This in turn can introduce camera shake. The bracketing function and self-timer are in the same menu, so it's either one or the other. Sony really needs to fix this about the camera and it's a serious flaw.....2. The A6000 also does not have an in-built microphone input, nor does it have a headphone line out for monitoring audio. If this camera is meant to replace the NEX 7 and NEX 6, then it SHOULD have it! A serious blunder on Sony's part.Overall, the Sony A6000 is a fantastic camera, and could have been perfect. It is worth buying over the NEX-6 without a doubt. Even if the NEX 6 drops to below $400 with the 16-50 lens, I would still recommend purchasing the A6000 over it. I'm a pro photographer, and I would highly recommend this camera for those who want something light to take travelling, but don't want to compromise on image quality. Sony really created something good, and nearly perfect.... I didn't mention all of the reasons for why I like this camera above, but only the most significant when comparing it to the NEX-6. But keep in mind, there are a multitude of features that will please most users.", "Date": "May 6, 2014"}, {"Title": "Highly recommended as an upgrade from NEX-6", "Author": "F.A.H.", "ReviewID": "R2L1LDEUJY31U7", "Overall": "5.0", "Content": "Compared to the NEX-6, from which I just upgraded, the a6000 has (1) much faster, more accurate AF (works as advertised!); (2) menus that are much easier and faster to navigate; (3) more customizable buttons; (4) auto ISO in manual mode; (5) more resolution (allowing for more cropping); (6) more pleasant noise at high ISO due to the smaller pixels (at normal image sizes, noise looks like film grain); and (7) a  more solid, tighter \"feel.\"There are other improvements, but these are the ones most important to me.Highly recommended as an upgrade from NEX-6!", "Date": "April 25, 2014"}, {"Title": "Sony Alpha 6000 is an amazing camera for a great price", "Author": "Michael B", "ReviewID": "R1TY8GTCZLYWF2", "Overall": "5.0", "Content": "I had the Sony NEX 5T before this camera so this review is comparing that camera to the a6000.  I bought the a6000 to fix issues I had shooting the NEX 5T.Main issue fixed with the a6000 vs 5T.  Infra-red remote control works in all shooting modes as well as the apps.  This is major for things like time lapse and astrophotography, nevermind doing multi-frame shots of landscapes for HDR, etc.Another issue that is totally fixed is being able to use multi-frame noise reduction in normal shooting modes and/or apps.  You can now, for instance, trigger multi-frame noise reduction WHEN in the Time Lapse app.The menus are different than the NEX series, more professional styled like other DSLR's.  I don't really like one version over the other, both are perfectly usable if you get used to them.The a6000 destroys the 5T in autofocus, it is far far faster and more accurate.  I love the range-finder OLED and use it almost all the time outside when I cannot see the LCD screen.I would have preferred a touch screen, I have no idea why Sony doesn't have one on this model.  Other niggles are preference based and can be worked around.Other reviews do not like the setup for flexible spot selection focus.  I found it perfectly usable, once you are in flexible spot focus mode, you just tap the center button (in the selection joystick) and that pops you back into moving the selection spot around.  Fine with me.Low light capabilities seem about the same as the NEX 5T with the exception of the extra megapixels.  Also the multi-frame noise reduction ISO setting works REALLY well for decreasing noise in those high ISO shots.  I found almost no noise at ISO 6400 1:1 zoomed in in multi-frame noise reduction mode.The a6000 seems to have approx the same color calibration as the NEX series with a few more color modes available.  You can for instance get closer to Nikon or Canon colors using the new selection modes than before.For people that need an audio line-in,  I read Sony has a hot-shoe compatible bluetooth audio input and that seems like a nice compromise.All in all this camera is a huge upgrade to the NEX 5T with the small exception of no touch screen.", "Date": "May 7, 2014"}, {"Title": "Great hardware for the price. Only minor annoyances", "Author": "Tom N", "ReviewID": "RGFBBFYE9JK5R", "Overall": "5.0", "Content": "Pros:  - Fast, fast, fast auto focus with the right lens.  - GREAT hardware and a solid value.  - 24.3 MP of details in a tiny camera that you can take everywhere it's so small.  - Object tracking based focus is amazing. (see example video [ vimeo.com/93195590 ])  - Despite other reviews, button and control layout is reasonable.  - Good ISO range with auto-ISO having bounds (e.g. you can say max iso is 3600)  - 11fps burst mode with auto-focus between shots is cool.Cons:  - Eyepiece activation is too sensitive.  Lots of things trick it into thinking you are using the eyepiece... which turns off the LCD for a second. Very annoying.  - Shutter is louder than you'd expect for a mirrorless.  - Battery hungry.  Toggling airplane mode helps, but no way to create a custom button action to do this.  - Wish there was better control over focus in videos (e.g. when in video mode, half press would cause refocus).Warnings:  - Sony is clearly trying to create a \"marketplace\" for camera apps. Expect to spend another $30+ to get features after you buy the camera. Most other cameras come with things like remote triggers, timelapse, multi-frame noise reductions, etc. The A6000 (and probably future Sony cameras) do not. Sony expects you to pay extra for them.  - Sony has a public API to develop your own apps, but it is extremely limited for this camera. [ developer.sony.com/develop/cameras/ ]Don't expect any really cool add-on Apps. The camera doesn't support it. For example, there are no controls over: focusing, exposure, shutter speed, ISO, white balance, etc. None.Things to buy with this camera:  - Get a screen protector immediately.  - Buy extra batteries and an external charger at the same time. Same battery as Sony NEX line so easily available.  - Get a FAST UHS-1 SDXC Flash card. The camera needs it and uses it.", "Date": "April 29, 2014"}, {"Title": "the camera I've been waiting for", "Author": "28mtnfisher", "ReviewID": "R19F65SQPO46II", "Overall": "5.0", "Content": "I have been waiting ever since the panasonic g1 came out several years ago to see how these mirrorless cameras would develop.  I knew this had to be the future of photography.  Initial reports made me hold off on buying one because there were just too many tradeoffs from a conventional dslr.  Last year I finally decided to take the plunge and bought the entry level sony nex f3.  The image quality was great.  The downsides were with the focus.  It was too slow and often slightly off.  I also was not a fan of the menu system.  I wished it had a few more manual controls or custom buttons.  After my experience with the f3 I decided that I would wait until Sony got better with the focusing before I upgraded.When I read about the focus and menu improvements sony made with the a6000, I decided to give it a try.  I paired this new body with the zeiss 16-70 lens.  What an improvement!  The focusing is dramatically faster and more accurate.  I love the fact that this camera has the ability to change the size of the focus point in spot focus.  Using the small point, the focus is much more consistently correct.  I took some close-up shots of some flowers last week, and it got the right spot in focus on at least 9 out of 10 shots, which is pretty good when I was working with a depth of field less than an inch.  The f3 used to give me fits trying to get just the right spot in focus.Now the couple negatives...The focus in low light is still slow.  If it can find a focus point, it does so fairly quickly with less hunting than the f3 did.  If it can't find focus, it tries once and then quits.  You have to half-press again to get it to try again.  Hopefully in the next generation of this camera they will solve this problem.  It is still very useable though.The startup is too slow.  I don't know why it takes so long to start up.  You would think that as fast as this camera is it would start up quickly.  However, it takes longer to start than my year old entry level f3.  Hopefully they will issue a firmware update soon to improve this.  I read about it in a couple reviews before I bought the camera, but I figured it was due to the power zoom lens.  I am not using the power zoom lens, so it really is the camera.Overall, the quality of pics with the zeiss 16-70 lens attached is stunning.  I am super happy with the results and I finally feel like I have a digital camera in my hands that equals or surpasses my old Nikon film camera.", "Date": "May 20, 2014"}, {"Title": "Light, compact, full-featured, excellent quality - no lens hood", "Author": "pjr", "ReviewID": "R9ILY6JYGFY2Z", "Overall": "5.0", "Content": "The Sony a6000 is a joy to use. I'm used to lugging a Canon 5D Mk II with a 24-105 and a 100-400. The a6000 with the 16-50 lens fits in my shirt pocket! NOTE: the 16-50 kit lens does NOT come with a lens hood. A hood would be nice for protection. Not sure I can find one that doesn't cause vignetting on wider angles. The image quality seems to be top-notch. The only minor annoyance is that the Sony ARW (raw) files are readable only with Adobe Lightroom 5 on my Mac. Mac's Preview, QuickLook, Photoshop - none can open the ARW files. Oh, I also got the Sony SELP-18200 (18-200 mm) lens. Although it's a compact lens, it still makes the a6000 look like a bandaid on the back of it.", "Date": "May 14, 2014"}, {"Title": "The BEST!", "Author": "Roger D.", "ReviewID": "R1FHIIJYIVMROZ", "Overall": "5.0", "Content": "I have been taking photos for over 30 years with SLR cameras (Nikon, Pentax, Samsung), I am not an expert, but I am good. I sold all my previous camera to get a smaller gear that I will carry all the time with me. God, I am so happy with the Sony a6000: photos quality is excellent, and what is great all of them are good to keep. Don't look any further, this is the one.", "Date": "May 27, 2014"}, {"Title": "Excellent camera, minor quibbles", "Author": "John McFarlane", "ReviewID": "RFUC8RS1RY5SB", "Overall": "5.0", "Content": "After hearing about the a6000 I finally decided to switch from DSLR to mirrorless, and I'm happy that I've made this switch. That said, there are a few things I had to get used to and some minor issues. I've read every review there is prior to buying the a6000 so will focus on things I didn't hear much about. As a point of comparison, I switched from an entry level Canon DSLR.Image and video quality - it's excellent, very sharp, rich colors. This is a significant step up from my older DSLR. A slight disappointment is the image quality under low light, although this is not the camera's strength. Still it's better than my 6 yr old canon DSLR which took horrendous pictures in low light. Another minor quibble is the autofocus when taking videos - when filming my kids who move a lot, it doesn't adjust quickly enough so there is some blur here and there.Lens: So far I've just used the standard kit lens. The zoom isn't quite as smooth as with my DSLR. I guess this is the result of the very compact lens. Also, it is kind of noisy when zooming (a potential issue for when you're filming).Feel: It was a nice surprise to see the a6000 looks and feels like a solid, high quality camera considering it's relatively compact size. It has a good grip for taking pictures. I did have to get used to the small size of the lens, I was used to having more to hold on to with the bigger DSLR lens (using the viewfinder).Controls: So far I find it very user friendly. I like that there's a button to go directly to recording in video mode at the side of the camera.Wifi: To get it to work I have to connect via the USB cable each time, which defeats the purpose. Maybe it's something specific to my computer as I haven't seen any other reports related to this.LCD screen: No complaints, coming from an older DSLR it's fantastic. It's not touchscreen though as many have noted. I thought you'd be able to flip it around to take self portraits but it doesn't flip all the way, just at an angle to take pictures when holding the camera above or below you.All in all an excellent camera in a small package, a recommended upgrade even when switching from an entry level DSLR. For videos, the Canon 7D is probably better - which I was also considering. But for such a portable camera, it doesn't get much better than this.", "Date": "May 20, 2014"}, {"Title": "Game-Changer for Point And Shoot - Camera Overheated Shooting Video.", "Author": "Doc1 \"doc\"", "ReviewID": "R1UEBB6FNO37OE", "Overall": "4.0", "Content": "There have been a lot of very technical reviews written on this camera body. I do not disagree with any of them. There are pros, cons and quirks to this product.From my perspective, this is the first truly \"serious\" camera from a point-and-shoot perspective. I shot about 1400 pictures over the course of a 5-day trip recently with the Sony Alpha a6000. I moved in between the 16-50mm and a couple prime lenses. I purposely left my DSLR at home.My results varied widely as far as image quality outcome. In good lighting, the a6000 is just as fast as a DSLR. In tricky lighting, the a6000 shows some of it's issues. Switching to manual in various modes was a bit of a pain, but I think it can be overcome through more trial and error, setting up some macros and just more experience. I will say that the 16-50 lens provided is crap compared to the technology in the a6000 body. My shots with prime lens were far better. I have to think that with a higher quality zoom, this camera would have produced much better images.Video-wise, I had the camera overheat after 8:43 of a 1080p video. The video quality was definitely there, very nice. Audio was suitable. But having the camera overheat was a major bummer. We were in the sun, about 78 degrees. Not super hot out. So throwing a thermal in under 9mins is bad in my opinion.I do think that in many cases, this is a better go-to camera than a DSLR. However, when lighting gets tricky in an uncontrolled environment, that is when the flexibility of the DSLR shines over the a6000. Nonetheless, the Alpha a6000 is a view into what DSLR's will morph into in the future. Tech is only getting better. In another five years, I am not sure that the traditional model DSLR will be needed.", "Date": "May 20, 2014"}, {"Title": "One of the best pocket SLR's out there!", "Author": "AW", "ReviewID": "R1LC64SDI0H567", "Overall": "5.0", "Content": "I work at a camera store, so I was lucky enough to snag one of these before we sold out. I have a feeling I'll be selling a lot of these. Here's what I love about it.Pros: 11fps shooting for up to 6 seconds before the buffer slows down, or half that with raw+jpeg.Very impressive auto focus that never seems to be searching or fishing around for a focus point, it just jumps to it.Full size 24mp APSC sensor, as big as a full size SLRGreat video quality, and up to 60fps video in 1080p for quality slow-motion shots. Sound is clear and in stereo.Good low-light handling.Very clear digital viewfinder looks almost as good as the screen.Optional zebra stripes for overexposure, and focus peaking.Size is small enough that I want to carry it everywhere, but hefty enough to feel like a real camera (almost a pound with a lens).Minor cons: Not a con, but definitely counter-intuitive; the viewfinder takes more power than the screen. Normally I conserve power by using the viewfinder, but it is actually rated for fewer shots than using the screen in the manual.The battery life is pretty short, but about what I'd expect for a camera with no optical viewfinder.Overall, this camera is a perfect fit for me. It balances size and quality perfectly, not compromising on either, and has all the features I am used to from previous cameras I've owned (Nikon 3200, Canon 7D) in a smaller package that I'm more comfortable carrying around. After all, \"the best camera is the one that's with you!\"", "Date": "April 22, 2014"}, {"Title": "Great performance for the price.", "Author": "Scott Ko", "ReviewID": "R3GLPQ9DCAL6RN", "Overall": "4.0", "Content": "I've had the camera a few weeks and have had some time to play around with it before reviewing. I'll start by saying the camera seems pretty great for someone looking to get more into photography (as i am). I've looked at a lot of mirrorless cameras and you get a lot for what you're paying with this camera. I previously owned a Nex 5n and I'd say this is better in every possible way except that it's a bit larger in dimensions.Pros -Focuses quick and accurate in good lightThe 2 custom buttons and the Fn button basically eliminate the need to dig through menus once you get it setupEVF is amazing in use.. although people have complaints on the technical specsFinally a hot shoeCons -Low light focus seems a little improved, but still lags (I use the 50 1.8 mostly)Ergonomics of the two dials (they could have been swapped for easier handling)No Touchscreen (tap to select focus point was such a convenience)A bit slow in use (startup is super slow, and clearing the picture buffer after a burst)A great buy. I'm not sure there is anything in particular that distinguishes it over similar olympus or fuji cameras except price for overall functionality.", "Date": "May 14, 2014"}, {"Title": "Really nice upgrade from a dSLR...", "Author": "Bret Pearson", "ReviewID": "R26IOX655GCZW4", "Overall": "5.0", "Content": "Still in progress on getting used to this bad boy coming from a Nikon dSLR.  First, the picture quality is outstanding with the stock lens.  Compared to my Nikon, the size is amazing too.  I think it is pocketable in cargo shorts with a pancake lens.  The on-to-shoot time is a little slower than your average dSLR, but the autofocus is much faster and works fantastically.  Definitely like a point and shoot, but with an image quality that rivals anything I've seen as a prosumer.  Will update when I get a f2.8 prime lens and monkey with the macro settings more.", "Date": "May 26, 2014"}, {"Title": "A brilliant camera and in many ways a step above the NEX 7", "Author": "New Orleans 1", "ReviewID": "R2D8G6ASU80XYQ", "Overall": "5.0", "Content": "I bought this camera the day it was introduced, took it out of the box, took a couple of shots to ensure it worked and threw it in my bag.  It has now spent weeks bouncing around the back of a truck on dirt roads across Kenya.  I've had an NEX 7 for just over 2 years and have been very happy with the NEX 7... until the A6000.  I intended the A6000 to be a second body on the trip and expected to use the NEX 7 as the primary camera.  I also recently picked up a Sony FE 70-200 f4 G in Japan which made the trip to Kenya.  I quickly found that the Sony 70-200 lens on the A6000 was just brilliant!  Its ability to focus is fast, I mean really fast.  Good clean shots were so much easier/faster than the NEX 7.  The NEX 7 found itself relegated to a secondary roll with one of my Zeiss lenses.  The view finder on the A6000 was clear and sharp and I actually prefer it to the NEX 7 view finder.  The A6000 has an easier to use menu system which is also superior to the NEX 7.  I found only one area where the NEX 7 consistently out performed the A6000, colorful sunsets.  The A6000 just did not catch the true colors and the NEX 7 did.  I tried a variety of settings and options with the A6000 but the NEX consistently produced the better image at sunset.  When the A6000 is coupled with some good glass it produces an outstanding image and is very fast too.  I am extremely pleased with this camera.", "Date": "June 3, 2014"}, {"Title": "Features not mentioned in other reviews... (& vs. NEX-6)", "Author": "MariaSmiles", "ReviewID": "R3SXYOU62VETOF", "Overall": "4.0", "Content": "I've owned the NEX-6 for about six months now and have been fairly happy. Of course, when the \"upgrade\" came out, I had to have it (after I did my research, of course!). So, now I have both (and intend to keep both, as I always like to have a 'back-up' camera handy).For those of you looking for a review on image quality and other points of usability, well, I can tell you that there are dozens (or more) excellent reviews out there that already cover that. I read and viewed many of them before making the decision to buy and here are a few things that those reviews omitted:THE GRIP:- the grip on the a6000 is not as nice (for me) as the NEX-6. Like a good woman, the NEX-6 was \"curvy\" in all the right places, offering superb grip when dancing or running around (as I often do, camera-in-hand; yes, I always use a wrist strap, just in case). The a6000, despite what I've seen in my research, seems to have a shallower grip (due to a thicker body/mid-section). If you have even moderately long nails, you will find the need to trim them so that you can get the same grip you may be used to on the NEX6.- the bottom (where the hands' \"moon\" spot, in palmistry, sits) seems a bit \"edgier/sharper\" and doesn't nestle into that part of the hand as easily.- the rear thumbgrip on the a6000 is more vertical than the more organic \"diagonal\" of the NEX6. Ergo, the thumb has to be in a tighter, more upright angle to the rest of the hand, in order to have a more fully supported shot. I prefer the more \"C\" shaped gripping style of the NEX6, again.- the top rear edge of the a6000 is at a 90-degree angle, with two levels. On the NEX-6, this is a smooth, beveled edge (more like a 45-degree angle). Sometimes, I have to put my thumb in non-optimal places on the camera, to get just the right angle. On the NEX-6, there were quite a few places where this was comfortable. On the a6000, there's really only one (the default) and it's still not as comfortable as the NEX6. :(BUTTONRY/DO-HICKEYS:- my main pet peeve in this category is the On-Off switch. I didn't like it on the NEX6 and what's worse, they switched the order of On and Off on the a6000, but used the same \"push/pull in the opposite direction as what you read on the dial\" format! Maybe my brain is odd, but if On is left and Off is written to the right of that, my brain would be happiest with a switch that MOVED left for On and right for off (or vice-versa, as long as it's logical.) The good news is that the text is now white on black, versus white on champagne/silver on the NEX6, so it's a little easier to read.- I also really liked the smoothness and shininess of the NEX6 power switch/shutter release. It left no indent on my finger during extended shooting sessions and, gave me a soft spot for my index finger to make contact when not \"pressing\" buttons. And, when letting someone else take your photo, like when at a party or when travelling, it's easier for new/temporary users to see the shiny, champagne-colored button than the black, matchy-matchy button. Especially when you have to answer questions like \"what do I push?\" and it can be confused with other 'black buttons' in that area. Also, the a6000 power/shutter button flat surface is smaller and there's a \"groove\" around it which I fear will collect grime, over time (despite my very particular care-taking of my 'stuff')- speaking of smooth and shiny colors, the MI (multi-interface) shoe and lens mount were both finished in a 'dull' silver on my otherwise black NEX-6. These are both black on my black a6000. The teeny ridges on the lens mount are also less pronounced on the a6000. I generally don't see it, though, as my elastic strap lens cap keeper sits there and covers some of it. I kinda liked having the silver accents, though, as some of my lenses are silver and it integrates them a bit better.- the MI shoe on the NEX-6 came with a protective insert, which I thought was a very smart idea (protection & better-looking). In fact, I put them on all my \"shoe'ed\" cameras. The a6000 does NOT come with this. The NEX-6 one works in either camera. If you don't have one, I recommend it, as there are some sensitive contacts in that MI shoe. They are a few dollars on ebay (surely, cheap enough - especially in bulk - for Sony to include one with a ~$700 camera, but who knows...?)- the screen - ok, Sony, you only give us image capture ratios of 3:2 or 16:9 to choose from and the screen is 16:9. I get it, there's the black bars alongside the photo for settings icons (in that one display mode). Whatever. But, why do you not center the display part of the screen in the non-display part of the screen?? And, why move it to the opposite side in the a6000? Oh, so you have to make (and we have to buy) new screen protectors (if we're loyal enough to buy them from you in the first place, that is). Um, ok. I happen to have an extra one here and it looks like I'll be putting it on upside-down, to save the $10-15 from buying a new one (if I could even find one in stock, at this point, anywhere). Please center it next time. It's nice to have a centered point-of-reference when composing via the LCD screen.CONNECTIVITY:- I currently have no use for NFC (still using my trusty old E72 nokia {RIP Symbian s60} & an ipod that won't upgrade to iOS7). I know that NFC isn't 'activated' until another NFC-enabled device 'bumps' it, but I'd like to turn it off completely. I've searched the in-camera menu and the manual and have not found a way to \"deactivate\" it. Selecting NFC in the the menu just keeps returning me back to the menu page, to select it again. I'd rather not have it using battery power (however minimal) while it's waiting to be bumped with another NFC device (nor, do I want yet more \"waves\" pulsating through my hand as I carry my camera all day.) If it serves a purpose in my life, I'm fine with that, but this currently does not.- they've swapped the HDMI port/jack from a mini (NEX-6), to a mirco (a6000). Just fyi, in case you need to buy a new cable (like I do). This may confuse some users, as the ports now look very similar. USB still at the top, near the Charge light. And, I'm one of the people who love the in-camera USB charging. (I also bought an external wall/car charger, as I always carry a second battery - LOVE that I can charge two batteries at the same time OR, carry a 'stick charge box' thingie in my bag and recharge it during down time at an event, regardless of access to an outlet. So cool, sony!)- the Wi-Fi has the WPS option, but I could not get it to work (I have, on other devices, tho; yet, I do have a somewhat old router, c.2011). YMMV. Entering the SSID & PWD isn't a huge problem, and you only need to do it once. Navigating the 'keyboard' isn't super-easy, but it works. Same as the NEX-6. It does ask two questions that aren't addressed in the manual (or via the internet, as far as I've found): IP setting and Priority.MENU:- yes, the menu on the a6000 is much improved! It's not perfect, but it's got a better (or, existent!) hierarchy, so if you want, you can remember X > Y > Z > 1,2,3... vs. X > scroll, scroll, scroll, loop, scroll, scroll, scroll back > Z > 1,2,3... of course, smart planning of your several customizable buttons, as mentioned in other reviews, can significantly reduce 'searching', as well.- if you liked the old \"tiled\" style - you can turn that option on (and it's better-looking now). But, once you choose one of 6 main categories, you're right back into the default a6000 menu. I do kinda like this option (it's pretty); however, with the other option, it seems to remember what setting you were on and returns to it, after you leave the menu. I did not see an option to customize this behavior, as I've seen in other cameras. I'm ok with it returning to last point, as navigating the tabs in order to change other settings is fairly easy.- the 'descriptions' of the mode-dial modes all now have a background image, depicting an example of what each might be used for (waterfalls for shutter priority, fireworks for manual, etc). This makes it a bit easier to remember, and maybe even use, for beginning enthusiasts, but can also make the text a bit harder to read.- the SCN modes are all the same, but the animated on-screen 'dial' is on the left now, (rather than on the right, as with the NEX-6). There are also navigation choices on the bottom, which the NEX-6 didn't have (self-explanatory, but still helpful to have). In addition, the selection of SCN modes rolls in the opposite direction as what you may be used to on the NEX6 ('right' now goes down the list, instead of selecting up the list). I somewhat prefer the new way, as, for the first 5 modes, the highlight is what moves and not the menu choices, (which got dizzying after a while on the NEX-6). They will eventually scroll on the a6000 as well, however, as you move further down/up the list. They are also in a slightly different order, now. And, while the font size is larger, it seems still hard to read. The background images are mostly the same, but have been \"punched up\" and cropped a bit. My old panasonic was great in this aspect, as it showed a chart of icons that could be quickly navigated via up/down/left/right. If I needed more info/description on a less-used mode, there was a button for that. Otherwise, I had a handy, easy chart that allowed me to find what I needed quickly (icons always in the same place), and i could discover new ones, along the way. Sony needs an update here, as there are many fewer icons and much more confusion. I'd welcome a fix to this in a Firmware update (with the option to keep it the old way, for those who've gotten used to it).So, despite the nits I've picked above, I plan to keep this camera as the \"important\" specs far outweigh these little issues listed. If they'd kept some of the ergonomics from the NEX-6 (not all, but some) and thought out a few things a little better, it'd be a 5-star camera. But, if it takes excellent pics and checks all your boxes, then maybe it WILL be a 5-star camera for you!I rely on reviews to help me make buying decisions. I hope this review helped you, too. :)", "Date": "June 6, 2014"}, {"Title": "Body worthy of attention", "Author": "Victor Rybin", "ReviewID": "R1061O1XN35LFN", "Overall": "5.0", "Content": "An excellent choice for beginners and experienced photographers.Very convenient, easy and ergonomic! Worthy continuation of high quality NEX series.Price decent home camera. SEL series lenses provide chic hybrid autofocus. Mounted laying on the network.Well integrated into the home network Wireless. Preservation and transmission of images very quickly.Put him SEL 35F18, quality very satisfied.", "Date": "June 2, 2014"}, {"Title": "Best of the Best", "Author": "Abhin", "ReviewID": "R3KJFUXIGR9JQV", "Overall": "5.0", "Content": "Hi All,I am enjoying this small but very very very  very powerful camera. I have taken 600 shots and really all of them are best I have ever seen from any other camera. I also Bought Nikon D3300 but its not so impressive as compared to this one. Its a  lightweight  camera but can take amazing picks . I will recommend this to all my  friends and family.Really I am loving it ..................... Feeling lucky that I got it on time .Thanks to Sony for this amazing Invention.", "Date": "June 7, 2014"}, {"Title": "All-in-all the A6000 camera is a positive step forward and a very good value.", "Author": "Michael P.", "ReviewID": "R23TNG0F743S3W", "Overall": "4.0", "Content": "The A6000 is a great value but I returned it. I had the camera for several days before returning it to the local Retail Buy store.Some strong points are:+The 11fps. Its AF is fast and its buffer allows you to shoot for a while. When finished you'll need to wait as the jpgs are written to the SD card, but only for 5-10 seconds. Great feature.+The EVF. Highlights do clip but only in high contrast situations. The refresh rate is excellent. It's like looking at a TV. One annoying thing...the default setting is 2 seconds to replay the image and the EVF experiences blackout. So if you want to shoot and then take another quick shot, you can't. This is easily fixed by turning OFF the image reply. Then the shot-to-shot times are then very fast, perfect.+The build. It seems well built. I wish the weather sealing was better and I wonder how long the flippy tilty screen will last - or at least the hinge. But it all seemed well constructed. The grip is good too.+Movie AF. Autofocus in movie mode was excellent - fast and accurate. When moving from a far to near subject it seems to delay slightly - I think that's an excellent implementation. My Olympic m43 cameras create footage that AFs quickly but is AF-ting often. The A6000 footage is less jumpy and looks smoother, more camcorder-like. The codecs are good too.+The flash. I thought the pictures taken with flash were well exposed and looked sharped. Very good job on this. However the AF frequently focused on the ears during portraits rather than the eye.+Good image processing.Some weak points are:-Inaccurate Stills AF. Most people won't notice but for a portrait to be technically correct the focus should be on the eye, usually the nearest eye. The face detect and ability to nail focus on portraits was weak. It was often focusing on the outline between the person's neck and background, or hair line or ear. If I got an eye in focus I was surprised. I was considering using MF to nail focus but the thought of being married to full-time MF was not what I wanted. Also I took some pictures through my mostly clean windshield of a tree. 1/3 of the time it focused on the windshield and not the tree. I was hoping Sony had conquered this with built-in PDAF but sometimes I felt like the CDAF and PDAF were at war and the camera wasn't sure which to use. Focusing on a little windshield smear is a CDAF mistake. Finally it failed the swing test. My old Nikon D3100 DSLR with center point AF can nail it, but the Sony A6000 cannot. Mirrorless cameras are almost ready to surpass DSLRs but not yet. Perhaps the GH4 and its DFD AF tech could be it.-AF in dim light. The AF illuminator helps a lot. On my m43 Olympus cameras it doesn't make a difference nor on my Nikon DSLR but it makes AF is a lot faster on the A6000 in dim light. Leave it on.-This is subjective but I feel like I'm holding a chunk of technology that takes pictures and not a camera. That is a pro and a con. I appreciate Sony moving camera tech forward but the system (the Nex and A6000) still seems like a bunch of different parts/ideas thrown together and not a 'shooters camera.' Maybe this is the perfect mom/family camera. For me, the art of creating a photo and how the camera and user integrate into the process felt distant. The menus are improved but how the physical buttons and digital settings integrate could continue to be improved. For one as the ISO settings are changed the screen doesn't display shutter speed. Olympic m43 cameras do and it is useful to know as I usually have a shutter speed target in mind when changing ISO. I change ISO until I get a certain shutter speed to nail the shot I want in the lighting conditions and scene I'm shooting. I think the A6000 is a huge improvement over the NEX cameras but there's more work to be done here.-The kit lens. It's a kit lens and best performs with a different lens. I used the kit lens and admit that perhaps focusing could be more accurate with a decent lens. I don't know if this is a lens function or AF system (I suspect it is) function. I'm not a fan of the kit lens image quality nor it's tiny lens cap but it is nicely compact.-No audio in port. Might not be a weak point since the zoom H1 synced in post will give much better results to any mic in port.The A6000 Neat Tricks:-Digital zoom, excellent panorama mode, NFC, wireless control/transfer and picture modes.After using this camera for a while I wondered why get it? Especially if you don't plan to use much telephoto, why not get the RX100? It has a hot shoe, EVF and built in flash. The RX100 mark III has a flash and EVF. I returned it because I don't shoot lots of telephoto and I am still looking for more accurate portrait AF. IF you are in the same situation then the RX100 M3 with the new faster lens could be a better option than the A6000 and the so-so kit lens. But if you need the hot shoe and will be frequently needing various lenses but won't be shooting a ton of portraits then the A6000 could be perfect for you. All-in-all the camera is a positive step forward and a very good value.Note: I realize that perhaps the lens was back focusing and needed micro-adjustment. Since I returned the camera I cannot verify. Not all shots were back focused just a high percentage of portraits. If anyone else can verify, please comment.", "Date": "June 3, 2014"}, {"Title": "Body worthy of attention", "Author": "Victor Rybin", "ReviewID": "R1061O1XN35LFN", "Overall": "5.0", "Content": "An excellent choice for beginners and experienced photographers.Very convenient, easy and ergonomic! Worthy continuation of high quality NEX series.Price decent home camera. SEL series lenses provide chic hybrid autofocus. Mounted laying on the network.Well integrated into the home network Wireless. Preservation and transmission of images very quickly.Put him SEL 35F18, quality very satisfied.", "Date": "June 2, 2014"}, {"Title": "Best there is in a compact SLR", "Author": "skyguy414 \"skyguy\"", "ReviewID": "R3K4RA0PN6IZZV", "Overall": "5.0", "Content": "I recently set out to find a good camera capable of DSLR quality images but in a compact, lightweight, and easy to carry around design. After carefully reviewing this camera as well as several others in its class, I settled on the a6000. I am pleased to say I love this camera. The quality of images is outstanding with the large sensor and high mega pixel count. The camera packs a lot of features to it. I love how fast the focus is and the amazing fps.My only major criticism of the camera:The lack of being able to use the auto bracket and timer mode simultaneously.  This is a serious flaw that Sony needs to address and hopefully will with a firmware upgrade. It is possible to get the results you need but in a harder work-around. So if you do a lot of HDR photography for example, this is something you will want to consider.I have a few non-serious nitpicks:-Some have criticized the battery life of the camera. While it could definitely be better, for the type of shooting I do (mostly travel photography and occasional high speed continuous shooting for action shots), I have been able to deal with it. But I also ordered two non-Sony brand batteries to use as back up which helps a lot. I recommend obtaining extra batteries to have on hand. The camera does feature a battery life meter on the display (indicated in %) to help you know when the battery is getting low.- The camera doesn't come with a body cap. While these are inexpensive and easy to obtain, it is nice to have a cap on hand, especially being a mirrorless camera where the sensor has nothing in front of it when a lens or cap is not attached.- A wall battery charger would have been nice. Instead, you must charge the battery via the camera and plug that in to the wall. Lame. Do yourself a favor and order separately, a wall charger and extra batteries for this camera. There are some non-Sony brand chargers/batteries on amazon you can get inexpensively. I ordered two non-Sony brand extra batteries and a wall charger bundled for about $25 and they work well and the charger also charges the real Sony battery.- Hopefully there will be more choices of Sony E mount lenses in the future. The ones I have used so far are good though.If rating this camera a 4.5 were an option, I would choose it. Only because of the issue of not being able to use the bracketing and using the timer simultaneously. But it wasn't enough to dock it a full point as it is something I am hopeful Sony can fix with firmware changes and is something I can live with if they don't.All in all, this camera has exceeded my expectations and is a joy to shoot with. You will especially love this camera if you don't want to carry a big heavy SLR around but still want excellent quality pictures. For my needs, this the best camera I have ever owned and I imagine it will last for a long time!", "Date": "June 2, 2014"}, {"Title": "Love this camera!", "Author": "Yuri Marlon", "ReviewID": "R8DKEP31QVLRK", "Overall": "5.0", "Content": "I bought this camera on May 11th of this year and I have been really blown away by its performance and light weight. I did some research before buying because I had been a happy user of a T4i for a couple of years and I didn't want to downgrade my experience (I gave that camera to my father and he's very happy). The thing is I wanted a lighter camera but with equal or better specifications than my T4i. This Sony A6000 is just what I expected: my images look sharp, well balanced, with an excelente dynamic range, it's very fast and it looks very good too. I had to invest in several e-mount lenses from Sony and they also have top notch quality. Very very happy.PS: I work in post with Lightroom 5, which natively supports the RAW files of this camera as the writing of this review. I also have Aperture but the RAW files need a little more work in that app (I'm sure Apple soon will give us the corresponding update).", "Date": "June 1, 2014"}, {"Title": "SONY a6000", "Author": "Mark A Sarazen", "ReviewID": "R12U9ZYQ0L1RHO", "Overall": "5.0", "Content": "What a great camera! My first DSLR was a Canon 10D - which I used for years until it unexpectedly hit the blacktop running. I was looking to purchase another DSLR until I saw an article by David Pogue about 'mirrorless' cameras. A real eyeopener. What a great camera this little wonder is. It's fast! And the colors and detail are stunning.", "Date": "May 29, 2014"}, {"Title": "love it", "Author": "G Smart", "ReviewID": "R1KH1Z2TJ8N5UB", "Overall": "5.0", "Content": "You can find plenty reviews and tests online, so I won't repeat them. Just a few personal observations.The sensor is absolutely great, but the jpeg engine is not, the noise reduction at high ISOs is terrible, turn it to OFF (though it's never off). Thus using RAW format at high ISO is quite important. Supplied software is junk. Either get an Adobe Lightroom, or the free Adobe DNG converter if you have some other software. The kit lens is poor, needs to be closed a couple stops to be useful, in my view the additional $150 for it is mostly wasted. You probably will want to buy a separate charger, charging via USB port is very inconvenient. The camera is made of hard plastic but it feels very solid. Sony is using a new slightly smaller and lighter battery in this camera. Unfortunately, they put a sticker on the battery, which causes the battery door to stick. Remove or cover it to prevent the battery door from sticking.Despite these issues the camera is really great, ergonomically very convenient, the AF is very quick, and the image quality is outstanding.", "Date": "May 26, 2014"}, {"Title": "So far so great!", "Author": "Carped8ta", "ReviewID": "R10FJN07LLXGFG", "Overall": "5.0", "Content": "Upgraded from a 2010 NEX 5 and love the viewfinder, and higher Rez  and my old lenses work fine, much faster focus.", "Date": "May 28, 2014"}, {"Title": "Small but powerfull.", "Author": "William Milhon", "ReviewID": "R2C08ZWG9L4WKS", "Overall": "5.0", "Content": "Oustandingly fast auto focus and burst performance. Auto focus slows down in low light, but still way better than I expected. Great WiFi and connectivity with smartphone app. I have been blown away with image quality. Video is pretty good again improved by the great auto focus. Very versatile little camera. Great for taking pics of kids.", "Date": "April 30, 2014"}, {"Title": "Poor battery life and kit lens", "Author": "GK", "ReviewID": "R3Q8PVD75CREWL", "Overall": "3.0", "Content": "I own a Nikon D7000 DSLR with 35mm f1.8 and 18-200mm lenses. I was looking for a compact system for international travel and after reading several reviews on different mirrorless cameras decided to purchase this A6000 with kit lens.It's been 5 days since I received and tried it out, have not shot more than 300 images in total, and battery fully depleted twice. After the first full charge, I got only 140 shots, I thought it could be because of going through menus and few other things like zoom, EVF, image review and so on. But after the second full charge, I turned off pre-AF, image review, reduced standby to 10 secs, set it to airplane mode used more of LCD rather than EVF, reduced the use of zoom.. it still did not help get much out of the battery. So, got around 150 images and 5 clips of video (6 mins in total) in around combined two hours of use. I noticed that the charge dropped by a percent every time I took a shot with flash on. This is very disappointing. The battery takes 4-5 hours of charging time and does not last even half that time of usage. I can buy additional batteries but concern is charging them at the same time. Not all places have multiple wall outlets where you could charge them at the same time. It does not make sense to disable some of features to save the battery life.I had my D7K for three years now and have been on vacations multiple times without extra battery pack. After shooting 300+ still and videos, image review, playback etc., at the end of the day there is still enough juice left in the battery. I know I cannot directly compare it with bigger battery, yet the numbers I see are nowhere close to the specs. I could have got a bad sample, don't know.Another big mistake was buying the kit lens, the images come out dull. I took few images and compared it with the images from my old P&S; (Sony DSC-W50) and with D7K+18-200mm, images from a6000 are too soft, just don't stand out. I have taken great images with my D7K and P&S; cameras, but have not succeeded yet on shooting one such with this camera.If you are planning on buying this camera, I suggest skip the kit lens and go with the 35mm f1.8 if you can afford it. I looked at buying this lens but it is too expensive. It is not that I cannot afford it, just can't justify the cost ($400 / $450) when I paid only couple hundred for the equivalent Nikon lens.The flash and selector wheel / enter button feels & sounds cheap plastic. If you use the power zoom during video, the screeching zoom noise is clearly audible. There are few minor annoyances, I can live with it.Rest of the camera is great, I really want to keep the camera. The low life of the battery is bothering me and the kit lens did not do any favor. I feel something is wrong with it, so planning on returning it. If I decide to keep the camera, I will buy the 35mm f1.8 and will sell the kit lens.", "Date": "June 1, 2014"}, {"Title": "Should be a great travel camera", "Author": "CaptBuddy", "ReviewID": "R1V0KQB7NVEJ04", "Overall": "4.0", "Content": "I like this camera. After just a few days, I'm still learning about using it, hence the 4 Star rating and not 5.I'm a \"advanced amateur\" photographer, with lots of experience with SLRs and DSLRs (mostly full frame), and a box full of P&S; cameras.I'm amazed at the complexity and sophistication in the A6000. There are lots of options and features, and I'm still weeding through the documentation (downloaded from Web) looking for the ones I want to use.The controls are easy to use, and fairly intuitive. The menu system is vast. The Wi-Fi is easy to use and works very well (set the auto off to a realistic duration). I have the 16mm-50mm kit lens and the 20mm f2.8; both are easy to use and images are clear and sharp.I wanted this camera for the ARW (Sony's RAW files) mode option. We're going to do a 500 mile walk across Spain and this is the camera I wanted to take. Last time we did this, I took a Canon T3i and while the images were great, the weight of the camera and accessories was a burden. The A6000 should be a better option.If ARW images were not important to me, I likely would have chosen a different camera. I've not found any included or downloadable ARW processor, so if you do not have access to the latest versions of Adobe-type software, you may not be able to process ARW images.I'm really impressed so far, and look forward to using it more. Especially the HD video, which seems to have some excellent DSLR features.The one thing that I do not like is the clutter on the screen. There is a ton of information, and I may or may not care about some of it (I shoot AV or Manual about 95% of the time). There is a stripped down display option and I have been using it.This is my first Sony camera. I'm finding that Sony has camera applications ($$) available for time-lapse, multi-exposure, etc. I'm going to try them and I hope they work as advertised.I would recommend this camera to intermediate or advanced photographers. It is a little advanced for the casual picture taker.", "Date": "May 2, 2014"}, {"Title": "Great Camera!", "Author": "Dausen", "ReviewID": "RPBBKU0SX63N5", "Overall": "5.0", "Content": "Absolutely love this camera! perfect size, great quality, fast autodidacts, good in low light, etc. i'd recommend it to anyone!", "Date": "May 14, 2014"}, {"Title": "Powerful little camera", "Author": "Sean", "ReviewID": "R2T7T56ZHX59X6", "Overall": "5.0", "Content": "After many years working with dslrs,  I finally decided to try mirrorless. This is an excellent little camera capable of truly stellar images.", "Date": "May 12, 2014"}, {"Title": "Nice camera with a few bummers.  Nice travel camera.", "Author": "Fred R. Jerina", "ReviewID": "R2ZLFEMLM8SF29", "Overall": "4.0", "Content": "I just received this camera from Amazon yesterday.  I am still evaluating it but there are a couple of points people should be aware of.  If you take raw format photos on this camera you will not be able to processing them with Adobe Photoshop Elements 10 (or maybe other versions).  I understand Elements 12 does processing the Sony ARW raw format files.  My Adobe Lightroom does work with the ARW files.  Unfortunately, these files have a cloudy tinge at the edges of the photos which to me is very bad.  I wish Sony can correct this with a firmware update.  The JPEGS files look fine.  Also, at the time of this review the detailed instruction manual is not yet available for this camera on-line.  This is bad planning on Sony's part if you ask me.  I do like the panorama shots this camera takes.  When taking the panorama shots the camera makes a loud machine gun sound which according to Sony Support cannot be silenced.  The videos look pretty good too.  Still need more time to evaluate yet the major features of the camera.Addition: Through Adobe Lightroom there is a \"camera correction\" option under the \"Develop\" tab that allowed me to select the Sony camera lens I am using.  By doing so the cloudy edges of the photo went away.  I just wish I didn't have to upgrade my Adobe Photoshop Elements to version 12 to work with the unique Sony ARW raw files.Although Sony has not released an owner's manual in the USA there is a European version that I came across and referencing.  Not sure it is 100% compatible but it seems to be.  Here is the link to it...[...]There is also a free Adobe DNG Converter that will convert the Sony ARW raw files to DNG raw files which the Adobe Photoshop Elements 10 can work with.  I have used it and it works just fine.  You can convert all ARW files in a specified folder to DNG type files.  It is an extra step but at least it works.Just got back from a three week trip to Ecuador.  Worked wonderfully.  The size is perfect for a small fanny pack I wore in front which was so accessible for photo taking. Bought a nice wrist strap for safety in using it.  The panorama mode was  great. Used the video mode a bit but the record button was awkward to use (caused jerky start and stops). Loved the auto HDR mode which worked great inside churches, etc.  Loved it for traveling about.", "Date": "April 23, 2014"}, {"Title": "NFC does not work", "Author": "Martin Gora", "ReviewID": "R1MEG8LTODV4OJ", "Overall": "1.0", "Content": "Very unhappy right now - one of the key functions of the camera is dead.I upgraded from Nex 5T to this model instead of Nex 6 because Nex 6 does not have NFC. With Nex 5, i was using NFC all the time to transfer pictures form camera to my phone via Sony PlayMemories app, it worked great and was very convenient when travelling.A6000 does have NFC, but the camera I've received was not able to connect to my phone - Sony Xperia Z2, which is newest flagship Sony smartphone - how funny is that! I was also not able to connect to my wife's HTC One, whereas my Nex 5T is connecting to both phones with no issues.So I went online and read reviews in Google Play store - a lot of users of Sony PlayMemories app is complaining about the same thing - they can't connect camera to the phone using NFC. The problem is not limited to particular phone model, but rather this is camera related issue - I've seen people with Samsung Galaxy S4, S5, Sony Xperia Z, Z1, Z2, Motorola, etc, being unable to connect after purchasing Sony Alpha A6000.I called Sony service, they kept me on the phone for an hour insinuating that I'm not able to connect to the camera because my NFC or Wi-Fi on the phone is disabled, but after multiple tests they made me do and when I demonstrated that I'm able to connect to the same phone with Sony Nex 5T, I was told that it is hardware problem that is quite common on this model.I'll return this camera to Amazon.", "Date": "June 2, 2014"}, {"Title": "WOW", "Author": "Alex", "ReviewID": "R17GEQHNRFMUNG", "Overall": "5.0", "Content": "A lot can and will be said about this fantastic camera, so I will keep it short. It is an amazing camera, as impressive as it gets, there is nothing in it's price range that can touch it. A great upgrade to the nex now alpha line. Performance is outstanding and the image quality in my opinion is best in class.", "Date": "April 29, 2014"}, {"Title": "Are there any photographers on staff?  An almost great camera with some questionable decisions.", "Author": "Andres \"AZC\"", "ReviewID": "R1K19KXLXOEMX6", "Overall": "3.0", "Content": "*****<REVISION>*****Since my original post below, it has been brought to my attention (thanks Pavel!) that buried in the menu system, there is a way to turn-off the additional superimposed ev compensation scale (please see comments to this post for instructions). This is wonderful news! However, it still begs the question as to why this is not the default setting with the viewfinder(you do after all have another ev compensation just below it...and this one does not block out the histogram).  Others have mentioned that this does not happen with the LCD.  I have not tested that as I typically compose with the viewfinder, so I will take you all at your word.So congratulations Sony for not letting us down on this issue after all.  The implementation could still be better, but I am happy to be wrong on this one.  But therein also lies my dilemma with Sony.  For example, this option, found within the Custom Settings menu is called \"Exposure Set Guide\".  Why not call it Exposure Compensation Scale or something a little more explanatory?  Why not place this option in the LCD/Viewfinder viewing options? Sony is full of these quirks.  From features that are placed in unexpected places in the menu system to greyed out options that depend on the mode dial settings.  Why can we just set these options in any mode, even if they don't work in all modes.  That way, we are spared the tedious task of determining where Sony has provided for such options.While we are it, maybe someone can explain to me why I can't set the face recognition to focus on the eyes in the normal menu (that is an option with the A6000), but I can assign that function to one of the custom buttons.  Again, the guys at the Sony store confirmed that this was a feature.  They even referenced a foreign video depicting the selection of this feature.  However, they couldn't figure out how to do it themselves.  As an aside, the feature is also very quirky and doesn't always lock on the eyes, even when the subject is in the middle of the frame (Olympus' implementation is light years ahead of Sony's.  They even let you chose which eye if you so desire).One last note.  Fortunately, a friend just bought the A6000, giving me an opportunity to put the much touted AF-C continuous autofocus through its paces. I have tested it extensively and there is good and bad news.  It definitely works well for tracking objects moving laterally.  Objects moving to and from the camera are another story.  It definitely performs better than any other mirrorless I have tried, but it still falls short of DSLR's in this respect. It will track kids moving toward you at a moderate pace.  However, it failed my child on a swing test (child being photographed from the front while swinging toward and away from the camera).  I also saw that Tony Northrup performed this same test on his video with similar results.  In fairness, some DSLR's also have problems with this test.  Still, my \"old\" A57 had little problem keeping up with this test.  The A6000 just seemed to always be slightly behind. The test was done with the 16-50mm pancake kit lens. This is a fast focusing lens and specifically designed to work with Sony's hybrid phase detection system.  The results were much worse with the 50mm f1.8, even when stopped down to increase the depth of field.In summary, I'll stick to my original thoughts.  An almost great camera, with many quirks.  If shooting pictures of toddlers and family is your thing, the AF-C should be more than enough, but don't expect enthusiast level autofocus (not quite ready for serious sports yet).  It definitely improved and a great many deficiencies found in the NEX-6, but certain decisions still leave you scratching your head (Level Indicator anyone?). This does not mean that it's a bad camera. On the contrary, it is a great advancement.  However, it could have been a lot better with little effort on Sony's part.  As for the autofocus, it's very fast in AF-S mode.  It's just not ready to replace dedicated phase-detection autofocus systems in AF-C mode.  It's no wonder that the upcoming A77 Mark II, despite using the same/similar sensor, will also be keeping it's translucent mirror box and phase detection system.  That speaks volumes.<ORIGINAL POST>Just a little background.  I owned an Nex 6.  I presently have a Nex 3N as a stop gap camera, alongside a DSLR.  I have owned an a57 and A58.  I am an experienced photographer and I always take the time to get to know my equipment really well.I have played extensively with A6000 since its arrival at my local Sony store.  I will start  by saying that the good outweighs the bad.  The customizability of this camera is great when compared to the Nex 6.  And thank goodness for the alpha menu!All is not great however.  From the placement of the command dial and mode dial (should have swapped places), to the multi step process required to change from all points to single selectable focus point, to the lack of a touch screen, to the nearly worthless flash sync speed of 1/160 that is barely enough to freeze moderate subject motion, etc.  Well you get the point.  Now for the one bonedhead decision that I find hard to swallow.  That honor was formerly held by Sony's incomprehensible decision to not allow auto ISO in manual mode in the Nex line, while implementing it in the Alpha A99.  No real rhyme or reason other than the foolish belief that somehow that was an upper level function not worthy of Nex users.Along with the ISO fiasco, Sony formerly crippled the \"old\" Nex 6 by not allowing you to assign any function to the rear wheel.  Again, no real rhyme or reason for that foolish decision.  Finally, Sony has now listened to us and has given us the ability to change exposure compensation with the rear wheel.  Hooray, you can even switch that option to the command dial.  Now for the good part. Nex 7 users have been able to do this from the beginning.  With the tri nav controls of the Nex 7, advanced users have always been able to take advantage of the histogram display to change exposure on the fly.  In doing so, they can see the histogram move left or right, enabling them to nail exposure at will...or even purposely under or over expose.So wait you say, what's the big deal? We can now do that with the A6000 as well...right? Yes, but with one major difference.  An issue which the A6000 shares with the Nex 6.  They both block out the histogram when you change exposure. WHY!!! In other words, unlike the Nex 7, you can't see the effect of your exposure change in real time.  The histogram disappears while you make your exposure compensation, then the histogram shows up again, you then realized you over exposed, so you change again, the histogram disappears once again during this process only to reappear after your second correction to show you that you are now under exposing.  With Nex 7 you see your exposure compensation scale at the bottom, along with the histogram, so you can see the effect of your exposure change on the fly.  You can nail exposure the first time.  The craziest thing of all is that the A6000 blocks out the histogram only to show you the same exposure scale, but bigger, just above the standard exposure scale.  That's right, it shows you two exposure scales  while blocking out the histogram.  WHAT!!! Who's in charge at Sony development?Are there any photographers on staff at Sony camera?  Seriously, even the employees at the Sony store were scratching their heads at that one.  They couldn't figure out why Sony did that.  They suggested I write Sony to voice my concerns in the hopes that they issue a firmware update in the future.  Are you listening Sony?  If you want enthusiasts and pros to take you seriously, you can't be making such bonehead decisions.  It took you about two years to figure out the Auto ISO in manual mode was actually a good idea (correction...at least 5 years).  Get it together will you!", "Date": "April 23, 2014"}, {"Title": "...did you like the Nex 6 ?", "Author": "Ronnie B", "ReviewID": "R11XZIKOWZSOKB", "Overall": "5.0", "Content": "...well, you'll like the a6000 and then some... I mean really, 11fps with autofocus between shots, new 24mp Sony sensor, upgraded hybrid auto-focus, a very attractive body only price...really, more better !!!", "Date": "April 28, 2014"}, {"Title": "Great Camera", "Author": "Ken Berger \"Ken\"", "ReviewID": "RR06VD6YN2ZWH", "Overall": "5.0", "Content": "I love this Sony camera, although I am not so much a Sony fan but this one camera is great.", "Date": "May 1, 2014"}, {"Title": "Broken Manual Focus...", "Author": "Taran Morgan", "ReviewID": "R3BG6FGC2M7C9R", "Overall": "3.0", "Content": "The much vaunted NEX 6/7 had wonderful controls for using legacy manual focus lenses via adaptor.  The 6000 removes the functionality of the 6/7 by forcing the user to hit the zoom button twice to enhance the manual focus zoom area, instead of just hitting the button once, as before.  I can now no longer switch between 6/7 and the 6000 because of the workflow differences.  As a professional, this is an ergonomic nightmare, and a noticeable step backward in usability, although it may seem trifling to those photographers that are AF lens users (read: most).  I may end up returning the camera, as I love my old nikkors... they worked perfectly using the previous focus assist on NEX 6/7.I post this review here for two reasons:1) None of the \"preview\" reviews of the camera mentioned it, because they are mostly run by people who know nothing about photography.  Shame on them.2) Sony shouldn't market the camera as a replacement for the NEX 6/7 and then remove via software the one feature that was most useful about those cameras for manual focus glass.-------I really hate it when features are removed from a camera that were there in the manufacturers previous \"version\".  There is no way for me as a consumer to know not to buy this camera because said feature had been removed.  This is a software modification that wasn't in the specs.  Caveat Emptor.I will update this review if there is something I missed because I have only had the camera a few hours.  I will also update if I hear about a firmware update that restores the functionality of NEX 6/7.  Until then, I consider this camera broken for manual focus glass, and a major step backward from NEX 6/7 in that regard.", "Date": "April 22, 2014"}, {"Title": "Too much noise at ISO 3200", "Author": "Glennpok", "ReviewID": "R12D07ROIYMG8S", "Overall": "2.0", "Content": "Sorry, this has to return but of course it could be the unit is defective but ISO 3200 had too much noise.  Jpegs were like paintings.  Might as well pick up the Nex 6 clearance sale.  I'll stick with my A3000 and 3N for now.", "Date": "May 16, 2014"}, {"Title": "Good hardware, wait for the software to catch up.....", "Author": "pedweld \"pedweld\"", "ReviewID": "R39CTY91VWNXUE", "Overall": "3.0", "Content": "Received the camera this week. Mechanically it seems of good quality, but still in the review process. Please be warned that the account connectivity, documentation, and any other access to the Sony support web page is a train wreck and not ready for the camera's release. Hoping for better luck over the next few days and will provide an update.", "Date": "April 24, 2014"}, {"Title": "Kit lens is horrible", "Author": "F64 \"Brian\"", "ReviewID": "R1YFK691PRB810", "Overall": "1.0", "Content": "I bought this camera from another vendor and  kept this camera for one day after seeing  a series of photos  I took  in JPEG+RAW.  The camera was set on program mode, iso 200-1600 and 16mm. The JPEGS are fine because in camera processing corrected the lens.  However, RAW photos that were not corrected showed severe, I mean extreme bowing out, distortion. I would be happy to send the images for anyone to view.  It's unbelievable.  I tried contacting Sony and their web page does not give an email address.  Only buy this camera if you are going to correct the kit lens in post processing or shoot jpegs only.", "Date": "May 22, 2014"}], "ProductInfo": {"Price": null, "Features": "ILCE6000/B\nCapture life in high resolution with 24MP APS-C sensor\nCompact & lightweight Mirrorless DSLR for everyday use\nEasy and intuitive controls help you shoot like a pro\nSmartphone remote control & sharing via NFC & Wi-Fi\nWhat you see is what you get with an OLED Viewfinder\nConvenient features: Tilt LCD\nEnhance your camera and creativity with Camera Apps", "Name": "Sony Alpha a6000 24.3 MP Interchangeable Lens Camera - Body only", "ImgURL": "http://ecx.images-amazon.com/images/I/41NF3tkqQ5L._SX300_.jpg", "ProductID": "B00I8BICCG"}}