{"Reviews": [{"Title": "30 FPS 8 MP Stills Revolution!!!  Family, Portrait and Event Shooters Rejoice.", "Author": "shuTTL3bus \"shuTTL3bus @gmail .com\"", "ReviewID": "RMHCWBEK4HSZO", "Overall": "5.0", "Content": "If you are a video professional, this camera is a no brainer. There is nothing out there that can touch what this camera can do for anywhere near this price. However, I mostly shoot stills so that is the aspect I will be reviewing on this camera. $1700 is a lot to pay for a stills camera and the IQ is not really that big of a step up from the GH3 or E-M1 (Though it has the highest DxOMark score of any m43.) which can be had for around $1000 or $1200 respectively. So why would a stills shooter pay this much for a camera.The reason for a stills shooter to buy the GH4 and pay the money is for the 4K video. But wait you said you were focusing on stills so why are you talking about 4K video? To answer that question I will provide a brief primer on 4K video.Current high definition 1080p video has a resolution of 1920 x 1080 and is sometimes called 2K video. If you multiply the 1920 x 1080 you get an approximate 2MP image. The name 4K video, while technically correct, can be a little misleading of a name. 4K video is double the horizontal and vertical resolution of 2K and while there are a couple of resolutions for 4K video I am going to use the 3840 x 2160 for this discussion. When you multiply 3840 x 2160 together you get an approximate 8MP image. So another good name for 4K video might be 8MP video. 8MP is the the holy grail of image sizes for families for the following reason. The average pair of eyes can see about 300 dots per inch (dpi) at a normal reading distance. The largest most families like to print pictures of their kids, etc is 8x10. If you want to print an 8 x 10 at 300 dpi you need an image of the following size: (8 x 300) x (10 x 300) which equals 80 x 90000 which equals about a 7.2MP image (An interesting aside is professional sports were shot for many years in 8MP). The GH4 shoots 8MP video. So with the GH4 you can pull 8MP still images from your video!!!That is huge. The GH4 can shoot 4K video at 30fps. This allows you to shoot video of your subject and then pull a 8mp still image of just the right moment. As of this moment, no other fully featured stills camera lets you to that. So if you like to shoot stills of your kids sports, or your kids running around, with the GH4 you now shoot in video and then pull 8mp images. This is brilliant and has outstanding implications for video/still electronic photo albums. As a tip for doing this. Don't just switch on the video and let it run for 2 hours. The pain that causes in editing is unbelievable. Instead, shoot your video in 8-15 second clips. There are obvious exceptions such as when your child is delivering a speech or something like that. But for the most part try to stick to that. Next time you are watching a movie or TV show, pay attention to how long a scene is shot from one camera. You will notice it is mostly shot in 8-15 seconds clips. That is what keeps it visually interesting. It also makes for easier editing. Most of life is boring so only recored the interesting parts.So that is the theory but how does it work in real life. In one word Amazing! You can't see it on Amazon but the stills I have pulled from video looked amazing. I am not a big pixel peeper but I have even blown them up to 100% and they look fantastic. I have them posted on my web site if you want to check them out.Here is some specific info on doing this:You can only get 4K video in the creative video position of the mode dial. So switch it to that mode and then pick the MP4 or Mov setting.  There are 2 MP4 settings standard MP4 and MP4 LPCM.  The LPCM does not work in Aperture.  I have been using MP4 to great effect.At 100 mega bits/sec that equates to 12.5 MB/sec so it can use up a lot of hard drive space. So you may need to delete quite a lot of video after you pull the stills.As I mentioned earlier you have to be in the creative video position to shoot 4K.  Unfortunately, auto focus in this mode works like a video autofocus, slow and smooth like focus pulls and is quite a bit slower than stills autofocus.  It does track and I recommend shooting in face focus as in this mode it will focus normally or focus on a face if it is in the image. Fast focal plane changes will result in out of focus video/pictures. I take a lot of shallow DOF pictures of my kids and they move around a lot so I do have quite a bit of Out Of Focus (OOF) video. However, I am still pulling out lots of amazing images.The stills are in a 16:9 format so you lose some mp converting to 4:5 format.  After cropping to 4:5 there are about 6.3mp left in the image.  This 280 dpi which is not quite 300 dpi but is still more than enough for printing an 8x10.Rolling shutter distortion can be a problem with fast movement. I have a few images like this of moving children but for the most part it was a non-event.  For those not familiar with the rolling shutter issue it is basically that the electronic shutter is not a global shutter which is to say it does not sample the whole sensor at one time.  It scans or rolls to all the positions on sensor.  That means for a fast moving object, it is not in the same place when it is scanning the bottom of the sensor as it was when it scanned the top.  This causes distortion.  So here is what I have found so far to be an issue.No propellers or rotor blades as they are going to look really funny.Don't shoot fast moving subjects perpendicular to their movement.  Even as little as 5 deg off perpendicular can prevent a large part of the distortion.Fast pans -- If you are tracking a moving subject by panning to freeze the subject and blur the background, if you do it too fast you can cause distortion.  Don't quote me on this rate but if you keep it below ~90 deg/sec then there is very little issue.For digital fusion work this camera absolutely cannot be beat.In creative movie mode you have complete control of your aperture, shutter speed, and ISO.  However, if you want really nice video you need to be shooting a shutter speed around 2x FPS or in this case 1/60. In bright light conditions you are going to need a ND filter to block light or you could have a 1/8000 shutter speed at fast apertures which produces a kind of strobie video.  At the moment there is no easy way to fix it.Roll your stills and video together to create a video/stills albumI used a 30MB/sec card and it worked just fine for 4K. I think the 60MB/sec cards will be more important for the 2K 200mb/sec video mode. I have received my card and it is this one Transcend 64 GB High Speed 10 UHS-3 Flash Memory Card 95/60 MB/s (TS64GSDU3).  All I can say is this card is fast!!!!  I did a test compared to the 30MB/s and here are my results.  30MB/s -- write avg 20MB/s read avg 23MB/s.  60MB/s -- write avg 60MB/s read avg 80MB/s.  This was done on an Apple computer.  As you can see the new cards are really really fast.Event photographers, can \"video\" their photos using LED lighting and then pull the still when everyone's eyes are open. Etc. So they can offer high quality stills and 4K video.For studio photographers, forget trying to click the camera at just the right moment. Just have the camera recording 4K video and then work to get the subject to smile and pose. Skim the video to find the best combination and then pull the video.There are great possibilities in travel photography, underwater photography.  The possibilities are limited by the imagination.As a stills photographer, 4K video is something I have been eagerly anticipating and now it is finally hear in an affordable package. No other camera in this price range offers these capabilities.From the average home users video perspective, the biggest thing 4K brings is the ability to apply ken burns effects, or zoom effects when down converting 4K to 2K video.With 4k lbs gorilla out of the way, how does this camera stack up as just a plain stills camera? In a word, brilliantly.For the most part, this camera handles wonderfully. The construction on this camera is top rate. It feels more hollow than the EM1 though. Whether you think this is good or bad is up to you. I think it keeps weight down so I feel it is good. This camera is so jam packed with features, most people, including me, will never use 90% of them.  I do prefer the size of the GH1 and GH2 though.  It feels like could be made smaller with no real penalty.The auto focus is the fastest I have ever used. I don't use \"tracking\" auto focus per say but I do use face focus which is a tracking auto focus and that works very well and very quickly. I also, don't use burst mode though this camera will shoot 120+ full-size JPEGs at 40 FPS. It has a new technology which lets the camera know how far OOF something is so it can instantly put the subject in focus without hunting. Auto focus is basically instantaneous on the Panasonic 25mm f/1.4 which is the fastest focusing lens I own. The OOF technology requires a lens database and so Olympus lenses are not currently supported by it. So the 75mm f/1.8 is not as fast as it could be but is still very quick.  Unfortunately, in creative video mode (mode to shoot 4K), the autofocus is not as fast even when video is not being recorded.  I wish Panasonic would either let me record 4K in manual stills mode or use stills autofocus when not recording video in creative movie mode.As far as the benefits of m4/3 goes, I have covered that extensively in my Olympus E-M1 review so that is the place to go to understand differences in the formats. Needless to say I am a big fan of the m4/3 format and how small and light the cameras and lenses are. While the GH4 is on the large size of m4/3 bodies, when I want to go small and light I pack the outstanding GM1.  I do prefer the size of the GH1 and GH2 though.  It feels like the GH4 could have been made smaller with no real penalty.  But maybe heat was an issue.The EVF on this camera is excellent but not as nice as the one on the EM1. The back tilt and swivel screen is beautiful and I really have missed the swiveling aspect on the EM1.With the exception of setting exposure (EV) the handling on this camera is top notch. Panasonic's excellent touch screen system and quick menu work very well.But let's talk about how EV is set on this camera. Photograph literally means to write with light. So being able to set the EV (or how much light) is the most basic control on a camera. Panasonic used to have an innovative brilliant approach with a clickable rear dial. Depending on what mode you were in (P, A, S, M), the rear dial would set either aperture or shutter speed and then clicking on the dial would allow you to set EV. Very very fast. Very very efficient. (Warning Rant Ahead, Skip to the next paragraph if you don't care) However, under the category of you can't teach an old dog new tricks, the established pros complained about not having 2 dials and a EV button. (Which by the way is why in the modern computer age we are still saddled with the QWERTY keyboard which was designed on purpose to be the slowest possible keyboard to prevent manual typewriter issues). Because of this very poor feedback we are now saddled with, instead of one dial, a Frankensteined DSLResqe 2 dial one button system which is much slower and clunkier than the innovative system it replaced. Instead of being able to use your thumb to quickly and easily set exposure when holding the camera to your eye. You need to take the camera away from your eye to find the +/- button. Then with one finger you need to press that button and then another to rotate a dial to change the EV. I spent a few hours in the instruction manual to see you could change this.  I could not find it (note to Panasonic in the manual where you are talking about the dials put a footnote in about the ability to customize them).  However, a kind reader pointed out to me that you can change the setup on the dials to have either wheel change EV which makes the EV control much nicer.There are 3 other notable misses on this camera. The first is it does not have an In-Body Image Stabilizing system (IBIS). The 5 axis on the EM1 is so excellent and opens up so many shooting opportunities, that it is missed on this camera. In fact, if you are, primarily, a stills photographer, and what I said about 4K video up above does not interest or excite you, I would recommend the Olympus EM1 over the GH4, simply because of the 5 axis.  A kind reader pointed out this is because of heat dissipation issues from such high transfer rates.  That being the case I would still like Panasonic to do some solid research on this to come up with the solution.The next miss is this camera does not have dual card slots. This is a camera that will be used for paid work such as weddings or other events. Having a back up card in these situations is almost a must. Put in a second card slot Panasonic.The final miss on this camera is the global e shutter.  A global shutter would be so amazing for both stills and video.  Panasonic have been working this since the GH1 and unfortunately got sidetracked by 3D.  Hopefully, they will have this problem solved with the GH5.Pros- Pull 8mp stills from 30fps 4K video!- Fastest real world auto focus I have used in both bright and low light- Build quality- EVF- Tilt and swivel screen- Price -- Nothing in this price range can do what the GH4 can do.Cons- Poor EV control out of the box.  Customized dial setup allows for a very good EV control.- 4K is in creative mode only and autofocus is slow in that mode even when not recording.- No IBIS (put the IS in the camera not the lens, this will keep the lenses smaller and gives IS to all lenses mounted on the camera) Olympus 5 axis is better than any lens based IS I have used.- Rolling shutter causes distortion -- Focus on global shutter for GH5- Only 1 SD card slotOverall, if you are a video professional or someone who is very serious about your video work, this camera is a no brainer.If you plan to utilize the 4K video for still photo shoots, this camera is a no brainer also.If, however, stills are your primary focus and you have no intention of pulling 8mp still images out of 4K video, then other cameras are going to be a better bang for the buck; notably the excellent GX7, EM1 or even the EM10.", "Date": "April 30, 2014"}, {"Title": "The best traveling 4K video camera!", "Author": "J. Tiffee \"PPGFlyer\"", "ReviewID": "R1TKMED8J19D8X", "Overall": "5.0", "Content": "First of all, I can confirm that this memory card performs perfectly recording 4k at 100Mbps.  http://www.amazon.com/gp/product/B00I3BQJNA/ref=oh_details_o04_s02_i00?ie=UTF8&psc;=1I own a RED camera so have been dealing with 4K footage and working in the format for a couple of years now.  I work professionally for one of the big 3 letter networks and have two Emmy statues sitting on my mantle.  This camera absolutely blows me away.Much can be debated about whether the DSLR form factor is suitable for professional video work.  Its hard to get stable footage, most lenses are hard to focus with, zooming is difficult to impossible with most lenses, and the camera was designed to take still photos.  What is hard to debate is that this is the best 4K camera currently available for travelers and DSLR style shooters.I've put together a traveling kit that all fits into one backpack that includes the:GH4Tripod - 3 legged things \"Brian\" - Watch some videos on this extremely light and versatile tripod.Monfrotto MVH500AH Fluid head - Seriously awesome and smoothSlider - Edlekrone Slider Plus V2 - Medium with Motion module and Target module (waiting for shipment)Jib - Aviator travel jib - Very compact.  Extends 6ft.  Haven't tested enough yet to determine worth.Zacuto Marauder - Very NiceZacuto Z-Finder for GH3 - Pairs well with the higher resolution LCD on the GH4.Olympus 12mm f/2 - Super sharp, no image stabilizationPana Leica 25mm f/1.4 - Sharp at 2.8 everywhere.  Excellent at 1.4.  Creamy bokeh.  Magical images but no IS.Pana Leica 45mm f/2.8 - My Macro, 2nd portrait, and tele primeLumix G X 12-35 f/2 - Excellent all around zoom (24-70 equiv)Lumix G X 35-100 f/2 - Excellent tele zoom (70-200 equiv)Lumix 14-140 f/3.5-5.6 - Versatile run and gun lens.  (24-280 equiv)Yes, all of the above fits into a Lowepro Pro Trekker 400 AW!  And is comfortable to carry.I don't have much to add that hasn't already been written in these reviews so here are just a few notes from my experiences that may help others:Editing 4K is no problem on a Mid 2012 Retina Mac Book Pro 2.7 i7 with 16GB Ram.  With Adobe Premiere CS6 I edit at FULL resolution with no dropped frames usually.  Sometimes when you hit play on the timeline it will drop 2 frames then playback the rest with no dropped frames.  Or if your computer starts doing something else while you are playing it will drop a few frames.  It will drop ZERO frames at HALF or QUARTER resolution.  But remember, 4K is 4 times the resolution of 1080 so even at quarter resolution, you are previewing HD! There is no transcoding, just drag and drop on timeline and start editing.Playing the files off the SD Card or even my SSD HD using quicktime player is not usable.  It studders.  I have to open premiere and import the files to play them back smoothly.  Not an issue for me and my workflow.  Haven't done much testing to figure out solutions.HDMI to TV looks incredible. Some of the best looking HD you'll see at home.  If you're a videophile who just has to watch movies on Blu Ray or better then you'll love the images from this camera.You'll want to stick to the Panasonic Lumix / Leica lenses with image stabilization.The onboard audio is decent but is very omni so you'll pick up sounds of your breathing and moving about.  I have a rode stereo mic that attaches to the hotshoe.Out of the box the footage is pretty sharp.  Good for documentary shooting or everyday home use.  But You can dial that back for a more cine style look.I recommend shooting Cine-D.This camera has no problem serving as a second camera to my RED or as my primary travel / docu camera.I'll try and post more as I use this camera more, but if you're thinking about getting this camera- stop thinking and start clicking.", "Date": "May 8, 2014"}, {"Title": "I started clearing out old gear a month ago to make room and money for this camera. It's worth it.", "Author": "Kirk Tuck \"Kirk Tuck\"", "ReviewID": "R396VKB6NNX7AK", "Overall": "5.0", "Content": "To understand where I'm coming from I've been a professional photographer for about 25 years, have written five books about photography (all available here on Amazon...) and I've been shooting video on and off for well over a decade. I originally bought a Sony a99 to do video with since it seemed set up to do good video production but the camera is crippled with a poor codec, line skipping and a generally mediocre image quality (in video, the stills are great). Searching for another option I researched the Panasonic GH3 and bought two of them. They've been really great video cameras and I think their image quality, especially from raw files is as good as nearly all APS-C cameras and the Olympus m4:3 cameras.  While I like my GH3's and have made money with them in video production the specs on the GH4 were too good to pass up. The camera isn't a giant step up from the GH3 but it's a great refinement. A well done evolution.The processors in the camera are twice as fast as the ones in the previous generation and that means faster focusing, faster read times and generally better processing while the camera is reading information off the sensor. The camera will shoot 4K video which is twice the resolution overall as the 2K video on the previous generation. I won't be using the full 4k any time soon but the improvements required to handle 4k mean a better image in 2k.I've had the camera for three days, have shot over 1,000 still images and tested the video in both 2K and 4k and everything about the camera exceeds my expectations. I love having more video controls. There is a master pedestal control that allows you to set black levels. There are two cine profiles that give you footage that's easier to color correct and grade in post processing. There's a better set of audio meters with a marked zero Db hashmark. There are two settings for Zebras to help you nail exposures. There's focus peaking to assist you in focus pulling and using manual focus legacy lenses.The camera takes the same batteries as the GH3 which, since I own five or six of them, is a big bonus. But the best thing of all on the new camera is the very much improved EVF (electronic viewfinder) which I find to be much closer to an optical viewfinder than anything Panasonic has done before.I've only had the chance to play with the large, Jpeg Fine files since I haven't loaded SilkyPix yet. Since my real need is for video production, and I have two of the GH3s, I have the luxury of waiting for Adobe to add the raw file converter to Adobe Raw in Lightroom and PhotoShop.If you shoot only stills and you have the GH3 you probably don't need to change. I don't think the files are more than about 5% better in the new camera. If you shoot video you'll probably be interested in all the upgraded features and the ability, if needed, to buy a unit that attaches to the bottom of the camera and provides XLR microphone inputs and good pre-amps for the microphones.My take on it is that the GH4 is the best of the DSLR video cameras at this moment. It's a moving target so check back frequently.Final thing. The Autofocus. It's as fast as anything I've ever shot with and more accurate than a lot of them. I'd buy this camera again in a heartbeat.", "Date": "April 27, 2014"}, {"Title": "Better than I hoped for!", "Author": "Bradford C. Coleman", "ReviewID": "R1RCB5U11D27ZG", "Overall": "5.0", "Content": "http://youtu.be/upFLPmyl2qQI have been the proud owner of a GH3 for over a year and preordered the GH4 as soon as it was available. I got my unit in last week and all I can say is WOW. I never dreamed the image would be this crystal clear, but what surprised me the most is just how grade-able it is! I was simply amazed at the amount of detail I could pull out of the highlights and how well the color took to the harsh grades I have thrown at it. It does have a digital look out of the camera but when you use the CineD profile and 3D LUT's it really starts to look filmic! The dynamic range is definitely improved over the GH3 and the CineD profile really helps that along. Now it is very grade-able and like I said pulls good detail out of the highlights but it isn't nearly as workable as the ProRes you get from the Blackmagic Pocket Cinema Camera. I am a former owner of one and that camera will look more filmic right out of the box with a beautiful image.Having been an owner of both the BMPCC and GH4 I must say I am choosing the GH4 and not looking back! The ability to reframe in post when using 4K and the amount of detail you will get from the images is just mind boggling. The BMPCC will give you a more film feel but requires a ton more storage and a more tedious workflow. I've been amazed at how well the GH4 is taking to the LUTs I love to use.The viewfinder and monitor are WAY better than the GH3. I saw in a the pre-release reviews that people said it was an improvement but I never had any issues with the GH3 and I thought the viewfinder and monitor were great.....till I got the GH4. I use the Metabones Speedbooster which requires manual focus and wow it is WAY easier to nail focus with the new viewfinder. The addition of focus peaking is definitely a godsend but I feel like the clarity of the new viewfinder helps just as much as focus peaking if not more, so add the two together and you will get perfect focus every time.The battery life is the only thing I have noticed that is worse than on the GH3, but I am shooting 4K so that is totally understandable. The battery isn't awful by any means it will easily last hours on a video shoot without turning the camera off. The BMPCC had me chaining batteries every 30 minutes.As for memory cards, Panasonic is saying you need the new Class 3 cards to record 4K. I own 3 Sandisk Extreme Pro 64GB 95MB/s cards so this made me nervous because of how expensive they were. The first thing I did was throw a card in the GH4 and shoot 4K to see how it handled it and have been very pleased so far. I haven't experienced any issues with dropped frames or any botched recordings. If these cards can handle 220mbps ProRes from the BMPCC I'm sure they will have no issues with 100mbps 4K from the GH4.So I absolutely love this camera and made a fun little video this past weekend trying to show how it looks after grading. I shot all the footage in 4K and edited in a 1080 timeline. Way more detail than shooting in 1080!http://youtu.be/upFLPmyl2qQ", "Date": "May 6, 2014"}, {"Title": "From GH2 to GH4, couldn't be happier.", "Author": "Matthew Hoecker", "ReviewID": "RJFRQ9PKLLWJH", "Overall": "5.0", "Content": "I will try to update my review when I've played with it even more, but let me just say everything has been everything I wanted in the GH4 so far.  Image quality in all levels is great.  Stills are superb.  It's funny when my Canon buddies kind of gawk at a non Canon camera.  \"What is that?\" they ask.  Then I show them the 4K, the incredible display, and as my friend looked at the footage I had given him to edit, the jealousy was palpable.  My ONLY, VERY SLIGHT letdown was the amount of rolling shutter in 4K.  Just a little more than I expected after hearing about how fast the new sensor was and how much they'd reduced rolling shutter.  Turns out that's for 1080p, where granted, rolling shutter is almost unnoticeable for anything you'd consider showing to anybody.  But that won't keep my review from being 5 stars, as it's not bad, TOTALLY useable.  You just have to be aware, and know that certain unstabilized shots will have jello in 4K if you're not careful.It's a joy to use, the battery life is great, the displays are awesome, the menus are fairly easy to get around in.  A lot of features to learn, but that isn't a bad thing.  Great camera.", "Date": "May 9, 2014"}, {"Title": "GH4... Practical Review.", "Author": "Jonathan Taylor", "ReviewID": "R2IY3VDDAEZ6P2", "Overall": "5.0", "Content": "Housekeeping/Bias/Reviewer HistoryFirst off, I am most interested in video and short films.  I am also into photography, and have shot with Nikons and Canons, but have always preferred Panasonic for video (No record length limit is critical for events).  Canon video is nice, owing mainly to sensor size, but I've always felt all the way back to the GH1 that Panasonic video was superior, though I felt the stills capabilities were drastically unimpressive.  The GH2 was a massive improvement for video, and a small still upgrade, but still nowhere near a Nikon or Canon.  I skipped the GH3 because the video of the GH2 was so good I really didn't see a need to upgrade.  I've been missing a good stills camera, and though I have always preferred Nikon, their late tendency to increase MP size has left me incredibly unimpressed with ISO performance.  Canon's tendency to keep MP constant with new generations of sensors is REALLY attractive, because that means the ISO performance and noise is getting better (One can either make smaller pixels with less sensitivity or keep the pixel count steady and increase the sensitivity).  I was set to buy a Canon 6D when I heard rumblings of the GH4.  I waited, and everything seemed to be pointing to leaps and bounds in performance... new engine, same MP count, etc.  I'm VERY glad I did.The Body/Control LayoutHaving not had a GH3, I'm not sure of the changes, but over the GH2, it's an incredible difference.  It IS a little larger, in all three dimensions, but the weight is not noticeable.  It's noted as \"splashproof\"... a claim I have no intention of testing, but I do like the ergonomics better.  One of the BEST improvements of the GH4 is the layouts.  I'm used to having buttons (from the Pro Nikon and Canon worlds), but on the GH1 and 2, there was only one forward dial, and it required a button push to switch from SS to A settings.  This is remedied.  There is a FORWARD dial, a REAR dial and an additional wheel dial on the control pad by the LCD.  There are BUTTONS for ISO, WB, Exposure Compensation.  While these might sound like non-issues, The control layout is EXCELLENT.  I recently had to shoot with a Nikon D5200 and I couldn't believe how piss-poor the layout was for the dials.  OOPS, DIAL, singular.  It made the shooting experience miserable and I couldn't believe THIS was a NIKON and how far the mighty had fallen.  I was shocked at having pulled the GH4 out and shot a few simple test pictures.  The quality of the stills are a massive improvement over the 1 and 2... does it compete with a Canon 6D?  Doubtful, but they are good enough I'm not worrying about getting a 6D anymore...The LCDMuch has been made of Panasonic DOUBLING the resolution of the LCD.  It seem like a small thing, but it really is a gorgeous screen.  When you add in some of the touch features and how responsive they are, I no longer miss having a through the lens system instead of an LCD viewfinder.  I HATED it in the GH1 and 2, and was a major reason I despised the Pannies for stills.  The touchscreen functionality is incredibly responsive too, and when you are in focus, you are IN focus... it's razor sharp and the additional features really take advantage.VideoWow.  I haven't tried 4K, but let's be absolutely clear about this:  VFR is CLEARLY going to become an overused function in the future.  Why?  Because it is GORGEOUS in this camera.  GORGEOUS.  Here are the breakdowns of available modes:AVCHD:24Mbit/30p:  2, 15, 26, 28, 30, 32, 34, 45, 6024Mbit/24p:  2, 12, 20, 22, 24, 26, 28, 36, 48, 60MP4 or MOV:100Mbit/30p:  2, 15, 26, 28, 30, 32, 34, 45, 60, 75, 90, 96100Mbit/24p:  2, 12, 20, 22, 24, 26, 28, 36, 48, 60, 72, 84, !!!96!!!Personally, I do not understand why anyone would choose to shoot in anything but 24fps... but I am a filmmaker at heart.  I don't shoot sports.  I want everything to look as much like a film as possible.  Having said that, following the 180shutter rule as closely as you can and shooting in 96fps MP424fps is GLORIOUS.  What's more is the fact that it is instantaneous.  You set the VFR, you record the footage (it will tell you \"25%\" on the viewfinder), you hit record, you stop recording, you hit play and you get to see unbelievably high quality sharp, full 1080 HD slow motion.  It's incredible.  Slower Frame Rates (Time Lapse) will require some time to compose the image, but Slow Motion is instant, Crisp, Fluid, and incredibly impressive.The rest of the video is also improved.  It's actually mindblowing how good it looks, but the VFR is reason enough to buy this camera.  It's a gamechanger for anyone who shoots anything.  This is the NUMBER ONE reason to buy this camera, I'd argue a bigger advance than the 4K.  As impressive as the ability to shoot 4K is, there are other cameras on the market (albeit at a higher price point) that shoot 4K.  Slow motion of this quality is an incredibly useful tool.  Note that you can't use the VFR in the 200Mbit settings.  This is not even approaching the reasonable limits of a downside.  100Mbit at this quality is incredible.ToolsThere are a variety of features that deeply improve the shooting experience.  Focus peaking is brilliantly used, and it also makes the LCD sharpness that much more apparent.  Zebra Levels are also available in all modes.  Hitting the display button will toggle through modes of the LCD, including a built in tilt and level sensor.  Manual focus assist is also massively improved, allowing you to select the size of the magnified area and where it appears on screen.  Working in concert with the focus peaking makes manual shooting like I prefer top notch.  The modes and ability of the AutoFocus is also impressive, but like 4K is so over-reviewed that I do not wish to beat that particular horse.  The AF is great, but the takeaway is that the MF features are equally improved.Additionally, there are options for Luminance, Pedestal, SS -> Shutter Angle, CineD (Increased Dynamic Range) and CineV (Increased contrast), and a lot of other settings that I'm just not going to cover at this point.  The larger point behind it is what's critical:  There have been MASSIVE upgrades to the ability to tweak your video, and it's a very capable and impressive piece of hardware.BatteriesThis is an oversight to a lot of people/companies, but this vital to people like me.  I am used to having to buy AC adapters and power couplers to shoot events, as with the GH1 and 2 you couldn't feel too confident after an hour... but last night I shot a band with a GH1, 2 gh2's and my GH4.  I was unable to procure an AC10 adapter for the GH4.  After shooting 2 hours and 44 minutes without stop, I noticed the battery level indicator still had 3 bars.  I had bought Third Party batteries (Wasabi BTR-BLF19-JWP) beforehand to have spares, and figured the power level indication just didn't work.  I paused the recording between songs and started immediately again, figuring I'd rather not lose it all if the battery suddenly died.  I recorded an additional 48 minutes and still had 3 bars.  I went to a pizza place and was recording some stuff for slomo and low light and after 20 minutes of that, the battery dropped to 2 bars.  I was SHOCKED.  So apparently, you can shoot roughly FOUR HOURS before the battery drops a SINGLE bar.  This makes me want to sell every other camera I own and buy several of these.  I never have to look for another outlet to shoot events or long time lapse shots (which can now also be done in camera).The Memory CardsI am shooting with the Sandisk 95MB/s ExtremePro's.  I have not shot 4K yet, but have shot a good bit of MP4 (24fps, 100 Mbit) and have had NO issues, even running at 96fps.  4K may be the decider, but if you are shooting HD this seems to be a non-issue.Wifi Too?Yep.  If you have an android or iPhone, the camera has an app that works incredibly well... so if you want to shoot from a crane or bucket truck or remote control vehicle, you can, and retain recording control as well as focus.  Wonderful addition.Overall.It's simple.  It's as if the Wright brothers got done with the flight at Kitty Hawk, went back to the drawing board, and rolled out a P51 Mustang 3 years later.  It's difficult to overstate the difference in value this camera represents over previous versions, which were themselves great values for the video capabilities.  It's as if Chevy decided to give free upgrades on Cobalts to Corvettes.", "Date": "May 3, 2014"}, {"Title": "A turning point in the history of videography.", "Author": "Ahmed ghazzawi", "ReviewID": "RXBKAP1DMDMK6", "Overall": "5.0", "Content": "All what I cared about was the Gh4 quality degradation during on air transmission or broadcast... Well what I saw was mesmerizing.No more the ugly washed out image like other Dslrs.It's amazingly sharp... It's sharper than my canon C300 believe it or not.This is a new dawn for videographers.", "Date": "May 15, 2014"}, {"Title": "Great for Sport's Photography", "Author": "Defiant", "ReviewID": "R3K0BBCEN60KIX", "Overall": "5.0", "Content": "This is really an amazing camera and a big improvement over a GH3.  They have greatly improved the noise in low light and the shutter speed of 8000th of a second allows you to shoot the with the aperture wide open even in bright light.  The Lumix 2.8 lenses work really well with this to give amazing bokeh in all lighting conditions. The focus is much faster than the GH3 as well.  For shooting sports or any fast action, setting the focus to continuous in high speed burst allows you to capture the perfect moment as the focus is fast and accurate and it continues to focus throughout the burst. I think it gives you around 7.5 frames per second in continuous focus which gives you much higher percentage of burst shots perfectly focused.  The focus peaking allows you to quickly achieve very accurate manual focus.  The displays are substantially improved also, giving you a much more accurate representation of the shot.  I used it over the weekend to shoot a track meet and it far exceeded my expectations, a big improvement over the GH3.  If you use a GH3, you will find the controls very similar, only improved with additional features.  I was able to pick it up and start shooting right off the bat.  I have only scratched the surface on the features, but wanted to share what I had used so far for anyone considering this.  I haven't even had time to try the video, which from the specs sounds amazing, but I thought I would throw in some perspective from someone using it primarily for photography.  I purchased this locally to get it faster, but amazon has it at the same price..", "Date": "May 9, 2014"}, {"Title": "Superb", "Author": "Pedro I.", "ReviewID": "R2RTYS7FSCMN4G", "Overall": "5.0", "Content": "Easy to use and easy to play with settings. Together with the Leica 25mm f1.4 it's a damn beast!!! Don't forget to buy from B&H; or Adorama a SanDisk Extreme Pro SD card (the expensive ones 280 Mb/sec ) cuz you will need it.", "Date": "May 16, 2014"}, {"Title": "Portable, Versatile, and Powerful", "Author": "Kastel", "ReviewID": "R1J15EF40CPS0A", "Overall": "5.0", "Content": "I absolutely love this camera! The camera feels amazing in the hands and there are so many features and functions in this camera it kept me busy for hours before taking it out for a spin! I mean you can change the display interface to be more video centric: FPS and codec visible, shutter angle versus shutter speed, timecode, etc. You also have audio controls, focus peaking, zebras, many different color profiles, just about everything I need make shooting on this camera feel more like a video camera.", "Date": "May 8, 2014"}, {"Title": "GH3 was a great camera and everything I didn't like about it has been fixed on the GH4", "Author": "Isaac B. Sloan", "ReviewID": "R2UGV1UF89DIIG", "Overall": "5.0", "Content": "So other than 4k which is awesome here is why I like this camera:The body feels really solid and comfortable in my hands.Controls are well laid out and like my nikon d800 so I rarely have to get into the menu's during a shoot.Electronic shutter works well and will allow you to shoot high quality shots without shutter noise.It's also the first in the lumix series to have a 1/8000 shutter speed which along with the super fast shutter speed makes it a dream for sports photography.The GH3 had issue's with vignetting on the EVF but the GH4 seems to have fixed this entirely.The focus is almost as fast and more accurate than my d800 or they 5D MKIII", "Date": "May 1, 2014"}, {"Title": "SOLID 4k 'budget' cam, Perfect? no, but really nice overall package", "Author": "Darren Levine \"He shoots, He Edits, He freque...", "ReviewID": "R1DMAU8YZDZQ7Z", "Overall": "5.0", "Content": "The GH4 builds on the success of the gh1/2/3, the GH3 many felt was a sidestep as opposed to being a forward step, but Panasonic did a few things to please the crowd, namely: the codec. the GH1/2 were great because of the hacks that gave them high bitrates, panasonic embraced this and gave the GH3 built in high bitrates, they've done it again with the GH4, makes hacks unnecessary.It's still early, and i'll update with more info as it comes.Some tasty highlights:-200mbit 1080 bitrate, no hack needed!-100mbit 4k (the AX100 tops out at 60mbit)-10 bit 4:2:2 uncompressed output, WOW! finally affordable 10bit!(well, other than blackmagic)Pair it with the Atomos Shogun-96fps slow motion, no it's not an fs700, but 96 is very nice! twixtor can do a LOT with that-All the fixings such as peaking, zebras, timecode etc...Even curves!-Ability to use speedbooster adapter-Addon unit for extra features/portsSome things im not quite onboard with-The Addon unit is huge, needs power, and i just don't see a use for most people's needs-Wish they would have figured out an internal ND filter, even just 1 would have been great-micro hdmi connector on the body is annoying, but not a deal killerSharpness/resolutionI haven't gotten a test chart in front of it yet, but the resolution looks pretty darn satisfying, they are taking a full sensor read instead of line skipping, so it's probably getting pretty close to that 4000 line mark.Moire/AliasingLooks well controlled, haven't seen anything horrible appear yet.Colors/CurvesI like them, feels warm overall and pleasing. And something i've been waiting for for a long time: a gamma curve to control shadows/highlights! It may not be as expansive as prosumer/pro video camera controls, but it's a very nice thing to have. The ax100 has basically nothing, just a cinematone on or off.10bit 4:2:2 outputFinally!!!! 8bit is remarkable for what it can do, but many have felt 10bit wide adoption has been overdue. It's tons more information and gives you far more to work with to grade your image. The cheapest recorder that can handle it at the moment is the $2000 atomos shogun, but hopefully we'll see some other options soon. Now if only they chose anything other than that hdmi micro connection....Lens choiceIs huge, you can adapt tons to this camera, including the speedbooster which as the name suggests, gives you a faster F stop when using larger format lenses. I'm also eager to try slapping on an old b4 zoom lens which i've tried with the c100 with mixed but encouraging results, and the smaller sensor of the m43 should be a big step towards usable with that. Or hopefully panny will come out with a power zoom version of the 14-140 and i'll be pretty darn content for event shooting.", "Date": "February 11, 2014"}, {"Title": "the swiss army knife of difital cameras", "Author": "TexAZ", "ReviewID": "R3EJEIL396JLHN", "Overall": "5.0", "Content": "I bought the GH4 at a local store, coming from a GH2 I skipped the GH3 which seem to lack important features, the GH4 seem like a natural progression from the GH2, with 4k video, great low light sensitivity, viewfinder and hi-res display, The slowmo feature comes very handy when I shoot sports videos.I would recommend this to anyone who is interested in a camera that is able to produce great photos as well as videos in a lite small package. it is very intuitive and loaded with features such as wifi, slowmo, time lapse mic and headphones jacks, 5 programmable function buttons and much more.", "Date": "May 5, 2014"}, {"Title": "Best Mirrorless Panasonic has made so far! Great upgrade! Improved LVF-EVF over GH3/G6, Insane amount of video options...", "Author": "Chifan", "ReviewID": "R17HJBHQ1B35AS", "Overall": "5.0", "Content": "Just received it yesterday and love it! I did not get it via Amazon as it was not available yet.Just tested it on a photo/video shoot today for a client, and I'm still getting used to it.Just to introduce mirrorless to non-mirrorless users, I've been shooting Micro Four Thirds for years using GH1/GH2/G6 and at times GH3 (though I was never sold on GH3 due to its poor EVF and not much of an upgrade from hacked GH2 in terms of image quality, so I never bought it), mostly for video, and this is the best video oriented mirrorless or DLSR camera you can find today, as of April/May 2014. I've shot many works using the GH series and love them compared to the Canon 7D or 5Ds, much lighter and more versatile, even though you don't have as shallow DOF as full frame. Though with a speedbooster or RJ Lens turbo, you can get closer to Full frame (around 1.42 crop for mirrorless vs. APS-C's 1.5 or 1.6) in terms of sensor size, so it's basically similar to academy 35mm and slightly better than APS-C, so really in the end, you're fine with mirrorless and speedbooster. So anyways, back to GH4.*** PROS ***1) My biggest design pet peeve on GH3 and G6 has been resolved on GH4: The LVF-EVF on GH4 is much improved over the GH3 and G6 (i hated the EVF on the G6, you can't pull focus with it even with peaking - GH3 had bad EVF implementation as well because it lacked pixels and spatially arranged the RGB pixels, resulting in much lower than advertised resolution - about 1/3 or 1/2 of similarly speced resolution on an LCD type EVF like those on GH2 or G5). It's not perfect yet on the GH4, but I can live with it.2) I haven't tested the photo quality extensively yet, as I have been shooting video mainly, but I'm sure it's as good as OMD-EM1 and any APS-C DSLR based on all the reviews online so far. So I won't dwell on it as it is a video-orientated review of mine (so don't bash me for not putting a stills review)... I'll be using the GH4 as my main camera for my photo shoots as well from now on. Obviously in low light, it probably won't allow the insane high-ISO performance of full frame DSLRs... but from what I can tell images are all usable from ISO 200 to ISO 3200. Starting at ISO 6400, you get a lot of noise, and anything past that, is not for professional usage. Color reproduction on LUMIX are good, again, I don't think Panasonic is the king in terms of photo, but they have now caught up with Olympus EM-1 I feel. And it's as good as a 7D, T5i, Nikon D7100, etc... in my opinion.3) As far as video is concerned, it's a beast. Perfect for event shooting as it gives you a lighter setup than Canon DSLRs, and lots of options with an insane amount of lens choices due to Micro 4/3 standard. The 12-35mm X lens is super fast at autofocus on the GH4, thanks to DFD detection. Autofocus seems faster and more accurate than GH3 or G6. The Cinelike D profile is flat enough to do some nice color grading with it, totally usable for professional environment or narrative, especially with the 4K setting or the 100Mbps settings in Full HD. I haven't tried the 200Mbps all-I setting, and won't do it for now as it's using too much SD card space for my purposes.- 4K setting: Image is super sharp on an HP ZR2740w 2560x1440 monitor. Great in Cinelike D mode. Love the quality out of it, and the fact that you can crop down to 1080p or downscale if you want to get higher image quality on Full HD. Though hard to do post with it for now given my limited Macbook pro capabilities, so you need a fast computer with good graphics card and lots of memory and fast HDD or SSD preferrably to process 4K.- 1080p settings: A plethora of settings from 200Mbps to AVCHD (by the way, the 1080p60 28Mbps on GH4 is very good if you want to save SD card space, and better to my eyes than the 1080p60 50Mbps IPB setting for me). You can't go wrong with it... the only disappointment is the 1080p 96fps setting, not very fine in terms of detail (more like upresed 720p as far as I can tell)... seems to be quite compressed and low resolution... so alas, not as good as 1080p60 in terms of image quality. So I'll be using 1080p60 at 50 or 100Mbps for most of my work. If you don't need such space eating settings, the AVCHD 1080p60 at 28Mbps is very nice I found, I sometimes like it better than the 1080p60 IPB 50Mbps setting, so the AVCHD compression implementation on GH4 is good, just like on G6.- Also an added feature is to create timelapses in camera... Electronic shutter is very useful there so as not to add to the actual actuations... great feature!4) Ergonomics/Functionality: All seems to work fine, lots of Fn buttons for customization and lots of video oriented features like master pedestal, zebra, histogram, stereo headphone input, timecode, external YAGH attachment, etc. Wish the ISO button was elsewhere or at least customizable via Fn button so I can use it as it was on the G6 as opposed to being in the middle of 3 buttons... hard to find it when I need it... especially when I shoot with my EVF to pull focus, change shutter speed, and aperture...5) ISO performance: Seems to improve on the G6 and GX7, and better than GH3 and GH2 obviously. DR is good, not ideal. Still lacking behind full frame in terms of low light and DR, but definitely works in all circumstances I've tried thus far in hotels low light lounges, for instance. I think it should work great for event. And you get the Panasonic great ergonomics in a small package, compared to the bulky Canon/Nikons.6) SD card compatibility: You should strive to use UHS-I Class 3 cards, but I read that other highly speced class 10 cards will work fine too. I have bought the Transcend 64GB UHS-I class 3 R-90Mbps / W-60Mbps, and it works fine with 4K and 1080p settings. I also have the Panasonic UHS-I class 3 card, and it works fine too. Though 64GB will give you only about 1h25min of 4K recording time.7) Improved EX-Teleconversion: On the GH2, it was quite noisy at the EX-Teleconversion settings which provided lots of magnification but created noise and lower resolution. On the GH4, the EX-Teleconverter function works nicely. I really like it and it's much improved in terms of noise and resolution on 1080p. Note that this won't work for 4K alas (hopefully they can create a firmware update... even if it's a lower rez'ed 4K, it's still useful as you don't want to change settings when you shoot).*** CONS ***After playing with it for a little longer now, here are some of my cons of the camera -> which could all be fixed via firmware release - so please fix these via firmware update PANASONIC if you read this!a) When you assign VFR ON at any rate (24p or 96p, or anything in between), only manual focus is allowed. You can't change back to autofocus. This is very annoying, please fix this Panasonic and allow us to choose between manual and autofocus in VFR mode.b) Panasonic, please allow \"ISO\" to be assigned to a Fn button, I just don't like the ISO change on GH4. I can't easily change ISO, Shutter Speed, Aperture all at once without fumbling while recording. The G6 implementation was much better, with the ISO change button, on the top arrow of the navigation wheel.c) 1080p96 VFR is more like up-rez'ed 720p as others have pointed out, very soft. Not really usable for professional usage. Hope this gets fixed.d) 4K image stabilization and rolling shutter issue. Basically you can't use 4K without a tripod. It's very very prone to shakyness on your movements. The OIS doesn't work very well on 4K, even with the nice 12-35mm lens. So you need a tripod for now. Plus Rolling shutter is much worse on GH4 at 4K than on 1080p. So just beware...e) Wished there were 2 slots for SD cards as the file sizes eat a lot of GB quickly if you use the 100Mbps or 200Mbps for 1080p or 4K settings.f) Headphone jack not ideally placed as it would prevent LCD screen from twisting around...g) 200Mbps All-I mode is not as nice as 100Mbps IP-B mode. So don't bother using 200Mbps as it uses too much space and is not as good. Please Panasonic fix your 200Mbps mode, make it more efficient and look nicer than 100Mbpsh) Wished there was an EX-Tele mode for 4K.*** In conclusion, despite some of the little issues that hopefully most can be fixed via firmware update, this is the best Panasonic GH iteration thus far. A great upgrade from GH2 hacked or GH3 or G6 with lots of extra features for the indie-filmmaker/videographer and freelance/photojournalist/studio photographer. Panasonic really did a great job this time and delivered the near-ideal hybrid camera for everyone (except maybe those who require full-frame for low light photography). I'm very satisfied thus far, though I haven't used it much yet, but I've used it in professional working conditions and so far it delivers greatly!", "Date": "April 30, 2014"}, {"Title": "The cinema 4K GH4 works with 200 million lenses !", "Author": "Joseph Ogiba \"jogiba21\"", "ReviewID": "R1TNPA9JUQ8QPV", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3C6TOFRUOU543embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3C6TOFRUOU543refresh_preplay() {\n\ndocument.getElementById(\"cv_mo3C6TOFRUOU543chiDiv\").innerHTML = document.getElementById(\"cv_mo3C6TOFRUOU543hiddenPre\").innerHTML;\n};\ncv_mo3C6TOFRUOU543refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3C6TOFRUOU543so;\t   \n\n\nfunction cv_mo3C6TOFRUOU543loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3C6TOFRUOU543so = new SWFObject(swfLocation, \"cv_mo3C6TOFRUOU543AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3C6TOFRUOU543so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3C6TOFRUOU543so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3C6TOFRUOU543so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3C6TOFRUOU543so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3C6TOFRUOU543so.setAttribute(\"height\", swfHeight);\n          cv_mo3C6TOFRUOU543so.setAttribute(\"width\", swfWidth);\n          cv_mo3C6TOFRUOU543so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3C6TOFRUOU543so.write(\"cv_mo3C6TOFRUOU543flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3C6TOFRUOU543', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3C6TOFRUOU543';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3C6TOFRUOU543', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3C6TOFRUOU543loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3C6TOFRUOU543\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2410AIS08JQ6C\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2410AIS08JQ6C\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1TNPA9JUQ8QPV\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2410AIS08JQ6C/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3C6TOFRUOU543duration')) {\n      document.getElementById('cv_mo3C6TOFRUOU543duration').style.display='none';\n    }\n    cv_mo3C6TOFRUOU543loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3C6TOFRUOU543loadSwf(movieID, playerVersion) {\n   return _cv_mo3C6TOFRUOU543loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3C6TOFRUOU543newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3C6TOFRUOU543', 0, h);\n}\n\nfunction cv_mo3C6TOFRUOU543resetPlayer(w,h,bw,cc) {\n  cv_mo3C6TOFRUOU543newHeight(h);\n\n  cv_mo3C6TOFRUOU543so.addVariable(\"resetBandwidth\", bw);\n  cv_mo3C6TOFRUOU543so.addVariable(\"cacheCode\", cc);\n  cv_mo3C6TOFRUOU543so.setAttribute(\"height\", h);\n  cv_mo3C6TOFRUOU543so.setAttribute(\"width\", w);\n  cv_mo3C6TOFRUOU543so.write(\"cv_mo3C6TOFRUOU543flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3C6TOFRUOU543RollOverImg = new Image();\ncv_mo3C6TOFRUOU543RollOverImg.src = \"http://ecx.images-amazon.com/images/I/91k7cI6X5qS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3C6TOFRUOU543preplay = document.getElementById('cv_mo3C6TOFRUOU543preplayImageId');\nif (cv_mo3C6TOFRUOU543preplay) {\n  cv_mo3C6TOFRUOU543preplay.onmouseover = function() {\n    cv_mo3C6TOFRUOU543preplay.src = \"http://ecx.images-amazon.com/images/I/91k7cI6X5qS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3C6TOFRUOU543preplay.onmouseout = function() {\n    cv_mo3C6TOFRUOU543preplay.src = \"http://ecx.images-amazon.com/images/I/91k7cI6X5qS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3C6TOFRUOU543preplay.parentNode;\n\n  var cv_mo3C6TOFRUOU543currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3C6TOFRUOU543currentClick) {\n      return cv_mo3C6TOFRUOU543currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:11 MinsI tried my 15mm F2.8 Sigma full frame fish-eye lens @F5.6 that I use on my full frame Sony VG900 camcorder and PK-MFT adapter and shot this video in UHD 4K 2160p. I uploaded it also to youtube in UHD 4K 2160 :[...]", "Date": "May 4, 2014"}, {"Title": "Short lived honeymoon", "Author": "Macuser", "ReviewID": "R1TM76HVU3D2MI", "Overall": "3.0", "Content": "Frankly, I never liked any Panasonic camera or camcorder for video recording in the past.  They all had serious color problems such as \"biondi blue skies\" \"purplish skies\" \"yellow tinged green foliage colors\" and so on.  I was skeptical of the GH4 as well because many sample videos I saw posted on the internet had an orange or yellow tint to them.  Soon after getting my GH4 I was delighted to find the camera had improved color. However, after shooting a lot of stills and video the honeymoon was over - I found the colors continue to be disagreeable - that yellow tinge the camera imparts to green foliage is very annoying.  And neither the stills nor the video of the GH4 are as sharp as they should be (the stills of my inexpensive Olympus E-PL1 are noticeably more detailed).  I've also had problems with the focus box wandering around without my knowledge with the result that hundreds of photos end up being slightly out of focus because the focus box wandered away from the center point without me paying enough attention to notice.  To have this happen on an important sight seeing trip is extremely infuriating and discouraging - because you won't even know your treasured photos are ruined until when you get back to your motel room to review the photos. Bottom line is I am not thrilled with the GH4 and I'll get rid of mine as soon other manufacturers come out with affordable 4k competitors to the GH4.  My dream 4K camera would be an affordable Canon or Olympus.", "Date": "May 19, 2014"}, {"Title": "Got mine just a few minutes ago (4/29/14)", "Author": "Bob F.", "ReviewID": "R17AW8CT13Y9EZ", "Overall": "4.0", "Content": "A nice surprise as I was expecting it later this week.  Upgrading from a Canon 7D and using it in conjunction with a Pany AF100.  Will be testing this baby over next couple of days, but I am waiting for an upgraded SD card for some compressed 4k shooting. :-)  Probably the most excited I've been about a camera since the AF100.  I do mostly video work, but shoot a  lotta stills.  Will do some comparisons between the Canon 7D and G4.  4 stars are just for being here ahead of schedule.Update:First impressions out of the box, coming from the viewpoint of an old Canon 7d user:I am comparing a Canon 7D with a EFS 17-55mm lens and the G4 with a Pany 14-140mm.The obvious:  The G4 is about half the size and much lighter but it still feels solid in the hands.  Crop factor is 2X (goes up to 2.3 in some 4k movie modes).  Interface is a nice step up from the 7D, although I'm having to get use to not accidentally touching the LED touch screen and going into some menu mode.  Oddly enough, the Canon zoom above is about twice the size of the Panasonic, but when comparing a Panasonic 100mm-300mm to a Canon 55mm-250mm, the Panasonic is about the same size but weighs more than the Canon.  You do get some usable reach with the increased crop factor which makes my Panasonic 100mm-300mm equivalent to a 200mm to 600mm telephoto.The articulating LED is definitely a nice feature compared to the 7D's fixed backplate one.  When opening the LED up on the G4, it feels a bit flimsy.  It seems to actually push up on the LVF rubber eyepiece.  I wonder how much use it will take before becoming a problem?The back video record button (used when not in \"movie\" mode) is not as easy to turn on/off when you have big thumbs.  It's nice that it crops the LVF frame when you are recording so it's real easy to tell if it is recording video or not.  There is a slight lag when turning video recording off so it's easy to hit the button twice because you thought you didn't stop recording at first.  The \"movie\" mode is nice in that it gives you the proper framing from the get-go in the LVF, and now the shutter button starts and stops video recording.  One thing I do NOT like about this is that apparently you lose the ability to shoot stills when shooting video.  And that goes for shooting video while in the \"still\" modes.  So in order to shoot stills in the middle of a video shoot, you have to end video recording and then shoot the still.  If you are in \"movie\" mode, you have to change modes.  I might be missing something as I seem to recall that you can shoot video and shoot stills at the same time with the G4.  I guess that's what the manual is all about. :-)Silent shooting mode is truly silent...7D has a quiet mode, but the mirror is still moving so you hear it pretty loudly.The LVF is a pleasure to use.  Nice and bright and unlike the 7d, you can use it for playback as well as menu selections.One thing that drove me crazy with the mirrored cameras is that when in live view mode using the LED, shooting a high speed set of stills basically disabled your LED.  I use an attached Zacuto EVF on the Canon LED and would shoot sporting events through it for video purposes, but every now and then I'd like to shoot a bunch of high speed photographs and this would often blow it for me as I would have to either take the Zacuto off and then look through the viewfinder or spray and pray using the blacked out LED.Looking forward to using the internal time-lapse feature.  The remote timer is another piece of gear I no longer need in my bag.I have had one problem so far. Some odd LED screen-to-black blips has been happening as I move the camera around.  The LVF does not do this, but there have been at least a dozen times when twisting the LED and rotating the camera body, the LED screen goes \"off\".  I'm at the point where I can pretty much replicate it.  I'm in manual mode (although I don't think that matters) and I will slowly raise the camera to about 45 degrees towards the ceiling with the LED maybe twisted at about 15 degrees.  The screen goes off and then goes back on about 1 second later as I continue in my arc.  Will test it further and take a video of my action.  Not a deal breaker, but it makes me concerned that there's something not right with this particular camera.  (I almost think it's the LED thinking I'm reversing it around to 180 facing because it only seems to do it when I'm raising the camera up slowly and putting a slight twist on the LED).Anyway, besides that one concern, I am looking forward to doing some comparison shooting, both video/stills with the two cameras.  Do not have a high speed SD card yet for 4k, but it's coming in the mail.  Will update this review when I get some of that done.", "Date": "April 29, 2014"}, {"Title": "Awesome video camera, great stills camera too.", "Author": "Pepa", "ReviewID": "R31RHKSFXWVFK1", "Overall": "4.0", "Content": "Terrific bang for the buck.While I prefer the Olympus OMD-EM1 for stills, this GH4 is a terrific overall package (for stills and video).I am primarily a stills event photographer but I am jumping into 4K videos now and this is the best option for 4K.I also looked at the Sony AX100, AX-1 and Z100, as well as the BMC cameras and decided to go with the GH4.", "Date": "May 17, 2014"}, {"Title": "Some info on SD cards", "Author": "Bert C.", "ReviewID": "R32O6UW3MYXY0H", "Overall": "5.0", "Content": "Hey guys, I haven't received my GH4 yet, but I thought I should let you guys know something, I've been researching compatible SD cards. On Amazon, there is 3 options, the Kingston, Transcend, and the Sandisk. You specifically want the U3 designated cards which these 3 makers have. If you read the reviews on the Kingston SD card, a guy has tested the speed of these 3. Unfortunately if you have read up about Kingston SSD drives, you know they are a pretty shady company, and my buddy says the only card that ever got corrupted was a kingston.. so... take of that what you will. Transcend's speed was very low, but I saw one review that said it worked in his GH4.. but who knows. I always thought Sandisk was not the greatest 3rd party memory seller, but I guess they are pretty much the best out there, speed and quality wise. That Blunty fellow did a GH4 review and said his old Sandisk Extreme Pro SD cards that weren't U3 could handle 4k recordings without any visual loss.. but I'd still get the faster U3 Cards. There is one more thing though, Panasonic actually has there own 4k U3 SD cards which are just coming out, you can buy them cheapest on Adorama, and they go for about the same price as the Kingston U3 cards. I returned my Kingston and I'm going to buy the Panasonic SD card because I'm thinking the quality should be high enough to handle 4k if they are from the same company as the GH4. I would just buy the Sandisk U3 cards, but they are twice as much for some reason still.", "Date": "May 26, 2014"}, {"Title": "GH4k", "Author": "RRRoger", "ReviewID": "R3AJIQAQ0SCFBT", "Overall": "5.0", "Content": "This is a company that is not crippling their new product like Nikon does.I don't see where they holding back anything for the \"next\" model.They are not only after upgrades from their customer base but market share.I already have a GH3 and it does what no Nikon or Canon does. It gives me unlimited - unattended Video at 1080P 60.The improved OLED Monitor and promise of better low light high ISOand better Video are enough for me to add the GH4k,but this is going to make a really good Event Photography Camera for stills too.", "Date": "February 21, 2014"}, {"Title": "can't say much about it since never got from Amazon.", "Author": "Lundincorp", "ReviewID": "R1ZJHPWW2TEX1A", "Overall": "1.0", "Content": "I'd say this is probably a really great product but I don't know, I  preordered the item and expected it early May, the problem is that what I got was just the charger and battery.  I was upset that I didn't receive the camera, but that's not the worst part, when I went to return the item they refused to accept the return, because the camera wasn't in the box, even though I talked to an Amazon rep before I mailed it back.So be warned, if you get this through Amazon you might not get a camera, but they most certainly will charge you 1700+ for a battery", "Date": "May 27, 2014"}, {"Title": "Game changing Camera! Canon is in trouble :-(", "Author": "KidVid", "ReviewID": "R1TX1ZI4WDSQGR", "Overall": "5.0", "Content": "Can't wait to get my hands on this camera. It will address all the flaws that the canon cameras are plagued with starting with 4k recording that canon also has but for a 15k price tag. Also a better audio interface hardware and tons of other options that you cant get right out the box with the canon cameras without ML or a bucket of money. Love canon and all there great cams but they should have came out with a camera like this 4k ago. Suckers!!!", "Date": "February 18, 2014"}, {"Title": "Not a Cinema Camera. Poor image quality.", "Author": "DirectorOfPhotography", "ReviewID": "R28J4170MBLQ3R", "Overall": "1.0", "Content": "With 8 bit and 10 steps of Dynamic Range, the GH4 doesn't stand the comparison with Blackmagic or Arri cameras.The 4k is here only to sell with buyers who wanna show off.", "Date": "May 27, 2014"}, {"Title": "4k is easy", "Author": "falk", "ReviewID": "R3P9UFYCOPEMOQ", "Overall": "5.0", "Content": "4k is very easy to implement on all cameras. because they have today all 4k x 4k or 4k x 3 k chips. you need only to increase the cpu speed. what we need is multicam and 4:2:2 and 13 bit cinema solution also.", "Date": "February 7, 2014"}], "ProductInfo": {"Price": "$1,699.99", "Features": "Professional photo performance with exceptional moiré suppression\n4K 24p cinematic video (4096x2160), plus 4K 3840x2160 30p/24p\nHigh speed 49 area auto focusing in photo or video, perfect for hybrid photography\nDurable magnesium alloy body and exceptional shutter life meets the demands of professional use", "Name": "Panasonic LUMIX DMC-GH4KBODY 16.05MP Digital Single Lens Mirrorless Camera with 4K Cinematic Video (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/41yXUyh7N8L._SX300_.jpg", "ProductID": "B00I9GYG8O"}}