{"Reviews": [{"Title": "Amazing camera with a few quirks. A worthy upgrade to the G1x.", "Author": "Perry M. Rogers", "ReviewID": "R1L8GZGMXMNPOD", "Overall": "5.0", "Content": "Got this camera about a week ago and have been putting it through its paces with about 500 shots so far. It is a very nice camera in general with a very user friendly interface and great picture quality. PROS:- Touch screen interface allows for easier controls and more options than just using the buttons from the G1x.- Shoots MUCH faster than the G1x. Can shoot 5.2 fps compared to 1.9 fps.- Two control rings around the lens, and one of them is customizable to ISO, aperture, etc. Makes manual mode just as easy to use as most DSLRs.- VERY comfortable in the hand. Not too big, not too small.- VERY well made. The build quality is amazing. I feel like I could drop this thing 50 feet and it would be just fine. Its kinda heavy, but I think that is from the metal build.- Autofocus system is much better, instantly focuses on pretty much anything.- OLED screen is better than the old one. It has a noticeably better resolution for sure.- A wider f/2 aperture allows for better low-light pictures- Better wide angle, better zoom, better lens in general, Wifi is nice feature as well.- Definitely smaller than the G1xCONS:- No optical viewfinder. Optical viewfinders are on the way out in general, but the OLED screen is very glare prone and is extremely hard to see what you're taking a picture of in high sunlight. Its just not bright enough for heavy sun. If you DO want a viewfinder, you have to pay $300 for the electronic one that attaches to the hotshoe.- Battery life is CRAP. This is probably due to the screen being on full brightness all the time.- less true resolution than the G1x. 13.1 megapixels vs 14.2 megapixels.- picture quality seems to be exactly the same as G1x. I couldnt tell a difference.- Price- Picture on screen can be very different than the picture that comes out when uploaded to a computer. This was definitely very frustrating.Overall, very sturdy camera with a nice size and feel to it. It has much more functionality than the G1x and a much better user interface. This is definitely a worthy upgrade to the G1x. Whether it is worth an extra $350? That remains to be seen.", "Date": "April 10, 2014"}, {"Title": "Perfect for the use case", "Author": "Jay", "ReviewID": "R36AP9XAC30WGD", "Overall": "5.0", "Content": "Let me start by being honest up front - I'd want my 7D and bag full of glass with me at all times if I had a personal valet and bodyguard.  Unfortunately I don't which means I'm not going to shlup thousands of dollars and 20 lbs of equipment for a Saturday stroll through Pilsen or Chinatown - but I may still want to grab some nice shots.  I also attend a lot of big festivals and concerts where \"professional camera\" = removable lens = not allowed but my Galaxy phone just doesn't cut it, especially as the sun goes down.This camera is the closest you can get to DSLR quality in a (rather) compact design.  I'm upgrading from my G12 which has seen better days and was quite pleased with the upgrade for a couple of reasons:1) I can now control my camera with my phone or tablet (live view + remote control) as well as instantly send those fantastic photos wherever I want on the spot.  I do food photography on the side, great for the quick setup where I'm not getting paid, but still want to post a quality photo to Yelp, Foodspotting, whatever to do justice to their product.2) Image quality is fantastic considering the platform and low light shooting is making me giddy for the possibilities3) The wide lens range will be great for those architecture and crowd shots and then anything I need to zoom in on4) I love the ability to shoot jpg/raw with different aspect ratios5) Built like a tankFor the cons:1) No OVF - my G12 had one and I rarely used it.  DSLR I absolutely need one, on a compact - not really.2) Not very pocketable to say the least  - the box shape of the G12 allowed me to fit it in my jeans when needed.  The lens on this sticks out over an inch so it is difficult to impossible to get in my jeans pocket - and with the weight, forget about a shirt pocket.  Looking to get either a wrist strap or small bag that I can drop it into.3) Price - definitely not cheap - that took some consideration.  But as a semi-pro / serious enthusiast, I needed something that could deliver quality shots for times I just didn't want to deal with the hassle of the big camera/bag/lenses.I've had the camera for a couple of days and so far loving it, will update the review if I run into any surprises - good or bad.", "Date": "April 22, 2014"}, {"Title": "Big Honkin' Bright Lens", "Author": "Q", "ReviewID": "R2M3U3V0HBX7VF", "Overall": "5.0", "Content": "The big story on this camera is the amazing lens coupled with nice, bright aperture, and a huge sensor (bigger than micro-four-thirds), giving truly amazing low-light performance. I can take excellent pictures with this camera indoors with no flash, photos impossible for most other cameras. The glass on this camera is huge, and it closes with a built-in lens cover!! It also has great macro performance; you can take wonderful close-ups of flowers etc. Auto-focus is very good, giving nice sharp pictures.Another notable feature is the pop-up flash, which is hinged, so you can easily put your finger under it while shooting to tilt the flash up and get \"bounce\" lighting from the ceiling indoors. Much better than the usual flash lighting.The camera is quite compact and comfortable to hold. There are a multitude of menu options for shooting, with all kinds of cool special effects including fish-eye lens effect, HDR, starry sky, and special background defocus mode, which shoots two fotos at different focus points, and combines them to blur the background, for great artistic portraits etc. Although the lens and sensor are big enough to achieve very good \"bokeh\" even without this special feature.The tilt-screen is also pretty amazing. Not only can you shoot holding the camera low to the ground, or high up in the air, but you can also flip the screen completely up to 180 degrees for taking \"selfies.\" This is the only camera I know of with this capability. Also, it's a touch screen, and you can tap on the screen to select your focus point.Best all-around camera I've ever seen. The combination of lens range (from 24-120mm), sensor size, bright aperture, compact size make this camera truly unique and without any real competition. It even takes pictures in RAW. The only camera I would compare to it is the Sony RX10, which has a longer telephoto lens and bright aperture, but the sensor is smaller, and the Sony is twice as big.", "Date": "April 29, 2014"}, {"Title": "Explore the limits of point and shoot.", "Author": "Coug Moog \"s_gil\"", "ReviewID": "RRPGOVWX9QISC", "Overall": "5.0", "Content": "There are very, very good high end point and shoot cameras out there from Canon, Sony and especially Fujifilm.Each has reasons to recommend it. Sony has the most zoom in a pocketable package and a ton of megapixels on a reasonably large sensor. Fujifilm has true pocket ability, a bright lens, and astounding color rendering. Canon's G1x seemed to be a one-trick pony with its larger size due to the better glass hung on the front. And even that was compromised in the Mk 1.The lens on this model is a total redesign. In fact, the whole camera is a redesign from the G1x. It gets different dimensions in every angle. It gets a bigger sensor with much bigger pixels for astounding light and color performance. It gets Digic 6 and a faster chip, and improved wireless image transfer capability.I went without the G1x because it suffered from some critical flaws in its basic design that made me a Fujifilm customer. But I was really missing that big Canon lens-sensor combo for outdoor and architectural photos. When I sold my X100 (for a premium price, natch) I got what many would consider a lesser camera in the G1x ii.I guess in most ways I disagree. I get a lot of shots with the Canon that I was missing with the X100 because I was futzing with the controls to get the settings right. The G1x let's me get set up for each shot in a tiny fraction of the time it takes to set up the X100. I found I was actually using the auto mode in the X100 to get people shots I would otherwise miss. Thank goodness the auto mode is very good on that camera.With the extra physical controls on the G1x, I can set up a shot very quickly for exposure, depth of field, bracketing etc. in a minimum number of steps. Meaning I don't miss the shot as much. Yes, the camera is bigger. No, I won't pop for a $300 EVF. I don't know if anybody mentioned this, but the industrial design and proportions of this chunky camera are sweet. It's a good looker, with each control designed to look great and perform well.It competes well in image quality with my last point and shoot, and tackles framing better. Skin tone rendering is very nice, though I must say the X100 is quite a bit better in that regard, particularly in low light. I do like the bounceable flash. The lens barrel bayonet mount is a bit hokey and doesn't hold much. Thankfully the most used filter, the ND, is built in and can be switched on or off in 3 clicks.Feels very good in the hands. Well made, tough.Kind of a travel cam. A little large to carry around all the time. I just use the iphone for quick shots now. Missing the X100's portability at times, but in general, for the way I shoot, I prefer the G1x ii.", "Date": "April 14, 2014"}, {"Title": "Great camera for a specific niche. Most quirks are software based.", "Author": "Todd Gilbert", "ReviewID": "R3GM9PLOJ483RL", "Overall": "4.0", "Content": "Why I Bought ItI’m going on a 3-week trek across France, Switzerland and Italy later this summer where I hope to only bring one carry-on bag. All of my camera kits are just too big/valuable and I wanted something compact and versatile. Must haves for me were a lens wider than 28mm, a big sensor and ease of use.I really thought about bringing my EOS-M with the 11-22mm lens (which I had to import - thanks Canon USA!... not), the 22MM pancake and the 18-55mm. I ended up deciding that was just too much to bring. So my plan is the G1XII in my bag - and my trusty old G12 in my wife’s just in case the G1XII gets stolen, dropped or malfunctions.Image Quality- Noise is very very well controlled. I read the DXOMark graphs too - but in real life ISO 3200 is 100% usable and the even higher settings are fine for web photos.- F2 is 100% usable if your subject is more than 4ish feet away. When its closer than that you start getting some ghosting around whatever is in focus. That goes away around f3.5 (the speed of the EOS-M’s lens I might add).- Image stabilization is very effective - its really amazing actually combined with a fast lens like this.Operation & Autofocus- Startup feels instant- Review after a photo is taken feels very fast too- AF Speed is much improved over the G1X, feels considerably faster than my 5D- AF hunting has only been a problem so far in very very dark conditionsHandling- The front ring cannot be set to zoom. This constantly feels so un-natural. If my 10 year old Powershot Pro1 can do it… the flagship in 2014 sure as hell should. In AV mode I have it programmed so the click ring is zoom stops and the smooth ring is aperture - this is the opposite of any 35mm lens I have ever used - yet it’s the closest setting to one you can configure. You can even set the little thumb wheel on the back to zoom but not the front ring…. wha???- I miss the dedicated EV wheel of the G1X and G12 (also in my fleet).- The touch screen is nice - but several things you cannot interact with. The other night I was shooting some photos and I wanted to change the ISO - so I tapped on the ISO setting…. nothing…. nada… I had to get out my phone to shine some light on the back of the camera to find which button does ISO.- The shutter release button is very small - I keep trying to depress the very prominent mode dial. (Which by the way Canon - a lot of people rarely use…. my camera is on AV mode 80% of the time). You actually have to arch your finger over the mode dial to reach it. Strange design decision.Build Quality- Very solid and feels heavy- Tilt screen feels much more fragile than the old tilt. Im glad I bought a Squaretrade warranty on this one.Missing Features- GPS. I bought this camera for a trip across Europe - I was really disappointed once I found out there was no GPS. I bought it anyways… but its still will be sorely missed.- Microphone Input. This should be standard on a camera with HD video - especially a flagship. I feel like they left it off just so I don't want to sell my EOS-M.  That’s not a good feeling Canon.- External speedlite control. Nikon has been doing this for years… to my knowledge the only Canon camera that can do it is the 7D. As I said in my review of the G12 - Canon you should really fix this.- You should be able to do RAW to JPEG conversion in camera.Actual Bugs- If you insert a memory card after the camera is on - it won't recognize it. You have to turn the camera off and then on again. First time using the camera I thought it was broken and ended up formatting the card (which also made it recognize it).Summary- Best compromises yet for travel camera- Very impressive image quality- Fantastic lens- Touch UI is better on EOS-M- Controls need better customizations- Lack of GPS is pathetic", "Date": "April 25, 2014"}, {"Title": "BEST OF BOTH WORLDS - BUT AUTO-FOCUS", "Author": "Photo-Am \"Vlad\"", "ReviewID": "R15PXQ9PLGSDI4", "Overall": "4.0", "Content": "For years I was dreaming about a camera with such combination of characteristics in one body:- Big sensor (in comparison with most P&S; cameras)- High quality zoom lens with a big enough aperture for nice bokeh- Small size (in comparison with DSLR's)- Affordable priceAnd here it comes - Canon G1X mark II. It is pretty different from its predecessor, but it is exactly what I'v been looking for. For years I was switching between a number of Nikon DSLR's like D300s, D700, D7000, and some smaller ones, and after that some promissing Panasonic G3, G5, and with each model I was buying a good zoom lens with the equivalent range about 28 - 75 mm and apperture F/2.8. I was very satisfied with the picture quality of all those nice cameras, but the problem was - because of their size I could not keep them with me on the every-day basis. This new G1X-II has all the qualities which I tried to achieve with my other purchases, and in particular:- About Micro-4/3 sized high-sensitivity CMOS sensor.- Wide variety of the image aspect ratios: 1:1, 4:3, 3:2, 16:9, and a rare but useful 4:5.- The sensor geometry provides almost the same vertical angle of view for ratios 1:1, 4:3 and 3:2.- Huge ISO range from 100 up to 12800 (still good for Internet uploads).- A high-quality zoom lens 24 - 120 mm (35mm equiv.) with optical image stabilization.- The incredibly bright aperture F/2.0 - F/3.9 in the zoom range, and 9-blade diaphragm for nice bokeh.- Quick and reliable auto focus system with 2-angle AF-assist light beam (for close and far subjects).- Hot-shoe for external flash.- Recent DIGIC6 processor for high-quality images and sophisticated noise reduction at high ISO's.- High resolution 1MP titling display.- Good quality Full HD 30p video with working zoom and continuous autofocus.- Relatively small size to put it into my outwear-jacket's pocket.SAMPLE_PICTURES: I've uploaded some sample pictures but Amazon does not allow the external links in the text of the review itself, however they don't mind them in comments. So I put a link to the sample pictures in the most first my comment to this review.AUTO_FOCUS: I wish this camera would be a Holy Grail for me, but at my first portraiture session I bumped into the problem I less expected - auto-focus failures. I've missed many nice shots because when I was half-pressing the shutter button to lock a focus on humans' faces, it was rejected by giving me a yellow (instead of green) focus-area rectangle with the exclamation mark. Along with the focus-rejection cases there were also many other ones where I could take a shot but when viewing them on a big screen I could admit the focus was actually locked on something behind while the entire human face with the eyes was blurred. With all my former DSLR and P&S; cameras (Nikon, Sony, Panasonic) I never had such problem before, so I was totally confused.While analyzing such cases later I got an idea that might happen when behind the relatively low-contrast human face there was something more contrast, what could attract the AF attention - that could be a book-shelf, a painting on a wall, even that person's hear... for example if a girl or a young woman (with no wrinkles on the face) has a pony-tail and turn her head a little bit so that pony-tail is visible, the camera easily locks the focus on that relatively-contrast volume of hear with threads instead of the face itself. Or what happened even more frequently - it could not lock the focus at all making the entire shooting impossible (yellow focus rectangle with the exclamation mark).The worst thing is you don't have any control over that strange AF behaviour. You only have a choice between a medium size center focussing area and the face-identifying mode. However from my experience with many other cameras the latter one might be only good on the P&S; cameras with long DOF, while for the big-sensor cameras that face-mode does not garantee the eyes would be in focus - it might focus on something else like teeth or hear. So for that session I chose the center-area focussing. When I was shooting portraits with my other DSLR's I always selected 1-point mode and aimed that area to the nearest human's eye - so my pictures always had a perfect focus. The similar way, a number of Canon P&S; cameras have a choice between medium- and small-size focus area, however this model somehow has no such choice - only mid-size one.However even you switch to the face-focussing mode it will not solve all the problems. I've found it works good only if a person looks strait to the camera and there is nothing on the top of their head or around it - if there is a hat, or a cap, or something like kerchief, headscarf, or shawl - most of the time camera cannot recognize such a face. It's also a problem if a person turned their head so not the full face is visible... etc.And finally - Manual Focus - it was not fun using it. A while ago when I was shooting with my film cameras, I was holding a camera with my right hand and turning the focus ring right-and-left with my left hand. It was enough to turn that ring just 20 degrees right-and-left to easily find the point somewhere in the middle with the best focus. Since my hand can make maximum ring rotation about 30 degrees without changing the grip, all the time when I was adjusting the focus the camear was held with my both arms and so the picture in the viewfinder was stable and the entire focus-finding process was pretty quick.However in this model in order to see the same difference between good and bad focus I have to rotate the manual focus ring 3-4 times more, what leads to the 2 consequences:1) Since with one my hand I can rotate that ring maximum about 30 degrees at one attempt, it needs several repetitive steps to rotate to left and then the same to right, and do it probably several times to see the difference in sharpness and therefore to find the central sharp point. The problem is - nobody can wait for so long time while I'm playing with my camera - the most valuable in humans' portraits are their faces' expressions which spark and fade, and no one can keep it for more than 1-2 sec. So if you cannot take a shot immediately - you lose it.2) Since the focus-finding process becomes a several-steps process, where you have to rotate the focus ring, change the grip, rotate again, and so on - that changing the grip makes the camera shaking, and since in MF mode the central area is additionaly magnified, the image on the screen is shaking pretty much what makes the finding a good focus even more difficult and even more time-consuming.BTW, along with this G1X mark II, I've recently purchased another new Canon travel-zoom camera SX700. What they have in common - the recent DIGIC6 processor, and I realized, when I was shooting some samples pictures with that SX700 I also experienced a number of cases when camera was not able to lock the focus. One of the sceen examples - I tried to take a shot of a single magnolia flower with a bunch of branches behind - most of the times it worked, but sometimes the camera denied to focus on such subject at all, but it did not happen that frequently as with G1X mk II.Generally speaking this G1X mk II is a very good camera in most aspects, while the above mentioned auto-focus issue, which happens on some shooting scenarios, from my prospective is a completely software problem which could be fixed with a firmware update if Canon would be willing to do it for this model.", "Date": "April 15, 2014"}, {"Title": "Travel Light-It's a worthy replacement to my T4i", "Author": "MSTJames", "ReviewID": "R3PFVO625VIJFQ", "Overall": "5.0", "Content": "Why did I buy this camera?  Travel.  I usually travel with my T4i and lens (18-135mm/50mm/10-22mm).  I am ready to lighten my load.  Carrying a lot of camera gear when traveling adds stress because I take the gear with me everywhere.  Even to the bathroom.  I also have a G16 as a backup camera.The images on the G1x Mark ii are as good (really) as my T4i.  Here are the likes:-First on the list is the images and the big sensor.  To my eyes (even with readers) they are as good as the T4i-In other reviews it is mentioned that the focus is fast and the lens is bright.  IT'S TRUE!!!-I like that the articulating screen flips up.  It is engineered well but wouldn't give the camera to a 5 year old to play with.-This thing is well built.  Both weighed the same.  T4i is slightly heavier on the kitchen scale.- Integrated lens coverSome things that I'm hoping will improve with the next version.  This camera has replaced my T4i.-60fps videoI have a Pedco UltraPod II Lightweight Camera Tripod that has long straps.  I would get this to pack in your travel bag.I'm looking forward to leaving the T4i and lenses at home.  Heading out on holiday in a week.  Will post an update and photos of Alaska.", "Date": "May 5, 2014"}, {"Title": "An improvement over the Mark I in most areas", "Author": "Thomas McLean \"absit iniuria verbis. Illegiti...", "ReviewID": "R2BYRKQCFCLG5V", "Overall": "4.0", "Content": "I have both the Mark I and for a week now, the Mark II.The Mark I was a camera that had a lot of promise and had several issues. The Mark II addressed an number of the defects and is the superior camera, but I miss some of the old Mark I features.Things I like about the Mark II as purchased:Picture qualityFast lensFocus speedBig SensorConstruction qualityWiFiGeotagging (with phone)Touch screenLens covers on power downTwin control ringsThings I don't like about the Mark II:A new battery...again.Battery capacity poorThe grip...the optional grip is much better but still not good enoughNeed a fancy adaptor to add a filter or lens hood.Cant add a filter and lens hood at same time.Things I'm still undecided on (will update later):Separate electronic viewer...expensive but works well. Good in bright sun.Surprisingly easy to go between touch screen and EVF.Tilt screen....miss being able to put screen facing camera back for protection.Things I preferred about the Mark 1:Handling... felt and looked awesome. This is really personal so your view may be differentSo I will keep both but will mostly use the Mark II. I would have been very happy with all the new Mark II updates in the Mark I body but I really like the Mark II as is also. It is a really great camera.I gave 4 stars because of secondary grip as add-on. Cost $35 including shipping. It's better but not quite as good as the Mark I. Also the new battery. I have ammassed and spent a small fortune on Canon's batteries alone and here we go again.I did not deduct a star for the separate EVF. The tunnel in the Mark I was useless and I used the screen 100%.Update5/10/2014I have used the camera quite a bit and really like it. Picture quality is first class. The bigger grip was a must for me and made the camera much more secure in my stubby fingers. I switched back to the original one just to see if the change was real and I wasn't just getting used to the camera. Sure enough, I had to go back to the bigger grip to get that comfortable feel.I love the fact the lens has blades that open and close. This is a big plus and helps keep dust out. However, I'm conscious of anything pushing the blades and damaging them so I added a filter (B+W 58mm XS-Pro Clear UV Haze with Multi-Resistant Nano Coating (010M)-incredible filter btw) and lens cap. You need to buy the adaptor to add the filter and the adaptor works really nice. Combo works great. I know it increases the bulk of the camera a bit, but this isn't a S120. It is over that threshold of not fitting comfortably in a shirt pocket or or even trouser pocket. Can't use Lens hood at the same time but it is really easy to swap them. The lens hood fits really well on the camera.I really like the touch screen for a number of reasons. Main one is I can get tracking autofocus by touching on what I want to be in focus (assuming you have the the right focus mode set in the Menu. It is fast and very convenient. A big improvement over the Mark I.WiFi is growing on me and I like being able to send photos to my phone and e-mail them instantly. I also like that I gan geotag using my phone. Can't help but think that an $800 flagship camera should have geotagging built in (all iPhones do). 1080P @ 60 Hz is missed but only a little. I take pictures 99% per cent of the time and can live with 30 Hz.....for now.This is a solid upgrade to the Mark I in almost every way....maybe the screen movement being the biggest negative (but the touch screen aspect is vastly superior).The market place has unbelievable choices and the competition is fierce. Other cameras have great features and produce great photos. For me, the Mark II gives me what I'm looking for and I'm very happy with my choice. I have owned all Canon G series from the G10 to G16 all the S series from the S90 to S120, numerous olympus cameras and several Nikon DSRLs. The G1X is a joy to use and produces awesome pictures. It is my favorite camera for now...just like when I bought my first Yashica Electro GTN.", "Date": "May 1, 2014"}, {"Title": "Love most of the changes", "Author": "Sophia Chang", "ReviewID": "RKCF9VZPJDTGB", "Overall": "4.0", "Content": "I've been waiting for an all-in-one camera like this for a long time. The RX100ii came close, but the sensor was too small for me. The previous g1x had the sensor, but also some fatal flaws. So I settled on the Lumix G5 and 2 lenses. I'm convinced enough with the G1X Mark II to sell off my m4/3 equipment, since I rather have the simplicity. Improvements made:- 12.8mp 1.5\" sensor- f2-3.9 aperture- 5x zoom- Tilting flash- Built-in lens cap, nice feat of engineering- Decent macro- Touch screen/focus- Faster AF, but still lags behind SonyI wish Canon kept the flipped out screen and the viewfinder (2 things I'll miss about the G5). Sure the previous viewfinder was small, but instead of getting rid of it, Canon should have improved on it. And why the new battery? To frustrate Canon owners with existing backup batteries? Most people like 2 control rings, but I rather use the thumb wheel instead since you have to use the thumb wheel to switch the functionality of the ring anyway. Now with the 2 rings, the thumb wheel is limited. This is still the best camera on the market for my purposes, 4.5stars.After using it a week, here are some more thoughts...1. The picture quality is superb. For me, it consistently outshines my G5 even with a f1.4 lens. F2-3.9 is a nice range especially at 120mm, creating nice DOF and smooth bokeh.2. Battery life is a stinker. Since Canon introduced a new battery, there aren't cheap options currently.3. Since the camera is big and heavy (for P&S;), the grip is way too small. I've figured out the best way to hold it, but it's still not that comfortable.4. The touch screen is too sensitive. When I have the camera hang against my stomach, the focus changes w/o me knowing. Touch shutter has to be turned off (and rendered useless) because my stomach would trigger the shutter all the time, and I have a reasonably flat stomach.5. Even though it's a 3\" screen, the screen takes up 3.5\". It gets in the way of my thumb.6. A flip out screen would have solved issues 4 and 5 above. Canon, why oh why did you get rid of it?I stand by my 4 star rating. Since the picture quality is so good and that there is no other camera on the market like it (sensor and lens), I will accept its flaws and happily enjoy this camera.", "Date": "April 22, 2014"}, {"Title": "Much improved over its predecessor", "Author": "S. Vogt", "ReviewID": "R1Q22WGQ3EW0BM", "Overall": "4.0", "Content": "While i still have a few criticisms about the G1X Mark II, this is a much improved camera over its predecessor. Listed below are the cameras pros and cons.PROS:-Excellent image quality and right up there with the Rebels. Good color reproduction, detail capture and decent high ISO performance. The lens has good sharpness throughout its entire focal range.-Operational speed is significantly improved over its predecessor, but not perfect (see cons). Autofocus has improved greatly and is almost about on par with the G16.-I find the ergonomics of the camera generally pretty good. I have large hands and the grip and thumb rest generally feel pretty comfortable.-The capacitive touch screen works great just as it has in other Canon cameras.-The LCD is bright and clear, even in sunlight. It's one of the best LCDs I've seen on a camera yet.-Build quality is excellent.Now onto the cons:-The camera tends to overexpose a bit just like its predecessor did. But unlike its predecessor it doesn't have an exposure comp dial on the top. It's not that hard to go into the menu and adjust it but it would've been nice if they retained the manual dial on this camera.-Autofocus is somewhat hesitant at times to lock on in low light but this is the exception rather than the rule, and still much better than the original G1X.-The flash switch can be a little cumbersome to access when the camera strap is attached.-And finally the biggest problem I have with this camera, the damn battery. I just don't understand it. Why put such a small battery in such a powerful camera? The battery life is mediocre at best and I would automatically consider purchasing an extra battery if you're going to buy this camera. You will need it for a full day of shooting.While it's not perfect, the G1X Mark II is a great camera that's enjoyable to shoot with and much improved over its predecessor with the notable exception of battery life. Despite being panned in some early reviews, I think it's every bit as good as its APS-C and Micro 4/3rds competitors, and a little bit better than the Sony RX100 II (though the Sony is still a formidable competitor and not to mention, also cheaper). It makes a great alternative to a DSLR for enthusiast who want APS-C grade photo quality in a much more compact body.", "Date": "April 25, 2014"}, {"Title": "YES, YES, YES!!! (a la Meg Ryan, \"When Harry Met Sally\")", "Author": "AdobeTX", "ReviewID": "R2WVWJZGGPMYBR", "Overall": "5.0", "Content": "It's been 10 YEARS since I've bought a point and shoot camera!!  I'm a professional photographer and have had all my nice pro SLR's (mainly 5D II's) to use over the years - have even bought the occasional Rebel to have something smaller for personal work.  But the quality from a PnS (point and shoot) has never compelled me to go out and say, \"YES, I need to get that camera!\"Well, I'm finally ready for something a bit more portable, and I finally don't have to compromise on quality.  I simply did NOT want another \"system\", so that ruled out all mirrorless cams. (I change around lenses enough for work!)  I just wanted ONE device that I could grab and go - that would give me the quality I want AND allow me the creativity that I needed.  I \"almost\" don't even want to shoot RAW.  I want EASY, but with good Quality!  (I edit photos for a living-after creating them, so I don't want more \"work\"!)So far after adjusting and playing with settings for over an hour and getting a good feel for it, I'm really happy with it.  I will definitely be ordering the larger grip and looking into the \"Thumbs Up\" grip as well.  Hard to get used to this smaller body after years of the large DSLR's.  But overall, I think approaching it as a two hands camera (like a DSLR) rather than one hand (PnS) will help.  Especially with the functioning rings on the lens.And coming from Canon 5D's and L glass, I'm super excited about the familiar feeling of this camera.  The magnesium alloy body is the same and as a whole has a nice heft and solid feel.  Oh the lens!  The f/2.0 at effective 24mm is simply the best (when used correctly!) ;)Focusing is pretty dang good (I prefer single point focus, no focus assist, no continuous focus, IS during shooting only) even in very low light conditions (with the help of manual override).  The manual ring requires a little more turning than I'd like (compared to a physical lens barrel), but it works very nicely all the same.The wifi options work great for me.  So far in my home wifi area, I was able to quickly access the network, connect to my phone with the CameraWindow App from Canon and download photos and videos straight to my phone.  Awesome.  Creating a direct network between the G1 X and my Samsung Galaxy SIII outside of a Wifi area is just as easy.As far as the battery life goes, I wonder if turning OFF the continuous AF and continuous IS (set it for just during shooting) will help the battery last longer.  I have a second battery on the way just in case.  Using the flash with low ISO will eat up battery BIG TIME.  Not a huge flash user myself, but just a little warning.It's funny how many of the \"AUTO\" settings that I turn off or take out of the FUNC menu (thank goodness for that customization!).  I just want to be able to use my vast photo skills instead of the using these \"crutches\" that are trying to make up for poor photography in the first place!Sorry if that sounded harsh, but yes this is a very capable camera for a capable photographer.  There is a green mode, but you won't be seeing me use it!Will save a review of shooting outdoors in full sun (and the need for the viewfinder) for a later time...Oh and I was amazed at some test videos I did out walking the dogs.  The built in IS, shallow DOF and autofocus make for some really great footage.  More awesomeness.In case I haven't said it yet, I am loving this camera!", "Date": "May 9, 2014"}, {"Title": "Great idea, but lacking a bit in performance.", "Author": "Rob Chang", "ReviewID": "R1H83DLB5CIXDE", "Overall": "3.0", "Content": "The G1X Mark II's larger sensor allows for that APS-C DSLR-like DOF control, and having it in a relatively small body while with a very good zoom range and a fairly fast lens of excellent quality, is actually kind of mind-blowing. The f/3.9 on the long end didn't bother me as much as I thought it would, since I was able to get decent DOF control with it. The photos I shot with this had that DSLR-like bokeh look for portraits that no other compact zoom could achieve when shooting the same subject/background setup (we'd have to move to the fixed fast lens compacts to get the same DOF control, but the compromise of losing the zoom range is unacceptable to me).The images are a bit noisy even at low ISO, but the overall look is pleasing (I've been a Canon shooter for many years, so the Canon sensibility is very comfortable to me). With a little bit of noise reduction and sharpening in Lightroom, the results were very good. What I can get with this camera is far superior to anything I could get with any of the compact cameras or smartphones I've ever used, and it's all because of the larger sensor size and the excellent lens.The size of thing was great too (even with the lens hood on)--small enough to fit a small top-loading styled bag that I could sling across the shoulder and keep it on me everywhere I go, without feeling encumbered by it. At this size, it doesn't get in the way at all, and I have no need or desire to ever want to try to cram it into a pocket of any kind. I've long stopped trying to carry electronic devices in pockets ever since I got the Galaxy Note 3, and much prefer using quick-release clips for my smartphone, quick-draw slings for cameras, and now top-loading bags.Ever since I have experienced touchscreen shooting on smartphones, I've become addicted, and the G1X Mark II has this feature. Touchscreen shooting is so much faster and intuitive for choosing AF spot instantaneously and with the same touch, also fire off the shutter. There is simply no way the traditional approach can compete against this. Focus and then recompose in comparison just seems so antiquated, as does having to move the AF point around with dials and buttons. Ugh. Who wants to do that anymore? For my needs, since what I shoot is 99% people, the face-recognition available in most of today's cameras does help a lot though, and the GiX Mark II has that too, as well as focus locked tracking with visual feedback. All of these touchscreen and live view-related conveniences are very desirable conveniences I don't have on my high-end 5D Mark III.The only thing holding the G1X Mark II back for me, were speed issues such as AF and shot-to-shot delays. They were average for a typical compact camera, and I tried to speed them up by using a class-10 SD card and turning off instant preview, as well as set all AF-related settings to increase speed and accuracy, but it just isn't a camera designed for speed. I shoot lots of candid styled photography where I'm tracking a subject that's moving around, so I need really fast/accurate AF and very short shot-to-shot delays that's comparable to a higher-end camera, and to ask that of the G1X Mark II is just unfair. If Canon were to put that into the G1X Mark II, it would cost a lot more than its current price. If it weren't because of my need for speed, I'd have gladly chosen the G1X Mark II.For shooters who don't need a speed demon and want a camera that while isn't pocketable, but still very small compared to other cameras with similar sized sensors, and have a very good zoom range with excellent lens, I highly recommend the G1X Mark II.", "Date": "June 4, 2014"}, {"Title": "take along camera", "Author": "Mary \"former teacher grandma\"", "ReviewID": "R1J6PK8N6RFK6M", "Overall": "5.0", "Content": "this camera takes great pictures, very good lens.  tired of taking your big bulky camera with you?  this is a good alternative.", "Date": "June 4, 2014"}, {"Title": "I like it with reservations", "Author": "Chris Newman", "ReviewID": "R358C0ORKI3ZVO", "Overall": "4.0", "Content": "I had this camera about a week and so far not taken that much with it so will add to these comments about later after a 2 week trip in the South West. This camera is a Point & Shoot so is not the cameras I will be relaying on, but its still a serious camera.As a pro photographer I'm not going into the camera specs or comparisons - you can get specs elsewhere for the pixel peepers as well as detailed reviews here. I am just going to give you my impressions of \"feel & quality\".Coming from a G11 this thing is much heavier and is not a \"pants pocket\" camera. Too big and too heavy, my pants would be around my ankles within an hour!! It feels really well made and will probably come close to DSLR image quality and it has features my Nikons don't. Well a lot happens in a couple of years.I bought it as the G11 was getting a bit long in the tooth and I was never happy with its noise levels or a 28mm wide on the lens. This camera is better at 800 ISO than the G11 at 100 ISO  and has a 24mm W/A lens. And that's what I really wanted. Try looking and see what you can find - not many.Handling: I have  problem with my left hand as I want to place my forefinger on top of the flash. OK if you don't use flash which I would avoid anyway preferring to let the camera set the ISO it needs. My Nikons I always shoot in Manual mode but this Canon will be in Auto for what it is used for. It seems to try to keep the ISO as low as possible. In fact you can limit the ISO highest number.I'll add more after 2 weeks of travel and use.Oh, one important thing I nearly forgot - I cannot connect this camera to my Samsung phone running 4.1.1. Speaking to Canon USA today they say the Apps will catch up but that should have been dealt with prior to the camera launch. It connects to an iPhone but who uses those!!!! Uhm....Just back from a 2 week photo trip in the South West and used this camera as a backup and point and shoot grab camera. First noticed that the screen is very hard to see in the outdoors or in sunshine. It needs the viewfinder to overcome those points - now we are getting into serious money. Picture quality/exposure is very good however. Camera feels to have sharp corners here and there. Also don't like the fact the rear view screen cannot be turned in to prevent scratching it. That screen when set to touch mode I found I was shooting many a picture not intended.It meets my purposes with its 24mm lens but may not be for everybody. When the viewfinder is added it's bigger and one is then closer in size and price to a mirrorless camera.", "Date": "April 14, 2014"}, {"Title": "Great Camera!", "Author": "Raja Bhat \"Raja\"", "ReviewID": "R3SGMOSHXFPH2A", "Overall": "5.0", "Content": "My other camera is an older Nikon D80 and a couple of point and shoots including a Canon G3 and a . Image quality is just like a good DSLR I think as compared to cheaper point and shoots. The WiFi is very convenient indeed. I was able to transfer photos to my desktop and also my Samsung Galaxy S4. Though, it was a bit of a learning curve, and I had to call Canon twice for help but they got me straight. On the desktop you have to \"add a device.\" Overall I am very pleased with this purchase.note: my home WiFi network is bit different from usual, it is called Open-Mesh. (I have 2 access points with this setup) The camera/smartphone/desktop would not work with this so I just activated the wifi on the wireless router, and then things worked OK. I guess that is because the smartphone and desktop need to be connected to the wireless right on the router, and can't be an access point.", "Date": "May 3, 2014"}, {"Title": "Great photos", "Author": "Ryan Durkin", "ReviewID": "R2W1JN7ZDCE0VW", "Overall": "4.0", "Content": "Love the camera! takes great photos. cant wait to carry it everywhere. just a couple issues I hope a firmware update changes. I wish canon would allow me to connect the Canon GPS Receiver GP-E2. I travel out of the country and in areas where my cell phone isn't possible to geo-tag photos and taking a camera of this size would be perfect.Also the wifi button is in a bad spot. I keep hitting it and causing myself to miss a shot. I wish there was a way to deactivate the button within the menu.I would def give it 5 stars if these issues are addressed!", "Date": "May 16, 2014"}, {"Title": "Canon has done it again.", "Author": "Rishi Raj", "ReviewID": "RQUD1ASGZA06Z", "Overall": "5.0", "Content": "Great camera. Excellent pictures including low light images. Not small enough for a pocket, but small enough. Wish they had some more \"manual controls\" on the camera, the extra exposure compensation dial for example.", "Date": "June 7, 2014"}, {"Title": "Canon can re-claim it's leadership in point-shoot cameras with the G1x Mark ii!!", "Author": "Willie Riley \"Camera Man\"", "ReviewID": "R2GIAYMALV4KXW", "Overall": "5.0", "Content": "Canon's G1X Mark ii is an outstanding camera and yes, it will take pictures that look similar to those taken with entry-level dslrs. The camera offers large feature set for creativity and the 1.5 in chip really gives lots of detail. While the camera takes good pictures, this camera and any mirrorless camera will not equal a dslr but the pictures look great. The video is great also but the EOS M has the best video. Try the G1X. It's a great camera.", "Date": "May 19, 2014"}, {"Title": "Great pix; great camera", "Author": "C. Hayman", "ReviewID": "R5TUNL1T7S2M4", "Overall": "5.0", "Content": "This camera takes great pix, but it is not for beginners.  You have to know what you're doing when you set it up. I love its weight -- it makes using it much more stable and less prone to camera movement.", "Date": "May 9, 2014"}, {"Title": "Great camera", "Author": "Edgar Serna", "ReviewID": "R2X4NTVPXHIDK1", "Overall": "5.0", "Content": "It has everything in a small space, is comfortable to carry and use. Excellent technical specifications.I recommend it to my friends.", "Date": "May 14, 2014"}, {"Title": "Color and DR", "Author": "Jay Thomas", "ReviewID": "RBNNL65ZOFTBQ", "Overall": "4.0", "Content": "Overall pics close to APS-c canon. good operation. lens range. quality build. lens is sharp and bokeh nice.Problem with color rendition and DR. Too warm. Muddy whites. Purple blues  portraits looks red skin tones. reds are not well represented but brick reds. the cast is in every picture. color shift more due to lens coating, a greenish red coating. Only exception is SCN mode having somewhat faithful tones.DR poor. highlights are blown.. low resolution and higher sized pixels renders water color effect rather than fine grain in low light shots.", "Date": "May 1, 2014"}, {"Title": "I was Sorely Disappointed with this Camera", "Author": "zman365", "ReviewID": "R3E8KYW3CLX3SV", "Overall": "2.0", "Content": "I will begin this review letting readers know that I am a current owner of a Canon G1X and I have owned both the S95 and Canon G12.  After reading the information regarding this camera on the web, I felt that it would be an appropriate step forward for me to embrace a new iteration of the \"G\" series body and enjoy some technical advances (WiFi and NFC) that this unit brought to the table.First and foremost, this unit insulted me right out of the box.  Canon built a massive camera, stuffed it into a tiny package and then destroyed any usability by installing the most useless and flimsy \"Grip\" which no adult male could possibly use under normal circumstances.  I have average size hands, and found it impossible to use this camera effectively without cradling it with both hands or mounting it on a tripod.  To add injury to my insult, Canon offers to sell me the correct handgrip for the camera for an additional $30 plus shipping and tax.  Something that should have been placed on the camera in the first place.Overall, use of the camera is quite similar to its previous generation, albeit now the unit does offer enhanced communications through NFC and WiFi, but learning how to use these features proved to be difficult because  the manual fails to properly explain in detail how to  setup, and initiate the software used to enable the features.Image quality is essentially the same as the G1X, and I did not expect any real improvement since the heat generated by constantly having the rear screen on all the time in this little body will certainly offset any gain made by software processing.My bottom line advice to shoppers, get your hands on the unit prior to committing the 800+ dollars on this camera.  I think that if I had the chance to hold the camera and take some test shots, I would have considered it more carefully.", "Date": "April 20, 2014"}, {"Title": "Seems solid", "Author": "J. Miller \"Jmill\"", "ReviewID": "RF7BZJ51R8WND", "Overall": "4.0", "Content": "Got mine in the mail today. From what I can tell this is a really solidly built camera. IT's hefty and definitely would not fit in any of my pockets except maybe a coat side pocket (I have my S95 for that though)..Can't wait to get out and shoot around.", "Date": "April 9, 2014"}], "ProductInfo": {"Price": "$799.00", "Features": "Canon 1.5-inch, 12.8 Megapixel High-Sensitivity CMOS sensor combined with the DIGIC 6 Image Processor creates the Canon HS SYSTEM, which helps provide excellent low-light performance.\n5x Optical Zoom plus a new f/2.0 - f/3.9, 24mm Wide-Angle lens with Optical Image Stabilizer helps ensure outstanding optical performance and versatility.\nNewly developed lens with Dual Control Rings provides customized functions with operation similar to SLR lenses and allows full-time manual focus. A 9-blade aperture provides beautiful, blurred backgrounds even at full range zoom.\nFull range of shooting and recording modes including 14-bit RAW + JPEG, as found in Canon DSLR cameras, for outstanding creative control.\nCapture stunning 1080p Full HD video with a dedicated movie button.", "Name": "Canon PowerShot G1X Mark II Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41-pxF-VpDL._SX300_.jpg", "ProductID": "B00I58M1VK"}}