{"Reviews": [{"Title": "A Great Little Phone", "Author": "Dewgunner", "ReviewID": "R1OZC84ZJB2H9A", "Overall": "4.0", "Content": "I'm not someone who buys a phone on a whim.  I'm too poor for that sort of extravagance.  So when my last phone went kaput it became inevitable to buy a new one.  I wanted something sturdy and no nonsense, but didn't look like it weighed a ton .  I wanted something that didn't make me feel like I needed a degree in phone science to operate it, but also oozed technological savvy.In short, what I was looking for was something like the Sony Ericsson K800i.  I fell in love with a lot of the features:1. The fun, quick camera that you could operate quickly and without a fuss2. The user friendly interface3. The fact that it could probably double as a music player if you wanted it to.4. The large screen5. The elegant design of the phone (in a stylish black, with clean design lines)and so forth.The only real sore point with me is that the phone doesn't interface with my PC as well as I had hoped it would.  I don't know if it's a driver problem or whatever, but Sony really should have hammered out the connection routines a bit more before releasing this gem.  A small flaw in an otherwise perfect package.  I love this phone and can't think of a more fun one on the market.  Buy it if you want something that is simple to use, but has bells and whistles to boot.", "Date": "July 29, 2007"}, {"Title": "Sony Ericsson K800i Triband", "Author": "I. Benn", "ReviewID": "RFLJUH3F6O85D", "Overall": "5.0", "Content": "Excellent product. I should have chosen a quadband to capitalize on the scope for using alternative service carriers who offer service on different frequencies.", "Date": "December 6, 2007"}, {"Title": "Awful", "Author": "Schenelle Graham", "ReviewID": "R3TVPMP7DYLZQS", "Overall": "1.0", "Content": "The seller claims it is a new phone but it is a refurbished phone.  It arrived today and the analog button is not working as well as about 4 number buttons, 3, 4, 8 &9.  When took it to get checked, I was informed that it is an old phone put in a new case and it wasnt put together properly.  The screws were rounded off and the phone still isnt working.I would warn others not to purchase this phone as it is clearly false advertising.  It is not a new phone neither is it a proper working phone.This will be reported to Amazon to save other customers from this.", "Date": "August 8, 2013"}, {"Title": "ok to use with t-mobile", "Author": "don", "ReviewID": "R2TEJS5918XF3F", "Overall": "3.0", "Content": "this is international version. It took almost a month to arrive. It is okay to use with T-Mobile. The lens cap is loose and feel in the hand not good as the one sold in the US.", "Date": "January 28, 2014"}, {"Title": "Sarah", "Author": "Sarah", "ReviewID": "RGEEZZSCSV9S5", "Overall": "2.0", "Content": "The delivery service was average. The phone worked when I got it. I am working on getting service soon. Have not used it much. Satisfied with customer service. The phone was a little more scratched than described. Smaller than expected.", "Date": "September 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000PH9PUE"}}