{"Reviews": [{"Title": "Working but with defects", "Author": "Jorge Acuna Navarro \"Jorge\"", "ReviewID": "R38BMZEPQ4ON1F", "Overall": "2.0", "Content": "I got this phone for my wife as she has always loved the design. At first the phone would not charge, so I bought another battery, but still would not charge. I bought another charger, and now it is charging, but after trying out 4 different chargers. The phone began to work without problems, but now after 2 week usage, it is making a strange buzzing sound when you open it. Now I don't know if this is nothing or something dangerous.", "Date": "June 11, 2013"}, {"Title": "Looks & feels great", "Author": "Joseph David", "ReviewID": "R2L28VQC24H7VX", "Overall": "4.0", "Content": "This is an awesome phone...., it obviously looks amazing and the flip is pretty sweet.  As for the internals of the phone, very simple and typical mobile phone. I would not recommend this phone if you are going to use the Internet or like putting mp3 ringtones for select contacts. How to get files on this phone is impossible, 5mb of memory roughly and without a warranty on the phone you won't be able to update software on it.  Few lame games and funky tunes they call ringtones with your basic phone tools are installed. (calc, alarm, calander,note)...the soft keys (upper most buttons inside phone) are customizable). Left hard keys with phone closed *volume* bottom left hard key is camera...which is ok, nothing amazing( still nice to have) and right hard key is *voice dialing* once setup.. Best software feature I think is the outside analog clock...other than that it's your average phone just revamped for eye candy.(I have tried bluetoothing/motorola tool software to put my own mp3 ringtone and nothing works) if you know how. Let me know. [...]", "Date": "June 5, 2009"}, {"Title": "Universal Pebl flaws", "Author": "Erin", "ReviewID": "R27BRQEX5X0CCX", "Overall": "1.0", "Content": "This is the fourth Pebl I have owned. The first one I purchased in Italy the day it arrived on the market. Did not even leave the store with it. It had no sound. The second I bought also in Italy worked well for about 2 years. The third and fourth I bought here in the states through amazon. Both of these have volume, battery life and setting issues. My ringer settings randomly change. Battery life (regardless of new batteries) is less than a day. Both these phones seem to have a life of their own turning on and off at random, failing to send texts but days later sends them after I already deleted them. Just an old product with no updates.", "Date": "October 21, 2013"}, {"Title": "Not impressed", "Author": "Dale William Licht", "ReviewID": "RJKDMHCTQ0O83", "Overall": "1.0", "Content": "The phone came with a battery that was no good and won't hold a charge. The phone also has a sticky coating on it that dirt and lint and everything else sticks to it. the phone it self I like and serves me well.  Cheers", "Date": "August 10, 2013"}, {"Title": "Is this price real?????", "Author": "J. R. \"pirana\"", "ReviewID": "R1Z578UDET9QU6", "Overall": "1.0", "Content": "The price listed for this phone is $234.00  Is this a joke? The same phone goes for about $80 brand new and unlocked here at Amazon", "Date": "July 14, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000XHIFUC"}}