{"Reviews": [{"Title": "Great Nokia E50-A Legend", "Author": "Toni", "ReviewID": "R3N3Y5DSUSL2QL", "Overall": "5.0", "Content": "This phone is great, light weight, easy to use, the camera is decent and it is very compact and fits in my pocket. Texting is easy, the display is great and easy to see. The signal is much better than other phones.Once I charge it after 4 days of use and it still has battery life on it. This is all I'm looking for, an easy to use and great looking phone.1. Excellent signal2. Email account support3. Social Networks4. Great battery life5. Great camera6. Light weightOverall this is a great great phone a Legend from Nokia.", "Date": "June 20, 2012"}, {"Title": "Nice business phone", "Author": "John Lancelot", "ReviewID": "R25IFPVNV5WVYP", "Overall": "4.0", "Content": "Small and compact. Lot of functions and features for business people. What I liked the most was the ability to update the calendar, tasks and notes with my outlook using the PC suit. I have my contacts hence stored or the phone and outlook and then though the outlook to a web server. The calendar and tasks gives out reminder even when my notebook is off... because my phone gives the reminder!!! I never misses an important appointment or to do task.It is not a fancy or too good looking phone. And no WiFi compared to its advanced models. Else the phone is just great with GPRS/EDGE and bluetooth support.The hands free function is great and loud enough than many other phones I used.", "Date": "November 12, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and GPRS/EDGE capabilities\n1.3-megapixel digital camera with video capture; digital audio/video player\nBluetooth for handsfree devices; MicroSD expansion to 2 GB; Symbian OS 9.1, S60 OS; access to email\nUp to 8 hours of talk time, up to 240 hours (10 days) of standby time", "Name": "Nokia E50 Unlocked Phone with Camera, MP3/Video Player, and MicroSD Slot--International Version with Warranty (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/417Yy6qM9aL._SY300_.jpg", "ProductID": "B000SBBFTG"}}