{"Reviews": [{"Title": "Great Music Phone", "Author": "Amazon Fan", "ReviewID": "R3MWH4RZ0J2P7I", "Overall": "4.0", "Content": "Our tween daughter loves her new cell phone.  The music sounds great and are very easy to load plus no software required on our computer...much more convenient than our old music phone (unlocked Motorola V3i which has  iTunes).  For a cell phone, photos are good taken outdoor or where you don't need to use the flash.  Photos with flash haven't turned out well for her ... so far they seem like too much flash ... too washed out.  The phone feels right when you are taking photos ... more like you are using a camera not a cell phone to take photo.  Video is ok but captures good sound (we didn't remember to bring our camcorder and had to use this phone to record our kids' orchestra concert and we were sitting on the balcony far away from the orchestra).", "Date": "April 28, 2008"}, {"Title": "Nokia 5700", "Author": "R. Drakes \"Renee D\"", "ReviewID": "R4MKU39VA2NPA", "Overall": "4.0", "Content": "really like the phone, the camera is great and the music player is even better", "Date": "September 7, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nUnlocked quad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 2100 UMTS/ plus EDGE capabilities\nUnique twisting keypad design activates camera and multimedia player functions; 2.0-megapixel digital camera also captures video; MP3 and AAC audio playback\nBluetooth for handsfree devices and stereo music; MicroSD expansion (to 4 GB); access to personal email\nUp to 3.5 hours of talk time, up to 290 hours (12 days) of standby time", "Name": "Nokia 5700 XpressMusic Unlocked Cell Phone with 2 MP Camera, International 3G, MP3/Video Player, MicroSD Slot--International Version with No Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BQUCK47-L._SX300_.jpg", "ProductID": "B000RK08FK"}}