{"Reviews": [{"Title": "Nokia...Wow", "Author": "ZANE Farooq", "ReviewID": "R32U9JSP131JGM", "Overall": "5.0", "Content": "I've used Nokia phones all my life, except well for the P990i from Sony. There are absolutely NO other phones, that even compare, beleieve me i've dealt with Sony Erricson, Samsing, LG and what not. Nokia are the best. THey're previous Communicators were bigger, and as amaing, I never thought they could beat it. But of course, being nokia, they paved the way.  This phone, is smaller, and thinner than the previous 9500 and 9300i. It is just slightly wider, the chasm used to open it is much stronger, and the keys illumuminated (finally! in the inner keyboard), and the outer keys are amazingly easy to use. The software, the speed, and camera, all amaing. Nokia outdid themselves on this one, this is a much improved phone, working seamlessly, keeping up with every task. The camera, 3.2 MP is a nice addition as is the 2nd VGA camera. Dont be fooled by the review above me, this phone is amazing. I've had it for abt 3 months now, bought it for a very high price. I cudnt be happier...if you do hear bad reviews abt this, its coz most ppl are new to the symbian software. It allows multiple programs to run simultaneously, for e.g. you can surf the net, access the menu turn on the media player listen to music, and at the same time  view a powerpoint of word file. Course, you can switch between these like on a computer, but you need to know how to. Many ppl new to this, just think like any other phone pressing the 'end call' button closes everything. Thats not the case here! Ppl forget to close the programs, and open in addition to 4 or 5, and then complain abt it crashing. It can handle many many at the same time, but sometimes you forget and have too many open (there is a dedicated button to see whats open and switch). So anyone complaining it abt it being slow, is simply not using it properly. All Sumbian 60 series phones can do this...my last phone was the N93. Enjoy", "Date": "September 25, 2007"}, {"Title": "A real smartphone", "Author": "Aldo Bender \"Aldo Bender\"", "ReviewID": "RJ0OL4VC9FZ4H", "Overall": "5.0", "Content": "I bought this phone to replace my Nokia 9300 and let me tell you, what an upgrade. Even though this phone's 3G capabilities will not work on AT&T;'s network, I find it to be a real pleasure to use. It is very well made with little plastic involved and the keyboard now has a back light as well as a two screen setup that now handles millions of colors. In short, if you are looking for a computer and a phone in one, this is your best option at this time in the U.S... It is very expensive but worth every bit of dosh you part with!", "Date": "November 19, 2007"}, {"Title": "E90, upgrading from a 9300", "Author": "G. Exel", "ReviewID": "R21FP0CA7EQIR1", "Overall": "5.0", "Content": "I upgraded to an E90 after 1.5 years using a Nokia 9300 to it's limits.My impression is that they made a list of every single complaint I had about the 9300 and addressed each of them! It's a fantastic cell phone and I love it.- on the 9300 I didn't even bother looking at the outside S40 screen, I opened it each time even to place a call; with the E90, switching seamlessly from screen to screen just by opening and closing the phone, I find myself using the outside screen more and more, I even T9 type text in the numeric keypad!... the outside screen is great for one hand operation, great not to call too much attention to a full qwerty phone when I don't want to and great for the casual email read... I think if I didn't have the option of switching to the internal big and high-resolution screen I'd find myself cursing the QVGA outside screen, but knowing I have the option of a big screen at any time makes me more tolerant to the smaller resolution outside screen and I use it a lot- the keyboard back-light is something you don't use all the time but when you do you realize how incredibly great it is- the inside screen, with even higher resolution than on the 9300 is absolutely great- the keyboard could be a little softer but the truth is that I find myself making less typing mistakes than with the 9300; the new layout is much better and the \"joystick\" much more precise- vibrating alert is great but I miss the timed mode that makes it come back to the ringing General profile at a specified time- the camera could have an optical zoom but it's good enough like it is... 640*480 30fps video is great- sound recording and playback has very good quality- the interface to the WiFi interface and to the GPRS/EDGE/3G APNs is great and makes me confident I'm in control of what is being used or not, unlike some complaints I heard with WM6 that you suddenly find yourself using EDGE when you wanted wifi, etc- the GPS and Nokia Maps is awesome but I also use Google Maps a lot with it- firmware/software upgrade through PC Suite is a blessing- I had a 9300 (no WiFi) and an unlimited data plan, I find myself using GPRS (or EDGE or 3G) data much more often than WiFi in the E90 but in some situations, specially when you are away from your country and GPRS data is expensive, Wifi is very much welcome- the 9300 Internet browser was a joke... very slow! when I found Opera Mini for it I never looked back to the internal browser; on the E90 the internal browser is very good, and the ability to play Flash and even YouTube video is very interestingThe single complaint I have about it is that it's S60 and not S80... the larger availability of software is welcome but I miss having a menu, I miss having more qwerty keyboard shortcuts, I miss the more elaborate S80 Calendar application...Not S60/S80 related:The few keyboard shortcuts it has are totally undocumented, I can't understand why.Another complaint is the lack of a \"open new window\" command on the Internet browser... it does that when you click a link that instructs is to open a new window, but this command is not in the browser interface! I'd also like the Back command not to reload the page... would make it faster!Last point: don't make the mistake of buying this phone and using a limited or expensive data plan, you'll be missing a lot!", "Date": "July 6, 2008"}, {"Title": "IT'S MADE IN FINLAND. IT'S SUPPERIOR STANDARD IN QUALITY.", "Author": "L. M. Ribeiro \"LMAR\"", "ReviewID": "R3PB8UXSGHT9ZK", "Overall": "5.0", "Content": "It's a business cell phone, with wifi access to the Internet - and I would rather work with this cell than my laptop.You can install Skype, Google Maps, Fax Center, and it all works with the bluetooth.It's my new secretary. It stays on the table. Bluethooth on the year. And it's all there. I'm free working. Even in any hotel, anywhere.It's just superior.(obs: it's made of titanium the piece that joins both parts together - it'll never break).U$ 700 is a bargain (in April - 2008)", "Date": "May 20, 2008"}, {"Title": "Excellent phone Software in Beta phase", "Author": "Ernesto D. Jimenez Perez", "ReviewID": "R7XGQ63DZG99C", "Overall": "4.0", "Content": "The product is fantastic but the software that manage the contacts, the calculator, and SMSs have a lot less features than the nokia 9300. The performance is good. Hardware can be rated as 5 stars, but the software compared to the 9300 is 3 to 3 1/2 stars.", "Date": "November 21, 2007"}, {"Title": "E90 good choice", "Author": "OL", "ReviewID": "R39HWW2REN91QZ", "Overall": "4.0", "Content": "just an office, all the facilities are there and it is really professional. maybe it is not so small and the processor is not a lighting.", "Date": "September 24, 2008"}, {"Title": "Nokia beginner", "Author": "Salero \"msalero\"", "ReviewID": "R235FDCWSFBFQW", "Overall": "4.0", "Content": "This is my first experience with Nokia product and after 2 week of using the E90. I am a satisfied user in both main funcionalities: as phone and as personal organizator. Eventhough, more (and cheaper) additional 3rd party sofware would be great, better keyboad desing (better key fedback) and overall smaller size.The performance of the phone operating system is very stable and the build quality is top quality.GPS maps application very good, email client just good, bt/wifi good, GSM phone reception good, battery life standar (1-1.5 days cycle), outlook integration good, entretaiment (fm turner, photo, video, etc) very good, internet experience, beyond standard in such devices. Overall features integation and funcionality: very good.WM: Should learn from Nokia how to make a product that doen't needs reset every day.", "Date": "June 15, 2008"}, {"Title": "E90, Eager to transform the way people experience Work and Communication", "Author": "Paolo M. Reyes \"www.erything-on-wine.com\"", "ReviewID": "R1XP35EOE2D5KB", "Overall": "4.0", "Content": "The Nokia E90 Communicator is a mobile office device , features a combination of advanced technologies that allow faster and better quality access to important information.Operational all over the world using quadband GSM and 3G networks, the E90 also offers fast broadband connectivity via 3GWCDMA, WLAN and HSDPA.  It also has an integrated GPS and Nokia Maps application. For entertainment purposes it has an FM radio, a music player, a video player and two cameras. A 3.2 megapixel auto focus camera with flash and a second camera for videoconferencing.The only problem for me is that I find the Nokia E90 to be too bulky, but it is still worth it, given all of its features.", "Date": "August 21, 2007"}, {"Title": "Help me with my daily task but still not outstanding if compare to 9210i", "Author": "Roath Kanel \"Kanel\"", "ReviewID": "R3W48XJNC3M6D3", "Overall": "4.0", "Content": "I have been using this phone around one year and a half. But if i compare to my previous nokia 9210i this phone could not take overall advantage over my previous nokia. The following point are the advantages and disadvantages of this phone compare to my previous nokia 9210i:Advantages over nokia 9210i:- An internal memory is large enough for me to use (128 mb) which I could have more contact and install more application as I need.- The screen color is improve to 16 million color which is very to view the picture.- The sound device has been improve (the quality of the sound).- More feature: Vibration, Camera, Radio, Bluetooth and wireless lan also included.- The connection to the computer is improve by the USB port.- The battery life is long enough for me to use (4 days fo ra single charged).- The phone has a strong connection between its part when I open its cover.Disadvantage over nokia 9210i:- The size is smaller than nokia 9210i.- The keyboard is too narrow and very hard to type a message.- The port of the louder speaker is put behind the phone, so it is very difficult for me to listen to the phone when i open it cover and have a conversation.That is my expereince for using this mobile phone.", "Date": "November 14, 2009"}, {"Title": "Best... Cell Phone? Handheld?", "Author": "Gonza", "ReviewID": "R2YUQNC3VE0EWW", "Overall": "5.0", "Content": "This is definitely the best cell phone ever!Of course this depends on your needs; however for business men as well as for developers, it is the best phone!!!It's one of the only phones I know that has all connectivity options: Infrared, Bluetooth, WiFi (b/g) and USB (mini).It's got a very fast 332 MHz processor with built-in 3D Graphics Accelerator.Almost 80 MB free RAM for the end-user!!! (that's huge and prefect for it's OS; you can do lots of multi-tasking!)MicroSD HC! (8 GB support confirmed; probably even 16 and 32 GB will work!!!)The QWERTY keyboard is just perfect: takes very little time to get used to it and keys are big enough.Both screens are awesome! You can play games, music and movies and read and write documents without burning your eyes.It's 3.2 MP Camera is pretty decent (It's similar to Nokia N73, without Carl-Zeiss optics). It even records video at 640x480 at 30 fps!!!It's got integrated GPS (with AGPS support).I can't say there are cons; however this is what I would improve/implement in future versions:-WCDMA 850/900/1800/1900 MHz-5 MP camera with Carl-Zeiss Optics and Xenon flash (like N82).-Camera lens cover (either like N73 or N82).-Multiaxis (3 or 6-way) Accelerometer (like N82/N95).-Pencil Key (Nokia removed this extremely useful key from newer phones; I got used to it with my previous N73)-Magnetometer (Compass) like 6210 Navigator.Hope this is useful for anyone thinking of buying this phone.It's worth every single cent!!!Regards,Gonza", "Date": "November 2, 2008"}, {"Title": "THE MOST IMPORTANT BUTTON IS MISSING.  It is my intention to buy more of these, but not if you  can't get this fixed.", "Author": "NYOB", "ReviewID": "RX8UCS66RMLUI", "Overall": "2.0", "Content": "THE MOST IMPORTANT BUTTON IS MISSING.  It is my intention to buy more of these, but not if you  can't get this fixed.The missing button is the pick-up/hang-up toggle button on the left side of the inside screen (green phone and red phone button).", "Date": "June 24, 2013"}, {"Title": "best phone i ever had.", "Author": "gera7586", "ReviewID": "R32RP33Y323X70", "Overall": "5.0", "Content": "I got this phone back in 2006. For about 1200$. If you think this is expensive, at the same time in russia these phones were going for almost 6000 dollars.Given finland borders russia. Hehe. Well my phone was made in singapore or korea i dont remeber precisely but definitely not in finland. Back in those times this model was way ahead of its competitors. Bluetooth printing options wifi tons of apps for symbian, easy friendly yet familiar and powerful os. The big screen was amazing and best till amoled and other recent advances were made in that department. The keyboard is still the best to date in my opinion. Speakers are exceptional with plenty of power. Mg alloy was used for internal chassis and 90 percent external plates ( you had to have plastic covering antenna). I was a 20 year old kid when I bought this premium business phone and with all misuse and abuse it looked brand new for 2 years after. The paint is extremely tough.Now the issues I had. First the rubber stumps on the phone which suppose to dumpen the screen being closed and keep it elevated from the keaboard after several years wore down and the keys started scratching the screen. I was careless and let it scratch up the screen pretty bad. To a point where i got a 60 dollar replacement screen which worked just as good. The reception was quite mediocre due to all mg alloy in this phone. Especially when the phone is used in open mode reception for some reason went down drastically. It was very annoying for traffic using apps such as ebuddy im. This phone survived to many drops but one fatal drop 4 years later the mic crapped out. I know some people replace them, but it is some hightech piezoelectric crystal based unit which was a pita. Also at that point the phone could not compete with android and iphone in terms of web browsing. It is slow and buggy comparatively to modern phones.  Why did i say it was the best phone? Today people go through one phone a year spending 400 to 800 dollars. I had this phone for almost 5 years for just 1200 and it was a leader phone for 2 years atleas and a competent adversary to other phones on the market to the end, and only one part of it (mic) broke. Also i ended up selling it easy for 200 $ afterwards. For today my advice would be get an old e61 in good condition if you have that itch to own one of the nokias bulet proof phones from back of the day I use it right now in conjunction with android tablet. Its smaller  much cheaper, does pretty much the same scope of operations, and is build like a tank fully mg plates and chassis.", "Date": "April 29, 2013"}, {"Title": "Nice doing business", "Author": "Nokia e 90", "ReviewID": "R2W6391KRW4EYN", "Overall": "5.0", "Content": "I am very satisfied with my purchase.from the beginning to the end.I will do more business with them in the future", "Date": "August 20, 2012"}, {"Title": "Great phone but was a lemon.", "Author": "climb5462", "ReviewID": "R3ME9D3YY0A88U", "Overall": "2.0", "Content": "First phone Amazon sent me wasn't packaged correctly so the phone box inside damaged.  Now if that had been it, I would have been ecstatic but no, it turns out the model of the phone that Amazon sent me was the recalled version that Nokia originally recalled back in 2007 when the phone was released.  Amazon sent me another one, same problem again...sent it back, got a refund and pre-ordered a N900", "Date": "October 20, 2009"}, {"Title": "Nokia NOT committed to quality", "Author": "Amazon Customer \"Frankly\"", "ReviewID": "R1WY317XX5FIMS", "Overall": "3.0", "Content": "The E-90 and the last 2 unlocked phones I bought from Nokia do not enjoy the quality of prior phones.  Nokia knows about certain design flaws that make actually talking and hearing on their phones impossible.  My E-90 cost me the biggest part of $1000 US Dollars, but stopped working in less than 18 months.  Nokia said that there was a change in design that had corrected that problem, but though they knew about it, they did not feel any responsibility to fix it. \"Would I be interested in buying a new phone?\"  Hmmmmm....  The prior Nokia Communicator had a joy stick that got stuck which also did not meet their minimum requirements for a design flaw; so they wouldn't fix it.  The Nokia I owned before that had keys that disolved and came right off; before I lost all my keys, I called to them about it, and they said -- in less than 1 year -- that is was cosmetic that their keys wouldn't stay on.  Don't get me wrong, there is a lot to recommend their latest phones, but one thing is sure.  Nokia doesn't care anything about customer service and about maintaining their good name.  If they did, they wouldn't abandon people who have such a memory about being repeatedly burned.  Go buy the latest Samsung, better gadgets, REAL full qwerty, much cheaper, other qualities the same or better than Nokia.  Samsung to release sometime in 3rd qtr or 4th qtr 2009.", "Date": "September 11, 2009"}, {"Title": "Love It", "Author": "shogi", "ReviewID": "R1XTB3VFC6WYZQ", "Overall": "4.0", "Content": "I've had my mocha e90 for nearly a year now, and I like it very much. The battery life on wifi is excellent. I can surf the net for three days before needing a charge. Other features use more battery power. The font sizes could be bigger. Even at 125% I find it difficult to read. Also the camera button requires a lot of pressure, not to mention time, to actually snap a picture, but the picture quality is fabulous. I like the size, weight and feel of this phone, and it really is a beautiful design. The sound quality is nicer than my e61. It's not a replacement for a little net book, but as a smart phone, if you don't mind the larger size, I recommend it.", "Date": "September 23, 2009"}, {"Title": "One of the worst smart phones ever!!", "Author": "Scorpio", "ReviewID": "R3K20ACGUCCGY6", "Overall": "1.0", "Content": "I bought this smart phone and sold it within 8 months, I bought it as all in one smart phone, but unfortunately I was very disappointed. Very, very slow with 2GB memory card, also it doesn't support most common Audio\\Video files such as WMA, WMV, AVI, MPEG and (MP3\\WAV) some sound channels and rate. Slow application loader and file explorer. The battery's life 90 minutes maximum when browsing the net with full charge.  If you are looking for a smart phone or PDA, choose the HTC.", "Date": "October 26, 2008"}, {"Title": "Not Very Impressed!", "Author": "Aggie85", "ReviewID": "R5CWXMKQGJU9W", "Overall": "2.0", "Content": "I bought an E90 in the hopes of supplementing (actually replacing) the HTC 7501 I currently use.When I first got the phone, I was so excited until I started trying to use it. I never realized how much I use the touch screen for!I then tried to browse the Internet with the browser - definitely not as nice as Opera Mobile 8.65.The final straw was the email client ... I couldn't get it to display the HTML emails I get (which is 80+%).I decided to give up as I would never warm up to the included software - much weaker than what comes with Windows Mobile 6 (not including the fact that there are many third party Windows Mobile programs to supplement / replace any of the standard ones).So, I boxed it up and returned it to Amazon for a refund.I am going to wait until the Fall and replace my HTC 7501 with a Sony X1 phone.", "Date": "May 12, 2008"}, {"Title": "Tough Going", "Author": "Gideon I. Gartner", "ReviewID": "R3TYJ9SF1TSHYM", "Overall": "2.0", "Content": "For former users of touch screens, this machine, while beautiful and functional, takes lots of getting used to...the jury is out, whether with practice it will be as intuitive as other PDAs.Also, the manual leaves much to be desired, re comprehensiveness and clarity.", "Date": "November 24, 2007"}, {"Title": "super hardware, unusable but nice to look at software", "Author": "David Schlaepfer", "ReviewID": "RPMZVYLI28330", "Overall": "1.0", "Content": "Nokia e90-super:o suchfunktion in allen dokumentarten inkl. terminen, sms, etc.o kartenanzeige (schnell, detailliert, zoom funktioniert, schöne darstellung)o display ist hell, schön und scharf.-negativo lange startzeit (ca. 10s, früher 0.5s) da das ganze teil abgeschaltet wird und nicht nur der telefonteil. Wenn ich also am abend meine ruhe will, dann schalte ich auf flugzeugmodus - dann geht's schneller.o das ganze software-konzept entstammt dem s60. die hardware hat aber die (tolle) konzeption eines neuen communicators, nur lässt sie sich kaum bedienen - der alte communicator liess sich schnellstens 2händig bedienen (esc links, tab links für programmbedienung, ctrl-x, ctrl-v, ctrl-c für alle arten von elementen, inkl. files, etc) - beim neuen wird die maschine fast ausschliesslich rechts gesteuert, und zwar abwechselnd am deckel und am gerät, das heisst, die linke hand hält das gerät und den deckel, damit der nicht wegtaucht, wenn der rechte daumen am deckel/rechts vom bildschirm bedient.o Die suchenfunktion ist zwar überall hilfreich, sie lässt sich aber nur über ein sub-submenü aufrufen.o Die taste arbeitsplatz ist redundant mit der ()-taste, eine telefon-taste wurde leider weggelassen.o einstellungen die sich auf einem bildschirm vornehmen lassen werden fast konsequent über 1-2 menüs und 2-3 bildschirme geführt. möglicherweise werden e90-anfänger damit in den ersten 10min vor reizüberflutung geschützt. alle anderen werden genervt sein, jedesmal, wenn sie etwas am handy eingeben.' die anzeige der (wenigen) details von fotos zum beispiel, sind erst nach dem scrollen über 2 bildschirme ersichtlich, 4 zeilen würden genügen. Eine andere darstellung der fotoliste (mit den details) ist nicht vorgesehen.o Möchte ich fotos ansehen, wird mir immer eine auswahl aus allen im gerät und auf der speicherkarte verfügbaren angezeigt. Damit ist es obsolet, überhaupt mit ordner zu arbeiten. Abgeschaltet werden kann das nicht (die idee wäre ja als ergänzung toll). Will ich also die privaten bilder nie bei einem kunden sichtbar haben, habe ich sie nicht auf dem gerät. Anders geht's nicht. Die bilder/filme-files werden auch immer mit vorschau angzeigt, was ja an sich auch eine tolle option ist, aber abschaltbar wäre nötig.o kleinschrift gibt's nicht, das erste wort wird immer gross geschrieben. Für notorische kleinschreiber wie mich ist das nervig.o Die anzeige-einstellungen (beim vorgänger meist in etwa 3 grössenstufen) sind hier zwar einstellbar über schriftgrösse (einmal pro gerät), aber sie werden nur an ganz wenigen stellen überhaupt eingesetzt, der rest bleibt unverändert.o Ein neues sms ist reingekommen, beim alten gerät ein tastendruck, das anzusehen. Beim neuen 4 bis 5.o Beim alten gerät konnte ich in einer langen liste (profile, töne, bilder, ..) mittels des ersten buchstabens des gesuchten (z.b. taste G für golf.jpg) springen. beim e90 drücke ich dafür zb 48x die nach unten taste.o Wenn einstellungen in einer liste dargeboten werden, wäre es optimal die rauf/runter-taste für die auswahl des listenelements und die links-rechtstaste für die werte des ausgewählten listenelements einzusetzen.wäre. gemacht wird das über rauf-runter zur auswahl des listenelements, dann option, dann ändern, dann wählen, dann links-rechts für die werte-auswahl, dann ok. Damit drücke ich um den lichtsensor etwas schwächer einzustellen anstelle 1 taste (links) 5 tasten.o Insgesamt braucht das gerät für die umständliche bedienung 4-5mal mehr tastendrücke = aufmerksamkeit als früher.o Das alte konnte ich über weite strecken blind bedienen (über taktiles feedback und die bestätigungstöne). Beim neuen kann ich aufhören zu arbeiten, mich zurücklehnen, und mit der einstellung beginnen.o Wo ich beim alten gerät alles über esc abbrechen konnte (z.b. habe ich aus versehen eine neue notiz erstellt oder eine bestehende notiz verändert), konnte ich dies mit esc/abbrechen wieder gutmachen.beim e90 gibt es das nicht. Kein rückgängig, kein abbrechen, kein speichern unter. batterie raus, das könnte helfen.o Dafür gibt es in fast jedem menü ein eintrag hilfe. Das wäre ja grundsätzlich nichts schlechtes, da aber die menüs auf dem breitschirm immer vertikal, von oben nach unten angezeigt werden (ein absoluter blödsinn) muss jedes menü gescrollt werden. Der eintrag hilfe macht einfach noch ein bisschen mehr scrollen nötig.dabei ist die hilfe jederzeit über die tastatur ganz einfach zugänglich.auch in jedem menü ist ein eintrag schliessen, um das menü zu schliessen (beim alten 3390 wurde einfach die taste menü nochmals gedrückt, oder esc). Beim e90 werden die menüs einfach noch etwas länger.o Wer hofft, dass er bildschirmweise texte oder lange liste scrollen kann, vergiss es. Das handy hat zwar 5 tasten shift, alt und strg, diese werden aber nicht für solche feinheiten eingesetzt. (worte markieren in texten, das geht mit shift).o Es gibt eine kurze liste mit tastenkürzeln für das e90 (im internet, im handbuch). WICHTIG: Das sind alle, dies gibt. Aus, ende. Wer mit enter einen listeneintrag auswählen will, hat selten glück, meist geht das über option - auswählen.o Wer mit ctrl-c ein bild oder ein programm auswählen und in einen anderen ordner verschieben will: vergiss es. Das geht heute so:zum ordner navigieren (auf der rechten seite sind die files sichtbar, aber das ist rein informativ, die lassen sich nicht auswählen oder anspringen, die rechte seite des explorerfensters ist verzierung. Also den ordner öffnen (dann ist der ordnerbaum weg, aber die files sind sicht- und auswählbar. Dann file mittels rauf/runter auswählen, dann option, dann 4x runter: in ordner kopieren, dann ordner suchen (immer vom stammordner aus!!), dann enter.hier haben früher 9 tastendrücke gereicht: ordner auswählen, tab, file auswählen, ctrl-x, tab, ordner wechseln, ctrl-v.heute sind wir da bei 14-20 tastendrücken.o Fazit: der e90 hat zwar eine tastatur, nur kommt diese im bedienkonzept nicht vor. Und er benützt menüs, so als wären menüs heute im jahr 2007 eine neuheit, anstelle von links nach rechts, wo platz ist, und sie sofort erkannt werden sind sie von oben nach unten angeordnet.o Die software ist unausgegoren und für dieses handy nicht konzipiert.o Eine der schlimmeren erfahrungen ist es, einen termin von heute auf morgen zu verschieben. Ging das früher mit 3 tastendrücken auch zur not noch auf der autobahn, so ist heute die nächste raststätte aufzusuchen, ein kaffee zu bestellen, oder einfacher: ein notizblock mitzuführen. Das gleiche gilt dafür, einen termin zu ändern. Nachdem ich den monat ansehe, die woche ausgewählt habe, den tag ausgewählt habe, den termin ausgewählt habe, kann ich ihn, verteilt auf etwa 3 bildschirmhöhen ändern. Sorry, nokia, aber das ist absolut unbrauchbar. Termine in outlook erfassen und am e90 anschauen, das geht, schöne darstellung. Aber etwas daran ändern: no way, das werde ich in zukunft wieder im kopf machen.o Diese liste liesse sich beliebig verlängern. Doch leider habe ich dazu nicht die zeit. Und auch keinen usability-test-auftrag von nokia.", "Date": "July 26, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 2100 HSDPA plus EDGE capabilities\nNumeric keypad on front, opens to reveal widescreen LCD and full QWERTY keyboard; powerful Symbian S60 operating system\n3.2-megapixel camera/camcorder; Bluetooth stero music; GPS with Nokia Maps; Wi-Fi connectivity (802.11b/g); MicroSD expansion\nUp to 5.8 hours of talk time, up to 336 hours (14 days) of standby time", "Name": "Nokia E90 Communicator Unlocked Phone with 3.2 MP Camera, 3G, Wi-Fi, GPS, Media Player, and MicroSD Slot--U.S. Version with Warranty (Mocha)", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZJvG5T3oL._SY300_.jpg", "ProductID": "B000PH9NNS"}}