{"Reviews": [{"Title": "Good phone for the price", "Author": "V Jackson \"VJ\"", "ReviewID": "R2AJYPVQ0R1GZU", "Overall": "4.0", "Content": "If you want a whiz-bang phone loaded with LOTS of features that can be run over by a truck and still work, then go spend $100. I only spent $20 and really like this phone a lot. It has everything I need, which admitedly isn't much. I wanted a small phone with a color display, a speakerphone and a battery that lasted longer than just a few hours. It's perfectly good for my light-use situation, only needs to be recharged every 3-4 days and it looks like it's from this decade, compared to my previous phone. I've had it for about 2 months and love it!", "Date": "September 13, 2007"}, {"Title": "Nice, Cute Phone, Horrible Batterly Life", "Author": "Claire J. Tinsley \"cjenn\"", "ReviewID": "R589LOTEJCM1I", "Overall": "3.0", "Content": "I was holding off on writing this review because I wanted to see how this, my very first cell phone behaved battery wise, after reading the neg. reviews here. Yep, the other reviewers are absolutely right. I turned on the powersaver as recommended, but they're right, my battery died out in less than 24 hours; 15 to be exact. Not that charging each night would be a problem, but come on, if you forget, this could be a real handicap and charging isn't always possible. I do like the company's customer service and the fact that the cus. ser. lady didn't try to strong arm me into buying anything. Being that I have never had a cell phone before, I was clueless as to how to set this up, but I found the cus. ser. pretty good. I don't know how long I will use this phone exclusively, as I bought it just for emergencies, but given the terribly short battery life, I may just get the Cyclops instead. Other than the batterly angle, this seems like a pretty cool little phone.", "Date": "September 3, 2007"}, {"Title": "Customer Disservice", "Author": "Colleen10014", "ReviewID": "R15FTI9S90AHZY", "Overall": "1.0", "Content": "I liked Virgin Mobile's flexibility and lack of contracts, so I became a customer. It all went pretty well until I had a problem. I bought the Marbl only a few days after it became available, so unfortunately I didn't have the benefit of reading Amazon reviews. Otherwise, I would never have bought this piece of garbage. After only four months, my Marbl phone died. I tried Customer Service (an oxymoron) at VM. I explained to them -several people, of course, to whom I had to repeat the same information over and over again, including my phone number--the problem, and that I needed my phone repaired, not just replaced, because there are a bunch of phone numbers stuck in it. No one understood, no one cared.First I was told I had a warranty. Then I was told I didn't. I had to fight customer service person 3 to admit that yes, I had a warranty, so I didn't have to buy a new phone. I could get it for free, I was told as if they were doing me a great favor. \"But I don't want a new phone,\" I said (again). \"I want my phone -with my phone numbers--working.\" Customer disservice person 4 or 5 got my information to send me a new phone--with the threat that I need to send my old phone back; otherwise they will charge me for the new one. \"Why?\", I asked. \"Are you going to fix it? Can you get my numbers back?\" Of course not. Steven (AKA Moron 5)  couldn't tell me exactly why they need it back --other than repeating over and over that the phone is not working, as if this were news to me. Virgin Mobile has just lost a customer for good.", "Date": "August 9, 2007"}, {"Title": "Don't buy this phone", "Author": "J. Yuen", "ReviewID": "R1NB5EPZ6B674Y", "Overall": "1.0", "Content": "I first bought this phone and used it and charged it. The battery life lasted 1 day and then tanked. I didn't use the phone for calls and it was on standby. I had Virgin mobile replace that phone. The second phone I charged and used it. The battery life lasted 5 days on standby. I didn't use the phone for calls. I tried calling virgin mobile to try to replace this phone, but a rude lady got very nasty with me. I stated that the phone was suppose to have standby time of 7 days (BTW, the website says 9 days standby time). She stated that the phone had standby time of 5-7 days. Then I said that the phone battery only lasted 5 days and this was unacceptable. She then stated that she charges her cell phone everyday and that 5 days was acceptable. She then stated that since I didn't use the phone at all 5 days standby time was good. Horrible service. Don't buy this phone, it looks nice, but the battery life is horrible. This phone is garbage.", "Date": "June 1, 2007"}, {"Title": "Virgin Mobile marbl (I have the Grass Green version!!)", "Author": "S. Thompson \"-S. Thompson\"", "ReviewID": "R2B9UYRP53EVM9", "Overall": "5.0", "Content": "Pro's: pre-paid, cheap minutes & texting fees, you can add plans (like, for ex; $5 a month for 200 texts, or $20 for 1000 texts). Virgin Mobile itself has really good coverage, it has a plan with Sprint for that.I really like the phone, I like the 'flip phone' feature, I originally had a 'candy-bar' phone, I liked that one, but since upgrading to a flip phone, i like the flip way better! A lot of people have rated the VM Marbl really low, on many reviews. Since I have the green version (called \"green grass--limited edition\", perhaps that is an upgraded version? because I love mine!) The texting is fast, easy, and battery life is good. Of course, to get the maximum battery life, you have to completely drain the battery before recharging, this way, you conserve the energy, it charges faster and lasts longer. It doesn't have internet on this specific phone (other virgin mobile phones do) but then again, this phone is $15 in stores. I bought mine at Walmart. The minutes (called Top-Up cards) are reletively cheap. 200 minutes is $20, 400 is $30, and 1000 minutes is $50. TracFone is double that ($40 for 200 minutes, and etc. I don't mean to put down TracFone, I had them previously, and loved it! no complaints, just more expensive. Trying to weigh out the pro's and con's of both of them.Its really light, durable, bright screen, the WORST ringtones i have ever seen, I bought some online, because...they were BAD... trust me. Online they're just 2.50...so not bad. the wallpapers are pretty good, but I still bought one online, just for fun... :)Thats about it. I added pictures of the green version to the website page, so you can see it. it's a little greener in person though. it looks more teal in the picture... maybe it's just me though.", "Date": "April 6, 2008"}, {"Title": "Cool-looking, easy to use, but very slow", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R3OO6PSGCPIHPI", "Overall": "3.0", "Content": "I just got this at my local Radio Shack store for 30 bucks.  Activating on Virgin Mobile USA's website gave me $2.50 in starter airtime.  BTW the activation page appears to only work IE 6.0; I'd tried IE 7 and other browsers before I realized only IE 6 would work.The phone itself is stylish and very lightweight.  I find the battery life acceptable - but then, I only use this for occasional calls and I don't access the Internet (VirginXL) at all.What I don't like about the phone is it's painfully slow.  Even checking balance (by pressing the \"up\" key on the navigation pad) takes 30 seconds, vs. 5 seconds or so on my 7-Eleven Speak Out Wireless-running RAZR.  Sometimes, even pressing the End key to return to the standby screen takes a full second, which is really slow for such an easy operation.This is an inexpensive but useful phone, if you don't mind its being on the slow side.  You can still find it in Radio Shack, Virgin and many other stores, as well as on Virgin Mobile USA's website.", "Date": "September 10, 2007"}, {"Title": "Turn off screensaver to help battery life..", "Author": "T. Chamberlin", "ReviewID": "R27DJMF3PVT7U4", "Overall": "2.0", "Content": "When I called VM on the issue of less than 24hr battery life, I was told to tun off the screen saver.  Why it matters when the phone is always closed, I don't know... but it does help some.  Good luck to those with a Marbl phone.  I was aslo told that the Oystr has the same problem. This was from VM customer support.  Other than that, they didn't offer any solutions.  I also read somewhere in another review that this phone uses more battery when searching for signal even when closed in standby, wasting more battery. So turning it off when not in use is your best bet!", "Date": "August 31, 2007"}, {"Title": "Good for the price", "Author": "Music Lover from Wisconsin", "ReviewID": "RV5Y4CD34HHML", "Overall": "4.0", "Content": "I use a cell phone only occasionly for short calls to confirm where I am or to be asked to be picked up or for permission for something. That's it. Otherwise I use a landline. That's why I chose prepaid. (Also- if I lose it is it a big deal? Nope.) If you're looking for a long-lasting, life-line type phone this one's not for you. Otherwise, everything about it has suited me well. While the battery life isn't the best it works for someone like me (though it would be nicer to have less charges.)Some of the Virgin Mobile phones are definatley better but also more expensive.Oh, and if you're gonna get this phone go to a Target or the Virgin Mobile sight itself. It's cheaper.", "Date": "August 24, 2007"}, {"Title": "Battery Stinks", "Author": "Carrie B \"http://www.thechristianwoman.com\"", "ReviewID": "R3MAM7ZEWVHFOQ", "Overall": "1.0", "Content": "I guess I should have read some reviews before purchasing this phone...As others have said, the battery life is terrible. I thought I was getting a good deal at $20 but this is another case of you get what you pay for.", "Date": "June 16, 2007"}, {"Title": "Battery life ruins the phone", "Author": "M. DUNTON \"mikedunton\"", "ReviewID": "R25XICKXG76ZTM", "Overall": "2.0", "Content": "The phone has nice features, of which multiple alarm settings and a decent speakerphone are my favorites.  The battery life will leave you cursing, as this thing will die on you when you least can afford it.", "Date": "August 23, 2007"}, {"Title": "battery sucks big time", "Author": "Sam", "ReviewID": "R24H8WOK8KYQHM", "Overall": "1.0", "Content": "I tried to upgrade my teen's ancient kyocera (so old you have to extend the external antenna!) to the Marbl.  My teen rarely uses his phone, but it gets the job done and \"never\" needs charging.  I charged the new Marbl and left it unused and closed overnight and in the morning the battery was low and the phone could not be used.  I thought about exchanging the phone until I saw all the CNET reviews complaining about lousy battery life.  I returned the Marbl and will wait till something better comes along.", "Date": "May 31, 2007"}, {"Title": "HAS SOME GREAT FEATURES...", "Author": "More M", "ReviewID": "R1PUL4WWDX23PK", "Overall": "3.0", "Content": "First off, I love my Virgin Mobile.  I like to have a mobile phone handy, as everybody does.  But, the thing isn't glued to my ear...that's why I went with Virgin prepaid.  I use it a few minutes a day to several minutes a week.  I have phones at home and at work that I can use.  Having said that, this Kyocera Marbl phone was supposed to be an upgrade (for me) and a replacement for the AudioVox 8610 that went bad after nearly 3 years.  The good:  nice features like speakerphone, easy texting, speed- and 1-touch dialing, and voice recognition make this a feature-packed phone for only $30 bucks.  It's very compact and easy-on-the-pocket, with an internal antenna to boot.  The bad:  the battery takes several hours to charge, and can be depleted in only a few calls (with the 8610, battery usually charged in an hour, and would sometimes last several days).  The Marbl has a nice look to it, but it's mostly all plastic, and the color screen doesn't have many pixels.  The buttons are all very small.  My chief complaint, though, is that when I flip it open to talk, when pressing it to the ear the screen goes out...not sure if this is a defect, but it happens every time.  Simply flipping it open a millimeter or two beyond its fully-open position will knock out the screen, whether talking or just looking at the screen!  Is this an energy-saving feature?  I may exchange this phone for another if this proves to be defective.  Or, I may upgrade to the Cyclops camera phone.  I will update this review at a later time....***UPDATED***4/9/07Well, it turns out that the scenario I mentioned above was indeed a defect...it had a defective wiring that caused the screen to go out when fully flipped open.  I was going to exchange it for another Marbl, but instead opted to upgrade to the Kyocera Cyclops!!  My advice....UPGRADE!!", "Date": "April 8, 2007"}, {"Title": "Worst phone Worse Service ever", "Author": "Patricia S. Halstead \"beanienutz\"", "ReviewID": "RGL8V0CYAI2UQ", "Overall": "1.0", "Content": "I purchased this phone with minutes on June 12. On June 21, I called Virgin Mobile because phone would not stay charged. Replacement phone received June 26. Activated replacement phone July 1, after 1 week, the exact same problem -- phone does NOT stay charged. Called Virgin Mobile again. Told me nothing wrong!! Box states standby charge = 9 days. Phone only stays charged 36 hours without use! Virgin Mobile NOT sympathetic, said nothing they can do, REFUSED to refund money for phone or minutes. Said we can only send you another replacement. Said it was \"normal\" to charge every night. I said \"false advertising?\" Virgin mobile: no comment. By the way, the service area for my location is fair to good. NO reason for battery draining all the time except its a piece of pure junk. Overall review is F- don't waste your time", "Date": "July 24, 2008"}, {"Title": "Not a great phone", "Author": "Christopher R. Stalker \"Chris\"", "ReviewID": "R2VZUVGJD6O1PD", "Overall": "2.0", "Content": "Battery really dies quickly even though there aren't many features to the phone. Easy to use phone and I like it but must be charged daily. I love virgin mobile and bought the Wildcard and love it.", "Date": "July 17, 2008"}, {"Title": "The battery sucks - but the phone is decent", "Author": "D. Beckett \"MathMan821\"", "ReviewID": "R2FS18MV5U8IYC", "Overall": "3.0", "Content": "The battery life is as terrible as everyone has said, but the phone in and of itself has nice features and a solid feel in my hand (contrary to what other reviewers have said).I have used this phone for a month now and absolutely LOVE the voice dialing feature.Its a nice little phone - but if you don't have the opportunity or memmory to recharge it every night ... it is NOT for you.", "Date": "July 31, 2007"}, {"Title": "Too bad about the battery...", "Author": "Nikin", "ReviewID": "R3L4Q85JNAUZ5Q", "Overall": "2.0", "Content": "Everything the other reviewers say is true.  The phone is \"basic\" but it does everything I need it to do (and more).  Unfortunately, the battery life is pathetic.  I thought I had a defective battery, but after reading the other reviews, the dismal battery performance appears to be par for the course.  Guess I'll be looking for another phone.", "Date": "June 27, 2007"}, {"Title": "Battery kills this phone", "Author": "badun", "ReviewID": "R3BJZR81RBGH8Y", "Overall": "1.0", "Content": "I love Virgin's pricing and gladly canceled my Cingular/AT&T; account when it was due for renewal.  I opted for the Marbl based on what I thought were complete reviews.  Somehow I missed the many, many complaints about battery life.  It is awful.  The phone will not stay charged for more than 24 hours, even when it's not in use.  Other than that it's a nice, basic phone.  But I can't live with that short a battery life so I'll use up my minutes and toss the phone.  I'll switch to another carrier because I won't be wasting money on a Kyocera phone again.", "Date": "June 25, 2007"}, {"Title": "Great cell phone", "Author": "Maureen Mielcarek \"Tina Mielcarek\"", "ReviewID": "R230C7EX8PJ67G", "Overall": "5.0", "Content": "A really nice cell phone with out all the extra goodies I'd never use. Alone with Virgin Moblies pay as you go plan, it only costs me $20.00 every 90 days and they will automatically charge you credit card so you don't even have to worry about missing a deadline.  I love it.", "Date": "January 23, 2009"}, {"Title": "A fine flip phone and plan for people who need a cell phone for occassional use", "Author": "Penumbra", "ReviewID": "R37K6OAL53UIR4", "Overall": "4.0", "Content": "The Kyocera Marbl is the third phone I've had in six years with VM.The Marbl phone is available for under $15 at the big box discount stores.  The VM plan I'm on requires a minimum \"top up\" of $15 every three months. If you don't use up $15 of talk time in three months, it rolls over.  (But in three months you need to \"top up\" again - regardless of how many minutes you have left.)  Right now I have about $300 worth of minutes remaining - so you can see my phone doesn't get a lot of use.The Marbl looks good - it's thin, sleek and lightweight.  The features, including screen savers and wallpaper are cartoonish and juvenile. However, I don't use it much and the price is right - I can cope.I was excited when I found VM was at last offering inexpensive flip phones with their plan. (There were always problems tossing the non-closing variety in my bag, since I'm not inclined to set the keyboard lock.)The biggest issue with the Marbl seems to be the battery life.  I carry the phone, but rarely make calls.  The battery on this brand new phone lasts about 5 days; of course, that time will decrease as the phone ages.  But at these prices it's hard not to just think of this as a disposable phone.If I used a cell phone regularly it would certainly be worth investing in a more substantial phone with greater battery life.For an ultra cheap phone on an ultra cheap plan - it's not bad!  If you want to have a cell phone, but rarely use it, this is a great deal.", "Date": "August 24, 2008"}, {"Title": "Just Good Enough No Better No Worse", "Author": "Observant \"Believer\"", "ReviewID": "R2MBMTKH3F93M0", "Overall": "3.0", "Content": "Tracfone is giving these phones away free with Tracfone services of various sorts. Here are the positives and negatives:PositivesBattery holds a long charge when charged at home with the charger that comes with the phone.You can use it to make and receive calls although see negative limitations.Small size, relatively light weight, choice of ring tones and vibrate.You can hear well when you're in a quite place and even though I have a soft voice, other's seem to hear me well, too.NegativesClunkyYou can't hear well if you are using it in a loud place or in a car. The earphone.microphone in attempting to magnify your voice also magnifies all the sounds around you. In a restaurant or in a car this makes hearing even the ringing of other person's phone and their pick up difficult if not impossible. Having a conversation is out if there is a lot of noise.No alarm clock function, which I like to have on a phone.I really suggest researching this phone on the Internet before purchasing. Most Tracfones are pretty limited in functions and style but are reliable. I researched this and decided to go with it in spite of it's limitations and it works fine for me.", "Date": "March 12, 2008"}, {"Title": "Oh so plasticky", "Author": "D. Brown", "ReviewID": "R17JM1QGBT76EY", "Overall": "1.0", "Content": "I had this phone one day and returned it immediately. (I have no comments on battery life because I didn't have it long enough!) You are not even getting what you paid for at $29.99. The phone looks cool in pictures but it is all very basic HDPE-ish plastic. It is unbelivably flimsy. Nothing durable or cool about it as soon as you hold it or pick it up. It's also fairly large, further betraying the appearance.", "Date": "July 3, 2007"}, {"Title": "Major Problem is Battery Life", "Author": "Tristanicus", "ReviewID": "RTE03SM087T0G", "Overall": "3.0", "Content": "The one, overriding major problem is the battery life, as pointed out by just everybody who commented.  I called Virgin to get a replacement but they don't just sent you a new battery (which is the smart and cheap thing to do) but instead sent an old? phone and battery (not in box, so I assumed it was used).  The battery is the same one used in the K10 phone but in this phone, it lasted (I timed it 3 times) 16-18 hours on standby only, I made maybe 1 or 2 text messages and no actually phone call.  Yes, that's pathetic.  So, I returned the \"new\" battery since it was just as bad and instead of having Virgin send me another useless battery again, I just used the one I got.  I charge the phone almost everyday now.  Aside from that, I love the size, the style, the lack of too many extra features (which I don't need).  But I got it for $20, so for that price, I'll give this phone a passing grade or else it would fail with the battery life and useless support from Virgin.", "Date": "June 28, 2007"}, {"Title": "GREAT PHONE", "Author": "KY Inspector", "ReviewID": "R1OE91612W25D0", "Overall": "5.0", "Content": "This basic phone works like a charm. I've had mine for 4 yrs with no problems. Finally battery needs to be replaced - big deal! Great product for the price", "Date": "May 15, 2012"}, {"Title": "Best  $15 dollars I ever spent.", "Author": "smeuw", "ReviewID": "R2IO91PT9SGAAZ", "Overall": "5.0", "Content": "I have had my Marbl phone for five years, it is still going strong. I still have the original charger and battery, both still work great. It is a simple phone. No camera or keyboard, but I believe thats why it works so well. My daughter always buys the fancy expensive phones, they are fragile and break to easy, then she has to buy a new one. when they cram so many things into such a little device its bound to break. I've dropped my Marbl a lot of times, even on asphalt and cement. its never broke or had to be repaired. Its the best $15 dollars I ever spent.", "Date": "November 30, 2011"}, {"Title": "Cheap phone, cheap quality, cheap performance.", "Author": "M. Tacker \"picky consumer\"", "ReviewID": "RXUCPON3CCSWA", "Overall": "1.0", "Content": "I bought this phone when I lost my previous phone in an unfortunate water related accident, and I needed a replacement ASAP despite the fact that I was nearly completely broke at the time.I got this phone for about [...] bucks, so I wasn't expecting it to move mountains.  However, I found this phone to be nearly unusable.I'll start off by saying that my cellphone needs are very basic - I send a few texts and make a call every now and then.  I sometimes use the alarm clock or calendar, but that's about it.The biggest problem with the Marbl, though, is that it's so SLOW it makes the simplest task irritating.  When you open the phone, even if you just press the menu button, you have to wait 5-10 seconds for it to open.  To scroll through your contacts or any other list is slow and choppy, and it's hard to control where the highlight lands. Texting is slow - even using T9 it just takes a long time for each word you're trying to type to actually show up on the screen.As far as sound goes, it's okay.  It sometimes sounds tinny, which was irritating to me, but it was definitely acceptable for the price.  The ringtones that came with the phone were few and not very interesting, but you can always purchase better ones.The appearance of the phone is fine.  It's small enough, very simple.  It's smooth and easy to slip into a pocket, and it's very lightweight. It does, however, have a cheap feel to it. The battery door does stay on securely, which is a plus.  The buttons are easy enough to press and they aren't too close together, so you're much less likely to press the wrong one.The interface, however, leaves much to be desired. The screen is small for the size of the phone, which is okay.  However, the appearance of the screen is not great.  The text looks awkward, the included backgrounds are few and are stupid (cartoon style ants, flies, or ice cream? no thanks).  The color theme options are all unattractive.I don't really use mobile web, but I did try it on this phone just to see how it worked, and it was so slow and difficult to use that it is not even worth the trouble or money to attempt.All of this could be forgiven on such a cheap phone if only it were more user friendly, but it's sluggishness just renders it unpleasant to use.So, I guess the bottom line is:If you need a prepaid phone for only a few bucks, this phone is at least basically functional.  If you only need to make a few calls and send a few texts, and you don't mind using a very slow interface, you might be okay with this phone.  However, if you are able to shell out a few more bucks, I think it would be worth it to upgrade to any of the other available Virgin Mobile phones.", "Date": "May 1, 2009"}, {"Title": "Garbage - and would you still like a 286 processor", "Author": "D. Miller", "ReviewID": "R3ALE7O2PL5GVV", "Overall": "1.0", "Content": "This was my first foray into the wireless phone market.  It almost ended my experience prior to beginning.  The phone is too...ooo..ooo slow.  So, for us beginners who need to find the screens to figure things out ... there is no patience left.  Bootup ... SLOW...  I ended up buying a used Kyocera Cyclops.  Yeah.  Now I am in the world of wireless phones.  Recently I purchased a Slash as a gift.  That is once again quite a step up from the Cyclops.  There is no need to put up with junk like the Marbl.", "Date": "February 25, 2009"}, {"Title": "Cheap, small, simple & OK battery life", "Author": "CAR TOP CAMPER", "ReviewID": "RQE7CS2BKH0UA", "Overall": "5.0", "Content": "I'm rating this phone from the perspective of it being disposable.  I paid $9.99 for mine from Target (sorry Amazon).  I expected to use it for a week or so until I got my multifunction Eten M700 - after which I'd discard.  However, I really like this phone's small size and use both.  I use a simple wired headset (which cost as much as the phone!).  I get two hours of talk minimum out of the battery.  The battery charges very quickly and it lasts at least two days on standby.  I forgot my charger on one trip and bought a second $9.99 Marbl from Target (again sorry Amazon) just to have a second charger and second battery.  If you're not a big talker, this is the cheapest cell phone package out there.  This is my back up phone - I pay less than $10/month for this service. Nobody pays less for cell service!", "Date": "February 24, 2009"}, {"Title": "HORRIBLE phone", "Author": "C. Ernst", "ReviewID": "R3QZK5V455LLNE", "Overall": "1.0", "Content": "I wouldn't recommend this phone to anyone.  I bought this for my little brother and it was awful.  First, the charge doesn't even last 24 hours, even with no use.  With texting, or limited phone calls you'd be lucky for it to stay charged for a few hours.  I bought this for my brother would have something to call my parents and I in emergency situations, and it already failed him twice because it had lost its charge since unplugging it in the morning (I pay for the minutes so I know he barely uses it). I would bet that 30-45 minutes of talking would run down the battery completely because it seems to go dead while sitting closed in such a short amount of time.  When the battery goes dead, you can't just plug it in and turn it on like every other phone I've owned, you have to wait a good 15-20 minutes so it can charge enough to be unplugged and turned on and then replugged into the wall to finish the charging process.  Also, when the phone shuts off and you turn it back on, you cannot receive texts for about 30 minutes while it 'searches' for missed messages.  Also, this phone is HORRIBLE for texting, there is a 2 second lag every time you hit a key thus making it very frustrating to navigate the menus, let alone type anything.  Along with the lag, the phone's menus are awkward compared to other phones I've used, and the phone cannot seem to even handle connecting to \"My Account\" to add money/minutes/texts.  Another thing I've noticed is that the alarm clock feature on the phone sucks, it's default setting doesn't even have a sound, no snooze, and the phone only rings for about 5 seconds before the alarm shuts off, and doesn't sound again.I've had a lot of experience with cell phones, and this is the WORST one I've ever used.  I've always gotten the free phones with my cell phone plans, and even had one of those huge ancient Nokia TracPhones about 8 or 9 years ago and that was better than this.If you're going to buy a phone I'd recommend the LG Flare, it's only slightly more money miles better than this one.  However, Virgin Mobile isn't the greatest service provider, they're customer service is horrible, and a month after I got the phone for my brother they raised their prices on texts and minutes.", "Date": "February 21, 2009"}, {"Title": "Phone Ok, Battery & Virgin Cust Service stink", "Author": "R. W. GRANT \"grant_over_here\"", "ReviewID": "ROB6FMVGWLM5X", "Overall": "1.0", "Content": "Battery doesn't last 24 hours w/o charge.  phone works, we just use it to make calls, no games, music or other extras, but the battery just drives me bonkers.  and replacement batteries cost more than the phone.  Virgins customer service is astoudingly bad.  the website is so desperate to look hip and with it, that it is nearly unnavigatable.  Calling them 4 different times has resulted in 2 positive contacts with helpful reps, 1 transfer,hold,transfer,hold,disconnect and 1 total stoner \"dude\" that hung up after listening to the problem.Giving up and getting a differnt phone", "Date": "February 3, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Very reliable tel. once you paid the card use it til finsh", "Name": "Kyocera Marbl Prepaid Phone (Virgin Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/410ehwpc3dL._SY300_.jpg", "ProductID": "B000P1QP8K"}}