{"Reviews": [{"Title": "great phone", "Author": "K-ma \"dancabella\"", "ReviewID": "R3CPPVWENB0E4C", "Overall": "5.0", "Content": "so i got this go phone when i lost my old phone. first, it's a flip phone, which is a huge plus point. obviously, it's not a very high end phone, but for what i paid for it, it's actually pretty excellent. good reaction time on all buttons, easy to configure, there isn't much that's confusing about the menu. it's no iphone, but it'll definitely do, and i know for a fact that it's much better than the free phones that at&t; provides. i had one of those at one point, and it was terrible. it took so long to react to anything i pressed that i was never sure if it had actually registered. i'm happy with this. i'll be able to use it for a while, and i don't have to resign myself to a terrible phone for cheap every time i pick it up.", "Date": "June 4, 2009"}, {"Title": "Really enjoying Samsung Sgha117 Flip Cell Phone", "Author": "A. Adams \"DIMS WORKS\"", "ReviewID": "R3KGSCNN05EZYP", "Overall": "5.0", "Content": "Samsung Sgh-a117 cell phone is easy to use and I am having excellant results when using it.  It is just a simple flip phone but I enjoy the flip version as opposed to the open key model that I had before and the widow that allows me to view information without having to open the phone is an sdded convenience.  I would highly recommend this phone for a person that is looking for a simple phone and does not text much.", "Date": "December 14, 2010"}, {"Title": "Simple good phone", "Author": "Lee Wright", "ReviewID": "R1L7AXDAN6PR0S", "Overall": "5.0", "Content": "Not a lot of bells or whistles, but functions well and holds a long charge.  If you just want a phone for making calls, I recommend it.", "Date": "April 11, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Modes - GSM 850/1900\nInternal Antenna\nTalk time - up to 5 hours\nStandby time - up to 250 hours\nBattery - 800 mAh LiIon", "Name": "At&t/cingular Samsung Sgh-a117 Flip Cell Mobile Wireless Go Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41xMEVM3mDL._SY300_.jpg", "ProductID": "B000SKW4W4"}}