{"Reviews": [{"Title": "Good Phone", "Author": "B. King", "ReviewID": "R3SLRESYW5ZIHH", "Overall": "4.0", "Content": "I purchased this phone as a gift for my wife, who wanted a \"flip phone\", but didn't want to learn how to use Motorola (she's had Nokia for the past few years).  This really is a great phone - it has full functionality that you expect from high end Nokia phones (e.g. syncronizes with Outlook and other Microsoft Office products); easy to navigate around and with cameras, MP3 and video and PTT, has everything you could possibly want.  The only downsides are (a) the keyboard is a little hard to get used to - but after a couple of weeks even that becomes less of a hassle; and (b) the camera is good for outside shots, but not so good for inside with poor light - but as another reviewer said, buy a camera if you want good quality shots.  For spontaneous snap shots and video (e.g. of your kids playing at the park), it's fine.  4 Stars as a phone - 5 stars if you're a Nokia user looking for a flip phone.", "Date": "November 14, 2007"}, {"Title": "Cheap materials!", "Author": "Amazon Princess \"Jen\"", "ReviewID": "R81QAR0PWBX2B", "Overall": "1.0", "Content": "At the time, this was the most expensive phone I had ever purchased. I fell in love with design and color of the phone and it worked great, especially overseas.  However, the silver colored plastic on the face of the phone started peeling (from contact with skin oils, perspiration, etc.) after owning it only 6 months or so. I researched it and other people who contacted Nokia got replacement phones that did the exact same thing within a few months. I was a loyal Nokia customer for over 10 years (my first phone circa 1997 was a Nokia). Needless to say, I am no longer a Nokia customer.", "Date": "January 25, 2008"}, {"Title": "It is cool.", "Author": "Fiona", "ReviewID": "RRTS4OIVS5LGT", "Overall": "4.0", "Content": "I like this phone I've bought so far. It looks really cool and is easy to handle. The sound and images are beautiful.", "Date": "February 10, 2008"}, {"Title": "Do not buy this phone or you will be regret!!!", "Author": "Anthony Weng", "ReviewID": "R3MNBCSIZF5AWP", "Overall": "1.0", "Content": "I would rather give this product \"Zero\" star. It looks good from picture, but once you receive on your hand, you will understand what I am talking about. The battery cover is extreme difficult to remove from the phone.For a phone marked as $400+, it is not worth at all. The phone keeps unresponding or could not power it off. The only way to rest this phone is removed the battery. The N76 I got is really a piece of junk.I bought this phone for my wife as her birthday. After few hours with the phone. She just wants me to return the product back to Amazon ASAP. Don't waste your time and money for this good looking phone.", "Date": "November 10, 2007"}, {"Title": "The box was open", "Author": "Jose Ruiz", "ReviewID": "RLF7JHTEZAP2O", "Overall": "1.0", "Content": "This product was finally shipped to me after several delays, and when I finally got it, the box was opened and the phone was damaged on the sides. It had no plastic cover for the memory card, but it didn't need it, since it didn't bring the included memory card neither. The charger was also missing.My choice was to send it back (and pay the 2-way shipment) or living with a \"new\" cellphone that looked like it was roughly used for a year.At first I though the box was opened on the way here, but unless someone in FedEx put his really mistreated cellphone (identical to the one i bought) in the place of the new one, I doubt it could be accidentally (or even on purpose) damaged that way.Since the shipment from my country was waaaaay too expensive I had to keep it, so don't let it happen to you. DO NOT BUY FROM THIS SELLER!!!", "Date": "September 13, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000QWBXTY"}}