{"Reviews": [{"Title": "Awesome phone.", "Author": "MM", "ReviewID": "R8138CU7NX9KQ", "Overall": "5.0", "Content": "maybe this is not the best looking phone but it last forever. I have mine for over 2 years, and it survived so many drops on the concrete-no problems at all.Battery last for days, I usually charge this Nokia once a week. I don't use internet though, just phone calls, some messaging, occasionally camera.Speakerphone is loud with good quality, and camera just average.One of the best options (I know several phones don't have)-I turn off my phone for the night, but alarm still wakes me up, and Nokia asks for snooze or for switching to phone on mode. Awesome-it saves battery and no text or phone calls can wake me up).I recently upgraded my phone to LG CF360 (2 days of battery life, phone must be on all the time for alarm), buy after a couple of days I came back to old Nokia 6085.", "Date": "December 4, 2009"}, {"Title": "My favorite cell phone to date", "Author": "S. Adams \"S. Adams\"", "ReviewID": "R3G99SW3GTXSAQ", "Overall": "5.0", "Content": "This is an absolutely wonderful cell phone. I have had mine for over 2 years. I don't use most of its many features. I tried the camera out once a long time ago and it was OK. But for just regular calling and sheer sound quality it is the best! I have never had to power off and 'reboot' this phone. The battery life is truly great! Also, the speakerphone setting delivers very clear sound both ways. This phone looks and feels solid and delivers on those promises. Compared to the Samsung and the Motorola I had before, this phone is the best by far!", "Date": "August 7, 2010"}, {"Title": "Great Basic Camera Phone That Plays MP3s AND Is Durable!", "Author": "Truvoice1", "ReviewID": "R1BU8SOWNARKA9", "Overall": "4.0", "Content": "I bought this phone online because I love the ONE feature that all Nokia phones have that I can't seem to find on any other phone - the ability to have timed profiles so that when I go to church or a meeting or maybe I just want to take a nap; I can set the phone to silent or meeting and I know that when it is finished, the phone will return to its normal profile with all the correct ringtones, etc. Other features I like:- Easy to use as a MP3 player; MP3s can be used as ringtones, also so you don't have to pay to download ringtones- Great speakerphone- Great battery life. I can go at least 2 or 3 days without charging and that includes some Bluetooth use in the car.- Easy to use PC Suite from Nokia that enables you to manage and back up all of your pictures, contacts and music.- Great FM radio reception- Easy to use camera and video functionality- Easy to use voice recorder.- Great Bluetooth functionality. I use three different Bluetooth devices and it recognizes them and connects to them very quickly!- Contacts can be broken down and separated into groups and assigned different ringtones, etc. This is handy in that when a call comes in that is not in my contacts, I have it defaulting to the standard Nokia ringtone. This lets me know it is someone I don't know and I usually let it go to voice mail.- Lots of easy to use soft (user programmable) buttons make most of the common tasks a 1 button function. My phone is set up so that creating a text message, setting the alarm, going to camera, and going to phone book are all just one touch. Also, the shortcut menu is programmable, so the rest of the functions I use are only TWO touches!Now the stuff that's not so good:- 2GB limit on memory card- No USB port so you have to go on Amazon and/or eBay and find the correct adapter to plug into the Nokia interface. I bought one that goes to USB so I can transfer data to PC; one that goes from charging port to PC (USB) so I can charge the phone from PC; there are lots of other ones out there depending on what you want to do.- No mini jack for headphones. I bought the Nokia headphones online and they are kind of cumbersome to use but they have GREAT sound and great Bass response. I recently purchased an adapter to convert the Nokia interface to a mini jack but I haven't had a chance to use it yet.- It you a text messaging superstar, this phone is not for you. No Qwerty keyboard. I text maybe once or twice a day and it fine for that. I hate the predictive text function and have turned it off- No flash on the camera and it is not all that sharp.- FM radio only available when headphones or Bluetooth is active.In conclusion, the Nokia 6085 is a great basic phone for voice calls, occasional text messaging and playing MP3s or listening to the radio. It is nearly indestructible and has good battery life. It is user friendly and highly customizable once you get to know it. Manuals and the Nokia Suite are FREE online and are a valuable addition. REMEMBER - this phone was introduced around 2005?, so if you are looking for all of the newest bells and whistles spend your money elsewhere!", "Date": "March 16, 2012"}, {"Title": "Great Long Lasting Phone!", "Author": "wolfkid", "ReviewID": "R2JIM463IW0MR7", "Overall": "5.0", "Content": "I have had this phone for almost 4 years now. I used it for a year and a half and lost it outside for 8 months. It went through 3 hurricanes and 19 tornadoes countless thunderstorms my uncle found it gave it to me and i plugged in the charger it came right on! It is an amazing phone. However the lcd on the back broke when my cousin slammed the phone shut so be careful of that other than that an amazing phone i would by 3 of these and probably never buy another phone again they are that reliable.Edit- Now that I have gotten used to smart phones I would say these are more for backup phones if you can afford a smart phone you probably arent looking at this one however they do make great back up phones incase your phone breaks and you need another one these will stand the test of time.", "Date": "June 16, 2011"}, {"Title": "Just like my old one!", "Author": "David L. Batson", "ReviewID": "R200UQSKFC0HZW", "Overall": "5.0", "Content": "Ordered this because it is like the old one I had before. Went to phone store and did not like any of the new models. I would have had to pay more on phone bill for options that I don't use. Just pop in my card and go. Nothing new to learn.", "Date": "December 24, 2012"}, {"Title": "good phone", "Author": "steve", "ReviewID": "RS4UB0VUOGPY6", "Overall": "5.0", "Content": "this is my third phone i live in a rural area and this phone gives me the best service thanks", "Date": "December 9, 2012"}, {"Title": "Work for the buck", "Author": "Reitired Lady", "ReviewID": "RGMALAGP3KZW0", "Overall": "3.0", "Content": "This is a simple to use and good phone if you are not look for anything fancy.  I do not uses my phone for anything but talking but, this phone text if need to text.", "Date": "December 3, 2012"}, {"Title": "bombing", "Author": "Alsweeterzan Strickland \"Jenkin Tone\"", "ReviewID": "RCSYB2W6C6M3O", "Overall": "5.0", "Content": "this phone is awesome had it since they came out  its been thru hell. still working. i love this phone. battery life lasts longer than the newer phones.  I use it for eveNokia 6085 ATT Cell Phonerythang and its awesum.", "Date": "May 13, 2010"}, {"Title": "REALLY GOOD PHONE", "Author": "LINDA BUTERBAUGH", "ReviewID": "R3MWRVO93B9628", "Overall": "5.0", "Content": "GREAT PHONE FOR MAKING CALLS. WOULD BUY AGAIN. WE DON'T NEED INTERNET BUT IT HAS IT. KEEP THIS PHONE NOKIA", "Date": "May 13, 2013"}, {"Title": "Just one flaw...", "Author": "BQuimby", "ReviewID": "R1SLP54B4J20ZY", "Overall": "4.0", "Content": "I have had exceptionally good experiences with Nokia products.  As I am not prone to update electronics every time something new and shiny appears, I keep using a product for years.  This phone works fine BUT the back battery plate slides off at the slightest touch.  Annoying.", "Date": "April 18, 2013"}, {"Title": "Old technology but great long life phone", "Author": "StasZ", "ReviewID": "R1KDJKIAKY6F27", "Overall": "5.0", "Content": "I've had this phone for 4 1/2 years. Been dropped thousands of times, pcs broken off, glued back on and it still works, however the main screen comes up blank. It still works great for what it was designed for....phone calls! I am looking for the same phone because in my opinion, the newer phones are not as durable.I don't want a smart phone, all I need is a phone that makes and receives calls and messages. Thank you Nokia for a great product!", "Date": "April 13, 2013"}, {"Title": "works good for my needs", "Author": "Bob", "ReviewID": "R289FIVVRTH28Q", "Overall": "3.0", "Content": "I bought the cell phone for my son .My disappointment is the instructions are only the very basic. Instructions  for all available programs in the phone are not in the booklet . NOT EVEN AN ADDRESS.This leads me to believe it may be a \"reconditioned\" phone even though it was represented as \"new\".", "Date": "November 25, 2012"}, {"Title": "Okay phone for voice. Texting sucks though.", "Author": "Paradise Reviewer \"Aloha Peeps !\"", "ReviewID": "R2F9I612DBM9AT", "Overall": "2.0", "Content": "This phone works great for voice but don't count on texting.  It will freeze on your while you are texting if another text rolls in while you are texting.Don't buy if you want to text also.  Buy if you want to just talk.", "Date": "January 13, 2012"}, {"Title": "Mac", "Author": "Gary Mc", "ReviewID": "R2Y7OMQS9LS7C9", "Overall": "5.0", "Content": "I am pleased with the phone. I bought this for my wife to carry to work. When she comes home it is usually very cold and I wanted her to have a phone to use if she needed to call for help. This one is priced right and came with No contract. I will buy minutes every three months, cheap  to buy, cheap to use.", "Date": "January 11, 2012"}, {"Title": "cell phone", "Author": "M. L. Caldwell \"southern lady\"", "ReviewID": "RZCR0CPQ1278P", "Overall": "1.0", "Content": "too expensive for the features it offers.  obsolete technology.  save your money and buy a better device.", "Date": "October 14, 2008"}, {"Title": "nokia 6085", "Author": "drwho2112", "ReviewID": "R3FEPMYI7TGHRR", "Overall": "1.0", "Content": "Went to activate it. ATT no linger uses 2G so the phone is useless. It seems that ATT has decided to eliminate all 2G at least in NY and maybe all over. That is what I was told in the store,had to buy a go phone instead.", "Date": "June 16, 2012"}, {"Title": "OK while it lasted .. didn't last long", "Author": "ccb", "ReviewID": "R4UHBP1H9U2DQ", "Overall": "3.0", "Content": "I am not a power user by any means and have pretty simple expectations. One is that the thing lasts longer than 18 months. Not good for texting and very, very basic. Probably not the way to go if you are looking to buy a phone right now (vs two years ago).", "Date": "May 4, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Built In FM Radio\nGSM 850/900/1800/1900 (Quadband)\nBluetooth", "Name": "Nokia 6085 Unlocked GSM Flip Phone with VGA Camera, Bluetooth, FM Radio, MP3/MP4 Player and microSD Slot - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ve%2Bc4THsL._SY300_.jpg", "ProductID": "B000X459G8"}}