{"Reviews": [{"Title": "A very solid PDA phone", "Author": "Kwok Ng", "ReviewID": "R3EU82D15KZ67T", "Overall": "4.0", "Content": "I have been looking for a PDA phone.  I have few must-have and Good-to-have features as my guideline to hunt down my next phone.Must-have=========VOIP supportUnlocked 3G/GSMQWERTY messaging keyboardWiFi & BluetoothSync with Outlook Address Book, Calendar, and NotesMore than 2 days of battery lifeSupports SD cardBuilt-in camera with video recordingGood-to-have============IM MessengersDictionaryBusiness card scanningMP3/Video playerWeb browserTouch screenLike many other people, they may have separate address book in their PDA and cell phone respectively.  This is the main reason I want a PDA phone to combine them into 1.  I could have bought this phone earlier to solve the problem.  I was just waiting for Apple iPhone to see if it does any better, but I eventually gave up iPhone.Why did I choose E61i?1) It is a unlocked phone2) I can use truphone, a VOIP service for Symbian OS phones, to make international call over WiFi/3G network.  The quality is even better than my home Vonage service.3) The battery can last 2 or more days with normal usage.4) QWERTY messaging keyboard makes my life easier on SMS.5) It syncs with my address book, calendar with Outlook perfectly.6) For the Web browser, I feel the N61i browser is better than the one in Pocket PC but worst than iPhone.  You are able to zoom in and out a web page.7) This is not important to English speaking users.  I bought the Hong Kong version of E61i.  It supports Chinese on typing and displaying.  There is a built-in Chinese/English Dictionary too.The nice things I figured after I bought it1) The speaker is loud and clear.2) It supports Podcast3) There is a IM+ software you can purchase.  It supports many popular Instant Messengers.4) It has a message reader to read your text message with voice.5) It can print documents with some HP printers that support LAN/BluetoothThe things I dislike about this phone1) Hard to find the right place to configure certain features.2) Not much software supports Symbian OS.3) It does not support WMV and WMA files4) No built-in auto keypad lock.  Fortunately, there is a freeware.5) No Bluetooth power save feature on handsfree mode.6) No touch screen.7) A little bit too wide on the size.", "Date": "July 19, 2007"}, {"Title": "Very good for VOIP and W-CDMA access too.", "Author": "Startupgeek \"Startupgeek\"", "ReviewID": "RH43DE2V8YMBX", "Overall": "4.0", "Content": "I used to use Blackberry on Cingular; needed to change to a phone with W-CDMA due to extensive travel in Japan, etc. Cingular does not support this on Blackberry, and their W-CDMA phones are (Aug/2007) just horrible. Some are WinCE too, which would only add to my pain if I had to use windows on my phone as well. And the iPhone is basically useless here too.So, I got one of these. It works; but the menu system takes some learning. I actually had to read the manual. Simple things that made my life easy with the Blackberry - like being able to click on the email message and get a screen to call back the sender directly - are completely missing. It does not have a learning dictionary to speed up txt messages with fast auto complete and the keys are also weird; just don't feel right.The dialing system is annoying if you travel a lot; whereas my old Blackberry just got on with it and inserted the \"+\" before the country code when I was dialing from Taiwan or UK or wherever, the Nokia dialer barfs at this. So now, I need to go through my entire address book and update the numbers to include the \"+\".On the plus side, it does have flawless BT support - my Jawbone headset locks in very nicely every time. It also has wickedly good battery life (nearly 2 ~ 3 days) and excellent VOIP call capabilities. (I use TruPhone; works great.)The camera can be used a a video camera as well, saving me the trouble of packing another item. (I always take short videos of where I've been to show the kids; the e61i is great for this too.)The sync with Outlook is also flawless and the SW package includes a media manager that does additional compression.As an Engineer, I'm also impressed with the construction; the back is solid stainless steel, and it has already survived pretty intense destruction testing from my younger son giving it near mil-std grades in my book.As a phone, the sound quality is excellent. This is fundamental, but something that is often missing on other phones.The default menu can be configured to show what you want - I have it showing an email summary, a calendar summary, and a bunch of gadgets. And since I use TruPhone for VOIP, I also have it scanning for WLAN's from time to time. Its a busy little machine, and has never hung up on me yet.Based on the narky user interface, I can't give this 5 stars. But, its definitely better than 3 stars and is good at what it does right. It definitely does do what I bought it for, and hopefully, with time and new software releases, things will get better.", "Date": "August 25, 2007"}, {"Title": "Only one word: Excellent!", "Author": "Adrian Chirita \"http://adi.chirita.info\"", "ReviewID": "R1S8ZN87H6EOVY", "Overall": "5.0", "Content": "I bought it as an all-in-one solution:phone/office/email/navigation/pmp and own it for almost two months now.I don't regret one cent I spent for it.The DESIGN is one of most simple yet elegant on the market and you have to hold it yourself in your hand to see how it feels as I can't express the feeling ;).Perhaps one thing I appreciate the most is the BATTERY LIFE. Wifi on for almost the whole week-end and still had enough juice for the next monday.Allthough the size of the screen is not as big as a PDA screen, it is still big enough for enjoying some movies (divx also) while travelling. I installed TOMTOM on it and it's great for navigation! It's true that it doesn't have gps built-in (I had to use my bluetooth gps receiver for navigation) but it's a fair compromise compared to all the other features it provides.It connects to almost EVERYTHING. The only problem I had was related to the fact that it doesn't support \"IP passthrough\" (for sharing internet connection through the data cable provided and the Nokia Network Bridge software). It also doesn't support \"PAN bluetooth\" for connecting to bluetooth networks, but this will not make me rate it with less than 5 stars.I will not go through all the features and apps which can be installed on it, as other reviewers already did this. And I cannot agree with the previous 1 star rate, the \"symptoms\" described lead to lack of knowledge rather than a \"bad PDA\".It doesn't have touchscreen, that's true, but I didn't feel the need for such a feature, considering also the size of the screen. And remember, a touchscreen comes with its own disadvantages: the screen loses brightness in sunny environments due to the extra layers it adds. Choice is yours.. ;)Although it has an average browser, I installed the free Opera Mini which comes as a freeware and is reacher in features.The Symbian OS platform has been on the market for a loooong looooong time, and there is a diverse choice of apps and games including the ones from the third parties. There are two things to keep in mind when searching the right app for your needs: it has to support the Series 60 (S60) version 3 (or Symbian 9.1a) and it has to fit the 320x240 resolution (as the reversed - 240x320 is usually most popular amongst the nokias).I owned other smartphones and PDAs, including Palm, Nokia and Blackberry, but I feel that E61i is the ONE for me. I recommend it without any hesitations. Enjoy the elegant and powerful E61i ;)", "Date": "September 3, 2007"}, {"Title": "Disappointing Smartphone", "Author": "John Oram", "ReviewID": "R1BP51O17V89WK", "Overall": "2.0", "Content": "This review is written from the perspective of someone moving from a Blackberry or Treo.  If this is your first smartphone, you'll probably like it.  If you are switching from another device, you'll probably be disappointed.  If you are trying to use this for business, you'll likely be frustrated.My biggest frustration is with Mail for Exchange (and Mail in general).  If you don't need to sync over the air with a corporate Microsoft Exchange Server, this bit isn't for you.First, some good things.- MfE syncs quickly, sometimes even before my laptop.- MfE was easy to install and set up.- Battery life is great, on par with the Blackberry.- Very easy to switch between email accounts using the D-pad.Now the bad/ugly:- Let's go through the steps it takes me to send a new email:-- Why is `text message' the top option and \"E-mail\" the bottom option when I'm *already* in MfE and making a new message?-- Why do you ask me which account to use when I choose E-mail, especially how quickly I can switch between them? 99.9% of the time I want to write an email in the account that I'm in.-- Why do you make me jump to *another* dialog box for Corporate Lookup? Why not just give me an option to look up the name I typed in the to or cc line and come back with a list? The lookup itself is also incredibly slow. It probably takes me 30 seconds to get the name in the field. On the blackberry I've already typed and sent the message (and probably sent another 3 emails).- I can't click on a phone number or link in the email. WTF? The Treo's been able to do this since they were Handspring. Someone sends me a number in an email and I'm supposed to copy/paste? This is not fun for dialing into conference calls.- No auto-replace, e.g. youre -> you're. Try typing \"I'd\", I dare you. Annoying as hell. Why is the apostrophe buried under the slash key?- No ability to turn off notification buzz when in silent mode. This is really annoying.- Why don't you give me the option of downloading the whole message? Sure would be nice to be able to read the whole message on my flight, not just the first 2K.- You can't sync notes? Come on.- Don't get me started on the initial sync wiping all contacts and calendar entries. Here's a radical notion -- make a group called \"Exchange\" in both my contacts and my calendar. Delete that one all you want, but leave my personal entries *alone*. I know that this is probably a Microsoft ActiveSync issue, but deleting data to avoid dupes is a cop out. You give me separate email accounts, give me separate calendar and contact accounts.- Existing, repeating calendar entries aren't getting picked up.- Corporate Lookup doesn't give me a phone number, and isn't available in Contacts. How am I supposed to get phone numbers from the directory?- Far too often, MfE just stops checking mail. No error. Whether this is a network issue or a MfE issue I don't know, but I just don't trust it.Phone issues- Why is the zero off to the right? That's just weird. Put it where the @ is (and share it with the apostrophe key).- It's way too hard to see the numbers at night (or any blue key, for that matter).- I have fairly big hands, and the phone is wide.  Reeeally wiiiiide.  But it is very thin, and sturdy.  (But it's wide...)- The buttons are pretty flat.  They're easy to hit, but I found it tiring compared to the Treo or Blackberry.Then there's the whole network switching issue. Take a lesson from the iPhone -- if my WiFi networks aren't available, use GPRS. Or if I'm not getting mail on WiFi, go to GPRS. Don't make me chose every time. In general, Symbian needs to make the network switching more elegant. The iPhone's *killing* you here. I should NOT have to worry about it. SmartConnect helps, but this should be built into the OS. I have to pay more money to reliably connect to different networks on a mobile device? Often it would just sit there, not checking mail because it shut off the WiFi even though GPRS was obviously available.  Not cool.The whole issue of where settings live (not just networking, but everything) is a whole other issue. Way too many places, not very elegant.The e61i has potential. MfE has potential. But it's not ready for prime time. Sorry if this comes across as snarky, but this has been an incredibly frustrating experience given the potential of the phone (impressive battery life, great camera, wifi, well integrated VOIP).  I'm also worried that Nokia is prioritizing on their N series phones and won't be focused on improving the E series software.Summary: if you're coming from the Blackberry, you'll be disappointed by the Exchange-based email.", "Date": "November 11, 2007"}, {"Title": "Nokia e61i", "Author": "Martya", "ReviewID": "R3FT3BB3JFPDTR", "Overall": "4.0", "Content": "Absolutely love everything about this - with one exception.  The numbers on the keyboard are buried in blue background, and are not illuminated.This means in anything but bright light, using the phone function requires memory and some guessing.The screen is fantastic.Online performance fantastic.Everything except those numbers.", "Date": "November 1, 2007"}, {"Title": "huge improvement from a treo", "Author": "A. Fabbri \"afabbri\"", "ReviewID": "R1PTWE9VN4786D", "Overall": "5.0", "Content": "I've used my Nokia E61i for about 1/2 a year after having a Treo for the year before that.  I use this phone for- Exchange based Email and Calendaring-- with Good Email Messaging (3rd party sw)- Web browsing- Google maps: download the application--it works great and will give you directions and show your location based on the coordinates of the cell tower you are talking to (or you can add on true GPS).- Voice callsWhat I like:- Overall quality:  This phone is one of a few models that survived Cisco's rigorous tesing for a replacement for their corporate smartphones (previously treos).  They did a lot of QA on these devices and out of the few that survived (blackjack, moto Q, Nokia e61i), this phone has the best battery life.- Battery life: wow.  Only problem is that I tend to loose my charger now.- Moving from a treo to this phone took a little adjustment (have to quit trying to tap the screen).  This phone is much more solid (treo would crash frequently), faster, and the battery lasts about 3-4x as long as the treo ever did.- Email w/ Good Mobile Messaging software is very slick.  This is what my company uses.- Dimensions: this phone is very thin and light for how wide it is, and it is much more comfortable in the pocket than a treo.- Stability.  I can run my email and calendaring client (Good), the web browser (excellent by the way), and google maps at the same time without any crashes.  More programs than that and you will probably have to close something to get enough memory.  Switching between applications is easy, just hold down the app key and then select which app you want to switch to.- WiFi roaming:  I like having wifi available when I have a weak signal.  Web browsing is very quick on wifi.What I don't like:- You can't always copy and paste text as easily as you could on the Treo.  Mostly, the web browser doesn't allow me to copy text off a web page to use in another app.  This isn't a huge deal for me, since the click-to-call still works when I'm looking up phone numbers on Google Maps.", "Date": "February 13, 2008"}, {"Title": "Best smart phone I have ever had", "Author": "P. Panou \"good.panos\"", "ReviewID": "R1W8Z63U9U7NAA", "Overall": "5.0", "Content": "I have worked with a few smartphones before and let me tell you the Nokia E61i is one of the best ones.  If this phone had a mini USB port and a 3.5 headphone jack (or at least support bluetooth stereo), I think this would be the best smartphone out there.  That said, those are the two major flaws of the phone.  The rest of the features are pretty much great.  Here are my points:-- Phone/Voice - The sound quality on a voicecall is good.  The external speaker is loud.  You can record your phone conversations if you like.  No complaints here.-- Voicemail - There is an issue with my voicemail.  I use T-mobile and every time I turn on the phone, the phone tells me that I have a voicemail even though I don't.  So, I have to dial my voicemail to clear the voicemail indicator.  Thus far I haven't found out whether it's the phone's or carrier's fault.-- Keyboard - It's spacious and it has 4 extra keys than the typical smartphone keypad.  Here's something fantastic.  Some of the most used characters when typing a message like the period, comma, \"?\", \"@\", and \"/\", you do not have to press an option key like the Alt to get these characters; you just type away.  Unlike the Blackberry you have to press Alt + M to get the period.  So, in other words you can type up a message really fast.-- Wireless - You can group Wifi access appoints with GPRS connections so when checking email the phone automatically switches between the available connections.-- Battery - Lasts a long time.  I have email set up to check every 15 minutes accessing Wifi and GPRS connections and use bluetooth in the car from/to work and I only charge the phone every 3 days.-- Screen - It's big.  It's very pleasant to browse the Internet on this phone.-- PIM - Contacts, Calendar, notes, tasks are average.-- Bluetooth - Uses Bluetooth 1.2.  There is no support for stereo headsets.-- Memory - It only has ~60MB available to install apps.  However, the phone comes with a 2GB MicroSD card.-- Media - The digital camera is average.  You can play music and videos but you need an adapter if you are going to use headsets.All in all a great phone!", "Date": "July 28, 2008"}, {"Title": "Excellent and versatile phone", "Author": "getrishi", "ReviewID": "R1M9O1VC22COKL", "Overall": "5.0", "Content": "great phone. does everything. internet, chatting on any IM system, office editing etc. battery life is excellent. easy to use as a thetered modem. large screen bright and easy to read. good bang for the buck", "Date": "July 20, 2008"}, {"Title": "Great phone for the texter or data hound, as well as voice", "Author": "owe-me", "ReviewID": "R2FLVPCJCUKLBL", "Overall": "4.0", "Content": "I had never had a Treo, Palm, Blackberry or any traditional \"Smart Phone\" but I did get addicted to the full qwerty on my Motorola a630.  That is the main reason I got this phone, but there were many other things that impressed me as well:2 megapxl cameraupload to youtube right from phoneSymbian series 60 is reputed to be the best phone user interface and I cannot disagree with that--compared to Motorola's, this is light years ahead!Super ThinOther phones I considered to buy with my existing tmobile unlimited data plan:Tmobile DashLG Prada Silver (the one with the full on-screen qwerty)LG KU990 (Viewty)Motorola QSamsung Blackjak 2Nokia N76 (the only one of the bunch without a full qwerty)I had read and talked to alot of people that had bad things to say about WindowsMobile, so that ruled out the Motorola and Samsung.  LG's homegrown user interface didnt fare as well either--I tried one out and its simply atrocious (hard-to-use, frustrating)So I took the plunge and decided to try the Nokia E61i.  I was thoroughly delighted.  Not only was the Amazon price for it amazing ($329 unlocked new), but the phone just oozes quality.  The user interface in the software is super-easy to do all normal tasks, I can turn the beeps/ringer off with the touch of one button (the power button which is a rarity, in the upper right--you press and hold to turn on/off, but press normally to change the \"profile\" to silent and others).  Here is my main list of Pros and ConsPROS:very thin and fits well in your pocketwide screen and wide phone aids in holding it and not flipping sideways in your pocket\"Own key\" lets you set up whatever you want for it--gmail works great for mine!qwerty keypad is easy to type on (partially due to widness of device)buttons have great feel and dont accidentally get pressed in my pocket (they also have a keypad lockout feature but I dont even need to use it)Nokia carrier setup wizard automatically set up my device for tmobile network--you just go to their site, tell them your phone model and phone#, and they send you an SMS with a link to the tool.  It set up all data for me--wow!power charger is compact2 megapxl camera takes great photos outdoorsvideo camera is decentruns lots of great free java apps like gmail, google maps, yahoo go!stainless steel back gives it a quality feel--also its heavy and that helps the quality feel.excellent integration with the PC and Microsoft Outlook for syncing via bluetooth (I set it so that whenever it connects to my PC (when I first come within 30 ft) it syncs contacts, calendar, and notes)WiFi 802.11 network capable and its superfast when you can get itExcellent battery life!CONS: (these are very small issues in comparison with the pros and dont bother me much, but in case you are wondering)Some apps that are made for this device have fatal flaws in them that dont allow you to get past one of the intro screens (I am talking about you CellFire)Constantly asks me which network I want to connect to when nothing really has changed (but maybe some other WiFi network becomes available, or the GPRS signal is lost).  It should just auto switch to the strongest & fastest network available the way the iPhone does.No way to turn off the notifications on the phone when you synch with MS Outlook calendar.  You can turn off the sound, but still every appt I have it will flash the screen on and off, wasting my battery.  I just dont want to be bothered on the phone, but still need them on my desktop.Camera has no flashCamera has annoying tendency to make you think you are taking a picture at that instant when its really 2 seconds in the future (eg.  Aim and press center key, it plays the noise like a camera shutter and freezes the image---picture is taken, right?  Nope.  You must then hold your arm there and keep the camera as still as possible for 2 more seconds and the frozen image on screen is replaced by the REAL picture.  very weird and annoying)Cant take rapid-fire photos (both because of the above and because after each picture you have to hit Select > New > Image and then press the center key.  Why cant it just work like a good (ie Canon) digital point n shoot camera?Browsing web pages isnt as easy as with the iPhone (then again, this isnt  a touch screen so I didnt expect this)  You can view just about any webpage on this thing but if the people who wrote the website didnt do a separate layout for mobile, you are forced to scroll all over the screen and zoom in/out.No GPS onboard(but this isnt a big deal...yet) they want you to buy a $200 bluetooth GPS device.Proprietary connections for earpiece, charger, data (no standard mini-USB like the RAZR)OVERALL A GREAT DEVICE!!!!!", "Date": "April 26, 2008"}, {"Title": "not perfect but helpful", "Author": "TI \"TI\"", "ReviewID": "R2GONEAY65GY33", "Overall": "3.0", "Content": "it has so many functions but its speed is not as nice as its functions. and sometimes it just freezes.wi-fi is not stable.it only accepts SD upto 2GB and it is not enough.as a bottom line, it is very versatile and functional, but not superb.", "Date": "January 27, 2009"}, {"Title": "phone wasn't for me", "Author": "trisha", "ReviewID": "R1RR1AYO7W4NKZ", "Overall": "3.0", "Content": "I purchased this phone from Amazon recently but ended up returning it.  Although it seemed like a cool phone, it did not have some of the features I wanted.  The main problems I had with the phone were:1.  Your only options for putting a repeating event in the calendar are daily, weekly, every two weeks, monthly and yearly.  If you have an event that you do the third saturday of every month or once every 90 days, you have to enter every event by hand.2.  From what I could see, the phone would only allow for .txt documents.I figured for the amount of money I was spending, I should at least have the option of doing a .doc out of the box and being able to put in a repeat event.I ended up purchasing the Nokia E71, however, I had the same problem with the calendar.  I finally decided on one of the new Palm phones, which has all of the features I want.  If you need to have the option to put in an event in the calendar at at times other than those listed above, be prepared to enter them all by hand.", "Date": "October 15, 2008"}, {"Title": "really fancy", "Author": "J.A.", "ReviewID": "R2TYJCLZ050DF2", "Overall": "5.0", "Content": "I am really impressed with this phone, its so much nicer then the Blackberry pearl. My friend just bought a Pearl and then saw my phone and returned it. It just does not compare, this phone has so many more features, and a drastically nicer screen size.", "Date": "September 15, 2008"}, {"Title": "Nokia E61i", "Author": "James D. Portaro \"Jim\"", "ReviewID": "R2GPVQI7YWCBUL", "Overall": "4.0", "Content": "Nice phone with good features. Handset sound quality is a bit low, but overall great quality.", "Date": "September 30, 2008"}, {"Title": "Really bad PDA", "Author": "J. Kahlon \"jkahlon\"", "ReviewID": "R12EOE82K8TL9X", "Overall": "1.0", "Content": "I have a Nokia E61i and it is really a very frustrating experience. It is a good phone but a very bad PDA.Networking is a nightmare with the phone it keeps going to different networks at random. Seems it stores the access point with the bookmark, who does that. Constantly get out of memory cards when there is plenty of mem left and I have also added a @ GB card.Would not want anyone else to go through what I have gone through after spending good money on this. Not recommended please do not buy.Also there is a reason why Nokia is moving away from their own s/w and will start using MS s/w for their phones some time in the future.Really bad the way Nokia is able to pass this on to consumers with deceptive marketing.", "Date": "August 12, 2007"}], "ProductInfo": {"Price": "$449.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 2100 UMTS plus GPRS/EDGE capabilities\nFull QWERTY keyboard and 2.8-inch LCD screen; Wi-Fi networking (802.11b/g)\n2-megapixel camera; 60 MB internal memory; MicroSD expansion; Bluetooth for handsfree devices; digital media player; access to email with document viewer\nUp to 4.7 hours of talk time, up to 360 hours (15 days) of standby time", "Name": "Nokia E61i Unlocked Phone with 2 MP Camera, International 3G, Wi-Fi, Media Player, and MicroSD Slot--International Version with Warranty (Mocha)", "ImgURL": "http://ecx.images-amazon.com/images/I/51AuIucwXLL._SY300_.jpg", "ProductID": "B000SB7VIU"}}