{"Reviews": [{"Title": "Nice phone, but beware of the version", "Author": "P. Suranyi", "ReviewID": "R3NDQ4A7LZP1Y2", "Overall": "4.0", "Content": "This is a cool phone but be careful because Amazon will send you a Chinese version, not an English version like they have in the picture. I ordered from Amazon because I thought that they would not do this sort of bait and switch like you see on ebay. Unfortunately I was wrong to trust them.", "Date": "December 20, 2007"}, {"Title": "Great Deal For Classic Phone", "Author": "Alexey G. Finashin \"dowg\"", "ReviewID": "R2HYAAD8D8QFGU", "Overall": "5.0", "Content": "First, this is not a Chinese version as P.Suranyi stated in his review. The only difference is it has europian style power adapter. They solved this problem by adding USA/Europe/China adapter in a package. So there is no different between U.S. and Chinese version. Second, I was affreid to buy a phone and found out that it has Chinese fonts only. As soon I turned it on everything was on English. I ordered this phone for my brother who lives in Russia. He is so happy to have this phone.  Great phone for great price.", "Date": "January 22, 2009"}, {"Title": "still digging into features", "Author": "Marcus A. Hawkins", "ReviewID": "R2OA2AME0KZ445", "Overall": "4.0", "Content": "Bought it couple weeks ago. Easy to use, simple menu can be change for individual taste. Easy to connect to PC and install games and applications. The only problem- doesn't play simbian applications only java, so beware.Had some problems with contact list when I got it, but it updated itself through PC and fixed the problem itself, which was nice.Fell once, still works not a scratch. So far I am happy with it.", "Date": "October 1, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 850/2100 UMTS plus GPRS/EDGE capabilities\nSeamless case of anodized aluminum; 2-megapixel camera/camcorder with LED flash; digital media player\nBluetooth for handsfree devices and stereo music; internal 1 GB memory (no expansion); organizer; access to email\nUp to 4.5 hours of talk time, up to 300 hours (12.5 days) of standby time", "Name": "Nokia 6500 Classic 1 GB Unlocked Cell Phone with 2 MP Camera, International 3G, Media Player--International Version with No Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41QVg%2BOrk1L._SY300_.jpg", "ProductID": "B000XRZR9E"}}