{"Reviews": [{"Title": "palm treo", "Author": "George Harvey", "ReviewID": "RPYLLWMTVIQDE", "Overall": "5.0", "Content": "I bought this phone because I wanted a phone that could sync with my calander and contacts without having to be on a data plan.  All other smart phones with Verizon required a plan. If you get this phone, I would also recomment that you buy Spb Mobile shell, which is a great interface.", "Date": "December 10, 2011"}, {"Title": "Palm Treo 700WX", "Author": "Kenneth A. Steele", "ReviewID": "R2HN9D76HVICAE", "Overall": "5.0", "Content": "Great phone! Bluetooth, WIFI slot, calendar, touch screen, camera, video recorder , GPS adapter, Microsoft Windows Mobile 6, Microsoft Office, Word, Excel, Power Point, Outlook, PDF reader.", "Date": "September 25, 2011"}, {"Title": "Awesome....", "Author": "Ann-Marie", "ReviewID": "R3I9QI4TFVDHC3", "Overall": "4.0", "Content": "I recently purchased the Palm Treo 700w....it is an awesome phone, I would recommend for anyone who wants a reliable, stylish phone that works.....everything works fine, and like I said, it's a stylish smart phone.....", "Date": "August 9, 2010"}, {"Title": "Palm Treo 700w/wx Problem with texting", "Author": "Linda W.W.", "ReviewID": "RSJEWZO0K2SEE", "Overall": "1.0", "Content": "This WAS a great phone...I loved it until this last summer when it suddenly stopped receiving text messages from people with cells of other carriers.  After much time with Verizonwireless support, I was finally told that the problem was that texts from VZW customers to phones of other carriers are routed through Syniverse, a 3rd-party company which re-encodes the message. Syniverse made recent changes in the encoding technique that have made it impossible for VZW Treo 700w/wx to receive texts from other carriers besides Verizon. Verizon tech says the problem is in the Treo 700w and 700wx software. Verizon is not going to support a fix for the problem....so anyone now using a Treo 700w/wx will not be able to receive texts from cells with other phone carriers.", "Date": "October 31, 2012"}, {"Title": "lost verizon", "Author": "Ronald W. Johnson \"Old Curiosity Shopper\"", "ReviewID": "R51TY42AIPWO7", "Overall": "4.0", "Content": "I bought this phone last month;  as far as I could tell it LOOKED as good as new (it was labeled 'refurbished'); but before I could activate it, I saw two problems:  it didn't seem to be able to hold a charge overnight, and where I'm located Verizon just doesn't seem able to maintain a connection.  I called the seller, who said I needed a new battery, but they did not provide one;  I bought a new extra-strength battery from Amazon, and that seemed to solve the charge problem.  BUT talking with a Verizon representative, I was told my problem was that I'm calling from inside a building;  that didn't satisfy me for a few reasons:  I used to have a Palm Treo 680 + AT&T;, which I always used within a (different) building, and didn't have connectivity problems, and I've asked other cellphone users who do not have Verizon and can stand right next to me & use their phones without problems.  Also, I am located here for the forseeable future (living in a home for the physically disabled), so relocating is not a reasonable option;  and I do have to go to a hospital occasinally, and really need to have a smartphone I can rely on at those times.  I REALLY LIKE THIS PHONE, BUT I wish I could have it changed to use on another server, probably AT&T.;  IS THAT POSSIBLE?", "Date": "November 29, 2011"}, {"Title": "Palm Treo 700wx", "Author": "Samantha", "ReviewID": "RYTKRMUJXG690", "Overall": "5.0", "Content": "I love this phone. I had it a few years ago and decided o go back to another one. The Blackberrys are to expensive and I love the Microsoft base for this phone. It is very helpful with the excel and powerpoint.", "Date": "August 12, 2011"}, {"Title": "Did not work", "Author": "Melissa Wheeler", "ReviewID": "R2BVKRYNZAK14Q", "Overall": "1.0", "Content": "It didn't work. When calling someone, the other person couldn't hear you. You could hear them. You could make calls, but the person couldn't here you", "Date": "January 8, 2013"}, {"Title": "This model is great!", "Author": "Wendy Woo \"2beijing\"", "ReviewID": "R1IDB5M4HJ1V28", "Overall": "5.0", "Content": "I have owned many phones and had stayed with Palm until the 750 model came out. I bought a few of these older models - I had one for 7 years!!! Travel a lot internationally dropped it, threw it a few times! It worked great!", "Date": "August 24, 2013"}, {"Title": "could not activate phone", "Author": "joe stampley", "ReviewID": "R1W5RFL162409L", "Overall": "1.0", "Content": "I sent the treo 700 back to sender.  I sent it abour aweek  a go.  Have not  recieved the phone at this time.  Can you  follow up on this item.  Please give me some feed back.", "Date": "April 12, 2013"}, {"Title": "wrong product", "Author": "Joshua L. Gadson", "ReviewID": "R1SDQYR3LP0VKP", "Overall": "1.0", "Content": "paid for a palm treo 700wx. received a palm treo 700p. very very unhappy with the phone i received. nuff said", "Date": "November 27, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Mint Palm Treo 700wx - Refurbished in Brand New Housing and Ready for Activation on Verizon Wireless Contract Free\nWindows Mobile Pro 5 OS; MS Exchange Mail Support; Multimedia and SMS Text Messaging; GPS Location\nTouch Screen with Stylus; 1+ Megapixel Camera; Bluetooth Compatibility; Music Player; SD / MMC Card Slot with SDIO Support\nQWERTY Keyboard; 60MB Internal Memory; Modes: CDMA 850/1900; LCD Display; Dimensions: 4.4\" x 2.3\" x 0.9\nOffer Includes - Palm Treo 700wx PDA Smartphone Device, Battery, Stylus Pen, and Wall Charger", "Name": "Palm Treo 700wx very Good Windows Mobile PDA Cell Phone for Verizon Wireless with No Contract", "ImgURL": "http://ecx.images-amazon.com/images/I/51MX1GNOMXL._SY300_.jpg", "ProductID": "B000JQ78IM"}}