{"Reviews": [{"Title": "Not Bad....Just Not the iPhone Killer", "Author": "Winter", "ReviewID": "R3HMLM8LO8KTPT", "Overall": "3.0", "Content": "I've had my XpressMusic for a few months now.  I bought it because I wanted a smartphone.  Rather than trying to fit myself to the iPhone crowd, I did research to find a phone that fits me.  I'd read about the 5800 being touted as an \"iPhone Killer\", but such talk is silly simply because the XpressMusic isn't the same animal nor does Nokia bring enough to the table to even come close to Apple's market saturation and \"Joe & Jane user\" appeal.The Nokia 5800 XpressMusic is an excellent phone for people who love media:  it's got a browser for streaming, easy-to-use software for transfers of your own files, and it even has a built-in FM radio for listening to local stations (with the added bonus of being able to tag and label them).  The screen is approximately the size of the screen on a Nintendo DS or a Sony PSP, with the difference being that colors are bright, resolution is sharp, and the backlight is superior.  Power button, standard headphone adapter, charge plug and USB connector are all on the top, making it easy to access but conveniently out of the way.  The touch screen is unlocked via a rocker key on the side, and volume can easily be adjusted up or down along the same edge.In addition to this, you can expect all the same features you find in most smartphones today:  GIS-driven mapping systems, Internet connectivity via WiFi (if, like me, you're not on an unlimited data plan), a multitude of Bluetooth capabilities, integration with a PC or Mac via the USB Cable, and of course a digital camera that takes good (but not great) pictures and video.  One nice extra here is that if you hold the phone like a camera, a button on top will quickly switch the phone to camera mode and also double as your auto-focus and picture-taking button.I like the feel of this phone, and I definitely like the clarity and strength of the calls.  There are times when it appears that I have only one bar, but still can place clear and noise-free calls that don't disconnect.  The software is regularly kept up to date, and once you get through the process of setting up an account at the Ovi Store, it is remarkably easy to download and install applications, many of which are free (but only some of which are useful).The one big drawback--and it is a serious one--is the interface.  Features and Applications are in two separate sections, and sometimes the dividing line between which is which is not exactly clear.  The auto-rotate that switches from Portrait to Landscape can go off at the slightest of bumps, and I have to shake the phone and wait for it to re-set.  I bought the phone because I wanted a good, solid handwriting device, and this is where I have been most disappointed.  Despite being a whiz at PDAs, despite training (and re-training) the phone to my handwriting, I get many botched translations.  I have to force myself to scribe slowly because the delay time between reading my strokes and rendering a character is noticeably long.  I have to patiently re-do most of my strokes over and over.  To give credit where credit is due, Nokia gives you a slim stylus cleverly hidden along the side of the phone, and then they throw in a hip little gadget called a \"plectrum\":  it's a triangular guitar-pick that makes a handy substitute for a fingernail--consider this for pointing and clicking and the stylus for handwriting.There is, however, one sin that seems unforgivable, and I'm surprised that a year and a half down the road, the updates still haven't addressed it:The phone dialer has no letters on it.Let me rewind that:  if you call up the dialer in other areas of the phone (such as via contacts), you will see the letters imprinted on the dial pad.  However, if you want to dial a number with letters in it (say, \"1-800-FLOWERS\"), you are out of luck:  the dialer shown when dialing the phone does not display any letters.  The fact that the letters are imprinted elsewhere in the system, but not where they are most important, is what makes the lack of this \"fix\" annoying.Also, while the software is easy to use, it is also incredibly slow and buggy in Windows Vista or Windows 7. The interface often turns black and I have to scrub my mouse over the window to re-draw my menus and panels.If you really like media and want a phone for music, pictures, and video, the 5800 XpressMusic is not bad.  However, if you're looking for a pocket-sized computer that can do whiz-kid propeller-head tricks, the 5800XpressMusic will most likely disappoint, especially given its price.  As much as I appreciate what Nokia was trying to do with this phone, it really wasn't significantly different from my Motorola RAZR.NOTE:  I cannot confirm that this is true of all Nokia 5800 XpressMusic phones, but the \"USA\" Phone that was shipped to me contained a European power adapter.  This huge chunk of plastic contains a converter to allow it to plug into US electrical outlets, but it also means that your charger is anything but pocket-sized.  I sent mine in for a replacement, only to discover that the replacement also contained the same \"Euro-plus-converter-widget\" charger.", "Date": "January 20, 2010"}, {"Title": "Excellent Features, but Freezes a Lot", "Author": "Marco Rosas", "ReviewID": "RCISL599B5037", "Overall": "4.0", "Content": "First, I'd like to say this phone is utterly the best value on the market for the features you're getting. A savvy shopper could find this phone for $200. And the Nokia 5530XM goes for $180 (difference is it has no 3G).This thing has wifi and it's an absolute Godsend. Nothing else in this price range has wifi. Maybe they have \"mobile\" internet, but then you'll be racking up a $30+ data charge each month. Another great thing about this phone is that it uses sd cards. That way, you can replace every once in a while and not have to delete anything. This thing also has a decent screen (twice the pixels of an iPhone despite being smaller). There's also rave reviews out there about the quality of the music. It also has a decent 3.2 Megapixel cam. That's better than the new Palm Pixi. This thing has all the features of the $500 phones. The key difference is that its 3G is slow and it has lower RAM at 128 MB (compared to most higher end phone's 256 MB). This number is acceptable at the price you're paying.Now for the bad part. It's with the deepest regret that I must support the account of the first reviewer. I completely believe this thing will break down on you. In the first few days I've owned this phone, it's freezed 3 times on me already. One time it was just when I was random browsing. Another time it freezed on me when I connected it to my laptop. Finally, one time I turned it on and it wouldn't recognize the touchscreen. The bottom buttoms were fine but the touchscreen stopped responding. However, I've read from another person on the internet with the same experience and (despite constant freezing), it didn't stop working like the person's did above. I don't think this phone will last much longer than 2 years.Overall, it's a good phone but it's rather unstable.", "Date": "December 19, 2009"}, {"Title": "nokia 5800", "Author": "rick69", "ReviewID": "R2LXW04D5A6SDM", "Overall": "3.0", "Content": "nokia 5800 cell phone arrived as said in the description, with accessories and in good condition, excellent shipping time.Thanks", "Date": "August 16, 2010"}, {"Title": "phone died in 5 days. 4 and counting attempts by nokia to repair  SAME ISSUE", "Author": "Gowri Somanath \"gs\"", "ReviewID": "RRGO7E748A10O", "Overall": "1.0", "Content": "phone died in 5 days. 4 and counting attempts by nokia to repair  SAME ISSUEif you find anything wrong. RETURN for REFUND immed if possible.Purhcased at NYC flagship store. I had the phone working for 1st 5 days. When the battery started to discharge, i tried charging. It didnt charge at all. Store gave me new battery saying battery was at fault. Again same issue. It wudnt even turn on with the charger connected - so clearly its not just battery problem. By the time this battery discharged , the 14 day return period was over - pretty sure they knew it.Then started the saga of sending to nokia service center - PALCO. Already sent 4 times. each time had to ship back same evening or next day. Same problem for \"repaired\" \"replaced\" and \"repaired again\" phone.First they claim its \"repaired\", then 2nd time they claim \"cannot be repaired...so replaced\"...why did they send it then?but the so called replaced also had same issue - how can this be co-incidence?again sent...they claim repaired....but same issue.When i call....they dont agree to send me a courtesy phone since its clearly their mistake and 4 attempts are enough to figure out im being cheated.They wont give me refund or replacement.They wont even agree to send me a email saying they take responsibility to resolve the issue.5 is not my lucky number....i have no hope it will get resolved.looks like they will continue playing ping-pong till end of 12 months.WORST set of people.Bottom line: NEVER BUY UNLOCKED PHONES- even if its nokia flagship storeNEVER BUY NOKIARETURN WHEN YOU CAN", "Date": "December 12, 2009"}, {"Title": "Nokia 5800", "Author": "Nava Rim \"Nava\"", "ReviewID": "R1NAZWVZ2O1ZBF", "Overall": "5.0", "Content": "I ordered Nokia 5800 from Bigtime Wireless and it came fast all the way to Nepal and the phone works great. The Nokia 5800 has great features and I highly recommend the phone and the seller. I am buying another one soon from Bigtime Wireless.", "Date": "December 7, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000HAGVXS"}}