{"Reviews": [{"Title": "disappointed", "Author": "Kathleen C. Nachtrab", "ReviewID": "R2N0KWZYTKTZY0", "Overall": "3.0", "Content": "I am totally disappointed.  I have a feeling if I had bought this phone in the store I wouldn't have the problems I'm having.  However, I ordered it directly from Amazon because I needed an unlocked phone and they are a lot easier to find online.  The phone arrived with what I thought was a weak battery.  The phone charges super fast and then half way through the day it dies.  So I purchased a new battery only to find that the same thing is happening.  So, I'm guessing the phone just sucks all the energy out of any battery that is used.  I really would love to return the phone but I purchased the unlocked phone while I was in the states because I live in the Caribbean and needed a new phone that will take any sim card.  And you can get better quality and less expensive phones in the states.  Needless to say I won't be buying online again.  I also thought that because I was purchasing directly from Amazon that I would not get a bunck product....WRONG.  I really do like the phone, the looks etc...but due to the battery issue and other little querks I feel like I got dupped.", "Date": "September 18, 2009"}, {"Title": "I have this phone in Germany", "Author": "Kym", "ReviewID": "R8Z06GPGTVEO1", "Overall": "4.0", "Content": "This phone is a great phone. Great memory, Great storage space, it is great for its price and its about $200 EURO over here!! There also a chip to go with it that increases its storage space which is already amazingly big for its size without the chip. This phone is a must have. The only Neg I have about it is the paint on the Top fades away very quickly giving it an older look after only a few months. But if your not too picky about the looks, it a great phone.", "Date": "May 21, 2009"}, {"Title": "cheapest phone ever........", "Author": "KBK", "ReviewID": "R2RR9QU8R9E8NI", "Overall": "1.0", "Content": "I bought this for my mother in law who lives in Africa b/c she needed a phone that could take a sim card. what a waste of money? after 2 months she called me and told me that it fell apart. i was so disappointed. will never buy this again........", "Date": "February 11, 2011"}, {"Title": "DOA - DEAD on Arrival", "Author": "William Mclean \"xbill\"", "ReviewID": "R29I6ZO7BZ3F30", "Overall": "1.0", "Content": "This would be a nice phone if it actually worked.The phone was not new - the box arrived opened withthe seal broken.The charging cables did not work.And to top it off - the phone had a white screenwhen I tried to boot it up.Sending it back- this is only my second product ever thatI have had to return to Amazon- it must be a sketchy seller.", "Date": "November 10, 2010"}, {"Title": "Great Cheap Phone", "Author": "Thomas Copeland", "ReviewID": "R49AXIIP5BU4L", "Overall": "4.0", "Content": "Bought this phone in Oslo airport in December 09 for about the equivlaent of $100 USA. That included a pre-paid sim card for Norway. I needed a cheaply priced phone I could use in Norway as I travel there frequently and was tired of fussing with the pay phones at Gardermoen.I took it home to California, plugged in my T-Mobile sim card and phone worked beautifully. Worked so well I tossed my US bought phone in the drawer. No problem recharging when using an adapter plug for USA. Battery lasts about 3 day depending on usage. I use the FM radio and the MP3 player quite a bit. I even expanded the MP3 files using the Micro SD card. Only wish is I could use the FM player with the bluetooth headphones like I can with the MP3 player. Have to plug in the headphones that came with the phone to use the FM radio.Never had a issue with the phone, works great, has held up well (of course I'm careful not to abuse it) can use it in multiple countries (just plug in a different sim card), hardly cost a thing to purchase (something is actually cheap to buy in Norway? No way!) and allows me a complete pay as I go solution to phone service anywhere in the world. Just buy a pre-paid sim card for whatever country I'm going to. For me at least a perfect world solution. I don't need a gadget, just a workable phone.", "Date": "May 28, 2010"}, {"Title": "Die Hard, Die Too Soon!", "Author": "C. Hawke \"oldmoviequeen\"", "ReviewID": "R2XVE7X6KB551U", "Overall": "2.0", "Content": "These are great phones for about three months (or less) after which they simply find a half dozen good ways to fail.  The sliders fail, the electronics fail, the screens fail or the sound fails.  Amazon was good enough to let us return our original two as well as the two replacements...ALL of which failed with normal usage in a matter of months.  I think it is best to consider this phone laden with inherent design flaws and while it has crisp sound and picture, unless handled with kid gloves will not likely survive the daily grind.", "Date": "February 20, 2010"}, {"Title": "Worked for less than 2 months, failed, cheap materials", "Author": "W. Hutchens \"Prof Hutchens\"", "ReviewID": "R19AKW2YA6HQ9W", "Overall": "1.0", "Content": "Phone arrived promptly and worked fine initially, so my first diappointment was only that what looks so nice and glossy in the product photos turns out to be cheap plastic, put together in a crude way--the phone creaked in normal operation. There is a metal version of this phone that is nice, but this is NOT it . . . only looks like it in the photos. I would have been somewhat disappointed but not angry had the the phone worked for more than two months. Never dropped it, but it started going haywire and then died entirely. Whole purchase price wasted. Double thumbs down from me.", "Date": "December 3, 2009"}, {"Title": "Defective Product", "Author": "Techs \"kg1\"", "ReviewID": "RS9UPN3PBS4DO", "Overall": "1.0", "Content": "Received the phone in good condition used it to make a couple calls and suddenly the display went blank.I thought buying from amazon direct i would have gotten a quality product I'm very disappointed.", "Date": "August 5, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nUnlocked tri-band GSM cell phone compatible with 900/1800/1900 frequencies and EDGE data capabilities\nSlider-style phone; VGA camera/camcorder; digital audio player compatible with MP3, AAC files; FM radio tuner\nMicroSD memory expansion; Bluetooth stereo music; access to personal email; web browser; SMS/MMS/EMS messaging\nUp to 5 hours of talk time, up to 250 hours of standby time", "Name": "Samsung SGH-E250 Unlocked Phone with Camera, Media Player, Bluetooth Music, and MicroSD Slot--International Version with No Warranty (Ebony Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31AVgZ4mDiL._SY300_.jpg", "ProductID": "B000Y19ZQ0"}}