{"Reviews": [{"Title": "Great Blackberry, Horrible Phone", "Author": "Scott R", "ReviewID": "R2OI0RUVIIFV2J", "Overall": "3.0", "Content": "I'm part of the market RIM targeted for this phone - people who really didn't want to carry that blocky blue thing and wanted something a bit more phone-like. Looking around the building, I think they're succeeding, but wow, what a terrible phone.Physically: the phone is light - it also feels flimsy and the casing feels fake. I've already dropped it a few times (par for the course for me in general), and it's survived, but I feel like a stiff wind causes some risk. The screen is already scratching, though slightly and unobtrusively.Blackberry-like features: I also won't extol the virtues of the Blackberry - either you get it or you don't - except to say that Outlook/Exchange integration is excellent, the best Calendar integration, in particular, that I've seen. I don't know why the Contacts don't sync wirelessly, which for me isn't much of a problem but may be more difficult for others. I get emails to my Blackberry faster than they appear in my Outlook. Level 1 messaging, which isn't defined absolutely anywhere for the customer, is a great feature. I cannot comprehend why you can't default the mailbox to your inbox, rather than the everything-you-do-box, but c'est la vie.Much gnashing of teeth about the keyboard. I can empathize, but having never used the normal Blackberry keyboard, I can't compare. I don't love SureType - it doesn't pick up new words well, and I'd like some autocomplete - but it's fine. My bigger problem with the keyboard is I mistype all the time, and I have small fingers. Not sure what happens to the larger-digited among us.My real complaint, though, is that the basic functionality of a phone is _painful_. I ask very little from a cell phone: mostly, I want quick access to the address book, so I can find names when I'm at a traffic light or walking, and I want to do it without looking at the screen very much. In this, the Blackberry fails miserably. I have to turn this dial and click that and type lots of letters and then turn the dial again. Makes me want to throw the thing out the window. This is not a hard problem - every manufacturer has solved it! - RIM could do so too.I want easy-to-lookup Contacts (one problem with the Contact Outlook integration is I don't have names like \"Joe\" and \"Mom\" and \"Home\" in my contacts), but I concede the problem there, though it's solvable.I'm getting mixed results on the reception, either with the phone held to my face or with the included headset.So yeah, I'd buy it again, but I'd hold my nose.(Wrote the same review for the 7100g and 7100t, since they're the same phone)", "Date": "August 4, 2005"}, {"Title": "Not the ultimate smartphone anymore, the 8700 is much better", "Author": "Earl E. A. Dopter", "ReviewID": "RIMH8E5N54FKI", "Overall": "4.0", "Content": "If you already use a BlackBerry, you don't need me to spend a bunch of time talking about how useful the mail service is. If not, there are plenty of articles about the basics. So, I'll focus on this phone's useability and shortcomings as compared to previous BlackBerries and as compared to other smartphones.The first thing you notice about the phone is the feature you will appreciate the most; the large color screen. I love how everyone harps on the size of the BlackBerries. The fact is that you can't have a large screen and a keyboard on a phone the size of a matchbook. The size of the unit is about as compact as could possibly be expected for what it does.The second thing you will notice is that the battery cover is slightly loose. This makes the whole phone feel cheap, which is a shame because it's actually well-made other than that one flaw. You do get used to it, but it's amazing how much a small defect like that can change your perception of the phone.The useability of the unit is as good or better than the previous iteration of the BlackBerry, the 7290. It takes a few seconds to grasp that instead of having a screen full of icons that you scroll through to get things done, you now have a compact text menu that accomplishes the same thing, usually faster than before since you have fewer things to scroll through to get where you are going. I like it better.Another big improvement: this thing is much easier to hold and use as a phone than any other BlackBerry. Hands down. No possibility of accidentally hanging up on your call because the side-mounted escape key does not perform that function anymore. This was one of my most severe criticisms of older BlackBerries. Now you have a real dial and hangup key. Much better. Also the earpiece is natural and the sound is much clearer. Older units were almost impossible to keep centered on your ear and the sound volume rarely was high enough.The Bluetooth functionality is still nearly zero. I can't tell you how annoying that is. I keep hearing that they are planning on un-crippling it soon but for now the only thing you can use with it is a wireless headset. The one I have worked pretty well with the older BlackBerry units but I find that the volume is too low on this new one. Maybe there is a software or firmware upgrade that will fix this, but I have not explored that yet. NOTE TO RIM: FIX THE BLUETOOTH. NOW. (UPDATE: BlackBerry still has not fixed the Bluetooth. I have now been through three units via warranty exchange and have used three different brands of Bluetooth headsets. None have corrected the volume, and all produce an echo that is heard by the other party but not by myself. Very disappointing. I am seriously considering the 8700c as an upgrade.)Another thing, and this applies to all BlackBerries not availing themselves of the expensive but excellent BlackBerry Enterprise Server (BES) software solution: there is no \"wireless sync\" of your email, even though the option appears on your phone. I cannot understand why they don't grey out the option so that users can avoid spending their precious time trying to chase this handy but unavailable feature. With BES, however, your corporate Exchange Server will be continuously and wirelessly synced with your Outlook. This is the ultimate solution.Failing BES, which ordinary users without a corporate server will never have, (plus it costs $2500, making it hard for small businesses to afford either - are you listening, RIM?) you can choose to use the Web Server or the Desktop Redirector. I recommend highly that you stick with the Web Server. The Redirector forces you to keep your desktop computer on all the time, and it is annoying even when it is working properly. Web Server is the way to go here.With the Web Server, your emails come to you realtime, automatically. It's great, and is the key attraction to BlackBerry in the first place. As to the functionality of composing emails, I can only say that the full QWERTY keyboard of the 7290 and other iterations of the BlackBerry is better than this one. I miss it. On the 7100, there are two letters per key, and the phone figures out what you are trying to spell using predictive text software. Generally it works OK, but it is tedious to spell proper names, technical words, etceteras. You need a little more patience. On the other hand, it's a giant leap forward compared to regular phones where you have to multitap to get the right letters. Further, what you give up in text entry you gain in phone dialing, which is MUCH easier on the 7100.This is a true integrated device. When someone calls, it instantly looks up your contact and displays the name as it appears in your Outlook address book. If someone emails you, when you open the email, if you click the wheel the options that are presented are specific to that email; only options that you can actually accomplish will show. You can call the contact who emailed you from this screen, respond to the email, SMS that contact, etceteras. No lookup is required.I found the sync between Outlook and the 7100 to be flawless. MUCH BETTER than Palm OS, and as a longtime Palm user (since 1995) I know what I'm talking about. You can even sync it to multiple address databases (I sync to my personal addresses and my corporate addresses simultaneously) and it did fine with 4500 addresses in memory. It has NEVER locked up on me or performed even a soft reboot.There are a bunch of ringtones, which I could care less about, but they are now polyphonic which is a large leap forward for RIM. And, a speakerphone that actually works rather well.The holster is great as long as you don't try to clip it to your belt or anything else. In other words, it's useless. The holster on the 7290 was very useful and well made. Not sure why RIM moved away from that - big mistake. You won't use the holster. I recommend you just carry the phone in your hand or pocket. Choose a pocket that doesn't have keys or change, though, because this thing will get scratched if you don't take care of it.Overall, I like the phone. I just hope that RIM will address its shortcomings in the next round and come up with the ultimate integrated phone solution (which - trust me on this - doesn't currently exist. Period.) I think it's the best available, including every Windows Mobile device, every Palm device, and every Symbian device, many of which I'm familiar with either from personal experience or from having researched them. The 7100 should tide you over until the ultimate phone does eventually get created. We are probably within a year or so of a five star smartphone, for those of you that can be patient.", "Date": "August 1, 2005"}, {"Title": "A very good cell phone, but...", "Author": "Donni Subagia", "ReviewID": "R1V9CRT8I3PG9T", "Overall": "5.0", "Content": "This is a very good cell phone and Amazon.com gives the best deal. But, you can't transfer your old phone number from different provider to Cingular through Amazon.com. If you transfer your old phone number, you won't get your mail-in rebate. Please read amazon.com mail-in rebate rules carefully!!!You can read about how to transfer your number through this link : http://www.amazon.com/exec/obidos/tg/feature/-/508597/102-6686881-6992121", "Date": "September 17, 2005"}, {"Title": "Excellent Marriage of Blackberry and Phone", "Author": "S. Hammond", "ReviewID": "R31A424T7FWBJC", "Overall": "5.0", "Content": "On my request quest for mobile e-mail, I purchased the BlackBerry 7290 from Cingular.  While that phone had a good color screen and filled my require for bluetooth, I found it to be an absolute brick to carry around and to hold to your face when a regular phone was desired.The BlackBerry 7100g released a week later and I promptly traded in my Blackberry 7290 for this one.  This device is almost perfect.  The screen is large and vivid and very easy to see.  It has all of the features that are common to the blackberry's such as the scroll wheel.The thing that impressed me most with this device is its usability as a phone.  While larger then today's typical cell phone, it is modeled after the candy bar phone and is very comfortable to hold and talk on.  The reception is typical compared to my other phones.  Having bluetooth and speaker phone both combined into this device makes it the most usable phone that BlackBerry has available.The only things this device lacks are:  Camera  Real Music/Sound Ringtone capabilities  MMS messaging capabilities", "Date": "March 24, 2005"}, {"Title": "RIM 7100g is a winner....", "Author": "R. Chen \"wahoodude23\"", "ReviewID": "R2LS5LOJTU6N0U", "Overall": "4.0", "Content": "Until now, the cell phones I've been carrying around, get smaller and ligher with each iteration. My last cell phone was a Siemens SL56 - so you can imagine the flashback to late 90s I had when I got my BlackBerry 7100g. Due to my job and the amount of email I get, my company bought me one. I've been pleasantly surprised, the good most definitely outweigh the bad so I'll go through them below.Good1) Email push is wonderful. Real-time emails from my corporate server and my gmail account. Now when I'm in a meeting or on travel I can increase productivity by not having to wait to answer email. I can respond to friends faster also.2) Speakerphone. This is the loudest, most clear speakerphone I have ever heard.3) WAP brower/screen size. I don't know the exact dimensions but it's a big screen.4) Price - this is cheaper than the smart phones with better email integration.5) Weight - it's surprisingly light for a phone this size.6) Holster sensor - this is really cool. You can set your phone profile differently depending on whether its in or out of the OEM holster. Ingenious.7) Suretype - some people hate this. Since I've never had a previous BB and my previous text messages were painfully composed on a standard numeric keypad on the Siemens SL56 - the suretype technology is wonderful. In the 2 weeks I've had the phone, I've sent over 100+ messages and have only corrected a word manually 5-6 times due to Suretype picking up the wrong word.8) PIM synchs faster than the IPAQ to my desktop.9) Scrolling wheel for navigation - again - this is so much better than arrows or 4-way buttons. The wheel is just way more intuitive. It somewhat simulates the scroll on a mouse.10) Multi-tasking: You can have multiple applications going on simultaneously including a voicecall.Bad1) Size - even though its got a better form factor than previous series, it still feels like a brick especially when I hold it up to my face.2) Regular voice-calls. I hear other ppl perfectly. I've been told that if I'm talking in the car while the window is down, I'm incomprehensible. I could get away with something like that on my previous cell phones.3) \"No voicemail\" SMS popups - when all of your voicemails are checked it sends an annoying SMS that your mailbox is empty. You have to manually delete/close the popup. I know I'm picking at little things, but it's the little things that really annoy me. If anyone knows how to bypass this, let me know.4) Answering a call. It's a little tedious. You either have to press a tiny green call button or push the scroll wheel in (if you have bog fingers you could easily accidentally scroll to the \"ignore call\" option and send someone to voicemail by accident. Wish they would have a bigger more obvious button to answer voice calls.Overall though, I'm really pleased with this phone. If it were a little smaller - it would be a 5 star phone. I've never owned a BB so maybe I'm being too easy on RIM, but this is a nice feature packed phone which is perfect for the corporate user from a data/voice perspective.", "Date": "June 18, 2005"}, {"Title": "Perfect!", "Author": "Jerry J. Amaral \"JA\"", "ReviewID": "R2EBOS7SIYW5VB", "Overall": "5.0", "Content": "I have a very unique experience with the Blackberry 7100. For the reason that my first purchase of a PDA-phone was a Treo 650. I used the Treo 650 for exactly one week, and then traded it in for my current Blackberry 7100. The Blackberry 7100 is vastly superior for a few signifigant reasons.The reasons are the smaller size of the Blackberry 7100 is outstanding. The Blackberry's e-mail is much easier to sync with my corporate e-mail (which is the main reason I purchased the Treo 650 in the first place), and the phone quality is simply excellent. The Treo's phone was too large and the volume was insufficient.Lastly, the Blackberry is the easiest full PDA phone you will ever use. The new Blackberry has accomplished what they set out to do from the begining. That is to create a phone with an e-mail , browser, and contact manager, that will take you a few days to become comfortable with, not a month.", "Date": "April 3, 2005"}, {"Title": "All you need in a Blackberry PHONE", "Author": "M. Vivas", "ReviewID": "R3258PAPJGUOS0", "Overall": "4.0", "Content": "After carrying around a pda and a phone, I decided to go for something that included both functions effectively. I had a \"smartphone\" before and though it was small and nice, it was very difficult to type in appointments and data with the tiny keys in it.  The Windows Mobile was pretty good but not what I really wanted. I purchased this phone and immediately saw that I no longer had to bring 2 devices with me.  I have a good function phone with great PDA functions included.  I also set up the phone to receive my personal and my work email. Its good to have all these features in one phone.  The bluetooth works flawlessly and though the phone is a bit on the bulky side, its not very heavy or uncomfortable.  I recommend this phone if you are tired of carrying 2 devices to keep your schedules, tasks and emails.  Really good phone with great features.", "Date": "March 28, 2005"}, {"Title": "Very Fuctional Business Phone", "Author": "T. Massey", "ReviewID": "R1EXHZKL04ZEDF", "Overall": "4.0", "Content": "If your looking for a slick thin phone that has 100 options and gadgets and advertises with the chic crowd...you know someone wearing sunglasses advertising it, then this phone is not for you. If your like me and and you spend 50 hours a week at work a lot of it traveling and you need the basics done well then this is the phone. No it doesn't have a camera and no it doesn't play music. It does do a really good job of \"pushing' ur emails to you, sync's well with your PIM, the phone is definitly the loudest(one of my pet peeves with my other phones was that even all the way up I could barely hear)phone in the earpiece. I 've gotte great reception, the screen is just the right size.  I think the browser works well.  I've not yet had a probelm with battery life. If I had to describe the phone its a work horse for business. The 3rd party software is limited but the only thing I use is a E wallet. I recommend it.", "Date": "June 6, 2005"}, {"Title": "Underwhelmed.", "Author": "sne296 \"sne296\"", "ReviewID": "R1RJ45ABKY4Q9Q", "Overall": "3.0", "Content": "Praise:1.  The new PocketMac software for sync-ing Blackberry to Mac is fantastic.2.  The reception is excellent.3.  Battery life is very robust.4.  Screen resolution is better than average.5.  Menu layout is fairly intuitive and navigation is simple.6.  USB charging capability is handy.Complaints:1.  Mac users, the PocketMac software doesn't come with the phone.  It's available aftermaket only.2.  The trackwheel is undersized and difficult to roll accurately.3.  Because BlackBerry contracts to info-secure government agencies, the bluetooth doesn't support any data transfer whatsoever. Forget using salling clicker or any other fun/useful bluetooth application.4.  The plastic casing is thin and seems inadequately flimsy to house such versatile, rugged software.Summary:  The addition of Mac syncronizing is practical, giving well-designed accessiblity to icalender, address book, and macoffice.  The phone is savy, but the regulated bluetooth capabilities are extremely frustrating.  If you want to have more fun with your phone, check out the Sony Ericsson W600i.", "Date": "December 6, 2005"}, {"Title": "Excellent Edition", "Author": "J. Pfeiffer", "ReviewID": "R26442LIMW8TQ8", "Overall": "4.0", "Content": "I've used, and enjoyed, the normal form-factor BBs, and at upgrade time I was torn between the 8700 and the 7100g.  While the email capabililty is a must, I'd grown tired of talking into what appeared to be a calculator.  Besides the bulky ergonomics, I couldn't get past the idea that my voice just couldn't reach the microphone with the older form-factor (7290, etc...).Choice made, and I couldn't be happier.  This phone is excellent for me.  No coverage problems (not that that's normally a hardware problem, anyway), and no difficulties with the hardware switch from old to new.Pros:1) Screen is phenomenal.  While the 8700 is better, this one is excellent.2) Form-factor is perfect for people who want to treat their BBs as phones.3) Home screen layout is preferred.  Where the older models are a massive grid of oft-unused icons, the 7100's default is to put the moneymakers up front.  You want memos and tasks, head to a sub menu.  You want messages, phone, calendar, and browser - one click's all it takes.4) Browser is getting better, but its still got some maturing to do.5) The backlight is gold.  7290?  Not gold.  Pyrite, even.  This one?  Greatness.  First time I turned it on I was delighted, and that was at the factory default 60% brightness.  I've since turned it down to 50%, but its gold I tell you...6) Dedicated send and end buttons.  So trivial, but so perfect.Cons:1) Sure would love bluetooth file transfer, too.2) Doesn't wash dishes.3) Ringtones are the suck.  Games are the suck.  Perhaps its that I'm on a corporate account, but I get no love from the various ringtone and games download sites.4) The LED, it keeps blinking.  Why, LED, why?!  I have all the secondary notices set to none, and you still blink, LED!  Why?!?!", "Date": "May 23, 2006"}, {"Title": "Great -- if you need a paperweight", "Author": "H. Polley \"slackberry\"", "ReviewID": "R1B43GIAN3DBBE", "Overall": "1.0", "Content": "The phone part works well and coverage is good.  I don't care for the flywheel-based OS, though that is personal taste.  I also don't like the halfway keyboard solution --  not full QWERTY, not standard 12-key.  The autotyping is flawed, editing text messages is difficult, and there is an annoying delay between depressing a button and the response.This is all small potatoes compared to my big problem, however.  Suddenly, after a several months, when I was linking to my computer, I got an error message.  When I rebooted and reconnected, the software DELETED ALL MY CONTACTS AND APPOINTMENTS FROM THE PHONE.  The software would then crash my computer when I tried to start it.  I uninstalled and re-installed the software from the CD more than a dozen times, made other tweaks, and still the software refuses to do other than crash when it begins synching.  Cingular told me to go to Blackberry and I can't find any fix or any way to get through to live customer help.  So my \"cellphone/PDA\" is just a phone that will hold no information, contacts, calendar or anything else requiring synching.  If I wanted to continue using it, I would have to get a separate PDA.  I need a new phone/PDA, so this is a total loss.  Lesson for me: avoid Blackberry products.", "Date": "February 2, 2006"}, {"Title": "Good Device", "Author": "Brian Heckler \"Coach\"", "ReviewID": "R3L36N699IIC1S", "Overall": "4.0", "Content": "I've used the Blackberry 7100g as my company communication device for about 2 months, and overall, it's been pretty good.  It's great for those urgent email messages, but as a phone, it does not rate highly in my opinion.  Unless I'm using the earbud, the parties are hard to hear without the volume being raised to a very high setting.  The reception is suspect, and I've had a few dropped calls in the short period of ownership.  Additionally, I've had to remove the battery and SIM card a couple of times because the unit was not responding.Yes it's functional and handy, but my expectations of this device are higher than what I have experienced to this point.", "Date": "January 16, 2006"}, {"Title": "Stop think twice before buying this phone!", "Author": "JGNIX", "ReviewID": "RNO041JVVU0YY", "Overall": "3.0", "Content": "This phone is a pretty good phone; much more liek a phone than the original Blackberry phones. It is about the same size as the TREO 6xx.Here is what I liked about the phone:1) Push email was really useful. That is when the email automatically gets sent to the phone.2) The scroll bar was cool and easy to use.3) Bluetooth was very easy to set up.4) The browser emulated 4 different browsers; rendering the pages slightly differently but adding functionality with certain emulation.5) Able to read attachments without extra software.6) Fairly inexpensiveHere is what I didn't like:1) Big on the waistline; attached to the belt it was a pain.2) Very little software customization out there. No themes, no 3rd party software that was free.3) Push mail service and data service was expensive.....4) No accessories; i.e. cases; docking stations.5) The syncing was a pain.6) Can't transfer files via bluetooth only the earpiece was available through bluetooth.All in all this phone is above average I liked it, and if there weren't other pim/smartphones out there I would have kept it. Due to its size, cost, and compatibility I found the Audiovox SMT5600 to be a much smarter buy.", "Date": "July 20, 2005"}, {"Title": "blackberry", "Author": "Sommer \"Sommer\"", "ReviewID": "RJWY26AAG1EII", "Overall": "5.0", "Content": "Here is what I liked about the phone:1) Push email was really useful. That is when the email automatically gets sent to the phone.2) The scroll bar was cool and easy to use.3) Bluetooth was very easy to set up.4) The browser emulated 4 different browsers; rendering the pages slightly differently but adding functionality with certain emulation.5) Able to read attachments without extra software.6) Fairly inexpensive", "Date": "November 18, 2005"}, {"Title": "better than expected", "Author": "D. Joseph \"D Joseph\"", "ReviewID": "R1AO502353WGHA", "Overall": "4.0", "Content": "Like the previous customer, It's great for those urgent email messages. However I don't have a problem with the phone component. I love the keypad. I haven't had any problems with the reception. Might be area specific. Dropped calls rarely have anything to do with the phone, but rather the carrier.I have had one problem with the sim card. This was due to the fact that with the blackberry I had to change the sim card so that I would be on the cingular network and not the AT&T; network.I am enjoying the blackberry and I love the fact that I can set it up to turn off and on automatically.I hear the 8700 is better on the web browsing, but I like the sexiness of this phone.", "Date": "March 6, 2006"}, {"Title": "Blackberry 7100", "Author": "J. Rovito \"JRO-96\"", "ReviewID": "R1CBLC5C0WJICT", "Overall": "1.0", "Content": "Reception is horrible... Very hard to hear a conversation unless you have the bluetooth...People never hear me as well so the mic must be bad as well..Switched it 3 times and still the same... Drops calls and very bad reception.Not recommended...", "Date": "May 21, 2006"}, {"Title": "Not to bad", "Author": "Gino", "ReviewID": "R2YMZ30F6B438S", "Overall": "4.0", "Content": "I was originally using a Blackberry 7510 with Nextel Service, which was great, but Nextel service is limited out in remote parts of the country. So made the switch to Cingular and the 7100. The service is available about everywhere in the country. I drove from Florida to Colorado and never lost a signal. However, compared to the Wife's Motorola, the signal strength is not the best. The email system is good, the same as any other Blackberry. The battery life is excellent. The thing that bugs me the most is the ringer selection. There are about 30 different ringers, but they are all weird sounds, No normal ringers to choose from. Only cheezy sound effects. Oh well. It is cool that you can email your self any picture you want and then use it as a desktop on the phone. Overall good deal.", "Date": "December 11, 2005"}, {"Title": "Great (Addictive) for E-Mail, Loust Phone", "Author": "DU", "ReviewID": "RSULOCGWNUZMH", "Overall": "3.0", "Content": "RIM Blackberry has still not quite figured out how to make a cell phone.  Don't get me wrong...The e-mail functionality is incredible.  However, the phone quality is poor -- bad reception, dropped calls and weak design.It is so bad, that I do not think you can use the 7100 as a primary phone in the U.S.I am keeping it for data, but without the monthly voice plan.  I am ordering another phone for voice.Would that it were were not necessary to do so...", "Date": "May 27, 2005"}, {"Title": "No stars for customer service and returns", "Author": "G. Miller", "ReviewID": "RSQLT7NSD584M", "Overall": "1.0", "Content": "Word to the wise! Don't make a miskate because the return policy between Cingular Wireless and Amazon.com is awful. I have been trying to resolve a return for weeks. In the interim, I received a bill ($149.00) from Cingular Wireless for a service I never used on a phone I don't have and never used.", "Date": "May 16, 2005"}, {"Title": "Frustratingly subpar device", "Author": "Sitwat H. Kazmi", "ReviewID": "R21SY9V3NLOQBC", "Overall": "1.0", "Content": "Consistently dropped called, extermely poor reception (in areas where other blackberries work perfectly fine), horrendous ear-and-mouth-piece for both listening and speaking into, flawed flawed flawed performance...I mean I can't even use call waiting without dropping both lines. The half-QWERTY keypad is alright but you might want to go for the full keypad...otherwise it beats the purpose of having a blackberry. Address book maintence is poorer than a standard cell phone. I can't short-cut add a number into my addressbook without copying/pasting the number into my address book explictly. Overall...stay away from this piece of junk, wait a couple of months and shell some money for the Motorola Q (the RazorBerry).", "Date": "March 27, 2006"}, {"Title": "It's so convenient!", "Author": "Donna Reynolds", "ReviewID": "RZFHRAF1GX748", "Overall": "4.0", "Content": "I love having the ability to get all my email forwarded to the blackberry, it's so convenient. And the improved typing system on the 7100 makes it extrememly easy to reply to them all in a snap.  The large color screen is definitely a big improvement over regular phones.  The 7100 offers not only email capability, but also a large Address Book, Task pad, Memo Pad, Picture storage (which you can download from your emails), numberous built in ring tones, SMS (aka text messaging), an easy to use internet browser, games and so much more.  I love my 7100 and would recommend it highly.", "Date": "May 6, 2005"}, {"Title": "Decent email device, not a great phone.", "Author": "Karan Mehta", "ReviewID": "R2PY40WVLGF0IW", "Overall": "3.0", "Content": "The Blackberry 7100g is certainly a novel concept but execution suffers from all the first-attempt flaws one fears.My biggest grouse is the lack of flexibility in the feature set and set-up. It is designed to integrate with your work email system and contacts or calendar manager - ask anything more and you are stuck.- It is frustrating and difficult to do mundane routine tasks if they have not previously integrated with your email suite (Lotus Notes in my case).- If you choose to separate work and play (RIM why is that so hard to contemplate) it gets worse. For instance, you cannot save numbers to the SIM without a host of steps, and once done, it takes 10 seconds to load those numbers every time you access them. The only solution is to save my grand-aunts phone number at work!- The Java browser is inept at best and page loading times make dial up feel state of the art.- The screen kills the top 20% with an annoying static graphic - why use so much of the screen to tell me the time when it could be used to display an email message. Does it really take a consumer clinic or a consultant to tell a designer that?I am tech happy and love playing with buttons, but this is just too much work. The whole Blackberry revolution is uplifting and showcases how technology makes our life so much more efficient, delve deeper and you realize why technology also serves to frustrate and alienate.", "Date": "July 5, 2005"}, {"Title": "Not The Phone From The Picture", "Author": "Sam", "ReviewID": "RP9K2INA59NOS", "Overall": "2.0", "Content": "When I saw this phone on Amazon, I got really exited because it was kinda like a blast-from-the-past for me so, I confidently placed the order thinking i was gonna get the phone that was illustrated. When I opened up the package, I was surprised to see this pretty beat up phone (even though I was promised one in great condition) that looked nothing like the phone from my teen years. The only reason this guy got two stars was because the shipping was fast and got to my house earlier than expected. In conclusion, if you are looking for the phone in the picture I would look somewhere else but, if you are looking for fast shipping this is your guy.", "Date": "September 7, 2012"}, {"Title": "old but sturdy", "Author": "alexyu", "ReviewID": "RUWQJY296GPC", "Overall": "2.0", "Content": "The phone is fine in general. The problem was that a working charger was not provided, cables and headphone/mic was not provided as said as well. The back of the phone was damaged and was not verified before purchasing. I was about to return it but I didn't want to pay for the shipping and the restock fee, therefore only getting back less than half of what I bought it for.", "Date": "August 11, 2010"}, {"Title": "Blackberry 7100G GSM Phone ATT Rogers T-Mobile UNLOCKED", "Author": "I. A. Cerillo", "ReviewID": "R3MXDAISO2WRDX", "Overall": "5.0", "Content": "this phone was great, i tossed and crushed plenty of times and this thing lasted for ever.", "Date": "August 4, 2010"}, {"Title": "Excellent BlackBerry Experience", "Author": "SEOrocks", "ReviewID": "R1TZ2L691CRTDV", "Overall": "5.0", "Content": "I am really impressed with this phone - checking my emails on the move is the best way to deal with my urgent emails. I am currently using vodafone through (airtime manager)and the recepion is great.", "Date": "November 22, 2005"}, {"Title": "Cheap Junk", "Author": "M. Melvin \"AardWurk\"", "ReviewID": "R3GL4ZUMSCYJUV", "Overall": "1.0", "Content": "I am using the Blackberry 7250 through Nextel and need to move to a GSM service for business in Europe.  I got a 7100g and immediately put it back in the box.  I expected it to be different, but it's just a piece of junk compared to the 7200 series.  The case is light and cheap feeling.  The thumbwheel is hard to access and the menu structure is less friendly.  Unlike the 7200's, the 7100 screen turns off with the backlight.  No backlight - no screen.  This has got to be tough on battery life.  The screen has a large title bar across the top that takes-up way to much of the screen.  What's left of the screen is simply too small compared to the 7200.  Back in the box and back to Cingular to get the 7290 with the big screen, great thumbwheel, individual keys and quality feel.", "Date": "July 28, 2005"}], "ProductInfo": {"Price": "$49.99", "Features": "Wireless email\nCorporate data access\nBright, high resolution display\nAdvanced security features\nMake calls in your car using convenient Bluetooth hands-free technology", "Name": "RIM Blackberry 7100G GSM Phone ATT Rogers T-Mobile Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/315020PYMEL.jpg", "ProductID": "B000816Z50"}}