{"Reviews": [{"Title": "Great low-cost PDA", "Author": "James E. Livingston", "ReviewID": "R3KGX28VQW0CVQ", "Overall": "4.0", "Content": "The Palm Treo 650 is a GREAT PDA for it's day.  Newer versions and different brands have more of the \"latest technology\" and smaller size, but it's still a great cell phone and data device.  The free software to sync to Outlook works great too.  Very cost effective compared to other newer brands selling today.If you are buying a used Treo 650, watch out for the earpiece and speaker phone. Many have stopped working, and repairs are expensive.  Look out for whether it's a GSM (uses a SIM card) or CDMA version.  You MUST have the correct one depending on YOUR cell service provider.  Of course, that's true of all Cell Phones!", "Date": "September 25, 2010"}, {"Title": "Palm Still Rules", "Author": "Hobson Lane \"--Hobs\"", "ReviewID": "RJAKKO2DTEPP5", "Overall": "4.0", "Content": "My wife refuses to upgrade to an iPhone or Android and wore out the keyboard on her original Treo. Fortunately for her, the Palm OS is not popular and Verizon and other companies dumped their stock on eBay and Amazon a couple years ago. This replacement Treo, with \"updated\" firmware and hardware is a bit buggier than her original Treo (remember all those lawsuits against Palm hardware manufacturers), but it works well and should last us another 5 years. It has already lasted 2 years living and sailing on a boat in the tropics (moist salty hot air) getting banged around in drawers and purses all the way across the Pacific.", "Date": "August 31, 2011"}, {"Title": "Get what you pay for (if you buy used)", "Author": "Headphone Jack", "ReviewID": "R36XVAHXD414ME", "Overall": "2.0", "Content": "I do not recommend buying this device NEW.Bad:* My device's video recordings have no audio.  Works when you do a factory reset then the installation of Palm's software and sync.* Audio cable hookup to listen to music fails* Audio recordings of any kind frequently fail* Poor reception* Software keyboard is impossible to get to, which makes unusual characters impossible (e.g. the tilda \"~\" or any bracket characters {, [, }, ].* Hard to use, unintuitive, not very drag-and-drop friendly, pretty much not an iPhone in any way shape or form* Can't seem to set the volume of the ringer, seems to keep resetting.Good:* Its a Palm device that works with most Palm stuffThere's a reason its so cheap.", "Date": "June 20, 2010"}, {"Title": "do not buy", "Author": "book shopper", "ReviewID": "RJDFYJC06SXCG", "Overall": "1.0", "Content": "I won't go into technical details but this is the worst phone I've ever had. I would expect more from a \"pda\" but this one has been on my crap list since day 1 of using it!", "Date": "October 15, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Unlocked for use with your existing GSM 850 MHz, GSM 1800 MHz, GSM 900 MHz or GSM 1900 MHz service provider and SIM card.\nFully integrated phone and PDA with digital video and VGA camera capabilities\nIntegrated Bluetooth technology and expansion card slot for SD and MMC-based memory and expansion cards\nVibrant 320 x 320 touchscreen display\nImproved backlit QWERTY keyboard", "Name": "Palm Treo 650 Quad-Band Unlocked GSM Cell Phone with Touch Display, QWERTY Keyboard, and Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41WPl6PgaKL._SY300_.jpg", "ProductID": "B000CDISAE"}}