{"Reviews": [{"Title": "SE answers Nokia by well integrating Style and Function into the W950i", "Author": "Parth Awasthi \"Vestigial Consciousness\"", "ReviewID": "R19H2UM1P5T93W", "Overall": "4.0", "Content": "Targeted simultaneously at several of the competition phones, this one packs in enough to make you like it over several others in its category. I have been using the phone over the last couple of months, and have been deliberately taken my time to post this review but still I haven't found too many glitches. Previous to this one I was using an i-Mate SP3i; another smart phone, which wasn't really one. Well, SE W950i is a smart phone and it lives up to it.A Very Simple and Neat UI is what is strikes you first. The Screen is crisp and reponds well. The Stylus that accompanies it may take a while getting used to, more-so if you are used to longer styluses but once you get used to it, it's pretty comfortable. There are three parallel ways to use the phone - the three way Scroll Wheel (which I personally LOVE and find the best), a touch screen and the keyboard. The Handwriting recognition may take some time getting used to, but once you are through it works well. Dedicated buttons for all your walkman features are also an add on to simplify life. The instrument itself is not bulky at all; weighs decent and measures much thinner than the positively Obese Nokia N-Series offerings.The OS manages multi tasking much better than Windows Mobile, since it kills the LRU process (sometimes even all the processes, sadly) when overloaded, but prevents itself from crashing. Although I must say that once this one hangs (pretty rare; i've faced it twice in 3 months), even the power button wouldn't turn it off; you'll have to disconnect and reconnect the battery. Task Switching is way smoother than Windows Mobile and even the previous Symbian Releases. This is notable specially when receiving a call while listening to music. The call engages and disengages very smoothly.Music; the prime reason for me loving this phone. The response times of the internal memory are decent and the playback is phenomenal. The earphones that ship with it are way better than those that ship with an iPod. Thoughtfulness of their design team is clear when you see the charger which allows you to connect the headset even while charging - at the same port. The headphones have a standard audio jack which means you can use any headset with it, but unlike the other phones with Audio Jacks, this one has it on the Handsfree set, instead of the phone - use your headset and still answer call with the same one by using your handsfree mic. The Walkman remote could've used a few more functions (like a radio button and press-forward on the Next button) but it is functional and handy. The Music Player itself is not only good in L&F;, it also performs well. Beware though; it won't play any distorted MP3s. (Those songs you ripped off your scratched Disc, which your PC plays with slight 'klik-klik'? Yeah, they are no good on this phone.) The Video Quality is about the same as the iPod. While one can never fit his entire collection onto the 4GB (I can't even on an 80 GB iPod), nevertheless you CAN fit your active library into 4GB and it's fairly easy to sync as need be. (If you can't wait for the 8GB w960i)At this price tag, most people are looking for a do-it-all phone, which unfortunately this one isn't, cause it lacks a camera. Understandably, while Nokia has chosen to go the integrate-all-devices-into-a-phone way; SE is going a way I understand more - user profile specific phones. So this one here is targeted at the user who is looking for a rich music phone with Business capabilities to add to it. Please note that this isn't a business phone with a music capabilities like the offerings of O2, HP, Palm etc. However, the phone by no means compromises on the features provided. It integrates well with all possible applications you use for your work; Outlook (even 2007) can be easily configured too; Word Processing Applications can be added. If one accepts that he ain't possibly going to make his Cellphone a replacement for his Laptop and Broadband connectivity; you wouldn't really miss Wi-Fi. For all your on the fly work, this one suits just fine. Quite a few useful applications pre-configured with your phone Like RSS Reader and Play Now, come into handy use.With all of the above, one expects Battery life to pretty much disappoint; here's where SE show their true power. I've personally used the Phone to play 14 hours of music (with All Phone features turned on); Read a few RSS feeds, made about an hour of calls and still not run out of battery! The battery charges very fast and gives you atleast a day's worth of playback and phone usage (even if you are always doing one of the two). Forget about running out of power. Period.Set your priorities right - If Music tops them, this phone is for you; If it doesn't, look elsewhere.", "Date": "June 25, 2007"}, {"Title": "Horrible experience", "Author": "P. Bapat \"PB\"", "ReviewID": "R1AOYWVTWNV8FF", "Overall": "3.0", "Content": "Bought the phone from Amazon, but had to send it for repairs to Sony Ericsson. They asked me to submit a proof of purchase- an invoice with the phone IMEI number (its like a serial number). Called amazon but was told that they don't open the box so they don't know.Sony said its a great market phone- so sorry NO WARRANTY without the receipt, the IMEI on receipt should match with the one on the back of the phone!So basically if you buy this phone and get into problems with it- NO ONE IS GOING TO HELP YOU AND YOU JUST THREW YOUR MONEY AWAY.Please think twice before buying friends!!", "Date": "July 31, 2007"}, {"Title": "The Phone keeps Hanging", "Author": "S. Zaidi \"Far Zee\"", "ReviewID": "R3QQE0BDAZVA9J", "Overall": "2.0", "Content": "I initially liked this phone with the touch screen, it is pretty stylistic. However, there seems to be a software bug in it, as it kept hanging once in a while. Normally, it happens when I press a wrong menu option and try to go back too quickly but it seems to happen even without a cause at times and sometimes I do not realize it has hanged, while just lying in its cover and later my friends complain that they've been trying to call me without getting any response from me.I would not recommend this phone and would hope that Sony Ericsson, improve their Quality control a bit more and do comprehensive testing before launching such expensive products.", "Date": "June 26, 2007"}, {"Title": "SE W9501", "Author": "Pablo Bonilla \"Pablo\"", "ReviewID": "R24MY5LHQXOU6K", "Overall": "5.0", "Content": "I received the phone in pristine condition. Works perfectly, all package items included. Delivery was very fast.", "Date": "February 22, 2007"}], "ProductInfo": {"Price": "$399.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nTri-band GSM 900/1800/1900 cell phone with International 3G compatibility (2100 UMTS) and GPRS data capabilities\n2.6-inch touchscreen; 4 GB of onboard storage for videos, music, and pictures; digital audio player with FM radio\nBluetooth for handfree communication and stereo music streaming; access to personal email; web browser with RSS feeds\nUp to 7.5 hours of talk time, up to 340 hours (14+ days) of standby time", "Name": "Sony Ericsson W950i 4 GB Unlocked Cell Phone with International 3G, MP3/Video Player--International Version with No Warranty (Mystic Purple)", "ImgURL": "http://ecx.images-amazon.com/images/I/31B1KBHG1FL._SX300_.jpg", "ProductID": "B000LDNKCG"}}