{"Reviews": [{"Title": "Great Phone!", "Author": "etc", "ReviewID": "R3A4FDYSB4SZ3L", "Overall": "5.0", "Content": "I found the previous review by \"tj\" very inaccurate, so I decided to write my own.I've had this phone for over a month, and I LOVE IT!!I don't talk much on the phone, but I listen to music, watch video, take pictures, and send text msg with it a lot. I charge my phone maybe every three days. I think the battery last a very reasonable amount of time for the way I use it.The keypad might take awhile to get used to, but I am a keyboard person and I really love the QWERTY keypad. I can type pretty fast with this keypad (I used to think sending text msg was a pain because of the ABC keypad).I don't understand what the previous reviewer meant by \"cannot download the pictures in a format that you could browse on your computer.\" The pictures are in standard format: .Jpeg. Of course it's readable on the computer. The video taken with this phone is in .3GP format. You can just google search K-lite mega codec and download the codec pack. Then you can play the video you take on PC. And the codec pack is free! Or if you think installing codec is too much, you can just download Quicktime. It's also free.When you buy the phone, there is everything you need inside the box, including menu and CD software.On the home screen, there are 15 shortcut spaces for you to put some \"hard to locate\" applications. For internet browser, I recommend Opera. It's way better than the one came with the phone. When I use internet, I always go to the connection (top left corner) to make sure I am connected to a wifi connection. So I never have a problem with it.The previous reviewer mentioned that his/her phone froze a lot. I think he/she just got a bad phone. My phone has only frozen once for this one and a half month. Compare to M600i, P1i is really tons faster and responsive. Everything is just so smooth.I love this phone because it's basically a small PDA with phone function. I can make to-do list. I can read pdf, doc, ppt, etc files. I can watch movies and videos on it. I can listen to music on it. I can use Skype. I can use messengers. For the music player, you can minimize it. So you can actually do something else on the phone while listening to music. There are pretty useful symbian and uiq softwares you can install onto the phone. The most I use is AED (advanced english dictionary). You can also download/buy game console emulator and play old games on the phone! Like GBA, NES, etc.I also bought a bluetooth receiver for my computer. So that I can connect the phone with the computer through BT, and it is VERY convenient. I can transfer all my files and photos within seconds. I do use card reader to transfer big files like videos since BT is not a fast way to do it.Now Sandisk makes 8gb M2 card and this phone supports it!There is only one thing to complain: I still can't get the PC Suite to work... But I can live without it.In a nutshell, P1i is a great phone. I don't think I will need to buy a new phone within the next three years :D", "Date": "December 1, 2007"}, {"Title": "Awesome", "Author": "Rodrigo Mejia Munguia \"Rodrigo M.\"", "ReviewID": "R1CZ26ZWALQVTL", "Overall": "5.0", "Content": "I had had all the sony ericsson P series, and this have been the most ewesome phone I ever had, it's amazing all the options you can have with this gadget.", "Date": "May 4, 2008"}, {"Title": "This is a lovely Item, Strongly Recommended", "Author": "Felix Mejia \"Félix David\"", "ReviewID": "R3FPNUXG8BFA2A", "Overall": "5.0", "Content": "Well, I find this phone is the best gadget I've ever bought. It comprises all the functions of my old Palm TX, and my W600 cell phone in just one item, but with more power, and I don't have to carry PDA and phone anymore !!! The only thing I don't like is that the screen is smaller than the TX's, but it is pretty readable. Battery life is  more than 48 hours with sporadic internet access (via WiFi and cell connection) and with frequent BT sync'ing with my laptop. The SE Desktop Suite for SmartPhones works perfectly, pictures from the 3.2MP camera are very good when shot with good enough light conditions, I access GMail and my corporate email server from the built in messaging application, manage multimedia, images, video, and sound (the built in recorder is awesome).The phone also gets the TrackID application, where you can record a clip from a song (approx 10 secs) and then the app connects to the internet and sends the clip and you get in return the name of the song, the artist and album. Pretty nice feature.On the first weeks I had it, it was freezing like once a week, typically when using the camera at the same time as I was using the BT interface. Then I decided to take the phone to my cell phone company, and they replaced firmware. The phone has never crashed again.Buy it with your eyes closed.", "Date": "March 6, 2008"}, {"Title": "fantastic phone", "Author": "Kojo", "ReviewID": "R2M1REDJ30X3DD", "Overall": "5.0", "Content": "An excellent phone. This is my third time purchasing this phone. Always had one in the past six years. Fantastic phone.", "Date": "June 9, 2012"}, {"Title": "Best Phone I have ever owned", "Author": "Vidit Bhargava", "ReviewID": "R1L29HMJN44IVJ", "Overall": "5.0", "Content": "I have owned this phone for over a year now and know it in and out. This is the best phone I have used so far. SE put together a lot of good things in this upgrade to the M600.This phone is intended for the business users who want to have fun once in a while with full set of multimedia features.PROS:1. Shape, Size, Form - This is a very well constructed phone with solid feel. The front has brushed aluminum along the border. The battery cover has a velvet texture which feels nice. This is not a big or small phone. Its perfect in shape and size, just a little thick (0.7\"). It isn't too heavy either and feels solid. Taking into account that it has a QWERTY keyboard, its very compact compared to other QWERTY phones.2. Full Touchscreen - The screen of this phone is gorgeous. It has bright and vibrant colors. Photos, videos, fonts are crisp and clear.3. QWERTY keyboard - The 'rocker' style keys on this phone are amazing. It takes a little to get used to but once you're at it...its great to type on.4. UIQ 3 - The OS on this smartphone is UIQ 3 which is very simple and easy to use. Yeah, it crashes but not that much. The user interface is intuitive and slick. There are tons of applications (both free and paid) for the platform.5. Wifi - This phone supports wifi 'b'. It supports several security standards which are easy to use and configure.6. RAM - It has 128mb on board RAm which might be less compared to what other smartphones have these days but it is sufficient for this puppy. You can have many applications open at a time and running simultaneously in the background. It supports multi-tasking as well.7. Camera - It has 2 cameras. The major one is a 3.2mp camera with auto focus and flash. It takes superb pictures with great clarity. It supports video as well. It has a dedicated camera key as well. The secondary camera is a VGA camera used mainly for video conferencing.8. Speakerphone - The speakerphone on this is loud and clear.9. Battery Life - I disagree with reviewers who say that this phone has pathetic battery life. (After over a year of rigorous use) I do not have to charge it for at least 2 days with normal calls and internet usage over wifi.10. Internet Browser - This comes with Opera Mobile 8.65 browser out of the box which gives full html browsing experience (sans flash). A new version of Opera Mobile (9.5 beta) makes browsing much better and is amazing as it has widget support as well. I even run widgets on my phone built for Opera's desktop browser. There are several other browsers available for free too.11. Youtube Support - It plays youtube videos out of the box. Clarity is good not stellar and sound quality is amazing (dependent upon youtube quality as well)12. Bluetooth - It supports full stereo bluetooth with A2DP and AVRCP profiles. You can transfer files (any kind) and sync over bluetooth to other devices as well.13. Email - It has full email support with Microsoft Exchange and Blackberry support built-in. You can download attachments and attach files to emails to send them easily.14. Business Users - It has full support for VPN, Blackberry features and Microsoft Exchange capabilities built-in. These work flawlessly.15. Multimedia - It supports several audio and video formats and also has fm tuner built-in.16. Memory - 160mb on board memory and an expansion slot which supports up to 8gb of memory stick m2 card. Enough for normal use.CONS:1. No 3G Support in USA - This phone is built for Europe and functions completely in Europe.2. Triband GSM.3. Wifi 'g' - No support for 54mbps wifi.4. Support - Weak support from SE. They stopped bringing out new firmwares.5. Non-flush Touchscreen - The screen could be flush with the outer cover for easier functionality.6. UIQ 3 - I am listing this under 'Cons' as well as the platform is dying. There are very few developers working on this technology now to bring out innovative applications.", "Date": "July 3, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Sony Ericsson P1i Silver/Black (unlocked)", "ImgURL": "http://ecx.images-amazon.com/images/I/21MRq2IR1xL.jpg", "ProductID": "B000UU4M68"}}