{"Reviews": [{"Title": "Not a new phone", "Author": "Sean C.", "ReviewID": "R370UU2DAYESX", "Overall": "1.0", "Content": "The Motorola box label says \"NEW\" but it isn't.  Horrible product.  This phone is not new and the attempt at refurbishing is horrible.  Glue is visible around some buttons and the fit is sloppy.", "Date": "May 6, 2012"}, {"Title": "it's not a new phone", "Author": "hahaking", "ReviewID": "R14I53K7X3AOXS", "Overall": "1.0", "Content": "it's not a new phoneI have never had such a poor shopping experience, description of goods which are new, but what does refurbished. And workmanship is very rough. Junction do not fit, a prominent 1-2mm. The battery cover can not close completely. Too bad!", "Date": "May 4, 2012"}, {"Title": "Faulty battery", "Author": "L. DeBarbieris", "ReviewID": "R3NADTKKGJM0Y9", "Overall": "1.0", "Content": "Got the phone yesterday and it was a nice looking phone. Exactly what i wanted. Heres the but.... The battery was warped. Very noticeably warped. Almost ready to explode. I threw it back in the box as quickly as i could, sealed it back and now i have to return it which will probably be such a hassle. I guess i could just purchase another battery to keep from having to go thru that headache. Motorola is really at fault though.", "Date": "April 17, 2012"}, {"Title": "horrible", "Author": "malsvig", "ReviewID": "R2ZA3CLP5I6BCX", "Overall": "1.0", "Content": "I needed a phone to replace the razor I had because I'm keeping the same basic, slow (2g), phone only service I had before. Received as expected. I just transferred the sim chip. Just make sure your service is the same or similar to the original carrier for the phone. About 2 weeks after getting the phone it started rapid cycling on the phone volume. Couldn't hear the phone! Opened the phone up, a thin copper ring supposed to be around the camera eye was stuck on the lower back part inside the phone, I believe this has a shortng effect on the phone. Had another of same phone  has a thin metal antennae bar across bottom inside of hone and saw shorting marks there after it died. Suspect keypad faults also for continuous press of keypad repeatedly accessing  phone volume. Buy carefully after review suppliers feedback. I did get a red one from don't recall vendor that worked good..", "Date": "July 29, 2013"}, {"Title": "love it", "Author": "samuel", "ReviewID": "R25ZFIUHY5EAEH", "Overall": "5.0", "Content": "i using like iha all over with calls all over the world; i love how it will last not smart phone those break easy and they are expensive and never have have an 1 year warranty ever", "Date": "July 22, 2013"}, {"Title": "Have battery charging issue", "Author": "Rajeeva Gupta", "ReviewID": "R1UGZEMS7GW00O", "Overall": "1.0", "Content": "The battery is not charging. I have put in a new battery too and it still did not charge and makes me believe phone is defective.", "Date": "May 17, 2012"}, {"Title": "required", "Author": "Amanda", "ReviewID": "RC6CW7UMK088Z", "Overall": "5.0", "Content": "My grandmother just loves it it the first phone she had and wouldn't stop complaining until i found her one.", "Date": "March 3, 2013"}, {"Title": "Good Basic Phone", "Author": "Stephan", "ReviewID": "R3012RJU0XK0BZ", "Overall": "5.0", "Content": "My son goes thru phones like you can't imagine. This was cheap and it works just fine for my son.", "Date": "February 13, 2013"}, {"Title": "Motorola RAZR V3 GSM", "Author": "MELBA I. KING", "ReviewID": "R3FDS1CPE8TYDJ", "Overall": "1.0", "Content": "Phone did not last but few days, quit working and no known product guarantee.  Very disappointed with product; purchase of 'new' batteries were obviously old also.  Very bad buys.", "Date": "January 21, 2014"}, {"Title": "motorola RAZT V#", "Author": "WAIL ISSA", "ReviewID": "R3VHNT782CZ4IF", "Overall": "3.0", "Content": "I had this telphone before and i liked it because it was very thin. that was't the case with the new one.", "Date": "February 24, 2013"}, {"Title": "Motorola Razr v3", "Author": "Theresa P.", "ReviewID": "R1JQ662I8KDPTR", "Overall": "2.0", "Content": "Was said to be in very good condition,phone was dented on back color in areas rubbed off screen scratched the numbers have wear areas.The phone even when charged will not stay on.  Not happy with this phone. The picture looks nice but when in hand not so nice.", "Date": "July 11, 2013"}, {"Title": "It is not as the picture", "Author": "Ngan", "ReviewID": "R3MQRIJRKXVMC5", "Overall": "1.0", "Content": "The phone o got look too old , not as what I expect , it doesnt  like the picture, sometime it is not ring when the call come,I am hopeless to buy it", "Date": "April 27, 2013"}, {"Title": "Unlocked", "Author": "Taylor", "ReviewID": "R1MXNDRB5HT105", "Overall": "1.0", "Content": "It seems I was wrong. I thought \"unlocked\" means I can use it with any carrier. I took it down to the Verizon store and they told me NO, this phone would not work on their system. So I ended up buying one of theirs. The warranty stated pretty clearly that if there was nothing wrong with the phone I own it. The website should list the carriers each phone works on.", "Date": "July 8, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Unlocked for use with your existing GSM 850 MHz, GSM 1800 MHz, GSM 900 MHz or GSM 1900 MHz service\nIntegrated VGA camera with 4x zoom\n22kHz polyphonic speaker with MP3 ringer support\nMPEG4 video Playback\nIntegrated Class 1 Bluetooth® wireless technology stays in touch up to an amazing 100 metres", "Name": "Motorola RAZR V3 Gold GSM Cell Phone (Unlocked)", "ImgURL": "http://ecx.images-amazon.com/images/I/419DQ%2BYehBL._SY300_.jpg", "ProductID": "B000K6CN9K"}}