{"Reviews": [{"Title": "A Perfect Grandma Phone!", "Author": "Darla", "ReviewID": "R2YGY5U8W8TCS2", "Overall": "5.0", "Content": "Too bad Nokia didn't stay with this formula for a non-web type of phone. I could care less about getting email or searching the web on my phone, nor do I want to scrunch my fingers into a qwerty keyboard. Just give me a simple phone with just a regular phone keyboard, and really long battery life. That's the Nokia 6030. Happily without a camera to eat up power. I've carried one for several years, and have bought a couple for backups since ATT no longer wants to offer something so easy and cheap to use. Buy this wonderful little phone that you can talk on forever, charge up only once a week. You'll love it, and be able to thumb your nose at the people paying $100 and more per month for smart phones that rob all their free time and attention.  Live your life. Don't let your phone live it for you. Revolt, I say!NOKIA 6030 FAN CLUB.", "Date": "March 20, 2010"}, {"Title": "Amazing", "Author": "graphicgrapes", "ReviewID": "REND0NQSZIHLM", "Overall": "4.0", "Content": "I'm rough on phones, really clumsy. This model has good basic features and hasn't let me down yet (even if I'd dropped it a dozen or so times)", "Date": "March 26, 2011"}, {"Title": "Nokia cell phone", "Author": "Mona", "ReviewID": "RQIBOEBRQ6NTZ", "Overall": "4.0", "Content": "The phone I purchased was exactly as described and in excellent condition.this is the first time I have purchased or usrd Amazon.com", "Date": "October 11, 2013"}, {"Title": "Good Basic Phone", "Author": "Just_thinking_out_loud", "ReviewID": "R3SLL8AFTSC0KF", "Overall": "3.0", "Content": "I bought this phone, because I needed some kind of cell phone that I could use to call or text. Well, that's about all it does. It's a good basic phone. It does the job.  [Note: I did not have this phone very long, because I had bought it used and had to return it because it would not recharge.]If you're looking for a phone with lots of memory where you can put your pictures and music on it... this is not the phone for you. It has about 3 MB of memory. (The average size for an mp3 song is about 3.5 MB.) There is no memory card, nor is there a place to add one.Features:-Calling (You can hear the caller, the caller can hear you.)-Texting (You can not receive messages with sound or pictures containing too much space.)-Alarm clock (It works.)-IM (Don't know how well this works, didn't use it.)-Radio (Don't know about this either. It didn't come with earphones.)-To-do list-Notes-Calculator-Stopwatch-Countdown Timer-Games (Mine came with some small games on it; however, I could not adjust the sound on them at all. So, I didn't bother playing them, because they were just too loud. (My sister tried one of them when she was outside. I could hear it from inside clearly, even though the windows and door were shut.))Overall, if you just want to call or text, this phone will do the job. If your looking something a little more useful or with more features, this is not the phone for you.", "Date": "February 19, 2013"}, {"Title": "Nokia Phone 6030 T Mobile", "Author": "Rosalyn Byrd \"shopaholic\"", "ReviewID": "R3J1KYJHQU9TT", "Overall": "3.0", "Content": "I got my phone in a week after ordering, it was in good condition, but it did not come with an instruction booklet, SIM card or charger. I went to my local T Mobile office to check out the phone before keeping the purchase, they said it was in working condition and was in good shape as a replacement phone.  I am still having issues in setting up the phone with all the features is comes with. The alarm feature does not always work and I does not always ring when a phone call is coming in.  I liked my phone which was pickpocketed on Mother's day not this replacement.", "Date": "June 20, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Network: GSM 900 / GSM 1800; Display Type: CSTN, 65K colors 128x 128 pixels\nSMS, MMS, WAP 2.0/xHTML, FM radio\nGPRS: Class 6 (3+1/2+2 slots), 24 - 36 kbps; Type: Polyphonic (16 channels)\nPhonebook: 250 x 10 fields; Call records: 20 dialed, 20 received, 20 missed calls ; Stand-by: Up to 300h; Talk time: Up to 3 h", "Name": "Nokia 6030 T-Mobile", "ImgURL": "http://ecx.images-amazon.com/images/I/511B4-DtDjL._SY300_.jpg", "ProductID": "B000V97N96"}}