{"Reviews": [{"Title": "Nice prepaid service", "Author": "yqtrac@gmail.com", "ReviewID": "RI381AOHYLYCS", "Overall": "4.0", "Content": "I have been using tracfone for seven months and I am satisfied with it. I have light cell phone usage and it costs me less than 15 dollars a month. The signal is good, no matter in the city of Boston or in the countryside of PA. I have not dealt with their custom service though. Tracfone has a promotion of 120 free minutes if you get an invitation from other users before you activate it. Let me know if you need one. I will send you an invitation instantly. And I can help you even if you have already activated it recently.", "Date": "July 27, 2006"}, {"Title": "Good basic phone", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R3IYKFPMD2K4CI", "Overall": "5.0", "Content": "The C139 is the cheapest model in Tracfone's lineup.  It's a very good basic phone that gives you good voice clarity and easy text messaging.  Because Tracfone doesn't have a lot of services to offer (which isn't a bad thing for people who only want basic cellular service), this phone doesn't give you music downloads or live TV (which on other carriers are mostly misleading hype anyway).  The color screen is small but good-quality.  The only thing I don't like is Tracfone's 60-day refill polic: you must refill every 60 days to keep your account active; otherwise you forfeit your number and balance.  Other prepaid providers like Speak Out Wireless (from 7-Eleven) give you one full year of usage.", "Date": "August 9, 2006"}, {"Title": "Pick another TracFone reciever", "Author": "K. Perry \"Nearly Native Texan\"", "ReviewID": "R1V1WKVOSN5H9F", "Overall": "1.0", "Content": "This review is for the phone unit itself - Not the TracFone service.Folks, stay away from this phone.  I liked it a lot for the first 60 days, then it 'died' and lost my call information, my minutes and everything else.  TracFone says that they are having big problems with the C139.  They're sending me another one, but that doesn't make me comfortable.  What happens when it dies?Meanwhile, I'm without a phone for over a week now.Save yourself some headaches.  Pick another phone.", "Date": "August 23, 2006"}, {"Title": "Back to Basic Calling", "Author": "M. R. Simmons \"Techie\"", "ReviewID": "R25WNIECFCJLZD", "Overall": "2.0", "Content": "I needed to buy my mother a new cell phone so I could cancel my account with my existing provider and still keep the same number. I was a Tracfone user a few years ago while I was in college, and I found their services to be good. I went to the store and saw this phone priced very low; not so long ago you had to pay $70 for a Tracfone, and now they have them for less than $20. I decided that since she wasn't going to use the cell phone very much, this would be a good way to go until I could find something else.I bought this phone because it was cheap, and I could get it activated right away. This phone is very basic; most of the features that are now common place are missing on this model. The screen is microscopic; it can only display a few lines at a time. There are no polyphonic ringtones, and it can only hold 100 entries in the phonebook. They keys are so firm that they are hard to press down, and the menus are tedious and somewhat counter-intuitive. It is very sturdy, but also a little heavier than should be for a phone its size. There is no web browsing like there is on other phones. The text messaging feature is really tricky to use. I think Tracfone has good service, but in many ways, this phone feels like a step back from where Tracfone was going to.I have noticed that Tracfone has moved away from using the CDMA network and towards using the GSM network. I don't think that is bad, it just means slightly less coverage overall. Tracfone's service is not bad. I think this phone is a decent choice for someone who is wanting a very basic phone to talk on. It is less than $20, so I can't complain too much. However, if there is any way that you can afford it, I suggest if you are going to use Tracfone's service, go with a pricier phone with more features.", "Date": "December 30, 2007"}, {"Title": "Phone is OK, but cutomer service is frustrating.", "Author": "Dan", "ReviewID": "RFH3HK8UITRKY", "Overall": "2.0", "Content": "I too had one of the older model phones, and after letting the battery drain to zero I lost everything, including phone number and service minutes.  Tracfone did acknowledge problems with the firmware of the older phone, and they sent me a new one with a postage paid mailer to send back the bad one.  They also gave me 60 bonus minutes of airtime to replace what I lost when the phone lost its mind.Although they did everything right, the customer service is very, very frustrating.  The people read from scripts word for word like robots, which will get you to the ultimate goal of your call but it personally makes me crazy.Technically (and coverage wise) the phone works well, and the price is certainly right.  After several months of buying air time cards, I signed up for a $9.99 a month plan that gives me 50 minutes each month automatically.  That is plenty enough time for a very casual cell phone user such as myself, and is way cheaper than any subscription plan I could find.", "Date": "December 8, 2007"}, {"Title": "Can't believe i waisted $15 on this...", "Author": "Craig A. Jope \"Craig Jope\"", "ReviewID": "R1LZ3WIRC07J4R", "Overall": "1.0", "Content": "I got 200 tracfone minutes from my sister this past christmas. I went out and picked up a phone, seeing as it was only $15 anyway. When i turned on the phone i got an 'insert sim' message. i went through troubleshooting and did everything it told me to. i then called and after a few robots, talked to someone. they told me it was normal and would work by tomorrow. he set up my account and put in my minutes while i was talking to him. days went by and still nothing. i called again and they forced troubleshooting on me. i couldnt get one answer out of anyone so i talked to a supervisor and they sent me a new sim card. now i have this new sim card but all my info is on my old one. i talked to someone for about an hour, putting in codes that accomplished nothing. they told me i had to wait 2 weeks so they could file an investigation on my case. i needed to talk to a supervisor to add minutes to my phone and the entire time i was treated like a liar and called ma'am every 2 sentences despite my obvious deep voice. the entire process of being able to have a quick and affordable phone took over a month. overall their service is terrible, and  their product hardly works. my mother also has one and i tried to set up her account online but it wouldnt go through. i needed to call and put in a handful of codes again. after all this trouble I can only make outgoing calls. I was able to get a call earlier today... but when i called it half an hour ago and when my friend called me the other night, there was a message saying i'm not taking calls.  also, if you ever want to set up a voicemail or anything on your phone, you have to use YOUR minutes. you cant use a LAN line or anything. thats a long time with the elaborate \"you're probably a moron so let me slow it down for you\" instructions they give for setting up a voicemail. I set mine up and the voice went on about different features of the phone, trying to drag out your minutes so you can go buy some more. and if you decide to buy this phone you'll most likely be put on hold while you see what the problem with your phone is and you'll hear them actually say \"with tracfone, you really do get what you pay for\" in between the holding music. I recommend this product to anyone who has done me wrong. go get virgin mobile if you want a cheap, reliable and easy to use phone. my girlfriend sets all her information online and everything works the way its supposed to.", "Date": "January 31, 2008"}, {"Title": "Fantastic Phone - Don't understand the poor reviews", "Author": "Mrs. Night Owl", "ReviewID": "R8G86IJGC7IU0", "Overall": "5.0", "Content": "I bought this phone because I was sick of Sprint's contracts. It has been great for the following reasons:- cheap ($13)- superb coverage: I travel coast to coast and even get service in the backwoods of rural Alabama (Costa Rica too)- battery lasts and lasts (and lasts)- easy to useAll I wanted was a phone that worked.  After previously owning the $700 mini-computer type phone I was ready to kick 'em all to the curb but this has been great.  If you're tired of the high charges and contract hassles, give this a try.  I spent $100 on 1200 minutes and a year's worth of service.The only caveat to this service is that you get dinged for an entire minute even if you only used 2 seconds of it.  But with all the other good stuff that it does have, that little detail doesn't bother me a bit!", "Date": "July 29, 2008"}, {"Title": "review.", "Author": "aaa", "ReviewID": "R3FV3SBQJX3RJC", "Overall": "5.0", "Content": "My tracfone has worked out good so far. Customer service is fine and the free voicemail was easy to set up and use. If you decide to get a tracfone, please email me for a quick referral before activating it- we each will get 120 free minutes from the 'refer a friend' program. I'll also send you the simple instructions to follow. I've used Tracfone for quite a while, so i should be able to answer any questions you might have.ps even if you have activated in the last few weeks i should be able to get us the free minutes.", "Date": "September 4, 2006"}, {"Title": "Big step up!", "Author": "Gloria S Barut", "ReviewID": "R3H28PB07N174Z", "Overall": "5.0", "Content": "I've been a Tracfone customer for about 8 years.  I have two very old phones plus the Nokia I just used for 6 years or so.  It still works well, too!The phone I had before this C-139 was a small Nokia.  It worked well but kept turning on and dialing numbers, while hanging freely in a pouch inside my purses.  This one does not.I like Tracfone because I can buy time for a year and a double minute card and I'm good to go!  My account & tel # stays the same for a year.  And I don't have a monthly bill or a phone growing out of my ear!  Yes, I do not appreciate those (idiots) who yack on the phone while they try to pay attention to their driving, discipline kids,...all the while; turning corners and drinking take-out coffee.  The possibility of them hitting my car while they're arguing with someone or reviewing last night's date scares the hell out of me!This Motorola has been out for a while but I just got it.  It's great!  The color background is much nicer and clearer than the Nokia (mono color and limited light.)They are about the same size.  The Nokia is a little slimmer, but heavier than the Motorola.  The Motorola has grips on the sides and has a gr8 feel in my hands.  It is Bluetooth compatible and the options are more sophisticated and plentiful than the Nokia.  I feel like I went from Bedrock to the 1990's.I know there are better phones out there (without a service plan)...maybe next year we'll get camera phones with newer features that aren't even out yet!  But for now, they do the trick...calling AAA when one of the cars break down.", "Date": "November 14, 2007"}, {"Title": "Better than expected!", "Author": "Luigi", "ReviewID": "R1OK22DZ2GOCPH", "Overall": "5.0", "Content": "After reading the bad reviews, I reluctantly bought one of these phones, however for only $10 I decided to give it a shot anyway. I read the start-up instructions (very clear step by step with pictures) and did accordingly. I activated the phone using the tracfone website and I have to say that it was easy and fairly quick. The phone was activated in literally minutes and it has been working beautifully ever since. The phone itself is a good quality piece of hardware for the money and it has a bright and colorful screen and backlighting. Signal strength has been excellent (3-5 bars) just about everywhere I have been so far. The phone sounds loud and clear and it has more features than I expected. The airtime cards have been working smoothly and the minutes+expiration date rollover everytime you redeem minutes. I have not dealt with their customer service, but if anything goes wrong I can always buy another one for $10 and reactivate the number. Tips to keep cost to a minimum: buy the double minute card before any other cards. Do not setup your voicemail option, you will know the number of the person that has called without losing minutes or if you set it up, check the messages using a different phone, it does not take away any minutes that way (call your number, wait for it to go to voicemail, press star and then your pin number and you are in). Buy airtime cards at any major retailer, pharmacy, 711s and supermarkets, it is easier than doing it online and less aggravating. Do not give out the number to everyone, it can run into real money if used too much, this phone is meant for sporadic and emergency use only. Also, when you register online all you need is the long string of numbers that comes on a card within the package, your email address, your zip code and the zip code of the area where you will be using it most. All other info they request (name, home number, birth date) is not required and you can even skip it or lie about it. The only complaint goes to the ringtones, they are very 80ish style, very cheesy. Also there is no speakerphone built-in. Overall: VERY GOOD!", "Date": "June 30, 2009"}, {"Title": "Cell service for around $7.00 a month!", "Author": "Jennie", "ReviewID": "R4OHDRRZLS7GA", "Overall": "5.0", "Content": "This was a great little phone (more detailed review in the next paragraph), I say was because I am a bit of a Tracfone new model junkie and tend to purchase their latest and greatest (in the last year I have been through the W376g, the V170, the V176.  I am mainly writing this because Tracfone is an HONEST company and will NOT steal your identity as previously noted by another reviewer who I think is rather disgruntled with Tracfone.  Because I have been a customer for at least 8 if not more years and have dealt with their customer service more times than I can count.  They never ask for your social security number...NEVER!  I actually miss this phone which I used for about a year...yes, it's basic, no bells and whistles phone, but the reception is great.  It is a tad slow to start up, but I keep my phone on all the time so that wasn't too much of a bother.  Great signal reception!  It is nearly impossible to get reception in our local WalMart, however, this little phone never had a problem.  Employees used to ask what kind of phone it was because their own fancy schmancy phones wouldn't work.  My current Tracfone (an LG225) does not get reception their either.  So that makes me want to dig out my c139 and reactivate it...It also never dropped a call and back then I was on the cell a bit more than I am now.  It's solid, durable and the battery time is awesome.  My heading does say I pay around $7.00 a month for my phone.  I should point out that my current phone came with double minutes for life of the phone.  I buy a 60 minute card every 90 days for around $20.00 and I get 120 minutes.  Most of the time I can find a promotional code where it will give you bonus minutes.  Another great thing with the tracfone is that you NEVER lose your minutes as long as you purchase airtime by the due date.  Even the best rollover plan out there for pay by the month cell plans only lets you roll over for 12 months.I will take the time to write my reviews on the LG225 and others, but the more I write, the more I think I will reactivate this little phone (and add that double minutes for life card!) because even though the bells and whistles are nice and fun for a while, what I really want is a reliable, solid phone.  And that is what this phone is.", "Date": "January 22, 2009"}, {"Title": "Love Tracfone", "Author": "R. Clark", "ReviewID": "R1FQD87ZAHQ85Z", "Overall": "5.0", "Content": "First of all, I am not a cell phone person. I only use mine for out going calls. I buy the yearly service from Tracfone, $96 for 400 minutes and a years service. BUT, before you order do a search on \"Tracfone coupons\" or \"Tracfone promo codes\". There is always a promo code for 200 free minutes out there. Now you have 600 minutes and a years service for $96 plus tax. You can always add minutes if you exceed the 600 minutes. Also if you don't use your 600 minutes during the year, the remaining minutes will carry over to the next year when you purchase another years contract. So, if your use your cell phone on a limited basis, I would recommended Tracfone. I have never had a dropped call or not been able to connect.", "Date": "May 7, 2008"}, {"Title": "tracfone is great", "Author": "Country Gal \"ky bluegrass\"", "ReviewID": "R1BVYRZTVBCURZ", "Overall": "5.0", "Content": "I have owned a tracfone for a long time now and find it gives great service. It's very economical on my budget with no monthly bill to pay. It gets good reception and I have no problems making calls from any location. I highly recommend the tracfone to anyone who doesn't want to have a monthly phone bill. try a tracfone.....you'll like it.", "Date": "January 15, 2008"}, {"Title": "Buy a Nokia phone - They have free incoming text messages", "Author": "Emma J. Officer \"Emma Jane\"", "ReviewID": "R1SR6QBQUNLGFG", "Overall": "2.0", "Content": "This phone may look cool, but I'd recommend the Nokia 1100 or one of the other Nokia phones instead. Sure, the Motorola C139 looks cool, but you'll be charged 0.3 units per outgoing & INCOMING text message. You're only charged for outgoing messages with the Nokia Tracfones. The Tracfone user guide says that all incoming messages are free. I called their technical support and they told me that this is incorrect. They confirmed that incoming messages are chargeable for this handset and some other Motorola's. That's probably why the price was reduced to $18.88 in Walmart. I already have a Nokia 1100 and can confirm that I've never been billed for incoming messages. I got the C139 to replace my 1100 since I've had it a while and it's starting to look a bit scruffy. I used the Tracfone \"refer a friend\" to get 140 minutes free (worth approx. $50). Once I've used this credit, I'm going to throw my C139 away and get another Nokia Tracfone.", "Date": "August 12, 2006"}, {"Title": "Good Starter Phone", "Author": "JJ Stark", "ReviewID": "R3HR7BUITP9X9V", "Overall": "4.0", "Content": "If you have a child who you want to carry a cell phone, but don't want to pay lots of money for all of the extras (or if you yourself just want a \"basic\" phone), this is a good value for the money.  Large screen displays numbers very clearly.  Sound quality is good.  Battery life is a little short and the phone cannot be used while it is charging (that's a pretty big negative, IMO).  But overall, this is a good starter phone and serves the purpose.  If you just want a dependable phone to carry with you in case of emergencies, this phone fits the bill nicely.", "Date": "January 26, 2009"}, {"Title": "Good, Solid little phone...", "Author": "Hanna \"BookLover\"", "ReviewID": "R38ZSKS59RX45D", "Overall": "5.0", "Content": "I have owned this phone for quite a few years.  I'm not one to trade up unless there is something wrong with the phone and there isn't one thing wrong with it...it's just as good as the day I bought it.  And, this little phone has gone all over the United States with me.  I can get a signal when and where even the top Verizon phones do not.  This phone has been dropped, set on, and carried by my dog and still is going strong.  There isn't as many features on it to go bad, but if you're looking for a good, reliable cell-phone this phone is great!  I also bought one for my mom and she still has it!  The Tracfone service is also A+.  Again, never any problems and always courteous.  2 thumbs up!!!  A must buy!!", "Date": "April 3, 2011"}, {"Title": "Tracfone C 139", "Author": "Jon E. Brubaker", "ReviewID": "R1AUPI3L0XQTOT", "Overall": "4.0", "Content": "I have a Motorola C 139 Tracfone which I bought for emergencies since I have a heart condition. I have found the phone to be reliable and sturdy. I dropped in on concrete twice and never phased it. I can hear better on the Motorola C 139 then I can on my land line house phone. I text message which is great because I'm partially deaf. It is basic phone, but for what I use it for, it is just what I need and at $6.66 dollars a month I pay for service, you can't get one any cheaper that works as good.", "Date": "March 25, 2008"}, {"Title": ".not unlocked", "Author": "A.D.", "ReviewID": "R1BEHPCFPVTKSC", "Overall": "1.0", "Content": "I was very disappointed to discover that this phone was not unlocked like it promised. If I could give 0 stars I would.", "Date": "July 25, 2013"}, {"Title": "Motorola C139", "Author": "Barbara HERRINGTON", "ReviewID": "RVFL9I2X628Y", "Overall": "3.0", "Content": "This phone is good enough for me , i just need it to call home, when out and about..no more telephone booth anymore, so u need something.", "Date": "June 18, 2013"}, {"Title": "Never pass the airtime due date", "Author": null, "ReviewID": "RIMI38HEU13PK", "Overall": "3.0", "Content": "If you do decide to buy this phone, never let the airtime due date pass. Every time you add minutes to the phone it adds a certain # of days to the expiration date of the minutes. I barely missed the date and it has been total chaos trying to reactivate the phone and buy airtime since. We've had to call customer service several times to try to get the phone working again. It's still not working at the time. Well, if your commited to not letting the expiration date pass, then I would say it is a good phone. If you don't need all the extra features like web access and things, I would considerate it a good, simple, easy-to- work-phone.", "Date": "March 29, 2008"}, {"Title": "Avoid Tracfone", "Author": "dms", "ReviewID": "RMOCS37XB2589", "Overall": "1.0", "Content": "May rating would be 0 stars, but Amazon doesn't allow that option.While it's convenient to have a pay-as-you-go phone plan, the service and equipment provided by Tracfone is abysmal!I have had three Motorola phones that have not even lasted a year. Customer Service - no such thing. The solution for most issues is to sell you equipment. Most representatives speak, but do not understand English.FYI - Net10 is the same company.", "Date": "May 27, 2008"}, {"Title": "Great Low Cost Cell Phone for Low Usage", "Author": "Mr. Cheap Skate \"Mr.Cheap Skate\"", "ReviewID": "R2UU5QXUHDYRJK", "Overall": "4.0", "Content": "In the past I have had contract phones with monthly charges, cancellation fee etc. For me that was not worth it as I only need the phone for infrequent use. I have had two tracfone (C139) for a few months now. I am perfectly happy with them. Each Tracfone only cost $20, and that will also include free minutes...10 with the phone...10 if your activate online...and 120 if you allow me to refer you...we both will get 120 free minutes. I also have 2 additonal codes for 30 and 60 more free bonus minutes. The service will last 2 months when first you activate, and 2 more months when you add the free minutes. After that point if you have not used up all your minutes you can roll over your unused minutes when you buy more minutes...for as little as $20 every 60 days. If you decide your don't need the service after you have used up the time and minutes...store you phone and reactivate it at a future time...no fee...just buy as little as $20 for 60 minutes...however, you will be assigned a different phone number, which I don't think is a big deal. Contact me (matman713 at hotmail dot com) for my referral and get started with a bunch of free minutes!", "Date": "September 16, 2006"}, {"Title": "Beware! Still not working after 1 year.", "Author": "Peter \"Pete\"", "ReviewID": "R1LX3THLMVKZ7K", "Overall": "1.0", "Content": "Beware Tracfone. I regret that Amazon won't let me give them 0 stars. We got this phone for my wife's aunt last December. After 1 year of trying to get this working, she still cannot receive calls. She can call out, but no one can call her. Tracfone support is useless (and generally only marginally speaks English). You also cannot manage the phone or minutes on line. You have to call in and give them about 60 digits that the phone shows you to do almost anything. We're letting this one die with over 400 units left on it because it is basically useless. Coverage isn't good either, but who cares if you can't receive calls anyway? There has got to be a better option, because I doubt there are many worse ones.", "Date": "November 20, 2007"}, {"Title": "Tracfone Review and 180 FREE minutes!!!!!", "Author": "monstrck@yahoo.com", "ReviewID": "RPOIVLO8X4TYT", "Overall": "5.0", "Content": "Tracfone Review and 180 FREE minutes!!!!! , September 13, 2006I love this phone. I purchased it a family member who is a limited cell phone user. It is perfect to keep in touch without paying a high monthly charge. If you have this or any other Tracfone and plan to activate it you may benefit from Tracfone's referral program. I can send you a referral and we both get 120 free minutes PLUS you'll get a bonus code to enter with your pin for ANOTHER 60 FREE mintues! Email me and I'll send one over to you. This offer works on new or reconditioned phones not yet activated before receiving emailed offer.[..]", "Date": "August 13, 2006"}, {"Title": "Battery, Activation Issues", "Author": "William A. Stephens", "ReviewID": "RSMLIN696VIKN", "Overall": "1.0", "Content": "For the following reasons, I have hesitated to keep the phone. First, the included battery shows a manufacture date of 2006! The battery is nearly 8 years old!!! Well past the usual life of lithium ion batteries -- and only two years older than the battery of the AT&T; Motorola C139 this phone was to replace (which started losing power three years ago). The battery accompanying this phone would not hold a decent charge (despite charging, discharging and recharging it several times). The best it would do was two days in standby and about 10 minutes talk time.Next, the packaging for the phone bears the following disturbing message at the very bottom on the front -- \"Phone Cannot Be Activated Unless Scanned at Register.\" ????", "Date": "December 25, 2013"}, {"Title": "BEST PHONE I'VE EVER OWNED!!!!", "Author": "D. Bepler", "ReviewID": "RHTUXL1XRJUOT", "Overall": "5.0", "Content": "This phone is the best phone that I've ever used!!!  I have had this same phone for 7 years!!! It's been dropped a few times and it still works.  I bought an upgraded one LG440, 4 months ago with camera, flip cover, flat keys for texting, and I HATED IT!!! The text keys kept sticking, the reception was terrible, it wouldn't work in my workplace (couldn't see incoming calls), and it kept slipping out of my hand because no grips.  My original phone cost 15.00, has rubberized grips so it doesn't fall out of my hand, sits on my dashboard without sliding, good reception & clarity for most places, very comfortable to hold, and very easy keys to text with.  I just bought another one online because it seems the stores aren't carrying them anymore.  I get the double minutes card and the minutes last longer and is much less expensive than other wireless phones.  I'm not an extreme texter so it's just fine.  For those quick notes, it's cheaper than the phone call, so I can still save.  I THINK IT'S THE MOTOROLA PHONE WHICH SEEMS TO BE A MUCH HIGHER QUALITY!! CAN'T WAIT TO GET MY PHONE!!!", "Date": "October 7, 2013"}, {"Title": "u get what u pay for", "Author": "majid", "ReviewID": "RHF62APVMSSXA", "Overall": "3.0", "Content": "not bad at all, very basic cell phoneI didnt expect too much after allthe service is kinda expensive though", "Date": "June 21, 2013"}, {"Title": "great phone", "Author": "charyce smith", "ReviewID": "REEN2DSS4WV8V", "Overall": "4.0", "Content": "My husband loves the phone.  It is very easy for him to use and the ring tone is really loud.", "Date": "March 20, 2013"}, {"Title": "DO NOT BUY IT!!!", "Author": "Joel R. Blest \"Karina\"", "ReviewID": "R22UKEAKU58GI2", "Overall": "1.0", "Content": "The phone may work fine but the company managing it is awful!! Get ready to waste all your minutes on 611 calls. (Unlike other companies 611 customer service calls are not charged as actual phone units.)Took forever to get to customer service, which is not properly trained and cannot understand plain English (some do some don't).Charged me for calls not connected etc...Really disappointed.. I lost close to 60 not so cheap units in a customer service call and they did not take care of the issue. I could not make international calls like advertised in their website. Really sad. With Tracfone  you really get what you pay for...that is their motto and that is the reality.... Google tracfone and below the links to the company you will see a webpage with tons of bad reviews and problems with the company.", "Date": "September 7, 2007"}, {"Title": "Nice phone if you have light cell phone usage", "Author": "yqtrac@gmail.com", "ReviewID": "R3NFCZSQ6BFA1P", "Overall": "4.0", "Content": "I have been using tracfone for about seven months. The signal is good no matter in the city of Boston or in countryside of PA. Compared to other prepaid services, I would say this one is the cheapest. And you get 120 free minutes if you get invitation from others before activation. Let me know if you need an invitation.", "Date": "June 15, 2006"}, {"Title": "Great Seller & Product!", "Author": "Robert Smith \"Sue's Stuff\"", "ReviewID": "R2OK9X5MVVHMSP", "Overall": "5.0", "Content": "The Trac-Fone 's I bought were in perfect condition and on time just as the seller promised. I love them. Thanks ever soo much!", "Date": "April 5, 2008"}, {"Title": "Cell phone...", "Author": "Debbie", "ReviewID": "R16Y985MSA67I", "Overall": "5.0", "Content": "I've had my Tracfone for about 5 months now. The reception has been generally good. Once i got the phone activated, I haven't had any problems. Tracfone has a 'refer a friend' program that will give each of 100 free minutes. All you have to do is send me an email asking for a referral. My email is debsclay@gmail.com", "Date": "July 6, 2006"}, {"Title": "info..", "Author": "pat22pat@gmail.com", "ReviewID": "R1PQTKUK5TS1YR", "Overall": "5.0", "Content": "My tracfone has good reception. i like that it has free call waiting and free caller id. if you haven't activated your tracfone yet then the 'refer a friend program' will give each of us 100 free minutes. please send me an email and i will send you a fast referral. it's a win/win! thank you.", "Date": "July 9, 2006"}, {"Title": "Tracfone.", "Author": "jenjenusc@gmail.com", "ReviewID": "R2823XRPG3P9SX", "Overall": "5.0", "Content": "Tracfones are ideal for people with light or medium cellphoneusage, so it works out well for me. The tracfonewebsite is user friendly and makes it easy toactivate, etc. I paid an extra $10. and got the car charger that just plugs into the cigarette lighter if the tracfone battery gets low when i'm driving. If you email me for a referral before activating then Tracfone will give each of us 120 free minutes!  I can also tell you how to get more free minutes.", "Date": "June 23, 2006"}, {"Title": "It's A Breeze", "Author": "Phil A. Owens", "ReviewID": "R24Y0WEU7VBRB0", "Overall": "5.0", "Content": "Tracfone is exxxxxcelent.  Service is exxxxxxcelent. (though I've never seen fit to use it in 2 years.)  Voice mail is free.  What else do you want?  Email me before you activate, and I'll show you how to get free minutes for life!breezydai@yahoo.com", "Date": "June 23, 2006"}, {"Title": "Nice Basic Phone....good service, Great Reception", "Author": "Louis Markoya", "ReviewID": "RVOJ4KF7CXCNV", "Overall": "5.0", "Content": "Got my Moto Cell Tracfone about 2 weeks ago and love the service. I just wanted a cell for emergency purposes and this fits the bill great. I like that you can buy 1 yr of service at once with no monthly billing. My girlfriend has a Nokia and barely gets 1 bar at our house...the Moto gets 4-5 barsand we're in a difficult area....love that. If you're considering a Tracfone, email me @ LMimagery@aol.com, and I'll get you the link for 120 free minutes....which can even be 240 free minutes if you buy the ear service with double minute upgrade.", "Date": "May 29, 2006"}, {"Title": "info.", "Author": "pat22pat@gmail.com", "ReviewID": "R14PDUZQE45MGC", "Overall": "5.0", "Content": "My tracfone has good reception. i like that it has free call waiting and free caller id. if you haven't activated your tracfone yet then the 'refer a friend program' will give each of us 100 free minutes. please send me an email and i will send you a fast referral. it's a win/win! thanks", "Date": "June 18, 2006"}, {"Title": "info.", "Author": "pat22pat@gmail.com", "ReviewID": "R3BWQ35WJQGNPB", "Overall": "5.0", "Content": "My tracfone has good reception. i like that it has free call waiting and free caller id. if you haven't activated your tracfone yet then the 'refer a friend program' will give each of us 100 free minutes. please send me an email and i will send you a fast referral. it's a win/win! thanks", "Date": "June 12, 2006"}, {"Title": "info.", "Author": "pat22pat@gmail.com", "ReviewID": "R3OG1UE82YTNZP", "Overall": "5.0", "Content": "My tracfone has good reception. i like that it has free call waiting and free caller id. if you haven't activated your tracfone yet then the 'refer a friend program' will give each of us 120 free minutes. please send me an email and i will send you a fast referral( i check my emailften). it's a win/win! thank you.UPDATE: as of october 2006 tracfone has cancelled the refer a friend program.", "Date": "September 20, 2006"}, {"Title": "Only good to be used at home and they are STEALING YOUR IDENTITY", "Author": "someone \"someone\"", "ReviewID": "R3E2O4OYW8KK47", "Overall": "1.0", "Content": "The connection is good only at home. 20 miles away from home, you get connection only by LUCK. Do NOT depend on it.To add airtime from Tracfone is extremely painful:If add it from their website (most of time it ends up ERROR and ask you to call the service representative), the webpage asks a lot of unnecessary information, then sends hundreds digits you have to key in to your cell phone.If add it thru calling their service representative, the representative will try to STEAL YOUR IDENTITY by ask you all unrelated information. Besides credit card and your cell phone ID, they ask:* Name* Address* Other cell phone numbers* Social Security Number!!!!!!!!!!!!!* Birthday?????????????????If you refuse to answer the question, they will argue that 'Our System Requires It'. Who cares about their system? I do care about my own IDENTITY SAFETY.However, if you still want to jump into the trap, there is a way to beat their stealing:***** Besides credit number and you cell phone ID, give them all FAKE information. ****I tried the strategy, and it works", "Date": "June 12, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "FULL COLOR SCREEN\nVOICE-MAIL,CID,CALL WAITING,TEXTING,\nINCLUDES AC ADAPTER", "Name": "Motorola C139 Prepaid Phone (Tracfone)", "ImgURL": "http://ecx.images-amazon.com/images/I/51VY41gAvpL._SY300_.jpg", "ProductID": "B000F7VBUQ"}}