{"Reviews": [{"Title": "Hong Kong phone with strange plug", "Author": "C. Clark", "ReviewID": "R1SZP4TO4P1OHR", "Overall": "1.0", "Content": "It's designed for use in Hong Kong and has a strange plug on the charger.  It's awkward getting the Sim card in and out as the battery is in the way.  For some reason it does not show when a missed incomming call has come in. It's really a pig in a poke. It will work in the USA but for the price you can probably get something more \"mainstream\"!", "Date": "December 11, 2007"}, {"Title": "It;s NOT the same as the US version", "Author": "Roger Stukey", "ReviewID": "R12MN6OEU92KH1", "Overall": "1.0", "Content": "I bought one of the European versions to replace my 8 year old KRZR k1. This one will only hold 20 voice dial numbers and they have to be on the phone, not on the SIM card. The US version can hold 250 voice dials and they can all be on the SIM card so if your phone breaks, you wont lose your address book.I wanted a phone that makes phone calls! I don't need or want all the music, web browsing, etc. The European version also has a menu that is almost impossible to find what you want. I'd stay far away from this one. Unfortunately, it looks like the US version is out of production.", "Date": "August 4, 2013"}, {"Title": "quality", "Author": "Thomas Reeves", "ReviewID": "R1B9Y747SCNKCC", "Overall": "5.0", "Content": "I recommend this phone.It is everthing you'd want in most advanced cells. Extremely long battery life, plays movies, songs, even games. I use a sim card in my car sterio, this phone and my workout Ipod.This is a non-mainstream phone that beats out it's contemporaries. For computer geeks, the equivalent is athalon vs. pentium. Better product without the name jacking up the price.CON: This price is higher than I paid for mine - I bought a non-warranty model for about 50 [...] cheaper. Due to the great quality, I did not expect it to be an issue. But I ran it through the washing machine . . . it still works, but took some damage.I may go with the more costly warrantee'd version because I am sure I will buy this exact same model.", "Date": "November 29, 2008"}], "ProductInfo": {"Price": "$299.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and EDGE/GPRS data capabilities\n2-megapixel digital camera with 8x digital zoom; MicroSD expansion; digital audio player\nBluetooth stereo music; access to personal email; web browser; SMS/MMS/EMS messaging\nUp to 5.83 hours of digital talk time and 300 hours of standby time", "Name": "Motorola KRZR K1 Unlocked Cell Phone with 2 MP Camera, MP3/Video Player, MicroSD Slot--International Version with Warranty (Navy Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/419hULGc6EL._SY300_.jpg", "ProductID": "B000SZOKPS"}}