{"Reviews": [{"Title": "Why all the bad press?", "Author": "Kassie", "ReviewID": "R1LPRA7JW9NR64", "Overall": "5.0", "Content": "I just purchased this phone, and I love it. In regards to the vibrating comment, just hold down the astrick key and it will just go to vibrate mode, again to return back to normal mode. Simple as that. I have had no problems with menus, and correcting errors is easy. Just hit C in between the phone icons. Its is a nice looking phone, nice ringtones, and basic features for those like me who don't need all the bells and whistles. I recommend it. This is my first LG phone (previous Nokia user) and am very pleased. If you have problems using the phone, use the manual.. That is what it is for!", "Date": "November 28, 2005"}, {"Title": "Nice basic phone", "Author": "Jenn N \"College Student\"", "ReviewID": "RLKYYGP3QNRJY", "Overall": "4.0", "Content": "I've had this phone for a few weeks now, and it gets the job done.  It's not a flashy phone for those looking for all the latest features, but it does have a IM capabilities, a couple standard games and decent ringtones.  My one complaint is that the phone drops calls easily when there is only one bar of service; I'd prefer if it just told you that there wasn't enough signal strength to make the call in the first place.  Overall though, the phone is well made and is of good quality and I recommend it to those looking for a basic entry level phone.", "Date": "October 28, 2005"}, {"Title": "9 months - many problems", "Author": "Dynamite", "ReviewID": "R86CPA4I2CY7X", "Overall": "1.0", "Content": "We bought 2 phones on a family plan last October.  We were looking for a very basic flip phone capability, no bells and whistles needed.  Our major use was to communicate between each other.  We were happy for for about 5 months.  Since then we have experienced all the problems mentioned.  Our phones were replaced during April. One sim card was replaced during June. Yesterday we again replaced our sim card on the same phone.  Another replacement phone is on the way to us.  The major problems have included \"service not available\" even though 4 bars are showing and the other phone works at the same location, \"unable to read\", \"insert card\", and of course dropped calls.  Yesterday as I was talking to a warrantee agent trying to resolve our most recent problem my call was dropped in the middle of the call.  At this point I have concluded that this model is extremely unreliable and am looking for an alternative solution.  I can not depend on it.  I would not recommend it to anyone.", "Date": "August 10, 2006"}, {"Title": "Stay away", "Author": "Ben Dejesus", "ReviewID": "R3D2A2IDZOIXJU", "Overall": "1.0", "Content": "I just received 4 LG C1500 from Cingular and activated them on Jan 2, 2006.I am having problems with all the phones.  Like beeping and lighting when it is not being used.  I believe this is called \"recycling\".  When it does recycle, the signal bar along with the Cingular logo disappears.  And when this occurs when you are on a call, it gets disconnected.  Then when you press the call button to call the same person, it displays a message saying it is reading the smart card (sim card).  Pressing the call button will display the same message for several minutes or until you give up.Yesterday, Jan 6, 2006, I tried making 7 phone calls and I got disconnected every time.I've called Cingular numerous times for a total of about 5 hours to try and correct the problem.  I finally spoke to a Resolution representative from Cingular and he suggested going to a Cingular and try another phone.  I tried two of my SIM card on two lower end Nokia 6061 and had no problems at all.Bottom line.  Stay away from this phone.", "Date": "January 5, 2006"}, {"Title": "Nice interface, terrible battery life", "Author": "Eric Friedman", "ReviewID": "RTNIZVHT6YHT", "Overall": "3.0", "Content": "The user interface on this phone is pretty nice. It is easy to access the alarm clock and calendar features. As for the reviewer who complained about having to press \"Names\" and then press 1, I don't know why she doesn't just press the \"phone\" button (down on the arrow pad)--- it takes you directly to the phonebook. It also keeps a very useful, integrated history of not just outgoing calls but incoming and missed calls as well. However, the battery life on this thing is pretty awful. Strangely, it does not seem to have unreasonably poor talk time during long conversations. But on standby, especially overnight, the thing just dissipates. I think it is because the backlight lights up every few minutes even when it is not being touched at all, e.g. simply sitting on the desk in front of me. If you are ok with turning off your phone each night, you would likely have a more pleasant experience than I do.", "Date": "November 20, 2005"}, {"Title": "Phone constantly reboots", "Author": "Carl Ball", "ReviewID": "R2B9HR9GYO8X8D", "Overall": "1.0", "Content": "It's a cheap phone and you get what you pay for.I bought 3 of these for my kids a week ago.  Within a couple of days I returned 2 of them because they kept recycling.  The third phone is now acting up and one of the 2 replacement phones is also acting up.  That's 4 out of 5 phones exhibiting this flaw.  I'll be swapping these LGs for something more reliable like a Nok or Moto.  No more LGs for me.Some of the others here noted things like the phone making noises and the screen lighting up for no reason.  That's the phone recycling and it does it for no reason.  Next time it does it, look at the display and you will see that your bars go away.  If you happen to be on a call when it does this, it disconnects you.In the last week, I've invested way too much time diagnosing this problem for Cingular.  I can force the phone to recycle just by holding it near my MP3 player, or laptop.I have a Moto V3 Razor and it works flawlessly.", "Date": "December 31, 2005"}, {"Title": "terrible phone, cuts off calls while your in-call", "Author": "worthless LG phone", "ReviewID": "R3VQ208DJGX2P6", "Overall": "1.0", "Content": "As for the positive reviews for this phone, those people have positive reviews for this phone because they were one of the few lucky ones that actually got a working phone.  Don't get this phone.  Its a total gamble whether you get one that works properly or not.  I received two of these phones on a shared plan and both do this \"recycle\" or whatever thing.  whether your talking to your best friend or employer, in the middle of the call the phone will just end the call for you, instantly cutting you off.  If you press the green phone button to access your phone history and call the person you just lost, the phone says \"reading smart chip\" and it will do this for the next five minutes.  I normally take the battery out and put it back in so I dont have to wait the five minutes or so.  Both phones do this.  I once had it disconnect me three times in a row from the same person I that I was calling repeatedly. Absolutely unacceptable, terrible phones.  Get something else, dont get LG.  They make great CD and DVDROMs but definitely not phones.", "Date": "January 10, 2006"}, {"Title": "Worst Phone.  Stay away from LG C1500+Cingular", "Author": "iBang \"football lover\"", "ReviewID": "RRT9W7XMV5VQR", "Overall": "1.0", "Content": "This has to be the worst phone I've ever owned.  I thought Motorola StarTac (my very first phone) was bad, wait till use this phone.  I have 4 LG C1500 phones in my family plan.  2 works ok but the other two, where do I begin.  First, it keeps complaining to insert sim card although it's inserted properly.  Went to Cingular store got the new sim card, works ok for a day.  Next day, same thing.  Did this 3 times and had Cingular send me the replacement phones.  Now one of the two doesn't complain about the sim card but occationally it says it's not in the network although it shows full bars.  The other one still have problem with sim card.  I just got the third replacement phone and now it seemed to be ok with sim card issue but can't talk more than a minute.  It just drops a call in the middle of conversation.  I now am trying to get a 4th replacement phone but not sure if they will issue it.  I am under 2 year contract and still got 14 months to go, what a nightmare....", "Date": "September 6, 2006"}, {"Title": "got it free, it's worth as much as i paid for it", "Author": "Racks", "ReviewID": "R183V7BL75BVDO", "Overall": "1.0", "Content": "this is the worst cell phone i have ever used. i echo other reviewers who mention this phone if very fickle. seems like it has a good connection bc it shows full bars, but inexplicably will go down to zero and drop the call. very random behaviors. i would get messages saying something to the effect of \"unable to read smart chip\" or \"service not available\" which is frustrating, bc i have another phone under the same family plan in my other hand which is functional and proves that service is in fact available. so the lg lied. turning the phone off and back on to reboot it doesn't seem to work. the only way i would get it to work after such a malfunction would be to take the battery out and put it back in and then turn the phone back on, then it would search a while for a signal before finally working again. i tried hard to keep it but in the end, had to take it back to the store and exchange it for an infinitely better replacement in every aspect, samsung x497.", "Date": "January 23, 2006"}, {"Title": "Many problems", "Author": null, "ReviewID": "RCANLVHQ658BU", "Overall": "1.0", "Content": "I paid 10 dollars for this phone and have spent almost 40 on sim cards. The phone will say \"Insert SIM Card\" even if it is inside. It recyles, and when it does so, the screen goes blank and if you were talking on the phone your call is dropped. There is a VERY minimal selection of graphics, ringtones, and games.  You cannot change the mini display. Save your money because you might end up spending 40-50 bucks on SIM cards, and another 50 for a replacement phone.", "Date": "January 12, 2007"}, {"Title": "Get a better phone", "Author": "Blackdove", "ReviewID": "RICZO4ZH8N1MW", "Overall": "1.0", "Content": "My wife and I got two of these phones for \"free\" when she switched to Cingular. After two weeks, we exchanged her phone for a new one of the same model because it would freeze and drop calls constantly. My phone was fine, but has lately been experiencing the same issues. I know service is not the problem as I had a Samsung phone through Cingular before and had no problems calling from the same areas. Sometimes I'll have 5 bars and all of the sudden it goes to 0 and takes a minute or two to come back.I do not recommend this phone. Even though it is/was free, it's not worth the frustration.", "Date": "December 9, 2006"}, {"Title": "If you are clumbsy like me...this is your phone...", "Author": "Marilyn M. \"Marilyn\"", "ReviewID": "R2HA4XJ959ET0B", "Overall": "4.0", "Content": "I have had this phone for about 6 months now and all together is has been great. I mean it dont have bluetooth but besides that its good. I have had so many hightech phones but end up dropping them and breaking them or finding them in my daughters purse in a million pieces. This phone i dont have that problem it is really made good. i have dropped it off my car going down the road and went back and got it and its fine..", "Date": "September 27, 2006"}, {"Title": "This Phone is Horrible!!!", "Author": "H. Boger", "ReviewID": "R2FBHWF43P1ROV", "Overall": "1.0", "Content": "I got this phone in January, and I had to take it back the day I got it because it kept losing service and dropping calls.  They gave me a new one thinking that it was just that phone... but it wasn't.  The one I have now isn't as bad as the first one, but it still loses service and drops calls constantly.  Don't buy this phone!", "Date": "September 8, 2006"}, {"Title": "Good minimalist phone, but has reliability issues", "Author": "Gordon Dexter \"Friendly Neighborhood Computer...", "ReviewID": "R1W1FB5QJ4WO6T", "Overall": "3.0", "Content": "I already have a PDA so I don't want much from my cell-phone except making calls.  I don't care for a camera, don't need tons of games, and don't want something big or expensive, so this phone seemed to fit the bill pretty well.The user interface on this is efficient, but not particularly easy to learn, and sometimes awkward.  The shortcuts that make the interface reasonably fast are non-obvious (you push the \"dial\" button to access call history?).  Also, the address book makes terrible use of screen real-estate: You must choose between either viewing only two entries at a time or being unable to see which number you are calling.  Other than that the sound quality is usually acceptable but not great, battery life seems a bit less than claimed but still not bad, and of course it's tiny and light enough to fit in the same pocket as my wallet.The major problem I have with this phone and/or network is reliability.  I have had frequent mysterious problems such as being unable to make calls despite good signal.  I also find that the backlight mysteriously turns on even when I have not touched the phone, and the external display goes blank for no reason.  So far they have been fixed by power cycling and removing the battery, or at worst reseating the SIM card, but they've been getting more frequent lately.  I've especially had recent problems with people calling my phone and it sending them to voicemail without ringing, despite the fact that my phone is on and has good signal.Other than the reliability problems this would be a perfect phone for me: minimal, small and light, efficient interface, nifty enough, and best of all cheap.If you're stuck using this phone here are a few suggestions:*Reboot it frequently to mitigate reliability problems.*Learn T9 if you ever want to do any text messaging at all.  The manual doesn't explain it particularly well but I figured it out after a few minutes of fiddling.*Experiment with it to find all the shortcuts and hot keys that make the phone faster to use.*Instead of paying exorbitant prices for ring tones and wallpapers you can download PNG/GIF/JPG images and MIDI files onto the phone just by typing in a URL, which only costs a penny per Kilobyte for transfer charges.*Get a $30 USB transfer cable for backup and MP3 transfer.", "Date": "June 6, 2006"}, {"Title": "same phone?", "Author": "R. Waller \"movie buff\"", "ReviewID": "R1S57Z4F9YAD3E", "Overall": "4.0", "Content": "Are we all talking about the same phone here? I haven't had any problems with it and using it is a breaze. I bought this phone after I wanted to change my calling plan so I wouldn't get stuck with roaming charges while I was away, far from my calling area. My old phone (also an LG) wasn't compatible with this new calling plan because it was embedded with the old AT&T; service. I love the fact that I can download MP3 ringtones to this phone because that was one thing that I was looking for. I also like the fact that it has a speakerphone. It does not have a camera, and I was not looking for one. I already own three very good stand alone cameras, why bother with another?? I was although a little aggravated having to re-enter all of my old phone book information because that's the only way you can do it. The manual is not hard to read at all unless you are dyslexic.", "Date": "May 9, 2006"}, {"Title": "This phone is pretty, but it's terrible!", "Author": "Rachel Mann", "ReviewID": "R1D570KA6AIT9X", "Overall": "1.0", "Content": "I recently got this phone, and I really hate everything about it.  It has a tiny battery life -- a day or two, even if I don't talk on it at all.  It interferes with my laptop like crazy, even when it's not in use -- I have to keep it at least 10 feet away.  Also, to do almost anything takes way more steps than it rightfully should.  When you go into your \"names\" section, you can't just type the letter of someone's name.  you have to first hit 1, and if you mess up, and then hit 1 and try to go back, it will highlight \"delete all contacts,\" which I have almost done countless times.  And I have yet to figure out how to edit a word in text messages; I don't think it can be done.  In fact, everything about text-messaging is difficult to use (compared to my old Nokia phone).  I would really, really discourage you from buying this phone.  In fact, I registered with Amazon just to warn people.", "Date": "November 6, 2005"}, {"Title": "If it were possible to give a rating of zero, I would definitely rate it ZERO.", "Author": "J. Wesson", "ReviewID": "R2WB746CC3MM8X", "Overall": "1.0", "Content": "A rating in the NEGATIVE 100, NEGATIVE 110 range would be more appropriate for this phone. I've had this phone for about a year and a half - my husband has one also.  We selected this phone because it was cheap and our needs are simple.  We wanted a reliable phone - no camera, no bells, no whistles.  We could not have made a worse choice.  The phone will work on occasion, then will spontaneously shut off, go blank, or give me some error message - \"Insert SIM Card\" - when the card has never been removed.  My husband's phone is the same way, so I know that it is not just a lemon that I have.  As a matter of fact, we previously had two others (same model) that we exchanged because they were also garbage.  Same problems on those also.  We wrongly attributed it to the service.  I STRONGLY RECOMMEND YOU BUY ANYTHING BUT THIS PHONE!!!!", "Date": "December 27, 2007"}, {"Title": "Tough, Reliable, Perfect albeit older", "Author": "Michael J. Flaim \"Joe College\"", "ReviewID": "R320QMSO6UFF19", "Overall": "5.0", "Content": "The durability of this phone is what inspired me to write a review. I have dropped this thing more times than what's reasonable, and it takes no damage. Just two days ago, I accidentally slammed into a desk when I had this thing in my pocket and I when I took it out, the top had become separated from the rest of it. It's in two pieces (being held together by duct tape) and it's still making calls and carrying on as if I had just not destroyed part of its casing. I can't possibly understand the bad reviews for this cellphone; it CAN'T be destroyed, the battery is decent (after 2 years of use I can still get about 2 days of regular use before it needs to be recharged...better than what I can say about a lot of the more recent phones), the call clarity if solid, and above all it's easy to use.I paid $160 for this thing two years ago, and I think I've gotten every cent out of it so far (even though it's in two pieces, I'm not going to stop using it). I have no doubt this little phone will serve me reliably for AT LEAST another two years.", "Date": "September 15, 2007"}, {"Title": "Random Dropped signal and calls", "Author": "A Allen", "ReviewID": "R1TOO7L4A08G9H", "Overall": "1.0", "Content": "This crazy phone will frequently go from full-scale signal to dropping a call while standing in one place. When it happens, the screen goes blank and there is a 20-30 sec delay as it figures out where it is and gets a signal back. Meanwhile you've lost a call. Could be at the beginning of a call or anytime thereafter.Also will give random errors when looking up a number from the contacts list. Frequently comes back with 'error reading smart chip'. Usually have to shut it off and 'reboot'.It is basically a piece of junk.", "Date": "July 10, 2007"}, {"Title": "20% good/ 80% bad", "Author": "Snow White", "ReviewID": "R3J0Y0P11VHM3X", "Overall": "1.0", "Content": "We've had 3 of the LG1500 in our family plan for nearly a year.  Very inconsistent service.  When calling our son, I would get a message that his number was \"blacklisted\".  After calling Cingular several times, we demanded new phones...not LG1500.  We were told it was \"like for like\" exchange, but that policy is not in writing...so we're getting a different brand.  If a phone doesn't work, the company needs to get rid of them!!", "Date": "April 19, 2007"}, {"Title": "Wasn't the worst, definetly wasn't the best", "Author": "Elizabeth Williams \"lizardindc\"", "ReviewID": "R2VQL88Z3DYXUA", "Overall": "2.0", "Content": "I got the phone because it was small but I didn't know I'd be sacrificing so much. The speakerphone only works when the call picks up and my text message inbox fills up basically every day. I get shoddy service and while i do like the design, there are lots of places where the paint has chipped away and I can see thru to the casing. All in all an okay phone if all you want it for is emergencies, but it's not really the best for what you'll want to do with your cell phone.", "Date": "April 17, 2007"}, {"Title": "Worst phone I've ever had.  LG?  Never again.", "Author": "John", "ReviewID": "R1X15H4W4X1PN", "Overall": "1.0", "Content": "I consider many one-star cell phone reviews to be unfairly harsh because reviewers who switched brands seemed to blame the manufacturer just for having a different way of doing things, but having owned Nokia and Motorola phones I was appalled at the poor usability of this phone.  I gave it every chance because I got it brand spanking new from Cingular for $65 as a replacement.  The volume (of the person on the other end) could not be made loud enough, and the display is comparatively grainy and small.  The instruction manual is lacking.  I really disliked this phone.  I sent it back within 30 days and paid nearly $270 cash for a Motorola V557, and have no regrets; its display looks like a TV compared to this thing.", "Date": "May 8, 2006"}, {"Title": "bad experience", "Author": "disgruntled Nestor", "ReviewID": "R2ZOYY6ZROYFR2", "Overall": "1.0", "Content": "Bought this from a local Cingular store. Took it home and wasted one evening trying the decipher the WORLD'S WORST (in my opinion) instruction manual. Couldn't even enter my address book. It gets returned tomorrow. It looks to me as if the instruction manual was translated by software directly from the Korean. In contrast, my old Motorola Star Tac manual was complex but logical and reasonably intuitive.", "Date": "March 28, 2006"}, {"Title": "Okay basic phone", "Author": "M. Walton", "ReviewID": "RVXU2ZXE2VPGK", "Overall": "3.0", "Content": "This is my first cell phone and I wanted a basic phone with no extras. It still is capable of things like text messaging and connecting to the internet (which is an annoying, centrally located button that is often easily pushed so you inadvertantly connect when you don't want to) but is not a camera phone. The main pro for this phone is the size. I can fit it easily into a purse or pocket. For an occassional cell phone user like me, it serves its function, but we've had many problems...Problems I've had:- 3 months after I bought the phone the smart chip had to be replaced because it read \"insert card\" and I couldn't use the phone- had to have the smart chip replaced a second time a month later!- on occassion when I got to dial or check messages it says \"Reading Smart Chip\" and doesn't let me do anything. if I come back to the phone a few minutes later its usually back to normal- sometimes the message icon is still there even though I have no messages in my voice mail and I can't get rid of it until I get another message and then erase it- it will sometimes go from 5 bars to none even when I haven't moved- my husband's phone (the same one) has a problem where the display light is almost always on- he also often doesn't get his messages until much later.In summary, if you are getting it for free. Then its free.. you can't complain. If you are paying for it, I'd look elsewhere.", "Date": "March 23, 2006"}, {"Title": "A good basic phone", "Author": "Will Gee \"Bill\"", "ReviewID": "R167DS3ZY37BQF", "Overall": "4.0", "Content": "If you want a good basic, flip phone, I think this is a good one.  It does not have all the \"extras\" touted by some but it has good sound quality and performs well.", "Date": "March 19, 2006"}, {"Title": "Poor Phone", "Author": "Christi Myers \"cmyers1849\"", "ReviewID": "R1X5LWGVMJEQAG", "Overall": "1.0", "Content": "I unforntunately have had this phone for a year now and have hated just about every moment of it.  My phone drops calls at least once a day, even if I have a full set of bars at the top.  It also constantly says \"emergency only\" and won't let me get a call out.  And most everyday, I can have four whole bars and it won't let me get a call out or receive a call.  Could be my cingular service which I'm not fond of either, or the phone.  Either way, spend a little more money and buy a better phone than this.", "Date": "March 18, 2006"}, {"Title": "What is everyone's problem?", "Author": "F. Paradiso \"Ren\"", "ReviewID": "R1NM6UPUEZM76L", "Overall": "5.0", "Content": "It's a phone! Basic not technical junk. I had mine for about two months and I love it. Crystal clear calls. Better then my Nokia.It's classy looking as well. I hate the hi tech look of most cell phones.I use my phone for emergancy use only. I don't need it to have five hour long conversations with someone while shopping in a mall. Like most use them for.Ohh, and for the person making the comment \"I can't use it in my car\" Your not suppose to talk and drive!!", "Date": "March 3, 2006"}, {"Title": "Great little phone for free!", "Author": "Christine Childs", "ReviewID": "R15YUGUTJRDKW5", "Overall": "4.0", "Content": "I got my phone as a free upgrade through Cingular in November 2005 and have had absolutely no problems.  I don't know what happened for the other reviewers (maybe there was a bad batch) but my phone has been great.  It's easy to use, NEVER drops a call and has great extra features.  If I have one complaint it is that the case is very slick.  I've dropped my phone a few times (and still don't have any problems) so I am going to have to get a cover before I destroy it!", "Date": "February 8, 2006"}, {"Title": "Worst cell phone ever?", "Author": "Derek Paille \"dcplsu\"", "ReviewID": "R2BAGCU4BNFBX1", "Overall": "1.0", "Content": "Yes, I would say this is the worst phone I ever had. Every problem mentioned has occurred while I attempted to use this phone. It constantly dropped calls and had to search for the sim card. Some of the most important and basic concepts of a cell phone have been overlooked on this product. It should have never been put on the market. DO NOT GET THIS PHONE JUST BECAUSE IT IS FREE WITH A PLAN. You will regret it if you do. I'm going back to a Nokia.", "Date": "February 8, 2006"}, {"Title": "Sending it back", "Author": "T. Kyle", "ReviewID": "R14VP1DHM9VWC1", "Overall": "1.0", "Content": "I'm sending mine back since the reception/transmission of voice is disrupted by my home wireless LAN, something that never happened with my Nokia 3588i. The battery life is short (about like my the 3588i, but with GSM I was looking for a lot more battery life.) The display is hard to read(I'm 50), a light blue background for wall paper might help.This phone lites up at odd times, jingles when i plug in a ear bud or when i remove the ear bud, it jingles when it powers up, it jingles at other times, for as yet undetermined reasons. I want the phone to be silent when I'm at work. What if you are hiding out and need to call the police to tell them there is an intruder in your home, this phone will lead the intruder to your location.I did like the fact that it has a dedicated side button to control the ringer and call volume, saves you from going to a menu to set the phone on vibrate, or pausing in your conversation to adjust call volume.I was amused to find that there are no pre-set profiles for vibrate only, you can have ring, ring & vibrate, vibrate and then ring. I have not figured out if these profiles can be customized or if I can download a new one to the phone.I am disapointed that it seems that cell phones still do not have a feature that allows me on a day of the week basis to time automatically switching back and forth between two profiles. I would like to go to vibrate at 8 AM and back to ring at 6 PM,Monday through Friday and leave it on ring on Saturday, and back to vibrate for church etc ...I should have read the reviews here first.", "Date": "November 24, 2005"}, {"Title": "Bad phone", "Author": "A. Fried", "ReviewID": "R18DU1C3HRJB11", "Overall": "1.0", "Content": "I've had the phone for five days so far and I think I'll  return it. It has a short battery life, about one day of life with little use. I'm receiving my voicemails several hours late.  I bought two ringtones which I was charged for but never got the ringtones downloaded to the phone and the cingular operator wasn't able to resolve the issue. Also, the phone wouldn't receive or make calls for part of one day then it just started working again.", "Date": "December 19, 2005"}, {"Title": "Cingular: dirtbag to the masses", "Author": "B Lidge", "ReviewID": "R35CPH5ZOAF22X", "Overall": "1.0", "Content": "I received this phone as a \"replacement\" for a motorolla V180 less than 24 hours ago.  Several horrible aspects: size, personalization, connections.I think this phone was designed for children under 10.  It is very awkward to hold while talking or dialing numbers.  The buttons are extremely tiny and hard to hit accurately.  Have fun trying navigating through the menu with the 5 key directional button.With the V180 I was allowed to create my own hotkeys and rearrange the menu to my liking.  That feature has been replaced with a preset menu and hotkeys I don't use at all, thanks Cingular.  It has a horrible looking faceplate with an island(??) graphic you can't remove or change.  The selection of graphics and ringtones are pathetic, except the \"here comes the bride\" ringtone, that one can stay!!.Personalization wouldn't be a problem if it had a USB port like the V180.  There is absolutely no way to add anything to this phone without paying cingular.  No hacking in, no changing anything, you're stuck with LG menus and graphics.Not to hate completely on this phone...it does receive and make calls with adjustable volume.", "Date": "December 29, 2005"}, {"Title": "WORST PHONE I'VE EVER HAD!!!", "Author": "Michael A. Chaplar \"Mr-Bubbs\"", "ReviewID": "R55IXNOK7LL3Q", "Overall": "1.0", "Content": "With this phone, you take about 200 steps backward in technology.  This phone drops calls ALL THE TIME and then says something about the SIM Card;  it cycles for minutes while it tries to get back into a mode where you can use the phone.  I will have 5 bars and then it drops.  During several different 2 minute calls, I experienced 5 drops and it was in an area that had 5 bars.  I NEVER experienced this with my last phone!! I can't use this phone at either of my homes or offices in CA or NV and can't use it when I'm driving, so what good is it?!?!  I think Cingular made a mistake bringing this phone in the first place.  Why can't you make a phone that doesn't drop calls, or has a longer battery life?  I think we would ALL prefer these features over having a feature like a camera in our phones.  Remember, it is a CELL phone, not a CAMERA phone.  So how about putting some more R&D; into a phone that works and not worrying about the small percentage of people who want to take pictures with their phones!!  Oh.....and on the minor irritation side, the battery life is poor, the standard ring tones are WAY too few to choose from, calls often go into voicemail without the phone rining, it is hard to hear the phone ring even on the highest setting, etc.  HEY CINGULAR, IF THIS WAS MY FIRST PHONE WITH YOU, I WOULD ASSUME IT WAS YOUR SERVICE AND SWITCH TO SPRINT OR T-MOBILE!!  YOU NEED TO TAKE CARE OF THIS PROBLEM!!!", "Date": "January 17, 2006"}, {"Title": "Think \"limited\"", "Author": "L. H. Singletary \"Lewis Singletary\"", "ReviewID": "R2JEABKETUWUFC", "Overall": "2.0", "Content": "If you want an inexpensive phone that will do VERY little other than make/receive calls, this phone is adequate.  If you like to do \"complicated\" things with your phone, like (gasp!) change your ring tone from time to time, don't bother with this phone.I paid $18 for this phone.  That was about the upper limit of its value.", "Date": "March 7, 2006"}, {"Title": "A GREAT CELL PHONE!", "Author": null, "ReviewID": "R334QJ0WT91QX7", "Overall": "5.0", "Content": "i just got this cell phone 2 days ago and i totally love it! its my second flip phone but this is my favorite one. my old cell phone was a nokia the nokias are ok but there keypads and non flip totally sucks. the good thing about this phone is that it'so easy to text. You just have to go to the text and theres a c button to clear it. The only down thing about it is the battery life.", "Date": "January 23, 2006"}, {"Title": "Decent Phone", "Author": null, "ReviewID": "R7HAVU5E2UFYP", "Overall": "4.0", "Content": "I like how the phone works. It has great text messaging which is easy to use and receives and sends messages instantly. My dad got me a game for it. It plays games really well. I can call easy to everyone really well. A cell tower is 1/4 of  mile from my house. Only con is the battery life.", "Date": "January 7, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "LG C1500 AT&T; GSM", "Name": "LG C1500 Phone (AT&T)", "ImgURL": "http://ecx.images-amazon.com/images/I/41G3ADXBCHL._SY300_.jpg", "ProductID": "B000A116AM"}}