{"Reviews": [{"Title": "All the \"must-have\" features are perfect.  (but...)", "Author": "Ron Rothman", "ReviewID": "R17TB8PQ5F79C4", "Overall": "4.0", "Content": "I own and use this phone, and overall, it's excellent.  Samsung got the important features right: Size/weight, battery life, reception and call quality, etc.All the \"must-have\" features are perfect.  I only wish they hadn't overlooked some \"nice-to-haves.\"My wish list:* [major] Give us a speakerphone, man!* [minor] The display breaks phone numbers up at the 5th digit, so dialed numbers look like this:  718-55  5-1212* [medium] The call logs only indicate the names of friends--not their numbers.  I.e., it will tell me that my friend \"Joe\" called, but not whether it was from his home, his office or his mobile (if I have all three in my phone book).  This is especially inconvenient when it comes to using the \"recently dialed calls\" list.The same problem applies to the caller ID screen that appears when a friend calls.  Even with called ID, I find myself asking friends who call me, \"Are you calling from home or from work?\" because all my caller ID reports is that \"Joe\" from my phonebook is calling.* [minor] It's currently difficult to find accessories for this phone--in part because of Samsung's questionable decision to use a completely non-standard jack for the headset connection.I'll leave it at that.  All in all, an excellent performer and a great, fun phone.  But a phone at this level should have its user interface thought through a little better.", "Date": "December 14, 2004"}, {"Title": "GREAT PHONE...... But it has its flaws", "Author": "NIKKISIXX \"nikki\"", "ReviewID": "R6I2ZESIKXQEE", "Overall": "5.0", "Content": "I Just Bought This Phone A little while ago and when i bought it they made sure this is the one i wanted because of complaints that the sound quality was bad. Well that is if you are in certain areas that dont get the best reception because it sounds just as good as my nokia and sony ericsson and my sidekick 2,but it has alot more features that are well worth the money( dual color screens for the photo viewfinder and as a photo caller id, lights up bright on the front with a multi color,changable service light,has a great quality vga camera with effects such as frames, black and white,sepia tone,negative and it can even make a picture look like a sketch,and it does this all sharply so it doesnt look cheap. also it gets great reception and has a vibrant color screen with animated backrounds. it has great battery life and loud crisp clear ringtones including mp3 and polyphonic.You can change your message tones, powering on and off tones, folder tone, and set personal ringtones so it is highly customizable. The phone itself is also very attractive and small. It is also light so it has alot of pocket appeal. The Bad good call quality but still not the best if you are looking for the best i would go for the motorola v400/v551. Also you have to keep the same shutter tone on all the time you cant change it or make it silent, the keys are a bit small but not to where youll be hitting 2 keys at once. It also runs on GPRS not edge so downloads are a bit slow. other than that no problems, and even better it runs on AT&T;/cingular's gsm 850/1900 service so youve got great reliable coverage.", "Date": "November 28, 2004"}, {"Title": "Review E317", "Author": "L. Hammons \"Ortho\"", "ReviewID": "R1X95DJZ6EDL9Y", "Overall": "2.0", "Content": "I have been a Sprint customer for 2 years with a Samsung A500, was a very reliable phone except for sprints coverage area. Now to the E317 and Cingular. I read the E316 reviews prior to my purchase and thought that there is now way that this phone (since it's a samsung) is that bad. Well I was wrong, it definitely has its share of problems. I have no gripes with cingular, this is on the phone only.1. The E317 has very, and I mean very, poor sound quality. Unless the person is speaking very loud or has a deep voice it is very difficult to hear them, even with the volume turned all the way up. This is why I am looking into returning it. Heck, this is the most important thing.2.It does not have the standard 2.5mm Hands Free jack but instead one that is proprietary to samsung.3.The volume control on the side controls the keypad volume when not in use, it DOES NOT control the ring volume or send the phone to vibrate mode like my A500 did (I am not sure if samsung has changed all their phones to act like this). Vibrate must be set by the keypad and the ring volume requires you to navigate in the control menus. The side button will control the speaker volume when you are talking on the phone.4. Has a fair amount of background static that is always constant at some level. Much more than I ever had with the A500.5. The speaker produces more of a computer generated voice than most people will be use to or will like. My A500 sounded more like the phone would in your home, where the E317 sounds like you are talking to someone through the computer.6. The Good - Small and light weight with good color displays. Easy to use camera, even though low picture quality. Easy to navigate phonebook and phonebook is easy to setup.Well I hope this helps you make an informed decision and even though you like the looks of the phone, just stick with something like the Motorola V400. I really look for Cingular to pull this phone off the market within 6 months due to complaints (This is not unheard off).", "Date": "November 7, 2004"}, {"Title": "I dont see the problem?  Nice little phone...", "Author": "Hamburglar", "ReviewID": "R28AX6MBKXEE9I", "Overall": "4.0", "Content": "The speaker is fine. I dont agree with all the whining about the speaker. It may not be the best speaker out there, but it works just fine. Sleek and stylish, lots of nice features, great user interface, very intuitive. Super lightweight and has a really nice front display. All in all, a nice phone.", "Date": "March 13, 2005"}, {"Title": "Eh.. A nice phone until you have to talk on it.", "Author": "C. Walker \"atiecay\"", "ReviewID": "R198D47RSQ5SYX", "Overall": "2.0", "Content": "Okay, so I started reading reviews AFTER I purchased this phone. Seeing all of the \"horrible sound quality!\" comments, I was pretty nervous. And I had a reason to be. The sound quality on this phone is awful! I don't think it has anything to do with Cingular or reception, as I've never had problems with cingular before. I just can't hear anything on this phone and what I do hear is muffled and distorted. My friends are tired of me saying, \"What did you say?\" over and over again and they can't even hear me half the time. Also, I've had several instances of the phone \"freezing up\" on me. I'll have to remove the battery to get it to start working again.It's a great looking little phone and the camera is pretty cool and fun to mess around with - but in the end, it is a phone. When you can't use a phone for it's main purpose, you have some problems. Samsung should have put a little more time and effort into the speaker instead of into all the little options that don't really matter much.", "Date": "May 6, 2005"}, {"Title": "don't let them push this phone on you", "Author": "Tasha Carey \"brooke_lyn4\"", "ReviewID": "RHEUEAWF7Y4GL", "Overall": "1.0", "Content": "i got this phone around the end of may and i'm completely unhappy with it. the sound/reception is terrible, you have a hard time hearing the people you're talking to. already i've had problems with the phone \"freezing up.\" when turning the phone on/off it will just get hung playing the start/end animation song. also sometimes when just talking on the phone you can turn it off by lightly touching the hang-up button. i orginally went into the store to purchase the samsung p207 put the representative talked me out of it.", "Date": "July 27, 2005"}, {"Title": "Samsung e317", "Author": "Tina Darby \"www.tinadarby.com\"", "ReviewID": "RHKBOCSITOY3J", "Overall": "2.0", "Content": "I purchased this phone when signing another contract deal with Cingular. It was relatively cheap (about $60 with a 2-year contract). This was about three months ago. I've already gotten rid of the phone earlier last month.I could not make calls with this phone. Not that it wouldn't dial up numbers, but I could not make out anything being said by the person on the other line. Horrible reception indoors and out. I live in the Las Vegas area and always had a great signal but no matter how many bars were showing, my reception was still bad. Only once did I have a decent call. Cingular has great service and considering the area I live in... only shows this phone is a bad choice on reception.Other then that, there are a lot of neat things about the phone. It looks great, is very light-weight (was amazed at how light it was), has many minor but useful features, picture quality was decent and cool additions like digital borders and different shooting modes.The color screen was small for my taste but none-the-less very nice. Vivid colours. Text was easily readable. I could not customize the home screen as much as I would've liked. Included wallpapers were boring, even though animated at all times. Being able to change the display text colour can be cool but pretty much useless. Would've prefered to been able to change the skin colours. External screen is wonderful. Shows everything you need to see in the same vivid colours as the internal screen. External screen blacks out after a few seconds though. They should've made it, at least, show the time indefinitely.The numbers on the keypad are easy to use and easy to see. The navigation dial in the upper middle is a little difficult. Often times I ended up pressing numbers when trying to use the dial. Buttons on the sides of the camera are small, but easy to use and provide a little added help with shortcutting.Menus are easy to navigate, can customize the way it appears in three ways. Ringtones included are as boring as the wallpapers so plan on purchasing your own ringtones. Games included are all right but hard to play with a keypad.Samsung made it relitively easy to use this phone. Anyone young to old should not have a problem getting to understand it. I never had to pick up the manual except for the one time when trying to learn how to use the external screen as a camera viewfinder.As said before, camera has decent quality. The colours come out a little faded, but they look better then any previous phone I've had. You can choose many different colour modes (sepia, black and white, emboss, negative, etc.)... a selection of digital borders to add around your photos. Day and night shooting modes (not much difference between), vertical and horizontal shooting, shot series (which enables you to shoot multiple photos quickly in a row (did not like this feature because it made pictures very small). Multiple zoom and brightness/contrast features work well. The funnest camera I've experienced on a cell phone.My favourite feature was the service light (tiny light on the outside lid) that would flash continuously whenever I've received a call, message, or voicemail. If I was away from the phone for a period of time and it was silent, the service light would let me know I need to check it by flashing a lot. Would like to see this done on more phones.The casing of the phone will catch eyes. It size will too. Often people said the phone was very nice looking. I liked the added black touch on the front. Casing scratches easily, though. Will begin to look cheap over a short period of time. The battery IS the back cover, which I absolutely hated because if I lose a battery, I don't want to lose a back cover either. Stupid decision on Samsung in my opinion. They placed the headset jack on the top of the phone for easy usage. Phone closes very securely and does not bang up the phone or keypad while doing so.Sound quality is not great. Volume does not sound high on the highest setting. You'll have to make sure to be in a quiet place.I gave this phone a two star rating because of the reception problems (mainly) and volume. I couldn't make calls so I got rid of it. Not everyone has this problem obviously, but Samsung phones are known for their reception difficulties. So, please keep that in mind while purchasing this phone.It is a wonderful phone for early teens. Adults, business men and women, gadget lovers, stay away.", "Date": "July 2, 2005"}, {"Title": "garbage!", "Author": "Delvato \"Del\"", "ReviewID": "RGOEBMPZY29HW", "Overall": "1.0", "Content": "ok let me start by saying this phone looks great the features are great....but i bought this phone about 35 days ago and have had to exchange it 3 times through warrenty already 3 times!!!! for the following reasons.1) first phone would not stay connected, 2)second phone would power off and i would have to take the battery out and put it back in to get it to power back on 3)it allways gave me problems connecting to voice mail and to text messages and dropping calls, let me explain this i live in a spot with full bars other famially memebers do not have this problem. i fell in love with this phone when i seen it but after 3 faulty phones i will never purchase a samsung phone again, i swithed to the motorolla v551 and love this phone no problems with connectivity i miss the color screen on the front but hey i bought this phone for talking not admiring its looks, i hope this helps you choosing a phone but if i were you and you were debating on this phone i would say be verry weary.oh yeah almost forgot to point this out ....you cant hear squat on this phone in a quite space witht he volume all the way up....my convos on this phone was asking what? what did you say?", "Date": "July 29, 2005"}, {"Title": "Pretty good, but why the finicky connects?", "Author": "T. Chiang", "ReviewID": "R3SI510MB6F5Y7", "Overall": "4.0", "Content": "I previously had the Samsung E105, with a hands-free kit and everything.  When I got this E317, I expected to be able to use the hands-free kit with it; however, the E317 has a different connection jack, so I had to buy another hands-free kit.The menu navigation is fairly good too, but definitely not quite as easy as I thought.  The menus seem to be promoting the use of shopping for ringtones and the like, so the first menu item you get is the MEdia mall instead of something more useful like Recent Calls.I have to admit that the external screen would be more useful if it stayed on all the time like on the E105.  The phone comes with a rather small selection for ringtones (hence the Shop for Ringtones options?) and wallpapers.  I'd definitely suggest a connection cable to transfer your own ringtones or buy them from Cingular, whichever one gets you the ones that you really want.The camera on the phone is not really good; I find that the colors are a little over-saturated.  Then again, this is a camera on a phone, so don't expect insane colors and resolution.  The button on the right side of the phone is useful for taking pictures of yourself, but honestly, is more of a nuisance than a good option; it's easy to press-and-hold this button while it's in your pocket and you end up with a bunch of black pictures in your picture album.On the up-side, however, the phone is fairly customizable, much like all Samsung phones are.  Keypad tones, ringtones (when you've got the ones you want), wallpapers (likewise), text colors, even pictures and text for the external id as well.Overall, the usage is quite good. I have no idea what the other reviewers are getting so riled up about (sound quality is not crystal clear, I admit, but not so bad that I'd return the phone - it's really not that noticeable, unless you're nit-picky).  Definitely a good deal if you get it for free, but it's almost a unit that you have just to tide you over until the next best thing.", "Date": "July 19, 2005"}, {"Title": "Good light and small phone", "Author": "M. Rowcroft \"adida5796\"", "ReviewID": "RRJW1NQU9XDXO", "Overall": "5.0", "Content": "I like this phone. Its small and light with a nice look and color. The volume could be a bit higher. Im not noticing all the problems others complain about while I do agree the volume in the speaker should go a big higher. The motorola v551 is too heavy of a phone to expect to want to keep for a year or more.", "Date": "January 9, 2005"}, {"Title": "Poor quality phone but looks pretty :-)", "Author": "Richard Vargas", "ReviewID": "R3P7Z114H0ZS5Q", "Overall": "2.0", "Content": "I scoured the internet and did my homework researching this phone, and found only one person complaining about reception and poor sound quality; other then the review above mine here (maybe no one has bothered to review this phone and post their comments).  Well, I am number three now.I was very disappointed this phone sounded the way it did, and had such horrible reception.  I own a v400 as well on the cingular network, and I know what and where I should have good reception, and the e317 is not even in the same ball park, it is horrible.  I am returning it, and going to give it a second try.  If something changes, I will either retract my statements here, or qualify them with more bad news with the replacement e317.Stay tuned...", "Date": "October 28, 2004"}, {"Title": "Don't buy -- terrible sound quality.", "Author": "R. Stanchak", "ReviewID": "R1LVE2960JNEVQ", "Overall": "4.0", "Content": "I downgraded my initial review to two stars due to the terrible sound quality on the phone.  I exchanged it for an LG L1400 and all my problems with sound went away.The good:- really small and light- nice displays- Camera & photo caller id featureThe bad:- Terrible sound quality -- the speaker is loud, but it is buzzy and distorted- poor reception -- I find I miss calls frequently because the phone does not ring.- the phone makes a 'snapshot' sound when it takes a picture.  I understand that this is required in some countries, but it would have been nice to be able to turn it off.- T9 is not the default for text input (why??!) and I don't think I can change that.", "Date": "October 26, 2004"}, {"Title": "Bad phone in a nice package...", "Author": "C. Flynn", "ReviewID": "R1NOTOFUNN2A4A", "Overall": "2.0", "Content": "It seems strange that Samsung would try so hard to make such a nice phone that includes great features (picture caller ID, dual LCD screens, intuitive menu,etc), and then forget the most important part - the phone.  The reception is great (at least that's what the phone indicates), but the sound quality is horrible.  I find myself saying \"What?\" every 10-15 seconds.  I saw mixed reviews about the e316, so I'm not sure if the poor sound quality is a standard feature, or if I just got a bad apple.  I'm definitely returning this one, but not sure what to replace it with.", "Date": "October 28, 2004"}, {"Title": "Excellent but for one drawback...", "Author": "Tessalinn", "ReviewID": "R3PFIFMQGFBEUA", "Overall": "5.0", "Content": "I have had this phone for 11 months and it was my first cell phone purchase. Now I am renewing my contract and upgrading my phone. I would not be upgrading my phone if it wasn't for the simple fact that:My Samsung E317 does NOT have speakerphone!It is one feature that this phone does not have that would be the most useful for multitasking while conversating.Everything you ever need to know about the phone is listed in above reiews and the product description. I just wanted to point out the fact that there is no speakerphone as I didn't pay attention to that fact until I realized I needed it. I have purchased a Nokia 6102 for the speakerphone and reception quality well known for Nokia phones (as I was told by a Cingular representative).Quick note: I believe that Cingular is the best service, just based on personal experience. Never dropped a call. =)", "Date": "April 23, 2006"}, {"Title": "Good basics, extras not so much", "Author": "Michelle", "ReviewID": "ROUZR9S8MXXVD", "Overall": "4.0", "Content": "I got this after accidentally dunking my Moto V551 in a cup of coffee (which, judging from V551 reviews and my boyfriend's experience with his V551, was probably a blessing).I'll admit I was sold by the external color screen. I also had a Samsung previously and was very happy with that phone - it \"lived\" for 2.5 years, brought me through contract and when it did finally crap out it was just the display that died, the actual phone still made and received calls.So kudos to Samsung for making reliably good phones.This phone does just fine for the basics - it has good reception, I never drop calls, sound is on the quiet side but still reasonable. The phone book works is easy to use. The display is bright and the color is vivid. Buttons give good \"click\" feedback when pressed and menus are reasonably well organized. Charges well, except good luck finding a replacement charger besides ordering another Samsung one (see 3rd party accessories below comment below). Everything *basic* works as it should.It's the *extras* where the phone starts to lose points. First, the camera SUCKS. The V551 was crap overall but at least the camera was decent. The E317 has a VGA camera and it's very hard to get a picture you can actually see anything in. Then again, if you want to take pics I suppose you should be using a digital camera, and not your phone.Another gripe I have with the camera function is the external button that activates the camera. Considering the camera is crap this is probably a superfluous feature anyway (you're not gonna go around whipping out your phone to take pics), but it's especially annoying because I am constantly having to delete pictures of the inside of my purse. This also drains the battery.The games are all right - a bejeweled clone, a pipeline linking game, golf and chess.The ringtones blow. Only one \"normal\" ringing sound, the rest are music-like tones that WOULD sound okay except for bizarre sound effects that are inserted - birds, people cheering, cats meowing...Finally, it BUGS ME TO NO END that Samsung phones do not take 3rd party accessories.So:**GOOD**-Good reception - haven't dropped a call yet-Solid phone-Decent volume in calls-Good color display-Decent menus-Okay games**BAD**-Sucky camera-Annoying external camera button activates camera when you don't want it-Horrid ringtone selection-Can't use 3rd party accessories!Overall I expect this phone to be as reliable and longlived as my last Samsung phone, which I was very happy with. If you want a decent phone that's small and has a cool color screen, but don't care so much about the camera and other bells and whistles, this is a good choice.A note about Cingular - it's a fine carrier unless you actually need to call customer service. They're only around business hours Mon-Sat I believe, and quality of the service is VERY variable. If you don't get a satisfactory answer you can call a few more times and you might be able get someone who can actually help you. This has actually happened to me - I had a billing issue and called 3 times. The first I was dropped while on hold. The second I was told the CS person would \"leave a msg\" for her supervisor and I would be contacted within 72 hrs. I thought, fat chance, and called a 3rd time. I got a very helpful CS who solved my problem in 5 mins right over the phone. This aspect of the CS may be good or bad depending on your point of view. Me, I can't wait till contract is up so I can go back to T-Mobile.", "Date": "December 14, 2005"}, {"Title": "Samsung e317", "Author": "ash416 \"ashley\"", "ReviewID": "R2FA3Y5IJ4FOW7", "Overall": "4.0", "Content": "I have used this phone for about three months and It is such an improvement reception wise over the LG phone I had used. It also takes fairly good pictures. I took it to a recent concert and I was pretty close to the stage but I got great shots. My only complaint is that the volume control is on the side so while the flip feature protects from accidental calls I do sometimes hit the button and turn my phone up or down without knowing it.", "Date": "July 1, 2005"}, {"Title": "Problems with \"hide number\" in caller id", "Author": "Ilya A. Volfson", "ReviewID": "R3QBUMTUWLZEEL", "Overall": "3.0", "Content": "Overall no major problems with the phone.  Some difficulties with sound quality, but I don't know if it's phone vs. Cinguular.One major glitch is inability to switch into \"hide number\" in caller ID.  When you do that, the phone stops dialing out after an hour or so.  I thought it was a problem with a particular hand set, got a new one and same thing happens.Will have to exchange it, since I like to keep my number private", "Date": "December 23, 2004"}, {"Title": "solid choice", "Author": "rob", "ReviewID": "R3OGVJO7E8P229", "Overall": "4.0", "Content": "I replaced a high-end previous generation nokia with this phone based primarily on its small size.The good:*Size. This phone fits easily in my pocket. I had a tiny nokia and this phone was the only flip phone at the Cingular store that was nearly as narrow.*Signal. I find the signal coverage to be slightly better on this phone than my nokia (despite cingular's advice to the contrary).*Battery life. I go a few days between charges. The phone seems to charge quickly, too.*Usability. I thought it would take time to get used to something other than my nokia but the menus were easy to use.The OK:*Camera. The camera is not great in low light, but is fine overall. One annoyance is the camera can be turned on using an external button. I've taken the occasional picture of my pocket. Also, you can't seem to get rid of the camera's shutter sound (I haven't looked that hard, but it wasn't obvious).*Sound quality. I think sound quality is lower on this phone than on my old nokia. I can hear people fine, but there is a little bit of distortion, like you might hear if you turned your stereo up too loud. It seems to help to keep the volume down a little and/or to tilt the phone slightly away from my ear. Like most phones there are volume buttons on the side of the phone so its easy to adjust.*Customization. I don't feel like I have as much control over ringing patterns, displays, etc. as I did on my nokia. Still, those are the kinds of things you get used to.The bad:There are really no deal-breakers for me on this phone. So far its been a good deal.Overall a very capable phone. I'm enjoying it.", "Date": "June 3, 2005"}, {"Title": "Good phone!", "Author": "Phebe", "ReviewID": "R1N4ONNVJZN1KF", "Overall": "5.0", "Content": "ive had this phone for about a day and so far the sound quality is just AWESOME! it was so great, i could just put the phone on my desk and i could hear it jsut fine. So i dont know if i happened to get a good phone out of the bad ones that people are tlaking about or if samsung has improved it or not in the past weeks? months? (i dont know how long this phone has been in the market)but the hands free microphone is annoying, it does not come standard with the phone, and its not a standard hands free plug, so you're forced to buy their mic.the package did not come with a holster thing either, and the instruction manual takes up about the whole the box, but whatever.overall, the phone is awesome, i love it so far =]", "Date": "February 14, 2005"}, {"Title": "samsung 317", "Author": "D. Dudra \"wolftattoo\"", "ReviewID": "R3TBSJTBA5AT0M", "Overall": "3.0", "Content": "Had the Phone on cingular serves for five days now bought the 317 for my self and the samsung 427m for MY Daughter took mine back to day because the sound quality is so bad, had to ask the other person to repeat them selves most of the time. My Daughters 427m sounded great good sound quailty so I traded my 317 for the 427m. the only thing I miss is the front display", "Date": "January 8, 2005"}, {"Title": "Bad sound", "Author": "L. N. Trim", "ReviewID": "RBTCITSQPG9HC", "Overall": "3.0", "Content": "The sound quality is horrible!  I purchased my brand new samsung e317 on ebay.  I first assumed that the seller had jipped me.  Reading these reviews, now I know differently.  If I had it to do over again, I would have purchased a different phone.", "Date": "January 23, 2005"}, {"Title": "An amazingly durable, well-built phone", "Author": "Carey R. Rose", "ReviewID": "R10BWK254KQI4B", "Overall": "5.0", "Content": "I've had this phone for nearly three years.  During that time, I can't deny that it's had its flaws, but they have been largely overshadowed by the excellent service this phone has provided me with.  However, for the sake of this review, I'll detail the main annoyances:-No speakerphone-Call logs display name only and NOT the number.  Very inconvenient when trying to quickly call people back.-Can only send SMS messages to one recipient; no mass-texting.  Works with MMS, but is a hassle.-Volume can be a little low, though this is only occasional-Occasional quirks (resets randomly?  very occasional)Now, for the good parts:-Good sound quality (to my ears)-Excellent battery life-Snappy performance (I've used my fair share of unresponsive phones that are a pain to use)-Well-built keypad, good tactile response (great for texting)-Decent camera-Calendar and other apps work greatAnd here's the most amazing part for me:I've dropped this phone numerous times onto hard cement.  It's been all over the country with me, in pockets, backpacks, left on the ground in the snow, and it's even gone swimming with me in a fairly filthy lake.  That's right:this phone survived a swim in the lake, as well as  a subsequent drying cycle in the clothes dryer.How many other phones can you say that about?  This phone Will.  Not.  Break.  Period.  Way to go Samsung!", "Date": "November 21, 2007"}, {"Title": "Not a good phone, better as a camera", "Author": "K. Moen", "ReviewID": "R3BKEL0CVJS1US", "Overall": "2.0", "Content": "This phone has several problems:No speakerphone.Volume control on the outside does not control audio volume; it controls keypad volume -- who needs that?There's no standard jack for downloading photos; you have to buy theirs.", "Date": "April 14, 2007"}, {"Title": "I like my e317", "Author": "ash416 \"Ash\"", "ReviewID": "R2AGX8SRIAZNOK", "Overall": "4.0", "Content": "I have had the Samsung e317 flip phone for about eight months now. Its capabilities  include Text Messaging, Multimedia Messaging, Ring tones, Games, and Photos. This phone has a screen on the front which can be set to show photo caller ID (which I really enjoy). It is small and compact, and have a exceptionally good camera providing you are not taking far away photos (but I have found this to be the case with all picture phones). The only complaint I have about the design of this phone it that the photo button is on the outside of the phone...thus I have about 43 pictures of the blackness inside my purse.  The battery hold its charge exceptionally well. Truthfully, I don't use my phone all that much during the day, but it is always on -- and I rarely have to charge it. The e317 gets the best reception of any flip phone I have owned. Overall I would highly recommend this phone if you are in the market for a descent flip phone with a few extra \"bells and whistles\", but are no interested in spending a lot.", "Date": "December 19, 2005"}, {"Title": "Cute Phone, Bad Sound Quality", "Author": "Julia Colley", "ReviewID": "R2U1VKJMBPFDXH", "Overall": "3.0", "Content": "I wish I could keep this phone, but the sound quality is so bad that I have to return it.It has some great features- it's very small, great display, the numbers are very BIG when you type them in on the screen...but the sound quality is awful. I really have to press the phone up to my ear to hear and even then, the other person sounds like they are in a tunnel. At first I thought that my earpiece had blown out or something - the way that your car speakers can blow out- but now I think the volume is just lower on this phone than with others.Otherwise though, it's a nice phone.", "Date": "December 17, 2004"}, {"Title": "Do not buy this phone if put in pocket", "Author": "Carmel Loving", "ReviewID": "R2LR6QPDDD90WL", "Overall": "1.0", "Content": "Hi.  Just upgraded my cell service and got this phone.  I've had it for two days.  I'm wearing levi's jeans today and the camera starts up and takes pictures (in my pocket!).If you keep your phone in your pants pocket, don't buy this phone!I'm on the phone with cingular right now exchanging my phone.", "Date": "September 23, 2005"}, {"Title": "Nice...", "Author": "Mia", "ReviewID": "R3JP5BHREX7I85", "Overall": "5.0", "Content": "This was my first cell phone...and I love it! It's a very cute and compact cell phone! I also love the mini display in the front. I have gotten 3 new cell phones, and all of them have been this one. I just love it!!", "Date": "April 13, 2006"}, {"Title": "Muy Bien", "Author": "Jeremy", "ReviewID": "R2VA56TIUHPOBU", "Overall": "4.0", "Content": "well i got this phone in early march of this year and i over all really like this phone. the things i would like it to have are to be able to take videos, even though it makes up for it by holding up 70 something pictures. the camera quality could be better and i wish it had a flash. the black on the front of the phone is cool but after having a case on it it got marked up. ive never had a disconnected call before. but when you buy music ringtones its kinda fuzzy, but i think all phones do that. i think this phone is more for younger people but to those who are picky about little things than you might like it but whatever. i think it's a really good phone though.", "Date": "October 29, 2005"}, {"Title": "Efficient, useful, high tech phone", "Author": "E. J. Park", "ReviewID": "R1K6TYL8TSWEHG", "Overall": "5.0", "Content": "This phone is better than the other camera phones out there because it's easy to use, while being very capable. The features it provides are useful. The design is very modern and not too complicated as well. I would recommend it to anyone out there.", "Date": "November 18, 2004"}, {"Title": "Excellent features and style. Definetely recommend", "Author": "JerseyJeff", "ReviewID": "R3IIVGGMBSHU1E", "Overall": "4.0", "Content": "I'd have to say that i'm in love with this phone. I recently received it last week, and can't stop playing around with it. For starters, the external display on front of the folder is great. You can choose what color you want it to be, and it has a neat little service light on it as well. Once you open the folder, the screen size is pretty good. The buttons and layout are nothing differen than you average clamshell phone, but that's ok. The softkeys are nice. As for the features, the phone is incredible. Theres too many things you can do to write down, so I won't go into detail. However, let me just say that once you connect to Cingular's MEdia Net, you will be hooked. Lastly, as far as everyone talking about the poor sound quality, just buy the additional earpiece(probably best to get it in the 3 piece travel package) and you should be hearing fine again.", "Date": "May 22, 2005"}, {"Title": "Should be taken off the market", "Author": "R. Foisy \"RB\"", "ReviewID": "R148ZIR59XZJWR", "Overall": "2.0", "Content": "Why Cingular continues to sell this phone is beyond me?  Surely Samsung had to know what a terrible phone they were putting on the market.  The main problem is clarity.  There is so much distortion that I really have a tough time understanding what people are saying.  AVOID AT ALL COSTS!!!", "Date": "April 1, 2005"}, {"Title": "Don't bother", "Author": "BradyBunch", "ReviewID": "R28RRIJCESAFF9", "Overall": "1.0", "Content": "Volume/speaker is indequate.  Phone is NOT as teeny as predecessor 307.  \"Many different ringtones\" equates to exactly 11.PATHETIC.", "Date": "February 16, 2005"}, {"Title": "Cingular Deceptive", "Author": "Sandra Wayne", "ReviewID": "R2WYG2GPMUM14H", "Overall": "1.0", "Content": "My review is on Cingular.  I bought a phone w/service and was told I could return for full refund and only charged for any air time used.  THEY LIE.  THE PHONE DID NOT WORK IN MY AREA AND I CANCELLED THE NEXT DAY.  THEY ARE CHARGING ME FOR ACTIVATION even though it never worked in my area.  If you are uncertain you will keep the phone and service, DON'T BUY from Cingular.  Amazon will also do nothing to reimburse.", "Date": "November 2, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "MEID is in the photos to check with service compatability.\ncontact us for more info on the phone if needed.", "Name": "Samsung E317 Phone (AT&T)", "ImgURL": "http://ecx.images-amazon.com/images/I/41JHKAGVQ2L._SY300_.jpg", "ProductID": "B0002VQDVM"}}