{"Reviews": [{"Title": "Very well done phone", "Author": null, "ReviewID": "RBPGSLAISTBPM", "Overall": "4.0", "Content": "I have had Sprint PCS service for just under 3 years, and in that time have switched phones 3 times.  My previous two were Samsung phones -- the first was good, the second so bad that I had to consider getting another one just to get reception in my home.  With the performance of that phone, I decided this time to try a Sanyo product.  I had heard good things about the 8100, which this phone replaces, and was hoping the 8200 built on that reputation.After using this phone for almost 2 months, I have to say that I am very pleased.  This phone has all of the features you can ask for, and yet with rebates and other offers is very affordable.  Both color screens are very clear, and they display easy to use menus and a camera that takes pretty good pictures, considering the phone is not a stand-alone digital camera.  The phone has a solid feel, and talk time is more than adequate, too (compared to my last phone, which may not be saying much).  The nicest addition is the speakerphone, although the speaker could use a little clarity.  Oftentimes, at low volume you cannot hear it, and when you put it higher, the sound is distored and reverberates.Since you can read about the remaining features above, I will point out a couple of disappointments, other than speakerphone quality.  The first is the lack of screensavers, ring tones, and games.  I know that since this phone is advanced, most people will end up downloading these things, but for someone that has little interest in PCS Vision or such services, this is a setback.  Next, I am not sure why Sanyo only included 9 speed dial numbers -- my Samsungs allowed over 100, and it is limiting to have just those that are dialed by one touch of the keypad.  My third complaint is not necessarily with this phone, but with the fact that even as good as it is, it does not mask the sometimes poor service Sprint PCS provides.  It is either crystal clear or not there at all, and despite being told that this phone would give me much better reception (and it does compared to my last phone) it is still not near where some of the other carriers are.In summary, for the cost, you won't find a better Sprint PCS phone out there which includes all of the features you would expect from an advanced phone.  And, when Sprint gets the service to where it should be, this will be a great phone to complement it.", "Date": "June 2, 2004"}, {"Title": "A Decent Phone", "Author": "CBR Rider", "ReviewID": "R2P1MAJDTMM4GN", "Overall": "4.0", "Content": "I purchased this phone as an upgrade replacement to my SCP-4900 about a month ago. I have compared it to my old 4900 as well as a SCP-8100 in terms of reception and function. Overall, it has been a decent phone, but it does have its quirks. My current firmware is v1.007SP, PRL 10025, hardware 0202 for those of you that care about these things.First, the bad:- Noticeably worse audio quality in the built-in earpiece compared to the other phones. I think that putting the camera in the same part of the phone as the earpiece speaker made them have to compromise the earpiece quality. The 4900 was clear but too quiet, the 8100 is loud and clear.- Reception is different. The phone always shows fewer bars than both my 4900 and 8100 in the same location (2 bars vs. 4 bars). However this said, I think all three phones are comparable in reception - the first week I had the PM-8200 I went all over town with the SCP-8100 to compare. I have read that Sanyo used to exaggerate the signal strength meter in the older phones and that the 8200's signal bars are now more in line with other phone manufacturer's. Some places I can get better reception (ie. make a call) with the 8100, in other places only the 8200 works. Strange.- Battery life is somewhat limited. Sanyo states 12 days' standby life for the 8200. I manage 3-4 days at best (I am a 700 minute-a-month talker and use the web an average of 5 minutes a day). I can easily talk 2+ hours at a time without problem. I was spoiled by the 4900 with 1 week between charges minimum with the same usage pattern and 16 days if I didn't use it much. The 8100 I have to charge about as often, though, and that's only rated for 10 days' standby.- Build quality is not quite as good. In comparing the other two phones, the 8200 is not quite built up to the same standards (eg. the hinge is looser, the finish coarser). Of course, this may or may not have an impact on functioning.- I find the polar bear animation irritating, but fortunately this can be turned off. A choice if different onscreen 'Buddies' would be appreciated.Now the good:- Reception is quite good overall, I get signal in the places I need it (work and home). Sprint's coverage is rather good here in Sacramento, CA, about the same as Verizon and much better than either Cingular/AT&T; or T-Mobile (I'm a former customer of Cingular and AT&T; before they merged). Likewise for San Francisco - my friends there with Cingular borrow my phone to make calls.- The camera, although not as good as other maker's, now is up to VGA resolution and has a flash.- The camera flash (really just a bright LED in the cover) can also be used as a flashlight (just hold down the volume toggle while the cover is closed). This is good in a pinch trying to find the keys you've dropped at night.- You can text message now without having to go on the wireless web, unlike the older units.- The phone now has a real GPS chip imbedded for locating the phone in e911 conditions, but some may also consider this bad for privacy. I don't think this feature is entirely functional yet anyway.- The web browser is much much faster than the 4900 and also noticably faster than the 8100.- The ringer can now be set to ring at the lowest volume and vibrate at the same time. Before it was either high volume with vibrate or vibrate only.- The screen is bright and clear.- The phone now has a built in clock. Sprint phones in the past have relied on the network to provide the phone with the time so if you didn't have reception, the phone couldn't tell you what time it was. With this phone you can.- The speakerphone works reasonably well, although not as clear as on the 4900. The 8100 does not have a speakerphone, although the earpiece is loud enough you'd think it did.- The phone has analog (AMPS) capability, unlike almost all GSM phones. Not really useful in a urban setting, but if you go out into the countryside, many rural areas are still analog only (the analog signal travels further than digital requiring fewer antennas), which may be a lifesaver in an emergency. Roaming on analog is normally $0.50/min, but Sprint has a nice Free and Clear America option that lets you roam on any carrier (including analog) for $5 extra/month. Good if you're the outdoors type. Be aware, however, that if you are talking in analog mode your phone number is vulnerable to cloning.Overall, I would recommend this phone and am glad I bought it, despite the flaws I mentioned above. I, like many Sprint users, are fond of the Sanyo phones because they have been the best performers in the past. Other phones to consider if you don't need a camera are the SCP-4920 (candy-bar style) and the RL-2500, both these phones are by Sanyo with good reputations.", "Date": "February 1, 2005"}, {"Title": "The Next generation of Phone!  Awesome!", "Author": "Mark \"Technology, Music and Movies\"", "ReviewID": "R3LHIT1V4EZKAS", "Overall": "5.0", "Content": "The Sanyo PM-8200 is an awesome piece of equipment.  Don't believe the hype!  If you live in a major metropolitan area, Sprint service is often BETTER than that of other cariers.  I live in the New York / New Jersey area and the service is great here, especially with a high quality phone like this one.  I'm sure in some areas of the country Sprint may not be as good.  I've never had a problem with my connection, although their customer support is another issue.That being said, this phone utilizes all the good things that Sprint offers.  The wireless web through PCS Vision is great.  The new link feature is nice too.  It basically allows you to use this phone as a walkie talkie.  Watch out Nextel!Contrary to some of the other reviewers, I actually like the speaker phone.  I think the quality is good.  How many cell phones actually have a speakerphone by the way!The camera is a nice feature.  The PIM is cool too.  It is true that there's not enough speed dial numbers for those who use that.  I never used it too much with my Samsung phone anyway.  What's worse is that my Samsung just was not durable.  My experience with Sanyo phones is that they stand up to a lot of abuse!True, there are also not enough games and ring tones on this phone. Downloading that stuff sucks, not to mention that they want you to pay extra.  It's a $300 phone, include some decent ring tones will you!!!!!Adding another criticism, why does Sprint go out of its way to sell phones that come with no accessories?  This is an annoying problem, considering most of those cheapo plastic accessories cost them pennies to make overseas.  Check out some of my reviews of the accessories for these phones.  This is one problem that is not just about this phone, it's about the cell carriers trying to sqeeze their customers till they go broke.All in all, the positive far outweighs the minor issues with this phone.  Every generation gets better, and the features on this particular phone make it more than worth the cash.  This phone rocks, which is what I expect from Sanyo!  Enjoy!", "Date": "August 22, 2004"}, {"Title": "Recommended for EVERYONE!", "Author": "Paul Armstrong", "ReviewID": "R340K741DEIC0Z", "Overall": "5.0", "Content": "I don't have this audio problem that people are complaining about. The only time I have a problem is when the person I'm talking to has a bad phone or poor service. Perhaps there were some bad shipments?This is my second review for this phone because I've had it for about a month now, I just want to point out a bunch of observations.Pros:-Again, the pictures of this phone do not do it justice. The color is more of a shiny cobalt, dark red, and silver instead of that flat color/white that these pictures show. I'm sure the same goes for the other colors.-LOUD! The speaker on the outside is the ringer instead of the earpiece. I've had a lot of trouble with past phones and other people complain about how they never hear their phone ring. If you turn the volume up on this you will always hear it.-External color LCD is a nice touch, especially when someone with a photo assigned calls.-Camera takes good quality pictures, even though camera phones are mostly pointless.-Side buttons are set in nicely so they don't get pressed very easily.-Normal button layout. Nokia thinks they are innovative by making the numbers in different layouts, but really it is just annoying and always will mess you up, no matter how long you have your phone.-Buttons inside are smooth and the screen doesn't get imprints from them. I've heard of this happening on other phones, but never this one.-Settings, after settings, after settings. There are a lot of options that you are able to set on this phone.-Phonebook will remember which number to default calling to (home, mobile, work) by pressing left right when you are hovering over the name.-I find myself turning the volume down when having conversations with people because it is often loud enough in normal mode to use it as a speakerphone.-Lightweight-1 Beep volume setting is nice. It is not disruptive and you will still know that you are getting a call.-Click-locks open/closed. This is not one of those phones that just randomly falls open all the time. Only problem is, I like the clicking and I open and close it constantly. It is okay though, because there is no sign of wearing out!-Voice services are great. Voice ring-tones can let you know who is calling audibly.-White LED by camera is great when you are in the dark. Just hold down a volume button while the phone is closed for the light to come on. I use it plenty.Cons:-Probably not bad, but annoying, that the lid, only when closed, is a tiny bit jiggly.-Can't turn down the ringer volume without opening the phone up.-Soft keys (bottom of screen buttons) are always Memo and Web, can't change them. I actually wish that they could be hidden.-Number keys are hard to locate when you aren't looking or going through recorded caller systems. I always have to look to make sure I press the right buttons.-Casing is smooth and shiny and constantly full of fingerprints and smudges.-I don't like the menu system style and graphics, but that's all personal preference (from a designer perspective).-The volume buttons are hard to press during a call. It takes some getting used to with your ring-finger.-Unable to sync to my Mac.-Talk time is pretty low. 80 minutes.-No pre-installed games.Overall though, I recommend this phone to everyone. It has durability, style, and features that will please everyone. I wouldn't believe the people who say the audio quality is bad, mine is great. The external speaker and color LCD give this phone a bit more functionality and class than other phones. Be cool, stay in school... and buy this phone!", "Date": "December 14, 2004"}, {"Title": "Nice phone lacks a couple features", "Author": "Jeff", "ReviewID": "RGFTXKE5J0O1V", "Overall": "4.0", "Content": "I purchased this phone in July 2004. I previously had a Sanyo 5150 and other Samsung phones. This phone is simple to operate has great reception and has many other nice features, especially the speakerphone.There are three annoying things that I have found with the  PM-8200.1. Earpiece sound is poor, especially at higher volumes it really sounds like an AM radio from the 60's. (my Sanyo SCP-5150 sounded like a landline phone)2. The speakerphone is nice, however it is really just okay to be on hold or for dialing and not to have a conversation.  I always hear \"are you there?\" and am told that the sound comes in broken words.3. The camera is average at best and if you use the highest quality setting which is a little better you get very few pictures.  Overall, I am pleased with the phone and would recommend it. You can't have everything.", "Date": "September 15, 2004"}, {"Title": "Best Phone Ever", "Author": "Chyna White", "ReviewID": "RNDJMSK2H3PU8", "Overall": "5.0", "Content": "I have had 9 different Sprint phones in a little over two years and 8 of those phones were between January 2004 and October 2004.  The first was a LG, the next 7 were Samsungs and the 9th and final is the Sanyo 8200.  This is the best phone I've ever had.  Sometimes, Sprint's service is crappy, but this phone is great.  It's the only Sprint phone that I would recommend.  Get either color, silver, red or blue and you won't be disappointed.  Just stay away from a Samsung phone, especially the VGA 620 and VGA 1000.  Just go with this phone.  It has great sound, takes great pictures and the speaker phone and ready link make talking so much easier.", "Date": "October 21, 2004"}, {"Title": "All this and its a cell phone too...", "Author": "Philip Locke", "ReviewID": "RSRA72DRY0TKH", "Overall": "5.0", "Content": "the Sanyo PM-8200 is a powerful business tool.  You can surf the web for map quest directions, collect your email, view your IP cameras and basically just about anything else you would do with your laptop.The camera on this phone is excellent, it has three resolution settings and even a digital zoom feature. I am an electrical contractor in Atlanta, Georgia.  All of our electricains in the field have these phones, should one of them have a question they simply take a photo and either email it to me at our office or send it to my phone.  We also use the camera feature for estimating.The \"Ready Link\"(Radio)feature, much like that of Nextel's \"Direct Connect\", is outstanding, however, unlike Nextel, you will be hard pressed to find yourself without signal.  Sprint's coverage in Atlanta is excellent. I rarely drop a call.The Sanyo PM-8200 is by far the best cell phone/tool our company has ever provided for its employees and Sprint is a very customer service minded company.  I would reccomend this phone and Sprint to anyone considering changing cell providers and/or upgrading equipment.", "Date": "July 10, 2004"}, {"Title": "The best PCS phone got even better", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R1SXFKMDHLGQ4C", "Overall": "5.0", "Content": "The last PCS cell phone I owned was the venerable SCP-8100 from Sanyo.  It was a cute little phone that was the second cell phone from any U.S. carrier that could take pictures.  (The first-ever model was the SCP-5300 also from Sanyo, released in July 2002.)  The PM-8200 addressed two shortcoming of the 8100: 1) camera quality, and 2) speakerphone.The 8200 sports a higher-resolution built-in camera.  Picture quality is also improved.  The old 8100's pictures often had streaks and distorted colors.  The 8200's pictures look much better.  The speakerphone is definitely a great addition for those of us who like to multi-task yet dislike headsets.  The volume and clarity could be a little better, but given the compact size of this phone, it's not bad.Reception on the 8200 is great, thanks to its external antenna.  Battery life is good, unless you save a lot of things in memory, which depletes battery faster the more stuff it holds.  The phone is attractive and can be customized in many ways, not to mention it comes in three colors.  To Sanyo, I suggest you use the iPod Mini color scheme, because not many people like big red!In summary, the 8200 delivers lots of improvements over the already-excellent 8100.  If you have Sprint or plan to get Sprint, this is the phone.  If you want video recording, check out the Toshiba phone for Sprint.", "Date": "August 19, 2004"}, {"Title": "grrrrrrrr", "Author": "Daniela", "ReviewID": "R2G720ZLGDRFZL", "Overall": "2.0", "Content": "I'm glad that so many people have a great time with this phone and I must admit I loved it as well, until about 6 months after I bought it.  I am VERY careful with my phones, usually keeping them in great condition for years and one day I open the phone and the circular bar, where the flip front rotates, cracks.  Of course, dealing with sprint, they are not to blame, and the manufacturer is not to blame.  Apparently, I am to blame, and as my punishment, there is no one that I can even pay to fix it and I was informed that I would have to buy a new phone.Well, I don't like when people tell me I HAVE to do something, so I decided I would deal with the crack until it was completely broken.  About 2 weeks later, the phone decides to stop responding to the charger after 5 minutes or so, so I wake up and take my phone to work and have it for about an hour without touching it before the low battery warning comes on.I hope that I just got a bad phone and they can do something with it down at the sprint store, but I noticed some of these problems creeping up pretty often, especially the charger.  (Of course Sprint told me they don't have any of these listed as a common problem with the phone... Thank you Amazon reviewers!!!)Good luck with yours, but I'd do a little more research unless you want to spend your days on hold and/or screaming at Sprint supervisors (one of which made me cry), or writing bad reviews on Amazon.", "Date": "July 7, 2005"}, {"Title": "Solid mid-end phone", "Author": "Chris Lee", "ReviewID": "R1YWOWKYEP0NSW", "Overall": "5.0", "Content": "This represents a mid-end phone.  But it has everything I was looking for in a cell phone:* Great reception and voice clarity.  I had Verizon Wireless before and wasn't happy with voice clarity as people always sounded robotic.  The Sanyo phone gives good, crisp clarity on the Sprint network.* Camera with flash.  OK the flash is a bit of a joke, but it does help a bit when you are in a bar.* Speakerphone.  Finally I have a cell phone with speakerphone!  It's just so cool.* Color LCD inside and out.  I love having a \"sub LCD\" on the flip cover so I can see who's calling, esp. when I have a picture ID for the caller.* Can play streaming videos from Sprint.  I tried the free Vision service for two months.  It was fun, but for me, not really worth the extra cost.  Streaming video was a lot of fun, though.* For those who care, you get walkie talkie service called Ready Link.  Expensive monthly fee, though.Here you have it, a high quality, high fun factor phone for a great price.  I love it.  I'm getting another one for my family.", "Date": "August 30, 2004"}, {"Title": "Great phone so far...", "Author": "Ian Michael \"Big Man of the Burgh\"", "ReviewID": "R1II838N2IG8E9", "Overall": "5.0", "Content": "I've had this phone for about a year and I haven't had the slightest of problems with it.  I've just read several reviews about it and I was shocked to see that a couple people said they couldn't hear during their conversations.  For me it's quite the opposite.The ear volume is very high and the speakerphone is almost deafening.  Also the durability of this phone is terrific, so far anyway.  I've made a habit of dropping this phone on the concrete after getting out of the car with it on my lap, but no problems at all so far.This is a great phone in my experiences, great features, speakerphone, easy internet use, downloading, and great reception. The only downside I see in this phone is Sprint's \"taxes, surcharges, and fees,\" which can add up pretty fast(I have no idea how), but I think every phone company finds extra ways to charge you.  As far as the phone goes, Excellent!", "Date": "February 17, 2006"}, {"Title": "Great phone!", "Author": "Koko Queen", "ReviewID": "R2IN6V54YKBRUC", "Overall": "4.0", "Content": "I have been with Sprint for almost 2 years now and have had 3 different phones.  Out of the 3 I have to say that the Sanyo 8200 is the best.  I love the screen call feature.  I've read the other reviews and alot of people complained about the audio quality.  I haven't had that problem.  Now, I just recently had to get a replacement under the warranty because the vibrate did not work but other than that, I think the phone is great. I love the design of the phone, its compact and light and comes in 4 different colors.  I orginally wanted the red but went with silver only because at the time the Sprint store that I purchased the phone from did not have the red one in stock. Im thinking about upgrading though.  I never keep cells phone for a really long time.  If something new comes out and I like it, I usually buy it.  I like the new Sanyo 5600 but Im not keen on spending $500 for a cell phone.  I think I may just settle for the Sanyo MM 7400.", "Date": "May 21, 2005"}, {"Title": "Sanyo, what were you thinking?", "Author": "G. Perrotta \"SGP\"", "ReviewID": "R3DW2541NOJRRC", "Overall": "1.0", "Content": "All the gadgets in the world can't hide the fact that this phone sounds horrible. I first thought it might be a bad phone, so I exchanged it. Guess what? It's the same for all of the 8200's. I love the reception but if you can't understand the person on the other end what's the point? It's like owning pretty car but it it can't shift into drive. Stay away from this phone.", "Date": "April 24, 2005"}, {"Title": "mixed bag", "Author": "trekkergal", "ReviewID": "RURLSDT3RCB74", "Overall": "3.0", "Content": "I fell in love with this phone at the store: great design, great features, great camera, I was psyched.  Then I started using the phone - the WORST audio quality!  Everyone who calls me sounds like they're coming through a train terminal PA system.  The static is in the phone, it's not the reception.  I'm still using this phone because I still love the design, but just know you're buying a phone with terrible audio.", "Date": "March 19, 2005"}, {"Title": "The Sanyo PM-8200  a very sophisticated unit indeed", "Author": "Will D. \"Chronaut\"", "ReviewID": "R350ZP1WHS247N", "Overall": "5.0", "Content": "I used the Sanyo-8100 for a time, then I got a virus and my Sanyo 8100 died. So under my phone insurance policy through Sprint I got the PM-8200 as a replacemt, all in all it's been a really good performer. The only difference between the 8100 and 8200 are, the 8200 has a speaker phone, better java engine, a slim form factor design, and the antenna is slender, compared the reception of the 8100 unit, it's a little weaker. But still a great phone nonetheless. I wouldn't hesitate to recommend it to any friend or family member of mine.", "Date": "November 26, 2004"}, {"Title": "I love this phone!", "Author": "Amazon Customer", "ReviewID": "R1C7MMFKDE5XXZ", "Overall": "5.0", "Content": "I recently upgraded to this phone after having a Samsung A500 (which was a great phone) for 2 years.Obviously, the main reason I wanted this phone was the camera.However, the reception is better than my A500, the external color display is awesome.I like the speakerphone feature because now I don't have to pay $20 for a hands-free device.Some of the ringers really need to be replaced. That was the only thing that was disappointing to me. The A500 had some great ringtones. If you like to give your friends distinct ringtones, you're going to want to either buy some from Sprint or download some from the Internet.I also have a little polar bear animation on mine that I think is just adorable.And when I called Sprint to change over from my old phone to my new phone, the customer service rep even helped me change plans to save me about $15 a month in overcharges!", "Date": "September 19, 2004"}, {"Title": "Very disappointed...", "Author": "Ann", "ReviewID": "R3UU53FSQQMQU2", "Overall": "1.0", "Content": "I purchased my Sanyo 8200, and Qwest service, 13 months ago.  Over the last few weeks I've experienced these SAME issues others mention here (I came online to find a replacement phone and then I began reading the reviews).  How it never keeps a charge, the beeping when the charging pin is in as if it is being plugged and unplugged, starting a call with a \"full\" batterly then the phone dieing after 20 minutes because the battery is dead.  I was baffled and called for service, and they said perhaps it was exposed to humidity (I live in the desert) or perhaps I carried it too close to my body and it was exposed to  moisture (huh?).My warranty was up 3 weeks before I called, so they wont replace it, I have to buy another at retail.  I had my last phone, a Kyocera, for over 5 years and NEVER had a problem.For such an expensive phone, you would think it could last more than a year.A big thumbs down.", "Date": "April 7, 2006"}, {"Title": "PURE QUALITY SANYO PM-8200", "Author": "Debbie Amditis", "ReviewID": "R22XU8078X4EKR", "Overall": "5.0", "Content": "I was not out looking for a Sanyo but when I saw and read about the features promised I had to find it. Sprint was great at the store, and the phone sold itself. You can tell by simply feeling the hinges and seeing the screws they used this was no Motorola that would fall apart after a month. After 5 months I am still finding services that this phone offers to the user.I love it, I just bought another for my wife last week.", "Date": "September 15, 2004"}, {"Title": "Sanyo Picture Phone Opinion", "Author": "Nicole \"Nikki\"", "ReviewID": "R2P8Q0VQ1BV0RF", "Overall": "4.0", "Content": "I owned this phone for 4 months. It was a great phone. It does not look durable but I put this phone through a lot and it held up great. I have dropped the phone, it has been thrown, split apart...and it just keeps on working. It's a little expensive, but let's face almost all the phones are. This is a great phone. I will say however, the reason why I only owned this phone for 4 months was because it accidentally got put through the washing machine. This phone is so durable that even after that, it still shows all its color and takes pictures, it unfortunately is irrepairable, but I'm still hoping it comes back to me because I really liked the features and I thought the contact list was very accessable. I would definately reccommend this phone, especially to someone who is tough on their phones like I am because this one will definately hold up. I would reccomend getting a case for it though, only to preserve it superficially and keep it looking good but it will definately last a long time. The camera on the phone is good quality. It comes with lots of different ringers so you are not forced to pay to download others. The phone just has really good features, a lot of them unnecessary, but gratuitous. I have owned many cell phones and this is by far my favorite. Its a great size too. Light and takes up small space so it fits great in a purse or a pocket. My favorite feature, one of the more gratuitous ones I was talking about, is that it comes with a \"buddy\". Its a little cartoon bear that does dancing ans stuff across the screen of your phone.All-in-all, most durable and reliable and accessible for the money, unless you plan on running it through the spin cycle-it is not waterproof.", "Date": "August 15, 2004"}, {"Title": "Bad Charger + Bad Sound = Bad Phone", "Author": "Robert Cianchetti", "ReviewID": "R213L20N09UY0T", "Overall": "1.0", "Content": "I've had this phone for a little over 6 months now and as a lot of others have said, my charger is on the blink. I will plug the phone in and all night just listen to it beep on (charging) and beep off (not charging). No matter how I position the plug it doesn't seem to help.Another thing that I noticed from day 1 is that the sound is not good at all. I would actually get into arguements about the bad quality of the phones others were using to call me before I finally realized that it was my phone that was causing the issues. I find that the only way I can hear people in a place that has any noise around them without it being muffled is by turning the volume all the way down on my phone... but then I have to strain to hear what they're saying (lose lose situation).I always keep my phones in very good condition and because of that am pretty dissapointed about the problems I've been dealing with, especially with the charger -- those constant beeps are SO annoying.Because of these irritants I would def NOT recommend this phone to anyone... There must be other better models out there somewhere.", "Date": "October 30, 2005"}, {"Title": "the phone came broken or damaged", "Author": "apolinar", "ReviewID": "RBXIWCTL0GH1E", "Overall": "1.0", "Content": "because, after be waiting for the phone for 2 weeks  the phone  was broken when I got it.so please let me know if I can return the phone .", "Date": "November 16, 2013"}, {"Title": "What happened???", "Author": "James D. Mckinney", "ReviewID": "R3HCFLZHLW7QEE", "Overall": "1.0", "Content": "I first bought this phone right off the line (3 days after it was put in stores) For 4 months it was the best phone i have ever had. decent quality in pictures, advanced text messaging (text messages came direct to my phone rather than me logging into a site to get them) and the speaker phone made talking a little easier when i needed full movement of my head to see what was around me (IE. driving, walking etc.)But the biggest thing that seems to plague the new sanyo picture and video phones is the place you plug into the phone to charge the phone. WHAT HAPPENED?? Only four months into owning this and i have to jimmy the phone so that i can just charge the battery. And i am not the only one who has this problem. Many of the guys i work with are sprint users and have this exact phone or one similar and have the same problems as i do. This major defect makes this phone a bad sale. i mean how can you use the features if you can't get power to the phone. Sanyo needs to find a way to fix this, and then this phone type will once again be the ace it was when i first bought it.", "Date": "March 3, 2005"}, {"Title": "Sanyo 8200", "Author": "T Warr \"T\"", "ReviewID": "R38AN799HN2OLG", "Overall": "1.0", "Content": "The Sanyo 8200 has multiple known issues. Including extraordinarily poor sound quality, charging issues, and hinge breakage.I bought two for my wife and I nine months ago (from Sprint). The hinge broke on my wifes phone after about 5 months and she had it replaced at an independant cell dealer. Then she started having the infamous charging problem and took the phone into Sprint to have it checked out. When the tech flipped the phone open, the hinge broke AGAIN. This should have been great evidence for a warranty replacement right? Wrong. The tech still refused to repair the phone and apologized for breaking it. for the charging problen, he said the 8200 has defective connections for the round charger receptacle and suggested buying a flat type charger, which she did. This has apparently addressed the charging issue.In the last week or so now my phone is not working. At first the \"Back\" button didn't work. The next day none of the buttons on the right side of the phone worked. Now NONE of the buttons work.This phone has serious quality issues that Sprint refuses to address or even officially acknowledge.Sprint does have great calling plans with the free roaming, even on other networks (you have to sign up for it), I just have a major problem with the Sanyo phones and repair customer service.These are our 6th and 7th phones and while these are the first flip phones for us, we have NEVER had a phone break before.", "Date": "February 25, 2006"}, {"Title": "Not horrible, but I wouldn't recommend it!", "Author": "J. L. Trimmer", "ReviewID": "R2EJL2B0G3XQ2", "Overall": "2.0", "Content": "I have had this phone for about 9 months.  I never really had any problems with the phone such as reception or battery life.  Actually, I was sort of surprised at how long I could go without charging.  Speakerphone always sounded clear on my end, but occasionally the other person was unable to hear me clearly.  The camera is fairly easy to use.  My problems with the phone have just recently begun.  The first thing to happen was that the END button stopped working completely and I could not end calls, a big problem when you weren't planning to leave a voicemail!  The only other option was to close the phone to end calls.  Shortly after that, the phone couldn't recognize it was closed.  It thought it was always OPEN!  I couldn't see who was calling from the external screen and at times, the phone would answer itself.  More recently, my TALK button has been shorting out, as well as the OK button.  Sprint is willing to offer a replacement phone for $35 or a new keypad for about the same.  I am stuck with this phone until I'm eligible for a free phone or I can switch carriers altogether.  Choose wisely!", "Date": "October 13, 2006"}, {"Title": "Can't Hear", "Author": "hershy", "ReviewID": "R2NARIP2P3RLOH", "Overall": "2.0", "Content": "Like everyone said before, I bought this for all the features and the great battery life.  All those have delivered except I feel like the battery doesn't last that long anymore AND the charger that they provide starts to \"get loose\" and stops charging the phone correctly after a while and you have to get the alternative charger for the phone.  This phone gets great reception and I get reception in places that most other people don't...ONLY ONE PROBLEM....... YOU CAN'T HEAR WHAT PEOPLE ARE SAYING TO YOU!  The speaker in the earpiece of this phone is terrible.  I thought it was me at first.  I thought that it was the OTHER person's cell phone because how could it be mine if I had full reception bars?  Well it is the phone.  The speaker is simply a piece of junk.  Hopefully Sanyo will correct it with future phones because I really do like everything else about the phone.  I gave it 2 stars though because the basic function of the phone is obviously the most important thing and that is seriously lacking.", "Date": "June 3, 2005"}, {"Title": "Horrible sound quality.  Stay away!", "Author": "Michael Schout", "ReviewID": "R1APZ3CQFI440N", "Overall": "1.0", "Content": "I have had this phone for almost a year now, and although the signal reception is great, the sound quality on this phone is HORRIBLE!  I have to ask the person calling me to repeat themselves at least once every call because the voice quality is so muddy.  My wife has a different (and cheaper) phone and it sounds MUCH better.  The only reason I have put up with it this long is I do not use my phone very often.  I would not recommend this phone to anyone.  This phone sounds worse than any other phone I have owned.  Stay away from this phone!!!", "Date": "June 7, 2006"}, {"Title": "TOO Bad - NOT worth it", "Author": "Ram \"ram\"", "ReviewID": "R2W08NABL2U1NF", "Overall": "1.0", "Content": "Well, I was very happy with the phone when i first bought in about a year back. Not anymore.. I bought 2 of these for myself and another for my family. I even recommended this phone to a couple of my friends, but now everyone of us face the same issues. But neither Sprint or Sanyo wants to acknowledge that there is a problem with the phone.- the pin type charger does not work - the battery charge indicator is one BIG lie - just after 2 minutes the battery indicators shows full charge but in about 5 mins the LOW battery alert is up.Whenever i try to charge, i hear beeps as if i am plugging and unpluging the charger.. But the phone does not charge(although the battery indicator shows full charge).", "Date": "March 24, 2006"}, {"Title": "any cell phone will not do", "Author": "insight4u \"insight4u\"", "ReviewID": "R3Q4N8SKK64D0", "Overall": "3.0", "Content": "I purchased the Sanyo 8200 today, through an upgrade option with sprint. First, let me say that I have been with Sprint for approx. 5 years, and I can't tell you why, as Sprint does not have the best customer service, but they do have fairly decent coverage. (They did give me 750 any time minutes and 50 roaming minutes for free to stay with them.) I had switched briefly to T-Mobile and had purchased the Motorola V600, which has one bar better signal strength than the Sanyo 8200, and the V600 is a kick a-- phone. I switched back to Sprint due to the fact that T-Mobile does NOT have the coverage area that Sprint does. OK, so you want to know what I think of the 8200.........................it's ok. Had I never laid my hand on the Motorola V600, I wouldn't know any better. The signal strength is ok, the pic quality is ok, the menu is ok.........I am considering going back to the Sprint store and looking for soemthing that looks a bit nicer and has a better signal. I also am having trouble accessing the web from this phone................not sure why as of yet, but something to consider if you are seriously into downloading, surfing...etc..Good luck!", "Date": "September 9, 2004"}, {"Title": "Good at first...", "Author": "smsteffy", "ReviewID": "R178ZI903TWNTM", "Overall": "3.0", "Content": "I was pretty happy with it at first, light, good looking. The problem is that the sound is really not good and it lacks a lot of the features that I loved on my previous Samsungs. For example you can't scroll down to the previous numbers you called after you hit \"talk\", it only keeps the last one, so you have to go into the menu the look for the outgoing calls... not convenient. On my 3 previous Samsungs, I also liked the fact that I could stop the ring when I received a call. So for example I would hit any side button and the ring would stop, then I could take it out of my purse and answer without eveybody noticing me. I find the menu also a little messy.In other words, I am going to return this one and buy a new Samsung!", "Date": "October 1, 2004"}, {"Title": "Will not Charge!", "Author": "Douglas G. Green \"Blessed Dad\"", "ReviewID": "R3SYRWM3247QO5", "Overall": "1.0", "Content": "Had this phone a little over a year, same problem as everyone else. Won't charge. Shows charged, but then make one call and it is dead.", "Date": "August 19, 2006"}, {"Title": "Cracked circular bar.......", "Author": "Natasha", "ReviewID": "R3T5NG0BOYBRT9", "Overall": "2.0", "Content": "I have exactly the same problem Daniela had. The circular bar has cracked after one year. I was always VERY CAREFUL with the phone, never dropped it.I would not recommend this phone to anyone.", "Date": "July 25, 2005"}, {"Title": "Yet another charging/battery issue for the sanyo 8200", "Author": "blondeblacksheep", "ReviewID": "R2I6WBTXDE8QWM", "Overall": "3.0", "Content": "I have had my 8200 for a little more than a year, and generally I liked it, but after owning it for about 6 months, I started having problems keeping it charged.  The charge wouldn't hold at all, and the phone would say the charging was complete when it couldn't even power up.  I went to Sprint for help, but after three hours of diagnostic testing, the store manager gave it back to me and said there was nothing wrong with it!  She said I was to go buy a ANOTHER charger (to the tune of $50) and that would solve the problem.  It did for a while, but after another couple of months it is happening again.  I will be heading to the Sprint store this morning on the off chance that they will care.  I went last night, but I discovered when I got there that they now close at 6:00 pm instead of 8:00 pm.  Thanks for the  @*%#$!+ support, Sprint!", "Date": "May 23, 2006"}, {"Title": "it's cool and compact", "Author": "V. M. REDDY \"Best Book Buys\"", "ReviewID": "R1TGPJR9HK37CC", "Overall": "5.0", "Content": "lot of nice features in this compact phone. Only draw back is the speaker phone quality(average).", "Date": "October 10, 2004"}, {"Title": "Lacks basic functions, great for everything else.", "Author": "Adrian Ortega \"Adrian\"", "ReviewID": "R3D71PD9D7Y1MA", "Overall": "3.0", "Content": "This is a good phone with many features. It does well in all areas except for the basic function of having a conversation. It will connect almost every time a call is placed, and a call is almost never dropped. The problem is you cannot hear what the person is saying. When the volume is as high as it goes you cannot hear because it is scratchy and you dont get the persons voice. When the volume is as low as it goes you can hear the persons voice clearly, but it is so low that you cannot fully hear what they are saying. The people I have called say that they hear me perfectly..The speakerphone is good and can be pretty loud. It is not perfect though. It is a small speaker, not a large speaker so the sounds isn't as good. Though it sounds well for the size of the speaker.The phone does use alot of power. One average my phone only lasts about 36 hours making one 10 minute call.This is my second model of this phone i have owned because the last one i had stopped charging. I do not know if it was the phone or the charger, but it stopped charging. Thankfully i had purchased insurance for four dollars a month and they replaced it. I highly recommend getting insurance with this phone because theh phone costs 250 dollars. Four dollars a month (in my case) is nothing to make sure that if it brakes i dont have to pay another 250 dollars.This phone has many features, it really makes you think of seven years ago when cellular phones only had an address book. It's main feature is the camera. The camera works well, but in high resalution (sp) it can only take 27 pictures. In low resalution it can take well over 120, but there is drastic difference in the quality. It has frames you can use, and also has multiple color modes. Sepia, Negative and Black and White are just a few. It can take up to 8 shots in a row.This phone also includes voice memos and call screening. It has internet which doesn't work well with low service areas. I recomend at least \"two bars\" when using internet. It has text messages and it can send and recieve. It also lets you create personal folders. It almost always will send and/or recieve a message even in low service areas.I give this phone 3 stars because it lacks the main purpose of a phone which is calling, but it does have many features. It is a great phone and very fun..I do recommend insurance though.", "Date": "July 10, 2005"}, {"Title": "Don't buy this piece of ##$$%% phone", "Author": "Lydia D. Pellecer \"cell phone user\"", "ReviewID": "RIHFLGKIFNGS2", "Overall": "1.0", "Content": "I bought 2 of these phones over a year ago at CostcoSame problem as everyone else.It won't hold a charge and the pin charger won't make a good connection!!  And suprise suprise the problems started at the same exact time!I haven't even called Sprint yet and now I am completely discouraged after reading a few reviews here.It sounds like we are all stuck with these lame phones that obviously all have the same problem with charging.", "Date": "April 28, 2006"}, {"Title": "Just barely okay", "Author": "Cristin L. Frazer", "ReviewID": "R3EG3OI4V8WB4I", "Overall": "2.0", "Content": "When my wife and I first got the phones on a promotional deal that sprint was offering I was very impressed.  The phone looked good, was very easy to use and had a wide variety of functions.  Due to all this I was willing to overlook the fact that sometimes it was a little hard to hear people you were talking to and that the battery got really hot when you were talking.Everything was going great for about the first year, then my wife calls me at work telling me that her phone was acting funny.  She tells me that its like her phone is automaticaly unplugging itself at the rate of about a billion times a second.  I thought that was wierd so we went down to Sprint.  They told us it was a common problem and that all we had to do was buy a flat charger.  In my quiet subtle manor (yeah right) i persuaded the guy behind the desk trade us the charger that didn't work for one that would.  He agreed.  That solved all the problems for a while until mine started doing the same thing.  Since I didn't think the guy at the Sprint store would be pleased to see me again my wife and I have just been sharing a charger.  After the case on my wifes phone cracked after a fall onto linolium from about three feet she finally had enough and went and bought a new phone.  I'm hanging in there with mine just to see how far I can milk life out of it.  So far the End and Back button have stopped working, it wont charge (even though it will tell you its full after only being on he charger for a second) the antenna wont extend anymore, it usually sends text messages three or four times in a row, to the joy of anyone receiving a text from me, the camera has stopped working, and the paint is coming off in many places.Ive had the phone 14 months.", "Date": "April 23, 2006"}, {"Title": "Piece of Junk", "Author": "grimmy", "ReviewID": "R1KYAVKQLCZRXL", "Overall": "1.0", "Content": "I've had this phone for just a little over a year.  First problem i've had was the charger input going bad on the phone.  I took it to the sprint store and the manager told me this was a known \"defect\" with this phone.. so why are they still selling it?? so they replaced my charger with the different style.. great.. but that didn't help that fact that I had a 30 dollar car charger that was now useless that they wouldn't replace2nd issue, which has just gotten worse as of today. the hinge is almost completely broke, its now broke on both sides. therefore my phone thinks its open when its not allowing my backlight to come on and draining my battery, furthermore.. when it is open, it goes back way to far and makes it uncomfortable to use.. now.. i've read a bunch of other reviews on the internet about other people having the same problem with this phone. but not only that, my coworker had the same phone and had to replace his due  to the fact that his was so bad his phone thought it was always open, also one of my best friends who lives on the other side of the country and HIS friend have the SAME problem.. there is something wrong with the design and sanyo should be replacing these.. DONT BUY THIS PHONE. what a waste of money!!!!", "Date": "May 4, 2006"}, {"Title": "The reasons Why Sprint Nextel are the best!", "Author": "..R.. \"..R..\"", "ReviewID": "R29KQHCECRC4QR", "Overall": "5.0", "Content": "Sprint in my opinion the best wireless carrier out their. It is odd that they merged with Nextel, because they are my second favorite.Sprint's native network reaches over 250 Million POP. That, with the roaming, their network reaches 290(Digital only phones) or 295(Digital and analog phones) people. that makes it the largest Wireless network in the USA.You get to roam on Verizon's, ALLTEL's, ect networks for free as well.Sprint only offers Unlimited data plans. They offer them for both their Visions and Power Visions access. Prices range from $10 to $25. $25 being the Unlimited Power Visions (EV-DO) access with all of the Sprint TV channels and some Sirius satellite radio, along with other streaming radio channels. Other content can be added, but you would need to check the list. They are always adding new things.Sprint is the only carrier that will let you use your Smart-Device like a Treo 650 with the unlimited Handset data plans. So with Sprint you can use the Unlimited Data on your Treo 650 for $10 a month. Both Verizon and Cingular charge $45 a month for this. T-Mobile $20.They also allow their customers to use their phones as modems, with moderate use. Other carriers either do not have this feature, or have it shut off.Sprint has also added Free Incoming plans to their Fair & Flexible plans. These are plans that keep adding new minutes to your plan, as you go over your bucket.this keeps you from paying 45 to 60 cents a minute in overages. Also keep in mind that other carriers charge roaming and long distance fee's on top of the overage fees. So you can be paying into the $2 dollar a minute range for going over your plan minutes. T-Mobile USA is notorious for this. You pay a fee for the overage minutes, a fee for the long distance, and a fee if roaming. T-Mobile USA's network is pretty small, so you could roaming easily.Another thought to throw around. Is Sprint uses 1900MHz signals for their CDMA/EV-DO coverage. They are also building out their 800MHz coverage with the licenses acquired from Nextel. Since 1900MHz needs more towers to cover a given area, this allows your phone to have more tower choices to choose from.This also increases Internet speeds, because speeds drop with distance.So I have found Sprint's data speeds to be faster then Verizon's. And Much faster then Cingular's and T-Mobile's Internet speeds.Sprint also uses Lockline for their replacement insurance provider. They cover Any phone on your account, purchased from Anywhere, no matter if it is New or Used. Other carriers insurance providers only cover new phones purchased from the carrier.I could go on and on, but just take this into consideration before choosing another carrier just based on a commercial. Or the bucket of minutes they \"Claim\" they are going to provide you. Minutes don't mean a thing if the network is not dependable and the calls sound like crap.Also keep in mind that Sprint uses CDMA, which is the same network technology Verizon uses. CDMA is the most efficient network technology.Check out [...]and[...] for more info.", "Date": "December 18, 2005"}, {"Title": "What?  Huh?", "Author": "Joel Goodson \"joelgoodsn\"", "ReviewID": "R1E7NGBJJU7IAK", "Overall": "1.0", "Content": "All the good stuff you've read about this phone is true.  I have only one issue with this phone.  I have trouble understanding the other person.  Especially when there is any kind of background noise.  I read all the reviews and figured the people complaining about the sound quality were probably using the wrong end.  I really wanted to like this phone.Unfotunately, being unable to hear and understand the person on the other end is a deal breaker.  Perhaps I just got a bad phone.  I'm going to exchange.", "Date": "January 18, 2005"}, {"Title": "Great phone! Superb performance!", "Author": "Method2Madness \"Alex\"", "ReviewID": "R2MIEVCNGYI96M", "Overall": "5.0", "Content": "I have had this phone going on a year now and can faithfully say that I have very few complaints!! First of all the phone has NEVER and I mean NEVER failed me! This will be the 5th Sanyo I have owned, starting with the faithful 4500, and have never been let down. I have seen numerous complaints about sound quality, but short of the volume being a little low on occasion, I cannot see too much fault. The speakerphone is only half-duplex, but most cell phone speakerphones are only HD at the moment. Also you cannot expect board room sound out of a tiny micro-sized speaker! It does very well for its size. Ready link performance is top rate, as well. All in all another great Sanyo product!", "Date": "June 9, 2005"}, {"Title": "Disappointed", "Author": "EIS24 \"EIS24\"", "ReviewID": "RJ6WAZ6WCR6LS", "Overall": "2.0", "Content": "I've had my phone for a little over a year.  It gradually stopped taking charge from the pin charger that came with the phone, and would say it was full when the battery was completely empty!  It would beep to charge and then uncharge and at first it was ok, but it got so bad that it stopped charging at all!  I also have problems with redialing and calls being forwarded straight to voicemail and way too many lost calls.  The phone gets hot when talking on it for more than 20 minutes and it takes 2 minutes to open text messages and another few minutes to send them.  Half the time my friends don't even get the text messages I send, esp. if it is a reply message!  I have been to the Sprint Store only to be told that the phone is not defective if the other charging port works!  They tried to sell me the other type of charger, instead of using insurance exchange program...  Very disappointed with phone and service!!!", "Date": "May 3, 2006"}, {"Title": "BEST PHONE I EVER OWNED!", "Author": "FunkNMusic", "ReviewID": "R3ICO9J0FC80RN", "Overall": "5.0", "Content": "I have to tell you all that I am so impressed by this phone, it amazes me!  I am not easily amazed or overcome to write a review on anything.  But seeing this here is awesome and I just got off the little bugger (in a very good bugger way :)  The sanyo Silver SCP-8200 is one sturdy and reliable phone.  I am rough with the phone, I have dropped the phone at least 3 times already and I have been a klutz like that forever and since I have owned the phone almost 6 months now.  Not ONE SCRATCH, NOT ONE DROPPED CALL, NOTHING BUT GREATNESS FROM THIS EXCELLENT 100% PERFECT PHONE!  tHE SANYO PCS-8200, ALSO HAS AND DOES EVERYTHING FROM VOICE DIALING/2 way text messaging/ quick keys etc.... and a speakerphone and walkie talkie (READY LINK/R-LINK) THIS PHONE IS THE BGEST ON THE MARKET TODAY, I EVEN BOUGHT MY WIFE ONE AND SHE IS SO PLEASED WITH IT, SHE TAKES PICTURES OF EVERYONE IN HER PHONE BOOK AND ADDS A PICTURE TO THEIR NAMES SO WHEN THE PHONE RINGS IT SHOWS THEIR PICTURE ON ONE OF THE 2 SCREENS AND THEIR IS A CLOCK BUILT IN TO THE CAMERA PHONE EASILY VISIBLE AND DATE TOO ON MAIN AND SUB LCD SCREENS. SO I DO NOT LIKE THE SPECS ON THE PAGE THAT TOOK ME HERE.  THAT COULD MAKE SOMEONE PICK UP THIS NOKIA I HAD AND RETURNED BEFORE THIS PHONE.  HORRIBLE!  PLUS I DO LIKE MY KYOCERA FLIP PHONE ALSO, BUT IT JUST DOESN'T MATCH UP TO THIS ALL INCLUDED PCS VISION PICTURE PHONE/SANYO SPC-8200 SILVER (SPRINT AND QWEST) BOTH ARE MERGING BY THE WAY.DO YOURSELF A FAVOR AND GET THIS PHONE TODAY, YOU WILL HAVE A 15 DAY OR SO TRIAL PERIOD, SO I KNOW BY THEN YOU WILL HAVE PLAYED WITH EVERY SINGLE THING ON THE PHONE, TAKE PICTURES AND GREAT QUALITY TOO; BETTER THAN MY GATEWAY DIGITAL CAMERA.  THIS IS THEE ONLY PHONE TO BUY AND THE ONLY PHONE YOU WILL NEED FOR A LONG TIME.  RECOMMENDED HIGHLY THE  HIGHEST RANKING AND NOT EVEN A 2ND THOUGHT ON IT,  THE CALLS ARE SO CLEAR AND ALSO HAS A VOICE LEVELING FEATURE ON IT, CRYSTAL CLEAR CALLS AND NO DROPS.  I LOVE THIS PHONE!GOSH, I HOPE JUST ONE PERSON READS THIS AND GOES AND BUYS THIS PHONE, I KNOW HE OR SHE WILL BE AS X-STATIC AS I AM.  GOOD LUCK WITH A GREAT PHONE :O)ENJOY AS I HAVE AND WILL FOR MANY MANY MORE MONTHS EVEN YEARS AHEAD OF ME, TO COME.***A MUST OWN PHONE - HANDS DOWN TOTALLY AWESOME AND EVERY FEATURE THERE IS IN A PHONE LIKE I MENTIONED BEFORE IS ON THIS MODEL; SOOOO.....  WHATCHA WAITING FOR GO GET THIS PHONE \"NOW\"!\"*****\" 5 OUT OF 5 sTARS THE HIGHEST RANKING!!  THIS PHONE IS THE BEST~", "Date": "June 9, 2005"}, {"Title": "My Best Phone Yet", "Author": null, "ReviewID": "R2UXYXQPF1HS8X", "Overall": "5.0", "Content": "This phone has everything, the features, the excellent reception, the camera quality, the speakerphone, I mean what more can I say?", "Date": "May 21, 2004"}, {"Title": "This phone has connection problem", "Author": "Jing Liang", "ReviewID": "R7XND3KGQXD9D", "Overall": "2.0", "Content": "This phone will automatically turn off during talking or ringing. And the picture has problem also.", "Date": "October 11, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "PCS Vision Picture Phone Sanyo PM-8200 Silver (Sprint)", "ImgURL": "http://ecx.images-amazon.com/images/I/41YNHX28JML._SY300_.jpg", "ProductID": "B00023DRVO"}}