{"Reviews": [{"Title": "Not perfect, but there is nothing else in its class", "Author": "Martin Marshall", "ReviewID": "RS95AGR7BWVYO", "Overall": "4.0", "Content": "I have had this phone for over a year now.  As others have written, it does occasionally lock up, and it can be a little slow at times.However, I am amazed that there is still nothing that rivals it in terms of screen and keyboard size.  I don't even bother with the included email application, as the web browser is good enough for checking my gmail account.  (note that there is a gmail app, but it only works with normal gmail accounts and not \"Google Apps for your Domain\" accounts)There are a lot of phones out there with keyboards now, but none is as well designed.  And I don't think there are any phones with this many features that don't require an occasional reboot.Bottom line: for a screen that is adequate for web browsing, and a keyboard that is good enough to write long emails, in a package that looks like an ordinary phone until you open it up, and fits nicely in your pocket... there is no alternative.I would upgrade if there was an upgrade, but I am very happy with it.", "Date": "January 27, 2007"}, {"Title": "fantastic business phone", "Author": "hepresearch \"Patrick\"", "ReviewID": "R10FTEXHFTJ5QI", "Overall": "5.0", "Content": "I previously owned a T-Mobile Dash by HTC, which worked well and I liked it.  After crunching that one by accident, I decided to get an unlocked phone that seemed a bit more beefy.  I don't like Blackberries, so I decided to try the Nokia 9300.  It was discontinued by a couple years, but I still managed to find a brand new in the box North American version for a strongly discounted price.  I had an old Nokia bar phone a few years back, and that thing still works today, so the reliability is great for Nokia's based on that experience.The 9300 is honestly the best phone I have ever owned.  I have had it for five months now, and the Symbian 7.0 series 80 OS has never crashed, not even once, the entire time I have owned it; my Dash's Windows Mobile 6.0 OS used to crash every week, at least once a week.  The Dash could not take a call while working in a spreadsheet without freezing, but the 9300 seems to manage just fine.  The spacious 80 MB internal memory also seems to stand the Nokia in good stead.My Dash had a 1.3 Mpixel camera with video, and the Nokia has no camera.  This may seem like a drawback, but I honestly don't care; I never cared for cameras in phones to begin with.  The Dash has a full QWERTY keyboard crammed onto its lower front, while the 9300 has a gigantic inner keyboard that is more akin to a miniature laptop!  I love the keyboard on the 9300, and I doubt any other phone has such a one, except possibly the 9500...My T-Mobile service is decent, the customer service is outstanding, and I hardly ever drop calls.  When I had Cingular/AT&T; back in the day, my coverage was wider but I dropped so many calls that I couldn't really carry a long conversation.  I prefer the stability of T-Mobile calls to the wider coverage area of AT&T.;  T-Mobile was also willing to accept my unlocked phone on my service plan without extending my contract, and they do not require a contract if you provide your own unlocked phone; AT&T; requires you to enter an 18-month restriction even if you provide your own unlocked phone.  Also, T-Mobile's EDGE network is nearly three times faster in these parts than AT&T;'s.  I get almost 250 kbits/sec on T-Mo's EDGE, while AT&T;'s only got 100 kbits/sec tops in practice.  Also, the tethered modem capability is available with T-Mo's 19.99 data plan, while AT&T; will not include it unless you spend 65.00/mo on data alone.  So, I like T-Mobile for my 9300, and it works great...One funny thing about the 9300 is that there is no vibrating alert, but since I sit and type on it in meetings, I actually prefer not to have vibrating alert.  So it works out for me in a funny way.  It is as if somebody made this phone just for me.  It does great on everything.  Adobe Reader for Symbian does make a few errors on displaying pdf's once in a while, but everything else... email, internet, phone as modem, voice calls, display, calendar and alarm functions, applications, speakerphone, conference calls... everything else works beautifully.  The phone and the OS are not totally seamless, though; I think the phone and OS are not nearly as integrated as they were on my Windows Mobile smartphone, but I actually prefer them to be somewhat seperate.  Once again, somebody must have been thinking of me...The fact that this phone takes an MMC card instead of SD, miniSD or microSD was a little wierd, but I got a decent MMC card to go with it.  It will take up to a 2 GB MMC or MMC-Plus card, and since MMC cards will fit into SD readers, I have had no problems.  A nice touch is that the MMC slot allows for hot swapping.This phone has handily survived a couple of drops since I got it, and does not have any scratches, dents, marks, cracks, or otherwise as a result.  It has stood up to some nasty situations; getting rained on, sitting out in a hot car, falling onto a wooden floor, being attacked by my cat...  It takes a lick and keeps on ticking!Once again, a great phone by Nokia.  The nicest and best phone I have ever owned thus far...", "Date": "June 7, 2008"}, {"Title": "not totally unlocked", "Author": "the man in iraq \"The man in Iraq\"", "ReviewID": "RO0NQYIISHJ0Z", "Overall": "5.0", "Content": "i tried to use other sim cards from other countrys and it will not accept them only about two are three and they all are from the states.", "Date": "April 12, 2011"}, {"Title": "9300 Nokia", "Author": "Sanjay Hooda", "ReviewID": "R3KPU21IBPI5JC", "Overall": "4.0", "Content": "Awesome Product, i am fully satisfied with that nokia produce, i a, long time nokia product user, all though nokia realease this product much earlier but still it is worth.", "Date": "March 9, 2009"}, {"Title": "Unstable", "Author": "T. Loszewski \"Git r dun\"", "ReviewID": "RMRUG3I9OE7P1", "Overall": "2.0", "Content": "I have owned the phone for about 6 months now.  I talk about 3500 minutes a month, send and recieve about 20 emails a day.  The phone has a bunch of great capabilities and is ocassionaly a great work companion.  The wide screen is excellent for viewing.  The cpu functions work a little slow which could be expected from such a small package.  The frustrating part is the phone frequently works slow as well.  When it does calls are lost.  About once a week it is necessary to take out the battery and let it sit for a minute before turning the phone on.  The phone takes a couple minutes to turn on.  Overall, it seems slow and unstable which overshadows all of its great features.  Reminds me of Windows 98.", "Date": "December 17, 2006"}, {"Title": "Nokia 3300i - where is the predictive text?", "Author": "sad ex3300 user \"liza\"", "ReviewID": "RYJK73GQBLEBB", "Overall": "2.0", "Content": "This review is for a 9300i - the latest model - not listed. I bought this - very expensive- phone in the middle east, configured it to English UK and when I come to use predictive tect find that I get Arabic popping up.  The handbook clearly states there is a Dictionary in Options when writing Text.  There isnt.  Nor can I access predictive text by pressing the suggested key twice - as in other Nokia models.  My service agents have variously told me - 'It's ok - just use the computer keyboard'.  - 'It's not available on this phone' 'Yes this phone has predictive text'.- It has been to the main service agent here in Dubai only to be returned in an altered state - but no predictive text. I cannot contact a sensible person face to face to get the help I need.  NOKIA - get this sorted!  How many people come to Dubai and buy these treats only to get them home and find they have spent a lot of money and not got the bargain they had hoped for.", "Date": "March 20, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nU.S. version tri-band GSM cell phone compatible with 850/1800/1900 frequencies and EDGE data capabilities\nFlips open to reveal full QWERTY keyboard and widescreen display; 80 MB memory with MMC expansion\nBluetooth for handsfree devices; email with attachments, SMS, instant messaging, and MMS options\nUp to 3 hours of talk time, up to 200 hours (8 days) of standby time", "Name": "Nokia 9300 Unlocked Smartphone with MP3/Video Player, MMC--U.S. Version with Warranty (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/419FBDKGEBL._SY300_.jpg", "ProductID": "B000BYGNVA"}}