{"Reviews": [{"Title": "Nokia N73 ME: Outstanding phone", "Author": "Jorge Corredor Zaccour", "ReviewID": "RH4UA0ZNU9JL2", "Overall": "5.0", "Content": "Actually, I bought this phone by mistake, since I thought it wouldn't be shipped all the way to Colombia, but it did (in less than seven days). To this point I had only bought books through Amazon and in trying to buy other products had failed due to shipping restrictions, although Amazon and its reseller E-tronics came through this time. Great job guys.Ok, down the brass tax: the Nokia N73 ME is a complete multimedia experience, camera, music player, and yes a phone, complete with all the extras, which led me to sell my old iPod just last week. And since I didn't own a camera, it was fantastic. The camera works great (for a phone), although, you have to become a wiz at adjusting all the settings it comes packed with for your picture to come out great in environments with little light. I'm totally psyched with it, shooting everything that moves. The Symbian OS is well designed and pretty robust, supporting any kind of application you might find.The only downside is that at the beginning it was a little slow while browsing in between applications. But you can fix this problem by downloading the Nokia Software Updater which allows you to update your phone's firmware. I updated my N73 with the latest version (v.4.0727.2.2.1) and the problem was solved, along with dozens of other bugs. And in sync with the Nokia PC Suite it's like having your office in your pocket. Really it is.OK buddy, that's it for now. Hats off to Nokia for making an awesome phone. Your bank account might get pissed off, but your life will most definitely improve: your life in there. Oh, and the best of all is that my childish and unfounded need for the coveted iPhone is now gone. Righty Oh!", "Date": "August 23, 2007"}, {"Title": "Nokia N73", "Author": "Nessty", "ReviewID": "R277GVJ16QYOSC", "Overall": "4.0", "Content": "Really nice phone! At first there were some problems initializing the phone to communicate with Nokia PC Suite on the Vista platform but that was eventually sorted out and other than that it was a really good buy. Great camera and web browsing with mouse key capabilities and lots of other features.", "Date": "April 20, 2008"}, {"Title": "Don't even think about buying this phone!", "Author": "Dean", "ReviewID": "R3AR76ESXRAPXP", "Overall": "1.0", "Content": "[Note: my review is not about the seller but the device]I will not repeat every comment others made but I will say this: it works on the right frequency for high speed data if you DON'T live in the US. If you live in the US this phone is not for you. In addition (and possibly not coincidentally) this phone will eventually get into a mode where it will drain all the battery as it keeps talking to the network trying and failing to receive SMS. So you get no SMS and you soon (within hours) have a dead phone. I sent it in twice to Nokia (at my own expense) to get it fixed while it was under warranty but both times the problem re-appeared within days. Needless to say Nokia doesn't care - in fact their comment over the phone was that this device seems incompatible with my carrier! So much for US version. I wish someone had pointed all of this out when I bought the phone.", "Date": "April 24, 2009"}, {"Title": "awesome phone", "Author": "nokia6230 \"nokia6230\"", "ReviewID": "RDPGW2WUBCMAE", "Overall": "5.0", "Content": "I've used the N75 phone on Cingy/AT&T; for about a year and this phone uses the same Symbian 3rd ed OS. So I still have the same gripes about that but..The differences that I like on this phone:-Awesome camera resolution. Really digital camera-like. Even the indoor night pictures w/ flash came out great! Most people think it's a camera because of the way it looks and they give you that weird look when you ask them to take a picture of you ... and you hand them a phone!-Better battery life than the N75-I thought I'd have a problem with the smaller keypad area but I can actually text quicker on this because the keys are closer together and more responsive.-the keypad and phone itself (except for the screen) doesn't attract fingerprints as much as the N75-speakers sound fuller and not teeny-more themes and ringtones than my branded N75-lighter than the N75-easier sim card accessThe Cons:-I've gotten used to the flip style so having the screen exposed made me think twice about shoving it into my pockets.-joystick not as easy to get used to.In other words, an awesome awesome phone.A little pricey but well worth it! Get it!", "Date": "January 7, 2008"}, {"Title": "Awesome Phone!!!", "Author": "J Rock", "ReviewID": "R2MHWKT5JPIYXF", "Overall": "5.0", "Content": "This phone will not let you down! The reception is full bars always(like most Nokia phones). The pictures blow away your friends phones. The music options are cool! Just put like 8 hours of music on the phone and it did not even dent the memory! This phone is worth every penny!!", "Date": "March 27, 2008"}, {"Title": "this phone is rad!!", "Author": "R. Metzler \"ringtone  king!\"", "ReviewID": "R367T6L9YIJ4AN", "Overall": "4.0", "Content": "the phone has amazing video/picture abilities. i can add text to the beginning of videos i have taken. on pictures i can add clip art and text in the same image! sound quality for ringtones/speaker phone is loud and clear! using video on the phone is awesome, picture is clear and easy to see what happens when you record, unlike the crappy resolution on other cell phones.i had the phone in two days and put my sim card in the phone and no worries! this phone is worth IT and you arent locked into any kind of contract. enjoy!", "Date": "May 9, 2008"}, {"Title": "ash review", "Author": "ash", "ReviewID": "R1O21NUT6U02FO", "Overall": "5.0", "Content": "The cell phone is brand new and came with all the other accesories in the box. Its a great phone with great camera and music quality.", "Date": "April 20, 2012"}, {"Title": "wonderful phone", "Author": "A Sanchez", "ReviewID": "R11H7XFX5LEYOE", "Overall": "5.0", "Content": "I love this phone, i bought it with overnight shipping and i had it in my residential door the next day.", "Date": "August 14, 2008"}, {"Title": "nokia n73", "Author": "Opeyemi Sulaiman \"halo2champ\"", "ReviewID": "R1764MH6LDF3SX", "Overall": "4.0", "Content": "love the phone, except i was suppoosed to get the music edition but the just sent a black n73, which came wit a 512 memory card compared to the music edition thats supposed to come wit a 2gb card", "Date": "April 27, 2008"}, {"Title": "NOT FOR ME TOO !!!!!!!!!!", "Author": "S. uttarachai \"I'm real\"", "ReviewID": "R3NFL0395Z91D9", "Overall": "1.0", "Content": "Damnn....i got this phone yesterdayand I thought this phone is real !!but it's not at allthis all COPY !!!!!!it's a COPY phone..!! not realcause I had used this phone last yearbut I bought from my coutryIt's so DIFFERNT !!!!!!!!!1DONT TRUST THIS SELLER !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "November 11, 2008"}, {"Title": "NOT FOR ME", "Author": "Adrian Hernandez Jr. \"AJ\"", "ReviewID": "RBUQGXY0W0ISR", "Overall": "2.0", "Content": "I HAD A PROMLEM WITH THIS CELL PHONE WHEN I GOT IT E-MAIL WOULDNT WORK AND I HAD A PROBLEM WITH THE SOFTWARE WOULDNT STAY ON WOULD CRASH", "Date": "April 29, 2008"}, {"Title": "Buyers Beware!!", "Author": "Sridhar Iyer", "ReviewID": "R2ZSFHX0DCYBQU", "Overall": "1.0", "Content": "This is not a Music Edition phone as described. Instead it is just the Black edition of Regular N73. Absolutely disappointed with the purchase. Will send back the product for refund.Issues with Regular N73:1) Slow and unresponsive UI2) Need to purchase additional miniSD card. It comes with only 512 mb, whereas N73 ME comes with 2 Gb3) Need to purchase additional 3.5 mm audio adaptor.[EDIT]I'm glad that Amazon has changed the product description to N73 Black and not ME!!", "Date": "April 14, 2008"}], "ProductInfo": {"Price": "$349.99", "Features": "Unlocked quad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 2100 UMTS plus EDGE capabilities\nVivid photo quality prints with the 3.2-megapixel camera and Carl Zeiss optics; large, bright 2.4 inch QVGA (240 x 320 pixels) TFT color display\nDigital audio player and FM radio; memory expansion via MiniSD memory cards\nBluetooth 2.0 connectivity for both handsfree communication and stereo music streaming (with firmware update)\nUp to 4.1 hours of digital talk time and 350 hours of standby time; backed by third party 1-year warranty", "Name": "Nokia N73 Unlocked Smartphone with 3.2 MP Camera, 3G, MP3/Video Player, MiniSD Slot--U.S. Version with Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41uXoGECN1L._SY300_.jpg", "ProductID": "B000WLZTTO"}}