{"Reviews": [{"Title": "Move over Blackberry, there's new players in town.", "Author": "Mark Glanemann", "ReviewID": "R16G435RQ534Y1", "Overall": "5.0", "Content": "This phone is great!!!  I just got it 4 days ago.  it has Push technology just like blackberry, qwerty board, buttons easy, windows mobile 5.0, i've been getting apps like crazy.I installed old school DOOM on it, and it looks and plays just like the original!!!  Manager to install an Atari emulator and got every atari game ever made on my phone!!!  I know i'm just talking games but that is sick!!!oh yeah, it's Wi-Fi.  Need I say anything else!!!basically, I can play movies, record video, play music, play games, browse the internet on Wi-Fi, text, MMS, use office style programs, sync with outlook for work and have my computer at work basically on my phone.and it also is a phone and I can make calls...This phone has everything available that can be done, well almost, can't watch live tv, but i love it!", "Date": "August 19, 2007"}, {"Title": "Great idea but....", "Author": "R. Knott", "ReviewID": "R3RQDUZP9I10RQ", "Overall": "2.0", "Content": "I have had this phone (T-Mobile DASH) for a year. Ever since upgrading to WM6, it has been miserable. The phone has to be restarted with battery and SIM taken out at least 4-5 times a day. If there are any third party apps, it gets worse. It won't start with the SD card in it so I have given up using it as a music player which I did from the beginning. All of these issues are documented on the various support boards including HTCs.I live and breathe by my phone and email capability and this one is no longer dependable. T-Mobile replaced it but the same issue is happening and they can't fix it. I love the form factor of this phone and what it could do - it just doesn't. I will be moving to another device in February as I have to have a phone that works all the time.", "Date": "December 26, 2007"}, {"Title": "GOOD CELL PHONE", "Author": "Ingrid Delgado \"Ingrid\"", "ReviewID": "R1UGTLLYRRTE7K", "Overall": "5.0", "Content": "I do not have much time with my phone, but my friends who know more than I do about cell phones, I say it's an excellent phone. has camera and the photos are clear and beautiful. The Wi-Fi is buenisimo. Wherever I get the signal internet. The only detail I see is that I can not change the language because the window is in English and can not make changes in that regard.I am very glad to have my cell", "Date": "January 23, 2010"}, {"Title": "Not as good as the reviews say...", "Author": "Taylor \"Trademark Photography™\"", "ReviewID": "RSXTRM2DHDG6Q", "Overall": "2.0", "Content": "All the reviews state what a wonderful phone the Dash is, but there are some problems it has.1. I'm not sure if this is common, but it the silver faceplate on mine came off rather easily. I've fixed it with superglue, but still a possible manufacturer problem.2. The Jogger Bar (a touch sensitive bar on the side of the phone) is nearly invisible to those who didn't know it existed in the first place. If you don't leave the phone locked when you pocket it then it will turn the volume up by itself, call people, answer the phone, etc. This feature can be turned off and that is what I did once I realized how.3. With the text messaging a slip of fingers can cause the type to turn in to Chinese lettering. This happened to me and I spent hours trying to figure out how to fix it the first day I got it. For those of you that have friends and family with this phone and this problem should choose to pop up, all you do is press alt then cap (both in the lower left corner of the keyboard). That changes it back to English or what ever language is set to the device.That's it for the problems, but there are some really nice features I enjoy.1. Texting is set up like chat where you can view previous messages to and from the same person. It really helps after you get in to conversations with 4 or 5 people at a time.2. The screen is very easy to see even outside during the day.3. The back is rubberized and it doesn't slide easily off of dashboards.These are just a few of the Pros and Cons of the HTC Dash.", "Date": "December 2, 2009"}, {"Title": "Looks nice and windows is great BUT", "Author": "Katz", "ReviewID": "R39CWAKM18CR5H", "Overall": "3.0", "Content": "I got this phone yesterday, i bought it here in amazon from this seller.It looks nice, the phone is clean and brand new. The first thing i check is the wifi and it is working great. The camera is only 1MP so its only good if there is light since there is no flash. Instruction included, battery and charger. I was tryin to find if i can put the memory card but i cant find where i can put it. If you will start workin on the phone, it is a little slow like 1 sec delay before it respond so i dunno if a memory card can help that problem. The color is black not like the one in the picture.", "Date": "October 17, 2010"}, {"Title": "Disappointing", "Author": "talula31", "ReviewID": "R2SXVLBFG7XXP", "Overall": "2.0", "Content": "I've had this phone for approx. 1.5 years and have been ready for a new one for the last few months. I use it only for the basics: texting, phone calls & syncing to my Outlook calendar.  It freezes up a lot & shuts down on a fully charged battery at least once a day. I can't imagine using this for emails and the web.  There isn't a way to delete alarms,if you decide to change the time, it will go off every time you've ever programmed. I had to turn the alarm sound to silent, which means I can't use it at all anymore. It stopped reading my memory card for no reason for months and then one day recognized it again.  I have T-mobile and they've been no help, but I guess you get what you pay for.", "Date": "October 28, 2008"}, {"Title": "This is by far the best phone I ever had", "Author": "Alex V. \"Alex\"", "ReviewID": "R3FURY2OATSD7C", "Overall": "5.0", "Content": "I won't give any more details than the previous reviewer (Mark), I just wanted to add my comments to say that I agree with him and that this is the best of the 14 cell phones I had.Light weight, not so big, great hand grip, great battery life, fast wi-fi connectivity, loud ringtones and not expensive! What more can I ask for?Other phones with slide keyboard (which have better \"looks\") won't do what this phone with the integrated keyboard does: the capability to type with just one hand.I'm really happy with this phone, won't change it until is dead, it has ALL the features I need from a phone, all of them.", "Date": "October 12, 2007"}, {"Title": "great phone!", "Author": "J.Spence", "ReviewID": "RFQY872XGNIYR", "Overall": "4.0", "Content": "ive had it for a month and it works great didnt come with the case so now its all scratched up great battery life great music player great texting loud enough speakers didnt get to go on the internet much because wifi not as strong as a laptop....", "Date": "September 22, 2009"}, {"Title": "Super smartphone!!", "Author": "Nestor A. Leal Perez \"Nestor Leal\"", "ReviewID": "R2XR5TXA4TSX1W", "Overall": "4.0", "Content": "This thing is great. Light weigth, I can finally have a thin light phone on my shirt pocket. The windows connectivity is perfect, when something is updated on my outlook automatically is updated with my HTC and viceversa, no need to press any sync button. The keyboard is good and now that I got used I can type really fast. I will kiss goodbye my bulky Palm Tungsten T3 and my old Nokia 6230. Now I have all in one gadget. They never really got along well.I just wish it had a touch screen so I could run my HP48 Emulator on it. But I think I will find a good polish calc.And I wish it had already WM6. I need to update it but I think it will not by any problem.", "Date": "December 21, 2007"}, {"Title": "Good basic smartphone", "Author": "Brinkley Richardson", "ReviewID": "R2UY1SWP8RFDGY", "Overall": "4.0", "Content": "I've used all kinds of smartphones, including Blackberry, Nokia, WindowsMobile/Blackjack II.  My company's policy for synching with Exchange server did not allow synching with Nokia/Symbian OS, so I needed to get another WindowsMobile phone.  I didn't want to spend much money, and decided on this one.  It is a good one.  Synchs very well with Exchange/Outlook with WindowsMobile 5.  Synching with other email services also OK.  Not as many apps for this as with iPhone or Android, but some decent ones.  Couple of things to consider on the negative side.  1) battery life not great.  I am a heavy user, and most days I have to charge during the day or it will shut off, 2) this model also known as \"T-Mobile Dash\"...the model that was sent to me from Unlockedcellphonekings was actually a T-Mobile model.  Not a huge deal, but because it was not technically \"unlocked\", I had to replace all the t-mobile settings with at&t;'s, which took quite a while as I had to search help blogs online to figure out all the correct settings.  I recommend this phone, but would also recommend that, if you order it and it get the T-Mobile branded model, send it back and tell them you want the generic HTC-branded one.", "Date": "April 24, 2011"}, {"Title": "defective", "Author": "Linda R Martin", "ReviewID": "R2FL7FPGW3XA9F", "Overall": "1.0", "Content": "this phone is totally defective, no blue tooth, no video, camera pics are dark and out of focus, speaker not working well, sound is terrible to hear, and the program is out of date, do not purchase this item", "Date": "September 4, 2013"}, {"Title": "sturdy", "Author": "sheri", "ReviewID": "REK3MMK9S26O5", "Overall": "4.0", "Content": "its what i want & need..i'm just learning how to use it!!not to sure on how to make up for storage tho....i need one i can connect staight to my pc withoutmuch hassel..i like this one.", "Date": "April 2, 2013"}, {"Title": "works great", "Author": "Keisha Vinales", "ReviewID": "R1YH0A5IUF3XAQ", "Overall": "5.0", "Content": "Was skeptical about ordering online but the phone works well.  No complaints.  Happy with the purchase and phone as described.", "Date": "January 2, 2013"}, {"Title": "htc", "Author": "ronnie1", "ReviewID": "R2YUZEBFT1FGFM", "Overall": "3.0", "Content": "The htc s621 is a very good, I recommend this product to anyone who's looking for their first phone etc...", "Date": "November 6, 2012"}, {"Title": "pretty good for the cost", "Author": "Kay H", "ReviewID": "R2L79C9KI97VS", "Overall": "5.0", "Content": "It's been almost 2 years since I bought this phone and it is still working. Battery is still good. Maybe I don't use this phone that much, but I have had it for travel with me back to Asia, it works over there too. Not a lot toys for you to play with, but you get what you pay for. Overall, I'm happy with it", "Date": "October 26, 2012"}, {"Title": "no wifi unless you have a data plan", "Author": "Tiger Monitor", "ReviewID": "RA7STHNC7GX0B", "Overall": "2.0", "Content": "This phone comes with a Roger logo and, clearly, their base software installed. So, yes, you can use any sim in it, but unless you start with their data plan, you cannot connect to a wi-fi. The description should specify that. Yes, I could hack it to eliminate that problem, but I paid extra to buy an unlocked phone, just to not have to waste my time doing that.The same thing happened with an 'unlocked' Blackberry I ordered before from Amazon, that also came with the Roger logo. The seller should specify where the 'unlocked' phones come from.Just a waste of time.", "Date": "July 13, 2012"}, {"Title": "disastisfied", "Author": "julz", "ReviewID": "R22S9NQEDDCDXN", "Overall": "1.0", "Content": "I am displeased with my purchase of the htc s621 phones. i purchased two black and white (silver) but i got both of them fully black. they were supposed to be unlocked but i had to pay to get both of them unlocked. to make matters worse one of the battery is useless to the point where it was soft and stripping. i am so disappointed and im from Jamaica so its hard for me to return them at this point or to buy a new battery. i cant use the phone so hence im giving it a one star.", "Date": "July 10, 2012"}, {"Title": "Poor", "Author": "Luis", "ReviewID": "R1UEW7FBVK6YSA", "Overall": "1.0", "Content": "The Camera on the phone does not work. The phone freezes alot.  Bluetooth rarely works.  The only thing that keeps me from returing it is the fact that I dont have an alternate phone.", "Date": "May 22, 2012"}, {"Title": "HTC S621", "Author": "Amazon Customer", "ReviewID": "R3H6VYKKQ6YQDH", "Overall": "4.0", "Content": "I recently bought this phone so at the moment I cannot write a comprehensive review as I am still learning about the various features. The one thing that I can write about is the battery. With my previous phone I charged it once per week. However, with my HTC phone I find that I must charge it every day as the battery does not last longer than that. I will update my review once I have become more familiar with the item.", "Date": "December 30, 2011"}, {"Title": "HTC S621", "Author": "Amazon Customer", "ReviewID": "R3GPZOFDBLC8T7", "Overall": "5.0", "Content": "I bought as a gift for someone. They are still enjoying it and no known issues. I would recommend this product for anyone looking for an inexpensive phone with a lot of features.", "Date": "August 23, 2011"}, {"Title": "Phone operation", "Author": "A Customer", "ReviewID": "RD1PO00NJ54CL", "Overall": "4.0", "Content": "I bought this Htc  phone to use in the island. The phone  work great I thought I was using my blackberry. I Had no problems with the phone or service at all. The Htc  phone has some of the same features as the blackberry. I think it can give the blackberry a run for it's money. The camera takes  clear pictures, sound is good cannot ask for anything else. The only feature I did not find available was dictionary function where you start to spell a word and it would give other options to choose from or to tap on. If that is a feature then I would like to know.  That one I gave to a friend who like it just as much as me. Since I like the Htc phone so much I ordered another one.", "Date": "June 10, 2011"}, {"Title": "JEPZ", "Author": "A Customer", "ReviewID": "R3AKT3QA7WVKPO", "Overall": "3.0", "Content": "One of the phones didn't work.  I want to thank you to Amazon, because they've been helping me a lot with this.", "Date": "May 25, 2011"}, {"Title": "Bad seller", "Author": "A Customer", "ReviewID": "R1URIJYW0UQIE0", "Overall": "3.0", "Content": "I ordered this phone and the seller sent me 2 earphones and no sync cable, dont buy from this seller", "Date": "April 29, 2011"}, {"Title": "Bad seller", "Author": "Roberto Arias Esquivel \"rarias\"", "ReviewID": "R29H9F1ZCR8RZN", "Overall": "1.0", "Content": "The phone is great! but the seller... Battery is a used one, the data cable provided is a micro instead of a mini, charger is not the original one.", "Date": "April 26, 2011"}, {"Title": "Review HTC Dash", "Author": "A Customer", "ReviewID": "R1T9DTTNNT0XW9", "Overall": "4.0", "Content": "I am very happy with my purchase. It is very easy to use once I got the hang of it. The appearance of messages and mails as they are recd is particularly useful when I am traveling. The phone is very clear and easy to use.Some of the short comings are - the voice dialing those shown as a feature has been removed by T Mobile (as stated by htc when queried). This is a significant disappointment. I have not been able find the copy, cut and paste features.Apart from these I am quite happy with the purchase particularly at the price of $ 109", "Date": "April 9, 2011"}, {"Title": "nice", "Author": "A Customer", "ReviewID": "RFH0DG6IEZ65F", "Overall": "4.0", "Content": "I've used this phone for almost a year. Now that there is 4G, this phone would probably be best suited for a first time smart phone user.", "Date": "March 22, 2011"}, {"Title": "Great phone with WiFi - however HORRIBLE BATTERY LIFE!", "Author": "Daisy S \"Daisy S\"", "ReviewID": "R2O92CA86IFU8L", "Overall": "3.0", "Content": "Pros: (3)-Easy to use WiFi so I am able to browse the interet without a data plan.-Unlocked! Can be used with any GSM SIM card.-I placed the newer 6.5 Windows rom in mine and now this phone can read a 16gb sd card!Cons:(3)-HORRIBLE BATTERY LIFE. Battery is DEAD after being away from charger in 1.5 days! Not acceptable.-No 3.5 Jack (this has combo Mini USB jack that is used for headset and also to charge the phone. I did purchase a 3.5 headset adapter so I can plug in standard headphones into it or place small speakers into the phone.-No FM RadioMy total rating is 3 stars mostly because of the HORRIBLE battery life!*If the battery life was good, I would have rated this phone 4.5 stars", "Date": "March 9, 2011"}, {"Title": "Trouble loading", "Author": "A Customer", "ReviewID": "R2IMY48YQXVLVT", "Overall": "1.0", "Content": "This phone is the worst piece of garbage I have ever come into contact with.  As simple as changing sim cards it gives you a long process of the phone loading up to the natural screen.  I have had problems like this continuosly until it doesn't load up at all", "Date": "March 8, 2011"}, {"Title": "I love it but...", "Author": "A Customer", "ReviewID": "R2MQV5LNGYN3L0", "Overall": "4.0", "Content": "I got the phone a few days ago.  So far so good except I cannot get it to connect to the internet.  I had no problem connecting to our wi-fi but it will not go to any web page.  Set-up for the phone was simple and easy!  I love the phone but wi-fi was the main reason for buying it......", "Date": "October 17, 2010"}, {"Title": "disapointed", "Author": "Medio Yuca", "ReviewID": "R1SYO8TAKUPNSZ", "Overall": "1.0", "Content": "Good DayUnfortunately I'm estremly disappointed in the purchase of the HTC S621, on inserting the sim card the phone after appprox 5 mins use. turns off/shuts down on it's own accord. Is it possible to return the HTC S621 to bechanged for a similiar model or another make?Look forward in hearing your comments.Julia Gonzalez", "Date": "August 29, 2010"}, {"Title": "htc", "Author": "Rafael Sanchez \"RAFAEL\"", "ReviewID": "R1KHK6QD9O0892", "Overall": "2.0", "Content": "Here are some tips for writing great reviews:  Do explain why you liked or disliked this product.  Do compare to similar products and share how long you've used this product.  Do identify specific attributes (e.g. comfort & fit of a shirt or the battery life of a camera) and whether they met your expectations.  Don't describe your seller or shipping experience (you can do that at amazon.com/feedback).  Don't include promotional content of any kind or reviews written in exchange for compensation.", "Date": "February 22, 2013"}, {"Title": "Phone SUCKS", "Author": "mscmb", "ReviewID": "R21BNDDE2HZBR9", "Overall": "1.0", "Content": "Phone is set up for Canada - does not work with Tmobile in the U.S. It broke completely 1 month after return policy ran out and ... worked like S_ _ _ to begin with.  Should have sent it back immediately - my bad!", "Date": "October 29, 2012"}, {"Title": "bad seller,bad phone reitered bad seller", "Author": "Vinicio Samaniego", "ReviewID": "R2K8CR8XVGDNPC", "Overall": "1.0", "Content": "the EOM shop contacting with me and We have an acord, for my part Is done, but they nothing , the phone is terrible no conecting internet , the display is damage .this company do much damage to image of HTC", "Date": "March 26, 2011"}, {"Title": "great phone bad service", "Author": "Godfrey Allen \"bestest dad\"", "ReviewID": "R1KYAPNDM6ZW6G", "Overall": "2.0", "Content": "Bought this phone in november got it late and the box was half emptyall that was in the box was the phone and the battery NO headset,No usb cable,No user manual .The phone works great but I will never purchase any thing from this vendor again.", "Date": "January 29, 2011"}, {"Title": "bad  cell phone", "Author": "sherry", "ReviewID": "R22YT2GOHIXJWZ", "Overall": "1.0", "Content": "well i bought this  cellphone for my daughter for  christmas of last years  well it  dont  work so  i lost 115.00  not  right  the  company  i  bought  it  from  isnt  gonna  do  nothing  about  it  said  wasnt  no  refund or  replacement  for  this  phone  i'm  mad  thats  ok  what  goes  around  will come around you  will seee  ... ya  know  i  have a store  on  amazon  too  and  if  my  stuff  dont  work  i  will  give  them  there  money  back  i  guess thats just me  beware  of  buying  cell  phone  from  this  company cause  if  it  dont  work  it's  yours  ~thanks~", "Date": "January 24, 2011"}, {"Title": "A little dissapointed", "Author": "Juan Ruben", "ReviewID": "R3647N1ZETY1BF", "Overall": "2.0", "Content": "I've just got the phone and it looks very nice.. BUT in the box was missing some stuff very basics in a PDA like this: the HANDBOOK and the USB cable. BIG MISTAKE..", "Date": "December 3, 2010"}, {"Title": "MAL..!", "Author": "alejandro_pay", "ReviewID": "R27LUAW8RPOIYI", "Overall": "1.0", "Content": "Estoy muy pero muy decepcionado, la verdad que mejor me hubiera salido comprarlo aquícompre este HTC el 10-12-2010 y justo en enero me dicen que se extravió en mi pais sucialista. bueno que mas le puedo decir..! Malisimo..!", "Date": "February 8, 2011"}], "ProductInfo": {"Price": "$299.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and GPRS/EDGE capabilities\nWindows Mobile 5.0 Standard platform with enhanced business and enterprise tools; 2.4-inch touch-sensitive screen and QWERTY keyboard\nWi-Fi networking (802.11b/g); 1.3-megapixel digital camera with macro mode; MicroSD memory expansion; Bluetooth stereo music\nUp to 5 hours of talk time, up to 220 hours (9+ days) of standby time", "Name": "HTC S621 HTC S621 Unlocked PDA SmartPhone with Camera, Windows Mobile 5.0, Wi-Fi, MP3/Video Player, MicroSD Slot - No Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51dQKl2oSHL._SY300_.jpg", "ProductID": "B000RW7IBK"}}