{"Reviews": [{"Title": "Slimest symbian S60 wifi equipped phone", "Author": "E. H. Manzanilla \"Gadgeteer\"", "ReviewID": "R1OMRO8EZHRKU0", "Overall": "4.0", "Content": "I dón't write product reviews normally, however this phone is so acomplished, so I felt inclined to share my experience for those who are looking for a well balance smartphone with very good size without communications compromises. I have been using this phone since January this year. The best fetures are: Size and weight are just perfect when you are travelling while really working at the same time, it is wifi enabled so you can avoid expensive packed data fees while still check your email on the go at airports and cafes with wifi free spots, if you are in a hurry to check internet data you still can use 3g / 3.5g data connections, it is a blazing fast smartphone with true multitasking, coming from many years using palm os I became acustomed to not have multitasking at all, but let me tell you that symbian is a great mobile OS far better than the venerable palm OS, almost any application you might need is available at affordable prices or even for free, the interface is also very intuitive and very easy to understand. While it is a very good communicator, it is not a phone for all, because its multimedia capabilities are in the medium to low level, the camera is just for occasional pictures that do not require neither a flash nor a good focus and the included speaker is not stereo so you need a good headset with stereo output to listen to your tunes, radio has not RDS, these are the characteristics I like to improve, however probably that requires a larger and heavier body I would not like. If you need to synchronize your mobile with your desktop just named your preferred pim application: Outlook, Lotus Notes, Lotus Organizer all could be set up to be in sync with the E51, you could even sync with your corporate services under Microsoft Internet Server. Also if you like the blackberry the E51 could run the Nokia Blackberry Connect application, even when the Nokia site has not included this model as certified for the application, it could run it without issues. What else you could desire in a phone the same size of a regular not smart one at this price level. Bottom line the slimmest S60 smartphone available with wifi and full gsm and data connections set.", "Date": "March 6, 2008"}, {"Title": "Does what a phone should and much more", "Author": "C. Liu", "ReviewID": "RO21UILGK8UIP", "Overall": "4.0", "Content": "I have owned this phone for about a month now and I am very happy with the phone overall with some minor draw backs. I use this in Manhattan area with AT&T.;Pros:1. very good reception. Full bar inside some subway stations (including Times Square on the 1,9 line, 2 stories below ground)2. good battery life. batteries go up to 4 days without charging with ~30 min talk/day +some texting and web browsing.3. W Lan connection a breeze.4. works well with ATT internet by media net, relatively fast and reliable connection. (can't comment on 3G, haven't used it)5. Screen seems scratch resistant. probably has a glass cover. put the phone in my pocket with keys several times. not a scratch so far.cons:1. media player less than adequate2. no asian language support (apparently you have to go to nokia service center to get the hardware flashed in order to add extra language support)3. SD card gets stuck in the slot frequently, had to remove it using an pocket knife (ouch my new phone). may be an isolated case.", "Date": "May 30, 2008"}, {"Title": "5-star for what it supposed to be", "Author": "A. Lee \"alex\"", "ReviewID": "R2TJUVOZGOUJUV", "Overall": "5.0", "Content": "I was looking for a good cell phone, PDA(calendar, notes, voice memo), music player, communication(wi-fi, bluetooth, web, modem, sync), and the priority is in that exact order. For that and this price point, this phone is great, 5-star.I got this phone in May, and I put in a Sandisk 4Gb microSDHC card that's good for now. I saw report that it'd take a 16Gb if I need that later.Pros:-Good size, quality built, very well designed, good battery life.-Very good phone. Call quality very good with the factory headset. Slightly worse with a Plantronic 815 bluetooth headset (still good).-Good function in calendar, meeting, reminder, alarm etc. I also recorded hour long voice memo in meeting no problem.-Music player is good both function and sound. Radio is a bonus plus. On full charge, I played music 10 hours straight with headset. Speaker good for both phone and music (won't compare it to full size boom box).-Bluetooth, wifi, sync, web all function properly.-Control keys are very good. A lot of customization can be done. When set up properly, very convient.-Predictive texting is very good. I don't write full length email with it so it's just right for me. Good for any basic use.-Lots of additional features are just welcome bonus for me. (camera, video, gps, voice command, games, application download, music ringtone, VOIP etc etc)Cons:-Small screen. 2.2 or 2.4 inch and larger letters would be better. (I think the length of it is just right and can be a little bit wider)-If it comes with the new WH-700 stereo headset instead that'd be cool.-camera is so so.This phone is really good for what it is. If I want more texting or web/media viewing comfort, I'd probably go with the nokia E90 or HTC Touch Pro or Advantage x7500. And if I want to really use it as a computer I would consider the Azus Eee ultra portable... as of today that is. With the upcoming models, we'd keep changing the way we use these devices.Hope it helps. When I research products, I found it very helpful from some of the reviews. This's a great feature on the web and I hope that I'm doing my part contributing to it.cheers.By the way, I use t-mobile. And as others reviewed, it looks cool and the operating system is stable and fast.", "Date": "June 20, 2008"}, {"Title": "You never go wrong with Symbian OS", "Author": "Serdar Arslan \"Serdar\"", "ReviewID": "R3H5EMS93J1IDD", "Overall": "5.0", "Content": "First of all, Symbian OS is very stable and user friendly. Phone is super fast, and after installing 100s of applications it is still fast. Phone is great for both your business and for your entertainment. Its Exchange email support is great, and you can also use your phone with blackberry servers. Office support, PDF reader, ZIP support, and blue tooth printer support is just what you need for your business. Phone comes with Flash player, RealPlayer and Music player. You can even watch your favorite youtube videos.This phone doesn't have full keyboard nor GPS receiver. If you need full keyboard you should go with e61, or e62. If you need GPS so desperately then E series is not for you. You should consider buying N series phone. I hate people who rates this phone 1 just because they say phone doesn't have qwerty keyboard. it is in the specs, this phone has no qwerty keyboard nor gps.This phone is not supported by AT&T.; In my case 3G is not working. I know there are some people who can use their e51 with AT&T; 3G but it is very spotty and most of the times you only get edge. me on the other hand never seen my phone working with 3G.", "Date": "June 10, 2008"}, {"Title": "good but firmware needs to be updated before use", "Author": "Anonymous reviewer", "ReviewID": "R2WSI7P4E4SO34", "Overall": "4.0", "Content": "The firmware loaded on the phone is buggy and several features, including VOIP and the Download! application, simply fail to work.  Nokia has a firmware update application (PC only) on their website, which solves these problems.  The list of fixes is extensive, so I wouldn't bother configuring the phone before flashing the phone to the updated firmware.  You can back up your settings to a memory card or a PC if you already configured it, then restore the settings after you flash to the new firmware.  Otherwise a lovely little phone.", "Date": "February 18, 2009"}, {"Title": "Business phone, not toy", "Author": "borogroves", "ReviewID": "R2U9PEOS2XVFIB", "Overall": "5.0", "Content": "The Nokia E-51 phone is a good business tool for those who need a compact, non-gizmo phone.  It makes calls just fine.  It has buttons you can map to common uses.  It accesses WiFi just fine (but the screen is small, a warning to those of mature eyesight). It goes to Europe just fine, with a second SIM and contract (avoid Virgin; Orange is better in the UK). There are plenty of applications, free or cheap, that use S60 platform. The battery life is neither better nor worse than other phones I've had.The E-51 does not play games or take high-resolution pictures, but if you need to photograph something urgently (such as a car accident), it can.  And then it'll download the pics to your laptop without paying again for phone data transmission.  It may well play music, but I've never tried. Nor does the E-51 have a QWERTY keyboard, but you should have figured that out from the specs, right?It's sleek and compact.  I use T-Mobile for a cheap plan and have no problems in Chicago and the East Coast.  All in all, a good phone for practical uses.", "Date": "July 30, 2008"}, {"Title": "You don't need more, buy the E51", "Author": "I. Gomez", "ReviewID": "R1VKTVRP1XUP2G", "Overall": "5.0", "Content": "Pros: easy to use, good call quality (T-Mobile), great applications like Fring to allow the phone to use Skype over the WLAN.Cons: the power button is really annoying, it is difficult to turn the phone on and off.", "Date": "July 9, 2008"}, {"Title": "E51 doesn't disappoint!", "Author": "The Z", "ReviewID": "RTAHF73OUZIWC", "Overall": "5.0", "Content": "I had been eyeing this phone since last fall, but kept looking for something better and newer. I didn't find it. Finally, as my old Nokia 6682 was falling apart, I decided I'd better get this. I have had the E51 for 3 weeks now and I am kicking myself for not having bought it sooner! I was primarily waffling between this and the E71, but I prefer the numerical keypad and the sleeker design. I am not sorry I chose the E51. It can do just about everything the E71 can, and it is a really good looking phone too.SETTING UPCopying all of the information from my old Nokia to the E51 was a snap -- when I first turned on the new phone, it asked if I wanted to copy info from another phone. I just activated bluetooth, told it what I wanted to copy (I chose only contacts and messages) and it did, except that it has dedicated buttons for contacts, email, and calendar. Since I am not setting up a mailbox, I changed the dedicated mail key to open up a text message (short press) or take me to the messaging home screen (long press). Each button is customizable (tools > settings > general > personalization > one touch keys). All of the buttons are a little firmer than on previous Nokia models that I have had, so I have to remember to push them a little harder when typing text messages. But the plus side is that buttons are far less likely to get pressed when it is in my purse or pocket. (I don't always remember to lock the keys.)3G WORKS IN NYCWith all of the trouble I have been hearing about 3G and dropped calls, I purposely chose this phone to avoid 3G. It works like a charm and I have great signal strength. While the specs say that the 3G will only work in Europe, the phone showed that it was operating on the 3G network during a recent trip to NY. When I left NY, it went back to not being on 3G.WI-FI - FAST!I don't use an AT&T; data plan, and the availability of wi-fi was a key reason why I got this phone. The wi-fi is blazing fast. It's so amazing, I can barely believe it. The screen is small, however, so if you have trouble with fine print even with reading glasses, it might not be ideal for you. The images are sharp, the screen quality is excellent, and I have no trouble with the sound. (When using the built-in speakerphone, the speaker is on the back of the phone, so just turn it around to hear better.)CAMERA, SO-SOThe camera isn't that great and has no flash, and probably not as good as the one on the Nokia 6682. But isn't that terrible for a quick snap of something you need to remember. (If I'm going to an important event and want high quality photos, I carry a camera.)MUSIC & FILE TRANSFERS ON A MACWhile I bought this phone primarily for its business functions, I decided to put some music on it. It was easy transferring files from my Macbook to the phone, and unlike the old Nokia models, the Macbook can browse and copy files to and from the E51 via bluetooth. I copied about 10 songs and made a custom playlist on the E51. The phone comes with a stereo wired headset if you want to use it to listen to music.USING MICRO SD CARDSAnother note, I had difficulty getting memory cards to register but one intelligent phone guy at BestBuy figured out what I was doing wrong -- when inserting the memory card, slowly keep pushing it all the way to the left until you almost can't see it anymore. It will click again and the phone will make a beep. It's deceiving because you get a premature click when the card is inserted even though it's not all the way in. I've read that a lot of people were having a problem getting memory cards to register, and my guess is that they are not in all the way. (I bought the Kingston 4GB class4 card from Amazon and it works fine.)Good luck in your phone choice. I really adore my E51. It's sleek, slim, looks beautiful in silver. I've gotten a lot of compliments on it already, and it does everything I need it to do.", "Date": "July 8, 2009"}, {"Title": "NO AT&T; 3G!", "Author": "Christopher Haseman", "ReviewID": "R350QE5N7PNQSY", "Overall": "2.0", "Content": "Exellent phone. Light, funcitonal, fast, great design...one MAJOR flaw. You cannot advertise your device in America as a 3g phone if it does not support American 3g spectrum. This is NOT a 3g device if you want to use it in the states!!", "Date": "September 8, 2008"}, {"Title": "An Excellent Mobile Phone", "Author": "Gonzalo Damonte", "ReviewID": "RDKTCAUVLHA7", "Overall": "5.0", "Content": "I've tested my new Nokia E51 for 1 month and It's really good. The screen size it's good enough to dive into simple web pages. I use the nokia mail application with success via Wi-Fi without problems.The volumen buttons are a bit hard, but this is not a problem.I'm realy happy with my E51", "Date": "August 6, 2008"}, {"Title": "One of the best mobiles NOKIA'S ever made ~BUT dont get me wrong it has its FLAWS", "Author": "G. Zahariev", "ReviewID": "R22M17Z43YFP5R", "Overall": "5.0", "Content": "Count on my words, forget the CAMERA, except that there's absolutely no way u can find a fault with this gem. Stainless steel body: even hard drops dont leave a smudge.. Extra fast processor: menu and applications are super-quick. Great sound clarity, lightweight and slim design, truly a great performer. S60 3rd ed platform: supports every application on the market, Amazing range of connectivity options: HSPDA, EDGE, Wifi, Infrared, all TOP class and HIGH speed. Phone memory is 135 MB!, 46 MB RAM, ~356 Mhz processor, upto 4 GB expandable..... the list is endless, great ergonomics and looks... ONE OF THE BEST MOBILES NOKIA'S EVER MADE.So customize it the way you like, YES you can upload whatever you wish: music, pictures, maps, calculators, word, excell, pdf...BUT dont get me wrong it has its FLAWS. Enjoy", "Date": "December 5, 2008"}, {"Title": "Great LITTLE phone", "Author": "Bud \"Bud\"", "ReviewID": "R2KGX4YQKHA7O5", "Overall": "4.0", "Content": "I had this phone for a couple of weeks before returning. It was great while I used it, but the screen was smaller than I expected and to be truthful it was a little more of a phone than I needed. I got it for the Wi-Fi and used it a few times. But, I was not aware of the higher internet access cost of using a phone like this. If I was willing to pay for the higher PDA type account I might have kept the phone.", "Date": "May 31, 2008"}, {"Title": "Phones are not oroginal and refurbished.", "Author": "G", "ReviewID": "R3798A9CBP4K86", "Overall": "1.0", "Content": "New Phones were ordered. However received phones are used and refurbished. Visible tracks of usage on it. Box, instructions, charger, cables, headphones and other parts are attached are NOT original.\"", "Date": "December 31, 2012"}, {"Title": "Best Nokia Business Mobile", "Author": "DEEPU \"DEEPAK KOSARAJU\"", "ReviewID": "R3GTTR28GGBZRE", "Overall": "5.0", "Content": "I used it for more than an year, Its light weight easy to carry and that's the one of the main reason I purchased this mobile.", "Date": "November 23, 2010"}, {"Title": "Best Phone I've Ever Used", "Author": "Leroy Landry \"New York\"", "ReviewID": "R37DA96VBCPKNO", "Overall": "5.0", "Content": "I got this and used it with my T-Mobile Flexplay plan and it is the absolute best. You cannot buy a phone through the major U.S. carriers out there that can even compare with this phone. I owned a Blackberry Storm before this, which was supposed to be a very high tech phone. The features were OK but the phone just had too many problems. After using the Nokia E51, I think I will be a Nokia smartphone user for life. No problems and there are more and better features on this phone compared to the Blackberry. If you are a business user, this phone is perfect. The battery life is also very good and lasts a long time even when I use it constantly to surf the web via wifi. I get compliments by people telling me how \"sexy\" this phone looks with the silver chrome. Overall, i would definitely recommend this phone to anyone.", "Date": "August 8, 2009"}, {"Title": "Great Phone for price", "Author": "J. Harvey", "ReviewID": "RIJ98VQ8X9J66", "Overall": "5.0", "Content": "This is an excellent phone for the price and quick replacement when I had to return my company's Blackberry. I was recently in London and it supported  international calling with excellent clarity. It supports 3G spectrum. If you've own previous Nokia phones then you'll know how easy it is to navigate this phone. This is a simple smart phone which handles well. I have very few to no missed calls. It doesn't replace the blackberry, however it came in handy.", "Date": "June 20, 2009"}, {"Title": "confused", "Author": "Desdemona Grant", "ReviewID": "R1SSYCZHF0EG7F", "Overall": "3.0", "Content": "The phone has a good look, but it keeps rejecting my sim card. The on button is difficult to press and can't figure out how to get mms to work.", "Date": "May 31, 2009"}, {"Title": "the best nokia phone out there", "Author": "B. Agyemang", "ReviewID": "R14Z3XXIC27462", "Overall": "5.0", "Content": "this phone does morethan its size there is onething that i want to share with you all and that is this phone is gps capable you can download google maps on it .but it wasnt stated in the discription on here so yes it is us 3g with at&t; and gps capable very fast phone when browsing the internet", "Date": "May 21, 2009"}, {"Title": "Good phone", "Author": "paracicy", "ReviewID": "R1IIS8R9OMFLA", "Overall": "4.0", "Content": "I'm been using this phone for like 6 month and I'm satisfied with the purchase. The call quality is good (and it comes with headset). S60 is easy to use. You can view PDF, word, ppt... but the quality is not that good. You can also synchronize your calendar/contacts/.. from outlook through the PC Suite software (download the latest version from their website, the one in the box is old) with bluetooth. If you use wifi then there's a lot of applications available: Gmail, Google Maps, IM... I dont really use it to surf web cuz the screen is too small and it isn't easy to use a keyborad to navigate, but the browser does display real html pages as you see on your PC.Cons:1. Screen not big enough2. When I received the phone I found there's slim gap around the thing that covers the camera len. After a while my len is covered with dust and there's no way to clean it. I don't use the camera anyway. But I think Nokia should pay more attention to details like this.", "Date": "March 26, 2009"}, {"Title": "If you like performance, this is phone is for you.", "Author": "David Houngninou", "ReviewID": "R3U9BAM5WGMQ1V", "Overall": "5.0", "Content": "I always wondered why most of the new phones out there dont last more than a day in autonomy. Packed with so many useless features that drain your power out before you even know it. If you like battery performance and want to use a phone with great Autonomy, this is the phone you need. Essential features for a professional and business use, on top of a reliable power source. You get a least 5 Days, with a reasonnable use. If you are a big traveler and dont want to worry about carrying you charger everytime, you will love this phone.Strong Built, 3G capable, GPS, 2MG camera, wi-fi,  music/Video player, nice shortcuts keys, Very light a stylish for a smartphone .... too many pros to list hereI recently switch from my samsung Omnia because that thing was dying on me all the time. 24h of autonomy and absolutely no more, it was a pain.Also it took forever to charge up. Bought at 400$, It was draining power like a beast and running multiple useless applications on the backgroud.I sold the OMNIA it and now Im happy with my NOKIA E51.This phone phone cost less than it should, make a smart move and im sure you wont regret it.", "Date": "February 19, 2009"}, {"Title": "Good option", "Author": "A. Orlich", "ReviewID": "R3JHHI709217PS", "Overall": "4.0", "Content": "The phone looks and works great.  It is very light.  Its Wifi capabilities are very handy, its computer software very easy to work with.  Good shortcut keys to facilitate most common actions.  Good memory space.  The only complaint is that it heats in calls over 20 minutes, sometimes cutting the phone call connection.", "Date": "January 20, 2009"}, {"Title": "Good and solid phone", "Author": "Spontini \"Radio Ga Ga\"", "ReviewID": "R266BQF1JIG2KO", "Overall": "4.0", "Content": "I bought this product as replacement of the Google phone G1. I wanted to downsize a little bit after owning every gadget known to men...The E51 does everything well, is very light, very easy to use and very stylish. The only negative for me is the lack og compatibility with the different 3G networks offered in the U.S. Whether it's T-mobile or Att, the E51 is not compatible with their 3G networks.", "Date": "January 11, 2009"}, {"Title": "Good all around phone", "Author": null, "ReviewID": "R3DNR9F966N5Y7", "Overall": "5.0", "Content": "The list price is NOT [...].  If you head over to Nokia[...], you'll see that the list price is actually [...], so you're not really saving much.  Other than that, this is a great all around phone, especially if you've got a standard VoIP line (Broadvoice, TeleSIP, etc...NOT Vonage).  My son bought this and won't stop raving about it.  The fire and ambulance stations where he works have WLAN, so he saves cell minutes by using his unlimited VoIP minutes from his phone to make calls.  If this phone were compatible with Sprint, I'd get it for myself.", "Date": "November 14, 2008"}, {"Title": "it does every thing its supposed to", "Author": "King Fahad", "ReviewID": "R3178AXVAHFY3Q", "Overall": "5.0", "Content": "i have gone through this phone from a to z . it does what its supposed to and the reception is also very good, i replace nokia N75 with this and both on ATT network. for some reason with this phone i get better signal at every location. love the WIFI feature not to mention VOIP, loaded Fring software on it, which lets me talk to anyone who has the same software on thier phone with a wifi connection for free no matter where in the world they might be,  the battery had good life unless i have the bluetooth and wifi tuned on, they both are gas guzzlers, some fonts are too small where they could have been larger, . i will get the same phone in a couple of years if they still make them.", "Date": "October 3, 2008"}, {"Title": "Sleek and functional", "Author": "K. CHAUDREY", "ReviewID": "R1W0GLFW2QFMLH", "Overall": "4.0", "Content": "It was gifted to me by my husband. A sleek and functional equipment. I needed something light weight and slim that would fit my clutch bag that I use at work. Even though I have to say that it has too many features for a technology naive person like me, it is highly recommeded for people who are more hands on with cell phones and want multiple features in their cell phones. I do love it still.", "Date": "October 2, 2008"}, {"Title": "Nokia E51", "Author": "A. Gibbs", "ReviewID": "R2C4NN1JZ535SX", "Overall": "5.0", "Content": "I love this phone! It is not too small or too big. It has several office applications that I like, I sent my work schedule to it. I also really like how the profiles can be set so they only allow certain users to get through.  I won't have to get a new phone for a long time now.", "Date": "July 21, 2008"}, {"Title": "Cool Phone", "Author": "Alan Heidt", "ReviewID": "RAYT4F5MSFEH1", "Overall": "4.0", "Content": "Phone works well (I use AT&T;) and has a great feel. It's very well made, the only comment is that the keys are a bit small but OK given the small size of the phone itself.", "Date": "June 11, 2008"}, {"Title": "Nokia E51 Black Steel Smartphone (Unlocked, U.S. Version) Full Warranty", "Author": "Neil D. Parrott", "ReviewID": "R2JC2Z1TC2J1R", "Overall": "5.0", "Content": "The E51 is a great business phone with seamless PC integration to MS Office and Lotus Notes. This 3G smartphone includes the ability to place VoiP calls over WLAN which means you should never be out of touch. The E51 packs a lot of capabilities into a small candy-bar form factor topped off with a clear display, precise key pad and great battery life.", "Date": "April 7, 2008"}, {"Title": "Not a bad phone", "Author": "J. THANGAVEL", "ReviewID": "R2P6ZACL4O2XP3", "Overall": "3.0", "Content": "The phone is fine. But the problem i notice is the battery. it drains very fast. it does not hold for more than a day even for a vey normal useage. It is very unlike of a nokia battery. I have been using nokia phones for almost 10 years. Used most of the nokia models. but this is the one i am not satisfied with the battery.Browing is not very comfortable, I think it should be accommodated considering the size.If some one likes to use a nokia phone then they will definetly like this phone except for the battery.", "Date": "November 4, 2008"}, {"Title": "Cool as ice and it freezes most of the time...", "Author": "Mr. Andersen \"4B11T S-AWC\"", "ReviewID": "R986ZIUCS2U62", "Overall": "2.0", "Content": "As soon as I unpack the box, I was very impressed with how the phone felt in my hand.  Top notch quality, stainless steel, perfect size with WiFi, bluetooth, IrDa.Size: I remember my old Nokia 8890.  I thought I would like to have a similar sized but with newer technology in it.  The E51 fits my ideal phone.Interface: very user friendly!  I can easily find the menu that I needed.Battery life: mediocre, it only lasts a day an a half and thats not even using the phone as much.  90% of the time, I use it for text messaging.Just a few days later, it started to freeze.  I had to restart everytime.  I might send this back to have it looked at, or not.Cool: The text to speech is nice.  It rings and then says the name of the caller. (must be in your contacts)", "Date": "October 12, 2008"}, {"Title": "Bought this phone for use overseas", "Author": "Luanne Klondyke", "ReviewID": "RHSEJO8GDSETR", "Overall": "4.0", "Content": "So far I really like this phone.  The simple shape and size are perfect and the buttons are large enough to dial a number easily.  I bought this unlocked phone to use in Europe and New Zealand.  As of today I have not been overseas so I can't recommend it for that use.  I did buy an ATT SIM card in an ATT store and put it in the camera. ATT and T-mobile are the only carriers I am aware of that use GSM, which is the universal (everywhere but the USA) cellphone technology.  So far it has worked good in the USA.  I was also able to take my long standing ATT phone number SIM card, that I've have for several years and use it in this Nokia E51 phone.  I tried my Tracfone SIM card but it would not accept the Tracfone SIM.  I don't know if Tracfone uses GSM.  I plan on purchasing a SIM card for the country I visiting IF I plan on making lots of calls, locally.  For the occasional call back to home I will turn on International roaming with ATT and anyone can reach me on my regular USA phone number.  Problem is the cost is about $2.00 per minute.  OK if you can't be bothered with an overseas phone number and only need to talk to home a couple times, briefly.  I want the ease of being able to be reached from my regular cell phone number and be able to switch the SIM card to use the phone locally but cheaply.  I also like the built in MP3 Player, FM radio and bluetooth of the Nokia. I only gave 4 stars for now since I have not proven its ability to works overseas.  If you just want an unlocked phone and GoPhone prices from ATT this is better than any of the locked phones ATT offers with their GoPhone plans.", "Date": "June 1, 2008"}, {"Title": "Last Nokia i buy for another 5 years", "Author": "Daniel M", "ReviewID": "R3396IWQX7XKFT", "Overall": "2.0", "Content": "I bought this Nokia thinking it has a great feature set and I will admit that on paper it does, however when you get to using it that the problems start.Screen... I have a Blackberry for work and had a SonyEricsson for personal use; they have been banging around in my pockets along with my keys for close to a year now without a single problem or scratch.  After half a day in that same pocket with the blackberry and keys the Nokia's screen is already scratched.  This of course means they skimped another $1 on the coating for the screen and we all know the result.Features...I chose this phone because I thought I'd be able to use it with Skype anywhere I had a wifi connection and sometimes I can, but for the most part the reception is shaky at best when and only when it connects correctly and doesn't kick me off the network.  I also had my SE connected to my car (Audi A4) via Bluetooth with a great function that let me read my phonebook from my car nav screen.  The Nokia can't do it!! This really upset me so I did some research and discovered that Nokia did not include the complete Bluetooth stack in the phone and will not update this in the future.  One would think that adding another small bit of software to create a better product would be a good investment, but apparently Nokia thinks differently.Battery Life...The battery lasts for ages and I will admit they did a great job with it.  There is one thing about charging the phone that I do have a gripe with.  This phone cannot be charged via USB.  It has the connector for mini USB, but its only for data, a separate plug is needed to charge the phone.  This of course means carrying around more cables. yay.Camera...The SE w810i I had also had a 2megapixel camera, but it had things like Macro and Autofocus so even though this phone has a 2 megapixel camera good luck using it without any kind of options or functions.  I tried taking a picture of text as I often did with the SE to save some time and the hassle of pen and paper, now I can't even do that because this phone can't focus.Reception...The reception is great BUT THIS PHONE IS NOT 3G!!!!!!!  Yes it is 3G in EUROPE, but ATT uses the 1900 UMTS frequency in the USA for 3G so it will not work with 3G in the USA.  Goodbye blazing fast speeds when there is no WIFI.I had a Nokia a Long time ago and though it might be time to give it another try, but I think I'll wait another 5 years to try them again.", "Date": "May 17, 2008"}, {"Title": "Terrible phone", "Author": "Erawl", "ReviewID": "R1OITEC6WC95BG", "Overall": "1.0", "Content": "* You can set the keypad to automatically lock after some period of time, but it wont automatically lock unless you are at the HOME screen.* Can not get WLAN to work. Tried multiple Wifis, at home and free public ones. Simply does not work.* Bluetooth doesnt work. I have a brand new Plantronics earpiece, and I wasted an hour trying to get this phone to use it. No dice.* The soft key on the upper right can only be used to access the camera; something I rarely (never) use. Moreover this soft key cannot be remapped to something more useful, like your SMS inbox.* LCD screen is not firmly bonded to the inside of the trim bezel, so pressing the soft keys causes the screen to displace inward, making creaking sounds; This gives rise the phones cheap construction.* For the money I spent, worst phone I've ever had. I had it for two days, then returned it.", "Date": "June 18, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000W3QHDE"}}