{"Reviews": [{"Title": "Hidden fees, false claims, and questionable signal quality.", "Author": "MichaelFlores", "ReviewID": "R1EA06GPO1H1JG", "Overall": "1.0", "Content": "Hidden fees, false claims, and questionable signal quality.I am just a causal user, not one the oil roughnecks on the tundra or the high-flying mountain climbers on the summit of K2.  I live up here in Missoula, and a couple times of year I enjoy spending time back in the Bob Marshall Wilderness and a couple weeks a year at our timeshare in Los Cabos.I bought the phone so that I can stay connected to the office [only when I need to], check and see how my kids are doing, and to do some email and web when needed.  Fair enough.I called Globalstar and asked them if they have service in Montana and Mexico.  Funny, the Customer Care Rep. answered the question with an emphatic yes, before I even had the chance to finish the sentence.  Were they even listening?  I'm not so sure, and here's why.I agree the phone service is not cheap - I had to pay $1.39/minute for roaming fees on top of my $49.95 monthly plan just to use it in Mexico.  But when I signed up for service, I was told that I would get xxx number of minutes to use anywhere I want.  I wasn't told that Mexico is not included in my minute package, and that was a surprise when I first saw my bill.In terms of quality, the phone has worked \"fair\" to date.  On some occasions, it has been nice to pick up the phone, make my call, and move on to other things.  I just wish that was always the case.  More often, I have to wait a lot to get my 3 bars.  It's been very frustrating when the call drops, and the voice on the other end vanishes. Hello?.?  It was an embarrassment when I gave my 1700 phone to my boss (I'll protect his identity) when we were down in Cabos together. I said, sure go ahead and use my Globalstar phone to call back home - you'll love it.  He spent about 10 minutes standing waiting for a signal, and I am standing there sweating.He didn't make his call.Back in Montana Globalstar gave me another problem.  I know the service has gotten better, but I also know that that is an overstatement.Since gaps in service and dropped calls are a way of life on Globalstar, I always have to use Globalstar's Call Times Report to see when is the best time of the day that I can make calls on my phone from outside the Bob Marshall here in Montana.  I printed the report, took it with me, and had a heck of a time still making calls that week.  I followed the report to the T, and it still did not work.  I called Globalstar Tech Support and asked them why the Call Tool did not work.  The rep then asked me, \"are you in a mountainous area, or out in the open\"?  I found that mildly amusing, since I stated I was from Western Montana, trying to use the phone next door to Glacier National Park.  The Globalstar rep., responded by saying, \"well I am sorry but the Call Tool  does not take into account mountains or other obstructions to the sky\".  That's why I bought the phone to begin with.  And, why have such a tool if it cannot emulate real world scenarios?The long and short is, the phone and customer support has always given me trouble.  When I bought the phone, I was told that there are \"monthly service plans\", so I signed up for them.  It was implied that I can use the phone on a monthly basis.  Turns out, all plans require a 12 month contract (even on monthly plans), and if I did terminate service prior to the contract term, I have to pay an early termination penalty.  So now I am stuck with this phone and service, and have to wait until my 1-year contract is up before I unload on it.In short, I am weary of Globalstar's blind statements that \"service is better now\", etc. Truthfulness and full disclosure don't seem to be a part of their nomenclature.It's now Saturday and I want to talk to someone at Globalstar and put this all to rest, but I just got a recording that Customer Support is closed up on the weekends. Is anyone there or does anyone care?Would anyone like to buy a used Globalstar phone?  It's in very good condition, and has been hardly used..", "Date": "May 25, 2013"}, {"Title": "Fantastic phone, service getting better each month!", "Author": "A. Mahn", "ReviewID": "R3BYMCSE8DIJ5K", "Overall": "5.0", "Content": "First of all, the GSP-1700 is one of the most affordable satellite phones on the market. Manufactured by Qualcomm, it has a full fledged address book, location service, and ability to receive SMS messages and short e-mails. The service is only $20 a month for unlimited calling from North America to North America, and prices are what you would expect when in or calling to other countries. The overall size of this phone is fairly compact and doesn't weigh much more than say an iPhone 4. It's definitely much smaller than the older GSP-1600 phone and lighter, too.It supports a data connection via USB through an optional (but sadly, proprietary) USB cable. Data rates are acceptable, and the data service is included in the $20/month plan. Overall, the accessories are a bit expensive as with Iridium and Thuraya products, but I'm happy to support Globalstar.So, the catch to a cheap phone and unbelievably cheap service? Globalstar's first generation satellites have begun to fail and Globalstar is around half way complete in launching the second generation system. For most people in North America, this means a typical call time is about an average of 15 minutes, with the maximum being 45 minutes (or sometimes longer in some cases) before the call is dropped. Once the launches are complete, the service will return to the same great reliability they were known for in the late nineties. As my dealer put it, Globalstar is looking to become \"the WalMart of satellite communications.\" Service area is most of the world with the exception of southern Africa and the poles.Service quality, when connected, is amazing. There is no detectable lag or delay as Globalstar uses a bent pipe system, in that what gets sent to the satellite gets routed to a ground station without going through additional satellites. The call quality is compressed minimally, and to me sounds far better than a cell phone and just as good as most landlines!I highly reccomend investing in both a GSP-1700 now (they come in three colors!) and a 1-year service contract. I suspect that the price will remain at or around $20, but wouldn't be surprised as the reliability increases that the price will too. So grab a year of service now and lock in this amazing deal. This is a priceless and valuable tool to have if you travel out of the range of cell service. In the case of a natural disaster, this will continue to function beautifully even after cell phone towers are jammed, destroyed, or turned off such as in the case of Hurricane Katrina.", "Date": "September 22, 2011"}, {"Title": "Good so far...", "Author": "Tampa Buyer", "ReviewID": "RD918JW644NF0", "Overall": "4.0", "Content": "UPDATE: Still working well and I ordered the data cable.  It was easy to configure using Ubuntu 12.04 using gnome-ppp.  I set the baud rate to 38K, the number to #777, did a dmesg to get the device name, chopped the FCLASS command off the init string.  Went outside, and started using sudo from the command line and - connected perfectly.  The data rate was a little less than 9600 baud as expected.  Still definitely better than no internet at all in an emergency or in the wilderness.I've only had mine a couple weeks but my initial impression is good.Be sure to check out the \"Globalstar call times tool\" on their website.  Their service has indeed improved from \"horrendous\" to \"barely tolerable\", a big improvement.  At one time the phone only worked a few minutes each hour.  Now across most of the US its more like 45 minutes or so with their recent launch of satellites by the Russians.When I first got the phone it was immediately a warm and fuzzy feeling of back to the stone-age.  Because it looks and works like a cell phone from 10 years ago.  That was kind of a disappointment because the user interface is so clunky and dated.Once you get past that and extend the giant antenna, it picks up a signal in a couple minutes (assuming its not too cloudy and you are in your calling time window and are standing in an open field with the antenna pointing straight up).That is when the phone really shines.  Crystal clear and NO LATENCY like a \"normal\" satellite phone.  The low earth orbit is the reason why.  With a regular satellite phone there is a huge delay and its more like a walkie talkie.  With globalstar the people I called thought I was on a regular cell phone.Other negatives are overpriced accessories like a spare battery or data cable.  Hopefully the Chinese will step up to the plate and make some cheap clones.A bit pricey if you count the price and one year at $39.95 I am into this about $900.  And expect them to raise the rate again in a year if they continue to launch satellites and improve the service.But I like to go backpacking in wilderness and its worth it for my piece of mind.Besides the clunky interface Globalstar is also a little stone-age.  I had to fax in a spreadsheet to activate the account, then pester the customer service email address to find out when it was active.  Sheesh you'd think if they could launch a satellite they could launch a few web pages and let you register online.You can tell if your dealer is a crook (like mine) because they never bother to mention that Globalstar only works some of the time.  Fortunately I already knew that.  Honest dealers are supposed to tell you in advance.But I'm giving it 4 stars for now because its working as well as expected.", "Date": "December 11, 2012"}, {"Title": "Globalstar changes", "Author": "Sunny Every Day \"marrandy\"", "ReviewID": "R2OMWFV4FJH7NY", "Overall": "2.0", "Content": "Globalstar has their final new satellites up but they are not all active as of this date so there are still gaps.It doesn't work well in cities with tall buildings and, more importantly, it doesn't work in forests.  I had to hike 10+ minites to find eneough clear sky and then wait to finally get a usable signal, that then vanished during the call as they use low orbiting satellites instead of geo-synchronous.They have now changed their pricing.  Unbelievably, on the lower Two plans they are charging $4.99 for voicemail even though the voice is Allison that is used on Asterisk and FreeSwitch, both open source, free projects.If you buy a whole year ($480 plan), you save an amazing $0.12.  Yes really.  They actually expect you to pay in advance for a years service for the princely savings of 12 cents.There is no rollover, not even one months, so you had better use everything you have paid for.  I bet there is no warning (press x to pay the excess charge) and you will just be billed double the amount for excess minutes (it works out at 50 cents per min on the $39.99 p/m plan and 99 cents per min for the excess.I think they will lose a lot of customers this year if they don't change their ways.  They still have an unlimited, which will no doubt be abused, so I really don't know why they do that.  Silly PR that internet companies do but then give themselves an out by dropping you.  So what is the point besides alienating customers and inviting lawsuits.Its highly likely I will sell my phone and car bag kit when the contract is up as it barely works where I need it, on my land that is forested.", "Date": "May 17, 2013"}, {"Title": "Customer Service ZERO stars", "Author": "L. Hernandez", "ReviewID": "R1XKJ75JJUYH85", "Overall": "1.0", "Content": "Ordered the phone for my boss and he didn't like it, total piece of junk so I sent it back for a refund. Didn't even activate the phone and received a bill! It has been over a month and I am still waiting for a credit back for the phone. The customer service is really bad. I can't ever get a straigt answer when I call with questions. I even sent an email regarding my frustrations with this whole expierience and all I heard was crickets. They don't care and are taking their sweet time with giving me a refund. I ended up buying am Iridium phone for $1500 through Amerizon. The customer service and phone are both excellent! I can't wait to get my credit back from GS so I don't have to deal with them anymore!!", "Date": "June 27, 2013"}, {"Title": "Customer satisfaction", "Author": "Tonatiuh Espinosa", "ReviewID": "R42NZ0NF2T75", "Overall": "4.0", "Content": "I bought this product as a gift and is effectively what I requested. Although untested, I hope to work properly. The seller has shown interest in customer satisfaction.", "Date": "November 12, 2013"}, {"Title": "GOOD PRODUCT BUT NO HINT OF HOW TO OBTAIN SERVICE", "Author": "Ray L.", "ReviewID": "R3GZ1LYP8DOSBE", "Overall": "4.0", "Content": "GREAT BACKUP TO CELLPHONE SERVICE IF YOU LIVE IN OR TRAVEL TO AREAS WITH NO SIGNAL STRENGTH FOE YOUR CELL.GETTING SERVICE WAS AN ADVENTURE BUT CAN BE DONE IF YOU KEEP TRYING.HINT: GLOBALSTAR.COM.", "Date": "December 21, 2012"}, {"Title": "Great Phone", "Author": "John Reamer", "ReviewID": "R15Y69FDHPWAEA", "Overall": "4.0", "Content": "This phone works well for me. It is not the sturdiest phone I have used but seems adequate. My only complaint is it is difficult to get reception with the antenna stowed. Basically if you want someone to be able to call you in the field you need to have the antenna extended. The problem is it feels fairly fragile. I made a pvc pipe tube to carry it on my pack with the antenna extended and it seems to work well with no affect on reception. The call quality is excellent and the coverage is great. I have had no trouble making calls and the phone takes seconds to connect with a clear view of the sky.", "Date": "April 18, 2013"}, {"Title": "Perfect for places where cellular service doesn't exist.", "Author": "DLS Proctorville Ohio", "ReviewID": "R3VIVIJ3VABY5O", "Overall": "5.0", "Content": "Love this phone - great reception - perfect for the out of the way places that do not offce cell service and YES there are still places on this earth that do not have cellular phone service.", "Date": "March 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000O9FS1I"}}