{"Reviews": [{"Title": "Large, but one of the closest things to PC in your pocket", "Author": "Andrius Uzkalnis", "ReviewID": "R36I0E6HDXO6QN", "Overall": "5.0", "Content": "Only one downside: when closed, it looks like a cell-phone that belongs in the 90s. But open it, and you get as close to PC functionality as any palmtop/smartphone-sized device would take you.And the bulk and the weight is there as a price to pay for one essential killer feature: the most usable, reliable and fast QWERTY keyboard in the business. Before buying it, I read some rave reviews about how fantastic the keyboard is, and I was sceptical: I have seen too many lousy little QWERTY keyboards that did not even come close to being a viable typing instrument. I bought it and, before I knew it, I was doing typing on it - sometimes two or three pages - without any noticeable discomfort.The e-mail client is brilliant, with a great balance of complex functionality and bandwidth economy. The web browser, although Opera-based (it has its limitations), is usable, considering the tiny screen for web work. The screen size (very good for e-mails and Word documents) is the true reason why the functions of Excel-compatible spreadsheet and PowerPoint are really just fancy \"can-do\" features rather than realistic work tools.Even synchronization (for a long time, it was a sad shortcoming of Nokia smartphones) has now been sorted, and the supplied suite works well.A good alternative to Blackberry-type email-only devices in a solid and reliable Finnish build.", "Date": "December 10, 2005"}, {"Title": "you're gonna love this phone", "Author": "J. Malnar", "ReviewID": "R3883QAEQWZYV3", "Overall": "5.0", "Content": "if you get rid of the stupid connotation that a cell phone has to be so small you have to hold it with tweezers. You're gonna love being able to browse the web on it, watch movies you took of your kid, write sms and take care of business or fun while in boring 4-hour meetings, its calendar which reminds you of all important dates and dates of your life, you're gonna love the fact that when you spot coppers you just have to opent it, put it on your lap and you can continue your convo inconspicuously on speakerphone until darned police is out of your hair. I'm a chick and when I see huge huys handling miniature phones I CHOKE WITH LAUGHTER. This phone can fit in my pants pocket, and when/if I dont have a pocket to stick it in, I've been known to carry it in my boot, bra, and stuck in my pants on my back. And it it fits into a chick's boot/bra, then its not too big for what it offers. I've owned communicators for 5 years now and I will NEVER EVER be without one. Nuff said.", "Date": "May 19, 2006"}, {"Title": "Its a business phone", "Author": "Tariq Alhassomi \"TOA\"", "ReviewID": "RHC7P308AC2OZ", "Overall": "4.0", "Content": "I bought this phone last year as a business phone, integrating its capabilities with my work and business life.Wireless conectivity is a big plus connecting to wireless networks its great i use it home and outside, music is available as an mp3 player, all office products available also camera and a cool keyboard for typing.Try ti get third party programs such i use as power safe and PDF and other stuff, one big thing from my experience, the phone doesnt recognize my home wireless network while blue tooth is switched on, when i turn it off it doscoveres the network so wireless doesnt work with blutooth at the same time!!i coudnt find till now a connection to car audio with this phone, so i cant listen to music on my car audio, i coudnt find a separate phone stand also for it.the package includes the desk stand with charger and head phones only.As i said its a  business phone, i have another phone motorola Razr v3i for daily use because the Nokia 9500 is big i use only for meetings and business life.THanks,;)", "Date": "April 27, 2006"}, {"Title": "Great Phone...", "Author": "Cliff Calhoun", "ReviewID": "RYZ3EMG57140T", "Overall": "5.0", "Content": "This phone is designed to keep you in contact from where ever you are.  Cell, WiFi, bluetooth, etc.  All work as advertised.By most standards, it is large and heavy but, it is the best phone that I have ever used.With T-mobile in my area, the 9500 has the best signal of any phone that I've ever had.  I also like that I can place the phone on a flat surface and use it similar to a laptop computer.  Placing calls in my car, searching for contacts, phone numbers, speakerphone, etc. is very convenient using this method.Outstanding product by Nokia.", "Date": "September 23, 2006"}, {"Title": "Retro 80's telephonic brick - Don't buy, unless you're Magnum PI!", "Author": "Soren Burkhart", "ReviewID": "R34RLUNPQUO0QB", "Overall": "1.0", "Content": "Just got the phone today, and after a short test I am returning the phone today.What a disappointment. I am currently a Nokia 6820 owner and I was I was expecting a slick phone with a lot of ease of use, and instead all I got was a brick of a phone with minimal features.Cons:- This phone is huge!  It looks like you took a cordless phone and were carrying that around as your cell phone. To give you an image you could hold up a croissant to your ear and it would be smaller than this phone, and look less silly!:)- Speakerphone only works when the clamshell is open.  When I am driving down the road, I like to put my phone into speaker mode.  In order to do that you have to open up the clamshell which is a real drag, since it will only waste battery power to display the screen to run the speaker.- No thumb joystick.  On the 6820, one of the best things about the phone is the ability to quickly navigate with the thumb joystick.  That has been eliminated on this phone.- Keyboard is ok, but I type faster on the 6820. Given the large size of the 9500 you need to balance the phone more to type.  If you are a hunt and peck typer this may be ok for you, but if you are used to typing up a quick reply in less than 10 seconds this is not the phone for you.- Can't check email from the main display. Once again in order to look at email you have to open the clamshell.  You should be able to look at emails from the outside of the phone.- No easy PDF viewer.Pros-+ 128MB Memory Card+ Word, Excel, Powerpoint viewer, but it doesn't have the pdf capability that I could find.+ Sound quality of the phone and the speaker phone are up to Nokia standards.I had high hopes for this phone, but it does not deserve the Nokia name.Soren", "Date": "March 29, 2006"}, {"Title": "GREAT AGENDA AND PHONE, A LITTLE BULKY", "Author": "Antonio Pietrangeli", "ReviewID": "R182PA8QH38FF0", "Overall": "4.0", "Content": "I'm a civil engineer and i was looking for a PDA which could help mainly as an agenda and for keeping notes during the meetings.I have used three windows-os based PDA's but I found that the operating system was not fully reliable and software was sometimes complicated to use.It happened to me with the I-mate JASJAR ( generally a quite good machine ) to loose one important meeting because the alarm didn't ring and twice the software crashed while I was writing extremely important notes.I moved to the nokia communicator 9500 and I loved the software that perfectly suits my requirements ( agenda, short notes, some calculations, good alarm, some small use of e-mail and web ).If compared to the I-MATE JASJAR the Nokia is well built but a little bulky ( a little bit too long and thick for my pocket ), the screen has only 8 lines while working with word ( compared with about 12 of the I-mate ) and processor is slower ( particularly if you open large files ).However the software is so reliable and easy to use that I could never go back to windows OS any more.", "Date": "July 31, 2006"}, {"Title": "A vintage classic, but no 850 MHz", "Author": "jayessar", "ReviewID": "R26X1A3IGSVPT0", "Overall": "4.0", "Content": "I bought this phone new years ago.  It was the original smartphone, and cost me $700.  Users in the US need to be aware that it works on GSM frequencies 900/1800/1900 MHz.  It does not work on 850 MHz.  In the US, 900 and 1800 are not used for cell phones.  T-mobile uses 1900 and roams on 850.  ATT works primarily on 850 with some 1900.  In the past, I used this phone with a T-Mobile SIM all across the US, and it worked almost everywhere I went.  In those areas where there was only a 850 signal and no 1900 signal it would not work.  This phone also picks up WIFI.  The 9500 can be compared to the Nokia 9300, which did not have Wifi, but the 9300 phones sold by Cingular were manufactured to use 850 instead of 900MHz.", "Date": "November 12, 2012"}, {"Title": "Good Phone", "Author": "Maninder Pal Singh", "ReviewID": "R119777Y0BRQBD", "Overall": "4.0", "Content": "This is a professional business phone. Apart from the routine stuff in the mobile phones , 9500 has fax/ data feature this is the best thing I like about this phone. You can send & receive faxes. Now that makes you real mobile.Although it is bulky but I think one gets used to it pretty soon.Excel, Word, Power point documents can be viewed & edited.The screen size is wide (112mm wide) so browsing email is cool.Everything you can think of is there in nokia 9500. Without the stupid softwares like calorie counting, shopping list, etc etc which I don't think people use.However with blackberry & treo 650 coming this phone was loosing charm BUT THE GOOD NEWS IS THAT NOKIA IS COMNG UP WITH A NEW Software \"Business Centre. Which will be compatible with all the 9500 & 9300 . This software has push in email like treo & blackberry.", "Date": "August 24, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nU.S. version tri-band GSM cell phone compatible with 850/1800/1900 frequencies and EDGE data capabilities\nFlips open to reveal full QWERTY keyboard and widescreen display; 80 MB memory with MMC expansion\nWi-Fi connectivity; Bluetooth for handsfree devices; email with attachments, SMS, instant messaging, and MMS options\nUp to 6 hours of talk time, up to 300 hours (12.5 days) of standby time", "Name": "Nokia 9500 Unlocked Smartphone with 3G, Wi-Fi, MP3/Video Player, MMC--U.S. Version with Warranty (Gray)", "ImgURL": "http://ecx.images-amazon.com/images/I/41JGC9Z4H5L._SY300_.jpg", "ProductID": "B0009VB0NG"}}