{"Reviews": [{"Title": "FANTASTIC CUSTOMER SERVICE", "Author": "Dr. James E. Price, Ph.D.", "ReviewID": "R3GCHAXOZ812X7", "Overall": "5.0", "Content": "This was a wonderful experience.  The Customer Service Department called me before the phone arriveed thanking me for doing business with them.  I was amazed and impressed by their courtesy.  They even included an unexpected accessory.  The phone works wonderfully - just what I wanted.  A high quality cost-effective cell phone for everyday usage.  They deliered me exactly what I wanted - and then added one of the finest examples of customer service I have ever experienced.", "Date": "March 13, 2008"}, {"Title": "Rip-Off", "Author": "Richard Laycock \"RCL\"", "ReviewID": "R35GS4BJ9S91RS", "Overall": "1.0", "Content": "The photo shows all sorts of extra gear but what was shipped was just the phone, the charger and the battery, in the box. Well, I could live without the holster etc but I was a little annoyed.  Then I switched my wife's SIM card to this flip phone as she wished and tried to charge the phone. The \"Travel\" mini-charger they shipped didn't work at all. No amount of wiggling or shoving would get any juice to flow to the battery. Then the $5 cheap POS jammed in the female plug to the point I worried about the force required to remove it.It did come in the box but with no paperwork of any kind, a totally worthless packing slip that excluded 80% of the items shown in the SEVEN hi-res photos posted on the sale site. Four photos of the v551 with the NASCAR holster. Four large photos. Holster not included. This is a Classic Bait & Switch. Write these guys off. Everything they've got for sale is available elsewhere from more honest vendors.Thank God I only got my wife's $60 flip phone from AllStar. I got the $200 Blackberry, which AllStar had for $135, from a truly professional dealer in New York. Everything came in as shown and advertised, working perfectly right out of the box. If that's what you're looking for, a fair and trouble-free purchase, then please skip doing business with AllStar Electronics.", "Date": "October 12, 2013"}, {"Title": "My Fave Phone!", "Author": "The Conqueress \"If I can't READ it, I'll WRIT...", "ReviewID": "R2HBBCEY1C3SNM", "Overall": "5.0", "Content": "I love this phone!  It does everything, and always has!  It arrived on time, as promised, enveloped in plenty of padding and secure packaging. No complaints whatsoever!", "Date": "September 15, 2013"}, {"Title": "Second Purchase Of Same Item", "Author": "R. A. MYERS \"R A Myers\"", "ReviewID": "R1AQ9WDOJHG50V", "Overall": "5.0", "Content": "This is the second time I've purchased this model phone from this vendor.  The second phone was in as good a condition as the first.  The confusion over the description was promptly and courteously resolved.", "Date": "July 29, 2013"}, {"Title": "nice phone", "Author": "watch lover", "ReviewID": "RVI3W90DCGEIU", "Overall": "4.0", "Content": "would love it if it were not so small. funcions very well did not try the photos but assume they were aequate", "Date": "April 23, 2013"}, {"Title": "Motorola V551 Unlocked Gsm Flip Camera Cell Phone Unlocked for Any Gsm Sim...", "Author": "old timer", "ReviewID": "R2C38C191GWI7I", "Overall": "5.0", "Content": "This was a replacement for the one I've had and liked. The only differance is that this one has the camera. The camera is not that great, but I don't need it any way. It's a good phone, and that's what I am after. I have no need for the \"fancy\" ones.", "Date": "April 11, 2013"}, {"Title": "As advertised", "Author": "Stuart", "ReviewID": "R1TBJPRX4ALGW2", "Overall": "5.0", "Content": "Phone is durable and simple to use compared to newer models and came \"on time\" and \"as advertised by vendor!", "Date": "February 6, 2013"}, {"Title": "Size of the phone", "Author": "Janet Marie Hart \"movie watcher\"", "ReviewID": "RJMY4FQG2I2NL", "Overall": "5.0", "Content": "the phone has good volume,size is good,clear pictureThis flip-phone is the best one I've had, thank youjust great phone", "Date": "January 8, 2013"}, {"Title": "Revie of Motorola V551 phone", "Author": "Jordan", "ReviewID": "R2SMOA49H2VG73", "Overall": "1.0", "Content": "This product did not work very well for me, but vendor I purchased it from was great.  He worked with me to be sure I was satisfied.", "Date": "July 23, 2012"}], "ProductInfo": {"Price": "$57.99", "Features": "Includes Charger\n\"A\" Stock Battery", "Name": "Motorola V551 Unlocked Gsm Flip Camera Cell Phone Unlocked for Any Gsm Sim Card", "ImgURL": "http://ecx.images-amazon.com/images/I/41sW0maI6ZL._SX300_.jpg", "ProductID": "B000PU4U2E"}}