{"Reviews": [{"Title": "Good phone for Media but not for Professional use", "Author": "An Nguyen \"anh2lua\"", "ReviewID": "R31IY7TJ96KCLW", "Overall": "3.0", "Content": "I like everything in this phone except the amount of internal memory, only 25 MB.  The extra 8 GB is good for music, media files, etc.I use this phone primarily for work because we push email, calendar, contacts from work email to the phone via a mobile solution.  The problem is that the phone has only 25 MB of primary storage so I cannot keep more than 3 days of email on the phone; otherwise memory will be low and you can't do anything with it when it runs out of primary storage.If you are buying this phone for entertainment uses, it is great choice.  If you are buying it for professional related use such as work email, it is not due to the 25 MB of primary storage.  You need to ge a phone with at least 64 - 128 MB of primary storage in order to store some decent amount of email on your phone.", "Date": "May 19, 2008"}, {"Title": "Good value for its price", "Author": "OnlyShopOnline", "ReviewID": "R89TITVSUN1FD", "Overall": "5.0", "Content": "Got immediately going with this phone.. WiFi capability is awesome.. easy setup.. quick connection...pop3 email support is easy to configure.. still loading up the 8GB memory with songs and softwares.. its like having a hand held computer... bought this phone over blackberry Pearl and a hacked-iphone. Totally worth it.. Graphics are too good and 3-D sound quality is awesome. There is some lag in starting applications (eg: Yahoo Go!) but it is not significant given the size of certain applications. Fun to play Fifa on it... visit n81 blogs for more... dont pay extra for brown color.. it is hardly visible.. the black face plate is stunning...battery life is good too.. needs charging after 3-4 days of use...", "Date": "February 5, 2008"}, {"Title": "One of the best phones out there", "Author": "A. M.", "ReviewID": "R2ARAAB3GI17CD", "Overall": "5.0", "Content": "I was amazed when I learned that I could buy this jewel at such a low price! So I immediately ordered it, and I was very satisfied at how fast it got here. The phone itself is amazing: the wifi is a huge plus, and the Symbian operating system is something that I wouldn't be able to live without.A few pros:- WIFI!!- quad-band, so you can basically use it anywhere in the world (needs SIM card)- amazing set of features for a low price- great battery life - up to 3 days if I talk for approximately an hour, use the wifi a little bit and play the game boy advance emulator for a couple of hours.- very cool design- nicely built, the sliding mechanism seems solid- the music quality - simply extraordinary!! (this should have been the first one in the list, the music part of this phone is incredible. The speakers are very loud for a handheld device)- the hands-free is really good- 8GB of memory. Why would you ever need more?!- the screen is perfect, very big and good enough even for watching videos on it. Web pages are easily read, even if there is a lot of text.- the gaming aspect - it's very convenient to have those gaming buttons on top of the screen. They are comfortable and do not seem prone to damage.- The operating system - you can install anything you want on this phone! To list a few, you can have Google maps, Youtube, Skype, and a whole bunch of emulators (Game boy, Game boy advance, NES, SNES... whatever you can think of :)- the SIP option - you can call for free over a WLAN network. I am listing this one here because it is a big plus, although you will also find it in \"cons\" because I could not set it up.- the speed at which it does everything. You don't have to wait for anything, you simply click on it and it opens. I previously had a Symbian 7 phone, and it was painfully slow compared to this one.- the ability to synchronize all your contacts and text messages, etc, from your old phone to this one. There is a pre-installed app on the phone that does it all for you, in a flash.- the second camera for video calls, although I don't know when I'll actually get to use that one.- the N-gage games! How could I forget this one :) They are pretty good, and there's a whole bunch of new games coming up, so if you are a gamer you will enjoy that.Cons:- I had trouble synchronizing my Windows Media Player playlists with the phone. Either I could put my songs in a folder on the memory card, but without transferring the playlist file (so I only had a huge number of songs, but not arranged in any order), or I would have the playlist file, but all the songs would go directly into the root of the memory card, which would probably slow down the phone eventually.- the buttons are not very convenient for typing text (compared to my old 6600); also, I keep pressing the \"play\" button accidentally, which is annoying because it starts to play music loud all of a sudden and startles everyone around.- the camera is quite bad. This is not a problem for me, since I don't use it anyway, but if you want a nice camera then do not buy this phone. It really takes crappy pictures, with bad colours (kind of greenish), and quite flaky. I even feel like the front camera for video calls takes better pictures, even though the one on the back has a higher resolution. The flash is useless, too. The videos it makes are pretty good though, with a nice framerate and not choppy at all.- as I already mentioned, I could not set up the internet calling. It always says \"registration failed\", while everything works fine on my PC. However, you need to have a wifi network in range to be able to use SIP, so it's not useful for everyone - so probably it won't matter to you that much. It is nice to use it at home or in the office - you could save quite a lot of money by calling over the net.", "Date": "April 27, 2008"}, {"Title": "WHAT A NICE PHONE - GET ROLLED", "Author": "Mario Moran \"mono_maister\"", "ReviewID": "R2EKSQ3XSZXEWD", "Overall": "5.0", "Content": "This is a nice product, a very nice phone (or should I say \"very nice ALL-IN-ONE PHONE\"?), I gotta tell you, it worth every penny, first days I was a little upset because I didn't get into it, but now... seems to be a nice solution for a lot of things, what I have installed in my AIO PHONE:1. Skype2. MSN3. Office Viewer4. Lots of games (metal gear solid acid for mobiles, fifa, etc)5. Internet using WiFi corporate network (you can specify the type of encryption, open/shared, IPV4 y IPV6, sutnet, gateways and DNSs)6. Yahoo Chat7. Google Talk8. Bluetooth connectivity is really awesome9. Opera Mini and the built-in brower (both are good)10. PDF Reader (this is nice if you need to open/read something while you're traveling)11. You can synchronize it with Windows Media Player what is nice too, because is easy to find WMP already installed in your computer (against the ipod/iphone-itunes, you have to download it and is a little tricky)12. ETC.Of course, not everything is PINK, and has some cons:1. Is just a bit bigger and heavier than the w810, but if you think you're getting WiFi, you forget that.2. I guess... is easier to use a sony ericsson, but every feature included in the N81 worth to learn something new.3. The storage (8gb) is built-in, and it has not any slot to expand the capacity, but again, I guess 8gb is enough space for applications, games and music.4. Since I'm an IT guy, I like to keep my gadgets UP-TO-DATE, but the Software updater is not available for Windows Vista, so, I gotta wait  the release, of course, it does not means the phone does not work, but sometimes when you update your software, some enhancements in performance and new features are included, the updater is only supported by Windows XP.5. The realplayer is the player included with the phone, and only plays mp4 and 3gp, the resolution on the screen is nice, but, sometimes, when you're trying to watch videos from YouTube.com (yes, you can watch streaming video too) the player get fuzzy... and you should close and open again the video in order to get a better display.That's my experience with the N81 8GB, I hope it will be useful for you. BR", "Date": "June 10, 2008"}, {"Title": "So far so good!", "Author": "Vegas Dave", "ReviewID": "RAQECVOWD3REL", "Overall": "4.0", "Content": "I wanted an all-in-one gadget and after researching a bit this one looked like the best price to feature ratio.It's probably not as cool as an iPhone, but I have a personal bias against Apple products and I hate being tied down to a long contract with AT&T; with an expensive data plan. The unlocked phone was the best option for me.The WiFi connection is huge for me. I'm able to get away without a data plan from my provider and just leech off WiFi hotspots.The MP3 player is awesome, Camera is adequate, web browser is fast (although navigating full web pages can be a hassle- full pages don't scale down very well.- .mobi sites are fine.)One frustration I found was the video playback. I found out that it only comes with the ability to play videos in Real Player format out of the box- which is terrible. Luckily I soon discovered you can download a mobile version of the Divx player from Divx and now it will play .avi files fine so you can rip and encode movies from DVD for it fairly easily.Also, text input via the phone keypad is tedious. If you're doing anything like blogging or email you may want to get a bluetooth keyboard. I have an ThinkOutside Stowaway that works great.Another plus is the availability of applications for the Symbian s60 OS.Overall it's a very good quality full featured phone.", "Date": "July 26, 2008"}, {"Title": "AWSOME PRODUCT", "Author": "Pablo Linares", "ReviewID": "RQO9B32A2BEHN", "Overall": "5.0", "Content": "I have just bought my N81 GB a feew weeks ago and I really have to say it has exceded my expectations. What a wonderfull gadget!Every single minute I'm learning more how to exploit it the most.From the design to the look and feel of the interface. Everything is almost perfect.Before buying this product I was evaluating other possibilities, as an HTC Touch. But the requirement of having to use stylus to type SMS decided me to go for this one. The overall build is quite robust, considering it is a device that needs to be handled appropiately.Will resume some CONS and PROS:CONS (most of them S60 related)-Music Player always running on background (since it is always sensing the multimedia keys - can be solved by using an external task manager app for Symbian)-Alarm Snooze time: the default is 5 minutes and was not able to find how to change it. Nokia 6131 on the other hand has this feature)Sure, you can get another Alarm application for Symbian.-Music Files: When you upload them, no matter what specific folders you enter them, Music PLayer will show the entire list (this would include MP3 ringtones and funny sounds you might have uploaded!), unless you create specific Playlists or rely on the ID3 MP3 tags.-Contacts Syncronization: Default Nokia PC Suite for N-Series will only syncronize with any contact management application in place (Outlook / Outlook express / etc) but will not give the chance to use a Nokia one. This can be solved anyway by using the standard Nokia PC Suite.PROS:-Design-Features-Cost/Benefit ratio-Gaming Platform-Sound quality (built in stereo speakers)-OS (Symbian) and all related Custom Apps-Divx Playing-Most of the CONS can be overcameIn conclusion, this little gadget has everything a phone with the same characteristics should have and even more, with a great potential of expansion due to the Operative System type. I really recommend it.I suggest for a Nice review (which helped me a lot) to take a look at the Nokia N81 8GB Review by Nokiaduck on Youtube.", "Date": "July 22, 2008"}, {"Title": "Good Value for money", "Author": "Akins Skerritt", "ReviewID": "R75GS4BGH5WP4", "Overall": "4.0", "Content": "I bought this phone for one reason to replace my damaged Nokia 6682. So far i'm very pleased with the phone. Everything works well. There are a couple of things that i don't like about it though. The back of the phone once opened didn't fit back perfectly and therefore feels inferior. The navi wheel doesn't work with alot of function and when it use sometimes gets in the way. I'll say its a very good phone for the price and the features it have. it multitasks well. not locking at all so far. camera could be better thought.", "Date": "May 25, 2008"}, {"Title": "The back-cover of this phone does not close properly", "Author": "Sonny Pitchumani \"Tech freak\"", "ReviewID": "R14KT5WUPVBBW9", "Overall": "2.0", "Content": "The phone looks cool but the back cover of the phone keeps popping out on one side, with the battery in. It is annoying when dialing out or punching digits.  Notified Amazon for return and replacement; looks like Amazon is out of stock with the cocoa-brown model and promise to ship me a replacement in a MONTH!!!!!!! In the meantime, they had the UPS guys show up and ask for the item to be shipped back.. Thie is the first defective supply I have received from Amazon. If, as others have stated, the item is not covered by US warranty, Amazon may be making false claims that are not backed up by facts on the ground.  Need to investigate further and will keep you posted.", "Date": "May 17, 2008"}, {"Title": "Great Phone", "Author": "Petr Slezar", "ReviewID": "R2ZV0SFTBE64JH", "Overall": "5.0", "Content": "This is a great phone.  I don't regret its purchase.  Battery is better than I've expected, it lasts for two days and I'm using the phone practically nonstop.  Recharging takes about hour and a half which is also a plesant surprise.  This is a great phone for its price.", "Date": "May 23, 2008"}, {"Title": "Great purchase", "Author": "FELIPE MARINI", "ReviewID": "R27YPR3D8JO03U", "Overall": "5.0", "Content": "Very nice phone.As a Mac user, I was almost buying Iphone. But I'm a little bit clumsy too, so I opted for this model that looks like it's a little more resistent to clumsyness.I realy can't say about Iphone because I don't have one. Until now, N81 resisted some falls to the ground.One more thing. For Mac users, you can Isync just by dowloading a driver that you will find at nseries website in the workshop area.", "Date": "February 15, 2008"}, {"Title": "Best Phone", "Author": "Nimmagadda", "ReviewID": "R2FXPL0CY6H0GA", "Overall": "5.0", "Content": "Best Phone i had ever from NOKIA... its been 4 years and its still working. some times i feel this is much better than iphone.", "Date": "August 31, 2011"}, {"Title": "decent phone, love the 8 gb memory!", "Author": "Lode De Herdt", "ReviewID": "R6JDMN3UWBI7R", "Overall": "4.0", "Content": "pretty good phone, works well for listening to music.the speakers on the phone are impressively loud.I've had the Nokia n81 8gb for a year now, and the phone's performance isn't so great anymore, if i want to open applications(camera, games, picture gallery,...) i have to wait several seconds before the app opens.", "Date": "March 23, 2009"}, {"Title": "Excellent phone once you get used to it", "Author": "Willy Alfaro", "ReviewID": "R1ABRRJMR8BDVU", "Overall": "5.0", "Content": "I got this phone in April 2008, after using a Palm TX and a IR Nokia phone. I wanted to unify the two items in one single device, but if you read my review, you will find why is that I did not stay with Palm OS.One thing to say also is that I bought it for business although it is not advertised as that, I took the chance and I am very happy with it.Pros:There are many features I would like to review but among my favorites are:- Outstanding battery life even when you connect to the internet via WiFi- 8GB internal HDD- Easy to open keys, lock-unlock button at the top as well.- Screen and Menus completely customizable, so you can decide if you want the calendar in the root menu or in a Agenda folder, for instance.- The center key has 4 quick access ways, so left takes you to Messages, right takes you to Calendar, up takes you to Modes like Silence -meeting etc., down takes you to Clock -international times and alarms.- WiFi is great and fairly easy to set-up.- Bluetooth is great, I can synchronize my calendar and contacts, anniversaries, tasks, meetings, with Microsoft Outlook, and share info with friends, also I use a Plantronics Voyager 510 Bluetooth Headset, which works great with.- Synchronyzing with the usb cable allows you to back up your pictures, music, videos- You can use the phone as an external HDD to carry info, PowerPoint presentations, etc.- You can have your POP3 mail, save as many as you want, decide whether you keep them in the \"phone\" memory or the HardDrive memory.- You can open attachments with the included QuickOffice and also PDF files.- You media manager is great, photos in albums, music playlists and you don't need special software like itunes to manipulate them, (have you tried to retrieve your music from and IPOD to your computer? You can't)Cons- Buttons to music in the front are to tight and hard to manipulate.- It can be tricky to save some access points in WiFi, but you can learn how configure them.- Bad quality camera, not because it has 2megapixels, but because they are 2mp terrible sensor, but not important to me.- It is not as slim as other phones, but non of them with internal 8GB HDD- Gizmo, my wife and I have same phone, we tried to configure the VoIP and it seems that if we are under the same IP- (same house connection) it rejects one of the users, which is awkward since Skype does not give you this issue.- Not compatible with Skype yet (coming soon they say)Overall, the Cons I have had so far are livable with, but the Pros are great and easy to use. It makes my calendar activities easy to keep up with, keeps me in touch via email and I can use it as an external HDD.", "Date": "October 25, 2008"}, {"Title": "Best Phone !", "Author": "J. Hernandez", "ReviewID": "R2UKYMBRTO9CK7", "Overall": "5.0", "Content": "I bought this phone for less than the current price, but i think its still worth the price. I upgraded to this after using a moto L7 for a while. This phone gets average reception, it works well as a phone and great as a music player.The N81 has stereo speakers which are louder and sound better than my laptop's. You can also plug in any headphones. You can easily and quickly add music on the phones 8gb internal memory. Has great web browsing, wifi AND gaming capabilities. It has a nice big screen but easy to get scratches on it. I have dropped mine twice and it got scratched easily. The only thing i felt the phone was missing is a qwerty key board, for quicker emailing/ texting. Also the camera was not the best.The bottom line, you should probably buy this phone if you are looking to upgrade and can afford it.", "Date": "September 19, 2008"}, {"Title": "Excelent Phone", "Author": "Gerardo Ramon Alanis Palacios", "ReviewID": "RROZIT8PY6W23", "Overall": "5.0", "Content": "Hi, This is my second phone buyed on amazon and for the two I have excellent response in the delivery.My old phone was the N80, and I liked it very much because of all the functions it has, but a little slow when I navigate on internet via wifi, and it has constantly out of memory.Let me tell you that the N81 8GB it's much better, I can browse almost any web page I want, just a problem with sites with flash 8, not supported, but I espect It could be included in a firmware release. Excelent Photos, A lot of memory, I have 2243 songs compressed using about 3.7GB and the quality is very good. The phone has a very good game console (Ngage) so, what else do you want.So the overall of the phone is Excellent phone for a very good price.", "Date": "September 1, 2008"}, {"Title": "Nokia N81 8GB Review", "Author": "Avraham A. Levian", "ReviewID": "R2INV5AQLPQ3J3", "Overall": "4.0", "Content": "This is a great phone packed with many features for the price.A few issues I experience(d) witht he phone however are:- the jog dial is quite flimsy and even started chipping away on its own during the first month that I owned the phone even though the phone was kept in a protective case and was never dropped.- The \"C\" drive on the phone has very little space allocated to it.  Considering the fact that the phone registry resides in that portion of memory, I would have preferred having more memory allocated there to prevent memory full errors.- Playing games with sound on this phone is absolutely horrible.  I recommend turning off sound to prevent glitchy gameplay.  It seems like the sound is off-sync from the video anywhere between .5 to 2 seconds during games.- The digital camera is nothing special, but that what I expected from a 2MP.- not compatible with high-speed USB 2- no expansion memory card slot on the 8GB edition of the phone- the music player is always in memoryThere are also many pro's to counter the above cons for this phone, such as:- huge, bright, sharp, and brilliant high-resolution screen- really loud and amazing built-in stero speakers (this is an amazing music phone and it's ringers are very loud)- massive 8GB of space- really cool landscape gaming controls- convenient key lock switch at the top of the phone.- sleek and stylish slider design- wireless-g/b wifi connectivity is very good on this phone compared to many others int he same areas such as the iPhone- really good battery life for this type of smartphone- out-of0the-box, the phone is packed with tons of features and there are literally millions of software applicationa nd game titles that are compatible with this phone", "Date": "August 25, 2008"}, {"Title": "U.S. Version", "Author": "Krasimir Hristov Zlatev \"hello\"", "ReviewID": "R2L475ARJIIC92", "Overall": "4.0", "Content": "hello.so what means us version,can i use that in Europe for example ?thank you", "Date": "August 14, 2008"}, {"Title": "Nice Phone", "Author": "Adalberto Suarez", "ReviewID": "RD9BMOYIUYQ2N", "Overall": "5.0", "Content": "This is a really cool phone... And the price was great... I received it really quick, I actually wasn't expecting to get it that fast!", "Date": "July 31, 2008"}, {"Title": "Great phone", "Author": "H. Shteto \"heshti\"", "ReviewID": "R7MMGKQXOP8MP", "Overall": "5.0", "Content": "Magnificent phone, quad-band spectacular WI-FI and bluetooth. Adding FRING (and SKYPE) to it bring an extraordinary value. Music features and quality are really super...super.Totally worth the money. Few things that  can be improved: GPS software is to be deleted (can not compete even 5% with real GPS devices), the headset is big and heavy, internet phone is only between friends, its quality is poor. I recommand it 100%.", "Date": "June 30, 2008"}, {"Title": "Nokia N81", "Author": "Wendell Diaz \"Samba\"", "ReviewID": "RW32S128N49PH", "Overall": "5.0", "Content": "This phone hass all the features especially the storage space anyone will need in a phone.It just works wonderful.", "Date": "June 12, 2008"}, {"Title": "Nokia N81 8 GB", "Author": "M. Laskar \"Laskar\"", "ReviewID": "R2VL911UCIH7OG", "Overall": "5.0", "Content": "This is one of the best cell phone I ever had. Rich in content, easy to use and very stylish. I bought it for 374 USD and I am really happy with my phone.", "Date": "May 15, 2008"}, {"Title": "not too happy with it for the money i paid", "Author": "Amin Hadwan", "ReviewID": "RTETC19H1OU1W", "Overall": "2.0", "Content": "the item is cool, however slide is no too strong to hold. it is shaking when slides open like need support. seems like a gab.back light stays lit all the time when engaged in a phone call. real player music if played fro my galary goes to sleep as soon as the back light goes off. you need to hit any button on the phone to resume playing. max. light back 90 secound. so every 90 secound you need to hit something on the phone to wake it up to be able to continue playing the music if it is realplayer. if it is mp3 not a problem.", "Date": "April 27, 2008"}, {"Title": "AWESOME PHONE", "Author": "Gabriel \"Gabriel\"", "ReviewID": "R1XSMCLSH4ZHO3", "Overall": "5.0", "Content": "The phone is great, very awesome features. great price and super fast shipping. AMAZON ROCKS!!!!!!!!!", "Date": "May 26, 2008"}, {"Title": "Good phone", "Author": "David Gonzalez", "ReviewID": "R3OFA14B4YY75Y", "Overall": "5.0", "Content": "Very good phone.  Even thought at the begining I had a problem with my phone, I returned and they send me a new phone so quickly.  Thanks", "Date": "January 23, 2008"}, {"Title": "S P E C T A C U L A R", "Author": "Francisco Sanchez J. B \"FRANCISCO\"", "ReviewID": "R5TDTY3PYZKN5", "Overall": "5.0", "Content": "THIS IS THE BEST CELL PHONE I HAVE EVER HAD. IT IS ALL IN ONE, WITH THE 8GB STORAGE YOU CAN UPLOAD THOUSANDS OF SONGS, SAY GOOD BYE TO ZUNE OR IPOD, YOU CAN ACCESS THE WEB WITH ITS FAST WIFI CONNECTION, MANAGE PICTURES VIDEOS, ETC.. BEAUTIFULL DESIGN AND SPECTACULAR DASHBOARD, YOU CAN TAKE AMAZING VIDEOS AND PICTURES, THE GAME PLAY ITS AWESOME, IT COMES WITH 2 GAME DEMOS FIFA AND ASPHALT, YOU ALSO GET A FREE SPACE SHOOTER GAME!! NICE WIDESCREEN OPTIONS AND BEAUTIFUL SLIDER!! FORGET ABOUT BRINGIN YOU CELL PHONE AND ZUNE-IPOD, WITH THIS DEVICE YOU GET ALL IN ONE, YOU CAN GET N.GAGE APLICATION, ANIVIRUS, AND ALOT OF FREE SOFTWARE!!! BATTERY LIFE IS PERFECT!! YOU WONT REGRET, I GOT MINE FROM AMAZON, YOU SHOULD GET YOURS FROM AMAZON AS WELL!! AMAZING DEVICE FOR ALL IN ONE TECHNOLOGY CELL PHONES!!!! CHEERSupdate march 31, 2008I HAVE TO SAY THAT AFTER 3 MONTHS THIS IS THE BEST CELL PHONE I HAVE EVER HAD, WITH TIME THEY HAVE UPDATED THE FIRMWARE, AND GOT NEW STUFF LIKE RADIO INTERNET APPLICATIONS, SHARE ON OVI WICH IS A SOCIAL NETWORK, THEY HAVE LAUNCHED THE BETA FOR N-GAGE ARENA, WICH IS REALLY GREAT, THE GAMES ARE TRULLY GORGEOUS, I USE THE GPS WITH A BLUETOOTH DEVICE AND ITS SPECTACULAR, THERE IS LOTS OF ENTERETEINEMENT, LOTS OF APPLICATIONS TO DOWNLOAD, LOTS OF THEMES, ETC.., I AM STILL VERY HAPPY WITH THIS PHONE, THANKS TO AMAZON.", "Date": "December 23, 2007"}, {"Title": "The quality is not as expected.", "Author": "Trang Thi Hanh Hoang \"Trang Hoang\"", "ReviewID": "R3MIL3AOJ9TMHL", "Overall": "1.0", "Content": "Everything seemed to be OK when I first opened the box. However, when I put the battery and sim in, I cannot close the back cap. I feel so unhappy for spending lots of money to receive a bad quality. Then I called Nokia service and found out that this is not a U.S version, it was made outside the U.S, which means this phone cannot have a one-year warranty. (While Amazon advertises that this phone is U.S Version, Full Warranty!). So disappointed!", "Date": "April 13, 2008"}, {"Title": "Too many issues", "Author": "Richard W.", "ReviewID": "RYC23PBJIJB2O", "Overall": "1.0", "Content": "I had so many problems with this phone. First is the back cover. It can hardly attatch to the body, even it is when you make a call, it makes stupid noises. The keys are sloppy! My biggest problem is the signal. You cannot hold it or even touch it when you want to get the best of signal reception. When I hold it like what we do when we make a phone call, the singal bars drops dramatically usually from full 6 bars down to ZERO. Even I know the area I am living has relatively poor singals, but this has nver happened to my other phones used. I changed the carrier, it gets no better. Last but not the least, NOKIA's customer service sucks!!! Their guys are ice cold!!! They were truly a bounch of idiots!!! All they want to do is ask you to ship your troulbled phone back for 7-10 business days for an evaluation! I had just enough!!!!", "Date": "June 5, 2008"}, {"Title": "Uno de los mejores celulares que he tenido", "Author": "Erick Urriola \"EUrriola\"", "ReviewID": "R3USMWXIR8X1J3", "Overall": "4.0", "Content": "He leido multiples reviews de este celular, en todos se indica que es un mal celular.  Yo he tenido muchos equipos y les puedo indicar que este es uno de los mejores... creanme he tenido muchos y de muchas marcas.Ventajas:- 8GB integrado.  No hay que preocuparse por espacio.- Compacto, es un poco pesado pero comparado con otros de las mismas caracteristicas es ligero.- WLan.  Puedo bajar aplicaciones, temas, ring tones sin preocuparme que mi compañia de celular me cargue costos en exceso por navegación.- Todo en un toque.  Se puede tener las caracteristicas principales sin deslizar la cubierta.- Audio. Tiene bocinas estereo, aunque el audio no es de la mejor calidadDesventajas_- Las teclas no son suaves al tacto, parecen trabarse al tocarlas.- La cubierta de la bateria y del slider no son muy firmes, se siente un poco flojas", "Date": "May 19, 2008"}, {"Title": "made in china??", "Author": "Xxx Jike", "ReviewID": "R15GJHEU37S6EB", "Overall": "2.0", "Content": "i don't know if you guys noticed or not, this N81 model selling on Amazon is made in China(take out your battery, you'll see it on the back of the phone). I'm a chinese myself and i know for sure that, in china, fake Nokia's are being sold everywhere, they made things look 99% identical but the chip and processor might be different, so on the outside you wouldn't tell any difference at all, some people may be using it for years and still don't know that they've been using a fake phone. by the way, the fake phone is way cheaper than the real ones, for example, the fake nokia n81 is only worth $120 in china. i'm pretty disappointed finding out that my phone is made in china and called Amazon cellphone specialist, but they have no idea where it's supposed to be made.some may argue that some of real phones, such as sonyericsson, are made in china,too. but while i was viewing a chinese forum, a guy posted a thread asking people where their phones are made, 99% said it's made in Finland. Weird enough? Chinese guys' N81's are made in Finland, but here in the States, we're buying phones that are made in China, i seriously doubt if we've been fooled... please prove me wrong cos i haven't called nokia help center yet", "Date": "July 8, 2008"}, {"Title": "Its an ok phone!", "Author": "Ernesto Motta", "ReviewID": "R2TN2LESI9MSE5", "Overall": "3.0", "Content": "Its an ok phone that would be my starting title!why is this, its because the phone its relatively a good phone but you cant compare it to an iPhone after using an iPhone you are just expecting the same features as the iPhone.This is because this phone doesnt let me use an app to check my mac.com email directly from the phone like my iPhone neither its going to be easy setting it up your yahoo or any other non-microsoft application.Youtube works and you can see it ok but not as good as the os from mac that is installed in the iPhone, btw  i bought this phone because i was sick and tired of doing workarounds to my hacked iphone so i could use it here in the Republic of Panama.This is a great phone when we talk about the wifi which it gives you a good signal but this phone is not so user friendly and is kinda hard for a person to set it up to make it look like its part of you.This phone has great games though, the screen is great and the 2 megapixels are great! it has great features as video, video calls, night mode, etc!Overall ill give this phone a three stars just because i came from a Ferrari to a Toyota and i think ill stick with my hacked iphone meanwhile nokia comes with a better phone that actual competes against apple's iPhone.Cheers, Lads!", "Date": "February 20, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 2100 UMTS plus GPRS/EDGE capabilities\n8 GB of internal memory (not expandable); 2-megapixel camera/camcorder; digital audio player; FM radio\nWi-Fi networking (802.11b/g); Bluetooth stereo music; access to personal email; Symbian S60 operating system\nUp to 4 hours of digital talk time and 17 days of standby time", "Name": "Nokia N81 8 GB Smartphone - Cocoa Brown (Unlocked)", "ImgURL": "http://ecx.images-amazon.com/images/I/417CyGke%2BKL._SY300_.jpg", "ProductID": "B000YUE340"}}