{"Reviews": [{"Title": "Outstanding Music Player & Overall Good Phone", "Author": "Steven W. Buehler \"Steven Buehler\"", "ReviewID": "R3S2K9NZZVHARK", "Overall": "4.0", "Content": "I swapped out a Motorola MPx200 (which I fried) for a Nokia 3300 initially because of the low price compared to other phones with similar features.  You do get a lot of \"bang for the buck\" with this phone.The selling point on the 3300 is the music player.  It plays MP3 files and \"raw\" (not MPEG-4 encoded) AAC files.  Because it does not support the MPEG-4 compression, you're better of with using MP3, as the raw AAC files at the same bitrate are acutally larger in size with no noticeable difference in quality.  The music player is among the best I've listened to (it actually has some BASS output) with the provided stereo headset; you can also listen to it with the single-ear (mono) earpiece and the player knows the difference and switches from stereo to mono accordingly.  You can also listen to either the music player or FM radio using the loudspeaker on the phone, but to listen to the FM radio you still have to keep the headset connected, as it utilizes the headset wire as an FM antenna.  I have encountered an issue where the music player will arbitrarily change tracks, or the FM radio will spontaneously kick over to another station preset, but it could be from accidental keypresses on the case that I have the phone in.This phone also includes a recorder and a special audio cable (3.5mm standard plug on both ends) for connecting an external CD player or other equipment to record from to the MMC card (64MB) supplied with the phone.  The phone records 64Kbps, 32KHz \"raw\" AAC format (64MB = about 2 hours of audio), which is fine if you are recording from the radio or voice but not the greatest if flawless quality is your preference from your CDs.  The Nokia Audio Manager 3.1 software supplied with the phone is clunky and stalls frequently; I highly recommend using RealPlayer 10 with the Nokia Mobile Device plug-in (which also handles conversion to MP3 for you); RealOne Player with the plug-in is also included on the CD that comes with the phone. If you have a separate MMC reader, you can read the cards in that rather than in the phone to speed up transfers.The phone itself is a decent quality phone, as with most Nokia handsets. However, if you don't want to look like a space alien talking on it, you'll find yourself using the earpiece almost always (otherwise, you hold the narrow back side of the phone to your face to talk; which looks tacky and feels awkward). The full keyboard on the US \"B\" model is excellent for text messaging and e-mail--*IF* you have light to see it with (only the call, hang-up, and directional buttons light up, which means you can't see the numbers or keyboard in the dark--major issue if you have to communicate in less-than-ideal lighting; keep a little mini flashlight with you).The 3300 supports Java MIDP 1.0, which is wonderful. Most of the apps I used most frequently on my MPx200 I have found suitable Java alternatives for (MyCast Weather, Virca IRC client, EmailViewer e-mail client, and MapQuest Mobile for real-time directions are among some of the apps I use often). The built-in e-mail client is adequate, but forces you to download entire messages instead of just headers to see what you *really* want to read (downloading full messages can consume your GPRS bandwidth in a hurry if your e-mail box is big), so I use ReqWireless E-Mail viewer, which doesn't have that disadvantage.Like all Series 40 Nokias, the Calendar is very basic with limited capability, but the Contacts database is robust.  Which brings up another major issue with this phone: lack of PC Suite support.  The data cable supplied with the phone only interfaces with the MMC card in the phone and not with the phone's interface itself, so if you need to synchronize via cable or use your cell phone as a modem, you'll be SOL on this device.  It only supports synchronization over-the-air using SyncML with a SyncML-compliant server (again, a bandwidth hog if your contacts/calendar db is huge); Nexthaus does make a SyncML server to sync with Outlook, but any calendar items not supported by the 3300 get skipped so your calendar is always incomplete (Contacts come through great though).Lastly, you would think that with this phone supporting the MMC card format that it would also support SecureDigital (SD).  It does not, and MMC cards are becoming increasingly difficult to find as more vendors make the move to SD cards.  The phone comes with a 64MB card, which is sufficient for most people, but if you like more than an hour's worth of MP3s, you'll want to look for a 128MB or 256MB MMC card.  I will give it this much: there is a feature to backup and restore your phone's settings to/from the MMC card, which is a smart feature to use in case your phone should be accidentally reset.Overall, I do enjoy this phone, especially the awesome music player and the java support.", "Date": "June 29, 2004"}, {"Title": "Nice toy, awful phone", "Author": "Daniel Limbach \"Reader, writer, gadget guy\"", "ReviewID": "RLJUWE2V4UHH7", "Overall": "1.0", "Content": "Got mine in October '03. Loved the features. Great price with rebate.Pros:1) Full keyboard - aids text input and beats a regular number pad hands down.2) MP3 player - Can use MP3 files as ring tones, and just store songs on the memory card. Way cool.3) Speaker - good for speaker phone and listening to music if headphones aren't handy.4) Games - when you need to kill some time, the games are nice to have.5) Internet access - decent net access, didn't use it much, though.6) Menu - fairly intuitive and easy to use.7) FM radio - another way to pass the time enjoyably.8) Voice capture - good for making quick verbal notes.Cons:1) Non-backlit keypad - impossible to use when dialing at night, especially combined with...2) Small buttons - the dialing buttons should be larger. Easy to misdial, especially at night.3) Center 4-way menu button - had to press it more than once to scroll down the menus. Must be a bad contact under the button. Extremely aggravating.4) Poor speaker volume - even the shrillest ring tones don't penetrate a normal winter coat when I'm wearing it. Lost many calls that I never did with old phone. Hard to hear music with speaker through the normal din of all but the quietest areas.5) Lost audio on calls - Often, a call would ring in, I would see who it was on caller-id, but when I picked it up, I couldn't hear the other person. Called back the other person, who said I could be heard fine. Only happened on incoming calls.6) Poor earpiece design - the angle of the earpiece in the case makes it hard to position it flush against the ear opening. Poor volume means you have to cover the entire ear opening to get a clean sound.7) Proprietary SD memory - If you take out the battery, you can pop out the 64mb memory card, but the unit won't take inexpensive standard SD cards, like a 256mb or 512mb card. Why? Nokia requires a special thin SD card only they are selling. Bah!Conclusion: It's a nice toy and can waste away your idle hours with blissful fun. You could run a mini cable from the headphone jack to a set of powered computer speakers and have a nice MP3 system. But doesn't cut it as a phone. I need a superior phone, and the rest is icing on the cake. Thought I could have both with the 3300. Nope.I'm getting a Motorola V300. It's an outstanding phone. Tiny. Features-a-plenty, and the rebates cover the entire phone and even pay me $51 when bought through Amazon and T-Mobile.Avoid AT&T; Wireless! One month of calling on the 3300, no live customer service or email responses whatsoever. Shame on AT&T.;", "Date": "January 14, 2004"}, {"Title": "Great Phone - Tough to find Accessories", "Author": null, "ReviewID": "RRAQZUJC4RYS0", "Overall": "4.0", "Content": "This phone has worked well for me.  The sound is clear and reception is fantastic.  The sound of the music is pretty good with the supplied headphones and the microphone/headset is crystal clear.  I have not been lucky trying to find a case or other accessories for this phone.  The only accessories that seem available mostly all came with the phone.  I have not found a case that fits it right to date.The music software seems to work well.  And the recording capability of the phone is also pretty good.  I like the full keypad for entering contact info.  It is a lot easier than with other cell phones.One final note - I wish they had a phone disabling option in order that the music player on the phone could be used in an airplane.If you're looking for a phone that is a little different, offers a little more than a standard phone and is easy to program and add contact info to, this is a great phone.", "Date": "November 17, 2003"}, {"Title": "I decided to return it the first 24 hours ...", "Author": null, "ReviewID": "RFLSUKPKDDC1H", "Overall": "1.0", "Content": "I chose the 3300 (despite its slightly childish look) because I thought a phone/music/PIM combination would give me all the functions I wanted in one machine without going into expensive smartphone territory. But it's been an incredible disappointment, for several reasons:1. The music player can supposedly play AAC files as well as MP3, but it's a different protocol from the AAC used by iTunes. If you want to copy tracks you ripped from your CDs using iTunes' default setting, you'll have to convert them to MP3 first.2. It can't sync directly to a PC--no Nokia PC Suite is available for this model (nor will there be, as I was told by customer service). Apparently, the only alternative to entering all your phonebook/calendar entries by hand is MightyPhone, a 3rd-party web-based service that costs an extra $3/month.3. The Nokia Audio Manager software is terrible! It couldn't complete a single track transfer to the phone, and it froze up for a solid minute while trying. I wound up just copying tracks directly to the drive, but then strange things happened to the track list, which I had to edit in NAM.4. The earbuds on the stereo headset are too big for most women--I simply could not steadily place the right-side one in my ear, and it fell out whenever I walked. (The only way to stop it was to hold the microphone ... but isn't it the point of headsets to free your hands?!?) And since the headset jack is proprietary, you can't just substitute your own headphones.I suppose this might be OK for a kid who just wants a cool-looking phone with decent sound. But if you depend on the PIM functions, I think you'll be very disappointed. I'm exchanging it for a Nokia 3650, which has PC Suite, Bluetooth, and the ability to download other applications (including MP3 players).", "Date": "December 2, 2003"}, {"Title": "Cute, Practical and versatile", "Author": null, "ReviewID": "R1ZX202DP52DS5", "Overall": "4.0", "Content": "I like the full keyboard which is good for contacts, notes and text messaging.  I also love the radio/MP3 player.  I take it to the gym and can be in touch and use the phone ear plug for the radio...better than a walkman!  All the GSM features plus the cool music/keyboard makes this a great phone.I only wish the letters/numbers were backlit and the problem with the keyboard is you lose the ability to map the letters back to numbers for IVR responses (like, \"please spell the last name of the person you are calling...\")", "Date": "November 27, 2003"}, {"Title": "GREAT PHONE , NOT SO GREAT KEYPAD!!!", "Author": "Nathaniel Newman \"xmguy\"", "ReviewID": "R3Q5MCJLKA8JL1", "Overall": "4.0", "Content": "I bought this phone via e-bay (uh..) cool phone take it with me everywhere . Nick Mp3 player , Cool radio . great for txt msg . but the only thing I don't like is the keypad does not light upif you can memorize the QWERTY keyboard (which I have) then your ok , oh and also the number keys are a little small .good phone though.Nathaniel Newman", "Date": "February 19, 2005"}, {"Title": "Not perfect, but I like it", "Author": null, "ReviewID": "R1HLYNGUBXXW9S", "Overall": "4.0", "Content": "Reading the other reviews, I agree that the Nokia Audio Manager is not the best software in the world. I can't get it to reorganize tracks, and unless you keep pressing buttons to keep the screen on the phone lit up, it does freeze up the computer while trying to load songs on it.That said, why am I giving the phone 4 stars?Cause I like the sound quality, the features, and the customization ability, which to me are the basics of a phone. Once you have do the songs uploaded, the music player is easy enough to use, and you can use normal bud earphones to listen if you think, like I do, that the enclosed headset appears rather fragile.The stereo quality is nice on the music, and I've not had problems being heard even on a busy city street with the enclosed microphone headset, which fit me just fine. It also has all the bells and whistles including ring tones from mp3 files, and I think the speakerphone is quite loud. You just have to not cover the speaker holes located on the lower back of the phone.And it also depends if your cellphone is your life. I'm a casual user, so I like it just fine.", "Date": "January 15, 2004"}, {"Title": "awwwwsssooommeee phone", "Author": "Dave Logan", "ReviewID": "R1XVNIFTGLW87C", "Overall": "5.0", "Content": "o my gosh this is the BEST PHONE EVER!!!!!!!! The mp3 player is great so is the radio (great signal). its soo easy to text message with the full keypad. for calls its very clear and easy to handle. also this phone is a tank, ive dropped it i dont know how many times and it still works great with very little scratches. i would definately recommend buying this phone ive had it for almost a year now and i absolutely looovve it", "Date": "April 24, 2004"}, {"Title": "Not useful as a phone!!", "Author": "Chris Maroney \"fletch2k\"", "ReviewID": "R2YXFR2KAEVTTC", "Overall": "1.0", "Content": "I bought this phone and within the first couple of days, I wanted to return it!Pros: The features are nice, games loaded in memory and the radio/MP3 player, I love.  The phone is small and portable.  The keyboard is great if you are writing email or text messaging.Cons: The dialpad is too small to make phone calls (especially entering pin numbers for voice mail) practical.  I'm use to using my thumb to dial; now I have to pull the phone away and use both hands (one to steady the phone and the other to push the right button).  Don't think you can just enter your contacts in memory and you won't have to use the dial pad.  You will if you have voicemail.I sold the phone and got the Nokia N-Gage!", "Date": "December 9, 2003"}, {"Title": "ONE OF THE BEST PHONES EVER!", "Author": "Megan", "ReviewID": "R34YLA4SKQIO6A", "Overall": "5.0", "Content": "When I decided to buy my very first phone I wanted to get the best one I could buy.  Looks and capabilities were a key factor in deciding which one.  I was about to get a samsung but at cingular they try to sell you nokias because they have better reception.  I picked the 3300 because it was an mp3 player, radio, cool design, and because I saw that alicia keys used one in one of her music videos.  I have had it since January and ir hasn't failed me yet.  One thing I would change is that they would sell holsters for it at cingular and interchangable plates.  Other than that I highly recommend it.  Put if you want something really small don't get it.", "Date": "June 4, 2004"}, {"Title": "Cool but flawed", "Author": null, "ReviewID": "R3PG1I6XU43NNG", "Overall": "2.0", "Content": "On the plus side:  I've had no problems ripping / downloading songs and it's great for text messaging.  It's got a SIM-card which I think is different from (and better than) most US phones.On the down side:  1) the keys aren't backlit so you can't use in the dark.  2) the earphones are horrible:  they're heavy, don't have a clip, have bizarrely long ear wires, and can't be \"coiled up\" when not in use (so mine are always tangled).  They're impossible to use while jogging.  They come disconnected from the phone if you leave it in your pocket.  Finally, the mic sits about belt level, which is why you always see people holding their \"hands free microphone\" if they want to be heard.  It's hard to imagine how the same company could make this cool phone & these horrible mic/headphones.In short:  Fine for on the train, but not for active usage.", "Date": "December 9, 2003"}, {"Title": "Its GOOD!!!!", "Author": "S. khatun \"murderguardx\"", "ReviewID": "R32OF8ORRIL6JG", "Overall": "5.0", "Content": "I have the 3300 and i bought it for 50and thats a good deal with no service too!!!!! If you have the CArd reader then your fine or if you have the cable which connects to the computer then your fine its all for the MUSIC!!!! IT COMES WITH 64MB!!!!!!!!!!!!its not much but its enough.... and it has radio just buy the headset which costs $$10 JUST TEN DOLLARS then your alright...PHONE $50HEADSET $10total $60", "Date": "September 20, 2005"}, {"Title": "Good idea, but falls a little short", "Author": "Marc Erickson", "ReviewID": "R2QXG070DB5TWH", "Overall": "3.0", "Content": "I thought, like previous reviewers, this would be *the* phone because of its integration of the features I was looking for.But, as already noted, it falls short:* it does not come with a PC Suite to synch* the keypad is not backlit which has proved more frustrating than I would have thought* unfortunately, 64MB isn't quite enough for me (128 would be much better) for use as an MP3 player* the headset keeps disconnecting when I put the phone in my pocketWhat I've really enjoyed (and certainly can be had with other phones as well):* the keyboard is key to using the phone as an organizer and I found it easy to get used to* the headset helps when making calls in noisy environments--both ears are participating* the voice tags are reliable--hold the button on the headset and say your contact's name (or tell the phone to start the mp3 player, e.g.) and voila, it happens...Haven't once had it not recognize my voice tag.As for the extra long cords and the mic hanging real low--the secret (and this was NOT obvious to me) is to open the oblong plastic piece between the mic and the ear buds and re-close it behind your neck...It brings the mic to where it should be, takes the weight off of the ear buds and allows you to take the ear buds out of your ears and have them hang conveniently close by for when you want to put them back in.  It actually works very well.", "Date": "December 29, 2003"}, {"Title": "Could Not Get Service For Phone", "Author": null, "ReviewID": "R1756HDD9N8OXR", "Overall": "3.0", "Content": "I tried for 3 weeks to get service for my Nokia 3300 phone.  AT&T and Amazon kept pointing fingers at each other, and finally Amazon told me to send the phone back, then order a new one. I sent the phone back w/out ordering a new one (one time shame on you, two times shame on me), and I'M PRAYING THAT I ACTUALLY GET MY MONEY BACK.  The phone seems pretty nice especially for the price, but alas it was too good to be true. I may just go to the AT&T store where I can get face to face service and instant activation.", "Date": "January 2, 2004"}, {"Title": "Wanted to throw it in the trash can.", "Author": "\"wkl-2\"", "ReviewID": "R667R0ZQ8FKB7", "Overall": "1.0", "Content": "This phone fell short my expectations.Cons:Speakerphone is not very loudRadio gets horrible receptionButtons are too complicated (esp for text message)NOT RECOMMENDED for text while driving (what i do all the time.lol)Buttons dont light upNo AIMNo CameraEarpiece is too big and too much hassle to carryRadio will not work w/out earpiece64MB is not enuf for mp3's.Earpiece keeps coming off.PROS:its a nokiareception pretty goodI recommend the nokia 6610. same menu set up with radio and LOUDER speakerphone and smaller. Depends on the user. I am a picky customer but this phone sucks. My friend warned me and fell in the trap.", "Date": "April 17, 2004"}, {"Title": "Would Be Great if AT&T Admitted Their Customer Service SUCKS", "Author": "Naz", "ReviewID": "R7FSF2XIM8WK6", "Overall": "4.0", "Content": "When I first purchased the phone, it was great! AT&T provided good service in my house (which is practically a dead zone) and it was perfect. Then I wanted to add M-Mode (an AT&T internet feature) and HELLO, tell me why I was on the phone for 45 minutes waiting for a live operator (thank goodness 611 is free, otherwise it'd eat up my minutes!). My phone calls now keep getting dropped if someone tries to call me; it takes 3 phone calls to actually establish a secure phone call w/out being dropped. For shame to AT&T. If the rumours are true & AT&T does merge with Cingular, they'd better kick some a** or my a** is switching over to Verizon where they provide real service or Nextel (where you actually get a customer service rep. in less than 3 minutes -- sometimes less than 2 mins).  If it's for show & tell, yea then get the phone, but if it's for serious use, stick with what you have, it's probably better anyways. As for the speakerphone feature, the music plays great, but sometimes it's not loud enough even in your own car for you to hear (don't drive & keep cellphone to ear, you get tickets in NY state that way). The mp3 & FM radio features rock when you're taking the bus to school or something to pass time, keeps you from getting bored.  Conclusion: If this phone were offered by a real provider like Verizon, then it'd be worth having cos you'd get great service & a great phone to show off and use. The phone is very handy with its other features. Look for the NOKIA 6225 w/VGA Camera installed coming soon, probably the best phone that'll be out there for quite a while. Good luck...", "Date": "January 22, 2004"}, {"Title": "THIS PHONE IS NOT GREAT! IT'S GARBAGE", "Author": "Lemar \"Lem\"", "ReviewID": "R2CL0LBPJZT9YL", "Overall": "1.0", "Content": "Save your money and look into a phone that's easier to use than this one. I initially liked this phone for its odd shape and exciting features, but now I regret my purchase altogether. I have Cingular, and the service has been pretty good. That's not the problem, but I realized that Nokia is second to Motorola when it comes to quality. I like the FM radio & MP3 features, but they come with massive flaws. You can't play the radio without the headsets in the phone which is bulky and annoying. I love listening the radio on my cell, and if you do too, then look into a phone that has radio hands-free headsets. If Nokia were to improve this phone and re-release it like they do with weak music cd's, then it would do better on the market. THE WORST PROBLEM I HAVE is with the keypad. I love the keypad, but I hate it! Full QWERTY keypad but it does not light up nor does it even glow in the dark. Don't even think you'll memorize the keys because you won't trust me! False advertising with the Express on Cases. Nokia said they would void my warranty if I were to change cases.So, ladies and gentlemen, don't end up like me!!! I have two more years left in this contract and I hate this phone. I do get a lot of looks with it... but only if they knew how much I wished I had the ...  Motorola V600...", "Date": "June 17, 2004"}, {"Title": "Horrible service from AT&T", "Author": null, "ReviewID": "R2HULRAT0WHN7G", "Overall": "1.0", "Content": "The phone is great but AT&T has to be the worst cell phone provider ever. There network has so many dead spots its not funny and not small ones either. I got better signal when i was roaming so what ever you do do not get at&t is a big disapointment!", "Date": "June 11, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "Nokia 3300", "Name": "Nokia 3300", "ImgURL": "http://ecx.images-amazon.com/images/I/51ZVRG8JJYL._SX300_.jpg", "ProductID": "B0000CE1H2"}}