{"Reviews": [{"Title": "I love my green PEBL!", "Author": "Jen or Tom", "ReviewID": "R23SOQ41Y0S9QF", "Overall": "5.0", "Content": "I have had this phone for over a year now. I love how it feels in the hand; MUCH better than my husbands RAZR! I was happy to find a phone in my favorite color, and the green is wearing well.I have not had any problems with this phone, although I have had some issues getting the software on my computer.It's a fully functional cellphone, the equal of my husband's RAZR and better than the Nokia I had before it.I don't understand why the PEBL isn't more popular, honestly!", "Date": "October 29, 2007"}, {"Title": "best motorola since v60", "Author": "V. Sapone", "ReviewID": "R1V5L3COOIX7R2", "Overall": "5.0", "Content": "Honestly, I own this phone in black and I've had it for a year and it is a great phone. I hated my razr and bought this unlocked from Motorola's website. Other than the issues of having to program all the gateways and codes for your carrier so that the texting and multimedia messages will work, everything is great. I highly recommend this phone.", "Date": "November 2, 2007"}, {"Title": "great phone", "Author": "S. Colvin \"S\"", "ReviewID": "R21I2WEY2EB5XP", "Overall": "4.0", "Content": "this is a great little phone..my carrier is cingular...and the phone is t-mobile..but no worries...i just put my sim card in and it works...only one minor problem..i cant access the web to download ringtones..but i really dont care about that at all..", "Date": "March 19, 2008"}, {"Title": "GREAT PHONE AND PRETTY SMOOTH  [HELPFUL HINTS ALSO]]", "Author": "Doe \"Doe\"", "ReviewID": "R2TXLTQMCYCO6Z", "Overall": "5.0", "Content": "I PURCHASE THIS PHONE IN CELERY GREEN,YES THIS PHONE COMES IN CHINESE I WAS DEPRESSED AT FIRST CALL AMAZON AND WANTED TO RETURN IT MY MIND SAID PLAY WITH IT A LITTLE SO I  DID, I CALL MOTOROLA SUPPORT LINE THEY TOLD ME HOW TO CHANGE TH ENGLISH WHICH I HAD DID BEFORE I CALL THE PROBLEM THAT I WAS HAVING WAS WHEN I WAS TRYING TO STORE NAMES IN PHONEBOOK THE PAGE WAS IN CHINESE I CALL MOTOROLA TWICE AND TALK TO TWO DIFFERENT PEOPLE NEITHER ONE KNEW ANYTHING,SO I PLAYED A LITTLE LONGER UNTIL I FOUND THE PROBLEM I GOT THE PHONE IN ENGLISH FOR PHONEBOOK I WAS SO HAPPY...A PERFECT PHONE AFTER ALL GREAT FEEL GOOD RECEPTION.I HAVE PURCHASE THIS PHONE ABOUTSIX TIMES THAT'S HOW MUCH I LOVE THIS PHONE,DIFFERENT FROM ANY PHONE I KNOW I ALSO PURCHASE AN PINK FOR MY THIRTEEN YEAR OLD DAUGHTER .IF ANYONE HAS THIS PROBLEM I JUST DESCRIBED PLEASE EMAIL ME AT:doe38039@bellsouth.net OR SENT YOUR NUMBER IN THE EMAIL AND I WILL HELP YOU IF YOU LIKE.DOE", "Date": "July 12, 2008"}, {"Title": "No money back for a non working produkt, wich was sent return !", "Author": "nixdorf 08", "ReviewID": "R1BDVWL7Z1AJ1S", "Overall": "1.0", "Content": "No money back for a non working produkt, wich was sent return ! I`m so sorry but this firm should be registered on a crime scene register.", "Date": "December 29, 2012"}, {"Title": "It was OK at first", "Author": "Tony", "ReviewID": "R142K6HQ0G6F1Q", "Overall": "3.0", "Content": "I bought it from my sister a gift. is a good phone and works Perect with Digitel in Venezuela. It was OK at first, but after a year he was hurt to flex the lid.se lo compre a mi hermana de regalo. es un buen celular y trabaja perecto con digitel de venezuela. Estuvo bien al principio, pero despues de un año se le daño el flex de la tapa.", "Date": "January 5, 2011"}, {"Title": "Love it!", "Author": "LGusty", "ReviewID": "R2HCVCGHDOM9LC", "Overall": "5.0", "Content": "I enjoy the phone and it worked great with any sim card i purchased overseas (mainly Italy).  Very decent battery life and user friendly.", "Date": "February 24, 2009"}, {"Title": "A cute cheap phone", "Author": "Angeline Tran", "ReviewID": "RX344Z2SLMQHQ", "Overall": "5.0", "Content": "I break my phones without blinking so when i broke my LG vu, I was done with buying expensive phones. This phone is great. It's unlocked so all you need to do is put in your simcard and your phone is ready. The hardware is great. It looks adorable and the slide to flip action makes me happy ^_^. I only use my phone for calling and texting so i didn't mind that the internet won't work. Saves me the extra bits it would cost if i accidentally presed the web button.If you broke your phone and you don't want to buy a used phone. get this one. great price for a working phone.", "Date": "January 7, 2009"}, {"Title": "Really very nice Phone", "Author": "S D G \"shiveringwhippet\"", "ReviewID": "R2L7181CJSHI40", "Overall": "4.0", "Content": "The green color on the web page has a more 'sage' look, the actual phone is slightly more yellow-green, and metallic, which came as a disappointment, however, I really like this phone - it is a beautiful design inside and out. I have only used standard texting and call features, but it is very robust, easy to use and to notch design.", "Date": "October 12, 2008"}, {"Title": "Pebl phone", "Author": "T. Cotman \"Tapioca\"", "ReviewID": "R1U7IHTTHUMGP9", "Overall": "1.0", "Content": "This phone was of no use to me. The phone was in chinese and so was the manual. This was not the phone amazon advertised. The phone I ordered was in english and unlocked. Amazon would not replace it for another one. Buyer beware.", "Date": "March 27, 2008"}, {"Title": "AMAZING!!!!", "Author": "S. Cuellar", "ReviewID": "R2ZDMJEE56RDOG", "Overall": "5.0", "Content": "FAST, RELIABLE, COMPLETE, IN THE RIGHT COLOR, NO PROBLEMS. THIS SELLER DELIVERS!!!!!!!!!  VERY VERY SATISFIED.", "Date": "March 10, 2007"}, {"Title": "i hate this phone!", "Author": "Genie Mom", "ReviewID": "RQ2HJZBDU5GRT", "Overall": "1.0", "Content": "okay ihave soooo many problemes with this phone and there not the dumb problemes stupid ceos complain about[i swear some of the most stupidest complaints i have ever seen!] i have had this phone for only a month and a half! i dropped a few times and one hard time at a subway resturant now it turns self ever 5 second[litterally!] and drops almost all of my calls. has horrible pictures from the camera. cant set your own speed dial it goes according to first letters, so if u have a friend named tyler, sean, or walter u  ALWAYS have to go to the phone book and look them up. wont even charge now b/c of this stupid turnig itself off deal. If your a gamer i dont recommed this phone b/c u cant downlad games i was highly  dissappointed about that. sometimes when somebody is trying to call me i will flip open the phone and it will automatically will either just keep vibrating, will make this horribble siren noise, or just drop it all together.and to make the phone turn back on or stop doing this i would have to take the battery out and put it back in, so now my battery cover comes off all the time now from me having to do that so much. now if your a person who is somewhat clumsy or drops there phone every once in a while i strongly suggest u not to get this phone. and if your person who is not that i still dont reccomed this phone b/c its just a bad phone overall.", "Date": "July 5, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and GPRS capabilities\nCompact clamshell phone with unique oval shape and cool external monochrome screen; 5 MB internal memory (not expandable)\nVGA camera with video capture; Bluetooth for handsfree devices; full duplex speakerphone; access to personal email\nUp to 6.7 hours of talk time, up to 250 hours (10+ days) of standby time", "Name": "Motorola PEBL U6 Unlocked Phone with Camera, and Bluetooth--International Version with No Warranty (Celery Green)", "ImgURL": "http://ecx.images-amazon.com/images/I/41AZS7FtlsL._SY300_.jpg", "ProductID": "B000JUX8M8"}}