{"Reviews": [{"Title": "Don't Hesitate", "Author": "waderade", "ReviewID": "R1Q1YRUS4FABBM", "Overall": "4.0", "Content": "im 19 yr old male from texas.Got this phone for Christmas for 400$.If you are thinking about this phone but cant decide, over others, consider this. i previously owned the original iphone. great phone, nonetheless, but decided to sell it and go for a nokia. Most people dont realize it, but this nokia really can do just about anything (and more) than that iphone your thinking about. (save the apps on the iphone) But i truly am more happy now with my Nokia. its such a solid, substantial piece of technology, in every way i can think of, nokia made this thing of quality materials. not fragile at all.So what about the monthly internet (data plan) ?Well, with the iphone get ready to pay 30$ a month for data alone! that is a rough estimate of  720$ over a span of a two year contract with at&t.;Why not get this Nokia, sign up for at&t;'s \"smartphone data plan\" (also known as MEdia net thing) i pay literally 15$ a month flat rate for unlimited data. it takes no genius to realize thats about 360$ savings over 24 months. (that number covers the actual cost of the phone it self!)Do not be swayed away either by the e71's business appeal. I am a college kid and very into electronics, and i can honestly say this phone has everything a person would need (business/just for fun/practical uses) and seriously has technology a year ahead of its time. in otherwords, i could see myself using this phone in two years and still be more than pleased with it.Buy also a micro SD card. i bought an 8gb card on here for around 20$ these plug into the phone and allow you to save your media on the phone. i.e. music, videos, pictures ect. this gives me a wonderful media device thats easily comparable to any ipod.one setback on the phone is the 2.5mm headphone jack. Standard is 3.5mm so your favorite headphones wont plug into the phone without an adaptor. i bought one on dealextreme.com for literally 1.26$ (no tax, and no shipping) the adaptor is a 2.5mm male to 3.5mm female adaptor, and works wonderful.Nokia did things right with this device.the iphone strays away from the fundamentals of what a cell phone is really about: making/ recieving calls. Nokia sticks to simplicity and makes using the phone for calls/texts VERY straightforward and easy.you wont be dissapointed, and at this price its really a deal that can save you a good chunk of change in the future.", "Date": "February 5, 2009"}, {"Title": "Good phone, but overrated", "Author": "M. Dembski", "ReviewID": "R1ZSXUVUML5I58", "Overall": "3.0", "Content": "Based on all the reviews I had seen of this phone, I am really under whelmed by the actual product. I have used a Motorola Q9h and really wanted something  that could connect to WiFi.  While the E71 does that, it does not offer much more.  It has a few nice features, but there are many things that make you wonder what Nokia was thinking.Pro:Build quality is greatEasy set up, auto wizards did everythingBrowser is greatCall quality and signal is good (better than some LG phones but no better than my Q9h)Menu system is very good (much better than Windows mobile which hides so much).Lots of option for pic takingPC Suite is a nice free app for syncing -integrates well with OutloolGPS with Google maps is very quick to pick up signalNice to have a phone w/o all the garbage they put on the ones you get from the network operators.Syncs Outlook notesCons:Sending and deleting emails should be easier, they make it a 2 step process.  I do a lot of email and this is a major disappointment.When using IMAP for mail, no way to move emails to other folders.Categories for contacts does not carry over from OutlookNo ability to filter contacts, you must use groups.  Unable to set a default groupDoes not play quicktime or windows media video filesPic quality is just ok, color are really off unless the light is greatSignal strength meter is almost impossible to readLimited ability to customize home page, no ability to add shortcuts to non original apps (lots of plug ins for Windows mobile allowed much more flexibility)Enabling call forwarding is a very involved processAlarms are not well done.  You can not save an alarm turned off.All in all I like the phone but am not sure there is much of an improvement over the Motorola Q9h.  Generally better menu system, but email is a weak point on the E71.  If you are a light email user and are looking for a good looking phone, the E71 is a good choice.  If you are a heavy email user, go with either a Blackberry or Windows Mobile phone such as the Motorola q9h", "Date": "January 24, 2009"}, {"Title": "I am happy with mine but like anything else it can be improved.", "Author": "M. Kertajaya", "ReviewID": "R1342OOGBZLBYB", "Overall": "4.0", "Content": "I have been a long time user of smartphone. Started with one of the first smartphones, Ericsson p800. Then some windows flavor as well as blackberry.This phone is by far the best phone I have owned. And I think this phone is probably one of the best looking phones in the market. Here are some of the things I love about this phone:1. It has a very strong signals.2. Call/voice quality is really good. Speaker is loud as well.3. Battery lasts a long time.4. GPS works really well and fast (this phone has 3G). GPS works especially well with google map/earth.5. It plays youtube out of the box.6. One hand handling capability from typing, taking calls, etc.7. Screen is bright and still usable under bright sunlight.8. Lots of applications available including a free SEVEN push email solution which is still beta version.9. Multi-tasking.10. FM Radio.11. An ability to subscribe to podcasts and download the only the ones you like.Some of the features that can be improved:1. Audio playback like play list creation and sound quality when using headphone are not as good.Creating a play list requires too many clicks. I am using a kingston 4gb and often my song list just disappear. I need to refresh it many times.I can hear a hissing sound from the headphone. From what I read many people experience this as well.2. Lack of task manager. I can not kill an application like I can on windows phone.Correction: The task manager came with the phone can kill most of the programs but not all. A media player for some reasons can't be killed using this. And in my experience, this is the one that hangs often.3. Keyboard takes a little time to get used to. I don't have big hands but I am still trying to adjust to this keyboard.4. Copy and paste only works in some applications. With windows phone, you can always copy and paste almost everywhere. Not with this phone.5. Headset output is not a standard size.I found 'Shure' makes an adapter which allows you to use regular size (3.5 size?) headphone of your choice. This adapter comes with a microphone. There are a lot cheaper one, but none comes with microphone. This adapter was made for Palm device but works well with E71.6. I like the FM radio but this feature only works when you attach the included headset. I think the antenna is actually on the headset.I hope this brief review helps. Some of the feature like camera, I have never really used. So I don't mention it here.", "Date": "November 14, 2008"}, {"Title": "Top of class smartphone", "Author": "aaronlws", "ReviewID": "RS18ZFZXNBXVV", "Overall": "5.0", "Content": "This phone is possibly the best smartphone available right now (December 2008).  I've had windows mobile, palm and blackberry phones in the past to compare this to.Very thin, sturdy (all metal casing) it feels solid in your hand, professional and sleek.  Screen is good, keyboard better than most, camera, GPS, email....it essentially has it all.  \"Mail for exchange\" software works flawlessly for \"work\" push email and calendar syncing.  Battery life is outstanding (two days on one charge with moderate to heavy use...which is as good as it gets).Nokia makes everything customizable with many shortcuts available to get to all functions.  Really a great thing about Nokias in general and this one is no different.  Short press the dedicated calendar key (like on a Palm) for the calendar, long press for a new calendar entry.  4 dedicated keys for these types of things (calendar, messaging, contacts and a home key) and 6 on screen shortcuts, plus two more soft key shortcuts and even some keyboard long press shortcuts on top of that.  That means one click access to just about everything you would want to do with the phone.OS crashes less than windows mobile, though not as good as blackberry (simply turn off / on to get back to normal - this happens once every two weeks or so if you use it heavily).  There are many app's available for download.  Camera is good in good light, video quality is surprisingly good (even in bad light).  GPS works great (download google maps).This is the best smartphone that I have ever owned and as good as any smartphone available on the market right now in terms of build quality, battery, features and certainly in terms of looks (slimmer than the iPhone 3G and as I said before - it is made out of metal).  The metal gives the phone a certain gravitas, a certain feeling of quality that it generally not available in phones.  It feels like a well made tool, it just feels good in your hand.Get a blackberry if you mostly just need email and don't care as much about multi media and games and the like.Get an iPhone if you mostly want multi media and the like and not so much email.Get this phone if you are in the middle (though it handles email and calendar syncing about 95% as good as a blackberry - I use it heavily for work email and have no complaints).", "Date": "December 19, 2008"}, {"Title": "Wonderful phone if you can overlook a few little things and get the right plan", "Author": "Andrea Polk", "ReviewID": "R1VG3X7451EK5D", "Overall": "4.0", "Content": "I'm a 6-year T-Mobile customer. Why? Because frankly, I'm too scared to change! Really though, I have a $29 a month plan (Business 300) that is no longer offered - 300 whenever, unlimited weekends, 100 texts, which has worked well for my needs and budget.  Unfortunately all the handsets I've owned (Nokia and Motorola) have had terrible reception much of the time.  I was blaming T-Mobile until I got the Nokia E71 and I'm THRILLED with the call clarity! Both on my end and for the recipients of my calls, who say they can't tell I'm on my cell - 'a first'.I purchased this item as a Gold Box deal after reading online reviews here and elsewhere, that gave it mostly glowing reviews.  I also liked that it would work on T-Mobile or ATT, which are both available in my area.  I had hopes of using T-Mobile's $10 a month add-on for 'unlimited web for phones' (previously called Web2Go.Upon opening the box I was surprised to see that the size and thickness of the phone are almost identical to my iPod Touch.  Very pretty - sexy even - the phone has an easy to use keyboard (my first phone with this type) with raised keys.  I have small hands and didn't find it tough to punch in numbers or texts, but people with bigger fingers might. The keyboard is backlit, which is very helpful, but it's not very bright.  I bet there's a setting for that which I've not yet discovered though.The documentation, a CD for the PC Sync suite from Nokia, an AC charger, earphone/microphone combo, white (slip-in style) case, battery, and phone are in the box. I also bought a OtterBox Commuter Case for Nokia E71x (Black) to protect it.  This case takes away from the beauty of the phone, but gives a bit of added protection.  The Otterbox Defender series is even better, but more expensive.Not being a big reader of directions, I tried to wade through the manuals anyway.  That was daunting.  There is a lot of info on this phone as it has a lot of functions! I found that after I swapped my SIM card from my previous T-Mobile phone and got to the home screen on the E71, I could press 'menu' and then 'help', and again 'help', to be where I wanted to be to learn about this device.Some cool functions found on this phone and discussed in 'help':-Adobe Reader-Activation Keys-Active Notes-Barcode Reader... VERY unusual to find on a phone and very cool to save product info and compare prices.-Dictionary-Flash Player-GPS-Internet Radio-Modem - you can connect this phone (assuming you have mobile web on it activated) to a laptop for example, and use it as a wireless modem.-Net calls... it has a webcam built in.-Printing... add a printer to sync with your device to print docs.-Real Player-Recorder-Wireless keyboard...if you link it to your phone, you can use it!A 'Tutorial' section is a available in the 'Help' section as well, with short animated videos on 'how-to'.  I like this area, but even with these helps... this phone has a lot to offer and a lot to learn.The E71's build quality is excellent!  Metal housing makes a world of difference in the feel of the phone.  I expect it would add to the durability as well.  My Nokia 5300 with a hard case started cracking within months of light use, as have other plastic phones I've owned, so for me, this is a big deal.Navigating the phones many functions is relatively easy, but yes, it takes time to get the hang of it.  Buttons for specific functions like email, 'home' and others are clearly marked.  The side of the phone has a mini-usb port and mini-SD card slot, covered by rubber inserts. Volume controls are on the opposite side of the phone and work easily and well.The 3.2mp camera is better than previous phones I've owned and it does come with a flash, which is new to me on a camera phone. Images were blurry or 'cloudy' looking, until one reader of the review mentioned taking the plastic film off the lens. \"Duh!\"  Usually I remember these things, but not this time.  Taking the film off the camera lens definitely makes for better pictures - clarity wise - however the color of the images taken indoors with the flash, tends to be a bit off. Not a huge deal as photo editing software takes care of a multitude of sins, but you probably wouldn't want this camera to be your only one.Charging port is at the base of the phone, with the speaker and on/off at the top.  I noted the microphone is at the lower left-hand side of the phone.  This is great if you are right handed while making calls, but call quality seems to suffer just a bit when you switch to left-handed chats.  Microphone placement... who knew?!The keypad does lock and the screen goes dark rather quickly.  Again, probably just a setting issue I've not yet discovered in my 3 days playing with it. I looked it up in the book how to 'unlock' - pressing two buttons - which while a pain, is no big deal either.The screen is big enough for most things.  Not fantastic for viewing web content, but this isn't really a web-maximized phone either.  The OS alone should tell you that, and if you're looking for a multi-media phone, keep looking.  It will email, do basic web browsing, and open media files if you have the appropriate data plan.  I didn't want to pay for the $20-30 a month web plan, so I am trying out the $10 a month unlimited web plan for phones with TM right now.  While I have a very basic Facebook interface for example, it's nothing like you would see on your home computer.  It is however, handy to Google things, comparison shop while out and about, check weather, etc..., which is good enough for me.  **I have been told by some that T-Mobile may try and kick me off this $10 plan saying if I have a smartphone I need the more expensive one.  My time with T-Mobile would be cut short if this happens, and I'd be looking to switch to ATT, as for me, this would be simply a way for more cash without 3G!  T-Mobile does not have 3G to this phone, but the phone IS capable of it.I was going to return this phone, but that was due more to T-Mobile issues rather than the phone. I love the clear call quality most of all and the easy texting. Admittedly, basic stuff. The internet, if available, also affords some nice things like email, Skype chat, Facebook, and Internet radio (too bad it's got that 2.5mm port versus the 3.5mm standard).In conclusion, it's a really nice phone for the right user. Not the best for multi-media or taking pictures, but a quad-band phone that has exceptionally good call quality, nice speaker and keyboard, moves quickly through apps, has built-in GPS (no internet needed) and Wifi capable.  I really like it, which I can't say about many phones I've owned. So the only real problems I find with it are linked more to T-Mobile as a provider than the phone itself. Which leads me to the basic question: 'Is the money I paid for it even on sale, worth it?'  \"Probably... at least for me.\"4/26/10:I have had a full 24 hrs of using this phone with T-Mobile's 'unlimited web for phones' ($10 a month) add on. I lost it initially when T-Mobile figured out I'd switched phones.  I went back to their site and put in my old phone as the one I'm using, and so far, they've not cut off my internet service. While it's nowhere as fast as 3G, nor visually as 'wow' as the newest touch-screen phones with Android OS... it's the useful kick I needed to make me happy and at the right price.Now I have a phone that has great voice quality, speedy bluetooth uploads (took some photos and got them to my desktop very quickly), easy texting, GPS (tried that today too, and had it plot some routes with great success), music player and other assorted goodies that for me, are really sweet!I'll be keeping this phone and may end up adding more texts or more minutes to my phone plan simply because it's a joy to use.  Has held a good charge too, even with lots of web browsing, texting and playing music. I like it and would recommend it to the consumer who wants a feature packed phone, that while not the 'latest and greatest', does a damn good job at the things it was designed to do.4/48/10:T-Mobile's Web2Go is called 'unlimited web for phones'.  I had added it (free for 1 month), but decided $10 was more than I wanted to pay for this basic stuff (not G3).  Today when I went to take it off, T-Mobile offered it for $5 a month, calling it \"Preferred Phone First Unlimited Web Only\".  I snagged it and upgraded to a non-contract extending plan: 'Even More Plus 500 Talk + Text' which is $39.95 a month.  Now I have unlimited text (video, IM, Photo, or text), unlimited weekends and evenings, unlimited web and 500 anytime minutes for $44.99 plus taxes.  The Even More Plus 500 Talk, Text and Web unlimited is priced at $59.95 plus tax... so I feel really good about both the T-Mobile deal AND keeping this wonderful phone!", "Date": "April 25, 2010"}, {"Title": "Top Pick in Fortune Magazine", "Author": "Y. J. Liu", "ReviewID": "R2EQIBXQIL77GH", "Overall": "5.0", "Content": "I picked the phone because I wanted something that not everyone else has.  iPhones and Blackberry phones are Everywehre.  I like the look of the iPhones, but I don't like the touch screen for texting.  I like the keyboard on Blackberry phones, but I don't like how thick the phone is and small the keyboards are.  Nokia is such a great choice for two in one for my life style. It's functional, it's user friendly, its got clean sounds and clear screen, it's got 3.2 mgp camera, and it's thin and beautiful.  I'm very very very happy with it... :)", "Date": "November 22, 2008"}, {"Title": "Best Phone on the Market", "Author": "Di", "ReviewID": "R19FEODDT56O2B", "Overall": "5.0", "Content": "I used Nokia when they made the brick phones. I updated to all kinds of phones, and I still missed the quality of the Nokia, but I was too embarrased to carry around such an ugly brick of phone. This phone does everything! I have a hard time keeping track of events, when to take my vitamins, when exams are due, birthdays, everything. With other phones I had, there was the option to use the calendar and alarm settings, but none like this. Now, I don't have an excuse. I used to be stuck by the monitor all day waiting for that email, myspace message, Google Chat, AIM, messenger, facebook photo tag, listening to Last.fm, and now, I can literally take all of that with me. And the best part is, it does not eat up the battery and I can go anywhere! I can scrobble music on here with my SD card, and I have a GPS and it tells me where the closest dry cleaner is and what not in walking distance that I never knew of before! It also has this really cool application called SportsTracker, and it tracks not just the miles, but your pace. It is a great tool for athletes. I can see how many calories I am burning on my bike rides, and I can see how far I go when I walk to places. It made me get a little competitive with myself and I try to beat my own record. I love Nokia, and I have seen and tested all kinds of smartphones, and I know this phone will be with me forever!!Me + Nokia = Common Sense", "Date": "November 27, 2008"}, {"Title": "Worth the Price for the Wireless Hotspot Functionality Alone", "Author": "Ripoff Britain \"Ripoff Britain\"", "ReviewID": "R2MVLET067YMO3", "Overall": "5.0", "Content": "This phone has lots of fan reviews posted here now, so I won't add to the noise, except to point out how well this phone works as a shareable wireless hotspot.  (You will need an unlimited data plan.)  Just install Joikuspot, create a Joikuspot account, and you're off. You can put this little phone back to back (held together with a rubber band) with an iPod Touch, and have much of the functionality of an iPhone, but without throwing AT&T; a dime.Icing on the cake:  Skype, Google Voice, and Gizmo5 all run perfectly on my E71.", "Date": "April 16, 2010"}, {"Title": "love, love, love this phone!!", "Author": "Ana \"Ana\"", "ReviewID": "R12JX7EYAE2GES", "Overall": "5.0", "Content": "I received my phone on 12/24/2008, and I just love it! At first I wanted to get an iphone, but the $30 extra monthly for the iphone set me back. I've always been a fan of Nokia due to their great reception, battery life, and durability. I went into the Nokia flagship store in NYC during Thanksgiving break, and I saw this beautiful phone, and I just had to have it. I checked on Amazon, and it was on sale! Saved $100.As soon as it arrived, I just inserted my ATT SIM card, and it was good to go. Some of the contacts did not transfer from my previous Nokia phone, so I had to do that by hand :/. I got the ATT media net package for $15/month, and the internet works great everywhere, it is very fast. Setting up email was very easy, just had to type in the user name and password. Calendar is very user friendly, I use it all the time, and I think the camera is pretty good considering it is a phone camera. All in all, a great smartphone, no complaints, highly recommended!!", "Date": "January 13, 2009"}, {"Title": "Great Phone!", "Author": "Aleceia Blount \"lece777\"", "ReviewID": "R2BANU58JQGJB6", "Overall": "5.0", "Content": "I love my phone.  I have had many phones before, but this one comes with many great features.  I am very happy that I made the purchase.  I bought it due because I needed a phone on a GSM network.  And only AT&T; and T Mobile are on those networks.  I travel to Europe mostly and South America and Japan on occasion and I needed to have a phone that would work in all of those locations.  I found the manual a bit difficult to understand initially, but with time the features and function are great!  I am very satisfied with my choice.  The phone does require patience if you are not a Blackberry person!  I was not.  The sound and volume of the calls is great!  I had previously used LG and Sony Ericsson And I would have trouble hearing my phone ring if I had it inside a purse or backpack and even my pocket.  I can hear this phone very clear and the volume is not at maximum!The camera is not a great as my LG, but in general I would make this choice over again!", "Date": "November 4, 2008"}, {"Title": "Unlocked phones are the way to go!", "Author": "W. Chan \"Bike commuter\"", "ReviewID": "R3PJ1F8FBW2911", "Overall": "5.0", "Content": "I use my phone for 1-2 hours of phone calls, an hour of email, and maybe a little web and gps thrown in. I charge it every other day. Things that I like are the basic design, sturdiness and quality.  Call reception is excellent.  I previously had two Samsungs, and always had numerous dropped calls each day.  Reliability of radio service is much better now, which is saying a great deal considering I use the least reliable network (begins with \"A\").  It comes with a wired headset and I actually prefer that to my bluetooth earpiece.  Sound quality is important.  The speakerphone works but isn't loud enough in my car or outside.The keyboard is a little cramped and takes getting used to.  The dictionary works great and mostly predicts what I am trying to type.  You can add any word to the dictionary easily as you type.  I have g-mail and I found both the Nokia mail app and g-mail's own app disappointing.  The Nokia app doesn't display html messages without opening a separate browser--not good if you want to quickly scan through messages.  The g-mail app opens .pdf files within its program, but loses document formatting.  You cannot choose to open an attachment with a program of your own choosing (sounds like the Microsoft strategy is growing within the g-camp).  I found \"Profimail\" which works great for me.  It works more like a true desktop mail client and can update your IMAP folders so you can carry all your important messages with you.  You can download attachments to any location and open them with the application of your own choosing (like Acrobat Reader).  The mail client meshes well with the Nokia address book.  It is totally software worth trying.  I purchased it after only a couple of days of trying it out.There's another default screen app called \"Active Notes\", which I thought would make saving documents a snap, but I was again disappointed.  Sometimes I edit emails for people.  I copy emails, paste and create a document, edit and then send the edited document back as an attachment that can be copied and pasted into a new email.  I tried using Active Notes and it would only attach as a .zip file.  I replaced the Active Notes icon with Quick Office, which works well and saves text documents as .txt and .doc.For gps and maps, I use Google maps for Symbian.  The gps works quickly and accurately.  I'm a guy and wouldn't use turn-by-turn directions even if they were erotically whispered into my ear.  I just want to find my location and look at a map.  While house-hunting recently, I used it to look at the satellite views too.  I recommend Google maps and it's free.The browser mostly works well, and I salute any browser that can display modern web pages on a 240x320 pixel screen.  I tried Opera Mini, but didn't see anything better, so I just use the Nokia included browser.  Speaking of internet, I also use my phone with the included USB cable as a tethered modem.  The Nokia PC Suite of software makes that pretty effortless.  Too bad the USB cable doesn't also charge the battery.  I purchased a separate USB charging cable that adapts to the charging connector on the phone.There are a few little irritating quirks i found.  You can briefly push the power button to switch to different modes, like \"Silent\".  Unfortunately the default setting on Silent mode is to not alert or even vibrate upon receiving a call.  I missed a whole days worth of phone calls because of that one.  I later edited the Silent mode to include a vibrating alert.  That seemed a little lame to me.When the phone drops into the standby screen it displays the time without the backlite.  When you press the home key, the menu displays and when you press the menu key, the home screen displays--Totally backwards.The mute button is right between the volume keys and you can easily mute your own voice while trying to adjust the earpiece volume if you are not careful.The menus are confusing and completely non-intuitive.  Trying to find out how to change something like a hot-key can take a lot of trial and error.  An update to the Symbian OS is going to be necessary to keep Nokia competitive.The best case I found is from Beyzacases.  They are a Turkish company that makes fine leather cases.  I received mine within 3 days of ordering from them.Lastly, the fact that it is unlocked (but works best on US ATT networks) is the best feature of all.  You will pay half what you would pay for data if you buy a subsidized phone with a contract agreement.  When you remain out of contract your carrier's CSRs will treat you with more respect and care.", "Date": "July 3, 2009"}, {"Title": "More than a Smartphone!", "Author": "V. Gonzalez \"pizzagal\"", "ReviewID": "R2DL34LDNKLAVY", "Overall": "5.0", "Content": "I must chime in and state that this is another solid performer from Nokia. I also have the Nokia N95, but wanted something with a qwerty keypad.  Like another reviewer, I really like to step out of the norm where phones are concerned. I tried the Blackberry 8320 and was disappointed (after being spoiled by the N95's GPS, VIDEO capabilites, 3G, browsing capabilites, etc.). So I sold the Curve and got the E71. This is an extremely impressive device. It is VERY user friendly, has a sleek yet sturdy design and is free of bugs and glitches others have experienced with many (dare I say) similiar devices. I like the Symbian OS and the available applications for this device are endless!I only have a 2GB micro in it, yet I have had no lag issues and it has not crashed or locked up on me. It is easy to customize and the switch features are GREAT!  I was able to completely transfer everything on my N95 to the E71 using the Swich feature in Tools and the Switch feature for business and personal use on the homescreen is VERY handy!Who needs a touchscreen when this phone is the trump card against ANY phone!", "Date": "December 8, 2008"}, {"Title": "Top notch quality", "Author": "Mafusto", "ReviewID": "R1W0A4SURYK8XN", "Overall": "5.0", "Content": "So what this phone is a couple years old.  I had a BB curve and would never turn back.  This phone's quality is far superior than most phones I've ever seen.Just read the other reviews here... you WILL NOT be disappointed for the money!!I hope they keep making these for a while longer, I would gladly buy another as a back up.Oh ya.. Fring (a free separate app) will bring joy to you and your children with the front facing camera!", "Date": "January 31, 2011"}, {"Title": "Previous iPhone 3G user; Now a Nokia/Symbian Fan!", "Author": "Ajay Viswanathan \"Viswajay\"", "ReviewID": "R1VMTW1TKEDT22", "Overall": "5.0", "Content": "Prior to purchasing the E71, I had the iPhone 3G. Granted the user-interface and touch response of the iPhone is great but I honestly prefer the E71 over the iPhone. Here are my reasons why:- You maybe wondering, why would someone downgrade from an iPhone 3G to Nokia E71 (2008 phone)? Simply because the E71 cuts all the unnecessary garbage and is just GREAT for making and receiving calls, checking e-mails (work, school and personal), maps/directions, music, calendar, contacts, slim form-factor, long battery life and most importantly, it's MADE IN FINLAND!- DESIGN: It's sleek and solid. Very well built and feels good in your hands. Metal backing and overall, looks very classy!- MUSIC: E71 is expandable via micro-SD. Invested in a 8GB micro-SD card (Class 6), transferred my music, purchased a 2.5mm to 3.5mm headphone jack adapter, bought a Fiio Headphone Amplifier and you've got yourself a high-quality portable MP3 player AND you can answer calls, browse the internet and check e-mails.- MAPS: Ovi Maps (offers voice-guided directions) and Google Maps are both great! One feature I absolutely LOVED about Google Maps for E71 was the voice-recognition feature. Press the TALK button and say the name of your destination (ex. XYZ Drycleaners), I was blown away by its accurracy - it actually works flawlessly! With Ovi Maps, you can download maps from different countries. I'll be traveling to India this summer and the idea/concept of having the map of India for point-to-point direction is just phenomenal.- KEYBOARD - Now I'm back to using a physical QWERTY keyboard but the layout is great. Well placed, raised keys. After a week or so, you'll get familiar and will be typing at a good speed.- SCREEN/MENU: Great resolution, brightness. Adjustable menus, icons, apps etc. The layout of the menus and options is simple and straightforward. Won't even need to look at the manual, it's user-friendly.- It's got VIDEO CHAT facility with a front-facing camera.- It's got an FM Radio which works great!Overall, if you're looking for a phone that DOES THE JOB and DOES IT EFFECTIVELY and EFFICIENTLY, go with this phone. Sound quality and clarity is great. I can go for 2 days EASY without having to charge the phone. If you're looking for a multimedia device, iPhone is your best bet. However, I've successfully been able to use pretty much all the features I used on my iPhone - maps (Ovi maps and Google Maps), E-mail, Shazam, Calendar, Facebook, Skype. I have the E71-2 North American Unlocked version. In other words, this is a WORLD phone! :) I've received several compliments on this phone in the past month that I've owned it. It differentiates you from the rest of the people with Blackberry's, iPhones, HTC's etc. No one can ever tell that it's a 2008 phone!Not really CONS but I'll say drawbacks:- no thread feature for text messaging- browsing the internet can be time consuming/cumbersome - but I don't usually surf the net on a mobile device that much anyway - (whether iPhone or E71)", "Date": "May 18, 2010"}, {"Title": "one of nokias finest", "Author": "brian stanley", "ReviewID": "RHGCRDKPYBL62", "Overall": "5.0", "Content": "This phone was way ahead of its time here in the US. Still ahead of its time for what it can offer. This phone makes any IT or Business professional's life easy. The battery life alone will give you bragging rights over any phone out there.", "Date": "March 20, 2013"}, {"Title": "Love the Phone", "Author": "Alberto Morales", "ReviewID": "R3BFQ30DRAMJ38", "Overall": "5.0", "Content": "This is just one of the best phones Nokia has put out in the market, I have had many phones but I still keep this one for emergency and works just great.", "Date": "March 1, 2013"}, {"Title": "Great phone with solid built!", "Author": "Sophia T", "ReviewID": "R3OZ3H9IA0DAIG", "Overall": "5.0", "Content": "Others have mentioned the excellent signal strength and impressive call quality of this phone, they are all true.  I just want to add that I've had this phone for nearly 10 months, and have dropped it on concrete floor, like, 6 times. So far, no problem whatsoever except for little dents on the casing. I've had other phones from Motorola, SonyEricsson, Samsung, and LG, after a couple times hitting the floor, the phones would start to auto shut down in the middle of a conversation, or wouldn't pick up a call, or lose signal strength where it should have been strong. None of such things with this phone.So I would say E71 truly has a very solid built that can withstand moderate accidental abuse.  For a couple hundred dollars, I would say this is a great buy! Highly recommended!", "Date": "June 30, 2011"}, {"Title": "Best phone even after 4 years", "Author": "Jtots", "ReviewID": "R3285BWKT8G4CE", "Overall": "5.0", "Content": "I really like this phone a lot. I have been using it for more than 3 years now, and yet, everything in the phone is very up to date and I never got the feeling I have to change to another phone, even when androids come in and touch phones are out.I find the design sleek and classy. It is very thin and not bulky. The QWERTY keypad is very delicate and is easy to type in. I send more than 1k text messages in a month and I find it very easy to use. I even type my word documents on the phone when I'm reviewing because it is the only device you can hold the book open with your arms, and yet see the book, and type at the same time. No need for trying to force the book open and move my head left (from the book) and right (to my laptop) just to type. Everything is in one view. And then after that, all I have to do is save the document in my memory card and transfer it to my laptop if I want to.When I got this phone, one of the details I have to have is a good camera. E71 has 3.2 MP camera and with an auto-focus, (or for even better focus click t), the pictures are of really good quality, unless there's no adequate lighting. It is enough for my everyday picture taking. Though I'm planning to find a regular digital camera so I can blow up my pictures. But with one that comes with the phone, I really like this.I also like the fact that it has a removable memory card. Mine came with a 2G mini SD card. I can use it to store files that I need and carry it around with me like a USB stick. Who doesn't have a phone with them all the time nowadays, anyway?I also like that it came with a headset that I can use to listen to the radio too.Wifi is a blessing for me since I can connect to wifi's and not pay for a internet plan with my phone plan.There are lots of games to download for E71 and it is easy to use the phone wifi and connect and download it right from there, compared to others where you need to log on your laptop and connect your phone, etc etc.In these days where the ports are limited, E71 still has the infrared. I don't know when I'm going to use it, but I am glad it's still here, with the bluetooth and wlans.Another thing I like about Nokia phones in general is that it is VERY durable. I drop my phone a hundred times and sometimes it opens up, with battery jumping out, etc, but when I put it back together, it works just like new! My phone has a lot of scratches and dents, bitemarks (from the baby I babysit for), etc. But it still works really well, considering it is around 4 years old or more already.It can also read your text messages out loud! It's fun! Another thing that I LOOOVE is that it has an option that when it rings, whatever ring tone you have, you can have the phone tell you who's calling, even before you get hold of your phone.. it's like *music music* Angelica Stafford *music music*. How cool is that!I can sing more praises about the phone, but all I want to say that is phone is a great buy and I love it so much!", "Date": "January 13, 2011"}, {"Title": "Best phone", "Author": "Joseph Candito", "ReviewID": "R1VK6PHKCBJTA1", "Overall": "5.0", "Content": "No doubt the best business phone I have owned. I know that the symbian OS isn't the most intuitive. Nevertheless, this is a rock solid phone. I owned an E71 since the phone came out. After two years of wear and tear, I thought I would buy an E72. However when I received the E72, I found it \"lagging\" and buggy. It also had a \"cheaper\" feel to it. I always wanted a white E71. I returned the E72 and purchase this phone. Didn't regret it one bit. The best word to describe the phone is: SOLID. And its pretty too. LOL.", "Date": "August 4, 2010"}, {"Title": "Great...", "Author": "Laurie", "ReviewID": "R38UQ54XDNCB52", "Overall": "4.0", "Content": "I was looking to get a phone compatible with my ATT service without locking myself into another contract (perhaps getting an iPhone after the bugs are worked out ;) ) I saw this deal. It was simple enough - slid the SIM card in and bingo!I only have the lowest plan with ATT and was worried about NOT using the internet capabilities - I actually would like to figure out how to disable. Still working on that... There are tons of options in the huge menu string, many of which I have no use for but obviously they made it to work on lots of systems.I got the \"white\" phone - but it is more stainless then white. Keypad is white and some edges but the rest is stainless steel. The image makes it look white but think more steel, if that matters, it made me happier, actually. It has a nice substantial feel too it - very thin and smaller then an 2G/3G iphone. The software for the phone/system is easy - makes transferring data from a PC very easy, online updates are available. Was able to put iTunes music on this phone.Battery life of just standby is amazing. I have small hands so the keypad is no issue for me but...I could see it being an issue for others. Also...I am of that age - reading the screen requires my glasses. LOLOverall...I would recommend if you need an unlocked phone try this.", "Date": "July 10, 2010"}, {"Title": "Once again amazed by Nokia", "Author": "MaChiBLue \".....\"", "ReviewID": "R3OL1PKS5UKLBD", "Overall": "5.0", "Content": "I've been a die hard Nokia user. I've owned several N-Series devices, as well as basic handsets, and once again the E71 has amazed me. This is my first E-Series Nokia phone, and I can assure you it won't be the last. I know the E72 has been out for a while, but there have been some major issues around it, so that is why I chose to purchase the E71. First of all, Symbian is so easy to use, and especially on this phone. The short cut keys for contacts, calender, messaging, makes everything so simple.Battery wise, it last up to 3 days with medium to heavy use. This is on par with my N95 8gb and N97, further proof that S60 offers teh best battery life of all mobile OS's. Overall it's a great phone and is reasonable priced.", "Date": "May 20, 2010"}, {"Title": "This is perfect phone for me", "Author": "AJ", "ReviewID": "R1NQT4YW3BNXLQ", "Overall": "5.0", "Content": "I own the N800 for the last one year and it is the almost perfect device for Net, MP3 player and the occasional reading of ebooks. Though, i still was looking for a device that can also act as a phone and has wifi(i am 99% time within a wifi network, so 3g/edge is not a factor).I debated between E71, N95 and many other phones. So what sealed the deal? E71 is way smaller than any other device (iphone included) (and that too with a very easy keyboard), perfect seamless pairing with my bluetooth headphone(motorola HT820) and easy OS. I never used a symbian phone before and without much effort(no RTFM) was able to learn all functions. Though there are times when there are just too many options and i do click the wrong button.People might complain about the no-touch small screen, but to tell the truth it serves the user adequately: compared to the N800, i find, i prefer the keyboard on the E71 better than the onscreen keyboard of the N800. It serves best as the enterprise device for which it was intended for so the camera is just ok (too much purplelish), screen is small for video but the processor/OS is snappy to handle it. Though the media player is awesome, pair up with a stereo headset and voila (it also supports album art, and easy way to create playlists )! There are many good and free Symbian apps from Yahoo, Google for mail, news, maps and work good with E71. Also, the battery is huge and can last more than a day with heavy net usage. Oh and the charger is the half the size of a fat thumb!Accompanying Software is pretty good and connects seamless through via IR, bluetooth or USB. for Mp3 files there is a convertor to convert to a smaller AAC format and load to the device (one can load as MP3 too btw). I use a Sandisk 4GB microsd to store media files as the inbuilt phone memory is just about 120MB. It has a one stop app solution to handle almost all phone functions like transferring files, to reading SMS's, backing up, etc.Symbian is pretty snappy as OS and i have yet to have a 2 sec+ lag moment (which sometimes happen when switching between wifi access points). GPS is Ok and takes sometime to get a lock, but with a real nice app from Nokia called Sport tracker to track walking distance etc etc and also works with google maps.Pros: Snappy OS, excellent bluetooth capability, very good apps, on the first look i wondered 'how did they cram so much stuff in such a small package and that too with a massive 1500mah battery!'.No Cons, except perhaps the red on/off switch on the top of the phone (see it's so hard to find a fault with e71)So overall its a dream phone for me and worth much more than the going price of 350$.", "Date": "December 3, 2008"}, {"Title": "Very good but....", "Author": "Average Consumer", "ReviewID": "R2IBA9Y7Z8J57I", "Overall": "4.0", "Content": "I bought the E71 to provide several functions:(a) international access to voice and Internet;(b) WiFi access; and(c) GPSThe voice, Internet and WiFi work fine. The GPS software, however, leaves much to be desired. See details below.Voice/Internet/WiFi work fine:-----------------------------The voice  worked fine with T-mobile and AT&T; in the US. The signal strength and voice quality are excellent. However, these companies either do not offer Internet access to prepaid customers, or if they do, their staff had no idea how to sell and use it. I used the E71  with O2 on a recent trip to the UK. The O2 staff, in contrast, were exceptionally knowledgeable and helpful in setting voice and Internet access in minutes; I paid 15GBP and had unlimited calls to the UK and US as well as Internet access which is where the money went.The WiFi access is terrific and I have used it heavily while travelingand at home to handle email and web access. The E71 discovers WiFi networks quickly and attaches to access points instantly.GPS Software Leaves Much To Be Desired---------------------------------------The GPS software is very unfriendly. I preloaded a map of London before traveling; when I arrived I found that only sections of the city werepreloaded while major other sections were missing; it was not clearhow to get the other sections, short of getting a map of the city andentering addresses in the missing parts. Then, when I tried to use thenavigation feature it got the route all right and the position of the car reasonably well, but, surprise, there were no voice instructions. I checked the manual and could not find how to get the voice to work. Fortunately, many other users that struggled with the problem posted solutions on the Internet. Do not expect the GPS to work like standard GPS. It does not provide visual directions for traveling; when it loses the satellitesyou may need to stop the car and push menus to get it to work again; etc etcThese are all results of poor software design...", "Date": "February 16, 2009"}, {"Title": "best...phone...ever... (for me)", "Author": "Daniel S. Lennon", "ReviewID": "R2R3RCKLWRIZCO", "Overall": "5.0", "Content": "for 4 years I was strictly sony ericsson. All the way from the T68 to the K850i. My K850 was incredibly buggy so I decided to give the N95 a go and never looked back. After nearly a year, there were just aspects where the '95 didn't do things I'd like it to do, namely, extended text entry. So I figured why not give the full qwerty a chance. Again, never looking back. In terms of my mobile needs this phone meets and exceeds all of them. It's great for listening to music, however for extended sessions I do bring a dedicated music player. This thing gets a GPS lock lightning quick, my N95 would take upwards of a minute to two, while often times I blink and google maps has already located me. The camera... leaves much to be desired. However, I was never content with any of my previous phones (K790, K850, N95) which had incredibly impressive cameras for their time. I only rely on cameras in phones for the rare times where I want to capture something but haven't brought a camera with me, or one isn't allowed. In terms of actually talking on the phone, I try not to do that. Not because of any flaws, I just prefer cell phones for their features rather than the phone aspect. It's flawless, I've yet to have a dropped call, or reception problems. My only gripe is with S60, not the phone in particular, caller ID pictures are handled horridly. If you buy this phone, be sure to look into FS Caller Id (check google) for full screen caller ID images.", "Date": "November 25, 2008"}, {"Title": "Nokia E71", "Author": "Ericson", "ReviewID": "R3H2BO57W2CZUB", "Overall": "5.0", "Content": "I must confess the nokia E71 I bought from amazon is working perfectly.I bought it under used phone but I'm supprised when I received the phone, it came in a box new and clean with complete accessoriesThis phone was sold by NSTORE.", "Date": "January 26, 2013"}, {"Title": "The Best phone I had.", "Author": "N. Hussain \"N. Hussain\"", "ReviewID": "R28Y2OFXXOEDK8", "Overall": "5.0", "Content": "It was the best phone I had until I got an upgrade. It was like fine art and worked very well. Wish I still had it.", "Date": "March 7, 2012"}, {"Title": "The right cell phone for the T-mobile customer!", "Author": "Leo06jun", "ReviewID": "RJTT485ZX4752", "Overall": "5.0", "Content": "This cell phone is great. I use it to connect to the internet on the go and I can get connected anywhere I am. Also, I can use it with my mini laptop and it works wherever I am. This is very nice when you go to hotels that do not offer free wifi. The GPS works great. The signal is better than my prior E63 and my friends say they can hear me very well. Overall, this cell phone has the whole package for those who need a simple device to operate but with lots of functions to use. I even installed WHATSSAP and can chat with friends and family in other countries at no charge! It has been working very well, so if you have T-mobile, this is the one to choose if you need a smart phone soon and your next upgrade if far away form now, but even if is not, buy it just because you can use it to connect to the internet at any computer if you have unlimited internet for phones, and it comes with the cable!", "Date": "September 23, 2011"}, {"Title": "Just out of warranty phone borke", "Author": "brudgers", "ReviewID": "RQWNSN53NSL5O", "Overall": "2.0", "Content": "I purchased a Nokia because of their reputation for quality. Overall, the E71 operated well and allowed me flexibility when selecting carriers.Unfortunately, less than 90 days out of warranty, the handset function of the phone ceased working and I can only communicate using speakerphone - which not only irritates my wife, but makes the phone unusable in most settings.Reading the Nokia forums, this is not an uncommon mode of failure for the E71 as there are several threads where people have similar problems. Overall, I would not recommend it because it does not meet my expectations for reliability.", "Date": "July 25, 2011"}, {"Title": "Nice phone", "Author": "Martano", "ReviewID": "R1DF8BA5L15I5Y", "Overall": "4.0", "Content": "It's a good phone.I bought it for my wife to replace and old E62I could just upgrade your operating system using a PC.As a Mac user I can sync contacts and calendars with iSync without any problems via BluetoothSometimes the Nokia's own calendar, duplicate events with different dates. I think it is a software problemI could never prove the characteristics of the GPS because it takes too long to take satellites.For the rest, everything is more than good.", "Date": "March 25, 2011"}, {"Title": "Good", "Author": "T.Henry", "ReviewID": "R2EQNB7EAL2LJS", "Overall": "4.0", "Content": "since i have received the phone i have enjoyed using it and the fact that it is a nokia  makes it even better... the shortcut and features are great... there are few times when the phone freezes but only if you use many applications at once", "Date": "March 5, 2011"}, {"Title": "Nokia a di best phone brand", "Author": "Toby", "ReviewID": "R2MKRL7KJLDVKK", "Overall": "5.0", "Content": "I like this product very much and I also liked the service that was offered by Amazon.  The phone is the ideal product for business persons and other professionals.", "Date": "January 23, 2011"}, {"Title": "The best phone", "Author": "bestpcgamesell", "ReviewID": "R2GQ1UE0SOMPBG", "Overall": "5.0", "Content": "This is an amazing phone.Best thing about it is being unlocked ,can be used With A&tt; or Tmobile or any simcard from any other country.i like the wriless feature i simply connect it to my home wriless or any other free wriless outside like starbucks.Easy to use and very good design.i would recomend buying although i bought mine on Amazon.com christmas time for only $179 now it is back to its orginal price:)", "Date": "January 17, 2011"}, {"Title": "great phone", "Author": "David, now in Texas \"David\"", "ReviewID": "R37FKF1BTDJJEN", "Overall": "4.0", "Content": "First of all, if you want to read reviews on this phone, look at the grey keyboard model, which has many more reviews. Other than the color of the keyboard, they're the same.I bought this phone as a replacement for my iPhone. I wanted a phone more suitable for business. I'm very pleased with it; it's a better phone than the iPhone. My iPhone is a better multimedia device, but that's not why I carry a phone.Pros: Build quality is excellent. All E71 models are made in Finland, to my knowledge. It's ultra-thin and the steel is beautiful. Battery life is exceptional, a great improvement over the daily-recharge requirements of the iPhone. I have apps that do everything (and more) that my iPhone does. It's far sleeker and better looking than a Blackberry. Call quality is the best I've ever had on a mobile phone. The keyboard is rock-solid and I can type much faster and easier than I did on my iPhone, which is the reason I changed in the first place.Cons: If you're used to a touch screen, then going to a QWERTY phone will take some getting used to. As I mentioned, the sound quality of music isn't as good as my iPhone. Obviously, the screen is smaller, but it's very bright.Overall, I'm pleased with my choice. I live in Brasil, and the phone took my SIM chip and started working from the time I turned it on. As I mentioned above, look for more reviews for the model with a grey keyboard, but the white one is better looking.", "Date": "November 26, 2010"}, {"Title": "great cell phone, complex configuration", "Author": "jane", "ReviewID": "R2JF7FWP8Y3IAX", "Overall": "4.0", "Content": "I bought it for myself. I am really glad to have it. The only thing that it has not got an usual nokia user-friend configuration (pretty complex), but easy to use to be.Overall great device..", "Date": "November 8, 2010"}, {"Title": "Review of Nokia E71", "Author": "Phil", "ReviewID": "R3WTPALC3LRVL", "Overall": "4.0", "Content": "This is a great smart phone.  It has the usual features of other smart phones (connection to the internet, voice over internet, dictionary, barcode reader, to name a few), but with one additional feature: free GPS (and I do mean free).  Nokia provides free maps of the entire world and voice guidance in over 100 languages and it is all free.  Once the maps are loaded on the phone (this can also be done free) there are no usage charges, no need to connect to a service, etc.  The phone came unlocked so I just slipped in my SIM card (some phone services like Sprint will not work) and off I went.  The phone interfaces seamlessly with both the MAC (see limitation below) and a Windows based PC.  The keyboard is easy to use.  I have used the built-in, trimmed down version of Microsoft Office suite (Word, Excel, and Powerpoint) and the Adobe Reader and they all work well.  The phone has the capability to interface to a bluetooth keyboard and printer as well as other bluetooth devices, but I haven't had a chance to try those yet.  There are many more features that I don't use, but they are there if I need them.The only reason this phone doesn't get 5 stars is because of Nokia's support.  When I received the phone it did not have the latest firmware installed or the latest map guidance system.  Nokia support was no help at all and after three solid days of trying to get help to fix my problem I came close to returning the phone.  Here is what happened.  I was unable to get the critical piece of Nokia software that would allow me to update the firmware to work on the MAC.  All their other MAC software that syncs data (calendar, contact list, iTunes, bookmarks, photos, videos, etc.) worked great, but not this one.  Next after trying unsuccessfully to use this critical piece of software on two versions of Windows (XP and VISTA) I was finally able to load the Nokia software on a Windows 7 operating system that allowed me to update my phone to the current version.  Using this computer I then downloaded the maps of the US but I will still need to use the PC software if I want to download maps of more countries.If you buy this phone you should also purchase a high speed 8gb microSD card with adaptor.  Otherwise you won't be able to store anything.Now that everything is woking well (no thanks to Nokia support) I am very happy with this phone and all its features - Nokia does have good technology.  This is my first GPS system and I have already been on a trip and it is fantastic.  It not only guided me flawlessly to my destination but showed me the local restaurants, shops, gas stations - you name it.  It also guided me on a hike in a very large arboretum and it even knew the names of the trails I was on.", "Date": "November 7, 2010"}, {"Title": "Love this phone", "Author": "M. Hill", "ReviewID": "R1IYSBMX0Y89FR", "Overall": "5.0", "Content": "I dont do to many reviews but i love this phone so i figured i would. For me this phone does everything i need. Fast downloads on either 3g or edge network. Range with the wifi is unreal. This thing picks up wifi ALOT farther than my laptop or my ipod touch. It really surprised me. Its nice to because you can choose if you want to use at&t; or wifi connection before you access the web. Build quality is very good. Its got some weight to it, not to much but enough that it feels very well built. I've had this phone about a month now and i have not one complaint. I always liked Nokia phones, they get great reception and are built well and this phone is no exception. In a world of crap phones from LG, Samsung and Motorola, i'm really glad I got the Nokia.", "Date": "August 21, 2010"}, {"Title": "muy bueno", "Author": "Anabel Camacho", "ReviewID": "R2HBIEKILE9PJ6", "Overall": "5.0", "Content": "excelente producto, la camara es muy buena, el gps es muy facil de usar, muy manejable con una mano la conexion a la red es rapida se puede hacer practicam,ente de todo es un mini pc.", "Date": "August 17, 2010"}, {"Title": "Full featured GSM phone for the professional", "Author": "Ish Singh", "ReviewID": "R2YUQ16M9X3QG8", "Overall": "5.0", "Content": "This phone came with the applications and details that would support the life of a professional/businessman on the go. If you are looking for your typical cheesy MP3-boombox-10 megapixel camera-SMS/MMS messenger mobile phone for your teenage kid then this is not it. This mobile phone however is ideally built to suit the lifestyle of a working individual and to support the lifestyle of the individual on the go and has most of its applications and features to compliment that lifestyle every meeting/schedule.Mind you it isn't a typical RIM-BB replacement but it sure does pack the punch to make it the next best thing to it which is what probably Nokia was aiming to achieve during its design and concept stage. From the touch and feel it is a very lightweight phone with a full featured keyboard for e-mail correspondences (texting is allowed too) and a touch sensitive scroll button which moves you across its various menus and apps. It is comes with a fair amount of onboard memory but this can be upgraded to suit your taste just in case you may be carrying some extra baggage.All in all a great buy for the busy lifestyle and professional out there.", "Date": "July 25, 2010"}, {"Title": "couple additional stuff you should know", "Author": "Zafer Aktan", "ReviewID": "R1STN2Q11SPQEX", "Overall": "5.0", "Content": "Ok, the pictures that E71 takes are not that super - but videos are not bad - so you guys know ;)There are couple of nice things you can do:1. you can use it as a hot-spot by using Joikuspot software (free version available - paid version is not too expensive and has added capabilities)2. you can do Fring to Fring client video calls with E71 (too bad Fring to Skype was available until last week)3. there is a native skype client available (voice only - no video)4. you can use Jbak TaskMan as task manager (free)5. you can use SkyFire browser (for Adobe Flash sites)6. you can use (now free) Nokia Maps for E71 (PC suite is required to update) with voice turn by turn7. you can use Mobbler for lastfm client (nice to listen online music) - free8. you can use internet radio (from Nokia) to listen online music as well (live streams) - freeOther quick notes:* if you buy the white one, the plastic covers on the usb and microsd card slots gets dirty over time and stays dirty (even if you try to clean it). It maybe a reason to purchase the gray one :)* PDair and Beyza Cases have nice leather cases for E71CheersZaf", "Date": "July 21, 2010"}, {"Title": "Great WI FI Cell Phone", "Author": "Shell", "ReviewID": "R28HIWVHF77B5D", "Overall": "5.0", "Content": "The nokia E71 is a good WI FI cell phone. I bought this phone and i didn't regret buying it. I would recommend anybody to buy a nokia E71. I love my cell phone.", "Date": "July 14, 2010"}, {"Title": "great phone", "Author": "J. Lee \"P. of Plpc\"", "ReviewID": "R1KLCHXK2GI9QB", "Overall": "5.0", "Content": "Nice phone. High quality with stainless steel finish. Has ovi maps which is a life saver if you have no data plan. It works offline !! Would recommend this phone if you are on a budget !! Its the best phone you can get for $199.", "Date": "July 11, 2010"}, {"Title": "a Swiss Army like device", "Author": "Shop Smart", "ReviewID": "R1V7AAE8DQOOVE", "Overall": "5.0", "Content": "I have lived with this marvelous little device since April and I am truly impressed by it.  The feature I like the most about my E71: it allows me to untangle my data from the ATT metered plan via WiFi. While sitting in a restaurant I am able to pickup WiFi to go online while a friend with a Verizon BB Storm2 can't.Everything works - albeit a bit slower compare with those uber smart touch screen phones.  GPS, Camera, streaming video, RSS news feeds and podcasts all work flawless, plus free office productivity tools and PDF reader. Another advantage with the smaller screen: without the large screen the battery life is great, depending on usage it will last 1-3 days between charges.Similar to a well designed Swiss army knife this is a handy little tool that does everything well within its specifications.  It is a also a great bargain - I highly recommend it to anyone who does not need a full sized phone.PS I have the white version of this phone - it looks great with the backlit keypads and polished aluminum back plate. No smudges nor discoloration of the keyboard thus far with daily usage.", "Date": "June 19, 2010"}, {"Title": "Great phone, great price", "Author": "N. Breuer", "ReviewID": "R1PWOSMY16O6P6", "Overall": "5.0", "Content": "I have been wanting to purchase an unlocked smartphone for sometime now and could not pass up this deal when I saw this phone for $199.  So far I am very happy with the performance of this phone.  It does so much, I'm still learning many of the features.  I mainly use the WiFi function to access the internet, as I do not have a data plan setup with T-Mobile.  It seems to be working great, always asking me which \"access point\" to use before connecting.  Like others have said, the camera is not great, but much much better than cameras I have had on any other phones.  I only wish that there were more apps, especially free apps similar to the Apple App Store, available for the Symbian OS, but otherwise great phone for a great price!", "Date": "June 16, 2010"}, {"Title": "Really cool item!", "Author": "dijo", "ReviewID": "R2YR46OLJN95LE", "Overall": "4.0", "Content": "I bought this item a month ago and I'm loving it!It is beautiful and sleek, the keys are soft and elegant. Easy to use. I am on prepaid plan, so it's cool to be able to browse the internet via free wifi, get into my mailbox and I can download skype to call for free to someone online or chat. Connection is pretty good. I love it.", "Date": "June 4, 2010"}, {"Title": "Very satisfied", "Author": "Gaby Dines \"Gaby Dines\"", "ReviewID": "RPPWHU3IOA5YN", "Overall": "5.0", "Content": "There's not much more to add... I just want to thank all the thorough reviews that helped me decide for this great piece of equipment!!It is simply the best cell I've ever had :-)", "Date": "June 1, 2010"}, {"Title": "Very Long Talk Time", "Author": "R. FOZ \"R.M.\"", "ReviewID": "R1QFBB6TB1R6PF", "Overall": "5.0", "Content": "I lost my Nokia E63 so I purchase this Nokia E71 w/c are great phone.It's not atouch phone but very useful and simple to use.I can organize everything from musicto documents. What I love here is the talk time...Very long talk time so I am notafraid of battery problems.The size is just right to drop it in my front shirtpocket and you can even use voice to connect you for calling someone.I love this.", "Date": "May 18, 2010"}, {"Title": "Great phone", "Author": "abee323", "ReviewID": "R6OHHRT2EJ6X0", "Overall": "5.0", "Content": "Very reliable. Very user friendly , you can download skyfire and watch video with flash. The middle button works like a mouse and the ovi maps work great.It comes in handy when you are somewhere and you don't have a gps. It will give you a sense of security. There is nothing on the market that has that much function and still made out of stainless steel and its super thin. Only bad thing is that it doesn't have touchscreen, but oh well for what it is its a great phone. I recommend this phone.", "Date": "May 18, 2010"}, {"Title": "Over 1,000 people can't be wrong.", "Author": "M. Munjal \"M Munjal\"", "ReviewID": "R1MDMSRGCWFQ5T", "Overall": "4.0", "Content": "Starting things off, I am a 19yearold male from NJ, coming from previous phones of a Nokia 6101, RAZR1.2, Nokia N95, and now this flashy, new, white, E71.This review is for Nokia E71 Unlocked Phone with 3.2 MP Camera, 3G, Media Player, GPS and Free Vocie Navigation, Wi-Fi, and MicroSD Slot--U.S. Version with Warranty (White)Summary.CONS- True Multitasking: I have run over 25 apps concurrently.- PC Sync capable: the provided PC Suite is powerful and useful.- SLIM SLIM SLIM: Ridiculous, it feels less than the advertised 10mm depth (which is about half its competitors).- Call quality: This may be a network-dependent (I use T-MobileUSA), but this thing is clear and loud. Callers frequently thought I was on a landline, and the bluetooth connection (to a Samsung headset) was bulletproof it seemed, even from 30 feet away. I have never seen a device power bluetooth that far (at any good quality at least).- Fast: My N95 felt sluggish at time with all the things running, this phone has yet to slow down while running apps (with 25 at once, as mentioned above).- Fantastic keyboard: I always thought T9 was incredible, coming first-time to a QWERTY and could not be happier.- Sound design: Looks good, feels good, feels tough (it is made of stainless steel as well, thing feels quite solid).- Battery life: Coming from a N95 I am used to charging almost every night. This thing has lasted 4 days with heavy WiFi usage, camera usage, intensive texting.- GPS: I do not pay for a data plan, and the included GPS and the newly revised Nokia Maps 3.0 is great. I get FREE turn-by-turn directions with voice, all running off my handset, with no internet needed! It works reasonably well, possibly better in walking situations and POI lookups then driving (it can be slow at updating sometimes).- Software/Operating system: Symbian may not be popular in the US, but it is the most popular OS in EU and Asia (one of the most popular). Nokia rules the market segments there, and the OS has tons of applications (newly launched Ovi Store). It may be out of date and due for a refresh, but it just works.CONS- \"Outdated\" OS: It is not as flashy as iPhone or even newer Android devices. Does not have \"150,000\" apps either.- This model is business focused: Applications included do not go to media side (as seen in the music player).- Camera: This was the saddest fact for me. I am coming from the 5MP Zeiss lens on the N95, which took incredible photos (sometimes equal to an SLR in daytime, depending on the photographer's skills). I expected similar, but less detailed (3.2 MP verse 5MP) on this. Unfortunately, Nokia seems to have messed up, with photos being sometimes blurry, almost always with a purple tint, and generally not good. Night photos are barely usable, as the flash is too weak and cannot accentuate details enough.- White color: I personally like the white color now after using it, maybe recommend the all black E71x (from AT&T;, sometimes available unlocked), or the regular grey/black E71 (other color sold by Nokia, unlocked). This can be described as a \"pimp\" phone by some. Also picks up fingerprints easily, but what phone does not?CONCLUSIONBuy this if you need a reliable handset, that is used for heavy typing and web usage, and general \"business-y\" things, the E71 will not let you down. Its strengths lie in an OS that just works with little issues, problem-free WiFi, 3G, a GPS that actually works, and little need for charging. If you are looking for a multimedia handset, do not be swayed by the flash support (which is great), or the media player; look at the new Nokia X6 or Expressmusic phones or N series. If you buy this phone for the right reasons, you will not be disappointed, guaranteed.", "Date": "April 25, 2010"}, {"Title": "Beautiful Smart Phone", "Author": "hdtravel", "ReviewID": "R34BSS2VVZC625", "Overall": "5.0", "Content": "Nokia has a solid winner here. This phone is strikingly attractive in white and silver chrome. It looks gorgeous. Overall build is solid and outstanding.Wireless reception is solid with good signal strength and it holds on to the signal very good. Audio is crisp and clear and loud enough, but could be a bit louder ( like most phones it seems ).The keyboard is a bit cramped, but the keys feel good and solid. It is entirely usable.Unfortunately it does NOT use a standard 3.5mm headphone jack, but you do get some acceptable headphones with the phone or you can buy an adapter to use your standard headphones.WiFi is solid, just download Skype and make FREE phone calls without using any cellular minutes. Nice !Totally unlocked. Use it with ANY GSM carrier worldwide. Sweet ! No contracts required, no fuss, no muss, no crying.This definitely is one of the BEST Nokia phones that Nokia has made. Don't get me wrong it is not an iPhone, but if you want an attractive, solid, smart phone with good reception and nice features and a real physical keyboard this baby is it.You will not be disappointed. Highly recommended !", "Date": "April 10, 2010"}, {"Title": "Very pleased with this buy", "Author": "K. Desai", "ReviewID": "REHD444V2ZN3Q", "Overall": "4.0", "Content": "I recently bought my E71 and it came promptly in great condition! I find the keys are quite close together but this I find is the only downfall. The keyboard is convenient for texting and even if you dont have a data package connecting to a open wireless network is made easy with this phone. I have not downloaded any applications yet. The battery life is excellent and volume is also good. I bought a 4GB memory card and in the process of downloading songs to the phone. The media player is configured well and very user friendly.Do not buy this phone for the camera, it is only 3.2MP!", "Date": "December 23, 2009"}, {"Title": "Good phone", "Author": "Helga Patricia Vieira", "ReviewID": "R3OJ4C6FS2KY8P", "Overall": "4.0", "Content": "Good phone, you can do a lot of things with it. Not for everyone though, as some people (like me a few years ago) can feel overwhelmed by all the features. Take time to read the manual, and don't be afraid to look under 'help' in most topics on the phone. Once you get the hang of it you won't want another phone!", "Date": "August 14, 2009"}, {"Title": "Best Cellular Reception!!!", "Author": "HB 207_HB 378", "ReviewID": "R137C3GJRYSEZ9", "Overall": "4.0", "Content": "Pros: 1. This phone had by far the best cellular reception of any phone I have ever owned, and that includes any other phone on any cellular carrier!!! 2. Great speakerphone.Cons: 1. Keyboard is very cramped, becomes difficult to type especially if you have larger hands! 2. Screen is also small and therefore need to scroll constantly. 3. In need of support for various video files", "Date": "July 13, 2009"}, {"Title": "Best. Phone. Ever.", "Author": "Winsome", "ReviewID": "R3GKDTF3XDKF2Q", "Overall": "5.0", "Content": "I'll keep this short as there are hundreds of existing reviews of the Nokia E71. I needed a sleek upgrade to my Nokia 6682 and decided against the AT&T; Wireless-branded (read: neutered) Nokia E71x. The unlocked Nokia E71 provides everything I need and want from a phone while still retaining its identity very stylishly as a PHONE. Given that I've only ever owned Nokia phones, and they have all proven their longevity (had the 8260 for > 4 years and the 6682 for > 3 years), I trust that I will enjoy many, many years of usage out of my Nokia E71.Plus, this is the thinnest smartphone I've ever seen!", "Date": "June 12, 2009"}, {"Title": "great qwerty smartphone with a lot of extras", "Author": "E. Hu", "ReviewID": "R34IN5HHN7PI9E", "Overall": "4.0", "Content": "After my iPhone was stolen, I opted not to spend $500 on a new one since next generation models will probably be released in the next 2 months. So I looked at other options to tie me over until I figured out what I wanted to do next. And a new toy is always nice as well.The E71 fit pretty much everything I was looking for: email support, qwerty keyboard (the iPhone keyboard is a bit tough to use quickly), 3G connection, GPS, expandable media for music and images, camera--all the main things I was using my iPhone for. The expandable micro SD was a big plus, since I was at the point where I was trying to figure out what was coming off my iPhone to make room for other stuff. The four dedicated keys to email, contacts and calendars are awesome--things that I predominantly need a smartphone for. The size is great--about the size of an iPhone strangely--and just looks so slim. The steel frame is worth it for the high end look to the phone even at the expense of some fingerprints. Nokia did a great job with the design of this product. What really caught my eye was the white version. Most smartphones are geared towards men and so colors are chosen accordingly. I was happy to have a more feminine choice. Also having lived abroad, I was ecstatic to finally have a place to put my girly accessories (which are not as popular in the States) to jazz up/personalize my phone.On the flip side, I do wish there were more free apps for the Nokia. After being spoiled by the sheer number of apps that cater to every whim on the iPhone, I'm finding life with Nokia apps a bit boring. I understand that Nokia Ovi acquired Widsets, so I assume there's more apps/widgets on the way, but haven't been able to find any information on what the plans are for that. The included email client doesn't do a great job of mimicking email accounts when it's not automatically retrieving mail, which you can only do for 2 accounts. Every additional email account needs to be manually retrieved. I'm trying some of the push applications that are available and the jury is still out for me on those. Also the number of steps that one has to go through to delete emails, mark emails, add recipients to emails, get to applications that are installed on the phone, etc. is a bit annoying.All in all though, I think this is a great buy and a strong contender in the more business-oriented smartphone that has entertainment add-ons. Personally, I'm looking forward to exploring the camera, music, IM and other entertainment aspects of the phone in the coming weeks.", "Date": "May 2, 2009"}, {"Title": "Outstanding Device", "Author": "J. White", "ReviewID": "R39WQ0NR1EWEX0", "Overall": "5.0", "Content": "I migrated from a Palm Treo 650 to the Nokia e71.  I have found it to be an outstanding device and Amazon has the lowest price on the web.  I utilize my device more for reading books and roaming the net.  Built-in WiFi is great!  It finds the hotspots for you.  It handles ebooks from ereader.com and renders all fantastically.  You'll be surprised at the speed of the browser.  GPS is also included and works w/o the network.  It will take you the better part of a month to learn all the operations but it's well worth the time.  Plus, it has a good, steady feel when you hold it.  Recharge time is minimal.  Video rendering is superb.", "Date": "December 16, 2008"}, {"Title": "e63 is better", "Author": "Amazon Customer", "ReviewID": "RPBF6UAY04018", "Overall": "3.0", "Content": "This phone looks nice and at the time the white one was the only one available. I felt like the keys would get dirty over time and end up looking dingy.The phone is very similar to the e63 but there were somethings that I missed and figured it would have since it was supposed to be an upgraded version. It didn't have a flashlight, no 3.5 mm head jack, and the sleep mode didn't have the option to have the bigger time and missed call/text icons like the e63 did.  The camera is 3.2 mega pixel but the pictures didn't seem that much better.  They actually seemed darker than the 2.0 megapixel camera on the e63. Another thing I thought was strange was that it didn't come with the MicroSD card like the e63 did.The 3.5 mm head jack isn't too much of a problem as you can always buy a connector for really cheap but its still a hassle and doesn't make any sense to not have.The phone quality was great of course and the battery life was great. Nokia never goes wrong in those areas.I took it back and decided to get another e63.", "Date": "November 10, 2010"}, {"Title": "Great phone, some things too complicated", "Author": "Hitesh Patel", "ReviewID": "R24BLZPQ5EAXJ6", "Overall": "4.0", "Content": "I bought this as a gift for my brother in law in India. I used the phone for a couple of weeks here, in order to get some apps and stuff on it, as this would be difficult to do in India. The phone is not bad at all, though the tiny buttons are not for me.The only complaint I had was that I could not find a way to set it so that the Ovistore app would only connect through Wi-Fi and not through the ATT connection. I do not have a data plan and did not want to be hit with huge charges. Thus I took off one star.I was able to get the Wi-Fi connection up and running but just could not set it to be the default. Weeks after the phone had already been delivered, I found a site that mentioned this problem and the fix was to use a script to make the phone always use the Wi-Fi connection if available.While its not a problem to do this, and the geek factor of it is appealing to some, I've been spoiled by the simple and efficient and easy to use interface of my iphone.", "Date": "January 11, 2010"}, {"Title": "Excellent", "Author": "Juan M.", "ReviewID": "RXLP7L63MWH79", "Overall": "5.0", "Content": "I found it an excellent article 100% functional and very satisfied, very good vendendeor, everything went as expected, thank you best regards from Venezuela.", "Date": "February 23, 2014"}, {"Title": "the best nokia phone ever", "Author": "chelinh", "ReviewID": "R3TKC6BJT2JBTL", "Overall": "5.0", "Content": "This is by far the best cell phone out there.  Sure it's not user friendly, but once you get use to you, you will love it.The quality is top notch.", "Date": "August 6, 2013"}, {"Title": "Really good back up phone", "Author": "Amon", "ReviewID": "R3BPU62EB88DDQ", "Overall": "5.0", "Content": "This is Nokia Best phone, that they ever made. It is unfortunate that they dropped Symbian as a OS. This phone has excellent battery life and is super fast. I think in the future this will be a collectors item.", "Date": "July 20, 2013"}, {"Title": "Nokia E71", "Author": "Tamarald Haynes", "ReviewID": "R3A2WF00YI2UJC", "Overall": "5.0", "Content": "I love this phone and of today I still have it in my possession. I would have recommended this phone to family and friends and people such as my uncle wanted to buy it from me but I just can't get rid of this phone like this.", "Date": "July 11, 2013"}, {"Title": "exelente", "Author": "JOSE LUIS PAZ \"J.L.P.S\"", "ReviewID": "R12N7Q411DOVEZ", "Overall": "5.0", "Content": "buen vendedor lo recomiendo, estoy 100% satisfecho con mi articulo el articulo es como el descrito por el vendedor gracias", "Date": "February 13, 2013"}, {"Title": ".", "Author": "EDGAR ALEXANDER CENTENO \"PISTOLITA RANGER\"", "ReviewID": "RY8BFEZCIJODI", "Overall": "5.0", "Content": "excelente producto de calidad  recomendando como lo estaba buscando  excelente servicio de envio a miami y recibido a tiempo estimado", "Date": "December 26, 2012"}, {"Title": "Great phone", "Author": "JanPVan", "ReviewID": "RAF11F7O5BRU9", "Overall": "5.0", "Content": "This is an excellent phone.  I got mine through StraightTalk, and am exceedingly happy with it.  Call quality - excellent.  The only complaint I have is that the screen is small, especially compared to all the newer android-type phones, so game-playing is a tad difficult.  This phone has everything you could ever need on a phone, and then some!  It is a quality device, and looks and feels like quality.", "Date": "February 28, 2012"}, {"Title": "Please help!", "Author": "kodi713", "ReviewID": "R2EKIZGSPIYRR", "Overall": "5.0", "Content": "HI, I would really like to order this phone for use on AT&T; 3g network. I currently have no data plan AND DO NOT WANT ONE!!!!!!!!! I have read that this phone will not be recognized by AT&T; and thus they will not FORCE their ridculous data plan on you. Has anyone tried this? It is a lot of money to spend on a phone that I can't use if AT&T; forces the data plan on me I'll have to stop using it. Any feedback is appreciated.", "Date": "July 18, 2011"}, {"Title": "Excellent qwerty keyboard phone", "Author": "Navas", "ReviewID": "R16G8AIY1YDC1Q", "Overall": "5.0", "Content": "I am using this phone for more than an year now, i have not faced any issues with this phone so far. Battery is good, you can use it for one and half day continuously. Options are good and it is very user friendly to operate, only issue i am facing with this is like when ever you are confusing it (like pressing call button and cancel it and again pressing call button within fraction of seconds) the phone gets hanged for few seconds other than this i don't have any issue with this phone.", "Date": "July 12, 2011"}, {"Title": "Extra Charge on my Credit Card", "Author": "Bachir", "ReviewID": "RYQ5GN9U8HRZS", "Overall": "5.0", "Content": "HelloAlthough the total price charged as per the invoice on record was USD179.99 on 17 Dec 2010, on 18 Jan 2011 I was surprised to discover that Amazon charged me an extra USD79 for nothing I can see was ordered on my order history for the past 6 months. Why has Amazon charged me this extra amount? I intend to instruct my bank not to authorise this payment and dispute it with Amazon.I would appreciate your prompt recponse.RegardsBachir", "Date": "January 19, 2011"}, {"Title": "maybe the rating is high last two years ago when it was first released", "Author": "butterflyinrain", "ReviewID": "R2WL83MXBXVOPL", "Overall": "3.0", "Content": "the product is cute. tiny, very tiny im not satisfied with the looks of the screen. very good though it has all the nice app inside and you can download. you can connect to internet on your laptop from it. it has pdf reader that i love. internet radio that i love. it works pretty sweet. but maybe i just got used to on touched screen, wide screen. and it the screen does not satisfied me at all..it's a sexy phone over all. but can get other nokia on the same price that has wider screen and works the same. the keypad is too tiny that even i got tiny hand i always ended up clicking the wrong key and letters. i dont like on how it always ask me for my wifi password and it create bunch of wifi name, like wifi1, wifi2, or it even reached wifi10 whenever i try to connect.i it ended up on the same box. pretty much i wasted my time. cause now i need to return it and wait for my refund so i can order other phone.im going to try nokia c6.. but im getting impatient now that i need to ship it back and wait for my refund.so this is a cute phone. if you are not used to on the wide screen.im a big nokia fan though. i feel sad that i needed to give my 5800 to a friend. cause that phone is from philippines and it can by pass a lot of security features of every to go phone here in US. that i had a free unlimited line for 5 months...", "Date": "January 16, 2011"}, {"Title": "simontempler/review", "Author": "Nigel E Harper", "ReviewID": "R3M23C9GZ6CF6V", "Overall": "5.0", "Content": "I am enjoying my new E71 Nokia. Have always been a Nokia person. Features GREAT. Some folks thought it was aBlackBerry.  Ha Ha. Will recommend E71 to anyone. In fact one of my friends recently ordered one E63 because ofcolour.Kindest RegardsNigel.", "Date": "December 3, 2010"}, {"Title": "Locked/Unlocked?", "Author": "inkjet", "ReviewID": "R161Z7B8PJYE85", "Overall": "4.0", "Content": "Phone good. Thinking to get another same model. One issue: the phone was NOT unlocked. I bought it to take when travelling. Had to pay $30 to have it unlocked before a Brazilian SIM card would work. previously, with my Samsung, did not have this problem.", "Date": "November 27, 2010"}, {"Title": "Excellent", "Author": "Alex", "ReviewID": "RIN59JCZY8G14", "Overall": "5.0", "Content": "I am enjoying by this phone: reasonable prize, high quality, it is really excellent smartphone.", "Date": "October 18, 2010"}, {"Title": "Great Phone but......", "Author": "mds", "ReviewID": "R1G4HKOOYU8Y0B", "Overall": "4.0", "Content": "Overall this si a great cell phone. A few minor details are bothersome to me - perhaps not to others -1- The battery runs put rather fast2- If you are not familiar with the phone is hard to get to some \"cool\" features such as voice3- The turn off of the phone is hard to press downStill I am happy with it!", "Date": "September 25, 2010"}, {"Title": "my nokia e71", "Author": "katerina_ma", "ReviewID": "R2XNFDX8M9CTVC", "Overall": "5.0", "Content": "i am 25 years old from greece...i just got nokia e71... this is not my first smartphone .. i a very happy with it... has great applications. wifi works perfectly in greek networks so dont hesitate to buy it if you live outside US. the only disapointment was that amazon doesnt ship to greece. keyboard little small for those who have big hands.. overall great quallity authentic...", "Date": "September 25, 2010"}, {"Title": "NokiaE71", "Author": "nathan25x", "ReviewID": "R2EFHZSC7B9J7V", "Overall": "5.0", "Content": "This is my first Smart phone. I am very happy with it. It easy to use and has all the functionality i need, and more than i will ever use. I travel to the Philippines regularly and because it is Quad Band and Unlocked, i can use it easily there. i just buy a local SIM card, and i am in business cheaply. More and more, people are texting, so they full keyboard makes that very ez. For some minor questions (tho not minor to me at the time), i called Nokia Support a few times. Each time, they were ez to get a hold of and very helpful. Nokia really supports their products. I am also very happy with the Amazon price and buying experience. for a little over $200 bucks i have a great phone and i got it within 2 days with free shipping (some special offer at the time). If you want a good, reliable product, loaded with features, for a great price, i recommend the E71 bought thru Amazon without hesitation.", "Date": "September 18, 2010"}, {"Title": "Great Device", "Author": "Jorge S", "ReviewID": "R2QRWP06OH1C09", "Overall": "4.0", "Content": "The entire phone is great, everything is proportionate and sort of just works well together, did I mention this thing is thin? The E71 and it looks very sharp and easy on the eyes. Screen real estate isn't a problem at all, there's a decent amount of contrast when looking at media, and you'll especially appreciate the screen during some heavy web browsing. It seems louder than the E61 and it's pretty clear for ringtones and alert sounds. Music sounds fine on it, but it's not perfect. Bass is seriously lacking and you do get a \"tinny\" sort of sound. It is very, very loud, though, so you can be sure that alarm is going to get you out of bed in the morning. The messaging application had a little bit of a visual makeover, and it's for the better. Text is extremely readable and emails look good. If there is one negative to the E71 it's the keyboard, just a lot smaller. They're also not as squishy which is nice, and they're pretty easy to press once you get it down. Nokia and call quality go together like ham and burger. Kool-Aid and sugar, the E71 doesn't disappoint.", "Date": "August 29, 2010"}, {"Title": "Excellent !!", "Author": "Chrix", "ReviewID": "RE0QPSBO9UU6K", "Overall": "5.0", "Content": "The E71 is awesome..heavier ( which i like, I do not like just plastic) good sound and it was a very fast delivery.", "Date": "August 20, 2010"}, {"Title": "Good product and support", "Author": "Fernando Lessa", "ReviewID": "RQ7SF5HX8JA6C", "Overall": "5.0", "Content": "The product was delivered in time, in good conditions and exceeded expectations with the support delivered.Together with the cellphone there was a white case and the cell is very good.I strongly recommend this product.", "Date": "August 8, 2010"}, {"Title": "Great phone, my Nokia E71 (white)", "Author": "Vikki", "ReviewID": "R3EADGRCC0EQLT", "Overall": "5.0", "Content": "Great phone and I couldn't help loving it when it did arrived June 2010. Most interesting was the voice-guided SAT-Navigation on the phone which was most handy during our family vacation in Scotland and England. Even those who already had the gray E71 couldn't help but fall for it when they saw mine. lolNokia E71 Unlocked Camera Phone (White)Bought mine here in Amazon and got real value for my money - Kudos to Amazon.", "Date": "August 4, 2010"}, {"Title": "Excellent product", "Author": "P. Mesen Aguilar", "ReviewID": "R3K714Y5DJHPYA", "Overall": "5.0", "Content": "It's one of the best phones I've ever had.  I strongly recommend it if you want to have everything in just one place.", "Date": "July 28, 2010"}, {"Title": "Greatest Phone I've Ever Owned!", "Author": "Soulji \"destin_ford\"", "ReviewID": "R2RK7ZUKLH86OW", "Overall": "5.0", "Content": "Lets start with the cons. This phone is a fingerprint magnet and I can't find an app to use the front facing camera to do video conferencing, though Fring is supposedly working on it. If that's a deal breaker you should still get this phone.I got this phone to replace my old E62 and I am beyond pleased. The GPS works great and you can use offline(without a data plan). The keypad, though small, is tactile and allows for very fast typing. I love it. When I saw this phone in the stores, I thought the keypad was too small. I was wrong. Once you get used to it, and it'll take a sec, it's amazing. Also quite amazing is the track button. On my E62 my finger would start to hurt after repeated use, but on this phone the track button is contoured, ergonomic and smooth. I love it!Emails shoot out, and apps pop up, compared to my E62, the processor is lightening fast, though that's not saying much.Another feature which I found amazing, and which newer phones are bragging about is the ability to use the phone as a hotspot for my Nintedo DS or my Ipod. It works perfectly though you need an app for it.Also, using the Skyfire web browser, the phone handles Flash better than almost all current generation phones, especially the Iphone...wink, wink. You should also invest in the Handy line of products from epocware. They add alot of functionality especially Weather and ShellAnd last but not least the phone is beautiful. The chrome and white catch your eyes and you have to pick it up and marvel.I am very glad I got this phone, it is marvelous.", "Date": "July 11, 2010"}, {"Title": "Phone is good...", "Author": "Satish Pandey", "ReviewID": "R23K1DQ0YXY8R4", "Overall": "3.0", "Content": "No doubt phone is good and camera is perfect but E72 is far better than E71. Now i am planning to buy E72.", "Date": "June 27, 2010"}, {"Title": "great phone", "Author": "Sanjay Chowdhury \"sanjay\"", "ReviewID": "R16IIHRPJMJN7Q", "Overall": "5.0", "Content": "All has been well ever since I start to use it. good phone for the price, can be compared with any, even though I have not used all the features, I know it has many more, beyond my reach!!!No hesitation in recommending it to anyone.", "Date": "June 26, 2010"}, {"Title": "I love E71", "Author": "B.K.", "ReviewID": "RETCZUYOFSNCA", "Overall": "5.0", "Content": "I love how you can change the themes which many of my friends with blackberry envy. In addition, the ability to change the main menu to fit what I use most is definitely convenient. Although I do not use both modes of the phone, I can imagine that this can be very useful for those that wants to organize their personal life from the business usage. One of the things that I do not like about this phone is the fact that I cannot mass delete text messages. I have to delete it personally one by one. Otherwise, the phone continues to store texts. The camera is not that great with the flash. Overall, I am very satisfied with this phone especially with the applications that I can download. Regardless that this is not the newest model, this phone has bought my heart.", "Date": "June 15, 2010"}, {"Title": "Excellent product for an Excellent price", "Author": "George John Carcamo \"John Carcamo T\"", "ReviewID": "R21VVCC88SXLSJ", "Overall": "5.0", "Content": "I describe it as a more casual cellphone, it has style, and more serious design that the others teenagers cellphones. I will definitely recommended to purchase one of those ... Something that disapoint me a lil bit is the capacity of the camara  at night, because the pics looks not clearer as you wish; nevertheles, for the rest everything works awesome !!!Good price for a good product!!", "Date": "June 12, 2010"}, {"Title": "More Power in Texting", "Author": "S. Heak \"yang\"", "ReviewID": "R3LB3OVCV8SGVD", "Overall": "5.0", "Content": "I've used too many phone before including touchscreen or whatever brands, but since I started to use nokia e71 I feel it's a powerful phone in texting and surfing the web. I love it and recommend to all who spend the rest of the day texting to friends and family.", "Date": "June 9, 2010"}, {"Title": "still trying/learning to set up phone", "Author": "JAR", "ReviewID": "R7V2UE57283T2", "Overall": "3.0", "Content": "I'm still trying to figure out how to work with this phone. Maybe once it's set up I will give it a higher rating.I can make calls and use multimedia messsaging only. AT&T; has been somewhat helpful but I constantly get -- since you didn't buy the phone from AT&T; we can't help. I don't understand why they won't be more helpful. After all I still pay the monthly fees for the service. My biggest concern is I get SIM services not available (AT&T; could not explain what that means) and an error message when I open maps. I thought OVI GP is suppose to be free using nokia browsing service -- the description says Ovi Maps works offline--no cellular service is required. Then it says ... Data charges from network operators may apply -- what does this mean?It would be helpful to customers if amazon could establish a liaison with the carrier when unlocked phones are sold thru Amazon.", "Date": "May 25, 2010"}, {"Title": "Nice phone", "Author": "Felipe Quezada", "ReviewID": "R2ZB03LUEZX9EA", "Overall": "5.0", "Content": "I'm really happy with this phone, it has all the functions that I need for my business and also the multimedia functions are great to have some fun when I'm out of the office.  The only disadvantage is the power key, it looks cheap but it's a minor disadvantage.", "Date": "May 18, 2010"}, {"Title": "Blown Away", "Author": "Stephen D. Feist \"tailu66\"", "ReviewID": "R2UX5P4PH9ESFN", "Overall": "5.0", "Content": "I just begun to use all this phone can do.I can see why people can get hooked on a smart phone and this phone is so well built.So far I have; Internet, music files, email, appointment scheduler, good quality call tone with T-Mobil (No Contract)@ $55 a month, thats 500 minutes and unlimited data. GPS& Maps, video, games, wifi and more.I was able to sync my albums with windows media player, installing them into my music files, now I have the Grateful Dead playing Lost Sailor for my ring tone.Totally satisfied here.", "Date": "May 3, 2010"}, {"Title": "nokia e71", "Author": "Alex S. Avalos \"Computer Ace\"", "ReviewID": "R30HB9YHD82ZMF", "Overall": "5.0", "Content": "OMG! i love this phone this would be my second of this exact item, the first being that a friend had seen this in use by myself and purchased it from me immediately, so i did the next best thing is to order the exact one online for a much cheaper price, its is very easy to use packed with plenty of features highly customizable.", "Date": "April 28, 2010"}, {"Title": "Superb phone", "Author": "Uche Akunwafor", "ReviewID": "R4YC5TF6VGJGW", "Overall": "5.0", "Content": "Enough people have discussed the merits of this phone without my having to say anymore. It is an amazing phone, much better, and sexier, than the Blackberry phones.Just one thing, to fully unlock the phone's potential, I suggest you get a 4GB or 8GB micro SDHC card. This will allow you to store as many Symbian apps as you  want. I have an 8GB card.I also have the N79 which is absolutely amazing as well and I am saving up for the N97...See a pattern here? :)", "Date": "July 24, 2009"}, {"Title": "Nokia E71: I love this device", "Author": "DAVID OKEEFE", "ReviewID": "RJHMQ7I0LB47Z", "Overall": "5.0", "Content": "Others have already highlighted the many things to love about this phone. Coming to it as a smartphone skeptic, I have fallen head over heels for it.First, it is a very good phone: easy to use, great call quality and speaker volume.Second, and better still, it's a great little computer. I use it more as a wi-fi networked computer than as a phone. Gmail, Google Maps, Opera browser, Fring for Skype and IM, Youtube, Putty, etc. GPS is useful and fun. Often, I leave my laptop at the office and just use the E71 at home.We've even used it at the office as a backup modem when our DSL went down. It was absolutely simple to setup and delivers excellent 3G connectivity. With an unlimited data plan, a single person could use this device instead of a broadband plan for home.Finally, it's very well made, nice looking and inexpensive. I've always liked Nokia phones. I love the E71.", "Date": "July 11, 2009"}, {"Title": "The best", "Author": "R. Owen", "ReviewID": "R12JOD6XNZZRJ4", "Overall": "5.0", "Content": "Best phone I have ever owned period.This phone has it all and everyone will ask you where you got it.Very easy to set up on AT&T;, it finds everything from your Sim card and sets itself up practically.If you want a quality phone buy it you want be disappointed.Cons; None", "Date": "May 29, 2009"}, {"Title": "Great Phone", "Author": "David Gaeddert", "ReviewID": "R335FW7T6YT8XJ", "Overall": "4.0", "Content": "Awesome Phone...I looked at getting this phone versus several different blackberrys. After doing some research I realized that one bad thing about the blackberry is the fact that theres alot of apps that cant be installed on the Blackberry that I wanted. I was rather surprised how many apps work with the Symbian S60 V3 (The OS of this phone). This phone in alot of ways is similiar to the BlackBerry similiar look, Full Keyboard and One of the best things is the Browser. I honestly like the Factory installed browser over alot of popular browers like Opera...With the Browser it runs full web pages which you scroll from side to side to view (Im assuming its done this way since if it showed a full page on the screen everything would be tiny)..Also this phone has fully functional YouTube Support anyone running a Data Plan on this phone I think will be Pleased.... The ONLY thing I truley hate about this phone is the keyboard. Yea its got a full keyboard but the keys are TINY and rather hard to text on...I wish the phone would have been alil wider to make the keys bigger. Other then that Great phone and the thickness of this phone is great I was using a Tilt previously so literally about 1/3 the size.Great Phone Great all around software Setup looks neat and also very well Constructed a large portion of the phone is metal you could probably drop this thing in the shower and it would prob keep on going.", "Date": "May 22, 2009"}, {"Title": "Nokia E71", "Author": "Rajan Kapur", "ReviewID": "R2NAWQABWWVHPQ", "Overall": "4.0", "Content": "Nice sleek phone...keyboard allows for one hand typing, easy to navigate through the menu options.  Definitely recommend it.", "Date": "May 4, 2009"}, {"Title": "Overkill for where I live, great phone", "Author": "Los rightHand \"Joystick :)\"", "ReviewID": "R3MDI7T3QYWHGN", "Overall": "4.0", "Content": "Being that this is my first 'smart phone', I was pleased. But had only a few gripes (see below). Anyway, the phone is stylish, with a leather case, sweet. It has almost every connectivity to networks under the sun, GSM, WiFi, Bluetooth, etc.Keyboard is nice, especially if you don't like clicking keys for the right character. Coupled with an 8 gig mem card, holds all my ring tones and mp3s and pics. Email is right there, messaging is right there. I was not a 'phoneaphile', but Nokia has won me over. I was looking at Blackberries like everyone else, but I wanted to be different. I believe I made a good choice.As for OVERKILL, I live in an area that recently got GSM capability (imagine that). This phone has a lot to offer if your service provider can supply the service.Only gripes, the stylish small size makes type a chore even if it is easier than regular keypad. Last, battery life. Solution, plug it in every now and then. You'll be set.", "Date": "April 1, 2009"}, {"Title": "i love this phone.", "Author": "David G. Greene Jr.", "ReviewID": "R3LXRTEWXWGDVD", "Overall": "5.0", "Content": "this phone is awesome. i can get on the INTERNET anywhere (riding down the street,library,in stores) and watch  the news ,you-tube web pgs. send email, download mp3 ring-tones, books, videos. this phone has my husband excited. he stay up late just discover all the new things about his phone. blue tooth is wonderful,but it eats the batteries up..", "Date": "March 28, 2009"}, {"Title": "Wow", "Author": "Ming C. Fang", "ReviewID": "R1S6J6MLDCS45V", "Overall": "5.0", "Content": "Yes, this is definitely and excellent piece of all-in-one smart phone.  With everything I need that includes almost all the basic features in this phone by not over complicated the interface.  I so happy to get this phone and I'm still do because it is compact, good battery life, ease of use, user friendly.There is always room for improvement...... :)", "Date": "January 6, 2009"}, {"Title": "I love this phone!", "Author": "A. Johnson", "ReviewID": "R2QOOVUI3O1XK9", "Overall": "5.0", "Content": "I am so happy i got this phone! i had an iphone and hated how restricted it was, i couldn't bluetooth to my computer from the phone, the camera was bad, no mms etc i was tired of itI got this phone and i am so happy! build quality is excellent and its much faster than my nokia N95 , it has wifi, agps, bluetooth, tons of media options,If you have a mac look for nokia multimedia sync, it will allow you to browse the phone and drag/drop files too and from the phone. I also bought a slim skin for the phone, as it is a bit slick to hold on too", "Date": "December 27, 2008"}, {"Title": "Not easy to use and terrible for receiving reception", "Author": "Pepper", "ReviewID": "RZQ85RN623C0P", "Overall": "2.0", "Content": "I bought this thinking it was a very intuitive phone to use- and getting my gmail was easy. Maybe I am a simple person. However far as hitting button to call someone, having to push numerous buttons multiply times to simply call someone or navigate- this thing is painful.  It also seems like pushing buttons sometimes doesn't work- ie you go to lock it but it doesnt lock. Or the keys are locked and when someone calls it unlocks the keyboard showing various keys but then locks up immediately. Very strange. The on/off again if you don't hold it long enough (which is long) it starts going through other functions or you have to use mulitple keys to get it to turn off. Finally, the reception on the phone is terrible. I would have thought it was my carrier, but I have had two previous types of phones that didn't have half the reception problems this one does. I wouldn't recommend this phone to anyone for the price.", "Date": "July 24, 2009"}, {"Title": "Makes iphone look like kid's play toy", "Author": "A. Park", "ReviewID": "R3RAYMVCY1OMNX", "Overall": "5.0", "Content": "first, get the white, much nicer looking than the run of the mill crapberry-looking grey and black versions.  The keyboard is perfect for this size.  The screen is more than adequate considering you have a choice of excellent third party browsers, unlike iphone, that allow navigating, via zooming in and out, efficient.  If you think the small screen and lack of touch screen hampers this phone, I challenge any iphone user to do even half the things I can do with this phone in the same time.  The directional pad and shortcut keys and the shape of the keys are so well designed, I wrote this lengthy review on the e71.  For those who do more than just consume entertainment, this phone is for you.  But even if you do, it's got full flash support in the skyfire browser, unlike iphone. There's a reason why nokia still dominates the smartphone field in the world with close to 40% market share.", "Date": "January 21, 2010"}, {"Title": "Great phone with nice apps", "Author": "M. Buck", "ReviewID": "R36NG8FQW9FACC", "Overall": "4.0", "Content": "This is a great phone- no doubt about it.  The camera is great, interface is easy, it is useful and works well.  I love the WiFi- if you use the WiFi, get Opera Mini OS for the phone so you can see and access real web pages. The main problem is that AT&T; sucks and I hate their crappy weak service that craps out on you- avoid them like the plague they are.  Of course, if you are stuck with them (and the crap phone I got from them bunked out right around the 1 year warrants) or have T-Mobile, I would definitely suggest the E71.", "Date": "April 27, 2009"}, {"Title": "Excellent Phone, I LOVE IT!", "Author": "Aina Elias-lawson", "ReviewID": "R1N7XJKNQ0UNJG", "Overall": "5.0", "Content": "I always love Nokia and I was debating whether to get an iPhone or this E71. Boy, did I make the right decision. My husband fell in love with this phone too and is getting one for himself. Highly recommended.", "Date": "December 2, 2008"}, {"Title": "Too little, too late", "Author": "A. de Fusco", "ReviewID": "R2BW3WQV77H727", "Overall": "2.0", "Content": "I bought this E71 for use in Europe because of the prohibitive cost of AT&T;'s roaming for Apple iPhone. Nokia makes great products, but this one left me underwhelmed. It is a well executed piece of hardware, but the Symbian OS is simply outdated, and the entire user interface is cumbersome - a pain, in fact. For example, to make a phone call by finding a contact in the directory you click around and you have to even select whether you want to make a voice call or a video call every time. Really? A video call? When has anyone ever made a routine video call?The camera is good, but after you've taken your shot the software to allow you to send it or store it is cumbersome and counterintuitive. The form factor is great, keyboard is great, screen is great. But you know what? It's a hassle to use and no fun whatsoever. Look for something with better software, maybe the E97 or an offering from another vendor.", "Date": "August 12, 2009"}, {"Title": "The best smartphone ever!!!", "Author": "D2-X \"D2-X\"", "ReviewID": "R3KA2BD91LK780", "Overall": "5.0", "Content": "If you will like to be organized and to be conected anytime of the year this is the smartphone for you. The world it's in your hands now that you have the Nokia E71!", "Date": "November 13, 2008"}, {"Title": "E-71", "Author": "handyman", "ReviewID": "R2XKM8FG9EN629", "Overall": "4.0", "Content": "its nice but there are things that are very confusing with this phone make sure it comes with a sims card before you buy it", "Date": "March 31, 2012"}, {"Title": "WHAT IS THIS?", "Author": "J. Armstrong \"yiannako\"", "ReviewID": "R2YDUYQUVWRX1T", "Overall": "1.0", "Content": "I just got my phone in the mail. The phone is set to Chinese. I have no idea how to change it. WTF!!?!?!?!?!!?!?!?!", "Date": "January 27, 2012"}, {"Title": "Stunningly Beautiful With Great Sound!", "Author": "Pamela V \"\"MS V\"\"", "ReviewID": "RHPA3DGMHLFPM", "Overall": "5.0", "Content": "I'm not a techie by any stretch of the imagination but I love this phone!  Honestly, it has too many bells and whistles for me to use it to its fullest potential, but it suits my needs perfectly because it has an easy to read display, is easy to type text messages on, has a great camera, excellent sound quality and sounds great when using the speaker phone!The camera is made of a silver metal with white key pad area, and it looks wonderful!I couldn't be happier!", "Date": "April 21, 2010"}, {"Title": "Great Smartphone, reasonable price", "Author": "Carlos R.", "ReviewID": "R2610HCDKHKCR2", "Overall": "5.0", "Content": "This is one of the best smartphones ever created, It posses a lot functionality for reasonable price, It just worth the deal. 100% recommended", "Date": "March 8, 2010"}, {"Title": "Good phone for the price!", "Author": "S. Salvage", "ReviewID": "ROEVS0B8H8KBZ", "Overall": "4.0", "Content": "Takes a little getting used to. Switched my unlocked T-mobile TREO-680 for this phone. Screen is smaller as are the icons. Purchased the phone directly from Nokia.com for $[...].  Nokia has on-line coupon fro $50 off $150 purchase.  Paid $[...] + $[...] shipping from Nokia.  Recommend purchase with SD micro memory chip sold by amazon.  Also, recommend OTTERBOX case sold from amazon to protect phone", "Date": "February 19, 2010"}, {"Title": "Good phone", "Author": "M. Sookhoo", "ReviewID": "R23EDE3OWKFXGI", "Overall": "4.0", "Content": "Bought it around mid-December and so far quite pleased with this \"just right-sized\", reliable and good-looking phone.  So far I am unable to get Internet access from my 802.11g wireless network at home as I use WPA.  However, it works well in an open, unsecured wireless network which is not desirable at all. I am not pleased with the quality of pictures with the camera though, maybe a carl-zeiss lens should have been included like in the cheaper nokia 5800 which takes out very good pictures.  I am also dissatisfied with the micro-usb connector since it is not standard.  Finally the phone did not come with a micro SD card which is a must for the price paid at amazon (US$290 at the time).Its sad that the SAR value is 1.33 W/Kg (but less than the the max of 1.6 W/Kg in the US) which is higher than that of the phone I replaced (Nokia 6120 Classic  SAR 1.22- ear & 1.13- body) but this is probably so since this phone is really made for more texting (a wireless keyboard can be used as well).Despite the above shortcomings however, I am pleased with it overall, especially the fact that it consists of highly polished and unscratchable metal, not cheap plastic like others.", "Date": "January 18, 2010"}, {"Title": "Great and hardy phone!", "Author": "Gabriel E. Roades Cavalieri", "ReviewID": "R325ZEY49K5X3I", "Overall": "5.0", "Content": "It's a excelent phone, Hardy and fast, so you can tell everyone that this device is better than every Blackberry phone.", "Date": "December 26, 2009"}, {"Title": "Excellent product", "Author": "M. Fanaswalla", "ReviewID": "R1OQQKO7ZG851Y", "Overall": "4.0", "Content": "Excellent product.For an unlocked phone, the GPS should already have been available. Had to get an image off the web to enable it.", "Date": "December 25, 2009"}, {"Title": "Good Smartphone", "Author": "Thomas John \"TJ\"", "ReviewID": "RM5MDIG076G27", "Overall": "4.0", "Content": "All things considered - if you want an affordable smartphone, this is the one. The hardware looks great, the Symbian graphical interface is a bit old looking - but that can be mended with easily downloadable skins.You are not going to get endless cool add on apps like with the i-phone - however, if you are looking for a QWERTY keyboard, non-touch screen interface (keywords again being: affordable, all rounder) - buy this. No regrets.", "Date": "November 30, 2009"}, {"Title": "is a good alernative for a phone", "Author": "Daniel Bacalao \"D.Bacalao\"", "ReviewID": "R2B3LNGINRTFR8", "Overall": "4.0", "Content": "this phone is a good alternative if you are not going to used it for work, and used limited amount of e-mail send.", "Date": "November 7, 2009"}, {"Title": "You will love this phone!!", "Author": "Love Hope \"charisi\"", "ReviewID": "RRVAQSB43105U", "Overall": "5.0", "Content": "From day one I've loved this phone. For those be afraid of the white -  it's only the keyboard that's more white than anything else. The rest of the phone is pretty much silver. It is a great eye catcher!! Works pretty much the same as any other Nokia...just wish they would make their theme icons a bit more professional looking.One more thing Nokia does not offer Blackberry Connect for this phone. A bit of a step back I would say, but maybe they will at some point.**does not come with a memory card", "Date": "September 17, 2009"}, {"Title": "Excellent Phone", "Author": "Kavey M. Reinita \"Kavey Reinita\"", "ReviewID": "R1U4O6N8K7H39V", "Overall": "5.0", "Content": "I have bought for a friend of mine, i was so impressed with the phone. This a great phone.I'm a blackberry customer, but was very impressed with this phone", "Date": "September 12, 2009"}, {"Title": "Very good phone,but weak battery life", "Author": "Dejan Batinica", "ReviewID": "R23L768SAAYGS7", "Overall": "4.0", "Content": "There is no much to say about this product,i like it,it's very good,but the only thing that i'm dissapointed about is battery life....i tried even in offline mode to keep it,it lasts still one day max!!!I don't know what to do?I purchased it from amazon,seller was mobile city online.[...]", "Date": "September 1, 2009"}, {"Title": "great upgrade", "Author": "Dina Mouasher", "ReviewID": "R12M5HJTEHP0ZW", "Overall": "4.0", "Content": "i had the older version and had a hard time giving it up. i only did when it totally died so i got the upgrade. i love it. it has many of the same features but better.ive heard many complaints about the battery, but ive had no issues in that regard.", "Date": "August 20, 2009"}, {"Title": "The Best Phone Ever !!!!", "Author": "Carlos G. Kauachi", "ReviewID": "R2KL1QS4X8X895", "Overall": "5.0", "Content": "This is one of the best phones ever....Wow for the sip client working on 3G....it works great...i am not using my gsm service any more....I got a Yupifon.com account and they helped me to configure it on the nokia so i make calls from voip instead of GSM from now on....!!!", "Date": "June 11, 2009"}, {"Title": "great phone, great value for money", "Author": "Y. Politi", "ReviewID": "R2ULW25DK69VQ9", "Overall": "5.0", "Content": "I bought this phone as a replacement for a stolen iPhone and I couldn't be happier. 3G, GPS, wi-fi, music, email, etc. All for 320 dolars. It's very stylish as well when compared to a blackberry or other smartphones with full qwerty.", "Date": "April 20, 2009"}, {"Title": "THE BEST CELLPHONE EVER!", "Author": "Ysabelle MB \"Devil Dog\"", "ReviewID": "R14Q6SP2Z2NO9D", "Overall": "5.0", "Content": "This fone has all the features I need and more. Its looks simple but loaded with a lot of power! Good for work-related duties. Battery power is the best by far. Best Nokia fone..or should I say best fone I've ever used in 18 cellular years!", "Date": "January 3, 2009"}, {"Title": "Nokia KILLED the game with this phone", "Author": "Strongpimphand", "ReviewID": "R19BBP8QCIWX7M", "Overall": "5.0", "Content": "I'm a man who only requires 3 things out of my electronics: Battery life, size, and usability.It's why I paid extra for my laptop to have 7 hours of battery life instead of the average 3. It's why I like the Nintendo DS over the PSP. It's why I bought the Blackjack II. All three examples are products that have a great battery life, perfect idea size, and superb usability for my purposes.My Blackjack II has been through the wire and just doesn't look attractive anymore. Back cover falling off, screen brutalized, etc.I purchased this phone, the HTC Diamond, and the Palm Treo to see which one could replace it.Of the three, this phone is simply the easiest to use. The Symbian operating system is horribly easy and I promise my grandma could master it in a week. Applications run fluidly and efficiently. For the first time ever, Gmail and Opera Mini run smoothly without any problems for me.Battery life: Blows the other two away. I shot off many texts, browsed the web, tried the music player, and did some office work and only dropped ONE bar! THIS PHONE HAS AN ESTIMATED 10 HOURS OF TALK TIME. Think about that for a second...Size: It's thinner than my BJII. A plus is the phone itself. On the back is a metallic finish which is great for people like me who might get sweaty hands. It is a fingerprint magnet (I have the white version) but one wipe of the thumb ends that.I didn't go into huge details about this phone because it seems everyone else has. My only complaint is the 2.5MM port for the headphones. I wish it was a regular 3.5, but, go to radioshack and you can easily fix that. Plus, I wish the included usb cable actually CHARGED the phone. Other than that, it's perfect for the quasi-businessman such as myself who needs a business phone - not a toy.", "Date": "March 8, 2009"}, {"Title": "Whatever", "Author": "M. Garrett", "ReviewID": "RYMLAY2HB4HMY", "Overall": "2.0", "Content": "Aside from the sturdy construction, sleek design, and Nokia's T9 predictive texting (which is awesome), there is really nothing else I like about this phone.  I think if you're the type of person that would enjoy using Linux as your desktop OS, then maybe this phone's for you.  Another reviewer said that the OS is cumbersome and I totally agree.  It's not an \"Enjoyable\" experience to use this phone.  Google maps with GPS activated is fair, but it doesn't seem entirely accurate to me.  Sometimes when you're sitting still, the blue dot (your location) can't decide where you really are and bounces around.  Not a big deal, but still lame.  Silencing an incoming call is another one.  Other than hitting the dedicated silence button, I don't see another way to do it (volume buttons, power button, etc).  Maybe there is, not sure?  Setting up Mail for Exchange was a hassle.  It takes less than one minute on an Iphone, and took me a while to do it on this phone with all the little nuances.  Setting up GMail and Yahoo was easy, although that opened up another can of annoying worms.  If you're viewing your GMail mailbox for instance, and you exit, the phone alerts you that the mailbox is connected, and asks if you are sure you want to disconnect?  YES, I want to disconnect, that's why I pushed the exit button....ugh.  The web browsing is by far the worst I have ever experienced on any phone, simply unusable in my opinion.  When your packet data connection is active, and you receive an incoming call, the phone will beep in your ear and display that the packet connection is off...then will beep again at the end of the call and display that packet connection is back on.  Why do I care about this?  Why do I need a beep in my ear for this?A friend of mine who's an engineer in this industry says that Nokia phones have the best antennas.  I'm not sure if that's true or not - I was using this phone with a T-Mobile SIM.  Whenever I was someplace where I didn't have reception, my ATT and Verizon friends were just fine.  This was especially true inside of buildings.  BUT, I think this is more of a T-Mobile issue than a phone issue.Also,I bought his phone in White.  The online pictures of the phone make it appear that the keys are more of a silver, and blend into the rest of the phone.  This is not that case, the keys are WHITE WHITE and are not sliver....there is a huge contrast between the keys and the chrome body of the phone.  - It's ugly in my opinion.", "Date": "September 23, 2009"}, {"Title": "A good phone", "Author": "Mario Solorzano Sandoval", "ReviewID": "R3SEV3OE5WNMNO", "Overall": "3.0", "Content": "I think the E71 is a good phone, but it's not as friendly as others.", "Date": "May 18, 2010"}, {"Title": "Be smart, JUST GET IT!.", "Author": "HRO \"HRO\"", "ReviewID": "R2N0P4SHK3SYD1", "Overall": "5.0", "Content": "Normally I get paid for giving my opinion, but since Nokia gave me a real solution I will write a few lines about this product. Folks, I am not a seller. I am a 27 years old, psychologist, politician, and entrepreneur who live in COLOMBIA, South America. I usually use Amazon to buy new technology and that's what I get. But... with the Nokia E-71 I bought possibilities, and that is what you are going to get: POSIBILITIES. It is possible to do almost anything with this artifact.  Are you smart enough to get this product? I don't know; -Is the product designed for smart, demanding and creative people?  YES.Be smart, just get it.", "Date": "April 21, 2009"}, {"Title": "Nice deal, office network at ur hand", "Author": "Norberto Martel Gutierrez \"Franco Martel\"", "ReviewID": "RRTV81XZRC2AY", "Overall": "5.0", "Content": "OK,  I love this cell, is one of the best cell phones ever made. Nokia get a hit with this phone.Nice camera 3.5 mega pixel, nice keyboard,are very nice, i believe that blackberry designer is pulling hair of his head, because the keyboard design are very nice, and even better that blackberry signature..Nice for bussines people who have to check every time your email account, noke display. Can send mms, sms mesage.Even for young peolpe, is very nice because, the camera its almost better than iphone.B", "Date": "February 2, 2009"}, {"Title": "Underwhelming", "Author": "Vidas Simkus", "ReviewID": "RG9VVKC6RDCLB", "Overall": "2.0", "Content": "I bought this phone to replace a Blackberry Bold.  While the construction of the E71 is very nice, that's where the positives end.  The software on this phone (Symbian S60) is a chore.  Seems like everything takes four clicks to accomplish.  Why do I always have to make a choice between a \"video call\" and a \"voice call\" every single time?  Why do I have to make a choice to reply via text to a ... text message? Why is that not a default choice?  The email application also sucks.  Again, because of the multitude of clicks that's required to achieve anything.And the desktop software... wow is it horrible.  Lots of sizzle but no steak.  Animations and fancy transition effect abound, but there is no way to edit notes on it.  It supports sending and receiving texts through it (the application) when the phone is plugged in, but it shows the numbers of the sender; it does not associate the number with the entry in  your phone book.  It also crashes randomly at startup.And the thing that prompted this review - the phone does not support charging via the USB port.  I mean c'mon!The other good thing about it - it doesn't suck more than the Blackberry Bold", "Date": "June 28, 2010"}, {"Title": "My first smartphone experience", "Author": "R.J. \"Rick\"", "ReviewID": "R2P7QBB1IRDABG", "Overall": "3.0", "Content": "Because, this is my first smartphone experience (I've never even played with one before), please put this review into context.I bought this phone when Amazon did a one day $200 sale on the phone, because my wife needed a smartphone for a new job.  She's Japanese, so she's used to high tech, next gen phones, but she's never been a phone person. In Japan you can get phones with crazy features that are still easy to use. I also liked the fact that you can use this phone as a stand alone GPS device without having the service. The phone actually is great for that, even though the screen is small. Needless to say the phone was too complected for my wife to like. She's very busy and doesn't have time that this phone needs to figure out.I fell in love with it, because I like thinner flip phones, and this phone wasn't much bigger than my Samsung flip, one of the worlds thinnest. So you can throw this thing in your pocket, and it's not going to anywhere as bulky as an iphone.  I also like the solid construction and the steel case. The phone isn't cheaply made. The keys are white, as others have said, not silver like the pic, but I think it looks good. It's an off white, not a bright white, so it doesn't really clash. The letters and characters are back lit, and you can set the phone to slowly pulsate light from the phone on standby.I do like complicated toys, but this one was a bit much. Granted, I don't know about blackberres, et al.  The main issue was the fact that I hate AT&T.;  I hate the a la carte menu plan style that charges you more for every little thing. The phone runs on T-Mobile, which is what I ordered, because I have good experience with them previously. This phone doesn't get 3G on T-mobile. The phone jumps on wifi signals around you with no problem, so I just used my home network. If you're gonna buy a phone like this, you need AT&T;, and then you might as well get a Nokia E71x, which is the same thing, just black and cheaper with an AT&T; contract. I use Sprint normally and can get unlimited everything for a two phones, for what it almost costs to get the same level of service on one phone from AT&T.; With T-mobile, if you don't buy a phone from them, their smartphone service is 20 bucks cheaper a month. that's $480 dollars over a 2 year contract. Think about that for a second if surfing the web a lot without wifi is important to you. The phone isn't good at that anyway. If you wanted to surf the web without a computer, then get an iphone or Droid.Because it's unlocked, it's basically like you bought it in Europe. The phone has an uber chic European style about it for those that want to be artsy and businesy at the same time, but I think you really need the support of an American carrier.  AT&T; supports this phone, so its probably better on their network all the way around. There are functions that don't work in the US. There are other functions, like the music store, that ask you to list what country you'd like to buy from and then give you the choice of 50 or more other countries, but not the US. The online music channel player literally gives you thousands of options for dance music alone, per country. You can listen to a European dance station called Gay radio Europe, or country music from the US. That's cool, but that's too many options. It would bug me to know that I'll never hear all of them and wonder if whatever station I was listening to is the right one.  The phone is like a pretentious Western European looking down on you (stretched metaphor).The camera's kind of crappy for resolution. Just a bit better than my 4 year old flip phone 2mp camera. If that's important to you, then get the Nokia E72.Screen resolution is fine, but will win no awards. Its not like the new droid phones. I played with a bunch of phones at the Sprint store after getting this phone, and the pre was by far the easiest and most intuitive to use. Think of the Palm Pre as the antithesis of this phone. I used the Youtube app that came with it to watch videos on wifi, and there was zero problem. The speaker is actually pretty good, and the speaker phone is great.Using the internet is a pain with the cursor, and there's no touchscreen. Using Opera for mobiles, the speed was great on wifi, but you have to zoom out over the whole page, move cursor where you want, and then zoom back in. If you really need to surf the web a lot with a phone, which I don't, then this isn't the phone for you. It has all the business stuff on it.The keys are ridiculously small, but even with my big thumbs with wasn't too hard to type on. Very few missed keys. The pain in typing for me was actually holding such a small phone with two hands and typing. Easier one handed. It's easier than typing on the Palm Pre, which is really bad.The Nokia apps store is terrible as well. Not a lot of stuff. It uses a Symbian OS, which is a Linux OS, so you might be able to use android apps. Don't know.The software the phone came with, something like 9 programs, were a pain. You can use them when you connect your phone to the computer, and can actually use the phone as a wireless modem, but they are a pain in the ass to use, not very intuitive or multi functional (they are buggy as well).Due to this I only had the phone for 2 days, and I sent it back. Again, with T-mobile there's not much point. I'm also more of a flip phone or multimedia touchscreen phone guy, not a full QWERTY guy. I don't text a lot. If the phone ran on 3G Sprint, which I've been on for 3 years now, then I'd probably just keep the phone for myself and buy my wife something else. Looking for a way to format the phone before returning it, I actually looked in the instruction booklet and saw how many things I was misunderstanding with the phone. If you don't like reading the whole manual, don't get the phone. It's an easy manual to read though.", "Date": "April 23, 2010"}, {"Title": "Nice Phone.", "Author": "Keith Foster", "ReviewID": "R28GJY4D7NICPN", "Overall": "2.0", "Content": "i like the phone. but the key pad is too small to use it.  i don't like nokia program.  my ringtone play at the music player.  i don't know how nokia company program it.  and i can't delete their ringtone bs it is locked.  next time i will choose windows mobile.", "Date": "November 27, 2009"}, {"Title": "The Best", "Author": "Pat B", "ReviewID": "R2ZN71Q1PPUB9C", "Overall": "5.0", "Content": "I just got my e 71 today there was an amazing deal on amazon Just 199 for this unlocked phone . I want to say that i just put in my prepaid sim card set up email which was a snap through wifi and  there you have it a fully functional smartphone. previously I purchased the e 72 but I found it to feel kinda cheap made in China this e 71 is made in Finland great quality. My friend has an e 71 and i just loved it so when the amazing price came I did not even blink glad I made a good choice.", "Date": "April 21, 2010"}, {"Title": "perfect", "Author": "Dai Nan \"dai nan\"", "ReviewID": "RBFVXM92ZA2NZ", "Overall": "5.0", "Content": "so fast speed on the S60 OS , cheap price , nice design . ÕýÊ÷ from ±±¾©", "Date": "February 11, 2009"}, {"Title": "nokia unlock e-71 phone", "Author": "Asif Chaudhry \"AMc\"", "ReviewID": "R78IUWH2DXQYY", "Overall": "5.0", "Content": "nice phone & easy to use with great features & stylish yet functional at the same time", "Date": "December 28, 2008"}, {"Title": "Disappointed", "Author": "Davis Chackaleckel \"Dave\"", "ReviewID": "R8NXTCJ7GBEJT", "Overall": "2.0", "Content": "I bought it in view of my international travel and to have an experience of 3G phone.But it did not work in India!I am totally disappointed! I may never attempt to buy phones online, especially NOKIA!Though it is mentioned as Nokia E71, it has another number besides written in small fine print!Though I took it to the Nokia service center for reformating and they charged Rs 310, it was useless. Looks like they took the money and did nothing!!I lost my opinion about the Nokia Customer care as well!I wonder why they call it unlocked, when it is locked to North America!", "Date": "July 26, 2010"}, {"Title": "I love my Nokia E 71", "Author": "Miss Maria Martelo", "ReviewID": "R1PSRN550D44DV", "Overall": "5.0", "Content": "Hola. Soy de Venezuela. Me encanta este equipo lo puedo usar con cualquiera operadora y tiene todas sus funciones muy practicas.Comprenlo...jeje al igual que cualquier equipo nokia. Excelente marca.", "Date": "May 19, 2010"}, {"Title": "good", "Author": "FC Hotdog", "ReviewID": "R1WEYT4KUYG3EW", "Overall": "4.0", "Content": "it looks great. hard to say whether it works well , cuz it has been stolen", "Date": "December 3, 2009"}, {"Title": "lot defectives", "Author": "J. Cheng", "ReviewID": "R23ZPVQQ2YCRA", "Overall": "2.0", "Content": "I'm a business man who own[...] in Honolulu Hawaii. Cell phone is very important for our business, I been looking for good smartphone meet the requirements for our business for a long time, this Nokia E71 is first smartphone we ordered. But I'm so disappointed. We Ordered this Nokia E71 on April 16, 2010, we return the phone to Amazon.com within one day, because this phone has lot defectives. You can't charge the phone with min-usb(it's bad for business person because you always need to carry Nokia charger with you), also all the SmartPhone has key lock button on the side, but this Nokia E71 don't have the key lock button, make it difficulty to use when the phone automatic locked the key after 1 minute. This phone also can't record conversation. All those defectives make this Nokia E71 useless for a lot business person.", "Date": "April 23, 2010"}, {"Title": "Not the phone pictured", "Author": "Gary K", "ReviewID": "R22XXX3Z1H4YRB", "Overall": "3.0", "Content": "The phone pictured is not the phone received.  The phone received has ivory white keys, but is silver otherwise.  (Kind of ugly if you ask me.)  The phone pictured is entirely light silver.  They must have at least three different color schemes and the one sent is very different in appearance than the one pictured.", "Date": "December 30, 2008"}, {"Title": "it is not good what expected", "Author": "Uma Maheswar", "ReviewID": "R1DUAM04PSUGRN", "Overall": "2.0", "Content": "it is not that much fast what I excepted and the GPS it not working fine even i updated the MAPS, it takes lot of time. and always it go for WLAN such and it it irritating me . I  returning back this device .ThanksUma", "Date": "May 28, 2010"}], "ProductInfo": {"Price": "$269.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and US 3G compatibility via 850/1900 UMTS/HSDPA plus GPRS/EDGE capabilities\nAccess to corporate communication via Microsoft Exchange; full QWERTY keyboard; 3.2-megapixel camera/camcorder; stereo Bluetooth; GPS with Nokia Maps; Wi-Fi connectivity (802.11b/g); MicroSD expansion\nUp to 10.5 hours of GSM talk time, up to 400 hours (17 days) of standby time\nWhat's in the Box: Handset, battery, charger, connectivity cable, headset, E-series lanyard, E-series pouch, user guide, quick start guide, and other documentation\n3.15 MP, (2048 x 1536 pixels) camera w/ autofocus, LED flash, and QVGA video capture", "Name": "Nokia E71 Unlocked Phone with 3.2 MP Camera, 3G, Media Player, GPS with Free Voice Navigation, Wi-Fi, and MicroSD Slot--U.S. Version with Warranty (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Ud85Fr-nL._SY300_.jpg", "ProductID": "B001BZH2QI"}}