{"Reviews": [{"Title": "A useful, high-quality piece of gear", "Author": "RANGER1138", "ReviewID": "R1SXUJ36VSCZ4E", "Overall": "5.0", "Content": "I am a beginning runner who lives in the country. For safety, I always carry my cellphone and identification when I run, and I bought this holder to circumvent the fact that most running shorts don't have pockets.This cellphone holder is sturdy and well-constructed, but flexible enough to allow me to slide my ID/health information cards behind the phone. The band, which fits easily around the arm or lower leg, is slightly stretchy for comfort. I prefer to wear this holder around my ankle, where it seems least likely to interfere with normal circulation.While I haven't experienced this, I suppose it's possible that the heavier stitching on the back of the case may cause chafing if the holder is worn over exposed skin, although I'm inclined to doubt that this would be a problem.In conclusion, this is an excellent product for a fair price. It would be useful not only for runners, but for anyone who'd like the hold their cellphone, ID, and maybe a house key without pockets. (This product was, in fact, originally designed for horseback riders.) I am highly satisfied with this product, and would not hesitate to recommend it.", "Date": "May 29, 2009"}, {"Title": "A secure and convienient holder for you cellphone", "Author": "M. Johnson \"artist\"", "ReviewID": "R1VKY9NPOVRPWY", "Overall": "5.0", "Content": "I love to go horseback riding out on the trail, and I always carry a cellphone in case of emergency. This cellphone holder can be worn on the arm or leg for secure, quick and easy access. The item description doesn't mention the adjustable velcro band is also elasticized to help keep it in place. I have worn the holder on my arm, over a slippery nylon jacket, and the holder didn't slide around as might be expected. I purchased the holder in yellow; it's a bright, bumblebee yellow, with black trim, not the soft, buttery yellow shown in the picture. Not a complaint, since it could be just the way my monitor shows it. Whatever color you might choose, I think you will find this cellphone holder a helpful item. Highly recommended!", "Date": "January 28, 2009"}, {"Title": "Too Small for Most Phones", "Author": "The Shiny Red Apple", "ReviewID": "R3EOHLJUVTYLAX", "Overall": "3.0", "Content": "If you have a smartphone this is probably not for you.I have an iphone 5 and it's in a puregear rock climbing case. I used  this while I horseback ride and it's almost pointless. I can barely fit my iphone into the sleeve and the velcro doesn't reach around. Not to mention if you pull it too tight the band collapses and becomes twisted on the litte black plastic piece. If you have a smartphone then buy a fancier case.If you have an older smaller phone this is perfect.", "Date": "May 14, 2013"}, {"Title": "Perfect for Riding or Where Ever", "Author": "Amazon Customer \"wsterntime\"", "ReviewID": "R4P334HKM53BB", "Overall": "5.0", "Content": "Received my holder today and it is absolutely perfect for when I ride my horses. Now if something should happen I can always be a phone call away. Fits my I-Phone with no problem, stayed where I put it on my leg just below the knee and was actually quite comfortable. The places to use this holder are endless in my opinion. I highly recommend this model of holder.", "Date": "April 16, 2012"}, {"Title": "Daughter loved it!", "Author": "R Culbertson", "ReviewID": "R30VNANO4EAG3B", "Overall": "5.0", "Content": "I purchased this as a gift for my teenager who loves to ride horses. Since she never goes anywhere without her cell phone, I thought she might like this, and I was right. She wears it on her ankle instead of her thigh. She's a big girl, so I don't know if it's because the straps are too short or just for comfort, but she doesn't seem to mind wearing it on her ankle. She thought it was going to be too small for her phone (a droid), but it is stretchy enough that it holds it securely.", "Date": "December 31, 2010"}, {"Title": "Perfect!", "Author": "Richard Kissoon", "ReviewID": "R3MUIYB3NRNX9U", "Overall": "5.0", "Content": "I received 2 of these today and I first thought they were going to be too small for my Blackberry Curve 8310. However, the entire case is made of a quite stretchy but sturdy material and it expanded enough to fit my phone. The quality of the case is quite good and will not easily rip apart. As the other reviewer mentioned, the strap is elasticised and adjustable and long enough to fit around your leg but can still fit securely around your arm without having any excess stick out. It's perfect for keeping your phone on you regardless of what you're doing.", "Date": "April 16, 2009"}, {"Title": "comfortable", "Author": "Grams and Hailey \"Horse Lovers\"", "ReviewID": "RHIUJTWVQXOJ2", "Overall": "5.0", "Content": "I use this to carry my 5StarUrgentResponse button when I am walking my dog or just outside.  The button is not comfortable around my neck when working outside and this holder works great.  I got the green so if I lay it down, I can find it easily ~ yep, the mind goes first!", "Date": "October 28, 2013"}, {"Title": "Safety", "Author": "CJScanlan \"CJScanlan\"", "ReviewID": "R19V0HID6MGQ2Q", "Overall": "5.0", "Content": "Now I can carry my phone more effectively while I am riding my horse out on the trails.It is small but the iPhone does fit.", "Date": "June 30, 2013"}, {"Title": "Cheap, But Little Too Small", "Author": "Carl Imakyure", "ReviewID": "RE4R3CNAVAKSI", "Overall": "4.0", "Content": "To fit a standard-size cell phone.  I inserted a plastic sleeve that allows me to slide my cell phone in and out.  The holder fits comfortable around my upper arm.", "Date": "March 15, 2013"}, {"Title": "Excellent for trail riding!", "Author": "Rosmarie Kelly", "ReviewID": "RWG2669TRYV43", "Overall": "5.0", "Content": "I was carrying my phone in my pocket or on my belt and wasn't sure if I could reach it if I had to or if I would end up losing it.  Now I have no worries.", "Date": "January 26, 2013"}, {"Title": "Nice to Have", "Author": "Xjumper", "ReviewID": "R1KIQHN1PW92IT", "Overall": "4.0", "Content": "Only gave 4 stars because it was a little on the small side. I have a hard time getting my iphone in it. Better for smaller phones but it will stretch. Works great, no problems with it so far and it stays put on my arm or leg. Colors are nice too.", "Date": "January 20, 2013"}, {"Title": "Great little phone holder", "Author": "Maoming Mom \"Ashley\"", "ReviewID": "RHIRTKYW7DRPL", "Overall": "5.0", "Content": "Bought for my daughters who ride horses.  This holds anything from my daughter's \"average\" sized cell to my iPhone with the cover off.  Velcro is nice and snug.  Life saver.", "Date": "January 9, 2010"}, {"Title": "she likes.", "Author": "Jans Schipper", "ReviewID": "R12UC1OBUJ8E7Y", "Overall": "4.0", "Content": "She's happy with the holder, it's exactly what she was looking for to carry her phone while trail riding so the horses don't eat it.", "Date": "April 17, 2014"}, {"Title": "Nice looking", "Author": "Sandra Emmendorfer", "ReviewID": "R2DSAZ7VF8OPXY", "Overall": "2.0", "Content": "Looks great, but not has comfy has i thought it would be. Hard getting phone in and out of pocket", "Date": "February 13, 2014"}, {"Title": "too small for a phone", "Author": "ML", "ReviewID": "R2IHNPS34S0LPA", "Overall": "3.0", "Content": "My daughter doesn't carry a purse and doesn't always want to carry a backpack, either, so her stuff needs to fit in her pockets. Sometimes her phone or ipod would fall out of a pocket, so I got her this holder. It's way too small for a phone, but is fine for an ipod. She says it's comfortable to wear.", "Date": "February 11, 2014"}, {"Title": "great for mom", "Author": "Da Pearl", "ReviewID": "R134JDDDMPMHDA", "Overall": "5.0", "Content": "mom has trouble keeping her cell phone with her, and this is a good solution. If she has a problem or feels ill, she has her cell phone within reach at all times to call me. I bought the pink, the blue, and the green.", "Date": "February 4, 2014"}, {"Title": "Small but useful!", "Author": "Elissa", "ReviewID": "R1134GBZYZ2B97", "Overall": "4.0", "Content": "I bought this to to put my phone in while riding, so that if my horse and I get separated I can still call for help.  :-)  It straps around my half-chaps nicely, and stays put.  My only complaint is that it just barely fits my iPhone 4S in its case, so the threading is stretching just a bit.  But, it's stretching, not breaking, and it's nice to have my phone on me for safety (and taking pictures!).", "Date": "January 1, 2014"}, {"Title": "perfect fit", "Author": "heather", "ReviewID": "R3RXJBIJXN1XSK", "Overall": "5.0", "Content": "Perfect size for my nonsmart phone. I have an lg envy. At first I was disappointed my cell didnt fit but I realized there is a removable piece of foam in the bottom to help keep its shape.", "Date": "December 22, 2013"}, {"Title": "Use for Portable Radios Too", "Author": "1789", "ReviewID": "R23PKZ1JQPBNT4", "Overall": "5.0", "Content": "I love these cell phone holders.  I use them to carry a portable radio on my arm while horseback riding in areas with no cell phone coverage.  There are functional and reliable.", "Date": "December 7, 2013"}, {"Title": "too small", "Author": "Darlene Lammers", "ReviewID": "R2ST8HENI2BJDH", "Overall": "1.0", "Content": "way too small for my cell phone which is not even the larger smart phone, just regular cell phone- would not recommend to anyone- it is tiny", "Date": "November 26, 2013"}, {"Title": "Good product.", "Author": "Anonymous", "ReviewID": "RC6ND4EW6UVEG", "Overall": "5.0", "Content": "Works great, but I have a Kyocera Rise and it is a tight fit to get it in the holder. I didn't realize that it was meant for a smaller flip style phone, but it stays on the arm well and does not slip or slide around when I am running or doing other exercises. I would recommend.", "Date": "November 6, 2013"}, {"Title": "Nope, Nope, Nope.", "Author": "K. Royalty", "ReviewID": "R3R35CCNQRW03V", "Overall": "1.0", "Content": "Got a refund. The description says it should fit all phones...so I thought it'd stretch out to fit my iphone. Nope!Unless you're still carrying around a flip phone from the nineties, pass this one up.Edit: Just realized I didn't try taking it out of its bulky rubber safety guard case prior to trying to fit it in. But I'm not taking that off.", "Date": "November 4, 2013"}, {"Title": "NEVER FEAR LOSING YOUR PHONE!", "Author": "HAPPY777", "ReviewID": "R2OCQ1F0K8M786", "Overall": "5.0", "Content": "PERFECT FOR CARRYING MY PHONE!  WITH THS CASE, YOU DO NOT HAVE TO WORRY ABOUT LOSING OR DROPPING YOUR PHONE.", "Date": "October 13, 2013"}, {"Title": "Handy", "Author": "AMC \"AMC\"", "ReviewID": "RSQ3KUWLGLX78", "Overall": "5.0", "Content": "Purchased this so I could have the cell phone with me when I'm working in the yard, for any emergency.  Great for  what I use it for.", "Date": "September 30, 2013"}, {"Title": "cell phone holder as radio holder", "Author": "Elaine", "ReviewID": "R14NLM78WQ3V9N", "Overall": "4.0", "Content": "I'm actually not using this as a cell phone holder.  I'm using it to hold a simultalk 24G radio for riding.  Its a tight squeeze and you need to pull it up as far as the controls and then pull the strap over the radio. But its doing the job which is better than the slapping that happens when you attach the radio to your belt.", "Date": "September 30, 2013"}, {"Title": "So far so good", "Author": "Cowgirl34", "ReviewID": "R1LBET4XKH004D", "Overall": "5.0", "Content": "Very adjustable and holds my uncool flip phone like a glove! I've used it in the saddle and on my bike. It never moved or flopped, nothing.", "Date": "June 4, 2013"}, {"Title": "Leg Strap for Cell Phone", "Author": "Edwin Gaddis", "ReviewID": "R1L5N8GMR16DXW", "Overall": "5.0", "Content": "Seller sent this item fast which I appreciated.  I amenjoying it especially when I happen to put on pantsthat have no pocket or I am going shopping and putmy license and credit card in it.  Doubt I would getmugged this way.", "Date": "March 21, 2013"}, {"Title": "cell phone holder with leg strap", "Author": "merchaz12", "ReviewID": "RK4Q4WVK4PNR9", "Overall": "5.0", "Content": "Ordered this to carry smart phone while riding my horse. The phone fits very snug in the holder so it is very secure.  The leg strap is easy to use. I strap it on to my lower calf and sometimes forget it is there.  Overall, works well so far am happy with the purchase.", "Date": "October 21, 2012"}, {"Title": "nice", "Author": "Claudia J. Frier", "ReviewID": "R9H3YO104E03N", "Overall": "5.0", "Content": "I have larger arms so this is going to be perfect for bicycle riding. I can fit my Pantech Link II into it along with a little cash.", "Date": "August 13, 2012"}, {"Title": "Fantastic!", "Author": "Windblown", "ReviewID": "RMNZNZHG1YIFT", "Overall": "5.0", "Content": "I need to carry my cell phone, and my favorites riding breeches have just one tiny pocket inside the waistband.  This solves my problem.  I wear it with half chaps when I ride and just on my leg before and after, and I don't even know it's there.  There's a trick to getting the phone out (press from the bottom) and it may not hold the very largest phones, but for my average sized one it's great.", "Date": "December 14, 2011"}, {"Title": "Great holder", "Author": "B. Kelly", "ReviewID": "R2GJQD4F0Y9HA7", "Overall": "5.0", "Content": "I strap this to the handlebars on my bike.  It's great.  I have a Motorola flip phone and it fits very snugly.", "Date": "October 28, 2011"}, {"Title": "Love this Case. Works great", "Author": "Jessica L. Parker", "ReviewID": "R23U0FRDSDJ6ET", "Overall": "5.0", "Content": "I bought one of these cases at a horse show and love it. It is no too bulky to wear all the time, and it does not interfere with most of my daily chores. It is slightly stretchy so it does not cut off circulation to my leg and is perfect for horse back riding. The velcro keeps it securely closed but easy for one handed opening. I recommend this product to everyone.", "Date": "April 1, 2010"}], "ProductInfo": {"Price": "$8.95", "Features": "Safe, Non-Habit Forming.", "Name": "Intrepid International Cell Phone Holder", "ImgURL": "http://ecx.images-amazon.com/images/I/410LGGACEwL._SX300_.jpg", "ProductID": "B001FK46QI"}}