{"Reviews": [{"Title": "Pretty but pretty annoying", "Author": "A. Wu", "ReviewID": "R1XHW97PRO1UVK", "Overall": "2.0", "Content": "At first glance, the Prada phone looks like a great buy.  Slide out keyboard and responsive touch screen.  The interface is really pretty and for a user who doesn't customize their phone much, it probably works ok.  It's in the details though that has me tearing my hair out and trying to resell it on ebay.1) As far as I can tell, the contacts don't import automatically from Microsoft Outlook.  You have to go through some *.csv conversion which is a pain.  **Anyone know differently, please let me know via this forum!**2) User interface is not stable, it's rebooted on me at least 5x in the past month when I'm doing random simple things like making a phone call.3) They like their sounds too much and I can't figure out how to turn them off in normal mode!  (i.e. sliding the keyboard in/out has a ringtone, which when you're trying to discreetly text, and you don't want your phone in silent mode, at dinner/meeting is impossible!)4) The battery runs down relatively fast compared to my old Nokia n95, or maybe I'm just in bad reception areas a lot which impact my battery life?I would assume a lot of these *features* would be fixed via software upgrade but I don't plan to wait around.", "Date": "April 2, 2009"}, {"Title": "Dont buy this phone!! You wont get anything back.", "Author": "H. Masterton", "ReviewID": "R1T3M3GMKWD44T", "Overall": "1.0", "Content": "After having the Prada 1 and liking it, I paid almost $500 for this phone. I went through 3 brand new Prada II phones and they all were defective. The longest use I got from one of them was a couple weeks. I had to pay to ship the phones back and long story short, I ve paid out $30 and have nothing to show for. LG did not want anything to do with US customers, even squaretrade cancelled the warranty when I tried to use it when it broke again. The physical elements of this phone are beautiful, but I would not waste your money, youll wind up spending more send it back. IT freezes all they time, restarts on its own, and eventually it will just not turn back on. Many many people have the same problem but LG will not take responsibility since they werent made here, but yet they market it as an international phone. I never write review but feel that I go so ripped off that I want to prevent anyone from making the same mistake.", "Date": "November 30, 2009"}, {"Title": "Beautiful phone", "Author": "Honest User", "ReviewID": "RYR4ZFBK3MMT6", "Overall": "3.0", "Content": "This is a beautiful phone, nice interface for normal use. However, since the phone didn't come with warranty, and the fact that I got a minor defect in the screen that there's a red dot that doesn't dissappear, and also LG is not known for their quality, I had to return it. The battery after charging last me 3 days with non heavy use.", "Date": "May 17, 2009"}, {"Title": "if you have a functioning brain you'll ignore the low ratings...", "Author": "Onasis Scot", "ReviewID": "R1QBCAQ68OB531", "Overall": "5.0", "Content": "this phone is awesome.  it's sexy, functional, and the ultimate status symbol when you're seen out and about with it...so, why all the lower reviews saying it keeps freezing and has issues?  because most people are lazy, wanting to buy a european phone unlocked and not go through the steps to set it up to work here in the states.  news flash, if you keep running it's built in programming on a network it's not designed for... IT'S GOING TO CRASH!!!  there are tons of discussion boards you can read to find out exactly how to enable the picture messaging and the email over the network of your choice.  when i first got the phone, yes, it was freezing quite a bit.  yes, it was kind of a pain to go through and set everything up manually (your wireless provider in the states won't help you because it's an unlocked phone they don't supply).  but, i went through it (really not as bad as i thought... and i have ZERO experience with this type of thing) and the phone is PERFECTION!if you can grasp basic literacy and a google search bar, you can set this phone up for your provider.  and then you can be the envy of everyone around you.", "Date": "July 23, 2010"}, {"Title": "LG prada Frustration", "Author": "Rowena", "ReviewID": "R2B50QVGUF9NBD", "Overall": "1.0", "Content": "Never ever order this phone but most importantly do not order it from this site. I received mine with damaged and no one is capable of handling my complaint. If you really like this phone go and get from trusted online site because this site will never entertain you nor treat you as a customer, there is no guarantee to what you're paying for. Im very much disappointed communicating with the salaes manager named Kevin who was not helpful at all and doesnt care if you are not satisfied with the product. Christmas is coming beware customer DO NOT ORDER FROM THIS SITE, NEVER EVER!!!", "Date": "December 13, 2011"}, {"Title": "Firmware Update!", "Author": "Jo Wilson", "ReviewID": "R18KTBEINIAH0E", "Overall": "5.0", "Content": "The first couple of weeks with this phone were absolutely frustrating. The response was incredibly slow and it had a knack for freezing. After owning it for the second week, it turned off and was unable to get past the splash screen. What made this so frustrating was how badly I wanted the phone to work. The phone is absolutely gorgeous and I could tell I would end up keeping it for years to come. I searched everywhere for how to fix the problem without sending the phone back. Apparently, this phone's original firmware is very dodgy.If you're interested in getting this phone, I suggest the first thing you do is update the firmware. Here's how I did it.what you need:- LGMulti v3.0 + kf900 DLL here: RapidShare: 1-CLICK Web hosting - Easy Filehosting (refer to[...] for updated link)- firmware here: RapidShare: 1-CLICK Web hosting - Easy Filehosting (check in the firmware list for the latest)- USB data cable- your bricked (stucking on ***** logo) KF900remove the batteryopen USBMap and select infiniteon, then \"mapping start\", and connect your mobile (WITHOUT BATTERY).not sure if I did it in emergency mode or not, anyway if doesn't work simply press send (green) and function (C) buttons togethere while plugging the usb cable.once the computer has recognized your mobile click save&exit.;now open GSMulti and choose the right DLL and .bin files you've just downloaded.click start and wait a while..first it didn't recognize my mobile..I tried unplugging and plugging it in again while pressing send and func buttons and after a while it started uploading the firmware to the mobile.After updating the firmware I found the phone to be absolutely amazing! It's exactly what I was hoping it would be. Sure, it's a little dated in comparison to the newest iPhone etc., but it's extremely attractive and the slide out qwerty keyboard is a huge bonus! After the firmware update I found it to get better usb reception, it works a hell of a lot faster, and never locks up.What I like most about it;-Despite other reviewers, I find the build quality incredible. It feels like something Prada would make.-It's very attractive, especially with the black leather case. Get yourself screen covers to keep it looking mint.-In comparison to the Prada I, the added multi-tasking, better network, wifi access, qwerty keyboard, widgets, and even the fact that I can access all of my media from one button are major upgrades. Access to media from one button sounds small, but it was rather annoying to go to media> external storage> media> images just to look at the photos you put on your micro card. Well, at least for me it was, which I change the wallpaper on almost a daily basis. Also, on the Prada I you couldn't play an album in the media player from your external storage. You had to add songs to a playlist first. Again, I just find the Prada II leaps and bounds above its predecessor.-The images, videos, and music files already installed on the phone are actually quite nice. I found the preinstalled ringtones very fitting of the phone, and decided to use those over ones I personally downloaded. Even the \"sleep-mode\" slideshow you see when the phone is locked is really quite nice.-One of the reasons I bought not only the Prada II, but Prada I, and the LG Vu over the iPhone is because of the UI. On all three, the interface is quite attractive, and the only improve on it more with the Prada II.I'm incredibly happy with this phone, and I certainly suggest anyone looking for a fashion phone to try it out. I've already put money aside for the Prada Link just because of how happy I am with this phone. However, it's definitely a must to update the firmware as soon as you get it.", "Date": "September 16, 2011"}, {"Title": "Gained waistline, lost Sexy-factor", "Author": "Timothy Lam \"trustedsince1996\"", "ReviewID": "R2DPWLKW9JUJY5", "Overall": "3.0", "Content": "I bought the original LG Prada (KE850) as a birthday gift my wife last year.  It was a very fashionable and stylish looking phone, which my wife (in her early 30s) loves, but the reception and the missing 850Mhz band left something to be desired on the AT&T; wireless network, which is reasonable as this phone was never intended for the US market.  It would probably work better on T-Mobile US network (since they don't use 850 band).  We ended up returning it because of that.  Mind you, the software on this phone is very simple and basic, which is perfect for my wife since she hardly text and rarely used anything else.I was excited when the Prada II is announced and it comes with quad-band this time (however, 3G would only work outside of US)!  However, I was disappointed as soon as I found out they decided to add a slide-out QWERTY keyboard.  Seeing in person (at CES) how much thicker the new phone turned me off.  It has gained 40% in thickness (16.8mm versus the older but slimmer 12mm Prada I) and slightly taller than the old phone (quarter inch).  The \"Ooze\" factor of the original Prada phone is gone.  This new phone would be a good choice for these who texts often but doesn't want another me-too looking phones.  However, for my wife, the weight-gain is a deal-breaker.UPDATE:  I did ended up buying this phone for my wife to use on AT&T; wireless, as she doesn't have data plan and don't want to pay an extra $30/month, the iPhone doesn't make sense.  This works well for her since she only calls and texts, but due to reception and call dropping issues (which might just be AT&T;), we are shopping for a new replacement phone.", "Date": "May 13, 2009"}, {"Title": "Not what I thought it would be", "Author": "Esteban Vega \"esteban\"", "ReviewID": "R22KNU6XZEH24S", "Overall": "1.0", "Content": "I was very excited to get the phone. When I got it,  it started giving me multiple problems. It freezes up constantly, and I have to take the battery our like 5 times a day. I got so frustrated with it that I just stopped using it all together. The picture quality is also very bad. . I would have gotten another phone", "Date": "July 23, 2011"}, {"Title": "LG KF900 Prada II - short review", "Author": "greg", "ReviewID": "R2AN2Z39D9W8FC", "Overall": "1.0", "Content": "I used this phone for a few months. It looked good and the physical keyboard was very useful. Unfortunately the phone (OS) crashed very often what became extremely annoying. After the OS crash you have to remove the battery and restart the system. Once I overslept and was late to work just because the system froze in the night and the alarm didn't ring in the morning.What is really unbelievable is the fact there is no firmware update available for this model. It just shows how much LG cares about the functionality and reliability of their devices and customers' satisfaction. I dumped this phone and got myself a cool new Android handset which most importantly just works. I'm very disappointed with LG and will stay away from their products. I sincerely advise you the same.", "Date": "September 2, 2010"}, {"Title": "Loved it", "Author": "Ryan Lemand", "ReviewID": "R3TOU5OMY7TMQU", "Overall": "4.0", "Content": "I bought the LG Prada 1 when it first came out in 2006 and she absolutely loved it. This lead me to buy her the new version of it for her birthday one month ago and she said LG has completely revamped the phone and corrected most of the negative points the first Prada had and she is very happy with it.", "Date": "May 30, 2009"}, {"Title": "Prada II", "Author": "M. Lucho \"M. Lucho\"", "ReviewID": "RKJ2ELRQ04NSX", "Overall": "4.0", "Content": "I buy this phone for my girlfriend and she have general good comments and a few badsThe Good: The 5 Mega Pixel LG Prada II camera can take vibrant color and high quality photos in sunny day but average in night, also you can edit,crop,rotate, and add text and logos to the photos. The second camera (VGA) can be turned on for self photos.The phone have good 3D Interface and responsive Touch screen very close to iphone.The bad: The phone have random restarts, this was solved by changing 2G only network, the 3G network is only for Euro, so you no need both networks function.The WiFi not always can be connected and the Internet browser lose connection on a few min of use, poor ringtones (solved by transfer a few mp3)", "Date": "August 21, 2009"}, {"Title": "Not the best phone", "Author": "Acuraroman", "ReviewID": "R2Y2XY1TX8OJ14", "Overall": "1.0", "Content": "I bought this a few years ago and after 16 months the phone was a brick. It randomly restarted and just stuck on the prada logo. I called LG to see if I could get the phone looked at and they just laughed and told me that they do not service this phone in the US. This phone is pretty much a useless piece of plastic. It looks great, but the internals are garbage.", "Date": "October 30, 2013"}, {"Title": "Great phone. Fast delivery. Thanks.", "Author": "Chris", "ReviewID": "R1UJ6SGRB1YORA", "Overall": "4.0", "Content": "A must but for Prada lover. Although it is an phone without facebook but so what!  when you have an ipad.", "Date": "November 15, 2011"}, {"Title": "Works just fine in the US and UK", "Author": "LHV", "ReviewID": "R3K8QAQRR7Y1D2", "Overall": "5.0", "Content": "Sleek design, nice phone.  Received this as a gift because it was PRADA and had a keyboard.  I like PRADA!This is the best, most reliable phone I have had of the LG line and I use it with my UK SIM card.  While the previous reviews may have merit, I was careful not to load a ton of applications onto the phone.  This is the secret to my success with LG phones.  Besides, I have a \"B. Berry\" which has all the applications that I need (Facebook, LinkedIn, eTrade, etc...) when away from my laptop.  Vashti Horvat, LHV", "Date": "November 3, 2011"}, {"Title": "Great Phone", "Author": "Griffey \"Gamer\"", "ReviewID": "R3CHXGG2J3RHRA", "Overall": "4.0", "Content": "I really loved my iPhone but I am getting tired of always having to renew or extend my contract so I purchased this phone. I had to spend 5 mins setting it up but other than that its a great phone. I cannot get the phone to access or recognize the 3g service with AT&T.; it has most of the features of the iphone but not as refined. I will say this its a great phone and having the actual keyboard is a plus.  The LG app store is not as extensive as the apple app store but all the lg apps are free. all in all its a great phone and for less than $200 without a contract is what I wanted.With the exception on not being able to access 3g service its a good phone. If anyone knows how to access the 3g with this phone please let me know.", "Date": "April 15, 2011"}, {"Title": "LOVED IT!!!!", "Author": "Gerico M. Ortiz", "ReviewID": "R14X06XOHMAC7F", "Overall": "5.0", "Content": "At first I was like, Why did I buy this? But after using it for a day, I loved it!!!!!! Its an AWSOME phone!!!!!if you are an ATT customer like me in the USA, be prepared to set up the MMS and all that good stuff. Its all online. But other than that, the phone itself is beautiful !!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "April 10, 2010"}, {"Title": "Pretty phone, but could work better", "Author": "ISABEL", "ReviewID": "R22PQ6D0VRAB6V", "Overall": "3.0", "Content": "This phone is very nice, but there is a couple of things that really bother me:1. I can't get or receive picture mail because the internet technology of this phone is not compatible with AT&T.;2. When I'm receiving a call, the picture on the screen of the person that is calling is very small and is not bright enough.3. The Internet browser is very slow.On the other hand, the camera resolution is great, it delivers  high quality  pictures & video; the touch screen is very responsive,The back of the phone is very resistant to scratches due to the material it's made of, so it always looks like brand new.The keyboard works very well.It works ok for me, but you can get a better phone for the same price.", "Date": "February 21, 2010"}, {"Title": "prada!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "veeverz", "ReviewID": "R1VDONW6WNZMWU", "Overall": "5.0", "Content": "the prada fun is awesome!!!!!!!!!!!!!!i love the company and can't wait to by the phone!!!!!the price is a little over my budget but at least cheaper than the iPhone!!!!!i lone that it docent have internet and can do almost ne thing else!go prada!!!!!!!!!!!!!!!!!!!!", "Date": "April 25, 2012"}, {"Title": "prada II cell phone review", "Author": "andee", "ReviewID": "R122XEWUHN9CXN", "Overall": "5.0", "Content": "*excellent stylish phone*touch screen technology with slide out full qwerty button keyboard*good battery life*many useful applications*5 mega pixel camera*this purchase was a replacement of my first prada II cell phone, which lasted about a year(i'm content if a cell phone lasts a year)", "Date": "February 17, 2010"}, {"Title": "PRADA PHONE GET FREEZE", "Author": "Randall E. Garcia Arias", "ReviewID": "R284C2JH91Z7M7", "Overall": "2.0", "Content": "The phone KF900 looks great, but this phone have a SEVERAL ISSUES with the SO, it get freeze and NEVER coming back. i have to return, at least integron tech have a great customer care.**I WILL NOT RECOMMEND THIS PHONE NEVER EVER**HAPPY DAY!", "Date": "July 21, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 900/2100 UMTS/HSDPA plus GPRS/EDGE capabilities\n3-inch touchscreen with slide-out full QWERTY keyboard; 5-megapixel camera/camcorder with Schneider-Kreuznach optics\nBluetooth stereo music; digital audio player and FM radio; MicroSD memory expansion; DivX/MPEG4 video player; TV out\nUp to 3 hours of talk time, up to 400 hours (16+ days) of standby time", "Name": "LG KF900 Prada II Unlocked Phone with Camera with Flash, Full Touch Screen, Slide-Out QWERTY Keypad, MS Office, PDF, Text Reading--International Version with No Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31gi7JIaBHL._SY300_.jpg", "ProductID": "B001JU9ND0"}}