{"Reviews": [{"Title": "Excellent touch screen phone for the mainsteam user", "Author": "Ernst Blofeld \"kidgib1\"", "ReviewID": "RZC2EO0KA3CF7", "Overall": "5.0", "Content": "The G900 is a worthy successor to the Sony Ericsson P1i. It fact, its is every bit as good and even better than the Sony Ericsson Walkman Flagship W960i.Though it uses the same Symbian UIQ3 platform as the P1i, the user interface has been polished with the addition of easy to use home screen panels. You can add panels for different applications like messaging, music player, application shortcuts, tasks and calender. These home screen panels make the phone much more user friendly than the P1i and the W960i.The G900 also has a much improved media manager for your pictures, movies, and music files. The media application would be familiar to people who use the PSP and the PS3. It has the feel and looks like the media crossbar that Sony uses in its Playstation line.The G900 also has a 5 mega pixel camera with a picture light. The light can also be used as a bright flash light which can be handy in an emergency situation. The pictures taken by the camera can be a little washed out and lack the vibrant colors of some better 5MP camera phones like the Nokia N95.It has a traditional candy bar form factor. It is much slimmer and smaller than the P1i and the W960i. This makes it a lot more user friendly and more pocketable. Its size combined with its easy to use user interface makes this phone attractive to people who want smart phone capabilities but don't want to deal more complex to use phones. Simply put, this is the best smart phone that Sony Ericsson has made to date...until the Xperia X1 is released at least. :)Pros:-Great touchscreen. The screen is bright and vivid.-Very slim and light for a smart phone with so many features.-Easier to use UIQ3 interface with the addition of panels-Excellent media manager and music player-Five megapixel camera with innovative touch focus-Excellent connectivity with bluetooth and WIFI and GPRSCons:-Does not support EDGE or US 3G networks (Supports UMTS 2100 for European 3G)-Though it takes 5MP pictures, the pictures are not as vibrant as other 5MP camera phones-Lack of built in GPS-Base package does not have any memory stick included-The Opera web browser could be better and does not support flash", "Date": "February 2, 2009"}, {"Title": "Decent phone", "Author": "IH- reviewer \"The reviewer\"", "ReviewID": "R2LHGBK9LD8CQT", "Overall": "3.0", "Content": "I have had this phone for exactly one year from today- give or take a few weeks. Unfortunately, the phone died on me today. (I'm disappointed from the substantially low damage threshold. I have seen it take many strong hits before, but as I was taking it out of my pocket, a mere 2ft drop, was enough to destroy something inside the phone even though nothing physically broke)So far, I have been moderately satisfied with it. It is a decent phone, it gets the job done.. although the \"smart\" features are not all that useful, as they require heavy configuration and support/fees from the service provider.The Media functions on the phone are satisfactory. They are not worthy of five stars because of the occasional lag and slow response time. The camera is weak. Although it is 5MP, it does not seem to produce pictures of the same quality of the rival, any Nokia 5MP camera phone.The touch screen, honestly, is seemingly unnecessary; except for the open, yes/no, menu, etc. buttons. Come to think of it, I rarely use the touch screen.The keypad lockcode lags sometimes, or sometimes engages when a get a call, not allowing me to answer until the right code is entered. However, this only happens occasionally; most of the time it answers phone calls automatically, with disregard for the lock.Over all decent phone, but one star for durability. I used to own a nokia phone, that was of similar class.. almost a rival model, that I could safely call a tank. Such a light drop should not destroy the phone.", "Date": "June 25, 2009"}, {"Title": "The worst Cell Phone I ever had", "Author": "Duvos Raul Ignacio \"rid47\"", "ReviewID": "RR51RO5GU2WHS", "Overall": "1.0", "Content": "This is the worst mobile I ever had, The touch screen is not good at all and 3 times after I started using it it didn't work anymore for answering calls, so I had to change it.", "Date": "January 7, 2009"}, {"Title": "G900", "Author": "Dennis Berrocal", "ReviewID": "R2FMMLLORZ30MA", "Overall": "4.0", "Content": "I can't complain, is a nice phone, and is not that expensive, but it could a better phone if it was more faster", "Date": "June 12, 2009"}, {"Title": "crap", "Author": "Ricardo Román \"hai :D\"", "ReviewID": "R1SWXOHDEQSREQ", "Overall": "1.0", "Content": "plain crap. i bought this mobile and the wireless broke down less than 6monhts from buying it. Its slow and imcopatible.Plain crap.", "Date": "June 15, 2009"}, {"Title": "BUYER BEWARE", "Author": "Pia Lorena Delisante Ruth", "ReviewID": "R2I77N4G1Q9BJY", "Overall": "1.0", "Content": "This is no joke, no warranty means the buyer will not respond to calls or emails. Our product came with a manufacturer defect (half the touch screen does not work) but we have been blown off by Johnny at Integron Technology. Do not deal with this company unless you are willing to throw away good money. Many other bad reviews of this company exist online, so do your homework more than I did!", "Date": "February 1, 2009"}, {"Title": "Worst phone for $320", "Author": "Trent Nguyen", "ReviewID": "R1RECEZN0GXYNG", "Overall": "1.0", "Content": "I recently bought this phone and was a bit surprised by the lack of quality put into the housing of the phone.  Sony Ericsson found the cheapest type of plastic to build this phone with therefore the feel of the phone is not the greatest and I was not happy with that.  After I've gotten over that, I found out that the software was just lagging from one stage to the next, took me several minutes to boot up the phone the first few times, application are slow from one screen to the next.  Needless to say, I sent this one back.", "Date": "February 13, 2009"}], "ProductInfo": {"Price": "$213.99", "Features": null, "Name": "Sony Ericsson G900i Unlocked Triband 5.0 MP PDA Phone (Dark Brown)", "ImgURL": "http://ecx.images-amazon.com/images/I/41hsVdW%2BfiL._SY300_.jpg", "ProductID": "B0016XQOV4"}}