{"Reviews": [{"Title": "The battery of these phone dont work at all", "Author": "Graciela", "ReviewID": "R1FOLCBQB9AC51", "Overall": "2.0", "Content": "The sent me a phone with a battery that doen not work. I hope they can fix those issues for the future.", "Date": "April 28, 2012"}, {"Title": "Pick something else", "Author": "Cornelia E", "ReviewID": "RQIT4E0NOOVY1", "Overall": "1.0", "Content": "The unit does not work after barely a month. I wish I had bought something else. Next time I will", "Date": "March 27, 2014"}, {"Title": "Great Vendor", "Author": "Philip Becker \"Der Alte\"", "ReviewID": "R31XP4PCR5VI8V", "Overall": "5.0", "Content": "I have grown attached to these little phones, they work well, the microphone and the speakers work well, they perform all the functions that I want in a phone, decent camera for the casual picture, very good keypad, easy to operate, excellent ergonomics, nice styling, and unobtrusive.  The seller did an excellent job of packaging, sent the phone via USPS Priority Mail and it arrived on the first week day after shipment.  Great phone, very good vendor.", "Date": "June 6, 2013"}, {"Title": "Motorola K Series", "Author": "Pedro Borges", "ReviewID": "RT0UW4TCYVYPF", "Overall": "1.0", "Content": "The unique Motorola K Series that have touch control in the front screen is the Motorola KRZR K1m, but in CDMA 1x/ EvDO technology.The Motorola K Series GSM technology do not have touch control in the front screen. Your product is with a wrong advertising. Please, correct the image in your advertising to prevent future difficulties with other clients.[...][...]", "Date": "January 4, 2012"}, {"Title": "Hump", "Author": "Thomas Barnes", "ReviewID": "R1KVLJN4GTV1EV", "Overall": "3.0", "Content": "Sat on it in my pocket and broke the screen on the outside of the phone, I seem to remember these being much much stronger and durable. I guess that was only the Razor models.", "Date": "June 5, 2014"}, {"Title": "Good cell phone!", "Author": "Fredd", "ReviewID": "R3REUCJPZ4NVUT", "Overall": "3.0", "Content": "I choose this phone because I need a single one but after a few days of use it stars to show a message \"battery not valid\". Suddenly it got off and the battery is dead... I recomend the cell phone but be sure that the battery is original.", "Date": "April 17, 2014"}, {"Title": "not a good purchase worth doing", "Author": "maggie", "ReviewID": "R2DP0U699NA2CH", "Overall": "1.0", "Content": "this phone did not work at all !!! Tried charging right after i received only to find out it would not even turn on", "Date": "February 28, 2014"}, {"Title": "No way this is new", "Author": "Alyssa Smith", "ReviewID": "R1P4M4T08QRAYY", "Overall": "1.0", "Content": "If this is a new phone, then someone took it out of the box and played a very poor game of catch with it. The screen looks like someone took a key and scratched a checker board into it and the Motorola logo looks chipped. Didn't even bother putting a SIM card into it, returning.", "Date": "February 11, 2014"}, {"Title": "Motorola RAZR K1", "Author": "Elwood Funk", "ReviewID": "R3A4H81H6PBLQQ", "Overall": "1.0", "Content": "It's a piece of junk, the second one and still problems, First one couldn't hear anyone talking ,sent it back and was replaced and the new one lasted 3 weeks now no volume control", "Date": "January 5, 2013"}, {"Title": "Satisfied", "Author": "Amazon Customer", "ReviewID": "R5MQ9BTBL6I3B", "Overall": "5.0", "Content": "I purchase this phone for someone and they love it dearly.  I would recommend it anytime as a good buy to anyone who want to purchase anything less than a blackberry or Iphone.", "Date": "October 5, 2012"}, {"Title": "My phone", "Author": "Marianella", "ReviewID": "R2IHOBG9FATJY1", "Overall": "2.0", "Content": "Well I finally got my phone after 13 days, and guess what? The battery does not charge. I email the company and hope that they will fix the problem. Honestly I do not know what to expect. I hope that this guy Chris do something about it. Thank you.", "Date": "December 3, 2011"}, {"Title": "Greaat Unlocked Phone", "Author": "ThaCool", "ReviewID": "RJ34YTA8VUC6Z", "Overall": "5.0", "Content": "Cheap Unlocked phone does what its supposed to do. If your looking for a cheapy to only mkae calls then this is good for you", "Date": "October 8, 2011"}, {"Title": "KRZR K1, GREAT COM DEVISE. HELLO MOTO!", "Author": "bryan", "ReviewID": "R3W34NEBJLQWEZ", "Overall": "5.0", "Content": "I travel to four different offices across three states and have had trouble getting reception with several other cell phones in the past, but these Motorola KRZR'S ARE FANTASTIC. I bought my first krzr, a blue one approx. four years ago and it was great. I talked to people that most of my friends could not. When it started to get a bit beat up, I ordered a black one from Amazon, which I think is an older model but I love it also. I'm going to order another one for backup for later. I believe that Motorola is probably the strongest sending and receiving devices on the market. It's too bad the other companies can't make cell phones that powerful. Nice and small and powerful. p.s.I don't use internet on my phone. It is most important that I be able to make and receive calls on the road. If that is most important to you, then get yourself a KRZR NOW. YOU WON'T BE SORRY. HELLO MOTO!", "Date": "November 22, 2011"}, {"Title": "Qualify of this phone", "Author": "TP", "ReviewID": "R2BUAE5PNCFYQ", "Overall": "2.0", "Content": "I bought this Motorola to replace the old one that I really liked it but this phone is product of China that has poor qualification, with much noise when talking, small voice, lost call .... I returned to use the old one after 2 days using the new . I wasted my money and do not recommend this Motorola that made in China to anyone who wants to buy the new or replacement like me.", "Date": "October 30, 2012"}, {"Title": "Not the same phone as the original.", "Author": "Rayzor", "ReviewID": "R2ON5IRL4UXKEY", "Overall": "3.0", "Content": "I must have owned at least eight (8) of these phones over the past ten years, and the Quality has declined so much so that this will be my last Krzr. The last two phones, also ordered from Amazon, never worked right, and after submitting a terrible review, was never contacted by anyone? Also, the batteries for these phones are also defective and will not fully charge, or hold a charge. My original Krazor's and batteries worked great, what happened?", "Date": "December 29, 2011"}, {"Title": "unhappy-quality poor.", "Author": "Amber67", "ReviewID": "RU9AIUG2Q1IH4", "Overall": "3.0", "Content": "I purchased this motorola KRZR K1 phone and it shipped out pretty fast however it took over 4 1/2 weeks because they used the US postal service. Most folks use the UPS and it takes only 3 days to travel anywhere-they chose a bad carrier. I was waiting a long time.Secondly, despite advertising it as \"new\" the screen is pixelated and you can't really see the time on the top flap.Thirdly, phone conversations are very poor and fuzzy. It has nothing to do with my plan, carrier, or reception, it simply picks up poorly and every fourth word is indistinguishable. the nice thing is the camera though which works amazingly, I really like that.", "Date": "January 5, 2011"}, {"Title": "Sleek", "Author": "vijay mahesh nandivada", "ReviewID": "R1Y9Y6H3TEFLOA", "Overall": "4.0", "Content": "Motorola KRZR k1 are sleek phones. Small and real good piece. I bought this for my parents who are not that tech savvy.", "Date": "February 11, 2014"}, {"Title": "Motorola KRZR K1 Unlocked Phone with 2 MP", "Author": "donald hart", "ReviewID": "R3EFAS1NIQZMSZ", "Overall": "4.0", "Content": "I will not elaborate much, as I have written elsewhere about Motorola. What I like is how easy to program each of the functions. It is a very explicit phone.", "Date": "July 15, 2013"}, {"Title": "Excelente Telefono", "Author": "Juan Abreu", "ReviewID": "R340752FWDC0VV", "Overall": "5.0", "Content": "Muy buen producto K1 es uno de los telefonos que pasa el tiempo y nunca olvidas me llego en perfectas condiciones y lo uso con la telefonia Movilnet en Venezuela y funciona perfectamente.", "Date": "February 21, 2013"}, {"Title": "excelente producto", "Author": "GABRIELA", "ReviewID": "R1Z3QJYXGB61PY", "Overall": "5.0", "Content": "excelente producto lo recomiendo es muy bueno cumplió con todas mis expectativas y el envio fue rapido seguro y confiable", "Date": "November 23, 2012"}, {"Title": "Ummmmmmmm", "Author": "Pen Name", "ReviewID": "R2UX8D139K8078", "Overall": "2.0", "Content": "I bought this phone from my dad.. And we'll it's a knock off from china and it says made in china.. Any ways I really did not want to buy this phone cuz of the bad reviews.. But my dad -___- wanted it in this color.. Ugh.. Anyways it's been like a cupel of weeks and the phone still work but let's just see for how long.. The phone is trippy.. My dad hasn't noticed but I have the phone some times looks like its about to turn off even when it's charging its like if it wants to blow a fuse or something.. When u call this phone some times u get it and most of the times you don't... But ehh.. Don't buy this phone you guys.. Hope I helped..", "Date": "March 11, 2013"}, {"Title": "excelente", "Author": "glanexys", "ReviewID": "R3LCO5FN88FS11", "Overall": "5.0", "Content": "Excelente producto recomendado.. lo recomiendo! funciona excelente y llego a tiempo, excelente envoltura y tal cual lo describio el vendedor", "Date": "December 12, 2012"}, {"Title": "Aparelho com defeito.", "Author": "Luiz C. De Oliveira", "ReviewID": "R1UMRCEAD17KHW", "Overall": "1.0", "Content": "Caro amigo vendedor,este produto,cell K1 não está funcionando corretamente,pois não carrega a bateria,já testei com outra bateria e continua com o mesmo defeito,com carga falsa. Grato e no aguardo de uma breve solução.Luiz.", "Date": "January 6, 2012"}], "ProductInfo": {"Price": "$299.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and EDGE/GPRS data capabilities\n2-megapixel digital camera with 8x digital zoom; MicroSD expansion; digital audio player\nBluetooth stereo music; access to personal email; web browser; SMS/MMS/EMS messaging\nUp to 5.83 hours of digital talk time and 300 hours of standby time", "Name": "Motorola KRZR K1 Unlocked Phone with 2 MP Camera, MP3 Player, Stereo Bluetooth, and MicroSD Slot--International Version with No Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41v8upAndoL._SY300_.jpg", "ProductID": "B0018BM0U8"}}