{"Reviews": [{"Title": "pleased", "Author": "Ian Schillebeeckx", "ReviewID": "R1RZDVMUSQRL3X", "Overall": "5.0", "Content": "Great phone. Camera is awesome and has many functions. Keyboard is a little hard on the fingers, but not a big enough reason to not get the phone. If you want to only use the wifi for internet, edit the \"connect using\" under the internet settings from connections. Edit the fields to nonsensical values, so it fails when trying to connect through the phone network. This will avoid you expensive data overages.Awesome phone, I got because I needed a camera as well. The internet browser can be finicky so just get opera mini.", "Date": "March 1, 2009"}, {"Title": "Amaing Camera Phone", "Author": "Diego D. Zaks B \"diegozaks\"", "ReviewID": "R201T57H6P33BZ", "Overall": "5.0", "Content": "This phone is great, I have been using it for a month, I upgraded from a Sony Ericsson k800i and it was well worth the upgrade! It might be more expensive than other similar phones, but the image quality is astounding. If you are used to Sony Ericsson, the menus and navigation will seem like a breeze.The only problem I see in this phone is that the navigation buttons are not very durable, so you might run into some problems with a lot of usage, also I have not gotten the included GPS to work (Google Maps does work though).Bottom line, if you take a lot of pictures, this is the best camera phone ou will find, amazing xenon flash, manual exposure control, smile shutter and all other features that come in SE digital cameras.", "Date": "September 23, 2009"}, {"Title": "Best unintended water-resistant camera phone out there", "Author": "W. L. Cummins", "ReviewID": "RAU7NF6OYK6YX", "Overall": "5.0", "Content": "Although the following is more a requiem than a review of the Sony/Ericsson c905 because it is nearly two years after the initial purchase, and now sadly after I've retired it, I wish to let whomever reads this know what a great camera phone the c905 is. I say \"is\" because they are still for sale new and used. And, finally, the reason I decided to write this review at all is because of the story in the last paragraph.I had thoroughly researched all the available camera phones out there in the fall of 2009 and ended up with the c905 because it was offered through Amazon from ATT for $.01 for a two year contract, but the offer was only good for one hour. At the time, the best prices for an unlocked c905 were between $400-$450, so 1 penny was too good to pass up. What I didn't know was how bad the service from ATT in my area was going to be, especially switching from Verizon from whom I had had great service for the previous eight years. But, this is about the phone, not the service provider.Although the phone came with GPS and internet access capabilities and many other great features, I chose a lesser plan, intending to use it primarily as a phone and as a camera. As a phone, it worked flawlessly, clearly, accurately, and easily. For instance, the dial buttons are big enough and spaced well enough for someone like me with big fingers. Ringtones could be downloaded and applied, and turning the ringer off and on was quick and simple. One feature allows the user to have the phone \"announce\" the name of the caller from the contacts, which I found to be a lot handier than having separate ringtones for different people. And though it's not strictly a texting phone, texting is easy because of the buttons. As a phone, it scored 5 stars with me!As a camera, it has to be unsurpassed in its class. Sony packed an 8.1mp juggernaut into a slide-open candy bar Ericsson phone. The features are as numerous as any straight-forward compact digital camera, of which I own three (all Canon's). (I also have a Canon D5, but we're comparing compacts here.) Light balance, color balance, 3264x2448 pixels, geo-tagging, face and smile detection, smart contrast, image stabilization, smile detection (with update), videocalling, xenon flash, and QVGA video at 30fps (unlimited time per vid). What's not to like? All this, and a great phone, and it's still smaller than two of my Canons. I've taken photos with this phone that are so sharp and clear that they easily blow up to 18 x 22 or 20 x 30. Poster size pushes the pixels, but is certainly do-able.A couple of weeks ago, while sitting in a hot tub in Poipu, Kauai under a star-strewn sky, I felt like I was sitting on something that I shouldn't have been. I emptied my pockets before I got in.... didn't I?? Oops! Too many mai-tai's, I guess. My c905 had been in 12-15 inches of 102 degree water for at least 10 to 15 minutes. I removed the battery immediately and slid the phone open to start to dry it out. I didn't try to fire it up until about five days later when we got home. When I did, I slid a back-up battery in, and Lo!, the blue lights came on! But nothing else. So next I held the start button down for the allotted time, and to my disbelieving eyes, my wonderful little camera phone sprung to life! Every camera and video feature works, including the zoom. All the numbers and contact data are just as they were before it went in the tub. I tested the memo recording feature: it works, but not as loud. And the blue lights are always on. Crippled, but not corrupted. Simply amazing. Can't say this will repeat for anyone else, but this is my story and I'm sticking to it.If I had to do all over again, I would suffer the dropped calls--more in the first six weeks with ATT than in the entire eight years with Verizon--because of that great camera. I am now back with Verizon with a new iPhone4, which is an all-around great tool, but the pix barely come close to what I got from my c905. If you're in a good ATT area and are looking for a great camera phone, get a S/E c905. Nearly two years later and still nothing on the market compares with the quality of that camera.", "Date": "May 5, 2011"}, {"Title": "A Not So Cheap Thrill", "Author": "D. Nguyen \"dancingduck\"", "ReviewID": "R16UBKAIEZUAGU", "Overall": "2.0", "Content": "I'm writing this review based on my experience with the c905 itself, however had the phone through at&t.;  First of all this phone has a great camera.. better than most camera phones being released now.  Within the first year of owning this phone I took quality photos from my hip.  Was able to sync it to my imac and upload photos and videos *yeah*.  Always had comments on it's design- \"it's a phone?\" Yup.  Besides the glam of the phone it had alot of struggles with it's interface.  A physical problem with the phone design for At&t; was it's data connection that square right in the center.  As a pocket phone person I randomly hit that button and it drove me up the wall.. (it's a slider-lock fail) I was looking up the weather and sports all the time.. what was a bonus to this was that I didn't have a data plan.. thanks Sony!  After my 1 yr. warranty passed which was really sad was the navigational button in the button to get through your options and menus was disabled. No not a software problem.. (hardware fail) if I pushed down on the scroll button it would exit the menu or any menu being accessed on the phone.  If I held it down it would turn the phone off.  No bueno.  I've purchased two additional batteries and head sets.  The batteries drain within a day.. with about a few phone calls.. Sony(fail) And to add some insult to injury At&t; isn't the best with reception.. dropped calls.  As you can read this has been a bad experience with something that I have on my person quite often.  Personally, (sorry Sony) I will try not to purchase your products due to the fact you're living on your name.. You may have had quality products in the past, but it doesn't mean you can rest on your laurels and provide semi decent products.  You also failed with a walkman I purchased.", "Date": "January 8, 2011"}, {"Title": "problem with the c905 speaker.", "Author": "Jeerawan R. Moranon \"jeerwan\"", "ReviewID": "RW854FTLJXZKW", "Overall": "1.0", "Content": "Got this sony c905 for my 17 year old son from ebay. the seller was chinasources. the ad read brand new unlocked. he loved it at christmas. december27 the speaker died. called sony, they offered to fix it, then sent it back as `warranty void, due to altered software' after calling to speak to the supervisor, he tells me that it was common for the model...the ear speaker. what a bunch of crock! if sony knows that the speaker was common with the unit, they sould have repaired it any way, right? if this was a car, there would be a recall. After a long devoted sony fan, this does tarnished the crown. Back to MOTO, NOKIA, BLACKBERRY, even SAMSUNG...BUT NO MORE SONY!  Vautier, Sony Ericsson managing director of the UK and Ireland has said Sony Ericsson understand there are specific quality issues on early batches of the C905 produced in 08 and Sony Ericsson rapidly implemented steps to resolve the issue such as speaker problems.If they now about the problems, should they offer to fix it no charge?  No...Sony in the United states wants $135 to fix there problem.", "Date": "January 26, 2010"}, {"Title": "Good phone with not so good camera", "Author": "Ashok Hebbar", "ReviewID": "R29N82JU19CVHA", "Overall": "2.0", "Content": "I have been using this phone for 2 weeks now and I find the picture quality of the camera is not so great for 8MP. I compared it with picture I took using my another Nokia E75 having 3.2MP camera and quality of both are same. Moreover, Zoom in C905 is pathetic. If I zoom more than 30%, image distorts. If I zoom full picture looks like dipped in water. Other features are ok.Update : I have been using this phone for 4 months now and the middle(click) button got stuck. It does not work. I bought the phone to India and Sony Ericcson India won't service it free as it was not bought here. Phone did not have US Warranty either. Now I have to spend more money on this phone to get this problem fixed.", "Date": "September 24, 2009"}, {"Title": "Don't buy this one", "Author": "QI ZHU", "ReviewID": "R3D2U2LFNYAZEN", "Overall": "2.0", "Content": "I bought this phone for my mom because she wanted a simple one. It got echo sound when the speaker was turned on.", "Date": "March 12, 2014"}, {"Title": "Phone was good", "Author": "dbjjgibs", "ReviewID": "R28JCYJMMGHW58", "Overall": "4.0", "Content": "This was a replacement for the same phone purchased 4 years ago.It must be a bit different model because the menu options are not quite the same.Phone suits the purpose, having good camera and easy to use without being asmart phone for husband who wanted a phone for good quality pictures and phone calls.Definately was repackaged, scratch on the phone and there was no book or directions exceptfor a new Sony smart phone.  Good thing we did not need the CD or book.", "Date": "August 2, 2013"}, {"Title": "Phone in good shape, lots of features are not working for me.", "Author": "Kdolivia", "ReviewID": "R2LEQVF4O57Y3", "Overall": "2.0", "Content": "Can not send or relieve picture messages, I have to enter a unlock code every time the phone is turned back on after off. Overall not to thrilled but after all the trouble I have gone through getting a phone I'm just gonna stick it out. Seller was very quick to answer emails when I had questions.", "Date": "August 11, 2012"}, {"Title": "My all time favorite phone", "Author": "Patti Wilson", "ReviewID": "R2C36F78N3KHMB", "Overall": "4.0", "Content": "I've owned my Sony Ericson 905a for several years and I would be lost without it.  Mine now has several little things wrong with it so I am looking for a replacement but I have no interest in changing to a different phone.  As a photographer, the 8 plus mega-pixel camera comlete with zoom, that fits in my pocket was, and is, the main attraction for me.  It takes fabulous pictures and even has many photo features found in cameras that are rarely seen in phones.  Several shooting modes including: panorama, and fancy frames are available;scene options include: beach, snow, sports, documents,twilight landscape and portrait, face detection, macro, the phone also offers red-eye reduction, multiple white balance options, and effects such as: black and white, negative, sepia, or solarize, It even has a self timer, and a flash with multiple options.  For me, a cell phone is something that is always by my side so with this phone, it means I also have a decent camera always available! I love it.", "Date": "June 13, 2012"}, {"Title": "The Sony Ericsson C905", "Author": "Sunny", "ReviewID": "R1QC1OGILEMHES", "Overall": "2.0", "Content": "Phone Generates lots of heat while talking and battery charging is very low (may be hardly 2-3 hours). Positive side of the phone is camera and music player.", "Date": "April 26, 2012"}, {"Title": "Great all around phone, OS is getting a bit dated now", "Author": "Sam Hartford \"Sam Hartford\"", "ReviewID": "R3DQAQFGOPDWMG", "Overall": "5.0", "Content": "This is a wonderful phone and it takes amazing photos, which is why a person would by this thing. Not only does it have an 8MP camera, but the quality is what is key here, and it rings true.It has a partial touch screen, a back slider for the camera to take photos and pretty much does anything you could want these days on a phone. If you have an android though, the OS on this is going to feel weird. However, Its hard to knock this phone otherwise.Best things: Amazing photo's, geo tagging, music functionsWorst things: price is a bit high, as all Sony products are.", "Date": "December 16, 2011"}, {"Title": "Chintzy chinese plasticy junk, disgrace of a phone", "Author": "Shawn \"Shawn\"", "ReviewID": "REIGV150A9D8Q", "Overall": "1.0", "Content": "The good------------Phone speaker sounds great for playing music, better than any phone I've heard- doesn't get that loud though.The camera takes the best pictures of any phone I've ever seen, better than most digital cameras even.Music sounds excellent when you hook headphones up to it.. way better than iPhone or any android. Unfortunately, you'll need to buy a special adapter because of SE's stupid proprietary jack in order to use your own personal headphones with a 3.5mm connector. Also, the sound starts to get distorted if you turn it all the way up (which is where you'll have it most of the time because it doesn't get very loud).The bad---------AWFUL to text on- the keys have no feedback at all and it's easy to press two at the same time. Also there's a raised plastic ridge at the bottom of the phone that makes it difficult to press the bottom row of buttons with your thumbs. Camera's great but the photo browser on the phone is terrible- when scrolling though photos in fullscreen mode, you see a distorted, low-quality pixelated version of the image, and it seriously takes 3 - 5 seconds (I'm not exaggerating) for the phone to load the full high quality photo.Chintzy plasticy build quality.. after only two months use, the thin plastic sticker on the side of the phone that holds in the volume and shutter buttons was peeling off. My volume rocker fell out of the phone and was lost. Ergonomically, the phone is not comfortable to hold while talking on it, and especially while texting. The call speaker does not get nearly loud enough.. I found myself pressing this phone forcefully into my ear even when there was no ambient noise. Using the phone in landscape mode is totally pointless because less than half of the interface actually works in that mode.Internet browser is awful, don't even bother... video recording sucks.. 352 x 240.. really? Landscape auto-rotation rotates at the most inappropriate times, which is especially annoying when using the music player because when the screen rotates, the buttons do different things-- imagine you're running on a treadmill trying to change songs and the orientation keeps flipping back and forth because the phones vibrating in your hands.. those were times when I just wanted to crush the phone in my hands and stomp it to death. Very aggravating.Charging port connection was constantly loose from the day I got it- either my phone would not charge some nights, or when listening to music, if it was bent even slightly, the audio would cut out. Also, this phone gives you an INCREDIBLY ANNOYING message that says \"Be sure to unplug your charger to save electricity!\" every time you unplug it from the charger, or the connector becomes momentarily loose.. the message can't be disabled, and it makes you stare at that message for 3 - 5 seconds before it goes away (the whole time you're just waiting to see what time it is, but the message obscures everything).Overall, the interface is slow, clunky and not user-friendly, every keypress brings up an hourglass in the center of the screen. It takes way too many key presses to view a text message you just received, and if you like texting two friends at the same time - on this phone- forget it. The conversation mode view is only somewhat useful- if the message is very long, it cuts off, and the font is so huge you can only fit one message on there at once, which means lots of scrolling. Lastly, this phone has the worst battery life I've ever seen on any phone. The battery lasts less than one full day even with light to moderate use! I thought maybe my battery was just defective, bought a new one- no improvement. I've never owned a phone I had to periodically charge throughout the day like this one.This phone only lasted me about 3 months before I tore it apart in my hands because of what a piece of crap it is. This phone has an excellent camera, but unfortunately, that's all it's got going for it. My first sony ericsson phone was excellent (S710a.. I still have it), my second and third phones have been junk. I'm going back to my iPhone. Stay away from this disgrace of a phone. I promise you'll regret buying it.", "Date": "November 27, 2011"}, {"Title": "What an dissapointment !", "Author": "C. Chu \"Phil\"", "ReviewID": "R1KA61VZY79OP2", "Overall": "1.0", "Content": "Got this phone from an HK based vendor from Ebay. The manual seemed to be made and printed with carelessness which made me think that this phone might be a knockoff. But after careful examination of the phone, I think it's genuine. I bought this phone because a website recommended it as an good camera phone. I think the photo quality was OK but still not as good as a quality digital camera. The battery time is horrible especially if you have it connected to an bluetooth device. The buttons feel sticky and are not sensitive enough for pressing. Oh, one last thing, this phone broke after 5 months after I purchased it. The screen died even though I can still make / receive calls. No more Sony Ericsson cellphone for me.", "Date": "January 4, 2011"}, {"Title": "Squandered potential- avoid Sony Ericsson phones", "Author": "Karen", "ReviewID": "R3RU8G6GJMG92E", "Overall": "2.0", "Content": "There are many things I like about this phone- the 8 MP takes great pictures, with many added feature options, and the phone functions ok as a phone.  However, the proprietary charging port connector, which doubles as the USB connector and the headphone, is absolute garbage.  The USB connector cable that comes with the phone direct from Sony Ericsson crumbles after very little use and connecting it becomes a matter of luck more than anything else. I fear that the AC charger will follow this failure route in short order.  The Menu, 9, and * buttons randomly stopped working after about 9 months of light use.  An attempt to \"Repair the Phone\" with the free Sony Ericsson PC Suite softare did not help and in fact removed the capability of the phone to connect to the software in \"Phone Mode\"!  Now I am unable to connect to do things like backup my contact list from the SD memory card, etc., and I still can't change options and access the menu key. And now I can't even call anybody that has a 9 in their number because it wiped all my contacts for speed dialing, and the 9 key still doesn't work! SE's web site is no help whatsoever, as they do not maintain a useful troubleshooting guide nor even a useful user forum. And while the phone offers useful Walkman-type functions as a big part of its features, it does not come with any headphones and the headphones that you can buy don't work well anyway, because of the terrible proprietary connector.  This phone has a lot of potential but they squandered it with a lousy multifunction connector, and buggy software.  This is my third Sony Ericsson phone- the first one was good, the second one stunk, and I gave this third one a chance to redeem themselves, but they failed.  (On the second one I owned, a W760, by the way, they refused to honor the warranty because they claimed it had been damaged by water, even though it had absolutely never come in contact with any liquids.)  I'm not buying a Sony Ericsson again and I'd recommend you stay away.  And I'm saying that even though I own stock in Sony Ericsson that I bought long ago!", "Date": "January 8, 2011"}, {"Title": "v. good camera;  not a great smartphone", "Author": "SF Guy", "ReviewID": "R176AFZRBTHNVR", "Overall": "4.0", "Content": "This camera takes excellent photos, as promised.  The reception on the phone is also very good.  I like the interface better than any Windows Mobile phone I've used.  However, this phone does not have the synching capabilities of a Blackberry.  With 2000 contacts in my outlook on my PC, this phone won't synch them...  \"too many contacts.\"  Also, accessing the calendar is a pain, ... 3 menu screens.  That just isn't right.The standard smartphone capabilities are an afterthought on this phone.  Camera + Phone, yes!  Calendars and contacts?  No!", "Date": "September 4, 2009"}, {"Title": "horrible camera, horrible signal, bad battery life", "Author": "A. Leonard \"die-hard sony\"", "ReviewID": "R3SR6MH5HQSA0N", "Overall": "2.0", "Content": "I have had my c905 for 3 days and the camera is blurred permanently through no abuse from me. And the signal is weak. Using the camera once, talking on the phone for 5 mins, and texting a couple of times had my battery down to half.I would not suggest this phone to anyone. I am headed to ATT tomorrow to replace it with a different phone.", "Date": "January 11, 2010"}, {"Title": "Good and Terrible", "Author": "Inventor \"InventorNC\"", "ReviewID": "RU1UDQQUFJJQJ", "Overall": "2.0", "Content": "I got the C905A AT&T; locked phone.  (I will get AT&T; to unlock this phone in two years when its contract is up.)The phone and camera is fun.The instructions are deplorable.  Someone fired any talent they might have had in the instruction manual department for sure!  Maybe this is a result of meddling by \"the NEW AT&T;\", I dont know but someone made an unholy mess of the owner's manual.  Undefined terms, sloppy wording that is inaccurate, features not mentioned and other features with major subfeatures missing.  For example there is no mention of MP3 anywhere in the manual and yet you can load songs with ease and the phone will play them.  Instructions for operation of the volume control is wrong.  Reference to \"hands free\" which term they dont bother to define:  \"plug in the hands free\" to make an antenna for the FM.For the big money they ask for this phone I am disappointed.", "Date": "September 11, 2009"}], "ProductInfo": {"Price": "$249.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 2100 UMTS/HSDPA plus GPRS/EDGE capabilities\nSlider phone with 2.4-inch screen and accelerometer for auto-rotate; 8-megapixel autofocus camera with xenon flash; GPS for navigation and image geotagging\nWi-Fi networking; Bluetooth stereo music streaming; Memory Stick Micro (M2) expansion; access to personal email and instant messaging\nUp to 9 hours of talk time, up to 380 hours (15.8 days) of standby time\n3G-enabled Cybershot camera phone with 8.1-megapixel lens, flash, 16x digital zoom, image stabilizer, sharing with blogs and Facebook\nBluetooth stereo music; digital audio player; M2 memory expansion; access to personal email and instant messaging\nUp to 3.5 hours of talk time, up to 350 hours (14.6 days) of standby time", "Name": "Sony Ericsson C905a Unlocked Phone with Wi-Fi, 8 MP Camera and GPS - Unlocked Phone - International Version - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51RNdhkWw4L._SX300_.jpg", "ProductID": "B001JL8FII"}}