{"Reviews": [{"Title": "Good, inexpensive phone", "Author": "J. Hernandez", "ReviewID": "RX51E2CVP32X6", "Overall": "5.0", "Content": "I was spending too much for cell service being I am a lite user. So I set out to buy the least expensive phone available and \"pay as I go.\"  The Motorola W175 was the cheapest phone I could find. I paid $15 for mine and got \"double minutes for life.\" Which is really just a sales gimmick. Otherwise minutes from Tracfone are overpriced. You can buy a double minutes option from them, but that stand alone purchase is $25. I got the phone, double minutes for life, 20 mins of airtime, and 2 months of service for $15. You should get a similar \"starter\" deal. The Motorola W175 phone on sale here is NOT a double minutes for life phone, by the way. Just FYI.As others have said, this sort of \"pre pay\" deal isn't for the heavy phone user...or even the modest one. This is more for people like me who use their cell phone sparingly, and may even go days at a time without using it at all. And if you do have conversations, they are short. I mean think about it...a half hour conversation costs $3 to $5 with Tracfone. Depending how you buy your minutes. So if you have several or more of those half hour conversations a month, heck, you can get a pre payed \"no contract\" plan via Straight Talk with 1000 mins and 1000 text included...for $30 a month. Straight Talk is owned and run by Tracfone, btw. And Virgin has unlimited talk and text for $50. With Tracfone you get no \"mobile to mobile\" or \"nights and weekends.\" You simply get what you pay for. No ups, no extras.So Tracfone (and the similar Net10) is for people who use the cell phone 5 minutes here, 10 minutes there...a couple minutes a day to talk to the kids, maybe? Or  to have a phone around \"just in case.\" Maybe let the kids use it on sleepovers, etc. To \"keep in touch\" with home.So far as the phone itself...its plain, sturdy, has good build quality, and looks decent next to similarly styled Moto's. It has a loud speakerphone, a big text display, and keeps a charge well, also. The menus are simple and well laid out.  It makes calls, takes calls, sends text, receives text. Thats it. The buttons feel nice, and it looks better in person then in the pictures. It is a simple, plain phone. 4.5in high, around 1.7in wide. Nice candy bar sized phone, lightweight but not cheap feeling. Service is reliable so far, good connection, calls are clear, none have dropped. The phone seems to get a strong signal here in the L.A. area, however it does take two or three minutes to find the signal when you power on the phone from OFF. I don't know if that is a phone issue or a network issue? But its not a big deal to me.For the phone, double minutes for life, 3 months of service, and 140 mins of airtime, I paid $30 total. Thats enough for me for a month and a half...maybe two. And if I need more minutes I can get more for a little bit of cash anytime to add to the phone.  Pay as you go. It suits me fine. I was paying $50 a month before for a phone I hadn't used much in almost 3 years. So this is great for me.", "Date": "August 10, 2009"}, {"Title": "Cheap, Dinky, Little Cellphone Packed With Surprising Features", "Author": "Miz Ellen \"all the letters of my real name\"", "ReviewID": "R14TBGXA1QKXS9", "Overall": "5.0", "Content": "The one thing the package doesn't tell you is that the phone needs to be charged for 5 hours before one can activate it or use it.  That was okay; I didn't need it right away but it proves that even with an \"emergency\" cell phone a little pre-planning is needed.Once I had it charged up and activated, it proved to be a handy way to have a \"local\" phone number while on vacation. Despite the affordable price, this cellphone comes with a full bank of features including caller ID, texting and the ability to store and auto-dial frequently used numbers.  One buys a chunk of minutes either on a card in a store, from the Tracfone website or by calling Tracfone's number.  Every time more minutes are loaded on the phone, the service period gets extended so one can chose to keep this \"temporary\" cell phone going for as long as one wants.  The service expiration date shows on the screen along with the time of day and how many minutes of time left.The audio quality was excellent and there have been no dropped calls.  When I changed time zones the phone updated the time display instantly.  I'd recommend this as an excellent way to try out a cell phone for a child or senior citizen, to have an emergency or backup phone and to have a \"local\" phone number for a place where you frequently vacation.", "Date": "April 28, 2009"}, {"Title": "great basic phone", "Author": "********", "ReviewID": "R3SSHXUTTRKBKS", "Overall": "5.0", "Content": "PRO:-great battery life-great call quality-great speakerphone-great reception-holds a lot of text messages-holds a lot of contacts-can hold contacts on the phone or the sim cardCONS:-only one phone number per contact-cant send a text message to an email address", "Date": "May 15, 2009"}, {"Title": "Does the job!", "Author": "shandysgirl", "ReviewID": "RWWJMDSD156WR", "Overall": "4.0", "Content": "I purchased the Tracfone for my brother to use while he was visiting us at Christmastime.  Since he lives and teaches in Japan, his Japanese cellphone would not work here in the states so I got the Tracfone a few weeks before his scheduled trip and shipped it to him.  This way he'd have a phone with him once he got to the airport in the US.  It was soooo easy to work with, set up online, enter names and phone numbers and add minutes to!  I was very impressed!  The only small problem that I had was getting the battery cover to click into place securely.  Since my brother never mentioned it as having been a problem while he used it for two weeks, I'm guessing it stayed on even though its \"click into place\" feature seemed a little sketchy.  We intend to keep it as a backup for emergencies now.  Great little phone!  With more bells and whistles that I expected it to have for the price!", "Date": "February 6, 2010"}, {"Title": "Good for the basics.", "Author": "music3101", "ReviewID": "R2IED6HWMXRPBV", "Overall": "4.0", "Content": "I've had this phone for three years ever since my old Tracfone quit on me, and it hasn't had any major problems yet. It's a very basic phone; you can text message, call people, etc., but there is no web access, media storage, etc. You can't receive or send texts with pictures in them either. So get this if you just want a phone that performs all the basic functions, nothing special.One very awesome thing about this phone is that it is very hard to break. I call it indestructible, as I drop it on the concrete all the time, thrown it across rooms, and even dropped it from the top of the stairs to the floor below, and it does not break. The back opens and the battery and SIM card will fall out, but the screen has yet to crack and it has yet to stop functioning.The only problem I've ever experienced with this phone is that it will sometimes mix up your text messages in the order that they are sent.Other than that, this is a good phone, but if you are considering buying this for your teenage son or daughter, you can expect them to complain because it doesn't have any of the cool features in many phones today, and the design is rather simple, with no QWERTY keyboard or touchscreen.", "Date": "November 23, 2010"}, {"Title": "Exception that Proves the Rule", "Author": "JoJo \"WhiteGardenias\"", "ReviewID": "R2NRKHLIRW1HSE", "Overall": "1.0", "Content": "My experience with this phone was all bad.  Apparently I got the Lemon.  The one I received never worked.  Reaching Tracfone for help was no easy matter.  What was worse, I was blamed for the problems I was having, and I had to call several times before I got a new battery mailed to me.  That did not help the problem.  Rather than waste any more time, I threw the phone away and lost my minutes.  That is one good thing about Tracfones....they are cheap enough that you can do that!", "Date": "April 10, 2010"}, {"Title": "Good basic phone", "Author": "etacarinae", "ReviewID": "R3IRFWLIZO6J53", "Overall": "4.0", "Content": "This phone replaces my C-139 Tracfone which I had for 4 years.Got this at the drug store for $9.97 after my speaker on my C-139 started to weaken.One..... the tone rings sound so much better on this phone than my C-139 which were horrible.Two....this has a speaker phone my C-139 didn't have any.Three....This phone can store up to 500 contacts my C-139 could store only 100.This phone could talk up to 6.5 hours similar to my c-139. the signal and call quality are also very good similar to my C-139. the standby battery life is not 18 days like they say on the package however 6 days is more like it which is still very good. Moto always exaggerate's their standby time.The one bad thing about this phone its it keypad they are tightly bunched and slippery and must be hit directly straight on for them to register on the phone. Not good if you have big fingers.Other than that I very happy with this phone. It may be a little longer than what I would want had to get a new belt pouch for it wouldn't fit in my C-139 belt pouch.But found this to be a worthy replacement for my C-139 and for $10.00 bucks its a good deal.", "Date": "February 5, 2011"}, {"Title": "Happy Halloween!", "Author": "A. Tweedle \"Tweety-Bird\"", "ReviewID": "R1A8GQFYCNFAB4", "Overall": "5.0", "Content": "This phone made the perfect gift for my little sister for Halloween. My mom got it for her - by my reccommendation. Now when she's trick or treating with her friends, my mom can stay in touch with her throughout the night, for a great low price. The phone works great and the Tracfone service even better. Big savings, a great deal, and a safe kid on a night of mischief - it's perfect!", "Date": "October 18, 2010"}, {"Title": "Great little phone", "Author": "THOMAS TAYLOR", "ReviewID": "R1GZ8630PXUK67", "Overall": "5.0", "Content": "I bought this for $9.99 plus another $19.99 for 3 months of airtime.I purchased this Tracfone for several reasons.  Emergencies. I am disabled and if I have car trouble while I'm out and about, I have my phone to call for help.I also have fallen a few time & need help getting up. Now, I have the peace of mind that help is just a button away as they have a button to push to connect you with 911.I really like the speaker phone that this model has which makes it much easier to talk to others.I am also going to purchase another phone so I can keep it my bedroom.I love the fact of no contracts or commitments. You just buy minutes as you need them.These are well worth the price & provides security and peace of mind!", "Date": "December 21, 2012"}, {"Title": "No frills phone - Loses tower connection", "Author": "Cale E.", "ReviewID": "R3DXCOVSYPOUIX", "Overall": "2.0", "Content": "This is a basic wireless phone, without many extras. It performs OK, with one exception: It often has trouble deciding which tower to connect to. You will try to make a call, and get an error message, \"Check Service Area or Provider.\" To resolve this, you must go to the menu, settings, and \"Change Band Selection.\" Then it takes a couple minutes to find the correct tower.", "Date": "April 9, 2011"}, {"Title": "Great for first cell phone!", "Author": "Momma Hen", "ReviewID": "R17VJQVVUFRFRP", "Overall": "4.0", "Content": "This cell phone is a great first phone. It dosen't have a camera, it can't go on the internet... but it is a great cell phone for a child maybe 8-10 years old or if you don't want all the high-tec stuff. You don't even need to read the manual because it's so easy to use. It's indestructable; my son has dropped it multiple times on the pavement, still works like a charm! I do reccomend it!", "Date": "February 12, 2011"}, {"Title": "Great item for it's purpose", "Author": "Cherrone", "ReviewID": "R30DS2347PS4KR", "Overall": "5.0", "Content": "Bought this for my 9 year old because he has autism and can wander away often. It is very simple to use & I add minutes only when I go on outings. It certainly serves it's purpose & I'm very pleased with my purchase!", "Date": "September 17, 2010"}, {"Title": "Great little basic cellphone...", "Author": "rdb61554", "ReviewID": "R2CJ65U05VEP63", "Overall": "5.0", "Content": "I like this particular little phone, because if lost you aren't out much money wise and it is extremely reliable. I ordered it and got it within days of the order.", "Date": "November 2, 2013"}, {"Title": "not worth buying", "Author": "Aronicum", "ReviewID": "R1DW5TT5TT4BY1", "Overall": "1.0", "Content": "This is an older, very basic model.  It doesn't have the double-minutes feature which all current Tracfones have (the more expensive ones have triple-minutes).  I can't think of a reason why someone would want to pay the current Amazon price of $30 for one of these, unless for some obscure reason you had to have this specific model.  I don't recall the retail price of this phone but I'm pretty sure it was less than $30, maybe $15 or thereabouts.  There's a Family Dollar store I go to that has these on clearance for $5, and that's about the right price.", "Date": "August 10, 2013"}, {"Title": "Runs on AT&T; towers only", "Author": "K. Gomes \"Kyle Gomes\"", "ReviewID": "RL5HH8LUGNSOM", "Overall": "1.0", "Content": "I like the functionality and look of this phone.  However, I live in the mid-west, and there is squat for AT&T; coverage in this area.  Phone was rarely ever able to get a signal.", "Date": "March 26, 2013"}, {"Title": "Worked out great.", "Author": "Mr. Moto", "ReviewID": "R8PE6OT5RCFM9", "Overall": "4.0", "Content": "This product filled the bill for my situation.  I'm a Motorola engineer, and my youngest child had been bugging me and making the case for her first cell phone.  She looked around at styling and decided she liked this one.  The vendor shipped it out to us on time (birthday gift), and the Tracfone arrangement worked well.", "Date": "July 24, 2012"}, {"Title": "Basic cell phone", "Author": "bf", "ReviewID": "R33BDFB1A7QBKJ", "Overall": "4.0", "Content": "I was looking for a cheap basic cell phone which this is.  The only negative so far is that the battery does not last nearly as long as the Nokia cell phone I replaced.", "Date": "July 22, 2012"}, {"Title": "Motorola W175 prepaid tracfone", "Author": "Don Huffman \"TheCircleDancer\"", "ReviewID": "R3ELNWPG31ORII", "Overall": "5.0", "Content": "I have owned my W175 for at least ten years. It is my first cell phone. ( I since have added a tracfone LG840g but I will return to this ) I never tried to use this w175 for a hammer, but the durability of it is real good. But here is the point: mine still charges me by the second, not the next full minute. ( the 840 ; next full; w175 -2x minutes; 840-3x minutes. )I buy the cheapest card and at 2x we are talking 6 cents per minute. Keep the thing loaded. I have 4899 days and have let it slip to 10 minutes. Panic and get my hands on a card.Buy a new one and the by-the-second- option  is likely not your option. Want a good loyal companion? This is a very good bet.You can text with this but it takes one half ( 1 /2 ) minute per so I generally do not. Given the durability, you might buy a \"Double Minute\" card or shop around for one that is set up that way. I did buy a back-up battery and charger from amazon at one point. cost about ten bucks. There are a few things in addition that can be done with this phone but I do not frankly use them.And my second cell is tracfone. Tracfone lets you carry over minutes. That should tell you something as well. I am in no way benefitting from this review, no affiliation to tracfone, and I could use a job. Do your homeowork.And the 840 ? I am glad I bought it. $20.00 at Dollar General, on sale, I had done my homework and amazon is a place for that. And I am not affiliated with amazon and I could still use a job. Once I learn how to use this new one I will like it better.I will keep using my 175 until it gets ripped from my cold dead hand.", "Date": "February 22, 2014"}, {"Title": "motorola w175", "Author": "gangster", "ReviewID": "R28Q229IO71QIJ", "Overall": "5.0", "Content": "I like this phone. I had one, was pleased with its features. I am enjoying my new phone from amazon", "Date": "February 13, 2014"}, {"Title": "Good Product", "Author": "RED DRAGON", "ReviewID": "RNVLNZIM7FVIU", "Overall": "5.0", "Content": "I'm old school. Don't need a smart phone distracting me. If you want to make/receive calls, store up to 500 contacts, text, and have a phone that's very well built, then this is the phone. Some phones at this cheap price only store 200/250 contacts and have very limited functions. Motorola thought about this one before they designed it. Also, with some of the cheap phones, you lose calls because of a week signal, not with this phone. Very clear reception. So if your like me, and just want a phone for calls and texting, and don't want to spend a lot of money, and can tear yourself away from the internet on your phone, this is the one. Good Luck!", "Date": "January 10, 2014"}, {"Title": "trac phone", "Author": "Richard H. Bowser \"parasite\"", "ReviewID": "R5QQ9SJ3LX9WJ", "Overall": "5.0", "Content": "i ordered and recived my phone quicker than i expected. and am yery happy with it.", "Date": "September 28, 2009"}, {"Title": "trac fone", "Author": "pita", "ReviewID": "R3KNMA8AYN79GD", "Overall": "5.0", "Content": "as always, never a problem when i deal with amazon. phone is what i expected.", "Date": "October 12, 2010"}, {"Title": "Cell Phone Case", "Author": "S. I. Rubin", "ReviewID": "R2IXQTIY4U8GC8", "Overall": "3.0", "Content": "The case is very well constructed, but the belt attachment and adjustment swivel for vertical or horizontal suspension is somewhat bulky and adds considerable weight to the case. A simple tunnel-like loop would have earned the case five stars.", "Date": "July 19, 2010"}, {"Title": "A ghost product", "Author": "Schychof", "ReviewID": "R31ULTFWKUZJ3Q", "Overall": "1.0", "Content": "I can't review a thing that i didn't receive. The dealer (ExpressMegaDeals) sold it, send the USPS code for track and the product... nothing!After a month he said to me he didn't found the USPS track code in the USPS web site, so the Amazon refund me.", "Date": "December 13, 2010"}], "ProductInfo": {"Price": "$12.82", "Features": "Prepaid, easily pocketable candybar-style phone with extra-long battery life\nPay for only the calling time you use with minutes purchased from Tracfone--no annual contract required\nStores up to 500 contacts, one-key access to text messaging, calendar, currency converter\nUp to 6.5 hours of talk time, up to 432 hours (18 days) of standby time\nWhat's in the Box: handset, battery, travel charger, getting started guide, user manual", "Name": "Motorola W175 Prepaid Phone (Tracfone)", "ImgURL": "http://ecx.images-amazon.com/images/I/41TfAQjOe4L._SY300_.jpg", "ProductID": "B001B1APMA"}}