{"Reviews": [{"Title": "Great product with one minor drawback", "Author": "Emmanuel H. Joseph", "ReviewID": "RQOEDM10WSEU2", "Overall": "4.0", "Content": "The phone is a great product. Battery life is excellent. I've gone three days full without recharge with heavy useage of the FM Radio, Music and talk time and only now seeing the battery colour change from blue to green. (colour changes according to battery strength: blue = good to excellent/fully charged; green = medium level; red = time for recharge). Does not support MicroSDHC cards but if you can find an 8GB MicroSD card, you're well on your way.The overal feel of the phone is good, nice large 3\" screen to view your photos and videos. Picture quality is good as well for a 3.0 megapixel camera.Supports dual text input (querty onscreen keyboard + manual key input like that of basic phones). There are a lot of features that I like including auto off and auto on. Supports phone lock. While it doesn't support voice or picture dial, it makes a great companion especially as it supports two sim cards meaning one can simultaneously run two different phone networks from two different providers on one phone.Drawbacks:1. The unavailability of software to use the com port as a dialup modem especially in areas where one may not get internet while travelling. I haven't done a comprehensive search as yet but it looks like it may be emulating one of the samsungs. Somehow it is identified on some computers as a samsung (the removeable drive part that is). If I find something, I'll be sure to update this review. That's why I stopped short of giving it a 5 star rating.2. mp4 support is spotty. Depending on the encoder used, you might have problems playing back. So be sure to check carefully what encoder is used. It's best to stick with avi.It does come, however, with a spare battery, microphone/headset combination headphones (could be a bit more dynamic) usb charger both for wall and pc.Finally, bluetooth speeds are exceptional. This completely blows away my Motorola W510 in terms of bluetooth speed transfers. That alone is an added bonus. All in all, a good phone and I'm satisfied with my purchase.", "Date": "April 25, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001S08XSC"}}