{"Reviews": [{"Title": "It died", "Author": "C. Brown", "ReviewID": "R1SH0EEHJHB1J0", "Overall": "1.0", "Content": "It worked great when I got it, but then it started freezing and had to be reset all the time. Every time my mom called and left a voicemail my phone turned off. Then it got to the point where it stopped charging. I'd have it hooked up to a charger for 10 hours and it'd turn off within an hour of being charged because the battery was dead. Every Samsung phone I've ever purchased has died on me", "Date": "November 6, 2009"}, {"Title": "Wonderful phone!", "Author": "A. Anderson", "ReviewID": "R25P17IBHFTTUA", "Overall": "5.0", "Content": "This phone is absolutely ideal for an all purpose yet compact unit. The music player feature is fantastic and supports up to 2gbs of music (it came with a 1gb SD micro card), the built in speaker is loud and easy to share music with or enjoy it on your own. The Bluetooth playback over stereo headphones is fantastic quality and easy to use!Many of the features on the phone are well design and incredibly easy to use, controls that first seemed somewhat bulky and obnoxious to get a hang of were easy to learn and the functions even more powerful and customizable then what I was used too before hand. The battery life is absolutely excellent and will last many, many hours in playback mode.All in all, a fantastic phone. You can still get it as a free upgrade for the 2 year renewal and with a new T-Mobile account and its worth it. The phone design is so nice and compact and it alleviates the need to carry a cellphone and an extra mp3 player in one sleek, sexy package.I can't recommend it enough, fantastic phone!", "Date": "July 24, 2008"}, {"Title": "Great Phones for the price.", "Author": "A. Nguyen", "ReviewID": "R3N19Y735POVVJ", "Overall": "5.0", "Content": "It works great. Loud speakers, Quadbands meant can be used anywhere in the world with GSM network.", "Date": "June 10, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001242YFW"}}