{"Reviews": [{"Title": "Nokia 6220 Classic", "Author": "Purpleairplane", "ReviewID": "RSO3IDM682UQR", "Overall": "4.0", "Content": "I upgraded from a Nokia 6233 to the 6220 Classic recently and haven't looked back. The main feature for me was the inbuilt GPS. As I was considering buying a GPS unit, it made perfect sense to get a new phone with the GPS built in. It does a great job, I've got mine stuck to the windscreen in the car which is where the best signal is achieved. The screen on the phone is nice and bright, the camera is great, and the text to speech reader is very handy when you can't look at the screen e.g. for new messages. The only drawbacks would be that it's a tad small for people with large hands, and the plastic casing could have been much more sturdy. The 6233 has much better stereo speakers, however the 6220's loudspeaker does the job. All over a good unit.", "Date": "July 18, 2008"}, {"Title": "good stuff", "Author": "Heidi Lee", "ReviewID": "RZHZZ7LBZZZOV", "Overall": "5.0", "Content": "I got the purple one. I mainly wanted a good camera that I would always have with me and would always be charged and the only way to ensure that was the case was to have it on my phone... The camera's pretty good. I have pulled it out and taken pictures in many situations that would have just passed me by since I hadn't been expecting anything worth photographing to happen. I use this thing as my ipod too. It's nice because I don't have to carry headphones everywhere, I can just use the builtin speakers. I am thinking about getting bluetooth headphones for it... Sadly, my keypad seems to be dying on the left side. I've only had it for a few months. I had to change it to always unlocked because I couldn't get the thing to register the * key to unlock the keypad... then the number keys down the left side crapped out... It's odd though, when they work, they work for awhile with no problem... it's like the phone forgets to pay attention to what's going on on that side, but once you remind it, it's all good for a bit. I'm hoping this problem is unique to mine though, and provided it's not a common problem, I totally recommend this phone. Though, as the previous reviewer stated, the casing is very flimsy.", "Date": "December 8, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and International 3G compatibility via 900/2100 UMTS/HSDPA plus GPRS/EDGE capabilities\nA-GPS support with buil-in Nokia Maps for navigation; 5-megapixel camera/camcorder with Carl Zeiss optics and xenon flash\nBluetooth stereo music; MicroSD expansion to 8 GB; digital audio/video player; FM radio; organizer; access to email with document viewer\nUp to 3.5 hours of talk time and 250 hours of standby", "Name": "Nokia 6220 Unlocked Cell Phone with 5 MP Camera, GPS, Media Player, International 3G, MicroSD Slot--International Version with No Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/4146Xn50TDL._SY300_.jpg", "ProductID": "B001CP5JNK"}}