{"Reviews": [{"Title": "Overdue", "Author": "N. Bontrager \"Sentinel\"", "ReviewID": "R3TD9BKVHQAWYZ", "Overall": "5.0", "Content": "The ONLY gripe I have with this phone/order is that three years ago when I purchased the phone it was nearly twice the price (hey, I love razrs). I have owned more than four different razrs and this one was the best that I had had. Yes they are highly customizable but the interface on this one as well as it's capabilities beat all right out of the gate. Sound quality - in regards to being heard, hearing, and even the ringer were all great. Vibrating function was loud/strong enough. Display was bright enough. The typing input was worthwhile (anyone who has used several phones knows that sometimes you get a phone that you simply can't stand typing on - not all flip phones come with T9) And while traveling up and down the east coast that year I was never without signal. Currently I plan on trying out a straighttalk sim card in this phone when it arrives on thursday.All in all,If you want a nice slim phone and don't need internet browsing or apps, this phone is awesome especially now that it has been marked down. Also, if you simply need it as a back-up phone then what better than something of such slim profile?Of the Wireless Emporium company itself, I had one issue with the order. It has been three years so I can't remember off the bat what it was but it wasn't too big a deal. I sent them an e-mail and they responded promptly.If my current razr breaks again I may plan on purchasing another. And if I do, I certainly have no problem purchasing from Wireless Emporium.-Nico", "Date": "March 13, 2012"}, {"Title": "Great Phone", "Author": "Jez", "ReviewID": "R3SVB287ID2TKP", "Overall": "4.0", "Content": "I bought this phone because I needed a secondary phone.  I have previously owned a V3i and was completely satisfied with that phone thus swaying my decision to get another.Battery life is Great and the Sound Quality is Good - it's not a music phone but it does the job -If you're not into all the smart phones then this is a good phone for you. It has just enough features to be enjoyed.", "Date": "December 3, 2011"}, {"Title": "NO PROPER CHARGER", "Author": "mamamichelle", "ReviewID": "R3UJ4A3R010PSX", "Overall": "2.0", "Content": "Very scuffed on both screens, outside screen and keypad looks like they were coming off and the charger they included would NEVER work for this model, but a current android...and this was advertised like new...", "Date": "December 28, 2013"}, {"Title": "The razr V3i", "Author": "WIlliam M. Chapman", "ReviewID": "RAWGCMSB8Z7DE", "Overall": "3.0", "Content": "I purchased this at a reasonable discount and thought I was getting a deal. The Razr's I own from prior purchases had metal exteriors. This one is plastic and I was a little disappointed. But it works and for the price, it is an acceptable solution for the situation.", "Date": "June 16, 2013"}, {"Title": "Good phone but Battery is not genuine one", "Author": "I love Ford", "ReviewID": "R2H9SJM0LRJ51Z", "Overall": "3.0", "Content": "Good phone but Battery is not genuine one. It need daily charge.and phone dialed list and received call history is limited to 10 numbers.", "Date": "June 5, 2013"}, {"Title": "poorly made razr", "Author": "Linda", "ReviewID": "R3BV7MQLJOOXV6", "Overall": "2.0", "Content": "I had 2 other Razrs and they were well made and held a charge very well. This model was cheaply made with loose buttons and battery case. I charged it overnight and it began loosing most of the charge within a half an hour!!  I returned it for a refund.", "Date": "December 27, 2012"}, {"Title": "Very good phone", "Author": "Richard", "ReviewID": "R3CUQK4LDVKNH5", "Overall": "4.0", "Content": "This Motorola Razr v3i Phone is to replace an older one when the time comes to do so.  It works fine, and has all he features I need including the pairing with my car telephone system via the Bluetooth conection in the car...", "Date": "October 14, 2012"}, {"Title": "Not a good company", "Author": "raimanof", "ReviewID": "R3JR026L28W6DR", "Overall": "1.0", "Content": "Phone was supposed to be a new one but we founded scratches in the battery compartment, and some applications in the phone required a password ( i guess previously set by the last owner cos` 0000 did not work).The phone was a refurbished according to me and you must not trust the company that sold it...We`re trying to find another company cos` my sister really love the razor V3i...", "Date": "December 30, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001I9PAZW"}}