{"Reviews": [{"Title": "Overall a great versatile handset", "Author": "csquad \"Keeping it Real\"", "ReviewID": "R21J10JQ54VGAM", "Overall": "5.0", "Content": "I just got my new HTC Touch HD phone a few days ago. It has replaced my old SPV M700 (HTC) with Windows Mobile 5 handset. I considered the HTC Diamond but disregarded this due to the slow TouchFLO 3D at the time (has now been updated) however battery life (900 mAh) is still bad. I also considered the iPhone 3G and the Blackberry Storm. The iPhone is fabulous, but not for editing documents etc., plus the screen resolution of the HD is near double. The Storm has a \"click\" screen which I'm not sure about.First thing you notice when you take the phone out of its box it how solid and well built it feels. Also striking is the lack of the usual array of \"HTC\" style buttons. This gives the phone a very minimalistic and elegant look. After starting it up you are greeted with the home screen of the flo menu. This now responds much faster, looks stunning and is a real asset. However the flo does not cover all the phone's functionality and it soon reveals the WM 6.1 prof. underneath. Then navigating the menus using your finger becomes very tricky. Even the fantastically high screen resolution (480x800) can't make up for this. The HD does come with a stylus (held in by a magnet) which you'll need for those occasions. The virtual keyboard is good and responsive but I find it takes some time to get use to. To sync the phone with my PC with Vista was very easy with active sync. It works very well with MS Office 2007 and Media player. I took it to the gym and found the HD works very well as an MP3 player. You can even adjust the volume with the button at the side of the phone without turning the phone back on. The sound quality is very, very good. Importing/converting vids and photos is a doddle with the media player. However I imported a video podcast and the software did not make use of the g-sensor to view landscape, why? Playback is smooth and seems good. Web browsing is a joy with the high resolution screen and Opera 9.5 preinstalled (this does make use of the g-sensor).I contacted HTC customer service and found them very helpful. If you go to the HTC website you can download the latest fixes for the phone.Good:TouchFLO 3D now fast and very usefulBuild qualityBattery lifeGreat preloaded programs e.g. MS mobile officeVery good MP3 player and video playback with fantastic sound qualityVery slim and portableHTC customer service seems fineVery good compatibility with MS VistaLooks stunning5 mega pix cameraBad:Windows Mobile rears its ugly headFiddly small buttons in MS windows mobileG-sensor does not support many prog.Only digital zoom and no flashOverall a great versatile handset.", "Date": "December 16, 2008"}, {"Title": "Almost Perfect Mobile Phone", "Author": "AngelClaud", "ReviewID": "R101JPH9GWL3IL", "Overall": "4.0", "Content": "I have been using HTC Touch HD for more two months now and I'm generally happy with it.My previous phone is O2 Atom Life with Intel XScale® PXA 270 Processor at 624 MHz, it's really fast. I don't know why newer phones generally only have 528 MHz speed, you would expect newer phones to have faster specs. But anyway, the main weakness of O2 is that it hangs and freezes A LOT. Averagely, I have to reset the phone twice a day. The phone signal is also not the strongest.I got Samsung Omnia i900 to replace O2 and immediately gave it to my husband after 3 days of use. He was using Nokia so didn't really feel the difference, but for me the speed and touch screen sensitivity of Omnia is way below O2. I love the big screen, color, and design, but just can't stand the less sensitive screen (although it has improved with the newly released official ROM).Finally, I tried the HTC Touch HD, which has better speed and touch screen sensitivity, not the best, but acceptable. Undeniably, I think that currently, iphone has the best touch screen speed and sensitivity (I don't own one, but have played around with my friend's). However, I still decided to stick with Windows Mobile system as I use the Office application quite often and I like to be able to easily sync data with my computer. I also like the freedom to customize/tweak my phone according to my likes.I use cooked ROM with the new contact list and dialer (Topaz/Rhodium based), which has better interface and features such as linking contacts to facebook friends. The Full QWERTY input is also better and easier to type.My main usage of the phone is to make calls (of course), messaging, calendar, reading e-book, word and excel for inputting data, surfing the net when traveling. I don't really use the music player, movie, stock, and email function.Here are my experiences so far:- System is quite stable. It has never hang/freeze so far. It also doesn't lag. When I have too many programs opened or didn't soft reset for days, then sometimes there might be 3 seconds or so delay when changing from one program to another. But the problem is usually solved when I soft reset or close all those opened programs.- Touchscreen sensitivity and speed is good. Although it does take a while for first time touch-phone user to get the hang of how much pressure to use, gestures, etc.- Text input is also great. As I mentioned I love the new full qwerty keyboard. It's very easy to type and I make very little typing mistake.- Quality of call and signal is good. It's very clear, no noise/disturbance.- The display is beautiful. Very nice and crisp color. It's much better than Samsung Omnia's display. I compared them side by side and Omnia's display and color appeared to be more blurry type.- Camera and video quality is just average, no flash. They are very plain. Not too many special features. You can take good quality picture/video under good lighting condition, but nothing too exciting.- The speaker for music playing is just average. It's probably not as good as Sony Ericson's music-phone.- Battery life is good. For average usage (making calls, texting) it can last around 3 days (this is with the cooked ROM) and I always turn off the data connection at night. I've read that with original ROM it could last up to 5 days (depending on usage of course).", "Date": "April 23, 2009"}, {"Title": "not perfect but close", "Author": "B-House \"Married with five kids. Professional...", "ReviewID": "RZIPUVBXA90MV", "Overall": "5.0", "Content": "This phone hasn't been released in the U.S. but is very popular in Europe and Asia.  It's very clean and the screen is the best I've seen in a device (much better than the iPhone).  It is unlocked which means it can work with most, though not all, carriers and no contract.  It also has windows mobile 6.1 as it's base so it can run thousands of applications which is much more diverse and deep than other phone platforms.  The cons to be are a lack of a d-pad (for gaming) and the inability to make many tweaks (you actually can do many tweaks but need third party apps which are free but require finding and installing them) and they could have bumped up the processor speed (though it's still faster than the iPhone).  The memory, especially RAM is awesome.  Personally, I would also liked to have seen a CF or SD (or both) card slot (has a MicroSD slot).  It's about the sam size and feel as an iPhone.", "Date": "March 25, 2009"}, {"Title": "Very good with some flaws...", "Author": "MVC", "ReviewID": "R3DC7X8H4H0QA5", "Overall": "3.0", "Content": "I bought the Touch HD in November 2008, after some frustration with the 1st gen Iphone. On the positive side, I've got to say this is one of the most complete handsets available on the market, it has almost everything a smartphone could have: GSM quad band, 3G, wifi, large 3.8\" display  with WVGA resolution of 480x800 pixels. [...]However after 6 months of use I have to say the phone disappointed and I don't recommend it for these reasons: 1.- Windows Mobile. Microsoft has to do something about its mobile OS soon, or eventually it'll die, period. I'm not a fan of any particular mobile OS, I've used most of them, and believe me Microsoft is being left behind. It doesn't matter how great the hardware is on the phone, the OS is still slow and it's simply not designed for finger-touch operation. HTC does a good job with its Touch Flow interface, but it's only a mask, in the end it's all about windows mobile 2.- Crappy camera for pictures and video.  The camera is just too slow to focus and take photos, and video quality is mediocre. 3.- Video playback. HTC didn't include a propietary video player, so it just relies on Windows Mobile Media Player which, to be honest is even worse than the desktop version. Besides, the only clips that plays (MP4 with H.264) have the potential for good quality but are choppy if they are in high resolution (over 640 pixels wide), needed for this screen. So if you are planning to use this phone as a personal media player (PMP) for watching movies and/or videos because of its big screen, you'll be disappointed. 4.- Resistive Touchscreen, meaning it reacts to pressure rather than touch like the iPhone. If you have used an iphone you'll be wondering if there's something wrong with the screen. Let's face it: most people will consider this phone because they want something like the Iphone. Now I want to clarify that I'm not an Apple fanboy, but to be honest, the user experience is superior on the Iphone. In my opinion, Windows Mobile 6.1 is to blame.5.- Price is very high. Sure, it comes with almost everything, but you can get better phones for much less.[...]", "Date": "May 5, 2009"}, {"Title": "It ROCKS", "Author": "M. Soliman \"magcp_eg\"", "ReviewID": "R3JIY351PV2KU6", "Overall": "5.0", "Content": "If you are a Windows Mobile user, buy this phone, if you are not you may face some problems shifting to WM environment, I have this phone from Feb 2009, and I love it, you can have a hell of great support and free software on expert sites like [...] and [...]Technically speaking, this phone has some great features like Great LCD wow, and it's touch sensibility and large internal memory (not storage: it's a MicroSD) and there are some drawbacks which I consider minor like the lack of hardware buttons, the speaker is on the back side, and of course, don't expect much from it's camera even if it's 5MP, it's just gives you fine picture not the best.Anyway, I gave this phone 5 Starts because, really it rocks.if you are looking for more intensive review see this link[...]", "Date": "April 28, 2009"}, {"Title": "Broke down 3 months after purchase", "Author": "Juan Manuel Formoso", "ReviewID": "R2N36HWZRQSH57", "Overall": "1.0", "Content": "They don't have technical support in my country, so after it broke down I had a very expensive paper weight.", "Date": "August 14, 2013"}, {"Title": "Can't say much", "Author": "Jacque Santos", "ReviewID": "R32Q5F3GZV1HQ8", "Overall": "2.0", "Content": "I bought this phone in 2009 thinking that it will be better than my iPhone. The big screen was a definite come on, and the fact that windows is running the OS but it pretty much stops there. Although it has a 5MP resolution for the camera, the ease of using it, and the quality is nothing compared to my iPhone. Most of the time, using the phone to send SMS is such a hassle for me that I end up just calling the person and not even bothering with the reply to the text message.", "Date": "August 10, 2010"}, {"Title": "HTC Touch HD - T8282 - Amazing", "Author": "Shery32", "ReviewID": "RY4MLVGF6QCME", "Overall": "5.0", "Content": "The HTC Touch HD is HTC's finest Windows Mobile phone yet. A slim casing houses a large, responsive VGA screen. But it's not just about looks because inside this attractive phone lies the heart of a beast. GPS, HSDPA, Wi-Fi and a 3.5mm headphone jack make for a very smart phone.It's an amazing mobile.I got this as a gift and it is totally worth it. The only thing that is missing is the flash for the camera but the pictures are really great.thanks", "Date": "June 8, 2009"}, {"Title": "great product", "Author": "Suren Poghosyan", "ReviewID": "R3EYR4RD4EAA0V", "Overall": "5.0", "Content": "I bought this PPC as I got very good reference from my brother. The product in my hands exceeded the expectations, although I was familiar with HTC products before too (I had qtec s200) 3 years ago.so, the product is great, the only compatative disadvantage with Iphone for me is the slower response rate of the touch-screen.the rest is just excellent", "Date": "June 1, 2009"}, {"Title": "Disaster", "Author": "Roberto Albuquerque \"Roberto Albuquerque\"", "ReviewID": "R3S8QA6PUDZVX6", "Overall": "1.0", "Content": "I bought it it instead of an I Phone. Big mistake! There is a lot of problems regarding the synchronization and the contact screen doesn't show up. I have to reset it 3 to 4 times before it works properly! HTC's support is a disaster. They keep asking me to do useless things and nothing works ! If you accept a suggestion: buy another brand !", "Date": "April 13, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Network \tGSM 850 / 900 / 1800 / 1900 - 3G Network HSDPA 900/2100\n3.8-inch wide, WVGA (480 X 800 pixel) display offering a cinema experience on the go\n5 MP, 2592 x 1944 pixels, autofocus, video(CIF@30fps), secondary VGA videocall camera\nMemory - 288 MB RAM, 512 MB ROM - Qualcomm MSM7201A 528 Mhz processor\nWi-Fi 802.11 b/g, Built-in GPS receiver, 3.5 mm audio output jack", "Name": "HTC Touch HD", "ImgURL": "http://ecx.images-amazon.com/images/I/41BLqurkE2L._SY300_.jpg", "ProductID": "B001KU7NOU"}}