{"Reviews": [{"Title": "Good, Basic Phone", "Author": "SirStinky", "ReviewID": "RNZ8FC2SDBJT1", "Overall": "4.0", "Content": "This is a contract phone purchased from T-Mobile in 2007. My wife used it for two years until she renewed the contract in 2009 and got the Behold touch screen phone. I used it in 2009, and recalled it again in 2011 as a back up phone when my other phones died a premature death (high-end unlocked ones $250+ latest tech for their day). First off, it looks nice. Very shiny mirror-like exterior, gunmetal aluminum battery cover with soft touch coating. Inside it's nice too. The buttons are big enough to be useful and the D-pad selector has an aluminum center button with a cool machined-look finish.It's relatively compact..about 4 inches tall, 2-1/2 inches wide and thin as well. This is a \"clam shell\" or flip phone and closed it's about 14mm thick. Open it and the upper (with the screen and earpiece) is about 6mm thick and the keypad is about 8mm. The thickest part of the phone is the bottom which houses the antenna, loudspeaker (on the back under the battery door), and microphone. The screen for it's day (in 2007) was great 2-inch LCD 256K colors with decent resolution. On the front there's a secondary color screen 1-inch that shows the time, date, battery life, signal strength, and notifications (missed call, caller ID, new message/voicemail). The keypad lights up with soft blue-green lighting.The user interface is Motorola's own and pretty straightforward for a T9 alphanumeric device. You get good things like MP3 ringtones, a microSD card slot (it came with a 256MB card), 2 MP camera (big for it's day), organizer, alarms, calendar, Web access and Internet compatibility, downloadable ringtones, sounds, wallpapers, lots of phonebook entries with customizable caller information, voice recorder, Instant Messaging support, SMS or multimedia message support, Java game support, music player, JPEG photo browser, MPEG video recording, a world clock, calculator, and 3 customizable skin choices.Texting is painfully slow compared to the full QWERTY keyboards we have now, but for T9, hey you get what you get. The 2.0 MP front-facing camera actually shot pretty good pictures! You do get to change some settings, resolution 240x320, 480x640, 1.3MP and 2 MP), size, quality, white balance (lighting conditions, night, home, office, sunny, cloudy) , color (lots of choices including black and white, antique, negative),and even exposure control +/- 2EV. It's got 8X digital zoom too! The video camera is really good for what it is. You can change it's settings as well: resolution (128x96, 176x144, and 352x288), and does colors like the still camera.Cool stuff and great features! It works like it should. As a phone it's great, better than the $600 smartphones out there. Calls were loud, clear, the callers on the other line didn't complain about feedback or talk-back, and the loudspeaker was loud.It also has voice activated dialing, shortcut keys, and a dedicated multimedia key. Speaking of keys there's a volume rocker, smart key on the right to launch the voice command feature, and a media key that controls the \"media center\" for messaging. Battery life isn't too bad but not great either. I got 2 days out of a charge.this is a durable, quality handset. It's been dropped, splashed, scraped, battered, bruised. The finish is peeling off in some areas where it got dropped. Everything still works great even after 4 years. It's as rugged as it is dependable and more importantly, useful.Great product.", "Date": "June 28, 2011"}, {"Title": "Excellent Quad Band Phone", "Author": "B. Korinman", "ReviewID": "R36TBSJS2P60ZT", "Overall": "5.0", "Content": "This phone is slick, well-packaged, cute ,and easy to use. Everything works great. It is a flip phone and can be opened easily with one hand. Setting up this phone was a piece of cake. It has a very crisp, high-contrast display. Call volume and quality is very good and the music player sounds great. The soft keys can be programmed for a quick access to the frequently used apps (alarm, calendar, etc.). It came with an adapter plug which can fit any A/C plug.", "Date": "May 3, 2009"}, {"Title": "KRZR K1 'International Version", "Author": "Bella", "ReviewID": "R2IXIZQRDV8FEG", "Overall": "1.0", "Content": "The international version of this phone of this K1 does suck as you have to download a monster pack here in the USA for this phone and if you're not careful and don't know what you're doing you can even make things worse for the phone when doing so. If you want a KRZR K1 phone i wouldn't suggest buying the international phones such as the UK blue. So many people have had problems with them here in the US. Now the US phone is excellent and I have never had any problems with mine. Infact I love the phone and can't imagine ever getting a different phone.", "Date": "January 6, 2009"}, {"Title": "GREAT SERVICE!!!!! GREAT SELLER!!!!!", "Author": "A Customer", "ReviewID": "RDOHX6ED98PTH", "Overall": "5.0", "Content": "Hi, I ordered this phone for my brother it is a very practical easy to use great product and service thanks:)", "Date": "January 31, 2012"}, {"Title": "Krzr", "Author": "plc", "ReviewID": "RJRW91CD19VB8", "Overall": "5.0", "Content": "I bought this phone as a replacement. My husband loved his old phone, but had trouble keeping it charged and was looking for a new phone. He did not want a smart phone. This was the perfect solution for him. The phone is brand new and is working perfectly. Would buy it again. I also bought another one for myself but couldn't decide between it and another smart phone. The seller was wonderful to work with. In the end, I decided to keep it. Would certainly buy from this seller again.", "Date": "December 13, 2011"}, {"Title": "Who needs smart phones", "Author": "Watah", "ReviewID": "R3Q0NILJ1E1L0H", "Overall": "5.0", "Content": "Got stereo bluetooth, w/2gig chip plenty of music, usb data transfer/power in one.  You can charge on any pc/laptop with a usb cable.  great phone that looks great and great to use.", "Date": "February 15, 2013"}, {"Title": "Upgraded my phone.", "Author": "M. Zingsheim \"Netdoc Mike\"", "ReviewID": "R3PI4LS4DBGMVB", "Overall": "2.0", "Content": "I had a Motorola RAZR cell phone, which I loved, but it only lasted about a year when it just stopped working. I thought I'd update with the Motorola KRZR because it should be a new, improved model.I guess that was a bad assumption. At first, the phone worked great. Then, after a few months, I began having intermittent display problems. This one didn't even last a year and I needed another new phone.I updated again a few months ago, but, this time I went to a Nokia. It doesn't have the style of the Motorola but it just feels like it was built with better construction.Sorry Motorola but I will take performance over style.", "Date": "July 16, 2012"}, {"Title": "Great little phone!", "Author": "Michael D. Neville", "ReviewID": "R7CPJJD9ZQOTJ", "Overall": "5.0", "Content": "I wanted this cell phone for several reasons: it is beautiful; it is light; it has all the features I need and I can use it internationally!!!  The phone has not disappointed either! It is a wonderful cell phone and the merchant is top notch! Thank you!", "Date": "February 21, 2012"}, {"Title": "HORRIBLE Phone", "Author": "Jenni R.", "ReviewID": "R1K413RJUGGB8A", "Overall": "1.0", "Content": "This is the worst phone I have ever owned! I have it through T Mobile who is one of the best carriers out there. They have sent me countless replacements and they all have the same issues. Even when I went to the T Mobile store and said I was looking for an upgrade, the employee there rolled his eyes when I said what phone I had. I believe his words were, \"I can understand why you'd want to get rid of it.\"The screen goes all white, it freezes, it restarts when it feels like it, shuts off, drops calls, has nearly no memory, etc. When text messaging, hope you don't get a 2 page message - you will get one part at the beginning of your texts, and you'll have to search around through all your other texts looking for the second part. It may be a few hours earlier, it may be days or weeks. And whatever you do, don't turn it off! When you turn it back on, it isn't unusual to have all the picture messages you've deleted back on your phone! (but with the even more memory available - figure that one out!) Now my screen is waving and about to give out, I've been through 4 chargers (including two for the car), and I'm ready to run this horrible phone over with a train!I gave it one star because the one good quality it has is the quality of the pictures (and videos). I have some fantastic pictures from this phone - too bad I can't text them to anyone since it has no memory!", "Date": "October 13, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001QUWRYK"}}