{"Reviews": [{"Title": "Great with SPB Mobile Shell 3.0", "Author": "Samuel A. Mcgarity", "ReviewID": "R2RISSIYVVCBKU", "Overall": "5.0", "Content": "This phone hasn't gotten as much hype because the operating system that came as default was pretty bad.  Once I installed SPB Mobile Shell 3.0, it turned my phone into an awesome phone.  You can customize everything and I would say it's very similar to Google's new android phone.  The camera is great at 5.0 megapixs.  The wifi, FM Radio, internet browser, built in mail, Excel, Work, Power Point.  This phone is the real deal and much better and more customizable than the iPhone.  Not to mention it comes with 8 GB of storage.  I would strongly recommend this phone!!!", "Date": "September 25, 2009"}, {"Title": "not as expected", "Author": "Ashley Clarke", "ReviewID": "R13EP3WN5HGA47", "Overall": "1.0", "Content": "it was not as expected or as said in description before I purchased it! i will never do business again", "Date": "August 22, 2013"}, {"Title": "Would never purchase this phone again.", "Author": "Frustrated", "ReviewID": "R28H3TZFJ0UWM7", "Overall": "1.0", "Content": "I purchased the Samsung Omnia in August 2009.  I have had to hard reset it countless times, adjust the memory (from main to storage to card) and have had to replace it TWICE for technical problems.  The LCD light went out in January and after receiving my replacement, the phone only had one-way audio - that's helpful.  I have spent over a week without a business phone and have had calls forwarded to my personal cell.  Verizon's solution to my problem was to send a second, refurbished phone with the hopes that \"everything would work in the phone.\"  They also offered an additional 150 minutes.  Wow - thanks!  What a disappointing phone.  I don't know how it ever received 4/5 stars.  I'm ready to move my business elsewhere - maybe an iphone's in my future.", "Date": "January 27, 2010"}, {"Title": "Sony all the way", "Author": "J. Higgins \"Cohen\"", "ReviewID": "RU1E5PCGKTNTK", "Overall": "1.0", "Content": "Thought it would be perfect with all the hype about it, not at all. The feel is okay but not performance.", "Date": "October 23, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0 megapixel camera w/auto-focus, zoom and video capture\nWindows Mobile® 6.1 Professional\nMicrosoft® Office Word Mobile, Excel® Mobile, and PowerPoint® Mobile; Adobe® Reader® LE PDF viewer\nMemory: 256MB Flash/128MB RAM\nDimensions: 4.4\" (H) x 2.24\" (W) x 0.52\" (D)", "Name": "Omnia All-In-One Smartphone with Touch Screen", "ImgURL": "http://ecx.images-amazon.com/images/I/21UAkVL2dfL.jpg", "ProductID": "B001PJ3JHQ"}}