{"Reviews": [{"Title": "Misleading, but still a good option.", "Author": "Jose A. \"mnerd\"", "ReviewID": "RJXEUMGRGR1CF", "Overall": "3.0", "Content": "The phone I received was in fact the ME770, which LG seems to think never existed. The phone was from Mexico, which I can tell based on the fact that the whole thing was set up for the major Mexican carrier MovieTel with the browser launch menu button being the Spanish word Emocion. Another thing is that despite what the review states and what other reviews have mentioned, this phone DOES NOT HAVE SPEAKER PHONE as stated in the description.I decided to keep the phone even though this was the case. Here's why.This phone is replacing my Motorola L6 phone. The ME770 is basically an upgrade of everything I loved about the L6 except the lack of speakerphone of course.The good: 2mp camera is decent but slow. Still, colors are adequate and flash is ok. Has Edge browser capabilities. Nice screen for the price. TINY size, which I personally. The metal case feels nice in the hand, and is very attractive. Very good reception.The bad: Again, No Speaker Phone. Unlike my old L6 the glass of this phone will scratch easily. Did not come with usb data cable. Uses priority LG adapter for charging and data.This phone is great for people who want a small attractive but capable phone for not much money.", "Date": "December 4, 2008"}, {"Title": "Sleek and slim phone at a great price.", "Author": "Mr. Derrick \"Vitamin D\"", "ReviewID": "R22F7Z8VVYGX4I", "Overall": "5.0", "Content": "I have had this phone for 3 days now and love it. I just sold my Nokia N95 8GB as I no longer needed a phone that does everything. I wanted something much slimmer with less features. I spent days going through the unlocked phones here. I was worried as I read the review of it actually being the international version. So I called Amazon first and the guy I talked to made it more confusing. I made the purchase anyway and the one I received was the US version, ME770. It did not come with USB cable but whatever. The phone looks great. Very easy to use. It is small but texting is no problem. I am a slim 37 year old and my fingers fit fine. I found all the WAP settings here: [...]Camera is nothing special but even the Nokia I had with the 5 mb was ok. Its a simple nice looking phone that does the job. Its less than 1/2\" thin!", "Date": "November 26, 2008"}, {"Title": "its just alright", "Author": "Richard B. Julian Jr. \"rickaroni\"", "ReviewID": "R26L14B1F8XHRG", "Overall": "2.0", "Content": "this phone is just alright for me. unfortunately my service provider, at&t; will not allow me to use the full functions of the phone. the phone is small, thin, and light. very good on pocket space. what i did not like was the fact that the ring and voice volume was extrmely low. if you work or play in loud areas you will not hear this phone. i also did not like the choice of ring tones which come with the phone. no plain rings just techno-ish beats. not for me.", "Date": "December 23, 2008"}, {"Title": "Not the US version as stated in the Product Description", "Author": "J. Oard", "ReviewID": "R2DXDNY2S29QWP", "Overall": "4.0", "Content": "I bought this phone as a B-Day present for my wife and am in the process of setting it up for her. As stated by \"mnerd'\" in his review this is indeed not the US version and is from the Spanish Carrier Movistar. I like the look and feel of the phone so far and I think my wife will too. Only time will tell if works out and if I can get the mobile browser or emocion as it's called on this handset to work. If I don't I am not too worried as my wife does not have a data contract. I can confirm though that it does work with the ATT/Cingular network for calls.", "Date": "December 18, 2008"}, {"Title": "Just a good looking phone", "Author": "J. NUNEZ", "ReviewID": "R3GZTAY08BPJOG", "Overall": "3.0", "Content": "I bought the LG ME770 and I was impressed for it's looks and size (small candy type phone). I should have to say that the USB cable was not included like it said in the phone's description. The micro SD slot is difficult and delicate to operate and you have to extract the battery everytime to insert the external memory. Should be careful with this. Ah!! there's no speaker phone for atending and make calls.", "Date": "December 12, 2008"}, {"Title": "phone is an allrounder, can do many things but excels at nothing except appearance", "Author": "Antman \"T2\"", "ReviewID": "R3UAK5VXZW6RBX", "Overall": "2.0", "Content": "First off, Amazon needs to correct the model of this phone it is the LG KE770 and not ME770 as advertised.So glad that's cleared up. Appearance wise the phone is beautiful nice shiny metal effect. In terms of functionality:-1. camera pictures are a bit grainy, ihave seen better with 2 mega pixels2. Number buttons are too close texting is a nightmare3. can only PC sinc with USB cable4. No 3G , no Wireless LAN ConnectivityOverall a good stylish phone, if you like to show off your phone to your friends this is the one for you. However if you're like me and would appreciate some kinda reliable functionality don't waste your money.", "Date": "November 4, 2008"}, {"Title": "Great Phone", "Author": "sunny", "ReviewID": "R3PQLPGJ6IH6X7", "Overall": "4.0", "Content": "I have owned the phone for about a year, and it has worked great fro me.The phone is very thin, making it easier to carry around. The phone doesn't have many features, for example it can not open photos that have been texted. The pictures are not very good. The phone comes with two games, which are okay. The phone is very user friendly. I would reccomend this phone to someone who wants an easy to use and stylish phone.", "Date": "April 17, 2011"}, {"Title": "It's...Okay", "Author": "Deric", "ReviewID": "R2940PH2X9NV4R", "Overall": "3.0", "Content": "I've had this phone for 3 years now.  I can say a lot of things about it but i'll do the rest some other time.Start with pro'sPRO's-Set time, and it'll update by itself even when battery is taken out(if battery is taken out for a long while like a month or 2-3 weeks, the phone's time will mess up)-Surprisingly thin, made of metal and not cheap plastic-Screen wiper!  It's fun to mess with when you have nothing better to do(kind of...)-Works as a phone.  Calls, receives even with low battery-battery should last a week if used sparingly-T9 for texting...which I don't care for-Texting works.-Works as a phone-simple-one cool game, catching fish.  Sounds lame but its so detailed, soo many fishes, baits, It's Pokemon all over again, except... catching fish-contact and you can save favoritesCON's-My camera died in a year or less, pictures are unrecognizable.  Original camera is grainy but after a while, it deteriorates and camera goes to hell.-I could not put a single song on it!-Low memory space, 300 text messages in all sent and received-web browser function didn't work for me-games disappoint  me but after a while, all games bored you out.-Buttons begin to fall off-not an exciting phone.All in all, the phone functions as a phone.  Not really a phone for you if you want a sophisticated cell phone with all the functions.  It's for people who just wants a working phone and does well on what its suppose to do.", "Date": "May 30, 2010"}, {"Title": "piece of junk", "Author": "butterflyswvr", "ReviewID": "R2PPX5POWPYRDM", "Overall": "1.0", "Content": "I bought this phone to replace an older LG model and man did I make a mistake. The seller should have mentioned that it was refurbished and not brand new as it seemed on the description. Also, it doesn't even read my microSD card! The few ringtone options stink, the few message tone options stink, and the way the menu is set up is frustrating. I hate this phone! I would have given it a zero!", "Date": "February 18, 2010"}, {"Title": "dont waste your time", "Author": "Christopher. A", "ReviewID": "RM66X3YMC0XE8", "Overall": "1.0", "Content": "this phone was sucha a waste of money. sure it has a camera but you cant send picture mail reception is horrible and when i got mine it came in spanish glad i have spanish speaking friends to put it in english. please do not but this phone its more of a headache than you would like to have", "Date": "February 4, 2010"}, {"Title": "Good Phone", "Author": "Robert S. Garcia", "ReviewID": "R22OM1E7D5PKSE", "Overall": "4.0", "Content": "On time shipping. Happy with purchase with one exception. Cable was not included as advertised.", "Date": "January 7, 2009"}, {"Title": "Great phone", "Author": "Chris L. Ambeba \"Christ is Lord\"", "ReviewID": "RA7MT3AI4M2P", "Overall": "5.0", "Content": "Great phone and great customer service from Amazon. I lost this phone during shipment and Amazon were kind enough to replace it. Thank you Amazon! God bless.", "Date": "December 27, 2008"}, {"Title": "Nice phone but stopped working", "Author": "Eric Singh", "ReviewID": "R3E4Q2NA9BB6UO", "Overall": "3.0", "Content": "Phone is nice in appearance but it stopped working two weeks after i started using it. Refund procedures is in process.I addition, no USB cable was included in the package as advertised.", "Date": "December 16, 2008"}, {"Title": "My right arrow button fell off", "Author": "Shannon E. Funk \"lbbk0512\"", "ReviewID": "R2R4OJIF4HHRXS", "Overall": "3.0", "Content": "I barely ad the phone for a month and my left arrow button fell off.  Nowhere to be found.  That kinda sucks.", "Date": "December 6, 2008"}, {"Title": "Muy Buen producto", "Author": "Trinidad Rivera Rivera", "ReviewID": "RO3ZJUPVM9F88", "Overall": "4.0", "Content": "Estamos satisfechos con la calidad del producto adquirido y sobre todo, por la honradez de Amazon en enviar los artículos comprados. Al adquirirlos, es seguro su envío.", "Date": "January 21, 2009"}, {"Title": "Where's my USB cable?", "Author": "Frank Z \"frankz00\"", "ReviewID": "R1F9H5HJP8CT9Z", "Overall": "3.0", "Content": "The description said there was a USB cable included but I didn't get one.  Nor is there a place that I can see to connect the USB cable.  It's a good phone but I dinged it for the inaccurate description.", "Date": "November 10, 2008"}, {"Title": "5 stars", "Author": "Yolanda Johnson \"Yolanda\"", "ReviewID": "R1C382PU2GV6Y2", "Overall": "5.0", "Content": "I got this phone today and i really do like it.The one thing i like most about this phone is it talks when you dial the number. i would recommend it as a buy, and give it a 5 star rating", "Date": "November 5, 2008"}, {"Title": "The Product is very good upto its brand name of sony.", "Author": "Vikas Gudavarthi", "ReviewID": "R1QGR4NNZZGWEL", "Overall": "4.0", "Content": "The Product is very good. The Product is a good buy for the cost i paid i think its worth a penny.", "Date": "November 16, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nTri-band GSM cell phone compatible with 850/1800/1900 frequencies and GPRS/EDGE data capabilities\nCandybar-style phone with sleek stainless steel body, 2-megapixel camera, integrated digital audio player\nBlueooth stereo music; MicroSD expansion; access to personal email with document viewer; SMS/MMS messaging\nUp to 2.5 hours of talk time, up to 200 hours (8.3 days) of standby time", "Name": "LG ME770 Unlocked Phone with 2 MP Camera and Media Player--International Version with No Warranty (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41t4CUGc%2BYL._SY300_.jpg", "ProductID": "B001E2AGCU"}}