{"Reviews": [{"Title": "STEEL. NOKIA STEEL.", "Author": "NeuroSplicer", "ReviewID": "R3J0E2LRRAVYOX", "Overall": "4.0", "Content": "Over the past decade I have been through half a dozen cell phones. With a brief (and unsatisfactory) PANASONIC interlude, I have always gone NOKIA and did not regret it.My previous phone was NOKIA 6230i, a stylish working horse that, after three years of non-stop use, lately kept having ringer failure. I loved my phone and, although realized its time was up, did not want to have to familiarize myself with a whole different Menu SetUp.The NOKIA 6500-SLIDER was the perfect choice. It has a beautiful and robust brushed-steel finish, a large screen of impressive quality and one of the best phone cameras available (a 3.2Mpixels sensor behind an autofocus Carl Zeiss lens with flash). An important detail: the brushed steel is NOT that sensitive to fingerprint marks and will not require the constant wiping that other metal models do.The menu is intuitive and easy to use even if new to NOKIA 6-series. The buttons are large enough for adult fingers and, important for a slider phone, even the top buttons are fully accessible.Like most NOKIAs, the phone is greatly customizable, from colors and sounds to wallpapers and screensavers. It is robustly built and the slider glides easily in place with zero wobbling. NOKIA 6500-SLIDER is a beautiful phone that can be your helper for years.My only complaints are actually...three:(1) the very limited OnBoard memory (it has only 20MB - when my older 6230i had almost double that). Since only mp3s and photos stored on the Phone memory are guarantied to work when used as ring-tones or contact/group images, to have a cavernous 256MB Memory Card yet a puny 20MB OnBoard capacity seems ironic.(2) the placement of the speakerphone in the...back of the phone. Activate it and the phone speaks to your desk, voices coming out all muffled; and(3) the absence of photo stabilization. It may seem excessive for a phone, however when increasing the pixel number beyond 3M, image stabilization is actually essential if photos of any value are to be taken.All in all, an excellent stylish phone that, (six months after its initial release) should be available at bargain prices.", "Date": "June 2, 2008"}, {"Title": "Unreliable", "Author": "Glenn", "ReviewID": "R2FB0EVVWA6LIP", "Overall": "1.0", "Content": "I have had very good experiences with Nokia phones but we've had this thing repaired 3 times in the last year and it just went dead. I'm going to something else.", "Date": "November 12, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Nokia 6500 Slide Quadband 3G Unlocked Cell Phone", "Name": "Nokia 6500 Slide Black/silver Unlocked Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/517ePhncLIL._SY300_.jpg", "ProductID": "B00198M12M"}}