{"Reviews": [{"Title": "It works for me!", "Author": "Senor Macho", "ReviewID": "R2JH6Y394FJHO", "Overall": "4.0", "Content": "I've been using omy Motorola Razr everyday for over a month now, and it is everything that I thought it would be. Of course, it is no \"Storm\" or \"iPhone\" but it is very solid user friendly phone. If you are looking for just a cell phone with only a few \"toys\" built in it, this is the one. If you are looking for lots of apps and you do a lot of texting, look elsewhere.", "Date": "October 2, 2009"}, {"Title": "A lot of technology for little cost", "Author": "Robert Walther \"Bob\"", "ReviewID": "R1NNF4KOW4PB6O", "Overall": "5.0", "Content": "We live in China where all cell phones are unlocked.  We purchased this phone when problems with a two week old V8 surfaced.  The V3i has been rock solid.We upgraded the memory card to store more tunes on the phone.  Installation of the upgrade worked first try.  Loading tunes was easy using Motorola's software.On a personal note, the buttons are large enough it's difficult to \"fat finger\" a number.All in all a great value.", "Date": "August 14, 2008"}, {"Title": "james h", "Author": "James M. Houdaille \"Jay H.\"", "ReviewID": "RLU83WKG563VM", "Overall": "5.0", "Content": "It is an awesome phone!!!..they can fangle all the 4G's they want, but this unit is ahead of the pack for World Use. When all you want is to SMS, make a quick call and 'peek' at your email, this is the cell phone for you.", "Date": "December 21, 2010"}, {"Title": "bloated keyboard", "Author": "donnie", "ReviewID": "RV73KCLHI080Y", "Overall": "1.0", "Content": "i got my unit today july 13, 2011..and not really happy with it.ive had an original v3i before and i know how it feels..this one doesnt feel nice..first thing is the keyboard is not laid out properly..its like bloated.. and like pressing a bubble.the battery also looks like it was recycled.sticker wasnt placed properly so it adds bulk to it, so when you put the back cover it wont close out properly.not really happy with my product.. i wish i could return it..", "Date": "July 13, 2011"}, {"Title": "3 months, all can not work, do not give refunds, hateful.", "Author": "Qide Cai", "ReviewID": "R21KTCJZ24I5UC", "Overall": "1.0", "Content": "3 months, all does not work, do not give refunds, hateful, \"new\"? Stuff.I really do not know what your conscience still alive.", "Date": "January 6, 2013"}, {"Title": "the sound is bad, the backlighting is bad.. never again", "Author": "John M.", "ReviewID": "R2ECUK4PLX4GSM", "Overall": "1.0", "Content": "I bought this phone for my wife who enjoyed it a few years ago.This model was supposed to be OK with a AT & T sim card.It is completely disappointing: the sound is bad, the backlighting is bad..Never again.", "Date": "December 14, 2012"}, {"Title": "Beware!", "Author": "Green reviewer", "ReviewID": "R21E7VJZWAE41I", "Overall": "1.0", "Content": "After a lot of research I decided to buy a simple yet reliable phone for use during my travel overseas. However, the v3i I received was not an original Motorola but a cheap fake. How do I know? Several years back I used to own one and that was a spike phone but this one has cheap materials and also the battery sticker is already peeling off on the first day!! Please contact and verify the seller's credentials before you buy....", "Date": "November 29, 2012"}, {"Title": "Poor Quality", "Author": "Kevin", "ReviewID": "R193F50NQNRV7G", "Overall": "1.0", "Content": "Got this phone as a present for my dad. I was surprised by the poor quality of the phone. The number 6 on the keypad did not function. Do not purchase this phone!", "Date": "September 3, 2012"}, {"Title": "Damage!!", "Author": "Cristian Rodriguez", "ReviewID": "R23ZCCT5YC9ZW1", "Overall": "1.0", "Content": "Product was damage, did not last a week. Look fine in the out side, but when took to repair was oxidized in the inside. Dont know if has guarantee!!", "Date": "August 23, 2011"}, {"Title": "This is NOT the original V3i", "Author": "A.J.S.", "ReviewID": "RVHX6HLM3UMSZ", "Overall": "1.0", "Content": "So I have had a V3i noir for a long time. It was quite the fashion statement when it first came out in mid 2000s. Unfortunately my phone finally gave up and died last month. Despite already having an iPhone, I realized I can not really live without my V3i, so I ordered another one from this seller.Bottom line, this is NOT the original phone released by Motorola. Everything about is off and feels cheaply made and they haven't even made any efforts to make it look legit. For example the user manual is quite clearly made by stapling a bunch of black and white photocopied sheets! And as another reviewer mentioned, the battery looks completely random, perhaps recycled with a sticker glued on it.I have contacted the seller for a refund and I will update this review to tell you about the customer service.", "Date": "July 15, 2011"}, {"Title": "Bad product I really didn't like it.", "Author": "hey", "ReviewID": "R3AMYW6M98IAUT", "Overall": "1.0", "Content": "Didn't really like it cause it never worked. It never opened up I mean come on. Tried every ways to make it start.", "Date": "November 10, 2013"}, {"Title": "Motorola RAZR V3i", "Author": "MotoMan", "ReviewID": "R3C7ZG9P6VL3GH", "Overall": "4.0", "Content": "I just bought my fourth Motorola RAZR (April 2013) ...(this one was the RAZR V3i) since 2004.  I needed a quad band international unlocked version since I do a lot of travel overseas.  Once again for a great phone, yes without all smart phone capabilities that some might desire, this one still packs a great punch for the price. It does everything that you need in a basic phone for a great price and without all the hassle of buying into a Verison or T-Mobile plan !! I am glad that I bought a RAZR again.  Also, The texting capabilities were an improvement over the Motorola RAZR 3 that I still use.....but it will be my back up,if needed.", "Date": "May 11, 2013"}, {"Title": "One Problem", "Author": "whitgo", "ReviewID": "R3UEAI1UPH0E22", "Overall": "3.0", "Content": "Phone could be great, but battery life is terrible.  Replaced the battery with one I knew to be good, and still battery life is unacceptable.  Can hardly make it through one full day, whereas my other V3i's will last 3 or 4 days.", "Date": "March 30, 2013"}, {"Title": "Be careful.", "Author": "Dr. Mom", "ReviewID": "R1L8NXYOBZIYTC", "Overall": "3.0", "Content": "I purchased one of these used, and it wouldn't charge.  The water damage indicator clearly showed that it had been damaged.  I was able to return it, thankfully, although I didn't get a full refund (take a look at Amazon's policy on that).  Had I known the risks associated with this purchase, I would have chosen to buy a brand new unlocked phone for international travel (RCA makes one that is quite affordable and it takes 2 sim cards, so it would be possible to enable it for use both in the U.S. and abroad).", "Date": "March 25, 2013"}, {"Title": "I wanted to rate better.....", "Author": "Julez", "ReviewID": "R2EZS2T5WIGKJ9", "Overall": "2.0", "Content": "After all this time the Razr is still a sexy, sleek design...I bought it for my wife and she loves the design, I do too...However the functionality went down hill on this particular phone. The back end of the case does not close tightly and we are experiencing technical glitches; static, no voice on the other end after answering or not able to receive calls at times. Unfortunate, my first product review and it is a bad one. I will further review the response from the seller.", "Date": "December 12, 2011"}, {"Title": "Fantastic!!!", "Author": "Roger", "ReviewID": "R3JSF5OV3PV8CF", "Overall": "5.0", "Content": "Received the phone within a week and it is great!  Came with an extra battery and a car charger!  Wife has an older model and this one is better!", "Date": "August 23, 2011"}, {"Title": "Image Please!", "Author": "Charles W Johnson", "ReviewID": "R2B4MWETDVJXGR", "Overall": "3.0", "Content": "Second week of service no screen image on either screen. Unit would activate, and make noise.I feel the unit should have lasted at least a few more weeks. How do you return (under warranty) an international phone. Information on warranty return not in box. The seller shipped in a UPS Express Box With a USPS standard label. One month latter.......bad from the get go.", "Date": "July 12, 2011"}, {"Title": "Excelente celular", "Author": "Eduardo Hidalgo \"Bolon 50\"", "ReviewID": "R3B86DIGFYHH7A", "Overall": "4.0", "Content": "El celular Motorola es de excelente calidad pero lo unico negativo que tiene es la carga de bateria dura muy poco, hay que tener el cargador en el carro y en la casa listo en todo momento porque siempre se descarga muy rapido.", "Date": "September 20, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00134WZFU"}}