{"Reviews": [{"Title": "these phones have major glitches", "Author": "D. Davis", "ReviewID": "R1NSBAWQD9SWA1", "Overall": "2.0", "Content": "I bought two of these phones, one for me and one for my husband. They have good options for us, the camera and video are easy enough to use. But my husband's phone and mine are like day and night. His works fine. Mine is a dud. They were both purchased at the same time from the same place. Mine freezes up all the time and I have to shut the phone off to \"reboot\" it. Also I have problems with my answer keys and a few others. And it has ended my call at various times and without warning, just bloop and it's dead. I finally got so frustrated with it I went back to my older Nokia and my shiny new Nokia 2760 is sitting on the desk collecting dust. My husband's phone is still working fine but it does have a few key glitches too. To purchase this model is like playing Russian Roulette, you may get a good one or you may not.", "Date": "May 31, 2009"}, {"Title": "Nokia 2760 Is A Piece Of Crap!", "Author": "shadygrady0002 \"shadygrady0002\"", "ReviewID": "R3LAPQOHLSBIH3", "Overall": "1.0", "Content": "This has to be the worst cell phone on the market!  It don't understand how Nokia can put out such a piece of garbage!  I just purchased one today and I've spent 2 hours of my day trying to figure out how to turn the volume up so that I can hear who I'm talking to.  The volume on this phone is very, very low.  The user manual says absolutely nothing about how to turn the volume up or down but it has lots of info on the extras like instant messaging and how to download wallpaper and such.  Who cares?!  I need information on the basic things.  And the menu on this phone?  It's a nightmare!  It's very confusing and makes no sense whatsoever.  It appears that an item is highlighted and when you press CHANGE, it's something totally different than what you selected!  A couple of times, the darn thing froze up while I was going through the mess of a menu!  I couldn't even back out or turn the phone off!  It was just frozen!  I'm taking this raggedy piece of trash right back to the store tomorrow and getting a refund!  I don't care if you are on a budget, avoid this travesty of a phone!  This bloody mess should be taken off the market right away!  Nokia should be ashamed of themselves.", "Date": "April 18, 2009"}, {"Title": "unlockcell phone kings suck", "Author": "manoj mohta", "ReviewID": "R21OJK1BNBH0W0", "Overall": "1.0", "Content": "I paid for an unlocked phone but received a locked phone. After a lot of hassle, these guys replaced with one Motorola for some extra charges and shipping cost. This phone did not even switch on. Now the warranty period is over as the company rep says and they can do nothing about this cell phone.Never will buy phone from Amazon.com . Motorola is six sigma company but Amazon's suppliers are selling defective phones pretending as new phones. Good luck if you still buy.", "Date": "August 27, 2010"}, {"Title": "Nokia 2760 -  Good phone, good value!", "Author": "Paula Inniss", "ReviewID": "R1S936C4FO6YZ4", "Overall": "4.0", "Content": "This was an excellent product. Although it's an old series, the phone is reliable and durable. I dropped it countless times and it still works even in water once. I highly recommend this product.", "Date": "July 20, 2010"}, {"Title": "horrible!", "Author": "Karen T", "ReviewID": "R2QMY2PS6ORR2Y", "Overall": "1.0", "Content": "quality is totally not what i was expecting. callers sounded like they were underwater across the globe! would never order again...", "Date": "March 19, 2013"}, {"Title": "JEPZ", "Author": "pepe", "ReviewID": "RDH8EQK1S8Z47", "Overall": "4.0", "Content": "When I bought the phones, they sent me locked and I asked unlocked. It is big deal, because I living in centralamerica.", "Date": "May 25, 2011"}, {"Title": "Telefono bloqueado!", "Author": "Yors Alvarado Esquivel", "ReviewID": "R2EWUF0SCA9ZT2", "Overall": "1.0", "Content": "No funciona en Costa Rica, el numero de IMEI no es valido en Costa Rica a pesar de que las caracteristicas dicen que esta desbloqueado, no lo compren es dinero perdido.", "Date": "May 16, 2011"}, {"Title": "my wife gift", "Author": "Teodoro Valentin", "ReviewID": "R130R0QCAME93L", "Overall": "5.0", "Content": "it's a gift for my wife and she love it. it's small, practical and easy to manage. the technology is 3G and is very light. for a special gift to a special person this is the best.", "Date": "April 7, 2009"}, {"Title": "Answering your e-mail", "Author": "Francisco J. Montilla \"mirna montilla\"", "ReviewID": "RBY8ARJIMDI7F", "Overall": "1.0", "Content": "I really appreciate your interest in solving my problem with the recent purchase of this cell phone. When I made this purchase, I asked for an unlocked one. You sent me a locked one. When I turn on the cell it says on the screen \"Restricted phone. Enter a code\". I'd be very happy if you could help me solve this problem. Thanks.", "Date": "June 15, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0015KH1EC"}}