{"Reviews": [{"Title": "Warning! only 3 GSM frequencies and does not support 3G in the US!", "Author": "R. Balsover \"bob_b0917\"", "ReviewID": "R3DARMHOSE4JG2", "Overall": "5.0", "Content": "The people that placed this ad neglected to list the specs on this phone. At this time the only HTC Diamonds in the US are imported European phones and so they support the European frequencies. This phone only supports the 900/1800/1900 GSM frequencies, ATT sometimes uses the 800-850 frequency for GSM in the US so if you use ATT you might find yourself without service. Europe and Asia both use different 3G frequencies than are going to be used in the US. If that is not a big deal for you and your current GSM service provider does not use 800-850 and you are not interested in 3G service then this is a cool phone.  However, I would wait until HTC releases this phone in the US where it will have the correct frequencies supported and you will be able to use 3G.  If you haven't already done so, you should also check out the HTC Diamond Pro which is the same phone with an added slide out keyboard.", "Date": "July 16, 2008"}, {"Title": "Disappointed", "Author": "Stefan Ekelund", "ReviewID": "R3HF1FG1SZ0N0C", "Overall": "2.0", "Content": "The phone looks very good, the screen is clear with crisp images and it has many nice features, but a very poor battery life. It hardly lasts a day. The touch-responsive user interface is a big disappointment and scrolling is far from Apple's iPhone. It is impossible to not open applications while scrolling. This is not an iPhone killer. The camera lacks flash and you can not upgrade your memory from the 4GB (I knew this but I like to remind potential buyers about it).  I regret buying it and we now use it only for the games, the screen is very good. I hope HTC will provide upgraded software for the touch-responsive interface so the function gets close to iPhone's, and on new phones, better battery life, a flash, and a slot to upgrade the memory to at least 8GB.", "Date": "September 19, 2008"}, {"Title": "take care", "Author": "Dennis Gonzalez \"Dennis\"", "ReviewID": "R3DGM9W0EWLA5P", "Overall": "1.0", "Content": "please, the description of the cel is different than the package you receive, it is not includ the front camera to video calls and without 3d touchflow, the seller can not give an explicationThe cel is slow, I miss the my sonyericsson 810i....", "Date": "June 29, 2009"}, {"Title": "htc diamond", "Author": "KIran", "ReviewID": "R2VJPNHK2A9KW", "Overall": "3.0", "Content": "Well, i dont expect the touch feature like Iphone. BUt still i feel that there is a need for improvement in the touch feature. Except that every thing looks good. The camera is good enough..", "Date": "May 22, 2011"}, {"Title": "I love it...", "Author": "Noam", "ReviewID": "RI66FAZOHHT8K", "Overall": "5.0", "Content": "The HTC Touch Diamond Unlocked Cell Phone International Version, is wonderful... I use it for the past two weeks and it works well.If you buy the product for Europe, this is the product you should have.HTC Touch Diamond 4 GB Unlocked Cell Phone with 3.2 MP Camera, MP3/Video Player, Windows Mobile 6.1--International Version with No Warranty (Black)", "Date": "March 3, 2009"}, {"Title": "Great!", "Author": "Y. Cooper", "ReviewID": "RV4TF0BMO5HI0", "Overall": "5.0", "Content": "My husband loves his phone. It has so many great features and the price was excellent.", "Date": "May 25, 2009"}, {"Title": "Good but not a IPhone", "Author": "Leonardo Guimaraes \"Leuziito\"", "ReviewID": "R2ACX6OFMEPZW4", "Overall": "4.0", "Content": "This is a really good phone but I think the touch screen is worse than IPhone. It not accpets memory cards, but the 4 gb is more than enought for me. Overall it is a good phone.", "Date": "October 12, 2008"}, {"Title": "Muy Buen Telefono", "Author": "J. I. Almanza Toscano \"Webmaster\"", "ReviewID": "R2WDPJY5PXBYQV", "Overall": "4.0", "Content": "Muy buen Telefono, el tamaño, el diseño, el GPS y en general No le pide nada al IPhone!.Los inconvenientes por asi decirlo son:La duracion de la bateria y que solo trae un cable para cargarla, estaria bien incluir un adapatador para el automovil.Otro Detalle es que para poder escuchar el radio tienes que utilizar los audifonos pues sirven como antena. Yo tengo un manos libres Bluetooth y tengo que cargar con los 2!El precio podria ser un poco mas bajo.", "Date": "October 3, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001AJ2FJE"}}