{"Reviews": [{"Title": "Not very good", "Author": "Brandon", "ReviewID": "R3EXHRB9CA758", "Overall": "1.0", "Content": "Touch screen is not sensitive enough. GPS software (Smart Navigator software) that come with it is really bad. Smart Navigator has a very poor user interface compare to OCN8. I couldn't use any other GPS software (TOMTOM, Iguidance). You can install them, but they wouldn't start. Garmin XT (One of the worst GPS software) works and Finally made OCN8 working by doing some editing.  Build quality is very poor. Feels plasticky. Very low call volume. If you are in the city you cannot hear anything. Poor battery life. Compare to HP iPAQ 910 Business Messenger it is very slow. In my opinion if you want a QWERTY keyboard enabled Windows Mobile device buy HP iPAQ 910 Business Messenger (it also has poor battery life).", "Date": "January 19, 2009"}, {"Title": "Great in theory....", "Author": "Samuel Goodin", "ReviewID": "R3MWX4SCW86PZ1", "Overall": "1.0", "Content": "From the specs, a wonderful smartphone. Except that voice dailing is unsupported. And that it apparently doesn't work with bluetooth certified devices. And let's not forget the GPS that can't find a satelite at night. Or the company's refusal to provide warranty support if you received one as a gift and therefore don't have a receipt.Let's also not forget the poor battery life and the microSD slot only accessable with the battery cover removed. My advice: buy anything else.", "Date": "August 29, 2009"}, {"Title": "Its a very decent phone with good customer support", "Author": "Edwin Rabbipal", "ReviewID": "R3BQVH5AXTM3EK", "Overall": "4.0", "Content": "My experience with this phone is different from other users. My previous phone, a blackberry .. was my 4th blackberry in under 2 years so I have officially given up on the company. They don't make phones like they used to. That's how I discovered this phone .. I was looking for a phone that could do all my tasks at work and still handle a decent phone call or occasional picture. Some of the reviews for this phone were outstanding and others were down right terrible. I found a good deal for it on the internet, ordered it, and it arrived within the week. Its features are really good and it could do everything my blackberry could (at least on paper) and more. I have used blue tooth with it - no problem. I used the gps at night - no problem. It was a little clunky with regard to applications but I changed my sd card from a 512mb to a 2 gig and that fixed it. I even upgraded it to windows 6.5 using a nifty hack by Erick Will. This phone puts my blackberry to shame. Now - on the other hand - my girlfriend has a google phone that makes my phone a little prehistoric in comparison. But, a lot of the applications I get standard with my phone (courtesy of windows), she has to purchase from android marketplace so I reckon its a win/win for me. I recently had to contact Pharos tech support due to an intermittent microphone issue. Their support was outstanding and offered to replace my phone under warranty (thanks Natalie). Hows that for customer service? Now, my largest gripe for this phone is its lack of accessories. Try finding a case or cover for it. Impossible!If Pharos still makes phones in the future, and I am still in a financial position to purchase a phone from them (since its a world phone it doesn't come from a cellular provider and must be purchased outright), I probably will get a Pharos phone again. That is a lot of \"if's\" especially in today's economy where no-one has any money and technology is getting faster and cheaper.  But, if you are in a position to give this phone a try, I would say you should go for it. Its a very decent phone.", "Date": "November 23, 2010"}], "ProductInfo": {"Price": "$269.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and US/International 3G compatibility via 850/1900/2100 UMTS/HSDPA plus GPRS/EDGE capabilities\nSmartphone with Windows Mobile 6.1 operating system; full QWERTY keyboard; 2.5-inch touchscreen\nGPS for navigation; Wi-Fi networking (802.11b/g); 2-megapixel camera/camcorder; Bluetooth for handsfree devices; MicroSD memory expansion\nUp to 7.5 hours of talk time, up to 200 hours (8+ days) of standby time", "Name": "Pharos Traveler 127 Unlocked Phone with gps navigation, Wi-Fi, Windows Mobile 6.1, 2 MP Camera, Media Player, and MicroSD Slot--U.S. Version with Full Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/41JFyWTzdpL._SY300_.jpg", "ProductID": "B001IBHWCE"}}