{"Reviews": [{"Title": "Good phone- Feature Rich - Good Camera", "Author": "S. Ashraf", "ReviewID": "R172Y8XRFJ5741", "Overall": "5.0", "Content": "Nokia N85 Unlocked Cell Phone with 5 MP Camera, 3G, GPS, MP3/Video Player, MicroSD Slot - U.S. Version with Warranty (Black)I purchased this with the free shipping saver option on a Thursday night, it was shipped Friday, I received it Wednesday.My previous phone was the Nokia N85 8GB and I have to say that I like this more. Its smaller, fits in my pocket, and screen is so much more brighter (OLED vs traditional LCD). I know there were some complaints about the builds quality of these devices, but rest assured the Nokia N85 has a great build (I heard some of the older copper ones had issues, but the black is of newer production).The camera pictures are great (probably the best camera out of all other camera phones) when viewed at a desktop sized zoom-in, but if you goto a 100% then it doesn't; I guess thats with all camera phones. If you need something sharper go get digicam or DSLR.Video recording is good too, Alot better and faster then those crappy webcams that are selling for like 70 bucks nowadays. Video recordings can also be geotagged (somehow).Maps are cool. Nokia allows you do download a Map Loader app from their website and download offline maps directly to your phone. I did that for a few states that I plan on visiting this summer. I love the geotagging feature and geotag every photo I take. You can upload them to Flickr, Panoramio, Google Picasaweb (and others), and they will recognize the geotagged information in the pictures and display them on the map. Quite cool.GPS locks fairly quickly without A-gps (for the ones who do not have mobile broadband plan).My recommendation to everyone who gets this phone, is to purchase some type of cover for the screen + body and my highest recommended product for that is the InvisibleShield from [...] I would install this within minutes of taking the N85 out of the box. Hey you gotta protect your investment!Some other features/options I like: slide to lock/unlock, slide to talk/hangup, auto. power saving mode, text-to-speech for incoming calls (says the name of the caller), there's a bunch more.The only negative thing I can say about the phone is that the keys can get a bit painful if you are a major texter. If so, then probably best to look into a qwerty phone (i.e. Nokia N97). Also the phone does get a bit warm when running the gps and camera for really long period of time. I ran it for an hour or so and it got quite warm for my taste.", "Date": "June 4, 2009"}, {"Title": "Nokia N85", "Author": "P. Lowe", "ReviewID": "R2530CSFKLR321", "Overall": "5.0", "Content": "The N85 is an awesome phone. Especially for the price.If you buy a Nokia make sure it has the latest software update. Which you can get from Nokias website. I found an update for the N85 that will allow for upgrade, from 8GB, to a 16GB micro sd card. The phone has so many incredible features they a to numerous to list. One of my favorites is the ease of using the N85 as a modem to connect your home computer to the internet. I don't know the connection speed, but it is fast.", "Date": "July 1, 2009"}, {"Title": "Nokia 4 Life", "Author": "J. DeRigne", "ReviewID": "R2C9LB2C68X5JE", "Overall": "4.0", "Content": "After researching for about one year and constantly changing my mind, I found it. The perfect phone. It has everything I was looking for and left me wanting nothing. The camera quality is great, and changing the settings are super simple. The screen is absolutely beautiful with rich vibrant colors. Call Quality is top notch. Music player is easy to use and video playback is superb on the OLED screen. The OS took some getting used to but I haven't purchased a new phone in about 7 years. So much power in such a small package. I haven't had any problems or glitches since turning it on. I have always heard that Nokia made great products and now I am a believer.", "Date": "June 20, 2009"}, {"Title": "Works great...When it works", "Author": "Konrad K. Miller \"Radman\"", "ReviewID": "R1P4JM0JIEXRMG", "Overall": "3.0", "Content": "I started my relatioship with the N85 after a messy ending with an LG incite. Alas that phone is now in the hands of my teenager being used as the toy that it is.My affair with the N85 started, as all affairs sdo, wonderfully. There was that period of getting to know each other followed by some time of operational bliss.Then, I started to notice little things. We would be driving along and suddenly she would stop communicating with my bluetooth headset, and then, just as suddenly, start again. She would do other strange things like acknowledge a voice command but then do nothing. She would ring but not let me talk to the caller or just not ring at all. Exaspreated, I packaged her up and sent her back to Nokia for therapy.She came back in a week but it was not long before she started with her tricks again, leading to another, albeit this time, all expense paid trip to Nokia.When I got her back, it was with a note from Nokia telling me that her condition was terminal, and try as they did, there was just nothing that they could do...so they gave me a replacement.N85 #2 was great, I referred to her as my \"megaphone\"; that was, until suddenly after a firmware update, she went crazy. I finally was able to calm her down by giving her her old firmware back (boy what a battle that was!); but she was never quite the same.She later fell victim to the muched blogged about \"N85 charging problem\". Because this issue can be treated via USB charging directly from the computer, I decided to live with her little quirk.At the end off the day, she is a great gal though for $400.00, I expected better.Update 12/2010:{cue TAPS in the background} Her warentee has expired and so has she. Though much of her functionality remained intact, her bluetooth and WiFi are almost non functional. Dropped calls were slowly becomming the rule and not the exception.On average she went back to the factory every 4 months and now in addition to the cost of her bus ticket, I would also have to cover the cost of the stay at Nokias spa for malfunctioning  cell phones. She has been laid to rest in the upper right hand drawer of the cabinet of misfit toys.RIP N85....RIP.", "Date": "March 30, 2010"}, {"Title": "Camera or Phone?", "Author": "Sregular", "ReviewID": "R2WPDUCAMMRT8L", "Overall": "4.0", "Content": "I have this phone for about 5 months and it's been really great for me.  I use this phone to check emails, watch videos and take pictures.  My favorite thing about the phone is the camera (5.0 megapixel).  I've read mixed reviews about the quality of the pictures and video, but in my opinion it's pretty awesome.  As with any device, you need to know how it use it.  I did have to learn what the best situations for the camera to take pictures, but once I did that it has become my favorite thing to use on the phone.  Is it really a replacement?  No, but pretty darn close.Taking video on the phone is pretty cool too.  For a phone, it takes great video (30 fps) in great lighting without any lag time even when following moving objects.  I've compared the quality with the HTC Hero a friend of mine has and the N85 is def better.  Low lighting is a little bit different but the duel LED flash turns into a light source and is great for taking low light video from about 10 feet away.I don't have a data plan so wifi was a must for me since I also use it for emails and just simple web surfing tasks.  The best browser in my opinion is the Opera mini 5 beta which allows for tab browsing.  The Youtube app works pretty nice and is a life saver when my daughter needs a quick distraction.Other info to note is that this phone is feature packed.  It has an OLED screen which is super bright, FM transmitter, FM radio, wifi, GPS, TV out using 3.5m jack (included), Bluetooth 2.0 A2DP and music player.The GPS is pretty slow if you don't have a data plan for some reason and you have to pay for turn by turn (it's free for 3 months if you get the phone new).  The FM radio is pretty handy in the office and I didn't think that I'd be using it as much as I do. Bluetooth is a great funtion for file transfers if ever you need to share files with others too.Pos:1.  Camera2.  Wifi3.  MP3 player4.  FM transmitter5.  OLED Screen6.  Bluetooth file transferCons:1.  User interface is a bit slow at times2.  Activating the camera is sometimes slow3.  Is prone to crashing if you try to do too many tasks at once.4.  Uploading pictures to Flickr and Ovi is nice, but whenever I try to do it, it shuts the phone down.  (I've started using Shozu as a work around)5.  N-Gage is very buggy.I really have been pleased with this phone.  It still amazes people who see the pictures on my Facebook how good the pictures can turn out.", "Date": "October 16, 2009"}, {"Title": "Great small engine", "Author": "Perez Gallinal Andres", "ReviewID": "R13WLEUEA455Z5", "Overall": "4.0", "Content": "Pros:- Features: it has EVERYTHING what technology can bring (but touchscreen)- Size: the same than a regular phone and smaller than a PDA- Brightness, definition and color quality of the OLED screen- high quality camera and lensCons:- life battery- Too poor GPS sensibility (some times it even seems not to work at all)- plastic case (I expected something really better from an N Series ...)", "Date": "August 2, 2009"}, {"Title": "a good smart phone", "Author": "Snarker \"Snarker\"", "ReviewID": "R1JE56KM7X2GE2", "Overall": "5.0", "Content": "I've been using this phone for about a month. Thus far I mostly love it.I like:- slim size- nice look;- quite easy browsing (though it was difficult to find some functions and also as I used a Siemens phone before, I had to get used to some new key assignments)- FM radio- music player (both give you sound of decent quality)- headphones that came with the phone (pitifully, without a mic)- wi-fi- camera is good as for a phone.I dislike:- it could be less expensive, the technology of wi-fi and A-GPS is not something that new;- charge indicator could be more uniform (last dashes disappear really quickly)- the screen is 'tender', I kept it for a day in a pants pocket with papers and cards, and it got those whity stuff on it. Not scratches happily.- A-GPS need about 5 minutes to find satellites sometimes. Also I had to find out on a forum that you need to go to the menu and check Assisted GPS in Positioning, so it works better now.- I still haven't found if I can manage the main screen text menu, it's kinda annoying.I'm still arguing if I like this A-GPS. It doesn't remember my previous position as usual car GPS units do. So every time - the first time. All the application I used this far worked well, though I haven't been using many of them. Also I didn't understand from the product description that it caomes with a 8 Gb card, so don't order any more! Please, read about this A-GPS before you buy it!I give it 4.5 stars.", "Date": "November 13, 2009"}, {"Title": "N85 after a couple weeks...", "Author": "Omar Noguera", "ReviewID": "RREKH0PM30HB6", "Overall": "5.0", "Content": "I've had the phone for a bit more than 2 weeks and only found 4 bugs.The first one is that you can't turn on the camera flash w/out recording a video like if it were a flashlight, silly but helpfull trick I used to use a lot on my previous Nokia 6265 when in the dark.Second, speakers could have been noisier. It sounds clear but lower than my old one-speakered 6265.Third, keypad is a bit uncomfortable untill you get used to it because it is all flat with no separate buttons and a bit small so if you have big fingertips it would be a bit harder to get used to it.The last one and more important is that I find the phone slow in comparison to my old 6265. I've heard that symbian phones were a bit slow so I don't know if this is \"normal\" or it's faster or slower than other symbian phones but i remember that i could be writting a SMS back just right after pressing Answer option, with this phone it takes 3~5 seconds before it allows me to start writting also it's a bit slower to get ready to shot a pic with the camera.Besides this sense of slow motion(dunno if it's normal for a symbian) and the other 3 minor bugs, it's an excellent cel phone, camera capabilities are far beyond expected, specially the superb video recording. Simply awesome when using high quality and very good on mid-low ones.Sound on calls (both sides of the conversation)is Excellent using the device and also using the included hands-free.Media sound using earbuds is also Excellent, Nokia earbuds offer less volume than regular earbuds but I think it's more a health restriction than a technical isuue so if you wanna hear your music rock loud, use another earbuds =)Screen resolution and energy duration is also good for the little device, which also feels very solid for a 2-way slider, and I really mean it, it Feels Solid.GPS, Bluetooth and WiFi work simply flawless with high data transfer ratio for BT and WiFi.So generally speaking it's quite an excellent cel phone if you like sliders.", "Date": "September 1, 2009"}, {"Title": "nice phone", "Author": "Ernesto Morales \"E.Morales\"", "ReviewID": "R3S468NMNPSZOK", "Overall": "3.0", "Content": "nice phone, with the latest technological innovations, gps, 5mp camera, etc, which I do not like is the keyboard is small compared to the average", "Date": "December 25, 2013"}, {"Title": "Okay phone", "Author": "srijay", "ReviewID": "R2JJ3CB7QZQNWY", "Overall": "3.0", "Content": "Does not compare to the smart phones in the market. I wish I had not spent as much as I did on this phone. Very weak in catching the signal. Buttons are not convenient. This is good just as a basic phone.", "Date": "May 30, 2012"}, {"Title": "Handle With (Extreme) Care", "Author": "Shinn", "ReviewID": "RU97DJ3JKKNRB", "Overall": "3.0", "Content": "This is actually a cute phone, however ... It didn't even last for a year. Somebody warned me that this phone is fragile but who would have thought that it was waaaay too fragile. The screen just got messed up all of a sudden without any reason -- you can't see anything but 2 different colors as if it was cracked or something. I never dropped the phone to begin with.My older Nokia Series and other units ... ? Just put a new battery in, they're still working properly.", "Date": "September 22, 2011"}, {"Title": "Removed 2 stars BECAUSE ................", "Author": "Fahed Naser Bo Arki", "ReviewID": "R9D7L618ZU3ZW", "Overall": "3.0", "Content": "I got this phone last year and everything was perfect until .....1 - some of the applications stopped working such as the N-GAGE app & the NOKIA web browser so that costs 1 star2 - i also noticed something that had really pissed me off ... when I lock the keypad from the lock switch it the keypad unlocks when i put it in my pocket and it calls my contacts and let them hear all the things that i say .. so that's the other star GONE  And that's it ............:)", "Date": "March 4, 2010"}, {"Title": "very smartphone !", "Author": "la", "ReviewID": "RRAJCZIEJ9T8P", "Overall": "5.0", "Content": "I have used Nokia for many years a go and now im very surprise how many funtions have the Nokia N85,  personaly I dont care about the camera and I never expect a very good quality cellular photos  bout this phone takes very nice pictures (in day ligth) the sound of the calls its very clear ! small and comfortable ! the taping text for me only takes a few days to accustum and now its ok. about the plastic construction of this phone I think is better to buy a case protection  like any electronic device needs!", "Date": "February 6, 2010"}, {"Title": "great product", "Author": "Essam M. Tabarak", "ReviewID": "RZPO8XCVL65X6", "Overall": "5.0", "Content": "If you are looking for a small sized cell phone with everything in it .. and i mean everything .. The only thing you may miss is the keyboard if you really care about one ..the display is super .. the speaker is little low but acceptable.. GPS works fine as well as the FM transmitter", "Date": "August 9, 2009"}, {"Title": "Great phone....", "Author": "Manuel A. Diaz V \"mdiazvilla\"", "ReviewID": "R2B10933D3DV08", "Overall": "5.0", "Content": "I bought it on friday afternoon, with free two-day shipping, it arrived on monday.I've been using it for a couple of weeks, and it works great, It is a multimedia computer, with all kinds of functions that you discover day after day. Definetly the nokia N series is the best, and this phone is on the top 5 of this series, Works excellent, and I'm happy with the option I've made, I was not sure about getting this one or the nokia 5800 Xpress Music, but I've finally decided for this one because of the ngage service. I totally recomended it....", "Date": "September 15, 2009"}, {"Title": "good standing for online shopping .with Amazon", "Author": "Tonni Fan \"sungphan\"", "ReviewID": "R17NP502WQ5EFQ", "Overall": "5.0", "Content": "Toi rat vui khi mua do qua mang luoi cau Amazon ,khi mua va goi hang nhanh chong ,va dong thoi re hon nua ,cam on rat nhieu ,day co teh cho cac ban VN doc xem nhe ,I'm very please with Amazon ,when we buy online ,good price ,good shipping ,and correct the day ,soo thank you Amazon .", "Date": "December 23, 2009"}, {"Title": "N85", "Author": "Deann Gore \"D. Gore\"", "ReviewID": "R2I8YRSIJ4ATH1", "Overall": "4.0", "Content": "Seems like a good phone. There aren't any clip on cases available for this phone that I can find, so if that is important to you you might look for another phone.", "Date": "October 16, 2009"}, {"Title": "Unhappy with this phone", "Author": "Pietro", "ReviewID": "RREYUWGMTSRTO", "Overall": "2.0", "Content": "With a very low use, the battery was exhausted after only five days instead of 15 as reported on the nokia website.I returned the phone and I got another one, but the problem was the same and in addition the sliding door was shaking.Also the keyboard is very uncomfortable.I gave two stars, since the reception is good as well as the speakers but in general I am very disappointed with this phone.I shipped it back and asked to be refunded.", "Date": "November 18, 2009"}, {"Title": "more or less", "Author": "Carlos Cedeno Davila", "ReviewID": "R28PZJ2NH6UN6H", "Overall": "3.0", "Content": "I bought two nokia n85 and one is good and the another have a problem with de bright of the screen", "Date": "August 16, 2009"}, {"Title": "Really Good", "Author": "Soliman A. Hamroush", "ReviewID": "R3990YTV93MRYW", "Overall": "5.0", "Content": "I bought the Copper and the Black one ( the copper 4 my wife ) - both were from Amazone , and ther are good , the sound is really good , wifi , Gps i used it and it was helpful... bye", "Date": "June 14, 2009"}, {"Title": "WIFI", "Author": "T. Tifft", "ReviewID": "R36DPUI0PGJU2E", "Overall": "5.0", "Content": "Yes, the N85 (black) does have Wifi and will work on AT&T; 3G network. You will be very happy with this phone.", "Date": "June 12, 2009"}, {"Title": "Great hardware - Bad software - Horrible support", "Author": "Kairat Mynbayev", "ReviewID": "R1LMRNOTW6DF2P", "Overall": "1.0", "Content": "Pros: N85 packs a lot of features in a small body - see other reviews. Some say it's flimsy - I disagree. I dropped it twice on the floor at home and once on asphalt in the street. It works as if nothing happened.Cons: People mention minor things. I'll talk about the most important. (1) When I was travelling outside the US, my N85 stopped functioning. The local service center refused to repair it, even for money, even though I had an invoice proving that I was the original purchaser. The representative said that's Nokia's anti-smuggling policy. What the service center did not want to do for $36, a local pirate did for $14. When I posted my negative review on NokiaUSA, they censored it out. (2) Only beginning users can be happy with Symbian. I am an advanced user, and I buy an advanced phone like N85 to be able to do many more things than Symbian allows.", "Date": "October 18, 2009"}, {"Title": "Wifi", "Author": "Gvinianidze Sofiko", "ReviewID": "RXNAQ6285Y4ZZ", "Overall": "5.0", "Content": "hello !i want to buy the n85 black today and theres not written that if this black model has wifi.so please tell me does it has?", "Date": "June 12, 2009"}, {"Title": "Too many features", "Author": "Samuel D. Langdon \"Sark_Amen\"", "ReviewID": "R3PMOXLAZMO7F3", "Overall": "3.0", "Content": "This phone is loaded, It had more than every feature I could have wanted. I ended up trading it however due to the fact it was to bulky for me to use in everyday situations.", "Date": "July 13, 2009"}, {"Title": "second hand", "Author": "Wei Sirui", "ReviewID": "R38Y2US31139X5", "Overall": "2.0", "Content": "damn,I have got a used N85,i cant use the GPS,and I found there are so many photos were taken at JUly 2008 stored at album.it looks like a old cellphone was renovate", "Date": "July 22, 2009"}], "ProductInfo": {"Price": "$492.00", "Features": "Integrated hands-free stereo speakers\nAutomatic redial\nTalking ring tones\nResolution: 320 x 240 pixels (QVGA)\nIntelligent key illumination", "Name": "Nokia N85 Unlocked Phone with 5 MP Camera, 3G, GPS, MP3/Video Player, and MicroSD Slot--U.S. Version with Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41WOS-VtOmL._SY300_.jpg", "ProductID": "B001WAKFBQ"}}