{"Reviews": [{"Title": "DONT BUY THIS PHONE", "Author": "jackrabit", "ReviewID": "R18R5O0ZOBAQVD", "Overall": "1.0", "Content": "I live in MX and bought 2, they are not unlocked and wont work on the telcel network  save your cash , DONT BUY THIS PHONE, unless you are going to use it on the Verizon network in the states, I also tried the black berry fourm to unlock them  with no luck , just spending 9 $ more each, a waste of time and cash.  jackrabit777", "Date": "August 13, 2011"}, {"Title": "Like it better than my HTC Evo for everything but internet and games...", "Author": "A4Q96 \"Gadget Lover\"", "ReviewID": "R12MML4A3102OZ", "Overall": "5.0", "Content": "I use a Blackberry 8830 World Phone (on Verizon) and a HTC Evo everyday.  The BB is my work device, and I own a HTC Evo as my personal phone (on Sprint).  Using them back to back, I can say first hand that for most of what I do, the BlackBerry is the better device.PROS OF A BB 88301.  My BB has been reliable,2.  Allows for quick email response wheenever and whereever,3.  Is great for calls with a bluetooth headset.  connects without issue and is pretty clear, few dropped calls (bluetooth dropping off, which happened all the time with my old Palm Centro)4.  The basic functions work well - datebook, contacts, to-do's, and memo's...  I used these for years on the Palm and while the BB is not as good as the Palm was (sigh), still works well enough.CONS OF the BB 88301.  Internet isn't the best... When I finally upgrade to a newer device maybe that will get better2.  Don't like the roller ball - I like the touch pad that you find on the newer Curve.Advantages of the BB over an Android phone (for me - BB vs. HTC Evo):1.  Less buggy - my BB crashes only a fraction of the # of times that my Evo Android phone does.2.  Reading and deleting emails is FAST on the BB - I can review 20 emails in about 2 minutes, tops, on the BB, including brief responses and deleting masses (when needed).  On the EVO, you have go to the separate delete screen and pick them there...  And reading and replying is slower, driven by the keyboard in particular.3.  Like the memo and to do applications - not as good as Palm (10 years ago) but at least they offer native applications for this kind of stuff (Android does not!!!!).One man's opinion, but I sometimes wish I'd skipped the Evo (and the extra $10 a month for 4G) and gone with a personal BB (in addition to my work BB).", "Date": "October 6, 2010"}, {"Title": "dissapointed", "Author": "DK", "ReviewID": "R1FFIKETQEJXNE", "Overall": "2.0", "Content": "Does not work with 2g or 3g.This was not clear on the item descroption. It only works with GSM netorks", "Date": "December 27, 2011"}, {"Title": "Awesome", "Author": "Emily", "ReviewID": "R2EKTIU41OPD5E", "Overall": "4.0", "Content": "I thought it was awesome for the price, it has alot of cool features to it.Theres only a few things i dont like about it, its the scroll button theres no faster alternative. it takes me forever to scroll through my messages. I like how its complicated with so many options on everything. I dont like simple phones, they get boring. But it also doesnt play videos on the internet. I love the music player. overall i think this phone is pretty amazing for the price", "Date": "May 23, 2011"}, {"Title": "CDMA and Unlocking", "Author": "Basil Rathbone \"Basil\"", "ReviewID": "R1SSB74W54467A", "Overall": "3.0", "Content": "I work in wireless so I thought I'd explain what is and is not possible.CDMA only phones ARE never unlocked, because there is no SIM in a CDMA only phone (not LTE) The only time you can buy an \"unlocked\" CDMA phone is if A: The phone is compatible with the Carrier, i.e. it is a Sprint, Verizon, US Cellular, Cricket (not that you would want to \"use\" Cricket's network) The phone's MEID in this case it's the DEC number tells a CDMA carrier exactly which model you own and whether or not its a device they sold.Now, if the phone has a clean ESN, (there are websites to check this) this means it is not stolen, the account is not in arrears, and that the original customer now uses another device, or bought unactivated.  ONce the phone is outside of contract the customer owns the device therefore it is a clean phone, or if you bought it unactivated. You're still tied to a carrier no matter what.It is possible to \"flash\" phones to for example take a Verizon phone onto Sprint. This is also not easy and you must have knowledge of rooting phones, flashing roms, If the aforementioned statement means nothing then don't try. Also don't expect all the features to work. Sprint and Verizon use different coding for their networks. You can \"unlock\" phones, but you must have knowledge of rooting, amongst other things. Also if you'd like everything to work properly, or at all, I don't recommend it. You can also destroy your phone too. If you have a phone you like don't do this or just give it to some dude unless this gentleman happens to have a PHD in software engineering.All the carriers put software locks on their phones, so even if you have a CDMA/GSM phone, you cannot pop a T-Mobile sim into a Verizon Droid 2 Global and expect it to work. There are no UNLOCKED CDMA only phones,  WHatever carrier the phone was built for is the carrier it will work for, assuming the phone is \"clean\". Now you can go to anywhere else in the world, take your CDMA\\GSM phone and it will work fine with whatever GSM carrier you buy a SIM from.As far as the Blackberry 8830 is concerned, save yourself the trouble and get another phone. There are androids with keyboards as well. Blackberry will not be around for much longer as an independent conpany so you might as well familarize yourself with Android, IOS or Windows Mobile. RIM is dying. There's a reason the carriers slashing their orders for RIM. Rim's market share has fallen every quarter. Ten years ago, Blackberry's were THE smartphone; unfortunately its still the same phone, gui and os  you bought ten years ago. They are built like tanks and extremely secure however, thanks to RIM's separate network.Back to CDMA. Even though most phones nowadays have the exact same radios, the CDMA carriers put software locks on for the US market. Verizon doesn't want you on T-Mobile. Now why you'd want to make that switch is another matter. But Verizon or Sprint doesn't care if you go overseas (CDMA is pretty much US only) because they aren't competitors. Hope that helps.", "Date": "September 24, 2012"}, {"Title": "junk", "Author": "junk", "ReviewID": "R31ZX6094ELY2J", "Overall": "1.0", "Content": "i just got this phone it said new lmao it been use more then my old phone oh an said it was un lock not true so dont waste your time an cash ..........junk junk junk ....", "Date": "March 22, 2012"}, {"Title": "All good", "Author": "Robert", "ReviewID": "R8X6DUDMWQNP9", "Overall": "5.0", "Content": "The phone was very good. 100% operative. Users from venezuela: Pueden ofertar ya que el telefono sirve para digitel y trabajan muy bien en venezuela, son rapidos y fiables, lo unico que tiene es que no posee camara, pero de resto son perfectos. Good  seller", "Date": "May 19, 2011"}, {"Title": "BUYER BEWARE!!!", "Author": "S. C. Bovell", "ReviewID": "R32FRMQCNYCXRM", "Overall": "1.0", "Content": "I HAD THIS PHONE THE BLACKBERRY 8830 IN RED, AND BECAUSE I LOVED IT SO MUCH, I PURCHASED ANOTHER AS A GIFT FOR SOMEONE WHO LIVES IN ANOTHER COUNTRY. THE PHONE WAS SUPPOSED TO BE \"UNLOCKED\" AND IT WAS NOT! THE BATTERY INCLUDED WITH THE PHONE LOOKED AS THOUGH IT HAD GOTTEN WET BECAUSE IT WAS SLIGHTLY SWOLLEN. NOT TO MENTION THERE WERE NO CORDS TO CHARGE THE PHONE AS PICTURED IN THE PHOTOS POSTED ONLINE. THEY HAVE TRIED TO HAVE IT UNLOCKED AND HAVE BEEN UNSUCCESSFUL. IT WAS, THEREFORE A WASTED PURCHASE!! I AM NOT HAPPY WITH THIS AT ALL!AMAZON, PLEASE CREATE SOME KIND OF SYSTEM WHEREBY YOU CAN VERIFY THE AUTHENCITY OF PRODUCTS VENDORS ARE PUTTING ON YOUR WEBSITE FOR SALE! THIS IS JUST RIDICLIOUS!", "Date": "June 4, 2012"}, {"Title": "Blackberry 8830 World Edition (WE):  Best Cell Phone--Ever Made by RIM!", "Author": "Russell Johnson", "ReviewID": "RXWZA3TFLTECB", "Overall": "5.0", "Content": "I think this is one of the best cell phones ever made for someone who only needs to do texting and/or calling from anyplace in the world.  The BB 8830 World Edition can access the Internet and you can check your e-mail with it, too--etc.  However, I would rather do those activities using my home computer.  Alternatively, my recommendation for someone who wants a touch-screen device (3G or 4G or later) with lots of \"bells & whistles,\" should probably get an iPad 2 (or later edition) or some other contending product.Note:  If you are considering purchasing this cell phone (BB 8830 World Edition), make sure you understand whether the phone is being sold as a \"locked\" or \"unlocked\" device.  If you need further “enlightenment” regarding “locked” or “unlocked” devices, then, do an Internet search for that information.Also, determine if the phone is:  (1) \"New\" (never used); that it comes with or without a SIM card; (2) it has a new/unused battery; (3) it has a battery charger or battery charger USB-to-electrical outlet cable; (4) a complete user-guide manual versus an abbreviated version (that tells you little or nothing); (5) that it has a USB-2 data cable to connect the device to a computer--for  downloading a BB OS v4.5.0.311 or later version software for the phone (e.g., probably the easiest way to upgrade the BB 8830 OS it to go your service provider’s web site and find the specific BB 8830 World Edition OS).Additionally, the BB 8830’s battery can be recharged (while in the cell phone) via the USB-2 cable if the Blackberry® Desktop Software is installed (on one’s computer).The USB-2 data cable can be used to copy an existing address book from a BB 8830 World Edition to your computer for backup, etc. via Access Manger’s Software).  And, this is recommended just in case the BB’s OS crashes and needs reinstallation.  That is, reinstallation will wipe-out all existing information or corrupted files.  So, if you have a copy of your BB 8830’s address book--“all is not lost.”  In addition, it is probably a best practice to write down all of your personal settings for you cell phone--just in case you need to reconfigure all of them anew.Moreover, if the BB doesn't have one or more of the following:  A SIM card, desired memory, and, battery, etc. then, those accessories will have to be purchased separately (from a wireless service provider or an Internet-seller of cell phone accessories, etc.).Likewise, if you buy a \"locked\" version of this phone which works with a particular wireless service provider (e.g., Verizon Wireless, T-Mobil, etc.), then, you will have to take it to them for configuration-access and to get a service plan through their network.  On the other hand, if you want to \"unlock\" the cell phone so that you can freely choose a service provider and/or to purchase prepaid card/access--then, you can go to a wireless service provider (of your choice) who can or will \"unlock\" it...if you purchase some type of data service plan (and, if necessary, a SIM card).Note:  Make sure that when considering a SIM card purchase that it is compatible with your intended cell phone usage.  In some cases, it might be wise to have several SIM cards which relate to local and/or international travel.If you can go on the Internet and find/buy a specific BB 8830 World Edition \"unlock\" key-code (for a “locked” BB 8830 WE)--ensure that you have or will have a SIM card and some type of data-access-plan.  Furthermore, it is advisable that anyone using the aforementioned cell phone should get or download the BB 8830 World Edition User Guide (a complete booklet print-version is an included OEM accessory) and Access Manager.Note:  VZ Access Manager (for Verizon Wireless users) and the BB 8830 World Edition User Guide both come on an OEM CD--but if you’re buying this cell phone online, the OEM CD may not be included.  However, VZ Access Manger (which might be the same as the Blackberry® Desktop Manager), User Guide (partial or full version), and are available for download from various sources on the Internet.  The full version of the Blackberry 8830 World Edition User Guide is probably your “best bet,” because it illustrates all of the phone’s features & abilities.  Also, if you download the User Guide, while reading it, you can set the viewing size for your convenience.--Russell", "Date": "September 19, 2013"}, {"Title": "still waiting for the phone charger", "Author": "yusif ibrahim", "ReviewID": "R27PF4NR7FQXYP", "Overall": "3.0", "Content": "u sold me this phone and told me that charger is on the way and is been 3 month,when is the charger coming", "Date": "March 4, 2013"}, {"Title": "sucks", "Author": "ll", "ReviewID": "R30MK7SUA62J0T", "Overall": "1.0", "Content": "this phone came looked fine a biy of scratches here and there but it doesnt work here in the united states its too old!!!!! do not buy unless its for out of the country use.", "Date": "September 3, 2011"}, {"Title": "too bulky and no camy", "Author": "Tough critic \"Kim\"", "ReviewID": "R1OAQI913T46E8", "Overall": "4.0", "Content": "I travel overseas about twice a year so I got this because I switched to verizon and want a blackberry. It is bulkier than the other smartphone and doesn't have a camera.  Otherwise everything works the same.  It is a solid phone, but I think I'll see if there is another blackberry by the time my contract is up that has a camera.", "Date": "March 31, 2010"}, {"Title": "Advertised as unlocked, but locked to versizon and can not be unlocked", "Author": "amazonreview", "ReviewID": "R37GQKOVK1XREJ", "Overall": "1.0", "Content": "Amazon lists this phone with the unlocked phone.  It is in fact locked.  I contacted the seller who told to buy the unlock code and then maybe I'll be able to unlock.  I bought the unlock code, but was unable to enter it.  This phone will not work with ATT.", "Date": "October 8, 2011"}, {"Title": "Works great, nothing to complain about", "Author": "Jynxy in the sandpit \"Jynxgirl\"", "ReviewID": "R2IBDPDNSC28B2", "Overall": "5.0", "Content": "If you are looking at this phone, then most likely you are in need of a phone without a camera. Phone arrived and had to unlock. Was simple to do over the net and instructions pretty much come with any unlock code you buy. Quick and simple. The phone I got was a refurbished phone from a business that had a firewall on the phone. The phone had to be wiped clean as no one could get rid of it. If you are having ANY issues, just look up wiping the phone clean and it will erase the phone back to square one. You will lose any upgrades or so forth but if you are having an issue, this may be your only option. Battery life isnt great but I am on it alot. Usually am out of batteries by late in the afternoon each day. There is an extender batter but is nearly as much as I paid for the phone. Buy a car charger or an extra charger to charge the phone while at work. The phone sounds clear, all buttons work, and happy with it.", "Date": "March 30, 2011"}, {"Title": "AWESOME", "Author": "PinkOracle", "ReviewID": "R2JBO4KZGRR4VA", "Overall": "5.0", "Content": "Simply just a all around good phone, only thing was I had to charge it when I got it. But I loved it none-the-less!", "Date": "January 3, 2014"}, {"Title": "Good", "Author": "Rj", "ReviewID": "RB2QRGYL6SKUF", "Overall": "3.0", "Content": "It is very good but some thing that are ok but no that good but I still like it a lot.................", "Date": "November 23, 2013"}, {"Title": "phone is great. wish it hadn't been locked", "Author": "Clive", "ReviewID": "R3SQGEXUYT39QM", "Overall": "4.0", "Content": "the phone was great but when I recieved it apprently it had an IP Lock on it and it cost me 2 days and $200.00 to get it working and receiving emails. I was really not happy about this", "Date": "May 24, 2013"}, {"Title": "ok", "Author": "Forns Arlette", "ReviewID": "R10MK36JG6JN91", "Overall": "4.0", "Content": "Still use it,came in locked,had to get a code to unlock it.It loses service and I have to keep doing a battery pull each time to reset it.Still using it but I would still recommend it as a good product.", "Date": "February 10, 2013"}, {"Title": "blackberry 8830 word edition", "Author": "sergio", "ReviewID": "R2FWBSWYVDHTYO", "Overall": "5.0", "Content": "good day, then tell them that the product and was in better condition than I expected, proper operation and support they provided me with the unlock code was fast dem by email which attached with the phone, I am satisfied", "Date": "August 4, 2011"}, {"Title": "Not Happy", "Author": "Loopy2", "ReviewID": "R3TBVPDUHXIZNF", "Overall": "1.0", "Content": "I ordered this BlackBerry 8830 World Edition for Verizon supposedly unlocked cell phone from \"The SellPhoneShop\"... Number 1... it was very poorly packaged. Number 2 no battery or all the items that should have been in the box as pictured. Number 3 I don't even know if this cell phone will work since I don't think it's unlocked. It is to be used in Africa for a Peace Corp worker.. Number 4 I would never order from \"The SellPhoneShop\" again. The only plus that it got here pretty fast, but so poorly packaged for such a high priced item, I'm surprised it got here in one piece and that it didn't fall out of the huge hole in the package!", "Date": "December 23, 2010"}, {"Title": "wrong decison", "Author": "steve sego", "ReviewID": "R36Z567MYHQ67E", "Overall": "1.0", "Content": "Tried to buy a used phone, however it did not work out, phone did not function properly had to return, still waiting for a refund.", "Date": "June 17, 2011"}, {"Title": "Great Customer Service", "Author": "Frank Fla", "ReviewID": "R11AHBDM37QYVZ", "Overall": "5.0", "Content": "I order a Blackberry Verizon phone, needed a Blackberry Sprint phone, I notified the seller, we made the exchange. Both phones were in very good condition.Phone is working great, great customer service.Frank from FLA", "Date": "August 15, 2011"}, {"Title": "In the end....", "Author": "Justin", "ReviewID": "R160XS6TZ65QCR", "Overall": "4.0", "Content": "In the end....Great! I recieved a defective phone from this company that somebody had sold to them, and i sent it back and I sent it back and they sent me a replacement phone RIGHT AWAY and I recieved it within the next 2 days and it worked Perfectly. :)...Not exactly how i wanted it to go but they did their job!", "Date": "January 3, 2011"}, {"Title": "BlackBerry 8830 Wold Edition for Verizon (Silver)", "Author": "Jacqueline A. Hauser", "ReviewID": "R1BZ2IUJ1DUZR3", "Overall": "5.0", "Content": "GREAT purchase!  LOVE this product!  Exactly as described! Has actually lasted longer than the one I got through my cell phone company!! Thanks so much!", "Date": "November 28, 2010"}, {"Title": "Great business smart phone for business travelers with Verizon account.", "Author": "windriverbasin", "ReviewID": "R1J6HJ1TKNMY26", "Overall": "4.0", "Content": "The Blackberry 8830 World Edition smart phone is a great work phone allowing one to keep track of business e-mail on the go.", "Date": "October 5, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "64 MB of built-in memory and an expandable microSD memory slot1,2.\nHigh-resolution, light-sensing screen\nA full QWERTY keyboard layout for fast text and email composition.\nHigh capacity battery", "Name": "Blackberry 8830 World Edition Mobile Phone - Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/51pqeznFmQL._SY300_.jpg", "ProductID": "B001THEJZK"}}