{"Reviews": [{"Title": "Sleek and stylish but leaves a bit to be desired", "Author": "Steve in STL", "ReviewID": "R2J1FXOCUBBZFM", "Overall": "3.0", "Content": "I've had this phone for almost a year now. I love the looks and the feel of the phone but it does leave a bit to be desired. The worst thing so far is that the case cracked towards the top so the back cover now easily comes off. I'm not even sure how this happend. It's never suffered a hard fall or anything of that nature.Another issue I have is the volume for both the ring tones and during voice conversation. I'm only 35 and still have decent hearing but even on it's loudest settings, I have a hard time hearing it ring or hearing the person on the line when there is minimal background noise.The phone offers basic functionality which should be sufficient for those who aren't looking for an all-in-one device. I just use my phone for voice and an occassional text message and picture so the functions are fine for me. Those younger folks more into the cell phone craze may be disappointed with basic features.Overall I like the phone for the looks and feel. If I had to do it again, I'm not sure I'd make the same purchase.", "Date": "June 12, 2007"}, {"Title": "The best phone ever!", "Author": "Anna M. Contreras \"Humpty 61\"", "ReviewID": "RQWA8MKM1DXJB", "Overall": "5.0", "Content": "I purchased the Motorola U6 Pebl to replace the one I had damaged awhile back.  But, before ordering this I had been given a replacement from my carrier. The replacement was a simple LG silver flip phone. Sorry to say it did not hold a candle to the PEBL. The feel of the PEBL just seems to fit naturally in the palm of my hand and is small and accurrate.  I really love this phone and the features it comes with. Bluetooth, photo, easy texting features. This is truly the best phone I believe Motorola has developed. True love........", "Date": "June 11, 2009"}, {"Title": "very good", "Author": "zar22", "ReviewID": "R1YXHLKEQUROW6", "Overall": "5.0", "Content": "very funtional, as described and fast shipp. Useful for my country, and works with any gsm carrier aroud the world", "Date": "March 4, 2013"}, {"Title": "Excellent Phone and Excellent Seller", "Author": "Alex", "ReviewID": "R1LU0ZYRFQC02", "Overall": "5.0", "Content": "The Phone was just perfect. Came \"As it says on the tin\"! already started operating and the battery lasts atleast for 3 days when you charge once.  Excellent and mint condition. I love to buy from this seller in the future. If there was only more stars than 5, I would have given more. But for the time being, they will have to do with 5 star.Alex", "Date": "June 1, 2012"}, {"Title": "Pungent", "Author": "Pungent", "ReviewID": "R9VKX8W0XQ49T", "Overall": "5.0", "Content": "This is my most favorite phone ever! I loved the editing options for this phone. I could cut and paste messages and believe me after a 3-6 page message that needed editing this is an AWESOME option! I really miss this. I remember that the video/photo's were great as well. Everything else is as great as any new phone out there now. I would recommend this phone to anyone that wants an awesome basic phone.", "Date": "November 30, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "New\nNo Sales Tax\n3 Month Warranty", "Name": "Motorola U6 PEBL Unlocked QuadBand GSM Bluetooth Cell Phone - black", "ImgURL": "http://ecx.images-amazon.com/images/I/111HzFepTFL.jpg", "ProductID": "B00164ZD7Y"}}