{"Reviews": [{"Title": "wow!", "Author": "fluffypants", "ReviewID": "R2924XVOC0AR36", "Overall": "5.0", "Content": "i love this phone!! i would buy it for other friends...trust that you will receive a new phone with excellent quality. Also it got to me quicker than expected.", "Date": "May 4, 2012"}, {"Title": "Excellent cellphone", "Author": "A. V. Garcia \"qat\"", "ReviewID": "RRBI87SE1SP7G", "Overall": "5.0", "Content": "Great camera, and excellent features very glad of purchase great price.I recommend very well this is the 3rd lg phone i have and i'm satisfy.", "Date": "April 26, 2012"}, {"Title": "The phone gets 4 stars for it's price!", "Author": "Harsh", "ReviewID": "R2L123ZB8XLLT5", "Overall": "4.0", "Content": "Pros- The phone looks really nice than it appears in this picture and it also comes in a really attractive box.  Speakers are not loud but it's clear & if you use earphones you will love it.  Camera is fantastic.Cons- It attracts fingerprints that I don't like.  Wi-fi should not be your main use if you buy this phone.I tried to play Youtube video but it didn't work.", "Date": "March 6, 2011"}, {"Title": "not too bad", "Author": "Min Cheng", "ReviewID": "RD7P26H1D5SMI", "Overall": "3.0", "Content": "not easy to text, but easy to call othersno good Internet serviceIt would freeze when it s not in mood", "Date": "November 15, 2011"}, {"Title": "Alright, not great, but....", "Author": "Victor G. Rodriguez Jr. \"Guru Regurgitator\"", "ReviewID": "RDW4DEWTPAQ9B", "Overall": "2.0", "Content": "I only wanted two things from this phone: a good cell phone and a great camera.The camera is good at 7 mgpx, but the flash is disappointing. Also, I have had troubles downloading the pics to my computer. 2/3 the time, the process crashes my computer. Not good.I am sticking to buying a smaller phone, then carrying a good camera. This phone disppointed me.", "Date": "March 5, 2010"}, {"Title": "Caution!", "Author": "This Guy", "ReviewID": "R2V9BYEEZDV27V", "Overall": "3.0", "Content": "I have had this phone for a couple of weeks I looks and works great. I didn't give the phone five out of five for the fallowing reasons. I had trouble finding the correct setting for inter net and mms. I still can't access the 3G network. Other than that the camera is great for video and pictures. These are the setting I found for at&t.;Phone Setting>Connectivity>Access Point: (Data Setting)Title: AttBearer: GPRSAuth: PAPUser: WAP@CINGULARGPRS.COM (all caps)Password: CINGULAR1 (ALL UPPERCASE)APN: wap.cingularBrowser>Settings>Profiles: (Internet Setting)Service Name: Media NetHomepage: [...]Connection mode:  proxy onIP: (66.209.011.032)proxy: (8080)Security: (blank)Access Point: ATT", "Date": "March 21, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nTri-band GSM cell phone compatible with  900/1800/1900 frequencies and International 3G compatibility via 900/2100 UMTS/HSDPA plus GPRS/EDGE capabilities\n3-inch auto-rotating touchscreen; Flash user interface; 8-megapixel camera with Schneider-Kreuznach optics\nGPS navigation and geo-tagging; Wi-Fi networking (802.11b/g);  MicroSD memory expansion; Bluetooth stereo music; organizer and document viewer\nUp to 3 hours of talk time, up to 264 hours (11 days) of standby time\n3-inch TFT LCD display\nAuto-rotating touchscreen; Flash user interface; 8-megapixel camera with Schneider-Kreuznach optics\nThis unlocked cell phone is compatible with GSM carriers like T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint. Tri-band GSM cell phone compatible with  900/1800/1900 frequencies and International 3G compatibility via 900/2100 UMTS/HSDPA plus GPRS/EDGE capabilities", "Name": "LG KC910 Renoir Unlocked Phone--International Version with No Warranty (Titanium)", "ImgURL": "http://ecx.images-amazon.com/images/I/51FAgkno8rL._SY300_.jpg", "ProductID": "B001GT9GRW"}}