{"Reviews": [{"Title": "Good phone for the price ($50), but with big caveats.", "Author": "kmeister", "ReviewID": "R17X81J80OPNAU", "Overall": "4.0", "Content": "For someone considering getting a cheap budget phone for texting and occasional web use, this phone is almost a no brainer.  Rather than settling for a feature phone, why not go for a full fledged smartphone for only $20 more?Because activating the phone is a complicated procedure.  The operating system this phone runs REQUIRES that you create a profile/account with Palm before you can do anything with it.  This step CANNOT be skipped, unless you would like to perform some fairly involved software hacks.  The problem with the activation step is that the process requires CELLULAR data.  It's not possible to turn WiFi on without getting past the activation step.  This means that to activate the phone, you WILL be charged for data use.Additionally, because the phone was originally released for AT&T; (it does come unlocked), it is incompatible with T-Mobile's 3G network.  You'll only be able to get EDGE on T-Mobile.  If you are planning on using the phone on T-Mobile, you'll may need to change the internet APN to \"epc.tmobile.com\" before the phone is able to connect to the internet and create your profile.After you get past the troublesome activation step, you'll find a very intuitive operating system running on insufficient hardware.  That is to say, the phone is very slow compared to the current crop of smartphones.The battery life isn't particularly fantastic either, and you'll likely find yourself charging the phone every night.With ALL that being said, I still feel that the phone is great value for money.  The call quality is fantastic, the keyboard is solid, and webOS is a pleasure to use.  This is why I still give it 4 stars.", "Date": "April 25, 2013"}, {"Title": "Can't beat the price for an unlocked smartphone", "Author": "Carlos ochoa", "ReviewID": "R26PKO9WHVFM5X", "Overall": "4.0", "Content": "I got this phone as a temporary replacement for my dead iphone, so I already had a number & data plan. that made the intial setup & registration with PALM very easy.  Within 5 minutes I was already using the phone & it's features.  The minor drawbacks are the very limited options when it comes to aps, but as long as you have a data plan or wifi, the browser more than makes up for it.  I like having the full keyboard, but I miss the ease of typing with the touchscreen.  Considering that you can get a \"new\" unlocked smartphone with wifi, email, internet & a full keyboard for the average price of a prepaid phone (not to mention double the storage of the basic iphone) it's a great choice.  I didn't give it 5 stars because the description says that it's \"new\", but the previous owner left his pictures on the phone.  Other than that, it was in \"new\" condition.", "Date": "June 20, 2013"}, {"Title": "Good Phone once you fix the software error", "Author": "shawn wyatt", "ReviewID": "R2MJU02GECUP3P", "Overall": "5.0", "Content": "He phone works great know i had it 2 days and the phone would drain the battery in hours. An would over heat when charging it. It was hot i almost couldnt hold it. So i did some searching and found out others had the same problem. I also could not get it to usb mode. It just wouldnt work. So I change some setting think that my email and facebook wore draining the battery. But it didnt matter it was like was on the phone the hole time, So i even removed app and it still was drain in 2 hours. So late last night i when on hp webso and found a webso doctor. it reset the phone and installed OS on my phone. today the battery holding a good charge and when i plug it in to a computer it gives me a chose of charging or usb mode with it didnt do before. it been 3 hours and it  still in the 90 percent charged. I got my phone form keerkeerwireless off amazon. but here is the link to webso doctor http://ws.hpwebos.com/webosdoctor/sorry.htm;jsessionid=B42C0B9FE9E57BC3EC9CF758F4956F43.MMMM_31", "Date": "June 2, 2013"}, {"Title": "Couldn't get past set up", "Author": "shady", "ReviewID": "REQD6MX05Y3JP", "Overall": "3.0", "Content": "im used to being able to just pop in my sim and go, however this requires you to create a palm account which i was unable to do even after following all the great advice in the customer review section. The phone looked great and felt great in my hand but ultimately i had to return it.If the seller offered more details and step by step instructions on how to get the phone set up and working i would consider repurchasing.", "Date": "June 23, 2013"}, {"Title": "Good phone for the price", "Author": "Twisted", "ReviewID": "RZRQEMH1I05KO", "Overall": "3.0", "Content": "Well priced phone and good built quality.But the downside is that soft wares like watsapp and etc. are not available for the OS.If your not a mobile internet user this is a nice phone to buy.", "Date": "January 30, 2014"}, {"Title": "GREAT PHONE", "Author": "kayla cage", "ReviewID": "R30S98BS6ZMQRN", "Overall": "4.0", "Content": "this is an amazing phone I love it! There is only a couple of things that need to be better one this phone and that is battery life, I haven't quit figured out how to download music on it from my computer and apps! I think this phone is well worth the money and is a multitasking monster! I was seeing how many cards I could get open and I got I think 55 before I decided I was done. Webos has done a great job with this phone but I'm sure the newer ones are better. I love the keyboard!!! I would give this phone a full 5 stars if the battery life wasn't bad. I came to this phone from an iphone 3gs I loved my  iphone it was a great phone but I almost like this one better. If it wasn't my battery percentage has dropped 8% just from typing this review I would absolutley love this phone better than the iphone. So over all I this is a great phone and it could use a few little adjustments but it's a great quality from such a low price!", "Date": "July 22, 2013"}, {"Title": "good phone, but problem with volumen keys", "Author": "Alejandro C Galicia", "ReviewID": "RHI3KYZ92ETSL", "Overall": "3.0", "Content": "good phone , simply use.....but when arrive this producto the problema was that volum keys don't work........magnific softwaregood for sent email and Messenger", "Date": "July 18, 2013"}, {"Title": "Great", "Author": "Daniel Chavez", "ReviewID": "R234IMMIE8YW5L", "Overall": "5.0", "Content": "It was a great buy, good phone for a great price. I recommend it to anyone looking for a cheap but great phone with good features.", "Date": "July 13, 2013"}, {"Title": "Phone didn't work", "Author": "L. Jordan \"L Jordan\"", "ReviewID": "R3IAFRU0BNYCVJ", "Overall": "1.0", "Content": "The phone came packaged as if it was brand new from the manufacturer. I plugged it in to charge it and after a few minutes it just shut off. Did not ever move past the first page. Put a fully charged battery in it from another phone and it shut right off again. Sent it back and requested a new one to be sent to me but Amazon was too quick to refund my money so while sitting here waiting for another one to show up I finally read my emails and I have to start the process all over again. Just getting impatient. I needed a new phone a month ago.", "Date": "July 7, 2013"}, {"Title": "Okay", "Author": "Torn123", "ReviewID": "R1C6A89A7AG7ZU", "Overall": "3.0", "Content": "Nice phone, runs on Palm OS. Great for price. but it isnt unlocked on Walmart's Family Mobile Network. But for a non-advanved smartphone user, just wanting something simple and smart, its perfect", "Date": "June 17, 2013"}, {"Title": "Early setup difficulty but resolved and it is truly outstanding", "Author": "Paulo", "ReviewID": "R30339MJAJVXJJ", "Overall": "5.0", "Content": "Like many reviews I have read, I too had profile and connectivity problems. I was stressed because every other phone I had, I put in the sim card and it was working perfectly. I thought the phone was going to be impossible but my cellular service (Consumer Cellular) was called and their tech people just gave a \"ok lets get it working\" and they directed me on what to input, how and where and boom...worked and continues to work perfectly. The phone is NICE. Aside from that early unexpected work, it is something I am happy with!", "Date": "April 20, 2013"}, {"Title": "Great Phone, Doesnt' Work Well With ATT Unlimited Data Plans", "Author": "Adam F. Jewell", "ReviewID": "R14LCX9K48LMCL", "Overall": "2.0", "Content": "I've been a big fan of the Palm Pre Plus since it came out.  The phone rocks, has an awesome interface and multitasking is phenomenal.  I've got an old unlimited data plan on ATT and had a Palm Pre Plus (actually two of them) that worked just fine with the ATT unlimited data plan.  I took this phone in to have it activated on my current data plan.  ATT put in a new SIM chip and after struggling through the profile stuff at the start, it worked just fine.The next day it was getting no net.  I took it back to the ATT store that activated it and stood there for an hour or so before the guy said I'd have to call ATT to get them to do something to get it to work.  I called ATT and they couldn't do anything unless I was calling from anther phone so I got to another phone and spent an hour on the phone with ATT.  The problem could not be resolved.  They put in some kind of ticket to investigate.  After about a week they sent a text message that said the investigation had been completed.The phone still wasn't getting Internet access but the case had been resolved.  Brilliant, thanks ATT!  I then called ATT again and got another rep at some special investigation line.  He started to go through the same scripted thing they went through before and said I'd need to once again call from a different phone so they could troubleshoot the phone.  It didn't work the first time so I opted not to go through it again.If there is no problem with the ATT network, then their must be something in this particular version of the Palm Pre Plus that is different from the other two I've had.  I know it can work with the ATT unlimited data plan because it did work for about 12 hours but then stopped.The phone has never been wet, dropped or abused in any other way.  It's now been two weeks with no net on this phone so I'll have to send back the phone and come up with something else for a working cel phone.", "Date": "March 18, 2013"}, {"Title": "Multitasking it is!", "Author": "Oleg B", "ReviewID": "R1JC0AVKVU9I51", "Overall": "5.0", "Content": "Love it! Can't tell enough how satisfied I am with the product. Just awesome! Multitasking, pictures quality, 3G internet is blazing fast.. Where available. But its T-Mobile. Of course Verizon was faster, but $125 vs $58 for the plan.. Hmmm.. I pick T-Mobile.. Try for yourself, you won't regret. Get a touchstone charger to appreciate the phone even more! Enjoy!", "Date": "December 22, 2012"}, {"Title": "Quality", "Author": "Augustina Essien", "ReviewID": "R133RNRWQ95L58", "Overall": "5.0", "Content": "This phone is portable and easy accessible every where i go. It is very fast and enjoy using this phone", "Date": "August 21, 2013"}, {"Title": "Great affordable phone", "Author": "A M", "ReviewID": "R1ZYWGQUMONVXD", "Overall": "5.0", "Content": "Item was in the condition described and works perfectly. I you want a spare smartphone this is the one to get.", "Date": "April 29, 2013"}, {"Title": "Not able to get passed registration screen", "Author": "Karen E. Rodriguez", "ReviewID": "R2UEJIILGRNQBS", "Overall": "1.0", "Content": "**Disclaimer*** This review is to reflect the product, not the seller.I ordered this for my mom for her birthday, but when I was trying to activate it, the phone would not let me create a Palm profile. I used 3 different sim card, 2 with internet plans and it would fail every time. I think it is ridiculous that you have to create a profile to make the phone fully functional. Also, once I turned the phone on, it defaulted autmatically to Spanish and did not ever offer the choice to choose the language. I am returning this item today, and ordering a more simple touch screen for my Mom.", "Date": "March 13, 2013"}, {"Title": "it sucked!", "Author": "Chris", "ReviewID": "R2X2SUJ9UJEIWY", "Overall": "1.0", "Content": "Phone was not good at all! Battery would die in 2 hours  and just wouldn't work charge it up and then die! Don't buy this phone! Not worth it and I think hp should stop caring this phone so people don't have to go threw what i did!", "Date": "August 27, 2013"}, {"Title": "unlock", "Author": "dredar", "ReviewID": "REV4NUXIZ1H5F", "Overall": "4.0", "Content": "hi. if I now will update webos, unlock on phone for eny gsm operator will earase?and phone have greate parameters", "Date": "August 14, 2013"}, {"Title": "To Restricted", "Author": "TinoC20", "ReviewID": "R1S5WIBBLOJUM", "Overall": "3.0", "Content": "The phone is good but at the beginning there is too many restrictions that does not get to the point. I suggest no one buy it for international use.", "Date": "August 9, 2013"}, {"Title": "don't trust it", "Author": "Muhammed", "ReviewID": "R18FH1JOEDHM0", "Overall": "1.0", "Content": "This item is not as described. it is written that it is UNLOCKED but they don't tell the truth. I bought it it is not unlocked and din't work outside USA. no arabic included GSM does not work. It is just terrible and not easy to use. I wish I could never buy it.", "Date": "August 3, 2013"}, {"Title": "Worst phone", "Author": "Rahul Cherekar", "ReviewID": "RNXXEW0BZNC85", "Overall": "1.0", "Content": "Don't ever buy this handset. My wife bought this handset as a gift. After a month, the touch screen stopped working, in another few days even the battery stopped working. After my discussion with Amazon customer care the guaranty was valid only for first 30 days and I need to work with HP customer care for issues with the handset.", "Date": "June 3, 2013"}, {"Title": "It has a very bad software", "Author": "Caroline Torres \"CATM\"", "ReviewID": "R1NCTEG9RKQU1S", "Overall": "1.0", "Content": "Was terrible!!! I bought this item because is unlocked and I thought that it will works with the celular lines from my country: Costa Rica.Buuut.... the software doesn't work!Don't buy this product! In special if you are from another country!", "Date": "April 6, 2013"}, {"Title": "It's Great--It Just Wouldn't Cooperate", "Author": "Insert Cool Name Here \"Flow\"", "ReviewID": "R3HGCIKRDWQK26", "Overall": "4.0", "Content": "I own an older Palm Pre 8gb, so this was in my comfort zone. I bought it mainly just to be an mp3 player, but also to be like a second phone if I decided not to carry around my Sony Xperia U.It's a great phone, and I love Palm OS and the Homebrew apps. It's just that whenever I hooked the phone up to my computer and started transferring music, an error message would appear as if I had disconnected the phone. I could never transfer more than maybe 20mb at a time, and it was frustrating because I find it more convenient to do overnight transfers or start it and leave it for long periods of time. I couldn't leave the computer doing transfers with this Palm Pre Plus.I did a little bit of research, and I'm sure whatever the problem was is an easy fix, but I decided I'd just wait around and get a bona fide mp3 player and return the phone. No need for multiple phones anyway.", "Date": "February 6, 2013"}, {"Title": "Great but..!!!", "Author": "Enrique Llaurado \"E LLaurado\"", "ReviewID": "R22HL7B89MQ831", "Overall": "1.0", "Content": "This is a great phone, everything you want in a phone is on it, faster, light, nice....BUT, you can't run any app that are now moving the market on webOS...so, it is like having an old simple chip phone.... shame  isn't it?", "Date": "December 20, 2012"}, {"Title": "Not HP!", "Author": "Mariflor Cruz", "ReviewID": "RXFOET9M5NW1U", "Overall": "1.0", "Content": "We are an HP Product Brand Loyalist and was excited to receive this HP Palm Pre plus as branded and described here at amazon.com and even paid extra for it to be delivered right away (one-day delivery). When I opened the box and inspected it...it was not in anyway an authentic HP!  We were really disappointed!", "Date": "March 14, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "Processor: 600 MHz Cortex-A8, Operating System: HP webOS\nMemory: 16 GB storage, 512 MB RAM\nDisplay: 320 x 480 pixels, 3.1 inches\nConnectivity: G3 HSDPA 2100, G2 GSM 850 / 900 / 1800 / 1900 Wi-Fi 802.11 b/g, Bluetooth 2.1, microUSB; Battery: 1150 mAh\nKeyboard: slide-out backlit QWERTY", "Name": "HP Palm Pre Plus 16GB GSM Smartphone - Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/41dMm6CJcuL.jpg", "ProductID": "B002SPJSLM"}}