{"Reviews": [{"Title": "It doesnt work any more", "Author": "mariajoselucena", "ReviewID": "R3FERIHA8W7RCI", "Overall": "1.0", "Content": "This phone was amazing, really good apps and functions. I was truely excited with this. But seven months later doesnt recognize the chip, and stop to work like a phone, now I have a expensive and low quality portatil game consol, with camera and wifi.I expect more for a Nokia product, i am buying samsung, nokia is dead to me", "Date": "November 23, 2012"}, {"Title": "exceptional", "Author": "francis", "ReviewID": "R1DYG9Q9T4SBKR", "Overall": "5.0", "Content": "Nokia n900 is the one of the best internet tablet/phone ever created.I discovered that with this phone the sky is the limit,you can install android gingerbread,ubuntu,meego and thousands of other applications for free.I would rather have this phone than apple phone.The sky is really the limit with this phone!!!!!!!!!!!!!!!!", "Date": "December 7, 2011"}, {"Title": "excellent", "Author": "Alvira Gooden", "ReviewID": "R4R6668MZ2BTV", "Overall": "5.0", "Content": "the phone is very special to me this is the first one of this kind that i owned the first nokia and tell you what i have no regrets thank you.", "Date": "September 18, 2011"}, {"Title": "good phone", "Author": "helloworld!", "ReviewID": "RPMZ3SS9IFT5C", "Overall": "4.0", "Content": "The phone is great appreciate perfect. The operating system has some obvious flaws and the n900 is in need of some polishing. for example there is no built in a develop he front facing camera and the OS is jerky. Hardware on the phone is great, bette develop ost. I especially apreciate the fm chip and the high resolution screen. When buying this phone keep in mind that it is not for tech beginners. This is not a gaming phone, this is not a phone phone, this is not even as some claim an internet tablet. This phone really is for people looking to develope their own apps and use advanced pc like features. Make sure you know what you are getting before buying this phone.", "Date": "August 14, 2012"}, {"Title": "No to Nokia N900", "Author": "Po", "ReviewID": "R15FLW1E5JW9LV", "Overall": "1.0", "Content": "I had the Nokia 6030 for approximately 6 years and it was a good phone.  I used it primarily for making calls.  I wanted to upgrade due to the texting, picture, and MMS craze.  I purchased the Nokia N900 through Amazon and it was a problem from the first day.  Once I received it I noticed it did not have picture sending (MMS) capability.  When I called Nokia to enquire, they told me that it doesn't have that feature.  I had very bad battery life and the phone was replaced by Amazon within the first 30 days, with the same result.  I decided to keep it and live with the poor battery life.  Then the phone started doing things like the calendar would not remind me if I set it for multiple day reminders.  It started turning itself off and turning back on again and the turning control wouldn't work.  I had to scroll through all my contacts to make a call.  I contacted Nokia to get the phone repaired to no avail.  I sent this phone in four times and they sent a replacement twice with the same results.  I would not recommend this phone to anyone.  I will not buy another Nokia product EVER; this is based on the POOR customer service I received from them. Just my two cent.", "Date": "February 4, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Amazing total entertainment experience\nCompletely capable quad-band mobile communicator\nThe 3.5-inch LCD screen brings photos, video and web content to your eyes\n5MP auto-focus, auto-exposure camera\nCaptures high-quality images and videos", "Name": "Nokia N900 Unlocked GSM Cell Phone Mobile Smartphone Multimedia Quadband 3G, 5 Megapixel Camera, 32GB Internal Storage, QWERTY Keyboard", "ImgURL": "http://ecx.images-amazon.com/images/I/41xko%2BCTxDL._SY300_.jpg", "ProductID": "B002N2Z0MQ"}}