{"Reviews": [{"Title": "Nokia N97 mini - Be prepared!", "Author": "Sydney", "ReviewID": "R19SHBPHZMQCU6", "Overall": "1.0", "Content": "Bought this phone recently, and found it to be overpriced and tacky. The touch screen is unpredictable, and you'll find yourself preferring the qwerty keyboard. This can be a bit awkward because it is not quick access.The applications are best installed on the E:\\ drive or other external memory, because the phone's internal memory (C:\\) is extremely limited. The phone hangs often if you so much as install one extra application onto C:\\  The GPS works quite nicely even though it is slow.  Music doesn't sound great on the inbuilt speakers, and there are not many equalizer options.  Video tends to freeze and the free movies on this phone have license issues and you'll not be able to use them after 2 months.  Managing contacts is a bit difficult and you'll find yourself struggling to synchronize across applications. The ovi suite doesn't help in a big way.  The camera pictures are grainy. The flash works quite nicely.  The internet browsing is difficult on this phone, and jumping to hyperlinks on a particular page is like playing a video game.  The help file is written for Nokia N97 and most of the help topics are not applicable to the mini. Ex: Music transmitter via FM.Support: Please think carefully before buying a Nokia product. There is NO SUPPORT. It is Nokia's way or the highway. This is what I meant by saying be prepared. Buy the phone knowing that Nokia will not support in any way. They'll tell you what's under warranty/what's", "Date": "June 21, 2010"}, {"Title": "from Italy", "Author": "oceanicthai", "ReviewID": "R1YJ9MB15TA3X8", "Overall": "3.0", "Content": "The model we got was from Italy, with Italian lettering and Italian default instructions.  Other than that it has been a good phone except that the battery likes to die a lot.", "Date": "December 29, 2013"}, {"Title": "Excellent", "Author": "jose", "ReviewID": "R413F2UMQIUDM", "Overall": "5.0", "Content": "Excellent Product, just whatt I expected, funcional, very nice and practical. Recomended 100 % for everybody. Quality and economy together.", "Date": "March 16, 2013"}, {"Title": "Amazing phone, couldnt ask for anything better", "Author": "Agent", "ReviewID": "R2PYP5EJKSKOWD", "Overall": "5.0", "Content": "This is really good especially when it comes to the internet and gaming and music. its light and easy to handle and has a very modern look to it", "Date": "July 21, 2012"}, {"Title": "the head phone is bad.", "Author": "sanyang", "ReviewID": "R3RM1EUU52SF0M", "Overall": "3.0", "Content": "The headset of my nokia n97mini is disapointing its been two weeks now since i have started using the phone butthe output quality is very very poor..and I dont know why so please ladies and genttlemen if anyone knows a solutionto my problem please help me out bcos am worried about it..however,my second problem is the wireless conections is wifi is hard to conect!", "Date": "June 3, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002XOP0ZQ"}}