{"Reviews": [{"Title": "Samsung i8910 Omnia HD 8GB review", "Author": "jeremy sheppard", "ReviewID": "R1LI1D2GOV04DE", "Overall": "3.0", "Content": "I bought this phone a couple of months ago to replace my N95 1st Gen as it seemed like a nice upgrade. It uses the same Nokia software but has 8MP cam and HD video with a huge screen 3.7\". So I was excited after doing all the research and reading about the many features of the phone. So on recieving the phone the first thing I noticed was the big beautiful screen and nice looking cam on the back with a shiny piano black finish. The only thing about the appearence is maybe the silver trim around the screen it seems to kinda cheapin the phone a little but I can live with that. Testing the cam and the videos on such a bright big display is really the best I have seen on many phones, quite impressive I must say (viewing was indoors). The sound quality however is something to be desired, not impressive in the least and definetly expected alot better after paying so much for this phone. After a short time after the excitement wore off I started to notice the size of this brick I was carrying on me and it is also quite a heavy phone not something you can get used. I guess that is the price of having such a nice big screen and great 8MP cam with HD video. Another downside is outside it seems also is really difficult to see the screen even on the brightest setting, so many times I have had to look for a shady place just to be able to dial a number. The next thing is the phone does seem sluggish when trying to open up video and pics for viewing not sure if a new firmware or something may help to improve this but it is a little irritating to have to wait so long for a pic to open when your trying to show someone. All in all it is not a bad phone with good features but definetly room for improvement and over priced, I wouldn't recommend paying more than about $450 max. And now that I personally have tested it I would probably have prefered to buy something else, of course this is down to personal taste.", "Date": "May 19, 2010"}, {"Title": "i8910 8GB review", "Author": "Mike", "ReviewID": "R3A99U06T2I6PA", "Overall": "5.0", "Content": "This is a review for the i8910 8GB that also compares the stock phone and ROM compared to once i hacked it and flashed n203 to itStock ROM -Pros:Video Quality -(720p)Camera - options up the ying yang. and takes great outdoor picturesSymbian OS - because I use symtorrent and Joikuspot alot and I had an N95 before this so it is familiar.Screen - watching videos is awesome and the widescreen effect is great on 3.7 inches of oled.Great loud speakersexcellent capacitive sensitivityLove the browser, form factor, and look.8GB onboard memory.Battery life is pretty good considering how much internet i use.Cons:Video Quantity - low frame rate makes the video look choppy,Pictures aren't as sharp and clear indoors as i thought they would be.not much free RAM with stock ROM.Setting up email is a pain and not true PUSH.media photo viewer loads the pics bit slowNot much in terms of 3D gamesHacked i8910 running n203, symtorrent, joikuspot, quickoffice premier, ovi store, ectPros:Video Quality -(720p) and at a stable 24 fps.Camera - options up the ying yang. and takes great outdoor pictures. Indoor pictures are better than on stock rom.Symbian OS - because I use symtorrent and Joikuspot alot and I had an N95 before this so it is familiar.Screen - watching videos is awesome and the widescreen effect is great on 3.7 inches of oled.Great loud speakersexcellent capacitive sensitivityLove the browser, form factor, and look.8GB onboard memory.Battery life is pretty good considering how much internet i use.Double the amount of Free RAMTrue push email that was easy to set up with nokia messagingoverall speed of phone and loading time are greatly improved.CONS:Not much in terms of 3D gamesOverall: I friggin love this phone, with the Custom rom i have a faster phone with double the available stock RAM. It runs nokia messaging now so i get true push email for all my email accounts. The symbian web browser is great for me because it has flash, I can use my phone as a mobile hot spot. I have an awesome screen with great colors. The video camera is now also awesome with a stable 24 fps. The picture quality has improved a little as well. I also can view or create word, excel, and PP which is also awesome.Hacking this phone and flashing the ROM make a huge improvement upon the phones capabilities and performance. It is great for my business needs now and the video recorder and camera with TV-out and DLNA and an awesome screen make this phone great for pleasure. The speakers also work very well in my opinion.I also recommend getting google maps because i haven't figured out how to get free voice nav with ovi maps yet.", "Date": "June 5, 2010"}, {"Title": "not too bad", "Author": "macks", "ReviewID": "R292H66OGBNF15", "Overall": "3.0", "Content": "I bought this Samsung i8910 Omnia HD and so far I like it but no too much because it has some few issue to deal with and I guess its because it was not made to work with the USA network", "Date": "June 2, 2013"}, {"Title": "Lousy Battery Life", "Author": "Eric", "ReviewID": "R3S4DW3YFQW0NB", "Overall": "1.0", "Content": "Cannot use the phone, because battery life is lousy. After 4 hours of standby time and maybe three calls talk time 20 minutes battery status is almost gone. I do not recommend this phone.", "Date": "May 19, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002IC16MO"}}