{"Reviews": [{"Title": "Excellent phone, but a bit dated now", "Author": "R. Larson", "ReviewID": "R235OOIR961BXH", "Overall": "5.0", "Content": "I bought this phone about 6 months after in first came out, and I've loved it ever since.  Two years later, it's starting to show its age, especially when compared with some of the newer Android phones, but it's by no means obsolete; it still does everything I need it to do (e-mail, web, video, navigation/maps, texting, and phone calls).  I use the facebook and Twitter apps, which both run great, although some of the newest, most resource-heavy apps are a bit slower.If you're looking for a lightning-fast smartphone to serve as your mobile computer, go ahead and spend $500 for something like the Galaxy S; if you're budget conscious, and just want a smartphone to check your e-mail, occasionally surf the web, get directions and navigation, and use as a phone, rather than a Gameboy, this phone is a great choice.", "Date": "March 14, 2011"}, {"Title": "G1 good but old", "Author": "Pauley V", "ReviewID": "R2AO9PPMI0W1I2", "Overall": "4.0", "Content": "The T-Mobile G1 isn't a bad smart phone.  The thing to remember though is it was the first android phone in the world and is about 2 to 2 and a half years old.  People who complain about battery life need to understand that android phones in general use a TON of battery life but there are apps to help just like on windows.  I recommend downloading Advanced Task Killer from the android market.  These phones run like computers.  Any open apps continue to run in the background so they consume memory and battery.  The G1 is still a great phone but it just can't keep up with any of the new androids.  It was top of the line when it launched but once again that was over two years ago so people looking for speed will want to stay away from it.", "Date": "February 7, 2011"}, {"Title": "Got mobile in excellent condition", "Author": "Amit Gupta", "ReviewID": "R29QUXYVD3CPZD", "Overall": "4.0", "Content": "This is first time I ordered a mobile from Amazon. This was a risk for me but when I opened the packed I was relieved. The mobile is in good condition and working fine. I liked this HTC due to Google applications but the mobile seems to be slower than I can use. I am using it in India and have GPRS (internet) in mobile. But my mobile works very slow while connected to internet.", "Date": "July 21, 2011"}, {"Title": "Pure excellent!!!!!", "Author": "Derk", "ReviewID": "R28YD9GMQVYALV", "Overall": "5.0", "Content": "First off this phone is awesome! Great design! love the features! Nice keyboard for large hands. Touch screen gets a A+. Track ball in very nice as well. And the Android operating system is outstanding. It mite not be as fast as some of the new phones or android OS's but its still pretty quick considering your connection speed. Easy to set up and use. WiFi works great. No problem with hooking up to AT&T;, even connected and registered to the data network by its self. Witch isn't common with unlocked phones. This is a steal for the price. One of the best built and design cell phones i have ever used.", "Date": "June 30, 2011"}, {"Title": "I really like it!!", "Author": "Ricardo Coalla", "ReviewID": "R210I8WUFVOK4Q", "Overall": "4.0", "Content": "Easy to use, cheap, lots of features. I'm pleased with the purchase. GPS works great and I was able to download a lot of apps. No problems so far.", "Date": "May 18, 2012"}, {"Title": "works alright", "Author": "Laciejay", "ReviewID": "R2T7IR8HMS1L2E", "Overall": "4.0", "Content": "I like the keyboard which is why I bought it. I don't like that it came with android 1.0 instead of 1.5 like the description stated. It likes to randomly reboot itself, and because of how old the android system is you can't download apps. The spacebar button is touchy and about 35% of the time it doesn't leave a space while texting and you have to put another one in. Mobile works great on wifi, not so great with data.  I'd give it a 6 out of 10. It functions, but it is old and thats what you get. I wouldn't really classify this as a smartphone since there aren't apps available for it. The manual that I got with the phone was not the right one so I had to look up how to do the battery cover and find the sd slot. Pretty easy to do after you look it up. If you want a bare bones smartphone which does nothing special it's a good choice.", "Date": "March 7, 2013"}, {"Title": "Hard to kill and there's a million replacements out there...", "Author": "Alennx", "ReviewID": "R3RLT4WKHZL4HD", "Overall": "5.0", "Content": "This is the last good txting phone before the advent of touch-screen fascism in the smart-phone league. I've fixed a thousand of these, buy my teens a new one every six months after various traumas and I just love the capability vs price.Downside would be 3G, upside would be massive batteries will let you run for days without a charge.Final Analysis: If you need a smart-phone that will take some serious wear and tear, maybe give up it's life at a reasonable price, look no farther.- PC Guru -computacles@gmail.com", "Date": "February 19, 2013"}, {"Title": "Better than a flip-phone", "Author": "JHawkins", "ReviewID": "RA4W2LU9PL30", "Overall": "4.0", "Content": "I purchased this phone because I needed a replacement and didn't want to spend a lot of money. It works perfect on the Walmart Family Plan. Its important to realize when your buying this that it's not a newly released Android or Iphone. If you have used an Iphone or newer model smartphone you may be disappointed. It does have some positive attributes for someone wanting to save some money when buying a cell phone. It has solid construction. I was worried about it holding-up because of the slide-out keyboard. I've used it for a month now and its fine. I also like the keyboard. It has a touch screen but its not as responsive as I'd like it to be. I found that the keyboard after getting used to it makes texting fairly easy. Sending emails is fine but getting too deep in web-browsing causes the phone to slow in performance. The battery does OK for most days. I found that when traveling to areas where the signal was weak it was better to just put it on airplane mode.  In all it works fine as a basic phone with voice and text.", "Date": "July 2, 2013"}, {"Title": "Good Deal.", "Author": "Linda A. Dixon \"LINDA A DIXON\"", "ReviewID": "R1HVS5Z295S2ZA", "Overall": "4.0", "Content": "The telephone was purchased for my grandson.  The only complaint I have heard thus far was the charger did not work.  That was the least of my concerns.  The phone was just as the Seller described.", "Date": "April 7, 2013"}, {"Title": "it was a POS", "Author": "michelle", "ReviewID": "R19YX1JFGBII8F", "Overall": "1.0", "Content": "my phone wouldnt take picture or video, nor could i speak normally on the phone I had to have it on speaker or there was no sound, couldnt even download apps either. never buying another phone online again", "Date": "February 22, 2013"}, {"Title": "Good phone.", "Author": "Benro Ogunyipe", "ReviewID": "R32H6YYKJD2WDL", "Overall": "4.0", "Content": "Really nice and simple phone. Convenient and easy to use a Tmobile G1 phone as compared to today's advanced phones.", "Date": "January 20, 2013"}, {"Title": "HTC Google", "Author": "ROBIN MCCLUNEY", "ReviewID": "RB8P4YZ4JIJA7", "Overall": "2.0", "Content": "The phone was not packaged in a decent manner. The battery was not in its package and everything looks as it was thrown in the box. I tried to contact company to ensure I had all parts; however, no one answered my calls or replied to my voicemail. The phone will freeze periodically and even power itself off when battery is fully charged!  I can't use my keyboard to type a message because it will go to the applications that use letters for shortcuts although I have turned off shortcuts. I am very unhappy with this product.", "Date": "January 14, 2013"}, {"Title": "Fair", "Author": "iris77", "ReviewID": "R1PAWKRXD9ESLP", "Overall": "3.0", "Content": "Came in time for Xmas gift. Received before date that was said. Kinds beat up. Sd card cover missing. Came with wrong charger. Good thing order another one from another place. Will probably replace in a few weeks. Not as happy as I was with my other one I order from other place.", "Date": "December 25, 2012"}, {"Title": "New!!?", "Author": "DarkForte", "ReviewID": "R18QM2C8F97SFK", "Overall": "2.0", "Content": "Condition : New1. IMEI don't match on box2. Item in box miss (Case)3. Many have furrow on camera lens and in secret place4. Keyboard work not well (Must press strong sometime)5. Phone has rooted and install custom rom (like rom from Chinese)", "Date": "December 21, 2012"}, {"Title": "Did not meet expectations..", "Author": "GEORGE", "ReviewID": "RDFKCO80J9VBO", "Overall": "2.0", "Content": "I bought this phone recently. Battery charges very slow after it is about 74% charged. Also it looses power very soon after the charge is come down to 20%.", "Date": "December 4, 2012"}, {"Title": "Sucks", "Author": "Neshaa", "ReviewID": "R3N220Y51LGDNF", "Overall": "1.0", "Content": "I got this phone because my mother wanted a simple tmobile phone. First it takes long to charge and the battery dies fast -_-", "Date": "November 1, 2012"}, {"Title": "charger problem", "Author": "Andrea", "ReviewID": "R1FR5MFLPIIEUH", "Overall": "4.0", "Content": "Hi the problem I am have is the charger thats was send with the phone is not charging the phone", "Date": "October 22, 2012"}, {"Title": "fast service", "Author": "Storm89", "ReviewID": "R2L7DTTOOMFIRU", "Overall": "5.0", "Content": "Though I had tech problems with the first device I was sent a new and working device that I am now in love with. I cannot put the phone down. I was not aware that Google no longer supported updates to the G1 but even with that issue I am loving the phone because I don't need all of those applications slowing down my phone. Great phone for someone who wants to get work done with simple incoming and outgoing phone calls.", "Date": "March 21, 2012"}, {"Title": "g1 un smarthphone excelente a bajo costo", "Author": "fuzzynoise", "ReviewID": "RRMAMWF6DYSAU", "Overall": "4.0", "Content": "Uno de los primeros moviles con android pero todavia sigue dando batalla, funciona de manera impecable. Lo unico que puedo decir en contra es que es un poco lento en la interfaz no como los actuales moviles con android, pero la wifi, bluetooth, gps, gprs y edge funcionan a las 1000 maravillas. Eso si ten en cuenta que para tener 3g debe funcionar en un cierto rango de frecuencia que algunas empresas de telefonia no manejan.", "Date": "July 2, 2011"}, {"Title": "phone", "Author": "leffewt", "ReviewID": "R2ZEOR4E285UJZ", "Overall": "1.0", "Content": "I was unable to use the phone ... was not compatible with my Family Mobile/ T mobile  plan... Wish we had known more about this before we bought it.", "Date": "October 4, 2012"}, {"Title": "It's ok but there's one problem", "Author": "Taheem Warren", "ReviewID": "R33HXXZBY0B66G", "Overall": "3.0", "Content": "The phone is okay, it got here kinda fast, and its works like a charm but there is only one problem. The problem with the phone is the battery, it dies too quickly. And also the charger that came with my order didn't charge the phone, other than that the phone is fine.", "Date": "October 2, 2012"}, {"Title": "okay phone", "Author": "penny", "ReviewID": "RFTEB8CZJYMRX", "Overall": "2.0", "Content": "the phone came on time and it works okay. it is a little thick  and it was used which was stated the seller didn't bother to to erase the previous owners contacts. it was little hard trying to navigate some of the apps. this phone didn't come with a manual of user guide had to figure out how to use some of the apps. i'm no dummy have many cell phones but this one being with android apps took a  little getting used to. this phone didn't work with my att sim card had to buy a t-mobile sim card and work just fine. the call quality okay haven't received any calls on this phone yet this phone being my spare and also another number. cannot use the camera it keep asking for sd memory card just to take pictures a major disappointment. also no headphones jack on it all. this is okay phone but i would prefer something better for my money. i have order one of there htc phones maybe it will have better features than this phone.", "Date": "April 13, 2011"}, {"Title": "Don't order through her:", "Author": "Erin \"Erin\"", "ReviewID": "R1QJ5XSDG2CTWS", "Overall": "1.0", "Content": "The product was missing parts (i.e. wall charger that comes with the phone stock).  It was also damaged (i.e. USB charging cord was broken & frayed, almost unusable) and she would not return it.  Finally I was told that she would only give me a 50% back on the item.  Don't order through this person she is dishonest.As for the product itself it is extremely slow, but if it is rooted it is much more manageable.", "Date": "June 8, 2011"}, {"Title": "Bad Phone", "Author": "joooan", "ReviewID": "R2RVH8S8JHLPME", "Overall": "2.0", "Content": "I broke my old phone and had decided to buy the G1 as a replacement, I was warned by a friend not to get it but I got it anyways. Now i regret that decision. This phone is huge, its like carrying a brick. The battery life is ridiculous, I try not use it as much as possible during the day because usually when noon comes my battery is about 50%. Forget about even going on the internet on this phone unless you want to risk having your phone die faster during the day. Not to mention any apps you download are also huge battery killers. I would highly recommend not to get this phone.", "Date": "January 24, 2011"}, {"Title": "Don't Buy This Phone.", "Author": "L2233", "ReviewID": "RGZCCO35WQSY", "Overall": "2.0", "Content": "Before Buying This Phone, I Read The Reviews, The Bad Reviews And Thought That Maybe They're The OnesWho Were Just Unfortunate. No. This Phone Sucks, Bad! It Turns Off By Itself, Does Not Turn Back On.Not Even After Rebooting It. Turning It Off And On, Doesnt Work. I've Tried Every Little Thing To MakeIt Work. Don't Waste Time Or Money. Reason I Gave It An Extra Star Was Because Amazon Is Good At MakingReturns And Refunds Easier Than I Thought.", "Date": "September 12, 2012"}, {"Title": "Why sand me different color i order.", "Author": "Adjeka", "ReviewID": "R18GKLIP8HNP40", "Overall": "1.0", "Content": "unhappy to receive white phone, saler sand me different color. My order was black .I will like to return this phone.Thanks", "Date": "January 26, 2013"}, {"Title": "Works, but the coating isnt that strong.", "Author": "Zach", "ReviewID": "R9VA7WDJ6PPJS", "Overall": "4.0", "Content": "It's a hardshell phone case thats touch and covers everything but the screen and camera. Only issue is that it's coating really doesnt last long. It starts out as a nice rubber like texture, then it rubs off to a white plastic shell, which doesnt really matter cause youre just trying to protect the phone.", "Date": "May 6, 2011"}, {"Title": ". very disapointed", "Author": "SUSAN", "ReviewID": "R1M3NWN6RS2AN4", "Overall": "2.0", "Content": "The HTC TMobile G1 phone is very very slow, the battery life is like 1hour and the keys are very hard.... first time I bought a second hand cell phone and I am very very disapointed....", "Date": "January 29, 2011"}], "ProductInfo": {"Price": "$169.99", "Features": "Google Android OS-powered smartphone in black with slide-out keyboard-compatible with T-Mobile's 3G network\nWi-Fi networking; Bluetooth for hands-free calls and stereo music; 3-megapixel camera/camcorder; microSD expansion\nAccess to Android Market for downloading applications; Android 1.5 Cupcake OS\nUp to 5 hours of talk time, up to 130 hours (5.4 days) of standby time\nIncludes: handset, battery, charger, USB cable, wired stereo hands-free headset, user manual", "Name": "HTC G1 Google Android Unlocked Phone with Android OS, Wi-Fi, Bluetooth, 3MP Camera, MicroSD Expansion - Unlocked Phone - US Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41-fMpLpZOL._SY300_.jpg", "ProductID": "B002TUC6I8"}}