{"Reviews": [{"Title": "Sexy Satio stuns Society", "Author": "Adrian", "ReviewID": "RB3V4JF0Y849O", "Overall": "4.0", "Content": "I had to get a new phone because my Samsung Innov8 was giving up the ghost- could barely hear the other person when I got calls. I'm pretty sure one friend no longer talks to me because he thinks I'm giving him the cold shoulder, when in fact I simply cant hear him and have to hang up!Now this Satio is a real humdinger. I got the red one, or \"bordeaux\", as they say in SE circles. It's damn sexy, stylish, and says quality. The sliding camera lens cover/switch is smooth, and reveals the lens with neighbouring flash, lights and range and focus sensors, making this mobile phone look more like a camera which happens to have excellent phone, sms and music player capabilities all wrapped in one. The fact that it is a 12.1 megapixel camera doesnt hurt either.The touchscreen useability is not bad. Some parts are a little confusing and I dont know why there sometimes seems to be doubling up on the number of steps required, such as smsing. Nevertheless, it's a great sexy phone slash camera and I have no regrets buying it. I've had it for 2 days and already taken 50 photos and 4 short vids- great quality stuff, especially considering they were all taken at night.I've especially fallen in love with the touch focus method of taking photos. You dont have to press the shutter button. Once you set it up on the \"focus\" option, all you do is touch the LCD screen and the camera will focus on that part of the photo. So you can touch the far upper right corner of the screen, for example, and it will focus there and take the pic immediately after. Amazing technology.Surprisingly for Sony Ericsson, it comes with a 8gb micro SD card, which is unexpected because SE generally doesnt like to give out things like memory cards for \"free\", and also because they're usually a stickler for their own Sony memory stick series of memory cards. Personally I'm glad, since it meant I could simply transfer my micro SD card from my Samsung to the Satio.Also surprisingly, it did not come with those earphones which have the soft rubber earplugs which block out noise around you, giving a clearer playback from the music player, which is, of course, good, being Sony. The earpiece has a colour coordiinated listen/disconnect button where the left and right wires meet, which is attractive, but doesnt make up for the cheaper earpieces. Since it doesnt come with a 3.5mm jack, you cant use your favourite headphones without buying an adaptor.Would I recommend this phone? Yes- at least try it out. I'm pretty sure you'll like it :)March 24th 2010.I'm updating to let readers know the Satio has software glitches. The ones I saw when I first got the Satio were, I believed, simply poor user friendliness design, such as getting to the screen to type a sms. It needs two presses too many to type and send.However, there is now a very serious problem with my Satio. The t9 function is almost non functional.For example, if I press the buttons to type \"Hi how are you?\", I get \"gh how ard zou?\"or if I try to type \"I'll be around\", I get \"I.kl af armvo?\"It's as if half the dictionary has disappeared.I has done updates of the software and it has made no difference.The only reason that could possibly account for it is the removal of the micro SD card without going through the menus to click...whatever you have to click. I only saw the message after I took out the card.I'll be taking it to the service centre when time permits and hopefully get it sorted out.", "Date": "November 20, 2009"}, {"Title": "awesome", "Author": "J. Higgins \"Cohen\"", "ReviewID": "R1D6X8B3CE59Y1", "Overall": "5.0", "Content": "This is the best cellphone ever, The interface and the built is superb! I will not trade this for any other phone in this world. I recently got the samsung highlight and it is nothing compared to this monster. Back then Noka N95 was the macdaddy of all devices now the Satio is THE macdaddy of all. I'm always gonna stick with Nokia and Sony phones. Samsung is there but not all that in my perspective. If you want attractive well rounded cellphones check out Nokia and Sony! No regrets!", "Date": "November 21, 2009"}, {"Title": "The Future", "Author": "B. K. Laurent", "ReviewID": "R2HTG9TI25SJX6", "Overall": "5.0", "Content": "I know what you're thinking... \"that is A LOT of money\". This is true. But if you want a REAL digital camera, phone, organizer, and music player all in one, this phone is IT. I don't want to go into all the features because some are listed above, and all are listed on the official Sony Ericcson website. But as the first person on Amazon to give this phone a review, I have to honestly say this is the best phone in the world right now... PERIOD. Not only will you be the envy of your peers & friends, but this phone is actually fun in all aspects. (One suggestion: purchase a car charger... especially if you keep Bluetooth on all the time.)", "Date": "November 16, 2009"}, {"Title": "Good for good nerves!", "Author": "Saeid Kheirandish", "ReviewID": "R1E51Z1S5KMM9U", "Overall": "1.0", "Content": "I bought this phone after two relatively satisfactory experiences with previous SE models. The main problem I had with the previous models (the more recent one being a W880i with a brilliantly slick design) was that after about two years the point where the charging cable gets jacked got ruined and made it impossible to charge the phone. Now, regardless of this apparently typical problem with SE phones I went ahead and bought the new Satio because of the flexibility it offered in terms of transferring Outlook Calendar data into its built-in calendar.Which proved to be about the only feature it offered!And even this only half-way positive feature gives me a hard time when I want to use it. I am so disappointed that I am now sure that my next smart phone will definitely not be a Sony Ericsson. Here are just some of the reasons:1. The first problem which might not seem like a problem in the beginning is the appearance. The front view is OK. SE used to produce these nice and very serious-looking, rectangle-shaped phones that were really thin. One major reason I loved my previous W880i was exactly its thin, neat shape. Look at the Satio from the side and you won't help but notice this weird hump that is supposed to be the camera cover. What happens is that when you drop the Satio in your pocket (or sometimes into your bag) headfirst it is very likely that the cover will open. This will turn on the camera automatically and will use up all the battery power before you even know.2. The touch screen always functions with a 1-to-2 second delay, if not longer. Sometimes you try dragging your finger on it in order to \"scroll\" and what you get is a fuzzy screen or a nasty hang. By which I mean that you cannot even turn off the phone by pressing a button. When a Satio hangs you usually need to take the battery out, wait for a few seconds and put it back in again.3. The motion sensor which is supposed to turn the screen by 90° when you hold the phone horizontally mostly does it with a long delay. Or it does so when you hold the phone horizontally, notice that nothing happens, then try to return it to the vertical position, and whoops, there it is: horizontal screen after you have given up!4. The battery becomes empty almost regardless of how much you use the phone. Sometimes I don't use the phone even for a single minute in two days and I wake up on the third day finding that my Satio has already shut itself down due to an empty battery.5. The fancy 12 megapixel camera which is advertised as a unique feature is by no means up to what it pretends to be. The picture quality is far worse than those of even lower end digital cameras with lower resolution and the video quality is only slightly better than those of the ordinary phone cameras. In addition, the recorded sound in videos is sometimes so weak that it is inaudible when you watch it back on the phone. And when you think you want to shoot a video or a picture make sure you know 2-3 seconds in advance because that's about the minimum amount of time you need for the picture to be taken (or the video to start recording!). This can be a serious source of frustration.6. The Walkman feature is something I gave up almost right after I bought the phone. The built-in player tends to automatically gather ALL the saved sound files anywhere in the memory in one single list that gets bigger and bigger. Creating a list out of this list becomes really cumbersome when you have more than a couple of hundred songs saved in the memory. In other words it does not nearly offer the ease at which you can organize and handle files in a typical mp3 player that costs 20 dollars nowadays. Now even if you get around that problem the phone will most likely hang anyway if you are listening to music and, say, also try to surf in the net. Forget about answering a phone call if you have already managed the first two tasks! In case of hanging see item 1 above!7. The phone offers a couple of options in terms of the main interface. In one of them you can have a number of more frequently-used applications (among the very limited number of applications that can be downloaded into Satio anyway) onto the main interface. Let's say you have four icons representing four often-used applications. Now every now and then the phone decides that I need six applications on the exact same spot, and it squeezes all the six into that spot. I will have to go through the same setup frequently to get the interface I wanted. However, we are all familiar with this issue through years of work with Microsoft products.", "Date": "August 18, 2011"}, {"Title": "awesome purchase.", "Author": "ARDEN BARNETT", "ReviewID": "R18SYVB7GW81ZL", "Overall": "5.0", "Content": "this phone is better than i imagined. it doesn't have the usual features of a sony ericsson but it is just as great. i love sony ericcson, and it was shipped in a speedy manner too.", "Date": "November 18, 2010"}, {"Title": "Money well spent", "Author": "J. Higgins \"Sony fan\"", "ReviewID": "RPOPOVPGD1J20", "Overall": "5.0", "Content": "I was a bit skeptical about this phone because of the price but in the end I didn't regret it one bit!!!! The phone is excellent and the performance, camera and overall interface is superb! I'm so happy I chose this over the pixon 12. I cannot think about something bad to say about it.", "Date": "November 24, 2009"}, {"Title": "Sony Satio is Great!", "Author": "Shihan Kamal \"sk\"", "ReviewID": "R1IAI6IYLPG0L2", "Overall": "5.0", "Content": "I have used Iphone, HTC HD2, Blackberry, Nokia n97 and others. I love this phone better than any one. Specially the quality, user friendliness, Operating systen, Quarty keyboard and other things. This phone has better perfomance than any one  I have used before. Also battery hold a good charge, internet is very fast, music player is great, bluetooth works great. Can hold upto 32gb memory card, 12 Mega pixel camera. What else do you need? I am very happy at last. Sony has done a great job.", "Date": "April 18, 2010"}, {"Title": "Satio Garbage", "Author": "coneck", "ReviewID": "R1F76BS5U6ODZ8", "Overall": "1.0", "Content": "I had high expectations for this phone Sony Ericsson Satio but the truth by using it I realized that if you ask me now if I want to change it if you would do as apezar you have a 12-megapixel camera here in Costa Rica, I has served for nothing I can not even access the 3G lines are supposed to bring. So if you decide to share this phone better Think about it there's nothing like Nokia or Iphone.", "Date": "February 2, 2012"}, {"Title": "SE Satio U1 is great for pictures & videos", "Author": "zeno21", "ReviewID": "R1DWQ0J6ESRJ42", "Overall": "4.0", "Content": "This camera phone is great for taking pictures and videos.  By far the best camera phone I've own.  I upgraded from K800i which I paid $600, 6 years ago.  I have this Satio U1 for 1 year now & loving it.  The panorama feature is awesome.  I paid $800 for this phone.  I am only using it for talk, text & lots of pictures taking.  The micro SD slot is a great idea.  I hope SE makes another version similar to this Satio U1, but with a better scratch resistant screen, faster response, charger system & higher headset / speaker volume controls.  If they do, then I will stick with SE, otherwise I will buy an iPhone as my next phone for work.", "Date": "November 24, 2011"}, {"Title": "All that glitter is not GOLD", "Author": "A. Punjwani \"AP\"", "ReviewID": "R7DEK0J01DBJ", "Overall": "1.0", "Content": "I have had this phone for about a year now and its a miserable failure on Sony's part to let it stay in the marketplace with all its bugs unfixed. Screen response is practically non-functional (its a touchscreen phone). This point alone leaves the phone unusable. Phone will have its buttons pressed randomly. Writing an sms consisting of less than 10 words will cost you two minutes from your life.If there is anything good about this phone, its the Camera. period.", "Date": "June 23, 2011"}, {"Title": "An amazing all around phone and camera you can't beat", "Author": "Sam Hartford \"Sam Hartford\"", "ReviewID": "R20MXQLFNPXD3U", "Overall": "5.0", "Content": "This phone is incredible, really. It's a smartphone but it does not use Android, so know that. There will be future limitations with this OS - but you may not feel a negative issue from this for at least 3-4 years and by that time you probably won't have this phone anyways. It is probably the best looking phone on the market, it is sleek and smooth.It records video, takes truly amazing pictures and has a superb lens on it, which is key. A lot of phones throw the megapixel count at you (and this one has a high count as well 12.1mp) but the key is in the lens. It has WIFI and does anything that you'd want a phone to do these days. Again the key with this phone is its video and camera qualities, which are second to none.This can be used on ANY network that takes SIM cards, if you get an unlocked version. This will not work on CDMA networks i.e. Sprint and MetroPCS.\"The focus of the phone is the high quality playback of music and video, as well as photography. The camera is located on the back of the phone, behind a slider and features a xenon flash. On the side of the phone, there is a shutter button, and a button which allows you to switch between still and video modes. Next to this is a rocker switch for zooming in and out. Also on this side is a button for playback of photos or video. The other side of the phone has a sliding lock button and a covered slot for a MicroSD card.The front of the phone is dominated by a 3.5-inch (89 mm), 16:9 ratio 360x640 TFT resistive touchscreen.[3] There is also a front-facing camera for video calling. At the bottom of the touchscreen are three small buttons: green (left), white (centre), and red (right).In terms of software, Satio uses the Symbian OS 9.4 operating system, which is created collaboratively under the stewardship of the Symbian Foundation.[4] It uses the PlayNow service, Sony Ericsson's mobile content platform, and is part of the company's new Entertainment Unlimited service.[5] In terms of connectivity, it is Wi-Fi-enabled and has a GPS chip for navigation and location-based services. It also supports full Flash for video playback.\"  That blurb is a quote and pretty much explains it perfectly.", "Date": "November 28, 2011"}, {"Title": "DO NOT BUY!!", "Author": "Liam H Dooley", "ReviewID": "R1FBC7ME3VJE25", "Overall": "1.0", "Content": "I purchased this phone with high hopes, despite endless criticism on the web. I had hoped that the new firmware update had solved all of the problems. I was WRONG.I was willing to forget all of the bad features of the phone for a good camera, but after taking five photos the entire phone froze up!!  I tried everything to fix the problem; restarting multiple times, reflashing the firmware, playing with the setup, and doing the online repair via the Sony Ericsson software. All failed. I returned the phone the next day, for my money back.Here are some additional details (all bad):- couldn't transfer all of my contacts from my older Sony Ericsson K800; had to do so one at a time via Blutooth.- terrible operating system; it is impossible to find any commands or functions.- total lack of a usable off-line store (like itunes). The Sony Ericsson program is web-based PlayNow; you cannot purchase a program or anything on it, download it, and copy it via USB; you have to send your phone a link and then download it via phone.- Terrible SE proprietary charger / headphone port. Come on... get a real micro-USB and headphone jack.- Cheap plastic surface; it got fingerprints easily, and seemed like it would scratch easily.Anything good to say? sort of; the touch keyboards were fine, and i have to say that the touch screen worked fine. There had been complaints about it not being sensitive enough, but I had no problems. Also, the file management system (via IE explorer / as an external hard drive when connected via USB) is good. And I liked the fact that you can set alarms and ring tones as any MP3 - which you can't do on the iphone of course.Perhaps SE will better invest and test their next camera phone. It's a shame; I've had two SEs that were quite good and lasted forever. My K800 is 3.5 years old, and still works and has a very good camera.  So many hopes, so much disappointment....", "Date": "January 1, 2010"}, {"Title": "Bad quality Product. Don'buy it !!", "Author": "Roberto Munzer Grunbaum", "ReviewID": "R3GIV4U8J8LJ2J", "Overall": "1.0", "Content": "I bought this product as a Christmas present for my 18 year old son. He used it for a litle bit more then one monthand now it wont turn on the screen ?How can this be possible ? Sony Ericcson realy has a very poor quality !! So bettter don't buy products of this brand.", "Date": "February 5, 2010"}, {"Title": "??", "Author": "Carlos Macias \"Carlos Moreno\"", "ReviewID": "R3ALPTYGXDSD03", "Overall": "2.0", "Content": "The item is good... but the Interface is not as friendly as in the iPhone.... I will sell this to buy an iPhone...It is true, have a great camera but the data transfer is easier and faster with the iPhone...Also to get it sync (specially with mac) it is quite a nightmare...I go back to my iPhone", "Date": "December 20, 2009"}], "ProductInfo": {"Price": "$199.59", "Features": "HSDPA / WCDMA / GSM 850/900/1800/1900 3.5G\n3.5-inch touchscreen handset\n12.1MP CMOS, aGPS,BluetoothTM technology,WiFiTM\nSymbian 9.2 OS / S60 V5 Touch UI\nXenon flash,Smile detection,Red-eye reduction", "Name": "- \t Sony Ericsson Satio (Black) Unlocked, International verison with no warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/41ia-1C7AAL._SY300_.jpg", "ProductID": "B002U0DUXM"}}