{"Reviews": [{"Title": "Still the best smartphone for serious users", "Author": "Kong", "ReviewID": "R1T2CV7SBXP8KG", "Overall": "5.0", "Content": "Particularly with Windows Mobile 6.5 (if you don't already have 6.5, HTC offers a free ROM update at [...], this is still the phone to have if you:  - deal with a lot of e-mail from Exchange and personal accounts  - use Outlook's calendar and contacts  - need to view, edit, and originate Microsoft Word, Excel, and PowerPoint files on the phone  - need a genuinely well-working speakerphoneMuch better keyboard (key spacing and feel) than typical Blackberries.Tilting screen permits using the phone like a mini-laptop, so you can look straight into the screen while typing; also permits media viewing without having to hold the phone (tip up the screen and set the phone on a table).Solid construction. GPS reception is good, works well with free Bing Maps app.OK touch-screen keyboards (portrait or lnadscape automatically selected) for quick or casual input, but they nicely go away when you slide out the real keyboard, giving you back the entire screen for content.Decent battery life (and battery is replaceable).Mini-USB connector is centered on bottom edge permitting use of a cradle (I've had good results with USB Sync & Charge Cradle (with AC Charger) (w/ 2nd battery support) w/ OrionGadgets NeckStrap for AT), which is a lot handier than fiddling with a cable every time you come to or leave your desk. True world phone; works with regular GSM and 3G pretty much everywhere. Adapter is available to use conventional 3.5 mm headphones.Still a good supply of apps available for serious and recreational purposes.You can use the supplied HTC Sense user interface, but the Windows Mobile UI is nicely lean and mean, settable to show your upcoming appointments and list your tasks and unread e-mails and messages all on one easily glanceable screen.Install free Opera Mini to get a top-class Web browser.", "Date": "June 13, 2011"}, {"Title": "Good phone", "Author": "Rex S. Von Nothdurft", "ReviewID": "R3VBSC0ZJG0IR2", "Overall": "4.0", "Content": "I upgraded from an 8125 smart phone. Had Windows mobile 5. This phone has 6.5. Found features removed from the OS, like alarm snooze and reminder snooze. There doesn't seem to be a way to control how long you want something to snooze. It's always 5 min. A few other minor features removed.For having a 500 MGH processor, it is unexpectedly slow. Not aggravating though.I don't talk on it much and I have to charge it about every 4 days. 5 to 6 days on the 8125.It doesn't take standard USB cable. Why did they change this? I guess so you have to buy their special cable. UNNECESSARY! Expect to pay for more hardware.I like the help feature. The manual is built in, and searchable.The voice recognition/command feature is AWESOME. No more recording voice dial. The phone can dial anyone in contacts by saying their name. Programs can be activated by voice. Just say \"Open Excel\". The phone retrieves all of my Excel files, so I can choose which one I want to open. Say \"When's my next apt.\" The phone speaks back to you when your next apt. is! NICE!Can connect to multiple blue tooth devices. Nice feature.WiFi burns a lot of battery power. WiFi internet is slow. Phone \"Microsoft IE\" is heavy on the OS, processor and memory. Poor performance. Web pages see the phone as if it's a regular computer.Love the quick access of programs. Program tab is VERY customizable.Touch keyboard is great. Accepts \"fat fingers\" well. I love how slim the phone is and has the slide out keyboard. Slide out is missing some important symbol keys.This is another pocket PC. A laptop in your pocket. SO FUNCTIONAL. Not a perfect phone, but overall I think it's great. Very comparable to the Iphone. You can replace the battery on this phone. When the battery dies on an Iphone, you have to throw away the phone.", "Date": "February 28, 2010"}, {"Title": "Major Dissapointment", "Author": "et2980", "ReviewID": "R2TOSU9SSEV1PR", "Overall": "1.0", "Content": "Perhaps an unlocked phone would be more useful but ATT sold me this problematic phone and didn't do anything to compensate for its problems. When texting this phone would often crash and to get it running again I had to REMOVE the battery. This would happen to me more than daily. I even brought it to the store, they replaced the device, still happened even when I removed the over priced unusable apps. The only benefits to windows is the ability to ready Office docs, but the android and iphones can do the same - ditch Windows mobie and don't look back!", "Date": "October 12, 2011"}, {"Title": "my views about the stuff I got", "Author": "more", "ReviewID": "R3GFNCM032Y7SA", "Overall": "2.0", "Content": "si m card didn't work, I got this hand set to use it overseas too bad Att sim card didn't work .", "Date": "January 16, 2013"}, {"Title": "Really nice", "Author": "jeff h", "ReviewID": "R77SUFANSWZJY", "Overall": "4.0", "Content": "Purchased this as a gift for my son when his was stolen. He loves it. It was everything the seller described. I was impressed that it was shipped the very same day. My son loves it.", "Date": "January 2, 2014"}, {"Title": "HTC Tilt 2", "Author": "Val", "ReviewID": "R1A1KNDM7PNUEL", "Overall": "5.0", "Content": "I love my htc tilt 2 phone. I had no problems accessing the windows 6.5 mobile device  on it. I enjoy that I can use this phone as modem to sync with my tablet. I would encourage anyone to try using a window mobile powered phone.", "Date": "November 15, 2013"}, {"Title": "Worst phone i have ever had", "Author": "Jeremy H", "ReviewID": "R1HUDMZEM3RKM1", "Overall": "1.0", "Content": "The phone in general runs VERY slow, it takes almost a minute at times just to load up messages. It crashes almost every other time I go into my messages. The screen commonly will not turn on when I push the button, in which case I will have to wait 5-10 minutes for it to work again(or just pull the battery). It takes a while to start up(about 5 minutes). At times when I get calls the phone will not answer when I push the button to answer. Last but not least the screen commonly messes up(its hard to describe what it does). The only good thing I can think about is that the battery life is fair(lasts 1-2 days) and the slide out keyboard that tilts. Im not sure if my phone is just messed up or if they are ALL messed up, either way I wouldn't advise anybody to take the chance.", "Date": "January 9, 2013"}, {"Title": "It Sucks", "Author": "Sunshine", "ReviewID": "RTO6GBGFXSG51", "Overall": "1.0", "Content": "The operating system sucks!!!! Not very user friendly..I was not pleased..and would have loved to get my money back !", "Date": "January 6, 2013"}, {"Title": "A disappointing cell phone, with overly-complicated settings, and in the end you can't change much of the phone's features", "Author": "Quiche \"Quiche\"", "ReviewID": "R3VBDZYY48O0GF", "Overall": "1.0", "Content": "I bought this phone used and only used it a couple of months.  One of the first things to know when considering buying this phone is that the battery needs to be recharged every day.  If you get the extended battery, then you can't use the cradle, and it doesn't last much longer than a day.  And I am talking about with the phone on standby, with hardly or no calls being made.There's lots of features.  However, for all of its features, the HTC Tilt 2 remains difficult to actually use.  You can't change the fonts very much, and therefore, it is hard to read what is on the screen.  It has wi-fi, but the wi-fi is very slow.  It has a weather program, but you have to be careful that it is not running on your data connection, because you end up with a large data usage bill because the weather is constantly updating.You need to get a case for the phone, because the screen is very sensitive.The QWERTY slide out board is about the only good feature that actually works on the phone.  But for the money, you are far better off going with a later HTC model.  I now have the HTC Ozone, and like it much better.", "Date": "September 10, 2012"}, {"Title": "Great Phone for Someone Transitioning into Touchscreens", "Author": "bookworm2277", "ReviewID": "RSUO892FL6CCD", "Overall": "4.0", "Content": "My dad wanted a new phone (he's had a razor for 8 years), and didn't want to spend on something too recent since he didn't know what features he'd want.  He loves that it is a windows phone (which is why I suggested it, since I too have an older windows phone I love).  The touch screen is pretty easy to learn on, even though he's still trying to get used to it.  He hasn't used the internet, but we've played some of the included games and get the weather on it, which is nice.  He has used the keyboard a little, but I'm sure will use it more when we have data for that phone.  I've used the keyboard myself and it is extremely easy to use, so no complaints so far.  The tilt feature is great when you do use the keyboard.  Last but not least, it is easy to hear people on the phone and the speaker phone works very well.  Overall, we think it's a great phone, but it's a little older, so I'm sure someone my age looking for an updated phone may not like it as much.  Great for someone trying touch screens and windows phones for the first time!", "Date": "February 7, 2012"}, {"Title": "Save Your Money and Buy a phone that works", "Author": "Y. O. Alleyne \"Book Worm\"", "ReviewID": "R1K3FNDNVJRVI2", "Overall": "2.0", "Content": "Physically this phone looks good but it has some flaws that will make a normal person freak and want to smash the phone to bits. First, it has the habit of going to the sleep mode i.e. the phone shuts down and you have to press the power button to wake it up. The problem is that pressing the button does not work and you usually have to take out the battery or call the cellphone from another phone.  Secondly, the phone freezes some times and/or there is a slight delay when texting.Finally tech support from both AT&T; and HTC are worthless. THere solution is always a hard reset. I even had the phone replaced twice by AT&T; and both phones had the same defect. Please save your money and get the newest phone where they actually have tech support to help you.", "Date": "January 20, 2012"}, {"Title": "Htc Tilt 2", "Author": "Hugo Ricardo Soto Arzolay", "ReviewID": "R28U2CAITMYQEV", "Overall": "5.0", "Content": "Great cellphone, i like is a nice device with fine camera. i give A++. The GPs work fine, the WiFI have hi range and look great.", "Date": "September 22, 2011"}, {"Title": "Great", "Author": "Jake", "ReviewID": "RKUBW9RXFMJ4Z", "Overall": "5.0", "Content": "This is an awesome phone, and a great guy to deal with. He took his own time to take pics of the phone just for me, and was very helpful. Great buy!", "Date": "February 13, 2011"}], "ProductInfo": {"Price": "$499.90", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nSleek 3G-enabled phone with touchscreen and full slide-out, tilting QWERTY keyboard; powered by Windows Mobile 6.5\nCompatible with AT&T; Navigator GPS, Video Share, AT&T; Mobile Music,\nWi-Fi networking (802.11b/g); 3.2-megapixel camera/camcorder; Bluetooth stereo music and tethering; microSD expansion to 32 GB\nUp to 8.5 hours of talk time, up to 480 hours (20 days) of standby time", "Name": "HTC ST-7377 Tilt 2 Unlocked Phone with QWERTY Keyboard, Touch Screen and 3MP Camera - US Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BxjisQnNL._SY300_.jpg", "ProductID": "B002T1A1RU"}}