{"Reviews": [{"Title": "Tocco Lite", "Author": "D. Bond", "ReviewID": "R1IC4LUOGXKOV8", "Overall": "4.0", "Content": "I've had this phone for about a month now, I am fairly pleased with its performance.  I am somewhat demanding of my phones and always look to get the most bang for my buck.  With the Tocco Lite I can honestly say that it is worth the money.  The only complaint that I have got to date is an issue it has with its blue-tooth.  I use a hands free blue-tooth earpiece that also has headphones with it the Samsung WEP870, great little gadget, the sound quality is excellent.  The problem that I noticed right away is that once you turn off the MP3 player, unless you will use the headpiece, you absolutely must turn off the blue-tooth on the phone as it will eat up the battery within hours.  When I did it the first time, the phone glitched.  Even though the blue-tooth icon disappeared on the screen, the phone's battery continued to drain at a rate of one bar in about 2 hours.  After trying a few things I finally came to a conclusion that the only way to turn off you blue-tooth after you used it with MP3 player is to restart the phone completely.  That of-course resets the arrangement of the gadgets(a.k.a. apps for smart phones) and any other system setting that you have changed.Besides this one little issue, the phone performs fairly well.  Oh, another thing, it works pretty slowly if you are trying to use anything else with the MP3 player working.Hope this is useful.", "Date": "April 23, 2010"}, {"Title": "slow", "Author": "S. Luo", "ReviewID": "R14E7KAZFSAUT0", "Overall": "4.0", "Content": "I love this phone. Its cute, girly pink, stylish. But only that its so slow... You gotta wait for 2 seconds before it responds to you push the button.. sometimes...", "Date": "June 11, 2010"}, {"Title": "Don't waste your money", "Author": "Emily J. Wallace", "ReviewID": "R13DFVR6Q223GV", "Overall": "2.0", "Content": "My blackberry crashed and I needed a phone asap. This was not worth the $60 I paid. Email is impossible to set up. Touch screen is not very responsive. I will be returning this phone.", "Date": "June 10, 2011"}, {"Title": "Great try but buyer beware", "Author": "Elliot", "ReviewID": "R110BIN2HWOUA6", "Overall": "2.0", "Content": "I have this phone in black for over three months now. I was looking for a small PDA type unit that was unlocked GSM. First let me point out that this phone was developed for the European/Asian market and is not supported by Samsung in the US. Additionally, this phone is not supported by ATT. The message notification would not go off after I retrieved my messages and I was receiving a cryptic text message every time I retrieved my voicemail. ATT provided me with 2 replacement GSM chips but to no avail. The unit has it's own failures as well. The system to get to the digit keys when you are on the phone will drive you crazy. Ditto for getting the speaker working or switching between callers etc.After buying an expensive case from Hong Kong (there are not that many quality accessories available here)I will now retire it to the drawer.Forget this model or similar units with slightly different numbers like S5233S (the actual model I bought).", "Date": "May 6, 2010"}], "ProductInfo": {"Price": "$149.89", "Features": "This unlocked cell phone is compatible with GSM carriers like T-Mobile and ATandT. Not all carrier features may be supported.\nIt will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nTouchscreen, EDGE Class 12, Bluetooth v2.1 with A2DP, USB v2.0, SMS, MMS, E-Mail, Stereo FM radio with RDS\nTalk time up to 700 hours - Standby up to 700 hours\nDisplay with 256K colors touchscreen, Accelerometer sensor for auto-rotate, Supports microSD (up to 16GB)\nQuad-Band Unlocked GSM cell phone compatible with 850/900/1800/1900 frequencies plus GPRS/EDGE capabilities", "Name": "Samsung S5230 Tocco Lite Unlocked Phone with Quad-Band GSM, 3 MP Camera MP3/Video Player, and MicroSD Slot--International Version with Warranty (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41KJ%2BezyyyL._SY300_.jpg", "ProductID": "B002EOXKGQ"}}