{"Reviews": [{"Title": "5 Stars for the Phone, 1 for the Vendor", "Author": "madtsr \"madtsr\"", "ReviewID": "R20RVT9EVCS8MJ", "Overall": "5.0", "Content": "I have two pieces in this review.  The first covers the phone itself (great), and the second covers the vendor (not good).  The phone gets 5 stars.  The vendor...not recommended.  The quality of vendors on Amazon seems to be slipping (more of these 25% re-stocking fees for returns).First, the phone:  It is an excellent phone.  I have tried a number of keyboards out, and this one is the best.  Before I bought it, I checked the techie reviews, and the best review I found, covering all aspects of the phone (including lots of pics), is from Mobile Tech Review.  The review is spot-on, on all counts, so I won't repeat everything here.  Bottom line, great phone-highly recommended:  [...]The Motorola website link below is specifically for the Q9h phone, and has good techie & non-techie stuff for the phone.  If you buy the phone, cut/paste/bookmark this site:[...]On to the vendor:  I ordered two of these black phones, and received two metallic phones (same everything, just metallic instead of black).  In addition to sending the wrong phones, the extended battery/back, Micro-to-Mini USB Adaptor; & Micro USB to 3.5mm Headset adaptor were not included.  In fairness to the vendor, this item did not have a list of what comes with the phone.  I contacted the seller regarding some of the missing components, and the email response I received regarding the missing items was this: \"to insure our low prices we purchase our items in large quantities and have them kitted in our warehouse. It is for this reason the package may not contain all accessories as if bought in a retail store, however the product is guaranteed to be new as listed. Customer satisfaction is our number one priority and if you like i and are willing to keep the phone i can offer to have these accessories shipped out at no charge OR if you prefer we have this setup for return.\"We decided to keep the phones, mainly because the kids had opened everything before I got back into town, and this vendor has a draconian return policy (see below).  Some of the missing accessories were shipped by the vendor, but they included different (cheaper) headsets than the OEM accessories listed, and they never sent the extended battery and back.  The extended battery/back is included if you buy from some other vendors, so check what comes in the box when comparing prices. If you are going to use the phone & internet a lot, I really recommend the extended battery/back.  I had to buy the extended battery/back separately, which added significantly to the overall cost of each phone.  Bottom line-check what's in the box, and the vendor's return policy.  Make sure you read their return policy before you start unpacking everything.Return Policy - This vendor has a 25% restocking fee, if you should return anything without the original packaging, or if you remove the protective covers on the phone display, etc.  You also have to pay the shipping and handling to return it, and if you do not insure it, and it gets lost, it is your responsibility (i.e., no refund).", "Date": "July 15, 2010"}, {"Title": "Fantastic phone", "Author": "W. Bowers \"IC744\"", "ReviewID": "R39FKQBTN94I6P", "Overall": "5.0", "Content": "I purchased this phone to replace a phone with weak reception. I would have received the phone in a shorter time frame if UPS had not goofed up on their routing and sent the phone to another city. It was not the seller's fault, they did everything right. The phone was shipped in a timely manner and was in perfect condition, as a new phone should be. This Motorola Q9h is the most fantastic phone I have ever owned. The reception, clarity and volume is incredible. I only have the volume set to 50 percent and it is still louder than most other cell phones I have used. As for the signal strength,  it has been incredible. I have only had this phone for a couple of days, so I can't comment on the longevity of the phone. I will be keeping a close eye on the phone for a few more days and if keeps performing the way it is now, I will purchase another one as a backup in case I break or loose the phone I have now.Update:09/29/2010  I like this phone so much that I purchased another one, while they were still in stock, to keep as an extra in case something happens to the one I'm using now. As mentioned earlier, the call quality is loud and clear and the reception (number of bars showing) is fantastic. It has the best qwerty keyboard of any smart phones I have tried. My typing speed has more than doubled with this phone. It also has voice recognition for calling and with no setup. You just speak the name of someone you have listed in your contacts list and the phone makes the call. One feature missing is Wi-Fi, which is no big deal to me. I get enough speed on AT&T;'s 3G network. Email setup on this phone is also quick and hassle free. I would definitely recommend this phone to anyone who wants good quality phone calls along with great messaging and email.", "Date": "September 11, 2010"}, {"Title": "Good Unlocked Phone", "Author": "sgtmoses", "ReviewID": "RT3B112KC7NGW", "Overall": "4.0", "Content": "I bought the phone to use in Afghanistan since it is unlocked and it works fine after installing a locally purchased SIM Card. The phone was just as described and arrived quickly. The battery life could stand to be a little better. I use it about an hour a day but only getting about two days worth of use between charges.", "Date": "November 30, 2010"}, {"Title": "Good Product, dissatisfied with seller", "Author": "Vicag", "ReviewID": "R3ERJJRGG84T78", "Overall": "2.0", "Content": "Even though the product is good, isn't new and supplier sell it as new.The charger came damage, I had to buy a new one, no accessories, just the phone and manual.I made a claim to the seller for other reasons and receive a poor service in this regard.A pesar de que el producto es bueno, no es nuevo y el suplidor lo vende como nuevo.El cargador llego danado, tuve que comprar uno nuevo, no tiene accesorios incluidos, solo el telefono y el manual.Hice una reclamacion al suplidor por otros motivos y recibi un muy mal servicio.", "Date": "November 2, 2010"}, {"Title": "This is a good phone, but", "Author": "Asi", "ReviewID": "R1RV0UPH8RKHH5", "Overall": "4.0", "Content": "The Motorola Q9 itself is a good phone, but this particular one had problems. We've had this model phone in our home for many years. They take a beating which makes this perfect for teens or a person that works in rough environments like landscaping or construction. I've bought this phone before on Amazon and never had issues which was why I ordered this again when I fried my phone with coffee by accident.I gave this product a 4 instead of a 5 because this particular phone when it arrived had inherent problems in it that I could not fix even after performing a hard start, like buttons sticking and the screen not restarting when the power button was activated. Even though this specific phone had issues the seller was awesome in providing a refund without any difficulties. Thank you!!", "Date": "September 29, 2013"}, {"Title": "it has been in war", "Author": "babak yarkhani", "ReviewID": "R2PQH279J2VWTA", "Overall": "1.0", "Content": "very rough junk looking phone and battery is not working so i have to get a battery but still not happy", "Date": "May 9, 2013"}, {"Title": "Not what it was represented to be.", "Author": "DINO M. AFRICA", "ReviewID": "RB2Z8OQR3IO9", "Overall": "1.0", "Content": "Disappointed that it was a Spanish version that could not be converted to English even after so many tries to do it. Yet the ad says it was universal.", "Date": "February 3, 2013"}, {"Title": "Ended up Returning", "Author": "HuntersPad", "ReviewID": "R3JY3FN8IXXPTH", "Overall": "3.0", "Content": "Was going to use as a backup phone this phone was a Great Phone back in the day but im not basing a bad review cause the seller that sold the phone, But the phone is a good basic phone in today standards", "Date": "January 2, 2013"}, {"Title": "Worse phone I have bought", "Author": "Marwan", "ReviewID": "R3BRR19MU6I8WE", "Overall": "1.0", "Content": "The one which I received was not unlocked, I paid $10 to unlock. Moreover, no wifi and the windows version is very basic and no update or upgrade are available. Limit language support for reading. Sometime when I receive  non-English messages, there is no way to chose encoding, and most software that you could install them in old version or even new one are not able to be installed in this phone.", "Date": "September 25, 2012"}, {"Title": "Very Good Product", "Author": "Guido Rolon", "ReviewID": "R126CAWWHUP4S1", "Overall": "5.0", "Content": "Llego como se esperaba, Arrived as spected. Inicialmente el producto llego bloqueado, contactanto con el servicio tecnico, logramos desbloquear el producto.", "Date": "March 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Simple, elegant and stylish, the ultra-slim MOTO Q 9h, at only 11.8 millimeters thick packs in a host of advanced features\nQWERTY keyboard and large, crisp display\nQuad-Band (GPRS/EDGE) functionality\nVideo capture and playback at 30fps\nHSDPA technology for fast data transfers, streaming media and web browsing", "Name": "Motorola Q9H Windows 3G GSM Unlocked Black Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/31h8OKo8TtL._SY300_.jpg", "ProductID": "B002T1QKSE"}}