{"Reviews": [{"Title": "Scam!!!! DEVIL SELLER", "Author": "Beatriz Sullivan \"BEST\"", "ReviewID": "R2ZVPGD1NGH0HQ", "Overall": "1.0", "Content": "What a scam!!!!, I purchase this phone because of the price of course but also because they were advertising with Amazon.com. The phone came with a BIg Ship that scractched my hand the metal is sticking out. No software to install, no media card no even the smallest available. My family has bought Blackberries from Amazon and they have got the media card, software , NO ME!!!!I very MAD about the whole experience..", "Date": "December 26, 2009"}, {"Title": "Counterfeit Phone", "Author": "John Kasumba", "ReviewID": "R325I8H98ARUMD", "Overall": "1.0", "Content": "This phone was so fake.  It's just unfortunate that I bought it for someone who lives abroad.  I got to find out its problems when the period for returning it had expired.  Black berries are supposed to have memory cards,but this one never had one.  I was also informed that it was tampered with when I took it to a technician.I can not recommend anybody to buy from this store.", "Date": "January 14, 2010"}, {"Title": "A good smartphone if you get a real one and not a fake", "Author": "Michelle M. Ress \"safoocat\"", "ReviewID": "R2TJ9OJ8EKHMEA", "Overall": "4.0", "Content": "It sounds like the one star reviewers got scammed into buying a fake BlackBerry to mebecause I've had several of this model of BlackBerry and can tell you they are a good phone.Also the camera is a good one so if you are looking for a BlackBerry smartphone don't hesitate to buy this model. Just make sure it's the real thing and not a knock-off.Michelle Ress", "Date": "February 20, 2010"}, {"Title": "the telefon is not working good, the pin number not correspond to the serial number and the camera no not work, I need to change", "Author": "Giovanni  A. \"Bambino\"", "ReviewID": "R2MKVJTSTRT1M2", "Overall": "1.0", "Content": "the telefon not wor, because the pin number do not correspond with the serial number of telefon, the battery is generic, the photo and video camera do not work, and is imposible assign a BlackBerry service, I need to change the telefon soon", "Date": "January 10, 2010"}, {"Title": "This Company Shoulde Be Banned From Amazon.com", "Author": "J. Braulio", "ReviewID": "R345Q6D1SGA2AO", "Overall": "2.0", "Content": "We have been for years buying all kind of products trough Amazon.com and spent thousands of dollars. Amazon.com has my buying record and never, never I had a situation like the one when a I bought my son`s celular phone from this company. Since first day, his BB  is not working properly and we took it to a certified agent who  told us  \" inside parts are not original\". I hope this not happen  to any one else. Regards,", "Date": "February 3, 2010"}, {"Title": "Extreemly Fragile", "Author": "purtellbrian", "ReviewID": "R2XSLZC13QQD6P", "Overall": "3.0", "Content": "The charger connection to the phone was faulty, and never really took a full charge..... The phone is pretty cool though", "Date": "August 31, 2010"}, {"Title": "This Phone like not original and doesn't work, it shows no service", "Author": "Alejandro Ruiz", "ReviewID": "R5W7L9ZAIRIPC", "Overall": "1.0", "Content": "The battery is not original and it seems not new, i got it without memory card, i'm so mad about this purchasing and i need answers, probably it is my last purchase in Amazon. The phone can't connect to the red gsm and edge of the phone company from Venezuela and it always is restarting. I spend 190$ in this product, i really angry for this purchasing", "Date": "July 8, 2010"}, {"Title": "Blackberry curve", "Author": "Sherel Gayle", "ReviewID": "R2OYHT5IHRS0NW", "Overall": "4.0", "Content": "I bought this phone for awhile now and still have it. And it still works have no problems at all.", "Date": "May 16, 2013"}, {"Title": "GREAT!", "Author": "g12", "ReviewID": "RLWRLZS8WVGTO", "Overall": "4.0", "Content": "so i just received this phone in great condition! idk how the other 1 star reviewers got bad phones....mine is great only thing is the wifi dont really need it wouldve preferred 3g but amazing phone love it! did come in 2 days late...but it was worth it.", "Date": "January 31, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002SZK1TU"}}