{"Reviews": [{"Title": "Awesome phone, but a few things to be aware of.", "Author": "A Customer \"customer12345657\"", "ReviewID": "R2QR08ZQSOWT8S", "Overall": "4.0", "Content": "(Note: I am judging this phone against my previous long-term models, which include w200, z310, k550, w350, as well as some others I have poked at)I am extremely satisfied with this phone, but let me start with a couple things which might be deal-breakers for some people.1. The number keys are a little on the stiff side.  Not unusable, but a little stiffer than the w350 or k550.2. This phone does have some creaks and wiggles.  However, I found that much of the creaking in the open position was actually caused by the battery lid, which I fixed by sandwiching a sheet of toilet paper under it.On to the real features, most of them pretty good...>> Sound quality AND volumeThe w595 has the clarity of the old k550, but both the earpiece and the ringer loudspeaker are louder.  It's not as loud as the ringer on the w350, which is among SonyEricsson's loudest for some reason, but it's still louder than the k550, w200, and about as loud as the z310 (without the z310's poor quality).It has loudspeakers on both the top and bottom of the phone.>> DisplayThis phone has a display with good brightness and color saturation, and SonyEricsson's new light sensor to adjust the display brightness based on ambient light (i.e., in a movie theater, the display automatically drops to low, but boosts to full in bright sunlight).The viewing angle is not as wide as the w350 or k550.  It is mainly for direct viewing, but there appears to be a tradeoff because viewing the display horizontally (for videos) is actually better than most other phones.  Most phones look good in the \"normal\" position, but look bad when turned 90 degrees.  This one is good both ways, as long as you look straight at it.The 240x320 resolution is really good for mobile web browsing (especially with Opera Mini), Google maps, reading emails, and everything else.It's more visible in sunlight than most phones.>> CameraPretty decent image quality, though it lacks auto-focus (SonyEricsson seems to be reserving this feature for their new Cybershot models, so I wouldn't expect it elsewhere any more).  The shutter responds fairly fast, which is actually an advantage over the autofocus models as long as you don't need to take pictures less than a few feet from the subject.If you like to take photos as a way of making a quick note of something (like a product package), you can still do this.  Take the picture a few feet back so it isn't out of focus, and use the volume keys to zoom in on the image when you want to read it.>> Java applicationsIt runs games, Opera Mini, and Google Maps very well.  Opera Mini starts up in just under 5 seconds.  Much like the k550, the w595 will run almost any games.***Upgrade: the new menu system lets you create a shortcut directly to a Java application (as long as it is in the Applications folder).  I have the right-arrow shortcut set to load Opera Mini, so it can be accessed as quickly as the built-in browser.>> Video playbackIn addition to playing 3gp video, the W595 is one of the few phones which will actually play MP4 videos.  Some phones claim it, but actually require you to convert it to a 3gp.  True MP4 videos are much higher quality than 3gp.  I was able to play an hour-long science lecture I downloaded, which makes this cool phone \"educational\".NOTE: do NOT play videos by finding them through the \"Media\" menu.  This new media menu is a fancy-looking scrolling interface which is completely unnecessary and causes video playback to lose sync with the audio.  A firmware update \"fixed\" this by forcing the audio to synchronize every few seconds, which still looks like crap.  Use the File Manager like a civilized human, and all of this trouble goes away.  It's located in the Organizer menu, and you can make a shortcut to it if desired.>> Email clientAs I write this, my w595 is push-enabled by using the IMAP feature offered by GMail.  As of last year, both Gmail and Yahoo have IMAP support for free.  This sends you email to the phone without having to dial out manually to \"check\" it.  I ignorantly declared that previous models did not support this without a carrier service, but it turns out some did (but no free email services offered it).The email setup is also much easier.  I just entered my GMail address/password, and SonyEricsson is clever enough to find all of the correct server/port settings for GMail.  It was also smart enough to check if GMail supported IMAP, and asked me if I wanted to use it (\"yes please!\").Regular POP3 is of course also supported, if you don't want a constant email connection.>> AccelerometerThis is the kind of thing the iPhone and Wii have, so the phone can sense movement.  It's not an entirely practical feature, but it adds \"coolness\" if you want to impress your friends with a bubble level (available on the SonyEricsson website).>> RSS ReaderIf you don't know what that is, skip this section and save hours of your life.  If you are already using RSS and you want the Internet to be force-fed to you, this latest version offers improvements over the previous models:- Set update times for any or all hours of the day, individually for each feed.- New stuff shows up in a popup scroller on the home screen, with photos if available.>> Multi-taskingIt seems to handle running one application while one or two others are minimized.  To minimize a Java application, press the END key ONCE, and select minimize (pressing it twice closes it).It offers full menu access during phone calls, so you can do things like check your tasks/calendar while talking to someone.  Java applications can be run during the call, but Internet access appears to be disabled and media files won't play.>> OrganizerAs usual, SonyEricsson offers a good alarm clock which provides the only structure in my life.  New and existing features:- Multiple alarms- Set any of them to either repeated (on whatever days you choose), or one time- Use ANY sound on the phone as an alarm- Adjust the volume for individual alarms (morning wakeup full volume, tea time a pleasant low)- Add a picture to display- Add a text description.The organizer also include a lot of other good stuff, such as:- Tasks, with instructions and reminders on set dates/times.- Notes, so you can store notes without resorting to SMS drafts.- Calendar, timer, stopwatch, etc.>> Shortcut/event menuThis is one of many models with a really handy button which brings up a custom shortcut menu.  It's complex to explain, but really handy to use.The shortcut menu has 4 \"tabs\":- New events (usually a missed call, new message, or a task due)- Running applications- My Shortcuts- InternetUnless something special is happening, clicking the shortcut key will bring up your shortcuts.  If something special is happening (new event or running application), that tab will automatically come up.  You can use the left/right keys to switch tabs at any time.This shortcut key works at all times (e.g., while on a phone call or while browsing the Internet).  Thus, you can be browsing the Internet, and if you hear the message alert, you can click the shortcut key to bring up the message and close it again without closing the browser.  Or if you minimized an application to do something else, you can click the shortcut key to bring up the list of running applications without navigating to it.>> Track IDThis is a really neat feature included with many of the Walkman phones (and a few non-walkman models).  If a song is playing on the radio, in a store, etc, and you don't know what it is, Track ID will record some of it, and connect to some Internet server which will tell you the song/band.  It's not perfect, but it works much better than you might expect.>> Battery lifeSo far, it's pretty good.  I watched a 1-hour video, which is a pretty hefty task, and only lost about 15% battery capacity.  I keep the email connecting running 24/7, and I use about 45 minutes of internet and/or games per day.  It doesn't ever fall below 50%.The main reason I dropped one star from this phone's rating is because the housing just isn't well refined.  Everything functions fine, but a 5-star phone just shouldn't have the creaks and wiggles.Yikes, that's an enormous review, and I don't feel like proofreading.  No warranties implied.Tips and stuff:1. Don't use the Media menu to play videos (see above).2. If you are going to use IMAP for email access instead of POP3, make sure you are using GMail correctly or it will try to download every email you ever received (I will post a detailed explanation in the comments).3. The battery lid sucks.  Just pry it up from the obvious spot, as wrong as it feels.  Careful, it may spring out and attack you.  If it creaks when closed, see my ghetto fix (also in the comments section).4. You can set the slider to end the call, or not end the call, via an option in the settings menu.", "Date": "June 18, 2009"}, {"Title": "Sony Ericsson w595a", "Author": "Jarad N. Ice", "ReviewID": "R2X32AWF9VO870", "Overall": "4.0", "Content": "By far the best Sony Ericsson product I've owned.  Which really doesn't say that much because the last one was an AT&T; branded z750a, which wasn't terrible.. just had that nasty \"hey, I'm going to turn off now, kthxbai!\" glitch.Lets star with the Pros.Big bright screen, even scratch resistant.  However I do recommend a screen protector, Expert Shield makes a good one *hint*.Solid keypad and face buttons.Clear call qualitySliding motion is slick and tight.Stereo speakersLot of pre-installed apps and themesAcellerometer, it has its uses.Walkman 3.0 player3.2mp camera. Pictures qaulity is good.Comes with everything - 2GB M2 card, USB cable, M2 to USB adapter, ear buds.  About $50+ worth of accessories, give or take.CONSOddly placed walkman button, i sometimes press it while sliding the phone downSlide feels a bit wobbly when slid out.  It's not real bad, but enough to make you be carefull with it.soft plastic.  I dropped mine a few feet when i was laying on my bed and it landed on it's charger where it plugs into the phone and put a tiny nick into the plastic, barely noticable but still there.Ear buds are kinda big and they don't fit in my ear real well, but the sound qaulity is top notch.Other NotesNot compatible with AT&T;'s 3G network, and this can be a deal breaker for some, not so much for me cause I just talk and text.  The phone will automatically turn it's mobile network type to GSM only when on an AT&T; SIM card.  So if you're worried about the 3G/HSDPA looking for a signal and killing your battery and you can't find it in the Mobile Networks menu under connectivity, no worries.. it turns itself off.  I had to figure that out with some software called \"My Phone Explorer\" good stuff check that out too.Face buttons take some getting used to, but once you got them down. it's a breeze.  I also thought the slide doesn't go far enough above the keypad so if you've got fat fingers and thumbs like me, it can take some getting used to.Overall, 4/5.  Great Phone and i'd pick it up again, it's very compareable to the w760 and a lot better than the w580 and w910.  This is what the w580 and w910 SHOULD have been and Sony Ericsson nailed it.  However, if you want something a little better in the walkman line you can't go wrong with the w705.", "Date": "June 4, 2009"}, {"Title": "good phone bad seller", "Author": "James Porter", "ReviewID": "RYM9M7YI2RYYF", "Overall": "5.0", "Content": "ive loved older models of the Sony Ericsson so i thought id try this one..... thats when the issues began..... i bought it from Cellular Square and there were several issues with the order. First they gave me the wrong charger and totally forgot the battery.... 2 weeks later i finally got the charger however the phone didnt work so i returned it and they sent another that took about 2 weeks.... so far we are only at a month..... then when i got the new phone and then realized that the charger they had sent earlier did not work sent it back then 2 weeks later they  said they got it and it took another 2 weeks for me to actually get the working one which was actually packaged way better than the first one and had everything.... i love this phone and so far its been working great... i waited a few days before writing this just so i could see if it worked.... the phone itself was exactly what i expected.... i have noticed sometimes when im online it kicks me off and the screen blacks out for a few seconds though.... its a great phone works ok..Do not buy from Cellular Square.... Alix the Senior Manager didnt help me much in fact it was an employee named Chris that finally made sure everything was working and who sent it off and gave me my final tracking number a week after the manager told me he was going to send it off..... Alix also made excuses and would not accept responsibility for the mess ups he said Sony sent a LG charger which is obviously a lie.....", "Date": "May 24, 2012"}, {"Title": "Dont see the money refund back !!!", "Author": "Hoang Dieu Hong \"hdh\"", "ReviewID": "R2A3RQYL89K5JU", "Overall": "1.0", "Content": "I ordered the item but I couldnot receive it. Also, I didnt receive my money back!!! And Amazon could not explain well the reason !", "Date": "November 19, 2009"}, {"Title": "Great Phone", "Author": "radharose", "ReviewID": "R19P6EZITYXJC2", "Overall": "4.0", "Content": "This phone is a pretty good phone overall.  It has a real sleek look, and is pretty thin and lightweight.  I love the volume power it has; it out-performs all my friends' phones in that aspect.  I also like the fact that the speakers are on the ends of the phone, not the bottom, so it gets nice sound quality, and you don't have to always have the phone face-down, or upside down to hear the music well.  The camera takes pretty good photos, but the video is grainy and leaves something to be desired.  I like the media feature, where you can review photos, music, games, etc., but I wish that one could exclude some photos from the media section.  I don't want some people seeing all my photos if they start browsing through them.  I do like the photo tag option; it makes it quite convenient to view photos of a certain category.  The quality on calls is good, and you can enter your friend's picture into their contact, and it shows up when they call you.  If you have a mac, the software for this phone will not work with your computer which kind of sucks.  Sony Ericsson doesn't currently offer any software for it for the mac.  Overall, I'm quite satisfied with this phone, and would definitely recommend you getting it, especially for the price at which Amazon is offering it.  This phone is definitely worth the $200.00.", "Date": "October 6, 2009"}, {"Title": "wobble issue", "Author": "A. Amer", "ReviewID": "REH9O7X9ZPXTD", "Overall": "4.0", "Content": "i just received mine today and i have to say its a good phone but my issue is that when i slide the phone out the bottom part of the slide wobbles , did any one have this issue ?did you RMA? was there a difference?also when i open the phoe the lights on the keys turn all at once but the 7 and * seems to turn on last ? any idea?", "Date": "October 5, 2009"}, {"Title": "Every Sony Ericsson has a flaw...", "Author": "D. Herbert", "ReviewID": "R1J9BN3QW29E53", "Overall": "4.0", "Content": "If you've had a Sony Ericsson before, the W595 won't be a big wow factor. But if you haven't, you'd be blown away by the unbelievably bright screen, the looks, feel, and interface. I've had many sony ericssons in the past, but this is by far the best I'VE had yet.Pros:- Small (same as the W200, when it's closed of course)- Updated User Interface (very user friendly)- Loud (enough) Speaker, which is Stereo (has a speaker on both ends of the phone)...along with all the other Sony Ericsson perks.- Camera is ok, not the best, but that's coming from an aspiring photographer.- Radio is nice, I don't use it often, but it's nice- comes with a 2GB Sandisk memory card (sweet!)- also comes with a 2 headphone jack cord for your phone (at least mine did)Cons:- NO SMS DELIVERY REPORT. This was specified, at least not where I read thee specs.- No flash, but I knew this before I bought it, and having a flash isn't exactly on my check listOther little annoyances:- Slider is shakey, but not enough to have me worried of it falling apart.- The placement of the oart to charger the phone, to me, is ackward. But hey, that's just me.- No CD. But you can always download the program. I recommend Sony Ericsson PC Suite 4.0. It's really great.SummaryAll around great phone, nice replacement to my R600 and W200 (yes I had 2 phones). I recommend the blue verison, in my opinion, it's the best looking one. Once you've done your research into the Sony Ericsson and you see that this one is right for you, go for it. You won't be disappointed.** Feel free to ask questions about whatever I missed in this review", "Date": "October 1, 2009"}, {"Title": "Beauty!", "Author": "Sehrah \"sehrah07\"", "ReviewID": "R2AAWEPE7B9LV4", "Overall": "5.0", "Content": "I love this phone! It was sent to me as soon as possible. Thank you Sony Ericsson. This phone is a beauty, I can't stop looking at it. I'm pretty much the only one who carries this phone. Love that! It's so unique in every way, and it really matches with my personality. I love the colours and the clarity of the mobile. Now I will purchase a Sony Ericsson case to go along with it. :)", "Date": "September 14, 2009"}, {"Title": "love it", "Author": "D. Kristianto \"donny\"", "ReviewID": "R1F1R3DNDPCZQZ", "Overall": "5.0", "Content": "love it so far. have been using it for a month now. i like the strong yet semi-bendable battery cover. love the good quality camera as well. it has multiple alarm system that will allow me to have six or seven (or more) different alarms to be set at different times. love the capability to add an external memory card as well. best SE i have ever got my hands on so far. and yes, i have been using walkman phone since the first time it was released, and this one is still the best.", "Date": "June 7, 2009"}, {"Title": "SE W595", "Author": "Shby", "ReviewID": "R2ZWPNX7KYRNVL", "Overall": "4.0", "Content": "I bought this phone because I didn't want to sign another contract and needed a phone. I love Sony Ericsson products. The phone rings loud. The MP3 player remarkable 100 songs loaded and still have space for more. The camera takes remarkable pictures. Make your own ringtones. Wonderful phone. Great price too. I recommend this phone.", "Date": "June 3, 2009"}, {"Title": "so far so good", "Author": "newphone \"newphone\"", "ReviewID": "R2E4307Q7SJILK", "Overall": "4.0", "Content": "good phone, but for me it takes a long time to connect to a bluetooth device. Also for about $ 40 more, u can get the G705 in amazon, which has wi-fi and GPS", "Date": "October 20, 2009"}, {"Title": "Slider", "Author": "J. Chea", "ReviewID": "R3MWVOL1NUD816", "Overall": "3.0", "Content": "I bought this phone for my mom.  Everything is nice, but when I slide the phone out.  I notice that the top part of the phone feels loose.  It can rock back and forth.  It wobbles.  But when I slide it in, it doesn't wobble and feels firm and tight.  Is anyone experiencing this problem too?  Or is my phone a defective?", "Date": "May 21, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nUnlocked quad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and GPRS/EDGE data capabilities\nSlider phone with Walkman media player, one-touch music shuffle, dedicated music control keys, built-in stereo speakers\n3.2-megapixel camera with video capture; Memory Stick Micro expansion (up to 2 GB); Bluetooth stereo music streaming; FM radio with RDS\nUp to 9 hours of talk time, up to 380 hours (15.8 days) of standby time", "Name": "Sony Ericsson W595 Walkman Unlocked Phone with 3.2 MP Camera--U.S. Version with Warranty (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41gmFNiNz2L._SY300_.jpg", "ProductID": "B0021L9FRU"}}