{"Reviews": [{"Title": "Great Customer Service", "Author": "SmilinginUtah", "ReviewID": "R1S1WW2UTR2ZGK", "Overall": "5.0", "Content": "I bought this phone specifically from this seller because of the positive reviews.  When I received the phone I noticed a couple of features stopped working.  O.K. I will admit I got worried.  Returning items bought on the internet can be tricky and sometimes it is just not worth the hassle.  This SELLER was WONDERFUL.  They responded to my e-mail immediately.  I returned the item and they sent a new phone.  Everything is working and I'm very happy with the product and the customer service I received from this seller.", "Date": "February 15, 2011"}, {"Title": "The best NON-SMART phone I have ever used", "Author": "E. S. Gowen", "ReviewID": "RCBPMAJ8LCSZY", "Overall": "5.0", "Content": "I admit that this phone is inferior to many smart-phones that are currently on the market. Those all, however, require a data plan to use. If you are like me and want a quality phone without having to pay for a data plan then this is the phone for you. I have been using a BlackBerry Pearl for the last 6 years, so I am pretty familiar with its pros and cons.Pros:-Modified qwerty keyboard. While it is not a full qwerty (most of the buttons share two letters) I only commonly run across one mix up (\"see\" and \"are\"). That is a HUGE improvement over 9 key.-A smart phone quality calendar.-Very good media player-Bluetooth-Great Address book options.-Unlimited text inbox space; not the 250-500 text limit that virtually all phones have.-Many text search options. Great for when you are looking for that text you need but can't remember when you got it or who sent it.-Voice dialing-Fits very well into a pocket-Can set any size file as a ringtone, alarm, etc....I could go onCons:-The camera and video camera are not very good. I understand that there are people for whom a phone camera is more important than a calendar or address book or wifi then this is not the phone for you.-Much like a roller ball mouse, every year or so the track ball needs to be cleaned. There are many tutorials online that explain how this should be done. Once cleaned it works like new.I have used many many phones, but this is far and away the best NON-SMART phone I have ever used. Ever.", "Date": "November 18, 2012"}, {"Title": "Thank you!!!", "Author": "Misha", "ReviewID": "R2TE2RA59KK85J", "Overall": "5.0", "Content": "I love it !!!Everyting is good. Everyting is nice.Thank you so much.You are profesional!See you soon...", "Date": "September 15, 2013"}, {"Title": "Just Great", "Author": "numba9", "ReviewID": "R1GYX6RBUC8009", "Overall": "5.0", "Content": "I bought this for my 15 year old daughter, it came fast, was very easy putting a sims card in. Only problem was the usb cord was the wrong one, they said the correct new one is in the mail Battery started off good, but it take forever to get it charged, then only to half, we have spares at home so it ends up no big deal. All in all for price for it was worth it, and they are nice to talk with, sent new usb right away", "Date": "September 15, 2013"}, {"Title": "Great", "Author": "mayte carniglia", "ReviewID": "R5FM6BVSOKHYQ", "Overall": "5.0", "Content": "i receive the phone in good condition.it working properly ...good picture and sound an boxes ..and accesories it complete......and more", "Date": "June 17, 2013"}, {"Title": "great buy", "Author": "Didz319", "ReviewID": "R2AFY7QBSY5QHY", "Overall": "4.0", "Content": "I was planning to go oversee and I needed to have a blackberry that was not locked so that I could send bb messages to my family and save cost of communication. This phone served the purpose well. However, the product manual was incomplete and I had a hard time figuring out how to use some functions on the phone. Great phone though. Overall, a great shopping experience.", "Date": "November 9, 2012"}, {"Title": "not exactly", "Author": "Elenor Gawat", "ReviewID": "RJTJH1KR8Z0DI", "Overall": "2.0", "Content": "It did not show in picture that this phone is an at&t.; The pictures should match the real item on it.", "Date": "December 18, 2013"}, {"Title": "Blackberry Phone", "Author": "Monticellomama", "ReviewID": "R2NZQF3P9OSZ4B", "Overall": "4.0", "Content": "This is the second one I ordered. The first one the numbers1 2 3 stopped working. So far this one is doing o.k.", "Date": "April 17, 2013"}, {"Title": "Good phone, but can't get it to work with Orange in the Caribbean.", "Author": "Amazon Customer \"Brooklynite\"", "ReviewID": "R357O7FTLNOBYL", "Overall": "3.0", "Content": "Good phone, but the BB service provided by Orange in the D.R. Has not worked. I can get calls ad receive them, I can even send texts abroad, but when it comes to service with BB, I have not been able to get that working at all.  Someone said the operating system might be outdated and by not being able to use a newer version of the operating system, that could be creating a communication conflict, so be sure to find out what OS is compatible with your carrier B4 purhase.", "Date": "March 30, 2013"}, {"Title": "I do not recommend", "Author": "Jhonny Sierra", "ReviewID": "R2KZ99QDGIZ7H1", "Overall": "2.0", "Content": "The phone itself is good, but it came without PIN. Contacted the dealer, but he not solved and so my low rating, but it would be an excellent phone, which is practical and simple", "Date": "February 1, 2013"}, {"Title": "buenisimo", "Author": "walter", "ReviewID": "RQ6ZIJ955B3PS", "Overall": "5.0", "Content": "el producto llego en perfecto estado, el tiempo de entrega fue lo pautado, la señal y la cobertura son buenas en nuestro país.. así que se lo recomiendo", "Date": "January 12, 2013"}, {"Title": "Good phone, non-existent software and instructions, late delivery.", "Author": "Boethius \"Potent Potentate\"", "ReviewID": "R2LN07YZ5EM36S", "Overall": "4.0", "Content": "The phone I received (BB 8120) appears to be  a jail-broken AT&T; unit: it has the AT&T; logo.  It came without any desktop software and a very--very!--rudimentary set of instructions. On the other hand, It was new, booted up in English and worked out of the box with my T-mobile SIM card. . The device software version is v4.5.0.182; There is an update on the AT&T; web site  (v4.5.0.306) which I did not bother with. I downloaded  the Blackberry desktop software version 610.b034 from the web, along with the full product manual and the getting started guide. .The desktop software installed on Windows 7 without any problem and runs well; my outlook calendar and address lists  synchronized w/o any trouble. This is a good back-up unit.  If you buy it avoid the Fedex SmartPost option. It should be renamed the Fedex VeryLatePost. Mine was.", "Date": "December 10, 2012"}, {"Title": "problem", "Author": "frank Torres", "ReviewID": "R303U0CA58E0BY", "Overall": "2.0", "Content": "PIN code box is not equal to that of the cell.I can not use mobile technology company. I can fix?", "Date": "December 8, 2012"}, {"Title": "BRANDED phone sent", "Author": "Amanda", "ReviewID": "R16A9QQTO1B5LH", "Overall": "5.0", "Content": "The phone came BRANDED (AT&T;) even though the picture is not. The seller was TABLET DISTRIBUTORS. Even though I click on the link to this item from my past orders, this page now has a different seller. I WOULD NOT recommend buying from this particular seller if this is important to you. Right now, the seller is not a \"fulfilled by Amazon\" one, even though it was at the time I purchased mine and I am extremely disappointed. I usually buy straight from Amazon only (but how else will I get a sweet old Blackberry pearl?).The phone itself is apparently new with plastic cling on all the scratchable parts. It also came with a Blackberry battery and Blackberry charger, and instruction manual. However it didn't come with the pouch!!! They are like $5 but it really should have come with it. Also, the insides of the phone look scratched, which is weird since the outsides look nice. The box is a black unbranded Blackberry box.I'm definitely sending this phone back. I don't care that it's not 100% legit, perhaps, but I really didn't want an unbranded phone, and that's what is apparently supposed to be sold here. Can't decide if I will give a different seller here on Amazon a chance or if I'll just eBay like everyone else.", "Date": "November 26, 2012"}, {"Title": "excelente", "Author": "Dinoska Marin \"DINOSKA MARIN\"", "ReviewID": "R2GQ4L9D6S7KYB", "Overall": "5.0", "Content": "el producto cumplió con los parámetros,  tiempo rápido de entrega y esta en perfectas condiciones  funciona a la perfección.  gracias", "Date": "January 12, 2013"}, {"Title": "El peor de los productos", "Author": "Mary Bellorin", "ReviewID": "R7MJ1WJE5Z8OF", "Overall": "1.0", "Content": "El peor de los productos adquiridos en mi compra. en las especificaciones deberian decir que se trata de telefonos los cuales tienen el pin reportados como robados. Muy mal producto, no lo recomiendo en lo absoluto.", "Date": "December 8, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Wi-Fi Support\nMobile Streaming\nVideo Recording", "Name": "Blackberry Pearl 8120 Unlocked GSM Cell Phone - Wi-Fi, 2 Megapixel Camera, Bluetooth, MP3 Playback, Titanium", "ImgURL": "http://ecx.images-amazon.com/images/I/41RbtSEaW3L._SX300_.jpg", "ProductID": "B0029YDXHM"}}