{"Reviews": [{"Title": "Awful user interface", "Author": "Chris", "ReviewID": "R2HWJ01QM9262F", "Overall": "1.0", "Content": "I've had this phone for a couple of years through work as do several of my coworkers so I've gotten to know it fairly well.I would NOT recommend one to anyone. The user interface (UI) is awful.The full keyboard is reasonably usable, call quality and battery life are fine but the UI is so bad you just don't want to pick the phone up.Perhaps that's what my employer was going for: give people such awful phones they don't want to use them.Full disclosure: I've owned BlackBerries and Apple iPhones so perhaps I'm a bit spoiled as to what a UI should be.", "Date": "November 2, 2012"}, {"Title": "Tons of fatal problems with this phone. Don't buy one.", "Author": "Rich L.", "ReviewID": "R18WIYP4Z2HMXM", "Overall": "1.0", "Content": "I've had this phone since Christmas. Worked ok at first, although it dropped about 1 in every 4 calls at some point during the conversation, it overheats quickly, and it wouldn't play any videos, which is why I bought it. Now it won't even surf the web. What a complete waste of money.", "Date": "August 13, 2012"}, {"Title": "Pretty good", "Author": "Eryine", "ReviewID": "R2EEDRDI41KD3C", "Overall": "3.0", "Content": "i got this because i pretty much hate all other brands of phones, and so far as a nokia it's as customizable as i want it to be. keep in mind though that as this is an older phone, it doesn't have some convenient features of a newer model (i.e. doesn't tell you who a new text is from) but these seem negligible to me. i really like this phone aside from a couple things: sometimes the alarm will just turn itself off. not sure why, but it seems to help if you leave the clock app up. also, when the keys are locked, there is no way to just hit a button and check the time; it just stays dark & asks if you want to unlock. finally, the full keyboard (while nice) is not quite fast enough to keep up with a normal rate of typing, so be prepared to slow down a little bit &/or keep an eye out for missed letters in you text. this is recognized by carriers as a smartphone, so be prepared to pay for the required data plan (not something i wanted or even new about). hope this helps.", "Date": "March 23, 2012"}, {"Title": "Excellent", "Author": "linda girten", "ReviewID": "RVHQLSPXE5UW2", "Overall": "4.0", "Content": "Exactly as expected. I was replacing another phone that I used exactly like this one. The only problem is that now when I receive a call it doesn't show the name from my address book , only the number. I don't like it but haven't been able to figure out how to correct the problem.", "Date": "February 1, 2014"}, {"Title": "Do NOT buy this phone!!!", "Author": "Dan", "ReviewID": "ROIJ4B2HX7NIH", "Overall": "1.0", "Content": "I bought this phone, it came brand new, but it was not charging. So I contacted to Amazon and sent it back. I ordered another one, hoping that the other one would not be defective, but even the second one was defective. It would not reqognize the ATT's sim card (the phone is for ATT). So I contacted ATT couple of times and they told me that this phone is defective too. So I have already sent the second phone back to Amazon too.P.S. I have never seen Nokias made in Mexico!!!", "Date": "March 22, 2012"}, {"Title": "Defective Item, BEWARE!!", "Author": "Jose Gomez", "ReviewID": "R1KCUBMPHYIEBS", "Overall": "1.0", "Content": "It was a waste of money and time. It doesnt work, as simply as that. The battery doesnt work and also it doesnt reads any sim card.Dont buy it.It is the first time that Nokia has let me down.", "Date": "February 11, 2013"}, {"Title": "sent a phone unusable.", "Author": "Diana", "ReviewID": "RDR84S7VSIRXJ", "Overall": "1.0", "Content": "not work, they sent me a useless phone, turn it on and try to start, never buy this phone, not recommended.buy this phone is a waste of time and money.", "Date": "December 4, 2012"}, {"Title": "Read War and Peace Instead", "Author": "R. A. Farver \"crabbup\"", "ReviewID": "RI9J5GGWQ8WYB", "Overall": "1.0", "Content": "I was like a dog with a bone in regard to this phone.  I would not let it defeat me.  But, in the end, it did.  To perform the simplest functions, (like calling out to a non-contact) you had to go through a labyrinth.  You may think you like the price, but you might be better off with something less brain twisting.  Did I say you have to open the keypad to call out?  that's if you are allowed to call out, just by using the slider, which you will not be.  At some point, the numbers changed to symbols...why?  I got tired of trying to find out.If it was sunny out, I could not see one single button on the darn thing.  If it was dark, the keyboard would sometimes light up, for about 3 seconds, and then go out, only to sometimes come back on again.  You tell me.  and yes, I downloaded the manual, and yes, I put all the settings on the brightest and the loudest.  The symbols were sooo small (and I did fine for years with a flip phone) and they never did what they were supposed to, even when I could get lucky enough to see what one I was pushing.  this phone was not for me.  Maybe for you,  but not for me.", "Date": "May 19, 2014"}, {"Title": "Battery will not charge", "Author": "Alan White", "ReviewID": "R3AJ3HPOHLNEXM", "Overall": "2.0", "Content": "I have poor experience with this phone because it won't charge the battery.  I have this same phone but the battery is bad and the pixels are not doing well.  Have had it for years and really like this phone.  The battery from the new phone charged well in the old phone and it worked in the new phone.  But if it won't charge in the new phone then there is something wrong with the Remanufactacturing process.", "Date": "September 16, 2013"}, {"Title": "Great!", "Author": "Muhammed", "ReviewID": "R1EJ0HMK57B920", "Overall": "5.0", "Content": "I really liked the product. It is unlocked and it can read Arabic names but cannot write in Arabic. I really love it! On time and awesome! Thanks very much.", "Date": "August 3, 2013"}, {"Title": "Really Nice", "Author": "Verant Mark", "ReviewID": "R7QTPXZCXU6U8", "Overall": "5.0", "Content": "I am very happy with this purchase. Everything went smoothly and it was delivered in quick time. The phone is a dream. It fits neatly in my pouch or pocket and the slide keyboard is inspired..", "Date": "February 17, 2014"}, {"Title": "Bought unlocked, online to replace the worn out unit that I had", "Author": "Reginald D Anz", "ReviewID": "R3ADI2E220MZ4T", "Overall": "5.0", "Content": "This phone has the biggest keys of any device that I've seen, but is also one of the smallest available.  A non-touch screen, it uniquely fills the bill for exactly what I wanted.", "Date": "March 26, 2013"}, {"Title": "Very good", "Author": "Fabian Ekeanyanwu", "ReviewID": "R30UCE575DHGDE", "Overall": "5.0", "Content": "This is a power house of a phone and I will recommend it any day for some one who is looking for a good phone", "Date": "November 10, 2012"}, {"Title": "I like it", "Author": "Joe", "ReviewID": "R2L68PH0LZGGUR", "Overall": "5.0", "Content": "The battery was not charging and to buy a new one. There was no US B cord, neither was there a CD setting up the camera. I spent US$60.00 for a new battery. I am sorry it is only now that I am writing this review; work, time and other committments somewhat hinded me from doing so. I am hoping to get a satisfactory response from you all.Thanks,J.Walter", "Date": "September 26, 2012"}, {"Title": "great phone", "Author": "jason", "ReviewID": "R1ISWHW3EHZ28H", "Overall": "5.0", "Content": "this is a good phone.i will tell eveyone that this phone is a great phoneyes i would get anther one someday", "Date": "December 13, 2012"}, {"Title": "WARNING!!!", "Author": "MUGEN KAI", "ReviewID": "R2ZKWDKYTVWQFL", "Overall": "2.0", "Content": "Beware! beware!! beware!!! i bought this phone the battery didnt work and no sim card. so be well aware you may have to buy a new battery and you will have to buy a sim card. lucyly i had a straight talk version of the phone so i could use that battery. but if im paying for something it should work with all parts included! then after i make my buy a straight talk version pops up for sale. avoid the hassle buy a straight talk version. but beware of the used one ppl swap the original sim and send it back. and if you do your research you will see why. but at&t; need to step its game up at this rate verizon has got nothing much to worry about", "Date": "April 7, 2012"}], "ProductInfo": {"Price": "$199.99", "Features": "Social networking-focused, 3G-enabled smartphone with slide-out QWERTY keyboard and quick access to Facebook and MySpace\nCompatible with AT&T; Navigator GPS, Video Share, AT&T; Mobile Music, and streaming video from Cellular Video service\n2-megapixel camera/camcorder; Bluetooth stereo music streaming; MicroSD expansion up to 8 GB; access to email and instant messaging\nUp to 4.7 hours of talk time, up to 350 hours (14.6 days) of standby time", "Name": "New Nokia 6790 Surge GPS Unlocked Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41fPpGlFxmL._SY300_.jpg", "ProductID": "B002X3I8PQ"}}