{"Reviews": [{"Title": "5 Stars for a user who doesn't ask for much.", "Author": "Mi33Chan", "ReviewID": "RSHYDLQ001EEM", "Overall": "5.0", "Content": "I got sick of my Sony Ericsson Aino because it doesn't have a qwerty keyboard, I'm surprised it's still on the market for such high price. So I gave this HTC phone a try. It has everything I need in a phone. qwerty, wi-fi, 3G, way cheaper than BlackBerry and besides, taking pictures is sooo simple, just 1-click. it's unique, low-key phone that seems to last for a long time.", "Date": "April 13, 2011"}, {"Title": "HTC Snap!", "Author": "Chelly", "ReviewID": "R1QN1RXADLGJGE", "Overall": "5.0", "Content": "I was in dire need of a new phone! I had a Sony Ericsson Vivaz pro and the touch screen broke for no apparent reason! I needed an new phone ASAP. I did a bit of research and found this phone. I love love love the Window mobile system. The keys are nice and big, took some time getting use to but now its great. The trackball is smooth and fast. The battery life is AMAZING. Its a good phone, if you dont need any high tech apps and such. Even came in a fitting leather case!Cons: The camera could be better but eh, whatever. Wish they threw in a screen protector.Comparing with other phones around the same price, it is definitely a winner for me.", "Date": "May 3, 2011"}, {"Title": "Awesome Buy!", "Author": "Erin M. Moncur", "ReviewID": "R3F1QXK0O177ZD", "Overall": "5.0", "Content": "I usually read the product reviews before I purchase anything online, and I must say that the most of the previous reviews were absolutely right. I had no problem with Sim card compatibility (I am not residing in the U.S. - I just popped it in and bing, I had service) and the wi-fi is absolutely fabulous. Another good thing was that it arrived within two days and was properly packaged. It is brand new!As for the other features, the keys are big, the screen is an optimal size, the sound is clear, and the phone is extremely light weight. It is taking me some time to get adjusted to the features and the functions of the phone, but the manual is really easy to understand and other relevant information can be found online. For the price I paid, I must say that I got more than expected. Great buy!!!", "Date": "June 30, 2011"}, {"Title": "Decent Phone", "Author": "kamrul", "ReviewID": "R3T353PXA97MJC", "Overall": "4.0", "Content": "Bought two of these at 139.99 and damn it went down $10. This phone has everything you need from qwerty key to wi-fi. It is a Windows Phone which has a downside (reason for 4 stars instead of 5). It will lag if you have to many applications open. It works like a Windows pc. It has a cpu and RAM memory. You have to go to task-manager often and make sure that only the apps you are using are open. Too many apps will definitely slow it down or even freeze it (in response to the person who gave a one star). Other than that, the calling quality, ease of texting, Wi-Fi, MS office apps, and PDF reader are awesome and I'm enjoying this phone.", "Date": "April 23, 2011"}, {"Title": "Not an HTC s521", "Author": "Chris", "ReviewID": "RK4I8ED9XJHUI", "Overall": "4.0", "Content": "I bought this phone for use on ATT network, It is actually a HTC Maple s520 according to the model number put into the phones description under settings. I like the phone alot minus one problem, picture messaging does not work, so if anyone who is savvy with cell phones and knows how to change mmsc codes, I could use the help.Update: Got ahold of HTC and they fixed my picture message problem, so if you live in the usa and are on att plan, once you get the right mmsc codes, the phone works fine, in fact this is the best phone Ive owned, the WIFI is quicker then I thought it would be, obviously not as fast as the droids, but you will pay alot more for a droid or any other new 3g/4g phone, Im pretty confident this phone will last me awhile. Received the phone fast, absolutely no complaints on amazons part, and would make this purchase again for sure.", "Date": "June 12, 2011"}, {"Title": "Decent phone", "Author": "Eflan456", "ReviewID": "R1MKV0FF8CY947", "Overall": "4.0", "Content": "It's a decent phone, and the letters are much larger than that of a blackberry's. It's overall easy to use, has good battery life, however, the wifi internet is a pain to use. Text message retrieval can be a pain as well, because sometimes if you go back in a conversation by clicking \"older\", it'll stay stuck there and you have to keep going forward to the beginning of the message to see what's being said. It's easily remedied by deleting the convo and starting a new one with that person.The alarm clock is good. If you turn your phone on silent so no one will call you, the alarm clock will still work. Or if the phone is on vibrate. So no fear about accidentally setting the phone on silent and not waking for work.The camera isn't bad for the pixels, but don't expect HD quality. It's simply not the phone for it. The scroll button in the middle works well, and I haven't had a problem with it. I also have never had problems receiving texts or calls. Call clarity is WONDERFUL.Also, since it's a Windows OS, it's easy to sync up to your PC to put your own ringtones on, take pictures off of the phone, put music on it, etc. If you don't have a lot of money to spend, I would definitely get this phone. The unlocked international feature, with a warranty, is definitely worth it!", "Date": "May 23, 2011"}, {"Title": "It's okay...", "Author": "Cassius", "ReviewID": "RSJTW77GXQPIZ", "Overall": "4.0", "Content": "I bought this phone a couple months ago when mine dropped in the toilet. It arrived on time, and I was generally impressed with it. I like the fact that you are able to see both the sender and the receiver when viewing messages, unlike the Dash, where you have to flip back and forth between Inbox and Sentbox to read a text conversation. The scroll ball works nicely for the most part, but sometimes it freezes in one place and I have to scroll around for a few seconds to get it to work again. There are also plenty of Profiles available to customize the phone with, too.But! When I got the phone \"HTC\" was printed on the bottom of the back cover like it is shown in the picture. After a month of use it started to look a little distorted, so I rubbed it with my thumb a few times. Low and behold, the \"HTC\" was rubbed off and it now read \"WIND.\" I don't know what a \"WIND\" is, but I'm pretty sure it's not an HTC. I didn't really care that much because it's a phone, it works and I'm not a label junky. If you're looking specifically for an HTC, you probably shouldn't get this phone.There's one other thing I don't like about this phone. When I miss a call or if I get a voicemail, I get these weird text messages in my inbox. They look like codes for a layout or something, I don't know. I just delete them. Overall I am happy with my phone, and I'm glad nothing worse is wrong with it. I was sick of my android anyway!", "Date": "June 28, 2011"}, {"Title": "it's not the same as decribed", "Author": "WENG CHANGDONG", "ReviewID": "R3K6KIG3U27DL1", "Overall": "4.0", "Content": "the cellphone is good,but it's DASH 3G snap 522,not the HTC Snap 520.phone is good,I like it!but I will change the OS to Chinese OS~~", "Date": "August 20, 2011"}, {"Title": "What the....", "Author": "Grace G", "ReviewID": "RF7OV5G7LMC9H", "Overall": "1.0", "Content": "I was really excited when I got this phone today. Swapped my sim, imported contacts, the whole nine yards. Problem was when I tried to set my voice mail, the system said my phone number was incorrect. Uhh, pretty sure my number is correct. So to double check I called my number to see if the phone would ring and it did! Didn't know what the problem was-- maybe because it is an international phone from New Zealand?!Anyways, I also read on a previous review that the wifi speed/operating system is a bit slow.. and it is slowwww and it does freeze. Also the track ball is very touchy. In the end, I just returned it. Didn't want to waste anymore time.Cons: Voicemail is impossible to set up, wifi/internet browsing freezes.Pros: big screen, light weight, includes disc to sync with computer.", "Date": "April 25, 2012"}, {"Title": "Nice & Easy to u", "Author": "Scott Sutton", "ReviewID": "REI1JHX74B03L", "Overall": "5.0", "Content": "I received this phone last night popped in the battery and fired it up. I live in Japan and have Softbank as my current provider. The SIM chip fired right up and I was up and running in minutes. The service is 3G so the phone liked it. This phone works for T-Mobile which is the provider I use when I am stateside. I am very happy with this purchase. The box came all tapped up ( I guess to keep everything inside) and when I opened it there was everything that was originally with the phone like manual, software, charger with al adaptors and even a set of ear phones to listen to music with. Nice.", "Date": "February 24, 2012"}, {"Title": "Great unlocked phone", "Author": "k", "ReviewID": "R20KM6DEQKLOG7", "Overall": "4.0", "Content": "I am very satisfied with this phone. I was looking for an unlocked phone that had wi-fi and this phone is perfect for that. I have T-mobile and I didn't want to pay $10-15/month for a data plan that I would only use occasionally. I had the T-mobile Dash before and so I was very familiar with windows phones. As with blackberry phones, I would not suggest that you purchase this phone if you have a hard time figuring out new devices.", "Date": "October 2, 2011"}, {"Title": "Good Phone", "Author": "Anderson77", "ReviewID": "R1I4TO5SL6OAUW", "Overall": "4.0", "Content": "I bought this phone as a replacement to the att/samsung impression. Big upgrade! I got the phone in one day which was cool. The phone was actually the htc snap s-522 not the 520. I put my sim card in and it makes calls and sends text. Picture text are not working, and also for some reason the phone will not sync to att network for data; pics, & Internet which is a big problem. I own a small insurance business and internet is the key to staying in business. I called att and they were useless. I called htc and they have not been able to resolve my problem yet. Very frustrating. Att says call htc and htc has said to call att. Already wasted 3 hours trying to get this issue resolved. Leaving town for 2 weeks in less than 30 hours and no way to access email or process documents as needed. Basically be prepared to spend some time to try' and get one of these working with your phone service provider.", "Date": "August 19, 2011"}, {"Title": "Nice Cellphone", "Author": "Amazon Customer", "ReviewID": "R1O8SFZQP0CZQE", "Overall": "4.0", "Content": "Great cellphone, nice look, came with WM isn't my fovorite but work fine, only a bad thing, in my country (Ecuador) don't work with 3G only connect with EDGE (2G) service, but this work fine with 2G and Wifi is ok.", "Date": "August 17, 2011"}, {"Title": "good to have it", "Author": "julieinus", "ReviewID": "R1FBMJRMVK8UV7", "Overall": "4.0", "Content": "I was so excited when i got this HTC SNAP. It's so cute and neat. And the keyboard is so comfy to type. The only problem is I can hear annoying \"beep\" when I press the \"answer/call\" button every once a while. Anyone know how do I resolve the problem?", "Date": "March 29, 2011"}, {"Title": "Something that actually lives up to the product description", "Author": "Talita K", "ReviewID": "R2CA4W42Z5XZCI", "Overall": "5.0", "Content": "I wont bore anyone by repeating the product description whichdescribes this phone perfectly. It does all its supposed to,looks great and easy to carry and use.With great resolution and GPS.Its been accidentally dropped and doesn't have a scratch on it.Better than I expected for the price.", "Date": "March 20, 2011"}, {"Title": "I'm in love with this phone", "Author": "Gustavo", "ReviewID": "R2ADIVCF6S7IRJ", "Overall": "5.0", "Content": "Cheap, slim, qwerty keyboard, fast and Windows Mobile? Perfect combo for me.The keys are a bit cramped, that would be the only con for me", "Date": "July 14, 2010"}, {"Title": "Good Smartphone", "Author": "Gaboazul \"Gabo\"", "ReviewID": "R38K2BZJP0IPWQ", "Overall": "5.0", "Content": "I am happy with my new Snap S521. It has all I need in a Phone. Excelent reception, Qwerty Keyboard, innovation with its original joystick, slim, nice and ligth design, acceptable camera, inner circle for mail and chat......You don't need enymore.", "Date": "March 27, 2010"}, {"Title": "Smartphone", "Author": "Jv rivas", "ReviewID": "RX42APRMCWPYV", "Overall": "5.0", "Content": "At the time it was very new and also very technologically advance. Have problem with letters and numbers but just because my fingers are too big", "Date": "January 3, 2014"}, {"Title": "THE BEST MOBILE PHONE I HAVE EVER BOUGHT!!!", "Author": "Rufino", "ReviewID": "R36I5YG0YYUSWI", "Overall": "5.0", "Content": "I really like this mobile phone. I recently used during my stay in Congo and it worked great. I could serve on internet everyday and anytime. Besides, the battery is amazing. I could use my mobile phone for 3 or 4 days without recharging the battery. I am not obliged to walk with a phone charger every time. I would highly recommend this phone to anybody who is in search of a smart and reliable phone. I am planning to purchase another phone of the same model.", "Date": "August 3, 2013"}, {"Title": "Don't buy it ever!", "Author": "Urszula Wudarczyk", "ReviewID": "RYM95V0HXSJW2", "Overall": "1.0", "Content": "Worst experience with a phone ever! HTC is crap, especially this one. Also, it's Canadian. If you have any issues, good luck on getting it repaired. You need a Canadian address and lots of patience getting anyone to com talk to you straight.", "Date": "July 11, 2013"}, {"Title": "Good phone & excellent service from seller", "Author": "RNB", "ReviewID": "R279E0C8TQG5ZK", "Overall": "4.0", "Content": "The phone was fine and in great shape. I bought it for my father because his cell phone was broken. This phone would've been perfect, but we didn't look to see if my Dads SIM card fit this phone. It didn't fit, so we had to send it back. The seller was very nice because after I explained the situation they sent me a return label to return the phone! It was very nice, just didn't fit the SIM card.", "Date": "February 11, 2013"}, {"Title": "Good", "Author": "Jose Danies", "ReviewID": "RTZ5MXXZJ0UM0", "Overall": "5.0", "Content": "Muy buen producto y entrega a tiempo , lo recomiendo , calidad y servicio , very good, excelente . .", "Date": "February 6, 2013"}, {"Title": "great product", "Author": "geraldine", "ReviewID": "R3O19THUI85EWV", "Overall": "5.0", "Content": "my sister loves this phone, now wants more to make as gifts  i would recommend if you dont  have to multitask with phones like android this is a great phone", "Date": "February 5, 2013"}, {"Title": "OK", "Author": "David Heli Parrado Clavijo", "ReviewID": "R2FF3OBBRCEOHF", "Overall": "5.0", "Content": "EL PRODUCTO LLEGO OK, TAL Y COMO LO OFRECIERON ESTOY TOTALMENTE SATISFECHO CON EL MISMO.RECOMIENDO AL VENDEDOR ES BASTANTE RESPONSABLE", "Date": "January 4, 2013"}, {"Title": "Do not buy when said Refurbish.", "Author": "Nery Dasilva", "ReviewID": "R1XF7C0TBPTGQY", "Overall": "1.0", "Content": "love the phone,simple,easy,but this one come as refurbish,the truth is not,just dont work,work for sometimes and come the message Sim card is missed,please dont buy when is refurbish ( my is not working )", "Date": "December 23, 2012"}, {"Title": "Ok", "Author": "Dallice", "ReviewID": "R28ZQGUUG2I4BF", "Overall": "3.0", "Content": "I got the phone in a timely manor. It worked just fine, it was just a bit too old. Other than that I had no complaints", "Date": "November 26, 2012"}, {"Title": "I love the HTC phone BUT...", "Author": "Lagertha", "ReviewID": "R1781RY7ARYXHG", "Overall": "2.0", "Content": "I really like this phone and this is the second HTC phone I have owned. I do not like the touch screens so I purchased this phone because it was an unlocked GSM phone that would run on the AT&T; system.I have previously owned the HTC Dash 3G and LOVED it!However - after receiving this phone -I discovered that it would not work on the AT&T; system.I switched out the SIM cards, did exhaustive searches online to find a way to get it to work -no go.VERY frustrating. So I have a phone that SHOULD do everything - go online, get email etc and instead it does nothing. I can't even get pictures. All I can do is call -and text. Not good.I would like to add I am in LA not some backwater town.So sadly this phone will be going back.", "Date": "November 8, 2012"}, {"Title": "Nice features but unreliable junk, the OS crashes 1x a day", "Author": "MKAFILM", "ReviewID": "RJVQC6RB0LQ7G", "Overall": "2.0", "Content": "From a design standpoint it seems like a good phone but it crashes and locks up at least 1x a day forcing you to remove the battery to restart. When speaking to a phone dealer they told me they had the same issue with many clients. I would return it but we tossed the packaging.not worth it", "Date": "August 30, 2012"}, {"Title": "Useless phone", "Author": "Zerocool78", "ReviewID": "R1J2PDEBKPX1WX", "Overall": "1.0", "Content": "This phone arrived promptly 6 hours ago. I opened it up and tried to charge it. Guess what? It doesnt come with a plug compatible with a US socket. Had to charge it via USB. Turned it on and it just froze. The trackball is extremely uncomfortable to use. Rebooted it and it froze again after 7 minutes. Tried turning on the WiFi and it froze again.In a total of 30 minutes that I used it it froze 3 times. Packed it back up and dropped it off at UPS for a return 3 hours ago.", "Date": "May 24, 2012"}, {"Title": "Good deal", "Author": "Tauhid", "ReviewID": "REZOYRUZNYBIP", "Overall": "4.0", "Content": "I had wish to buy an htc set and i wanted to start with a htc set with low budget.It is good one with $89.99. You can have it without thinking thinking twice.", "Date": "May 12, 2012"}, {"Title": "Nice phone", "Author": "watbew22", "ReviewID": "RSANPZ1S2GCKE", "Overall": "4.0", "Content": "I like the phone a lot.  I don't use all the features but it is nice.  The only issue i have is that it doesn't seem to get the best reception.", "Date": "April 18, 2011"}, {"Title": "great phone", "Author": "M. Boyle", "ReviewID": "R22MLOCD2690DK", "Overall": "5.0", "Content": "my wife loved this phone. even after replacing it with windows phone 7 on a samsung focus it took her a while to stop saying she prefered the SNAP. once you got used to the interface and keyboard it was great but of course, now with the windows phone 7 around this thing sits in the corner collecting dust now.", "Date": "January 23, 2011"}, {"Title": "Many operating system problems.", "Author": "Andres Vidal", "ReviewID": "R1KS9NQVFH4M2L", "Overall": "2.0", "Content": "It has many problems with the operating system fails and freezes sometimes.The volume key, sometimes lower the level of the ringing tone, so I miss calls.Good case, comfortable.I feel disappointed when the operation.Physically, it is a good phone.", "Date": "January 5, 2012"}, {"Title": "Muy Bueno", "Author": "LuiChe", "ReviewID": "RZ2GU0HEVASTE", "Overall": "4.0", "Content": "Muy buen equipo, hasta el momento sin ningún tipo de inconvenientes, sin embargo para algunas cosas es un poco estresante, pero en lineas generales muy bueno.", "Date": "July 15, 2011"}, {"Title": "Exelente", "Author": "Marcelo", "ReviewID": "R3U73XM2328ZMQ", "Overall": "4.0", "Content": "Muy buen telefono, liviano y muy amigable, facil de usar lo malo, la camara deberia ser mejor y en sud america no he podido hacerlo funcionar en 3G", "Date": "June 1, 2011"}, {"Title": "ROM would not flash, tech support could not help...phone was bricked", "Author": "M. Lucas \"mlucasone\"", "ReviewID": "R398GTQDW4G7HH", "Overall": "1.0", "Content": "The good thing is that the phone is pretty. The bad is that within a week I tried to flash the ROM to the most current version only to receive an error at 29% of the process. Each time I went through the recovery steps I arrived at 29% complete. This phone lasted less than a week and is now a paperweight. Windows Mobile is the most worthless phone operating system, and HTC tech support tried to help but was unable to help me correct this issue leaving me with a worthless brick. From now on I will not purchase any other phone that includes the windows mobile hoax, and due to this bad experience I will stay away from HTC as well.", "Date": "September 9, 2011"}, {"Title": "This is peice of JUNK", "Author": "Papani Italiano", "ReviewID": "R2Q2DL7EBPMX5", "Overall": "1.0", "Content": "This phone is a piece of junk, bought to use this phone overseas and became a nightmare. This phone freezes so often that you cannot rely when it works and when it doesn't. fed up with complaints all the time that the callers couldn't reach me even when I was in high signal area, got so frustrated and bought a Blackberry for lot higher price than I can get in US. PLEASE DONOT BUY THIS PHONE", "Date": "April 11, 2011"}, {"Title": "Track Ball Issues", "Author": "Pablo Pérez", "ReviewID": "R2RPZZGSCLHKZ2", "Overall": "3.0", "Content": "Nobody mentioned the track ball is a headache! When track ball get dirty you start to hate the cellphone and you can do nothing.", "Date": "October 20, 2011"}, {"Title": "Which you where Touch!!!!", "Author": "Jonathan", "ReviewID": "RDDUQYQ5VGW02", "Overall": "3.0", "Content": "Im very glad whit my new phone, nice screen size,batery life,colors, make a greatpair whit the rubber case and got reception. But from being only 2 years old it havegreat disadvantages. I can't found a Timer app for the phone because all I foundwhere only for touchscreen, and it don't comes whit a Radio FM/AM app.Overall ist a superior quality brand product and my next phone will be a HTC.Maybe all the problems are from the OS.", "Date": "September 15, 2011"}, {"Title": "like alot.....", "Author": "Mrs Rolton", "ReviewID": "R3RIS7QZZDHBVA", "Overall": "3.0", "Content": "like this cell phone alot. It is unlocked and have all the features I need. Only reason why I did not give it 5 stars is because it's not a slide cell......", "Date": "December 16, 2011"}, {"Title": "its garbaze nothing else.....", "Author": "abu raihan m rahman", "ReviewID": "R3072ZW6XHCMBU", "Overall": "1.0", "Content": "it gets hang.....sometime does not work anything....wifi is not available all the time... its like i threw my money in the river....", "Date": "December 28, 2011"}], "ProductInfo": {"Price": "$459.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nQuad-Band Unlocked GSM cell phone compatible with 850 / 900 / 1800 / 1900 and 3G 900 / 2100 frequencies plus GPRS / EDGE capabilities\nPowered by Windows Mobile 6.1 Standard operating system\nFull QWERTY keyboard, Wi-Fi networking (802.11b/g), 2.0 megapixel digital camera, A2DP, Bluetooth, MicroSD memory expansion, Bluetooth stereo music\nUp to 6 hours of talk time, up to 380 hours of standby time\nFull QWERTY keyboard, Wi-Fi networking, 2.0 megapixel digital camera, A2DP, Bluetooth,\nIt will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nMicroSD memory expansion, Bluetooth stereo music\nPowered by Windows Mobile 6.1 Standard operating system, MicroSD memory expansion, Bluetooth stereo music\nQuad-Band Unlocked GSM cell phone compatible with 850/900/1800/1900 and 3G 900/2100 frequencies plus GPRS/EDGE capabilities\nThis unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported.", "Name": "HTC Snap S520 with Windows Mobile, 2 MP Camera, QWERTY Keyboard, Wi-Fi, and MicroSD Slot-Unlocked Phone-US Warranty-Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41KDPADBIRL._SY300_.jpg", "ProductID": "B002F9CCFK"}}