{"Reviews": [{"Title": "i465 clutch", "Author": "Kevin Beckwith", "ReviewID": "RCH2IMZ44LM0D", "Overall": "4.0", "Content": "Before you read this keep in mind i've never spent more than $30 for a phone before.I've had previous experience with both ATT go-phones and Virgin Mobile.  I bought this phone to finally replace my home phone line since the Boost service offers unlimited everything for $50.oo a month, which is a pretty awesome price for a pre-paid phone.The service:  L-o-v-e it!  I mean, the talking & texting is just like any other phone, nothing special, but I like not having to keep track of minutes or texts or kilobytes in my head when i'm trying to talk to someone or do something on my phone.  I stick to main roads and downtown areas mostly so I don't have many problems with dead zones, though as i watch the bars traveling around i can see how some people might.The phone:  Little disappointed for my first phone that i paid enough for so that i be concerned if the screen got scratched or it fell in the toilet.  Other than the camera, which is webcam quality at best, it seems to look, feel, and act like any other cheezy phone i've ever had.  The only difference is that its got a keyboard (which is a given positive for texters).  Oddly enough though (and it kind of annoys me), you know how most phones have an alarm clock and a calander built into the phone's software?  Well, with this phone, its a pre-installed java app.  On the up-side though, the speakerphone is rediculously loud, clear, and easy to acivate, to the point where i find myself using it for most of my calls.Side notes:  One main thing i bought this phone for was to replace my dial-up internet (netzero) because i had to shut off the phone line and the internet service in order to pay the $50 bucks a month for the boost service.  Well, this review is proof that its possible (and rather simple) to do that because i'm using the phone's internet from my computer right now to write this.  Just buy the cable off amazon.com for a buck (of course theres an eight dollar shipping charge), download MotoConnect from [...](freeware), and when the cable arrives you might have to reshape the plastic part around the connecter with a pocket knife so it will stop popping out of the phone, but it works.  Don't know what the exact speed is, but it loads webpages at a similar speed compared to 56k dialup and downloads files at about 2.5KBps.  The computer will recognize the phone as an \"iDen\" modem and you set up a new dialup connection with the phone number \"S=#777\".  The username and password don't matter and BAM! your online, no extra ISP (like aol or netzero) necessary.  Whats really cool is it connects in like 8 seconds.  This feature is also supposed to be possible without the cable if you have a bluetooth-enabled laptop or one of the little USB bluetooth adapters available at amazon for like 5 bucks with shipping.  I know one thing that your all probably going to be interested in is the GPS service from boost.  Well, sadly, it doesn't come with the $50 a month unlimited plan.  its another java app, that cost $2 a day or $10 a month to subscribe to.  However, the phone has a built-in software that will tell you your geo-graphic quadinates, just no map.All-in-all, i'd recommend the service, but the only thing that is going to make the phone worth its price is the keyboard & bluetooth compatability.  Whether or not its worth the extra 80 bucks is up to you.", "Date": "October 2, 2009"}, {"Title": "Phone definitely NOT for Internet", "Author": "Melissa Johnson", "ReviewID": "R3965WQFLT10H7", "Overall": "4.0", "Content": "I actually go the phone through Boostmobile, not Amazon.  It takes forever to load websites.  Thankfully, I didn't get it for going online.The other features are great, though.  I love the keypad, and the camera on it takes very good pictures.Note on the packaging though,if you buy it brand new as I did... BEWARE, you practically need a chainsaw to cut open the plastic that the phone is packaged in, as it is very thick.  Much more so than the plastic that most things are packaged in.  Regular scissors won't work, I had to saw and pry it out with a huge, serrated steak knife.", "Date": "August 16, 2010"}, {"Title": "Not the greatest phone but I would recommend it", "Author": "Jimmy Morelli", "ReviewID": "R10ZIFRSUE0D7A", "Overall": "3.0", "Content": "Boost Mobile stinks compared to other services that is a fact.  The Clutch phone is not Motorola's best work.  Yet it is all to lower cell costs to the consumer.  For what you save it is well worth it.  Other companies charge way to much for their services, thus they can offer the fancy phones, yet you need to sign your rights away for 2 to 3 years.  I hope Boost will catch on so the other companies will have to drop their prices and contracts in fear of losing customers.  I would love to go back to AT&T;, they were the best, but $50.00 with them didn't get me much.  Unlike other services, cell phone costs should be getting cheaper as their networks are paid for.  All cell phones in my book should have a fee like Boost or like any land line phone company like Verizon.The Clutch offers web service, it works and you can get on-line and check mail, its not a G1 or 3 network but its online unlimited for 1 cost of $50.00 a month.  Texting is the same as rest, the keyboard feature is nice on this phone.  The only thing with the service is you get in dead zones, but its weird once your connected I have never had a dropped call with it, even going through a dead zone.  The phone is a little difficult to navigate and the manual doesn't really help, with time and use you learn all the features.  There are a lot of small features the phone does not have that you just expect it to.For the money you save it is well worth it.  No its not a great phone but it works and its cheap and you can cancel whenever you want, or pay as little a 10 a month.  I have one and I get by fine.  Use it for 6 months and it pays for itself.", "Date": "August 11, 2009"}, {"Title": "Motorola i465 For Nextel", "Author": "Steve Taylor", "ReviewID": "R1TK98B9R7R7W4", "Overall": "4.0", "Content": "Because of my homes location and for no other reason, I am a Nextel subscriber. One of their biggest problems is their outdated phones. Finally Nextel has started to improve on this with phones like the Motorola i1. I've been using the Motorola i880 for the last four years and considered it to be one of their best phone. Unfortunately I ran over it with my truck (don't ask, I'm just glad it wasn't clipped to my side at the time) and even though it miraculously still worked the screen was crushed. I decided to replace it with the i465 because of the price and QWERTY keyboard. The screen is smaller but looks like there's room to make it larger. Why they didn't I don't understand. The backlit keyboard has diamond-raised keys that are very easy to use unless you're one of larger size. On the side of the screen are direct buttons for messaging, net and camera. A nice touch but I'd rather have a larger screen. The camera tolerable  but you won't be saving any pictures to your computer screensaver. The menu and top button arrangements are the typical Motorola design. (The center round button is not a trackball like the black berry) Same as my last two Motorola phones and my wife's i856. Nothing great but functional. If you're looking for a phone for texting this is a good one but if you want a phone for Internet you'll need to look somewhere else. Many of the Nextel released pictures make it look like the size of a Black Berry. Don't be fooled, it's much narrower and the screen is half the size if not less. The speaker is very loud and the over-all sound quality of the phone is very good. The vibration setting is very weak... in fact I can barely feel it. Bluetooth attaches easily. No belt-clip comes with the Nextel version of the phone. I have the black version which looks sharp especially with the silver/green accents. The number buttons have silver on them to differentiate between the letter keys. The keys light up but are not real bright. Good for total darkness but not twighlight. One thing I really miss is the voice function. When recieving a call the i880 the phone would speak to you and tell you who it was so you didn't have to touch the phone to find out. I can find an app for it either.  Over-all if you need a phone to talk and text you'll be pleased. Nothing fancy. Solid feel and lighter then it looks. No hinge to cause problems. Built to military specs for shock-resistance. I'm pleased with it and hope it gives me years of good use. If you have any questions please feel free to add them in the comment section and I'll get back with you asap.Pros:Nice streamline stylingSolid constructionShockproofFunctional QWERTY keypadSpeed Dialing3 Direct Access KeysGood receptionNo antennaLightweightLoud SpeakerShoots VideoVoice activated dialingDoes not require 3G upgraded serviceNice rubber feel to some outer partsTransferable SIM cardEasliy connects to BluetoothFunctional alarm clockCalculator with converterCons:Very small screen (even by flip-phone standards)No back button in menusScreen could be sharperNet use is near worthlessCamera is bottom endNo voice for incoming callsLow battery life (small battery size)Should be free with 2 year contractVery weak vibratuion setting", "Date": "October 16, 2010"}, {"Title": "Motorola's poor customer service", "Author": "Rosebuds101", "ReviewID": "R1NEVD2NQUX7KS", "Overall": "1.0", "Content": "I have been buying motorola phones since the first time I started my cell service; 6 razrs and an i465 Clutch later I have decided I will NEVER buy another motorola product again.The razrs, while fabulous at taking great pictures all experienced major malfunctions - primarily, they all had screens that either went blank or they stopped working altogether. The i465 did not work properly from nearly the beginning of my purchase.I was back in the store where I bought the phone and activated it with Boost mobile service within 36 hours of the purchase. The store said it was Boost; Boost claimed it was motorola; motorola claimed it was Boost; it became a hot mess very quickly. Back to the store; back to motorola support; back to the store.Finally, I sent the phone back into motorola for repair. I have now spent literally a few hours total on the phone with motorola trying to get this issue resolved.This morning I received a box with the back and the battery (supposedly mine) via the FedEx guy. Oh yeah, AND the personal cancelled check of a gentleman in Louisiana with ALL his personal information, bank information AND phone number emblazoned across it. When I say PERSONAL CHECK I mean, PERSONAL CHECK.I spoke with 3 different people this morning at motorola. The first could barely speak English and said it was MY FAULT I received the wrong items; he claimed I should not have opened the box because it wasn't meant for me... HOWEVER, this box is CLEARLY addressed to me, with my name, address AND phone number right on it. You tell me, if this information was YOURS on the front of a box, wouldn't you open it?And by the way, I was not told to ONLY send back just the front of the phone. I was told to send back the PHONE.When I tried to explain to the person on the other end of the phone it could not be my 'fault' because I wasn't the one who sent me the phone parts and this check, he said my phone was 'still in the process of being repaired' and that I would need to give them 5 to 7 business days to fix the phone.It is December 31, 2010. My confirmation email from them regarding the phone (the first time) is 12/20/10. The man on the other end of the line even told me 12/20/10. That means eleven (11) days have gone by already.I called the store back where I purchased the phone to begin with. They promised to call me back within 20 minutes. They did not, so I called them back again. By this time my anger is steadily rising and although I'm quite upset, I did not raise my voice to anyone I spoke to today.I reiterate the issues with the phone and the overall crappy service I have received not only from motorola, but also Boost and the store where I originally bought the phone. No one wants to be accountable for the issues associated with this whole transaction.I called motorola back again. The second time I got another man who speaks English clearly enough but again insists they are working on my phone. I ask to speak to a manager. I was put on hold for nearly ten minutes, but hold I did.'Andrew' came on the line and wanted to know what my problem was. For the 15th time today I told him in a calm voice. Andrew cuts me off several times. I ask him to 'please allow me to finish.' He sounds irritated that I have interrupted this very important day with my menial issues over not having a good working product from motorola and insists I shouldn''t have sent the back and battery back, just the front. I say, \"No one said JUST SEND THE FRONT. I was told to send the PHONE. When I use my PHONE to make a call, I use it with the BACK AND BATTERY intact.\"He says the back and battery I received are mine and becomes rude with me. I say, \"Look. You people run a slipshod company if you cannot send the correct items back to the correct people. I have this other person's PRIVATE CANCELLED CHECK right here in my hands. I was told I did not know what I was talking about by 2 other people at motorola and I'm telling YOU I have this stuff here, in front of me. I'm looking at it RIGHT NOW.\"He says, \"So, ok, we made a mistake and sent something we shouldn't have, however, your phone is still being worked on and we will send it back in 5 to 7 days. Is there anything else?\"I say, \"YES. Make a note that I intend to tell every one I talk to about my experience and service from motorola and Boost.\"You can mark me as a VERY UNSATISFIED CUSTOMER who will NEVER purchase another phone from motorola.", "Date": "December 31, 2010"}, {"Title": "Solid Messaging Phone for Nextel/Boost", "Author": "William", "ReviewID": "R23CT5L3Q8J849", "Overall": "4.0", "Content": "The Motorola i465 (Clutch) is a good option for Nextel/Boost subscribers who need a reliable device with a full keyboard.  It is not a multimedia powerhouse, and should not be mistaken for a smartphone--you won't find push e-mail or a full web browser on the i465.  But the i465 delivers great voice and push to talk calls, and the keyboard makes messaging a breeze.Physical aspects: The i465 is roughly the size of the Blackberry Pearl, and slightly taller in height and narrower in width than the Blackberry Curve series.  The black version which I purchased has a very unassuming appearance (the same cannot be said for the red version, which looks downright gaudy). The phone was lighter than I expected, and feels tough enough to withstand a few falls from a short distance.  It is certified to military specifications to withstand shock, vibration, heat/humidity, etc., but doesn't feel as rugged as an i580, i335, or i576.  The phone's navigation array looks a little cramped at first glance, but is actually quite practical.  The full keyboard is a little small, but even with my bigger hands, I had no trouble typing on it.  Each individual key is angled, which provides a very tactile feel and adequate spacing to type.  The volume rocker and PTT button are easy to find without looking.  The screen is an adequate size (especially for longtime Nextel users), and although some of the fonts are slightly pixelated, it does the job.  My only complaint about the phone's physical design are the dedicated buttons on the right side of the screen-- they are awkwardly placed and little more than a nuisance, and are easily pressed unintentionally.  Overall, Motorola did a good job with the design...with the black version that is.Software/User Experience: The i465 has Nextel's classic \"multipage\" menu setup, where you have to press \"More\" several times to access all of the phone's functions.  Nextel loyalists are undoubtedly familiar with the layout, which is simple and easy to use.  Those of you coming from other phones will probably find the layout to be counter-intuitive, but it is easy to get used to.  My one big gripe is the lack of menu customization that Motorola allows with its iDEN series, but you can at least arrange the menu items in order so you don't have to page through the entire menu just to get to your contacts list.  You can also set four shortcuts on the control toggle, and the soft keys double as a contact list and quick messaging key from the home screen.  In terms of features, the phone is nearly bare bones.  There's GPS, Bluetooth, a camera, and a voice recorder, but not much else.  If you need additional applications, [...] has a decent selection of them, such as a Bolt web browser and a Gmail app, but this is not a full fledged feature phone by any means.  If it is too sparse for your tastes, the Blackberry 8350i is a better option for you.Core Functions: Call quality is very good over voice and PTT, roughly 8 on a 10 point scale. Reception is good but not great; it is not as strong a signal puller as the i335/580/576, but it holds 3-4 bars in high coverage areas.  One thing I noticed is that the i465 does a better job of holding a signal than other Nextel phones I have tried, the signal does not fluctuate as much in comparison to other iDEN models.  The antenna is located at the bottom right of the phone, and as with any other phone, you will lose bars when you \"choke\" the phone by covering the antenna during a call.  I had no trouble sending and receiving messages with the i465 in the Shreveport, La. area.  Nextel/iDEN works better in some areas than others, so check around before purchasing the phone.  Web browsing speeds were good for iDEN over the Bolt browser; it is comparable to AT&T; and T-Mobile's EDGE networks.  The factory web browser was all but useless.  Battery life is average, heavy users will get a full day of usage from the i465.  I have experience no menu lag, and the phone has frozen only once since I purchased it, no more or less than any average phone.Conclusion: In short, the Motorola i465 is a basic Nextel/Boost phone with a full keyboard.  If all you need to do is make calls and send messages, this is a good buy.  If you need more multimedia/internet horsepower, or need a tougher device, I would suggest looking elsewhere.", "Date": "August 30, 2010"}, {"Title": "not a good phone", "Author": "robert silvia \"cell phone nut\"", "ReviewID": "RABJN2BDBV0W9", "Overall": "1.0", "Content": "i have had this phone for 2 weeks and it is terrible. battery life is short, no service alot of the time, keypad is small, i think i will go with att go phone a177 samsung phone signal is strong where boost is not and the phone is quadband not dual band", "Date": "July 29, 2009"}, {"Title": "very unhappy", "Author": "Jillianc19", "ReviewID": "RF5TQ5MA8CPDP", "Overall": "1.0", "Content": "I ordered a phone then it took two and a half weeks to get to me opened the package there was no phone told the seller and I got a different colored phone sent to me that didn't work didn't turn on  (put a fully charged battery in the phone). I paid 45.47 in full and I got 28.89 for me money back plus I had to pay 6.10 to ship it back. Being ignored by seller about the left over money still owed.", "Date": "July 19, 2012"}, {"Title": "NOT worth buying these days", "Author": "Jesus Rodriguez", "ReviewID": "R3HG8ZV9Q8VQK3", "Overall": "2.0", "Content": "WELL WHEN I FIRST STARTED WITH BOOST MOBILE THIS WAS MY FIRST PHONE AND IT DID ITS JOB I USED IT FOR TEXTING AND I LOVED THE WALKIE TALKIE BUT GOING ONLINE AND ALL THAT SOCIALIZING IS NONE EXISTENT. WITH THE NEW ANDROID AND BLACK BERRY CURVE phones this would be just a waste of money.THIS PHONE IS TRASH I WOULDNT RECOMMEND THIS PHONE TO ANYONE NOW UNLESS ITS FOR LIKE 5-10 YEAR OLD FOR LIKE MESSAGING AND PHONE CALLS BUT OTHER THAN THAT ITS A NO NO. AND YES I HAVE AN ANDROID PHONE WITH BOOST AND IM HAPPY. ONLY GOOD THiNG IS THE FEEL OF THIS PHONE THE LIL KEYBOARD IS KINDA NICE TILL ITS ALL SCRATCHED UP AND MINE WAS THE BLACK GRAPHITE ONE. RIP MY OLD CLUTCH AND OH YEAH AFTER TWO YEARS MY PHONE JUST STOPPED WORKING SO NOT WORTH THE MONEY ANOTHER GOOD PHONE IS THE SANYO INCOGNITO MY MOM HAS THAT ITS WAY BETTER!", "Date": "April 8, 2012"}, {"Title": "dont buy it unless its for a 5 year old", "Author": "Jesus Rodriguez", "ReviewID": "R38S05D59768TX", "Overall": "2.0", "Content": "WELL WHEN I FIRST STARTED WITH BOOST MOBILE THIS WAS MY FIRST PHONE AND IT DID ITS JOB I USED IT FOR TEXTING AND I LOVED THE WALKIE TALKIE BUT GOING ONLINE AND ALL THAT SOCIALIZING IS NONE EXISTENT. WITH THE NEW ANDROID AND BLACK BERRY CURVE phones this would be just a waste of money.THIS PHONE IS TRASH I WOULDNT RECOMMEND THIS PHONE TO ANYONE NOW UNLESS ITS FOR LIKE 5-10 YEAR OLD FOR LIKE MESSAGING AND PHONE CALLS BUT OTHER THAN THAT ITS A NO NO. AND YES I HAVE AN ANDROID PHONE WITH BOOST AND IM HAPPY. ONLY GOOD THiNG IS THE FEEL OF THIS PHONE THE LIL KEYBOARD IS KINDA NICE TILL ITS ALL SCRATCHED UP AND MINE WAS THE BLACK GRAPHITE ONE. RIP MY OLD CLUTCH AND OH YEAH AFTER TWO YEARS MY PHONE JUST STOPPED WORKING SO NOT WORTH THE MONEY ANOTHER GOOD PHONE IS THE SANYO INCOGNITO MY MOM HAS THAT ITS WAY BETTER!", "Date": "April 8, 2012"}, {"Title": "Great Device", "Author": "scooterdoodles", "ReviewID": "R1C462QQEZK7WX", "Overall": "5.0", "Content": "I purchased 2 and love them.  They text smooth, have great talk time and sound good. New ones come factory sealed with all the information you need.", "Date": "March 13, 2012"}, {"Title": "Worst phone ever", "Author": "Spiderbeth", "ReviewID": "R14V1NTBE93O1D", "Overall": "1.0", "Content": "I've had boostmobile for about 4 years and this was by far the worst phone I had. The service on it was awful there were so many glitches and everything about it was just terrible.", "Date": "March 10, 2012"}, {"Title": "clutch", "Author": "jim", "ReviewID": "R1ANUTY89WZRIE", "Overall": "4.0", "Content": "Battery lasts a while. Gets decent signal. It has the walkie-talkie feature wich is needed for work. Its one of the better phones I could find with the walkie-talkie. Suits my needs just fine.", "Date": "January 14, 2012"}, {"Title": "UMM...", "Author": "Kiyana", "ReviewID": "R24Y0Z66Y2O102", "Overall": "3.0", "Content": "I\"ve had this phone for 2 years and it did its time!, its good for kids in middle school like (6-8th graders) because its cheap!, but for texters and young kids in high school you cant text while on the phone, no 3 way, and when your on the internet you may not recieve calls at all the person thats calling you while your on the internet will hear, \"The number you have called is invaild\" so i assure you its best to get an incognito or the blue & pink phone if you want something cheap but the same price with the texting while on the phone & 3 way thingys!", "Date": "January 7, 2012"}, {"Title": "motorola clutch", "Author": "M. Sheets", "ReviewID": "R3EK9MXUIU2EDF", "Overall": "5.0", "Content": "I received this phone in the time I was promised.  I had to return it though because it was made for boost mobile and I have sprint.  Amazons return policy is awesome.  I had no problems with it at all.", "Date": "December 13, 2011"}, {"Title": "clutch me", "Author": "someones ma", "ReviewID": "R2RKE89LO9XQ66", "Overall": "5.0", "Content": "o.k. I needed a phone... this was so easy to find... the I465 motorola clutch easier to order  just wait a minute  it's here  cool get set talk! no problems just did it  like phonesense  no nonsense  thanks!!", "Date": "November 16, 2011"}, {"Title": "This phone is the awsome bomb>>", "Author": "freeladybug1", "ReviewID": "R3REL9YINPSSY9", "Overall": "5.0", "Content": "easy to use, set up, great phone, love the color, didn't like that the pink one I wanted was more money, only other complaint is in the description it did not state that no sims card was needed", "Date": "November 9, 2011"}, {"Title": "Great Phone!", "Author": "Going2BeRN", "ReviewID": "R1VJIJDJF8JWLN", "Overall": "5.0", "Content": "I love this phone!I love the keypad on it, it's a good size if you need to type a quick reply too a text or what not. The web browsing is what too be expected with it. So far It's come quite in handy. I hardly use my laptop anymore.However, when using the internet/email feature. It does run your batter down by one bar ni like an hour. But that's better than draining it completely I suppose.Over all. I like this phone :)", "Date": "August 29, 2011"}, {"Title": "very disappointed", "Author": "angry", "ReviewID": "R3DXPB2EOX52W5", "Overall": "1.0", "Content": "they debit the money from my account and I never receive item nor a response after sending several emails (disappointed)", "Date": "August 24, 2011"}, {"Title": "TERRIBLE!", "Author": "Marine Wolf", "ReviewID": "R1FRFCDR3TC1QS", "Overall": "1.0", "Content": "Ok, let me state, I bought this phone for 60 bucks, ok, and I expected more from a 60 dollar phone.Now lets put it this way, i have had nothing but problems with this phone. I lose service, txt messages are lost FOREVER. It slows down, your phone goes into grid lock if you send a txt message out and a new one comes in at the same time. Even on more than not occasions, the phone wont recieve any txt messages AT ALL FOR THE ENTIRE DAY, but will the following. Then itll tell you, YOU'VE RECIEVED A TXT Message, then have to wait five minutes for the phone to download it a simple txt message like \"Hi\"The phone calls, the sound quality sucks. The calls themselves dont come in sometimes, and itll even tell u, no cant place call cause the number is incorrect!The only good thing is, its durable, cause Ive thrown it tons of times from anger it has given me. When any of these problems happen, you have to either restart your phone, or wait 24 hours to turn it on! Not worth the money, and if i had the money to, I would buy a new phone. KEEP AWAY FROM THIS PHONE IT IS POORLY MADE AND IS POOR QUALITY!", "Date": "August 11, 2011"}, {"Title": "It got the job done", "Author": "Tru Blu", "ReviewID": "R11QBX2HEV09LN", "Overall": "4.0", "Content": "I'm ashamed to say I bought this phone for ....$150! Sad but true... But I needed a phone without a contract andBoost didn't have a lot choices back then. Camera was so so and Internet was slow and screen is small but u can't expect more at the current price. It's durable though but calls drop often. Maybe that's changed since  a year ago. A good step up from this is the Samsung Seek.", "Date": "June 10, 2011"}, {"Title": "Solid phone", "Author": "Dave", "ReviewID": "R2TAW9U5YE7CEA", "Overall": "4.0", "Content": "The Clutch is a very simple, easy to use & solid phone for the money. The only thing that is missing is expandable memory, it only has 20 MB built in.", "Date": "May 31, 2011"}, {"Title": "Cool Little Phone", "Author": "Jeffrey A. Smith", "ReviewID": "R1507S6RJNHO24", "Overall": "3.0", "Content": "It works fine. Not big on new fangle'd features but a good phone. The keys are way too small especially if you've got fat fingers.", "Date": "February 28, 2011"}, {"Title": "ok for the money", "Author": "L. Williams \"DISSAPOINTED\"", "ReviewID": "R37VMJHZMVP58C", "Overall": "5.0", "Content": "this phone is ok for the money it has one of the best speaker phones ever the service is better then cricket and i have not missed a call yet what do you expect for 50 a month for every thing gold  well you get silver and that is good enough for me", "Date": "July 30, 2009"}, {"Title": "Don't waste your money", "Author": "W. Webb \"Music Critic\"", "ReviewID": "R3OEBKBW1I92WK", "Overall": "1.0", "Content": "I know sometimes you can go to Amazon.com and read reviews that are clearly full of hyperbole (both on the side of a 5-star and 1-star), but this is truly a 1-star product.  If I could give it a half-star I would.  I've been with Virgin Mobile before, and their service and phones were awful, and I thought moving to a different pay-as-you-go service would alleviate some of those problems it did not., but let's start with the phone since that is what is being reviewed here (though I must say, the service IS terrible).1. In general, the operating system (Firmware) on this phone is TERRIBLE.  It's difficult and tedious to enter any kind of information, navigate between screens, and most of the \"apps\" included on the phone are poorly programmed and virtually unuseable (I'm looking at you, alarm clock and calculator!).2.  This is NOT a Blackberry.  This isn't even close.  It's got a keyboard, but you'd better have the nimbleness of someone who's been cross-stitching their entire lives if you want to even attempt to type phone numbers in, let alone someone's name as a new contact.  FRUSTRATING!3.  The \"Internet\" Browser - what can I say?  BoostMobile really shouldn't even advertise internet service on these phones because it is completely unuseable and takes FOREVER.KEYWORD:  \"Unuseable.\"", "Date": "December 14, 2010"}, {"Title": "Do'nt buy", "Author": "David J. Rodriquez", "ReviewID": "R2Z2NF3XJ0XEJZ", "Overall": "1.0", "Content": "I needed a new phone so I updated to this pone. I should have stayed with my old phone. It drops calls and loses the signal all the time even if i am standing in the same spot.", "Date": "June 26, 2009"}, {"Title": "note", "Author": "jorge giovinazzo", "ReviewID": "R1BUDY4W4SYS9X", "Overall": "1.0", "Content": "can not review something i have waited for should of recieved it the 18th april and its the 26th so my review is that this phone is crap", "Date": "April 26, 2011"}, {"Title": "It was supposed to be unlocked !", "Author": "Patricia Campos", "ReviewID": "R1T7NXIXRLC4BE", "Overall": "1.0", "Content": "I bought these phones to give as a gift for my parents in Brazil. They were supposed to be unlocked, so they could use it outside the US.Once they've tried to use it, they realized it was not unlocked and they now have 2 useless phones, They can not ship it back to the US so I can not return it ! This is the first time that I've got a wrong information in Amazon.It was very disappointing !", "Date": "February 22, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002E3HQO4"}}