{"Reviews": [{"Title": "Amazing quality and great features", "Author": "Nolan D. Boyle \"audiophile83843\"", "ReviewID": "R1W1V5S3H54GJ3", "Overall": "5.0", "Content": "Ive owned the Nokia n95 and n97, but this phone is definitely my favorite out of the three.  The camera takes amazing pictures while the overall feel of the phone screams quality.  The phone is extremely responsive even with several applications open.  The features are very plentiful and even though this phone is not a touch screen I would pick it hands down over the n97.", "Date": "July 9, 2009"}, {"Title": "Fantastic phone", "Author": "John R. Stracke Jr. \"bibliophiliac\"", "ReviewID": "R2KAX5QX417ODY", "Overall": "4.0", "Content": "I love it.  The screen is great (OLED beats LCD hands down), the CPU is actually fast enough for S60 to feel snappy, and the camera is fantastic.  The only reason I'm not giving it 5 stars is that it's missing a few obvious improvements: image stabilization, a better browser, and a better email client.The Nokia browser is pretty good, but it doesn't have the sensible reflow abilities of Opera Mobile (which resize the main column of an article to fit my screen, so I don't have to scroll horizontally).  On the other hand, Opera Mobile's form input can't use predictive text unless you tell it to pop up a separate dialog, which gets kind of tiresome when I want to type in comments.  It also doesn't have the ability to send pages by email or MMS.The email client is the worst part: it doesn't work for me at all.  It can't log in to either of my IMAP-over-SSL accounts--worse, it doesn't tell me why not; it just tells me, \"Unable to log in.  Try again.\".  Since the client on my N75 could handle both these accounts, this is clearly a downgrade.One concrete problem: the N-Gage system comes with an activation code for one free game, but entering the code as written keeps giving an \"Invalid code\" error.  Googling found the answer: the first character of the code is a zero, not the letter O.  (This is particularly exasperating because *all* the other characters are letters.) Also, you might have to omit the spaces--either that, or I had a typo the first time I tried.Mostly, though, I'm extremely satisfied.  The Ovi Store is a huge improvement over Googling for Symbian apps; being able to write apps for my phone in HTML+JavaScript is really nice; and HSPA is an order of magnitude faster than UMTS.", "Date": "December 9, 2009"}, {"Title": "by far, best phone I've ever had", "Author": "E. Arce", "ReviewID": "RSPZSD4Z07RBR", "Overall": "5.0", "Content": "Where to start....I bought this phone back in March of 2010. I can't believe it's 450 dollars now when I only paid 320, here on Amazon, for it.But anyways, it's a very reliable phone. I've had it on for over 6800 hours and I never let it rest. I usually fall asleep listening to music and when I wake up the music is still playing, whether it's ambient music off of Nokia's internet radio or one of thousands of mp3 songs stored on the phone. Basically, I never let it rest.The main reason I bought the phone was for the camera. 8MP camera with the Carl Zeiss lens. Auto focus and Dual Led flash that lets me take 10 pictures in 10 seconds or 60 in a minute using sequence mode. Panorama mode is also great. So easy to use when you're outdoors and want to capture a 360 degree view. Face detection. Image editing. It does everything I need it to. Also, comes with a front camera that I can use for video chatting or to take a picture, video or use as a mirror. Anything, pretty much.Multi tasking. I love it. I can run 5, 10 or 20 of the 100 apps that I already have at once and switch from one to the other at any time. Depending on which apps I'm using, the phone slows down after having several open, but I like to be online and listen to music or talk on the phone at the same time. Or do all 3 at once and the person on the other end hears the music as well. Also, I like using emulators. They take up a lot of memory but this phone handles them so well.I don't use the nokia browser. I'm used to Opera Mobile. But the N86 has no problem running the S60 version of Opera.Navigation, very easy to use as well. I love that it's free. I have all of Mexico and half of the US downloaded so I don't even need an internet connection. At first, it was slow for the GPS to find my location but after an update, it took no longer than 30 seconds. I used it for months until one day, it became unstable. It wouldn't stay on, it would just exit the app. So I started using google maps which is also free. I didn't like it and I tried using the Nokia app again. It was fine. I don't really know what happened but it fixed itself.Other great features: it's a Nokia, I've always had nokias so I still have contacts, messages and other files that I had on my other phones. I can back up any file, contact, number, calendar entry, bookmark, anything you can think of and restore it on any other Nokia phone.When I first got this phone, I didn't know it had the FM transmitter. I can listen to my music anywhere. It's perfect: it has a strong signal, works with any radio, i use it at work, at home, in my friends' cars, everywhere, I can set it up to any station I want so I get the least interference depending on which city or state I'm in.Wifi is the fastest. The phone automatically stores passwords so you never enter them again. When searching, it will show you which has the fastest connection or the strongest signal and it will use connections automatically that you have used before. You can download a song in a few seconds, load videos instantly, faster than any 3G.Basically, there's nothing this phone can't do. I always find something new that the phone is capable of. I would definitely recommend this to anyone.If you have any questions about the phone, feel free to email me and I'll try to help", "Date": "January 3, 2011"}, {"Title": "the best phone", "Author": "Nicolae", "ReviewID": "RMFTFEL0FJBH3", "Overall": "5.0", "Content": "i own n86 since early november, 2009. it is by far the most veratile device one can buy. i hardly use digital cameras, mp3  playera, usb sticks, gps devices. carrying around dedicated devices became pointless, as the phone performs well there tasks. i read news, check my email, take photos, listen music, check the weather, travel and communicate using just one device! i tried looking at nokia n8 or other newer smartphones, but none comes close in terms of all round brilliance. so i am stuck with the n86 until it dies. i repaired it twice, for i have alternatives so far. i wish nokia put a more powerful processor, the 12mp camera from n8, and a slightly larger display for better browsing experience- it would make the perfect device for many users!", "Date": "May 11, 2012"}, {"Title": "nokia n85", "Author": "droptop", "ReviewID": "R2PCPIT1TEPM8I", "Overall": "4.0", "Content": "I loved this phone. Music player, while not perfect, was one of the better ones I have used. The internet browser worked, although required some horizontal scrolling. Screen was great (OLED) although sometimes difficult to see in the daylight. I only occasionally missed the touchscreen, but most of the time I prefer the d-pad.My complaint with this phone is that it only lasted 9 months. I admit I am hard on phones, so this does not really surprise me- In the past few years I have gone thru at least one phone per yer, so the n85 I would rate average in durability. I enjoyed having it, but the local repair shop could not fix it. It is not a common phone, but that was part of its appeal to me.", "Date": "June 14, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002ECZ0C0"}}