{"Reviews": [{"Title": "HTC Fuze...Trick or Treat!!!!!", "Author": "Rodolfo Vargas", "ReviewID": "R1MZNMW18KVNMR", "Overall": "1.0", "Content": "I'm so sad and dissapointed about this.  I don't understand how come does a company published something regarding a phone in order to sell, and send the product so defective. I bought from OEM several phones, and normally everything is fine, but this...It said \"3.2 camera\", and I got NO CAMERA!!! it came WITHOUT a CAMERA, it's not a working problem, it's no lens a all....the hole is seal. They offer and UNLOCKED phone?? I think they misspell the word, the right word is LOCKED phone. Windows didn't start, I'm still waiting to see the home screen. And they offer me to send it back in order for a refund, but I have to pay to send it, and loose more money??? I gave it to a friend in order to use it as spare parts. Thanks for make me loose my money!!! Now I now why it sais \"NO WARRANTY\". AMAZON has to check about products with no warranty, who will be responsible.", "Date": "February 27, 2011"}, {"Title": "SLOW PROCESSOR", "Author": "Jackson \"Mr. G\"", "ReviewID": "R12H17O49379HO", "Overall": "2.0", "Content": "If you like a quick response time buy a different phone.  This one hangs up and has a slow response time.", "Date": "May 16, 2011"}, {"Title": "cell phone had NO CAMERA!", "Author": "christina", "ReviewID": "RIF7A1E48UUAY", "Overall": "1.0", "Content": "i am extremely disappointed with my purchase of the htc fuze since it had no camera. NO CAMERA! i used to think you people were trustworthy and reliable; if i tell you what i think of you now you would describe me as rude and bitter. i know there is nothing to be done for me now but i am writing this in hope that no more people will fall into this trap.needless to say that i will not be buying anything else from here.thank you, christina", "Date": "April 5, 2011"}, {"Title": "I bougth a brick", "Author": "Amazon Customer", "ReviewID": "RZEJOABA66DQ0", "Overall": "1.0", "Content": "i bought this phone because of its features, like camera a 3g, but it cames witohout camera and it does not work with 3g and failed suddenly over GSM, i asked for money back, but i have to spend more than cell's cost to get it...", "Date": "January 26, 2011"}, {"Title": "Complete Ripoff", "Author": "MX", "ReviewID": "R3GV8R54N791CB", "Overall": "1.0", "Content": "I bought the phone back in September for my girlfriend as a gift and thought that this would be a prefect phone but that's a highly laughable thought now. I bought the the phone new from Provyde, Inc and I have never seen such a worthless phone. The phone itself doesn't work on calls unless its plugged into a headset or on speaker phone. And aside from calling, the phone has no clear indication of whether its running on WiFi or if its using the internet through the phone company so we're scared to even use it. Along with those two big flaws, the phone is super slow and takes forever to even load from one page to the next. Plus, its not slim as you would think from the pictures, but its like a mini brick in your pocket. The only good thing about the phone is that the exterior looks super nice but what's the point of a phone based on looks that will not work? I've contacted Provyde, Inc. twice in the last month to return the phone and, after no response, finally filed a claim through Amazon to return this waste and get my money back. Provyde, Inc. and the HTC Fuze are nothing but a waste of time. Save yourself from wasting money and all of the headaches from this phone: DO NOT BUY. It will be a waste of time.", "Date": "October 18, 2011"}, {"Title": "Better than the original", "Author": "DUANE E ANDREWS", "ReviewID": "R12QZ4AX9B7O7K", "Overall": "5.0", "Content": "This was a replacement for an existing phone of the same model. I wanted an exact replacement due to the importance of features that caused me to choose this particular phone to begin with. This one works as well and the basic functions are actually better than the original. I had forgotten how well the phone functioned when new.", "Date": "March 26, 2014"}, {"Title": "Love this item", "Author": "Lyn", "ReviewID": "R16XW61QVJ54R8", "Overall": "5.0", "Content": "I love the phone it was just as described in the add I will order again, thanks for your honesty", "Date": "January 23, 2013"}, {"Title": "DEFECTIVE", "Author": "sean B", "ReviewID": "R1VA889051TGHX", "Overall": "1.0", "Content": "The phones main upper speaker for phone calls doesn't work. I was expecting a phone that worked not one that worked to a point that its not worth the $100+ spent on it. Thanks", "Date": "June 28, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Windows Mobile 6.1 with TouchFLO 3D interface responds perfectly to your finger gestures when scrolling through contacts, web and launching media\n3G-enabled smartphone compatible with AT&T; Navigator GPS turn-by-turn directions, AT&T; Mobile Music, Video Share service, Push-to-Talk communication\nWi-Fi networking (802.11b/g), Bluetooth stereo music, 3.2-megapixel camera, MicroSD expansion up to 32 GB\nUp to 7.4 hours of talk time, up to 460 hours (19.3 days) of standby time", "Name": "HTC Fuze / HTC Touch Pro GSM (US ATT Version) Unlocked with No Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/51%2BMpEh%2BDYL._SX300_.jpg", "ProductID": "B00292UEVW"}}