{"Reviews": [{"Title": "Poor sound, bad keyboard", "Author": "R. Hesse", "ReviewID": "R1WOWPTQE7YJWI", "Overall": "1.0", "Content": "The keys on this phone are very sticky.  Text messaging is a pain.  I often hear an echo when I am talking with people, which makes it impossible to process a thought.", "Date": "February 27, 2011"}, {"Title": "Great for what it is", "Author": "L. Liao", "ReviewID": "R2R15U78NQ8OMN", "Overall": "5.0", "Content": "I have had this phone for two years now. It is a simple phone for voice and text, and I love the qwerty hybrid keys. I was able to unlock this phone by emailing Tmobile so I could use it while visiting China. In China and US, calls have great quality. Bluetooth was a bit hard to hear a few times, but that could just be from a combination of factors (me being on the road). Pictures are an added bonus. The battery is getting old and isn't what it used to be, but the phone itself is in great condition.The only cons for this phone are the verification sounds that CANNOT be turned off without muting your entire phone. These sound whenever you change a setting, set an alarm, or save anything in general (I have searched forums about this). This also applies whenever you take a picture - there is Always a sound.", "Date": "December 31, 2010"}, {"Title": "Was okay for a few months but no more", "Author": "Rutherford", "ReviewID": "R3H6Z3VSWOAMFZ", "Overall": "2.0", "Content": "This phone was fine at first. However, after only a few months it started deteriorating.My user habits are very basic, I talk and text, that's it. I don't use any other features. Now, after using this phone only 9-10 months, when I make calls all of the people on the other end tell me they can barely hear me, some not well enough to even continue to try to talk. It has to be this phone because I'm told the same thing by everyone I call, regardless of their location.", "Date": "December 1, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002Z6YQ7K"}}