{"Reviews": [{"Title": "Small Size w\\ Everything I need", "Author": "Amazon Customer \"debbie\"", "ReviewID": "R1G8GPHSUS8T4L", "Overall": "4.0", "Content": "It fits in my pocket and yet has a large screen so web pages are readable.  It takes good photos.  I like the touch screen.  I has a lot of options for quick dialing.  I have used the voice recognition for dialing and texting, very convenient when driving.", "Date": "July 7, 2010"}, {"Title": "Great phone", "Author": "Dale Adkison \"KeepingItReal\"", "ReviewID": "R3G4UGNT6PMSAA", "Overall": "5.0", "Content": "I needed a phone for making and receiving calls with an interface I can see without reading glasses. The touch screen is big and bright that shows a large dial pad and qwerty keyboard for all your dialing and texting needs. Good battery life.", "Date": "November 5, 2010"}, {"Title": "Not the worst, but not my favorite.", "Author": "Cow Belle", "ReviewID": "R1CB80Y9MHZ3CA", "Overall": "3.0", "Content": "I purchased this phone back in 2009 so I have been using it a little over two years. It was my first experience with a touch screen phone...it was frustrating. I would advise anyone purchasing this phone to get a clear screen protector as i managed to scratch mine the first day.Texting on this phone took a while to get used to. You can very easily hit the wrong button and can pretty much count on doing this in every text (even for the seasoned touch screen user). The nice thing is that you can change the font size of your text by pressing the volume button up or down when you are in the text--I partially wish that I could use the volume button to scroll down like it allows me to do when accessing lists in tools or my stuff, but it doesn't. So if you have a URL in your text it is a bit tricky to get past it without actually selecting it, but the phone is kind enough to ask you if your REALLY want to do that...it knows therefore it asks. You cannot store many texts in the phone. I have heard the figure of 200 tops and I believe it. Apparently texts are heavy and the phone does not want to carry them. It does automatically break up sent and received texts into multiple texts for you instead of giving you an error message. I like that. The video feature has an option where you can select lower quality to send a decently long video to someone via text even though it will be poorer quality--I appreciate that--the longer video, not the poorer quality. Sometimes when texting, the screen will sort of freeze for about 10 seconds and then all of the sudden add any and all letters you hit during its \"power nap\" to your text...most of the time. I reached the point where I would just continue to type and then the phone decided I was trying to outsmart it or overwork it so it wouldn't put those letters in my text...it is sad being outsmarted by a phone. Robots will take over someday, I just know it.Browsing on the web is ok. Some of the pages are slow loading and some just decide it isn't worth the effort. It does give you a little better view then some of the regular messaging phones and the touch screen can make the navigation a little easier in some ways, so that is a plus. The phone does have a very sensitive touch screen however, so in scrolling down a page, be prepared to accidentally click on a URL or two...or three...or ten.Battery Life is great. I can go about four or five days without charging it. I have to charge it every other day if I am using the phone heavily. I still have the original battery even two years later. That is nice.The alarm feature should probably be referred to as not an alarm...well, no, it does cause alarm when you wake up and realize that it slept in--heart palpitations galore (aka. ALARM). You see, the phone knew that you really wanted to sleep in, so it just didn't go off. Seriously though, the alarm worked about a dozen times and after that it just sort of stopped, every once in a while it will work, but not in any sort of reliable way. The phone allows you to set several alarms...so you can have all kinds of ALARM--not in the being notified when you should way though).Call quality was average. I say \"was\" because I can still hear people who talk to me, but the internal mic in my phone makes my voice sound very quiet to them, to the point where they basically can't hear me. Now my speaker phone still works. Apparently, it is a built in accountability system. Would I say some of the things I say if everyone could hear? I know the answer to that now, because I have to hold the phone in front of me and talk to it from a few inches away and have them on speaker phone. But, I will say, the speakerphone is fairly nice. You can hear them pretty well, although they have trouble hearing you if you have the phone more then two feet away from you.Finally, (though I can't imagine someone is actually still reading this epistle) I had \"No Event\" show up on my phone's homepage screen. I think this is a function of the calendar gone rogue. I clicked on it and it did not open. I tried to delete any events from the calendar to no avail. Either the phone is trying to rudely predict what my day will look like, me from the future is sending subliminal messages back to me present, or it is just a bug. I am going to go with the third one for piece of mind...that and I read other reviews of people who had this issue. To hide it (because it will never ever go fully away) you open the widget bar and shove it on there. You will then only see it as an exclamation point on the widget bar as if the phone is saying, \"What gives!?\"So there you have it. It is not the worst phone ever. It has some rosy and cheery points. This phone has brought me this far, which I appreciated, but it hasn't been my favorite phone. It did not make me feel warm and fuzzy towards Samsung in general, but in the event that machines/robots/computers take over the world I will not be surprised to see my phone was involved in the planning and executing of that master scheme.", "Date": "January 16, 2013"}, {"Title": "Exceptionally great customer service and good product", "Author": "Dez", "ReviewID": "R36O5M9JKDLPYN", "Overall": "5.0", "Content": "I bought this phone from this seller and thought it was unlocked however it was locked to the AT & T network. I contacted the seller who in his kind mind sent me an unlocking code and eureka the phone was unlocked and I can use it effectively now. Also I bought the product as used but it has no signs of use on it all. Seems new and effectively working.Overall a great buy. I recommend this seller to anyone that cares.", "Date": "July 28, 2012"}, {"Title": "package came early and everything is new.", "Author": "Gizmo", "ReviewID": "RKYUYF0UJQHPF", "Overall": "5.0", "Content": "Love this phone, had one for 3+ years and the battery life is awesome so I bought two more for my kiddos.  Too bad it doesn't have wifi - but no biggy since that might kill the battery.  Still an awesome phone.", "Date": "December 28, 2012"}, {"Title": "Son very happy", "Author": "Kimberly Mendenhall", "ReviewID": "R1WH6ROAN6L415", "Overall": "5.0", "Content": "Ordered this phone for my 16 years old..He loves it the device. He wanted a all touch screen device and I wanted a Non-Smart phone! Both of us are very happy with the device!", "Date": "December 10, 2012"}, {"Title": "samsung lostice sgh-a887", "Author": "youssef", "ReviewID": "R2UX5SXQ3CCIVE", "Overall": "3.0", "Content": "i just purchased this  phone a  week ago ,the size is good,if you gonna use it for calling texting and some  web its  good , if you are good with touch screen its  good for  you but the screen is small ,good features for basics .battery is not bad .one bad thing when  you are talking you hear sound like from the speaker ,wave sound like ch ch or beeping /may be its just mine .", "Date": "November 4, 2012"}, {"Title": "great phone", "Author": "Adeleke Lydia F", "ReviewID": "R14CVBY7J5YNTW", "Overall": "5.0", "Content": "The phone is working great and am pleased to recommend this phone to anyone.The phone is economical and easy to use, unlike other phone that is very complicated to use.", "Date": "February 4, 2012"}, {"Title": "Stay away!!!", "Author": "tanyamarie", "ReviewID": "R2QYR9LLQL9DGB", "Overall": "1.0", "Content": "I liked this phone at first, for probably the first 2 or 3 months.  After that, I began having problems with it.  I started dropping MANY calls and then started making this high pitched buzzing noise when I was talking after the noise was over, it would drop my call or turn off.  I went to AT&T; and since the phone was still under warranty they shipped me a new one.  My husband has the same phone (but got his a little later and up to this point was not having issues either, so we figured it was just my phone).  Shortly after I received my new phone, my husband started having the same issues with his.  They sent him a new battery, but that did solve the problem.  My new phone worked fine, again for about 2-3 months.  Now it is doing the same thing.  AT&T; has horrible reception to begin with, but it is ever worse with this phone.  If I talk on it longer than 5 minutes it will probably drop my call or make the high pitched beeping noise (or both).  It is the WORST phone I have ever owned and would NEVER recommend it to anyone!!  DO NOT buy this phone!!!!", "Date": "July 19, 2011"}, {"Title": "Starter phone", "Author": "MagXxX", "ReviewID": "R2X64HSC2MDHNB", "Overall": "3.0", "Content": "Good phone if you need a replacement for a short time. App Store in it is out and you can't get anything anymore.", "Date": "May 1, 2013"}, {"Title": "Just ok", "Author": "Christine", "ReviewID": "R29IKGYP6U68Z6", "Overall": "3.0", "Content": "It is my fault that this was just ok for me.  I was looking for a phone to get me to my contract renewal.  This was just so far removed from a smart phone....duh, right? But I just didn't realize how much it would matter to me.  Otherwise, this phone functioned exactly as expected, arrived just as expected which was in its sealed box...never been opened.  Brand new, arrived before expected.", "Date": "March 12, 2013"}, {"Title": "Out of date", "Author": "Knightimereader \"Knight Time Reader\"", "ReviewID": "R3JUXAD6G0T0YF", "Overall": "2.0", "Content": "Didn't realize how dumbed-down this one is compared to newer version. Really does not have many extras. It works with ATT with no problems.  Camera is adequate. Screen is so small when one texts have to use a stylus to keep from hitting 'a when need 's etc.", "Date": "May 13, 2014"}, {"Title": "Samsung Soltice", "Author": "Drea", "ReviewID": "R1NIF64FLFPDBD", "Overall": "5.0", "Content": "Excellent Product we are very happy with this model. It was brand new and in excellent condition. Thank you very much!", "Date": "August 26, 2013"}, {"Title": "great but no volume.", "Author": "Tessy", "ReviewID": "RAPYZBV1XE626", "Overall": "2.0", "Content": "The fone is really great but it didn't have volume at all,so I had to return them back to Amazon, cos I bought 2. Aside poor volume, the phone is great.", "Date": "August 12, 2013"}, {"Title": "Works fine for me", "Author": "Ted Heilmann", "ReviewID": "RU9Y7IL66GBBE", "Overall": "4.0", "Content": "This is my second Solstice. I wore the first one out after 4 years of hard use. I have a texting plan that gives me unlimited internet access and although I can't use APPS with it...no big deal  I don't need it for that. I use the phone to make phone calls. Gee isn't that what a phone is supposed to do? Fine if you want to surf. Go ahead and buy a smart phone. And enjoy an expensive data plan. I can still go to mobile sites and read news, sports, weather, financials, find addresses and so on...It's a great texting phone for me.", "Date": "July 28, 2013"}, {"Title": "Finally happy with a phone and don't need a data plan!", "Author": "Pearlmom", "ReviewID": "R2G2W9V1ODSRV4", "Overall": "5.0", "Content": "I have had bad experience with my phone of late.  Even had to use a phone from way back for a while until I found this one.  Phone is working well and I am very pleased.  I would recommend it if you don't want to pay the extra $$$'s for a data plan that I don't need.", "Date": "July 26, 2013"}, {"Title": "Great Phone!", "Author": "casaundra ernst \"casaundra d. ernst\"", "ReviewID": "R2OAH7B65PM79P", "Overall": "5.0", "Content": "This phone is not very different than the phones I am used to. I have always had a \"smart\" phone with the web and camera etc.This is a little slow, but I have a thousand dollar laptop that will need replacing in the next year or so. I want a dependable phonewith a decent camera. The voice quality seems fine. It just arrived yesterday and the set-up was easy.I can't comment much about the seller. It arrived in a timely fashion with Amazon Prime. The seller should take any phones awayfrom Amazon that he has gotten complaints about. I was so disappointed last week when the LG phone came and would not takethe charge.", "Date": "July 17, 2013"}, {"Title": "It's ok not great", "Author": "Ash", "ReviewID": "R3MLXBTZCXA54W", "Overall": "2.0", "Content": "The touch screen is hard to use. Not a great phone but I don't expect much out of a $60 phone.", "Date": "July 12, 2013"}, {"Title": "Not unlocked", "Author": "yaypee", "ReviewID": "RFD48ZD152I9K", "Overall": "1.0", "Content": "It works only with SIM cards of carriers in partnership with AT&T;, i.e Vodafone in India. Wrongful claim of unlocked phone. Wasted money.", "Date": "July 7, 2013"}, {"Title": "My wife's first semi touch screen phone", "Author": "S. I. Impastato \"Easy to please\"", "ReviewID": "R3OIOIAJ7GNO88", "Overall": "4.0", "Content": "My wife needed a new phone but didn't want anything fancy (doesn't listen to music, text or photos) just a plain phone. Well finding that took some research unlesss I found one used. Checked Amazon and the Samsung Solstice seemed to be the closes to just a phone with the exception of a touch screen. Well I must say that I was even empressed with it (might get one for myself when the need comes) because I am the one who has to teach her how to use it. I now see that she is exploreing more of the features the phone has on her own and that is a big +. Only negative is that the screen inputs can lead you to the wrong loacations till you get familiar with the pressure needed to navigate.", "Date": "July 6, 2013"}, {"Title": "Malfunctioned within 2 months", "Author": "A. Solis", "ReviewID": "R3V38UXNMBH305", "Overall": "1.0", "Content": "I love Samsung, we all have them. But the screen died within 2 months on this phone and for no apparent reason - got a refund. Love Amazon still because they know how to treat us.", "Date": "July 2, 2013"}, {"Title": "Bad deal. Do not buy", "Author": "Mike", "ReviewID": "R185OUV3EHFNA7", "Overall": "1.0", "Content": "I have used two Samsung phones before now and I was sold out on the fact that ALL their products are good. But I got a shocker of my life a few hours after this phone was delivered. The product which I bought for my daughter who lives outside the US was virtually dead on arrival - It took ages to get the battery charged and several hours to power the phone on. The worst experience I had was that each time I managed to power the phone on (and it takes a lot of pushing, pressing and fumbling with the power on key) the screen goes blank and black. I was so frustrated that I actually decided to return the product but after realizing that I might not get a replacement before my wife traveled out of the US, I decided to send the half-dead phone to my daughter with the hope that she could get some repair work done on it For now I have resolved that any product that goes by the name SAMSUNG should be avoided like a plague.", "Date": "June 2, 2013"}, {"Title": "Worked great for almost a month", "Author": "J. DeMente", "ReviewID": "R1XUBATFXJ84RG", "Overall": "2.0", "Content": "Got this phone almost a month ago and was very happy until the manual buttons stopped working.  Cannot deal directly with seller (BREED) to work an exchange so will have to send to Samsung for service.  Amazon will only accept a return (we pay shipping).  Did not see comments about this issue on Amazon reviews, but once it happened I saw quite a few comments about this issue in the google search.", "Date": "May 2, 2013"}, {"Title": "Nice Phone", "Author": "Lee G Hawkins", "ReviewID": "R3RN88TVFHX6TP", "Overall": "5.0", "Content": "The phone functions better than expected, and nice looking. I could not find a better price for this phone anywhere.", "Date": "March 20, 2013"}, {"Title": "Old style phone but just what my sister-in-law wanted.", "Author": "john l. rogers", "ReviewID": "RCH5LMWNJE7P6", "Overall": "5.0", "Content": "My sister-in-law had a Samsung A887 for years and did not want the new type phones. Hers was in bad shape and ask me to find a new replacement. I went on Amazon and found what she wanted. She is now a happy camper.", "Date": "March 14, 2013"}, {"Title": "ok phone", "Author": "Michelle", "ReviewID": "R3BPH2K3BXADF7", "Overall": "4.0", "Content": "Good price not so great touch screen. Does not respond well and picks up wrong numbers all the time when dialing on the touch pad. Otherwise decent phone for the price.", "Date": "March 12, 2013"}, {"Title": "My son bought this and loves it!", "Author": "W. Cowell \"WArvidC\"", "ReviewID": "RI1YL55UPSLOI", "Overall": "5.0", "Content": "He needed to replace a phone with a non-smart phone... good choice so far.  He likes the features and double sliding abilities.", "Date": "March 8, 2013"}, {"Title": "good phone", "Author": "chad shepard", "ReviewID": "R1F6W1L86WJ1TE", "Overall": "5.0", "Content": "love this phone. the first one i bought lasted three yrs. it took a swim so i just had to get another. found it on here cheaper than other places its fast and easy to use. i got ole fingers to!", "Date": "February 4, 2013"}, {"Title": "love it", "Author": "cindy montano", "ReviewID": "R38QRTHLHUHXS1", "Overall": "5.0", "Content": "i love this phone i have had one for a long time and couldnt find another like it.im not into smart phones this is a perfect phone for me i love it", "Date": "January 13, 2013"}, {"Title": "GREAT", "Author": "Jadon", "ReviewID": "R2EZCLMLJ5288L", "Overall": "5.0", "Content": "This is a great phone it have GPS internet mobel TV apps and so many more.This is a great phone.", "Date": "January 11, 2013"}, {"Title": "Not What I Thought", "Author": "Tech Nutz \"Ontario\"", "ReviewID": "R2OL37RI2VCZ81", "Overall": "3.0", "Content": "I was ready to move from my \"prehistoric\" flip phone in the direction of to-days smart phones.  All I really wanted was something with a touch screen that I could load some music onto, so I could leave my MP3 player at home when I travel.  The Solstice A887's listed features, along with the Samsung reputation for quality, appeared to indicate this device would allow me to take that first step towards the 21st century, (technologically speaking).  However, when I received the phone there seemed to be no easy way to download music.  A connection to my P.C. was not possible.  Unlike most phones or similar devices which connect using some form of USB connector, Samsung's connection is unique to that device.  The only way I could see to load music onto this phone was to purchase it using the installed AT&T; app.  Since I am not a AT&T; customer, that avenue appeared closed to me.  And quite frankly I don't want to purchase music when I have a huge amount of my favorites sitting on my P.C.The phone itself is quite nice looking with a reasonably responsive resistive touch screen.  And as soon as I installed the SIM card it very quickly connected to my Canadian cellular provider. However, the inability to load music was the deal breaker. The fact that it was loaded mostly with applications specifically for AT&T; was also a disappointment.  After I had taken a few minutes to assess this phone and it's features, I immediately re-packaged it for a return to Amazon and ordered another Samsung model from Amazon, which I hope will be more suitable to my needs.I do want to end on a positive note and express my admiration and thanks for Amazon's efficient and effective return policy.", "Date": "January 6, 2013"}, {"Title": "A887", "Author": "tfg4tb", "ReviewID": "R4F9834WEIFVI", "Overall": "4.0", "Content": "Bought this phone for my son to replace one that he lost. It must be working great because if it was not he would let me know.", "Date": "December 26, 2012"}, {"Title": "nice phone but after 3 months...", "Author": "MRD", "ReviewID": "R13TFE95NDHFG7", "Overall": "2.0", "Content": "I really liked this phone, but after 3 months it just started freezing, and turns itself off and then back on. Over and and over...Good luck if you decide to purchase.", "Date": "December 31, 2012"}, {"Title": "Solstice A-887", "Author": "Juan D. Arroyo", "ReviewID": "R228P2GLH1IWGP", "Overall": "4.0", "Content": "Confortable cell,good price .Its works ok and has good size. You can save it in your pocket without problem.The only thing is that is not a smart phone but if you whant internet you can get a data service and then you can surf on the internet.Works good whif AT&T.;", "Date": "April 22, 2013"}, {"Title": "Junk phone and will not recomend this to my friends", "Author": "chandra Thota", "ReviewID": "R90ZQFII4V6HH", "Overall": "1.0", "Content": "This is junk phone  .When i opend fresh new one ordered in online through Amazon, the  screen is full of blerr and not able to see anything . I was asked to send it back for replacement and i have not recieved  thr fresh piece till now .I spent $75", "Date": "March 8, 2013"}, {"Title": "Not a \"Smart Phone\" No WiFi", "Author": "David A Ehrenfeld", "ReviewID": "R2YNTF6FG64WX7", "Overall": "2.0", "Content": "This phone is an OK phone. It cannot connect to the Internet (confirmed by ATT and Samsung). It can send/receive texts, but no data and NO EMAIL!!!!", "Date": "February 19, 2013"}, {"Title": "Good phone but battery life is terrible", "Author": "ML86", "ReviewID": "R33KJGUM2CRH5J", "Overall": "3.0", "Content": "I bought this phone as a cheap replacement for my BlackBerry which I despised. I wasn't looking to spend alot of money as my contract with AT&T; expires in November and I just wanted a non-smart phone. This phone is easy to use, especially with being able to lock the phone on the top instead of having to type in an annoying security code and worrying about it butt dialing dialing 911 on you.The only complaint I have with this phone is that the battery life is deplorable, as in you had better plan on charging it TWICE A DAY, EVERY DAY. Even if you are not using it, the idle time will eat the battery up. I read other reviews that mentioned this same problem prior to when I purchased the phone, so I was not surprised.Additionally, the camera quality is not that great, but for the $65 I paid for the phone, I really can't complain. If you want a cheap replacement that is touch screen and easy to use, then this phone is for you. Oh, and plan on buying a special charger for it as it is not a standard USB port (one irritating part but chargers are relatively cheap and easy to find). Other than that, it works great and if it dies in a month, I've gotten my money's worth by not having to buy some $300 IPhone that will be outdated in 6 mos or less.", "Date": "October 20, 2012"}, {"Title": "your cell phone suck", "Author": "msjs", "ReviewID": "R1HXV8F0RAB3T9", "Overall": "1.0", "Content": "this cell phone is cheap, its garbage and most of the time the crap don't work.  I can't download my photo's because the system is saying that the files are corrupt.  I never used the cheap piece of garbage before.  I can't connect to the internet why it won't allow me to.  Everything that you can think of is wrong with this phone.  don't buy it.  If you want to know the truth about it it's garbage.  Go and, buy yourself a real phone.", "Date": "May 18, 2013"}, {"Title": "Need to be positive", "Author": "Silas Nwaeze", "ReviewID": "R2TQUFFMDFKO24", "Overall": "1.0", "Content": "posted phone was unlocked while is not ( Samsung Solstice A887 Unlocked GSM Phone - Black )plz be positive", "Date": "December 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "This product has been carefully audited and is certified to be 100% functional.\nThis offer includes the following accessories 1. Battery 2. Battery Cover (if applicable) 3. Wall Charger", "Name": "Samsung Solstice A887 Unlocked GSM Phone - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41xMFbA1GTL._SY300_.jpg", "ProductID": "B002JXP9WA"}}