{"Reviews": [{"Title": "Slow LG interface, missed/dropped calls, unreliable touchscreen", "Author": "C", "ReviewID": "RAHWSAP6GNFQQ", "Overall": "1.0", "Content": "This phone was purchased back in 2009 shortly after its launch for my mom who is technologically impaired.As I was setting up the phone for my mom, I noticed that the LG interface seemed slow.  So, I contacted the company and downloaded an updated version of the software which didn't seem to improve anything.  The phone comes with headphones & mic combo, charge cable, data cable (mini usb) and a tiny CD that contains the LG PC Suite software.  This software is supposed to make it easier to manage the media on the phone, but it requires the phone to be synced frequently.The touchscreen lost sensitivity after a while and the response time of the interface has become slower and slower.  An old Iphone 3G running to wrong version of the IOS is a rabbit compared to this turtle. I have wiped this phone clean several times and have reinstalled the latest version of its software from the LG support site and still this phone continues to miss and/or drop calls because the the touchscreen/phone takes too long to respond/wake up.  The \"pick up call\" button is visible but not active unless it is in color.  It is in greyscale most of the time when the call comes in and stays grey until the caller goes to voicemail/hangsup upon which it turns green (active) and you can pick up an empty call if at all.I have been helping my mom weekly with her phone for the past 2 years. Both the original and the replacement (new not refurbished) have the same issues.We chose this phone for her because her original Sony phone was recalled a week after she got it and this phone was the only Quad-band, Asian language compatible phone with higher quality camera available for her month-long business trip.Overall as a phone this sucks as it can't reliably pick up calls.  However as a portable mp3 player and video viewer it's really quite nice. But as we're looking for phones here and not a portable media player, my recommendation is stay away.", "Date": "June 24, 2011"}, {"Title": "so perfect and good...", "Author": "Albert Kim", "ReviewID": "R2H2IGL1E40Y1P", "Overall": "5.0", "Content": "comes with 2 battery and international version so I can write korean and see korean.. also has screen protectors and case too... perfect... nothing is better than this...", "Date": "April 12, 2011"}, {"Title": "Excellent phone, especially if you have big hands.", "Author": "Kenneth E. Purvis", "ReviewID": "R49I7R91JIVFF", "Overall": "5.0", "Content": "This is a quality phone that functions well. It has a good tutorial on how to use the different features that is easy to use and understand and you can pull it up on screen at any time. I have big hands so the 4\" length is great for me. I am very pleased with the phone and would recommend it to anyone.", "Date": "August 19, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002RS46FS"}}