{"Reviews": [{"Title": "What a phone!!!", "Author": "Rajesh Ashtaputre", "ReviewID": "R2DW8IZNKEZ6O8", "Overall": "4.0", "Content": "Two days with this phone and I'm totally loving it, what a breath of fresh air having used an iPhone for over 2 years.Pros:1. Awesome screen, can't be compared with the \"retina display\" but seriously it doesn't make much difference. BUT, I seriously hope SE starts packing more pixels (they have not in the Arc model). Pix and Videos look awesome on this screen. After all, size does matter!2. Phone came with Android 2.1 and I like it better than iPhone 4.2.1. For some reason, I think it excites the geek in me. The iOS is a bit too user-friendly that I almost feel like an idiot using it :)3. The best part is the \"i\" in the phone, I can use it almost anywhere in the world - both voice and data. The HSDPA supports 800/850/900/1700/1900/2100 so the 3G will work in many european and asian countries as well as in the US.4. The size is so right that it fits very well in your hands.Cons:1. No front-facing camera (not in the Arc model either, SE wake up!!)2. No retina display3. Not many quality accessories available.4. In-call volume and battery life could use improvements, but not a show stopper.Get this phone is you like freedom, universal (almost) usage and saving $$$ (or whatever your currenty is!).Cheers!", "Date": "May 7, 2011"}, {"Title": "Good product, fair price", "Author": "Efren", "ReviewID": "R25Y0YPMR2BPOM", "Overall": "4.0", "Content": "The phone has a very nice camera, not so good for low light pictures. Screen is amazing. Not to keen on having to update via computer, OTA updates would be great. Overall a very nice android phone", "Date": "May 9, 2011"}, {"Title": "After Android 2.1 Update", "Author": "Shoxter \"JMM\"", "ReviewID": "R1GOYX7YAFQ4M1", "Overall": "5.0", "Content": "On X10 Android 2.1 update: it feels like I bought a new phone without spending money, not that it was bad before the update, but it was way too good after. Kudos to Sony Ericsson!", "Date": "November 21, 2010"}, {"Title": "XPERIA X10i  is one Amazing & Good looking Phone!", "Author": "STRALLENT COM \"STRALLENT\"", "ReviewID": "RYCJWPKT0UCRK", "Overall": "5.0", "Content": "This White X10i looks gorgeous!I suggest, before you buy this phone, do your research first. Watch Videos on \"How to's\" on YouTube & read some articles, specially on how to upgrade to Android 2.1.Once you are ready, Get it & You'll gonna love this phone.WARNINGS!1. Unfortunately, to all Mac users like me, we can only upgrade to 2.1 on a PC connected via USB. I hope you have Wndows (XP to 7) on your Bootcamp. Fortunately, I have Vista Ultimate on Bootcamp.2. If you are not a technical person, you'll brake this phone. If you don't have the patience, just stick to pay-to-go phone.PS>5 Stars to FGS Trading, too, for an Accurate & Functioning product, plus a Fast Shipping (Delivered in 2 days on a 1-3 Days Shipping). Keep up the good reputation FGS Trading and Thank You!VIDEO Review Soon!--STRALLENT.COM(tm)", "Date": "April 30, 2011"}, {"Title": "Within one yerar it stopped working", "Author": "Happy", "ReviewID": "R24S9WKVU8IOER", "Overall": "1.0", "Content": "The phone wouldn't power on after having this phone for 11 months. I changed couple of batteries to see whether that was the issue. The Sony Experia customer service was horrible. They asked me to send the phone to service center, but they didn't fix after repeated calls and 3 weeks off constant calling they asked me to send the phone to Singapore since it was a international phone. I would recommend not to buy this phone. This seems to be a known case where it won't power on.", "Date": "January 2, 2012"}, {"Title": "Think Twice", "Author": "se7en111", "ReviewID": "R1FCJK7DZQV95Z", "Overall": "1.0", "Content": "Just a reminder to everyone think twice before buying a phone without warranty, I learned it the hard way, i bought this(Sony Ericsson XPERIA X10 Unlocked)and after like 5 months it stopped responding, and i din't even use it much because i have 3 other phones, i used it occasionally and it stopped responding. When I turn on the phone, it comes to the home screen and turns off, and when i put the sim in, it dosen't turn on.", "Date": "November 10, 2011"}, {"Title": "Solid phone with poor call quality", "Author": "V. Seferovic", "ReviewID": "R3MJ0IGJ967TRP", "Overall": "2.0", "Content": "I used this phone for a couple of days.I even asked for an exchange from Amazon since I decided to pay more and buy directly from Amazon LLC instead of another seller due to the ease of purchasing.PROS:Design. The looks of the phone are nice but it is a little too big due to screen.Nice camera. 8.1 Mega Pixels.1Gzh processor.***CONS:Call quality is HORRIBLE. Go ahead and research. 8 out of 10 people have horrible call quality. It may be due to Amazon purchasing these phones from Singapore, since some program called IDEAS is preloaded for Singapore Mobile. Could be a production series mistake. People nowadays do not even think of call quality since it should beyond excellent.Outdated software. It runs Android 1.6 (Donut) which has not been designed property in the first place for the phone. Now Sony is designing an update to 2.1 which is already outdated compared to other phones running Android. An update after the phone's release does not sound promising.Timescape uses a lot from the processor and often lags. In fact it is not integrated completely with the phone and has to run as another separate program.***The processor lags too much for its processor speed. Run one program and the main menu screen does not clearly pull up. It also lags from time to time typing.USELESS DIAL-PAD that freezes and LAGS when dialing. Such a simple necessity. Sure go ahead and download another dial-pad from the Android Marketplace, but I would like a phone having a normal dial-pad integrated.All in all, I decided to purchase the HTC Desire which beats the phone in every category aside from the camera. Let's see how that will turn out...", "Date": "August 2, 2010"}, {"Title": "Works Great.... Now", "Author": "Warwick \"wijin\"", "ReviewID": "R1R2H5IBINETYN", "Overall": "4.0", "Content": "Initial problems occurred with Android Marketplace missing. Two software upgrades later it's back and all is working well. Works well at 4G speed on T-Mobile.", "Date": "March 13, 2011"}, {"Title": "Pleasantly impressed", "Author": "A. Lee \"Amz Shopper\"", "ReviewID": "R2OKMDUCOB19W4", "Overall": "4.0", "Content": "I purchased this phone for my wife.  Originally, it came with Android 1.6.  I quickly discovered that there was an Android 2.1 release available from Sony.  Because it was locked/branded as an AT&T; phone, I had to get it unbranded, which was actually quite simple using davinci.POST Android 2.1 upgrade- touch screen is much more responsive- Pinch zoom enabled and works awesome- more apps were available from the marketplace.- buggy apps didn't crash anymore- wifi detection and auto sign-on was much more effectiveCONs- waiting for newer versions of Android...2.3 is supposedly going to be available summer 2011.- Limited internal storage...but fixed that issue by throwing in 16GB microSD.I personally use a Samsung Captivate, but quite honestly, I feel that the X10 is a more solid phone.", "Date": "May 12, 2011"}, {"Title": "Sony Ericsson - Always have good phone", "Author": "rhonda \"C\"", "ReviewID": "R1IMKNH7ZD891X", "Overall": "4.0", "Content": "I had this phone almost 2 months and I have like it alot. Few things I found about this phone:The sound quality is a bit fizzy in some area..If you exit call screen and on main menu, you can't end your call by pressing buttons. There aren't any setting option to change it.Battery life is a bit short if you always have data transfer and using for web search/email all day... etc. You will have to charge your battery every day. I swtich of data transfer during weekend if I'm home and my battery life stay 100% all weekend.", "Date": "December 19, 2010"}, {"Title": "Ditch your iPhone!!!!", "Author": "Emma", "ReviewID": "R2DX9MDT0TLTX8", "Overall": "5.0", "Content": "This phone is even better then I had imagined! user interface is very sharp and fast. It is highly customizable and the timescape feature is invaluable to me to keep up with EVERYTHING that is going on with my friends in one place (FB, twitter, emails, messages!)", "Date": "November 21, 2010"}, {"Title": "Xperia X10 phone doesn't work", "Author": "Shimon Avraham", "ReviewID": "R3OT9BWNRGXMJ", "Overall": "1.0", "Content": "i got my phone but the battery seems to be mulformed ,because the phone do not charge and i can't find the root cause.[...]", "Date": "August 7, 2011"}, {"Title": "under-rated phone", "Author": "mohamed", "ReviewID": "RZGII081FEZOP", "Overall": "5.0", "Content": "I never had SE on my list for my next phone. I accidently saw the X10 at local bestbuy, I decided to give it a try.I am not disappointed at all. the phone came with Android 2.1 update. the phone and the system are great.very nice hardware, large screen. works great as a media player too. display is amazing specially live wallpaper. no compitability issues what so ever.", "Date": "March 3, 2011"}, {"Title": "Best Smartphone in the market, better than IPhone", "Author": "Adil", "ReviewID": "R2CXG8L1OIQOEC", "Overall": "5.0", "Content": "Sony Ericsson Xperia X10 is the best smartphone in the market today. I'm having this phone from more than 20 days and i really like it. It has very good 8.1 MP camera and camcorder but the only thing which i miss is Front Camera. For that I wanted to give 4 star but other than that this is an Excellent phone with a huge 4\" display bigger than Iphone.", "Date": "July 30, 2010"}, {"Title": "Cell languages", "Author": "angie katherine chavarro gutierrez", "ReviewID": "R2GKA3XM0P66VV", "Overall": "5.0", "Content": "I wonder if this phone comes with Spanish language..I want to buy and use in Colombia will be served?. thanks for your answers", "Date": "January 16, 2011"}, {"Title": "WARNING:OS Android 1.6", "Author": "Tony L.", "ReviewID": "R372RJUNNU4IG7", "Overall": "1.0", "Content": "Yes, you heard it right, Sony X10 will be shipped with Android 1.6. And you will be stuck with it for a very long and miserable time. Every major android phones are upgrading (or already did) to Android 2.2 (aka Froyo) this summer. And guess what, Sony announced they hope they can upgrade X10 to Android 2.1 (not even 2.2 !!!) by the end of 2010. By that time, Android probably already at 2.5 or even higher 3.0. This should tell you how backward and outdated Sony now is.", "Date": "August 9, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002VBXL7U"}}