{"Reviews": [{"Title": "Went back to my V3XX instead.", "Author": "80sGuy", "ReviewID": "R1UGXJNSK6GNJN", "Overall": "2.0", "Content": "I've been a die-hard Motorola phone user since the early 1990s and when Motorola announced the Razr V3, I quickly jumped on it like fly on \"you know what\"...then the V3X, V3XX and then ultimately the V9. While the newest Razr line has improved and seemed promising in many ways, it did however had many drawbacks as well. I purchased a V9X last year and felt a great deal of remorse with it almost immediately. I didn't like the ergonomics and functionality of the V9 right out of the box. The very first thing that bothered me was the overall 'feel' of it, starting with the slight 'vibrate' sensor every time when I reach for the phone; whether I'm just picking it up to look at the time or trying to dial, there is NO WAY to avoid not triggering and vibrate the media sensors located underneath the outer screen from the upper flip case. Another thing that I didn't like about it was that they moved the three soft keys (on the sides) from the upper flip to the main body of the phone. With this, I'm constantly pressing the keys while at the same time trying to hold on to the phone, many times I've accidentally ignored calls before I get the chance to answer, or accidentally activated something from the keys when holding it while I'm on the line. On the older Razr versions, the soft keys has never hindered me when I'm handling the phone because the upper part would flip up and away while I'm holding the body of the device firmly on its entirety.I'm going to admit though that I do actually like a couple of things about the phone; one, for the nicer LCD displays with much higher resolutions than my two other Razrs, I can actually see the graphics in broad daylight! The V9 also boasts a 2MP camera which took outstanding looking images -- the best I've seen from a cellphone!But here's the number one drawback: Reception! I couldn't get any more than half a bar inside my apartment, both my Razrs get over 3 out of 5, sometimes even 4, but the V9 suffers greatly when it comes to making and receiving calls from my home. Needless to say, I sold the V9 and happily went back to using my V3XX again, it's slimmer, lighter and more solid of a phone after my brief comparison with the V9.", "Date": "April 29, 2011"}, {"Title": "Nice phone", "Author": "J. Churchill", "ReviewID": "R1WMT09673G4JW", "Overall": "5.0", "Content": "This phone is for my husband.  He has large hands and is a carpenter.  He likes that there are few places for saw dust to get down into.  The ring tone is loud enough he can hear it over machines.  It fits his hands very well.  Wish there were better options for covers though.  The ones we see listed on Amazon have not had good reviews.", "Date": "March 28, 2010"}, {"Title": "Great sound quality, so-so battery life", "Author": "Jeffrey J. Dunn \"J.Dunn\"", "ReviewID": "RIDYC72LSF4WX", "Overall": "4.0", "Content": "I have been using this phone daily for a year. It has great sound quality -- people do not realize I'm on a cell phone. Reception also seems to be quite good, picking up a signal in marginal areas.I wish the battery life were better, though. My old KRZR would go at least 3 days without being charged, under moderate use. This phone seems to make it 1 1/2 - 2 days. However, it does give a \"low battery\" warning several hours before dying.The speakerphone is good, the camera is fairly good, and I heavily use the calendar function.", "Date": "October 7, 2011"}, {"Title": "I always trust Moto.", "Author": "Bryan C. Smith", "ReviewID": "R158TNHJN9CUYC", "Overall": "4.0", "Content": "I've had this phone for a great while now (or should I say phones, I accidentally ordered two, lol). For anyone who owns any type of Razr, works just about the same, but with a slightly more fluid interface and higher resolution.My only deal is, the two phones, they're not alike. One phone (the one I prefer to use, and am currently,) has an AT&T; button on the key pad and splash screen (coincidentally my provider is also AT&T;), has all of their featured apps and everything. Now, on the other phone, it has a slightly modified key pad that doesn't have an AT&T; symbol or splash screen and no apps whatsoever. The unbranded phone works perfectly, don't get me wrong, but what if I wanted to use AT&T; Navigator (GPS)? What if I were lost? What if YOU were lost?! If GPS doesn't matter to you, pay no mind to this paragraph.Anyhow, this phone is great, not \"excellent\", it's battery power can be a small hassle if you talk a lot (or text a lot) and go into dead zones, like a basin, a cave, a tunnel, a deserted town, a warehouse, or a friend's house that has lead walls (no, I'm kidding, but I swear it seems like it). Probably not the best thing for travel, so keep the screen brightness down, conversation minimal and you'll be okay. Not sure if the vibe function is a contributing factor to energy loss, mine is on vibe 90% of the time. Mine will last 2-4 days without charging on average, so gotta car charger just in case. ;)", "Date": "July 25, 2010"}, {"Title": "My new RAZR2 V9x", "Author": "Prasil Bernard", "ReviewID": "R1FYUIP6BNGKQS", "Overall": "4.0", "Content": "This Motorola RAZR2 V9x is thin, beautiful, very easy to understand and use. I like the backlighted keyboard. A good notation fort the very fast browser too.", "Date": "November 14, 2011"}, {"Title": "dont buy this phone save you r money", "Author": "Balvir", "ReviewID": "RASKEOH8CG359", "Overall": "1.0", "Content": "This is garbge phone don't ever buy this phone this never work I waste my money I bought this phoneand returned it. They didnt give back my money", "Date": "January 25, 2014"}, {"Title": "RAZR2 good product", "Author": "M. L. Walker", "ReviewID": "R30ZMU03ADKFPQ", "Overall": "5.0", "Content": "We purchased the international Motorola so that we could receive news of our grandchild's birth while in Europe. It held up during the rough handling on the tour of 4 countries. When our digital camers stopped working, the filled in to record our trip. We had upgraded the photo card before we left home.", "Date": "June 20, 2010"}, {"Title": "Great Phone!", "Author": "Tracy", "ReviewID": "R1KOBKHD200GYN", "Overall": "4.0", "Content": "I've had this phone for nearly two years now. It still works very well. The touch screen is not what you would expect. You can't text from it but you can look at pictures and play music. The comment about the battery is accurate! If you like to text it is fairly easy to do that. It will run the battery down very quickly though. If not for that and the price of the phone I would give it a five!", "Date": "March 18, 2011"}, {"Title": "Interesting buyer beware info for V9", "Author": "DxP", "ReviewID": "R2ZZBQVGB9RF35", "Overall": "3.0", "Content": "The international version comes with a printed manual in a foreign language.The power plug is a European version but comes with a US adapter.The V9 is heavier than the V3.The web settings had to be sent to the V9 phone via an AT&T; technician, to enable the phone to access the web and recieve or share photos.I expect the V9 to be as user fiendly and convenient as the V3.", "Date": "November 4, 2010"}, {"Title": "Buyer beware", "Author": "Robert A. Bunton \"BB\"", "ReviewID": "R311FQ5D4XTATY", "Overall": "3.0", "Content": "The international version comes with a printed manual in a foreign language. The power adapter is a European version and does not work in the US. I don't think the V9X works as good or as friendly as the V3.", "Date": "September 27, 2010"}, {"Title": "JJ from Jamaica West Indies", "Author": "Johnathan", "ReviewID": "R3JBOVA4FB1KKI", "Overall": "4.0", "Content": "I have always used this phone. I find it to be a very user friendly instrument. Very good phone. Love it", "Date": "June 20, 2013"}, {"Title": "Not 5 Part", "Author": "Roxanne Sinanan", "ReviewID": "R22UBO57H6EPRF", "Overall": "3.0", "Content": "I received the cell phone in record time in great condition, but it said five part... I think I at least expected some headset, data cable...something. All I got was phone and charger...", "Date": "May 5, 2010"}, {"Title": "bull...**", "Author": "Sreekkanth", "ReviewID": "R1B0CFHJAEFM5C", "Overall": "1.0", "Content": "Worst product i planned to buy from amazon... i ordered twice and both the times it was broken.. i never got a good phone on this.. very disappionted due to this product i hate moto now...", "Date": "November 14, 2013"}, {"Title": "Problems with what comes in the box", "Author": "Dominican Republic", "ReviewID": "RX675E2OMAQ1Y", "Overall": "3.0", "Content": "The cell phone was given to me in a timely manner and without any problem, but did not get all the accessories inside the box, I was handed the memory stick, handphone and data cable.Very good service but I gave all the accessories.", "Date": "July 29, 2010"}, {"Title": "Do Not Buy this phone", "Author": "J. Shulze", "ReviewID": "R1GR83AO88NX6E", "Overall": "1.0", "Content": "Thought this phone was like the the motv9 with some improvements. WRONG! Does not work in Japan, wrong frequencies and has a truncated software set where you cannot even change the volume of the tones that you hear when you dial a number.  It is set at max and unchangeable. very irritating. the back label on this phone indicates it was built in brazil and probably for some provider in that market. The self learning keyboard is set up for some foreign language word recognition, certainly not english.  I hate this phone after having owned the V9, which after 4 years of faithful service, unfortunatley broke.  You can get the V9 on amazon for the same price, so no reason to buy this lousy phone...", "Date": "June 7, 2010"}, {"Title": "We never received de product!", "Author": "Jaime Senra", "ReviewID": "RG4LEK02XNY9J", "Overall": "1.0", "Content": "I received an email announcing the cell was shipped. I wait more than 2 weeks and it never arrived, but my credit card was charged. I had to write 2 emails to make them check the correct status of the order and days ago I received an email that I was going to receive the corresponding refund, with not clarification of the issue.Great business!!!", "Date": "March 25, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002UHKN9E"}}