{"Reviews": [{"Title": "Cliq 2 Clicking along", "Author": "P. Temple", "ReviewID": "RXOUMDUI70UM3", "Overall": "5.0", "Content": "The cliq 2 is a bit slow in comparison the 2012 Android phones (only has a 1 gig processor) but works very well indeed!I have watched Direct TVs NFL package and Netflix with no problems. Since I have 3 Email accounts the Motor blur has worked well for me as well. It took some experimentation to get the settings right but it now is a very useful tool. I did purchase extra batteries and a car charger since this phone does use up the battery quite fast but have not seen this as a big problem. My favorite feature is the kindle app as well as cool reader app so you can use the phone in place of your kindle! Over all I am quite pleased with this phone!", "Date": "October 2, 2012"}, {"Title": "I'm hoping it breaks or gets stolen", "Author": "Paul Mernaugh \"MN Taken\"", "ReviewID": "R2KR2ZX3VH04V", "Overall": "1.0", "Content": "My wife, and I have this model and can truly say that this is the worst cellphone model we have ever used. Constant crashes, slowness, and dropped calls. My wife went to a Samsung and does not have any of these problems. Plan on up to a minute for apps to load even after forcing others to quit.", "Date": "October 27, 2012"}, {"Title": "EXCELLENT SERVICE AND PHONE", "Author": "AVS12", "ReviewID": "R49CNS6XAP0DC", "Overall": "5.0", "Content": "The phone was better than expected and even though seller did not process order right away it came by the deadline i set of Friday. I am so happy with the phone, not only was it in excellent condition but it was also unlocked so i could use my simple mobile service with it. Also It came with a micro sd chip. In the review none of the plus features I got were mentioned but it was a nice surprise. I will defintley buy a again from this seller. If they would process their order within 24 hours they would be awesome number one but I really can't complain the phone is EXACTLY as expected plus more! GREAT JOB!!!", "Date": "August 2, 2012"}, {"Title": "out of date cell phone", "Author": "juan sanchez", "ReviewID": "R19YIP7HBHR40L", "Overall": "2.0", "Content": "this phone is out of date, i guess i rushed in buying it, phone is in good condition its just that is not what i need", "Date": "December 4, 2013"}, {"Title": "Works great!", "Author": "Sunder", "ReviewID": "R1KUE9QQQWDTQT", "Overall": "5.0", "Content": "I would recommend this product to any one who needs a replacement phone. The number buttons were a little worn out and hard to read but once I figured out what was what, it wasn't a big deal. It's a used phone so I expected some wear. Works great and I am extremely happy with my purchase :)", "Date": "April 7, 2013"}, {"Title": "Great Replacement", "Author": "William B.", "ReviewID": "R1R6XCIE84VCQL", "Overall": "5.0", "Content": "had a phone just like that we wore out from use--this one is doing great as a replacement like it was new.", "Date": "March 21, 2013"}, {"Title": "poor", "Author": "kiwi2cute", "ReviewID": "R3T258ST78L72C", "Overall": "1.0", "Content": "This phone didn't even work properly. It constantly gave me problems. I will never order from her again. The phone was constantly freezing, turning off, dropping calls. It was a waste of my money.", "Date": "March 14, 2012"}], "ProductInfo": {"Price": "$249.99", "Features": "Compact 3.1-Inch LCD Display\nSlide-out full QWERTY keyboard which makes typing a breeze\nCompatibility with GPS, Bluetooth 2.0 and Wireless b/g for Wi-Fi Internet connectivity.\n5.0MP Rear-Facing Digital Camera for taking quick photos anywhere you go", "Name": "Motorola CLIQ (DEXT) MB200 / MB220 Unlocked GSM Phone with Android 1.5 OS, QWERTY Keyboard, 3.1\" Touchscreen, MOTOBLUR UI with Live Widgets, 5MP Camera, Video, GPS, Wi-Fi, Bluetooth, MP3/MP4 Player and microSD Slot - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51Zj-EAGWFL._SY300_.jpg", "ProductID": "B002UKCV5K"}}