{"Reviews": [{"Title": "Nice Phone", "Author": "Dxer", "ReviewID": "R1H2WYHJCURGWZ", "Overall": "4.0", "Content": "I have been a Virgin Mobile customer since they first started as a prepaid cell phone provider. I have been quite pleased with their service and variety of pricing plans. Unfortunately Virgin Mobile phones have never been the greatest, the only good thing is that if you buy a cheap phone, you don't feel to badly when it dies,gets lost, or broken. When my VM Slash phone finally gave up the ghost a few weeks ago I decided it was time for another upgrade. After doing a lot of research on the internet I decided to go with the Mantra. I like being back to a flip phone so you don't have to worry about locking the keyboard so you don't pocket dial. The phone it'self is still pretty basic, it comes with the nifty tip calculator which lets you divide the cost between the number of parties at your table. Call clarity is good. Reception is the typical Virgin Mobile, works in most places when I need it, but spotty sometimes in the more rural areas. The ring tones that come with the phone are typical Virgin Mobile, obnoxious...you will want to download some better ones which you can only do from the VM site. The games on the phone are all demos, but they look good on the screen so it might be nice to have a full version of Tetris which you can download from VM.It is Bluetooth enabled which is a nice feature to have on a phone. The battery seems to hold a good charge for daily use, I can go 3 to 4 days without charging, but that is in standby mode, I am not sure how long it would last if you were a heavy user. The phone is very well behaved, I say this because my Slash would beep once a minute to let me know it was working (I guess that's why), anytime I had the ringer turned on. I never did figure out how to turn off the signal beep on it. The Mantra doesn't beep and also on the Mantra you can turn off the obnoxious start up and shut down sounds that VM deems necessary to put on all of their low end phones. The directory will support up to 500 entries and you can add up to 5 phone numbers per entry along with 2 email addresses and a URL address.The camera is useable, not great but much better pictures than the Slash took. Basically I use it only to create new wallpapers for the phone and send an occasional pic to TwitpicSo far I am very pleased with the new Mantra, it's a good basic phone, not a lot of bells and whistles, but enough to make it very user friendly. Nice calendar and appointment scheduling, cool countdown timers so you can tell how many days till your anniversary, birthday, Christmas or any other date you might want to countdown to.Watch for it on sale, Amazon had it listed for $59 same as the VM site... I bought it on sale at Best Buy for $49, and on Black Friday picked up a second one for my wife at Radio Shack for $29.I would recommend this phone to anyone looking for a nice basic user friendly phone with picture and texting capabilities. It will browse the web also by the way, but you need to pay for a \"data pack\" at VM to use it. That I haven't tried.", "Date": "December 2, 2009"}, {"Title": "Flawless Phone", "Author": "peter", "ReviewID": "R38CWP6I8KVV4I", "Overall": "5.0", "Content": "This phone does everything it says it will do.  It has a responsive CPU and loads stuff faster than any other virgin mobile phone. The pictures aren't so great but thats what digital camera are for.  This is one of the best looking phones too.  It looks good and feels good with it's large buttons.  It has the mark of quality and will never let you down.  The battery can last about a week if you don't use it that often. All functions are easy and accessible.  My only gripe is that it discontinued the stopwatch function for some odd reason so if you like to time things (I'm a track runner) then you may be sad.  This is probably the best virgin mobile phone out as of today.  It also has a good price.", "Date": "May 16, 2010"}, {"Title": "Great display", "Author": "Sharla Tracy", "ReviewID": "R2BVVQBF0OJSYN", "Overall": "4.0", "Content": "I agree with the other reviews here, this is a good phone all around, but what I really want to amplify is that the display particularly inside is very good.  Pictures actually look sharp and text is easy to read.  Coming from a Virgin Mobile Flare it was like night and day.", "Date": "November 19, 2010"}, {"Title": "good basic phone", "Author": "Lona Rawls \"rawlsgirl\"", "ReviewID": "R3T891I1HAQ94S", "Overall": "4.0", "Content": "I got the Samsung Mantra about a week ago and so far I like it for a basic flip phone. The design is sleek and nice and I like that it has a camera and bluetooth capable. The screen is nice and it's really easy to use. Use this code to get free 60 minutes when you activate a new virgin mobile phone online EJ76pPXU when you are activating your phone enter it into the section that says kickback code.", "Date": "June 23, 2010"}, {"Title": "Great value for its cost", "Author": "Jim", "ReviewID": "RT7E0YJNVCNJS", "Overall": "5.0", "Content": "I am an older person, retired and no longer use or need all the features that are offered with many cell phones.  This one has voice recognition, room for 500 contacts and a far better antenna capable of making/receiving calls in areas I previously was not able to do.", "Date": "October 15, 2011"}, {"Title": "Excellent Basic Phone", "Author": "Castello \"Rojo_P\"", "ReviewID": "R2XHT5LVESQQTB", "Overall": "4.0", "Content": "This phone is good at what it is intended to do, which is to allow you to make or receive calls away from home. I use this phone strictly as a convenience when away from home, not for up to the minute status reports of what my family, friends and associates are doing. Most everyone can reach me in the office or at home and 99% do not need to speak to me immediately. I am as productive and social as anyone, but have never found a cell phone to be a good replacement for an alert and active mind.The best feature of this Mantra with Virgin Mobile is that it is costing me about $5 a month which is outrageously inexpensive for making convenient & necessary phone calls (Virgin Mobile plan that automatically adds $5 a month to my credit card). The extra $50 a month savings is invested in the youngest child's college fund, which should amount to around $12,000 by college time - just from using a no frills phone.Certainly, the phone has limited functionality. Don't expect much of a camera, and ringtones need to be purchased from VM who will rape you. However, customer service has been good for me when needed. Clarity of the phone is good and the battery has lasted.If you need something other than the basics don't purchase this phone (or you should not have purchased this phone) and you should not be dealing with Virgin Mobile. (And beware of reviewing morons who look at motor bikes, buy a bicycle for the price, and complain about the pedaling and how long it takes to get somewhere)!", "Date": "February 8, 2011"}, {"Title": "Great Phone by Virgin Mobile", "Author": "Gorgeous", "ReviewID": "R1N5PWCUYK0PHS", "Overall": "5.0", "Content": "I purchased this phone to replace my sprint samsung moment and it functions faster more accurate. The sound quality is great and I can message, IM, email, and go on facebook unlimited for 25.00 a month. Who really needs a contract??? I have had a contract since 2006...I'm over it.when u activate use kickback code 5JstDIVc and get 60 minutes free when activating online!", "Date": "July 15, 2010"}, {"Title": "These phones are $10 at the Virgin Mobile website.", "Author": "D Morrow \"Donna\"", "ReviewID": "ROFCCG9KRVTBW", "Overall": "4.0", "Content": "I like this phone. Feels good in my hand, clear, loud volume, large buttons, pictures ok, tho I don't often use the camera. My only issue is the proprietary headset jack. It's not a 2.5mm, so my headsets do not fit. I ordered an adapter from Amazon, but it does not work- I hear caller, they do not hear me. It is the Samsung Omnia I910 SCH-I910 T139 SGH-T139 A737 SGH-A737 SGH-A736 Cell Phone 3.5mm Female Stereo Headset / Speaker Adaptor Cost about $5.00. Oh well. Next I'll try the headset for the M340 from Samsung.Anyway, This phone is $10 on the VM website, so I wonder if they are discontinuing it.DMorrow", "Date": "July 17, 2011"}, {"Title": "Virgin Mobile Samsung Mantra - a Warning Regarding Uploading Photos", "Author": "Tony", "ReviewID": "R3BL93QOZ1BZ8B", "Overall": "4.0", "Content": "After substantial time, and some money spent (a USB cable and a Bluetooth adapter), I have found that it is impossible to upload photos directly to your computer from the Virgin Mobile version of the Samsung Mantra, either by USB or Bluetooth.I have confirmed this through Virgin Mobile customer service.The only way to upload photos is to the web, at 25 cents each. Very disappointing, because considering the $20 price tag (if bought elsewhere), this is otherwise a great phone.", "Date": "December 11, 2010"}, {"Title": "Good Basic Phone", "Author": "M. Holderead", "ReviewID": "R2Z2W7PZED0YZO", "Overall": "4.0", "Content": "This phone is perfectly fine if all you want to do is make calls.  Call quality is more than sufficient in my area, and if you are someone who doesn't live on their phone the battery lasts 5 to 6 days without needing a charge.  One other note about the phone is if you are someone who wants a decent camera phone look elsewhere.  The quality of photos are poor at best since the phone is not even a 1.3MP phone.  Oh and use this kickback code for free mins SJHMnJsV.  Thanks!", "Date": "December 11, 2010"}, {"Title": "greatest phone i've bought", "Author": "eric", "ReviewID": "R3RXDHBM87CD86", "Overall": "5.0", "Content": "I bought this phone back in 2009 because my old one went bad, and today I still have the same phone. Everything has happened to this phone, dropped, threw it a couple times when i was mad, and i even accidentally dropped it in the water and wasn't able to get to it for about ten minutes, might i add it was still on. After drying it out for a couple days, the phone STILL WORKS. The battery life is extremely good, i can go almost a week sometimes without even charging it. You know when someone is calling you because the vibrate on this phone is extremely strong, there's almost no way your going to miss it. The only bad thing i have to say about it is that now sometimes it won't go off if i get a phone call or text message, but that is mainly because of the water damage. But all in all, it has the normal functions of a basic phone so if your looking for just a basic, cheap phone, this is the phone you wanna get.", "Date": "July 14, 2012"}, {"Title": "Happy With Phone", "Author": "Linny", "ReviewID": "R3AUH4V7GA7ZWT", "Overall": "4.0", "Content": "Have been a Virgin Mobile customer for a few years. I'm definitely not a gadget freak. Purchased this phone in October for simple upgrading purposes. The features are just fine and it also has a camera. So far I am pleased. Phone arrived on time, in very good condition.", "Date": "February 18, 2012"}, {"Title": "My First Purchase", "Author": "c1organ", "ReviewID": "R7D2HIMY5N36A", "Overall": "5.0", "Content": "Hi, my name is Barbara from Frankfort, IN. and I would like to share my first experience buying from Amazon.com. I purchased this Samsung Mantra Phone. I recieved it before the time estimated, that was the first thing. Got the phone and I just love it. Easy to find, easy to purchase and even got it early! What more could you ask for?", "Date": "January 8, 2012"}, {"Title": "Virgin Mobil Samsung Mantra Prepaid Phone", "Author": "Sheila M. Tuffarelli \"A Time Remembered\"", "ReviewID": "R2O6GGGOQJDT4Q", "Overall": "5.0", "Content": "This is my second Samsung Mantra. I love it because it's easy to use, takes great pictures and never lets me down..........", "Date": "September 6, 2013"}, {"Title": "3 years and still can't get rid of it ....", "Author": "Vasanth Rajkumar \"Vasanth\"", "ReviewID": "R1QD0BL2UXN9X7", "Overall": "5.0", "Content": "I came back to the US after a year in August 2010. I got this phone for the time being with the idea of replacing it with a more expensive one.It has been 3 years and the phone goes still strong. It got lierally thrown by my kid several times. Fell off the bus once. Still not a chip. A little bit of scratches though.The battery is unbeatable. I only charge it once a week.This is the best wakeup alarm I have ever used. I wake up all the time guaranteed. I have overslept my expensive table alarm several times. But the shimmer tone in this phone is very reliable. Will startle you immediatly.I look like stone age before friends for not having a smartphone or iphone. My reasoning for it is 1) I want to see the real world when I am outdoors. I want to connect with people in the eye. I feel sad when fellow people not looking at each other but glued to their phones.I hate to keep thinking how long my battery is going to last. Will I have battery left until I get back home ? This saves me the trouble. I can forget about the battery.I am going to stick to this phone for few more years. Or may be until the community forces me into getting a smart phone.", "Date": "August 9, 2013"}, {"Title": "nice phone, but......", "Author": "NamVet", "ReviewID": "R3UQT0OM3KJMFU", "Overall": "4.0", "Content": "I've had this type of phone now for approx 4 years. its a nice instrument for a senior like me. not too many \"bells and whistles\". unfortunately the phone service has put the screws to me so i'm off to a different phone and plan!", "Date": "March 20, 2013"}, {"Title": "Perfect!", "Author": "Courtney Stewart \"Courtney Stewart\"", "ReviewID": "R277KLY396HADP", "Overall": "5.0", "Content": "I will never give up this flip phone from VM. I have a smart phone too but but i only use it now to download free music where there is free or open wi-fi to my sd card. I am going to tell you why I love my Samsung Mantra. It is so easy to text and I can do it with just one hand. With the android I had to use two hands or if if i tried to text with one hand i would occasionally make typing mistakes which i had to correct before sending. Besides smart phones suck battery life so fast that you have to take your charger with you. There are battery apps that might work but i have no battery issues with my Mantra. I suggest, however, to buy an extra battery for it(quite cheap here on Amazon to charge and take on the go) if needed. I text more that I talk so I never really had to take my charger with me. I love how \"loud\" the Samsung Mantra vibrates. You can feel it vibrate when it is in your pocket and you can hear it as well. Never miss that important text on a bus, a Madonna concert or in a busy work environment.  Just change your settings to \"reminder\" for voice and text messages. With some phones you do not feel it vibrate when it is in your pocket. Android phones usually come with a wacko messaging app and you have to find one on Google Play(Go sms pro) that has better features such as a vibrating feature. You can use an affordable samsung or bolt blue tooth with Samsung Mantra. The voice is crisp and clear in the ear piece. There are also voice commands on the Samsung Mantra but I rarely use them. There is also a shortcut installed to FaceBook and My Space on the Samsung Mantra. Voice calls are clear and depending on your volume settings the phone rings quite loud!You can also download ringtones for a price on the VM site right from your phone. I suggest the current $40 plan for unlimited talk and text and 50 mb of internet use. I have a computer at home as well so this plan is just right for me. When I first bought this phone it was $29.99 about 3 years ago and then it was reduced to $9.99 at certain retailers and at the VM website. This phone is no longer in stock. I do not believe that they manufacturer it anymore.  Do not get ripped off! I have seen it on a certain popular website where a seller is selling it for $85.00 For me this phone is just perfect. The vibrating feature is perhaps the ultimate reason why i love it so. I cannot have my ringer on while working at work and i do not want to miss that important call whether it be from my Mom or that important text message!Ps: you can download wall papers, live ringtones and check email also with this phone!", "Date": "December 10, 2012"}, {"Title": "good phone", "Author": "anonomous", "ReviewID": "R3HXHBAUU0HHXU", "Overall": "5.0", "Content": "This is a good prepaid phone,  I havent had any problems with it. The camera takes good pics also. Def worth buying", "Date": "December 3, 2012"}, {"Title": "Samsung Mantra - Amazing Simple", "Author": "Angie", "ReviewID": "R3UH1U8C9SDMZT", "Overall": "5.0", "Content": "This phone is simple, yet perfect.If you're interested in having a simple use of the internet, simple text messaging, & simple calls, this is for you.", "Date": "August 4, 2012"}, {"Title": "best flip phone ever!", "Author": "Emily", "ReviewID": "R3R2QYHVJ4MJ7S", "Overall": "5.0", "Content": "I absolutely love this phone! The keys are super easy to press (ideal for lightning speed texters). There is an alarm mode so you can silence your texts and calls but still hear your alarm. You can view the time by pressing the side button. There is a direct link to get straight to myspace and facebook. Best phone I ever had! I'm actually sad that other companies dont offer it  :(", "Date": "June 28, 2012"}, {"Title": "Easy dependable phone for, seniors especially, easy viewing", "Author": "Ann", "ReviewID": "R2SHP5PBZRO0E6", "Overall": "5.0", "Content": "I love this phone it's not expensive doesn't have all the bells and whistles of an expensive phone with all the extras they offer, however, I highly recommend it for seniors as the keys are larger and letters and numbers are easier to view, and it's not so difficult to understand  as these other high-tech phones.", "Date": "March 28, 2012"}, {"Title": "Simple Replacement Phone for the Stepdad", "Author": "UnsFor", "ReviewID": "R20S1IUNAMYNQB", "Overall": "4.0", "Content": "These types of phones are overpriced now and getting harder to find, but they are suitable for those only wishing to make phone calls and who like flip-style phones. My step father had a different brand, the screen went out, got a new used one and the screen went out again, and then I found him this one after thinking if I could find the last one again, the screen would just probably go out like the other ones. He only uses it for calls, doesn't like change, doesn't want to text, and etc. It's fine for the individual it was purchased for.", "Date": "December 2, 2011"}, {"Title": "Ok Phone", "Author": "Jennifer Aiello", "ReviewID": "R1V32H1E7QJ2S4", "Overall": "4.0", "Content": "This Phone is OK.  Would Like More Stuff with this one.  Now i have 2 phones and 1 is Diffrenet.  Holy cow, OMG Like I was so upset with this phone.  :(", "Date": "December 28, 2011"}, {"Title": "BAD BAD BAD!!!!", "Author": "jrood01 \"jrood01\"", "ReviewID": "R3CKOS21M9E562", "Overall": "1.0", "Content": "First of all this phone is $20 at bestbuy.com. Second DO NOT BUY this if you don't get PERFECT service. I can't get ANY ringtones or other downloads, from the PHONE or the WEB. The phone itself is very stylish but not very useful if you can't use it to talk/text/download/web..also the camera isn't very great but it's my first camera phone so I can't really compare it to anything else. Also there is no zoom on the camera unless you change the picture color (blue, green, sepia) or use a template. Another thing is that the games to get are actually $5.99 or a $2.99 month trial. Overall I'm disgusted with virgin mobile and the phone. The customer service sucks as well, they don't understand (mostly it's a language problem, not that I'm against other languages or anything but they don't understand english well) and they are also very rude and promise to send you a text or email to help you with your phone problem (called about the ringtones and they said they'd text me) they never text or email back.", "Date": "December 7, 2010"}, {"Title": "Another Piece of Third World Crap!", "Author": "Senaelen \"-Senaelen\"", "ReviewID": "R7CATAARLMNDZ", "Overall": "1.0", "Content": "I don't know where to start.. I purchased this phone about half a year ago from Radioshack, with an extended warranty that they refuse to honor in store. Whenever I try to go through the warranty service they give me limited information and want to leave me without a phone for several weeks! This pile of garbage hasn't worked right since day one! My text messages send blank, or not at all.. I lose calls, the phone turns on by itself and has been great in aiding me to pay the bills! I run a business with this phone, or at least I did until I started not getting calls.. the paint is peeling off of the keypad and the speaker vibrates like it's blown. This is the second mantra I bought and every single one is a pile of garbage! do yourself a favor and don't buy this..", "Date": "November 25, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Slim flip phone for voice calls as well as easy access to messaging, social networks, and personal e-mail\nPay for only the calling time you use with Virgin Mobile's minutes or monthly plans--no annual contract required\nVGA camera for still photos only; Bluetooth for hands-free devices; Web browser; bi-lingual interface\nUp to 5.5 hours of talk time, up to 300 hours (12.5 days) of standby time\nWhat's in the Box: handset, battery, charger, printed documentation", "Name": "Samsung Mantra Prepaid Phone (Virgin Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/41QPPwfxY7L._SY300_.jpg", "ProductID": "B002L152GI"}}