{"Reviews": [{"Title": "Simply the best tough phone.", "Author": "Jc Scarisbrick \"scarisbrick\"", "ReviewID": "R1RHWBKHN43DNO", "Overall": "4.0", "Content": "If you want a touch-screen office phone, this isn't for you.  But if you do outdoors, skiing, sailing, windsurfing etc.. If you fish, or paddle or whitewater.  Or if you're in construction.  Or if you're an early responder.  If  This IS the phone.  If rugged quality is what you need, then you need this phone.  Does what it says on the box.", "Date": "June 8, 2010"}, {"Title": "Buyer Beware!", "Author": "Dave", "ReviewID": "R2OHDCH6RZHG1X", "Overall": "1.0", "Content": "Buyer beware!  This phone looks cool, feels rugged, and heck it even keeps out a little water.  But oh does the software suck!!!  The functions are useless and out-dated by 5 years!  I've never been so disappointed in a phone that costs so much but delivered so little.  My phone has crashed once a week.  It is super buggy, and now the charging port is faulty. And I've only owned it for two months!  Battery life is greatly exaggerated.  Screen is suseptable to pocket change. Buttons feel cheap.  And at this moment the phone died, with no sign of recovery.  Save your money, headaches and time.  Dont buy it.", "Date": "October 6, 2009"}, {"Title": "Will Last!", "Author": "lars", "ReviewID": "RXZJPYGMV1EGC", "Overall": "5.0", "Content": "My boyfriend averaged a new cell phone a month-- this is the only phone that has ever lasted. It's been in the fish tank, dropped on cement a millions times, thrown against the wall, etc. and still looks brand new! If you are hard on phones this is for you!", "Date": "July 7, 2010"}, {"Title": "It is what it is", "Author": "Doyle \"Mustang fan\"", "ReviewID": "RSXKUR7PAP5FC", "Overall": "5.0", "Content": "I've had this phone for a month now. I am elated over the ruggedness of the phone. You should know going in that this is not a 4G touch screen superplex phone. It is what it is. The most durable phone on the planet. I can make calls in the rain, drop it on the sidewalk when my hands are full, etc... That is what I wanted, and that is what this phone gives. By the way, it isn't bare bones. It has some pretty standard software (voice mail, speakerphone, SMS, contact list, speed dial, camera) and two features I really like. What you store on the micro SD card (limited to 2GB) can be downloaded in seconds via USB. It also has a very usable flashlight, something I always seem to need but never have. In short, it ain't a Blackberry, but you can't use your Blackberry in the rain.", "Date": "November 22, 2010"}, {"Title": "Good Idea, Poor Execution", "Author": "Hmmm.", "ReviewID": "R3NJ50OD823ZI", "Overall": "2.0", "Content": "I really needed a tough phone and this one is but has several important defects. 1. The speakerphone is unusable in that you can hear the caller but they can't hear you. 2. The charger / ear piece port fails.  I am on my second unit.  3. The website says that you are guaranteed a \"an in store replacement\" on the spot should your phone ever fail.  NOT!  4. Most importantly- CUSTOMER SERVICE IS HORRIBLE. Think \"little elves in a hollow tree\" with half the personality and none of the efficiency.  The first time I had to return it, it took a nearly a month to get it back and three months later the same port problem has resurfaced. Until the elves find their Green Giant or magic wand- skip this phone and it's cousin available in black.Sonim Rugged Unlocked GSM Phone with Built in GPS and 2 Mega Pixel Camera (Yellow)", "Date": "October 14, 2010"}, {"Title": "Sonim Rugged", "Author": "Shavedmyhead", "ReviewID": "R27XP9LD7C08RL", "Overall": "4.0", "Content": "Plus - Now this is a phone... LOL. I got this for my father because he owns a sheet metal shop and always beats his phones up. I was tired of replacing them for him. This phone is indestructible and water proof. He loves it and has already smacked it a few times and nothing went wrong. This was a great purchase for him.Minus - He was on Sprint and the cell needs to be on a GSM network so I had to cancel that line and add him to my AT&T; account to give him access to this unlocked phone. The internet is a pain in the --- to get going but thank god he has NO intention of using that.. LOL. He has enough issues just learning how to answer calls. He is not good with technology..", "Date": "January 2, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Unconditional 3 Year Guarantee No Questions Asked!\n18 Hours Talk-Time and 2 Months Standby Time / Built in GPS\nWaterproof- Completely Submersible\nExtra Large and Protruding Keypad\nOperates in Extreme Temperatures -20C to +55C", "Name": "Sonim Rugged Unlocked GSM Phone with Built in gps navigation and 2 Mega Pixel Camera (Yellow)", "ImgURL": "http://ecx.images-amazon.com/images/I/41n54EkhoeL._SY300_.jpg", "ProductID": "B002LTDBSQ"}}