{"Reviews": [{"Title": "LG GD510", "Author": "bahtgunner", "ReviewID": "RXJZ5E3MWJ5X7", "Overall": "4.0", "Content": "The phone a iPhone type phone. Once I got use to navigating the phone it was a breeze. A quality product that my girlfriend even dropped and it still works. I took it to Thailand and popped in a local SIM and all worked as advertised. Only thing I didn't like is it doesn't list incoming calls by name even though they're stored in my contact list; like my other LG phone. All in all, I recommend this phone.", "Date": "September 10, 2010"}, {"Title": "DON'T PURCHASE THIS PHONE!!! There's a lot of better options for the price!", "Author": "R. Mocan", "ReviewID": "R2IWST4UX5N0Q9", "Overall": "1.0", "Content": "Nowadays with cell-phones, the best phone you'll find depends on what you value the most.I was looking for a basic phone but was attracted by the \"green\" side of this one: it's made of recycled materials, including the box, and I also ordered the solar panel battery door separately to reduce my carbon footprint by charging the battery via solar power.Having said that, I strongly encourage you to look elsewhere for a phone and avoid LG altogether. My reasons follow:HARDWARE: SO-SO- The first unit I got didn't work. The speaker was broken and emmited no sound whatsoever. I searched the web, and have found several simmilar cases, so this is not an isolated problem.- The tactile screen is not responsive. As others stated you either have to use a lot of force to register a \"click\" or otherwise the thing starts jumping around.- Other common problems I read about was that the other party has difficulty hearing what the user of this phone is saying, and I can confirm that. It's not that you can't hear the caller, but it's quite low volume.- All the phone exterior is plastic, except for the touch screen. I purchased the solar cell battery cover, which makes the whole phone all the more fragile, having glass on both sides. The solar cell adds about 2mm to the waistline too.- Camera is so-so, because it has no autofocus. Fixed focus means that you can't shoot close-ups of anything (because the pic ends up blurry), including business cards.SOFTWARE: ANGERING- The second phone I received fre-e-e-e-ezes every other day. It starts lagging and responds 3-10 seconds after the input. Battery pull does the trick, but only for a little while.- I tried to update the phone's firmware or operating system and found the software experience on the PC very frustrating. I didn't get anything to work, but even if I had, the programs are slow, half-baked and poorly translated into english. I even got an error screen with half the text in Korean! Running Win7, the best way to make them work is go run with \"Troubleshoot compatibility\" and let Win7 choose which previous op. system to emulate.- The company's web pages are also very slow to load, if they do at all, and getting support is nearly impossible. Good luck trying to download LG's programs from their websites, because I had to resort to 3d party sites to find what I wanted.ECO-FRIENDLY: REALLY?The prospect of eco-friendliness is what made me purchase this phone (being made with recycled materials, soy-ink printed box, etc), but sending a phone back and forth surely beats any benefits to the environment that the phone will produce in it's lifetime.According to the green-tree calculator, it'd require like 5,000 hours charging with the solar cell charger to produce the equivalent of one tree... and to be honest, I doubt the phone will make it that far.Instead, I'll just take my family out and plant a tree.FINAL THOUGHTS:This is my third experience with an LG phone (had a Shine and a useless GD510 before this one), and software and hardware have not yet improved enough. LG Mobile still has some road to go to be on-par with other established companies, even Korean Samsung. And having so many other options out there, why bother? Really!", "Date": "September 27, 2010"}, {"Title": "it is a good phone", "Author": "px", "ReviewID": "RIJTNVJWKS42M", "Overall": "4.0", "Content": "Generally, LG GD510 is a good phone. Something not good enough is that the touch screen is not that sensitive, especially the slide bar. I thought the sensitivity could be adjusted by some setting, but I did not find it. Anyway, I like it.", "Date": "April 1, 2011"}, {"Title": "Excellent cell phone", "Author": "J. Cardenas Rodriguez", "ReviewID": "R23FHFWYLRILBW", "Overall": "4.0", "Content": "This unit \"LG\" was a gift for my wife, She is a novice using touchscreen cell phones, but this unit helps to learn, understand and manage a lot of utilities on the phone, it charges the battery in about 3 hours, 3 days after it need to recharge. excellent keyboard on the screen, 4gb external memory it can contain a lot of music on MP3 format, I do not gave 5 stars because te time of the battery life. I use another cell phone brand and I can talk more time and charge my unit every 5-6 days.If you are looking for a good cell phone with the touchscreen function, this is one of the first I recommend. Also the price (for an unlocked cell phone) was atractive.", "Date": "October 11, 2010"}, {"Title": "its locked", "Author": "monico", "ReviewID": "R2VK7SE4E8D7BY", "Overall": "2.0", "Content": "this cell phone description is unlocked, but the the one i got is locked, so i spend another $20 just to unlocked it, description misleading.", "Date": "August 2, 2011"}, {"Title": "Unloked celphone????", "Author": "Carlos", "ReviewID": "R2ZVKSDL5HFVKU", "Overall": "1.0", "Content": "This phone is the worst, everywhere, on labels and in the phone box were saying \"unlocked phone\" but even so the phone was not unlocked, so it did not work in my country Costa Rica, I lost my money because it leaves more expensive it back. thank you very much for this article that leaves in doubt the quality of the items from Amazon and external stores", "Date": "May 19, 2011"}, {"Title": "phone dysfunctional after about a month", "Author": "bdavey", "ReviewID": "R3350AI5TBLTPD", "Overall": "2.0", "Content": "We received the phone rather quickly. About a month or so after purchased the phone touch screen stopped working. Took out a warranty on it so will be getting money back.", "Date": "April 16, 2011"}, {"Title": "Overall a good phone", "Author": "Ed", "ReviewID": "R3A7IMIEJINMO0", "Overall": "4.0", "Content": "I bought this phone to replace an LG Sentio for T-Mobile, but at half the price. It did not disappoint. It came with everything I needed out of the box, just put in my SIM card and it worked instantly. Very similar in features, good call quality, decent camera, good battery life, etc. The touch screen is a bit innaccurate at times, but no big deal. I recommend it.", "Date": "February 20, 2011"}, {"Title": "Great little phone.", "Author": "GadgetGirl", "ReviewID": "R2O4PLBITVQO9E", "Overall": "5.0", "Content": "I am a phone junkie, I had all 4 iPhones, the samsung captivate, aria and x10 so far over the last few month.So I know phones well, I was looking for a easy little phone to keep in my pocket and use daily.but it had to have a good little camera to take some quick shots,This phone is fantastic, I really love the slim style, set it up in minutes, and love the size it perfect.Call quality is amazing, much better then my iPhones,and the reception is very very good, call quality is very crisp, love the fact if you turn the phone over as it's rinigng it goes silent.I always want the best in phones yet they tend to be all to large, this is perfect.The camera take great pictures as sharp as my iPhone, it does not take marcros as well but hey it a great deal.I also bought the solar charger so I can charge it with the sun on long trips.I will wait a few days and review it.", "Date": "September 15, 2010"}, {"Title": "dont keep a charge", "Author": "G. Devlin \"Sonnja\"", "ReviewID": "R1W763QU250IIN", "Overall": "1.0", "Content": "i am very sorry to say I couldn't use it for sprint and it didn't keep a charge the worst $100 I have ever spent sorry", "Date": "May 6, 2013"}, {"Title": "Small cell phone", "Author": "Vincent Lantieri", "ReviewID": "R2DQMCOJJ5L5CZ", "Overall": "1.0", "Content": "The pictures make it seem larger than it is,  I sould have looked closer to the specs the phone is terrible to text with and difficult to dial numbers also NOT WORTH BUYING", "Date": "March 25, 2013"}, {"Title": "cell phone", "Author": "penname", "ReviewID": "R2IFAWAS837108", "Overall": "1.0", "Content": "I bought this phone for my nephew who lives abroad and because it was quad band and unlocked. However, it turned out to be wrong. This phone is locked, not unlocked. It did not work at all. I am still trying to find a way to get it back to the U.S. since cargo companies do not accept cell phones because of the U.S. custom regulations.", "Date": "August 26, 2011"}, {"Title": "it's locked phone", "Author": "lily", "ReviewID": "R17E7NUGBUQHL5", "Overall": "1.0", "Content": "The description says \"Unlocked\", but the phone I got today shows \"USIM Locked\". Anyone knows how to make it work?", "Date": "August 20, 2011"}, {"Title": "Birthday disappointment!", "Author": "Amazon Customer", "ReviewID": "RCRSQB64HGR05", "Overall": "1.0", "Content": "My daughter requested a cell phone for her big 13th birthday...she searched around and fell in love with this LG.  Imagine the look of joy on her face when she received her phone from her Godfather who purchased it for her...and the look of extreme disappointment when she found out her \"unlocked\" phone was actually locked! Even calling our carrier didnt help as they didnt have an unlock code!  This was the worst!", "Date": "August 3, 2011"}, {"Title": "cell phone deception", "Author": "milton gonzalez", "ReviewID": "R15NCRUCLUBZBP", "Overall": "1.0", "Content": "These days acquired an unlocked lg GD510, to put the sim card tells me that the card is blocked. lost money, telefomo, I cheated with this phone, I do not buy back a LG phone. with you and would not recommend this phone to anyone by default and deception. Thank you.", "Date": "July 29, 2011"}, {"Title": "Great phone with Chinese language option", "Author": "Y. Meng", "ReviewID": "R3KS38A28JOJC0", "Overall": "5.0", "Content": "I am looking for a phone with Chinese language option so can send text message overseas, this is the one I recommend to people who knows Chinese language!", "Date": "July 15, 2011"}, {"Title": "Great phone for the price", "Author": "LILJON", "ReviewID": "R1UN6W4LH5AENT", "Overall": "5.0", "Content": "Great phone from LG, touchscreen works great, not so fast as the iphone, but good for the price.Overall it has every other option, really nice phone for the price.", "Date": "May 9, 2011"}, {"Title": "This looks like a used", "Author": "Barani", "ReviewID": "R2XQWPZTNMQSBI", "Overall": "1.0", "Content": "This phone looks like a used phone. Packing is very bad .  I will not recommend to buy this from amazon.", "Date": "January 22, 2011"}, {"Title": "SE DAÑÓ AL QUINTO DÍA", "Author": "HENRY", "ReviewID": "R1J6R7HQK9CY3P", "Overall": "1.0", "Content": "ESTE TELÉFONO LLEGO BIEN SIN EMBARGO, AL QUIENTO DIA DE USO, EL MISMO SE DAÑO Y NO SE PUEDE CALIBRAR LA PANTALLA TÁCTIL DE MANERA CORRECTA.... Y NO TIENE SENTDO ASUMIR EL COSTO DEL ENVÍO A AMAZON PARA EL RESPECTIVO RECLAMO... DE MODO QUE ME QUEDÉ CON UN TELÉFONO DAÑADO EN MI PODER....", "Date": "March 28, 2011"}, {"Title": "DO NOT BUY THIS PHONE!! IT MAY NOT BE WHAT YOU WANT!!", "Author": "Tigger", "ReviewID": "RPHLP9JJNTZ1I", "Overall": "2.0", "Content": "When I received the Lg Pop, I was excited and when I turned it on, I tried to program it by calling *228, but it wouldn't let me, it kept saying emergency calls only, which means, only 911. Also, when I was looking to see what features the phone had, and I went to contacts, there was already contacts and I had bought a brand new phone, or so I thought. One other downside is that the receipt was incorrect and even cut in half, it was a receipt to a black remote, and thats not a phone at all!  So I am warning you that if you buy this phone, you may not get what you had expected. It looked like a great phone and super enjoyable, but I couldn't program it, so I'm sending it back and I will just buy a blackberry. Hope that my review was somewhat helpful is your search for a phone.", "Date": "April 21, 2011"}, {"Title": "the phone is locked. unable to operate it.", "Author": "Serguei Lomov", "ReviewID": "R3AE6V11Z5S147", "Overall": "1.0", "Content": "Lust got the phone. It is locked (USIM Dlocked) although shipping title says \"unlocked\". How to proceed this further ?", "Date": "August 16, 2011"}, {"Title": "LG GD510 Unlocked GSM Quad-Band Cell Phone with 3MP Camera, Touch Screen, MP3 Player, and Bluetooth - Unlocked Phone - No Warran", "Author": "mun301597ricardo rawlins", "ReviewID": "RNEHQT98RXL3F", "Overall": "1.0", "Content": "yo pedi un telefono desbloqueado para todas las operadora y me enviaron un telefono bloqueado lo cual lo veo como una estafa en el momento de publicar el producto en amazon ojo con este proveedor que te manda cosas diferente a la que publica.", "Date": "August 15, 2011"}, {"Title": "good phone for the price", "Author": "sarker", "ReviewID": "R3NV8137EQDBT3", "Overall": "4.0", "Content": "i wasnt sure when i bought this, but i liked how it looked and i wanted a touch phone.i dont use many of the apps, but there are some cool ones.the phone is small is looks good,works fine too - the keyboard is a bit small and at first it was confusing to figure out", "Date": "December 26, 2010"}, {"Title": "it's ok for calling and texting", "Author": "Jack", "ReviewID": "R143LTCYDDZUIF", "Overall": "3.0", "Content": "the baddest thing is that it always shows the message maximum limit is reached even though i have a SD card installed in there. I do have to turn off and on again to make it work again. camera is ok,", "Date": "December 14, 2010"}, {"Title": "absolutely beautiful!!", "Author": "f locuas", "ReviewID": "R2F47LY4RGLMV4", "Overall": "5.0", "Content": "totalmente hermoso aparato, el diseño es excelente y unico, me lo traje a Ecuador y fuciona bien. me encanta la pantalla y la presentacion del menu en ella. a pesar de ser \"Unlocked\" no lo puedo usar en una de las operadoras que hay aca, pero al menos me funciona en una de ellas. cool cell!", "Date": "August 1, 2010"}, {"Title": "Completely unusable touch screen", "Author": "Michael Ogg", "ReviewID": "R2R3EN6M9Y62RO", "Overall": "1.0", "Content": "I got this phone because I'm disabled with very limited dexterity. I find just about all phones to be unusable: flip phones and slide phones I can't open; Blackberry style the keys are impossibly small; even most candy bar phones require too much force to work the keypad. I tried the iPhone but found it too big to hold and use easily with one hand, although like the iPad, it has a very responsive touch screen. So maybe the smaller LG GD510 would be the answer. All I can say is: what a huge disappointment. The touch screen is simply unusable. Either, and unpredictably, a large amount of force is needed, or the slightest wisp sets it off. Scrolling is impossible: sliding the finger through the list of name in the address book either does nothing or dials the first number the finger comes near. The scroll bars were equally useless. And it wasn't just me: all the able bodied people I gave the phone to had, if not the same difficulty, then at least some difficulty. If the touch screen hadn't completely defeated me, there are enough other annoyances: the keys lock almost instantly requiring yet more key strokes; using the key pad to search the contact list it seems quite random whether a letter or number appears; a 2.5mm ear piece jack would be easier to use than mini USB; switching between portrait and landscape modes doesn't always work right; and finally, although a 3\" screen seemed nice, it really needs a 10 year old's fingers to use it. In fact, once I find a phone I can use, I'll give this to my 10 year old.", "Date": "June 15, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002TOK4B0"}}