{"Reviews": [{"Title": "Amazing phone, hampered by mediocre support", "Author": "Tariq Rahman \"tk\"", "ReviewID": "R3APUPP6RN1TM3", "Overall": "4.0", "Content": "I'm using this phone for almost 6 months now, and I absolutely adore it. It's sleek, fast and packs more features and functionality than a swiss-army knife; 8MP Camera, 720P video recording (world's first ever), AMOLED 3.7 capacitive screen and 16GB of internal memory.The hardware powering this phone is nothing short of phenomenal...it plays 720P HD content like butter, and the touch response rivals the iPhone 3GS. In fact, I even ran Quake III on this phone...yes, I'm referring to the 3D PC FPS game released by id Software back in 1999 (You need a full version of the game, a few apps and some research to do this)!So you might ask, why does it get a 4 instead of a 5 from me? Unfortunately, as much as I love this phone I cannot ignore the shoddy support from Samsung. Firmware updates for this phone are not even released for most regions yet(the launch firmware is seriously outdated, lacks many features and bugfixes), and Samsung has done little to address buyers concerns thus far. I even went as far as to flash a different region firmware onto my phone, just to get the new fixes/features.A big update is currently in the works, to be released by Feb 2010, aimed at addressing the complaints of disgruntled fans...but it is a bit too late now/people have already moved on to other, newer phones.If only this phone had better support, it would have been a true winner; it's truly a pity that Samsung failed to realize the potential of this wonder device.", "Date": "January 31, 2010"}, {"Title": "Outstanding Phone", "Author": "Peter Hanna", "ReviewID": "RIQASA24X2TIQ", "Overall": "5.0", "Content": "First off, if you are considering buying this phone, BUY IT. One of the best buys I ever made. This phone is packed FULL of USEFUL features. I have had it for two months down i cant put it down, i use it as an mp3 player, a digital camera, to record movies, to call and write texts easily. The fact that you can type on it so easily, and take pictures makes it perfect for taking notes in class. Its a perfect fusion of a Media phone and a Smart Phone.Not to mention its very durable. I dropped it accidentally from five feet and it fell screen down onto some rocks, and the scratch resistant screen worked perfectly, leaving it just as beautiful as it was when it left my hand.Yes, its expensive but, you also have to take two things into account.One, if you got a digital camera, a hd video recorder, a video player, a music player, a GPS and phone separately, you would be spending over 800 dollars. This phone packs all of it in a slim beautiful case.And two, you probably will be using the phone alot.In conclusion its a hefty investment in a phone but its a steal in terms of hardware and abilities. Great Buy if you can afford it, it will be way worth it.", "Date": "April 21, 2010"}, {"Title": "Great buy", "Author": "Carlos Mencia", "ReviewID": "R1JKVO3S09NHGD", "Overall": "5.0", "Content": "As a multimedia device this phone is great. Speakers and screen make watching movies a pleasure. The interface is silky smooth as compared to the n97 and comes close to the iphone 3gs but iphone still wins there. The hd recording is good I can't say i had any problems with it so far. The other options for video recording include slow mo and speed up which are fun to play with. The camera has a plethora of options, you will spend quite some time trying to figure out which setting works best for where the picture is being taken.So in closing the most outstanding thing about the phone besides the hd recording was the screen movies look \"WOW\".", "Date": "January 26, 2010"}, {"Title": "Initial Impressions", "Author": "CW", "ReviewID": "R31P2708H92L9Q", "Overall": "5.0", "Content": "These are my initial impressions.  What a fantastic piece of portable electronics!  Having looked at the iPhone, Samsung's Mystic and Solstice, and Motorola Droid I can safely say that the this Samsung i8910HD 16GB blows them all away.What can I say.  This is the largest screen of the bunch.  And, WOW, is it spectacular!!!!  Can't wait to try a 720p movie.  Touch sensitivity was well adjusted right out of the box.  Good tactile sensationI'm still working through the apps included on the phone, so more on those at a later date.My ringtone is no longer a 5, 10, or 20 second tone or cut that repeats.  I loaded a few of my MP3 and MP4 files onto the SDHC memory card, that I also purchased, to test the audio playback.  Just for grins, I selected 1 of those files as a ringtone.  It plays the 1st 40-45 seconds of the piece when I receive a call.  I almost hate to answer until the last second.  Now, I have to figure out what to use for the alerm clock tone.Same goes for my wallpaper; photo files loaded onto the memory card.  Only bit of advice here is the files need to be somewhere less than 300Kb with the image well centered.  The phone warns you when the file is too large, though.  Files smaller than about 75Kb don't do the screen justice.Oh, yeah, and for those who would take note, my ringtone and wallpaper are both from a single theme, but from different sources.  I know that's a bit much, but imagine the looks when the ringtone sounds, and you see exactly which image appears on the screen.Texting is a breeze.  The adaptive spelling feature will take some time to adapt to me, but you can always turn it off.  The QWERTY keyboard in lanscape mode has large buttons that even those of us with fat-finger can use with ease.Once I got the call volume turned up from 1, speaker clarity is great during calls.  No dropped calls yet.Expensive? Right now, yes. 1st kid on the block, the city, the county, maybe the state with 1 is satisfaction enough.", "Date": "February 26, 2010"}], "ProductInfo": {"Price": "$799.99", "Features": "8 Megapixel Auto-Focus Camera with advanced functions - face detection, smile shot, blink shot and panorama shot. Video recording with Power LED flash\nThe world?s largest 3.7? AMOLED screen. Vivid QHD (640X360) display with 16M color. Motion/Touch-enabled 3D games\nSymbian S60 5.0 (full touch UI)\nCinema-like sound with Dual stereo speaker & DNSe 2.0", "Name": "Samsung i8910 Omnia HD16GB Unlocked Phone with 8 MP Camera--International Version No Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/414gta6VRHL._SY300_.jpg", "ProductID": "B002LSHZPW"}}