{"Reviews": [{"Title": "I was sold a out of country 2007 refurbished phone", "Author": "susanne dugas", "ReviewID": "R1I66HEKMS4XEX", "Overall": "1.0", "Content": "Nothing but problems...monthly.....final problem no longer sends or receives photo's and unable to reply to text's...ATT's answer \"its a refurbished phone and can no longer be reset.", "Date": "April 17, 2013"}, {"Title": "Fails to meet the lowest standards", "Author": "Terry Fain", "ReviewID": "R1LJFM2KXW1HEV", "Overall": "1.0", "Content": "This phone is crap, it fails to stay backlit, fails to retain phone numbers and other data. Whom ever designed the workings of this phone did not know what they were doing, it a far cry from my original RAZAR. DO NOT BUY THIS PRODUCT!", "Date": "October 3, 2013"}, {"Title": "Fine from down under", "Author": "George Beker", "ReviewID": "R18S811AV3MSE0", "Overall": "4.0", "Content": "I like the Razr line.  Mine failed and this one filled the bill.  A little odd since it is obviously a phone programed for a carrier in Australia so a few of the items which can't be removed refer to a carrier half-way around the world.  Aside from that, the phone was in perfect condition and once I slipped in my SIM card has worked just fine.", "Date": "November 22, 2012"}, {"Title": "Motorola RAZR V3xx is the one I was looking for.", "Author": "T.Stanford", "ReviewID": "R2PX3VGR8RD73L", "Overall": "5.0", "Content": "Motorola RAZR V3xx is an older type phone that has all the features I want.I don't like touch and drag type phones.I touch and drag things that I don't  want to touch and drag.I like flip type/clam shell type button phones.I can push buttons.I can close them.They are smaller.I don't like big things sticking out of my pocket.I'm not going to carry a purse or wear a scabbard on my belt.I'm not going to break it in my hip pocket.It's a shame the phone industry thinks everyone wants to carry phones as large as sandwiches around.", "Date": "April 8, 2014"}, {"Title": "need my razor to work", "Author": "keith weinstein", "ReviewID": "R2RMHWBOWCXE9U", "Overall": "1.0", "Content": "tec support was  not able to help me with my new phone to send or recieve pictures the onley thing this phone can do is phone calls and tex thats it what contry did this phone come from. tec support could not even download a message to it  what gives please help", "Date": "March 19, 2014"}, {"Title": "Not new", "Author": "Sono", "ReviewID": "R20Z2T6VOMB0WP", "Overall": "2.0", "Content": "I purchased two of this phone 1 month apart, the first one arrived with in 10 days or so with no hiccups.  When I placed the 2nd order I made sure I requested a brand new phone and not refurbished for I never received a owner manual with the first one. Well when it arrived it was pre-set to Spanish and they didn't even bother to remove the stored phone numbers that had been saved by the previous owner.  Very disappointed, I bought these phones for my aging parents and wanted to get them a simply phone to operated.  As of today they seem to work fine but if I wanted to buy a couple of used phones I would of gone to the local flee market. If your buying from this vendor my experience is that you'll receive a used phone.", "Date": "February 11, 2014"}, {"Title": "I love it.", "Author": "sj", "ReviewID": "R8WXA7E5VH1W4", "Overall": "5.0", "Content": "Wanted an older razr V3XX like my old one.  Easy to use, and so far seems to be even better quality than the old one.", "Date": "February 27, 2013"}, {"Title": "no chargers", "Author": "martha bobbitt", "ReviewID": "R216VWTFQ9STDS", "Overall": "1.0", "Content": "it came with no charger at all then when i requested one they send me ones that didnt fit and one that wouldnt work, so i went and purchased two.", "Date": "July 29, 2013"}, {"Title": "A great experience both with Amazon and ATT", "Author": "Ed in California", "ReviewID": "R1KZEDWUK0NMRG", "Overall": "5.0", "Content": "I ordered this phone from Amazon at a great price, great delivery time, great condition.  I took this phone to ATT and signed onto the Prepaid program.  Within 15 minutes I was switched over from the previous carrier to ATT.  I had expected problems somewhere along the way; however, in 15 minutes my first phone call was coming into my new RAZR.  I had always had a RAZR and then changed carriers.  The carrier did not have a RAZR and I had to settle for an import which provided no class to the persona of the phone.  I went to Amazon and found this great, brand new phone.  Thank you AMAZON!!!It was a great experience all the way through.  Thanks Steve at ATT!!Ed", "Date": "June 2, 2012"}, {"Title": "Superb service!", "Author": "amazon", "ReviewID": "R3Q0MNFTKSK76A", "Overall": "5.0", "Content": "Excellent service by this company...no problems!  Very responsive to my questions and concerns....would definitely do business with this company in the future......5 stars!", "Date": "May 8, 2012"}, {"Title": "Motorola V3xx", "Author": "Muhammad Babar \"|MBS-..|\"", "ReviewID": "RH9LN8GO3EWSS", "Overall": "4.0", "Content": "The legendary phone with 3G capability. The only complain i have is the back cover which never fixes to its original place.Rest phone is working fine.", "Date": "July 11, 2013"}, {"Title": "Bad  DIsplay of american bussiness", "Author": "Ronald R Bremer", "ReviewID": "RUE97ILF4CTX6", "Overall": "1.0", "Content": "Product shipped very poorly also was not the item desplayed on Amazon .com  ordered an motororala phone v3xx unlocked for for at&t;  Reciecved an phone that was set up for Japaenise or coreian what ever it was not able to be programed for ameican, That where we live get it??????", "Date": "July 5, 2013"}, {"Title": "Found the perfect flip phone", "Author": "Tuvye Neuman", "ReviewID": "R8G00JA9XDMM5", "Overall": "4.0", "Content": "It is not easy to find this phone in such a good condition. It came in original packaging with all the cables and adapters includes.", "Date": "November 3, 2013"}, {"Title": "Razr v3xx", "Author": "Original Smart Phone", "ReviewID": "RNRIANLEY3SOX", "Overall": "5.0", "Content": "The phone is what I previously had and when my original decided to end its operational life I sought one out on Amazon. Good find.", "Date": "August 28, 2011"}, {"Title": "Motorola by motorola", "Author": "Adolpho B. Reyna", "ReviewID": "R3SHNWLJNNZE6L", "Overall": "3.0", "Content": "the product motorola razr v3xx unlocked looks good but is not to the standard as my motorola razrv3xx Loked from att it is not what I expected so I have to return  it.", "Date": "May 29, 2011"}, {"Title": "Motorola RAZA V3xx cell phone", "Author": "Paul Parker", "ReviewID": "R1EB99V3L5J2ZW", "Overall": "5.0", "Content": "I find this phone to have all needed in a cell phone with a lot of ease in use!", "Date": "October 27, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002R8FCHE"}}