{"Reviews": [{"Title": "shucks!!!!", "Author": "paps \"i hate amazon\"", "ReviewID": "R28MTBR8TXT5Y5", "Overall": "1.0", "Content": "I purchased this blackberry 8120 for my wife. First of all they sent a wrong charger, but somehow I managed because I had a spare charger.Its just been a month and the phone is not working. Its turning off, without any reason.Its a mere wastage of money. Donot buy this mobile. Iam very disappointed. I need to return or either exchange this cell phone. Please help me out.", "Date": "April 9, 2010"}, {"Title": "NO-NEW", "Author": "Hugo A.", "ReviewID": "R35UH8S2MSXIX0", "Overall": "1.0", "Content": "They offered the phone as it was NEW and really was refurbished and in no-good condition. Incompleted without battery !!!", "Date": "October 8, 2010"}, {"Title": "Not unlocked", "Author": "Everbless", "ReviewID": "R1JJV5PAA6MCK0", "Overall": "1.0", "Content": "I buy a unlocked phone and the phone was not unlocked I was so mad because I buy it to send it to my country and I brother say it is not unlocked I am so mad about it", "Date": "January 31, 2013"}, {"Title": "Lo necesario", "Author": "Arelys (Venezuela)", "ReviewID": "R3RFURGBKNXHRU", "Overall": "5.0", "Content": "Recibi este producto de un excelente vendedor y aunque no es el mas moderno y versatil, puedo decir que es liviano, discreto y con las aplicaciones que necesitaba.", "Date": "October 8, 2011"}, {"Title": "Muy bueno, los recomiendo", "Author": "Angel Clark", "ReviewID": "R1KZUJGYMWQVJG", "Overall": "5.0", "Content": "Saludos desde VenezuelaEl producto es  de muy buena calidad y todo el proceso de compra, envío y llegada del producto fue satisfactoria... los recomiendo!!Felicitaciones y Feliz Navidad!!", "Date": "November 20, 2012"}, {"Title": "The best NON-SMART phone I have ever used", "Author": "E. S. Gowen", "ReviewID": "R3PGFJDQHAE1EI", "Overall": "5.0", "Content": "I admit that this phone is inferior to many smart-phones that are currently on the market. Those all, however, require a data plan to use. If you are like me and want a quality phone without having to pay for a data plan then this is the phone for you. I have been using a BlackBerry Pearl for the last 6 years, so I am pretty familiar with its pros and cons.Pros:-Modified qwerty keyboard. While it is not a full qwerty (most of the buttons share two letters) I only commonly run across one mix up (\"see\" and \"are\"). That is a HUGE improvement over 9 key.-A smart phone quality calendar.-Very good media player-Bluetooth-Great Address book options.-Unlimited text inbox space; not the 250-500 text limit that virtually all phones have.-Many text search options. Great for when you are looking for that text you need but can't remember when you got it or who sent it.-Voice dialing-Fits very well into a pocket-Can set any size file as a ringtone, alarm, etc....I could go onCons:-The camera and video camera are not very good. I understand that there are people for whom a phone camera is more important than a calendar or address book or wifi then this is not the phone for you.-Much like a roller ball mouse, every year or so the track ball needs to be cleaned. There are many tutorials online that explain how this should be done. Once cleaned it works like new.-The headphone jack is smaller than is standard for headphones. If you want the standard 3.5mm jack then you probably want to upgrade to the 8120 or 8130.I have used many many phones, but this is far and away the best NON-SMART phone I have ever used. Ever.", "Date": "November 18, 2012"}, {"Title": "excellent", "Author": "rosy", "ReviewID": "RUV8YALB0MXRL", "Overall": "5.0", "Content": "excellent phone. blackberry is the best mark on the market for smart phones. recommended for those who like to walk always communicated with the world", "Date": "August 11, 2012"}, {"Title": "Excelente", "Author": "Richard Cedeño", "ReviewID": "RYWSCWMK0JFJ5", "Overall": "5.0", "Content": "Excelente producto, entrega oportuna, en excelentes condiciones, todos sus accesorios, cargador, audifonos, pila, estuche, todo muy bien empacada. excelente servicio", "Date": "February 3, 2012"}, {"Title": "BB pearl 8120 great phone", "Author": "Daniel Anzola", "ReviewID": "R3E8FCFF40H8SY", "Overall": "4.0", "Content": "Is a great phone portable and has WiFi, conftable forma people that wants a small pone with al os evrything that you need", "Date": "August 28, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Push email delivery from up to 10 email accounts (personal and corporate); 2.0-megapixel camera with video capture; MicroSD expansion\nSlim, powerful Blackberry messaging phone with SureType hybrid numeric/QWERTY keypad; WiFi for High Speed Wireless Internet.\nThis unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported.\nUp to 3.5 hours of talk time, up to 240 hours (10 days) of standby time\nQuad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and GPRS/EDGE data capabilities", "Name": "New Blackberry Pearl 8120 GSM Unlocked WIFI GSM Phone, International - SILVER", "ImgURL": "http://ecx.images-amazon.com/images/I/51ygNz47RHL._SY300_.jpg", "ProductID": "B0037432OW"}}