{"Reviews": [{"Title": "TERRIBLE CUSTOMER SERVICE,HARD TO GET YOUR MONEY BACK", "Author": "TERESA", "ReviewID": "R262P8PCMEGFTM", "Overall": "1.0", "Content": "THIS IS THE WORST PHONE I HAVE EVER OWNED,I DONT SEE WHY THEY CAN SELL THIS PHONE BECAUSE IT IS AN INTERNATIONAL PHONE AND ALL OF THE FEATURES DONT WORK HERE IN THE UNITED STATES.I HAVE BEEN TRYING TO GET MY MONEY BACK SINCE JANUARY 7 2011.STILL NO MONEY BACK.I WOULD RECOMMEND YOU DONT EVER PURCHASE ANYTHING FROM THIS COMPANY,IT IS SUCH A HASSLE TO RETURN ANYTHING. I HOPE I CAN GET MY $174 DOLLARS BACK SOON.I HAVE GONE WITHOUT A PHONE SINCE JANUARY 7 2011.BUT THEY DONT CARE ABOUT THERE CUSTOMERS.IT IS NOT A-TO-Z GUARANTEE.", "Date": "January 25, 2011"}, {"Title": "i put the phone on is no signal and too small keyboard just do not like", "Author": "kenxue", "ReviewID": "R32WQEJUKBBE8R", "Overall": "1.0", "Content": "i put the phone on is no signal and too small keyboard just do not like may i return this item?", "Date": "December 30, 2013"}, {"Title": "Total elation", "Author": "Halewis \"halewis\"", "ReviewID": "RACDBAQ16CPW2", "Overall": "5.0", "Content": "I purchased the phone for my granddaughter because she insisted on a pink, touch screen phone with a radio.  This phone has a radio and a MP3 player.  So she got more than she bargained for.  The problem:  This is an international phone and we could not get all the standard functions to work on the phone.  The vendor offered to exchange the phone for one that could be properly set up but my granddaughter refused.  She was willing to sacrifice SMS picture mail for a phone in the color of her choice.  Go figure!", "Date": "August 22, 2010"}], "ProductInfo": {"Price": "$249.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported.\nUnlocked Quad-Band GSM cell phone compatible with 850/900/1800/1900 GSM frequencies plus GPRS/EDGE capabilities\nQWERTY keyboard; 2 MP Camera 1600x1200 pixels; TFT touchscreen, 256K colors; Google Search, Widgets; SMS (threaded view), MMS, Email and Gmail\nStereo FM radio with RDS, FM recording; MP3/MP4 player; Stereo Bluetooth with A2DP; DNSe (Digital Natural Sound Engine); 3.5 mm audio jack; MP3 ringtones and downloadable games.\nTalk time up to 10 hours - Standby up to 640 hs.", "Name": "Samsung B3410 Corby Plus Unlocked Quad-Band Phone with Camera, Bluetooth, FM Radio and microSD Slot--International Version with Warranty (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41x8ufyk7eL._SY300_.jpg", "ProductID": "B003E2DTOK"}}