{"Reviews": [{"Title": "A gift for my parents...", "Author": "Lacey Oxbow", "ReviewID": "R1EYG7GEXMHTXO", "Overall": "5.0", "Content": "Both my parents enjoy using this phone immensely! Also, one of the main reasons I bought it was because of the multiple languages that you can switch to; for my parents specifically, Chinese (simplified for my mum, traditional for my dad). Easy to use interface and navigation, even for tech-challenged, older people I think....", "Date": "October 5, 2011"}, {"Title": "Came with the wrong accesories", "Author": "David", "ReviewID": "R1M9V0FQ35KBFB", "Overall": "3.0", "Content": "Everything was perfect with the purchase, until i wanted to use the Stereo headset, this came with the wrong conector,  the Stereo headset  that i received in the box have a stereo plug (3.5 mm Audio Jack) to connect with the phone, but the port of the phone to connect the Stereo headset have the same shape of the charger, flat, that's why i can't hear music, radio or talk hands-free,stereo headset should be like the one described in the manual [...].", "Date": "February 23, 2012"}, {"Title": "LG KP500", "Author": "Trini 2d bone \"bikerz_rule\"", "ReviewID": "RHCK33X12W5J6", "Overall": "5.0", "Content": "Bought this phone when it was just released a few years ago and to date the only problem I had in Nov 2011 was that the battery needed to be changed. This was done and the phone is like new again, all programs work fine and the few falls it had in it's lifetime has not seemed to cause any problems. Great phone and I fully recommend it.", "Date": "January 19, 2012"}, {"Title": "LG-recomand to all my friends", "Author": "Zdeninka", "ReviewID": "R2HHHHOSGQECR6", "Overall": "5.0", "Content": "I plain love this small cell.Better and cheaper than I Phone and have SD card for music and pics..No $$$ consuming APPP on my I Phone and I can have 10 LG`s for the price of one I Phone.", "Date": "November 29, 2013"}, {"Title": "terrible touch response and texting is awful", "Author": "sham hosein", "ReviewID": "RHDSYL2NOIC25", "Overall": "1.0", "Content": "Don't bother buying this. The stylus is hard to hold due to tiny size and it doesn't accurately recognize the letters you print anyway. It is horribly outdated technology and will only frustrate you. Also, the touch screen is nonresponsive often and it requires a very FIRM touch to activate. You also have to go through a bunch of menu settings manually to set up the texting protocols; if you don't search the internet and find out how to set it up you cannot send or receive any texts.The seller also apparently sent me a used phone. No documentation was included, it was inside an empty and previously opened box and THE WRONG POWER CORD was thrown in it! It didn't even fit the phone's charger port. They obviously just threw in some random old, used LG charger they had laying around without even checking if it would fit the phone. I had to go spend another $25 so I could actually have a charger that plug into the phone.", "Date": "October 25, 2013"}, {"Title": "Ideal for international use", "Author": "realitarian", "ReviewID": "RYGXQEE6SK603", "Overall": "5.0", "Content": "I got this for my dad in India. He wanted a touch-screen phone, but nothing too complicated. So...Droid/iPhone was a no-go. Additionally, he is not going to go through getting a data plan just for keeping the (mostly) unnecessary apps up-to-date.So this phone was perfect. It has a plug insert that fits into Indian electrical sockets, a touch-screen that seems robust and does the job, and a camera and other bells-and-whistles to make a phone fancier than a run-of-the-mill flip phone. When I was visiting him, I just plugged the charger, popped his old SIM card in and he was good to go.It's been about 10 months and dad says the phone still works great.", "Date": "November 13, 2012"}, {"Title": "igor", "Author": "rydik", "ReviewID": "R3C11B9EQCXZHL", "Overall": "2.0", "Content": "In the first place i thought it was a good cellphone it turned out it had the wrong charger and every time i turned it on the screen went black because of no battery and no charger in the first place it turned on and after that it did not even turn on.And at the end the screen became all blurry and you could barely see anything.The only good thing is that you got your money back.", "Date": "February 25, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nUnlocked GSM Quad-Band: GSM 850/900/1800/1900 and GPRS/EDGE data capabilities\n3-inch auto-rotating touchscreen with handwriting recognition; Flash user interface; 3.2-megapixel camera/camcorder; SMS/MMS/E-MAIL and MP3/WMA/AAC player.\nBluetooth stereo music; MicroSD expansion to 16 GB; digital audio/video player and FM radio; organizer and document viewer\nUp to 3.5 hours of talk time, up to 350 hours of standby time", "Name": "LG KP500 Unlocked Quad-Band Touchscreen Phone with 3.1 MP Camera, Bluetooth, FM Radio and MicroSD Slot - International Version - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51h2m85yTiL._SY300_.jpg", "ProductID": "B003XMWMSU"}}