{"Reviews": [{"Title": "Not bad much better than 5800", "Author": "Morris Hanley \"Moe3754\"", "ReviewID": "R1657J4LG8TN33", "Overall": "4.0", "Content": "I got this phone to replace my Nexus one because of AT&T;, I have owned Nokia phones for over four years and have had many N series phones. The X6 is a improvement over the other touch screen phones they make, my N97 mini was just marginal and the 5800 was a disaster with others falling in between that, I would have loved to keep my N1 but refuse to pay $30.00 a month for data on a phone that AT&T; does not sell, that is why I went back to Nokia and the X6. The X6 touch screen has been improved with kinetic scrolling but it still suffers from poor touch response!I find this somewhat annoying but livable,the screen is bright and clear but not as good looking as a AMOLED screen but then again the X6 does not suffer from burn in like the AMOLED screens do.The flimsey back cover is a disapointment it feels like it will break very easy if not careful, also the three hard point buttons on the front are a worthless design that I am sure will give you trouble in the future, again poorly built. Battery life is marginal at best!!!Call quality is the same as all Nokia phones, it is clear and has great sound, the twin speakers on the phone give it a really good sound when playing music. The bluetooth works great and is very clear and will support voice dialing from the headset if the headset supports it.All in all Nokia has improved the touch screen phone some what, but still have a long way to go, maybe the new symbian 3 on the N8 will bring them up to where they should have been long ago. I think that the limit of only 16GB internal memory is a mistake, I thought that Nokia would have learned that lesson when they made the N95 8GB but I guess not, they should have at least put a HCSD slot in the phone also but I guess not. Also a little better processor would have been better, the lack of power is a little disappointing but again livable!!! All in all it is a typical Nokia with all the short comings that are typical Nokia, something I have come to expect over the years!!!Would I recommend this phone to others?? Yes but with the stipulation that they do not have visions of iphone or Android N1 to compare to because it will fall well short of the mark. For a Nokia touch screen phone it is as good as they get, if not for the kinetic scrolling it would have probably only gotten two or three stars at best!!! I guess it will hold me over until something better comes along!!!!", "Date": "June 6, 2010"}, {"Title": "just don't do it.", "Author": "H. Chu", "ReviewID": "R19FW7OY45NF06", "Overall": "1.0", "Content": "Having owned a Nokia N85, I thought this would be a step up. Having seen the product for $200, I decided to buy one. I got it a week later (blame Dell). And I requested a return 6 hours later. And I came this close to throwing it across the room.For starters, the user interface is terrible. The web browser uses on-screen menus, due to the touch interface. Which is fine, but when the viewing is switched from portrait to landscape, the on-screen buttons get twice as large, and obscure more of the content. After a few seconds, the on screen buttons go away, but it also resizes the width of the viewing window with it, shifting the text and making it very easy to lose your place when you are trying to read something. And there is no way, that I've found, to force the on screen menu to disappear. You just have to wait. To zoom into something, you have to bring up the on-screen menu, tap the \"zoom\" function, and then, with your fingers, manually adjust the slider. This is very annoying. To alleviate, I downloaded Opera Mobile, whose on-screen keyboard on this device is so small, it's just as aggravating.In most of the menus, you can swipe vertically to scroll down, but you cannot swipe horizontally to switch between tabs. However, in some windows you can. Sometimes you can single-tap an option, sometimes you have to double-tap. Utterly annoying.The typing is wretched, too. In portrait mode, you use an on-screen number pad like you would with a traditional phone, which would be fine, except this 2009 model does not come with T9. No predictive text in landscape mode either, and the software keyboard is a bit cramped and doesn't come with niceties like a \".com\" button to finish URLs with. There is also no way to cancel out of text input, the best you can do is delete everything you've written and hit the green check mark. Again, it's almost as if no one cared to use this device in the real world.I have also come across many bugs in the software (running the latest version as of June 2010), where the menus just don't work, or options don't pop up the way they should. In the few hours or so I've had to play with the device, I've had to restart the device no less than 4 times just to get it working properly.The build quality is suspect. The battery cover is made of flimsy plastic and you basically have to pry it off to open it. The front face feels like it's made of plastic as well and doesn't seem like it can stand up to being in your pockets.Other major annoyances: it comes with a USB port and a proprietary port for power. It does not charge through the USB port at all. It also uses a proprietary Nokia 3.5mm jack for voice communications. Normal earbuds will work fine, but these $150 Bose earbuds with a microphone will not work.The speakers are quite good. However, the media player is terrible. If you play \"All Songs\" the device can't distinguish between ringtones and actual music on the device, so prepare to hear some of those during a shuffle session at the gym. There are no codecs to play many popular file formats.I can go on and on about how terrible this device is, but I hope I've already convinced you to not buy this product. It's amazing how Nokia can keep up with this type of technological and UI  obstinance while companies like google, apple and even microsoft are coming up with new ways to make a phone work better. This phone feels like no one cared about it from beginning to end. It is an overall poor product.", "Date": "June 18, 2010"}, {"Title": "Great phone...does everything I need it to do without the AT&T; crap.", "Author": "J. Alcantar", "ReviewID": "RRJW2217DEQQ7", "Overall": "4.0", "Content": "I bought this phone on sale from Nokia and have been using it for over a month.  I have to say as a former iPhone owner that this phone is great. Of course like anything else you have to learn how to navigate and operate the phone but after a couple of days of use it becomes second nature like riding a bike.  This phone is definitely not an iPhone killer so if you are looking for that illusive item... well just keep looking.  What this phone does that my iPhone couldn't do is actually receive and make calls 100% of the time.  The call quality is good, music player is great, phone came with all the cables, decent headphones, video playback is good, speakers are super loud and clear, web surfing is good, and the camera takes fantastic pictures and videos.  I would rate this phone a 5 but I cannot since I really haven't come across or ever owned a perfect 5 phone.  So, if you want a phone that actually performs all the phone functions well on top of having a great music player, camera, and web browser get the Nokia X6 but shop around the prices have dropped and should keep going down since Nokia announced that it will release its new smartphone lineup soon.", "Date": "July 1, 2010"}, {"Title": "Great SmartPhone for the Price", "Author": "Andres F. Paez V", "ReviewID": "RYNZGYUW53OT9", "Overall": "4.0", "Content": "Hello everyone. First thing I will say is that the phone itself looks great.The Nokia packaging is not that good, but it does its job well and the phone arrived in excelente shape and with all the announced accessories (I actually expected a nicer packaging, but that is just me I guess).I bought this to replace a Samsung Ommia I900, and before that I had the Nokia 5800 and the fist improvement I noticed in the X6, as it has great response, eventhough it takes a bit to get used to since it is capacitive (Mainly you need to use your finger tips, and not a stylus or \"nails\"). It is also a lot faster than the 5800, applications load better, keyboards display better (Nicer screen resolution as well I think) and overall it is easier to handle.The music sound is very nice, and it has 16GB of memory. Would have still liked if it had a Micro SD slot, as some other reviewers have said, even though 16GB is preety much space for regular music and photos.The camera is nicer than the one on the 5800, but lacks some of the functions that the Omnia I900 had like face recognition, smile shutter, etc.Overall, I would deffinitely recommend this smartphone on its price range (Around $300 USD now, I bought it for $50 more), great quality (Nokia has never dissapointed in phone quality, or phone call quality), quadband, works with 3G network (At least here in Colombia), GPS (You can also make the GPS work as a standard service withouth data plans, with some programs like Garmin and some small settings), camera, etc.", "Date": "July 5, 2010"}, {"Title": "Exelente por el precio. Lo mejor es su cámara", "Author": "Miguel De La Cruz", "ReviewID": "R390YU32LPV9K2", "Overall": "4.0", "Content": "Este teléfono es el sustituto natural del 5800. Este es mucho mejor principalmente en la cámara de 5 mp gran angular que tiene una gran sensibilidad, en condiciones de poca luz se obtienen fotos nítidas bien balanceadas y con muy poco o casi ningún ruido.en cuanto al sistema operativo no esperen cambios significativos solamente el desplazamiento y el reproductor muestra las miniaturas de las carátulas y la letra por la que vamos pasando en grandeEn  video muestra muchos artefactos debido al algoritmo de compresión, algo que espero arreglen con actualización de firmware.La pantalla cuesta unas horas acostumbrarse debido a que es mucho más sensible al tacto.El sistema es mucho más estable que el 5800. dificilmente se llega a frizarla construcción es mucho más elaborada y se siente robusto, pero parece ser menos resistente a las caidas que el 5800", "Date": "June 23, 2010"}, {"Title": "nice phone", "Author": "CarlosRRiveraM \"CRRM\"", "ReviewID": "R3FJGKM8QRU04A", "Overall": "5.0", "Content": "i have had this phone for 8 months now, I used to have a nokia n95 and decided to upgrade. i really like this phone because it has pretty much the same functions as the n95 but is way smaller and has the touchscreen. the pictures really good and the video too. the only thing that i dont like is that even that i've had for a long time, i still cant get used to the qwerty keyboard when you turn the phone, sometimes it really is a pain in the butt. i wish that for the next phone, nokia can change the OS; i guess that symbian is good, but the problem is that almost every app that you whant to add is gona cost you something, unlike android that is way easier to find suitable apps. also, i think that is a bit overpriced if you actually compare it to other phones in the same price-range. dont get me wrong, i like this phone, i guess that every phone has its flaws.", "Date": "February 25, 2011"}, {"Title": "LOVED this phone!", "Author": "Vito", "ReviewID": "R180Y624IBJH07", "Overall": "5.0", "Content": "I purchased this phone for my boyfriend and he loved this phone! He had no problems with this phone. Everything worked great. However, after only having the phone for 2 weeks, one day while we were shopping, he went into the restroom at the store and forgot his phone in the restroom. 15 minutes later when he remembered and went to look for it, it was gone and it was never returned. I purchased the LG GC900 for him and although it is a good phone, he is unable to connect to the internet not even WIFI and he is unable to send or receive MMS. So, now he he wants to purchase the Nokia X6 again. We absolutely love the Nokia phones and have never had any problems with these phones. Will definately purchase this phone again and I also plan to purchase the Nokia N8!", "Date": "January 1, 2011"}, {"Title": "Muy buen cel,", "Author": "Tony Duarte \"everything that has a begining h...", "ReviewID": "R384YBBFWT26TP", "Overall": "5.0", "Content": "El telefono hasta el momento esta excelente, muy buenas funciones lo unico que me podria quejar es cuando lo compre estaba en $390 y a la semana lo bajaron a $350... en realidad lo recomiendopura vida \\m/ desde Costa Rica", "Date": "May 19, 2010"}, {"Title": "Awesome good for price", "Author": "Narendra Pandhya", "ReviewID": "R2759CE4D3Y0MV", "Overall": "5.0", "Content": "I am happy to have this one. I was lucky to get when amazon had it for the lowest price.i and my friend got total 3 phones...This is a good choice for people who want to spend less and get good worth of their money.", "Date": "August 4, 2010"}, {"Title": "Nokia X6", "Author": "Minh", "ReviewID": "R37B569AA0I2LS", "Overall": "5.0", "Content": "Excellent services! The phone came with complete accessories in a sealed box before the estimated delivery time. Everything works perfectly. Would definitely buy from Amazon again!", "Date": "June 26, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Product Dimensions: 7.7 x 5.5 x 2.1 inches ; 4.3 ounces\nquad-band GSM cell phone compatible with 850/900/1800/1900 frequencies and US/International 3G compatibility via 850/900/1900/2100 UMTS/HSDPA plus GPRS/EDGE capabilities\n•\t3G-enabled mobile phone for multimedia and social networking, includes 3.2-inch touch display and 16 GB internal memory\n•\t5-megapixel camera/camcorder; Wi-Fi networking; Bluetooth stereo music; easy access to email\n•\tUp to six hours of 3G talk time, up to 450 hours (18.75 days) of standby time", "Name": "Nokia X6 Touch Unlocked GSM Phone with 5 MP Camera and 16 GB Memory (White with Yellow Cap)", "ImgURL": "http://ecx.images-amazon.com/images/I/41WBTrIM-4L._SY300_.jpg", "ProductID": "B0036DDT6U"}}