{"Reviews": [{"Title": "BlackBerry primer", "Author": "Tomasa Tomasa", "ReviewID": "R271DUPECHDUHM", "Overall": "4.0", "Content": "Background: If you do your research on this phone (and other BlackBerry's) you will note that many people talk about the bugs/problems, etc. Many of these complaints are hardware based (bad chips, etc) NOT software based (although it may seem so).Make sure that if you buy it, you can return it (if bad) with no hassles/restocking fees (example: Amazon and sold by Amazon).Condition: Mines was like new (with covered screens), original box, USB cable, power cable, original CD (there's and update online), headset and small instruction booklet (does not look original). Mines had no software/hardware issues (no rebooting, no Bluetooth issues, no slowdowns, etc).The advantages in general of the blackberry's are the great screen (geared for text readers) and the keyboard.The bad is the Blackberry \"WiFi situation\": they want you to buy the \"blackberry internet plan\" which is a hookup with your cell phone provider. Cell phone providers will have different names for this plan but note that it will cost you in the US around $15-$20. If you have a prepaid plan they will tell you the plan is not available (unless you have a monthly plan). I don't recommend this plan (if you can get it) because I consider it a ripoff. That will probably be the biggest issue with this phone (and all blackberry's).The workaround: If you want to use Wi-Fi they will use a combination of WiFi and GPRS/EDGE. For example when you try to use the BlackBerry GMail app from Google you will be able to install it halfway but when it tries to connect it will tell you, you need a connection. If you disable your data connection (GPRS/EDGE) you will get the same result and so on and so forth with different applications.To get around this BlackBerry Wi-Fi situation you have to get applications that are not exactly BlueBerry approved (and you will probably not see in their new store) that allow you to use Wi-Fi ONLY and not a combination Wi-Fi/GRPS/EDGE (again they use EDGE/GPRS to check if you have the BlackBerry Plan if you don't they don't give you access). For example for GMail I use LogicMail (uses Wi-Fi only), UberTwitter, Opera Mini, Yahoo Mail (you have to use their website) with the Opera Mini browser because you won't be able to use it with the BlackBerry browser (these are the only ones I found that I installed).Final review: Great phone, almost perfect form factor and screen (recommended 7 point font), almost perfect for SMS/MMS/emailing. Wi-Fi, Keyboard is better than a standard number keyboard but NOT better than a full keyboard (of course). If you can deal with the Wi-Fi issue (and sub par and very limited apps compared to the IPhone or even Windows Mobile phone) then this is a GREAT phone!", "Date": "September 17, 2010"}, {"Title": "Great!! :)", "Author": "marle", "ReviewID": "RZXAK03NDDMR6", "Overall": "5.0", "Content": "I recieved this phone yesterday and I can say that so far so good! :) I bought 2, one for my mom and one for me and we like them a lot. they are easy to use also they accept chips for whatever celular phone company you have. my mom has movistar and I have digitel and It works perfectly with each one of them :) I am happy with my purchase.", "Date": "November 27, 2010"}, {"Title": "I like it very much", "Author": "Jessica", "ReviewID": "RNOHBH3SDYPIQ", "Overall": "4.0", "Content": "This is the second time I buy this phone model cause I really like it, I've found it very easy to use, the camera has flash which is not always available in more recent blackberry models, I haven't use the bluetooth function (in other reviews says it doesn't work) but the other functions works perfectly.", "Date": "December 4, 2011"}, {"Title": "Blackberry flip 8220", "Author": "Lynn R Whitman", "ReviewID": "R2YWFQJAA0KMKC", "Overall": "3.0", "Content": "Satisfied enough to not attempt to return phone.  Purchased this 8220 to replace my 8220.  This replacement phone functions are a bit different, flor example, there is no Help icon and therefore no Help menu which was very useful to me and there are also variations in other menu items.  This is an older model phone but one that I have always liked.", "Date": "April 3, 2014"}, {"Title": "too light n hard to operate", "Author": "sushma", "ReviewID": "R3OS9UFOQXAH68", "Overall": "1.0", "Content": "too light n hard to operate......didn't like it so i returned it back.....material looks cheap even though the brand is blackberry", "Date": "February 23, 2014"}, {"Title": "buena compra", "Author": "Cristhian Rojas", "ReviewID": "R3BADOKUFBAKXX", "Overall": "5.0", "Content": "el telefono resulto de buena calidad y hoy por hoy sigue funcionando adecuadamente, contrario a las criticas de otros propietarios", "Date": "March 15, 2013"}, {"Title": "Broke within 3 months", "Author": "Sajan", "ReviewID": "R2Q4ZEBW08BHC8", "Overall": "1.0", "Content": "The phone charging mechanism broke within 3 months. No US manufacture warranty on the phone. I wont recommend this phone.", "Date": "January 9, 2013"}, {"Title": "My Mom loves it!!", "Author": "Sarah12", "ReviewID": "R3786ZYI7W3UH6", "Overall": "5.0", "Content": "I bought this for my mom, she wanted a flip phone because she doesnt like to use the smart phones.  Yet she wanted the features of a smart phone, and this phone has it!!. It's just like a regular blackberry but in a flip phone!!!", "Date": "December 19, 2012"}, {"Title": "Awesome Phone", "Author": "Luann", "ReviewID": "R193YQJOINZZ8S", "Overall": "5.0", "Content": "I will be heartbroken once this phone is no longer offered anywhere. It's been my favorite model for years now. Love it. It's perfect! Thanks. = )", "Date": "December 9, 2012"}, {"Title": "too early to tell (UPDATE)", "Author": "ETtech11", "ReviewID": "R1XH7TH5HRJPX4", "Overall": "1.0", "Content": "This is my second purchase of this phone.  The blue tooth failed in about six months. reloading and updating software was an exercise in futility.  Other than that, I love this phone.  I am old school and use it strictly as a phone, not a computer. As such, it works perfectly. I can only hope that the blue tooth last as long as the phone this time, but I am skeptical.  I checked out many reviews on different sites and found that the blue tooth failing is the number one complaint... and they are plentiful.UPDATE:  The blue tooth failed in less than three months.  If you must have blue tooth like I do, stay very very far from this one.", "Date": "July 31, 2012"}, {"Title": "good stuff", "Author": null, "ReviewID": "R2TAP6FZRYLD90", "Overall": "3.0", "Content": "The product arrived sealed and in good conditon then I realized the headphone wasn`t working well and I still can`tinstall the software in my computer as it totally collapses whenever I try to do it. I`m starting to think it might bebecause I have Windows Xp.Ericka-Peru", "Date": "December 13, 2010"}, {"Title": "BB", "Author": "Monicap75", "ReviewID": "RVA5GSJDBWJY2", "Overall": "5.0", "Content": "I feel very succesfully with this BB model, have all that I expect of this kind of smartphones, is my first BB. Services are excellent, and the pictures resolution is really good, excelent pictures. It's model is speciall for women, it was very easy to connect to my Cell Phone Company, that is in Venezuela. My experience is excellent, and I have to thanks to the seller for his continuos support and follow to my selection.", "Date": "September 27, 2010"}, {"Title": "Best phone on the market...", "Author": "Martin Harper", "ReviewID": "R1UJRXWY62P5KL", "Overall": "1.0", "Content": "NOT!Gave it one star as I couldn't give it 0.My wife and I took out a family plan, there are five of us and four of us chose the blackberry flip based on the recommmendation of the sales representative. He made comments about them being \"absolutely the best phone on the market\".My personal experience of these phones is that they are absolute junk.One of them had to be replaced at the store within 30 days. A second was replaced by mail within 90 days and all four now are unreliable. I suspect the problem is something to do with the SIM card carrier as all of them regularly display messages like \"SIM card error\", \"initialisation failure\", \"wrong SIM card\". We've had all four SIM cards replaced at our own cost and that made no difference what so ever.We can't wait for the contract to be finished so we can dump the phones in the river.", "Date": "August 30, 2010"}, {"Title": "great phone", "Author": "perdita babin", "ReviewID": "R12YPZRJZRO9YJ", "Overall": "5.0", "Content": "l love this phone works well but could not get internet but l would recommend it to all my friends", "Date": "January 26, 2014"}, {"Title": "MALO", "Author": "ROSA", "ReviewID": "R222CGRF2SVLEK", "Overall": "1.0", "Content": "The product arrived in BAD CONDITIONS AND NEVER ANSWERED NO CLAIM. Bad service and bad product. NOT RECOMMENDED. More efficient", "Date": "February 3, 2013"}, {"Title": "perfect", "Author": "jesus trillo", "ReviewID": "R3SHYE2H03ZI4I", "Overall": "5.0", "Content": "highly recommended this shop! I send my phone brand new and details that is the opposite of the store citycellular to buy 2 phones and details were", "Date": "January 15, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nBlackberry's first clamshell smartphone with dual LCD screens and SureType hybrid numeric/QWERTY keypad\nConnect with up to 10 personal and work email accounts; 2.0-megapixel camera; Bluetooth stereo music; MicroSD memory expansion up to 16 GB\nUp to 4 hours of talk time, up to 360 hours (15 days) of standby time", "Name": "BlackBerry 8220 Flip Pearl Unlocked Phone with GPRS, EDGE and 2 MP Camera - US Warranty - Pink", "ImgURL": "http://ecx.images-amazon.com/images/I/31hM4n%2B1mOL._SY300_.jpg", "ProductID": "B003EHFPAG"}}