{"Reviews": [{"Title": "Probably the best phone made, that's not \"smart\"!", "Author": "solerider", "ReviewID": "R3D0UYJPI8AXFH", "Overall": "5.0", "Content": "I absolutely love this phone....If you can find a new one, they're still a couple of hundred bucks....Very sought after phone. I almost always have bars....Quick internet response (for a non smart phone). Very stylish..Voice recognition....MP3....video recorder....SD micro card expandable 8g....Tons of accessories still available. Thanks JR for the great service!", "Date": "June 7, 2011"}, {"Title": "Great", "Author": "Jerry Lee Griffith", "ReviewID": "RD4HQHBI9TOC7", "Overall": "5.0", "Content": "I love this phone. My old one ( Razr v3xx ) When into the wash , Pick this one for replacement, works great , rings very loud, like I need it to do.", "Date": "July 12, 2011"}, {"Title": "A good phone to FLIP over!", "Author": "Alan D. Igo", "ReviewID": "R29DRVHTMSGNHC", "Overall": "4.0", "Content": "I had a flip phone sometime back and traded it for a 'candy bar'. But the screen on the candy bar caused me some grief and was difficult to deal with. Been-there-done-that? This flipper is a basic phone and not 'smart'. Best for the cell phone challenged. It has more features (it's an upgraded RAZR) than the last one. And the speaker volume is great. One thing I don't like is having to go into the layers to dig out the alarm silencer. It will keep reminding you until you \"disable\" it. It is also a heavier flip, and being a slick metal, is prone to dropping. You would do well to visit some sites to get the full specs. and different reviews to compare with others in the same category. But I'm very happy with it.'been", "Date": "August 9, 2010"}, {"Title": "It's alright.", "Author": "Russ", "ReviewID": "R1JCDUYS6OC1R", "Overall": "3.0", "Content": "The phone isn't great, but it works well enough for what I need. For now. I just wanted a slim phone to replace my razr v3 that wasn't overly chintzy and had decent battery life. I didn't want a smart phone; all that extra stuff isn't useful to me. I wouldn't carry a phone at all if I weren't required to have one.Problems I've encountered:First, I cannot disable the touch functionality on the front screen, so even with it programmed to lock, from time to time it'll go into camera mode and take pictures of my pocket or start browsing the web on its own. The leather pockets on my jacket are \"close enough\" for the phone to think I'm fiddling with it. This is especially after I miss a call - the front screen does not lock itself until I clear the missed call message and it will gladly browse and take pictures until then.Second, the internet cannot be shut off on the phone. I don't have a data plan, so any pocket browsing that takes place comes at a very steep premium. I've read that I have to go through AT&T; to shut off data completely, but the plan isn't in my name so I can't even do that.Third, which I am not sure if this is specific to my phone or it it's a problem with all of the razr v9 models, the battery door on the back does not stay on. The bottom two clips grab nicely, but there is no way for the top clips to attach to the phone, so the top just hangs loosely and from time to time the door just comes off. One of these times, the bottom clips are going to break off and the door will be permanently useless. At least the battery is in there tight enough that it doesn't shut off my phone when the door comes off.My razr v3 didn't have any of these problems. If I could take the battery out of this v9x and put it back in that, I'd use my old phone again instead. It's also quite clear that this new phone won't hold up for the six year span I've had that v3. The battery on that started to swell, so I figured it was time to update. They don't make them like they used to.", "Date": "December 5, 2011"}, {"Title": "very NIce!!", "Author": "Marco Tulio Moya \"Godzilla\"", "ReviewID": "R3OYFTGJ7MNVE6", "Overall": "4.0", "Content": "Cool looks. Great performer .  Solid look .  Got it for wife since she only likes clam shell type cells and she is not into the smart phones.", "Date": "October 10, 2011"}, {"Title": "Malfunctioning product", "Author": "valenteena slootsky", "ReviewID": "R32OGTBVM94OOK", "Overall": "1.0", "Content": "After purchasing this phone from the seller, it became immediately apparent that the phone did not function as it was supposed to. The battery does not hold a charge and as a result the phone is difficult to turn on. The voicemail features also do not work. When I went to the sellers location, they refused to stand behind their product, or even assist me. I am very dissatisfied with my experience with this seller, and this product.", "Date": "September 11, 2013"}, {"Title": "Not so good as my original", "Author": "Ben Cartwright", "ReviewID": "RRMM7NN65KWNH", "Overall": "2.0", "Content": "The phone itself is very nice, but when the flip is closed, it does not allow you to utilize the touch screen feature to use the MP3 feature so you can listen to your music as my orginal one allowed me to do..also, it keep vibrating while inside my pocket but the vibrating feature is not set on the phone..also the glass has cracked while inside my side pocket but I never sat down on the phone to initiate a cracking of the screen..Other than that, it makes and receives phone calls just fine with phone..", "Date": "July 18, 2013"}, {"Title": "Had problems but the company went the extra mile.", "Author": "Tom O. Ashwell", "ReviewID": "RKSAY35UM4J07", "Overall": "4.0", "Content": "Imortant update at the end, please check it out.When it arrived, it was unable to take picures.I had to send it back to them twice to get it fixed/replaced.I am not happy with the firmware. It has to be the most badly programmed piece of technology I have ever used. The operation is about as intuitive as a tax return. The buttons on the side should have been on the flip like earlier models, to prevent hitting them (especially the camera) too easily. More often than not it went into my pocket after a call, taking pictures inside my pocket. Also, there is a button on the side that keeps getting bumped that puts you into a serivice that you pay esxtra for. I don't use it but found out I was being builled $14 a month for it, so I have to call the carrier and see if I cna get that tekn off any future bills. I have no idea how it got automatically billed, but I bet just bumping the button can set that into motion if you don't catch it in time. Also, many web pages will not work with the built-in browser including YouTube. I downloaded a version of Opera and that wroked well surprisingly.Seems rugged, with a full metal frame, but the plastic buttons on the side are chrome plated and it wears off. I never dropped it but I suspect it would survive a few drops onto concrete like older RAZR models do.The micro-usb port is interesting, and I have worn out several charger plugs by plugging it in every day. Morotola Phone Tools will not work with it, so I lost the ability to use the internet from my phone on my laptop so I recently bought a 3G modem.Now, 18 months and a new battery after I got it working, its screen freezes on the AT&T; logo, and I cannot get it to run. It plays the srart-up swoosh sound but doesn't do anything else. I guess it is hatched. I even let it sit for a week with the battery out in hopes it would forget what digital weirdness that locked it up. No dice. I'll take it to a repair shop but I am not hopeful that they even service this kind of phone anymore.I suppose if you amortize the cost over 18 months, it was okay, but at almost $200 I am not replacing it. I am now using my older RAZR V3XX that this phone replaced. New battery for IT on the way. All in all I am NOT glad I bought it. If it had lasted longer, maybe. I spent the extra expecting better quality or longer lasting. Not so much.I cannot use the new smart phones as they make me sound like Stephen Hawking's real vooice. I have to use a RAZR. Well, I think I am going to get an older, less expensive model this time. Perhaps I will buy a few of them so I will have some replacements down the road. I could have had as many as 5 V3XXs for the cost fo this one phone.It has been nothing but trouble and never was a good phone, but it has been adequate.Important update:I was furious with them when they agreed to replair it out of warranty and it kept coming back in worse shape then when I sent it in. Well, I was childish and threw a tantrum. They responded by apologising and actually fixing it. Wow, now I feel as silly as I should. They really did go the extra mile, and I thank them for that! It's funny how finally getting good service cna set things to rights. All in all I guess I have to say they stand behind the product. That's very good. I have gone from not wanting to ever do business with them again to planning on buying my next phone from them. When the time comes, and I hope that isn't too soon...", "Date": "February 7, 2013"}, {"Title": "Smart flip phone", "Author": "User \"jedred\"", "ReviewID": "R1QVVPZ0PXCTTH", "Overall": "4.0", "Content": "I'm on my third in 5 years and have repeatedly passed on others.  I don't use the navigator or check my email but I can send videos and pictures from it.  I'm fast at texting with this kind of keys.  At work I need a phone I can put in my pockets with other pocket jetsam and flotsam.  I have to have a folding phone for this reason.  I just transfer the SIM from last phone.  I save every thing from phone to either the SIM or a micro flash for easy transfer to new phone.  I have software for it and headphones.  If I had a problem with it at all it would be that the headphone jack and micro USB jack for charging use the same port", "Date": "July 23, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "The large, vibrant, external display has expanded touch capabilities that allow you to immediately launch the most popular features.", "Name": "Motorola RAZR2 V9x GSM 3G Used Cell Phone AT&T", "ImgURL": "http://ecx.images-amazon.com/images/I/41h5oP3Mo-L._SY300_.jpg", "ProductID": "B003EM9UUC"}}