{"Reviews": [{"Title": "Very Satisfied", "Author": "J. Higgins \"Cohen\"", "ReviewID": "R2T1E8GHUKM6G4", "Overall": "5.0", "Content": "My wife got this for our Anniversary and I must say I'm pretty impressed with this little device. It's more fluid than my Satio and it feels better in my hand also, the camera obviously isn't comparable to the Satio but it has a great 8mp snapper in comparison to my C905. The only complaint I have about this phone is the fact that there is no Xenon flash accompanied by the LED flash for low light pictures, everything else is great about this phone and I hope to get the Xperia X10 next.", "Date": "November 2, 2010"}, {"Title": "I love this phone", "Author": "Mark V. Epelbaum \"Mordechi\"", "ReviewID": "R2JOI1ZH9ZSK1A", "Overall": "5.0", "Content": "I was traveling to Europe, to visit relatives in Ireland, I bought this phone because it's GSM capabilities would allow me to have a working cell phone during my visit. What I discovered is that the camera function on this phone is advanced that I did not even need to use any other camera. I have excellent high resolution pictures from my trip, all the dream like memories that i will treasure forever. Thank you SONY making the tools that make this life a more savoring experience.", "Date": "January 31, 2012"}, {"Title": "Hard to beat for the Price", "Author": "Mr Blister \"Mr. S\"", "ReviewID": "R3156RPRSCM9NL", "Overall": "5.0", "Content": "After my t-mobile free phone died on me, I wanted to upgrade to a touchscreen smart phone, but didn't want to spend hundreds of dollars. A buddy recommended the Vivaz and he couldn't have been more spot on. I love music and the music player is excellent. I though I'd miss the physical keyboard, but the Vivaz virtual keyboard does the trick. I find it responsive and very user friendly. The camera is pretty good, too. The screen is a bit small but the resolution is quite good. I've read people complain about the operating system but I find it intuitive and well thought out. A very good buy.", "Date": "January 30, 2012"}, {"Title": "its not unlock", "Author": "Ahmadnizamudeen", "ReviewID": "R20607F1IRCGMN", "Overall": "1.0", "Content": "the phone is not unlock and have to go buy a 20 code I am not finding the code for the phone.", "Date": "June 14, 2013"}, {"Title": "Objection to the sale of counterfeit", "Author": "mitra", "ReviewID": "R38LNQURQS0R1U", "Overall": "1.0", "Content": "I bought this for gift and it was not International cell phone it was for at&t; and it does not work in my country and it made me embarrass, and I did not know what should I do", "Date": "September 14, 2013"}, {"Title": "Not Unlocked", "Author": "Seth \"twriff\"", "ReviewID": "R13UG7BJKI0UE1", "Overall": "3.0", "Content": "I received the phone yesterday, 7-10-13. In the description of the phones, it specifically stated it was \"unlocked\". It was not, and I was able to contact AT&T; who provided me with a code to unlock. Also, the memory slot given as part of the package, was not 8 gigs, it was a 2 gig card.", "Date": "July 11, 2013"}, {"Title": "Beautiful phone.", "Author": "Jill Carpenter", "ReviewID": "R2YJDDVNO8W1H1", "Overall": "4.0", "Content": "I'm still learning and bonding with my phone since acquiring it in April. This is my first smart phone, but it's a great transition from old school to the new models.  I happened upon this phone after months of researching affordable phones and features, I was ready to give up and settle for something less. And then I saw this blue Sony Ericsson Vivaz U5.  I was drawn to the 3G phone with the 8 mp camera and recording features that are easy to operate. However, I'm disappointed in my night and long-distance photo quality. It takes great action shots of kids on trampolines! I love the 3 options for texting, plus the slimness, lightness, and is easy to hold. The screen size is just right, and the scrolling is easy.  As for battery, I only recharge a couple times a week--depending on camera use. It recharges pretty quick within an hour or two. One annoyance is whenever the phone is not used for a couple of minutes, it reverts to locked mode, (kind of kid-proofed), but all I have to do is press the green \"on\" button once and hit the \"Unlock\" and I can place calls. I still haven't figured out how to transfer my pictures from the phone to my computer or on-line, even using the USB cord attached to the charger cord that came with the phone. The phone was set up for AT&T; which means it was new, but still locked. Issue was resolved after a week's worth of e-mails. Although it has lots of apps, I don't use the Internet with it because I currently use Net10 prepaid service that requires the $50 card, but doesn't include data. I'm very happy with it,", "Date": "July 3, 2013"}, {"Title": "Not that bad for the price.", "Author": "Michael", "ReviewID": "R2QH10OR56AFO", "Overall": "3.0", "Content": "This phone is not that bad for the price. It takes time to learn how to use it. And worst thing in this phone is way outdated Symbian operation system. Another things are not bad.", "Date": "March 12, 2013"}, {"Title": "Bad mobile", "Author": "DaTo", "ReviewID": "R17OBZ2BLX6NZ3", "Overall": "1.0", "Content": "this is \"at&t;\" mobile phone, nobody buy this mobile phone,  in picture is not designation, that mobile phone is \"at&t;\" style", "Date": "March 6, 2013"}, {"Title": "Muy Bueno", "Author": "Gabriel", "ReviewID": "R1C6GQDJ8KDPRI", "Overall": "5.0", "Content": "El articulo tal cual como describia el vendedor, el paquete arrivo en el tiempo previsto y el embalaje era el adecuado. No tengo ninguna queja.", "Date": "February 11, 2013"}, {"Title": "The Haunting of....Sony Vivaz", "Author": "Caryss Wood-Behan", "ReviewID": "R38WFDMER28V58", "Overall": "2.0", "Content": "Might a cellphone be possessed?  Once you've tried operating a Sony Vivaz phone you might find yourself pondering the possibility that the device contains more than software and megabytes.I have always favored low-to-mid priced Sony Ericsson cellphones for their simplicity, easy but interesting camera features and good reception/sound quality, not to mention durability.  Then the Vivaz came along and changed my mind about Sony Ericsson - or, rather, Sony Xperia - cellphones.The phone does boast one merit, evidenced by its better than average reception and clarity during calls which rarely, if ever, give way to annoying \"echoes\" or inaudible, spotty call content.Although I anticipated very good picture quality from this phone, the Vivaz did not deliver. Picture quality seemed mediocre, at best.  The editing features that came with older Sony Ericsson phones also appear on this phone, yet they did not perform to the same high level of its predecessors.The Vivaz' touch screen doesn't seem to know how, when or IF it should respond; furthermore, the phone's cursor often haphazardly skitters from one icon to another, landing on whichever menu option it chooses.  Several attempts are usually needed before the desired item or icon finally opens. To further complicate matters, the Vivaz exhibits confusion over whether to call a name/number from the contact list or to send the contact a text message.  The confusion generated by this \"Smartphone\" knows no limits.One of the most frustrating kinks in this phone results from inadvertently neglecting to Exit the keypad after placing a call. If the keypad remains in place when making a call, the caller's voice will not transmit clearly. The imperfections do not end there; the Sony Vivaz goes dark in daylight which presents yet another obstacle in the operation of this phone; specifically, the phone cannot be properly utilized when nothing is visible on the screen.And the Vivaz's vices continue to pile up.  Applications open without prompting. It's as though the phone has been programmed to push these pricey features in the user's face.  While actually connecting to the internet presents no problem  - indeed, the internet often connects without even touching the screen - websites take an eternity to finally appear, advancing sluggishly and haltingly.Certainly even a semi-smartphone should know the correct time, right? Not on Vivaz' watch.  The clock sometimes resets itself to reflect the incorrect time. Adjusting the clock to show the correct time ought to be effortless but, alas, Vivaz doesn't recognize the word \"easy,\" often requiring multiple attempts before the clock finally registers the accurate time and time zone. Yet the Vivaz' high jinx keep coming:  Despite locking the device, it will often set itself to \"silent\" or even \"flight mode,\" which invariably leads to missed calls and wasted time.The Sony Xperia moguls should hang their heads in shame over this disastrous product. They would do well to turn back the hands of time, giving Sony loyalists and new customers the superior mobile phones associated with the name \"Sony.\"  As it now stands, the Vivaz is nothing more than a ghost of the Sony cellphone we once knew.", "Date": "February 10, 2013"}, {"Title": "Phone starts out good but has major issues", "Author": "Skylineat24", "ReviewID": "R3MPGVJLLEYQK", "Overall": "1.0", "Content": "This phone started off really awesome had a wonderful time using it. After a few months that's when the problem started happening I would lose battery power even though all the programs where closed and the phone was never used. The second problem is the time would be delayed it would go back a few minutes not being accurate and you would have to sync or update the time manually.", "Date": "December 19, 2012"}], "ProductInfo": {"Price": "$88.00", "Features": "The Sony Ericsson Kurara is going to be packed with an 8.1 megapixel camera with auto focus\nThe internal memory of this gadget is going to be of 75MB but you will be able to extend it up to 16GB plus", "Name": "Sony Ericsson Unlocked Vivaz U5 U5i (Blue) Unlocked, International Version with No Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/41pDQD27SnL._SX300_.jpg", "ProductID": "B003DSIE0E"}}