{"Reviews": [{"Title": "Good choice", "Author": "W. Oliveira", "ReviewID": "R1J5I01GO9P3JV", "Overall": "4.0", "Content": "This is my first smartphone, and I admit I was having mixed feelings after my bad experience with my \"old\" Nokia N82. However I was positively surprised by some aspects of the device, specially the responsiveness and the usability. It is really easy to use, I gave it to my mom (she's 60 and always has problems to use tech stuff) and she just started to use it! Now after 2 weeks I think I have some contribution...What I liked:The touchscreen works very well, with some inaccuracy, only perceived in rare occasions when I need to click a link without zooming in the screenThe speed: usually it is very fast to switch from an app to another.Live Wallpaper: very impressive (although I suspect it eats the battery).\"Modem\" feature: in 30 seconds my laptop was connected to the Internet using the phone's 3G network, and without any cable!Camera: comes with all those candies the modern cameras have. I liked the Panorama.Display: amazing colors and cristal clear, can be used even at direct sunlight.Unlock Pattern: Sounds like a silly thing, but I liked it!Power profile: it shows how much of the battery is being consumed and by application, and then you may have a chance to improve battery life. In my case the display is by far the most battery eater, so there's not too much I can do, except do not use it.What workedWeb browser. It was able to render every page I've visited, it is fast and easy to use.Multi screen. It is nice to have more than one screen. I know it should be very useful, I just don't know for what.Swype: surprisingly easy to use, just needs some improvement on word prediction.Maps and traffic information.What could be improvedSoftware shop definitely needs to be improved, for example: I want the possibility to sort out search results, I want more filter options, and, of course, more software available. Also, some kind of security review/karma would be useful. Some form of accreditation of the suppliers also could help. I'm not saying I want the Apple dictatorial system, but I think some basic security indication/checking/verification would be good.Wifi: It works OK most of the time, but sometimes it does not connect automatically and then I have to go to the list of networks and click on the \"Connect\" button.3G: it took me some time to understand how to configure the network.  I still not 100% sure I could do it again if I lost the configuration...Applications:  too many applications, poorly organized. I'd like to have a way to group them in a logical way or inside a folder, specially those rarely used (may be there is a way and I just need to learn how to use it).Language: The default language is Korean or Chinese (I'm ignorant and I don't know the difference between the ideograms).  It should come in English!Language Support: definitely need to have Portuguese support.Speech recognition (Vlingo): That's a bad joke. I say SECTOR, it understands SEX STORE. Hmmm, is it reading my mind? :)Battery Life: It lasts for one day, in a good day. Much less if you are a heavy user.Access device's storage: That's tricky!  I spent a whole day trying to find a way to use the device's media on Linux... And then I found the problem: the SD card need to be unmounted first! (settings/SD card/Unmount SD card). Once I did that it worked.GPS: The initial lock takes much longer than Nokia N82.3G usage: I don't know how much data is being transmitted/received, let's see the next phone bill. That \"background transfer\" \"feature\" is my concern. Also, it could have some sort of carrier/network type selection, it is always using the network even when the only network available is Edge. OK, maybe it already has this control and I just don't know where it is.Lateral buttons: I'm always mistakenly pressing the buttons.Glitches: It hanged a couple of times. One of the times I had to remove the battery to get it back. Sad.", "Date": "October 15, 2010"}, {"Title": "Not really unlocked", "Author": "Jairo_Sanchez \"JS\"", "ReviewID": "RS1H5U82H8KTS", "Overall": "2.0", "Content": "Product offered said \"Unlocked\", nonetheless it was not and I needed to pay an extra of USD60 to really unlock the phone.Will Amazon or the reseller, take any action on this?", "Date": "February 7, 2011"}, {"Title": "powerful yet elegant", "Author": "R. Dimacali \"waka-laka\"", "ReviewID": "R3CXXZYMT7F9WV", "Overall": "5.0", "Content": "this phone is simply one of the best looking phones out there and also one of the powerful ones.this phone truly shine in the graphics department. i myself don't expect a lot from mobile games but saying \"amazing\" when playing games like need for speed shift, nova, backbreaker, etc. is an understatement.it takes 720p video and high res images up to 2560x1920. the camera has plenty of functions which you can find similar to a digital camera, like smile shutter, panoramic, burst shot, cartoon effects, action shot and more. self portrait shots are taken with the front facing camera.using this phone in a 3G network (for me, it's AT&T;), is really satisfying. accessing full websites with the browser is like using a tablet computer. pinch-to-zoom and scrolling through websites is really smooth. downloading files works well too.the UI of the phone is great. some people don't like the TouchWiz UI, but at the same time, i don't really like the stock android skin. apps such as launcher pro plus and adw launcher can add customization for the UI. so you're not limited on how the menus look.widgets are another features that i do like and this phone runs them smoothly. live wallpapers is also supported.this device support a great amount of video and image files. i tested it by putting a 720p .H264 DivX video and played smoothly with no lags. i did some scrolling through the video and yet there is still no lag considering it's an hd movie that's playing.messaging is in thread form. supports mms for sending images, audio, video. the I9000-GT also supports video calling built in using the front camera. AT&T; doesn't support that but i tried it with an app called fring and it works over wifi or 3G.calendar sync for google calendar is also supported. it also includes ThinkFree Office which lets you edit/create/view Word, Excel, PowerPoint, and Adobe PDF files.the Super AMOLED screen is really great! i love to be able to view what's on my phone when i'm outside or under the sun, if you're worried about that then worry no more!it annoys me sometimes how the screen is ridiculously bright in the dark even at the lowest settings. but that's a great thing! haha!watching movies on this 4 inch screen is great although the battery won't last very long if used that way.call quality is pretty good. no dropped calls nor signal lost so far.overall, i'm completely satisfied with this phone! i'm a phone addict and when i got this amazing device, i just stopped looking for other phones.all the features that i need and want are all in the Galaxy S and apps from the Android marketplace makes this phone worth more.", "Date": "September 17, 2010"}, {"Title": "No para latinoamérica", "Author": "Jorge Aguilar", "ReviewID": "R1XPRNTT3I6OA", "Overall": "4.0", "Content": "El teléfono es muy bueno, pero muchas redes de latinoamérica no trabajan con la banda 850 en 3G, solo en 2G, lo que hace que el acceso a datos sea lento. Buscar el i9000t, ese no tiene este problema.", "Date": "May 19, 2011"}, {"Title": "Great phone, Great OS.", "Author": "Sharon Cohen", "ReviewID": "R1ME02OSARRSQ3", "Overall": "5.0", "Content": "I just inserted the SIM and start the phone and worked just fine.A day after I upgraded it OS to Android 2.2.1 with Hebrew support easily.This is a great phone for everyone who needs a smartphone.The GPs is working just fine.", "Date": "May 4, 2011"}, {"Title": "Great SmartPhone!", "Author": "leorexz", "ReviewID": "R32J3UYUW6NVOD", "Overall": "5.0", "Content": "The Samsung Galaxy S is the best smartphone i ever had.The best things on this device are the 4\" Super Amoled Screen with a very precise multitouch, the very fast 1Ghz Processor with a ingredible GPU, the 512mb of RAM and the Android OS.The only thing i miss on this device is a flash for the camera.", "Date": "October 1, 2010"}, {"Title": "Do NOT buy products from - Best N Price", "Author": "Darren Mathura", "ReviewID": "R1K3VMPIM7VHIM", "Overall": "1.0", "Content": "Do NOT buy products from - Best N PriceI bought the Galaxy S, it arrived in a different language, I had to pay to have it changed to English. The phone cannot recieve calls, it forwards all calls to voicemail, even with all the caller reject functions OFF. It freezes up alot and re-starts itself alot. I am not sure if this is a manufacture problem or if Best N Price sold me a faulty product. I think it was a refurbished phone they sold as a new one. I tried to contact them but they sold the phone without warranty, so they relied...I \"I cannot help you\"", "Date": "May 21, 2012"}, {"Title": "Screen failed in only 10 months :-(( Samsung Galaxy S", "Author": "Chuck", "ReviewID": "RYNVNA153748T", "Overall": "1.0", "Content": "I bought this phone for my fiancee in October, it arrived in early November and was a joy to behold. Huge beautiful screen and my first Android phone. I loved it so much I bought one for myself 3 months later. Then 1 week ago (10 months into ownership) the screen showed signs of burn-in. A pink hue spread out from the bottom of the screen and now has started to form black spots with the rest of the screen retaining text and icons from the previous screen. It is so disappointing. Contacting the FGS shopfront that sold it gave me nothing, they just said \"sorry\"... I am not very happy about their response, and will let other consumers know about this.Contacting Samsung has also been less than easy. Their US website is useless for an international version of the phone that I bought because of the carrier tie-ups they have and their site does not even make provision for the GT-I9000. Direct email is unanswered also. Very disappointed in the manufacturer.Although I loved this phone, the failure of the major component (this is a touch screen phone after all) in less than a year makes the investment unjustifiable. I want a phone that works for at least 12 months if I am paying $600. I cared for it correctly. Never dropped it (I was very protective of my pocket baby) and to have this happen is very troubling.Buyer beware.Chuck", "Date": "September 19, 2011"}, {"Title": "awesome", "Author": "Ali", "ReviewID": "R21A6RR49R53LR", "Overall": "5.0", "Content": "When I placed my order, I was kinda doubtful about my decision, but once I received it, I thought I would never change it with an iphone!!! I had a iphone 3gs previously, this one is much lighter than that one, and also lighter than my friend's iphone 4g. It has a sleek appearance. The main page has room for some applications, you don't see all of those icons at the first glance. The camera is great, finally it is more budget friendly.", "Date": "April 7, 2011"}, {"Title": "The PHONE, perfect", "Author": "Michael Wootton", "ReviewID": "R3GZ6MPBGUZI7Y", "Overall": "5.0", "Content": "The Galaxy S arrived perfectly packed on its case, and it was the best purchase I made in cell phones in a long time, The internet is full of customizations, Firmware changes for the international version, so it was easy to update the firmware to Froyo and even to load a customized Firmware by DARKY. Just spent some hours searching and studying how to do it, and voila, a brand new Galasy S International, unlocked with a customized Firmware, working perfectly in Brazil.Great purchase, arruved perfectly and I am very satisfied", "Date": "February 20, 2011"}, {"Title": "Best Cost-Benefit Smartphone", "Author": "Emerson", "ReviewID": "RUWJZ7751I3IM", "Overall": "5.0", "Content": "This is my 2nd smartphone, but the first with a touchscreen, and I'm quite happy with it. It is very easy to use, and there are a lot of functionality that don't leave it behind of the iphone 4. yet it is lighter than iphone, and have a Super amoled Screen. It is already unlocked.I'm using it here in Brazil with TIM, and works perfectly. But this international version does not have Digital TV as an option, although the Brazilian Version sold here comes with, but has a very higher price (almost double price). As we can find in so many differents reviews, this phones lacks a flash for its camera, but still the Photo pictures at night shoots have a very good quality.I already upgraded to Android 2.2.1, that makes it a little bit faster.I did have some trouble using its GPS without a 3G or wifi connection, because the Google Maps probably need some kind of internet connection, but you can download other GPS navigators.I highly recommend this Smartphone.", "Date": "February 6, 2011"}, {"Title": "Samsung Galaxy S", "Author": "kozerog1", "ReviewID": "R1XZ8KJS1E8DMP", "Overall": "2.0", "Content": "The main issue was that \"Recovery\" and \"Download\" modes did not work on that phone. I had to spend about 2 days for digging into Internet to find how to make \"Recovery\" and \"Download\" working.The other issue is that wall charger ceased to work after about 2 weeks (it starts charging and suddenly stops - without any visible reason - after ~20 sec.) Charging now through USB and am going to buy a replacement wall charger soon.It's also coming with older version: 2.1, not 2.2All above is manageable, however requires time and building some expertise. Not recommended for basic \"plug&play;\" user.Besides that everything's fine so far :-)", "Date": "February 27, 2011"}, {"Title": "A very happy customer", "Author": "mypenname", "ReviewID": "R3DYZKMM5G5HWS", "Overall": "5.0", "Content": "This was the best online purchase I've made.The phone arrived quickly and in mint condition, as promised, and it's absolutely wonderful.The best thing about the phone is the screen, which is bright and colorful.The camera is of excellent quality (can't compete with a real camera yet, but that's understandable).I think the Android operating system is very cool, and I'm still discovering little things that make daily usage more and more comfortable and enjoyable.I highly recommend this phone.", "Date": "November 6, 2010"}, {"Title": "Signal problem", "Author": "Edwin Olivo", "ReviewID": "RXGXO4D8UI95Z", "Overall": "3.0", "Content": "I`m from Venezuela, I use the phone with movistar and I had problems with the signal, the signal goes up and down frequently and have had many missed calls", "Date": "February 6, 2012"}, {"Title": "Great choice!", "Author": "David Suescun Ramirez \"uniquekaiser\"", "ReviewID": "R3BE7EBF7IIO7Q", "Overall": "4.0", "Content": "I'm really happy about buying this over iphone :DI do have a small issue, but is my fault, i wanted to use one of the custom ROMs out there and i ended up messing up the phone as i can't get any signal now... but it was working out of the box.. could anyone that has bought this phone (the one sold on this page) please type *#1234# on their phone and tell me which version it is??PDS:PHONE:CSCBuild Info:??? thanks!!!!", "Date": "May 29, 2011"}, {"Title": "South Coast Alaska", "Author": "Mr Andy", "ReviewID": "RBPD29QYZ5P3H", "Overall": "5.0", "Content": "i love this smartphone i have its been one year and six month by now its working great and gotta have it it can work any Sim card any carrier was thinking to get one too i love it and it have fast shipping to Alaska about three to five days wow thats how fast it is i never had a problem with it hope one of each of you gotta have this smart phone and it have wi-fi 8gb build in and it can use sd card", "Date": "July 12, 2012"}, {"Title": "Nice phone - poor service", "Author": "Bev-Lee", "ReviewID": "R1ZPZHB70CVM75", "Overall": "3.0", "Content": "I got this as a Christmas gift and I like the phone - I've had 2 Samsung phones before.However, the default language was not English.  Amazon's customer service person had the temerity to tell me to return the phone and order the \"correct\" one: As if I would expect a phone ordered off a U.S. site to have Croatian, or Russian as the default language!In addition, the charger was European, round prongs instead of flat.Through trial and error I was able to change the language, but the responses from Amazon have been really unhelpful and disappointing.I buy from Amazon for the customer service and their support of their products.  If they don't intend to provide that for the vendors on their site, the Amazon group will not be my 1st choice for online purchases.", "Date": "December 31, 2011"}, {"Title": "Excellent product!!!", "Author": "Ivan", "ReviewID": "RGMU15P7PCBBL", "Overall": "5.0", "Content": "After one month comparing phones, I finally went with this one. Certainly an unlocked phone. It runs smoothly like an IPhone but for a better price and more apps, never freezes unlike a BB Torch, user friendly thanks to Android OS and reasonable battery endurance like a Nokia. Its FM Radio feature, GPS and better price makes this phone the best choice. It runs several apps at once, and I had no problem connecting it to the wi-fi or 3G. Android market offers a lot of useful apps for the Galaxy. The only \"problem\" I had was plugging the headset: The plug is hard to push into its place, making one afraid of damaging the device, so you have to be sure it goes all the way into its plug hole for proper functioning. Very good sound. Video quality is excellent, fast downloads from internet. The AMOLED screen size, resolution and brightness gives you good visibility an ease of use even under sunlight. Good for those we use reading glasses!!!", "Date": "August 11, 2011"}, {"Title": "Amazing Screen", "Author": "Richard G. Kaufer \"RichardsControlCenter\"", "ReviewID": "R8S74N9QLP6UO", "Overall": "4.0", "Content": "The only down side, for me, is the NOT ENOUGH SPEAKER VOLUME, weather earpiece or hands free. I lost my Motorola Milestone for wich I havent found happy replacement yet, not even with the recently bought Motorola ATrix... And I dont have hearing problems, its just that I work in a nosy environment and the Motorola Milestone has no match. I will probably try the Milestone 2 after the Atrix, going back in specs, but up in happiness ??", "Date": "August 8, 2011"}, {"Title": "Great phone. Hard to get started.", "Author": "Riki", "ReviewID": "R2CY7R5KFOQ4AT", "Overall": "4.0", "Content": "We unpacked this phone and were confronted with Greek (I think).  There were no instructions and no way to get to an English screen.  After hours of researching on the net and fiddling with it, my son guessed and pressed a number of buttons and found a spot where it asked if we wanted English.  It was extremely confusing!!!!!We love the phone but... we live in Israel and found out that we can't put Hebrew on it whereas if we had purchased it here (for double the price) we could have switched between Hebrew and English at will.We are a bit nervous about the fact that there is no warranty on the phone. Hoping it won't break.As far as the phone itself, works nicely. Good reception and works in Israel.", "Date": "July 4, 2011"}, {"Title": "Samsung Galaxy S", "Author": "Jonatan", "ReviewID": "R3T97TUAIWNCK9", "Overall": "4.0", "Content": "This is the best celphone that i had. It works perfectly in Brazil whith OI. The battery takes 24 hours, but with Juice Defender app, it takes more 12 hours. The camera is great, but lacks flash. For the brazilian consumers: there is no TV in internacional version.", "Date": "June 21, 2011"}, {"Title": "Amazing Device", "Author": "methylamine", "ReviewID": "R3EHDQ10HE27L2", "Overall": "5.0", "Content": "This phone is feature packed and has yet to disappoint me. Works perfectly on AT&T;'s 1900 WCDMA 3.5G BandI've used Nokia N97, E72, N95 and they can't even compare to how wonderful the galaxy i9000 is.I've owned one since August 2010 and I still use it today as my primary phone. I used to flip phones every 6 months but since this device is so feature laden and fast I see no reason to upgrade to the galaxy s II this year. It definitely is a keeper for another year until Samsung upgrades their screen resolution to QHD on their Galaxy s III.Again you can't go wrong with this phone especially @ $440 w/ free amazon shipping.A few suggestions for those who buy this phone.1. Root it and install Titanium backup2. Install a screen protector to protect that gorgeous screen as well as a protective shell3. Get an additional micro sd card for additional storage.This isn't a phone for your mom because things can get a little tricky for novices or non tech savvy people. This is because Android offers so much customization it's easy to get lost in the settings for the phone and individual apps.Other than that you WILL enjoy this phone!", "Date": "June 14, 2011"}, {"Title": "samsung galaxy  s the best", "Author": "luis felipe", "ReviewID": "R2BHX6ZH0BZ2FB", "Overall": "5.0", "Content": "Is really surprised by the delivery was quick, in perfect physical condition, you have nothing to envy to other phones, you have all social networks, many applications, unjco to improve is the battery so use it only lasts a day without talking much, I had to buy one for amazon, but in conclusion is a great phone", "Date": "May 27, 2011"}, {"Title": "marcelo's samsung galaxy purchase review", "Author": "marcelo carrasco", "ReviewID": "R3DUIU0PNDUJ1P", "Overall": "5.0", "Content": "The phone it's awesome, everything came as it should, delivery on time, fare price, basically, I have no complaints.Thanks", "Date": "May 5, 2011"}, {"Title": "Fantastic smartphone", "Author": "Anderson V. Medeiros", "ReviewID": "R1QM0V4721XLG1", "Overall": "4.0", "Content": "Works perfectly in TIM Sao Paulo, Brazil. It is really unblocked. I don't miss the digital TV from the brazilian version.Update: after around two years using this smartphone it became painfully slow. I just replaced it by an iPhone 4, which is much much faster.", "Date": "March 16, 2011"}, {"Title": "300$ ?!", "Author": "Yan Michalevsky", "ReviewID": "RJ0AYVXB47SL6", "Overall": "2.0", "Content": "Looks like a pretty bad deal given the price of the LG Nexus 4 on Google Play which is about 190$-240$ depending on the SD storage size.", "Date": "September 21, 2013"}, {"Title": "I like it!", "Author": "Rodrigo Costa da Silva", "ReviewID": "R30ZJ6MRE9ZN1K", "Overall": "4.0", "Content": "I liked it so much! It's a new and sophistical cell phone. It arrived on good conditions and I recommend this one.", "Date": "August 7, 2013"}, {"Title": "Can't get a signel unless I'm standing 300 or so feet from a cell tower", "Author": "Richard A. Williams", "ReviewID": "R1FGBMTEOE6RT5", "Overall": "1.0", "Content": "I've been using cell phone for years. My first one was a Nokia .Every time I change my phone was because i wanted to try something new, so I would get another nokia. Whey I saw this phone, I said to myself, this looks like a good smart phone give it a try because it has wifi,gsm and unlock, but was I in for a surprise. For me to get a signel I have to be at lease 300ft from a cell tower. This is a piece of garbage. I taught Samsung was the next generation phone, and I was right by the next generation they will get it right. back to my Nokia.", "Date": "August 2, 2013"}, {"Title": "Not pleased!", "Author": "Wleah", "ReviewID": "R1UU5URQOPFD2W", "Overall": "3.0", "Content": "The phone was suppose to be new not refurbished! It came from hong kong ,the apps download very slow,the battery life is horrible it takes 8 hours or more to charge! Not to mention the phone was set in chinese the screen freezes while im texting! Need say more?", "Date": "April 30, 2013"}, {"Title": "My best friend", "Author": "Fisherman", "ReviewID": "R14IMMPAJS3L7V", "Overall": "5.0", "Content": "Everything is excellent and met my expectations, I am having my first experiences with Android OS. Certainly, I would recommend it", "Date": "March 17, 2013"}, {"Title": "Original Phone", "Author": "Eduardo Akino", "ReviewID": "RB8FLHY36D5ZE", "Overall": "5.0", "Content": "I was afraid of getting scammed getting a Korean fake cell phone, but I got just what the description reads An original Samsung I9000 cell and for a very good price!", "Date": "February 16, 2013"}, {"Title": "EXCELENTE EQUIPO!!!", "Author": "arelysdelgado", "ReviewID": "RU72JYXQ1PJTV", "Overall": "5.0", "Content": "Adquifi este telefono y ha sido una compra buenisima!!! me llego en poco tiempo, aun y cuando realice la compra en epoca decembrina. Lo recomiendo 100%. Vendedor excelente, muy responsable. GRACIAS!!!", "Date": "December 3, 2012"}, {"Title": "Very good", "Author": "Danny Marcelo Lobato", "ReviewID": "R3F3VW0Y3LX1SJ", "Overall": "5.0", "Content": "I like this product, is a famous brand and is very well manufactured, in a word excellent, highly recommended for all", "Date": "February 14, 2012"}, {"Title": "Wonderful", "Author": "Sandra", "ReviewID": "R2G8K4M67VX4O2", "Overall": "5.0", "Content": "Samsung I9000 8 GB Galaxy S Unlocked GSM Smartphone with 5 MP Camera, Android OS, Touchscreen, Wi-Fi, GPS and MicroSD Slot - Unlocked Phone - No Warranty - BlackEasy to use, good size and has everything I need", "Date": "February 9, 2012"}, {"Title": "Excelente telefono.", "Author": "Mariangela Leal", "ReviewID": "R1CIXTIP77C20T", "Overall": "5.0", "Content": "Excelente telefono, excelente vendedor, recomendado 100%, despachado a tiempo y tal como se ofrece en el anuncio, viene desbloqueado y el 3g trabaja muy bien....", "Date": "February 6, 2012"}, {"Title": "Wonderful replacement for a BB!!", "Author": "A. TERAN \"ATE\"", "ReviewID": "R3BD88X9ZN9CK8", "Overall": "5.0", "Content": "Moving from a BB 9350 was like drive a 56 Chevy and receive a 2012 Camaro! Powerful, intuitive and 50% of tag price of Iphone!", "Date": "January 3, 2012"}, {"Title": "Great phone, but 3g wont works in southamerica", "Author": "Adrian costa", "ReviewID": "R1US6WK7NB6BRB", "Overall": "3.0", "Content": "The phone is great, lighht, fast, good design. OS Upgradeable ,But the thing is 3g wont works in Southamerica. The description says the opposite.  And obviously im not living in Us so i cant make the reinbursment with the seller. So my advice, check the carrier requirements and ask ask ask to the seller if the equipment works", "Date": "December 8, 2011"}, {"Title": "Great smartphone", "Author": "Erick Alejandro Lau", "ReviewID": "R2RSRGZ2X8OG6D", "Overall": "5.0", "Content": "I bought this phone 6 months ago and I am totally satisfied with functionality, performance, customization. The screen looks way better than iphone 4. I have upgraded Android several times, now I am with Gingerbread 2.3.5 and waiting for Ice Cream Sandwich to be released for this device.I have not had the chance to test video-out function, since I don't have the required cable.Only thing I miss is voice dialing, which was great on my BB 9300, but is really bad in Android. But I think that's a problem with Android, not this specific device. I use a bluetoogh headphone and answering calls is not a problem, but for dialing I have to do it on the touch screen.", "Date": "November 28, 2011"}, {"Title": "its okey", "Author": "yvan lattuf", "ReviewID": "R3SYJTVRL5WBNA", "Overall": "5.0", "Content": "Nice cell, very versatile, efficient, in samsung`s mobile phones  Android operating system is more stable operating. I am very happy with this purchase", "Date": "November 23, 2011"}, {"Title": "Good Phone,", "Author": "Feroz", "ReviewID": "R2T8F0HDILAMPJ", "Overall": "4.0", "Content": "Good--1. Display is nice and clear perfect video and pictures.2. Body is slim, light weight, camera is great picures are always clear and sharp, Video quality HD perfect. No noise on low light pictures and videos.3. Sound great, 3.5 mm audio jack. You  can connect to TV.4. Total 8GB memory. You get 1.6 GB for programm and 6GB as internal SD card.5. Mike works nice.BAD--USB slot on TOP which causes to band the cable while using it as GPS. GPS is crappy does not work at all. But can be fixed by installing GPS Aid for it from android market free version. After that it works OK but still poor compare to Garmin.No dedicated camera button.Speaker sound is irritating at full volume. Battery life better just OK.Pixel windows are larger. so instead of such a high pixel density, you can still see each pixel clearly.The screen or digitizer is very sensitive to scratch. I got so many scratch in one day without protector. There is no flash for camera.", "Date": "October 27, 2011"}, {"Title": "No. 1 Phone today - but get it from the operator!", "Author": "Ben", "ReviewID": "RHVTF0HJRYLE8", "Overall": "2.0", "Content": "I have this phone for some 3 weeks now. Love it more every day. Very powerful, sleek looking and great.I was a heavy Blackberry user for years, and this phone and the Android 2.1 is lights years ahead of the BB.My advice - do not think twice - get this phone!Update - Update - Update:This device has European frequencies. What that means is that it will NOT support 3G. This does not show in the data the seller provides, but if you want 3G - it will not work (T-Mobile).Returned it. Will buy with T-Mobile (also cheaper)", "Date": "September 10, 2010"}, {"Title": "wonderful phone compared to the price .", "Author": "abdullah ali al-enezi", "ReviewID": "R8QMDIRM51ALB", "Overall": "4.0", "Content": "he was wonderful phone but Samsung store frustrated hopes, there is no comparison with the iTunes store , deserve four stars ^_^", "Date": "April 14, 2011"}, {"Title": "samsung best phone so far", "Author": "JAYDEE", "ReviewID": "R1UZRDYG0T8CDY", "Overall": "4.0", "Content": "let me start by saying this best is samsung phone right now when it came out i got it right away.One of the worst-kept secrets of MWC this year -- the Galaxy S II -- is finally official, and we'd say it definitely lives up to its name as a proper successor to the original Galaxy S that lit the Android marketplace on fire last year. Major (and largely expected) features include a 4.27-inch 800 x 480 Super AMOLED Plus display, an 8 megapixel primary camera with 1080p video capture accompanied by a 2 megapixel cam up front, Gingerbread with TouchWiz 4.0, integrated NFC support (on some versions), and a shell measuring just 8.49mm thick, making it likely the thinnest smartphone ever to roll off an assembly line -- in fact, it's over 0.2mm slimmer than the Sony Ericsson Xperia Arc's thinnest point. The biggest news here, though, might be that Sammy's going with an NVIDIA Tegra 2 core -- the same as the LG Optimus 2X, Motorola Atrix 4G, and Droid Bionic -- despite the fact that its own Exynos 4210 was just announced for March production.Update: We were originally told that the Galaxy S II would be using an NVIDIA Tegra 2 SOC, but have been informed that was incorrect -- the phone will indeed have a dual-core 1GHz Samsung chip, and quite possibly the Exynos. There's also 1GB of RAM.We were able to spend a little bit of time with the Galaxy S II today, and we can conclusively say that this is one gorgeous device. It shares the Infuse 4G's aspirations as an ultra-thin Android device and arguably shares most of its industrial design elements, but interestingly, the Infuse steps down from 4.5 to 4.3 inches -- either a nod to the fact that 4.5 is too big for a mainstream smartphone, or a sign that the 4.5-inch Super AMOLED Plus component simply isn't ready yet. You totally notice how ridiculously thin the phone is as it rests in your hand, and the effect is amplified by the fact that it's got so much surface area -- the screen-to-edge ratio is off the charts. Though we still prefer the stock Android experience, TouchWiz 4.0 (as it's being called) on top of Gingerbread is clearly Samsung's most refined custom Android skin to date; a new Game Hub in ROM has potential to do battle with Sony's PlayStation Suite and allows developers to bypass the download size limits of the Android Market, but we weren't able to test it on the preproduction unit we were given.Owing to a lack of time and connectivity, we weren't able to put the phone through a suite of speed tests, but the entire UI felt perfect fast and smooth, a testament to the processor's chops. As at CES, we were blown away by the clarity and brightness of the Super AMOLED Plus display -- picture the already-excellent Super AMOLED technology amped up on steroids, and you'll have a good sense of what we're talking about here. All told, this seems like a great upgrade to the Galaxy S; if anything, we're a little concerned that it's going to be a smidge too big for people that were perfectly happy at the 4-inch tier, but odds are good Samsung will continue to crank out smaller devices for those folks. It'll be on the market in parts of Europe and Asia as soon as this month; no word on North America, but as always, there's little doubt Samsung has some plans in the works. Follow the break for our quick video and the full press release.", "Date": "March 12, 2011"}, {"Title": "Good Deal", "Author": "Metin", "ReviewID": "R3JYMVY7HKJPWP", "Overall": "4.0", "Content": "I bought this phone as a gift to my friend and I am glad with that. I prefer it to Iphone considering the value for the money.", "Date": "November 24, 2010"}, {"Title": "Freedom Now!", "Author": "Andrei", "ReviewID": "RPRWTGZ7N7VFJ", "Overall": "4.0", "Content": "enjoy the power of freedom with android in this super light-weight and fast phone by default. No limitations you faced on iOS4 with ever the growing android market. superb colour and contrast amoled screen from samsung. one thing to note battery's life is dependent on apps usage but can be bought and changed at will. with up to 32G of extra space on top of it's 16g.enjoy the freedom now...Edit: sorry this is the 8gb model internal memory so get the 16gb version CHEERS!", "Date": "July 6, 2010"}, {"Title": "Can I get my email...Please", "Author": "a_rop_man", "ReviewID": "RQG9O41B2MY1Y", "Overall": "2.0", "Content": "I just returned this phone and begged for my BB9700 back. In reality, I do not like the ridiculously small keyboard of the 9700 and hate the fact that when I respond to emails, the cumbersome keyboard induces typo's to the point I could appear as an illiterate ESL person. The one thing a smart phone must do, in my opinion, is get my business related emails to me within reason.While the Galaxy S is a phenomenal TOY, but it cannot be excused or used as business device. The variance in email delivery can range from after 1 minute (compared to the BB), to hopefully, while the earth still spins on a 23.44 degree axis.I normally get 150-230 emails per day consistently during a 24hr period; last night I didn't get any between 7pm - 10:15 this morning on this device. The whole purpose of smartphones is to be able to survive without a laptop/desktop while on the move and email management is the Achilles heel of the Samsung; this was my first Droid, and now i question the entire platform.If you can live without email delivery, it is a cool device.  Feature rich, superb internet (compared to the BB) browsing, extremely flexible in terms of configuration, and very quick when it wasn't doing a random reboot even when there wasn't any actual usage (because emails weren't delivered).  Also not being able to disable AT&T;'s BS Apps....not cool.This was a phone I really tried to like, and do for some reasons, but in the end - anything that made me actually want a cumbersome blackberry back has a long way to go.", "Date": "February 16, 2011"}], "ProductInfo": {"Price": "$979.99", "Features": "Network: HSUPA 900/1900/2100, EDGE/GPRS 850/900/1800/1900. Samsung Android 2.1 (Eclair). Android Samsung UI (Multiple Homescreens). Processor: 1GHz CPU Speed. Dimension: 64.2 X 122.4 X 9.9 mm (119g)\nMemory: MicroSD(Up to 32 GB). Android Browser: Flash Lite3.1. Display: 4.8-inch WVGA(480x800) 16 M SUPER AMOLED, mDNIe(Mobile Digital Natural Image engine). Multi-touch zoom. Light sensor, Accelerometer sensor, Proximity Sensor, Digital Compass.\nCamera: 5.0 Megapixel AF camera, Self Shot, Action Shot, Add me, Cartoon Shot, Smile Shot. Video: HD Video Player & Recorder (1280 x 720) @ 30fps codec: DivX, XviD, MPEG4, H.263, H.264, WMV, VC-1 format: 3gp(mp4), AVI(divx), MKV, FLV, H.263Sorenson\nMusic: Music Player with SoundAlive. 3.5mm Ear Jack. MP3/AAC/AAC+/eAAC+/OGG/WMA/AMR-NB/AMR-WB/WAV/MID/AC3/IMY/FLAC/XMF\nBattery (Standard) Li-pol, 1,500mAh, Talk time : 2G/769 minutes, 3G/391 minutes, Standby : 2G/750 hours, 3G/625 hours\nMemory: MicroSD(Up to 32 GB). Android Browser: Flash Lite3.1. Display: 4.0-inch WVGA(480x800) 16 M SUPER AMOLED, mDNIe(Mobile Digital Natural Image engine). Multi-touch zoom. Light sensor, Accelerometer sensor, Proximity Sensor, Digital Compass.\nMusic: Music Player with SoundAlive. 3.5mm Ear Jack. MP3/AAC/AAC+/eAAC+/OGG/WMA/AMR-NB/AMR-WB/WAV/MID/AC3/IMY/FLAC/XMF , Battery (Standard) Li-pol, 1,500mAh, Talk time : 2G/769 minutes, 3G/391 minutes, Standby : 2G/750 hours, 3G/625 hours\nThe phone comes with Latin America Specifications and can be upgraded to Android v2.3", "Name": "Samsung I9000 8 GB Galaxy S Unlocked GSM Smartphone with 5 MP Camera, Android OS, Touchscreen, Wi-Fi, GPS and MicroSD Slot--International Version with No U.S. Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41AcUkO4wdL._SY300_.jpg", "ProductID": "B003NCX6ZS"}}