{"Reviews": [{"Title": "6 months - 'Call' button wouldn't work", "Author": "Goutham", "ReviewID": "R2LEX0EIRYM0B5", "Overall": "3.0", "Content": "I have this phone for 6 months now.Pros:1. Good looking2. Compact.3. Key pad big enough4. The music player feature is real steal. I don't have to carry another music player with me now. Also, music plays through bluetooth (On my old phone, music wouldn't play on bluetooth)5. Phone speakers are pretty loud.Cons:1. Headset voice is low as complained by another user here. Sometimes I have to turn the loudspeaker ON, to hear what others are saying. Its embarrassing when in public.2. Its ~ 6 months now and my 'call' button wouldn't work and the option to assign '1-touch' dialing wouldn't work.3. Their call center services not good. Without even going through any preliminary steps like resetting phone or atleast listening to the problem completely, she just gave an address and asked me to ship my phone with 1-way charges to be paid by the user. I think, I need to do that now, since I cannot use my 'call' button4. The slide is not as smooth as it was initially.I wonder now, how this phone will be after the warranty period. For now, better than my last phone LG-Vu, where touch pad became faulty, a month after warranty. Atleast here I see an alternative to use it even if 'call' button wouldnt work", "Date": "September 24, 2010"}, {"Title": "Great product!", "Author": "TheMagnificentR", "ReviewID": "R2LEARJLC2VUR6", "Overall": "5.0", "Content": "I am very impressed with this phone. I really like Nokia brand phones in general and I've had nothing but Nokia for about 5 years now. This phone is the way to go for anyone looking for a multimedia experience. I never thought I would need a phone with a headphone jack until I finally got one. I listen to it all the time now! It's far more convenient than carrying around an MP3 player and a phone. The other feature I really enjoy the \"Conversation\" text message system. This way, I don't have to go all the way back to my Sent Messages in order to see what I last sent. Over all, it is a well constructed and sturdy phone with a nice set of features for a low price. I recommend this phone for anyone looking to avoid the touchscreen market, but not wanting to sacrifice too many features.", "Date": "September 24, 2010"}, {"Title": "What a Great Phone!", "Author": "The Cow Devil", "ReviewID": "R6VW4CS8IFVMS", "Overall": "5.0", "Content": "I've had this phone for a year now and it is by far the best phone I've owned. I've had a Palm, Motorola, LG, and a Samsung. None of them lasted as long as this one. I guess you can say that I'm very rough with my phones and this one withstood the abuse. I love the 3.5mm jack and also the 16GB capacity. I downloaded movies using the Nokia software and even though the screen is a bit small it worked very well for me. I also use the FM radio at work and it is awesome. The 3.2 megapixel camera does take some great pictures in the daylight. Of course it's not a fancy schmancy phone like an iphone or the N series but if you need an inexpensive old fashion cell phone with a few extras this one is for you.", "Date": "November 6, 2010"}, {"Title": "Good phone, but make sure price is best", "Author": "Roger Hood", "ReviewID": "R3C3GQX0EQU5K9", "Overall": "5.0", "Content": "Make sure the price you get here is the lowest on Amazon!!!!Depending on what you want out of a phone, this could be exactly what you need. It's unlocked, works practically anywhere in the world (helps if you travel a lot), and the music player is ok. It does NOT have 3G, so you don't have to pay for the data plan.Battery life is great. Responsiveness is good. Weight and size are very good.I do not regret buying this phone :-)", "Date": "October 25, 2010"}, {"Title": "this phone is real nice if u dont want to break the bank", "Author": "yungjeezy", "ReviewID": "R8EM7BTMMNNHO", "Overall": "4.0", "Content": "i recently purchased this for mom, i wanted something simple and easy to use for her and this phone met the expectations. she loves it, battery life is pretty good and sounds really good playing music \"its real loud and clear\"", "Date": "August 23, 2010"}, {"Title": "Good deal if you want something simple.", "Author": "Toby H.", "ReviewID": "RM5BZ3OMFU8AD", "Overall": "4.0", "Content": "I've had a smart phone for almost couple years.  When the reception and battery are not working well, I have decided to have something smaller and simpler instead, which is why I set my eyes on this unlocked GSM slider phone.  I love the design and red color, in particular the size, which I can fit in my pants pocket or purse without taking up too much room.  I've got this for several weeks now and I like it very much.  When I took it abroad and simply switched to a local SIM card, the reception was crystal clear.  Thanks to Amazon, the delivery was fast and the price was right.", "Date": "April 23, 2011"}, {"Title": "Nothing fundamentally wrong- the keyboard is just not as friendly as it could be", "Author": "Afisky", "ReviewID": "R2OAUADNFDJ5GJ", "Overall": "3.0", "Content": "I got this because I didnt want to enter another two year contract. There's actually nothing that wrong with it, its fast, good battery life, can handle loads of music (and FM) and its two (color) toned.I switched from a blackberry curve so my main issue was the keyboard was just hard to use. It took some re-learning and even then I wasnt too comfortable. I hope to get a phone with a qwerty keyboard next (and/or touch screen).O also, I'm on Tmobile so it worked effortlessly. I couldnt get online tho (probably because I didnt try that hard) so that was a draw back.And it is pretty hard to get the back panel off to insert sim card. The trick is to push down around where the word \"nokia\" ends I think.", "Date": "April 9, 2011"}, {"Title": "X3 nokia", "Author": "Raymundo Alvarado", "ReviewID": "RAYS35BIUQN4D", "Overall": "4.0", "Content": "The X3 has outstanding sound, the music sounds super loud, the camera is OK but it could it be better if had it flash.I own the one in blue which really calls the attention.. I gave it to my girl as Christmas, and it has been great,, at first she want it my E63 but she decided for this one... great phone for music and basic usage.", "Date": "January 18, 2011"}, {"Title": "Nokia X3 slider", "Author": "Dina", "ReviewID": "R32ICIBRWASGWL", "Overall": "4.0", "Content": "I purchase Nokia X3 slider recently for my brother. He lives abroad. it is only two months since he start using it, up to now he has no problem. It is unlocked, he can use it immediately. He is happy with the music player. said the sound is clear,once he charged, the  battery is ok for two days. Most of the pictures are good, and he had no problem to assemble. He had a problem with  LG 500 before, so far he is happy with his Nokia X3.The price is more expensive than what i expected around $120.  But I am happy that he likes it and everything works fine for him. I hope he will not have any problem in the future.Thank you Amazon.", "Date": "June 28, 2011"}, {"Title": "Battery Life", "Author": "Carsten Stuermer", "ReviewID": "R2NBF7UEWVQS0R", "Overall": "2.0", "Content": "Not sure this phone has an original Nokia battery because standby-time is only 80h.Based on spec it should be 380h.Will see how long it will last when I start calling.I was reading a lot of bad revies about this phone (after I bought...), so I may want to return it.", "Date": "May 6, 2011"}, {"Title": "Nokia X3 Red-Black", "Author": "Deepak", "ReviewID": "R2TDJQ01Q78BRN", "Overall": "4.0", "Content": "This phone is very good in performance. This looks very sexi too. It has clear voice, good speaker volume, attaractive display etc. What else one need in this price.", "Date": "May 4, 2011"}, {"Title": "Wow!!!", "Author": "Matthew Brown", "ReviewID": "R2ELEGIJBZJYC0", "Overall": "5.0", "Content": "Amazing phone; we used this phone for everything like a workhorse till our upgrade and still got some resale on the secondary market.", "Date": "January 22, 2014"}, {"Title": "great phone for prepaid users", "Author": "Rachael N. Krepps \"Geekwad Extraordinaire\"", "ReviewID": "R2MNXWL2EYQFHG", "Overall": "5.0", "Content": "love this phone, great camera great reception, just needs a QWERTY pad and it would be the besti use prepaid and this is perfect", "Date": "December 13, 2013"}, {"Title": "I was not lucky with this phone, damaged very soon and here in Venezuela I could not get it to be repaired.", "Author": "Teolindo Yanez F", "ReviewID": "R1U2FKARWU1FSE", "Overall": "3.0", "Content": "Nokia is usually a good manufacturer and my previous experience with Nokia was excellent, however I had very good luck with this model, damaged very fast, almost at one year of purchase.", "Date": "November 7, 2013"}, {"Title": "Economical Phone", "Author": "Pen Name", "ReviewID": "R2GTNNSBCPHVZ5", "Overall": "5.0", "Content": "1. Good looking2. Compact.3. Key pad big enough4. The music player feature is real steal. I don't have to carry another music player with me now. Also, music plays through bluetooth (On my old phone, music wouldn't play on bluetooth)5. Phone speakers are pretty loud.", "Date": "January 29, 2013"}, {"Title": "camera does'nt have flash", "Author": "pj sr.", "ReviewID": "R313FXHRDBT0K8", "Overall": "4.0", "Content": "i have had nokia 6500 previous to this product . i like it better but one thing i dont like about the product is the camera doesn't have flash light to be set in dark light.beside that i like it better.", "Date": "December 15, 2012"}, {"Title": "Speaker is bad..Dropping calls", "Author": "LG", "ReviewID": "R29UMEWZ8QHK2G", "Overall": "3.0", "Content": "As a huge Nokia fan, I got this phone two days back as my black berry pearl (which is good in terms of clarity) got dead.It disappointed me in the sound quality. The main reason for getting a Nokia is the audio quality that Nokia provides. I did not want any of the iphones or smart phones..Also, I had call drop for every single call that I spoke in one day. I do not know if it is a problem with AT & T or my new phone. I did not have so much of problem previously. The speaker is bad.. People kept asking me if I was driving or outside in a noisy place, whereas I was at home without any noise in my back ground.Otherwise, it is a great phone. It looks cute and as everyone knows Nokia phones are very much user friendly. Music system is very good.I am still thinking to keep or return the phone. If the disturbance continues, I am going to return it. The one and only one main reason to go for this is, to get a good sound clarity in calls.Also, as the other reviewers said, to open the battery slot is kinda tricky..", "Date": "August 29, 2011"}, {"Title": "BIG SMILE", "Author": "O'Neil", "ReviewID": "R1J2WTHVID8360", "Overall": "4.0", "Content": "My first cell phone was a Motorola L6 (cost over $160.00) and it served me relatively well over a 4 year period.The first issue presented itself when the cell took over a day to charge before I could use it. It turns out that the battery did not remain in proper orientation for an effective connection.  I now had to fix a \"new\" phone, replace the back panel to be precise.  Over the next 4 years I had to fix this same problem 7 times.Also, reception was very poor, there was insufficient storage, and it had a low and unclear head voice and loud speaker. The latter was especially annoying.The final issue was when my cell fell 3 storeys onto a paved sidewalk...no fault of Motorola but I needed a new phone.  lm@oUpon search for new cell I decided I would spend $100.00, have clear reception, and have enough storage for music, videos and pictures.The Nokia X3 Slider Unlocked GSM Phone is one NICE LOOKING CELL PHONE.Its reception here in The Bahamas is impeccable. I should know because I used in during hurricane Irene's visit. Oh! the radio was a bonus.It charge within minutes, and the battery lasts. The head voice and loud speaker are sufficiently loud and clear, even at low to moderate volume.The pictures and videos are clear and the formatting properties are more than I expected. For me the storage is adequate.I've had my new cell for over a month now and I still smile big. :DAs long as Nokia remains affordable, they will have a lifelong customer in me. I paid $109.00 and its worth every penny.Sincerly,O'Neil", "Date": "August 28, 2011"}, {"Title": "Amazon Review", "Author": "Amazon Customer", "ReviewID": "R2SS6KWRXXM60Z", "Overall": "3.0", "Content": "Now this is more a review the way amazon is handling the phone pages. I never see what's in the box section anymore.It is so important to see what is there in the box. If I need to buy an additional SD Card, or if I need a USB cable. there are no technical details either on the page. For technical details dimensions and talk time are given.This is lousy work by Amazon guys. If the only way I can find out is by getting the phone, I would rather go to a store and buy the phone.", "Date": "August 9, 2011"}, {"Title": "very good cell", "Author": "Jhonny Rosales", "ReviewID": "R3H562TWFC1AH3", "Overall": "5.0", "Content": "buy it for my mom to (custom), she loves the phone is easy to use radio applications, good camera, picture quality anyway, so you need for photos and a good phone in general, that I a little more phones this bastente good for the price ... headphones sound quite right, I would recommend fully FROM VENEZUELA, PURCHASED FROM AMAZON", "Date": "June 1, 2011"}, {"Title": "Battery dead, also to send pictures from the phone it does not work.", "Author": "Jacqueline D. Coger", "ReviewID": "R3NLHBKE4RA0CC", "Overall": "2.0", "Content": "I have had this x-3 phone for about 6 months or so and the battery is completely dead. Every now and then, the phone may come back up. As far as charging this phone, it does not work either. This is so ridiculous. A waste of money. I would like to know how I can get my money back or get a new phone. Can anybody give me some information on this please? (penbaby4@yahoo.com)", "Date": "July 7, 2011"}, {"Title": "If you can't open the battery cover, what good is a phone?", "Author": "Janos Gereben", "ReviewID": "RZLYETTAL4ZIH", "Overall": "1.0", "Content": "Not a minor irritation, but a ridiculous real problem: the battery cover does not slide off, cannot be pulled up, it will resist opening. I went around to friends, acquaintances, even a Radio Shack - and nobody could open it. Finally found a way to pry it open, but then it's a problem to close it. The battery is difficult to pull out, and the SIM card holder won't open either. My hope is that I had a defective unit, but I have seen similar reports already. What a shame - from Nokia!", "Date": "October 7, 2010"}, {"Title": "i hate this phone", "Author": "Never again", "ReviewID": "RBZZLHBARR3R8", "Overall": "1.0", "Content": "The phone is acient. No touch creeen, it doent even have a mini keyboeard. Its bateery life wasnt that great. It had a radio that barely recieved radio stations. the MP3 player was not the greatet. I wanted to return it as soon as i got it but since i got the phone through ome other company and not amazon directly. they would not give me a refund. A phone that i sthis behinf in technology should be 20 or 4o bucks not over a hundred 50 dollars. i dont even know why they advertise this phone as unlocked it cant even get to the internet correctly. Godd luck if you but thi phone it sucks.", "Date": "August 25, 2011"}, {"Title": "Excelente", "Author": "JohnX", "ReviewID": "R14F3PKZEUHRSE", "Overall": "5.0", "Content": "excelente producto, beneficiosa relacion costo beneficio.  mi unico consejo es que no active la clave de seguridad para el teclado, pues por lapsos de tiempo el equipo no reconoce dicha clave y por ende puede durar varios minutos son acceder a las funciones normales del equipo.", "Date": "July 6, 2010"}, {"Title": "I forgot that it doesn't have WIFI capability!", "Author": "Julio C. Montiel \"Julio Montiel Silva\"", "ReviewID": "R17LG04DXVDMAZ", "Overall": "3.0", "Content": "I expected it had WIFI capability but I got disappointed when only discovered that it has only bluetooth and network package networking features. I sold it like two months ago, because I could't paired easily using a Bluetooth Networking. It was very difficult.", "Date": "November 13, 2010"}, {"Title": "Nokia X3", "Author": "Ramiro", "ReviewID": "RVN2ISC8ZV3ER", "Overall": "3.0", "Content": "Every day I like my Nokia X3. I had no problem with the band, I put my chip and ready, indeed, the menu is automatically configured in my language. I have everything I need, of course I'm not a big fan of cell phones, I hate being a slave to them.", "Date": "September 25, 2010"}, {"Title": "3.2 or 3.5 MEGA Pixel Camera????????????", "Author": "kalesh", "ReviewID": "R1MZ608M49LIUZ", "Overall": "3.0", "Content": "I have ordered this from AMAZON.The images show that the camera is 3.2 Mega pixels. Newegg.com shows that RED version of this is 3.5 and blue is 3.2. No big deal but I am confused if I ordered the blue one which is more costly for a lesser clear camera.", "Date": "November 30, 2010"}, {"Title": "Not to my expectations", "Author": "Saravanan Kalai \"3D world\"", "ReviewID": "R1FYFFROFGOP4I", "Overall": "2.0", "Content": "I bought this phone from Amazon with some expectations. But amazon disappointed me again. This is my second buy of a mobile from amazon and its proven to be wrong. I have decided not to buy mobiles especially from amazon. The ear piece did not work properly. Initialy i thought the calls are getting dropped and its a problem with the service provider, but then i realized that its not the network. Its the phone!!. Finaly i got to a point where i had to speak through the headset, or the speaker turned on. I have now returned this product to amazon.", "Date": "June 5, 2010"}, {"Title": "liars", "Author": "mg", "ReviewID": "R3P8N75VARAE0W", "Overall": "1.0", "Content": "this phone sucks big time , people dont even waist your time to look at it because the phone does not even worth 15 dollars the quality of this phone is really really bad .", "Date": "February 1, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Pristine and high-tech design that can be recognized as fitting in with friends and trends.\nSlim music slider that fits easily in the pocket\nThe symmetrical speaker design makes it clear to all that the stereo speakers deliver big sound.\nShare and Social Networking.\nDual stereo speakers in design is an obvious", "Name": "Nokia X3 Slider Unlocked GSM Phone with 3.5 MP Camera and 2 GB SD Slot--US Version with US Warranty (Red/ Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41CPcpbEwfL._SY300_.jpg", "ProductID": "B0036DDT6A"}}