{"Reviews": [{"Title": "Excellent phone!", "Author": "D. Ranucci", "ReviewID": "R3Q7A38XYNA7FY", "Overall": "5.0", "Content": "This phone is excellent. The camera takes top-notch stills (it's become the only camera I use regularly), the phone is responsive, and the keyboard is well laid out.At first, I didn't like the track pad button on the phone because I was used to using arrow keys, but the more I use it the more I like it. Coming from the Droid 3, the keyboard took some getting used to but now that I'm comfortable with it, typing is a pleasure.I wish the \"Genius\" button would have just been kept as a search button (which you can long-press on other Android phones to do voice commands). I also would have liked to see the power button and the headphone jack port switched since I'm right-handed and keep the phone in my left pocket, but other than that it's hard to find fault with this phone.", "Date": "February 20, 2012"}, {"Title": "Great Phone", "Author": "clerbe", "ReviewID": "R296Z2K86WJBVV", "Overall": "5.0", "Content": "The phone was shipped earlier than expected.  It looks new and works great. I just put in my sim card and it was good to go.", "Date": "December 8, 2011"}, {"Title": "Great Phone", "Author": "Amazon Customer", "ReviewID": "R22BMEM3RWMIVM", "Overall": "4.0", "Content": "I only had this phone for a week but so far I'm pleased.Pros;-It shipped fast. I ordered it Tuesday and got it on Friday w/o having to pay anything for shipping.- The screen is large which I like and has a physical keyboard which is a must for me.- I like that the apps don't give me as much of a hard time as on my old phone, which it occasionally crashed.- Call quality exceeds excellent.in fact I have to lower my voice extremely because its crystal clear. Putting a headphone/bluetooth in for the calls helps.- Genius button allows you to speak to the phone- GPS is excellent. I went out of town and this gps helped us tremendously in a foreign city.- Weather app is nice- Front and back camera is excellent.- Youtube is great.- Netflix is great.- Has Adobe Reader which is wonderful.- Can view attachments on email.Cons:- Battey life sucks. Dies quickly with barley no use.-The keyboard isn't as good as my previous phone, the Motorola Cliq MB200, because the buttons are flat and not as smooth to type on.-I wish I can find a music download app that works. I like that 4g data is available and it's fairly fast.-Don't like when I type a message there's no spell check or automatic fixes, ex.) Im will be changed to I'm- Don't like where the on/off button is located. I prefer pressing the end call button.Overall happy with the phone and would recommend it.", "Date": "December 30, 2011"}, {"Title": "Lots of problems!", "Author": "NIMTOJO", "ReviewID": "R1F5FNPNBJC4J9", "Overall": "2.0", "Content": "Freezes up!Calls another number while talking.Poor sound quality.Runs out of charge.Speaker quality poor.Not easy to make 3 way calls or answer an incoming call when you are on phone with another call.", "Date": "August 14, 2013"}, {"Title": "I bought mine used.", "Author": "stevah \"Stevah\"", "ReviewID": "RX480OUB2U0RD", "Overall": "5.0", "Content": "It is a good phone, I like how when I am done talking, the red \"end call\" button pops up, how does it know? On my Samsung I had to jump through hoops of fire to delete a voice mail or message, here the keypad is right there instead of hidden 2 menu layers deep; I am continually impressed. I spent a couple of hours with the book (I found online) to learning this phone, it was pretty easy. It is a thick phone with the slide out keyboard,not a light weight, but I like it fine. I am learning how to use the keyboard, every time I get a little better. I bought a shell (actually 2) a clear and a black one I like them both, make sure what ever after market stuff you get is compatible with 4GMytouchSLIDE, there are 3Gs and 4GMytouch-(no slide)s that are not the same, and not comparable in most ways. I gave it 5 stars instead of 4 even though I think the phone log, which I have become dependent on to delete my calls, could be a little better, but I have nothing current to compare it to. I use this with 1000 minutes per year from T-Mobile for $100, no data plan. I spend 2-3 hours on the internet every night and at work when I want, that is enough. You can download your ringtones and images to your computer and transfer the files to the phone. It is a little tricky but doable; or do it with a hot spot. Now I am not missing calls or messages anymore! Worth it.", "Date": "April 18, 2013"}, {"Title": "My 2nd MyTouch slide 4G", "Author": "Dancin' Dave", "ReviewID": "RCO4QIHPRW7PO", "Overall": "5.0", "Content": "I really like this phone so after I wore my first one out I bought this new one.It's very fast and has a good hotspot for my devices. I like the keyboard but found out that is what goes out so I will be keeping that use to a minimum. I use the voice to text feature a lot and it works well on this phone.", "Date": "May 30, 2014"}, {"Title": "EVER SO HAPPY!!!", "Author": "harmonee2012", "ReviewID": "R1N82AR0LCZAXP", "Overall": "5.0", "Content": "I placed my order on June 5th. The estimated delivery date was Tuesday June 12, 2012 - Wednesday June 27, 2012. To my surprise, I receive it on June 8th! So far, everything appears to be fine. Although, I have to purchase a new SIM card due to the age of my previous phone.", "Date": "June 9, 2012"}, {"Title": "Gud used phone", "Author": "Doliakeh Quoimie", "ReviewID": "R1O2TQDS1L7A87", "Overall": "4.0", "Content": "This is one phone i couldnt believe. It is so amazing and in a relative new condition. It is perfect and works well. Amazon is great and my wife loves her phone", "Date": "January 12, 2013"}, {"Title": "Love the phone", "Author": "Linda Ringley", "ReviewID": "R2P9PZLAFVS9A1", "Overall": "5.0", "Content": "Love the phone - arrived when I was told  it would and works great! Just put in my sim card and I was off and running.", "Date": "July 24, 2013"}, {"Title": "HTC 4G SLIDE", "Author": "benjamin", "ReviewID": "R2UQJWHI88CA8G", "Overall": "5.0", "Content": "BEST PHONE I HAVE EVER HAD.EASY TO NAVIGATE THROUGH THE PHONE.THE 8MP CAMERA IS AMAZING!THIS PHONE IS AVAILABLE WITH AND WITHOUT A PHYSICAL KEYBOARD.CHOOSE WHICH EVER YOU PREFER!", "Date": "March 13, 2013"}, {"Title": "Good", "Author": "Lovely", "ReviewID": "R3Q0D1S3X00BXF", "Overall": "5.0", "Content": "The item was good well packed, received in time as detailed in the listing will buy again if reasonable priced", "Date": "December 30, 2012"}, {"Title": "LOVE IT", "Author": "Dexter M.", "ReviewID": "RI08OMWM6APSL", "Overall": "5.0", "Content": "I HAD THIS PHONE FOR A WHILE, AND BEFORE SOMEONE STOLE IT, IT WAS THE BEST... I EVEN TRIED TO PURCHASE ANOTHER ONE, AND WANTED TO WAIT FOR A NEWER UPDATE AFTER THE 4G SLIDE... I AM IMPRESSED WITH THE MYTOUCH LINE, AND WHEN THEY UPDATE, I WILL GETT ANOTHER...", "Date": "March 6, 2013"}, {"Title": "my touch 4g", "Author": "WAYNE A MCFARLAND JR", "ReviewID": "RWSPCFHT43UTU", "Overall": "5.0", "Content": "Received the phone in excellent condition , all important info included. Appreciate the service and thanks for sending out the item priority mail , as it wasnt requested and received it in quick time. That was a good thing because my old phone was dying fast...appreciate the customer service and would definitely use and recommend them again...", "Date": "September 6, 2013"}, {"Title": "greAT ALIDE THE BEST", "Author": "Vonszeil", "ReviewID": "R1MNK9EKJTAT8Q", "Overall": "5.0", "Content": "I LOVE MY BEZEL MY TOUCH 4G SLIDE ITS JUST THE BEST FORGET ABOUT THE LITTLE IPHONE THANKS SO MUCH", "Date": "May 16, 2013"}, {"Title": "AMAZING", "Author": "noel", "ReviewID": "R21CV9XPDI621Y", "Overall": "5.0", "Content": "easily beats all the phones i've had in the past, even, dare i say, the iPhone!  really content with it :)", "Date": "September 12, 2012"}, {"Title": "do not use this company period", "Author": "Pen Name", "ReviewID": "R1IWX9SHTAJP9J", "Overall": "1.0", "Content": "I originally wrote a review on this company which was censored by amazon.  No foul language or anything of the sort. Just facts of poor buisness practices that this company practices in.  Like stating they sell one thing and yet receiving somthing altogether different.  These facts however were considered to scathing, regardless of it's truth.  This is unaccepptable as I have used this customer review system to decide on purchases in the past. Well Amazon censor this one and we have concluded any future transactions going forward. Reviews are in part to help your customers receive the best service and product, also to verify the legitamacy of the companies that represent you.  So show me what holds importance to you as a company.", "Date": "April 22, 2013"}, {"Title": "GOOD VALUE", "Author": "linda barrera", "ReviewID": "R2LPOZAPZUS697", "Overall": "4.0", "Content": "WE RECEIVED IT IN A TIMELY MANNER.  SON WAS VERY EXCITED TO RECEIVE IT. IT WORKED GREAT WITHOUT INTERNET. I JUST GOT TMOBILE UNLIMITED TALK AND TEXT SO HE USES THE WI FI. QUICK TO RESPONED TO ANY QUESTIONS THAT I HAD ABOUT THE PHONE.", "Date": "December 19, 2012"}, {"Title": "HTC myTouch Slide review", "Author": "Jei", "ReviewID": "R36HRDXLKAHZAM", "Overall": "5.0", "Content": "Sorry to leave feed back so late.  Phone works fine.  Did have a small problem with screen not turning back on when the screen is off and you slide phone open to start.  If you use the power button then there is no longer this problem.  But the phone its self is in great condition.", "Date": "March 1, 2012"}], "ProductInfo": {"Price": "$199.99", "Features": "1.2 GHz Dual Core Snapdragon\n8 megapixel camera + front-facing camera\n4GB Intenal Memory + *Gb MicroSD Card\n3.7\" Super LCD capacitive touchscreen", "Name": "T-Mobile HTC myTouch Slide 4G Unlocked Android Phone, Black, 1.2Ghz, 8MP, 12GB", "ImgURL": "http://ecx.images-amazon.com/images/I/41gt4iP%2BYJL._SY300_.jpg", "ProductID": "B00301F4ZW"}}