{"Reviews": [{"Title": "Great phone after a few tweaks...", "Author": "A. Eberts", "ReviewID": "R2T5XK0K0TQI8G", "Overall": "4.0", "Content": "I really wasn't impressed with the windows7 phone so I looked around for something with 6.5. come to find out... both hd2 and w7 have the same hardware specs except for w7 has a physical camera button. Even though the hd2 is widely known as one of the best and most customizable windows phones... it doesn't come without a few problems. First of all, you have to make sure your ROM is up to date (which t-mobile has on their site). When it first came out in the U.S. it was buggy. Even after having an updated ROM... I had to download 3rd party software to fix the call quality, the 3g came on all by itself after switching it off so I had to find software to stop that, I downloaded a more accurate battery life indicator, and I also found software to switch the on screen unlock slider to the bottom of the screen instead of the top. I didn't know it had all these little annoyances until after I bought it. But like I said... it's a highly customizable phone. All the software fixes from the net were free too. So, even though it was a pain at first...with a few little tweaks, it's actually a great phone. I did have to buy an HTC HD2 brand extended battery from ebay (with the metal kick stand in the back) because the original battery didn't last long (maybe 2 days with moderate use). I am not a really heavy user on my phone so I can get about 4 or 5 days on one charge with moderate to mid range use on the extended battery. Do not get a cheap no name extended battery, they do not tell you the accurate battery life. At some point, you have to take it out and put it back in to reboot your phone so you can get the other 50% battery life to work. The 3g is shut off unless I need to use it, and I make sure the task manager is clear of all programs running in the back ground. After all that, was it worth my time and money? Yes. I do really like this phone. One of the best I've owned. It was actually fun customizing it since I'm such a tech geek. I would say that if you don't mind having to customize it, it'll be a great phone for you too.", "Date": "June 1, 2011"}, {"Title": "Awesome Hardware", "Author": "Dan L.", "ReviewID": "R93KQKEHF61AV", "Overall": "5.0", "Content": "Great device all around. Thin and solid. Windows Mobile 6.5 runs and looks great on the HD2. I, however, am a huge Google Android fan so I installed Android 2.3.4 on it. It is easy to do. The HD2 is an awesome device for the one who enjoys \"tinkering\" with their phones. The HD2 will run WinMo, Android, WP7, Meego, Windows 95, Ubuntu, and who knows what else. Great phone.I Love the huge screen, and pretty much everything else about it. I'm happy and lucky to have it.", "Date": "August 7, 2011"}, {"Title": "htc hd2", "Author": "gargemel_622", "ReviewID": "R3I94V305JRQ86", "Overall": "4.0", "Content": "The hd2 is great phone, the hardware is not much different than the newest HTC's. The only drawback is the limitations of win mob 6.5. The o/s is rigid, not very customizable, you really can't move icons around freely and it's not nearly as fluid or fun as android. This phone initially struck me as a business device, the Marketplace is also business oriented. If one is so inclined there are.many flawless android programs available at xdadevelopers.com. battery life can also be greatly improved by flashing new radio rom. The phone is capable of being cutting edge, just not out of the box. Great phone, highly recommended.", "Date": "November 21, 2010"}, {"Title": "Buyer Beware!!!!!", "Author": "Jack the Pumpkin King", "ReviewID": "R390RTHBWBIKNJ", "Overall": "1.0", "Content": "Bought this phone almost 2 weeks ago and was excited to get it. I received the phone the next day (Amazon Prime account :))however when I opened the amazon box my excitement immediately turned to anger as the packaging in the box was not the original HTC HD2 box, but the packaging for a tmobile HTC MyTouch 4G. I assumed they sent the wrong phone at first but was shocked to find the phone inside the MyTouch 4G box was a HD2.I was under the impression based on Amazon's description, that the HD2 was brand new (it did NOT say otherwise)and what I received was obviously a refurb or insurance replacement phone. Also it only came with a charger and usb cable, nothing else, not even the standard 16gb memory card that comes with ALL brand new HD2 phones.The problems did not stop there. When i tried to start up the phone, it vibrated 7 times and then froze, did this every time I started the phone. After the 10th time, the screen would not even turn on and it would just continuously vibrate. I googled these symptoms online and found that basically the issue seemed to be a bad/damaged logic board.I was so frustrated that I spent $289 for a phone that was NOT new and did NOT even work. I could not even get a replacement since the day after I bought it, the HD2 listing changed to \"Usually Ships in 1 to 2 months\"  I felt lied to and betrayed.However, the only good thing to come out of this was Amazon's return policy. Within 1 week of returning the phone, I received a full refund.", "Date": "September 5, 2011"}, {"Title": "Expectations exceeded", "Author": "Antonio Martínez \"Tony\"", "ReviewID": "R2UPQFPH7AJ4S5", "Overall": "5.0", "Content": "OK! I bought this phone considering two main reasons:1.- I wanted a Widows mobile phone2.- I wanted a gigantic screen to surf the web, watch videos and pictures, etc.This phone runs Windows Mobile 6.5 with HTC Sense which is an excellent HTC Shell, brilliant, executive, serious, innovative, useful, customizable and extremely user friendly. First request has been fulfilled.This is the greatest screen you'll find... There's just 1 device that comes closer (Toshiba TG01) and it is 0.2 inches smaller (Toshiba 4.1\" / HD2 4.3\") So my second reason is clearly covered. Indeed it is bigger than what I thought and I am obviously happy about it.Extras: A LOT!!! The design is perfect, but device's pictures describes it better than my words, it is so elegant and I like it very much.Camera resolution is fine (not the best) but it does its job. Still pictures are very nice and video recording quality is also very good. I am very impressed about taking still pictures on dark environments beacuse it gets a highly brilliant and beautiful pictures. Its two led flash allows you to photograph almost anything on black dark environments (as long as it is closer enought to light it)The capacitive screen prevents unwanted touches from any other thing that is not your finger (or skin) and it has a proximity sensor so you won't click buttons with your face when talking on the phone. This proximity sensor turns off the screen when you place the phone on your ear and turns it back on when removed.Battery life is amazing considering 1GHz processor and extra giant screen, I get more than 24hrs of power listening to music, placing and receiving calls, sending and receiving SMS, MMS, surfing the web through WiFi, GPRS, EDGE or 3G (any available) and \"playing\" with GPS, google maps, Garmin, etc.It comes with an extremely addictive game (Teeter) that uses the built-in accelerometer to move a ball while you move the phone, the objective is to insert the ball in a green hole preventing the gray ones.It has a built-in connection with Facebook, Twitter, Youtube and Windows Live, so your contacts are always up-to-date with status, tweets, profile pictures and even birthdays! (it stores birthdays on the calendar and alerts you on the go)Microsoft has a very useful software \"MyPhone\" (not exclusive for this device but 4 all Windows Mobile phones) which allows you to sync contacts, calendar, pictures, text messages, music, documents, storage card contents and even location. This lets you change your device and by simply synchronizing with a couple of clicks, your new device will be exactly as the old one, and you don't even need a computer 'cause it stores the content on your Windows Live account. (I've heard about a lot of BB users who loses their contacts when updating the BB messenger) So this deserves a big \"Hurrah\" for Microsoft. I found it soooo useful and important.The stock manager allows you to keep track of your stocks, always up-to-date, it can even show graphics for 1 day behavior, 5 days, 1 month, 3 months, 6 months, 1 and 2 years.Storage card is placed below the back cover and it is not below the battery, so you can change it while phone is still on. It supports up to 32 GB microSD HC.Applications included are very useful, I saw a review that talks about the simple calculator and this is wrong... it is not so simple, it has a simple calculator when holding the phone in a vertical position and you can get a scientific calculator if you turn your phone and hold it horizontal.The MP3 trimmer allows you to cut an MP3 file in a determinated position and save and extract of it to use it as a ringtone.Office Mobile includes OneNote where you can write using the keyboard or handwritting. (I also read a review that says that this phone won't let you handwrite to create a message), this is also wrong... you can turn on this function on the keyboard options while you are writting your message.WorldCard Mobile (found on tools) is an OCR recognition engine that lets you take a picture of a bussiness card and it recongnizes names, email, website, address, phones, etc and save it to a new contact so you don't have to write it manually.Remote Desktop Mobile lets you connect to any PC, the digital compass can be combined with google maps to get directions or orientate on unknown places and this HD2 can be configured as a WiFi router to use your mobile internet connection everywhere (GPRS, EDGE or 3G) so your laptop will be always online no matter where you are, it can connect to a network or bluetooth printer to print your documents on the go including Acrobat PDF documents. The Opera browser and even IE are flash compatible and you can navigate almost as if you are in front of your desktop PC.The performance for this device is impressive with its 1GHz processor and as if this is not enought out there are millions of software apps that can be installed and customize your phone covering all your needs.So, I can see no reasons why not to buy this monster. I hope that my review helps you decide what you want.", "Date": "November 7, 2011"}, {"Title": "Great phone for the price.", "Author": "Patom L.", "ReviewID": "R2UH6VCCMXM9SP", "Overall": "5.0", "Content": "I doesn't buy new phone very often so when I am buying one I do a lot of researches about price, durability, pro's & con's, etc.I stumble upon HTC HD2 and feel great with it, it has a good price for a smart phone and it look great too.  The only downside (some may not agree) is that its run on Win 6.5, which is decent but HD2 got more potentials than that.  After a few tweaks its become a great phone for me, I got friends who pays $200-$300 more than me and got the phone that can do pretty much the same thing as my HD2, if not less.", "Date": "September 9, 2011"}, {"Title": "htc HD2 (unlocked T-Mobile version)", "Author": "L. Simmons \"lawrenceofarizona\"", "ReviewID": "R2U8VK2DVMDZY0", "Overall": "4.0", "Content": "I did a lot of research online before making my purchase, so I would consider my expectations fairly realistic. My biggest reason for choosing this phone was that I wanted the largest screen smartphone that would be compatible, out of the box,  with my legacy T-Mobile data plan. My current plan only gives me access to the slower (EDGE) network, but that is all I really need when I travel. I have WI-FI access at home.I was hesitant to choose this phone because I'd read so many stories of people complaining of problems with it. Typical complaints had to do with constant freezes, earpiece (static) issues, battery life, touchy screen, etc. I have had mine for a few days so far and the phone seems fine, although I am finding that it needs to be charged daily, whereas my Nokia 5800 would require a charge every other day. I would have ordered the international version, but I picked the T-Mo (US) version mostly due to it's increased RAM/ROM size over the other.The Amazon ad mentions this phone coming with the movies Transformers 1&2 pre-loaded on it. Attempting to play them on my phone, I only got an error message referencing the memory card, which in this case was only 685MB in capacity. I believe these phones, when shipped directly from T-Mobile, originally came with a 16GB card, which is where those movies, and and a few other programs that I noticed shortcuts to (but also didn't work) would have been installed. I don't think this model can be purchased through T-Mobile any more, as it is an older model.Finally, another consideration for this particular phone was due to it's ability to be customized later on. I have read that the WinMobile operating system (which this phone runs on) is not one of the most popular, and also has been abandoned by its creator Microsoft. On the other hand, there appears to be many alternative operating systems that can be installed on this phone. Since I tend to keep my cellphones for a long time, this is a big plus.", "Date": "July 11, 2011"}, {"Title": "One of the best Cell phone", "Author": "RY", "ReviewID": "R2FXZSR7081J4M", "Overall": "5.0", "Content": "I have looked at several of the major cell phone mfg of their products. HTC is the only one that capable to go head on with the IPHONE. In many respects HTC HD2 is better in their features as well as the quality. I loved their large size screen and the senses. It is also thinner than IPHONE. 4.3\" screen of the HD2 is very easy to carry in your pant pocket.", "Date": "October 5, 2010"}, {"Title": "htc hd2 unlocked phone", "Author": "tat", "ReviewID": "R2SLEKYSTR9RSH", "Overall": "3.0", "Content": "Buying experience from amazon was good. HTC HD2 mobile battery backup was very less for the product I received. Its showing some 60 hours incoming and 90 hours out going usage. I believe this is not a brand new one.", "Date": "October 3, 2011"}, {"Title": "Stood the test of time, works flawlessly! Readon...", "Author": "Daisy S \"Daisy S\"", "ReviewID": "RAM4NX7TAERU", "Overall": "5.0", "Content": "I have owned this phone since May, 2010 and it has never given me any trouble. I also own an Android 2.3 phone and the clock runs slow in Android 2.3.(Found out with Android Forums, this is a common problem in Android 2.3.3) However, this phone keeps perfect time, apps work great and I even found some cool low cost apps from MS Marketplace. This phone for me has been very easy and fun to use. I love the MS Office with OneNote and also the bright vivid large 4.3\" screen! Also, when I first purchased the phone, I was using T-Mobile Prepaid with no data plan. Later, I switched to AT&T; and set up the settings so I could use data and MMS and the phone works great. Note with an AT&T; Sim and using AT&T; Data, it will only be EDGE, not 3g or 4g. However, I only use the small data package of $5 per month and have noticed that it runs fast enough to suit me. Most of the time, I use the WiFi and so I am very happy with this phone!One of the things I love most about this phone is that it came stocked with a File Manager, and a Task Manager (Task Killer) and 2 Music players (no need to have to download these apps)! I had to tried an android phone, but what is the one I use--the HD2 Unlocked Leo Phone!**And I must say, I have no intention of putting Android into this phone, as I have found for me, Windows 6.5 works wonderfully and I am delighted with the phone just as it is! One more thing, I like the fact that I am able to REMOVE the memory card (has a 16g now) and add a 32 g if I choose to do so. Glad I did not wait to purchase the HD7 phone after reading that you are not supposed to remove the memory card that comes with the phone. After much internet research, I was suprised to see that this was true on Windows 7 phones.", "Date": "September 24, 2011"}, {"Title": "Htc HD2 unlocked phone US warranty", "Author": "E. Betancourt \"the wolf pack\"", "ReviewID": "R16A6GXGRO1F1I", "Overall": "5.0", "Content": "Arrived on time in new condition just popped my T-Mobile sim card in and immediately started working. So Far i love it. Nice big screen and fast phone almost no lag. I use google maps alot and its very fast GPS works instantly almost. Web pages load quick also. It not android phone but its ok, it has all the essentials, facebook, google maps, tweeter, 1GHZ processor 4.3 inch screen very Smooth and has great sensibility.", "Date": "September 20, 2011"}, {"Title": "great products", "Author": "Jiangyan Zhu", "ReviewID": "R1AI44AXVPEOYV", "Overall": "5.0", "Content": "It is exact as described. It is unlocked, though it has the T-mobile logo. After it arrives, it is ready to use AT&T; sim card. I bought AT&T; prepaid plan, without data, works great. I have wireless at school and at home, so I don't need data plan. And I use my hubby's phone or gmail by computer to make long chats. It save me a lot of money just go with prepaid plan(anytime and daypass combined).  We also hack it, it is originally windows system. We installed Android system, works perfect.", "Date": "September 2, 2011"}, {"Title": "excelente", "Author": "toni68", "ReviewID": "RZYEZKIJ1LFA0", "Overall": "5.0", "Content": "Q puedo decir un excelente producto, me llego rapido y sin ningun problema, a pesar de q era usado. tiene un procesador bastante rapido. Lo recomiendo ampliamente.", "Date": "March 11, 2012"}, {"Title": "Great Phone. HORRIBLE operating system, easy fix", "Author": "ilmk920", "ReviewID": "R3H5HFZP4ZPQ3B", "Overall": "5.0", "Content": "This phone is amazing! I bought it because I have t-mobile and they dont really have a phone this nice on android. This phone is running windows mobile and I absolutely hate it! but I bought a software on ebay that allows you to just plug the phone into the laptop start up the software and it converts the phone to android and gets rid of windows altogether so you dont have both systems taking space on the drive. That was probably the best thing I couldve done with the phone. ITS AMAZING! It is a couple years old but it still has one of the largest screens for t-mobile and it has a nice sleek look to it that just doesnt get old. And well since its upgraded to android theres no need to get a new phone. haha... GREAT BUY!", "Date": "December 24, 2011"}, {"Title": "IM FEEL CHEATED", "Author": "Andres Vidal", "ReviewID": "R3EFWRMDZVGWT1", "Overall": "1.0", "Content": "I no happy, the Micro SD not include, the in hear headphones not included, the box is generical box no original HTC box. feel very bad amazon should send the memory card and headphones as I feel cheated", "Date": "October 3, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003VPV3AW"}}