{"Reviews": [{"Title": "The Just5 Cell Phone. . .", "Author": "thuddriver", "ReviewID": "RPIXS5K851RPT", "Overall": "5.0", "Content": "The item arrived today.  I removed the SIM Card from my Nokia 2610 and installed it into the Just5, installed the battery &found the phone a delightful change. . . Easy to see, easy to hear, and best of all, easy to use because it operates almostexactly the same (95%) as my Nokia. The big difference is, I can actually see who's calling in daylight, hear what's said overbackground noise, and operate the buttons with my fingers instead of my finger nails!  No camera, no internet, no games, nosliding or flipping gizmos, no teeny ASCII keyboard. . It's just a nice sized quality phone that's intuitive & works very well.", "Date": "September 28, 2011"}, {"Title": "Perfect for my son", "Author": "mamamia", "ReviewID": "R8XOXFCQ4DAMG", "Overall": "5.0", "Content": "I got this for my son who is legally blind.  It's perfect for him!  Not only can he see the large buttons, he can see the display enough to text. It helps him be more independent and he's been searching for that.  I feel more at ease when he is away from the house.", "Date": "February 26, 2011"}, {"Title": "Unfortunately it needs work!", "Author": "ugadi2", "ReviewID": "R1L5PNJ4OV6SWT", "Overall": "2.0", "Content": "I bought this for my sister who has limited vision. It is of poor quality and it does not have a speaker phone. Even though it has big numbers the display is hard to see because of the digital display color.It was loud enough but it has very low reception, it would constantly drop the calls. It would also occasionaly have a loud piercing noise that could have damaged the ear drum.The idea of having big number dial pad is great, but it needs more work.I would not recommend it. I have since returned it and received my refund.The company was very understanding, I would do business with them again for other products.", "Date": "April 12, 2011"}, {"Title": "Very simple, great for those who want simple, and/or have impared vision.", "Author": "J. Bass", "ReviewID": "R1RJ56V2E931HT", "Overall": "5.0", "Content": "I bought two of these - one for my father, and one for my mother.  My father was forever having issues pocket dialing, having phones do weird things (operator error), having issues seeing the phone (macular degeneration) and in general, had issues all the time with other phones.  I got him this, and it seemed to fix his problems.  My mother's phone is rarely used, but she has no issues with it either.  It makes calls, receives calls, and has no issues.The phone is pretty simple - it CAN text, it has big buttons, clear screen, HARDWARE keyboard lock (very cool), a flashlight (high intensity LED (good!)- again, hardware switch), and a FM radio (hardware switch - haven't really tested it, weird, but cool).Phone receives as well as my 'fancy' smartphone, sounds very clear both ways, and has decent battery life.  It's a good form factor too.  The phone has the \"SOS\" button on the back, but we turned it off - I don't want any 'incidents' with that...  Don't expect anything beyond a phone with this - it is NOT INTENDED to be anything BUT A PHONE.  I saw some 'reviews' on some other sites that complained about the lack of features - THAT IS THE PURPOSE OF THIS PHONE...  It makes it VERY good at what it is.Overall - I really like this phone.  If I wanted something dead simple - this would be it.", "Date": "February 21, 2012"}, {"Title": "great phone for Mom", "Author": "Sara Templeton", "ReviewID": "R1DY3S3FPEU3V8", "Overall": "5.0", "Content": "I was looking for a simple, easy to use phone for my Mom that was unlocked and compatible with her present cell phone plan when I stumbled upon this phone! It does just what she wants and that's make and receive a few calls a month. I like the SOS button that allows her to contact emergency contacts without dialing if she should have an issue say like falling while on her daily walk. So far we couldn't be happier with this phone!", "Date": "May 24, 2011"}, {"Title": "great phone", "Author": "Donald J. Dandeneau \"dandi\"", "ReviewID": "R107JZI4OK0PTV", "Overall": "5.0", "Content": "this is the phone for the hard of hearing it has large numbers and is loud  it has no bells and whisles its just a phone that works anywhere thats what i wanted its a just5 phone you can store numbers and it has call waiting what else do you need........", "Date": "March 25, 2011"}, {"Title": "he can see the number, hear the phone first", "Author": "Dorothy L. Reynolds \"......\"", "ReviewID": "RQ4COT1AN2EP5", "Overall": "5.0", "Content": "He can see the numbers, and hear the phone first time in a long time, this phone is great, he loves that he can hear, see and dial with this phone. Highly recommend this phone it is uncomplicated and that is what he needed. We also love the personal emergency button as he has an illness and you just never know when you might need help. Worth the price", "Date": "December 30, 2010"}, {"Title": "Unhappy customer", "Author": "S. Stephens \"music lover\"", "ReviewID": "R1P1UNO98Y9X6X", "Overall": "1.0", "Content": "When the phone first arrived I was pleased with its serivce.  However,  the longer I use it the less pleased I am with it.  My primary compaint is that it drops most of my calls.  I sometimes have to dial a number 2 to 3 times to get the call to go through.  I also have problems with people hearing me on the phone.  I think that is because it does not show an adequate cell tower connection.  I am going to return it.", "Date": "April 28, 2011"}, {"Title": "SIMPLE,LOUD,BRIGHT", "Author": "Juan Carlos Landaeta", "ReviewID": "R3P79O6IYFMLUJ", "Overall": "5.0", "Content": "I got this for my dad who is 84 years old and needed a simple, easy to use phone, easy to hear, and with the buttons big enough for him to handle.....this is it...perfect", "Date": "August 22, 2011"}, {"Title": "We've owned two of these for two years....served our needs.", "Author": "SSL", "ReviewID": "R1TOTB8NMK1YZA", "Overall": "1.0", "Content": "But both units stopped operating within three weeks of each other recently, and the failure mode appears consistent. A pattern failure. All of the usual suspects \"battery, processor reset\" were eliminated as root causes - so we're just left with two inoperative phones which cannot dial. Not very useful as an emergency tool....When purchased - this was not a \"cheap phone\" given the feature set. So we expected more.", "Date": "July 15, 2013"}, {"Title": "Love This Phone", "Author": "Jenn \"Amazon shopper\"", "ReviewID": "RDVG60I5QGCY0", "Overall": "5.0", "Content": "My Mom is 82 and we finally found a phone she can use with ease and it's so simple. Mot intimidating at all.  We use  AT&T.; I would recommend this phone to seniors as the numbers and nice and big..", "Date": "February 26, 2013"}, {"Title": "Good Features", "Author": "Jose G. Urbina", "ReviewID": "R3KEV66PRBMWOA", "Overall": "4.0", "Content": "Purchashed for my parents, they are happy with the volume, fm radio, lock switch, large keys, display, and the key read back feature.. would of liked it with less screen options but its still simple to use.", "Date": "October 10, 2012"}, {"Title": "Just5 cell phone", "Author": "luvtoshop", "ReviewID": "R2XGOA78H78AHY", "Overall": "2.0", "Content": "I think it a bit pricey.  I found it difficult to program and when I called for help, the company was not too friendly, i.e. \"Did you read the instruction manual?!!\"  Of course I did, but still found it difficult. Also, it requires a $10 activation fee, plus I purchased 30 min. for $10.Returned it and lost out on the $20.  I have since purchased a $10 Tracfone and love it.  They put in the date, time, how many days you have left, how many minutes you have accumulated, no activation fee.  I love it! Although the numbers are small, they light up, a real plus at night.", "Date": "August 29, 2011"}, {"Title": "ok, but broke down within a month", "Author": "MAMB \"Super Miguicho\"", "ReviewID": "R11LL87XTACKYL", "Overall": "3.0", "Content": "The phone quit working within a month. It happens I guess. It had some good features, but it discharges very fast, unable to make or receive calls. Tried to turn it off, removed battery, still not working. It Is going back.", "Date": "June 13, 2013"}, {"Title": "Great phone for anyone that doesn't need smart phone.", "Author": "Melinda C.", "ReviewID": "R3EBR7X55F5L0H", "Overall": "5.0", "Content": "I got this for my husband who is 75 and confuses easily and does not want to give up having a cell phone.  It is just about error proof.  Screen is easy to read, numbers are large.  He cannot get into trouble accidentally with this phone.", "Date": "May 8, 2013"}, {"Title": "A blessing for my husband", "Author": "Brenda J. Barnett", "ReviewID": "RD3CG73K4UD3X", "Overall": "4.0", "Content": "My husband is extremely hard of hearing and when we lost our home to a fire - all we had for several months was our cell phones.  We could not find him one that he could hear on well enough.  I wanted to be able to switch his AT&T; sim card out and this was the answer.  Even locked it's a little quick to 'pocket dial' - but otherwise - IT\"S Great!", "Date": "March 29, 2013"}, {"Title": "cell phone for seniors", "Author": "Nellie", "ReviewID": "RY44D0XWECUYS", "Overall": "3.0", "Content": "keys are  very visible and volume  good.  The keys, however must be locked when not actually in use.  A hassle.", "Date": "July 16, 2011"}, {"Title": "Doesn't work for a AT&T.;", "Author": "Dazeoff", "ReviewID": "R37DREA3TFOVJ6", "Overall": "1.0", "Content": "Had to return this, which the seller gladly accepted, because it DOESNT WORK WITH AT&T.; Beware as this is not a 3G phone and will not work with ATT as stated it would.", "Date": "December 12, 2013"}, {"Title": "Great Phone for Seniors", "Author": "dixiedinah", "ReviewID": "R3TXW7DZJG73IA", "Overall": "5.0", "Content": "I wanted a phone that did nothing but make and receive phone calls, along with and address book and voice mail.  This one is very easy for my 83-year old mother to use, has a speaker phone, and she is very happy with it.  AT&T; did not have a suitable free/low cost phone for her, so I bought this one, put her SIM card in it and it was good to go.  Did not even alert AT&T; of the change.  Best part is not having to re-up for another 2-year contract!", "Date": "October 1, 2013"}, {"Title": "Just 5 phone great product", "Author": "sharon blaylock", "ReviewID": "RF9PC74T144SP", "Overall": "5.0", "Content": "Bought this phone for my mom because she lives by herself and we wanted her to be able to have the security of knowing that she could just press the red button on the back to get help when she needed it.The buttons are big enough to see. Programing the phone was very easy. I would recommend this phone to any elderly person you know who lives by themselves.", "Date": "September 2, 2013"}, {"Title": "Just 5", "Author": "Mrs. Cheryl Bates", "ReviewID": "R200SKQ65MIGZB", "Overall": "5.0", "Content": "I bought this phone for my mother and she can hear more clearly and can see the keys.  It is a good phone.  I would like to find a case for it she feels it can be a bit hsrd to hold. Like it!!!!", "Date": "May 17, 2013"}, {"Title": "Mostly I like it but...", "Author": "Roberta F. Burroughs", "ReviewID": "R3QXCW27N7NQVM", "Overall": "4.0", "Content": "I'm not sure that it rings every time and it doesn't keep the correct time, but we didn't try to re-set it yet.  Otherwise, it's fine.", "Date": "May 6, 2013"}, {"Title": "Nice phone but Dad didnt like it.", "Author": "Brenda Mack \"The Avon Lady\"", "ReviewID": "R1Z6QIN5L3F7WS", "Overall": "3.0", "Content": "Got it for Christmas for my dad but he didn't like it. He has eye problems and couldn't see the screen with the orange background.", "Date": "January 26, 2014"}, {"Title": "Really Love this phone...", "Author": "RA", "ReviewID": "R3D8H2D2C6YU8X", "Overall": "5.0", "Content": "Purchased for my Dad who is 74 and has a hard time seeing. He says it is really easy to use as well as dial.", "Date": "January 13, 2014"}, {"Title": "Grandma likes it", "Author": "D. Yost", "ReviewID": "R1JVW3QJBSIPER", "Overall": "4.0", "Content": "I got this phone for my wifes Grandma who is 98.  I ended up putting in a Tmobile pay as you go chip and it worked fine.  This phone takes a normal sized SIM, Not the tiny kind most new phones take.The interface is very simple but that is the point.  You can program the panic button on the back to cause the phone to do the following in sequence:1) Start an audible alarm2) Send text message(s) to phone number(s) you specify advising them that you are having an emergency and to answer your call3) Call the phone number(s) you specify.", "Date": "December 28, 2013"}, {"Title": "Easy to use", "Author": "Pam Brasher", "ReviewID": "RJWAD9CN0C9Y6", "Overall": "5.0", "Content": "I ordered this for my father-in-law.  I believe it will be just right for him as he has tremors in his hands.  The keys are large & the phone is easy to use.", "Date": "December 28, 2013"}, {"Title": "A good item for some, this item did not meet my expectations", "Author": "Robert Reyes \"radio head\"", "ReviewID": "R36IVJFS5GBHZQ", "Overall": "1.0", "Content": "...there were limited ring tone features ..was unable to adjust volume level ..not a good experience and not so simple !", "Date": "December 10, 2013"}, {"Title": "Phone", "Author": "Carl Sundeen", "ReviewID": "R2KDUPWDK78ZCX", "Overall": "5.0", "Content": "Works great and does what I wanted it to.  This phone is great for older people who have trouble with the small keys on most phones", "Date": "November 30, 2013"}, {"Title": "Great phone.", "Author": "Kenny caudill", "ReviewID": "R1TL6IYWXXPMKQ", "Overall": "5.0", "Content": "Great phone for my mom. Easy to use and she can hear well thanks to the high volume. Large buttons make calling easier.", "Date": "October 25, 2013"}, {"Title": "If you need a phone to just be a phone this is it!", "Author": "Tracy Chapman", "ReviewID": "R17A2Z2EMS9LMH", "Overall": "5.0", "Content": "I needed to replace my Nokia flip phone but all of my AT&T; choices were for smartphones or flip phones that required a plan that included data which I did not want. I liked my AT&T; plan and did not want to change that but AT&T; did not have a simple phone, so this was just what I needed.  It was reasonably priced, no activation fee (which I would have been required to pay if I had gotten a phone from AT&T;) and right out of the box, I was able to insert the SIM card from my old Nokia and the phone was ready for use. I had read reviews that indicated difficulty with voicemail on this phone but I did not find that to be the case at all.  I simply programmed my voicemail number into the JUST5 and when I received the voicemail indicator I called the number and got my messages. The amplified sound is great and none of my callers have ever complained that they couldn't hear me so apparently it works on both ends.  The other complaint I read about before buying this phone was that it only lasted about a year.  I'll have to wait to see if that is true.", "Date": "October 23, 2013"}, {"Title": "I love it ,very good product ,Quality and Price .I recommend it to anyone.", "Author": "Rabea Qutub", "ReviewID": "RSOQ44V0KHMQ8", "Overall": "5.0", "Content": "I love it ,very good product ,Quality and Price .I recommend it to anyone.specially for my mother.enjoy it.", "Date": "September 27, 2013"}, {"Title": "THE WORLDS BEST SELLERS", "Author": "DAVID HALCROW", "ReviewID": "R3G6FTFG4M8ZEF", "Overall": "5.0", "Content": "These guys are tops...I seen it all...and I have say that you can find guys like these. THEY GO TO NTH DEGREE TO MAKE SURE EVERYTHING IS OK.....THEY OUGHT TO GET AN ACADEMY AWARD....", "Date": "September 19, 2013"}, {"Title": "Great product!", "Author": "Gaila Breeckner", "ReviewID": "R23I0OA0RXUATT", "Overall": "4.0", "Content": "This cell phone is just what Dad needs. The fact that there aren't a lot of buttons is a plus.I ordered the phone on a Tuesday and received it on Thursday.", "Date": "September 9, 2013"}, {"Title": "Great for elderly", "Author": "Stefan", "ReviewID": "R1J5O7TNLDHZO9", "Overall": "5.0", "Content": "I bought this for my 80 year old grandpa. The only electronics he uses are the remote control and home phone. This cell phone was perfect for him with the larger buttons and he also wanted a no contract \"pay as you go\" and with this phone, it is possible. It has all the basic functions that he needs, also has texting but he does not want that. Definitely a must buy if you have an elderly in the person in the family that wants/needs a basic cell phone to contact him or her anywhere they go.", "Date": "September 6, 2013"}, {"Title": "Excellent!", "Author": "YAYA", "ReviewID": "R8NRFDOQA3OIQ", "Overall": "5.0", "Content": "I bought this as a gift for my father. is excellent because it is older and uses it very well.", "Date": "July 4, 2013"}, {"Title": "NO SERVICE YET", "Author": "Hartgrove Hospital", "ReviewID": "R1SIQ1T96TL7Z", "Overall": "3.0", "Content": "It is Not easy to get service especially without a sim cardI think sim card should come with phone", "Date": "August 26, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Extremely Easy to Use\nBig Buttons\nAmplified Sound\nPersonal Emergensy Response System (PERS)\nUnlocked GSM phone", "Name": "JUST5 J509 Easy to Use Unlocked Cell Phone with Big Buttons, Amplified Sound, Personal Emergency Response System (Grey)", "ImgURL": "http://ecx.images-amazon.com/images/I/41-ckgRJS-L._SY300_.jpg", "ProductID": "B003ZYUG8O"}}