{"Reviews": [{"Title": "Great phone? Yes! Have you been duped? Maybe!", "Author": "texaopian", "ReviewID": "R190AS8SSPW8HJ", "Overall": "1.0", "Content": "The Purchase:After alot of research, I decided to purchase this Motorola XT701 from Amazon last year (Amazon has a great return policy). Phone looked good when it arrived. There are different versions of this phone, the one I received was the Chinese/HK version. Unlike other 'new' phones as told in other Chinese Motorola forums, the menus didn't start in Chinese (like other Chinese/HK XT701s) - More on this later. After a quick charge, I popped the AT&T; SIM card in and poof it worked. It'll work on AT&T; & Tmobile. It'll work on AT&T;'s 3G network. It won't work on Tmobile's 3G/4G network. I did have some problems sending MMS. After re-entering the AT&T; settings a couple of times it finally started to work.Suggestions:Add $100+ for a SquareTrade ADH Warranty. YOU WILL NEED IT. You'll need to update the phone (to Android 2.1) as soon as you get it. The built in keyboard is $&^+ (it's a English/Chinese style keyboard) - you'll want to download another one from the Android store. I'd suggest tossing the supplied MicroSD card. It's slow. Buy another one thats at least a Class 6 or better.What's great:1. Cool design.2. 3G speed3. Thin & lite4. Apps5. Camera + a REAL flash6. Easy to rootWhat isn't great:1. Keyboard2. Screen - taps are unresponsive at times2. Internal memory / App storage limit3. Physical camera button - hard to get to4. Phone freezes / lags - it can't keep up with ALL the bells and whistles (live wallpaper, etc)5. No custom ROMs (its not a popular phone)6. Getting lied to - first by Motorola, then (possibly) by the seller.Lie #1 - When I bought the phone, Motorola stated it planned on updating the phone to Android 2.2. After saying yes then no then maybe then yes to Europe, but not China, and now no to all xt701s. If I knew this before I bought it, I wouldn't have made the purchase. Android 2.2 would solve ALOT of nagging issues with the phone. First, Android 2.2 is faster than Android 2.1. Much faster. An update would get rid of some of the lag (due to the slower the slower processor) when taking pictures, videos, running live wallpaper, etc. Second, the ability to store Apps onto the SD card. With Android 2.1, I hit the App memory limit within 2 weeks of owning the phone. Third, better keyboard and multi-touch responses. The list goes on.Don't buy this phone if you're a power user. It will disappoint you.Lie #2 - I treat my phones very good. For this phone, I bought an SGP XT720 case for it (one of the very best phone cases). About a month ago, the phone started to go crazy acting like someone/something was tapping the screen, making selections, dialing numbers etc. For awhile, I thought someone hacked the phone. Factory resets didn't solve the problem. This craziness evolved into a part of the screen being dead to touch. A vertical strip about 3/8\" (1cm) wide located on the right side of the screen was dead. The phone was barley usable. I know its not covered in the US, but I took chance and brought it a certified Motorola repair center who told me - yes, the screen was dead, no its not covered by Motorola US and by the way, the phone looks like its been opened before (tool marks) and the screen in there doesn't have a Motorola P/N on it - hinting that it was some generic screen replacement. Which means, I didn't get the \"gorilla glass\" screen that Motorola had advertised. It was made known to me that this \"new\" phone could be a Chinese/HK refurbished phone being sold as \"new\" to unsuspecting US customers. It apparently happens all the time with International \"No Warranty\" phones. Going back to my first paragraph about the language being switched from Chinese to English when I purchased it doesn't help me believe that the phone was new and untouched between the factory and my door. Alas, I can't \"prove\" that it's a refurb except from what the tech told me (and the gut reaction to how greedy people can be). I really hope its a refurb because I would hope (as a Motorola fan) this isn't the way Motorola puts an expensive phone like the XT701 together. Apparently, there are many many instances of this screen issue happening to the Milestone/Droid community. As the Moto tech described, the Droid and the xt701 screen use the same technology. So this could be a defect (or the result of a bad batch of screens, or a real design flaw). It doesn't help that Motorola dropped support for this line like a hot potato late last year. When I bought it in September, the phone wasn't out in the market for that long. Two months later and Motorola started to drop planned upgrades, accessories, patches, etc.Don't buy this phone if you're looking for a sturdy product. Do buy this phone if you'll plan on spending another $200-300 on extended warranties, cases, and a backup phone for when it randomly dies.Conclusion:While when I bought this phone, I considered it a 5 star product. Looking back, I see that I put up with the little issues knowing that they were going to be fixed in the next software & firmware updates. Now that I know these things won't be fixed (no updates whatsoever), it's not worth the money. Seriously. If you're going to drop $350 ~ 400 for a phone, you'd expect for it to be refined OR at least have a way to get issues resolved. No support from Motorola for software/ firmware/ warranty makes this a bad gamble. There isn't a third party community for it. So there isn't much indirect, community support either. The warning from the tech about the International refurb phones sold to North Americans as \"new\" isn't surprising. It's happened to me with \"new\" Motorola phones from eBay in the past, but I really wasn't expecting it from Amazon.Good luck with whatever you decide to do. If I were in your shoes, I'd look elsewhere.", "Date": "January 6, 2011"}, {"Title": "XT701/720 experience", "Author": "Foxuniform", "ReviewID": "R17R5LUKK8QZ37", "Overall": "5.0", "Content": "I am pretty much a die-hard HTC fan, and I have been buying strictly Android phones since the T-Mobile G1 was released two years ago. I had a lovely HTC Desire and left it to try an XT701. I am extremely satisfied with the XT701. There are some noticeable advantages of this phone over the HTC Desire, and they are...1) BATTERY PERFORMANCE - my HTC Desire battery (as well as my G1 and other HTC Android phones) used to run down to around 20% to 30% at the end of day one. This would mean I had to charge up overnight on a nightly basis. BTW, I usually take my phones off charge around 7am. Yes the Desire has a 1Ghz processor and over twice the RAM of the XT701 but you don't really see any lag on the Motorola. Android is a very smooth-running OS.2) SPEAKER SOUND - I paid $650 for my HTC Desire and $400 for my XT701. The HTC has a very 'tinny' speaker sound and the Motorola has a more full range, AND plays louder than the HTC. Same applies for the in-call internal and external speakers. Ringtones are easier and more qualitative on the Moto. Even the built-in notification sounds are easily audible on the Motorola while I have missed many of same while using my Desire. Additionally, the HTC produces a harsh sound, especially at higher volume levels.3) SOFTWARE - Yes I heard the XT701 may never get Froyo, but my XT701 has something HTC never put on their phones - sound settings (similar to an EQ)for both internal and external speakers. Also, there is a setting for optimum battery performance, or for optimum processor performance. I have my XT701 set for the former and have no lag issues worthy of reporting. Very commendable. I have yet to see either of these features on an HTC Android phone.4) FREQUENCY BANDS - XT701 can run on AT&T;'s (and other traditional North and South American) 3G networks. In fact it is tri-band 3G and the XT720 is dual-band 3G.5) CAMERA - I don't know how good the XT720's photos are, but the XT701 takes really great photos and I would not ask for more. They are really outstanding shots. I am fully satisfied with this aspect of the phone as well.  To me the XT701 and subsequently the XT720 are great overall phones with no major weak points.I buy a lot of phones and this has to be among the best phone I have had in a long time. XT701 and XT720 - VERY GOOD all-rounders!!!", "Date": "November 20, 2010"}, {"Title": "Great phone!", "Author": "Adam", "ReviewID": "R378BZ0ORLFZXT", "Overall": "4.0", "Content": "Wow, this phone is great.  I purchased it from another site for a similar price.  I was thinking about returning it to get an Evo 4g, however, I opened it up and although AT&T; is more expensive than Sprint I'll stick it out for a little while longer because of this phone.  This phone will work with AT&T;'s 3g network and I had no problems downloading from the Android Market.  One bad thing is I can't send a MMS.  I don't send that many video or picture messages but it would be nice to be able to.  I think it's a compatibility issue since I took the sim card out of my iphone and stuck it in this bad boy.  The camera takes nice pictures and it has a xenon flash and auto focus as well.  The OS is as expected, great ( I see Android taking over in the years to come).  I'm still new to Android but I'm already used to it.  Like I mentioned before I have an iphone and I prefer to use this phone instead.  The screen seems sharper than my 3gs and is highly responsive like the iphone.  I would give it 4.5 stars if it were possible and 5 stars if the MMS worked.  This is a great phone but quite expensive.  If you have the cash and want a good Android phone without a contract this is the one to get.", "Date": "August 17, 2010"}, {"Title": "Motorola does not provide updates for their Android devices", "Author": "Evren Yurtesen", "ReviewID": "R9BVF4A3R5IYL", "Overall": "1.0", "Content": "Motorola makes great devices which have the latest software, however once you buy the device you get no updates to it which makes it obsolete in a few months! Then they make a new version of the device with the newest software again to lure even more people to their trap. See Motorola Europe pages for example for comments on how Motorola is treating their customers.[...]Also in the US, they locked bootloaders of the newer phones which will soon create the same havoc it did as in Europe.I would stay away from Motorola's products (and I wish that I never bought an Android phone from Motorola)", "Date": "December 28, 2010"}, {"Title": "Good choice", "Author": "Mauricio Videla Vallejos", "ReviewID": "REK6VQYY3EAOA", "Overall": "5.0", "Content": "First time with an Android phone (Had a Symbian and a WM6), and i'm very happy with this one, good camera 8MP, very good flash (Xenon), fast processor, i'm using it on southamerica, and have no problems with my local celular company.", "Date": "October 1, 2010"}, {"Title": "A good phone on paper, but in practice a big headache", "Author": "bladefistx2", "ReviewID": "R27KNPRZBFBRGG", "Overall": "3.0", "Content": "I have the XT701 for more than a year (got it for $470).The reason I got it was because it had really good specs:Xenon flash, 5MP Camera, Android OS, excellent screen, etc.So why only 3 stars?Unless you are ready to spend hours and even days on it,installing different firmware and flashing ROMs, don't bother!Motorola has decided not to support this phone anymore, therefor itis impossible to update (officially) from 2.1-update1You may say \"what's the big deal?\" - yes this is a huge drawback.Android 2.1 users can't install applications on the SD card,and there is only 200MB of internal space.For example, Facebook takes up in my case over 35MB just forstorage of the caller-ID images, same as the Contacts application.Other than that there are many tweaks and improvements from 2.1 to 2.3.5 OS.There are some workarounds, but they are very tedious to installand I have experienced many problems and crashes.If you are not a power user, this may not be your concern,but if I was just interested in using the basic features,I'd go with something like the HTC Wildfire S (under $300).Check it out: HTC Wildfire S A510e Unlocked Phone with Android 2.3.3, 5 MP Camera, Wi-Fi, GPS and Bluetooth - Unlocked Phone - No Warranty - Silver/WhiteHope this helped you decide.", "Date": "October 13, 2011"}, {"Title": "A Perfect Dud", "Author": "benoumena", "ReviewID": "R278QYCNDAJHTW", "Overall": "1.0", "Content": "The phone worked great for about 4 months, then I started having problems with it holding a charge beyond 1/2 day (without even using it). Recently, the phone began to completely die at random until now it's no longer usable. What a waste of money!When it was working the touch screen wasn't as nimble or responsive as the iPhone 3GS and the delay from when you would take a photo until the image was viewable in the gallery sometimes took up to 3 days. This is unfortunate since the camera is the best feature of this phone.", "Date": "May 2, 2011"}, {"Title": "Complaint", "Author": "Fausto", "ReviewID": "R1SG5QXSY2Y8AY", "Overall": "1.0", "Content": "WiFi an Bluetooth doesn't work, the phone just receive calls and it's all. I need you to solve this big problem.", "Date": "April 15, 2011"}, {"Title": "Great Phone, not Great Company", "Author": "Marcial Cambronero", "ReviewID": "R2ZA88DBSA0EDF", "Overall": "4.0", "Content": "This phone has sme exceptional features and capcities, but unfortunaly Motorla won't update it from Android 2.1, so it loses a lot of software, including Voice Search. If you want a good phone, buy it, but don't expect good support or many updates from Motorola", "Date": "December 29, 2010"}, {"Title": "xt701", "Author": "gyozzia", "ReviewID": "R2DDF2G6CNG2EA", "Overall": "4.0", "Content": "Excelente celular, resolucion impresionante, gps excelente. muy rapido el wifi.Los unicos detalles son: idioma -solo ingles o chino-, para escribir el teclado digital es pequeño, es cuestion de costumbre.", "Date": "December 28, 2010"}, {"Title": "Very limited roms out there", "Author": "DeMagH", "ReviewID": "R1Q7YMCFSJ52YB", "Overall": "4.0", "Content": "Well, Foxuniform stated the differences between HTC desire and this phone really well and i hate to be repeating info so mindlessly, so i am going into another direction reviewing this product.The feel:--------well, it feels a bit weird, not that classy effect you'd expect from the online pictures of the phone. When you touch the phone, there is this weird very light/plastic feel to it, it comes to mind that this is a DEMO phone, not a real one, but it turns out to be actually REAL, and you get used to this feel really fast.Pre-Installed Applications:---------------------unlike HTC phones, this got nothing special about it. Default android dialer \"no easy/smart search through the dial pad\", no clever widgets .. seriously, NOTHING. Of course you can download tons of these from the market, but I like the brand to have some effect/taste on the phone.The default languages to select from are really few, 4 options to select from, 2 of them are english UK and USA. Limited choices of keyboards and some confusing keyboard to start with which takes whoever is not used to the android phone systems sometime to adjust to get it working as it is supposed to.Although the points above sound like a bad thing, but they have their benefits. The ROM storage capacity is really nice because there is no load of needless applications installed like HTC which you cannot uninstall. Like the weather application, news/email widget, unique music player .. etc. This helps you to install as many programs as you want from the market without the need to move applications to SD card ASAP.Note:Of course moving applications to SD card requires Froyo, but even with froyo the available ROM space won't make you feel the need you should move appz to SD card.One last note, battery software/widgets don't read the REAL battery life remaining/percentage for some reason on this phone, tried 3 applications now, and they all act the same, 10% is gone from the phone within 15 minutes of taking it off the charger, and no lower units than 10%, it just goes from 90 to 80 with no warning or 85 in between, very buggy/distracting experience.The Software/computer connection:-----------------------------Well, you can of course sync using google account and auto sync, but sometimes i enjoy having the option of a user friendly application with features like HTC sync that enables me to just connect the phone to sync, media, contacts, music with one simple click.Finally, modded roms:------------------Looks like the phone wasn't popular enough to draw the attention of software modding/developing android forums. So limited number of low quality roms, no guides or files to add different languages to it, even from rom manager, there is not a single ROM you can just get to try on the fly, which is a big deal for someone with special needs or want to go geeky with his small new gadget.Rooting the phone is easy though through z4root which can be downloaded from the market, overclocking it was easy as well with the application MileStone Overclock, but better than these two are the modded roms out there waiting for users to make good use of them. For example, Cyanogenmod was really a nice experience on the Desire and will surely go on checking its developments ASAP with all my coming android phones.Verdict:------This is a very late review of course, written in 27/12/2010, and by no means i will be recommending a phone this old to anyone. Surely there are better phones right now to get, but if you on budget and can't squeeze an extra 100$ AND have unreasonable/unexplainable strong like/love feelings towards this motorola phone, then go for it.Overall, it gives you a good average Android experience with a QUALITY built phone hardware.EDITED:One more thing i forgot to talk about, the camera, OMG, seriously this thing rocks in both photo/video modes. I took pictures of my son playing, running and whenever the shuttering sound plays, the picture is take with no blur or whatsoever. Unlike the HTC Desire, i can't take a single photo of anything moving with the speed of 1 mile per decade.Only downside i find sometime, is the extreme delay time/period when from when i click the white capture button on the screen till the picture is actually taken, other than that, all good.", "Date": "December 26, 2010"}, {"Title": "Best Camera on the market right now....", "Author": "Vincent Russo", "ReviewID": "R3NEGZ91OJGFTC", "Overall": "4.0", "Content": "Bought this to replace my BB Bold...Android took some getting used to, and had to configure a few things for US keyboard (Phone is from China)Once up and running, LOVE it.Only phone on the market with a Xenon flash, so you can leave your point and shoot camera at home!", "Date": "May 28, 2010"}, {"Title": "Awesome Android", "Author": "Rigo Torres \"Rigo\"", "ReviewID": "RY72WUWR9YTDU", "Overall": "5.0", "Content": "It is a really good phone and its a great value for your money. Feels great on the hand and the build quality is spectacular... We just  need to wait for the update for Froyo", "Date": "November 5, 2010"}, {"Title": "Awesome Seller", "Author": "Mello", "ReviewID": "R30X474M507K07", "Overall": "5.0", "Content": "Ordered the XT701 unlocked but due to a stocking error the seller was out of this model and offered to bump me up to the XT720 at no charge.  Been loving the phone, and will definitely be checking back with the seller for future purchases.", "Date": "September 30, 2010"}], "ProductInfo": {"Price": "$799.99", "Features": "GSM 850/900/1800/1900, HSDPA 850/1900/2100\nDisplay: TFT capacitive touchscreen, 16M colors, 480 x 854 pixels, 3.7 inches, Touch-sensitive navigation controls, Accelerometer sensor for UI auto-rotate, Proximity sensor for auto turn-off, Handwriting recognition\nCamera: 5 MP, 2592 x 1944 pixels, autofocus, xenon flash; Video: D1(720x480)@24fps; Photo viewer/editor\nPlatform: Android OS, v2 (Eclair), TI OMAP3430 600 MHz processor, HTML Browser, Bluetooth with A-GPS support, Wi-Fi 802.11 b/g\nMP3/eAAC+/WAV player, MP4/H.263/H.264 player, HD video(720p) playback over built-in HDMI slot, Document viewer, Organizer", "Name": "Motorola XT701 Unlocked GSM Smartphone with 5 MP Camera, Android OS, Wi-Fi, gps navigation, Bluetooth and Touchscreen--International Version with No Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/515fm7zZ9BL._SY300_.jpg", "ProductID": "B003NU84NO"}}