{"Reviews": [{"Title": "Excellent smartphone, with a few niggles.", "Author": "Brian", "ReviewID": "R1CDPODWFXRZB6", "Overall": "4.0", "Content": "After using this phone for a week, I've fallen in love with it.- Interface is very snappy.- The screen is incredible. Very bright and the colours are outstanding, and just the perfect size.- The AllShare app for playing content from a UPnP server is nice. At home, I can store my entire collection of music and videos and play whichever I want.That said, there are a few issues I encountered:- Interface, despite its speed, occasionally freezes. I was worried when this occurred an hour after I started using it, but it's only happened a few times since then. Usually lasts no more than 10 seconds.- No flash for the camera. I'm given to understand that an LED flash is common on smartphone cameras these days, so low-light photos aren't as good as they can be.- Camera again: no dedicated button, so taking pictures is a bit awkward. Definitely turn on the anti-shake feature.- AllShare is a little finicky sometimes about detecting media servers. Moreover, the player is a little deficient next to the normal Android video player (it stretches videos to conform to the screen's aspect ratio, and I haven't discovered a way to return the video to its native aspect ratio).- Battery runs out fairly quickly if your browsing the internet or watching videos all day. Haven't had a chance to test it on pure standby yet, but you aren't likely to go a whole day if you're using the \"smart\" part of the smartphone.Even though I listed more issues than positives, the phone is very good and I would recommend it to anyone. All the other aspects of the phone are common to other Android sets and should be well known to Android lovers. The Samsung additions to the UI such as Daily Briefing (weather, stocks and news in a widget) and the seven homescreens are nice touches, but not particularly a deal breaker, and I haven't tried any of the other Samsung apps.An additional note: this phone is really, really light and thin. While some other reviews have thought it too \"plasticy\", I absolutely love the build. I can use it all day.The input method, Swype is also on by default, but you can get this on other Android phones. Very nice, though, and a nice thought from Samsung. Check out some videos on Youtube of it, but I also have to say that it's hard to say how nice this function is without using it yourself.Some other details: this version is the 8GB internal memory model. For Americans and countries using similar power sockets, since this is the international version the charger it comes with is the Europlug style. You'll need to get either a converter or your own plug with a micro-USB connector.", "Date": "August 2, 2010"}, {"Title": "Excellence Found", "Author": "Winter", "ReviewID": "R3GV1YTK3EXGG1", "Overall": "5.0", "Content": "I've had my Galaxy S (or \"Captivate\") phone for a year now, I'm still enjoying it very much today.  I'll take a little bit of time here to separate what's great about the Captivate that's specific to the phone, versus what's great about a Droid-based smart phone in particular.First off, the Android OS is really very enjoyable. The top-level screen can have 5 pages of whatever you like and the Applications area neatly organizes installed apps separately, to page through them as well. If you're not familiar with this concept, think of the top-level screen as being similar to the Windows or Mac Desktop and the Applications area as being similar to the Start Menu/Launch Bar of your favorite computer OS.The best thing about the Captivate is the hardware: the screen really takes up almost all of the phone's face, and it's vivid, colorful, and bright. The battery cover is a slick one-two slide that makes it easy to access without being the first thing to fall off if you drop the phone. The 1GHz processor inside the phone makes apps speedy, and I even find it to be fairly nimble about data use, easily grabbing onto my favorite Wi-Fi networks when I'm in range, then switching seamlessly over to my data network when I'm not.Then we have the good things about the Captivate: calls are clear, I've had strong and clean reception even when I notice a drop in bars, and on those rare occasions I step into a dead zone, it seems to try its very best to hang on to the call...I can't explain it in technical detail, it's just the gut impression I get when I've driven or walked through areas that typically give me trouble on any phone and against all odds I stay connected (my office, for instance, is up against a cliff wall that closes further in near the top of the building). One complaint about this phone (and many smart phones) has been battery drain, but I find it manageable: if I choose to use the Power Toolbar (built-in and easy to add) and Advanced Task Killer app (a separate download, and a must for any smart phone owner), I can go 2 or 3 days on a single charge. Usually it's easier to top it off at the end of the day or leave it plugged in when I'm not going to be using it for a while. While the Captivate seems very wide, it is also very slim and thus surprisingly light. I added the carbon-fiber hard case to the outside and it still weighs noticeably less than an iPhone 4.Using the Captivate is fairly simple: the connector port for the charger or a data cable are one and the same: a \"micro\" USB connector with a tiny sliding door to keep dirt out. I much prefer this to the plastic peel-away tab that usually comes off in your hand if you're not careful. The charger that comes with the phone also pops apart into a data cable, allowing you to detach the AC outlet prongs and connect to the computer. And last, the navigation buttons are just four touch-sensitive spots along the base of the screen, with a slide rocker on the left side of the phone (for volume) and an unlock button on the right. I've heard people say it's hard to pinch a button on one side without accidentally hitting the other (such as turning down the volume when you go to unlock the phone), but I haven't had this problem.More on the OS: using Android 2.1 (now FROYO), I find myself discovering neat little features that I enjoy. For example, some of the wallpapers are interactive with the touch screen. When I'm playing music, if I need to pause, I don't have to unlock the phone: a tiny CD logo appears in the top with controls for pause/next/back. The \"Swype\" feature of the OS is extremely responsive. I didn't have to adjust any of this - the sensitivity really seems balanced between \"must mash to get a response\" and \"breathed on it and accidentally deleted something\". Unlocking the phone requires a tap of the button and a swipe along the touch screen. Even the tilt--a feature that began to annoy me in my Nokia phone--seems to both be quick to respond and easy to correct if you didn't mean to rotate the screen. The 2.2 update of the Android OS came out a few months ago and it's been a nice series of subtle ways the features are improved--for example, it's now easier to manage connecting to a PC.Much as I enjoy this phone, all is not perfect. The buttons sometimes don't respond properly. There are times I have to tap twice, and there are times I try to hit 'back' and accidentally hit 'search' instead. I'm not sure how much of that is in the programming, the hardware, or my thick thumbs. The Search window is extremely handy, but it doesn't always frame the search properly. For example, I might be in an app that has a long list of items on the screen, and search will zoom down the list straight to the item I'm looking for...and then in another app the search might launch a web browser and search the Internet for what I typed in. I haven't really learned a good way to scroll down a long screen: often I have to just flick downwards again and again until I get where I'm going. And probably the most annoying feature is the actual call interface. I haven't taken that final step to voice-activate my favorite call list, so when I manually drill into my contacts or favorites to find someone to call, it seems to require more steps than it should to place a call: find the contact, tap their picture, tap the \"phone\" icon, if they have two numbers associated with them you have to specify which, and then you get to tap \"call\".There have been some complaints about the fact that the camera lacks a flash.  It is a shame that this feature is missing, but apart from that I have to say that the pictures I have taken with the phone have been excellent, better than the first digital camera I purchased years ago and definitely better than the last phone I had, which did have a flash.  The interface for the phone is dirt-simple, and can even lock in standby mode, in case you want to tuck it away for a bit but be ready to shoot with a tap of the unlock button.  The Gallery app in the Android OS does a snappy job of both organizing my groups of pictures and in making it easy to flip through:  clean thumbnails tell me at a glance which collection of pictures I'm looking at so I can select the group I want to view.If you're in the market for a smart phone and you'd like to try the Droid OS, I can't say enough about the Captivate. It's got a brilliant screen, speedy hardware, and runs the OS quite smoothly. Despite its flaws, this is quite an excellent smart phone, whose benefits far outweigh its drawbacks.USEFUL TIP: when connecting to a computer, it's not immediately obvious how to make it work, and a lot of people are having problems. When you connect the cable, the \"Smart Phone (Kies)\" option doesn't appear to work. Instead, you have to choose \"USB (mass storage)\"...which then still doesn't make the phone's files and folders show up in Windows--in Windows 7 it will just tell you a Samsung Captivate has been connected to the computer, but you can't \"see\" it. You have to take one extra step: from the main screen, access the pull-down menu. You will see \"USB Connected\" in the list of notifications. Tap that, and you'll get a prompt to \"Mount\" the phone. The moment you do this, everything works: the phone maps two drives (one for the phone's memory, one for your memory card) and you can access files and folders just as you do on a USB \"thumb\" drive.  This is a little easier to understand in 2.2, but can still be confusing if you don't get the idea that \"connecting\" also requires \"mounting\".", "Date": "September 10, 2010"}, {"Title": "Best device so far. Love it.", "Author": "H. Sachan", "ReviewID": "R1ZBYXRPR8W10Z", "Overall": "4.0", "Content": "Samsung Galaxy S (as Samsung Vibrant for T-Mobile)I have been using Smartphones since  a long time and my last device for HTC HD2 was a great `first impression' phone but the fascination died in couple of months. More on that in my HD2 review. Since that experience I was hesitant to buy a similar device with Android OS but so far this device has everything I want and hasn't disappointed me once.Display: The screen is amazingly clear and crisp. The included movie Avatar does a good job showing off the phone and the screen. No hesitation or flickering or pixilation whatsoever.Quick and very responsive interface. The device boots  up in 30+ seconds but once it's completely up and running  (in 60+ seconds) after starting services like media scanner, it is quick in everything you do. Never experienced any lag.The default buttons on the device bottom (Menu, Home, Back/Return, and Search) are very helpful. Specially in the case where you click on a link from and email and it opens in the browser,  you can always click on the back button to go to the email. This is very useful for someone who is used to Windows devices where its difficult to go back to Email app once you open another app. The Back button works on the device across apps. Very cool.When you are using the phone at night it might be difficult to find those four buttons at the bottom when the back light turns off, but you get used to it and slowly figure out where the buttons will be. Nothing major.Pictures are very clear and crisp. Even when compared to HD2 in low light, these come out so much better.Battery is slightly better than HD2 but pretty much at par when using 3G data or videos. It would need daily charging is you use good amount of 3G.Android marketplace is a plus when compared with Windows Mobile 6.5 devices. But Windows Phone 7 is supposed to change that.It comes with two back cases, not sure why. But would have preferred a leather or rubber case like HD2.The T-Mobile version also comes with 16GB installed and 2GB card.  The MicroUSB <-> USB cable comes with USB adapter charger so you carry only one cable.Some issues or nice to have features:Front camera for video calling would be nice.No Flash light for the camera. So no flash light app as in HD2.It comes with many apps which are either just a link or require you to register or will get you to sign-up for a subscription. So be careful about what you sign up for since some of these will give you  a month free and then unless you call them, they'll keep charging.-- After couple of weeks of usage --Its still a great device so far. Few things worth mentioning:*  Really could use a front facing camera for video calling. The non-US version has one but it was removed for ATT and TMobile in US.*  The camera quality is amazing. Even the various built-in affects like action-shoot, panoramic shots are a great addition where you can shoot a 270 degree pictures and it stitches them all together. I lets you take 8 pictures while guiding you how to move and then creates a wonderful panoramic picture. Amazing.*  Battery life seems much better than that of HTC HD2*  The GPS is flaky. The applications like Four Square don't connect to it well unless you open the Google Navigation first to connect with GPS and then open other apps that use it. Samsung is supposed to come out with an updated software in Sept to fix it. But not a deal breaker.*  Still a great snappy interface.*  Android marketplace has some great free apps, but still not as good as Apple. I'm sure that will change overtime as android marketplace is 'free' as compared to Apple where they take a cut.Overall, I'll still recommend it.", "Date": "August 11, 2010"}, {"Title": "Best smartphone I've owned", "Author": "Adrian Hidalgo D.", "ReviewID": "R2E633WQFDBHEY", "Overall": "5.0", "Content": "I had an iPhone 1g, iPhone 3g and now this phone. I switched from Apple to Android because of the opennes. This phone is much better than the iPhone in many ways and the OS rocks!", "Date": "October 28, 2010"}, {"Title": "so frustrating....", "Author": "leFrenchBunny", "ReviewID": "R1P435D2IZ7P6H", "Overall": "3.0", "Content": "....Your usage bill may go down. I purchased the Samsung Galaxy S from my local T-Mpbile kiosk in the mall. This phone appeared to be the mobile of my dreams. And for a few months it was. I wanted to love this phone forever.Then the romance ended. Crashes began to occur more and more frequently. Everywhere. Web crashes. Freeze ups. App crashes.Even AFTER i did a factory reset which was forced because even the homescreen decided to crash. Small storage as well.I honestly can't wait to trade this thing in and i may just pay out of pocket to upgrade because the thing is driving me nuts.Also it will not work in 3G. It has 4G capability but when i am in EVDO areas loading takes so long that data is almost useless.I reeeeally don't recommend the Galaxy S if you are someone who uses your phone heavily for data. The battery life is very short and you will inevitably experience crashes. I am not the only one, look it up on your search engine once.For text and calls this phone is fine though.", "Date": "March 1, 2012"}, {"Title": "Great all around smartphone", "Author": "Brunex", "ReviewID": "R12D9JID529ZI", "Overall": "5.0", "Content": "Have the Galaxy S for a bit more than 2 weeks now. I upgraded the firmware to 2.2 as soon as I got it. Thats something good about unlocked phones; you get updates faster than the branded ones.After looking over many similar phones I concluded that the Galaxy S was the best choice for a multimedia device. Has a big 4\" display with a superb superamoled screen. Despite the camera lacks a led flash still performs good in poor light conditions; just gotta have a stil hand. Video recording is sharp with nice audio quality. Also records pretty good in dark environments picking up the few light sources despite the lack of a night recording mode.The touchwiz 3.0 interface is not bad at all. At first I thought that the similarity the menu layout has with the iphone would be bad, but then I started to like it. The way it organizes your apps make the scrolling fast and simple. You can also have the option to have then on a long list but I prefer the \"iphone\" look. The homescreen layout is also good. The fact that you can have 3 shortcuts always at the bottom makes my life easier.There is a lot of videos and articles on the net that explains how to root the Galaxy S and apply the lag fix. So far my SGS has been stable. Some other time it takes a bit to load, such as widget list, but then it stabilizes. I dont see the need now to do a lag fix.Build quality made me think 3 times before buying the Galaxy S. If you turn around the phone the whole shiny plastic of the battery door makes the phone look a bit cheap. The front part doesnt have that strong feel thanks to the \"chrome\" rim and the glass screen. Few days ago I got a Clear Protector for the entire back of the phone. It gives a rubber feel much better than the glossy plastic and adds a lot more grip. I dont see the need to apply a screen protector on the screen.Overall I'm very satisfied with the Galaxy S. I love Android. I love even more the SuperAMoled screen. Oh! something else. Most of time I have the screen brightness all the way down. It gives enough light for indoor conditions, even bright indoor places. I put it to auto when Im outdoors.PS. You know who made me look into Android and then the Galaxy S?... About one month ago I got the Nokia N8. Great phone, had some minor issues and at the end it died on me. If you look the reviews of the Dark N8 on amazon you will see my review.", "Date": "November 27, 2010"}, {"Title": "Not a \"Technical\" Review!", "Author": "Bostonmama", "ReviewID": "RVH2AWBVR7Q6B", "Overall": "5.0", "Content": "First, let me say that I held out as long as possible to buy this phone.  A lot of my friends thought it was odd or comical that I had no interest in an android phone, but I figured I used my phone for basics, so why bother? But my contract with T-Mobile was up and I was not happy with the network, so I started looking around.  Found this at Costco and went for it.  In fact, i did not \"buy\" my Galaxy S, it came free with a  two-year contract with AT&T; and they threw in both car and home chargers, carrying case, earphones, etc.  I am NOT someone who ever understands how these techie-things work, so I have been playing with it for the past week and am learning, slowly, what I like and don't like.  LOVE that it is so easy to text on.  My previous, no-frills phone was a huge pain for texting, so I just didn't do it, or I would respond via voice-recording, which some of my friends & family could not access on their phones.  I love the bright, clear screen on this phone.  My GPS works fine, but since I have GPS in my car, I haven't had to use it yet.  Will be handy when I am in a strange city, though, just walking around town.  Am not using it for viewing TV or movies, haven't downloaded music yet.  I do find that the two opposite buttons (one for unlocking phone on one side, one for volume on other) are easy to hit simultaneously, but it's not that big a deal.  Voice clarity is excellent.  With my old phone, calls with other cell-phone users were really muddy, which was frustrating for everyone concerned.  Never had e-mail access on a cell phone before (as I indicated, I was using a very standard phone until now) and I am happy to have access on the go, if I need it.  I will eventually learn to use the cool features, but for now, I am thrilled to have the good stuff I mentioned, especially the crispness and clarity of voice calls.  Makes a world of difference!  What I find a bit annoying, though, is that the touch-screen is so sensitive that it is really easy to swipe out of the screen I want and into another.  I can be texting and if my finger slips, the screen changes.  Not that big a deal, because it's easy to go back, but it has happened a few times.  Camera function takes some getting used to.  You really have to go to the tutorial online to learn how to use it, because I couldn't figure out how to send pics just by looking at the phone.  Other than those minor things, it is a really great phone.  Cannot imagine going back to my old basic after this.", "Date": "February 16, 2011"}, {"Title": "Great Phone but only 8GB Model!!!", "Author": "jla3118", "ReviewID": "R3AG71W6G8I7WH", "Overall": "5.0", "Content": "This is a great phone and highly recommend it. The phone I bought is an 8GB Model and I thought it would be the 16GB one since the 8GB was showing besides this one, but either way it works flawlessly I just can't wait until 2.2 is on this Phone. The Slowdowns happen due to the Touchwiz 3.0 UI and not the Android OS or Phone. Besides that all on the phone is great, Amazing Camera with HD VIdeo and Swype is awesome too. Highly Recommend!", "Date": "August 21, 2010"}, {"Title": "Great phone!", "Author": "Scott H. Lewis", "ReviewID": "R32LE06G0N7XYI", "Overall": "5.0", "Content": "After playing with it for a week, it's hard to find something about this phone that I don't love.  The best part was that I got a phone that retails locally for $800 for $499.99 through Amazon as a 'used' set (the seller said that the box had been opened for a brief demo). Everything was like new. Really happy with a great deal on a fabulous Android phone.", "Date": "January 9, 2011"}, {"Title": "Great after some tweaks", "Author": "EmilioEC", "ReviewID": "RTWI3DW0L2VD5", "Overall": "5.0", "Content": "the phone is great... tho, you have to fix the lag problem with either solution you find online... In my case I used Voodoo lagfix. The installation process isn't complicated, but documentation isn't as clear or complete as you would want.After that, the phone has no problems... really fast, really nice.The downside is the battery life and the GPS.... If you plan to use wifi all the time, you should buy a spare battery beacuse charge wont last the whole day. The incredible screen this phone has consumes A LOT of battery, so be aware of that.GPS just wont work on my phone. I don't know if it is a software issue or a hardware one. I haven't tried to fix it yet since I don't really use GPS that much to make a big deal out of it.One last thing, I brought this phone to Ecuador.. It works fine, but I still haven't been able to connect to internet through 3G... all tho I'm sure it's just a configuration issue.", "Date": "December 27, 2010"}, {"Title": "Samsung I9000 Galaxy S Unlocked GSM Smart Phone with 5 MP Camera, Android OS, Touchscreen, Wi-Fi, GPS and MicroSD Slot--Internat", "Author": "Nordstarx", "ReviewID": "RI9RIWLWWZKGF", "Overall": "5.0", "Content": "For and android phone, i love it. i travel a lot in europe and and usa and i never had a problem so far with it. 3G 4G, hpda, u name it from android market, to phone calls, works fine. the battery holds for about a day 7 to 12 am nonstop on wifi mail, games , calendar phone calls, all together. it runs android 2.2 so far no update for that but they once Samsung will upgrade to 2.3 it will improve battery life. i do love it more then the iphone 3, 4,.", "Date": "May 26, 2011"}, {"Title": "Fantastic product", "Author": "Felipe A. A. Santos \"FelipeAl\"", "ReviewID": "R3L2WB9GUK47H6", "Overall": "5.0", "Content": "Hi fellas,im very satisfy with I9000. Greate product, great design, functionalities, is fast to open app.and the line of learning is very fast (at least for me) i did not saw the manual and already learn a lot about the cellphone.i think there is more and more to learn.if you have Internet on this, you can do somethings really fantastic things in real time.i recommend than Iphone.", "Date": "May 9, 2011"}, {"Title": "Love my new phone!", "Author": "BOOKFreak!", "ReviewID": "R3MAS59WTG6RAR", "Overall": "4.0", "Content": "I love having the internet at my fingertips. This is a great phone with lots of features. I recommend getting the data plan. It uses the phone full capabilities.", "Date": "March 25, 2011"}, {"Title": "Nice!!!", "Author": "George V.", "ReviewID": "RHC7KADY8FGOP", "Overall": "5.0", "Content": "Received just as advertised, no problems besides menus in Greek as soon as I turned it on which took a little while to figure out how to change to English. Otherwise, great phone.", "Date": "February 4, 2011"}, {"Title": "Excellent", "Author": "Carol", "ReviewID": "R3OSLU1YD86EFH", "Overall": "5.0", "Content": "Very good. Product of excellent quality, beautiful, lightweight,  fast processor. Met my expectations, it is easy to use and the picture is great.", "Date": "May 28, 2012"}, {"Title": "Ease of use", "Author": "Miguel P Kurlat", "ReviewID": "R1HJQW0BAF1PFQ", "Overall": "5.0", "Content": "I  got started in 10 seconds flat. Went on to discover features intuitively.fascianted with the product.Clear and large numbers. Synchronized Outlook to Google calendar and updated meetings in the phone like magic.Now I am using Google Calendar with my working group Same for contacts - with some difficulty undestanding access to data on SIM Card. . On the minus: if and when I had to look  for something in the manual, letters are microscopic. I will have to access it one line.", "Date": "May 23, 2011"}, {"Title": "So glad to have android back", "Author": "dimanchedrive", "ReviewID": "R3UNQIED9L0UKA", "Overall": "5.0", "Content": "I just got rid of my HTC HD2, I couldn't take the windows phone anymore. So glad to have an android again. If you like the MyTouch, you will LOVE this phone. So easy to use, so many apps, very user friendly. I would definitely recommend.", "Date": "March 29, 2011"}, {"Title": "Amazing screen, poor WiFi card", "Author": "Cordless4Ever \"Cordless4Ever\"", "ReviewID": "RU1ZJ6ZYZMYNQ", "Overall": "4.0", "Content": "I have European model. Screen is simple amazing it is unlike anything else out there. My main struggle with this phone is very poor WiFi implementation. Phone cannot detect AP few meters apart. No support for 5Ghz n only 2.4Ghz n-WiFi. Audio/Video player has very low volume even at the max setting.Pros:- amazing screen- decent battery life even using video player- video playing looks goodCons:- old iPhone lookalike- poor WiFi reception- poor 'Mobile AP' implementation- poor Power button orientation where accidentally interfere with volume keys- low audio player volumeDecent phone and highly recommended even with few flaws.", "Date": "February 20, 2011"}, {"Title": "Nice screen powerfull processor. froze after a month though", "Author": "ryan minaker", "ReviewID": "R32DLB98OIM0F1", "Overall": "4.0", "Content": "I liked my phone. The screen was bright and crisp. It froze into the black screen of death though after a month and i had have to send it back to bell for an undated version now i guess. Maybe the products they sell now will already be updated already. Other then that i really loved my phone.", "Date": "January 3, 2011"}, {"Title": "Worthy competitor to the iPhone 4", "Author": "A. Domanska \"Coffee Addict\"", "ReviewID": "R1NCL2R5CXJUN8", "Overall": "4.0", "Content": "I bought this phone on a whim, as I had originally walked into my local telephone provider's store with the intent to purchase a completely different phone.The negatives first:* there is no camera flash, so don't bother downloading flashlight apps.* there is no dedicated camera button.* I have had issues with lag and the phone crashing, once to the point where I had to pull the battery out to get the phone to switch off. In my personal experience the lag issues are easily fixed by using Advanced Task Killer or turning the phone on and off.* some options are hard to find and the settings menu can get lost in a sea of apps. This is not a phone for someone that still hasn't got all the features on their current phone \"figured out\" and isn't tech savvy.The positives:* good battery life if one switches off GPS, background syncing etc when not using those features. I have once used my phone all day from 4am till 10pm starting at 87% battery and had it pull through without needing a charge.* the AMOLED screen is impressively large and absolutely gorgeous. Make sure you get a case that includes a screen protector. Good screen response.* the \"Swype\" feature that is included as standard is easy and fast to use and intuitive enough to cause few embarassing \"auto correct\" errors. Definitely easier than typing on an onscreen keyboard.* every app I have downloaded works without issue.* interface is gorgeous and nice to use.* files/music etc are easy to move to the phone, just drag and drop as your computer will recognise it as an external hard drive.Overall I'm happy with my purchase and would recommend this phone to anyone considering a high end phone. I would personally recommend this over an iPhone.", "Date": "December 31, 2010"}, {"Title": "Samsung Galaxy S", "Author": "lulu", "ReviewID": "RRH6EIQM7E8DT", "Overall": "1.0", "Content": "All apps  on the phone only work when the phone is connected to wifi and this was not mentioned in the description.Keep blacking out and going off on its own and I have to take out the battery and restart .It is quite frustrating as it is of little use to me outside the house.", "Date": "April 30, 2014"}, {"Title": "no head phones", "Author": "MICHELL FRASER", "ReviewID": "RVGU0M7U4A0TL", "Overall": "5.0", "Content": "Someone asked me to order four for his fsmily. was told it works very well. one problem is it did not come with headphones.", "Date": "April 25, 2014"}, {"Title": "Not american", "Author": "Richard A. Williams", "ReviewID": "R2BGIT8FPW6PAW", "Overall": "2.0", "Content": "got up one morning wanted to make a call every thing was in Korean. then it would not recognize the sd cart", "Date": "December 28, 2013"}, {"Title": "please do not buy", "Author": "Yomi A.", "ReviewID": "R37ZM6IR7RZCX2", "Overall": "1.0", "Content": "Absolutely an horrific purchase. Was bought as a gift for a friend. When she opened it, found out it was written in either korean or chinese, updates can not be done.. shuts down frequently installing applications defaults to asian apps. I had to return it, what a nightmare", "Date": "October 2, 2013"}, {"Title": "excellent service", "Author": "Armando Flores Sr.", "ReviewID": "R3NWEGJALJDHUC", "Overall": "5.0", "Content": "excellent service that big apple cellular offers, even though i returned cellphone because it was not factory unlocked,they offer full refound plus some free kit", "Date": "April 7, 2013"}, {"Title": "janetsi venezuela", "Author": "Janetsi Ramon Cordero \"Janetsi\"", "ReviewID": "R199CE9KT9SOE9", "Overall": "4.0", "Content": "este producto esta bien en la condiciones esperadas, entrega por el vendedor a tiempo, sin ningún problema segun lo requerido gracias, lo recomiendo.", "Date": "February 18, 2013"}, {"Title": "i LOVE IT", "Author": "Humberto Oliviero", "ReviewID": "R1E2ZCOQ2UATV1", "Overall": "5.0", "Content": "IS EXCELENT, WORKS VERY FINE, THE WIFI WORKS PERFECT, IS VERY QUICK, EASY TO MANAGE, IS SHIPPER AND POWERFULL A", "Date": "January 7, 2013"}, {"Title": "Love it", "Author": "RAYKARD M TEDTAOTAO", "ReviewID": "R21Z31ZYB7FLYB", "Overall": "4.0", "Content": "I like it for what I need not to complicate just right for me. I have no problem with it.", "Date": "December 21, 2012"}, {"Title": "Great Android Device", "Author": "buddy", "ReviewID": "R18FQW3BUVLPIL", "Overall": "5.0", "Content": "This device is perfect in that it can still keep up with most of the apps today. However, when playing super high def games, it will lag, this device is great. The size is perfect for holding in my hands. The screen is absolutely stunning. The display is bright, colors are displayed very vibrantly and the screen is just a Samsung wonder. However, the problem I have with this product is that it doesn't have the best internet out there. THe internet is pretty slow compared to modern phones (one network). Other than that, wifi. It is really a SMART phone.", "Date": "October 15, 2012"}, {"Title": "Works great with Android 4.0.4", "Author": "Itzik", "ReviewID": "R1MIYEX0XO5JSX", "Overall": "4.0", "Content": "Got it with 2.2 and upgrade to 4.0.4 - works very fast and is stable. I knew this phone before and for its price (~290$) looks a good deal", "Date": "September 24, 2012"}, {"Title": "Do not meet my expectations", "Author": "Horst", "ReviewID": "R2L7QPVMNI2TYB", "Overall": "1.0", "Content": "Item for Asia, not usefull for Venezuela.Supposed to be unlocked, but not fot the frecuency I bought it for.", "Date": "September 9, 2012"}, {"Title": "Awesome Samsung S series", "Author": "yabed", "ReviewID": "R2SF4QW01K8HYO", "Overall": "5.0", "Content": "Bought my first one when it came out and am totally hooked on S series and want another one. Shipment was fast and I could not be happier. Thank you!!", "Date": "August 11, 2012"}, {"Title": "Very Fustrating", "Author": "David L. Jones", "ReviewID": "RP8BQBZGR4MAN", "Overall": "3.0", "Content": "I just bought this phone and it is nice but it is beyond frustrating. I use my cell as an alarm and i can use full songs as the alarm and rington but it deleted all the songs from my memory card and now none of the 4 cards including the one that came with the phone,work. they are undetected and \"Forbidden\" now.  other than not being able to listen to my music or use my phone the way i have been doing for years it's great", "Date": "February 16, 2011"}, {"Title": "good service", "Author": "Liober Curiel", "ReviewID": "R1OM8ZP5IXLGP6", "Overall": "5.0", "Content": "good service!!!!, it came fast and no show any problems,the phone brought all the accesories, I really liked!!!!.take good pictures.", "Date": "June 4, 2012"}, {"Title": "Samsung i9000 galaxy S", "Author": "Suman Kumar Bhagat", "ReviewID": "R1RPDRXGXBUQIA", "Overall": "4.0", "Content": "I recently bought Sansung I9000 galaxy S phone and I would say it is one of the best Andriod Phone.Here are some of the positive points of the phone:The display of the phone is really bright and clear.The phone has not hung as of now,so I would say it is quite fast phone.The feature,especialy at the wall page has been sufficiently designed for you not to go that appl to work on.There is one little negative I found,The battery backup is not too long.I mean it just last for just above 1 day when you talk about 6-7 hours a day.So guys, overall I am satisfied by the phone...and will definetily re-commend this phone based on really cool features of the phone.Thanks,Suman", "Date": "May 24, 2012"}, {"Title": "Not working with 64 bit OS", "Author": "Jagdish", "ReviewID": "R1NTPQGSHI4DE8", "Overall": "3.0", "Content": "I purchase the unlocked phone this week. The phone is excellent with all great features. Very light and sleek and extremely fast when i compare with my iPhone.I tried to copy some music files from Window -7 64 bit machine using the USB cable provided by Samsung. The computer does not recognize the device. I then tried Window 7 - 32  machine. The devices still could not be recognized.The device does sync with Window XP machine. I called Samsung Customer support. They confirmed that Samsung Android phones do not support 64 bit computer syncing.This may be a big issue if you do not have a 32 bit computer at home", "Date": "December 13, 2011"}, {"Title": "bad product", "Author": "Kaiser A. DA SILVA", "ReviewID": "R13JLR5919Z583", "Overall": "1.0", "Content": "bad product doesnt work well.alson to unlock phones in the us is a crime.no worranty, from the manufactore.", "Date": "March 18, 2013"}, {"Title": "Good phone", "Author": "mrmm", "ReviewID": "RUKVV608AMHNZ", "Overall": "4.0", "Content": "I bought this phone for my wife and it has a very intuitive GUI. The navigation is transitions are very nice. It is a good phone but it does not work find with Family Mobile by T-Mobile.", "Date": "December 3, 2011"}, {"Title": "Usefull and fun", "Author": "Oldwhale", "ReviewID": "R28H0YCDS73WAL", "Overall": "5.0", "Content": "The phone works beatifully. The camera is excellent and the videos in HD are superb .Great conectivity with internet.I have been using it for a month and there are still many function I havent use because it has so many.", "Date": "September 15, 2011"}, {"Title": "Lack one important feature: FM radio (not Internet FM radio)", "Author": "Chiang Y. Lee \"chiang lee\"", "ReviewID": "R2F3CFX344A3HT", "Overall": "3.0", "Content": "We were at Bahamas for seven days before Christmas carrying with us are Samsung Galaxy S and HTC Aria smartphones. Since we just renewed our contract, both Galaxy and Aria were locked. Avoiding the roaming fee so we took the SIM cards out of the phones when we arrived at Bahamas.The plan was to buy the SIM cards from Bahamas mobile phone company and used in our phones. Too bad that the phone company store was in downtoun of Nassau and we stayed in Paradise island. $15 for the SIM card and talk time was additional cost. It was too much hassle for using cell phone (for foreigners)and ended up stayed together (5 of us) instead of going different ways using cell phone to contact each other.NO way I could use the FM radio with Samsung Galaxy S since  SIM card and data plan (more expensive in Bahamas I guess) were needed.But to my surprise the HTC FM radio worked without SIM card!!! Actually the HTC Aria is a FM 'radio' by itself!!! And this a good feature when traveling to foreign countries. HTC Aria can use all the internet radio applications as Galaxy S does ( I use TuneIn Radio from the free download of Market in Android phone.) My original intention for choosing Galaxy S is that it has 1GHz CPU vs. 600MHz CPU of HTC Aria. And I thought this should be faster than HTC Aria. But when we were back to US driving from Ft. Lauderdale to Orlando, the navigation of Galaxy (using Google Navigation) is not faster than the HTC Aria acquiring the GPS signals. I guess it depends on the strength of available GPS signals.If I had a choice again, I definitely will choose HTC Aria!!!", "Date": "December 29, 2010"}, {"Title": "unlocked phone really locked", "Author": "Gene Kruger", "ReviewID": "R2SOBWS7DTZ88B", "Overall": "3.0", "Content": "I bought the unlocked version, it arrived with T-Mobile branding and locked-up after 3 weeks...after a lot of searching online I've discovered that this is an ongoing problem with supposedly factory unlocked Samsung Galaxy phones. My only option is to return it...pretty shoddy and very inconvienient after spending all  the $$$$", "Date": "January 2, 2011"}, {"Title": "Burn In", "Author": "scottpast", "ReviewID": "R3ILVXB2VHPZWD", "Overall": "3.0", "Content": "Does anyone else have a problem with Screen Burn-In?  Seems mine burns everything, Security setting buttons, and any addons. Movies have points, and text all over them.  any Ideas or help would be REALLY nice.Otherwise...SMOKES crappy Apple stuff, great Phone. Would HIGHLY recommend other than the Burn In...", "Date": "November 30, 2010"}, {"Title": "Most unstable hardware EVER! Crash and SD corrupt easily.", "Author": "Viet Le", "ReviewID": "R2ZO6DDBJ0000H", "Overall": "1.0", "Content": "I have the GT-I9000M Vibrant from Bell Canada. While running eclar 2.1, the phone would randomly shut down 3-5 times a day.When I upgrade my phone, 3 weeks later, it completely crashed as I was check my email. Tried to restart the phone, I can't even get to the flashing S logo. All I see is Samsung Galaxy S GT-I9000M, shuts off, and loads the same screen again, and shuts down, etc, over and over.The internal SD card gets corrupted VERY easily.", "Date": "December 17, 2010"}, {"Title": "Freedom Now!", "Author": "Andrei", "ReviewID": "RU51VAAT5TMIA", "Overall": "5.0", "Content": "enjoy the power of freedom with android in this super light-weight and fast phone by default. No limitations you faced on iOS4 with ever the growing android market. superb colour and contrast amoled screen from samsung. one thing to note battery's life is dependent on apps usage but can be bought and changed at will. with up to 32G of extra space on top of it's 16g.enjoy the freedom now...", "Date": "July 6, 2010"}, {"Title": "shameful lack of QA in samsung!!!", "Author": "pachanga72", "ReviewID": "R128AWFT3ELJTI", "Overall": "1.0", "Content": "This phone has severe lag issues when you try to open apps and telephone screen. and it is not only mine. Go on youtube or google and search for lag issue galaxy s. It seems that Samsung just rushed it to the market. I am very disappointed. They say in sept an upgrade to android 2.2. will fix the problem but there is no excuse to launch such a faulty device (supposedly their flagship phone!!!)", "Date": "August 20, 2010"}, {"Title": "Not satisfied!", "Author": "Ricardo Medeiros", "ReviewID": "RUVNGFARO6N96", "Overall": "1.0", "Content": "I'm not satisfied with the purchase. I bought a Samsung Smartphone and the Amazon sent it with a fake note to my country. The fiscal authorities realized the illicit condut from amazon.com and aprehended the product in the customs. I was fined by the customs and LOST my product.I will sue amazon.com for the damages and to get a settlement.", "Date": "October 7, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Network: HSUPA 900/1900/2100, EDGE/GPRS 850/900/1800/1900. Samsung Android 2.1 (Eclair). Android Samsung UI (Multiple Homescreens). Processor: 1GHz CPU Speed. Dimension: 64.2 X 122.4 X 9.9 mm (119g)\nMemory: MicroSD(Up to 32GB). Android Browser: Flash Lite3.1. Display: 4.0? WVGA(480x800) 16M SUPER AMOLED, mDNIe(Mobile Digital Natural Image engine). Multi-touch zoom. Light sensor, Accelerometer sensor, Proximity Sensor, Digital Compass.\nCamera: 5.0 Megapixel AF camera, Self Shot, Action Shot, Add me, Cartoon Shot, Smile Shot. Video: HD Video Player & Recorder (1280 x 720) @ 30fps codec: DivX, XviD, MPEG4, H.263, H.264, WMV, VC-1 format: 3gp(mp4), AVI(divx), MKV, FLV, H.263Sorenson\nMusic: Music Player with SoundAlive. 3.5mm Ear Jack. MP3/AAC/AAC+/eAAC+/OGG/WMA/AMR-NB/AMR-WB/WAV/MID/AC3/IMY/FLAC/XMF\nBattery (Standard) Li-pol, 1,500mAh, Talk time : 2G/769 minutes, 3G/391 minutes, Standby : 2G/750 hours, 3G/625 hours", "Name": "Samsung I9000 Galaxy S Unlocked GSM Smart Phone with 5 MP Camera, Android OS, Touchscreen, Wi-Fi, GPS and MicroSD Slot - Unlocked Phone - No Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41hnuO41ZRL._SY300_.jpg", "ProductID": "B003U2T57E"}}