{"Reviews": [{"Title": "palm treo", "Author": "matt", "ReviewID": "RKR95UCCKMBI9", "Overall": "2.0", "Content": "hey the phone I got was a verison wireless palm treo 700. The phone works but it's got no charger.  I orderd a sprint phone and didn't get it I need 2 find out how 2 send it back and geta different product but for this being my first buy I may not come back. Well see.", "Date": "February 26, 2011"}, {"Title": "Not Mint", "Author": "Silverado", "ReviewID": "R33LGGDFKX2WDJ", "Overall": "1.0", "Content": "Was not satisfied with the product due to the mis-representation of it's quality.  It wasn't in mint condition nor was there a new housing as indicated in it's description. A true description would have been more accepting even for the price.", "Date": "August 30, 2010"}, {"Title": "terrible seller", "Author": "bbwrgv", "ReviewID": "RZWU0BT2ZWLAH", "Overall": "1.0", "Content": "phone was not usable, DID NOT WORK, was finally able to contact seller; received a replacement but came without a battery or charger.  how did they expect me to use the darn phone?  will never purchase from them again.  finally had to go through amazon customer service to receive a refund.", "Date": "November 20, 2010"}, {"Title": "Palm Treo", "Author": "Mr. Flip", "ReviewID": "R2BXN6RUHJM77L", "Overall": "5.0", "Content": "A great (better) substitute for the Blackberry. Good quality phone that has given me no problems. A little dated now that android has taken over the market, but overall a good phone.", "Date": "November 3, 2012"}, {"Title": "Purchasing Manager", "Author": "billatncppb", "ReviewID": "RUR7F3O8AL0TD", "Overall": "4.0", "Content": "I owned a Palm Treo Phone for over 3 years, and it died recently.  Got a new phone from Sprint, however, was not the quality and features that my old Palm did. Although this phone is no longer in production, I was able to get an updated Palm Treo from Amazon, and am very happy with it. Although the newer phone has different features, which I am still getting used to, I am very satisfied with it....", "Date": "March 14, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003VC56V2"}}