{"Reviews": [{"Title": "Excellent music phone!", "Author": null, "ReviewID": "R2EXPPXU0Y44UZ", "Overall": "5.0", "Content": "This phone is an excellent choice for those who want a Music Phone. The Micro-SD slot can be expanded to 16GB and the sound quality is superb. On the left side of the screen it has dedicated music controls making controlling your tunes a breeze, you can leave you MP3 at home after you buy this phone. The phone itself is good too, sound quality is clear and the buttons are big, it also provides good feedback so you know what you have pressed. Like other Nokias battery life is strong, usually a full charge last 4 to 5 days with moderate talk time. The phone is really compact and light, sometimes I forget if it's in my pocket and have to pat it just to make sure I have it with me =)The downside is the camera, it's practically useless in low light situations. Even in moderate light there are still lots of image noise, you can get away with it a little bit by it being 3.2 Megapixels thus always giving you high resolution but at 3.2 it takes quite a few seconds for it to process the picture. Also since it's not a 3G phone, using EDGE for web browsing is a bit on the sluggish side.The bottom line is if you want a stylish, light, practically phone with good battery life and music capabilities then you can't go wrong with this Nokia. If you want something more powerful with full 3G then shop for something else.To clear thing up only two large US wireless companies uses GSM: AT&T; Wireless and T-Mobile so this phone will only work with them. Overseas GSM is the dominate technology so you can easily use this phone outside the US.", "Date": "May 20, 2010"}, {"Title": "Excelent unlocked phone for the basics.", "Author": "Wooo \"Caffene/Whiskey junkie\"", "ReviewID": "R3V9NBVFEW0LSB", "Overall": "4.0", "Content": "For those who don't want to renew your contract, this is a wonderful unlocked GSM phone with quite a lot of feature at a very reasonable price.Before I get started, there is one point to keep in mind.  This is an unlocked phone.  There is some configuring that has to be done in order to get internet and MMS working with your provider.  Nokia used to have a site that would send carrier specific info to the phone, but I believe they have taken it down.  You may have to search forums and/or call your carrier customer support for this one.  Call and SMS will work \"out of box\", but anything internet dependent will require some fiddling.On to the review.I have found for a $140 phone, this pretty much does everything I'd want a basic cell phone to do, almost to the point where I don't really care about have a higher end smart phone.Call quality is great and I have found that the Series 40 UI far easier to use than most of the carrier locked phones we have in the UI.  If you're using an ATT or TMO Nokia phone, you are not experiencing the full potential that Nokia has to offer.Nokia's email client is great for basic email checking and even without 3G data capabilities, I found EDGE data speeds more than sufficient.  With T9 predictive entry, even sending basic reply messages is relatively quick.The media player keys are a handy touch, and the FM radio is also a nice additional feature.  Overall, I found Nokia's generic media player much more pleasant than that of most other low end phones.Onto some cons...I have accidentally hung up on some calls as the screen tends to stick to my face and if I keep moving my hand, I will eventually slide the phone far enough to cause the call to end.There is no feature to auto-lock the keys when the slider is closed.  You either have to select the \"Lock\" option immediately after closing the slide or enable the auto keyguard feature to lock after a set amount of time.  This is kind of a vestige of Nokia's candy bar only phone days.No Nokia Maps.  Even though this phone has no GPS, it's nice to still look up maps when you're in a bind.  I've used several other S40 phones with this feature(with and without GPS) and although it's no Google Maps or Nokia Navigation, for such an inexpensive phone, it's good enough.Overall, for the price, you will get a lot.  If you're looking for a basic unlocked phone sans contract, this is the phone for you.  You may even be pleasantly surprised.", "Date": "June 14, 2010"}, {"Title": "Awesome Nokia Phone", "Author": "Promise Jones \"Promise Jones\"", "ReviewID": "RHHV0KMS4XF3X", "Overall": "5.0", "Content": "This phone is amazing. I have had this phone for about a month and it is all that I hoped it would be. I go to the gym daily and it was cumbersome taking my mp3 player and my cell phone to work out. Now, with his Nokia, I just grab it and go. I have my phone and an MP3 player all in one. I love it.", "Date": "April 2, 2010"}, {"Title": "Nice looking phone but seriously lacking build quality", "Author": "Peter Landy \"treeclaw\"", "ReviewID": "R29FSN08USBBFL", "Overall": "2.0", "Content": "Got this phone today.  Right out of the box it appeared impressive, pleasing to eye and touch.  Tried to get the back cover off according to the manual's instructions but it was no go.  Finally I got my jeweler's screw driver out to try prying around the edges.  Fortunately without damage, I've discovered what the manual omitted from their instructions.  You have to pry up, gently, the lower back case with a blade or tiny screw driver before pushing down and sliding it out.  The bottom part of the cover has two prong like tabs which will prevent you from sliding it until you pry it up first.  Having survived this part of the struggle then I proceeded to install the simm card and battery.  Looking at the manual again I tried to flip up the simm door and it just fell out.  It appears the simm door was already damaged and was just pressed in there hoping to pass for the sale.  So I never got past this part and requested a return RMA label from Amazon.  The simm door and back cover  definitely could use a more robust design.  In my humble opinion, while this phone offers lots of pleasing features, Nokia dropped the ball.It's going to be returned via UPS tomorrow for full refund.", "Date": "October 8, 2010"}, {"Title": "Great phone", "Author": "Shyam Santhanam \"shyamsanthanam\"", "ReviewID": "R2SFPW6YV8HQHM", "Overall": "4.0", "Content": "This is the first unlocked phone that I've bought off Amazon, and I'm very pleased. I bought this phone to replace a damaged \"smart phone\". I decided I'm too careless to carry a smart phone, so a dumb phone would have to do... and this is one of the best dumb phones out there IMO.Pros:- Very polished and intuitive UI, Nokia at its best- Customizable home screen is a plus- Great music player, very good sound quality, good controls- Nice to have OVI apps- CheapCons:- Stock headphones are really weak (or I'm getting deaf! :))- Screen plastic feels cheap and gets scratched easily (definitely needs a cover)- Overall doesn't feel all that durable, expected more- No 3G, but that's what keeps the price low", "Date": "July 26, 2010"}, {"Title": "Nokia x3", "Author": "Dmitriy", "ReviewID": "R6AAIVVACDUKS", "Overall": "1.0", "Content": "This is a very good phone in terms of functionality it offers. The call quality is good and it has a very good music player and even radio. It has a good price for what it offers. I liked the phone so much that after getting one for me, I got one for my wife. However, my phone simply died in a week. Turned off on its own and never came back. It was the flashing white screen problem, which I discovered to be a common problem for some nokia phones by searching online. I got a replacement from Amazon and they handled everything greatly as always. Now my wife's phone is having problems with sound. I cannot hear when someone calls me but they can hear me. It does not happen all the time but started to happen often. I am sending this phone back but for a refund this time. Hopefully, my replacement phone will work but I am a bit concerned now.Update.My replacement phone is going back. It has \"hearing\" problems sometimes. I cannot hear when I place a call or receive a call. It happens often and I am not about to play the game. 3 phone of the model are having problems and for me it is enough to look somewhere else.", "Date": "November 22, 2010"}, {"Title": "Phone for India", "Author": "Jimy", "ReviewID": "R396QEI71BW3CX", "Overall": "5.0", "Content": "I purchased this phone to use while traveling to India.  I didn't need Data, email etc, since I have my Blackberry with International Data turned on for that.I bought the phone to avoid high roaming costs that US Cell providers charge.  Purchased a SIM while I was over there, and this was a very inexpensive way for me to keep in touch with people back in the US.  The phone works great. Very clear audio.  I allowed my 70 yr old grandma to talk to my parents back home, and she had no difficulty in hearing my parents.", "Date": "December 20, 2010"}, {"Title": "it's just OK", "Author": "Adam Sorenson \"Adam\"", "ReviewID": "R2WO4MDWC5NX43", "Overall": "3.0", "Content": "I bought this phone based on the reviews of others. My primary attractions to the phone were cost, size/ weight, it is unlocked, and ability to serve as an MP3 player. The phone is OK. My frustrations with it are as follows:Opening the battery case is difficult enough to do, but the fact that the sliding front keeps opening and closing during the process makes it even more difficult.I am a frequent international traveler and consequently need to swap out SIM cards frequently when I arrive in a new country. It's not easy to open the battery case or the SIM compartment. It's not impossible, but it should be easier.When playing music, the phone has a \"ghost skip\" every 10 seconds or so. By this I mean it cuts out for a fraction of a second. Consistently. It is distracting.The operational software is antiquated. It's not super easy to navigate to media player, for example. And because I'm loading songs from a mini-SD card, it has to load the songs EVERY time the phone turns on - takes a while with 1200 songs. Then navigating between and among songs (with this many songs) is difficult.It is almost 2011. Surely companies could have solved these shortcomings by now.", "Date": "December 6, 2010"}, {"Title": "A Nice Phone", "Author": "J. Thompson \"the plumber\"", "ReviewID": "RNIZETX9E509B", "Overall": "4.0", "Content": "I'm really happy with the phone. Top of the line it is not, but if you want a phone with a pretty decent music player and FM radio then it lives up to the bill. It also comes with a nice set of ear buds. My only complaint is the shoddy call quality that occurs every once in a while. Overall the phone is worth the price and I do recommend it for purchase if you're not looking for the next I-Phone.", "Date": "June 8, 2010"}, {"Title": "Simply Superb", "Author": "Vikram Koganti \"Vik\"", "ReviewID": "R124DC9JDBUDIT", "Overall": "5.0", "Content": "My Wife used to own the LG Vu phone by signing up for the 2 year contract with one of the wireless services .. and she lost it recently.From that day I have searched a lot for buying one for her and finally ended up buying this product ... as though there are not much reviews to really base on, I liked it very much in the first look.I gave her a surprise by the time she is up from her bed with a working sim card in it... she looked it for a minute and finally said 'WOW'. And thats all I wanted when I am searching for the phone.Not just that .. it has lot of cool features and as usual the NOKIA's best battery life ... color combinations.. sound clarity while speaking and while listening to songs or videos.Finally it worked out to be one of the cool gifts that I presented my wife!Cheers- Vik", "Date": "May 25, 2010"}, {"Title": "Nice Phone", "Author": "Bruce C. Richardson", "ReviewID": "R3RB132BJ4TFD0", "Overall": "4.0", "Content": "I bought the X3 over a month ago; it has worked very well since arriving.As I am a long-standing Nokia phone user, I found the controls and navigation straightforward and convenient.  I am a little disappointed that I cannot (yet?) toggle on and off predictive text without using menus. So far, I'm happy with the texting and e-mail functions nonetheless.It required two different calls to AT&T; to get the phone set up to do MMSs and the Internet. Once I found the \"right\" service person, she set me up in just a few minutes -- note that they did all the work: downloading the connections necessary for using the AT&T; network and I did not need to configure anything on the phone.  I was warned that the phone wasn't 3G capable, but AT&T; assures me it is a \"smart phone\" and all my access to the Internet has been acceptable (it isn't WI-FI, but it works well).The music on the phone sounds good; the camera is nice and it is a reliable (strong connections) phone.  This is what I wanted and this is what I received.  The size of the phone is small and therefore easy to slide into a pocket, but not too small to use.  The screen is large and very clear except in extremely bright sunshine.I am very happy with this phone.", "Date": "January 2, 2011"}, {"Title": "Terrible Phone!", "Author": "Alexis Grace \"GR\"", "ReviewID": "R1HL6WKD1Q0JZZ", "Overall": "1.0", "Content": "I have always been a fan of Nokia, which means all my phones have been the same brand.  I recently lost my phone and instead of going to my local provider, decided to purchase one on line. This particular one was not expensive and although the reviews were mixed, I decided to take a chance. Was I in for a surprise!  First of all, the keyboard is just terrible.  It is made from some shinny metal/material which prevents you from dialing any type of number if you are in the sun and secondly you cannot read the keyboard to send any text messages unless you sit in shaded area.  So much for that.  Oh, lets not forget that you cannot use it at nights.  That was just funny.  I am however not laughing!I have had mine for a about two (2) months and the battery was just bad.  If it was charged in the morning by mid-day it needed charging again and I am not a great talker.  I only use it for the necessaries.The one good thing I can say about it, is the music it provides.  It allows you to scan and save a lot of radio stations and the sound is rather clear and it gives the impression that a stereo is playing.If I could reclaim my money that I use to purchase this phone I would.  It is absolute junk!", "Date": "June 8, 2011"}, {"Title": "White Screen after two months on my Nokia X3 Slider GSM Quad-Band Unlocked Cell Phone", "Author": "ARamCOwnk", "ReviewID": "R37HHZ9JCV0L51", "Overall": "1.0", "Content": "This is the second amendment of my review. After checking other reviews and talking to Nokia service people, I come to the conclusion that it is not the battery that went dead , it is the phone that went dead. What happens was the phone cannot be turned on, so I start charging it, when I first charge it, the screen became white and showed a charging icon, few minutes later it says the battery is charged, and advice me to disconnect, but as soon as I disconnect, the screen is off, in fact the phone is DEAD. So I am sending it back to Nokia for repair.My first review of the this product goes like this: \"Nice little phone with many features, but the most important function--the earpiece was defective, not working when first arrived. I can only communicate through the earphone via AV connector, spent $3US in China to have it replaced.It is an OK product if all you want is a simple phone that will play mp3, take some photos and do some organization. At $119 it is still over priced. I will give it four stars if it is price at about $75.\"After I submitted the above review when I came back from my oversea trip a week ago, the battery decided to drop dead.So I am resubmitting this review and give the Nokia X3 a big fat ZERO and would like to warn you whoever out there thinking of buying this product not to do so, unless you really want to get yourself aggravated and frustrated. As for myself, I will NEVER BUY any NOKIA product again, even if it is the cheapest in the market, simply not worth it.", "Date": "May 25, 2011"}, {"Title": "junk!", "Author": "Sophie Fondouop \"Sophie\"", "ReviewID": "RJOGH96DE2K3T", "Overall": "1.0", "Content": "Initially I was very happy with this phone but it turned out to be a nightmare... I've had it for a month and it blacked out/froze at the 3rd week but after I turned it off and on it went back on but 3 days ago, the screen went blank and I am screwed... Junk.THe infamous white screen... I should have read the negative reviews.... Very disappointed!", "Date": "May 3, 2011"}, {"Title": "Excellent entry level phone", "Author": "Mohammed K. Hassan", "ReviewID": "R1GXPF9Q4QYZKP", "Overall": "5.0", "Content": "The Nokia X3 slider is a great entry level phone. It is already unlocked so it can be used with ANY GSM service provider in the USA as well as in other countries. I actually bought two of these!Can listen to FM radio without headphone plugged in.Takes decent pictures.", "Date": "May 3, 2011"}, {"Title": "Fone has powering off issues.... Dont Buy", "Author": "yungjeezy", "ReviewID": "RHQF15RFCYRHK", "Overall": "2.0", "Content": "bought it for my mom, nice speakers, its unlocked, ok features........ but it powers off frequently for no reason and the camera is just awful.", "Date": "April 13, 2011"}, {"Title": "Switches off without any reason abruptly", "Author": "Pen", "ReviewID": "R19Z5LDPX6LR3O", "Overall": "2.0", "Content": "The phone is beautiful compared to what is available in the market and has good features at its price range. However, what use are the features if the phone switches off randomly. I tried to use it for 15 days and saw the phone swtching off almost 5 times, that's close to every 3 days. The battery was fully charged, the firmware was up-to-date. It's very annoying and unforgivable when you are expecting an important call.", "Date": "March 4, 2011"}, {"Title": "Great phone", "Author": "Tonya D. Hay \"antia\"", "ReviewID": "R1CH4QZI22K1LC", "Overall": "5.0", "Content": "I bought this phone for my 17 y/o son and he loves it. It is very stylish and was easy to get started. I had read previous reviews so knew how to get the back off easily and so far have had no major problems. He carries it in his pocket and did have a problem at first with it suddenly playing music depending on his movement (which could cause some problems in school) but that was easily fixed by locking it when not in use. I also recieved it quickly and with everything mentioned.", "Date": "March 1, 2011"}, {"Title": "Ipod-Phone-Camera All In One!", "Author": "Mr Rob The Diver", "ReviewID": "R1CICUP3PXWQB3", "Overall": "5.0", "Content": "I bought this phone for my son for Christmas and after opening and charging it up, I can't get it out of his hands! He used to carry his Ipod and his phone and looked like a really bad circus performer juggling the two. Now he has it all in one device and is a happy 14 year old! He loves it! The only complaint he has had is that the texting keyboard isn't like his blackberry.", "Date": "December 26, 2010"}, {"Title": "This is a nice phone!", "Author": "SAK \"Psalm 119:89\"", "ReviewID": "R2JI0QHFQQ45HG", "Overall": "5.0", "Content": "I received this phone in August 2010 and the phone is still working well.  I have dropped it several times and nothing has broken on it yet.  It is fairly easy to use, has an awesome Mp3 music player, and has excellent clarity in phone conversations. If there are negatives, it would be the the occasional times where my phone's FM radio or Mp3 player will turn on in my pocket because I accidentally hit the media player buttons that are raised up on the phone.  It is easy to fix though through muting the media player.  If you want a great phone that plays music and has great phone clarity, this is a great phone to get.", "Date": "November 25, 2010"}, {"Title": "Very pleased with that phone", "Author": "NOKIA lover", "ReviewID": "R11R7LTTXS3V7E", "Overall": "5.0", "Content": "I bought that phone for a no-contract plan with T-mobile.As always with NOKIA the software is always simple . Door was not hard to open as someone claimed in his review. It is a nice phone with MP3 very easy to download music to.the phone look so nice also", "Date": "October 8, 2010"}, {"Title": "Cell Phone", "Author": "Tweedles", "ReviewID": "R3O9LWU8JO5A6U", "Overall": "4.0", "Content": "I love this phone. I just needed a cell phone without all the bells and whistles that phones seem to come with these days.This is a fairly simple phone...it does have music and a camera. I am very  happy with it.", "Date": "September 22, 2010"}, {"Title": "nokia hits the mark", "Author": "Frank K. Comfort", "ReviewID": "R2GRG575PPYJVP", "Overall": "5.0", "Content": "I ordered this phone for my wife as a temporary replacement of her older and ailing Nokia phone. There was no problem swapping out SIM cards and reconfiguring the new phone for use. My wife loves the radio feature and beautiful graphics. In no time, I found out that my wife did not want this to be a \"temporary\" phone and I'm really pleased to be able to avoid buying another phone in the immediate future. I'm tempted to buy another one for myself.", "Date": "September 21, 2010"}, {"Title": "Never Again Nokia!!", "Author": "azam", "ReviewID": "R1YK8IQVPF38T5", "Overall": "1.0", "Content": "I bought this phone for my mom in August 2010 and it stopped powering on in January 2011. I sent in the phone for repair (shipping out of pocket) and my mom was without a phone for a week and half. We received the same phone repaired, but now the volume down key doesn't work! My initial thought is the technician didn't do a good job putting the phone back together.I called Nokia again and naturally didn't want to pay for shipping to send it back or be without the phone again. I offered up my credit card number for a loaner phone and was told they couldn't offer that concession. I escalated the call and was told it would take up to 48 BUSINESS hours for a representative to call me. They called me three days later and asked me if I updated the software (it's not a smart phone!!) and powered it on and off. They told me the same thing the original rep told me. This phone is going in the trash. No wonder Nokia is so far behind the pack in terms of cell phones!", "Date": "February 15, 2011"}, {"Title": "Dissapointing phone from Nokia", "Author": "Syed F. Jalal \"Farrukh\"", "ReviewID": "R3BP1WW8BB2C7O", "Overall": "1.0", "Content": "I purchased this phone from Amazon a few weeks ago, and the phone keys stopped working within 2 weeks. I am returning this phone, and dont think I will try it again.", "Date": "August 30, 2010"}, {"Title": "100%", "Author": "jfcuellar", "ReviewID": "RH0F30YMSUHVC", "Overall": "5.0", "Content": "there is no problem to buy in this site. On time, tha's what I expected. Recomended site.  Satsfied!  You can buy.", "Date": "February 27, 2014"}, {"Title": "Not intuitive design", "Author": "Pi3142", "ReviewID": "R2IGIQIIB28MU0", "Overall": "3.0", "Content": "Looks good, works okay, but the design is very badly done. I got this for my dad as a birthday gift.The battery cover does not slide out smoothly. He was afraid he would break it if he applied any more pressure. After sliding back in, there was a bulge on one of the corners. Making a battery cover slide in and out smoothly cannot be that difficult!", "Date": "September 3, 2013"}, {"Title": "Not so great !", "Author": "blitz", "ReviewID": "R278LNGK612SEH", "Overall": "3.0", "Content": "I ordered the phone after looking at number of reviews online but I am not impressed with the phone.The finishing is very rough and one side of the phone is lifted above the surface.well happy with the price i paid so can't really complain.", "Date": "July 16, 2013"}, {"Title": "Great phone with great price", "Author": "Finny Chu", "ReviewID": "R2X2XJFPEW3KG8", "Overall": "4.0", "Content": "I love this phone and has been using it since,I'm still using it now but some time it gets a bit crazy but still good. I dropped it quite a few times but still working great. I will definitely buy the same one if my current one die on me or whatever. I have been telling my friends about this phone,it's a great Nokia product.", "Date": "April 28, 2013"}, {"Title": "good with some issues", "Author": "sunshine", "ReviewID": "R3RL68FDDSYMM6", "Overall": "3.0", "Content": "The features are great. The battery life is l8ng. Its a pain to get  headphones if you lose one. Nokia websites dont have any info on this phone.", "Date": "February 18, 2013"}, {"Title": "Love it better than fancy phones--", "Author": "Maro", "ReviewID": "RNZK37GQE9VLJ", "Overall": "5.0", "Content": "I have had this phone for over a year, and I still love it. It is very durable (I had dropped it more times than I would like to admit), but it still stays strong. I mostly use the calling, calculator, texting and pics, so I don't know about all of the other functions like internet and stuff on here. If I had to go back, I would buy it again. The one and only con, though, in my opinion is that when you trying to get the phone out of your purse of pocket, the radio on the side button turns on which can be annoying at times, but I still love the phone, and the price.", "Date": "September 14, 2012"}, {"Title": "GREAT PHONE, NOKIA IS NUMBER ONE IN TECHNOLOGY CELULALR", "Author": "violeta fuentes", "ReviewID": "R27MBAPXB7WKLS", "Overall": "5.0", "Content": "HELLO FRIENDS, BUY THIS MAKES A GREAT YEAR NOKIA PHONE X 3-00, TECHNOLOGY IS GOOD WITH GOOD CHOICES,, I LOVE AND I LOVE MY PHONE, AND TO ALL MY FRIENDS THAT RESULT FROM THE CAN TAKE RELAIZAR sharp pictures GOOD QUALITY AND EXCELLENT PHONE ..Nokia X3 Slider GSM Quad-Band Unlocked Cell Phone with 3.5 MP Camera and 2 GB SD Slot Memory -- U.S. Version with Warranty (Blue)", "Date": "February 10, 2012"}, {"Title": "Great phone", "Author": "Silent3", "ReviewID": "R16ZBO1Q8H1O6W", "Overall": "4.0", "Content": "I've had this phone for a few months and I love it. I had a previous Nokia 5300 xpressmusic phone that died an honorable death, and I was happy that the X3 had all the thing 5300 did and added the FM radio with external speaker and a new clean slim look. The external speaker is fantastic. I have the radio, music and Podcasts going all the time. It comes with Nokia 3.5 insertion earbuds, but I can't use them. Caution-- it fits 3.5 stereo/mic plug but needed a Nokia specific ground converter ($7 at Tmobile) to make the generic headset/mic work properly.Battery life is great. I can usually go without a charge for 4-5 days if on standby, if using the speaker a lot (like 6 hours) or making calls I'll need to charge it about every other day. I can also use the USB data cable to charge the phone while at work.I also love the downloadable PC suite. With a standard micro USB plugged into my computer I can can sync the X3 to my Outlook calendars and contacts from work, I can use PC suite as a texting interface (and use the fullsized keyboard rather than sneakily texting at work) and down load apps, move music and pitures, and backup and restore my 5300 contacts/music/pictures/text messages to my x3 easily.The X3 beats the smartphone for speed and ease of use in using it as PHONE. In a \"contest\" to call someone quickly the X3 beat the iphone and MyTouch in retrieving and dialing the number from our respective contact book by a huge margin. Slide it open, one button to contacts, 2 buttons to find the name, click click to scroll and dial. Bam!Getting internet on T-mobile USA required a data plan and tech support sending the configuration setting. It's not great internet-- small screen, no flash, but if I just need to quickly check my email or find a phone number I can get it. But even a larger smart phone screens are too small and useless for me, so I guess I'm just not a fan of internet on phone.I borrowed a Mytouch G3 phone for a while the last 2 weeks and found I actually like using the X3 better. Maybe I like the simple interface of the X3, having buttons instead of an always live touch screen, and no android apps that take forever to work and suck battery power, or maybe I just wanted a great basic phone, a great music player and a way to quickly check my emails.", "Date": "January 15, 2012"}, {"Title": "Nokia X3 Slider", "Author": "marjorie", "ReviewID": "RBIZ97LVCAT2B", "Overall": "5.0", "Content": "This unlocked cell phone is special for people who like listening radio, surfing internet.  Teenagers prefer this kind of cell phones because it has enough memory to store music and the facility of Bluetooth.", "Date": "December 30, 2011"}, {"Title": "Muy Bello", "Author": "Francis Ropero", "ReviewID": "R3RQQCNJJINT6F", "Overall": "5.0", "Content": "Excelente celular ya que tiene muchas funciones acorde con lo que necesitaba ademas que es super liviano los recomiendo saludos cordiales desde caracas venezuela..............", "Date": "September 26, 2011"}, {"Title": "went down in 8 months", "Author": "Luis", "ReviewID": "R1W9R23HSBEJLJ", "Overall": "2.0", "Content": "I bought a x6 for my Aunt and x3 for my wyfe, the Nokia X3 Slider GSM phone keyboard sounds weak and and cracks when typing the numbers since new. 8 months later started missing signal ramdomly. the phone got no scratches and well used. I changed the GSM chip 3 times with no luck. Now the phone recovers signal suddenly... 8 months later the battery and the phone started heating up very wearly when not using or charging it, I got afraid this can explode so i removed the battery and leave it away. I love nokia but this models sucked, big time.Now also the X6 shuts off by itself and beeps with no reason...I bought some other nokia phone having no problems but this two models are the worst ever. Now I need to contact nokia to see what options I got since I cant return them now...", "Date": "August 9, 2011"}, {"Title": "very good", "Author": "Lesly Vasquez", "ReviewID": "RAZUB8YKGDA89", "Overall": "5.0", "Content": "The phone is excellent, I have one month in and I have done very well people who buy it must first find the functions posse to be satisfied with the same course before making a purchase ... but in relation to telefoo if I have problems ... I recommend it", "Date": "July 4, 2011"}, {"Title": "cool phone", "Author": "Terressa A. Green", "ReviewID": "R48L7TEDNB0RX", "Overall": "4.0", "Content": "This Phone was a good one, I just wanted to wait for my upgrade to get another phone. There is so many out there to chose from, I may not be able to wait.", "Date": "June 20, 2011"}, {"Title": "Really nice..", "Author": "Priyan", "ReviewID": "R32H0XN200XZJD", "Overall": "5.0", "Content": "I bought this as gift to my brother-in-low. He love it.... It work perfect for him.. A good phone for the price.", "Date": "June 11, 2011"}, {"Title": "Delayed Response", "Author": "Trax", "ReviewID": "R1F7I1G2ZTKE2C", "Overall": "2.0", "Content": "Nice camera and radio function, but overshadowed by a very slow response to input. Every time I enter a command it takes a couple of seconds to respond with the next screen. Very disappointing as I love my previous Nokias. I'm going back to Samsung...", "Date": "March 29, 2011"}, {"Title": "Very good X3", "Author": "David", "ReviewID": "R2355VXOZJNR18", "Overall": "5.0", "Content": "Dear David L.,Thank you for your recent purchase from Amazon.com.We invite you to submit a review for the product you purchased or share an image that would benefit other customers. Your input will help customers choose the best products on Amazon.com.It's easy to submit a review--just click the Review this product button next to the product.", "Date": "March 20, 2011"}, {"Title": "love it!", "Author": "Carolina Ariza", "ReviewID": "R2OL3J2IM7FDZR", "Overall": "5.0", "Content": "i love this phone, it's very functional and modern, it got a lot of stuff; but what i love best is that when you are playing music without headsets it sounds pretty good and loud so thats cool. great purchase as always nokia is the best.", "Date": "October 5, 2010"}, {"Title": "Nokia X3 is pretty descent phone", "Author": "Md Kamrul Hasan", "ReviewID": "R1WDZPS1LC3DQ5", "Overall": "4.0", "Content": "I got the Nokia X3 phone exactly as it says in the Amazon Description.As a standard phone it has all the features that you need. The Stereo Spekers are very good specially for Music and radio.I bought this phone for my mother to carry out of USA. I hope there should not be any issue as this is a Quad Band GSM phone.This phone is very small that I think. And Nokia phone is always good built and robust in design and performance.", "Date": "September 2, 2010"}, {"Title": "NOKIA X3 Cell Phone SLIDER", "Author": "RAD \"RAD\"", "ReviewID": "R41RXP76DMYR8", "Overall": "4.0", "Content": "I have been very please with the Nokia X3, I'm still learning \"how to work it.\"  I'm a Nokia fan and have used many of Nokia's phones/accessories. I've notice it to be more sensitive then other Nokia phones, so I must watch my \"HEAVY\" fingers.  Maybe by Xmas I should've all the \"kinks\" worked out.", "Date": "August 27, 2010"}, {"Title": "great phone", "Author": "James L. Thompson \"jlt56\"", "ReviewID": "R3ANMZGGJMEODG", "Overall": "5.0", "Content": "phone is as depicted in all aspects. really great size, and does all it's projected to do.", "Date": "June 2, 2010"}, {"Title": "If you can't open the battery cover, what good is a phone?", "Author": "Janos Gereben", "ReviewID": "R38QFJIT96LVP6", "Overall": "1.0", "Content": "Amazing experience. With a Nokia, even, maker of some of the best designed phones.To use it, however, you need the battery and SIM card installed. Should be no problem: you open the battery cover... Oops! It won't. The instruction is crystal clear - you push down, and pull up. But it won't. After trying for 15 minutes, I asked friends to do it for me. Fully one dozen people tried to open the cover... and failed.Finally somebody pretty much forced the cover up, I put battery and card in... and couldn't close the cover. Finally, after forcing it back in place (NOT a good idea to manhandle your phone!), it was in place, but now I cannot possibly open it again.Back it goes. Don't think it's just me and my hapless friends. Look on nokiamobileblog.", "Date": "September 16, 2010"}, {"Title": "Nice Good Looking Unlocked Phone", "Author": "Praveen K. Gurram", "ReviewID": "R3L3TBS42DD23B", "Overall": "4.0", "Content": "If you are looking for a good regular unlocked phone this is a good one. Works quad band and internationally. The phone display is nice for a regular phone. The price could have been better than the $129.99", "Date": "January 24, 2011"}, {"Title": "Very nice phone!", "Author": "K. Prieto \"KP\"", "ReviewID": "R26VFKSQSZEID1", "Overall": "5.0", "Content": "I purchased this phone for my son, because his phone broke. I stopped paying for the insurance at AT&T;, because I wasn't really saving anything. When I went to the AT&T; store to purchase a replacement. The least expensive phone would cost $80.00, and didn't have any features. This phone has a ton of features for the money. My Son hasn't had any problems with the AT&T; sim card.", "Date": "December 10, 2010"}, {"Title": "Great product", "Author": "Thiago FS \"Mr.T\"", "ReviewID": "R3B8GK5UYVGLKB", "Overall": "4.0", "Content": "ooooook....a great music phone!!!!....i really liked it, its a simple phone, compared to a smart phone.if you like music like i do, you gona love this nokia!....it has a very good speakers, its slim, well built with good material. i had a 5800 once, but i didnt use evertything that offered,gps...etc, the X3 is the one that i was lookin for. if you looking for a music phone, this is it. and the camera is good too.", "Date": "November 9, 2010"}, {"Title": "Very pleased", "Author": "Carlton", "ReviewID": "R3R2UHZBHD3CDZ", "Overall": "4.0", "Content": "It is a month since I received my Nokia X3 and oh how I love it.  There is so much I can do \"on the go.\"  It is sleek, light weight and stylish.  Thank you, Nokia.  It was bought through Amazon.com", "Date": "October 26, 2010"}, {"Title": "Really nice phone", "Author": "Roger Hood", "ReviewID": "R25XOIC7MPWXMC", "Overall": "5.0", "Content": "Depending on what you want out of a phone, this could be exactly what you need. It's unlocked, works practically anywhere in the world (helps if you travel a lot), and the music player is ok. It does NOT have 3G, so you don't have to pay for the data plan.Battery life is great. Responsiveness is good. Weight and size are very good.I do not regret buying this phone :-)", "Date": "October 25, 2010"}, {"Title": "Good Deal for Quad Band Unlocked CellPhone", "Author": "Binh Nguyen \"Matrix\"", "ReviewID": "R6ZS5MTPGYNI4", "Overall": "4.0", "Content": "I bought it for my mom. it is easy for her to use, functions, shortcuts, slide, are very convenience for her.", "Date": "June 2, 2010"}, {"Title": "White screen problem", "Author": "maverick609", "ReviewID": "R3G60NPV7N6V5Y", "Overall": "1.0", "Content": "My phone is not turning on. When I turn in it on, white screen flashes for 3-5 times and never turns on.", "Date": "December 16, 2010"}, {"Title": "decent phone, my boyfriend bought it, awesome radio speaker", "Author": "hyuliya81", "ReviewID": "R2V6MJFSA1BP4U", "Overall": "4.0", "Content": "PROS: decent phone, my boyfriend bought it, awesome radio speaker, nice games, sleekCONS: kind of expensive considering the fact that it does not have gps, WI-FI, and only 3.2 Mpixel camera. Otherwise, very functional.", "Date": "April 23, 2011"}, {"Title": "Plenty", "Author": "Allan", "ReviewID": "R20HY8R1XKYUYN", "Overall": "5.0", "Content": "This mobile got everything for a little price.  If you want more for less, this is the cell phone.  Excellent Applications, I personally recommend purchase.", "Date": "February 14, 2011"}, {"Title": "Didn't Suit Purpose", "Author": "Marjorie", "ReviewID": "R3Q7XHWJ946KIN", "Overall": "4.0", "Content": "I purchased this phone as a gift and it was a great looking phone. However, the person I was buying it for felt there were so many musical options that she was unable to use the phone simply. My return was handled very quickly and efficiently. I would definitely use this provider again.", "Date": "January 3, 2011"}, {"Title": "IMPRESIONANTE", "Author": "Luis Alfredo Paez", "ReviewID": "RBFS163V7R97P", "Overall": "5.0", "Content": "EL NOKIA X3 SLIDER GSM...UN CELULAR MUY MANEJABLE,COMODO,HERMOSO COLOR,CON TODAS LAS FUNCIONES QUE TE ANUNCIAN,CAMARA DE VIDEO NITIDA,CAMARA DE FOTOS REAL,LA MUSICA EXELENTE,EL SONIDO NITIDO,TODO PERO TODO DE PRIMERA..IMPRESIONANTE..ENTONCES SI LO VAS A COMPRAR A HACERLO SIN TEMOR..VALE LA PENA.BYE", "Date": "December 28, 2010"}, {"Title": "more than I expected", "Author": "Guoxun Yang \"guoxun\"", "ReviewID": "RDXM9GAH6O77I", "Overall": "5.0", "Content": "It includes all the functions I needs, MP3, camera as well as radio. When I switched it on, I nearly could't believe my eyes. It displayed my mother language. Nobody mentioned it can support multiple languages. Yes, this let me feel crazily happy to make this purchase.", "Date": "November 3, 2010"}, {"Title": "very good", "Author": "Muhammad J. Qazi \"Doctor\"", "ReviewID": "RULZYZ4P3D1O6", "Overall": "4.0", "Content": "nokia x3 was a very nice cell phone great music and and very easy to use function like always nokia is one of the easitest phones to use no doubt. it was a decent cell phone no complaints so far.", "Date": "August 14, 2010"}, {"Title": "Excellent", "Author": "Farman Khan", "ReviewID": "R19EJ0NK7BUERH", "Overall": "5.0", "Content": "I bought this phone couple weeks ago. i thought my decision was wrong, but when i received my phone. it was very good. it was exectly what i wanted to buy. i would recommend this phone to any body.", "Date": "April 14, 2010"}, {"Title": "this's right phone for me", "Author": "Beebee", "ReviewID": "R194455N398CJE", "Overall": "4.0", "Content": "I love this phone. I loved design and size. Easy to use, speaker is great, good to play music, camera is good. But the most important is I use this phone as a phone. Make a phone call and text massage that's enough for me.", "Date": "November 28, 2010"}, {"Title": "There is no battery", "Author": "No Battery", "ReviewID": "RJR8NPOP4A1IS", "Overall": "1.0", "Content": "Hi,, I recently bought this phone from this seller.. and there is no battery in the cell phone..I tried to contact the seller but there is no contact number or such..", "Date": "March 21, 2011"}, {"Title": "Can this phone work in any GSM network??", "Author": "Cindy", "ReviewID": "RREBKR4V5WMWN", "Overall": "5.0", "Content": "Dear Seller,I want to buy this phone to be used in south america (the offered bands are ok) but I'm counfused because you said US version.Thank you in advance for your explanation.Best regards,Cindy.", "Date": "February 21, 2011"}, {"Title": "Return!", "Author": "Richard", "ReviewID": "R3G1EHZTDL7TQM", "Overall": "4.0", "Content": "Hello,I'm Richard Peter Pudenz and a exchange student here in America. I bought this Nokia to use it here and back in Germany. But it didn't work with the Sim card. I wanna return this item, what should i do?", "Date": "October 29, 2010"}, {"Title": "Good cell phone", "Author": "osmarnetto", "ReviewID": "R19OHKLTQVA57S", "Overall": "4.0", "Content": "Everything works very well. It is really easy to use and has a lot of applications. It is just a little heavy, but not so much.", "Date": "September 21, 2010"}, {"Title": "Vale mas que lo que costo", "Author": "Egon Schmegner", "ReviewID": "R1YM0OTIC4E174", "Overall": "4.0", "Content": "Excelente modelo practico, funcional, buena resolucion, viene completo con cable audifonos y 2 GB de memoria. Las fotos se deben tomar con la mano estable, facilmente salen borrosas. Por todo lo demas es un gran telefono.", "Date": "August 15, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Incredible Music Experience\n24 hours of music playback time.\nDirect access with the camera key to capture the moment with friends and families via the 3.2-megapixel camera with extended depth-of-field.\nQuick music/photo file exchange with your peer group via Bluetooth transfer.\nOver-The-Air sw update (FOTA) allows operators to push new phone sw upgrades to the terminal and operators will save in costs.", "Name": "Nokia X3 Slider GSM Quad-Band Unlocked Cell Phone with 3.5 MP Camera and 2 GB SD Slot Memory -- U.S. Version with Warranty (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41YFazyr1rL._SY300_.jpg", "ProductID": "B0036DDT6K"}}