{"Reviews": [{"Title": "Cudos to MetroPCS", "Author": "italianice", "ReviewID": "RC4O8551DEUPW", "Overall": "5.0", "Content": "It is true that MetroPCS does not have comprehensive customer service. That's not the whole story: MetroPCS has gr8 coverage, low monthly rates, and no contracts!! I have unlimited text and talk for less than 45$ a month! It's wonderful! no fuss no muss! And, MetroPCS now supports 4G! Rock on MetroPCS!!", "Date": "March 25, 2013"}, {"Title": "Metro Pcs", "Author": "Angela", "ReviewID": "RNU4YA27682KI", "Overall": "5.0", "Content": "I love metro pcs.  I have had NO problems with them at all.  I love the coverage.  I love all the features they offer.  Don't believe just one person who had a bad experience.  They have been better than any company I have ever been with.", "Date": "September 3, 2012"}, {"Title": "AVOID METO PCS !!!!", "Author": "New Yorker \"yogini\"", "ReviewID": "R3UI1TLULPREME", "Overall": "1.0", "Content": "AVOID Metro PCS !!!  I know this review is supposed to be for the Samsung phone,  but it you get the phone attached to Metro PCS, you are going to SERIOUSLY regret it !!!!  No matter how nifty the phone may be.They have absolutely no customer service and the staff at the stores just refer you back to the website if you have a problem.I paid for my month, received confirmation of payment and then the phone said I could not use it due to lack of funds.... !!!  So I tried to get in touch with customer service.  All you get is a recording.  I sent email .... no response.....  So they got my $40 and I no phone service .In addition, the first day I signed up, the sales person allocated my payment to somebody ELSE's phone (similar phone numbers) and that took me about 3 days to get Metro PCS to correct that and they acted like it was my fault.If you google Metro PCS reviews, you will find many other people had the same problems.  i wish I had read those reviews first.", "Date": "August 1, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "MetroPCS Samsung Freeform No-Contract Mobile Phone - Red", "ImgURL": "http://ecx.images-amazon.com/images/I/41JxLuwoTEL._SX300_.jpg", "ProductID": "B003ZWBQ3K"}}