{"Reviews": [{"Title": "Smart little phone", "Author": "JBird", "ReviewID": "R36OOX53ZF2BXM", "Overall": "5.0", "Content": "Although not a \"smart phone\" this compact device is feature-packed with a camera for stills and video, a real music player, a real FM radio using your headset as its antenna, Bluetooth and USB, and data storage on a mini SD card.  Of course, it also has the essential calendar and phone book, but they, too are feature-packed.  And, oh, yeah, the call clarity is great.  Software can be downloaded for easily backing up the phone and working on the calendar and phone book.  The best feature is that it is small.  It is a phone for those of us who have other means to get online when we need to.", "Date": "June 4, 2013"}, {"Title": "It works But it's not NEW...", "Author": "Seth M.", "ReviewID": "R26OOP86CKFBVL", "Overall": "3.0", "Content": "I would have ordered more of these phones from them if they had really been new. And I know it's not new because I got one of these phones when they first came out. And their was a lot more stuff in the box. And the battery in the phone would not hold a charge thank God I still have the other phone, and I put it in the phone to see if it would work and that old battery works like a charm! SAVE....! so I'm going to keep the phone But I will find a new seller to see if I actually get a new phone this time.", "Date": "July 31, 2013"}, {"Title": "A very good product", "Author": "Renaud Olgiati", "ReviewID": "R2F3LU8ALQ3F09", "Overall": "5.0", "Content": "Small in size, sufficient to fulfill all I need from a phone (basicall a cell phone and a camera), this is the fourth Nokia 5310 I have bought: one lost, another savaged by the dog, and one needing repairs, awaiting spare parts; I must be pleased with it !", "Date": "February 23, 2013"}, {"Title": "Product origin next time please!", "Author": "Conrad R", "ReviewID": "RNE05UAZRPAR2", "Overall": "4.0", "Content": "Phone language not stated - only get British English for English language. Otherwise delivered on time. Box wasn't pristine, but contents were undamaged and appeared OEM.", "Date": "April 19, 2014"}, {"Title": "Defected and used, but sold as 'brand new'", "Author": "Bill T", "ReviewID": "R34RMEWLZ3MNQ5", "Overall": "1.0", "Content": "I've used this same model of phone before, it's not a smart phone but I like it because it's small and light. This time I order two Nokia 5310, one for me and one for my wife, the red one for my wife is okay but my black one is really bad, the battery can last only one day while it should last about 3 days according to my normal use. The worst about this phone is the listening volume, it's so low that at first I thought I suddenly had hearing problem, then I try my wife's red phone (same model bought at the same time), I knew that the problem isn't my ear but the phone. When the phone arrived I notice there's dust inside the screen, so I suspect it's a rejected one, but the seller sold it to me as a 'brand new' one, I paid for it at a 'brand new price'", "Date": "March 25, 2014"}, {"Title": "good phone", "Author": "antoni", "ReviewID": "R33A8WK4H0VNWK", "Overall": "4.0", "Content": "just what i expected, minor problems tho, will sort out same in time since i use no other phone but this 4 years, thanks", "Date": "February 5, 2014"}, {"Title": "Nokia is the best choice for me", "Author": "Stefan Hanelt", "ReviewID": "R1JTULSE4ZC89T", "Overall": "4.0", "Content": "It is the best choice for the kind of dirty work I am doing. Easy to clean, easy to use, very good function under tough job site conditions. I had this phone before and I didn't know where to get it again. I tried some differents phone in between. I am happy that I found it again. So far so good after dropping it already a few times. Very good phone for everybody who doesn't want or need a smart phone.", "Date": "August 25, 2013"}, {"Title": "Phone Lock code", "Author": "Blingb", "ReviewID": "R1NAHKTU99WK81", "Overall": "2.0", "Content": "I order this phone, it said unlocked and it's asking me for a code.  What's the deal?  It came with a TMobile sim card and the phone is written Tmobile.  How do I unlock the phone? What is the code?", "Date": "March 30, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "unlocked phones, unlocked phone, GSM phone,\nGSM phones, unlocked GSM phones, unlocked GSM phone, unlocked GSM\nTriband phones, triband phone, tri band phones, tri band phones,\nworldphones, worldphones, GSM worldphones, GSM worldphones, GSM Unlocked\nworldphones, GSM unlocked  worldphone", "Name": "Nokia 5310 XpressMusic Black Blue Triband GSM Cellular Phone (unlocked)", "ImgURL": "http://ecx.images-amazon.com/images/I/41jeDjkTe4L._SY300_.jpg", "ProductID": "B003L1OYHU"}}