{"Reviews": [{"Title": "Phone partially unlocked - only!...", "Author": "Jose Meirelles", "ReviewID": "R3ENG5984BZHDA", "Overall": "3.0", "Content": "TigerDirect advised this cellphone as being \"unlocked\" but actually it ONLY makes calls by using other services than AT&T.; I and Samsung especialists tried a lot and could not set GPRS configurations for other services. The phone remains locked at AT&T; for accessing internet/wap services. I am really disapointed just because I got a \"half\" smart phone...", "Date": "September 5, 2010"}, {"Title": "Samsun SGH-a177 Quadband Unlocked Cell Phone", "Author": "Bethann", "ReviewID": "R1EJ73VEE2089A", "Overall": "4.0", "Content": "Phone was indeed unlocked as advertised. Put in a RoamSimple European SIM card and it worked right off the plane in London. Recommend this phone and this vendor.", "Date": "January 9, 2011"}, {"Title": "I loved this phone", "Author": "cherila", "ReviewID": "R34QUT8Y5J5IF5", "Overall": "5.0", "Content": "I admit that the keys are small but I carried this phone for 2 years and loved it. Only replaced it because the battery died. Have only liked 1 other phone as well. I'm thinking of going back to this one if i can't find another phone that has a better camera (a need that I didn't have back then) without getting a smart phone. It's not that I remember this camera to be particularly bad, I just can't remember. Loved it overall and may still get another one.", "Date": "October 21, 2012"}, {"Title": "OK basic phone", "Author": "Mark J", "ReviewID": "R203I29NGQ3V4Y", "Overall": "3.0", "Content": "The phone actually looks and feels much cheaper in your hand than it looks on this page. The keys are very small. But it does work well and seems durable enough.For $85 with no contract, this could be a good phone for pre-paid use.", "Date": "April 29, 2011"}, {"Title": "Samsung Sgh a177 cell phone", "Author": "Karl", "ReviewID": "R12VSEBYHZJM0V", "Overall": "3.0", "Content": "Sturdy unit, keyboard entirely too tiny for the average man to make good use of, unless he has longer nails to tap with.  Redesigning the keyboard with larger keys would make this a finer unit.", "Date": "January 20, 2011"}, {"Title": "Its a cellphone", "Author": "Woogy", "ReviewID": "RFD9PDMQX90JX", "Overall": "3.0", "Content": "I bought it because my other phone broke and I thought it would be nice to replace it with a phone that had a QWERTY keyboard.Solid build, good reception but the keys are WAY to small.", "Date": "January 5, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003SGPXSC"}}