{"Reviews": [{"Title": "Do Not Buy!", "Author": "Mehar Mukesh Muni", "ReviewID": "R25CVCRC7JGV3U", "Overall": "1.0", "Content": "I bought the same model from OEM and it was the worst buy I have ever made on Amazon. Product was shipped late. Secondly, it was not as described. Phone was not new (looked refurbished) and worse, it was locked (to Cingular) despite it being stated to be unlocked (it had someone's email address, my guess previous owner). Bold 9000 came in a worn and faded Blackberry box, containing no manual or cd rom (for installing DM into PC, no pouch for Bold and just the earpiece. Overall a very negative experience and I had to pay to get the phone unlocked. Please, think twice (or even thrice) before ordering from this company. Although it has high ratings (96%), do you want to be one of the 4%? In this day and age, its practically unheard of to go through the experience I went through. But sadly, it happens and as they say, buyer beware. Hence my early warning to you fellow Amazonians.", "Date": "July 28, 2010"}, {"Title": "Worst purchase ever", "Author": "RAJESH K AGARWAL", "ReviewID": "R2EF7NQGGPSJSI", "Overall": "1.0", "Content": "I got this phone today, I paid higher price to buy from Amazon LLC as I read earlier reviews about problems with the other supplier.Even though the website says sold by Amazon LLC, this came from other company.The phone is a At&t; phone,looks refurbished, worst thing was a white colored charger is included with the phone. Very misleading on the website, I assumed it to be a new,unlocked phone. I will send it back ASAP and never buy any phone from Amazon again.", "Date": "December 8, 2011"}, {"Title": "bad", "Author": "GEO", "ReviewID": "R3GA9EIQL2FNQH", "Overall": "1.0", "Content": "just got it today in the mail and suprised it has a camera!! i ordered without camera since my job requires no camera allowed. Really dissapointed of getting it. now its time to return it back..booo!!!!", "Date": "February 2, 2012"}, {"Title": "Incorrect Product.", "Author": "Jayakumar", "ReviewID": "REHT5ENT3XDRS", "Overall": "1.0", "Content": "I ordered this item thinking that it will not have camera as the job requires but what I received has camera. So returning the product. What a waste of time?", "Date": "July 31, 2012"}, {"Title": "Ignore my previous review (PLZ READ)", "Author": "Sha'Re Ester", "ReviewID": "R2CG02L1ITOEU4", "Overall": "1.0", "Content": "I had left a pretty good review of this phone but now after a little over one month of purchasing this item I no longer have this product because the circuit board went bad. When the technician informed me that the circuit board was bad I asked how much it would cost to resolve the problem, and he just laughed and told me I was better off purchasing a newer phone flat out without a contract. I couldn't believe it!!!! I also asked him how could a new phone have gone bad in such a short span of time and he was silent for a little bit, and told me to try to get my money back because the phone that I had was not a brand new phone but a refurbished one. I will be reporting this seller to Amazon for false advertising!!!!!", "Date": "September 26, 2013"}, {"Title": "The phone is not good at all and its hardly been 15 days since i bought it.", "Author": "Amit Kolhe", "ReviewID": "R1D47R4DFHTT69", "Overall": "1.0", "Content": "The phone is not good. It keeps having issues.The sound goes away every other day and also the lock function does not work.I would never recommend this phone to anyone.I am already fed up of it !", "Date": "December 21, 2012"}, {"Title": "Doesn't look new", "Author": "Vishal", "ReviewID": "R10UFQQA92NWS", "Overall": "3.0", "Content": "The mobile didn't look new, looked like a used one. The new polished finishing was lost but still no scratches. Though it lost the shine phone was clean.Pros:As said, it worked in India.Cons:As it remained to be a old model, it was not so user friendly in setting up all features in the phone...", "Date": "October 12, 2011"}, {"Title": "blackberry bold w/o camera", "Author": "sampy1961", "ReviewID": "R2JHZVEA5ZGQWV", "Overall": "5.0", "Content": "I got my phone very fast, and it was just like they said, brand new. I was extremely pleased with the phone.", "Date": "July 15, 2011"}, {"Title": "Great choice", "Author": "frederick quarterman", "ReviewID": "R15RAT3LBR57AJ", "Overall": "4.0", "Content": "I needed the phone for working on a base in a foreign military. Phones with cameras are prohibited in our work area. The phones were exactly what I needed. My co-workers will now be ordering the same phone.", "Date": "January 23, 2014"}, {"Title": "it nice", "Author": "webber wei", "ReviewID": "RO9LD9VDB8WSW", "Overall": "4.0", "Content": "it's nice, its keyboard is better than my NOKIA E72, but it's a little pity that it does't have camera...", "Date": "January 14, 2014"}, {"Title": "Good for the price, they don't make phones this beautiful any more!", "Author": "Ryan", "ReviewID": "R2RLK4KII2V0D5", "Overall": "4.0", "Content": "I ordered this phone for its amazing value.  You need to be sure to read the description instead of look at the pic.  This phone is black unlocked with no camera and that's exactly what I wanted.  When I opened the box I was disappointed because it is an At&t; phone but it does work with other carriers sim cards because its an AT&T; world phone.  The phone looked to be new BUT the box had been opened and there were finger prints on the phone and the stickers covering the screen and back were gone.  I wiped the phone with a microfiber cloth and it looked brand new and the phone is beautiful.  I then set up the blackberry service through my carrier and all was well.  The two things that don't work are the disk to install the desktop program but you can download that through blackberry and for some reason the blackberry appworld won't work even after hours on the phone with blackberry and AT&T.;  That's not such a big deal because all I use the phone for is calls, text, email, Facebook and twitter were already loaded.  If all you need the phone for are these basic things then this phone is an amazing deal!  I also ordered the charging cradle from amazon for next to nothing and the duo work perfectly!", "Date": "January 3, 2014"}, {"Title": "Not as advertised", "Author": "VA Ray", "ReviewID": "R32V6UDDJ6PX7U", "Overall": "1.0", "Content": "This phone had a camera. When I called for product replacement I was told all the phones had cameras.  My money was returned.", "Date": "June 3, 2013"}, {"Title": "Amazon Verified Purchase...BlackBerry Bold 9000", "Author": "Moss", "ReviewID": "REC6KB3E5FAO3", "Overall": "1.0", "Content": "Got this product last December from Amazon. It was advertised as new but it turned out to be a refurbished at&t; model. Used it for almost six months and it just suddenly stopped working. Screen was black, no lights, whatsoever. Would not turn on even after I changed batteries. I am sending it back to Amazon. Not recommended.", "Date": "July 3, 2012"}, {"Title": "Blackberry Bold 9000", "Author": "Amazon Customer", "ReviewID": "R2U6SSVZGVJL8N", "Overall": "5.0", "Content": "Reasonable price. Quick turn around time. I needed a phone WITHOUT a camera but didn't want to revert to the stoneage, so far this phone is great", "Date": "August 2, 2011"}, {"Title": "Excelente Equipo!!!", "Author": "Jchurio, Venezuela", "ReviewID": "R3V4N1V4C4RRUA", "Overall": "5.0", "Content": "Muy buen articulo tal cual se describe en la oferta, levanta 3G en Venezuela con Movistar y Movilnet!!! El articulo llego sin daños como nuevo a pesar de que se compro Usado llego como nuevo el celular.", "Date": "May 14, 2012"}, {"Title": "DOA", "Author": "BES", "ReviewID": "R1BKIHXAGN5NCL", "Overall": "1.0", "Content": "Ordered this new unlocked phone since I have a work environment that does not allow cameras.Charged the phone before turning it on until it stopped charging from a full charge.Inserted an active T-Mobile sim card and the phone displayed \"insert sim card\".Inserted an active AT&T; sim card and again the phone displayed \"insert sim card\".Sent the phone back to Amazon and hope to purchase another that hopefully is in good working order.", "Date": "August 21, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003CK72R4"}}