{"Reviews": [{"Title": "Top Shelf Phone in my experience.", "Author": "Jim", "ReviewID": "R3M2VOMSC5IFO3", "Overall": "5.0", "Content": "Sleek, small, Many good functions,Loud speakerphone located in a good spot(not back of phone like some others, Beautiful screen with deep colors,nice Querty keypade upon turning phone horizontal.Overall a great smart phone without the bulk.", "Date": "November 14, 2010"}, {"Title": "careful!", "Author": "W. Johnatty", "ReviewID": "R15IEB2V81VIF4", "Overall": "2.0", "Content": "This is a nice phone from the reviews on the internet - i bought one from the OEM shop and i am not sure that they are selling new phones  I got no manual, just a little booklet with about 4 pages of english, the phone wasnt sealed in even a plastic bag, THe seal was broken and a sticker saying \"inspected by OEM Team\" All over the phone there appears links and connectivity (Like \"KoreaR&D;_1\" etc) options as though it was used to test the phone, i cant seem to use lgsync, I cant find a manual nor go and get new apps for it anywhere. I dont think this phone is a production phone.  i cant change the home page, i really love the phone an i went ahead an bought accessories for it, now i feel as though I bought something that was misrepresented in the advertising - as \"new\". I wrote them and they did not respond.", "Date": "October 10, 2010"}, {"Title": "EXACTLY WHAT I NEED", "Author": "YY", "ReviewID": "R31QBZ72SHCE06", "Overall": "5.0", "Content": "This is not a smart phone. It functions on a LG house OSPRO: compact, stylish, great graphic (considering it came out two years ago), easy to useCON: battery life last max 48hr", "Date": "November 9, 2011"}, {"Title": "Great small phone.", "Author": "GadgetGirl", "ReviewID": "R2PUY4P43KNRCX", "Overall": "5.0", "Content": "Bought a open box from Amazon warehouse deals I only paid 97.00 for it, it shipped fast and was in mint condition, put my sim card in and worked.Great screen, crisp and beautiful, I have no issues with it and calls are very clear.Battery life is great and you can get a unlimited data plan for 10.00 a month, this is one slick looking phone.", "Date": "July 19, 2011"}, {"Title": "Beware!!", "Author": "W. Johnatty", "ReviewID": "RJENR7WJSJI43", "Overall": "1.0", "Content": "This vendor appears to be changing his products when there is a negative review - i purchased this item - It does not appear as advertised - this is not new and sealed - it is most likely a test item - and cannot be updated. I would blacklist this vendor for misrepresenting his products.", "Date": "October 20, 2010"}, {"Title": "RUN for the hills!", "Author": "Gustavo Campos L", "ReviewID": "RYFQ5DH04MILE", "Overall": "1.0", "Content": "the phone itself is not bad,  it feels sturdy and the design is greatThis is not a smartphone, If anything is a slightly clever phone.The OS is a death trap, it get's stuck over the littlest thing. Has almost no customization, and the interface is clumsyThe battery life is abysmal. You'll be lucky to go 2 days without charging even in no use, battery saving mode and without back-light.LG support is the place where dreams go to die, you can't find an area where they know how to support this phone, everyone says \"this device is developed for another area, visit the global site for support\" i know it has no US warranty, but would it kill you to have some FAQ's about your products LG?So if you have an error you can't fix yourself... might as well save time and just buy a new phone", "Date": "August 26, 2011"}, {"Title": "An excellent cellphone", "Author": "paulvillavi", "ReviewID": "RJQESXM4AAYFH", "Overall": "5.0", "Content": "It has everything you need, it's amazing this cellularphone, for the price it's enougth, the size excellent.It'doesnt have a good user's manual", "Date": "May 9, 2011"}, {"Title": "lg mini", "Author": "pen", "ReviewID": "R3MWL6ATWV6FNY", "Overall": "3.0", "Content": "This phone is really nice and cool features like complete access from your PC.The only down side is that does not support many apps as my blackberry used too.", "Date": "March 30, 2011"}, {"Title": "what's in the box?", "Author": "htet", "ReviewID": "R1K5S0CWZBQJ5N", "Overall": "3.0", "Content": "Hi there,i want to know what is in the box?is the phone is new condition?can i video chat with that phone?", "Date": "December 4, 2010"}], "ProductInfo": {"Price": "$599.99", "Features": "GSM 850 / 900 / 1800 / 1900, HSDPA 900 / 2100\nDisplay: TFT touchscreen, 256K colors, 480 x 854 pixels, 3.2 inches with Accelerometer sensor for UI auto-rotate\nWi-Fi 802.11 b/g, Bluetooth v2.1 with A2DP, GPS with A-GPS support\nCamera: 5 MP, 2592 x 1944 pixels, autofocus. Video. Stereo FM radio with RDS. Organizer. MP3/WMA/eAAC+ player. MP4/H.264/H.263 player\nTalk Time: Up to 7 h, Stand By Time: Up to 330 h", "Name": "LG GD880 Mini Unlocked GSM Phone with 5 MP Camera, Touchscreen, Wi-Fi, Bluetooth and Micro SD Memory Extention--International Version with No U.S. Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41VCSrB9nsL._SY300_.jpg", "ProductID": "B003BSXOS8"}}