{"Reviews": [{"Title": "Do NOT buy on pain of death", "Author": "Axel", "ReviewID": "R1D9WZL46E5LE0", "Overall": "1.0", "Content": "After owning the debacle that is the NoKia N97 for several months, I felt a longing to return to simpler, easier to use and more reliable but feature rich handsets that Nokia used to be very well known for, and were actually pretty good at making. Remember that word 'reliable' for now, as I'll come back to it. But basically, every time I had to pull out the heavy, bulky, temperamental N97 from my pocket, and wait for its glitchy, lazy software to figure out what I was trying to do at that moment in time, I became more and more resentful of it and realized that sometimes, \"smart phones\" are anything but. I longed for the simplicity and beauty of Nokia's 6230,or 6230i, or 6233 days, when phones did everything you could want them for and didn't require several Phds to operate. In my search, I came to rest upon the Nokia 6700 classic.I'll confess - I was hooked almost from the fist look. It's stainless steel body, it's cool, classy candbybar form with rounded edges and its simple, yet striking front plate communicated a seriousness and promised a robust, straightforward experience. A quick glance through the feature list and I was hooked. I had to have it. I had dreams of abandoning my N97 to my underwear drawer, possibly only to be liberated in times of desperate need when a back-up handset might be helpful for a trip, but determined not to sell it to anyone, as I knew in my soul, I could not wish the N97 disaster on my own worst enemy. In one amazing spec sheet, Nokia had promised redemption and I was eager to give it to them.To be fair, I was warned. Even though I had committed to buying, I raked the internet for reviews. \"Temperamental\" they warned. \"Unreliable\" they screamed! \"Daft\" they exclaimed. I read them all but was unmoved - mine would be the exception, rather than the rule. Mine would defy the expectations, and work well without glitch or incident, for after all, this was Nokia, and Nokia could not let me down so utterly, in such quick succession, with two different products... not me; a fervant, loyal, reliable supporter and purchaser of their products for the last 10 years, without interruption...I've owned the phone for less than three months, and here's the facts: before it just stopped working, the phone would get impossibly hot during phone calls using the headset. It would routinely drop calls for no discernable reason, headset on or not, and when it was offended by your reaction to it doing so, would actually turn itself OFF during phone calls to drive the point home. The phone doesn't have a 3.5mm jack (which I knew when I bought it) so is not terribly good for listening to music or plugging into a car radio, and for reasons which shall always escape me but which shall likely fascinate me to the point of distraction till the day I die, Nokia made it so that the radio could not be played over the loudspeaker!!!!So, you can't play the radio over the loudspeaker.... and it doesn't work very well, for MAKING PHONE CALLS!!!!Oh, Nokia, my once beloved Nokia, whyfore art thou a hopeless gaggle of idiot savants and social maladajusts? Where hast your dependability gone? Why hast your basic five-year-old-knows-better-by-now-common-good-sense abandoned thee?Then, about a month ago, it just turned off, and hasn't come back on since. Despite everything I've tried. And tried. And tried. And keep trying... sigh.So then, the worst insult of all - reluctantly, and with a heavy-heartedness such as I have not felt since, well, watching Episode 1 for the first time, I reopened my underwear drawer... and had to go back to my N97! Oh, the humanity.DO NOT BUY THIS PHONE, AND IF IT'S GIVEN TO YOU, THE PERSON WHO DOES SO DOESN'T LIKE YOU! I've given it one star because Amazon will not permit me to give it less!DO.NOT.BUY.THIS.PHONE! DO.NOT.ACCEPT.IT.AS.A.GIFT. STAY WELL CLEAR!", "Date": "July 5, 2010"}, {"Title": "very cool", "Author": "Mesho", "ReviewID": "R3C8SMLLKXSMAP", "Overall": "4.0", "Content": "very cool product arrived on time with well packagingi just love this phone very dependaple with great sound qualityin addition its camera is pretty cool too", "Date": "November 3, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Nokia 6700 CLASSIC CHROME SILVER Unlocked Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41bx5Dg2tiL._SY300_.jpg", "ProductID": "B003S6LF16"}}