{"Reviews": [{"Title": "DONT", "Author": "Boydstyle", "ReviewID": "RIPU1ICCRNOXL", "Overall": "1.0", "Content": "Okay, seriously?  Ignore the guy who says it works for Straighttalk cause it freaking doesn't.  I bought it and it worked perfect for my sister (She's on T-mobile) and mine wouldn't even work with the sim card in!  I was pissed to say the least.  Either way, the internet doesn't even work on it and you can't recieve pictures.  If you want a high-tech phone for texting and calling, go ahead.  Otherwise this phone is a piece of ****.", "Date": "August 4, 2011"}, {"Title": "Excellent", "Author": "T S Liot \"tsliot\"", "ReviewID": "R29POSCNZFA6KJ", "Overall": "5.0", "Content": "I am satisfied with this phone though I am still learning how to use it. I like it. It is unlocked for real and I can use it with any company and even out of America with other sim cards. Just what I really wantedMary", "Date": "September 11, 2010"}, {"Title": "samsung straighttalk", "Author": "marksanchez", "ReviewID": "RPAO2BGIR7CLE", "Overall": "5.0", "Content": "YES U CAN USE IT W. STRAIGHTALK but u need a straight sim card to put it in there. This phone is awsome and everything is touchscreen. i know the new phone they came out w. straight cost around 180.00 but you cnt beat this phone w. this price to. And it only work w. the 45.00 plan only! its well worth your money instead of paying like 100 a month for a cell phone or more and it does the samething all the phones do. i Know it run off of AT&T; towers and since i got this off of amazon i can use it. it used 2 b sold on straighttalk.com but i dnt know why they dnt sell it anymore. but its worth your money", "Date": "July 2, 2011"}, {"Title": "Great!!", "Author": "Alby", "ReviewID": "R18LVAL38A14FJ", "Overall": "5.0", "Content": "Excellent customer service, very pleased with the results. Had a small problem with the product the matter was resolved very quickly.", "Date": "December 4, 2012"}, {"Title": "Great Purchase! Its features fit the price", "Author": "Juan Antonio Plaza", "ReviewID": "RF5MD2S3WBZT6", "Overall": "4.0", "Content": "Nice phone. Smooth interface and handy widgets. Good volume level and sound quality through speaker. The bad thing is the software that comes with it still doesn't work with Windows 7. Transfering my files just via Bluetooth", "Date": "May 13, 2010"}, {"Title": "buen telefono recomendado", "Author": "Johanth", "ReviewID": "RU2V8P2KVBS81", "Overall": "5.0", "Content": "me gusta el equipo es muy liviano y no ocupa mucho espacio comprado desde venezuela buen producto recomendado a todos", "Date": "December 17, 2012"}, {"Title": "Answer My Question Please", "Author": "Ariel Carr", "ReviewID": "R1KJMQ6FVX32VQ", "Overall": "5.0", "Content": "I just want to know if this a straight talk compatible phone. If so, that means all I need is a sims card right?", "Date": "July 28, 2011"}, {"Title": "Virgin territory", "Author": "larvaag", "ReviewID": "R1G6BUB1IMBWB1", "Overall": "2.0", "Content": "I am reviewing this quickley yet I am expecting to do an updated review after the kinks are restored due to my owninnocense.I got the unlocked product, yet everything is in a foreign language and has different plug ins and stuff.  That is the first problem or challenge.Getting in touch with a \"source\" who can answer me immediate questions is nearly impossible.....ugh.So lets get everything fixed is all I have to say and do.Looks great but have not been able to get survice as of yet :(.", "Date": "November 5, 2012"}, {"Title": "Confused.", "Author": "Spakrs", "ReviewID": "R3RDPG2VNFLBB3", "Overall": "3.0", "Content": "So if I were to buy this cell phone, I would have to get some kind of straight sim card? How much are those? Where do I insert that tiny microchip? Where can I get one? I can only use the $45 dollar plan? I'm so confused... I really want a cool phone and this is it. But i don't want to go through so much trouble.", "Date": "July 8, 2011"}, {"Title": "Unusable home charger", "Author": "M Means", "ReviewID": "R2DSJP8IDQD33L", "Overall": "3.0", "Content": "The home charger looks like it is European so I am having to charge via my computer.  I ordered the US version.  You might want to buy one when you purchase this phone Also shipping was very, very slow.  It took 14 business days and an email to Amazon.com before I finally got the phone. I am still trying to figure everything out on the phone but except for the charger it has some good features to it.", "Date": "October 9, 2010"}, {"Title": "Is this a Straight Talk compatible phone?", "Author": "D. Colon", "ReviewID": "RR8TL60JKIT53", "Overall": "5.0", "Content": "Before I buy, could you please inform me as to whether this is a Straight Talk compatible phone?  Thank you.", "Date": "June 27, 2011"}, {"Title": "question", "Author": "amazonlover", "ReviewID": "REWHKNB94SP7R", "Overall": "3.0", "Content": "How do i know if this is a straight talk phone. When i type in touch screen straight talk phones, then only straight talk phones should pop up correct? I would love to have this phone if i knew this information.", "Date": "May 29, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "2G Network - GSM 850 / 900 / 1800 / 1900\nAlert types - vibration, polyphonic, MP3, & WAV ringtones\nSpeakerphone (DNSe, digital natural sound engine)\nInternal Memory - up to 50MB\nExternal Memory - microSD (TransFlash) slot (up to 16GB)", "Name": "Samsung S5230 Star Unlocked Phone with 3.2 MP Camera, FM Radio and Speakerphone--International Version with Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41VYR3s9RFL._SY300_.jpg", "ProductID": "B003L76N0U"}}