{"Reviews": [{"Title": "Very good phone", "Author": "A. Nima \"Kreator\"", "ReviewID": "R3222BJ36HNZZL", "Overall": "4.0", "Content": "This phone is simply great.  Touch-screen and a physical qwerty keyboard are the perfect combination for a cellphone.  I use the phone with AT&T; but I only use text and calls which are great.  The touchscreen is very, very responsive.  The phone is overall easy to use.  Oh and the battery is amazingly great! The phone has 5 battery bars and it still has 3 bars with the phone on 3 consecutive days without recharging.The reason why I gave it 4 stars is because the keyboard is somewhat hard to use for the first time, the text input is a few microseconds delayed when you use the keyboard and the keys are very sensitive.Overall very good cellphone!", "Date": "December 17, 2010"}, {"Title": "Samsung B3410", "Author": "Music Name", "ReviewID": "R3IY93YP0QA6SP", "Overall": "5.0", "Content": "Good phone. I bought it for my daughter, who wanted to have a qwerty phone. We like the features offered by the phone.The only point I don't like about the phone is the date format. Since this is an international phone, the US date format is not available.", "Date": "October 18, 2010"}, {"Title": "Satisfied", "Author": "MAJ", "ReviewID": "R2468WQ7HX66YM", "Overall": "4.0", "Content": "I purchased this phone for my mom who is in her late 60s.  It is perfect for her as she wanted an upgrade from a flip phone, but didn't want and couldn't handle a smart phone that could do lots and lots of things. She has a phone that can do just enough.  She enjoys the touch screen, the qwerty keyboard for texting, the few apps, and the camera. I think I hit the mark on this one!", "Date": "January 16, 2012"}, {"Title": "Picture Shows \"WI FI\", no brand, both not so.", "Author": "Dave", "ReviewID": "R2WM49ERCSF0IB", "Overall": "2.0", "Content": "Picture shows 'wi fi' logo, Amazon replied 'picture is correct', NOT SO! Plus phone is branded and has embedded software of branded carrier, and will not connect to major email accounts.", "Date": "December 7, 2013"}, {"Title": "One of the best mobile phones money can buy! I Love It!", "Author": "Mickey", "ReviewID": "R129UDMEBCYZYH", "Overall": "5.0", "Content": "I've had my phone for close to two years and I love it so much! If you would like to buy a smart phone but you don't want one or you can't afford one this is the phone for you!. It has a very responsive touch screen, a Qwerty Keyboard which I really love and adore, a 2.0MP camera which seems to be a 3.0MP one because it is so sharp and vivid, it has a bright display, the built-in speaker is awesome and clear, it is very cheap to what it offers and also light weight even though it has the extra bulk from the sliding Qwery Keyboard. The only thing that I hate about it is that it doesn't have Wi-Fi which is a great disappointment for me as I use the internet a lot and so I was even thinking of buying a smartphone to replace this phone but whenever I thought about it I felt very sorry for it as I know that it is not it's fault and so I didn't buy the smart phone. I fully hearted recommend this product to every one.I love it!", "Date": "June 5, 2012"}, {"Title": "MMS doesn't work in the US.", "Author": "D. vialva", "ReviewID": "R3M2NRWMXVK2M9", "Overall": "3.0", "Content": "The phone is very nice, although the MMS feature does not work in the United States. The phone is very light and sturdy but is kinda hard to text on since the qwerty key pad is very close together but other than those few things i like the phone.", "Date": "December 25, 2010"}, {"Title": "Limited abilities", "Author": "alex", "ReviewID": "R2A4Z40HCF7ZWX", "Overall": "3.0", "Content": "This phone has a great music player and looks nice but it has limited abilities.  You can't watch youtube or anything requiring flash.  If you are using TMobile network, then you have to use 2G!!! It is ok as long as you don't mind the limited abilities. Samsung could have done better than this. I bought this phone a few years back. I beeeeen got rid of this phone. I think I only had it 6 months.", "Date": "October 1, 2013"}, {"Title": "OK phone for temporary use", "Author": "E. Siegel \"siegelmom\"", "ReviewID": "R1W7HYWEWKNC9S", "Overall": "3.0", "Content": "Bought this  as a phone to have for use during international travel.  We travel to Israel regularly as our daughter lives there and decided it would be cheapest to own a phone that we can just buy a Sim card for while there.  We figured we could also use it if we travel to other countries.  The phone basically worked fine for calls and texting.  Nothing fancy.  It is not a smart phone, which we knew.  It was easy enough to figure out how to use it.  Was not crazy about the sound clarity.  Would not like it for my regular phone but good if you want a phone for just travel use.  Did not want to spend the money for an unlocked smart phone but  did miss having one at times to look up things as we were traveling.  The phone supposedly had some internet access but I could never access it.", "Date": "March 6, 2014"}, {"Title": "This Phone is very handy", "Author": "Cafefoxx", "ReviewID": "R3QL14PA976NP0", "Overall": "5.0", "Content": "I bought two of these as gifts for my brothers who do not love an all touch screen phone. I am glad that Samsung still have these sliders.Very happy buyer.", "Date": "January 16, 2014"}, {"Title": "Does what it says", "Author": "Chocolate Man", "ReviewID": "R1ZW5KICSMKKI3", "Overall": "4.0", "Content": "May not be the greatest phone out there, but at least it does what it says. Have had no problems so far.", "Date": "January 9, 2014"}, {"Title": "phobe works well", "Author": "Joana in Brazil", "ReviewID": "R1RNTKSICOAQCC", "Overall": "4.0", "Content": "It works well I just don't like where the buttons to receive a call is because often when it is in my pocket I can't get it out without hitting the reject call button", "Date": "January 8, 2014"}, {"Title": "Decent phone", "Author": "David R. Coppins", "ReviewID": "R3HTAAWPUXRFEK", "Overall": "4.0", "Content": "This was a gift for my wife. Seems to work fine, but since this phone is replacing an old Nokia it will take some time getting used to the Samsung format.", "Date": "January 6, 2014"}, {"Title": "It is a good one", "Author": "Harsha Amarasekara", "ReviewID": "R3S455JM9GTRFI", "Overall": "4.0", "Content": "It is good phone. I bought it as a gift. So person who received it, is happy with it. It has all the options she needs.thankzzz", "Date": "December 29, 2013"}, {"Title": "Very good for the cost, texting area not so hot though.", "Author": "R. Lamparter \"Raych\"", "ReviewID": "R14AK9CZQS15XY", "Overall": "3.0", "Content": "I ordered this as a replacement for a, I can't even use the words here, ATT GoPhone.  The touch screen is nice, and it's super touchy to use.  The slide function for the keyboard is good, but I have a hard time texting with the letters spaced so far apart.  I also have to press down hard to type and end up making a large deal of errors while texting.  My texting speed has also slowed down.However, for the cost, it's a good replacement.  The bluetooth feature works well for my hands free system in my car.  I don't use any other features on the phone, just talk, text, and voicemail.", "Date": "December 9, 2013"}, {"Title": "Great phone", "Author": "Maria", "ReviewID": "R3DP1IW5G2M1T", "Overall": "4.0", "Content": "I loved the phone, but I've realized it's better for me to have wi-fi, which this cellphone doesn't  have.However, it's a great phone.", "Date": "August 28, 2013"}, {"Title": "Very Good", "Author": "E. Jennings", "ReviewID": "R2IAZBPLG609RL", "Overall": "5.0", "Content": "The phone arrived way before the expected time in condition described by the seller; new with charger, samsung headphones and usb connector. The phone works well and I am absolutely content with my purchase. Would order from this seller (Yellow Deals) again.This phone is very appropriate for children between the ages 10- 15; it is not too much or too little.", "Date": "November 25, 2011"}, {"Title": "Great phone", "Author": "Steve", "ReviewID": "R26A76WMCGGHTQ", "Overall": "4.0", "Content": "I have had this phone for about 3 weeks. I use it as a phone and texting and it works great. The battery lasts several days between charging. I am very pleased with the general construction and operation of the phone. Sound quality is good. Reception is good. No problems.", "Date": "June 9, 2011"}, {"Title": "GREAT PHONE TOTALLY WORTH IT!!", "Author": "John", "ReviewID": "R1JF6KZ9DXFT3N", "Overall": "5.0", "Content": "I just recently bought this phone, its very compact and looks very strong. Very nice and comfortable keyboard. The touchscreen works perfect and many people say it shuts off by itself, i have not had 1 problem with this phonw", "Date": "December 24, 2010"}, {"Title": "DON'T buy this phone!", "Author": "Div J", "ReviewID": "R1H8BBT8O4PA9C", "Overall": "1.0", "Content": "This phone was horrible! The qwerty keyboard was very difficult to use because the buttons were hard to press, the date format was weird because it only had DD/MM/YYYY format which I'm not used to and the overall ease of use is very poor.There's nothing special about its features either. Also the phone got jammed so it was difficult to slide it. Overall I regret buying this phone and don't recommend it to anyone.", "Date": "February 20, 2011"}, {"Title": "i didn't get what i order", "Author": "tatou", "ReviewID": "R1YBSCR7TMAADZ", "Overall": "1.0", "Content": "i order the samsung b3410, they send me a blackberry instead which i don't want, i send it back and am waiting for my samsung, and i hope they sent me back the right phone. PLEASE DON'T MAKE THAT MISTAKE AGAIN", "Date": "December 25, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported.\nUnlocked Quad-Band GSM cell phone compatible with 850/900/1800/1900 GSM frequencies plus GPRS/EDGE capabilities\nQWERTY keyboard; 2 MP Camera 1600x1200 pixels; TFT touchscreen, 256K colors; Google Search, Widgets; SMS (threaded view), MMS, Email and Gmail\nStereo FM radio with RDS, FM recording; MP3/MP4 player; Stereo Bluetooth with A2DP; DNSe (Digital Natural Sound Engine); 3.5 mm audio jack; MP3 ringtones and downloadable games.\nTalk time up to 10 hours - Standby up to 640 hs.", "Name": "Samsung B3410 Corby Plus Unlocked Quad-Band Phone with Camera, Bluetooth, FM Radio and microSD Slot--International Version with Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41RX1iAgBQL._SY300_.jpg", "ProductID": "B003FMVW34"}}