{"Reviews": [{"Title": "it came like super friggen fast.", "Author": "asdfghjkl", "ReviewID": "R1BLB3AF70UHIU", "Overall": "4.0", "Content": "I thought the need of a proper review for this phone was necessary, so here you go.(0h and ps, this is a refurbished phone)So, I've had it for a few days now and its really nice.(oh and btw I'm a T-Mobile customer)I used it for a week w/o the T-Mobile sidekick plan, and 2 weeks w/ the sidekick plan.I have to split this review up into two versions because of the useage and non-useage of the sidekick plan.W/O sidekick plan:The phone is faster than with the plan, but you don't get the twitter and facebook apps, the e-mail, my-faves, the web and the I.M. services, but its still very usable for texting and calling.W/ sidekick plan:The phone is slower, but you do get 3G support for internet, the downloads catalog, the twitter & facebook apps, email, the suprisingly nice and fast (w/3G) web app, and the certain social networking aesthetic you get with the sidekick.Pros: 3G data, FB, Twitter and Myspace apps, GPS, Camera w/autofocus, keyboard, the aesthetics, and the screen, which by the way, is AMAZING.Neutral: the Bing GPS app isn't the best, but it does give you pretty acurate traffic reports and directions, and in the Twitter app, you cant RT stuff w/o having to retype the tweet. Battery life is OKAY, but if you leave 3G on all day, it will definitely die it before your day endsCons: when I got the phone it was kicked open and not in the plastic, which i thought was a little odd and the fact that the screen bezel wasn't snapped on back all the way kind of annoyed me.Overall: I would recommend this to T-Mobile users looking for a cheap, pretty new, nice phone, but not so much to other GSM users because without the sidekick plan, the phone is just meh.", "Date": "October 1, 2010"}, {"Title": "Sidekick LX 2009 Motorola phone", "Author": "E. Maalouf \"Sacramento, CA\"", "ReviewID": "RT7S7F94UGVH1", "Overall": "2.0", "Content": "This is previously a T-Mobile phone. It will work on AT&T; when you put a SIM card in.This phone is good if you have an unlimited text and data plan on it.If you don't, DO NOT buy this phone.Here's the problem(s) with it.I wanted to give it to my daughter to use as a phone and as a text keyboard with no internet access plans on her SIM card.As soon as you power the phone up, it will launch a software update screen that you cannot delete, bypass, or exit from.It will access T-Mobile's web site via AT&T; internet data plan and commence the update in the background.The AT&T; text package we have comes with \"use as you go\" data plan which you use when you send pictures only. Usually very negligible data is used monthly for few pictures. However, the Motorola LX launched the software update package in the background and used up 50 Megabytes of data to update itself at $2 per megabytes before I realized what was happening and shut it off then removed the AT&T; SIM card.It does that every time it needs to update itself and you cannot stop it. T-Mobile data and update information is embedded into the phone. This happens regardless of what network you use.Unlike my Nokia, this phone does not allow you to access your home Wifi so it can be used for the data/software update.I returned it yesterday.", "Date": "June 1, 2011"}, {"Title": "More than I expected", "Author": "xXxQueenC321xXx \"Christy\"", "ReviewID": "R731ZOA4Z5FVY", "Overall": "5.0", "Content": "It's a awesome phone must buy! I have it as a prepaid sidekick plan 1$ a dayno scratch no dents, no cons at all!!", "Date": "July 21, 2010"}, {"Title": "like brand new :)", "Author": "DaGeNiZ3:)", "ReviewID": "R1AJOK63KQNUW0", "Overall": "5.0", "Content": "okay ,i was freaking out when i had bought this item. i would literally pray everyday for this sidekick not to be a scam . and when it had came in the mail i was so happy to open it . so everything came in veryyyyy good condition . the phone is in very very very mint condition . i honestly recommend . even though its a pretty old phone . sidekick are the best literally . and i wanted one to have memories of the sidekick for when they arent sold anymore. well the only bad thing was that it didnt bring the usb cable for it but , i have like 50 of those in my house so it wasnt really a big deal . but either then that i truly recommend to others .im looking forward to buying again .", "Date": "February 19, 2011"}, {"Title": "Amazing gadget", "Author": "Slayck", "ReviewID": "R30624H93BTV6T", "Overall": "4.0", "Content": "I have received the sidekick lx 2009 to UAE and it is amazing...surely unlocked my country's phone provider directly worked but the the 3G package didn't work at all...It can't connect to 3G... I am not sure if it is the unlock or there is something else missing.If anyone knows about my problem then inform me please.But other then that it is an amazing gadget... and other drawback for unlocked lx 2009 if battery fails on you thenall your data are LOST and not all of them can be saved into the Memory Card.", "Date": "August 14, 2010"}, {"Title": "ehhh?", "Author": "TJmarek505", "ReviewID": "RL94M1E9K0ENR", "Overall": "1.0", "Content": "the phone was ok, it has a good wide key board for texting but thats about all it is good for. They tried to hard to make it cool and quick with all of these confusing combonations of buttons and keys to get you to places. I think the only usefull one was the one getting you to the quick find, anbut d also the phone is rely slow. my phones 3.5 mm headphone jack didnot work and i found out that it was a pretty common problem.so if your looking for a phone for texting AND THATS IT then this a good phone for you but if you want a phone for any other reason then DO NOT GET THIS PHONE!!!", "Date": "March 7, 2012"}, {"Title": "T-Mobile Sidekick 2009 Review from an AT&T; Customer", "Author": "Oddishes", "ReviewID": "RQ12B1E5EDVH3", "Overall": "5.0", "Content": "I recently ditched an Android phone (along with a $100 per month plan) for a $25/month talk & text plan on AT&T.; I was previously a T-Mobile customer, and before the Danger servers went down for good, I used a Sidekick Slide, and the 2008 Gekko. I am not new to Sidekicks at all. That being said, this phone is excellent to use unlocked on a talk & text plan. I even changed the settings in MMS so that picture messages DO work on AT&T.; The only con to this phone is that the data will NEVER work as they're set up to only connect to Danger servers, and those are gone forever. It has nothing to do with the carrier, or your plan. The servers are never coming back, so there will never be data functions on this phone. As far as what I'm using it for, it is perfect. I bought this phone because I missed the 5-row QWERTY keyboard and the general layout of the Danger OS. (I was originally going to break out my 08 and unlock it, but it turns out, unlocking a Sidekick costs like $40 and a brand new one was just a little more, already unlocked.) Contrary to what a lot of people will tell you, I will say out of personal experience:The data saved on your phone DOES NOT disappear when you power off and back on. I couldn't tell you if it remains after you remove the battery, I haven't tried that, but your texts, contacts, settings will all be there if you restart the phone.In the SMS/MMS inbox, names ARE displayed next to your text. I read a lot of reviews claiming that the only thing it shows is the mobile number (and since cell phones, who has phone numbers memorized anymore?) But on mine at least, that's just not true. There is a name in the recipient field.Text notifications: THEY WORK. That's another claim I've heard all over the place- that text vibrate and notifications don't work. That is a defective phone, or one that has not been unlocked properly. Notifications DO NOT rely on data.Battery life: I have had this phone for 2 days. After the initial charge to 100%, it lasted 40 hours and the phone was still 80% charged. At this rate, this thing will last a freakin' WEEK unless you use the media player frequently. (And that's with sound AND vibrate. I text a lot so I get a lot of alerts.)As far as email, you don't get data so you can't use the client, but you CAN send emails as MMS, just enter an email into the recipient field. I even set up Facebook to text me notifications and I'm pretty much covered. I still can't believe I paid 100/mo for an Android plan just so I could check my Facebook!And finally, the best part of this phone: unlike all previous Sidekicks, you can INSTALL YOUR OWN RINGTONES AND NOTIFICATIONS SOUNDS WITHOUT THE USE OF THE DOWNLOAD CATALOG. All you have to do is send it to your MMS through email (mine is MYNUMBER@att.mms.com or something like that. It goes to the MMS inbox) with the tone that you want attached, and you can select the attachment in the inbox which will give you the option to import it as a ringtone. HOW AWESOME IS THAT??I highly recommend this phone to anyone who wants a phone for talking and texting. In my opinion, this is probably the best phone EVER MADE. No joke. I seriously will probably order 2 more just in case I ever break this one. And to think I almost didn't order it just because of all the reviews made by people who were just unhappy they didn't do a little research before they bought the phone!", "Date": "February 5, 2012"}, {"Title": "Calling all buyers!!!!", "Author": "Ollyruss90", "ReviewID": "R3PZ7A6UAAETJ9", "Overall": "5.0", "Content": "Love this new phone I bought even though it was released in 2009. It looks really sophisticated and cool swiveling screen and rolling ball buttons. Love the feel of the keyboard cant make any mistakes but my problem is my hands are to small to stretch over every key hehe overall review really great phone.", "Date": "September 22, 2011"}, {"Title": "Great phone for great price!!!", "Author": "Jyvazquez", "ReviewID": "R4J0SR8AXJ9HM", "Overall": "5.0", "Content": "It came sooner than it said it was. came like new the package had all the seals. My copy came with all accessories, Im a current tmobile customer so I just popped in my Sim card and I was ready to go after a few days of playing around with it I decided to go to tmobile and get the $15 dollar internet package since it had apps such as twitter facebook myspace and built in gps. Overall this is a great phone no problems so far I think it is a great phone for the price it has so many things in it it came basically like new it doesnt even look like its refurbished absolutely no scratches or scuffs great phone!!!", "Date": "December 24, 2010"}, {"Title": "This sidekick can get web!!!", "Author": "Joe", "ReviewID": "R17CEI1BXF7ZYD", "Overall": "5.0", "Content": "This is the best deal ive gotten in a while, extremely fast shipping had the phone in my hands the next day!!! you can also get internet on this phone by changing the apn settings because it has opera browser!! extremely pleased with this purchase!!!", "Date": "January 27, 2013"}, {"Title": "Sidekick fanatic", "Author": "EV", "ReviewID": "R1K5C1OM50EYE1", "Overall": "5.0", "Content": "This came with everything, and was delivered much faster than expected. Its one of my favorite phones. But, buyer beware. T-Mobile is discontinuing all data service for non ANDROID Sidekicks at the end of MAY 2011. All in all, I love this phone.", "Date": "May 20, 2011"}, {"Title": "my daughter loves it!", "Author": "rishdeeze", "ReviewID": "R21NAZV7M3K5C8", "Overall": "4.0", "Content": "This item was all rage and my teen daughter had to have one. Every since I've gotten it she has not put it down. She said \"This is one of the best phones I\"ve ever had\"!", "Date": "March 28, 2011"}, {"Title": "cmankows", "Author": "cmankows", "ReviewID": "R3CRKNUNM6HD9V", "Overall": "4.0", "Content": "I really love this phone ...BUT if you want data service you have to have a regular service NOT prepaid and T-Mobil is not going to service this phone anymore, however its interesting to use the apps reguardless and the price is great. I just transferred my SIM card, kept my cell # and phone book and all my data transferred no problem. I think this is a fun phone.", "Date": "March 15, 2011"}, {"Title": "Sidekick Lx 2009 Review", "Author": "Robert", "ReviewID": "R27YOM6XFGGKPF", "Overall": "4.0", "Content": "It came when I expected it to. A day early which I liked. It said it was brand new so I expected everything to be in the box but 2 things were missing..the 1gb microSD card and the sim card. But non the less I didn't care because I had an 8gb already and I bought an ATT sim card for it anyway so both of those are useless to me if I had it anyway. When I put my friends straight talk sim card in it, it became super slow and was stuck on the registration screen. I tried pressing menu + l to bypass it but that didn't help much. I'm just thinking it was the sim card because it worked when I put my friends ATT sim card in there. Im pretty satisfied with it. I'd recommend it to anyone though. Good buy I think!", "Date": "May 8, 2011"}, {"Title": "BRAND NEW", "Author": "Alwin", "ReviewID": "RMTL1HH5F4N1O", "Overall": "5.0", "Content": "I was a bit worried about getting this at first because I was unsure of the condition, but everything came brand new! Each part was wrapped and/or sealed in plastic, and it even came with the original carrying pouch, charger, USB cable, manual and quickstart poster. battery life is great, and the phone is practically new. I've had it for about a month now and it has no issues. Just remember that the Danger servers are gone forever, so no MMS, or internet. and customization is a bit of a pain compared to all the new phones out there.", "Date": "March 10, 2013"}, {"Title": "I Didn't Think I Would End-up Liking A Sidekick!", "Author": "An Ikearat's Brain \"Tom\"", "ReviewID": "R3JMLIYZI3FQ0T", "Overall": "4.0", "Content": "I have seen these things around from the days of the first \"Danger Hiptop\" models... the ones that looked like slabs of plastic with little kids all over them. :)I never thought I would grow to actually like one of them!I was looking for a temporary phone to cover me while I deliberated on taking the iPhone plunge. I have recently become disenchanted with Nokia after getting the cold-shoulder from their customer support people.The Sidekick LX (2009) model does the two basic things I needed so I bought one and stuffed it in my pocket. It has been almost a month and I have enjoyed this phone much more than I thought I would. (geez, so many \"I\"s :)Yes the browser is limited to only a few of T-Mobile's internal sites and there's no IM (instant messaging?) but the text application and hardware keyboard are a pleasure to use! The camera is poor but I'm spoiled (Canon 20D) and the thing is \"noisy\", heh it's a kid-phone it's sposta be noisy.There is a lot to say positive about this phone, good battery life, very good display, nice loud speaker phone, solid clicky buttons on the outside and good tactile feel on the keyboard. Trackball! Micro SD card support, and good old-fashioned mini USB connector for charging and data transfer.I have found some work-arounds for a few limitations presented by the lack of a dedicated server (T-Mobile).1.) you can \"send file\" over Bluetooth to the phone including .vcf address book files allowing you to populate the Contacts application on the phone without having to enter each contact manually.2.) you can push \"Themes\" to the phone allowing you to customize the various system screens to your liking. The display is of good enough resolution to be used as a \"blotter\" containing notes and other junk you want visible all the time.3.) there are several web sites on the net with support and resources for this phone. The kids like it so there's \"activity\".If you are looking for some fun with cell phones and are not looking to become an Android Red-shirt or a Smartphone Jedi, then a Sidekick might be what you are looking for!", "Date": "January 30, 2012"}, {"Title": "Good idea - not such a great product.", "Author": "Grobo", "ReviewID": "R1M3VN77922EPJ", "Overall": "2.0", "Content": "Just to be clear, this review is about the Sidekick, not the store.  Received this and seemed to work well for about 2 weeks.  The problem started with the phone freezing up.  Could not power down, as all the buttons were disengaged.  Tried holding down the power button...nothing.  The only way to reset it was to take the battery out.  However this erased the contacts information.  Worked ok for about a week, then it happened again.  Went through the same set up.  Then it seemed like it would not go more than 2 days without this happening.So am sending this back.  Perhaps it is because this was a defective model or that the refurbishing did not take.  By the way got this through Blue Tek through Amazon and they have been really good in taking this back.  I would definetely do business with them again.", "Date": "November 8, 2010"}, {"Title": "Who doesn't want a sidekick", "Author": "doctorofdelight", "ReviewID": "R1SA3WYTMRT7TS", "Overall": "4.0", "Content": "I wanted to get a sidekick again just to have a retro and iconic piece of hardware to use as a mp3 player. Pros: Cost only 40; Just inset mini sd card for Gbs; Easy to load music. Cons: battery life. Overall good investment and people are still in aww when i flip my mp3 player.", "Date": "March 1, 2014"}, {"Title": "problems", "Author": "Matthew Stanger", "ReviewID": "RJGYTZ5QPD06M", "Overall": "2.0", "Content": "The phone was great except for a problem with the memory card slot. I could not save photos and it erased my phone book. I hope the replacement works!  Breed provided great customer service!", "Date": "May 30, 2013"}, {"Title": "3/5 standard phone but outdated and little support", "Author": "SFmania", "ReviewID": "R1NYI0NZMELBSR", "Overall": "3.0", "Content": "Cool phone and everything but they discontinued the service. You can call, text, music, pics,record vids, but no internet, no gps, no data services, no new games, no downloadsIt also is kinda annoying when you turn on the phone after shutting it off, you will get a registration prompt everytime.", "Date": "March 21, 2013"}, {"Title": "Sidekick Phone", "Author": "Steven Shriver", "ReviewID": "R1O5103U6UQU3A", "Overall": "5.0", "Content": "Bought 2 so far and will continue to purchase these. Looking at purchasing another one of the same thing for a family member.", "Date": "March 18, 2013"}, {"Title": "side kick", "Author": "benjamin", "ReviewID": "R271BMGKZ2Z01H", "Overall": "1.0", "Content": "these phones suck! i bought three of them already and they all have given me issues. randomly deletes my contacts, shuts off. just suck!", "Date": "February 9, 2013"}, {"Title": "The Sidekick LX", "Author": "Jessica Conrow", "ReviewID": "RIIHXHZRHYC5L", "Overall": "3.0", "Content": "When I first got my phone, I loved it and was very excited. As time went by, I found some problems with it. When I went to type in a number to call someone, it would sometimes not show the numbers and if it did it would also sometimes not call the number dialed. Overall, the phone is amazing.", "Date": "January 21, 2013"}, {"Title": "amazing", "Author": "tamas vajda", "ReviewID": "R1TCCJBK0OSUMO", "Overall": "5.0", "Content": "honestly, there's nothing to say really other than its good. I bought this because in canada we dont have sidekicks and never will and from the looks of it neither will the states but whilst they lasted they were amazing!", "Date": "December 18, 2012"}, {"Title": "Perfect.", "Author": "Kimo M.", "ReviewID": "R21SG20HC1MK2H", "Overall": "3.0", "Content": "Although not in its original packaging, it did come with the cables, SD card, charger, manuals, and the device itself. It was in perfect condition and worked excellent. The only problem I had was with the text messaging. This device will only allow you to have 100 messages max! That includes messages in the inbox, sent, drafts, and trash - only one hundred allowed altogether. This struck me as odd for a device with such a large keypad, focused on social aspects.", "Date": "June 28, 2012"}, {"Title": "sidekick lx 2009", "Author": "787G", "ReviewID": "R21C0QS0UAU0YW", "Overall": "5.0", "Content": "great phone and great service. i ordered this a long time ago and i still have and it still works.", "Date": "April 26, 2012"}, {"Title": "I like it", "Author": "LEE", "ReviewID": "R3KDR2AQNB7FT3", "Overall": "4.0", "Content": "Good: In new condition as described.Bad: Short battery life (2days at most), no usb cable as described, can't change alarm tone.", "Date": "February 24, 2011"}, {"Title": "Pretty Nice", "Author": "Olivia", "ReviewID": "R2WL3JHSB7Z96W", "Overall": "4.0", "Content": "Overall, this product has done pretty well. I just recently got it, and the only real complaints i have is that sometimes it's very slow, and occasionally it'll open when i don't want it to.It has good graphics and sound, and it's definitely a step up from the Sidekick Slide i used to have.I'd say its a great deal for the price.", "Date": "January 26, 2011"}, {"Title": "Right On Time :-]", "Author": "Richi", "ReviewID": "RHZ5H4JQB0OIX", "Overall": "5.0", "Content": "i was expecting it tomorrow becuause it didnt come during the day but i look out my door & there it was...its perfect & on time ...thanks alot", "Date": "December 8, 2010"}, {"Title": "the Sidekick", "Author": "The Storm", "ReviewID": "RYYPUXKUAXPLG", "Overall": "5.0", "Content": "This phone is very fast and easy to use i dont use 3g or internet i came from the htc tytn 2 and this phone is much faster but the no wifi and sms is not as good but texting is allot more easy with the keyboard more spaced out it is allot harder to miss spell things i would recommended this to almost anyone. and i am a high school student it is great for us younger ppls.", "Date": "June 4, 2011"}, {"Title": "Hmm", "Author": "Whittier207", "ReviewID": "R2IWO3EF8RZM7C", "Overall": "3.0", "Content": "I have to say that this phone came in on time and in the condition stated, it worked great for the first couple of weeks but now i have been noticing some glitches such as the screen will freeze or sometimes all of my numbers on the phone will be erased. I also cant send or recieve picture messages or use the internet on this phone. Good phone to text and call but other then that i wouldnt recomend", "Date": "March 2, 2011"}, {"Title": "Failure", "Author": "Ombet", "ReviewID": "R2NYVYS3LLV3W9", "Overall": "1.0", "Content": "I have a horrible experience with one of the vendor of amazon which is the blutek. Please don't buy anything from them because if something happens to the item they replace it or even offer to fix it. I wasted $155.00 for cell phone for a month and a half and got broke . I'm thinking of reporting them to BBb .", "Date": "June 18, 2011"}, {"Title": "very good", "Author": "Zainab O. Banire", "ReviewID": "R1IWBM9CYMQHIH", "Overall": "5.0", "Content": "thank u so much am sorry but i have done this reviwe am sorry u did not get it thanks again", "Date": "February 5, 2011"}, {"Title": "Good but...", "Author": "Noms Services Ltd \"Noms\"", "ReviewID": "R2154S2ORYMCLU", "Overall": "3.0", "Content": "The item is cool in most aspects. You wont regret buying it if you can deal with1. Short Battery life2. Can't browse the internet if not on T-MobileOtherwise, everything is cool. You can chat on facebook, yahoo, etc It does its work well.", "Date": "June 15, 2011"}, {"Title": "Missing Sync Cable/Wrong user manual", "Author": "Ekul", "ReviewID": "R3CPHM4AGGXMXY", "Overall": "1.0", "Content": "The phone came and everything works fine so far. The micro USB to USB cable was not in the box and when I tried contacting the customer servicer to get the cable, the only thing they would do was let me return the item for a refund of my money. Poor customer service and a missing accessory.I also just realized the instruction manual is for an earlier sidekick model, possibly the original sidekick. That is A LOT of help...", "Date": "February 2, 2011"}, {"Title": "Only for Tmobile customers", "Author": "D. Gilliam \"Dark Brunette\"", "ReviewID": "R3I0BQGKAM5JAE", "Overall": "2.0", "Content": "I was extremely happy when we received it in the mail.  It's a very nice phone.  However, it doesn't work with AT&T; services.  I have sent it back for a refund.", "Date": "January 23, 2011"}, {"Title": "ITs good", "Author": "Tony Xue Taing", "ReviewID": "R31UJ2JRDL3TM6", "Overall": "2.0", "Content": "Its a nice phone and everything but do not purchase it if you intend on using any internet. There is no internet support for it at all", "Date": "September 13, 2011"}, {"Title": "no more sidekick service after 5/31/2011", "Author": "J. Nault \"gangsta\"", "ReviewID": "R2E6M05CPI0OIE", "Overall": "1.0", "Content": "After May 31, 2011 T-Mobile will be deprecating data service to old sidekicks. You will not be able to browse the web, youtube etc. You can make calls, receive text- but that's it.no I didn't do it. I don't work for them. But i have 2 sidekicks and just got this notice.No more data service for older sidekicks anywhere everywhere no you're not special. sorry.", "Date": "March 3, 2011"}, {"Title": "Not So Much", "Author": "mdiffee", "ReviewID": "R3HZGV80UZUHAI", "Overall": "1.0", "Content": "I bought two of theses for my kids. They are not happy with the phone. We have not been able to switch the phone over to ATT. We do have phone service but the phone does not save any of their contact information.", "Date": "July 2, 2011"}, {"Title": "cell phone", "Author": "customer", "ReviewID": "R1FQGLVA9NW8J5", "Overall": "1.0", "Content": "I am very disatisfied with this product. After several weeks I am unable to use the product as the swivel screen wont close and we cant even get the money back or a replacement.", "Date": "March 21, 2011"}, {"Title": "Sidekick LX 2009", "Author": "BibHA", "ReviewID": "R1RGGZ9HF4VEGC", "Overall": "3.0", "Content": "A very nice phone to hold and own. But it's just it for users not using T-Mobile services.My Review about the phone;- Everytime I restart my phone, welcome screen appears and says registration data which will never end as i tried to wait and it never end.- You can't customize your caller and sms ringtones except for the tones that are originally in the phone- 3G is not working for international users.- Ringtones and games are only can be downloaded through download catalog (which I can access as I am an international user)Well, the only things that I can use on this phone are:- Calling,- SMS- Mp3- Games (free 1 games are provided in this phone)other than that are useless.Phone services: Overall, this phone is just a phoneLooks : 5stars :)", "Date": "November 17, 2010"}, {"Title": "Returned Unopened- Full Refund Request Granted", "Author": "John Gracchi", "ReviewID": "R1ITJB12IRF3KQ", "Overall": "1.0", "Content": "It is out of Date, the write-up's and information later obtained allowed me to request a refund through AMAZON and item was returned unopened!", "Date": "December 27, 2011"}, {"Title": "gsm unlocked", "Author": "jason0", "ReviewID": "R2317AYXVX7NAJ", "Overall": "3.0", "Content": "please i want to know if this fone can work with all gsm operator like a worldwide fone cause am very interested to buy itthanks you to answer me", "Date": "July 6, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile Not all carrier features may be supported\nThe exterior has a soft-touch finish that won't slip out of your hands\nIts 1250 mAh lithium-ion battery is rated at up to 55 hours of talk time, and up to 192 hours (8 days) of standby time\nRuns on the 850/900/1800/1900 MHz GSM/GPRS/EDGE frequencies\nMeasures 52 inches long x 24 inches wide x 063 inches thick\n3.2-inch TFT LCD display\nIt will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint\nThis unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile Not all carrier features may be supported. The exterior has a soft-touch finish that won't slip out of your hands", "Name": "Sidekick LX 2009 PV300 Unlocked Phone with 3G Support, QWERTY Keyboard and GPS - No Warranty - Gray. This phone does not have internet capabilities.", "ImgURL": "http://ecx.images-amazon.com/images/I/51hijEFWBnL._SX300_.jpg", "ProductID": "B003UIO5DC"}}