{"Reviews": [{"Title": "One of the best phones I've had!", "Author": "K. Unger \"Sphere\"", "ReviewID": "R3DXBPDK3YQ22R", "Overall": "5.0", "Content": "The Sanyo Juno from Boost is one of the best phones I've EVER owned. I would have been totally inseparable from it had I not needed to upgrade to the Blackberry for my PT school program.PROS:1) AMAZING service! Where I live is not known for good cell phone service, yet the Juno got at least a bar or two in most places I went.2) Fast boot up/shut down, easy to use interface.3) Great text and email interface.4) Sturdy keyboard and build overall.5) Great for those who are looking for a basic phone that can text, call, and email without a problem.6) Loud ringers.7) Battery life is GREAT, the phone regularly lasted a week or more between charges!8) Great screen.CONS:1) The internet is not great- I found it necessary to download mobile apps and links to take me to the mobile version of websites I wanted to go to.2) You cannot upload or create ringtones.3) Camera is average.Overall, I highly recommend the Juno. I LOVE this phone and would not have considered switching were it not mandatory for my PT program and many jobs in the health profession.", "Date": "February 7, 2011"}, {"Title": "amazingly good phone for the price", "Author": "Jen C.", "ReviewID": "RC0BTR4QYCR87", "Overall": "5.0", "Content": "outstanding sound quality. This phone may be \"old\" school QWERTY, but its speed in dialing, accessing contacts, and sending text messages with a minimum number of key presses far exceeds the abilities of any smartphone --- IPhone, Android or otherwise!!!!", "Date": "August 17, 2011"}, {"Title": "Well worth the price", "Author": "milfybaby69 \"milfybaby69\"", "ReviewID": "R28ZH4NSB3WAE3", "Overall": "5.0", "Content": "i purchased this boost mobile juno i love the web browsing,instant messenger and the text and pic sending for the pixels of the camera it does take real good pictures the keypad needs some getting used to warning if you have fat fingers it will double type so carefully type your messages its the whole package right at your finger tips for 50 bucks a month unlimited through boost what a sweet deal", "Date": "September 7, 2010"}, {"Title": "Better than expected", "Author": "kiera2001", "ReviewID": "R3KUF9RSRTO52Z", "Overall": "4.0", "Content": "Nice phone for the price. For someone who does not require a smart phone this phone is everything I need and durable too. I'm glad I took a chance and purchased this one.", "Date": "January 31, 2012"}, {"Title": "I LOVE MY SANYO JUNO BOOST MOBILE PHONE!", "Author": "Sweetessence", "ReviewID": "R1RJUJ4A9P4JGU", "Overall": "5.0", "Content": "I couldn't wait for my AT&T; contract to expire in November 2011.  I knew for a year i wanted to go to Boost Mobile as you pay less for soooo much more, without a contract and SHRINKAGE!!!  I thought i wanted an android phone.  I was able to buy the newest Samsung Ultra android Boost Mobile phone from BB at half off ($115) but realized that i didn't want to pay that much either for a phone.  I knew i wasn't really interested in the latest and greatest in a phone.  I am a talker and a texter... the internet and all those apps does not matter to me.This phone fits the bill and i love it!  My last phone had the slide out keyboard for easy typing but i've always loved the blackberry format in a phone but don't like the blackberry cost at $60 a month from Boost.  I pay $50.  I feel proud to pull out this phone.  My phone is not my life but a source that connects me to people when i'm on the go and when i'm needed.  I have on occassion taken pictures with this phone and sent them via text and email right away from the phone... i have to say that is cool.For $39.99 this phone is awesome for all you can do with it.  The quality of the calls is excellent.  The text goes through quickly, numerous ring tones, phone doesn't get hot, connection to browser is okay and the battery is pretty good too... of course if you're having many long conversations in a given day yes you would need to charge that puppy each day.This is a great phone for children and adults alike... yes i am an adult and I Love my Sanyo Juno!Now i'd love a rubber case for it.Be well.", "Date": "December 2, 2011"}, {"Title": "EXCELLENT BUY!!", "Author": "BLESSED", "ReviewID": "R4O2GH88HR1H0", "Overall": "5.0", "Content": "I PURCHASED THIS PHONE THINKING THAT I COULD JUST PUT MY SIM CARD IN IT AND GO WITHOUT A BUNCH OF HASSLE OF CALLING BOOST MOBILE AND SWITCHING MY NUMBER OVER. WELL TO MY SURPRISE IT DOESNT TAKE SIM CARDS SO I HAD TO SWITCH MY INFO OVER ANYWAY BUT I DID NOT GO THROUGH ANY HASSLE! ALL WENT SMOOTH AND THE PHONE IS A VERY GOOD PHONE SO I DO NOT REGRET IT. IT WAS BRAND NEW IN THE BOX. IT ALSO WAS SHIPPED QUICKLY AND WELL PACKAGED.", "Date": "October 4, 2011"}, {"Title": "many featured phone", "Author": "OH THE LOVE TO READ \"NEE NEE COLLECTION\"", "ReviewID": "R17ELTCKV16L1P", "Overall": "5.0", "Content": "this is the best phone ive bought so far. i like that a lady says the person name on all incoming calls and recite the numbers as im dialing, i dont have to go into contact information to dial a contact other phone number, the picture quality is good. Im not addicted to phones, im hapy as long as im able to be reached so features arent important to me but after buying this phone im beginning to like extras. I was also able to buy a pink rhinestone cover case for this model, i can continue to say sweet things about this phone but dont want to go on and on so just know i like it!", "Date": "August 8, 2011"}, {"Title": "sanyo juno phone from amazon.com", "Author": "dannielle", "ReviewID": "R125AGTLI3FQVL", "Overall": "4.0", "Content": "my new juno phone works very well and the battery has a long time frame before  it needs to charged. I do wish the buttons were a little bigger but thats just the way phones are these days.", "Date": "January 7, 2012"}, {"Title": "A great phone!", "Author": "Shailah", "ReviewID": "RHTNVFR51RBMS", "Overall": "5.0", "Content": "I really like this phone. It's sleek and small and navigation is quite simple. I wish the keyboard was a little bigger, but the size is average for a cell phone. The screen is pretty large and and a great size; it displays texts quite clearly.Activating the phone was fairly simple, too.I was very pleased to discover that this phone had some limited internet access. You can check your email (various accounts, even, if you have them) and post to various social networking sites (such as Twitter and Facebook, for example) using their mobile applications. I don't think the phone offers the ability to search the web but you can check various things when you're on the go, which is perfect for me.About BoostMobile itself--at first, payment is a bit pricey (I went with the monthly plan), but if you consecutively pay on time for six payments then the price goes down from $50 a month to $35 a month. Basically, they reward loyalty and on-time payments, which I think is a very good deal.", "Date": "October 3, 2011"}, {"Title": "I love this phone!", "Author": "J. Lizana", "ReviewID": "R1L7D1YGWIHZ93", "Overall": "5.0", "Content": "This is the best phone i've ever had!  It's very easy to use, which was the main thing I was looking for along with a QWERTY keyboard and ability to check mail.  I do alot of talking, texting and can very easily check my mail.  Great phone and service especially for the price.  I bought mine from the Boost mobile website for 29.99.", "Date": "July 7, 2012"}, {"Title": "Great Phone", "Author": "Creeper", "ReviewID": "R13NBGCGHS327L", "Overall": "5.0", "Content": "This phone is compact,efficient and handles my daily needs.It also has great features and beautiful pictures.It is not expensive like alot of the others.", "Date": "February 25, 2012"}, {"Title": "My daughter is totally enjoying it!", "Author": "Salon Kelley \"Jalins Addictions\"", "ReviewID": "R3B9ZNTJAEAMQ", "Overall": "4.0", "Content": "I bought the Sanyo Juno for my teen daughter for a Christmas present and she has no complaints. Me myself have only one, and that is, that the keyboard is so tiny.lol I was using her phone to send a text and I kept hitting other keys  bc they are so tiny and close together. And I had to keep pausing to backspace for correction..which cause me to vent a little.lol Looking at it, that can be view from me having a character problem of not having good patience. :)Anyways, the phone is a really cool phone, Esp for the price! Please let me give a shout-out to Amazon.com for shipping it right off that I received it just in time for Christmas! WTG guys!!!", "Date": "January 13, 2012"}, {"Title": "Cute - but doesn't work!", "Author": "roli523", "ReviewID": "RO716RY9P8OK4", "Overall": "2.0", "Content": "Ordered the pink Samsung Juno directly from Boost Mobile in Nov. as a Christmas gift for my 11 year old daughter.  Imagine her excitement at opening it, and then her major disappointment when we realized that she could barely hear anyone when they called her.  It sounds so far away, and after adjusting everything & having customer service repeatedly reboot it, still doesn't work.  Such a shame as it's a cute phone & perfect for a preteen - I think we just got a dud. Customer service this morning at Boost was just awful!  Basically told that since it was purchased over 30 days ago (have they ever heard about buying ahead for the holidays????) ... too bad, we are out the price of the phone, the cover I got to go with it, and the $50 I paid for the first month of service (even though it was not activated until Christmas day.)  Very bad customer service in my opinion - I feel they should stand behind the defective product they sold us.  We have a VERY disappointed child here, and they could care less.  Definitely would not recommend this company to anyone (not to mention it is nearly impossible to reach a real live human at customer support!)", "Date": "December 26, 2011"}, {"Title": "Phone Is OK", "Author": "Lucifer", "ReviewID": "R1XU3ZKYQ45R4C", "Overall": "3.0", "Content": "Got the phone only cause Im trying to keep my number I have had since 2002 I believe. I have another phone but don't really like to give the number out. The Juno could use an antenna. Always had good service with Boost Mobile on the last phone. Juno hardley gets bars. Serving its purpose, I still got my number.", "Date": "November 12, 2011"}, {"Title": "Gift for Mom", "Author": "Ms. ThiqCaramel \"\"The Voice\"\"", "ReviewID": "R1VMTK8I3BRDWJ", "Overall": "5.0", "Content": "We bought my mom the babyphat phone a few years back and it just died on her recently. It was the same Juno phone but in pink. We got the phone quicker than expected and set up was really fast and easy. The only set back is that these phones don't have SIM cards so you have to find a Radio Shack or Boost Mobile store to take the info off of the old phone to apply to the new one. Mom loves it so that is all that really matters at the end of the day.", "Date": "January 7, 2014"}, {"Title": "great", "Author": "gerri flint", "ReviewID": "R3RG82CFE9KVJQ", "Overall": "1.0", "Content": "my cell phone died  after 2 yrs and i needed one  fast  i used my swagbuck points  to get amazon gift cards  to get this  . the camera on it is not great  so will be looking for a new camera  next.", "Date": "December 16, 2013"}, {"Title": "Really love this phone.", "Author": "James D. Washington", "ReviewID": "R2PVH37YRLTPWO", "Overall": "5.0", "Content": "Phone for the wife and she has fell in love with the phone. This is her second one and could not find one anywhere else.", "Date": "December 3, 2013"}, {"Title": "What a lemon.............", "Author": "Jay B", "ReviewID": "RYOYEBKLCBJMO", "Overall": "1.0", "Content": "This phone was not a good buy for me. I purchased this phone in Sept. 2011. By June or July of 2012, the charging port stop working. I sent it in to the company for repairs. It was sent back to me in working conditions. About three months later, the original charger stopped working with the phone. I had to purchase another charger. On October 4, 2013 was the last time I was able to use this phone. As of today, I have a blank white screen. I can't make or receive calls. After taking the phone to a Boost Mobile Store, I was informed by the unconcern sales clerk, that I needed a new phone. The funny thing about this is my bill was down to $40.00, now whomever my next carrier is, my phone bill will not be this low. This just makes me wonder, is Boost Mobile making certain phones to last a certain amt. of time in order to have customers come back and purchase more expensive phones and plans?.......", "Date": "October 24, 2013"}, {"Title": "Cell phone", "Author": "J,  Hunte \"The Nans\"", "ReviewID": "RHQGMPBJKK3YL", "Overall": "3.0", "Content": "It's okay for granddaughter.  wanted an android but settled for this. She seems to be content with it.  Thanks for all.", "Date": "October 8, 2013"}, {"Title": "Cool Looking Cell Phone", "Author": "Sandi  K.  Walker", "ReviewID": "RQ4JJ4L24PCP2", "Overall": "3.0", "Content": "I was so excited to get the phone.When it came the Number Butons are too Small for my fingers.", "Date": "September 8, 2013"}, {"Title": "Works fine for my purposes", "Author": "Judy Ranney", "ReviewID": "R8KWVZI5VNIUZ", "Overall": "4.0", "Content": "I am of a certain age where I do not want to be trapped/addicted to a smart phone, so this \"dumb\" phone is great for me. I do need it for texting, and it's got a great little keyboard. I am female with arthritic thumbs, and I can still keep up with the young folks using this keyboard.The camera sucks, as has been noted. But I still use an actual camera, so I'm not disappointed that the photo quality doesn't match up to National Geographic. It's easy to figure out and has a great instruction book.", "Date": "September 1, 2013"}, {"Title": "Just Love My Sanyo", "Author": "Cee \"Gen\"", "ReviewID": "R32QDM4H9DJ6G", "Overall": "5.0", "Content": "I didn't like the android that I had it kept getting hot and it was brand spanking new, so I took the battery out of it, threw it on the dresser and ordered what I felt was right for me.", "Date": "August 29, 2013"}, {"Title": "Affordable. Works great.", "Author": "Juanita", "ReviewID": "R2UHH4D9F8NYNF", "Overall": "5.0", "Content": "this phone is a great price. I'm a simple girl, all I needed was to call and text and this phone does just that. The camera isn't great, it only holds about 50 pictures, but again, i'm a simple girl. Nothing wrong with it yet, also, i've dropped it a billion times, and it has never failed me once.", "Date": "June 25, 2013"}, {"Title": "Pls see below....comments", "Author": "Sandy", "ReviewID": "R771UXRJ08VFA", "Overall": "5.0", "Content": "Its simple.  It meets my lifestyle and love the awesome color.  It has enjoyable ringtones and features that are self explanatory to use, as abc.Thank you for the sale then and in the future.With a smile,Sandy", "Date": "June 18, 2013"}, {"Title": "I love this phone, I've had it 3 years now.", "Author": "Alicia Phillips", "ReviewID": "R2CTJEX6RQ99E9", "Overall": "5.0", "Content": "I have used this phone for 2 years, switched to an android phone & do not like android phones, they're very unreliable so i'll be switching back to my trusty old Juno. Great phone for the purpose of having a phone when you need to make a fast phone call.Also, I had this years ago when I was with Sprint, it was a great phone then too.", "Date": "May 20, 2013"}, {"Title": "awesome  bang for buck and more", "Author": "lashalhouhb", "ReviewID": "R3GMIJXKPEGLZM", "Overall": "5.0", "Content": "omg  this phone rocks  bought for twenty nine bucks  three yrs ago  charge port died bought blackberry curve  it sucks  just ordered another juno  easy to use  baterry lfe awesome  cute lightweight..awesome phone  overall for us not so techy but want cool phone", "Date": "May 7, 2013"}, {"Title": "good phone", "Author": "denisha", "ReviewID": "R2RBP9H1ZL8MXO", "Overall": "3.0", "Content": "I used this when my smartphone broke and it was a good phone the only bad thing is it doesn't have a memory card", "Date": "April 2, 2013"}, {"Title": "Thanks", "Author": "Sandra Skirlock", "ReviewID": "R1K4LPKYS4GG5K", "Overall": "3.0", "Content": "Not what I was expecting nursing brick brush John been much luv occurs tv :/ ivy dc vBulletin in I tv", "Date": "February 23, 2013"}, {"Title": "Its just okay.", "Author": "Tyler", "ReviewID": "R280J0ZBCVWZ1X", "Overall": "3.0", "Content": "I like the phone features and Texting but thats the limit of its likes.  I don't like it for Web Access, Pictures, or ease of use, but the price is right for what you get.", "Date": "February 17, 2013"}, {"Title": "worst ever!!!", "Author": "vincent perez", "ReviewID": "R3AH9T72HUP2BP", "Overall": "1.0", "Content": "this phone was horribleconsno music could go in to the phonemessaging took forever and most of the time it said failedcould only bluetooth contactsinternet is slowhardly any memorypictures cant be posted on any mobile sitesno videos on youtube or any other siteno camcorderno headphone jack only a tiny one for mini antennasthe keys on the keyboard are all smudged togetherand moreprosit has alright calling quality", "Date": "February 2, 2013"}, {"Title": "Did its job, can't really complain.", "Author": "Kyndal", "ReviewID": "R23Z4P52AHSXI8", "Overall": "3.0", "Content": "Good as a temp. phone, but the buttons were firm and mostly hard to dial. But on the other hand, it was a good price, so i definetly got what i paid for.", "Date": "January 5, 2013"}, {"Title": "Found out that we couldn't activate and cannot return the phone and it sucks!!!", "Author": "Jeff Way", "ReviewID": "R280CIX0C5JCU0", "Overall": "1.0", "Content": "When we found out we couldn't activate the phone and we couldn't return it that sucks!!!  I am still not satisfied!  What a waste of money and time.", "Date": "December 29, 2012"}, {"Title": "I love this phone!!!!", "Author": "Robotic Joe", "ReviewID": "R3L3BUYQLHLL7A", "Overall": "5.0", "Content": "I love this phone!!!! But it was expensive to activate and you can't go below 0.00 or you get charged an addition 10.00 dollar activation fee! 5***** tough as nails item tough! Great clear camera too!", "Date": "September 3, 2012"}, {"Title": "Present", "Author": "freeladybug1", "ReviewID": "R391DUP7APAVTB", "Overall": "5.0", "Content": "Bought this for my daughter, she loved it, wore the letters off the keyboard texting, she loved it and replaced it with the same kind!", "Date": "November 27, 2011"}, {"Title": "this phone is really nice.", "Author": "boughtithere", "ReviewID": "R2TZVW3JID4X8", "Overall": "4.0", "Content": "I really like this phone, just wish it had a bigger memory or space for an sd card. I'd love to be able to save more pics.", "Date": "December 4, 2010"}, {"Title": "Not worth the money", "Author": "Danna", "ReviewID": "RP6SD17STDE58", "Overall": "2.0", "Content": "I bought this phone for the easy keyboard and the fast processing. The problem with this phone is I have to go outside to call out and recieve incoming calls. Nobody likes to talk on their phone in the winter time or when it is raining like cats and dogs.", "Date": "December 16, 2011"}, {"Title": "Great gift idea", "Author": "Beachwalker", "ReviewID": "R1F1YNEJAOWAF", "Overall": "5.0", "Content": "This phone was a gift for my daughter and she loves it!  Easy to activate and use!  Will buy one for myself once my contract with AT&T; expires!", "Date": "November 25, 2011"}, {"Title": "Bad battery", "Author": "Nana", "ReviewID": "R2P3VSBWW2GGJW", "Overall": "2.0", "Content": "I bought the Snayo Juno, prepaid Phone, Blue (Boost Mobile) for my grandson as a gift.  He's had it less than a week when the phone just shut down and wouldn't turn back on.  He took it to a Best Buy and the employee plugged it in and it turned on, but, once he walked out of the store it shut down again.  Now when he \"charges\" it the battery gets very HOT and it still won't turn on.  How am I supposed to figure this one out?  I purchased the phone on Amazon in October.", "Date": "November 14, 2011"}, {"Title": "sanyo Juno", "Author": "Dr. Michael D. Powers", "ReviewID": "R3TEL9WSFLOZ2D", "Overall": "3.0", "Content": "I bought this as a replacement phone for my wife when she dropped her Sanyo Incognito in water; however, she likes the Incognito much more. She says that the Juno is too small to manipulate for text messages, since in comparison the Incognito has a full, physical Qwerty keyboard and I believe the screen is bigger, too.", "Date": "February 19, 2012"}, {"Title": "A happy customer", "Author": "Lyindiana Money", "ReviewID": "R2RNDQZ1D2FE15", "Overall": "5.0", "Content": "I recieved my product in a timely matter also my product was in excellent condition. I love the way it was packed. Thank you for that service. I will purchase from your company more.", "Date": "November 8, 2010"}, {"Title": "Buyer Beware--Terrible Customer Service", "Author": "Columbus OH", "ReviewID": "R3V211D5Q8RV2M", "Overall": "1.0", "Content": "I am a professional who recently purchased a Sanyo Juno phone to use as an extra special-purpose business phone. After using Boost cards to pay for the phone for two months I switched to the Auto Re-Boost Payment Service, wherein payments are automatically charged to my credit card each month. What a terrible mistake. Boost Mobile has been making monthly charges to my credit card at the same time that it has cut off my phone service, telling me that there is no money in my account. Of course, the latter cannot be true is the former is true. When I call Boost's service number to resolve the problem I learn that there are no human beings to speak to, only an automated list of options, none of which correspond to my problem. When I contact Boost via its online customer service (an e-mail option in which the customer is asked to describe his or her problem) I receive a phone call instructing me to call the service number, which, as I've just noted, provides no human operator and tells me that there is no money in my account. In other words, Boost Mobile tells me that to restore my service I must make another payment, even though that payment has already been made by their Auto Re-Boost plan. In effect, I must pay twice for each month of service and there is nothing I can do about it. Is this a company you would want to do business with? I deeply regret selecting to business with this company.", "Date": "April 13, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003SB09OA"}}