{"Reviews": [{"Title": "Not worth the challenge", "Author": "Mr. Gadgitz \"Gadgitz Man\"", "ReviewID": "RGXSL3E8C0VGD", "Overall": "2.0", "Content": "I bought this phone despite the gentle warning from other consumers that this is not a straight out of the box and enjoy type phone. I'm a tech, heck my name is Gadgitz. I thought i was up for the challenge. but let me tell you this phone is not worth the heartache. I've applied flashes, fixes and registry tweaks and i am STILL not happy with the phone. From freezing to sporadic shut offs and everything in-between, THIS PHONE IS NOT WORTH THE CHALLENGE.Technically speaking: The phone only has 3 alarm settings;The ringer volume and vibration mode is something unnoticeable,I've missed many calls and saw emails and txtmsgs too late. I've tried at least 4 browsers and they were all slow. Without the 5 point d-pad games like tetris are painful.This phone is sleek, physically durable and un-brick-able. but the fun time is served up in limited doses.", "Date": "April 27, 2010"}, {"Title": "All Around Terrible Phone", "Author": "Polish Hillbilly", "ReviewID": "RJGMPWOQTG937", "Overall": "1.0", "Content": "Exterior First: Scratches super easy, and battery case cover is flimsy plastic.Also Moisture indicator sticker is SUPER sensitive, humidity even trips it, which turns the sticker pinkish, and not cover able by LG Warranty. The tethered stylus should be internal stowed, but just swings around like a cell phone charm.The Phone itself: It's windows 6.1, no other words need to be said.battery life is decent, Wifi power is average, but weak in most instances.Bluetooth delivers spotty performance.pass on this phone", "Date": "May 4, 2010"}, {"Title": "Great Phone, lots of features", "Author": "Eric K. Njeru \"E.K Njeru\"", "ReviewID": "R3S68CQMVK4N6Q", "Overall": "5.0", "Content": "This phone has GPS (AT&T; and External), Wifi, Radio, Dual clock, Touch screen, 3.2 Megapixel Camera and Camcorder. This phone does everything an iphone does plus it has windows mobile software.", "Date": "June 2, 2010"}, {"Title": "Suits My Purposes Very Well", "Author": "Irish Lass", "ReviewID": "R19F4XYXKNGAPY", "Overall": "4.0", "Content": "Have only used an LG CT810 phone for 1 week, but so far it is working well to suit my purposes.  Because it is a windows phone it works well for a particular program I use when engaged in volunteer work (2012 wlibrary which requires a windows mobile os), & wanted to have it with me. I've found my finger nails work great as a stylus, so I don't need the one that came with it. I keep finding new interesting items on this phone.  I use an android 7\" tablet for internet so my phone isn't used for that; just phone calls, pictures (which seem clear) and the programs I need. However, it is set up to be a perfect phone for internet. I'm not a touchscreen fan, but I'm getting used to aiming finger nails precisely & it works! I think women would like this phone - it has several virtual keyboards for input & I'm enjoying them.  I like the double lock features so the touch screen won't be dialing without my knowledge!  I suspect people who haven't liked this LG product perhaps didn't take time to get to know it very well.", "Date": "February 20, 2013"}, {"Title": "Great Smart Phone with Windows 6", "Author": "economics", "ReviewID": "R3AG5L41FN3E8F", "Overall": "5.0", "Content": "The LG Incite has a flush design, though it doesn't mimic Apple's iPhone, the qualities are there. LG has done away with a metallic design, and made the Incite from plastic with a glossy paint. Overall the finish of the LG Incite looked good but was susceptible to smudges. There's no keypad or QWERTY at all, but we were worried there's also no D-pad! LG's new interface looked classy on the bright 3.0\"inch touch screen. The LG Incite is not super-slim, but definitely pocketable at 14mm. It's slightly set back by the heavy weight of 120 grams.", "Date": "January 20, 2013"}, {"Title": "Unlocked phone?", "Author": "Amazon Customer", "ReviewID": "R3DBSS6YN0VLDL", "Overall": "2.0", "Content": "I ordered an unlocked touchscreen phone and instead I got a locked phone which I can't even use. It will be very helpful if sellers let you know exactly what you are buying. If I wanted a locked phone I would have purchased one.", "Date": "October 14, 2011"}, {"Title": "...", "Author": "ngnlson", "ReviewID": "RK6Q21F4YUT6Y", "Overall": "2.0", "Content": "Truth is this phone works i would say 70% of the time but the hell it causes when it doesnt outshines any of the good.", "Date": "February 12, 2011"}, {"Title": "I liked", "Author": "Ariel Antonio", "ReviewID": "R1BNLKPJOWUUG6", "Overall": "4.0", "Content": "I love this phone for all their qualities, but does not seem fair that a smart phone will sell it without your data cable and software without...", "Date": "July 26, 2010"}, {"Title": "VERY VERY BAAAAD!", "Author": "Julio Cesar Peñalo Diaz", "ReviewID": "RMGLBG0YMR3LD", "Overall": "1.0", "Content": "The worst Phone! and the Seller too! 1 week ago, and I'm still waiting for my refund ( seller: J&R; )INCITE TO  throw TO THE TRASH !", "Date": "June 23, 2010"}, {"Title": "Just plain junk.  Not an smart phone.", "Author": "R. S. Rehmel", "ReviewID": "R2UGAF83WPDVPW", "Overall": "1.0", "Content": "For those people looking for an iPhone clone this is not it.  This phone is difficult to use and is incredibly slow to do anything on the internet.  You can NOT down load email attachments with any kind of reliability.  You click on them an wait from 10 minutes to an hour to down load.  I have set next to some one with an iPhone and a Blackberry.  We timed how long it took to down load a 1 meg file sent from our office.  This phone was still downloading a half hour later.  Both of the others were done in minutes.  And yes we all use AT&T.;Also when it did complete the download I could not view the file.  I had to transfer it to my computer via the SSD chip so I could view it.  Both the iPhone and and the Blackberry could view the file themselves.As to the phone usage.  I went back to an older phone. The speed dial is terrible on this phone.  My previous LG was a breeze to setup, but it is also five years old.This phone has been such a disappointment that I will not buy another LG phone.", "Date": "June 4, 2010"}, {"Title": "very good phone", "Author": "Carlos J. Caballero \"CarlosJC\"", "ReviewID": "R1RP11H9D0NKG9", "Overall": "4.0", "Content": "it is a very good phone. the only thing was that it did not came with the usb cable.but works great!!!", "Date": "June 4, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Ct810 Incite Unlocked GSM Cell Phone", "Name": "Lg Ct810 Incite Unlocked GSM Cell Phone - 3.2 Megapixel Camera, Video Recorder, Bluetooth Capable, Touch Keypad, Us Version", "ImgURL": "http://ecx.images-amazon.com/images/I/41pHh-LAdGL._SY300_.jpg", "ProductID": "B0033SFC4U"}}