{"Reviews": [{"Title": "I love this cool phone", "Author": "economics", "ReviewID": "R1NR4LOJ92KZAB", "Overall": "5.0", "Content": "i really like this is phone. The calls come in loud and clear. It sends and receives text fast. The camara is really sensitive though. The speaker phone works great it is really loud and clear making it easy to use as well ! The bluetooth works good and quickly there just isnt quiet enough memory to have a lot of ring tones but it does have enough to have a few! The phone was really easy to figure out i didnt even have to read the manual it was simple ! The battery life is good as well i am constantly playing with my phone and texting and making calls with the battery lasting 2-3 days and i am messing with it ALL the time ! i wanted to buy this phone just because of the query keypad and i really do like it . It is so much faster and easier than the original keypad's . I am definitely glad i decided to get this phone ! Texting is no problem at all on this phone no matter how fat your thumbs are. the buttons are curved and i can write a text without fail almost everytime, and this is my first phone with a qwerty key pad.  once again im impressed with the shortcuts on the phone, they make things like the calendar and calculator and message writing easy. searching through the contact list is easy and detailed. no real complaints about the phone - its no blackberry, but i feel over all i got a little more than what i paid for. however, i send mostly picture messages and texts. You have to be really really still when you take a picture or its blurry.  Over all i really like this phone it fits in your hand just right making it easy to hold when your on a call !", "Date": "January 20, 2013"}, {"Title": "Not unlocked", "Author": "Benjamin Zuckerman \"BZ in BA\"", "ReviewID": "R22UR0TB6MT4H3", "Overall": "2.0", "Content": "It was supposedly unlocked, but it is not.  The phone itself is in great shape, and I am sure that it will be fine once I find someone to unlock it for me.  But I am going to have to pay them to do it, which I am sure will cost more than the phone itself did in the first place - which kind of spoils the whole point of having purchased a cheap phone to begin with.  If someone is going to say that they product is \"unlocked\", then it really needs to be completely UNLOCKED.", "Date": "June 30, 2013"}, {"Title": "Love it", "Author": "billmc1264", "ReviewID": "R28R66ISLGAY6A", "Overall": "5.0", "Content": "I bought this phone in a junk store with a house charger for $7.  Stuck my sim card in it, downloaded the user guide (bless you Samsung), copied my sim memory to phone memory and away I went.  It has everything I need (I don't text or message because that costs money and I'm cheap (sorry kids)).  I'll find a car charger in a junk store and may buy a new battery, but that's all.", "Date": "September 18, 2013"}, {"Title": "Simple phone  --  works", "Author": "Michael S. Ulicki", "ReviewID": "R2XLRG81WWSAB1", "Overall": "4.0", "Content": "Needed a phone to travel in Europe.  It did everything that I needed it to do at a very reasonable price.  The charger connector is a Samsung connector.", "Date": "July 14, 2013"}, {"Title": "Just okay", "Author": "Khetasi", "ReviewID": "R2QGKYKHPAY6JG", "Overall": "3.0", "Content": "It met my need for use while traveling. Just make sure you have a socket adopter for your charger. Nothing special about phone.", "Date": "July 5, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Unlocked Quad Band: GSM 850/900/1800/1900 and GPRS capabilities\nQuad-Band Unlocked GSM cell phone compatible with 850/900/1800/1900 frequencies plus GPRS/EDGE capabilities", "Name": "Samsung SGH-a177 Quad-band Cell Phone - Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/41mLt0lrUvL._SY300_.jpg", "ProductID": "B003UXA1GW"}}