{"Reviews": [{"Title": "is it wrong to love a cell phone?", "Author": "Low-Ranking Reviewer \"tell it like it is\"", "ReviewID": "RMSO5S9OZ2G4U", "Overall": "4.0", "Content": "Probably.  In most states.  But i bought this VM LG Rumor Touch at the 'red & white rings' store when it was on sale.  Overall it's a great electronic device.  Amazon and virgin mobile's site does a great job of describing it and telling you what to expect.  I'll share just some impressions and not-so-great-things about it.  But make no mistake, i'd recommend this easily.likes:* mp3's come through clear and crisp in external speaker(headphones and usb cable included)* that 3\" touchscreen is nice compared to my previous 2\" screen on my last cell.  it's like going from standard def to HD(sorta)* pics are good and sharp.  my shaky hand and some pics look blurry when in camera mode.  but once you take it and view it, it looks great.  thanks image stabilization(or a variation of it)* micro-sd slot is great for adding lots of mp3's.  have not figured how to transport pics and vids to the sd-card slot to view on my camera yet.  but then, i'm an idiot with gadgets. (figured it out, just go to tools>mass storage>file manager)* qwerty keyboard is fairly spaced out for me, but if you got big/chubby fingers you might have problems.* i'm a cheap bastard, so i only pay $25 a month for this phone, total!  i get 300 anytime minutes for calls, unlimited texts/pic msgs(not including the free messaging through social networks and emails), and unlimited web access.  do i need to even repeat that?  of course, higher plans with more talk minutes are available as an option.* 3G built-in(but no wi-fi).  Spotty at times, but mostly consistent and reliably there when you want to surf the web.dislikes:* not very good video playback in camcorder mode.  it's serviceable, and at least the option to take videos and watch them is there.  just don't expect high-quality.* you can customize ur pics, but nothing really special or extensive.  worse, you don't seem to be able to organzize your pics into specific albums(i will apologize if this option turns up, but i can't find any extensive options to organize your pics)* scrolling through long lists is imprecise and can be frustrating.* you can't seem to assign your mp3's as ringtones.* the default is an 'unlock' screen where you slide to unlock it to access your phone.  doesn't bother me much, but i decided that i would leave my cell unlocked cause i could see it might annoy me if i had to unlock it with some code or procedure, no thanks.  besides, it's not like i have government secrets on my phone.Overall, great phone(i've actually used it for calls a few times and the reception is good and i live out in the boonies sort of), tons of features, and a cheap monthly plan for me with other options for others.  Highly recommended.Update 11/25/10* only $70 on black fri sale at best buy* disappointed at lack of customization/organization options concerning contacts, mp3's, pics, videos, and messages.* gently using your fingernail as a stylus is more precise than using your finger(ok that was too obvious but i'm a slow learner)", "Date": "August 9, 2010"}, {"Title": "A nice touch!", "Author": "wamzy.com", "ReviewID": "R3FQOZO3UHIECW", "Overall": "5.0", "Content": "Ok, I've been thinking about upgrading to this one from my Rumor 2 but needed a push. Well the Black Friday deal from the yellow price tag store was that push. Can't beat the half off deal, so I had to get it. Glad I did. So I'm pretty much going to review it by comparing Touch to Rumor2.PROS:1. I'm finally back to a phone with a video option. It's been a while since I switched to Virgin, my previous 2 phones (Wildcard and Rumor 2) did not have a camcorder.2. Well it's a touch screen, d'uh!3. LG finally put a call log in it, geez! Rumor2 had no call log and the only way to see your activities was to dial a number and quickly hang up to see the recent log. Rumor Touch has the Call Log under Contacts. A little hidden, but it will do.4. 3.5mm audio (standard size) as opposed to Rumor2's skinny 2.5mm.5. Assigning Voice Memo as a ringtone. A pleasant surprise! I just voice-record a portion of a song and set it as a ringtone from now on. Why pay for ringtones? Sure sound quality is a little off, but who cares, it serves it's purpose by ringing for a few seconds. You can also assign a video as a ringtone too!6. A decent Bluetooth. I paired it with my Garmin and the sound on another end is pretty good from what I have been told.7. Nice menu design and interface colors.8. 2MP camera, an upgrade from Rumor29. Hello UI. A nice little feature to have for your most called contacts.10. Messaging is designed pretty good. Sorted by each contact.11. Document Viewer. I haven't used it but it's there.12. Missed alerts show up in bubbles. I like bubbles!13. YouTube! We got YouTube! Rumor2 did not.CONS:1. The sliding mechanism felt a little more durable on Rumor22. Supports only 3G2 type video files, not 3GP or MP4. If you have a 3G2 converter, you can assign any youtube video, for example, as a ringtone. I couldn't find any free ones though.3. Still can't assign own ringtones, must buy from Virgin. But I resolved that with Voice Memo trick (see pros)4. Still can't zoom in while in Camera mode set on highest resolution. Not sure what LG's problem with that is.5. The shuffle button on Media Player seems like it's not working. Well it does, it's just hard to tell whether shuffle is on or off.As you can see, all the CONS are pretty minor issues and definitely can be dealt with. So if you're a Virgin Mobile customer, I could easily recommend this phone. (Especially if you find it on sale, like I did)", "Date": "December 15, 2010"}, {"Title": "What a joy to use", "Author": "Tom Music \"Sound quality\"", "ReviewID": "R1YJORVOZ7AT2Q", "Overall": "5.0", "Content": "This is the best bang-for-your-buck phone for Virgin Mobile.Pros:Voice quality: crystal clearReception: good to very goodCan run Opera Mobile browser, show YouTube videos via the browser (on YouTube's mobile page)Slide out keyboardGood touch screen (although no iPhone killer by any means, i.e., slight lag in reaction, a bit more resistive)Java Gmail app can be installed and can access online contacts, in addition to an existing multi email+IM client that accesses Gmail and is pretty good.Cons:The menu system is a bit cumbersome and not as intuitive as I would have liked, which means there's a bit of a learning curve to itLimited ringtones: I would have liked to be able to make any of my audio files a ringtone, but no such optionCamera is not impressive (but usable)- Auto white balance indoor is frustratingly inconsistent, and of course, shutter lag.Built in Gmail app cannot search online contacts, only those who have an email address stored in the phone's contact list.The keyboard, although decent, is not top notch. I find myself making unusual typos meaning my fingers, which are pretty long and thin, somehow touch random keys. I can't quite explain what's the reason for this - perhaps the keys are too flat or narrow. In addition, there are some oddly placed punctuation keys, requiring a Fn+key to select.I would have scored it a 4.5 starts, but decided on 5 because for the phone's price plus the low monthly plan on Virgin, the total package is great. The phone is Flexible, powerful, and gets all the important things right.", "Date": "November 12, 2010"}, {"Title": "Wannabe Smartphone for low $$$, LOTS of free apps!", "Author": "John A. Lucier", "ReviewID": "R8L904LEI0IPX", "Overall": "5.0", "Content": "I've had virgin's paygo with the quirky wildcard for a couple years, and when I saw the black friday deal on this for $70 I  couldn't resist. Somehow I'd convinced myself this would be in the same league as my friend's iphone 3GS and of course it isn't. But neither is the price I'm paying at $25 no contract. So if you're not getting into this expecting the advanced displays, games and apps of iphone, you won't be disappointed.The Rumour Touch is solidly made, at $70 a steal but probably a fair deal at the $130 or so they usually go for. The keyboard is great, much better than the wildcard's, display is decent. Touch function is a little iffy, it works, but you may often find things don't activate the way you wanted, it's not unlivable without a bit of patience. I find I'm using it a lot with the slider open and sort of a \"hybrid\" method of using both touchscreen AND keyboard to navigate. I'd like to see a 4 way up/down/l/r button where the home button is on the face, frankly.At first I was disappointed at the few apps I found and worse Virgin wants to sell them to you, then a little searching found a few resources on the web- a hub page called how  to install non virgin java apps on your VM rumour touch gives the walkthrough, and a free program called jadmaker allows nearly unlimited games and apps to be installed on this phone with very little pain at all. Ringtones, wallpapers, games, EVERYthing you think we've been shorted on here, that's not the case- there is a workaround out there! Just look.I live in a city with good coverage, so reception's great, battery life is very good too. Get a case for yours pronto, it's well made but suffers from liability due to its own weight- it's heavy and a few good drops will likely destroy it.I fully recommend this phone as the VM data plan spanks EVERYthing out there for price, and the phone works. It's not perfect (probably the biggest annoyance is a difficulty in scrolling menus using the touch screen, it's awkward but I may get it in time) and it's low on the scale of smartphone competition, but a great entry into something that does more than just talk and text. I understand the Intercept has issues so if full android is your desire, it may be worth waiting or go to another carrier- and pay a lot more.I'd give the phone 4 stars but given the screaming deal of the purchase price AND the service, it gets 5.***As someone who's been with Virgin prepaid for over three years and experienced switching phones, I can advise you to:1. Try to handle everything from their webpage, don't call their phone line if at all possible- and DO NOT speak to a live body unless you want to pay $10 to speak to someone who won't understand you and probably can't do anything for you.2. Read all the instructions carefully as you activate the phone on their site. If somehow you or they screw up, BE PATIENT and let them handle your issues FOR you using their email (contact us) system. Don't let them advise YOU how to fix THEIR problem by calling their number back, carefully word your request (with a detailed description of the problem the FIRST contact) to ask them to do what they need to do to make you a happy Virgin Mobile customer and they will do it and your phone will work.", "Date": "January 1, 2011"}, {"Title": "Good Bang for the Buck", "Author": "D. Mills", "ReviewID": "RSBQ6T72PGN49", "Overall": "4.0", "Content": "We'll get the bad stuff out of the way first.  Simply, Virgin Mobile customer service is nonexistent.  Though now owned by Sprint, it's a UK legacy company with CSRs in India.  They have trouble with English (and were probably the model for the TV ad character who says, \"Thank you for calling U.S.A. Prime Credit...my name Peggy\").  Problems are rarely resolved over the phone, that is, if they even understand your concern or, for that matter, actually answer the line.  More than once I've waited 20+ minutes only to have someone pick up, say nothing and hang up.That said, their online activation worked fine for me and there's no activation fee.  If, for the sake of unlimited data @ $25/month, you can live with that, who cares about the rest?As for the Rumor Touch, no, it most definitely is not a smartphone.  But for a hundred bucks it covers the basics, some better than others:-Touchscreen okay.  A full 3\".  Resistive, not capacitive.  Fine with dialing UI - hey, it's...a phone - but quirky with menus.-Menu UI is limited to often stubborn scrolls, not widgets.-Generous, slide out QWERTY keyboard which covers text and other character input, plus navigation.  Feels solid, not cheap.  I like the additional real estate.-MicroSD slot.-Basic stereo earbuds/mic included!  Standard 3.5mm jack.-Included USB connector!  Worked right the first time on file downloads/uploads with PC.-2MP camera and video (which has worked great as guerrilla video tool).-Yes, Google Maps, though a bit awkward to access, is included.Simply put, I've found it to be decent bang for the buck without spending the additional hundred bucks for a full-fledged Android smartphone like the Samsung Intercept, my likely short term upgrade path.  If you're a cheap realist like me (i.e., you get what you pay for), it's a good choice.", "Date": "April 9, 2011"}, {"Title": "Great PrePaid Phone", "Author": "M. Burgoyne", "ReviewID": "R1R2ES6OZBY7E7", "Overall": "5.0", "Content": "The Virgin Lg Rumor Touch is a great prepaid phone.  I find the touch screen easy to use and read.  It also includes opera mini for web surfing.Facebook and twitter work just fine for how often I use it. It also lets you send picture texts.  The camera works just fine in bright light situations.*only $25 a month for service that includes 300 anytime minutes, unlimited text and web.*", "Date": "November 27, 2010"}, {"Title": "Great Phone.", "Author": "Casey", "ReviewID": "RLED2I3N73ZR5", "Overall": "2.0", "Content": "EDIT: After using this phone for a few more months, I found out something very important about it: IT SUCKS. Don't buy it. You end up having to replace the battery twice a day, and many times you can't send or recieve texts. Opt for the Optimus V, you can find it on Ebay for the same price as the Rumor, and it is only $200 on VM's website. The real comparison is in the reviews on VM's website. LG Rumor touch: 79 - 5 Star reviews, and 21 - 1 star reviews. LG Optimus V, on the other hand, has 668 - 5 Star Reviews, and 12 - 1 Star reviews. If that doesn't sway you towards the OV then I don't know what will.Ok, before I start this review, know that I am coming from an older Nokia GoPhone from AT&T; with no keyboard.Anyways...I Love this phone. I took a little getting used to, but after that, it has been great. First things first, you will want a screen protector for it. I scratched mine, stupidly enough, on the first day I had it.UI:The phone starts with an unlock screen a bit like the iPhone, with the time, date, and a button on the bottom that you can slide to the left or right to unlock the phone.After it is unlocked, you are brought to a \"Home\" screen, which has nothing but a small bar across the bottom to bring you to the \"Home Menu\". This is a customizable menu, where you can add pretty much any app form your phone. Annoyingly, you can't add any apps to the original home screen, but I can live without this. Click on \"Main Menu\", and you are brought to a root menu type of thing, where all of the apps and utilities for your phone are listed. This includes \"Messaging\", \"Maps\", \"Social Networking\" and many others. With maps, you are brought to \"Virgin Mobile Navigator\". This you have to pay for, but it does include turn by turn directions. Luckily, your phone also includes a Google Maps app! This has street view, traffic, and many other features, including current location which uses the phones built in GPS. This sadly does not include turn by turn directions.Next on the list is \"My Stuff\". Here, you can access the application manager, for multitasking with several different apps. Thats right, a functionality the iPhone and iPad just got with the 4.1 and 4.2 iOS updates, this phone can do, ant it has come in very handy. There are games, which it comes preloaded with a few. There are demos of Pac-Man, and \"Midnight Bowling 2\", and the full version of tetris. The other menus such as ringers, walpapers, and \"ringbacktones\" are empty except for a link to \"Get More\". It does come preloaded with several applications, though. These are: Facebook, Twitter, Myspace, Email + IM, Contact Vault, and Opera Mini. The Facebook app is generally, in my opinion, unusable. There is no way to sort your news feed by \"Most Recent\", and I haven't seen the notification system on it work yet. Luckily, the phone comes with Opera Mini. Opera Mini is a pretty awesome web browser, but it doesn't come pre-loaded with the latest version. I was able to update it, I'm pretty sure from their website, but I don't remember exactly where. Don't expect to be downloading any apps from this web browser, though, because any app downloads bring you to an \"Access Denied\" page in the phone's default WAP browser. I'll get to how to sideload apps later. The Email + IM app is pretty good giving options for GMail, AIM, and even custom IMAP/POP email. There is a \"Web\" button on the menu, which brings you to the phones default WAP browser. I have declared this unusable in my opinion. Pages don't load properly, and it is just all around difficult to use. You can use the browser for the \"My Account\" page, though, and it will render fine.There is a media player button on the menu, but I can't figure out how to get music to play through it. I did sideload the \"TuneWikiPlayer\" app for it though, which is great, because it allows for backround music listening.Under tools, you can use a clock, a calander, Bluetooth (Yes, this phone has Bluetooth), use Voice control (which works just like you think: badly), a basic calculator, a notepad, a \"Document Viewer\", and a small quick guide for controls of your phone. I cant figure out how to use the document viewer, so I have no idea what kind of documents it's compatible with, or if it really works. The clock has a stopwatch and an alarm function, and you can set dates on the calendar.Hardware:The phone is not thin. From looking at it, I would say it is around a half inch thick, but you can probably see the specific measurements on Lg or Virgin Mobile's website. The screen is a good side, but by no means as big as an HTC EVO or Motorola Droid. It is also resistive, which means that it is no where near as responsive as the iPhone or Android phone's capacitive screens, but it has done pretty well. You will get a small vibrate every time you touch the screen. The keyboard is great, I have found no problems with it yet. It is nice and clicky. One odd thing about it, though, is it slides out the opposite way then most phones. It takes some getting used to, but once you've been using it for a couple weeks, you'll barely even remember that phones slite out the other way!Battery Life:So far I have had no problems with battery life. I have talked, texted, and web browsed on the thing for a solid couple of hours with the screen brightness at 70% and it didn't run out of batteries. Charge it every night and you should be fine.Call Quality:Call quality is fine. I have talked in loud rooms and have never had any problems. Speakerphone is also not too bad. I have not had any problems with reception around New York so far, so that is good.Camera:Click on the \"Photos and Videos\" button on the Main menu, and you can take a picture, video, or view your pictures in phone, or in the micro SD card. Picture quality is pretty good, nothing compared to, say, a Droid Incredible, but not too shabby. The video quality, like others have said, is not great. You won't be filming any movies with this, but for that Christmas morning present unwrapping video that just HAS to go onto Facebook, it'll be fine. It is a 2 Megapixel camera, and you can adjust the brightness and the white balance. There are 4 color modes: Normal, Black and White, Negative, and Sepia. You can change the shutter sound, put in silly \"Fun Frames\". There IS a night mode that will definitely help with you darker shots, but it wont do much. When you take a picture, you are given the choice to \"Upload/Publish\" using the \"MyPix Uploader\". As of yet, I absolutely can NOT get this to work, but you can upload photos to Facebook directly from the mobile site. An annoying \"Feature\" of the phone is if you have the pictures saved to the memory card by default, you have to copy the picture to the in phone memory before you can text it to someone. Luckily it is very easy to copy pictures to the in phone memory.Apps:As I said before, there will be no downloading apps through the browser. There is a way to do something called \"Sideloading\" apps. Using this website: ['], I have been able to put many apps on my phone. That has allowed me to update Google Maps and even put a QR-Code Reader on my phone: ['] . This is really great, and extends the usage from my phone a lot.Wrap up:Overall, if you are looking for a great Prepaid phone, then I think this one is the way to go. At $150, and only $25 a month, it is low cost. Hope this cleared up some questions you had!", "Date": "December 11, 2010"}, {"Title": "LG RUMOR TOUCH IS WORST PHONE EVER - DONT BUY", "Author": "ColoradoPerson", "ReviewID": "RZS1N6COS4CN1", "Overall": "1.0", "Content": "This phone has a known problem with the pins in the power plug so does not charge properly. They had to send me a new phone because of that and now a few weeks later the second phone doesnt charge properly. I used specialdiscountcenter which is a crap amazaon seller (beware of them!) anyways and it looks like there is a reason that this phone is sold at a discount. It doesnt work!!!When the phone is fully charged it reboots for no reason what so ever and will keep rebooting itself until the battery goes dead. If this is your alarm clock you are screwed. Oh, but you can turn off this wonderful feature by turning on the stopwatch to keep the phone busy so that it doesn't reboot automatically without warning.Lastly, this is by no means a smart phone. Its not anywhere close to as good as the HTC sense and wont even mention other real smartphones as this one is NOT a smartphone. You CANNOT DOWNLOAD APPS and must use the crap apps that is hardwired installed on this phone. By far the worst phone I've ever used. A flip phone or an old nokia with no bells and whistles would at least stay on and make calls properly.YOU WILL REGRET ORDERING THIS PHONE OR USING SPECIALDISCOUNTCENTER TO DO SO!!!!!!!! BE AWARE NOW THAT YOU ARE WARNED! Yes, I am an unsatified buyer who got duped by the 17 pictures advertising all of the accessories it would come with, and how cool the phone looks. Of course, when I got it there was only a phone and a charger in the envelope (No box!) with none of those accessories. That was the 1st of very bad hateful experience. Now I have to spend more money to buy a new phone. I will not be reselling this crap phone on amazon I do not wish this sort of trouble on anyone else. I just wish other sellers on amazon had the same level of integrity and stop advertising and selling the LG Rumors all together. It is dishonest, disingenuous, and I would venture to say bordering on fraudulent!!  Anyways DONT BUY IT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "June 21, 2012"}, {"Title": "get what you pay for", "Author": "Jhordan", "ReviewID": "R3GGMD9GWCJP0V", "Overall": "5.0", "Content": "This is a very excellent phone for its price, I was actually surprise at the features that it came with. with this phone you get exactly what you pay for and I recommend it to anybody.", "Date": "April 1, 2011"}, {"Title": "great phone", "Author": "kristol zimmerman-gutierrez", "ReviewID": "R2CUYA5389HP2C", "Overall": "5.0", "Content": "This is a great phone all in all..the only problem is that you have to buy a smart card in order to down load music with the mp3 player. Other than that i would highly reccommend this phone. The service is great and the internet is fast. I love the way it vibrates everytime you touch a button on the touch screen to mke sure you dont make any mistakes.", "Date": "September 23, 2011"}, {"Title": "good product", "Author": "net10 customer", "ReviewID": "R15X7MDJ6A6BDK", "Overall": "5.0", "Content": "Bought it about a month ago for my son. He loves it, the best phone he has ever had, and this is his third one.", "Date": "September 15, 2011"}, {"Title": "virgin mobile rumor touch phones", "Author": "Judy E. Johnson", "ReviewID": "R1C9JMHCZ6YTIJ", "Overall": "5.0", "Content": "so far these phones are performing very well  seems as tho the girls had no problems with learning the different programs and settings.  i was pleased with how quick they arrived.", "Date": "August 20, 2011"}, {"Title": "Good phone, but a few minor snags", "Author": "ratttleh3ad", "ReviewID": "RBIDE5TZXAO1L", "Overall": "4.0", "Content": "This phone has been great for the few weeks that I've had it so far. When you're in the city (which I am) getting a signal hasn't been a problem but sometimes internet can be a little slow. As far as use goes this phone took a bit of learning but no more than any other new device would take. It was unfortunate that it didn't come with better start-up directions because that would have made the learning process easier and quicker. However, the phone's overall functionality is great. The full keyboard is very easy to type on. While I don't have fat fingers I know a bunch of people that do and they also liked the keyboard; so if you have large hands fear not! The touch screen requires you to press a little harder and be generally tougher on it than most touchscreen devices I have had experience with. This problem is really only temporary until you break the phone in a little. After that it works just as well as anything else. In summary: easy to use, decent touchscreen, Virgin Mobile's network/services offered on the \"Beyond Talk\" plan are excellent, fully keyboard is wonderful, overall a great phone for the price paid.", "Date": "August 15, 2011"}, {"Title": "Virgin Mobile Rumor Touch", "Author": "Vonara", "ReviewID": "R9C8L0US37F6P", "Overall": "5.0", "Content": "Lee's Electronics is a GREAT buyer. I would recommend him to anyone. I had some trouble ON MY PART by submitting a duplicate order. I got in contact with the buyer and the problem was fixed IMMEDIATELY. I appreciated the good business. The phone came early and is working GREAT. If the buyer is reading this..THANK-YOU:)", "Date": "July 9, 2011"}, {"Title": "Good Phone...Awful Service", "Author": "J. Hill", "ReviewID": "R2808249TYIHC9", "Overall": "4.0", "Content": "The phone is durable:Keypad is good and the features are nice, but the touch screen is not accurate. It's too sensitive which makes it hard navigating when I don't feel like using the buttons on the keypad. Sprints service sucks, not good nationwide coverage. The touch screen technology could use some pointers from Apple (iPod Touch, mine is great).", "Date": "July 4, 2011"}, {"Title": "Great phone!", "Author": "Teresa M. Moisan", "ReviewID": "R1WOOFA6KPHA6", "Overall": "5.0", "Content": "The phone is an awesome phone with tons of options and services available.  It is easy to use, fun to use (my husband is having a blast with it) and is inexpensive when paired with some of the plans available.  We use it with a month-to-month plan.  The phone has everything on it that we need but came at half the price of other brands.  We have used Virgin Mobile phones for more than 8 years and have always been happy.  Looks like the Rumor Touch is another winner!", "Date": "May 3, 2011"}, {"Title": "Lg Rumor Touch better than expected", "Author": "Amazon Customer", "ReviewID": "RCC08XCQUXYL9", "Overall": "4.0", "Content": "I bought this phone for my wife for Christmas. She has been pretty well satisfied with it other than a few quirks. If you watch a Youtube video on this phone the browser will close after the video is finished and you must start the browser again after every video you watch on Youtube. Also this phone will on occasion give an error message #34 when trying to send a text message but turning the phone off and back on seems to correct the problem. It doesn't happen a lot but it does happen. Other than this few minor details the phone works great just don't expect to play games all day or surf the web for extended amount of time because it kills the battery in a few hours.", "Date": "January 16, 2011"}, {"Title": "Loved it. Miss having a sliding keyboard.", "Author": "Wendy", "ReviewID": "R1J87A3T6J21HB", "Overall": "4.0", "Content": "Worked great for a long time. Held up to a lot, including a cheap case. Unfortunately, the screen went black while sitting on the counter. Just died for no reason. The upside was that having the slide out keyboard let me make calls despite losing the screen. Miss it. It was a good phone. If you don't need a computer in your hand masquerading as a phone to entertain you with games and videos while you're out and about, this is a good phone.", "Date": "June 5, 2014"}, {"Title": "great", "Author": "jmford", "ReviewID": "R149R5RFCKGR6N", "Overall": "3.0", "Content": "is exactly what i ordered. worked perfectly as i hoped and was cheaper that chain or department stores here in town. thank you", "Date": "April 7, 2014"}, {"Title": "Virgin Mobile CDSVMRUMORTO", "Author": "Janis C. Ayers \"Frequent Reader\"", "ReviewID": "R3FQUZECXFSU7G", "Overall": "3.0", "Content": "This was my son's purchase and not mine.  According to him it was a good phone for about a year.  Other than that I have no data.", "Date": "January 28, 2014"}, {"Title": "Frustrating to use -- Waste of money.", "Author": "Akeakamai \"Akeakamai\"", "ReviewID": "R30EPXGPT1MN66", "Overall": "1.0", "Content": "This phone turned out to be too fancy for me. The software design is very disorganized and somewhat confusing; you have to remember where most of the menu items are, it's ridiculous. The phone locks itself when you're in the middle of a phone call, and you have to unlock it if you need to use the number pad or when you want to hang up (unless the other party hangs up first). The instruction manual that came with this phone is outdated and very incomplete. It seems more like an overview. In some parts, the instructions were incorrect. Even the online manual on Virgin Mobile's web site is outdated.The Kyocera Cyclops flip phone I had prior to this phone was better for my needs. It was easy to program, and had the basic, necessary functions.", "Date": "December 3, 2013"}, {"Title": "love this phone,...", "Author": "edward hounsom", "ReviewID": "R28H8FRA28YMTS", "Overall": "5.0", "Content": "I love this phone received very fast and am very happy with the phone.. The only downfall I have is the charger I think its pretty cheapie and broke the first week.", "Date": "September 5, 2013"}, {"Title": "Excellent for texting", "Author": "Don G. Taylor \"Baseball pitcher\"", "ReviewID": "R34EZAC7RSR12A", "Overall": "4.0", "Content": "Battery lasts up to 5-6 days on one charge.  Web browsing is close to non functional, I think mostly due to Virgin Mobile cheap plan.  But calls work well, camera is good, texting very easy with keyboard.  BAttery occasionaly loosens just enough to turn off.  overall very good phone for not internet use.", "Date": "March 20, 2013"}, {"Title": "Dont get this type of phone", "Author": "brock mcwherter", "ReviewID": "R1SO7Y1BPPT5HR", "Overall": "2.0", "Content": "These phones are not so great they break very easily...when i got the first one it last a few months and it was decent...then  dropped it and it broke...i bought another one and when i got it the audio didnt work...i sent it back and order another one because i thought it was just a bad one but the third one also came to me broken. even though they r cheap i would just recommend investing in a more expensive/reliable phone", "Date": "January 3, 2013"}, {"Title": "AAAA", "Author": "Russell Friedman", "ReviewID": "R1HUKQ0HVMBAH9", "Overall": "5.0", "Content": "Shipped very well  the unit works very goodUnit as described on the money works very goodthank yourfriedman", "Date": "December 4, 2012"}, {"Title": "AVOID THIS PHONE", "Author": "am1xodox", "ReviewID": "R78RDYF7CUXPC", "Overall": "2.0", "Content": "This is my first cell phone. I've had it 3.5 years so far:0.5 YEAR:Everything worked really well. no dropped calls, fast texting experience, easy access to facebook, email, aim, camera. Pretty accurate touch screen controls.1ST YEAR:Started to receive dropped calls. Text msgs were unable to be sent (though this can be easily fixed by shutting off the phone, and reinserting the battery pack).2ND YEAR:Adding on to the difficulties experienced in my 1st yr with this phone, access to facebook became difficult due to a \"memory shortage.\" I tried to clear up the memory by deleting pics and videos, but the \"memory shortage\" still persisted. Not only that, the touch screen was now completely off--I tried fixing it with the touch screen re-calibration but it was just impossible. I even tried to look online for a solution to this problem, but it turns out Virgin has yet to fix this problem.2.5 YEARS:Adding on to the difficulties, I could no longer take pictures due to a \"memory shortage,\" despite the fact that I had wiped everything on my memory.Access to the other applications included on the phone--such as voice recorder, customization of photos--became impossible.3.5 YEARS:The phone now shuts off by itself frequently. And by this point, the $25 plan for unlimited data and texting, and 300 mins was really not worth it, as you could not access the internet well and texting was faulty.Overall, avoid this phone.Btw,virgin does have an option where you can turn in the phone as \"broken,\" and you will have access to a special deal on a refurbished \"LG Optimus V,\" for ONLY $25 (amazon is selling it for around $50 as refurbished). This is really a great steal seeing as how over 400 customers has rated it 4/5 stars. I will be switching to this phone soon.P.s. even though you can no longer see the reviews for the Rumor touch on the virgin mobile site, I hope you know that the reviews for the Rumor Touch was terrible. It was 2.5/5 stars I believe.", "Date": "November 18, 2012"}, {"Title": "Worst phone ever!", "Author": "Poncho", "ReviewID": "R2D9R8R4FYXS93", "Overall": "1.0", "Content": "This phone is the biggest piece of junk I've ever owned!The only free app you can get is Opera Mini, and can only go to VER. 7, will not accept mp3 ringtones. You have to convert the MP3 file into a 3g2 for a ringtone, and the txt tone you have to convert into a qcp then send it to your email, then to your phone. VM has locked down everything on it.Pics are crap if a piece of dust flies infront of it the entire picture blurs, also has no flash.Media player is decent, if you know how to get the music on here.Doesn't come with a memory card, had to buy that seperate at walmart.Phone likes to reset itself if you're using the web and you get a txt msg, or if you are in the middle of typing a txt and get one, it does the same thing.Save your money and buy something better, I can't wait to get rid of it in the next month or so.", "Date": "October 22, 2012"}, {"Title": "Touchscreen issues and no apps", "Author": "Eric Weisz \"Cycle Commuter\"", "ReviewID": "R3867IPD61ZT10", "Overall": "2.0", "Content": "I had this phone for about a year, and it was my first foray into the world of not-so-dumb phones. I was initially impressed, and especially enjoyed the ability to get on the net from my phone. As time went on, though, I became frustrated by the lack of availability of apps that would work with this phone. I didn't expect the type of selection that's available for iPhone or Android, but I did hope that some of the Java-based apps out there for download would work with this phone, and only a few did. Others that should have didn't or only worked partially. This is definitely a feature phone and not a smart phone.The phone did its job while it lasted. Within a couple months, however, the touchscreen all but died. It was only responsive in certain parts of the screen, and even there, it registered the touch as being in a different part of the screen. It was within the six month warranty period, and Virgin Mobile sent me a new handset free of charge. Fast forward several more months, and the exact same problem arose, only it was past the six month window since I had purchased the original handset. Virgin Mobile refused to replace the phone, even though it had been less than six months since the replacement was sent. I should add I'm not generally hard on phones. I take care not to damage them, use screen protectors, etc.That lack of reliability alone and the frustration I felt trying to deal with Virgin Mobile customer service is enough to cause me to rate this phone as only two stars. Add to that the lack of apps, and it's squarely only in the 2 star category. As of June 2012, I'd say spend a little more and get one of VM's basic Android phones. You'll be much happier.In a nutshell - PROS:Slide out keyboardVirgin Mobile's rates (especially since I use mostly data connection and very little voice)Decent cell signal in my area, though it could be betterCONS:Faulty touchscreenFrustrations with VM's customer service trying to get second unit replacedLack of serviceable apps", "Date": "June 26, 2012"}, {"Title": "Wonderful service, product, and rapid shipment!", "Author": "ladiana1950", "ReviewID": "R1TI3CQSFSSPWG", "Overall": "5.0", "Content": "I am extremely impressed with the LG Rumor Touch Cell Phone! Not only do I have a wonderful phone now, but the shipment was rapid! Thank You very much!!Sincerely Yours", "Date": "June 26, 2012"}, {"Title": "Frustrating UI", "Author": "Ryan Espy", "ReviewID": "R2MOJ39L900TPK", "Overall": "2.0", "Content": "Decent phone, but I've been continually frustrated by the UI for the many months I've had it.  Why do I need to slide a touch bar and press a screen button to hang up the phone?  If I'm in the car or doing anything else, I can't work this kind of magic.  Also, good luck trying to figure out the combo of illogical buttons required to put someone on hold and then talk to them again without hanging up on them.  I was told in the store that it doesn't butt dial...it butt dials about once/week.  Want to send a quick text?  Well you will need to click through 10 screens to do it.The only thing I like about it is the full keypad, but with so many phones offering this option now, find one that has designed a friendlier user interface.", "Date": "June 1, 2012"}, {"Title": "A Fortuitous Recommendation", "Author": "Chloe", "ReviewID": "R1PTM0Q0H5Q8G1", "Overall": "4.0", "Content": "Virgin Mobile LG Rumor Touch: Your basic cellphone that works well, but has limited abilities.Pros:-It is very durable. I have had it for almost a year and it has lasted very well, despite the fact that I drop it occasionally.-The camera works well and has many settings, such as zoom, color scheme, and self timer.-Three games come with it: Bowling, Pac Man Vs. Ms. Pac Man, and Tetris, which are all (as far as I have tested them) unlimited versions and are pretty fun when in a boring situation.-Messaging and calling work very well on this phone (I don't really use this cell phone for anything else).-Full slide out keyboard that is easy and really fast to use.-It rarely takes pictures when it is in my pocket, which my old phone used to do a lot.Cons:-It has the general capabilities of a smart phone, social networking, web, google maps, but I don't use any of those settings that much because they are slow and the connection is not generally reliable.-The Virgin Mobile service isn't great.Overall I think the phone is worth the $100 and I would recommend it to anyone who wants a reliable phone that can also work for social networking, web, google maps, and games when needed. I wouldn't recommended this phone if you want to use these kinds of features often and without the likelihood of glitches. I really like this phone for it's ease of use and it definitely gets the job done at the simple cell phone level.", "Date": "October 13, 2011"}, {"Title": "Would not recommend for keeping up with email...", "Author": "Dustin J. Neely", "ReviewID": "R3CHG88PJBQZLN", "Overall": "1.0", "Content": "The email feature sucks - You have to log in your email every time you want to check for messages. If you send a message, it doesn't tell you it sent, it just disappears, to add to the confusion sent messages don't show up in your sent mail folder - not on the phone or in your mail box, so you will have no idea if you actually sent the message.  It does not automatically tell you when you have an email. The only option close to it is setting it to log into your email automatically, which drains the battery and interrupts anything you try to do every five minutes. I.e. if you are typing a text message it will be forever lost if the auto email log-in happens mid text.This is strange but I find it completely obnoxious, you have to use two hands to type because the key board is so wide. You literally have to drop everything you are doing to balance the phone and type.The phone constantly needs to be re-set by removing the battery for 60 seconds because it stops getting text messages and phone calls, which you might not figure out for hours.It does not actually send picture messages/emails, it can't handle it for some reason. It will try for half an hour before it comes back 'failed'The phone has to be 'on' for the alarm feature to work (unlike the BB) so your phone will go off all night if you want to use it for the alarm. Even the silent feature leads to the phone lighting up the whole room.", "Date": "August 8, 2011"}, {"Title": "Rumor Touch", "Author": "Angel", "ReviewID": "R3HSVBQ742IYL8", "Overall": "4.0", "Content": "Great phone. Its size it ok and the web browsing is'nt bad either. Good all around phone but the only thing that I seem not to like is the sensitivity of the screen. You have to press it a little harder than most conventional touch screen phone, especially on the web. Besides that everything is great especially the headphone jack which works for any conventional headphone so you don't need to buy a certain type or model to fit specifically to that type of phone/brand.", "Date": "July 15, 2011"}, {"Title": "Great NO-Contract Phone for the Money", "Author": "B. Ritter \"Petercrissgirl72\"", "ReviewID": "R1K0N3GJ4HGE1Z", "Overall": "5.0", "Content": "I have been looking to upgrade from my old LG Tracfone. It was a $20 phone and it was okay for the money. I liked the Virgin Mobile BEYOND TALK idea... free unlimited texting...and I really like this phone, a definite step-up for me! I love the fact that it's pretty easy to use. Believe me, I'm not too techie savvy and I can figure it out! It's nice, you can access web content. It's pre-loaded with Opera Mini, GOOGLE Maps (way cool-like a GPS in a way). So far I haven't had any technical problems. So far the phone is great! For those that are thinking about this phone and going with Virgin Mobile, use promo code: DYVIV76u .You will get 60 FREE BONUS minutes! You use it when you activate and Top-Up your phone! Who doesn't like free anything these days?!? I recommend this phone for the function, ease of use and plan options. BTW, I also use Virgin Mobile BROADBAND-TO-GO and really like it!", "Date": "December 11, 2010"}, {"Title": "Decent", "Author": "S. Flegal \"SarieSnyd\"", "ReviewID": "R6HAY2PF315ZT", "Overall": "3.0", "Content": "This phone is alright. It serves its purpose but i found that i do have to take the battery out or do the shut the phone off and turn it back on trick quite often. It takes a while to start up, a bit longer then i would like. It is not good at the basement at work so i pretty much dont text on break time which is something i would have liked. It does work at my home tho and when i walk around town which is where i am most of the time so its not horrible. I like the fact that it has a touch screen and a slide out keyboard. I don't like the fact that it kind of pauses while your typing a message and you get an incoming message. Reception and coverage could be better but the reception is definitely better then some i have had in the past.Virgin mobile customer service usually helps with any problems i have so that inst that bad either. I will use my vm rumor touch till it breaks or something or i just feel i want a new phone.It was  gift and I do appreciate that.THANKS MOM! Feel free to ask any comments in the comment box below if I can I will answer them for u.", "Date": "April 25, 2011"}, {"Title": "Works GREAT!", "Author": "sandydeck", "ReviewID": "R1WR9QZG4DO1FS", "Overall": "5.0", "Content": "We bought this phone for our daughter. It arrived quickly and works GREAT! It has parental controls for several features ~ accessing the internet was our main concern. It didn't come with an instruction manual so we had to download it (which was no problem); it is not as thorough as I'd like, but my daughter has figured out all she wants to know. :)", "Date": "March 7, 2011"}, {"Title": "phone", "Author": "mom", "ReviewID": "R11DQ3P0GWA579", "Overall": "5.0", "Content": "The phone was and is excellent. Now, I have to learn how to use it to it's fullest capabilities! All in good time.", "Date": "December 25, 2010"}, {"Title": "Good but laggy", "Author": "Josh", "ReviewID": "R2JEMWEPLRQLTP", "Overall": "4.0", "Content": "This phone is amazing as a first phone for me. But, I've played around with sibling phones like Iphone4 and Droid phones and this is nothing compared to those. I LOVE the layout of the phone. It is very simple and easy to go around. It is laggy though. Sometimes it takes a a few second to open stuff. But, it is nothing that will get me irritated.", "Date": "December 22, 2010"}, {"Title": "I just love the phone", "Author": "cdubmama", "ReviewID": "R3A1HK61FEW1K3", "Overall": "5.0", "Content": "i want to thank you the computer said its not shipped but i got the phone today i have been in heaven thank you so much", "Date": "December 5, 2011"}, {"Title": "Get a smartphone instead.", "Author": "webbie-20", "ReviewID": "RR7ZCA0E9R9V8", "Overall": "3.0", "Content": "I would NOT recommend the LG Rumor Touch.  Virgin Mobile's support is minimal and customer service is not familiar with how to use the phone at all.  The device has lots of features, but interface is extremely un-intuitive and locked down, so you aren't allowed to add apps or customize it. Although there is a video camera, it's only 2MP and lacks a flash or sound so will be crude. The phone does not support wifi, tethering, Android, or Adobe Flash. The CPU is very slow if you have more than a few photos or MP3 in it. The touch screen isn't fast or precise enough , so you often end up choosing the wrong feature. If you want to load all your existing phone contacts there's no way to do it other than manually, and to backup your contact list you have to pay a monthly fee for the Contact Vault. Also the Email + IM app is designed to exit from memory after a short time so you can't enjoy push technology. The vendor rarely comes out with software updates. The best thing about this phone is nice keyboard and good IM software for all the major services, but a full battery charge will only last about half a day.", "Date": "December 27, 2010"}, {"Title": "Monthly fees to backup your contacts and use dowloaded ringtones", "Author": "P. Miller \"Motherboard\"", "ReviewID": "R3J6WLWOXDADBM", "Overall": "3.0", "Content": "You know the old adage, you get what you pay for.  The good news is that the price for the plans are great and there are no contracts.  Of course there are certain drawbacks.  You must pay for Virgin's Contact Vault if you want to backup or import your contacts, otherwise you must enter them manually and they can't be backed up on a SIM card as these phones don't use them.  This is a HUGE drawback if you have a lot of contacts and don't want to be held hostage and pay for Virgin's backup service.  There aren't many preloaded ringtone and they aren't very appealing.  This is so you will purchase ringtones from Virgin and then be charged a monthly fee to use them.  Also you must use a Virgin phone.  The bottom line is if you don't mind using one of their phones and having to pay monthly fees for the extras that you will almost certainly want, Virgin Mobile might work for you.", "Date": "February 28, 2011"}, {"Title": "on ok phone............. so far", "Author": "nashua", "ReviewID": "R30HTIR8VRQZEP", "Overall": "4.0", "Content": "well ive been eyeing this phone for a verry long time and i thought as soon as i got i would love it well i like it i mean i like the touch sceen and all the aothe stuff like qwerty bored and etc but i mean i dont got any min.on it so its really boring so if ur going to buy this phone get the mins with it", "Date": "November 26, 2010"}, {"Title": "Phone might be decent, but Virgin customer service is non-existent", "Author": "Amy Roberts", "ReviewID": "R1EWLNLP94NYZY", "Overall": "1.0", "Content": "The phone itself is okay - not as great as a real smart phone, but for the price, it's totally passable. What is completely missing here is any type of customer service AT ALL.  I have been trying for two weeks to get my old mobile number moved to my Virgin phone.  Every time I call, they tell me that they're experiencing a problem, because the serial number on my Virgin phone is somehow connected to some other account, and they can't seem to fix it.  Every time I call, they tell me they're \"escalating\" the problem and to call back in 48 hours.  TWO WEEKS later, I still can't use my phone, and they still can't give me an answer.  If you're starting with a new number, you might do fine, but if you're trying to keep your number from another carrier, do yourself a favor and skip Virgin Mobile.", "Date": "November 24, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.0 Megapixel Camera And Camcorder\nKeyboard With Dedicated Emoticon Key\nMicroSD Memory Slot For Extra Storage\nBluetooth Connectivity", "Name": "Virgin Mobile CDSVMRUMORTO Rumor Touch", "ImgURL": "http://ecx.images-amazon.com/images/I/51kfl94AsxL._SY300_.jpg", "ProductID": "B003OUHP7O"}}