{"Reviews": [{"Title": "Great Service", "Author": "Kimberly A. Barnett", "ReviewID": "RKMG84JOKWIEO", "Overall": "4.0", "Content": "Product exactly as described.  Great Service - received in two days.  Really good value with double/triple minutes.  Will buy again.", "Date": "May 19, 2012"}, {"Title": "This Is A Fantastic Deal For This Card, Buy 'Em Up!", "Author": "MJNC367", "ReviewID": "R3D5I7FI6KZ5ZT", "Overall": "4.0", "Content": "This is a great deal for this card, if you live in a bizarro world and like  to pay a lot more for this item that is really sold for at 30 everywhere. I actually give this 1 \"planet\". Be wary people, my previous 2 opinions weren't allowed for being to accurate. Yes, that's right, believe you me, this is one great deal, a fantastic deal, not.", "Date": "January 26, 2013"}, {"Title": "Fantastic SVC - had ordered 16th-Rec'd today - 18th", "Author": "SirTaz \"Geniebugged\"", "ReviewID": "R1Z265Z7SPHX3J", "Overall": "5.0", "Content": "BUYING here on Seller's reputation meeting Amazon's High standards............. and holds their company to these standards of customer service etc.Tracfone itself has the 'absolute nastiest outsourced CS' we have ever experienced.  Americanized names - yet can't speak English, much less understand it. Even in emails!It is a very good buy In particular if one has dbl/triple minutes on phone-added to tele [from tele] within 3 minutes - 360 with the triple minutes on the Samsung", "Date": "May 16, 2012"}, {"Title": "I must be reading the prices wrong", "Author": "David Beattie", "ReviewID": "R2S5RZ1QI9ZGXS", "Overall": "1.0", "Content": "I must be reading something wrong someplace on somebodies website on 1 site the price is $25.98 in one spot then you click on it to order it and then it is $43.89 with $4.99 shipping at both spots but then when you look on Tracfones website the same thing is 29.99 with no shipping just tax the total there was $32 plus it gets added to your phone right from the site so why is it so much more here and 5 bucks for shipping is A well I cant say here what I think about that.", "Date": "October 4, 2013"}, {"Title": "Love buying minutes on-line!!!", "Author": "peter4", "ReviewID": "RIB136J5RMS4E", "Overall": "5.0", "Content": "I love buying minutes on line and then putting them in the phone myself, instead of having to put up using the phone to call someone to give me a long number to put into the phone.", "Date": "September 26, 2013"}, {"Title": "Great deal!", "Author": "JDG", "ReviewID": "R1HYJRQQX80T1O", "Overall": "5.0", "Content": "I was skeptical when I saw a discounted tracfone card, but figured it was worth a try.  Quick delivery, worked for my triple minutes and accepted a bonus code... I'll definitely do this from now on!", "Date": "May 21, 2012"}, {"Title": "tractphone airtime purchase..", "Author": "johnthompson", "ReviewID": "RDLNY30K1XFW2", "Overall": "5.0", "Content": "it was more than icould ask for  very good people to do business with. it was confusing at first but I caught on and every thing was fine", "Date": "February 21, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003D7CXXY"}}