{"Reviews": [{"Title": "Nice - Mobile Phone", "Author": "elytron", "ReviewID": "RAPC42Y53Y82X", "Overall": "4.0", "Content": "The Samsung S3600i is a well constructed phone. Sound quality on mine is good, I like the speaker-phone function. It uses a proprietary connector for Charging, USB, and earphone. Comes with a charger, USB cable, earbud, battery and Chinese user manual. Mine came with Chinese characters on the keypad. This is the International version obviously.", "Date": "January 10, 2012"}, {"Title": "Great phone", "Author": "David R.", "ReviewID": "R39QTJEF9DMI11", "Overall": "5.0", "Content": "This a great phone -- reception actually works better than previous phones I had, meaning I can now use it from my home in a rural area that left previous phones looking for a single band.  Menu, sounds, options all super and well thought out.  No problems.", "Date": "December 28, 2011"}, {"Title": "Happy Husband", "Author": "Victor", "ReviewID": "R2HDJL5HZD78CD", "Overall": "5.0", "Content": "My wife has always had trouble with reading the numbers and I didn't want to get the oversized letter type phone, but this one has easy to read larger numbers which is good for her. Also the flip is her favorite as she likes the ear to mouth distance. I know, I could have bought the latest Samsung big screen but she likes the smaller phones that fit in one hand and are slim like this one. We also travel out of the country a lot and switching sim cards on an unlocked phone is a pleasure.", "Date": "June 20, 2012"}, {"Title": "Nice phone, but be aware that some carrier features may not work", "Author": "David Studhalter \"Ionus\"", "ReviewID": "R2JBED9AOPLC3S", "Overall": "4.0", "Content": "This is a feature packed phone for non-smartphone accounts. I use it with a t-mobile prepaid plan. It works fine, except that you can't access the t-mobile store via web and t-mobile doesn't support extra features, like custom ringtones. To me, this is no big deal. The micro SD feature is nice, and the camera is better than most cell phone cameras. The voice memo feature works better than most phones too.I unfortunately destroyed my phone by running it through a washing machine... few phones will survive this... but I liked it well enough that I'm ordering another one. Note comes with international capable charger, which may be a plus for some people.", "Date": "March 6, 2011"}, {"Title": "Nice and Loud", "Author": "The Analyst", "ReviewID": "R2HRAYZMYJ126V", "Overall": "5.0", "Content": "Great phone with good reception, loud speaker, and loud ringer. Recommended for those that need a good phone. The camera included is not too bad. Definitely not like the one on the iPhone, but good enough for emergencies.", "Date": "October 24, 2012"}, {"Title": "Almost everything I wanted", "Author": "J. Waddell \"PC User\"", "ReviewID": "R1AJIMN0KZMUBY", "Overall": "5.0", "Content": "Good size, excellent battery life and pretty screen. I do miss the voice recognition that my old phone had, but I can live with it. Took me a little while to make it connect with bluetooth to my truck automatically, but finally managed. A little more owner's manual would have helped. (Yes, I'm odd. I read owner's manuals.)", "Date": "October 1, 2012"}, {"Title": "got it for the elder", "Author": "Michelle", "ReviewID": "RFE1EM5JUQVLK", "Overall": "4.0", "Content": "This was for my father in law who needed a simple phone with large buttons and easy to use. This was perfect for him. It comes with a good size buttons and the sound is loud and clear. No hassle.", "Date": "August 1, 2013"}, {"Title": "Simple  But  Serves My Purposes", "Author": "J's Mom", "ReviewID": "RAZD0OW05IAB6", "Overall": "4.0", "Content": "Wanted a simple but essentially equipped phone and this one fits that purpose.  I only wished it came with a case.  Other than that, this phone works perfectly and the battery power is excellent.", "Date": "June 20, 2013"}, {"Title": "Phone's battery is dead when I got it.", "Author": "Maplegirl", "ReviewID": "R372JD7H5GHRRT", "Overall": "1.0", "Content": "The phone is supposed to have Chinese. That is the reason I bought it for my parent. My friend bought one, same model and color from the same seller shortly before I placed my order. Interesting that the one I got doesn't have Chinese available and the battery is dead. I guess I was very very unlucky getting a probelmatic one. Very disappointing.  Waste of shipping money for BOTH ways which represents 27% of the phone cost itself.", "Date": "June 3, 2013"}, {"Title": "Good phone, mine come damaged", "Author": "Jorge", "ReviewID": "R2PC1FLBZ7I673", "Overall": "4.0", "Content": "This was a birthday gift to my dad He only use it for a few minutes and told me that the the calls sound was Ok and the phone is easy to use.Phone battery never charge and we return the phone the next day, 20 day later we got the refund from seller.Good phone but check it as soon you receive it", "Date": "April 30, 2013"}, {"Title": "Very nice, solid phone but...", "Author": "achami06", "ReviewID": "R24M47JD7RKRYA", "Overall": "1.0", "Content": "call quality is terrible. I bought it for my father and when he calls me the shortcoming is immediately obvious.", "Date": "March 5, 2013"}, {"Title": "Bought it for my parents - works as expected", "Author": "Gurleen Sandhu \"Maverick Singh\"", "ReviewID": "RHAHS4RT2ISFE", "Overall": "5.0", "Content": "Bright display and large numbers was my key requirement as my parents wanted something easy to use. Works just fine, good reception and easy to navigate menu.", "Date": "February 16, 2013"}, {"Title": "excellent - does it all without bulk.", "Author": "shonuff \"stuff\"", "ReviewID": "R25IWQ17QR6NR3", "Overall": "5.0", "Content": "would purchase again.  would reccomend to all - has the complete package without bulk a keeper. quality product,  get one", "Date": "February 8, 2013"}, {"Title": "a good counter", "Author": "MaggiMike", "ReviewID": "R3B2KXYOWYIY5N", "Overall": "5.0", "Content": "the best count i have done, because i can't get any Samsung S3600i in Germany.I don' like Smartphones!  At last the price is the best.thank you", "Date": "September 29, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003EEME8A"}}