{"Reviews": [{"Title": "Total Disappointment", "Author": "Hugo", "ReviewID": "R2K584U1G56FJA", "Overall": "1.0", "Content": "Well, what can I say...I purchased this \"new\" phone from Worldwide Distributors for my daughter's christmas present. I wasn't going to write this review until the phone started presenting some problems after 2 months of use. Some keys were not working, including the BB key, which gives you access to all he phone features. I had no other choice then take it to the local blackberry shop. For my surprise they told me that this was a used phone, that it had been repaired before and even had some kind of silicone internally from the last repair. Thank God they managed to repair the phone but the technician told me to use it very carefully as it can fail again anytime. I spent close to $100 for the repair.There is no way I can recommend to buy any item from this seller again. I've been thinking about sending a claim through the International Commerce Chamber for this situation. I live in Venezuela and I don't know if they will respond somehow for this deceit. Very sad situation....", "Date": "March 16, 2011"}, {"Title": "exelent", "Author": "Lucila", "ReviewID": "R299M5OFXF7L9Q", "Overall": "5.0", "Content": "Hi everything was ok , I received my order perfectly and it works fine, it is very nice and it cames with everythin the cd, charger, all.I am very happyYours sincerly", "Date": "September 5, 2010"}, {"Title": "the phone is a marvel", "Author": "Hugo Viana", "ReviewID": "R24MMIWRKOKK4A", "Overall": "5.0", "Content": "I just got the phone and arrived very well packaged, the new phone well sealed with all tags, along with its latest software installed, I recommend buying this product, very good. thanks to the seller.vVenezuela....................", "Date": "April 1, 2011"}, {"Title": "Excellent!!", "Author": "Venezuelan", "ReviewID": "R2C0QIGQOAPFQR", "Overall": "5.0", "Content": "Everything was excellent. The cellphone came all perfect with all its accesories. I have no complaints. It was delivered on time and works perfect here in Venezuela. Thank you so much!", "Date": "December 25, 2010"}, {"Title": "So far, so good!", "Author": "Kati Mendez \"Kati\"", "ReviewID": "R2787BJHUAPCK9", "Overall": "4.0", "Content": "After having a Blackberry phone with a roller ball...going to this one was heaven! The scrolling pad (not sure on the specific name, but it's not a roller ball!) is SO much better than the ball - it doesn't get stuck like the ball did, and it's easy to touch and scroll up, down, side to side, etc..The keys are pretty easy to use to type - I guess if you were to have bigger fingers it might be a little bit harder, but I have had no issues with it really.The phone is very resistant to damages, as I've dropped mine a million times and it still barely has any scratches or 'blemishes' :)  The screen has even held up really well and there are no marks or scratches on it either, which is amazing, coming from a mom of two who always gets her phone taken away and thrown, tossed, dropped, chewed on, etc., by her kiddos.  hahaOverall, a great phone so far, and I've had mine about a year now, if not more.  I'm happy with it, as my main concern with my last blackberry, was with the rollerball, and because this one doesn't have that, I've had no big issues with it.  It's got Blackberry Instant Messenger which I could not live without!!", "Date": "November 1, 2010"}, {"Title": "DISAPPOINTED", "Author": null, "ReviewID": "RNVK44ZUUABL8", "Overall": "1.0", "Content": "I ordered a blackberry from this comapny yes i got it fast but they sent the wrong phone the seller lied to me and then i asked for the white he told me they have many in stock go ahead and order when i did the red came. i did not want the frost blue either. how can you just from a white BB to a Red one. this is DISAPPOINTING i will NEVER order from you all again and i would advise no one to. they only WANT your money.", "Date": "December 6, 2010"}, {"Title": "BlackBerry Gemini 8520 Curve Unlocked Quadband GSM", "Author": "luis leonardo jimenez santafe", "ReviewID": "R1QQ3XYPKVIGJH", "Overall": "5.0", "Content": "Thanks to Amazon I bought excellent phone, I received it in perfect operating condition and ready for use here in Venezuela in any of the operators ... the same way by the seller. I recommend this product.", "Date": "October 31, 2011"}, {"Title": "Bad", "Author": "Pau", "ReviewID": "R3RZMYGBOYKBHE", "Overall": "1.0", "Content": "Unfortunatly, the device I bought didnt work propertly. In fact, the keyboard doesnt work, and also the box PIN number it is different from the one which is inside the device.I bought it as a new phone but Im sure it is not.As I live in Argentina, its difficult for me to return it. Definetly I will never recomend to buy anything from this seller", "Date": "October 11, 2011"}, {"Title": "very disappointed", "Author": "sgm", "ReviewID": "R2HAN5EU82KW99", "Overall": "1.0", "Content": "the good part was it was unlocked and easy to use with my sim card, but the O,I and K keys don not work", "Date": "April 11, 2011"}, {"Title": "Me gusto llego en excelentes condiciones", "Author": "Helen Reyes", "ReviewID": "R21VDK8VSDJ7WT", "Overall": "4.0", "Content": "Compre este producto porque ya estaba recomendado por otros y ademas funcionaria ien en mi pais que es venezuela estoy aprendiendo a utilizarlo pero llego en perfecto estado no le falto nada, con su caja , el manos libre, cd y un manual de bolsillo su cable de conexion. Muchas gracias estoy complacidade haber comprado este producto.", "Date": "April 18, 2011"}, {"Title": "My white BB, Love it", "Author": "angie", "ReviewID": "RND4BWHWYLRL0", "Overall": "5.0", "Content": "Hace mas de un año que me regale un BB 8120 como regalo de navidad y desde entonces soy BB adicta jejeje. Pero mi BB tuvo un problema de software y crei que lo habia perdido para siempre, asi que decidi regalarme uno nuevo. Luego de mucho leer, elegi este blackberry y a casi todas las personas que veia con uno igual les preguntaba si se colgaba o cosas asi y todo el mundo me daba buenos comentarios, asi que me decidi y lo compre. Posteriormente salve mi antiguo BB, lo vendi y me quede con este. Me encanta! Es super rapido, no se cuelga, muy ligero y lo mejor, tiene el teclado completo", "Date": "January 26, 2011"}, {"Title": "Great BB", "Author": "GB", "ReviewID": "R1W8Y0YHUF51X4", "Overall": "5.0", "Content": "It's my 17 BB 8520 I have purchase on the last 20 months or so It is a great phone to use overseas and to use in Africa, Asia, North or South America with any company sim card. It so un-expense phone that you can give away after few months and purchase another", "Date": "September 12, 2013"}, {"Title": "failure trackpad", "Author": "Dario Leon", "ReviewID": "R2V36TYS1U70Y1", "Overall": "2.0", "Content": "El equipo salio defectuoso. El trackpad funcional con dificultad. Debo llevarlo a reparar. No me siento muy satisfecho por la compra. de esta manera no lo recomiendo.", "Date": "February 8, 2013"}, {"Title": "Review", "Author": "Alex Perez", "ReviewID": "R1ELHUZ2IK8TUG", "Overall": "4.0", "Content": "Product was as described and  advertise arrive on time or within the promise arrival time , totally satisfied  with my purchase , Price was good", "Date": "October 29, 2012"}, {"Title": "excellent", "Author": "rosy", "ReviewID": "R3NYUT984ZVUZO", "Overall": "5.0", "Content": "excellent phone. blackberry is the best mark on the market for smart phones. recommended for those who like to walk always communicated with the world", "Date": "August 11, 2012"}, {"Title": "MARISOL", "Author": "Eligia  M. Acero P.", "ReviewID": "R35DF1QIS64ASK", "Overall": "4.0", "Content": "Blackberry Gemini 8520 Curve Unlocked Quadband GSM Smart Phone with 2 MP Camera, Bluetooth, Wi-Fi--International Version (WHITE), HE ESTADO UNSANDO ESTE EQUIPO Y ME PARECE QUE ES MUY BUENO Y CUMPLE CON TODAS LAS EXPECTATIVAS QUE YO ESPERABA, CONSIDERO QUE ESTA EMPRESA ES SERIA Y RESPONSABLE. PORQUE CUANDO COMPRE EL EQUIPO COMPLIERON CON LOS DIAS ESTABLECIDOS PARA ENVIAR EL EQUIPO. GRACIAS A USTEDES POR CUMPLIRME A TIEMPO....", "Date": "June 18, 2012"}, {"Title": "excelente", "Author": "Samuel Rodolfo Paredes Garcia", "ReviewID": "R1R945R7AE2QQJ", "Overall": "4.0", "Content": "el vendedor es muy atento y responsable, el equipo llego en buenas condiciones tal cual como estaba en la publicación, lo recomiendo", "Date": "April 9, 2012"}, {"Title": "bien.", "Author": "César Ortega", "ReviewID": "RRKWSO8O98YH8", "Overall": "3.0", "Content": "Todo bien, sin problemas. Solo que el cargador no era compatible con las conexiones en Venezuela. Tuve que comprar un cargador. De resto todo bien.", "Date": "January 6, 2012"}, {"Title": "Black Berry Geminis", "Author": "Maribel Adams", "ReviewID": "R3C7A840RM9NOM", "Overall": "5.0", "Content": "Compra muy buena, conforme con el producto y el vendedor. Entrega en tiempo indicado. Contenta con la adquisición. Confiable. Excelente", "Date": "December 26, 2011"}, {"Title": "They cancelled my order", "Author": "NenaOchoa", "ReviewID": "R32R07ATZK75SX", "Overall": "1.0", "Content": "They cancelled my order.I was to receive today a blackberry unlocked but instead i received an email cancelling my order.1 of Blackberry Gemini 8520 Curve Unlocked Quadband GSM Smart Phone with 2 MP Camera, Bluetooth, Wi-Fi--International Version (WHITE)I will never buy from this store again.", "Date": "September 20, 2011"}, {"Title": "es usado, is used", "Author": "luis manuel aguana martinez", "ReviewID": "R27Z7LRV4T6LP6", "Overall": "2.0", "Content": "el telefono tiene una falla en el conector de carga, no es nuevo, yo soy comprador desde venezuela, por lo tanto no recomiendo comprar porque es muy riesgosoThe telephone has a fault in the connector of load, is not new, I am buying from venezuela, therefore I do not recommend to buy because it is very risky", "Date": "August 24, 2011"}, {"Title": "NO PUDE ADQUIRIRLO", "Author": "joel ramirez", "ReviewID": "R1AGGJCZ7W1S61", "Overall": "1.0", "Content": "DESPUÉS QUE COMPRE ESTE EQUIPO HUBO PROBLEMAS CON EL ENVIÓ Y ME REEMBOLSARON MI DINERO, PERO PERDÍ 30$ ME IMAGINO QUE DEL ENVIÓ. :(MUY MALO PARA MI.", "Date": "February 8, 2011"}, {"Title": "Venezuela - muy buen telefon", "Author": "Augusto Lopez", "ReviewID": "R10UK5JMH9OUNW", "Overall": "5.0", "Content": "Muy buen teléfono se lo compre a mi madre y esta muy contenta de hecho en mi familia todos hemos tenemos este modelo y nos han salido muy bien.", "Date": "April 16, 2011"}, {"Title": "QUestion", "Author": "Andre", "ReviewID": "R1CJ3ESO1IDSCF", "Overall": "1.0", "Content": "I would like to know if you can use that phone in Venezuela, because it says unlocked but does not work for Sprint or Alltel...THanks", "Date": "December 9, 2010"}], "ProductInfo": {"Price": "$89.55", "Features": "Unlocked Quad Band: GSM 850/900/1800/1900 and GPRS capabilities This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\n2.0MP Digital Camera, High-resolution display with 320 x 240 65.000 colors TFT and 2.46 inches, 35 key backlit QWERTY keyboard, Trackpad, Intuitive icons and menus, Bluetooth? enabled with Stereo Profile (A2DP), Wi-Fi? 802.11b/g enabled\nVideo format support: MPEG4, H.263, H.264, WMV3, Audio format support: AAC-LC, AAC+, eAAC+, AMR-NB, WMA9 (.wma/.asf), WMA9 PRO/WMA 10, AAC-LC with 3.5mm Headset Support\nTalk time up to 5 hours - Standby up to 17 days\n35 key backlit QWERTY keyboard with touch-sensitive optical trackpad", "Name": "Blackberry Gemini 8520 Curve Unlocked Quadband GSM Smart Phone with 2 MP Camera, Bluetooth, Wi-Fi--International Version (WHITE)-", "ImgURL": "http://ecx.images-amazon.com/images/I/41GEtBZ7-DL._SY300_.jpg", "ProductID": "B003AU7IFM"}}