{"Reviews": [{"Title": "If you just want a phone. This is it!", "Author": "Alan B. Richards", "ReviewID": "ROOLQ2TE9IXWB", "Overall": "5.0", "Content": "Update: I stand corrected. GreatCalls now uses the Verizon network. They were using Sprint when I first joined. I understand Verizon now has a healthy sized piece of GreatCall. But the service continues to be very good.I've been on the GreatCalls Jitterbug system for about 3 years now and have never once regretted the choice. I've never experienced connection problems, customer service difficulty, or any other problems worth mentioning.The phone, I have the original Jitterbug (that was replaced with the J). It is a bit heavy in the pocket but it's also rugged and durable. I even accidentally drove over it in my pickup. The phone continued to work well. Try that with one of these high tech smart phones!  After over 3 years, I am only now thinking about replacing the battery. A new battery will hold a charge for 90 hours. Mine is now down to 30-40 hours between charges. But it still works. The buttons are large enough for my fingers, the sound is good, and screen quite readable even with my bad eyes.The service has been outstanding. Something that can not be said for most telephone services. GreatCalls uses the Sprint network which has provided me good service even in the New Mexico desert, the Rockie Mountains, and even 30 miles off-shore. I'm a low phone user so 250 minutes lasts me a couple of months. No, the per-minute cost is not the best. But the total monthly cost is as good or better than most I've looked at.I'm not some young kid who needs or wants all the bells & whistles. But neither am I a senior citizen. I'm a middle aged man with no kids at home and who doesn't use my cell phone for business.  I don't need a camera, or internet connection, or an mp3 player. All I wanted was a phone. One that worked well. I got what I asked for at a good price.And no, I haven't been paid to write this review. But a good product/service should be given the credit it's due. If you want a mobile phone that is just a phone. That is good & reliable and you aren't a gabber for hundreds of minutes a week, Jitterbug is the phone for you.", "Date": "January 12, 2011"}, {"Title": "Easy to use but not for the faint of hearing", "Author": "mphsangel", "ReviewID": "RKKADTV13RB2B", "Overall": "2.0", "Content": "After hooking my 88 year old mom up with my phone provider and learning that she couldn't operate a regular cell phone I bought this one for her. Because there's no complicated fancy gadgets to deal with she can actually operate this one.  The big problem is she can't hear it ring. There are a couple of ring tones but the loudest one is a typical phone ring that sounds like the phone ringing on television so consequently she doesn't think to answer her cell phone.  My husband and I both have been in the room with no TV on and could barely hear it ringing. It's quite a bit lower than any regular cell phone. There is a vibration option however it's a very light vibration and there's not an option to combine a ring tone and vibration together like other cell phones.I called customer service and was told that this is a common complaint so that's why they offer the lanyard.The phones easy to use for making calls but even for good of hearing - it's a challenge to depend on.If we had figured out before the 30 days were up that the reason she didn't answer the phone was because she couldn't hear it ring, this thing would have gone back immediately.", "Date": "March 31, 2011"}, {"Title": "Jitterbug phone and service", "Author": "Gnome D. Plum", "ReviewID": "R2KC0NWK8ALZ15", "Overall": "5.0", "Content": "The Jitterbug is a basic phone, no email, no IM, no internet access at all. As a matter of fact, it doesn't have a sim card ...which means neither Verizon nor AT&T; can support it. I went with Great Call [...] as the access provider -- it may be through Sprint (?), but the billing is thru Great Call; it's fine, not a ripoff, but just make sure you know what you're getting when you buy the phone!The phone and its service are targeted to older individuals: big buttons, an honest-to-goodness dial tone, a medication reminder service, a 24/7 advice nurse, no contract ... see what I mean?Also, I changed my mind about the color I wanted and Amazon said it was too late to change the order; I e-mailed Jitterbug and they were happy to cancel the white phone for the graphite one. Nice, guize!", "Date": "June 6, 2011"}, {"Title": "It is not the perfect solution, but far better than nothing.", "Author": "Customer", "ReviewID": "R15AW30WGF8E6H", "Overall": "4.0", "Content": "The idea of the Jitterbug Phone for seniors is a great idea, but the product falls a bit short a few places. My mother never wanted a cell phone, EVER. A month ago she had congestive heart failure and ended up in the hospital for a few weeks. I live almost 1800 miles from her, so I flew right out and met my sisters there. I talked her into finally allowing me to get her a senior friendly phone, and the Jitterbug is the one that came to mind.  There was a retailer within a few miles of the hospital who sold the phones and I went to pick one up. After charging it and setting it all up for my mom I gave it to her the next day. She has had it a couple weeks now and I talk to her 3 to 5 times a day while she is at rehab and I feel I have a good idea of the ins and outs of the unit now.Let me start by saying that my mother is 85 years old. This was her FIRST EVER cell phone. Being the one on the other end of the calls, I have noted that the sound quality on my end when she uses it is a bit muffled. Not from her oxygen tubes in her nose, that makes her sound congested, but the quality of the voice over the phone. Even when my sister is there and she talks to me I get the same thing. The best I can describe it as is the voice is mixed in with a hum and muffled. Now my hearing is not the best, so perhaps it is me, but then again I can hear fine when talking to other people on their cell phones. So when I talk to my mother I have to press my phone (cell or house) on my ear and pay close attention.Next is the charger. Why they make such a thin plug for senior citizens is beyond me. My mom struggles to plug the charger into the phone and I am fearful that she will bend or break the plug. If Samsung were smart they would have used a simple round plug that was not super thin. There are a lot of older people who have a hard time seeing well and may have arthritis. So I am expecting I'll have to replace the charger soon, but we shall see.I decided to not opt for mom to have voicemail or call waiting on the unit. Again, she is 85 and would have found that too confusing. I simply needed a simple cell phone for her that worked and could be with her at the hospital, rehab and when she gets home (which is tomorrow).Beyond those points, I am not unhappy with the unit. It works, is small enough that my mom can place it in her purse or pocket and best is that it is simple. I noted other product feedbacks here with people complaining about its size, weight and that it looks like it came from the 80s. You need to realize a few things.1. The phone is designed to be simple to use. It has the basic number buttons, an on/off button,  speakerphone button, a YES button, a NO button and an up/down button. If you are buying this for yourself and you are not a senior citizen or you are a senior who is very familiar with cell phones then you should look at a higher end phone and stick to a major cell carrier.2. The phone is made a bit larger than the small flip phones available from the major carriers. Consider that seniors will find it easier to hold and the buttons are large for ease of use. This is intentional. (as for the comment claiming it was like a phone from the 80's. did that feedback person ever own a cell phone in the 80's? I did, those where either fixed into your car OR were big bags and huge by todays standards.)3. You can use the GreatCall provider to program the phonebook OR do it yourself. This is great since my mother would never figure that out. I had them set up 4 numbers initially, I added 3 later and if I decide I can have the provider add more later (I pay for her service).4. GreatCall (provider) offers some things like an available RN 24x7 and programmed into the phone and some other apps designed to help seniors (like medication reminders and wellness calls). Do these take care of my mother for me? No, but it is nice to know that if she wants to call a nurse she can, if I forget to remind her to take her meds they will and if I forget to check in on her one day they will do it for me and let me know of a problem.In the end the phone helps offer ME peace of mind as well as some for my mother. It is not a perfect phone or service, but it is a good start.", "Date": "April 9, 2012"}, {"Title": "Rates listed are wrong", "Author": "Terry Morris", "ReviewID": "R2DPXDVBIVEXUU", "Overall": "2.0", "Content": "The monthly rate plans listed here are incorrect.  Some of them no longer exist.  You better check with Greatcalls before you decide to buy.", "Date": "March 4, 2011"}, {"Title": "Jitterbug phone", "Author": "Martha J Hudkins \"Martha\"", "ReviewID": "R1LYRMO7TBP1H", "Overall": "5.0", "Content": "The jitterbug is just the right size for my Mom who is in a nursing home.The buttons are easy to see and she can control the volume easily.", "Date": "October 24, 2011"}, {"Title": "Nice Phone", "Author": "Steven Balog", "ReviewID": "R1Z0QXQAHLZL2E", "Overall": "5.0", "Content": "This phone is very simple to learn how to use. I got this for my dad who will be 89 in a few months. He had no idea how to use this phone, but he caught on very quick.", "Date": "August 18, 2011"}, {"Title": "Jitterbug Review", "Author": "Jack", "ReviewID": "R1DZ85U9BWBMSV", "Overall": "5.0", "Content": "Great product.  My 94 yr old father loves it. Big buttons, easy to view screen, and a dial tone just like he grew up with.", "Date": "April 29, 2011"}, {"Title": "Love my Jitterbug!!!", "Author": "ChattyLinda11", "ReviewID": "R16TN8K780RFRB", "Overall": "5.0", "Content": "Old or young will Love this Phone.. The numbers are big and clear when you are making a call, the Prices are comparable with other phones, but you dont have to sign a contract, which is something I love. I finally can text too, alittle slow, but at least I can do it.. Was afraid I couldnt figure out the phone features, but they have it set up to find out anything you need to know, by dialing one number or they give you enough pamphlets to read so you can figure it out by yourself.So if you want a really nice phone, with really nice features, then Buy a JITTERBUG!!", "Date": "June 9, 2011"}, {"Title": "Buyer Beware of what you are NOT told!", "Author": "L. Haynes", "ReviewID": "R25M7IV5111IGJ", "Overall": "1.0", "Content": "Is a product like this needed? Yes. We do need items (like a cell phone) with simple, easy-to-use and easy-to-see functions. For that reason, the Jitterbug gets a star from me. But this product loses 4 stars because of the scam that is GreatCall (the only communications supplier for this phone). What happens when you no longer require the services of your activated Jitterbug phone? What if you want to wipe clean the memory and donate it? How do you do that?The answer is that you can NOT wipe your information off of this phone. Buyers (and sellers) of these phones: beware. According to the two reps I talked to at GreatCall, once your information is on this phone it is there permanently.When I no longer needed to have this phone for my father, I decided I would donate it to either soldiers overseas or to the local Council on Aging. I called GreatCall to deactivate the phone. First I was asked why I wanted to deactivate it and then I was grilled on what could have possibly been wrong with the service that I no longer wanted it. Then the representative tried to get me to keep the phone for a lower rate (and fewer minutes). After finally convincing the rep that I simply did not want the phone service, she tried to sell me other products that would \"keep my father safe\" (I didn't want to say that he had died; my reasons for discontinuing the service was none of her business). I waited until I received my final bill to make sure the service was indeed deactivated. Then I removed phone numbers from the phone book, but I could not figure out how to erase the incoming or outgoing mailboxes. Nor could I find a chip to remove. I spent two hours searching the web and reading the four booklets that came with the Jitterbug (Customer Agreement, Quick-Start Guide, Activation Guide, and How-To Guide: a total of 249 booklet pages) before I finally called GreatCall again. The rep at GreatCall claimed that the phone log and the phone number assigned to this phone could not be removed. I repeated to her that I wanted to donate the phone (in case she did not understand what I wanted), and she repeated that there was no way that the phone number nor the incoming/outgoing phone numbers could be erased.So I found myself stuck with a usable (and barely used) device that cannot be reused without compromising the phone numbers of family and friends. I hope some other electronics company designs a cell phone that's easy to use and easy to re-use.In the meanwhile, my significant other is in the backyard with a sledgehammer and a Jitterbug having the time of his life.", "Date": "May 31, 2013"}, {"Title": "Terrible service", "Author": "Gifter", "ReviewID": "R1JQAO4K5V459X", "Overall": "1.0", "Content": "Two minutes of operation, months of dealing with charging and other problems from Day One. Horrible customer service, they were all very rude then finally lied and said the phone had water damage and would not be covered...then tried to sell me another one! Avoid unless you feel lucky.", "Date": "November 2, 2011"}, {"Title": "Restocking Fee...?", "Author": "Bob Callahan", "ReviewID": "RU2NQG5RXRMCO", "Overall": "1.0", "Content": "I bought this product for my Mom,she's 73. I was misinformed by Verizon that it could be used on there network,but it can't.So I e-mailed m-e-e and they said sure,no problem all you have do is pay a 15% restocking fee! Now I can understand if the box had been opened or somthing like that,but wasn't !! I relize how tough it is to pick up a small box and put it all the way up on a shelf... come on!!", "Date": "December 3, 2012"}, {"Title": "No carrier options.", "Author": "Alfred Ruisi", "ReviewID": "R1Y99FLYXBXXUT", "Overall": "1.0", "Content": "My Grandfather was bombarded by their advertising and thought it was a necessity for older folks.  I bought it on his behalf and we found out the day it arrived their is no other carrier option then their parent company, so he told me to return it.", "Date": "September 14, 2011"}, {"Title": "Jitterbug Customer Service", "Author": "Lynne R.", "ReviewID": "R39NAYVSHUAXEG", "Overall": "1.0", "Content": "I haven't used this product, I actually was calling their toll free# to inquire about a plan for my 89 year old Mom, who just wnt into a nursing home. When I ask the guy about Lifeline Federal program to offset cost for her, he said I don't know about any \"government\" programs, bye-bye\" and hung up on me! Needless to say they will not be getting a call back. It seems like I had to pick a star, so 1 is the lowest I could choose.", "Date": "February 11, 2013"}, {"Title": "jitterbug phone", "Author": "katherine bozeman", "ReviewID": "R3V8CZCII30H3Z", "Overall": "5.0", "Content": "its a great phone ,easy to use,for those who can,t handle a lot of how to,s you,lllike this one.", "Date": "September 6, 2011"}, {"Title": "The jitterbug j cell phone(graphite)", "Author": "beth", "ReviewID": "R2KTMPHVF4XC6P", "Overall": "2.0", "Content": "I bought the jitterbug j cell phone ( graphite) phone for my 80 year old mother for her birthday, and I have always loved jitterbug because it was a really great phone for her to mulnipulate. However jitterbug greatcall informed me that they can not send a signal to the phone to even activate it, and they should stop selling them at Basic and Amazon and various other places.", "Date": "March 28, 2013"}, {"Title": "Service provider doesn't cover area where I needed to use it.", "Author": "Gisela", "ReviewID": "REQ16WYPZAUEY", "Overall": "2.0", "Content": "Nothing against the phone but the cell phone service provider \"Greatcall\" is the ONLY one that can provide cell phone service for this phone.  In order to know if your phone has service in the area you have to actually purchase the phone and call to get service for their \"system\" to determine if Verizon has cell phone coverage in your area. When you call Greatcall they promote Verizon and how much coverage there is with Verizon, I even told them the area. It's not until I called to get the phone service activated for my aunt that I found out there's no service in her area.", "Date": "March 25, 2012"}, {"Title": "not as advertised", "Author": "dieman", "ReviewID": "R36HJSJJXWISHZ", "Overall": "1.0", "Content": "Product advertised coverage for my whole state but when I went to activate the service I was told that there was no coverage in my area. I had to send it bck.a", "Date": "February 8, 2011"}, {"Title": "only works with Jitterbug network", "Author": "Charles Potts", "ReviewID": "R2DDD3X165ETB2", "Overall": "2.0", "Content": "Nice phone, seems durable, tried to use this for dad on my AT&T; account but it's locked. Only works with Jitterbug service. I was mistakenly told by AT&T; that they could activate it but when I got it, a more educated staff member said \"sorry for the inconvenience\"", "Date": "December 17, 2013"}, {"Title": "not happy", "Author": "Gwendolyn Stover", "ReviewID": "RH23AQHAD9QHL", "Overall": "1.0", "Content": "It did not work in my area when I tried to turn it on, I called and they said there was no service in our area, I think that should have came up when I purchased the phone.", "Date": "December 6, 2013"}, {"Title": "Jitter bug", "Author": "Jim Haley", "ReviewID": "R1T5Y4219NTXXR", "Overall": "1.0", "Content": "This would be a great tele if it would have worked in my AC,,really liked it but no service ,,YES I asked before I bought it and the worst thing is I sent it back as was told to do and I never got my refund,,very shady company", "Date": "February 13, 2013"}, {"Title": "not so great", "Author": "glennis", "ReviewID": "R2T7D596DBIJN7", "Overall": "2.0", "Content": "If you are a normal person, with normal needs I suppose they are adequate but  other wise,be very very careful. I called to establish  phoneservice  for my developmentally disabled son'. I told the operator that he was DD and even mentored her on how to  to help a separate DD adult obtain services. She knew he lived with a caretaker and that I wanted his billing to be separate because I do a lot of traveling.Upoun returning from a trip,his caretaker had  never recieved a bill and the company wouldn't-talk to me about it because  I wasn't liste on the account.! I am Blind and wanted to resolve this quickly soI mailed them a copy of his Guardianshgip papers and a check for $200i9n order to resolve the immediate problem.I could tell they weren't sure it would be found and they were correcte ashamed 0t them selves His  caretaker did help him call me when it first was recieved. I am legally blind and a littleof hard of hearing but I could hEarhim, They SHOULD BE ASHAMED OT THEMMSELVES", "Date": "January 22, 2013"}, {"Title": "not happy", "Author": "serena thompson", "ReviewID": "R2BYMQDGQ2NQ85", "Overall": "1.0", "Content": "There was not an activation card that came with this phone and no one could activate the phone so its basically a paperweight.", "Date": "May 1, 2014"}, {"Title": "OK", "Author": "Donald R Wilkerson", "ReviewID": "R3I7VFPPCJCDT7", "Overall": "5.0", "Content": "Good quality product. I'd highly recommend this to anyone. Well worth the money when it comes to meeting your needs. This is a MUST BUY!", "Date": "March 31, 2013"}, {"Title": "it's easy..love that..!", "Author": "Patricia", "ReviewID": "R37PT3MN3M277", "Overall": "5.0", "Content": "It's simple and easy to use... love that...and I don't have extra words to tell you..easy easy easy easy easy", "Date": "March 28, 2013"}, {"Title": "Jitterbug J cell phone", "Author": "tibetanterriermama", "ReviewID": "RUKRFLNCTMBLU", "Overall": "4.0", "Content": "Not for use for heavy cell phone users but fine for light use.  Sleek, big numbers and audio is fine.  However, their Customer Service is very rude.", "Date": "November 13, 2012"}, {"Title": "It's a phone, not a camera or computer!", "Author": "J. Babbitt", "ReviewID": "RMDL76ZVIU66I", "Overall": "5.0", "Content": "If you are looking for an inexpensive cell phone that reliably makes and takes calls, this is the phone for you.Loud ring tones, super battery with a long time between recharging, and big numbers with a simple keypad. As a person in his 50's, this perfectly meets my needs.If you are looking for a camera or a computer along with a phone, this would not be right for you at all.", "Date": "September 24, 2012"}, {"Title": "stharvell", "Author": "stharvell", "ReviewID": "R2DEUCJ0CRX28T", "Overall": "5.0", "Content": "I bought this phone for my husband who refuses to use a cell phone. It is very simple to use yes and no buttons for question asked.  Signal work pretty well for my rural area.If you are looking for a simple phone that you just make and receive calls, this is the one.", "Date": "July 10, 2012"}, {"Title": "Great Product !!!", "Author": "mary", "ReviewID": "RMT7DATCSR8G4", "Overall": "5.0", "Content": "I love this phone. Very easy to use. Large buttons....clear tone. Customer service is great !!! They will walk you thru any questions you might have.", "Date": "March 26, 2012"}, {"Title": "confusing", "Author": "Good to Go!", "ReviewID": "R8CUMSJLPCOVK", "Overall": "2.0", "Content": "The phone itself is a great tool.  The service and service personnel behind the phone is poor.  They confuse the user by attaching passwords and PINs other than the account number, they apparently don't keep records from one sales/telephone assistant to another, so when you call back on a problem, no one knows what you're talking about. trying to keep your phone number if you switch, forget it.  They won't do it.  We tried switching back to AT&T; family share talk, because my Mother couldn't afford the $50.00 a month any longer, and waited and waited.  AT&T; tried 3 times to get them to switch, even after finding the password and account number.  When I spoke to a person at 'jitterbug' or GreatCall, they blamed it on AT&T.; Also we cancelled the service, and the man told my Mom, it will be cancelled by a specific time, the phone was still connected and working.  after a week, my Mom called back, and they said, 'ok, as of today, you are cancelled.'  Which is the same thing they said a week before.  Again, the phone itself is a great tool, it has a rubber dam around the ear piece, which aides in hearing better, by noise cancellation, the buttons are big, and extremely simple to use, too bad it cant be transferred to AT&T;, but there is no SIM card to place as far as I know.", "Date": "August 4, 2013"}, {"Title": "Sound was horrible", "Author": "Richard C. Porter", "ReviewID": "R4LNKXGG9PIGE", "Overall": "1.0", "Content": "The sound was horrible on this phone. I had to keep asking people to repeat themselves. Only used it for a week. Was so fed up that I just threw the phone away. The phone was so cheap that I felt it wasn't worth the hassle of trying to get a refund on it. I did call the service and got refunded for my unused days. Considering that this phone is intended for the elderly why would the sound quality be so bad?", "Date": "January 5, 2013"}, {"Title": "Outdated phone?  Cannot get service?", "Author": "Donna", "ReviewID": "R1QP2G1W7KGX9Z", "Overall": "1.0", "Content": "I purchased a Jitterbug J at a yard sale for my mother to see if she would/could use a cell phone for emergencies.  It looks new in the box, but when I tried to activate it, I was told that the phone is outdated and could not be activated.  So beware if you buy a Jitterbug J.  I was told I would have to buy a Jitterbug Plus for $79.99.  Unless someone has other info?", "Date": "May 7, 2014"}, {"Title": "Battery sucks", "Author": "P. Lopez", "ReviewID": "R2WIUASTNXQQC0", "Overall": "4.0", "Content": "Purchase this for my parents and they love the phone but the battery doesn't last long so they have to have a charger on them at all times", "Date": "August 14, 2013"}, {"Title": "gratitude", "Author": "Clint Rourke", "ReviewID": "R8L162YS41G6F", "Overall": "4.0", "Content": "Well Amazon you did it again! Lovely phone, just right for us seniors.I was more than pleased to receive and start using this phone instantly....I like the feel of it, and the fact that it is so easy to use is every-thing to me.  No roaming fees and no charge for international callingis certainly a plus...thanks!Rick Vaillanocurt", "Date": "March 26, 2012"}, {"Title": "jitterbug", "Author": "Alvira Lapinskas \"litpanther10\"", "ReviewID": "R21Q69IUHHSHTQ", "Overall": "4.0", "Content": "I DID NOT REALIZE THAT I COULD BUY DIRECT TO GREAT.  I BOUGHT IT FROM YOU AND I HAD TO MAIL IT TO GREAT CALL TO HAVE THEM SET ME UP.  WHY WASN'T I TOLD THIS.  I AM VERY DISAPPOINTED IN YOU.  I HAD TO THE POSTAGE WHEN I MAILED BACK TO GREAT CALL, IT COST ME $10.00 FOR POSTAGE.", "Date": "October 10, 2011"}, {"Title": "No service", "Author": "archrisie", "ReviewID": "R110R96CIM7QLW", "Overall": "1.0", "Content": "You can no longer get connected to service.  You can't buy a plan for this phone.  I just bought one for a blind student of mine and then tried to set up the plan and they no longer connect that particular Jitterbug phone.  You have to get a more recent model. They still service already existing Jitterbug Js, but will not connect new ones. Greatcall Customer service is 1 800-733-6632…check it out.  The seller did apologize and will refund.", "Date": "March 6, 2014"}, {"Title": "Jitterbug phone", "Author": "JVCdisliker", "ReviewID": "R2WEPD7M2LUOTI", "Overall": "4.0", "Content": "Phone arrived on time and everything is as advertised. So far the service has been good and the operators seem willing to help any way they can.", "Date": "September 2, 2011"}, {"Title": "USEFUL NOT PERFECT", "Author": "indore", "ReviewID": "R18UB5ESEZ7NQG", "Overall": "4.0", "Content": "would be nice if samsung welcomed product suggestions.for visually impaired function buttons can be a challenge.also power adapter port not perfect.better then anything else out there but has a ways to go.of course nothing will be perfect for all users.", "Date": "February 15, 2012"}, {"Title": "retired nurse NC", "Author": "Retired nurse in NC", "ReviewID": "R1HI9EPLETF18B", "Overall": "5.0", "Content": "Came to our address within a short period of time, within 4-5 days. Package was secure.  Easy to set up.  Phone is for husband. He likes.", "Date": "September 7, 2011"}, {"Title": "jitterbug basic phone", "Author": "simple person", "ReviewID": "R4NGMO458F1QV", "Overall": "3.0", "Content": "too simple, too oldsamsung & jitterbug should update this phone with a newer and more up to date model.", "Date": "October 11, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Attractive graphite cell phone designed for ease of use with large buttons,  big display numbers, and powerful speakers for a  loud, clear voice\nPay-as-you-go plan offers freedom with plans starting as low as $14.99 a month\nLive operator can assist you 24/7; optional features let you customize your phone\nUp to 3 hours of talk time, up to 300 hours ( 12.5 days) of standby time\nWhat's in the Box: handset, battery, battery charger, Quick-Start Guide, and How-To Guide", "Name": "Jitterbug J  Cell Phone (Graphite)", "ImgURL": "http://ecx.images-amazon.com/images/I/41M9d22Oc7L._SY300_.jpg", "ProductID": "B00301A5GU"}}