{"Reviews": [{"Title": "Great Phone!", "Author": "bonnie schreier \"bonnie560\"", "ReviewID": "R20VPJTLRE6Q60", "Overall": "3.0", "Content": "I WAS VERY HAPPY WITH THIS WINDOWS PHONE,I WASNT SURE IF I WOULD LIKE IT BECAUSE THE LAST ONE I HAD WAS VERY COMPLICATED,I FOUND IT TO BE A GREAT PHONE,EASY TO WORK AND IT WAS PRETTY FAST,IT IS ALSO A VERY WELL BUILT PHONE NOT CHEAPLY MADE,I WOULD RECOMEND THIS PHONE TO ANYONE THAT PERFERS WINDOWS OVER ANDROID,THE SOUND WAS ALSO VERY CLEAR,GREAT FOR MUSIC,GREAT PHONE!  BONNIE560", "Date": "November 15, 2012"}, {"Title": "Terrible Phone", "Author": "Ashlee@Amazon", "ReviewID": "R8QS6FPCTE5MR", "Overall": "1.0", "Content": "First off...the one I got did not work well. It was extremely slow. Second, it was complicated to figure out and ran nothing like any other verizon phone I have ever had. It was a windows phone and the market didn't even work and the internet was so slow, nothing ever opened! Don't buy this phone...it is CRAP.", "Date": "June 19, 2012"}, {"Title": "Great phone", "Author": "K. Oldham \"keooh\"", "ReviewID": "R3F6A298H6IJWL", "Overall": "5.0", "Content": "I did a lot of research before I bought this phone, and it was worth it. It's a great phone with lots of features, and is one of the few phones that include a stylus. The stylus isn't as sturdy as the one I had on my palm treo, but that's ok. It's a 3G (my pre-pay carrier won't let me activate a 4G on their network). I'm very happy with my purchase.", "Date": "March 12, 2014"}, {"Title": "Not up to par", "Author": "Erica", "ReviewID": "R3CEVS1YXROOOF", "Overall": "2.0", "Content": "This phone was completely confusing. It would not let me download the required windows software, therefore I could not use any of the apps, or download other apps. I was unable to restore my contacts from back up assistant and even after hours on the phone with verizon tech support no one could help me figure out this phone. The only thing I can do is text and make/receive phone calls. I spent money on a smartphone, i should be able to use all of its capabilities. I will be return this phone. I do not recommend a windows based phone. Not user friendly at all.", "Date": "September 30, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003MX08EK"}}