{"Reviews": [{"Title": "Not working!!!!!!!!!!!!!!!!!", "Author": "Tasha", "ReviewID": "R3M2HZNE4YKM3H", "Overall": "1.0", "Content": "This phone was bought just last week for me by a friend. She bought in unlocked so I can use it in Jamaica. 2 days after the phone has malfunctioned. This is crazy.. a new fone...and it has stopped working!!!!!!!!!I took the phone to be repaired. Low and behold, the inside was badly corruded and full of moisture. The company that sold this is dishonest as it was supposed to be a new phone! TOTALLY dissatisfied!", "Date": "February 9, 2011"}, {"Title": "DISHONEST SELLER", "Author": "dinesh bhambhvani", "ReviewID": "R2ZK1A1IODY50J", "Overall": "2.0", "Content": "I bought the phone from the seller for my daughter.In about a week the phone crashed.I sent it back to the company to fix it.The company fixed it but the phone crashed again when I tried to update the software.I tried calling the company and the attendant for calls tells me that the technician says that the software is not supposed to be upgraded.I own two other blackberry phone's and I knew what she said was not true.She asks me to call blackberry to solve the issues.I was told that by blackberry the company that sold the phone with the warranty is responsible to fix the device.I was left with no choice but to call my service provider T-mobile to help me with the issue.They did.but I was told the device has no warranty.I am totally disappointed with this company and would never ever recommend anyone from buying anything from them.", "Date": "November 8, 2011"}, {"Title": "Disappointed", "Author": "Katiuska", "ReviewID": "R2GOQN4ORK62YY", "Overall": "3.0", "Content": "I,m very sad because i ordered this blackberry as a gift for my daughter`s birthday.  She really loves fuschia color, and when i saw that you were selling one in this color, i had no doubt in buying it.  As i live in other country, i wrote a delivery adrees in the U.S., bacause i was going there at the time the phone arrived.  But for my surprise, when i got the phone, it was red and not fuschia.  Iam very disappointed because i order 2 blackberry phones, one in red, for my son`s birthday; and the other one in fuschia for my daughter`s birthday.  Now i have two red phones and my daughter saying to me that she doesn`t like that color because it is for boys.My surprise was ruined, and my daughter is really sad because the most incredible gift for her was supouse to be a blackberry in fuschia.As i only spent 3 days in the U.S. i couldn`t return the secong red blackberry.Sorry for spelling mistakes, but i am from Ecuador, South AmericaKatiuska", "Date": "October 5, 2011"}, {"Title": "BLACBERRYS OPINION", "Author": "MAYRA HERNANDEZ", "ReviewID": "R2AW91EII1QAIW", "Overall": "3.0", "Content": "Dissatisfied, NO ONE CAME AS THE PRODUCT IS AS SHOWN IN THE PICTURE, NOT FUSCHIA, VinoTinto COLOR IS ALL AND IS IN THE CABINET. APPEARS NO SLOGAN T-MOBILE DOWN LIKE THIS IN THE PUBLICATION, HOWEVER IS ORIGINAL AND I stay with him. GREETINGS FROM VENEZUELA", "Date": "October 9, 2011"}, {"Title": "Great costumer services", "Author": "Norka \"Norka Mujica\"", "ReviewID": "R1V8D4F2GJ05I2", "Overall": "5.0", "Content": "The cell phone works good, the only thing was that I received diferent color, I bought a Fuchsia one but received a Purple one. However the Seller was excellent and helped me to find out everything I asked him. (It works perfect in Venezuela)", "Date": "August 3, 2011"}, {"Title": "Blackberry Phone", "Author": "Athena", "ReviewID": "ROIFA1T9FWE82", "Overall": "4.0", "Content": "I like this phone because I used to own one a few years ago so I wanted another...  The only problem is the color, it did not real look like Fuchsia,,,more like a purple lavender and the system does not support our local telecommunications internet IP system, although the Wi-Fi works great and the unlocked system is very easy to use in any country...Other than that its A-ok.", "Date": "December 31, 2013"}, {"Title": "muy bien", "Author": "Nereida Luque", "ReviewID": "R2JPVEIOVTGA91", "Overall": "5.0", "Content": "El proceso realizado sin ningun problema, la entrega fue realizada a plena satisfacción, durante el tiempo establecido, se recomienda el vendedor", "Date": "March 23, 2013"}, {"Title": "was so dissapointed", "Author": "Kiki Jay", "ReviewID": "R3O36TJXK7SK7W", "Overall": "2.0", "Content": "the name of the product just misrepresented it self http://www.amazon.com/gp/product/B003BNYD24/ref=cm_cr_ryp_prd_ttl_sol_2 it says PURPLE when i recieved the phone it is red i was totally disappointed smhh", "Date": "February 16, 2013"}, {"Title": "Excelente", "Author": "wrmorao03", "ReviewID": "R2UY9TB67ARA0Z", "Overall": "5.0", "Content": "Hola les comento que el servicio de venta de amazon es excelente el producto lo recibi rapido y en buen estado los invito a usar este medio de compra.", "Date": "September 13, 2011"}], "ProductInfo": {"Price": "$299.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint\nUnlocked Quad Band: GSM 850/900/1800/1900 and GPRS capabilities\n2.0MP Digital Camera, High-resolution display with 320 x 240 65.000 colors TFT and 2.46 inches, Bluetooth\nVideo format support: MPEG4, H.263, H.264, WMV3, Audio format support: AAC-LC, AAC+, eAAC+, AMR-NB, WMA9\nTalk time up to 5 hours - Standby up to 17 days\nIt will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint\nThis unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported.", "Name": "Blackberry Gemini 8520 Fuchsia Unlocked Cell Phone with 2 MP Camera, Bluetooth, Wi-Fi--International Version with No Warranty (Fuchsia )", "ImgURL": "http://ecx.images-amazon.com/images/I/51ORfXILb3L._SY300_.jpg", "ProductID": "B003BNYD24"}}