{"Reviews": [{"Title": "A simpler cell phone", "Author": "M. Perez", "ReviewID": "R2KGITCGC7WDD5", "Overall": "4.0", "Content": "I had to replace my wife's cell phone but I was not interested in entering into a long term contract with our service carrier. Thus I decided to try an unlocked phone. I've had very good service from Nokia phones that don't have the latest bells and whistles but that provide solid performance as cellular phones. Initially I wasn't sure that the process would be seamless as described but it all worked fine. I received the phone from Amazon as promised and after a short while the old phone was disabled and the new phone was up and working. My wife prefers a simple cell phone and this new Nokia has been pleasing to her. The fact that the Nokia chargers are interchangeable with older models is also a plus, since an extra charger makes it more convenient when we misplace an existing one.", "Date": "July 19, 2010"}, {"Title": "Decent phone, but not for the visually aged.", "Author": "Nobody", "ReviewID": "R28AC9ONIBFBN6", "Overall": "3.0", "Content": "We bought one of these, through Amazon, with the intent of trying it out and possibly buying three more (for the family).  All we want is a flip phone with good sound and visibility.  We don't want \"data\", except for support for MS Outlook-based calendars and contacts. We don't want text.We like the phone enough to buy one more, but not three because of vision limitations of two of the buyers.  I'm giving this phone three stars but also am noting that I have tried a number of phones and haven't found anything better - and haven't found anything equivalent to my old phone (a Moto E815 on Verizon).The flip phone market seems to be a fringe market at this point.Plusses:1.  Good display.  Readably bright display, including by the geriatric members of the family.  Numbers being dialed are large.2.  Decent signal reception, but it's not stellar. Could be the carrier (new carrier for us).3.  Good voice quality, both ingoing and outgoing.4.  Calendar sync over USB, and contact sync over USB, is fine.  We haven't tried bluetooth.  Software only seems to run on Windows, though.  The file system can be made visible (e.g. for Linux) but it doesn't seem to work consistently and although the sync app runs on XP on VirtualBox because the USB interface doesn't seem to work properly with Linux, I can't make the phone visible.5.  Reasonably standard charger interface.  Appears to use the same charger as Samsung.6.  Nice feature set, from our point of view. I particularly like the maps - an add-on I can actually make use of.Minuses:1.  Keyboard unreadable to both geriatric members of the family (who need to replace other mass-market phones they *can* read).  There isn't enough contrast, even when the keyboard is lit up.  We'll search for something else for those family members.2.  Even with Bluetooth shut off real battery life is about a week, with perhaps an hour on the phone.  I would have liked more.3.  Can't download free content from Nokia's Ovi web site without paging.  We don't have, or want, paging service.  There don't appear to be any provisions to download using the USB interface or their sync app.  This wasn't a key issue for us, but might matter to some.4.  Haven't found an acceptable case.  Nokia doesn't sell one.  Just want a 'standard' flip phone case that fits.  Phone's just slightly too big for the ones I've found.", "Date": "September 26, 2010"}, {"Title": "good basic phone", "Author": "ck", "ReviewID": "R3VXWGEDDSNGZ9", "Overall": "5.0", "Content": "Good basic phone, good battery life, the double tapping on the screen was cool at first, but it got old and annoying fast.  Plus, double tapping sometime work and sometime doesn't work.  I missed my old phone when it actually shows the time and missed calls without tapping it.  Limited ring tones.  Limited wallpapers.  I just needed a basic phone.  This phone served my purpose.  The sound quality is loud and clear.  Not too much bells and whistles.  No pre-loaded games also.  Recommended as a basic phone.  Don't expect too much beside a phone.", "Date": "September 20, 2010"}, {"Title": "GREAT FEATURES - HARD TO SETUP WITH T-MOBILE-READON...", "Author": "Daisy S \"Daisy S\"", "ReviewID": "RSF84I36GH02Q", "Overall": "5.0", "Content": "Here are the Pros and Cons of this phone:(TRUE RATING IS 4.75 STARS - Reason not 5 stars is VERY HARD TO GET MMS and INTERNET SETTINGS for this phone - took me on and off 8+ hours to get the proper settings (please read more details of the phone and settings below):PROS:1) SD Card Slot holds up to a 16 gig card.2) Media Player is easy to set-up with play-lists.3) My Motorola Blue-tooth headset works great with this phone for calling and for listening to music (I use Blue-tooth often and this phone does a superb job in Blue-tooth areas as it has Blue-tooth 2.1 and will easily let me listen to my music files (not radio) with Blue-tooth).4) Love the menus that can be customized as the GO TO MENU.5) FM Radio! Many phones do no come with FM radio, so this is a plus for me!6) Great Browser - Opera (however, I use the T-Zones T-Mobile browser).7) Large and clear 2.2\" screen8) Overall the phone is very user friendly (easy for me because I am a Nokia fan and have used many Nokia phones over the years).9) Battery life is SUPERB! For me, the battery last for 3-4 days on just one charge!CONS:1)In unlocked phones it is necessary to call the service provider for these 2 settings:  1) MMS (picture messaging)  2)Internet Browser settings (In my case the setting for T-Zones)Because the first 2 T-Mobile reps tried to send me the settings over my phone and they never arrived to my phone, I almost sent the phone back to Amazon, however I had determination to get this phone to work so again I called T-mobile one more time and they were able get the proper settings on this phone (this process took almost 4 total hours of my time, yet so worth it). Yes, the third time was the charm! Internet works great , however at the moment, the MMS is still not working, T-Mobile said to give this setting 2 hours and if if still does not work to call back, and yes I will call back to get this setting TWEAKED as I know it can be done. Yet so far it has taken almost 4 hours of my time and still no MMS configured correctly, so that means another 30 - 60 minutes at least...So let you give you some words of advice in buying an unlocked phone: When you buy an unlocked phone, yes you can place your sim card in and these features work: 1) Calling out and receiving calls 2) Text messages 3) Other features of the phone.These features DO NOT WORK UNTIL you call and get the settings from the service provider: MMS picture messaging and Internet Browser. If you have WiFi on a phone,yes then the Internet Browser will work without having to call the service provider. (In my case, there is no WiFi on this phone).UPDATE: October 7, 2010After lots of tweaking and searching and sheer determination, I finally have BOTH MMS and INTERNET working on this phone. This has been my biggest challenge yet! But so so worth it. I did an internet search called: what are the t-mobile mms settings for nokia 7020 and found a FORUM in T-Mobile that had the ports, settings for both Internet and MMS. Since the Internet setting was OK, I re-did the MMS settings and they worked, I sent myself a picture and a recording to this phone and all worked! Word of advice: It is not an easy task to get both MMS and INTERNET SETTINGS to this phone as the phone will not accept the settings over the phone from T-Mobile, they must be put in manually and this does take time and patience. However, I love the phone and am so glad that I did this.", "Date": "October 2, 2010"}, {"Title": "Nokia 7020 US Version", "Author": "Richard J. Rose", "ReviewID": "R2CCATETIYF2DZ", "Overall": "4.0", "Content": "The Nokia 7020 is an \"unlocked\" GSM phone that can be used on US networks.  There are several GSM networks and some phones are unique to a particular network provider.  Thus it is important to look for GSM UNLOCKED phones - unlocked meaning they are adaptable to multiple network providers.  My provider is T-Mobile and they don't seem to offer any mid-level non-smart phones anymore.  I needed a simple phone for calls, text and photos - no data.The phone has some software that is a bit different that other US Nokia phones and it takes a few moments to find what you are looking for.  The phone itself works great, has good tactile feel and is light.  The downsides are that the volume is quite low even when turned up full and access to the camera requires several steps which may result in a lost photo opportunity.The price is right for a full featured phone (not smart phone) and I have always found Nokia products to be rock solid.", "Date": "October 14, 2010"}, {"Title": "Nice Seniors phone", "Author": "Michael West", "ReviewID": "RCOC57FDQUM2H", "Overall": "4.0", "Content": "This phone is nice as long as you don't expect to much from it.  I bought it for my mother who just wanted a basic phone, no frills...to make calls and receive them.  If this is what you want then this is a nice phone.  Nokia phones are the best in the business in holding signal, and this one stacks up like the rest...very good.Nice looking screen and good camera for the price.  As long as you can manage your expectations, this phone is nice.", "Date": "August 3, 2010"}, {"Title": "Works great for the price!!!", "Author": "Emill", "ReviewID": "R106QW2OKTTCV8", "Overall": "4.0", "Content": "This is a good phone which has the regular features a Nokia's phone has..... And for the price it's a good deal!!", "Date": "February 2, 2011"}, {"Title": "Very Good", "Author": "Alexander Posso \"Mike\"", "ReviewID": "RN1D7S19I8PMC", "Overall": "5.0", "Content": "The phone meets all the expectations I had, I think a great price considering the features it has.It has a very strong signal, the design is what I like, and above all that is very light and thin.The only drawback is the poor quality of the camera, but everything else is very good.", "Date": "July 28, 2011"}, {"Title": "Nokia 7020 Unlocked Phone", "Author": "MikeInMelbourne", "ReviewID": "R3IH2RTL63Y8IS", "Overall": "3.0", "Content": "First of all, let me tell you about buying an unlocked phone generic phone, as was the case with this phone.  A generic phone isn't associated with a specific carrier, such as AT&T; or Verizon.  There won't be any carrier logo on the phone.  I could make calls and send texts fine, but I couldn't send pictures. Multimedia support is carrier specific and generic phones won't have any multimedia configuration.  I stopped at an AT&T; store and told them I couldn't send pictures.  They told me I had to contact customer support so that I could configure my phone for AT&T; multimedia.  AT&T; support referred me to their website. They support a lot of Nokia phones, but not the 7020. Nokia's website wasn't any help either.So I browsed the web with some key words and found a site where a research professor from a Georgia college had the same problem, solved it and published how to configure the Nokia 7020 for multimedia in his blog.  If your carrier is AT&T;, here's the link:[..]My experience with Amazon was great. I've made several purchases from Amazon, all with complete satisfaction.  The free shipping had the phone in my mailbox on the 5th day.Things I like about the Nokia 7020: It's thin and light, about half the thickness of my old Nokia. The screen is large and has a brilliant display.  The menu navigation is similar to my old Nokia with a few improvements.  The calendar, without which I'd be lost, works great.  The Bluetooth works great.  I have it linked to my laptop and my car.Things I don't like about the Nokia 7020: It's not very loud.  If I'm in a noisy place, I can't hear the phone ring.  Sometimes I miss a call.  There's no external volume control or camera button.  Everything is menu driven.  You can't turn the camera on just by pressing a button.  In the time it takes to start the camera, the photo opportunity may disappear.  On previous Nokia flip phones, the camera lens is located in the top half of the phone, on the back side of the display.  The 7020 lens is located in the bottom half of the phone, on the back side of the keyboard. When you try to take a picture, your hand is covering the lens.Would I recommend this phone?  Probably not.", "Date": "September 5, 2011"}, {"Title": "Atrociously  Bad 'User Guide' Omits Essential Information", "Author": "Reviewer", "ReviewID": "R32087ACQCEJHD", "Overall": "2.0", "Content": "The instructions in the `User Guide' for the Nokia 7020 are so badly written, omitting essential information, that one and a half hours after receiving it I was ready to return it to Amazon.Such basic information as how to change the volume - it was set too quiet for me to hear somebody talking - is totally omitted.  The Nokia 7020 includes a cell phone camera, but the `User Guide' has not a word on where the pictures are stored, or how to access or copy them.  The instructions showing how to install the SIM card are so fuzzy, poorly printed, small and unclear, that I succeeded in installing a SIM  card mainly by luck.  How to access, or scroll through `Contacts'?  Not a word.Finally, after half an hour calling `Customer Care' at Nokia, who at least told me how to raise the volume to audibility, followed by an hour and a half of frustrating trial-and-error to discover essential functions which should have been explained in the `User Guide,' I made the phone usable enough for me to keep it.My 8-year-old Nokia 3390 had clear instructions. Since then, literacy at Nokia has plummeted.Nokia management is apparently too lazy to write a 'User Guide' with specific instructions for using the Nokia 7020.  The 'User Guide' enclosed seems to be designed to be packaged with the entire range of Nokia cell phones. For the buyer who needs information on using a Nokia 7020 phone, it's near-useless.Nokia has not learned the basic lesson (which has also escaped others in the computer industry):  if you have spent money to incorporate features in a device, it is stupid to not give the buyer instructions on how to use the features.  Without instructions on how to use it, an electronic device is a worthless piece of junk.If you order the Nokia 7020, it's not a bad phone if you can find someone to show you how to use it.  Otherwise, be prepared to spend several frustrating hours trying to figure it out.But I don't recommend it. Why not find another maker?", "Date": "August 17, 2011"}, {"Title": "Good Quality Phone", "Author": "vik", "ReviewID": "R2TM727TBDMEFZ", "Overall": "5.0", "Content": "I purchased Nokia 7720 after using the contract phone. I feel using unlocked phone saves lot of money. Also this phone has great battery life, and features. I like this product.", "Date": "November 24, 2010"}, {"Title": "Great phone.", "Author": "Global Traveller", "ReviewID": "R3PVAUFEE1TN61", "Overall": "5.0", "Content": "This is an ideal phone if all you want to do is make and take phone calls. I use my iPad for the rest.", "Date": "November 17, 2010"}, {"Title": "OK Phone--Bad Documentation--Update", "Author": "Kenneth  Hergenhan", "ReviewID": "R15K1QX9KF964M", "Overall": "3.0", "Content": "I bought the phone a couple of weeks ago--its  performance is comparable to other basic cell phones I've used.  The screen contrast is poor and the screen washes out completely in bright light.  A minor complaint--the charger cord is quite short.  A major complaint--the owner's manual is terrible, and learning about the phone's features and how they work is a matter of trial and error.Update:  The screen failed (went completely black) in early December just a month after I wrote the review.  The Nokia service center reported that the problem couldn't be fixed so they would have to send me a replacement phone.  The replacement has not as yet arrived.", "Date": "November 8, 2010"}, {"Title": "For a friend who liked it.", "Author": "Dau", "ReviewID": "R3QNSEZWWY55H3", "Overall": "4.0", "Content": "Bought it on demand for a friend, it wasn't mine. She liked it and that's the most important to me. This is the reason why I'm rating 4 stars.", "Date": "December 1, 2013"}, {"Title": "Awesome phone, if you dont like smartphone.", "Author": "rakesh", "ReviewID": "R10VL7VID441PX", "Overall": "5.0", "Content": "I used this phone during dark ages of smart phone, when touch screens were not very good. I got frustrated with my smart phone and bought this phone. Let me tell you, this phone is a superb phone, if you are looking for JUST phone.with sd card in it, contact list had no limitation and I had never deleted any SMS, and i use to send/receive lot of them (good old days).I can see this as a ideal phone for aged audience (50+), this is simple to use, and sound reception is too good.", "Date": "April 16, 2013"}, {"Title": "TERRIBLE. DO NOT BUY!!!!", "Author": "Uva", "ReviewID": "R2MZ9739GOQMC3", "Overall": "1.0", "Content": "This phone is the WORST PHONE I have ever purchased in my WHOLE life. It worked for 2 months and then completely died. The worst things is that it was a gift for my mom who is outside the US, so it is gonna cost more to ship it here and get a refund or whatever. Warranty lasts only a month anyway... My mom only used the phone to make calls and the casual texting, nothing extreme....  DO NOT BUY this product!! So expensive and at the same time so cheap if you know what I mean. I would have given it ZERO stars but you don't have that option...", "Date": "March 6, 2012"}, {"Title": "Won\"t Work", "Author": "M. Elman \"Mike55\"", "ReviewID": "R10I3A0IZK5AKQ", "Overall": "1.0", "Content": "Neither myself or the ATT store could get phone to work. Tried old and new simcards, nothing worked. very disappointed. I really don't think the phone is unlocked.", "Date": "January 16, 2012"}, {"Title": "not 911 compatible", "Author": "zbear", "ReviewID": "R1EGG82EF0N6XC", "Overall": "2.0", "Content": "I can not get service on this phone because it is not 911 compatible so I need to return this phone as I am unable to use it.", "Date": "October 29, 2011"}, {"Title": "ok - not great", "Author": "Bill", "ReviewID": "RC1I5235LXLO3", "Overall": "3.0", "Content": "As the title states, the Nokia 7020 phone is ok but not great.Pros - I bought it to use for voice calls.  It operates well for making and receiving calls.  The interface is convenient and easy to understand.Cons - One huge con!  The receiver is not loud enough.  There is no volume control for the receiver.  I really have to be in a very quiet place to hear the person I'm talking with.  For this reason I do not recommend the Nokia 7020.", "Date": "October 14, 2011"}, {"Title": "NOKIA 7020 REVIEW", "Author": "ORIVERO", "ReviewID": "R2867KOF9X5DXQ", "Overall": "5.0", "Content": "FOR THOSE PEOPLE THAT NOT ENGAGE IN SMART PHONE PLANET, THOSE THAT JUST WANT SPEAK AND EAR IN SIMPLE PHONE CALL, THIS IS THE EXACT PHONE. ADITIONALLY HAVE MP3 PLAYER STEREO, MAPS, GAMES, DECENT CAMERA AND MEMORY ENOUGHT FOR BASIC APPS.", "Date": "August 15, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0037VGDEG"}}