{"Reviews": [{"Title": "Terrible product, terrible customer service.", "Author": "E. Coakley", "ReviewID": "R1PXFDFXFCIIF", "Overall": "1.0", "Content": "Hours on the phone with Sprint, to find out the ESN is invalid and the phone cannot be programmed, followed by hours on the phone with Just Cellular to reach a rude customer service representative who talked so fast you couldn't understand her.  No one should order from this company.  Ever.", "Date": "June 24, 2011"}, {"Title": "dissapointed", "Author": "kitty", "ReviewID": "RE648F8WJKWWH", "Overall": "1.0", "Content": "problems getting it activated.  Had to buy a charger for 20.00 then after all the problems I had getting it activitated, the product did not operate as expected.  battery did not last for a conversation,  would log off in the middle of a conversation.  constant beeping in my ear when using the phone.  battery would not hold charge if you actually used the phone.I reported this to amazon and i have received a full refund.  do not think  I will order electronic products that are not new ever again.  There was a reason it was sold with out a charger and I was unable to activiate it.  That should have been my first clue.Amazon handed the problems and gave me a full refund.", "Date": "November 5, 2012"}, {"Title": "The Rumor works great", "Author": "spiderman2", "ReviewID": "R937NYR0WY53Y", "Overall": "5.0", "Content": "I like it when a product such as the LG LX260 Rumor for Sprint works so well. My teenager loved it. The fuctions worked well. I wish I new what type of memory card goes with it. We love taking pictures and that's a great way to save memories. We would be able to in-put them to any computer. It will come handy when my parents want to see the pictures and they don't know how to send them. Over all very satified with the Phone.Thanks,Wendy", "Date": "April 10, 2012"}, {"Title": "good buy", "Author": "Naruto336", "ReviewID": "R2REO246WEHAJC", "Overall": "5.0", "Content": "This is a good phone to buy if you can't pay for a smart phone bill although its nowere near as equipped as a smartphone but then again you get what you pay for 5/5", "Date": "December 18, 2011"}, {"Title": "worked good", "Author": "Ron Weaver \"ron weaver\"", "ReviewID": "R17JQRL2ZSIW80", "Overall": "4.0", "Content": "we used it for a while till upgrade time , so my kid had a phone it did the trick and saved him so he could keep texting , after all thats all these kids like to do .thank you.", "Date": "August 4, 2013"}, {"Title": "its not great at all", "Author": "sunshine", "ReviewID": "R1ZL0DWYI3K3DN", "Overall": "1.0", "Content": "Using it I felt like I was in the 90's I would not recommend this phone to anyone  and the camera is not that great", "Date": "June 11, 2013"}, {"Title": "Great Used phone", "Author": "AmandaKellyy \"Amanda S\"", "ReviewID": "R64WI0Q1BP6OP", "Overall": "5.0", "Content": "I just needed the phone to get me through until my upgrade. Phone works great, shipped fast, had a problem activating it (not sellers issue, its a sprint thing) but all in all a great phone and still works great, would deffinatly buy another phone from user", "Date": "February 25, 2013"}, {"Title": "Unusable after 2 days", "Author": "Amazon Customer", "ReviewID": "R3VGTPMCKUC2G", "Overall": "1.0", "Content": "I should have known this wouldn't work when I opened the package and the first thing I found was a note from the seller requesting that I not give them a negative review should the phone not work!  Right away, I realized that the keyboard was non-functional.  After 2 days, the port where the charger goes into the phone broke and the phone has been dead since then.  The contact information for the seller doesn't work.  Buyer beware!", "Date": "July 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0034N2XX2"}}