{"Reviews": [{"Title": "Best Cell Phone that I ever owned", "Author": "Thomas J. Ganley", "ReviewID": "R2P42HIW4HPQGH", "Overall": "5.0", "Content": "I have had my Samsun Rugby SGH-A837 for over three years and love it.  Dropped it many times and did not damage it.  I like everything about it.  I want another one in case mine finally quite.", "Date": "July 1, 2012"}, {"Title": "Do Not Buy From ORDERINSTANT!", "Author": "kettle", "ReviewID": "RF7KH0QDAH3UW", "Overall": "1.0", "Content": "The product arrived and it did not work properly. I would receive a call and could not hear the other person speaking.  At first it seemed I would have no trouble getting a replacement, as my emails were promptly answered and a return packing slip and address label were sent to me.  I paid to have the item shipped, but then a couple of weeks later, I received the phone back with a letter from orderinstant in the box saying it was not their product and that I should contact whomever I purchased it from. What? After all of the emails and the fact that they are the ones who sent me the return packing slip!!!  I have not been able to get a replacement or any other explanation.  My husband has the same phone with no problems, so I think the seller is the real problem here.", "Date": "June 4, 2012"}, {"Title": "very satisfied", "Author": "BLF/2011", "ReviewID": "R3Q4P1FMX57WWF", "Overall": "4.0", "Content": "I purchased this phone for my husband . It was a refurbished cell phone in great shape and a great price. The only thing that I didn't like was there were no  instructions on how to use it. It has several features on it . The service was great  Thank You Teczillahttp://www.amazon.com/gp/product/B004Y0276M/ref=cm_cr_rev_prod_title", "Date": "January 3, 2012"}, {"Title": "Samsung Rugby SGH A837", "Author": "Mary McNeal", "ReviewID": "R1AGEQJBUXZ1FH", "Overall": "5.0", "Content": "I ordered this phone for my grandson who is in the Army.  This phone survived the heat, cold, and dust of a year deployment in the Afghanistan terrain.  It is a sturdy and reliable phone.  I can't tell you how many times it was dropped and kicked.  There are scratches on the front but given the abuse, I am surprised that they are still very minor.  I ordered a replacement phone because it was lost during a mission.", "Date": "November 28, 2011"}, {"Title": "great service", "Author": "Ernest", "ReviewID": "R293KQ0B9Q852O", "Overall": "5.0", "Content": "i am very pleased with the service, and would recommend this company for their promptness and their follow up after a sale...keep up the good workef", "Date": "November 7, 2011"}, {"Title": "Product is good comes in original boxe.", "Author": "Kenji Yang", "ReviewID": "R1IIEDFLKM5U6W", "Overall": "3.0", "Content": "The phone is good, appeared to be brand new. So far no problem with phone. Shipping transaction on the other hand, takes too long to ship out especially when the business is located in the states. Took me almost a whole month to get recieved this phone. If you are not in a hurry to replace your broken phone, I would recommend you to get from this place. On the other hand, shop else where for the same product and you'll get in in 5 to 7 business day.", "Date": "June 4, 2013"}, {"Title": "Good build, bad battery & mediocre sound", "Author": "Morf Thumperton", "ReviewID": "R10YKON8KWTGK5", "Overall": "3.0", "Content": "The build quality on this phone is great, and as someone who's missed having a flip phone for years I really enjoy the feel of it in my hands.  It's replacing a phone I've used for 8+ years, and I only use it for a phone and alarm clock/laundry timer, so it doesn't exactly have high technological standards to meet.That said, it has some drawbacks that make me regret not shelling out for something newer.-Short battery life.  I'm only getting 48 hours on a full charge, and that's with little to no talking time.  I've ordered two \"new OEM\" replacement batteries from two different vendors and neither one performed any better.  This may be because the supply of these batteries is aging?  Li-Ion batteries have no memory effect, but reportedly lose effectiveness over time regardless of use.  I wish I had gone for the next generation (Rugby A847) primarily because of this; the batteries are 1300mAh compared to the A837's 1000mAh, and may be more recently manufactured.-The sound isn't particularly good.  It's very quiet until the highest volume setting, where it becomes tinny and distorted.  Speakerphone works OK.-While you can use MP3 ringtones, and you can store ample amounts of music on it with a MicroSD card, don't expect to be using those music tracks for your alarm clock or ringtones.  Alarms and ringtones on this phone require MP3's <= 300KB, which pretty much means short tracks for looping only.", "Date": "May 9, 2013"}, {"Title": "not too happy", "Author": "jose", "ReviewID": "R2HXEM7J4JMOII", "Overall": "2.0", "Content": "Phone was in bad condition and speaker did not work too good hard to hear. the phone was no good", "Date": "February 11, 2014"}, {"Title": "Rugged not so rugged", "Author": "Davina Dickey \"Davina\"", "ReviewID": "R2PV781HSYPNS0", "Overall": "3.0", "Content": "its a nice phone but this one did not last very long and  broke with in 3 months of purchasing", "Date": "December 2, 2013"}, {"Title": "The best phone that I have ever owned", "Author": "Henry Ullrich", "ReviewID": "R2O3RXE78WI646", "Overall": "5.0", "Content": "This is the second Rugby SGH A837 phone that I have bought. It is a very rugged phone that one can abuse as well as use on the coldest day or on a hot day in dusty conditions with perspiration and always have enough signal to call and hear very well.This phone is a bargain for what you get. This is why I purchased a second phone to have as a back-up in the event that I were to loose one.", "Date": "July 13, 2013"}, {"Title": "Simply one the best cellphones ever used", "Author": "K. B. Emmerling", "ReviewID": "RENYCEFFG7WLM", "Overall": "5.0", "Content": "After moving from cell phone to smartphones, I still miss the Samsung Rugby SGH A837 phone.  Simply put, this phone was an excellent model.  Its rugged body could sustain all types of damage and keep on ticking.  It had very good reception and call quality. For standard clamshell phone that endures almost anything, this is the phone to get.", "Date": "June 27, 2013"}, {"Title": "Works great", "Author": "JRC", "ReviewID": "RZKOFTCJTDQJS", "Overall": "4.0", "Content": "True unlocked phone, using with tmobile is great. Downfall the GPS is not functioning proper with tmobile. After all it is a AT&T; phone.", "Date": "June 10, 2013"}, {"Title": "what great phone", "Author": "Azurak1", "ReviewID": "RCGYQGAWFLFLJ", "Overall": "5.0", "Content": "I love flip phone's this is far the best I have every had. I am going to buy another one for a back up. I am in love.. Thank's amazon for a great product and great service.", "Date": "May 14, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "PTT plus a full range of 3G services\nGPS navigation\nstereo Bluetooth\nmusic player\n1.3 megapixel camera", "Name": "Samsung Rugby SGH A837 Yellow Unlocked Rugged 3g PTT GPS Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/51ahcWSqihL._SX300_.jpg", "ProductID": "B004Y0276M"}}