{"Reviews": [{"Title": "Not as cool as it looks", "Author": "RedWolf", "ReviewID": "R3C4OXZTBB3N3A", "Overall": "2.0", "Content": "I bought and returned this item. Since I didn't find my detailed reviews, I would like to share my opinion about this watch:It looks bulky, and cheap (it is cheap), I thought I can use it to replace my phone when I want to go for a short walk (or if I don't to put something in my pocket). The voice of the phone speakers is not that loud, but it's ok. I was planning to use the Bluetooth headset. However, the one that came with it didn't work.. and when I used the one I had (Plantronics, which works great) the sound quality was bad and the voice kept breaking. It was also hard to keep it paired to the phone the whole time.The UI of the watch is a bit strange, the icons they chose where difficult to understand.. but that might be something you can get used to. Didn't keep it long to test the battery life, and didn't plug it into the computer.. two problems that I heard about. I only tested it for an hour, and it didn't do what I needed it to.The concept is good, but not the design or the implementation. I believe LG would be a better (more expensive) choice. Don't hate, I just wanted to share my actual experience.", "Date": "March 16, 2011"}, {"Title": "Works for me", "Author": "bblhed \"bblhed\"", "ReviewID": "R24V2C970HY1R3", "Overall": "4.0", "Content": "I will admit that I bought this phone for the Geek factor and because it was time for a new phone. Just as with every single phone I have ever owned there are a few things I do not like about it, and some things I really like. First off I am the worlds number one phone forgeter, I can't leave the house without forgetting my phone and this one solves that problem because I always have a watch on.If you are looking for a wizz bang smartphone that will do everything you want, this is not your phone, if you want to make calls and have a phone that you don't have to put in your pocket then this may be your phone. Reception is good, but you have to use some sort of headset with this phone, the internal speaker is lousy for voice, but the ringer sounds alright. I get about two days out of the battery and as others have said, it comes with two batteries but no external charger, charge time is about 3 hours. I had little problem syncing with the Bluetooth headset once I read the instructions for it syncing was a breeze. The on screen buttons are tiny, but the stylus solved that problem. The phone has some games and other software goodies on it but honestly I just wanted a phone so I just glanced at the games and the appear to be alright as time waster games go. I am still working on how to do custom ringtones and also getting a persons photo to appear when they call for that Dick Tracey effect. The phone could really use a better set of instructions for sure. It took me about three days to learn the layout of the buttons on the sides of the phone to the point where I can confidently use the phone without thinking about it, a heavy user might learn them faster. Finally there is the built in camera, I tell people that they were just showing off when they added the camera function and I don't really use it. I guess it would be good for taking quick snapshots to show off on the phone, but other than that it is not a great camera.Overall I like the phone and wear it daily, but the final largest drawback to this phone is that it is after all a Watch/Phone/Camera so if you are going someplace where you can't have a Phone or Camera but want to know the time you will still need a watch. As I have done every time I have upgraded my phone I will be keeping my old phone as a backup, but this time I have a feeling I will need the backup phone more because I will use it when I have to wear a regular watch.", "Date": "April 20, 2011"}, {"Title": "Fun phone", "Author": "Wayne Simacek", "ReviewID": "R36SJ0WRLXMN2", "Overall": "4.0", "Content": "I bought this phone both for the high geek quotient, and because my Samsung Galaxy is down to about 4.5 hours battery life, even with GPS and 4G turned off most of the time, and also doesn't get good reception in my house with Sprint service. Unfortunately, because my Galaxy isn't a SIM phone, I had to shop around for new service. I first stopped into Radio Shack and said \"SIM me up Scotty and flashed my new watch phone. One kid didn't get it at all, even after I translated to English. The other one did, but said I should go to T-Mobile because he didn't think they'd charge me for the SIM.The T-Mobile guy was enthusiastic and hooked me up with a SIM and asked me for details, because he had to have one. I could have sold 4 or 5 over the last couple of months, just from people fascinated by me talking into my watch.I had no problem hooking it up to my car(s) bluetooth and my pendant bluetooth with stereo ear buds that I wear for riding my motorcycle or listening to MP3s from the 8 GB microSD card I threw in the phone. The reception is great, even in the basement of my house and the battery lasts for 2-4 days at a time. [I'm trying to run it all the way down between charges in case it has a memory.] It did come with a spare battery, that I haven't even cracked out of the box yet.Overall, I like this phone a lot, although I agree with previous negatives that the screen icons are not intuitive and take some learning and it's clunky enough to remind me of some of the second generation phones I carried around in the early 80s.I'll probably stay with the watch phone concept, although I might upgrade next round to a more \"dressy\" one....maybe with FM, GPS and 4G while I'm at it;)", "Date": "September 7, 2011"}, {"Title": "Disappointed", "Author": "Marit \"... Eh?\"", "ReviewID": "R2M2ATOA8J2VBN", "Overall": "2.0", "Content": "I got one for my friend, and one for me. I`m just gonna start off by saying this: It has a lot of annoying features!When I recieved it, I was so excited to try it out that I just couldn`t wait. I put in the charger and turned it on... Apparently, it gives out this monotone jingle when you turn it on... Further on, you can`t turn the screen off without turning the whole thing off, you have to wait a minute for the screen to go black... And when you do turn it off or run out of battery (which actually happens quite frequently...) the time and date resets to 00:01. My friend pointed out that when you type, you have to aim in, and you usually miss... The screen is not a touch screen... It`s more like a \"press\"-screen, and the battery makes the phone more of a box than a small watch-screen...Feel like I have to say something nice about the product... Well, it comes with a bluetooth device... (Which both me and my friend failed to use because neighter of our phones can connect to the device.) It`s got a camera (But not enough memory to store half a song or more than 1 picture from my computer.If you are thinking about buying a touch phone, don`t go for this one!You can`t send a message because it takes litterally 5 minutes for a short message, only half of the messages sent are recieved...", "Date": "May 31, 2011"}, {"Title": "5 star review for Amazon", "Author": "prettycrazy", "ReviewID": "RWTTQ8EDK9IVK", "Overall": "4.0", "Content": "very cool lil watch< its crazy when ppl ask me are you talking to through ur watch to sumbody and i tell them that is correct and there faces look like there in shock, the first thing they say is i want one to haha :). But like i said its a very cool lil item that will keep you busy mine works just as described other then the texting layout being small but other then that it does what it suppose to do, so if your into inspector gadget, jame bond type of electronics this definitely sumthing you might want to have  remember it can also be warn as a reg watch these watches have style and makes a head turn everytime sumbody see me on it and always have a millon & one questions for to answer...so yeah its a pretty cool item i have a few myself cause i like to change up on my watches...so dont wait order you one now why there in stock...Good luck and hope other ppl enjoy theres as im still enjoying mine.....", "Date": "August 10, 2012"}, {"Title": "Watch phone", "Author": "Jazzplayer", "ReviewID": "R1ZMUSAKB3FVIJ", "Overall": "2.0", "Content": "The watch no longer recognizing the sim card so I  can no longer make phone calls, do you have any ideas what to do to fix this ?", "Date": "March 13, 2012"}, {"Title": "very cool", "Author": "Bettina Bernoth PhD", "ReviewID": "R196S7HCPMEZLB", "Overall": "5.0", "Content": "was for my 12 y old, he loves it,the plastic band can break (our first watch broke short after buy but was exchanged and now there are no trouble with this one.Great sound, great \"spy\" toy for everybody. Bit small display so you need good eyes for this one. I use it in Europe with an unlocked sim from Tchibo, works fine.", "Date": "January 15, 2014"}, {"Title": "Stopped working", "Author": "Nicholas J. Wion", "ReviewID": "R3VQQS8YQ8ACDW", "Overall": "1.0", "Content": "the phone worked for about a month, but the camera wouldn't function until I inserted an SD Card, I finally got around to getting one a month later, I inserted it and the camera worked but the phone stopped working. I took out the SD card thinking that made the phone stop, but it didn't help. So I thought the simm card malfunctioned, I got a new one from my cell provider, that took another few weeks (I work for a living and this thing is not a priority in my busy life). Final result, the phone still doesn't work, the thing needs recharging every other day (even without use), the camera works, sort of. I tried to contact \"The Mall\" or \"Digital Mall\" whoever sold me this thing and they ignored me, a week later I tried the Amazon A to Z guarantee and they said I was a week too late, so I'm just screwed. Amazon is selling more and more Chinese junk and not standing behind it, be careful.", "Date": "September 7, 2013"}, {"Title": "Funny cell phone", "Author": "Deogryeol, KIM", "ReviewID": "R3KQ6KYQFNN7IJ", "Overall": "3.0", "Content": "I'm not use cell phone.only Watch, MP4, Camera... etcBut, Don't play MP3. only file manager open 1 time play", "Date": "September 1, 2013"}, {"Title": "this watch is not working at all!", "Author": "Robin Botton", "ReviewID": "RWT1HW2RUJTC7", "Overall": "1.0", "Content": "this watch is not working at all! Tried difference carrier's sim card, no use at all! Very Very bad experience, don't buy!!", "Date": "July 13, 2013"}, {"Title": "watch cell phone", "Author": "kms", "ReviewID": "R23HUZL0BIX6HN", "Overall": "5.0", "Content": "this is pretty kool...just needs more memory to do everything i wanted it to do... i stil love it though!!!", "Date": "June 30, 2013"}, {"Title": "Beautiful", "Author": "Eliseu M.", "ReviewID": "R274P5Y0243IWO", "Overall": "5.0", "Content": "This is exactly as described.  I am planning on buying at least two or three more before its all gone", "Date": "May 13, 2013"}, {"Title": "Buena recepcion", "Author": "Jose Bernardo", "ReviewID": "R37JK3XAGICPRY", "Overall": "4.0", "Content": "Producto vistoso y atractivo para los adolecentes, buena recepcion, las limitaciones propias del tamanno son evidentes. Para llamadas y mensajes esta bien.", "Date": "November 4, 2012"}, {"Title": "nothing works properly!!", "Author": "Drew", "ReviewID": "R1MG334732463P", "Overall": "1.0", "Content": "The watch I got was really bad. the bluetooth cuts in and out, (because of no range) the audio player when using bluetooth stereo headphones will not play more than 3 songs before it goes out of stereo mode, and the sound sucks. The watch didn't even pick up a cell phone signal!!! What a joke!! It could not even do it's primary pourpose, and thats to bea cell phone!! I wold not recommend this product to anyone.", "Date": "November 2, 2012"}, {"Title": "good for texting in school", "Author": "havoc1991", "ReviewID": "RXOJNJ615AO4B", "Overall": "3.0", "Content": "Pretty good watch, plays videos (not movies) well. Good sound but you need a special connector for headphones and the ones the watch come with suck. Never tried out the internet but the phone works surprisingly well.", "Date": "June 27, 2012"}, {"Title": "Meh", "Author": "AJG", "ReviewID": "R1EYMWSCUQM100", "Overall": "3.0", "Content": "I bought on of these last week and played with it for days.  The idea of having a watch and phone on my wrist was awesome.  Very Dick Tracy and all that.  The cell phone and watch part works great.  Loved making calls with ti but hated it when I got calls.  It was extremely loud and the jingle it defaults to was horrid.  I tried for days to change the profiles, settings etc...to make it vibrate. The option was there but it never saved.  It was very upsetting because i wanted to use this to replace my phone.  If it wasn't for this little issue then I would have been fine.  The mic was strong enough for talking and the speaker was OK but really only if the room I was in was quiet but BT or a headset fixed that. The screen was very tiny and even using the stylus was difficult but manageable.  I was not looking forward to manually entering all my contact since the did not seem to be a way to import my list from the SIM.Since it was my first watch phone to buy I will chalk it up to the learning curve.  The next one will prob have the numbers as buttons or at least easier to pull up, VIBRATE!! and BT.I gave it a 3 start since it was working as a phone but failed on customization.", "Date": "May 6, 2012"}, {"Title": "accomplicement to work this phone", "Author": "Uttt", "ReviewID": "R19ONFKM8FYKJ2", "Overall": "1.0", "Content": "It's hard to navigate, can't put music file to played in the \"audio player\" (tried copy, check and copies) can't seem to work it. And saving phones numbers take a while.", "Date": "May 2, 2012"}, {"Title": "Custom satisfaction level", "Author": "Jorge Bolivar", "ReviewID": "RXYALTK7H0ESA", "Overall": "4.0", "Content": "Just a couple cof cmmentsSomething could be applied in orderto increase the battery life, it's too low.On the other hand, you must charge one battery in the watchphone when you should it in a separate way with the charger.Finally and related with the software, you can not block it, in order to avoid it uses by other people.Thanks!!!!", "Date": "March 4, 2011"}, {"Title": "Not the prettiest, but it works!", "Author": "Brian Keahl", "ReviewID": "R23UTN45CKWMLV", "Overall": "4.0", "Content": "This does all it says it does.  I actually purchased one about 18 months ago but the charging cable broke. I tried several other cell-watches and ultimately ordered another one so I could have a watch that had MP3, Bluetooth, Cell, and stopwatch. It's not as fancy as others but it works and handles me jogging with it, even in misting rain.", "Date": "November 22, 2012"}, {"Title": "strap broke in 4 months, no recoarse", "Author": "Clifford656", "ReviewID": "R2RTSGPAC0A5D4", "Overall": "2.0", "Content": "I loved the watch and the phone but 2 bad things, strap broke in 4 months not fixable, it broke on the other side of the pin, and it would randumly dial out and my money would get used up.", "Date": "January 3, 2012"}, {"Title": "Huge mistake", "Author": "Trekzilla", "ReviewID": "RHWL08K9GV99E", "Overall": "1.0", "Content": "Hard to set up...Hard to use...Hard to believe I was weak enough to buy this piece of junk, avoid at all cost.", "Date": "June 6, 2011"}, {"Title": "Bad", "Author": "DIana Salazar Fallas", "ReviewID": "R3R7157P9TR09M", "Overall": "1.0", "Content": "It was not what I asked! They sent me a Chinese cell phone, cheap and poor quality. The photo is misleading. I want my money and pay for the damage.", "Date": "May 24, 2011"}, {"Title": "It Cool", "Author": "shay671", "ReviewID": "R1JKB1EQVY556X", "Overall": "4.0", "Content": "I gOt This and Four More Watch phones from another site...it a cool gaget I Hope MY sibling like it..", "Date": "December 28, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Primary Function: Mobile Phone Watch with Touch Screen of 1.49 Inches\nGSM Compatibility: Quad-band 850MHz, 900MHz, 1800MHz, 1900MHz\nBattery Life - Talk Time: Up to 2.5 hours - Stand By: Up to 150 hours\nAlso Function as Video Camera and Media Players\nDimensions: - Watch: L:62 x W:42 x H:13.8 (mm) - Strap: Adjustable", "Name": "SVP MW09 Watch Cell Phone ~ unlocked~ Quad-band", "ImgURL": "http://ecx.images-amazon.com/images/I/41WciNUrxFL._SX300_.jpg", "ProductID": "B004CSBQLS"}}