{"Reviews": [{"Title": "Milestone 2 (aka Droid 2) the Most Capable Phone in this Class, without a contract", "Author": "An Engineer and a Gentleman", "ReviewID": "R1SCHD4G92XWQ0", "Overall": "5.0", "Content": "DISCLAIMER:My comments are based on the phone which was delivered to me. I do not suspect that there will be any variation in phones shipped, however I offer it as a \"your mileage may vary\" disclaimer. If you notice any technical errors in my assessment, please feel free to provide supporting evidence so that the customers can have the most complete and accurate information.I assume Milestone 2 and Droid 2 to be trademarks or registered trademarks of Motorola or Verizon.I would like to include links to specifications, but it appears that they are stripped from reviews so I will merely include the search text in Google that should help you find it.INTRODUCTION:This phone is roughly the international version of the Droid 2. Search for the following two phrases in Google and make sure you go to Motorola's official site:\"Motorola Milestone 2\"\"Motorola Droid 2\"They are not an identical phone, there are subtle differences, which is why I recommend going to each so that one may compare and contrast the two phones. My understanding is that Verizon owns the rights to the \"Droid 2\" and as such a phone labeled \"Droid 2\" will be locked to their network.I did notice (at the date of writing this 20110608) on the Milestone 2 page under \"Messaging\" under \"Voice Mail\" it indicates the phone is capable of \"Verizon Visual Voice Mail (tm) (capable)\" which may be a copy and paste error or may be a feature which matters in a global market.SIM CARD:I have not had hands on the Droid 2, but I have looked at a friend's Droid tied to the Verizon network. Most notably, the Verizon version is a CDMA phone without a SIM card slot. On the other hand, The Milestone 2 has a slot for a SIM card (right next to the SDHC card).NETWORK COMPATIBILITY:The Milestone 2 claims to be compatible with WCDMA 900/2100, HSDPA, GSM/EDGE 850/900/1800/1900. I have not done extensive research into the implications of WCDMA and it's compatibility with CDMA. If someone else has personal experience with this, their comment is welcome. I suggest going to Wikipedia and searching for \"WCDMA\", \"CDMA\" and for \"GSM\" to learn more about those standards and implementation.The reason why I focus on the networks it is compatible with is because that defines what carriers you will and will not be able to use. In broad strokes, Verizon and Sprint are CDMA networks, AT&T; and T-Mobile are GSM networks. I do not know if this phone can be used on the Verizon and Sprint networks due to my ignorance as to the compatibility of WCDMA and CDMA. I have not personally tested it. I would imagine that it could be reprogrammed at a basic level to be compatible with CDMA but that would be beyond the reach of the average user to do simply and safely.I am currently using my Milestone 2 with a T-Mobile SIM installed and am extremely pleased with the results. Unlocked phones are generally handled with a lot more latitude than locked phones, giving you very competitive rates on service without a binding contract. One of the advantages of a GSM phone is that it is compatible with most international networks. I had another unlocked smart phone on a recent trip to England, all I had to do was install a UK SIM and proceed with making calls. This is not the case with all foreign countries, notably the South Korean Network, to my understanding, is a CDMA network.SPECIFICATION HIGHLIGHTS:Operating System: Ships with Android 2.2Processor:1GHz processor, stated on the \"Overview\" page, but oddly enough not on the \"Tech Specs\" page, stated on the \"Tech Specs\" page for the Droid 2Camera: 5MP camera and HD video, not huge resolution, but crisp photos with good lightCOMMENTS:-The keyboard is absolutely unparalleled. I have used several slide out full keyboard phones and this is by far my favorite.-They phone is in the iPhone size class, while still being able to have a full pull out keyboard and a 1Ghz processor, in my opinion that is an incredible accomplishment.-It has a capacitive (you can't operate it with gloves or with a non-capacitive stylus) based multi-touch capability. The buttons on the face of it are also capacitive based, which can cut down on the risk of pocket calls.-The Wifi hotspot feature does work, and with an unlocked phone plan it does not incur an additional charge like a Verizon plan would.-It ships with MOTOBLUR, I am still deciding if that is a plus or a minus.-Has full access to the Android Market-Apparently you can be in Airplane Mode and have the GPS on. I found this rather odd and intend to look into it further.-I have had issues connecting it to a bluetooth headset I have previously used with other phones. When I turn on that headset I get a barrage of static. At this time I cannot determine if it is the phone or the headset. The phone quite happily communicates with my computer, sharing files via bluetooth.-I have had issues trying to connect the wifi to my WPS router, I believe it is capable, but a quick look did not provide an obvious path forward in implementing it. Again, I hesitate to state it is due to the phone or the router until I look into it further.-I have had no issue with connecting it to a simple PSK secured network.COMMENTS MOSTLY ABOUT ANDROID:-I am still getting used to the Android interface and find some ways of doing things rather... redundant for lack of a more precise term. I previously had an Maemo based phone which seamlessly integrated my Skype, IM, SMS etc. in my contacts. Here I have to use several fractured apps to achieve the same. It may be a function of my unfamiliarity.-If you hold down the home key it will pop up recent used apps (ones that are often still running) I suspect there is an app which will consolidate those onto the pulldown status, but I have not found it.-If you double tap home by default it should pop up the speak to operate function.-The speech to text feature is very cool and useful while driving, but requires a strong network connection, which can sometimes be frustrating.-Includes all the happy Google functionality and capability one would expect from an android phone.OVERALL:The seller shipped mine to me quite promptly and the item was in pristine condition. I have been extremely impressed by this phone, it is fast and very capable. It feels very solid in your hand with and incredibly rigid keyboard mechanism. It feels sturdy and capable, and the processor delivers on all those promises. I recommend purchasing one if you are looking for a phone with a full keyboard. I am not personally aware of a better phone on the market at this time.", "Date": "June 8, 2011"}, {"Title": "Excelent smartphone, excelent shopping", "Author": "JotaBe @ BsAs", "ReviewID": "R21JLHMOC75Z0P", "Overall": "5.0", "Content": "No doubt that Motorola Milestone 2 is an excelent smartphone. Full of features to work and fun. Amazing.The process of shopping was excelent too. Not only was easy to buy and pay but also the delivery was on time. Amazon.com is very recommendable.", "Date": "February 16, 2011"}, {"Title": "Motorola Milestone 2 international version", "Author": "bd4legacy", "ReviewID": "RVBZOLW0R2P92", "Overall": "5.0", "Content": "This phone is amazing. I like everything about it from the size to the keyboard. Android is awesome. 5mp camera is awesome. Call quality is awesome. If you are looking for a keyboard phone you will not be dissappointed.", "Date": "June 20, 2012"}, {"Title": "amazing phone, but price is a little bit high", "Author": "Jill", "ReviewID": "RUW8YD3XCLXG", "Overall": "4.0", "Content": "I like this phone very much. But since Milestone 3 is released, I think MS2's price should get down. Well it is a good stuff, I have it for a month and everything is fine. I root it, put in a lot of apps and it works great! The only thing is the battery. It cannot afford a whole day if I play games on it. But I think that's all the Android phone's problem. And there is one thing I really feel strange that when it warns me that \"connect your phone to the charger. The battery is low\", I only charge it maybe no more than one hour and a half and it is full-charged. But the batery is fine, I still can use it for a the time as usual. Anyway, MS2 is a good phone!", "Date": "October 6, 2011"}, {"Title": "Not good for South America", "Author": "Alberto Morales", "ReviewID": "R29EKKDQEMYUFW", "Overall": "3.0", "Content": "the phone it self is great, I had it for 2 years almost and now my wife uses it, is great quiality phone, the problem is the battery which does not last more that 4 or 5 hours if you used it a lot, and the other thing is that I bought it to use it in Ecuador, and the GSM bands where not the right noes for Latin America and the phone only works on Edge, that means that the battery lasts even less.", "Date": "March 1, 2013"}, {"Title": "very nice", "Author": "DominGO", "ReviewID": "R2SIDAR08Q06H2", "Overall": "4.0", "Content": "I am satisfied with the performance of this phone and I find to be very user-friendly in nature. The features and applications of this phone are interesting and I always enjoy going through them. I have checked the performance of GPS and it is very satisfactory. Also, I have found that  if the battery is completely charged and is then used continuously for a day, it can be used easily without having the problem to recharge it in between.", "Date": "January 2, 2013"}, {"Title": "until", "Author": "Ga Hin", "ReviewID": "R28SH4FKU9CUD2", "Overall": "3.0", "Content": "it worked fine until I had to reset it. after that I could not access google play or set up a google account. it never could estabilsh a good enough wireless connection. now it doesn't work at all. so i tosed it out.", "Date": "December 26, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "It supports international version and no warranty.", "Name": "Motorola Milestone 2 Unlocked Cell Phone with 5 MP Camera, MP3, GPS Navigation,720p HD video--International Version with No Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/41uwqnr4BtL._SX300_.jpg", "ProductID": "B004EST9B0"}}