{"Reviews": [{"Title": "Finally got Froyo update!", "Author": "ert_medic", "ReviewID": "R1DR1EREJSZICO", "Overall": "4.0", "Content": "This is definitely TMob's best bang for the buck, period!  It's great on reception for both data and voice.  It's compact, lightweight, reliable and looks great--especially in an Otterbox Commuter Case.  Battery is good (dont need to tether it to a wall) and the phone feels like a high end phone, not some flimsy piece of plastic.  I've had 4G phones and Apples galore but keep coming back to this thing.  It's the best TMob Droid I've ever owned.  This thing takes a licking' and keeps on tickin' like you wouldn't believe!  It holds true to being submersible, wind, and shock proof.  I've taken pics under water with this thing!  This phone built up my confidence in Motorola so much that I will probably end up waiting for another TMob Motorola phone release before upgrading.  Don't frown upon it because it's only 3G, it's faster than most phones I've had and way more consistent, even compared to 4g's.  The wifi works great and Motoblur is a lifesaver.  Camera takes great photos even underwater and comes with a flash.  No complaints about picture and video quality.  The sound quality is substantially better than even most of today's options.  If this phone was 4g with a dual core processor and a front facing camera, I'd give it 5 stars without hesitating. 2 years of heavy use and abuse and it's still running better than most.  I've had 4G lg's, htc's, samsungs, and an iPhone 4 before settling down with this fine example of quality.", "Date": "July 10, 2012"}, {"Title": "Great Durable and Rugged Android Phone!", "Author": "Sam", "ReviewID": "R3LDHNLWCP022H", "Overall": "5.0", "Content": "This phone is great, I have been looking for a phone that is built tough. It has heavy duty gorilla glass lcd with scratch resisitant feature, no need to worry about installing lcd protectors. It is also is water resistant and dustproof, you can use it in any weather conditions such as rain, snow, or even at the beach. Highly recommend this phone, especially if you mainly use your phone outdoors, it can withstand most conditions and is rugged enough to take a fall. It has worked great for the past few months and with the recent updates the phone is running smoother and faster than before.", "Date": "April 29, 2012"}, {"Title": "Phone fails repeatedly", "Author": "cbogie", "ReviewID": "R2M22DUMFFO8LB", "Overall": "1.0", "Content": "I had high hopes for the Motorola Defy.  Unfortunately, the phone's internal hardware did not handle Android 2.2 well enough to function normally.  T-Mobile replaced my handset 3 times every time I called complaining about lag.  By lag, I mean it was nearly impossible to simply make calls or send text messages.Dropping the phone into a glass of water at parties was awesome, but a phone should have some other features; making calls would be great.", "Date": "July 26, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Text With Swype- Simply Slide Your Finger Over The Letters To Draft A Text Message\nVoice Actions From Google and Integrated Google Apps Are Pre-loaded\nListen To Your Voicemail Messages In Any Order and Easily Manage Your Inbox Without Calling In\nWiFi HotSpot Capable", "Name": "T Mobile Motorola Defy with MOTOBLUR Black for T-Mobile", "ImgURL": "http://ecx.images-amazon.com/images/I/51Vfr5U567L._SY300_.jpg", "ProductID": "B004LGBIJG"}}