{"Reviews": [{"Title": "Very good android phone with lots of features", "Author": "HSaber", "ReviewID": "R1OHOJLINHGXIP", "Overall": "5.0", "Content": "This phone is just what I was looking for, very good design and the phone is really slick and very easy to use. It came with Android v2.1 Eclair \"I updated it to v2.2 Froyo and it's amazing\" installed many apps from market which is a great thing, camera is AF with very good pictures but lacks the flash also the phone has a great sound and if I want to make this shortPros :1- Very slick and light weight2- Very good design3- Android OS is amazing :)4- Touch screen is very good5- battery lasts up to 3 days with heavy useCons :1- Camera lacks flash2- WiFi dosen't work well with Android 2.1 but with 2.2 it runs smoothIn the end I recommend this phone to anyone who wants a real good phone with less bucksI'll update this review later if something else came up", "Date": "December 9, 2010"}, {"Title": "The Phone actually came locked", "Author": "Bruno Abdon", "ReviewID": "RW3NVXSBJQSF1", "Overall": "1.0", "Content": "The seller actually sent me a locked cell phone. And I don't even know to which carrier it's locked to. I contacted them and they would simply deny the fact, or ask me to contact Samsung about it. Samsung asked me to contact my carrier, but the point is that the phone is not locked to my carrier. The point is, the phone asks for the \"SIM network unlock PIN\" when it turns on, and won't accept a SIM card from my carrier without this magic code.I'm left with an expensive touchscreen MP3 player.The smartphone itself is a great, if not the best, budget option for an Android device.It only lacks a real camera. 3.1MP and no flash makes it a toy camera. But if you won't be using your cell as your main camera, this is pretty good indeed.A point worthy noting is that the GPS will not work outside North America without applying some hacks. Fortunately, the are some apps on the Android Market that will the GPS optimization for you. I haven't tried them though.As a pro, I loved the contacts synchronization with Google Contacts (you GMail contacts), Facebook and Twitter. It will download all your contacts from these accounts and merge them when the names coincide. You're given the option to hide the contacts that lack a mobile phone (like will be the case for most of your GMail contacts). The Facebook synchronization saved me the effort of setting a picture of every one of my contacts: It will use the current Facebook profile photo.", "Date": "January 12, 2011"}, {"Title": "Good cheap smartphone with Android", "Author": "Dmitry Lysenko", "ReviewID": "R23N2DH5R2LA3D", "Overall": "4.0", "Content": "Pro:  Android 2.1. (stability and variety of software),  Communication (Wi-Fi, GPS, Bluetooth, FM-radio).  DNLA technology (multimedia server)  Camera with autofocus  Standart software consist of all program what you need  at the beginning(Multimedia, GPS Navigator, MS Office Viewer, Mail,  Internet brouser, even compass)  TouchWiz 3.0 - useful in brouser  Battery (2 days of intensive using)  PriceContra:  Screen and resolution (you may even see pixels!)  Camera don't have flash  Slow viewing big images in the galleryOverall good phone for this money.", "Date": "November 18, 2010"}, {"Title": "Awesome", "Author": "Philip", "ReviewID": "RFK16F18HY207", "Overall": "5.0", "Content": "I got this phone two days ago which i was waiting for 3days. It's way better than what i expected and its just awesome.the delivery was fast and the phone itself is just so smart and so comfortable. its actually better than galaxy s in the size and the shape because galaxy s looks like a square and similar to the iphone. But galaxy 3 looks like samsung, and there is no phone that can be compared to this..i read a lot of reviews about this phone but some of them were wrong because the battery is lasting so long that i am really surprised. its lasting 2 days with heavy texting, calling, internet browsing but battery is more than half full. also the back light is really bright you can see with bright sunshine. the touch screen is so smooth and its just similar to galaxy s.i really recommand this phone to people who are looking for a smart new phone. its also adroid with youtube, internet, navigation, and smart search, and many other useful programs with wifi so go for it.", "Date": "January 4, 2011"}, {"Title": "Troubles with the lock code", "Author": "jldoria", "ReviewID": "R344YBB3IZCJJI", "Overall": "1.0", "Content": "On december 17 2010. I bought the  Samsung GT-i5800 Galaxy 3 Unlocked GSM Smartphone with Android OS, Wi-Fi, GPS, Touchscreen--International Version with No Warranty (Black). My phone works until two weeks ago, with one and only one mobile operator; but now, every time i power it on, the phone asks for a sim network code, and, obviosuly i cannot use it.Who will respond for this? amazon or Samsung?Jorge Doria", "Date": "May 2, 2011"}, {"Title": "Great phone", "Author": "Ronald", "ReviewID": "R3P7MPYA3OUNS5", "Overall": "5.0", "Content": "This was a great purchase, A friend of mine bought the galaxy S and It got me wanting a new smartphone, And I can say that this phone can easily match the galaxy S in functionality, It's just a little slower and there's the obvious display size difference, but other than that, It's just as good. Oh and If you're wondering about the gps problems that have been reported, I had no problems but If you do, there are a couple of apps in the market that can fix this in no time. Great cell phone and great service from the seller as well.", "Date": "January 18, 2011"}, {"Title": "Very good phone for a smart price", "Author": "Vetea", "ReviewID": "R1PQG8BE4QKGMO", "Overall": "4.0", "Content": "Very nice product from Samsung.Everything works good with Android 2.1There is a huge helpful community for this phone, all the same issues I had at the beginning were already solved in forums (just need to have the time to look for solutions [...] )Problems I had : GPS which didnt work good, but fixProblems with the market : couldn't download apps : solved by clearing the cache of Google appsWhat is missing :a flash for the cameraan official firmware 2.2GSM Quad_band, so will work for phone call all over the word but, only 2 band for G3, It won't work in USA with AT&T; (but EDGE will) and either in Costa Rica (and no EDGE there so no data connections. So be aware of the frequency of your 3G provider network ;) (I wasn't)I do recommend this phone", "Date": "December 31, 2010"}, {"Title": "worst phone for price ever", "Author": "Tomas Mendizabal", "ReviewID": "R16U2HWQ1MFAQ1", "Overall": "1.0", "Content": "The phone looks great, but thats about it.  I could never get the computer to communicate with it, not even with the latest software updates.  The operating system is way too slow, it cant even handle the calendar application which comes with the phone.  It crashes more than a windows vista computer! Dont even try running things like facebook or angry birds (slow birds rather). I doubt the internal memory for applications reaches even 200MB (yes, MB), but since the phone wont tell you, i guess ill never find out before i finally sell this coaster.  I just can download very many of them before it fills up and of course, you cant store them in the microsd card.  Ive been able to find no covers, no dust jackets, no accessories AT ALL for this phone, and Samsumg customer service is not even worth mentioning.  Would rate it 0 if possible.  Just buy Nokia or Iphone or some decent brand of phone.", "Date": "February 13, 2012"}, {"Title": "Great for your first android", "Author": "Carla Villavicencio", "ReviewID": "R18Z8RFAWCCFH6", "Overall": "4.0", "Content": "I m very pleased with this phone,arrived really quick to my house 3 days before the stimated date so that was a nice surprise,the actual phone is not heavy at all, the only downside of this phone is the camera quality it s not what you will expect,it s not bad it s pretty decent during the day or with the right lights on but the camera itself it s it s horrible in the nights or in low light conditions,the night mode it can only improve a little bit the quality of the pictures,my old nokia e63 takes better pics that this one,but still I did not buy this phone because of the camera, the android it s v2.1 make sure you have an SD card for your phone or buy one cause you are going to need it soon.It s a great phone,not the best,but it really works for a first time android user or someone who needs a better phone to surf the web social media and cool aplications, oh it is unlocked I just put my sim and voila I have service and made my first call", "Date": "November 6, 2011"}, {"Title": "Very good mid-range Android CP", "Author": "Edward", "ReviewID": "R1RF0E5VA2P25I", "Overall": "4.0", "Content": "My first time to try an android phone from AMAZON.Pros:1) Great budget phone.2) Easy to setup3) Cool features (Pictures, Music, etc.)4) Received the items very fast from the reseller.5) Android 2.16) Lots of free applications7) WiFi is working really good for me8) Phone looks good, simple and straight forward.Cons:1) Android 2.1 not 2.22) Processor is just OK3) Small built-in storage4) There is a noticeable lag switching between applicationsI am very pleased with my first android experience; coming from a Nokia user - I can say that I've made a good decision.Made plans to upgrade - another Android phone with faster processor and AMOLED screen and front facing camera in the future.", "Date": "March 2, 2011"}, {"Title": "Samsung GT-i5800 Galaxy 3", "Author": "josemvv", "ReviewID": "R1Z2K2D0BIF9JJ", "Overall": "4.0", "Content": "Trabaja muy bien en la red del ICE, algunos apps no funcionan del todo, mejor desinstalarlos y probar con otros. La resolucion de pantalla es bastante buena, inclusive la camara que trae este dispositivo. En cuanto al resto de usos que se le puede dar, este telefono es muy comodo por las aplicaciones que usa. Cuando se tiene activado el Wi-Fi, y el GPS por lapsos prolongados consume mucha bateria.Telefono muy bueno.Product Features and Technical DetailsProduct Features  3 Megapixel Camera  TFT capacitive touchscreen 3.2 inches  Wi-Fi 802.11 b/g/n and GPS Navigation  Bluetooth v3.0 with A2DP  Up to 15 h 30 min (2G) / Up to 7 h 15 min (3G). Up to 620 h (2G) / Up to 510 h (3G)Dimensions  Size (LWH): 5.9 inches, 3.7 inches, 2.3 inches  Weight: 12.8 ounces", "Date": "April 22, 2011"}, {"Title": "I bought this phone so many years ago", "Author": "Christian L", "ReviewID": "RGSFEQGFKCVG6", "Overall": "2.0", "Content": "I think I bought this cellphone around 2009. It was good since it was my first android phone. It was slow. The processor is not that good. As a basic cellphone and for the price I guess is ok.I feel that now a days if you really want a good android phone just go for the google nexus. Since now they are really cheap.", "Date": "February 18, 2013"}, {"Title": "The Little Smart phone that Could.......", "Author": "R. E. Stevens \"macgyversite\"", "ReviewID": "R1OT90YO8O3P5X", "Overall": "5.0", "Content": "I got this for my son Dec of 2010. Unfortunately as the world turns. He needed a bigger phone with full keyboard for his Nursing school so they can do bed side instruction using Skyscrape software. Guess who got the \"Mini Galaxy\". ;-) Anyway. The phone is great. I mean great. Everyone that has problems really shouldn't once you get it \"Unlocked\". We upgraded it to 2.2 and that was pretty easy. Google is your friend on that one. Not one problem in over 6 months. I have yet to have it lock up or need to restart. Sure the screen isn't super high resolution. But it is oh so smooth a phone. Texting, Pics, phone calls, Wifi, Internet. 3G is great too. How does this compare with the real Mini Galaxy? [...] Here shows it all except for usability. I would go for the Mini Galaxy S5570 because it is $50 cheaper and the specs are almost the same. Otherwise. This phone rocks. It is small. Great to hold and just a pleasure to use. It is a win win with either one you decide to get.", "Date": "September 6, 2011"}, {"Title": "locked celphone", "Author": "Cristina Alarcon", "ReviewID": "R36E8IVVY0HUVS", "Overall": "5.0", "Content": "hiI bought the Samsung GT-i5800 Galaxy 3 Unlocked GSM Smartphone with Android OS, Wi-Fi, GPS, Touchscreen--International Version with No Warranty (Black, but the phone will release and when i turn it on again, the phone ask to me for a pin unlock key for unlocking network, then the phone is locked and I want to help me to unlock or give me some solutionthank you very much and I hope your answer", "Date": "July 21, 2011"}, {"Title": "Best low cost Android phone", "Author": "Sreeharsha", "ReviewID": "R3IBF4LAOFT32W", "Overall": "5.0", "Content": "I have been using this from past 4-5 months, and found it extremely comfortable and one of the best low end android phone. I upgraded to the Froyo version. The screen is responsive, no lag, the only issue I found till now is the Wi-fi signal, the signal strength is very poor and you have to be next to the Router if you need good signal, any obstacles will drop signal considerably. My other phone and IPod catch Wi-Fi signal perfect where this phone fail to catch Signal. Apart from this, the phone works fine and has no other issues. I use T-Mobile, works fine.Note: This is not compatible with T-Mobile 3G n/w, only Edge supported.", "Date": "June 5, 2011"}, {"Title": "Worst Product", "Author": "Raj", "ReviewID": "R1FGT0Q0EEZFSV", "Overall": "1.0", "Content": "This Samsung GT-i5800 Galaxy 3 Unlocked Phone is the worst product that I ever bought. I am so disappointed with this phone that I would never buy online. If I hadn't bought online, I could have return easily. Every functionality has problem(system hang,off while talking, problem with GPS.....). I wanna request all the sellers not to sell the products that is full of minor problems. Lastly, buyers pls review the product before you buy and I would not recommend this particular product even to my enemy.", "Date": "December 7, 2011"}, {"Title": "Samsung GT-i5800", "Author": "Edén Torres Torres", "ReviewID": "R1SOCH7WK74DMP", "Overall": "4.0", "Content": "Por ser Quad-band funciona en cualquier país, el mio esta funcionando en Nicaragua. Excelente teléfono por un precio módico. Aunque no he contratado un plan de datos con la telefónica local, eso no ha sido problema, ya que en casa tengo wifi.  La capacidad Touch es perfecta, Angry Bird funciona muy bien !!!. He instalado muchas aplicaciones gratis desde Market. La calidad de las llamadas son buenasCosas acorde a su precio, la bateria dura a lo sumo 24 horas ( común en los smartphone con wifi y 3G ), Samsung se ha retrasado en la actualización de Froyo (Android 2.2) para América.", "Date": "December 28, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "3 Megapixel Camera\nTFT capacitive touchscreen 3.2 inches\nWi-Fi 802.11 b/g/n and GPS Navigation\nBluetooth v3.0 with A2DP\nUp to 15 h 30 min (2G) / Up to 7 h 15 min (3G). Up to 620 h (2G) / Up to 510 h (3G)", "Name": "Samsung GT-i5800 Galaxy 3 Unlocked GSM Smartphone with Android OS, Wi-Fi, GPS, Touchscreen--International Version with No Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41PrtNXG4xL._SY300_.jpg", "ProductID": "B0041A7QPM"}}