{"Reviews": [{"Title": "Neat Little Phone!", "Author": "Str8t2thePoint", "ReviewID": "R24J5ZFL92VUHG", "Overall": "5.0", "Content": "I was on a mission to both downgrade from my Tmobile contract $70 plan to their prepaid $15 per month texting plan as well as find a decent messaging phone to go with it. I was a very disappointed with the prepaid phones available through Tmobile, so I hit the web in search of the perfect unlocked phone. I have found it with the Samsung Ch@t c3500. I bought it through Best Buy and not Amazon, but I wanted to put in my 2 cents here.Calling: Calls are very clear and at an appropriate volume. I don't do a lot of voice calling, but on the calls I've made I've never had a problem.Messaging:The keyboard is on the small side (it's a small phone) and takes a little getting used to, but it doesn't take long. The only oddity I've encountered while sending a text is sometimes when you press 'done' in order to send it will add on an extra letter to the end of your last word. You still have to push 'send' to actually send the message though so you have time to fix it before looking like a sloppy idiot. This doesn't happen too often however.You have the ability to access individual conversations as well as the general inbox. Note that while you are in 'Conversations' it does not record that you have read new incoming messages and they will still show up as 'new' in your inbox. This can be annoying, but at least you can navigate your convo's individually instead of having to sort through them!Sending picture messages is nice and simple. If the file is too large it simply asks if you want to re-size it. It does this automatically, taking the responsibility of choosing an appropriate resolution away from you so you can concentrate on what you wanted to do in the first place: send the message! And if you really want to get your point across you can also add sounds or video to your messages.General Features:It's very easy to add, search for and edit contacts. It's also very easy to delete the wrong one, so be careful of that! (I recommend choosing 'Delete Multiple' even if you're deleting only one. Just be sure you've got the right one selected.)On screen you have the ability to set up numerous customizable widget pages. I currently have seven, and they are very easy to scroll through to find what you need.Out of the box, when you flip out the qwerty keyboard, the phone automatically opens the 'create a text screen' but this feature is easy to turn off if you, like me, slide open your phone just to wake it up.You have two themes and font types to choose from. One is pretty standard looking and the other has a kind of funky hand drawn look to it. It would be nice to have more, but really, who cares?You have a few neat features like SOS messaging and Mobile Tracker. The first sends an emergency message to 5 recipients if you are indeed in an emergency situation. Of course you have to get to your phone and press the hot key to activate it. No AI intuition, sorry. Mobile Tracker is useful if your phone is stolen because when the alleged thief inserts his/her SIM card the phone will send their contact info to 2 recipients of your choice.It also has a Fake Call generator. I got a kick out of that.I was very happy to find that the Calendar, Task and Memo features were very quick and easy to use. As a student, I need all of the easy organizational  tools I can get. My last phone was an HTC \"smart phone\" that took about 5 minutes just to open the damn calendar let alone do anything else. Horrible!The camera is decent, but nothing to brag about at 2mp. It has your basic \"effects\" and also records video, but at a low res, so it's really only for phone use. It doesn't seem quite as slow as other phone camera's I've operated in the past, so that's a plus!The radio is a neat feature.. if you listen to the radio. I usually don't but I gave it a quick test for this review. The only problem I have with it is that it won't work unless you have the headphone jack plugged in. It DOES allow you to switch between the head phones and the phone speaker but only when the head phones are plugged in. Sounds dumb, I know, but there's no obvious way to change it, even in the Settings menu. I do like that it's very easy to find and save stations. It also has a pretty cool transistor radio motif and you can record sounds and save them as ring or messaging tones. Final note: the jack didn't work very well with a pair of Sony ear buds I have. Though the 3.5mm male piece was the same size as the one the phone came with, it slid out easily and disrupted play.(Pretty sure my terminology there was..faulty. Sorry! haha)Unfortunately I haven't had a chance to test out any of the social networking or otherwise internet related features yet. I currently do not have a data plan. From all other experiences with this phone I assume that they are more than adequate if you're not looking for Android-like tech.IMPORTANT TO SOME: THIS PHONE COMES WITH NO GAMES!! I'm okay with this..but sometimes it sucks only because I really want to play with my new phone! :/ lolPhysical Features: The Touch screen is fairly fast and accurate. It's no iPhone, but it's not annoyingly clumsy either. Size wise, the screen is small compared to a lot of Android and smart phones out there but not TOO small(eyeballing it: about 1.5\" by 2\"), and it's crisp and clear. You don't get the sense that you've got a substandard device in any way.As far as structural integrity it doesn't seem as solid as other Samsung sliders. I detect a faint wiggle in the slide action occasionally. Also, contrary to one Youtube reviewer, the backing is extremely easy to remove! So if you drop it, you can bet your battery is flying right out of that thing! I recommend a carrying case for it (yeah I hate them too) but this phone does need SOME kind of safety net.Buttons on the outside are limited to volume control and the unlock key. There is no dedicated camera button, but in my experience this is more of a nuisance than anything else!Samsung has a very nice little sliding door for the micro USB port. Love it. This is the only other apparatus on the outside of the phone.Remove the backing and there is a slot for the memory card (not beneath the battery). Literature states that it supports up to an 8gb card but I currently have a 16gb in there with no trouble. The SIM card slot is beneath the battery.I read one review that said this phone was beat with an ugly stick...and I have no freakin idea what that person is talking about. I find this phone very aesthetically pleasing compared to most Samsung (or other) slider messaging phones out there. I also, by chance, purchased the white version. When I ordered it online it said it was black but I actually think the white adds something. Maybe it's just the contrast to the black around the screen but it looks pretty cool.Other: This phone comes with a very limited instruction guide. So, if you are not inclined to patience and curiosity, you may become frustrated.  Thankfully, a little exploration will get you where you want to be in no time.Overall, I love this phone. I think I've provided more than enough info for you to decide on whether it's for you! Thus concludes my review! Happy hunting!", "Date": "December 8, 2011"}, {"Title": "Very satisfied", "Author": "cstar09", "ReviewID": "R2EL4T5N8CG9JQ", "Overall": "5.0", "Content": "I purchased this phone 2 days ago and I am absolutely in love with it! It is the perfect music phone! It was a bit smaller than I expected but either way it's amazing. So far a very decent phone, it works with ATT/Tmobile. It came with headphones and the touch screen is pretty accurate. I am fairly satisfied with my purchase. Stay on a budget and  get an unlocked phone with a touch screen and keyboard!", "Date": "August 31, 2011"}, {"Title": "Great phone for texting!", "Author": "DontForgetThexD", "ReviewID": "RZRV0L5DOO2HU", "Overall": "4.0", "Content": "I actually really like Samsung Chat GT-3500. It's very small and a great phone for texting. Call qualities are good. It has a MP3 music player with a decent speaker. It doesn't really have is wi-fi. If you want to use the internet, then you have to pay through your phone plan. Therefore, some features doesn't work along with this phone. Overall, I'm pretty satisfied with this phone.UPDATE: 11/28/2012I'm still using Samsung Chat GT-3500. Everything works. I still think this is probably one of the best phone to text for its price. It's a great back-up phone or for those who love texting.", "Date": "January 30, 2012"}, {"Title": "Returned", "Author": "SWB", "ReviewID": "R3SW8KE7BT7ZHJ", "Overall": "3.0", "Content": "The phone functioned fine for about a week, but it has now started to turn itself off when I slide the keyboard. Also it does not allow for MMS  with AT&T.;", "Date": "March 2, 2012"}, {"Title": "Love it!!!", "Author": "Dalila Zachary", "ReviewID": "R29UIKJYIA0YTQ", "Overall": "5.0", "Content": "the keypad is a bit small, otherwise totally cool little phone. light and user friendly. the camera is only 2MP, but the picture quality is not bad and the sound quality from the music is also very good.", "Date": "January 13, 2012"}, {"Title": "this phone is impossible", "Author": "Toonie", "ReviewID": "R2DL3JGB6KXID4", "Overall": "1.0", "Content": "I bought it with unlockedcellphonekings fulfilled by Amazon. The phone arrived today and within 4 hours I decided to ship it back. I feel like I had gotten a fake product.-The phone felt extremely light and filmsy.-I like how they advertise for you to buy it with a memory card.. but why?? this phone DOES NOT have a memory card slot!!!-The instruction (the lack of thereof) booklet was made up of 4/5 pages written in incomplete sentence that was grammatically incorrect.-The wall charger came with a 3 prone plug in addition to a current converter (which made me realized this phone came from Britain) there was a 3.5mm headset missing and worse of all,-I can't even connect to a server to send picture messaging mind you I have a T mobile data plan.I've been eyeing this phone since last December and I am so bummed that I had to ship it back but this phone was just impossible. Either I got a flake or this really wasn't a bright choice to begin with. I felt like the website information is VERY  misleading and that the seller isn't really credible. I'm never doing this again.", "Date": "March 9, 2012"}, {"Title": "Dont buy this phone", "Author": "Tonia A. Petty", "ReviewID": "R1N5O1KNIA2VNE", "Overall": "1.0", "Content": "This phone died before I really had a chance to really use it.  I probably used it for two weeks.", "Date": "August 8, 2013"}, {"Title": "not too bad...", "Author": "The TaosTiger", "ReviewID": "R3N5RAWABSU1Q8", "Overall": "4.0", "Content": "overall a good phone. works with an at&t; sim card and memory card. i like that i can use certain features like the radio without having a data plan. messaging works well. however, the picture messaging will not work and the time of retreival of messages and calls comes up about an hour off.", "Date": "March 14, 2013"}, {"Title": "Don't bother. Not worth the hassle.", "Author": "Rahimullah Khan", "ReviewID": "RFJQ4AKIOCQBP", "Overall": "2.0", "Content": "You're better off buying a cheap prepaid to match your carrier than this thing.This phone is maddeningly difficult to set up for proper MMS (picture/email gateway) messaging, as the manual settings are incomplete and it takes some serious wrangling to trick the phone into being properly configured.It's also almost completely impossible to find help online for it in English, absolutely impossible to find USEFUL help online in English, and to top it all off, it started acting up within two months of purchase.By acting up I mean of course randomly ringing without phonecalls, randomly turning itself off or turning itself on, losing settings...So it was replaced with another phone and now sits in the drawer as a backup-backup.Honestly, get a crappy Nokia candybar if you want a cheap phone to get you through between upgrades or as a backup.", "Date": "November 15, 2012"}, {"Title": "Terrible Phone Ridden with Bugs", "Author": "Jason Crawford", "ReviewID": "RSWOL4WAUNCQ2", "Overall": "1.0", "Content": "I got this phone to use as a prepaid phone for a side business.  What a mistake!  This phone is atrocious!  The touch screen is reflexive and very unresponsive.  Furthermore, it's ridden with bugs, including if the alarm goes off, it will just vibrate forever until the battery is dead!  You can't just start typing a name to find them in your contact list; you have to scroll or use a separate search page, both very time consuming processes.  They keyboard buttons are completely flat and flush with the phone's surface, making them more difficult to press.  Also, the keyboard is backlit, but the navigation keys on the phone's face aren't! The only plus for this phone is the battery life.", "Date": "October 9, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.4-inch Touchscreen display\nQWERTY keyboard\nBluetooth\n2MP camera\nStereo FM Radio with RDS", "Name": "Samsung Chat GT-C3500 Chat with 2.4-Inch Touchscreen, QWERTY Keyboard, and 2 MP Camera - Unlocked Phone - US Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51CuLniQggL._SY300_.jpg", "ProductID": "B004QGXX3A"}}