{"Reviews": [{"Title": "The worst purchase I ever made", "Author": "Frank", "ReviewID": "R2S2WSARW9G6AS", "Overall": "1.0", "Content": "I purchased 2 phones which supposed to be new. One of them worked fine, the second one  was not new. It was damaged. The SIM Card holder was missing a contact. The phone was not unlocked. I contacted the vendor's direct phone line and they never got back with me. I already spent $75.00 in getting it to work. I am currently in the Dominican Republic where I brought both phones as a gift to relatives. I will be back in the US this Saturday and will write a detail review. Again this was the worst online purchase I ever made.", "Date": "July 17, 2012"}, {"Title": "blackberry 8520", "Author": "Reinaldo Colina \"Colina\"", "ReviewID": "RDN02XUFGXKLY", "Overall": "1.0", "Content": "English:It's not new at all quite sure that the product is not new, the charger never served, as it is explained that a new charger does not work? the seller must test the product before selling it. the phone works fine with the operators of my country but again not new is remanufactured.Español:No es nuevo, para nada muy seguro que el producto no es nuevo, el cargador no sirvio nunca, como se explica que un cargador nuevo no funciona? el vendedor debe probar el producto antes de venderlo. el telefono trabaja bien con las operadoras de mi pais Venezuela pero insisto no es nuevo es refabricado. sirve con movilnet.", "Date": "March 5, 2012"}, {"Title": "refurbished", "Author": "Patiarroy", "ReviewID": "R1O2EQAF5LFCOS", "Overall": "1.0", "Content": "this phone is refurbished and badly damaged, never buy from (Wireovia) only work a week and when the technician opened the phone it was a disaster", "Date": "January 21, 2012"}, {"Title": "worst online purchase", "Author": "lorace", "ReviewID": "R2UPSHUO7JIKN2", "Overall": "1.0", "Content": "I bought two supposedly new phones one has loose screws which were already removed. the other one the scroll button has frozen. I'm on vacation with two useless phones. You need to do better", "Date": "July 18, 2012"}, {"Title": "Bought used phone", "Author": "Dude George \"George\"", "ReviewID": "R2T00VED6HIF04", "Overall": "5.0", "Content": "Phone is a good Blackberry and had no problems with the phone itself or getting onto my local phone network, just dropped in my SIM and up and running ... Not much else to sayEdit:It has been several months now and phone has preformed flawlessly, could not be happier.", "Date": "May 27, 2013"}, {"Title": "good", "Author": "johanam", "ReviewID": "R2LI1S9LZFCHPL", "Overall": "5.0", "Content": "excellent product, I loved it, so I will use for a good occasion, I recommend it 100%, good presentation, thanks", "Date": "August 11, 2013"}, {"Title": "Good", "Author": "Pet", "ReviewID": "R27K7C8N4PPT05", "Overall": "4.0", "Content": "this phone came in a very good condition it was like new, no scratch, no prob so far, and its a bit different from other curves ive seen was a good buy", "Date": "August 6, 2013"}, {"Title": "Great Product", "Author": "The One", "ReviewID": "R26B4ZW36PWBUR", "Overall": "5.0", "Content": "I love this product very much. The product is clean, looks new and I would encourage anyone to buy this product. This is what I expected and great Job seller. AAAAA++++++++", "Date": "August 1, 2013"}, {"Title": "Exceptional", "Author": "Ian Ayton", "ReviewID": "R3CFTUL6V04O3V", "Overall": "5.0", "Content": "phone arrive very early and was surprise with a memory card added for free. This is exceptional service and was above expectation.", "Date": "April 15, 2013"}, {"Title": "my charger port fell out in less than a week", "Author": "Juliet", "ReviewID": "R38HFW2NYWLH6I", "Overall": "2.0", "Content": "My charger port fell out on the 5th day.  I believe that this phone was refurbished and not new as advertised.", "Date": "July 7, 2012"}, {"Title": "Blackberry 8520", "Author": "hengerberth diaz", "ReviewID": "R1327QAOJE0G63", "Overall": "4.0", "Content": "Excelente el producto, no he tenido fallas algunas con el teléfono funciona todas sus funciones,tal cual lo indican en la pagina.", "Date": "April 27, 2012"}, {"Title": "Excelente Producto y vendedor", "Author": "american Supply", "ReviewID": "R3HTK1FCA45Y1Y", "Overall": "5.0", "Content": "El Celular llego en excelente estado, el tiempo de entrega fue muy rapido. Funciona a la perfeccion en Venezuela con Movistar. Aun no lo pruebo con otra Compania,", "Date": "March 3, 2012"}, {"Title": "Waste of $$$:", "Author": "Canalero1", "ReviewID": "R20DR90E0HGE1R", "Overall": "1.0", "Content": "Pros: Worked well, for a While, lol.Cons. Did not die Suddenly. Just Fell Apart daily, From the outside In.  Just Faded Away Daily, until..., No More...!", "Date": "February 24, 2014"}, {"Title": "BlackBerry", "Author": "JavierOcandoC", "ReviewID": "R18HJNC49E8ICX", "Overall": "5.0", "Content": "Phone is a good Blackberry and had no problems with the phone itself or getting onto my local phone network, just dropped in my SIM and up and running", "Date": "February 23, 2014"}, {"Title": "Is It New Or Not?", "Author": "Dean Corso", "ReviewID": "RRNY2TK070OBU", "Overall": "1.0", "Content": "This is an excellent phone especially new BUT from the reviews here stating this is NOT a new phone as advertised, who would by one? This not from just one person but many. Not me or anyone I know. This company needs to tell the truth or Amazon needs to get rid of them!", "Date": "November 14, 2013"}, {"Title": "Nice Blackberry cell phone", "Author": "Yuri", "ReviewID": "R244P3MO4QED3F", "Overall": "4.0", "Content": "Nice cell phone from Blackberry, very useful to check email, calendar, take pictures and keep all your contacts in one place.", "Date": "November 3, 2013"}, {"Title": "sterling", "Author": "Victor", "ReviewID": "R18E9LH3U9CDET", "Overall": "5.0", "Content": "Excellent what I expected, I recommend fully responsible store, the product is new, is the attention that you expect from the stores here, so should be all ...", "Date": "June 2, 2013"}, {"Title": "Excelente equipo", "Author": "Melvi A. Lemoine", "ReviewID": "RGWQ0MHEAM8G", "Overall": "5.0", "Content": "Excelente equipo, lo recomiendo a quienes desean tener un buen equipo por mucho tiempo, es lo mejor que BB ha tirado al mercado.", "Date": "March 20, 2013"}, {"Title": "bien para el precio", "Author": "cehily martin", "ReviewID": "RFXP16RK811B2", "Overall": "4.0", "Content": "si viene liberado lo estoy utilizando en venezuela  buen telefono. le puse un chip movilnet y tiene señal. la corneta suena un poco baja", "Date": "February 25, 2013"}, {"Title": "Excelente Equipo", "Author": "Massiah", "ReviewID": "R3UBKUTMBK37WT", "Overall": "5.0", "Content": "Buen Rendimiento, fácil de usar. Totalmente recomendado. El proveedor entrego el producto en muy buen tiempo. No deje de adquirir este equipo.", "Date": "February 25, 2013"}, {"Title": "malo", "Author": "yhonny aponte", "ReviewID": "R1SMR1LER02GQ2", "Overall": "1.0", "Content": "el equipo llego dañado ni prendia se supone que era nuevo y creo que era reconstruido bueno perdi el dinero", "Date": "February 22, 2013"}, {"Title": "El equipo NO es nuevo", "Author": "kerry", "ReviewID": "R2K6LG5VEJXIO6", "Overall": "1.0", "Content": "I bought a new article. The article's descrpticion is \"NEW\" and the item is refurbished. Prices are differente when the item is new or refurbished. I want my money back. The money need to be refund. I am waiting for you answer...", "Date": "February 7, 2013"}, {"Title": "Good Service", "Author": "JOSE", "ReviewID": "R1TEAOGWNE5LO4", "Overall": "5.0", "Content": "The product is good 100% and was shipped in the same day and im fine with the service The product is good 100% and was shipped in the same day and im fine with the service. Love it", "Date": "February 4, 2013"}, {"Title": "Excelent", "Author": "oscar", "ReviewID": "R6ZREKVNKK4IJ", "Overall": "5.0", "Content": "Excelent product everything's good I,m very satisfaced sito it. I recomend tris product to all people that want it. Good", "Date": "January 27, 2013"}, {"Title": "Alejandro", "Author": "Alejandro Martinez", "ReviewID": "R5B0SK2VU8PM9", "Overall": "5.0", "Content": "\"caracas Venezuela excelente servicio lo descrito por el vendedor lo recomiendo cien por ciento justo el producto q necesitaba Gracias\"", "Date": "January 24, 2013"}, {"Title": "buen telefono 8520", "Author": "darwin guatarasma", "ReviewID": "RMHR8VUIUN81A", "Overall": "3.0", "Content": "muy buen producto, cumple con mis expectativas y requerimientos, producto llego a tiempo y en excelentes condiciones por parte del vendedor, se los recomiendo para futuras compras", "Date": "January 14, 2013"}, {"Title": "BB ok", "Author": "jean", "ReviewID": "R3QYB3YTRPBFLB", "Overall": "5.0", "Content": "I kids  loveit and everithing it's ok , arrive just in time in my local, the package don't have any troubble and the price is so cheap for that reason a buy more", "Date": "September 26, 2012"}, {"Title": "Excelente los recomiendo", "Author": "Guillermo Diaz", "ReviewID": "R1J7R5KF05E845", "Overall": "5.0", "Content": "excelente los aparatos estan nuevos y en muy buen estado les seguire comprando y esperando que sigan manteniendo la excelencia en sus aparatos", "Date": "September 19, 2012"}, {"Title": "excelente", "Author": "Haydee", "ReviewID": "R1EX8W0JNA0FB3", "Overall": "5.0", "Content": "Hola, disculpen la demora, si recibi mi telefono celular curve 8520, en buenas condiciones, es facil, rapido y comodo comprar por este medio; nunca antes lo habia hecho realmente, los felicito por ser tan responsables, gracias..", "Date": "August 22, 2012"}, {"Title": "Blackberry Curve", "Author": "yankeefan", "ReviewID": "R3TUG9BG25PM95", "Overall": "4.0", "Content": "The quality of the phone is just as advertised. I have not had any problems in the last 3 weeks since I have been using it. The service from the vendor was very good.", "Date": "August 8, 2012"}, {"Title": "Todo Bien.", "Author": "Carlos Cordoba", "ReviewID": "RXGJNMUMVPRUQ", "Overall": "5.0", "Content": "Excelente producto. Fue entregado en el tiempo previsto y funciona perfectamente en Venezuela. Tiene dos semanas de uso y no ha presentado ningùn problema...", "Date": "July 15, 2012"}, {"Title": "Telefono en malas condiciones y usado", "Author": "Jose", "ReviewID": "R2CR3TY2KW9O6V", "Overall": "1.0", "Content": "Compre el teléfono bb 8520, decía que era nuevo, la pantalla no funcionaba, lleve al servicio técnico y me indicaron que era usado", "Date": "June 20, 2012"}, {"Title": "Inconforme", "Author": "Carlos Garcia", "ReviewID": "R31U4AXFS72ZIG", "Overall": "2.0", "Content": "Llego sin la factura y me dio problemas, no me llegaron los auidifonos y no me deja cambiarle el idioma, con razon el precio", "Date": "June 16, 2012"}, {"Title": "very well", "Author": "neonitro", "ReviewID": "R509YWDRYVJPL", "Overall": "4.0", "Content": "Very nice phone: unlocked, delivery shipping OK, new box, the only bad thing is that this model doesn't iclude any leather case neither the memory card. The phone works correctly! battery, software already updated, everything...even when is used in different country: It's working perfectly with Movistar line, Venezuela.", "Date": "June 14, 2012"}, {"Title": "Great Phone!", "Author": "Francisco Dousdebes \"Pancho\"", "ReviewID": "R2EYAZKB79RWSR", "Overall": "5.0", "Content": "This is the 3rd Blackberry phone I buy and all have been great purchases. Top performance, no hassles, no surprises, affordable price.  Seller was professional at delivering the phone right on time (thank you!).  Unlocked phone works well on all my international trips.  Will buy it again (if needed) and from the same seller. Thank You!", "Date": "July 18, 2012"}, {"Title": "WIREOVIA,  ¡¡ EXCELENTE !!", "Author": "Epifanio", "ReviewID": "R3O6JDWVVCKF6A", "Overall": "5.0", "Content": "ESTOY TOTALMENTE SATISFECHO CON WIREOVIA, HAN CUMPLIDO CON EL TIEMPO ESTIPULADO, EL CELL. LLEGO EN PERFECTA CONDICIÓN Y FUNCIONA MUY BIEN EN VENEZUELA Y ADEMAS WIREOVIA NOS ENTREGA UN PEQUEÑO REGALO.", "Date": "January 16, 2012"}, {"Title": "excelente", "Author": "akkend", "ReviewID": "R2HJKZVRR1XGN5", "Overall": "5.0", "Content": "Muy bueno el producto todo salio bien saludos desde venezuela feliz navidad muchas gracias lo empacaron muy bien feliz año nuevo 2012", "Date": "December 19, 2011"}, {"Title": "Not satisfied by the item received", "Author": "IAA", "ReviewID": "R15Q7ROUYGT33B", "Overall": "3.0", "Content": "When I opened the BB cell phone in the back inside part it had sulphate in several places. I have used it and it seems to work ok  but why did it have sulphate inside ? I think it was not new and I had ordered a new cell phone.", "Date": "December 19, 2011"}, {"Title": "my purchase", "Author": "Blackberry 8520", "ReviewID": "R1Z0G8YL2KZVBJ", "Overall": "4.0", "Content": "Every step of the process was perfect and easy.  I received my BB the date they gave me and it works perfect", "Date": "July 20, 2012"}, {"Title": "buen servicio", "Author": "Humberto Jose Cordero \"humberto\"", "ReviewID": "R126VMTSLSAWWZ", "Overall": "5.0", "Content": "bueno el articulo se recibio en muy buen estado se guire haciendo negocios en el futuro con este proveedor  el articlo llego en la fecha indicada", "Date": "June 1, 2012"}, {"Title": "Excelente", "Author": "Aldemar", "ReviewID": "R30JDRKCG3QI5H", "Overall": "5.0", "Content": "Es un muy buen producto el que he adquirido, les recomiendo ya que por la marca es muy bueno y ademas es liviano, es lindo, me gusta mucho", "Date": "October 6, 2011"}, {"Title": "mi opinion", "Author": "lis", "ReviewID": "RBS3E3FG5UOY2", "Overall": "4.0", "Content": "el tlf esta muy bien y funciona aca en vzla bien lo unico es un detalle en la  pantalla 2 manchas muy pequeñas..contenido tlf, cargador de pared, cargado del carro,y bateria..l tlf lo pedi refurbished", "Date": "July 25, 2011"}], "ProductInfo": {"Price": "$88.99", "Features": "Blackberry 8520 Curve Unlocked Phone Black", "Name": "Blackberry 8520 Curve Unlocked Phone with 2 MP Digital Camera, QWERTY Keyboard, Trackpad Navigation, Bluetooth Enabled with Stereo Profile - US Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41DB5rkKx9L._SY300_.jpg", "ProductID": "B004ETBT58"}}