{"Reviews": [{"Title": "The best blackberry", "Author": "Sanyorby", "ReviewID": "R2IOR6FH528WQ2", "Overall": "5.0", "Content": "Blackberry is the most complete, light, great features, outstanding camera, is great for its size, I recommend it with eyes closed.", "Date": "June 30, 2011"}, {"Title": "GREAT DEAL 4 STARTS", "Author": "Rafael J. Lovera", "ReviewID": "R2IBZE5BFE2NXB", "Overall": "5.0", "Content": "I BOUGHT THIS PHONE FOR 202 BUCKS LAST WEEK FROM AMAZON AND NOW IS LISTED AT 290, GREAT TIMING HUH ? WELL LET ME TELL YOU THE PHONE IS REEALLY BRAND NEW, ALL ACCESORIES WERE SEALED, I GIVE IT 5 STARTS !!! ABOUT THE 3G THIS PHONE FROM AMAZON 1,4,8, SO 3G FOR TMOBILE, DIGITEL IN VENEZUELA ... GOOD LUCK !!!", "Date": "June 15, 2011"}, {"Title": "exelente", "Author": "Dany Sanchez", "ReviewID": "R298JLOUOPLDUC", "Overall": "5.0", "Content": "este telefono biene exelente y funciona para venezuela con cualquier operadora lo unico es el precio. deveria ser mas economico", "Date": "August 24, 2011"}, {"Title": "Excelente", "Author": "Jesikintero", "ReviewID": "RM98KV2LC59QN", "Overall": "5.0", "Content": "Excelente producto.... Es tal cual como lo describe el vendedor, super conforme con mi compra! lo recomiendo al cien por ciento...", "Date": "October 27, 2011"}, {"Title": "Perfect backup phone", "Author": "Evgeny Morozov", "ReviewID": "R26I5QW3FE0K7H", "Overall": "4.0", "Content": "If you need to text, call and receive calls - it's perfect. Camera is handy, gives clean pictures. Connection stable, sound good. Other stuff is pretty useless (like office, internet browsers, etc), but it's good to know you have it and in case of necessity (for example if your life depends on whether you can read the ms word document or not) you are safe. Trackpad may freak somebody out, and because of it in my case games are impossible to play to. Maybe my fingers are incompatible with it, who knows. Battery lasts long.Bottom line: nice, reliable, good looking cell phone.", "Date": "January 3, 2014"}, {"Title": "I'll recommend for all my friend and family", "Author": "Evelyn", "ReviewID": "RGVU5C1GBQ2JO", "Overall": "5.0", "Content": "all is fine for me.... the product is good and the amazon services is so good!!I like it..I'll recommend for all my friend and family...", "Date": "March 21, 2013"}, {"Title": "Cell-phone with lots of class.", "Author": "Rudy Barajas", "ReviewID": "RSEHUPBHW64I1", "Overall": "5.0", "Content": "this phone in my opinion is a beauty. its powerful yet compact. I first baught this phone through verizon with a contract. I really liked it except the track ball would get stuck after dust accumulates underneath it. But the 9100 version eliminates that problem resulting in again a phone with lots of class. :)", "Date": "February 24, 2013"}, {"Title": "excelente", "Author": "plozada", "ReviewID": "R1235NJRRVRSRF", "Overall": "5.0", "Content": "compre este teléfono para mi hija, me siento totalmente agradecido, lo recibí liberado completo con todos sus accesarios,100% nuevo de cajita, funciona con la operadora de mil maravillas, gracias", "Date": "May 17, 2012"}, {"Title": "Excelente", "Author": "Rosa", "ReviewID": "RRNZJU8P85R1T", "Overall": "5.0", "Content": "teléfono de buena calidad, excelente compra. muy acertada, llego a Venezuela  a tiempo. sin inconveniente. muy bueno a mi me encanto y buen material", "Date": "March 24, 2012"}, {"Title": "una buena compra", "Author": "Ruthi", "ReviewID": "R1P4Z3FWU1FIRZ", "Overall": "5.0", "Content": "El celular llego a tiempo, el modelo especificado y buen precio.Lo recomiendoEl celular llego a tiempo, el modelo especificado y buen precio.Lo recomiendo", "Date": "February 17, 2012"}, {"Title": "Blackberry Pearl 9100 GSM", "Author": "HERMANAXO", "ReviewID": "R1AD5U3S81C905", "Overall": "5.0", "Content": "levanta 3g para digitel aca en venezuela, excelente, me llego con todos sus accesorios, no me presento problemas de ningun tipo", "Date": "January 13, 2012"}, {"Title": "Everything has been good..!", "Author": "Ronald", "ReviewID": "R1GXFQQWE5TEZK", "Overall": "5.0", "Content": "Everything has been great, i have to test it when i return home and see if it works well with Venezuelan's Mobile Co.", "Date": "January 12, 2012"}, {"Title": "Great Phone", "Author": "Linda De Costa", "ReviewID": "R2AEAIMZFJSQ44", "Overall": "5.0", "Content": "This is a great blackberry phone, functions well, no complaints. Arrived in a very short time. My brother is quite please with his cellphone.", "Date": "December 7, 2011"}, {"Title": "Excelent!", "Author": "Carmen Arelys Mendez", "ReviewID": "RRPW4USI9MHW4", "Overall": "4.0", "Content": "I had other Blackberry Pearl models but none like this one. When I bought it I was afraid that it could be a reburbished phone (I had that experience before, it says new on the product but when I receive it I find out it is refurbished). Not this time! The box was the original and it has all the manuals and complements. This telephone has worked for quite a while with me, never collapsed, is very portable (small), you can have lots of applications working at the same time and is so much better that previous models.The downside is that the battery only last a day. I have to recharge it every day.", "Date": "January 22, 2013"}, {"Title": "all flawless", "Author": "Edwar Castaño", "ReviewID": "R3OTG4MNAW8JZX", "Overall": "5.0", "Content": "The phone is small and practical suits my needsplacing the touch button makes much useoverall a good team", "Date": "November 10, 2012"}, {"Title": "where the band goes 3G", "Author": "francisco", "ReviewID": "R2GT6I1VEPUTT5", "Overall": "5.0", "Content": "I am interested in the phone Blackberry Pearl 9100 but I want to know if the 3g works with the band 2 = 1900mhz", "Date": "June 23, 2012"}, {"Title": "inquietudes", "Author": "josemorales", "ReviewID": "R2UFT8RCXAYY8P", "Overall": "5.0", "Content": "buenas tardes amigo es para saber si el telefono esta desbloqueado y tiene el idioma espanol es para venezuela. gracias", "Date": "August 12, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004PGMAF8"}}