{"Reviews": [{"Title": "5 years ahead of the curve", "Author": "Sam B.", "ReviewID": "R2TPITNNPC421N", "Overall": "4.0", "Content": "Just turned on my new John's Phone today. Really fun practical phone. Definitely a conversation starter, and I do believe this company was onto something.  As Technology becomes inescapable it's nice to have this option.  I now have my I-pad for \"connecting\"  with WiFi and my phone, well...to be a phone.  This is sort of an experiment to see if I can go out in public and not pick up my phone every few seconds..I want to be present in this world..no more texting while driving..no more holding phone at concerts...I can be free..free to look up.  No, I'm not paranoid..but there's nothing to spy with on this phone..no cameras, GPS, social media..I feel anonymous for a change :) Heads up..it will NOT work with all GSM sim cards. In fact, H20 wireless was a no go..but I did use Net10 on the T-mobile network and it works GREAT! Design is cool..a little on the cheap feeling side for a cell phone..but the simplicity and fun make it worth it.", "Date": "December 20, 2013"}], "ProductInfo": {"Price": "$120.00", "Features": "Works Worldwide - The world's most simple unlocked mobile phone has built-in quad band. A quad band mobile phone allows you to use the 4 types of GSM networks: 850, 900, 1800 & 1900 Mhz. This means you can make and receive calls anywhere in the world (except Japan & South Korea). John's phone is compatible with Pre-paid Pay As You Go SIM cards, SIM only contracts, National & International SIM cards. NOTE: Works on all UK networks except for Three (3 network)\nJohn's phone battery is energy-efficient (1200 mAh), as it does not contain any energy-consuming features. The talk time of John's Phone is approx 6 hours and the standby time is more than three weeks.\nohn's Phone has a single ringtone with three volume settings: loud, normal and silent. You can adjust the volume using the button on the left side of the Phone. The vibrate function works for all settings. You can save 10 speed-dial numbers to your John's Phone: one under each number key.\nIn the box are the following: John's Phone, Instruction Manual, Headset, Charging Unit + USB Cable plus a unique accessory - an Address Book & Pen\nNOTE: The supplied charging unit is a European 2 pin plug. This can be used in a USA shaving socket or with a travel adaptor. Alternatively you can use the supplied USB cable & connect to your computer", "Name": "John's Phone. Snow White - The world's simplest mobile phone NEW", "ImgURL": "http://ecx.images-amazon.com/images/I/31HrgCFcCdL._SY300_.jpg", "ProductID": "B004D3OFQK"}}