{"Reviews": [{"Title": "Telefono muy bueno", "Author": "Edgar Vinueza", "ReviewID": "R24259RMVBLBFM", "Overall": "5.0", "Content": "Soy de Ecuador, este celular era para mi hermana, les comento que el telefono funciono perfectamente desde el primer momento. Mi hermana quedo muy a gusto con el color del telefono que es poco comun, el tamaño es adecuado, bastante delgado, muy buenoSaludos", "Date": "June 10, 2011"}, {"Title": "Great Phone", "Author": "S. Green", "ReviewID": "R2RYGTDDXA7MX9", "Overall": "5.0", "Content": "I just received this phone in golden white and I could not be happier. The screen is large, menus are easy to see and navigate through and I love the  widgets for your favorite contacts, facebook and twitter appear on the home screen. It's light weight and most importantly the buttons are nice and large so for those of us that don't have small fingers, its perfect. If you need a unlocked phone for an alternative plan, i.e. Simple Mobile, H20, etc. this phone is perfect. Even my 14 yr. old son who has an HTC Aria said this phone is beautiful!!!!", "Date": "February 10, 2011"}, {"Title": "The BEST cell I have owned!", "Author": "J. Ponce \"MPonce\"", "ReviewID": "R25BGLUN2YCURI", "Overall": "5.0", "Content": "I choose this cell instead a Blackberry curve, and I not regret it!!! I have been using it for 3 months already and I can say it's the best phone I have ever owned!!!!", "Date": "December 28, 2010"}, {"Title": "Dissatisfied", "Author": "Lil bit", "ReviewID": "R2OMPHVBJPFVUR", "Overall": "1.0", "Content": "First of all, I did receive the Nokia C-3 and was very delighted with it. It is a nice phone if you are into looks but that is all. The phone is not difficulty to work but I had difficulty receiving pics & text messaging and using the internet.  I called my wireless services (AT&T;) and was unable to get any help and was directed over to Nokia customer service who definitely could not help you not even with their own products.  Finally, I called customer care with the phone service where I bought the phone.  Of course, they were nice and tried to help me but the phone either was not compatible with my wireless service or the phone was defective.  I am not sure and they were not sure either.  I did send the phone back and is waiting on my refund.  I would not recommend this phone to anyone unless you know for sure your internet service would be compatible with the phone.", "Date": "September 20, 2011"}, {"Title": "The phone has problems. the camara doesnt work.", "Author": "cus", "ReviewID": "R3LXO2Z5LUBEIC", "Overall": "1.0", "Content": "the phone doesnt work the way it was supposed to.... the camara doesnt work, the language settings on the phone doesnt include Spanish .... I bought it for my niece and she doesnt speak speak English. The seller didnt give me an answer", "Date": "July 18, 2011"}, {"Title": "Suckiest Phone Ever", "Author": "Josh", "ReviewID": "R1FY8UL06Y5RDD", "Overall": "1.0", "Content": "Ok.... First off I am a BIG fan of Nokia. I love there phones. They are quick, precise, and easy to use but sturdy too. At least until I got this phone. I have had this phone for 2 days now, and it stopped working on me. The first day after about 20 minutes of using it. It started asking me for prompts to put a pin in to use my sim card. That was fine, but it happened at least 10 times that day. So it got alittle tiring at the least.The second day worked ok. The third day, it started cutting off on me while texting. So I had to turn it back on, and it happened repeatedly. Until it finally died on me. Needless to say, I am going to buy a New E63 Nokia, bc my last phone was that. That phone was GREAT", "Date": "June 27, 2011"}, {"Title": "Hacker's Guide to the C3-00", "Author": "DarthRad", "ReviewID": "R32FXBBW3R2588", "Overall": "4.0", "Content": "Months later, I ask myself, why did I pick this phone and get so wrapped in figuring out how to tweak it until it finally worked like I want?  I guess I just like solving puzzles and taking things apart.Initially, I was mainly looking for a phone with a full QWERTY keyboard, not a touchscreen keyboard, which I hate, that could do Wifi without requiring a data plan with my cellphone carrier (AT&T;).  So many of the full keyboard cellphones nowadays have Wifi, but will not allow you to do Wifi without also having a data subscription.The C3-00 fulfills these requirements.  The biggest downside to this phone is that Nokia has pretty much abandoned all further support for this phone and its old Symbian operating system.  That means no easy way to get the apps you need to do simple things like blocking certain incoming phone numbers.However, because this is a simple, basic, and slightly smart phone (think of it as a C-minus level smartphone), that has been out for some time, the phone is relatively cheap to buy and use, and numerous tweaks are out there posted on the internet that allow you to tweak it.  If you do want a data plan through AT&T; for example, this costs only $10 a month, as the phone uses the older slower GPRS/EDGE  data network.The phone also takes up to a 16Gb micro-SDHC chip to play your music  and store your photos for the 2MB camera (you need the latest firmware, earlier firmware versions only supported 8GB).  It will play MP4s by the way (my son figured this part out).Having said all that, the next thing that has to be said is:  BUYER BEWARE!  There are several DIFFERENT versions of this phone!  I have purchased around 10 of these phones now (one has failed).  Here are the versions I have encountered and what can or needs to  be done to fix them:1.  Regular American/Western standard English QWERTY keyboard.  May come locked or unlocked.  Found on Ebay, AliExpress, etc.  Firmware level highly variable from the  6.-- series on up to 8.70.  RM614  8.71 is the last Nokia firmware update, but there is no American or European version.  The closest you get is the English language Australian/New Zealand/Singapore English QWERTY firmware which works fine.  If you are lucky, you will get one of these with this 8.71 firmware.  Depending on the firmware  level, this type of phone is the closest you can get to having a ready-to-go phone that needs minimal programming/hacking to work properly.2. English QWERTY keyboard with (usually) 8.71 international firmware of unknown type with  non-English characters (Cyrillic?)  for certain of the uppercase keyboard buttons which do NOT correspond to what is on the keyboard.  These phones need to be re-flashed with the English QWERTY 8.71 firmware (see above) to work properly.3. Partial QWERTY keyboard with (usually) 8.71 international firmware of unknown type.  The uppercase keyboard buttons for certain buttons are blank.  These uppercase buttons will generate the same set of non-English characters as type #2.  These phones need re-flashing of the firmware and a replacement full-set English QWERTY keyboard.  As of this writing, these keyboards can be found on Ebay and elsewhere, and there is a Youtube video that shows you how to take your phone apart to replace the keyboard (need a T4 or T5 Torx screwdriver)4. Cyrillic version QWERTY keyboard with same 8.71 international firmware.  Same fixes needed as type #3.5.  AT&T; Go-phone.  These have a dark blue body and silver keyboard.  Comes with 3.63 firmware WITHOUT WIFI!!!  These were sold really cheap for a time by Walmart, and are now often found on Ebay and elsewhere.  Re-flashing the firmware to 8.70, 8.71, whatever, will place a Wifi soft key on this phone, and allow it to seek out and identify nearby Wifi hotspots.  This indicates that these phones do indeed still have the Wifi chip in them.  However, the MAC addresses of these Go-phones have been wiped out and set to ZERO, meaning that the cellphone WILL NOT CONNECT EVER TO ANY WIFI SOURCES!!!  So far, I have not discovered any hacked software out there that will allow you to reflash a MAC address onto the Wifi chip on this cellphone.  So these AT&T; Go-phones have very effectively had their Wifi permanently castrated by Nokia, most likely at the behest of AT&T;, to force users to use an AT&T; data plan.In regards to re-flashing the firmware:1.  Get the cracked Phoenix Software.  Need a good quality micro USB cable to connect to your PC computer.  See Commentary section below for websites where you can download this software and instructions for how to use it.  The original genuine version required a dongle, so you need the cracked version(s).  Phoenix WILL NOT WORK on 64-bit Windows 7!!  It will work on 32-bit Windows XP and Windows 7.  For those of you righteous legal purists, know that Phoenix Software is a now defunct software no longer being sold or supported, and so the cracked version is not defrauding anybody of their rightful profits.2.  Some sites still tell you to download the Navifirm software to get the latest firmware from Nokia.  Well, Nokia shut down their website for the Navifirm software in early-mid 2013, so forget about using Navifirm.  See Commentary section below for best websites currently to get the last firmware version 8.71.Other reviews have already discussed how to get the phone set up properly to send MMS Multimedia text messages.  Go to the Commentary section below for a full update on the details.  One KEY FACT not mentioned by other reviewers so far is that you need to ALSO change the IMEI number with your cellphone carrier in order to get the Multimedia text messaging to work.Also in the Commentary section is a website description of how to get the Wifi to work.Onwards, to the Commentary section ...", "Date": "January 3, 2014"}, {"Title": "Smart phone, easy to use", "Author": "Lawrence E. Butler", "ReviewID": "R2DESLBVQMHX04", "Overall": "5.0", "Content": "My wife fell in love with this phone, which has been used in Finland, Germany and now the US without a hitch.", "Date": "May 9, 2013"}, {"Title": "It serves its purpose.", "Author": "tdm93z28", "ReviewID": "R5584EW882X1R", "Overall": "3.0", "Content": "Nice phone.  Sturdy with all Nokia features.  I love the key stokes. Tight buttons and does not feel cheap at all.  This phone has a nice real to it, looks great, and accepted the sim card for AT&T.;", "Date": "October 21, 2012"}, {"Title": "great phone!", "Author": "angel", "ReviewID": "R2DMNX4MXEOK4C", "Overall": "4.0", "Content": "The cell phone arrived on time and under brand new pkg condition. It is a cute cell phone, google and set up the mothods for pic msg for carrier service, everything works great. Like the wifi and blue tooth, connect my car and browser the website, these function works good! I always support nokia, seems less chance to be hacked. It is a great phone, fit my daily use! Thanks! Great price, cute design...", "Date": "December 10, 2011"}, {"Title": "several problems", "Author": "M. Yasar Yesiltas \"mehmet\"", "ReviewID": "R15P76W6B2U3SG", "Overall": "1.0", "Content": "this phone has several software problems. your messages could be deleted itself or your contact list could be ! i dont like it", "Date": "November 20, 2011"}, {"Title": "HERMOSO", "Author": "JMVF", "ReviewID": "RS20HGQG6P6P0", "Overall": "5.0", "Content": "ES UN TELEFONO REALMENTE BUENO, MUY PRACTICO ME PERMITE ESTAR CONECTADA A MIS REEDES SOCIALES A MI CORREO HABITUAL SIN NECESIDAD DE CONTRATAR SERVICIO DE INTERNET POR CONECTARSE MEDIANTE WI FI CUALQUIER RED HABILITADA, ADEMAS DE TODAS LAS FUNCIONES PROPIAS Y FACILES DE MANEJAR QUE POSEEN LOS TELEFONOS NOKIA, ES UN TELEFONO LIBIANO, SE ADAPTA MUY BIEN A LA MANO, COMODO PARA LLEVAR, EL COLOR ES REALMENTE BONITO, SOBRETODO ORIGINAL...", "Date": "September 6, 2011"}, {"Title": "My Best Phone Ever", "Author": "Roy Jums \"KingRoy\"", "ReviewID": "R2QERMY9AOWIX0", "Overall": "5.0", "Content": "I bought this phone from Amazon's justbuydeal couple of months ago. This phone looks expensive despite its pretty affordable price and performs more than I expected. It has quick Wifi connectivity and great Qwerty keys but most of all 'real long lasting battery life' that lasts more than a week when used moderately.", "Date": "May 29, 2011"}, {"Title": "Great¡", "Author": "Amanda", "ReviewID": "R3BKUBUIGAJ1GG", "Overall": "4.0", "Content": "I only have a week with the product... so far all cool¡nice phone really elegant design, amazing color¡", "Date": "May 17, 2011"}, {"Title": "very good phone, but the software is not actualization", "Author": "Andres Gomez", "ReviewID": "R3U1EO2U3GKQN0", "Overall": "4.0", "Content": "Hello, I'm from venezuelaThe phone is very good, and the price too, but the software not is update, because don't have the option of the Spanish LanguageGreetings.", "Date": "April 2, 2011"}], "ProductInfo": {"Price": "$139.99", "Features": "Nokia C3 is the first of three new messaging devices to break cover today\nIt's also the first Series 40 device to come sporting a full QWERTY keyboard\nNot content with just being a social butterfly the C3 also boasts Wi-Fi connectivity, a two-megapixel camera, 2.4-inch screen\nGSM 850 / 900 / 1800 / 1900 for use with both ATT and T-Mobile here in the US", "Name": "Nokia C3 (C3-00) WHITE Unlocked Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41ysdNy03pL._SY300_.jpg", "ProductID": "B00488I2G4"}}