{"Reviews": [{"Title": "Good model if we still live in 2008!", "Author": "arqrc", "ReviewID": "R3FTHLMH8382US", "Overall": "2.0", "Content": "So im not  a BB fan, therefore Im not current at BB models. I just wanted a nice phone for my GF and when she saw it in this white model she fall in love with it. so we bought it.Now the bad:- This phone is very old!!! the installed OS is not even supported by BlacBerry anymore!!- The keyboard is just a nigthmare to use! 2 letters for each button is impossible to use!- No optical scroll- No support for BB App worldThe only cool thing about this phone is the led flash (altough not good at all) and the white bezel.Not worted the money!!ESPAÑOLResumiendo lo que puse arriba es un telefono sumanmente antiguo, sin saber de blackberry cometi el error de comprarlo basandome solo en la puntuacion sin darme cuenta que es un modelo ya descontinuado al que no se le puede instalar ninguna aplicacion nueva.No vale el dinero que piden por el.", "Date": "May 22, 2011"}, {"Title": "excelente", "Author": "Hiduan", "ReviewID": "R1V30QR6KNCS8F", "Overall": "5.0", "Content": "excelente equipo... todas las funciones trabajan perfectamente, aqui en venezuela agarra las 3 operadoras sin ningun problema... lo recomiendo para todos aquellos que vivan por aca!!!", "Date": "April 9, 2013"}, {"Title": "excelente", "Author": "poppaiva", "ReviewID": "R37B660LGRP77O", "Overall": "5.0", "Content": "Blackberry Pearl 8120 WHT GSM Unlocked Phone with Wi-Fi and 2MP Camera...BlackBerry excelente good goood goood goood good goood", "Date": "November 11, 2011"}, {"Title": "Good Phone", "Author": "Peter Matyko", "ReviewID": "RTXJ3WJMRFMS6", "Overall": "4.0", "Content": "Good phone, works well.  We use it as a phone only.  Keys are a little small (like most newer phones).  The keyboard is hard to figure out if trying to dial a number from words.  Still have not figured out how to translate words to numbers on this keyboard.  But the phone otherwise is good.", "Date": "April 24, 2011"}, {"Title": "Excelente", "Author": "Leidyangel", "ReviewID": "R2XS6FHBQC3CR2", "Overall": "5.0", "Content": "BlackBerry Pearl 8100 Unlocked Phone with Quad-Band GSM,GPRS, EDGE, 1 MP Camera, Camcorder and bluetooth v2.0 compatible--International Version with No Warranty (Black with Silver)", "Date": "February 15, 2011"}, {"Title": "I love blackberry pearl!", "Author": "aryas83", "ReviewID": "R16UDIDT5ZAKO1", "Overall": "5.0", "Content": "I'm just kind of in love with the Blackberry pearl, I got my first one in 2007 and since then broke about 5 of them, in fights and stuff lol :) Or thorwing it at the wall in some situations! But I always ordered another one, so this is the best one I've had so far, I like this cause its a small smart phone, and this one actually has WiFi, Video Recorder and a slot for memory card so I use it to listen to a lot of music as I work out to keep stress away and dont break this one too! :)  So its quite multifunctional and you can still use WiFi without an active SIM card, and plus it's unlocked.So yeah I recommend it, cause I just like this blackberry, the color white is very stylish, and soft to the touch, great fit in your hands, its not wide and big like the curve or iphone, and well I just love 'em!", "Date": "January 8, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nSlim, powerful Blackberry messaging phone with SureType hybrid numeric/QWERTY keypad\n2.0-megapixel camera (with video capture); Bluetooth stereo music streaming; microSD memory expansion\nUp to 4 hours of talk time, up to 360 hours (15 days) of standby time", "Name": "Blackberry Pearl 8120 WHT GSM Unlocked Phone with Wi-Fi and 2MP Camera--U.S. Version with Warranty (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41TnxC0DBSL._SY300_.jpg", "ProductID": "B0049U3XRY"}}