{"Reviews": [{"Title": "Samsung has a winner", "Author": "E. Tam", "ReviewID": "R39D5LGQOPD0CW", "Overall": "5.0", "Content": "I wanted a simple, lightweight Android phone for overseas, and settled in with this phone. Granted, my expectations of this phone was value vs. price. True this phone does not have the latest OS, or the newer 5MP+ cameras, but I only paid $220 for this, so I expect a $220 phone with features. If I wanted the latest feature and OS, I would have spent $400+ easily for an unlocked phoneScreen Quality: 7/10 - It's not an iPhone or HD screen, but it's crisp and clearWeight: 9/10 - Had this in my pants pocket the whole time and barely notice itResponsiveness: 8/10 - No noticeable delay. Had a few times where it took a few seconds for the screen to light up after pushing the power buttonCamera: 7/10 - For a 3MP camera, it's not bad...Call Quality: 8/10 - Was able to hear and the other party could hear just fine. The speakerphone was satisfactory, but wish it could be a little louderBattery Life: 10/10 - Last 22 hours of normal use, over 4 days of standbyBuild: 8/10 - Plastic housing, smooth finish, rounded corners, very easy to handleBecause I was using this as a travel phone, I really didn't use the data or watch YouTube much. The quality was okay, it worked, you could see the video but it's nothing spectacular.If you're looking for a travel phone, this would be perfect; but as a permanent replacement every day use phone, I wouldn't want to use it (I have an HTC EVO, and looking at a 4.3 screen and having to deal with a 3.5 screen was pretty tough)", "Date": "November 15, 2011"}, {"Title": "Great phone for the price", "Author": "Alejandro", "ReviewID": "R24G9P19ZWLS0V", "Overall": "4.0", "Content": "The Galaxy  3 (I5800) is an inexpensive alternative to an iphone. It does the basic things you need and have a great variety of apps in the android market.  However, If you want all the functionalities, you should go for the Samsung Galaxy S (I9000).The phone arrived on time and was OK. The only problem was that it came with a European language installed. I had to go to settings (Locale and Text) and set the English language.", "Date": "February 21, 2011"}, {"Title": "My lovely device", "Author": "Nina \"U.\"", "ReviewID": "R1ZUMF72U6QRYY", "Overall": "5.0", "Content": "I'm really enjoying this phone. I use free android market's app. such as several types of dictionaries, e-readers, books stores, TV news, games, etc.Especially good for me - Skype works very well!! that is important because i haven't a plan but just T-mobile card and also make calls to Europe.Battery life is shorter than I wanted, but having second battery (Replacement Battery for Samsung EB504465VU, SO1S416AS/5-B, EB504465) and charger (USB Dock Battery Charger for Samsung i5800 Galaxy 3) help. Synchronization mails and contacts, and etc. information with google is excellent.", "Date": "April 6, 2011"}, {"Title": "Try something else", "Author": "Primadona", "ReviewID": "RNTQ5A8SAZS6M", "Overall": "1.0", "Content": "I had this phone for 6months and it's dead. The only thing good about it is the battery life. I've heard most people with smartphones complain about battery life. This tends to hold it's charge very well. I don't talk a lot on the phone and I don't text on a daily basis. Also, google syncs well although when you decide to stop syncing, it still does after a while for some reason. I've tried to remove the email account and the only way to do that is to factory reset so i let it be.That said, this phone is slow for a smartphone. And this is my first but as time went on, it got progressively worse. I don't play games and I don't access fb through this. The apps i have are skype and finance tool and i got those when i first got the phone and i rarely use use them. I've used skype on the phone no more than 5 times. The memory isn't much but i got one of those amazonbasics micro sd cards so that isn't a problem.The screen goes black just randomly even though i went to the settings to choose when i want it to go black. If i'm calling a company, by the time i'm done pressing 1 for such and such, it'll be black when i come to choose the next option.I was on it this morning and it died.Charged it but it wouldn't charge. Took battery out and put it back in and it came back on. Charged for a little bit and went out. Died 2hrs later and when i came back it will not charge.It was great as an mp3 player but for the amount of money i paid for this, I was better off getting a regular sandisk player and $20 phone which is what i had prior to this and it worked well and was still working when i got this. Back to that i go.UPDATE: I purchased this phone directly from amazon and NOT through a 3rd party seller and i called them about the warranty info and the customer service person i spoke to did not know the information about the warranty and asked me to call samsung international and ask what branch of samsung int'l is responsible for the warranty. And even when he offered to have me return the phone (after many holds and me getting irate), he couldn't tell me what refund I'll get. For anyone else who purchased through amazon, i found the warranty card and it's through Zeezoo. Their contact info is 1.954.570.3366 or 1.888.485.2355.Update 11/30/12: I called Zezoo and they said to mail the phone in to see if they can fix it. They couldn't fix it so they offered me 3 phone options to chose from for replacement. I chose the galaxy y duos which is a newer phone and unlike this one, this replacement is the US version and received it yesterday. They were professional, courteous and surprisingly very easy to deal with. So I guess the warranty on amazon phones are good. The whole process took about 3weeks to send and receive replacement. Let's see how this new samsung holds up.hope this helped.", "Date": "July 22, 2012"}, {"Title": "Great Phone!!!", "Author": "Mommy2n1 \"Jenn\"", "ReviewID": "R3BG6MFKFOMLSN", "Overall": "5.0", "Content": "This is a great phone for the price.  Android, Apps, Wifi, 3G.  All you can want in a phone.  I have no thad any problems with it at all.", "Date": "August 18, 2011"}, {"Title": "Nice phone but", "Author": "Kurt Straker", "ReviewID": "R3MASKR7O5HWN4", "Overall": "4.0", "Content": "Samsung still has not released the 2.2 Froyo update for the Galaxy 3 despite repeated promises to do so. This means you cannot install apps to the SD card and are limited to just the internal phone memory. There are many sites online that describe how to install the update yourself if you are willing to risk it but Samsung still has not released their official update. Sometimes there is a little difficulty connecting to WiFi, it simply will not get an IP address even if signal strength is excellent. It seems that the update to 2.2 also resolves that issue.Summary: a good phone that could be great whenever the update gets released", "Date": "March 24, 2011"}, {"Title": "Nice little phone!", "Author": "Math Guru \"Kimberly A\"", "ReviewID": "RC5JAJV5VG08R", "Overall": "5.0", "Content": "I am impressed with this little phone!Before I get into the nitty gritty, here is some background about my preferences:  I'm a new smartphone user.  I'm technologically savvy, but not a technological guru.  I like a phone that will fit in my pocket.  I like a phone that doesn't feel like cheap plastic.  I like clear graphics, no-nonsense menus, and speed.  I never owned a touch screen before and was admittedly nervous about abandoning my slider phone, as I do a lot (and I mean a LOT) of texting.  I am a Google fanatic; I use Google to help organize my somewhat chaotic teacher-grad.student-living-far-from-family-with-a-long-distance-boyfriend life.  I did lots of research before buying and watched some YouTube video reviews to see different phones in action.If this sounds like you, you will enjoy this phone as it fit the bill beyond my expectations.Functionality:  As an Android phone, this phone will sync with Google -- your contacts, calendar, etc.  It's all there in one spot and I am amazed at how much I like having all that information handy at the touch of a button.  The touch screen is very reactive, and functions perfectly.  Accessing the menu, the apps, etc. was all very intuitive.  The on-screen keyboard is not large (so fat fingers beware!) but I have dainty girl fingers so it is not an issue for me; texting has been a breeze, especially when using Swype.  I've been playing with this phone pretty hard-core for hours on end over the course of a few days (using WiFi, playing Angry Birds, texting, called folks, added Contacts, etc.) and just saw the battery pop down a teensy bit -- does this thing die?  I'm not saying I want it to, but wow, talk about battery life!Physical:  It's preeeeetttttyyyyyy!!!  It's a very sleek little phone.  It doesn't look cheap.  It's smaller than most smart phones out there, but I was looking for that!  The graphics are beautiful and the sound quality is great.  The case seems pretty solid.  This phone is also very light weight -- almost too light for my tastes, in fact.  In that respect, that's really the only way that it \"feels\" cheap and the only negative I can think of.Price:  You be the judge, but I bought \"used-like new\" from an amazon seller for a phenomenal price (even though the Amazon price wasn't shabby either!).  Moreover, I'm saving more money in the long run by using a monthly plan that doesn't require me to sign a 2-yr. agreement.  If you're on the fence about signing an agreement just to get a phone for 'free' or buying a phone and getting a monthly plan, choose the latter!  If you sign a contract to get a phone, you'll pay 2-3 times the cost of the phone over the course of the agreement.  So be smart....like this phone, ha!Hence, I'm pretty impressed with this little device and think you will be too if you are the same type of consumer I am.  If you're hesitant, there are loads of video reviews on YouTube to show you what it looks like and how it works.  Enjoy!", "Date": "December 1, 2011"}, {"Title": "Great Phone for a great price, Android Rocks!", "Author": "Gino Cabiati", "ReviewID": "R2HGSU1TQLG7MN", "Overall": "4.0", "Content": "Great value for this phone, Android is the sauce! battery life is a little short 5 days in regular use. and the camera could be a little better, but still great phone!", "Date": "March 18, 2011"}, {"Title": "It is not truely unlocked", "Author": "Amulya Girada", "ReviewID": "R3F0JDXX429XYU", "Overall": "1.0", "Content": "So I bought this phone as a gift to my Dad. He takes to India, tried all the possible network providers. Airtel, BSNL, Tata etc.. This being a quad band unlocked phones, it is supposed to work with any of the above providers but it didn't. We took to the local SAMSUNG dealer. He says, this phone is not hardware-unlocked. So now I am stuck in a position where I can't return this product since its in India nor I my dad can use this. No way I could have tested this phone here, because I don't have a valid Indian sim. So I lost my money on this phone.", "Date": "October 23, 2012"}, {"Title": "Good phone", "Author": "Lucio Otavio de O. Junior", "ReviewID": "R3QMD0JI1YJXY2", "Overall": "4.0", "Content": "It seems to be a good phone. I've got mine yesterday, so I'm still getting used to it. It takes some time to learn the basic functions but there's no difficulty at all. Android OS is very good.", "Date": "June 1, 2011"}, {"Title": "Very slow", "Author": "fernando", "ReviewID": "R3PKAJAVV05ABQ", "Overall": "1.0", "Content": "This cell phone is cheap, so the screen quality is regular, and it's very slow doing normal things like browsing, view pictures and applications. I think that the RAM is very low and CPU too.You must use a microSD card, cause internal memory is low too.", "Date": "June 13, 2012"}, {"Title": "Hangs & Locks Up. Warranty Not Honored.", "Author": "SpJoRuss", "ReviewID": "RKP6B7DVY1YDM", "Overall": "1.0", "Content": "I bought this I5800 Galaxy 3 phone at the very end of September 2012. Near the end of December 2012 the phone's screen started freezing up and would not unlock when swiped. The only way to get it to work again was by removing the battery and rebooting. At other times I would find that the screen was totally black and pressing the home button had no effect. Again, the only way to get it to work was to remove the battery and reboot it. At times it locked up in the middle of a call and I would lose the caller. Sometimes after rebooting it would work for several days. Other times it would not and I would have to remove the battery again and again. Somtimes it would not even fully boot up but just hang on the initial boot screen. I did what is called a \"soft reset\" and that did not solve the problem and then a \"hard reset\" which did not help either. I later found out that a number of people had the same problem with this phone. One of the other reviews here speaks of a similar problem.The phone is advertised as \"International Version With Warranty\". I bought this phone through a store selling on Amazon. I contacted the seller and advised him of the problem. He advised me that the return period for his store had ended and I would have to contact Samsung about it. I live in the USA. I called Samsung USA and they checked my IMEI number and told me that the phone's country of origin was Canada and to call Samsung in Canada. I then called Samsung in Canada and advised them of the problem with the phone. They advised me that they would not honor a warranty on this phone. Because-- the phone's country of origin was Canada but had been sold by an unauthorized seller in the USA.I then called Amazon and explained the problem to them. They told me that they would do nothing about it but was sympathetic to the fact that it was advertised \"with warranty\". They would look into these type of advertisements. I re-contacted the seller and he said that Amazon was in charge of the main headings for products.So I have a phone that is defective through no fault of mine. I did a lot of researching and found out a lot of things I did not know about how products are sold in our world today. This type of product is known as a \"Grey Market\" product. A product whose country of origin is different that the one you bought it in. This is not illegal. It can get complicated to figure out but the end result is simple. You will have no warranty for such a product unless there is some special warranty you purchase from the seller. Usually there is no option to even do that. Most of the Unlocked Phones fall under this category of \"Grey Market\" because the sellers can purchase them from another country cheaper and sell them in the USA. So even though they are a large International Company they will not honor a warranty under these conditions. My personal opinion is that this is not right but this is the World that we live in today.One of the other reviewers here that had the similar problem bought the same phone from another seller on Amazon and it was replaced under some type of warranty. Be aware that just because the seller says there is a warranty from the manufacturer does not mean it is so. Only if the phone's country of origin is the same as the buyer's!", "Date": "February 20, 2013"}, {"Title": "Useless", "Author": "Cameron Unverferth \"katsuninken\"", "ReviewID": "RRGG2Y9756OO5", "Overall": "1.0", "Content": "I purchased this phone as a stop gap measure because my previous phone was taken from my luggage at an airport. I was not expecting it to amaze me, but I did at least expect it to work. I suppose I should be thankful that it does, on occasion, successfully make and receive calls, but beyond that the phone generally does not function. Apps cause the phone to crash. Using the web causes the phone to crash. Attempting to use the camera causes the phone to crash to such a degree that you must take the battery out. Texting is extremely difficult with its minuscule keyboard, and, about a third of the time, causes the phone to crash. The phone will alert you to the fact that it is about to crash with two to three vibrating pulses, and will then simply freeze until your force your way out of whatever feature you were using or a message will appear that will read \"[insert process here, such as Camera] Failed.\" I deeply regret paying for this phone, and I would have been better off getting a cheap prepaid phone. I very strongly considered returning it, but I was forced to make the decision between dealing with this unstable device or being without a phone number.", "Date": "June 18, 2013"}, {"Title": "great product", "Author": "I. delgado \"ismael delgado\"", "ReviewID": "R339NKS5YUUDKS", "Overall": "5.0", "Content": "basic phone but it does the job , i bought it for a friend of mine & hes happy it does what is suppose to do.thanx amazon.", "Date": "April 8, 2013"}, {"Title": "Do not purchase", "Author": "Hao Li", "ReviewID": "R2TWB8D4DEBOO1", "Overall": "1.0", "Content": "it is unblocked from a Canadian contract phone. no way to upgrade, no way can change the firmware. It is Android 2.1 and most of currrent apps can only work under Android 2.2", "Date": "March 13, 2013"}, {"Title": "great phone and super helpful seller!", "Author": "Lynne. Kent \"Water baby\"", "ReviewID": "RZ9WD2GUUMOMB", "Overall": "5.0", "Content": "This phone, while not being super fast, gives me all the things I was hoping for in my first android phone. I love the swype feature, the multiple easy access alarms, the colors are clear and crisp and it doesn't take a bad picture. It wasn't too hard to learn although I am sure there is much more I can still learn. The volume seems adequate but being 65, a little more volume could be good. Calls are clear and music sounds good. When I had questions, the seller was very responsive and seemed eager to help. I recommend this phone to anyone that is not is need of the fastest speed but wants a great, reliable phone. I will never change from Samsung.", "Date": "November 17, 2012"}, {"Title": "Hangs - need to constantly pull the battery to regain control", "Author": "Timothy DAuria", "ReviewID": "R2YLVFU6J2MCZS", "Overall": "1.0", "Content": "I purchased this phone for international travel.  Unfortunately, it has been a nightmare - 2nd to worst phone I've ever owned.  The main problem is that the OS is not responsive at all- the phone seems severely underpowered.  When I tried doing a search on Google, it would hang when I clicked on any search results.  It would also hang whenever I tried viewing pictures taken with the phone's camera, requiring me to remove the battery in order to regain control. Don't even get me started with the GPS- on my most recent trip, this phone had me lost the majority of the time since it took too long for it to refresh the screen and pinpoint my location.Overall- the phone would be fantastic had it not been for the poor performance.  Note: I was using the phone with a 32GB micro sd card; perhaps the phone has problems with large-sized cards.  However, the manufacturer specifications say that you can use a 32 GB card.", "Date": "October 13, 2012"}, {"Title": "Poor Battery", "Author": "PG", "ReviewID": "R2MGR8372YPYFJ", "Overall": "1.0", "Content": "I got this for my father for overseas use. It promised to give long battery life. However the phone died on STAND BY mode in less than two days. Touch screen is just mediocre. DO NOT BUY THIS..", "Date": "October 4, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00495YFGC"}}