{"Reviews": [{"Title": "Phone not what is pictured", "Author": "Cute Owl", "ReviewID": "R2LMGXMTFORHFN", "Overall": "2.0", "Content": "Beware:1.)This is not the phone that is pictured here.2.)The phone comes with Vietnamese characters on it.3.)The date doesn't work.4.)The charging plug has poles on it instead of regular prongs.5.)Setting the radio to wake you on alarm doesn't work- it switches away from  loudspeaker and goes back to headphones automatically without you telling it to. No wake up radio alarm!6.)The only good thing is that they allowed me to return it!", "Date": "February 15, 2012"}, {"Title": "It's ok", "Author": "Ren", "ReviewID": "R1DWITXWZ4UQ9C", "Overall": "3.0", "Content": "This was a decent phone while I had it. The phone is a comfortable size and weight, and the keyboard was pleasant to use. However it did have some glitches in the software which would cause it to freeze on occasion or would make the phone restart.", "Date": "September 12, 2013"}, {"Title": "true as advertised", "Author": "Natividad Palangan \"Naty frm CA\"", "ReviewID": "R27JY5MRAVPDIF", "Overall": "5.0", "Content": "this is the best nokie I ordered from amazon. I ordered previously the same model, and it calimed its brfand new. Bt when I got this second nokia, I assume that the first nokia I bought of same model was a second hand. It arrived on time. This store is reliable and I recommend them to other customers", "Date": "August 30, 2013"}, {"Title": "nokiia phone", "Author": "martha giraldo", "ReviewID": "R1LUDBU181ZT2M", "Overall": "5.0", "Content": "very good,very reliable. I am using the phone overseas and so far I have no problems.I recommend it.Just insert thecard and go......", "Date": "November 5, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Nokia X2-01 QWERTY keyboard, Quadband, A2DP, Bluetooth, Unlocked international Version Phone with Warranty (Black/Grey)", "ImgURL": "http://ecx.images-amazon.com/images/I/41pcbBGNfTL._SY300_.jpg", "ProductID": "B004SBEHWE"}}