{"Reviews": [{"Title": "Not a good buy", "Author": "Rebel Lyn \"Rebel Lyn\"", "ReviewID": "RL9KP8QNBVBCH", "Overall": "1.0", "Content": "I bought this as a Christmas present for my 8 year old son, after charging the device and loading music, it worked fine for the first half hour.  After that, it was turning itself off and on even though the battery was full charged.  Device would play a tune then would have errors that that tune couldn't replay.", "Date": "December 27, 2010"}, {"Title": "Cheap plastic crap. Poor resolution for camera and camcorder. Touch screen sucks.", "Author": "TechMom", "ReviewID": "R2BCL4E0HNTLXQ", "Overall": "2.0", "Content": "This thing had a lot of good reviews under different sellers and slightly different product names. We got 2 different Payus Electronics MP4 players for our kids for Christmas and they are both terrible. The main problem is the touch screen on them both, which makes it virtually impossible to do anything. They are made out of cheap plastic casings. The resolution on the video and camera are horrible. Don't waste your money.", "Date": "December 25, 2010"}, {"Title": "Was not wanted I expected", "Author": "D. Britt \"Donnie Raw\"", "ReviewID": "R108UOY6DANB30", "Overall": "1.0", "Content": "This item was not a good item screen did not light up properly (it blinked off and on). This camera was horrible just was not my type of mp3/mp4 player thx but no thx.", "Date": "January 10, 2011"}, {"Title": "disappointed", "Author": "Marie Behm \"marielenab525\"", "ReviewID": "R3MYI59QV3SVSY", "Overall": "1.0", "Content": "I bough this for my daughter for x-mas. the touch screen is slow. it's build with a plastic casing. it looks like a toy. I was surprise about the camera it wasn't bad for a cheap device, the camcorder wasn't bad either my daughter loved it until I went to download music and it didn't turn on anymore it lasted 3 days. still trying to get over the disappointment. you get what you pay for.", "Date": "December 31, 2010"}, {"Title": "not the best but ok", "Author": "anon", "ReviewID": "R29U5FXTW2LBAD", "Overall": "3.0", "Content": "this MP3 player is not the best out there, but it is not bad.however, there are several things that i would like to correct from other peoples, reviews. i read a lot that you have to press extremely hard for the touch screen to work. that is not true, you just have to lightly touch the screen with you finger nail or a pencil or something sharp. another thing that i read that is not true is that you can not organize your own music, that again is also not true. if on the menu you go down to Dir List, you will see a list of your music or files exactly how you put it on.Pro.- you can put in a mini sd card for more memory.- you can listen to music while it is charging.- an indented screen means that the screen will not crack. ( i dropped it from a 3 story building to prove that.- extremely good base (if the MSEQ mode is on)Kaaaans.- the touch screen is not that accurate.- the battery does not last long,- not good sound quality (especially if the volume is high)- can not go that loud.if you are looking for an Mp3 player that has a good battery, good sound quality and good base, and is not expensive, I recommend coby", "Date": "March 24, 2012"}, {"Title": "Love It!", "Author": "DRizzle", "ReviewID": "RXP37S1F23A70", "Overall": "5.0", "Content": "I purchased this MP3 player for my son who already has an IPod Touch and needed something inexpensive to take with him to his dad's house over the weekend.  Let me tell you he absolutely loves it and uses it at home just as much if not more than he does his IPod.  What a great product and value!  Would definately recommend!", "Date": "January 8, 2012"}, {"Title": "Good mp3", "Author": "Karla", "ReviewID": "RTZ44PNHOMJD5", "Overall": "4.0", "Content": "this is a good mp3 I bought two of this because is an excellent option to gift and the price is really good. I recomend this kind of products to give an excellent gift for the people you love in this wonderful christmas season.", "Date": "November 10, 2011"}], "ProductInfo": {"Price": "$34.99", "Features": "2.8\" Touchscreen Control\n2GB Standard - Up to 4GB (Mini SD Memory Slot)\n1.3 MP Digital Camera / Video Recorder and Audio Recorder. Playback on 2.8\" screen and installed speaker, or headphones\nMicrophone for Recording and Speakers for Playback", "Name": "Pyrus Electronics 2GB Touch Screen MP3 /MP4 Player with Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31PRwJa%2BIDL._SY300_.jpg", "ProductID": "B0044NZ1R6"}}