{"Reviews": [{"Title": "This is not unlocked phone", "Author": "sunny", "ReviewID": "R2YGYO31N5867J", "Overall": "3.0", "Content": "I bought this phone in last week. Though it shows unlocked phone.This phone is a att locked one. Seller is not sending unlocked code yet.Its been 5days...not sure will they send it or not.", "Date": "March 21, 2011"}, {"Title": "My first Android device (great choice)", "Author": "Alberto Ballestero", "ReviewID": "RGTCNZK4FYDJJ", "Overall": "4.0", "Content": "I ordered this from abe-123: fast shipping, arrived in perfect conditions. I've been using it for a month now, no problems with it whatsoever. I purchase it to use in Costa Rica (with ICE as carrier). The phone is in fact UNLOCKED, meaning that you can put any SIM card on it and it will work properly, BUT if you want to download apps from the marketplace it won't let you do it since it has AT&T; restrictions on it. What I did was root the device, you will find a lot (and I mean a LOT) of ways to do it in the internet, just read carefully the instructions and follow them up verbatim and you should be able to download any app you would like. Great phone, I highly recommend it.", "Date": "October 21, 2011"}, {"Title": "UNLOCKED, BEAUTIFUL DEVICE!.. GREAT DEAL!", "Author": "Pedro Larez", "ReviewID": "R3VFEKG7F4I3U3", "Overall": "5.0", "Content": "Fast shipping. Excellent condition. Outstanding desing. OS Android 2.2 (Froyo). Accesories included. Unlocked for any GSM operator.. Works perfect abroad.100% recommended.", "Date": "October 14, 2011"}, {"Title": "Refurbished Trash", "Author": "Utopia", "ReviewID": "R1KIMXRYGWGU2P", "Overall": "1.0", "Content": "This phone had so many problem when I bought it refurbished that it was not worth the metal, plastic, and rare earth metals that it was made from.", "Date": "February 14, 2013"}, {"Title": "Best phone I've ever owned", "Author": "Jesus", "ReviewID": "RO94VLIR4NZUQ", "Overall": "5.0", "Content": "What a great phone, by far the most beautiful Galaxy S and with all the power from Samsung. I'm running Android 4 on it, and the only thing I can say is I love it.", "Date": "April 3, 2012"}, {"Title": "Amazing phone!", "Author": "Jose Luis Parcerisa", "ReviewID": "R3VT9585ZJ8FJ", "Overall": "5.0", "Content": "This phone was the start of Samsung dominance in smartphones, beutifull screen, pretty fast and HUGE comunity of supporters to tweak, mod and add features!, only downside is battery life.", "Date": "March 18, 2012"}, {"Title": "good features but battery sucks", "Author": "Marco", "ReviewID": "R3DB7EN476T7GV", "Overall": "3.0", "Content": "I think this phone has some great features like the 4-inch screen, fast processor and a great touchscreen. I personally don't like android that much, but for those who like it it's a good phone. If I had to make the choice again, I wouldn't buy it again, I would buy a phone with windows phone 7 on it or the iphone. Because I'm not really a fan of Android.The battery life of my phone just sucks. Without killing tasks all the time, turning the brightness down and not playing any games it barely makes one day. Usually it lasts around 12-14 hours with normal use. That's just not enough. If I use it a lot, the battery is dead after 3/4 of a day.For people who like android and have an outlet everywhere it's definitely a great phone. If you're not decided whether or not you want an android phone check out windows phone 7 phones.", "Date": "February 15, 2012"}, {"Title": "great phone", "Author": "richard", "ReviewID": "R1FVC07DPXL4IR", "Overall": "5.0", "Content": "i bought this phone for my father for the large screen, the display is beautiful, the phone is fast, call quality is great", "Date": "August 12, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004BPNPGQ"}}