{"Reviews": [{"Title": "Great entry level android phone for metro pcs...", "Author": "Jose", "ReviewID": "R2DBXABH3YLU7D", "Overall": "4.0", "Content": "I've had this phone a few months now and I have to say that I'm pretty impressed with it overall. I'll start with the pros: the quality and features of the phone are awesome for an entry / lower-mid level android phone. The case is aluminum and plastic - not as stylish as the other optimus phones on Verizon, T-Mo, Virgin or Sprint, but it still looks and feels great in your hand. It is identical to the optimus that Cricket carries. The display is bright - pictures, video and apps look great on it. The phone is responsive, with no lag and the touch screen is multi-touch, you can \"pinch\" the screen to zoom in and out of maps. Sound is ok - the call quality is good, and music lacks any real depth to it on speaker, but comes through nice and loud. If you plug in headphones for music, they sound great. Compared to the Huawei Ascend that metro offers - this thing rocks! Couple the fact that this is a cool little phone with metro's unlimited plan, and you have a sure winner. I added this phone to my wife's metro account and they knocked out $5 per line - so now we pay $35 for her line (non-smartphone) and $45 for my line. $80 unlimited text, talk and web on two lines is crazy you couldn't do any of that on the other carriers for anywhere near the price! I don't know how it works here on Amazon, but in store they also sweeten the deal by offering a $50 mail in offer, and a free phone of equal or lesser value. Now the cons: No 3g! Metro does not offer 3g service...period. They have standard 1x data or 4g - this phone unfortunately operates on the 1x data standard even though its capable of 3g and it has a sticker saying this on the backside. That being said though if you have wifi at home or access to wifi readily available you can make do because its pretty zippy on wifi. The \"easy wifi\" software included with the phone actually looks and connects to available wifi. When I'm at a mall or airport I don't worry about data being slow because it looks and connects for me. The only other con is the bloatware that comes installed on the phone - some of it runs constantly and eats up memory even though you don't use it. The only way to get rid of the annoying preinstalled software is to root your phone - and in this you have to be careful. If you get a phone with android 2.2 you can easily root it with Z4root or such, but if you get one with android 2.2.1 out of the box it is a task not for the new to rooting and could leave your phone without service. Overall I would recommend this phone if you are on a budget and can't afford metro's 4g android but want an andriod smartphone. Buy it you won't regret it!", "Date": "April 28, 2011"}, {"Title": "AWESOME!", "Author": "Daniel", "ReviewID": "R2SIWVY2G73YML", "Overall": "5.0", "Content": "Metro PCS has finally came out with the Android phone and let me say this phone is worth getting!. I bought it and I am completely in love with it. It has everything I need and more. The only problem I had was the battery life which was not too long bt with a little changes in the setting that can be fixed. I totally recommend this phone!", "Date": "February 21, 2011"}, {"Title": "The little green men take over MetroPCS", "Author": "hobie woods", "ReviewID": "R16516ST6J6WQW", "Overall": "4.0", "Content": "That's right the little green guy has finally came to the Metro PCS Company. When I think of android I think of loads of fun. Plenty of apps to keep your fingers playful and a few good laughs. We all know the android market is the leading rival for the iphone. If your looking for a phone that can make unlimited calls, text, browser, games, and some of the most helpful apps all for 50 bucks a month? This is the phone for you. Packed with its GPS spoken turn by turn navigation's, its hard to believe that metro released this phone for so cheap in my opinion. Running the 2.2 android you will experience less lag then your 2.1 version. I did experience a few laggy problems with a few apps, but not many at all. The Gps feature was great and very accurate. It was also  nice to have several apps that clued me in on nearby restaurants, movie theaters + show times, different local gas stations with the lowest prices in gas. This phone has it all. The resolution on this phone is just beautiful. Although its screen size is nothing compared to your Evo (sprint), smaller in size texting on the virtual keyboard does take a little time to get used too. With the new swipe texting feature it does make it a little more simple and faster to type out those messages. The touch screen, I found to be very responsive and very durable. All in all I gave this phone a 8 out of 10.", "Date": "February 20, 2011"}, {"Title": "Extremely Disappointed", "Author": "Renee Isaac", "ReviewID": "R3IKM3BQ49SFB9", "Overall": "1.0", "Content": "I was so excited to recieved my phone after not having one for about 2 weeks and when this phone arrived, I have to say it was a sadden feeling to see the condition of it.  The phone looks as if some one run it across the asphalt before sending it out and when I opened the back of the phone to check the battery it was diguishing; dirty, sand, hair and who knows what other things that was caked to the back of the case and the crease of the phone.  I understand that it is a risk when you order things online but this was a horrible experience.", "Date": "February 21, 2013"}, {"Title": "Not Bad for the Price", "Author": "Tru Blu", "ReviewID": "R21B2OHBCCEQT7", "Overall": "3.0", "Content": "Good news first...The phone looks good, it can withstand a few drops, and the apps you can download can kill some free time. Texting is smooth, and the videos and pics are passable for an entry-level phone.Bad news...The battery will drain relatively quickly when you have WiFi on while downloading. Weak call reception can be unbearable in some areas, more so than any other carrier I've had. I bought this phone for $120, and I've seen ads for it for $99, so my expectations would be lower at that price point. One big drawback is that, after five months of use, I can't open the App Market anymore. No more downloading new apps-what a bummer. Another thing to consider is phone insurance- I broke a lesser metro pcs droid a few months before I bought this one, and though I paid insurance monthly, I couldn't get it replaced. I had to fax my ID to them, but the image wasn't clear enough on their end, and to make it worse, I didn't talk to a soul- all I got was an email confirmation that it didn't work.", "Date": "April 18, 2012"}, {"Title": "SO DURABLE!", "Author": "Jeanette", "ReviewID": "R1ZAS710FM5CYI", "Overall": "5.0", "Content": "One day I was getting ready to drive my grandmother somewhere and I went to set some stuff inside the car and set my phone on top (bad idea. I'll never set anything on top of a car again.) and I drove off and it took a good 5 mins before it went FLYING off my car. I was going about 50 mph I think. I went back up the road to get it and the back of it had come off the battery fell out. The piece that holds the sd card in came off and I lost my sd card but my phone was FINE.Damage was minimal. You'd think I had just dropped it. I had a friend who dropped his iphone and it was ruined. I can't even imagine what would have happened to his if it went through what my phone did haha! I really love my phone.The battery life seems better then most of my friends phones.", "Date": "March 25, 2012"}, {"Title": "Dead wrong", "Author": "Ms.Rose", "ReviewID": "RFLQB765WUDY8", "Overall": "1.0", "Content": "I received the phone on time, however the phone is defective. it takes unnecessarily long times to connect to the internet and I know its not my service because my friend has the same. The phone WILL NOT READ THE NEW MEMORY CARD I bought,AND you can clearly why it canr read the memory card because that are looks like ots been damaged and/or tampered with. and I feel like a memory card is essential to phone usage. I cant take pics, save music or ringtones to my phone. When I contacted them about it, I never received a response DONT BUY ANYTHING FROM THEM", "Date": "September 12, 2012"}, {"Title": "Waste of time and money!!! Do not buy!!", "Author": "sierra", "ReviewID": "R1HO8J4ACFJHR5", "Overall": "1.0", "Content": "I was VERY disappointed with this purchase, and will NEVER buy from this seller again!! I bought two phones and they both arrived Damaged, The screens have tons of scratches, the backs are so broken they keep falling off! The overall condtion of the phones is horrible. I do Not recomend this to anyone, Don't waste your money. I will be returning both phones so I can get my money back!!!!", "Date": "October 18, 2013"}, {"Title": "all aboute the battery", "Author": "zouhair hjjij", "ReviewID": "R3HW9B93T78BEV", "Overall": "1.0", "Content": "it take a half day for battrey to die completly . i hate it , i have to keep it always on charge.", "Date": "May 19, 2013"}, {"Title": "the BEST CELLPHONE I'VE OWNED!", "Author": "juby x", "ReviewID": "R38J6387B623XF", "Overall": "5.0", "Content": "the optimus lgms690 model.the most DURABLE CELLPHONE. the perfect size: not too small or too big. amazing sound for mp3s! very good at locating and logging into wifi!!  my ONLY COMPLAINT is that it resets itself every so often ... otherwise, I LOVE THIS NEARLY PERFECT PHONE!! definitely worth the price.originally, mine was double this price!", "Date": "April 13, 2013"}, {"Title": "Iffy at best.", "Author": "iamthewizardking", "ReviewID": "R4KTM9POEXYGO", "Overall": "2.0", "Content": "My Optimus M was, at first, an awesome phone. Speed was a little under average, and I didn't much like only having 150mb memorywise, but other than that it was excellent.Until it went rogue 4 days after receiving it. Locking the screen was risky business, because most of the time, the buttons would light up but the screen wouldn't turn back on. I had to remove and reinsert the battery to get my phone on, and this happened about 10 times a day. Additionally, the phone was constantly at war with my SD card. The SD card is in perfect condition, but the phone would only recognize it 10% of the time. The rest of the time, I got a \"damaged SD card\" notification.I suppose, given that I only paid $40 for it, I should have known something was up. Maybe I got a defective one, who knows?I still love MetroPCS and will stay with them, albeit with a different phone.", "Date": "February 23, 2013"}, {"Title": "Nice but serious connection issues.", "Author": "R. Jefferson \"Cofeluvr\"", "ReviewID": "RR9GXDK4H6OHJ", "Overall": "3.0", "Content": "Not 3G or 4G. It's CDMA. You literally have to be standing under a cell tower to have about 2 bars. No connection inside the house. I have great wifi connection, but no connection makes the internet useless. Drops calls as well. Cute phone. Clear picture and a great camera with flash.", "Date": "March 2, 2014"}, {"Title": "Okay", "Author": "Teniya Y. Collins", "ReviewID": "R1YZWPVVHK02A7", "Overall": "1.0", "Content": "The phone was really nice, but it wasn't through metro Pcs like the ad said. I had to pay $40 to get the phone programed to work for metro pcs that sucked, but my nephew loved it and had a blessed and wonderful Christmas, which made it worth the extra cost.", "Date": "January 17, 2014"}, {"Title": "WATCH OUT!", "Author": "C.J.", "ReviewID": "RE185P730W9YQ", "Overall": "1.0", "Content": "The phone was refurbished & it didn't work. A big waste of time & money. 100% junk. I wouldn't recommend this seller to anyone.", "Date": "January 14, 2014"}, {"Title": "not good", "Author": "Eva Robles", "ReviewID": "R3Q27DYXNKV1AU", "Overall": "2.0", "Content": "it keep on shuting off u can download apps and u cant update the phoneand the memory is not good", "Date": "December 29, 2013"}, {"Title": "nope", "Author": "hazel osborne", "ReviewID": "RHKHAHCTEKA0E", "Overall": "1.0", "Content": "the phone was ok besides the crack they didn't mention on the screen, but the holder in the sim card wasn't,well, holding.", "Date": "November 20, 2013"}, {"Title": "good", "Author": "Momma", "ReviewID": "R2GW0IRJFZ5YJG", "Overall": "3.0", "Content": "Honestly at first it was working good then it started to mess up.. I was texting 1day and I couldnt text anymore it wouldnt let me. Then 2times it turned off on me outa nowhere. Then I was texting and it wouldnt let me text and it kept viberating.. I dont like da fact that I fully charge it and then battery goes low less than a day. But other than dat.. its ok", "Date": "August 27, 2013"}, {"Title": "Great prouduct", "Author": "Derrick", "ReviewID": "R1EFEVPVR8TITH", "Overall": "4.0", "Content": "I rate this product 4 stars because it was a great buy for $69.99 plus 4.49 shipping. It perfomes fast but the wifi drops every so often. Thats the only reason why I rate 4 stars. Other than that Its great product.", "Date": "October 15, 2011"}, {"Title": "good condition", "Author": "tenique7", "ReviewID": "R254FXP7NU7JMQ", "Overall": "5.0", "Content": "This phone came in a reasonable time. And was in very good condition....no scratches. I even got a free phone case.", "Date": "May 6, 2011"}, {"Title": "Definitely a Piece of CRAP! Very little good things about it...", "Author": "Christina", "ReviewID": "R169VL05E5VJX2", "Overall": "1.0", "Content": "You're making a huge mistake if you decide to get this phone. There's more cons than pros.PROS:1. Okay camera quality2. Okay touchscreeen keyboard for my kind of hands.3. Decent size.CONS:1. Lags A LOT. So much I can't even use it!2. Constantly restarts itself.3. Freezes a lot which makes me force close some apps and games.4. Very little space on the phone for good apps.5. The service and signal is terrible.6. Touchscreen sucks! It's not sensitive to touch really. Sometimes it looks to me that I'm not using a touchscreen!I would not recommend this phone to anyone. Except for my enemies. Then again, I'm not THAT evil. It's overall a terrible phone. Worst I've ever had!", "Date": "August 23, 2012"}, {"Title": "i hate this phone", "Author": "heather", "ReviewID": "R30DGVE1UKNWBT", "Overall": "1.0", "Content": "it arrived defective wont chare wont even turn on i would not recommend or buy this phone again  ever again", "Date": "April 18, 2013"}, {"Title": "Great for a first Android.", "Author": "TheGianaJinx", "ReviewID": "R1J16N0FU9EDZ", "Overall": "5.0", "Content": "So, a couple years ago I got this as my first Android, I had no complaints. Now I have had 3 other Androids since. I actually never had any complaints with this phone, except it scratching very easily. That's why I got rid of it in the first place. But with experience with other Androids since having this one, I found this old phone today in my drawer. I realized how heavy it is for such a small phone, and how slow it is compared to my other phones. For a first Android I thought in the beginning this was the best phone ever. I do not recommend getting this phone unless you are upgrading from a non-Android or any phone that is worse than this one.", "Date": "June 23, 2012"}, {"Title": "I'll wait", "Author": "Dawn33713", "ReviewID": "R3DJG82OIF4ILW", "Overall": "3.0", "Content": "A friend brought his to me so I can decide if I want to get one later in the year.  I love Android OS phones but not in a rush to get one since I'm alright with my Blackberry 8130.  He got his from Metro PCS.As expected, it has all of these neat apps.The reasons why I wouldn't buy this phone, in the order of importance to me.1. Does not use universal USB.  I use the same USB cord with my Blackberry 8130, my portable hard drive, and my Sansa  Clips 1G & 2G MP3 players2. Camera has no flash.3. Quality of photos taken.4. Missed calls/texts.  Below is what I copied from another website.\"The way I found out was by reading the story on the iPhone that you cannot have data transmitting while you are on a call on a CDMA network. That means if your phone is syncing your e-mail, you are downloading an app, you are surfing the web or anything else, you will not receive calls. And if you try to use Google voice, the conditional call forwarding does not work if you have data enabled. In other words, you can have a phone that works the way it is supposed to (i.e. receives calls) or a handheld computer that you can surf the web with, get emails, etc. BUT YOU CANNOT HAVE BOTH ON THIS PHONE. If you try to, it will just frustrate the heck out of you because you will miss most of your calls.\"[...]", "Date": "March 21, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "LG Optimus M", "Name": "LG Optimus M", "ImgURL": "http://ecx.images-amazon.com/images/I/414HyeHuqOL._SX300_.jpg", "ProductID": "B004E5IGF8"}}