{"Reviews": [{"Title": "bb 9700", "Author": "paul m.", "ReviewID": "RRD8XEE7JWL2K", "Overall": "4.0", "Content": "ordered the unlocked white blackberry 9700 bold and it took only 2 days to get through prime. pretty stoked on that.  it's a completely brand new phone like stated by the merchant and all that was required of me was to insert my sim card and sync emails and contacts (which was super easy).for those of you who are looking for a definitive answer on whether or not the phone is carrier-branded or not... it is t-mobile branded. i have t-mobile so it kinda worked out nicely for me... but you could always just order another unbranded screw cover.the one real gripe i have about the purchase is the fact that battery that came with the phone, while brand new, won't charge past 50% -- even when left in all night.  i contacted the merchant and they gladly shipped me a new battery without any hassle. hopefully this one hasn't been sitting on the shelf.overall, i'm really happy with the purchase.", "Date": "October 5, 2011"}, {"Title": "Blackberry 9700 BOLD 2 WHITE Unlocked Phone", "Author": "Omar", "ReviewID": "R352CE7BZQGSO7", "Overall": "4.0", "Content": "I don't have comments about the 3G problem because I'm outside USA and where I live there's not much difference between EDGE and 3G (3G is not real).The BB I received is not like the one showed in the picture, Q and A letters are inverted as well W and Z... at the beginning I found it odd but I'm getting used to it. This version has some French applications preinstalled.By now is working pretty well.", "Date": "May 30, 2011"}, {"Title": "so happy!", "Author": "Colleen S", "ReviewID": "RQGHLJ1PG2MAG", "Overall": "5.0", "Content": "I was a bit worried after I read some of the reviews on the phone but i got to tell you mine is perfect! brand new, perfectly white and works great! I even had a tech friend check it out to make sure everything was good with it. I also ordered the charging dock with it - it is a MUST for your Bold!!! very happy with my purchase and the service i've received.", "Date": "February 10, 2012"}, {"Title": "Black Berry bold 2", "Author": "Manuel", "ReviewID": "R1HYSPHHWZM19C", "Overall": "5.0", "Content": "It is very good mobile phone I'll recomend it, the price is not expensive, and it include a full kit", "Date": "February 3, 2012"}, {"Title": "FATALLLLLL!!!!", "Author": "Blackberry 9700", "ReviewID": "RN1YWSNBGLAEP", "Overall": "2.0", "Content": "Compre este celular por el 3G y no funciona a la minima caida se daño la carcaza lo llevo a arreglar y me dicen que es un telefono usado, no nuevo como lo anuncian.", "Date": "August 23, 2011"}, {"Title": "REALLY BAD!", "Author": "Gabriel O", "ReviewID": "R3FUBXD3B574H5", "Overall": "1.0", "Content": "Compre el celular el 16 de octubre, y ya hace 2 dias que lo tengo. Mi primera impresiones que parecia estar en buenas condiciones, luego me percate de que el celular no tiene operadora (ya que en la foto aparece como \"t-mobile\") Luego al encender el movil trate de escribir y note que no funcionaban las teclas i,o,k,l,\"del\" y m. luego de varios intentos si funcionan, pero esto pasa muy amenudo, no estoy satisfecho con mi compra, este vendedor es un estafador!", "Date": "October 31, 2011"}, {"Title": "damaged cell", "Author": "Silvio Brito Rubio", "ReviewID": "R3UVL0GRT2QMI", "Overall": "1.0", "Content": "good day I inform about this purchase order PEACEFUL RESORT I came because the cell is damaged itself off and I do not live in usa so I will rate the lowest it can", "Date": "May 18, 2012"}, {"Title": "Gracias", "Author": "adriana aranguibel", "ReviewID": "R36XH9PK4N5MVL", "Overall": "5.0", "Content": "thank you very much, I'm the product contains, and always buy from Amazon. I always buy from Venezuela, and I am satisfied with all purchases I have made.", "Date": "October 24, 2011"}, {"Title": "GOOD PURCHASE", "Author": "Maryalva \"mari\"", "ReviewID": "RYXKX5P1Q7V2H", "Overall": "4.0", "Content": "at least, I received a new cellphone..since I'm hardly lucky buying cellphones in Amazon. This time I did not get the original charger, just the pc cable conexion..and the battery is not the original one either. On the other hand this cel got 3g in my country Venezuela. Despite these observations I'm satisfied with this purchase, generally speaking, of course, taking into account first that Once I received a Bold 9000 and never ever turned on..so  big failure..I recommend this seller anyways.", "Date": "February 10, 2012"}, {"Title": "a", "Author": "Walter Antonini", "ReviewID": "R2RWXFOXJHGIGJ", "Overall": "2.0", "Content": "I bought this item for the 3g sistem and doesn't work well, later sent a e-mail to them and responded \"we do apologize, but the internet is not guaranteed\" so I have a phone with EDGE olny.", "Date": "February 2, 2011"}, {"Title": "I loved it, it is better than expected, very pleased with what I bought, perfect in every.  graciess!! ... ...", "Author": "Dewis Diaz", "ReviewID": "R2NQUHGXQJ9B3H", "Overall": "5.0", "Content": "I loved it, it is better than expected, very pleased with what I bought, perfect in every.  graciess!! ... ...", "Date": "March 26, 2014"}, {"Title": "Great product", "Author": "Cristina Sempere \"in the middle of the world\"", "ReviewID": "R1NTFMF2MQIHVJ", "Overall": "5.0", "Content": "It worked very well I bought it a long time ago and I loved it! I change to an Iphone but the Blackberry is still working as new!", "Date": "November 1, 2013"}, {"Title": "It is probably the best quality model from Blackberry.", "Author": "AJMV \"AJMV\"", "ReviewID": "R3C9TY8CEU0E7A", "Overall": "5.0", "Content": "Old type, not a smart phone, but we are very happy with it.One of the best RIM cel phones made.It is still expensive for being outdated, but my wife is what she wanted.We expect to use it for at least 2 years.So far no problem with it.", "Date": "August 17, 2013"}, {"Title": "Blackberry 9700 Bold 2 Desbloqueado Blanco Wifi GPS 3MP cámara de teléfono celular", "Author": "VICTOR BLANCO", "ReviewID": "R33I8IP4VB6723", "Overall": "4.0", "Content": "Blackberry 9700 Bold 2 Desbloqueado Blanco Wifi GPS 3MP cámara de teléfono celular Blackberry 9700 Bold 2 Desbloqueado Blanco Wifi GPS 3MP cámara de teléfono celular", "Date": "August 9, 2013"}, {"Title": "not the products offered", "Author": "Masiel Arevalo \"bukyccs\"", "ReviewID": "R2OJELLD4AI5VR", "Overall": "1.0", "Content": "cometarle good morning is to buy the phone that you are offering and the photos appear all white accessories are like the phone, but it is not true, is a lie because the only thing that is white is the phone for that reason I feel cheated because they offer something that is not true and buy the white phone that that wanted all white accessories like the phone, and I really am very upset that these misleading people with false publication .. . that bad for the image of your product is a product and when it turns out that is another .... and as you tell I feel cheated and very unhappy with the purchase .. and I would like to solve this probles thank you very much and I'll be waiting for your answers ...", "Date": "June 28, 2013"}, {"Title": "Defective product", "Author": "Sakeem L.", "ReviewID": "R39KC2M41IEX1E", "Overall": "3.0", "Content": "I love blackberry cell phones...so when I got this phone I was excited.  It was everything that I hoped it would be until I tried to text and the 5/D sticks on the key board. (How does this happen) SMH... This Phone was suppose to be a new phone however the 5/D on the keyboard sticks.  I always have to go back to hit the D/5 again because it would be missing from spelling a word properly.  Not happy with that at all about the phone but I'm  dealing with it for the time being only because the rest of the phone works great. And I have all my settings the way I like them and all my contacts are in place.  If you know when dealing with cell phones how important it is to have all of your contacts in place when switching to a new cell phone.", "Date": "June 13, 2013"}, {"Title": "very bad", "Author": "AURA RIVAS", "ReviewID": "R3RKFVM458F28V", "Overall": "1.0", "Content": "very upset because the product only worked for a month because I live in Venezuela could not do anything and this cellphone is very slow", "Date": "May 27, 2013"}, {"Title": "nice phone", "Author": "vinita barnier", "ReviewID": "R3EIRYY7A34VPO", "Overall": "3.0", "Content": "i was very happy when i got it but now it is already starting to give me problems the screen is starting to switch off for a few seconds and then it comes back since i am in saint martin dont know what to do but i shall not buy again from this seller", "Date": "March 31, 2013"}, {"Title": "FINE", "Author": "KOKY", "ReviewID": "R20ID9HVTGQK0Y", "Overall": "5.0", "Content": "UN PRODUCTO DE ALTA CALIDADMUY BUENOESTOY SATISFECHOCON LA MERCANCIARECOMENDADOENVIO RAPIDOY TRANSPORTEBIENBIENBIEN", "Date": "March 28, 2013"}, {"Title": "EXCELENTE", "Author": "Leidyangel", "ReviewID": "R3SIMU191ILGUU", "Overall": "5.0", "Content": "Todo muy bien. Me gusto... Fue lo que pedi... llego a tiempo... Excelente, recomendando 100%...Saludos desde Valencia - Venezuela...", "Date": "February 14, 2013"}, {"Title": "total loss", "Author": "karen", "ReviewID": "R39FG3KB6GHDRG", "Overall": "1.0", "Content": "I ask for a new product and sent me a refurbished, a completly nighmare, they stolen me, and besides that sent me another color.", "Date": "February 2, 2013"}, {"Title": "excelente producto", "Author": "Yureima Freites", "ReviewID": "RJH153YZJQT5L", "Overall": "5.0", "Content": "Excelente producto,  lo recibi sin problemas,  en el tiempo estimado y sin ningun detalle. Estoy conforme con la compra realizada... gracias!!!!", "Date": "January 21, 2013"}, {"Title": "false advertisment", "Author": "Trudy Williams", "ReviewID": "R2MWIP94PSWPLF", "Overall": "1.0", "Content": "This phone was never new. good thing i got it sold so it didn't fall apart on me. disappointed much?", "Date": "January 7, 2013"}, {"Title": "muy bueno", "Author": "johan gil", "ReviewID": "R21RVZEGTSDH35", "Overall": "4.0", "Content": "fue muy buena la rapidez en la que me mandaron mi compra los felicito y espero siempre sean asi con todas mis compras futuras", "Date": "December 29, 2012"}, {"Title": "BUENO", "Author": "richard lopez", "ReviewID": "R1QXZT6VCTSBKL", "Overall": "5.0", "Content": "me parecen buenos . Estoy conforme con el producto. Ya otras veces he comprado esta marca y todo esta bien", "Date": "December 29, 2012"}, {"Title": "Blackberry suck!", "Author": "Sonia Carrelli", "ReviewID": "R3CDNXDJ4EOSG3", "Overall": "1.0", "Content": "Very difficult phone to operate! After switching to the iPhone, I realized how complicated & unnecessary the blackberry is,, no need,,, I ended up smashing this phone to pieces!  Life is complicated enough, why to have a gadget you use everyday that is not user friendly?  Blackberry sucks!!!!!", "Date": "December 27, 2012"}, {"Title": "blackberry 9700", "Author": "patricia ochoa", "ReviewID": "R30VYP4SICWQXH", "Overall": "5.0", "Content": "all excellent, this is just what I was looking for and arrived sooner than expected, I recommend a 100 percent", "Date": "December 5, 2012"}, {"Title": "great buy", "Author": "Wladimir J. Duque \"venezuelan hostage\"", "ReviewID": "RL2CBA8RCAG1F", "Overall": "5.0", "Content": "very good, came just in time, as described, really a great buy, very good, came just in time, as described, really a great buy,", "Date": "November 30, 2012"}, {"Title": "excelent", "Author": "gerardo colmenarez", "ReviewID": "R2X0ZC7QQOVHMT", "Overall": "5.0", "Content": "Muy bueno entrega inmediata excelente muy calificado confiable goodVery good yes si equipo intacto buena atencion entrega inmediata y precisa", "Date": "October 21, 2012"}, {"Title": "Decent Phone", "Author": "Oral S. Levy", "ReviewID": "R10Z6UGUTUMDBR", "Overall": "3.0", "Content": "This is a decent phone.  Just wahat I expected from Blackberry.  My only disappointment, reason for giving it 3 stars, was due to the missing accessories", "Date": "September 28, 2012"}, {"Title": "probably refurbished", "Author": "Danielle", "ReviewID": "RAB9DA6F2QKLF", "Overall": "2.0", "Content": "though the phone came in what looked like perfect condition, my camera stopped working after one week and the phone itself was sticking a lot. i did get a complete refund though", "Date": "August 22, 2012"}, {"Title": "didint come in white", "Author": "GoldenRetriever", "ReviewID": "R1XSOUYWLT8I6L", "Overall": "2.0", "Content": "the color i ordered it in was white the phone is int white  every thing else states the phone is white but it isint i want to return this phone for a same model but this time acutally white.im verry pissed and disappointed with this product but i really need it i was going to take it with me since i was going back to my homeland but now i guess ill have to let one of my friends send it through an agency im leaving already good thing my friend made me open it before packing it was a waste of time because i didn't get what i wanted and that's what i paid for", "Date": "July 18, 2012"}, {"Title": "refurbished", "Author": "Fabio Gomez Navas", "ReviewID": "R2EBAHF6ZM7GY2", "Overall": "1.0", "Content": "this cell phone is refurbished, not new as you told on the page, the phone case has engraved t-mobile, but the logos are from vodafone, the security seals were not original but placed from vendor, in one word.... very dissapointed.", "Date": "June 15, 2012"}, {"Title": "Muy buen vendedor muy contento", "Author": "Jesus", "ReviewID": "R16VSVC0XIB8DT", "Overall": "5.0", "Content": "excelente vendedor muy complacido de haber realizado la compra con el todo fue a tiempo y sin demoras buenas dias....", "Date": "June 12, 2012"}, {"Title": "phone is not good", "Author": "lance", "ReviewID": "RGDJ468450B5M", "Overall": "1.0", "Content": "I bought two of these phones, the first week I notices the batteries were not charging and now I am being told that the circuit board is bad and they told me that I was getting NEW BLACKBERRY 9700 PHONES. How can they be new and in less than 3 months the circuit board gone bad the phone is not coming on, no light no nothing. note the only reason why I rated it one is because i had to.", "Date": "March 22, 2012"}, {"Title": "good, but...", "Author": "hann", "ReviewID": "R308BNQGBEE6G", "Overall": "4.0", "Content": "The phone is great, delivery fast, however we noticed upon opening that the battery had wear and tear and was not in original packaging. It was obviously second hand. Upon reporting this the company advised they could offer a credit to cover the cost of a battery as they do not stock batteries, however when I provided the cost of an 'official Blackberry battery' as advertised on the Blackberry website (approx $70), I was then told they would be sending me a battery. Yet to see if the replacement battery is in fact new or a legitimate Blackberry brand one. Credit to them for responding to my complaint, but it all seemed a little strange.", "Date": "February 20, 2012"}, {"Title": "exellent but not incluistes leather lining (forro de cuero)", "Author": "williams", "ReviewID": "R2MQ06WYL9R9BX", "Overall": "5.0", "Content": "GOT THE PHONE WITH SUCCESS, BUT NOT put leather lining agree with your phone's specification includes leather lining and you placed, did not fulfill part of the agreement product Product Image Blackberry 9700 Bold 2 Unlocked White GPS Wifi 3mp Camera Cell Phone (New)", "Date": "February 17, 2012"}, {"Title": "so far so good.!", "Author": "luis", "ReviewID": "R2LCLESV8IUOYP", "Overall": "4.0", "Content": "i just got the pohne about 3 days ago ( due to i live in venezuela and i sent it to a adress where later they sent it to here). thanks to send it fast, the the only thing i can say is that i think the earphones are not the original ones becuase they dont sound pretty good. also, i was expecting to recieve a white phone cover, and you guys sent a black one. the rest is pretty good.", "Date": "December 15, 2011"}, {"Title": "UNHAPPY", "Author": "Annia A. Sobers", "ReviewID": "RWA1JHH9BZ6VA", "Overall": "1.0", "Content": "i purchased a Blackberry Bold 2 unlocked white, when i received the device it was so beautiful then I used it for a week the device screen started blanking in and out, then the phone would not hold any charge then the camera icon would select so i took the phone to get fix as it was a software issue then the 4days the phone had a apps error then and the device would not work..I emailed WIREOVIA numerous times,we came to an agreement to send me out a battery and if the phone anymore issues that can be fix i will pay for them,with all those issues i did pay for each error the device had i spent over $500. in getting this device to work where as this device only cost $319. iIemailed them to return the devic as the phone technichian informed me the device was missing alot of components that bberries come with which could be the reason for all the faults it is having he informed me to contact the seller and return the devive I tried this but they informed me they cannot return the device.........I work for SPRINT whenever a customer calls us within the return window and they call back we honor that customers request,due to good customer satisfaction where that customer understands it is a one time courtesy exchange", "Date": "December 8, 2011"}, {"Title": "BAD SERVICE", "Author": "Antonio", "ReviewID": "R1RWF782BRCFTU", "Overall": "1.0", "Content": "The phone came defective, and keys are already used. Send the phone to repair and the technician said the cell was used. I will not buy more for this provider Blackberry 9700 Bold 2 Unlocked White GPS Wifi 3mp Camera", "Date": "November 23, 2011"}, {"Title": "NO MICROSD CARD!!!!!!", "Author": "Sanique", "ReviewID": "R33J5SWB4Y31ZP", "Overall": "1.0", "Content": "I bought this phone with my friend's Amazon account, overall this phone has a really good quality and elegant outlook;HOWEVER, i did not notice until I attempted to transfer some songs from my computer to the phone.. there is no microSD memory card in the phone!! No description is written on the page of Amazon.com about this, and worse is that the box of the phone actually tells you there is microSD card included with this phone.BlackBerry Bold2 9700, is a good phone, but DO NOT BUY from this seller!!", "Date": "November 18, 2011"}, {"Title": "Gift", "Author": "drivera060", "ReviewID": "R1CM3KML5KEATF", "Overall": "5.0", "Content": "Eventhough it was a gift for a friend, my friend told me that it has been one of the best BB he has ever had.", "Date": "September 13, 2011"}, {"Title": "Recubi el  priductio en  mal estado  lo devolvi al vendedor y aun no melo ha hjecho  llegar", "Author": "Mary  Ruiz", "ReviewID": "R2DYL4II1P5B76", "Overall": "1.0", "Content": "necesito el reintegro del dinero  por la compra de este  articulo ya  h e esperado  mucho  aunado al gasto de  emvio que tuve  que hacer para  devolverlo alñ  vendedor  nadie me  da  respuesta", "Date": "April 28, 2012"}, {"Title": "really too bad", "Author": "jhan", "ReviewID": "R35KA539KDSM5T", "Overall": "1.0", "Content": "Hi, this is to inform you that my blackberry bold white 2 9700 has caused me problems because the 10 days of use I put on the screen is blank and I said it was the screen, which had uncovered the cellular and I was not really new, I think the seller is a scammer takes advantage of the means to rip people off, knowing that there are many people who buy from outside your country, this is a dash for the Amazon staff should take matters into as soon as said by crook. Thank you very much in advance and hope to receive a response.Blackberry 9700 Bold 2 Unlocked White GPS Wifi 3mp Camera Cell Phone", "Date": "February 17, 2012"}, {"Title": "Just as pictured", "Author": "Elizabeth Vazquez \"fashionistaa\"", "ReviewID": "R369QRZS8NGAJ", "Overall": "5.0", "Content": "I received the phone super fast . The packaging was great , well secured . I was alittle bit worried about purchasing this phone due to the reviews . I am so glad I did purchase it , I am in love with the phone . There was no memory card or headphones tho .. Which is fine with me not a deal breaker . Oh, and it is tmobile branded in case anyone was wondering . Great buy I highly reccommed this phone from this seller", "Date": "November 30, 2011"}, {"Title": "DO NOT BUY", "Author": "Mario", "ReviewID": "R12YFZT871J8LA", "Overall": "1.0", "Content": "My first impression when i opened the box is that the cell phone cover was not exactly white, it was White-Bone colored like if it was used for some time! Even the back cover!Another thing is that in the box says all the accesories inside which were supposed to include the carrying case, battery charger, USB cable, Stereo headset, microSD card. But the stereo headset, microSD card and carrying case WERE NOT IN THE BOX!These were taken out of the box before shipping", "Date": "November 2, 2011"}, {"Title": "bad 'tems", "Author": "sercan", "ReviewID": "R2B54QR4QLFFFM", "Overall": "1.0", "Content": "my 'tem 's d'fferent to org'nal. for example your write 3mp my item is 2mp.Im not happy this shopping.And ' didnt send back.Because Im go'ng my country three days later.how to help me?", "Date": "September 22, 2011"}, {"Title": "telefono repotenciado / repowered phone (used)", "Author": "Maria Del Pilar Briceño", "ReviewID": "R1KDLA0V8WT04G", "Overall": "2.0", "Content": "el telefono funciona, no dire lo contrario, pero me molesta que me hallan vendido como telefono NUEVO uno  USADO y REPOTENCIADO. quiero una garantia del equipo por que para eso yo pague por algo nuevo, me engañaron.the phone works, I will not say otherwise, but it bothers me that my phone are sold as USED and repowered NEW one. I want a guarantee that team for that I pay for something new, I cheated", "Date": "May 28, 2013"}, {"Title": "Equipos Dañados...", "Author": "Orlando Zambrano", "ReviewID": "R3AT78O6NL2RC3", "Overall": "1.0", "Content": "El equipo celular que compre llego a mis manos totalmente dañado, con piezas cambiadas, y al parecer reparado, no concordaba con la clasificación de nuevo para nada!", "Date": "January 29, 2012"}, {"Title": "Excelente", "Author": "Muy bueno", "ReviewID": "R1VDP7CTWCYEQK", "Overall": "5.0", "Content": "la entrega fue rapida y muy confiable... ahora esperando que me manden el producto de miami a venezuela, pero esa es otra historia", "Date": "October 3, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 1900 / 2100 Mhz", "Name": "BlackBerry Bold 9700 White WiFi Unlocked GSM QuadBand 3G Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/51lLS%2BojIRL._SX300_.jpg", "ProductID": "B00478P1EQ"}}