{"Reviews": [{"Title": "pleasantly surprised!", "Author": "Susan Harris", "ReviewID": "R1IC7JPVMO5XHH", "Overall": "4.0", "Content": "I got this as a transitional phone to get away from the ridiculous contracts and tyranny of the big names.  I bought it just because it was on sale and it got decent reviews.  I had no expectations other than getting away from my contract provider. I have had several Androids and for me having a fabulous laptop at my disposal 24/7, I never really got into the in-depth advantages of the android phone. A few apps here and there but nothing really to justify the expense.  I am not a big voice user and rely on my phone mostly for GPS and checking mail.  This little phone is so easy to set up!  It is not touch so that is a little adjustment.  The keyboard is miniscule so that has to be figured into the equation.I would never say this a supreme texting phone but the keyboard works and honestly for the investment here....its a WOW....$40 a month and I'm over and out...no add-ons, no hidden charges and for the first time I am able to use my cell phone in my own bedroom ....I was always returning phones becsause of this never knowing it was not the phone but the carrier!  so here it is...yes you can have contract quality, decent customer service and lots of extras and pay by the month. Its true!  End the tyranny!  I have a Zune, I have a Lumix, I have a Toshiba Satellite....I do not need all these features in a cell phone....so it all works for me...really well....", "Date": "January 7, 2011"}, {"Title": "Good Buy!", "Author": "Glenji", "ReviewID": "R1LU2UQICPG9K1", "Overall": "4.0", "Content": "This is a strong sturdy phone that will keep me busy texting and calling all of my friends! Great all around phone. Camera could use some improvement!", "Date": "December 25, 2010"}, {"Title": "Great phone for the money", "Author": "Dave Suppes \"Dave\"", "ReviewID": "R223XSYZE5W6X1", "Overall": "4.0", "Content": "I've owned this phone for about 10 months now.  It's not billed as a 3G phone, but it is in fact 3G CDMA.  The Opera mini browser is OK for waiting rooms, waiting in line at the grocery store or updating facebook at work, but don't expect WiFi speed. Texting on the small keyboard is not that bad with a little practice.  It also has decent email capabilities, and the free google maps app is pretty cool.  For $25 per month for 300 minutes of talk and unlimited text, web & email, it's a great deal.", "Date": "May 23, 2011"}, {"Title": "Decent little phone", "Author": "John C", "ReviewID": "RKTCDFBTL1OKQ", "Overall": "4.0", "Content": "Like others, this phone was purchased to get out from under the hefty contracts from other service providers.People keep asking me \"Is that a BlackBerry?\" This was purchased for me as a gift so I didn't research the product beforehand. Since then I have found that it is made by BlackBerry, although I imagine it's a very stripped-down model. By the way, this was bought at Target recently on clearance for less than $20.00, because they're close-outs for new models.Like I said, I didn't research the phone, although I'd seen them in the store before they were put on the clearance shelf. At that time, I believe they retailed for around $90.00. I went with the $25 Virgin Mobile plan since we text more than call, but may change later. The plans themselves are very straight-forward and are a bargain.The phone itself is quite a bit superior to my old U.S. Cellular LG flip phone. I've had it for about (3) years and was actually my first to come equipped with a camera (you can see how much multi-tasking phones mean to me). It was pretty beat up, but reliable.The Kyocera psuedo-BlackBerry phone is decent in most respects. Since I never had an iPhone (that kind of defeats the purpose if you're trying to save some money), I never had a phone with a touch-screen, multiple video capabilities, MP3 player, bbq grill, separate bathing facilities, etc. and so didn't miss them. The trade-off are the microscopic keys, that are great if you're a Capuchin Monkey or Pygmy Marmoset.Having actual sub-atomic sized typewriter-type keys are a bonus for me, because my old phone only had the style like you have on home land lines (ABC is one key, CDE is one key and so on). I used to have to press the keys on my LG phone two or three times until I got to the character I wanted. It was a pain to say the least.There are some decent features on the Loft, web surfing, various tools, Bluetooth, etc. that are pretty standard. My old phone could go online for an extra fee, so I never used it. One item I want to try is the GPS. You can use it for only $1.00/24 hours or $5.00/month. Since I've only had the phone a week, I haven't tried it out yet. Yes, there are a couple of things I liked about my old LG phone, mainly that it wasn't a brick by comparison, but you win some/you lose some.Another trade-off you have to deal with is that since you're doing a 'pay-as-you-go' plan with this phone through Virgin, in order to open more of the phones features, be willing to shell out extra cash. The phone works fine without the additional cost of the other apps, so I do recommend it for the budget conscious out there.", "Date": "February 23, 2011"}, {"Title": "Great Average Phone", "Author": "Aubrey", "ReviewID": "R2JEY8DEELWOPF", "Overall": "5.0", "Content": "The phone is a great phone. It was hard coming from an Android to this phone, but If all you do is text and call, this phone is perfect. I've dropped the phone 100000 times and it's still perfect, even accidentally left it out in the rain, and after it dried out, it was perfect. I even bought my mom the same phone. BUT if you're looking for a phone with apps and great internet speed, this isnt your phone. The only thing I dont like, is the keyboard tends to make a \"CLICK\" sound every button your press. But if you can deal with this, then it's all good!", "Date": "September 28, 2011"}, {"Title": "Good enough for most people", "Author": "George H. Trudeau", "ReviewID": "R1D3C5QKUFJEBS", "Overall": "4.0", "Content": "If you're a super-texter, want to see every web site, like to charge your phone every two weeks, or are looking to photograph your wedding, then this phone is a pass. It is not an iPhone or BlackBerry.Things it does well:- Make calls. It is about the loudest phone I've ever owned.- Voice dial. Sure, it's got it's moments when you say \"Call Mom,\" and it says \"Calling Swedish Embassy,\" but mostly it gets it right.- Google Maps. See where you are, get directions to where you want to go. It is not a replacement for a car type GPS, but it's a nice feature. (you can get turn-by-turn GPS for $1/24 hours or $5/month)- Texting. I send about 3 texts a month and it's much better than all the 10 key phones I've owned. It also groups your texts into conversations like gmail.OK stuff:- Web browsing. Here you've got a split personality, though. Some sites work great on the built in WAP browser, and others work great on the downloadable Opera browser.- Battery life. If you surf the web all day, you're not going to do it without recharging. If you occasionally send a text, check the weather, and generally let it sit waiting for calls, the battery lasts about 3-4 days.- Customer service. I had a couple problems getting started and porting in my number. Hold times for a real person were under 5 minutes every time I called -- you can quickly get to a person by saying \"English\", \"Troubleshooting,\" then \"Agent.\"- email. The built in email client can handle 1 each of Yahoo, AOL, MSN/Hotmail, GMail, and POP accounts. It beeps when you get mail, but if you don't hear the beep, there is no indication on the phone's idle screen. You have to start the mail program to check. It also scrolls annoyingly slow on long emails, and the volume buttons which scroll by page in most applications, do nothing.Maybe another phone:- Camera. The 1.3 Megapixel camera leaves much to be desired. (undocumented: the volume buttons zoom the camera in and out)- Video. It can't take video with the camera, you can't watch video (YouTube, etc.) on the web- Contact Vault. A $1 per month service that's supposed to backup your contacts online (something that my old T-Mobile prepaid did for free). It doesn't work on the Loft even though it is preloaded on the phone.I paid $69 and I think it was worth that price.Afterthought: after reading other reviews, I wonder if there are a couple software versions kicking around out there. Mine has never locked up. Never.", "Date": "March 3, 2011"}, {"Title": "A decent phone for everyday use", "Author": "Cetaphilia", "ReviewID": "R3MCAPR1VFIFF4", "Overall": "4.0", "Content": "this is my first cell phone that i bought myself. over the few months that i've had it, i wud say its a solid phone to buy given its price. the phone build is a sturdy one piece construction so its sure to take the blows and still work. reception is equal to that of other virgin mobile phones. User interface is very similar to other Kyocera phones which is very easy to understand. i only have 3 complaints:1. the keyboard is very small and stiff. given the phone's over all size and layout, i can forgive the keyboard size but the buttons are too stiff. when i tried the model in stores, idk what they did but the buttons were much more easy to press. this one will take some getting used to with the stiff annoying buttons2. the phone doesn't automatically split long text messages into 2 messages. so on other phones, when u've exceeded the character limit per text, the phone automatically lets u keep typing and just sends 2 txt at one time. on this phone, once u've reached the limit, ur done. it won't allow u to type any further. u have to send the message, go back to the inbox and press reply and continue. this can get very annoying.3. the speed at which the phone operates is kind of lagging. given its price, this is acceptable but going thru all the menus to send long txts gets annoying when u have to wait a bit in between each one.i got this phone for the full price of $60. a week later, the LG rumor 2 was on sale for $50. i got buyer's remorse :(if you can get the LG rumor 2 for around the same prices as this one, get that one, its everything that this phone is plus it doesnt have the 3 inconveniences as listed above that comes with the loft.other than that, its a definate buy for any easy going user who wants a decent phone that works without getting a contract or breaking the bank for the blackberry", "Date": "January 31, 2011"}, {"Title": "Good basic phone", "Author": "Vicki", "ReviewID": "R3STRB12FQY60P", "Overall": "4.0", "Content": "This phone is good if you want a basic phone. I am not really into smart phones or being able to listen to music on my cell phone. I just want a phone that I can talk, text, and check my facebook on, and this phone is great for all three. The keys are a bit small, so if you have huge fingers then you should avoid buying this phone. If you are expecting outrageous features, then you should go for a more expensive phone. I have had this phone for awhile. I have dropped it more times than I can count, and it has not given me any problems. All in all, this is a reliable phone and is worth buying.", "Date": "October 2, 2011"}, {"Title": "Great phone!", "Author": "Bevmh", "ReviewID": "R2RVWEDTUFGZF8", "Overall": "5.0", "Content": "I order this phone for my 14 years old son. He'd prefer a blackberry and I prefer him to have a job. This was the next best thing. The service works well we were able to get an affordable plan and he LOVES THE PHONE!!", "Date": "September 18, 2011"}, {"Title": "Good phone for the price", "Author": "iluv2befit", "ReviewID": "R6CKQYSQK4F7X", "Overall": "4.0", "Content": "I had this phone just before I got the LG Optimus. The phone has some great features for being prepaid and from Kyocera. It's the best Kyocera phone I had. It does the Virgin Mobile Navigator built in which works very well. The camera on this phone actually takes decent pictures- better than my optimus does. They are very clear for a 1.3 megapixel camera.  One of the themes on the phone is forest green which is also a nice change for the Virgin MObile phones since they usually come in red or black for the background color. The keyboard on this phone is cramped and takes some getting used to. After about a week of typing on it regularly- it got a lot easier and I have pretty big hands. If you want a nice reliable phone with a few bells and whistles- give this one a try! Just as a side note- this phone does not support video at all. So no you tube or anything like that.", "Date": "September 2, 2011"}, {"Title": "Better than expected", "Author": "Meredith", "ReviewID": "R2CXYA5YLCKC5B", "Overall": "4.0", "Content": "PRO's: Qwerty keyboard, nice camera, great tools/features, lightweight, neat-looking, cheap $25/month planCON's: Battery life, no zoom for making internet pages bigger, no in-depth instructions on features.I've had two $10-$15 Virgin Mobile flip phones over the years &  wanted to upgrade to a nicer phone for Internet & photos. I chose the Kyocera Loft after carefully reviewing all phones in a decent price range. I was a bit nervous after reading mixed reviews, but for the $45 spent, it's been worth every penny! The keyboard was easy to adjust to, setting it up wasn't too difficult, and the features are plenty! The battery life does suck, but I feel that way about all electronics. Also, I wish I would have noticed (or read about) adjusting the brightness level for the camera. At first I took great photos, but they looked dark. I think that's where other reviewers got the idea that the camera \"sucks\". It doesn't! Just adjust your brightness & it's crystal clear. I haven't noticed any issues when talking on it that other people have. Maybe they're having bad reception? Either way, I recommend this phone for anyone who wants an affordable phone & phone plan ($25/month 300 minutes;unlimited. text; unlimited. net).", "Date": "June 21, 2011"}, {"Title": "Slow piece of trash, not worth the cash", "Author": "Stacey T", "ReviewID": "R2EB66V4Q2QO2Y", "Overall": "1.0", "Content": "If you want a phone that does everything you want it efficiently and reliably, then please save yourself the trouble of even looking at this phone.  I really thought I was getting a great deal when I first bought this, four months ago.  But a month later, I found out I was wrong.Call quality is average at best, this thing always has trouble keeping the voice intact, breaks in the middle of calls, even to a landline.  I had to basically implant the phone to my ear to hear clearly what was going on.The texting and IM service... Horrible.  I text someone, and it usually takes ten tries to get the text to go through.  The phone loves to lock up and freeze what you're doing when receiving text/IM messages, and worse when it's all happening at the same time, or transferring from IM to text, and vice versa.  It doesn't receive picture or voice messages over 1MB.Battery life? Whoever says it lasts two days with minimal calls and text, lied. Four to five hours, lowest brightness settings, just texting.Extra features? The Google maps thing is somewhat of a redeeming feature, only when it works.  When I exit out of Google Maps and go back into it, the GPS function stays in the same place it was for hours on end.  The Opera Mini 4.2 works, albeit slowly.  It often has the problem of clicking the wrong link.  It takes a very long amount of time to get a connection to even start loading the page.I would NEVER recommend this phone to anyone.This only scratches the surface of the problems that this phone has.", "Date": "February 16, 2011"}, {"Title": "I went through two of these", "Author": "Blaine Huey", "ReviewID": "R1GCSAWS40OE8", "Overall": "1.0", "Content": "When I got my first Kyocera Loft I first noticed how easy it was to activate the phone for my existing number, which was great! The battery life was okay and it was very slow. Every time I got a text I would have to unlock the phone and wait 3 or 4 seconds. Then the menu popped up and in order for it to respond I had to wait another 2 or 3 seconds then press \"view\". Yes, it's that slow. To open the menu it take about 2 seconds; the same goes for opening up the contacts list, pretty much everything really. The only thing it did fast was dial phone numbers. So I ended up breaking it on accident by cracking the screen. After calling Kyocera themselves I was told to call Virgin Mobile. When I called Virgin Mobile I was told to call Kyocera, so horrible customer support. After calling Kyocera AGAIN they said none of the parts were replaceable and that I had to buy another phone. Later on at Virgin Mobile's website I found a \"protection plan\" that was hidden behind a bunch of stuff that was $5 a month. The thing is the phone had to be registered within 2 weeks of purchase. Thanks for telling me about that Virgin Mobile, just a few days after I actually needed it. So I went out and bought another one because when the phone broke it was entirely my fault. So I got the other phone and about a month and a half later the phone would refuse to turn on beyond a blue \"download\" image. It didn't show a moving bar or anything it just stayed like that. After about 2 weeks of that the phone refused to turn on. At this point I was frustrated enough to just throw the phone away. I've had problems with Kyocera's products before I bought the two Lofts and I can safely say I will never buy from this company again.Pros: decent battery life  nice sized screen  nice designCons: poor customer support  very slow  cramped keyboard  feels flimsy  no warranty, just insurance", "Date": "May 20, 2011"}, {"Title": "What do people expect?", "Author": "Mean_Geek", "ReviewID": "R27JEG4BQ7U3JA", "Overall": "4.0", "Content": "I dont know what people expect out of a cheap phone, you get what you pay for, if you want something basic, get this phone, if not, get a contract phone. For what it is the phone is great. Very sturdy and light, its a little wide in the pocket, and the keyboard is a little stiff, but everything else is great. Call quality, email services. and Yeah there is NO video, but its a BASIC phone, pick it up and enjoy unlimited text and mobile web, you can put the Opera web browser on it, and if im not mistaken its a mobile version of the browser used on the Nintendo Wii. The plans on virgin mobile are great too. I will be using virgin mobile as long as they are around. Good phone.", "Date": "April 14, 2011"}, {"Title": "lying", "Author": "kay", "ReviewID": "R60IXHFLVU85K", "Overall": "1.0", "Content": "they show a blackberry and send me the wrongthing and try to justify it ..i sum krappy phone i willnever order frm this site agin", "Date": "January 8, 2012"}, {"Title": "Awful", "Author": "PaddyG", "ReviewID": "RLP0TGA3BTI7I", "Overall": "1.0", "Content": "I bought this phone from Radio Shack back in February 2011, expecting a cheap phone to use, at least for $70. This is the worst phone I've ever had. Every single feature seems like it had funds for its development cut. Every single corner is cut, literally and figuratively. Signal and call reception and quality is terrible everywhere. It feels (and is!) cheap all around, from the case to the keyboard. I never treat my phones badly, when my contracts would end every 2 years, my phones looked brand new. This crappy Kyocera has disintegrated in my hands. First, the battery cover wouldn't stay on, it would slide off at every possible opportunity. Then, it just flat-out broke and wouldn't stay on at all, so I had no choice but to get rid of it. Then, a small metal strip inside the phone started to work its way OUT from inside the phone itself. The screen got a small feather crack after only 2 months use with no pressure on it whatsoever. The menus and browser are as laughable as a budget 2003 phone. Save up just a little more money for a better phone from Virgin Mobile.", "Date": "November 11, 2011"}, {"Title": "Good for the price...", "Author": "B. Carr", "ReviewID": "R2Q978LRXE3KSJ", "Overall": "4.0", "Content": "When I needed a new phone, I decided I would try this phone.  My old phone was getting very difficult to hear with, so I decided I would retire the old one (an Audiovox flip phone).  I saw this phone on sale and we bought one for me and another for my wife.Each of us have all the toys, so all we needed was the phone itself.  All in all I think it was a very good choice!The volume is loud enough, the phone is clear.  It took me some fiddleing around to learn how to take the phone off keylock.  But after that it was all good.The keys are small, the phone is not fancy, but it works!", "Date": "November 11, 2011"}, {"Title": "cell phone", "Author": "grav1", "ReviewID": "R3KBHSGA48XC19", "Overall": "5.0", "Content": "excellant product. arrived very fast, would recommend to others.  not much else to say but the phone works great.  packageing is excellant", "Date": "November 5, 2011"}, {"Title": "Not a good choice", "Author": "Kevin", "ReviewID": "R3B3PK8W72P874", "Overall": "1.0", "Content": "Before I purchased the Kyocera Loft in January 2011, I read the reviews (which were mixed) -- most were favorable.  I made the decision to take a chance on this phone.  I deeply regret it.  My wife and I have the same phone and hers has slightly (emphasizing \"slightly\") better call quality.  My phone's call quality is the worst.  The speaker phone is practically useless.  Those I call consistently complain that they hear their own voices (echoing).  The phones functionality / menu structure is cumbersome at best.  The keyboard is not comfortable, etc.  On a positive note, I dislike the phone so much I avoid using it at all costs -- which keeps minutes down.  My advice, put the money you would waste on this phone and put it towards a different model.", "Date": "July 20, 2011"}, {"Title": "Saves a Lot of time", "Author": "W.Renter", "ReviewID": "R1W9F85KD100IY", "Overall": "4.0", "Content": "Was And is a Fantastic phone, Its Simple as it gets.... ! Perfect for you if you have a life that is so busy you have no time tp pointlessly finger through applications.. its a phone that means business and saves you time, time, oh such valuable time!", "Date": "April 9, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0046CQPAC"}}