{"Reviews": [{"Title": "very good phone", "Author": "T. Nguyen \"dynerebon05\"", "ReviewID": "R3O3JBK1QRJXHK", "Overall": "4.0", "Content": "phone does everything you would need from texting to surfing on the internet. no sim card is require. this phone is a cdma phone.", "Date": "December 12, 2011"}, {"Title": "Great Phone!", "Author": "Traci Neel", "ReviewID": "R11E4NKXRI2PIX", "Overall": "5.0", "Content": "Of all the phones I have ever had, including the iPhone, I love this one! :) I'm sure there are better ones out now, but this is a good phone and for this price, a great investment into the smartphone world. My phone fell out of my purse the other day before the new Otterbox Case arrived and now the camera and camcorder don't work. :( It hit rather hard on a hard wood floor. I am surprised the screen didn't crack and nothing else broke. Which is why I'm posting my review now...I wanted to replace it. The camera and camcorder replaced my Nikon camera and Flip video recorder and I find that I use it more than my tablet or laptop. Once I got it through my head that they are basically mini computers with limited capabilities, I respected it a lot more and appreciated what it is capable of. Don't be afraid to give it a chance. Its a good phone and no, this CDMA phone does not use a sim card-I'm not sure if the CDMA network does use a sim card, but I'm in Alaska and we are pretty limited here anyway.Graphics are great, processor is fast, functionality is good, its simple to use, Market has TONS of games and apps with more everyday. :)", "Date": "February 16, 2012"}, {"Title": "not sutisfied", "Author": "eliup", "ReviewID": "RJZC8K1JMJ7ZI", "Overall": "1.0", "Content": "No it didn't cover any expectation, they sent me a Motorola phone instead of the one I order.I wanted to cancel it but, it was too late!", "Date": "November 5, 2013"}, {"Title": "Would have been a nice phone, if it worked.", "Author": "Jodi N.", "ReviewID": "R3P5KIIKNV6EHK", "Overall": "1.0", "Content": "U.S. Cellular told me that I got a bad phone, and that this is common with the HTC Desire's.  The antenna doesn't pick up much or any signal, and my data won't pick up at all.", "Date": "July 19, 2013"}, {"Title": "HTC Desire A8181", "Author": "Cowboy Roy", "ReviewID": "R34FCPIXWSMARK", "Overall": "4.0", "Content": "Recieved this phone promptly. Has functioned wonderfully. Storage is large. Packed alot onto it without it crashing. Really good phone. Only issue is it tends to heat up. Otherwise would be five star. Love this phone.", "Date": "June 30, 2013"}, {"Title": "defective", "Author": "Linda R Martin", "ReviewID": "R3GTSM53DSDHZU", "Overall": "1.0", "Content": "this item is not holding a battery life and camera does not work nor the video, nor the voice recorder, does not have instructions that come with the phone, this phone does not need to be recirculated", "Date": "September 4, 2013"}, {"Title": "Locked and Useless", "Author": "ladynalaska", "ReviewID": "R3BDVQZ4N5NXS2", "Overall": "1.0", "Content": "Waste of time and money It could only be used by cellular one customers ,making it useless to most people including me", "Date": "November 12, 2012"}, {"Title": "it is not a phone or mobile at all", "Author": "ossama hussein", "ReviewID": "R1D8SMI2GRCTY3", "Overall": "1.0", "Content": "i purshased a smartphone , but they send to me like a phone but without any place to Sim card , it means no pohone, how can i use it ?it is  Unlocked Phones , why you sent without place ro Sim Card", "Date": "November 2, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0047QYSNI"}}