{"Reviews": [{"Title": "Dead in just a couple of months", "Author": "SLN \"slee\"", "ReviewID": "R2AEBK5YG6C0KE", "Overall": "1.0", "Content": "I charged it the other day and it turned super hot and then just died.  I have to replace this phone AGAIN.  Super bummed.", "Date": "September 26, 2011"}, {"Title": "IT WAS NOT NEW OPENED SEAL ETC", "Author": "Ina Bird", "ReviewID": "R3RPSGH48IBFQ2", "Overall": "1.0", "Content": "IT WAS NOT WHAT ORDERED IT WAS NOT VIOLET AS I ORDERED WAS NOT NEW THE SEAL HAD BEEN BROKEN AND WOULD NOT WORK WITH STRAIGHT TALK OR BOOST I HAVE PUT IN NOW THREE TIMES TO RETURN IT FOR MY MONEY BACK HAVE NOT HEARD BACK FROM SELLERS OR AMAZON VERY VERY DISAPPOINTED!!!!!!", "Date": "March 14, 2014"}, {"Title": "Blackberry rim", "Author": "keshea key", "ReviewID": "RMUVBT1OFMH1P", "Overall": "2.0", "Content": "It's just older technology due to its age. The keys make it difficult to type and downloads slow. Albeit the phone is just old.", "Date": "March 3, 2014"}, {"Title": "good condition", "Author": "Andrew P.", "ReviewID": "R2S57UW64MWMKX", "Overall": "4.0", "Content": "Phone worked great. minor scuffs but everything worked and keyboard had all keys. nice color. we liked it very much.", "Date": "January 25, 2014"}, {"Title": "good phone if you have it on verizon only", "Author": "Alyssa", "ReviewID": "R90UQJW7WL2XP", "Overall": "3.0", "Content": "i had it on page plus and the phone worked okay. i had to download opera mini browser to use the internet and then the app world wouldnt work. the phone itself worked fine, i just had it on page plus.", "Date": "March 6, 2013"}, {"Title": "cute..", "Author": "kace810", "ReviewID": "R2UXM2GMZVSYNX", "Overall": "4.0", "Content": "phone is cute, no problems as of now. Just arrived yesterday. Easy to activate. If buying used make sure you use the MEID HEX number, other numbers such as ESN might not coincide when activating.", "Date": "February 15, 2013"}, {"Title": "Information", "Author": "Eileen", "ReviewID": "R1LZ31SJAMI2QI", "Overall": "3.0", "Content": "Good Morning .. i need to know if the cell works in Venezuela and if it has a sd slot .. thanks", "Date": "February 15, 2013"}, {"Title": "kelly artigas", "Author": "K. artigas", "ReviewID": "R2NFXB12KY3I4O", "Overall": "4.0", "Content": "very good product and the timely arrival original recommend everyone buy the product to enjoy a good piece to wear thanks greetings", "Date": "January 29, 2013"}, {"Title": "adorable", "Author": "Amazon Customer", "ReviewID": "R5AQS0L5HS234", "Overall": "5.0", "Content": "I've always liked BlackBerry, and this is a very feminine colour. It came in very good condition and worked well right out of the box", "Date": "January 13, 2013"}, {"Title": "its slow but okay", "Author": "sara", "ReviewID": "RU4QHVRS2RXIJ", "Overall": "2.0", "Content": "the wifi is extremely slow and it goes in and out.. meaning you'll be connected for about 3min and then your after you wait a minute for a page to load you'll find out your no longer connected to wifi. Also reconnecting to wifi also requires you to either just wait it out about 30 min and try again or power down the phone and reconnect. I bought this for GPS, which doesn't work without data plan, and email which i can rarely read due to the time it takes to connect and reconnect to wifi. I dont have a data plan so it may affect the speed.. but make sure your provider offers BIS or you can't get a data plan for this phone. FYI page plus doesn't offer data for this phone (no BIS) and verizon's only prepaid option is $80 a month. I wouldn't buy this phone unless you get a BIS data plan.. for me its worthless", "Date": "January 7, 2013"}, {"Title": "does not work in my country", "Author": "latoyica stephney", "ReviewID": "R3B4B81UAPPS33", "Overall": "1.0", "Content": "this phone does not mave memory card slot nor sd card slot and does not wrk in my country i am returning it.", "Date": "September 18, 2012"}, {"Title": "Informacion", "Author": "Marjorie Parra", "ReviewID": "RPYJ72S5147YK", "Overall": "1.0", "Content": "Quisiera saber si este telefono utiliza tarjeta SIM y si sive para utilizarlo en Venezuela. y tambien quisiera saber si viene liberado", "Date": "May 20, 2012"}, {"Title": "Bad experience", "Author": "Mad", "ReviewID": "R3Q62KX9BYAI7Y", "Overall": "2.0", "Content": "I purchased this phone but did not get the one i purchased. I will be sending the phone back because i can not use it.", "Date": "September 13, 2011"}, {"Title": "because i love this cover because the cover can pritect my sreen phone that why i choose this cover i love it", "Author": "jarlin", "ReviewID": "R3U2XIH7OG21IS", "Overall": "5.0", "Content": "because i love this cover because the cover can pritect my sreen phone that why i choose this cover i love it", "Date": "September 27, 2013"}, {"Title": "cdma or gsm", "Author": "yeli", "ReviewID": "R2ZWSZ3ZADIZDY", "Overall": "3.0", "Content": "hi! this phone uses gsm or cdma? i would like to buy it but i need to know if use cdma or gsm sistem1 thank`s", "Date": "June 12, 2012"}, {"Title": "gsm or not", "Author": "kaffie", "ReviewID": "R1XXHJZGM1Y84X", "Overall": "4.0", "Content": "can this phone be used in the Caribbean? help me asap I need to know before i buy it thanks", "Date": "June 22, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "3G-enabled BlackBerry smartphone with full QWERTY keyboard and touch-sensitive optical trackpad; access all your email and messaging as well as social networking\nAccess V Cast Music (with Rhapsody) and Video services via fast EV-DO data network; GPS-enabled for turn-by-turn directions; Visual Voice Mail\n2-megapixel camera/camcorder; Bluetooth stereo music; microSD memory expansion; digital audio player syncs with iTunes and Windows Media Player\nUp to 4.5 hours of talk time, up to 252 hours (10.5 days) of standby time\nClear ESN , Ready To Activate, No Contract Required", "Name": "RIM BlackBerry Curve 2 8530, Violet (Verizon Wireless) - No Contract Required", "ImgURL": "http://ecx.images-amazon.com/images/I/513ULNd7-bL._SY300_.jpg", "ProductID": "B004YF5AGG"}}