{"Reviews": [{"Title": "Excellent phone", "Author": "Vladimir Hernandez \"Vlad\"", "ReviewID": "R2Q3GK9Q7RAX67", "Overall": "4.0", "Content": "Great phone, fast, thin and lightweight, sexy looking and very responsive... The only issue and the reason i didn't give it 5 stars is that it lacks a front facing camera for video calls.", "Date": "May 14, 2011"}, {"Title": "overall", "Author": "icy", "ReviewID": "R3MJ04GSG8AQ9Z", "Overall": "4.0", "Content": "Overall, this was a very good phone.  It was very fast and responded very well.  The only downside to this phone was that it does not have a front facing camera.", "Date": "September 29, 2011"}, {"Title": "Great phone!", "Author": "Diego", "ReviewID": "R1ZJ1R4YVI92QK", "Overall": "5.0", "Content": "I had almost two months trying to decide which phone to get and I'm really pleased to say that I made the right choice. It covers all my necessities, I usually use my cellphone just to make calls and texts but with this phone is almost impossible to ignore its high potential, the phone features are also very impressive. So I think it'll make your money worth. My main concern was that I was going to receive some generic phone but I was wrong, everything is original and works a 100%. The only bad thing was the delivery but that's not the seller fault my package got to my town on the stipulated date but the delivery company made some mistakes that corrected very quick.", "Date": "September 12, 2011"}, {"Title": "Amazing", "Author": "Robinson Rangel", "ReviewID": "RX3R0EGE5OX1M", "Overall": "5.0", "Content": "This smartphone is amazing, only Sony Ericsson can make perfectly designed equipment. As for the shipment was received it very fast and very well protected.", "Date": "July 8, 2011"}, {"Title": "Indeed its a good choice", "Author": "Indiana Jones", "ReviewID": "R3720M31S853HS", "Overall": "5.0", "Content": "Pros:Beautiful and really stylish shape and designWell balanced dimensions and extremely light weightI am using iPhone 4S but Xperia Arc got big display, nice sound quality and of course Android. Seems like iPhone age is going to be over anytimeCons:So far I found camera loading, quality etc is in no comparison with iPhone 4SDue to my excitement, I keep on using it for 4 hours and this utilized just 50% of battery. Its not that bad but I am already sick with iPhone 4S battery so I am putting this in Cons. Better then 4S.Best part was I received all accessories including Pouch, extra ear phone coverings, plug converter and screen protectors. I never experience this b4. But surely, Sony or 'justbuydealstoday' saved my many bucks.Will surely love to business with this seller. Importantly, I never bother to write such a detail review before at Amazon. Keep it up!", "Date": "February 13, 2012"}, {"Title": "This is not about product - it is about seller.", "Author": "GriffinDrums", "ReviewID": "RBF4VO5MA89MN", "Overall": "1.0", "Content": "This is not feedback on the phone - this is feedback on the seller, transformersandgsmphones.While the 5 star rating this seller has looks appealing, it shouldn't be.  My wife ordered a \" brand new factory unlocked\" black iPhone 4.  When she received it, it was set up in the home language of Chinese, and when she went to update to the new iOS, the phone crashed.  After taking it to the apple store, the phone was confiscated because the serial number in the phone matched one of a WHITE LOCKED AT&T; iPhone, and that the software in the phone was not Apple produced.  What makes this even more infuriating is that the night before, we called the seller, and when the air was asked to be cleared after explaining what was going on, we were assured that it was factory unlocked and that it was a \"new\" iPhone.We are still trying to get our money back, and we have met resistance.Stay far away from this seller.  Not to be trusted.  There are bad people in the world who will swindle you - we learned the hard way by falling for this one.", "Date": "October 8, 2012"}, {"Title": "Very good phone and easy to use!!", "Author": "Bakari A.", "ReviewID": "R2NVTKHDMAFTKV", "Overall": "4.0", "Content": "Great phone and easy to useVery simple and easy to takeThe signal is high using gsm!!Thks+", "Date": "September 15, 2013"}, {"Title": "Made the Switch", "Author": "AmateurReviewer \"product hussy\"", "ReviewID": "R11Q17JQJS7TFP", "Overall": "5.0", "Content": "It took me a long time, but weary of my Blackberry and not impressed with their most latest offerings, I researched the market and came across this phone. It is sleek, efficient and not complicated to use. Sony Ericsson has my loyalty for producing great smart phones.", "Date": "March 6, 2012"}, {"Title": "Sony Xperia Arc Silver", "Author": "mvis", "ReviewID": "R2UXFEMKH4N6AN", "Overall": "4.0", "Content": "This phone is beautiful. It works great but I found a bug. When I set an alarm on weekdays for 7:30AM and another alarm at 8:30AM also on weekdays, one of the alarms cannot be stopped. No pop-up shows up to either snooze or dismiss it. Any button pressed is not interpreted as a snooze attempt which should be (any other equipment that has alarm does that). The only way to stop it is to power it down (or just ignore the darn thing). I had my friend, who also has Android but different phone, to copy my setting but he could not reproduce it so it is a Sony bug, not Android.I tried to erase the 7:30AM and 8:30AM and used 2 new alarms in the afternoon that are about 1.5hrs apart and they were both ok so I am scratching my head. Sony should look into this.", "Date": "September 3, 2011"}], "ProductInfo": {"Price": "$559.00", "Features": "Unlocked quad-band GSM cell phone with US/International 3G plus GPRS/EDGE connectivity (not compatible with CDMA carriers like Verizon Wireless, Alltel and Sprint)\nAndroid 2.3-powered smartphone with brilliant LED-backlit 4.2-inch multi-touch display, 1 GHz processor, 8.1-MP camera with HD 720p video capture\nWireless-N Wi-Fi networking, Bluetooth stereo music, GPS navigation, 1 GB memory, microSD expansion\nUp to 7 hours of talk time, up to 400 hours (16.67 days) of standby time; released in March, 2011\nMultiple E-mail Support (Webmail and ActiveSync), Internet and Wi-Fi Capable, Bluetooth 2.1", "Name": "Sony Ericsson Lt15i Arc Unlocked Android Phone - International Version, No Warranty - Misty Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/41wKSWz3FEL._SY300_.jpg", "ProductID": "B004UOPUTS"}}