{"Reviews": [{"Title": "Perfecto", "Author": "Carol", "ReviewID": "RDDS23WTZ6DI8", "Overall": "5.0", "Content": "BuenisimoEl teléfono llego en perfecto estado y en el tiempo previsto. Ningún problema de conexión, funciona excelente en Vzla", "Date": "February 25, 2012"}, {"Title": "Everything was OK with this phone. Any claim. Excellent", "Author": "ennio60", "ReviewID": "R1Y8PQBB4C9ORJ", "Overall": "5.0", "Content": "Everything was OK with this cellphone. Any claim. Excellent product. I am using it for some weeks and it is working properly.", "Date": "May 18, 2012"}, {"Title": "Good product, but.....", "Author": "Fabio", "ReviewID": "R19EUNL0QULRDM", "Overall": "2.0", "Content": "The phone was OK,I bought this product directly to Amazon due to the confidence to the company, but in this case the phone didn't bring the mini SD memory and the Battery charger isn't the original one and don't work", "Date": "April 3, 2012"}, {"Title": "The best thing I bought on Amazon", "Author": "JEAN CARLOS MARTINEZ ACOSTA", "ReviewID": "R32C70BZ6N11XK", "Overall": "5.0", "Content": "I am a customer of Venezuela on Amazon for 2 years and have always been satisfied. So recently I acquired this equipment at a great price. New Products unused. Spotless and very well packed.I recommend them for any telephone operator in Venezuela, because a product is released, however only up or Digitel Movistar 3G. With no lifts Movilnet 3G only EDGE. Works perfectly with WiFi and no need to take it to an authorized agent of any phone company because the company recognizes automatically, your data package or plan Blackberry and it works right away. full plug and play.Lo mejor que he comprado en amazonSoy cliente de Venezuela en Amazon desde hace 2 años y siempre he quedado satisfecho. Por eso recientemente adquirí estos equipos a excelente precio. Productos nuevos sin uso. Impecables y muy bien embalados.Los recomiendo para cualquier operadora telefonica de Venezuela, porque es un producto liberado, sin embargo solo levanta 3G con Movistar o Digitel. Con Movilnet no levanta 3G, unicamente EDGE. Funciona perfectamente con el WiFi y no necesitas llevarlo a un Agente Autorizado de ninguna empresa de telefonía, puesto que  reconoce automaticamente la empresa, tu paquete de datos o plan Blackberry y  funciona de inmediato. full plug and play.", "Date": "January 28, 2013"}, {"Title": "all right", "Author": "Hernan", "ReviewID": "R1JKLUUOTHA59Q", "Overall": "5.0", "Content": "It is a great product. good packaging, good price,absolutely, I recommend it. . . . . . . . .", "Date": "December 11, 2012"}, {"Title": "Great", "Author": "RoseyMartin", "ReviewID": "R1HE7BSM6W8XPJ", "Overall": "4.0", "Content": "I really love this phone. It's got that amazing BB interface that I love, and the color was really cute too. The shipping was really fast and efficient. And the phone came in factory packaging. I appreciated that.", "Date": "November 21, 2012"}, {"Title": "Work perfect shipped on time...", "Author": "Simon", "ReviewID": "R3G1WN6L5L66XN", "Overall": "5.0", "Content": "Work perfect with AT&T; 3G networks... same as the original Blackberry 9300 from AT&T.;Not sure about the warranty though if it is valid or who warranty this product...", "Date": "June 8, 2012"}, {"Title": "BB 9300", "Author": "OR", "ReviewID": "R13FP6P85QKQD8", "Overall": "5.0", "Content": "The device works perfectly and it's an excelent phone. the cams resolution it's ok due to the cell segment, I recommend the BB 9300, Unlocked phone for any oparator.", "Date": "September 23, 2011"}, {"Title": "CAUTION!!!!!", "Author": "Deelana", "ReviewID": "R1MVI1BPREVXGB", "Overall": "2.0", "Content": "I can't even begin to explain my disgust with this product! But I am an adult and will ONLY offer CAUTION TO ALL. I WILL ALSO SAY THAT I WILL NEVER DO BUSY WITH AMAZON AS LONG AS I LIVE AND BREATHE!", "Date": "April 13, 2014"}, {"Title": "Excellent", "Author": "Javier", "ReviewID": "R1XZ8EOC7925WQ", "Overall": "5.0", "Content": "Good Product. I can Use in others countries with Nextel services.  But I need buy again, I lost in the beach", "Date": "June 28, 2013"}, {"Title": "telefono", "Author": "fatimazulay \"Fatima\"", "ReviewID": "R3B43S0J988ECA", "Overall": "1.0", "Content": "el telefono los primeros 4 meses funciona, despues se daño sin explicacion alguna no funciono mas y no funciona mas", "Date": "April 15, 2013"}, {"Title": "solo levanta 3g digitel", "Author": "Jorge Leonardo Rivas C", "ReviewID": "R1U1XAXY1PFL0T", "Overall": "4.0", "Content": "el telefono esta en buen estado, nuevo todos los accesorios peroooo!! no levanta 3g movistar y movilnet!!! solo digitel!! pendiente con eso!!", "Date": "February 27, 2013"}, {"Title": "good", "Author": "agustin iglesia", "ReviewID": "R1AF75EED56FFD", "Overall": "4.0", "Content": "muy buen producto. rápido facíl y a tiempo la entrega. sin contratiempos en todo el proceso. lo recomiendo a a", "Date": "February 21, 2013"}, {"Title": "just perfect!", "Author": "enanita", "ReviewID": "R2Y07LB38GE0Q9", "Overall": "5.0", "Content": "I received it on time, in perfect conditions.I use with SMS cards in Argentina and Brazil without problem.the only problem that i have that the earplugs were very low quality and i'd broken in the first week", "Date": "July 22, 2012"}, {"Title": "Excelente tecnològia", "Author": "Big", "ReviewID": "R2WLDXIU8IY5V9", "Overall": "5.0", "Content": "This product is strong and good quality. Besides this line cost the same. Their colors are well combined. I recommend it for all kinds of people.", "Date": "January 4, 2012"}, {"Title": "Inaccurate", "Author": "Wendy", "ReviewID": "R9VFFPE14UVQ3", "Overall": "1.0", "Content": "I love this phone. I've had it before. But the one that arrived was not the correct phone. I realize this was the sellers fault. I was able to return it. Still bummed though!", "Date": "June 4, 2013"}], "ProductInfo": {"Price": "$349.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported.\n3G-enabled, affordable BlackBerry in gray for accessing all your e-mail and messaging plus fast Web browsing and data downloads\nWi-Fi networking, Bluetooth stereo music; microSD expansion to 32 GB, GPS for navigation using BlackBerry Maps, Visual Voicemail\nUp to 4.5 hours of talk time, up to 456 hours (19 days) of standby time, released in September, 2010\nThis unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nUp to 4.5 hours of talk time, up to 456 hours (19 days) of standby time; released in September, 2010\nWi-Fi networking; Bluetooth stereo music; microSD expansion to 32 GB; GPS for navigation using BlackBerry Maps; Visual Voicemail", "Name": "Blackberry 9300 Curve 3G Unlocked SmartPhone with Wi-Fi, GPS, 2 MP Camera and Bluetooth - Unlocked Phone - US Warranty - Violet", "ImgURL": "http://ecx.images-amazon.com/images/I/51ap6V5IFcL._SY300_.jpg", "ProductID": "B004UBOH9K"}}