{"Reviews": [{"Title": "WILDFIRE HTC CELL PHONES OF THIS SELLER IS FRAUD", "Author": "Marco", "ReviewID": "R34XTMFV91HUMN", "Overall": "2.0", "Content": "I'm shocked:- after writing a review about the truth of this product HTC Wildfire A3333 Unlocked GSM SmartPhone with Android OS, 5 MP Camera, Wi-Fi, and Touch Screen--International Version with No US Warranty (Black) sold by justbuydealstoday, the seller writes to me asking and insisting me in 7 e-mails approximately, that i should take back my feedback, offering me to refund me the money ONLY after I delete the feedback. How can I trust someone who just cheated on me with a phone?HTC Wildfire A3333 Unlocked GSM SmartPhone with Android OS, 5 MP Camera, Wi-Fi, and Touch Screen, does not work at all with the ANDROID MARKET, because a factory problem with the compatibility. The sellers know that, and they don't give a sh....! All blogs talk about it. Look at this one [...]I quote:\"...Problem downloading Apps to my new HTCHi there!I just bought a new HTC Wildfire S in China. After buying it I realized there are two problems:1) In China there is no access to Android Market, but to one that is called \"HTC Market\" which does not have any interesting application.2) Because of that I try to access the Android Market using PC and download apps, but the following error occurs: \"There are no Android phones associated with this account\". Obviously, I have a Gmail account since many years ago.I've searched through Internet and it seems many people have the same problem. For me it is hard to understand that all those people (including me) cannot download any app. from the Android Market! They are free anyway, right?There must be a way around that people use, right? Does anybody know why no one is able to fix this error?Thanks a lot guys!Andreu...\"So, this a world known problem, this item is being sold in AMAZON for long,and no one claims, but AMAZON is very clean and open with the quality and safe purchase policies. I hope AMAZON take away this \"fresh\" seller who was trying to convince me to delete my previous feedback....I own 3 other HTC cell phones bought here and I have been using HTC for 7 years, and never had a problem. The problem is this seller and the lack of honesty selling something that he in advance knows that won't work.SHAME ON YOU justbuydealstoday (SELLER) I will go all the way up with my claim.-", "Date": "July 4, 2011"}, {"Title": "Great...but...", "Author": "D.", "ReviewID": "R32OF6KTMLMHF5", "Overall": "2.0", "Content": "Great phone...looks great, and appears to work fine...it's been delivered properly BUT... couldn't the seller told me that this phone is the ARABIC version???...it's kind of sad, because i can't use android market and it's difficult to put it in spanish or us english (it only has arabic english)...shame on them...i'm fighting with my device ir order to get it to work my way...", "Date": "April 16, 2011"}, {"Title": "One Big 'BUT'...", "Author": "Art Emperor", "ReviewID": "RQ923REYSAB1C", "Overall": "2.0", "Content": "I love everything on this phone...easy navigation, great looking graphics, easy to read type size...etc. BUT, unfortunately, I got the Arabic version of the phone. And there is no options for US/UK English, (only Arabic English or Egypt English) so I cannot even use Amazon MP3 app which requires US / UK English in order for it to be installed. Worst of all, there is no MARKET app in this phone. Why get an Android phone if I cannot have access to the Android Market? I am pretty tech savvy and have downloaded from numerous websites trying to install Android Market app manually. All failed miserably. So this phone is going back!", "Date": "April 24, 2011"}, {"Title": "DO NOT BUY INTERNATIONAL VERSION!!!!", "Author": "J. J. Hidalgo \"juanhidgo\"", "ReviewID": "R1H3A69NJAFGRQ", "Overall": "3.0", "Content": "This version has middle eastern languages and limited features. ex: There is no Android Market App, wich is crucial for installing apps into the phone.I have really have to struggle a lot to use this phone the way it should. I've searched the internet a lot to find out how to customize the phone and install simple apps like Yahoo Mail, Skype, and others.I recommend not to buy International Version if you are looking for the cheapest price.", "Date": "April 24, 2011"}, {"Title": "Arabic version has market app deleted", "Author": "A. K. Berner", "ReviewID": "ROPZLS1YV5AFX", "Overall": "1.0", "Content": "Purchased and had to return this due to not possible to download additional Android apps, because Market app was deleted from the Arabic (and only the Arabic) version of this phone.While it is probably possible with a lot of fiddling to get this working with the app market, it wasn't worth it to me to jump through so many hoops.Great phone though! My friend has one and I love how it works.", "Date": "May 16, 2011"}, {"Title": "Awsome and affordable phone", "Author": "Allen", "ReviewID": "R138BI9850BUFM", "Overall": "5.0", "Content": "I have always wanted an Android capable phone but did not want to strain my budget on a high end device. The HTC wildfire gave me a perfect balance of price vs performance. I simply love it. Very smooth to operate. I love the responsiveness of the touch screen, the 5 MP camera and sense technology from HTC. I have no regrets.", "Date": "March 18, 2011"}, {"Title": "Brilliant", "Author": "Rooty", "ReviewID": "R24CHOHOOV98DQ", "Overall": "4.0", "Content": "Bought this phone for a friend and he just love everything about it, he was well satisfied with all the features. I was so pleased he was satisfied. Awesome !!!!", "Date": "June 2, 2013"}, {"Title": "great phone", "Author": "Jin L.", "ReviewID": "R2I767IVO3OY4A", "Overall": "5.0", "Content": "Have been using this phone for a few months now. It still run smoothly without any technical issue. battery life, yes it can last for a few days if don't use a lot of apps and light usage. responsive touch pad, serving the web as fast as my pc. great visual screen. Not too big like other smart phone, and slim too. overal, very satisfy with this phone, has all i need. True to what it specify on the phone feature.", "Date": "November 3, 2011"}, {"Title": "Waste of money", "Author": "Lard PVBFLA", "ReviewID": "RCRKQZGJJ6WM6", "Overall": "1.0", "Content": "Nice looking phone, pre loaded with European web sites, comes with user manual in German. After 3 months touch screen quit working. Placed numerous calls and always got directed elsewhere until finally they figured it was a hardware problem and the phone would have to be returned. Only problem is seller is just that, a seller only. No suggestions on how to get it repaired, not their problem. So if you want to rent a phone for $100.00 a month go for it. I will never buy from them again.", "Date": "July 9, 2011"}, {"Title": "On fire!!", "Author": "Lorenzo Sheppard", "ReviewID": "R3BNIRBL0BGZS5", "Overall": "4.0", "Content": "Lots of features, good for someone who is always on Facebook, twitter, my space, etc. Very user friendly, just wish it came with the instructions in english not german! I am american!!", "Date": "May 8, 2011"}, {"Title": "I'm disappointed", "Author": "Edwin Mejia", "ReviewID": "R22QY4JFHP9PFJ", "Overall": "1.0", "Content": "This phone is not working as it should, no android market, and is in Arabic, is not a good phone ...........I'm disappointed with my purchase.It was approximately 4 hours looking at different phones and did not know which wanted to buy, after so much time searching I decided to buy the HTC SmartPhone Unlocked GSM Wildfire A3333 with Android OS, 5 MP Camera, Wi-Fi, and Touch Screen - International Version with No U.S. Warranty (Black), as the price, and phone technology amazed me.When the phone came to my hands I discovered something:language and keyboard of the phone was in Arabic.and did not have the android market.I feel cheated by the seller, which should specify that. I previously had bought phone on Amazon and never had any problems of this type with my purchases and I feel very cheated.I do not want the phone does not work for what I want, if an android phone. Why? no android market?. I do not understand.I will continue with my claims and it is my right ...I know that Amazon is a serious and honest company that will not allow this kind of harmful things to their customers .....I'll wait a speedy and satisfactory solution for both", "Date": "July 13, 2011"}, {"Title": "I love it", "Author": "Joan B Hemmings Ximines", "ReviewID": "R1430YCR98J82U", "Overall": "5.0", "Content": "Excellent love it.", "Date": "April 18, 2014"}, {"Title": "very good", "Author": "gabriel ET", "ReviewID": "R1Q79Y76W9UKJN", "Overall": "5.0", "Content": "I really liked the product recommended 100% I feel totally happy not hesitate to buy recommended ..... sending was done perfectly", "Date": "July 27, 2013"}, {"Title": "Excellent phone", "Author": "talonstriker", "ReviewID": "R1F80Z2DVRSUSQ", "Overall": "4.0", "Content": "First things first: I didn't buy this exact model of the phone, rather I bought the Virgin Mobile version of this sold in RadioShack.The phone itself is pretty darn good.  I love the form factor which is refreshing in today's world where cells are almost the size of tablets.  The phone is about the size of my wallet which is pretty good.  The weight isn't too bad, but there is something uncomfortable with the phone that I can't put my finger on (pun intended).  Typing on this (using Swype) for longer than 5 minutes gives me some sort a wrist ache, but it just might be my unfamiliarity the phone.Touch screen is responsive, and perhaps slightly oversensitive. There are times a slight brush of my finger is interpreted as a click.  The screen colors are pretty good, but of course for it's form factor fairly small.  Be prepared to do a lot of scrolling on this device.Apps-wise, all apps seem to run properly on my device.  Occasionally Android Market crashes when browsing, I can't pinpoint the exact reason why but it's a software bug.  There's a crapload of crud apps installed on the phone by Virgin Mobile and HTC that you can't remove (unless rooted).  This is definitely  a con.The battery is quite good, contrary to what others have mentioned.  In sleep, with data off and wifi on, battery discharge is about 1% per hour.  With intermittent heavy use, it'll last 2 days easily, with light use probably 4 days.I'm quite pleased with the product.  I give it 4/5 stars.  If the software were better (e.g. without the crapware) I'd have give it 5/5.That being said, I've only had the phone for a week now, my opinions might change after a few weeks, if so I'll update this post.  Futhermore, Moto Triumph might be a better phone for VM customer as the processor is one generation newer (this one's processor is more than 2 generations old at the time of this posting).", "Date": "November 28, 2011"}, {"Title": "Opinion after 6 months of ownership", "Author": "Jack Odiorne \"consumerist\"", "ReviewID": "R3OR6IDYTQ0RZ", "Overall": "1.0", "Content": "I bought this after drowning my Nexus.  I had a friend bring it to me in Indonesia.  If I had bought it directly, I would have returned it.  The problem was not the 'smart' part of smart-phone but the phone part.  It had difficulty answering a call.  The processor seems to get distracted and not respond occasionally.  It was nice as far as display, and sound, but the camera really sucks. Naturally Arabic, no Android apps, as the other reviews now say, not there six months ago.Now, after months of loosing the occasional call because the phone refused to come out of standby, I finally got to the goal.  It is now an mp3 player, the phone function only displays 'bars', but will not accept or make calls.I now look at the reviews...  I guess I am confused.Amazon was reliable to the point I could trust my purchases to the 'system', buying while out of the country.  What I mean is, unlike many other sites that indiscriminately sell junk as if it might work, Amazon was a reliable vendor.  Amazon had/has slogans about this characteristic.  Looking back at this dichotomy makes me think \"All good things come to an end\".  Looking at these reviews, there seems no reasonable way to believe customer satisfaction is likely, but it is still here on Amazon.So my question to Amazon \"Why not continue to care for your reputation?\" by no longer selling this item that is simply junk to me.No need to answer me, but answer all of us by pulling this apparent swindle from your site.", "Date": "November 14, 2011"}, {"Title": "HTC and Android review", "Author": "IRC", "ReviewID": "R3FHJ9MEKQDMRH", "Overall": "4.0", "Content": "The phone is excellent. touch screen is very sensitive.  Would like the ability to reduce the touch screen sensitivity. The OS is easy to use. I also would like to have a way to track used minutes per month for costing purposes.", "Date": "June 29, 2011"}, {"Title": "wildire is a great phone and pda and mp3 player and toy", "Author": "p g \"penny g\"", "ReviewID": "R3515NSVBHCFZP", "Overall": "4.0", "Content": "the htc wildfire is a great phone and everything that i needed.if i could have just anything i would have it be an inch larger but this is easy to carry and use and does everything a pda and game system and mp3 player three times its price would do.  entertains me at the gym, keeps my schedules, checks in on my social media and email all on wifi. the modern apps all download and play.  it also makes and recieves calls.love it", "Date": "April 13, 2011"}, {"Title": "Great mobile smartphone", "Author": "Rafael_CT", "ReviewID": "R3U6XVLPLS62H", "Overall": "5.0", "Content": "Great smart, its size is smaller than almost all other smarts. The Android system is amazing. I am really happy with this phone, and I recomend to everyone who is in doubt and do not know which model to chose. It's battery lasts for approximately two days.", "Date": "April 3, 2011"}, {"Title": "Buyer Beware!  Had to return item!", "Author": "phialpha444 \"Matt\"", "ReviewID": "RE8XZO1NDYO02", "Overall": "1.0", "Content": "I did lots of research before purchasing this phone, and I was pleased with the bang for the buck when the phone arrived.  Then I noticed that the Android Market was missing.  The ability to add apps was my number one reason for selecting an android phone.  I'm pretty tech savvy, and I invested a few hours looking into resolving the problem on my own, but found no easy way.  Like other reviewers with the same issue, I had the Arabic version.In summary, I recommend the phone if you're looking for a low cost, entry level smartphone.  Yes, the resolution is poor, but it's OK given the price tag.  Yes, the phone can be sluggish at times, but it's not excessive and I could easily live with it.  However, if you do decide on this phone, I highly recommend asking the seller if it's the Arabic version and if the Android Market app is installed.Also, keep in mind that the Wildfire S will be coming out shortly, and will have a slightly better processor and screen resolution.  Of course, it will also be more expensive...", "Date": "May 21, 2011"}], "ProductInfo": {"Price": "$499.99", "Features": "Quad-band GSM/GPRS/EDGE:850/900/1800/1900 MHz, HSDPA 900 / 2100\nDisplay: TFT capacitive touchscreen, 16M colors, 240 x 320 pixels, 3.2 inches, Multi-touch input method, Accelerometer sensor for UI auto-rotate, HTC Sense UI\nPlatform: Android OS, v2.1 (Eclair), Qualcomm MSM 7225 528 MHz processor\nCamera: 5 MP, 2592 x 1944 pixels, autofocus, LED flash\nStereo FM radio with RDS, GPS with A-GPS support, Bluetoot v2.1 with A2DP, Wi-Fi 802.11 b/g, Internal Memory: 384 MB RAM; 512 MB ROM\nDisplay: TFT LCD capacitive touchscreen display, 16M colors, 240 x 320 pixels, 3.2 inches, Multi-touch input method, Accelerometer sensor for UI auto-rotate, HTC Sense UI", "Name": "HTC Wildfire A3333 Unlocked GSM SmartPhone with Android OS, 5 MP Camera, Wi-Fi, and Touch Screen--International Version with No US Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41xByZkPU-L._SY300_.jpg", "ProductID": "B00465RXU0"}}