{"Reviews": [{"Title": "Bad phone but great service!", "Author": "Elizabeth Herring", "ReviewID": "R3JEAAXU9RFZJ", "Overall": "5.0", "Content": "I ordered my phone and it arrived in the time they said it would. However, as soon as I activated it, I could do everything BUT make a call! As soon as I discovered this, I made a complaint on Amazon and they were very quick to apologize. I sent it back and they promptly refunded my money! I have had the juke in the past and it was a great phone when it was new but after trying for the THIRD time to get one to work now, I believe the transceiver in them has gone bad.", "Date": "October 19, 2011"}, {"Title": "Compact, durable and cool-looking phone... for basic cell phone needs", "Author": "M. L. Zambrana", "ReviewID": "RTTRVXYBJJGU9", "Overall": "4.0", "Content": "Over a four-year period, Verizon sent me two \"free\" ($12.95 with shipping) red Juke phones as part of my service plan.  After my first term of service with the Juke, I liked the phone so much that when the time to renew came along, I got the exact same model without regret; the benefit of this is that I now have two chargers and two batteries in case I lose one of either.The Juke is a great little phone to have as long as you have few demands in your calling needs.  Incidentally, the Verizon service has been spectacular for me over the years--both with their customer service and the quality of phone reception that the company provides.  It's rather funny for iPhone or other smart phone users to pull out their devices and be unable to get reception in the area, whereas I whip out the palm-sized Juke and bam!  Four bars.I have never had a problem using the Juke phone in calling out or receiving calls, with either phone from the company, and I'm sorry to see that two other people had issues.  Well, there have been the occasional no-ring, straight-to-voicemail calls but sometimes that just happens regardless of phone model or company.  I don't have a fancy Verizon package, just a 300-minute, $34/month internet special (well, $41 with California taxes and other taxes tacked on), so I don't text or do photo/data transfers on it as those would be extra--thus I can't report on how well/poorly it texts, connects to the internet or takes photos.Based on a few experimental photo transfers, however, I'd say that the low-megapixel camera on the back is crap and should've probably been left out of the design altogether in favor of better .mp3 perks.The Juke has proven itself to be a surprisingly durable phone, which is good for those of us who are \"butterfingers\"!  I once dropped one and it stopped working, and then later when I went back and activated it, the thing worked perfectly!  No idea why that happened, but I'm glad that it did.  Its compact size makes it easy to shove in to a back pocket and, again, despite sitting on and sweating on this phone, it's held up very well.  The only basic operating issue I've had were related to the audio jack, which apparently loosened within the body and provided sound in only one earphone... but bear in mind, this was after several years of use and clumsiness!  A product can only tumble to the pavement so many times before it starts to have problems.The phone is, of course, promoted for its .mp3 use.  I've got a few gripes about this, as the problems I've encountered exist with both phones.  The songs are lined up in alphabetical order.  I've tried establishing playlists or using the other features only to find that they don't work for me.  So to get to what I want to hear, I've had to flip through the alphabet.  I've also had problems with the phone hitting a \"dead-end\" song--a particular song causes the playing list of music to stop at the end of it, and go back to the beginning of the alphabet.  Very weird.All in all, though, I'd trade the occasional inconvenience for the long-lasting battery life, and the small yet durable cell phone body that gets great reception no matter where I go.  Low expectations and fewer needs make this a very good choice for simple cell phone service.", "Date": "November 27, 2011"}, {"Title": "Juke phones are cool looking", "Author": "Brian", "ReviewID": "R2PKAWXPTSC574", "Overall": "2.0", "Content": "The customer service from the group selling these phones were very nice.  I received my phone in the mail and it didn't work, so I sent it back.  I wasn't willing to try again, but that doesn't mean it will happen to you.  I suggest you give it a shot.", "Date": "November 23, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Looks and feels like the real thing.\nScaled to actual size and weight\nNON-WORKING phone for use as a toy or display purposes\nBattery 2. Battery Cover (if applicable)\nWall Charger", "Name": "Samsung u470 Juke Cell Phone, Camera, Bluetooth, MP3, for Verizon", "ImgURL": "http://ecx.images-amazon.com/images/I/41EmmHoFQqL._SY300_.jpg", "ProductID": "B00405M75M"}}