{"Reviews": [{"Title": "Works for me", "Author": "AJPacific", "ReviewID": "R33VNGKIO7A44V", "Overall": "4.0", "Content": "We bought two of these phones awhile back from T-mobile when they were near top of the line, so paid way more. (Still saved overall, even with having to pay Verizon penalty--that's how outrageous Verizon's plans are!) Bought another Samsung Highlight through Amazon recently when we added a line. Everything perfect. Then my wife's phone got stolen and I ordered her a new one. This last one came with a battery that would only hold a third of a charge. I probably could have got a replacement from the seller, but it was faster to get a new battery from ebay for 4 bucks. I never complained to the seller, and I believe they would have replaced it if I'd asked.Obviously we like the phones. We use them for talk and text, not internet. The camera takes decent stills and video with sound.  There's no flash, but it does ok in dim light.  It has an amazing panorama feature that lets you take a series of pictures as you pan either left/right or up/down, then stitches the pictures together into a perfect single picture...every time!The reason we bought this phone in the first place is because it's not a \"smart phone\" and doesn't require a plan with the expensive fast internet feature. So internet access is cheap...but it's too slow for me so we just turned it off. If you need fast internet you need a different phone but your plan will be way more expensive, I think. Thank EFF.ORG (Electronic Frontier Foundation) for being at the forefront of fighting the ATT acquisition of T-Mobile! If that had gone through, I'm sure my rates would have rapidly increased.", "Date": "January 6, 2012"}, {"Title": "I'm satisfied", "Author": "D. Falise \"dfal01\"", "ReviewID": "R3QZ2S2YUIGG63", "Overall": "3.0", "Content": "I feel the phone works well. The touch screen is responsive so I don't know what the other reviewer was doing. I even kept the protective sheet on the screen and it still responds. My complaint, as with most phones, you can't see the screen in sunlight. I turned off the automatic key lock because it was annoying. I can hear fine and people can hear me. Texting is great with this phone.", "Date": "May 4, 2012"}, {"Title": "Good phone", "Author": "Tyler W. George", "ReviewID": "RE8WUEDJJ0NCM", "Overall": "5.0", "Content": "I didn't buy this phone from Amazon, but rather T-Mobile in April of 2010. I've had this phone for about 15 months and I really love it. This was my first touch screen phone I have ever had and I must say my experience with this phone has bee phenomenal from the very beginning. At first it was sort of hard to navigate around on the phone and especially hard to type on the QWERTY keyboard but once I got the hang of it it became so much easier to text on this phone. I love how clear pictures are taken if they are taken in good light, and I like all the editing options you have with the pictures as well. I love how you can customize the widgets and how sleek the phone is and how it never freezes or even runs slow like most touch screen phones do.  Maybe it is because the lack of a data plan that makes it this way, I don't know, but all around this is a very nice phone and I will definitely be keeping it for a while before I'm due for an upgrade. The only drawback is that the inbox claims it can hold 500 messages, but really it can only hold 400. Couldn't ask for a better touch screen phone. Thank you Samsung :-)", "Date": "August 6, 2011"}, {"Title": "Great phone!", "Author": "ebcopeland", "ReviewID": "R2R0UPG6U1PZI0", "Overall": "4.0", "Content": "I've had this phone for about 18 months now and really love it.  This was my first touch screen phone, so that took some adjusting to, but overall, the phone has been great.  It's not a super-expensive phone, but it has lots of good features. I've never used it with a data plan and my experience has still been great.  My provider allows free access to only a few sites, so I can only imagine how much better the phone would be if you paid for full web access.My only complaint is about photo viewing; if you're scrolling through the gallery, it goes crazy trying to display the picture, flipping between landscape and portrait.", "Date": "January 21, 2011"}, {"Title": "so happy with it", "Author": "tricia", "ReviewID": "R1SAYB8MMGUGPO", "Overall": "5.0", "Content": "i ordered this phone because i already had it and got it wet.i have never bought a phone thru amazon nor the seller.the phone came in an unopened box still wrapped in plastic.it arrived earlier than expected and in fantastic condition.it is brand new, just like they said. i was somewhat hesistantbefore its arrival but was sooo happy when i saw condition of phone.they were right and i would definately buy from thisseller again!!!!", "Date": "May 11, 2012"}, {"Title": "samsung highlight", "Author": "jeremy", "ReviewID": "RONX0IAMGF6M6", "Overall": "4.0", "Content": "great phone for texting easiest phone for that, and calls, lasts longer than any other cell phone ive had, not good  at all for web use if thats important to you, too slow processor for that", "Date": "January 30, 2012"}, {"Title": "You made my day", "Author": "Divine Nketi", "ReviewID": "R2W7YX89WKEYRZ", "Overall": "5.0", "Content": "Very happy with my product. thanks again. Was very happy after i got my product, was a reaL dagain and will definately recomment to friends", "Date": "January 14, 2013"}, {"Title": "happy with the phone", "Author": "julie123", "ReviewID": "R38KQQFXQ5XMB7", "Overall": "5.0", "Content": "i have had one of these for 2.5 years and purchased this one for my mom. owned it for a few month , like it. fast shiping.didnt have any problems with the item or the service.", "Date": "May 30, 2012"}, {"Title": "Worst Phone Ever", "Author": "Robert J. Schaefer", "ReviewID": "R26DNXMZWVR8UK", "Overall": "2.0", "Content": "Ive had this phone for over 1 year now and I cant stand it! The screen feels small and crowded, and it isnt very responsive. The camera constantly takes blurry pictures and will take pictures of my pocket despite the locking mechanism. After a few months, it became kinda slow and would refuse to unlock for me either unless you hit it a few times. Ive already had to have it replaced once before thinking that it was simply defective but the new one started to have the same problems the old one did in the same amount of time. The phone is easily scratched and poorly designed. Out of the 5 people, including me, who I know of who have this phone, no one likes it. I would most certainly not recommend it to anyone.After recieving my new phone to replace my Highlight, me and my friends decided to have fun destroying the Highlight. Despite my hatred for the phone, I have to say I was thoroughly impressed with how much abuse this phone with held! Over all, we ran it over 14 times with a Lexus SUV, played 4 square with it by bouncing it off the sidewalk, played tennis with it in which it smashed against a rock and finally just had to go at it with a sledge hammer. After everything (besides attacking it with a sledge hammer) all we had to do was put the battery back in and sure enough, it would turn right back on and we could do simple things since I had taken my SIM card out waaay before we did this. So instead of giving this phone 1 star like I had before, it has earned my respect in that it simply wouldnt die! Kudos to you Samsung!", "Date": "May 6, 2011"}, {"Title": "Will never buy from them again!", "Author": "miks", "ReviewID": "RZJROQYT0T8", "Overall": "1.0", "Content": "They sent my phone in the wrong color with a broken charger.  The box that the phone was in was smashed.  It was listed as new but it was really refurbished.  I will never buy from them again.  I'm working on returning the phone and getting a full refund.  I paid $150 for a refurbished and broken product!", "Date": "February 16, 2011"}, {"Title": "the worst phone i've ever used.", "Author": "MTH", "ReviewID": "R1JWEGEGVHKZ2N", "Overall": "1.0", "Content": "Like the tittle said, this is the worst phone I've ever used. This is coming from some one who has used a motorola Razr v3. The touch screen isn't responsive. to give you an example, it's no better than the credit card touch screen at grocery stores. It's probably AT LOT worse. The camera takes ugly pictures.you know what? maybe it's just me. I just hate this phone.The best thing about this phone is probably the calling feature, oh wait phones are supposed to do that.As a textaholic, I quit texting all together once i got this phone.It's the worst phone to text possible.to wrap up, if you want to torture your child, your husband, your wife, what ever it is, get them this phone.If you want your child to quit texting, get them this phone.if you only want to call people, i suggest you get a $5 phone.", "Date": "January 15, 2012"}, {"Title": "This phone sucks!", "Author": "Julio C. Andrade", "ReviewID": "R2SPLBLNCGJ7AC", "Overall": "1.0", "Content": "To lazy to write up a review so read everyone else's complaints and yeah. They sum it up pretty nicely. Sucks even more that I have to wait until my two year contract with dumb Tmobile for me to get another phone.", "Date": "August 23, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "IT has stereo Bluetooth, 3G data, video capture, 3-megapixel camera and touch phone", "Name": "Samsung Highlight T749 Cell Phone (Unlocked)", "ImgURL": "http://ecx.images-amazon.com/images/I/41MiTk6vdNL._SY300_.jpg", "ProductID": "B00481XZDQ"}}