{"Reviews": [{"Title": "GREAT ITEM", "Author": "Phone Reviewer \"Cell Phone Reviewer\"", "ReviewID": "R29W6Z3KUZMK4V", "Overall": "5.0", "Content": "GREAT PHONE, VERY RESPONSIVE. HAD IT FOR A YEAR SO FAR, WORKS VERY WELL. It's great to have a phone with a touch screen and a keyboard. It's a great value.", "Date": "August 24, 2011"}, {"Title": "Nice Phone!", "Author": "L. Chen \"LLC\"", "ReviewID": "R21VJZ8B6RMCUY", "Overall": "5.0", "Content": "It's a pretty and nice working phone! My daughter loves it! The blue tooth is also working well with my vehicle, easily paired!", "Date": "March 25, 2012"}, {"Title": "Very nice & easy to use", "Author": "Mira B.", "ReviewID": "R1KISAOS1HB5BR", "Overall": "4.0", "Content": "I buy internationally made phones because of travelling, this is a small nice phone just that the characters ( keys) are so small)", "Date": "October 19, 2013"}, {"Title": "Awesome celphone!!!", "Author": "Elsh", "ReviewID": "R3T2QZUMQ9WG23", "Overall": "5.0", "Content": "I totally love this celphone!!! Its very comfortable to use & the design is amazing!!! Defenitely I recommend this item if you are looking for a nice celphone!!! :]", "Date": "January 9, 2012"}, {"Title": "Good for Price", "Author": "New User", "ReviewID": "R3ODUSPQGQ8MFQ", "Overall": "4.0", "Content": "I bought it for my daughter, she like this phone only issue is it does not come with additional memory card with it. Other than that she got all what she was looking for.", "Date": "September 7, 2011"}, {"Title": "decent", "Author": "CF", "ReviewID": "R392VYA0AW8829", "Overall": "3.0", "Content": "decent phone; not that smart (if you are used to iPhone and droid devices); but for a young one is good. The OS is purely old school, so don't expect any magic.There are better devices around, but this is good if you need to have the keyboard to type.", "Date": "May 1, 2013"}, {"Title": "sucks...", "Author": "mika", "ReviewID": "R35ODTXMACUCO3", "Overall": "1.0", "Content": "this phone sucks..the internet dont work..and if you call at&t; they will tell you that they cant help..you cant use most of the ringtones you have saved on your memory card. i am so mad i wasted my money on a phone i cant use..and the manuel is not in english.", "Date": "June 9, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "LG GT350 Etna Plus Unlocked Quadband GSM Cell Phone - Touch Screen - QWERTY Slider - International Version (White/Aqua Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/51aUHZo4U2L._SX300_.jpg", "ProductID": "B004673TUG"}}