{"Reviews": [{"Title": "Good Phone", "Author": "recentbuyer", "ReviewID": "R2Q23HRLN7KOPP", "Overall": "4.0", "Content": "I owned an HD2 and had horrible experience with it so I was very skeptical when it comes to another Windows phone until I checked out my buddy's HD7. I got it right after that and love it since.  This phone has a big and very sensitive screen.  One of the best touch screens out there.  There is no lack whatsoever.  The operating system is very stable compare to Android or Windows 6.5.  I don't have to kill all the running apps constantly and my phone never freeze.  I'm able to get my Gmail, Hotmail and work mail through Exchange instantly like Blackberry no problem.  Windows phones have about 12,000 apps now and that's 11,950 more than enough for me, although the banking apps and PayPal are not there yet.  I can watch movies and TV show almost everywhere I go through Netflix, which is nice.  The phone also have some limits like no front facing camera, no flash player, no ability to convert songs into ring tones and when you save a new phone #, you can't change the type of phone number into something unique like \"customer service\".  If you like me and able to live with these limits, this phone is for you. Try it out, you will love it", "Date": "April 10, 2011"}, {"Title": "Wonderful phone for the first year", "Author": "Rabbi", "ReviewID": "R2XXC1DY5OXVNF", "Overall": "3.0", "Content": "I've had this phone for about 18 months. I loved it when I first got it. It ran great for the first year that I had it. Now it resets itself, meaning that it deletes everything off the phone; music, pictures, apps, games, videos I mean everything. (If you're going to buy this phone keep in mind to manually reset it if it freezes on the htc screen is holding the volume keys and the power key together for about five seconds.) It has gotten to the point the battery doesn't hold charge for more than 8 hours, if you don't use it. When I plug it in I have to wiggle the cord around to get it to start charging. The volume keys don't work anymore and it will turn the music down when I listen to music. And finally, the last straw is that I can't open up my contacts, get into my texts, or open my emails.So yes this is a wonderful smart phone. I loved it to death. I would recommend it to you, just keep in mind after a year you might want to buy another phone.", "Date": "November 27, 2012"}, {"Title": "Great", "Author": "Rudy C. Harris", "ReviewID": "R32BVWS4INYYTG", "Overall": "4.0", "Content": "This is a great product with functional ease andf reasonably priced, and delivered timely, it will make a great gift or asset.", "Date": "October 18, 2013"}, {"Title": "Good phone But..", "Author": "Franklin Wright", "ReviewID": "R3RGUI7B5H3ACO", "Overall": "5.0", "Content": "Excellent smartphone telephone equipment, very useful in several daily activities like internet, calls, ability, the truth that all gains and besides that I have almost two years of having it has never given me trouble the hardware or software, is in excellent condition, I have only one disagreement based on the utility of hes operating system WP (windows phone) the truth because the location, or the fact of being in another country is not USA, is not possible to exploit the optimal utility of this great phone, precisely because WP weaknesses and also a wide variety of programs in the marquet that are not possible from obtaining because this system is not compatible, like androit which in that sense if you let him back .. so excellent product ..", "Date": "October 17, 2013"}, {"Title": "Excellent cellphone", "Author": "Carlos Hernandez \"Charlie\"", "ReviewID": "R1Y68S3BUFTX7M", "Overall": "5.0", "Content": "I am very happy with this cellphone. At the begining I didn't know how to used, but now I am very expert and the software are powerfull. I like it very much.", "Date": "June 9, 2013"}, {"Title": "every easy to break", "Author": "katheryn huggins", "ReviewID": "RMCNEJNNDNW6T", "Overall": "2.0", "Content": "everything worked wonderdul for aweek until my kids accidently dropped it. i didnt see any visible damage so i figured it was ok.but apparently the built in memory card isnt hard to knock lose but once it has come undone it cant be put back and the phone wont finish loading and cannot be used after this...so basically i have a 200$ paper weight now", "Date": "April 21, 2013"}, {"Title": "Not as good as I expected", "Author": "Perla", "ReviewID": "R2QQ7CBSW905UR", "Overall": "3.0", "Content": "Having problems with the signal. Sometimes text sms are not received or I cannot receive phine calls.on the other hand the phone it's OK great colors and system operating very well, except fort he signal.", "Date": "December 12, 2012"}, {"Title": "Great!", "Author": "Leonastie", "ReviewID": "R1SHHB22NIELON", "Overall": "5.0", "Content": "Great phone! I'm very impressed with WP and HTC! I had Android (Galaxy S) but this seems to be the real deal! Very happy.", "Date": "August 13, 2012"}, {"Title": "the phone is good to use , the shape is also very good", "Author": "rocky yin", "ReviewID": "R1XMZJ6XHV1MZ3", "Overall": "5.0", "Content": "may be some accident , the chager wire is broken , but the cell phone is very good to use and has a very nice shape. now seller changed a new charge wier for me , the seller is nice. desver to have 5 stars", "Date": "April 10, 2012"}, {"Title": "Satisfied", "Author": "CiCi", "ReviewID": "RECM36Q7QCRWJ", "Overall": "5.0", "Content": "This was my first time ordering a phone off the internet period. I will be ordering phones more often now off Amazon! My phone was in the same condition it said in the description. I purchased the HTC HD7.", "Date": "March 22, 2013"}, {"Title": "Very Good", "Author": "Marcelo Lopes", "ReviewID": "R2Y8W5J193ZJQW", "Overall": "5.0", "Content": "Well, the HTC HD7 is very good! for me this one with WP7 is better than iphone 3GS (I had one). And i will not compare to Android OS that for me is good, but Google don't built a beauty system.On the phone, i think the camera could capture truer colors, and the volume is low for some things, maybe the problem  is a driver from HTC.The S.O. is very good, more fluid and help us to organize better our lifes, is more \"clean\" than others S.O..", "Date": "August 8, 2011"}, {"Title": "be sure of what you buy!", "Author": "snt", "ReviewID": "R1EN5JFIK4UE3A", "Overall": "1.0", "Content": "The HTC phone arrived in a Yellowish old T-Mobile carton box. It was wrapped inthe transparent plastic for food! No other protections for shipment precautions. Unboxing it, the inside molded plastics was not the right size for the phone, so it was floating inside the box. Even the bags for the cable and charger was not original HTC. No instructions for the phone, but instructions for T-Mobile services.I have other products of HTC, but this one is not HTC standards at all if not for the brand on the phone. By the way you receive a T-Mobile phone if it wasn't clear.Before to order, make sure of WHAT you are buying. Make clear of the product you'll receive. This one seam unboxed, and stuffed in another box: T-Mobile! Nothing wrong with T-Mobile.The Phone is superb, and that's another hat's off for HTC.I wrote this review more from the help viewpoint.", "Date": "September 4, 2011"}, {"Title": "HTC HD7", "Author": "ismail adallo", "ReviewID": "R209BMF9U4SG6Q", "Overall": "1.0", "Content": "The phone keeps freezing up and the seller said rest it, however, it stays frozen so basically every minute we keep resetting the phone, then how am I going to work with this phone if I have to keep resetting it?This phone is malfunctioning as well as the seller.", "Date": "December 21, 2011"}, {"Title": "order but still waiting for like 5 weeks", "Author": "sam", "ReviewID": "R2XROWX5BLP6JJ", "Overall": "1.0", "Content": "i order my phone on 8/8/2011 it now 9/21/2011 still did not have it, thats all i have to say,after i have E-mailed the shipper i still have to wait god knows how long,that makes me to never order anything from AMAZON.COM any more.", "Date": "September 21, 2011"}, {"Title": "HTC HD7", "Author": "Tamer Ammar", "ReviewID": "RRQKRXN774QHN", "Overall": "2.0", "Content": "1- It was not mentioned in the product description that the phone comes with \"T-Mobile\" logo, so I was disapointed when I received the phone carrying this logo2- SKYPE application is not supporting this phone", "Date": "May 18, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Enormously enormous screen. Bask in the glory of a 4.3 in capacitive touch screen. Pop out the kick stand and watch all day.\nWelcome to Windows Phone 7. An intuitive OS system from Microsoft. No clutter. So you can spend more time being you.\nNow playing. More games with Xbox live. All your music and videos integrated with Zune entertainment.\nYou. Only louder. The super fast processor optimizes HiFi sound. Put on the headphones for Dolby surround sound.\nSmile. Shoot video and photos with a 5 MP Camera with auto focus and flash. Upload and share instantly.\nNetflix, EA Games, Slacker and Family Panorama come preloaded.", "Name": "HTC HD7 Windows Cellphone Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/51-DPEP0X6L._SY300_.jpg", "ProductID": "B004GV6N3M"}}