{"Reviews": [{"Title": "NEVER buy from this seller!!!", "Author": "Miss Z \"Miss Z\"", "ReviewID": "R10LJWWHIQSNPU", "Overall": "1.0", "Content": "\"I've had the MOST FRUSTRATING experience with this seller in my life. I wouldn't actually leave any stars for them, just had to. This was iPhone 4s box, the bottom of the which was roughly sealed with some dirty paper to cover the real specks, it was blocked and 16 GB instead of 32 GB. Moreover, the seller wouldn't confirm the return of this product despite my 2 emails to them. I do not recommend anyone to do business with this seller ever!!!\"", "Date": "April 16, 2012"}, {"Title": "Finally in white", "Author": "Iphone lover 4 life", "ReviewID": "R2V2FPAP9P6BGM", "Overall": "5.0", "Content": "I love the white iphone! I was able to activate my t-mobile sim in the United states and it works flawlessly!", "Date": "June 20, 2011"}, {"Title": "Iphone 4 is the best!", "Author": "trish", "ReviewID": "ROVYFIQPZAK21", "Overall": "5.0", "Content": "Got a gift for my grandpa in the Philippines. Worth the extra money for it to be manufactured unlocked! No gimmicks! Thanks amazon!", "Date": "June 20, 2011"}, {"Title": "Ross Cellular Is A Bogus Seller!", "Author": "M. S. Meyers", "ReviewID": "R3B46ZUKBJ21S1", "Overall": "1.0", "Content": "This product was an OLD re-built iPhone pieced together and sold for WAY too much money! I bought this product specifically for traveling overseas so I could substitute SIM cards in different countries. I had problems with it and took it into an Apple Store. They examined it and said the serial number had been changed as well as the components. I had to buy a REAL iphone from them. The warranty period was very short but I plan to discuss this with Amazon.com to see if anything can be done to refund my money.This seller is a total rip-off - don’t buy from Ross Cellular!", "Date": "February 18, 2013"}, {"Title": "Amazing!", "Author": "K. Vanho \"carpidiem92\"", "ReviewID": "R1D4B3S5PVOUFI", "Overall": "5.0", "Content": "Thanks Amazon!  I love this mfg unlocked iPhone! I now can use it anywhere in the world!!!  This is so cool!!!", "Date": "June 20, 2011"}, {"Title": "perfect", "Author": "Neptuno", "ReviewID": "R3TD70OIIZN3X2", "Overall": "5.0", "Content": "0 complainsthe iphone came to me brand new....and im using it in Caracas Venezuela, without any trouble!!!!!I think, these models come from europe, cause the battery charger, but these people incorporates an adaptor plug!!!", "Date": "July 12, 2011"}, {"Title": "The IPhone 4 I received and sent back is a fraud.", "Author": "Vera Rosenthal \"Vera R\"", "ReviewID": "R34PJ5JOUBBEI6", "Overall": "1.0", "Content": "It wasn’t only a refurbished item instead of unused item. The IPhone 4 I received and sent back is a fraud.On october 17, I spent more than 2 hours at the Genius Bar of Apple Store at 5th Avenue, New York. They recommended me to do a back up first and come back the other day.The following day, 18, in Apple Store at 14th Street, New York, I spent another 2 hours at the Genius Bar just to know 1) that they couldn't  just replace the phone because it was out of warranty - it expired two years before, one year after it had been bought by its first owner, in June 2010. So if wanted a replacement I'd have to pay US$ 150 for it - which I accepted; and 2) at the very moment of the transaction, the guy who served me at the shop counter noticed something in the iPhone and asked me to wait. He checked the serial number and found that the iPhone was originally a black one - the one I bought was a white one. He couldn't replace it.They didn't have a new iPhone 4 to sell, and I needed desperately to buy a cell phone because I was leaving the next day to Brazil. I bought an iPhone 5C unlocked for $649 + taxes, as you can see in the annexed file. Total: US$ 706.59.If you want to be fair, please deposit the difference of U$ 266,50 (706,59 - 439,98) I had to pay. I wont charge for the four hours of my vacation I wasted at Apple’s counter, neither for the worry and inconvenience I had with your item .I send alrady several emails and I'm still waiting for an answer. Hope to hear from you soon.", "Date": "November 9, 2013"}, {"Title": "Reclamo", "Author": "Haydee", "ReviewID": "R2LJSUZZLGA77D", "Overall": "1.0", "Content": "Me dirijo con el fin de expresar mi inconformidad en Relación a la devolución de las Naciones Unidas Iphone de Apple 4 4G 32GB Por El Cual cancele la CANTIDAD de 532 $, el efectuandome Reembolso Por instancia de parte de uds. De 425 $, originandome sin descuento de 106 $, el Cual no ACEPTO ya lo Que Yo le teñido Que Asumir la perdida de envio desde Allá up to Venezuela, Como Me Siento Verán estafada \"Ustedes tienen que asumir esa perdida porque yo no tengo la culpa que el telefono que me vendieron estaba dañado yo compre un telefono que tenia que estar en excelentes condiciones. Porque de lo contrario lamentablemente tendre que correr la voz para que la gente tome precauciones con esta tienda, ademas de que la devolucion fue efectuada desde Miami no de venezuela para que me vengan a descontar $106,00.", "Date": "January 3, 2013"}, {"Title": "Second defective phone that i have received.", "Author": "Don Packer", "ReviewID": "R2177E7J5SVFP", "Overall": "1.0", "Content": "This phone is Described as NEW but obviously is not, phone appeared new in factory box. The first phone died after 2 hours, the screen when blank and could not be restarted. The second one worked okay except that the microphone was bad and callers could not hear you, nor could you do a voice recording.", "Date": "October 28, 2013"}, {"Title": "It's not NEW and battery not works!!!", "Author": "Ellison FAN", "ReviewID": "RHDPOQGWEL6X1", "Overall": "1.0", "Content": "Obviously it's not a NEW phone. There are scratches on the screen. After 1 day, the battery still can not be 100% charged. I returned the phone.", "Date": "October 17, 2013"}, {"Title": "IS NOT NEW, HAS FAULTS muy mala compra, NO ES NUEVO, TIENE FALLAS.", "Author": "Leisle Mendez", "ReviewID": "R3JQ7M3MTFB4HK", "Overall": "1.0", "Content": "Este telefono le funciona muy mal su cámara. Las fotos me salen borrosas, no sirve su camara frontal. no hace el cambio y se queda trancado. Parece a simple vista nuevo, pero estoy segura que es remanufacturado ya que tiene rayones en el boton de superior encendido. no trajo calcomanias, no trajo la llave para la sim card. su plastico protector fue removido y estaba sucio con huellas dactilares por todos lados... y lo compre en estatus de NUEVO  Fui estafado por  esta gente. NO RECOMENDADO.This phone will work very badly their camera. The photos came out blurry me, front camera is wrong, does not change . Looks new, but I'm sure it's rebuilt as it has scratches on the top button on. I brought status new, did not bring the key for the sim card. its protective plastic was removed and put , is dirty with fingerprints... .  I scammed by these people. NOT RECOMMENDED....", "Date": "August 25, 2013"}, {"Title": "Don't buy stuff here.", "Author": "Moto", "ReviewID": "R3GZFESBK31NPX", "Overall": "1.0", "Content": "My phone do not be quiet when it is in silent mode especially when I take a pic.in addition, they gave me low quality earphones.", "Date": "March 10, 2013"}, {"Title": "World phone", "Author": "H. Ho \"Powerdictionary\"", "ReviewID": "R1EGWKXDBRR9RH", "Overall": "5.0", "Content": "Bought this iphone for my son in Vietnam and it worked out perfectly. No hack or extra sim needed. just pop in any gsm sim and activate through iTunes. Best iphone yet!", "Date": "June 20, 2011"}, {"Title": "i phone", "Author": "sean powell", "ReviewID": "RME1A4LZP4NEU", "Overall": "5.0", "Content": "this product seems to be brand new have no problems with the phone at all no scratches or dents very happy with it", "Date": "May 14, 2013"}, {"Title": "BUY WITH CONFIDENCE FROM THIS SELLER!!!!!", "Author": "Mark N. Franklin", "ReviewID": "R1Y4PVAWU3YEAM", "Overall": "5.0", "Content": "I have never written a review for any product I purchased. I make an exception here because, Mr. Kyle Wunderli, of Better Deals FASTER is a preeminent businessman who has very high quality products, super fast  delivery time, and superb customer skills. Although I paid a little more from this seller than from another, I would purchase from this seller again!", "Date": "February 9, 2013"}, {"Title": "Proveedor transformerandgsmphone", "Author": "O.Campos", "ReviewID": "R1WLOXSMTPV7N", "Overall": "1.0", "Content": "No es confiable este proveedor de celulares, debido a que me fue enviado un celular Iphone como nuevo y fue vendido en el ano 2010 a otra persona, o sea era basura. Fui directamente a una tienda apple en Florida porque nunca sirvio y resulto ser que estaba fuera de garantia. Gracias a apple tengo un iphone", "Date": "January 9, 2013"}, {"Title": "different from descriptions", "Author": "Nhu-Y Van", "ReviewID": "REIM777GPWT2E", "Overall": "1.0", "Content": "I sent the phone to Vietnam. After using the phone, my borhter figured out that the charger and the speaker didn't work, it was a broken phone.", "Date": "December 19, 2012"}, {"Title": "Not that good", "Author": "Erna Zampogna", "ReviewID": "RQGY8MWSIK6VB", "Overall": "1.0", "Content": "At first I like the delivery it was fast, but after I open the box the iPhone was dirty I need to clean it first. It is color white and some parts are still dirty I don't know? What to use in cleaning that particular area it's color tan. I just really need the phone that's why I did not return it but I will never ever recommend amazon to my friends when it comes to gadgets. Sorry but there should not even dents on it but it has. Please next time you have to make it sure that you have to surpass. The expectations of you customers.", "Date": "January 30, 2014"}, {"Title": "Rating", "Author": "T'arah Curry", "ReviewID": "R3GCG906U8W9K5", "Overall": "4.0", "Content": "The phone seems to be working very well no problems it had the storage capacity that was in the description looked felt and worked like a brand new phone so I will repost in a few months letting you know if the status remains the same.", "Date": "January 14, 2014"}, {"Title": "iphone is an excelent phone", "Author": "FANCYDUDDE", "ReviewID": "RNP9IMP0308ES", "Overall": "4.0", "Content": "the iphone is perfect , just who buy the phone has to make sure the storage capacity of the phone. series of iphone 4 are all the same from outside but the capacity of the storage could be 8 GB or 16 GB AND or 32 GB. make sure and ask the seller about this, and TAKE CONSIDERATION I PHONE 4 HAS A NO CAPABILITY OF 4G ( FAST INTERNET BROWSING.)THE REST ARE PERFECT .", "Date": "August 7, 2013"}, {"Title": "excelente iphone", "Author": "gabo", "ReviewID": "R1YB5131MB29I5", "Overall": "5.0", "Content": "excelente vendedor desde venezuela todo perfecto gran telefono sin detalle alguno llego en el tiempo estimado en excelentes condiciones gracias", "Date": "April 5, 2013"}, {"Title": "NOT BAD", "Author": "tomscruz", "ReviewID": "R2Y205G4VB6Y4C", "Overall": "3.0", "Content": "THE IPHONE 4 THAT I GOT IT'S NOT BAD,BUT I GOT A HARD TIME TO FIGURE IT OUT ,WORKS FINE....", "Date": "March 12, 2013"}, {"Title": "Excelente vendedor recomendado al cien porciento. Excelente equipo y excelentes precios recomiendo al 100 % sin mas que agregar.", "Author": "Ezequiel Antonio Ojeda Andonaegui", "ReviewID": "R2Z0WQF4E4C79E", "Overall": "5.0", "Content": "Excelente vendedor recomendado al cien porciento. Excelente equipo y excelentes precios recomiendo al 100 % sin mas que agregar. ...", "Date": "March 1, 2013"}, {"Title": "Iphone", "Author": "karin l medina bracho", "ReviewID": "R1BP8I1X3OFOE9", "Overall": "3.0", "Content": "El equipo llego bien, mas tuve que pagar una alta suma para que lo pudieran desbloquear. no vino desbloqueadode fabrica como decía el anuncio.", "Date": "January 28, 2013"}, {"Title": "item is as described", "Author": "Debbie", "ReviewID": "R8EINKY98A9RJ", "Overall": "5.0", "Content": "item is the same as described. i'm very satisfied. deliver even on Christmas holidays, which surprise me. full points to me!!!", "Date": "January 3, 2013"}, {"Title": "Very good service", "Author": "Gliceria Gonzalez", "ReviewID": "R3OBSOU9AC709F", "Overall": "5.0", "Content": "Amazing service, real fast deliver and the company it's really interested in the client. I'm very happy with the product and with Wireovia.", "Date": "December 24, 2012"}, {"Title": "Best phone ever", "Author": "albertogpo", "ReviewID": "R5R3IPIE5TBLJ", "Overall": "5.0", "Content": "Each day I become more and more satisfied with the Apple iPhone. Amazing performance, incredible graphics, very very functional, a great camera, great touch-screen response, thousand of useful and funny apps, excellent operating system. Apple shows why she's the market leader with this product.", "Date": "August 1, 2011"}, {"Title": "White", "Author": "smd", "ReviewID": "R26SA32QKY2K0W", "Overall": "5.0", "Content": "AWESOME phone! Absolutely love it. Came to me brand new in mint condition. Too expensive, but I had to indulge.", "Date": "July 29, 2011"}, {"Title": "Excelente", "Author": "Leidyangel", "ReviewID": "R3LC94URL72EUY", "Overall": "5.0", "Content": "Todo muy bien. Me gusto... Fue lo que pedi... llego a tiempo... Excelente, recomendando 100%...Saludos desde Valencia - Venezuela...", "Date": "June 22, 2012"}, {"Title": "Locked Iphone with Gevey adapter", "Author": "Walid Khawly", "ReviewID": "R3A8C0WYQ7E3P8", "Overall": "1.0", "Content": "I bought this Iphone form SJohnson236, and they send me  locked Iphone with Gevey Adapter and ATT Software, I returned it the same day, and I got the refund, Thanks to Amazon", "Date": "June 1, 2011"}, {"Title": "Apple iPhone 4 4G 32GB Quad-band World GSM Phone (Factory Unlocked)- WHITE", "Author": "Jaime Alejandro Hidalgo", "ReviewID": "R1RXC60KC9B9B0", "Overall": "3.0", "Content": "Good morning, I'm very upset about the purchase I made, which appeared as a new product purchase and really do not look new, I sent them unboxed and without instructions, I assume were hutch devices, they are white and one of they appear with a yellowish white.I have doubts to purchase online on Amazon, E-bay maybe a little more professional about choosing appliance suppliers know them inside your networkregards", "Date": "November 21, 2012"}, {"Title": "Wrong item", "Author": "Alfred", "ReviewID": "R1BNM3FMIVFTT5", "Overall": "1.0", "Content": "I got I phone 4 it is BLACK!!!!!I prefer white I select it. I got BLACK.What going on?", "Date": "November 6, 2012"}, {"Title": "not worth", "Author": "Amazon Customer", "ReviewID": "RHTENUZFONASJ", "Overall": "3.0", "Content": "Why buy iPhone 4 in $715 when appl selling iPhone 4s (unlocked) in $649, I just got a 4S for appl", "Date": "December 29, 2011"}, {"Title": "Do not Cut SIM - UNTIL U Verify It Can Work with UR provider", "Author": "PryncessAnna", "ReviewID": "R1UPOUM3L9X8TC", "Overall": "4.0", "Content": "I love my iPhone even though I have not been able to use it. I've always loved iPhone and was waiting patiently to get one. Also bought the SIM cutter and cut my Digicel Sim, however it does not work with the iphone.  I called APPLE and they said a cut SIM will NOT work, I'll HAVE TO get a micro sim, as the connections are different. FOR THIS, APPLE LOSES 1 STAR because now I have to wait another day and spend some money with another network to get a micro sim in order to use my phone - Boo!Until then, it's back to my faithful iTouch..  BTW, my cut sim is back in my Nokia and working fine, so it wasn't damaged during the cut. Learn from my misinformation and don't waste ur $ on a Micro SIM Cutter, Converter with 2 SIM adapters UNTIL you verify a cut SIM will work with the SIM provider and others on the network.One-day shipping was great. Got all my items securely packaged and intact. Thanks Amazon.", "Date": "June 28, 2011"}, {"Title": "Great phone", "Author": "vic g.", "ReviewID": "R17WNQ0V0QN6K5", "Overall": "5.0", "Content": "The phone is absolutely perfect. It was able to do everything I needed it to do plus much more. Hopefully I can find a 5 at a great price so I can upgrade", "Date": "May 25, 2014"}, {"Title": "Broken Iphone", "Author": "severina kolloffel", "ReviewID": "R31Y2PQ5LWPD6", "Overall": "1.0", "Content": "The phone had already some repair done to it. The on and off device was broken and I had to bring it to a repair shop to make it again. It costs me 50$. The repairman discovered it was repaired before. Since I was abroad it was to hard to sent the phone back. Very bad business. I was conned. Severina Kolloffel", "Date": "March 31, 2014"}, {"Title": "Great Product!", "Author": "Smith", "ReviewID": "R1LINMQ2Y5GSY7", "Overall": "4.0", "Content": "Its a great product. But I see no reason why you should buy from here. You can get 8 GB Apple iPhone 4 from apple store for much less. I removed one star as I am unsure of the quality of this phone. I broke the front touch screen accidently and while getting it repaired from apple authorized technician, he informed me that its a refurbished phone. Originally it was a black iPhone which was made white by changing the front and back panel and some other parts. So be aware!", "Date": "December 6, 2012"}, {"Title": "nice.", "Author": "Daniela", "ReviewID": "R36I82QV1BDB0Y", "Overall": "4.0", "Content": "I got this from the seller 'transformersandgmsphones' and it came really fast!It's been working really nice to me :)But I have one complain.. it's an asian version, so every time I take pictures it sounds!!! even if it's on silent mode. If anyone knows how to fix this (without a jailbreak) please let me know :)Other than that, the iPhone 4 is an awesome phone. Even though the camera sucks.xx", "Date": "November 17, 2012"}, {"Title": "Apple iphone", "Author": "MAY", "ReviewID": "R2455DGG89R0PT", "Overall": "1.0", "Content": "Primero lo evalue bien, luego el Telefono empezo a fallar, se quedaba paralizado y el boton de comando dejo de Funcionar. Para mi sorpresa, la Apple me informa que el Telefono ya habia sido reparado antes y que no tiene garantia. Perdi mi dinero!!! No lo compren!First it evaluates fine, then the phone started to fail, he stayed paralyzed and the left command button to Run.To my surprise, Apple informs me that the phone had already been repaired before and has no warranty. I lost my money! Do not buy", "Date": "September 13, 2012"}, {"Title": "Great product", "Author": "Kat", "ReviewID": "R211YTASU61LWX", "Overall": "4.0", "Content": "All I can say is that this is a great product and works propertly. It arrived on time! I am so happy with this purchase.", "Date": "June 12, 2012"}, {"Title": "Stunning", "Author": "Thinkman \"SmartEnoughToKnowBetter\"", "ReviewID": "RISRQYAAVAHA4", "Overall": "5.0", "Content": "Although Amazon has mistaken my iPhone 4 for a white, unlocked version (probably because I didn't buy it from them, but rather Best Buy), my 32GB Black iPhone 4 has become the most indispensable tool in my entire arsenal. I have yet to have a need for an app that doesn't already exist for it, and, almost without exception, these apps are well thought out and completely delightful (if not astonishing). Once again Apple innovates, and the rest of the market immediately responds with their wannabe versions.This confirms my belief that there is a dearth of leaders and an overabundance of sheep.", "Date": "September 18, 2011"}, {"Title": "Not user friendly", "Author": "Kayhan, Ziaee", "ReviewID": "R3RJVDZPOQWHTF", "Overall": "1.0", "Content": "Over all apple products are very manipulative, and overpriced. I try my phone for almost 5 days and no matter what application I want to access I have to connect my I-phone to my I-tone!! And of course I have to give all my personal information i.e. my address, my e-mail, my phone number even credit card number!!!! It is absolutely ridicules. Also the futures on this phone compare to Galaxy from Samsung are comparing apples and oranges. This phone doesn't offer anything without connecting to your I-tones.", "Date": "December 8, 2012"}, {"Title": "QUESTION IPHONE", "Author": "Almu001", "ReviewID": "R3HN49YIXSMES2", "Overall": "5.0", "Content": "One question, I live in peru, this iPhone will work here? also in one year I'm moving to spain and i will stay with the same phone so hit will also work over there?. Its a 32gb phone or I'm wrong? One more question, whats the difference between the iPhone 4 and the 4s?Thanks", "Date": "September 12, 2012"}, {"Title": "WRONG PICTURES UP THERE!!", "Author": "Jorge Herrera \"George\"", "ReviewID": "R30XKEW3IVTHMG", "Overall": "1.0", "Content": "Hey, this is crazy!! I clicked to see the images of this phone up there at the beginning of the page (See all 4 customer images), and all I see is 4 pictures of a woman, one of which suggests she is wearing no clothes. What is this??? Aren't the pictures supposed to be those of the product????", "Date": "October 24, 2011"}], "ProductInfo": {"Price": "$799.99", "Features": "This is the OEM Apple white iPhone 4.\n3G, GPS, Wi-Fi, Bluetooth, 5 MPixel, EDGE, iOS 4, 32GB\nFactory Unlocked, No Network Logos or branding, Network Unbranded\nWorks with any GSM 850/900/1800/1900 & 3G HSDPA 850/900/1900/2100\nFree to upgrade, downloard etc with any network simcard", "Name": "Apple iPhone 4 32GB Quad-band World GSM Phone (Factory Unlocked)- WHITE", "ImgURL": "http://ecx.images-amazon.com/images/I/41rbNX8PW2L._SX300_.jpg", "ProductID": "B004YXMGN8"}}