{"Reviews": [{"Title": "Bad Product", "Author": "theogar13", "ReviewID": "R23M5ADW9NCNO9", "Overall": "1.0", "Content": "I bought this phone as a gift for my son, the cell phone was received with some scratches and bumps, some applications such as record of my email not working, I am waiting that my son send me back the cell to see what we can do, because it doesn't work properly, I paid $375.00 for it, is not a new cell phone and was supposed to be. I want my money back or another cell phone...", "Date": "June 19, 2011"}, {"Title": "not shipping", "Author": "amazon", "ReviewID": "R2F9GUMY679SWV", "Overall": "1.0", "Content": "Phone has not come to your intended arrival date, please let me know what has happened with my purchase and eh echo various claims and nothing is not possible that I sent my phone never bought because they have not sent, please send me again My Money", "Date": "March 15, 2011"}, {"Title": "100% RECOMMENDED", "Author": "Esperanza Carrillo \"esperancita_carrillo\"", "ReviewID": "R13X44NIKZDCY8", "Overall": "5.0", "Content": "VERY GOOD DEAL ALL MY CONCERNS ANSWERED 100% recommended PHONE IN VERY GOOD CONDITIONTHANKS FOR EVERYTHINGExpects to make future purchases", "Date": "November 16, 2011"}, {"Title": "The phone does not appear again", "Author": "Marlin Parra", "ReviewID": "R2RCM9PDTLIZVE", "Overall": "1.0", "Content": "I received the phone and at first glance looks new but not a rebuilt phone, I am very disappointed that I bought as new and rebuilt", "Date": "November 14, 2012"}, {"Title": "Different frequency", "Author": "Roberto", "ReviewID": "RB079PDMEAF6C", "Overall": "1.0", "Content": "First of all I remind you that you were describing the telephone as follows: \"It works on frequencies 850/900/1800/1900 MHz for GSM / GPRS / EDGE and operates at frequencies 850/1900/2100 MHz (5,2,1) for 3G\" .But actually sent me a phone other than that, the phone that you sent me only works in (1,2,8 = 2100,1900,900 MHz frequency for 3G), you made a mistake because you sent is different from the frequency to 850MHz for 3G was what I really needed.(Movistar Peru).The cell does not have the printed branded (At&T;)As shown in the picture.Roberto Velásquez", "Date": "August 1, 2012"}, {"Title": "BROKEN REFURBISHED PHONE SOLD AS BRAND NEW", "Author": "Dalty", "ReviewID": "RDNTJQ9PP2NMG", "Overall": "1.0", "Content": "I purchased a Blackberry 9800 phone from this seller (Mid Star) that was advertised as brand new but this was NOT THE CASE. upon receipt of the phone I had the following problems:1. The BB pin does not work. I therefore cannot use the phones messaging capability which is the primary purpose why I bought the phone. It is practically useless.2. The phone does not read from the memory card.3. I took the phone to a technician who determined that the phone is REFURBISHED AND NOT BRAND NEW as claimed by MidStar.I feel cheated/ ripped off as I was sold a broken refurbished phone that was advertised and sold as brand new.", "Date": "June 22, 2012"}, {"Title": "Great experience with the purchase process, and still satisfied with the product", "Author": "salsa", "ReviewID": "R3SJ3TS9QZBD5Q", "Overall": "5.0", "Content": "Great experience with the purchase process, and still satisfied with the product.  I will definitly doing again and recomand others to purchase from this place.Thanks,", "Date": "July 14, 2011"}, {"Title": "amazing", "Author": "rhonda", "ReviewID": "R2YRWECSQIPWF9", "Overall": "5.0", "Content": "i bought the phone for my son as a christmas gift.  when preparing to write a review for it i asked him to rate it for me and tell me how to rate it.  he said he gives it 50 billion points so if 5 stars is worth that much then thats what he chooses.  he says it is amazing and he falls more in love with it each day he has it.  so, i can give what i can only assume to be a great review of this product.  it defiantely passes a teenagers tests for approval in technology.", "Date": "January 17, 2011"}, {"Title": "Como lo describian...", "Author": "Mauricio Moreno (Merida-Vzla)", "ReviewID": "RAU5UFD08MF3D", "Overall": "5.0", "Content": "Los telefonos llegaron NUEVOS con todos sus accesorios y en sus cajas originales, el envio fue super rapido y los smartphones como los describian llegaron desbloqueados, con las bandas que describen y levantan 3G en Movistar Venezuela, recomiendo al vendedor plenamente...", "Date": "September 6, 2012"}, {"Title": "Excelente Producto", "Author": "Victor Alvarez", "ReviewID": "RHRWF794AEX1D", "Overall": "5.0", "Content": "El equipo, fue recibido nuevo como lo publican, fue enviado con todos sus accesorios originales, es un gran equipo, funciona con operadoras como movistar y movilnet en Venezuela levanta 3G, estoy muy feliz con mi teléfono, es nuevo de paquete, sus funciones todas operativas teclado, pantalla, cámara entre otros sin duda alguna una gran empresa producto de calidad!!", "Date": "July 5, 2012"}, {"Title": "excelente compra", "Author": "Danie R", "ReviewID": "RF5C8SR7PKROZ", "Overall": "5.0", "Content": "Un excelente articulo el cual me llego antes de lo esperado con todos sus accesorios y en buen estado excelente para movistar y movilnet 3G en venezuela gracias.", "Date": "June 16, 2012"}, {"Title": "QUESTION", "Author": "MELISAD", "ReviewID": "R1JH7G89M9YP30", "Overall": "5.0", "Content": "HI! I JUST WANT TO KNOW IF I CAN USE THIS CELLPHONE IN ARGENTINA, IAM NOW LIVING IN USA BUT I LL TAKE IT WITH ME TO ARGENTINA AND PUT MY ARGENTINIAN SIM CARD, WLL THAT WORK? THANKS!", "Date": "January 30, 2012"}, {"Title": "My New Smartphone Torch 9800", "Author": "Elmer Gonzalez Herrera", "ReviewID": "R2SKKNPQPHQUQU", "Overall": "5.0", "Content": "I think that my blackberry AT&T; Torch 9800 is working as I just expected, since it belongs to the cutting edge technology. It means it is a worderful device that keep me updated every day and it is really dinamic and very helpful in my current job as a Dean of Engineering School in a peruvian university in South America.Sincerely,Elmer Gonzalez", "Date": "April 29, 2011"}, {"Title": "Blackberry Torch!", "Author": "FLUTTER", "ReviewID": "R1KGZV5VZR99M9", "Overall": "4.0", "Content": "I have wanted this phone since it came onto the Market!  Since I am not with AT&T;, it was hard to find one less than $500.  I finally found this one for and I was told it was like new (used only 3 weeks). However, when the seller knew I was going to really purchase, he/she went up on the price!!! Considering that the phone had dings and scratches, and did not come with all the original parts, I thought this was a bit unfair.  I think purchases like this, should be required to have close-up photos, original paperwork and sellers should not be allowed to jack the price up without notice to possible buyers. After it was said and done, I could have bought a new one from Amazon for the same price, without the dings/scratches and with all the original parts for about the same price! I thought the packaging for mailing was lacking... at least for an expensive item like this one. The seller was pleasant and responsive to my emails and seemed to be a nice person. The phone works well thus far, and overall, I'm satisfied.", "Date": "April 8, 2011"}, {"Title": "Awesome!", "Author": "Devilfish", "ReviewID": "RUPJFFM7VP7H5", "Overall": "5.0", "Content": "Beautiful piece of machinery, the 3G speed works way better than any other phone in my country. I would like to give a million stars rate for this awesome phone!", "Date": "April 5, 2011"}, {"Title": "I Love my Blackberry", "Author": "Mzzshyne", "ReviewID": "RBP3CD0MQAQ37", "Overall": "5.0", "Content": "I got my blackberry today and i absolutely love it. It is unlocked as promised which means when I put in my sim from my kuwaity phone it worked no problems! This retailer is excellent!", "Date": "April 4, 2011"}, {"Title": "Great phone", "Author": "Michael L Hensley", "ReviewID": "R1BA27ZM4N6BWW", "Overall": "4.0", "Content": "This Phone replaced a Blackberry 8830. This phone is a lot easier to use. this phone has a lot of apps and works a lot easier", "Date": "April 4, 2014"}, {"Title": "Great gift", "Author": "Connie Basenberg", "ReviewID": "R1XAY5NV4UFK2D", "Overall": "5.0", "Content": "Was a birthday gift for my son and he loves it! Now we can stay in touch all the time.", "Date": "February 4, 2014"}, {"Title": "Phone was fake", "Author": "Tray Lon", "ReviewID": "R3JFN69JAPDLSU", "Overall": "1.0", "Content": "I bought this after my first one broke. I compared this one to the exact same model as my wife's T Mobile version and the crap was totally fake. When you slide the phone up, the back part of the phone was supposed to be \"black\" like my wife's but mine was \"grey\". The battery was made in Japan my wife's was made in China. I had a black berry logo in the top middle of the back cover below the camera in white letters and the back of my wife's phone did not. Her's had a description of the camera size and its capabilities. Her's said something like \"2.5 megapixels\". The screen kept freezing over and over which was pissing me off.Lastly the got damn red power button/ hang up button did not work unless I pushed it down HARD and it didnt even make the clicking noise nor could I feel it like I was pushing a \"button\". I wish I had pictures of all the comparisons to support my argument but after about a month of tolerating this phone and the broke power button and being unable to hang up after a conversation having to rely on the other party to hang up first, I slammed the phone into a million pieces and went and bought me a Galaxy S3 Mini which has not given me ANY problems like this stupid phone did.", "Date": "December 16, 2013"}, {"Title": "second 9800", "Author": "D.Leith", "ReviewID": "R1N5LRCKAPCWQK", "Overall": "5.0", "Content": "multi function fully loaded easy to use great memory and condition hoping to get a next one soon at the same price lol.", "Date": "May 11, 2013"}, {"Title": "Nice phone", "Author": "ClLy", "ReviewID": "RTEQ980VOOMCO", "Overall": "4.0", "Content": "Like a blackberry and smart phone all in one. Seems really nice and looks as though it is new and clean, it didn't come with the CD software, will need to inquire about that. I will say that it does seem a little more effort to slide up the phone that what I would like but I'm glad to have the physical keyboard. (it also has the virtual touch screen keyboard too.", "Date": "April 27, 2013"}, {"Title": "excelente", "Author": "irving brea", "ReviewID": "R3O0CKPL16CTBC", "Overall": "5.0", "Content": "buen producto, cumple con lo esperado y me parecio un buen precio. esta marca la usa toda la familiamuchas gracias", "Date": "March 12, 2013"}, {"Title": "Excelente", "Author": "Joel Perez", "ReviewID": "R36BN6AMYU4LAV", "Overall": "5.0", "Content": "Aunque la entrega fue muy larga me encuentro sastisfecho por el producto todo ok de acuerdo a lo solicitado .", "Date": "March 12, 2013"}, {"Title": "excelente", "Author": "Isabel Romero", "ReviewID": "REJZUFY38O56O", "Overall": "5.0", "Content": "todo muy bien el telefono en excelentes condiciones 100% recomendado no estuve problemas todo fue muy bien tal y como lo anuncian", "Date": "March 9, 2013"}, {"Title": "Very usefull cell phone", "Author": "Cedeno Johanna \"Leonardo Villarroel\"", "ReviewID": "R3S68GWETFY5SI", "Overall": "5.0", "Content": "Phone The Blackberry Torch 9800 is a very complete and useful phone for both office work and for the use of many useful tools for different types of needs!", "Date": "February 5, 2013"}, {"Title": "A TOMMATO CAN AND WIRE WOULD BE BETTER.", "Author": "PW", "ReviewID": "RTS87YHY9P1PP", "Overall": "1.0", "Content": "A bonfire piece of crap. Goes haywire 3 or 4 times a week, e.g., screen icons will not appear and phone will simply not work. Constantly need to reboot.My wife bought an unlocked I phone the same time I purchased this lemon, cost a lot more but works far better, and is far more user friendly. Like driving a BMW vs. a pinto.Don't even think about it. Buy ANTHING ELSE, but not this piece of crap.", "Date": "January 29, 2013"}, {"Title": "ADA", "Author": "ada de barroeta", "ReviewID": "R30YG6CD7T1C2U", "Overall": "5.0", "Content": "excelente producto funciona perfectamente sin ningun tipo de falla  no tuve problema alguno con el y el envio fue rapido", "Date": "January 5, 2013"}, {"Title": "Muy buen producto, desde Vzla 3G movistar y movilnet", "Author": "emmanuel marquez", "ReviewID": "R25IKTMBLNT8PN", "Overall": "4.0", "Content": "muy buen producto, llego con todo lo dicho en la publicacion, levanta 3G en venezuela con movistar y movilnet, mas algunos extras que mando el vendedor. no tengo de que quejarme hasta el momento", "Date": "December 30, 2012"}, {"Title": "Todo Excelente", "Author": "Gabriela Rios \"Gabiar77\"", "ReviewID": "RZWAL6TTWF72Y", "Overall": "5.0", "Content": "El envió fue muy rápido, el producto llego en perfectas condiciones y como se describía en el anuncio. recomendado 100%", "Date": "December 25, 2012"}, {"Title": "excellent phone ... I love ...", "Author": "david", "ReviewID": "RJKS7JBRTXPES", "Overall": "5.0", "Content": "I bought this phone for my nephew .. to see him is the maximum encato tells me, keeps saying wonders .. I told him that I bought on amazon and told me to thank them for sending the phone was very fast and well protected .. thank you very much", "Date": "December 21, 2012"}, {"Title": "RECOMMENDED", "Author": "Liliana", "ReviewID": "R13NIYNW6FJHRP", "Overall": "5.0", "Content": "I bought the phone for my son as a christmas gift. when preparing to write a review for it i asked him to rate it for me and tell me how to rate it. he said he gives it 50 billion points so if 5 stars is worth that much then thats what he chooses. he says it is amazing and he falls more in love with it each day he has it. so, i can give what i can only assume to be a great review of this product. it defiantely passes a teenagers tests for approval in technology.", "Date": "December 18, 2012"}, {"Title": "Product quality is good", "Author": "sokabaru", "ReviewID": "R3A59PEVATLA3A", "Overall": "5.0", "Content": "Product quality is good .. is according to the price paid .. recommend this product is just what I needed", "Date": "December 10, 2012"}, {"Title": "excellent", "Author": "freddy cedeño", "ReviewID": "R1BSVETI61UFTJ", "Overall": "5.0", "Content": "excellent care, the product is such that it was described, I recommend to have in mind when they wish to shop ...", "Date": "July 3, 2012"}, {"Title": "muy bueno", "Author": "José", "ReviewID": "R3A01B3TBQ5SC0", "Overall": "5.0", "Content": "muy bueno el articulo lo recomiendo muy buenos vendedores me llego hace una semana aun lo tengo en periodo de prueba y hasta la fecha no me ha fallado", "Date": "June 25, 2012"}, {"Title": "pregunta", "Author": "carlu75", "ReviewID": "R7LF16T567FHY", "Overall": "3.0", "Content": "hola quisiera saber si este equipo es desbloqueado y si me sirve para usarlo en venezuela y si tiene garantia cuanto tiempo dan gracias  !!!", "Date": "June 23, 2012"}, {"Title": "Justo lo descrito.", "Author": "NachoVillaBar", "ReviewID": "RV2U7N3FMCU3O", "Overall": "5.0", "Content": "Compre este teléfono porque me gustaba mucho y acá en mi país es muy caro, cuando me llego funciono a la perfección, tanto así que con otros cupos de dólares le compre uno también a mi novia.", "Date": "May 2, 2012"}, {"Title": "buen telefono", "Author": "jesus trillo", "ReviewID": "R889U9EAOLBG9", "Overall": "5.0", "Content": "el telefono fue como lo describio la tienda. me llego a tiempo y le funciono la banda 1900 por que at&t; tambien utiliza esa banda.", "Date": "February 6, 2012"}], "ProductInfo": {"Price": "$129.99", "Features": "Wireless Networks Quad-band GSM/GPRS/EDGE networks: 850/900/1800/1900MHz Tri-band 3G UMTS networks: 2100/1900/850 MHz (North America/Europe)\nData Input & Navigation Trackpad located on front face of device, ESC key to the right\nDisplay 3.2\" HVGA+ touch screen (480x360) Font size (user selectable)\nCamera & Video Recording 5 MP camera\nBattery & Battery Life 1300 mAHr removable/rechargeable lithium-ion cell Standby Time:", "Name": "Unlocked AT&T Branded Blackberry Torch 9800 Smartphone", "ImgURL": "http://ecx.images-amazon.com/images/I/41A5tSHLEYL._SY300_.jpg", "ProductID": "B00427WLKY"}}