{"Reviews": [{"Title": "Great Phone", "Author": "Edward", "ReviewID": "R39UKBEGWYNMLW", "Overall": "5.0", "Content": "I recently purchased this phone after I received a $75.00. Amazon gift card.  And I can tell you I am 100% satisfied with this product.  I ordered it from Guybuy, and the phone showed up a little banged up here and there, but I did not care about that.  The phone has sort of grainy graphics, but yet again, at the price, you cannot expect better.  Also, it is faster than my Android phone, and easier to manage and jailbreak.  The phone did not charge at first, but I did a factory reset, and the probelm was gone.  If you are looking for a affordable phone with a touchscreen, or if you wan a piece of electronic history, I highly recommend you buy this.", "Date": "November 9, 2012"}, {"Title": "Awesome phone!!!!!", "Author": "Noah", "ReviewID": "R3LPFNXWIT7D1Z", "Overall": "5.0", "Content": "Don't listen to the bad reviews. They were probably just expecting a new very fast iPhone. It's exactly what I was looking for. Well worth the fifty bucks!", "Date": "January 8, 2013"}, {"Title": "good", "Author": "robert", "ReviewID": "R15ESI9ZG4VS4T", "Overall": "5.0", "Content": "i loved it. it work good.I absolutely love this! Bought one for a friend for Christmas. I would recommend this for anyone who loves", "Date": "January 2, 2014"}, {"Title": "Buy it and you will never regret", "Author": "Brian K", "ReviewID": "R2D659JEAEVREH", "Overall": "5.0", "Content": "Everything is perfect. The seller sent the most mint condition iPhone and it deserves $115.It is 4GB , which is really rare, and with such a great condition, you will never regret.", "Date": "October 28, 2013"}, {"Title": "Amazing", "Author": "jake farr", "ReviewID": "R250UP1VKMAW3Q", "Overall": "5.0", "Content": "This is without a doubt, my favorite iPhone. I have the iPhone 5 but I really wanted to try this out. I ordered this online and it was quickly at my door within a few days. Condition is exatly as stated. Minor scratches here and there but no scratches on screen. Every part on the device works, it hasn't suffered any hardware dammage. Battery is amazing too. I didnt have to charge it for a week because it came already charged and with charger cable.Pros: Its an iPhone that works as an phone and iPod. Good condition.Cons: It basically can't be used for apps from the appstore (WHICH IS STATED IN DESCRIPTION) and I knew this before I bought it, just want everyone to understand this.Great buy!", "Date": "May 10, 2013"}, {"Title": "perfect", "Author": "alejandrodoz", "ReviewID": "R822WTCKP0WE5", "Overall": "5.0", "Content": "todo perfecto como lo describianlo recomiendo.. sigan asi..todo perfecto como lo describianlo recomiendo.. sigan asi.. mejor imposibletodo perfecto como lo describianlo recomiendo.. sigan asi..todo perfecto como lo describianlo recomiendo.. sigan asi.. mejor imposible", "Date": "March 12, 2013"}, {"Title": "Very disappointed", "Author": "Reviews1090", "ReviewID": "RBI4QHTTP8BHE", "Overall": "1.0", "Content": "If you don't feel like reading the whole thing, here's the basics. -Broken power button -Broken digitizer (touch sensor)What you get: iPhone, White Generic Amazon box, Generic Sync Cord, Generic Apple-looking Headphones with MicI bought this phone from the Amazon Warehouse deals. It was describe as \"Used- Good condition, 100% functional\"I got it and it must have been in the warehouse for a while as the battery seemed to be dead for a long period of time. The iPhone charger had no effect on it (5W), so I left it on my iPad charger (12W), after 2 hours it finally got a charge of 20%. It was like I had to jump start it. It took a while to charge but not so long to drain :(Then it was on the connect to iTunes button. I restored, activated and it was working great. Then I tried to use the phone. Slide to Unlock was not working. Right away I knew the touch screen (digitzer) was dead. Replacing these things are cheap but a real pain, but, WHY SHOULD I HAVE TO REPLACE IT? I JUST BOUGHT THIS IN \"100% WORKING CONDITION.\" I did another restore with a new 3.1.3 firmware file from a third-party and same thing.  I loaded music on it and tried using the lock screen music controls. The top half of the phone worked, the bottom half (most important part of the phone) did not.Also I wanted to shut down, or try a soft reset but the power button didn't work! No matter how hard I pressed.I restored the phone, put it back in its box & I already filed the return, got an RMA #, and label. Going back. I read the horrible reviews on this product here on Amazon but as a techy I thought I could find a work-around.1/4/2013 -JANUARY FOURTH 2013I ordered this phone also to do the AT&T; unlimited data loophole.IT DID NOT WORK. Luckily this did not require me using the screen :P I inserted my SIM, activated, and got no message, just single bars. I downgraded from iTunes 11 to iTunes 9.0.0 and deactivated the iPhone. I started again and got the same result. I left my SIM card in their hoping they would automatically add the data plan. Never happened. I went on the myAT&T; website to see my data options. There was none. The data plan section was COMPLETELY blank, no data or SMS options. Damn, AT&T; got good. So I had them update my IMEI to this iPhone. Still nothing. I called, and even tried chatting, they had no access to Unlimited Data, not even 2G Unlimited Data. The system wouldn't allow an over-ride. So save a trip and don't bother for the unlimited data. It's been 100% patched.", "Date": "January 4, 2013"}, {"Title": "phone stinks", "Author": "charris", "ReviewID": "R2EKUJKD7M6J16", "Overall": "1.0", "Content": "the phone doesnt keep charge and doesnt work right wasted my money thanks agian amozon this is third phone ive bought and all of them didnt work im tired of spending good money never order agian", "Date": "September 4, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "iPhone 2G\nSize 4 GB", "Name": "Apple iPhone 2G 4GB (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/415zEu8xgBL._SY300_.jpg", "ProductID": "B004ZLV4A0"}}