{"Reviews": [{"Title": "somewhat disappointing", "Author": "Rachelle Adams", "ReviewID": "RIGU5WV8U3NA6", "Overall": "3.0", "Content": "I do like this phone and in many ways it's an upgrade from my previous phone.  However, I can definitely tell it's an earlier version of the Android operating system.  I don't understand why there is no autocorrect and/or spell check in the texting application.  I checked all the setting and even downloaded the manual but in the end had to purchase an app called SwiftKey to spell check my texts. Plus, this particular phone has a glitch on the touchscreen which creates a \"dead zone\" in the top quarter of the screen that doesn't respond to touch.  This is very frustrating, especially with apps that do not rotate, such as Instagram.  I cannot edit my Instagram profile because the \"profile\" button falls right in the dead zone.  I have to rotate the phone almost all the time to access any buttons that lie in the top quadrant of the screen. Furthermore this phone has a TERRIBLE battery life, it runs out of charge in only a few hours, even if I'm barely using any apps. I guess I got what I paid for and shouldn't expect more from a used phone.", "Date": "July 2, 2013"}, {"Title": "loving the phone will shop with u always thanks", "Author": "Terry Thomas", "ReviewID": "RNZ0EYBGR59WH", "Overall": "4.0", "Content": "yes it did haven't had any  problems with the phone at all my son love's it an it was a great price", "Date": "September 10, 2013"}, {"Title": "kinda disappointed", "Author": "peaches", "ReviewID": "R16HYUCNLEGRO8", "Overall": "2.0", "Content": "The phone is in good shape and I was pleased with that and the phone, but when I tried to update the phone it wouldn't update. I tried geting help from sprint and they couldnt help, they sent me to a sprint store that handles that problem but the couldnt do anything either,they told me I had to get a different evo, because there is something wrong with the system, so I not happy about that, so I dont thing I will ever buy a electronic product from a online store unless its brand new.", "Date": "March 15, 2012"}, {"Title": "awesome", "Author": "acidovorax", "ReviewID": "R1L5YNA8RJF9BU", "Overall": "5.0", "Content": "This phone is awesome. Its everthing you need in a smart phone. The slide out keyboard is very useful and a lot easier to use than the regular touch keyboard.", "Date": "March 11, 2012"}, {"Title": "Awesome Phone", "Author": "Stephen", "ReviewID": "R3GY7WKASAR2DP", "Overall": "4.0", "Content": "This is the second time I've purchased this phone and I would do it a third time as well. The Evo Shift is a great and durable phone, my last one fell into the Colorado River with me and still worked for 6 Months! I love the keyboard and the 4G capability. This phone is your best bet for the price.", "Date": "January 17, 2012"}, {"Title": "was not like what i throught", "Author": "Angelle", "ReviewID": "R1P2F4GNIEK66", "Overall": "2.0", "Content": "its nice.... thats about all i have to say about it. lets just say if i didnt need a phone badly.... i would send it back the day i received it", "Date": "July 22, 2013"}], "ProductInfo": {"Price": "$179.99", "Features": "821793007829", "Name": "HTC EVO Shift 4G", "ImgURL": "http://ecx.images-amazon.com/images/I/41jtcAsc8LL._SY300_.jpg", "ProductID": "B004V3XM9S"}}