{"Reviews": [{"Title": "Awesome Phone, Samsung Galaxy S 4G", "Author": "Wil", "ReviewID": "RL4NHWY2DCNM8", "Overall": "5.0", "Content": "Awesome phone, works great. I have to admit I was a little worried at first. I purchased 3 of these phones from this seller and only 1 would register on t-mobile's network. I returned 2 of the phones to the seller and they shipped me 2 more new phones. They worked perfect. Excellent cutomer service, they resolved the problem without any hassels. I would definitely purchase from them again. Thanks!", "Date": "September 16, 2011"}, {"Title": "Samsung Galaxy review", "Author": "Maqbool Salam \"ms\"", "ReviewID": "R2RFHPGI0S0BR4", "Overall": "5.0", "Content": "This device is phenomenal and is fun to use. The texting thing is really easy and u can just move ur finger on the key board without taking it off. Graphics are excellent. I love it. Get one. You will be delighted.", "Date": "October 4, 2011"}, {"Title": "Is This Phone Truly 4G?", "Author": "Carlos", "ReviewID": "R3USJV7GPTWBPZ", "Overall": "4.0", "Content": "you can take a﻿ screenshot where the phone say that is connected to HSPA+ or HSPA network type. you have to go to settings, about phone, status, network type. and there tell you what network type you are connected. i have this phone and the only networks i have is GPRS, EDGE, UMTS, HSDPA. i wants to see if this phone is truly 4g.", "Date": "April 25, 2013"}, {"Title": "Very nice phone", "Author": "Chrstine M.", "ReviewID": "R3TQAHC113WBQL", "Overall": "4.0", "Content": "I bought this phone for my husband, thinking it was unlocked. But, when we got the phone we found out it wasn't completely unlocked. We had to do that ourselves. But with all the tools online it was easy to figure out how. So, if it didn't come as advertised, why the 4 stars? The phone quality, the battery life, the product itself is, simply put, excellent quality. As soon as it was unlocked, my husband was able to start customizing it, downloading apps, and making it everything he needed. It's also stood up to the real product testers. Our 4 year old and 2 year old. They have both played with it,dropped it, thrown it, watched their shows, and played games on it and it is still running without a hitch! :)", "Date": "September 9, 2012"}, {"Title": "Galaxy S", "Author": "Dani", "ReviewID": "R29PYO7SXOLE2R", "Overall": "4.0", "Content": "I have had the phone about 2 days now. It is pretty much as I expected. I am unable to use some apps because the phone is unlocked, or not rooted- whatever all of that means. I have t-mobile, and it's a t-mobile phone, so I am trying to figure out how to either relock it or reroot it. Otherwise, my only other complaint is that the phone was supposed to have the movie \"inception\" on it, but it's not there. The icon for it is there, but the file cannot be found. So, a bit disappointed that it was removed. And I'm pretty sure I'm going to have to get another battery, I of course have been playing with the phone alot in the last two days to see what all it can do, and I'm only getting a few hours out of the battery. Over all, I'm happy with my purchase, only 3 minor disappointments.", "Date": "October 9, 2011"}, {"Title": "A+", "Author": "MIsael", "ReviewID": "R2SZ5WEYWJHGDZ", "Overall": "5.0", "Content": "Came with everything charger battery and even a micro sd card im happy i bought from here has some minor scratches but that's to be expected", "Date": "December 17, 2012"}, {"Title": "Horrible phone", "Author": "Hicham", "ReviewID": "R38IBMYOQLZTLZ", "Overall": "1.0", "Content": "it is horrible phone,sim card slot no good,i had to buy new one,but it still the same problem,also battery does not last long,do not buy it", "Date": "August 20, 2012"}, {"Title": "Could be better", "Author": "crisjoyc", "ReviewID": "R2Q8DV9D6PL4KU", "Overall": "3.0", "Content": "I bought this phone used so I cant really say too much but this phone froze up on me several times.  also, the camera is not as good as I thought it would be.  I had the motorola triumph prior to this phone and the pics looked better.", "Date": "October 31, 2011"}, {"Title": "It works well", "Author": "UyenBui", "ReviewID": "R3OU6R5K271JU", "Overall": "4.0", "Content": "I'm satisfied with the phone, but have to say that the battery is weak. I can use about more than 1/2 day and have to charge again. Besides of that, everything is okay. It is not really fast but acceptable. Strong point is the color is very beautiful.", "Date": "September 7, 2011"}, {"Title": "not good", "Author": "Eric chalas", "ReviewID": "R2RI9AJH8LJ92P", "Overall": "1.0", "Content": "the samsung galaxy's the lnternet not working went put the sim card lnternet not work on any company number one t-mobile", "Date": "July 24, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Samsung Galaxy S 4G 3G, 5MP Camera, GPS, WIFI, Touch Screen, Android 2.2 Froyo Unlocked T-Mobile Smartphone US Version", "Name": "Samsung Galaxy S 4G 3G, 5MP Camera, GPS, WIFI, Touch Screen, Android 2.2 Froyo Unlocked T-Mobile Smartphone US Version", "ImgURL": "http://ecx.images-amazon.com/images/I/41FXhwkSVaL._SX300_.jpg", "ProductID": "B004UBCNSC"}}