{"Reviews": [{"Title": "Tough, touchscreen, WiFi, GPS, & Android", "Author": "W. Quirk \"Quality Over Quantity\"", "ReviewID": "R28Q5JHYRUHQQU", "Overall": "4.0", "Content": "Great product for someone looking for an unlocked affordable phone. For me it was a no brainer because I did not want to pay for AT&T;'s data plan, but I wanted internet for e-mail and social networking. The WiFi works well though occasionally it will fail to auto connect. I love that it runs Android especially since I use many Google products including Google Mail, Google Calender, and Google Documents... I am also very impressed with how tough this phone is. I drop it all the time and have yet to have anything break on it. When I say drop, I mean a 4 foot drop onto concrete. I did not choose to get any kind of case, or screen protector yet everything is still functioning after a years worth of rugged use. Granted, I have small scratches all over the screen but it doesn't affect the function. Of course, there are hundreds of android apps you can take advantage of including Pandora's app, Google Maps, and Angry Birds.RecommendationsSome games (Word with Friends) for what ever reason are designed to not download onto this phone model however the app \"Getjar\" is a simple solution.The GPS settings are out of whack when you get the phone but there are many simple directions online in how to change them.Run the app \"Advanced task killer\" to maximize your battery life and speed of phone by killing apps running in the background.", "Date": "February 7, 2012"}, {"Title": "Very small screen to use for texting", "Author": "Kelley R. Allen \"kaninekeeper\"", "ReviewID": "R2G7VQD9ULBUCC", "Overall": "2.0", "Content": "I really do not like this phone.  It took me 5 minutes to send a text because the screen is very small and very sensitive.  If you can get used to that then it is a good little phone.  As far as the seller (Wireless Everything), the phone is NOT from the US:  the adaptor was European and the phone was in Spanish.  Frustrating, but not a deal breaker, just be aware of what you may be getting.  I am with Tmobile and did not have any trouble getting it up and running.", "Date": "January 2, 2012"}, {"Title": "Its quite good!", "Author": "demian", "ReviewID": "RE2353I0ZJJWY", "Overall": "4.0", "Content": "Well the one i've bought is quite new, so i havent really had any problems with it so far, well, except probably the touch screen might not be as good as the one in an iphone, but what you expect? it costs a lot less! Oh and I had some problems when I selected the option of chaging the screen sideways or frontways when you tilt your phone when u want to use it horizontally, it seems to take a bit to recognize the direction the screen should go! Anywats, any other than that its a pretty good phone! I like it!", "Date": "November 25, 2011"}, {"Title": "save your $$", "Author": "meinfla", "ReviewID": "R2MHEJ4OOEWPAM", "Overall": "2.0", "Content": "I had to manually enter apn data from T- Mobile to get it working.Touch screen is over sensitive most of the time and too small for internet browsing. Other times it takes a few taps for the apps to open.Unit really consumes  a lot of battery power, especially when on wifi. Added a task manager which helped.Controls, functions real buggy, go on and off independent of user.Save your money, get a newer unit with latest firmware and much bigger screen.", "Date": "January 2, 2012"}, {"Title": "Headsup!", "Author": "AgentKLM", "ReviewID": "R1MJFG8E3E97JT", "Overall": "3.0", "Content": "BUYER BEWARE: Seller sent bad adaptor for US, blew circuit in house. I was lucky the phone was not plugged in to the adaptor or it could have been damaged. NOTE: Phone cannot be updated to android Froyo 2.2 via Samsung Kies, which means you will not get to use all of the phone's features.Other than that phone is working good.", "Date": "December 31, 2011"}, {"Title": "Most frustrating phone I've used", "Author": "B. McComb", "ReviewID": "R39XUX8BYJCPFS", "Overall": "2.0", "Content": "Full of bloatware branded for some other company. Came with 2.2, none of the existing APK based rooting methods worked. Took 2 days of installing drivers and unplugging USB cables before my PC could detect it - my Android based LG phone literally only takes the time to download the drivers before it's detected. Ran Odin to put ClockworkMod on the first and last time it detected the device. Odin was pushing CWM for 30 minutes before I pulled the plug and hoped it wasn't bricked. Of course it was so it has to go in for repair. I would try pushing back the a stock ROM with Odin but I've only ever been able to get it recognized by my PC once.It should not been this hard to have it detected by a computer. The required (because it installs the Samsung drivers) Kies software is junk.If you don't mind the included software and want to stay with the stock options then it's a good, basic Android phone. Just don't expect to get a CM7 port on it, or even root it.", "Date": "December 20, 2011"}, {"Title": "A five star phone for the price. Resistant as a rock.", "Author": "Pictogram", "ReviewID": "R16YE1TRY4VFOS", "Overall": "5.0", "Content": "A five star phone for the price. Resistent as a rock since it is light weight, I have also use it in many countries with diferent carriers and works very well. I recomend this to anyone who wants tecnology and also wants a shock resistant phone for a reasonable price.", "Date": "December 20, 2011"}, {"Title": "Received the phone with Android 2.2", "Author": "Tony \"Tony\"", "ReviewID": "R18KLAACZGXGMI", "Overall": "5.0", "Content": "I received this phone with Android 2.2 installed already. I have no complaint at all. I love the phone and it is fast. It is clear that this is UK version but with Android 2.2 installed who care?", "Date": "December 10, 2011"}, {"Title": "What I needed, when I needed", "Author": "David Zambrano", "ReviewID": "R3DOP9NK5OTHPW", "Overall": "4.0", "Content": "The phone was just what I expected, after looking and reading reviews of many phones, this phone was just what I needed to keep in touch. not much accessories for it, though", "Date": "February 25, 2013"}, {"Title": "Instructions in Korean!", "Author": "Loretta Ferguson", "ReviewID": "RCRYYF0WS37XI", "Overall": "1.0", "Content": "We bought this phone because we like Samsung phones.  We received the phone.  When we started to use the phone we referred to the manual and all of the instructions were in Korean.  There was no english version.  We could not figure out how to use the phone properly so we sent it back.", "Date": "December 17, 2012"}, {"Title": "Great product", "Author": "Sanjay Rohilla", "ReviewID": "R1K7P9I29WH7ZY", "Overall": "5.0", "Content": "I would recommend this to others also. This is a great product which can be used. I would love it.", "Date": "December 3, 2012"}, {"Title": "Very good product for the price", "Author": "Abhi", "ReviewID": "R21NCXOGR1KYFW", "Overall": "4.0", "Content": "its a nice phone for the price and I have already recommended this to my friends. Have almost all features including wifi , GPS , live streaming capailities etc. 4 stars since it hangs once in a blue moon. But it will be ok after a restart. looking for a car charger now as I am using this as GPS for long trips. not sure if galaxy S charger fits for this one", "Date": "November 26, 2012"}, {"Title": "Great product!", "Author": "Jan G.", "ReviewID": "R1ZICW9WBRJDG2", "Overall": "4.0", "Content": "The phone arrived a little over a month ago in the condition, brand new, which the seller described, and it's been working great since! Included in the box were the following: phone, charger with adapter (I think the phone was originally released in the UK; the charger, inclusion of the adapter, and the British versions of words in the dictionary are my proof), and manual. There might have been a software CD or something similar too but I don't remember. I'm not big on that anyway so not really a big deal for me.Pros: I'm using it with one of AT&T;'s prepaid (Go Phone) plans. Signal strength is great, call quality is excellent (occasional dropped calls, not sure if the network or the phone, but no biggie), and touch screen is very responsive. Battery life is amazing, just like I'd expect from a Samsung phone. With a few hours of web and Pandora usage, moderate amount of texting, and relatively short (less than 7 minutes) calls, the battery lasts around two days, longer if I spend less time on the phone.Cons: It's a bit annoying trying to touch/select options towards the top and bottom edges of the screen. I think the screen itself is a bit small, but web pages look good nonetheless since there's a zoom option. There were some instances of the OS lagging a bit, mostly when I played downloaded games (I use WiFi because I don't need data) and some when using the web, but not too terrible. The screen and lag issues are the only reasons I can't give a five-star review.This is my first smartphone, and though it was originally released two years ago, I think it's a great product for the price. I've always been a HUGE fan of Samsung products because my longest-lasting ones before this one were also Samsung  (first and second plus the one I had abroad; I had terrible Sony and Motorola phones for very brief periods before switching back to Samsung). Samsung makes durable, stylish products with great features and this one definitely fits the bill.", "Date": "November 10, 2012"}, {"Title": "Excellent.", "Author": "daniela", "ReviewID": "RT7EQ82Y5YITG", "Overall": "5.0", "Content": "Good service, good product, very good with no problems. Bring all the product described here, good resolution camera, 1GB memory card, many features.", "Date": "November 9, 2012"}, {"Title": "Good basic phone", "Author": "Barbara M. Martinez", "ReviewID": "R3RU7N7WGK9H8Y", "Overall": "3.0", "Content": "I have been using the phone for about a year now. I do not listen to music, play games, or take pictures with the phone. The primary functions I use are texts, calls and just a bit of Internet surfing when I'm bored on the trams. It works perfectly for calls and texts. It is a bit slow on Internet surfing. Internet surfing, games, and pictures kill the battery quickly. In fact, just one picture drains the whole battery. I have no idea what version of Andriod is on the phone, but it is not a priority for me.For a basic, inexpensive, unlocked phone, this one is perfect. I got it to take to Europe on a temporary work assignment and just got a SIM card in Europe. The electrical plug was even European on my phone. It would not be good for gaming or apps. I also cannot fine a replacement battery. When it dies, the phone becomes a paperweight.", "Date": "June 23, 2012"}, {"Title": "great phone", "Author": "Michelle Reyes", "ReviewID": "R2JWIKEGBFOG0N", "Overall": "5.0", "Content": "i got this phone and easily i can say its the best phone i have so far. its so user friendly and i live in a country where we are limited with features. but access to social networks are super fun and to get my favorite music and apps on this phone is a breeze. i love it. i even have my kindle on it and makes it easy to use and loads quickly. the pics are great and i can edit them and upload to my FB account super fast. its my best friend :-)))", "Date": "May 17, 2012"}, {"Title": "crap!!!!!!! this is crap!!!", "Author": "Michelle", "ReviewID": "R21EQI4AIQBUZ0", "Overall": "1.0", "Content": "the worst service in the world if i could begin to explain the crap that this company is worth it is worth no friggen thing his company sucks i would be better off going to new york to pick up this crap if i could give it no stars i would it is trash", "Date": "January 10, 2012"}], "ProductInfo": {"Price": "$169.99", "Features": "This unlocked cell phone will work on GSM carries like AT&T; and T-Mobile. Not all carrier features may be supported.\nUnlocked Quad-Band cell phone compatible with 850/900/1800/1900 GSM and 3G HSDPA 900/2100 Mhz frequencies plus GPRS/Edge data capabilities\n2 MP Camera with Geo-tagging, smile shot and video Recording, Android OS, v2.1 (Eclair), upgradable to v2.2\nGoogle Search, Maps, Gmail, YouTube, Social networking integration, Media Player, Organizer, SMS(threaded view), MMS, Email, Push Mail, IM, RSS\nTalk time up to 9 hours - Standby up to 520 hours.\n2 MP Camera with Geo-tagging, smile shot and video Recording; Android OS, v2.1 (Eclair), upgradable to v2.2; GPS Navigator with A-GPS Support; Wi-Fi 802.11 b/g/n, DLNA, Wi-Fi hotspot (Android 2.2) and Stereo FM radio with RDS.\nAccelerometer sensor for UI auto-rotate and microSD (TransFlash) up to 16GB\nGPS Navigator with A-GPS Support; Wi-Fi 802.11 b/g/n, DLNA, Wi-Fi hotspot (Android 2.2) and Stereo FM radio with RDS.\nGoogle Search, Maps, Gmail, YouTube; Social networking integration; Media Player; Organizer; SMS(threaded view), MMS, Email, Push Mail, IM, RSS; Accelerometer sensor for UI auto-rotate and microSD (TransFlash) up to 16GB.", "Name": "Samsung I5500 Galaxy 5 Unlocked Phone with 2 MP Camera and and Stereo FM - US Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41KioQ9lFML._SY300_.jpg", "ProductID": "B0043VTBD4"}}