{"Reviews": [{"Title": "Simple but effective", "Author": "Gurnis", "ReviewID": "R1ZT6Y5O5PW4QF", "Overall": "4.0", "Content": "If I had to choose one word to describe this phone, it would be \"ample\". The colors are ample, the design is ample, the functionality is ample. Its a very simple phone that anyone can learn to master in a few days if not a few minutes. Even my \"digitally challenged\" mother could learn to use this phone. The Factor allows you to talk, text, IM and even email. The camera is probably the most lacking feature. But if you take a pic of something large like a boat or a travel trailer, your friends will at least be able to figure out what the object is without all the fine detail. Pics sent TO the phone are far better quality than any pics sent FROM the phone. The poor quality camera, and the absence of a standard head phone jack, are my reasons for only a 4 star rating. But some things about this phone actually work better than expected. Surfing the web is made easier by downloading the \"Opera Mini 3\" browser (low memory version).This allows you to access the web without having to navigate thru all the crap that Boost packs into their web program. The Bluetooth works great, no annoying delay during conversations. And the battery also lasts a long time between charging cycles, even with moderately heavy use.", "Date": "August 18, 2011"}, {"Title": "I'm gonna miss these", "Author": "Curtis H. Folts", "ReviewID": "R1T8UJIIXCLWVB", "Overall": "5.0", "Content": "I'm a techno-dinosaur and I hate touch screens.  I inevitably hang up on the person as I try to answer the call.  Give me a good flip-phone with a simple camera any day.  The Samsung Factor is stone-simple, reliable and easy to read and use.", "Date": "June 25, 2012"}, {"Title": "SAMSUNG Factor", "Author": "Krys Allins", "ReviewID": "R2PHG40EBZYL0M", "Overall": "3.0", "Content": "The phone is rather sleek and light-weight and the design is quite user-friendly.  My problem is with the phone servicer, Boost Mobile.  Poor website quality and customer service is based overseas so it's hard to communicate issues sometimes.  Phone itself charges quickly, holds charge very well and has great audio.", "Date": "January 3, 2012"}, {"Title": "Teen tough!", "Author": "S. Burke", "ReviewID": "R21YPQ4Q66GJ3S", "Overall": "5.0", "Content": "I bought my first Samsung Factor 2 years ago for my teenage son. I wanted an inexpensive phone because he is very active between the beach, shark fishing, camping, hiking and pretty much everything outdoors related. I didn't want to replace an expensive smart phone weekly. I really didn't expect this phone to last more than 2-3 months with his usage. This thing not only held up to his abuse which included but was not limited to mud, sand, water, heat. It was a no brainer to replace it with another after all it held up to. He even forgot it was in his shorts pocket and jumped into the deep end of a swimming pool right after we got it and after drying it out it continued to work another two years. I don't know what else to say I like it and he likes it.", "Date": "March 27, 2013"}, {"Title": "Great Little Basic Phone", "Author": "C. Kinney \"Community Garden Coordinator\"", "ReviewID": "R3LZDY1MQROQ53", "Overall": "4.0", "Content": "Bought this for an employee who had no cell.  Very inexpensive but most functional. He can text and even get on the internet with it.  Good phone for anyone who just wants a cell \"phone\".", "Date": "January 9, 2013"}, {"Title": "Great phone", "Author": "Jewel Robinson", "ReviewID": "R2CBTB14BRWVE4", "Overall": "5.0", "Content": "Great phone, very simple. Brought it for my mother she doesn't want all \"the extra's \" that phones usually come with. Just needed a phone to make calls. She loved it. Cheaper than Boost Mobile.", "Date": "December 24, 2012"}, {"Title": "Great back-up phone", "Author": "Matt Newland \"mnewland1\"", "ReviewID": "RUXQCWPIZUNMN", "Overall": "5.0", "Content": "I have nothing but respect for this little phone. It is a durable, no-frills, straight to the point cell phone. It doesn't have any bells or whistles, by 2012 standards but doesn't claim to either. I would suggest buying one just for a backup, if you're not the type that HAS to have a \"smart phone\".Call quality is good, reception is acceptable. Battery life is great. I would charge it every 2 or 3 days, sometimes longer, depending on use. If you want a phone that you can show off to your friends and are a phone gaming freak, this phone is not for you, but if you want a phone for the sake of using it as a phone, you can't beat this for 29.99 brand new (boost website).", "Date": "November 8, 2012"}, {"Title": "samsung factor boost moble", "Author": "HARRY A WILEY", "ReviewID": "ROU84QFUAID1P", "Overall": "5.0", "Content": "great phone just what I needed Amazon did a great job getting it to me on time boost moble did transferd all my old phone numbers", "Date": "December 16, 2013"}, {"Title": "Simple phone.", "Author": "eb30", "ReviewID": "RKZ9S3Q9OU8U5", "Overall": "4.0", "Content": "A simple phone that make voice calls, works fine.This is an extra phone that I use, good enough for me.", "Date": "July 7, 2013"}, {"Title": "Samsung Boost Phone", "Author": "Kirk", "ReviewID": "RD56797AH4KAQ", "Overall": "4.0", "Content": "This replaces the out-dated Motorola i290 iDen (candy bar) phone. It's slim, has some good features to it and the keypad is easy to clean. Most important is the flip style, protects the screen when not in use. The secondary (small) screen could have had a longer illumination time frame though. I don't care for the mirror camera image when trying to display the time & date either.", "Date": "March 7, 2013"}, {"Title": "Quite Sure", "Author": "Linda", "ReviewID": "R1VZHEESDY78YG", "Overall": "5.0", "Content": "I choose this phone after reading all the information that was given.I am still in the process of learning all the\"Bells & Whistles\" that were with it. I love it ,though.I'd recommend this if you only want something just in case of an emergency or for calls that you don't make often. I like Boost.", "Date": "December 3, 2012"}, {"Title": "Works as describe", "Author": "Avenue Ultracon, Inc.", "ReviewID": "R39LFZ2SNZRLZ6", "Overall": "5.0", "Content": "just a spare phone, would recommend if you only use as a spare and remind of very old time, compare to touch screen.", "Date": "November 24, 2012"}, {"Title": "Good", "Author": "Aloha", "ReviewID": "R2PJADI4FKC2TP", "Overall": "4.0", "Content": "This phone to me is a good basic phone.  The features are easy to acess.  The only thingi had trouble i have no reception in my community.  But all in all its a good phone.  I am happy with my purchase.", "Date": "March 20, 2012"}, {"Title": "Samsung Factor cell phone", "Author": "Terri L. Munroe", "ReviewID": "R2GDESLN5DI1WU", "Overall": "5.0", "Content": "My husband was looking for a new phone, he went to the Boost store and saw this one, and it does exactly what he wants it to do, he wanted a good sounding phone to actually make phone calls.", "Date": "December 6, 2012"}, {"Title": "good phone", "Author": "cristina luna", "ReviewID": "RVJ7B9NIJUGDW", "Overall": "5.0", "Content": "I got this phone for my 9yr old. She loves it and it has no issues. thank you ! !", "Date": "December 31, 2013"}, {"Title": "Samsung", "Author": "Eileen Trumbull", "ReviewID": "R3T7SE7ZFQBJPA", "Overall": "3.0", "Content": "This is a simple and easy to use phone. Texting is a bit laborious, but otherwise the phone is great.", "Date": "December 17, 2013"}, {"Title": "Good phone", "Author": "duff", "ReviewID": "RX72P3BWE5NN6", "Overall": "4.0", "Content": "This phone worked fine as long as I used it which was about six months.  Then I switched carriers and plans and I never had to use it again.  There wasn't anything wrong with it, as far as I could tell, though.", "Date": "December 13, 2013"}, {"Title": "ok", "Author": "ernest winters", "ReviewID": "R1EXZ9M3NS0CVH", "Overall": "4.0", "Content": "well this a good temp phone pictures are really jackd up so recomend u get your permanant phone rite a way wont last if u like 2 veiw pics or send", "Date": "December 5, 2013"}, {"Title": "Good buy !!", "Author": "Jeanne Parrish", "ReviewID": "R3IIHRKP66CQOA", "Overall": "4.0", "Content": "Holds a charge much better than the smart phones..better reception as well this was a great purchase and well worth the money", "Date": "October 2, 2013"}, {"Title": "simple phone, can't beat for price.", "Author": "D. Reed", "ReviewID": "R2Z4FELV0CRHWB", "Overall": "5.0", "Content": "If your looking for a basic durable flip phone with a good battery life look no further. 3 more words required", "Date": "May 2, 2013"}, {"Title": "Great Phone, Great Plan", "Author": "D R \"D R\"", "ReviewID": "R3I0S26S5B05Z4", "Overall": "5.0", "Content": "This phone from Boost works well. I have never had a dropped call or any problems. The plan is one of the cheapest too.", "Date": "December 2, 2011"}, {"Title": "The Best Phone Ever Get it now.", "Author": "Christopher \"David\"", "ReviewID": "R2CSAI4E6EGT7A", "Overall": "5.0", "Content": "This Boost Mobiel phone is hot it work great and any one who has it would love it. Get it it a great phone to talk on and text with and around wonderful.", "Date": "August 10, 2012"}, {"Title": "Good phone for the price", "Author": "lorrie", "ReviewID": "R22ZKAPUM0RRXD", "Overall": "4.0", "Content": "Good phone for the price. I rarely talk on the phone so Boost Mobile's \"Pay as you go\" plan was perfect for me. Purchased one for my husband too. He doesn't like it as much. He does a lot of texting and said this phone is not text friendly.", "Date": "April 4, 2012"}, {"Title": "charging issues", "Author": "Leticiany", "ReviewID": "REK69HN33DWUV", "Overall": "2.0", "Content": "I bought this phone for my mother. She is not as technologically savvy so this is perfect phone for her. The only issue we have had is that we've had the phone a month, and now we're having charging issues. The phone will not charge at all from the charger. We've replaced the charger and it still won't take a charge. There it's no damage to the phone at all but the phones not working the way it should. Other than that it's a great phone love the products we just need to find a way to get the phone to charge.", "Date": "March 22, 2012"}, {"Title": "no pay as you go!!!!!! although it was printed on the package", "Author": "Yingchao Xiang", "ReviewID": "R3PZANJJ6HO0AL", "Overall": "1.0", "Content": "just talked with a representative on phone, it is 50 $ per month, or 2 $ per day, no pay as you go", "Date": "January 28, 2014"}, {"Title": "Great phone for seniors my mom and dad love this phone", "Author": "claytria Mercer", "ReviewID": "R1XZ3CEM9PIY48", "Overall": "4.0", "Content": "Nice Lil phone for twenty dollars and simple to use my parents don't like touch phone because they older so this is great for them.", "Date": "January 14, 2014"}, {"Title": "phone all right NO WAY TO TRANSFER PHOTOS", "Author": "Mark Lock", "ReviewID": "R2EU68SZT3YC2F", "Overall": "1.0", "Content": "The samsung factor is a all right phone about average i have researched online and there is NO WAY to transfer or recieve any PHOTOS other then MMS (photo messaging). UPDATE: after using the phone about 2 months found out that the battery will drain even when power off dropped rating to 1 star, phone is cheaply made.", "Date": "August 3, 2013"}, {"Title": "The Phone Works Well", "Author": "Larry", "ReviewID": "R1I7SZXNW5N1Q7", "Overall": "4.0", "Content": "Good Phone, volume, battery life, ease of use. Priced right for the budget minded and works well on the sprint system.", "Date": "July 5, 2013"}, {"Title": "GREAT ITEM @ A GREAT PRICE!!!", "Author": "Anthony Bridgewater", "ReviewID": "R2FK3F8HKCVXLR", "Overall": "4.0", "Content": "THIS IS A GOOD BACK UP CELL PHONE FOR WHEN MY ORIGINAL HTC PHONE GOES DOWN. IT CAME @ A GOOD PRICE & THE SHIPPING SPEED WAS QUICK!!!", "Date": "April 28, 2013"}, {"Title": "thank u", "Author": "april lopez", "ReviewID": "R3CGLYIHNDYS5V", "Overall": "5.0", "Content": "Good little phone for the price and much cheaper  then what is available in the stores. we were very pleased with this purchase.", "Date": "April 23, 2013"}, {"Title": "Good Lil Phone", "Author": "carlo", "ReviewID": "RXMMZMP7LND3B", "Overall": "5.0", "Content": "Works as intended,Long Battery life,Decent sound. Highly recommend for its Price of $25.00. Ain't many who would want to rob it off you. Its not a status symbol. Just a lil phone that works.", "Date": "April 21, 2013"}, {"Title": "Excellent Timing", "Author": "Leslee Patrick", "ReviewID": "R15Q6ERDBRL1AF", "Overall": "5.0", "Content": "I have other things I am still waiting for that I ordered on Amazon days before I ordered this phone and still got the phone way quicker than the other items!", "Date": "January 11, 2012"}, {"Title": "dont like it", "Author": "Dixie", "ReviewID": "R2SJ2456NODM38", "Overall": "2.0", "Content": "I don't recommend people to buy.  It is a prepaid phone and that is also a problem for the first 6 months if you are replacing a broken phone like I was.  The buttons on the inside are nice and big but, my butt or pocket continues to push buttons on the side of the phone.", "Date": "December 28, 2012"}, {"Title": "Barely adequate for a short while...", "Author": "MariaP", "ReviewID": "R36HDWA3G4SUOR", "Overall": "1.0", "Content": "I've had this phone for a little over a month, and it is already dead.  It won't take a charge from either its own charger or any of the 8 other Samsung chargers my family has lying around the house.  It worked with all of them prior to a week ago.  My options now are to buy a new battery from the Samsung store for $17 which may or may not work, or a new phone and lose all my accumulated voice mail, contacts, etc.  Frustrating.  I can't say it was good service while it worked even- I started on the pay as you go plan but after using it for a few weeks, for maybe a 5 minute call a day (poor quality, a quarter of the conversation lost, etc) plus the 22 spam texts or useless Boost texts received, for which you are charged whether you open them or not, I switched to the monthly plan because it was much cheaper.  At $50 a month it's not the best deal out there, but by that time you're kinda stuck.  Hm, writing this review has made my decision clear!  I will be buying neither a battery not this phone again!  I don't recommend you do either unless you're a drug dealer or spy and planning to use it for an hour or a day or so... I'm sure it would be fine then.", "Date": "July 10, 2012"}, {"Title": "Boost mobile", "Author": "Robert DeLay", "ReviewID": "RRPQON1FTUI6G", "Overall": "1.0", "Content": "Boost Mobile has the worst service I have ever seen. They no longer use other carriers cell towers and now are building their own. Cell reception is lousy. If and when you are lucky to get cell tower reception it's poor at best. Don't waste your money on Boost Mobile. Find a better provider.", "Date": "May 30, 2012"}, {"Title": "crazy", "Author": "boundbylove4evr", "ReviewID": "RTRFNFG9TF51N", "Overall": "1.0", "Content": "oh my god, $999.00 are you freaking crazy, a iphone 5 doesn't cost this much, this is at best a 50 dollar phone", "Date": "January 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "2-inch LCD display; Affordable no-contract phone from Boost Mobile for on-the-go voice and text communications\nChoose from Monthly Unlimited or $2 Daily Unlimited plans with unlimited talk, text, e-mail, and web\nGPS for navigation; Bluetooth and speakerphone for hands-free communication; access to text and instant messaging\nUp to 3.5 hours of talk time; released in March, 2011\nWhat's in the Box: handset, rechargeable battery, charger, quick start guide\nAffordable no-contract phone from Boost Mobile for on-the-go voice and text communications", "Name": "Samsung Factor Prepaid Phone (Boost Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/314dyAoYp6L._SY300_.jpg", "ProductID": "B004UVR9A4"}}