{"Reviews": [{"Title": "Sonim XP1300", "Author": "John D. Chan", "ReviewID": "R2LUAKI6O6JYTS", "Overall": "4.0", "Content": "I bought this phone because I needed a way to be contacted when I was in the water.  My pager would be ruined in the water and my iPhone wouldn't last in the water either and so I thought this would be the solution. It's a solid well made phone. It's about the same size of my old Nokia type phone that I had about 10 years ago. I took it to the beach and went swimming and dove underwater a few feet.  Then tried to use the phone and it worked well. I didn't sign up for any data or text plan since the only reason I bought it was so that I could be contacted while in the water. I'm giving it 4 stars since I've only had it a couple of weeks. If it keeps working and working without any problems, I guess I'd eventually give it 5 stars. Of course it would be nice if it were smaller, but I didn't purchase it to be a stealth device. I imagine if there were a smaller version, that I would probably choose the smaller version only for the portability. 't you need a smart phone, this would not be the phone to get. But If you needed a rugged phone that you could drop, get wet and swim with that so far seems dependable,  I would recommend it.", "Date": "October 13, 2011"}, {"Title": "The Sonim Text Message Jingle Song", "Author": "Thomas (Dear Ferrero)", "ReviewID": "R2C4HYSKFSWTNM", "Overall": "5.0", "Content": "Dear Sonim Technologies,I have never really been that good at keeping track of time, but based on the magnetic moment of the Moon I believe it has been roughly a year since I took the proverbial leap of faith and purchased the widely acclaimed IP-68 certified XP1300 Core. As a firefighter and seasoned outdoor enthusiast I had almost made peace with the idea that no phone on this planet was built just for me. Having previously owned thirteen (13!) mobile phones in just as many years, I cannot begin to tell you how satisfied I am with this remarkable device of unprecedented ruggedness.While the phone does suffer from one very distinct flaw (i.e. every other six weeks I have to pretty much turn our house upside down because I keep forgetting where I left the wall charger), there are so many things I like about it that I wouldn't even know where to start. A feature I am particularly excited about is being able to ask my four-year-old about her first day at school while simultaneously battling an infernal refinery blaze. I also appreciate the fact that the screen is constructed of gorilla glass, which never fails to inspire fear and respect whenever I mention it.All this, however, fades in comparison to what I truly love most about this phone. It may come as no surprise to you that I am referring to the instantly recognisable text message jingle. While virtually all mobile phone manufacturers pack their devices with a confusing bunch of tedious-sounding text message tunes, your team of engineers hit the nail right on the head with just one single tone so impressive both from a technical and musical point of view that it makes me want to cry tears of joy whenever I hear it. As opposed to some of my musically less educated colleagues and friends, I do fully support your bold decision to disable the uploading of any custom sounds whatsoever. Too many people these days are being allowed to jeopardise their own credibility by making their phones produce silly, annoying, offensive or absurdly discrete sounds. Not so as far as you folks are concerned. As a matter of fact I am so passionate about the Sonim Text Message Jingle that I actually taught myself to sing it in two voices. Give it a shot yourself and you will really understand how much I value your work.Anyway, since a pleasure shared is a pleasure doubled, I took the liberty of doing some promotional work for you and spreading the excitement. I thought I'd sample the Sonim Text Message Jingle and turn it into an epic song, which, after careful thought and consideration, I named \"The Sonim Text Message Jingle Song\". Believe it or not, it even comes with a beautifully crafted music video, which can be viewed here > http://www.youtube.com/watch?v=cizrD_56N8cI hope you will like it as much as I do.Rugged regards,ThomasP.S.: As a result of my promotional work, one of my favourite radio stations has recently started using the Sonim Text Message Jingle for their news broadcasts. Check it out for yourselves: http://www.youtube.com/watch?v=oj1m0ZCAzMA", "Date": "October 5, 2013"}, {"Title": "No way spend your $ elsewhere", "Author": "Nightstick \"DKH\"", "ReviewID": "R1QQL3MRTX075K", "Overall": "1.0", "Content": "This phone is a joke, rugged yeah!  Functional not so much, this phone wont even do what its advertised to do.  The push to talk functions is terrible.  That is if you can first locate your contact or keep track of who actually called you and at what time.  The is suppose to be a phone that can do it all, NO WAY!Buy a good smart phone and then buy a lifeproof waterproof and shatterproof case.  Stay away from this one its not worth the hassle.", "Date": "December 31, 2013"}, {"Title": "Warranty is a pure sales lie", "Author": "Gean Boegman", "ReviewID": "RB9KGJE34X7RR", "Overall": "1.0", "Content": "These phones are not as tough as they look, on mine the Sim card socket solder went lose after 4 months and now both mine and my dads buttons are peeling. Joke is I'm an office worker and my father is 70 this year and caries his phone in a pauch. Sonim support told us that the buttons are cosmetic and it's not covered. Poor quality and poor service.", "Date": "November 15, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00489AQ5I"}}