{"Reviews": [{"Title": "Very powerful device", "Author": "RedWolf", "ReviewID": "R25EEDIWLVOI13", "Overall": "5.0", "Content": "UPDATE AT THE BOTTOM.. Yes, it did crash.I had this phone for 2 weeks now, and I love it. Note that my review is for the phone not the buyer, since I didn't order via Amazon. This is my first HTC phone, I had a Dell Streak 5 (runs Android 2.2) before which was huge, and the CPU and the RAM were not that powerful, so it used to freeze quite often, specially with too many apps running. This one runs very smoothly, even though it is not a dual core processor.I was not sure if I should get this one or the HTC Desire HD. They system Spec are very similar. Since I was sick of the 5 inch phone, I chose the Desire S (3.7 inch) vs the HD (4.3 inch). The price is very similar, the HD should be available with 2.3 Gingerbread by now. The HD has an 8 MP camera which seems to be really good, and much better than the Desire S MP. On the other hand, The Desire S has a front camera which is cool for Skype video calls. Yes, Desire S was one of the first Android phones along with the Nexus S to run Skype video chat. Nexus S was another option that I might have gone with, check it out. Desire S camera is very impressive if there is enough lighting around, and it shoots 720p video, which is very crisp.The screen is not that bad under sun light. yes, you want be read or browse properly, but you will be able to see who is calling (something I was unable to do with previous handsets).Main disadvantage, as with many smart phones, is the battery life. I charge it daily over night, so it lasts me the whole day with moderate use (checking email, browsing, connected to WiFi, and Bluetooth headset most of the time). It charges via mini USB, so it can be charged almost anywhere.Final thoughts: Check some youtube comparisons, and the HTC website they explain all their features. I got mine unlocked cause I don't want to commit to a contract, thus it came from the UK. This means a European 3G frequency, so you cannot connect 3G via your network provider, so you may wanna check if that's the case for you. For me, I wanted that cause I mainly use Wi-Fi (Home, work, and most of the cafes has it) plus I will be moving overseas and the 3G will work over there.Based on my needs I give it 5 stars, you may prefer HTC Desire HD, or Nexus S for a similar price... or even go fancier with HTC sensation dual core processor.UPDATE: I would say 4 stars for the hassle, hoping that the problem won't happen again.It died after HTC OTA update. The phone is under global warranty (originally from Europe). The motherboard had to be changed. HTC USA honored the warranty, and replaced the motherboard for $20. However, they had to order it from Taiwan, and I was without it for a month! I'm glad I got it back, I like the phone, but nervous that this would happen again! I will be reading feedback about future updates before I download them. If the phone was under contract (not unlocked) the carrier would issue an immediate replacement. So, it sucks that I paid the MSRP and had to wait for a month. I would suggest Nexus S, but I read similar things. If you want to buy it, make sure it comes with global warranty.", "Date": "July 11, 2011"}, {"Title": "Desire made phone", "Author": "MAURICIO VANEGAS GUERRERO", "ReviewID": "R8C7T9WI0QIT8", "Overall": "5.0", "Content": "Desire stands for Erotic and Lust, and that's what a Geek like me feels like when he puts his hands on a phone like this, the major beauty is in the inside says the grandmas and that's absolutely true when you play with this device, very fast processor and a lot of RAM to run your applications instantly with no lags, strong and reliable processor to rely on and keep your business apps, communications and mail running, and also is stylish and good looking, bright clear graphics and text to avoid tire your eyes, excelent signal reception, even for the cellular network, wifi, bluetooth and GPS, one word to describe the experience? AwesomenessAnd as usual in this type of devices, we would like to get longlasting batteries, when I use this phone at it's full capacity the battery just runs for about 6 hours and needs to be recharged again, so I always take with me a spare microUSB cable and the car charger to keep it running for the whole day.", "Date": "August 3, 2011"}, {"Title": "Nice phone, but mine died within 3 weeks!!! And HTC doesn't want to recognize it has design flaws!!", "Author": "Daniel P. Goncalves \"Daniel Pascoal\"", "ReviewID": "R2WZQYI5YFM9KN", "Overall": "1.0", "Content": "I wish I had listened to the people complaining in here.Mine died within 3 weeks!!After looking around the internet I found several people with the same problem.Basically what happens is that if your phone crashes (software freezes for whatever reason), and if you try to remove the battery and re-insert it quickly the eMMC chip (internal memory) gets fried. Which is ridiculous, just proves how badly design HTC phones are.I found out too late that you can hold Vol. Up + Vol. Down + Power to reset it without removing the battery.To make things worse, since I live in Brazil and bought the phone during a trip to US, HTC Brazil is saying I'm not eligible to warranty claims! It doesn't matter to them if the phone has design flaws or not.I also never buying HTC products ever again. (and I'm not alone!)[UPDATE]Ok, HTC USA finally recognized that the phone was defective and replaced the main board under warranty. But they charged me $20 service fee because this phone that I bough on Amazon.com was originally intended for the India market and not the US.Not changing my review rate though, because after the repair the phone still presents some problems, as calls dropping and random crashes.", "Date": "October 25, 2011"}, {"Title": "cool phone but its screen...", "Author": "Ethem Evren Guner", "ReviewID": "RQ72WJPWLAMRI", "Overall": "4.0", "Content": "Nice phone , I use it for two months without any problem. But there is still one thing to say about its screen , under daylight you can almost see nothing , there is too much reflection.", "Date": "July 6, 2011"}, {"Title": "HTC Desire S", "Author": "John Gahan", "ReviewID": "R24A5MNYY47DVR", "Overall": "1.0", "Content": "I bought this phone because I had the very same phone originally, and was delighted with it. I don;t normally write product reviews, but this phone was definitely not a HTC Desire S, it looks the same but it was in no way comparable to my original one. The screen works intermittently, sometimes it will work properly, sometimes if you rotate the screen it will work and sometimes if you turn the screen on and off again it will work. And this is just one thing, there are various other things like the speaker is always on by default when you're making a call and so on.Stay away from this phone.", "Date": "May 12, 2014"}, {"Title": "HTC Desire", "Author": "James", "ReviewID": "R1XWPMURZ2BAS3", "Overall": "5.0", "Content": "Great Mobile, lots of features, and I love the size.  My wife and are traveling to Central and South America, and we were looking for something compact with lots of features! WELL THIS IS IT. We have since than recommended this mobile to several of our traveling mates, and family members. Thank you Amazon.", "Date": "May 11, 2014"}, {"Title": "YSMENIA DIAZ VENEZUELA", "Author": "WUILKERSON ZARRAMERA", "ReviewID": "R3ORS8N5BVVP9I", "Overall": "4.0", "Content": "Good night.WOULD LIKE TO KNOW IF I CAN HELP. BUY ONLINE THE HTC DESIRE, AND I CAN SET THE SPANISH LANGUAGE SINCE NO MELO ALLOWS ONLY HAVE IN ENGLISH AND JAPANESE.THANKS IN ADVANCE YOUR HELPTHANKSYSMENIA DIAZ", "Date": "February 10, 2014"}, {"Title": "Never works", "Author": "Andrea Torres \"Guisella Torres\"", "ReviewID": "R2ZEMTK24MIFAQ", "Overall": "1.0", "Content": "I bought the phone 6 months ago and it never worked properly, I was never able to browse on the internet, even though my plan allowed it.Today I made my last attempt and took the phone to my mobile company (Claro Ecuador), the customer representative checked the device and told me the phone settings should allow me to navigate on the internet, but unfortunately the cellullar phone simply does not work as it should even though the device allows it.", "Date": "January 3, 2014"}, {"Title": "It crashes regularly", "Author": "Sputnik", "ReviewID": "RQHR8W498FP6K", "Overall": "2.0", "Content": "I've been using this phone for about a year and usually works fine as many other Android phones.However, every now and then it crashes unexpectedly and restarts itself. I've been searching around and it seems that is due to a bad construction quality since the battery is loose and sometimes makes the phone to restart.Although the phone is nice this type of problem is not acceptable so I wouldn't recommend this phone.", "Date": "January 14, 2013"}, {"Title": "Sent it back", "Author": "Douglas Fountain \"dfountain\"", "ReviewID": "R1FJ16DM3L15ZZ", "Overall": "2.0", "Content": "Beware, this is not compatible with AT&T; 3G network.  It is a European model, hence works on other frequencies than the two that AT&T; use.  In addition, I have returned the item after 1 day for the following reasons:  it crashed every time i attempted a system update (seems a common enough occurence), it would not recognize my PC for syncing (despite all attempts and advice from user groups), it did not come withe micro-SD card that apparently has important software.  It is a nice size, easy to use phone with a lot going for it, but those problems were too much.", "Date": "January 5, 2013"}, {"Title": "Good", "Author": "Emily Leanne Lane", "ReviewID": "R3JYCOPYKL8SV2", "Overall": "4.0", "Content": "My husband bought one of these and he loves it. It has a great app store and does so many things. The only negative thing I can say is that the battery is not that good, for heavy use it wont last the day! Overall a good phone. I have the galaxy s2 which is so much better, but this was a good phone when it came out.", "Date": "December 23, 2012"}, {"Title": "It's OK but it has some software update issues", "Author": "Eugen", "ReviewID": "R1PX56A9K4QKBD", "Overall": "3.0", "Content": "I bought this device from Wireovia about two weeks ago (end of November 2012). I had another one (bought from Europe) that I used for a few months before giving it to my wife and obviously I was happy with it since I bought another one.This particular device I got has quite an old software installed. It has Android 2.3.3 with HTC Sense 2.1 while the last version available is Android 2.3.5 and HTC Sense 3.0. It works as expected as a phone (signal strength, volume) but it could do more as a smart-phone (Android experience).From the first 5 minutes I enabled wireless it started downloading software updates. First it downloaded and successfully installed two FOTA updates. Immediately after that it tried to download a system update and this is where the 'trouble' begins. It successfully downloaded the 35MB system updated but it failed to apply it. I tried that a few times and it failed the same way every time. I asked Wireovia what to do and they told me to ask for support at HTC.I've just spent one hour on the line with HTC US support trying different stuff. They told me this particular device is an overseas (UK) version. They also told me that it looks like the phone it's trying to download the software update from their website but the update is not there and this is why it fails. I did not understand exactly what is it downloading since the update is not there but it still download some 35MBs. Anyway, if I want it updated I'd have two options: either wait for the update to become available on the website (don't know when that will happen) or send it to HTC so that they update it. Obviously the second option would cost me something (money - for shipping to them, time - since it's an overseas version they would have to ask for the update in the UK).The conclusion would be that there is a reason why there is no warranty available for this phone. Don't get me wrong: it's not like it's broken but it could do more for the same money.", "Date": "December 10, 2012"}, {"Title": "Great phone", "Author": "Anubrat", "ReviewID": "R3SNX1LVEEBV39", "Overall": "5.0", "Content": "it was unlocked.as it was supposed to be...was new and sealed as it was described. Worked flawlessly. Gotta tove it.", "Date": "November 26, 2012"}, {"Title": "It says NO SIM CARD", "Author": "Amina", "ReviewID": "R1O6DPQW87AJKF", "Overall": "5.0", "Content": "I bought this phone on Amazon from FGS Trading and I have inserted a T-Mobile Sim Card and it isn't working, don't know what to do now, does anyone else has this problem?", "Date": "November 5, 2012"}, {"Title": "HTC Desire S", "Author": "@nick88msn", "ReviewID": "R3JRVJEUD2R805", "Overall": "5.0", "Content": "I bought this phone a month ago.Fortunatelly I've found a bargain and I've bought it ust for 160$.This phone is amazing for that price! Firt of all the 1 Ghz Qualcomm S2 and Adreno 205 GPU are enough for 95% of every task you can ask to your android phone (no 1080p video recording, just 720p with 5 Mpx camera). This phone has 768MB of ram that let you have a good multitasking. Display resolution is 800x480 and is really good for a 3,7\" display, color are vivid and angle view are great (I think this display is IPS). As regard software, this phone comes with a android 2.3.3 and Sense 3.0. This rom is mediocre and a little laggy. You can update to the latest android 2.3.5 and Sense 3.0 that is a good rom and Everything is fine (but not excellent). If you're a power user I suggest you to install a custom rom with Android 4.0.3, believe me it makes the boost to your phone, excellent performance and low power consumption. Hardware accelleration with andreno 205 make android smooth as an iOS or a windows phone. If you're not a power users there's no problem because HTC is making an official update for your desire S!! So if you find a bargain with this phone, catch it up!!!", "Date": "March 24, 2012"}, {"Title": "Great device... if used properly", "Author": "Omar Garcia", "ReviewID": "R2AMWT8ABN002B", "Overall": "4.0", "Content": "The HTC Desire S is a really awesome and powerful device.Despite the eMMC design flaw, on which if you pull out the battery while the phone is still on and insert the battery immediately after that, it will most likely fry the eMMC, leaving the phone pretty much dead.It happened to me once and HTC DID acknowledged my warranty (despite the fact my device was rooted) and charged me $20 USD for replacing the eMMC.So, if you have one or deciding on getting one of these just remember to NEVER EVER pull out the battery while the device is on. Press 'power' + 'vol +' + 'vol -' and it will force reboot the phone without risking the eMMC. Although you will require to do this only when an app makes your phone to freeze, which is very uncommon.Anyway, the device has a 1 GHz processor and 768 MB of RAM, which is more than enough to run anything you need. After rooting my phone, I installed an app to control the CPU frequency and I have used the phone at 400 MHz and it runs flawlessly. Basically you have ~500 MHz of spare processing power.The screen is incredibly crisp and clear. It may not be an AMOLED display, but the S-LCD does a perfect job.Another downside is the battery life. Running the phone with the HTC kernel and on the stock ROM (Sense 3.5) it sucks up battery really fast. Not even 12 hours of 'normal' use.After rooting, installing a custom kernel and custom ROM, I've managed to squeeze the battery up to 48 hours of 'normal' usage. Which is pretty decent.I give the phone a 7 over 10.The eMMC problem is something you can definitely avoid, so that isn't a problem for me.The battery life on stock is really bad.Other than that, awesome phone.By the way, HTC claims that later this year, the phone will receive an OTA upgrade to a new kernel, new ROM (Sense 3.6 if I'm correct) and it will be upgraded from Android version 2.3 (Gingerbread) to 4.0 (IceCream Sandwich) which hopefully will extend battery life considerably.", "Date": "March 24, 2012"}, {"Title": "nice phone but died in two months!", "Author": "W_Essam", "ReviewID": "R3SELPN7Q569X6", "Overall": "1.0", "Content": "The phone is really nice and user friendly but completely died and required a motherboard change for ~60% of its price after only two months of use. This is the first piece of electronics equipment that I buy in ages that had such a catastrophic failure on its own. I will never buy any HTC product again.", "Date": "August 21, 2011"}, {"Title": "You would have to be insane (or super rich)", "Author": "Chris S. Walker", "ReviewID": "R2HUU3KH8MMTZL", "Overall": "1.0", "Content": "Before buying an expensive phone from FGS Trading, read my story... I bought the original Desire from them in November 2010.  The HTC Desire is a great phone, when it works. I ordered this phone from FGS Trading so that I could have it as I travel overseas (I was recently deployed to Middle East with the military). The only thing is, I am one of the hundreds of folks who got an HTC Desire with the bad motherboard that makes the phone do random reboots (Google it for HTC Desire). If I talk on the phone for more than a few minutes, \"reboot\". If I use the internet for more than a few minutes, \"reboot\". If I use the GPS even for one second, \"reboot\".Of course, I tried factory resets. I tried anything I could try using the HTC Forums. I discovered that there were many others like me who were experiencing the random reboots, and the ugliest part of the problem is that the phone doesn't reboot once and start back up... it continues in an endless reboot cycle until I'd have to open up the phone a take the battery out. While I was in the Middle East, I couldn't readily take it in for a repair. I had to wait to get back to the States. In December, I tried contacting FGS for help, and I got this response by email:****************I am sorry to hear this. This is the first i hear about the random reboot problem, but HTC would be the best bet to support the device at this point. If it's a motherboard problem, a warranty replacement would be best (if it was a software issue, a firmware upgrade would help, but it sounds like all the other people you checked with point to the motherboard).Please let us know if HTC was able to assistHappy holidays, and stay safe!****************Yeah, Happy Holidays... Well, HTC said that they couldn't help me, and not being able to do much from my deployed location, I got my sister to send me a Nexus S (which I love). Now that I'm back in the U.S., I have been trying to get HTC, FGS, and anyone else to help me, but to no avail. Here's what I get from FGS:***************HelloThere is not much we can do at this point, since we are not the end user. HTC does not offer warranty support for resellers, they usually ask resellers to accept returns during the first 14 days, and then after that end users are asked to contact them directlyEmma***************I tried calling HTC in the UK and Germany, and from them, I found out the the phone's IMEI is from Vodafone. So now I've been calling Europe to Vodafone Customer Service, and I keep getting passed off to different folks who give me the runaround. I'm at the end of my rope. I'm now going to have to send it to a friend in London who can try to take it to a Vodafone store for me and see if I can get some help. Now, after paying over $450 for a phone, is that the customer support I am entitled to?If you think that you may want service for your phone, do not buy from FGS Trading. You will be out of your hard earned money with no support.", "Date": "April 10, 2011"}, {"Title": "desire S-hit", "Author": "johnny2104", "ReviewID": "R18LNN066R0F88", "Overall": "1.0", "Content": "I really to wanted to to make this phone work. But it just doesn't. GPS doesn't work comparing to Galaxy or even to Garmin. I am using it just for running but it looks like it was a bad choice. Battery life is maybe really 6h if you dont use it (power off) otherwise it maybe 4 hours. I hope that my thought will be shared, because i just realized that it's quite hard to leave bad review on every www with reviews. I dont want to spend all day writing reviews if i cant just leave zero stars for review.", "Date": "July 12, 2011"}, {"Title": "One of the best!!", "Author": "Yasser A. H. Saeed \"Yasser A. Saeed\"", "ReviewID": "R1WVU0ER88X6TN", "Overall": "5.0", "Content": "I did not like much the first Desire, but this one I love, and I am planing to buy one as soon as it is released in the Middle East.  I have read many reviews and all positive, so I am confident about it ............UPDATE: I got this smartphone for my son 6 months ago, and I can confirm that it dose live up to my expectation. Highly recommended..Tuesday, January 10, 2012", "Date": "April 24, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "2G Network\tGSM 850 / 900 / 1800 / 1900 3G Network\tHSDPA 900 / 2100\nS-LCD capacitive touchscreen, 16M colors Size\t480 x 800 pixels, 3.7 inches  \t- Multi-touch input method - Accelerometer sensor for UI auto-rotate - Proximity sensor for auto turn-off - HTC Sense v3.0 UI - Touch-sensitive controls\n3G\tHSDPA, 14.4 Mbps; HSUPA, 5.76 Mbps WLAN\tWi-Fi 802.11 b/g/n, DLNA, Wi-Fi hotspot Bluetooth\tYes, v2.1 with A2DP, EDR, microUSB\nCAMERA\tPrimary\t5 MP, 2592 x 1944 pixels, autofocus, LED flash Features\tGeo-tagging, touch-focus, image stabilization Video\tYes, 720p@30fps Secondary\tYes, VGA\nOS\tAndroid OS, v2.3 (Gingerbread) CPU\t1 GHz Scorpion processor, Adreno 205 GPU, Qualcomm MSM8255 Snapdragon", "Name": "HTC Desire S S510E Unlocked QuadBand GSM Phone with Android OS, 3.7\" Display, HTC Sense UI, 5 MP Camera, Wi-Fi and GPS--International Version without Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/51y7EDW0DqL._SY300_.jpg", "ProductID": "B004NNU9YM"}}