{"Reviews": [{"Title": "BlackBerry Pearl 8130 review.", "Author": "J. Holcombe", "ReviewID": "R39DC75HFHG69A", "Overall": "5.0", "Content": "Overall, this is a pretty nice phone but there are some minor things that could be improved upon. Instead of babbling on about things that don't matter, I'll just provide a list of pros and cons.PROS:-SureType keyboard makes a good alternative compared to the standard alphanumeric keyboards found in several flip phones.-Good speakers and 3.5mm headphone jack means that you can listen to music and videos however you want without the hassle of headphone adapters, protable speakers, and so on.-Nicely designed; not bulky or ugly like a lot of the phones out there.-MicroSD card slot means you can add more space to save pictures, videos, music, and so on.-Buttons on either side for one-push access to applications you can set for shortcuts to the appications.-Ambient light sensor means that you aren't wasting battery when you don't need the keyboard or screen backlights on, since it will automatically dim or brighten them for you in certain lighting conditions.-User interface is very adjustable with many options for user-customization.-Charging pod accessory makes for easy desktop docking.CONS:-Battery life isn't that great.-Internet upload/download speeds could be improved upon.-Camera photos, when viewed on a computer, aren't that clear.-Only 64MB memory standard means you almost definitely have to buy a MicroSD card to store your extra stuff.-No way to type accented letters in texts or emails.-Earpiece sound quality could be better.THE VERDICT: In this instance, the pros greatly outweigh the cons. If I were to rate this phone, I'd give it somewhere between 90-95%.", "Date": "July 8, 2011"}, {"Title": "Not very happy", "Author": "ajl", "ReviewID": "R135VEA4QNI1UC", "Overall": "1.0", "Content": "I received the original phone and the radio service wouldnt work on it so the phone could not be activated.  Sent it back, this time it worked but I cannot hear on this phone.  Took a month to get this all done and still no phone.  Finally got tiered of dealing with it and just renewed my Verizon contract.  Got a Blackberry Curve, love it, and now I can hear the person on the other line", "Date": "May 25, 2011"}, {"Title": "phone", "Author": "Paul Falzone \"falzone.p\"", "ReviewID": "RURMTISDELE4K", "Overall": "4.0", "Content": "I rece1ved my phone on time and in great shape without any hitches.  Everything was good am happy. Paul", "Date": "April 10, 2011"}, {"Title": "i hate it", "Author": "dominique", "ReviewID": "R1VU79X9R4PKT6", "Overall": "2.0", "Content": "It was really messed up when i got it and it looked so cheap. I let my son play with it.", "Date": "April 18, 2014"}, {"Title": "not cool", "Author": "Tanya Hafner", "ReviewID": "R31NWLLZ7271HT", "Overall": "1.0", "Content": "was not told this \"smartphone\" is no longer made and nothing works but texting and calling but yet i still have to pay smartphone prices very upset!", "Date": "March 23, 2014"}, {"Title": "Ugly looking \"good\" phone!", "Author": "Regi Sylvain", "ReviewID": "RCLGNR503V1EG", "Overall": "4.0", "Content": "Not so great on looks.. rather clumsy design.Many features missing and one needs a prepaid account.However, it functions ok.Rather highly priced and if its not the Blackberry label you are looking for, I am sure you could buy a more satisfactory phoneMedia player with audio and video playback in a variety of formats very useful", "Date": "February 14, 2014"}, {"Title": "Outdated", "Author": "Hannah", "ReviewID": "R18OPR3XE2WC5B", "Overall": "2.0", "Content": "I had purchased this phone because I shattered my iPhone. Grant it, I should have known a phone from the early 2000's was going to run much different than my iPhone. But I forgot how bad these things suck. Such bad speed and couldn't get any app's to work. I went back to the broken iPhone. It's a good back up phone. And I get it for a spare. But wow, it's just old school. Plus, paying for a data package and not getting your things at your finger tips, although you are paying for it, sucks. The seller is great by the way. So if you are buying this phone the seller is great to work with. I recived the wrong phone. Should of had a Verizon carrier but somehow got U.S Cellular. He sent an email asking how it was going, I explained that I would be returning it and he sent me the shipping materials and a phone that worked in my network. I did keep the phone because I could understand using as a backup. It wasn't too expensive either.", "Date": "May 29, 2013"}, {"Title": "EXCELENTE PRODUCTO", "Author": "ORLANDO BOSCAN", "ReviewID": "RW95D7BZARC1R", "Overall": "5.0", "Content": "MUY BUEN ARTICULO Y A BAJO PRECIO, FUE UNA BUENA ELECCIÓN DE MI PARTE, ESTE TELÉFONO ME ES DE GRAN UTILIDAD PARA MI LABOR DIARIA, EXCELENTE VENDEDOR", "Date": "December 13, 2012"}, {"Title": "Great but with downfalls", "Author": "Arran24", "ReviewID": "R7YSM6MXHDA4U", "Overall": "4.0", "Content": "Great phone with so many options clearly marked by icons.  Love the bluetooth capability and really clear resolution of pics, even at 2.0 MP and one click access button on side. Its sleek and thin and shiney.  However, the QWERTY pad is too small for my big hands and makes texting slower and I ended up replacing with a BB Curve.  I even picked this up for only $15 used on Amazon.com.", "Date": "February 14, 2012"}, {"Title": "bad phone", "Author": "Lance213", "ReviewID": "R1QFTDS0NMFPQ1", "Overall": "2.0", "Content": "this phone is not really good if you can find a better choice i advice you to this phone is really old technology the menu is not really good the trackball is not very responsive and the dialing pad is not very convenient to use so all and all if you can find a better phone for your choice go with it instead of this one.", "Date": "January 17, 2012"}, {"Title": "There is no sim card slot!", "Author": "Lian Zhu", "ReviewID": "R3TQU9AEN41ZRU", "Overall": "1.0", "Content": "There is no sim card slot in this phone! and it didn't mention that in the description! Now what am I supposed to do with this phone? Just threw it away? I hate this phone!", "Date": "September 9, 2013"}], "ProductInfo": {"Price": "$56.86", "Features": "Add to your Verizon Contract or Other Prepaid Service Account\nTop Quality Cell Phone Satisfaction 100% Guaranted\nPhone, email, text messaging (SMS and MMS), browser, instant messaging and organizer applications in a single smartphone\n2.0-megapixel camera with built-in flash and 5x digital zoom\nMedia player with audio and video playback in a variety of formats", "Name": "Blackberry Pearl 8130 Silver (Verizon)", "ImgURL": "http://ecx.images-amazon.com/images/I/411sSrKW4UL._SY300_.jpg", "ProductID": "B004HNLOSI"}}