{"Reviews": [{"Title": "Beware wide spread HTC Random Reboot Loop!", "Author": "hanes", "ReviewID": "R3AJBY31EAZEMH", "Overall": "2.0", "Content": "I have been a happy owner of the HTC Incredible for just over a year.  For almost all of that time, I have loved the phone.  Recently, however, I have run into a problem that has led to a complete change of heart, and I have come to discover that I am far from alone in this problem.  I hope this review saves someone else from this same problem.Basically, my phone (like thousands of other phone from HTC) suddenly began randomly turning itself off and rebooting on it's own.  At first it was just an annoying inconvenience, but then over the course of a couple weeks the frequency of these random reboots increased and then began going into a never ending reboot loop.  It would be sitting beside me on my desk or bedside table, with no activity from me, and suddenly I would hear the \"Droid\" tone as it began rebooting.  But as soon as it finished that part, it would reboot again ... and again ... and again ... and again ... and - well, you get the picture.  This would continue until I took off the back and pulled the battery.  If I put the battery back in immediately, it would just once again go into this reboot loop of death.  If I left the battery out overnight, it would function again the next morning, but later in the day would began this fun process again.Google \"HTC Incredible reboot loop\" and you will see over 20,000 hits mostly containing similar reports from frustrated Incredible owners.  Then look a bit deeper and you'll find that neither HTC or Verizon will admit any problem or offer any help if, like me, you are 6 days out of the 1 year warranty period.  Even those under warranty are replaced by refurb Incredibles which themselves have a high incidence of the exact same problem.How they can profess ignorance of this when the web is filled with tens of thousands of complaints, and even their OWN customer support forums have more than 45 pages and 54,000 views is, apparently, one of those mysteries of cellular customer service life!Too err is human, but you should own up to it and make it right, not pretend it is an isolated incident that you can wash your hands of and walk away.  HTC & Verizon are learning that again, as their latest greatest (the Thunderbolt) developed widespread similar random reboot issues following a recent firmware update, which almost bricked the majority of the Thunderbolt phones.  I understand another firmware fix was able to correct that, but clearly HTC has some serious quality control issues on it's hands.In short, I loved my Incredible for a year, but that can't make up for spending that much money on a phone that suddenly becomes essentially unusable, backed up by a manufacturer and wireless provider who both bury their heads in the sand instead of doing the right thing and correcting the widespread problem.  I will not be buying any HTC product in the future.Buyer beware. I wish someone had warned me about this.", "Date": "July 21, 2011"}, {"Title": "Awesome Product.. i truly incredible", "Author": "Kunal", "ReviewID": "RPWE1XUDDYCNC", "Overall": "5.0", "Content": "The product is amazing..seems just what i wanted.. Its can do almost everything that you can expect from a smart phone.. I am lucky one to get the 2.3.3 Android OS upgrade in first week. I use most of the application with WiFi, but the 3G also works good. The GPS is ok.. cannot compare with Garmin GPS. The phone has actually relieved me from using my laptop to keep updated with my mails and FB and other online friends.. there's much more that you will like in this phone..I was looking for almost 2 months and then decided to go for this. I am actually a Nokia fan, but with this product i really think Nokia Symbian OS has to go a long way !", "Date": "May 27, 2011"}, {"Title": "Great Phone and Great Seller (FGS Trading)", "Author": "Shac", "ReviewID": "R29ZPE9T32SYIZ", "Overall": "5.0", "Content": "I bought two of these phones and they are wonderful. I won't get into tech specs since it has been covered by many mobile sites. The phone itself is pretty slim and feels good in the hand (easier to handle than my HD2). With moderate to heavy use I only notice a about a 40% drop at the end of the day, so I estimate one could easily get 2+ days of use before recharge. My HD2 with froyo would use approx 70% a day doing same the tasks.As for apps they all work as they should, along with Tango which works perfectly for me. Also I'm not sure if its Google blocking certain apps for compatibility issues since this phone is so new but many apps I use I can't find on android market anymore i.e. Angry birds (all except beta),system panel, es file explorer and a few others. I did side load them but since I didn't install them from market I don't get the option to update which kinda sucks. Also one phone came with the updated market place (the one with the green design)and that one received the upgrade to Android 2.3.3 as soon as I connected to a wifi hotspot and the other came with the older market (the grey one) and didn't get a prompt for Gingerbread even if I try to manually search for update it comes back saying \"No system Update Available For Your Device\". Also Updating to 2.3.3 doesn't lock your phone just in case anyone was wondering.I got both phones from FGS Trading and both units were brand new, all protective wrapping was still on the phones and all accessories were included. Shipping was also very quick as I got them like 3 days before the estimate arrival date. The phones I received were Chinese models which came with 3 language options, 2 Chinese ones and English (Hong Kong SAR), a free 8GB Sandisk class 2 microsd card, Htc headset, micro usb cable and Htc usb charger with a 3 pin Chinese/UK head and also a UK to Us adapter which works fine. I really don't see an issue with the adapter because it works but us buyers can just get the official HTC us head. We use UK 3 pins plugs locally so it was perfect for me.UPDATE 18/6/2011 - All the apps I noticed I could no longer find on the market place are back (Angry birds etc.). There is a slight echo on voice calls, you can hear yourself echo but the person can't hear it. 720p video seems less jittery with 2.3.3 upgrade but maybe it's just me. Alpharev is coming out with a s-on root really soon so maybe you should hold off updating to 2.3 because I'm not sure if it will support Gingerbread.UPDATE 15/8/2011 - The slight echo I mentioned disappeared one day and never returned. Phone has been great and has easily produced 2.5 days of light to moderate use on a single charge (this is with data off btw). Only issue is wifi coverage, it is really poor versus my hd2. Max reach is about 30ft away thru 2 6\" cinder block walls from router. HD2 would get about double the range before it lost connection. As of writing I have sold this phone to upgrade to a Galaxy S2 and the speed difference is amazing but the build quality with the incredible is better in my opinion.", "Date": "June 13, 2011"}, {"Title": "Excelent Phone", "Author": "Vitor Santos", "ReviewID": "R1S9WAUG5JD1TM", "Overall": "5.0", "Content": "PROSIncredible S is a very capable device with good battery and worths the money depending on what meets your fancy.It comes off as a sturdy looking device, easy to grip, good internal storage and offers a very good camera functionality.The Incredible S is running with a Qualcomm 1GHz Snapdragon CPU supported by a plentiful 768MB of RAM and 1.1GB of ROM. The Super LCD display is four-inch and WVGA 800x480 resolution. The Super LCD screen on the Incredible S exhibited top-notch color reproduction, excellent contrast, and terrific outdoor screen visibility (not very far from Super AMOLED)Battery life on the Incredible S was very, very good, thanks to its relatively large 1450mAh battery. Under a heavy use scenario, you'll get through a day and a half. With moderate use it can go about two full days.For radios there is Wi-Fi (with N support), Bluetooth, FM, and UMTS with HSPA+ support. It can do UMTS 900/1700/2100, allowing it to work in Europe or on T-Mobile in the USA. The camera on the back can take 8MP photos and 720p videosThe Incredible S does also a neat trick...the buttons can rotate when you flip the phone into landscape!There is also notification LED notification (for me is essential!!!!!) behind the top speaker grill which blinks green when you have a new email, SMS, or missed call (configurable in Settings), or glows amber when charging.The Incredible S ships with Android 2.2.1, but HTC already made available a refreshed version of Android 2.3 Gingerbread. I will install this weekend...From a performance point of view the Incredible S (Quandrant 1518) has nearly identical specs when compared to the Desire HD and on top of Nexus One, Moto Droid X and Samsung Galaxy S...CONS- Doesn't has dual-core (not real important since the apps are not optimized yet to dual core processors)- Lack of video out could be an issue (not important for me)- HTCSense.com is not working properly for this phone (not really the phone to blame)", "Date": "May 7, 2011"}, {"Title": "Nice phone, FGS Trading review", "Author": "Cem", "ReviewID": "R3D0WS4HBEC3DV", "Overall": "4.0", "Content": "I am not going to go much into reviewing the phone itself; many sites (such as Engadget) have very informative reviews on the phone. What I'll say is: it is an overall good solid phone, with a sturdy, stylish and minimalist construction from HTC, much like its other recent phones. Has a 4 inch Super LCD screen, which I think is the optimal size for a smartphone and the quality is very good. The hardware specs are good but not stellar, has a single core Qualcomm 1 GHz CPU and Adreno 205 graphics, which are kind of standard in higher end smartphones now, but they are very sufficient for most daily and casual gaming needs.Has the new HTC Sense interface, fluent and does not lag (unlike my original Incredible prior to Froyo update). By the way comes loaded with Android 2.2.1 (Froyo), but it is said that 2.3.3 update (Gingerbread) is currently rolling out, while I have not received it yet. I haven't used it very thoroughly yet, but battery life seems very good, it is said it can go 2 days with light usage. One thing I really noticed and liked is the camera quality, 8 MP camera does a really good job, e.g. takes good photos in low light conditions, unlike many other phone cameras.I bought phone from FGS Trading, didn't have any problems with shipping. Phone appears to be brand new; the corners of the box were a bit worn, also it came with a UK/Hong Kong AC adapter, but they did throw in an extra European-to-US plug adapter, which is of course useless. It also includes a pair of headphones with microphone, an 8 gb SD card and of course the micro USB cable.The phone language was initially Chinese, there are a total of 3 options, 2 Chinese ones and English (Hong Kong), though it does not seem any different from US English. However as in other HTC phones, it includes numerous languages for keyboard and typing prediction. The phone worked with T-Mobile in the US, I think the 3G connection also works. Overall I am satisfied with the phone and my purchase from FGS Trading, the only dissatisfaction being the AC adapter.", "Date": "May 15, 2011"}, {"Title": "Phone and vendor", "Author": "Scott", "ReviewID": "R1KOQ6MWBLF3SW", "Overall": "5.0", "Content": "This is the second HTC Incredible I've owned -- it's a perfectly good phone, so why not buy a cheaper same-phone replacement rather than an expensive new and different model? The vendor was very helpful and prompt.", "Date": "October 27, 2013"}, {"Title": "Still kicking.", "Author": "Allan", "ReviewID": "REDV0MNK58BCG", "Overall": "4.0", "Content": "Bought this product a while back with the older android OS. when I updated a year later to ICS I was blown away. The power of this device really showed with the new OS, very fast and does all the advanced features very well.Thanks HTC for pushing out the upgrade, gave me value for this almost two year old phone.", "Date": "February 5, 2013"}, {"Title": "Trully amazing phone.", "Author": "Tatiana", "ReviewID": "R1O42V6363B645", "Overall": "5.0", "Content": "I have had my phone for over a year and it's been amazing. It has a large, bright HD screen, loud and clear sound and an 8 mega pixel back camera, which focus's on objects with just a tap on the screen, it also has a selection of modes such as  Portrait, Auto, Landscape etc and a 3 mega pixel (I think it's 3) front camera.I had drop ped it and it made a few dents so it isn't that solid, but I did drop it on really spiky cement.I would highly recommend this to a friend.", "Date": "December 14, 2012"}, {"Title": "Works for AT&T;", "Author": "James", "ReviewID": "R2VM0SLIL3MUO0", "Overall": "5.0", "Content": "I bought this S710e from Taiwan and it works in AT&T; network in USA. Nice phone and battery life is great. It last 2 days between charges.", "Date": "April 27, 2012"}, {"Title": "Great Phone but still misses some things", "Author": "D. J. Waugh \"\"You can stuff your sorries ...", "ReviewID": "R1ED9J9PCX0NB0", "Overall": "4.0", "Content": "I just bought the Incredible S and overall I am impressed. It is my first Android phone after coming from a long stream of Nokias (most recent 5800 XpressMusic).As always when you change phones there are things you miss. It's possible that many of my comments may be android related and not specific to HTC, but for the sake of the review, I will mention things in general....Good: Screen Resolution, Countdown timer, Mail appScreen: The screen resolution is great, as someone who watches a lot of video, I am very happy with it. It is very easy to use and the touch screen is very good.Countdown Timer:It has a countdown timer, might not seem like a big thing, but my last phone (Nokia 5800) didn't have one.Mail App:The Mail app is very good, it's very customisable with downloading emails, you can specify a peak hour range and how often to sync, you can also add multiple accounts and view all accounts at once, rather than separately. I added my hotmail and Gmail accounts, Gmail had to be added manually as I use pop3 not imap....Bad: Standard Video Player does not remember last position, no notes app, no stereo speakers, incompatible with some headsets, gmail app, Bloatware, GPS apps, lack of sound profiles. Edit: Cannot set Fortnightly Calendar reminders.Standard Video Player does not remember last position:this is really annoying, every time you start a video it starts from the beginning again. I downloaded MX Player from the app store and it works well, does show ads when paused, still works when offline and doesn't miss any features you would otherwise want in the pro version.No notes app:There is no Notes app standard, this is a ridiculous omission as it's something everyone uses. I downloaded Note Everything free. It is a great notes app, doesn't require internet and can import notes. I sent my notes by Bluetooth and then imported all from the sd card. It can also do hand written notes and voice notes.No stereo speakers:I know it's not common but my 5800 had stereo speakers, still has adequate sound though.Incompatible with some headsets:I have been using the headset from my Nokia 5800 as they are the most comfortable, however, if I don't have the call button pressed the music lacks volume and you can't hear the lyrics. Sticky tape fixed that though.Gmail app:The Gmail app is not very configurable and really I see no benefit in using this instead of the much better mail app.Bloatware:My phone came with bloatware (from another supplier) which as usual can't be removed without rooting the phone.GPS apps:Symbian may be old but Nokia are light years ahead with Ovi Maps. The Locations App is better than Maps in that you don't need to use data to plan a route but it needs a licence from HTC to use navigation. Google Maps beta navigation only gives voice instruction if you stay on the route it plans, if you deviate you get no voice commands if you dont have the data on. The functionality of both is woeful. They have a long way to go to catch up. I will be continuing to use my Nokia just for the free excellent Ovi Maps. I have also had difficulty getting a GPS signal at times, if i ensure Wifi is off it gets the signal ok.Lack of sound profiles:Also another place where Nokia have it right. There are only three profiles, Normal, Silent and Vibrate. What happened to Meeting, Outdoor, Custom etc!? Meeting in particular would be good where you can set the phone to do a single beep on calls and messages. I have only found one app (Meeting Beep) but it didn't work. All you can change is the ringtone, media, notification and alarm volume, but there is no way to save it. If you have it on Normal and want to have medium notification volume but no ringtone volume, it automatically changes to silent. Edit: Meeting Beep has been updated and now works.Fortnightly Calendar Reminders:You cant set fortnightly repeated events. You can do One Time Event, Daily, Every Weekday, Weekly, Monthly (on the day eg. every 3rd thursday), Monthly (on the date, eg every 19th) and yearly. This is a massive oversight by HTC. Apparently it can be done if you sync with your google calendar (which i dont use) and you should be able to with PC sync (i hope). I like to set my calendar up in my phone itself and to leave out something like every fortnight is quite strange. Edit: I have been able to sync with Outlook 2007 to set a fortnightly reminder, still shows as weekly on phone but is actually fortnightly.Overall, it's a good phone, but there are areas that are badly missed.", "Date": "April 12, 2012"}, {"Title": "Great Phone", "Author": "Kriston Greaves", "ReviewID": "R3FQWWS9JH0RYS", "Overall": "5.0", "Content": "Arrived quickly and in great condition. Had it for about 10 months now and I love it. Would definitely recommend.", "Date": "December 8, 2011"}, {"Title": "Freakin Awesome!!!", "Author": "Reforged", "ReviewID": "R18X4NIXVSMW2K", "Overall": "5.0", "Content": "Best phone by far! Will never want another phone. Features are everything you need and stays fast if you keep it clean from unneeded apps.", "Date": "November 4, 2011"}, {"Title": "Great phone", "Author": "Pravin", "ReviewID": "R2S56XK3JTXDER", "Overall": "5.0", "Content": "HTS Incredible S is really great phone. After downloading android 2.3.3 It has great UI. This phone contain all the functionality like I get internet via 3G and using wifi hot spot I can use same net connection for my PC and laptop. This is really a great functionality provided by this phone its becomes like router and multiple use of one connection. It has great camera 8 mega pixel. Android market having more then 2.5 lakh application so there are lots of app useful for our normal use. The only thing is warranty about this phone that is not given by seller but there must be some support provided for this. All other things are very fine. I am really happy to tell everyone who wants HTC phones to buy this phone this is really giving great competition to Apple phone.", "Date": "August 12, 2011"}, {"Title": "nice product", "Author": "maheshbhai", "ReviewID": "RPCVV8DSBMS04", "Overall": "5.0", "Content": "really nice product and good service. i wish to buy again from this product. nice one. i really appriciate. thanks.", "Date": "April 14, 2011"}, {"Title": "As his name says, it is Incredible!!!", "Author": "eddy01", "ReviewID": "R19MJGXNI5WEEH", "Overall": "5.0", "Content": "As his name says, it is Incredible!!!I wanted a new smartphone, I saw several models and brands, and I think HTC is the best, and Android OS has very very good features.I enjoy my Incredible S.If you want a real smartphone, HTC is a excellent choise.", "Date": "April 20, 2011"}, {"Title": "Defective screen", "Author": "Gazme", "ReviewID": "R44H1DA30LAJK", "Overall": "2.0", "Content": "I was in a hurry to get the phone and it was actually important to get as soon as possible, that is way I ordered one day shipment.  But when I got the phone I realized that the phone screen was defective. There were two lines of defect on the screen which can be seen under the light when the phone is off. I returned the item and waiting for refund. I will update when I get the refund. But it was really very disturbing for me and this is the first time I had such an experience on Amazon though I used Amazon very often.", "Date": "July 10, 2011"}, {"Title": "How wonderful the HTC incredible S is~", "Author": "Eason", "ReviewID": "R8XX5XM8VZ26R", "Overall": "5.0", "Content": "This is the first smartphone I bought and it's amazing.I used it everywhere and the app. I downloaded was very useful which makes my life easier.Hope everyone would choose the same smartphone as I bought.", "Date": "May 2, 2011"}, {"Title": "So far so good", "Author": "Victoria", "ReviewID": "R34ARAB7DHBVYH", "Overall": "5.0", "Content": "I got this phone from FGS Trading. The so-called international version means that its language is English (India). No other options.This  HTC 710e model is really thin and cool, but it's a little bit hot when I run multiple programs like music player.But overall it's a nice phone.", "Date": "May 6, 2011"}, {"Title": "good gadget but...", "Author": "A. Bahhary", "ReviewID": "R2BW10KKCTNL8R", "Overall": "4.0", "Content": "this phone is a good gadget, maybe the smartest phone out there so far...but this seller sells it w/o warranty? how about the manufacturer warranty? does it have one or not?", "Date": "March 29, 2011"}, {"Title": "HTC Incredible warranty is worthless", "Author": "Joel Morris \"JEM\"", "ReviewID": "R3CAZ3ZPJKJSSD", "Overall": "2.0", "Content": "I bought the HTC Inredible a couple of months ago. I sent it back to HTC because of a defect and asked for repair. They declined under-warranty-repair and charged me 44.00 to fix and send back. They refused to offer reason why they would not cover it. I called Verizon to complain and they credited me the amount on my bill. I love Verizon, but I will never purchase another HTC product.", "Date": "May 12, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "2G Network\tGSM 850 / 900 / 1800 / 1900 3G Network\tHSDPA 900 / 2100\nDISPLAY\tType\tS-LCD capacitive touchscreen, 16M colors Size\t480 x 800 pixels, 4.0 inches  \t- Multi-touch input method - Accelerometer sensor for UI auto-rotate - Proximity sensor for auto turn-off - HTC Sense v3.0 UI - Touch-sensitive controls with rotating icons\n3G\tHSDPA, 14.4 Mbps; HSUPA, 5.76 Mbps WLAN\tWi-Fi 802.11 b/g/n, DLNA Bluetooth\tYes, v2.1 with A2DP, EDR\nCAMERA\tPrimary\t8 MP, 3264x2448 pixels, autofocus, dual-LED flash Features\tGeo-tagging, touch-focus, image stabilization Video\tYes, 720p@30fps Secondary\tYes, 1.3 MP\nCPU\t1 GHz Scorpion processor, Adreno 205 GPU, Qualcomm MSM8255 Snapdragon", "Name": "HTC Incredible S S710E Unlocked Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/31VPphVWiCL._SX300_.jpg", "ProductID": "B004QMKE6S"}}