{"Reviews": [{"Title": "Excellent Phone, very clean, very good condition", "Author": "JED", "ReviewID": "R3C4LT95YSMPMQ", "Overall": "5.0", "Content": "My sweetheart had one of these since 2005.  Recently, the phone ceased being capable of charging its battery (even a new one).  I secretly suspect that she had plugged an unauthorized charger into it, ruining the charger electronics.  Her contract with Verizon was well past two years, so she was eligible for a free phone.  We looked on Verizon.com and everywhere on the internet, but she could not find a phone like her pink Motorola RAZR phone.  My sweetheart wanted a pink RAZR phone just like the one she had.This product filled the bill exactly.  It is the spitting image of her old phone and every feature works great.  It was thoroughly clean outside and all previous numbers and data had been removed inside.She loves her `new' (reconditioned) phone!My sweetheart is 76.", "Date": "September 12, 2011"}, {"Title": "Get It Now or Get It Not.. it's a gamble", "Author": "Roger Williams", "ReviewID": "R1D9YFTPW0BZ3F", "Overall": "2.0", "Content": "The phone that I received was rated as being in \"very good\" condition yet the entire Get It Now/Media Store function refused to work. This is a problem that Verizon Wireless is aware of and has no plans to do anything about it. Details can be found in my review here: http://www.amazon.com/review/R3CD4BYNT4DA46/ref=cm_cr_rdp_perm (I'm not allowed to duplicate my own reviews.. even if it is for the same problem on essentially the same product).If downloads are important to you, beware because many older Verizon phones just can't do it anymore.. and the sellers don't seem to know anything about it. I sent four requests to four different sellers requesting information as to whether their phone's Get It Now/Media Store was removed and didn't get a single reply. I emailed the seller that I bought mine from, I was told that the phone was \"completely functional\" in spite of the fact that it was missing the Get It Now/Media Store (functionality that is contained in the description of the product). I was offered a refund but couldn't find a seller that would tell me if their phone worked or not.. so what's the point.Thanks a lot Verizon for breaking so many phones and thanks to the sellers that don't even know that the equipment they are selling doesn't work correctly (my seller didn't even have a Verizon account to test his phones with!).If you only make and receive calls and texts, this probably doesn't apply to you. If you want to use ANY of the phone's extended features (ringtones, music and video downloads or any application such as Navigator, Facebook, Backup Assistant, etc.), check with the seller to make sure the phone they're selling isn't suffering from the missing Get It Now/Media Store catalog problem.NOTE TO AMAZON: The material in this review is completely of my own composition and pertains to a number of Verizon phones. This review was composed first in Word to take advantages of Word's spelling and grammar checker, but was composed solely for use in Amazon's review section to review the specifically mentioned products (in this case the Verizon V3m in pink). Any similarities between this review and any other review that I have written is due to the fact that the problem that I detail in this review directly affects over 50 different phone models, not just the one I bought. Different products, exact same problem.", "Date": "September 18, 2011"}, {"Title": "Charger broke and battery died within two weeks. Stability issues within months", "Author": "Jason", "ReviewID": "R13MB1LVFUMFSE", "Overall": "2.0", "Content": "Purchased used - this review is not about the phone in particular, but in the one received from the seller. Additionally, due to time constraints I did not attempt to take advantage of any guarantees.Purchased for my wife - she was sick of her smartphone and wanted to go back to the past. It came with a charger and a battery.The charger was aftermarket, and the connector was of very low quality - it broke within a week or so. Because Motorola back in the day tried to force you to use \"genuine\" chargers, I had to get a Motorola charger.Then the batter stopped holding a charge a week or so after that. I believe there was a guarantee, but we had to go on a trip and didn't have time to wait - so I grossly overpaid for a batter at batteries plus.Things were going ok, but eventually the 0 button stopped working reliably a few months later, then the phone starting locking up a month or so after than. Several factory resets and hours later it was stable again, but only temporarily...Pretty sure we got a lemon. It is now in the trash.Moral of the story is that if you have issues, be sure to get ahold of the seller right away.", "Date": "September 1, 2013"}, {"Title": "Not happy", "Author": "stephanie", "ReviewID": "R2D6G5OQP337A3", "Overall": "2.0", "Content": "I specifically ordered this particular phone because of the \"little to no scratches\" , not the case here. Screen is scratched inside and out, the phone looks like it was dropped on the corners a dozen times at least, scratches on the back also. This seller needs to be a lot more specific to the condition of the phone. Pictures would be an excellent idea, I didn't turn the phone on yet I hope it works.", "Date": "January 10, 2014"}, {"Title": "Bad phone", "Author": "E. Salcido", "ReviewID": "R4N5J86CJGESF", "Overall": "1.0", "Content": "It would not work at the verizon store. We tried a they said it wouldn't work. Disappointed with this phone", "Date": "December 30, 2013"}, {"Title": "Not Happy", "Author": "H Ludwig", "ReviewID": "RU23BQQWIDS2Q", "Overall": "2.0", "Content": "The phone was ok but battery must have been junk would only stay charged for 1 day and after 2 weeks  the sound went completely bad, could not hear incoming or out going calls, ended up purchasing a new phone from Verizon, so much for the LIKE NEW advertisement!", "Date": "November 9, 2013"}, {"Title": "Love this phone", "Author": "Jo Ketner", "ReviewID": "RGP7N6LSNN2GP", "Overall": "5.0", "Content": "I really like this phone.  It has better reception than my last phone.  Less dropped calls and clearer voice reception.  Like the size and how easily it opens.  I am even getting used to the pink color.", "Date": "August 23, 2013"}, {"Title": "Exactly what I wanted", "Author": "Wilderness Folk", "ReviewID": "R3LMRVNQY981YA", "Overall": "5.0", "Content": "I am not a texter so this phone is perfect.  Flat, easily fits pockets and all menus are and controls are clearly understandable.", "Date": "March 5, 2013"}, {"Title": "terrible!!!!", "Author": "yezenia04", "ReviewID": "R47JTTAR2TLT8", "Overall": "1.0", "Content": "this phone is terrible, as soon as i received the phone i realized that it wasnt charging at all...dont buy a used phone from amazon...its terrible. when i plug the chaarger it says complete charge after 1 or 2 min of using the phone it starts saying low battery...i had to talk on the phone while it was pluged on the wall...bad experience hopefully ill get a complete refund..", "Date": "October 23, 2012"}, {"Title": "not worth the money", "Author": "ciajo", "ReviewID": "RJ8SFM1PING6U", "Overall": "2.0", "Content": "I had a phone like this before ,and had no problems, this phone even with a new battery with not hold a charge, I would never buy a used cell phone again. It has been plugged into the wall more than used to talk on.", "Date": "February 28, 2012"}, {"Title": "Used Cell phone", "Author": "Amazon Customer", "ReviewID": "RC8DC8CGTAAN4", "Overall": "1.0", "Content": "This phone doesn't stay charged and when the battery gets low it will not send text without notification the text didn't send. Has cause major headaches!!  Sorry I got rid of my other phone, it worked much better than this one.", "Date": "December 21, 2011"}, {"Title": "pink verizon razr cell phone", "Author": "pete kubena", "ReviewID": "R1LX462LAM37SG", "Overall": "5.0", "Content": "thank you for the corrections that you made on my order & for sending the rest of my items very very quickly.  i will def recommend your store!  thank you again.", "Date": "September 25, 2011"}, {"Title": "Flimsy", "Author": "txgemini \"kschold\"", "ReviewID": "R4U350DQURW0", "Overall": "2.0", "Content": "I wasted the $90 I spent on this phone.  The keypad became nonfunctional over about four months. First the green button that makes a call, then certain numbers, then the directional arrows.  If you drop the phone even once, on any surface, it won't turn on until you remove and put back the battery, and even then it's finicky. Most of the claimed features do not come w/the phone.  You have to have the Motorola syncing software.", "Date": "September 17, 2011"}, {"Title": "WHAT A LET DOWN", "Author": "marissa pattea", "ReviewID": "R1GWJXL37N7CVH", "Overall": "1.0", "Content": "I WAS VERY DISAPPOINTED WITH THIS PHONE. IT ONLY STAYS CHARGED FOR SO LONG. I WOULD NOT RECOMMEND TO ANYONE.", "Date": "October 8, 2013"}, {"Title": "Motorola V3m Razr review", "Author": "Kalia", "ReviewID": "R2OAF1A06YDPBN", "Overall": "3.0", "Content": "I don't like that you can't personalize anything on the phone. Not settings, not layout, not directional keys, nada. It's difficult to navigate and doesn't have the wide variety of options for viewing messages by contact vs individual message. You also cannot send or I think receive video messages. Has a decent camera however. Also with a used phone the battery life and the battery itself are crap. Wouldn't make this purchase again but is a good phone to get you day to day if yours is broken/defaulty like my old one was.", "Date": "October 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004VG84VQ"}}