{"Reviews": [{"Title": "Cool phone!", "Author": "cesar", "ReviewID": "R2IZ0JIO776MZD", "Overall": "5.0", "Content": "I bought this unlocked sidekick fully aware that the internet and picture messaging were not going to work. I just bought this phone to talk and text. I popped my sim card in and it worked. The phone looks cool and the swivel screen is the sidekick signature.  I have at&t; and the voice calls were pretty clear. Glad with my purchase. I recommend for anyone wanting a phone to talk and text. If you are looking to use it for internet then this might not be the phone for you.", "Date": "March 3, 2011"}, {"Title": "Sidekick LX 2009", "Author": "roadrunner", "ReviewID": "R2Z3Q1JGH2L8A4", "Overall": "5.0", "Content": "Great phone and came with everything listed.Just take note that when you are using the option \"Phone & Text\" you cannot-Have a passworded keyguard-Access internet-Send or receive pic messages-If phone crashes or battery yanked out, contacts and text messages saved to phonewill be erased.Specifically with AT&T;-If you yank out battery or phone crashes/turns off in any abnormal way, your sim card phonebookmay get erased however do not panic, turn off the phone and then turn it on again and the contactsSHOULD recover. I highly recommend getting a back up sim with all your contacts on it just in case.Besides those few issues, it's a great and beautiful phone and is quick to text. I love it andcan easily tolerate the issues. The calls are surprisingly clear (speakerphone is however very quiet)Battery lasts a good two days with consistent texting.", "Date": "April 13, 2011"}, {"Title": "DO NOT BUY THIS!!! Unless you only talk and text.", "Author": "KYLUVSM", "ReviewID": "R11ZKUMKF4MJKK", "Overall": "1.0", "Content": "I know quite a few people who have recently brought this phone and can't acess the internet and no picturing messaging because T-Mobile has closed all severs for wireless connetivity. All you can do is talk and text. Even if you have a data plan with T Mobile and you put a TMobile sim in the phone, it still won't work. What's worse is T Mobile customer service tells people they can can still access internet on this phone until you talk to a repersentative that knows what their taliking about.", "Date": "June 11, 2011"}, {"Title": "Piece of junk....", "Author": "Bodasity", "ReviewID": "R2A9LG1MDFP3QI", "Overall": "1.0", "Content": "I have owned this for about 4 months and this is what I've found.Let me go a little in depth into the good and bads:Lets start with the good...1. Cool phone.  When you use it people notice because it is such an original design.  (main reason I like it)2. Awesome keypad.  It is perfect for a texter and the button size is great for someone that can't see all that well.3. Battery life. Lasts about two days of heavy(ish) use.  I have gotten 3 days out of it.Now let me go into the bad...1. Not exactly user friendly.  Slow to navigate and a little unwieldly.2.  Back cover doesn't want to stay on.  No matter how hard you try it won't stay on.  I can just pull it out of my pocket and the back will slide off.3.  Some weird HUGE glitch in there OS.  For some reason when the phone is on for more than 2 days without turning it off, it will basically become inoperable.  The camera won't work and you won't be able to call people.  You won't be able to push certain buttons or respond to texts.  If you try to shut it down to try to get it working again, it won't work.  You have to remove the back and pull out the battery.  THEN it takes about 5 minutes to start up to operable speeds. (has a weird glitch where it won't work smoothly for the first couple of minutes.)This is the SECOND phone to have this issue that I have owned.  I sent the first one back and the second came with the same issues.I wouldn't want someone like my daughter to be in a jam of some kind and then all of a sudden to wait five minutes to remove the battery and wait for it to restart.What if she needed to call 911?I would never recommend this product to anyone.  Cool phone but way too many drawbacks.", "Date": "February 20, 2012"}, {"Title": "PERFECT GIFT !!!!!!!", "Author": "frios", "ReviewID": "RTIWLYR51KU8Q", "Overall": "5.0", "Content": "I bought this  phone for my teen-daugther, before Christmas, it's still working perfectly and she is very happy with this...............I received the phone very fast and it has all the accesories..........Great purchase!!!", "Date": "January 23, 2011"}, {"Title": "it's ok", "Author": "Jordan", "ReviewID": "RTXSMFX4SNN02", "Overall": "3.0", "Content": "the sidekick is ok.  nice looking but a bit big.  i like qwerty keyboard vs. the touch screen :p  the different color flshing lights are nice.  dialing numbers is irritating...and not much options.  and it doesn't seem to have a calculator...bummer.  i'll still keep it....but it's not outstanding.", "Date": "May 18, 2011"}, {"Title": "Delivered early and came fine but didnt include the microSD card!", "Author": "T", "ReviewID": "R3P8CUE0UOF8WG", "Overall": "4.0", "Content": "I am happy that I got the phone its in great condition and came a day before the delivery estimate. It worked fine from the start and I love!! The only thing I'm a bit mad about is that the micro sd card wasn't included when it shows that it does clearly on the box. I'm wondering if the OEM shop took it out or.....All in all, great product I would buy from them anytime.", "Date": "May 19, 2011"}, {"Title": "Awesome Phone - Good Job", "Author": "Elliot", "ReviewID": "R1A4YROWEG8SND", "Overall": "5.0", "Content": "Got my phone in 2 days. Came in simply perfect state. I can't describe how happy I am with my purchase; everything was smooth and hassle free. Couldn't ask for more!If you're thinking about buying this item but are hesitating, don't doubt it. I didn't, and I don't regret it. Everything was so good. Awesome seller! If I could, I would give them 10 stars.", "Date": "April 28, 2011"}, {"Title": "Good Phone", "Author": "Nicholas A. Risoni", "ReviewID": "RLP54DF7I81Z", "Overall": "4.0", "Content": "so lemme just say right off the bat that if you are getting this phone for at&t; it only has text and talk, you cant get ringtones or change the one on the phone,it also goes for wallpapers. you also cant get internet. this is strictly just a talk and text phone . i got this phone for texting cause i do aloooooottt of texting and i needed a phone that can handle it. i dont use any of the things i listed before so none of that affects me. if your looking for a fancy phone go buy an htc, or droid, and pay out the ass for it. i like this phone and it came unlocked all i had to do was put in my sim card and it worked i reccomend buying from these guys u wont be dissapointed .", "Date": "October 20, 2011"}, {"Title": "it works for me", "Author": "smiles", "ReviewID": "R1OKPXVAYHRFCC", "Overall": "4.0", "Content": "this product turned out really great my atandt plan only lets me talk and text and thats what this phone does for the price and looks im am super satisfied with this purchase and it shipped in 2 days for free", "Date": "October 20, 2011"}, {"Title": "MORE THAN EXPECTED", "Author": "John D \"John D\"", "ReviewID": "R2GJZVPAMSNAWG", "Overall": "5.0", "Content": "Installed my T-Mobile Sim Card, 8 gig memory card and it works.It may not have internet as such, but if you have an internet plan of some kind, I would try it anyway.The phone browser is OPERA MINI (If you install it) I did not bother as I do not need internet.IT DOES HAVE TEXT AND PICTURE MESSAGING FOR SURE. It also has audio messaging.The camera works just fine.The keyboard is large with good space between keys.The battery however needs an initial charge of 24 Hours before use.", "Date": "February 21, 2013"}, {"Title": "Mobilicity Mobiflip/Sharp Jump", "Author": "Wesley Stokes", "ReviewID": "R1S7MRX8AVVAVR", "Overall": "4.0", "Content": "It's the JUMP version sold by Cincinnati Bell. You don't get the classic Sidekick boot up intro nor does it have the 'sidekick' brand on the screen. However it works just like the original sidekick minus a few things, such as email client, Catalog, instant messaging, and Web Browser icons. Which is fine since you wont be able to use those apps because the sidekick data plan was cancelled. You CAN send picture messages. All of the buttons work like they should, the phone came in excellent condition. I don't have any problems texting or calling, the speaker quality is REALLY good. But my only issue with this phone is that it wasn't what was advertised and it doesn't have the same themes or start up screen like the Sidekick 2009. But overall I'm happy with this phone.ProsPicture quality is really good in the right lighting.Battery Life is amazing.You can still customize the phone with themes.It's an awesome cell phone for something \"outdated\".When listening to music with headphones the sound quality is phenomenal.Screen resolution is awesome!You can change Facebook status' via text message (same for twitter)your also notified when someone comments on said status.You can add pictures to your contacts information.You can set a 3 digit privacy lock.ConsYour voice recordings in your mms can't be saved anywhere unless you want to use them as a ringtone.", "Date": "September 25, 2011"}, {"Title": "Sidekick LX 2009", "Author": "saltypirate22", "ReviewID": "RZ6J9VQXL9T0I", "Overall": "5.0", "Content": "I'm using the phone with AT&T.; Works great no problems. Since I'm using it with AT&T; I have no access to the internet which is why i went with the phone. It has everything I need and then some.", "Date": "August 21, 2011"}, {"Title": "great phone", "Author": "bruceh", "ReviewID": "R1XCLWC9U11GWW", "Overall": "5.0", "Content": "Product arrived when it was supposed to, works great. Text, call and hooked up bluetooth to my car. Great product. I bought product knowing I could not receive internet, read pervious reviews from other people.", "Date": "June 16, 2011"}, {"Title": "Muy buen equipo", "Author": "Jose Miguel Parra", "ReviewID": "RLDQSR9YMOGNH", "Overall": "3.0", "Content": "El equipo lo recibí en tiempo record. Vivo en Venezuela y funciona perfectamente con cualquier línea. Lo probé con línea Digitel y funcionó a la perfección. Excelente relación calidad - precio.", "Date": "June 12, 2011"}, {"Title": "Good phone", "Author": "Jose B.", "ReviewID": "R16F5CGX5Q9T5V", "Overall": "5.0", "Content": "I bought this phone for my son and he loves it. If u use it for AT&T; u can only text and call", "Date": "June 11, 2011"}, {"Title": "phone", "Author": "Carmen", "ReviewID": "R3G9LZZFSH7ZZ3", "Overall": "2.0", "Content": "Not good at all you press a lettler and sometihing came out different so I never returned which I should have done it", "Date": "June 2, 2014"}, {"Title": "diekick cellphone", "Author": "clayten pelep", "ReviewID": "R1RHHAGW7AN317", "Overall": "4.0", "Content": "it is a special product. this is the cell unlocked,,,, side kick. it is easy to type massages and online also. it has games and internet in it.", "Date": "November 20, 2013"}, {"Title": "Crappy phone.", "Author": "Brandy Ledbetter", "ReviewID": "R3A6WWRRLK4MPK", "Overall": "1.0", "Content": "A keyboard that wont stay closed slow and freezes frequently. This is the worst phone I have ever owned. DO NOT BUY>", "Date": "August 27, 2013"}, {"Title": "good", "Author": "marcovd", "ReviewID": "R2OJAS1JK4JWRI", "Overall": "4.0", "Content": "A very good buy as expected came at the right time without any problem. com is such shows and I'm happy with the purchase.", "Date": "March 19, 2013"}, {"Title": "wasted my money", "Author": "Robert", "ReviewID": "R10M8EGSNJJ291", "Overall": "1.0", "Content": "ok so i turned this phone on too see that the backrounds were differint from my last 09 sidekick,but i didnt think anything of it.that is until the problems.50% of the time i cant answer calls or call people or get picture messages,so then i have to turn off the phone but wait,when i power it off it freezes and just goes to a white screen.so then i have to take the battery out while the phone is still technicaly on,which any one who own a cell phones knows that thats not a good idea.unless you dont care about these problems i mentioned then go ahead this is the phone for you but i didnt buy a new phone to have these problems.i will not be buying from this company again", "Date": "February 26, 2013"}, {"Title": "sidekick", "Author": "azur", "ReviewID": "R1JQOQAX9WUEO2", "Overall": "5.0", "Content": "exactly what i was looking for and  hoping for. i needed a new phone because i didnt want to buy another one at Tmobile because they said i needed a new plan or buy a one for like 200 + so i was like nope and found this one instead.", "Date": "January 17, 2013"}, {"Title": "Bad re-charge socket", "Author": "Norman", "ReviewID": "R2TYKE2R91ZZ1L", "Overall": "2.0", "Content": "This phone only lasted a few months. The socket for recharging somehow broke and it will not recharge. I called the seller, \"UnlockedCellPhoneKings\", and found that they would only replace it up to thirty days. I would NOT purchase this phone again.", "Date": "December 4, 2012"}, {"Title": "Does not work", "Author": "A", "ReviewID": "R3S2ZV5823UDAJ", "Overall": "1.0", "Content": "I have had problems with this phone from the moment that it arrived.  Do not purchase this product.  It does not work.", "Date": "November 18, 2012"}, {"Title": "I think mine has a virus or something....", "Author": "Musicgal790", "ReviewID": "R1D6R7Y4NA46B8", "Overall": "1.0", "Content": "I've only had this phone for a few months and it keeps freezing and shutting down. I lose all my data and contacts, and its irritating to have to go and retype them all in over and over again!", "Date": "October 21, 2012"}, {"Title": "new phone", "Author": "adriana aguilera", "ReviewID": "R2N4IQRD9HHI1S", "Overall": "5.0", "Content": "the phone is in great condition and i like the updated version. the button keyboard is something that i was looking for.", "Date": "October 20, 2012"}, {"Title": "Great phone, great replacement", "Author": "Aussie Markus", "ReviewID": "R3FACT1IWL1ZFK", "Overall": "3.0", "Content": "In all honesty, I only bought this phone to replace my damaged one cheap and to keep my current plan. The phone is missing a few features I would like, but all in all is a good reliable phone.", "Date": "September 20, 2012"}, {"Title": "my sidekick", "Author": "juslin", "ReviewID": "R3S77PGXP5U1FZ", "Overall": "4.0", "Content": "this phone is a replacement for my flip phone which was soo simple to use... took me awhile with my grandkid's help to figure it out.. texting is very easy & it takes very sharp pix... one problem i find is hard to hear when i'm on the phone - a minor inconvenience...", "Date": "September 14, 2012"}, {"Title": "Kids ph", "Author": "Ginn", "ReviewID": "R2QASNKKYHYA0U", "Overall": "2.0", "Content": "The volume is not very low even on highest seting,battery backing does not stay in place. We had to tape it closed. Ubable to use internet data package with this model. Other than that works fine.", "Date": "September 13, 2012"}, {"Title": "Sidekick LX 2009 PV300 Unlocked phone with Qwerty Keyboard", "Author": "SMB", "ReviewID": "R2XTQ1FIQNBH34", "Overall": "1.0", "Content": "Unbelievable! This sidekick is not worth being a phone. It dropped all my calls all the time. Switches off itself as and when it wants. The moment it switched off it lost all the memory including contacts. Iam dissapointed, not in this era! awful.", "Date": "July 22, 2012"}, {"Title": "worst phone I have owned", "Author": "stella", "ReviewID": "ROOKRMFTY30SR", "Overall": "1.0", "Content": "This phone takes way to long to start up,too many buttons to push to use it, and continuously erases all contact lists.", "Date": "July 22, 2012"}, {"Title": "great service and product", "Author": "Deborah   Lennox", "ReviewID": "R1AZGQS6W26CKM", "Overall": "5.0", "Content": "Thanks for your service and great prices. Got my daughters bf a cell phone from you that he wanted as a graduation gift and he was totally happy.", "Date": "July 3, 2012"}, {"Title": "NO INTERNET", "Author": "thequeen", "ReviewID": "RW5Z89921WYOU", "Overall": "2.0", "Content": "The ad doesn't tell you - but you can't use the internet on this phone! TMobile doesn't support the internet server used on it anymore so no matter what carrier you're using the phone on the internet doesn't work! I can make phone calls, send text messages,and use the calendar / note pad and THAT IS IT. You can't take more than five pictures with it, you cannot send or receive picture messages, and if you drop it AT ALL everything stored in your phone disappears. DO NOT WASTE YOUR MONEY ON THIS PHONE.", "Date": "June 22, 2012"}, {"Title": "Suxxxx aaaaaa******", "Author": "rosie", "ReviewID": "RL3W78ATOSOI4", "Overall": "1.0", "Content": "The phone was OK at first!. Then it started giving me problems , deleted all my cOntacts!. Kept shutting down, i only had it for abot 5 months and it was DONE!. Battery didnt wna charge, n i thought it was weird it jus happened in one day, cant get on the internet, phone pretty much sucks!. DONT GET IT!. Waist if money!.>=p wish i could get a refund >=p", "Date": "June 6, 2012"}, {"Title": "Sidekick like a friend", "Author": "Jose Mora", "ReviewID": "R3U420530V75PZ", "Overall": "5.0", "Content": "Well a bought the phone like one year ago, and it works like a new one! I really love it, i can't use the internet options but i can send and receive multimedia sms and normal sms too! Im from costa rica, so the phone works with every company. I can make a calls, a conference call and tranfer calls. If you want a cool phone you  should get it but if you want a phone to share everything with fb and all those stuff get another one", "Date": "April 11, 2012"}, {"Title": "Cool $60 paperweight", "Author": "Deathofwar", "ReviewID": "R3LWN0A4ZBZWT8", "Overall": "1.0", "Content": "So I got this phone knowing full well that it can only talk and text and if the battery falls out it erases the contacts. But after 1 day of usage, it could not make any calls or text at all. It was like the phone and text just shut off. Cool phone but now its just a $60 mp3 player for me and probably going in the trash soon.", "Date": "March 25, 2012"}, {"Title": "My son is on top of the world with this phone!!", "Author": "A. Henry \"Bibbie\"", "ReviewID": "R12Z0IXZMYXZ8B", "Overall": "4.0", "Content": "I bought this for my 12yr old bday! he was soo excited! he said \"mom you are the coolest and greatest mom in the world, this is the best bday gift ever!!\" then he said \"second is the gift of life\"!! i was taken aback that my son values this phone more than his life..ejej so i thank the makers of sidekick i guess..4stars only because its a few days old... but he would say 10 out of 10... however, it is a very complex phone but if u read the instructions, u will be fine.. its also a very hip phone9.2.12I wonder if my son feels the same way! since he was unable to get the internet activated, because its a different service provider, not T-mobile, and a week ago, all his contacts disappeared! he still seems optimistic, as i asked if he wanted to change for another phone, he flatly said \"no\".", "Date": "January 28, 2012"}, {"Title": "Great for teens", "Author": "H.T \"Hanakosmiles\"", "ReviewID": "R5UB83N5D7UOR", "Overall": "5.0", "Content": "It's exactly what the description says. Its a great phone for teens and my son really likes it. I was surprised that the phone was slightly thinner then what we expected and in very good condition. The only thing this phone doesn't have is the touch screen.", "Date": "January 27, 2012"}, {"Title": "Dissatisfied and cheated", "Author": "Amazon Customer", "ReviewID": "RAU3L9ZQZBV7R", "Overall": "1.0", "Content": "I bought 2 of these phones from unlocked cellphone kings the orchid one and the carbon gray one slightly more expensive, I bought the phones to be used in Venezuela, Both Items were labeled as new and the carbon grey one came in a box which is so obviously not the original box and indicates it is a used phone, if i want a used phone I look for one, It is false and misleading advertisement. Also, neither of the phones brought the 1GB micro SD memory card that was advertised and said clearly on the box that came inside. And also it does not work with 3G data plans not even here in Venezuela.overall the purchase is dissapointing, the seller should be more sincere and Amazon should verify these things as well. As a regulas customer I'm not happy with this and I must say that there should be some sort of compensation for the damages.", "Date": "January 26, 2012"}, {"Title": "Very bad phone", "Author": "Yatsen Joa Castillo", "ReviewID": "R1J7R827JKR8TP", "Overall": "1.0", "Content": "the phone only works with T-mobile (data) if used with another carrier would only be for talk and text . the 3 mega-pixel camera is just awful, quality is very poor and very bad performance. I DO NOT recommend this phone to anyone. I sold it right on the same day. the speaker phone is very low, the few hours I used it and missed a few calls. there's no software to modify it (increase volume or make it faster)******Seller is very good, fast shipping, very good... just bad phone.", "Date": "January 16, 2012"}, {"Title": "Very good", "Author": "cristian.tamayo", "ReviewID": "R3F9KFIQ19X8O4", "Overall": "5.0", "Content": "Excellent product and very good price in relation to others, I recommend it 100% for people looking for a quality product at low cost.", "Date": "November 1, 2011"}, {"Title": "sidekick", "Author": "April Horlick", "ReviewID": "R2OIYZ3K64WEGJ", "Overall": "4.0", "Content": "bought it for my sister, she liked it... occasionally shuts off and if the sim card is removed all memory is erased but its a model defect. The product otherwise was great for the price we paid.", "Date": "August 31, 2011"}, {"Title": "A very nice phone", "Author": "o' girl", "ReviewID": "R18MC1H5ERAH94", "Overall": "4.0", "Content": "I bought the phone for my sister, it works fine and my sister enjoyed using it for her small trading businss. the phone is so reliable and works very well. I am happy for my sister.", "Date": "August 17, 2011"}, {"Title": "this is very good", "Author": "yarin", "ReviewID": "R3M7VPRFHZS6D4", "Overall": "5.0", "Content": "i just got this item 2days ago the box looked used but when i opened it and saw the sidekick it was new i think beacuse its 2009 and its a very great phone for talk text music", "Date": "August 14, 2011"}, {"Title": "Does it work?", "Author": "Jawillnessa", "ReviewID": "R2AEPYG7WDPF94", "Overall": "2.0", "Content": "Purchased the item, received it pretty quick also. It LOOKED to be in good condition,but we were NEVER able to charge it to find out. The charger sent w/the item was to be used to charge from the computer, but it didnt work...no electric outlet charger was included. I returned the item as I did not care to purchase an \"additional\" charger when it stated that one was included in the cost. Just made me a bit \"suspcious\", so I refunded & made another purchase. Happy now.", "Date": "August 9, 2011"}, {"Title": "Wonderful Phone!", "Author": "T. Marks \"An Author\"", "ReviewID": "RNABUL2ZJTLJM", "Overall": "3.0", "Content": "The Phone seems to be okay, but there were no actual WRITTEN instructions.  There was a disk.  Good thing I have a computer.  Also, there was No MICRO MEMORY CARD enclosed in this New box, despite the content list.  Anyway, the phone is wonderful so far and it arrived promptly.  It has been activated and I am very pleased.  With all new things, this is going to take a moment to get used too.  Texts is wonderful, however I have not found the Sent File yet...(LOL)...I'm sure I will.", "Date": "July 28, 2011"}, {"Title": "AWESOMEEE!!", "Author": "yuneeham", "ReviewID": "R2AY1NA8PMNZJ7", "Overall": "5.0", "Content": "This product was so worth my money!ALL NEW + came with all the accessories :)earphones + charger + phone case + etcI was more than happy to receive this!!And I love the phone quality.....so HQ & bright :)Thanks for the wonderful product +FAST SHIPPING!", "Date": "July 17, 2011"}, {"Title": "Average Phone", "Author": "TJ", "ReviewID": "R3C34MCON2IG47", "Overall": "3.0", "Content": "I guess I should have taken the advice that this phone is for younger people. The keyboard is great so texting is a breeze. It's a little bulky and is missing many of the options that I would like. (I knew most of these ahead of time) WiFi is a must these days. When you hold the phone to your ear to talk it does feel strange on your ear after a short period, like a warm, tingling sensation. Can't seem to get my favorites to work properly for easier calling access. May be a great phone for some but a mild dissapointment for me.", "Date": "July 11, 2011"}, {"Title": "great for the price! (AT&T; customer)", "Author": "alex", "ReviewID": "R4CXKIRIYNIH6", "Overall": "5.0", "Content": "The phone is great!! Im using AT&T; right now on it and it works awesome. The signal is great and stuff. Didnt have any problems when I first put my sim card in.PROS:-very fast phone, no lags of some sort-keyboard is awesome-track ball and LED lights are soo cool-camera is pretty good-screen resolution is very nice-big screen-battery life is good-speaker is loudCONS:-no wifi :(-no front facing camera-a little too bigOverall its a great phone for non stop texters and stuff", "Date": "July 7, 2011"}, {"Title": "kids are happy", "Author": "Steeler Nation", "ReviewID": "R2XGCKHHOCVP4N", "Overall": "4.0", "Content": "I have 2 young teenagers who's older phones were in pretty bad shape. Found these 2 and for the price you can not beat it! They loved the phones, the have everything they want, and the battery life if great! Of course they are no iphone but for texting and calling, nice phones. They make a lot of cool sounds. Kids give them a 2 thumbs up! You would be hard pressed to find new phones with all of the features these phones have for the price.", "Date": "June 28, 2011"}, {"Title": "great", "Author": "Allison Smith", "ReviewID": "R2LX218EI8MCEJ", "Overall": "5.0", "Content": "the seller got the phone to me very fast which i was pleased about. Everything arrived in perfect condition. I didn't get the 1G sd card like everyone else but its all good. The keys are a little stiff but will loosen up with time im sure.I am using it on at&t; and it actually gets better signal that my native at&t; phone the Captivate. since its with at&t; all this phone can do is text and call, which is does excellently. i leave the apps and camera and everything else up to my captivate.the sidekick has great battery life if you're using it with an at&t; sim card since all it has to do is receive phone calls and texts, not web data of any kind. I have at least half of the battery left at the end of the day with constant texting.", "Date": "May 18, 2011"}, {"Title": "Great Phone", "Author": "Erica Reid", "ReviewID": "R3BJU3NQ6WJJJR", "Overall": "5.0", "Content": "I purchased this phone as a secondary device to my Blackberry 9700 and I am enjoying using the phone. I have tmobile service already so I called them to see about getting the sidekick data plan. They told me that it was possible to have the service but I would have to break my blackberry contract and that would be a cost of $200 for an ETF. I decided not to go that route and will just use the phone as a text, mms, and phone call device. I see a few people said that they were not able to send and receive picture/video messages on the sidekicks because they have no data but I was able to do so with no issues even if I cannot go to a webpage on the phone. I think that the design and aesthetics of the phone is very appealing and I am glad I purchased. The phone looked brand new when I opened the package. I had the phone (no scratches), an operators manual, battery, data wire, earphones as well as a carrying pouch. I could not have asked for anything more and I will gladly do more business with this company if all of their interactions are this professional.**Edit 5/26/11I am reviewing the plan mainly because there is nothing wrong with the phone but a lot of mystique seems to be surrounding the infamous Sidekick service not being in effect any longer. So I finally got my phone 100% activated on a new prepaid phone number so I wouldn't have to keep changing my sim card back and forth with my blackberry when I want to use this phone. I called tech support and with the change of the APN in the system I have full 100% use of my device. I have my Facebook and twitter apps going and emails coming to the phone. I think the issues that come in to place with not having data on the phone is when you are using a sim card that is not Tmobile. As long as you are on the network and the service can be verified then you should have no issues with data being switched on at the 3G level. Otherwise, this phone works fantastic. The only gripe I have is that the battery power tends to drop a little more than I would like. It loses power now because I am always playing with the data on it, however before I hooked the phone up I charged it completely and never used it but when I tried to use it about three days later it was completely dead which means standby is incredibly low. Just something to consider. Otherwise there are no other issues with my device, I am completely satisfied.**Edit 6/2/11Okay, so it looks like the data is, indeed, gone from this device, never to return. With the data gone this phone is still a nice device to use, so the phone does not lose any stars but I am questioning Tmobile's motive in cutting off such a mass amount of their customers. If you are not into any data features then this is a nice device to use. If you are an internet creature, like myself, please look elsewhere. I am on to the Androids!", "Date": "May 14, 2011"}, {"Title": "It was a GOOD DEAL", "Author": "Joga", "ReviewID": "RZR3VKD4WXFG5", "Overall": "5.0", "Content": "Overall the product is good, i really recommend buying this cell. It works well and came with all their accessories...", "Date": "March 31, 2011"}, {"Title": "not original sidekick", "Author": "stewie", "ReviewID": "R1T3NARL9OBBZ5", "Overall": "1.0", "Content": "this is not the original sharp sidekick this is an imitation and the pictura messaging dont work and the internet search", "Date": "April 5, 2012"}, {"Title": "T mobile is misleading", "Author": "phleabe", "ReviewID": "R360VU3WH1NX29", "Overall": "3.0", "Content": "I recently purchased a t mobile phone from amazon. I went to the store and asked them if I could by any phone and bring it in to get turned on instead of buying a $200 phone from the store. They said sure and I explained the phone would be for my son so having internet would be a must. They said no problem. Well I went on amazon and read some reviews about the different sidekicks and decided to buy one. I was very pleased with the phone and amazon. But unfortunatly the phone I bought is a 3g and t mobile is only running on a 4g network. So no internet available for this phone. So beware when you find a phone you want on amazon make sure you asked the dealer a few times if they can connect all the features the phone has available.", "Date": "March 12, 2012"}, {"Title": "SIDEKICK 2009 IN 2012", "Author": "rodriguezmartin", "ReviewID": "RYWCBSXR2FYYT", "Overall": "5.0", "Content": "i have a question does this get data like internet for tmobile service cause i have tmobile service and i know they shutdown the danger data network on it but im thinking if it will work still", "Date": "February 6, 2012"}, {"Title": "WARNING WARRANTY IS NOT VALID", "Author": "Kate Head", "ReviewID": "R22KGU3NUX29YN", "Overall": "1.0", "Content": "One year warranty is worthless. Neither Sony nor TMobile will return the phone which failed in less than 90 days. DO NOT BUY THIS PRODUCT.", "Date": "October 17, 2011"}, {"Title": "best", "Author": "ikem obi", "ReviewID": "RA4PYZ752Z62O", "Overall": "4.0", "Content": "yes the phone is in good sharp. and working perfectly. but one thing is the phone is locked for the internet. am not using the phone here in united state, am using the phone back home africa, pls if u can be open the internet assest so that my customer will have internet asset on it, thanks, further more am going to buy 20 pices of it again.", "Date": "September 12, 2011"}, {"Title": "This Phone is Nothing like I expected it to be :)", "Author": "MujaMommy", "ReviewID": "R2ZYO4XVKJWB7Y", "Overall": "5.0", "Content": "I finally got the phone wow days early i must admit i was inprest i had bought things online before and im still waiting on other orders and I order this one on the 18 and it got here the 20 I was imprest by the seller and there phone its perfect for me a mom on the Go... Who needs Internet?... when you have a crying baby to take care of?.. This phone is grate Talk and Text so light Not heavy so i can hold this phone and hold the baby on the other hand With a secure mind that it wont fall out because its to big or to heavy =P Im in love I wouldnt trade this phone for a Iphone I LOVEEE IITT!  the only Con in it that they dont sale any Dimoand or rymston Cases all the casses are Ugly =(", "Date": "July 20, 2011"}, {"Title": "Well....", "Author": "Demi LeBlanc", "ReviewID": "R1GSPENMHLVFAK", "Overall": "1.0", "Content": "I bought this phone knowing it was a UNLOCKED GSM phone. Well turns out, the seller lied? I dont know. But the phones great, just can't use it beacise it is not \"unlocked\"", "Date": "June 5, 2011"}, {"Title": "my 14 year old son loves this phone.", "Author": "Jode K Wortman", "ReviewID": "R1R04FLR08444V", "Overall": "5.0", "Content": "i recently ordered this phone for my son.  It arrived quicker than expected, which is not an everyday occurance in alaska.when i asked him how he liked it he replied, \"mom, I love this phone.\"", "Date": "May 2, 2011"}, {"Title": "Great condition... works perfectly", "Author": "rlpagtama", "ReviewID": "RSQO0DRCCHJP6", "Overall": "5.0", "Content": "I just received my Sidekick LX and I absolutely love it. It's working fine so far and it is in wonderful condition! I would recommend this seller.", "Date": "April 20, 2011"}, {"Title": "Quirky, glitchy, and all around poor.", "Author": "Adam H", "ReviewID": "RJIFN7ARCPI1A", "Overall": "1.0", "Content": "I purchased this phone for my girlfriend, and she hates it. First, if the battery is taken out of the phone, it erases all of the contacts, messages, and pictures saved to the phone. Also, it is overly complicated considering what little it is capable of doing technologically. Its reception lacks terribly when compared to my iPhone 3GS, and it will not allow us to save new contact info to the SIM card; so then when the battery is removed, all the new contacts that were not saved to the SIM card are lost. Internal memory is 5 pictures worth, so you will need to purchase a micro sd memory card as well. I would recommend investing in a better phone honestly.", "Date": "July 19, 2011"}, {"Title": "Unable to purchase sidekick due to location", "Author": "cason", "ReviewID": "R3COOLOLG6A1FL", "Overall": "5.0", "Content": "HI i wanted to purchase a sidekick,however it was not made possible due to my location in Singapore.therefore is there anyway i can purchase the phone in any means here?", "Date": "May 30, 2011"}, {"Title": "very stylish phone", "Author": "xtinz", "ReviewID": "R2KO26S3VA80MQ", "Overall": "5.0", "Content": "im pretty sure my son will love this phone . its really suit for teen ager who love to tx .", "Date": "May 14, 2011"}, {"Title": "A Must Have", "Author": "Canim", "ReviewID": "RM339NQWSI41Z", "Overall": "5.0", "Content": "I just got this phone and I love it....absolutely fantastic, it has a very smooth finish and has multiple functions and is very user friendly...you can do anything with this phone....it's a must have!", "Date": "May 12, 2011"}, {"Title": "Sidekick LX 2009 GREAT!!!!!", "Author": "Nate", "ReviewID": "R397X777SGEJ5Y", "Overall": "5.0", "Content": "AWESOME SELLER!!!! Would recommend to anyone.  Phone came in perfect condition with original wrapping, box, and everything else.  THANK YOU!!!!", "Date": "May 5, 2011"}, {"Title": "Lady's Girl", "Author": "stephanie", "ReviewID": "R1ESZGBDGO0BKJ", "Overall": "1.0", "Content": "I am contacting you today is to ask if the T-Mobile Sidekick LX 2009 you sell, being in France if I can put a sim card of my operator, and if the charger to an AC outlet for French. If the phone is unlock my operator told me that I could put my sim card. Sincerely thank you for responding.", "Date": "July 27, 2011"}, {"Title": "perfecto", "Author": "jaime", "ReviewID": "RS12VDBSO002T", "Overall": "5.0", "Content": "el articulo llego en perfecto estado y nuevo llego con todos los accesorios y como dice desbloqueado pues lo probe enseguida y funciono de bienasi que lo recomiendo pues un buen telefono y hasta el case vino con el telefonogracias", "Date": "April 25, 2011"}, {"Title": "Seller cancelled order", "Author": "lizzieizzie", "ReviewID": "R22NCYR4KQXBYR", "Overall": "1.0", "Content": "I would think twice before buying from this seller. My order was cancelled because the seller was afraid that the phone was not in stock. Very unprofessional!!!", "Date": "February 25, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile Not all carrier features may be supported It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint\nDigital audio player compatible with MP3, WMA and AAC formats", "Name": "Sidekick LX 2009 PV300 Unlocked Phone with QWERTY Keyboard - US Warranty - Carbon Gray. This phone does not have internet capabilities.", "ImgURL": "http://ecx.images-amazon.com/images/I/41geT8g3GxL._SY300_.jpg", "ProductID": "B004FK7V0S"}}