{"Reviews": [{"Title": "Bad Experience", "Author": "Allison Deane", "ReviewID": "RQ1EBAJDLP4Y8", "Overall": "1.0", "Content": "Purchased one Origianl Blackberry Bold 9650 OEM Full Black Housing Cover with keypad for my Blackberry 9650.  Item arrived promptly but it did not fit my Blackberry since my phone has the track pad and the housing was for a phone which carries the roller ball.  Contacted the seller and was told that they did not sell Housing for Blackberry.  Emailed the seller the product number and received email saying that I did not have a Blackberry 9650.  No offer to exchange the item or to return my money.  Would not purchase anything from this seller again.", "Date": "May 27, 2011"}, {"Title": "damaged product", "Author": "edgar borjas", "ReviewID": "R1A8Q5QG2TBEUG", "Overall": "1.0", "Content": "good morning.I am disappointed to inform you of this serviceThis product looked goodwhen I checked it, I realized that this damagedThe housing has a broken wireso my phone can not work wellEdgar Borjas", "Date": "January 4, 2012"}, {"Title": "Original BlackBerry Bold 9650 OEM completa tapa de la carcasa Negro + Teclado", "Author": "gregory salas \"gregory salas\"", "ReviewID": "ROT7101S14BVY", "Overall": "5.0", "Content": "I have a blackberry 9650 which was badly damaged by the passage of time and use it daily and spor I decided to buy the BlackBerry Bold 9650 OEM Original Full Housing Cover Black + Keypad and ready my bb look like new.", "Date": "January 1, 2012"}, {"Title": "good!!!", "Author": "Luis G.", "ReviewID": "R1ZNJ9D5MI511Q", "Overall": "4.0", "Content": "this allowed me to completely fix my blackberry device and practically have one as new and can sell at a good price", "Date": "May 31, 2014"}, {"Title": "good product", "Author": "Yanira Parra", "ReviewID": "R2C4GOQ4U4GH8U", "Overall": "5.0", "Content": "is of excellent quality, it has a great price, exactly what I expected, I recommend it, do not repent, excellent relation price.", "Date": "May 4, 2014"}, {"Title": "good item", "Author": "samuel", "ReviewID": "RZ9HCNSWSNUQ6", "Overall": "5.0", "Content": "I would recommend this to everyone that's looking for a bold 9650 housingthis is a very high quality item, i will buy againThanks you seller you made my day.", "Date": "January 28, 2014"}, {"Title": "Satisfied", "Author": "Terry-Ann Wallac", "ReviewID": "R1C4XFHMCJV6Y9", "Overall": "5.0", "Content": "This product was exact and got to me in quick time. This housing made my phone looked brand new. Very satisfied with the product.", "Date": "October 8, 2013"}, {"Title": "new", "Author": "Belkis", "ReviewID": "R9XNQPZ42O51U", "Overall": "4.0", "Content": "good parts, all fit to perfection, I am like my old phone again, good care, good service, good delivery, I have no complaints about this purchase", "Date": "June 15, 2013"}, {"Title": "can't rate a product without a comment, so", "Author": "Jrod", "ReviewID": "R2GGAMDUGRQH49", "Overall": "5.0", "Content": "can't rate a product without a comment, so here is my comment.  Totally awesome, awesomeness, with a side of awesome", "Date": "March 18, 2013"}, {"Title": "Excellent!!!", "Author": "SANDRO SIRONI", "ReviewID": "RITMIN9QGCWWN", "Overall": "5.0", "Content": "Excellent product, high quality ... My cell phone has been running like new and without any kind of problem.The material that is produced is quite sturdy once installed remained an OEM cell.Electronic connectors match perfectly", "Date": "March 11, 2013"}, {"Title": "Unusable", "Author": "Debra Richardson", "ReviewID": "R1GSXQI7NSHYTJ", "Overall": "3.0", "Content": "According to Sprint this item can not be used for the reason that I purchased it for. I wish I had known this prior to buying.", "Date": "March 11, 2013"}, {"Title": "60%", "Author": "vanessa bonacia", "ReviewID": "R1B8I5DM0NWXLT", "Overall": "3.0", "Content": "no es de tan buena calidad apenas la fui a colocar se partio una pieza sin ningun esfuerzo... y luego con el tiempo se le han ido partiendo mas piezas", "Date": "February 6, 2013"}, {"Title": "fits great!", "Author": "Freshtex", "ReviewID": "R3SRMKB4SY6VGH", "Overall": "5.0", "Content": "my daughter has a 9650 that got a little more falls than it bargained for, so i got this housing to spruce it up for her, man it fit well like the original, plus the damn phone just looks brand new, i also got this case, soft and smooth plus it fits perfect on the phone. Black Silicone Case / Skin / Cover for RIM BlackBerry Bold 9650 / Tour 9630", "Date": "December 12, 2012"}, {"Title": "\"chrome\" bezel doesn't fit properly came to me damaged", "Author": "this guy", "ReviewID": "RQOJNGM8JXWAL", "Overall": "1.0", "Content": "Granted this is an inexpensive replacement for a damaged shell, but this is a tad rediculous. for one thing, the entire front \"chrome\" piece doesn't even fit.  And another problem is the main black piece showed up with damage!! and the \"blackberry\" text on the upper front panel is a cheap white color instead of the chrome letters that was on the original. very disappointed.", "Date": "November 17, 2012"}, {"Title": "Excellent", "Author": "Arquimedes Mota", "ReviewID": "RX14MHGV2QZSS", "Overall": "5.0", "Content": "I thought that replacing the housing of my Blackberry Bold 9650 would make it look like new and I was right. Replacing the full housing, cover, and keypad made my phone to look like a new one.", "Date": "October 3, 2012"}, {"Title": "Good Housing!!", "Author": "Bryant R", "ReviewID": "RWQZWFHPWR210", "Overall": "5.0", "Content": "I like the housing a lot. One of the best things about it was the price of course and the fact that it didn't have any company name on it (which is good if you have an unlocked phone from another company)", "Date": "August 12, 2012"}, {"Title": "Excelent", "Author": "David Vanegas", "ReviewID": "RHE58VX8HXQ17", "Overall": "5.0", "Content": "Excelent shipping service and product quality. Its the second time I ask for Blackberry Housing and both times I ve had a very good product.", "Date": "April 10, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": "Original BlackBerry Bold 9650 OEM Full Black Housing Cover + Keypad", "ImgURL": "NULL", "ProductID": "B004U98GUS"}}