{"Reviews": [{"Title": "Excelente", "Author": "Christian Delgado", "ReviewID": "R20ASC3FVW59Y6", "Overall": "5.0", "Content": "Llego en perfecto estado tal cual se describio usado muy bueno de la operadora AT&T; y 3G para bandas 1,2,5,lo recomiendo...", "Date": "August 7, 2012"}, {"Title": "EXCELENTE!", "Author": "Bruno, Venezuela", "ReviewID": "R16YKPV67B8IE0", "Overall": "5.0", "Content": "RAPIDA ENTREGA Y EL TELEFONO ESTA EN MEJORES CONDICIONES DE LO QUE ESPERABA, COMO NUEVO! LO RECOMIENDO AMPLIAMENTE! SIN UN RASJUÑO NI DEFECTO!", "Date": "June 27, 2012"}, {"Title": "Worst ourchase ever", "Author": "kip", "ReviewID": "R13L1BBUVKIPWZ", "Overall": "1.0", "Content": "I bought this product in January thinking this would be my final phone i got!!! well the phone has so many problems..First off they told me it was brand new and had a warranty!!!Went to att service store they told me my warranty was out since november of last year and that it was refurbished!!!Also.. i was dropping calls and the phone was not sending any messages and people would get my messages in chinease or not at all!!The phone froze and never worked.Trackpad was aweful!!!!!!I would not reccomend this phone at all!!There were more problems but i cant write all of them because there were too many", "Date": "April 30, 2012"}, {"Title": "excelente celular me encanto", "Author": "omar ortiz", "ReviewID": "R2TOAYRK0KWCLM", "Overall": "5.0", "Content": "what I expected, the phone was a gift for my mom, I am delighted, thank you for sending the team quickly, a new computer, this perfect thanks, would return to buy units, is more I will record the name of the company I liked purchase, here in Venezuela that team works with any company, so if some Venezuelan reading this, I say buy with your eyes closed, I recommend", "Date": "July 4, 2013"}, {"Title": "I would recommend if you want a used cel", "Author": "Diosamarial- Venezuela", "ReviewID": "R31KRWT7RUMWVN", "Overall": "3.0", "Content": "Arrived in good condition, but not formatting well, and he had pictures of his former owner, did not come in the box, do not know how long you have to use, the battery is not the originalLlego en buenas condiciones, pero no lo formateo bien, ya que tenia fotos de su antiguo dueño, no vino en su caja,No se cuanto tiempo tiene de uso, la bateria no es la original", "Date": "February 7, 2013"}, {"Title": "Ok", "Author": "SARA OYUELA HENRIQUEZ", "ReviewID": "R2BSJ98PU0KAAA", "Overall": "3.0", "Content": "Ok Recibido a tiempo y satisfactorio volveria a comprar con el mismo vendedor  pruebaloes una buena opcion de compra gracias", "Date": "January 12, 2013"}, {"Title": "NEGATIVO", "Author": "Lizeth", "ReviewID": "RGPP95Y2WWWW1", "Overall": "1.0", "Content": "EL CELULAR ES REPOTENCIADO Y YO LO COMPRE COMO NUEVO. NO ME SIRVIO. TUVE UNA MALA EXPERIENCIA Y NO LO RECOMIENDO. NO COMPREN AQUI", "Date": "October 19, 2012"}, {"Title": "Blackberry review", "Author": "Christen J. Reimer \"GAME SONIC\"", "ReviewID": "R2JKQS8F2SZPZB", "Overall": "5.0", "Content": "This Blackberry is a great one that can do many stuff and has a nice QWERTY keyboard.  Great Blackberry overall!", "Date": "June 18, 2012"}, {"Title": "it works in Venezuela 3G Movistar", "Author": "Marielba Soto", "ReviewID": "R1ZQSY7L32EO5X", "Overall": "5.0", "Content": "this cellular works with 3G Movistar in Venezuela I really recommend it, 3G bands 1,2,5,6 (1900MHz) accepts OS 6.0 and BBM voice chat.", "Date": "May 13, 2013"}], "ProductInfo": {"Price": "$459.99", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 1900 / 2100 Mhz", "Name": "BlackBerry Curve 3G 9300 Gray WiFi Unlocked GSM QuadBand Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41YsAk7--qL._SX300_.jpg", "ProductID": "B004ZMC7NC"}}