{"Reviews": [{"Title": "Not too shabby", "Author": "Jay", "ReviewID": "ROEZSR5DYXOQQ", "Overall": "4.0", "Content": "Arrived quickly, and safely, included everything that was listed, and was in great condition for a used phone. HOWEVER, Battery life on the phone was shot, and i had to purchase a new battery and replacement kit off amazon also. Otherwise, PERFECT!", "Date": "August 9, 2011"}, {"Title": "This seller ships products that don't work!", "Author": "Whitney Mitchell", "ReviewID": "RDN7C1UK5VQLS", "Overall": "1.0", "Content": "I ordered this as a gift for my nephew. When I received it it appeared in good condition, but appearances can be misleading. It is stuck in the charge/upload moad. There is no possible way that they weren't aware of the problem before they shipped it out. It's apparent the second it \"turns on\" if you can even call it that. I spent many hours trying to fix it, but to no avail. They had a small return window for the holidays and I was out of town beyond the deadline, so now I am stuck with an expensive door stopper.", "Date": "April 12, 2013"}, {"Title": "not as described", "Author": "yezzeldeen", "ReviewID": "RRKCXQVTQFKR7", "Overall": "3.0", "Content": "Hi, I bought an iphone 3g 16gb white,and it mentioned that its unlocked but when i got it i found it locked to AT&T; so I have to pay more to unlocked it", "Date": "December 29, 2012"}, {"Title": "Misrepresented phone quality", "Author": "tuko", "ReviewID": "R2E3JLQL4EHLP1", "Overall": "2.0", "Content": "I bought this phone in Nov 2012.  Died Feb 2013. The phone was sold as \"like New\".  The day we activated it the vibration feature (suppose to turn on when in silence mode) did not work.  In addition, I have some Beats headphones that have the volume control on the cord. The phone would not recognize the volume control on the phone, my other Apple products(IPAD, Itouch) recognize it.  Three months later the battery started dieing really fast, it would not hold a charge very long.  I bought a new battery and when I went to replace it, the factory seal inside the phone had already been removed.  This phone should have been labeled \"used-good condition\".  This is definitely not a \"Like new\" phone.  Be careful of this seller.", "Date": "May 7, 2013"}, {"Title": "Awful", "Author": "Notwithoutmyheels", "ReviewID": "R3L5D20SBMQE4M", "Overall": "1.0", "Content": "I got this phones and the charger was broken, and the power button was broken too. No wonder they were only 120.00. Wish I would've gone straight to the carrier and purchased the Iphone 4g.", "Date": "January 13, 2013"}, {"Title": "Exactly what I ordered, I'm just surprised by the super slow performance.", "Author": "Suzzette Medina", "ReviewID": "RPXX79425OYZA", "Overall": "3.0", "Content": "I know the phone is very old at this point so I was certainly not expecting anything fast, but the constant pausing, spontaneous crashes, and overall snail-pace functioning really disappointed me. The phone arrived as it was described and such, so thank you for the speedy delivery.", "Date": "October 6, 2013"}, {"Title": "Just what I expected", "Author": "FEDERICO A KLADT", "ReviewID": "RBUKMV1M9D73L", "Overall": "4.0", "Content": "Product was just what I was expecting. Came with all acessories, and original package. Mailing was also very expedite and I got the phone in less than 2 weeks (considering I'm in Brazil that was very good).", "Date": "January 6, 2013"}, {"Title": "iPhone wasn't white", "Author": "Audrey", "ReviewID": "R1M0GPIIMWT3OW", "Overall": "3.0", "Content": "I did receive the iPhone on time but it wasn't as described. The description of the iPhone said white but the iPhone I received is black.", "Date": "January 11, 2012"}, {"Title": "Sucks", "Author": "fclenton", "ReviewID": "R2JFFTG8GHKQ2O", "Overall": "1.0", "Content": "Doesn't even compare to an android some apps don't work hate that you have to do everthing on itunes all the hype was about nothing", "Date": "April 4, 2013"}, {"Title": "Please would like more information about the product.", "Author": "fernando", "ReviewID": "R17NAUNVZWEMCZ", "Overall": "1.0", "Content": "Hi, I bought an iphone 3g 16gb white, but can not get in the product specifications in your box if your charger or the phone itself. I would like to know something about their conditions. I hope you soon thanks", "Date": "July 9, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004ZLYBH8"}}