{"Reviews": [{"Title": "My 3rd Samsung Phone", "Author": "Stephen D. Golden", "ReviewID": "R3OSE72MWX1XGT", "Overall": "5.0", "Content": "This is my dad's account, and I'm his teen daughter writing this, just so you know!Okay, I just graduated from high school, and I've had this phone since I started my senior year. It's my third Samsung phone and it has yet to disappoint. I'm an extrememly fast texter and it can keep up. Yes the keys are slightly small, but I use my thumbnail to type, rarely the finger itself. It's slightly bigger than my previous phones (Samsungs A707 and A777), but it works better in my opinion.The touchscreen is practically mandatory for anything you want to do. You need to press \"Send\" on the screen for texting, and you need to touch the screen to access the Internet or your pictures or anything else. When you close the phone, you can still type. Your viewing screen is a lot smaller to make room for the touch numeric key-pad.Overall, I love this phone, yet it does have some downsides. Lately (remember, I've had it for a year), it's been not accepting calls. Not rejecting, just not accepting. Someone will call, it'll ring a few times, then go to voicemail, without me having any notification that they called me. Every now and then, it'll lose signal completely, even though I live in a 3G region. You can tell since there will be no bars on the phone when there usually is. Simple fix, just turn it off and on. Then you'll be flooded with texts and missed calls. No permanent fix that I've discovered.I've dropped this phone more than a few times. Screen got scratched, but still works just fine. Very durable. Locking feature is amazing. I always lock it and put it in my jeans pocket. No complaints there. 2 MP camera is surprisingly good quality. Sound system (listening to music) is good from what I can tell. I love this phone and when it quits, I'm re-buying the same model. My mom got the A927, Samsung Flight II, and she hates it. As do I. Totally doesn't recommend the side slide. This front slide works, it just takes a few days to get used to.So, I hope this review helps anyone wanting to know if this is the phone for them.", "Date": "July 29, 2011"}, {"Title": "Best phone I have ever owned", "Author": "plantlover", "ReviewID": "R2B4XP07Y4HRA8", "Overall": "5.0", "Content": "I work in an environment where I'm always moving, lifting things, and in a rush. I have dropped, thrown, kicked, and stepped on this phone, and it still works perfectly. I have had it over a year, and not once has it glitched! The touch screen reacts fine, slider still moves fine, and the phone is overall still perfectly usable. After owning the notoriously horrible samsung Impression, I was skeptical about owning another samsung, but when they sent this to me as a replacement for the Impression, I had my views changed. The first one they sent to me did drop calls, but the company replaced it (factory defect I suppose) and this one has never let me down! Battery lasts 2 days like most new phones these days, and if anyone needs a reliable phone, look no further!", "Date": "November 21, 2011"}, {"Title": "Happiness is..... Having a dependable cell phone", "Author": "Cassandra", "ReviewID": "R223AVWRGIEASC", "Overall": "5.0", "Content": "I brought this Samsum Flight A797 AT&T; cell phone to replace the one I damaged. I couldnot purchase a new one from AT&T; without renewing my contract.  So, I looked and searched on Amazon to get a used cell, same make and model.  I am very happy with this purchase, and I am able to use all of it features and capabilities.  This phone does more than I thought because my original phone was damaged.Again, \"Happiness is..... having a dependable cell phone... Cass D.", "Date": "December 12, 2011"}, {"Title": "Invalid Warranty", "Author": "Reed G. Porter \"reedracer\"", "ReviewID": "RPNMBSTF6HCUK", "Overall": "2.0", "Content": "Despite the words clearly written in the title, when I tried to contact Samsung with a problem under warranty I was advised that because this phone was unlocked by a 3rd party, the warranty is invalid. After 2 1/2 months the phone would no longer connect to the charger. Samsung advised me when I presented the invoice for proof of purchase date the words \"unlocked by 3rd party\" invalidated the warranty. BEWARE", "Date": "November 13, 2012"}, {"Title": "So-so", "Author": "AL", "ReviewID": "R2ZIC5V7F9FTS8", "Overall": "3.0", "Content": "If you want a relatively cheap non-smart phone with a touch screen, this is a good choice. Otherwise, not much to recommend it. Unlike what some others have said, I'm used to getting 3-5 days of battery life on a new phone, even Samsungs; this one gives 2 days max, sometimes less, with only 20 minutes of talk and maybe 3-6 texts per day. Small keys are ok for me, but do cause some problems with the Fn key. Might be hard if you have large fingers; mine are about average for a man. Touch screen is fairly bad, but about what you would expect for the price? Some parts of the screen just don't seem to work (annoying that the call reject key is one of them), but most are ok. Scrolling is a major pain. Decent camera for this type of phone, which can't come close to the nicer Android or iPhone cameras, of course.Voice quality is above average for phones I've had.Pros: Fairly cheap for touch screen phone.  Not a smart phone, so no need for data plan.Cons: Short battery life.  Touch screen not very responsive.  Small keys.", "Date": "September 26, 2012"}, {"Title": "great phone", "Author": "Rod", "ReviewID": "R38FGU7GFL7P5V", "Overall": "5.0", "Content": "This phone is perfect for my needs. I do not need a browser even though it has one.  I do not need a smart phone  so it fits the needs perfectly.  It seems rugged enough and built to last.  Only time will tell.  The ring volume could be louder.", "Date": "July 20, 2012"}, {"Title": "Great while it lasted", "Author": "Sylvir", "ReviewID": "R2V6Y97CZGHDOL", "Overall": "2.0", "Content": "The keys are small, but easy to get used to. The phone itself is rather bulky compared to other phones I have owned.After only a month of owning this phone, it stopped taking a charge unless I quite literally taped the charger cable at an angle. Not sure if it's a problem with the USB or the phone itself, but it's quite an annoying defect.Would not recommend.", "Date": "July 17, 2012"}, {"Title": "A Disappointment", "Author": "Feltoni", "ReviewID": "R1OQWM1GB9WU9", "Overall": "2.0", "Content": "This was supposed to be a gift for a young relative and fortunately I  decided to check it out before presenting it. It did NOT work. Charged it overnight and it just came on for a brief moments but never actually worked.Tried recharging it again another entire day but nothing. Other Samsung products I had worked fine but this one a disappointment. I got a lemon so can't recommend to anyone.", "Date": "November 8, 2012"}, {"Title": "Stopped working after 8 weeks", "Author": "FreeFallin64", "ReviewID": "R3FIBJO5WDETKR", "Overall": "1.0", "Content": "I received this phone on June 25 and it stopped working today, August 20th. The screen is blank and the phone will not charge.  I have tried removing the battery and card repeatedly.  Of course it is just outside of the deadline to return the item. (July 28th).  This is ridiculous...will never again purchase a phone from this seller on Amazon.", "Date": "August 20, 2012"}, {"Title": "cool!!!", "Author": "piedrini", "ReviewID": "R2VW2QQP398F2D", "Overall": "5.0", "Content": "I love my new cell. I love the touch screen and the full qwerty keyboard. Overall I really enjoyed my new phone", "Date": "June 5, 2012"}, {"Title": "Omg", "Author": "TabbyCat", "ReviewID": "R37ZLEDWRN4BBR", "Overall": "1.0", "Content": "OK I bought this phone used and when I got it. It would not charge or keep a charge. I knew friends with this same phone that did the same thing. Do not buy this phone you will be very disappointed.", "Date": "February 7, 2012"}, {"Title": "good phone!", "Author": "D. Phillips", "ReviewID": "R2SP7Q2J59OAJ", "Overall": "5.0", "Content": "Ordered this phone for my daughter to text after her phone broke.  She enjoys the keyboard for texting.  She does not use the media on the phone.", "Date": "July 8, 2013"}, {"Title": "phones", "Author": "Jody Stewart", "ReviewID": "R2T0AJSDGL7C7X", "Overall": "3.0", "Content": "These phone is more what I was looking foreward for but not quite the right one. So trying one more time with amazon on there phone's. Lately all the phones I have try seem not to wwork all the way and end up in a return phone which amazon never said I couldn't do. they get the money right back to you and still ask if they could help you. That's way I like amazon so much. This well be the fourth phone in last three mos. I have try.Hope it works and I do not return it. Tireded of retiurn phones to amazon. But if you need a phone and don't want a tinking toy prepaid or contract one buy it from here for the most part all the phones work right from the start off.", "Date": "June 9, 2013"}, {"Title": "flight a797", "Author": "luz figueroa", "ReviewID": "R1YOQ580G3W6FV", "Overall": "4.0", "Content": "i really love this phone it does the same thing as a new one, its touch screen and everything the only problem i found when i got it was that the the volume when someone calls and you answer, my receiver was too low even when i had it set on high 7 the volume so you could hear the person calling you real far away,but i had a cell phone just like it for  4 yrs and it was wonderful thats why i had order this one,but i had to return it.", "Date": "June 7, 2013"}, {"Title": "Not that great!", "Author": "D. Gross", "ReviewID": "R15CTZCG83V887", "Overall": "2.0", "Content": "I replaced my old one with this same exact model, only this one won't update the time automatically. Now that I've done it manually, it won't update the time on my text messages or missed calls. It also will not work with the bluetooth in my car. Going to just put my SIM card back in my old phone and keep using it.  The screen's scratched up but at least all of the features worked!! Wouldn't buy this unlocked one again.", "Date": "March 20, 2013"}, {"Title": "Great phone if your not looking for a \"smartphone\"", "Author": "Cook_Diesel", "ReviewID": "R1FDOVCTPHXRJJ", "Overall": "4.0", "Content": "I've had this phone for about 2 months and I think it is one of the best phones out there for the money. It has a large touchscreen and a nice layout.", "Date": "March 17, 2013"}, {"Title": "Super Dependable Phone", "Author": "aparker", "ReviewID": "R20TOSG8R6140R", "Overall": "5.0", "Content": "I've had this phone for almost three years and it is still going strong. I would definitely recommend it. It has never given me any problems, although I would recommend getting a screen protector.", "Date": "March 16, 2013"}, {"Title": "Samsung A797 Flight Unlocked Phone with Qwerty", "Author": "Louise Randall", "ReviewID": "R1C2Z7XWA7B6KJ", "Overall": "5.0", "Content": "I purchased the phone for my daughter. She can't live without it. Very good price. My daughter thinks it is awesome.", "Date": "March 6, 2013"}, {"Title": "nice phone", "Author": "B. Voss", "ReviewID": "R23E8EJGZKC1J0", "Overall": "4.0", "Content": "only criticism is that the T9 predictive typing is not very quick (no easy \"accept suggestion\" key, have to select word from a drop-down list, unless I'm missing something).", "Date": "January 30, 2013"}, {"Title": "Great Phone", "Author": "Linda Smith", "ReviewID": "R32GTS4D8KHOG2", "Overall": "5.0", "Content": "This phone is everything i need. the volume on the ringer is a lot louder than my old phone. I couldn't hear my old phone ring half the tim. I don;t have that problem with this phone", "Date": "December 13, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004RZ2HWS"}}