{"Reviews": [{"Title": "The item was no as described.", "Author": "clscanache", "ReviewID": "R2MW80H3SPC85W", "Overall": "1.0", "Content": "The seller specifies that the phone is 1900 mhz 3g compatible and it isn't. Now thanks to the seller i won't be able to use the 3g technology on my new phone cause my company uses the 1900 mhz frequency for 3g.", "Date": "May 23, 2011"}, {"Title": "My dissapointing BB 9780", "Author": "patrickpinnock", "ReviewID": "RARPJZUISI6M8", "Overall": "1.0", "Content": "I am dissapointed with this phone...I had return this it to NYC Blackberry and it wasn't repaired or replace..It worked for a while and is now not accepting my network and is showing SOS icon, I would like to get this thing to work the way is was design to be operated", "Date": "December 13, 2012"}, {"Title": "Looked like new and worked like a charm. :-)", "Author": "Bob \"Bob\"", "ReviewID": "R1NPHXMRS3RQ8Y", "Overall": "5.0", "Content": "I poped in my sim card and away it went. I don't have a data plan so some items don't work I use the pay as you go. I needed the calader, clock and alarms, cammer 5MP, mp3 player, video player, video recorder, contacks list, and real key pad for texting, voice calling, and down and up loading to my computer. this all works well. the internet and e-mail don't and i will never use that on any phone. very happy, i'm aolder man 54 and retired.", "Date": "December 7, 2011"}, {"Title": "excelent equipo", "Author": "aristides edgardo rivero areyan", "ReviewID": "R1XD37WSM970A8", "Overall": "5.0", "Content": "Blackberry 9780 Bold - Unlocked Phone - US Warranty - Black es tremendo celular blackberry es liberado es 3g en venezuela con digitel es perfecto", "Date": "March 27, 2013"}, {"Title": "bad", "Author": "Nevi", "ReviewID": "R10GK3X83VE0PP", "Overall": "1.0", "Content": "El telefono me vino totalmente repotenciado con la cámara soldada y en muy mal estado internamente, fue un engaño total, y me di cuenta cuando tuveque llevarlo a un técnico porque la bateria no me duraba ni una hora y ya llevaba tres baterias adicionales compradas, que decepción.", "Date": "November 19, 2012"}, {"Title": "No warranty information", "Author": "Jonathan", "ReviewID": "R35YT936U70W44", "Overall": "1.0", "Content": "No warranty information came with this item. I was unable to get any warranty information from the them. It appears that this phone may not have a warranty, so be sure to contact them before you buy.", "Date": "November 12, 2012"}, {"Title": "Great!", "Author": "Olivia", "ReviewID": "RWPN2DYB5VM4C", "Overall": "5.0", "Content": "This phone is amazing!!! I received it even better than described. just make sure you buy it from Amazon. it's even better than the one I bought from T-mobile about a year ago.", "Date": "June 22, 2012"}, {"Title": "era lo que esperaba", "Author": "simon", "ReviewID": "R3EQS5YEHEQ22L", "Overall": "5.0", "Content": "el vendendor rapido y comfiable me envio el producnto antes de tiempo y  vino con todos los accesoriso se los recomiendo  100% comfiable Blackberry 9780 Bold - Unlocked Phone - US Warranty - Black", "Date": "June 11, 2012"}, {"Title": "Buen Producto", "Author": "Luigi Silva", "ReviewID": "RZM52DPX2BPI4", "Overall": "5.0", "Content": "El movil me llego muy rapido y en buenas condiciones el proveedor cumplio con todo y el celular funciona perfectamente con la banda 3G 1900 MHZ y en venezuela funciona con las tres lineas (movistar movilnet y digitel)", "Date": "May 30, 2012"}, {"Title": "Be careful", "Author": "Carlo Mont-louis", "ReviewID": "RKJ8HJESAIZIV", "Overall": "1.0", "Content": "This items is far different of what is it.It is worse than a refurbished, at the first view I thought it was a china imitation, it is just a bad refurbished with a fake face, even the batteries cover can not be closed.It is a shame for this seller.I sent the order back to the seller, I'm still looking forward the refund.", "Date": "January 28, 2012"}, {"Title": "Very good!", "Author": "Ka85", "ReviewID": "R1R5FMHE0COVGT", "Overall": "5.0", "Content": "I received the blackberry 9780 in excelent conditions and very fast. I bought directly of the seller Amazon.com. I am enjoying the phone, i have been using for a week and everything goes fine. The 3G and gsm card work well. I bought the internacional and unlocked version to use in my country Brazil. The camera is also very good. I do recommend to buy this cell phone from Amazon.com.", "Date": "December 14, 2011"}, {"Title": "3G 900Mhz", "Author": "Ruben Vegas \"rvegas81\"", "ReviewID": "R2NKBP1ZSMXQ32", "Overall": "2.0", "Content": "Necesitaba un celular que funcionara para la banda 3G en 1900 Mhz ya que en Venezuela funcionan la 1900MhZ para movistar y 900Mhz para digitel, y me mandaron uno que funciona para la banda de 900Mhz que no trabaja con Movistar :( por lo tanto no estoy disfrutando del 3G en mi país", "Date": "December 9, 2011"}, {"Title": "Just Good.", "Author": "Paulo Sergio M. Izar \"Paulo Izar\"", "ReviewID": "RX8F2OZX7AIEG", "Overall": "3.0", "Content": "The product is good, but I hoped I had more choices of languages''. For an item that is advertised as \"international\" it should be the Portuguese language as an option.", "Date": "April 8, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone will work on GSM carries like AT&T; and T-Mobile. Not all carrier features may be supported.\nUnlocked Quad-Band GSM cell phone compatible with 850/900/1800/1900 GSM and 2100/1900/850/800 MHz 3G frequencies plus GPRS/EDGE capabilities\n5 MP Camera, 2592x1944 pixels, autofocus, LED flash and video recording, BlackBerry OS 6.0, Wi-Fi 802.11 b/g, UMA\nTouch-sensitive optical trackpad, Full QWERTY keyboard; Document editor (Word, Excel, PowerPoint, PDF)\nTalk time up to 6 hours - Standby up to 520 hours.\n5 MP Camera, 2592x1944 pixels, autofocus, LED flash and video recording; BlackBerry OS 6.0; Wi-Fi 802.11 b/g, UMA; Bluetooth v2.1 with A2DP; GPS Navigator with A-GPS support and microSD slot, up to 32GB.\nBluetooth v2.1 with A2DP, GPS Navigator with A-GPS support and microSD slot, up to 32GB.\nMedia player MP3/WMA/AAC+; Video player DivX/WMV/XviD/3gp; Organizer and SMS, MMS, Email, Push Email, IM.\nTouch-sensitive optical trackpad; Full QWERTY keyboard; Document editor (Word, Excel, PowerPoint, PDF); Media player MP3/WMA/AAC+; Video player DivX/WMV/XviD/3gp; Organizer and SMS, MMS, Email, Push Email, IM.", "Name": "Blackberry 9780 Bold - Unlocked Phone - US Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51m3XM36iVL._SY300_.jpg", "ProductID": "B004XIE69Q"}}