{"Reviews": [{"Title": "This phone is amazing! more than I expected", "Author": "German Ruiz", "ReviewID": "R12UGRV7PXU6F4", "Overall": "5.0", "Content": "I bought this phone on april 12th with standard shipping. FGS Trading through UPS carrier delivered in Miami before within 24 hours; after seven days Avianca Express (international carrier service) shipped to Bogota, Colombia (South America).I received the original phone package completely sealed. The box includes HTC Desire A8182 phone, Li-ion battery, USB cable, AC adapter, stereo headset and 8GB installed memory card. The phone comes with 2.2 android software version (Froyo) and English and French languages only; for use the spanish language I downloaded \"more locale 2\" application through Android Market that works really good.I followed the user guide instructions: before turn on the phone for first time I charged the battery about three hours; after that I placed the SIM card and turn it on. The phone really is unlocked! I was able to call inmediately.I'm enjoying my new HTC Desire!", "Date": "April 24, 2011"}, {"Title": "Awesome phone; manual APN input required to work on AT&T;", "Author": "joe_m", "ReviewID": "R19FX3EAM8RJKA", "Overall": "5.0", "Content": "The HTC Desire A8182 is a truly wonderful phone! The design, Android 2.2, and Sense make for a very alluring combination. The phone is very fast, extremely flexible, and simply works wonderfully.Edit: This phone does indeed work on AT&T;'s network, but you have to manually input the correct APN settings. Do not expect AT&T; to assist or offer support.", "Date": "March 3, 2011"}, {"Title": "More than a desire", "Author": "Freddo", "ReviewID": "R2AE1ILOG8RHSA", "Overall": "5.0", "Content": "If you don't mind an \"old\" phone that's been out in the market for some time, but still delivers and works flawlessly, this is for you.I've had this phone for almost two years and have not had but marvels to say about it. This is more than you'll ever need or use in a phone. Sure, more processor is always better!!!.. if you use it.. Facebook, angrybirds, documents.. it does it all with no lag. Do you really use more than that? if no, you'll be a happy chap!It works with AT&T;, and if you are international, it works excellent with Telcel in Mexico.. oh, and for the current asking price of 240 bucks... really, what are you waiting for!?", "Date": "August 30, 2012"}, {"Title": "Awesome Phone for a Given Price", "Author": "clam608", "ReviewID": "R1AJVG2DVKIFNV", "Overall": "5.0", "Content": "It's an awesome unlocked smart phone for the given price. It's shipped with 16GB micro card. I've been using for a week now and so far haven't found any issue.Updated: 6/6/2013I'm so impressed with the phone that I bought a second one for a gift to a friend. The feedback from my friend is nothing but positives. This phone priced at $150 is basically on par with other $400 price range ones. It's a steal. The shipping from this vendor is super fast, 3 days in total from the time I place order on Amazon and to when I receive it.", "Date": "May 16, 2013"}, {"Title": "Love it !", "Author": "Sofia", "ReviewID": "R10F3V30T1PLWF", "Overall": "5.0", "Content": "I really love my htc desire. Arrived very fast ! Everything is ok and it came with a 16 gb sd. The phone is better than I esperado, htc sense is beautiful :) I recommend it !", "Date": "January 20, 2013"}, {"Title": "It's OK", "Author": "Eduardo Castro Gamb \"ecastro\"", "ReviewID": "R12HMAU41TRIXP", "Overall": "4.0", "Content": "Phone work fine, good internet navadation, the only thing is it had given 2 black screens since I bought it", "Date": "December 18, 2012"}, {"Title": "great in many ways, not so much in some", "Author": "Keith Williams", "ReviewID": "R3ORPBVWIIVL6A", "Overall": "3.0", "Content": "I have had some issues with this phone, no matter how much I want to love it. First, the good: image quality is great, touch os accurate and responsive. The stock htc launcher and apps are mostly good.Now the bad:My first phone I received would randomly restart, but never stayed booted up for more than 5 minutes or so. Seller replaced super quick with no fuss. Let me send back the original in the replacement's shipping box.The internal phone memory is very low. SD cards are great for a lot of things and solve a good chunk of the issues, but there are plenty of apps that insist on being in phone memory. The stock apps jam up the space, as well. Most aren't too bad, but a large 3d racing game is a good example of wasted space. Even though this is unlocked, you can't delete these apps without flashing in custom firmware.Now the other day I met with the final disappointment. The phone got leaned on, and this killed the screen. The screen didn't crack or anything like that, but the pressure alone did it. I looked it up online, and this is something this model has a history of doing. I think I could stomach a cracked screen more than this. The screen is black with a few vertical white stripes now.I am usually pretty good with my gadgets, and this had a hard case to hopefully avoid something just like this.Not a bad phone, but try to keep in mind exactly what \"no warranty\" means.... :/", "Date": "July 3, 2013"}, {"Title": "Perfect phone if you don't have an AT&T; Data plan!", "Author": "Victor", "ReviewID": "R1G1Z47XA4Y7X5", "Overall": "5.0", "Content": "This phone works great, as good as any other top Android phone, it will work out of the box with at&t; network but, if you want to get the most out of it you should edit the phone APN settings so you can send and receive not only SMS messages but also MMS messages without the need of a data plan (you may need a texting plan).", "Date": "February 11, 2013"}], "ProductInfo": {"Price": "$250.00", "Features": "Android OS v2.1, HTC Sense, 512MB ROM, 576MB RAM\n3.7-Inch AMOLED or SLCD capacitive touchscreen. Corning Gorilla Glass. Optical Track pad\n5MP camera, Autofocus. LED Flash. Geo-tagging, Video recording at 15fps, 720p at 30fps via Android 2.2 update\nUp to 32GB MicroSD, 576MB RAM, 512MB ROM\nA-GPS support Wi-Fi Stereo FM Radio with RDS MP4/MP3", "Name": "HTC Desire A8182 Unlocked Cellphone - No Warranty - Brown", "ImgURL": "http://ecx.images-amazon.com/images/I/41FoDG3dBUL._SY300_.jpg", "ProductID": "B004LEKL32"}}