{"Reviews": [{"Title": "Not a Bad Phone", "Author": "Elise Stinson", "ReviewID": "RH0AO3KESPO3Q", "Overall": "3.0", "Content": "I liked the phone and all the potential that it had but the one I got would only charge in the car.  I had a wall plug and a USB power connector and neither would charge the phone.  Only the car charger would charge the phone and it didn't hold a charge long.  It had a lot to offer and the screen was touchscreen but you needed a stylus, which didn't come with the phone.", "Date": "June 18, 2013"}, {"Title": "Samsung Omnia", "Author": "LaTasha Huff", "ReviewID": "R35M2L822RH2SQ", "Overall": "5.0", "Content": "this phone is really nice!  I had never even heard of it, but the price and features are what drew me in.  But when I got it here my daughter really loved it..  The only thing I didn't like was the fact the seller didn't send a charger, I'm like WTH??", "Date": "November 25, 2012"}, {"Title": "Not what I wanted overall", "Author": "Erika", "ReviewID": "R1BYAGQRK747PQ", "Overall": "2.0", "Content": "Don't really care for the phone not what I was looking for overall hut was in great condition and came in as expected", "Date": "November 18, 2012"}, {"Title": "Tough call...", "Author": "Lynn", "ReviewID": "R3SXH7T6LIXQTT", "Overall": "2.0", "Content": "Shipping was timely and product was as described. However, the phone us a dinosaur. Old school to say the least. I deactivated it the same day I activated it and gave it away!", "Date": "January 22, 2012"}, {"Title": "Not what I expected", "Author": "Carlos", "ReviewID": "R1UPWHM8EQN8LO", "Overall": "2.0", "Content": "I bought this phone a few months ago. Now it did arrive on time and was easy to set up. However the software was not what i had expected. It does not have a good flash player and downloading one is impossible because the flash player software is no longer available. My charger that came with it is broken. Also the touch screen is not to my liking. But if you are not interested in listening to music or watching vids, it is easy to text talk and do average wed activities. Also very easy to learn how to use, still hav apps I haven't quite figured out yet.", "Date": "October 13, 2011"}, {"Title": "GREAT!!!!", "Author": "Gettys D \"stunned\"", "ReviewID": "R2LKL4I86UKAMS", "Overall": "5.0", "Content": "Arrived on time. Great phone protects you from hanging up on others. WiFi signal is awesome but  had a data plan anyway.", "Date": "August 16, 2011"}, {"Title": "Great looking", "Author": "William Traynham", "ReviewID": "RJC0OLVGDKBI1", "Overall": "3.0", "Content": "Item was out dated. I had to take it Verizon to get download software to have my 60 contact uploaded.  This should have been already on the phone.", "Date": "December 31, 2011"}, {"Title": "more information about the proucto", "Author": "Luis Gonzalez", "ReviewID": "R2O3JXFYV7CLRI", "Overall": "1.0", "Content": "Amazom Customer Service. I recently bought this product (Samsung Omnia i910 Phone, Silver (Verizon Wireless), but not satisfied by the cell phone tecnlogia is discontinued and not offered sufficient details prduct. I lost a UD $ 200.00 for the technology of CDMA Cellular Sansumg is my country and the Dominican Repulic telefonic company used technology and GSM SIM. So my recommendation is to put more details Produtos literally. God Bless", "Date": "September 28, 2011"}, {"Title": "Sturdy Hardware, Unfortunate Software", "Author": "cmonyuk", "ReviewID": "R28KREO60Q26DF", "Overall": "4.0", "Content": "I've always been impressed by this phone's hardware, but the Windows Mobile 6 software really just doesn't cut it.  It was designed to be used on PDAs.  I've flashed it a few times, which is pretty easy.  But I don't like that the USB cord is proprietary.", "Date": "July 21, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004D2JSLS"}}