{"Reviews": [{"Title": "review on samsung focus i917", "Author": "Suresh Srikantapuram", "ReviewID": "RRJGA44S26JSW", "Overall": "4.0", "Content": "Phone is excellent in terms of display,audio,camera,browsing.But real disappointment is the poor quality of radio.The FM radio quality is not so good even outdoors& when played indoors is very very poor.I understand this review from other users also.Ofcourse this feedback is when radio is played in India, but I am not sure about the quality when played in the US.Expect for the radio , phone is excellent.SureshSamsung Focus I917 Unlocked Phone with Windows 7 OS, 5 MP Camera, and Wi-Fi--No Warranty (Black)", "Date": "July 3, 2013"}, {"Title": "It suits me.", "Author": "Andre", "ReviewID": "R3KGZ8WDG8L3Z9", "Overall": "5.0", "Content": "This samsung with 7.5-7.8 OS can easily provide everything that common people need. I have an iphone 5s also and I'm definitely sure that apple is really much more expensive but aint much more useful than i917 for me.", "Date": "January 6, 2014"}, {"Title": "Great phone", "Author": "Robert Littleton Jr.", "ReviewID": "R1MQ4PFFQD1038", "Overall": "5.0", "Content": "I love this phone. Second one I have purchased. It has worked very well for a great price. I highly recommend it.", "Date": "December 7, 2013"}, {"Title": "Just as described.", "Author": "Francisco Gil", "ReviewID": "RCDXVC4EC4T0B", "Overall": "5.0", "Content": "This is a very good mid range smartphone for its price. I really loved the super amoled screen because the colors are vivid.", "Date": "September 21, 2013"}, {"Title": "Good Phone for the price", "Author": "John M Thiele", "ReviewID": "R1XLW81VC39OFZ", "Overall": "4.0", "Content": "Very nice windows phone, great price. Bought it to replace a Blackberry that wore out in slightly over a year and did not want toextend my ATT contract. My only concern is that the back is somewhat flimsy and might come off after extended use.", "Date": "August 16, 2013"}, {"Title": "Veru good cell phone", "Author": "Miguel Aristides Gonzalez", "ReviewID": "R24KKDQ4B2SXDY", "Overall": "5.0", "Content": "Yes I like itYes I recomend this product no complains to this moment.thanks a lot for this oportunity to get this cellphone", "Date": "July 24, 2013"}, {"Title": "Amazing cellphone that i have bought", "Author": "Just_ an_average_customer", "ReviewID": "RI0OBGEPOW6IK", "Overall": "5.0", "Content": "Who ever wants to buy this phone do not have any second thoughts.this was the first smartphone that i have bought and i wont regret it. I have att so once i put in my sim everything work. The internet texting and calling all work. I thing that got me angry but i soon got it to work was that i couldn't  download any applications on the phone. Then i went to the att store and they told me that i needed an update. So i came back home went on my computer downloaded the Zune software. And began the update. After every thing started working. Sorry for the long review but it really is a wonderful cell phoneCons:wonderful big touch screen phone  Comes in the package with everything including headphones  Great camera", "Date": "July 11, 2013"}, {"Title": "phone is fine, Windows Phone 7 isn't great", "Author": "Harry Truman", "ReviewID": "R3EP6AR9GTGL1E", "Overall": "4.0", "Content": "This is my first smartphone, so I'm not an expert, but I'm very happy with the hardware. The screen is very responsive, no lag, the colors are nice and bright, and the camera is pretty good as well. On the other hand, the operating system isn't great. Windows Phone 7 doesn't allow you to resize the icons on the home screen, and I had some trouble installing apps, so you'd probably need to upgrade to WP 7.5 or 7.8, for which you need a Windows or Mac computer with the Zune software installed.If you're using the phone to look up directions a lot, be aware that Bing Maps doesn't have the public transportation option that Google Maps has. There's no Google Maps app, and as of June 2013 you can't hit Google Maps through the browser, either, since Google has for some reason blocked the Maps mobile website on Windows Phone devices. So if you're looking to use public transit in an unfamiliar place, this phone won't be much help.One note on the unlockedness of the phone. I purchased the phone from Phone Etc. The box, the manuals in the box, and the phone itself were all branded AT&T;, and the phone came with a bunch of AT&T; apps installed, so I was worried that the phone was still locked to AT&T;'s network. However, it turns out that it was indeed unlocked. I was able to hook up the phone to Three in the UK and it's worked without problems.If you'd like to check and don't have a SIM card from another GSM carrier to just stick in and try, you can instead check the Diagnosis Panel. Go to the phone keypad like you're making a call, dial ##634#, and press call. After a few seconds, another keypad labeled \"Diagnosis\" should pop up. On that keypad, dial *#7465625# and it takes you to another screen with a few buttons, the first of which shows you the lock status (SIM/USIM Lock, Network Lock, Network Subset Lock, Service Provider Lock, Corporate Lock). If it's locked, you can call up AT&T;, and as I understand for a phone this old they'll just give you the code to unlock it for free. Otherwise, your phone should be good to go.", "Date": "June 19, 2013"}, {"Title": "It works, and works well.", "Author": "D. Reisinger", "ReviewID": "R1TUUNTSO1DL7A", "Overall": "5.0", "Content": "I have had Iphones, and liked them, but this windows phone is the best I have ever encountered. The operating system works flawlessly, thousands of good practical and entertaining apps are available for any interest or need...and call quality is excellent.battery life could be longer, but I do spend an inordinate amount of time reading on mine so....", "Date": "June 11, 2013"}, {"Title": "windows 7 phone", "Author": "Lee", "ReviewID": "R9KWUXD4GCKW4", "Overall": "5.0", "Content": "Very happy with this phone.  The 1st time using a windows phone and have had no problems with it being a unlocked phone", "Date": "May 27, 2013"}, {"Title": "Samsung focus i917", "Author": "Jayeybee", "ReviewID": "R3RUZ5RT6VQPRB", "Overall": "5.0", "Content": "Great phone, got it within 3 days, looks brand new. Good to have a windows phone, excited to use it around the world", "Date": "July 25, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004V1NGVE"}}