{"Reviews": [{"Title": "Good phone for its price...", "Author": "Sal", "ReviewID": "RD3DRAPKN6XNO", "Overall": "4.0", "Content": "Good phone.  Cheap price.  Does its purpose.  I do not demand too much of a phone other than texting and calling... the phone is small and it locks itself automatically so if you sit or walk you will not press in any bottons or dial any unwanted calls if phone is in your pocket...  dropped it three times already and the phone seems strong.  The battery life is decent as well.  There is also no sims card on this phone, you will have to go online to register or call Boost Mobile...  unlike the old days when cards were switched... If you just want a phone and do not care for fancy items and just want a phone for a good price, I guess this would be it.  I already ordered two extra, for my mom and wife...", "Date": "January 7, 2012"}, {"Title": "You get what you pay for", "Author": "Gregory D Hadden", "ReviewID": "R1TA06BA5RW9R8", "Overall": "5.0", "Content": "The phone was as described, what I expected.  Just make sure you don't need to use the browser for much. Facebook is ridiculously slow, but that's a problem with the technology, not the seller.  It's the cheapest boost phone and there's a reason.  If you don't use a lot of data and just need a cheap phone this is for you!  I would recommend this to older people that don't text/surf a lot;", "Date": "January 2, 2013"}, {"Title": "What do you want for $30.00 Bucks", "Author": "carlo", "ReviewID": "R1L9F3M0UPODI8", "Overall": "5.0", "Content": "For thirty bucks I give it 5 stars. if your looking for a basic small phone. This is it. If you looking to talk all day long and text all day long. Then this phone is not for you. You can text but it has small keys and screen. It is a Very good phone for the money.And for what it does.", "Date": "March 14, 2012"}, {"Title": "Looking for non-Smartphone", "Author": "Debbie Dixon", "ReviewID": "R16MOPNQ2D292", "Overall": "3.0", "Content": "Phone was not as expected (smaller that I thought) and when pressing specific key, my fingers hit the wrong button, but I'm willing to try it for a while.", "Date": "September 28, 2013"}, {"Title": "I really .... really hate this phone", "Author": "linds", "ReviewID": "R37BRKIU4DR72R", "Overall": "1.0", "Content": "OMG i hate this phone. I had a better phone when i was in high school which was a Motorola razor lol. this phone makes texting frustrating and its so small its so embarrassing to talk with. I bought this because i was desperate for a temporary phone , and as that its okay but i could never go months using this.", "Date": "February 18, 2013"}, {"Title": "U GET WHAT U PAID", "Author": "cabodebohemia \"cabodebohemia\"", "ReviewID": "REL7G1N124EFI", "Overall": "3.0", "Content": "For who's talkative, is very good phone, i bougth this only for test the boost mobile service, And i will by an smartphone now from boost of course, also for 10 dollars + i can call unlimited to my country, ONLY RESIDENTIAL but is better than nothing, and guess what??? NO F@&$ING CONTRACT.", "Date": "April 28, 2012"}, {"Title": "I LIKE TRAINS!", "Author": "Jill M. Liapis", "ReviewID": "RCKEOT86B1H69", "Overall": "5.0", "Content": "IT ROCKS!!!!!!!!!!!!!!!!! I LOVE IT! SO DOES MY BROTHER AND MY MOM AND MY DAD! WHO LIKES PIE? I DO! AND I LIKE TRAINS!", "Date": "March 17, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Affordable no-contract phone from Boost Mobile for on-the-go voice and text communications\nChoose from Monthly Unlimited or $2 Daily Unlimited plans with unlimited talk, text, e-mail, and web\nGPS for navigation; speakerphone for hands-free communication; access to text and instant messaging\nUp to 5 hours of talk time; runs on Sprint's nationwide network; released in May , 2011\nWhat's in the Box: handset, rechargeable battery, charger, quick start guide", "Name": "LG 102 Prepaid Phone (Boost Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/41NeJaeIC1L._SY300_.jpg", "ProductID": "B005SVTJWQ"}}