{"Reviews": [{"Title": "bittersweet", "Author": "fairybee", "ReviewID": "R1MBBGKZRY2STT", "Overall": "3.0", "Content": "I love this blackberry because it works so easy with one hand and I am familiar with it. But I have had more problems with this phone then any other and I only had this phone for 5 months before it went well lets say dead. The spot for the memory card was broken so I had no way to latch in the memory card except with tape. Anytime I took the battery out for purposes of sim card or memory card my phone would not turn on again for 8 hrs or more, it was extremly frusterating. Lastly my phone fell off the tv and the middle touch ball broke off and now my phone is completly unusable! Not strongly made.", "Date": "January 5, 2012"}, {"Title": "No volume on the ringer!", "Author": "sunflower0607", "ReviewID": "R2OP988X2PUP9Q", "Overall": "1.0", "Content": "The phone had no volume. It had to have been defective because we first got the wrong color phone and it had a louder ring, but the phone itself was not user friendly either. It was hard to find things. I never found my contact list! There was a little ball in the  center to control which didn't work well. Not a good phone at all! I would prefer a cheap phone that does nothing over this thing.", "Date": "December 31, 2011"}, {"Title": "Yep definitely not new", "Author": "Bryan Yohnka \"YOHNKA\"", "ReviewID": "R3VJZLXBSMIZC", "Overall": "1.0", "Content": "I wanted to buy a new 8310 and got nothing but a joke in a box. The screen or buttons is messed up.I would have had a better deal getting a used phone from some random person.Thanks alot", "Date": "November 16, 2011"}, {"Title": "What the heck?", "Author": "christiandaae", "ReviewID": "R29OH1HM7NBXXV", "Overall": "2.0", "Content": "When I bought this phone, I think my expectations were way too high. I'd heard a lot about BlackBerry phones from friends who have them, and from the media, so I thought I'd try it. The phone takes forever just to turn on - almost ten full minutes! - and once it's on, the setup is just weird. I had to jump through hoops just to get my Bluetooth to work. And I really don't like the fact that the wrong charger was sent with the phone. I had to find some other way to charge the stupid thing. The only good part about this phone was that it had a fun game on it: Brick Breaker. Apart from that, it was a complete waste of money.", "Date": "March 17, 2013"}, {"Title": "trouble with the keys", "Author": "ELISHA LEE   ELISHA LEE", "ReviewID": "R17VB6UUK0FBBF", "Overall": "3.0", "Content": "the typing keys are to small for a person with big fingers  and that is nothing odd to see people with big hands and big fingers  i sub-just you watch the public more closely  so you will know i know because i had one  had to return it  for that reason", "Date": "February 18, 2013"}, {"Title": "excellent", "Author": "isantry", "ReviewID": "R1Y4UFIOS3NNW0", "Overall": "5.0", "Content": "The product arrived at the locker in Miami, Florida in the estimated time, still have not received it in my country as it is in office, however everything perfect.", "Date": "February 15, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "2G GSM: 850 / 900 / 1800 / 1900\nQWERTY keyboard, Trackball navigation, Blackberry Maps, Document viewer (Word, Excel, PowerPoint, PDF), Media player (MP4/WMV/H.263/H.264/MP3/WAV/eAAC+/WMA), Organizer.\nCamera: 2 MP, 1600x1200 pixels, LED flash.\nInternal Memory: 64 MB ROM, MicroSD expandable (4 GB max).\nUnlocked , Ready To Activate, No Contract Required", "Name": "RIM BlackBerry Curve 8310, T-Mobile - Unlocked (Black) at GSM only - No Contract Required", "ImgURL": "http://ecx.images-amazon.com/images/I/51J-sZdp12L._SY300_.jpg", "ProductID": "B005152926"}}