{"Reviews": [{"Title": "blackberry 8330", "Author": "Laura Dupre", "ReviewID": "RAKFM1E0KCNCS", "Overall": "1.0", "Content": "I can't send picture messages or receive picture messages i just can't wait to get another phone it will not be a blackberry 8330", "Date": "February 7, 2013"}, {"Title": "OK as far as basic phones go", "Author": "Jackie Lyons", "ReviewID": "R2ET3WBRPZ3NE", "Overall": "4.0", "Content": "The phone works ok as a phone but does not work well with messaging, and the tracking ball is easily broken so I had to order replacements.", "Date": "November 13, 2013"}, {"Title": "good", "Author": "comcel", "ReviewID": "RHIR82YX1DDD9", "Overall": "5.0", "Content": "Good!! excellent items, its perfect and work excellent this is best good and I think buy more again thank you!!!", "Date": "September 9, 2013"}, {"Title": "RIM Blackberry 8330 Silver Verizon Smartphone Camera GPS", "Author": "F. E. Felty", "ReviewID": "R3FC6B6JRUMTNB", "Overall": "1.0", "Content": "Unit arrived in good time and had no physical defects. After transfering everything to the new device, everything was fine for about 6-7 days. Then it spontaneously rebooted one time. A couple days later, it happened again this time twice about 3 hours apart. Then it started happening every day, up to 5 times each day. The device was returned for refund. As a matter of curosity, I just checked (02May13) and the $39.99 has yet to be refunded to my debit card.", "Date": "May 2, 2013"}, {"Title": "Two phones in six days", "Author": "RICHMOND C WILSON", "ReviewID": "R1HHJOLFT5QARC", "Overall": "5.0", "Content": "I have to say my experience with Amazon has been good. Passport has gone beyond what I would expect. The time was perfect. Arrived the first day of expected delivery date. The phone sent was the wrong phone 8830 instead of 8330. I was satisfied with the 8830 Blackberry, except it didn't have a camera. I notified passport. They sent me a updated Blackberry 8530 and told me to keep both phones.", "Date": "May 17, 2014"}, {"Title": "The best product in the world.", "Author": "Amazon Customer", "ReviewID": "RCDM2799ZJAS0", "Overall": "5.0", "Content": "I'm not sure why the picture of the phone advertised is green.The phone is silver and black.I wanted to tell the seller and Amazon that I really appreciate it. I love this phone. Also it was advertised as not coming with charger,but it did and I'm grateful for it.It Al's. Came with battery, and 2 earphones sets.I have been wanting one of these phones for a long time. When the opportunity came for me, I'm glad I took the chance to order it.There's nothing wrong with this phone. It's absolutely perfect. Thank you so much.Lovvvvvvvveeeeeeeee iiiiiittttttt sssssooooooo mmmmmuuuuucccchhhhh...", "Date": "April 2, 2014"}, {"Title": "web dosnt work", "Author": "landau", "ReviewID": "R36L5XHLHXT446", "Overall": "1.0", "Content": "no web no pic mail no email no gps der is notihng to like about thihs phone. thank you very much", "Date": "April 29, 2013"}, {"Title": "Dumb stinking phone", "Author": "Hog a be", "ReviewID": "R416EBC9A7HHN", "Overall": "1.0", "Content": "i order this phone for mi son and wen it arrive in the caribbean this stupid phone cant work cause it does not have nuhway to put mi sim card so i ask nuhbody to buy this phone its not good a tall order a next one not this old stupid phone thank you", "Date": "April 20, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "RIM Blackberry Curve 8330 issued by Verizon\nInternet browser\nmicroSD slot for extra memory\nBluetooth & Camera\nA/C adapter not included", "Name": "RIM Blackberry 8330 Silver Verizon Smartphone Camera GPS", "ImgURL": "http://ecx.images-amazon.com/images/I/41Wj6sRA-yL._SX300_.jpg", "ProductID": "B005643W96"}}