{"Reviews": [{"Title": "Razr phone", "Author": "Nets", "ReviewID": "R32PVZNU0VRN95", "Overall": "3.0", "Content": "The battery life is very very poor when you use the phone and I requested a back piece as mine kept falling off. I was told it was shipped but when I got the shipment.... it was two earphone that was mailed and not what I was told. I have taken steps to return to sender because they are no use to me.", "Date": "July 30, 2012"}, {"Title": "Very Pleased", "Author": "Asanrules", "ReviewID": "R1UQAWWQMTRB1G", "Overall": "5.0", "Content": "Merchandise arrived when it said it would and I live on Guam. Product was everything I expected. Although my black Razr V9 was more in detail and the rose Razar V9 was all with AT&T; icons which I do not like. My black V9 was an unlocked phone when I got it in 2008.", "Date": "April 10, 2012"}, {"Title": "ok", "Author": "jw", "ReviewID": "RPGPNLEJJYBDI", "Overall": "3.0", "Content": "it dident work for me. if you buy a unlocked phone that dont come from the usa not everything will work on it. i really like the razr wish they woud start making them again.ps the phone is not made in the usa its were it was first set up that will cause the proublem.", "Date": "April 2, 2014"}, {"Title": "No refund", "Author": "Sharmaine Ceballos", "ReviewID": "R2SRVB455CRZDB", "Overall": "4.0", "Content": "Sent phone back because it didn't have a signal at workTo my knowledge I never  received my $166.00 refund. Contacted seller he did respond said he would check on it and that was the last I heard from him!Motorola V9 Razr2 Special Rose Gold Edition Unlocked 3G GSM HSDPA Cell Phone Mobile", "Date": "September 19, 2013"}, {"Title": "Gift", "Author": "Sheila Cottman", "ReviewID": "R2X5IC5EDX6ZIJ", "Overall": "3.0", "Content": "I bought this item as a gift for a senior citizen who only liked flip phones.  She is enjoying it but has an issue with drop calls. Are you sure its a 3g? I myself had a 9x and enjoyed it till I washed it years ago.  I feel that Motorola has been a good product.", "Date": "June 5, 2013"}, {"Title": "Not useful on AT&T;, great for intl use", "Author": "Caroline Bender", "ReviewID": "RBXBI42PM09K7", "Overall": "3.0", "Content": "This was a gift for a friend who had the same model and loved it. When hers broke, I found a new, unusued one from a third party seller. The phone itself is much more attractive than the picture would suggest. The color is very subtle and changes in different light. It's called rose gold and that's pretty accurate. You can see both glints of rose and gold in the finish. At other times, it has a sort of bronze tone. The texture of the phone makes it more resistant to finger marks than a shiny gold phone would be.***UPDATE****It's an unlocked GSM cell phone that should work worldwide, with the right SIM card. In the US, at least, it's not so simple. A friend for whom I bought this had bad experiences--AT&T; activated it for her, and she could make and receive calls, but because it wasn't locked to AT&T;, they told her she couldn't get her voicemail from it. She loved this model of phone but, ultimately had to discard it. It should work fine, though, with T-Mobile, presumably.All in all, a very nice phone that sadly is no longer in production and won't work well with AT&T.;", "Date": "April 25, 2013"}], "ProductInfo": {"Price": "$152.37", "Features": "Unlocked Quad Band 3G\nHSPDA\nSpecial Edition Rose Gold", "Name": "Motorola V9 Razr2 Special Rose Gold Edition Unlocked 3G GSM HSDPA Cell Phone Mobile", "ImgURL": "http://ecx.images-amazon.com/images/I/31Tf4Mj48lL.jpg", "ProductID": "B00563TP02"}}