{"Reviews": [{"Title": "great phone , i LOVE it", "Author": "shlomi", "ReviewID": "R3F1YAYZTHS63Q", "Overall": "5.0", "Content": "i have this phone for a week now , and still can't stop messing with it :)small screen ? the image is so sharp you just forget its small .the design is beautiful the phone is light and thin , sits perfect in my pocket .as for performance , super fast and responsive , great camera and easy to get used to .i just wanted a small smartphone and i got so much more !1 issue - this model works worldwide but you cant get 3g network from US carriers (at&t; - T-mobile). voice , text and 2g network , works perfect . if you use wifi internet and don't care about mobile network go for it , if u DO want 3g , you will have to buy the ST18a model , that can get 3g from at&t; .", "Date": "January 22, 2012"}, {"Title": "Great phone!", "Author": "Cyrual", "ReviewID": "R3UHNDFP6WY6OY", "Overall": "5.0", "Content": "This phone does what I want when I want. It's only limit is the network. I downloaded Skype for Android yesterday and made a few video calls, finally making use of the front camera. I'm pleased with it overall.", "Date": "September 2, 2012"}, {"Title": "Almost Perfect", "Author": "Kayjenx \"Kayla\"", "ReviewID": "R24NCGSUHOG3H4", "Overall": "4.0", "Content": "Everything about this phone is great. I bought it knowing it would upgrade to ICS Android 4 and it did so and works great. The screen is so bright that it drains the battery pretty fast so what I do it lower it so that the battery life is extended. The screen is still very vivid but phone battery last me for 3 days with normal phone use and not much internet usage.Its very easy to set up and use and I would recommend to some with very small hands. My hands are on the smaller side and I can't even use the qwerty keyboard in portrait mode. So then I am stuck using it in landscape mode, and T9 with phone pad in portrait. But really that's my only complaint.I use the hotspot option from time to time and it really takes a toll on the battery but I suppose that is to be expected.Oh! come to think of it I have a couple weird things that happen at random times but I am not sure why. One is that I would be replying to a message and then when I look at my screen there is nothing typing. I would have to come out and the message and then return and it would work.The other things is about 5 times since I got the phone in March, it has told me that I need to insert a sim card when I already had in a sim card. Restarting my phone is the only way to fix this. But as it doesn't happen often I don't consider it a big deal. However when it does happen it is very annoying.", "Date": "June 5, 2012"}, {"Title": "Love sony ericsson", "Author": "Celina", "ReviewID": "RHHZ4PTM242AZ", "Overall": "5.0", "Content": "The camera is great. The sony ericsson menu is great. It's light and beautiful.I've been using this phone for almost 3 years now, dropped it several times but it's still working perfectly!", "Date": "September 3, 2013"}, {"Title": "Decent Smart Phone and Works Excellent and has all the features which you want", "Author": "Shikhi Shekhar", "ReviewID": "R3ZELVRURVCHT", "Overall": "4.0", "Content": "I really like this Smart Phone. Camera is nice 8 MP. Works great came with a 4GB Memory card. But If you download application and mobile games more than enough, it gets slow. But then I kept all the necessary apps like viber whatsApp, Few Games GPS etc.GPS Works very great with this phone", "Date": "April 14, 2013"}, {"Title": "Olerwin", "Author": "WIN", "ReviewID": "R3JWRK40RYBB7H", "Overall": "5.0", "Content": "excellent! I am enjoying his qualities ... shape, design is spectacular and so its size and the drums chose him not disappoint if you saw before buying their characteristics and weaknesses", "Date": "January 21, 2013"}, {"Title": "Excelente!!", "Author": "Raúl Magallanes", "ReviewID": "RKJ1G608L15N0", "Overall": "5.0", "Content": "Excelente telefono Lo recomiendo al 100% funciona perfecto en venezuela, buen vendedor entrega super rapida. con todos sus accsesorios incluidos :D", "Date": "January 15, 2013"}, {"Title": "Great phone", "Author": "T. Ta", "ReviewID": "R1QUJQVF0JYNE0", "Overall": "5.0", "Content": "It is small, light, sleek, just what I was looking for. I was able to upgrade to Android 4.0One of the drawback due to the small size is that it is kind of hard to type when the phone is vertical.I actually bought it for my sister in Asia. I wish it were compatible with T-Mobile so I can use it her in the States.", "Date": "August 30, 2012"}, {"Title": "Information Sony Xperia Ray ST18i", "Author": "Suyin", "ReviewID": "R1EFB0XQKP0UWV", "Overall": "5.0", "Content": "Good afternoon. I am interested in buying this phone (SONY ERICSSON XPERIA RAY / ST18i ). I'm from Venezuela and I have a question. My telephone operator is Digitel and is used to the 900 band 3G signal. Ask a store and told me that to buy this phone should work with HSDPA 900 and that was compatible in USA with T Mobile and AT & T. so I want to know if this phone would serve me.Thanks", "Date": "July 23, 2012"}, {"Title": "Muy Bueno", "Author": "darwinunlimited", "ReviewID": "R2LSSDRB51IH54", "Overall": "5.0", "Content": "Gran telefono super buena la compra que hice era gusto el que estaba buscando de muy buena ayuda para mi", "Date": "December 5, 2012"}, {"Title": "it's sooo cute", "Author": "Joyce", "ReviewID": "R1WO330TYWPRJ2", "Overall": "4.0", "Content": "I bought this at the end of May, and till now it works well. It's very simple but elegant, very nice looking! The only thing I am not such satisfied is the small screen. Font size makes me feel not comfortable. Oh another drawback this machine always run out of battery.. All in all, it worths the price.", "Date": "June 28, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "ST18i White\nFactory Unlocked Mobile Phone", "Name": "SONY ERICSSON XPERIA RAY / ST18i (WHITE) : UNLOCKED INTERNATIONAL GSM ANDRIOD PHONE", "ImgURL": "http://ecx.images-amazon.com/images/I/41lcnd7JCfL._SX300_.jpg", "ProductID": "B005MKPVYI"}}