{"Reviews": [{"Title": "Bargain Palm OS GSM Cell Phone", "Author": "Amazon Customer \"helakejr\"", "ReviewID": "R20ZMQGKXKSCQB", "Overall": "4.0", "Content": "My wife is a technology last adopter. She loves the Tried-and-True Palm OS Treo type phones with a keyboard. Prior to this purchase she had a Palm Treo 650 Palm Treo 650 Quad-Band Unlocked GSM Cell Phone with Touch Display, QWERTY Keyboard, and Camera - yes, the one with the little antenna thumb protruding from the top of the phone. I used the Treo's, graduated to PPC Windows phone for a while (or degraded depending on your point of view), then to an android powered LG G2x, I'll save this for another review. Since the Palm 650 is no longer made, produced or supported I wanted her to have a more current solution. Side note: My wife actually uses almost 100% of the phone features (e.g. phone, contacts, calendar, texting, camera, memos, etc; her life is in her phone which I have her back up locally to an SD Card with a Palm OS Backup/Restore program. Note: This backup takes about 20 seconds for her last 10 years of records vice the 15 minutes or so via USB syncing. I noticed that prior to Palm being purchased by HP they produced the Palm Centro which is functionally the same as the Palm 650 with the following noted improvements: smaller, no protruding antenna, same Palm OS version as the 650, same black and white 1.3mpixel camera (yes - black and white), in short a phone that has other features. Noted shortcomings: GSM cell signal (at our house I have to use WIFI calling because even GSM doesn't work with my G2x, while my wife's Palm 650 always had a signal) the Palm Centro GSM has a signal about 25% of the time.", "Date": "January 2, 2012"}, {"Title": "This phone refurbished, but still have a problem!", "Author": "eric xu", "ReviewID": "R2A92XDQF0YHGG", "Overall": "1.0", "Content": "I got the phone, we had thought it was new, refurbished, and the sound did not hear clearly, I do not know how to return the nasty sellers, no reliable", "Date": "March 18, 2012"}, {"Title": "Not a good one.", "Author": "C. Certain", "ReviewID": "R34QVOQZGYIBWD", "Overall": "2.0", "Content": "Bought this phone for hubby to replace his beloved Palm. This phone worked for a very short time and then stopped. Still love the phone but this one had something wrong.", "Date": "December 7, 2013"}, {"Title": "not so good", "Author": "latisha smith", "ReviewID": "R3QVOA0OQ4FHHF", "Overall": "1.0", "Content": "phone stop working in a month call's drop the phone is huge really aint made to fit in pocket. ..", "Date": "January 13, 2013"}, {"Title": "software buggy: locks ups, does not respond to some commands", "Author": "a Smith", "ReviewID": "RCELDW60TT1I2", "Overall": "1.0", "Content": "I love the Palm OS.  I do not like this phone.  It locks up on about half the calls I answer.  I have to remove the battery to reboot the phone before I can return the call I just missed because the phone locked up. . . very annoying.  In addition, half the time I try to call someone using the phone book or call history, the software does not respond and I have to reboot the phone.  Texting, todo list, calendar, etc. work fine.  If I were not so frugal and talked on the phone more, I would have replaced this phone a long time ago.", "Date": "December 14, 2012"}, {"Title": "Palm Centro", "Author": "Mel", "ReviewID": "R3R819V58S3VFP", "Overall": "2.0", "Content": "First this phone came in Spanish!  I had to go to AT&T; and ask for help.  Thank goodness someone there figured out how to change it over.  The phone does not do the same options my other phone did, so disappointed in that.  This phone is great for its calendar and camera.  The volume on the phone is very low enough that I have to keep it on speaker phone.  Wondering where it came from.", "Date": "October 22, 2012"}, {"Title": "Palm Centro Unlocked GSM Phone", "Author": "S. Grabowski", "ReviewID": "R37VSV955G9DSN", "Overall": "5.0", "Content": "This cell phone may be outdated and no longer supported, but it supports all my needs and allows me to continue using the \"antiquated\" Palm Desktop to manage my contacts, To Do list, etc. I use it with my T-Mobile pay-as-you-go plan. While this cell phone is not on the list of devices supported by T-Mobile, the reception is great (where there is coverage.) I am perfectly happy with it.", "Date": "October 13, 2012"}, {"Title": "I Love PalmOS, But...", "Author": "An Ikearat's Brain \"Tom\"", "ReviewID": "ROJNPBL2Z58IT", "Overall": "3.0", "Content": "I have a bunch of Palm devices. I like them all for many reasons.The Palm Centro I received was in perfect condition, the seller shipped it really fast and I was very happy.After about a week the audio while on a phone call went away. No sound from the other end and they could not hear me. I tried several phone numbers, and even did a \"hard\" reset to the Centro. The system sounds would work but no call sound and no music. Amazon sent an RMA and as soon as I can get to a drop-off location it's on it's way back.I have already ordered and received another Palm Centro... it's working so far. I don't expect to have any problems as the phone that failed was the first Palm device I have ever owned that failed without many months and sometimes years of hard use.Review ends here, the rest of this is self-serving silly business :)Geek-list of my Palm devices;PalmIII (several units)PalmIIIeTRG Pro (just amazing!)Kyocera Smartphone (yes, there actually is a product called a Smartphone) I have two of these and would use them today if Sprint was not a bunch of <deleted>.Palm T|XPalm CentroPalm Treo 680", "Date": "March 13, 2012"}, {"Title": "Battery Charger Port", "Author": "Sexy Daddy", "ReviewID": "RY9F1VJJYAJBL", "Overall": "2.0", "Content": "My daughter was happy with the style of the phone and I was happy with the price of the phone. The issue we ran into was the battery charger port was defective. My daighter was unable to charge her phone.", "Date": "February 13, 2012"}, {"Title": "Call Dropper", "Author": "Gator 40", "ReviewID": "R1E0TVPOQQG9FX", "Overall": "2.0", "Content": "No offense to the seller as the phone was in Great shape and the delivery was as expected, since it was free shipping; however, the phone itself is garbage. I can't hold a conversation for longer than 5 minutes, due to the calls dropping. I'm actually afraid to move during a phone conversation. Some users may have experienced better reception than me, but this phone is a nightmare to use. Don't think I'll be purchasing another Palm product....", "Date": "February 11, 2012"}, {"Title": "Great Phone Great Price !", "Author": "Ronald Lyons", "ReviewID": "R3MJBCVVRSALHT", "Overall": "4.0", "Content": "I was amazed at this Phone and at the Price. I am Ordering my 3rd one Now as they make wonderful Gifts.Very Strong Sturdy Phone and It comes with a Leather carry Case , Earbuds and USB Cable. The Only Problem I have is That it doesn't have a Language Selection. Spanish is Especially needed in Central America.EcoCell is a Great Seller and I highly Recommend them !", "Date": "April 5, 2012"}, {"Title": "Extra work needed", "Author": "cephalus", "ReviewID": "R1RIESC97BUSTW", "Overall": "4.0", "Content": "It's in spanish but english in the first place, I was really frustrated when cannot find any option to change it to English. After lots of google, I hard reset it and finally got something I can understand. After many ordeals, now I can install apps to this phone.In summary, it's a good phone but need extra work, if you can do that, it's definitely worth its price.", "Date": "March 5, 2012"}, {"Title": "Don't waste your money!", "Author": "shelleb", "ReviewID": "R2JNHM3L64CIT8", "Overall": "1.0", "Content": "I ordered this phone thinking it would be easy to use. Wrong. It was not at all user friendly, had to click and scroll too much to do anything besides send a text. The touchscreen didn't respond so I ended up tapping it repeatedly and was afraid I would break it. Honest to God, the items on the main menu kept disappearing and moving around...I couldn't find them. I'm not very tech savvy, so I finally gave up after a week or so and returned it. Hated this phone!", "Date": "January 26, 2012"}, {"Title": "Inconforme", "Author": "Carlos Leiva", "ReviewID": "R1361PCF10HC4I", "Overall": "2.0", "Content": "El telefono viene sin el cable de sincronizacion a la computadora, sin los manuales y sin el cd de instalacion.  Eso no lo indican en la oferta de venta, si la pagina lo indicara no habria realizado la compra.  Estoy inconforme con lo que recibi.", "Date": "October 30, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0058J4WNY"}}