{"Reviews": [{"Title": "An elegant powerhorse", "Author": "Toni", "ReviewID": "R300BU5222U7NR", "Overall": "5.0", "Content": "I have to admit, I was an avid iPhone 4 user before the Nokia N9. I enjoyed the simplicity of the iOS UI and the vast collection of applications available.Then after a year of use, I decided to jump the N9 ship.I was afraid that Nokia couldn't pull a consistent user experience around the phone. To be frank, I was glad that wasn't the case here.Unboxing went on very smoothly, quick guide was informative enough, obviously they've taken few pointers from a certain fruit company. The device is gorgeous, you really have to see it for yourself to determinate why all the fuzz.The only minus was the fliphatch holding the USB port is a bit stiff to open, since you have to press a tiny bump with your fingernails. Also bear in mind that N9 uses the Micro-SIM card, so consult your carrier before starting to ruin your current normal sized SIM card with scissors.A quick start application launches up the first time you start your phone and it guides you through the different swiping actions.And when talking about swipe, it's hardwired to the user interface everywhere (although, applications can override this). Swipe to the left or right and you'll be taken to one of the three main views. Notifications, where all your FB, Twitter, RSS Feeds, weather data or missed call notifications are seen. Application view, this is probably the most Nokiasque view of them all, is a grid of apps. Unfortunately creating folders in this view isn't allowed yet but this's coming in next OS update. And the last but least is the multitasking view. All the programs open are displayed here and it's showing live applications, no screenshots here. I've opened more than 15 apps at the time at it doesn't seem to impact performance level that much.Unfortunately there aren't many apps available yet in Nokia Store but Nokia covers the essential bases here, twitter, facebook, foursquare and skype. Also the device comes with few preloaded games, Need for Speed, Angry Birds, Galaxy on Fire 2 and RealGolf 2011.Other great features include NFC, SIP, Office document viewer, fairly good MfE integration (more fixes coming to this in the next OS update) and HTML5 capable web browser.Screen saver shows clock and icons for notifications (new email, sms or missed call etc.), since N9 uses AMOLED screen technology - it really doesn't draw power at all. If you like to unlock the device, just double tap the screen to unlock it and swipe to menus.After a week of use, I fired up my iPhone 4 for comparison and the UX interaction model in iOS felt clunky. I tried to swipe and double tap the screen constantly, so going back to button centered model felt a bit frustrating.So, N9 might be the last of its breed, but it's going to a spectacular experience of its own. If you appreciate the combination of form and function without any fanboyism attached to it, I'd highly recommend this device to you.", "Date": "October 24, 2011"}, {"Title": "Beautiful, Simple MeeGo Device...and the Last", "Author": "Talvi", "ReviewID": "R7T55PC31T405", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2UAZ2032SFSM1embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2UAZ2032SFSM1refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2UAZ2032SFSM1chiDiv\").innerHTML = document.getElementById(\"cv_mo2UAZ2032SFSM1hiddenPre\").innerHTML;\n};\ncv_mo2UAZ2032SFSM1refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2UAZ2032SFSM1so;\t   \n\n\nfunction cv_mo2UAZ2032SFSM1loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2UAZ2032SFSM1so = new SWFObject(swfLocation, \"cv_mo2UAZ2032SFSM1AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2UAZ2032SFSM1so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2UAZ2032SFSM1so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2UAZ2032SFSM1so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2UAZ2032SFSM1so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2UAZ2032SFSM1so.setAttribute(\"height\", swfHeight);\n          cv_mo2UAZ2032SFSM1so.setAttribute(\"width\", swfWidth);\n          cv_mo2UAZ2032SFSM1so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2UAZ2032SFSM1so.write(\"cv_mo2UAZ2032SFSM1flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2UAZ2032SFSM1', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2UAZ2032SFSM1';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2UAZ2032SFSM1', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2UAZ2032SFSM1loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2UAZ2032SFSM1\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2KYCRYRK734HL\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2KYCRYRK734HL\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R7T55PC31T405\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2KYCRYRK734HL/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2UAZ2032SFSM1duration')) {\n      document.getElementById('cv_mo2UAZ2032SFSM1duration').style.display='none';\n    }\n    cv_mo2UAZ2032SFSM1loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2UAZ2032SFSM1loadSwf(movieID, playerVersion) {\n   return _cv_mo2UAZ2032SFSM1loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2UAZ2032SFSM1newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2UAZ2032SFSM1', 0, h);\n}\n\nfunction cv_mo2UAZ2032SFSM1resetPlayer(w,h,bw,cc) {\n  cv_mo2UAZ2032SFSM1newHeight(h);\n\n  cv_mo2UAZ2032SFSM1so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2UAZ2032SFSM1so.addVariable(\"cacheCode\", cc);\n  cv_mo2UAZ2032SFSM1so.setAttribute(\"height\", h);\n  cv_mo2UAZ2032SFSM1so.setAttribute(\"width\", w);\n  cv_mo2UAZ2032SFSM1so.write(\"cv_mo2UAZ2032SFSM1flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2UAZ2032SFSM1RollOverImg = new Image();\ncv_mo2UAZ2032SFSM1RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81uwYHdOPQS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2UAZ2032SFSM1preplay = document.getElementById('cv_mo2UAZ2032SFSM1preplayImageId');\nif (cv_mo2UAZ2032SFSM1preplay) {\n  cv_mo2UAZ2032SFSM1preplay.onmouseover = function() {\n    cv_mo2UAZ2032SFSM1preplay.src = \"http://ecx.images-amazon.com/images/I/81uwYHdOPQS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2UAZ2032SFSM1preplay.onmouseout = function() {\n    cv_mo2UAZ2032SFSM1preplay.src = \"http://ecx.images-amazon.com/images/I/81uwYHdOPQS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2UAZ2032SFSM1preplay.parentNode;\n\n  var cv_mo2UAZ2032SFSM1currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2UAZ2032SFSM1currentClick) {\n      return cv_mo2UAZ2032SFSM1currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:39 MinsNokia announced earlier this year that Symbian would become a \"franchise platform\" and MeeGo would become an open source project. The world didn't cry any tears...after all, there is a reason Nokia's smartphone marketshare has taken such a huge dive. But this...wow! The N9 is a gorgeous device, with a handsome unibody design and a curved glass AMOLED 3.9-inch touchscreen display.I used a SIM cutter to make a micro-SIM out of my AT&T; SIM and inserted it. The out of the box experience is a vast improvement - you charge it, power it up, and you get a mini tutorial including using swipe. And from there, you really don't need a tutorial or instruction guide. Within 10 minutes I had loggied into Facebook, Skype, Twitter, set up my RSS feeds, my work and home email, changed a couple of settings like the ring tone, loaded my contacts (Ovi), gave the  browser a spin (zippy and great user experience design), checked the weather (nasty snowstorm in October!), downloaded a free game from Nokia store, synched my music from iTunes, checked out Maps and Drive, and did one level of Angry Birds. All with a click on one of the icons on the main screen.I put it down and came back, and went to my notifications screen. SMS, email, calls, Facebook updates from my friends...everything in a few scrolls.  I swiped over to the open applications listing, touched and held for a few seconds, and closed everything. Then, I finally made my first call. I then realized I had been in love with this device from the first minute.Cool specs:- Wide-screen (16:9) HD display, curved smoky glass- 16GB of internal storage- GPS- 3G- Wifi- NFC technology- 8MP camera with a wide-angle lens- Supports Dolby headphones and Dolby Plus technology- Drive, which is optimized for in-car use with free turn by turn navigation and the ability to DL maps beforehand (to use offline)- Polycarbonate unibody, which means scratches show up less (matte appearance)- When locked, always displays the time and notification icons faintlyComes with a silicone case, headphones, micro USB, and a European plug. This phone isn't getting released by Nokia in the US.The vivid display, aesthetics, and form factor are awesome. This draws a lot of admiration when I have it out. I like having a phone that nobody else has, though the Nokia Lumia Windows Phone will look similar (hardware, not software!). My husband, a die-hard Apple fan, got his iPhone 4S over the weekend and said, \"I don't think this is better. That phone kicks $!@#!\" I have never been happier with a device. His 4S is clunky and unattractive next to this.UPDATE: got this comment from jb8967:\"You can run \"Alien Dalvik\" on the N9. This software allows you to run ANDROID apps on the N9. So even if the current list of Nokia Store apps for this Meego device is short, A.D. makes up for it by adding the Android ecosystem too.\"  However, other posters have commented that it isn't ready yet.Here is what Engaget said: \"Love at first sight -- this is possibly the most beautiful phone ever made.\"If Nokia had been making phones this simple and elegant earlier, then this wouldn't be the last MeeGo device Nokia will release. It's sad.UPDATE:The recent software update added the following:- updated music controls to make them easier to access while listening- expanded notifications on the standby screen, including battery- new filters for the camera: black & white, sepia, vivid, negative and solarize- Swype keyboard typing- Improved Mail for Exchange synchronisation (does only active folders to improve speed)- In call noise cancellation", "Date": "October 29, 2011"}, {"Title": "All it takes is a Swipe!", "Author": "rwb", "ReviewID": "RZTVLMC5ORRE3", "Overall": "5.0", "Content": "First off, let me be clear by saying that I extensively use Apple Products. I bought the first iPhone, the first iPad and have been a Mac user for many years. I also use a Nexus One from Google(runs Gingerbread), which as of today isn't that an old phone, so I can safely assume that I use the two major mobile operating systems daily. I have never used a Nokia device since early 2000s. I've little experience with Symbian from my dads phone.Why did I buy this phone?I never buy my phones without testing them in person(in a store/friends mobile). The only phone I have bought without testing is the original iPhone, which was an exceptional device. I saw a demo of Nokia N9 back in June 2011 and I was really excited about how the 'swipe' worked. If you don't know, 'Swipes' are a great way to do many things on the N9, like switch between apps, close apps,task switcher etc., I suggest you watch a video demo on youtube, since its difficult to write it down. They are a bit like multi-touch gestures on the iPhone, but totally next-gen and much more functional. I thought 'cool phone' but didn't bother to know more about it. But when the phone is released I was kinda interested to test it out, but to my disappointment the phone is nowhere sold in the United States. So, I took a risk and purchased this phone on Amazon, a bit reluctant and skeptical since this is imported from Europe. Another reason, the phone is Pentaband & Unlocked so it works on both AT&T; /T-Mobile (including 3G and HSDPA), so I don't have to worry about carrier lock-ins.Package Opening/First Impressions:When the package arrived, I eagerly opened the box and the Phone is just *GORGEOUS*. I didn't expect it to be that beautiful and well designed. I haven't seen any other phone in recent years with such a great design. Well, I love the design of Apple's iPhone, but the Nokia N9 is truly stunning. I've switched on the phone and the display is very nice. Very bright and clear. The phone's charging port is on the top instead of the bottom, with a push open slot. It supports Micro-USB port which is awesome. (I wish Apple supported Micro-USB). There is a Quick Intro on the whole Swipe Gestures, which is really nice. And It'll take you straight to the Apps screen.  To unlock the phone, you can double tap the home screen or swipe up the home screen, which you get so used to. After using the N9 for a while, whenever I use my Nexus One/iPhone I automatically try to swipe the applications and home screen. Thats how much you get used to the whole Swiping gestures.Micro Sim:Like the iPhone, N9 sports a Micro-Sim instead of a regular SIM. You can just cut it out from an existing sim with an xacto, but I recommend getting this cutter which worked flawlessly for me. Micro SIM Cutter, Converter with 2 SIM adapters You can also go to your carrier and get a new micro-sim for like 10 bucks.Accounts/Contacts:Then I went to the accounts app, which is a centralized location to store all your accounts information (like Keychain on the Mac). I entered my Google Accounts and it automatically setup a Gmail Inbox and imported all my contacts and calendars. But, it did have trouble pulling up all the contact numbers from my contacts. Luckily, the N9 has the ability to import contacts from a different phone via bluetooth, so I paired it up with my Nexus one and it automagically imported all the contacts with all the phone numbers and emails. Then I entered my Skype account and voila, I can use Skype to make all outgoing calls from my contacts which is a delight. No app or anything, its just built right in. Next, Twitter and Facebook and it pulled all my streams from the interwebs, no issues. You can also sync all the email/contacts/calendar with your Google/Exchange account. Now, all of this is now trivial in every smartphone. But the way N9 handles all of your accounts and personalized news feed from Facebook/Twitter/RSS feeds is a beauty.  Just swipe across your screen and it takes you to you there. (Again, none of the swiping makes sense unless you watch a demo video).Phone/SMS/MMS/Battery:The call quality is really good, although the reception isn't Nokia level. I remember the old Nokia phones always have the strongest reception, no matter where you are. The Nexus One has the best reception in my apartment, whereas the iPhone has the least reception. I'm on T-Mobile which is pretty good in my area. I use the iPhone with AT&T;, which at times is flaky. But once I get out of my apartment, all the phones have the strongest signal. So, its safe to say that the N9 reception is same as every other smartphone. The Texting app is really nice and I don't really use the MMS features, so I dont have much to say. I like the Swipe up to receive a call feature. The batter life is a bit better than other smartphones, but not Symbian level long battery life. Its still better than iPhone/Nexus One.Facebook/Twitter/RSS FeedsThe Facebook & Twitter apps are basic but they are deeply integrated through out the OS. I tweet a lot, so I kinda find the Twitter app a bit underwhelming, but it should suffice the needs of a lot of users. The RSS Feeds app is awesome and very polished, although I strongly feel that Google Reader Integration would have been a huge plus. The browser has the ability to detect the RSS feeds from any page and you can automatically subscribe to them right from the phone's browser, which is really nice. But still, Google Reader integration would have made it much more functional. They have a Google Reader app in the store, but it's just alright.Email:Email app is also very polished with very good UI. They have partial threading support and you can have bookmarks/favorites to  various folders, which is nice. It has a great range of syncing options like \"Frequency of Email Checking\", \"Active Syncing during the day and turn off syncing after 5pm\" and all sort of stuff. One feature I really wish they had was to have custom sounds for each Inbox/Folder, like the Gmail app on Android. Overall, I'm very satisfied with the Email client, although my Android phone has the best Gmail experience.GPS and Navigation:The N9 comes with two apps, Nokia Maps and Nokia Drive. They both at the very best are OK. Google Maps on the Android has the best navigation features and I really wish the N9 had Google Maps/Navigation. But there are some advantages with Nokia's navigation systems. *OFFLINE MAPS*. Yes, you can download Maps offline and use them without an active Internet connection. This is a huge benefit if you are travelling abroad or on data roaming and will save you a lot of money. The Maps application is very basic and the Drive application is sometimes glitchy. It has trouble finding my exact location when I turn it on while I am driving. But once it found your location, it works very well. Also, the Turn-by-Turn instructions are kinda , hmm.. weird since it doesn't tell you the street names/road numbers. It only gives instructions like \"Make Left here, Make Right here, Drive for a mile on this road\". Which won't be such a problem on regular roads, but sometimes on the freeways it might be a little more helpful if it spells out the names. Another cool thing is, it has various accents & languages. I  have the European English accent and it feels like Mrs. Doubtfire is giving me instructions ;)Browser:The Web Browser on the N9 is WebKit based and it has many HTML5 & CSS features. It can also share the Geolocation. Although when I try to open Google, it gives me the dumbphone version instead of the smartphone version. But on other sites, the Web browser worked pretty good and like I said, you can subscribe directly to the RSS feeds in the page, right from the browser. The browser plays H264 videos from Youtube without any issues, but I had some hiccups on other sites like Engadget,The Verge etc.,  Nokia is aware of these issues and promised to fix them in the next software update. It doesn't have Flash, which isn't an issue for me at all. I wish the browser is bit better, like Mobile Safari. Still, Android has the worst browsing experience and the N9 browser feels much better than that. (Weird, Google has the best Desktop Browser, but the worst mobile browser).Other Features:It has a lot of other useful utilities like Google Talk support, AIM, Wi-Fi sharing, NFC capabilities, Bluetooth etc., For the Geekier ones, it supports SIP protocol right out of the box, so there are many VoIP possibilites, not to mention Skype support which serves most of my needs. But, I still feel like it would be better if Google Voice is supported. Google Voice is one of the best feature of my Android phone. But then again, this is from Europe and they don't have Google Voice there. There is a QGV Dialer from the store which is fairly minimal and basic in functionality.Camera/Video/Music:It has a great 8MP Camera with Carl-Zeiss lens. It takes beautiful pictures although the N8 has much better camera. Most importantly, the camera in N9 is really fast. Much faster than any other smartphone I've seen so far. The Music app is beautiful and it plays all the popular music formats. There is also a Spotify app in the Nokia Store, which is always great for music.  There is an Ovi Music Store, which doesn't work in the states, due to licensing issues, but I always get my music from Amazon anyways. Transferring files is real easy, just drag and drop in the computer.OS/Platform/Apps:Now, this is where the sad news begins. N9 runs Meego 1.2 Harmattan, which is not MeeGo, but its actually Maemo Harmattan 1.2 with MeeGo API's on top of it. But, unfortunately Nokia has abandoned this platform or in their words relegated to an experimental status instead of mainstream focus infavor of Windows Phone 7.5. Now, I won't get into the speculation if its a bad/good idea, but as a result of that decision, it is unlikely that Nokia will make future phones with this Operating System. That means little interest among Developers to create apps for the platform. *BUT*, there are some really good apps in the Nokia Store. They have Spotify, Sports Tracker and many other Utility apps which are enough for my needs. They also have Angry Birds out of the box. But I mostly use my phone for Web/Email/VoIP/SMS and a few games, so it's not necessarily a big issue for me. But the apps are gradually increasing in the store, which is good.*THE GOOD NEWS*Nokia has promised to support N9 for atleast 2015 with various Software updates. Even my HTC Nexus One, just 1 1/2 years is no longer supported by Google (I mean new os versions). They have already announced an update scheduled to roll out before end of 2011, which gives many performance boosts and new features, along with system wide copy/paste and Swype (not 'Swipe') keyboard.Final Thoughts:Nokia N9 is one of those devices, that are brilliant but unfortunately they don't ever go mainstream. Its more like a limited edition sports car with great power and capabilities. The performance is pretty good, although not as smooth as an iPhone. Now, thats a deal breaker for me, since I hate sluggish UIs (Android has the most sluggish UI and the ugliest one). But this phone overthrows all of that with its very intuitive and useful Swipe features. (Especially, Swipe down to close an app) and it has a clean and beautiful UI. The phone feels right in my hand and the overall experience is very new and refreshing. I'm glad I bought this phone. This might not be for everyone, but its really one of its own kind. Its not perfect, not even close, but somehow it stands out on its own. Its a shame that Nokia doesn't want to make it their flagship product.Nokia Windows Phones:Nokia recently announced the Lumia 800 which looks exactly like the N9 but has different specs and runs Win Phone OS. I actually considered buying that and return this phone since it will be supported widely and will have a better ecosystem. So quickly went down to a phone shop and tested out a Windows phone. Although the Nokia experience might better than some Samsung phone they had, but it still gives me a good idea. Overall, I liked the Windows Phone 7.5 and its very smooth. *BUT*, it was missing one feature. One *GREAT* feature. That is, the Swipe. I found myself constantly trying to Swipe down, up & left to close and switch apps. Although Win Phone 7 has swiping gestures, I still like N9's swipe.Conclusion:If you like to have a remarkably great product and not worry about things like app ecosystem, etc., I highly recommend this phone. But if you are worried that it doesn't have enough apps/games wait for the next wave of Nokia Windows phones (The Lumia 800 isn't released in the US) in early 2012 with a similar or better form factors. But, you definitely won't have the same Swiping experience. N9 is all about the Swipe.", "Date": "November 5, 2011"}, {"Title": "The most beautifully designed, perfectly constructed smart phone ever.", "Author": "JordonB", "ReviewID": "R38CX66QY4ZBOP", "Overall": "5.0", "Content": "This phone is something special...extraordinary, even. I've owned or seen many wonderfully designed products (Apple's included) but the N9 exists on a whole different plane of beauty and elegance. I didn't buy it for the functionality (apps are everything for smartphones, and only Apple's iOS or Android win here), I bought it for its design.Unlike every other phone on the market (save Nokia's own Lumia phones), this thing exists and feels as one piece. It is carved out of a single polycarbonate (plastic) block, and the entire front face of the phone is the screen, covered by a sheet of Corning Gorilla glass that curves down slightly towards the edges, so that it sits flush with the phone's body. There's not a single hard edge anywhere, no small crevices, no screws. Nothing else out there feels as exquisite in the hand!And the screen is the second most important thing. Yes, it's not as dense pixel-wise as Apple's iPhone 4 (300 pixels per inch). But it comes quite close, at 256 ppi, which is still far higher than any television or computer screen out there. And the color and contrast! If you've ever looked at some of Samsung's high-end Android phones or tablets, you've seen the amazing color vibrancy and punch of their screens. Well this phone uses the same technology, and the colors pop, and the black is truly black. It is stunning, and I prefer it over the screens that Apple uses.Third, the OS. It's every bit as intuitive as Apple's, and I believe it improves upon it in many ways. There's only one gesture you really have to learn besides tapping, and that's swiping. There's no physical or virtual home button, and no little tray of icons at the bottom of the screen. It's just a grid of colorful icons that you scroll through vertically. To find or change to any apps you currently have open, you simply swipe to the right, and you see them all in card view. To get back, just swipe to the left. Nokia has their own font they've designed, and I like it better than any other font I've seen designed for the screen.Another crucial factor with smartphones is battery life. I don't use my N9 real intensely (like listening to a lot of music, or watching movies) and I'd say I average a little more than a day's worth of use per full charge. I use mine on AT&T;'s network and I've had no problems whatsoever. Gmail works great with the mail app. Browsing the web is a smooth, pleasant experience. I've put my own pictures, music, and documents on it from my iBook G4 over USB, without any extra software. It takes good pictures, but struggles in low-light. The keyboard is also an important factor, and this one is great. I tend not to like typing on the small onscreen keyboards all smartphones have, but this one is bearable, almost enjoyable. With the recent Meego update, a Swipe keyboard is also included. There are social apps included (Facebook, Twitter) but I don't really use them (though, from the once I've used it, the Facebook app is quite attractive.)For those like myself, who truly appreciate superb design, flawless execution, and impeccable build quality, the Nokia N9 will surpass your expectations!", "Date": "November 28, 2011"}, {"Title": "A Masterpiece", "Author": "Emeka Awobokun", "ReviewID": "R36KYE3C838PXW", "Overall": "5.0", "Content": "I went out a bought one, notwithstanding all the recommendations not too. This has got to be the most beautiful phone I've ever seen. It is a masterpiece of engineering, and I am totally in love. I needed a third phone...in addition to my iPhone  for personal use and a blackberry for official use.  I tried and don't really like android phones...too complicated for me and too much bloat ware.  In the end I decided to try the N9 knowing fully well that it would be the last of the line.  I have no regrets, as this phone is a pleasure to be with.  I only hope that Nokia will sustain the firmware updates.", "Date": "November 24, 2011"}, {"Title": "Best phone I've ever had except lack of apps and no flash", "Author": "Aaron Baker \"Aaron B\"", "ReviewID": "R3JPBCEV2QMPEZ", "Overall": "4.0", "Content": "This phone is very nice looking. The curved screen, the gorilla glass, the way the icons look on the screen, the way you can slide games or videos a little bit to the side to see the status bar (time, battery, etc.) and not interrupt what you are doing (video will still play and game will keep going). You need the case because the phone is too slippery without the case.This phone really is great. The swipe interface is very nice and will have you addicted and you will be swiping other smartphones you pick up on accident and now the SWYPE keyboard is implemented. Changing between keyboard languages is simple just swipe keyboard from side of screen. There is the \"from edge of screen swipe\" and \"inside of screen swipe,\" those are 2 different things.Anyways I have the 64gb version from Denmark and I have updated to pr1.1 . The pr 1.2 fixes and enhancements are coming in daily I know because I am watching the devs do them.The market is really a lot better on this phone than I have experienced on past Nokia phones and rivals the android market. I was just talking to my girlfriend in the Philippines yesterday using skype on my N9 while I was taking snapshots of the stores I was walking in front of while she was watching where I was walking on google maps asking me to take pictures.I am very pleased with this phone. But here are my wishes for improvements:1) More apps and games especially more interactive games. I will be patient and just wait for these. I know it's very early for a new phone but I can see the new apps coming.2) I do not like its night time picture taking quality at all but daytime and well lighted areas it has no problem and I am pleased.3) I would like to see more third party colored soft cases. I bought a rainbow of colored cases off of ebay and they were all cheap Chinese but they were surprisingly steadfastly hanging on to the phone - they wont slide off.4) There is no flash in the browserSo all those sites that use flash you can't see that content. Otherwise the browser is fine.This phone is just early. It has some kinks to work out but it came out the gate really swinging. I can't wait to see all the improvements coming in pr 1.2I hope Nokia drops windows phone and stays with this Meego and Harmattan OS but CEO Elop is a little pudgy trojan horse from Microsoft sent because his MS mommy is oh so scared of Android. Just look at the MOSAID agreement between Nokia and MS. It lets MS patent troll any company making a device using Android.", "Date": "November 29, 2011"}, {"Title": "A Delight To See & A Joy To Use", "Author": "projekt", "ReviewID": "R2EHKHYVT8B2S", "Overall": "5.0", "Content": "Having owned and used an iPhone 3G for the past 3 years, I thought it was time for an upgrade. With fierce competition in the market from many manufacturers eyeing the throne for \"Smart Phone\" king with their splendid products, it was not going to be an easy task. I had settled for three contenders that I had thought were worthy of consideration. They were: Apple's iPhone 4S, Samsung's Galaxy S2 and Nokia's N9.Having owned an iPhone 3G, I didn't feel that iPhone 4S was considered an upgrade to my experience. Yes, there have been major advancement in the processor, the screen display is wonderful, the multitasking issue has been answered, and many features that you may know of. But, the experience and look, well to me, is still the same. And Apple's control over the OS mars the experience. It was until you performed the jailbreak that things started to get fun.The Samsung Galaxy S2, is a monster of a phone. It does everything apart from shaving your beard. Yet, there was always this doubt when deciding to go and purchase it. The Android UI, in my opinion is clunky. It's not very well layered as the iOS. Then the issue of future upgrades. With Apple you're in the loop, as for Android, you are compelled to purchase a new phone or read the numerous forums on how to install the upgrades manually, which is a task.However, with the Nokia N9, I was taken aback with its beautiful & simple design. There are no buttons apart from the lock & volume rocker on it's side. A cover is included in the box, to shield and protect the N9 from the bumps & blemishes. And it does not hinder the design nor obstruct the beautiful swipe gesture. The quality of the phone is great. You may at first be intrigued by the small button at the top of the phone that secures the sim card compartment and how to get it to open. It was frustrating at first. I even thought you are required to be double jointed to get the thing to open. But once you understand the design it all makes sense.The MeeGo OS is a wonder in itself. It is a well layered interface and the response is very fluid, despite the Nokia N9 not graced with a dual core processor. Yet the ingenuity of a swipe is so natural and so seamless that you're left to wonder of the simplicity of the gesture. The UI and the phone go hand in glove. To activate the phone you either press the on/off button on the side or simply tap the lock screen twice and swipe (either from left to right, right to left, top to bottom or bottom to top) you're presented with 3 home screens:' App Screen: Screen that lists all the apps' Open App Screen: Displays all the open apps' Notification Pane: All your missed calls, SMS text messages, emails calendar, feeds, Skype, Facebook, Twitter & notifications are displayed here in an organized manner.The N9 is very versatile and efficient. The battery under PSM (Power Save Mode) should last you 3 full days of regular use (making calls, sending text, emails & etc...). I had many contacts on my previous iPhone 3G, all I had to do was Bluetooth my entire contact list to the N9. That only took about 20 seconds. The Bluetooth feature was something very useful that I had sorely missed on the iPhone.The camera is wonderful, with a plethora of options that may render your compact camera useless. There is a front facing camera, but this hasn't been brought to use yet. However, there shall be an update soon to address this matter.Nokia have stated that they will stand by the Nokia N9 with updates and support till 2015. Since it's release last summer, there have been 2 updates so far with as stated above, one update promised for release by the end of the month to make the N9 experience all the more mesmerizing.Yes, there may be a lack of apps when compared to iTunes & the Android market, but the Ovi Store inventory is increasing week by week. And the N9 comes with Angry Birds, NFS Shift, RF 2011, GOF2, Facebook, Twitter & Skype dedicated apps.The Nokia N9 is a delight to see and definitely a joy to use. It should be considered if you are going to purchase a smartphone soon.", "Date": "February 19, 2012"}, {"Title": "A great phone for a greater price. Experience of moving from Galaxy s2 to N9", "Author": "Gowrishankar V", "ReviewID": "R1186U4SUY33A5", "Overall": "4.0", "Content": "I got this phone on 18th January 2012. It looked amazing right out of the box and it has been a great experience owning this phone so far. That is not to say there are no niggling issues with this phone. However, I am willing to overlook those minor irritants for the sake of a great unlocked pentaband 3g phone. I used to have iphone 3g back in the day and then went to galaxy s2 last september. After doing the ritualistic rooting and unlocking, I gave the galaxy s2 to my wife and was using a spare nokia 5230 until now. And then I moved on to n9.I would say the move from Galaxy s2 to N9 was not really troublesome. I do miss the sheer speed of the galaxy s2. However after I got used to the speed of N9, the experience has been great. I am a great fan of simplistic designs and N9 with 3 home screens with no buttons and Swipe gestures fits right in. It is fun to know that the swipe is not just for the 3 home screens but it also drills down to apps like email, music, gallery, etc.For the techies who used to make modifications with android,  you would feel right at home with N9 as well. It is very open and within no time you could install the developer tools and get going with your unix/linux skills.On the downside, I don't get 4g speeds like 5 mb down. However I don't feel it is too slow either with average download speeds of 2 mb. I am able to download huge files, tether with wifi hotspot feature and the phone doesn't get hot and slow down. The multi tasking functionality is really good. But I do hope the data speed and the momentary UI lag could be improved.Here are some of the apps to get started and having fun.1) N9 Tweak - ([...])2) Firefox fennec ([...])3) Air UI4) Netview5) Sketchit!Here is a quick summary.Pros:1) Unlocked2) Pentaband 3G - you could get 3G with AT&T;, T-Mobile and so many other GSM providers3) Swipe UI4) The apps are less, but they are good.5) Easy to customize with open shell accessCons:1) The Slower while comparing to flagship products from competitors like samsung, apple, etc.2) Single core3) Probably the last meego device4) The speed only supports 3G and not 4G or LTE5) Relatively higher price of $500-$600 for the 16gb phone", "Date": "January 24, 2012"}, {"Title": "Once you Swipe you will never go back!", "Author": "David J. Gillespie \"Jer006\"", "ReviewID": "R1K3IK2NHM5U0T", "Overall": "5.0", "Content": "Absolutely beautiful phone with an amazing OS.  The swipe to multitask and swipe to close is so natural that you will find yourself trying to do it on other OS's (iOS and Android) and becoming frustrated as its not as smooth and you have to press buttons...Overall the OS is buttery smooth and the visuals are beautiful.Pros:* Beautiful device* 1GB of RAM* OS is Fast - has been optimized and it shows from the speed of using the device* Swiping from a movie playing is a total wow moment* OS is beautiful and a joy to use, integrated accounts are awesome* Swiping feels natural for Multitasking and closing applications* Battery is great (at least 1 full day on a charge depending on usage)* Screen looks amazing, colours and brightness are great.  I keep mine on the lowest brightness setting and I have no problem viewing it at all* Skype is crystal clear* Limited application selection but not bad* Meego open source linux OS* Drive and Maps are free and do a good job (not quite as fully featured as I would have liked but good)* PR1.1 update brings a ton of nice features (swype keyboard, performance enhancements and bug fixes)* Camera is very good and very fast to startup, focus and take pictures!* Comes with an included silicon case which is nice* Low Power mode showing clock and notifications is awesome (simple but most other devices do not have this)Cons* No US Warranty so be sure to get one from a 3rd party* Limited application selection if you are expecting android/ios type selection* Possible first and only meego device though nokia have committed to supporting it through 2015Make sure you get a screen protector for this one though it appears to be easily scratched even though its gorilla glass.UPDATE: New Firmware PR1.2 has been released 2 months ago now and things are much better!To Name a few improvements:1) Swype keyboard has been improved2) Camera Improvements3) Folders in the menus4) More Apps on the store now, still a lot missing but its not quite as bare anymore - some great applications out there like QNeptunea for Twitter, good community of app builders5) Drive and Maps have been improved and as always the maps are free which is awesome+ lots moreI've owned the N9 now for a little over 6 months and I still love the swiping experience, I have tried the lumia 900 and I would take the N9 anyday!  It fits in the hand better as its smaller but at 3.9\" its not too small, the curved glass feels better (900 has hard edges), swiping feels natural and the OS is beautiful no big square chunky blocks on the screen...  PR1.3 is expected within the next month or two (never can tell with Nokia though!)I highly recommend this device!", "Date": "November 21, 2011"}, {"Title": "great design/OS", "Author": "B. Cunningham", "ReviewID": "R3UYKXZPOLKQ89", "Overall": "5.0", "Content": "I will keep this short as there are a lot of good reviews here.  The main reasons to buy this phone is for its fantastic OS and Swype navigation, coupled with its very handsome design.  The main drawbacks you will have to live with relative to the Samsung Galaxy S2 is the current and quite likely future lack of availability of WhatsApp, and an inferior camera.  The camera is fine for snaps it is just not as excellent as in the Samsung.  Perhaps this is the cost of keeping the phone body sleek without the ugly bulge usually found about the camera lens.  Also, as other note, the included apps are very good (and there are a large number of free basic apps available for download), but if you are a real app freak then this phone would be a poor choice. You can install Firefox (fennec) which works excellent and is even a few seconds faster than the default browser.  If your browser use is modest the default browser is great.  One last point relative to the Samsung S2 is that the Nokia's form factor is a more pocketable but at the cost of having a noticeably smaller screen.  Overall for my tastes this is the nicest phone on the market now.Added note (12/17/2011):  Good news, eBuddy XMS which allows free messaging like WhatsApp, is now available for the N9 and functions very nicely!", "Date": "December 14, 2011"}, {"Title": "Superb superb phone", "Author": "DJ Patrick \"patrick78418\"", "ReviewID": "R3TJB4R24E1U96", "Overall": "5.0", "Content": "At last - Nokia gets a phone completely right, and of course this is (supposedly) the last Meego product to be produced.  Sad though it is, you can still get in on the act and enjoy one of the most elegant, easy to use, superb interfaces on any phone on the market.I only have a few (minor) gripes and they are as follows:i) you cannot (easily) change the font size, and it is small, particularly on the SMS/conversations where incoming texts are not very clearly contrasted in white letters on a blue background;ii) once you download a few apps, it would be useful to have them organized in folders otherwise it can take a while to search for the one you want;iii) the volume is quite limited on calls, particularly when using a bluetooth earpiece - I always have to have my cranked up to full volume and this is when pairing with one of the newest Nokia bluetooth devices; andiv) the night shots are not good - very grainy.  With daylight though they are excellent, and videos are superb.These comments may be moot considering there is a firmware update on the way which I believe will take care of both i) and ii).Bottom line - if you want a unique phone that looks sleek, is extremely functional and you can use with one hand if you like, this is definitely the phone for you.", "Date": "January 27, 2012"}, {"Title": "Worth it...", "Author": "Ravo", "ReviewID": "R20C10E9GSDC1D", "Overall": "5.0", "Content": "I am not a geek of phones, but I have been trying bunch of smartphones to give this review.I think this phone is a good collectors item.It'll be one of it's kind (unless Intel/Nokia feel something else which they should)...The more I use this phone, the more possibilities of this phone being a top seller...I'll just use the normal method of review and highlight PROS & CONS...PROS:1) Amazing Hardware.2) True Multitasking ( Big thumbs up for a OS which which is only 1 update old). Which I think apple and windows yet haven't been able to do.3) Really responsive & fast. I have ran a total of 18 apps simultaneously and it was working smoothly.4) Geeky. =)5) Frankly, i can keep on going about Camera and stuff, but you can read other reviews or youtube for it. :)CONS:1) The OS has some bugs. Like sysuid error that crashes the OS. It happens only when i use bluetooth headset.2) I yet haven't been able to identify how to get playlist on this, but I am working on it.3) I hope this isn't an eye opener, but not that many apps. (Frankly I have heard android apps can be run on this using some 3rd party s/w.).4) My apple headphones don't work with this phone and the one that comes in box aren't quite cool to use.Summarizing:  If you are going to purchase this phone with appstores of apple/android/windows in mind, \"Stay away from it\".  But if you really want a SMART phone, which works intelligently don't think twice.", "Date": "January 14, 2012"}, {"Title": "Might be what you've been looking for...", "Author": "Bangarang", "ReviewID": "R2K9AVYV3I4ZL4", "Overall": "5.0", "Content": "I have had this phone for several days now and have had a chance to really discover what it is all about. This phone is perfect for you if you like to use a phone as it should be used--meaning--you like to efficiently be able to call, text, email, and browse the web. This phone does these things better than anything on the market. You can navigate through the functions very quickly and effectively with the swipe gestures.Things I really enjoy:-The lock screen displays the time and any missed calls, messages, emails, etc. while still remaining locked and in screen saver mode.-It has a battery saver mode that really saves battery life by disabling the 3.5G when it isn't being used.-You can quickly unlock the lock screen by simply double tapping the screen-My wireless carrier doesn't recognize this phone as a smartphone on their network, so I can get an unlimited data plan with it for $15/month. (Not sure how long I'll be able to do this as this same plan is $45/month with an iphone)-With the latest update, it displays music controls on the lock screen, enables the \"Swype\" texting system (really sweet) and closes programs with a downward swipe motion among other things.-You can use the USB drive as a jump drive and drag and drop files with your computer using the phone's storage-Mine came with a nice slimline rubberized case that isn't bulky and fits in the pocket nicely-Sound quality and build construction are very good, the seamless curved glass design is a real eye catcher-The phone is about the right size and fits in my hand well. It isn't huge like some of these 4.3\" phones (too big for my liking)Things that could be better:-The text screen is kind of small and might be hard to read for those that have poor eyesight-Not too many apps (I knew this when I bought it, but don't use many apps anyway)-The camera isn't the best on a smartphone, but has the potential to be better with updates perhaps-Front facing camera is currently not supported for video calling, but may be in the future-No folder system for apps yet-Navigation system is ok, but could use some improvementAll in all, I am happy with my purchase and think other customers will be too if they use a phone for the above main functions.", "Date": "January 16, 2012"}, {"Title": "It is a Nokia and pretty good.", "Author": "Sandeep \"sks\"", "ReviewID": "RD4XU7QFJLK3J", "Overall": "5.0", "Content": "I wanted it badly so I purchased on Amazon. I cannot buy it anywhere else :(. It is the first Poly carbonate bodied phone. Good audio quality, Excellent \"Swipe\" UI. I got so used to the UI that whenever I pick up any other phone I automatically swipe to go from screen to screen :). The unified notification screen where I get all my RSS feeds, missed calls, texts, Facebook etc.. is excellent!!. Now the hardware, excellent display, superb contrast, NFC, very rugged, I already dropped it a couple of times not a scratch!Excellent Camera, some the pictures and videos I have taken seems like they have been taken on a compact camera.Not many apps on the Nokia store, but whatever is on the phone is more than enough. Some of the other drawbacks are no apps like Skype etc to utilize the front facing camera. It came bundled with some games though. There are bugs but the most annoying one is that it never remembers my passwords for email accounts and prompts every time I power on the phone, many bug fixes are in the software update that is due this month", "Date": "February 14, 2012"}, {"Title": "A true multitasker of a phone!", "Author": "Silver", "ReviewID": "R11A138H52E9NY", "Overall": "5.0", "Content": "Yes, it may be lacking a few things here and there but with PR 1.1 update plus useful apps already built-in and more coming, it is an absolute delight for what it is, a niche device that could truly blow your mind if you will give it a chance. I tested just how great N9 is with multitasking and opened really heavy apps just to see if there will be slowdowns and I was surprised that it didn't what with 16 already open, amongst them are nokia drive, maps, NFS shift, Angry Birds, ReaGolf 2011, GOF2, facebook, twitter, skype, and websites. Played NFS Shift while all of these are running in the background and it worked just fine. Truly unbelievable! Now if only Nokia did not kill this baby, shame on them. But thanks for the updates and keep em coming esp. PR 1.2!", "Date": "January 15, 2012"}, {"Title": "Very good phone but with several caveats:", "Author": "Z. Knezevic", "ReviewID": "RBSZCLAKMYU4H", "Overall": "4.0", "Content": "Handset is very well designed but it has several shortcomings built into design. I would highlight, overall design, maps (Nokia owns NAVTEQ), it is real penta-band data phone. What came as surprise (unpleasant) is that front facing camera is not really integrated by OS at all. Skype is only audio not video either WIFI or 3G. Also there are issues with setting this phone as hot spot in US.PROS:Works on T-Mobile and ATT for voice and data (3G/3.5G).Skype (audio only) works on 3G/3.5G.Excellent GPS, turn by turn with option to preload the maps and work without connecting to provider (e.g. ATT /T-Mobile)Solid rear camera.\"Video out\" outputs any content on the screen (e.g. work space, not only video). HDMI out would be perfect.CONS:Skype integration does not support front facing camera.Tethering does not work.No official (documented) support for desktop synchronization for contacts (e.g. with Outlook).No support for flash in default browser.No option for storage expansion.Update:Tethering: Solution from [...] worked in resolving the issue. The solution needs to be applied every time after device is rebooted.Update:Outlook desktop synchronization as in comment below.", "Date": "January 7, 2012"}, {"Title": "This phone rocks", "Author": "Joe", "ReviewID": "R1EYNRCV9X5BTO", "Overall": "4.0", "Content": "It is a Nokia...This phone almost has it all:* Beautifully designed hardware, the curved screen, and the rear-facing camera sets this phone apart from the crowd.* A buttery smooth operating system, the MeeGo OS is visually more pleasing than Android ICS, and almost as smooth as apples' IOS. But honestly speaking, the 'swipe type interface' on the N9 would make either of its competition jealous.* Descent battery life for a smart phone, hey its does not last for days like my old Nokia 6682, but I guess that comes with the 'smartphone territory'.* Descent application market, the app market is not as big as the Android or Apple App Store, but it's growing, especially with good user created content.But be warned of the following;* It does not have the 'Whatsapp' application as yet, which sucks.* Skype can only make voice calls at the moment.", "Date": "April 21, 2012"}, {"Title": "Upgrade from N900 point of view", "Author": "Vassilios Papadopoulos", "ReviewID": "R1WAR90ZYS7OFJ", "Overall": "5.0", "Content": "I had a nokia n900 and was hesitant changing it. I still wouldn't have gone with another phone but it was cutting out when I was getting calls and in general it was on its way out. I had gotten SO much use out of that phone! If it was a car it was like it had done the equivalent of 600k miles.I considered getting another n900 since I was convinced that there is no phone out there with what the n900 offered me, more important being impeccable skype integration, fm transmitter, slide out keyboard, replaceable battery and an infinitely customizable interface and access to every setting you can imagine.I was eyeballing the N9 and had read up all about it and when the hardware on my dying n900 made me miss another call, I decided to get the N9.I was amazed by the sleek, beautiful design but most of all by the interface. Smooth, and the transition from screen to screen, the logical layout of the content, it is like second nature, very intuitive.Regarding the keyboard, I was convinced pecking on a screen was inherently many steps back than using an actual keyboard. And it is. What saves it is the SWYPE method of entry. I can say I am hooked! My wife has an iphone and is envious of both the design and the interface. This is a HUGE stress point for me that was completely put to bed with the swype.The app store has some AMAZING games! And they are FREE! Some are a buck or so, who cares. The quality of graphics and the experience is INSANE! The efficient use of the processor really shines while playing soccer, or golf or need for speed type games. ABSOLUTELY FLAWLESS! And I am not a gamer, I am a late 30s professional that uses the phone for email, internet, camera, navigation and so on.At first I thought it was because the phone I was upgrading from, the n900 just had an inferior quality games and the 600mhz processor was getting a bit slow, but my friend with one of a 3 month old 4.7\" super duper Android OS phone was impressed...Having said that, the non removable battery is still a compromise I have to live with (I was removing and popping a new battery mid day on my n900), and so is the lack of fm transmitter.I can live with it though. Other reviewers have listed other key features in great extent so I will not go into that.I just wanted to offer my angle on this phone and I am absolutely loving it.Thanks for reading!", "Date": "April 12, 2012"}, {"Title": "Very intuitive and clean, Nokia never disappointed me", "Author": "Dante", "ReviewID": "R2WCI9EYFEJRKX", "Overall": "5.0", "Content": "This is a VERY GOOD cell phone, I never had problems with Nokia at all (although I'm a bit worried about Windows Phone).I could buy an iPhone 4S or any Android something, but the fact is, both companies (Apple and Google) are not much privacy friendly (just read the news), despite not doing anything wrong, I don't like being tracked, \"giving\" all my info to them do whatever they want to.I always heard good things about the MeeGo and I can say it now, it's a very good OS, clean, intuitive and eficient, as the N9 itself, there's no other buttons than the volume (up and down) and the power (right below the two mentioned earlier). The AMOLED screen have a beautiful resolution.I'm in love with this phone and definitely recommend it.", "Date": "March 28, 2012"}, {"Title": "THE ultimate smartphone", "Author": "Marco", "ReviewID": "R3KK37M4GKABPG", "Overall": "5.0", "Content": "I've been roaming around shops for a while in search for an adequate smartphone.Even though it's impossible to spot an n9 here in California, I had a chance to play for a while with one in Europe, where it's sold at more than 450 British Pounds.I could thus compare N9 and iPhone 4s, Lumia 800, Galaxy Nexus S and the new Razr. Not considering the Lumia, fairly below the par in almost evereything but the chassis, any of them had good quality in some areas like graphics smoothness or richness of details, camera, media, number of built-in features, browser, battery duration and device appeal. The N9 puts almost all of them together plus some interesting features like text insertion with swiping or dolby surround with stereo headphones (it really rocks!).One missing feature, to be completely fair, is the lack of apps in the store, bit imo it's more a fault of Nokia, who dismissed the OS, than of the device itself.Even considering that, all in all I'm giving the n9 five stars just because it's not possible to assign greater values.", "Date": "February 4, 2012"}, {"Title": "Kenny", "Author": "Amazon Customer \"Kenny\"", "ReviewID": "R157N2RUC46SES", "Overall": "4.0", "Content": "I bought this Nokia N9 for my wife and she loved it at the first sight. The body, screen swipes, and call quality are a lot better than Iphone 4S. I like all the features of Meego even it lacks of applications but I don't use many useless apps on Iphone. N9 has all the apps I need such as Quick Office, Facebook, Maps, etc.My sister has Iphone 4S and I had a chance to play around with it for couples hours, which I got bored and lost interests of Apple. They are for normal users or teenagers since everybody has Iphone now. Then I have a chance to buy a Nokia N9 made in Finland. You can tell the differences between made in China and made in Finland in the phone itself. When putting Iphone 4S next to Nokia N9, you can feel the IP 4S looks cheap with its plastic case. Buy N9 if you can afford it.", "Date": "December 30, 2011"}, {"Title": "classy, unique, intuitive...beautiful", "Author": "ALS", "ReviewID": "R1PDR5C9N3SJ58", "Overall": "5.0", "Content": "YOU FALL IN LOVE FROM THE FIRST DAY!!!Just got the phone. looks gorgeous, works flawlessley. It doesn't have thousands of apps but you know what, it has good apps, not silly ones.i would recommend it to anyone.", "Date": "December 2, 2011"}, {"Title": "N9 baby!!!!", "Author": "Bamba", "ReviewID": "R3GR6MISBEERPB", "Overall": "5.0", "Content": "This phone is still better than 95% of the phones on the market today. Even though, if you notice, the amount of unlocked phone choices have dropped by about 50%. Swipe is intuitive and I can't imagine not having it.", "Date": "December 29, 2013"}, {"Title": "For Those Who Want Something Different", "Author": "beelzebub", "ReviewID": "RPT80GVDO5V4S", "Overall": "5.0", "Content": "Had this phone for 2 months and so far am mostly pleased.  If you are looking for something other than Apple or Android, you should definitely consider this one-of-a-kind Meego phone (if Symbian or BlackBerry is not your cup of tea).  This is the original polycarbonate phone that all of the Lumias have followed.Pros:* Great build quality (typical for Nokia), even the glass has nice jewel-type raised look about it* The OS is very responsive with exception of Twitter (see Cons).* Screen resolution is decent & the Clear Black Display makes everything look sharp, especially if you set the color to Vivid.* Battery life is excellent - I can go at least 4 hours with only losing ~10%* It comes with a matching color case that is more like a cover - very thin so it will protect from scratches but probably will not do much for drops.* The swipe UI is easy to use and the events home screen is very handy to keep you updated* Like Symbian, AT&T; does not detect this as a smartphone & will not force you into a data plan* The Meego team is now Jolla & their new Sailfish OS can be installed on the N9 - so it could be like having a new phone* Developer Mode lets you code/hack the OS for those who want to* Swype app is pre-installed* FireFox & Flash apps availableCons:* The big one is that this is a 1-time OS so there is lack of support/apps.  Nokia said they would support till 2016 but that seems suspect since they will not allow any apps to be added/updated after 2013.  Again, you can install the new Jolla SailFish OS and that could alleviate this issue (Android apps are supposed to work)* The screen is a tad too sensitive.  I am constantly accidentally opening apps when trying to scroll* Volume is a bit on the weak side, especially the speakerphone* Syncing to Outlook does not work with the latest version of Nokia Suite so had to install an older version* Cannot turn off camera shutter sound; had to enter developer mode to manually delete the files* No dedicated camera button* Buttons are on the small (flat) side making them a little hard to press; also a little too close together making it easier to hit the wrong button* Twitter app gets painfully slow; can download Tweetian for free tho, which is much faster. You can also clear the cache on a regular basis thru the terminal with: rm /home/user/.cache/data/twitter/twcache** Not a very customizable OS/UI with personalization options like Android/Sybmbian; music player does not have any options/equalizer* Micro-SIM card so you may have to cut yours down or get a new one* No SD card slot* Have 3 emails running; occasionally 1 of them will stop automatically syncing but a reboot (which takes about a minute) of the phone fixes itOverall, I am satisfied with the phone.  It stays connected to wifi & updates my email & social media as needed.  If you can live with no updates or latest games, you should definitely consider this phone.  Too bad Nokia abandoned Meego for Windows but hopefully Jolla can improve upon it.", "Date": "December 18, 2013"}, {"Title": "Excelent", "Author": "Casandra Camacho", "ReviewID": "R3LCH2CW2BCR8S", "Overall": "5.0", "Content": "• What other customers should know when considering this issue?excellent mobile• What aspects of this topic you like or do not like?`It's super fast and comfortable handling, without having to open everything, because you can see from the main screen• How do you use this item?fully digitalSimilar articles • What have you used?The Nokia C6 and Iphone 4• Is the quality of this product above or below your expectations?The quality exceeded my expectations", "Date": "May 16, 2013"}, {"Title": "Love this phone", "Author": "Emma", "ReviewID": "R26PY27EN3Y1BW", "Overall": "5.0", "Content": "I love this phone!!! I had it for a year now and its been great. It does everything that I need and I love the camera on the back. Great quality. The only bad part is that the operating system is meego and its much harder to find software for it.", "Date": "March 21, 2013"}, {"Title": "Excelente telefono!!", "Author": "Daniel Franco", "ReviewID": "R2VLXHZM1LVBTK", "Overall": "5.0", "Content": "Lastima que nokia no ha lanzado este telefono con otro sistema operativo., En lo personal es un excelente teléfono para lo limitado que puede llegar ha ser Meego. sin embargo es un teléfono que se las juega todas con cualquier otro smartphone", "Date": "February 6, 2013"}, {"Title": "Love, love, love!", "Author": "Victoria Rodriguez", "ReviewID": "R324PYMZW091S3", "Overall": "5.0", "Content": "It is an amazing device with even greater specs. Well made, great OS just an overall great phone. It's ashamed that Nokia gave up on it because it truly is am outstanding device. Loved it so much that I upgraded to the 64G one.", "Date": "December 4, 2012"}, {"Title": "Perfect", "Author": "JR Wray", "ReviewID": "R2OFXXVIR7VHL0", "Overall": "5.0", "Content": "Its just what I need in a phone! Great cellular service that is far superior to my iPhone and an easy to use interface. Sure we don't have a lot of apps, but the key ones are there for social networking and navigation. Thank you Nokia!", "Date": "May 26, 2012"}, {"Title": "A true Finnish Giant! Phenomenal & Unique mobile device unlike no other !", "Author": "Giulio \"euro\"", "ReviewID": "R2JZPS0BBYL804", "Overall": "4.0", "Content": "Received this mobile device in brand new condition and with all the accessories. The design is great and it feels very nice. The glass really shows the high quality of this mobile phone. It is very easy to get used to swiping in all four directions. The OS runs smooth for almost the whole time. There aren't that many famous brand apps and more third part apps which is kind of disappointing, but this phone is for being real and using it for the true needs in daily life. The GPS is absolutely phenomenal. It is very accurate and keeps up with the speed of vehicle. The camera, on the other hand, is technically a good \"Carl Zeis\" 8MP , but i will have to say that my Sony Ericsson Xperia Arc 8MP takes better photos and HD videos. I kinda knew that before purchasing the device, but i dont really worry 2 much bout the camera on this device. The MeeGo is a user friendly OS and is very easy to use. Although you do have to get the hang of finding certain things in the settings because they are sorted out a bit differently. This device is more for us Europeans due to being sold only in the EU, but privately being sold at small stores in the US. We Europeans like to have unique phones like this, where some people don't have a clue about it or where it came from. Wish more people would be into these types of devices. Anyway, the Nokia N9 is a fan favourite and definitely worth it. I hope I will enjoy this device for a long run, and that more people will purchase this, but hurry because there aren't too many of these lads hanging around. Cheers !", "Date": "May 23, 2012"}, {"Title": "N9 is iPhone killer", "Author": "jmtronx", "ReviewID": "RIWCPYIBETVZ9", "Overall": "5.0", "Content": "The N9 can now play Flash video, if you download the Firefox browser and the adobe flash plugin that is also available from the Nokia store on the phone ( theyre free!). This phone can also do tv-out with the cord thats a 3.5mm headphone jack on one end to the yellow red and white RCA cables at the other end. This phone has the built in wireless hotspot program, so you can share your cellular Internet with your laptop or iPad FOR FREE, this phone also has a torrent client so you can download and play the files from the phone. the ONLY things this phone doesn't have: removable sd card or battery, Netflix app, hbo go app, xfinity app, slingplayer app, or gps that tells you traffic. The GPS on here is phenomenal, by the way, the turn-by-turn directions are great. It talks to you and you can download various voice and language packs for free from Nokia. This phone is amazing, they should have made it two years ago! The camera is great as well, there's an awesome free program to do panorama photos. I use mine with tmobile, I enjoy watching tv on my iPad using the phone as a hotspot and I enjoy showing my mom episodes of breaking bad streamed directly on the phone and played onto our 50 inch tv directly from the phone! Amazing!", "Date": "May 14, 2012"}, {"Title": "great phone for work", "Author": "lub02", "ReviewID": "R2DA11UKULKME1", "Overall": "5.0", "Content": "It is a great phone to have for work.There is no need to repeat how elegant the design and UI it have, just some big facts:1. It has a very good camera with Carl Zeiss lens. (People using microscopes know this is a big deal.) With same pixels, Carl Zeiss lens produces much sharper images.2. Free built in maps for navigation. So you can travel outside of the city with no worry of dropping off your cellphone carriers signal.3. Great email and calendar support. You can synchronize calendars on google and exchange mail accounts.4. Great keyboard. Very accurate and support \"swype\" input and Asian language such as hand writing input.5. battery life is supposed to be good (lasted for several days according to some review). Haven't tested it extensively, but it will certainly go for more than a day if you do things properly (without watching movies etc.).Cons:There aren't that many games/apps but some basic ones are covered (facebook, tweeter, dropbox...).-----Updates after 3 months of usage:The battery of the phone normally needs to charge every 2 daysThe off-line mode Nokia Drive is way better than my Magellan GPSAfter the PR1.3 update, the software is even smoother and the camera white balance is much better", "Date": "April 14, 2012"}, {"Title": "it was good but not great", "Author": "nokiaguy", "ReviewID": "R59SXIC8ZI696", "Overall": "4.0", "Content": "firstly, the n9 is the coolest looking phone to date.  sleek and solid, a nokia masterpiece!  cool ui, a little dodgy to get it to sync with google, but do-able.  good camera, not great though.  a couple of downsides not previously mentioned.  1.  for some reason, the bluetooth turns off during phonecalls.  i contacted nokia and they are aware of this and rec a nokia headset ( i had this problem with the n-8 also).2.  the browser is definitely slower than my samsung galaxy s2, even in wifi mode.3.  the battery does not last the day with full use, i dont care what anyone says, if you use voice calls, check emails, surf, etc,  the battery will only last 7-9 hours before it needs charging.that being said, cool phone, great experience, but not practical for all-around use.", "Date": "April 10, 2012"}, {"Title": "Potential Not Quite Realized", "Author": "James R. Knight \"drjaymez\"", "ReviewID": "RES0C4A2QCVW3", "Overall": "3.0", "Content": "I bought a new Nokia N9 in January of this year for use on T-Mobile's network. I just switched to an iPhone 4S this week. At the time I was using a Google Nexus (Android). At the time, I didn't feel like Android or it's apps was polished enough for prime time. Prior to that I had used an iPhone 3G on T-Mobile's network for a while but grew tired of Edge data speeds and the slow iOS 4 upgrade killed that user experience for me. Prior to that I used a Blackberry Bold 9700.Pros:Excellent build quality (exception being the USB flip out plastic piece for charging)Good cameraNice OSFacebook/Twitter integrationSkype IntegrationGorilla GlassApps: Spotify youtube, Dropbox, FirefoxHotspot capability (with additional effort to disable restrictions in the US phones)Cons:Slow OSDidn't sync with my work exchange serverOnly acceptable battery life with moderate useMaps/Drive very slow, rarely found what I searched for.Poor app supportPoor app maturityTouch keyboardPlastic piece that pops out for charging broke after about 6 monthsAlmost nothing can charge itI don't know what implementation of micro USB power Nokia implemented for this thing. I only have a few chargers that will actually charge it, and the one that it came with is very bulky, requiring an adapter form european outlet style. I have yet to find a car charger that will work for it. Nokia does make chargers that will likely work, but don't assume that if you already have some micro USB power stuff for home and car that it will work.The plastic piece that flips open for charging will break eventually. For me this happened when I dropped it while it was open.Basically, I like the Meego User Interface. Swiping becomes intuitive very quickly. It isn't quite as responsive as it could be (slow processor, ?unoptimized OS)Not being able to get work email was a big downside for me. We have a very secure exchange server, and using a secure connection alone wasn't enough to connect, and checking \"Non-provisionable device\" did not get me access either, so I was out of luck there.The broswer is HTML5 compliant, but really only \"OK\" to use. Firefox is available and is an OK implementation as well.I used a 3rd party app called \"spoton\" to enable WiFi Hotspot on my device and then the WiFi Hotspot app works just fine. Kind of annoying that this is necessary in the states, but I guess it is an FCC thing. You can also do it in the Terminal, but that is cumbersome.I definitely needed to recharge over my lunch hour on a day I was using the phone a lot.I don't feel the touch keyboard is as accurate for me as the iPhone. I have no idea why. Man, I miss Swype from Android.The apps available are OK, but there just isn't the library or maturity that IOS has.Of all the phones I've used above, my favorite is probably the Blackberry, but I need a better web experience on  a modern phone, so I'm on the iPhone again at the moment, and hoping t-mobile  1900Mhz 3G comes to Columbus, OH soon.", "Date": "October 14, 2012"}, {"Title": "excellent team and in good condition", "Author": "RICHARD MURILLO", "ReviewID": "RU8WR933FU7CQ", "Overall": "4.0", "Content": "is a great team, I can enjoy a good price for a good team, you do not use shame noki meego operating system", "Date": "June 20, 2013"}, {"Title": "amazing phone", "Author": "Thiago", "ReviewID": "RP1VHS5LEP7LB", "Overall": "5.0", "Content": "well its a perfect cell phone, fit all my needs, have a lot of app to buy and download,its have a great size and weight... and the battery sometimes last for 3 days...works perfectly with my car sound, the hand-free and everything else... really nice audio...I know thats megoo is out but, with low price because it... it worth more than ever...so Nokia, i think u did a mistake choosing Windows phone...  this phone was ur best job soo far...", "Date": "April 5, 2012"}, {"Title": "collectible!", "Author": "Daniel Ackerman \"tuautem\"", "ReviewID": "RV7V54HS2ABN4", "Overall": "5.0", "Content": "Estoy seguro que este telefono pasara a ser un icono, un coleccionable, por todas sus caracteristicas. Formas que son un ejemplo del mas refinado diseño industrial. Un sistema operativo increiblemente bueno, que estoy seguro nokia mantendra de una manera u otra.No creo que una empresa historicamente autosuficiente y de ese porte acepte quedar a merced de un software  no propio. Swipe es una maravilla, la capacidad de multitasking es fantastica. La simpleza de manejo y la interconeccion entre todos los sectores del telefono hacen de la curva de aprendizaje un juego de niños. Recomiendo este telefono a cualquiera que mas alla de las modas quiera algo hermoso y operativo a la vez.", "Date": "January 5, 2012"}, {"Title": "Nokia N9", "Author": "Chand", "ReviewID": "RQS8XWW4BY56H", "Overall": "3.0", "Content": "This is my first ever review for anything, after looking at the phone I absolutely fell in love with it. I'm an avid user of electronics, I consider myself as a geek. I have used android phones, I have an iPad and I have seen windows phone in action. I really dont like the hype of iPhone. of all the phones till date I have really like the Android phones, Before android phones, i was a fan of Nokia products. OKPROS1. a very well designed hardware, no buttons on the screen. the only buttons you have are the volume rockr and the power button. This might be discomfort for some people but you just need to get used to it.2. this is an absolute stunner to the eyes. it feels real solid in your hand3. the screen is bright and good4. after the advent of the smart phones, if you get one full day with continuos usage, i would say it is pretty good.5. setting up is a breeze, you would need a nokia account.6. the swipe feature is really good7. this phone doesn't hang up because of the heavy usage, all the games that come with the phone work smoothlyCONS1. The only and very big disappointment is lack of apps, this phone is for looks and ease. if you are user of any kind of app its not there here.2. this phone is not yet released in the US so it comes with a European plug which is no good in the US.3. to update the OS you can either do it wireless or connect the computer and then do it. it is very easy said than doing it.4. one more disappointment is no micro sd slot, what you got is about 9.5 gb of space for music and videos.5. The email settings are not as easy as i thought, if you are used to android, apple or black berry products you would know what I'm talking. the email is not synced real time. like in android phones, you would get your gmail faster that before it shows on a browser.  it is slow.all in all like I said, the phone it self is a beauty, but lack of apps and small issues may not be appealing for many people.", "Date": "January 3, 2012"}, {"Title": "Nice but International", "Author": "Debbie Schlafly", "ReviewID": "R1RUGRKGB1GLTX", "Overall": "3.0", "Content": "This is an international phone, but it does not specify this in the ad.  It is not fully compatible with what is needed in the US.", "Date": "September 10, 2013"}, {"Title": "Last gasp from Nokia.", "Author": "Sigg boy", "ReviewID": "R1TDMCU8YNZHWH", "Overall": "2.0", "Content": "This phone is great hardware wise.Unfortunately it arrived 5 years too late.Apps don't synchronise with anything, it is not possible to download maps via a computer and Nokia Link barely does anything with this phone.  Not being able to synch calendars or maps easily with Nokia Link or what was OVI suite is a major turnoff.Nokia has lost the plot.  Blackberrys and Nokias are going to the hall of fame with Motorola clamshells as design icons, but unfortunately when I choose my next phone it will either be a simple phone like Nokia used to make with no fancy bells attached or I might have to delve into the Steve Jobs universe where Iphone screens break every 2 seconds.I like Nokias.  I did like Nokias. Now I think I am gonna get a Nokia dumphone, what Nokia does well, and just get some sort of tablet for the rest.", "Date": "October 18, 2012"}, {"Title": "i hate it", "Author": "Abdul Ahad Khan", "ReviewID": "R1XVKQ9KZ9O14D", "Overall": "1.0", "Content": "i was bought it but some problem i was returned it, i suggest don't buy it. this is very pro quality.", "Date": "August 16, 2013"}, {"Title": "Nice but not for me", "Author": "Sabrina Parke", "ReviewID": "R3I9G1KGPEQM02", "Overall": "2.0", "Content": "I have heard really great things about the Nokia N9 since my fiance is from the middle east, so I decided to get one. But I was really disappointed that you can not get a lot of apps like you can on the android phone. The camera and the GPS on this phone are amazing, if it would get all the apps that android has like whatsup app, instagram etc then it would be a perfect phone for me.", "Date": "December 18, 2012"}, {"Title": "Good buy and awesome customer service !!!", "Author": "Prab Metta", "ReviewID": "R330R6QOFROXIN", "Overall": "5.0", "Content": "Customer service is awesome and very responsive and ontime. In future I will defintiely considered to come back to the same store.I recommend to the frieds !!!", "Date": "May 21, 2012"}, {"Title": "great phone but.....", "Author": "Bolialbo", "ReviewID": "R1OKX5NZ67WIVM", "Overall": "3.0", "Content": "i purchased this handset only to send it back one week later, don't get me wrong it's indeed an amazing piece of equipment but its OS leaves a lot to be desired, it seems outdated compare with apple's iOS, notice that its OS meeGo was put to rest, new nokia phones will operate on windows plataform. market place on this phone is very limited. front camera doesn't work except for video calling meaning you won't be able to take pics using the front camera, it uses only micro SIM cards which it wasn't a problem for me since y own i iphone 4s, no problems switching SIM cards the phone recognized A&tt; SIM card inmediately, a little bit overpriced for my taste. marketplace doesn't have many of the apps I use like nimbuzz, msn messenger etc. I'm still on pursue of a handset better than the iphone and definitely the nokia n9 is not the case", "Date": "January 2, 2012"}], "ProductInfo": {"Price": "$238.99", "Features": "MeeGo-Harmattan 1.2 OS\nWill be delivered straight to your door on September 23rd 2011", "Name": "Nokia N9 16GB 3G Wifi GPS NFC GSM Unlocked MeeGo Touchscreen (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41XMee0ZX2L._SY300_.jpg", "ProductID": "B005HA4W7K"}}