{"Reviews": [{"Title": "Motorola EX124G", "Author": "Dr. M \"Professor\"", "ReviewID": "RE5MV77I2DDW6", "Overall": "3.0", "Content": "I bought this phone direct from TracFone with triple minutes for life for $79.  The phone is the same for TracFone and Net10, except for the minutes pay plan.  I had it about three weeks before I sent it back for a refund. TracFone/Net10 only has two touchscreen phones -- the Motorola EX124G at $79, and the LG 800G at $49.  I have evaluated both phones at the same time.  In the end, I chose the LG 800G over the Moto EX124G because for my purposes it was a much better value.PROS:Music Player - Excellent sound (with high quality earphones), especially with the REVERB setting switched onFM Radio - You must use a wire headset (wire acts as antenna), nine station presets, search and scan, good reception.Camera - 3MP resolutionVideo Recorder/Player -Voice Recorder -External Memory - 32GB microSD (not included)- one heck of lot of memory potentialAccelerometer/Position Sensors - A great feature, but unfortunately, there are no Java apps that take advantage of it, and even all the native features do not take advantage of the position sensor (landscape or profile).Screen Size - 400 x 200 pixel resolution.Alarm Clock - 5 separate alarms can be set at varying schedulesStop Watch - Timer and lapsBluetooth - Audio for earphones, phone to phone contact and file transfer, and PC to phone file transfer.Call Reject - Rejected calls are shunted to voice mail.Black List - Very handy option allows individual phone numbers to be completely rejected.Task Pad -User Manual - Nice 70-page manual comes with this phone, which is unusual for TracFone/Net10 phonesManufacturer Support - This model listed on Motorola's web site, which is unusual for TracFone/Net10 models.CONS:The following cons are listed because a less expensive model (the LG 800G) has them, making a stark contrast to the EX124G costing almost twice as much.No Included Games - this may be because there are no Java games that utilize the accelerometer and position sensors.  Unlike the higher-end Android market with hundreds of thousands of apps and games, the lower-end Java market is scarcely populated.No Memo Pad -No Scientific Calculator - Only a simple arithmetic calculator is includedNo World Clock -No Units Converter - just a very simple currency converterClunky Interface - this is subjective, but the LG 800G at half the price has a very well integrated and smooth user interface, and the EX 124G does not.  If you have never used the LG 800G, then you probably won't notice.No WiFi - No cellphone in this price range has WiFiNo GPS - No cellphone in this price range has GPS", "Date": "October 12, 2011"}, {"Title": "Loves touch screen", "Author": "Betty010", "ReviewID": "RUKY1GYS9JGCH", "Overall": "5.0", "Content": "I had this new cell phone for about two weeks. I'm someone who practically hates to press the same button just to get that letter in order to text or spell something out. This phone, it's quicker to do when you use the phone's pen. It takes a while to get your finger or thumb to use the phone by touching it.The phone has fast internet services and surely don't waste your time. As long you got good server bars, the internet is faster.Not only that, I have hearing aids. Those who do wear hearing aids and they are one of programmable hearing aids. I suggest you should buy Phonak iCom which it makes easier to listen with your cell phone wisely. The bluetooth is making at work! :D I managed to get my cell phone to connect to both iCom and my laptop that contains bluetooth.The memory is short if you're taking pictures or videoing. So, be sure to by a memory chip so you'd have more to store automatically.The phone is simple, easy to use, and useful. I am able to follow up schedules, putting information so I wouldn't forget anything, and the phone is more optional.I'd definitely recommend it to those who hates texting forever when you can text faster.If you have any question, let me know. I intend to have my phone on me 24/7 and learn very quick.", "Date": "September 14, 2011"}, {"Title": "AAA Members Beware", "Author": "Riledup \"Jim\"", "ReviewID": "R224FM6WBBM18A", "Overall": "1.0", "Content": "I would have ranked it higher, except for one BIG problem. One of the reasons to carry a cell phone is for emergencies. The other day, my motorcycle broke down and I had to call AAA for a tow. Unfortunately, their automated response system wasn't recognized by my phone so it never switched from CALLING to ACTIVE CALL. Therefore, I was unable to respond to the input requests via the keypad or speak the menu choices. Luckily I was able to contact my wife and she called in my roadside service request.I spent about 30 minutes with Tracfone trying to get this resolved, and the result is they are sending me a new phone. I am not confident that will solve my problem, since the phone does recognize the Milwaukee Transit System busline automated response system. So the problem must be AAA's method of signaling a connection, or this phone isn't programmed correctly to identify AAA's type of system. A coworker has an Android Motorola phone, and her's shows keypad and other menu options while calling that allowed her to input choices on AAA's system.I mailed a letter to AAA pointing out this problem, and I have a support message submitted with Motorola to let them know this happened.Update: 3/23/2012: Replacement phone arrived, but it still has the same connection problem. If you are a AAA member, avoid this phone. I spent another 20 minutes with Tracfone's support, and despite an attempt to correct the problem they basically said there was nothing they could do. I will likely port my number to another Tracfone I already have. I will keep the Motorola and port my landline from AT&T; over to it. I've got to get some value out of it, as I've owned it for only 6 months.For a video showing the problem, go to youtube and search on motorola ex124g and sort on download date.Update: 3/27/2012: I got a call from AAA in response to my letter. I explained the problem to the rep, but they had no solution. Said they'd pass this incident report on to their tech guys. Funny thing is they used to offer phones and plans and the vendor was Tracfone. How ironic is that!", "Date": "March 15, 2012"}, {"Title": "NOT REALLY SMART", "Author": "Ed Kemp", "ReviewID": "R3RM85Q5OAPBO4", "Overall": "1.0", "Content": "I am in the process of returning this phone to Tracfone and I do not recommend it to anyone because it chews up minutes. Specifically because of where the Browser button is located, you have a tendency to hit the button while you are navigating screens frequently. Even if you hit cancel immediately, the phone still charges a half a minute connect fee. I went through 20 minutes in no time just learning my way around the phone.Other things to be aware of: there are no games with this phone, you can only use limited number of older JAVA based apps. There is no actual GPS app.The phone is now marketed with TRIPLE MINUTES FOR LIFE so do not buy it if it says Double Minutes. As always, I recommend you purchase your Tracfone's directly from them on-line for best warranty service. There are many promotional codes when you are buying minutes. Always check for them. [..]", "Date": "November 16, 2011"}, {"Title": "Best TracFone For Ease Of Use and Great Style", "Author": "New Yorker", "ReviewID": "R1N27777GGYR13", "Overall": "5.0", "Content": "I bought this directly from TracFone for $79.00. Tracfone is stocking them again.  The site says - while they last.  I love this phone.  I have had three makes and styles of TracFones over the years (an older type Nokia, an inexpensive Samsung and now this impressive looking Motorola EX124G.)  This is, by far, the easiest phone to use.  For me, the ease of use, is well worth the price.  I love having everything just a touch away.  For the first time, I can actually find all features on my TracFone, easily. It, also, has the bonus of looking very stylish.  So far, I am extremely happy with my purchase. However, keep in mind, this is a TracFone. It is not an iphone, so don't expect it to act like one.", "Date": "February 11, 2012"}, {"Title": "This tracfone has a radio feature but it doesn't work.", "Author": "ColombianGandhi", "ReviewID": "R3US0XC2QC0K16", "Overall": "2.0", "Content": "The sound is good, incoming and outgoing. It touch screen responds quickly.The radio won't pick up most of the stations. NPR sounds awful and is what I listen to most. I tried three different earphones (which act as antennas) but the reception is very, very poor.Has no notepad.Can't transfer the contacts to a new phone, can't transfer the contacts to the memory card. Contacts have to be transferred manually.The browser icon is easy to activate and you can end up wasting minutes from the time you realize you touched it to the time you cancel it, it will charge you.You can download ringtones (about $2.00 per ringtone) but then u can't link them to any of your contacts.  . . wasted money.Has an AB repeater feature that I don't know what it is for. I called the help line and they didn't know either.", "Date": "December 11, 2011"}, {"Title": "LOVE IT!!!!", "Author": "amkape", "ReviewID": "RXN05SOLZH264", "Overall": "5.0", "Content": "I love this phone!!  I just got it last week and so far it has been great.  The touch screen works instant and I don't have to press the screen more than once to get to where I need to go.  The Pen is cool but honestly it works just as well to use your finger.  I was kinda scared at first to buy a touchscreen because I didn't know if it would be too slow or not but I am so happy I got this phone!  It is fast to open and view texts and to send them.  The phone is cool and sleek totally worth it!!!", "Date": "September 26, 2011"}, {"Title": "the stylus broke !!", "Author": "Douglas A. Hall \"foondoon\"", "ReviewID": "R18LOMY8LIMZPB", "Overall": "2.0", "Content": "After using the phone for two weeks, the plastic top of the stylus fell off.  Now the stylus is stuck inside the phone.  You cannot buy a replacement stylus ANYWHERE, including from Motorola.", "Date": "April 26, 2013"}, {"Title": "Worthless", "Author": "Richard R. Lamb \"Dick Lamb\"", "ReviewID": "R2ADM4M60C10I9", "Overall": "1.0", "Content": "I got the tracfone version of this phone a couple years, purchased directly from tracfone.  (I didn't realize I could have bought a tracfone-compatible phone, complete with triple minutes, from amazon for a much better price.)  This phone was a problem from the start.  Sometimes calls didn't get through, and very often the person on the other end couldn't hear me--as if the phone were on hold.  I never had these problems with a couple different previous phones I had on the tracfone service.  I find everything about the interface on this phone to be clumsy.  Web browsing and gmail are hopelessly slow and cumbersome to access, although I don't know whether a different phone would work better on the tracfone web connection.  My wife got an identical phone when I did, and she also experiences the same problem with the person on the other end not being able to hear.  So it was 2 losers out of 2 purchased.  Finally, today, I decided I'd had enough and ordered an LG 840G phone, and I'll get another one for my wife if mine works out OK.", "Date": "July 7, 2013"}, {"Title": "Great phone i love it", "Author": "Ivan barragan", "ReviewID": "R3UEZFFZGSFG76", "Overall": "5.0", "Content": "I recently bought this phone and i love it because it gets service almost anywhere and it is faster than most phones i had.", "Date": "May 17, 2013"}, {"Title": "Don't get this phone for tracfone", "Author": "Pat H", "ReviewID": "R2NDVXQAV78WU1", "Overall": "1.0", "Content": "Warning - we had this phone with Tracfone and they just shut it off.They(tracfone) told us that the chip in this phone has a problem and they can't track our usage.So, they(tracfone) stuck it too us, and without notice shut the phone off while it still had minutes left.After multiple calls and conversations with Tracfone customer service, they told us to buy a new phone and more minutes, basically you're done and the phone we(Tracfone) sold you is useless and no good. Tracfone told us this phone is no longer allowed to be used on their network.DO NOT USE this phone if you were planning to use TRACFONE.", "Date": "September 22, 2013"}, {"Title": "poor signal an service", "Author": "Ernest G. Irelan", "ReviewID": "R2NJIPNMW7UVJ9", "Overall": "4.0", "Content": "I purchased this phone from Tracfone direct from their web site, 79.99 plus tax an shipping, got triple minutes for life with it. I Like the design, ease of use an the instruction booklet that came with it, ease of getting it activated. HOWEVER, I was very disappointed in the poor signal strength I was getting here at home in the house. I would put my old LG next to it, get a 1-3 bar signal on it...about a week later I had gotten an LG800G for my son, put it also beside the Motorola, got 3 bars signal on the Lg, NONE on the motorola...Tracfone calls their phone, EX124G but, is exactly the same fone...I talked with cust. service of tracfone, several hours on more than one occaision, they were in the end, going to replace my fone as they did not know what was the matter with it, indicated I would get a new sim card or a new fone, well, I was really surprised when I got a 29.99 LG fone an double min with it....I CAN SAY I WAS NOT HAPPY WITH THAT AN PROMPTLY SENT IT BACK...another round with service, told them I was not going to take a 50 dollar loss, also, dbl min for triple..etc...an ended up keeping my motorola...but, my son has had great luck with his LG800G an for the ease of use an signal..that is better with the LG...an, as for service from TRACFONE, I have been a long time customer of them, we currently have 3 active fones in my family...I can use my Motorola away from home well., but, if they do not improve the signal in my area soon...when I find an improvement, either in fone or service, will go for it...this fone is also a bit delicate for me...I am afraid all the time of dropping it or bumping it..lookng for a decent case an also, a car charger for it....my total talk time with Tracfone, estimated to be 4 hours over this problem, also, ended up having to re activate it too, which was also a pain in the buttocks....so, I guess my main complaint is, service from Tracfone an signal service in my area which is stated on their website that I have....NOT good tho...so, if you purchase this fone, make sure you have a test for the signal service in your area...it is not nearly as good as the LG's..", "Date": "October 28, 2011"}, {"Title": "It's okay...", "Author": "stargazerlilly", "ReviewID": "R1PDRSKD77X2R4", "Overall": "3.0", "Content": "Initially I bought the LG800 through NET 10, but they were having system problems with that phone- my texts weren't going through and I wasn't able to receive them, so I received the Motorola EX124G as a replacement. When I got this phone, I was immediately disappointed. There is no memo pad, which is almost a necessity for me. There are no pre-installed games. The battery life isn't great and having to use the stylus wasn't so great. I got over all of that though and started to enjoy the phone. As long as I turned it on its side when texting, for use of the fuller keyboard, I could text without the stylus (although it can be unresponsive). If you don't use the web too much, your phone will stay charged the whole day. I never bought any games and just learned to do without the memo pad. Then, after three months of use, my phone completely locks up. Net 10 couldn't troubleshoot the problem so they had to send me a whole new phone. I lost all of my pictures and all of my contacts. I'm not crazy about this phone and plan on getting a new one within the next six months. I don't think I would recommend it. If they've fixed all of the system problems with the LG800- get that one. It's a better phone even though it is a little smaller.", "Date": "November 20, 2011"}, {"Title": "motorola", "Author": "crystal  midkiff", "ReviewID": "RCQD90MFPP1O2", "Overall": "5.0", "Content": "i love  the phone so much i have not yet have any trouble yet thank yall very much allow me to get the phone.", "Date": "December 15, 2013"}, {"Title": "Useless for Internet", "Author": "Ken Brumbaugh", "ReviewID": "RMNA5L5B2L3DW", "Overall": "1.0", "Content": "I purchased this phone directly from TracFone.  It took 2 weeks for TracFone to activate it and I had to make more than 10 phone calls to their \"customer no-service.\"  The internet on this phone is extremely slow and it doesn't load recognizeable web pages for my common sites.  Trying to get this thing to work ended up having it go past the period where I could send it back so I'm stuck with this overpriced cell phone which is all it's good for.I'm now deciding whether it's time to pay the price to get a true internet capable phone.DON'T BUY THIS PHONE AND ASSUME ANY TRACFONE OR NET10 PHONE WON'T BE A GOOD INTERFACE TO THE INTERNET", "Date": "January 6, 2012"}, {"Title": "Not the best phone but certainly not the worst.", "Author": "Melissa", "ReviewID": "R2CCBW4Z6AU9RY", "Overall": "3.0", "Content": "I  bought the Motorola 124G phone to replace my old Net10 phone. In the pictures it looked very promising and new. When I opened up the box I saw the phone witch looked nice and had a nice style to it. I turned on the phone and tryed it out to make sure it worked properly. I noticed the touch screen sensativity was not at its best and realized that was why they gave us the stylus that was located on the top right corner of the phone. I was not really excited with the stylus because i thought it would just take more time in order to use the phone when you really needed it and that it was just another thing you could easily get lost. I then began to look into the phone's menu to see what it had to offer. The menu was standered. I did however enjoy the AM and FM radio that would be on your home screen of the phone along with the music player. The games app did not have any games/apps so you would have to download them off of the Net10 website. With the virtual keybored when you got to the texting app, it is hard to text. If you are used to texting with two thumbs, this is probly not the best phone for you with that feature considering the numbers and letters are too close when you do landscape mode or just picture mode. The camera/camcorder is nice. There is a 3.0 Mega Pixel camera in it witch takes pretty decent photos. This phone does offer alot though considering the downsides that i said above. This phone is a nice starter touch screen phone. This phone is basically a step up from the LG800 with the features and overall. The Net10 customer service is really not the best. It takes a while inorder to talk to a live person. If you are looking for a cheap phone then Net10 is your choice. Overall thought, if you would rather get unlimmited for your Net10 phone they now sell the unlimmited card for $50. I usually buy the 300 minute card because it lasts for 30 days and is only $30. I would reccomend this phone to a Net10 friend if they were looking into buying a touch screen Net10 phone.", "Date": "September 1, 2012"}, {"Title": "Phones are cheap but the customers service SUCKS!,", "Author": "Joe S.", "ReviewID": "R6HZ99RMKRGDO", "Overall": "2.0", "Content": "TRACFONE AND STRAIGHT TALK ARE JUST THROW AWAY PHONES  .  THEY HAVE GOOD SERVICE DEALS BUT THERE CUSTOMER SERVICE SUCKS!!! They do not have anyone that can help you, they just have people that read from a script. And after an hour or more you will just get very mad and hang up because they cant help you. I found out that when they are trouble shooting for example my motorola phone they were just reading from the motorola trouble shooting web page.", "Date": "March 15, 2013"}, {"Title": "No Longer available from Tracfone", "Author": "JET314", "ReviewID": "R1SKQ3QDFJ2VK1", "Overall": "1.0", "Content": "I just finished an online chat with Tracfone and the Motorola EX124G is no longer available and no other information is available regarding its return.", "Date": "December 2, 2011"}, {"Title": "worst. phone. ever.", "Author": "Steven A. Barnes", "ReviewID": "RI92EH71HJ4TW", "Overall": "1.0", "Content": "My advice would be to purchase ANY other cell phone. Clumsy interface, incomprehensible \"support\" material, no ability on the part of the phone itself or the support environment to fix any problems. I have spent innumerable hours simply trying to get it to work, and it always comes up short. To be honest, this is the second Tracfone item I have purchased, and all I will say about that is: Never again. I guess in some circumstances it is true that you get what you pay for.", "Date": "November 27, 2011"}, {"Title": "Highly Disappointed In Sellers Of This Phone", "Author": "Jan Far \"jjan\"", "ReviewID": "R88RPAFZNVLKU", "Overall": "1.0", "Content": "I need to know why $119 is fair price?????? What justifies that?The owner of this thing wants alot of money for it.And WHY in the world ARE they selling it?The one for 80 something bucks went up, CRAZY and I see it was sold or taken off the market for some reason.", "Date": "January 8, 2012"}, {"Title": "price is a rip off....", "Author": "steve", "ReviewID": "R1IL9MRKRRK2F2", "Overall": "3.0", "Content": "This phone sells on the Net 10 web site for $79.and even better, its offered at WalMart for $69. (but have to order site to store, not on the shelf)ok used the phone for about 2 weeks now....battery lasts a long time,The game selection is poor and expensive but the games i did get and play are of high quality.but the cost is cheap to own the phone overall, i spend an avg of $15 month with NO contract with net 10would work better on a better cell carrier im sure...", "Date": "September 3, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2-inch Touch Screen with Gravity Sensor (Tilt & Shake)\nMobile Web\nBluetooth Wireless Technology\n3.0 MP Camera & Video Recorder\nMP3 Player (cable and SD card not included)", "Name": "Motorola EX124G Prepaid Phone (Net10)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Dy5kkG0LL._SY300_.jpg", "ProductID": "B005I04C0G"}}