{"Reviews": [{"Title": "Best Phone I've Ever Had!!!!", "Author": "Hulagirl", "ReviewID": "R2560MSVH3OV4Q", "Overall": "5.0", "Content": "Since I couldn't get a smartphone because they're too expensive I decided to do some research on the best basic phone out there. This would be the third and best phone I've ever had. The basic phones Verizon carries aren't that great anymore because they expect everyone to have a smartphone by now and the basic phones are slowly disappearing. After a little research it came down to this phone and the lg enV touch. I really like lg because they have good quality products. This phone is very nice looking and the best basic phone out there. The only issue is sometimes the touchscreen is not very sensitive but i haven't had a problem with that. Other then that its the best phone I've had so far (I also recommend getting screen protectors!!).", "Date": "January 20, 2012"}, {"Title": "Loved this cellphone so much, I bought it twice!", "Author": "xari", "ReviewID": "R29T1PKFQNS2OK", "Overall": "5.0", "Content": "I had this cellphone for a couple years and loved it, but last November I was ready for a change, so I \"upgraded\" to a Pantech Crux. (What a disaster!) This past September, I couldn't take the Crux anymore, so I began my search to reacquire the Versa and am sooooooooooo happy I did! Small, sleek, easy to to use, great battery life, great reception. Highly recommended!", "Date": "October 29, 2011"}, {"Title": "Versa  w/ keyboard", "Author": "rmhmad", "ReviewID": "RBE19ELAB69WA", "Overall": "5.0", "Content": "My boyfriend purchased this phone and it actually came with the attachable keyboard. He loves it and uses it constantly! The texting is great combined with the touch screen. Also a great part is that it doesn't require a data package when we added him onto the phone plan through verizon.", "Date": "March 27, 2012"}, {"Title": "This is my second of this phone, love it.", "Author": "britbrat", "ReviewID": "R3IMQSRI32YVY1", "Overall": "5.0", "Content": "I bought this one after my first went dead (accident). I have the attachable keyboard with it. It is easy to use. I don't really use the internet or anything on it. It is just a great simple phone.", "Date": "December 28, 2011"}, {"Title": "3+ years with this phone", "Author": "Gustavo77", "ReviewID": "R1JE97ETJNV27S", "Overall": "5.0", "Content": "I've had this phone for about 3 or a little more years and its still going strong, I get great reception, the speaker is nice and loud, it may not be a smart phone, but its one of the best basic phones you can have if you don't want to pay for an internet plan with those smart phones. I have my music on this phone, it has some neat features, the only thing I feel is very lacking is the camera, 2MP is pretty weak by today's standards, however that has not stopped me from taking hundreds of pictures with it. After 3 or so years only problems I've experienced was the occasional sound skipping (very rare problem) and the phone freezing every now and again.Another thing, this phone is actually pretty good at multitasking, you can listen to music and text at the same time, or you can be on a call and open up your texts or open up the notepad if you need to jot something down, it has the motion sensor, where if you tilt the phone the screen goes sideways or responds. It is also built very well, I've dropped it a few times and it still works great, with the only damage was a slight chip or dent on the chrome outline.All in all, I love this phone, if I upgrade sometime in the near future I'll definitely be keeping this one around in case I need to activate it again due to whatever issue may arise. If you need a basic phone with some neat and useful features, this is definitely the phone to get, highly recommend it.", "Date": "April 18, 2013"}, {"Title": "I love this phone!", "Author": "Jose T", "ReviewID": "R3PE28DYLKD1P", "Overall": "5.0", "Content": "This phone is awesome! I love that it has a touch screen without needing to have a data plan. It takes pictures at 2 mp and the video it takes is excellent (only 30 seconds per video though). Add the qwerty pad attachment (sold separately) and it makes it easier to text and write notes. One thing though, with the qwerty attachment it becomes bulky. But still, I love this phone!", "Date": "August 26, 2012"}, {"Title": "LG Versa", "Author": "lbrantley", "ReviewID": "R196GLGOYCF3GF", "Overall": "5.0", "Content": "I love the Versa Touch Screen Cell Phone, I have no problems with my phone. Its perfect for my uses.", "Date": "March 12, 2013"}, {"Title": "Great Phone!", "Author": "dhall2299", "ReviewID": "R1ZL1OAEM46F23", "Overall": "4.0", "Content": "Although I did not buy my phone off of this site, I still want to give a review. I owned this phone over four years ago, and am quite surprised that people are still buying it...to be honest. Nevertheless, this phone was absolutely amazing! It was my second phone ever, but I loved it. I kept the keyboard on it pretty much the whole time i had it though. I liked the keyboard because it protected my phone as well as making texting/typing easier. If you are looking for a phone that is not a smart phone, but is still amazing, I definitely recommend this product. After having this phone for about three years, I switched over to a Droid X2, but I still have this phone, because if my droid breaks, I will use this phone again.", "Date": "September 27, 2012"}, {"Title": "Nice phone", "Author": "Steve", "ReviewID": "R3FV06MV1P9MBA", "Overall": "4.0", "Content": "I am pleased with the phone overall. I do have two minor issues however. The first issue I have is that in video mode you can not utilize the full screen. That should only require a software upgrade, and I believe it would be a great feature if it was done. My second issue with the phone is that the earplug is 2.5mm rather than the more common 3.5mm.", "Date": "July 1, 2012"}, {"Title": "Great for a non-smart phone.", "Author": "lawalker", "ReviewID": "R2C6TYFHIWKH8F", "Overall": "4.0", "Content": "I've had a few of these over the years and really like them. Hardy phone holds up well and I never had any issues with it. Also had a good experience with the service I received. Would buy from them again.", "Date": "April 23, 2013"}, {"Title": "Love my versa touch screen phone", "Author": "Linda G", "ReviewID": "R30RP2FS10QOPS", "Overall": "5.0", "Content": "I am glad I puchased this phone. I didnt want to upgrade to a smartphone, but wanted a touch screen. This is a great phone.", "Date": "July 19, 2013"}, {"Title": "It works", "Author": "Cori", "ReviewID": "R226PASK9NK5BD", "Overall": "2.0", "Content": "I had to replace the same phone because it wouldn't hold a charge so i bought this one. I'm not totally happy with it though. First, it loses calls and searches for service constantly. It has to be an issue with the phone because I'd never had that problem before. And when it's charging or in use, it gets pretty hot. Also the phone won't turn on if it is plugged into the charger. I have to unplug it before it will turn on, not sure why. So it works well enough to make calls and everything but it isn't without problems.EditI just switched back to my previous phone because the second one I bought started losing battery life on top of having horrible signal. Immediately upon switching back, I had full signal strength.Also, a few days ago, I had the second phone plugged into the charger that came with the phone and it fell off of a counter and the charger fell apart, wires hanging out and everything. I plugged it in to see if it might still charge the phone but it wouldn't so I had to get a new one.", "Date": "April 14, 2013"}, {"Title": "Did not like the phone/charging issues", "Author": "William Engel", "ReviewID": "R2FSRZM4NBDOJ3", "Overall": "1.0", "Content": "This phone is not user friendly and the charger keeps saying it is the wrong one for this phone and sometimes does not charge properly.  Returning it.", "Date": "April 25, 2014"}, {"Title": "lg vx9600 versa touch screen cell phone", "Author": "by cam pesh", "ReviewID": "R2BRZHAK7UFNHZ", "Overall": "1.0", "Content": "I had the original cell phone since 2009. it worked fine, till it was submerged.  this replacement looked fine, but was never able to go \"live\" - though it did take a charge.  I'm returning it for another same phone - hopefully with better luck!", "Date": "February 18, 2014"}, {"Title": "old phones", "Author": "Junglebear", "ReviewID": "R784N8M87J7VX", "Overall": "2.0", "Content": "these phones in their day were top of the line , but they do have problems with tex messaging and the features are very spartan", "Date": "August 4, 2013"}, {"Title": "Issues started popping up after three months.......", "Author": "Richard Basehart", "ReviewID": "R2O9DPG5IBHUM2", "Overall": "1.0", "Content": "First manifestation was that the display lost it's red component, everything looked dull.  Next thing (a few weeks later) the phone would intermittently lose the ability to access its SD card (external memory).  Then it scrubbed my entire contact list (thank God it was backed up).  Received the phone in February by November it became a liability and was retired.", "Date": "March 7, 2013"}, {"Title": "My second one", "Author": "DeeIngram \"D\"", "ReviewID": "R3556P436D65SH", "Overall": "4.0", "Content": "I got this to replace my first one because it is one of the few Verizon smartphones you can have without being forced into an expensive data plan. It's a keeper.", "Date": "February 27, 2013"}, {"Title": "stolen", "Author": "Peter Fox", "ReviewID": "R1B7C18UM7EW22", "Overall": "2.0", "Content": "when i took this phone to verizon to activate it, they said it was on their lost/stolen list. it was a very good phone though", "Date": "February 26, 2013"}, {"Title": "Good", "Author": "Sabrina", "ReviewID": "R26RBB8STR6PIN", "Overall": "4.0", "Content": "This is a great working phone :) All that i expected! i love it !!!! thanks you so much !", "Date": "February 25, 2013"}, {"Title": "Versa Review", "Author": "JIMA", "ReviewID": "R3HFNP0836GS0C", "Overall": "4.0", "Content": "The product was a good buy off of Amazon. yes the current product that I purchased has met the needs of the phone that I was looking to get as a replacement for Thanks .", "Date": "January 6, 2013"}, {"Title": "awesome.", "Author": "Macarena", "ReviewID": "R13OX299DU464V", "Overall": "4.0", "Content": "awesome phone and got it very fast. touchscreen is hard to get used to and its not SUPER responsive but its a great phone! u shouldn't be disappointed and the shipping is lightning fast.", "Date": "September 17, 2012"}, {"Title": "Not what I thought I was ordering", "Author": "Melanie Shearman", "ReviewID": "R39UYJXUWEZF79", "Overall": "2.0", "Content": "The subject says it all.  I got everything that was listed, but it wasn't what I thought it was, so it hasn't been used.", "Date": "April 4, 2013"}, {"Title": "Won't work with pageplus", "Author": "Juan Grande", "ReviewID": "R15ZF1EBO0WT22", "Overall": "1.0", "Content": "Don't know about the usability of the product or durability. It will not work with pageplus as \"unlocked\" or \"no contract required\". You can find them on e-bay specific to pageplus for as little as $40!", "Date": "October 2, 2012"}, {"Title": "just what I was looking for.", "Author": "krystal", "ReviewID": "R6FAQK0ZQLKB2", "Overall": "5.0", "Content": "Didn't take very long to get to my house which was great! Good basic phone which is what I needed. I was used to the newer touch screens so it was hard getting used to this old one. You really have to press the screen when texting witch is a hassle.", "Date": "April 22, 2013"}, {"Title": "LG versa", "Author": "Vanessa  Rothwell", "ReviewID": "R1YDCOTOL7I1EP", "Overall": "2.0", "Content": "This phone is much smaller than it appeared on the site. I was looking for something larger. I'm somewhat still looking.", "Date": "February 26, 2013"}, {"Title": "pre pay", "Author": "Suzanne L. Barclay", "ReviewID": "R2U2P88H93X3TR", "Overall": "3.0", "Content": "DON'T BE FOOLED THIS PHONE CANNOT BE USED WITH A VERIZON PRE-PAY PLAN AND THATS WHAT I BOUGHT IT FOR THE DISCRIPTION SAID NO CONTRACT REQUIRED BUT NON THE LESS WHEN I WENT TO ACTIVATE IT BY CALLING VERIZON THEY SAID THIS PHONE IS NOT ELEGIABLE FOR PRE-PAY", "Date": "July 24, 2012"}, {"Title": "worst phone i have had!!!!! do not buy!!!!!", "Author": "Gay B. Treadwell", "ReviewID": "R3LGZ3VNTPG7BX", "Overall": "1.0", "Content": "i bought this phone used it was great for about 3 months then after that the battery began dieing very rapidly and it is VERY VERY hard to text with. the phone is very hard to oporate and pocket calls every person in your contacts and if you drop it from 6 imches off a chair in class it dies with a loud tone to alert you of the problam I HATE THIS PHONE!!!!!", "Date": "April 1, 2012"}, {"Title": "THIS PHONE IS THE WORST PHONE EVER!!!!!!!", "Author": "B:)", "ReviewID": "RQB4BUODUD89K", "Overall": "1.0", "Content": "I HAD THIS PHONE FOR 2 AND A HALF MOTHS AND IT WAS OK AT FIRST AND THEN IT SARTED FREEZING UP ON ME!! THE SCREEN IS VERY SMALL AND ALSO THE CAMERA QUALITY IS VERY BAD TO BLURRY PICTURES!!AND RIGHT NOW MY SCREEN JUST FROZE UP AND ITS NOT WORKING AT ALL!! I WOULDN'T RECOMMEND ON GETTING THIS TIME OF PHONE AT ALL.", "Date": "March 25, 2012"}, {"Title": "Umm no", "Author": "Timmy", "ReviewID": "R2CG6NW9G1AW85", "Overall": "1.0", "Content": "Would say I was not impressed phone came no case said did phone cut off would keep cutting off I returned phone few weeks back still haven't gotten refund", "Date": "August 24, 2012"}, {"Title": "DO NOT BUY!", "Author": "MMG", "ReviewID": "RFDEQR2FRE2D4", "Overall": "1.0", "Content": "This phone sucks. I HAVE HAD THIS PHONE FOR 2 AND A HALF YEARS AND I HAVE HATED IT THE ENTIRE TIME!!!  This was my first cell phone and for the first week it was so cool.  Then i realized that it took me over a minut to send a 1 sentence text.  It was very hard to text, and almost 3 years later it still is.  And when you mistype, the delete button is also very had to hit!  I cant even get used to it!!!  However it is a brick, I have never broken it, but it has began to freeze on me now.  Also it pocket diles every one all the time!!!  Every time i put it in my backpack or my pocket it would pocket dile, EVERY TIME!!!  Overall DO NOT BUY, it is not worth it.  Get an iPhone its 1,000,000 times better.peace", "Date": "June 5, 2012"}, {"Title": "LG Versa", "Author": "sman21", "ReviewID": "R30TYRKK4E8OQ", "Overall": "1.0", "Content": "I brought a Lg Versa on September 6. I was unable to program this phone to my previous phone number. I would not recommend this site to anyone.", "Date": "September 13, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Advanced touchscreen phone, **PLEASE NOTE: optional QWERTY keyboard sold separately**\nAccess Verizon's V Cast Music and Video service via fast EV-DO data network; GPS-enabled for turn-by-turn directions (Data Plan Required)\n2.0-megapixel camera/camcorder; Bluetooth for stereo music and dial-up networking; MicroSD expansion (to 16 GB); access to IM and personal email\nUp to 4.8 hours of talk time, up to 430 hours (17.9 days) of standby time\nClear ESN , Ready To Activate, No Contract Required", "Name": "LG VX9600 Versa Touch Screen Cell Phone, Black (Verizon Wireless) CDMA Only. - No Contract Required.", "ImgURL": "http://ecx.images-amazon.com/images/I/41kvLOFR4AL._SY300_.jpg", "ProductID": "B0051IY0V6"}}