{"Reviews": [{"Title": "NOT AS ADVERTISED", "Author": "Rebecca Ross", "ReviewID": "R1L6SXLC3WAQ6V", "Overall": "1.0", "Content": "Although I was impressed with the rapid receipt of this phone, I am THOROUGHLY DISAPPOINTED and feel that the information regarding this item was incomplete and misleading. When I tried activating this VERIZON phone through Verizon, I was told that it is a pre-paid ONLY phone and that it must be activated as a pre-paid phone for 6 months before it can be assigned to a post-paid number. This seems like a ridiculous thing to me, but apparently there is no way around it. This information SHOULD have been stated clearly and succinctly in the product specifications, specifically in the main title description for this item. The phone itself is in the advertised, stated physical condition and I have been happy with the follow-on model of this phone, so I'm sure I would have been happy with this particular one had I been able to actually use it.", "Date": "July 19, 2012"}, {"Title": "LG VN250", "Author": "footloose", "ReviewID": "R1LOD9P4453BB6", "Overall": "1.0", "Content": "Not advertised as stated  After reviewing the other responses this seams to be a repeating theme /selling a phone that is absolutely useless !!!!  No response from the retailer  they should be removed from amazon.com  we trust amazon but  when they simply don't respond and sell phones repeatedly that are prepaid only  and dont represent that they are prepaid only  are intentionally trying to dupe us  BEWARE BEWARE BEWAREREMOVE THEM FROM AMAZON", "Date": "September 26, 2012"}, {"Title": "Disappointed", "Author": "Robert Kinzer", "ReviewID": "R33P9HVMJK5I7X", "Overall": "1.0", "Content": "I did not see nor understand that this phone was a pay phone and after opening it and trying to activate it, Verizon told me that it was usable only as a pay phone. I emailed the seller and was told that they were not willing to take back the phone because the package was open. Please be wary of doing business with small businesses or individuals that cannot make things right for their customers. The phone is worthless to me and certainly not the bargain I expected.", "Date": "July 13, 2012"}, {"Title": "Great Purchase", "Author": "nmfesen", "ReviewID": "R6OIXTU4UECZP", "Overall": "5.0", "Content": "The LG Cosmos VN250 is a handy little cell phone.  Love the flip keyboard feature, great for texting.  This is a good picture, text, and voice phone, low tech and easy to use.  Pretty durable too, it can withstand the everyday use and occasional drops.  With Verizon service it receives great reception and is reliable.This is my second phone of this model. The first I recently dropped in gallon of paint, which I quickly took out and rinsed off with water.  (Didn't know about the bowl of rice absorption trick then).  I took the phone apart, cleaned off all the paint and amazingly the only part that was broken was the microphone.  After paint and water I was still able to text, take pictures, call outbound and receive calls inbound with ability to hear the caller on the other end.  However, with a broken mic, they could not hear me.  Impressive.", "Date": "March 2, 2012"}, {"Title": "Get Rid of your Cell Contracts-Buy a New Phone on Amazon!", "Author": "AngelK", "ReviewID": "R3ST7W47Y5FGZ0", "Overall": "5.0", "Content": "We wanted to add one of our children to our Verizon phone plan without having to commit to a contract. We got a brand new phone, from a reliable Top Seller, at a much lower rate than we would have paid through Verizon. The phone works great, takes great pictures, and is exactly what we needed for calling, texting, and picture taking. We will never have a cell phone contract again!", "Date": "June 8, 2013"}, {"Title": "Not as Advertised", "Author": "lala17", "ReviewID": "R3PM898R55MQ0D", "Overall": "1.0", "Content": "I ordered this phone after doing a search on LG Cosmos unlocked and no contract.  When I tried activating this VERIZON phone through Verizon I was told that it is a pre-paid only phone. I purchased this as a replacement phone for my daughter's Verizon phone that was stolen and intended to activate it on her account.  Information about it being a prepaid phone was not provided in the description and product information.  The phone is in good condition as stated.  I'm very disappointed that I now have to return it and figure out an alternative", "Date": "January 29, 2013"}, {"Title": "LG Cosmos II VN250", "Author": "Read For Life \"Kim\"", "ReviewID": "RA104LCS8L3X6", "Overall": "5.0", "Content": "I'm visiually impaired and this phone is awesome 4 me.  I esp like it bc it has alot of settings u can change.  SOME r: font size, font style, clock format, brightness and theme, and backlight time (to name a few).  It is compact and I love the keyboard--for texting.  Plus, they sell many covers (for protection) for it on Amazon for $2 to $5 (very reasonable).  I hope they make a newer model 4 this phone in a year or so bc I will certainly buy it.  This is the LG Cosmo II VN250 for Verizon wireles.", "Date": "September 12, 2012"}, {"Title": "LG COSMOS", "Author": "avery", "ReviewID": "R326QQKWO3WNL9", "Overall": "3.0", "Content": "The LG COSMOS is a good starter phone! After a about a year, the voice on the other line... well lets just say you can not hear a word the other person is saying! I got this phone for the christmas of second grade! so now I am in forth grade! I am getting a new phone today! But still its a good starter phone!You need to get a phone case for it! I have dropped it lots of times! Its a pretty sturdy phone though.... so I gave it a three because As i said its sturdy! also It has a good key board too! I did not get it from amazon though, I just wanted to write this to let the world know how this phone works and stuff!!! But It only did last me a year! so you can get this phone if you need a phone for a kid!Or adult! Only drop it once or twice though!  Avery (age nine)", "Date": "August 20, 2012"}, {"Title": "Not what I was expecting", "Author": "Jordan", "ReviewID": "R1OIS4BPURNHXR", "Overall": "2.0", "Content": "This is a pretty good phone.  I enjoy it the only downside is its an LG.  The RAM on this phone is around 10MB so if you have a full inbox your phone can run very slow and delayed.  Another downside is the lack of video, flash camera, and music player.  The main thing i tend to not enjoy is, this phone will randomly turn off.  I will glance at my phone and i get a black screen.  I push a button and then i get the power up screen.  This can be frustrating at times.  Other than the random shutting off and lack of RAM, i would recommend this phone", "Date": "December 9, 2011"}, {"Title": "works very well for a used item..... shipped timely", "Author": "Alaska Slim", "ReviewID": "R3NYQYBM6MWF1G", "Overall": "4.0", "Content": "My son lost his new verison phone. This made about 4 cell phones that he has lost. I purchased this used phone for him on Amazon. The item was shipped timely and was reasonable priced for a used cell phone. It works great too. At least if he loses another phone it didn't cost me a arm and a leg to replace it !", "Date": "April 29, 2012"}, {"Title": "Non-smart phone user", "Author": "KAT", "ReviewID": "R1XRZGX25ODXFS", "Overall": "5.0", "Content": "I love this phone for being a non-smart phone. Wish I would have bought it earlier!! If you only use a phone for text, calls, and some pictures--this is it!", "Date": "June 19, 2013"}, {"Title": "Exact", "Author": "debra a walukiewicz", "ReviewID": "R1DCR0OHPHMW68", "Overall": "5.0", "Content": "Was exactly as stated..on time...no issues..great phone..own newer version..very similar..works great...great reception...just opposite flip side to mine..I would buy again", "Date": "June 18, 2013"}, {"Title": "just what i needed.", "Author": "JMF \"JMF\"", "ReviewID": "R1QNVRMVZ0QNT2", "Overall": "5.0", "Content": "pros: makes & receives calls, text, and picture messages with great reception and clarity. bluetooth support makes things a snap. picture quality is decent. the slide-out keyboard works great for people who don't have small deft fingers like me. bitpim file transfers works great. phone has never crashed or frozen up yet.cons: i'm still hurting over the fact that LG still hasn't remade the \"phone lock\" feature a hotkey like the way it was on the VX3200 and vx5300. the \"voice command\" button keeps bumping into me or a hard surface on accident and keeps asking me for voice commands. bad ergonomics for the voice command key.overall: great phone. i love it. worked a whole lot better than that vx5500 i had 2 years ago.", "Date": "April 1, 2012"}, {"Title": "Great phone", "Author": "Ashley", "ReviewID": "R1BSF382WP3ONW", "Overall": "5.0", "Content": "I got one of these free when I renewed my contract. When I accidentally drowned it, I bought another one because I liked it so much. The slide out keyboard is really great, because I do A LOT of texting. It's pretty hardy, I drop it all the time, and aside from a few little scratches, it's fine.It just doesn't handle going through the washing machine very well, but no phone does.", "Date": "May 11, 2012"}, {"Title": "CRAP  CRAP  CRAP  CRAP ! ! !  DO  NOT BUY! ! ! !", "Author": "jim", "ReviewID": "R3G2A8GJZ5K0K", "Overall": "1.0", "Content": "I BOUGHT THIS $99.99 PHONE TO TRY AND FINISH UP MY 8 MONTH CONTRACT WITH VERIZON. I BABY MY PHONES AND NEVER EVER DROP THEM.  THIS PHONE COMPLETELY CRAPPED OUT IN 3 MONTHS.  P.O.S.  DO NOT BUY ! ! ! ! !", "Date": "December 18, 2012"}, {"Title": "COSMOS", "Author": "Doris Fish \"FISHOFTENNESSEE\"", "ReviewID": "RPSXWAW2RH7K1", "Overall": "5.0", "Content": "THIS IS A GREAT REPLACEMENT PHONE.  HAS ALL THE BELLS AND WHISTLES AS A MORE EXPENSIVE PHONE.  THE SPEAKEER PHONE IS GREAT. THE VOICE CALL ID IS VERY UP TO DATE AND THE CAMERA VERY GOOD.", "Date": "August 15, 2012"}, {"Title": "Good, But Degrades After About a Year", "Author": "Elisbet Y.", "ReviewID": "R2CUUFZMPZWHDZ", "Overall": "3.0", "Content": "NOTE: I am seeing reports that this phone is now PRE-PAID ONLY. As with any phone, CHECK WITH YOUR CARRIER FIRST! I cannot stress that enough!I got this phone with contract through Verizon, probably about two years ago. It was a fantastic little phone for about the first year, doing nearly everything I wanted (except video). Glaring issues from the start, however were that the camera's crummy, and the whole system lags like nobody's business if you have too many messages (apparently this is a known issue, too little RAM or something). It also doesn't get the greatest reception, and will drop calls even if you have four bars. It began dying after about the first year or year and a half (more below).Good stuff: the keyboard is WONDERFUL! I will miss that most of all. Touchscreens don't register me very well, and the sturdy little buttons for each \"key\" were great. NONE of the buttons wore out over the course of two years.I've dropped the poor thing about once every four to six months, and it's survived every fall just fine. Only once did the battery fly out, but it rebooted like nothing was wrong. I've slid the keyboard out a bit too hard before, and it didn't show any signs of damage. Overall, quite sturdy, quite functional. Might be good for an eager new cell user, like a pre-teen.Do NOT expect this phone to be in it for the long haul. After the first year, it began having issues with the entire system freezing and shutting down/restarting in the middle of taking pictures. Then it would freeze during frequent text messaging (or if I was composing a message, and one began to come in). Finally, this past weekend, it stopped being able to send picture messages at all, and would simply hang on the \"connecting\" or \"sending\" screens (with four bars and normal reception). It's answering calls before you hit the appropriate button (or if you're in the middle of typing when a call comes in). Some days, it cannot keep a charge for 12 hours, LITTLE USE (no pics, few texts, a few short calls).This would be a fine phone if you intended to upgrade soon, or were replacing a lost phone for a short period... otherwise, if one was set on the QWERTY keyboard (I hear you!), try the contract renewal for a free/cheap LG Cosmos 2 with Verizon. It's probably worth it, if they've fixed these issues.", "Date": "September 11, 2012"}, {"Title": "Excellent quality for a \"Refurb\"", "Author": "Daniel R. Vasconcellos \"DanV\"", "ReviewID": "R2UGFUFTVQ6XRW", "Overall": "5.0", "Content": "This item came on time, I was able to program it for my Grand Daughter, and she is happy to have a fully functioning phone again!! Getting a \"refurb\" is the way to go if you don't want the expense of a new phone. Thanks!!!", "Date": "June 21, 2012"}, {"Title": "Just as describes", "Author": "J. Cozens", "ReviewID": "RY92BIAQKAZ8N", "Overall": "5.0", "Content": "Thank you for being such an upstanding company!  Phone came as described and the transfer when off without a hitch.  Only reason I had to step foot in the Verizon store was to transfer the contacts.  Thank you, thank you, thank you.", "Date": "April 19, 2014"}, {"Title": "manual only on line", "Author": "Ann C Smutko", "ReviewID": "R1XSVOMZC8QPR", "Overall": "3.0", "Content": "I know how old I am  \"73\" but I do have trouble without some kind of hard copy that I can hold and read to know just what I am doing with this phone.  I can not get the phone to just ring and it drives me nuts when it goes off.thank you, Mrs Ann Smutko", "Date": "March 5, 2014"}, {"Title": "Good phone for the need", "Author": "Steph", "ReviewID": "R2RLIDG8P58XIF", "Overall": "5.0", "Content": "This is a solidly built QWERTY dumb phone that is perfect for my texting teenager who doesn't have a job to pay for a data plan.  Good used condition.", "Date": "December 30, 2013"}, {"Title": "Was extremely skeptic at first, But Am glad I ordered  it", "Author": "Mr.Colton", "ReviewID": "R35512MSN9669F", "Overall": "5.0", "Content": "I was really skeptic about buying cell phones on amazon because there are not pictures of the items. I bought this phone refurbished because I did not like my lg env touch. It is a great phone. Perfect QWERTY keyboard, good pictures, and a ton of really cool things that you can do to customize it. This phone is perfect for a teenager or anyone who just likes to talk and text.If your skeptic like I was go for it you will not regret it. I would defiantly recommend this to ANYONE", "Date": "December 19, 2013"}, {"Title": "VN250 Phone performance", "Author": "Ralph Hart", "ReviewID": "RXHEO4YCMMOV0", "Overall": "2.0", "Content": "Being a basic phone I expected text, picture, voice communacation and some internet contact. What I did not expect but got anyway was a phone that works most of the time and then just locks up and shuts off.I hope this is just a problem with this phone and not a design problem.I have ordered a replacement of the same model with the expections of no shut offs.", "Date": "December 18, 2013"}, {"Title": "Completely worth the money", "Author": "KS", "ReviewID": "RPM4VKQP1J9C3", "Overall": "5.0", "Content": "All I have to say is wow just wow, I've had this phone for 3 or 4 years now and I'm not a very careful person with my phone, it's been dropped down stairs and thrown on the ground many times and yet the only proof I have of that is the little ding on the corner, I completely recommend this phone to anyone who wants a simple phone, you can text with the key pad on the front which my parents do when they text (we all have to same phone) and I like to use the keyboard and I think it works perfectly fine both ways, it is amazing in my parents mind and in their wallet too! The texting is free and you get a certain amount of time every month to talk on the phone, which is great for a kid who texts all day long! It may not be the \"coolest\" phone in the world and the majority of the time I say I hate my phone but  I don't hate it I just don't think it's a cool as the other kids phones but it's completely reliable and there is only 1 or 2 scartches on the phone when other kids are complaining  they have cracked screens on their iPhones im just sitting there nodding my head and smileing. In conclusion I love this phone to death and it's completely worth it in my book.", "Date": "November 30, 2013"}, {"Title": "Excellent basic call and text phone.", "Author": "Stephen", "ReviewID": "RNQUK0S4M36YV", "Overall": "5.0", "Content": "I recently made the switch from a smartphone to a basic phone. I only needed a phone that made phone calls and sent text messages. For Verizon customers, this phone is an absolute winner. The LG Cosmos VN250 has excellent battery life, clear speaker for talking and easy to use keyboard. I would definitely recommend to anyone who needs a phone for just call and text.", "Date": "November 29, 2013"}, {"Title": "Exactly as advertised.  Great purchase.", "Author": "Treva", "ReviewID": "R24OWW157KY7SE", "Overall": "5.0", "Content": "We were so pleased with this purchase.  It is next to impossible to find a good \"dumb\" phone these days.  Would definitely purchase from this seller again.", "Date": "October 25, 2013"}, {"Title": "Great deal", "Author": "Healing Holistically", "ReviewID": "R1J9DC8LSKTWVS", "Overall": "5.0", "Content": "I was very surprised by the quality of this phone; the screen and keypads are as good as new and the phone is working perfectly.  Battery is solid, holding its charge.  What a great deal.  (And no more data plan, woo hoo!)Thank you!!", "Date": "August 16, 2013"}, {"Title": "good basic phone", "Author": "merle hays", "ReviewID": "RH7TEJRUC0TIO", "Overall": "5.0", "Content": "This phone is a very good basic phone. Has a nice keyboard for bigger fingers and gets great service. Small enough to not be uncomfortable in your pocket.", "Date": "June 17, 2013"}, {"Title": "Phone Died 6/1/2013", "Author": "Quincey Taylor", "ReviewID": "R3PORUFXRZ7JZD", "Overall": "1.0", "Content": "When I recieved phone in January it looked and worked well but after 6 months of usage it died.  Screen just quit on me.  I guess you shouldn't by used phones becasue there must be a reason why they are being sold as used!", "Date": "June 11, 2013"}, {"Title": "Great for my kids...", "Author": "krazylo", "ReviewID": "R22TXTX58VOQW5", "Overall": "5.0", "Content": "I purchased these phones for my pre teens and they are a perfect fit.  They like the keyboard for texting and the phones are very durable.", "Date": "January 9, 2013"}, {"Title": "Did Not Work ... Returned", "Author": "Jaryl K. Day \"Mrs. Jaryl Day\"", "ReviewID": "R3N95PDDQ08HRD", "Overall": "1.0", "Content": "I was glad I made this purchase through the Amazon network as no place in this description did it say it had been \"Repaired.\"  It was described as \"used\", \"good condition\".  But I went through an entire day transferring the service from my LG Cosmos phone (which I was babying due to an accident with cappucino), to this replacement phone to carry me through 3 months to find many of the keys on the slide didn't even work, and it was so slow, even though a new battery was sent, that I couldn't get it to ring before the caller was cut off.  THEN I had to transfer the service back to my original phone.  8 hours that I couldn't afford to waste, not to mention how many calls missed.  I wouldn't go with this seller again, in spite of references, for anything.  Only good part was Amazon backing me, paying for returning the phone, and hopefully, reimbursement.", "Date": "November 28, 2012"}, {"Title": "VERY GOOD ITEM", "Author": "william", "ReviewID": "RX8N0XX5F5VNE", "Overall": "5.0", "Content": "VERY NICE PHONE WORKS GOOD AND LOOKS GOOD  VERY HAPPY OTHER SELLERS SHOULD FOLLOW YOUR LEAD  THANK YOU FOR ITEM AS DECRIBED", "Date": "April 17, 2014"}, {"Title": "Good phone", "Author": "Just me", "ReviewID": "R155MDDBNSR439", "Overall": "5.0", "Content": "I is a little weak as far as the signal strength is for me but just be area in.Overall a descent phone for the price.", "Date": "March 20, 2014"}, {"Title": "Piece of Trash", "Author": "Brandon", "ReviewID": "R3MOVL5LA3GIJK", "Overall": "1.0", "Content": "It said it was in \"Very Good Condition\". When it had come it looked like it had been abused by someone", "Date": "March 19, 2014"}, {"Title": "NICE", "Author": "monkeynutts", "ReviewID": "R1UPPZ921YYNXU", "Overall": "4.0", "Content": "I gave this rating because it was what I thought it would be. The phone works great. I would tell others.", "Date": "March 18, 2014"}, {"Title": "Had issues with phone", "Author": "Terri Potter", "ReviewID": "R3F47JFAW09PUT", "Overall": "1.0", "Content": "I had to return the 1st one because it would not turn on. The company quickly sent me another phone; however we found out that the phone was original sold as a pre-paid Verizon phone so it was not compatiable to my Verizon plan.", "Date": "March 11, 2014"}, {"Title": "=P", "Author": "Morrigan", "ReviewID": "R2H5TV5P7T1JZE", "Overall": "5.0", "Content": "The phone arrived quickly even though it was free shipping which is great.It came clean, in good condition with just a few scratches here and there from what looks to be normal/average use.All of the buttons work well, no lag.I'm happy with it, and definitely recommend these folks to purchase from.", "Date": "March 10, 2014"}, {"Title": "good description", "Author": "Marc Friedman", "ReviewID": "R2JCUTUQTQPTN0", "Overall": "3.0", "Content": "like phone, but hard to text.keys are tiny.packed and shipped well.no scratches.adds are annoying a pain.otherwise like phone for use", "Date": "February 26, 2014"}, {"Title": "compatible with Verizon Share Everything Plan", "Author": "Chloe", "ReviewID": "R3NT2S6I5080V4", "Overall": "5.0", "Content": "The delivery of the replacement phone was prompt and trackable. It was a good replacement for a Samsung Intensity III. It has comparable features. We did not wish to pay the $200+ Verizon would have charged us to replace the phone with them and were happy to find this phone for a more acceptable price. Once the phone arrived we were quickly able to switch phones by contacting Verizon and in a short time were 'up and running'. Everything went smoothly; the most difficult part was hunting through all the options and trying to determine which model would be comparable with our Verizon plan. We are happy with the outcome.", "Date": "February 22, 2014"}, {"Title": "Replaced a busted one just like it.", "Author": "R. Krassa", "ReviewID": "R25ITWGYZC5XA5", "Overall": "4.0", "Content": "This was my first time ordering a used phone off the internet. It was overall a good purchase and I'm using the phone. The description as to condition was accurate, though I know to check my texts for missing \"R\"s on this keyboard. Not a damnable offense and I can deal with it. I like the cosmos and don't want to upgrade on my Verizon plan. $25 for a working phone is a pretty sweet deal.", "Date": "February 12, 2014"}, {"Title": "Replacement phone.", "Author": "Jackleen Roberts", "ReviewID": "RJTRFILBNPWKH", "Overall": "3.0", "Content": "Battery does not keep a charge very long.Phone does show wear and usage.Price was okay. Dissatisfied with battery.", "Date": "February 5, 2014"}, {"Title": "Issues, but not much to expect from a preowned.", "Author": "Cameron Arnold", "ReviewID": "R2GARFEIMDUBJ9", "Overall": "3.0", "Content": "I have a problem charging this phone, aside from that, it's fantastic. It's not the charger either, it's the phone. I have to turn it into the off position and plug it into a computer, it doesn't charge off the wall. But hey, it's preowned, what can I say.", "Date": "February 3, 2014"}, {"Title": "really great deal", "Author": "C. Routh \"purple lover\"", "ReviewID": "R1GA073OD1YXKE", "Overall": "5.0", "Content": "The phone came as described. I had never ordered a used phone off the internet. Was nervous about it but had faith in the Amazon store. All went well with getting the phone set up with Verizon. My old phone was the same kind that I had dropped in water but they were no longer available  from Verizon and I wasn't due for an upgrade and didn't want to pay full price for a new phone. This was a great alternative.  Much cheaper!", "Date": "January 21, 2014"}, {"Title": "BEST BASIC PHONE WE HAVE EVER OWNED!", "Author": "Daisy", "ReviewID": "R1RWKKFD9BV375", "Overall": "5.0", "Content": "This model of phone is almost bullet proof.....not too exciting on the features but excellent durability....L  O  V  E  to have ******* exactly ******** what I think I ordered be exactly what I receive.  **** GREAT SELLER!*****", "Date": "January 20, 2014"}, {"Title": "Excellent way to get new phone with out signing another 2 year contract", "Author": "Diane Peoplesq", "ReviewID": "RYBUXHARXCKLM", "Overall": "4.0", "Content": "Price was good for a new phone I had it sent to my sister in Coloradoas she is hard of hearing and 75 years of age and has to text as can't hear and wantedsame phone she is used to. She hasn't received the phone yet so I rated 4 stars as seems slow deliveryBuying from Amazon saved me having to sign up for a 2 year contract to get a new phone.", "Date": "January 19, 2014"}, {"Title": "Does Not Work", "Author": "holly", "ReviewID": "RHJH3R268X9LX", "Overall": "1.0", "Content": "I ordered this phone to replace one that I had lost, but it was broken when they shipped it.  It was a used phone and some text messages still remained on the phone.  The owner of the phone had texted to her mom that her phone was \"flipping out again\" and apparently malfunctioning.  Exactly the same thing happened to me while I had the phone.  The sellers did not check to see if the phone actually functioned before they sold it to me!", "Date": "January 14, 2014"}, {"Title": "Great Phone", "Author": "Gen66", "ReviewID": "R1Q89U5TA6548X", "Overall": "5.0", "Content": "Bought this phone as a replacement for my hubbys old phone. He is not into all the high tech stuff but does do some texting so this phone has worked out great. No complaints and it worked just fine with Verizon. We transferred all his contacts and he was good to go. He has had it for several months and its still doing just fine.", "Date": "January 13, 2014"}, {"Title": "great", "Author": "Laura Caploe", "ReviewID": "R2GB2ZRFPPDWZ8", "Overall": "5.0", "Content": "This has met and exceeded all of my expectations was able to activate my phone from home. ordered on a saturday and received on monday.", "Date": "January 6, 2014"}, {"Title": "Phone worked less than a week.", "Author": "allison", "ReviewID": "R1LK4WQKSYB099", "Overall": "1.0", "Content": "The phone worked less than a week.  Have had to return it and haven't gotten the replacement phone nor money back to date.", "Date": "January 6, 2014"}, {"Title": "Battery", "Author": "Virginia \"Virginia\"", "ReviewID": "R39W3WTDYP23C6", "Overall": "2.0", "Content": "The battery has a very short life.  I need to charge it frequently.  I like the slide-out keyboard and most of the other physical features.", "Date": "January 3, 2014"}, {"Title": "Fast and Easy Sale", "Author": "Rhonda \"Rhonda\"", "ReviewID": "R1GNXG5TGQ889A", "Overall": "5.0", "Content": "Sale went smooth with seller..  Great phone......easy to use........good fo talking and texting!  I would buy another one if something happens to this one.", "Date": "January 1, 2014"}, {"Title": "Good replacement phone", "Author": "Anne Johnson", "ReviewID": "R18WQEMGTWDR8J", "Overall": "4.0", "Content": "The phone is a good phone, and definitely worth the money I paid for it.  I put my newer phone in water, and destroyed it, so this phone has been a good replacement.  It arrived in a timely basis, with a message from the merchant.  So overall, I was pleased", "Date": "January 1, 2014"}, {"Title": "Dead on arrival", "Author": "BH-Houston \"BH-Houston\"", "ReviewID": "RMVY56L9F6J56", "Overall": "1.0", "Content": "The phone powered up, but once Verizon activated, problem is immediate. No sound can be heard when answering the phone, nor can the other party hear what you are saying. I finally had to connect to a headset before it worked. Switching between speaker or regular mode didn't respond either.Thinking may be I had pressed a wrong button, I checked online to see if there is any solution to this issue. It seems others have had the same issue, but there is no workable solution.On the plus side, since Amazon handled the sale, return was fairly hassle free.", "Date": "December 31, 2013"}, {"Title": "ok", "Author": "Sharilyn Russell", "ReviewID": "R3HHQXGBI9MZ0P", "Overall": "2.0", "Content": "phone was fine just not very good shape ok to use though going to sell it when i find it in box", "Date": "December 25, 2013"}, {"Title": "Great", "Author": "jrc", "ReviewID": "R2ZRWEN1F4YS9D", "Overall": "4.0", "Content": "My son loves this. He lost his last phone and Iwas not going to pay alot for another new phone when the conract will be up in Sep.", "Date": "December 17, 2013"}, {"Title": "Dirty phone", "Author": "Kara1979", "ReviewID": "R2V81FHEHT3WTA", "Overall": "2.0", "Content": "I understand the product was used, but WOW!! The seller failed to mention the battery has a crack in it. Also, the phone was NASTY!! This phone looked horrible!! I ordered this as a Christmas gift for my daughter. I did get it switched over without it being prepaid. Just not happy with the condition of the phone and the dirtiness. There were also saved text messages on the phone, no big deal. But one was about having sex with a llama. Didn't need to read tht. Oh, and the charger is not the right charger.", "Date": "December 16, 2013"}, {"Title": "Didn't work properly", "Author": "adl423", "ReviewID": "R2OJ7IZJJTJXKY", "Overall": "1.0", "Content": "This phone worked fine the first few days.  Then when I would make calls I could not hear the other person and they could not hear me.  This went on randomly for a few days and I decided to return the phone.", "Date": "December 13, 2013"}, {"Title": "as promised", "Author": "LS", "ReviewID": "R21VN9GZRLD7JE", "Overall": "5.0", "Content": "After reading the previous reviews I got a little scared. But both phones activated right away on my Verizon plan ( replacement phones for my kids). Received them super fast, Thanks!", "Date": "December 12, 2013"}, {"Title": "Phone of course", "Author": "Ted Okan", "ReviewID": "R207ZPJIUE4PRR", "Overall": "5.0", "Content": "Imwanted a phone for years but my dad won't let me sp hopefully if I show him this note plus page. He will get me one", "Date": "December 11, 2013"}, {"Title": "I like it but...", "Author": "marge rau", "ReviewID": "R1J1GCJF1S0GGC", "Overall": "4.0", "Content": "Had owned one previously so knew what to expect.  Like bigger keyboard. On this particular unit there are several keys that do not respond immediately so it  leaves letters out of what I am typing.  I may get the letter after I hit the key several times but it sure messes up the fluidity of typing.  I did not have this problem with my previous unit.", "Date": "November 22, 2013"}, {"Title": "Good phone but dead battery", "Author": "Mark Lampe", "ReviewID": "R336Z6S7JIGWSC", "Overall": "4.0", "Content": "I like the phone very much (decent dumb phone) but the battery was dead and could not be charged.  I had to purchase a new one to make the phone work.", "Date": "November 13, 2013"}, {"Title": "phone", "Author": "MARY BUTLER", "ReviewID": "R1RG8KWL8X08MR", "Overall": "3.0", "Content": "Still working on the key board there are a couple of the letter that do not work.  It is fine with me as I do not use them a lot anyway.", "Date": "October 26, 2013"}, {"Title": "Charger malfunction", "Author": "Tsereng", "ReviewID": "R2B42GRZLO0U2S", "Overall": "2.0", "Content": "have had difficulty with charger, get error message each time I try to charge it to check that this is the correct charger for the phone.  Will contact Amazon for steps to take to correct the problem", "Date": "October 25, 2013"}, {"Title": "CHEAP AND FAST", "Author": "Delois Taylor", "ReviewID": "R1HJYO59PCY1VE", "Overall": "5.0", "Content": "I needed  a phone and decided to by this because it was cheap and fast. i didnt want anything fancy", "Date": "October 20, 2013"}, {"Title": "Great phone for an older model phone", "Author": "Stephanie Gentle", "ReviewID": "R36Q6BCH7EB2AW", "Overall": "4.0", "Content": "This is a great phone for someone that is not interested in a smartphone. It is simple to use and has a keyboard.", "Date": "October 14, 2013"}, {"Title": "IT'S A NICE PHONE", "Author": "Charles M.", "ReviewID": "R3H41WRFPPZ92Y", "Overall": "3.0", "Content": "It met my needs for a cell phone.  I find it very easy to use without having to do a lot of studying.", "Date": "October 13, 2013"}, {"Title": "Terrible", "Author": "Courtney", "ReviewID": "R1YPJ0LDBBORZU", "Overall": "1.0", "Content": "Bought this and couldn't use the phone because my wireless provider said it was a STOLEN PHONE. Not good service.", "Date": "October 9, 2013"}, {"Title": "Cell phone", "Author": "Jill Darling", "ReviewID": "R1JWRRETB3L49F", "Overall": "4.0", "Content": "The cell phone was as advertised but the brand new charger is not the right charger. It still works but i get a message across my screen that its not the right one and might not charge fully.", "Date": "October 8, 2013"}, {"Title": "not a fan", "Author": "Stephen Engelhaupt", "ReviewID": "RKB41FWME9CEG", "Overall": "1.0", "Content": "This phone fell apart on me as soon as I got it.  I ended up using the same phone as I had before.  $60 wasted", "Date": "October 7, 2013"}, {"Title": "It worked like new", "Author": "Chris", "ReviewID": "R1ITKPXEXHH9X9", "Overall": "5.0", "Content": "It worked like new. The only thing is that it does not seem to hold a charge very well but I have a car charger so this is never an issue for me.", "Date": "October 2, 2013"}, {"Title": "Basic Phone", "Author": "Brandy", "ReviewID": "R1SJSVPIKF2OPS", "Overall": "5.0", "Content": "I'm delighted to have a basic phone since I don't need to retrieve email by phone.  The slide keyboard is perfect because I like using real keys.", "Date": "October 2, 2013"}, {"Title": "GREAT PHONE TO HAVE", "Author": "SHIRLENE THOMAS", "ReviewID": "R32DDT80AOPVM5", "Overall": "5.0", "Content": "Perfect for me because I can talk and text with ease.  Also it has a lot of great features.Great", "Date": "September 26, 2013"}, {"Title": "This phone was NOT NEW!", "Author": "W. I Lucero \"Mountain  Mama\"", "ReviewID": "R2QR7DT1C5R1F4", "Overall": "1.0", "Content": "I paid almost $70 for what they said was a NEW phone and it came in the box all nicely wrapped. I have had nothing but problems with it not working properly. I thought that was odd since it was supposed to be new. Then the paint scratched off and exposed different colors beneath. Now I had proof the phone was never a new phone. The company I bought from is a bunch of scammers trying to charge top dollar for refurbished phones that don't work well.", "Date": "June 8, 2014"}, {"Title": "I don't like this phone at all.", "Author": "Jane Clark", "ReviewID": "R2ENTK7FF89RRQ", "Overall": "1.0", "Content": "Letters and numbers so close, I either hit 2 or the wrong one.  2 steps required to \"unlock\" phone.  It's heavy.  I went for the cheapest, and you get what you pay for.", "Date": "June 7, 2014"}, {"Title": "Basic Phone", "Author": "Razor", "ReviewID": "R2OT5IQNJ8VQXA", "Overall": "5.0", "Content": "Sturdy basic phone. I know exactly what to expect from it and it's very easy to navigate. Excellent for older people and those of us who hate touchscreens.", "Date": "June 6, 2014"}, {"Title": "basic.", "Author": "Edgardo Esparza", "ReviewID": "R28GI1NMQLTAS5", "Overall": "3.0", "Content": "It's a decent basic phone that worked great for what I needed it for. But it is a rather old model, and being the careless person that I am, a couple bad drops did do it some damage. The silver button nearest the screen fell off and my cam lens got scratched rather quickly.", "Date": "June 5, 2014"}, {"Title": "Not very satisfied", "Author": "Michelle Balogi", "ReviewID": "RI4P0HZJPGPR2", "Overall": "2.0", "Content": "Sometimes the messages I send get erased automatically.  The screen gets a dark background on the texting screen, and I only have had it for about a month. Not very satisfied", "Date": "June 4, 2014"}, {"Title": "Sold a bill of Goods - junk", "Author": "ahw", "ReviewID": "RLV8LSA1Q89CQ", "Overall": "2.0", "Content": "Item arrived on time.  Phone looked good.  HOWEVER, the battery would not charge using the phone.  The charging mechanism in the phone DOES NOT work.  What good is it if the battery won't charge...the phone is a piece a junk. Very disappointing.  RAting shold really be a 1", "Date": "June 1, 2014"}, {"Title": "Cosmos", "Author": "Susan Culp", "ReviewID": "R6PHDOU0C4DV0", "Overall": "3.0", "Content": "The phone looks great bit two of the buttons on the slide out you have to push multiethnic times to work properly", "Date": "June 1, 2014"}, {"Title": "Received Water Damaged Phone", "Author": "Amazon Customer \"debbiekjack\"", "ReviewID": "R38BLSWG54J3BH", "Overall": "1.0", "Content": "I purchased this phone for my mom for Christmas and she waited until the end of January to activate it. Once activated it didn't fully keep a charge and she was constantly charging it. Then it stopped charging all together and she couldn't even turn it on. My dad purchased another battery thinking it was the battery but it still didn't work. While at Verizon purchasing another phone to replace this defective one, the Verizon sales person said there is a chip in the phone that can prove that the phone has been damaged. The chip was so hard to find because of the extensive water damage this phone had. They likened it to having been submurged in water. Because we were out of our 90 day window for return there is no recourse with Battery Assault. They don't even acknowledge the water damage, but keep telling you their return policy and apologizing. I wouldn't purchase anything with this seller again. Not very customer friendly company and they are selling damaged and defective products.", "Date": "May 28, 2014"}, {"Title": "Lg Comos", "Author": "monica johnson", "ReviewID": "R2DAQ5ZWOJAKDW", "Overall": "5.0", "Content": "The Comos was just what I was looking for after my phone was stolen.  I had no problem getting Verizon to activate the phone.  It did take a little longer  than I anticipated so  I will advise to get the express shipping?  Right now I need to find a inexpensive case.  Great product overall.", "Date": "May 27, 2014"}, {"Title": "Lots of use", "Author": "JD", "ReviewID": "R17G6ENVCP8CTD", "Overall": "5.0", "Content": "This has held up to multiple falls and the key board is just large enough for my clumsy fingers. Working out great", "Date": "May 24, 2014"}, {"Title": "defective software on my model", "Author": "Glenda C.", "ReviewID": "RDSG9I3F81V5", "Overall": "1.0", "Content": "I was unable to have software loaded by computer, phone or in the store. I had to mail it off for a refund.", "Date": "May 23, 2014"}, {"Title": "cell phone", "Author": "nancy williams", "ReviewID": "R6CY68CGIJZGB", "Overall": "1.0", "Content": "It must be a bad refurb. It shorts out. It is unreliable. It has never worked properly. I would not purchase another.", "Date": "May 21, 2014"}, {"Title": "LG Cosmos Verizon phone", "Author": "joann ragan", "ReviewID": "R2VPP6GWV64JJI", "Overall": "4.0", "Content": "The LG Cosmos is just what it is supposed to do . It is great for text messages.It is somewhat small and the back cover sometimes comes off to easily.It was a good price for the phone.", "Date": "May 15, 2014"}, {"Title": "Works beautifully", "Author": "Christian Psychiatry", "ReviewID": "R1D8R80IL2RFTS", "Overall": "5.0", "Content": "Looks and works great. Would recommend to anyone. No difficulties on  turning it on with our existing phone line with Verizon.", "Date": "May 13, 2014"}, {"Title": "It almost worked for me.", "Author": "D. E. Keith", "ReviewID": "ROV1MWV787NMM", "Overall": "3.0", "Content": "I bought this cell phone (used) for my niece, but unfortunately I had to return it. Although we liked the phone, we couldn't get the battery to function properly. I had to return this one only to buy a brand new one from Verizon. So far, the upgraded version is  holding up nicely.", "Date": "May 6, 2014"}, {"Title": "already quit working", "Author": "Daniel J. Welsh", "ReviewID": "R2204SQZTMQ43Q", "Overall": "1.0", "Content": "I haven't had this phone for a week and the screen already went black. I had to go to Verizon and get me a new phone because I need my phone, done buying phones from Amazon.", "Date": "May 5, 2014"}, {"Title": "Love it!", "Author": "Mary Lou Schneider", "ReviewID": "RQTIVFWO9NNH", "Overall": "5.0", "Content": "I bought this phone because it is easy to use.  I didn't want a complicated phone and this is just perfect.  For me it gets the job done.  It's nice for an older person who needs just the basics.", "Date": "May 5, 2014"}, {"Title": "Can't Hear Voice - Device Defective", "Author": "John E Morris", "ReviewID": "RC0B5GBBUSHH1", "Overall": "1.0", "Content": "Bought this phone for our son to use for basic text and voice.  Texting works fine, but voice does not work at all.  This device is defective and we have been attempting to reach the seller to return.", "Date": "April 11, 2014"}, {"Title": "No charger came with phone", "Author": "Lynette D Ellis", "ReviewID": "RRWPO99TXGXVX", "Overall": "4.0", "Content": "The phone was in good condition. but no charger came with it which I was expecting.  Other than that it was decent.", "Date": "April 10, 2014"}, {"Title": "Great Phone!!!", "Author": "ARLENE", "ReviewID": "R18HD5ROCMDYST", "Overall": "5.0", "Content": "Husband is very happy with this phone and it was easy setup, I could not find the serial number and e mailed Apple wireless in less than five minutes they responded with the answer, it was under the battery. Just like it was posted!!! I will buy from them again....", "Date": "March 30, 2014"}, {"Title": "phone didnt work", "Author": "linda a lopez", "ReviewID": "RJNJXLCC8G00A", "Overall": "1.0", "Content": "the phone is defective cant use.im very dissapointed.i have to find out where to send it back.wish someone would of checked it first.", "Date": "March 27, 2014"}, {"Title": "Not bad", "Author": "Chris311", "ReviewID": "R29G8ZBPJWFZ1E", "Overall": "3.0", "Content": "Average inexpensive phone.  Okay for text and talk.  Does work as advertised. Shipping was fast and everything came with it as advertised.", "Date": "March 27, 2014"}, {"Title": "Great Company", "Author": "Chandi M Fields", "ReviewID": "R1E7KC0GAC72F2", "Overall": "4.0", "Content": "I ordered the phone and the battery didn't last very long.  I contacted them and they resolved the problem quickly.  I wouldn't mind going through them for another phone.", "Date": "January 6, 2014"}, {"Title": "it works as good as my old one did", "Author": "Bill Karnes", "ReviewID": "R3O5O2LNRYB7WQ", "Overall": "4.0", "Content": "It works like my old one did but could have more ring tones. I think you can down load more tones I think", "Date": "October 2, 2013"}, {"Title": "Excellent Condition And Price.", "Author": "Amazon Customer", "ReviewID": "R13D417X4AB3CO", "Overall": "5.0", "Content": "The phone is in excellent condition and even came in a seeming my original box with a charger. Battery good as well.Activation took an entire 45 seconds. Fantastic deal!", "Date": "September 21, 2013"}, {"Title": "Breaks to easy", "Author": "Ryan", "ReviewID": "R2QST352VCZ35L", "Overall": "2.0", "Content": "Hated it due to the fact that the back of it isn't actually a border but more of a plastic thing that cracks when it looks bad, just not a good phone look for a new one not this one", "Date": "September 19, 2013"}, {"Title": "very good phone", "Author": "robert ebers", "ReviewID": "R2O58R1OUKRG7N", "Overall": "4.0", "Content": "this is the second one that i've had. easy to use and comfortable in my hand. easy to use keyboard.", "Date": "September 18, 2013"}, {"Title": "Works Great after 2 Months", "Author": "HP 6110", "ReviewID": "RZ95405CL3ZWL", "Overall": "5.0", "Content": "Great Works Great after 2 Month love the easy way it didn't need to add term contract Worked with me", "Date": "September 16, 2013"}, {"Title": "I am totally satisified with my phone", "Author": "Elizabeth Whitenight", "ReviewID": "RMIW1A0BTB6AY", "Overall": "5.0", "Content": "I am very pleased with my new phone. After I dropped mine in the lake and called Verizon and they told me this same phone would be $250.00 (had no insurance) and I saw this on amazon I wanted to order it. At first I was a litter skeptical because of some reviews saying it was prepaid only. I needed a contract phone. so I took the chance and ordered it and I am very happy with my order. when the package came and opened it the battery was in a separate package and I was able to go to my Verizon account and switch phones over and this one started working instantly. Had no problems at all. I love this phone it is just like my old one but a little bit newer.", "Date": "September 16, 2013"}, {"Title": "Unhappy", "Author": "Keep looking", "ReviewID": "R4DSV3GMT7K5B", "Overall": "1.0", "Content": "This phone was delivered in a very timely manner. Looked new in appearance. Version was very heplful in activation. Only problem is you cannot hear on this phone. If all i wanted was for my kids to be able to text this would be perfect. The hearing or lack of neing able is a definite problem. Do not buy this phone. Keep shopping.", "Date": "September 10, 2013"}, {"Title": "Great replacement phone", "Author": "Tom Connelly", "ReviewID": "R2PJKOXMRZMIT4", "Overall": "5.0", "Content": "The phone was delivered promptly. It works well and was very reasonably priced. Thank you! This was a great alternative to an expensive one.", "Date": "September 5, 2013"}, {"Title": "LG Cosmos vn250 verizzon phone", "Author": "PHYLLIS", "ReviewID": "R9J2X50K17PTE", "Overall": "5.0", "Content": "I loved this phone but the pick up & go price was to expensive every month. I would like help to sell it or to be able to send it back. I have a different company now.", "Date": "September 4, 2013"}, {"Title": "Great product", "Author": "Kenneth D.", "ReviewID": "R2ME6QJZRH5U1M", "Overall": "4.0", "Content": "Satisfied with order.  Goes well with her Ipod,  Can say more about how satisfied I am with this order.  Hurray!!!!!", "Date": "September 3, 2013"}, {"Title": "Great Buy.", "Author": "seehere", "ReviewID": "RA0AV3MZC6KCC", "Overall": "5.0", "Content": "These were a great buy for my teenage sons.  They work great and they like them too.  Mind you they arn't smart phones so you don't have to have the data package but they can text with them.", "Date": "September 2, 2013"}, {"Title": "Great Phone", "Author": "Amazon Customer", "ReviewID": "R1OLJ6U5HYR9C7", "Overall": "5.0", "Content": "Excellent condition, as new. It was the replacement phone I needed to get.  I liked my old one and wanted to replace it with a duplicate.", "Date": "September 2, 2013"}, {"Title": "Phone is great value", "Author": "Kim E. Smith", "ReviewID": "R1S3FCS4BS6JA2", "Overall": "5.0", "Content": "dropped older Cosmo in bucket of water and \"killed\" it.  Went to Verizon and because I didn't have insurance, they told me it would cost $300 to replace it.  Well, thank heaven's for Amazon!!!  Purchased new phone under $70 bucks and works great!  Thank you Amazon!!!", "Date": "August 30, 2013"}, {"Title": "Correcting Earlier Review", "Author": "Fred J. Uzzell", "ReviewID": "R1LLNO1SJVCVY6", "Overall": "5.0", "Content": "This phone turned out to be slightly smaller than the LG Cosmos phone it replaced but the functionality was excellent.  I was particularly pleased with the merchandise provider as they were able to respond to all my questions in a very timely and efficient manner.  I would not hesitate to do business with them again.", "Date": "August 28, 2013"}, {"Title": "This is a PREPAID phone", "Author": "steph jespersen", "ReviewID": "R13ZMBVCHLXVGX", "Overall": "1.0", "Content": "This is a PREPAID phone. Verizon told me they cannot connect this phone to my contract for six months. This is a prepaid phone pure and simple and it even says so on the box.  The item description  tries to tell the customer that this phone can be used as a replacement for a lost phone. It is not true.  the sales copy here is misleading and borders on fraud.Do not buy this phone.", "Date": "August 27, 2013"}, {"Title": "LG Cosmos VN250 Verizon Phone", "Author": "Chelsea Bailey", "ReviewID": "RKXSZAWT43OCU", "Overall": "1.0", "Content": "This phone is horrible. The keyboard doesn't work, a bunch of buttons are broken, the phone randomly shuts off and the charge doesn't work.", "Date": "July 26, 2013"}, {"Title": "Bought 3", "Author": "AzRedShoe", "ReviewID": "RVATX16ZVC8J3", "Overall": "1.0", "Content": "I bought three for my family and they didn't change over when they came in. One fell apart another the key pads on left won't work. None were abused or even dropped. Buyer beware.", "Date": "July 26, 2013"}, {"Title": "Nice phone", "Author": "Sue Case", "ReviewID": "R1QSJ70E0MQOW6", "Overall": "4.0", "Content": "It seems to be a very nice phone. It's not the phone I ordered but I am going to keep it anyway.", "Date": "July 26, 2013"}, {"Title": "No frills", "Author": "Gary Langdon", "ReviewID": "R1TU3CHTAQ8KFE", "Overall": "4.0", "Content": "For stepping down from a Smart Phone this one is really good. I wish the keys were larger because I have fat fingers but I got around that by using a golf tee.", "Date": "July 20, 2013"}, {"Title": "Not completely satisfied", "Author": "Phyllis Garofalo", "ReviewID": "R3FU2TCO8RV6P2", "Overall": "3.0", "Content": "This is a good phone, but it does not have updated software so I was unable to transfer certain things.", "Date": "July 19, 2013"}, {"Title": "No sound", "Author": "Veronica Velasco", "ReviewID": "R19SGTGFASY2YE", "Overall": "1.0", "Content": "I ordered this phone and once I started using it, I realized the sound didn't work. I asked for a return and was told I couldn't because that was on the description. But it's obviously not, I don't suggest buying from this seller.", "Date": "July 16, 2013"}, {"Title": "It is what it is", "Author": "sheri", "ReviewID": "R1J6N8DQJP1G4T", "Overall": "3.0", "Content": "It's not a bad phone. It's just that once you've had a smart phone it's really hard to go back!", "Date": "July 14, 2013"}, {"Title": "Be careful when buying used.", "Author": "buyer", "ReviewID": "RLIWD3BOLOGW1", "Overall": "1.0", "Content": "I bought mine used. The condition on it was listed as very good but that is not what I got. The phone has some moderate scratches and scuffs which is what I expected. However, the phone buttons almost never work and the screen will flash white constantly over half the time when you power the phone on. This makes using the phone almost impossible. If you want to get this phone it might be better to buy new. The seller I bought from had a 90% approval rating so I thought the description would be truthful. When I asked for a return they were pretty rude about it and were unclear on what they would do for me. They said I will recieve a new phone but didn't specify if I need to send the current one back or not. I will update this review when I find out if they are going send me another faulty product or not. I was very unhappy with my purchase.", "Date": "July 10, 2013"}, {"Title": "LS Cosmos VN 250", "Author": "Dan \"Dan\"", "ReviewID": "RSXDDER3Y4XIJ", "Overall": "4.0", "Content": "The Cosmos VN 250 meets my requirements as I have no need for a smart phone.  I like the Qwerty keyboard for texting and tactile feel of the keys.  I use the phone primarily to text and only an occasional call.  The LG Cosmos has long battery life, allows me to take and send an occasional photo, and I recently purchased a memory card that allows for additional storage of photos.  I have resisted migrating to a smart phone.  Anyone that requires smart phone capability would be better off with a Galaxy or Iphone.  I am choosing to keep my life unencumbered for now.", "Date": "July 6, 2013"}, {"Title": "DON'T BUY", "Author": "Stina-bou-bina", "ReviewID": "R1W71160KOPNRS", "Overall": "1.0", "Content": "This phone was horrible... The keys on the keypad would stick or not even work at all. When I tried to exchange it for a new one I was told I had to send that one in first... In some ways I understand that but since we had already switched service to this phone that would have left my husband who works 3 nights out of town a week without a phone so we never returned it.", "Date": "July 6, 2013"}, {"Title": "1 month", "Author": "frank bautista", "ReviewID": "R11BEHIROTTV31", "Overall": "1.0", "Content": "this phone broke within a month, phone turns on but screen is blank maybe i needed to buy a phone", "Date": "July 1, 2013"}, {"Title": "It's OK.", "Author": "Lise Champagne", "ReviewID": "R82M7QMHY858Z", "Overall": "3.0", "Content": "The phone is ok, but the worse part the letters are a little off and it makes typing difficult to to mention you need to press really hard on every letter to type.  Not liking this part at all.", "Date": "June 14, 2013"}, {"Title": "Didn't work well", "Author": "mlma \"mlma\"", "ReviewID": "R3IK2RDRSRFX6C", "Overall": "3.0", "Content": "This phone did not work well from when we first got it.  One of the letters never worked, and it kept turning off and on.  The turning off and on did get better, but never to where it should have been.  This is the second Cosmos we had.  The first one we had for two years, and it worked fine.", "Date": "June 3, 2013"}, {"Title": "Nice Phone", "Author": "kjgtg", "ReviewID": "R55YD37157BJ2", "Overall": "4.0", "Content": "This phone is a great phone for kids in middle school. I have had it for almost four years and only little scratches have shown up from dropping it. You can have up to over 130 pictures, without a memory card, too! I recommend it to someone who will only text, call, or listen to music or pay WIFI games.", "Date": "May 29, 2013"}, {"Title": "its okay", "Author": "Chasity", "ReviewID": "R1V7AGFQ3C7T24", "Overall": "3.0", "Content": "well I don't feel that amazon is at fault on the phone it was in great shape and a good deal. The phone cuts off on its own a few times a day or when texting. It has not had any damage  caused", "Date": "May 27, 2013"}, {"Title": "Not impressed", "Author": "Dawn Gerardi", "ReviewID": "R2ESIBFKX6HK1P", "Overall": "3.0", "Content": "Phone works but not as good as I thought it would considering sellers rating. There are issues with charging the phone. The charger included would not work. I had to give my daughter my blackberry charger so she can charge phone. Phone doesn't hold charge very long. Description said phone is new, however must be refurbished. I am very disappointed. Returns are only valid for unopened items so I guess I'm stuck with it.", "Date": "May 22, 2013"}, {"Title": "Awesome", "Author": "Beau DIttberner", "ReviewID": "R1ZNV25P1GUESI", "Overall": "5.0", "Content": "Works great. Good service data fast messaging Facebook and more then I wanna post. I d buy it again anyday", "Date": "May 20, 2013"}, {"Title": "Had to replace a phone", "Author": "Lisa", "ReviewID": "RW1I64X8EOWUX", "Overall": "3.0", "Content": "It's okay, it's backwards from the one we bought at Verizon, however it got soaked at an event and needed to replace.It's been acting up and we've not had it a year, so we'll get to purchase another piece of junk from a secondary source as we still have to get through our lovely contract before we can replace it with something better.**Not always as they appear!", "Date": "May 12, 2013"}, {"Title": "Fine phone", "Author": "Lori J", "ReviewID": "R3OP03GHPBSFYF", "Overall": "4.0", "Content": "I bought this to replace my husband, which was the same make and model, just wore out I guess.  It has worked just fine since we got it and I would recommend it to anyone who likes the slide out phone.  The camera is actually really good, with more features than on most phones of this kind.", "Date": "May 9, 2013"}, {"Title": "So Kool!", "Author": "sarah merickel", "ReviewID": "RDVY173V00LOD", "Overall": "5.0", "Content": "Came in the box brand new as advertised! Came early! Works super good.... it's a cell phone and it was easy to add to my account", "Date": "May 3, 2013"}, {"Title": "LG Cosmos VN250", "Author": "zinha", "ReviewID": "R2XGCPRXD9QII6", "Overall": "2.0", "Content": "The item I purchased and had to return was not in the condition I had expected it to be.  It was a gift for  my young child to use to text me and I couldn't even see the letters due to heavy prior use.  This information was not specified anywhere before purchasing.  I hope it was an honest mistake.", "Date": "May 1, 2013"}, {"Title": "Nice Phone", "Author": "Jenn", "ReviewID": "RA5N3EA8VFW6L", "Overall": "5.0", "Content": "This was a replacement phone for my daughter. It was received in a timely manor and works well. I would recommend this phone.", "Date": "April 25, 2013"}, {"Title": "It stopped working after a month", "Author": "cynthia freeman", "ReviewID": "R2KWTTIUKLE3U5", "Overall": "1.0", "Content": "I bought this product for my daughter at christmas and it stopped working after a month of use. The screen went upside down and frizzeled out.", "Date": "April 12, 2013"}, {"Title": "presses buttons by itself", "Author": "wendi", "ReviewID": "R15O01107VAO5", "Overall": "1.0", "Content": "this phone seemed to be fine at first. it dials numbers randomly. i would say it is a defective item that was returned and resold. ugh.", "Date": "April 5, 2013"}, {"Title": "don't work right", "Author": "Deb Hopkins", "ReviewID": "R86HF3Y7N2UCI", "Overall": "2.0", "Content": "This is supposed to be a NEW phone.  You can only talk using the speaker.  Not happy with it at all.", "Date": "April 5, 2013"}, {"Title": "Better than expected", "Author": "lorena", "ReviewID": "R1M558UAR8GF0H", "Overall": "4.0", "Content": "For the price, this is an amazing phone. My son loses or breaks his phone every couple months. This was absolutely worth the money, no issues, shipping was fast. Even came with a charger!", "Date": "March 31, 2013"}, {"Title": "Not a great choice", "Author": "Kate", "ReviewID": "R1P36RKQP6Q2NU", "Overall": "2.0", "Content": "I have been using this phone for more than six months. While the keyboard is great for texting, this phone has a number of problems. Calls drop out for no reason (the call timer keeps going but the caller is cut off). After the ring when a call first comes in (and is missed), there is no audible notification that a call or text message has been received. So, unlike other phones, you have to check often to see if a call or text has been missed (checked settings but couldn't find a solution). Messages left by callers do not consistently appear in the voicemail box right away. The function keys are small and it's easy to hit the wrong button. Signal reception is much worse for this phone than for other phones at the same location, even phones of carriers that don't serve this area. An annoying advertisement re. a Verizon data service appears when I am trying to use the phone/access voice mail, and it has to be cleared before I can proceed. (The rep at the local Verizon store was useless when I asked how to make this screen stop appearing.) Finally, odd icons appear on the bottom of the screen where you see the calendar alerts, message alerts, etc. - have no idea what some of these symbols mean, and scrolling through all of the phone's functions did not help, so it's not the most intuitive phone.", "Date": "March 29, 2013"}, {"Title": "Good phone", "Author": "Emma Kettler", "ReviewID": "R2Z7NWIKX7E6W0", "Overall": "4.0", "Content": "I really like this phone because it is simple and easy to use. It isn't anything fancy but it serves its purpose well!", "Date": "March 28, 2013"}, {"Title": "cell phone", "Author": "Dan", "ReviewID": "R9GCL87WDHBSZ", "Overall": "5.0", "Content": "I have one like it and it stoped working so had to get another one and didnt want to sign up for another 2 years but love this phone", "Date": "March 28, 2013"}, {"Title": "good condition and quick delivery", "Author": "Paul Reiss", "ReviewID": "RLXWAHHMHMMXZ", "Overall": "4.0", "Content": "The phone arrived earlier than expected.  Good condition.  Even the battery holds a decent charge.  It was easy to activate with Verizon.  The sliding keyboard sticks a little.  This appears to be the only negative.", "Date": "March 28, 2013"}, {"Title": "no reception", "Author": "Tracy McKee", "ReviewID": "RFMRRBK0C1FK4", "Overall": "2.0", "Content": "I bought this phone for my son, but this phone gets absolutely no reception.  We are all verizon customers in the house and this phone will not work unless he is out side the house or very close to a window.", "Date": "March 26, 2013"}, {"Title": "eh", "Author": "Tiffany Rathman", "ReviewID": "R3U1OXK9KARPWF", "Overall": "3.0", "Content": "This didn't come with a charger and we ordered one and it still doesnt work. My advice go to a store and get a new one.", "Date": "March 22, 2013"}, {"Title": "LG Cosmos Verizon Phone", "Author": "Alex", "ReviewID": "R14IPLL39JVRBG", "Overall": "4.0", "Content": "This phone is very low priced and is a good phone as Ive had this previously and it was an okay phone.", "Date": "March 18, 2013"}, {"Title": "poorly made", "Author": "danny hammond c/o framestyles usa", "ReviewID": "R3F9OIZCS3JFX8", "Overall": "1.0", "Content": "had lots of problems with 2 of these phones. a b c d e f g h i j k l", "Date": "March 18, 2013"}, {"Title": "Good Phone for texting", "Author": "bb968", "ReviewID": "RQLIC228YOJC2", "Overall": "5.0", "Content": "My wife has enjoyed this phone.  Only problem is that it does not work well after it has been tumbled in the washing machine.", "Date": "March 13, 2013"}, {"Title": "Very pleased with this phone", "Author": "Laura C Turner", "ReviewID": "R2COSLPQA6ZHUZ", "Overall": "5.0", "Content": "We ordered this cosmos phone to replace an old one we gave our daughter that stopped working.  It arrived in its original packaging just as described.  It was \"unlocked\" and there were no complications when I took it in to our Verizon store to connect it to our account.  Very pleased with the cost as something similar new from Verizon would have cost me around $200.  This is a strong phone.  It held up to a lot of wear and tear from my husband for 3+ years.  Hopefully this replacement will last that long too.", "Date": "March 11, 2013"}, {"Title": "Rating on phone", "Author": "Micah Kitchens", "ReviewID": "R17QRTFPMA1CGK", "Overall": "3.0", "Content": "I dont like the buttons. They are too small for big fingers and everytine I try to answer I press other buttons and end up hanging up on people.", "Date": "March 7, 2013"}, {"Title": "DO NOT BUY THIS PHONE", "Author": "juline", "ReviewID": "R1Z3QHV4YRDQJ7", "Overall": "1.0", "Content": "S***tiest phone ever. I went through five of them within the course of six months. Every time I got a new one after a few weeks it would do this thing where the screen got all fuzzy and white then would just eventually stop working all together. Super glitchy and s***ty battery life. If you drop it once its screwed up even with a case on. Absolutely do not recommend this phone to anybody. Do not waste a cent on buying this. Save yourself.", "Date": "March 6, 2013"}, {"Title": "OK for a Basic Phone", "Author": "Jim", "ReviewID": "R2SIYEABX8ISIB", "Overall": "3.0", "Content": "This is my 4th LG Cosmos VN250.  Good little basic phone.  Love the slide-open full-feature keyboard.  Signal strength & reception is good.  Battery life is great.  Speaker volume and clarity are marginal.  Don't plan on taking very good pictures with the camera.", "Date": "March 6, 2013"}, {"Title": "great phones", "Author": "N. Goodson \"WNGFARM\"", "ReviewID": "R3Q8YU3TA3WZWV", "Overall": "5.0", "Content": "Bought me one and my daughter one. These phones don't require that I pay extra for media services. There fore they saved me 20 dollars on my phone bill.", "Date": "February 23, 2013"}, {"Title": "Okay phone", "Author": "Andres Mejia Jr", "ReviewID": "RIW7HHV59GR95", "Overall": "4.0", "Content": "I bought this phone for my wide and I ended up with it. My wife got the same phone but new from the phone company when her old cell began to malfunction. I lost my iPhone and to avoid paying over two hundred dollars I kept this phone. I had some issues with it and the seller exchanged it for me at no cost, he was awesome! Now I'm using the phone with no problems. I still miss my iPhone and can't wait to get my iPhone 5.", "Date": "February 6, 2013"}, {"Title": "LG Cosmos VN250 Verizon Phone", "Author": "Ram Fan", "ReviewID": "R1W9B00SHXGZ06", "Overall": "5.0", "Content": "Great phone, great price.  Purchased as a starter phone for my son.  Calls /text well.  No need for smart phone at his age... this goes for most folks as well...great deal.", "Date": "January 13, 2013"}, {"Title": "Good Phone", "Author": "Elizabeth", "ReviewID": "RNNV9G3O54WRX", "Overall": "3.0", "Content": "I would recommend for anyone who needs a phone, it arrived within a few days which is necessary if your phone is broken. Screen did go black for a day after only about a month, but it is working fine now. Definitely a good, simple, phone", "Date": "January 11, 2013"}, {"Title": "Great Price", "Author": "victoria brown", "ReviewID": "RY8RPU2S1IMYD", "Overall": "5.0", "Content": "Looked all over the place to replace my daughters broken phone.Just needed to findaa verizon that wasn't super expensive.Great price.", "Date": "January 7, 2013"}, {"Title": "Works great!", "Author": "Kent", "ReviewID": "R15S0UL79WBERG", "Overall": "5.0", "Content": "This is a great phone and works well for whatever I do..I could've sworn to myself I already commented but what the hell. :)", "Date": "January 6, 2013"}, {"Title": "phone", "Author": "Kim", "ReviewID": "R29KZXR3HJRWG9", "Overall": "5.0", "Content": "Excellent buy and fast shipper looks like a new phone and takes great pics will buy again with no doubt", "Date": "January 4, 2013"}, {"Title": "Good phone", "Author": "Razzmatazz", "ReviewID": "R2V67BLWNO4VCV", "Overall": "4.0", "Content": "We liked the phone, it's a good price and seems to work really well.  Not much of an internal memory but otherwise a nice phone.", "Date": "January 2, 2013"}, {"Title": "LG Cosmos", "Author": "Joyce Macknauskas", "ReviewID": "R3GPMO3JKBY3DB", "Overall": "3.0", "Content": "It works fine and I like being able to text....It is not as savvy as the new phones with touch screen etc.", "Date": "December 12, 2012"}, {"Title": "great phone for basic plan", "Author": "Toby Gates", "ReviewID": "R35UWCGX9LANH3", "Overall": "3.0", "Content": "keys are kind've small and tends to constantly turn to voice command mode due to button sticking out.  Makes great calls and keypad and buttons are tough. good battery life.", "Date": "December 12, 2012"}, {"Title": "LG Cosmos Verizon Phone", "Author": "Griselda White", "ReviewID": "R24HGHHOGUR75N", "Overall": "5.0", "Content": "This phone surpassed my expectations. The phone is new; I love the phone. It also arrived sooner then I expected.", "Date": "December 10, 2012"}, {"Title": "Great little durable \"dumb\" phone", "Author": "A. Thaxton", "ReviewID": "R1E585Y6OL53M5", "Overall": "5.0", "Content": "This phone is perfect for my child's basic texting and calling needs. This is an easy to use and durable slider with a great keyboard for texting.", "Date": "December 6, 2012"}, {"Title": "Used  -  LG Cosmos VN250", "Author": "Robert G. Bloom", "ReviewID": "R12Z0DGGMJYPOE", "Overall": "5.0", "Content": "I have been looking for a basic phone and the LG VN350 is perfect for me. Only had the phone for a couple of days. Very pleased with shipping and the phone quality. It doesn't even look like it is used. Love the keyboard for messaging and the overall quality. I had a Smart phone and discontinued service because I didn't need all the bells and whistle. Save money by not having a data phone plus no contract for Verizon customers. If you wear hearing aids, this is the phone for the hearing impaired including bluetooth for neckloop users.", "Date": "December 5, 2012"}, {"Title": "It's a used phone", "Author": "B. Carlson \"Packer Fan\"", "ReviewID": "R277J2XFYR5EP8", "Overall": "3.0", "Content": "This phone serves it's purpose.  My husband broke hisCosmos 2 and this was the only affordable replacementI could find.  For the price it works just fine but wasa little different so he had to get used to it again.We are just waiting out our contract with our cellphone company so we can get smart phones!", "Date": "November 26, 2012"}, {"Title": "LG COSMOS", "Author": "Leiry", "ReviewID": "R2WWI8PRH6XFRK", "Overall": "5.0", "Content": "I absolutely appreciated the service that the seller provided. All the information was factual and also we were able to install the line without problems. I have ordered phoned before, specifically for Verizon and they have no been able to activate it. We experienced no issues and the phone was almost brand new! which is great", "Date": "November 20, 2012"}, {"Title": "Rough shape", "Author": "Jess", "ReviewID": "R2J6C8Y5E7E66M", "Overall": "1.0", "Content": "I thought the phone i bought was going to be in much better condition it looks like someone dropped it on every corner, I was not satisfied with the outside appearence but the phone seems to work fine.", "Date": "November 18, 2012"}, {"Title": "LS Cosmos VN250", "Author": "Kelly S", "ReviewID": "R23UAVPD1ICXFO", "Overall": "3.0", "Content": "After having this product for a little over a week, the screen is starting to do some strange things. It looks wavy at times and doesn't always unlock. When I press a button to see the time, sometimes it takes 2 of 3 presses for the screen to fully open. I tried to take a picture of my kids this morning and all of a sudden the screen was really wavy and the printing (when it came back) was all backwards. I finally had to turn the phone off and then back on again to get it working right again. I'm kind of scared at how long this phone is going to last.", "Date": "October 31, 2012"}, {"Title": "Dissatisfied with item", "Author": "Lisa W.", "ReviewID": "R328AP299KIIGG", "Overall": "1.0", "Content": "This product was shipped to me and began malfunctioning approx 30 days after I had it.  The keypad for texting is broken.  Every time I press the space bar, it switches to another screen.  It does this same thing with certain letters.  There are other things that happen too.  The item is not reconditioned.", "Date": "October 30, 2012"}, {"Title": "LG cosmos cell phon", "Author": "Ken Johnson", "ReviewID": "R5YTTNQZCQPWE", "Overall": "5.0", "Content": "The cell phone I purchased is in great working order. I have received 2 new phones from Verizon in the past year that didn't work as well as this phone does. It is clearly used as can be clearly seen with some of the scraping, but it is in great working order, which is what I was looking for.", "Date": "October 22, 2012"}, {"Title": "LG Cosmos", "Author": "Jane", "ReviewID": "R3CJM0MMJP7APT", "Overall": "5.0", "Content": "I have had this phone for 2 years.  Old one battery started acting up.  Could've ordered I-phone, but I ordered  same LG Cosmos.  I am comfortable with all the features, slide out keyboard for texting, and the size.", "Date": "October 19, 2012"}, {"Title": "Nice, Cheap Little Phone.", "Author": "Mark Pomerleau", "ReviewID": "R3J62MF3HL8XA", "Overall": "3.0", "Content": "This is a nice little phone. Nothing fancy. It works with Verizon, was in fairly clean shape for an older phone, no problem.", "Date": "October 12, 2012"}, {"Title": "It's OK", "Author": "K. Lord", "ReviewID": "R309MAEDYQG49Z", "Overall": "3.0", "Content": "I just recently got this phone, finally upgrading from my old flip phone, and I was excited to finally have a full keyboard since I text a lot.  I can't fault the phone for the utter incompetence and poor treatment I received from verizon when trying to activate it, but that doesn't mean it didn't leave a bad impression that may be reflected in the phone. My flip phone battery could last a week on a charge even with constant texting, this battery is almost dead after just a few texts.  The battery takes forever to charge too, I didn't expect it to charge in 15 minutes, but I do expect it to be charged after leaving it for 8 hours, sadly it was only half charged.  It's a nice phone for texting, but the battery life and time it takes to charge are making it less than the best!", "Date": "August 15, 2012"}, {"Title": "nothing special", "Author": "elizabeth", "ReviewID": "R3UTWGN895NJA8", "Overall": "3.0", "Content": "the phone is basic: call, texts, nothing too fancy.it is a nice phone and i love a keyboard, but on the front screen:1. my 7 doesnt work2. my 9 doesnt work3. if i slide it closed too fast it restarts itself and everything you just did was not saved (if you sent a text it didnt go threw)4. when i open my keyboard the two bottom buttons (closed on the side) dont workmaybe its just my phone but ive had it well under a year and im ready for an upgrade", "Date": "July 28, 2012"}, {"Title": "Inexpensive and working!", "Author": "Salsacol", "ReviewID": "R3CNIBRT7SYTYQ", "Overall": "5.0", "Content": "Rather than pay full price for the LG Model, I chose to buy a used one with some trepidation.  So far, it's been working perfectly and the delivery was onpoint and speedy.", "Date": "July 27, 2012"}, {"Title": "REVIEW", "Author": "vivalavida218", "ReviewID": "RDD026CE1TTST", "Overall": "5.0", "Content": "Quick, efficient, & a great price! Getting a new phone from a cell phone company can cost 200$ usually at the minimum, so compared to around 40-50$, it is a great deal!", "Date": "July 25, 2012"}, {"Title": "LG Cosmos VN 250", "Author": "amazpn", "ReviewID": "R262L0ET4JZPAK", "Overall": "4.0", "Content": "Had this cellphone for about 1 month now. So far working well. Battery life is good. I am happy with this purchase so far.", "Date": "July 22, 2012"}, {"Title": "WOW super fast and great condition", "Author": "Yemi", "ReviewID": "RLAZE7YF9NOP9", "Overall": "5.0", "Content": "Got my pre-owned phone at a great price and it arrived a week before I expected. It works perfectly. Great service, great product and super value. Nothing more I could ask for. Thanks.", "Date": "July 13, 2012"}, {"Title": "Not worth the money", "Author": "Mihir", "ReviewID": "R257EAJJRYY5WG", "Overall": "2.0", "Content": "-slow in response time-call quality is mediocre-crappy battery life-crappy camera-no video recorder-no flash for camera-keyboard is actually decent-turns off randomly", "Date": "April 18, 2012"}, {"Title": "broken", "Author": "Yakov yardley", "ReviewID": "RK8ZOWXN4OUCG", "Overall": "2.0", "Content": "the first phone i got had bad button second what just shut off randomly justthe phones are in bad condition", "Date": "April 27, 2014"}, {"Title": "Great Phone... Needs a case", "Author": "D. FitzGerald \"DJ\"", "ReviewID": "R30XOVH23BFRNS", "Overall": "4.0", "Content": "This is a great and simple phone. I love the qwerty keyboard. Simple interface. Cant take videos but can take pictures. I got this phone from verizon for free probably with a contract. Havent lost this phone in 1-1/2 years and i never have (except....) okay now back to the review. I would reccomend getting a case for this phone because this phone feels a bit flimsy. Great service. In my entire experience with this phone for 1-1/2 years i have only lost service with it ONCE! Verizon rules! NOTE: This phone is designed for right handed people..Get the LG Cosmos 2 if you are left handed. Great phone. - 4 Stars - A bit flimsy - Excellent reception - Simple - Please rate as helpful", "Date": "September 5, 2012"}, {"Title": "Cooperative and professional service", "Author": "Bsoldier03", "ReviewID": "R1C8LSG7BUNPW9", "Overall": "5.0", "Content": "As a client, I found this store to be professional, courteous and cooperative. I thank them for their service and commend their work ethic.", "Date": "June 25, 2012"}, {"Title": "Cell", "Author": "adp \"amber\"", "ReviewID": "R1F0OBL45EE1HH", "Overall": "3.0", "Content": "I don't love the phone, It works fine but I like a bigger screen. The product came in on time and was in great condition if you're just wanting a temporary phone I would highly recommend.", "Date": "March 22, 2012"}, {"Title": "Like it", "Author": "Anne Williams", "ReviewID": "R220MNYVTCI7DV", "Overall": "4.0", "Content": "The hardest part was getting the phone guide book that I ordered. I chose to pick it up rather than have it delivered. I was told when I could pick it up. The distance was a long way from my home and it was raining, when I got there They did not have the phone guide! They ordered it from another state and delivered it to me about a week later. The phone is fine ,how ever.", "Date": "January 23, 2014"}, {"Title": "ok phone", "Author": "len strait", "ReviewID": "R2TZJ6495GHHPV", "Overall": "3.0", "Content": "compared to a samsung brightside this phone lacks certain features.however it is an ok phone. i would get it if you want a basic phone.", "Date": "October 14, 2013"}, {"Title": "Return my order", "Author": "yuhong cheng", "ReviewID": "R11RJ5O6HWJIU7", "Overall": "1.0", "Content": "I got this phone yesterday. There is only a phone in the envelop,no charge device and even no phone #. I was ordered for my kids to use. They don't know without anything how to use it. So I decided to return to you. Please tell me how to ship back to you.Yuhong cheng", "Date": "September 9, 2013"}, {"Title": "this is the most used phone ever", "Author": "OhI'msorrydoinknoI'mnot", "ReviewID": "R7Z59MRXONDTK", "Overall": "3.0", "Content": "I got what I wanted, which was a cheap, used version of the phone I lost.  The phone came in pieces, however, was dirty as all get out, and still had text messages and voice mails on it.  The text messages contained someone's contact information.  Vroh was the seller.  I won't buy from them again.  Just a little too sketchy.  Phone works, though.", "Date": "June 19, 2013"}, {"Title": "worst phone ever", "Author": "thomas", "ReviewID": "R2WYU8B8M5VE65", "Overall": "1.0", "Content": "this is the worst phone ever they just dont make them like they used to.... i had the cosmos 1 and that was the best phone ever... i would pay $0 for cosmos 2 but i would be willing to pay $100 for cosmos 1...... everything about this phone is annoying.... even if you can buy this phone for $5 dont do it!!.... im disappointed in LG, LG used to make the best phones but after this their quality isnt trusted", "Date": "April 20, 2013"}, {"Title": "Awesome", "Author": "Geri Morris", "ReviewID": "R1KA88ZBOTE9TR", "Overall": "5.0", "Content": "Well a mistake was made and they took car of it so now i am very very very very happy.", "Date": "February 20, 2013"}, {"Title": "diappointed", "Author": "Paige", "ReviewID": "R1TJWWPP8L5XEX", "Overall": "2.0", "Content": "Bought this as a Christmas gift for my daughter.  The screen quit working within 60 days.  It was a big disappointment...", "Date": "February 18, 2013"}, {"Title": "cosmos lg vn250 verizon phone", "Author": "Dee Tronrud", "ReviewID": "R3ELXKJ6NQDWQY", "Overall": "4.0", "Content": "As someone over 65 & not overly \"tech\" savy, this is easy to understand & use.  I use the texting much more often than previously with this phone.", "Date": "February 10, 2013"}, {"Title": "Great yet so simple", "Author": "Ramon Jimenez", "ReviewID": "R18Y68AVG0F85C", "Overall": "5.0", "Content": "I purchased this phone as a replacement. It is simple to use and the display is very clear. The key board is easy to use and type. Although it did not come with a charger and instruction manual ( I bought it used) it was not difficult to figure out how to use it.", "Date": "January 25, 2013"}, {"Title": "Good Phone", "Author": "Arness", "ReviewID": "RXIO7TV8P41JO", "Overall": "3.0", "Content": "This is a good phone for a kid.  The specific phone worked well although it came with a dead battery. I happened to have another battery handy so I used it rather than requesting a replacement from the company that sold the phone.  In any event the phone has worked properly since I received it.", "Date": "January 18, 2013"}, {"Title": "LG Cosmos Verizon Phone", "Author": "Kreid", "ReviewID": "RY60OT7T361VW", "Overall": "5.0", "Content": "I have to say that this is a great cell phone. I like the way this phone works and looks.  I have only had it for about a week.  The seller handled the transaction in a timely manner and product arrived in a timely manner and in one piece. Overall this has been a great experience.", "Date": "January 15, 2013"}, {"Title": "Not what I thought would be", "Author": "laurageel", "ReviewID": "RPMVGL7IWRVEU", "Overall": "2.0", "Content": "I understand when buying used there will be some flaws, however, the first phone I received, the display didn't work. I contacted the seller and they immediately sent me another. Upon receiving the second one, it turned on nicely after charging it over nite. During the activation it shut completely off and would not turn on. I took battery out for over a minute and tried again. It still wouldnt turn on. I used to sell cell phones, program and work on them. I appreciated the fact that they were willing to replace the second one but I did not appreciate the fact that I was treated like I did not know what I was talking about with the phones. They did issue a refund and am waiting on that.", "Date": "July 30, 2012"}, {"Title": "Camera never worked", "Author": "ZacZki", "ReviewID": "R1Y4CW7C6NKGJA", "Overall": "2.0", "Content": "I don't expect much from a used phone, but what I do expect is for every component to work when the seller claims it is in perfect working condition. The camera on this phone has not worked from day one. The app will not even open, the phone in general does work/battery is fine but I cannot give them a good rating for that reason.", "Date": "June 20, 2012"}, {"Title": "Great replacement", "Author": "Ibby", "ReviewID": "R22QNPKO0FDA37", "Overall": "5.0", "Content": "Exactly as described-needed it to replace broken phone under verizon plan-they wanted to charge me $200!  This was recommended by Verizon salesperson and it worked and was compatible with the one that was broken!  I am so happy with this purchase!", "Date": "February 15, 2013"}, {"Title": "Description misleading", "Author": "sarah", "ReviewID": "R1X6BD8WTSK05W", "Overall": "3.0", "Content": "This cosmo LG phone I bought replaced my old cosmo LG phone (identical). I chose this phone on Amazon because it had the lowest cost, best rating, and highest quality description.I was happy to receive the phone in a reasonable amount of time (5 days + the weekend). But the product description \"very good condition\" was not fitting. I realize that it is a risk to buy a used phone off of amazon, because, hey, you never know.I feel the need to give feedback so future buyers can feel secure when buying off amazon.Having said that, I was disappointed with this product.The texting keys are finicky. For example, the keypad sometimes types d, and sometimes refuses to type d. Since I use the phone primarily for texting and calling, this is a bit frustrating. I would like the description of the phone to match the *actual* quality.thank you.", "Date": "February 13, 2013"}], "ProductInfo": {"Price": "$250.00", "Features": "This product has been carefully audited and is certified to be 100% functional.\nThis offer includes the following accessories 1. Battery 2. Battery Cover (if applicable) 3. Wall Charger", "Name": "LG Cosmos VN250 Verizon Phone (POST PAID)", "ImgURL": "http://ecx.images-amazon.com/images/I/51oABb7L3lL._SX300_.jpg", "ProductID": "B005DL3DIC"}}