{"Reviews": [{"Title": "Very good phone for calls & text (using T-mobile)", "Author": "Keith Ho \"Amazon Shopper\"", "ReviewID": "RJ2RG53A5JZ2U", "Overall": "3.0", "Content": "Got this phone to replace my Samsung Vibrant.  Got tired of Android phones.  Yup, I can't believe I went back to a Windows Mobile platform.  I needed a physical on/off button to hang up or dial people.  As strange as it may seem, the Android on/off button would not work during a call on my Samsung Vibrant.I bought this unlocked phone for calls and text. I carry my T-mobile G-Slate tablet for internet functionality.The phone that arrived was an AT&T; branded phone.  Fortunately I could slip in my T-Mobile SIM card and it worked.  Although it kept rebooting the first 20 minutes after I inserted the T-Mobile SIM.  Also, I'm not sure if this was a refurbished unit.  The outside casing looked new, but when I removed the battery there was this white sticker that looked like it was placed there by a 3rd party refurbished team.Regardless, this was well worth the price.  Again, I needed a basic phone.  The earpiece and speakerphone is loud, on par with the Samsung Vibrant.  It boots up in about 45 seconds.  It receives Edge internet only on T-Mobile.Ringtones are NOT very loud and there were not a good selection of ringtones.UPDATE 12/18/2011:  I downgraded my review of this phone from 5 stars to 3 stars.  The issue is dust collected under the screen.  There is no way to get rid of it.  Also, cannot see screen in direct sunlight.Battery lasts an entire day (24 hours).  Again, it's not Android and it doesn't multi-task, that's why the battery lasts so long.Overall, I give this phone a big thumbs up.", "Date": "August 2, 2011"}, {"Title": "awesomeee", "Author": "Beciscool \"Rebecca l\"", "ReviewID": "R9YOM822FE98V", "Overall": "5.0", "Content": "sooo my boyfriend had this phone a while ago..and i liked it, and i needed a back up phone because my LG vu plus's touch screen kept freezing, and based on the reviews of THAT phone, i wasnt the only one..soo i opted for something with a nice look and a qwerty keyboard...and lo and behold this phone was sixty bucks!soo i got it on october 3, and received it on october 4, paid 3.99 for next day shipping, and the phone is brand new..noo issues with anything, i highly recommend if  youre looking for a good non-smart phone...", "Date": "October 4, 2011"}, {"Title": "GREAT!!", "Author": "DWA", "ReviewID": "R3KNFFGKL6GJJW", "Overall": "5.0", "Content": "This product is awesome.  It works so well, and best of all it runs WTLibrary.  It's perfect.  I highly recommend it to anyone who wants a phone for mysimplemobile.com.", "Date": "September 9, 2011"}, {"Title": "Blackjack 2", "Author": "gst9111", "ReviewID": "R2CRQXYU5WSZAM", "Overall": "3.0", "Content": "I ordered this phone, works great even with a non AT&T; sim card, I live in Costa Rica and works here, got better reception than other phones like an iphone or blackberry.Im very happy with it, the battery last for more than 3 days, however it didnt come with the driver and looks like impossible to get the dowloads that this phone requires to update it and to make all the applications usefull.", "Date": "October 11, 2011"}, {"Title": "Great phone", "Author": "Nixon Owaga", "ReviewID": "R2QBE4VI2SQ7SB", "Overall": "5.0", "Content": "The build quality is great. It picks up and maintains a solid signal. Battery life is excellent. So far so good!", "Date": "August 10, 2011"}, {"Title": "Not a Blackberry, but it has a nice design", "Author": "cesar", "ReviewID": "R1EX5FXVJSE34D", "Overall": "4.0", "Content": "It has only been two days since I got the phone so rating this product is a little premature.  If you have been using a Blackberry, this phone might frustrate you a little bit.  The keyboard sticks a little. You have to add a period at the end of all sentences instead of the software doing it for you.  The comma is actually not featured on the keyboard, but as a symbol that you have to access from a symbol list.  Having said that, all of this is very tolerable. The track wheel seems very sturdy, but you are better off clicking instead of dialing. Reception has been really good everywhere I have gone.  The sound tends to be soft and so are the different rings.  I like the display.  Overall it seems like a very good, but simple smartphone.  When you buy this article, make sure they include a data cable with it.  It should come with it, but it was not packed with my order.  It is a proprietary samsung design so finding it would be difficult.  They didn't even have it at the AT&T; store, Best Buy or RadioShack around where I live.  I hope this review helps.", "Date": "January 14, 2012"}, {"Title": "Cannot be recharged?", "Author": "Greg R. Johnson", "ReviewID": "R1JU9O43AVN2NF", "Overall": "2.0", "Content": "Had this phone for about 2 years.  Started recharging it with a USB cable recently with an offical 'SAMSUNG' AC Adaptor. Here is what happens:Starting condition: Phone is POWERED OFF.  Battery is low to depleted.Plug in USB connection. Phone starts charging.A miniute or so passes.Phone powers on.  Announces that the battery is critically low.  *****DISABLES THE RECHARGE*****. and then POWERS OFF.Phone now powered off, plugged into the outlet via USB. But not recharging.  Battery is still low to depleted.Unplugging and re-plugging in the cable simply repeats the process.You cannot recharge the SAMSUNG Blackjack II with the SAMSUNG USB/AC Adaptor.  Using a cheapo third-party adaptor works ok.", "Date": "November 14, 2011"}, {"Title": "Pretty Great Phone", "Author": "JohnDeereGirl_10", "ReviewID": "R2CCVD0IUUSD2O", "Overall": "4.0", "Content": "The BlackJack arrived yesterday which was only one day after I ordered it so that was awesome! The phone is really sleek and light for its size. I charged it up and turned it on and so far it is working great! AT&T; operating system seems to be a little bit harder to use than Verizon but I'll get used to it. I guess I'll just have to wait and see how it does overseas, but so far it's pretty great. Great product that does everything it's advertised to do.", "Date": "July 13, 2011"}, {"Title": "Almost happy with this phone", "Author": "Gbtex27", "ReviewID": "RSV7Q8GBU438L", "Overall": "2.0", "Content": "The phone is working good the only this is when I got it the back did not fit properly on the phone.  I managed to squeeze it in but two days later, a hook at the bottom of the back broke off due to it not being able to fit in the first place.", "Date": "November 24, 2011"}, {"Title": "Excellent Purchase", "Author": "Touche'", "ReviewID": "R84U20DXHZDAY", "Overall": "5.0", "Content": "When my phone went out I dreaded the thought of having to buy another, my contract commitments are complete and didn't want to start another 2yr contract just to get an upgrade, so my friend recommended me checking amazon.com.  This was my first purchase on amazon.com, me being a newby to the site my jaw dropped when I found my same brand/type of phone for a fraction of the cost, I couldn't buy it quick enough.  I love my phone and it works just fine.", "Date": "October 14, 2011"}, {"Title": "Not the Best but Not Bad", "Author": "Marken O'Koi \"Slugger007\"", "ReviewID": "R3VQJ16L4430UV", "Overall": "2.0", "Content": "This phone is not the best but not too bad for the price. For starters, it's not a REAL samsung phone, as stated on the inside label once you receive the phone. It also likes to shut off/freeze up when I try to reply to a message. the memory is bad and fills up way to fast (8messages in the inbox/2in drafts/ 16in deleted). At least that's how it is for mine. Currently I'm in Iraq so I don't have a way to send it back, all in all...Not that bad but Not the Best.", "Date": "August 6, 2011"}, {"Title": "A GREAT PHONE!", "Author": "F. Freymuller", "ReviewID": "R40KCQ49ZVBDL", "Overall": "5.0", "Content": "This is the best phone that Samsung has ever made. I've had the BJ and the JACK but the BJII is the best. It works great, it is reliable, nice design, great keypad, good battery life, most functions are fast, tethers as a modem quite well, can make a call while using the internet, calendar etc. You won't be disappointed. I still carry the BJII as a backup phone.", "Date": "September 1, 2011"}, {"Title": "Awesome!", "Author": "Ismael", "ReviewID": "R37QR9OSNMOUWO", "Overall": "5.0", "Content": "Phone arrived early as I didn't expect to come! I fell in love with this phone. Nice upgrade and everything! Easy to use.! Nice Phone.!", "Date": "November 2, 2011"}, {"Title": "Not happy with my purchase", "Author": "BD", "ReviewID": "R2T5N63DRKCQOD", "Overall": "2.0", "Content": "This phone did not preform as expected.  The battery back plate did not fit properly and the phone kept on freezing up on me.  I stopped using it immediately and bought a replacement from another vendor.  I will not buy from this vendor again based on the problems I had with this product.", "Date": "July 23, 2013"}, {"Title": "AWFUL", "Author": "Wayne Jones", "ReviewID": "R1YFBKFCW3XM8Z", "Overall": "1.0", "Content": "I BOUGHT THIS THOUGHT IT WOULD BE A GREAT BACK UP BUT CLEARLY NOT THE BEST CHOICE BC ITS CHEAP I THOGHT I GOT A STEAL BUT CLEARLY IF I DIDNT GET A REFUND THE STEAL WOULDVE BEEN ON ME", "Date": "April 21, 2013"}, {"Title": "love it", "Author": "Regina Mullins", "ReviewID": "R25O1L6FL8HO3F", "Overall": "5.0", "Content": "This is a really great product.would recommend.I am very please. Recieved it very quicly after my order was placed . Thank you so much. Have a great day.", "Date": "March 3, 2013"}, {"Title": "samsung bj 2 i617", "Author": "Yogesh N. Badiani \"yb\"", "ReviewID": "R38GLD31FZCQ5X", "Overall": "5.0", "Content": "looks almost newworks greatall functions,camera,mp3 player,phone in/out working greatcharger and battery are working normalysyncrhonising perfectly with laptop outlook -office programmblue tooth is working perfect.", "Date": "February 16, 2013"}, {"Title": ";(", "Author": "Fun", "ReviewID": "R3ETRQVAF3PKUG", "Overall": "1.0", "Content": "For a week,  yes for one week only. Bad bad bad, Don't waist your money. Better buy a good phone...", "Date": "January 21, 2013"}, {"Title": "Excellent", "Author": "Walter Monserratte \"WALTERMON\"", "ReviewID": "R232Z2ZZH8IW91", "Overall": "5.0", "Content": "I bought this because it was exactly what i was looking for. I've used this phone for over 2 years now and I still have it", "Date": "January 18, 2013"}, {"Title": ":(", "Author": "Megan Hults", "ReviewID": "R38UPE5H7TRA1A", "Overall": "3.0", "Content": "Sad, i couldnt use the phone for almost 2 or 3 weeks after purchasing from them, the battery was dead and didnt work once i had receieved it", "Date": "December 13, 2012"}, {"Title": "Ok", "Author": "TG", "ReviewID": "R2SNHZA8VHZY0J", "Overall": "3.0", "Content": "Cheap looking battery cover and looks sort of not original, but I guess it is ok. I would not buy it again.", "Date": "November 7, 2012"}, {"Title": "Bad Purchase", "Author": "Albano A Agostinho", "ReviewID": "R1KUWTDL3YHJTO", "Overall": "1.0", "Content": "The telephone can not be recharged anymore after 5 months of usage. I just have to buy another one. Bud purchase", "Date": "July 25, 2012"}, {"Title": "Samsung BlackJack II", "Author": "the other side", "ReviewID": "R10HBWLDC54LFM", "Overall": "4.0", "Content": "It would be nice if I knew that this phone will be detected by AT&T.; I got charged a data plan the minute I turned it on. This is supposed to be an unlocked phone. I wanted this phone without the expensive data plan.", "Date": "June 18, 2012"}, {"Title": "excelente telefono", "Author": "luis", "ReviewID": "R2XS46FZZ21P5Q", "Overall": "4.0", "Content": "excelente telefono funciona muy bien la bateria dura lo suficiente y el reproductor de audio se escuche maravillosamente.lo recomiendo.", "Date": "June 17, 2012"}, {"Title": "Looks good but disappointed", "Author": "R Cedrix", "ReviewID": "R21760990YTPP7", "Overall": "2.0", "Content": "Just got it and it looks good but very disappointed it arrived without the manual!:( Right now I'm still figuring it out how that this phone works and I'll just update this later on so far I'll give it 2 star!", "Date": "May 27, 2012"}, {"Title": "At least is operating", "Author": "Luis Di Stefano", "ReviewID": "R1NV7DDLZ7UENA", "Overall": "3.0", "Content": "The device works fine, except the audio, that heard with interference. He did not come with headphones or other accessories, only with the wall charger. Anyway thanks for the service.", "Date": "May 18, 2012"}, {"Title": "Samsung Blackjack i617", "Author": "Isaac", "ReviewID": "RW0XQLN9TXM5F", "Overall": "1.0", "Content": "The item shipped do not have original battery. when charged it does not take even six hours to run out", "Date": "April 1, 2012"}, {"Title": "Not bad, but not that good either.", "Author": "lilsugarbunny", "ReviewID": "R2LM157RT8KS59", "Overall": "3.0", "Content": "I bought this phone to replace my samsung stride. I needed a new phone that didn't cost me a fortune to get me through the rest of my contract. I didn't realize that this was a smartphone when I bought it and recieved a text message from at&t; about a week after using the phone telling me that I needed a data plan to use the phone. They automatically signed me up for the highest priced data plan (which annoyed me a bit) but I changed it by having to go down to the store. So if you don't have a smart phone on your plan previous to buying this phone, you will need to add one. The lowest costing one is an extra $20 a month.I haven't had that many problems with the phone. It's a pretty basic phone. It is easy to use and good for texting. If you accidently exit out of a text message that you are typing (for instance to answer a phone call) whatever you had written won't automatically be saved and you will have to retype everything. The phone doesn't go into lock mode after a few minutes, you have to manually put it into lock by hitting the on/off button on the top of the phone and scrolling down to lock. Then to unlock you have to hit unlock then hit the * button. It's a bit annoying when you want to read a text message quickly.The battery life SUCKS on this phone. It will bearly last a full day. So I recommend getting a car charger. It bummed me out because my old phone could go almost five days without charging even with texting all day. Be careful with the back of the phone. The back cover broke on the bottom for me when the guy at the at&t; store tried to put it back on. So it isn't closed all the way on the bottom and I had to get a case to keep it in place. Also, it is SO hard to find a nice case for this phone. Options are limited. I found the cases mostly on Amazon and Ebay. Stores in the mall and even the at&t; store don't have hard cases for the phone.", "Date": "March 25, 2012"}, {"Title": "Good entry level internet phone but low quality hardware", "Author": "dasonline", "ReviewID": "R1P4B4M0BY8JOZ", "Overall": "1.0", "Content": "I purchased this phone after lot of research. I needed a phone just to check emails few times a day and to read news or search few stuff once in a while. I dont want to pay more on dataplan and I wanted a phone that make sense; both on price and features to use a limited or starting level data plan with my prepaid connection(some thing like a 30 MB-100MB per month). This phone is big yes for matching all those necessary features, unlocked low price. I use the 30 dollar a month data plan from tmobile that comes with a 30 mb data. Any conventional post paid connection will cost me min 60 bucks monthly for a connection. So the amount I spent for purchasing this phone is recovered within 3 months usage.I was very happy after purchasing this and many of my friends were surprised to see such a low cost phone with just enough features for everything.But that was just for few months and slowly I started to loose my first impression.First the battery cover legs got broken easily, because it is very poor in quality and was like a wooden stick.  After some time I got a replacement for that from amazon. Looks like there is a lot of demand for the batter cover.Secondly the battery life, almost every day I need to recharge it. If I use it for some calls/browsing then I need to recharge twice.I purchased an extra charger for home as I have  to frequently recharge it, but alas that charger nose is bigger and it wont fit to the phone for charging. Ifact the sliding cover for the charging nose is blocking the charger entering it compleletly. So use.Now lastly which is the big one, the ear speaker stopped working. Now every time I need to make a call I need to switch on the speaker phone. If any calls are coming after answering it I need to switch on the speaker phone to talk,( I need to unlock my phone before swithing on the speaker phone)It is a complete pain and that give me the strenght to write this lengthy review.I tried to return it, but the return date just ended few days back. Bad luck again.I tried to login to my amazon account and tried to write a review from my order list. Surprisingly all other items I purchased had a feed back link and not this one.So no I have to search for this in amazon to figure out how to leave a feedback.Cheap phones are always cheap in quality. Thats an obivious thing.", "Date": "March 12, 2012"}, {"Title": "Its an OK phone...", "Author": "JMAY40", "ReviewID": "R2TVV7IZCYL4C4", "Overall": "3.0", "Content": "I like this phone, but the screen is to small for me and the internet isnt very user friendly, it makes good calles and is a good looking phone, I just didnt like using it for the web, good back up phone...", "Date": "February 20, 2012"}, {"Title": "Personal opinion", "Author": "Service Credit Union", "ReviewID": "R28O7T000GU07B", "Overall": "5.0", "Content": "I bought this phone for my daughter and she loves it. She is destructive and I expected the phone to have been broken already but it is proving to be of quality thus far. The picture is exactly what the phone looks like. I plan on buying one for myself in the near future.", "Date": "February 10, 2012"}, {"Title": "Do not recommend", "Author": "green", "ReviewID": "R2A1SI0SGSSUMP", "Overall": "2.0", "Content": "The battery cover is not appropriately manufactured and battery is gone in a day even though you do not use it. In addition, the screen gets dust inside easily. I do not recommend this phone.", "Date": "February 2, 2012"}, {"Title": "decent but has its issues", "Author": "js1956", "ReviewID": "R35SMBHJ2CQBTZ", "Overall": "3.0", "Content": "this is a decent phone for someone who only makes calls and texts very little. i say text very little because i text all day and the battery does not last. by 7pm i have to plug it in. the other issue i have is that the multi media messaging is still locked with at&t;,(i am on t-mobile) therefore i can receive photos but i can not send any. when receiving photos from others i always get the photo at least three times. this would be a major issue if i did not have unlimited messaging in my plan. i also do not have internet on this phone. perks to this phone= the call quality is good. the earpiece volume goes up pretty loud. the setup as far as getting to your contacts or your calendar or whatever it may be, seems to be pretty user friendly. and this phone does look nice.", "Date": "January 20, 2012"}, {"Title": "Smartphone on a Budget.", "Author": "BlueChip", "ReviewID": "R1XQAEF7R2IVJD", "Overall": "3.0", "Content": "Got everything I need. I usually do most of my work on the go and this phone is my tool on viewing reports and all other office stuff, thanks to MS Office mobile. :)", "Date": "January 20, 2012"}, {"Title": "Samsung Black Jack II i617", "Author": "Honest Feedback", "ReviewID": "R31O7P0BC5MIR0", "Overall": "4.0", "Content": "This phone is great if you can manage to get one that works. I purchased 5 in total but only kept two. Two worked great. The Windows based system made getting email and opening MS Docs a snap. The music feature works great but you do need that micro sd card for storage. Downside, no wifi.The defective models had defective charging ports, phone lock wouldn't unlock once activated, phone menu was not always accessible. It's hit or miss with this one. Most phones were available through unlocked cellphone kings and their customer service is not good. They refused to replace one of the phones. Thank God I'd purchased that one using PayPal and PayPal reimbursed me. The seller didn't even care I had purchased 5 phones from them. Bad businesss.", "Date": "January 1, 2012"}, {"Title": "Great Audio!", "Author": "Gary2", "ReviewID": "RWOJ6TLI6BWXU", "Overall": "4.0", "Content": "i wanted an unlocked phone to take to take on a UK trip. I used a \"Global\" SIM card, which has it's \"quirks\" so I had to sift through what were phone issues and what was the SIM card issues. Overall the best attribute is the sound quality of the ear speaker. Probably the best sound I have ever had (including my Blackberry) Pretty easy to use, other than larger keys hardly light up and can be very difficult to see in the dark. Also battery life is not anywhere near what the makers claim. I have had worse, but keep a charger close by - you will need it! Ear phone plug is Samsung only! as is the charger (not USB) Overall quality very good, nice looking and I would buy one again.", "Date": "December 20, 2011"}, {"Title": "NIce phone", "Author": "delroyc", "ReviewID": "R3HK9A59TR5LO9", "Overall": "5.0", "Content": "Nice and very useful phone. I bought this phone this year and even is a little old and doesnt run Android is one of the most useful phone i ever had.", "Date": "December 18, 2011"}, {"Title": "BlackJack II", "Author": "John D", "ReviewID": "R52CRN4JATV6X", "Overall": "4.0", "Content": "Very pleased with the quickness in filling this order.  Received within 3 days.  Too early to tell regarding reliability, but it appears to be working fine.", "Date": "July 11, 2011"}, {"Title": "Don't bother", "Author": "Baby Kitten", "ReviewID": "ROFZ8DLE3H1QP", "Overall": "1.0", "Content": "Compared to Nokia and LG phones, this one felt cheap and light.  Back panel to secure battery did not fit, battery life was poor, no alarm function. It was returned.", "Date": "December 30, 2011"}, {"Title": "No user's manual !!!", "Author": "Mary L. Moessinger", "ReviewID": "R1OVDOG8QS0TAT", "Overall": "4.0", "Content": "I received the Samsung BlackJack II and basically it is a great phone.  First off, the battery would not charge up, so the seller sent me a new battery, then the battery cover would not stay on, so, the seller sent me a new one. Luckily I had ordered a case cover for this phone so the battery cover was not an issue.  There is no user's manual specific to this phone, and when I called the seller they said they did not have one & that one could be downloaded via internet, however, the manual is 167 pages !  So, I have a phone that is not living up to all it's capabilities becuase I do not have a user's manual.  This is a discontinued phone.  I would caution to only order if you are already very familiar with the specific phone you want, as these discontinued phones may not have a user's manual.  The seller was helpful whenever I called and responded right away, but, they could do nothing about the lack of a user's manual.  I would only order a phone over the internet if I had that particular phone before & still had the owner's manual.", "Date": "November 9, 2011"}, {"Title": "Upset!", "Author": "Markia", "ReviewID": "R5ZGUFNRYOJW9", "Overall": "2.0", "Content": "So I ordered this phone, I've had it before and since I'm deciding on whether or not to extend my tmobile contract I opted for a phone I've had before. I paid $16 extra to get the phone ASAP and when it arrives it doesn't work! Like I said I want this phone so I've now opted for a replacement phone which can take up to 30 days!!! It is really frustrating!!!!!!!!!!!!!", "Date": "August 2, 2011"}, {"Title": "A cheap copy!", "Author": "Federico", "ReviewID": "R3B7XTN7PCHIJC", "Overall": "1.0", "Content": "Unfortunatelly I received a cheap copy! It is a chinese phone! When you see the box and manuals you can confirm that is obviouslly a cheap copy.", "Date": "October 31, 2011"}, {"Title": "bad fone", "Author": "E. Alibehaj \"Pure Alb\"", "ReviewID": "R1C6CIX58SQJH5", "Overall": "1.0", "Content": "this fone did mot turn on and they sent me the wrong charger for the fone, so maybe it was used one", "Date": "June 14, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported.\nQuad-band/3G smartphone with Windows Mobile 6 for MS Office document editing and easy Outlook email and contacts\nInternal GPS receiver with support for TeleNav software;\nFull QWERTY keyboard; Bluetooth stereo music streaming; 2.0 megapixel camera; MicroSD expansion\nUp to 7 hours of talk time, up to 14 days of standby time\nInternal GPS receiver with support for TeleNav software; music and video downloads and streams via AT&T; Mobile Music and Cellular Video\nIt will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint\nMusic and video downloads and streams via AT&T; Mobile Music and Cellular Video\nThis unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint", "Name": "Samsung BlackJack II I617 Unlocked Phone with QWERTY Keyboard, WM6, GPS, 2 MP Camera and 3G Support - Unlocked Phone - US Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/515PKXu7jEL._SX300_.jpg", "ProductID": "B0051I5I3K"}}