{"Reviews": [{"Title": "SVP G13 Cell Phone watch", "Author": "Roger", "ReviewID": "R1OGX2W7ZV9F9I", "Overall": "4.0", "Content": "The SVP G13 Cell phone watch work perfectly so far.  I originally wanted this watch for the Media functions at first....and as I started to read reviews on other watches I thought I would give the phone portion a try.  I have Sprint so I didn't have a SIM card to toss into the watch and I didn't want to have 2 full phone bills.  I decided to go to T-Mobile and get a pay as you go plan...and this is totaly working out for me.  I pay $30 every 90 days and I get 160 minutes of talk time and it cost me $.10 a text message and $.20 per MMS message.1. Still/Video camera... not the best, but it will take an OK picture in good sunlight and the Video is better is good sunlight also. You can review you pictures and video through the Media player...keep in mind that the screen is tiny and if you are outside the daylight will make it harder to see the tiny screen. One thing, I downloaded a couple of MPEG-4 files and the watch could not play them back without being choppy.2. Adio player... works with either the headphones or the built in speaker.  It's not that loud when you are in a noisy area, but when you are in a quiet area it works rather well. The headphones are proprietary, so you can't plug in your own headphones...there is no 3.5MM headphone port.3. Phone... The phone actually works very well and with the included BlueTooth Headset.  The watch has a built in speaker if you would like to have everyone notice that you are talking to your wrist, or you can use the included stereo earbuds.Conclusion, I love the functionality of the watch/Phone and would encourage any gadget freak to try it out.  when using the Blue Tooth headset I was told that the call quality was good and clear.", "Date": "February 18, 2012"}, {"Title": "Better than expected - Great for the price", "Author": "MR2012", "ReviewID": "R1ZSSLWBB6ERW4", "Overall": "5.0", "Content": "Received the G13 watch 2 days after I ordered it. I also ordered the MQ988, both from Victor LLC. Now i am not about to say I am the sharpest tool in the shed, but as for the compaints on the manuals broken english, I have to say. I did not even look at the manual until after I had set up everything to see if I missed anything. The menus on the watch are pretty intuitive, but to be fair in this review, I have not set up the phone since I dont have my Sim card or blutooth connector. For me the phone is a secondary feature and I mainly wanted the watch for all the other items. So on with what I can say about the watch: Note: Everything starts as 5 STARS and goes down if lower than expected.1. Customer Service - Victor LLC has respond to all my requests, and to me, has gone above and beyond normal  customer service. I had a few issue, but that was because I did not read the description clearly on both issues and on every email they responded and were willing to help. (5+ Stars)2. Menus ease of use - Very easy to navigate and set up. Stylus was easy to find (dont understand how some could not find it) Menu responds well to touch. (5 Stars)3. Putting in the SIM and Memory card - Very easy. Some are complaining they could not get the memory chip in. Here is where the manual is a little off. I had to raise the metal bracket and slip the chip into the metal bracket and then close it. I could not simply lay the chip on the metal leads and close the bracket and slide up as the manual says, it would not fit that way. The Sim chip fit without a hitch, although it was not an active one yet. (4 1/2 Stars since the manual was off)4. Charging\\ Battery life - takes about 10 hours per battery for a full charge - Normal use it has lasted me all day and I plug it into my computer to charge at night. I have recorded about 15 minutes of video and taken 20 pics. I also watched a 1 hour and 30 minute MP4, seems like I have about 20% battery life left. Dont listen to music that much will be able to update more after a couple of weeks. (5 Stars - Battery lasted beyond expectations) My expectations were not too high on battery life, but then again I am not planning on watching multiple movies or video taping 1.5 hours at a time, so mileage may vary.5. USB connection to computer - connected it to different computers, multiple times over the past three days, no issues charging or seeing external drive to transfer files. (5 Stars)To Application review1. Video Player - I can play all my MP4 movies after I have converted them to 160x160 and lowered the bit rate. The picture quality is above expectation for being on such a small screen. No complaints (5+ Stars)2. Video Camera - Ok, not professional quality, but then not bad either. you wont be sneaking into any movie theaters recording movies with this watch :o). I did post a video sample on youtube under g13 phone movie. Its a standard 640x480 video at max-resolution. great for quick vids, times when you need a camera right then and you know you will miss the moment running into the house to get the camera. The sound is awful if the subject is more than 5 foot away. I dont know why, but I was expecting a little better (4 stars)3. Camera - Its what was expected and even has rapid shot, I posted a couple of shots in customer pics. Standard 640x480. Its expected and easy to use. (5 Stars)3. Photo editor - very basic, but a plus cause I didnt really expect one to begin with. (5 Stars)4. Photo Viewer - Expected5. Calculator, Stop watch, Alarm, Currency convertor, Alarm, Health calculations (BMI), Audio player. All good additions and some beyond expectations (5 Stars)Style -As i said before, I also bought the MQ988. The 988 is so BIG, I could not wear it, it would look ridiculous on my arm, maybe good on a teenager. For myself, i needed something a little more undersized and after wearing it for a while, its perfect.What was not tested:Phone - I will test this out later, but I did not buy the watch for just the phone. I understand the phone works well from other reviews and youtube videos.WAP - I dont plan on using this to browse the web - but once I get the SIM in, I will update the review.Burn in testing - I did not put this through a burn in testing to see exactly how lon it would record, how long it would play, if i could stess test it.After three days - Watch seems good to go. The band is a ruberized plastic that I am not sure will stand the test of time. We will see. I have not gotten it wet or banged it on walls through normal use. Would i buy it again? It depends how long it lasts, if I get a good year out of it, sure would.", "Date": "November 18, 2012"}, {"Title": "Wonderful, but with 2 major design flaws...", "Author": "C. W. Sayre", "ReviewID": "RO1A8LR20AQD2", "Overall": "3.0", "Content": "Amazon Verified PurchaseThis review is from: G13(with micro32GB) Black Touch Screen Camera MP3 GSM Watch Cell Phone~ unlocked~ Quad-band (Wireless Phone Accessory)This is a fantastic watch phone, and after using the G13 for the last few months, I can never go back to a regular cell phone. The G13 is just too convenient, easy to use, always there, and so darn \"cool\".However, as shown in the picture I uploaded in Customer Images, the G13's plastic case has cracked through-and-through (on both sides of the watch), and this is after wearing it for 3 months -- a weak, poorly designed case.Another MAJOR issue is its TOTAL lack of water resistance. \"Big deal\", you think, \"I'll just keep it out of the shower and the rain\". It's not that easy, because even the slightest perspiration, laden with corrosive salts, works its way quickly into the innards of the G13, damaging it over time. And with the watch band and the case being made of plastic, you sweat under the watch quite a bit (at least in the Summer).I love this watch, but these two issues are so show-stopping that I'll probably have to purchase another brand of cell phone watch when mine falls apart or stops working, which looks like it will be pretty darn soon.UPDATE:I contacted Slim Sharp's (the vendor) customer service, described the above issues, and they were kind enough to replace the entire watch. So five stars for Slim Sharp's CS -- they stand behind their product!!", "Date": "October 15, 2012"}, {"Title": "Great watch/phone, but not for people who want a full featured smart phone.", "Author": "Unknown.usr \"corpbot\"", "ReviewID": "R3OC6WVBM3CZSP", "Overall": "5.0", "Content": "This is a great device for people who want something handy with the ability to access minimal internet sites.  It is not a full featured phone, but it is excellent for what it is.The phone works great, even without the headset.  The menus are much easier than previous Chinese watch/phones I have used.  However, teh web browser is burried in the settings menu, which is strange.  And even after I configured the default language settings, I still get Google in Chinese.  I am still figuring out how to setup email.Here is how to setup the WAP browser for AT&T;, in case anyone is hunting for these settings:Go to menu, settings, data account, options, add. Name is AT&T; (or whatever you want). APN is set to \"WAP.CINGULAR\".  User name & password are blank. Auth type, left at normal. Primary & secondary DNS, left at all zeros.Go to menu, settings, Internet service, settings,  profiles, add new. Profile name is AT&T; (or whatever you want), home page I used is [...], data account is AT&T; (or whatever you named it), connection type is http, Proxy Address is \"wireless.cingular.com\", Proxy port is \"80\". Leave user name & password blank.", "Date": "July 21, 2012"}, {"Title": "Works Fine with Minor Quirks", "Author": "GusWu", "ReviewID": "RHK5WTZLLMUUC", "Overall": "3.0", "Content": "I  bought this Cell Watch for my son so he wouldn't keep on losing his other cell phones. Upon arrival the start up was fine and relatively easy and it performed well enough the call and receive call functions. However I have the following problems:The volume of the speaker on the phone was low (my son had to put it next to his ear to be able to hear)which is why I believe it comes with the included blue tooth, however I was not able to make them work together.The package said it included an additional charger so that both included batteries could be charged simultaneously, it did not come with the package so I can only charge one battery at a time (and for that I have to installe it on the phone).Aside from the above, my son was happy to use it and test all its features which were easy enough to use, but limited to the watch form factor (vga camera, etc).", "Date": "May 25, 2012"}, {"Title": "a movement of the hand", "Author": "gadget saul", "ReviewID": "R491C4QONTICR", "Overall": "4.0", "Content": "This is a watch I purchased as a backup cell phone. It does everything a normal cell phone does but on a smaller scale. It does blue tooth for your car ,dials and calls people, and most important, their is customer service that response to your emails quickly. VICTOR LLC is the distributor of the watch and they are very helpful. I once got a phone call from overseas to answer my question but normally I have been happy with the email response. I must say that I am a large buyer from amazon on all items and gadgets are foremost in my mine. I consider this watch a gadget, backup cellphone, a dress watch and a showpiece. You will not go wrong buying this watch oops forgot to tell you it also keeps great time...saul", "Date": "May 9, 2012"}, {"Title": "Not a bad phone watch.... convenient when exercising though", "Author": "Lauren Glenn", "ReviewID": "R1TAU8TVSV7JNS", "Overall": "4.0", "Content": "It's a bit big, mind you.  And it's more for the guys, I suppose..... for me, I bought it because it was fairly interesting and it's convenient when I go for a walk, go riding, etc. and it serves its purpose for that.A few cons:*  The watch band doesn't appear to be removable.  If you want a new band, you may have to cut of the band and velcro it to a single piece replacement band.*  The keyboard is fairly small but with some practice, you can do it without a stylus.*  There's no MUTE option on the phone.*  I can't use the WAP browser on the device, but then I never use WAP.*  It's not sized for the ladies, so to speak.  It's more for kids and probably acceptable for guys, I suppose.Still, a few really good parts about this:It works!  And it works fairly well.  The sound quality is very good over bluetooth.  I paired it with an Rocket Fish bluetooth stereo headphone from Best Buy and the phone quality was very good.  No one complained about not being able to hear me.  It takes micro-SD card but I wouldn't use it to play music unless you have nothing else.  I still don't know how to get media onto it without taking off the back and taking/replacing the SD card.Also, another good thing is that when a phone call comes in, this thing rings immediately.  No real pause, nothing.  It just rings immediately and usually a full ring before my other cell phone does.Still, I've gotten better at it that I can dial without the stylus and I can even get the keyboard working albeit slowly, but it still works decently enough.Also, the USB port is non-standard, but it comes with a cable.Camera is OK.... nothing fancy and nothing spectacular, but in a pinch, it serves its purpose.Still, it's a novelty gift and good enough for carrying a phone with you without actually carrying a phone in your pocket.  You always know it's with you.  :)", "Date": "January 3, 2013"}, {"Title": "Great Product for the Great Price", "Author": "Sandeep", "ReviewID": "R1KWCDAK1ULETE", "Overall": "5.0", "Content": "This product has great features which works really well , so im planning to buy this item again.SVP G13 Cell Phone watch : qualifies and satisfies all the basic functions of a smart phone.Great cell phone watch for the great price.Good deal!", "Date": "August 31, 2012"}, {"Title": "ROBSER08", "Author": "ROBERTO", "ReviewID": "R3QNPWEMGH7XR", "Overall": "5.0", "Content": "MAY BE THE BEST WATCH PHONE MODEL IN THE MARKET !!!!GOOD SIGNAL (  ATT ) PREPAID SIM, GOOD SPEAKER AND MICROPHONE AND THE REST OF THE FUNCTIONS WORK VERY GOOD.HAS A NICE LOOKING AND IS EASY TO MAKE AND RECEIVE CALLS.EASY TO REPLACE BATTERY AS WELL.", "Date": "December 25, 2012"}, {"Title": "Novelty", "Author": "Me", "ReviewID": "R3CET0NV6AHLGF", "Overall": "5.0", "Content": "This was purchased as a novelty. When I got it it turned out to be a viable addition to my daily ruteen. Works great. Had to use card cutter to allow mini card to fit.", "Date": "October 1, 2012"}, {"Title": "Great Watch, get this one NOT the G14", "Author": "Jon \"Jon\"", "ReviewID": "RALHBN5LY92SW", "Overall": "5.0", "Content": "This is a great watch, I own two of them (Silver and Black).  Both function exactly the same.  It includes the core features: Phone, Camera, Video Camera, Sound Recorder, MP3 player, Calendar, Calculator, etc.  Great device, but will take a few tweaks here and there to get it working as you would expect.  For instance, there are settings for the picture quality (Video and Camera) that you'll need to setup with the highest resolution, set the SD Card as the primary storage, Bluetooth (Set this for Stereo, assuming you have a BT headset - I use the Motorola S9 and it's perfect at the gym).  Someone here also posted instructions for setting up the Internet connectivity, those instructions work fine (couldn't find them anywhere else).  This phone uses a GSM SIM so in the USA you'll need AT&T; or T-Mobile Sim cards to use it.  I use a pre-paid AT&T; card so I don't have a monthly bill and use this as a backup phone primarily.  Takes about 30-45min to charge in the morning and it's good the rest of the day.  Very pleased with battery life, though honestly I don't use the phone feature very often.  Easy enough to crank out a few short text messages in a pinch.** Beware ** of the new \"G14\" model.  Bought one from another website, they removed all the \"other\" apps. that I used frequently (Calendar, Alarm, Calculator, etc.) and replaced them with a single app. for a Pedometer (which is junk).  So, if you're looking for the best model stick with this one (G13) and skip the so-called upgrade to the G14 (Which I'm in-process of returning).  You've found the right watch here, order this one.", "Date": "July 25, 2013"}, {"Title": "Works well.", "Author": ",...", "ReviewID": "REPHO0NTYDA04", "Overall": "5.0", "Content": "I bought this as a gift and I have been told it works fine. Reception is good, the speaker works well and the touchscreen is fine.", "Date": "June 24, 2013"}, {"Title": "Touch Screen Did not Work Properly", "Author": "C. Donnelly", "ReviewID": "R33M869FVJH77", "Overall": "1.0", "Content": "Texting was very difficult, press one letter get a different letter. Bluetooth tried to pair with every phone in range. Returned it. Will get another \"W\" PhoneWatch", "Date": "May 21, 2013"}, {"Title": "Returned", "Author": "Big Bubba \"G26\"", "ReviewID": "RCNT8QTGAIIEL", "Overall": "2.0", "Content": "Awesome idea... BUT... Pass on this one. Sounds cool and that cheap price grabs your attention but it doesn't quite work properly in any way or situation you need this for. Also, just to put it out there it's bulky and mine only came with ONE battery even tho seen advertised to include TWO else where.-I'm a T-Mobile User-Sound during calls is quiet and if you place it on speaker phone to make louder it gains bad distortion for the caller on the other end.Bluetooth headset provided was also very quite and cheaply made so you'll find yourself looking else where if wanting to connect wirelessly.Texting worked kinda. Picture messaging MMS 1 out of 30 worked and that is after hours of setting changes. Short SMS worked fine but they don't just pop up, you have to go through menu to menu to menu screen each text. Gets old very quick and removes the idealistic \"just look at wrist to see what is up OR HI!\".*BUY AT YOUR OWN RISK!*", "Date": "March 24, 2013"}, {"Title": "The coolest thing I've ever bought", "Author": "chavruta \"chavruta\"", "ReviewID": "R2KTKXCT6NOH21", "Overall": "5.0", "Content": "I bought it for my wife. She kept forgetting her phone places. She gets asked about it everywhere she goes. It's really cool. I wish I had one too now.", "Date": "January 3, 2013"}, {"Title": "How handy it is, indeed!", "Author": "Kwok Ng", "ReviewID": "R34AYVTNW4ZKIW", "Overall": "5.0", "Content": "I always need to carry my U.S. phone when I go to Asia.  I also try to get a local phone too, but I hate there are 2 phones in my pocket.  This time, I bought this GSM phone.  It makes my travel so much easier.  People all are impressed this watch.  The phone works very well, but the manual is poorly written.  I figured out most of the features without reading the manual.  It comes with a compact BT headphone, but I skip it because I do not want to carry one more item to the trip even the headset is very very small.  I just put the built-in speaker to my ear, and the sound is clear enough.  At least, The battery life is not bad either.  Overall, I love it.", "Date": "February 2, 2013"}, {"Title": "Use it Everyday", "Author": "DenHonuaKai", "ReviewID": "R3TBH7T2XA4B3F", "Overall": "4.0", "Content": "This is my 2nd watch phone so i'm a bit surprised when people see me talking on it.  These have been out at least 3 years and the 1st one cost more, had more features but broke within 2 years.  It had no way of charging wiile in the phone which so you don't have to take the battery out every day.  This watch phone charges like most pnone do. Price for use gives it 4 stars.", "Date": "November 20, 2012"}, {"Title": "worst experience ever", "Author": "Mariella", "ReviewID": "RIXGBTUJHD6Z9", "Overall": "1.0", "Content": "When I open the box watch came broken, what a waste of money.don't recommend this to anyone please don't buy", "Date": "January 25, 2014"}, {"Title": "Taken by customs", "Author": "Mary", "ReviewID": "RMJUV48RO93AU", "Overall": "1.0", "Content": "This watch was taken by customs and destroyed because it was not allowed in the country. It is not allowed to have a camera on your wrist in this country because you can take pictures of people without them knowing! So disappointed!!", "Date": "January 13, 2014"}, {"Title": "12345", "Author": "Amiran Pailodze", "ReviewID": "RA68XC6SL1LDB", "Overall": "5.0", "Content": "this product to my son very much, phone watch is very practical and work great. Only bad that there is no memory card included", "Date": "November 27, 2012"}, {"Title": "very cute and playful", "Author": "robert luna sr.", "ReviewID": "RK3XN9D9JMVPC", "Overall": "4.0", "Content": "I'm satisfyed w/ this one toy that you can use instead of cell phone, it does just about everything a cell phone does.if you get to know how yo use it.", "Date": "May 23, 2014"}, {"Title": "Bad batteries", "Author": "Alcides Ocampo", "ReviewID": "R2RKY860GINBR2", "Overall": "2.0", "Content": "The watch comes with bas batteries, and i dont have the way to get a new one, it dont work", "Date": "April 21, 2014"}, {"Title": "It's okay!", "Author": "Eleanor Dwyer", "ReviewID": "R37PCEP2H7U7PJ", "Overall": "3.0", "Content": "The reception is clear.  Good for a back up phone.  I have to recharge it often though.  The bluetooth doesn't work, well it did once.  I should have have refunded my money, but I became so busy, I don't even know where I kept it.  But it somewhere in the house or just lazy to find it.  The bottom line....I don't use it anymore.  Don't know when, maybe I will and give it to a kid when I have the time to find it.", "Date": "January 22, 2014"}, {"Title": "Don't waste your money but it cute", "Author": "Wendy", "ReviewID": "R2MTG50OK92JA2", "Overall": "2.0", "Content": "I rate this watch 2 star first of all when I order the watch the send a black one and I ordered a pink one then when I called to Swap it out they tell me the pink one that I want it has other problem so they called themselves giving me a upgrade watch which is not so upgrade the Speaker on the one he sent me Even when the value is turned up high is still sound the voice sound low the black one speaker is louder  my daughter has to use earphone all the time to talk", "Date": "January 10, 2014"}, {"Title": "Not what I wanted!!!!!!!!", "Author": "Steamer", "ReviewID": "R8JHQDB9RUSO", "Overall": "5.0", "Content": "Returned but nice.... to big,,,,,,,,,,,, It was so big on my big wrist that I looked lope sided with it on,,,,,,,,,,,,,,,", "Date": "December 31, 2013"}, {"Title": "My son loves it!", "Author": "Elizabeth A. Wise", "ReviewID": "R4LJUSBI3FT1G", "Overall": "5.0", "Content": "You can actually make and receive calls and text.  My 11-year old son loves it.  We used a T-mobile plan and it was easy to set up.", "Date": "October 25, 2013"}, {"Title": "not worth $70.", "Author": "jayuno \"jayuno\"", "ReviewID": "RJJTKBPJSGWT2", "Overall": "3.0", "Content": "nice little watch.picture quality is bad.very difficult to setup with t-mobile but i did it.would love to see this watch with better camera and a better explaining manual.", "Date": "October 7, 2013"}, {"Title": "G13 Black camere GSM quad-band watch phone - unlocked", "Author": "NANA K ABABIO", "ReviewID": "RB83VK2S3C6H9", "Overall": "4.0", "Content": "This phone works fine for me. I have not encounted any diffifulty in using it. I will make further comments as time goes by.", "Date": "September 8, 2013"}, {"Title": "Attractive & Practical", "Author": "Karim Y.", "ReviewID": "RJHI0PW9M41OF", "Overall": "4.0", "Content": "Very attractive , I really like it , it is excellent if you are using a secondary phone line because you will not be in need to carry another phone device and also will not be forced to have a low quality dual sim phone", "Date": "September 3, 2013"}, {"Title": "awesome", "Author": "Leon", "ReviewID": "RW4RP634ODENK", "Overall": "5.0", "Content": "I love it just add a sim card and your good to go I got a paid plan and it awesome", "Date": "September 1, 2013"}, {"Title": "It work like a regular cell phone including touch screen and internet", "Author": "Smith Zhang", "ReviewID": "R3E6X3YM691Q18", "Overall": "3.0", "Content": "It work like a regular cell phone ,including touch screen and internet ,email...but the back cover is losing when I received it.", "Date": "August 8, 2013"}, {"Title": "ehh...neat, but ehh", "Author": "Dane", "ReviewID": "R3NRRPQBTSUJ5Z", "Overall": "3.0", "Content": "it works with my t-mobile sim card, but i would not recommend trying to use this as your primary phone. It does not get good signal while indoors. It's pretty bulky on your wrist as well. I only use it for novelty purposes. it's just a fun little gadget. texting on it is a pain in the butt. I got stuck with an extra phone line on my account, so I take this out with me for parties and events, just to amuse people. I'm considering removing the wrist bands and attaching it to a lanyard or necklace next time. It's just uncomfortable on the wrist. There are a lot better watch phones available if that's what you're looking for.", "Date": "August 6, 2013"}, {"Title": "Star of the Day...", "Author": "Anne K. Verona \"Computer Guru\"", "ReviewID": "R1JPA5XY15S4X7", "Overall": "4.0", "Content": "Watch is most difficult to put together. Requires SIM card, also. But, we are in the process of assembling it, and, the end result seems likely.It will be a miracle to get it to work, but, if all that is said about it is true, it will be worth it...", "Date": "May 18, 2013"}, {"Title": "Hard to touch the screen", "Author": "lux", "ReviewID": "R3VYYYEH2I35UX", "Overall": "3.0", "Content": "when I turned on is so hard to dial the digits, also is too small to see some letters, the menu is so simple the camera is not so good but still is a camera in a watch", "Date": "May 6, 2013"}, {"Title": "Very cool watch/ camera/ and phone..", "Author": "suhair khatib", "ReviewID": "RTZETKVD1OV83", "Overall": "5.0", "Content": "Very nice watch/ phone/ camera.....  my son is very happy with it. he says it is an awesome phone. Easy to use", "Date": "April 13, 2013"}, {"Title": "It's ok", "Author": "Stephen", "ReviewID": "RUQZ4BLRC7F9Y", "Overall": "4.0", "Content": "Yes it works fine,but I wouldn't make it my primary phone. Is a great back up phone though.battery life is ok", "Date": "April 11, 2013"}, {"Title": "Love it", "Author": "Notanother", "ReviewID": "R7JV6CSXLKUCO", "Overall": "5.0", "Content": "I purchased this for my 10 year old nephew who lives in Jamaica.  It is definitely unlocked for any carrier. He loves is and has been using all the features on the phone.  The calls are clear and the picture quality is good and he listens to music with a headset.  He's happy, I'm happy", "Date": "April 2, 2013"}, {"Title": "Don't waste your money", "Author": "Any Mouse", "ReviewID": "RFPBEAAM9S7UJ", "Overall": "2.0", "Content": "This does not work well for me. I find the touch screen difficult and impossible to navigate, even with the stylus.  The phone itself works passably for receiving calls, but making a call or sending a text message is too disintuitive for me.  I should have waited until they had \"gotten the bugs out\" of this concept before I invested in one.  I still love the concept of a wearable touch-screen phone, but this is not useable as it now stands.", "Date": "March 8, 2013"}, {"Title": "G13", "Author": "Krimson", "ReviewID": "R1WXFGGPPIUQPE", "Overall": "3.0", "Content": "It is very useful, the Internet on it kind of sucks though, I kept getting a box that said not enough memory.", "Date": "February 18, 2013"}, {"Title": "great for kids", "Author": "Tirso Cruise", "ReviewID": "RMU8BKUJ6NHSS", "Overall": "4.0", "Content": "works with my tmobile family plan.  I gave to my kids (middle school) and they thought its cool.  Voice quality is ok.  They can hear me fine on the phone, but my end there's a lot of static noise.  But it does the job.  The touch screen is bad.  Hard to input numbers even with the stylus.  Battery life seems long and charge quickly.  Not a standard usb cable, so don't loose it.  There's camera and voice recorder. I'm looking for a way so I can track their location like latitude.  If this has it, that would be great.  It's not waterproof.  If it last a year, I'm happy.", "Date": "January 31, 2013"}, {"Title": "Audio Player doesn't work", "Author": "K. CARPENTER", "ReviewID": "R1YHV3PNK9BGGG", "Overall": "2.0", "Content": "I mainly bought this for the bluetooth audio player. /i got the product in 9 days. considering im at an an air force base in kygyzstan that is completely unheard of, basically a miracle. however the second i opened the watch i had problems. the instructions for inserting sim and sd cards are horrible, not that i normally need them but they are sort of layered over one another in a strange fashion. it is also very cheap i broke one of the brackets by TOUCHING IT. since then ive found that, according to instructions supplied, the 4gb microsd is to big. idk if it doesnt work because the bracket or because it is only supposed to support 2gb. if anyone has any info to help me thatd be great but until something changes im giving this a two just because the actual phone portion is fine and the shipping was tremendous.", "Date": "July 28, 2012"}, {"Title": "blutooth is not working to headset i want a refund", "Author": "Ma Josephine P. Fajardo", "ReviewID": "R2L47LDVO9WX91", "Overall": "1.0", "Content": "The settings of the blutooth is different to manual the pair to the phone but it doesnt work  dont buy", "Date": "June 30, 2013"}, {"Title": "Crap", "Author": "Daniel E. Weinberg \"Daniel, E. Weinberg\"", "ReviewID": "R3RTMJ2DWE537Q", "Overall": "1.0", "Content": "I got this phone when it was 80 bucks.  It worked for 2 days then the back popped off leaving all the connections scattered. I tried to get a refund but they only wrote back after the refund had expired. Use Extreme caution when buying a cell phone watch!", "Date": "March 27, 2013"}, {"Title": "jesus", "Author": "jesus", "ReviewID": "R2ICCAP1DV710L", "Overall": "5.0", "Content": "es muy practico y bueno, es la mejor forma para no botar el teléfono o dejarlo olvidado en algun sitio", "Date": "January 11, 2013"}, {"Title": "Deficient blue tooth device", "Author": "Victor M Chavez", "ReviewID": "RENTMHWEGWS0D", "Overall": "2.0", "Content": "Pros. Has a powerful reception, most of the features work perfect. Depends on bluetooth headset,Cons. Communication with blue tooth is really bad when the battery is not full charged.  I haven't been able to pair with any bluetooth sound devices even following the instructions of the poor manual. Received headset damaged, I can hear but microphone doesn't work.Overall  Everything else works fine except Blue tooth that is vital for this wonderful device.", "Date": "December 7, 2012"}, {"Title": "go go power rangers!!", "Author": "Albert Santiago", "ReviewID": "R3EXAW7KACICTD", "Overall": "5.0", "Content": "I'm so happy, I wear it to work & no ones the wiser, I feel like a power ranger. Its morphin! Lol.", "Date": "June 25, 2012"}, {"Title": "not exactly  what I expected.", "Author": "nyiregyhazilany", "ReviewID": "R28MW8H2ZYS88E", "Overall": "2.0", "Content": "It was for my 11yr old son. Most of the part is OK but the mp3 player is not comparable with bluetooth or not working in this phone and you can not find an earplug that would fit in this phone. Watch out 3.5mm ear plugs are not comparable with this phone. So if you have a young child get ready to listen to his music ALL THE TIME - LOUD!", "Date": "April 23, 2013"}, {"Title": "needhelp", "Author": "cool phone", "ReviewID": "R8ZCLYAYLQ4JG", "Overall": "3.0", "Content": "I bought two of these phones i already have ublimited tmobile service i put my sims card in watch and everything works except my internet and sending and getting pictures am i doing somethig wrog what can i do to chage this", "Date": "July 25, 2012"}, {"Title": "On the right track", "Author": "ward81", "ReviewID": "R1C3CSPVWY5ZJW", "Overall": "3.0", "Content": "If you were a kid growing up in 90s you definetly fantasized about being able to talk on your watch. especially if you watched dick tracy. After I seen val kilmer talk to alfred on his wrist in batman forever, I knew they would make these things a reality one day. Well that day is finally here. I bought this on just to try it out since it was cheap and I figured it would be a good prototype. I think that the companies who make these watches are on the right track, but its still a few things that they need to work on. I was loving mine until it stopped reading my sim card. But I didn't get upset because you get what you pay for. My next one will be better.", "Date": "May 2, 2012"}, {"Title": "Feels like something you buy at a fair", "Author": "Parijat Prabhudesai", "ReviewID": "R26N7RLZQZ90NM", "Overall": "2.0", "Content": "This watch just feels like something you buy at a fair (jatra) for your kids. Needs a better looking industrial design. Features are really good for the price.", "Date": "February 7, 2014"}, {"Title": "Novelty", "Author": "Samuel Bharksuwan", "ReviewID": "R378S6YPGT3EXK", "Overall": "2.0", "Content": "People wonder and look when u talk to the watch.Poor craftsmanship.I bought it to see how practical it is. For me, I will get an iwatch from apple (whenever it comes out) and stop carrying my iPhone.", "Date": "April 17, 2013"}, {"Title": "battery does not work", "Author": "vanessa d.", "ReviewID": "R3SK1YXDU5P8H6", "Overall": "1.0", "Content": "not charge the battery and is not charging at all. so I bought something that I can not use. I can not return it since I am in Colombia and send it costs me the same as buying another watch phone", "Date": "August 22, 2013"}, {"Title": "Package is not as per description", "Author": "Bhaskar Kumar", "ReviewID": "R2X8PTAO7CHH23", "Overall": "1.0", "Content": "The Blue tooth head set is missing. SO I had to return it back. Even the charging is not happening properly.", "Date": "February 11, 2013"}, {"Title": "no internet access", "Author": "Patricia Williams", "ReviewID": "RRMVFQXEAGJH3", "Overall": "1.0", "Content": "I took this watchphone to ATT to get activated and they told me it had no internet access. I bought it for my grandson for Christmas and have just gotten around to activation. If it doesnt have internet access, I dont want it, but too much time has passed to exchange or return. Im stuck.", "Date": "November 25, 2013"}, {"Title": "Awful", "Author": "Amazon Customer \"lemydawe\"", "ReviewID": "R35MEU56BJ6R3E", "Overall": "2.0", "Content": "I purchaased this phone thinking it was good but it was as good as a dead one first it rejected it's own charger then it could not even accommodate the chip that came with it.Huhuh how do you expect this kind of thing to work when it has all these faults?No wonder it is from china.", "Date": "October 21, 2012"}, {"Title": "What a rip off!!", "Author": "Jacobo Schifter", "ReviewID": "R10A3HGO9OCKAP", "Overall": "1.0", "Content": "This watch did not come neither with the sylus, nor the hands free auricular. The instruction guide serves no purpose and the watch stopped working in a week. Don't buy this trash", "Date": "November 21, 2012"}, {"Title": "Poor quality", "Author": "christobal mozingo", "ReviewID": "R1OCYQ2USZ5UMX", "Overall": "1.0", "Content": "Super cool techie concept but the watch is poorly assembled. Micro SD card holder & SIM card holder do not securely maintain their connections & makes \"phone\" feature virtually worthless. Battery fits poorly into position as well. Watch out if you wash your hands while wearing this watch, any moisture creeps into the case. Do not waste your $$$ on this item. I would return it if I had the time & inclination.", "Date": "December 21, 2012"}, {"Title": "Da best", "Author": "Gman", "ReviewID": "R3F3SUK98XQDEG", "Overall": "5.0", "Content": "Awesome product my dude if u wan sa n dats da real deal den get dis cuz its truly amazin", "Date": "September 14, 2012"}], "ProductInfo": {"Price": "$69.99", "Features": "Primary Function: Mobile Phone Smart Watch with Touch Screen of 1.49 Inches\nGSM Compatibility: Quad-band 850MHz, 900MHz, 1800MHz, 1900MHz\nBattery Life - Talk Time: Up to 2.5 hours - Stand By: Up to 150 hours\nAlso Function as Video Camera and Media Players\nDimensions: - Watch: L:50 x W:40 x H:13.8 (mm) - Strap: Adjustable", "Name": "SVP G13 (With Micro 4gb) Black Camera GSM Quad-band Smart Watch Phone ~ Unlocked ~", "ImgURL": "http://ecx.images-amazon.com/images/I/41fhQCMZiJL._SY300_.jpg", "ProductID": "B005Z294OQ"}}