{"Reviews": [{"Title": "OInitial Review", "Author": "John F. Davis", "ReviewID": "RDC95I7KEQEMO", "Overall": "4.0", "Content": "I got this phone as a replacemnt for my broken nexus one.  I know its about half the performance of the nexus one but its also 1/4 the price.Considering the price it rocks.  Its slow but acceptable.  It does run the android opengl gears program.  It gets about 45 fps.  Out of the box it works with edge and wifi.  It does not work 3G with T-Mobile.  I am not sure if this is an APN problem or a simcard problem.  I'll keep at it.  According to online specs T-Mobile uses a frequency range which is supported by this phone.", "Date": "November 5, 2011"}, {"Title": "Good Basic Smartphone", "Author": "Jessica Harris", "ReviewID": "R2FUBGQWB27IG6", "Overall": "4.0", "Content": "This is a good basic smart phone and works well as an itroduction to this type of technology. Works well.", "Date": "December 12, 2011"}, {"Title": "Gets T-Mobile 3G!  Brisk!  Phone comparisons...", "Author": "Von", "ReviewID": "R30QXIECS1V5ES", "Overall": "4.0", "Content": "Hello, I was hesitant to buy this phone due to reading reviews which said it did not get 3g, SIM card did not work, etc.  I got this phone for about $60 in used condition from ReliableCellular (I thought the back cover would be blue..it is black.  However, they did include a USB cord and charger which the ad said would not be included!)  Shipping took a few days longer than desired (but not longer than approximated) but the device arrived in great condition...not 1 scratch on the screen (which can affect Swype typing/screen selections), only several small scratches on the back.  I am SO satisfied with this phone...I will certainly be keeping it!  However, I am sending back a phone which I got for slightly cheaper: Samsung Galaxy 5 Europa (i5500).  Aside from it only getting EDGE (which I knew before buying it) the screen response was very inaccurate (Swype as well as recognizing taps), it was SLOW to react (5+ seconds for basic homescreen selections...much much slower loading websites) whereas the U8150 Comet is usually brisk (1-3 seconds to open a homescreen item, about 10+ seconds to load a webpage.)  I saw a video review complaining about the lack of buttons on the side but I like that aspect.  Often times side buttons are activated while I have a phone in the \"car mount\" since the car mount arms squeeze the side of the phone (I navigate a LOT).  I have not had such a problem with this phone yet and the only concern would be volume, not camera also being activated, or the charging port being blocked (all were worries that I had with my often laggy MyTouch 4G Slide Dual core phone which I just sold.)  The video also made it seem like the middle d-pad would be difficult to use and it does look quite flush against the phone in pictures..but it is not.  It is raised enough for me to click up, down, and side to side with zero problems (I mainly use it for scrolling a screen or editing between tiny letters).  Oh and the screen on this phone is brighter than on the Samsung Galaxy 5!  I had them side by side at full brightness.  The colors were less faded/tinted on the U8150 Comet..more Neon-like and the homescreen icons - even though the screens are the same size - were slightly larger on the U8150.  I was worried that the slender vertical buttons would become painful to fingers but all buttons on this phone feel perfect: enough resistance to resist an accidental bumping into but enough give to prevent one from needing to press hard.  This has TONS more built-in widgets/shortcuts than the Samsung Galaxy 5 Europa.  For example...instead of merely a Settings shortcut, I can have a shortcut to Bluetooth within settings.  There is also a readily available music toggle widget which the Samsung did not have.This came with Android 2.2 as did the Samsung (which I think was \"rooted\" (and perhaps didnt have the official 2.2 since I saw \"root-...\" under the Samsung's version info) yet the U8150 came with 5 screens...the Samsung came with only 3 screens which I was able to bump up to 4 screens by tweaking a homescreen setting.The Samsung came with horizontal menu scrolling and I didnt see a way to change that.  The U8150 Comet has vertical scrolling - which I prefer.The battery life seems slightly better on this phone than on the Samsung but both were used phones/batteries so maybe the Samsung's was older...I dont know.  This phone is more obedient and predictable.  Even when I had the Samsung Galaxy 5 on SILENT, it would make a kind of loud vibrating/buzzing noise when I unlocked the screen (haptic feedback was off..everything such as that was turned OFF.)  Both the Samsung and the Huawei U8150 Comet did that but the Comet's sound is much lower.  You can get rid of that unlock vibration by making it unlock via Pattern (probably by code as well.)  I dont like a loud phone...so it annoyed me that even at the LOWEST volume settings, the Samsung was loud (yet voice volume was only \"okay\" when set to the loudest level...odd.  The U8150 Comet is louder on calls.)  The Comet has an actual LOW to semi-high ringing range.The negatives of the U8150 Comet?  Camera - very blurry/out of focus...even worse than I had anticipated and worse than the Samsung Galaxy 5 in the same lighting (which admittedly was dim)Screen seems a tiny bit fuzzier than on the Samsung Galazy 5 but the improved brightness, colors, and viewing size is more important to me.Android Market/Google Play - I have been prevented from downloading 1 or 2 things that the MyTouch 4g was able to download...but not big surprise there.  Just thought I should let you know though.  One of them was Yahoo Voice/Video calling.This lacks the handy \"recently used applications\" section in the upper notification bar area (which the Samsung Galaxy 5 also did not have but the MyTouch 4g did have) but holding the Home button gave a similar effect.This phone does not have a widget-like data control panel built into the notification area whereas the Samsung Galaxy 5 did.  But I think the homescreen widget is nearly as convenient.Overall, this U8150 Comet is a great substitute for my old MyTouch 4g.  Worse camera, but faster reaction times.  Slightly worse website loading speed, but about 1/3 the weight of the MyTouch 4G Slide.  Oh, and the Comet gave me no problems with my T-Mobile SIM, or syncing gmail, yahoo mail, etc.  Recption seems the same as the Samsung or MyTouch...nothing amazing or bad.  If you are curious about \"hot swappability\"...this one's SD card slot is not.  The Samsung's was hot swappable/change out without removing the battery.  The comet has about the easiest to open back cover ever...just slide it down firmly and I opens. :)Happy shopping to you.", "Date": "July 5, 2012"}, {"Title": "Bad Service", "Author": "Christian Hernandez B", "ReviewID": "R2VGGGPTW5586D", "Overall": "1.0", "Content": "I bougth this phone because it was announce as unlocked ... but It was locked and they did't give me a solution", "Date": "July 23, 2013"}, {"Title": "It' light, Good looking.", "Author": "Baoxia Guo", "ReviewID": "R2VT3J1JARORIR", "Overall": "4.0", "Content": "It's light, and comes with two color back cover(blue and yellow).The battery can last for two days. It's just a little bit slow. But over all sounds good for this price.", "Date": "April 27, 2013"}, {"Title": "Huawei Ideos", "Author": "Gilmer D. Mendoza S. \"Gozarteum\"", "ReviewID": "R3PIZ4IY5C91T5", "Overall": "4.0", "Content": "A small good android phone, Easy to carry and .Good camera  and nice screen.I woul recommend it to anyone with short budget.Nice.", "Date": "March 12, 2013"}, {"Title": "Everything you want for a low budget phone - Really worth the money", "Author": "Maria M.", "ReviewID": "R3V5KYX8NP6VMQ", "Overall": "5.0", "Content": "I just wanted a modest smartphone with Android and basic features such as Twitter app, as well as video download and music storage. This model allows you to upgrade to the latest version of Android, but make you sure you use it with a 16GB or a 32GB class 10 memory card. I honestly use it as an iPod touch with iPhone qualities ^^ since I can't afford those.It is surprinsingly versatile, compact, small, practical. The only downside is the camera that doesn't have a flash and it's of standard quality, but since I don't live taking pictures of everything every day, I don't really care ^^This phone is discrete, it wouldn't seem fancy at first, but it demonstrates great functionalities. I would say that it's great if you are a work oriented person, and you're out of the brouhaha of the eternal iphone vs blackberry, samsung vs iphone, samsung vs google vs nokia vs everyone else, etc.Huawei is a solid brand that may become the next Samsung.", "Date": "August 2, 2013"}, {"Title": "A good phone", "Author": "rhoc6", "ReviewID": "R1UNG4WG7MK74B", "Overall": "3.0", "Content": "I've had this phone for over a year. It's a decent phone especially for someone getting a smartphone for the first time. If you are a big fan of apps I would not recommend it though. The phones memory is not very large and even with a micro sd card many of the apps are non-tranferable causing the memory to fill quickly.", "Date": "January 30, 2013"}, {"Title": "smaller than i thought it would be", "Author": "josanne green", "ReviewID": "R9XA3H93Z8R5A", "Overall": "4.0", "Content": "bought for my sis, her first smartphone so it served the purpose but it is real tiny. guess i did not pay enough attention to the specs", "Date": "January 13, 2013"}, {"Title": "Huawei 8150... nice with some quirks..", "Author": "A. Chamish", "ReviewID": "R2DCWWSG2BVUJN", "Overall": "4.0", "Content": "I got this gadget a while ago.  It has a small screen (reqiures the use of fingers smaller than mine....),  and it is slightly slow.Additional deficiencies compared to the $700 phones are the older version of Android (not a problem for me) and the smaller 512M RAM which requires frequent stopping of applications running in the background (that one is a burden).Other then that it runs any app I throw at it, and works just fine... Bottom line:  This one is a great value in the Android phones arena!!!  For the price I can put up with some limitations", "Date": "December 30, 2012"}, {"Title": "Good value", "Author": "Kiddoc", "ReviewID": "RE7HAJKVEI97P", "Overall": "4.0", "Content": "For an entry level android that could take an international sim card this was a reasonable deal.  No comparison to my every day phone but worth the money for that use.", "Date": "February 12, 2013"}, {"Title": "Phone kept shutting off but good features", "Author": "Magpiemags", "ReviewID": "R24ZTLTLCYB65H", "Overall": "3.0", "Content": "This was my first Android and I really liked most of the features, but phone kept shutting off.  I am using Straight Talk plan with ATT compatible sim card so I'm not sure if that was the problem since it's a T-Mobile phone.  I didn't have the problem for the first few days.  After downloading a few apps, the phone started randomly shutting off.  Took a chance with this brand and am a bit let down.  Also, had major problems connecting my Bluetooth - kept having to pair with ear piece.  Just sent back to seller, but am buying a Samsung from them since they are great!  (Cell-Source)", "Date": "November 8, 2013"}, {"Title": "wrong ...this does not have 3G for ATT...850/1900", "Author": "nashnash", "ReviewID": "R3VTH9N45B9QJW", "Overall": "3.0", "Content": "This phone does not have the ATT 3G bands as described.  I will let Amazon know this.  I bought the Nokia C-6 which has all the ATT & Tmobile 3G bands. I wished this did since it's android.", "Date": "August 25, 2011"}, {"Title": "Great phone", "Author": "Nasty", "ReviewID": "RQDMNCPMMM8SH", "Overall": "5.0", "Content": "This is my first Android phone. I wanted to have access to all the features of the Android world without the price that the carriers charge to get them. This fits he bill and then some. Great phone and great customer service. Thank's.", "Date": "February 3, 2013"}, {"Title": "very happy got what i wanted", "Author": "larrykh465", "ReviewID": "R3SBP21GRVZPIE", "Overall": "5.0", "Content": "after trying a different android phone that i was not happy with i decided to try again.i first bought the used one but wouldn't read sim card so i sent back got new one.so far the battery life is acceptable and the phone itself is really nice i don't think for the price you will find a better one", "Date": "February 5, 2012"}, {"Title": "ambar gonzalez", "Author": "Ambar Gonzalez", "ReviewID": "R29ISU3AXV1RAV", "Overall": "5.0", "Content": "El producto y la atención recibida son de excelente calidad gracias por sus servicios y tomare en cuenta para próximas compras", "Date": "March 11, 2013"}, {"Title": "Huawei U8150 Ideos Unlocked", "Author": "Juan Carlos Hidalgo", "ReviewID": "R3CF92W1R9VLBI", "Overall": "4.0", "Content": "this is my first huawei, usually use Nokia, but i fell this is a great phone, aldough the operative system was almost obsolete, because today is commoon found cell with android 4.0 or above.", "Date": "March 4, 2013"}, {"Title": "Very small-not suitable for big fingers", "Author": "d.argueta", "ReviewID": "R31VR5FYZDKHKO", "Overall": "2.0", "Content": "I have the 4S and although I wasn't expecting this to replace it, I did want it to be a decent back-up.  It wasn't.  It's very small and the clarity of the screen isn't all that great.  Not to mention it didn't come with a wall charger.  It came with two adapters for a wall connection but for int'l use-not U.S.  So if I wanted to charge it I would have to connect it through my cpu or using my Kindle's charger.Seller should have mentioned this.", "Date": "November 23, 2012"}, {"Title": "It did not Work", "Author": "George E. Jones", "ReviewID": "R2F9NBEBDO3U7H", "Overall": "1.0", "Content": "This supposedly unlocked U8150 did not work.I tried 2 different \"working\" SIM Cards to no Avail.Kept saying \"Insert SIM Card\"Well ... Buyer BEWARE on this sick puppy.", "Date": "December 2, 2011"}, {"Title": "What?  Plans cost how much ?  What ? ????  Need to know before you buy a Smart Phone", "Author": "levelone", "ReviewID": "R2NRLIDNWCGXHW", "Overall": "2.0", "Content": "Service for this phone or any Smart Phone is Way way way over the top !!  AT 600 bucks a Year to Start !!  2013..  Unbelievable !! Thats right.. 600 bucks !!!  Bare Bones for 600 Bucks  !!  It can go over 1000 bucks a year if you want to make phone calls. Anyone even considering a smart Phone better consider that!  I would say something here about Smart phone owners and users now that I know the costs to use. .. O well.. My Sister has one... So.. I will keep my opinions to my self..", "Date": "December 7, 2013"}, {"Title": "Huawei U8150 Ideos", "Author": "A M", "ReviewID": "R19YPAO6QB8OTC", "Overall": "1.0", "Content": "the screen doesn't work nor any of the key and am figuring out how to return it back. I have to read the return policy.", "Date": "January 31, 2013"}, {"Title": "Found it less than helpful", "Author": "Ernest D. West \"Ernie West\"", "ReviewID": "R1XBRBEL0E7VQE", "Overall": "1.0", "Content": "found it awkward to use. Went back to my old phone which is much easier to use and less querky.Do not require a certain number of words in reviews or you will get no more reviews from me.", "Date": "April 21, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0056HNTAK"}}