{"Reviews": [{"Title": "Kyocera Milano- not as sweet as the cookie it's named after, but not all bad.", "Author": "Ragabash", "ReviewID": "R2KOBQ7XBG1GF3", "Overall": "3.0", "Content": "I wanted a phone with internet capability, but I wanted a slide out keyboard, a small physical size, and something fairly durable. I don't need the latest iGadget.Picked up the Milano from Radio Shack.First- Let me say that I am not a power user. I don't need tons of Apps.It's a darn good thing, because after installing maybe a half-a-dozen very basic Apps this phone is out of memory. I moved everything I could to the SD card. I deleted anything I wasn't using, even pre-installed stuff. I have to stay on top of deleting the data from stuff like Google Maps and the email app. I also have to manually refuse Updates so that I can preserve memory. Well, I knew this phone had small memory, so I guess I got what I got.Second- battery life. Seems to be up and down. I let it discharge to zero regularly and keep it charged whenever possible. If you are in an area with good signal it will run 8-10 hours without a charge if you are not using 3G. If you are using 3G it will last a couple hours. If you have bad signal strength it won't last the night even sitting in your pocket.Third- Annoying freeze-up when unlocking the screen. Phone automatically locks the screen, when you swipe the unlock icon, the screen freezes. Phone will not respond to any button or swiping or anything until it is darn well ready to. This can last at best a few seconds, at worst a few minutes. Most annoying is when you need to use it RIGHT NOW, such as when you need to take a picture of the license plate of that guy who just did a hit-and-run, or to call 911.Heck, it will freeze when trying to answer an incoming call. It's worse if you leave an App running when it goes into lock mode, such as you are trying to take a picture and the screen times out and locks. Or if you left an internet browser window open and stuck it in your pocket. But there's plenty of times nothing is running, and it won't unfreeze. This may be the most annoying thing about this phone.Fourth- Signal strength. My wife has a different model Sprint phone. Hers will have four bars. My Milano will have two. Hers has a good 3G signal. My Milano won't connect. She calls me. I answer, and then I get \"Signal Faded-Call Disconnected\" without moving from my chair. Maybe the smaller size has a smaller antenna, but I can't see it being that much different.Now, there are some good things about the phone. The slider mechanism is solid and rugged. It stayed tight after all my abuse. The screen has not broken, even outlived two screen protectors. I don't bother with a screen protector now, and it hasn't scratched. I've dropped it a few times and it has not broken, even when the battery has been flung out by landing on concrete. I dropped it in the toilet once (Luckily, clean water) and after popping the case open and rinsing the board in alcohol and drying it with a hair dryer, I put the battery in, it turned on and worked fine. The speaker volume and rings are still loud. The backlight is good. The screen, while small, is of good quality and resolution. The charging socket hasn't broken yet and the protector flap has kept it clean of pocket crud. The keys in the slide out keyboard mostly all work (the \"Q\" key is finicky, and the \"A\" key takes a bit more force) and the hotkey that adds \".com\" in one keystroke is very handy.Would I buy it again? Mmm, I dunno. For what it is, it does OK. If they could up the memory, solve the freezing problem and get the battery life better, I might.", "Date": "September 9, 2013"}, {"Title": "Worst Phone I Have Ever Used", "Author": "Roger Lunsford", "ReviewID": "R3CNEP9P11AXJM", "Overall": "1.0", "Content": "I purchased the Kyocera Milano about 3 months ago and I have to say, this is the worst phone I have ever used in my entire life.  The battery life is great but the phone has so many troubles the battery life doesnt really matter.  The first problem, right out of the box, was that the phone immediately started giving \"Low Space Warnings\".  I tried to put 2 apps on the phone to use but every time I try to open them it crashes the phone after spitting multiple Low Space warnings.  Within a month the SD card started unmounting itself.  This causes even more Low Space Warnings to pop up.  You also have to remove the battery in order to get to the SD card making it a pain to reset and remount the card.  Within several hours the SD card will unmount itself again so get used to pulling this phone apart multiple times on a daily basis.  Now, the touch screen has started locking up.  When this happens you cant do anything with the phone as you cant unlock the screen to answer calls or txt messages.  In summary, this phone is a piece of junk that you should avoid like the plague.  Even at the price of .01 cent you are still overpaying for this phone.  I will be buying a new phone as soon as possible and after this horrible experience it will certainly not be in the Kyocera family.  I'm not one to use my phone for much other than calls, texts and facebook posting so I thought any phone should be able to handle those tasks.  I have since learned that is not the case.", "Date": "December 29, 2013"}, {"Title": "internal storage", "Author": "eg", "ReviewID": "R38PHY5CY6QD9T", "Overall": "2.0", "Content": "My phone is pretty good, works well and is pretty strong and reliable, the only problem is (and its a big one) is that there is only 150 mb of internal storag, the only app I have is whatsapp and I don't have room for anything else on it!!! In addition if it gets within 15 mb of the limit it won't accept or send emails... that's un acceptable to me...", "Date": "June 19, 2013"}, {"Title": "Stay away from this phone!", "Author": "Angel", "ReviewID": "R3JOPDS8P19HA4", "Overall": "1.0", "Content": "Luckily I am not stuck in a Sprint contract anymore, nor am I throwing away cash on new phones that cost an arm & a leg. This phone is available from the sister company for Sprint & I was able to get it at a really low price from them. I wondered why the price was so low. :( Should have read the reviews before purchasing, but by the time I got the phone home & activated it, that's when I noticed the reviews are horrible for this phone.Well, I figured it can't be that bad. Touch screen, pull out key pad, visual voice mail. Looked good to me. Call quality is good.Battery life is non existent. This phone lives on life support. Text, Facebook & nothing else this battery will last maybe 3 hours. If I do nothing at all on it the battery will last overnight (7 hours) at most.Say goodbye right now to your apps if you have this phone or have ordered it, because I have had a notification come on & stay on that my phone has little to no more storage available. I have most of my apps that are moveable on the SD card & what I can't store there, I keep just 2 small apps & nothing else on this phone. No pictures, no saved text messages, no call records, nothing. My entire contacts list is on my SD card.I have removed every app from my phone & only thing remaining is the factory apps (I remove updates and 10 minutes later they are re-installed on their own) & still the notification says that I have no memory left.At this point I am not getting any of my voice mails, because there is no memory left. I'm not sure what else the phone has decided to stop allowing & honestly I do not want to find out. I am replacing this phone ASAP.Do not buy this phone. It is a waste of money & if you are upgrading your Sprint contract for another year or 2 just for that discount to get this phone, don't do it. Get a phone that is worth the extra year or 2 on that contract, because this one is not it.", "Date": "May 31, 2013"}, {"Title": "keep looking", "Author": "L. Holtz", "ReviewID": "R2EUF9FJPA2ARA", "Overall": "1.0", "Content": "Sprint is awesome. This phone however is a piece of junk. One problem after another, constant issues of all kinds. Difficult to swipe, sometimes just won't turn on, dies every now and then for the heck of it. I am done with this waste of time. Save yourself the grief and keep looking.", "Date": "March 3, 2013"}, {"Title": "kyocera milano", "Author": "flyers rule", "ReviewID": "RD6WLQZ05Y2RH", "Overall": "4.0", "Content": "this is my first phone from sprint that didn't break in less than a week. its not the phones its the servious. its a pretty beast phone", "Date": "September 26, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Kyocera Milano Android Phone (Sprint)", "ImgURL": "NULL", "ProductID": "B005LHNN9M"}}