{"Reviews": [{"Title": "the phone is good", "Author": "Frank", "ReviewID": "R21PGLDNAGGNUY", "Overall": "5.0", "Content": "the phone is very good, just like the seller described, the internatioal version, because i'm chinese, i don't want to use the english system, so it's good for me, and the delivery is very quick of 2 days. now i have used it for about 1 month, there's nothing wrong with it. I like it .", "Date": "February 17, 2012"}, {"Title": "Xperia Arc S", "Author": "luigi clemente brescia", "ReviewID": "R38WFMUSQZXWFP", "Overall": "4.0", "Content": "excellent produc, I recommend to 100%.About the shipping, I am also satified, that arrived in timeSony Ericsson Arc S LT18i Unlocked GSM Cellular Phone--International Version, no Warranty (Black)", "Date": "January 20, 2012"}, {"Title": "Love it", "Author": "Andriy Melnychenko \"Andry\"", "ReviewID": "RIO41OAO34GAO", "Overall": "5.0", "Content": "Had it for 4 months works perfec! Haven't had a problem,very nice looking phone. I got it on tmobile carrier it perfect for it!", "Date": "April 2, 2012"}, {"Title": "the best", "Author": "Tamia", "ReviewID": "R2BLYQ1P25CABQ", "Overall": "5.0", "Content": "I chosee this cell because of its camera, weight, 16 gb, and design. I started using it 3 weeks ago and  I really like it.", "Date": "January 3, 2013"}, {"Title": "Amazing", "Author": "Karim S.", "ReviewID": "R9TTTBCA09VFJ", "Overall": "5.0", "Content": "Really impressed by its performance, easily comparable to an iPhone.However, they tried to cut costs tremendously in the materials used.", "Date": "August 9, 2012"}, {"Title": "Calcification.", "Author": "Alfonso Gonzalez", "ReviewID": "R1S0MQ3PFPGYU5", "Overall": "5.0", "Content": "Hola. La compra excelente y rapido despacho del proveedor al currier. 100% recomendable. Excelente producto. Lo unico malo fueron los dos meses que se tardo el courrier en Miami para hacer llegar el telefono a Venezuela. LibertyExpress.", "Date": "April 14, 2012"}, {"Title": "Objection to the sale of counterfeit", "Author": "mitra", "ReviewID": "R1KWTZHGFSL7C", "Overall": "1.0", "Content": "I bought this cell phone for gift but it was not International version \"it was made for Israel\" .  you cheat on me, I am going to prosecution on it. it was  Hebrew version and had a big problem in capturing picture and taking video.  I collect many Attributable details about  phone problem and issue, so what is your suggestion  before  Prosecution?", "Date": "September 14, 2013"}, {"Title": "vever", "Author": "CESAR ORTIZ", "ReviewID": "R3HU927CM976O5", "Overall": "1.0", "Content": "I dont received this product, ecuator aduanas tell me \"EEUU steal the product, EEUU send me only the empty box, i dont happy, i dont triete, I lost my money", "Date": "January 28, 2013"}, {"Title": "Definitely a nice phone", "Author": "Julio Alcalá", "ReviewID": "RSUFDQJOQZSTB", "Overall": "5.0", "Content": "Definitely a nice phone, beautifull, easy to manage. It was better than expected, with all the features and stuffs. Very satisfy with my purchase and the seller as well.", "Date": "January 23, 2013"}, {"Title": "ship without a power charge", "Author": "Binh", "ReviewID": "R1GA5DP5AH8B34", "Overall": "1.0", "Content": "the product is NOT new as advertised, a lot of cracks on the back. shipped with NO power charge cable. Unbelievable, It's terrible deal of mine", "Date": "September 1, 2012"}, {"Title": "Sony Ericsson Arc S LT18i Unlocked GSM Cellular Phone--International Version, no Warranty (Black) (Wireless Phone Accessory)", "Author": "amarilis", "ReviewID": "R2SFK77KMKGXJZ", "Overall": "4.0", "Content": "satisfied with the product is as described, but has a manufacturing defect or the solution would be to upgrade but do not think", "Date": "July 31, 2012"}, {"Title": "not bad", "Author": "Gustavovd", "ReviewID": "RKP19K03SKV9S", "Overall": "4.0", "Content": "Good phone... pretty fast, no bugs so far... the headphones are good... the new android is not amazing... but works", "Date": "June 15, 2012"}, {"Title": "fantastic!", "Author": "Review_ve", "ReviewID": "R23LCCEEUF7U9", "Overall": "5.0", "Content": "just an awesome mobilphone.. in my country there is a black  berry fever, but this guy rocks..  is a wonderfull phone.. or better than it, its a small pc.. but lighter. jeje", "Date": "March 16, 2012"}, {"Title": "3 Weeks and still in love!!!", "Author": "John_theripper", "ReviewID": "R3CMF68S5XCXH0", "Overall": "5.0", "Content": "I must say I love this phone...is one of the greatest creation of SonyEricsson (and I think the last one with that brand), a little worried about battery life, but i give it a really heavy use, so 24hrs is fair. Waiting for ICS to try it and review again...so far so good my wife hates the phone because i spent a lot of time with it, playing, hearing msic and sometimes even just stearing at it...hahahah", "Date": "March 15, 2012"}, {"Title": "The best phone I ever had", "Author": "J. R. Perez", "ReviewID": "R1E7TA57MTN02P", "Overall": "5.0", "Content": "I though that a 4.3 inch screen was too big, but now I am very happy with it. The phone is excellent, good speed, a nice interface thanks to Sony, very nice options, beside that Sony has some accesories that make your expirience even better. The quality of the photos are amazing and the fact it has Android make it increible. Sony has announced that soon will be release ICS for this phone, so I cannot wait.", "Date": "March 13, 2012"}, {"Title": "Mr.", "Author": "envique", "ReviewID": "R2LO6R88YVMYM9", "Overall": "4.0", "Content": "I recieved the product in the mentioned time period. The packing was good. The only backdrop i found with this mobile is it doesn't have a front camera.", "Date": "March 2, 2012"}, {"Title": "I really like it", "Author": "ken", "ReviewID": "R2G7BGAM1DZO4P", "Overall": "5.0", "Content": "is it brand new box with Battery and Charger * 1 Handsfree, and 8GB Memory Card * 1 USB Cable * User Guide? because I want to buy but I am confused.", "Date": "February 13, 2012"}, {"Title": "excellent product", "Author": "Ramirez Carlos", "ReviewID": "RU90Z9XLAR618", "Overall": "5.0", "Content": "GSM 850 / 900 / 1800 / 1900 HSDPA 900/1900/2100. Android OS, v2.3.4 (Gingerbread), planned upgrade to v4.0. Qualcomm MSM8255T Snapdragon. 1.4 GHz Scorpion. microSD, up to 32GB, 8 GB included. Internal Memory 1 GB (320 MB user-available), 512 MB RAM. Wi-Fi 802.11 b/g/n, DLNA, Wi-Fi hotspot. camera 8 MP, 3264x2448 pixels, autofocus, LED flash.", "Date": "March 23, 2012"}], "ProductInfo": {"Price": "$169.99", "Features": null, "Name": "Sony Ericsson Arc S LT18i Unlocked GSM Cellular Phone--International Version, no Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41oChbLDaOL._SY300_.jpg", "ProductID": "B005XH4024"}}