{"Reviews": [{"Title": "Standing By Their Products", "Author": "harley", "ReviewID": "R3LD285JSHAR57", "Overall": "5.0", "Content": "Well, this is an update to the purchase I made regarding a used cellular phone. I want to give this company a 5 star rating. Not because the product I received was spectacular. The truth is I had to make 2 returns because the product was not fully functional. The reason I am giving a 5 star rating is because of the way the company handled the problems that came up with this pruchase. Think about it. Businesses are not perfect. It is how they promptly try to correct the mistakes that make you want to be a return customer. I would absolutely purchase another product from this company. They keep true to their word and want to satisfy their customers. It is when a problem arises that you see the true integrity in a company and it's employees. They definately demonstrated that to me.", "Date": "November 1, 2011"}, {"Title": "okay but wouldn't buy it again", "Author": "J. Jimenez", "ReviewID": "R3ACCJGHRJ7AVX", "Overall": "3.0", "Content": "It works okay when it comes to talking and sending regular messages but I am unable to receive picture and sound messages and I also can't send them. Also, the phone is difficult to charge because it's loose or something and I've already had to buy two chargers for it! do not recommend.", "Date": "January 8, 2012"}, {"Title": "Very Good", "Author": "colombo", "ReviewID": "R2VGI876LBY7HO", "Overall": "4.0", "Content": "I bought this phone for my daughtwer who is very rough on her stuff.  This phone is durable and she loves it.", "Date": "October 19, 2011"}, {"Title": "LG EnV phone", "Author": "annsez", "ReviewID": "R10DG7QS59E8ME", "Overall": "4.0", "Content": "I was hesitant to buy a pre-owned phone, but the price was right! My kid loves it. She talks and texts all she wants. I think the screen is a little small for an adult to read email and such, but it is a great phone for a \"tween\".", "Date": "March 15, 2012"}, {"Title": "Burned", "Author": "Burned", "ReviewID": "R26ZABN7EHVJMX", "Overall": "1.0", "Content": "There was no serial # on the cel phone so it could not be turned on by Verizon. They suggested that it may have been stolen. Nice huh? It was supposed to be my granddaughter's 14th b'day present. Boy was I schucked.", "Date": "October 28, 2011"}, {"Title": "Not good......", "Author": "Marlissa", "ReviewID": "R2FLOLYDYPH2UZ", "Overall": "1.0", "Content": "This phone its now giving problems, it gets suck on screen and freezes quite often. Not money well spent. It also seems to be dropped more often then not.", "Date": "March 3, 2013"}, {"Title": "verizon phone", "Author": "scott w", "ReviewID": "R11507MJPP8GA3", "Overall": "1.0", "Content": "The phone is cheaply made , the place where you plug it in to charge it became loose in less than a month and now dont work.", "Date": "May 23, 2012"}, {"Title": "Phone doesn't work.", "Author": "Student", "ReviewID": "R10QEK0H325R62", "Overall": "1.0", "Content": "Simple enough review.  I received the correct phone as ordered, but the phone would not connect to the verizion network.  Verizion spent a little over 45 min. working with me to activate the phone, and in the end stated that the phone must have a defective transmitter.  I have contacted the vendor and am awaiting thier reply.", "Date": "November 9, 2011"}, {"Title": "Verizon LG VX9900 camera phone", "Author": "Shooter8571", "ReviewID": "R1YOIN0QN481GD", "Overall": "3.0", "Content": "The phone is fine and was delivered on the date promised but they sent the wrong charger for the phone. So even though I saved some money on the phone I was screwed and had to buy a new charger. I wouldn't recommend buying from this seller.", "Date": "October 17, 2011"}, {"Title": "phone review", "Author": "dawn", "ReviewID": "R3V370QXQC4IO3", "Overall": "1.0", "Content": "No the phone peeled paint in two days and cracked on the screen. i wasn't happy with the phone at all", "Date": "June 8, 2014"}, {"Title": "Older Models WAY better", "Author": "Elizabeth Franck", "ReviewID": "R1WO3K4YIQNTY8", "Overall": "2.0", "Content": "I had an older LG Flip phone for 3 years and dropped it in water so I had no choice but to replace it. This screen is so tiny!! Texting is difficult because you have to \"add\" the contact now. Before you could search with the first letter of the name and just select. People complain about an echo when on speakerphone. Very disappointed.", "Date": "March 27, 2014"}, {"Title": "orange phone", "Author": "pat burley", "ReviewID": "R8SF04IC3HN8X", "Overall": "4.0", "Content": "like the phone it self had issues with it charger broke second day having it! the phone has a  buzz in it  when dialing numbers", "Date": "January 29, 2014"}, {"Title": "It was my favorite phone until I moved to a smart phone.", "Author": "ktm", "ReviewID": "R479NOPEMT5OI", "Overall": "3.0", "Content": "Worked great. I still have 4 in the box. I liked this phone so much that I stocked up on them as they are hard to find.", "Date": "May 10, 2013"}, {"Title": "one of the world's great phones", "Author": "Dirty Fingernails", "ReviewID": "R1SVE94URQXJWR", "Overall": "5.0", "Content": "The original EnV is durable, functional and fantastic.  Only problem is with VERIZON: they will not support backup assistant on it for your contacts so when you change phones you will have to do a hardwire transfer in store.", "Date": "May 8, 2013"}, {"Title": "Pleased", "Author": "EmileyM", "ReviewID": "R1DTT32GAI1HEV", "Overall": "3.0", "Content": "I was really pleased with my phone. I got it for 60 dollars it was all nice and cleaned up. Plus, I got it three days earlier than supposed too!(: it also works great!", "Date": "September 14, 2012"}, {"Title": "Orange cell Phone", "Author": "Jesse", "ReviewID": "R2Q3ZYM3FG6QP0", "Overall": "5.0", "Content": "I got the Cell Phone because I lost my old one. But now I have a better one that cost me less. and I got one that was better quality for less than what I paid for my First one. I also was able to stay at home and buy it on the internet at Amazon.com  Plus I have Cell phone insurance that is active in august that if I loose my cell they replace it at the same value cost as I bought it or I can get a better one and get a huge discount on it", "Date": "July 21, 2012"}, {"Title": "New LG VX9900 phone", "Author": "Paul Johnson", "ReviewID": "R2X3KWV69CEGL0", "Overall": "5.0", "Content": "Great product. Brand New. Original box.  Went to Verizon today and had my contacts moved over. Easy! No contract extension. Better camera than i thought it would have.", "Date": "July 21, 2012"}, {"Title": "great phone for my teenager", "Author": "JML", "ReviewID": "R55VJX3VUN063", "Overall": "5.0", "Content": "had trouble with first phone shipped (some keys stopped working) however company quickly mailed a replacement with a return shipping label.  the phone is working great so far.  you cant beat the product price.  its a great \"basic\" phone for my teenager who does not need a \"fancy\" phone just yet.  i highly recommend the phone and the seller!!!", "Date": "July 15, 2012"}, {"Title": "Awesome at the time.", "Author": "M. Couchman", "ReviewID": "R2AZTKYOSY5IOS", "Overall": "4.0", "Content": "I went through three in the first month, but the fourth one lasted me for the next year and a half loved that phone.  It was like a brick, well it was kind of a brick. It had the best reception of nearly any phone I had up to that point and even now.", "Date": "July 8, 2012"}, {"Title": "LOVE this phone.  Will never get rid of it!", "Author": "jesus4me", "ReviewID": "R1Z4YSK7I4M2OS", "Overall": "5.0", "Content": "I purchased this phone in 2007 when it was the new \"hot item\" at the time.  I love it and have experienced zero problems with this phone.  It's not all fancy and computerized like the newer models out now.  However, if you can get past that and are not bothered by having the latest technology for phones...you will not be disappointed.  I go for functional...not glitz and glamor.  The pros:  No dropped calls, great reception, text messaging and picture messaging capabilities; navagation, decent camera and video cam. The QWERTY board is perfect for texting...great sized buttons for any sized thumbs...no irritation of touch screen and auto correction!  I will never get another phone no matter how many free upgrades I'm offered. LOL", "Date": "June 23, 2012"}, {"Title": "A+++", "Author": "Vanessa", "ReviewID": "R2A4WVGV39YNTQ", "Overall": "5.0", "Content": "Orange LG VX9900 ENV QWERTY Camera Cell Phone for Verizon Wireless - No Contract requiredReceived my phone this morning, and it is EXACTLY what I wanted! Had absolutely no problem whatsoever setting it up and activating it on my account. I will definitely buy from this seller again no doubt. Super fast shipping and an amazing product! Thank You Thank You Thank You!", "Date": "June 20, 2012"}, {"Title": "Durriable is its middle name!", "Author": "Shantel Rummel", "ReviewID": "R2MBHCWI0FQDD7", "Overall": "5.0", "Content": "I had this phone my jr year in high school I dropped this phone so many time and soo much that it was no longer orange it was black! I had dropped in water at least four or five times and as long as i took the battery out and put the phone and the battery in a bag of rice over night it worked just fine. This is a great phone for a teen who dont really care  :) it lasted me three years!!", "Date": "February 20, 2012"}, {"Title": "cell phone", "Author": "LAR", "ReviewID": "R37X9WA9U38XI6", "Overall": "5.0", "Content": "The phone arrived in a few days and was in better shape then expcted. Works fine and a really good deal at an amazing price for a replacement phone.", "Date": "October 30, 2011"}, {"Title": "LG review", "Author": "GVolkl \"GVolkl\"", "ReviewID": "RX4TUE9U8CKAF", "Overall": "5.0", "Content": "Phone arrived quickly and in good condition.  For a quick replacement phone there are few better deals, but since it is still functioning perfectly it will stay with me a while.  I recommend this phone to people who do not need extra frills.", "Date": "October 16, 2011"}, {"Title": "not working properly", "Author": "Joanna M. Boyd", "ReviewID": "RJ20CC8WE0IAO", "Overall": "1.0", "Content": "Bought this for my son, an dit will not charge.  I am attempting to return it.  Will update review if the return goes well.", "Date": "October 10, 2011"}, {"Title": "did not work", "Author": "Amanda Baker", "ReviewID": "RB58DG514RRQ", "Overall": "1.0", "Content": "I got this phone and no one could hear me speak. I am still in the process of trying to get my money back", "Date": "December 8, 2011"}, {"Title": "AWFUL, NEVER USE THE ACC STOP", "Author": "Ericarae48", "ReviewID": "R3PQF05EDRF6DC", "Overall": "1.0", "Content": "Well I can not comment on the phones, because I never received them. I ordered two phones from them on October 4th. I have been in contact with them, and they forgot to ship them, so they reshipped them on the 14th. It is now October 19th and I still have not gotten them! This is horrible. I asked them if they could give me some money back or something for making me have to contact them over and over and wait so long for my phones, but there response was if you end up getting the phones then I should not get a refund. I had no problem paying in full for the phones, if I got them when I was suppose to, but I have not. They have horrible customer service, and do not care if you get your package or not once you give them your money. I will never order from them again, and they can NOT be trusted. BEWARE of this company!!!!!!!!", "Date": "October 19, 2011"}, {"Title": "Dissapointed", "Author": "Dplow", "ReviewID": "R1M6474N8SW5J6", "Overall": "1.0", "Content": "When the  user says \"like new\" or \"very good\" that means the phone should work in every aspect pretty well. After receiving this phone I hooked it up to my verizon line but was only able to text mesg. no phone calls. Please make sure things work before you sell them...", "Date": "March 14, 2012"}, {"Title": "BUYER BEWARE!", "Author": "moonflower \"moonflower\"", "ReviewID": "R1222R9E6Y9X2A", "Overall": "1.0", "Content": "the item itself is extremely defective and seems to have been designed to get worse over time, so that by the time you realize it is not salvageable it is too late.  this vendor has little if any integrity as well!  i am certain that they know their refurb phones are often problematic and i am also certain they know that these defects get worse over time, hence the 30 day warranty!  in my case, i even had VERY extenuating circumstances that i wrote them in great detail, outlining the fact that not only was it xmas-time and all that entails when i got my phone from them, but that my other half had an emergency appendectomy followed by a heart attack with weeks in ICU at a hospital over an hour from our home... making my attempt at returning my phone within this ridiculous 30 day window impossible and they resolutely refused to compromise!  THEY and their product ARE misrepresented!!!!!!!!!  i would gladly give them 0 stars if this were an option!", "Date": "March 6, 2012"}, {"Title": "Not happy", "Author": "Lisa", "ReviewID": "R2ZGOHT5YI3QEB", "Overall": "1.0", "Content": "The phone was locked when it got here..emailed the person I bought it from. they didnt know the code..had to go to the verizon store and all this mess..WHEN I order a phone I want it to be ready for me to hookup. Plus it said it was in GREAT condition, the keys lag, you have to type so hard..NOT HAPPY", "Date": "April 30, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "This product has been carefully audited and is certified to be 100% functional.\nThis offer includes the following accessories 1. Battery 2. Battery Cover (if applicable) 3. Wall Charger", "Name": "Lg Orange Vx9900 Env Qwerty Camera Cell Phone For Verizon Wireless - No Contract Required", "ImgURL": "http://ecx.images-amazon.com/images/I/41bAL1SBoKL.jpg", "ProductID": "B005J625RQ"}}