{"Reviews": [{"Title": "I never even talked on the phone", "Author": "LaToya", "ReviewID": "R2L1TQCTH1UNJJ", "Overall": "1.0", "Content": "I wouldnt know how this phone works because the company sent me a locked phone. I sent the phone back and never recieved another phone or my money back. When I called about the phone the people had an attitude with me like it was my fault I recieved a bad phone. Do not buy from this company.", "Date": "January 3, 2012"}, {"Title": "Basic touch screen Android", "Author": "Samantha", "ReviewID": "R7FO9OH4KD5QH", "Overall": "3.0", "Content": "I've had my Charm for several months now.  At first I was very excited about it, it moved a lot faster when it was brand new, and it was also my 1st droid.  This phone will get the job done, but it's not the best (or even 2nd best) for internet browsing and mass/frequent messaging. The battery does last days with little to moderate usage, and it charges completely quickly (within 45 mins average, for me).  It's not bulky and fits into small handbags, tight pockets, etc. The keypad is easy to use from the beginning, and the touch screen responds well, but may be occasionally stubborn. For a little more than $100, the price meets the value.", "Date": "May 21, 2012"}, {"Title": "Awesome!!", "Author": "oberlincollegeguy", "ReviewID": "R3KS4D5DEKSN3H", "Overall": "5.0", "Content": "This phone is amazing for the price!Its a full smartphone, with all features!I use it a lot for messaging and email, and the keyboard is the best I've used till date.Battery life is mediocre, so is camera-but for the price its still very good.", "Date": "December 6, 2011"}, {"Title": "Good phone, bad OS", "Author": "Michael", "ReviewID": "R31T8ZYW51CCKW", "Overall": "3.0", "Content": "I got this phone to replace my HP Veer, which I had worn out.  This is my first Android phone.  I bought it because I wanted a physical keyboard and I am on T Mobile and I wanted a phone that worked well on T MobileThe Bad.Android 2.1 requires all apps to be in internal memory.  This phone has 171MB of internal memory.  Android 2.1 doesn't allow WiFi hotspots.  Android 2.1 can't be updated on this phone.  There aren't a lot of options for getting to work with the multiple e-mail systems I use.The Good.The processor reasonably handles the OS.  The keyboard is backlit and works much better than virtual keyboards.  Once I reduced the frequency it checked for messages, calendar updates, etc, the battery easily lasts the whole day.  It seems very durably built.  It easily seems to take impacts that would shatter a Samsung Galaxy screen.  The signal strengths are higher that I had on my Veer.  This may be because the Veer was made for ATT and this was made specifically for TMobile frequencies.The WorkaroundsNow that I am more familiar with Android, I realized I did this all wrong.  I spent 4 hours figuring out how to make this work with my e-mail and calendar accounts.  Using the Android marketplace (Google Play), I could have just downloaded an Exchange compatible email client.If you root the phone, you can get WiFi hotspots to work.  You also can get link2SD, which will let you move your apps to the SD card (I still can't install an app over 54 MB, because I still have to install it in internal memory before moving it).Overall:  I like it, it does what I need now.  If I had to do it again, I think I would have gotten a Motorola Defy Pro because of the Android 2.3Gingerbread.  Now that I have it the way I want it, it isn't worth it to try the Defy.", "Date": "December 27, 2013"}, {"Title": "One Star Off For Being Android", "Author": "An Ikearat's Brain \"Tom\"", "ReviewID": "R1M9VDMKJO0GTY", "Overall": "4.0", "Content": "Ok, to be fare this is not a bad Android device at all. As another reviewer posted, the display is a little less than the quality you would expect for a smartphone. Even my old Sidekick has a nicer display. That being said overall the phone is a nice package. The shape feels good while you are holding it and with the track-pad on the back you can manage it with one hand for most routine activities. The keyboard is good, but where the heck is the Tildie (~) character?!? It's almost impossible to compose an email address or web URL containing a Tildie on this phone! I had to SMS a message containing a Tildie for cutting and pasting into my address book.Update: I found-out how to get a Tildie. You have to activate the on-screen keyboard and navigate through that to get a Tildie. It's a pain in the backside but you can get the ~My comment about losing a star for being Android is just my way of venting frustration at the messy operating system and the -requirement- of adding a task killer just to get control over the power usage. There really needs to be a \"exit\" button incorporated into Android applications... especially when using a lower-powered CPU and a small device form-factor (small battery). AND the practice of the \"builders\" launching every kind of communications background process at start-up is just wasteful. Not to re-mention the Tildie issue.Update: If you root this phone, be very careful to save the file system including the sub-folder /system/etc/motorola/bp_nvm_default If you fail to do this and load a ROM that over-writes these files, you will have a working Android device but no access to cellular at all... no data and no voice.I'm sure there is a work-around out there somewhere but for now I have a $125 PDA that's not as useful as my Palm TX. Motorola seems to have gone a little out of the normal way making this phone difficult to work with. If you intend to use it as received, you will be happy... it's still a good phone even if it's unfriendly towards re-flashing.Motorola did a good job on this phone and while it's not replacing my Palm T|X anytime soon, I will be using it as my \"other\" portable brain.Update: I'm back to using my Sidekick LX (2009) while I figure out a resolution to my screwed-up Charm. Be careful if you intend to mess with Android, do your homework before diving into re-flashing and messing with the file system.", "Date": "December 25, 2011"}, {"Title": "CHEAP QUALITY PHONE", "Author": "shyanitta", "ReviewID": "R38U0FYOOTAYFX", "Overall": "1.0", "Content": "Do not Purchase this phone this Phone is Very Cheap The Picture thats you have Sawis not exactly How the phone Looks The graphics are Horrible and Cheap . . The Model and The phoneis Nice If you Like candy bar phones the Keybord is Okay everythinf is fine Till the Phone is onTHIS PHONE IS NOT WORTH A HUNDRED DOLLARS !!!!!!!!!!!! , . . I PROMISE", "Date": "November 16, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android-powered smartphone in cabernet with 2.8-inch touchscreen, physical QWERTY keyboard, MOTOBLUR social networking, and BACKTRACK touchpad\nWi-Fi networking (802.11b/g); 3-megapixel camera/camcorder; Bluetooth stereo music; microSD memory expansion; access to personal and corporate e-mail\nUp to 9 hours of talk time (with extended battery), up to 360 hours (15 days) of standby time; released in August, 2010", "Name": "Motorola CHARM MB502 Unlocked Android Phone with 3 MP Camera, QWERTY Keyboard, GPS and WI-FI - No Warranty - Dark Sapphire", "ImgURL": "http://ecx.images-amazon.com/images/I/51sUyih4VlL._SY300_.jpg", "ProductID": "B0057AYGQC"}}