{"Reviews": [{"Title": "easy to use software and good camera", "Author": "Jonathan", "ReviewID": "RG2AYULS9ISP1", "Overall": "5.0", "Content": "When I received it, I was shocked at first because it looks like the vendor shipped me an European version with an European power adapter.  Since I have another USB power adapter, I decided to plug it in and charge the new HTC wildfire S instead of shipping it back.  After powering up the wildfire s, I was able to change the language setting to English and then it just works just like a U.S. version.  Everything work very nicely afterward.This is a very fast cellphone come with a very nice camera.  The phone is entirely unlocked and I am able to use my T-mobile sim card with it.Nevertheless, the vendor should really indicate that this is not a U.S. version phone.I gave 5 stars for the phone but 3 stars for the vendor.", "Date": "December 2, 2011"}, {"Title": "Good phone at affordable price", "Author": "webid4me", "ReviewID": "R2J9RDM3J14EAG", "Overall": "4.0", "Content": "I bought this Wildfire S from UnlockedCellPhoneKings (Fulfilled by Amazon). Parts of this review may be related to this seller & this particular phonePhone Pros:- Android OS- Compact design- HTC sense is useful and fancy (read more about is on HTC website)Phone Cons:- Low internal memory. It claims 512MB but most of it is already used by HTC sense. User gets around 120MB of memory.- Comes pre-installed with many applications which is not easy (or impossible) to remove without rooting.Others:It was shocking to see that the phone did not had the original HTC cartoon/box. The phone was in an ordinary box and was NOT well packed. It did not even had any protective polythene sheet on it. Refer to the product photos. The handset is European vodaphone handset. But it has been unlocked & I could use T-mobile sim-card with it without any problem. Though it shows vodaphone logo on startup. It also comes with pre-installed vodaphone apps which keep running in background (& at times consume some valuable resources). These apps are not removable. The charger is also not American but the seller provided correct adapter alongside.", "Date": "December 14, 2011"}, {"Title": "Cool phone", "Author": "Marko Sk", "ReviewID": "R2QF5LZ5TLK0X1", "Overall": "4.0", "Content": "It's ok phone, nothing spectacular but it does its job :)It was unlocked and ready to use! I didn't have any problems with it so far...", "Date": "September 29, 2012"}, {"Title": "Milagros", "Author": "Milagros Pino", "ReviewID": "RBBVA4TECUJ04", "Overall": "5.0", "Content": "El HTC Wildfire S es el sucesor del HTC Wildfire, con una mejor pantalla HVGA y Android 2.3.3 Gingerbread. Posee una pantalla touchscreen de 3.2 pulgadas, cámara de 5 megapixels, Wi-Fi b/g/n, GPS, Bluetooth y ranura para tarjetas de memoria microSD.", "Date": "February 24, 2013"}, {"Title": "one of the phone screen didnt work it came defected", "Author": "wilfred", "ReviewID": "R24X7OM7JMVYYD", "Overall": "1.0", "Content": "the phone didnt work it came on ok but cant function the digitizer is defected most of the letters wont work and certain parts of the screen dont work.", "Date": "January 22, 2013"}, {"Title": "good enough", "Author": "shaqjiang", "ReviewID": "R72TNL564K7FA", "Overall": "4.0", "Content": "It's cute and high quality considering its price. There is no visible flaws been found now. I like HTC style, it deserved.", "Date": "September 24, 2012"}, {"Title": "Worst device i have ever used. Beware", "Author": "JMP \"jmp_industry\"", "ReviewID": "R1EQSJR1EU7E61", "Overall": "1.0", "Content": "Pros: better battery life for a smart phone, good audioCons: long list. Signal reception is poor, i get missed call all the time. it takes a long time to connect calls. lot of time i have to press twice for a key to active. device resets on its own atleast once a day and keeps asking me to send these reports to HTC. Camera pictures are awful.All in all I would return this if tmobile didnt trick me into their return policy and tie me in with the data plan.", "Date": "February 10, 2012"}, {"Title": "Not a good price for the phone", "Author": "Cris", "ReviewID": "R362DDQPG44QE1", "Overall": "5.0", "Content": "This phone is selling for $89.00 in walmart and should not be $200 and above. I think this is a rip off and watch out for high priced phones that are on sale other places.", "Date": "June 7, 2012"}, {"Title": "Not fully unlocked", "Author": "Philip J Sokolowski", "ReviewID": "RGVXUZQ3LI1BZ", "Overall": "3.0", "Content": "I purchased this product and was expecting a fully unlocked handset.  Upon arrival to Bangkok for usage, I quickly learned the handset was not data unlocked, and only voice/SMS (SIM) unlocked.  I took the handset to MBK mall and some phone ninjas were able to unlock the data piece for THB 700 (about $23USD). Afterwards, the 3G components worked fine on AIS and DTAC SIMs/plans.Not sure if this was a Thai anomaly but be warned the handset I received was not fully unlocked as advertised.  Be prepared to have a plan/time/funds in place to fully unlock the handset.  Other than this - the phone is Vodaphone with a 220V charger, and I was able to upgrade to Gingerbread 2.3.5 (via WiFi) before the ninjas hax0red it for me.  However, I feel this handset is essentially locked in at the current OS level, as the 3G unlock could possibly be removed if I upgrade the OS (unknown, but am not going to risk it at this point...)Phone is small, lightweight, easy to use, and has a good battery life.  I recommend it for those who need something when traveling overseas. Just be ready to unlock the data piece if necessary.", "Date": "March 17, 2012"}, {"Title": "HSPA 900/2100 MHz, no 3G in the USA", "Author": "francis", "ReviewID": "RP0RK99TBOCK9", "Overall": "5.0", "Content": "Great little phone but it will not work on 3G in the USA. Other reviewers said this works on T-Mobile, well it does, but only on their old 2G GSM/EDGE network. This phone only works on HSPA/WCDMA 900/2100 MHz (TMob USA needs 1700 AND 2100). GSM/GPRS/EDGE 850/900/1800/1900 also work but for 2G only.AT&T; 3G network uses 850/1900 so this phone will not work at 3G speed on that either.If you're planning on using the phone in the USA don't buy this version.", "Date": "January 8, 2012"}, {"Title": "Not what was advertised!", "Author": "Marty S.", "ReviewID": "RERBZIDA64MJM", "Overall": "1.0", "Content": "This phone wasn't a A510e which is a HTC Wildfire S.  It was a A3333 which is an HTC Wildfire.  The packaging was generic and didn't look like a genuine HTC phone.  The battery wasn't installed in the phone as is done with HTC Wildfire's and it wasn't a genuine HTC part.  This phone is questionable in my opinion!", "Date": "November 22, 2013"}, {"Title": "Description was misleading.", "Author": "Christina Knicely", "ReviewID": "R2OF55Y6MO9LXV", "Overall": "1.0", "Content": "I absolutely loved this phone until I realized it was the UK version. Can't root, and the internal memory is EXTREMELY LOW, so it's unusable by any of today's standards unless it's rooted. Really really wish it was US version. Gave it to my three year old since it was only good for a couple games and phone calls.", "Date": "August 31, 2013"}, {"Title": "My Girl Likes...", "Author": "Alex D Patton", "ReviewID": "RRSTGPO6ZLMDX", "Overall": "5.0", "Content": "So far, this purchase is satisfying, no complaints, my girl love the phone, this is her first android, so it is a new experience for her and a great starter phone...", "Date": "June 30, 2013"}, {"Title": "Very nice phone", "Author": "Isaac", "ReviewID": "R1IOJSEQ6EV7L1", "Overall": "3.0", "Content": "It's a nice phone and everything described is properly working, the only limitation is its internal storage space. It is really low and it can't allow you to have many apps on your phone", "Date": "March 29, 2013"}, {"Title": "Great!!!", "Author": "normeka", "ReviewID": "R1LH3SU14WS6S6", "Overall": "4.0", "Content": "I was very pleased with my purchase it showed up within the time frame givin. the only problem i had with the phone was that it had a lingering cig smoke smell to it but other than that great phone. she has my reconmendation!!!!", "Date": "January 30, 2013"}, {"Title": "review", "Author": "garrett", "ReviewID": "R3BYJJ72ZT5M74", "Overall": "4.0", "Content": "i got my phone quick and was what i was expecting the package was in like new but the box said it had a microSD card (preinstalled) but there was no card other than that all was well thnaks", "Date": "December 30, 2012"}, {"Title": "Girlfriend loves it", "Author": "Amazon Customer", "ReviewID": "R2710LZZ7VBM7N", "Overall": "5.0", "Content": "Bought for my girlfriend and she loves it. She always wanted a touchscreen phone, and figured out this will be ideal for her. It's not too big or small, fits nice in her hand, and she's enjoying the beauty of Android. Even though it was her first actual touchscreen device, it didn't take her long to get use to it. Now it looks owned it for years.", "Date": "December 29, 2012"}, {"Title": "Good value", "Author": "Stan", "ReviewID": "R1MLZQWWDPN0MO", "Overall": "4.0", "Content": "Phone is decent; right size; this is a foreign model  - looks like made for Pacific Asia; however, works well in USA", "Date": "December 28, 2012"}, {"Title": "Pretty cool, but no 3G nor 4G =(", "Author": "Slim Fit Classic", "ReviewID": "R1XLZCYRA95ZR", "Overall": "3.0", "Content": "This was my introductory phone to Touch Screen cell-phone.Pros.* Always liked small phone I can fit in my pants' pocket easy.  This one does.* Graphics are clean.* GPS and WiFi capability* Can be used as WiFi router, but with a downside (see Cons under connectivity)* Screen is quite strong for a little guy.  I never used a screen protector and I have no scratches after a year and a half.* IT takes decent photos (5MP)* Sound recorder is awesome.  I recorded a conversation (kind of spying) and had it in my pocket. Voices were clear.Con's.* Connectivity: it is only EDGE band.  Using it as a WiFi router for my tablet was not fast enough, making it USELESS to have this capability.* The RAM is only 600MB.* Can not handle a memory card larger than 8GB (I only tried a 4GB one, but I assume it could take an 8GB one) I did try a 14GB one without success.This is a good phone for a kid (10-15) whose parents are wise to realize that to spend $500 on cell phone is ludicrous.", "Date": "December 9, 2012"}, {"Title": "Great phone", "Author": "Jp", "ReviewID": "R21MAQGQV5RBPQ", "Overall": "5.0", "Content": "I like a lot my new cel it's small but great screen, I can navigate, watch videos and my kids love android apps! Kindly", "Date": "November 3, 2012"}, {"Title": "okay", "Author": "stephanie", "ReviewID": "RYK8ESA9YY322", "Overall": "3.0", "Content": "its a nice phone but i thought it waz bigger,very small,wish i can exchange for something different and bigger for me", "Date": "November 3, 2012"}, {"Title": "good phone", "Author": "McNight", "ReviewID": "R98460SIBT2E0", "Overall": "4.0", "Content": "use this phone 2 and a half months, works good.I have a incredible s and it's broken, so this phone is a sort of replacement, it obviously cannot compare with the incredible s, but it do it's job, so I cannot complain this. The battery life is good, actually impressed me. I also noticed the phone is from Europe, and it's rooted.the only reason I gave it 4 stars is because the camera is somehow reddish, makes the photos look really awkward.ps. I don't notice when the price drop to $205, I purchased it for $225.74!!!", "Date": "January 29, 2012"}, {"Title": "What I was looking for", "Author": "Daniel Lamay", "ReviewID": "R2TWCGQV7YQAAL", "Overall": "5.0", "Content": "I contacted the supplier to verify that the phones were unlocked and when I received them they indeed were, so all went well and I'm enjoying the phones in my WiFi demo.", "Date": "November 3, 2011"}, {"Title": "Good, but ...", "Author": "Abdullah M. Alghamdi", "ReviewID": "R2UDNUEO09JY3", "Overall": "3.0", "Content": "Good entry-level android phone from htc. But I surprised the phone was not supporting Arabic, because it is not Middle East version.", "Date": "December 31, 2011"}, {"Title": "Complete waste of money", "Author": "E. Quinlan", "ReviewID": "R1AJ4MC5GQ38CJ", "Overall": "1.0", "Content": "After using this phone for 3 weeks, I took it out of my pocket and the screen was cracked and it would not work.  Despite \"normal use\" the manufacturer would not honor the warranty and was unable to provide a repair cost.  I think the thing is junk.", "Date": "November 29, 2011"}], "ProductInfo": {"Price": "$399.99", "Features": "Android with HTC Sense\n3.2-inch touch screen with 320 x 480 resolution\nMulti-window browsing\n5 megapixel colour camera with auto focus and flash", "Name": "HTC A510e Unlocked Phone with Android 2.3.3, 5MP Camera, WiFi, GPS and Bluetooth - No Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41FIJ8jTUCL._SY300_.jpg", "ProductID": "B0055DXZZY"}}