{"Reviews": [{"Title": "Item as Described & Quick Ship!", "Author": "CoolCat \"cjt2000\"", "ReviewID": "R3AENHO5M0ZAOZ", "Overall": "5.0", "Content": "This unlocked T-Mobile phone was exactly as described, except, it said shipping would take 7-10 business days and it arrived in about 3! Super Fast!  The item does come with a wall charger and was brand new in the box.  Just popped the SIM card in and all was up and running.  I think it even came pre-charged.  This is a perfect texting phone which I got to replace the phone my daughter broke (which was an earlier model of this same one).  Would reccommend this seller and this product.", "Date": "October 3, 2011"}, {"Title": "Good", "Author": "Ben", "ReviewID": "R293DDIV9NTVBV", "Overall": "5.0", "Content": "If you are going to buy a phone, you do research first. You should know what you are buying before you buy it.  This seller is great, the product came in on time and was what it said it was. This does come with a charger because I know I was wondering that.  It is not the sellers fault if the product is bad quality, which it isn't, it is your fault for buying it. Great for texting with 4 row qwerty keyboard and good call quality. micro sd input also", "Date": "August 31, 2011"}, {"Title": "Great for poor-quality calling and texting", "Author": "tsk007", "ReviewID": "R176GZPBD1I2RA", "Overall": "1.0", "Content": "All I need is a phone that can call and text, but this phone even has trouble with that. If you're planning to have lengthy phone conversations, expect to deplete the battery pretty quickly. The battery meter never worked properly: when it's full, it shows 4/5 capacity, then after an hour of use it shows full capacity and then the meter quickly vanishes. The wall charger doesn't fit properly, so you have to be extra careful to make sure the phone is actually charging after you plug it in. It also does not use a standard wall charger, like the Gravity 2 does.The one advancement over the Gravity 2, in my book, is the Gravity 3's keyboard, which feels nice. However, make sure your text is ready before hitting SEND, because you can't cancel it. Just like the Gravity 2, it will say \"Message Cancelled\", but the recipient will still get it. Also, the Gravity 3 still splits long text messages, even though toasters nowadays are capable of text merging. Finally, when texting, make sure you don't accidentally scroll over the \"Info\" section, or else the phone will lock up for 10-15 seconds and then tell you to upgrade your plan. As a whole, the Gravity 3 is designed to make internet use more convenient, making normal use very annoying sometimes. However, if you have enough money to buy internet for your phone, you SURELY have the money to buy a phone that works properly.The phone loads everything slower than the Gravity 2 did. And that's saying something.I admit, I am being very picky, but for this price, I have the right to be. Five years ago, I bought a cell phone for $150 that had great battery life (2 or 3 times longer), loaded everything much faster, and didn't have any quirks or annoying glitches. You would think technology would be improving.", "Date": "March 11, 2012"}, {"Title": "Perfect like I expected", "Author": "Ndeyefatou Coundoul", "ReviewID": "R1M62K6Q3HUS6Y", "Overall": "5.0", "Content": "I love this phone...I have been in love with it! It's simple, easy and fun to text with .. I deffinetly recognmend it", "Date": "September 10, 2013"}, {"Title": "she loves it", "Author": "Laura C Harkness", "ReviewID": "R1OO1V5LWRJ2F8", "Overall": "5.0", "Content": "I bought this for my daughter who has decided she does needs a phone that works...it works and she loves it!", "Date": "September 1, 2013"}, {"Title": "Fun, simple little phone for those who need a QWERTY keyboard", "Author": "J. Sholom", "ReviewID": "R1EBDTC1X325KF", "Overall": "3.0", "Content": "I've had this phone for the last year and a half. I personally adore QWERTY keyboard phones, so I thought that this phone was perfect when I bought it. Unfortunately, a few months in, the speaker quality completely deteriorated and I can only hear people if I put the phone on speaker. This is why I'm going to replace it soon with something else.PROS:-QWERTY keyboard, as well as number keyboard. Some people complained that it auto-completes for you, but that's only with the number keyboard. QWERTY does not have this feature.-Extremely durable. Fallen off several high places with no problems.-Very good battery life. Can last at least 4 days on a single charge. I don't have a data plan, so I don't use the web, which might be why it can go for so long.-Very good reception. Can get phone service even in places where most phones lose their reception.CONS:-The speakers went bad within a few months, so I have to speakerphone when I want to hear someone. This can get pretty annoying in public places.-It vibrates...A LOT. When someone calls me, the phone vibrates so much that it falls off wherever it is. I've seen it fall off tables, beds, counters, etc. Good thing it's durable or else it would have broken a long time ago.-Unlocks and butt/purse dials easily. I've had to go through quite a few explanations of why I dialed someone because of my phone.BOTTTOM LINE:Proceed with caution. This is a great phone for people who want a non-smart phone with a QWERTY keyboard, but otherwise, not so much.", "Date": "August 7, 2013"}, {"Title": "samsung gravity 3", "Author": "schnockerfan", "ReviewID": "R7H8F1JAAJTBD", "Overall": "5.0", "Content": "i love this phone! i have only had it for 2 months now, but think its an incredible phone. i would suggest this phone for kids 10 and up. i have dropped my phone many times now, only to result in minor scratching, but no damage to the phone itself! i highly recommend this phone!!!", "Date": "November 8, 2011"}, {"Title": "Great phone, much cheaper than buying from Tmobile", "Author": "S. Anton", "ReviewID": "RQ3VU7IFSU706", "Overall": "5.0", "Content": "I'm so glad I got this phone, it's fantastic.  I was about to buy a lower quality device for the same price from the cell phone company.  It arrived really quickly too.", "Date": "September 6, 2011"}, {"Title": "Keyboard is the only good thing about this phone", "Author": "Jessica Kinsey", "ReviewID": "RUOU603X7ZAED", "Overall": "2.0", "Content": "I purchased this phone from T-Mobile along with a plan and was disappointed shortly after I got it.  First, the phone I got doesn't work with after market chargers and I had to order a special charger directly from Samsung and had to pay an additional $30 plus shipping. T-Mobile told me that they received a notice from Samsung that this was a common defect of this phone type.  I only had this replacement charger 4 months before it stopped working too.  The keypad number 0 also stopped working right away and Samsung said that it would take 8-10 weeks to send me a replacement and I would have to mail it in at my own cost.  I do love the keyboard on this phone, but everything else makes me wish I would have waited to get another phone since this one had just come out and they didn't work out any bugs. Pros: keyboard very handy and easy to use Cons: Surfing the internet is difficult, screen is small, I have had tons of technical issues and poor customer support from Samsung, this phone drops calls constantly and I never get service in my house (I live in NYC) and have not had this problem with other phones.  I cannot wait to upgrade from this phone and the only reason I kept it because it cost me $125 and I would have to sign another 2 year service contract to get another phone.  I got ripped off with this piece of junk and I am very disappointed with Samsung after my experience with this phone.", "Date": "September 28, 2011"}, {"Title": "Refurbished badly!", "Author": "Snshn", "ReviewID": "R1863DIZVGCUGM", "Overall": "1.0", "Content": "Upon removing the phone from the box, the Silver ring surrounding the photo lense aperture fell.  On first look...The \"On\" button is upside down...says \"No\"........lighting on keyboard is out in center, Texting re-verst to start screen when using slide.  Question to customer service at the seller, asking for an exchange says \"Sorry we have no more\" Beware of this seller....refurbished not clear in item description...Must have pretty untrained people doing  refurbishing...even a 5 year old would know which way to put the \"On\" button!", "Date": "August 18, 2013"}, {"Title": "Great dumb phone for smart people", "Author": "Michael Livote \"dragon2knight\"", "ReviewID": "R3CFTTU9AJC9FX", "Overall": "5.0", "Content": "Not everyone likes or needs a smart phone, they might be way more than needed. My Mom loved this phone from the day she got it, and asked me to get her a back up just in case hers dies off. I found it easy to set up, easy to use, and the voice quality is good as well. My Mom had her original one for nearly two years with zero problems, and the new one looks like it's going to go the distance as well. Replacement batteries and chargers are also very cheap, and so are protector covers.So if a simple, easy to use messaging phone is all you need, then try this one out, it's a great phone for the money!", "Date": "June 11, 2013"}, {"Title": "I loved this non-smart phone!!!", "Author": "Kezia Black", "ReviewID": "R3RZH4OMB6ZO6P", "Overall": "5.0", "Content": "I am not on the bandwagon. I do not desire at ALL to have a smart phone with the associated $30/month data plan. So this phone is a nice divide between the realms of smart and \"dumb\" phones. On a trip to Atlanta, I was able to call and have TMobile turn on the data to this phone where I was able to search the internet AND use online maps to find nearby eateries. I was able to use facebook at that time too, but as I don't require that kind of interconnection on a regular basis, I had the data shut off as soon as I got home. What a great phone this has been for me. Full Qwerty, music through the internal speakers. My previous Gravity 3 was stolen so I replaced it with a Gravity 3 and am immensely satisfied. One recommendation: Buy the rubber cover. After 20 or so drops, my screen went white and never recovered. (I'm a dropper. I need a phone that can handle it!)In all, I recommend this one to the non-tech forward crowd, unless you really need Words with Friends at your fingertips!", "Date": "October 13, 2011"}, {"Title": "Great!!!", "Author": "Animal lover2036", "ReviewID": "R2HTOTGZH0PGP4", "Overall": "5.0", "Content": "The product arrived quickly and works great :) After dropping my previous phone in the water and being unable to salvage it I decided to get the same type of phone. I was worried about buying an unlocked phone but it works great!", "Date": "August 25, 2011"}, {"Title": "Samsung Gravity 3", "Author": "Donna Harris \"CheeseQueen\"", "ReviewID": "R162JCC1C7R2VY", "Overall": "2.0", "Content": "When I killed my TMobile Tap, the insurance company replaced it with the Gravity 3.The pros:The brightly backlit screen makes texts & incoming call messages easy to see.  Transferring pictures, etc. to phone from computer via Bluetooth is almost as easy in Windows as it is in Linux.The cons: Predictive spelling has to be turned off each time I text.  IMO, predictive spelling is useless & annoying.  If there's a way to permanently disable it, i haven't found it. The drop-down qwerty keyboard is useless to me.  The buttons are too small for my fingers, & I often switch between upper & lower case letters & symbols without meaning to.  For some reason I haven't figured out, closing the qwerty keyboard turns the camera on.This is an android phone, but every android app I want exceeds the capacity of this phone.  I have yet to find an app I can actually use with this phone. Many websites exceed the capacity of this phone or it's screen as well, making my data plan nearly useless.The screen is tiny. The time & date on the screen are teeny & hard to see.This is a great phone for someone who has good eyesight & small fingers & who only uses it for calling & texting.  For the rest of cell phone users, this phone is disappointing.  I'm eagerly waiting for the day I can upgrade & get rid of the Gravity.Edit: the insurance agent who told me this was an Android phone lied to me. Fortunately, I have a teenager in the family who was able to explain the reason why I wasn't able to download Android app.  Next month I can get rid of this drek.", "Date": "August 6, 2011"}, {"Title": "Horrible!!!", "Author": "Hi", "ReviewID": "RTPMAVZZM2PW6", "Overall": "2.0", "Content": "This phone has couple major shortcomings that just doom it.  First of all, many people will want to buy this as a text and talk phone, i.e. they are not interested in a data plan.  The phone is designed in a way that will optimize your chances of accidentally browsing the web.  There is a \"web2go\" button that cannot be reconfigured, and that is one of the most natural buttons to press in almost any situation.  Because of this, you are likely to get charged for data transfer.  A second big flaw in this phone is that it slips out of the hand very easily.  The outside texture of the phone is extremely slick, so if you are trying to slide out the keyboard or hold onto it while typing, it will likely slide right out of your hand.  Finally, for music and picture transfer, the Samsung software to manage the phone contents is clunky and unintuitive.  It gets two stars because the sound and reception are not bad, and it has raised numerical buttons so you can potentially dial without looking at the phone.  However, I would not recommend buying it.", "Date": "June 14, 2012"}, {"Title": "The good and the bad explained", "Author": "B. Hernandez", "ReviewID": "R19XZOJUJSTP38", "Overall": "3.0", "Content": "The Good: Great battery life (at least with no web use), nice size, awesome reception anywhere I go, use of calendar, alarm, etc. The Bad: If you like to text, don't bother with this phone. I make a million mistakes since day 1. It simply won't register some keys and then it will register other keys about 2-3x, this is VERY annoying so I'm getting a new phone specifically because of this reason since I do text often. Also, for web use the screen is pretty small so I'd like a bigger screen. Photos: The camera is ok, don't expect much.All in all, it's  great basic phone. It's the only phone I've ever had that works great indoors, out, at work, home, driving and rarely ever drops calls. I charge it every other day which is very convenient so battery life is good. But if you want better photos/camera usage or like to text or go on the web, just move on. It's pitiful for these uses.", "Date": "February 15, 2012"}, {"Title": "Awsome!", "Author": "curley", "ReviewID": "R32RW7VALKH1Q9", "Overall": "5.0", "Content": "My wife has had the phone a couple of months now and loves it!  She likes the new style and the easyness of the functions of the phone.", "Date": "September 7, 2011"}, {"Title": "dead after wife ran over it", "Author": "Bob Jewell", "ReviewID": "RJXU36W9NNRY1", "Overall": "5.0", "Content": "I was a perfict phone for the wife and she used it in her work for months and then it fell out of her pocket and it was ran over in little pieces. Have another onorder but have read bad reviews on seller hope I get a good one!!!", "Date": "May 31, 2014"}, {"Title": "I am not happy with the product", "Author": "dongkun lee", "ReviewID": "R2XLK8U4I8LLM", "Overall": "2.0", "Content": "The product has a lot of issues, especially for the funtion of key boards.  I am not happy with it.", "Date": "April 10, 2014"}, {"Title": "Exactly What I Wanted", "Author": "Frances Martin", "ReviewID": "R36XH14QU7OA5R", "Overall": "5.0", "Content": "I have usdd a Samsung Gravity for years until I got it wet.  They dont  seem to carry them any more so when I found them on  Amazon I was  happy and  the phone I  received was just like my old one except it had more features.  The shipping was quick and the price was right so I am a happy customer.", "Date": "March 25, 2014"}, {"Title": "Great basic phone", "Author": "Betty", "ReviewID": "R3R1TX0RQZEAGH", "Overall": "5.0", "Content": "I bought this for a twelve year old.  It is a great basic phone with the slide out keyboard for text.  I have seen a lot of kids with smart phones and cracked screens.  This was the best choice for us to be able to keep in touch.  It functions well and has a sturdy feel to it.  It has a camera as well.", "Date": "March 11, 2014"}, {"Title": "Love this phone!", "Author": "NanS", "ReviewID": "R80JHSHJCSWKW", "Overall": "5.0", "Content": "I've had this particular model phone for years, and then it stopped working. T-Mobile no longer carried it, but had one that replaced it. I purchased it, but it had some features which I really hated, so I returned it. Thankfully, I found this one on amazon and was so happy. I just prefer a very basic/simple phone vs the fancy and expensive touch screened ones. So, this phone is perfect for me. Thank you so much!", "Date": "March 10, 2014"}, {"Title": "Works as promised", "Author": "I love Amazon \"Cash\"", "ReviewID": "RPNHV4IZZOYMT", "Overall": "4.0", "Content": "I bought three of these - some here and one on E-Bay as the ones in Amazon kept rising in price.  They work with T-Mobile and are easy to set up.  But I will tell you if you kid is expecting an iPhone - this is not it.  It is a good phone for texting and calling.  You can even put music and videos on it.  However many of the songs I placed on them would not work or play - and no the where not license protected songs.", "Date": "January 23, 2014"}, {"Title": "Great new condition", "Author": "shavon", "ReviewID": "R3P2ZLY9TV6V4G", "Overall": "5.0", "Content": "The phone took to long to come....but it was in great new condition. Will order again in the near future.", "Date": "January 16, 2014"}, {"Title": "GREAT", "Author": "bratz", "ReviewID": "R28KMXHEYERE8N", "Overall": "5.0", "Content": "this phone is so great. perfect for people who don't want a smartphone and has a nice keyboard thats easy to use", "Date": "January 3, 2014"}, {"Title": "Works as advertised", "Author": "Viper Engineer", "ReviewID": "R3NA896R5LLDFM", "Overall": "4.0", "Content": "It's not a smartphone and it doesn't cost like a smartphone. Bought it because I liked my prev gravity phone, which died of old age. This one has a bigger screen and some small keyboard changes I'm still getting used to - reason for one star downgrade. From what I've seen, it's the only option on the market that is not a smartphone, but has a keyboard that is easy to use, which is what I was looking for.", "Date": "December 24, 2013"}, {"Title": "Samsung Gravity 3 T479 Unlocked Phone with 3G Support", "Author": "Ardith Brackett", "ReviewID": "R1BJQFYE8VYKWK", "Overall": "4.0", "Content": "This phone is doing well for the things I use it for - mainly texting and some calling.  I like the slide which provides the qwerty keyboard which is easier for me to use.", "Date": "November 13, 2013"}, {"Title": "I love this phone!", "Author": "Indialight", "ReviewID": "R2P92NLUEDMEGI", "Overall": "5.0", "Content": "To start off, these phones are invincible. I have thrown mine out of a bus window twice, I have dropped it in water and I have dropped it a billion times and it still works perfectly and has very few scratches. Other people say the texting is weird but it's worked perfectly for me. I text all the time and it's really easy and the keys are comfortable. Sooooo my point is it's a great phone and I would totally recommend it to a texty teenager :)", "Date": "June 29, 2013"}, {"Title": "It would be okay if it actually worked", "Author": "Caroline", "ReviewID": "R2QAAEXEXC1V2M", "Overall": "2.0", "Content": "When I first received the phone, I liked it. I don't have a data plan, so I don't really use my cell phone for anything outside of texting and calling. A few days after I got it, though, I tried charging it and the phone kept restarting itself until I disconnected it from the charger. A few days after that, I wasn't able to hear anything when I called someone or someone called me unless I used speaker phone. That's when I returned it.", "Date": "May 13, 2013"}, {"Title": "Works good", "Author": "Vernita R Cotler", "ReviewID": "R25SGI3VSL414R", "Overall": "4.0", "Content": "Good phone.I love down loading music on it and listening to it all night.The keyboard works good.I wish I could scan things with it.It Is serving It's purpose but I think it Is time for an more updated model.", "Date": "January 16, 2013"}, {"Title": "Very Good", "Author": "KC", "ReviewID": "R1H8RW50ARYWN7", "Overall": "4.0", "Content": "This phone was my first phone. I loved it, the battery life was amazing this last year and a half. Texting and phone calls were great. Although if you want it your camera or camcorder, it is not your best bet. The texting format could be better, and occasionally is updates itself randomly, but it has never failed me like my friends' phones have failed them. Its starting to get a few glitches, I can't expect it to be perfect forever. With a case it has been durable even from my slight abuse to it. It has been good in my fast demands and urgency to send text messages. T-mobile customer service sucks. Although, we are focusing on the phone, it is wonderful!", "Date": "December 27, 2012"}, {"Title": "Good Phone", "Author": "Amazon Customer", "ReviewID": "R5NTIC91U7VRK", "Overall": "5.0", "Content": "My sixteen year old son has had this phone for 7 months and it is still going strong. Easily a better purchase than upgrading to a contract with my cell provider. Perfect for texting and phone calls.", "Date": "March 23, 2012"}, {"Title": "defective device", "Author": "jj", "ReviewID": "RPE9OT2B83BS9", "Overall": "5.0", "Content": "I love this phone and went online to order one since they don't make them anymore. Company that sent it, sent one that won't text from the keypad-disappointed with company, not the phone", "Date": "March 6, 2012"}, {"Title": "Opinion", "Author": "dayza", "ReviewID": "RD4QTI98V5JM2", "Overall": "5.0", "Content": "The phone is exelent and easy to use, the condition was like new. It arrives exactly in the estimate date.", "Date": "October 30, 2011"}, {"Title": "love it", "Author": "happy", "ReviewID": "R2UTOF69PNUWEL", "Overall": "5.0", "Content": "We bought two of these around a month ago and they are great.  Very easy to use and convenient.  Well worth the price.", "Date": "October 6, 2011"}, {"Title": "Screen stopped working 1 week after recieving", "Author": "Nick", "ReviewID": "R2JET5HDN1Z66P", "Overall": "2.0", "Content": "I loved this little phone until the screen stopped working about a week after I got it. Thankfully I was able to return it and the return process went smoothly. I just slid it open to send a text and the screen went out. I'm assuming that it has something to do with the connection between the sliding part and the main phone body.The keyboard was great, I preferred the full real keyboard to the touch screen I have now. The menus were easy to navigate, call quality was good, Great signal strength, loud speaker (compared to my old phone).I imagine I just got unlucky and got a faulty phone. I would still recommend this phone, my review is only a 2 because my specific phone stopped working.", "Date": "October 13, 2011"}, {"Title": "Terrible Buy- Don't Waste Your Time/Money", "Author": "Raptor", "ReviewID": "R3ULRYY0CL4Q3T", "Overall": "1.0", "Content": "Samsung Gravity 3 T479 Unlocked Phone with 3G Support, QWERTY Keyboard, 2MP Camera, Bluetooth and Music PlayerBought this phone through Tmobile as an upgrade because I don't like smart phones.  Within the first 4 months, the phone began to randomly reboot and shut off on me- whether it was in the middle of a call or just while it was in my pocket.  I called customer service only for them to tell me that my battery was bad and that was the ONLY possible option. His reasoning for that was that 'he just knows it the battery because its his job'. Also, they said that it was just recently out of warranty (and by recently I mean about 10 days), so because my battery just went bad on its own, I still had to pay if I wanted to fix it.Secondly, after six months of use, my calls started to become unrecognizable (they gave off a transformer-type sound similar to AOL dial-up internet.  There was no ringing, no voice, just the static-y annoying crap. And this happened both for receiving and sending.Cheap upgrade phone, but not worth it.  You get what you pay for- don't waste your money.", "Date": "August 28, 2011"}, {"Title": "#5 button doesn't work. Not a good phone", "Author": "sharon kucharski", "ReviewID": "R2FY52RT02X4ZU", "Overall": "1.0", "Content": "Buttons are spongy and makes typing slow. Not user friendly for messaging. Separate inbox and outbox. Phone sound quality not good either. The seller did issue me a prompt refund.", "Date": "September 3, 2013"}, {"Title": "Lasted just long enough that we can't return it", "Author": "Michael Janzen", "ReviewID": "R2IHAEGA1UVEET", "Overall": "1.0", "Content": "Made it just a few weeks past the return date - and now BOTH phones we purchased are having problems.  Keys are sticking, calls are failing, the whole 9 yards.", "Date": "July 15, 2013"}, {"Title": "Terrible as usual", "Author": "Izzy", "ReviewID": "RGK77J3H7QZHO", "Overall": "1.0", "Content": "Samsung has had a tendency to have poor quality non smart phone phones. This is my 3rd Samsung gravity phone. Previously I have owned the Gravity 2, and the Gravity Text - All 3 I have bought from the Tmobile store, Amazon is still amazing. The keyboard keys wear down and stop working after about 5 or 6 months. The speakers for phone quality usually stop working well after 5 to 6 months. The keys on the keyboard of this model, the Gravity 3, lag and stick. The camera is probably the only decent part of this phone.", "Date": "April 29, 2013"}, {"Title": "Item did not work,  had to return it", "Author": "Sandi Moran", "ReviewID": "RFEV23RSJHTTO", "Overall": "1.0", "Content": "I already own this exact phone, I wanted to avoid re-learning the technology, so I purchased another exactly like the one I currently own.It works great for me, just wanted another exactly the same.  But alas it did not function properly.  Seller graciously accepted returnand credited me.", "Date": "October 23, 2012"}, {"Title": "gravity's rock! (NOT) updated 11/17/2011", "Author": "Shanie", "ReviewID": "RISBTO7KMTTXO", "Overall": "2.0", "Content": "After feeling duped from spending a hundred bucks on the worthless Nokia Nuron (Which btw I don't recomend!) I wanted something that I am used to, I am not used to those touch screen thingy's nor am I data user, I previously owned the G1 and the G2 and loved them both! When I dropped mine in water it stopped working so I bought the Nuron. After doing much research into finding a phone I wanted that fit my needs, I couldn't find any through T-mobile, most phones they have on there site are geared more for smartphone users and that's not my thing, and the ones that weren't were just plain ugly! I even tried pre-paid to see and nothing. So I stumbled across this phone and decided to give it a try! It is a G3 it can't be that bad! Well I know for a fact that its better then the Nuron lol!! But I haven't gotten it yet and I am a little worried because i never bought any phones through here before so it worried me. I have heard the \"horror stories\" about buying new from places like this, and the stuff really ain't \"new\" and there's always water damage and yada yada yada... Well I can tell you right now that if there's any sign of water damage I will be sending back to seller! That;s what makes me nervous. But I also bought some covers to protect the phone too! But I read the reviews on here and it seems like no one had any problems with the phone so I should be ok. I ordered two of the phones one for me and the other for my hubby because he hates the Nuron just as much as I do... he didnt even like any of the upgrade options threw t-mobile. He also previously had G1 & G2. Plus the colours of this phone intrigued me because i am a carolina panthers fan, and it's there colours! But as soon as i recieve my phone I will update this and let you know how I make out.OK Update 11/17/2011 -  I no longer have this phone because my cat knocked it off my coffee table and the screen got something funky all over it, it looks like one of my kids scribbled all over my screen with a black sharpie. That's what I thought it was at first so I kept scrubbing and it just wasn't coming off. I actually liked the phone because I had previously owned other Gravity's and nothing like that ever happened to them when I dropped it. I am a little P***** because I didn't have the phone long. Besides the phone was just like the other gravity's but I LOVED the colours. So In some research I bought me another phone from amazon through a seller.. I know I said I hated touch screens before but I got the samsung behold only because it's pink lol I love pink! That phone is actually nice and way better then the gravity and the nuron! I love it!PS: My mom wants the nuron and I told her dont do it..lol..Once my phone comes and I know everything is ok, she can have my nuron and deal with the headaches lol!", "Date": "September 12, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported.\n3G-enabled quick messaging phone with side-sliding QWERTY keyboard and dedicated shortcuts to messaging and social networks\nCompatible with T-Mobile's 3G network for fast downloads as well as quick uploads of photo and video to sharing sites\n2.0-megapixel camera/camcorder, Bluetooth stereo music, microSD memory expansion to 16 GB, organizer tools, personal and work e-mail\nUp to 5.5 hours of talk time, up to 300 hours (12.5 days) of standby time, released in July, 2010\nIt will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nThis unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.", "Name": "Samsung Gravity 3 T479 Unlocked Phone with 3G Support, QWERTY Keyboard, 2MP Camera, Bluetooth and Music Player", "ImgURL": "http://ecx.images-amazon.com/images/I/41vz9qPAkfL._SX300_.jpg", "ProductID": "B0056JBKCW"}}