{"Reviews": [{"Title": "Bad phone,", "Author": "Vida Amoh", "ReviewID": "R3L7UUTD84243T", "Overall": "1.0", "Content": "It is not a gsm phone ,I bought it and could not use it in africa,it just did not work", "Date": "October 5, 2013"}, {"Title": "All powerful Nokia", "Author": "plantlover", "ReviewID": "R2I72VHL5ZK8AB", "Overall": "5.0", "Content": "This phone became a hand-me-down. I upgraded, my mom kept it. She washed it I don't know how many times in the washer and it just keeps working. Dropped it, sat on it, left it in extreme temperatures, stepped on it, etc.Guess all the stereotypical jokes about the nokias being indestructible are true huh?", "Date": "November 20, 2013"}, {"Title": "No use other than just talking", "Author": "Ujjwal Sharda", "ReviewID": "R3P7A066U12YL", "Overall": "2.0", "Content": "The phone is good only for talking. No applications or games work on it. All keep asking for a smart chip...waste of money", "Date": "August 16, 2013"}, {"Title": "No FM Radio!", "Author": "SLC Resident", "ReviewID": "RTQHATDFX181Q", "Overall": "3.0", "Content": "Everything looks good with the product except that the title of the ad is incorrect. There is no FM Radio feature in the phone!", "Date": "June 30, 2013"}, {"Title": "Okay buy", "Author": "Nell", "ReviewID": "R1SLW7K6Q5XM2C", "Overall": "3.0", "Content": "It was kind of bruised and it looked kind of old but I guess the important thing is that it works.", "Date": "June 28, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nEasy-to-use, affordable phone in black for voice communications and full range of messaging options, including email, IM, text, and MMS\nBuilt-in web browser for MEdia Net downloads and Internet surfing; EDGE data connectivity\nVGA camera for still photos; Bluetooth for handsfree devices; personal organizer\nUp to 3 hours of talk time, up to 384 hours (16 days) of standby time", "Name": "Nokia 2600 Classic Unlocked GSM Phone with VGA Camera, Video, Internet Browser, Bluetooth and FM Radio - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BzQ11qx7L._SX300_.jpg", "ProductID": "B0057JH8PY"}}