{"Reviews": [{"Title": "New firmware saves the day", "Author": "Gaz Rendar", "ReviewID": "R1EG4OEN40HFMW", "Overall": "5.0", "Content": "The Dell Venue Pro is emotionally difficult to review.  This phone looked like a game changer--the prophesized device to rally the masses to the Windows Phone platform.  Unfortunately, there have been previous issues with the phone that have caused it to just miss the mark.  However, a recent Dell firmware update has restored my faith in the device.  This review is based on using the phone for 7 months, and using it with the new firmware update for 1 month.HARDWAREFrom a purely visual standpoint, I'd say the DVP is....flat out cool.  The 4.1\" display is covered with slightly curved gorilla glass that both looks and feels great.  The sides of the phone have a chrome metallic look (it's still plastic) and the back has a texture rich plastic cover with a repeating cut diamond pattern. The top and bottom are beveled with a rubberized coating.  Plenty of thought went into the accents, color, and shape of this phone.  I have to commend Dell here; they sure know how to design the exterior of a mobile device.  Given its professional looks and general rarity among the common public, every time I pull my DVP out in a crowd I always get surprised and wondrous comments and questions.  There is also a micro-USB jack on the bottom, a 3.5\" headphone jack up top, a decent volume rocker on the right side, a dedicated camera button on the bottom right, power button up top and speaker and mic cut outs on the rubberized bottom.  Keeping the speaker and mic off the back of the phone helps when using the speakerphone options, but the power button is a little more difficult to hit than I'd like.  I've gotten used to it over time, but it still could be more accessible.The outside of the phone might win beauty pageants, but the internals were a big question mark.  All WP7 devices to date have a mandatory 1GHz processor, so it is not a surprise to find that here.  But the amount of RAM in the device was a mystery until recently.  Dell originally listed the Venue Pro has having 512MB of RAM on its website, but it removed that spec.  Third party apps reported the device as only having 256MB of RAM.  Posts in forums suggest that the 3rd party apps might not be able to recognize all of the RAM.  But with the new firmware update there is a correct reporting of 512MB of RAM.  This is a huge relief since Microsoft will be releasing a software update soon that incorporates more RAM-intensive multitasking capabilities.The keyboard on the device is high quality, especially if you prefer the portrait format.  Each button has a satisfying click and travel distance, although I still slightly prefer the feel of jelly-like buttons on Palm portrait keyboards. The slider mechanism feels solid and has a good snap to it.  Since the home screens and many of the native apps within WP7 are either exclusively portrait, or favored towards a portrait format, the DVP's keyboard can be considered more useful than the LG Quantum or HTC Arrive.  The complication is the heft of the phone.  This thing feels like a brick in your hand, usually in a good way, but when the keyboard is open it does require larger sized hands to be able to comfortably hold the device, type on the keyboard and reach up to the tap the screen.  An open DVP in small hands is a disastrous fumble waiting to happen.SCREENThe screen is AMOLED technology sporting the standard WP7 resolution of 800 x 480.  Only the Samsung Focus's Super AMOLED screen is better among WP7 devices.  The DVP has deep blacks and fast response during gameplay and video playback.  Images are sharp and crisp.  The only real downside is that it washes out in direct sunlight easily.PHONE/RADIOSThe call quality on the phone is a notch above average.  I haven't experienced any significant call drops.  The earpiece provides good voice quality and people have said that the DVP's mic is clear.  The volume is sufficient for 95% of environments, but there have been select times outside where I wish I could bump the volume up an additional 10-15%.While I haven't had many problems using WiFi, I do know that it has been widely reported that some devices freeze up when using WiFi and browsing the Marketplace.  It seems like this is more likely to occur in the 16GB models and could have been the result of a faulty micro SD card (the DVP has a micro SD card that is buried under the SIM slot not meant to be tampered with).  However, the firmware update seems to have fixed this problem.  I haven't had a single Marketplace WiFi crash with it yet.The Bluetooth EDR 2.1 pairs and works with my Plantronics headsets, and my car.  However, I have come across a curious circumstance that if I connect to my car, turn off my car and leave the DVP's Bluetooth on and come back to my car the next day, it would only automatically pair with my car half the time.  The other half of the time I had to go into the DVP settings and turn the Bluetooth off and back on.  With the firmware update, that is a problem of the past.  Bluetooth pairing with my car now works like it should.CAMERAThe firmware update has improved the camera, but it was, and remains the most disappointing aspect of the phone.  I have low expectations for cameras on phones, but the camera on the DVP now barely meets my minimal requirements.  In sunlight it is possible to shoot quality 5MP images and 720p video.  But as soon as the lighting drops to average indoor lighting, the camera's quality seems to drop exponentially.  The flash provides little help, only provides benefit with 3 feet, and can cause color wash out.  The firmware update shifted the camera performance from abysmal to very average. So if high camera quality is one of your top 2 or 3 requirements for a phone, then I'd probably go with the Focus or Quantum if you want to stick with a WP7 device.PERFORMANCEEven before the update my Venue Pro performed most WP7 tasks smoothly.  From a speed and responsive standpoint, first party apps are generally flawless and a pleasure to scroll through.  Third party apps can sometimes be hit or miss, but this feels like a WP7 problem and not a problem stemming from the hardware.  The only time I worried about the performance from the phone is the occasion Xbox LIVE game.  A game that has a rich, always moving 3D environment, such as Glyder, previously suffered from slowdown hiccups.  The slowdown can partially be remedied by resetting the phone and directly returning back into the Xbox LIVE hub.  The slowdowns seen in some games have been improved upon the addition of the new firmware update.SUMMARYWhile there were negative aspects and question marks pertaining to the DVP, overall, I still really like the device.  The Copy & Paste NoDo update made mobile Office an outstanding piece of software.  It is, well--powerful to be able to use real Power Point on the phone.  I can download a .pptx file from my SkyDrive, practice the presentation with working, accurate animations, make quick edits, and email it off to where it needs to go.  Quick Office or Docs To Go do not work as smoothly with .pptx files as WP7 does.  I'm also an Xbox LIVE addict, so I recognize that earning achievement points on the go carries more weight with me.  And I've been a long-time Zune Pass subscriber and being able to download pretty much any song, at any time, directly to my phone is a huge perk.Combined with the efficient portrait keyboard, curved AMOLED display and gorgeous body the DVP is a great choice for anyone looking for something besides iOS and Android.  The DVP used to come up just short.  The firmware issues and a botched initial release killed the tremendous momentum that the DVP had leading up to the WP7 launch.  But hey, better to fulfill the prophecy late than never, right?When initially released, the DVP could have been docked a star or two, but I hope discussing how the firmware bumped the phone up to 5 stars was helpful to people on the market for a new smartphone.EXTRA UPDATE - MANGO WP7.5I originally wrote this review about a month before the Mango update rolled out. I've been using this phone for a year total now, and have received the NoDo update, the aforementioned firmware update, and have now had the Mango WP7.5 software update for about 3 months. With the firmware update and Mango this phone is highly competitive in the current smartphone scene. I know you can find plenty of Mango reviews out there, but the stability improvements on the DVP are noticeable. Since updating to Mango I've probably had to reset my phone a total of 5-6 times, and only once did I have to pull the battery out in three months for a hard reset. My Android-using friends typically have to reset their phones once every two days.You want completely free, turn-by-turn GPS directions with voice prompts and traffic warnings? It's here on the Mango DVP now. While you can talk to Siri on an iPhone with casual voice commands, please be aware that you can essentially do all of the same things on a Mango Windows Phone. Just say, \"Open Weather,\" and my DVP shows me the forecast. Say, \"Open Minesweeper\" and the game starts, say \"Chinese Food,\" and you're presented with a list of Chinese restaurants and recipes. I can also conveniently and easily dictate text messages in the car with Speech-to-Text. Simply hit the search button at the bottom of the phone, then the eyeball icon and the camera turns on and I can scan bar codes and Qcodes in real time to find the best prices on merchandise. The camera app has been improved so that it saves custom settings now. Twitter and Facebook are even more tightly integrated. I use the DVP as a remote to navigate my Xbox 360's menus on the HDTV. I can choose to group only 3 out of my 5 email inboxes together into 1 Live Tile, effectively keeping my work email inboxes separate from my grouped personal email inboxes. The WP app marketplace has over 50,000 apps as of this review update. Can you follow your favorite obscure band with an app that is available for iPhone? Maybe not. But can you check your flight status with a Delta app, or your prescription with a Walgreens app, or showtimes with a Flixster app, or stream a movie with a Netflix app, or do anything else that is associated with a remotely popular/mainstream app on WP? Absolutely. All in all, this is a highly competitive and complete phone. You don't have to limit yourself to a 3.5\" screened iPhone or an Android phone that may never receive an OS update if you don't want to. You really do have a choice now. iPhones and Android devices might still be the best pick for some people, but you really can consider a WP device as a legit 3rd player before you make a purchase. And if you want a 4.1\" screen WP phone with a beautiful display and a Palm or Blackberry-ish portrait keyboard, the Dell Venue Pro still holds up well today, 1 year after it's release.", "Date": "August 21, 2011"}, {"Title": "DVP Unlocked", "Author": "gpablo", "ReviewID": "R1WR0Z1JP2OHQ1", "Overall": "4.0", "Content": "Really great device!Only the camera is very low quality.Upgrade to Mango is strongly recommended.The unlock works fine.", "Date": "September 26, 2011"}, {"Title": "pageplus123 is a cheat", "Author": "hehedeba", "ReviewID": "R2B95Y4E0ZZI6H", "Overall": "1.0", "Content": "Paid for a brand new Dell Venue Pro mobile phone. But was delivered one that:1) Has scratches over the metallic edge of the phone2) Has dust underneath the LCD screen3) Has worn out \"Windows Mobile\" label and logo on the battery cover4) Is overall dirty and outright obvious to be a used handset instead of a brand new one.Disappointing considering I really like the Windows Phone (even if it is WP7) and even paid for priority shipment. I've been buying mobile phones on Amazon for years but this round my option had been limited given that Dell Venue Pro is quite an old model. pageplus123 is really a nightmare experience for me and I wish to share my lessons.", "Date": "November 7, 2013"}, {"Title": "Not fully satisfied", "Author": "Vasif", "ReviewID": "RHX1SI7J07SA5", "Overall": "3.0", "Content": "I decided to share some thoughts so that people will be more careful before ordering this phone from this seller. Nothing wrong with phone but I received it in the box which was opened before. So the manufacturer seal on the box was broken and then some piece of paper was stick on it. The box does not look new. The phone is not fully unlocked or sim free. It still has some links to T-Mobile and if you go to its settings you will see it was T-Mobile phone before and was cracked to be unlocked. May be there is no purely sim free DELL Venue Pro phone in the US market and this is the only you can use it unlocked. Do not know......Battery life is very short, so it would be good idea to order one more as spare. Regards, Vasif", "Date": "August 14, 2011"}, {"Title": "AWSOME!", "Author": "kgriff", "ReviewID": "R1GTTXOIG78T7S", "Overall": "5.0", "Content": "This was by far the best smart phone i have ever owned! (coming from having an iphone). I got this phone because i needed a cheap smart phone while my Iphone was down for repairs. But this became my primary phone! its wayy better than the iphone. The keyboard is amazing! This phone is pretty heavy though because it is actually made with metal! i dropped this phone countless times and it still runs strong. The only down side is there are so little aps for the windows phones. It still doesnt even have Instagram, snapchat, ect.. But it did come with windows office! I was able to write papers on my phone on the way to school! And the windows system was extremely easy to figure out! But be advised! This phone uses the normal size sim cards not the new smaller \"micro\" sims that all the brands are switching over too.", "Date": "January 17, 2014"}, {"Title": "Thank you", "Author": "William", "ReviewID": "R7IFLLOLMWCTL", "Overall": "1.0", "Content": "so did you  find anything out  to help to unlock  my phone i tried to call t mobile  and they could not help me", "Date": "December 3, 2013"}, {"Title": "Good, but switching from AT&T; soon", "Author": "southern heritage", "ReviewID": "R2A6I278UK28PE", "Overall": "5.0", "Content": "The phone came already with tango 7.5, so I didn't have to up grade. It was new, and not used or refurbish. It still had the AT&T; sim card in the box. It showed it was manufactured in February of 2012.  Shipping was very fast from isoldit. So far, after a learning curve, it's working smoothly. My husband has big fingers and the curved glass is better for him to select, but he has to get used to doing a light touch. No mashing, lol. I have iPads so it is taking a little bit to find things. We are going to straight talk after our contracts end and plan on taking this phone with us. I will re-review in a few months to update everyone how that went.  It is bigger then most phones but feels like it will hold up better. We didn't want to sign any contracts or pay 400.00 for a lumia 900. So this was our best option. After getting one, everyone in our family will get one. I can't see paying 4x400 for our phones verses 4x150.  I accidentally found out this phone can tether. So far I would definitely recommend this phone. So, I'll be back.", "Date": "August 21, 2012"}, {"Title": "GOOD", "Author": "MADY D.", "ReviewID": "R293VE6DGFHH0U", "Overall": "5.0", "Content": "I BOUGHT THIS ITEM AND I COULDN'T USE IT RIGHT AWAY BECAUSE IT WAS LOCKED , I CALL DELL AND TOLD THEM MY STORY, THEY ASKED ME TO SEND THEM PROOF OF PURCHASE SO I SEND THEM THE EMAIL FROM AMAZON THAT I GOT AND THEY REALLY HELP THEY TOLD ME THAT I WAS GOING TO RECEIVE THE UNLOCK CODE WITHIN A WEEK BUT ONLY TOOK 1 DAY OR SO, I WAS SO HAPPY AND MY PHONE IS WORKING GREAT.", "Date": "March 27, 2013"}, {"Title": "Pretty good phone, some dislikes", "Author": "Austin", "ReviewID": "R1JO2OGG9KDIMW", "Overall": "4.0", "Content": "Pretty good phone overall, great picture and both keyboards are easy to type on. The camera is really good, Windows Office is GREAT and really comes in handy,and never freezes or crashes on me. The only negatives I have are that there aren't many cool apps for the phone, the battery life is very short if your on it all day texting and on the web, and if the phone dies on its own, it resets your whole phone, deleting all of your pics and downloads.", "Date": "February 11, 2013"}, {"Title": "UPDATE", "Author": "bambam", "ReviewID": "R1OCLSQUDA6QH7", "Overall": "4.0", "Content": "HAD PHONE ALMOST A WEEK TOOK PHOTOS REVIEW THEM AND TO MY DISMAY PHOTOS ON CELL OF ANOTHER FAMILY TAKEN JULY 2010??? OTHERWISE PACKAGING APPEARED NEW ABSOLUTELY REFURBISHED. BUYER BEWARE OF THIS SELLER: BREED.UPDATE MAY 11, 2014: PURCHASED ANOTHER DELL VENUE 8GB DIFFERENT VENDOR SAME PHOTOS ON NEW PHONE. APPARENTLY COMES STANDARD ON ANY DELL VENUE PHONE. AM UPDATING WITH FULL APOLOGY.", "Date": "April 21, 2014"}, {"Title": "Best Purchase Ever", "Author": "J. Johnson", "ReviewID": "R2K8QRQVHJ90CT", "Overall": "5.0", "Content": "This is the best phone that I have ever had. Even though I have never had a iPhone or a Galaxy, I love my DVP. There are only two things I wish could be better...the battery and the camera. I love taking pictures but with this phone, I must take them outside. I also wish I could upgrade to windows 8. That would be awesome. And I also wish there was a phone protector for this phone...i'm pretty clumsy. I've dropped it about 4 times since I got it in Feb. But other than that I love this phone and will not get another one no time soon =)", "Date": "April 25, 2013"}, {"Title": "Best phone I've ever owned", "Author": "Jesus Ramos Jr. \"Prophet Jay\"", "ReviewID": "R19LWTWRN47ONL", "Overall": "5.0", "Content": "I'm very happy with my phone. It does everything I want it to do. With a Simple Mobile Sim card I only pay $40.00 a month for unlimited everything.", "Date": "January 27, 2013"}, {"Title": "Good phone i love it!!!", "Author": "BB gun lover =)", "ReviewID": "R12BB7JNYAOMRO", "Overall": "5.0", "Content": "I use this phone every day. I type my school work on it on Microsoft word. I have dropped the phone 2 times and only have small scratches on one side. P.S when you take a photo with flash on it makes a strange striped pattern. And the app store is lacking some apps but they are putting more on it. overall good phone for all people whether your the working person, or the party person. Grate phone.", "Date": "January 2, 2013"}, {"Title": "so far its been a delightful surprise to find a thriving alternative to the icraze ....iiiiii... simply hated my iphone 3 g s", "Author": "Eric", "ReviewID": "RVRWS391NKZWR", "Overall": "5.0", "Content": "I bought this device with the hopes of replacing my limiting mediocre ancient slab of apple product the i phone 3 g s from at&t; ...broke my screen so many times i lost count- at 50-75 sometimes 100 dollars a piece with parts and labor costs more frequent than an exotic automobile for crying out loud. Is it too much to ask for a touch sensitive device with comparabe hardware / specs. I am continuing to enjoy my Dell venue pro long after my initial purchase date and have lots of friends asking about the phone thats \"just as good if not sweeter\" than the iphones. The touch screen on my 3 g s made me feel like a mad man two steps into most tasks although short tempered i predict a similar inspiration of rage and frustration to anyone who taps thier foot involuntarily while waiting or is less patient than somebody with nothing to do no where to go no people to see - it's really cut down on the level of communication im able to sustain with even my closest loved ones. Im elated to report the touch screen on the Dell is appropriately responsive in a non inflamatory consistent demonstration of what feels like logic based touch sensitive response with a more well calibrated tool for the user to conduct business upon, without having almost chucked the hope diamond-of-a-thing into an infinate inferno of endless black hole....dom.Yes, YES! this is what i've been hoping the universe would show to me someday and today- i have found that hope handsomely rewarded in the purchase of my DVP!Only gripe I can squeeze out is the 5mega pixel camera is either not configured for optimum function or just a tad substandard in terms of ease of use without much of an interruption. with.. 3 out of 10 pics coming out as blurry wastes of available storage space on the 8gb device", "Date": "July 20, 2012"}], "ProductInfo": {"Price": "$208.25", "Features": "Dell Venue Pro 8GB Smartphone Cell Phone Windows Mobile Tmobile", "Name": "Dell Venue Pro 8gb Smartphone Cell Phone Windows Mobile", "ImgURL": "http://ecx.images-amazon.com/images/I/41gKFV%2BxVUL._SY300_.jpg", "ProductID": "B0058KI41E"}}