{"Reviews": [{"Title": "One of the devices I cannot live without", "Author": "Shelley Gammon \"Geek\"", "ReviewID": "R2J1B9TBCTRHX8", "Overall": "4.0", "Content": "The iPhone 4S is more than just a phone. It makes technology not only accessible to the common man, it makes it easy to use for anyone and everyone. A former neighbor of mine, who is completely blind, said that it's the best phone he's ever used, as the assistive technology built into the phone makes a device with no tactile feedback so easy to use.This is my third iPhone - I had the original 2G, then upgrade to a 3GS and now the 4S. One of the most celebrated features of the new phone is Siri - and it is entertaining, helpful and on occasion, frustrating. I didn't give this awesome phone 5 stars because I do have some issues with it and there is always room for improvement - but it's by far the most feature-packed phone with the most usable interface available today.With my 3GS and the latest iOS software, I could click and hold the clicker on the microphone portion of my earbuds and say \"dial Jane Doe, mobile\" and instantly, I'd get a reply back saying, \"Dialing Jane Doe, mobile\" and it would dial. Now ALL voice commands are routed through Siri online - there is a significant delay - and if there is a Siri outage (which admittedly is happening less and less), I cannot voice dial at all. I find that irritating. Very irritating.The outbound camera is very high quality for both video and photography... but works best with bountiful light. The camera app doesn't do the best job on the front facing camera, yet another app I've used, Incredibooth, does a much better job in using that camera with higher quality photos... so I'm not sure if it's a hardware issue or a post processing issue. Unless I'm in very bright lighting, I find the front facing camera to be very grainy and low quality.Most cases out there cause a white fog to show up in photos or video if you use the flash or light as it bounces back along the hole in the case around the glass back... so unless you have a case that has a giant hole in the back to accommodate the light, you may have to take the phone out of its protective case to use the camera in low light conditions where you need the light or flash. The light is very powerful and I've used it as a flash light more than once.I use Siri ALL THE TIME - for finding specific retail places near by, to ask quick questions, etc. My 3GS was a 32GB, so I rode the fence on whether to get my 4S as a 32 or 64GB - I'm so glad I opted for the bigger model. I use various apps like AppShopper to find recently and temporarily reduced and free apps and download apps all the time to try them out. I simply wouldn't have the room on my 32GB for all I do. Because of the high quality of the video camera, I find myself shooting video quite a bit - and that high quality camera means high quality photos & video that can take up a lot of space really quick. That, plus all the podcasts I subscribe to - and I feel like I've got some room to spare... but things would have been a tight fit on just 32GB.I got the AppleCare+ for my phone and it's already paid for itself. I initially rode the fence on getting the warranty since the price has gone up - paying $99 for a $400 phone seemed a bit like paying $2500 for a $10000 car - just too steep - but without the protection, a replacement phone would cost me an additional $299. Even though I have a case with a front flap to protect the glass, I dropped my phone on our caliche rock drive way - and naturally, it landed face down with the flap conveniently flying out of the way and shattered the glass. Because I had AppleCare+, I got the phone replaced for only $49.Taking a photo and attaching it in an e-mail could not be easier. Apple really has thought of everything. Most geeks already know the features of the phone and the OS, but non-geeks wonder, \"will I even be able to use it?\" The answer is unequivocally, YES! The best test case is my mother, who also has a 4S - an upgrade from her first iPhone, a 3G. My mother will openly admit that she just got chiseled out of the ice just a few weeks ago. She's about as non-techy as they come.  I literally have to go to her house to help her change the batteries on her TV remote control. She has zero mechanical or technical skills... yet she LOVES her iPhone. She uses Siri all the time, surfs the web and uses several apps. Of all the cell phones she's ever used, she readily admits that it's the most useful phone or device of any kind that she's ever owned. Prior to an iPhone, she never used an address book on her phones and never used any function other than dialing numbers by memory and receiving calls. In addition to the phone being fairly intuitive, the Apple Stores offer free classes all the time - including classes on how to use the iPhone. You can even take the class before you ever own anything by Apple - you just go to their site, look up the retail store near you and look up their class schedule.The iPhone is a life changing device on so many levels. With the free \"Find My Friends\" app by Apple, my husband and I can keep track of where we are without having to call each other... and using that app, I can talk my mother through turns and other directions to get where she's going - because on the app - I can see where she is in real time. Whether I'm checking the weather, stocks, or sending an e-mail - it's by far the easiest interface that's ever been made for a phone.", "Date": "February 20, 2012"}, {"Title": "Great computer worst phone ever", "Author": "Fair and balanced", "ReviewID": "R3F008HKVMCB5I", "Overall": "2.0", "Content": "Excited about buying my first Iphone...bought it in the USA and an official apple store and had my sim card cut at a reputable american company.  I discovered that the iphone dazzles with great pics/video and the apps run smoothly on the crystal clear screen.  (5 stars)Battery life  (1 Star).  Take it off the charger at 99% (on all night).  1 hour later with the screen off, gps off, bluetooth off and wifi off...my battery is down to 80%...and it goes downhill from there.Rampant Sim card failure (1 Star or less).  Google iphone 4s and \"invalid sim\" or no service...no sim inserted and the like.  You'lll discover a pandemic of sorts amongst the Iphone 4s.  I bought both my wife and I a 64 GB 4s.  Both sims failed.  My wife's  intermittently.  Mine lasted great for 2 weeks and then completely died.  Resetting phone and re-inserting the sim also does not work.  I had 3 different sims cut thinking it must be the sim.  Major buyers remorse.  I would've bought a high-end android phone over this ANY day.  Now I have to buy another new sim card and carry a low end phone and carry the 4s around as my digital organizer.  Even the new firmware update did not help battery nor the many sim failures.APPLE, I PRAY YOU ARE HEARING THIS", "Date": "January 4, 2012"}, {"Title": "Get it directly from Apple", "Author": "Raed Almulla", "ReviewID": "R2P330YR2FKB44", "Overall": "5.0", "Content": "I got mine directly from apple.com officially unlocked, delivered free of charge, total cost was $925 ($850 + $75 Tax) and I have received it within only 3 days.On the website the delivery date was 1 to 2 weeks. However, I got mine shipped the next day.", "Date": "December 11, 2011"}, {"Title": "Perfectly perfect!", "Author": "EO", "ReviewID": "R1BJESN8Q92NH1", "Overall": "5.0", "Content": "I bought this product for a friend in Ghana and his words is what I quote \"This is perfectly perfect.\" Shipping came in on time as expected with all components. Its factory unlocked is very true and I will recommend this for anybody oversea who is looking at buying iphone 64 factory unlocked from this company.", "Date": "July 27, 2012"}, {"Title": "my first time", "Author": "marco francisco gaviria", "ReviewID": "R1P5M7IYKT3WAB", "Overall": "5.0", "Content": "Ok, i live abroad so it took me some time to decide wether to buy any thing by internet, now i see it works.Thank you", "Date": "August 17, 2012"}, {"Title": "Great product good seller, I recommend", "Author": "Abraham", "ReviewID": "R1JSWQUDT8HR6I", "Overall": "5.0", "Content": "The box came selaed, yet I saw some fingerprints on the screen which make me doubt, the device seem like bran new except by that, I think it was used before anyways it has been working perfectly in Venezuela with Digitel and Movistar so it is unlocked if this is what you are looking for, I recommend the seller the telephone works just fantastic but batery drain fast if you are using it like for skype long  skype calls and receive tones of email daily.", "Date": "June 25, 2012"}, {"Title": "Wow!", "Author": "Hamad Qatar", "ReviewID": "R2FWT29KQVB7U", "Overall": "5.0", "Content": "I am from QATAR, and the new Iphone 4s factory unlocked is something unbelievable. I can use it here in the Middle East or Europe or US or anywhere! The battery is totally different from Iphone 4. Everything look like new in Iphone 4S.I recommend this company since the price for (Iphone 4s 64) cheaper than the Middle East price by 600 US $!", "Date": "November 26, 2011"}, {"Title": "No One buy IPhone 4s from \"akylabooks\" Seller", "Author": "Maher Al W", "ReviewID": "R2XYHCCS35C74V", "Overall": "5.0", "Content": "Hi,I want to advise all the buyers no one buy any IPhone 4s from the \"akylabooks\" Seller.Because he is Untruthful and he put the IPhone for sell and then after the buyer place the order he will cancel the order without any reason.Regards", "Date": "January 13, 2012"}, {"Title": "Awesome iPhone i got", "Author": "Alonso", "ReviewID": "R21G90CLWMP6XA", "Overall": "5.0", "Content": "This phone is awesome no scratches in the front or back it very clean also the product works flawlessly I had some issues that were minor but i contacted seller and he responded very quickly and helped me solve the issue very good customer service 5/5 on customer service. As for the phone its flawless and works very well besides that it had some marks on the sides it didnt matter all that matters is the screen which has no scratches at all. Would reccommend buying from this seller.", "Date": "May 1, 2014"}, {"Title": "not new - and received with different order number", "Author": "PRASAD AMONKAR", "ReviewID": "R26PNXIQPUWNSG", "Overall": "2.0", "Content": "the iphone was not new and the  box seal was tempered............immediate refund of $100 is needed.or any other item worth of 100 dollars", "Date": "February 23, 2014"}, {"Title": "Is not new Significant wear Yellowing of the screen is also", "Author": "Tang Lei", "ReviewID": "RRG9RHK9GRHCB", "Overall": "1.0", "Content": "Is not newSignificant wearYellowing of the screen is alsoPrice higher than the price of many other people, but to get such a product, I feel very disappointed.", "Date": "January 8, 2014"}, {"Title": "Thank y", "Author": "tommy cyrus", "ReviewID": "R3OBIKC5T0I2CO", "Overall": "5.0", "Content": "U made my child's eyes light up . And after the last phone that wasnt right we really thank u. We will be buying another phone in the near future. Thank u very much from the Cyrus family.", "Date": "November 16, 2013"}, {"Title": "You sold me a cell phone media used (Ustedes me vendieron un telèfono celular usado)", "Author": "Eduardo Pereira", "ReviewID": "R2SECSK6PTSCB9", "Overall": "1.0", "Content": "You sold me a used cell phone with faults in wi fi system and the battery was used, when it was published again and the price was quite expensive. I sent an email three weeks ago and never respondienron. I demand that my money back that you cheated me.Ustedes me vendieron un telèfono celular usado con averìas en el sistema de wi fi y la baterìa era usada, cuando publicaron que era nuevo y el precio era bastante costoso. Les enviè un correo hace tres semanas y nunca me respondienron. Exigo que me devuelvan mi dinero por que ustedes me estafaron.", "Date": "October 19, 2013"}, {"Title": "Returned iPhone and never heard from seller again", "Author": "JR", "ReviewID": "R4AE76YRJPDSI", "Overall": "1.0", "Content": "I purchased this iPhone for use overseas and had problems with the first one. I returned it and the seller replaced it. After having problems with the replacement I returned that too for a replacement or refund. It turns out iPhones manufactured in S Korea don't work in all countries. I haven't heard from the seller since despite contacting them numerous times over the past 18+ month so I'm out almost $1,000. iPhone itself is an excellent product, but I now only purchase directly from Apple.", "Date": "September 29, 2013"}, {"Title": "Apple iPhone still breaking grounds", "Author": "crystal g owonubi", "ReviewID": "R4WBHCKTFMYBS", "Overall": "5.0", "Content": "This is an excellent device with extremely high quality build. I would still recommend apple over any other brand, they are still a bit pricey and would do well to build a mid range product line.", "Date": "August 7, 2013"}, {"Title": "A true disaster experience!", "Author": "Javier Angel Alvarez", "ReviewID": "R1HLUUJ6ZBB3U3", "Overall": "1.0", "Content": "Everything went wrong. I`m not saying that there was a bad intention on behalf of the sales people (because they tried everything to help me get it going) But it just was not unlocked, and had a very poor experience due to the fact that I was traveling and had no time to replace it. Finally I had to stay with my iphone 4 (which I still have). Amazon attitude was not as expected, but they followed the process. I was promised a full reimboursement, because it was not unlocked as published, that included my expenses for shipping, and they did not comply. Better to forget experience.", "Date": "July 14, 2013"}, {"Title": "Very happy to have it!", "Author": "Mumu Takami", "ReviewID": "R2Q1DCGF35G13K", "Overall": "5.0", "Content": "I got iPhone 4S 64GB (factory unlocked) and am using it in Germany. Soon I will get a SIM-card for it and I'm excited about using it as a phone as well. Fast delivery, good service!", "Date": "July 8, 2013"}, {"Title": "they gave me an old one!!!!", "Author": "Celso Mario Soicher", "ReviewID": "R3KRO3XVMQH7JT", "Overall": "1.0", "Content": "I`m so so disappointed!!!!!I boughut this iphne and spent almos 1000 dollars as a new one in nov 2012!Now it's not workingI took to apple store to fix or to change and from the serial number they had show me thah phone is old. Not on warranty!!!!!Waht shoul I do????", "Date": "June 12, 2013"}, {"Title": "Great phone.", "Author": "José Luis Alvarez García", "ReviewID": "R9NFNS7TPNLT8", "Overall": "5.0", "Content": "Exactly waht we expected, direct replacemento for another one. The \"extra\" good thing to say about this one, came factory unlocked as it was promised and works perfect. Highly recommended.", "Date": "May 18, 2013"}, {"Title": "this is good", "Author": "Fangteng (Phil) MENG", "ReviewID": "R2UBZW1634UL9H", "Overall": "5.0", "Content": "it did come to my home on time. it is a nice cell phone. i like this cell phone. it is greet.", "Date": "February 15, 2013"}, {"Title": "GREAT PRODUCT...", "Author": "Johan Sibaja Godínez", "ReviewID": "R3D8LESCOMCGEF", "Overall": "5.0", "Content": "They always were kind and kept in touch about whatever I needed about this order. They helped me and everything was great.", "Date": "January 28, 2013"}, {"Title": "satisfied but Strange issue with Apple Care", "Author": "XP Pro", "ReviewID": "RZZEHLOIJ5ZJN", "Overall": "4.0", "Content": "Phone works Great No complaints with the phone.  When I tried to get the Apple Care for my Phone the customer service told my this serial number was registered by a dealer as being broken and non repairable so I was unable to get apple care for it.", "Date": "January 27, 2013"}, {"Title": "good", "Author": "alessa", "ReviewID": "R2TT9IG205O0VW", "Overall": "5.0", "Content": "this product is interesting and good product. good factory. this product help for complete anything. is important have this product", "Date": "December 31, 2012"}, {"Title": "iphone 4s", "Author": "Devon", "ReviewID": "R310AV1FGC5OOH", "Overall": "5.0", "Content": "i just love this phone with 64 gb storage what more can i ask for i will cherish this one.", "Date": "September 2, 2012"}, {"Title": "Excelente producto", "Author": "Nestor Ramirez", "ReviewID": "RMRFBLJ1GKWVY", "Overall": "5.0", "Content": "\"excelente, coloque mi SIM CARD, segui as instrucciones del iphone y funciono de inmediato, sin errores, se adapto a las operadoras de venezuela sin complicaciones, e tenido blackberry por 2 años, se me daño y opte por comprar el iphone y sin duda alguna fue la mejor decision, el telefono es el mejor del mundo, y recomiendo al vendedor 100%\"", "Date": "March 10, 2012"}, {"Title": "I Phone4s", "Author": "Shigufta Morales", "ReviewID": "R18J85WCJQBPDU", "Overall": "4.0", "Content": "This was a xmas gift that I had promised my son, He loved it and was so happy to receive it.  I thank you for the quick delivery.", "Date": "March 16, 2013"}, {"Title": "excelente", "Author": "efrain diaz", "ReviewID": "R138YRNZN2JMZT", "Overall": "5.0", "Content": "excelente equipo, es un tremendo telefono, me encanta mi iphone, puedo hacer de todo con el por la capacidad que tiene", "Date": "November 28, 2012"}, {"Title": "Wonderful!", "Author": "Fernando Aires Mesquita Carvalho Teixeira", "ReviewID": "RM9MEOJ2E2L7B", "Overall": "5.0", "Content": "No word to describe this iPhone! Amazing. And don't buy any other storage! The 64GB is totally necessaryif you want to enjoy all features of your iPhone.", "Date": "November 18, 2012"}, {"Title": "Exterior is nice, Interior below expectations", "Author": "Dima", "ReviewID": "R2D0ZDL1XW6RRS", "Overall": "3.0", "Content": "I bought this phone couple week ago. Previously I used Android phones, but now decided to buy iPhone to compare.I like the form factor of iPhone 4 & 4s. However, software is below expectations.1. I didn't expect that battery life is so bad. Even in idle state the use of the battery is unexpectedly high. The bottom line: it doesn't keep even one day, taking into account I do not use it too much.2. Software is too conservative from my point of view. Android is definitely more flexible and more attractive. For example, I have multiple mail accounts, but I cannot set different notification types for them on iPhone. Also, I like live wallpaper and widgets, but they are missing on iPhone. I am not impressed at all.", "Date": "December 3, 2011"}], "ProductInfo": {"Price": "$495.00", "Features": "8 mega pixel camera with full 1080p video recording\nSiri voice assitant\niCloud / App Store / Air Print / Retina display\nUMTS/HSDPA/HSUPA (850, 900, 1900, 2100 MHz); GSM/EDGE (850, 900, 1800, 1900 MHz)\n802.11b/g/n Wi-Fi (802.11n 2.4GHz only)", "Name": "Apple iPhone 4S 64GB (White) - Factory Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/41f6TwGZEAL._SX300_.jpg", "ProductID": "B005YTY38C"}}