{"Reviews": [{"Title": "a very good acquisition", "Author": "Fredys G-Venezuela", "ReviewID": "RE0L1NWU01THI", "Overall": "5.0", "Content": "I am satisfied with the phone you buy from this seller, very good as described in its publication. I arrived in Venezuela in good condition, no scratches, charger and good packaging. This cell is allowed to buy as the price is very affordable. he works all camera, video player and speakerphone. buy it for a relative. Very good seller, I recommend it 100%. Fredys Garcia from Venezuela", "Date": "June 9, 2012"}, {"Title": "Exellent cell phone", "Author": "tvmont23", "ReviewID": "R2G1DBLHASDZUO", "Overall": "5.0", "Content": "Is a great pleasure to revie the exellent cellular phone. I used the phone mostly for international business is unlock and I just insert the sim card for the Country am in and continue doing my transaction. And Blackberry has a good reputation. I  recoment this saller and ebay for the shipment on time on this Item.Thnks", "Date": "February 24, 2012"}, {"Title": "blackberry", "Author": "MARÍA", "ReviewID": "R3SKDFPVOV9JIB", "Overall": "4.0", "Content": "gracias por sus servicios, el equipo me gustó y cumplió con mis expectativas, espero contar con ustedes en próximas ocasiones", "Date": "August 22, 2012"}, {"Title": "I'm rating the phone - not the seller, service, etc.", "Author": "Amazon Customer", "ReviewID": "R1DGA4CA9VHFNC", "Overall": "1.0", "Content": "This was the first and last Blackberry I will ever use. It's the biggest piece of crap out there. I'm sure there are Blackberry models that are better but I have no desire to find out. Maybe back in its day, this was something, I don't know. I owned it for about 4 months and couldn't stand it. The keys are small and slippery and have a slight angle, half of them to the left and the other half to the right. I have never had trouble typing on a QWERTY key board but this was impossible. 99% of the time I would hit the key next to it or both together. It severely slowed down typing speed because I always had to go back and correct. The screen is super small. It was very hard to read email and attachments. Browsing the web was just a waste of time because of its slowness and tendency to lock up, and don't get me started on rebooting the phone. It took around 5 minutes to restart. This may be normal for a Blackberry but seriously? The call quality was equally bad, especially when using the speaker. Never heard more crackling and distortion. I hated this phone so badly, that every time I hear the word 'Blackberry' my hair stands up! I'll stick with Apple or Samsung.", "Date": "April 14, 2013"}, {"Title": "exelente", "Author": "Marvin", "ReviewID": "R32B0L6J374TGJ", "Overall": "4.0", "Content": "Hola desde Honduras he comprado dos telefonos con este vendedor y por el momento estamos satisfechos asi que se los recomiendo.", "Date": "February 3, 2013"}, {"Title": "My phone is not charging at all", "Author": "smoothblackliver", "ReviewID": "R1R62TDJKGV8GG", "Overall": "1.0", "Content": "The battery is not charging at all and when i put in another battery from my old blackberry it is charging so please let me know what to do.", "Date": "December 4, 2012"}, {"Title": "the phone never worked", "Author": "s.smith", "ReviewID": "R2VTEBQ3DZLMJD", "Overall": "1.0", "Content": "i am not pleased and very unhappy i bought unlocked phones before and never had any troubles this one refuse to function i am out the country without a phone and to top it off its costing so much to return so i feel cheated and robbed", "Date": "November 14, 2012"}, {"Title": "RESETS", "Author": "cdoyle", "ReviewID": "R10AN5LZYWC9XI", "Overall": "1.0", "Content": "My boyfriend wanted this phone and found this one new for a reasonable price. We got it, he liked it being the email addict that he is (he just checks, he doesn't send many if any), but it resets on him once or twice a day. Battery is a little inconsistent too. One minute it is at 20% then it'll reset and when it turns on, it's 60%. A little strange.(two weeks later)After having it for a month now, it has been causing nothing but problems the battery does not last an entire day (and he doesn't even use it a lot). It now resets at least 3 times a day (sometimes when he's trying to send a text or make a call). For a new phone, it's been a disappointment. We wish we could return it.", "Date": "November 8, 2012"}, {"Title": "blackberry tour 9630", "Author": "german", "ReviewID": "RPZDPFMN2ST4A", "Overall": "2.0", "Content": "regular aparentaba estar en mejores condiciones el teléfono según las descripciones que daban y no fue así, deberian describir mejor los artículos tanto usados como nuevos, gracias", "Date": "January 16, 2012"}, {"Title": "excelente tienda", "Author": "douglas", "ReviewID": "R2V1NX0XLRVDLQ", "Overall": "5.0", "Content": "compre  este celular y es magnífico,  les doy un consejo a todos los que quieren realizar compras desde Venezuela  busquen celulares tecnología gsm,  ya que aquí  la tecnología cdma  es obsoleta  recomiendo 100%  a amazon y esta tienda asociada", "Date": "December 2, 2011"}, {"Title": "Not good", "Author": "Lee", "ReviewID": "RMGKAAODOJW5R", "Overall": "2.0", "Content": "Bought this product only to find out that it does not work with my current supplier even though its unlocked. Called to explain the the issues and ask for a refund. They told me its not their problem if I didnt do the research. deductions were to apply if retuned the protect out of the seven day return policy also, deductions will apply if it didnt go back with all parts and the way it came. So I kept the phone in fear of getting half.of what I paid for it.FYI doesnt have 3g or wifi waste of time", "Date": "May 25, 2012"}, {"Title": "bad purchase", "Author": "eric", "ReviewID": "RER82NAIB5U77", "Overall": "2.0", "Content": "It was not what i was looking for, lacking more specifications, did not have wifi, i am not served to South America, bad purchase", "Date": "August 10, 2013"}, {"Title": "very good", "Author": "luis", "ReviewID": "R1KRD0AKNNR73R", "Overall": "4.0", "Content": "very good product and amigle versatile in handling, this product is used by my 11 years as if he had had a lifetime", "Date": "February 9, 2012"}, {"Title": "Please be careful", "Author": "Samuel Colter", "ReviewID": "R2Z6H63NKWB52P", "Overall": "3.0", "Content": "It was said to be unlocked... was not true. I ended up paying more for the unlock than the phone itself.", "Date": "April 15, 2014"}, {"Title": "Very good", "Author": "Sabina Granado", "ReviewID": "R3ARQR2KY80BW5", "Overall": "5.0", "Content": "Very good product, I recommend it. Excellent quality, as it says the publication. presentation is very good, the price adjusted.", "Date": "March 10, 2014"}, {"Title": "New Phone", "Author": "ROBERT SHEFFIELD", "ReviewID": "R1LUVVWUL5DM1I", "Overall": "3.0", "Content": "The phone shipped fast, when we got it, the box and phone looked brand new, after charging got phone turned on by Verizon but phone kept dropping calls", "Date": "October 28, 2013"}, {"Title": "good", "Author": "comcel", "ReviewID": "RSLS2ECGMBJ64", "Overall": "5.0", "Content": "Good!! excellent items, its perfect and work excellent this is best good and I think buy more again thank you!!!", "Date": "September 9, 2013"}, {"Title": "Not Needed but Appreciated", "Author": "MedicRLY", "ReviewID": "REJ3WL8YPZRO6", "Overall": "5.0", "Content": "This seller went to great lengths to satisfy me as I was very frustrated with this order. Customer Service went far beyond what is expected most of the time, and it did not go unnoticed. I don't think I've run into anyone in my past that has tried so hard to make sure the customer is satisfied with their end product. I look forward to working with them again in the future.", "Date": "August 28, 2013"}, {"Title": "This phone is the best", "Author": "Pam", "ReviewID": "R28MR9KMKQKREV", "Overall": "5.0", "Content": "The moment i saw this  phone, i fell in love with it. I bought this phone for my brother in Africa. He called me back on this phone and told me, it has all the features he was looking for in a phone .The reception is great  He told me\" thank you sis. this phone is awesome\"", "Date": "August 1, 2013"}, {"Title": "Blackberry", "Author": "KLittlefield", "ReviewID": "R3QC0KMX2M4EBW", "Overall": "5.0", "Content": "The phone was what I expected.  The speaker does not work that great.  People can make out what I am saying but I can't make out what they are saying.  I needed the phone and the price was reasonable for what I got.  It came in a timely manner and I had no problem activating the phone.", "Date": "July 28, 2013"}, {"Title": "I like it", "Author": "mildred arango", "ReviewID": "R3J33BT1OU3ZYE", "Overall": "4.0", "Content": "The model we like, just come without some accessories that we had ensured that came with the phone as the USB cable, memory card and Spanish dictionary", "Date": "July 8, 2013"}, {"Title": "grate", "Author": "LM", "ReviewID": "RLB8CAL368JKL", "Overall": "5.0", "Content": "Very good condition and got to me on time. I would highly recommend to anyone. Worked perfect and like brand new condition.", "Date": "June 26, 2013"}, {"Title": "Good", "Author": "Raju", "ReviewID": "R5XT7D10HO2KD", "Overall": "4.0", "Content": "this item is cool. when i receive it, it is not an unlocked one. when i contacted the seller, he sent the code and the phone was unlocked. this is a good stuff and the phone looks good.", "Date": "April 1, 2013"}, {"Title": "q bueno", "Author": "Maria jose Zapata", "ReviewID": "R32PGT3ES2N1U", "Overall": "5.0", "Content": "que producto para bueno dure un año con el y fue mi mejor telefono  lo recomiendo con los ojos cerrado", "Date": "March 20, 2013"}, {"Title": "perfect", "Author": "alejandrodoz", "ReviewID": "R2JA71Z25MIPVC", "Overall": "5.0", "Content": "todo perfecto como lo describianlo recomiendo.. sigan asi..todo perfecto como lo describianlo recomiendo.. sigan asi.. mejor imposibletodo perfecto como lo describianlo recomiendo.. sigan asi..todo perfecto como lo describianlo recomiendo.. sigan asi.. mejor imposible", "Date": "March 12, 2013"}, {"Title": "GOOD", "Author": "EBELE", "ReviewID": "R10YUIENVLIQ24", "Overall": "5.0", "Content": "THE PHONE WAS IN GOOD SHARP, JUST LIKE NEW. I WILL RECOMEND TO MY FRIENDS, I WILL STILL BUY MORE,", "Date": "February 14, 2013"}, {"Title": "Me siento estafado", "Author": "Daniel Garcia", "ReviewID": "RX6KP1KZ7GEER", "Overall": "1.0", "Content": "El equipo es reparado y aún así llegó en mal estado, no funcionan varias teclas ni el auricular, me siento estafado", "Date": "January 15, 2013"}, {"Title": "Bueno", "Author": "Abraham Granado", "ReviewID": "R3DOVSNVE7OTO0", "Overall": "4.0", "Content": "Excelente Envio rapido tal cual lo queria en el momento de la compra, recomendado para todos los que quieran esto", "Date": "January 2, 2013"}, {"Title": "very good", "Author": "Laura Acosta", "ReviewID": "R251S8E9CT830Z", "Overall": "5.0", "Content": "Very good price, It arrived on time, in very good conditions, well packaged, excellent quality, I like it very much", "Date": "December 27, 2012"}, {"Title": "Great buy", "Author": "shadallen", "ReviewID": "R18G03QT9KQS9P", "Overall": "5.0", "Content": "It work great, I was very skeptic about the phone before buying it but it totally exceeded my expectations. Good phone for its price.", "Date": "December 21, 2012"}, {"Title": "Excellent Overall", "Author": "Omoruyi", "ReviewID": "RKQYYF6I0DS8A", "Overall": "4.0", "Content": "This was the first time I am buying a used phone on Amazon. I was impressed by the overall quality of the product I received from riskandreward69. I will not hesitate to make another purchase from him. Kudos!", "Date": "December 23, 2011"}, {"Title": "excelente", "Author": "akkend", "ReviewID": "R2SQDTFYX1S0N", "Overall": "5.0", "Content": "Muy bueno el producto todo salio bien saludos desde venezuela feliz navidad muchas gracias lo empacaron muy bien feliz año nuevo 2012", "Date": "December 19, 2011"}, {"Title": "purchased produto condition", "Author": "wulfredo gomez", "ReviewID": "R30XXABHJJGV1Y", "Overall": "1.0", "Content": "good night the phone I received does not meet expectations and did not bring the camera and possessed a characteristic indicates that a 3.2 MP camera. I hope your answer to this ...", "Date": "December 20, 2011"}, {"Title": "gracias", "Author": "guillermo vegas", "ReviewID": "R3748F4T4BA4VX", "Overall": "5.0", "Content": "excelente, mejor imposible los recomiendo a mis amigos para que compren artículos muchas gracias y mucho éxito mejor imposible saludos", "Date": "December 28, 2012"}, {"Title": "Gracias", "Author": "Maria", "ReviewID": "R33974DGDYHBKF", "Overall": "5.0", "Content": "Excelente atención y calidad, un vendedor atento y servicial que le gusta interactuar con el cliente, asesorar y garantizar el producto.", "Date": "December 24, 2011"}, {"Title": "disappointed", "Author": "erick ortiz", "ReviewID": "R3BDQ7D18R096U", "Overall": "2.0", "Content": "the phone does not work load pin and software is Rotom I am disappointed and I want, and refilled what you spend on repair in my country", "Date": "November 16, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Other key features include video capture, 3.5mm audio jack, memory card slot, push email, QWERTY keyboard, Bluetooth, and GPS navigation.", "Name": "BlackBerry Tour 9630 Verizon Phone no contract + Unlocked GSM Phone with 3.2MP Camera, GPS and Media Player", "ImgURL": "http://ecx.images-amazon.com/images/I/51n6ZjrxO6L._SY300_.jpg", "ProductID": "B005FMTIGU"}}