{"Reviews": [{"Title": "ok but slow", "Author": "jrhcamaro", "ReviewID": "R32RZ0470NNXA6", "Overall": "3.0", "Content": "ok phone very slow and the ok button dose not work all the time. ok phone for texting and calling.", "Date": "November 27, 2012"}, {"Title": "Great for a preTeenie", "Author": "Antoinette", "ReviewID": "R1BN9PPY9GX6KZ", "Overall": "4.0", "Content": "I bought this phone for my 10 year old daughter for Christmas 2012.  This phone works great without any issues.  Its small enough for her small hand bag and just right for a preteenie.", "Date": "May 27, 2013"}, {"Title": "ENV2", "Author": "Jennifer Holt", "ReviewID": "R29OB5O9325689", "Overall": "5.0", "Content": "The phone had some wear and tear, but I already knew about it. The phone works great and it didn't break the bank to receive it.", "Date": "April 19, 2013"}, {"Title": "Great Condition!", "Author": "Tera Gray", "ReviewID": "R1E6U32GBO3B5S", "Overall": "5.0", "Content": "Looks better than it said it would, works perfectly! Just like the first one I had. Great deal!! Will recommend to others for sure! Going to buy a second for boyfriend.", "Date": "February 27, 2013"}, {"Title": "Works excellent- minor scratches and paint chipped", "Author": "Lenora", "ReviewID": "R20S02P3EIW5CH", "Overall": "4.0", "Content": "It works like a brand new phone would. There are some minor scratches and paint chipped off. But I am the type of person who doesn't care about that and just wants a cheap phone that will work. I love the keypad and everything works amazingly. Love it.", "Date": "February 5, 2013"}, {"Title": "As described, works fine", "Author": "Sweeny Grullon", "ReviewID": "R2YZVT7CDLJ97Q", "Overall": "4.0", "Content": "When it arrived it was as describe minor scratches but that was expected and nothing that makes the phone look bad.  The only reason it got 4 stars and not 5 was because the 1st 3 days after it arrived it was not working, called verizon, they reset everything I restarted the phone and it's been working for 2 weeks with no issues.", "Date": "January 21, 2013"}], "ProductInfo": {"Price": "$79.95", "Features": "Come with battery and wall charger\nNo contract required\n30 days warranty", "Name": "ENV2 VX9100 MAROON VERIZON CDMA NO CONTRACT", "ImgURL": "http://ecx.images-amazon.com/images/I/41-HHb263WL._SY300_.jpg", "ProductID": "B005I50YCG"}}