{"Reviews": [{"Title": "Ok phone", "Author": "Pedro Ceriotti", "ReviewID": "R1HVTCHINSWXUK", "Overall": "3.0", "Content": "This phone is good overall. It lets you do every thing I would expect from a smartphone at a low price. However, you should remember this is an old phone and it's not even supported anymore by Sony Ericsson. It comes with the latest Android version supported for this: 2.1. What bothers me the most about that is that you need Android 2.3 or more to be able to install apps in the microSD card, and the internal storage is very limited in this phone. In the specs I've seen it says it supports 16 GB microSD cards, but I'm using it with a 32 GB class 10 card without a problem.Physically the phone is compact and sturdy. A friend of my even was thrown into a pool with this phone in his pocket and as soon as the phone dried it started working again. Another friend didn't have such luck with his Samsung SII. Two thing I don't like about the design is that you cannot remove the battery and the cap for the USB cable, which gets impossible to remove.", "Date": "September 6, 2012"}, {"Title": "sony ericsson x10 mini", "Author": "andrea", "ReviewID": "R1AUVL13M1KGKO", "Overall": "3.0", "Content": "This phone has no slide out keyboard. The wrong pic is being displayed with this phone. Other than than its not a bad phone has a lot of features for such a compact phone.", "Date": "August 17, 2012"}, {"Title": "Great phone!", "Author": "Abel", "ReviewID": "R2FBMYUMQ880E3", "Overall": "5.0", "Content": "Love the phone! Its a bite size smart phone. Light, compact, unlocked, and very handy.Some cons are.. the battery and it is limited memory other than that its a great phone but it does take a micro sd.", "Date": "April 30, 2013"}, {"Title": "Good!", "Author": "Javier", "ReviewID": "R2K0QV0KU3OXGN", "Overall": "3.0", "Content": "The phone is good, give it 5 stars if not for the charger only lasted two days and then was damaged, also never served usb cable. This reflects poor quality control of Sony Ericsson.I would not recommend buying it, aunqe for money is something right. Recommend spending a little more and buy a Nokia c6-01", "Date": "January 6, 2013"}, {"Title": "Just perfect", "Author": "Jodaviro", "ReviewID": "R1FIATBJUICUSR", "Overall": "5.0", "Content": "this phone is Just perfect, cheap, and it does everething that an expensive one does. i bought it 5 moths ago i recomend to install cyanogenmod on it", "Date": "February 23, 2012"}, {"Title": "grand", "Author": "Great product", "ReviewID": "R2ARWGEU8UN3XU", "Overall": "5.0", "Content": "is very compact and easy to handle, it is striking that in a device so small it can fit so many things ....It really is great", "Date": "December 4, 2011"}, {"Title": "Great product", "Author": "Dr. Askari", "ReviewID": "R3RLCEB0AIIT2D", "Overall": "4.0", "Content": "The phone was just as I had HOPEDit would be.  It had been my desire to have a very small light weght smart phone and it delivered", "Date": "May 25, 2013"}, {"Title": "Really GREAT Phone!!", "Author": "David Rosenberg", "ReviewID": "R5KG8KBOKE8BG", "Overall": "5.0", "Content": "Phone is everything I expected it to be and MORE!  Only drawback is battery is not replaceable, so I have no idea how long it will last.  Chances are by the time it dies, technology will have changed so it will be time to get a new phone regardless.", "Date": "January 22, 2013"}, {"Title": "Sony x10 Mini", "Author": "Kkvasu", "ReviewID": "R3J2G0C5EGUE6P", "Overall": "3.0", "Content": "I bought this phone just over a month ago, not happy with the phone sent it back and the seller had no issues. The reception is not good dropped a few phone calls, very hard to type SMS.Not the best phone in the market for the price.", "Date": "May 30, 2012"}, {"Title": "Takes sometime to get the hang of this phone", "Author": "Mr. Mike", "ReviewID": "R1N9E61RA3IZ90", "Overall": "5.0", "Content": "A little different but a good product.  Make sure you clean your sim card before you install it..........may not read the card", "Date": "April 8, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0050C3O88"}}