{"Reviews": [{"Title": "orange blackberry curve 8330 phone for sprint", "Author": "M. Monaghan", "ReviewID": "R11ZRSGATYYNE3", "Overall": "5.0", "Content": "A great cell phone! Arrived ahead of schedule, my granddaughter loves her new phone!!  I will continue to order from this company!!Thank-you!, Mary M.", "Date": "October 25, 2011"}, {"Title": "Great replacement phone for kids who break phones!", "Author": "Phillip Webb Jr", "ReviewID": "R2D77KSV6W755A", "Overall": "5.0", "Content": "If you are sick of being required to sign ANOTHER 2 year agreement with sprint everytime your kid breaks a phone,  this is a great option.  The local sprint store charged a flat $16 bucks to program the phone without an additional contract.  Maintain your ability to switch phone companies when you want...no contract required!", "Date": "January 15, 2012"}, {"Title": "I hate this phone!!", "Author": "Barbara L Yelekli", "ReviewID": "R3KZLS5EP8QHXO", "Overall": "1.0", "Content": "This phone is one of the worst phones I've ever owned! The trackball sticks, it unlocks itself and dials people in my contact list whenever it feels like it, while its in my purse. It takes a year and a day to connect on calls, and the internet, forget it. Its not even worth having the internet for this phone. The screen is so tiny, but then it takes a good 5 minutes to display the page, you click something, and then you wait another 5 minutes for it to show THAT page. I hate this so much. I DO NOT RECOMMEND THIS PHONE. I don't recommend sprint at all honestly.", "Date": "December 16, 2011"}, {"Title": "Standard Black Berry. Lags sometimes on speed with apps.", "Author": "John", "ReviewID": "R1S7VNQ7GK8N68", "Overall": "3.0", "Content": "This is a good phone for calls, and texting. It can be really slow sometimes when opening apps and is def an old model but for the cheap buck if ur phone breaks why not.", "Date": "December 4, 2011"}, {"Title": "Great phone at its low price.", "Author": "Kirk", "ReviewID": "R1AI35X800Q6MQ", "Overall": "5.0", "Content": "I ordered two phones three months ago to add to my family plan for Sprint. They works great. At this low price, I can not complain.", "Date": "February 24, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0055X1LDW"}}