{"Reviews": [{"Title": "Get it while you can!", "Author": "Carl \"carldc\"", "ReviewID": "RJ692Z40FQ9JZ", "Overall": "5.0", "Content": "I've been using webOS phones just about from their start. I got a Sprint Palm Pre in October of 2009. I recently got the HP Pre 3 and have no regrets. This is what Palm SHOULD have done in the first place. Sleek, black minimalist \"pebble\" design like the original (only larger) -- no buttons on the face, just the gesture area. Solid feel (MUCH better than the kind of \"plasticky\" feel of the original Pre) with a high resolution screen (480x800).Brought the Pre 3 to the AT&T; store nearby and they activated it and transferred my old Sprint number in literally just a few minutes. No hassles at all.Don't let anyone say otherwise...webOS is the best mobile OS out there. TRULY multitasking (not just music-in-the-background, like Apple). And the Palm (now HP webOS) Profile, which instantly populated my new phone with all my contacts, memos, email accounts, AND APPS (WITH their data in many cases!) was \"cloud computing\" LONG before anyone called it that! And by the way, there are THOUSANDS of apps. It IS true that many are not compatible with the Pre 3 (and some are only partly compatible), but the biggies are all there. I DO miss Sprint TV, but that's AT&T;'s fault, not Palm's or HP's.\"One more thing...\" (actually two things) 4G and HD video (plus editing).", "Date": "November 1, 2011"}, {"Title": "Palm Pre 3: A delighting experience.", "Author": "Pablo Saborio chacon", "ReviewID": "R32730MMZYAH7G", "Overall": "5.0", "Content": "In the last month I bought a Palm Pre 3. My previous phone was an Iphone.Now I am really surprised with the flexibility, friendly interface and speed of the Pam Pre 3.Sadly, is  uncomprehensible to me, how HP took the decision of suspend the production of this amazing phones series.Consulting in WebosNations site, there are accesories for the phone and software will continue to produce updates in the open source modality.", "Date": "January 9, 2012"}, {"Title": "long live webOS  ...maybe :)", "Author": "sportcross99", "ReviewID": "R21WT01ERBZWWS", "Overall": "5.0", "Content": "If after the apple / android assault, you're still here, reading this, using webOS, well then long live webOS. Maybe. Us few remaining webOS users know why webOS is superior, so no use repeating.as for Pre 3 - finally, but way too late and some would say too little ... For my purposes, the Pre 3 is hardware which allows the fluidity of webOS to shine. Much smoother and more capable than my Pre Minus could ever dream of...or my Pixi or Pre Plus; numerous obvious advantages over the Veer, and even more stability than the Pre 2 as well. Not to mention sexier hardware.Bad marketing decisions by Palm...not enough cash...lackluster, plasticky hardware...weak-willed, risk-averse corporate failure at HP...Leo Apotheker's asinine incompetence and complete lack of understanding of mobile and hardware in general...bad mojo...hmmm it's all the demise of Palm.In any case I love my Pre 3.", "Date": "July 16, 2012"}, {"Title": "Exceeded My Expectations!", "Author": "Blueberry Hill", "ReviewID": "RRN6FEWE9X6GG", "Overall": "5.0", "Content": "I wanted one before they were all gone. I've been using a Pre 2 for a while and been really satisfied with WebOS, it's intuitive and easy to navigate, and I like the slide-out keyboard much better than any on-screen virtual keyboard, and the keyboard does not consume screen space, but I wanted the larger screen of the Pre 3. It is much better than that, though. The faster processor is noticeable, it connects at HPSA+ and that is blazing fast, and the front camera for Skype works well on WiFi.iOS and Android are just now catching up with ease of use and reliability that compares to WebOS. You will be spoiled!", "Date": "January 21, 2013"}, {"Title": "HP pre 3 great phone", "Author": "Roland Ayala Cain", "ReviewID": "R10CJ2SORUS1M5", "Overall": "5.0", "Content": "The Best Phone ever. Skype work great and 4g is fast it need more app but is  still a great phone to use soon open source mean more app.watch out  ios 5 and android", "Date": "December 31, 2011"}, {"Title": "Palm Pre3", "Author": "Chen Jui Chung", "ReviewID": "RO3RKKLGG6RDO", "Overall": "5.0", "Content": "This is really a very nice phone.  Speed is fast.  The interface is user-fridenly.  I love it very much.  Just don't understand why HP decided to stop it.", "Date": "December 25, 2011"}, {"Title": "Excellent !!", "Author": "simpleq1", "ReviewID": "R2DPN8ECPZV87Z", "Overall": "5.0", "Content": "Very HAPPY... Awesome phone... and webOS rocks... Loving it...Hardware is solid.. Camera takes very nice picture....multitasking.. skype integration all in all very good purchase", "Date": "November 2, 2011"}, {"Title": "Finally a Pre 3 in the US", "Author": "Harry Lynn \"Technodad\"", "ReviewID": "RWA10R9NZKLFO", "Overall": "5.0", "Content": "I've been a fan and user of Palm/HP WebOS devices since the first Palm Pilot and continue to use the HP Touchpad.  I was very disappointed when HP announced the Pre 3 and then pulled it off the market in the US just after releasing it in Europe.  I provide IT support for my friends who use iPhones and Android phones.  In my opinion, WebOS is still the best OS ever made for touch screen devices.  Switching between running apps could not be simpler and charging the device on the magnetic Touchstone chargers in the office and in the car keep the phone handy and displaying notifications while sitting at an ideal angle for viewing.  Touch to share between the phone and Touchpad is one of the coolest features around and WebOS was the first to implement it.  There are still plenty of useful apps available and the automatic cloud backup makes moving to another WebOS device super easy and data is always backed up.  I especially appreciate the slide down physical keyboard which is more than adequately sized and easy for fat fingers to find.  I sincerely hope HP or some other licensee will keep WebOS moving forward and finally get the recognition it deserves.  My wife and I both use the Pre 3.  The onboard rear camera with flash works great and overall functioning is quick and simple to use.  Skype is built-in and works great with the front camera.  Notifications are displayed effectively and provide one-touch access to integrated messaging from all social media sources.  Screen resolution and readability is excellent.  Gestures to switch apps and delete items by sliding off screen are very intuitive and well designed.  Integrated email, calendar, and messaging apps are easy to set up and use with all services and customizable views make it easy to view favorite folders and just the information desired.  Thanks to the supplier who made these available to US users finally.", "Date": "March 25, 2013"}, {"Title": "Miss it, Damn you HP!!", "Author": "Lexx", "ReviewID": "R2CEI66K7VRJSC", "Overall": "5.0", "Content": "Such a great product, damn you HP for not supporting this more! Well the hardware kinda sucked and can't compaire to a Samsung GS2, but the WebOS is the best OS I have ever used.", "Date": "January 18, 2013"}, {"Title": "Best Webos phone!", "Author": "JCBone", "ReviewID": "R387IJYRVNJF0N", "Overall": "5.0", "Content": "this is the phone that should have came out first after hp bought palm.great build quality, 1.4 ghz fast, nice 3.6 inch screen and best keyboard on a webos phone.get it while you can!", "Date": "January 2, 2012"}, {"Title": "Greatest phone i had", "Author": "Amazon Customer", "ReviewID": "RMF59BLNX5US7", "Overall": "5.0", "Content": "Well, i've used quite many phones - some i've owned like Nokia N8 or Apple phone. Some i've used 'caused i sell gadgets Samsung's galaxies HTC Mozart - and i've gotta try them out. This phone brought me more joy than all other phones before. i think that iphone was really a masterpiece when it came out, but now i see it as boring. The Windows 7 phone OS is much more intuitive than iOS - but WebOS brings much more fun! There couple of things that disturb me - is the rotation speed - it's quite slow - i don't have that issue with my Touchpad - and sometimes i have a problem answering the phone - it's not as bad as on ipohne but still exists. The battery live is par with other smarts - the built quality is great - i love the swype gestures for back and forward and for closing the apps - i tend to do the same gesture on other phones - it's so intuitive - does not work the for some reason :) Great value for the money!!! it's a masterpiece!", "Date": "November 16, 2011"}, {"Title": "WebOS IS AMAZING!  The phone is ok.", "Author": "Joe Kruse", "ReviewID": "R1EJM8RX50YNTM", "Overall": "4.0", "Content": "I bought this phone to take advantage of 4g data speeds that my Pre2 couldn't offer.  The operating system is beautiful and nearly flawless in execution, perfectly hitting the goldylocks zone between ease-of-use and power-user capability.  No mobile OS is as thoughtfully and intuitively designed.  Multi-tasking is still unparalleled in 2013 and going into Developer Mode and adding free patches, hacks, and apps is SUPER EASY, especially relative to similar processes on iOS or Android - anyone can learn to do it and be done in under 15 mins without fear of bricking!That being said, The Pre3 was a late-term abortion of HP's.  This results in much of the software being not quite optimized for the Pre3 screen; it looks ok though.  Further, the return to a more rounded shape as opposed to the Pre2 does not work well when trying to open the keyboard (fingers want to slip off the device when performing this routine activity).  The buttons also suffer as they are not flatly on the sides but resting in the rounded rear bevel.  This can make some presses almost as awkward.  Finally, the excellent rubberized case of the Pixi/Pre2 has been replaced with a much harder/smoother/slippery material.  This exacerbates the fingers slipping problem on keyboard opens and button presses.  I can no longer place the phone on the arm of my recliner (as I did with the Pre2) at home as the Pre3 wants to slide right off.Back to the good - 1) the screen is a nice size that stops short of making the phone feel like a bulky tablet that you hold up to your head.  If you hate these new monster phones, you'll love the Pre3's sizing choice.  2) Resolution is great!  The numbers (just comparable to iPhone4) do not do the Pre3's super-vivid display justice.  3) Camera does a great job and takes a very nice pic in or outdoors.  4) Build-quality is the highest of any WebOS device - I've used them all.  5) The physical keyboard borrows more directly from the awesome no-slip keys of the Pixi than the Pre2's harder keys.  With more room for the keyboard on this larger device, this keyboard is the best in the industry regardless of OS - truly a joy!I cannot recommend a phone with a semi-dead OS to the general public, BUT if you like being different than everybody else, enjoy customizing your device, are into developing your own apps, or own a TouchPad - this is a worthwhile purchase.  Switch to dev mode and begin with the hundreds of great patches and apps available from Homebrew.  Like developing apps?  Download Enyo and start making apps that can easily port to any mobile OS.  I also recommend this to ANYONE that has an HP TouchPad.  The two devices work great together, making each stronger than they were without each other.  I love my TouchPad paired with the Pre3!", "Date": "May 20, 2013"}, {"Title": "Great vintage phone.", "Author": "Oscar Romero-Ortega", "ReviewID": "R192RTUZI538AE", "Overall": "5.0", "Content": "It is as announced. It works fine even though it's OS hasn't been updated in more than two years. I am pleased.", "Date": "March 8, 2014"}, {"Title": "Unfortunate Bugs", "Author": "DanyH \"dht\"", "ReviewID": "R3BSS5X10DV588", "Overall": "3.0", "Content": "I have had the Pre, Pre Plus and now the Pre 3. OS is great, shape and form is great, and available apps are ok.there are two unfortunate bugs that I feel obligated to share.Mobile device losses voice and data (celular) signal randomly after receiving two or three text messages. The only way to make the Pre 3 to get back its signal is by restarting. Quite a hassle.About the Mojo WhatsApp; the chat service is disablling Mojo Whatsapp users because they do not want the service to be available in any WebOS device. The app is free and it works good; the problem is that you will get into trouble when trying to register your device with Whatsapp; and in some cases, you will get disconnected from the service.", "Date": "June 10, 2013"}, {"Title": "Still a good one", "Author": "mal_berto", "ReviewID": "ROF4RVKTW5HPU", "Overall": "5.0", "Content": "This device is amazing, I use it as my daily driver. Can't believe that webOS is still this good despite being an outdated OS. The phone is speedy and very stable. The thing I like most is the nice community behind webOS.", "Date": "April 1, 2013"}, {"Title": "The easiest smartphone", "Author": "XiMiX", "ReviewID": "R2XVKZQDQULYXF", "Overall": "5.0", "Content": "Boy, is this a nice phone. I also have iPhone and Android, too, but Palm Pre3 using webOS has the best user interface. Even though it is old and may technically be slower than the current devices, I can get things done faster on it. For example, finding a contact can be done within 3 or 4 keystrokes just by typing a few characters of a name. No need to even select an app first. And like Windows, you can run multiple apps simultaneously and switch between them easily. It is just intuitive.This phone has a Touchstone back, so if you buy the Touchstone Charging Dock (under $10 these days), it can be charged without plugging in any wire to the phone. The back cover is a bit more rounded than previous Pre models, so it does not grip as tight. I use Touchstone charging at home and in the car, and the looser grip means I had to move the dock to the console instead of mounting it vertically on the dash, otherwise the phone would slip off during rapid acceleration.", "Date": "March 22, 2013"}, {"Title": "I didn't think I could love another phone as much as my Pre Plus", "Author": "Lewis Rosenthal", "ReviewID": "RHYEZ8OCNNQCS", "Overall": "5.0", "Content": "Wow...The slightly larger size of the Pre3 over the Pre Plus really does make a difference in the viewability of the screen. The fidelity of the speaker is improved, and the overall responsiveness of the 1.4GHz Snapdragon CPU over the Plus' 500MHz OMAP 3430 (underclocked from 600MHz) is *immediately* apparent. I really enjoyed webOS 1.4.5, and while I did install PreWare and a good number of patches (though few apps) on my Plus, webOS 2.2.4 really is an amazing several steps forward.I've been on AT&T; all the while, so I can compare voice quality over the same carrier, and the Pre3 just *sounds* better. Bluetooth response (my car has BT) seems to be more consistent, as well.Overall, this is a great phone, and I am going to savor it, like a fine, T-bone steak, for as long as I possibly can, in the hope that LG - the new owner of webOS - will release devices for the platform and do with it what Palm probably *would* have, and what HP *failed* to do.If you are a current Pre owner, be it an original Pre, a Plus, or a Pre2 (or any of the cousins, Pixi, Veer), and you are considering moving to another platform, in spite of HP's withdrawal from the market, this device is an excellent choice to consider.", "Date": "March 10, 2013"}, {"Title": "a very nice phone", "Author": "zhang leyang", "ReviewID": "ROAOC1O4QA76X", "Overall": "5.0", "Content": "-it is AT&T; unlocked phone(no headphones)built quality is excellentcute wall charger-using normal sin card, so i can't use it until i replace my micro sim card worth the money i spent any way", "Date": "February 20, 2014"}, {"Title": "The Palm phone, finally...", "Author": "Brett Anthony", "ReviewID": "R2A89IKC2HGOUO", "Overall": "5.0", "Content": "If you are reading this, you know what a Palm phone is. I owned a Pre+ before, but this is what the Palm idea was really about all along. Unfortunately, it now says HP on the back, and THEY have mostly abandoned the idea anyway, so it's an orphan.Whatever. Support is still available, there's a fanatical community. I don't need a gazillion apps. I love the phone.It's a bit larger than the Pre+, and the screen is a LOT bigger, and glass (yes!). The keyboard is better, doesn't miss or double-type at all. I have large fingers, yet I am still faster and more accurate on the Pre3 than an iPhone5.Call qualiy is better and more consistent, and I no longer find I have cancelled the call in pulling it from my pocket. I don't know how they fixed that...This phone is noticeably faster than the Pre+, even with several apps open. It really DOES multi-task. If your iPhone buddies look at your phone with the usual \"What the hell is that?\" expression; just open a few apps and show how it spins through them and even links their content. Just type...", "Date": "March 1, 2013"}, {"Title": "Requires some tweaking and patching out-of-the-box", "Author": "A. Figueroa", "ReviewID": "R3L7ZX6BOHH6CM", "Overall": "5.0", "Content": "My phone arrived on 4/30, a new-in-the-box, never officially released, AT&T; and HP branded, 4G (not LTE 4G).  I'm very glad I finally got one of these.  However, I think this phone is only for those who are willing to do some non-automatic tweaking and patching to get everything working.  You'll find the App Catalog will not work because a mandatory App Catalog update that had to be installed before 7/19/2013 has not been installed yet.  The workaround is described in the HP Support Forums under Re: App Catalog not working? Missed the update? Try this!  The short version is to manually change the date to 7/19/2013, then install the App Catalog update.  After this succeeds, set the date/time back to automatic network time and time zone.  Also, because of a recent change in Google's servers, you can not sync (mail, calendar, contacts, etc) until a WebOS patch is installed.  Look for Google sync fix patch on WebOSNation.  I'm using the phone on PureTalkUSA, an AT&T; mvno.", "Date": "May 3, 2014"}, {"Title": "Breathing a sigh of relief - I needed a replacement Pre3 ...", "Author": "Dwight E. Cass", "ReviewID": "R2J0E9KWPG5NT5", "Overall": "5.0", "Content": "I am very hard on my mobile devices and my poor original Pre3 (bought during the HP employee firesale) was starting to show it's age - top left hand corner of the display border was cracked, slider was getting a bit loose.  I am so thankful that there are still Pre3s out in the wild that are available.I know - eventually I will have to say goodbye to my Pre3 ... my hope is that the homebrew community will have ported Open WebOS to a new hardware platform and I'll be able to continue using the best mobile operating system out there.  But time will tell.Meantime - work is still very much alive in webOS development including the porting of an Android Compatability Layer to allow android apps to run within webOS cards.  My Touchpads will shortly have this capability and I'm hoping that the port to the Pre3 will happen before the end of the year.", "Date": "June 26, 2013"}, {"Title": "Why HP WHY? You had the right idea.", "Author": "Jonathan C. Ross", "ReviewID": "RE1FD6BOSF6FK", "Overall": "5.0", "Content": "I love this phone. That's all their is to it. I loved my original Palm Pre, and then the Palm Pre Plus, and now this one. If you aren't all about speed, and want a phone that works, feels good in the hand, and has GREAT call quality consistently, then this one is it. I'll be keeping this baby for a while. One can only wish that HP didn't just abandon the whole OS and product line. The only thing I'd change if anything is to make the keys bigger, but I don't have any problems using it, but it took some getting used to.", "Date": "December 14, 2012"}, {"Title": "HP Palm Pre 3 Best Ever", "Author": "W. M. Reid", "ReviewID": "RKN5LHUW1OXJI", "Overall": "4.0", "Content": "This was an upgrade from the Palm Pre (1). Major improvements. Much faster processor, excellent keyboard with intelligent self correct (for typos) higher resolution screen excellent even on original Pre. Looks like better build.On negative side the Voice Dial programme really doesn't work but I can live wit that. Camera and video are adequate but not an item I am into much prefer to carry my LX7 around. In many ways the Pre series stands out as the best smart phone on the market for ease of use and overall design. WebOS is unquestionably the best operating system around.The vendor provided excellent service providing intelligent answers to my various queries before I took delivery.", "Date": "January 16, 2013"}, {"Title": "What a pity", "Author": "hdpei", "ReviewID": "R1B0Q5S0NPJ3M5", "Overall": "5.0", "Content": "Now I use palm centro,buy this phone for my wife.It's great.(certainly we have android machine as a standby)The great phone and the great OS.Brand new.AT&T; unlocked.seller: Tailwind International", "Date": "May 13, 2014"}, {"Title": "Beware! These Palm Pre 3's are NOT unblocked!!", "Author": "S. Paul Abbott \"Paul Rabbit\"", "ReviewID": "R2N11ISLDV6NQO", "Overall": "1.0", "Content": "Blatant false advertising going on here!!  And I'm twice experienced, so take double heed to what I'm saying. The two Palm Pre 3's I bought via Amazon were both labeled \"AT&T;\" in large letters in the back, and they were LOCKED!  I wasted days going back and  forth with a nice technician to unblock the first phone - to no avail - even having to download software to \"try\" to do so, and to no avail. The technician finally gave me an RMA #.  I thought \"surely Amazon would not promote such blatant false advertising, so I tried again. But alas, the same thing. Another AT&T; phone that is blocked. I'm sending it back too.Amazon, what in the world are you doing here - letting these distributors sell blocked phones and unblocked phones? And trying to \"clean-up\" the mess with nice IT staff? And in my case, unsuccessfully?I'm willing to pay for a unlocked phone so that I don't have to go through the hassle of \"maybe\" unlocking a locked phone! I don't need programs I don't know or trust on my computer to unlock them!!I really appreciate Amazon. This sale and these distributors are not worthy of its good reputation and integrity!", "Date": "April 17, 2014"}, {"Title": "Phone is all I ever wanted, just wish I could activate it", "Author": "Joel \"Cubs fan\"", "ReviewID": "R215NWVUZ85WM9", "Overall": "4.0", "Content": "Just got this phone this afternoon.  After roughly 7 hours, I am resetting the phone with AT&T;'s rom.  The phone says its unlocked, what phone needs to be locked now a days, but there is no way I can verify since I can't using the WiFi.  Phone is connected (thank you #*3386633# w/o sim), but access to the world is not seen after wireless sees both encrypted and non-encrypted APs.We shall see after this latest attempt if this phone is DOA.  But its WebOs, so most likely will keep till my iPhone is done.", "Date": "March 14, 2013"}, {"Title": "cool", "Author": "Enomichael", "ReviewID": "R36N1QOTR8RW8J", "Overall": "5.0", "Content": "nice but i have problems with the hotspot, which do not connect. and a poor camera performance. overall is okay", "Date": "February 17, 2013"}, {"Title": "You have to love Webos", "Author": "angela", "ReviewID": "R2MPXZ84CVA55F", "Overall": "5.0", "Content": "I have had a Pre 2 and Loved it but it was getting a little rickety with the slider and I had dropped it a few times so I felt it was time to upgrade. I tried a Nokia 700 but it just did not multi-task well. So I went with the Pre 3 and it was my best choose. When I turned on the device and signed into my webos account it synced my contacts, noted, alarms, and most of my apps. oh and this phone feels solid compared to my Pre 2.", "Date": "December 7, 2012"}, {"Title": "For our new Palm Pre2 we ordered Skinomi", "Author": "Jerry Ray", "ReviewID": "R3M2I9LHZNIJOZ", "Overall": "5.0", "Content": "The Skinomi isalmost indestructable and a great aid in gripping . I work outdoors and have dry hands. Then when you sell the phone it looks new. Order came quickly.", "Date": "March 18, 2014"}, {"Title": "HP3", "Author": "ohiorican", "ReviewID": "R32MCV7CXFMC76", "Overall": "3.0", "Content": "TOO MANY BUGS. UNRELIABLE. NO SUPPORT. NO BACKUP. PREWARE IS WHAT HAS KEPT IT ALIVE. LOSES SIGNAL AND WIFI IS UNPREDICTABLE. BUT I HAD READ ALL THIS AND STILL LOVE MY WEBOS.", "Date": "April 5, 2013"}, {"Title": "As HP phone it is perfect", "Author": "Juan Alberto Seleme", "ReviewID": "R138MDBV6ZOBP4", "Overall": "4.0", "Content": "But the problem is that it's unlocked but you can't upgrade or have access to the aplications if you don't have US telefone sim card", "Date": "March 22, 2013"}, {"Title": "Vendor poor communication with me !", "Author": "Gary", "ReviewID": "R3UL6VBYE2I878", "Overall": "4.0", "Content": "As the phone is not unlocked, but the vendor did not clearly indicate the unlocked code ...I may have overlooked. It minus one star here !", "Date": "March 16, 2012"}, {"Title": "couldnt get a app in my display", "Author": "rabi", "ReviewID": "R16L5E8CL2XVDU", "Overall": "4.0", "Content": "when i turn on the phone the phone ask for profile and when i put my email id than ask for internet apn and user name what shall i doHP 16GB Palm Pre 2 Factory Unlocked QWERTY Keyboard GSM Smart Phone with WebOS, Touchscreen, WiFi, GPS (Black)", "Date": "November 10, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Processor: 1.4GHz Qualcomm Snapdragon MSM8x55, Operating System: HP webOS;\nMemory: 512 MB of RAM; internal storage: 16GB; Display: 3.58 inch multitouch vivid screen, 480 x 800 pixels;\nConnectivity: Wi-Fi 802.11b/g/n, GSM / HSPA+, Bluetooth 2.1, microUSB; Battery: 1230 mAh;\nKeyboard: slide-out backlit QWERTY;", "Name": "HP Palm Pre 3 16GB Black Unlocked QWERTY Keyboard Smart Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41oaqiG4NML._SX300_.jpg", "ProductID": "B005SNNX1W"}}