{"Reviews": [{"Title": "Better than a normal phone", "Author": "Damion Gadal", "ReviewID": "RWKJ0SMHPZV8K", "Overall": "5.0", "Content": "I never really liked cell phones until I got an iPhone. To me, they were a painful necessity, that felt more like an electronic leash than a useful tool.This all changed when I got my iPhone 3G. Here was a tool, that had functional access to the internet, and email. In addition, there was every kind of app imaginable, from entertainment, weather, photography, social media, you name it.I found myself using my phone more and more, and not to make phone calls. In fact, being able to use this thing as a phone is just a bonus.I've been extremely happy with my iPhone, and am writing this review on the 3G as sort of a thank you. The iPhone has become an integral part of my life, just as owning a computer did.After owing this item for 3 happy years, it's time for me to upgrade. I will miss my 3G, but am sure that the iPhone 4S will more than fill the void.", "Date": "October 18, 2011"}, {"Title": "Not as described", "Author": "lvn2rn", "ReviewID": "R2TWA8U6C2OKH", "Overall": "2.0", "Content": "I did my feedback and it was erased; I guess they didn't like it. Oh well. I was just being honest. The phone was described as Locked to AT&T;, yet when we tried to add a data plan to it, we couldn't because the phone was JAILBROKEN. I contacted the seller, no response. Contacted Amazon, and I was told I had to send it back & wait for a replacement, which meant my daughter would be without a phone for almost 2 weeks. Not acceptable. Instead, I had to pay even more money to have someone local fix the phone. Horrible customer service! Buyers beware!", "Date": "September 27, 2012"}, {"Title": "I'ts very, VERY good for the price.", "Author": "Keines", "ReviewID": "R20OXDQCTYWQIQ", "Overall": "5.0", "Content": "Excelente price, the phone was in perfect condition, function perfectly, I save a lot of money by buying this phone.", "Date": "January 11, 2013"}, {"Title": "apple", "Author": "jimmy", "ReviewID": "RMBO7G2GG0Z6D", "Overall": "4.0", "Content": "The phone was OK. Working perfect, but it has dust inside the touch screen digitizer , so i thing it was raplaced. Also iphone box wasn't original , there was no serial and imei codes tiket..Shipping was fast!In conclusion the phone is Ok and seller is perfect.", "Date": "July 3, 2012"}], "ProductInfo": {"Price": "$299.95", "Features": "Apps: Maps, messages, calendar, photos, camera, YouTube, Safari, stocks, weather, voice memos, calculator, game center, newstand, compass, reminders videos", "Name": "iPhone 3GS 16GB Black No Contract (Locked to AT&T)", "ImgURL": "http://ecx.images-amazon.com/images/I/41JDIS28BmL._SX300_.jpg", "ProductID": "B005W1EGSE"}}