{"Reviews": [{"Title": "The honest truth...read before buying!!", "Author": "Jason", "ReviewID": "R3NZ8SNB4TETU8", "Overall": "2.0", "Content": "This phone works fine to make calls,add contacts,read emails,and send short texts.The phone freezes & even shuts off when loading pages from the web. Phone does not have video recording or watching videos.If you use the \"metromail\" app. to access email,you cant view pictures in the email.The apps are pre-set,you cant get more. Outgoing texts have a limit on # of characters you can send.To send long texts,have to use picture texting & not use picture or sound. Does not have a memory card at all.Cant send picture texts if the pictures are on the highest resolution.Ringer is NOT loud at all.All in all,theres more Cons than Pros.I dont recommend this phone if you use your phone for more than calling, scheduling,contacts,etc.", "Date": "April 6, 2012"}, {"Title": "eh...", "Author": "Seeker", "ReviewID": "R38YWM6VF3CH72", "Overall": "3.0", "Content": "Small. Buttons start to not work. Color starts fading. Doesn't include music. I don't reccommend this to people who want non smartphone phones", "Date": "June 9, 2013"}, {"Title": "You get far more than you pay for.", "Author": "iamthewizardking", "ReviewID": "R19XCIJ5XHVPU", "Overall": "4.0", "Content": "This phone is absolutely excellent, given its price tag. Hasn't once frozen up or restarted itself, battery life is ridiculously high, and it's pocket-sized, which is a plus!The only reason I give it 4 stars instead of 5 is that when talking to someone, the earpiece is a tad on the quiet side, but you can adjust your earpiece volume so it's not that big a deal.If you're expecting a smartphone, buy a smartphone. If not, then this phone is HIGHLY recommended.", "Date": "February 23, 2013"}, {"Title": "Personally this is my phone I'm trying to sell...(used 15.99)", "Author": "Verona", "ReviewID": "R1BVXG87ZECGB7", "Overall": "4.0", "Content": "Hello! This phone has served me well and has great free ringtones that you can download to it. Not to mention the affordable 40-50$ a month plan. The sound is great so I don't know what the other person was talking about. Originally its a 70$ phone. Funny thing is when my Boyfriend and I weren't an item, he had the same phone :P . Anyways I love it and its easy to use and great for children if they desperately need one. I gave this phone 4 stars simply because its not a touch screen but it gets the job done. Hope you enjoy it as much as I did!", "Date": "January 21, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0058FNUC2"}}