{"Reviews": [{"Title": "Nice starter smartphone", "Author": "Amber", "ReviewID": "RKVYC0V5CA89L", "Overall": "4.0", "Content": "I have had this phone for about a week, and it's a great phone. I will say it is hard getting used to the blackberry system. This is my first smartphone and it is great! You can watch youtube videos, download kindle books, shop, e-mail, and surf the web. I will suggest that you use get a wireless router if you don't already have one. This way when your at home you can turn your wifi on and do whatever you want on your phone without using your data.", "Date": "October 31, 2011"}, {"Title": "Unseuccessful purchase", "Author": "Amazon Customer", "ReviewID": "R2G80CCFXZTKE1", "Overall": "2.0", "Content": "The phone came in a reasonable amount of time but I could not get the phone activated.I had been without a phone for over a week and was in need of a cell phone. I tried to activate it through the instructions that came with it and was unsuccessful so I called verizon to activate it and neither way worked.", "Date": "June 16, 2012"}, {"Title": "Pink Stinks costomer service has to be", "Author": "douglas33112", "ReviewID": "R27WN5LXIRB9JU", "Overall": "1.0", "Content": "At first the keys were clear. after a couple of weeks, it was extreamly difficult to see the keypad. I have to find the proper angel to see the keys. Some letters capataize too quickly. When i contacted the seller, I was told that I couldnt rturn the phone, because I was 33 days, they only had a thirty day return window. so now I'm stuck with this unit and all the headacks.  I understand the 30 day rule and also believe that I was at fault for not makeing the issue . I also understand costomer satifaction, Three days, five days or fifteen . Without the costomer there is no Business. Reapete sales are what keeps a businessss. If I gave this review one stad", "Date": "May 9, 2012"}, {"Title": "Not So Great", "Author": "Maiya", "ReviewID": "R17FAKE6WVAS7D", "Overall": "2.0", "Content": "I was not very happy with my order.  The first phone that was sent to me had a loose case, which a couple of weeks later lead to the case breaking. And the clock would freeze, so the alarm clock wouldn't go off.  So I returned it for a new one, which they were great about... but the new one once again had a weird fitting case. The screen was kind of petruding up, therefore making the scrolling button embedded down in the phone, and hard to push. I'm hoping the phone can last long than the other one, but overall I am not impressed by the product considering the original was not great, and the second one was worse.  I thought I was buying a new phone, and these seem used or somehow adjusted.", "Date": "May 6, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005GMB4N4"}}