{"Reviews": [{"Title": "Worst Phone I've Ever Had.", "Author": "Zach Goldman", "ReviewID": "R3MTRIUKRRXGEK", "Overall": "1.0", "Content": "This phone is absolutely the worst phone I've ever had. DON'T WASTE YOUR MONEY ON IT. If I could, I would rate this -529384134 stars. Let me explain: it freezes literally every second. It freezes so much that most of the time I can't answer calls. Apps don't run very well on it, they generally run very laggy and it's hard to play them. When I go into the subway, then come back out, it says I have no service when I clearly do, and the only way to fix it is to restart the phone. The phone also takes like 10 minutes to turn on/off, which is annoying. I could go on and on, but the point is don't buy it. Period.", "Date": "August 12, 2012"}, {"Title": "Waste of money", "Author": "Sim", "ReviewID": "R1EZT7G83C484P", "Overall": "2.0", "Content": "In the 4 months i had this phone i had to get it reset 3 times. on top of that it decided it doesnt wanna charge any more. overall its a slow phone. ive had nokia brick phones last longer", "Date": "May 10, 2012"}, {"Title": "Absolute worst!", "Author": "Christ4yalife", "ReviewID": "RVCIKQ0GGT82D", "Overall": "1.0", "Content": "Phone was crap! If it wasn't just to use as a placeholder until my upgrade was ready I would've returned it. Phone was locked. The only time I could use any kind of app was when I was at home and on my wifi. Other than check my email from the phone while at home all I could do was make/receive calls. Even when I would get a voicemail I would have to call and enter my pin to listen to them. They wouldn't come to the phone. Never again!", "Date": "April 22, 2014"}, {"Title": "Samsung Transform", "Author": "Cristina Chavez", "ReviewID": "R2LWJUMIVD4CO5", "Overall": "2.0", "Content": "This phone would freeze a lot and would barely even work, it would turn on and off at times and the apps were really slow.", "Date": "April 17, 2014"}, {"Title": "Great Phone!!!", "Author": "leigh ann sepelyak", "ReviewID": "R2FUEQU7GD1X24", "Overall": "5.0", "Content": "Love this phone it does everything I need it to from the quality type of Chess Games to its great download speeds on apps, to the fast processing, etc... Nothing really bad that I can say about this phone! And as far as its seller, excellent service, speedy delivery, great customer service and product exactly as described, VERY HONEST SELLER!! Thank you, I was very pleased!!!", "Date": "April 3, 2014"}, {"Title": "sprint phone", "Author": "shelia martin", "ReviewID": "RGI6VA1WOP4YZ", "Overall": "1.0", "Content": "it not a good phone the screen constantly blacks out and  I loose calls and it powers down even with 100% battery power", "Date": "March 27, 2014"}, {"Title": "Waste of money", "Author": "LaRhonda Earnest", "ReviewID": "R2TV0F1SZS8OC4", "Overall": "2.0", "Content": "The phone never worked. I got a message that the battery was not connected even though there is only one way to put the battery in to get it to turn on. Since they sent me replacement batteries (which didn't help) I will give 2 stars.", "Date": "March 25, 2014"}, {"Title": "Not good", "Author": "SatinP74", "ReviewID": "RSYH64GQRO80", "Overall": "1.0", "Content": "This phone did not work as it said. I had to go and get a new one days after it arrived.  It came on and that was it. It did nothing. I was very upset about it but it didn't keep me from future ordering.", "Date": "March 10, 2014"}, {"Title": "Never again", "Author": "Trucker37042", "ReviewID": "R11LH5STRJIWP1", "Overall": "1.0", "Content": "Bought to replace my cell phone and was told could unlock. When I took it to sprint could not use", "Date": "March 5, 2014"}, {"Title": "Raggedly phone", "Author": "Kay Williams", "ReviewID": "R3BVRBOYZ259LZ", "Overall": "1.0", "Content": "Worst phone I have ever had with Boost. Had a Motorola and it worked fin. This phone drops calls, freezes, goes back in time to 1980. I would love to throw this phone on the cement and stomp it. All these overrated, high azz prices on cell phones. Totally ridiculous", "Date": "February 23, 2014"}, {"Title": "Overall Good Phone", "Author": "Chastity Auli", "ReviewID": "R18PUXBD4LWI1S", "Overall": "3.0", "Content": "It is a realtively good reliable phone. It isn't as fancy as some of the new phones. My only thing is the phone is sometimes slow.  The swipe feature for text isn't too acurate. Overall, the graphics are decent on the games and music is pretty clear. If your looking for a nice inexpensive phone for a pre teen this is perfect", "Date": "January 31, 2014"}, {"Title": "Not the smartest smart phone", "Author": "whokid", "ReviewID": "R2I8TV74HO1VWM", "Overall": "3.0", "Content": "I got this phone as a replacement for my Evo 3d because the transform was cheap and I couldn't be without a phone until time to upgrade. This phone is ok. Very slow. Instagram app doesn't work on the phone, play store says the version of the app isn't supported by the phone. The camera is pretty bad too. Like 3 megapixels, even with the flash pix come out dark and blurry. What's really annoying is the touch screen is often unresponsive, freezes A LOT LIKE 3X A DAY. also when the phone vibrates it makes a weird noise like opening a old rickety window or something. On a better note it does what I need, make call n can text on it when the screen isn't frozen. If your looking for a smartphone that is fast and like to use apps, stay away from this phone. It's more like a multimedia phone then a smart one. All apps run slow and crash on this phone. If u need a basic phone to tide u over until ur next upgrade, this will work just don't check your email too often or try to download anything from the play store. Mine was used so maybe some of the problems were because of the past user but I doubt it, phone looked new out of the box.", "Date": "January 17, 2014"}, {"Title": "This phone sucks so bad, I took the time to write a review.", "Author": "Ryan Hawks", "ReviewID": "R1PEV9TM63KNL4", "Overall": "1.0", "Content": "I should have believed the reviews. This phone really does suck. Right now it won't let me make any calls, or when it does, it takes 3+ minutes for it to connect start dialing. No apps will work. Total waste of money and a complete disappointment.", "Date": "December 7, 2013"}, {"Title": "i bought this to replace an sph-  m930", "Author": "Joan", "ReviewID": "R1DN1TJTUDHJBU", "Overall": "2.0", "Content": "disappointing, i bought this to replace an sph-  m930 and it ran so slowly that I couldn't  use apps my other phone had no trouble with don't bothee with this one...  use the m930 better", "Date": "August 31, 2013"}, {"Title": "love this phone", "Author": "Amazon Customer", "ReviewID": "R1O6SZMGZ7UO2J", "Overall": "5.0", "Content": "i bought this phone for my son and i bought myself the htc eve shift 4g and i wish i had just ordered this for myself also, it really is a good phone", "Date": "August 31, 2013"}, {"Title": "Transform didnt perform", "Author": "JR", "ReviewID": "R1E677ZD4KJG8Y", "Overall": "2.0", "Content": "We brought the phone as a temporary replacement for our 10 year old who cracked his screen to his photon.  My husband and I have galaxys and love them so we thought the transform would be great as well because Samsung makes it.  Hands down the transform has to be the worse \"smartphone\"on the market!  It has no internal memory, the internet is so slow it reminds me of dial up.  I returned this phone immediately and paid the $100 to replace our sons photon!!!", "Date": "August 22, 2013"}, {"Title": "WARNING: DON'T  BUY!", "Author": "KK", "ReviewID": "RAGKQBWVV1DHP", "Overall": "1.0", "Content": "Honestly, this is the worst investment that anyone could make. Do yourself a favor and buy yourself a device that would be worth your time and money. This phone lags, freezes, and the battery life sucks. I've owned this device for almost two years, and I have broken it almost three times because of its many defects. The phone overheats, and then is unable to charge, or doesn't even charge at all. It has a very small memory, and many apps aren't compatible with this device. Save yourself the time and frustration... Don't buy this device.", "Date": "July 23, 2013"}, {"Title": "Slower than expected", "Author": "Renee L. Watters \"renwatters\"", "ReviewID": "RS9U0ZKQ3CK6G", "Overall": "3.0", "Content": "This phone has great capabilities, but it performs slowly.  It locks up easily if user is impatient and pushes too many options, just like clicking too quickly with a mouse will do to a computer.", "Date": "July 13, 2013"}, {"Title": "This item SUCKS with a capital CRAP", "Author": "Renada Nedrick \"MsRenada\"", "ReviewID": "RQX44OCLJFH1M", "Overall": "1.0", "Content": "Now, I know the expression \"get what you pay for\" but when something is advertised to \"work fine\" I'm expecting it to work. Not even a month after I got it , the phone would shut off unexpectedly or after using the QWERTY board and is super slow. Frankly I didn't have the time to send it back. I ordered it as a cheap replacement for my 13 year old until he earns half of the phone he wants. but this was garbage.", "Date": "June 30, 2013"}, {"Title": "Bad purchase", "Author": "Danyel Smith", "ReviewID": "R3K1WRC49KJWXV", "Overall": "1.0", "Content": "When I went to turn phone on through Sprint was informed it was not a Sprint as stated.  Also phone was in very poor condition.", "Date": "June 11, 2013"}, {"Title": "pretty good.", "Author": "Corinne", "ReviewID": "RPH33DZ5DQ5OM", "Overall": "4.0", "Content": "Descent phone for the price, I'm pretty happy, this is my 2nd transform and its my preference for a cell phone, awesome keyboard, phone works good if too many apps r installed then really slows down phone. Wi fi works great, fast internet.", "Date": "April 17, 2013"}, {"Title": "mislead and dissapointed", "Author": "furious", "ReviewID": "RDU1IBL2JPEFH", "Overall": "1.0", "Content": "Just received a Samsung transform for sprint I ordered from wireless unlimited. When I went to connect this phone I purchased as a replacement phone l, sprint told me all the serial numbers on the phone was incompatible and not in their system. They told me someone either sold me a Bs phone with fake Dec ,hex, and meid numbers.. I attempted to contact this seller in request is my money back. Waiting till next business day for a response from them. I had faith in Amazon. But due to my experience ordering from wireless unlimited, I will not be purchasing anything thru Amazon or third party fraudulent companies. If no refund is issued, I will be reporting it to consumer affairs.", "Date": "April 8, 2013"}, {"Title": "problems", "Author": "Paula Aragon \"PAragon\"", "ReviewID": "R14ZMGKTMON0O3", "Overall": "1.0", "Content": "it keeps jumping in and out of service.  The first few days it was great, but not anymore.  Had to switch back to an old phone", "Date": "February 13, 2013"}, {"Title": "happy", "Author": "pastor young", "ReviewID": "R121H27BULZK3D", "Overall": "5.0", "Content": "Got it on time n one piece n it works great i give em five stars cause they're a gud company thanks again", "Date": "January 29, 2013"}, {"Title": "Really like it.", "Author": "Sharon whiteman", "ReviewID": "R1N9TTRB2QB8NB", "Overall": "4.0", "Content": "Bought this to replace a Samsung Seek (messaging phone with a slide keyboard similar to this but not an Android) and I just loved it. Solid performer, very durable and decent speed and power. I have since upgraded to a Galaxy S II but I still keep this guy charged and use it as a Pandora device off the wi-fi from my router. For an entry level Android phone I find it hard to believe it gets much better than this. Even with my SII I still find myself missing the keyboard on this phone!", "Date": "November 28, 2012"}, {"Title": "Samsung Transform Very Good Used Cell Phone", "Author": "Tiffany Mosley-shelton \"T Mo She\"", "ReviewID": "R2PTXVKL1O13L5", "Overall": "5.0", "Content": "The cell phone came in great condition, minor to no scratches, ESN was clean, was able to turn on with no problems. Great Android Smart phone for my 12 yr old.", "Date": "October 5, 2012"}, {"Title": "Terrible. Don't get it", "Author": "Harrison", "ReviewID": "R25F38M4CMDT9B", "Overall": "1.0", "Content": "I've had mine for almost 2 years and I can tell you this phone is AWFUL. Typically, Samsung can make good products but this is far from good. I'm surprised I haven't snapped it in half yet with how aggravating this phone is. When I first bought it from the Sprint store, the person told me this phone had no problems. All I can say is all I have had are problems. It lags, freezes a TON, can't play games, and it even has to think about thinking, screen gets stuck in wrong orientation, and can manage to make something easy really hard to do. I love Android, but I hate the phone. Good thing my upgrade is in a couple of months so I can get out of hell and get a Galaxy S III", "Date": "August 15, 2012"}, {"Title": "No problems!", "Author": "reviewme", "ReviewID": "R2KWQ4OKZTCAW1", "Overall": "5.0", "Content": "I have had this phone for 2 and a half years now. It was my first smart phone, and I was beyond pleased! Android is a great platform with so many different apps to choose from. The phone does take about a full minute to turn on, but it's not really a big deal because I never turn my phone off anyway. It's not the fastest phone in the world, but it's also how many years old now? The battery life is average for any smart phone nowadays.I had a really good experience with this phone. For the low prices it is selling for on here, I would totally buy it again.", "Date": "March 11, 2013"}, {"Title": "Good phone", "Author": "Chris Leaidicker", "ReviewID": "RLCW45VSYLHRN", "Overall": "4.0", "Content": "Good phone Apps force close too much. I don't know have anything else to say but had to type more to submit review.", "Date": "December 8, 2012"}, {"Title": "not worth it", "Author": "agent juicy", "ReviewID": "R3IGSA8BNH66FK", "Overall": "1.0", "Content": "from day one i have been having problems with my phone. the battery sucks. when i try to plug it in i get error messages like battery disconnected or battery temperature to hot. it always dies on me and when i do get it to charge, it says battery full within two minutes. the screen is always freezing. i missed alot of calls this way. i cant dowload alot of apps. i wish i didnt wait this long or else i would have returned it a long time ago. now im stuck with it. :(", "Date": "October 24, 2012"}, {"Title": "The Un-Smart Phone", "Author": "Chrystina85", "ReviewID": "R2IBI0XVJ9SH3R", "Overall": "1.0", "Content": "I've had this phone for 2 years. At first I thought it was amazing, fun, high tech, and quick. Touch screen is definitely appealing and makes things easier right? Over the time period I've had this phone, I had to get it *hard reset* at the phone store about 3 times. Often the phone will lag or freeze on me. And then I find myself having to remove the battery and re-insert it so the phone re-boots. Touch screen is of course very fun. But when I browse the web or select contacts I find that it will sometimes select an option that I did not intend to click. The Transform has a pretty decent camera and I like the share options to upload it to Facebook, send by email, or send picture messages. I called this my \"dumb\" phone though cause it got much slower and the touch features became ultra sensitive. I had a couple apps on it, maybe like 6, and the phone slowed down a LOT. Regular stuff like games, Facebook, ect. So, I removed all those apps and the speed didn't increase by much. What's the point of a smart phone like this if you can't play any games on it too? The start up from being powered off is extremely slow as well. I would press power on and have to wait for a few minutes till it booted up. It can lock in \"airplane mode\" now and then as well. When it's in airplane mode you can't make any calls. I've had this happen and even though I un-checked the airplane mode option, it still wouldn't accept it. This is a good phone for first-time smart phone owners, but if you need speed and higher quality, move on to better.", "Date": "October 18, 2012"}, {"Title": "bad quality, slow, terrible phone", "Author": "R. Meyers", "ReviewID": "R2EZ46U9EGWA7E", "Overall": "1.0", "Content": "This phone has been nothing but trouble since i got it, i have had it over a year now and it has steadily gotten worse, it freezes, lags, apps never work, and recently it doesnt like to send texts. sometimes it will restart itself and be stuck on the same little boot up screen and i have to keep restarting it for hours until it finally boots up, and even then sometimes it doesnt work. it puts itself in airplane mode and wont come off unless i restart, which can take up to an hour some days. the flash on my camera stopped working, it no longer vibrates, and when you delete a picture and take another one, the thumbnail shows up as the old picture. DO NOT BUY THIS PHONE. mine is slowly falling apart from the inside out. one thing i will say about it is that my screen has taken a lot of abuse and hasnt cracked or even scratched once.", "Date": "August 22, 2012"}, {"Title": "love this phone", "Author": "Amazon Customer \"jessynvanessa\"", "ReviewID": "ROA1MVLICE0X0", "Overall": "5.0", "Content": "just what i wanted a phone ,my kid can play on wifi download apps without a contract or sim card or lock.", "Date": "December 9, 2013"}, {"Title": "honorable", "Author": "Audriona", "ReviewID": "RK4UIEVLLZTA", "Overall": "1.0", "Content": "it was honorable.it worked for a few then I had so many problems with this phone.I am really unhappy with this phone.it was a waste of my money.", "Date": "October 17, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Large Touch Screen\nBluetooth 3.0\n3 megapixel camera\nWiFi\n800 mhz processor", "Name": "Sprint Samsung Transform SPH-M920 Android Smart Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/51EuJI7hDEL._SX300_.jpg", "ProductID": "B005DWI2GY"}}