{"Reviews": [{"Title": "Last Real Phone", "Author": "Andreas Lichtblau", "ReviewID": "R24R0XGGQXLG6G", "Overall": "5.0", "Content": "This will be my second Equinox, first one I probably used to death, would not charge anymore. Now I'll have a spare battery and other things. I opted to get this again, great pictures, lots of memory, I really like the clamshell form, won't mess the screen when in my pocket, or mis-dial a number.", "Date": "September 26, 2011"}, {"Title": "Great phone for text + calls!", "Author": "Trainer", "ReviewID": "R1O2C6T2LWWNVL", "Overall": "5.0", "Content": "I broke my previous phone and when I went back to TMobile they discontinued my Sony Ericsson Equinox phone! They tried to sell me other phones - LG, blackberry etc.  No need for all those apps. It doesn't fit my lifestyle. Just need text + calls. So when I saw this online, I had to order!Got it w/in 3 days!!! Fast shipping.", "Date": "July 29, 2011"}, {"Title": "GOOD PHONE", "Author": "russlady \"EK\"", "ReviewID": "R3F5PU05DKP48M", "Overall": "5.0", "Content": "Simple good phone u can trust. I had the same for more than 2 years-did not have any problems till I dropped it in an open position. Not very smartphone, but it is ok", "Date": "September 10, 2011"}, {"Title": "Excellent phone", "Author": "G. Ramirez \"cine-aficionado\"", "ReviewID": "R22B6ZPKTYUKRQ", "Overall": "5.0", "Content": "The phone arrived fast and in perfect condition.Chrged the battery, inserted the SIM card, and it was running in no time.After a month of use by my wife, it' s been giving good service and has not had any issues at all.", "Date": "October 14, 2012"}, {"Title": "Sonyericson cellphone", "Author": "Larry Smotrys", "ReviewID": "RL15YV6FSMA9A", "Overall": "5.0", "Content": "The cell phone works fine. It has a feww options that I like. The phone has a few problems with the phone cover.  The front of the  phone has the skin start to peel off.  They should be able to fix this problem. Other then this problem the phone works great and I like the color.", "Date": "September 3, 2012"}, {"Title": "Excellent", "Author": "Juan Requena \"JC\"", "ReviewID": "R18CBHQIZXLP0S", "Overall": "5.0", "Content": "Good product quality, light, confortable and the best of all the price, i would like to buy another to gift", "Date": "April 9, 2013"}, {"Title": "I Recommend", "Author": "Maggie Little", "ReviewID": "R31V8HNN5LZMAK", "Overall": "5.0", "Content": "I enjoyed this product works well didn't have a issueWith transferring my sim card and everything workedlike clock work and the ring tones are loud like i needas well as large numbers, i love it.", "Date": "February 19, 2013"}, {"Title": "Small screen", "Author": "meomy", "ReviewID": "R3P8VWZVSKY0XM", "Overall": "4.0", "Content": "I have been using this phone for nearly a week now, the screen is small, but it doesn't bother me much; the functions are nice, color is right; overall, I like it!", "Date": "November 8, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0057FRKAG"}}