{"Reviews": [{"Title": "LG Optimus 3D", "Author": "Sandeep", "ReviewID": "R3M8RHHBDTZCYS", "Overall": "5.0", "Content": "****Update Aug 2013.****Two years and going strong. No problems with hardware or phone software.This phone is just great.****Original review 2011.The LG Optimus 3D is a great device. The 3d is the main selling point of the phone. In a nutshell, its a powerful but typical android device with superb 3d capabilities.The 3d Images.The images captured with the device look stunning on the device itself..but viewing the images on a 55inch sony 3d tv( hx 800 i think...the one best buy sold with the ps3 as a special ) is not the best. 3D images only get 3 megapixel quality ( i think LG was a bit too much into the whole triple, tri,3 ,marketing of the device ) and i don't think its worth using the device to capture images for viewing on a large screen, however the device does show 3d without the use of glasses on its own screen so thats not too much of a deal breaker.The images look super great on the device and you will have to view them one person at a time ( to get the LG spot ).The 3d VideoThe video quality on this device is amazing!!!; both 3d and 2d video. Video quality also looks stunning on the big screen with the big glasses. I think some of the video you can capture with this device is far better than some blu ray 3d out there. The video is really outstanding. This is the best feature of the phone.The other 3d stuffTo those who have not seen it yet..not everything on the phone is 3d. The device looks like any other until you open the 3d stuff.Games and apps...this should really just be games. There are no 3d apps to talk about.The games are nice in 3d but lets hope to see better in the future.Youtube3d videos on youtube are a great way to keep you happy.This is the only 3d app really and its good..well any 3d video on the device is really good.The phone aspectWell its a phone..an android phone...with a lot of juice...but not in the battery.When 3d is running the battery is RUNNING.Buy or not to buyif you like 3d video this is a must buy!if you like 3d images on a 4.3 inch screen this is also a must buy.if you like to show off this is a must buy.overall the phone is an excellent buy...a great phone plus great 3d...and the 2d on the device is better than most others.", "Date": "August 18, 2011"}, {"Title": "Awesome 3D screen, Great speed and YouTube 3D", "Author": "jjRobotek", "ReviewID": "R1SWZ3NXMD9KE5", "Overall": "5.0", "Content": "The first 3D phone in the world and has finally popped up in the USA! The LG Thrill(Optimus 3D) is packing some serious power and a high quality 3D screen.This phone should appeal to anyone that likes 3D and video games. The glasses free 3D screen looks great in 2D and 3D. It is very similar in quality to the 3DS but larger and higher resolution.Compared to the HTC EVO 3D, the Thrill has the edge in the 3D and CPU department. Benchmark tests show the Thrill as a top performer, Everything runs fast and games are very smooth. The Thrill screen produces a good 3D image with plenty of depth and a decent viewing angle, just like the Nintendo 3DS. Good quality 3D video really pops on this screen.LG baked in some really nice 3D features and games that the competition is lacking. The LG \"3D Space\" app is a really cool 3D menu that nicely organizes all of the 3D content.Three Free 3D games (NOVA, Golf, Asphalt 6) and a 3D book are preloaded on the Thrill, along with a number of 3D movie trailers and clips. The Thrill supports more 3D games than the EVO 3D at this time with about a dozen available. The 3D games look great and have a slider that allows you to adjust the effect. Use the '3D Games' App to buy new Gameloft 3D games. Modern combat 2: Black Pegasus(FPS) and Shadow Guardian(uncharted clone) are very impressive.2D/3D Camera does a decent job but lacks a shutter button, I hope LG will allow the 3D button to work as camera shutter button in future update.Youtube 3D is the killer app for this device. Tons of free 3D is available on Youtube, Search 'YT3D' to view all 3D video. Check out the DuoDive channel for an eye popping underwater experience.Gingerbread update is coming in October, along with LG's 3D game converter which will add 3D support for about 40 more games!Bottom line: Better 3D experience than the competition. LG - Please make a glasses free tablet!cons: bulky, 1500mah battery(larger available), 512 Ram, 2.2Make Note: The International version I received had it's default language set as German, I switched to English after translating the first screen. The phone has no carrier branding on the device but it's from Vodafone. Have not activated it yet, using it in wifi mode until the new iPhone is revealed.Contract Price: This phone can be bought for under $100 w/2 year contract, and as low as $449 off contract.", "Date": "September 7, 2011"}, {"Title": "Will deal with you later today", "Author": "sami", "ReviewID": "R3AOET6TBO9MGM", "Overall": "1.0", "Content": "I bought new phoner but you gave me user phone Will deal with you later todayThe phone it is good but it is userWhy", "Date": "August 22, 2013"}, {"Title": "Some negative details", "Author": "Jorge A. Pedraza V", "ReviewID": "R1S34C0A0GZJK7", "Overall": "3.0", "Content": "it's okay. but it has details:1. Lifetime of battery is very regular (about 1 day by frequent use)2. smartphone unstable operation when connected to AC power.Greetings.", "Date": "April 19, 2013"}, {"Title": "LG Optimus 3D P920 * Versión Internacional *", "Author": "william guevara guevara", "ReviewID": "R33F68TO5RAPCG", "Overall": "5.0", "Content": "excelente celular lo recomiendo, 3d fascinante en fotos y videos, y el hd esta solo bueno, este esta de moda para quien quiere tener un super celu", "Date": "December 14, 2012"}, {"Title": "please respect your busenes", "Author": "tedy", "ReviewID": "R2NNTMV84YIMD8", "Overall": "3.0", "Content": "my order was \"LG optimus 3 D p920  international version\" but when i get this order it was broken seal and it looks not well packed, any way i got this order on time.", "Date": "July 27, 2012"}, {"Title": "Excelent Smart phone", "Author": "esfer", "ReviewID": "RBN64S3DG092V", "Overall": "5.0", "Content": "it's has been about one month since i got this Optimus 3D P920, let me tell you what i see........screen bigger than an iphone, display is excelent, sound very good, wireless works perfectly and the 3D space is so cool...the pictures 3D i take i can easily count more than 10 layers of depth, video 3D its like in the movies!!!!i have no lag or freezing, the only bad thing that i found it's the battery......but i'ts a smart phone you always are using it, i bougth an extended battery and problem solved(adds tickness)....It's a great phone i recommend it to those how like the 3D world!!!!UPDATE 25-July-2013I still have the phone, and still like it!! working 100% fine, i don't regreat this purshase....the only bad thing i found about this phone is the OS, LG left this Optimus P920 in OS 2.3 no ICS(4.0) or JB(4.1) oficial ,just rooted. Anyway this smartphone was very usefull to me for more than a year. If you want to buy this phone, go for it , now its not the best smartphone in the market but stil have one thing that others phones don't have...... ¡¡3D World!!", "Date": "September 1, 2012"}, {"Title": "over rated.", "Author": "Christopher C. Raines", "ReviewID": "R1EA47MQQKVOED", "Overall": "3.0", "Content": "i got this bc of the 3d. and well. its worse 3d than the 3ds. every other vertical line goes to one eye and the screen looks choppy only in 3d. and some reason the screen gets dimmer in 3d. i guess its bc of what i stated earlier. i use 3d maybe 5% of the time. and well the 2d everything else. other than the 3d its a great phone. its fast and rly i wish i nvr got this phone. but it takes great 2d pics. not 3d. its choppy like i said. batt life is rly good. im an owner for 2 months now. the only good thing about 3d is just to show it off. you will never rly use it taking pics or play games with it. the games in 3d look like crap. i play them in 2d bc its cleaner and much brighter.", "Date": "October 5, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005BPBUMQ"}}