{"Reviews": [{"Title": "BEAUTIFUL", "Author": "KORRICE", "ReviewID": "RHCBJ132HOVU", "Overall": "5.0", "Content": "this phone is so slim and sleek fits in ur hand perfect... when i first saw it i thought wow that screen would be difficult to type on but its actually great for my fingers but i prefer to flip it and u it side ways to type.. the colour is also nice the flash player works perfect and the upgrade is the best part cause more features come to live... i love my xperia ray", "Date": "February 28, 2012"}, {"Title": "Xperia is very handy", "Author": "Surya4u", "ReviewID": "R2BGLXJKJ3JZ2Z", "Overall": "4.0", "Content": "This is very nice phone and very handy. It is very slim and sleek perfectly fits in hand. with very stylish color.Very good touch response with latest gingerbread version.", "Date": "November 16, 2011"}, {"Title": "I've had it for a couple of days", "Author": "A. B", "ReviewID": "R3HKEQCS9O6UWD", "Overall": "5.0", "Content": "Love  this phone so far, it takes a little bit to respond when you tn it on but it responds normally to all actions after that. I've had it for a couple of days only so we will see how it goes :)", "Date": "December 2, 2013"}, {"Title": "Love it", "Author": "Tina", "ReviewID": "R3FSJ7UC0M3LZZ", "Overall": "5.0", "Content": "So basically got this phone, and can't stop playing with it.I like it, so I got the Xperia arc from this provider again.", "Date": "August 5, 2012"}, {"Title": "Best of all worlds.", "Author": "inj", "ReviewID": "RT1AW1NN75ZGK", "Overall": "5.0", "Content": "I love SE, and I miss them. I loved my old SE W595 more than the iphone 4 I had till now.SE speakers are especially great, the music lights up your room.", "Date": "May 30, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Sony ST18i Pink\nFactory Unlocked Mobile Phone", "Name": "SONY ERICSSON XPERIA RAY / ST18i (PINK) : UNLOCKED INTERNATIONAL GSM ANDRIOD PHONE", "ImgURL": "http://ecx.images-amazon.com/images/I/31TgZ44Y44L.jpg", "ProductID": "B005MKQ2RI"}}