{"Reviews": [{"Title": "cellphone", "Author": "BOO BOO", "ReviewID": "RLBE6JCXV5EPT", "Overall": "5.0", "Content": "Since i have never had much need for a cellphone, I chose one that was inexpensive with an inexpensive service plan and takes pictures.  I like it!", "Date": "October 26, 2011"}, {"Title": "Broke after 8 days", "Author": "PTD", "ReviewID": "R30C9SRC9222GU", "Overall": "1.0", "Content": "Got the phone on 2-13-12 was so-so for the first few days. then it didn't want to charge. VERY hard to get the plug in, charge half way then die after one short call. Then on the 8th day the whole thing(where you plug in charge) fell out. PHONE not worth two cents mush less the 64.99 i paid.Will not buy from here again or recommend to anyone. BAD review is all I can do, also spread by word of mouth.", "Date": "March 4, 2012"}, {"Title": "Great Service", "Author": "J. Sylvia \"quick shopper\"", "ReviewID": "R1Q14FLJTNQ3Q2", "Overall": "5.0", "Content": "The item arrived within the time specified and it was in great shape, exactly how it was described. The phone was wrapped in plenty of bubble wrap and I haven't had any problems with the phone functioning in the month and a half I have used it. I am very happy with the product and the service.", "Date": "January 7, 2012"}, {"Title": "bad charger", "Author": "pebbles", "ReviewID": "R2B364YLFAV0GK", "Overall": "3.0", "Content": "this phone is pretty good but the charger broke on me the 2 day I had the know it was made very cheep and I had to find a way to remove from the phone. I wish I know how to get a refund on the charger.", "Date": "November 30, 2011"}, {"Title": "awesome phone for a teen", "Author": "cathy marie cathy", "ReviewID": "ROJ8ASUM4W5G6", "Overall": "4.0", "Content": "Had this phone for my 15yr old took a beating and keep working.. He misses this phone due to his other one broke after dropping it one time", "Date": "December 25, 2013"}, {"Title": "Great replacement phone!", "Author": "Beth Ann", "ReviewID": "R2MN3PEYJ9Y6MI", "Overall": "4.0", "Content": "I needed a replacement phone for my Verizon account. After discovering how expensive new phones can be, I started searching Amazon. I don't do much on my phone outside of calling and the occasional text, so I didn't need anything fancy. I came across this phone and am so glad I purchased it! The sound quality is 100 times better than the free phone I had just received when I signed my contract and the pictures on the phone (I never take pictures off the phone) display beautifully.My only negatives involve the texting capability. The keyboard is set up a little bit awkwardly, but it is still definitely useable. It just takes some getting-used-to. Also, the menu function for texting is a little clunky and cumbersome. Its easy to figure out, just seems to have some extra steps for every text you send ...Overall, I am very pleased with this purchase and would purchase it again, if necessary.", "Date": "April 6, 2012"}, {"Title": "LG VX9900 Cell Phone", "Author": "Michael J. Slusser", "ReviewID": "R2D5MN1TGZZZO7", "Overall": "2.0", "Content": "The key board is too small & there was a duplicate of the #6 where 3 belongs. My wife's eyesight isn't what it once was, due to all the medication she takes for cancer", "Date": "March 5, 2012"}, {"Title": "great phone", "Author": "blah blah", "ReviewID": "R2DX3A107G2LZN", "Overall": "5.0", "Content": "its a great phone i hear so i think im getting it have fun with it my friends say now everyone wants my new phone rlly guys ahhhhhhh i got it and i love it", "Date": "February 25, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00515263I"}}