{"Reviews": [{"Title": "Apple iPhone 4S, Does it Live up to the Hype?", "Author": "The Gifted One", "ReviewID": "RJHYN034LR9JD", "Overall": "5.0", "Content": "I entered the smartphone world back in 2008 staring with the Apple iPhone 3G.  Coming over from my old Sprint flip-phone, the iPhone 3G was a major upgrade and blew my mind with how much it could do.  It was amazing that cell phones had advanced into a sort of mini-PC.Fast forward to the present-day and I have now used and experimented with various smartphones, different cellphone companies, and smartphones OS's (iOS, Android, Windows, etc).  I also run my own small cell phone shop and get to play with these devices on a daily basis.  Back in the iPhone 3G days, there were only a few smartphone options to choose from.  Today there are literally hundreds of devices across several carriers.  All with different functions and designs.  I'm going to cover how the iPhone 4S stacks up to the competition, what the competition is, what the 4S can do, and what improvements it makes over its predecessor, the iPhone 4.HARDWAREThe iPhone 4S is almost identical in hardware design to the iPhone 4.  It features the same rectangular shape with the flat gorilla glass back and front screen.  The front and rear camera are in the same position.  The only visible difference on the outside of the phone is that the volume controls are slightly moved on the 4S.  The real difference in the hardware is on the inside.  The iPhone 4S uses a dual-core \"A5\" processor.  This makes it significantly faster than the iPhone 4.  The processor is the raw power that apps need in order to operate fast and fluidly without slowdown or hiccups.  With basic use, users probably won't notice much difference from the iPhone 4's speed.  The extra power boost mainly shows its worth when playing some of the more high-end iOS games and apps.CAMERAIn addition to the new processor, the iPhone 4S has an improved 8 megapixel camera.  It also now has the ability to capture full 1080p HD Video.  Unless you're a professional photographer, you will be blown away with how great the 4S is at taking pictures.  It is on par with most of the dedicated point-and-shoot cameras that are currently on the market.  Images are clear, crisp, and very colorful.  I even sold my 10MP Canon point-and-shoot after using the 4S for a few weeks.  When comparing pictures taken with the iPhone 4 side by side to the 4S, the difference is like night and day.  As for the 1080P videos, they're also very beautiful.  Just like the photos, the videos rival dedicated point-and-shoot devices and look absolutely gorgeous on the iPhone's retina display screen.  The only drawback to these 1080p videos is that they can take up large amounts of memory.  So if you plan on shooting a large amount of video, you may need to consider getting the 32GB or 64GB iPhone 4S.SIGNAL RECEPTION AND DATA SPEEDSThe iPhone 4S has been expanded to include a 3rd US carrier Sprint.  This brings your total choices to Verizon, AT&T;, and Sprint.Signal reception and data speeds will vary by carrier and location, so I'll give you some basic information about what to expect on average.  Signal reception is greatly improved compared to the iPhone 4.  The antenna problem from the iPhone 4 has been removed and the 4S uses separate antennas for incoming and outgoing calls in order to increase overall reception. AT&T; is a GSM carrier while Sprint and Verizon are CDMA carriers.  Verizon has the overall largest and most expansive voice coverage of the three, closely followed by AT&T;, with Sprint in third.  The 4S Data speeds will largely vary by carrier and location.  Being a GSM carrier, AT&T; is the only iPhone carrier capable of using the 4S's improved HSPA+ data speeds.  AT&T; users will notice their iPhones showing \"4G\" in the top left corner rather than 3G.  Though this is faster than standard 3G, do not confuse it with the much faster 4G LTE network.  The iPhone 4S is not yet capable of using that network.  Verizon is second in 3G data speeds, with Sprint bringing up the rear.  Again, these are average speeds from across the nation.  Individual results may vary depending on your location.  It is also important to note that Sprint is the only carrier that still offers unlimited data.  This may be an important factor in choosing a carrier for some.BATTERY LIFEiPhone owners have come to expect excellent battery life from their devices.  Previous iPhones have ranked among the most impressive in terms of battery life compared to rival Android devices.  In the past each new iteration of the iPhone had better battery life than the previous device.  With the 4S however, the overall battery life is about the same as the iPhone 4.  Apple claims this is mainly because of the dual-core processor used by the 4S as well as the more demanding iOS 5 software that is included with the iPhone 4S.  Due to this, there were some widespread complaints about the iPhone 4S battery life initially.  Apple has since addressed the issue with their iOS 5.1 update.  The iPhone 4S now ranks among the top smartphones in overall battery life.  I can easily get through a full day on one full charge of average use.SOFTWAREUsually when comparing the iPhone to other phones, it comes down to the software.  There is a big ongoing debate among techies between the iPhone's operating system \"iOS\" and Google's \"Android\" operating system.  It's comparable to the famous PC vs Mac debate.  Rather than type a whole page comparing the two, I'll just cover a few basics.  The main difference between the two is choice.  Customize or not customize.  iOS is more fluid and crisp out of the box.  All iPhones/iPods/iPads use this standard OS.  Less powerful iOS devices are often able to move as fast or faster than more powerful Android counterparts.  However, major modifications and customizations of Apple's iOS are not possible.  The standard 4x4 row of icons is what you will get.  Android offers tons of customization options.  This is great for advanced tech users, but can be overwhelming to novice smartphone users or those not really interested in editing and customizing a lot to get the device to do what they need it to do.  I usually recommend iOS to customers new to smartphones due to its more simple and easy to use interface.  If you like customizing and making your the software on your phone look different from everyone else, I recommend an Android device.The other major software difference between iOS and Android is the Apps.  The Apple app store still has by far the most support and overall apps from developers.  Most developers create an app for the iPhone first and port it later on to Android, or sometimes not at all.  From personal experiences with both, I can say that many times the iPhone version of an app usually runs better or has more features.SIRI Personal AssistantUnless you've been under a rock for the past few months, you've heard of the iPhone 4S's SIRI personal assistant software.  Apple touts it as a feature that allows you to speak voice commands to your iPhone and SIRI will do whatever you ask it to do.  Well it can do some things, but not quite everything.  SIRI is great for finding places for you.  You can say simple things like \"I'm hungry\" and SIRI will open the Maps App and show you the location of all restaurants in the nearby area.  You can also do things like tell it to play a certain song or artist from the music stored on your iPhone or ask it the Weather forecast for any given day.  SIRI can also be pretty entertaining when asked random conversational questions.  Questions such as \"How old are you?\" will cause SIRI to respond \"Does this concern you?\", \"I didn't think so\".  Or saying silly things such as \"SIRI I love you\" will cause it to say \"I'll bet you say that to all your Apple products\".  Overall it's a pretty nice added feature, but not a major selling point at this time.  It's limitation is that it currently is only integrated with the standard apps that Apple provides on the iPhone.  Once it is integrated with more of the third-part apps, I can see it becoming a seriously useful feature.Overall I would definitely recommend the iPhone 4S.  From the sleek hardware design, the beautiful camera, and the very large Apple App store, it's my top phone at the moment.  The iPhone 4S has the battery life to last most people a full day and in terms of overall speed and ease of use, it is currently among the best available.  The only people who I would not recommend the 4S to are current iPhone 4 owners.  With all of the iPhone 4S's improvements, I don't feel like they're significant enough to spend more money to upgrade from your iPhone 4.  You will be better off waiting for whatever iPhone Apple releases later this year.  However if you're looking to purchase your first smartphone, tired of your old Blackberry or Android device, or just have an older iPhone 3GS or 3G, I would strongly recommend getting the iPhone 4S if possible.  Using a smartphone has never been easier.", "Date": "March 23, 2012"}, {"Title": "It is Locket AT&T;", "Author": "Judd", "ReviewID": "R2HJX2YX4G50XA", "Overall": "2.0", "Content": "I brought this phone in december, when i realized there might a confusion between locked to AT&T; or Factory Unlocked. I contacted the provider and they did say it is locked to AT&T;, at that time the phone was selling for $ 649. Despite I sent it with package unopened, they cut off $30.00 on the refund, I really disappointed. Please note I paid for both shippings (sent and returned).If you need a factory unlocked Iphone 4S, you bette not buy this one IT IS LOCKED TO AT&T.;", "Date": "January 20, 2012"}, {"Title": "The Truth about these locked phones", "Author": "A Gentleman", "ReviewID": "R3CWCTDR9Q0R6G", "Overall": "1.0", "Content": "Buying directly from Appleor an Apple retail store (NOT Best Buy or anywhere else) is the ONLY way to get an unlocked iphone, and even then, it will only work with at&t; or T-Mobile (GSM networks only).If you buy one from anywhere else, regardless of what you are told, you will be getting a phone that is locked to a single network, and there's nothing you can do to fix it. Verizon may work with you under certain terms, but that's if you're lucky.When they say \"unlocked,\" they mean \"partially unlocked\" so that you can use non-US (i.e., foreign) SIM cards in the phone if you travel. When you're in the US, you are locked to the network of the mobile service provider that sold you the phone.Go to the apple website to buy one contract free, and you will see this information provided at the bottom of the page.", "Date": "April 18, 2012"}, {"Title": "BUYER BEWARE", "Author": "Stephanie", "ReviewID": "R1I9GM2CN4X1U2", "Overall": "1.0", "Content": "I made several trips the AT&T; store to find out why my phone kept loosing connection immediately after activation. After further investigation, AT&T; informed me that the PHONE HAD BEEN REPORTED STOLEN, and provided me with written confirmation.  I reported the incident to AMAZON, they and seller were more concerned about me returning the phone. I received a full refund.  However, they were not concerned about the selling of stolen merchanise over the internet and across state lines. Ironically, the reason why I had purchased this phone in the first place was because someone had stolen my phone!", "Date": "October 23, 2013"}, {"Title": "NOT A NEW PHONE", "Author": "koz", "ReviewID": "R1G85B0DD4QZ6P", "Overall": "3.0", "Content": "BEWARE, THIS IS NOT A NEW PHONE AS ADVERTIZED BY SELLER, NOT IN ORIGINAL PACKAGE, MISSING USB ADAPTER. WHEN I WENT TO REGISTER WITH APPLE THEY TOLE ME TO CALL CUSTOMER SERVICE AND I WAS INFORMED THAT THIS PHONE WAS REGISTERED ON FEB 11, 2012. DO NOT BUY FROM THIS SELLER", "Date": "May 6, 2013"}, {"Title": "I feel cheated, and I want my money back.", "Author": "cristian cruz", "ReviewID": "RDLL30BVAV2Z8", "Overall": "1.0", "Content": "I'm from Ecuador and I bought an Apple iPhone 4S 16GB (Black) - AT&T;, I bought this because in Ecuador I can unlock AT&T;,  but the cellular operator couldn't unlock cell phone because is it registered under Bell Canada, and the seller description said the product under  AT&T; . I contacted  the seller and he said that he will help me to solve this problem, but he didnÂ't help me. I feel cheated, and I want my money back. I bought it at amazon because I thought that here was reliable people to sell products, but I have been disappointed. I want that someone can solve this problem.", "Date": "March 11, 2013"}, {"Title": "Phone was not unlocked!", "Author": "Jeremy Hogue", "ReviewID": "R33APHIXERM8Z3", "Overall": "1.0", "Content": "This phone was listed as an unlocked phone but upon receiving it I found it was locked and I am stationed in Afghanistan. This put me in a difficult sport with my job!", "Date": "May 25, 2013"}, {"Title": "This is the NOT the unlocked iphone 4s", "Author": "rawwell", "ReviewID": "R1SYD7IL9KNRO4", "Overall": "1.0", "Content": "The model sent was NOT MD237LL/A, and locked to AT&T.;Please take note, as there is some confusion.If you want an unlocked iphone, look for one that is explicitly described as such.", "Date": "January 28, 2012"}, {"Title": "The iPhone 4S: a smartphone and a whole lot more", "Author": "SophieK", "ReviewID": "R1SHR7F0Z7IPM2", "Overall": "5.0", "Content": "I finally made the transition to the Apple iPhone 4S after over two years of a few highs and countless lows with an old Motorola Droid (model A855), which now serves as a paper weight.  I'll make this short and sweet.What I love:1. The awesome camera, especially when paired with the Camera+ app, allows me to keep my bulky DSLR at home when I need a good, serviceable scenery shot for social media posts.2. How much nicer the apps are compared to those on the Android platform.  The iPhone apps run smoother and are much nicer to look at.3. The size is perfect.  It fits with ease in my hands as well as my pockets.  It feels natural when I hold it - probably explains why a klutz like me hasn't dropped it yet (knock on wood).4. Siri is a reliable personal assistant for very basic tasks.  I regularly ask her to set my alarm and she has yet to let me down.  No important dates/meetings missed yet!  I can't wait to see what else she can do.What could be better:1. The price could be lower.  I bought mine unsubsidized for $649+ through Virgin Mobile to avoid the ridiculous two-year commitment Verizon wanted from me.Overall, I have no regrets moving to the iPhone 4S, a beautiful, intuitive, well-designed mobile device destined to become a modern museum piece.", "Date": "September 30, 2012"}, {"Title": "I love this phone !", "Author": "Jenny", "ReviewID": "R1L87SAM3AFES6", "Overall": "4.0", "Content": "Awesome product! :) it works really well :D it was just a little too expensive but it was worth it :)", "Date": "June 7, 2012"}, {"Title": "false advertisement", "Author": "jesse", "ReviewID": "RMFH30QYKO2XI", "Overall": "2.0", "Content": "The ad was specifically for a iphone 4 with an AT&T; network and once i recieved it and tookit into  the store they discovered it was a verizon phone. I waited 2 weeks for this phone all just to seend it back.", "Date": "June 8, 2013"}, {"Title": "Phone was \"jail broken\" only worked 2 weeks", "Author": "Cindy Wine", "ReviewID": "R3BWY281MW4VZG", "Overall": "1.0", "Content": "This phone worked until it prompted my grandson to download IOS7 at which point it turned into an ipod.  He took it to the Apple store, the Verizon store and a local phone unlocking store.  They all said it was dead and could not be fixed.", "Date": "October 3, 2013"}, {"Title": "I love my iPhone.", "Author": "panda", "ReviewID": "R37N6QEYSKYU1W", "Overall": "5.0", "Content": "I was contemplating getting this phone for a while before I finally gave in. Best purchase ever. My 4S is my new sidekick and I have no idea how I dealt with my iPhone 3G for so long. I got this phone to use as a pay-as-you-go phone on AT&T; and it works flawlessly.", "Date": "June 14, 2012"}, {"Title": "Very Content", "Author": "Cutie 3.14", "ReviewID": "RPJPLXGYDYR2G", "Overall": "5.0", "Content": "Product worked great. Good condition. Arrived sooner than I expected. Ended up not wanting an iPhone and I sent it back, and they gave me a refund, no fuss. Would order from them again.", "Date": "September 9, 2012"}, {"Title": "Accessories Chargers serious quality problems, almost broken my iphone", "Author": "woody414", "ReviewID": "R8IDMAPDNUODT", "Overall": "2.0", "Content": "I bought the ATT 4S, used-good. It was locked, and the top of the screen has obvious scratches.  The key is included charger has obvious quality problems, the normal use less than a month, on a sudden short circuit while charging, a very pungent burning smell, apart and found that the structure and the original charger apparent not the same, the workmanship is very poor, poor quality of the cottage belonging product.  Fortunately, my iphone is not so damaged, but I still feel very angry, although it belongs to warehousedeals, but obviously not been carefully examined accessories. Hope you can select original accessories or branded products instead, at least ensure that the quality is no problem, I hope you can accept my opinions.", "Date": "June 15, 2013"}, {"Title": "So Dissatisfied", "Author": "winifred okoroafor", "ReviewID": "RZ41Y8DVSAKN0", "Overall": "1.0", "Content": "Seller didn't indicate that the lock button on this device is broken. I emailed him after I received the phone and I didn't get a reply back. I am very dissatisfied, especially because before receiving my order I spoke with the seller about the condition of the phone. He informed me that the phone was in \"very good\" condition, and when I asked if there was any issues with the phone, he indicated there wasn't. I'm hoping to go to a technician tomorrow in order to repair the lock button but if it cannot be repaired I plan on filing a suit or requesting that my money be refunded back. Seller seemed like a nice guy, but you can only tell so much over the internet.-Sincerely dissatisfied customer", "Date": "March 4, 2013"}, {"Title": "Condition good as new!!", "Author": "qdhuxp", "ReviewID": "R1W1U7ARJEUMDF", "Overall": "5.0", "Content": "Good as new!! Only a bit scratch on top left side. The screen is perfect, bright as a mirror!Like it very much! Worth for the price!", "Date": "November 28, 2012"}, {"Title": "Amazing Phone!  Even faster than my old iphone 4.  Love it.", "Author": "A. Fry", "ReviewID": "R2WQNUMB64G60J", "Overall": "5.0", "Content": "Amazing Phone!  Much faster than my old iphone 4.  Siri is useful sometimes, but other times it feels gimmicky.  Love it!", "Date": "March 26, 2012"}, {"Title": "Best Smartphone Made: Steve Jobs Did Incredible!", "Author": "COLORLOVER", "ReviewID": "RCA51M4QY396", "Overall": "5.0", "Content": "Well, I just got this phone and returned the Samsung Transform. It was super slow, and you can even look at my review. The iPhone is incredible! It has Siri, fast messaging (SMS), and it is lightning fast. I love how you can treat it as a phone and an iPod, because when I had an iPod Touch, I thought it would be a wonderful idea to have a phone that is like an iPod, and boom. Wonderful, once again.", "Date": "February 25, 2012"}, {"Title": "Fragile Intelligence", "Author": "redmondsODU", "ReviewID": "R2WNYO1VN0A8YB", "Overall": "4.0", "Content": "I purchased the iPhone 4S last November with my hard earned McDonald's paychecks. I was ecstatic to open the box of the most raved about smartphone of this generation. Not only is the iPhone a great phone, but it has become a status symbol of our time.After a year with the iPhone, I can still say I love it (which is unusual with cellphones I've had in the past, they're usually having a glitch of some kind after a year or less of use)! It has all of the wonders of a generic cell phone: text messaging (with the added fun of emoticons), calling (including FaceTime, exclusive to Apple products), calendar, alerts, and now social networking. When I first powered up my iPhone, I was surprised to find the \"Twitter\" app already installed, because apple is partnered with Twitter, their built-in app is AMAZING! The Apple app store is another bonus of having the iPhone. You can find any and every app from Apple's app store. I also love the simplicity of the iPhone, with one simple button on the face, a lock button on top, and volume buttons on the side, it's not too hard to figure out. I can go on forever about how amazing the iPhone is, because it hasn't let me down yet.Apple does, however, fail me in one aspect of the iPhone. The phone is made of glass. The fragility of the phone makes it like a prized possession that must be handled carefully, any wrong drop at the wrong angle can shatter your screen and break your heart in an instant. I know this personally because I've recently shattered my iPhone screen... I cried.Join Team iPhone, you won't regret it.", "Date": "October 2, 2012"}, {"Title": "Fashion Before Function", "Author": "Con Sumer", "ReviewID": "R4H3AFRG0XQKC", "Overall": "1.0", "Content": "I'm forced to use it for business and this isn't a Blackberry replacement.  It's slippery, it's fragile and tiny.  It's so....2008.  There isn't enough space or time for me to list why not to get on a bandwagon.", "Date": "December 20, 2013"}, {"Title": "NOT NEW OR UNLOCKED", "Author": "Laurie Schwenn", "ReviewID": "R350WJNK7XB7B7", "Overall": "1.0", "Content": "My phone was NOT new or unlocked. I brought the phone Apple, they did some research, opened up the phone and found that the phone was bought in 12/2012 and had water damage. I would never purchase anything from this seller again! I put a Grievance with my credit card company and was able to not get charged. in the mean time, I had to send the phone back on  my dime. very disappointed! Would not recommend!", "Date": "November 19, 2013"}, {"Title": "Came on time and works great!", "Author": "Peter Jahn", "ReviewID": "R18RUMIXYX1O10", "Overall": "5.0", "Content": "Bought this to tide me over until the new iPhone but it works so well I may just wait for the iPhone 6 to come out.", "Date": "September 23, 2013"}, {"Title": "Excellent service", "Author": "laura", "ReviewID": "R399K0TTBZJ88", "Overall": "5.0", "Content": "I'm very satisfied with the product since it's a great phone and I havent had any problem with it.  The service was excellent since the phone arrive earlier than expected in its sealed package exactly as it said in the product description. I strongly reccommend buying it!", "Date": "August 3, 2012"}, {"Title": "AMAZING", "Author": "theantster", "ReviewID": "R2P5PIO0CEHB6L", "Overall": "5.0", "Content": "I myself is a HUGE apple fan and when i purchased the 4S i was so excited. I ordered the product with overnight shipping and it came a day early it came in its box and it had no marks on it. it was the best phone ever i highly recommend it.", "Date": "July 24, 2012"}, {"Title": "FRAUD", "Author": "REVIEWS FROM PERU", "ReviewID": "RYIVH7BJBYBK7", "Overall": "1.0", "Content": "I BOUGHT THIS PHONE ON JULY 2013 UNDER A NEW CONDITIONS , FORM SELLER CELL LOUNGE INC.  AFTER 5 MONTHS IN USED THE BATTERY SHUT OFF.  I BOUGHT IT TO AN APPLE STORE TO FIND OUT THAT IT WAS NOT A NEW PHONE!!!!  THE PHONE WAS BOUGHT ON OC 2011, THE BACKPLATE AND PARTS WERE FAKE, AND THE BATTERY WAS WORN FOR BEING USED!!!!!!  FOR MORE THAN 2 YEARS.  APPLE DOES NOT WANT TO TOUCH IT OR MAKE CHANGES BECUASE IT IS NOT AN ORIGINAL PHONE FROM THEM!!!FIRST REACTION FROM BOTH SELLERS WAS TO TELL ME THAT THE PHONE WAS OUT OF WARRANTY. THEY DO NOT SEEM TO UNDERSTAND THAT IT IS NOT THE BATTERY I AM COMPLAINING ABOUT.  I HAVE BEEN RIPPED OFF COMPLETELY. THIS IS FRAUD. THEY HAVE SOLD ME SOMETHING ORIGINAL AND NEW PAID 500 DOLLARS AND 8 MONTHS LATER IT TURNS OUT THAT IT IS A FAKE AND USED PHONE . AND NO NONE IS RESPONSIBLE. CELL LOUNGE THE SELLER  OF COURSE DOES NOT WANT TO TAKE RESPONSIBILITY BECAUSE THEY CLAIM THAT THEY BOUGHT IT NEW AND HOLD IT FOR 2 YEARS BEFORE SELLING IT!!!!CURRENTLY I AM IN A FIGHT WITH THE SELLER WHO THINKS I AM STUPID AND SHOULD EAT UP THEIR SCAM!!  AND TAKE THEIR APOLOGIES  AND THROW AWAY THE PHONE AND BUY A NEW ONE.I HAVE CALLED 1000 TIME TO AMAZON CUSTOMER SERVICE, FILED A COMPLAINT, BUT GET NO ANSWER FROM THEM.HOPEFULLY WITH THIS REVIEW A HUMAN BEING WILL DECIDE TO CONTACT ME!I AM EXTREMELY DISAPPOINTED WITH AMAZON AND THEY WAY THIS IS BEING HANDLED.", "Date": "April 25, 2014"}, {"Title": "Great phone but fragile", "Author": "John Delsanto", "ReviewID": "R3T4YY9KBWSN0K", "Overall": "4.0", "Content": "This is a great phone, has all the features that you could hope for. When I get lost all I have to do is go to my Nav app and talk in the address and then it will quickly load and get me to where I have to be.  The one thing someone would have to be careful with is dropping it because the phone is all glass so I recommend if your getting a Iphone then invest in phone case, maybe a otterbox.", "Date": "April 5, 2013"}, {"Title": "Used iphone 4S", "Author": "Becky Darby", "ReviewID": "R2I82NQSIYVMKL", "Overall": "5.0", "Content": "I ordered the iPhone 4s from the Amazon warehouse, and I love it!  It arrived in great condition, not a visible scratch on it, and it was only rated \"good\" by amazon.  It works great, and I saved a lot of money by getting a used phone.  I don't have to have the absolute best of everything, I have a family to support.  Do yourself a favor and save a lot of money by going with a slightly used product.  It even has a 60 day warranty, so if something would happen in the next few weeks, I get my money back or a different phone.  Satisfied customer.", "Date": "February 26, 2014"}, {"Title": "I need your help", "Author": "Isabel C. Lopez V", "ReviewID": "RQZNYBM2UL938", "Overall": "5.0", "Content": "Please, I need help. The iPhone that I bought to you is to be used in Venezuela. I did realize that the phone has to be unlocked. This phone has not unlocked. In Venezuela I couldn't find somebody to help me with that. Can you please let me know if you can do something for me? I need to unlocked the iPhone. Pleaseee", "Date": "December 9, 2013"}, {"Title": "A killer device that's far from obsolete", "Author": "Tony L.", "ReviewID": "RXOWW1DV8ARHY", "Overall": "4.0", "Content": "I purchased my first iPhone 4s in February 2012. Now that you can get the iPhone 4 for free with a two-year contract, it's worth giving this little workhorse another look.Only two years ago, this phone had the fastest processor on any smart device. While the competition ( including three new iPhones from Apple) have better overall specs, the 4s is no slouch. Performance is still snappy even running Apple's latest version of iOS 7. Frame rates are consistently smooth when swiping between home pages and opening apps. And first party apps like Siri and Maps run without a hitch.Next to the competition, the screen on the 4s seems to get smaller everyday, but the quality of that screen, in terms of dots per inch and color reproduction, hasn't given up much ground. The same goes for the camera, which arguably produces better results than flagship phones such as the HTC One, and can still easily replace most point-and-shoot cameras.And for most people, the reason why they buy a phone is to make calls. To that end, the iPhone 4s does not disappoint. Calls are crisp. Simple, but often overlooked tasks, such as visual voicemail, or copy and paste between contacts, text messages, and dialer functions is taken for granted by iOS users, but still refreshing for Android users, where these features feel much more half-baked.The biggest and most obvious feature you'll miss out on with the 4s is the screen size. While it works great for basic tasks such as making calls, looking up directions, or playing music, it's not nearly as comfortable as a go-to device for browsing the web, reading books, or watching video.That said, the iPhone 4s is still a world class-device that shouldn't be overlooked. At just over two years old (and despite what marketers would have you believe), it does a fantastic job doing the things you need it to do, like taking calls, snapping pictures, and delivering on the promise to put the Internet in your pocket. What's more, you can get it for free, which makes a compelling case for which phone gives you the most bang for your buck.", "Date": "December 5, 2013"}, {"Title": "Great product for a great price.", "Author": "Yolanda M. Spearman", "ReviewID": "R3N8495MS1SHE6", "Overall": "5.0", "Content": "This was an excellent product in excellent condition for an excellent price.  I am very pleased with its performance.  Thank you for your accurate listing.", "Date": "November 3, 2013"}, {"Title": "questions", "Author": "FixieNation95", "ReviewID": "R5UMOO871L2SZ", "Overall": "5.0", "Content": "is it unlocked and does it come with the mophie charger piiec. and how do yu like jersey im frm cali", "Date": "October 3, 2013"}, {"Title": "iphone", "Author": "Andrew Blake", "ReviewID": "R1WW2AF6JPSE8Z", "Overall": "5.0", "Content": "was actually a white iphone, but still love it. Great phone and accurate description of what i would get. love it!", "Date": "June 16, 2013"}, {"Title": "LOVE THIS PHONE", "Author": "Asheline Tira", "ReviewID": "R11VLIB138PUTY", "Overall": "5.0", "Content": "Best phone ever and it work very good and fast I would continue to purchase to items like this all the time!!!", "Date": "April 3, 2013"}, {"Title": "It doesn't dissapoint.", "Author": "OBrian Bowen", "ReviewID": "R14KRAE23JX4RP", "Overall": "5.0", "Content": "I have owned iPhones in the past and they have all been wonderful. The 4s is no exception. I love it.", "Date": "March 17, 2013"}, {"Title": "Great service", "Author": "egkraft1s", "ReviewID": "R36R47I7QTZFMS", "Overall": "5.0", "Content": "Fast and reliable. Shipped quickly and the product was exactly as described by seller. works great and is in perfect condition. I have had no problems with the cell phone and my sim card slipped right in and worked! Highly recommend for someone looking for a great smartphone.", "Date": "July 17, 2012"}, {"Title": "beside of sum scratches i loved it", "Author": "octenna otelien", "ReviewID": "RG6E54PYIUL08", "Overall": "5.0", "Content": "i am looking forward to buy an other one for my wife,but shipper. still black no scrathes no dent 'perfect condittion.", "Date": "June 20, 2013"}, {"Title": "Best Phone I have ever Owned", "Author": "R. Milliken \"Rev Ralph\"", "ReviewID": "R38EZF6503PCW4", "Overall": "5.0", "Content": "This is the third smartphone I have owned, and the first one I have genuinely loved. From the first moment to now I love this phone. This is rare for me. The first smartphone I owned was the Palm Pixi, and it did not live up to the hype. It was fragile (not to say that the iPhone isn't, because by all means it is very fragile), came apart easily, and after less than 6 months, it was rendered almost unusable. When it came time for an update, I decided that even though my family would be taking the iPhone route, I was not an Apple Fanboy, and I would give Android a try. I got what was supposed to be the best smartphone \"in the world\", but ended up being a mistake, the Motorola Atrix. It worked well, there is no denying, but the screen was plasticky and almost couldn't be used without the constant turn off, and turn back on, to make sure that no random contact would get a text from me that would read: hfdhafjkadjkfaj;sdfjasdfjd  djfakldfjadjklfasd. Not to mention the battery life was not the greatest, it took forever to charge, and the phone itself took a long time to learn. Suffice it to say that after one long year with the phone I decided I would go against all my ethics, slip out of my contract, and spend an arm and a leg for a cellphone that I was not even sure if I would like. I was by no means an Apple Fanboy, but I had high hopes for this phone, and it has surpassed them and more. It is fast, it is built well, it is a seamless learning process to get used to it, the messaging app is crisp and clean, the visual voice mail and the calling app in general are great, there are tons of well designed apps, the screen is crystal clear, the music application far surpasses most Android phones (including my old cellphone), and it has a reputation of high-quality, long lasting products to back it. Yes, it is expensive, but it is very worth it. If you want a phone that feels well built, and solid, and will perform well, I assure you that this one does not disappoint.", "Date": "November 23, 2012"}, {"Title": "The item wasn't in a condition as described", "Author": "Alex Galata", "ReviewID": "R34PILF16P0U0J", "Overall": "3.0", "Content": "The item wasn't in that condition as it was described. Had a lot od cracks and scratches on it.For this price I could buy something much better and in a better condition.Nevertheless I give 3 stars to a seller for a fast shipment.", "Date": "July 7, 2012"}, {"Title": "a stolen phone", "Author": "pamela phiillips", "ReviewID": "RG881L2NEPGO", "Overall": "1.0", "Content": "the phone I received was not able to be activated because it was a stolen phone. I had to send it back . The #s on the phone did not match the box.", "Date": "May 15, 2014"}, {"Title": "Great Mother's Day gift!", "Author": "Chris Gregory", "ReviewID": "R2T5MBO77VNGWN", "Overall": "5.0", "Content": "Our son bought this smart phone for my wife as a Mother's Day gift.  She is thrilled with this phone and she's learning to use new apps everyday.  My wife had an old Tracfone for several years.  She's so happy that she doesn't have to buy minutes each month.  This is a great addition to our family - a plus:  she can look up the weather for the lake I'm about to fish... temp, precip, wind, etc. on a weather app.  That's really convenient!", "Date": "May 14, 2014"}, {"Title": "swindler", "Author": "xuqiang", "ReviewID": "RNN29IR5MTFIH", "Overall": "1.0", "Content": "I order Iphone 4s last year. i check the IMEI today, amazing thing come out ----it is a iphone 4. please check it carefully after you buy it", "Date": "May 14, 2014"}, {"Title": "never buy from this seller again!!!", "Author": "Ily", "ReviewID": "R3IKEA44H3HQA9", "Overall": "1.0", "Content": "i usually don't leave bad reviews but this time i feel very frustated! it has been almost a month since i retuned my defective iphone, first of all the iphone i ordered said it was for AT&T; (that's why i but it). when it arrived it did not turn on so i thought i needed to be charged but it never turned on. when i was ready to pack it and ship it, it finally turned on but it was a verizon iphone not AT&T; as listed. then it suddently started turning on and off by itself so i finally shipped it back. since then i've been contacting the seller for my refund and all i got was \"i will refund your money asap\" but i don't know what asap means for them becasue i haven't received it in about a month.i will not recomend this seller to anyone!!", "Date": "April 22, 2014"}, {"Title": "Love it!", "Author": "Amazon Customer", "ReviewID": "R22WVHPERJWREK", "Overall": "5.0", "Content": "The phone came right away when it was ordered. I have has this phone for months, and since then I have had no issues at all and I love it. Thanks so much!", "Date": "March 2, 2014"}, {"Title": "DO NOT BUY FROM THEM", "Author": "ATSUKO RICHARDSON", "ReviewID": "REY04EUJCL0LO", "Overall": "1.0", "Content": "DO NOT BUY from them!!! The one I bought from them didn't even take SIM card. I took it to repair place and they said it was water damaged and screws were missing and could not believe they even put that for a sale. One month return policy is horrible too. Just they are horrible!!! It was $300 for a piece of brick. Sorry amazon , u should consider do something about them", "Date": "February 3, 2014"}, {"Title": "DO NOT BUY FROM BUYMART. THEY SELL TAMPERED PRODUCT AS \"NEW\"", "Author": "sunil", "ReviewID": "R39XCBCQEN11FR", "Overall": "1.0", "Content": "Hello Friends,I am writing this review after tons of emails with Buymart and Amazon. Summary is that BuyMart is fraud and they sell tampered products as \"New\" instead of \"Refurbished\".I purchased Iphone 3G as Birthday gift for my wife on Dec 2012 and the phone's home button stopped working on Dec 2013 and there were few more days left to complete the 1 Year. Though Buymart and Amazon gives replacement only within like 3 months, I was expecting Manufacturer warrenty of 1 year from Apple.To my surprise Apple said the warranty expired as this product was purchased in Sep 2009! The most surprising thing is that They said lots of parts in this phone has been replaced and tampered with. This was surprise to me since I payed almost 300 bucks to get this phone in \"New\" condition!I Don't see an option to attach a file else I would have  uploaded the diagnosis results from Apple Store here. But these are the highlights from Apple diagnosis notes. I have decided to file lawsuit against amazon and Buymart as both are doing fraud- Upon Visual inspection Unit appears to have third party modification- Unit was purchased in 2009 and taken to a third party location to have repairs- Unit receiver and Speaker is third party- Back module is third party- Unit was sold as \"like new\" however there is evidence of third party repair- Service denied due to unauthorized modificationSo think before you decide to buyThanks,Sunil", "Date": "January 29, 2014"}, {"Title": "I am very disappointed", "Author": "changping wang", "ReviewID": "R2OLQUGJD4VROB", "Overall": "1.0", "Content": "Charger is bad.back Cover is not original, Battery charging 300 times, I am very disappointed,If I'm not in China,I must return", "Date": "January 14, 2014"}, {"Title": "Great", "Author": "Adam", "ReviewID": "RLZKPQTQU909W", "Overall": "5.0", "Content": "The specifications were all correct and this phone has not given me any problems. Can't say anything bad about it.", "Date": "January 8, 2014"}, {"Title": "Bummed out over this order", "Author": "Mr. M", "ReviewID": "R3ET90KCJQZFM8", "Overall": "1.0", "Content": "The phone came in its own box wrapped with thin plastic with no protection.  It was not insured. The phone did not appear to be new. There was no tool to open the sim card container.  The phone was defective and could not take pictures with the front camera.. only the selfie camera worked.  The volume could not be adjusted.  I returned the phone to the vendor, insured and wrapped in a box with protection ($21.00) and I am still waiting on my refund from the vendor. It the meantime, I have ordered another phone, a black iPhone directly from Amazon Prime and it is wonderful. Had to file and A-Z claim.", "Date": "January 8, 2014"}, {"Title": "Solid Phone, even in 2013, which is 2 years from birth!", "Author": "Kevin AcelaExpress", "ReviewID": "R1KRI6S862ZZ99", "Overall": "4.0", "Content": "I personally have an intermediate/advanced amatuer kind of knowledge so I am not an expert expert if you will so this review will be based as is. In addition, this review is not baased on a purchase thru Amazon.com.Usage:I have had this model of phone (Apple iPhone 4S 16GB White) since September of 2012. I have had it replaced in April of 2013 due to a mix of personal and manufacturer issues. I have also had that replacement replaced in November of 2013 due to manufacturer issues. However, I still have to say, because of the Genius Bar and overall Warrenty (AppleCare+) experiences, it's a key part of this device's goods. Plus, if I am not a power-user, I don't have to replace it! In addition, for a long term feel, I think Battery Life could see improvements, even the newest could see some more improvements because the sub 2000-mAh battery is not enough for real world usage. I'm down to 50% before mid-day even passed so it's not a device for the power-user like me.Connectivity:I have to say, there is indeed still somewhat of antenna issues but it's not as bad as it can be, which means it's comparable in performance with most comparable smartphones out there. However, I would say this, this device can perform better than comparable devices, simply due to the communication technology algorithms, especially since I can have a HD video load smoothly in real time without any issues when not throttled on \"4G - 3G\". I would also note that Wi-Fi and Bluetooth are solid when you are on iOS 6.1 or higher, however if you do not want iOS 7 taking up storage (assuming your current device doesn't have it) don't turn on Wi-Fi or your device will have up to 3GB's lost depending.Audio/Video:The iPhone is pretty much well know to have an amazing screen and audio preformance, however I just wish the device has a slightly larger screen, and a slighty better speaker so I can see and hear much better, but I would be more scathing if this device is released in 2013 as in 2011/2012 only the smaller devices had better performance. I would indeed say this, the color accuracy is great, the screen is sharp and everything look great, especially high-quality photos. Music listening is also great even so the speaker could see more improvements, still it's probably the best speaker on a Smartphone in 2011-2012 years, perhaps even in 2013 from iOS to Android to Windows Phone to Blackberry. The iPhone 4S is just solid still, even 2+ years later!Camera:Coming from Feature Phones and owning a 3GS and iPad 2 for a little over a year when I upgraded in 2012, I have to say the Camera is amazing, it's a dramatic upgrade. Even so there are better cameraphones out there like the Lumia 92x/102x series, Samsung Galaxy S4/N3 and iPhone 5S, the 4S still can deliver in 2013, and for the greater part of 2014. So you'll have a solid device for at least 50% of your contract if you buy before New Years 2013-2014 so it's an amazing device to own still. The 8 MegaPixels deliver sharp images, comparable to a Canon upper range Point & Shoot, though I wouldn't put it comparable to DSLR as Apple puts it since it doesn't deliver RAW as DSLR's deliver RAW.Overall: Overall rating is 4/5 stars as of November 2013, so I would highly recommend it, especially if you are comparing it to the 5/5C since the 4S is good enough if not, a tad bit more solid oddly.", "Date": "November 28, 2013"}, {"Title": "Solid Phone, even in 2013, which is 2 years from birth!", "Author": "Kevin AcelaExpress", "ReviewID": "R1KRI6S862ZZ99", "Overall": "4.0", "Content": "I personally have an intermediate/advanced amatuer kind of knowledge so I am not an expert expert if you will so this review will be based as is. In addition, this review is not baased on a purchase thru Amazon.com.Usage:I have had this model of phone (Apple iPhone 4S 16GB White) since September of 2012. I have had it replaced in April of 2013 due to a mix of personal and manufacturer issues. I have also had that replacement replaced in November of 2013 due to manufacturer issues. However, I still have to say, because of the Genius Bar and overall Warrenty (AppleCare+) experiences, it's a key part of this device's goods. Plus, if I am not a power-user, I don't have to replace it! In addition, for a long term feel, I think Battery Life could see improvements, even the newest could see some more improvements because the sub 2000-mAh battery is not enough for real world usage. I'm down to 50% before mid-day even passed so it's not a device for the power-user like me.Connectivity:I have to say, there is indeed still somewhat of antenna issues but it's not as bad as it can be, which means it's comparable in performance with most comparable smartphones out there. However, I would say this, this device can perform better than comparable devices, simply due to the communication technology algorithms, especially since I can have a HD video load smoothly in real time without any issues when not throttled on \"4G - 3G\". I would also note that Wi-Fi and Bluetooth are solid when you are on iOS 6.1 or higher, however if you do not want iOS 7 taking up storage (assuming your current device doesn't have it) don't turn on Wi-Fi or your device will have up to 3GB's lost depending.Audio/Video:The iPhone is pretty much well know to have an amazing screen and audio preformance, however I just wish the device has a slightly larger screen, and a slighty better speaker so I can see and hear much better, but I would be more scathing if this device is released in 2013 as in 2011/2012 only the smaller devices had better performance. I would indeed say this, the color accuracy is great, the screen is sharp and everything look great, especially high-quality photos. Music listening is also great even so the speaker could see more improvements, still it's probably the best speaker on a Smartphone in 2011-2012 years, perhaps even in 2013 from iOS to Android to Windows Phone to Blackberry. The iPhone 4S is just solid still, even 2+ years later!Camera:Coming from Feature Phones and owning a 3GS and iPad 2 for a little over a year when I upgraded in 2012, I have to say the Camera is amazing, it's a dramatic upgrade. Even so there are better cameraphones out there like the Lumia 92x/102x series, Samsung Galaxy S4/N3 and iPhone 5S, the 4S still can deliver in 2013, and for the greater part of 2014. So you'll have a solid device for at least 50% of your contract if you buy before New Years 2013-2014 so it's an amazing device to own still. The 8 MegaPixels deliver sharp images, comparable to a Canon upper range Point & Shoot, though I wouldn't put it comparable to DSLR as Apple puts it since it doesn't deliver RAW as DSLR's deliver RAW.Overall: Overall rating is 4/5 stars as of November 2013, so I would highly recommend it, especially if you are comparing it to the 5/5C since the 4S is good enough if not, a tad bit more solid oddly.", "Date": "November 28, 2013"}, {"Title": "User friendly, my mom can use it!", "Author": "Tamara", "ReviewID": "RVLCRSTJ1YSWD", "Overall": "5.0", "Content": "I've had my 4s now for 2 years and it's still in great condition, never crashes and with the iOS 7 update, feels like a brand new phone! I definitely recommend the 4s to anyone that is looking for a user friendly device and still actually want to make calls on their phone. Not a phone I would recommend to people who want the latest and greatest or want more customizable options.", "Date": "November 25, 2013"}, {"Title": "Couldn't be happier!", "Author": "D. M. Atkinson", "ReviewID": "R2GC0R57YQUERT", "Overall": "5.0", "Content": "This refurbished iPhone 4S was delivered in new condition in less time than the supplier promised. It was configured in the basic format and took me less than an hour to get in service with my carrier (Consumer Cellular). It has been working flawlessly since!", "Date": "November 19, 2013"}, {"Title": "Refurbished is the way to go!", "Author": "L. Craig", "ReviewID": "R36CLDYE5RHVT7", "Overall": "5.0", "Content": "I have never had a cell phone and I am a penny pincher, so I wanted to buy my own phone, and then find a month to month service.  I considered buying a new phone, a used phone, and a refurbished phone.  I asked the seller (Green Grape) a bunch of questions about refurbished phones and they had good answers for all of my questions.  I had already decided on an IPhone 4S, and they had a very reasonably priced, refurbished, white phone.I now have my IPhone and I just could not be happier about the phone and the company I chose to buy it from on Amazon.  First of all, the phone looks brand new and it works like a brand new phone.  It came in an original box with all of the accessories.  My wife has showed me how to get everything going and the phone is just in excellent condition.  I am very pleased.", "Date": "November 17, 2013"}, {"Title": "I would not do it again through Amazon", "Author": "Daniel Khouri", "ReviewID": "R7WLW8LMKX9RL", "Overall": "2.0", "Content": "the phone came with many problems, the WiFi signal is always weak. the reception is poor, there is a penetration of humidity (as per the indicator within the headphone jack)... I would not do it again through Amazon.", "Date": "November 5, 2013"}, {"Title": "Best upgrade", "Author": "moranm082", "ReviewID": "R3J5J2JTXMMA0H", "Overall": "5.0", "Content": "Prior to upgrading myself to the iPhone 4S I was dealing with the variety of \"basic\" phones that providers offer. I was constantly having difficulties with operating and the mechanics of those phones, therefore figured that upgrading to my first smartphone was truly the best option. As a college student I am always on the go, however need to stay in contact with certain aspects of my life such as checking and sending emails, keeping up with social media, etc. The iPhone 4S truly does make this easy to accomplish with minimal problems or issues. The phone is easy to operate once you get the hang of it, much like any new and unfamiliar device. I was impressed with how simple the layout is of the phone itself also. I use this phone for basically all of my day-to-day activities, and this phone only makes completing these easier. I feel as though everything I could need for my lifestyle currently is at my fingertips with the iPhone 4S. One of the only negatives that I have for this phone is that it is extremely fragile. Many of my friends keep a cheap, plastic case on their phone where it could easily break after one fall. I recommend something more durable for keeping your phone safe since the screen is the largest and only component on this phone. I also thought that I would have more issues with texting on my phone seeing as I have been used to actually pressing buttons and not just typing on a virtual keyboard, however texting and typing on this phone was simple and easy to pick up. I recommend this phone to any person who is looking for something that can ease their day-to-day schedule and life's hassles.", "Date": "October 8, 2013"}, {"Title": "Good condition", "Author": "Harlan", "ReviewID": "R1KE90M12B6DUS", "Overall": "4.0", "Content": "It looked brand new and was in the original box.  No complaints, just wish it cost less.  No scratches. The phone had been reset to original factory settings.", "Date": "October 8, 2013"}, {"Title": "like new iphone", "Author": "alex", "ReviewID": "R1W3I3OWI7BZXO", "Overall": "5.0", "Content": "when i got my package is was nicely packaged.I had no issues what so ever. the iphone itself was in a like new condition, which i wonder if the user ever used before, that how much the iPhone was in great shape. no complaints what so ever!", "Date": "October 8, 2013"}, {"Title": "I like it", "Author": "yunyoung nam", "ReviewID": "R32KHV0JH3A3NC", "Overall": "4.0", "Content": "Very fast shipping.It is almost brand new.But, there is no earphone.BTW, I recommend this item.Looks like a new one", "Date": "September 30, 2013"}, {"Title": "I love it!", "Author": "sda", "ReviewID": "R2N1VBHLRWZS7Z", "Overall": "5.0", "Content": "i order the used iphone from the amazon warehouse about a month ago and i was shocked on how good the condition of the phone was. it only have a little scratch on the screen but other than that it was like new! i'm very happy about my purchase!", "Date": "September 13, 2013"}, {"Title": "couldnt even tell it was used", "Author": "Tiffany", "ReviewID": "R2CFWG5O0H0V7T", "Overall": "5.0", "Content": "for the price i paid, i feel as though it was worth it. the brightness acts a bit funny at times but besides that, it was a wonderful replacement for my 8GB iphone 4 w/ the cracked screen.", "Date": "August 13, 2013"}, {"Title": "Great!!!", "Author": "Roert McComic", "ReviewID": "R37J1OU06G2DS", "Overall": "5.0", "Content": "This is a great phone I love it.  Just like a hand held computer with everything in between.  Great buy.", "Date": "June 13, 2013"}, {"Title": "Great phone!", "Author": "EvaBalo", "ReviewID": "R2R9C245VHT1OM", "Overall": "5.0", "Content": "Apple has a fantastic reputation, and rightfully so. All their products are extremely reliable and durable! I got my iPhone 4S for a great price with all the original cords, it looks unused. While buying make sure that you're buying the exact model you want (unlocked, GSM, etc). I would recommend this to anyone as long as they're sure they're getting exactly what they wanted", "Date": "May 30, 2013"}, {"Title": "GREAT.....", "Author": "iluv2workout8", "ReviewID": "R3LWB28RMN6KND", "Overall": "5.0", "Content": "The iPhone 4s in must thought is Apples BEST iPhone even over the iPhone 5. Would recommend this phone to all!", "Date": "April 19, 2013"}, {"Title": "Simple one word Awesome", "Author": "Sushant", "ReviewID": "R3OA0T7HZWUGPJ", "Overall": "5.0", "Content": "Simply Superb :) The cameera,apps and features are really good and liked it. I was using other brand phone but after this really its amazing with superb quality. Nice experience.", "Date": "April 18, 2013"}, {"Title": "excellent", "Author": "ju pan", "ReviewID": "RE87ABKJW6GFW", "Overall": "5.0", "Content": "The phone I purchased is in perfect condotion, I like it very much! love it , love it , love it...", "Date": "March 18, 2013"}, {"Title": "Great product", "Author": "Nico", "ReviewID": "R3M0NO325JREWY", "Overall": "5.0", "Content": "The phone worked just fine and I love it. The best part I think is the vast amount of apps that you can install to the phone. The only thing I worry about is dropping the phone, screen looks like it could not take a beating.", "Date": "January 25, 2013"}, {"Title": "I LOVE IT", "Author": "Sandro Trejo Bracho", "ReviewID": "R2D5EAM875FEOX", "Overall": "5.0", "Content": "Until now this has been the best purchase I have made because the phone greatly exceeded my expectations. I want the brand continues, and it rests in innovate and offer a fair price the best phone.", "Date": "January 15, 2013"}, {"Title": "Solid Build, Great Applications", "Author": "S. C. Krystek \"Synthetic Human\"", "ReviewID": "RV51G2BUESKFB", "Overall": "5.0", "Content": "I went through 3 Android phones in less than two years before finally spending the extra money to get an iPhone. The main reason: everyone I talked to who owned an iPhone already had been using the same phone for 2 years or more. When you combine the costs of all the Android phones I had purchased in the same amount of time, I spent around $900 on phones, so the extra cost in an Apple product is justified when you take into account how long they are built to last.The phone is extremely simple to use, the range of apps available make it easy to customize your phone, and it syncs with my iMac perfectly (something I had severe problems with on the Android phones).While this isn't the latest, greatest model of the iPhone, it is still a massive upgrade in phone quality compared to what I was used to.", "Date": "January 13, 2013"}, {"Title": "Great phone", "Author": "Amazon Addict", "ReviewID": "R2TTGVNVT8XYVN", "Overall": "5.0", "Content": "I decided to purchase this instead of the Iphone 5, mainly due to the price difference. I also wasn't sold on the \"benefits\" of the new iphone5. Personally this phone does everything I need and more. The interface is responsive, Siri is cool, and wifi and internet work flawlessly. Most importantly the \"phone\" aspect of the iphone works good as well. Another feature that was highly important to me was the availability of a wide variety of apps. You can't be an iphone in that respect! Highly recommend over almost any other smartphone out there.", "Date": "January 4, 2013"}, {"Title": "An iPhone make the 'so called' smart phone look dumb!", "Author": "Pandoras' Box", "ReviewID": "RWR5P1R7CYVFT", "Overall": "5.0", "Content": "I love my iPhone 4S.  Apple is the best.  They make an ordinary smartphone look dumb.  Even the iPhone 4 are nice.  I will NEVER go back to a smartphone.  Smartphones are very limited.  iPhones are much better than droids and any other phones that are out there.  The only downfall is the battery.  It does not last long enough without being charged; but on the outside of that it wonderful. I LOVE FaceTime that the iPhone and iPad has on them.  FaceTime connect you with your loved ones and anyone else you would like to see providing they too have an iphone or ipad. If you want to keep in touch and actually see your loved ones, don't just purchase yourself one, purchase another for a loved one like I did. I would recommend this to everyone.  Get rid of your 'so called' smart phone and move up to an iPhone!", "Date": "January 4, 2013"}, {"Title": "I love it", "Author": "coolmama", "ReviewID": "R3BMFWEWFCLM1D", "Overall": "5.0", "Content": "I got this for my Birthday gift and I fell in love. I don't want what I'm going to do without them. I love all the free apps you can download. I love the user interface, and I love the camera! Picture quality is nice.", "Date": "December 25, 2012"}, {"Title": "Battery won't hold a charge longer than a day", "Author": "John D. Taylor \"jtsurf\"", "ReviewID": "R3TP7RLRZAJ5XE", "Overall": "2.0", "Content": "I paid a lotta money for a phone that doesn't work well and needs rebooting frequently. Can't get access to Mail or Voicemail depending on where I am.  Very disappointed, camera isn't that hot either.", "Date": "December 20, 2012"}, {"Title": "Apple iPhone", "Author": "Qua22", "ReviewID": "RBKI489WPQCGG", "Overall": "4.0", "Content": "I was really satisfied with my purchase. I love my phone. The phone was in good condition and had no scratches. The only thing I wasn't satisfied about was that it was a locked phone and that I had a lot to go through to get it unlocked.", "Date": "December 19, 2012"}, {"Title": "Don't bother, since Apple burned 4S owners", "Author": "J. D. Riche \"Dost\"", "ReviewID": "R1NJEQ1OD7CPKU", "Overall": "1.0", "Content": "It's pretty simple - unless you want to run the old version of IOS and have Apps pass you by, you'll upgrade to IOS7, rendering your iPhone 4S WORTHLESSLY SLOW and feeble - when it will run at all.  My husband, people at the office - everybody says the same thing - Apple totally screwed us on the upgrade, forcing an upgrade to the 5C or 5S.  Your choices are a new $700 phone from Apple or being spyed on by Google's Android.  Windows is barely worth mentioning, unless you want an inch thick phone with what is presumably a buggy Windows device.  Great options these days, eh?", "Date": "December 19, 2013"}, {"Title": "it works, but...", "Author": "Denise Lopez", "ReviewID": "R1DSUWZMLG3I6G", "Overall": "3.0", "Content": "The phone works fine and the seller shipped it very fast, but left out a big detail in the product discription. There is some kind of yellow spot inside the glass/LCD of the screen. It doesn't prevent the phone from working correctly, but it's just annoying seeing it there.", "Date": "July 12, 2013"}, {"Title": "Locked", "Author": "Jacques", "ReviewID": "RX2QWF9HYON6R", "Overall": "1.0", "Content": "I bought this phone and since it cost above U$D 500, did not expect to be locked .I am out the USA and can not use in any other carrier .Do not buy any Iphone for this price if it is locked, since you can get for the same price unlocked.", "Date": "April 23, 2013"}, {"Title": "Perfection!", "Author": "Gusboo", "ReviewID": "R3P0OPN6O6O6QZ", "Overall": "5.0", "Content": "Wow im glad I bought my phone from this person. Phone came basically brand new! With the box, brand new iHeadphones, charger cable, charger cube, and instruction manual. No scratches whatsoever! the phone appears to be 100% new. I definetly recommend this seller to everyone! I am very happy with my purchase!-Gus =)", "Date": "July 12, 2012"}, {"Title": "PERFECT", "Author": "L. D.", "ReviewID": "R2B1JNEYKG8UPB", "Overall": "5.0", "Content": "This phone came sealed in it's original box, as advertised. It is brand new and I had it up and running as soon as I received it. It arrived sooner than I had expected. Before purchasing I had one query and the seller responded quickly. I'm totally satisfied with this purchase. Thanks.", "Date": "June 14, 2012"}, {"Title": "$600 to GARBAGE", "Author": "Nora", "ReviewID": "R26IOCPYAHTOMK", "Overall": "1.0", "Content": "I bought this phone hoping to use it for a long time. After two month of using it got blocked. Took it to THREE repairers! None of them could unblock it, they said the phone was locked to Sprint and best thing to do is to return it to the seller. So I filed the claim through Amazon. Amazon told me its too late so just keep the product! Hey I paid $600 for the phone! $600! Throw $600 to GARBAGE! It was a good lesson. I AM NOT BUYING PHONES FROM AMAZON FROM NOW ON, IF I WANNA THROW SOME MORE MONEY AWAY, AM GONNA DO IT DIRECTLY WITHOUT OF HELP OF AMAZON", "Date": "November 6, 2012"}, {"Title": "iPhone 4s~Amazing", "Author": "D. Moss", "ReviewID": "R2VMYJL161FSRO", "Overall": "5.0", "Content": "I have had the iPhone 4s for almost two years now and honestly couldn't say a bad thing about it. It is very similar to the iPod touch but has more features that make it more compelling. It's the perfect for people aged 16+ because of everything that it has to offer. It makes phone calls which every phone does but at the same time this phone works better than ever phone I had in my life. It also has an app store feature which you can go on and buy several different apps. I love to have educational apps, apps for school, and games to keep myself busy when I am waiting somewhere. It also is capable of uploading and purchasing music so that you can listen to it when ever and where ever you are. I also enjoy that you can hook it up to wifi and google or web search everywhere. That is very helpful just like having a GPS built in so that you never get lost again. It also captures videos and photos great but it could have better zoom. The software updates every so often to make sure that your phone is up to date and virus free. I honestly will never have any phone but and iPhone. I can't wait to get the newest up to date version. I would think twice about buying this phone. Once you get the hang of using it you will feel the same way.", "Date": "October 8, 2013"}, {"Title": "NOT IN PERFECT WORKING CONDITION", "Author": "Kelsey Meyer", "ReviewID": "R3HJ04Z7VHU9VN", "Overall": "3.0", "Content": "Volume buttons are way messed up. Cannot play audio half the time. Totally not in perfect condition, as listed. Quite disappointed.", "Date": "September 6, 2013"}, {"Title": "iPhone 4s phone", "Author": "Michigan guy", "ReviewID": "R3LY5EFAFF01D9", "Overall": "5.0", "Content": "The iPhone 4s is a great phone for me, it's a nice weight, and isn't too large to slip into a pocket.  The photos are great for me and I am happy to have a flash for darker settings.", "Date": "July 17, 2013"}, {"Title": "iPhone 4S", "Author": "cobrajmr", "ReviewID": "R2NLKZSI3IDFD1", "Overall": "5.0", "Content": "The phone came as expected, even though I expected a charger. Even though it did not say charger was included, but the phone was nice and looked new (I bought a used one). Oh, side note, this phone is NOT unlocked so if you need it to be then that's a different story.", "Date": "June 21, 2013"}, {"Title": "the best iphone even better than the Iphone 5", "Author": "MekoRush", "ReviewID": "R2V42WPIF0GFPL", "Overall": "5.0", "Content": "Yep i can't count how many times I've gotten a iphone 4s. ok I can, i'm on my 3rd one.  Its a great phone, very fast and snappy. No drags. Let me tell you about my lil story with the iphone 4s, i first got one back in 2011 with sprint and used it like every 5 mins lol. I was overseas so i put my overseas sim card in and used free hotspot :-) I was getting 2g speeds but it was great thanks to the iphone 4s....Since then i sold it for about $400 to try out the galaxy note, nope i somehow had to find my way back to the 4s so after trading and trading phones i ran across the 4s again. I was tricked lol into trying out the galaxy s3 and it was really nice, i dunno i just had that urge to go back to the iphone since all my notes was synced and pics was sync. so about 3 months later I just traded it back in for a iphone 4s my 3rd one. I'm probably gonna stay with the 4s for another year until more devices carry the new iphone 5 port for plug-in. androids are ok but i just feel they dont have any unique features you cant get on iphone. A big perk for me is that the iphone 4s apps are quicker, See pandora radio and youtube.", "Date": "March 31, 2013"}, {"Title": "terrible", "Author": "Jaylyn Niswanger", "ReviewID": "R3G28BZAPLGYYC", "Overall": "1.0", "Content": "I got this phone and the entire back was cracked, i still have not recieved a replacement back and its been a couple months. And aside from that, it's also not a 4S, it's a 4.", "Date": "January 12, 2013"}, {"Title": "Be Careful Who You Buy From", "Author": "Daniel M", "ReviewID": "R1VRZHO4D67OFT", "Overall": "1.0", "Content": "I researched the potential seller's all over Amazon's site, and finally settled on AEG WIRELESS. Their orders are fulfilled by Amazon, and after looking at reviews and seller feedback I decided they would be the best choice for what they listed as a \"Brand New\" and made for AT&T;'s network. When I received the phone for my mother, I took it into AT&T; with her to activate it. They took it into the back and promptly returned, telling us that their system had it listed as stolen. They said that it may have been a refurb and the seller hadn't had it removed from the blacklist. Either way, this phone either wasn't \"Brand New,\" (I did notice some possible wear when I took it out of the box) or worse, it was stolen. The happy-ish ending is that it was fulfilled by Amazon and when I called them about it they were incredibly surprised themselves and very nice and quick to issue a refund (it was back on my account within 30 minutes). They said they'd never heard of this happening with an Amazon fulfilled order and were very apologetic. So, my advice, if you are going to order from a third party, at least make sure it is Amazon fulfilled. Thank you Amazon for making a bad situation a little better.", "Date": "June 5, 2014"}, {"Title": "Nice product", "Author": "Duncand57", "ReviewID": "RLVGRJQMH509K", "Overall": "5.0", "Content": "Nice product for a great price!  If you aren't concerned about having the latest and greatest and can settle for the previous model this is the way to purchase your smart phone.  Kinda like buying a used car.  Let someone else take the big buck hit up front first!", "Date": "May 30, 2014"}, {"Title": "AMAZING!", "Author": "isaac", "ReviewID": "R3G5OPFDHO3S0Y", "Overall": "5.0", "Content": "Shipped faster than expected looks brand new with not a single flaw, works completely fine as well, A MUST BUY!", "Date": "May 29, 2014"}, {"Title": "Product was not new as it stated, was defective.", "Author": "Jadeen Fliflet", "ReviewID": "RTG76UVXWHA8C", "Overall": "1.0", "Content": "iPhone came in on time. Looked new as stated when I ordered it for my son. Son found out 3 days later the wifi switch did not work. Would not turn off or on. Took to an apple store, ran diagnostic test. Informed us that the phone was not new and they could not fix the problem. They called it a wifi blackout.", "Date": "May 27, 2014"}, {"Title": "Product was not new as it stated, was defective.", "Author": "Jadeen Fliflet", "ReviewID": "RTG76UVXWHA8C", "Overall": "1.0", "Content": "iPhone came in on time. Looked new as stated when I ordered it for my son. Son found out 3 days later the wifi switch did not work. Would not turn off or on. Took to an apple store, ran diagnostic test. Informed us that the phone was not new and they could not fix the problem. They called it a wifi blackout.", "Date": "May 27, 2014"}, {"Title": "Fantastic", "Author": "kasey", "ReviewID": "R2PGLK15QQHQ8C", "Overall": "5.0", "Content": "Great phone. recommend it too. Low cost still great apple phone. couldn't be more happy with it. very very good.", "Date": "May 27, 2014"}, {"Title": "iphone 4s white", "Author": "nel", "ReviewID": "R1VGZEAITW6VOH", "Overall": "5.0", "Content": "this iphone is rom at&t; it was in great conditions, no cracks nothing wrong with it, the phone is ready to activate and it has a sim card slot", "Date": "May 22, 2014"}, {"Title": "Very happy with it", "Author": "Degan", "ReviewID": "R2V6NA1TEAOMK8", "Overall": "5.0", "Content": "Like any apple product it works great.  I needed to get one that would work with T-mobile and this one did, awesome.", "Date": "May 22, 2014"}, {"Title": "As advertised", "Author": "Joseph Ross", "ReviewID": "R3BALY7NARY4CZ", "Overall": "5.0", "Content": "I ordered two of these, and they came quickly and both work fine.  They were new in the box.  I have no complaints.", "Date": "May 18, 2014"}, {"Title": "i was scammed by this company", "Author": "betsy mandala", "ReviewID": "R2V2EUF2CPJ641", "Overall": "1.0", "Content": "bought a used i phone 4 s from them--audio not working sent it back-in the meantime i needed another i phone so i purchased another used i phone 4s from them not thru amazon  after 4 wks this also broke tried many time to get a refund but got no response--so they scammed me", "Date": "May 16, 2014"}, {"Title": "iphone", "Author": "fred dillingham", "ReviewID": "R2F2KC5RA49Y0A", "Overall": "2.0", "Content": "the phone isn't very loud you can't the volume to low the battery runs down in  8hrs with out useing it.", "Date": "May 15, 2014"}, {"Title": "Awesome!", "Author": "Martha Hernandez", "ReviewID": "RZS1N5XBRJ4VA", "Overall": "5.0", "Content": "A great looking phone for being used. Written descriptions matched the actual phone upon arival.  Hard to find well taken care of used phones. So I feel lucky!!", "Date": "May 15, 2014"}, {"Title": "iPhone 4s 16gb (black)", "Author": "Alissa Champigny", "ReviewID": "RCBJKAXV7TEFK", "Overall": "4.0", "Content": "Great pre-owned phone. I am very pleased. Battery could have been a little better but it does hold a charge well (I'm used to my old iPhone battery making it until 1% not 8% before shutting off) (first world problems lol) Great phone very happy with this company.", "Date": "May 14, 2014"}, {"Title": "Perfect", "Author": "Sammy", "ReviewID": "R2XGWITPRO8XBL", "Overall": "5.0", "Content": "My 15 year old son loves this phone. It arrived early, new in the box, and we had no problems firing it up at our local AT&T; store.", "Date": "May 10, 2014"}, {"Title": "Perfect", "Author": "Sammy", "ReviewID": "R2XGWITPRO8XBL", "Overall": "5.0", "Content": "My 15 year old son loves this phone. It arrived early, new in the box, and we had no problems firing it up at our local AT&T; store.", "Date": "May 10, 2014"}, {"Title": "love this phone", "Author": "chelle", "ReviewID": "R1VRX2ARCT4GQZ", "Overall": "5.0", "Content": "I'm never a fashion fan so this is the first smart phone i've had (i sound like a grandma). It turns out to be very useful. i don't have a high demand for internet so i chose the minimum data plan. Wifi is already enough. This phone is not the latest model but works greatly so far! i don't really mind what new features iPhone 5 has, so i'm very satisfied with this 4s.", "Date": "May 7, 2014"}, {"Title": "Great phone, great seller", "Author": "Mr. & Mrs. James Upshaw", "ReviewID": "R1TAIEST9XZASE", "Overall": "5.0", "Content": "Everyone agrees that the iPhone is awesome . . . This review is in regard to the SELLER, not the actual phone. Although there was a problem with the screen and camera of the first phone I received, the seller was very available and worked with me to not only exchange, but upgrade my order. There was a bit of inconvenience, but the seller did his best to make sure that I was completely satisfied with the sale.", "Date": "May 6, 2014"}, {"Title": "Want to know", "Author": "Melissa", "ReviewID": "R3UD6KA8Z9M1AD", "Overall": "5.0", "Content": "We'll I want to know if it really works so if I buy it's not locked it's new nothing opened so I could put a new user and emails and stuff", "Date": "May 5, 2014"}, {"Title": "Nice customer service on my phone purchase", "Author": "djxxm", "ReviewID": "R23V7HEN5JHNS8", "Overall": "5.0", "Content": "The  phone is good,though the phone's attachment is not origin,but the customer service is all right,but why did there is not any iPhone 5s  verizon on Amazon warehouse deals", "Date": "May 1, 2014"}, {"Title": "VERY NICE AND VERY NEW ENOUGH!", "Author": "Huang pei fan", "ReviewID": "R1OKAYB5QISCEJ", "Overall": "5.0", "Content": "All kinds of iPhone apps run smoother and are much nicer to look at.The size is perfect,NICE PRICE FOR ME.", "Date": "April 29, 2014"}, {"Title": "Love It.", "Author": "Jonathan hays", "ReviewID": "R22I2TN9EQLC5B", "Overall": "4.0", "Content": "I was honestly scared I was going to get a messed up phone. But I love it. It came looking brand new. Only a slight chip. Works good. Functions great. Couldn't even really tell it was refurbished.First iphone I've ever owned and I love it so much more then android.", "Date": "April 27, 2014"}, {"Title": "An Exception Value", "Author": "Christiansrice \"Docrice\"", "ReviewID": "R34CLCDCW80KCJ", "Overall": "5.0", "Content": "This Iphone works a well as a new model;  no marks or blemishes, very good condition electrically.  A good buy.", "Date": "April 27, 2014"}, {"Title": "Excellent experience", "Author": "james", "ReviewID": "R3FF8ZEYRYZQ13", "Overall": "5.0", "Content": "Phone was in outstanding condition.  My son said, tell them they are completely awesome.  Would def use again and recommend to others.", "Date": "April 24, 2014"}, {"Title": "The worst seller I've done business with Amazon", "Author": "Angel Villalobos", "ReviewID": "R6XG1QEYVB4HO", "Overall": "1.0", "Content": "The worst seller I've done business with Amazon , buy the phone in December 2013, received in my country in March 2014, \" as new in box \" by using courier delays , when I received the phone the screen did not respond , was slow, the phone to get it blocked and I had to pay to unlock the IMEI, the phone had serious problems with sensitivity. In my country I could not return it so wait until coming to Orlando, USA , a couple of days ago I went to the Apple Store to review the phone but when they to revise noted that 75 % of what parts did not comply with its policies for not being original parts from Apple , among these were front screen , rear screen , side , charger, cable, headphones and internally the phone had obviously replaced several electronic components , plus the box was also false because labels had adhesive , original boxes are printed data , such vendors should not allow him to work at Amazon.", "Date": "April 23, 2014"}, {"Title": "Amazon is the best..", "Author": "victoria cabrales", "ReviewID": "R1DDRF1TZAH7B2", "Overall": "3.0", "Content": "No charger that came with the phone and with minimal scratches, otherwise in good condition. I have to send it to my country for a family member.", "Date": "April 21, 2014"}, {"Title": "Iphone4s", "Author": "Jody Sckupakus", "ReviewID": "RB1IBCSCND9CD", "Overall": "5.0", "Content": "Great phone.  Got it for a great price.  Now that we have no contract have to find other ways of getting our phones.  Amazon!", "Date": "April 21, 2014"}, {"Title": "No Bluetooth", "Author": "Ahdam Brown", "ReviewID": "R3S6MMMOI0269Y", "Overall": "1.0", "Content": "Unit was not working properly. It was difficult for it to see and to connect to Bluetooth devices. Unit would not recognize imessaging for a while.", "Date": "April 18, 2014"}, {"Title": "Satisfied Customer..", "Author": "L. Aguon", "ReviewID": "R3PS0IFUTGGXDN", "Overall": "5.0", "Content": "I ordered this for my son after he lost his iPhone 4 and he couldn't be happier! It was exactly what he expected.", "Date": "April 14, 2014"}, {"Title": "Highly cost effective", "Author": "Lee", "ReviewID": "R39G9T5KOOEFN4", "Overall": "4.0", "Content": "For electronic products , I choose second-hand gadget because of cheap price. It looks like a new one though had been used.", "Date": "April 14, 2014"}, {"Title": "Love It", "Author": "Laura Ricci", "ReviewID": "R1NVW0BWWIXZFY", "Overall": "5.0", "Content": "I have to admit I love this phone. It is way better than any \"smart phone\" I have ever owned. Very easy to use. Thanks for making a great product.", "Date": "April 13, 2014"}, {"Title": "Product the best, but the saller no !", "Author": "Felipe Moura Pizzorno", "ReviewID": "R3JXLHFT1END0O", "Overall": "1.0", "Content": "I selected product in unlocked category and selected this model.... When i recived this product i try to use in another country and no worked beacause is block to at&t....; I pay $400,00 to buy a iphone 4 blocked ? You are crazy ?", "Date": "April 12, 2014"}, {"Title": "i phone", "Author": "Clorene Layne", "ReviewID": "R189THM9YWNL1L", "Overall": "1.0", "Content": "i hate it the screen was messed up an everythingi don't understand how people sell these things i wish o told of sent it back", "Date": "April 12, 2014"}, {"Title": "The 4S is 4G and has Siri", "Author": "scubadude", "ReviewID": "R3P2M48VITTWAP", "Overall": "5.0", "Content": "It runs the latest iOS, has Siri (if you want that) and supports 4G. The iPhone 4 only supports 3G.", "Date": "April 12, 2014"}, {"Title": "phone is great; trade in lousy", "Author": "Richard P. Fedchenko \"retired prof\"", "ReviewID": "R2IDU845DEA9O3", "Overall": "2.0", "Content": "The two iphones I bought are both great. The problem is with the trade ins. We sent two iPhone 4 cell phones and one was rejected: they said the scratches were too bad. OK. It's their judgement I can't argue there. But when they returned the rejected phone there were no accessories in the box. When I sent it in the phone had a charger, USB cable and earbuds. All I received back was the phone itself. I called and emailed about this and got no replies either way.", "Date": "April 10, 2014"}, {"Title": "thank you", "Author": "Leshaun seymour", "ReviewID": "R3O4QKMUX6P6A7", "Overall": "5.0", "Content": "Thank you for the phone it is what I was looking for, my my old iPhone was good but this one is great.,", "Date": "April 2, 2014"}, {"Title": "total hit it out the ball park!!", "Author": "Janna Gibbins", "ReviewID": "R38ZA19YWIBVAX", "Overall": "5.0", "Content": "completely loved it, I will still need to get a new SIM card but, who cares! i receive a brand new in the original Sealed box. yes, the box said iPhone 4, it was a 4s inside, and that's exactly what I wanted. I went with what ever shipping was free.", "Date": "April 2, 2014"}, {"Title": "Iphone", "Author": "Eric", "ReviewID": "RLE05G9Z9Y9JT", "Overall": "5.0", "Content": "GREAT!!!! CANT COMPLAIN AT ALL NO ISSUES...I WOULD RECOMEND IT TO ANYONE...THANKS FOR THE PHONE IT WAS VERY USEFUL THANKS.", "Date": "April 1, 2014"}, {"Title": "Great job", "Author": "jamie s wilson", "ReviewID": "R3H469AZOWFAQL", "Overall": "5.0", "Content": "Very professionalVery promptEasy to do buzz withWould without a doubt buy again from himEtc,etc,etc,etcThanks a lot", "Date": "April 1, 2014"}, {"Title": "PHONE LOCKED", "Author": "Odugbemi F.", "ReviewID": "R40LERQ7DV57I", "Overall": "1.0", "Content": "Surprised that this phone supposed to be bought as used come locked to the AT & T network. Yet to figure out what to do with them now, but I need you guys to help out to unlock them..", "Date": "March 31, 2014"}, {"Title": "completely satisfied", "Author": "Jermaine J Ramsauer", "ReviewID": "RJPSDATMS53SP", "Overall": "5.0", "Content": "Phone is like New and arrived on time. I was sceptical at first but had such a good experience, now am a fan of purchasing electronics on line.", "Date": "March 30, 2014"}, {"Title": "Amazon Warehouse Excellent Price", "Author": "ELIGIUSVIN Cyriljoseph", "ReviewID": "R93Y06NQDP5M0", "Overall": "5.0", "Content": "I bought for a excellent price one year ago.  Even now I cannot get it for the same cheaper price.", "Date": "March 29, 2014"}, {"Title": "Battery Dies Frequently", "Author": "Vince", "ReviewID": "R2XOS97YVEBN10", "Overall": "1.0", "Content": "The battery dies randomly sometimes at 50% other times it dies at about 30%. It's very frustrating to deal with.", "Date": "March 28, 2014"}, {"Title": "Very Happy", "Author": "jk", "ReviewID": "R2SMMYTVS2DRL3", "Overall": "4.0", "Content": "Very happy with this purchase, great condition worked great. Very fast phone. Worth the purchase price. Very Happy. Fast delivery. Would buy again.", "Date": "March 27, 2014"}, {"Title": "Fantastic!", "Author": "brandon l nesteby", "ReviewID": "R37FCLBVX5VWO5", "Overall": "5.0", "Content": "Phone was perfect. Came just like described. Very happy with this purchase and I will tell others of the quality product and fast shipping!", "Date": "March 25, 2014"}, {"Title": "My new IPhone 4s", "Author": "percy42", "ReviewID": "R2JRY5SSU4MKFU", "Overall": "4.0", "Content": "i have had an IPhone 4 previously  and wanted to have it again.I knew what I was purchasing and it is exactly what i wanted.It accomplishes everything I need.,with simplicity to use.", "Date": "March 25, 2014"}, {"Title": "IPHONE 4S PURCHASE", "Author": "Bill Abbott", "ReviewID": "R25C2QW31SIA50", "Overall": "5.0", "Content": "Very happy with phone and service,thinking of purchasing another,now the wife needs phone guess where it's coming from thanks for everything!!", "Date": "March 22, 2014"}, {"Title": "Locked phones", "Author": "robert e willis", "ReviewID": "R3334YZWOZZ1ZL", "Overall": "1.0", "Content": "The phones are locked!!!! I was buying them for friends that live in the Philippines they won't work for them", "Date": "March 22, 2014"}, {"Title": "Great purchase", "Author": "Matthew Montgomery", "ReviewID": "R2U0QIOFXC229D", "Overall": "5.0", "Content": "The phone owned up to its description as givin before purchasing and the phone works just fine. Overall great purchase", "Date": "March 22, 2014"}, {"Title": "good value", "Author": "David", "ReviewID": "R18X3L3ROJLVYS", "Overall": "5.0", "Content": "It looks brand new due to being refurbished. I got it at a good price too. works perfect with no problem.", "Date": "March 21, 2014"}, {"Title": "The worse buy ever!!!", "Author": "Raymond Robb", "ReviewID": "RR4588VNPSKXG", "Overall": "1.0", "Content": "First it didn't arrived on time.  Second, I'm frustrated because I cannot activate easily I didn't know that the phone is locked and I have to call AT&T.;", "Date": "March 21, 2014"}, {"Title": "Great products but shipping was slow", "Author": "Xavier Ortiz", "ReviewID": "R1CGO4XX1T8PUQ", "Overall": "4.0", "Content": "I was very satisfied with my purchase. The phone was in great condition and I had no problems getting it activated", "Date": "March 20, 2014"}, {"Title": "Not like new", "Author": "pei junyu", "ReviewID": "RKXPSXODKIAE8", "Overall": "3.0", "Content": "When I received the phone, I found that there are many filthy  in the cracks, not just customers to test.", "Date": "March 20, 2014"}, {"Title": "Exactly as described, Like new", "Author": "AMerrell", "ReviewID": "RW98PQZ0RFSAJ", "Overall": "5.0", "Content": "Excellent condition and exactly as described. Excellent seller. Phone was, clean, exactly like new,  well taken care of and wrapped efficiently. Was not listed to be in an original box, but was, with charger and ear plugs. Very pleased.", "Date": "March 19, 2014"}, {"Title": "Great phone but...", "Author": "winki40", "ReviewID": "R3EH2J9D5NI2IL", "Overall": "4.0", "Content": "I love the phone, however, I've had all kinds of problems since getting it because of my carrier. I was on a Go Phone plan and bought this phone to have something better than their crappy phones with low storage. I believe the ATT employee put some kind of data block on my account and I haven't been able to access the internet on my phone through data plans. I bought this phone and thought the phone was bad, bought a second phone and it was the same thing. I got frustrated so I had them activate my old phone and now the data on it doesn't work. Other than problems with my carrier I loved the phone and started using it for everything except I couldn't use it without wifi.", "Date": "March 18, 2014"}, {"Title": "Wrong item", "Author": "Kirubel Abebe Kebede", "ReviewID": "RENJVBCVOLH2K", "Overall": "1.0", "Content": "I selected the factory unlocked one and you sent me the locked one which costed me extra $70. It's very annoying!!", "Date": "March 18, 2014"}, {"Title": "I like this phone", "Author": "Leonard Quagon Jr", "ReviewID": "R1WWFDQQ72ZQX0", "Overall": "5.0", "Content": "I like the iPhone 4s n I like da color too.. I use to have a 3GS and this one I got now is way better..", "Date": "March 18, 2014"}, {"Title": "I love my iPhone.", "Author": "Kimberly", "ReviewID": "R3NXFUYPBJWPOA", "Overall": "5.0", "Content": "I was really worried about buying one refurbished but it works fine. I had a little trouble with the camera for a little while but it's working just fine now. So glad I bought this one instead of buying one brand new. Works just as well.", "Date": "March 13, 2014"}, {"Title": "Great phone!", "Author": "T. Walter \"Bill\"", "ReviewID": "R36BYIHIVO37ET", "Overall": "5.0", "Content": "Much faster than the 3gs (but then what isn't )waited to the end to upgrade, put IOS 7.1 on it,and it's great. FAST, with allot of capabilites I didn't have before.Great battery life, and really happy at the upgrade....", "Date": "March 12, 2014"}, {"Title": "Phone is still working and going strong.  With no problems since buying it.  Will update you in the future.", "Author": "Bonnie Nino", "ReviewID": "R3FM5P77WWLB2T", "Overall": "5.0", "Content": "Still working, very happy with I-phone.  Working great.  No problems yet.  Why do you need 6 more works.ThanksBonnie Nino", "Date": "March 8, 2014"}, {"Title": "So much easier", "Author": "Victoria", "ReviewID": "R2DAJ2L1C0AYJO", "Overall": "5.0", "Content": "Love my phone it has made things so much easier to help run my business, just wondering why didn't I do this sooner.", "Date": "March 8, 2014"}, {"Title": "Just as described", "Author": "Joseph Blessing", "ReviewID": "R3OMSR7QQGHA65", "Overall": "5.0", "Content": "Quality great...not fulfilled as quickly as Amazon.com compared to this third party vendor, but everything was as described.  Overall I would purchase again.", "Date": "March 8, 2014"}, {"Title": "Great iPhone", "Author": "Rebecca", "ReviewID": "R1WFAND54IIA1F", "Overall": "5.0", "Content": "Great iPhone I love how it's white. I can accessories it with anything. Super light and battery lasts a very long time. Light and very easy to navigate and use. I love the white more then the black color. I am glad I made the change.", "Date": "March 4, 2014"}, {"Title": "Not so happy", "Author": "Son V.", "ReviewID": "R3Q576UJOYK6ZZ", "Overall": "3.0", "Content": "This is AT&T; so i need to buy code to unlock to work version (it very costly). And it is not in good shape like buyer's information", "Date": "February 28, 2014"}, {"Title": "I don't recommend to a friend", "Author": "ekram", "ReviewID": "R2Q72ZEUPDFQL5", "Overall": "3.0", "Content": "It's not complete.a lot of staf was musing it was a givt but I am not happy with is iPhone 4S I don't recommend to a friend", "Date": "February 25, 2014"}, {"Title": "I don't recommend to a friend", "Author": "ekram", "ReviewID": "R2Q72ZEUPDFQL5", "Overall": "3.0", "Content": "It's not complete.a lot of staf was musing it was a givt but I am not happy with is iPhone 4S I don't recommend to a friend", "Date": "February 25, 2014"}, {"Title": "Good deal...financially, but", "Author": "Paul C. Peterson", "ReviewID": "R3DIZ8LJ4P6BPG", "Overall": "3.0", "Content": "It took a long time and a lot of help to learn how to use it......but I got it!  Finally!!", "Date": "February 25, 2014"}, {"Title": "Excellent condition, previously used iPhone.", "Author": "Edward P.", "ReviewID": "R1UFEM7GD7DNEC", "Overall": "5.0", "Content": "Newer looking, operating used iPhone. Great as a replacement w/o getting into new contract with att. Good battery condition and charger.", "Date": "February 25, 2014"}, {"Title": "excellent", "Author": "Amazon Customer", "ReviewID": "R1QF9GUWPSN8NN", "Overall": "4.0", "Content": "Thank you for your product! all as well as it was written in the description, I loved)Will be ordering more)", "Date": "February 23, 2014"}, {"Title": "excellent", "Author": "Amazon Customer", "ReviewID": "R2TPVZ6WCQ86I0", "Overall": "4.0", "Content": "Thank you for your product! all as well as it was written in the description, I loved)Will be ordering more)", "Date": "February 23, 2014"}, {"Title": "pretty good", "Author": "Honest Reviewer", "ReviewID": "RMFCJ8FQCG4B3", "Overall": "4.0", "Content": "no, its not an IPHONE 5, but its pretty darn good.  also, it is not 4g LTE apparently, but i haven't found slower texts/talks/data than my 4G LTE NOkia which was super slow and painful.", "Date": "February 18, 2014"}, {"Title": "Make sure AT&T; will unlock", "Author": "Jmark", "ReviewID": "R35SMLJMBJGJ9E", "Overall": "1.0", "Content": "AT&T; has told me in no uncertain terms they will NOT unlock this phone.  At this point it looks like I paid $200 for a phone that can't be use on any carrier.  AT&T; will not even allow it to go on their service either.  Came in good shape & relatively quickly, but cannot be used for the purpose it was purchased for.  I would highly suggest buying a phone that is unlocked.Also, since AT&T; drags their feet letting you know it will not be unlocked, I cannot even return the phone b/c the 30 day period expired.  Found the seller to be of very little help & slow to respond.", "Date": "February 18, 2014"}, {"Title": "It is locked", "Author": "bboc", "ReviewID": "R1NVVNOOQ7BNHJ", "Overall": "1.0", "Content": "Not mentioning how long it has been locked? Also it doesn't look 100% new. It must be a returned product or a refurbished one. So obvious", "Date": "February 17, 2014"}, {"Title": "Got exactly what I ordered", "Author": "Jack", "ReviewID": "R1HHHFPTVC2HOX", "Overall": "5.0", "Content": "The phone arrived quickly and was exactly as described. Pleased overall that the phone is in such great shape. Buying this phone was a joy.", "Date": "February 17, 2014"}, {"Title": "Awesome", "Author": "Zee", "ReviewID": "R2ZAQB277WUA5I", "Overall": "5.0", "Content": "Thank you so much . It is working so good. I love it !!!!!!! It is working so fine. Thanks", "Date": "February 16, 2014"}, {"Title": "iPhone 4", "Author": "Randy Reynolds Briggs", "ReviewID": "R2C8YJJZDDOC3A", "Overall": "5.0", "Content": "My teen smashed his other smartphone, and this phone was the only one that his SIM card fit into. He is THRILLED to finally have an iPhone, and we were thrilled with the price. It is in excellent physical condition, and works perfectly. The sellers were amazing, too.", "Date": "February 14, 2014"}, {"Title": "We'll worth the money.", "Author": "Jose", "ReviewID": "R39V3X8X1J84F1", "Overall": "4.0", "Content": "A bit of a learning curve, but not glitchy like other phones I've owned (android, windows).  My particular phone was in great condition.", "Date": "February 11, 2014"}, {"Title": "happy with the item", "Author": "Wilian", "ReviewID": "R36843S616IOKC", "Overall": "5.0", "Content": "customer service was really nice and cooperativethe phone came on time, it was a little problem on the set up of the phone but with the help of apple agent and the cooperation of the seller, everything went fineno problem on the activation,", "Date": "February 10, 2014"}, {"Title": "Like new!!", "Author": "Mandie Nicholson", "ReviewID": "R2P7YR77MQZWDS", "Overall": "5.0", "Content": "This is such a great phone! My husband and I both got one and we are so very happy with them!!", "Date": "February 10, 2014"}, {"Title": "Dissapointed", "Author": "guillotell83", "ReviewID": "R1FI7XGDVD8OAY", "Overall": "1.0", "Content": "The worst cell phone. There is an issue with the battery. After a couple of hours the battery is draining. The response was to send me 5 bucks for another battery, but I think i need a new cell phone because it is no working well. Totally disappointed", "Date": "February 10, 2014"}, {"Title": "All that I was looking for", "Author": "Hannah Pynn", "ReviewID": "R2IN37TI88MEWE", "Overall": "4.0", "Content": "Phone works as described...the only issue I keep having is it won't charge with my charger and my back up charger...so I've had to use my mom's iPad charger and it seems to be charging ok", "Date": "February 9, 2014"}, {"Title": "It was locked, so be careful.", "Author": "Nicole C. Fey", "ReviewID": "R2ZIRUDM1PW342", "Overall": "5.0", "Content": "Otherwise the phone is excellent.  But you will have to pay someone to unlock all these used iPhones.  If you want unlocked, you have to specify that in your search.", "Date": "February 8, 2014"}, {"Title": "Exactly As Advertised!", "Author": "Ray", "ReviewID": "RAGRY1BA5HK9M", "Overall": "5.0", "Content": "Great phone, came in the original box.  Brand new.  Phone is great, although the battery life seems short.  Must charge each day", "Date": "February 5, 2014"}, {"Title": "Not at and t", "Author": "Not happy", "ReviewID": "R2IOB9E6AKU8GV", "Overall": "1.0", "Content": "The iPhone was a sprint phone instead of AT&T.; The listing says at and t phone. So at and t store person could not help", "Date": "February 4, 2014"}, {"Title": "Exceedingly content", "Author": "Mamman", "ReviewID": "R3P6EHBPZY0T7Q", "Overall": "5.0", "Content": "I was hesitant to purchase a smart phone, fearing it would be too complicated since all I've ever owned were basic phones. Now I wish I had bought it a long time ago. It is very user friendly and intuitive. I love how I can ask it questions, dictate texts, and ask it to dial for me. I really like the navigation tool on it as well. It converts to using data on my wifi as soon as I'm in signal so I don't use a lot of data. This has been a very good phone for me! I love it!", "Date": "February 4, 2014"}, {"Title": "Exceedingly content", "Author": "Mamman", "ReviewID": "R3P6EHBPZY0T7Q", "Overall": "5.0", "Content": "I was hesitant to purchase a smart phone, fearing it would be too complicated since all I've ever owned were basic phones. Now I wish I had bought it a long time ago. It is very user friendly and intuitive. I love how I can ask it questions, dictate texts, and ask it to dial for me. I really like the navigation tool on it as well. It converts to using data on my wifi as soon as I'm in signal so I don't use a lot of data. This has been a very good phone for me! I love it!", "Date": "February 4, 2014"}, {"Title": "IPhone arrived quickly & works fine", "Author": "James Kinninger", "ReviewID": "RBS8Z4AO4ZV8G", "Overall": "4.0", "Content": "The product was as advertised and arrived in good working order.My issue is with Apple in that there appears to be no simple way to upload the pics from the phone to my iMac computer. Mind you I'm not a geek, however, when I plug my iPad into the iMac the pics are easily imported.", "Date": "February 2, 2014"}, {"Title": "It didn't go well.", "Author": "Robert Kelley`", "ReviewID": "R2A5RTXMZOCP2K", "Overall": "1.0", "Content": "The seller came highly rated, with assurances of quality checks before shipping, but the phone simply didn't work !  You could call out, but the receiving person couldn't hear you. Conversely, someone calling me couldn't hear me trying to answer. (BTY, this is the second of two phones bought via Amazon; both were defective, both returned for credit. I ended up buying a new phone from Apple, and doubt I will shop for a phone again through Amazon.)", "Date": "February 2, 2014"}, {"Title": "Amazing", "Author": "paige", "ReviewID": "R2WL1BD83K332A", "Overall": "5.0", "Content": "I'll be honset, I was a little sceptical when i first ordered this phone ( i figured it was going to be broken or a piece of crap or even never show up) but it works perfectly.  And i got it for a good price too.  ATT wanted 500 for the same phone and i paid about half of that! I love it!", "Date": "January 29, 2014"}, {"Title": "Sold a USED phone as a NEW phone!! Fradulent???", "Author": "Collette Pickett", "ReviewID": "R1V27Y6IBM8XLF", "Overall": "1.0", "Content": "I purchased a \"NEW\" Apple iPhone 4S from Andrew&Co.; What I received was a USED phone which I had to spend 8 hours with phone techs from Straight talk and Apple to get it working. I also had to pay Apple for the help since they told me this phone was bought Dec 2012 & no longer under warranty. The IMEI # on the box didn't even match the phone inside. Apple said everyone should check that. I have been told I have to pay to have it returned in order to get a refund. I didn't pay for shipping to get it here. I have asked for a $100 refund on my purchase since I do not want to have to go thru set up again. Andrew&Co; has refused to do anything to appease me. I consider this fraud.", "Date": "January 28, 2014"}, {"Title": "exactly as described", "Author": "allgmyes", "ReviewID": "RWSYHK1FQL3TI", "Overall": "5.0", "Content": "worked very well, unlocked as described and no screeches except on sides arrived when promised. was very pleased with this purchase!!", "Date": "January 28, 2014"}, {"Title": "Great phone", "Author": "Michael Sousa", "ReviewID": "R3I4NI7BADGBLM", "Overall": "5.0", "Content": "Love it. It's the best phone I ever had . Fast and easy to use. iPhone all the way. :)", "Date": "January 28, 2014"}, {"Title": "Iphonw", "Author": "Audric Chen", "ReviewID": "R21N7PJM9LVX9S", "Overall": "5.0", "Content": "There are so many apps on the app store battery wise i can use the phone for a full day without a problem and the phone looks great", "Date": "January 28, 2014"}, {"Title": "iPhone 4S", "Author": "Brittany", "ReviewID": "R2Y67QPIE4M5N4", "Overall": "4.0", "Content": "It's a good phone & a great deal. Although I had a problem with it they were willing to do whatever it takes to fix it.", "Date": "January 25, 2014"}, {"Title": "Excellent Doing Business", "Author": "Brooke Lawrence", "ReviewID": "R26RUOB5BRNQNY", "Overall": "5.0", "Content": "The Phone was everything he said it was. And it surprisingly came earlier than expected . It also had a cute wallpaper on the phone that said Merry Christmas. It was thoughtful of them.", "Date": "January 21, 2014"}, {"Title": "Excellent Doing Business", "Author": "Brooke Lawrence", "ReviewID": "R26RUOB5BRNQNY", "Overall": "5.0", "Content": "The Phone was everything he said it was. And it surprisingly came earlier than expected . It also had a cute wallpaper on the phone that said Merry Christmas. It was thoughtful of them.", "Date": "January 21, 2014"}, {"Title": "not satisfied", "Author": "tracy", "ReviewID": "R39NS0RD30QW1I", "Overall": "1.0", "Content": "Their was a manufacturer fault with the phone how can I return it back am a bit dissopoited because it was a Christmas gift for a friend", "Date": "January 21, 2014"}, {"Title": "its ok", "Author": "Dave", "ReviewID": "RWJHUUDBPZF1E", "Overall": "3.0", "Content": "Siri is fun but that's about all. The 4S is pretty laggy there is defiantly better phones out there that are at the same price.", "Date": "January 21, 2014"}, {"Title": "Broken", "Author": "Wayne Bush", "ReviewID": "R10ZR0V57GLTEX", "Overall": "2.0", "Content": "It does not work as good as I thought it should. I hAve sent a request through amozon but have not heard anything", "Date": "January 19, 2014"}, {"Title": "Iphone 4s", "Author": "Rachael Calia", "ReviewID": "R2Q81HKYBUGLNY", "Overall": "4.0", "Content": "I just purchased an iphone 4s 16gb.I have had issues with the volume.when headphones are in it works fine, but sometimes when no headphones no sound.I reset it and it came back.But it still goes back and forth from volume to no volume. Wondering if anyone else has had similar issues and if so do you know what I should do to resolve this.", "Date": "January 18, 2014"}, {"Title": "Great company", "Author": "customer", "ReviewID": "R1VE27W5NWUEUP", "Overall": "5.0", "Content": "If you are looking for a trust worthy legitimate place to purchase a cell phone or any other electronic I would recommend Sail Phones Ltd. Great customer service. solved all of my issues and questions I had about my product.", "Date": "January 18, 2014"}, {"Title": "iPhone 4S", "Author": "John Graham", "ReviewID": "R2FRDV7FTB57K7", "Overall": "4.0", "Content": "I purchased this for my 14 yr old daughter.  She loves it as it has much more to offer than her busted up iPhone 4.", "Date": "January 18, 2014"}, {"Title": "great", "Author": "jta", "ReviewID": "R153CT5INVAG47", "Overall": "5.0", "Content": "great phone glad I bought it I had a little trouble getting it to work at first but now it just fine", "Date": "January 16, 2014"}, {"Title": "the most unhappy shopping  experience", "Author": "liyong", "ReviewID": "R2L37QBJOEVTKI", "Overall": "1.0", "Content": "I bought a iPhone4s from the amazon in last month.however I'm terriblly disappointed with the item. becaus the IMEI of this iphone indicate that：013189006597997  is a serial number for a product that has been replaced .It means this iphone4s is not a new one，and there is no any product information about this iphone4s in the apple  official website.", "Date": "January 13, 2014"}, {"Title": "No doubt about it!!", "Author": "Stereo Fish", "ReviewID": "R4LRT3JUZ81UQ", "Overall": "5.0", "Content": "The phone came as advertised. In mint condition!! Practically NEW!! In my case I ordered a 16g & got a 32g after I got robbed for my phone! Christmas came early for me!", "Date": "January 12, 2014"}, {"Title": "I love my iPhone 4S", "Author": "IphoneuserAG", "ReviewID": "R2AMIF6HA4PY5I", "Overall": "5.0", "Content": "Back In august I got my iphone 4 s at AT&T; and I have loved it ever since . The desine is wonderful, ios is awsome and the phone it's self is really easy to use! I love it . I recommend this phone to anyone who wants a smart phone.", "Date": "January 8, 2014"}, {"Title": "Not completely as advertised, but good", "Author": "S", "ReviewID": "R25RNYY4ZEBIQE", "Overall": "4.0", "Content": "This phone seemed like it was taken care of pretty well--only tiny wipe scratches on the screen and it works fine. The only complaint would be that the power supply pictured in the advertisement was a big selling point for me (worth the extra $5), so I was disappointed when I got the little power adapter that takes *much* longer to charge with than the advertised large adapter.", "Date": "January 8, 2014"}, {"Title": "Great service", "Author": "DAPHNE VANNOY", "ReviewID": "R1C2RGCJPHDPXH", "Overall": "4.0", "Content": "I am very pleased with getting this quickly, the phone is  in excellent condition and I had no problem activating it. It did not come with a charger; thus the 4 star instead of 5.", "Date": "January 7, 2014"}, {"Title": "Awesome", "Author": "Terrence", "ReviewID": "R2F8LAWVZRXHBM", "Overall": "5.0", "Content": "A couple days with it. It's standing up pretty well I enjoy the iphone alot. And I hope to buy more in the future you should definitely get one.", "Date": "January 6, 2014"}, {"Title": "Great phone and service", "Author": "bradford wood", "ReviewID": "R1U05YEOV2MDF4", "Overall": "5.0", "Content": "I had a slight problem with the charger the little box that has the prongs that plug into the wall outlet did not work I contacted the seller and he sent a replacement for the phone fast no questions asked thanks for the great customer service and a happy wife with her new phone", "Date": "January 4, 2014"}, {"Title": "Great price however it's falsely advertised as a new product.", "Author": "Saman", "ReviewID": "R3KIY86HAOKTZM", "Overall": "4.0", "Content": "This was a great purchase however the advertisements are false. These iPhones are NOT new. They are refurbished iPhones that get sealed and are made to look as if they came from apple directly. The warranty is also not covered by apple but rather by the seller on amazon.The phone it's self was in excellent condition and I would buy it again if I had to. The iPhone was not unlocked and att denied to unlock it eventhough it was purchased out of contract since amazon is not an official retailer.", "Date": "January 4, 2014"}, {"Title": "i'm satisficed", "Author": "lerodriz", "ReviewID": "R2DRJSLTYYVWMJ", "Overall": "5.0", "Content": "this iphone is very good condition and working good enough for me. i like so much this cellphone. only \"bad\" thing is the battery, but  as i said, this iphone is in good condition.", "Date": "January 3, 2014"}, {"Title": "iPhone 4s", "Author": "Rafael", "ReviewID": "R2W9U51N5SR738", "Overall": "3.0", "Content": "It was a new iphone Although I was having some issues with it because it would not alow me to download any social media apps", "Date": "January 3, 2014"}, {"Title": "I didn't like this mobile phone", "Author": "Kindle", "ReviewID": "R2036BXBQ5Q2MJ", "Overall": "2.0", "Content": null, "Date": "January 3, 2014"}, {"Title": "Fully satisfied", "Author": "Kyle Geblein", "ReviewID": "RH0QXZF2Z0VSE", "Overall": "5.0", "Content": "It works perfectly, I haven't had any problems with it thus far. I love and strongly recommend this apple product.", "Date": "December 29, 2013"}, {"Title": "One Happy Daughter", "Author": "Janina Jones \"Mrs. Jones\"", "ReviewID": "R90FX9EBJHMTG", "Overall": "5.0", "Content": "My Daughter is extremely happy with her Christmas gift.  We received the package in a good amount of time prior to Christmas!", "Date": "December 26, 2013"}, {"Title": "Not new as posted... Out of Apples Warrenty (TABLET DISTRIBUTORS)", "Author": "Singam \"Singamsetti\"", "ReviewID": "R1B4PWJZ8LEDMM", "Overall": "1.0", "Content": "By looking at the packaging and speed of delivery, I felt this was an awesome product...After opening the package, now I regretted. An old product which was out of warranty from Apple was sent and can not even check with Apple regarding the Expire date (No technical Support over Chat as well).Also, this is a locked phone by AT&T; which is not mentioned anywhere in the description. Title mentioned about use with AT&T; carrier Only. But, not mentioned as a locked mobile.AT&T; declined my unlocked request as this mobile is not on my name and only original buyer can unlock it.Amazon should stop these sellers as they do not stand on their words as described with the product.I am seriously suggesting not to go with this seller (TABLET DISTRIBUTORS)", "Date": "December 26, 2013"}, {"Title": "Lv it", "Author": "rob", "ReviewID": "R306EM41XWNOMT", "Overall": "5.0", "Content": "I was a little scared but the phone is great. The condition was like new. Nothing fancy extras like approved power cord but everything works :)", "Date": "December 25, 2013"}, {"Title": "good phone and well kept", "Author": "Lis", "ReviewID": "R1X7ZZQ5XNSBSP", "Overall": "5.0", "Content": "I love it , and great quality ...excatly how amazon described it ..... Just like a brand new , I'm very happy with it", "Date": "December 23, 2013"}, {"Title": "Two great things in one", "Author": "Jerome Baxter", "ReviewID": "R2RBLNYZ4GUDMU", "Overall": "5.0", "Content": "It works like new I love it and my prepaid plan goes great with it. The best part is that it's compatible with my apps from my old iPod!", "Date": "December 20, 2013"}, {"Title": "Awesome Phone", "Author": "T. Hildebran \"Caleb's Mom\"", "ReviewID": "R2NS67F6UM9AUT", "Overall": "5.0", "Content": "I received the phone in a timely manner. The phone works great! No problems what so ever with it.  It made a great gift for my son's 18th birthday.", "Date": "December 19, 2013"}, {"Title": "att iphone", "Author": "Melissa Rose", "ReviewID": "R7WPYWY87AEBY", "Overall": "5.0", "Content": "Works wonderfully my daughter loves it she is on it from daylight to dark hope to do business with you again", "Date": "December 16, 2013"}, {"Title": "nice phone", "Author": "ShenAkuma", "ReviewID": "R1W1TDK30MPG4Y", "Overall": "4.0", "Content": "Its a very nice phone. It's got a very small and light scratch on the top screen, but not very noticeable especially when the phone is turned on it looks perfect.", "Date": "December 16, 2013"}, {"Title": "I phone 4 s", "Author": "Don Gerber", "ReviewID": "R3LUWAFKEP8VIH", "Overall": "5.0", "Content": "It does everything I was hoping for.  I just wish the batteries would last longer for more standby time.  I like it.", "Date": "December 16, 2013"}, {"Title": "My first iPhone", "Author": "Shannon", "ReviewID": "R2KD96O5S894GV", "Overall": "5.0", "Content": "This was my first iPhone and I love it! It does everything I need in a phone and it helps keep me organized.", "Date": "December 15, 2013"}, {"Title": "I am so happy with my phone!!", "Author": "Ana Perez", "ReviewID": "R6FGI8MTXU121", "Overall": "5.0", "Content": "I can't believed the phone was unlocked!!!. the price .. The best , the telephone look like a new phone, thanks for everything . I am so happy", "Date": "December 15, 2013"}, {"Title": "Behind the times", "Author": "Anwar", "ReviewID": "R1IBCXFI86E06J", "Overall": "4.0", "Content": "It's an iPhone! Quality product. Apple really is customer centric and has a lot of nifty little things that you wouldn't realize are helpful until you use an iPhone. Overall I really like it and it works has the new iOS 7. I should note that this is my first smartphone and I bought it right when android and windows phones finally caught up with the quality and innovation of iPhones.", "Date": "December 11, 2013"}, {"Title": "Great price, perfect phone!", "Author": "Patricia K. Holder \"Soldiers Mom\"", "ReviewID": "R17HL95RJBQGNA", "Overall": "5.0", "Content": "Looks like it has never been touched! I wanted new without the price and that is just what I got.", "Date": "December 11, 2013"}, {"Title": "Really nasty extreme", "Author": "williams cheng", "ReviewID": "R2RY0NN1TSRWY7", "Overall": "1.0", "Content": "Really nasty extreme ... actually I spent $ 429 to buy a refurbished Apple phone??? When I determined to out of the store with the purchase or because he has a good evaluation, but I was wrong .. .. my phone IMEI number is 012939004742149, the warranty period has expired and the phone has been to protect the front and back posted??, I strongly recommend that buyers do not tell potential buyers of this liar.", "Date": "December 8, 2013"}, {"Title": "Its not like new , lots of nick around it.", "Author": "wangxt", "ReviewID": "R2YMWH5LXZ8G5P", "Overall": "3.0", "Content": "It‘s att contracted phone and not “like new”, lots of nick around it.big sad is locked by att and I cant find a way to unlock it beacuse cant find original info of att.", "Date": "November 12, 2013"}, {"Title": "Great product ...", "Author": "sergio", "ReviewID": "R2P2B2XGDT9HY1", "Overall": "5.0", "Content": "Loved the iphone well its an iphone i think everyone does but it looks just as new just that i got to unlock it but it was great", "Date": "November 7, 2013"}, {"Title": "Great", "Author": "mhiestand", "ReviewID": "R1PNY5SIPNCH1H", "Overall": "5.0", "Content": "This phone is great. It looks so nice. Can't wait to give it to my son for Christmas . He will love it.", "Date": "October 31, 2013"}, {"Title": "Nice phone", "Author": "Jon Q", "ReviewID": "R3SGGLTVMN8BK4", "Overall": "3.0", "Content": "Unfortunately this phone arrived with the speakers blown, but I needed it and could not return it and be without. I would not suggest upgrading to the 7.03 OS, this phone is not designed to handle it.", "Date": "October 29, 2013"}, {"Title": "I need to change please", "Author": "tania islam", "ReviewID": "R36OD646B5CDDN", "Overall": "2.0", "Content": "This phone power bottn no work.whay u sele this phone.please I need to change this phone.u need to sele be nice", "Date": "October 24, 2013"}, {"Title": "I phone 4s", "Author": "Cory", "ReviewID": "R1ZO5YALPWCQBE", "Overall": "3.0", "Content": "It's okay. I bought it as opposed to restarting a contract with my phone company. I'm not a huge apple fan and I really don't like the ios 7 upgrade but I can live with it until I am due for a free upgrade and I will probably go with a Samsung at that point.", "Date": "October 9, 2013"}, {"Title": "i like it,i come from china, i buy it ,i am happy", "Author": "onlyygger", "ReviewID": "RQ4ZRQRI4VPNP", "Overall": "5.0", "Content": "i like it,i come from china, i buy it ,i am happy because i buy it ,thank you very much", "Date": "October 2, 2013"}, {"Title": "It's grate !! :-)", "Author": "Richard DeLashmit", "ReviewID": "R3M7EVFRY5ZVFH", "Overall": "5.0", "Content": "It is every thing I hoped for and more it got hear in a short time and the price was good to !!! ;-)", "Date": "September 5, 2013"}, {"Title": "Good", "Author": "chantelle", "ReviewID": "R29PZX8MLYSXXK", "Overall": "3.0", "Content": "Got the phone on time and it was not exactly as discribed but i can work with it.....so far so good no problems I'm happy with what I got", "Date": "August 15, 2013"}, {"Title": "Excellent", "Author": "M4NSW3R", "ReviewID": "R2T5JE82B0YALC", "Overall": "5.0", "Content": "I love this phone i previously had an iphone 3gs and this is way better and it was an outstanding price. I recommend this there isnt a better deal.", "Date": "August 4, 2013"}, {"Title": "i am a happy camper", "Author": "Ileana", "ReviewID": "R87MJYJQDGF8D", "Overall": "5.0", "Content": "Very happy with my new phone, it's perfect!!! Everything works amazingly and i am a very very happy camper. :]", "Date": "June 18, 2013"}, {"Title": "Great love it", "Author": "Jose G Rivera", "ReviewID": "RL6K3T3OVSSYP", "Overall": "5.0", "Content": "Just as they said I love this is my first iphone and I am very very happy that I made this  choice  this phone is in perfect condition  nothing negative to say o bout it Thank you very much.", "Date": "May 19, 2013"}, {"Title": "I PHONE 4s", "Author": "Kelsie", "ReviewID": "R2A9NWX78YO38H", "Overall": "2.0", "Content": "I will say i bought a used phone.But, the phone i received was in horrible condition.i paid way  more then what this product is worth.I received the phone expecting some scratched and nicks here and there which was fine because it is used.But the phone does not even work like a phone should work! the earpiece speaker is messed up and i cannot here anything when anybody calls! if i cant make phone calls, then there is no point in having a phone and i might as well just get a tablet.If you buy a used iPhone 4s from this seller, maybe your luck will be different and you may get one in better condition, but be advised that this seller is not guaranteeing a fully functional phone.", "Date": "April 14, 2013"}, {"Title": "just had to have it", "Author": "kat2ray", "ReviewID": "RZQOCMESKPKUN", "Overall": "5.0", "Content": "just had to have it even though my upgrade was not for another 6 months got it early worked great and then when my upgread came up got me the samsung and gave this one to my hubby he was happy too", "Date": "April 10, 2013"}, {"Title": "Good phone, its an iPhone.", "Author": "JM", "ReviewID": "RJ38GZNIE6RY3", "Overall": "5.0", "Content": "This rating goes to the seller. i loved the phone it came in good condition and almost new. the reason why it took me so long to do a review is because i wanted to use the phone for a while. so far the phone is still in good shape and looks like it will stay like this for a longer period of time.", "Date": "April 3, 2013"}, {"Title": "WRONG ITEM", "Author": "jcampbe16", "ReviewID": "RHK0L3ZUTUJ6D", "Overall": "2.0", "Content": "The iPhone I got was at my door in two days! I was very impressed, until I opened the box and popped out the Sim Card. Verizon iPhone, not AT&T; like the description would suggest. Phone was in amazing condition, and I'm so mad to have to send it back!!", "Date": "March 23, 2013"}, {"Title": "VERY VERY GREAT", "Author": "maria", "ReviewID": "R355DFGEUIBETB", "Overall": "5.0", "Content": "it new and it works like new just how i wanted it and it is amazing there ant not dents on it", "Date": "March 19, 2013"}, {"Title": "RECIBIDO", "Author": "Adelis Alvarado", "ReviewID": "R19KSR032B7UV3", "Overall": "5.0", "Content": "EXCELENTE VENDEDOR REALIZARE MAS COMPRAS EN EL FUTURO, QUEDE SATISFECHO CON EL PRODUCTO Y HARE RECOMENDACIONES A TODOS LOS AMIGOS", "Date": "March 11, 2013"}, {"Title": "Performance issues out weigh the positives.", "Author": "Earl sturgis", "ReviewID": "R1Q0O9Q7139CIQ", "Overall": "3.0", "Content": "First, I did not purchase this phone through Amazon, but rather, the AT&T; store.  When I first purchased the phone, I couldn't turn the phone off-which is a hassle in museums and movie theaters.  I took it into the apple store and got it replaced about six months later.  Unfortunately the  new phone wouldn't connect to wifi.  It wasn't even an option since the wifi button was grayed out.  I took it in and got it replaced-no problem.  The phone that I received has connectivity problems with the Internet as well.  It shuts off every couple of hours.  However, I haven't troubleshooted the problem on my own yet.  It's a problem because it disconnects randomly and has caused me to come close to going over the allotted data time.  I guess at this point, having an iPhone isn't as interesting as it used to be, because I think in the past I would have just put up with it.  Now, I find that I would prefer to try another phone company.", "Date": "March 6, 2013"}, {"Title": "Amazing!!", "Author": "O. Lawson", "ReviewID": "R3DNRI3EGIFF1G", "Overall": "5.0", "Content": "Very Clean.Amazing!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!•An explanation for what you liked or disliked about the product •Product pros and cons •Facts and feature details •Comparisons to similar products", "Date": "March 6, 2013"}, {"Title": "Its good", "Author": "Madhu", "ReviewID": "R2H58O0UHPQ6CJ", "Overall": "4.0", "Content": "I purchased this for one of my friend and they loved it. Its defnitely cheaper than the places i have checked outside.", "Date": "March 5, 2013"}, {"Title": "Getting out of fashion ?", "Author": "rpv", "ReviewID": "R26I4BVKBZUI3Z", "Overall": "3.0", "Content": "When iphone came in it was a big hit. Slowly many other vendors became popular and Samsung has become an undisputed king at least as of 2013. I have been using smartphones since 2005. Tmobile Dash, and several others had Windows Mobile OS. Vendors like handango used to sell mobile apps through a webfront. Apple make everything easy and then came Android.Iphone4S is heavy and screen feels tiny. I have a Galaxy Note 2 as another phone and iphone 4S is no match. The apps all look small. Only advantage I see is the UI still slick, though not having a BACK button is a big disadvantage. I understand Apple has its fan base, I wanted to try. I am going to resell it and stick to Samsung for now. Even Samsung Galaxy SIII Mini is 4\" compared to iPhone 4S which is 3.5\"", "Date": "February 28, 2013"}, {"Title": "Great phone", "Author": "Noella Carmichael", "ReviewID": "R2QICGI7X5CFEU", "Overall": "5.0", "Content": "I've had an iPhone before (3G) but it was at its time where everything basically stopped working at once, so I got a cheap android phone that I could not stand. I had that phone not quite a year and I hated it. I also had to get a phone like this because I was switching my phone plan to something cheaper so it worked out very nicely. It works great so far, no issues so this iPhone is getting 5 stars from me.", "Date": "February 5, 2013"}, {"Title": "great price and great phone", "Author": "Agustin Gualmes", "ReviewID": "RETK3GH7WUN17", "Overall": "5.0", "Content": "the purchase of this phone was a great investment. It looks in great shape and it works excellent. I am really happy with my purchase", "Date": "February 3, 2013"}, {"Title": "Cracked", "Author": "Kate", "ReviewID": "R1ADRLDB1YQ4MF", "Overall": "1.0", "Content": "Picture was not the same as what was delivered. Front of phone was all cracked. Kept the phone an had whole new face replaced.", "Date": "January 26, 2013"}, {"Title": "Work like charm", "Author": "Fadi Muheidat", "ReviewID": "RD6NB23IIFGK", "Overall": "5.0", "Content": "Still using it , and all works fine .. It iwas expensive a little bit  , but  having it workng like charm will compensate :)", "Date": "January 13, 2013"}, {"Title": "The home button is too much sensitive, when I click, it will double click", "Author": "Blade", "ReviewID": "R3O8ORUO1E7P04", "Overall": "3.0", "Content": "I don't think it's Like New, should be Good at most.The home button is too sensitive, so I have to replace it.and there are some scratches on the metal frame.So, I'm disappointed.", "Date": "January 9, 2013"}, {"Title": "Nice one as described.", "Author": "Haitao Yao", "ReviewID": "R17K4CDYDDQVAE", "Overall": "5.0", "Content": "Like new means that you can hardly tell it from a brand new one. The phone I received is as described.", "Date": "January 3, 2013"}, {"Title": "excelente compra", "Author": "jonathan cedeno", "ReviewID": "R21YGIAB9VXRF7", "Overall": "5.0", "Content": "buen producto, practico, útil, sencillo, de fácil manipulación, duradero, buena calidad, cubre todas las necesidad para las que fue diseñado.", "Date": "December 29, 2012"}, {"Title": "Apple iPhone 4S 16GB (", "Author": "Carlos", "ReviewID": "RJFKEUEZ7AFVU", "Overall": "4.0", "Content": "So far I like it, fast internt concction, still do not know all its features, nice camera on both sides", "Date": "December 16, 2012"}, {"Title": "Great Product", "Author": "Yokasta", "ReviewID": "R2753WJ53ADLV1", "Overall": "5.0", "Content": "I love my new phone! Was in practically mint condition & included everything stated. Very pleased with the outcome of my purchase!", "Date": "December 12, 2012"}, {"Title": "nice product and I like it", "Author": "signed by Efren", "ReviewID": "R3NV0PUEXYF5N9", "Overall": "4.0", "Content": "awesome when I received mi iPhone 4s thanks a lot  I looks as new. and I get it in an excellent price.", "Date": "December 10, 2012"}, {"Title": "Love IPHONE 4S (ATT)", "Author": "Ann", "ReviewID": "R3L0VI18SJ463V", "Overall": "5.0", "Content": "I upgraded from the iphone 4 to the iphone4s from ATT in September 2012, and it is the best iphone yet! ATT has great service in my area and I must say the iphone 4s works great as well. I would recommened anyone try the Iphone 4s from ATT!", "Date": "December 10, 2012"}, {"Title": "Good, as expected", "Author": "JR", "ReviewID": "RCDLXYRPEN125", "Overall": "5.0", "Content": "It was as expected and described. It is a gift so i will not have a chance to use it.  Thank you", "Date": "December 5, 2012"}, {"Title": "price", "Author": "Rodrigo", "ReviewID": "R3NGEB6AVT0AVD", "Overall": "1.0", "Content": "the price placed on this phone is outrageous. you can get a brand new iphone 5 16GB phone unlocked from the apple qebsite for the same price", "Date": "December 4, 2012"}, {"Title": "Apple Iphone 4S 16 GB - great product", "Author": "pini Weinberg", "ReviewID": "R1BCMHD89VJ1E1", "Overall": "5.0", "Content": "Apple 4S - anything possible beside making your coffee in the morningFast, and real good tool to hold - recommanded", "Date": "November 25, 2012"}, {"Title": "Love it", "Author": "doggies \"Marci Norman\"", "ReviewID": "R2XVCL6ZJT1FGB", "Overall": "5.0", "Content": "Love it! I must be one of the only hold outs for getting an iPhone.  I love SIRI. I only wish she understood me a little better", "Date": "September 26, 2012"}, {"Title": "what's not to love)", "Author": "Yojalma M M \"_.-PHOTO-._\"", "ReviewID": "R2BH54SZF2XB2P", "Overall": "5.0", "Content": "A big selling point was the durability of the phone! I don't want to be freaking out if my phone falls by accident! This will happen to anyone... this phone has Proven to be awesome on the built of it. The features are all great. Too. I have always been a blackberry and an assortment of android powered phones owner. They will remain in my past now. I do miss the Facebook integration on both of those phones. I will just upgrade to iphone 5, problem solved.Excuse my mechanics and grammer :S", "Date": "September 18, 2012"}, {"Title": "Great Phone", "Author": "smeltn", "ReviewID": "R2RMLLNFP0I4Q1", "Overall": "4.0", "Content": "I upgraded to this from the iPhone 4 the first day it came out. I have to say, while it was just a small upgrade from the 4. The upgrades are very nice. Love the camera quality. Honestly I have never been much of a camera person, never used to take a lot of photos, but I find myself doing it all the time now. Not only due to the great quality camera this thing has but also because of the ease of sharing, and photo stream. I can take them on the phone and edit them at home on my iPad or my Macbook or even my PC, since there is an iCloud app for the PC.Siri is nice and all but the only reason I use \"her\" is when making a phone call using a bluetooth headset. I think it will be much better with iOS 6 though.Definitely recommend getting this product. I know my wife can't wait to get mine once the iPhone 5's come out.Only cons is, it looks JUST like the iPhone 4. Which is a good and bad thing. Good because 99% of the cases and accessories work on the 4s, but bad because you as well as others don't know if you have a 4 or a 4s or not.", "Date": "August 29, 2012"}, {"Title": "Brand new!!", "Author": "Pinkadri", "ReviewID": "R35ZHL6WF3VSNA", "Overall": "5.0", "Content": "I was very happy with the product. It looks brand new and plus everything came in the box as promised. Fast delivery as well. Love it!", "Date": "July 19, 2012"}, {"Title": "Beware Wrong Listing?", "Author": "Amazon Customer", "ReviewID": "R25YPO1KKNIH64", "Overall": "1.0", "Content": "The ASIN: B005SSB0YO  is for Model: MD237LL/A which is to my best knowledge for the Unlocked White 16GB US version of the Iphone 4S. (Google web search confirms) Amazon recommendations also provided a link to this listing as unlocked. I see the product description says locked to AT&T; now? but as the ASIN: should be unique to a specific model it cannot be locked....  Is their any one that can correct me on the model MD237LL/A being locked to AT&T;The suppliers apparently do not ship this model number. Is this right / Legal, If I accept the listing I have entered into a contract to receive Item as per ASIN.They are thus not supplying the correct model as per unique ASIN. They only offer refund if returned. They should actually supply the correct model as replacement as the ASIN: under which listing is done is for the unlocked version.The suppliers have separate listing with correct ASIN numbers for the full range of Iphones, are they trying a quick one..?I have ordered and await to see what model will be delivered? and if they will correct their mistake.", "Date": "January 6, 2012"}, {"Title": "Don't buy anything from this place", "Author": "JC", "ReviewID": "R22B1JZ34GVSRO", "Overall": "1.0", "Content": "Took too long to ship, shipped product is an open box item and is different than they've advertised. Don't recommend buy anything from this place.", "Date": "February 15, 2012"}, {"Title": "Is it a locked phone?", "Author": "David", "ReviewID": "REEIGE220Q59L", "Overall": "2.0", "Content": "With out indicating whether it's locked or unlocked, I guess it is a locked phone, right? Please let me know if it's unlocked.", "Date": "December 25, 2011"}, {"Title": "Absolutly terrible.", "Author": "Julianne Collins", "ReviewID": "RMTXAVC39GDMI", "Overall": "1.0", "Content": "Not only did I just waste $250 dollars trying to buy a new phone from theses people but I wasted about 2 weeks of my time. I e-mailed them three times after they never sent me the phone & now I'm not so sure I will even get my money back. I partly blame amazon for not doing the research they should have when allowing themselves to do business with these people. I highly recommend you don't buy anything from this service and are very carefully about what you buy off of this website.", "Date": "August 5, 2013"}, {"Title": "Poor delivery", "Author": "luisaortiz", "ReviewID": "RESHDQZIX2CRB", "Overall": "1.0", "Content": "Purchase 2ea 4S IPhones. iPhone 1 was registered under other name. non-Apple charger,not working. iPhone 2: non-apple earphones not working. iphone boxes do not match Iphone imeis.", "Date": "June 17, 2013"}, {"Title": "Poor delivery", "Author": "luisaortiz", "ReviewID": "RESHDQZIX2CRB", "Overall": "1.0", "Content": "Purchase 2ea 4S IPhones. iPhone 1 was registered under other name. non-Apple charger,not working. iPhone 2: non-apple earphones not working. iphone boxes do not match Iphone imeis.", "Date": "June 17, 2013"}, {"Title": "help", "Author": "Erik Paravisini", "ReviewID": "R28CA0CP274OYS", "Overall": "5.0", "Content": "Exellent product, i need a favor from you, i need unlock my phone, can you help me?? please.... i live outside of usa and i need unlock my phone to i can use in my country,i will wait your help, contact me please. best regards", "Date": "December 18, 2013"}, {"Title": "Excellent Rating on iphone purchase from this seller. Product is new as advertised.", "Author": "Michelle", "ReviewID": "R1AJJIWNL1QOYW", "Overall": "5.0", "Content": "Product was a brand new iphone 4s, 16GB as advertised and reasonably priced with all accessories.  Phone unlocked quite easily.  I highly recommend this seller.", "Date": "November 23, 2013"}, {"Title": "Love the phone!", "Author": "Mike", "ReviewID": "RAS1XNEDYWZE0", "Overall": "5.0", "Content": "Bought it used on here for cheap and I was able to even repair the problems with it for less than getting a new one! Not bad!", "Date": "April 26, 2013"}, {"Title": "Iphone 4s", "Author": "Alex and Danielle", "ReviewID": "R26M9SNX7U8M56", "Overall": "5.0", "Content": "The iPhone is the best phone you can see and get my friend loves her iPhone so much it's the best phone ever", "Date": "April 7, 2013"}, {"Title": "It was good.", "Author": "O. Lawson", "ReviewID": "RGP6K5IJAH10H", "Overall": "5.0", "Content": "Very Clean.Amazing!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!•An explanation for what you liked or disliked about the product •Product pros and cons •Facts and feature details •Comparisons to similar products", "Date": "March 6, 2013"}, {"Title": "Another Wi-Fi Disaster from Apple", "Author": "Music Is Everything \"Music Is Everything\"", "ReviewID": "R1TC2A7RJ1NCJ7", "Overall": "2.0", "Content": "The iPhone 4S is a great idea poorly executed.  Like the iPhone 4, which sparked a class-action lawsuit over its poor wi-fi antenna, the iPhone 4S is dogged by thousands of blog postings and reviews all over the internet that expose a serious problem with its wi-fi abilities.  The 4S is really a small computer, with Apple's endless offering of apps and very good voice control via Siri, but all of that causes massive data usage.  Unless you have an unlimited plan, you really need to use wi-fi as much as possible to avoid overages.  Perhaps even more important, the phone is much slower in 3G or 4G than on wi-fi, and you can't update the operating system unless the phone can access wi-fi for the massive download (unless you hook the 4S up to a computer, but then the update often fails multiple times before completing, causing hours of lost time).Despite Apple's reputation for innovative products, they also have a well-deserved reputation for ignoring these types of problems.  Despite all the blog entries in their own forums, Apple hasn't acknowledged this problem or offered any solutions (other than buying yet another phone, of course).Having used the 4S for over a year, I can say that it WAS a big step forward from my previous phone, but if I had known about the wi-fi issues, I would have bought something else.  As it stands now, I'm very unlikely to purchase another iPhone because of these persistent problems and Apple's complete lack of customer support.", "Date": "February 21, 2013"}, {"Title": "IPHONE IS NOT AT&T;", "Author": "Lana R. Paulsen \"lpaulsen\"", "ReviewID": "R224F1AY5TH3OZ", "Overall": "1.0", "Content": "This phone is VERIZON.  It is very upsetting to wait for an iphone and then when you receive item, it is the incorrect phone.  Paying this much for a phone and getting the wrong phone that you paid for is beyond upsetting.", "Date": "February 13, 2013"}, {"Title": "Beware of this phone and Beware of replacement phones", "Author": "James M. Bailey", "ReviewID": "RA83ZKHERZ3GR", "Overall": "1.0", "Content": "Beware of Apple 4s phones.  We have had a lot of problems with my wife's phone and its replacement.  Read on if you like to hear of my experiences with Apple customer service.My wife purchased this phone and it worked okay until I installed a wireless system in my home.  My Galaxy III had no problems finding the network (nor any problems, I highly recommend it), nor did any of my computers.  However, her phone would not see the network.  We chatted with Apple support numerous times to no avail.  Finally, they said they would send a placement phone, a refurbished one (Beware of such phones).  Also, I had to guarantee we would return the old phone with a $450 charge to my credit card.The refurbished phone finally arrived and on the third day it would not power on.  However, when placed on a charger it would work but would not charge past 30%.  Again, after several phones calls they decided that this phone was defective.  The tech person said he would have a brand new phone sent and seem surprised that I was not excited over this.  The original phone was less than 9 months old.  However, he could not authorize this and I would have to wait another day for another person to phone to set up the delivery.This person phoned the next day and also seemed surprised that I was not delighted in the fact they would be sending me a new phone.  She explained in 4 to 5 days I would receive the new phone and would again charge my credit card until they received the old phone.  When I complained about some compensation for my trouble with their defective products she seemed surprised that anyone would ask such a thing of Apple.  She made a vague offer of some inexpensive accessory.So we are currently without a phone unless it is plugged into a charger.BTW, from my recent experience you will find all of the Apple people rather sickening in their \"sweetness\" and use of phases like \"have a perfect day\" or \"that is just perfect of you\".", "Date": "January 12, 2013"}, {"Title": "Bad things in Amazon sell", "Author": "Bhadra Rai", "ReviewID": "R1IRX4H88P1XU4", "Overall": "1.0", "Content": "I Apple iPhone 4S 16GB (White)  from Amazon. When I took to get new phone number they said, it ia stolen from somebody.Pleasem let me know,how can I return this phone..I brought many thing from Amazon but like this.", "Date": "January 4, 2013"}, {"Title": "Unlocked?", "Author": "Meliksah", "ReviewID": "R3Q89PZREE5EEX", "Overall": "3.0", "Content": "I have to learn is it factory unlocked or not? You didn't mention it that means you lost many customers..", "Date": "December 19, 2011"}, {"Title": "Customer service is horrible", "Author": "Paul Shaw", "ReviewID": "RSS22J8Y27ZX0", "Overall": "1.0", "Content": "I bought an iPhone 4s and after 3 months the audio jack failed. I called Apple and they said I needed to pay them $500 for them to send me a replacement which they would refund after they received my phone. I was not willing to let them hold my money hostage for an expensive item that I already paid for and was under warranty. They said I could walk into any store and they would exchange it for me. I live more than 300 miles from the nearest Apple store but was taking a trip near one so I dropped by the Walnut Creek store in California. Once I arrived I was told that no you can't just drop by and must have an appointment. I explained that I was from out of town and that Apple support told me to just drop by, I have an open case number and won't be around for long. They refused to exchange my phone and said they could give me an appointment in a few days. My expensive Apple iPhone 4s is broken and I can not exchange it. Thanks Apple. I will make sure that I never purchase another Apple product, customer support and service is horrible. You make enough money and should repair or replace a product I paid for and is under warranty. Buy a Droid instead.", "Date": "December 16, 2012"}, {"Title": "Locked to At&T; - wrong listing!!!", "Author": "Lambot", "ReviewID": "R3VNG334ZH0QNM", "Overall": "1.0", "Content": "It's locked to AT&T;, but listed as Unlocked! Now i need to return it, because i intended to use it outside of US!", "Date": "February 28, 2012"}, {"Title": "Cellular didn't work", "Author": "Melbin O.", "ReviewID": "R1XI12SIWOGK74", "Overall": "1.0", "Content": "Because that phone did not work, has a Sirius problem in the screen, I wrote to the seller, and she told me, that she has nothing to do about it, because she said has an issue, I think issue is a little problem, not means that didn't work at all.", "Date": "November 23, 2013"}, {"Title": "Should be free", "Author": "Nicholas", "ReviewID": "R2JPBQ0AE87FV0", "Overall": "2.0", "Content": "The iPhone 4S should be free. That is the deal you are given on the apple website. It is just unfair.", "Date": "September 15, 2013"}, {"Title": "Crap", "Author": "sapper_pointman", "ReviewID": "R1AAP28KD09T1W", "Overall": "1.0", "Content": "Originally I bout a evo one x. It crapped out after a month would not even turn on. Took it back and they let me exchange it for the apple iPhone 4S. I had it for 6 months and it worked great. But after my first software update the wifi stopped working or would only turn on when it felt like it. I took it back and they said I had to take it to the main store in town. For me town is over an hour away. So I just kept it with its crappy wifi. Then after 3 months of t doing its own thing I updated the software again and it stopped working completely. I've tried every thing you can to get it to work but it doesn't and I read online that I'm not the only one with this problem. I would say apple sucks! Don't waste your money on it. Get a galaxy 2 that's way better.", "Date": "July 13, 2013"}, {"Title": "Amazon shows this under UNLOCKED", "Author": "LB", "ReviewID": "RR2QB8LX1VDIR", "Overall": "1.0", "Content": "Why does anybody sell a LOCKED iPhone these days?  Amazon has a category for UNLOCKED cell phones which is what I was searching under (don't know if they have one for locked or not, why would they?) and I mistakenly bought this one.  ATT gladly unlocks your iPhone for free if you just call.Amazon really needs to distinguish between LOCKED and UNLOCKED cell phones.  Heck, I can't even search iPhone 4s or 5 easily, they all just jumble together with iPhone 4 and 3G.Thinking about sending it back before I have to pay someone to unlock it for me.  Who knows if it is a legitimate ESN or not at this point?", "Date": "January 18, 2013"}, {"Title": "iPhone 4S (16GB)", "Author": "V. White", "ReviewID": "RO1NNN1TKKY65", "Overall": "4.0", "Content": "Very nice! In excellent condition as far as the amount of wear is concerned. Love the voice text feature!! It doesn't mute however, so I'm getting woke up at odd times with text messages. Not too happy about that part...need my sleep! Other than that, it's a great phone!", "Date": "June 4, 2014"}, {"Title": "The worst product ever created.", "Author": "K. Desgrosseilliers", "ReviewID": "R2Q00P5B5ZTIRE", "Overall": "1.0", "Content": "I am only giving this product one star because Amazon will not allow me to give it zero stars.  If you want a phone that is shiny and has a ton of apps that work online buy this phone.  If you want a phone that has reliable service, do not buy this phone.  If you want a phone that can actually be used without breaking, do not buy this phone.  If you want a phone that requires a ton of accessories to make it practical, buy this phone.  If you want a phone provided by a company that could care less about it’s product and just wants to milk money out of its customers buy this phone.  The iPhone is the most overrated, impractical and delicate device I have ever owned.", "Date": "April 18, 2014"}, {"Title": "Apple handcuffs u to their software and forces things upon u!!!! Don't buy!!!!", "Author": "David11357", "ReviewID": "R1XS49LKVTLP88", "Overall": "1.0", "Content": "First off if u want to do any kind of downloading with anything besides iTunes U have to download a 3rd party app and it isn't visible to your apple software once u download it. U have to download apps to play it next. U cannot access ur file system thru windows u have to use iTunes hence the proprietary software handcuffing comment. It is a huge pain in the a**. Apple is forcing their products on the consumer. If u value the ability to do as u please with ur phone DO NOT purchase an iPhone of any kind. And don't get me started on IOS 7. Automatically downloaded w/o my approval and now my phone is slooooooowww. Apple made it where u cannot undo the update so that you'll get sick of the slow speed and update to the 5s thus putting more money in their greedy pockets. Same reason that they didn't put sd card capability into the phone. So they can charge u $150-$200 more when u could get a comparable amount of storage from a $25 sd card. Basically Apple is trying to get into ur pockets at every turn. They have some cool stuff but it absolutely isn't worth the loss of freedom. Currently trying to sell this piece of trash or trade for an android. But if u need apple to babysit ur phone like a child u might like it. I've heard of stranger things", "Date": "April 11, 2014"}, {"Title": "if you sell this trype of phone.you have to say it is LOCKED ,O.K.The phone can not be used .if it is locked.", "Author": "john vanderer", "ReviewID": "R1T3FPUOOG56JL", "Overall": "2.0", "Content": "I cannot use it in Europe,it is locked,please fix it now,so I can use it in Europe,you did not say it is locked,please give me the unlocked code NOW,thank you,I am waiting for the unlocked code,so I can use the phone,please send the unlocked code now", "Date": "March 31, 2014"}, {"Title": "wrong all", "Author": "Carlos Penedo", "ReviewID": "R3E390NXMB96WE", "Overall": "1.0", "Content": "the iphone is locked, the color is wrong and don't sound. what kind of people sold here? i want my money, these people don't know how to sell", "Date": "March 15, 2014"}, {"Title": "USED I PHONE 4 S SOLD AS NEW", "Author": "Mark Donaldson", "ReviewID": "R1VO7XPFOPNQ84", "Overall": "1.0", "Content": "THIS PHONE WAS LISTED AS NEW IN FACTORY SEALED BOX.  THE HOME BUTTON WAS DEFECTIVE, THE SPEAKERS HAD BEEN TAKEN OUT AND REPLACED, AND THE PHONE HAD BEEN OPENED AND THERE WERE SCREWS STICKING OUT OF THE BOTTOM.  THE AT & T DEALER LOOKED UP THE SERIAL NUMBER AND IT HAD BEEN REGISTERED TO SOMEONE ELSE.  THE DATA WOULD NOT ACTIVE BECAUSE THE SERIAL NUMBER HAD ALREADY BEEN REGISTERED.  I WANT MY VISA CARD REFUNDED FOR THE FULL PURCHASE PRICE.  THIS WAS A BIRTHDAY GIFT FOR MY DAUGHTER'S SIXTEENTH BIRTHDAY!  I HAD TO GO OUT AND BUY ANOTHER PHONE JUST TO HAVE ONE TO GIVE HER.  THIS COMPANY IS CLEARLY FRADULENT.  I WILL NEVER BUY ANY ELECTRONIC ITEM FROM AMAZON AGAIN.", "Date": "March 11, 2014"}, {"Title": "Everything was the Bomb!!!!!", "Author": "S. B.", "ReviewID": "R31DUL4FFMLVT9", "Overall": "1.0", "Content": "But then slowly as days proceeded things one by one stopped working 1st was the ear piece.Which was the main reason, my son went to Amazon, looking for an Iphone.We went to a local shop, they said whole mother board needed to be replaced.After trying so many different avenues, we finally decided to trade it in there for 8gb less.Live and learn. My son not totaly happy but settled for now until he can raise the money for another.", "Date": "March 6, 2014"}, {"Title": "Not unlocked", "Author": "Felipe Paillot", "ReviewID": "R3HGD17T243XYL", "Overall": "1.0", "Content": "As everybody said this iphone is NOT unlocked. Now I am in argentina and i cannot use it or return it. I don't know what to do, but i am really disappointed with amazon. If any of you have a solution for this plis comunicate with me.", "Date": "March 5, 2014"}, {"Title": "IPHONE 4s Used + Blocked Be aware!", "Author": "andre ricardo schulz da conceicao", "ReviewID": "R2Y8PK2SN0T8Y6", "Overall": "1.0", "Content": "The Iphone 4s was USED, in my order says NEW, I bought to use in Brazil, I was surprise at the moment to use, because thePhone was locked, the Iphone 4s came to my hand ONLY THE Phone, NOT Charger Cable, NOT HeadPhone & NOT BOXING!! I was surprise when I receive my NEW phone, I feel cheated Because this is the more expensive USED phone that somebuddy can buy!", "Date": "March 3, 2014"}, {"Title": "very bad", "Author": "Astrid", "ReviewID": "R15EQ45UHBG1U1", "Overall": "1.0", "Content": "unfortunately the product does not work, will not start, does not work, I feel deceived, cheated, if amazon can help appreciate", "Date": "March 2, 2014"}, {"Title": "It had false information on the sales board", "Author": "NBP", "ReviewID": "R1KBLNNLR6TRW7", "Overall": "1.0", "Content": "It said unlocked and its locked, so what I bought it for doesn't fit. Now I don't know what to do with this item", "Date": "February 18, 2014"}, {"Title": "LOVE IT!!!", "Author": "michael conlan", "ReviewID": "R1H2T6D0S8D2KF", "Overall": "5.0", "Content": "The price was right... Arrived when they said it would (5-7 days) Received prior to Christmas - My Daughter is VERY HAPPY with her new iPhone 4S 16GB. Would recommend to anyone that needs a new phone", "Date": "February 13, 2014"}, {"Title": "Poor Battery", "Author": "Ashley Kornegay", "ReviewID": "RSW15ESX765SX", "Overall": "3.0", "Content": "The Phone I Got Has A Bad Battery Life Nd Cuts Off Even Tho It Says I Have 13% Left", "Date": "January 28, 2014"}, {"Title": "GREAT CELL PHONE", "Author": "Sad", "ReviewID": "RZF5I4RWYZ1U1", "Overall": "5.0", "Content": "CHECK THIS YOUTUBE VIDEO FOR A BETTER REVIEW VS GALAXY S4http://youtu.be/fGqeZxOqKhgCHECK THIS YOUTUBE VIDEO FOR A BETTER REVIEW VS GALAXY S4http://youtu.be/fGqeZxOqKhg", "Date": "January 10, 2014"}, {"Title": "I paid for new iphone and received a used phone..", "Author": "MANUEL ONGSING", "ReviewID": "R1SVZPLNDL21UI", "Overall": "1.0", "Content": "I purchased an I phone 4s, it was advertise as new, I paid for the price of new, but instead I received a used phone.  It works fine but the ad is very misleading or call it fraud.", "Date": "April 12, 2013"}, {"Title": "responsablidad", "Author": "jeffrey piña", "ReviewID": "R30109LXG52660", "Overall": "5.0", "Content": "me gusto la responsabilidad del vendedor por eso lo felicito puntualmente recibi mi compra lo recomiendo para todas las personas", "Date": "March 18, 2013"}, {"Title": "the warranty ran out one day before my 4s went dumb", "Author": "Hipness test failure", "ReviewID": "R1TFFGX17F8LT3", "Overall": "1.0", "Content": "Started with lock button no longer working at all. Called apple and verified I was still within 1 year warranty and made appt to make 200+ mile journey to apple store so a genius could say yes the lock button doesn't work. Sending me on my way with a brand new phone instead of a fixed phone with repairs only a genius would be capable of making. But I made the 200+ mile trip just to have my genius pull up my warranty info which contained the previous days date in big fat and bold print. No one cared about my customer satisfaction or the circumstances of my claim. Apple would not budge and steadfastly lost me as a once faithful customer. Shortly after, both cameras, the vibrate function, and the mute switch all stopped working as well!", "Date": "March 15, 2013"}, {"Title": "disappointed", "Author": "Jahvere Gordon", "ReviewID": "RBFI28DQ7QJTX", "Overall": "2.0", "Content": "Product was not in as good condition as i was told. phone had about of scratches and dents around the phone. i was not empress at all !!!", "Date": "February 12, 2013"}, {"Title": "exelente", "Author": "edison beard \"EB\"", "ReviewID": "RWON2IO8RQOX0", "Overall": "5.0", "Content": "el telefono  llego en muy buen estado tal cual lo describe el vendedor, y al tiempo indicado, el telefono funciona de lo mejor.", "Date": "January 4, 2013"}, {"Title": "the iphone was blocked despite buy it unlocked.", "Author": "Victor Leon", "ReviewID": "RV5K8B2MVTW7P", "Overall": "3.0", "Content": "Unfortunately the iphone was blocked despite buy it unlocked. I  solved the problem but it should not be. Ya esta en uso y ok", "Date": "December 7, 2012"}, {"Title": "fail", "Author": "john john kopp", "ReviewID": "RCR3NTCOBNB3P", "Overall": "1.0", "Content": "wasnt unlocked,wtf you didnt say the truth and makes me spend money and time going apple to fix it,i never gonna buy a celphone in this page", "Date": "December 4, 2012"}, {"Title": "so bad", "Author": "rben3772", "ReviewID": "R3VM6ZOXKNYCWU", "Overall": "1.0", "Content": "ive used this for for 1 and half month and after that i experience terrible the phone ain't work and and easy to drain d battery. it always say NO SERVICE and SEARCHING im at d phils now and i read some bad comment on this phone.", "Date": "October 29, 2012"}, {"Title": "Zombie Attacks Amazon", "Author": "ZOMBIEbob", "ReviewID": "R2DKPA5693EDM6", "Overall": "5.0", "Content": "Errrr love this phone, faster and alot more stabler than android. On screen key board more accurate than on android, Helps me find tasty meals, and it comes with Siri. She can help me hide my bodies! Holds tons of my zombie tunes, and has a good battery life!!! Zombie like Iphone not Android.", "Date": "October 25, 2012"}, {"Title": "Zombie Attacks Amazon", "Author": "ZOMBIEbob", "ReviewID": "R2DKPA5693EDM6", "Overall": "5.0", "Content": "Errrr love this phone, faster and alot more stabler than android. On screen key board more accurate than on android, Helps me find tasty meals, and it comes with Siri. She can help me hide my bodies! Holds tons of my zombie tunes, and has a good battery life!!! Zombie like Iphone not Android.", "Date": "October 25, 2012"}, {"Title": "Wife Loves It", "Author": "Wes Campbell", "ReviewID": "R1BBQB8AS5WJQW", "Overall": "5.0", "Content": "The iPhone 4S is a great upgrade to a 3GS user, but I wouldn't suggest paying the $100-200 premium for the 4S vs. the 4.If you take a ton of high quality pictures or use voice commands as your primary source of interaction with your phone, sure, but otherwise, I'd wait for the 6th generation iPhone to come out for the price to drop on this one, or get the 6th generation.All in all, it's a great phone but if you don't use the camera frequently or use voice commands (Siri) I would get the iPhone 4.", "Date": "September 10, 2012"}, {"Title": "phone unlocked", "Author": "Gilda De Di Graci \"Gilda23\"", "ReviewID": "R1GC8FBWVNX9J7", "Overall": "4.0", "Content": "Apple iPhone 4S 16GB (White) - AT&T;This product comes unlocked for use with any line in Venezuela? either Digitel, Movistar and Movilnet?", "Date": "September 5, 2012"}, {"Title": "iPhones are amazing...duh!", "Author": "iJonny015", "ReviewID": "R1WYG9C1VECB4Q", "Overall": "5.0", "Content": "Yeah just make sure you buy or have an AT&T; Sim card...you can get one from Amazon for like a buck and it will activate the iPhone just fine...and then you could even do what I did and get the GoPhone Sim and have unlimited texting a 250 min voice for $25/month. Really cheap bro.", "Date": "August 11, 2012"}, {"Title": "Not unlockable!!!", "Author": "Jet", "ReviewID": "R9W4HZAFKU2SO", "Overall": "5.0", "Content": "ATT will unlock this phone. I got my nephew to call att customer service, he is a att customer, i had to supply the iemi number and fax a copy of the reciept. After a few tries, i left the country to where i live in the dominican republic and he kept checking with ATT. He finally got his email saying that my new att iphone (locked to ATT) was eligilbe for unlock, just hook up to itunes and it will be unlocked. He forwarded it to me from the U.S. to my house (via email)in the DR. I was nervous if it was going to be that easy. However, i hooked up to itunes, did the software update and viola!! Congratz, your iphone is unlocked! Within 3 seconds, the iphone was getting the local network signal and i am free!!  Buy without fear and save $$$$", "Date": "August 1, 2012"}, {"Title": "look very good", "Author": "bus", "ReviewID": "R188CU5Q8G41O", "Overall": "4.0", "Content": "body is beautiful i like it but,use long time for sent the item to me its about 2 week but when i saw iphone im forgot that problem", "Date": "June 9, 2012"}, {"Title": "My first experience with apple.", "Author": "Ionia Martin \"Ionia\"", "ReviewID": "R3A2F92QZEM6XW", "Overall": "3.0", "Content": "Potatoes potaaaatoes pc's and mac's. This is the first apple product I have ever owned. There are things about this phone that I really like. I will get to those first. I like the way you can delete apps from the front screen without having to go into your settings and struggle to find what you are looking for. I think the display is pretty good and the phone itself is quite sturdy. I like the design as I don't accidentally push buttons that turn the phone on and off all the time like I have had problems with on previous phones. I like that you have so many screens and storage folders that you can access on the front screens so you don't have to spend forever looking for where you put something.All of those things are nice, but here are my problems with this phone. I hate that there is no removable media. Good luck and best wishes if you want to add music to your phone you had stored on a previous sd card. With apple it is either feast or famine. You can pay a ridiculous amount to download the music you want from Itunes or you can try as you might to use the itunes software to download the music you did not buy from the apple store. I had around two thousand songs saved onto my previous sd card from my last phone and low and behold, only about ten percent of them successfully made it over to the iphone. I hate that it is ridiculously hard to add pictures to your phone unless you downloaded them from the net or your email or took them from the actual phone camera. I miss having an sd card you can slide out and edit the contents of from your computer. The selection of ringtones that come with the phone are a joke and in order to add new ones, once again (kinda seeing a pattern here) you have to go to itunes on your pc to do so unless you want to pay for them.Often when a phone call comes in, the phone pops speaker phone on and you can't shut it off without disconnecting the call. Sometimes it will refuse to hang up the phone call you are on. occasionally I lose 3g coverage for no apparent reason and the only way to fix this is by shutting off the phone and waiting a few minutes before you turn it back on. If you leave the phone off and don't touch it, the battery will last for days, but if you use it regularly, you had better have a charger nearby. I have had this phone for about six months and wanted to wait until I felt I was used to it before leaving a review. My over all opinion is that it isn't a terrible phone, but for someone who is used to an android device, it is bound to be somewhat frustrating. I would think carefully before getting an iphone about what your needs are and if this phone can fulfill them.", "Date": "September 3, 2012"}, {"Title": "Nightmare to Set-Up; Fun to Use Afterwards", "Author": "Eric K.", "ReviewID": "RMQE9IULEZAQ0", "Overall": "3.0", "Content": "Let me begin by saying that setting up the iPhone initially is a nightmare that can take -- literally -- days.  I can't even imagine how horrifying it would be for someone who isn't familiar with network connections, programming issues, etc.  There's this connection, that connection, linking it up to iTunes on a computer, contacting Sprint to resolve issues, contacting Sprint again to resolve more (or the same) issues.  I had better luck with reception in the 1970s with a sheet of tinfoil and a TV antenna.  I've had the phone for over a week, and I'm still contacting Sprint to resolve set-up issues.The iPhone activated in stages.  An hour after \"activating\" it online (and connecting it to iTunes), the phone part started to work so I could make outgoing calls.  Two hours later, the Internet kicked in.  Three hours later, texting became available.  Why it's not \"plug and play\" baffles my mind in today's fast-paced, instantaneous world.Then came issues with the phone calls and texts.  We finally discovered that it was because the Airave that Sprint sent us because we have poor Sprint reception at our house (in a heavily populated neighborhood) wasn't/isn't compatible with the iPhone.  It \"hiccups.\"  Phone calls go straight to voicemail.  Texts won't send out.  Multiple same texts come in.  Over and over and over again.  After reading up online about other people's similar problems and contacting Sprint over and over again, we finally just unplugged the Airave.  It was the lesser of two evils.Another problem that arose was that when sending texts to email accounts, they showed up as picture mail, regardless of a picture being attached or not.  Several chats with Sprint later, there's still no resolution.  We've given up on that.  Similarly, when sending these \"texts\" to email accounts, the email address shown was a randomly generated email address based on the first person's name of the shared family plan.  That became confusing when the person sending the text wasn't the first person on the plan.  Two hours of chatting with Sprint, that was finally resolved.  (You can't manually change it online yourself for whatever reason.)The actual iPhone itself is fun to use.  The apps available are numerous, and you have to hunt and peck to find out which ones appeal most to you, download them, arrange them, and learn how to use them.The sound on voice calls isn't as good as my last non-smart Samsung phone, but I'm getting used to it.With my old phone, I could charge it every three days or so.  With the iPhone, I have to charge -- at the minimum -- nightly.  It drains energy/power faster than a half-working air conditioner in NYC in the middle of summer.  And this is just casually using it during the day, not heavily.  I also practice steps to reduce the power usage: toning down the screen brightness, closing all apps after use, etc.  I recommend getting multiple charging adapters -- for home, work, and car.  But make sure to only charge them fully when they're close to being out of power.I went with the iPhone 4S vs. the iPhone 4 mainly for Siri.  I thought that would be a great addition/concept, especially while driving.  Unfortunately, Siri has a mind of her own and only wants to work when she wants to work.  I'm constantly getting, \"I'm sorry, but I cannot take requests at this time.  Please try again later.\"  Isn't the main purpose of asking things of Siri because you need that information RIGHT NOW?  Like directions?  Or to remind you of something later because you'll forget?  In those cases, \"trying again later\" isn't feasible.  My advice is to NOT get the 4S for Siri alone.  Get it for other features/reasons.  Otherwise, stick with the very similar 4 and save yourself a hundred bucks or so.Do I recommend it?  Maybe.  Once you get over the huge hurdles of set-up, it can be fun to use, and the features are nice to have at your fingertips.  I don't have any comparisons to other smartphones, though, so I can't say whether the iPhone is better than others or not.  Sometimes I wonder if it's better to go back to having one device to use as a phone (that's small and actually works) and one to use as a computer, though.", "Date": "May 1, 2012"}, {"Title": "Defective item", "Author": "Josue Petit-Homme", "ReviewID": "R243LIXDVJOCRM", "Overall": "1.0", "Content": "I received a defective phone I returned it and they refuse to replace my phone. They try to charge me for damage that did not occur with me.", "Date": "March 7, 2014"}, {"Title": "please", "Author": "Guilbert Charles", "ReviewID": "R3J2PFSNLEQX8S", "Overall": "1.0", "Content": "That one is no longer in service, is not working now, next I would like to buy a new one", "Date": "November 29, 2013"}, {"Title": "i was fooled", "Author": "Julio Sierralta", "ReviewID": "R3V5ZQIDEAK14T", "Overall": "1.0", "Content": "i was fooled is not at&t; is sprint and so far i have not able to use so don't do that to de customer again", "Date": "June 13, 2013"}, {"Title": "Warehouse Deals @amazon cheat me!", "Author": "Ting Jin", "ReviewID": "R5IODCF0O0LZP", "Overall": "1.0", "Content": "I ordered an Apple iPhone 4S 16GB (White) - AT&T; from Warehouse Deals @amazon. But,  I received a verizon one and the cellphone has been sent to China. I can't use it! I think Warehouse Deals cheating me! I hate it! I will return it, Amazon must explain the reason and compensate for the posting fee and tax!", "Date": "April 28, 2013"}, {"Title": "Very disappointing", "Author": "lane", "ReviewID": "R25I37NOV31978", "Overall": "1.0", "Content": "Very disappointing, the back cover and a defect does not say, even the two - year contract contract, I want to complain!!!!", "Date": "February 21, 2013"}, {"Title": "Back cover cracking, too old, the warranty expired shortly", "Author": "Back cover cracking, too old, the warranty ex...", "ReviewID": "R2QSDZBKBZNB6H", "Overall": "2.0", "Content": "Back cover cracking, too old, the warranty expired shortly  Back cover cracking, too old, the warranty expired shortly  Back cover cracking, too old, the warranty expired shortly", "Date": "February 19, 2013"}, {"Title": "is this phone unlocked? I want to use it for tmobile?", "Author": "vinod palan \"pal\"", "ReviewID": "R1KNBG4OQWKSU2", "Overall": "5.0", "Content": "is this phone unlocked? I want to use it for tmobile?  it does not states anywhere in product desc and want to use it while i am travelling", "Date": "May 4, 2012"}, {"Title": "This iphone is unlocked?", "Author": "Alexandra", "ReviewID": "R3K5CPWM2IOXLI", "Overall": "4.0", "Content": "Hi! This iphone is factory unlocked?.I need a 4s factory unlocked iphone because I'm gonna use the phone in other contry.", "Date": "December 30, 2011"}, {"Title": "Apple iPhone 4S 16GB (White)", "Author": "taz", "ReviewID": "RRQ6LLPF2ULBZ", "Overall": "1.0", "Content": "Did not realise that this item was locked so now am unable to use this and the unlock code is still not available ,so am really unhappy as I had bought is as a gift for my son at xmas", "Date": "March 17, 2012"}, {"Title": "i phone 4s", "Author": "aleja", "ReviewID": "R28S0PN3150Y9K", "Overall": "5.0", "Content": "i really love it. i received the phone on time. i recommend iphone 4s is much better than other phones", "Date": "April 6, 2012"}, {"Title": "Talking about price gouging!!", "Author": "Tauri33", "ReviewID": "R3DID0B5WDDD6A", "Overall": "1.0", "Content": "Out of curiosity, with the upcoming release of the iPhone 5, I wanted to see what sellers were trying to sell the iPhone 4s for.  Boy was I shocked!!!  There are independent sellers on here asking anywhere between $350.00 to $625.00.  Simply outrageous!!  If you are an average consumer and don't really dig around, which these independent sellers count on and take advantage of, you'll seriously get ripped off.  With the new iPhone 5 getting ready to launch tomorrow, according to Apple, you can purchase an iPhone 4s directly from Apple (where they have lowered their prices) for only $99.  Hmmmmm.... $99 versus $350 to $625.  What a difference!!  The iPhone 4s does come in black or white and has a built in 16 GB of internal memory.  After doing a comparison look of the iPhone 5 versus the iPhone 4s on my blog ([...] even though there are very few subtle differences, both phones are virtually the same.  The iPhone 5 is slightly larger, thinner and lighter than the iPhone 4s, but only by very very negligible amounts.  And if you are considering upgrading from the iPhone 4s to an iPhone 5, keep in mind that with the new Lightning connector exclusive to the iPhone 5, it is not compatible with previous versions of the iPhone nor are the connectors on other iPhones compatible with the iPhone 5.  Though Apple does sell an adapter, it is still going to cause problems with those users who have invested a lot of money in other accessories and peripherals for their iPhone 4s's, because they're not going to be compatible with the new iPhone 5.  Though not in all cases, many people will have to go back and repurchase all new accessories and peripherals to replace the ones they had for their previous iPhone.  In my opinion, the iPhone 4s is the better deal if you absolutely HAVE to invest in an iPhone.  Not only is it cheaper ($99 through Apple, not Amazon), but it basically has just about all of the same features and functionality of the iPhone 5.  But I know there will be many people who will still overpay for their iPhones, either the 5 or the 4s, because it's not a matter of need for a lot of people, but a matter of status and bragging rights to buy into a brand so they can strut around showing off their new expensive toy.", "Date": "September 20, 2012"}, {"Title": "Great!", "Author": "O. Lawson", "ReviewID": "RSNSH09EGJZ0N", "Overall": "5.0", "Content": "Very Clean.Amazing!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!•An explanation for what you liked or disliked about the product •Product pros and cons •Facts and feature details •Comparisons to similar products", "Date": "March 6, 2013"}, {"Title": "a great phone for fun people. yay!", "Author": "MekoRush", "ReviewID": "R14FNSUAARFJKY", "Overall": "4.0", "Content": "it has a lot of features. get this phone if you like a long battery, good screen and fun apps to play. it has a lot in a small little defice. i like it and had it for 5 months now", "Date": "March 8, 2012"}, {"Title": "Great Features - But very fragile", "Author": "Gilbert L. Braun", "ReviewID": "R2IDEP6PWY6PQZ", "Overall": "1.0", "Content": "I bought an iPhone 4S white three days ago (from a local Best Buy, not Amazon) to replace my wife's 3G.  My wife loved it.But, the first day, my son inadvertantly dropped it on the floor from about 2 1/2 feet height (before we had installed the case / screen protector).  And the front face shattered.  Spider cracks throughout the entire front screen.  I'd never seen a phone with so many cracks (and I've owned and dropped several iPhones with no problem).  I should say, that was until I was sitting at the Apple genius bar, before the store actually opened (open for genius bar support only) and I saw two other white phones brought in with the same problem.  HMMM ... wonder if Apple has a problem.Beware ... if you insist on buying the 4s, either buy insurance in one form or another, or immediately put the phone in a case with a screen protector.  Because Apple will not acknowledge even the possibility of a defect if the screen cracks (it's assumed it was your fault).  And the repair cost lists at $199, though some Apple stores will drop that to $149.And as much as I like Apple products (I own several), when things go wrong, they are not easy to deal with (stores full of hundreds of young, eager technicians / managers that have no authority to do anything).Perhaps I should have been more aware, given the extent of the cottage industry I have since discovered that has built up around the iPhone to repair broken iPhone screens.", "Date": "March 29, 2012"}, {"Title": "Locked/unlocked?", "Author": "Alex", "ReviewID": "RO4VNII6CNXZV", "Overall": "1.0", "Content": "Has anyone bought it? Is it really MD237LL/A?The thing is that product description says it's locked to AT&T;, but in product details MD237LL/A is mentioned as the serial number. And MD237LL/A is a number of an unlocked phone", "Date": "December 31, 2011"}, {"Title": "Worst phone ever", "Author": "Oku \"EcoMom\"", "ReviewID": "R3GPB2M8L2NJ1K", "Overall": "1.0", "Content": "Cannot say enough about how horrible this phone is. Will not purchase apple products ever again. Bad camera, speakers keep breaking, microphone is broken. Pure junk plain and simple!", "Date": "March 13, 2014"}, {"Title": "Not AT&T;", "Author": "yjzh013", "ReviewID": "R9TVYUNRWTLXR", "Overall": "1.0", "Content": "buy at&t;?no,give me a Verizon!I can't used!locked!I hate it!!!!!!!!!!!!!I need return for the phonebut ,it in china!", "Date": "April 8, 2013"}, {"Title": "Piece of Junk!", "Author": "HappyDaddy", "ReviewID": "R3UPFTBPW4QVEO", "Overall": "1.0", "Content": "This is my first iPhone. All the features are working fine. I am not complaining the service, but the phone itself. I used flip phone and switch to this POS to try. The Apple iPhone is just a piece of junk. I know it has a lot of features. But it is very difficult for me to recall for some settings. It is also suck a lot of energy, total not design for green. In my normal usage, it needs to be charged about every 2 days. This phone is not smart, it is inconvenience to use it. The mute button on screen is closed to face/cheer when talking. There were multiple times  received sides cannot listen due to the activation of this mute button by unexpected touching. Sound volume is low. The only good is internet, that is. There are many bad on this phones that cause hate it. My basic flip phone is still in my pocket. Highly NOT recommended!", "Date": "September 9, 2013"}, {"Title": "firmware", "Author": "ValentinaCiulla", "ReviewID": "R1B00ZWTRZZHGB", "Overall": "4.0", "Content": "Hello, I dont have a real review, I just want to know wich is the firmware of this phone, please is very important", "Date": "April 2, 2012"}, {"Title": "Iphone4s 64g", "Author": "Lenlen \"Lenlen\"", "ReviewID": "R1RDLJS56TRDNZ", "Overall": "1.0", "Content": "My phone fell on a wooden floor and the glass shattered into little pieces. The worst part is it happened after the 90 day warranty and I did not buy the Apple care. So here I am with shattered glass phone.I never expected this to happen as I have never heard anybody having the same problem before.", "Date": "August 25, 2012"}, {"Title": "Apple customer service", "Author": "Quiltmaker", "ReviewID": "RS4X683JJ9EKG", "Overall": "1.0", "Content": "Apple has the WORST customer service!!! Ive had my iphone 4 months. Spent a fortune for it and for a warranty. My speakers went out yesterday. I spent two hours on the phone fighting with Apple all the way to corporate. Their options were for me was to give them a credit card number so they could put a $650 hold on my card so they could send me a different one. That way if they found I had mishandled it (which I had not),  they could run the charge through for a new one. When they tried to run the hold charge it was denied because I believe I have a limit as to the amount I can charge in one day and if I could have placed the charge on it I might not have had  enough available on my card for other purchases.  Or, according to Apple, I could call my credit card company to see if they would authorize it. My other option was to take it to UPS and have them send it to Apple and once they got it they would repair it or send a reworked one to replace my 4 month old one, but they wont send me a replacement until they receive mine. My phone was brand new 4 months ago.  I do not want a reworked or refurbished replacement.  I paid a whopping amount for my phone and a whopping amount for a warranty.  In addition, Apple badmouthed UPS by saying they didn't trust their tracking numbers (as if somehow the tracking number could be changed) and they couldn't trust them to actually put the phone in the box and ship what they were supposed too, back to Apple.  UPS was not too thrilled to hear what Apple's opinion of them was and they commented that perhaps they shouldn't even do business with them.  In the meantime,  I am without any phone now for emergencies. Worse still is the fact my 84 year old Dad is in the hospital and just had two major surgeries. He has been extremely ill and now the hospital can't reach me by phone in an emergency. SHAME ON YOU APPLE!!!!!!! Your customer service is appalling. Any other phones that I had in the past, if they had some defect, as long as they were under warranty, I was able to go into my carrier and have it replaced. Not Apple. They do NOT care about their customers or their needs. Personally,  I don't trust Apple to not send me some scrappy refurbished phone or to come back and tell me the defect was my mishandling. Think long and hard before you buy an Apple product.  I do have to say that I love the iphone.  It's a wonderful product and I'm not sorry I purchased one with my local cell phone carrier.  However, my disagreement and frustration is with Apple themselves.  Even with other Apple products, it's very difficult to get anyone to help you and they make no effort to improve their service to customers when they have difficulty with one of their products.  They simply do not care or even attempt to bend over backward to try and work with their customers or make things right with them.  Good customer service is very important.  Without it, eventually your company will suffer if you can't or won't back your product. Speaking with friends who have also had problems with their iphones, their opinion is the same as mine - dealing with Apple is a NIGHTMARE.  If you have ever had to deal with them regarding Itunes, you will know what I am talking about.  If you have never had problems with your Apple product, congratulations.  I hope you never do.  But you may find yourself in the same predicament down the road of life and in an emergency situation (what about all those emergency employees who are \"on call\" and end up without their phones because of Apple's poor customer service?) So you have to ask yourself, is the iphone really worth the cost....and the headache sure to follow at some point?  In the long run, you may find yourself much happier with a different smartphone.", "Date": "May 1, 2012"}, {"Title": "shrap", "Author": "P90 Man", "ReviewID": "R3MYLENQ9ESY7E", "Overall": "1.0", "Content": "This phone betrayed me. When I was sleeping, it slapped me and seerei said a bad werd and then the iphony shut off then, 53 minutes and 6.9845476257465729046 seconds later, it syrie took out a gun appe and shot me with a minigun in the hed. I don't no how im still ritin this review . Plus black is fazter.PEACE", "Date": "October 8, 2012"}, {"Title": "Apple customer service", "Author": "Quiltmaker", "ReviewID": "RS4X683JJ9EKG", "Overall": "1.0", "Content": "Apple has the WORST customer service!!! Ive had my iphone 4 months. Spent a fortune for it and for a warranty. My speakers went out yesterday. I spent two hours on the phone fighting with Apple all the way to corporate. Their options were for me was to give them a credit card number so they could put a $650 hold on my card so they could send me a different one. That way if they found I had mishandled it (which I had not),  they could run the charge through for a new one. When they tried to run the hold charge it was denied because I believe I have a limit as to the amount I can charge in one day and if I could have placed the charge on it I might not have had  enough available on my card for other purchases.  Or, according to Apple, I could call my credit card company to see if they would authorize it. My other option was to take it to UPS and have them send it to Apple and once they got it they would repair it or send a reworked one to replace my 4 month old one, but they wont send me a replacement until they receive mine. My phone was brand new 4 months ago.  I do not want a reworked or refurbished replacement.  I paid a whopping amount for my phone and a whopping amount for a warranty.  In addition, Apple badmouthed UPS by saying they didn't trust their tracking numbers (as if somehow the tracking number could be changed) and they couldn't trust them to actually put the phone in the box and ship what they were supposed too, back to Apple.  UPS was not too thrilled to hear what Apple's opinion of them was and they commented that perhaps they shouldn't even do business with them.  In the meantime,  I am without any phone now for emergencies. Worse still is the fact my 84 year old Dad is in the hospital and just had two major surgeries. He has been extremely ill and now the hospital can't reach me by phone in an emergency. SHAME ON YOU APPLE!!!!!!! Your customer service is appalling. Any other phones that I had in the past, if they had some defect, as long as they were under warranty, I was able to go into my carrier and have it replaced. Not Apple. They do NOT care about their customers or their needs. Personally,  I don't trust Apple to not send me some scrappy refurbished phone or to come back and tell me the defect was my mishandling. Think long and hard before you buy an Apple product.  I do have to say that I love the iphone.  It's a wonderful product and I'm not sorry I purchased one with my local cell phone carrier.  However, my disagreement and frustration is with Apple themselves.  Even with other Apple products, it's very difficult to get anyone to help you and they make no effort to improve their service to customers when they have difficulty with one of their products.  They simply do not care or even attempt to bend over backward to try and work with their customers or make things right with them.  Good customer service is very important.  Without it, eventually your company will suffer if you can't or won't back your product. Speaking with friends who have also had problems with their iphones, their opinion is the same as mine - dealing with Apple is a NIGHTMARE.  If you have ever had to deal with them regarding Itunes, you will know what I am talking about.  If you have never had problems with your Apple product, congratulations.  I hope you never do.  But you may find yourself in the same predicament down the road of life and in an emergency situation (what about all those emergency employees who are \"on call\" and end up without their phones because of Apple's poor customer service?) So you have to ask yourself, is the iphone really worth the cost....and the headache sure to follow at some point?  In the long run, you may find yourself much happier with a different smartphone.", "Date": "May 1, 2012"}, {"Title": "shrap", "Author": "P90 Man", "ReviewID": "R3MYLENQ9ESY7E", "Overall": "1.0", "Content": "This phone betrayed me. When I was sleeping, it slapped me and seerei said a bad werd and then the iphony shut off then, 53 minutes and 6.9845476257465729046 seconds later, it syrie took out a gun appe and shot me with a minigun in the hed. I don't no how im still ritin this review . Plus black is fazter.PEACE", "Date": "October 8, 2012"}], "ProductInfo": {"Price": "$382.49", "Features": "iPhone 4S\nSize 16 GB", "Name": "Apple iPhone 4S 16GB (Black) - AT&T", "ImgURL": "http://ecx.images-amazon.com/images/I/41eVAfYDANL._SX300_.jpg", "ProductID": "B005SSAXSI"}}