{"Reviews": [{"Title": "Be Ware", "Author": "DM", "ReviewID": "R3ROLM8Y71GF95", "Overall": "1.0", "Content": "I have this phone under a Page Plus/Verizon network. Please if you are considering buying a smartphone, this is not a choice. I have one, it hangs/freezes for hours! and cannot even turn off once frozen. After dialling a number, you have to wait for about 15-25 seconds before it can start dialing!!!! It was cheap, and I frankly regret having bought it. It is not worth your money", "Date": "July 29, 2012"}, {"Title": "Save your money this is a terrible phone.", "Author": "Marknmarti", "ReviewID": "R1UNV2LSPGYLHD", "Overall": "2.0", "Content": "This phone has been a nightmare. It makes calls in my pocket when its locked. The operating system is terribly slow. It seems to lock up every time I go to use it and I have to wait 10-15 seconds before the screen responds. I bought it new and have not downloaded or changed the settings. I hate the android operating system, you have to have a google account to do anything on the phone, even to use the calender. I suspect thats because google is keeping track of everything you do. This phone is a real piece of garbage. I use it on the page plus network which is a great company as far as coverage (verizon)but customer service is not very good. I use pageplusdirectdotcom and get my prepaid plan at a discount. Bottom lineDon't buy this phone.", "Date": "April 30, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Compact Full Touch Smartphone Powered By Android 2.1 Operating System\nEnjoy A PC-like Browsing Experience With The Full HTML Webkit Browser\nWork, Personal, and Facebook Contacts Are All Filtered To One Place.\nBACKTRACK Allows You To Navigate and Scroll Through Your Phone Without Touching Your Display\nCapture Pictures and Video With The 3.0MP Camera With Video Capture", "Name": "VERIZON WIRELESS CELL PHONE MOTOROLA WX445 CITRUS PHONE NO CONTRACT REQUIRED IN ORIGINAL BOX WORKS ON VERIZON WIRELESS OR PAGE PLUS NETWORK ONLY", "ImgURL": "http://ecx.images-amazon.com/images/I/51Xqoi%2B9IQL._SX300_.jpg", "ProductID": "B005SV3ZR6"}}