{"Reviews": [{"Title": "aggrivating!!", "Author": "tammyjo", "ReviewID": "R36BKQ0IODOK0C", "Overall": "2.0", "Content": "When i got this phone it was great. it is a good texting phone and worked well, for a while. One day it went to charge it and right away it said it was fully charged. i knew it wasnt but i unplugged it because it started acting funny. it was up for a couple of hours and then it went turned off while it was saying it still had a full battery. i went home and plugged it up for the night and the next day when i unplugged it, it would not turn on. i took it back to the store and got a replacement and the same thing happened to the next phone. got it replaced again just so i would have a phone until i got a new one. same thing happened again.", "Date": "August 25, 2012"}, {"Title": "cell phone", "Author": "D. Mason \"Postmaster\"", "ReviewID": "RAIYSHKHPD9AY", "Overall": "4.0", "Content": "Very good little phone and the best part is I don't have a contract.  Would recommend it to any one!!", "Date": "September 23, 2013"}, {"Title": "Difficult to scroll and touch screen not very good", "Author": "Readerlady", "ReviewID": "R3R0897AAOGZKP", "Overall": "1.0", "Content": "Pantech Jest 2 is a much improved version of this. I strongly recommend the 2 model if you want a regular phone.", "Date": "May 9, 2013"}, {"Title": "This is a Great Phone ..", "Author": "Bree", "ReviewID": "RNM6BUIOD20UC", "Overall": "5.0", "Content": "I've had this phone forever now .. since dec of 2009 or 2010 .. one of them and its very good for texting and listening to music .. the phone calling isnt very good at all but i dont talk on the phone anyway. the web isnt good at all lol.. this is a basic phone so you cant expect that much out of it ! i love this phone though its cute and tiny .. after i had it for a while it started to mess up on me but i had a good time with it. Its very durable! i dropped it at least once a week lol. and i barely have Anything wrong with it . of course theres a few scratches but its not Broken .. I love the camera . other then the music player , thats my favorite thing on the phone and the speaker phone is Very Loud .. its a great phone for those who isnt into the web and phone calling .. to me its mainly a camera & texting phone ..", "Date": "December 26, 2012"}, {"Title": "Awkward to use! Battery issues!", "Author": "Yo daddy \"Don't blame me, I'm just the messen...", "ReviewID": "RX0GD8T4MLVI1", "Overall": "2.0", "Content": "I feel like I am constantly fighting with this phone to get it to do what I want. I use to dial, text, take pics, and browse with one hand. It's next to impossible with this phone. I didn't have any problems with the seller, but the phone is not a fun phone to use. Also, the battery will not charge if it gets to low. So if you have this phone, NEVER EVER EVER EVER EVER EVER EVER EVER let it get below two bars of battery life. When I googled some of my problems, I found the battery issue is very widespread.", "Date": "September 4, 2012"}, {"Title": "Manufacturing issues, but overall not bad", "Author": "Deanna", "ReviewID": "R2HXD4HPKQSN3D", "Overall": "3.0", "Content": "I had this phone for about a year and a half. It was very easy to use once I got used to the sensitivity of the touch-sensitive softkeys and directional keys. Does require two hands sometimes to text but does anyone really only use one hand to dial their phone anymore? Love the display. After about six months though the charger port solder points started to wear out and it would be very touchy with charging. Battery often doesn't last more than about 7-10 hours regardless of how long it's charged or how much it's used during the day. Very resistant to water damage though! I think I dropped it in water three times and it only stopped working after the third time. I now have a pantech caper and I hate it, I want my old phone back. Planning to get another Jest most definitely.", "Date": "October 25, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "You can make customized caller groups and feed in multiple numbers per contact with picture ID\nand ring ID, in this Pantech Smartphone, for ease while calling.\nVia the USB interface you can easily transfer songs and data to the Pantech Jest.\nWithout Contract\tColor: \tBlue Camera: \t2.0 MP", "Name": "VERIZON WIRELESS PANTECH JEST TXT8040 TXT 8040 CELL PHONE. NO CONTRACT REQUIRED BRAND NEW IN ORIGINAL BOX WORKS ON VERIZON WIRELESS OR PAGE PLUS NETWORK ONLY", "ImgURL": "http://ecx.images-amazon.com/images/I/31IkzdcqayL.jpg", "ProductID": "B005RQCJIS"}}