{"Reviews": [{"Title": "Continuing Improvements", "Author": "Jonathan Stewart \"jonathan_stewart2\"", "ReviewID": "R1VX0DSB1ZT7MR", "Overall": "4.0", "Content": "I've been using Iridium phones for about 10 years now, and they continue to evolve, with the Extreme the latest (as of 1/2012) version.  Compared to the previous version, the 9555, the Extreme does seem to acquire signal faster.  Call quality is about the same.  The Extreme has a better hand feel, with a rubberized surface with little ribs for better grip.  It's also marginally lighter and smaller than the 9555, and the antenna feels much sturdier.  There are some differences to functionality, primarily GPS.  You can attach your location to a message, and the lat/lon is sent, along with a Google Maps link embedded in an Iridium website.  Another benefit of GPS is that now the Extreme has a built-in SOS button, which you can program to connect to a rescue service of your choice.  GEOS is the default, the same as is used by SPOT, with optional coverages available for purchase.  I have a SPOT as well, and will continue to use it since it's cheap enough, but I believe the Iridium will be better, because unlike SPOT's Globalstar, Iridium's coverage is truly global. SPOT doesn't work in parts of Asia and Africa, or the oceans or poles.  Also, the Iridium constellation is much more robust and reliable, and the Extreme can get a message out in conditions where SPOT can't, or at least can't quickly.  Plus, the Iridium gives a verification of message sent, unlike SPOT.  A side note for SPOT users, standard rescue coverage purchased with SPOT is only good for the Americas and Western Europe, plus Australia.  If you get into trouble anywhere else on the planet, you'll need the optional worldwide coverage available through GEOS.  As mentioned, the same coverage is available with the Extreme.  But that's comparing apples to oranges, since in addition to being a messenger, the Extreme is a fully-enabled voice and data device.Downsides to the Extreme:  It's still clunky and feels like a tough-built 1995 cell phone.  To charge it, you don't just plug in a little tip, as you have with every other sat and cell phone ever built.  No, you have to install a little appendage to the bottom of the phone, then plug the adapter into that.  It's just one more part to lose and break and I really don't understand why they designed it like this.  It can't be for waterproofing, since there are other holes on the phone.  That's a mistake, in my opinion.Overall, it's an incremental improvement over the 9555, and for the GPS, ruggedness (plus water-resistance), and slight weight and size gains, I think it's worth the upgrade.", "Date": "January 7, 2012"}, {"Title": "Iridium 9575 Battery/Charging Issues", "Author": "jens jessen", "ReviewID": "R3SSGN3V5A9J4L", "Overall": "2.0", "Content": "When these handsets work they are fantastic, but when you buy such an expensive device from such a well recognized brand you can't help but be incredibly disappointed when they simply don't work.Apparently the way in which they are designed has also created a major flaw. Many of the new batteries are slightly warped so that the battery doesn't actually make contact with the corresponding points on the phone. This means that not only will the phone not charge but it will also not even turn on.You could try to push the battery in to make contact but this is hardly a solution. We have 6 of these handsets and only 4 of them actually work.We now have to send them back to the supplier and hope that they will return in working order.Don't buy these unless they have been tested prior to shipping.Sort out your problems Iridium!!!!Here is the only article I could find that addresses this issue:(...)oops! link doesn't show. Try to search for \"Iridium 9575 EXTREME Charging Problems\"", "Date": "February 20, 2012"}, {"Title": "Problem activating prepaid.", "Author": "Brooks \"Nomads\"", "ReviewID": "R99XT9B3S4YBQ", "Overall": "2.0", "Content": "I had this product hand carried to an office in Africa with the prepaid card.  It took many calls and a lot of frustration to get the prepaid card set up.  The company was unhelpful.  The product is good, but buy it from someone else and start trying to activate it weeks before you intend to use it.", "Date": "August 5, 2012"}], "ProductInfo": {"Price": "$2,625.00", "Features": "GPS-enabled SOS with real time tracking\nGlobal Reliable Communications\nIridium AxcessPoint (WIFI) Capable\nAC Charger with International Plug Kit, DC Car Charger, Antenna Adapter,\nPower Adapter, USB Cable, Hands-free Earpiece, 5 ft Mobile Magnetic Antenna and more", "Name": "Iridium 9575 Extreme with 500 prepaid minutes and Pelican Case", "ImgURL": "http://ecx.images-amazon.com/images/I/41TMUiQ0XUL._SY300_.jpg", "ProductID": "B005VFZFMC"}}