{"Reviews": [{"Title": "not FACTORY UNLOCKED", "Author": "Haytham", "ReviewID": "R1VDG8VJSH65GU", "Overall": "1.0", "Content": "I bought the phone and it came with a 'gevey' sim card, this means the phone is actually locked and it uses 'gevey' to unlock. I can't go past the first part to register the iphone since it is locked to a certain carrier. Be ware from this seller.", "Date": "May 21, 2012"}, {"Title": "Perfect", "Author": "Anna", "ReviewID": "R3UFGZDCPZLVTK", "Overall": "5.0", "Content": "Item arrived as described, brand new and factory unlocked. All i needed to do was insert my sim card. It was quick and easy. Will buy from this seller again!", "Date": "December 11, 2012"}, {"Title": "LOCKED PHONE SELL AS UNLOCKED. I FEEL CHEATED", "Author": "Eduarda Costa", "ReviewID": "R1DER7T39Z0FI7", "Overall": "1.0", "Content": "I am quite unhappy and bored with this purchase. The phone IS LOCKED and I don't know what to do with it, because I don't live in the United States. I wish that the seller could get a solution, I can send you back but you will pay the shipping costs.", "Date": "February 24, 2014"}, {"Title": "unlocked 64 GB iPhone 4s", "Author": "Buddy H", "ReviewID": "R3TOYRIBGXF4IU", "Overall": "5.0", "Content": "It arrived quickly (over night) and is truly unlocked.  I purchased a straight talk SIM card and it works perfectly.  It was cheaper than most and it was new.  I'm very pleased with the purchase and the vendor.", "Date": "December 22, 2013"}, {"Title": "Finally", "Author": "DelKar \"DelKar\"", "ReviewID": "R1AVZV58MKAYY7", "Overall": "5.0", "Content": "Finally got a 64gb factory unlocked phone... At the price I paid ... I am good with that... Tailwind for the win... Just keep fingers crossed if being shipped with USPS.", "Date": "May 18, 2013"}, {"Title": "On time", "Author": "C. Kline", "ReviewID": "R2EJVV2VH4AZMU", "Overall": "4.0", "Content": "The phone arrived on time and everything works great!  I was so grateful to get a phone that works!  It's my first smartphone and I'm enjoying the help it gives.", "Date": "May 24, 2013"}, {"Title": "New My Ass", "Author": "Kissa", "ReviewID": "R2Z5SFYNSV8BCT", "Overall": "2.0", "Content": "Call me crazy but when I spend $635 purchasing a new iPhone I expect it to be new not refurbished NEW!!!", "Date": "May 24, 2013"}, {"Title": "Great Phone", "Author": "Andrea P. Eiley", "ReviewID": "R4I7LRCLKQRVY", "Overall": "5.0", "Content": "Such a Great price for a great phone.very satisfied with such an intelligent device made by apple. I would definitely recommend this prouct to other buyers.", "Date": "May 11, 2013"}, {"Title": "iPhone 4S", "Author": "Mario Alejandro Mastice", "ReviewID": "RDTQ444P5PBD0", "Overall": "4.0", "Content": "I think Apple do the best in their products, but bettery life is really poor.  The dealer was excelent, i recomend him!", "Date": "November 19, 2012"}, {"Title": "great", "Author": "Hind", "ReviewID": "R1919O03QMN5D5", "Overall": "5.0", "Content": "the item is perfect.. I loved it... it did meet my expectation and more...fast and with a huge memory that I cant seem to be able to fill it up", "Date": "November 3, 2012"}, {"Title": "Excelent choice", "Author": "Mariano Chouhy \"miperrogomez\"", "ReviewID": "R111RYO25CRCGJ", "Overall": "5.0", "Content": "I had iphone 4 and bought 4S, both excelent products. No complaints. And these additional words are to comply with the minimum of words required.Regards", "Date": "October 29, 2012"}, {"Title": "Delivers as promised", "Author": "UnRich1 \"RAM\"", "ReviewID": "R14D6DLKNTEXZW", "Overall": "5.0", "Content": "It's a great phone at an expensive price but what you going to do.  We travel internationally and need the flexibility of an unlocked phone.", "Date": "August 18, 2012"}, {"Title": "Amazon states the Sell New unlocked phones from Apple.  They are not.", "Author": "linda", "ReviewID": "R1QVAMQ007MPVL", "Overall": "1.0", "Content": "Amazon states they sell NEW unlocked phones. They are NOT. Buyer be ware of false advertisement. Unlock Phones is a front for getting scrapped phones from Apple and selling them as new.", "Date": "March 26, 2013"}, {"Title": "It was good.", "Author": "Abelardo Hidalgo", "ReviewID": "R197QNC68EWJX3", "Overall": "4.0", "Content": "Purchased on a wednesday, arrived tuesday. The cellphone is unlocked and 64GB. I live in Costa Rica and its been working perfectly. BUT, there was something I didnt like. I received a s**** pair of earphones and the charger you can tell its not original either. I know the iphone is the main thing, and I received what I bought, but you are paying for original stuff, not expecting this. But overall is good.", "Date": "December 20, 2012"}, {"Title": "Item not delivered & major billing issues!!!", "Author": "Validoza", "ReviewID": "R3CNGL1VF0OWJI", "Overall": "1.0", "Content": "My issues are the following:Nov. 22 - I placed an order for \"1 iPhone\" unit from HassleFreeCell.Nov 29 - Received an email from HassleFreeCell saying the iPhone got damaged in transit and they're not able to replace it. Meanwhile their website says there's still 2 more units available at that time. I was told via email by Dave from HassleFreeCell to call Amazon to undo the refund.Nov 30 - Confusing emails offering solutions poured in \"IN  1 DAY\" from Amazon, not to add HassleFreeCell's.Dec 1 -  Per confusing responses from Amazon & Dave to \"re-order\" after the refund, I finally did under HassleFreeCell's website, BUT WAS REROUTED INSTEAD TO VALUEPACKS (Seller). After trying several times to get back on Hasslfreecell's website, I thought \"maybe\" Amazon was trying to \"help\" make my re-ordering problem free by re-routing my order to Valuepacks. Seems like Valuepacks has better reviews anyway & I'm under time pressure to have the same delivered. So I went ahead & finalize my order, regardless who the Seller is. I had full faith with the Amazon company anyway as \"I never had encountered any major problem, until later.\"Dec 3 - iPhone unit FINALLY delivered & received, courtesy of VALUEPACKS.Dec 10 - I received an email from HassleFreeCell offering compensation for $40 and requesting to have my negative feedback removed. Good comeback but with all the BS that I'm going thru with this issue, I'm not buying it.From Nov 30 to present, I've been emailing Amazon back & forth. I keep getting the answer that the refund has already been made. YES IT IS AND THAT WAS THE \"FIRST\" ORDER. THE SECOND RE-ORDER IS BEING ASSOCIATED TO THE FIRST REFUND. Simple as it is to me, too complicated I guess for Amazon?Not to mention the over limit fees made on my account on this issue. It doesn't help either that I'm addressing this growing frustration from another part of the world. Amazon has great customer service but everybody's on different page in offering solutions.Being in the customer service industry myself, Hasslefreecell should have prevented this problem have they shipped a replacement instead of refunding, and notifying the customer thru email after the fact. Then cramming after to offer compensation and re-delivery. It doesn't serve its purpose. \"PREVENTION IS BETTER THAN CURE\". Amazon, great as they are with customer service, should REVIEW histories of customer inquiries before offering solutions as they add more frustration to the issues. Had I not write the investigative department of Amazon, the 2nd charges wouldn't have been taken off from my account. That doesn't even include the over limit fees & interest charges. Too much hassle made by Hasslefreecell.", "Date": "December 23, 2012"}, {"Title": "Excellent product and excellent service!", "Author": "Z. Abussaud", "ReviewID": "R8FFI6O0JIJOZ", "Overall": "5.0", "Content": "I bought my iPhone 4S 64GB from Amazon.com and had it ship-forwarded to my country. Unfortunately, the mobile operators in my country do not support FaceTime and sell a local iPhone 4S version without the application; some local retailers sell iPhone 4S with FaceTime and charge significantly high, but I managed to save money by purchasing it from Amazon.com plus the ship-forwarding. Even if the mobile operator does not support FaceTime, I can still use it with Apple ID and free of charge through Wi-Fi. I am also very pleased with WorldWide Distributors since they shipped the phone free within one day and delivered it to my US address in four days. The only one issue I had is that the box was previously opened and someone went through the initial setup, but it was probably the ship-forwarding agent. I had my old iPhone 3GS easily backed up to iTunes and restored to my new iPhone 4S, and I started using my new phone in no time. I am very pleased with this purchase.", "Date": "February 18, 2012"}, {"Title": "iPhone sold w/End-of-Battery-Life diagnosed by apple care technician", "Author": "Olga Espinoza", "ReviewID": "R16OLBMMJ9K0Q6", "Overall": "1.0", "Content": "IPhone sold w/End-of-Battery-Life diagnosed by apple care technician- Be aware! If you buy something from this seller, get it diagnosed right the way... I was not using the phone as much because I had a phone line at home but then at month ago I moved and I don't have a line at home anymore so I started using the iPhone more often... the battery will not last more than 3 hours!!! And according to the seller is my problem than only in four months I had to replace the battery!!! It would not bother me if the seller would be more upcoming /honest and said on the description that the battery was malfunctioning…. So in reality I paid $435 for the phone plus $85 for the battery. What a deal!!!", "Date": "October 30, 2013"}, {"Title": "The delivery was on time; the product was spotless; what more can you ask for?", "Author": "Caleb", "ReviewID": "R2XVPM77J4Z8NU", "Overall": "5.0", "Content": "The iPhone 4s is one of the most if not the most advanced mobile phones available. The product came with everything the description said it would, and it was new condition like I ordered. It was easy doing business with you.", "Date": "July 3, 2012"}, {"Title": "excellen i give 5 Stars", "Author": "Wilmer Molina", "ReviewID": "R2OUMY4KIBJHRN", "Overall": "5.0", "Content": "Excellent product.very responsible order arrived at the agreed time.by the quality of this product and give 5 stars if I could a couple more of them", "Date": "June 5, 2014"}, {"Title": "Wonderful", "Author": "Ken", "ReviewID": "RCOPF1X9J6MXA", "Overall": "5.0", "Content": "This was a mother's day gift. The package arrived on time and was as described. The mobile was packed well and my wife is happy with it working right away and no problem activating it with our carrier.", "Date": "May 12, 2014"}, {"Title": "Had a 4, now a 4s", "Author": "Melvin Smith", "ReviewID": "R9EH1ZU06SA8J", "Overall": "5.0", "Content": "I have had a 4 for about 4 or 5 years, never a problem, just wanted to upgrade, but didn't want a 5. Car and house set up for 4 input and output, didn't want the hassel of the new cables, besides, the 4s is great for what I want it for.Shipping was great and so was the cost. I work in England and for the 4S, it would have been twice as much.", "Date": "April 11, 2014"}, {"Title": "Love it holds all my music", "Author": "Joyce Powell", "ReviewID": "R1ZV0NCSDLHON1", "Overall": "5.0", "Content": "This is the best, I have net 10 and bought a sim card and had my number transferred in less than an hour.... for Net 10 this is a miracle, have had no issues at all.", "Date": "April 9, 2014"}, {"Title": "Bait and Switch", "Author": "James S. Leseke \"lesekejames\"", "ReviewID": "R3QW95RW5FJ4ED", "Overall": "3.0", "Content": "Love the device, hate the seller. This is NOT an unlocked phone. I am now going through the pain and cost of getting it unlocked, and hoping that I do not brick the phone. This Captain is not at all fantastic, he's a bloody pirate", "Date": "March 21, 2014"}, {"Title": "it good", "Author": "greg", "ReviewID": "R210YQV8K83RGJ", "Overall": "3.0", "Content": "the internet on it is quite slow. and camera don't take good picture. good bout it is the 64gb. its ok.", "Date": "January 11, 2014"}, {"Title": "Problems with software and parts", "Author": "Margaret M. Obermeyer", "ReviewID": "R1G2B6NU05FD8M", "Overall": "4.0", "Content": "I love my iPhone 4s  purchased as a refurbished/unlocked cell phone, I have gaving it a four star instead of five due to the fact that it had problems.  Siri was acting up and it would not allow access setting etc. When received I plugged it to MacBook to give it power and iTunes downloaded the latest bug fix. The audio side of cell did not work for phone calls either in or out.  SIRI worked all the time not letting get into the phone.  I spent about five hours on the phone with Apple Support who finally a technician realized that it was set for the blind.  He walked me through the adjustments,  Now it is fine.  The audio still off took it to a mechanic who replaced two micro audio parts for a cost of $70.  I also replaced the battery as it was showing low life.I put a claim for the $70 and the seller  has refunded me the cost of the repair.  They get a huge FIVE STARS this was very well done.Thank you", "Date": "January 11, 2014"}, {"Title": "THE CELLPHONE THAT I BOUGTH LIKE NEW, WAS A REFURBISHED PHONE", "Author": "Luis Castro Appiani", "ReviewID": "R1PEXOBZARU3N2", "Overall": "2.0", "Content": "I bougth those celulars like new. the was ok. but like 3 months ago my phone broke the microphone, when I carry to a place to fixthat the return the celphone with the description \"I change the microphone, like it was changed previously\". what is the conclusin of that message, THE CELLPHONE THAT I BOUGTH LIKE NEW, WAS A REFURBISHED PHONE", "Date": "November 19, 2013"}, {"Title": "Very good technical condition / unfortunate overall condition - more than the typical using damage but still ok.", "Author": "Miriam R", "ReviewID": "R1P7RKEPMQ7R2B", "Overall": "4.0", "Content": "The iPhone 4S condition is almost as expected. It works really good with my SIM card and the technical condition (battery live, display, reaction time etc.) is very good.What didn't fit the discription \"Grate contrition!\" so well was:There are two big, deep scratches on the screen (lucky me they are not right in the middle of it) ...and the metal frame of the iPhone looks on top left side like it was used ones to open a bottle of beer or, maybe it just dropped ones really unfortunate onto the street without any protection.To discribe my definition of an grate condition:I bought it as my second iPhone 4S so now I have got two iPhone 4S. My old one is 1.5 years old and, even I've  used it every day (I still do) it still works like a new one AND it also looks almost like it still was new.The god thing is that it doesn't bother me too much how the phone looks like since I am keeping it in a case which covers the damage up. What matters to me is that the phone works fine and fulfills my needs.", "Date": "October 9, 2013"}, {"Title": "very nice !", "Author": "MR MIHAI C TURCANU", "ReviewID": "R3EM0CU03Z4LVJ", "Overall": "5.0", "Content": "I love it ! It is a fantastic addictive toy. I wish we didn't need to have any such obsessive toys !Very nice and practical !", "Date": "October 2, 2013"}, {"Title": "Unlocked new iPhone 4S", "Author": "michael c.", "ReviewID": "R3LHY6LDN3UPGA", "Overall": "5.0", "Content": "Phone worked perfectly. The transition from an older 4S was fairly smooth. Only issue was in uploading my camera roll from the old phone. But that was an apple issue. Seller mailed promptly and delivered what was promised. Price was within acceptable range.", "Date": "September 2, 2013"}, {"Title": "Just buy one already!", "Author": "Darius", "ReviewID": "RGMICO68P0LVT", "Overall": "5.0", "Content": "GREAT PURCHASE! Just go ahead and spend the money and get this phone, STOP PROCRASTINATING LIKE I DID! My N900 finally died on me so 2 days later after trying to reboot it, I bought my 4S. This phone has spoiled me even more than my do-it-all Nokia N900. I love the phone. Got mine from K&K;, it was obviously repackaged because it had a iPhone 4 booklet and wasn't packaged like how they are at Apple stores but the phone is definitely a 4S, boxed nicely and works perfectly. No problems at all and this is the real deal. Won't find a NEW 64GB 4S for this price.", "Date": "August 16, 2013"}, {"Title": "Love this phone!", "Author": "TWR", "ReviewID": "R34ZZWSIZOJ7V4", "Overall": "5.0", "Content": "I already knew I loved the iPhone, and preferred iOS to Android, so this isn't a comparison.However, I was coming from an iPhone 4 with only 8GB of space, and this was a huge upgrade. The OS is slightly snappier, and I don't use Siri, but I'm still very pleased with this phone. I didn't want the iPhone 5 because I didn't want the taller screen, so this is perfect.", "Date": "August 7, 2013"}, {"Title": "iPhone experience much better with 64GB", "Author": "Midsummernightsdream", "ReviewID": "R1O38P3UGUH3C0", "Overall": "5.0", "Content": "Great phone, and compared to my earlier 16GB version, the iPhone experience with 64GB of storage is much better!More music, video, photos, apps, and easier app updates (all at once, rather than one after the other due to memory restrictions).iTunes University now works much better, too, as I can download plenty of courses and sift through without worrying about memory space.Too bad only that the extra memory is a rip-off and cannot be added by means of an SD card.", "Date": "July 14, 2013"}, {"Title": "Product not in original (new) package", "Author": "Gab Ram", "ReviewID": "R2JVP67STVBW7N", "Overall": "4.0", "Content": "The product is great (it's an iPhone!). It was new, but most likely previously opened. The package was the original, nice box from Apple, which also included all accessories (USB cable, AC adaptor and earphones), except the pin used to open the micro-sim compartment. Fortunately, it is not a big issue, as you can use different sharp, slim pins to open such compartment. It is an unlocked phone, which is why I purchased it from Amazon. Vendor should inform the buyer if the product is new, but previously opened. Everything else was fine.", "Date": "June 25, 2013"}, {"Title": "Not great.. dies at 7%, ipod wire broken, charger doesnt work", "Author": "JR Castro", "ReviewID": "R3CJ3SR3NAZMH3", "Overall": "3.0", "Content": "It wasn't advertised that this iphone uses microSIM and I live in italy so they normally use are regular SIM. wasn't that bad, but the ipod wire broke the first time I tried removing it from my ipod when connected. and the charger does not work.  and randomly the phone dies when its at 7 or 6%. my old iphone died at 1%.  I had it delivered to an APO address, and it came 3 weeks sooner than predicted, so that was awesome.", "Date": "May 17, 2013"}, {"Title": "Great Product", "Author": "alexandria", "ReviewID": "R37N4NYELWGFZC", "Overall": "5.0", "Content": "I have finally received my phone and I love it! Slight wear on the sides and crystal clear everything. Works like new and I wouldn't trade it for anything. Worth the price paid!", "Date": "May 2, 2013"}, {"Title": "Excellent buy", "Author": "Oswaldo Ramirez", "ReviewID": "RZVFKPPGZAF79", "Overall": "5.0", "Content": "It was an excellent buy because everything went perfect and i am very pleased with my phone, it covers all my expectations.", "Date": "May 2, 2013"}, {"Title": "Fantastic and beautiful!!!", "Author": "BacHoBiSida", "ReviewID": "R30S128S2K2KQ7", "Overall": "5.0", "Content": "This iPhone has exceeded my expectations. It is so reliable and I have already recommended it to my friends. The voice and other added features are just incredible", "Date": "April 19, 2013"}, {"Title": "Great buy", "Author": "Ezra J. Arcia", "ReviewID": "R3NQX2ACTLI5K2", "Overall": "5.0", "Content": "I bought this one used and was expecting a little less from it and in fact was \"Like New\" as advertised.  Even in better shape than the iPhone 4 that I'm replacing with this one.", "Date": "March 2, 2013"}, {"Title": "Good service", "Author": "Prosper W Ackah", "ReviewID": "R26UMO5OZF3UKR", "Overall": "4.0", "Content": "It was fine to do business with him, there was some accessories missing he did his best to make them available to me and I think that was great", "Date": "February 4, 2013"}, {"Title": "iPhone is Great", "Author": "Mark", "ReviewID": "R2P984XRL7CI9H", "Overall": "5.0", "Content": "I tried a used iPhone 4, but it had a problem so I returned to Amazon and got this new 64 G iPhone 4s. The 64G may be a little over kill as I could have probably could have dealt with a 32G instead. I had wanted the Siri function and it really is great. If I have my ear buds that have a mute button it also will trigger the Siri response. This is great as it truly makes it handsfree. I was riding on my bike pressed the button on my ear buds. Siri responded Mark what can I help you with.  I told her what song artists I wanted to listen to. Seconds later Pink was playing.  Siri works with many apps. I would like to see more apps that worked with Siri, like my audible app. I used Siri for map direction while I was driving the same thing totally handsfree. I was using this function because my Garmin was not giving me the directions needed. Who has the better maps?", "Date": "April 13, 2013"}, {"Title": "Late Arrival", "Author": "Annsantos", "ReviewID": "RS9IR2IBO7E9A", "Overall": "1.0", "Content": "Unfortunately did not arrive in time for my friend to bring it to me so it is stranded in the USA. Have not seen it yet and hope I will find someone else to get it to me. The estimated date it was to be delivered by was a week before my friend's trip.", "Date": "June 20, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "8 mega pixel camera with full 1080p video recording\niCloud / App Store / Air Print / Retina display\nSiri voice assistant\n8 mega pixel camera with full 1080p video recording", "Name": "Apple iPhone 4S 64GB (Black) - Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/41S6fyTccFL._SY300_.jpg", "ProductID": "B005UEF72M"}}