{"Reviews": [{"Title": "Great Phone", "Author": "Pete13", "ReviewID": "R1EGGY6KMS2JIJ", "Overall": "5.0", "Content": "Phone was in great condition and works well. I would buy again from this seller. I have been using the phone for about 3 weeks now and it has been working fine with Verizon service.", "Date": "April 1, 2013"}, {"Title": "Not satisfy", "Author": "caleb", "ReviewID": "R143WZ319RACV4", "Overall": "2.0", "Content": "i did not like this products because is not what i was looking for and it is not what was describe ,i will recommend it for other customers who need something easier to work with.", "Date": "March 31, 2013"}, {"Title": "Better than I expected", "Author": "Edward Green \"security guy\"", "ReviewID": "R3MA45X2RFCP40", "Overall": "4.0", "Content": "My XV6700 arrived very promptly, with a travel charger, and was in as good if not better condition than described. Even though this is a 6 year old device, I consider the price very reasonable for one in this condition.My only negative comments are, that although the phone arrived undamaged, it was packed loosely in a small box and could easily have been damaged in shipment. Other customers have made similar comments about packing and the speed of shipping, so apparently while the seller is maintaining the one, they are still not paying attention to the other. The other negative thing is the batteries. They shipped two, and they look like the've been around the block so many times they are going straight to the recycler. Of course, it is an old phone, and the seller made no representation about the condition of batteries (or even that they were included), so maybe this isn't a fair comment...I don't know if I'm allowed to mention another seller by name here, but a search for accessories for the XV6700 on Amazon takes you to a link to an external website where they offer what look and hold charge like factory fresh batteries for a very reasonable price. The batteries are shipped from Hong Kong, so maybe 6 year old phones are in common use in that part of the world! The only drawback of these batteries is that they fit so tightly they have to be gently eased out with a screwdriver. But if you can put up with this, or aren't the kind of person who swaps batteries very often, they seem to be OK.", "Date": "June 30, 2012"}, {"Title": "Audiovox XV6700 pocket pc", "Author": "Ray", "ReviewID": "R2IOAWA4VQD1VP", "Overall": "5.0", "Content": "Works great and came with many extra batteries, orig package and Manuals. It was a very reasonable price compared to my FOB original.", "Date": "February 8, 2014"}, {"Title": "phone", "Author": "joe nassiri", "ReviewID": "R1RFO368DIGNOS", "Overall": "1.0", "Content": "The camera doesnt work on the phone.I cannot go into the menu of the phone.They phone only vibrates and no ring tone.  ( regarldess of if i put it in vibrate mode or not )Delay in shipment.", "Date": "January 17, 2013"}, {"Title": "Bad Phone", "Author": "G.Hall", "ReviewID": "RV2CU0PZW8SBO", "Overall": "1.0", "Content": "Phone came in on time. Charge the phone up, phone wouldn't cut off had to take the battery out of the phone,to cut it off. Purchase a new battery now the phone want come on. Bad phone", "Date": "November 8, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Bluetooth Connectivity - Take your talking to the next level with a Bluetooth wireless headset.\n1.3 Megapixel Camera with recording.\nEVDO High Speed Data - Up to 10 times faster than the standard 1xRTT.\nSlide out, touch screen design to reveal a QWERTY Keyboard.\nClear ESN , Ready To Activate, No Contract Required", "Name": "HTC Audiovox XV6700 pocket pc touch phone (Verizon Wireless) CDMA - No Contract Required.", "ImgURL": "http://ecx.images-amazon.com/images/I/41fYiKEMhdL._SY300_.jpg", "ProductID": "B0052Z9OS2"}}