{"Reviews": [{"Title": "Samsung Dud, NOT Gem!", "Author": "Christopher A Hock", "ReviewID": "R2UG8MU7HD93H1", "Overall": "1.0", "Content": "This phone is an epic fail and the only thing \"smart\" about it is in the name smart phone, which is a complete misnomer as I often feel dumbed down when I try to use it!  My old cell phone died on me, and Verizon offered this phone to me for free as a replacement, so I was fortunate not to have spent money on it.  The criticisms are many, but I will just hilight a few of them:Texting.  There is obviously no qwerty keyboard, so you have to use the touchscreen in order to text.  Normally this would be fine, if there were not frequent delays between letter selections because it freezes constantly. I can't tell you how frustrating it is to be texting with someone who has a qwerty, and/or a decent phone and they are rapid firing texts at you, and are three or for text ahead while you are still trying to answer the first one!  The voice to text thing barely works, and is too much hassle to deal with because even though you take your time and enunciate clearly, MOST of the time the thing messes up what you are saying.  \"Let's go fishing on Tuesday\" may come out as \"The pets go twisting and loose play,\" for instance.  ANOTHER thing that bugs the hell out of me is that when texting, don't even TRY to put a period on the end of the sentence.  because right next to the period, is the button for speak text.  YOU WILL hit it constantly, and multiple times.  This will require you to wait 27 days and 19 minutes for the actual speech thing to load and come online before you can hit \"cancel\" and go back to manual texting.  You will, no doubt, feel that your time will be wasted if you skip the period punctuation because you were forced to wait for the speech, so you will hit the period button again and, again, the phone will think you hit the speech thing AGAIN,repeating the cycle.  After the third time you WILL skip the period, and feel defeated, I guarantee you.Automatic Phone Systems.  If you call someplace and have to wait for the computer to run through 97,000 options in order to get where you need to go by pressing the corresponding number, you will go insane here.  The phone will stay on and in the screen until it senses your finger approaching the pad to make your selection and then...it will go dark.  If you have you screen password protected, like i do, you then have to hit the button to bring the screen back up, wait for it for a second, then swipe your pass lock on the screen and make your selection.  Except, by this time, the phone system you called thinks that you didn't hear it, so it begins reading it's selection options again, and, in a few phone systems I have encountered, it makes you wait until it's done through it's schpliel again.  So you wait, go to make your selection and...wait for it...the screen goes out.  Again.  You then learn that, in order to make sure you are not timed out, you keep playing with buttons to keep the screen on, and hopefully one of the buttons you hit wasn't recognized as a secret default choice option...are you guys beginning to see a pattern here?  Oh, and that's WITH any option you pick for screen \"timeout.\"  I have tried them all!Battery life.  Battery life has not been a huge issue for me because i try to use this piece of junk as little as possible.  Standby mode is decent, however, if you plan on using an app, or a navigational system app, forget that you had the phone completely charged when you picked it up, it will be dead in a couple of hours.Pictures and video.  The pictures do not have very high resolution, but they are decent enough if you just like casual, impromptu picture taking.  Video looks decent.  Not top of the line here, but definitely not the worst I have seen.  With that being said, don't think you are going to be taking pictures and sending them right to Facebook or Twitter, because you won't be doing that.  It won't give you the option.  The other issue is with video, you can \"share\" pictures via text, but even a 1 second video, it will not send it, a notice coming up on the screen stating the video is too large.Overall:  Honestly, I have been so, SO close to smashing this thing against the cement that I can't even tell you.  I am not just saying this, I mean it, this phone is the biggest piece of junk that I have EVER seen.  It's not unusual to dislike a product, people either like or don't like things from time to time.  But this, this THING inspires true hatred in me.  On the day that I am due for an upgrade, I am going to RELISH taking the Verizon salesperson out to the parking lot and let them watch me SMASH this thing into a gazillion pieces, and I am not joking, I am going to do that.  And, just to get even for them \"giving\" me this piece of junk in the first place...I am not gonna clean up the mess in their parking lot.  They gave me more angst and aggravation in giving me this thing, I am just giving it back to them in the only form it truly belongs in...a gazillion pieces!!!", "Date": "December 19, 2012"}, {"Title": "Do not buy this phone.", "Author": "Dr.Strangeballz \"Dr.Strangeballz\"", "ReviewID": "R34CGWP5NFY7YC", "Overall": "1.0", "Content": "I got suckered into a 2 year contract with this phone through Verizon. You don't have to look far on the internet to see that other owners of this product are completely disappointed. If you are looking for a smartphone to increase productivity, look elsewhere. This phone always freezes, especially when you really need to use it. You have to pull the battery out many times a day because the phone overheats, sputters, and goes into fits. It can barely do the basics, that is make phone calls and text messages. I have been in situations where I can't make a call for over half an hour because I have to keep restarting this phone. The restart seems to take a minimum of 5 minutes each time. The touch screen often has a delayed reaction of over 15 seconds. This phone should never have been released. It is a total sham, and I feel robbed having been suckered into using this piece of junk. Now I'm tied to it like a boat anchor and for months. At least a boat anchor is useful. The only use this thing has would be as a target, when you go to the pistol range.", "Date": "March 2, 2012"}, {"Title": "Ehhh, there's better.", "Author": "Cazy J", "ReviewID": "R2VEDI3YRYW145", "Overall": "3.0", "Content": "I got this phone about 6 months ago. I don't seem to have the same problems that the other guy here has had. I would say that this thing was very uninspiring though.It is extremely slow. My son is six and can't even stand to play Angry Birds on it cuz the birds fly so slow when you release them from the slingshot. Battery life honestly has been pretty decent. I can get usually two days out of it now cuz I really don't use it as a smart phone much. Only texting and calls.Yes, when you reboot it if you have to, it's a 5 minute process. Slow as hell to come to life. The camera is pretty low pixel. The pics are ok but not great. No flash either. That kinda sucks. I would pass if I were you. Plus side, if you want a cheap smart phone, you'll get what you pay for", "Date": "March 19, 2012"}, {"Title": "not worth the 130 bucks", "Author": "shellybug22", "ReviewID": "R31WOLGVMWM0O6", "Overall": "1.0", "Content": "i bought my phone through ntelos and i thought it was a great deal for an android phone. i soon realized that i wasted my money. the phone was slow & the screen would often freeze up.. i haad to take the battery out of it just to get it to work properly. it was hard typing or playing games because the phone would have a delayed reaction of about 10 or 15 seconds. the youtube videos would rarely play. after 2 months the phone stopped working completely. i will tell anyone, DO NOT BUY THIS PHONE. if you do, youre wasting your money", "Date": "April 19, 2012"}, {"Title": "Average Android Phone", "Author": "DJYKreviews", "ReviewID": "RECXNER5VUPOV", "Overall": "3.0", "Content": "I bought this phone as an Xmas present for my sister. It works fairly well, with the TouchWiz interface and solid performance. The screen is a bit on the smaller side, smaller than the iphone 4 and it does get slow because it does not have the graphics processor that the higher end phones may have. It has very small internal memory so I think you are limited to purchase some apps. Therefore if you do not need the horsepower of a Samsung Galaxy S3, but want to surf the web from time to time, this phone might be a fit for you. The design of the phone is quite interesting and beautiful, but the build quality is mostly plastic and glass.", "Date": "January 20, 2013"}, {"Title": "stuck on this phone", "Author": "kngpn1 \"regular customer\"", "ReviewID": "R2SKTDQLHN6SI", "Overall": "5.0", "Content": "This is my second one and I am stuck on it.  The last one fell in the stove for about 10 minute at 375 a year ago.  And went through the wash about  3 months ago.  I finally decided to replace it.", "Date": "August 4, 2013"}, {"Title": "Short and Simple", "Author": "Adam", "ReviewID": "R3J4OAK0YVR1GJ", "Overall": "1.0", "Content": "I'm going to keep this as simple as I think it can get. DO NOT BUY THIS PHONE! You probably think your getting a deal if you find this phone cheap, well you might as well save the money. This phone sucks for games, sucks for videos, sucks for everything. The screen freezes constantly, and you have to remove the battery or else it just stays frozen. The phone is really slow and is just plain horrible. The only good thing I can find about this phone is the camera. No flash, just a camera. Straight from the box this phone is a piece of junk. DON'T BUY IT!", "Date": "March 31, 2013"}, {"Title": "Buyer Beware", "Author": "FJ Hartman", "ReviewID": "R2BPZUPB6IJN1M", "Overall": "1.0", "Content": "I concur with the disappointment of the other reviewers on the poor perfomance of the Samsung Gem. Had I known of these issues, I would not have \"upgraded\" my Verizon plan to the Gem. The home screen will not unlock without multiple swipes, for no apparent reason the phone locks-up and requires a restart by removing the battery and speech-to-text works about 25% of the time. The other 75% of the time, it displays the aggravating message, \"No speech heard\" even after shouting into the microphone. Believe me, this phone has many nusiances that will try your patience. In summary, do not buy the Samsung Gem!", "Date": "March 17, 2013"}, {"Title": "I have 2 of them. Pray for me.", "Author": "wewa", "ReviewID": "R3HBQ7YB1T5899", "Overall": "1.0", "Content": "The worst phone I have ever owned.We ended up with 2 of them on a 2 year contract and feel trapped.- bluetooth on both never worked. Not to my volvo in car speakerphone, nor any music device such as the logitech UX. Volvo and UX work fine with all our friends phones and our new phones, while we decide to cancel our existing 8100 Gem garbage.No firmware, no fix that I can see. Samsung just stays quiet and never acknowledges their lemon products. That is the risk you take with them for their HDTVs, DVD players, and smartphones that suck.Freezes, unreliable. Makes you wish you stuck with landline.", "Date": "March 17, 2013"}, {"Title": "lied", "Author": "tavia day", "ReviewID": "R3NJ821VR9NPZW", "Overall": "1.0", "Content": "They sent me a phone with an ESN that had an unpaid bill attached to it so i was unable to activate the phone.", "Date": "March 2, 2013"}, {"Title": "AWFUL", "Author": "Jeremy Dodson", "ReviewID": "R1JV2ESN3UBSWJ", "Overall": "1.0", "Content": "Pros.Decent video speeds and loadingWhen not freezing 3g speed is decentConsterrible battery lifefreezes constantlyShuts off randomlytakes forever to boot upbad micro sd port. Deleted my card with years of music and photos on itvery poor touchscreen... infuriatingly unresponsivescreen itself is low res/qualityVery slow operating systemMy very first smart phone was an lg ally. If you need a cheap verizon smartphone look into that. DO NOT BUY THIS PHONE. You will be sorely dissapointed.", "Date": "February 14, 2013"}, {"Title": "Great Phone!", "Author": "XxGWxX", "ReviewID": "R1825T4UZ7Z5JG", "Overall": "4.0", "Content": "This is a very good phone.Mine is a samsung and works very fast and I have had no trouble whats so ever and I got mine about 3 weeks ago.The internet works great and fast.But the pics you take on it will not go to Facebook or Twitter.Every now and then the screen will freeze up when you are texting but it will take like 5 minutes then it will come back.The bad thing is the battery life on the phone is terrible it doesn't even last all day.It has a naigations system that works great and you can get lots of free apps from the Google Play store and they work very fast!Hope this helped", "Date": "July 2, 2012"}, {"Title": "screw vzw and asurion this is the way yo go!", "Author": "JJGRAM3", "ReviewID": "R2O17GQE7IKQK2", "Overall": "5.0", "Content": "I got tired of being screwed bye vzw and asurion every time I broke that dumb a855 motorola piece of crap this 30.00dollar phone will hold me wonderfully till my nov upgrade . I might come out better buying another phone from JasonMills@SoonersoftOnline.com .", "Date": "September 7, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005JGSUVG"}}