{"Reviews": [{"Title": "Great Phone.", "Author": "Reno J. Federighi Jr.", "ReviewID": "R2I19J4GKNDPHL", "Overall": "5.0", "Content": "I love this phone ..At 57 it is so easy to use. The dial buttons are huge and the screen has a setting for giant numbers and letters.. You can see it very well without your cheater glasses.. Very happy.. working very well", "Date": "March 17, 2013"}, {"Title": "Great Service", "Author": "Neal Myers", "ReviewID": "R1A6CWCGS19Z3N", "Overall": "5.0", "Content": "This phone is replacing mine that stopped working. I wanted the same phone because I liked it so well. The best thing about this phone is it looks much better than my old phone and the bonus is it works great.", "Date": "May 9, 2013"}, {"Title": "Nice basic phone", "Author": "Maffru", "ReviewID": "R2BG0QPNJPZ8QA", "Overall": "5.0", "Content": "Fills the need that i have. Coming from a smart phone back to a basic phone was difficult, however this phone make the transition easier.", "Date": "February 5, 2014"}, {"Title": "Great clamshell phone", "Author": "Yaakov \"Yaakov\"", "ReviewID": "R21TTTBTDRWBYQ", "Overall": "5.0", "Content": "This is a great phone.  I don't use a smartphone because I don't like how they work as a phone (I have a mini-tablet for everything else they do).  This phone is GREAT at being a phone.  It's one of the easiest to use, decent reception, and good sound quality (which is important to me).", "Date": "October 21, 2013"}, {"Title": "sold me defective product", "Author": "Rooben Panosian", "ReviewID": "R3JGV8BIZMHBN0", "Overall": "1.0", "Content": "this was supposed to be a new phone, after a few months it keeps dropping calls and has difficulty connecting to the cellular service, thats just bad business wont buy from this schmuck again", "Date": "September 11, 2013"}, {"Title": "Excellent!", "Author": "Glinda Brown", "ReviewID": "RPZIC1XUW616S", "Overall": "5.0", "Content": "Absolutely enjoy this phone and it has become my carry along; with me all the time. It is compact, easy to use, has large buttons, allows user to set large font (type) for the digital readings, has MP3, allows 1 hour of video, takes nice photos, and best of all is that it is sturdy built. Reception is excellent. Call quality is great. It has quick access buttons that allow instant connection to calendar, favorites file (so you can call someone at a touch), messages, and voicemail. The 4-way toggle can be set to instantly access different parts of the main menu. Love having use of an SD Card slot. Charges quickly and holds the charge excellent (days). My travel takes me into low to no reception zones and this phone gets a great signal. I highly enjoy the small front cover screen that shows the time, day, signal status, and has button access to control the music player. This is a great all-around phone. Even my legally-blind husband can find the numbers on the dial pad.", "Date": "June 28, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "* LG VX8370 Handset\n* 1000mAh battery\n* Wall Charger with detachable microUSB cable", "Name": "Verizon LG VX-8370 Clout", "ImgURL": "http://ecx.images-amazon.com/images/I/41Z4CC6oMWL._SY300_.jpg", "ProductID": "B005KFEP42"}}