{"Reviews": [{"Title": "Buyers be ware of UMTS/3G version before you order", "Author": "Armin", "ReviewID": "R20ETHP4GXSDFD", "Overall": "5.0", "Content": "Not a review of the product, but while shopping for a family member I noticed a lot of these are European imports. Language- and feature-wise this does not matter, but the 3G frequency bands are different!If you buy the Europe/Asia 900/2100 MHz HSDPA/UMTS version it will *NOT* have 3G/4G on AT&T; and T Mobile USA.For T Mobile USA you need one with the US 1700/2100 MHz HSDPA/UMTS band. Else the phone will still work, but only at much slower EDGE speeds and you will not be able to use voice and data in parallel.And for AT&T;? Well, so far I have not found any unlocked (or locked) version of the HTC Radar that uses AT&T;'s 3G/4G 1900MHz HSDPA/UMTS band. So AT&T; users, you likely will *NOT* be able to use 3G/4G on this phone at all ...So although this is strictly seen not a review, reading this will likely prevent a lot of returns.On the phone itself, the family member likes the phone after using it for 2 weeks. Good weight, good quality of materials and not too big. Unless you want a bigger screen, I would recommend this phone if you are in the market for a Windows Phone. The Samsungs felt a bit cheaper in plastic feel compared to this one. The Nokia Lumia 800 has a better screen, but this one wins IMHO on overall quality, weight in the hand and feel.", "Date": "January 5, 2012"}, {"Title": "Awesome smartphone", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "RK2DHBK75KLZP", "Overall": "5.0", "Content": "I got the T-Mobile version the day it came out on T-Mobile. Really love this phone. After iOs and Android, Mango is such a fresh yet intuitive system, and it's rock-solid. I've been using this phone non-stop (save for when I sleep) and it's never crashed, unlike my various Android devices. The phone itself is high-quality and stylish, and Mango runs fast on a 1GHz processor and just 386MB of RAM. The only hiccup I've experienced is when playing the HD Kinectimals game and even then it's only occasional and barely noticeable. (The slight hiccup may be due to the multi-tasking nature of Mango.)  Mango has true multi-tasking but at this time pre-Mango apps (including some of Microsoft's own Xbox Live games) cannot take full advantage of it without being updated. I've found all the apps I wanted to have among the 38,000 apps currently available in Marketplace.The most prominent feature in Mango is the Live Tiles on the Start screen (home screen). The live tiles show real-time info displayed by the underlying app. (Not all apps implement live tile updates.) I do wish the size of the tiles could be changed so more fit on one screen, but they are easier on the eye and more informative and thus useful then icons in iOS or Android. The app list, once it reaches a certain number, has alphabet tiles making the apps easier to browse to; but the list itself is always in alphabetical order. (Would be nice to be able to sort them chronologically...) Almost everything about the system is intuitive. A few areas still feel incomplete, but nothing that would distract an everyday experience. And the Metro interface is so intuitive and natural, and does not box you in like the iOS and Android interfaces.The Radar feels great in the hand. The screen is bright and has great viewing angles and contrast, even in bright daylight. The touchscreen is very responsive, way better than any Android phone I've used. The front-facing camera is only VGA so its use is limited, especially when there's only one or two apps at the moment that take full advantage of it (other than the built-in Camera app). Really weird that Skype is still not available now that it's part of Microsoft. Speaking of weirdness, Photosynth, one of the most popular apps on the iOS, is also missing.Gaming on WinPhone is just way better, mainly because of the availability of Xbox Live games. These are real games that look and play like they are developed by professionals, which they are. And they have variety, unlike the good games on Android or iOS all of which feel like they're offshoots of Angry Birds in some way (e.g., the use of elastic physics). I'm really having tons of fun with Xbox Live games for my phone, even though I don't own an Xbox 360 myself. (On the console I'm a PS3 guy.)I really love the HTC Radar 4G.  Everything is what I wanted.  I never felt at home with an iPhone and much less with any Android phone.  I was not a Win Mobile fan, BTW, so I have no attachment to that older platform.  I never used a Blackberry for real.  This is reall the first smartphone, both hardware-wise and software-wise, that I feel I can truly use on a daily -- no, make that minute-by-minute -- basis.", "Date": "November 10, 2011"}, {"Title": "ABE 123 is not a reliable seller", "Author": "shree", "ReviewID": "R2FAG6KRCGD4I3", "Overall": "3.0", "Content": "I am embarrassed by the service of abe123. I bought a HTC radar. Description of the said item clearly states that the cellphone is unlocked and the cost i paid for the mobile is 450USD. I was cheated by abe123. They sent me a mobile that is locked to T-Mobile USA and the invoice i received from ABE123 is for only 100USD. Please don't buy from ABE-123.Nevertheless HTC radar is quite good looking. Perfect to my hand and weight feels just right. Windows mango is quite refreshing to the eyes. I got bored to hell, with the grid layout and numerous icons.I am disappointed by the service of ABE123 and i again reiterate not to buy anything from ABE123.", "Date": "December 25, 2011"}, {"Title": "Just wouldn't work", "Author": "Nita Gombakomba", "ReviewID": "RKS9U6DYBJXJL", "Overall": "1.0", "Content": "It wouldn't work at all! I couldn't get reception for days. It turns out it wasn't unlocked. FGS trading sold me a crappy device. Not happy at all. Don't buy this, from FGS trading anyway.", "Date": "May 11, 2013"}, {"Title": "DO80Q60314N abdias", "Author": "DO80Q60314N", "ReviewID": "R2W08TF5GS0LPC", "Overall": "5.0", "Content": "Hi I would like to pay for this phone but first I want to know if this a GSM phone because it's a GSM phone that I would like buy.", "Date": "August 18, 2013"}, {"Title": "Very nice phone , nice to use.. i m glad to have", "Author": "Nareshkumar Oza \"eleguy\"", "ReviewID": "R2BWGQ10G8JAXH", "Overall": "5.0", "Content": "Very nice phone , nice to use.. i m glad to have this phone very happy to use it ,,", "Date": "July 22, 2013"}, {"Title": "Radar 4G Smartphone", "Author": "JustMe", "ReviewID": "R19OSVAA5LXL6C", "Overall": "4.0", "Content": "I luv the phone. Works great. The only thing I don't like is that it has no slot for an SD memory card. If it had this slot, the phone would have been perfect!", "Date": "November 7, 2012"}, {"Title": "Warning.", "Author": "Niki312", "ReviewID": "R19YQQA1A8JBEX", "Overall": "3.0", "Content": "Warning- this phone does not come unlocked! FGS Trading sold this phone to me, and it did not come unlocked!", "Date": "September 22, 2012"}, {"Title": "A phone working as expected.... excellent!", "Author": "Lorenzo Gonzalez Flores", "ReviewID": "R9EMB8BZM9SLC", "Overall": "4.0", "Content": "The cell phone works excellent!... I'm not giving 5 starts because for two reasons:1)  An European charger was provided instead of a North American2) the usb cable does not fit so well, so I'm having problems to charge it (I'm going to get another usb cable)Talking about the phone, well it is amazing so far (3 weeks working), I bought it for my wife and my kids play with it very often.", "Date": "December 6, 2013"}, {"Title": "very disappointed", "Author": "lady d", "ReviewID": "R2YCDP50DAWMLY", "Overall": "1.0", "Content": "This phone never work it is a lemon. just as I received It I had to return it,  I could not even get it to turn on this phone is defective. I return it back to the seller", "Date": "November 4, 2013"}, {"Title": "not working", "Author": "meenu sharma", "ReviewID": "R31GUVTSV8X12V", "Overall": "1.0", "Content": "i mail you 4-5 days back but no response, phone is not unlock, when i put sim into phone, message comes no sim.please tell me what should i do.", "Date": "October 24, 2013"}, {"Title": "HTC C110E Radar Unlocked Smartphone with Windows Phone OS 7.5, 5MP Camera, Touc", "Author": "misha", "ReviewID": "R326HEMN125PKB", "Overall": "1.0", "Content": "I just received the mobile phone from amazon HTC HTC C110E Radar UnlockedSmartphone with Windows Phone OS 7.5, 5MP Camera, Touchscreen, Wi-Fi,GPS--No Warranty (Metal Silver). I checked it no and it does not work. Ithas system problem. When i click on the applicatiuon buttons it showserrors", "Date": "October 24, 2013"}, {"Title": "great", "Author": "pooh", "ReviewID": "R2TN1WYGOTBMD", "Overall": "5.0", "Content": "Good,I order 2  HTC t9295 in October and it given me trouble,due to the windows 7... but when I order 2 HTC Radars in September..it downloaded stuff easily due to it's 7.5 capability.", "Date": "December 28, 2013"}, {"Title": "PRODUCT REVIEW", "Author": "Thomas MacCarthy", "ReviewID": "RL796QM3001L8", "Overall": "5.0", "Content": "This is a phone that I m proud to own. It is a perfect match to what I was looking for. Very simple but easy to handle and operate.", "Date": "December 27, 2013"}, {"Title": "Greatest", "Author": "Isaac Nunoo", "ReviewID": "R7AWZ37M1FEZN", "Overall": "5.0", "Content": "I am telling everyone about this phone. Awesome. One of the best phones i have ever owned. The perfect one for all.", "Date": "December 6, 2013"}, {"Title": "Very good phone", "Author": "Ariadne Bosch", "ReviewID": "R385AN3JZITTVE", "Overall": "5.0", "Content": "Is a great phone, I bought it for my nephew and he love it, he is very happy with his phone", "Date": "December 6, 2013"}, {"Title": "Perfect HTC phone", "Author": "Vincents Adufu", "ReviewID": "R11IKTW685BHU2", "Overall": "5.0", "Content": "The phone is performing as expected n its a 5 star.i will recommend it to any one who needs HTC phone", "Date": "December 4, 2013"}, {"Title": "my mom is very happy", "Author": "carlos martinez", "ReviewID": "R2YKSGNNPNY1QZ", "Overall": "5.0", "Content": "buy it as a gift for my mother and she loves this phone, so it looks like a girl with a new toy", "Date": "December 3, 2013"}, {"Title": "This phone does not get to your destination ... I just get the empty box ....", "Author": "william GVD \"WGVD\"", "ReviewID": "R266HDHIGDJ1TB", "Overall": "1.0", "Content": "Please hello by ... so you want more Nesecito me solve my immediate problem because this phone or get nunka purchase asu no destination .... I get only empty box without the phone .... I already have several months waiting for me to arrive and nothing .....", "Date": "November 27, 2013"}, {"Title": "LOVE MY PHONE", "Author": "Jerry Austin", "ReviewID": "R1H8KT9VRMHPFS", "Overall": "5.0", "Content": "I love this phone.  Better than the one I got for my wife (Sony Xperia E C1504) and cheaper.  Even has more internal memory.  Only fall back is that I didn't see that it had a slot for adding memory.  Works well here in my location (Ethiopia) and not sure of how it would work with all of its features in the U.S.", "Date": "November 23, 2013"}, {"Title": "Excellent for the price!", "Author": "Rose81", "ReviewID": "R3JBRIYPLBDP3Y", "Overall": "4.0", "Content": "My phone came unlocked and brand new! It's very great for the price..this phone works very fast and takes pretty decent pictures!My only problem is that it don't have an SD card slot..i bought this phone like a month ago and its works fine!The battery life is awesome i would recommend ;)", "Date": "October 20, 2013"}, {"Title": "HTC  C110E", "Author": "PAULINE MWANGI", "ReviewID": "R2I50828RM4UVQ", "Overall": "3.0", "Content": "The phone was okey but the charger/adaptor did not work for me.  There were about 3-4 pieces which i believe was meant for the customer to put together but never worked out.  Believed there was a piece broken because no matter how much i tried  it kept falling apart.  The (1) tiny screw was not playing any purpose coz it kept falling off. plugging it to the wall was a waste of time as the two small metal pieces would not hold on to the wall seemed to be too thin.  All in all the phone was alright but i had to buy another charger.", "Date": "October 9, 2013"}, {"Title": "my order was on right time", "Author": "karami", "ReviewID": "R13T11LF4X1GY6", "Overall": "4.0", "Content": "The item ordered was a gift for my son's birthday. He really like it and i wish to place order again with them. Thank you and it for  good business.", "Date": "October 7, 2013"}, {"Title": "perfect", "Author": "mary", "ReviewID": "R2FQL8Z7JJVGLQ", "Overall": "4.0", "Content": "i like the phone but it has no english manual to show u how and where to go or use it", "Date": "September 9, 2013"}, {"Title": "As I expected.", "Author": "Kaze", "ReviewID": "R1PXV5V62DB4L9", "Overall": "5.0", "Content": "Ok, I need to say that this is not a strong or badass phone. But do I really need that kind of thing? The process just go smoothly, the battery is long enough, no heat from the phone, etc.Great product.", "Date": "January 2, 2013"}, {"Title": "exelent", "Author": "sefedin sallahu", "ReviewID": "R3JHTWH7BFH7FP", "Overall": "5.0", "Content": "works perfect ,,its full unlocked ,,,i use this here at afghanistan where i am working doesent make any problem to me ...", "Date": "December 2, 2012"}, {"Title": "90% happy", "Author": "Jimonly", "ReviewID": "R3GQYF80AWTAXV", "Overall": "4.0", "Content": "This is the second Radar in my household. The first was a T-Mobile unlocked version that I use on the Wal-Mart family plan. All in all very happy with the phone. My wife wanted do replace her iPhone 3gs, since she had some issues with it. After using my Radar a bit, she was pleased with the Windows OS (more intuitive, easier overall than iOS) and decided to go with the same phone. For the money (she wanted a bigger screen, but they were either AT&T; specific, which would give us some of the same data issues as the iPhone) or Android, and both ended up costing more than we could spend. The Radar was it. All in all, a very good phone, love the OS, and would recommend it to anyone. The only small quibble was the one she got is the international version, which doesn't support full 3G data speeds on the T-Mobile network. It runs on the edge (my understanding, about a 2.9G equivalent) and this information was not very prevalent on the sellers info page. Other than that, the phone showed up quickly, was in advertised condition, and don't have any other issues. She kept the phone, and since we spend a lot of time on wi-fi, anyway, it's not as big of an issue as we feared. It's still better than her iPhone!", "Date": "November 26, 2012"}, {"Title": "Hardly worked plus HTC is inept", "Author": "John Carson", "ReviewID": "R208BAI30GDJH9", "Overall": "1.0", "Content": "Once I received the phone, and sent it to my fiance in Honduras; it only worked for about a week then had an issue with the SIM card slot. HTC seemed surprised that it came from Poland. Don't know if that is their issue or this seller's. Sent it to be repaired, they fixed it and sent it back. Worked 3 days, then the phone \"crashed.\" Sent it back again New Year's Eve, did not hear a thing from them for 11 days ( the repair process should take less than 10 days according to them). I called to find out what the deal was and to tell them I would like email updates like the last time. It was on hold for a part, and I got no updates. I did this a few more times for the next two weeks, still nothing happening. Finally Jan. 25th, I was called to see if I would like a replacement, I said yes and gave the appropriate info. The next day, I had the exact same call from them and repeated the process since it didn't make it into their system somehow.Finally, they refused to rush the phone to me so that our friend could take her the phone in Honduras Friday. When I got the replacement phone last Friday, there was no SIM card cover on the phone. Now, I wait for them to get the cover in that they promised me would ship last Friday, and my fiance will now have to wait a few weeks for me to ship her the cover when it actually comes.I'm done with HTC.", "Date": "February 5, 2013"}, {"Title": "no i would give a 5 star but it isnt worth it", "Author": "april west", "ReviewID": "RISTI5QQXQ4UD", "Overall": "1.0", "Content": "Hell no it had polland settings now i have to return it to htc that is who i had to send it back to", "Date": "November 4, 2013"}, {"Title": "Impressed.", "Author": "Julez", "ReviewID": "RFN3W4CGXV23P", "Overall": "4.0", "Content": "First of all understand what you are buying. This is not android or apple. However value for money I am very impressed.Cons: Barely any apps. Barely any free apps. You have to charge daily.  The OS 7.5 is a little dated and thus you will lack access to  newer better apps.Pros: Good quality hardware. Value for money. Windows platform is  familiar and user friendly. I believe the phone is beautifully  designed and thus a pleasure to display in public. Camera comes  with LED flash. Skype on board.If I payed more than $215 for the phone I may not have been so impressed, however at that price I was well pleased with what I got. I bought this phone for my wife and now I'm buying one in a few months for my other wife, kidding, for me. However it has been one month since we got it so standby further review.", "Date": "January 22, 2013"}, {"Title": "good phone", "Author": "Natisha Hall", "ReviewID": "RGX5DW7A8D52X", "Overall": "3.0", "Content": "The shipping was very fast but when I got the phone It wasn't what I was exspecting. If my hubby hadn't had the same phone I would of never of figured out how to switch it from spanish to english. Phone works good but it is not 3g or 4g. If your  looking for 4g this phone is not for you.", "Date": "May 16, 2013"}, {"Title": "Stupid and dumb", "Author": "Bradley J Sack", "ReviewID": "R1NG9A9XN1YK5K", "Overall": "1.0", "Content": "It is so stupid when hey say that they are unlocked but they aren't. It's so stupid. Defiantly not buying this.", "Date": "August 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005JC48NY"}}