{"Reviews": [{"Title": "Pretty Good Thus Far", "Author": "S.Lucian", "ReviewID": "R1MR10VTHFU69Z", "Overall": "5.0", "Content": "I purchased this to replace my mom's old cell phone. She is not too technically savvy and literally just needs a phone to make and receive calls and also to check the time. This has definitely served its purpose. Taken a spill or two and is still going. Very durable and perfect for older individuals as the screen is vivid and the buttons are easily accessible.", "Date": "March 7, 2013"}, {"Title": "Good, simple enough", "Author": "MSM", "ReviewID": "R2SQ1Y1ZSUQGIQ", "Overall": "4.0", "Content": "I purchased this phone as a gift for my mother because she hated her blackberry and couldn't work the buttons well.  This phone was easy enough for her to maneuver and store her contacts, take pictures and text. The slider feature is nice too.  She loves this phone and I'm happy with my purchase.", "Date": "October 16, 2012"}, {"Title": "Great phone", "Author": "AJ", "ReviewID": "RX65OKS7YQFNY", "Overall": "5.0", "Content": "the phone is good and has a great feel to it its a little on the small side so would be better for a women but also can work for men", "Date": "September 3, 2012"}, {"Title": "GREAT phone", "Author": "Evan C", "ReviewID": "RGH4GEYH7F3RZ", "Overall": "5.0", "Content": "Had this phone for 2 years now. It has always worked. Although Internet is a bit Sluggish, Its not something you wouldn't expect.Phone is simple, for any Person. Gets  Job done well.", "Date": "January 16, 2012"}, {"Title": "long battery life", "Author": "Ian S \"Rsayers\"", "ReviewID": "R1CCVQQ5CUCSNB", "Overall": "3.0", "Content": "simple, works a phone, has good volume and very long battery life. I broke the screen within 3 days of having it, but that's my fault, even if it's a little more delicate than expected.", "Date": "March 18, 2013"}, {"Title": "CRAP!~", "Author": "J. Martin Dempster", "ReviewID": "R1EOZ07JOHWZAD", "Overall": "1.0", "Content": "The phone was exactly as advertised, and arrived quickly. However, this technology is outdated and no longer works with the Sprint  system. I got what I asked for, unfortunately what I wanted no longer works. Did the seller know this? I would suppose and/or hope they did, except that they didn't tell me. So, no stars to this seller.", "Date": "January 18, 2013"}, {"Title": "Bad !!! Non working phone!", "Author": "ha m nguyen", "ReviewID": "R2WI0R1O7JZBKX", "Overall": "1.0", "Content": "Bad phone! Charger plug in was very loose did not want to take the charge! Never used it! Money down the drain.", "Date": "January 14, 2014"}, {"Title": "Tough phone, good service from seller.", "Author": "rufus", "ReviewID": "R21BS569Q7FOET", "Overall": "5.0", "Content": "I had two of these phones for five years with no problems. Recently one of the phones stopped taking a charge.  After searching on line for a replacement, I decided that I couldn't do better than with what I had.  The used phone I purchased looks like new and works fine.  I plan on buying another if I have trouble with the other five-year-old phone.  The seller gave very good service.", "Date": "November 11, 2013"}, {"Title": "Very Good Find", "Author": "Herman Atwell", "ReviewID": "R1UVAQ23XBVEGC", "Overall": "4.0", "Content": "Very simple, easy, sharp phone that meets the essential expectations of a user with simple needs. That being my mom. A good find, to be sure.", "Date": "September 19, 2013"}, {"Title": "GRT PHONE", "Author": "RedBone47", "ReviewID": "R2RRG2M4763WBI", "Overall": "5.0", "Content": "PURCHASE THIS FOR MY YOUNG SON AND HE TRULY ENJOY IT AND IT WAS PERFECT FOR HIM TO USE AS HE NEEDED A PH IMMEDIATELY AND RCVD IT TIMELY AND WORKS GRT", "Date": "August 31, 2013"}, {"Title": "awesome cell phone", "Author": "vanessa", "ReviewID": "R9DR50FEEMC9N", "Overall": "5.0", "Content": "i would recommend this cell phone for any sprint users, this cell is small, convenient and durable. i like the seller because he is true to his words. the cell phone was so nice it got stolen lol this is the second cell phone i buy from them. no problems its all good.", "Date": "June 23, 2013"}], "ProductInfo": {"Price": "$90.00", "Features": "Stylish slider phone with brilliant 2-inch color display\nBuilt-in speakerphone and voice dialing for hands-free communication\nThreaded SMS text messaging with T9 predictive text input\nBluetooth enabled; built-in camera with 4x digital zoom\nUp to 6.3 hours of talk time on a single charge", "Name": "Samsung M330 Mobile Cell Phone (Sprint CDMA)", "ImgURL": "http://ecx.images-amazon.com/images/I/51QSTXGKTIL._SY300_.jpg", "ProductID": "B005NK75D2"}}