{"Reviews": [{"Title": "Works great!", "Author": "Renny", "ReviewID": "R2ZCOAXDBHM8XT", "Overall": "5.0", "Content": "Bought this phone to replace my old phone of the same model, and I am still satisfied with it! Im trying to hold off on a data plan as long as I can haha. Some day Ill have to switch over, but for now I will keep buying this phone until I cant anymore", "Date": "April 21, 2013"}, {"Title": "Good phone", "Author": "fann", "ReviewID": "RCHNM2WIBRNJ0", "Overall": "4.0", "Content": "I love the full keyboard to write text messages.Other than that it is a pretty solid phone with basic functionalities..", "Date": "August 3, 2012"}, {"Title": "Reliable, Trusty, Simple.", "Author": "Alice Van Doren", "ReviewID": "R3ID2YZJZRIVDP", "Overall": "5.0", "Content": "I liked this phone initially because it has a touchscreen, slide-out keyboard, and is quite small for a touchscreen phone. If you want a smartphone, this is not the phone for you - the internet is very basic, and rather slow. I like the camera and music capabilities, but the camera's resolution is nothing compared to something like an iphone. The reception on my phone is personally not that great, but I contribute that to my service provider and location more than the phone itself. It's hard to say for sure though.When I first bought this phone, I read reviews online saying that it failed people after several months of use. I have found the OPPOSITE to be true. I have been using this phone for nearly three years. A few months in it was occasionally glitchy while making calls, but that hasn't happened in a very long time, and could have been caused by summer heat. My Seek has been dropped more times than I can count. It has been out in the rain twice, once for several days (after 12 hours in a bin of rice it was completely fine). My friends and I joke about how this phone will never die. Several weeks ago after having tried to go on the internet for the first time, the graphics started malfunctioning, and had been getting worse since then. I thought it was a goner, but today I updated the software, and bingo! Graphics restored. Maybe it will last another 3 years.", "Date": "February 1, 2014"}, {"Title": "So far so good", "Author": "Bob", "ReviewID": "R30YQVW9KRTVGJ", "Overall": "5.0", "Content": "Phone was as described, new in a sealed box, and Sprint had it working in minutes.  Will purchase another as a backup for my other son's phone since they love this phone and really don't want a smartphone.", "Date": "January 14, 2014"}, {"Title": "LOVE AMAZON", "Author": "Ellen Padilla", "ReviewID": "R4QUAR2QQRVQT", "Overall": "5.0", "Content": "I needed a phone for my granddaughter, so I bought her this one. It was brand new like it said, was easy to activate with sprint. No problems with shipping.  An all around good buy.", "Date": "January 4, 2014"}, {"Title": "Very nice cell phone", "Author": "rosa", "ReviewID": "R1GXCF4UNGPFUW", "Overall": "5.0", "Content": "I bought this phone for my son, I bought the blue, looks very nice, he love it. It's a little small but works very well.", "Date": "December 29, 2013"}, {"Title": "Product OK", "Author": "Tammy", "ReviewID": "R37DO8N9PH06DY", "Overall": "3.0", "Content": "This phone had scratches on it that were visible and definitely can tell the phone is used, but the phone works good with no mechanical issues.  Will not use this seller again because I initially received the wrong phone; the replacement was not what was advertised.", "Date": "August 13, 2013"}, {"Title": "Complete Ripoff", "Author": "nancy szilagyi", "ReviewID": "R1UJTEEKU8L02W", "Overall": "1.0", "Content": "This phone is worthless. It's a shoddy, refurbished phone. Our carrier can't even activate the phone because of its connection to the previous owner. Thanks for stealing my money.", "Date": "August 6, 2013"}, {"Title": "Samsung Seek", "Author": "Jocelyn", "ReviewID": "R3OHVXEEGX2X6X", "Overall": "3.0", "Content": "Not a bad phone, but when I go to delete messages or end a call, the phone takes a while to register what I want it to do. I'll slide the button all the way over, but it will just go back and not let me do what I want to do. I really like the keyboard on this phone though!", "Date": "February 23, 2013"}, {"Title": "Small and Grainy", "Author": "Ja-Ja", "ReviewID": "R1ZED4CA20DQAZ", "Overall": "3.0", "Content": "The phone looks much bigger and clearer on the picture. In reality the screen is really grainy, small and hard to see. The phone itself is also VERY small (however it did arrive early and was in great condition). I've requested a return because it doesn't fit my needsUPDATE: I returned the phone and George was GREAT!! I will definitely make future purchases with Cellular by George", "Date": "February 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005NX96I6"}}