{"Reviews": [{"Title": "Loved it!", "Author": "Astalgias", "ReviewID": "R1M2TNFOGE41K5", "Overall": "4.0", "Content": "I absolutely loved the Chocolate by Verizon. I thought it was cute and the service was good and it was great that i could listen to my music and take pictures with it. This was one of the first phones i received that i loved so much i didn't want to give it up. I had it in red and black. Great little phone for the price!", "Date": "May 23, 2013"}, {"Title": "I like it!", "Author": "Kadie", "ReviewID": "R3EUKC24YDO5KD", "Overall": "4.0", "Content": "I purchased this phone and I like it. However, the ESN is that of the LG Cosmo 2, not the Chocolate 2. Verizon was able to activate it fine for me. The battery has some issues. It could be a bad battery or bad connection with the charging port. That is an easy fix though. The phone works great and sound quality for me is what I was looking for. I am happy with my product.", "Date": "April 13, 2013"}, {"Title": "Gift", "Author": "cd", "ReviewID": "R1UPNS925CYQUV", "Overall": "5.0", "Content": "Purchased as a gift for someone who would lose their head if not attached. Looking for cheap and dependable. Phone was in great shape and included a working charger. So far, no problems.", "Date": "March 12, 2013"}, {"Title": "So fast!!!", "Author": "kelly", "ReviewID": "R3V8Y7SGXDDXMM", "Overall": "5.0", "Content": "I should've done a bit more homework before purchasing the phone(I thought it was a flip phone but it's a slider without a qwerty, but it's still much preferred over the Samsung Infuriate I am replacing.  The phone is in excellent condition and arrived amazingly fast- and over the weekend, too!  Everything was included that was supposed to have been + a car charger.  I will absolutely buy from these guys again!", "Date": "April 2, 2012"}, {"Title": "Hate it", "Author": "Katrina", "ReviewID": "R35QS1EDSID6JJ", "Overall": "1.0", "Content": "This item broke the moment I tried to use it.  I programed it to my services and then slid it open to call my daughter and the springs just slid right off.  The seller would not take it back.", "Date": "April 2, 2013"}, {"Title": "junk", "Author": "Patty G.", "ReviewID": "RTHZBAGSB3RUY", "Overall": "1.0", "Content": "falling apart when slide up, was painted and is chipping. not happy. expected it to be light blue not dark.", "Date": "March 25, 2013"}, {"Title": "Got for my sister in law..", "Author": "The Hansen's", "ReviewID": "R28BDJUUFTVDEN", "Overall": "2.0", "Content": "She got 2 of them, one was used the other was new. Both lasted about 6 months. I don't believe they were abused just older type phone that wasn't the best.", "Date": "January 21, 2014"}, {"Title": "Love the phone", "Author": "NW", "ReviewID": "R2IM0SVYNMAOHZ", "Overall": "3.0", "Content": "I love the phone however because it is an older phone it doesn't get ideal service like newer phones do. I have found that I don't get the same level of service when driving certain places that I used to have full bars with a newer phone, also service is not a reliable when in buildings. Overall it is a good phone as long as you stay in an area that has a lot of cell phone towers.", "Date": "October 7, 2013"}, {"Title": "REALLY bad phone. Don't buy it!", "Author": "D. Alexander", "ReviewID": "RN2EECOEDJMW0", "Overall": "1.0", "Content": "This phone had several good, and some bad reviews. Should have listened to the bad reviews!The lousy phone lasted all of one month before it simply stopped working.Don't buy this phone!", "Date": "October 7, 2013"}, {"Title": "Excellent product", "Author": "Nancy Wolf", "ReviewID": "R12S6TU0LS85C1", "Overall": "5.0", "Content": "I love this phone.  It shipped within twelve hours of ordering it and I received it in two days, it even came two days early.  It said it was like new but I could swear it was new.  It was perfectly packaged and came with the battery and charger but sadly no manual of any kind.  I fooled around with it though and got it figured out in no time and I'm loving it.  It's an excellent phone a I highly recommend it to everybody.  WTG seller for doing such a great job. I'll buy from them again!!", "Date": "August 14, 2013"}, {"Title": "Great Replacement Phone", "Author": "Happy Amazon Shopper \"computer geek\"", "ReviewID": "R2RGZ9ZPL6DKEF", "Overall": "5.0", "Content": "My husband, who is not technological, had finally found a phone that he felt comfortable operating.  A month ago, he accidentally dropped his original LG VX8550 phone and broke the screen.  He gets completely frustrated with a smart phone, so looking for another replacement phone became my mission.  I searched Amazon, and thank goodness, you came through again.  I had first purchased a reconditioned LG VX8550 Chocolate for Verizon Wireless, but when it arrived and we tried to set it up, there was a problem with the internal speaker and he was unable to receive or make any phone calls, so that phone had to be returned.  Then I found this Light Blue Phone marked as new and ordered it.  It was wonderful, it worked and now he is a happy camper with another LG VX8550 Chocolate 2 Verizon Phone.  Thanks again Amazon, you saved me!!", "Date": "June 19, 2013"}, {"Title": "Love the LG chocloate 2", "Author": "MJ \"MJ\"", "ReviewID": "RA4SD13O20HCD", "Overall": "5.0", "Content": "Great phone, keep on buying this phone for verizon because it does not require data and the quality on these phones is awesome.", "Date": "April 6, 2013"}, {"Title": "Battery doesn't work", "Author": "Elizabeth DeMarco", "ReviewID": "R3T8W2D4BQZM3S", "Overall": "3.0", "Content": "I was able to fully charge the battery in less than 5 minutes.  I thought that it had come to me mostly charged, but as I used the phone, the battery died quickly.  Fortunately, a friend of mine had an old battery, which works, but is black and doesn't match the phone.  But it WORKS!I would appreciate a rebate for the battery.", "Date": "May 31, 2013"}, {"Title": "Nonworking phone", "Author": "Wyatt", "ReviewID": "R1Z2GV30VI2FWA", "Overall": "1.0", "Content": "We had a few issues with this phone but the biggest one was that it didn't make or receive phone calls. When trying to place a call it would restart, and it didn't receive calls at all. The microSD slot didn't read my SD card either. Very disappointed.", "Date": "February 11, 2013"}, {"Title": "Didnt work", "Author": "Sandy Reaves", "ReviewID": "R3ARUHC3YS5JEA", "Overall": "1.0", "Content": "Was stated in the description that it didnt work, I missed that statement.  - But why would you sell something that didnt work", "Date": "December 10, 2012"}, {"Title": "Blue phone", "Author": "Truthful", "ReviewID": "R4NBW2WR8MQAM", "Overall": "4.0", "Content": "Phone functions well.  Arrived on time.  Clear sound.  Battery life is poor.  No complaints.  Purchased because it was blue.  Silly reason to buy a phone.", "Date": "October 29, 2011"}, {"Title": "Item as described", "Author": "Lisa S.", "ReviewID": "R21LL0OU0FHUK7", "Overall": "5.0", "Content": "This seller was a pleasure to work with. Good communication, fast shipping, and the item arrived as described. The phone is able to pick up signal from Verizon and the basic keypad functions seem to work with no problem. I will be activating the device soon and hopefully will not have any issues!", "Date": "July 13, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Access Verizon's V Cast Music and Video service via fast EV-DO data network; GPS-enabled for turn-by-turn directions\n1.3-megapixel camera with video recording (QCIF resolution); MP3 and WMA compatibility\nBluetooth connectivity for stereo music streaming; MicroSD expansion; USB connectivity supports charging\nUp to 4.2 hours of talk time, up to 350 hours (14+ days) of standby time; measures 3.85 x 1.87 x 0.67 inches (HxWxD)\nClear ESN , Ready To Activate, No Contract Required. Includes Phone, Battery, and Wall Charger. (Phone only, No Service)", "Name": "LG VX8550 Chocolate 2 Verizon Phone - Light Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/51EXYKxV7xL._SX300_.jpg", "ProductID": "B005KN5ZI4"}}