{"Reviews": [{"Title": "BlackBerry 8520", "Author": "edinson", "ReviewID": "R2XCJ801IRWO5U", "Overall": "3.0", "Content": "This is a decent phone with some really great features. In town it perfect.Pay as You Go lets you stay connected with no monthly payments, no hidden fees; Wi-Fi networking plus Wi-Fi Calling capabilities2-megapixel camera/camcorder; Bluetooth stereo music; microSD memory expansion; personal and corporate e-mailUp to 4.5 hours of talk time, up to 408 hours (17 days) of standby time; released in August, 2009What's in the Box: handset, battery, charger, wired stereo hands-free headset, USB cable, quick start guide", "Date": "May 9, 2013"}, {"Title": "Good BlackBerry but....", "Author": "Ron", "ReviewID": "RKNRAZ822V2ME", "Overall": "4.0", "Content": "This is a decent phone with some really great features. It also will work perfectly with a 32GB memory card! HOWEVER...The problem for me is the limited T-Mobile coverage. In town it perfect, full bars everywhere but... Hit the highway on a road trip and my coverage ends just a few miles past the Colorado border. It's NO fun not having a signal while driving through the Utah desert!", "Date": "July 8, 2012"}, {"Title": "A good buy", "Author": "Btroopmomof5", "ReviewID": "R1DV3YZLUQ0LJF", "Overall": "4.0", "Content": "I have enjoyed my blackberry. It has a camera that takes beautiful pictures. My only complaint is that calls fail at times. It has something to do with it having wi-fi. I love my blackberry otherwise ....Karen from st. Louis", "Date": "May 25, 2012"}, {"Title": "Seller Great but Phone was a Lemon", "Author": "smann", "ReviewID": "R1O0PRPL8CMOD3", "Overall": "2.0", "Content": "Had phone for 1 day ball only work half the time I think it was a lemon, 1st blackberry so leary of another one.", "Date": "May 24, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Access all your e-mail and messaging as well as social networking sites like Facebook and MySpace; full QWERTY keyboard with touch-sensitive optical trackpad\nPay as You Go lets you stay connected with no monthly payments, no hidden fees; Wi-Fi networking plus Wi-Fi Calling capabilities\n2-megapixel camera/camcorder; Bluetooth stereo music; microSD memory expansion; personal and corporate e-mail\nUp to 4.5 hours of talk time, up to 408 hours (17 days) of standby time; released in August, 2009\nWhat's in the Box: handset, battery, charger, wired stereo hands-free headset, USB cable, quick start guide", "Name": "BlackBerry 8520 Prepaid Phone (T-Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/512ekFFJkUL._SY300_.jpg", "ProductID": "B005O108KW"}}