{"Reviews": [{"Title": "desde Venezuela", "Author": "Urbaneja", "ReviewID": "R3T9BK8IGYFTI2", "Overall": "5.0", "Content": "me encantó este producto!... a pesar de que apenas hoy me llegó después de 2 meses y dos semanas de espera, al tenerlo en mis manos, me ha encantado, ha valido la pena gastar mis 400 dolares y un poco más en este celular... lo recomiendo.", "Date": "March 19, 2013"}, {"Title": "the phone went faulty", "Author": "juan carlos fuentes", "ReviewID": "RAAQSE1QSJSW2", "Overall": "1.0", "Content": "the phone went faulty the seller refund the money, the pricipio worked well, but despuesd a couple weeks and stayed at home and did not want to run more, so he was returned to the seller to replace or repair it, but decided to return the money", "Date": "December 23, 2012"}, {"Title": "The phone is good, but....", "Author": "Zumba", "ReviewID": "R3GAEMPCZ7EXPQ", "Overall": "1.0", "Content": "The phone has good features, but it came with factory default. He presents the sleep of death, and samsung has no technical support for devices purchased outside of Brazil.Think twice before buying handsets from Samsung.", "Date": "December 21, 2012"}, {"Title": "The phone didn't work and I'm completely dissappointed with it. I couldn't use it for more than one day", "Author": "Ana", "ReviewID": "R41FCV53O41IT", "Overall": "1.0", "Content": "The phone didn't work. Every time I charge it the battery goes discharged. I thought at the beginning it was a battery issue so I bought a new one, but then the same happened. Now there is an error in the phone as it didn't allow me to update the Android version. I took the phone to the official Samsung Customer Service office and I was told the repair will cost me 2000 argentinian pesos. I'm completely dissappointed with the phone because I couldn't use it for more than one day and it got broken.", "Date": "October 8, 2013"}, {"Title": "POOR QUALITY", "Author": "KELEL R.", "ReviewID": "R2KCEF4IACLW66", "Overall": "3.0", "Content": "SOLD ME EQUIPMENT FAILURE PRESENTS QUICK DISCHARGE BATTERY, HEATED ADDITION, YOU BUY A NEW BATTERY AND STILL CONTINUING FAILURE IS VERY POOR. DO NOT RECOMMEND", "Date": "September 9, 2013"}, {"Title": "Phone", "Author": "Georgia Duckworth-Jones", "ReviewID": "RVC5N9QWSD07P", "Overall": "1.0", "Content": "Sent back smaller phone than I wanted so I returned it felt they should not have charged me for restocking after I had to pay to send it back and I never used it!!!", "Date": "May 1, 2013"}, {"Title": "Damaged telephone", "Author": "Alvins Heredia", "ReviewID": "R3KJ87CSXBVEMR", "Overall": "1.0", "Content": "Good evening, want him to inform that I did a purchase of a galaxy s2 and the telephone I come near damaged", "Date": "March 4, 2013"}, {"Title": "Excelente", "Author": "Carlos Contreras", "ReviewID": "R12QR04H9VUMF4", "Overall": "5.0", "Content": "Excelente equipo. Lo unico es que posee los perfiles (APN) de Movistar España y al ingresar los de mi operadora DIGITEL Venezuela, no los guarda y los elimina. Obviamente no recibe datos por esta vía. Debo investigar eso.", "Date": "February 8, 2013"}, {"Title": "entrega", "Author": "zunymillan", "ReviewID": "R1R0J7KT7IPYZ1", "Overall": "5.0", "Content": "Excelente y rápida sin problemas el equipo me llegó en buenas condiciones sin retrasos recomendable en todo los sentidos la liberación del equipo buena sin problemas con mi proveedor", "Date": "January 29, 2013"}, {"Title": "Samsung I9100 Galaxy SII", "Author": "samsung I 9100 galazxy s II", "ReviewID": "RGB5WHXADDH4B", "Overall": "5.0", "Content": "Is simply the best phone I ever haw and I haw many Android :))It haw excellend camera is fast is T-PHONE", "Date": "July 31, 2012"}, {"Title": "SMH", "Author": "Milk", "ReviewID": "R394IHO0AK1HPJ", "Overall": "1.0", "Content": "the device is very nice looking. but the device i received has some sort of screen disfunction. the pictures look terrible. all graphics on the phone are terrible.", "Date": "November 27, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005LHO5RG"}}