{"Reviews": [{"Title": "Pretty Decent Phone", "Author": "T-Bone \"T-Bone\"", "ReviewID": "R1KG0ZCL87FDRE", "Overall": "4.0", "Content": "Let me say I wasn't expecting much but this little phone surprised me.  I read reviews about bad voice quality but haven't seemed to have that problem at all.  Much nicer than the LG Contour (Craptour) in my opinion. I also had to laugh when I walked into a Metro PCS store to see that they were charging $69 for this $39 phone on Amazon.", "Date": "August 16, 2012"}, {"Title": "Great phone for the price", "Author": "sues", "ReviewID": "RUN3IZHW5U9E1", "Overall": "4.0", "Content": "I didn't want to spend alot on a phone and needed just a basic one.This fits all my needs for what I use a phone for.I would recommend this phone highly.", "Date": "September 16, 2012"}, {"Title": "Great Phone For The Price", "Author": "VenegasGirl", "ReviewID": "R1DJFM4VBXNSKP", "Overall": "5.0", "Content": "My 8 year old daughter begged her father until he caved and allowed her to have a phone. We went to Metro and got this phone. For the price it has been worth it. The speaker phone kind of sucks but the rest of it is good. The texting is easy on this phone and it is really easy to download music from my Droid to her phone via Bluetooth. All around it is a GREAT phone for the price.", "Date": "August 22, 2012"}, {"Title": "No frills, great phone!", "Author": "H B", "ReviewID": "R1B0QNY3IR27IE", "Overall": "5.0", "Content": "Got this in a $25/month plan from metropcs. It's a great phone, battery lasts longer than the similar Samsung phone (my wife has the samsung, and I took this one).Looks better too!The samsung has voice caller ID (speaking the name of the person who's calling you), this one does not.The samsung has like 3-5 days of battery life. This phone has 5-7 days of battery life; and it lasts longer on a charge playing MP3, than my aged mp3 player (plays ~10 hrs of MP3 with large headphones, possibly longer with small headphones).The equalizer is basic though; not too much variation on settings.Apart from a media player, it has a same mpix camera as the samsung, but the display is noticeably of a slightly lower quality (Samsung's pixels are bigger, with this huawei you can still see the black space inbetween pixels).It has alarm clock, blue tooth, calculator, memo, voice recorder, stopwatch, calendar,and world time.The weather function does not work, because it needs internet.In case you take the more expensive $50 plan you can get single speed internet included, with which you can connect to the internet to download apps (none are free).The rest you get the regular metropcs crap, like 411, my extra's, metro app store. Do know you're only able to receive regular spam (you can disable it) about promotions, but you're not able to go on the internet.If voice dialing is not your thing, then the Huawei is a better buy! $10 cheaper too!", "Date": "September 12, 2012"}, {"Title": "Great phone", "Author": "Mrzmendoza", "ReviewID": "RX64A2SH0YWNS", "Overall": "5.0", "Content": "I bought this phone for my son. So far it works great, it hasn't broke and he's happy with it.", "Date": "July 24, 2012"}, {"Title": "Perfect :)", "Author": "Norma", "ReviewID": "R395SNH5EOSA6Y", "Overall": "5.0", "Content": "I love this phone :D It's an incredible price for such a beautiful phone. Works smoothly and does it's job and looks good while doing it(: lol you can get an MP3 player for the price of this phone and it doubles as one, that's just one way this phone is an incredible value :D I'm really happy with my purchase.", "Date": "July 20, 2012"}, {"Title": "Good Phone..But not Smart", "Author": "cindi", "ReviewID": "R2HEHFSOL2772S", "Overall": "2.0", "Content": "I thought I could take pictures and receive my emails :(Only good thing is the keyboard..I thought it worked like a Blackberry", "Date": "May 14, 2013"}, {"Title": "Best Phone ever", "Author": "Love Ipad", "ReviewID": "RXOIFQOSJM1UF", "Overall": "5.0", "Content": "This is the best non-smartphone from MetroPCS with very good battery life and features like Mp3 Player, video recording and expandable memory.", "Date": "April 11, 2013"}, {"Title": "Never get this phone!!!", "Author": "hi", "ReviewID": "R1Z055KVR427D1", "Overall": "1.0", "Content": "This phone is horrible. It always freezes and turns off on me for no reason. Im telling you waste of your money. Plus the camera is terrible so is the speaker. I barley can hear anyone when i talk! I dont recoment this phone to anyone!", "Date": "January 17, 2013"}, {"Title": "Mom Loves it !!!", "Author": "Tamara", "ReviewID": "R29LESBYG8KWMU", "Overall": "5.0", "Content": "my mom really loves the phone. She loves it for the texting purpose as well because she is a newbie to the texting world. Great Price !", "Date": "March 28, 2013"}, {"Title": "LOVE THIS PRODUCT", "Author": "CL", "ReviewID": "RNGQ7FMKMF91", "Overall": "5.0", "Content": "I BROUGHT THIS PHONE FOR MY DAUGHTER A YEAR AGO AND SHE LOVED IT SO MUCH THAT WHEN THE ORIGINAL ONE WAS RAN OVER BY A CAR SHE WAITED 3 MONTHS FOR ME TO FIND HER A NEW ONE.  THIS PHONE IS VERY INEXPENSIVE AND DOES EVERY SINGLE THING MY EXPENSIVE PHONE CAN DO.", "Date": "January 13, 2013"}, {"Title": "Excellent messaging phone that does its job and more", "Author": "WAZA", "ReviewID": "R14BVU4LI5Z0HJ", "Overall": "5.0", "Content": "i love this phone. Its a messaging phone that does its job and more. I think the keyboard is better than the BlackBerry keyboard because its better spaced out. Overall if you text alot you are gonna love it", "Date": "July 3, 2012"}, {"Title": "Loves It!!!", "Author": "tj", "ReviewID": "R1UVNBMM2K5V9A", "Overall": "5.0", "Content": "Bought this phone for my daughter and she loves this phone!! Plus it was cheap!! If you have a teenager working a part-time job in school and they want a cell phone, Amazon.com is the way to go. Instead of me adding a family plan to my account, she has an account with Metro PCS and it's a month to month plan basis without a contract!!!", "Date": "February 17, 2012"}, {"Title": "Bought for my honey", "Author": "Debra Simmons", "ReviewID": "R15TS7UXH0YS9X", "Overall": "5.0", "Content": "my husband loves his phone. He doesn't like the small keyboard, but he loves the fact that he doesn't have to press the same key 4 or 5 times to get the letter or number he wants", "Date": "February 5, 2013"}, {"Title": "ok but was disappointed", "Author": "geargirl247", "ReviewID": "R266ADHW14LAST", "Overall": "3.0", "Content": "This phone dosent have the durablity of the freeform II or III. It worked well but ease of use left more to be desired. the video capture was not all that great.", "Date": "December 14, 2012"}, {"Title": "You get what you pay for !", "Author": "Frank Noethe", "ReviewID": "R2UTB0VR17SISP", "Overall": "2.0", "Content": "Reading the other reviews, you must have gotten a better version then I did. Entry level phone that was sold for $ 50 at Metro PCS stores at the time. They now sell a newer version of this phone.We have two of these and they both have the same issues. Battery life is crap with Metro PCS constantly sending you advertising 24 hours a day. If you turn the phone off, the battery keeps a decent charge.Camera is is mediocre, you need to buy a memory card to store video or more then a few pictures.Most annoying issue, the phones will turn off after the first ring on an incoming call. Both our phones have this issue at times !Phone then reboots for about thirty to sixty seconds.", "Date": "December 10, 2013"}, {"Title": "unable to connect it", "Author": "Beth", "ReviewID": "R1PEG1O6FYG547", "Overall": "3.0", "Content": "When I received the phone, I was unable to hook it up. I called customer service and it still wasn't able to be hooked up. I gave up after that. It was a waist of money.", "Date": "August 3, 2013"}, {"Title": "whoa!", "Author": "yung l", "ReviewID": "R24CFQ9818BAWP", "Overall": "5.0", "Content": "i pay 25$ a month!!! thats a deal .. that and because i got the promotion so ha ha ha ha ha ha h ah ah aha", "Date": "September 4, 2012"}, {"Title": "Nice and cheap", "Author": "Z. Djatdoev", "ReviewID": "R3IQUEQF3PY3KH", "Overall": "5.0", "Content": "Cheaper than on Metro PCS website or store: you save $20 plus taxes. Good nice phone, not a smart phone, don't be decieved, but a very reliable one", "Date": "July 4, 2012"}, {"Title": "I should have looked at the product in person, before purchasing it.", "Author": "Fredrick R. Smoot \"Freddy Smoot\"", "ReviewID": "R3233QLQ6YJPPM", "Overall": "2.0", "Content": "My thumbs get in the way of of the small buttoms,causing some un-anticipated changes with many of the features.And if you wear glasses...your in for some difficult moments. Sorry I should have at least actually had one in my hands to check out the phone before hand.....My Mistake!  Fred Smoot", "Date": "August 31, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005WJJKE6"}}