{"Reviews": [{"Title": "they don`t include the dre beats headsets", "Author": "issa", "ReviewID": "R1878J6CQULZPW", "Overall": "1.0", "Content": "don`t buy from this seller they don`t include the dr dre beats headsets like they should. the box is smaller than the original one.there are two kind of boxing for this phone the smal box(phone sized)and the bigger one that include the dre beats as it shows the dre sets on the box.you can buy the phone including dre beats headsets(the big box) from other sellers from amazon with only 20usd more like FGSAND make sure you call the seller before you buy to ask about the dre headsets.and by reading the customer reviews to be sure.it is a great phone but i feel riped off from the seller for not giving me what i asked for", "Date": "October 15, 2012"}, {"Title": "This phone is SWAG!!!!", "Author": "Shoxter \"JMM\"", "ReviewID": "R242MJ6P6II7KF", "Overall": "5.0", "Content": "I've always been looking for a phone that would make my heart melt and this is the first phone in a decade that has been able to do that. Before I discuss to you what I so love about this phone, I'll tell you what phones I've purchased over the years:From 1999-2011:- Nokia 3210- Nokia 3330- Nokia 3350- Nokia 3650- Nokia 6600- Sony Ericsson k700i- Sony Ericsson W800i- Sony Ericsson W880i- Sony Ericsson W902i- Sony Ericsson Xperia X10i- HTC Sensation XE and Blackberry Curve 3600Now, I'm going to talk about the HTC Sensation XE.I discovered this phone thanks to a friend of mine who showed it to me at an HTC store. The first time I set my eyes on it, I immediately had a crush on it. But the moment I held it in my hand and touched it, then tried out the Beats headphones that came with it, I fell in love.Now, I don't want to waste your time with platitudes of why I love this phone in the abstract sense, pun not intended. I'll get to the technical nitty gritty. Tee hee! Here we go:PROS:- The LCD display is vibrant and the colors pop out. No delay on the response whatsoever.- Uses gorilla glass, so it won't scratch if you drop it.- Body: the body is tight and swag. Its metallic finish is engineered to perfection. Quite sturdy and looks like a sports car type phone.- has red earpiece, red lighted menu buttons, and a beats logo imprinted at the back of its black varnished metallic body- performance wise, this phone is a beast. It has dual core, 1.5Ghz processor, but the battery life is splendid. Would last you a good 12-15 hours under normal operations (data or wi-fi included)- the Sense 3.0 UI is luscious  - the HTC keyboard supports swype technology natively (calls it trace) so you wouldn't need to install Swype. Just like what people said, the HTC keyboard reads your mind.  -Widgets are fluid and they are all in 3D, an up from the usual gingerbread stock screen flipping mechanism.  - Immediately syncs with your google account, so all your contacts will sync perfectly. On top of that, this will even sync with Facebook contacts, Twitter contacts, LinkedIn contacts, Skype contacts and Plurk contacts.- Music playback performance is top notch. Uses the beats software to enhance the sound even further, not to mention that the sound quality using ordinary headsets is already excellent, the software together with the beats headset takes it a mile further. This phone is a total iPOD/iPhone replacement. I'm running the equalizer app from the Android app store, and the nuances of tweaking and mixing the sound is stupendous. The options for mixing the songs are limitless, you'll actually be spending hours and hours just re-listening to your music library on this phone. I'm yet to try FLAC though. I'll update this review once I tried FLAC on this phone.- Video playback is excellent. It's like carrying a high definition TV in your pocket. Even the sound of the video playback is supported by Beats.- Photo shots blew me away. It's the first time for me to take photos and not have to enhance or edit them. The photos that came out make my photos look like they're professionally taken. Amazing!!!- Video recording is also top notch - 1080p!!! Crisp and clear even when playing on my TV.- Supports DLNA: Simply install Airsync from the Android market and you can stream content right away to your network.- Did I just make you salivate with this phone? I'm sure it did!!! There are still a million other features that I'm discovering with this phone everyday I use it. I'm just astounded at how much power this phone has!!!CONS:- NONE!!!OVERALL:- Buy this phone!!!UPDATE: 01/19/2012Though I myself haven't experienced scratches on my phone's gorilla glass, it's still safer to put a screenguard just to be on the safe side.", "Date": "December 30, 2011"}, {"Title": "Quality.", "Author": "Vash Stampfon", "ReviewID": "R2OEH8LZIIFEFW", "Overall": "5.0", "Content": "Just a great phone. Ive dropped it a fews times but still works fine. You'll feel the difference from Samsungs and other brands.", "Date": "November 13, 2012"}, {"Title": "HTC Sensation XE", "Author": "Dmitry", "ReviewID": "R3HFP3OKCWENL6", "Overall": "5.0", "Content": "The device is simply wonderful. Skipping menus,browsing internet, as far as games & business applications start in a moment and work perfectly without any bugs. Camera is also quite good in comparison with smartphones having  the same matrix such as Nokia.The update to Android 4.0.3 is also available what allows to fix some system bugs and make interface more friendly. The only problem I face to is that the battery discharges quickly jus after 6 hours of active use not including Wi-fi to be switched on.", "Date": "August 25, 2012"}, {"Title": "COMPREHENSIVE REVIEW.", "Author": "Harkanwar Anand", "ReviewID": "R2JG8EFVE8AJ2A", "Overall": "3.0", "Content": "I was debating between this phone, the Sensation and the Sensation XL. I wasn't sure I wanted a white phone so I didn't go for the XL, the Sensation is supposed to have a slower processor and XE looks consistent and comes with Dre head phones so I chose this phone once I saw how the desktop looked. You see I'm coming from a Blackberry Torch 2 so my eyes ache for a big screen, better browsing and a better graphical experience to say the least. I would be using the phone for personal use and I didn't want to go with Samsung because I'm a Htc loyalist ever since I used the classy HTC Evo. The Samsung Nexus Prime would be the biggest competition to this phone. It came with Android 2.3 .. which was a little surprising and I still havent been able to update to the new operating system so I'm a little peeved but patient because there is not a lot about this operating system to change. I shall discuss features first ...1. The phone is snappy and nothing takes long to load. Maps opens up easily, it is perfectly capable of downloading five mp3 songs at once, doing mail, doing google maps, taking a picture...the integration with Google is still not very good I feel. I understand Android is made on the Google platform but seriously the Browser is abysmal. There is an alternate browser I found and loved. Firefox...I don't think I would be able to stand this phone sometimes if it was not for speedy old Firefox. The browsing experience was decent but MULTITASKING is good with the snappy processor.2. The software loaded is quite similar to HTC Evo's original software. The icon spacing seems good, there are quite a few screens which I have customized. The WEATHER looks exotic and eye-catching. When you press menu, you can either go through all your applications or slide right and fetch \"Frequent\" or slide right again and fetch \"Downloads\" - I have been a bigger fan of the Htc Sense than Samsung Wiz. Htc just seems to have a better built and sturdiness.3. The screen is 4.3 , the phone is not heavy, the screen is a little underwhelming to be honest. I say that because it appears a little plasticky much like the Evo 3d. The Evo used a different kind of a screen but that was easy to break. HTC really need to improve quality of screen. Viewing a video is good but the phone is a tad too responsive sometimes which takes away from the experience. Mp4 files play easily. There is a red light which remains constantly flashing when phone is charging and it goes green when the charge is complete. I find the unlock screen a little annoying though. I don't like that circle you gotta drag up and miss the simple old \"Slide Down\"4. Applications - I use Google Reader for my .epub files and it works just great except when you move the phone a little towards the right it thinks you want landscape mode. The bookshelf looks great so guys if you're away from your Kindle you can read books on this phone yes. I use Pulse for tech news, have several radio station apps, also three mp3 downloader apps, use WINAMP for music (music library, not 1/3rd as good as an iphone) Shazam works \"OK\" but I have discovered Soundhound. Espn applications keep me updated on NBA scores because I am living in the Middle-East for the time being. Youtube is a little disappointing and not as consistent as an iphone i am sorry to say. Again, Android surprises me because it doesn't make great use of Google or Youtube. Maybe with the next operating system this will seem more rounded.5. Music Player / Head phones - The red dre headphones are legendary and I love them. They're not very loud and I never talk on them because people around me think I'm screaming if I start yelling into my earphones at say the gym. The bass is consistent and the red looks good though I wish the chord was a little longer. I have never used the accompanied case or the headphones. I pray these never go bad. I use them with my ipod and laptop too.6. Typing - It is surprisingly difficult to type on this and I blame the quality of the screen for it. You cannot go very fast. I can fly on a blackberry or the iphone but this phone can sometimes be agnonizing when you're driving or say walking ... Also NO SWYPE. I should take one entire star off for this alone. Come on HTC!7. Camera - The camera is very good though you need to make sure you know what you're doing because it is like having a pet that needs to be nurtured and tamed and understood. You gotta focus on the object, you gotta make sure the light is satisfactory, the object is still and BOOM the photos are very good. In one month I've taken say 500. I seldom indulge in the MIRROR or self portraits. It works good though. Well done hTC.8. LOUD SPEAKER - The speaker is very low so it not a good music player. The volume is 35% as loud as it should be. No excuse for this lapse since HTC is trying to focus so hard on multimedia. Samsung owns HTC in this respect (Also Apple)The ear phone speaker when you are talking is appalling. Worst ever.9. BATTERY LIFE IS GREAT - This phone lasts me 20 hours which is more than any stock battery for any Android has lasted me. Make sure you never leave the house with just 20% remaining though. I use the phone a lot for browsing, checking game scores, checking email .... very good experience with the battery. Pleasant surprise because I was expecting it to last me 12 hours at most. It has also lasted me 24 hours a few times. I keep my wifi on all the time because my servie provider provides just 500MB of data a month. (Joke, I know)10. Miscallenous/Relevant Facts - The Wifi is responsive and picks up easily. The screen can sometimes forget to turn off so makes sure you make a shortcut for your display settings. This has been one issue Htc hasnt been able to correct. Typing is average, ear phone speaker is the lowest I have had on any phone I have used. I really really hate that but I am going to keep this phone for a while.11. Big thumbs up for the transfer my stuff interface12. Emails are good but they need a new interface real bad.Overall this phone is a mixed bag but I love Android. I don't talk on the phone much but when I do this phone doesn't disappoint unless I'm in a room full of people , then I just text the person or use whatsapp. It is a really good looking phone and I love the design and holding it. I use no SCREEN PROTECTOR or CASE. It is light. Connecting to MAC via USB is easy and bluetooth is even easier.It heats a lot less than other androids I've used.HTC really need to step the game up. I wish the speaker was louder, I wish the ear phone speaker was louder too, this phone should have had Swype and the typing shouldn't be so annoying..I am grateful to Android for doing so much improvement in the Market. You will never be bored with such a phone. I wish they made Google integration more understandable and simple. It is a bit too open - source for me.Youtube should play a lot better. The phone supports all formats and video watching is a pleasure.", "Date": "March 1, 2012"}, {"Title": "HTC Sensation XE", "Author": "Beato1982", "ReviewID": "R1TM4W4NYL9S3E", "Overall": "5.0", "Content": "The phone it self is amazing. The HTC sensation Xe is a very fast gadget with plenty of HTC qualities. It's brand new, no defects. It was delivered on time and I have received on the exact expected day of delivery.", "Date": "December 24, 2011"}, {"Title": "theworst buy", "Author": "aun sin opinion", "ReviewID": "R306S1E9GWXZNE", "Overall": "1.0", "Content": "the worst purchase I have done for amazon, the phone does not work at all does not bring as described in publucacion (no original accessories) packing pesimo product is not a new product came with a defect in the microphone and cobetura, what worst of the worst", "Date": "December 20, 2013"}, {"Title": "Photos do not meet what's inside the box", "Author": "Back", "ReviewID": "R1JFFIOB76HKLI", "Overall": "1.0", "Content": "It came locked, without the original box nor the Beats earphones (cheap plastic earphones instead). In a way or another you can call this a scam.", "Date": "December 13, 2013"}, {"Title": "be aware ...", "Author": "petrencu adrian daniel", "ReviewID": "R26JAGWR9V70L8", "Overall": "1.0", "Content": "Usually I am not write a review , This time is totally different , away from my expectation. Next buyers must be aware for so called \"international model\" I bought two of them, One from \"Blaine Store\" and one from \"cell lounge store\" first came with everything in the box how it suppose to be ,with beats inside the box and original accessories, how was advertised as a new phone, But... the phone with microphone issue. (now is in the shop repair) Not mentioned overdue shipping(not shipped from US as advertising ) I called due to overdue shipping and the answer was..” your package is in customs and you will get a shipping update soon” . The phone what I bought from cell lounge store….a totally different story. When I received the phone in my mail box was early then I expected. Surprise came when I opened the package. Here is what I found inside:1st. There is no original box from HTC2nd No original data cable from HTC3rd No original charger from htc4th No iBeats earphone from htc in the box. I found inside cheap earphone the same model found in dollar store .5th No plastic foil on the screen how a new phone should look like.When I open a new phone I know that I have to make kind of settings, remove plastic cover from the screen, chose language from menu and so on...On this phone was a long list in the web history(google,facebook and so on). You can say about this phone that is an open item but not new. It looks as a new phone with no issue, with no original accessories and no plastic foil on screen. I called Cell lounge and the answer was totally a shock for me. They said it is a new phone and when I asked about accessories they offer me a refund or change the phone or they can send me the original charger and cable , no ear phone. For that I have to pay extra. when I asked what means for them a new phone with beats, the answer was..With the software inside the phone and logo on the back cover. I refused what they offered to me because I am not accepting only half of what they suppose to do from the beginning as they advertizing on amazon.com, with the mention of writing this review as is.", "Date": "December 2, 2013"}, {"Title": "Did not work well for me", "Author": "Trace Salmon", "ReviewID": "R34W3Q1QRUTWDX", "Overall": "2.0", "Content": "I had to endure numerous problems with this phone until I was able to cancel my contract with T-Mobile (worse carrier of the 4 major) and get the Galaxy S4 with AT&T.;", "Date": "October 28, 2013"}, {"Title": "Worse mobile phone I have owned!", "Author": "Linaka", "ReviewID": "R2E7SYCLXP6KTI", "Overall": "1.0", "Content": "There are so many issues about this phone, too many to list.  Also some of the issues could be due to T-Mobile's terrible coverage.  I now (since yesterday) have the Galaxy S4 with AT&T; and can actually make calls and get online (consistently) for the first time in 10 months.  It is like night and day. I am so glad the 2 year contract with T-Mobile is finally over.", "Date": "August 24, 2013"}, {"Title": "no beats headset", "Author": "Xavier", "ReviewID": "R21VS4H5WZVZC2", "Overall": "4.0", "Content": "didn't get the beats headset or the 16g memory card as described when said comes with everything inbox, shipping was fast phone seems to bw working", "Date": "August 8, 2013"}, {"Title": "Fake HTC!!", "Author": "Serge", "ReviewID": "RW8F2R0B05PA8", "Overall": "1.0", "Content": "I've got fake HTC, that very differ from original and it even didn't  boot up (screen didn't work).  But this concerns to seller not to product themselves, as long I used original HTC Sens before and it's good.", "Date": "July 23, 2013"}, {"Title": "Good Phone, Bad Headset", "Author": "Janet Burke", "ReviewID": "R34KQFR4AKTVQ7", "Overall": "4.0", "Content": "I bought the phone because of the beat audio headset but I got a regular headset in the box. With that disappointment the only thing that would let me get this phone over the HTC Inspire 9192 is the dual camera and it is lighter that the Inspire. The OS is very good and it seems to have more features than the Inspire.", "Date": "June 25, 2013"}, {"Title": "Great phone but poor battery", "Author": "QuirkyD", "ReviewID": "R29NFPTTSRAHY6", "Overall": "3.0", "Content": "I was really excited to get this phone, but am feeling quite let down by the battery. Even if I do nothing on the phone, it still needs recharging at the end of the day. This is after I have taken all the recommended suggestions for minimising power usage. Seriously, it should last at least a couple of days on one charge with minimal usage. Also, it takes an eternity to recharge.I find this phone really annoying, because it promises so much, yet the rubbish battery puts a big dent in my overall opinion. I've checked on some replacement batteries - Mugen looks super powerful but too bulky, Anker looks like a bit of a boost for a reasonably fair outlay.I agree with the other reviewer about removing the back case - wow, is that hard! I'm scared I'll break the thing. Also, USB connector to the phone is very difficult to fit in the socket.I'm surprised at the high ratings - is battery life not so important? Do you all really think it's acceptable to need a recharge every day with minimal usage? I'd hate to be an avid Youtube viewer or music listener - the power would be out before the end of the day. Although I've put three stars, I'll give it a rating of 2 1/2.", "Date": "April 15, 2013"}, {"Title": "not as good as expected", "Author": "jose", "ReviewID": "R3Q0W7ZJ8QGUP6", "Overall": "3.0", "Content": "the cell I bought has some features in chinese!!It cannot use skype and the camera is not as good as sensation 4G", "Date": "July 4, 2012"}, {"Title": "GREAT", "Author": "Anand Ramtahal", "ReviewID": "R2K5XUH6B2Z3JY", "Overall": "3.0", "Content": "i simply love this phone,, it does everything i need it to do and more. its a good looking phone as well.PROS-It has dual core, 1.5Ghz processor ,there is no lag and I have been on flash heavy sites, been playing lots of different games which demand alot from the processor .-The display is very crisp. Colors are sharp and very nice.-Audio quality is very good. The beats setting gives you more bass which I like.-Its metallic finish is simply perfection.-Photos are amazing.CONS- I did not receive any beats audio headphones when I bought this product. I emailed the seller and I even emailed HTC themselves, but didn't get much help. They both said that it was shipped in the box, however I just got the standard headset. I have nothing to disprove them,  felt as tho I was robbed,, its nonsense cause I didn't get what I had paid for. The seller wanted to give me a $20 refund to compensate for the \"lost\" headphones, but that wont replace it, nor would it be able to buy a pair of beats audio in-ear headphones. Obviously I was very disappointed.Overall this is a great phone. I would recommend it to anyone, just buy a good case for it, cause I dropped mine and nearly had a heart attack. Still very disappointed about the headphones.", "Date": "June 19, 2012"}, {"Title": "HTC Sensation xe", "Author": "Harsha", "ReviewID": "RW0XM5OM6BIRE", "Overall": "4.0", "Content": "It doesn't include the Dr DRE ear phones...which is expected....apart from that everything seems to be fine and good..i liked the phone..but disappointed that the dr dre ear phone set is missing", "Date": "May 29, 2012"}, {"Title": "A great phone at a great price", "Author": "pbmumbles", "ReviewID": "R18HY3YALDK00", "Overall": "5.0", "Content": "Having used the phone for a few weeks now, I am really pleased with it.It is very fast, the interface is both flexible and easy to use, and being the international version it has all of the features enabled:- Wifi hotspots and network connection sharing (massively helpful for me accessing work e-mail on my laptop)- Any SIM card (great for me as a frequent traveler)I'm really pleased with my purchase, and am not missing my previous generation smartphone one bit (from the famous fruit-related manufacturer).Except for wishing it had a better name that my friends (all in the fruit club) wouldn't laugh at, it's a perfect phone.Well done HTC, keep it up.", "Date": "May 28, 2012"}, {"Title": "Excelent Phone", "Author": "Argen", "ReviewID": "R1LFMKRJPQR7FY", "Overall": "5.0", "Content": "I previously owned a Xperia x10 minipro, and decided to go for a more expensive android device. The main reason i bought this one is for the beats audio, mi mp3 player was starting to fail and i needed a new one as well.The audio is great, at least for me, i usually listen to progressive rock, metal and some symphonic death metal, and i found the audio really clean. From my point of view the iPhone definitely have a higher volume, but the Sensation XE is more clean, as well for the type of music that i listen to, i love to hear the keyboards and the bass, and be able to difference them from the guitar and drums, and this phone manages that.The HTC Version of android is really smooth, the only think that i hate about it is that you are forced to have 7 virtual desktops or screens, i generally use about 3 or 4, but is not a deal breaker.so far all the applications that i have tried runs smoothly, i manly use twitter, google reader, and some games occasionally, and i can't complain.Battery life is a lot better than my previous phone, listening music for about 1 hour until i get to my job, checking twitter every half an hour, playing about 20-30 mins in my break, and then listening music back for another hour until i get home and the battery usually is about 70-60 percent. and that's about 11 hours turned on.Of course i usually have Bluetooth, 3g and wi-fi turned off with low illumination in the screen, but i guess everyone is the same on that department :PIn conclusion, for $550 you get an awesome phone, with great audio and a pair of Beats headphones for free (they cost about $100 i believe) and is a great phone!technical specs here -> [...]", "Date": "March 11, 2012"}], "ProductInfo": {"Price": "$229.99", "Features": "htc sensation xe z715e with beats audio\nandroid 1.5 GHz processor\n8 mega pixel dual camera\nhtc touch sense", "Name": "HTC Sensation XE Z715E with Beats Audio Unlocked GSM Android Phone - International Version - No Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51i%2BI7za9cL._SY300_.jpg", "ProductID": "B005MPZOIG"}}