{"Reviews": [{"Title": "great customer service", "Author": "blkgoku", "ReviewID": "ROULM2J0IOVIF", "Overall": "4.0", "Content": "Hard to find good customer service on the internet but this company still goes out of their way to make you feel like you matter. I ended up ordering the wrong phone and the lady personally contacted me asking if she could do anything to help me find the correct phone. Its personal attention like that that will make or break a company. Kudos to Lisa who contacted me. Thanks for all your help.", "Date": "March 23, 2012"}, {"Title": "not gsm", "Author": "Victor Manuel Rios Lopez", "ReviewID": "R2AE24BN4M0OBL", "Overall": "1.0", "Content": "It's not like I wanted, in Honduras only used GSM network.Should you upgrade in countries using GSM network, not sell this type of phone. I really run out of money they had to purchase disponoble phone, and it was not what I expected, now I have to re-save to buy a phone. At least you give me even a cheap phone but with GSM and FREE.", "Date": "September 16, 2013"}, {"Title": "Blackberry Curve 9330 3G Sprint", "Author": "Migdalia", "ReviewID": "R1JVL8QD9QEGOA", "Overall": "2.0", "Content": "The product does not work in my country because it must be international GSM chip. The equipment is in optimal conditions, but unfortunately does not help. Please inform me if you can change to another and I pay the difference. Get it back? and I buy another. Wuld you please let me retur the product as unused", "Date": "September 2, 2013"}, {"Title": "great phone", "Author": "mellissa", "ReviewID": "RGMKWG1INEF57", "Overall": "5.0", "Content": "came in very good condition. looked brand new . everything works perfectly. i got it as a present for my mom and she loves it she is soo happy with her blackberry, couldn't have paid a better price for it either . I am very pleased with this purchase", "Date": "May 2, 2013"}, {"Title": "Not a big fan", "Author": "Stephanie", "ReviewID": "R27QWYFPESXG7V", "Overall": "2.0", "Content": "I was not impressed with this curve at all. It froze too many time. In fact if I could trade it in I would.", "Date": "April 11, 2013"}, {"Title": "excelente", "Author": "freddy riveros", "ReviewID": "R3W0GYIRLYP1R", "Overall": "5.0", "Content": "el producto llego rápido al destino, excelente servicio; agradecido buena puntuación,  sin mas que decir y una prointa nueva compra", "Date": "February 9, 2013"}, {"Title": "Terrible Purchase", "Author": "John Holchin", "ReviewID": "RVCQQ52GW3LOO", "Overall": "1.0", "Content": "Very disappointed.  The phone has already stopped working.  i took it to a repair shop and it will cost more to fix than originally paid.", "Date": "December 16, 2012"}, {"Title": "kim", "Author": "kim", "ReviewID": "RSDCMA6N3K1VJ", "Overall": "5.0", "Content": "I love this phone we actually ordered 3 we had them within 2 days of ordering. They are really great phones", "Date": "July 9, 2012"}, {"Title": "Great Phone & Service for A  Great Price!", "Author": "Chris in Hilo", "ReviewID": "R1CJEJPQJAVBSL", "Overall": "5.0", "Content": "I don't normally order anything that is not sold by Amazon (No 3rd party Amazon vendors)... But I really trust Amazon fulfilled products.I ordered my 9930 just last week. The shipping ETA was July 17th... Well It's here in my hand as of July 13th. The phone works great and at just under an $100 it's quite a replacement bargain.Highly recommended!", "Date": "July 13, 2012"}, {"Title": "Phone did not work", "Author": "Horace Thompson", "ReviewID": "R33TASDZC9I1NZ", "Overall": "1.0", "Content": "The phone was advertized incorrectly. It is CDMA. I wasted my money. I am trying to sell it as spare parts to recover some of the money i spent ($87)", "Date": "November 28, 2012"}, {"Title": "Amazing", "Author": "MarkDobs", "ReviewID": "RM810OY6KULVI", "Overall": "5.0", "Content": "When I ordered this phone I thought I was just getting the phone alone. It was shipped out on Monday and the shipping quote said I was to get it in multiple weeks. I got the phone in 3 days within it being shipped. The phone came in its original case with a charger as well. It is in impeccable condition and I could not be happier. Thank you kindly for the phone and the charger.", "Date": "June 27, 2012"}, {"Title": "Not what it seemed", "Author": "AveLacie", "ReviewID": "R29IIV1Z9C2B8X", "Overall": "2.0", "Content": "This product was in great shape on the outside, but was still a huge disappointment. After being on hold with my phone service consultants for more than  an hour and going to the store to have it activated, I was informed that the phone was a DUD. I then had to ship it back for a refund of my money. All in all it was a huge inconvenience.", "Date": "October 21, 2012"}, {"Title": "Amazing quality", "Author": "Ed", "ReviewID": "R2DPIS6QXDC0OC", "Overall": "4.0", "Content": "Phone arrived in A 1 shape - But understand you must speak blackberry to appreciate this phone- This phone is more durable than most of the newer phone made today - Battery life is much better than a touchscreen smartphone-", "Date": "January 13, 2014"}, {"Title": "love it", "Author": "patricia a hillrich", "ReviewID": "R3G7D98OYNQOTK", "Overall": "4.0", "Content": "i love it except the 0 key dont work when i hit it it shows up as a 6 instead", "Date": "December 26, 2013"}, {"Title": "this phone CDMA can not operated in Venezuela", "Author": "Franklin Revilla", "ReviewID": "R65RRS0TQ7YBQ", "Overall": "2.0", "Content": "because l lost my money. this phone (CDMA) can not  be operated in venezuela.  (movilnet, movistar y digitel). its not work.", "Date": "December 16, 2013"}, {"Title": "Out Dated good for back up", "Author": "Dylan", "ReviewID": "R1TDY9T7WW6ZCR", "Overall": "1.0", "Content": "This phone reminds me of the brick you use to put to your head with a long metal pole out the top campared to phones they have these days but for a cheap phone to have for back up always good.", "Date": "October 21, 2013"}, {"Title": "Make sure you check the esn#", "Author": "David williams", "ReviewID": "RSFNIUFSLMSUL", "Overall": "1.0", "Content": "Phone came with in 3 days. Phone looked great.but when I went to sprin to have it turned on in my name they said it had a bad esn# it was reported stolen/lost.", "Date": "October 17, 2013"}, {"Title": "Wow! Brand new phone!", "Author": "Dark kitsune", "ReviewID": "RE5OPH98YMVY0", "Overall": "5.0", "Content": "Well...I thought I was purchasing a refurbished blackberry...but when I got the package today I opened it to discover a brand new, never used, still in the sprint box sealed up tight phone.  I activated it with Sprint, no problem and have already made a couple of calls with it.  Size is perfect and I owned a blackberry years ago and really liked it.  I like the keypad and the navigation button is nice and smooth.  If this little dynamo works out, I'll be turning in my piece of junk galaxy 3s and sticking with a phone that may not have as many bells and whistles, but is at least durable and has better battery life.", "Date": "September 18, 2013"}, {"Title": "Great Buy", "Author": "loretta destefano", "ReviewID": "R1N3KSGTZLKQ1A", "Overall": "5.0", "Content": "I still have and use the product! Good price and great condition. Great shipping time. Got more then my share of usage out of the product! I am very pleased!! thank you!!", "Date": "August 22, 2013"}, {"Title": "No silbe.", "Author": "Boris Navas \"Personal\"", "ReviewID": "R1CHWB7N1MR6NV", "Overall": "1.0", "Content": "Este producto nunca me funciono en este país y el error de hacer esta compra es mía motivado a que me empeñe en compra algo que en este país ya no funcionan por no tener chip", "Date": "January 17, 2013"}, {"Title": "Help", "Author": "Jprz4", "ReviewID": "R2FRRZPQCRVNAM", "Overall": "4.0", "Content": "Does anyone know if this phone colluded be flashed to cricket? I am on the cricket service and want a blackberry that sends txt,pics,web etc.", "Date": "September 19, 2012"}, {"Title": "Venezuela", "Author": "Laura", "ReviewID": "R24JNO7S5T7S5Q", "Overall": "3.0", "Content": "Buenas tardes.Me pueden decir si este tlf sirve con SIM de alguna operadora de Venezuela?Good afternoon.Please, I want to know taht this phone works with SIM from some company of Venezuela?Thanks", "Date": "September 2, 2012"}, {"Title": "This is amazing", "Author": "mkoujan", "ReviewID": "R2FXTLPPQ3RKY", "Overall": "5.0", "Content": "I have ordered it and 2 days here its. It looks like its new functions and works very well. has a wall charger and Original headphones, manuals and original packaging too. I am very satisfied with this purchase.", "Date": "July 30, 2012"}, {"Title": ".....socked", "Author": "BLsanchez", "ReviewID": "R3FDWIKG9A380V", "Overall": "5.0", "Content": "well i have to say i am shocked.....in a good way. i ordered this phone and it was at my house in 3 days, thats a week before expected! i as many other people was a skeptic of ordering phones off amazon but this has changed my mind and i WILL use this company again i purchased an entry level blackberry to see if this was legit. soon as i call to activate the phone and its clear i will happily order a higher end blackberry so this  far thank you, i will update review as appropriate", "Date": "July 19, 2012"}, {"Title": "Misinformed", "Author": "Visa Electron \"Martha\"", "ReviewID": "R1CFC0X4UCCVV7", "Overall": "1.0", "Content": "Hi I ordered this phone, it has come in good time but its CDMA and where I am Africa it is not compatible. had you written this in the phone specs & info I would bought one that is compatible to y region! Now I have a phone I CAN'T use. Blackberry Curve 9330 3G SPRINT (Grey) The seller is NOT helpful at all and very unhelpful. I asked for a replacement after I sent back the 9330 they supposedly \"sent\" me an 8300 which have NOT received from the 17th of October 2012.", "Date": "September 24, 2012"}, {"Title": "help.", "Author": "jesus", "ReviewID": "R1P303NV2RJK80", "Overall": "4.0", "Content": "Hi, first of all good day, I wonder if this phone will work internationally since I am living in Venezuela and would like to purchase your product, but first I want to be sure I can use it here in my country.", "Date": "August 15, 2012"}, {"Title": "Good phone", "Author": "Alexis Lira", "ReviewID": "R2VY70LWQIL94P", "Overall": "5.0", "Content": "This phone is excellent for use in United States, has all its function and is a strong phone you can use in united states", "Date": "March 9, 2013"}, {"Title": "Thanks", "Author": "yeri", "ReviewID": "R3PB165J7DZWSA", "Overall": "5.0", "Content": "Great item got it fast love itThanks for the shipped and im glad i did it with all you guys", "Date": "February 10, 2013"}, {"Title": "It's OK", "Author": "Dieu Juste Almonor", "ReviewID": "R299LFDUUKX5AI", "Overall": "3.0", "Content": "I completely for get that this phone was a CDMA  phone and my network company  just upgrade to edge, that means i cant used the phone but its a good phone besides the fact i cant activate it", "Date": "January 28, 2013"}, {"Title": "not working properly", "Author": "Neren", "ReviewID": "RMSE9L4W3V2VY", "Overall": "2.0", "Content": "320x240 pixel color display  Expandable memory with support for microSD cards  Light-sensing screen  1150 mAHr removable/rechargeable lithium-ion battery  Talk time: up to 4.5 hoursthis product is faulty, the touch pad is not working properly and its", "Date": "October 5, 2012"}, {"Title": "They tricked me", "Author": "Mari", "ReviewID": "REZVFBFU1K464", "Overall": "3.0", "Content": "i got the phone and it was in perfect condition, i turned it on and everything was gd until i realised it wasnt unlocked! now i have to go and pay for it to be unlocked, cmon amazon!", "Date": "July 19, 2012"}, {"Title": "Information", "Author": "julien", "ReviewID": "R2QWCCJNIGX07O", "Overall": "3.0", "Content": "I need to know if i will able to send a message with a france network or if it's only work in america ??", "Date": "June 16, 2012"}, {"Title": "bad sales!!!", "Author": "sarai lopez", "ReviewID": "R1PKWBNW4O0GSJ", "Overall": "1.0", "Content": "Dear Friend, first of all i want to ask if the BlackBerry it's NOT CDMA technology or not... and also if it's unlocked phone...????Thanks!!", "Date": "January 25, 2012"}], "ProductInfo": {"Price": "$90.00", "Features": "320x240 pixel color display\nExpandable memory with support for microSD cards\nLight-sensing screen\n1150 mAHr removable/rechargeable lithium-ion battery\nTalk time: up to 4.5 hours", "Name": "Blackberry Curve 9330 3G SPRINT (Grey)", "ImgURL": "http://ecx.images-amazon.com/images/I/41OTO8fQngL._SY300_.jpg", "ProductID": "B00513N5EO"}}