{"Reviews": [{"Title": "Love It!!!", "Author": "Jesus E Martinez", "ReviewID": "R12VUMXKA2HDJ6", "Overall": "5.0", "Content": "Can not be more satisfied with my Sony. Thinking of getting another to give it as a Gift!!! As I often travel overseas, this phone works anywhere in the world with a sym card!!!", "Date": "July 15, 2012"}, {"Title": "The Most Beautiful Phone I've Ever Owned", "Author": "Johnny Saigon®", "ReviewID": "R1RQEVRMTMYV9U", "Overall": "5.0", "Content": "(Smart)Phones I own/have once owned:Nokia: N85, N95, N900HTC: HD2, Desire SSamung Galaxy SApple: Iphone 4/4SAmong all these my white Sony Ericcson SK17 mini pro is by far the most stylish and beautiful.Before this the title belonged the Nokia N900. These 2 are of the rare phones where slapping on any case, no matter how stylish, would be a grave injustice.The form factor is excellent. It's very short, yet thick and hefty, so it fits well into your palm even if you have big hands. The plastic backing on the white version is rather slippery though, so you do have to be careful(the black version has a more rubbery, matte finish).Sony Ericcson's user interface is superb. It was recently updated to Android 4.0 Ice Cream Sandwich, but even if you stick to the stock Gingerbread 2.3.5, you will not be disappointed. It's stylish and slick, much better than HTC's Sense and Samsung's TouchWiz shells (although HTC's weather home screen is by far the best for a weather widget). Even though it's a single core phone, everything moves with grace, style, and zip, even on the more RAM-intensive Ice Cream Sandwich. Although touch-input responsiveness and accuracy will never be as good as the iPhone's, overall, as far as the UI goes, it's the best - the best of the Androids, and better than Nokia's Maemo and Apple's iOS.Web-browsing and video-watching on this 3-inch screen will never be as good as the other phone's bigger screens, and its 480x320 resolution is inferior. However, on that small 3-inch screen you won't be able to really tell, and the Bravia Engine and Reality Display do shine - it's simply a bright, gorgeous screen.Typing on this phone is a dream come true, since it has a dedicated sliding QWERTY keyboard like the Nokia N900. I still love the SWYPE-style input the best, and that is not something you can currently do with an iPhone or the older Nokias. On that end, this phone reigns supreme giving you the best of both worlds.I think Apple's ecosystem is still superior to Android's, but if you want a good second phone, I feel this is the best Android phone for that purpose.Highly recommended!", "Date": "June 23, 2012"}, {"Title": "Pretty good little phone with a QWERTY keyboard", "Author": "Dustyn Fink", "ReviewID": "RH8X6Y1T2XK9I", "Overall": "4.0", "Content": "This phone is pretty darn good for its size.... A 1GHz processor and a decent little slide-out keyboard.  I did find I got pretty tired of looking at the screen for any period of time though as it was so small...Sound quality of the phone was good and it was pretty nice for playing music on (I used Winamp).  Camera left everything to be desired, even considering it was supposed to be 5MP....Sony has done a pretty good job with this phone but I quickly got bored and moved on to a larger phone.For Canadians:  The international version of this phone will ONLY work on Rogers or Fido.  And it WILL NOT work with 3G.  I was only ever able to get EDGE connection speeds (archaic) on Fido.  Wifi was an absolute necessity for doing anything except calling or texting.  It did alright sending multimedia messages however.", "Date": "February 12, 2013"}, {"Title": "Love It!!!", "Author": "Liliana", "ReviewID": "RDLONSJ8USI1I", "Overall": "5.0", "Content": "Can not be more satisfied with my Sony. Thinking of getting another to give it as a Gift!!! As I often travel overseas, this phone works anywhere in the world with a sim card!!!", "Date": "December 18, 2012"}, {"Title": "Excelent", "Author": "Nancy", "ReviewID": "R31R6TNDEH1DLQ", "Overall": "5.0", "Content": "I get the phone in excelent conditions, with so many accesories i get it with  other accesories that i didn't know", "Date": "November 30, 2012"}, {"Title": "NIce phone", "Author": "Auri", "ReviewID": "R33ULKS79P26EN", "Overall": "5.0", "Content": "It is a great phone. It is not heavy and the size is perfect. It is really easy to text and to carry around.", "Date": "November 26, 2012"}, {"Title": "best small android phone!", "Author": "Minidroid", "ReviewID": "R335JMJB6126LC", "Overall": "4.0", "Content": "It's one of the smallest android phones. Comparing all the features this phone with other in the same class, you can not find a better one. The fast CPU is very fast for games (especially for shooters) and for web. The keyboard is very responsive and spaced perfectly even with bigger hands. 5mp camera with flash produces nice pictures and with 720p video is top notch. I ditch my regular digital camera, and just bring the phone on trips. You do need to buy a big micro SD card as the 2gb fills fast. It even have a FM radio! Great that android allowing installing many apps to SD card! Highly recommended!!", "Date": "October 5, 2012"}, {"Title": "No 4 G in the US !!", "Author": "Kai Luckan \"Kai\"", "ReviewID": "R1D1JZXGPG2Q1K", "Overall": "3.0", "Content": "You should be warned.This international version is not capable of receiving 4G in the US.It is using a different European standard.The most you can get is 2G...very,very slow.Otherwise a fantastic and stylish phone.", "Date": "September 2, 2012"}, {"Title": "BEST PHONE EVER!", "Author": "cheapman", "ReviewID": "R3PPFV3WKTSK44", "Overall": "5.0", "Content": "This is an amazing phone. Very satisfied with it. The small screen is not too small, you can still browse the web and do everything just fine with this amazing piece of technology. It's small and fits into the pocket perfectly. The one setback is the processor is not as strong and thus don't recommend upgrading the default operating system (Gingerbread) to the new operating system (ice cream sandwich).", "Date": "August 29, 2012"}, {"Title": "Cute phone but...", "Author": "Javier_H", "ReviewID": "R2X2OA5O6FX61E", "Overall": "3.0", "Content": "Used it for a month and...It randomly recognized my old sim card. The phone company gave me a new sim card and is stable so far.  It never connected better than Edge. Now I know this phone only has 3G if the provider is CDMA. Under GSM will use 2G or EDGE.The white keyboard indoors backlit by a white light makes the letters disappear. Terrible. Long pressing a letter will not write the number alternative.If I take the battery off, it will go to Jan. 5 1980.The  calendar is not practical (and ugly).Very solid piece of hardware. Good construction. Responsive.Battery life was terrible at first. Then it got better... I have to take care of the widget that disconnects  wifi and bluetooth when not in use.So far my best phone ever is my old reliable Nokia N95-> a phone and then a toy.This Experia is a toy...then it's a phone.", "Date": "November 15, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "GENERAL2G NetworkGSM 850 / 900 / 1800 / 1900 3G NetworkHSDPA 900 / 2100\nDISPLAYTypeLED-backlit LCD, capacitive touchscreen, 16M colors Size320 x 480 pixels, 3.0 inches. QWERTY keyboard - Scratch-resistant surface.\nAccelerometer sensor for auto-rotate - Multi-touch input method - Sony Mobile BRAVIA Engine - Proximity sensor for auto turn-off.\nCAMERAPrimary5 MP, 2592x1944 pixels, autofocus, LED flash FeaturesGeo-tagging, image stabilization.\nOSAndroid OS, v2.3 (Gingerbread) CPU1GHz Scorpion processor, Adreno 205 GPU, Qualcomm MSM8255 Snapdragon\nSmile and face detection, touch focus VideoYes, 720p SecondaryYes, VGA", "Name": "Sony Ericsson Xperia Mini Pro SK17i Unlocked GSM Android Smartphone--International Version with No US Warranty (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51qFteIQc2L._SY300_.jpg", "ProductID": "B005HH0N3U"}}