{"Reviews": [{"Title": "Android really does make the best phones", "Author": "Greg C. Johnson \"Mokutla\"", "ReviewID": "R34UV2YKT5ENYS", "Overall": "5.0", "Content": "After many bad experiences with phone operations I took family members advice and bought this phone used. It has a Bette camera than the iPhone and its so lightweight and comfortable in my hand.i don't care about apps but Instagram and twitter work great. It's the first phone I've owned that made it easy to upload music to my playlist..I haven't owned it for long so time will tell how we'll it lasts over the long run.", "Date": "June 14, 2013"}, {"Title": "disappointed", "Author": "shorty", "ReviewID": "R13A5NQ5EIW88Y", "Overall": "2.0", "Content": "I had this phone in the past that I had gotten with an upgrade and loved it.  However, this phone purchased is not good quality, drops calls, does not get good service, freezes all the time...I am trying to return it and have a replacement phone sent to me to see if it just the phone but NO ONE has gotten back to me...", "Date": "November 11, 2013"}, {"Title": "great shipping", "Author": "sangay", "ReviewID": "R1VF3OW86N1NDX", "Overall": "4.0", "Content": "I just got the phone, but didn't really use it. And am not planning to as I realized that I want to rather get an I phone. But the shipping was right on time, and the product reached me in perfect shape.", "Date": "October 22, 2013"}, {"Title": "No SD card, broken GPS, bad battery", "Author": "Kelly Bird", "ReviewID": "R2KKUWAW1SXW4B", "Overall": "1.0", "Content": "This shipped without an memory card, so when I went to take a photo, or look at a PDF file online, I couldn't.The battery seems to be bad - it can't hold a charge just one month after purchase. It runs out of charge each day whether I've used the phone much or not.Most annoyingly, the GPS is broken. It can't find any satellites when other phones can find them easily. This means I can't use Navigation or any useful location-based app. Truly frustrating.By the time I realized these problems, the 30 day return window had expired. Would not buy again.", "Date": "August 3, 2013"}, {"Title": "Do not buy it for Verizon", "Author": "Susan", "ReviewID": "RDWHV9Y349R84", "Overall": "1.0", "Content": "This phone will not work as a phone when it cannot find an internet signal. I had to go back to my old phone as I missed two job opportunities because of the phone not receiving a signal. Do not buy this phone if you are a verizon customer.", "Date": "June 28, 2013"}, {"Title": "Excellent", "Author": "Sykia Folsom", "ReviewID": "R16ZKDOUIDS3O7", "Overall": "5.0", "Content": "I actually received my phone the day before i was leaving to go out of town, my package was opened, but the product looked new. i was in a rush to leave so i just got my phone activated and left, that same day i was trying to charge the phone up, it would not respond to the charging, then a day later the screen started blinking in and out on it's own, i noticed it only did that when the battery was low. Two weeks later after purchasing my phone i wrote the company and told them what was going on, and they offered to send me a replacement phone the same day, with a paid USPS send back box i also had to return the dysfunctional phone back within five days of receiving the new one. GREAT SERVICE i would definitely recommend this company to a friend.", "Date": "September 24, 2013"}, {"Title": "Good Phone But..", "Author": "Matt Grana", "ReviewID": "R15PE6T1R7LDC7", "Overall": "3.0", "Content": "I love my this Samsung phone but the Android OS this phone has is EXTREMELY buggy. This phone is good quality though and the camera is great and the flash is very bright", "Date": "October 14, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Large 4.0-inch Super AMOLED touch screen display for 20 percent brighter imaging with 80 percent less glare\nRuns on Android 2.1 with support for Google Mobile Services including Gmail, YouTube, Google Talk and Android Market\nAccess to thousands of apps on Android Market\nBuilt-in 5.0-megapixel camera with auto-focus and LED flash and HD video recording (720p) capabilities\nMobile HotSpot capabilities allows customers to transform the phone into a 3G wireless modem for up to five compatible Wi-Fi-enabled devices", "Name": "Samsung Fascinate I500 Galaxy S Verizon No Contract Phone", "ImgURL": "http://g-ecx.images-amazon.com/images/G/01/x-site/icons/no-img-sm._V192198896_.gif", "ProductID": "B0060BD93I"}}