{"Reviews": [{"Title": "AWFUUUUUUL SELLER", "Author": "Aziz", "ReviewID": "R392279K7LH65R", "Overall": "1.0", "Content": "DONOT BUY it from this seller. I bought the blackberry 9900 and gave as a present in one month. The keyboard was not working. When i gave it for repair the Joystik in the middle was broken also. It is very disappointing that amazon allows these sellers to sell it the phones which are not working", "Date": "October 13, 2012"}, {"Title": "i received broken item", "Author": "bander", "ReviewID": "R1GBI0A9MIZG5I", "Overall": "1.0", "Content": "i bought 3 blackberry 2 is ok ,,,,, I received the  one  broken when i tried to contact with somebody can't hear my sound .how can you help me in this problem ,,,?????????????", "Date": "April 5, 2013"}, {"Title": "I'm really unhappy with my product", "Author": "marcos reyes", "ReviewID": "R3TRXWSHCEUT72", "Overall": "1.0", "Content": "Well the blackberry that I was send isn't a really white blackberry. Is a black one replaced a white body and it was the material look cheap and badly put together.", "Date": "March 9, 2013"}, {"Title": "The best phone ever", "Author": "chachasammy", "ReviewID": "R3LIA2LWCM1QBO", "Overall": "5.0", "Content": "This phone I purchased for my husband, and he absolutely loves it, There are so many features and he just has a hard time putting the phone down. It is an awesome phone.", "Date": "March 22, 2012"}, {"Title": "BB", "Author": "Valeria Razumny", "ReviewID": "RGFM1KOE98K03", "Overall": "3.0", "Content": "I like the product but unfortunately it wasn't in good conditions. I ordered a new product but the battery cover didn't close properly so I had to buy another one in my country. In my country told me that the bb I had bought isn't new.", "Date": "November 6, 2012"}, {"Title": "White stands out!", "Author": "Anil Saisbhan", "ReviewID": "R2ZCHLWGF2KLF8", "Overall": "4.0", "Content": "The phone was shipped with a Rogers logo on it. No big thing as it is unlocked. Pretty quick delivery on standard shipping. The white is eye catching. I bought this for a cousin who refuses to put a protector on it. OS is fast - I used it minimally. I just don't like the BB OS anyhow. I think it's OS 7. Stock as is, it doesn't seem that the battery life is all that great when compared to the 9800 it replaced. Don't know if it needs to have a few charge-and-discharge cycles. Even though it's not mine, I've given it 4 of 5 stars as it is a decent phone as far as smartphones and Berries in particular go. It takes good quality photos, call clarity is very good. Lose 1 star due to battery life.", "Date": "August 6, 2012"}, {"Title": "casing", "Author": "me me", "ReviewID": "R2IEFCSL75W6J9", "Overall": "3.0", "Content": "why is the casing black when the phone is a white one??? something wrong here...white bb comes with a white casing in the box!!", "Date": "June 16, 2013"}, {"Title": "was very disappointed", "Author": "maxine", "ReviewID": "R2MGY6HEZATUCD", "Overall": "1.0", "Content": "I bought the blackberry white 9900 twice and had to send it back d first time the phone it self was faulty I could hear people but no one could her me out of the phone 2nd of all I mailed back the phone and got another blk berry 9900 white with all black asserize I was very very very upset n disappointed because the 1st phone came with all white asserise my over all experience is simply unsatisfied customer point blank", "Date": "November 16, 2012"}, {"Title": "DO NOT BUY THIS MODEL", "Author": "ANDREA_EC", "ReviewID": "R29OQ45UFIJ5NJ", "Overall": "1.0", "Content": "No warranty, worked 6 months, but it says that claim is no longer possible. No catches and no spare parts for this phone. Do not buy this model", "Date": "November 24, 2012"}, {"Title": "Horrible experience", "Author": "Aaron Viegas", "ReviewID": "R95VSOL7WLFIC", "Overall": "1.0", "Content": "Phone was suppose to be in new condition as mentioned on website.I was suppose to be a gift for a friend in India. So without opening it I sent it to India. Only then did we realised what happend. The phone was an old piece with alot of scratches, 4 keys not working and the blackberry sign half gone. No one in India can even fix it because it a piece from the United States (Company policy), so its just lying at home like some electronic junk.", "Date": "November 25, 2013"}, {"Title": "bad", "Author": "Merly Alessandro", "ReviewID": "R2KYQ1IGJG3FLV", "Overall": "1.0", "Content": "the phone came wrong and had to fix it, did not hear the conversation. I had to repair.  's disgusting that phones are bad", "Date": "October 25, 2013"}, {"Title": "Awesome", "Author": "NEBO NDUBUISI", "ReviewID": "R2DSNGY2R1PYUD", "Overall": "5.0", "Content": "It is just awesome. It came quite on time and as described. I will recommend this sale to anybody i know", "Date": "February 8, 2013"}, {"Title": "Love it", "Author": "Loyc", "ReviewID": "R34MBXEOTK7F4B", "Overall": "5.0", "Content": "No comments because it works perfectly and i love it. Its light its slim its good and very good performance.", "Date": "January 27, 2013"}, {"Title": "BB 9900 white", "Author": "Florencia Caparrós", "ReviewID": "RH3EUAUK7XNT7", "Overall": "5.0", "Content": "I love muy white bb and works perfectly in Buenos Aires  !!! thanks you for sent me this great blackberry. I recommend this user.", "Date": "January 11, 2013"}, {"Title": "don't buy", "Author": "suraj", "ReviewID": "R2T11UY8K3KFE4", "Overall": "2.0", "Content": "received it on time, however the ear speaker wasn't working, after i fixed it out of my pocket, upgraded the firmware etc, it worked for a few days and then the mouthpiece speaker went bad...i can't say how disappointed i was with this new purchase.", "Date": "December 3, 2012"}, {"Title": "very pleased", "Author": "n.b", "ReviewID": "R3P3XYPJ78JTCY", "Overall": "4.0", "Content": "Had a little prob at first with this seller from a different bb to another got the bb 9700 first in white got the shipment in blk return got the white one that wasn't charging right return again decided to try another model came across the 9900 I said what the heck let's try that one phone is ok was shipped brand new no faults I hope not in the time being since its ben a couple of days seller was very nice and patient excellent customer service I will def buy from this seller again will def give it 5star but I didn't get the memory card that was suppose to come with the fone great choice in the 9900 especially the white one very eye catching price is high but it def worth it", "Date": "September 17, 2012"}, {"Title": "Expensive", "Author": "Jacinto Torres", "ReviewID": "R2GCEPXEH2WTNL", "Overall": "3.0", "Content": "Its Expensive phone, but you'll have an unique model in this color, the problem with this purchase was the time to receive it, more than one month expecting for it....", "Date": "August 30, 2012"}, {"Title": "very good store and service", "Author": "Gracerich", "ReviewID": "REVV5J23X2D5L", "Overall": "5.0", "Content": "honest and efficient,service very good,good attitude.I bought a blackberry 9900 from this store,when I receive it I foundthere is no memory card in it .so I called the store,they replied willship it to me .two days later I received the memory card and a extra adapter.awesome!", "Date": "June 28, 2012"}, {"Title": "Received a broken phone !!!", "Author": "Rim", "ReviewID": "ROYAYAUG2K3KS", "Overall": "1.0", "Content": "I have such a bad expreience with this seller. First of all they took so long to ship out the order and it took them two weeks to deliver . Finally even after two weeks I was so excited to have my phone but my happiness was just for a moment. The phone I received has a blue line on the display which makes it hard for me to read the text and can't even use the other features properly. The phone also stops working if I use it for over ten minutes. It has issues with the battery life as well. My other blackberry battery used to last about two days but this device uses the whole battery in half a day. I am also trying to contact the seller to make arrangments for the return. I hope since it's just been a week, it won't be such a big deal for them to return it.", "Date": "September 26, 2012"}, {"Title": "CRIMINALS do not buy them!!", "Author": "Eze", "ReviewID": "R1XHZVC6XTE42W", "Overall": "1.0", "Content": "I have bought 2 phones. the cell phone are not new, they have all the contacts of the old owner. They dont even erase that infirmation. And the worst thing is that is not unblocked!!! The space button doesnt work in both of them!!Dont buy a problem they are criminals!!", "Date": "February 19, 2013"}, {"Title": "Quiero saber si mi cel tiene garantia!", "Author": "Jeyceli", "ReviewID": "R3UJAKKXNDBYRQ", "Overall": "1.0", "Content": "Hola! compre mi celular blackberry bold 9900 blanco nuevo con ustedes el 29 de enero y ya mi celular no sirve no hace nada no levanta senal quisiera saber como me pueden ayudar es injusto que en menos de 6 meses ya no sirva.... espero respuesta", "Date": "July 24, 2012"}, {"Title": "not new or defective", "Author": "Omer Aydiner", "ReviewID": "R38ZALRJGZ03B0", "Overall": "2.0", "Content": "the item does not seem to be new. or at least defective as the front face is not very well holding its place and seems ready to fall off.", "Date": "November 24, 2013"}, {"Title": "Very happy with my experience", "Author": "Amazon Customer", "ReviewID": "R17F8G53I59H1I", "Overall": "5.0", "Content": "I had a different experience than most, but I have to say that Put Group USA kept to their word! In the shipping we had one difficulty, however they kept to their promises and delivered a an excellent product in the end. I will continue to order for them as they have excellent customer service and stand behind their product.Thank you,Rebecca of Toronto, Canada", "Date": "September 30, 2013"}, {"Title": "blakberry 9900", "Author": "sholymoore", "ReviewID": "R1G08VRTBTHZE2", "Overall": "5.0", "Content": "Its a cool phone, works well and I'm still using it, with no issue at all. Battery life is relatively okay.", "Date": "September 30, 2013"}, {"Title": "not like", "Author": "Jose Javier Segura Peña", "ReviewID": "R3B47CX0L8JR5F", "Overall": "1.0", "Content": "bad. return!not workmy expectations its badthe product not work(not on)the return is good in my gif card", "Date": "September 21, 2013"}, {"Title": "phone not working", "Author": "storm", "ReviewID": "R1DLCK08I13P2C", "Overall": "2.0", "Content": "i just got this phone and put my chip in it and the phone just keep freezing up.trying to charge it and its not charging. I am so disapointed", "Date": "August 26, 2013"}, {"Title": "disappointed", "Author": "nice2me", "ReviewID": "R2THJMLGYWTJHE", "Overall": "1.0", "Content": "I was so excited to have this phone at first and when I finally  bought it I was very disappointed.  Yea It's good for texting n  emailing the rest is useless.  It doesn't have gps support u can't download apps because it didn't have d app store icon. I won't recommend bb 9900 to anyone. It's a complete waste of money. Samsung Galaxy S4 here I come.", "Date": "August 11, 2013"}, {"Title": "I like the phone, but not this unit.", "Author": "Ricardo O Valdivia", "ReviewID": "RX5A5PU45IG9D", "Overall": "3.0", "Content": "I like the BB 9900 phone, but this unit it's like refurbished.And it looks like a black phone with the frame changed and with an non-original frame.", "Date": "July 18, 2013"}, {"Title": "85/100 Satisfaction..", "Author": "Brandon", "ReviewID": "R2TO6HXU2F29BK", "Overall": "4.0", "Content": "I'm going to start of by saying what's really bad about ordering this phone.1- When I tryed to use the charger for the first time it did not work.2- The phone case that comes with this order looks old and used.3- After using this phone for 3/4 months it is starting to give troube ( Sticking etc )Good things about this phone1- The phone itself works great.2- It does the jobI'm happy with this phone but it isn't a 5 star", "Date": "June 2, 2013"}, {"Title": "Fine purchase", "Author": "Gialban", "ReviewID": "R1E84NGPOVI62G", "Overall": "3.0", "Content": "The phone did not come with the Memory Card as the tittle said!! Other than that, the phone is working good.", "Date": "May 22, 2013"}, {"Title": "Exceptional!", "Author": "Slym", "ReviewID": "RM63G73WPWEC2", "Overall": "5.0", "Content": "I bought a white Blackberry 9900, through my skybox, as I live in Trinidad from this company and it was the best! I got ALL of the accessories with the phone. The memory card and the headset. I've bought other blackberry from other companies online and it did not include a memory card or headset, only the phone, battery and the charger. I am thankful and am enjoying my phone very much.", "Date": "April 13, 2013"}, {"Title": "no earphones", "Author": "kaydene chambers", "ReviewID": "R2S0KH2WZ9OJ6C", "Overall": "3.0", "Content": "did not get earpiece with the phone i love the phone but was disappointed that i didn't receive earphones  with phone", "Date": "April 4, 2013"}, {"Title": "bb 9900", "Author": "adeyemi ola", "ReviewID": "R1FTKSHBY5JYV1", "Overall": "5.0", "Content": "it was exactly the same with what was advertised,very nice.The phone works very well and everything was intact no gimmick.", "Date": "March 24, 2013"}, {"Title": "HIGHLY RECOMMENDED", "Author": "Alethea", "ReviewID": "R10HXOAJ9BNOWZ", "Overall": "5.0", "Content": "it arrived on time and the phone is really Nice, it was the Perfect christmas gift. will shop some more soon", "Date": "December 27, 2012"}, {"Title": "hspa bands?", "Author": "Bruce Shepherd", "ReviewID": "R379O05THV9EIR", "Overall": "4.0", "Content": "what 3g (HSPA) bands does the product use?Blackberry 9900 White Unlocked Touch Screen and Qwerty Keypad with Memory Card", "Date": "August 18, 2012"}, {"Title": "Great, but no memory card", "Author": "Rawnaq", "ReviewID": "R4RIXY285ABIK", "Overall": "4.0", "Content": "I had this phone in black and after it got stolen i went ahead and decided to repurchase. I've loved this phone for quite some time now and I don't plan on changing.Only reason I didn't give it a full 5*s is because I didn't seem to get the memory card that was supposed to come with it.", "Date": "June 2, 2012"}, {"Title": "Great services", "Author": "Carmen", "ReviewID": "R1DZAUMW5TJMV2", "Overall": "5.0", "Content": "Thanks for the great services, i enjoy buying things from you is a great way to have all you need", "Date": "March 19, 2012"}, {"Title": "Bad Seller. Original and Replacement Phones Not Working", "Author": "Roger Creteau \"RCreteau\"", "ReviewID": "R2STN9YQ75ZON1", "Overall": "2.0", "Content": "First phone stopped working after two weeks and was replaced. The replacement stopped working after 35 days. This model is full of defect issues.The seller sold me two broken phones.The 1st one arrived with the screen not working. When the replacement arrived the battery did not work so i had to replace it at my own cost, then 35 days after the phone went dead and is not working. I was told the seller that the 30 day return policy was up so i could not get a refund or replacement.", "Date": "April 4, 2013"}, {"Title": "Just okay", "Author": "Aisha Lawal", "ReviewID": "RGBV19M55O5FO", "Overall": "3.0", "Content": "Its okay the only problem is I have battery issues and the phone freezes a lot. Blackberry bold5 should come with extra battery.", "Date": "February 16, 2013"}, {"Title": "Phone giving trouble", "Author": "Aashmi parsotan", "ReviewID": "RQKQDSKBNBFKS", "Overall": "2.0", "Content": "Bought 2 phones from them. Delivery was on time. As we started using both phones, they gave trouble. And it's not the network. The phone itself is nice but It giving trouble is making it very frustrating to use.", "Date": "April 2, 2012"}], "ProductInfo": {"Price": "$599.99", "Features": "Almost new White BlackBerry Bold 9900\nWorld GSM, Unlocked\nUnbranded", "Name": "BlackBerry Bold 9900 GSM Unlocked Touch Screen QWERTY Keypad Phone - White", "ImgURL": "http://ecx.images-amazon.com/images/I/4140zuv3jIL._SX300_.jpg", "ProductID": "B006UK5WG6"}}