{"Reviews": [{"Title": "Excellent Unlocked Android Phone", "Author": "Jose G. Balboa", "ReviewID": "R37M1VL1SPFV8L", "Overall": "5.0", "Content": "Excellent phone.  Works with T-Mobile (my carrier in California).  Everything works perfect; call, text, WiFi, GPS, etc. (Note: for picture sending you have to call T-Mobile so that they can install the configuration for picture sending, since it's not a T-Mobile native phone.  What they do is, they send you a text with a link which you click and it auto installs the configuration and you are in business . . . simple).The speed is great for a 95 dollar phone (works better than a 400 dollar phone). I'm not too convinced about the camera, but the pictures are still decent. You can record video and upload straight to your Youtube account with just a couple of clicks.For the music, you just drag and drop your music folders and create playlists one folder at a time (not just a song at a time).  *Note: for this you have to install Astro File Manager, so read about it or ask me how to use it.I am very happy about this phone, I got one for my daughter too and she loves it . . . she says it works much much better and much faster than her crappy Motorola Cliqu XT.I totally recommend this phone, specially at this price to keep you contract-free.", "Date": "August 31, 2012"}, {"Title": "Worked exactly as stated", "Author": "Kaperz", "ReviewID": "R1G0BGRRPF4HED", "Overall": "5.0", "Content": "This LG Optimus P500 purchase was a pleasant surprise.  I live in Panama and the phone was shipped from Canada.  I had this unlocked phone up and running in 15 minutes.  Put my 4 year old SIM card from my old LG phone in, added the battery, closed the case and turned it on.  Everything worked.  It found my wireless internet quickly and all was good.  Now I just have to find a golf GPS with my home course on it.  For the price you can't beat it.", "Date": "September 26, 2012"}, {"Title": "I love this phone", "Author": "Australianphoneuser", "ReviewID": "R3TD5FA14DS7CS", "Overall": "4.0", "Content": "There is one reason I like this phone. It's very tough.I have dropped this phone on hardwood floors, roads, concrete. Each time I thought, well, that's the end of that. I picked it up and it was fine!. I bought this phone as a first foray into smartphones. I wasn't sure if I would like them, so I wanted something cheap to muck around on. Now, I hesitate to move on to more sophisticated models.I find the smaller screen size an advantage. Why? My friend, for example, dropped his iphone on carpet and the screen shattered!. This thing just keeps bouncing back.It's a simple, reliable phone for those wanting the basics ( but you can do a lot with it actually ). I use it every day, never keep it in a cover, and it keeps up with my busy life.Good battery lifeTake basic images and send them straight away to email.Has maps when I get lost.Play store, and runs most apps fine ( AFL, etc )In short, I recommend this beast as a reliable companion.", "Date": "April 20, 2013"}, {"Title": "A very affordable unlocked smartphone.", "Author": "Glitch", "ReviewID": "RZU5QVFQZBQ1A", "Overall": "4.0", "Content": "Everything about this phone gets the job done. Calling works, sound quality is good, but not amazing, texting works, apps work great, and the battery life is pretty solid. If you want a luxury phone, you'll have to go elsewhere, but at $80 and no contract, you simply cannot beat the price for a unlocked smartphone.The downsides of this phone are twofold. First, it has very low internal memory, so you cannot install very many internal-only apps. Second, you're stuck on Android 2.3 Gingerbread unless you root and upgrade.As for rooting? Yes, you can root this, and I have, to Android 4.2, but it isn't very newbie friendly. If you do root, make sure you know precisely your phone's model and carefully read EVERYTHING before you start. Then carefully follow those instructions without rushing. Since you're probably going to Android 4.X.X, you'll have to upgrade the baseband or you'll lose your ability to call after upgrading (which can be fixed if you do it wrong, but is a pain). If you do root and upgrade, it greatly improves the usage of the phone, but you'll still be stuck with low internal memory.", "Date": "August 20, 2013"}, {"Title": "Not for ATT", "Author": "J. Gillihan", "ReviewID": "R3H67W5LZMDULU", "Overall": "3.0", "Content": "I bought this phone as a stop gap between contract phones.I usually make it through a contract but my HTC Inspire just suddenly stopped working...13 months in...too late for warranty.Nice features, although only 3G I though I could handle a little slower speed for 6 months...WIRELESS CONNECTION IS NOT COMPATIBLE WITH AT&T; SYSTEM. Works as a phone and when wi-fi is available but that's it.I'm switching to T-Moble anyhow so we'll see...maybe it will work there.", "Date": "August 22, 2013"}, {"Title": "Takes awhile to get, but worth it", "Author": "Melk", "ReviewID": "R279I3N02L77HT", "Overall": "5.0", "Content": "This has been a great product, we also purchased the LG Thrive (which is essentially identical) and we were very impressed.  I bought two palm pixies for a little higher price based on reviews and they were AWFUL.  This phone is easy to use, has good sound quality and best of all works with T-mobile.  You will need a mini SD chip and I recommend a hard cover.  Great value for the price we paid.", "Date": "February 26, 2013"}, {"Title": "Good, Inexpensive First Smartphone.", "Author": "W. Laine", "ReviewID": "R4CS0HOGTFBSX", "Overall": "4.0", "Content": "Not being a phone-o-phile, I bought my first cell phone only 3 years ago, for convenience & emergencies.  My Paygo carrier just switched from CDMA to GSM, so the basic clamshell phone I bought from them no longer works, & I needed an unlocked phone.  I decided to try a smartphone, if I could find an inexpensive one that had features I would use.  After shopping on amazon for hours & reading countless customers' reviews, I found this phone, with 26 customer ratings averaging 4.5--high among the phones I saw under $100.  I like that it has WiFi so I can use my existing internet connection, instead of spending cell phone minutes.  I wanted a decent camera, since I'd be carrying the phone more often than my large SLR camera, & I have already taken several photos of subjects I'd have been sorry to miss.  Its 3.2 MP equals my first digital camera.  The battery life is nearly twice what my first cell phone had.  I wish the phone had more internal storage, because apps that came installed & some other apps cannot be moved to my SD drive.  Apps that came on the phone cannot be removed, even though I don't use some of them.  The 3.5\" screen makes typing with my fingers frustrating; typing passwords is maddening, because my entries are replaced by asterisks, so I cannot see my frequent typos.  I bought a stylus, which helps a lot.  I am sorry that I bought the phone from a Canadian company, because it kept wanting to use TELUS, instead of my carrier, PTel, & because the included browser lets me choose my location only from among Canadian provinces.  Not a scrap of documentation came with the phone.  I had to search the Internet to find a manual for it before I could even learn how to turn the phone on!  The manual leaves much to be desired, so I bought Android Phones for Dummies.", "Date": "October 14, 2013"}, {"Title": "Phone freezes once SIM card has been installed", "Author": "CM", "ReviewID": "R1YFRUEFA7VH9O", "Overall": "1.0", "Content": "I purchased this phone based on great reviews, to use for an upcoming trip to Europe. Phone arrived new in box. I liked the look-and -feel of it and the overall dimensions. Unfortunately, once I installed the SIM card I purchased from Amazon (Vodafone UK Pay as You Go) the phone would freeze every few seconds. I removed the SIM card and re-installed without any success. I may have gotten a bad phone but unfortunately I don't have the time to fond out. I returned for a refund.", "Date": "October 10, 2013"}, {"Title": "NICE PHONE", "Author": "Rochelle Mitchell", "ReviewID": "R3AAPMRH13PLOH", "Overall": "4.0", "Content": "I purchased this as a gift for my mom.  She loves it.  The graphics are pretty good.  It's a older phone compared to what is out there but it is really great.  It's fast and lightweight.  It's a good transition for a first time android phone.  The phone doesn't come with a sd card so be sure to buy one or you can't take pictures.  Overall, I'm very pleased.  The shipping was fast and the seller emailed me the tracking information, promptly because it wasn't listed under the amazon account.  I would definitely order from seller again.", "Date": "May 24, 2013"}, {"Title": "Good and inexpensive", "Author": "Sleepless in Tijuana", "ReviewID": "R3J4M9SGOYPAER", "Overall": "4.0", "Content": "This phone comes with an older version of android, however, I do not recommend you use LG's own software to update the firmware, otherwise you will brick it. This happened with the first one I had.Other than that, I am very happy with this phone. It cost me less than $100, and it comes with no strings attached.", "Date": "March 11, 2013"}, {"Title": "best buy", "Author": "hope lewis", "ReviewID": "R10L5FX0CUVS5N", "Overall": "5.0", "Content": "we bought 2 of these phones, they are nice and easy to use for anyone that just isn't into high tech things", "Date": "January 7, 2013"}, {"Title": "Great product and value!", "Author": "Anonymous", "ReviewID": "R2SOFKV4ZHJABN", "Overall": "5.0", "Content": "Great 3G Android smartphone product for the price, due to bulk packaging.  No problems thus far when in use in the U.S.", "Date": "November 9, 2012"}, {"Title": "You need something more? Why? Ah u r young!  T-mobile", "Author": "Anthony Chester", "ReviewID": "R1BM3UBEFC6G5T", "Overall": "5.0", "Content": "First one I got was not unlocked. Contacted Amazon and got a return and full refund no problem.But I still fancied one. Amazon's answer was for me to buy another with 2 day shipping and then refund the shipping. So here we are the experience whilst not perfect was at least resolvable. The second one has arrived and its unlocked. All seems OK so now life will be back to normal following the full refund on the first and the shipping refund on the second....Oh and the phone rather than the drama....is just fine. Basic but rootable and ROM able so I have read. Don't know that I will as really all I wanted was a phone for T mobile. However the idea of being able to block some callers is attractive considering how some telemarketers ignore the do not call register. If you are like me and dont really have a need for mobile data or have a grandfathered t mobile no data plan then be sure to turn off the data by network option in settings. If not then just keeping the fancy weather widget on the home screen will cost a fortune. You can of course connect it to your wireless network easy enough and get data that way.", "Date": "April 17, 2013"}, {"Title": "great cell phone", "Author": "songolocks", "ReviewID": "R3N9P2XWH5FOLG", "Overall": "5.0", "Content": "I have had several cell phones but this one works better then the other seven I had before.  Love it.", "Date": "May 25, 2014"}, {"Title": "So far, So good!", "Author": "Cheap Sniveler \"CacheFreeTV\"", "ReviewID": "R3KQOPLQV5P7IR", "Overall": "4.0", "Content": "I bought this phone as a gift for use on P-Tel prepaid. I haven't put a sim card in it yet, but everything seems to work really well - wi-fi, apps, GPS, camera - all great for the price. This one came from CANMobility, and included a 2 GB memory card.I'll update this if I have any problems. If I don't update then you can just assume that everything works fine, and we're very happy with it!", "Date": "December 5, 2013"}, {"Title": "Good and simple", "Author": "Daniel", "ReviewID": "R2Q6NIJ99FMD9Q", "Overall": "5.0", "Content": "this phone is a very good and simple device to use. Straight to the point with no complications. I recommend it to anyone looking for a good, simple and inexpensive phone", "Date": "October 29, 2013"}, {"Title": "simple smart phone", "Author": "qball", "ReviewID": "R1ZCC5NROOQWN2", "Overall": "4.0", "Content": "Good product for the price.  If youare looking for a simple smart phone this is great.  The only issue is with the small internal memory.", "Date": "October 6, 2013"}, {"Title": "lg optimus purchase at amazon", "Author": "lg optimus purchased at amazon", "ReviewID": "R1X9CSR95QA42L", "Overall": "5.0", "Content": "I bought two of these phones for my twin daughters and I love them, they also love them too, they are excellent.", "Date": "July 6, 2013"}, {"Title": "Excellent android phone for its price. Stylish and feature rich", "Author": "Ganesh Duggirala", "ReviewID": "R79IWZI10TXP1", "Overall": "5.0", "Content": "Excellent android phone for its price. Stylish and feature rich. Apps run fast. Battery is good. Camera does not have a flash", "Date": "June 8, 2013"}, {"Title": "good deal", "Author": "Luis Gonzalez", "ReviewID": "R1T5IEX9DN8EKS", "Overall": "4.0", "Content": "No complains about this one, is not an impressive smartphone, yet it has all what I need nowadays in a mobile phone. Performance is decent as well as battery life.", "Date": "June 2, 2013"}, {"Title": "Good Phone!", "Author": "Miguel J. Tineo Zamora \"Machinesoft\"", "ReviewID": "R213FO10QLV3PZ", "Overall": "4.0", "Content": "A very decent phone, very comfortable, good quality, buy it as a gift for my mother and is very easy to use, although I had no problems with any application but the battery does not last late afternoon", "Date": "April 9, 2013"}, {"Title": "Nice phone but........", "Author": "FrankK", "ReviewID": "R2TUW6CXHJN01X", "Overall": "3.0", "Content": "I really liked this phone.  It has good Wifi coverage, bluetooth works nicely, nice form factor, decent call quality, Android 2.3.3 Gingerbread.  The only problem is that I couldn't get the micro SD card to work.  I tried 4 different cards.  I had to return the phone.  I am considering getting a replacement phone and I'll update my review if it works.I bought this phone from iZoneDeals in Canada.  I must say that it was a pleasure dealing with these folks as they were very courteous and promptly refunded my money for the defective phone.", "Date": "March 31, 2013"}, {"Title": "Good phone, but the battery did not perform", "Author": "Sarita Rampal", "ReviewID": "R2Z0WKU2PY4JX4", "Overall": "4.0", "Content": "Very good phone for the price, but the battery charge did not last for the period mentioned in the tech specs.", "Date": "March 17, 2013"}, {"Title": "Know what you are getting in to. It is not the fastest thing around", "Author": "Tekedi", "ReviewID": "RWB2LR92KBADL", "Overall": "4.0", "Content": "I bought this phone because my old one had broken. This phone is good, however it should be understood that it is not fast like all of the new phones coming out. The speed is fine for normal phone stuff, but don't expect to run all the newest apps to their full potential.Also the LG Keyboard application that it has crashes a lot. It is easy to fix (Just hit the return button until you are back in the text message screen, then it restarts) however it can be a hassle.I really do love this phone, but it is not perfect. If you want more, you will have to pay more for a newer phone.", "Date": "March 3, 2013"}, {"Title": "Good phone", "Author": "Camp1127", "ReviewID": "R3UCZ24SYUBU6H", "Overall": "3.0", "Content": "Good phone but a bit small.  I'm not a huge fan of android. Nevertheless it is  worth the low price.", "Date": "February 25, 2013"}, {"Title": "nice smart device in pocket", "Author": "jg yu", "ReviewID": "R1ZN725BH1TU85", "Overall": "5.0", "Content": "It is my first smart phone. It rearly works well like a computer. It is small, so the finger need to precisely touch the keypad  to enter.", "Date": "February 17, 2013"}, {"Title": "It's okay", "Author": "slshorts703", "ReviewID": "RLRMTLHR8UZGF", "Overall": "4.0", "Content": "The phone does what i need it to do - check email, facebook, etc. However, i believe the memory is lacking because it is very slow loading things. It also takes a while to load web pages even when i have a great connection. The phone did not come with an SD card which was annoying because I could not take pictures. It has a very cool feature that lets you use the phone as a mobile hotspot. Overall I am happy with it, but i would appreciate something a bit faster.", "Date": "February 1, 2013"}, {"Title": "Phone for money", "Author": "Ganesh Kondeti", "ReviewID": "RU639GZ25I0S9", "Overall": "5.0", "Content": "I did about two months research on this phone before I purchased it, Very good phone, i am enjoying it.Excellent low cost devise met all my expectations...", "Date": "February 1, 2013"}, {"Title": "Return phone", "Author": "clickonrod", "ReviewID": "RHYPMVLR8NJSS", "Overall": "4.0", "Content": "The phone was really nice, but when I  installed the SD card it would not read it, so I returned the Phone!", "Date": "January 30, 2013"}, {"Title": "Nice phone, great price", "Author": "R Bennett \"rqb2\"", "ReviewID": "R1SEDVH52K5M7K", "Overall": "4.0", "Content": "Phone works great.  Needs to be rooted to get rid of all the Canadian links that are built in, but otherwise a good buy, with Android 2.3.3 Gingerbread, and a 2 gb. micro sd card included.  The only other thing I could want is a slightly larger touchscreen...I have problems striking the correct key, and this makes typing things like website addresses very challenging...", "Date": "May 1, 2013"}, {"Title": "Good phone for reasonable price", "Author": "lej", "ReviewID": "R2W3ZQWJVC76XC", "Overall": "4.0", "Content": "The phone meets my expectation for a smart phone although the internal memory is small. If you want a video call, this is not the product for you.", "Date": "March 21, 2013"}, {"Title": "Buen servicio y rápido", "Author": "Carlos Rivas", "ReviewID": "RCJE369P95J3U", "Overall": "5.0", "Content": "Buen servicio, rápido y seguro, además, cumple con lo solicitado. Lo puedo recomendar altamente. Compraría de nuevo con este vendedor.", "Date": "March 20, 2013"}, {"Title": "exelente", "Author": "Francisco Monasterio", "ReviewID": "R3CB8XM9VR37V3", "Overall": "4.0", "Content": "muy bueno responsable y oportuno, muy buena atencion y responsabilidad,no tardo en llegar el producto ,  el distribuidor responde y nunca perdimos contacto, lo recomiendo abiertamente", "Date": "February 8, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "2G Network: GSM 850 / 900 / 1800 / 1900, 3G Network: HSDPA 850 / 1900\nBluetooth 2.1 for connecting with hands-free devices, 3.2MP camera with autofocus and video capture\n3.2\" touchscreen with virtual QWERTY keyboard, MicroSD Slot for memory expansion\nBULK ITEM, NO RETAIL BOX, MAY BE CARRIER BRANDED BUT IS COMPLETELY UNLOCKED\nINCLUDES:      Phone     Travel Charger and Micro USB Cable     Rechargeable Battery", "Name": "UNLOCKED LG Optimus One P500H 3G Phone BLACK with RED Border, Google Android, NEW, BULK PACKAGED, 2G GSM 850/900/1800/1900MHZ, 3G HSDPA 850/1900MHZ", "ImgURL": "http://ecx.images-amazon.com/images/I/41YC9uwdz4L._SY300_.jpg", "ProductID": "B006X7ALO4"}}