{"Reviews": [{"Title": "Do not buy this phone if you want to have any apps", "Author": "Heather Smith \"household appliance aficionado\"", "ReviewID": "RO2GIAEVI1LZ0", "Overall": "2.0", "Content": "This would be a great phone if it wasn't for one HUGE issue. It has almost no internal memory. In fact, it has so little memory that you can't even update the applications such as Google Maps that came pre-installed on the phone, and they can't be moved to the SD card. This is a huge problem. If you are skeptical that maybe I just don't know how to use my phone, check the online forums. Lots of people are considering getting rid of this phone because of this issue. Of course the phone still works, and it is pretty fast, and there's a lot to like about it. But having the phone constantly tell you that you are out of internal memory and have to go clear your caches and delete text messages is very annoying. I would not buy this phone again.", "Date": "February 15, 2012"}, {"Title": "great phone:)", "Author": "kelly", "ReviewID": "R1ATV5JCV96XNF", "Overall": "4.0", "Content": "I truly love this phone. its easy to use,personlizeabul,lots to do on it. Ive got a ton of music on mine plays great!! music,internet,texting,phone calls all on the go and at my finger tips:) it awesome. one thing is the battery isnt so great but its running lots of apps and such you can turn some off and adjust power settings to conserve. that and buy a cheap battery for back up. ive notice if i put it on charge here an there for little bit it always hepls it get threw the day. I know that alot of people complain about not haveing enough room for apps well if your a person who is  an app fanatic well this phones not for you!! Ive got plenty of apps alot of music and a buch of other stuff had no problems at all!! plus ive got a 4gb micro sd card. :) hope this hepled:)", "Date": "February 2, 2012"}, {"Title": "HTC Wildfire", "Author": "Renee Robertson", "ReviewID": "R22A4JCS9LTLFV", "Overall": "1.0", "Content": "This phone does not work. It drops calls and you can't get you emails. I would not wish this on my dog. That was money that I wasted. They say if buy something cheap you get what you pay for. That statement is true. I only kept this phone for three days and it sitting in the box in the closet.", "Date": "October 23, 2013"}, {"Title": "wondering", "Author": "Biffel123", "ReviewID": "R3RN2H2ZYDMLPW", "Overall": "5.0", "Content": "I was wondering if i could use this for T-mobile? I mean it says T-mobile on it....Someone please write back!!", "Date": "March 16, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android 2.3\nWIFI\n5MP Camera\n512MB RAM\nExpandable Memory: 32GB (sold separately)", "Name": "HTC WILDFIRE S WHITE (VIRGIN MOBILE) ANDROID", "ImgURL": "http://ecx.images-amazon.com/images/I/41mPHMyGB%2BL._SX300_.jpg", "ProductID": "B006IWBAZS"}}