{"Reviews": [{"Title": "I love the phone, but it has no battery life of which to speak", "Author": "Frequent Customer \"Frustrated\"", "ReviewID": "R3GVR550HMGVOT", "Overall": "2.0", "Content": "My old Verizon phone broke, so I purchased this one to tide me over until I can upgrade.  I prefer phones with actual keyboards to touch-screens, possibly because of my large fingers that tend to push multiple on-screen buttons on touch-screens.  The phone works well, and I am enjoying it.  Unfortunately, however, the seller did not indicate that the battery life on a full charge is about 5 hours on standby and only about 15 minutes speaking on calls.  If I had known, I might have made a different decision regarding the purchase.  A new battery will cost and additional 50% - 65% above the price I paid for the phone.", "Date": "October 23, 2013"}, {"Title": "Item was in great condition", "Author": "Jay", "ReviewID": "R10V2ZY62M5HNL", "Overall": "5.0", "Content": "This is an great phone for someone who just wants a texting phone. Seller had a great price for this item. I would not reccomend this phone to someone who wants email or internet features.", "Date": "March 16, 2013"}, {"Title": "LG env3", "Author": "WILIAM RIVIELLO", "ReviewID": "R233R5MOZAU6V6", "Overall": "3.0", "Content": "Exact same phone as i previously had but i am dissapointed as the external speaker (ringer) is not as loud as my previous env3 and also it does not move as quickly from one screen to another.", "Date": "December 31, 2012"}, {"Title": "Yes.", "Author": "AuntieEm91", "ReviewID": "R36AIVVTMRJRD5", "Overall": "5.0", "Content": "Bought this as a replacement phone for my father, he doesn't like smart phones and just wanted a phone he could dial and text on. This phone is perfect, it's sturdy, and the right size. He loves this phone, and for the price you can't say no, if you need a replacement phone or a new phone, and you don't want a smart phone but like the qwerty keyboard for texting, I suggest this one.", "Date": "March 26, 2014"}, {"Title": "Worst phone ever", "Author": "Hilretta Jackson", "ReviewID": "R28UMUOXO9KZWE", "Overall": "1.0", "Content": "This was the worse purchase that I have ever made with amazon. The phone never did turn on. It was in worse condition than what was stated that it was in. Will never purchase that way again.  Just wanted to get a replacement phone. Wind up not even using it at all it wouldn't even work.", "Date": "March 14, 2014"}, {"Title": "Love the text screen!", "Author": "Jan Morris", "ReviewID": "RF3R3EZZZSE6D", "Overall": "4.0", "Content": "Nice be able to text with the text screen, instead of the number keys.  Seems to be a Great phone so far.", "Date": "February 23, 2014"}, {"Title": "Nice phone", "Author": "C. Hunter", "ReviewID": "R2U3AYBI9ZX5U6", "Overall": "5.0", "Content": "Awesome phone I bought my parent. The keyboard makes it easy to text. They have just started learning how to text.", "Date": "December 30, 2013"}, {"Title": "Held a good charge", "Author": "Paul Brad B. Edwards \"grindit\"", "ReviewID": "R1HP9FONPBQ9EO", "Overall": "5.0", "Content": "This was a good battery for this phone. I used it until I upgraded and traded in. I'd recommend it.", "Date": "August 20, 2013"}, {"Title": "cell phone", "Author": "dannybee", "ReviewID": "R3E5ECA06MLU5W", "Overall": "4.0", "Content": "With the phone I purchase I have no problems with this phone.I will be getting another phone in the next month.", "Date": "April 20, 2013"}, {"Title": "weak battery?", "Author": "msc", "ReviewID": "RV8DCGEQOFQJ8", "Overall": "3.0", "Content": "THe enV3 in blue is a great phone. My only complaint is that I have to charge the battery every other day.  I have had a red version of the enV3 and it did not have this problem.", "Date": "December 12, 2012"}, {"Title": "Don't work", "Author": "Vincent", "ReviewID": "REDSVTZLNG7CF", "Overall": "1.0", "Content": "I bought this phone yesterday 8/4 and everything was fine. I put it on charge before I went to bed and when I got up it wouldn't do nothing. I changed chargers and still nothing. I'm getting my money back.", "Date": "August 5, 2012"}, {"Title": "upset", "Author": "A. Wiles", "ReviewID": "RA1FTWKE7E264", "Overall": "1.0", "Content": "I bought this phone for my grandson for his birthday because it said \"no Contract phone\" thinking this ment I could purchase a $50.00 prepaid card with unlimited talk, text and data, WRONG. THERE IS NO CONTACT BUT IT COSTS 75.00 PER MONTH FOR THIS PHONE WITH VERIZON BECAUSE IT DOESN'T QUALIFY FOR THE $50.00 PLAN. UNHAPPY, UNHAPPY. Grammaw", "Date": "February 9, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006YZM332"}}