{"Reviews": [{"Title": "iPhone killer", "Author": "Will", "ReviewID": "R1NVWYXEGH8SW0", "Overall": "5.0", "Content": "Best phone I have ever had. I am getting concerned with Googles privacy policies and Apple has bs closed platform policies. This new Microsoft/Nokia combination is awesome. The phone is fast, super easy to use and figure out and frankly is more powerful and more fun than an iPhone or Droid.", "Date": "February 19, 2012"}, {"Title": "Smooth, refreshing and very cool . . .", "Author": "Al-Reyes", "ReviewID": "R24UF738ZJ5W1D", "Overall": "5.0", "Content": "I painted my old Jeep shiny white this past year, but I almost had it painted Matte Black had it not been for the advice of the body shop who said it was too risky to maintain matte paint. I regret it now, it would have been so cool, I have seen other vintage cars with matte paint... Darn it! I still was moping around about my choice of Jeep paint, when it became necessary to replace my Android phone that went kaboom on me. I shopped around for the obvious, latest Android, latest iPhone, Samsung's LTE from AT&T; with a contract. I looked into the white iPhone 4, but then I thought, \"Don't do it again Al\" let's go with what is different, stop trying to follow everyone else. So I got myself the new Lumia 800 (in Matte Black!) it's unlocked which has the latest Windows Mobile version(I read all about this version, aka Mango) last year and all the talk of how Nokia and Microsoft are trying to compete with Android and iOS, blah blah blah. I decided to give it a try, so far it has been a month. I am using my X-Box live account, I have all my stuff synced up with a live account that backs up everything from my contacts to my photos via something called Skydrive, music was imported, all my documents from my old Android too. My Facebook, Tweeter, personal email and work email are merged into this mobile with something called Office 365. I don't want a contract from AT&T; or T-Mobile, but I heard that a newer version of Lumia will be released from AT&T; soon. I read that it is very similar, except it has LTE and a bigger screen. So far so good, I'm liking this Nokia-Microsoft experiment. So long as they keep it real like they did with this Lumia 800, I'm a believer.", "Date": "January 12, 2012"}, {"Title": "Windows Phone + Nokia rules!", "Author": "Alex", "ReviewID": "R7FFES6MKLAMM", "Overall": "5.0", "Content": "I highly recommend this mobile phone. It is impressive the number of apps (tons of free ones) already available at the Marketshare. The integration between Xbox live games is awesome and the look and feel of the device itself + windows phone is great.", "Date": "March 11, 2012"}, {"Title": "From Black Berry to Lumia", "Author": "Rafael A Alcantara", "ReviewID": "R36NKYSM5OMGO5", "Overall": "4.0", "Content": "Done with the Blackberry.  Kept it for too long, just because my clients in LATAM are still all about the bbm.  They too started changing and now ditch the headache for the Lumia.  Was sure I was going for an I-phone, which is superb, yet the Lumia at the price.... its just difficult to justify paying twice as much for the same and then both Nokia and Microsoft are sinking their soul into this platform, so that at least for the duration of the phone, I feel assured that I will have  a much better ride than with my blackberry.  couple of days now and its great.  The larger size is good for e-mails and going over company pdf's and such.....  easy to navigate between the apps... me like.  Lets see how the hardware/software stand to some usage.", "Date": "April 21, 2012"}, {"Title": "PRODUCT WAS AWFUL AND THE QUALITY OF THE PRODUCT DECLINED WITHIN THE FIRST FEW WEEKS OF PURCHASE!!!  DO NOT WASTE YOUR MONEY", "Author": "HEATHER EDMONDSON", "ReviewID": "R2KXWZC25VHYUO", "Overall": "1.0", "Content": "Product did not last more than a few weeks before it started declining.  I think the retailer should give full refund.  It started making a metallic clicking sound with first few weeks then the screen went blank while you were using the phone.  I couldn't hang up or press numbers for calls that needed teleprompting.  Awful product.  Awful retailer and Amazon should seriously consider withdrawing from a company that sells faulty products.", "Date": "September 11, 2013"}, {"Title": "Perfect shape and UI. TERRIBLE BATTERY.", "Author": "Hao", "ReviewID": "R2ESCWS07LGKK8", "Overall": "2.0", "Content": "It is just the right size and shape. Easily slip into my pocket.Interface is the best so far. Apple or Samsung are child's play compared to this.I turned off all background apps and didn't touch it at all, but Lumia 800 can only stand by for 26 hours;Now I charge it everyday and I hate it. All I did was a few msg, 1 or 2 calls, maybe 15 min gaming/web browsing.On Nokia website it is said to have 200+ standby time. I didn't expect 1 charge/week but 20 hours standby is unacceptable.", "Date": "September 7, 2013"}, {"Title": "Good phone", "Author": "Ricardo A.", "ReviewID": "R3S1D1U4L3H9I3", "Overall": "5.0", "Content": "This is really an excellent phone. It is beautiful, and also has a good OS. I've always had Nokia phones and for me they're the best.", "Date": "May 17, 2013"}, {"Title": "good staff", "Author": "ricko", "ReviewID": "R78048DUIVWNG", "Overall": "5.0", "Content": "my wife loves it.cool celling phone,easy to use.. . . .. . . . . . . thank, thank, thank.", "Date": "March 5, 2013"}, {"Title": "i'm love it", "Author": "Rattasan", "ReviewID": "R16603VKGA6WJS", "Overall": "5.0", "Content": "good thing.simple phone. fit on my hand. not too big like lumia 900 or 920 or 820fast  and screen very bright under the day lightand i'm love Zune music passbad thing.web browser still need to improvekey board.... not comfortable to type compare with iphone . it's more easy to do", "Date": "December 27, 2012"}, {"Title": "Great phone", "Author": "Natalia", "ReviewID": "R1ZZ7438A7CKOL", "Overall": "5.0", "Content": "Absolutely satisfied with my purchase. The phone is exactly as described, stylish outside and smart inside. Battery charge is enough for 2-3 days.  Has number of very useful features like MS office, navigation and Xbox games.And the very big plus is that as I know from my previous experience Nokia will serve for a really long time. When the time comes for the next phone to buy it will be Nokia for sure.", "Date": "July 16, 2012"}, {"Title": "All hassle", "Author": "cwUSA", "ReviewID": "R14YUSED8F8F2O", "Overall": "1.0", "Content": "Nothing but a hassle, called and sent feedback, all the troubleshooting no help whatsoever.  By the time done with back and forth, no one wants to honor warranty!  Does nothing but drops calls, constantly, and then was told this product is not for sale or use in usa????  WOULD NOT  PURCHASE ANYTHING  FROM THIS AGENT, ALL FOREIGN.  AND ONCE AGAIN SENT A REPLACEMENT AND THIS PRODUCT DOESN'T EVEN TURN ON!!!AND GOT NOWHERE WITH CUSTOMER NOT SERVICE!!Just a suggestion when reviewing products, name the country you are from!", "Date": "April 24, 2013"}, {"Title": "not bad", "Author": "Brian", "ReviewID": "R2D7V2VG9SCM75", "Overall": "5.0", "Content": "good phone, looks nice, good seller, good service, fast shippment, but nokia windows phone is really hard to use, almost killed me, throwed away", "Date": "November 25, 2012"}, {"Title": "Screen Goes Blank and Hard to set up for Straight Talk", "Author": "Allan Sharrock", "ReviewID": "RRYVWFBCBQYP4", "Overall": "1.0", "Content": "Ok, so if you are buying this phone to use with straight talk you better be ready to have some issues. First straight talk people don't know what the right APN settings are for this phone. After about 12 hours, no joke, worth of phone calls I was finally able to get the correct settings. Now as far as the phone I get crappy signals in most locations. You might say that is my providers fault but my wife uses straight talk also and she gets excellent signal on her walmart phone. Now my screen is staying black when I make a phone call and I have to shut it down during the call. I wouldn't recommend a windows phone. Here are the APN settings to save you some trouble.Access point Name: att.mnvoSkip down toMMS APN: att.mnvoProxy address : proxy.mnvo.tracfone.comproxy port : 80MMSC address: http://mmsc.cingular.com", "Date": "June 11, 2013"}, {"Title": "bought unlocked phones but still locked", "Author": "satit", "ReviewID": "REF7JN2OMXNIA", "Overall": "3.0", "Content": "Dear  The nice mobile phones  but  still loked .cause of canadian provider said  after put new simsit  didn't work  because of  mobilephones still lockedthey suggest  find shop to fix  it.", "Date": "April 17, 2013"}, {"Title": "Not a phone by nokia instead by Tmobile", "Author": "Topcms", "ReviewID": "R1YGJTM7RQ45DW", "Overall": "5.0", "Content": "The phone is licenced for tmobile and for that reason the amount of software you can install to it is limited. The phone is described as a Nokia unlocked phone but it isn't Nokia by Nokia. I didn~'t like it.", "Date": "April 12, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0065VOIB0"}}