{"Reviews": [{"Title": "Unlocked note", "Author": "Kenneth", "ReviewID": "R3ADMB3XZ263V4", "Overall": "5.0", "Content": "Great place to order. Ordered the phone U.S but phone came international so thanks its actually better.  phone came as it says, it was unlocked and working with no problems.just put sim in and phone started right up. I Will order again and already did tonight from this vendor. Thanks FGS Trading", "Date": "March 13, 2012"}, {"Title": "Nice!!!!", "Author": "nako79", "ReviewID": "R3P75JD5N41G38", "Overall": "5.0", "Content": "This phone was a present for my wife and it has been a great success. I really didn't want to get her into the i-phone frenzy so this became an ideal alternative.", "Date": "January 10, 2013"}, {"Title": "Samsung N7000 Galexy Note", "Author": "Davina's Spectacular Cleaning Service", "ReviewID": "R2KPBEP1WW0I0J", "Overall": "5.0", "Content": "The phone was everything ive heard about it Excellent- MUST HAVE PHONE!! I wont go back to another small phone again I love the large screen it like having a small computor in your hands", "Date": "September 3, 2012"}, {"Title": "I do not recommend this one !", "Author": "Joseph", "ReviewID": "R1PS6PJ2YNEUG0", "Overall": "1.0", "Content": "I do not recommend this Telephone.  The screen freezes very often in the mid of a communication and does not allow you to move from that window.  And the battery is so bad that I purchased 3 new replacements within two years time.  Now I have put this telephone aside because it does accept to recharge .  I am very disappointed with this Samsung.", "Date": "June 1, 2014"}, {"Title": "Excellent phone", "Author": "Esther R. Carpenter \"Mahagonye\"", "ReviewID": "R29IFI1045PE1H", "Overall": "5.0", "Content": "When I received this phone because I had one previously I thought this on was not the same, however as I began to study this phone I realized that it had some features that my previous phone did not have and that impressed me. Since then I have learned a lot more about it and I think it is very cool.", "Date": "December 25, 2012"}, {"Title": "Can this be set to Russian and work in Tajikistan?", "Author": "Amazon Customer \"PolyglotRach1989\"", "ReviewID": "RSFTO0RADAL0M", "Overall": "5.0", "Content": "I'm taking my chance to ask, so if anyone knows-will this work in Tajikistan and can this be set to Russian interface? it's important,i'm searching for a great smartphone either Samsung or Nokia to give to a friend speaking Russian and in Tajikistan..anybody who knows,please tell me,", "Date": "December 2, 2012"}, {"Title": "Good quality.", "Author": "Freddy Arana", "ReviewID": "RNKBOB5ASKVET", "Overall": "5.0", "Content": "Im totally satisfied. this product is excelent, I really loved it. I really recomend to buy this prooduct. Nothing else...", "Date": "October 28, 2012"}, {"Title": "Real good product and deliver service", "Author": "A. Kast \"akast\"", "ReviewID": "R6017ZNMRUDBE", "Overall": "5.0", "Content": "It works great here in Chile. Updated tu ICS via OTA the same, international version works great.Recommended purchase at all time.", "Date": "June 16, 2012"}, {"Title": "Great phone, but be aware of the size", "Author": "Henrik I. Christensen", "ReviewID": "R3KHVD03VXFYOF", "Overall": "4.0", "Content": "I have owned way too many phones. Based on the reviews I decided to also try the Galaxy N7000 which is also called the Samsung Galaxy Note. It is a smart phone with a serious sized screen. The phone runs android 2.3 so be aware that it is not the lastest android version and it is not clear it will be released with sandwich. The call quality is excellent. The internet speed on AT&T; is also great as it uses the real 4G (LTE) network features. The system comes with the standard Samsung application package, it is entirely OK, but I am not too crazy about their calendar app. The phone has pretty good overall performance. The GPS tracking for google map, yelp, ... is slow acquiring a satellite fix (5-10 times slower than iPhone). The big screen is excellent for email reading/web browsing. However the big screen does imply that it barely fits in one hand and for example for running using Run Keeper or a similar application, it is really too large. So great for sit down use, but less convenient for use on the move.", "Date": "June 2, 2012"}, {"Title": "Excellent", "Author": "Vicente E. Ugueto E.", "ReviewID": "R32TAAMMW1YMFE", "Overall": "5.0", "Content": "It was excellent. ]Thanks a lot. In the future, I am going to buy you what ever I want.Vicente", "Date": "April 23, 2012"}, {"Title": "good phone, but not 4G in the US like the ad leads you to believe.", "Author": "anonymous", "ReviewID": "R17325OUAHR2VE", "Overall": "1.0", "Content": "Main COMPLAINT: NOT A 4G PHONE AS ADVERTISED.it was new and in the box, but had a international to us power adapter thrown in the shipping box with it.But my major complaint is the ad says\"Technical DetailsMulti Input Full touch + S Pen (Advanced smart pen)AndroidTM 2.3(Gingerbread)3G/4G: 850/900/1900/200 EDGE: 850/900/1800/21005.3\" WXGA (1280 x 800, 285 PPI) screen* HD Super AMOLEDCamera Main(Rear) : 8 MP with LED Flash / Front : 2 MP Action Shot, Beauty, Panorama Shot, Smile Shot\"Well it maybe 4G in europe but in the US its 3G.This place truthfully calls it \"Samsung GT-N7000 Galaxy Note (3G 850MHz AT&T;) Blue Unlocked Import\"[...]", "Date": "June 19, 2012"}, {"Title": "very good", "Author": "celina", "ReviewID": "R3H5SVVITSLLAS", "Overall": "5.0", "Content": "Everything was good. There is no problem in the product and shipment. This unlocked phone works fine in another country. It does not need any agreement with a cell phone company.", "Date": "May 15, 2012"}, {"Title": "El Celular perfecto para mi", "Author": "I. F. O", "ReviewID": "R1HI7LFODZER42", "Overall": "5.0", "Content": "El mejor celular que he tenido en mis manos. Lo volvería a comprar una y otra vez...Excelente, lo recomiendo. Muy buen equipo. Samsung es lo mejor!", "Date": "December 3, 2012"}, {"Title": "QUESTION", "Author": "s win", "ReviewID": "R2508DRIYE7WDP", "Overall": "5.0", "Content": "Hello Please help!!!So, amazon offers two Galaxy notes that look almost exactly the same (Samsung Galaxy Note N7000 16GB Unlocked Android Smartphone - Dark Blue)and (Samsung Galaxy Note GT-N7000 Unlocked Phone--International Version Blue). Is the first one a US version. Both phones have the single home button though, which makes me think that both are international versions even though amazon doesnt specify whether or not the Samsung Galaxy Note N7000 is an international version. If anyone knows anything about this, please let me know. I want to buy the US version that allows me to use the Galaxy note with Tmobile and get 4G after I radio hack it. thanks!!!!", "Date": "July 1, 2012"}, {"Title": "Great...for an Android Phone", "Author": "SudsySoper", "ReviewID": "R20YRYAJOVONFS", "Overall": "3.0", "Content": "I got this 'Phablet'(half Phone / half Tablet) for my wife as she had tried it and really wanted it.  (We need unlocked phones because we work overseas so much).  For me...the phone is too big and I can't really figure out the Android operating system after using Windows P-7.", "Date": "May 25, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "307.5\n768.75", "Name": "Samsung N7000 Galaxy Note Unlocked Android Smart Phone with 16GB Internal Memory, 8MP Camera, HD Video, Super AMOLED Touch Screen, Bluetooth and Wi-Fi - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51E7gWzRS0L._SX300_.jpg", "ProductID": "B006LRNPZS"}}