{"Reviews": [{"Title": "It's becoming obsolete - pointless flaws", "Author": "Finkel Epstein", "ReviewID": "R1N2RFRBVF1920", "Overall": "1.0", "Content": "I bought this through Consume Cellular (CC)-- CC is a decent company, but they restrict the usage of the phone and use older services. The Nokia can run simple Java based programs and games, but unable to run the more sophisticated apps.The camera is horrific... forget this phone if sharp, clear images are important to you.Consumer Cellular tech support told me that this a 2G device.  They told me that 2G Technology will not be supported by carriers in the very near future.  The phone uses slower \"EDGE\" or even lower \"GPRS\" technologies.If that is true,  then the fact that this technology is being abandoned suggest that there is no market for this phone --However - I like the keyboard feel, the texting is fine.  It can get on the internet and check email. It can send and receive photos, take short, silent videos.There is no voice dial and there is only one alarm setting -- ridiculous oversight.There are really too many reasons NOT to buy this phone.  It's too outdated.", "Date": "August 26, 2013"}, {"Title": "Poor Substitute for the Classic Palm & Pantech Series Semi-Smart Phones", "Author": "Patrick Bateman", "ReviewID": "R2V2DCOZUKV4MA", "Overall": "2.0", "Content": "While the design of this device is cleaver and in all fairness does have it's advantages, there are several design flaws that make it prohibitively an incompetent choice. One of the biggest ones being that even though it has an interfaceable USB port, standard USB chargers cannot be connected. Furthermore, while Consumer Cellular does offer more than competitive rates because their service is GSM based... you virtually have to have an extremely expensive (more than what you'd pay in 8 months or more for the bill) phone to even get semi-reliability in rural areas. So if you must go with CC for your carrier, the Nokia C3 is not the right thing for you.", "Date": "March 21, 2013"}, {"Title": "Not good", "Author": "M. Mitchell", "ReviewID": "R18O90FH8Z003S", "Overall": "1.0", "Content": "I would not recommend this phone to anyone. I bought it and used it for two weeks. It drops callS all the time, there are times when the person you are speaking with cannot hear you and the picture quality is very poor. This phone is NOT GOOD.", "Date": "July 9, 2013"}, {"Title": "Rediculously Tiny Keys, Difficult To See", "Author": "Raven \"Yolanda Vargas\"", "ReviewID": "R3SKDNY7WP9807", "Overall": "1.0", "Content": "I currently have this model which I am looking to replaceConsThe keys on it are rculously small.and hard to see extremely annoying, they are black the alphabet and numbers are pale silver, the numbers are on even tinier gray boxes on the keys.You need to wear glasses or use a magnifine glass to see them even in broad daylight with the sun directly above me I still had to use glasses, never had to do that with other cell phones beforeEven though it has some pretty cool features like audio video recording, great sound, and takes nice pictures I'd still advise you to skip this one wish I had. I should have done more research before buying this one", "Date": "December 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006GQU1VU"}}