{"Reviews": [{"Title": "The BEST budget smartphone out there- Once You Update It!", "Author": "KingJ", "ReviewID": "R3GHMU6O9YXW8N", "Overall": "4.0", "Content": "I would advise anyone reading this to first look at the review made by Bruno Leite (the first review made) because he has done a great job analysing this phone as is. My opinion is a bit different because I took the time to update it to the gingerbread 2.3.5 firmware (which tackles most of the issues with this phone).Let me first say that I did TONS of research before deciding which smartphone would be my main phone and even when compared to other phones within/above its price range, the MOTO FIRE XT stands tall. Before I bought it I was well aware that the camera quality would be poor when compared to other phones boasting 5MP, that there was a glitch somewhere that drained the battery after a few hours whether or not you were using it, and the internal memory is a bit low which limits the amount of apps that have to be installed on the phone rather than the MICRO SD card. So with very little hesitation I took my fire xt out of its pretty little red box and researched how to update it, which turned out to be pretty simple despite the scary hoopla around it.You can go to this link: [...] -to follow the step by step process to unroot and update your phone.After the update, all my doubts were GONE. The 800mhz processor makes switching between apps and other functions quick and easy (something most blackberries at this price could never do properly). The touch-screen is very responsive and I love how I can move my apps around and customize my display. The camera quality is much better, and so is the battery which can now last a FULL DAY easy with moderate use (calls, texts, emailing, downloading, games and net-surfing). The internal storage issue is one you just have to get use to as I only install the \"phone-based\" apps that I like the most, not really a problem unless you have a dying need to have every app. The android market gives you access to just about any app and is easy to use. I forgot to mention the look and feel of this phone... its jus sexy to look at and touch, and it seems to be very durable. I was looking forward to using my front facing camera on skype but as Bruno said, most phones are having trouble with skype including this one. Overall this is an awesome phone once its updated, for first time smartphone users as well as those on a friendly budget. Looking forward to future updates and anything else Motorola should do to expand on this device, especially the skype.", "Date": "March 25, 2012"}, {"Title": "Works great... for a few hours a day!", "Author": "Bruno Leite", "ReviewID": "R2ECLFWHM72ZZ", "Overall": "3.0", "Content": "Phone works right, no freezes in a week of (almost) heavy use, speaker is loud but unclear, screen is big and bright, wifi \"n\" gets good signal, but all these drain the battery in a very few hours.Browsing a social network for about 20 minutes (3g data off, bluetooth off, GPS off, only wifi on) I'll take 10%  of the charge. Since we shouldn't use it below 15%, it will give us some 3 hours of real use between charges. (hey, this is a smartphone! who gives a damn about talktime and standby?!)Touchscreen sensitivity is great, processing power is good enough, internal storage is too short (about 60 MB free) and will limit installation of apps that require to be stored on the phone instead of the microSD card.Many great apps on Android Market/GooglePlay. But Skype for android is a mess. As for many other more expensive models from various makers, Skype for android won't recognize the mic on this phone. Not on the handset mode, not on speakerphone, neither on the supplied wired headset - haven't tried bluetooth yet.Camera is very disappointing. Forget the 5 megapixel count. It sucks, big time! (never tried the front VGA camera)As for the Android OS, coming from Nokia's Symbian S60 5th Ed., a very pleasant move in all aspects, except for the loss of Skype.And, at least on this particular model, unacceptable 3-hour-in-use battery life. My Nokia 5230 would easily give me 10.", "Date": "March 12, 2012"}, {"Title": "WARNING: This Phone does NOT have a US based warranty.", "Author": "W. Griffith \"EveStev\"", "ReviewID": "RUGBL9GD2U5OY", "Overall": "1.0", "Content": "I purchased two of these phones, one for myself, and one for my wife.  We've had them for over 6 months, and overall, we have been pleased with the operation and performance of this Android based phone.Two weeks ago however, a thin grey line appeared across the screen of my wife's phone (probably some bad pixels), and I opened a case with Motorola support, and they said that this phone is not covered by US Warranty, and they gave me some number in Singapore, and asked me to deal with them.  They [Motorola] said it was because this phone has not been authorized for sale in the US.Be warned: this phone does NOT have a US warranty! Do NOT PURCHASE this phone, and in general, stay away from Motorola products altogether due to their deceptive warranty policy's.Update --> Below is an email response from Motorola support about my screen problem [see comment about: contact the country that supports your phone]:Reboot system for Fire XT 530.If still issue is not resolved, you have to contact the country that supports your phone.We hope that you find this information useful and we look forward to assisting you in the future.For information about Motorola products and services, please visit us at [...]", "Date": "September 12, 2012"}, {"Title": "Phone makes anonymous calls", "Author": "kenny p", "ReviewID": "R1B1RZMDSOR1ZE", "Overall": "2.0", "Content": "the phone dials phone numbers on its own - not calls that I have dialed or pressed from contacts list.", "Date": "February 3, 2014"}, {"Title": "You paid for what you get. Sometimes you get something a lil bit better.", "Author": "Mike Derz", "ReviewID": "R2U0EO4X6E3QCV", "Overall": "4.0", "Content": "I like this phone. I wanted a 900 Mhz 3G phone, because my operator has 3G on it. I found this at good price and I though \"Why not?\". I don't regreat it. It was a good phone until it pass through \"A Series of Unfortunate Events\". But first, let's start with the PROs, and CONTs.PROS:3.5 inch screen. And somewhat good resolution.Good size. I don't have anything agaist big phones, but I like to handle my phone with one hand.5 Mpx camera - And it have Flash!VGA front camera - Videocalls on Skype.It's Motorola - It's not some chiness white brand.CONTS:Not space for apps - only 100 Mb, if you update Google Play Store, they it goes.Bad quality in the photos - it's a 5 Mpx camera, but I've seen 3 Mpx doing it better.Middle:Screen quality it's questionable. It's not bad, but it could be better.Ok. That's all about the phone itseft. Now I will told you a story.About 3 months since I got the phone, it flush in the toilet. I though it was over. But, after I open it and let it dry for a while. It worked like a charm.Some point in bettewn the \"it's not enough space\" notification start to appeart. In this case, it was a bug in the contacts. Clean contacts info, and start over againg.2 months after, it crashes to the floor. Then I though \"Now it's over\". Guys, I was wrong. It have some flickering in the screen, but I open it, reconnect screen flex, and fix it.1 month after, I lean it to my stepfather for some days. And that's over. The phone die in misterius circunstances.---It was a good phone when I bought it. Now there is somehow better options. But, if this it's arround the 100$ zone, and you need a 900 Mhz 3G phone, you should totaly bought this.", "Date": "June 15, 2013"}, {"Title": "For my mom", "Author": "Guillermo Morantes", "ReviewID": "RPHGM2O1ROE52", "Overall": "4.0", "Content": "This was really a great phone, and my mom love it, the only thing is the charger is european, so we have to find another one, but after an update of a custom firmware the phone is really funtional for it's price and for basics.", "Date": "June 8, 2013"}, {"Title": "Thks is the worst smartphone ever", "Author": "Manuel S.", "ReviewID": "R1S8F6ZODF5UPM", "Overall": "1.0", "Content": "Slow, it gets blocked al the time. I couldnt install apps in external memory and I cant install al the apps that i want", "Date": "March 31, 2013"}, {"Title": "Motorola Fire XT", "Author": "Greivin A. Vega Ulate", "ReviewID": "R2R6QG6SVMYWP1", "Overall": "4.0", "Content": "I am very pleased with this phone.. Easy to use, fast and good looking. I would recommend this item to anyone.", "Date": "September 2, 2012"}, {"Title": "Moto XT 530", "Author": "Bogdan", "ReviewID": "R1RZ0PLCVUJ55L", "Overall": "3.0", "Content": "Good product but has something on battery contactsLeft in one position and the touchscreen doesn't work anymoreAt this price it's a good phone pitty that has the probleme with battery.", "Date": "March 6, 2012"}, {"Title": "excellent !!!", "Author": "IIrisssssssss", "ReviewID": "R32OVZRDE690IM", "Overall": "5.0", "Content": "excellent I loved it! very good very comfortable full! I highly recommend them! and if I get my original motorola team all components! many thanks for the service I can say it was excellent", "Date": "April 2, 2013"}], "ProductInfo": {"Price": "$150.00", "Features": null, "Name": "Motorola XT530 Fire XT Black Android 2.3.4 unlocked phone", "ImgURL": "http://ecx.images-amazon.com/images/I/51WLWgK4UdL._SX300_.jpg", "ProductID": "B006QO3XSA"}}