{"Reviews": [{"Title": "Nice cheap durable phone", "Author": "Alex Croy", "ReviewID": "R1QJZ43KRR21PG", "Overall": "5.0", "Content": "Pro-price-durable-good wifi-call quality-ease of use-stable OS-good batt life-easy camera/video access, decent pics/videocons-not the latest & greatest (and not $600!)That's about it. This is our first 'smartphone' and this is not a 'status' phone by any means. This puppy works. I got a $5 silicone case and $5 screen protector. Combined with water resistance, using this thing is worry-free. Phone easily goes all day using wireless, and several days using just voice. No issues with freezing or anything, appears to be rock-solid. Big enough to read the screen, small enough it fits in a pocket no problem (Try that Galaxy owners!) Very functional, basic device.If you need a phone that WORKS, for a decent price, and don't have to worry about it, rock this little guy.", "Date": "September 13, 2013"}, {"Title": "Good phone", "Author": "Janice S.", "ReviewID": "RS0PDO3UOO8GJ", "Overall": "4.0", "Content": "This phone was purchased for a Amazon Account holder's family member, that reports as follows:  Good phone.  Its screen is fairly compact, so it isn't an optimal for movies or games, and the keypad takes a little more attention, but for someone that is looking for mostly calling and text, and some internet use, its a very viable size-efficient option. Its reported durability should be a plus, but it's probably not a good idea to submerge it in water. It's working well with a Straight Talk Unlimited Plan ($45/month) SIM card installed, as well a 16 GB micro SD card.  The Straight Talk is actually working with the AT&T; system.  It has help reduce my cell phone bill by approximately 60+%.  Its not quite as intuitive as the iPhone-type devices, but its not overly difficult, you just need to spend a little time familiarizing yourself with the Android system.  The camera is decent, with some exposure options, and has a flash.  It also has a forward facing camera so video chat is also possible (something that doesn't appear overly common on a phone in this price range).  This phone however is intended for the foreign/Euro markets, so it comes with some Euro/French? related apps/software installed, that thus far I haven't been able to figure out how to uninstall/delete.  However, you simply don't use those functions...they're only real draw back is they take up some of the limited memory (you probably won't be able to load hundreds of apps on this phone).  Some of the spelling is also formal proper UK-English, not American English...not a major issue.  The there also wasn't a manual in the box, but it is easily downloaded from Motorola.  Also, its not as lightning quick as a super high end phone, but the pause is only a brief second or two, if that matters to you.So overall:Pros: Alot of feature for the $$, durable (so far), compact, works well with a Straight Talk Sim Card, and an expansion micro SD slot.Cons: A little less intuitive, comes with Euro software, few/no on-the-shelf accessories...cases/screen shields, etc. will need to be ordered.If you're looking for a good, affordable phone (not a video game or entertainment system), and want to get away from being locked into the expensive 2 year contract cycle, this phone might work for you.  It will probably pay for itself within a 2-3 months.", "Date": "December 23, 2012"}, {"Title": "I like it despite the flaws and limitations.", "Author": "Amazon Customer \"DrCrispy\"", "ReviewID": "R5SSFRGNWGOK5", "Overall": "3.0", "Content": "I bought two of these, one for myself, one for my wife, however, I'll post only one review for them both.Why I bought this phone:Although I am not a phone person, I decided to get a cell phone. My wife has had one for years. Her bill was more than $40/month for 400 minutes of voice, no data, no text, and none of the other stuff they constantly try to add on. Her \"free\" phone from the carrier was always problematic for contacts because they won't \"give\" you a smart phone with just a voice plan. The data plans can easily double your bill. Why? Because the cost of the phone is included in the monthly charges, and smart phones are more expensive. At the end of the two year contract, the carrier has to make a profit on the provided service AND make a profit on selling you a phone which is locked into their system. What I wanted was a smart phone which could synchronize my contacts and calendars with my wife's, but I didn't want the high price of a smart phone hidden in my phone bill for two years, a cost I would continue to pay if I kept the phone for more than two years. I want no more contracts, and no more hidden costs. Therefore the phone had to have the following capabilities:1. Unlocked Android smart phone (no contract required)2. GMS3. Wifi capable, Bluetooth capable4. Less than $200 ($250 max. For comparison, an IPhone may cost 2 or 3 times as much when bought without a contract.)Things I don't want because I already have a laptop and two android tablets:1. Facebook2. Twitter3. Movies4. Readers5. TextingThe Motorola Defy Mini XT320:Pros:1. The price was great. I would have paid this much \"down\" for a smart phone on a two year contract.2. The little phone was designed to be rugged. See YouTube videos of people dunking their XT320 in water. I don't recommend this, but it does suggest that Motorola was not all hype in advertising the phone as rugged for everyday use.3. I like the size. I have a large hand, but it fits fine. More important, it will slip into almost any pocket. I don't mind the small screen. I have tablets for entertainment, so I don't plan to watch movies or read books on my phone. Music is another matter, but that does not require a large screen. I have zero interest in sending or receiving text message or getting tweets.4. I added a 32 Gig chip to expand the memory to store music--no problem.Cons:1. The first big mistake Motorola made was internal memory. They included too little. Memory is cheap. They could have doubled the internal memory and not added more than a couple of dollars to the price, but I suspect the bean counters over-ruled the engineers. Still that would have been okay had they not made the second, even bigger, and stupider mistake:2. Second Mistake. Motorola jam-packed the XT320 with bloatware. I can only assume that money changed hands to include some of this junk. Of course people might differ on what Apps they want on their phone. For myself, I don't want the included Facebook, Twitter, Moto gadgets, and a variety of other USELESS Apps. Of all the bloatware Motorola pre-installed, I could only uninstall four junk apps from one company. The rest are locked into the Gingerbread OS, and only by rooting the device with a fresh operating system can you get rid of this junk. Rooting a device voids its warranty and is not for the faint of heart. Out of the box, you turn on the XT320 and you might get a low memory warning. If I could remove the bloatware, I would have given this phone five stars.2.5. In response to void your warranty from #2, it does not matter on this phone. Although the phone is new in the box, it has no manufacturer's warranty. Motorola's explanation is that the phone has a one-year warranty ONLY IN THE COUNTRY for which it was made. One of the phones I got was intended for use in the UK: No warranty. The other was intended for Australia: no warranty. Bottom line: evaluate the phone quickly on receipt, it has no warranty and your only hope is to return it through Amazon if doesn't work. On the up side, you can root your phone and not worry about voiding the warranty.3. May not be Motorola's fault. I installed a 32 Gig memory chip, surely that would be enough memory. Well, it would be if you could make better use of it. However, none of the pre-installed Apps on the phone can be moved to the SD card. In my experience with Android Apps on my tablets, very few Apps can be moved from internal memory to an installed SD card. I'm running Jelly Bean on both my tablets. I don't know if GingerBread is more restrictive about moving Apps. So the 32 Gig  microSD card stores my music quite well, but is useless in terms of storing Apps (again, unless the phone is rooted).I don't really want to root these devices, but I may have to if I can't get the Apps I want to work the way I want them to work within the memory constraints imposed by the apps I don't want. I've managed to set up my email, but I'm switching from Windows live for my contacts because installing Outlook takes too much space. For the same reason, I may have to switch to Google Calendar. Because we are in flux, the synchronization I had hoped for has not worked as well as I wished for contacts. Calendar is going a bit better, but I have yet to switch completely to Google. The good news, is that synchronizing these is not something that needs to be done more than once a day. That means I can wait for it to be done on WiFi at home without paying the phone carrier's digital fees. On a practical basis, my wife and I now each have a smart phone with access to our shared calendars and contacts and 500 shared voice minutes each month for a price at least $10 cheaper each month than her phone used to be alone, and we are not charged minutes for talking to each other.", "Date": "November 6, 2013"}, {"Title": "Outdated", "Author": "holbrook", "ReviewID": "R3I7SF7CKEMIBY", "Overall": "3.0", "Content": "I just got this phone, i'm very happy with my service provider, straight talk!  Their awesome! As for the phone, I love the size but it seems about 10-12 years old, though i'm sure it's not! Then again, I switched from 4G htc Vivid (love& miss that phone)! The camera is not good quality, the whole reason I wanted a phone!! & like other people are saying, the memory is miniscule, but can be fixed! And the battery dies while I sleep. I suggest charging over night! I would say this phone is worth about $25-$30. Other than that, it's good for a first phone and just a call phone!", "Date": "October 4, 2013"}, {"Title": "A Great Small Tough Android Phone", "Author": "C. Andrew Smelt \"Boxerig\"", "ReviewID": "R2A9FKIEIM1FCY", "Overall": "5.0", "Content": "This phone is Great  . It it tougher than most and is cheaper than any quality phone that offers  all the standard Android features including GPS ,seperate cameras and dedicated camera button and all  good sensors .", "Date": "July 20, 2013"}, {"Title": "Disappointing", "Author": "nitram", "ReviewID": "R28BQ11R2D2D6K", "Overall": "1.0", "Content": "The Defy Mini is a very disappointing phone. The internal memory is very small (it reports only 165 mb), and it is almost completely filled with applications that I will never use, such as Facebook and Twitter. In theory there is a way to move these to the SD card (I've inserted a 32G card), but in practice when I try to do this the phone reboots. In theory there is a way of installing new apps to the SD card instead of the internal memory, using App2SD, but in practice they install instead to the internal memory (or not at all when this gets full), and trying to move them doesn't work. It seems that the only way I can remove these unwanted apps and free up memory is by rooting the phone, but this appears to be a complex process that will requiring also flashing it. Motorola offers a way to root some of its phones, but not this model. So I'm stuck using three or four apps, even though I have tons of memory.In addition, the camera is astonishingly bad - much worse than the reviews I had read suggested. There is a long delay after one presses the button before the photo is taken, and this is accompanied by a very loud 'snap!' noise that cannot be turned off. The resolution is poor, and when one uses the flash in low light the flash itself washes out the image! Very odd. In addition, there seems to be no way to flip from one photo to the next. I have to transfer the pictures to a computer to view them.The only pluses are that the phone is pretty robust and the battery lasts a long time.", "Date": "November 2, 2013"}, {"Title": "it's okay", "Author": "ernesto", "ReviewID": "R7T4VTRA19IU", "Overall": "4.0", "Content": "my girlfriend love it... and come in black the only thing bad is the camera doesn't have autofocus... but its a good phone for the price", "Date": "October 26, 2013"}, {"Title": "Excellent Android!", "Author": "Miguel Zamora", "ReviewID": "R3190J99S6O43F", "Overall": "4.0", "Content": "Great Android maybe just missing the root for access more internal memory, great performance, features and hardware, seep, video and data.", "Date": "October 20, 2013"}, {"Title": "excellent", "Author": "Emmanuel", "ReviewID": "R3PHK1U3TKZTUR", "Overall": "5.0", "Content": "great phone, good handling and package.android os 2.3, whatsapp, root, skype, everithing youll need.youtube.great wifi reception!unlocked for all brands in america.thanks!", "Date": "September 11, 2013"}, {"Title": "Absolutely worthless in the states", "Author": "Rachel", "ReviewID": "R1QERKUVX66OI4", "Overall": "1.0", "Content": "It won't work, at all. I was excited about its abilities, and as an outdoors (wo)man, I was enamored with the rugged dependability. It was a waste of funds better spent elsewhere.In a pinch, I can use it to send and receive calls and (some) texts, but the data fails to deliver on its promise of dependability, particularly with its rugged design.", "Date": "January 30, 2014"}, {"Title": "good phone for price. make sure you have sim card, and don't need silent camera", "Author": "Victoria", "ReviewID": "R1VBLR5D3K06FN", "Overall": "4.0", "Content": "Good phone for price. HATE the camera shutter sound cannot be turned off! Otherwise phone works good. Wasn't aware it used a sim card though, so I had to purchase one of those also.", "Date": "January 21, 2014"}, {"Title": "Can't get it to do what I expected", "Author": "Molyneux", "ReviewID": "R1D0IMVK21NR73", "Overall": "1.0", "Content": "I bought this phone as an upgrade to my Motorola Razr flip.  Well, I got the phone part to work fine with moving my sim card.  I got the wi-fi to work on my home, secured network.  But that was about it.  Where to begin - OK, I'm in the States.  Everything is celsius and metric.  I can't find a way to change to English/US.  Also, the temperature, (in celsius) on the main screen, has never changed.  It does not show current temperature.  Then, downloading apps. After a couple of downloads, like Netflix and IHeart, it said I was out of space.  It came with a 2 gig mini sd card.  I thought that all the bloatware was talking up the space so I got a 32 gig sd card.  Still the same problem.  It won't let me add apps that I want.  Then there is logging on to other wi-fi's.  I tried to log on to a restaurant, unsecured, wi-fi.  It did not connect automatically.  I had to go to settings and approve and indicate \"connect\" to that wi-fi.  After that, I still could not access e-mail, etc, even though it said I was connected.  I have a Samsung android tablet that I've mastered.  I bought this phone because it also has android operating system.  Thought it would be a piece of cake to set up and use.  So far, not so.  The book that came with the phone covers basics but is not a lot of help.  Also, this phone is clearly intended for European use.  The listed phone numbers to call for assistance are in the UK and other European countries.. I may be returning this phone since I can't get it to do what I expected.A week later: Well, I tried it for a week.  I talked to the seller today and we agreed that it should be returned.  \"Bobby\" at the seller was as helpful as he could be, but we couldn't resolve the problems.  He sent me a return form and it's now on its was back.  Main problem, I'm sure, was that it was intended for use in Europe.  Also, couldn't download new apps.", "Date": "January 9, 2014"}, {"Title": "Nice phone", "Author": "Olga", "ReviewID": "R1TJESBE2V3DCC", "Overall": "4.0", "Content": "I bought this phone because I wanted an Android phone with a resistant sreen and this phone has Gorilla glass that is so resistant and antiscratch, it also has a front and back camera, and works well in my country El Salvador, the Wifi is great and I can watch You Tube videos with no interference or delay. The only thing is that it has a lot of Apps Factory preloaded and I don't use much of them and affects the memory and the internal storage space. I read that it is possible to root the phone so those Apps can be deleted but I haven't try that. Thank you.", "Date": "January 7, 2014"}, {"Title": "Motorola Defy mini", "Author": "Cameron Steele", "ReviewID": "R14ZS8TE0PC5AC", "Overall": "4.0", "Content": "This is my first smartphone and i do like it a lot. I would say it's pretty good for those who are looking for a good quality entry level smartphone that even has some nice durability features for a affordable price. It does pretty much does everything pretty well that you would want from a smart phone. It picks up WiFi and Call reception good, and the call quality i would say from experience is definitely good. My only two complaints are that the camera quality is just OK not great but average, so if you like to take a lot pictures with your phone, i would caution you this phones camera might be a little disappointing to some people but all in all it's not a terrible camera. Secondly the phones internal memory storage for storing apps does not have a lot of space for downloading new apps. But to it's credit the phone does have an expandable memory that you can do by buying a phone memory chip and insert it to the back of the phone where the memory chip slot is. Although from my experience it doesn't seem to help very much so if you don't plan download a lot of apps on your phone like myself then it's not really much of a problem unless you like tons of apps on your phone.", "Date": "December 26, 2013"}, {"Title": "Great smaller form factor", "Author": "Mitch", "ReviewID": "R1QQC9BWYGE79T", "Overall": "4.0", "Content": "Great phone but does not work well in my rural area. Used with a Consumer Cellular SIM with no problems.", "Date": "December 15, 2013"}, {"Title": "Really easy to use,quite fast and small, sounds nice, good pictures AT DAY flash not so good,In Venezuela works fine wt Movilnet", "Author": "Freiman", "ReviewID": "R8PKO6JA6OFVL", "Overall": "4.0", "Content": "Really easy to use.Really easy to use,quite fast and small, sounds nice, good pictures AT DAY flash not so good,In Venezuela works fine wt Movilnet", "Date": "December 8, 2013"}, {"Title": "love it", "Author": "Rosalba Castro", "ReviewID": "REBQ5IETSWJ88", "Overall": "5.0", "Content": "Motorola Defy Mini XT320 Unlocked GSM Phone with Android 2.3 OS, Touchscreen, Wi-Fi, GPS and Bluetooth - Black (Wireless Phone Accessory) its a good phone.", "Date": "December 6, 2013"}, {"Title": "Junk", "Author": "Confederate.La", "ReviewID": "R1YOZT346S5USG", "Overall": "2.0", "Content": "I have always been a fan of Motorola razr and was expecting this product to live up to the name, it worked about twice, now there is so much reverb when you talk on it you can not hear the person on the other end, I work overseas so I had to have it shipped to my home in the states were I picked it up because they would not ship it to an APO, well the APO wont ship it back so I am stuck with phone that does not work.", "Date": "November 21, 2013"}, {"Title": "Tough little semi-smartphone. I like it.", "Author": "The Law", "ReviewID": "R2FKD5RXPL845U", "Overall": "4.0", "Content": "Love the phones durability and pocket size. Worked with my carrier Metro PCS and seems like a stable operating system. I'm a contractor and eat phones but this one seems like it will last.", "Date": "November 7, 2013"}, {"Title": "Not as good as I expected", "Author": "joe", "ReviewID": "RYLMOHCRHSYL0", "Overall": "2.0", "Content": "Purchased 2 Motorola Defy Minis because I wanted a smartphone that was small but performed basic task (calls, texts, and some web) with ease.  They worked great out of the box, but then they started acting weird within the first week.  Display stayed on running the battery down within hours (and it was set to turn off after 30 secs), apps were starting without even touching the screen, and when I would make calls it would take forever to connect.  I have Straight Talk and these phones are 100% compatible so I know its not the service provider for my other unlocked phone worked fine.  I will be returning these and getting something that will work the way a phone should.  But thank you to amazon.com for the excellent customer service and return policy!!", "Date": "November 1, 2013"}, {"Title": "The phone never worked", "Author": "Gabriela", "ReviewID": "R11ET5E8146ETU", "Overall": "1.0", "Content": "When I try to configure, the phone turn off and I can't charge because said the battery is not compatible....I dont unsderstand why the battery is not compatible", "Date": "October 29, 2013"}, {"Title": "good starter phone", "Author": "s kestler", "ReviewID": "R2VEQKWQ3J68ON", "Overall": "3.0", "Content": "well i bought one for my 11 year old son  and he loved it but it was so tiny for me or my wife but just perfect for my son. It also is water proof so if they drop it in water or want to go to the pool it fine and my son takes it in the pool sometimes.Great for children and can pick any service provider you want and can change providers when every you want.", "Date": "October 27, 2013"}, {"Title": "I don't like this phone", "Author": "Devilkimahari", "ReviewID": "R2A20KYO47NDCP", "Overall": "1.0", "Content": "This phone has problems, I just receive it and prompt me an error \"invalid battery\", I thought it was the battery but it turn out to be a board problem, so the cellphone didn't work for anything, I just throw out, because I am in other country and I was unable to give it back. I don't recommend it", "Date": "September 30, 2013"}, {"Title": "good value, simple set up. love it.", "Author": "norman jones", "ReviewID": "R34GEW92664UUJ", "Overall": "5.0", "Content": "Perfect, simple, smart phone for any age. As described, arrived 2 days early, not too big fits right in jeans pocket", "Date": "August 29, 2013"}, {"Title": "excelent", "Author": "jossbell g.", "ReviewID": "R2Z282SIXX3ZYG", "Overall": "5.0", "Content": "this phone its a extension of my body, i feel nude without this, but have a detail very low memory ram", "Date": "July 4, 2013"}, {"Title": "From a THREE time owner - beware!", "Author": "Doug \"online buyer\"", "ReviewID": "RI4HSSGJT1VM5", "Overall": "1.0", "Content": "I am uniquely qualified to review this product, as I have3 owned THREE of them.  The first one was purchased based on the claim that the phone is \"rugged\".  It fell from my lap onto the floor 24 inches below, shattering the screen.  It wasn't thrown, it wasn't stepped on- it fell.  I purchased a new one, along with an otterbox case.  This one lasted 24 hours before the micro USP port simply lost connection.  It broke off internally, or was possibly never connected to begin with.  I returned it, recieved a new one, and this third one lasted all of 3 months before one day it simply froze and the screen turned blue.  That was it.  No rough use at all, no pushing this feeble device to it's limits by excessive internet use, overloading the memory, no overcharging, no downloading of potentially harmful files.  I had taken gentle care of it in light of my experience from my first phone of this model.  I hadn't expected much based on the price, just the ability to play music and check the news and weather, and the claim that it was rugged.  I've owned a good number of phones, and take responsiblity if I've broken them myself, as has been the case- but this phone is just plain garbage.  Expect 2-3 months of use, if you are careful.  When it does break, you can have it repaired by paying $100USD for a new mother board (yes, seriously!), or send it to Motorola, which will take longer than the time you had with the phone before it killed itself.  Motorola themselves warn you that it will be a two-to-three month turnaround if you decide that this phone was so great that you want it fixed.  But you won't.  Simply put- not worth the hassle.", "Date": "May 6, 2013"}, {"Title": "Good phone and Good Customer service from Amazon", "Author": "Spencer", "ReviewID": "R27JSW6DGQ9TDI", "Overall": "5.0", "Content": "I recently bought this phone and for what it is, it is a great little phone. The screen is a bit laggy and not much of memory to mess around with but for what it is, it performs very well. I had an HTC Freestyle, same size and it was complete garbage when compared to this. The phone has a 600mHz core with about 250mb (it has a bit more but i know it is in the 200 range). Should you get this phone? Depends. If you are a person who does not care about how fast the internet is, or not much of a texter then you should buy it, you will be happy. But if you text often and are always on the internet, then you need to look elsewhere. However, I returned it because the phone did not come from the U.S. it came from the U.K. which isn't a big deal. Another reason why I returned it was because I downgraded from a Motorola ATRIX and that was insanely fast compared to this. But if you do not want to sped too much on a phone and are looking for a replacement then this phone handles the job fairly well. It may not be much but for $118 the phone is great. I don't know what people say about the phone being cheap, it hasn't broken on me.", "Date": "April 13, 2013"}, {"Title": "Phone is awesome", "Author": "Emelda Cambridge", "ReviewID": "RYEIVT8UGBYEM", "Overall": "4.0", "Content": "This purchase was fine and I would recommend it to anyone who wishes to purchase a phone. I like it", "Date": "April 9, 2013"}, {"Title": "I am on my third one! No not really it is number4", "Author": "uds", "ReviewID": "R3E00WKGDMMYCY", "Overall": "2.0", "Content": "Soo, I had number one send to my son in college since his old one hat water damage .he liked it.When my samsung gave up I ordered the defy mini from joy cell through Amazon.Number two, it would not read the SIM card plus it was not new. It had still contacts from Great Britain in it. Send it back get a refund get a new one.Number three came. Yippee it reads the sim! But I cannot connect to the internet via the AT&T; network. I try to set the APN setting in the network setting, no go. Get an error message, \" the process com.android.phone has stopped unexpectedly. Please try again,and again and again,get the theme here. The only option I have is a \"force shutdown\".  Than I have to restart the phone. Send it back, get a refund order another one. Must be a fluke lets order another one from another supplier. This time it's Breed.Number 4 arrives. Unpack, ok this is not the British version like the others, seems new, it reads the SIM, great, and a no go on the network access. Same try again issues with the APN settings. Breed included a 800 number for customer service, unfortunately it is not tech support but I got offered a replacement. Nope, let's call the offspring at college and see how he set his just to find out that his is doing the same thing but he does not care since there is wifi all over the campus. We'll I will keep mine too. Personally I do not really use the internet or any other online features, or let's say I can do without them.downloaded an offline nav app that works fine, going to cancel my data plan, saves me $20 a month plus I already purchased an Otter case I cannot send back. For someone who wants to use the features it's a drag.\"........................UPDATE\".....\"................. Had the phone for 9 days when it failed to boot. I switched it on in the morning  and the only thing it did was the animated red motorola dot. Took the battery out hoping it would reset from what ever was not working right. We'll it did not ,so number4 went back as well. No more motorola for me. I really liked the size and gorilla glass but\".......... I thought my phones not working right was a fluke, but I guess my sons phone working ok is the fluke here.", "Date": "November 1, 2013"}, {"Title": "is just great!", "Author": "Tiffany", "ReviewID": "R3R1D739CHB366", "Overall": "4.0", "Content": "This is a really nice Gingerbread based phone, it is a pretty straight forward Android phone. The processor is more then fast enough. It has corning gorilla glass and it is dust and water resistant. Battery life it's also good too....what more can I say? the phone it's great, i like it!", "Date": "June 15, 2013"}, {"Title": "NOT \"tough\"", "Author": "Doug \"online buyer\"", "ReviewID": "R1MV32F9U701N5", "Overall": "2.0", "Content": "I bought this phone as a cheap alternative to some of the more expensive models available, based on previous reviews and the fact that it is described as \"rugged\", and ideal for people who are \"tough on their phones\".  Exactly what I needed for travel, so I can switch sim cards and whatnot.  Well, the FIRST one I bought fell from my lap to the floor 3 feet below and the screen shattered.  I guess that was a little too rough.  I liked the function and price of the phone, so, like an idiot, I bought a SECOND one.  After three days of use, mostly sitting in my pocket, the micro USB port simply came undone.  No rough use, no accidental drop, no smashing the charger into the phone.  It simply came loose.  So combined, I have one functioning phone.", "Date": "February 27, 2013"}, {"Title": "good", "Author": "Carrie", "ReviewID": "RE72OPJ4QRGA0", "Overall": "4.0", "Content": "Very smooth. For smart phone, the price is good. The most important thing is it is unlocked. I would recommend it to my friends.", "Date": "November 13, 2013"}, {"Title": "I hate this phone", "Author": "Ivan barragan", "ReviewID": "R31ZTJ1HM70Q4U", "Overall": "1.0", "Content": "The phone looks nice but I hate it because it runs out of memory very quickly even with the SD card it doesn't help and the apps waste allot of memory on the phone and the power button feels loose. when it runs out of memory you cannot receive text messages.", "Date": "September 21, 2013"}, {"Title": "Great little phone for the money.", "Author": "William Clark Schmidt", "ReviewID": "R1TMFU50TH0P16", "Overall": "5.0", "Content": "I just received this little phone and I must say I am impressed. I read several reviews where there were complaints regarding difficulty in use. It is a pretty straight forward Android phone. The processor is more then fast enough (faster then my Razr pushing Jellybean). Sadly I found out that the data frequency I needed isn't built into this model, however it is a true quad-band GSM phone. Mine did come with a European power adapter, but it is still USB so I just plugged it into my laptop and it charged right up. The only negative I can find is that if you have a case of fat fingers the keyboard (virtual) will drive you nuts. It also came with a English / Hindi keyboard but that is just a couple clicks to English only. All in all, it is a great phone for the price.", "Date": "April 25, 2013"}, {"Title": "The best small Android cell phone", "Author": "Alejandro", "ReviewID": "R1CWEKSPBAFT2G", "Overall": "5.0", "Content": "I bought 2 cell phones, the first one works perfect in my country, but the second was locked, amazon refund the money without problems. this is a perfect cell phone if you want prefer functionality over luxury", "Date": "December 29, 2012"}, {"Title": "Great price!", "Author": "Ernesto Lopez", "ReviewID": "RDIA2YN6FFWS7", "Overall": "5.0", "Content": "This is a really nice Gingerbread based phone, despite having a 600MHz cpu it is actually very responsive. It has corning gorilla glass and it is dust and water resistant. Battery life it's also good too. All in all, it's a  very nice phone at a great price.", "Date": "November 22, 2012"}, {"Title": "wrong phone got stuck with it.", "Author": "miss sweetie", "ReviewID": "RZPFWNTC7L7X7", "Overall": "1.0", "Content": "they sent me a different phone from what I saw online plus the phone was not unlocked and it was hard for me to get it unlocked. It was not the Motorola Defy it was something totally different and I didn't know how to return it so I got stuck with a phone I did not order and the phone was a republic wireless it was very different.", "Date": "December 7, 2013"}, {"Title": "Nice", "Author": "Sergio", "ReviewID": "R2XW8012MSEFCB", "Overall": "5.0", "Content": "Thanks, it's really nice cell phone and it works really fine even in my country. I recommend for everyone to buy it.", "Date": "November 22, 2012"}, {"Title": "Motorola Defy Mini XT320", "Author": "Papagigo", "ReviewID": "RG5STSKE4APIK", "Overall": "2.0", "Content": "probably a good phone, I could not get it, to find the network  and  returned it I would not discount this brand of phone", "Date": "August 15, 2013"}, {"Title": "Great phone", "Author": "Chuck Walton", "ReviewID": "RILSHJ2IBA8QJ", "Overall": "4.0", "Content": "This came on time and is a great deal for an  Android. Can't beat it . It is loaded with features.", "Date": "November 20, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006Z37ZOU"}}