{"Reviews": [{"Title": "Don't expect the same quality as other Samsung rugged phones", "Author": "D. Henry", "ReviewID": "R28JINQ4HMGZWP", "Overall": "2.0", "Content": "I am an owner of the grandfather model of this phone: Samsung B2100 Unlocked Quad-Band Phone, Extreme Anti-Shock, Waterproof, Built-in Flashlight, Bluetooth-International Version-BlackI expected to see the same quality build that I did in the B2100. Unfortunately, this phone has not met my expectations. The rubberized case has been replaced with regular molded plastic, which is quick to show any distress marks from dropping it or being in the same pocket as keys or a pocket knife. The bright round LED flashlight/torch has been replaced by an inferior lamp that shines considerably less bright - in the B2100 it was an asset, it is now a novelty in the C3350.By far the least impressive change would be the locking mechanism on the back. It is loose and will not stay locked. This has resulted in me dropping the phone just 2 or 3 feet down onto the wet ground and having the cover pop off, leaving the battery and inside of the phone completely exposed to the rain and wet ground.Some improvements to this model that are worth noting:+ The micro USB connection makes it easier to find a place to charge the phone, transfer photos and music+ The FM radio works without the need of the headphones+ The camera takes good photos, though the video mode is still a less than impressive 176 x 144 resolution+ Using the USB connection or Bluetooth, you can transfer contacts and other information via the Samsung Kies software. Despite what their website says, you are unable to update the phone's firmware via the software+ Great battery life, like its grandfather+ Can use a 32GB microSD card (I believe the B2100 was capped at 8 or 16GB)The disadvantages, summarized:- The locking mechanism on the battery cover does not work properly- The flashlight/torch is pathetic in comparison to older models- Unable to update the firmware. Samsung website says to download and use their Kies software. Kies software says to use the Samsung website- Rubberized case replaced with easily scratched plastic", "Date": "October 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006R11PGE"}}