{"Reviews": [{"Title": "IPhone 4", "Author": "purplefuzzballz", "ReviewID": "R1YCPGJW34REW6", "Overall": "5.0", "Content": "thanks for sending this iphone 4 loved the clean esn, and the activation went perfectly. It is what you described. It came a day early. Best seller! Thanks a bunch.", "Date": "March 1, 2012"}, {"Title": "Good", "Author": "JennRussell", "ReviewID": "R3B1U34G8Q7FPU", "Overall": "4.0", "Content": "I received my phone around the time it said it would get here, it came in the box with the headphones, charger, etc. However when I went to activate it, I noticed it was already activated with a different phone number previously, which was not labeled in the description. All in all, I am very happy with the purchase I made, I love my phone!", "Date": "August 30, 2012"}, {"Title": "?", "Author": "Ivy", "ReviewID": "R2PLABTODOHZIN", "Overall": "5.0", "Content": "I'm confused as to the title of the product and the description. It says that the phone's white, and the pictures are of the white iPhone but the description says black iPhone? What is the color of the phone, exactly?", "Date": "January 6, 2013"}, {"Title": "I returned the this phone within 30 days but never received my money back since.", "Author": "Utica, NY", "ReviewID": "RTBXDX6M5F7Q", "Overall": "2.0", "Content": "I returned the this phone within 30 days but never received my money back since. I ordered this phone in June 13, 2013. I contacted them a few months ago for the reimbursement but they said they never received the phone and were asking me the tracking number. I have post office receipt months ago and put it in a huge big boxes and can't find the receipt. Please reimburse my money because i sent this iphone back within a month i received the phone.", "Date": "January 4, 2014"}, {"Title": "iphone4", "Author": "stefan", "ReviewID": "RR23ROWBPV0LD", "Overall": "5.0", "Content": "I got this phone for my girlfriend. She absolutely loves it. The phone was in excellent condition and works perfectly.  Thanks!!!!!", "Date": "September 12, 2012"}, {"Title": "I wonder if the phone is unlocked", "Author": "Luis", "ReviewID": "R1Q10BEBCE90CJ", "Overall": "4.0", "Content": "I wonder if the phone is unlocked and is GSM warranty? I'm interested in, from Venezuela ... I hope your answer thanks", "Date": "November 26, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "For Use Only On Verizon Wireles Network\n8gb onboard storage\n5 MP Camera\nTouch Screen\nLots of Apps in Apple Store", "Name": "Apple iPhone 4 MD200LL/A 8GB White For Verizon (No Contract) Sealed", "ImgURL": "http://ecx.images-amazon.com/images/I/31RJzfleCpL._SX300_.jpg", "ProductID": "B0064W2XCG"}}