{"Reviews": [{"Title": "Item was misrepresented", "Author": "dp", "ReviewID": "RN1E2TTUJK0XU", "Overall": "1.0", "Content": "The seller claimed this item was brand new in it's original packaging, when it was actually refurbished, the power button don't work properly, the digitizer is coming loose at the usb port, it has \"revolutionary s-off\" bootloader which it shouldn't if it came from htc. The seller should have advertized it as \"Refurbished\"", "Date": "July 10, 2013"}, {"Title": "One of the best phones out there!", "Author": "Mary", "ReviewID": "R3L475N1CPM2RV", "Overall": "5.0", "Content": "First off shipping was fast. Secondly the beats audio is a huge plus to this phone the beats speaker built in the phone is average but the urbeats headphones are absolutely stunning! The phone is super fast (thanks to the full 1.5 ghz processor) and is durable. It comes with the phone, urbeats headphones, urbeats monster case, urbeats eartips for different sized ears, the micro usb cord to usb, the usb to wall adapter(chinese/british outlet), chinese/british adapter to standard american wall outlet, and some documents. Also setup was easy and i have had no problems using with my carrier (becauseits unlocked)Pros:Beats audioScreen sizeHTC Touch similiar to swipe technologyEase of accessWill support android gingerboard8.0 mp camera with dual led flash and front facing cameraCons:Battery life (i suggest maybe a portable charger or extra battery as it is easy to burn through the battery)The usb cable cannot be plugged into a standard usb to wall adapter because the voltage is different you must use the adapter given with the product if you have an american standard outletAny questions...you can contact me at MMoore2@ccsdstudent.org (its a form of gmail)HTC Z715e Sensation XE White Unlocked", "Date": "May 25, 2012"}, {"Title": "Awesome phone!", "Author": "prhec76", "ReviewID": "R2LLYJA9JGLAQH", "Overall": "5.0", "Content": "Better battery than my old LG phone. Easy to use interface and a good handle on the battery life. To top it all off, it has beats audio on your music and video recordings.", "Date": "April 9, 2013"}, {"Title": "Luvin my beats", "Author": "Crathina Green", "ReviewID": "RHYWPYMR4T4DO", "Overall": "5.0", "Content": "Luvin this phone, its nothing for fast internet but with wifi and any earphones Im happy with my new phone", "Date": "September 6, 2013"}, {"Title": "Comes with standard HTC headset", "Author": "Mosh", "ReviewID": "R1BACCM2FOQC6S", "Overall": "3.0", "Content": "While the phone is great and everything, it comes without the beats headset!It is quite disappointing, since the audio quality is a major part of this phone.Given that fact, other places offer the same phone with the beats headset for the same price, so this specific phone should be cheaper.Pros:Great phone, HTC Sense interfaceUpgradable to ICS, and there are rumours regarding JBVery quick supplyCons:No beats headset1GB of storage, means you'll probably have to buy an external MicroSD cardPrice", "Date": "December 6, 2012"}, {"Title": "Superb !", "Author": "Shayan Ali Bhatti", "ReviewID": "R2Y54EMSTGD27P", "Overall": "5.0", "Content": "This cell phone deserves 5 stars, it has superb beats audio. The seller service is also great . It is a must for all, who love to enjoy music on cell phone.", "Date": "November 17, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Z715e Factory Unlocked model", "Name": "HTC Z715e Sensation XE White Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/51mL4YKnBEL._SY300_.jpg", "ProductID": "B006XN9Z9K"}}