{"Reviews": [{"Title": "This is phone exceeded my expectations", "Author": "Grace", "ReviewID": "R1F1OYI0OENBIR", "Overall": "5.0", "Content": "I love this phone!! It reminds me of the HTC Hero. This was a wonderful investment. My only complaint is the memory and how small it is. It slips from my hand so easily.", "Date": "November 4, 2013"}, {"Title": "fast", "Author": "tekco", "ReviewID": "R1QZJSWIELGDG8", "Overall": "5.0", "Content": "very fast in the cell phone was exactly what I thought it would be works great brand new in the box thank you very much..", "Date": "March 30, 2014"}, {"Title": "Would recommend.", "Author": "K.J. Bryniarski", "ReviewID": "R3MNC6IFR9USNK", "Overall": "4.0", "Content": "Works well enough to meet my needs. Would recommend to anyone who wants a reasonably priced smart phone. Battery seems to hold a charge for length of time indicated.", "Date": "May 20, 2014"}, {"Title": "plus", "Author": "Rocs", "ReviewID": "RG6GE3XDT95KI", "Overall": "4.0", "Content": "Good phone works well good price came quick easy to use great gift could noy ask for better deal. Plus", "Date": "March 18, 2014"}, {"Title": "Good for a child", "Author": "keuna turman", "ReviewID": "R2IQ937UKH5EQ9", "Overall": "3.0", "Content": "It was fine for a little child but for an adult the phone was to small, otherwise the phone was great. The only reason I returned it was because of the size.", "Date": "March 13, 2014"}, {"Title": "Not expected", "Author": "Giselda salinas", "ReviewID": "RCTNLWN99RIE", "Overall": "1.0", "Content": "Too small the size of your palm , it's kind of slow sometimes if I could I would buy a much better phone", "Date": "February 20, 2014"}, {"Title": "sucksss", "Author": "tylar andrews", "ReviewID": "R3NNAEYTLNALDJ", "Overall": "3.0", "Content": "great phone at the start. after about three months its trash!!! me and my mom both have the same phone but she uses hers maybe twice a day and to call doctors. me on the other hand use it all the time and we still have the same issuses! it freezes all the time. no space at all. sometimes it just decideds not to ring! I hate it.", "Date": "February 16, 2014"}, {"Title": "T-Mobile HTC Wildfire S Mobile Phone", "Author": "SFP", "ReviewID": "R305KXR5QIYFLG", "Overall": "3.0", "Content": "I bought this phone for my grandson for Christmas.  I am a bit dissatisfied to know that the battery life of the phone is very poor!", "Date": "January 18, 2014"}, {"Title": "great phone", "Author": "Deb S", "ReviewID": "R5YZ3Q5FMDQJ", "Overall": "4.0", "Content": "Great phone. Got here faster than we expected. It was for son. He dropped. It on his shoe and ended up with a crack on the screen.", "Date": "December 19, 2013"}, {"Title": "unacceptable", "Author": "krikit v mcnair", "ReviewID": "RVIG8ZAOBAMQ0", "Overall": "1.0", "Content": "Sent this phone screen blacks out as well  no sd card will read in phone battery overheats got it as apresent for someone not impressed", "Date": "December 2, 2013"}, {"Title": "To small!!!", "Author": null, "ReviewID": "R1TCSK2NCEMA9C", "Overall": "3.0", "Content": null, "Date": "November 5, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "\"Replacement Device\" \"No Contract Changes\"\n3G Capable: Quickly connect to the Internet via 3G anywhere within the T-Mobile USA 3G network\n5 Megapixel Camera: With quality worth printing, now you can really enjoy those special moments captured on your device. You can also share them with family and friends by sending them to any e-mail address, T-Mobile camera phone, or MyAlbum\nMessaging [Text, Picture & Social Networking]: Send a message or a photo to any wireless phone or e-mail address. Or stay connected using always-on social networking\n3.5mm Audio Jack: 3.5mm audio jack gives you the flexibility to listen to your downloaded tunes just about anywhere-all you need is a standard set of ear buds or headphones", "Name": "T-Mobile HTC Wildfire S Mobile Phone, 5.0 MP Camera, Bluetooth, White", "ImgURL": "http://ecx.images-amazon.com/images/I/419PQcHn5SL._SY300_.jpg", "ProductID": "B006C29OZC"}}