{"Reviews": [{"Title": "A smart phone for dumb people!", "Author": "Teresa Hamilton \"thamilt\"", "ReviewID": "R2ZUOPE3LTGPXV", "Overall": "5.0", "Content": "I am 65 years old and I have always had a flip phone. My grandchildren 11 & 13 all have those smart phones. The other day I had some trouble with my flip phone and there are very few new ones you can buy so I went to my carrier and what prices on these phones with contracts to boot. I was going through Amazon and I see this phone. There is a video on line for this phone so I watched it. If you can read a picture you can do this phone. When I received it I put the sim card in and set it up myself. I practiced a little with it and now I am getting really good. I even hooked up my blue tooth for the road and figured out the speaker. I am so impressed with myself. The instruction book even has pictures (Yea)! I think the visual is pretty good because I don't have to put on my glasses. However I have fat fingers and the alpha part is tiny, but I don't really text. A stylus would help.  I would recommend it to anyone who is afraid of the smart phones. All the accessories can be purchased online for under $5.00 each. I feel this was a really good value and I didn't have to commit to a new contract.", "Date": "February 26, 2013"}, {"Title": "Simple but Efficient", "Author": "Michelle", "ReviewID": "R2WJ1UVW01JSQ", "Overall": "5.0", "Content": "It is an uncomplicated cell phone that will fit in a pocket very nicely.  I love the simplicity and it meets my daily cell phone requirments.", "Date": "December 24, 2012"}, {"Title": "Dont really like it", "Author": "Dashianera Thomas", "ReviewID": "RMDIITESQN8LW", "Overall": "2.0", "Content": "It glitches and freezes up a lot. And when I try to make a call it just goes off. Everything is too small on the screen", "Date": "September 20, 2013"}, {"Title": "Good Phone", "Author": "ZEPPELINLOVER", "ReviewID": "R2LKFZQ75KUFB4", "Overall": "4.0", "Content": "I like the phone and all the features available on it i guess my only complaint is that e-mails are hard to read because the writing is small but having said that i am an old fart thatb uses reading glasses.", "Date": "August 26, 2013"}, {"Title": "Bought for my 12 year old.", "Author": "Momma.x.4", "ReviewID": "R2S0ILSA8ROS3B", "Overall": "3.0", "Content": "I bought this phone for my 12 year old and while it does work, she complains of it freezing at times. Mostly while using apps.  There also isn't a lot of memory on the phone so having a SD card is a must (it comes with one, but if it gets to full, you need to buy a new one or delete things off the old one for the phone to work good).Overall this is a good choice for someone that doesn't use a lot of apps.", "Date": "April 13, 2013"}, {"Title": "Great Buy", "Author": "Laura Smith", "ReviewID": "R1JN00I12423M", "Overall": "5.0", "Content": "Awesome phones. Beats what I paid for mine at the store.My girls loved them.  They arrived on time and in their original sealed packages.It came with little extras we weren't expecting. Definately reccommend this product and company.", "Date": "March 5, 2013"}, {"Title": "Samsung Dart for T-Mobile Cell Phone", "Author": "dLo", "ReviewID": "R2SI9TZR8OQJIC", "Overall": "5.0", "Content": "I received this phone rather quickly and it's condition was like new. I ordered it as a refurbished phone until I get the phone I really want. I recommend this to anyone!!", "Date": "October 2, 2013"}, {"Title": "that's Perfect for me", "Author": "mr-perucho", "ReviewID": "RSSOFNTQSMGKQ", "Overall": "5.0", "Content": "this phone is good for me, affordable good for the price.I love it, I plan to buy one more for my son, thank you very much.", "Date": "May 14, 2013"}, {"Title": "Terrible Product", "Author": "nana yaw", "ReviewID": "R1HOML00ELKGQL", "Overall": "1.0", "Content": "this phone has more problems after 30 days. All the apps will freeze and constantly has to remove battery to reset.", "Date": "May 12, 2013"}, {"Title": "Very Happy with the phone.", "Author": "Holly Aue", "ReviewID": "R1154Q3VL8EUAW", "Overall": "5.0", "Content": "Easy to use & download apps. Samsung has never let me down, I have had several of their phones & have loved all of them.", "Date": "May 9, 2013"}, {"Title": "Don't Waste Your Money", "Author": "Robert T. Perschon", "ReviewID": "R1AYSCPGP26K9L", "Overall": "1.0", "Content": "This phone sucks. Basically, I need to re-start it everytime I: Charge it, go from wi-fi to no wi-fi, make a call, dial a call, blink, etc. The battery lasts less than a day. You have no idea if it is really working at any time, so you aren't sure if you are missing calls or messages, so what do you do? That's right, re-boot it again. Total piece of crap.", "Date": "April 8, 2013"}, {"Title": "Very satisfied", "Author": "Anngela Lovelace", "ReviewID": "R1C88OM8G5CWR4", "Overall": "4.0", "Content": "I have been very happy with this phone. I've only had it for a week or two so I still have a lot to learn. But each time I learn something new I just like the phone more.", "Date": "April 7, 2013"}, {"Title": "grand son loves it", "Author": "Virginia Brown \"geanie\"", "ReviewID": "R3P1UDAQUG607C", "Overall": "5.0", "Content": "i got it for my grand son who is 13. he loves it. his only regret is he could put his singnature at end of tetx'", "Date": "April 5, 2013"}, {"Title": "low quality phone", "Author": "Jessica Rae Perry", "ReviewID": "R1ILAVU6WXDYQT", "Overall": "1.0", "Content": "the touch screen feature on this phone is NOT sensitive, I have to tap the screen several times or hold down my finger for 10-15 seconds for it to register. The swipe key input method is horrible, and the typing pad is so small that it's very difficult to touch each letter individually (and I have long, slender fingers). Picture quality is very low, and the battery life is short (about 1-2 days after a full charge with no data incoming).", "Date": "May 28, 2013"}, {"Title": "POS", "Author": "Christine", "ReviewID": "R1SWOYQYWXORLD", "Overall": "1.0", "Content": "I have had this phone for three years.  It only sends texts when it wants to, very slow with surfing, if you let the battery drain too much it will stop working for a period of time.  Do not buy.", "Date": "May 22, 2013"}, {"Title": "If you text, don't waste your money!", "Author": "C. Clarke", "ReviewID": "R33I1V2Y5ZEHX4", "Overall": "1.0", "Content": "I bought this phone after my old one passed on into the great beyond of obsolete electronics. The reason I chose this phone over others is that I did not want to change my T-Mobile contract. My main issue with this phone is that it does not text consistently. About one out of every three texts fails. I've talked to T-Mobile. No help. I've talked to Samsung. No help. It's not just my phone that has this texting problem.If you look up Samsung Dart forums, you will see that this is a widespread problem with this model. Neither Samsung or T-Mobile will take responsibility for the problem. The only way I have found to temporarily fix the problem is by wiping the cache every day! If you have ever done this before, you will know that it is a time-consuming task. I don't recommend it at all. Don't buy this product if you do any texting whatsoever!", "Date": "March 31, 2013"}, {"Title": "3", "Author": "Coralee", "ReviewID": "RHJW1GX1H080E", "Overall": "3.0", "Content": "i like the phone but its kinda old now and I am kind of tired of it so yea .", "Date": "December 31, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006QYVV4I"}}