{"Reviews": [{"Title": "Disappointed", "Author": "Ivan", "ReviewID": "R1DFCDB23GTY1P", "Overall": "2.0", "Content": "I bought that HTC and I love the phone ,but I am really disappointed from the headsets.As written in the product description they must send me those red beats audio headsets shown on the picture.But from HTC sent me some white HTC headsets which are ugly and they have nothing in common with the red beats audio.I give only 2 starts because I love to listen music on my phone and when the headsets are not the best (or at least what I expected)  is like I listen to my old radio. I `ve never expected that from HTC.", "Date": "September 20, 2012"}, {"Title": "it sucks s hell", "Author": "aleksandre", "ReviewID": "R3OWCXVGSWCT12", "Overall": "1.0", "Content": "ok. here is thing. i own one of these and i can say that this phone has one of the most weak and stupid core ever made...it stops every single my move every single time.. phone was great firs 3 months or 5. than i made a software update and here it is ios7 history,...seriously guys don't buy this s***.. i just love HTC but this model sucks as hell. you better buy note2 from samsung or something dualcore or even better quad-core... now i own galaxy note2 and it is amazing. it is truly a life companion <3", "Date": "December 19, 2013"}, {"Title": "NON-CHANGEABLE GLASS", "Author": "David", "ReviewID": "R22ZZS3KHJ2870", "Overall": "2.0", "Content": "The surface glass was scratched. The only way - changing the glass and a display. Costs 100$...Do I have to buy a display... I guess I'll buy Samsung...", "Date": "June 29, 2013"}, {"Title": "$500 phone start to have problem just after \"return time\"", "Author": "Customer Review", "ReviewID": "R1QWXBX3EQ8JNG", "Overall": "1.0", "Content": "I bought this phone on the middle of April, but the phone start to have maintenance problem on the began of June which I can't see anything on the screen. This is my first time buy this really expensive product online, but it's really bad experiance and if I would knew this $550 phone gonna have problem only in one month and half, I would not bought this.My friend bought an Iphone in the Apple Store. She drop the phone in the water and she was preparing to fix it with the cost, but Apple Store charged her nothing for it.What do we need for buying stuffs, quality, and customer service, right. But I didn't feel either of them after I bought this phone here.", "Date": "July 17, 2012"}, {"Title": "Beast Droid", "Author": "Truth Mitchell", "ReviewID": "R21Q98K263AOV5", "Overall": "5.0", "Content": "This is the best phone I have ever bought. I'm oversea's and it works like a charm. Read books , watch movies, listen to music, this is an all around device. I have had it 3 weeks with no problems, I reccomend this product.", "Date": "February 18, 2012"}, {"Title": "Excelent! that's a real cellphone!!!", "Author": "fannycr27", "ReviewID": "R2ILDWRYQ7FE2U", "Overall": "5.0", "Content": "I love it, it's fast, the resolution of the camera is very good, works with android and to me that's a ver y important point to evaluate, it's really awesome", "Date": "June 4, 2012"}, {"Title": "HTC XL", "Author": "Ms Charlie", "ReviewID": "R29PB5JWHDJYE8", "Overall": "5.0", "Content": "I love this phone, best phone l ever owned. It takes great pics, l jst love it. I used to be an Apple fan but HTC changed all that. Only thing l miss on I-phone is Siri, thank God, l do not have to use iTunes anymore.", "Date": "May 2, 2012"}, {"Title": "HTC sensation xl is n excellent device", "Author": "Abuferas", "ReviewID": "RZH3MX7N4UJRW", "Overall": "5.0", "Content": "HTC sensation xl is an elegant device. Very attractive design besides it's powerful features.I like the size of the screen and whe writing words. Displaying documents and pictiures in a very fast motion.", "Date": "February 12, 2012"}, {"Title": "good phone but expensive", "Author": "Jeffrey Tun", "ReviewID": "R3UG57I8GE3PMR", "Overall": "4.0", "Content": "They sent me the \"htc sensation xe\" instead of \"xl\" the first time. Eventually, I had to return it and wait for my xl for another week...I didn't know the price would drop so soon since February. I was 560$ ish when I got it. It worth 100$ less then that now for the same thing... I wish I had some patient waiting on it...Overall I enjoy using this phone. There is nothing much you can complain about it.", "Date": "June 10, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "1.5 blazing fast processor", "Name": "HTC Sensation XL X315E with Beats Audio Unlocked QuadBand GPS WiFi HSDPA Cellular Phone White", "ImgURL": "http://ecx.images-amazon.com/images/I/41YOGUrwvBL._SX300_.jpg", "ProductID": "B006546GWG"}}