{"Reviews": [{"Title": "What a pleasant surprise!!", "Author": "Y. PENG \"Y.P.\"", "ReviewID": "RJIL7P8UXFFAG", "Overall": "4.0", "Content": "I originally didn't have high hope with such a low cost Android phone before I made the purchase but I made the purchase to give it a try anyway. The phone turned out to be very smooth given the very \"common\" / \"basic\" specs of 1Ghz single-core processor and 512 RAM size. I don't know how Sony did it but it is VERY responsive, video is very smooth & load very fast, and audio is beyond awesome & way better than my expectation. (*I am comparing with ATRIX 4G with dual core processor and HTC Thunderbolt).Not only the back speaker volume is very strong, the noise cancellation works very well when used in regular mode with the mic in the bottom of the phone, the other end can hear very clean (static free)and loud voice probably even better than from a landline phone. This is the phone I will use among others* when I have to make a call in a very noisy environment.Well .. the best thing is that there is **NO CARRIER RESTRICTIONS on this phone, you are free to enjoy all the full benefit of a Google Android phone beyond what you can enjoy even from the latest Google Nexus from Verizon (the \"shaky\" LTE version) in terms of restriction free. (I seriously don't care about Face Unlock or NFC Google Wallet, & 5MP camera? you gotta be kidding me! ...etc).Now, here are the weakness why it doesn't get 5 stars from me:1. Somewhat small size & average resolution screen tho the Bravia engine does it's magic (you can see the difference by turning it on/off).2. Disappointing camera, very noisy in low light and low resolution (5MP).*Note 1: Yes, I actively use all these three phone in daily basis, iPhone is struck out long time ago and I will never look back until probably iPhone5, 6, 7, ... or 100. iPhone X is always one step behind in technical specs anyway.**Note 2: No, I am not talking about the SIM Free feature. The greatness is way beyond it, the same experience as using an Android phone overseas where Wireless Carriers are not as corrupted and greedy as those here in the Great nation of Capitalism. Hint: You will have to pay $30 a month to enjoy a mere 4GB of LTE data on Verizon network (with their so called \"promotion\", What The ....!?)", "Date": "December 19, 2011"}, {"Title": "\"Almost\" better than expected.", "Author": "The Engineer", "ReviewID": "R262PT4Y6MCGP3", "Overall": "4.0", "Content": "This phone is \"GreenHeart certified,\" which means that more than 50% of the construction is from recycled parts.  The screen has a \"scratch resistant\" film; so don't treat it like it has Gorilla Glass.The phone comes in a factory sealed box, as it was originally sold in the U.S. as an unlocked phone direct from Sony.There are 2 versions of the Neo V, MT11i (International) and MT11a (American).  The MT11a is identical to the MT11i, except that it has 850 Mhz Band V and 1900 Mhz Band II, HSPA support (AT&T; and T-Mobile); in place of the 900 Mhz Band VII, HSPA support used outside the U.S.As mentioned in other reviews; the USB and HDMI connector covers are kind of flimsy.  The only thing keeping them from getting lost is a very thin plastic thread.  Handle with care.Although it comes loaded with Android 2.3.4, and is upgradable to 4.0, you may notice the lack of voice input on the virtual keyboard.  This is easily corrected by downloading the free \"Gingerbread Keyboard\" from the Play Store (formerly Android Market).***** Danger Will Robinson *****If you upgrade the phone to ICS, tethering will stop working!  This is a known and hotly discussed topic on the Sony support forums.", "Date": "April 27, 2012"}, {"Title": "Sony Ericsson Xperia Neo V", "Author": "ATR-DRIFTS", "ReviewID": "REIKH9I1HAT04", "Overall": "5.0", "Content": "This phone is great. The display is amazing and the phone fits well in the hand. It is very stylish. Pictures are great for a 5 mp camera. It recently got updated to ICS. Battery life is good; it will last a full day with constant use (i.e. web browsing, music, text, call, videos, etc.). With optimal use, it can last two days before charging. Overall a good stylish phone.", "Date": "May 9, 2012"}, {"Title": "The best entertainment (3D, Bravia, Timescape)", "Author": "Keisha", "ReviewID": "R33QOWZFU0Q299", "Overall": "4.0", "Content": "Pros:This phone is easy to set up. Once you plug the phone up to your PC or Mac, it automatically check for updates to keep the phone stable and it download the PC companion that helps with media and file transfer. The sync is wonderful thus it eliminates having to download pics to the phone into certain apps like Floating Images. Also, it has easy toggle functions in which you can create folders so really dont have to scroll to other pages on the phone once you group your apps into these folders.Cons:The phone comes with 1GB internal memory and I believe for the pricing it should have at least 2GB. I got 2GB on my net book which cost $300 so I would suggest getting a 16gb micro sd chip or 32 gb micro sd because when you download applications that takes up the memory  thus leaving no room for music, pics or any thing else.I am looking forward to my upgrade in late March early April to the ice cream 4.0 android platform. I hope Sony continues to service this phone for a while otherwise their products will be replaced like Samsung which discontinue software maintenance on their phones after 6 mos.", "Date": "February 5, 2012"}, {"Title": "Good Inexpensive phone", "Author": "Pravahan Salunke \"Pravahan Salunke\"", "ReviewID": "R1KZZ8FITBJYNA", "Overall": "4.0", "Content": "Good phone. Has all the features of a top smartphone and still is relatively inexpensive. Has a cute exterior and looks particularly good in metal and white finish. The phone caused my home wifi network to crash, but worked fine elsewhere. And that seems to be the only drawback. I would still recommend people to buy this phone.", "Date": "April 16, 2012"}, {"Title": "AWESOME", "Author": "Tyrone Williams \"T-Will\"", "ReviewID": "R2FK2GDM48MK5X", "Overall": "5.0", "Content": "This phone rocks, everyone loves their Blackberry's or iPhone's but Sony makes a great product also. And I cant wait for android upgrade to 4.0, I'm learning new things about this phone everyday. In closing for the price you get your bang for the buck. I'm hooked on Sony!!!!!On a side note for all of you people that or new to amazon if you place and order and your not happy with your merchandise. Write about your experience and see how quickly these vendors will contact you begging you to remove your bad review, don't be afraid to leave your phone number they will call.", "Date": "June 13, 2012"}, {"Title": "Its ok!", "Author": "Nayra Herrera Patino", "ReviewID": "R3FBO9Y6FYHW8O", "Overall": "3.0", "Content": "It's a beautiful smartphone, but  it's storage capacity is really low! So it'll be necessary to buy a mini SD card.The materials of the phone are really delicates. My phone have a lot of scratches on.", "Date": "May 19, 2013"}, {"Title": "time line", "Author": "1lstchance", "ReviewID": "R3VOR3MXQ5IHDY", "Overall": "3.0", "Content": "well it was great while it lasted the thing is it lasted all of 4 months before it malfunctioned ugh", "Date": "March 27, 2013"}, {"Title": "Gift", "Author": "ray", "ReviewID": "R2XCC1D8H6WNO0", "Overall": "4.0", "Content": "I buy this as a gift for a friend and she love it. So far no complain with, her carrier is with ATT.", "Date": "January 21, 2013"}, {"Title": "data issues", "Author": "Grace", "ReviewID": "R1YOL0S8SVN6HU", "Overall": "3.0", "Content": "I really do like this phone, but i cannont connect to the interneat.  I have contacted AT&T; and they gave me the settings, it still doesnt work.  I have contacted Sony and it still doesn't work.  I dont want to retunrn it, but i have no choice....HELP!!", "Date": "August 10, 2012"}, {"Title": "Not good", "Author": "Rob", "ReviewID": "R6MKU348OJAHT", "Overall": "1.0", "Content": "Well, I finally had the chance to open the product this past weekend to use this phone.  There are one major issue with this phone, when you try to slide and open to use it to dial out, the dial icon is not responsive to your touch.  So, that means you have to keep on pressing it to make it open up to make a phone call.  Now that's nuts!  Today is only Tuesday and I just open it this past Sunday to use it, and this is one major headache.  I can't see myself having to keep on pressing the dial icon for several seconds to make calls.  I just want a phone to make simple phone calls with one touch and that's it.  Also, the screen brightness is not so good, it's dim.  So overall this phone is not ideal to use in an emergency situation.", "Date": "August 7, 2012"}, {"Title": "Performance >= Price", "Author": "Margie", "ReviewID": "R2IWOCH8QWXW0I", "Overall": "5.0", "Content": "I didn't buy on Amazon but I have this kind of phone and it works perfectly on 2.3.4. I still don't plan on upgrading in to 4.0 since there are still few issues on that version of Android OS. I give this an overall of 5/5 rating for this phone is the best for its price. This is best for moderate HD gaming for it has a 3.7 inch \"scratch-proof\" screen and an Adreno 205 GPU that enhances your gaming experience. The only Cons in this phone is that when it is dark, the camera has a hard time focusing on their subject and it generates a purple spot on the screen: which is the color of the camera lens, and the physical buttons color soon fades away and gets worn out from over use. Still a great product though.", "Date": "May 24, 2012"}, {"Title": "Excelent Android Cellphone....! (Excelente telefono Android..!)", "Author": "Yorman", "ReviewID": "R686YSRMWSIFR", "Overall": "5.0", "Content": "It's a beutiful and elegant phone...is the better relationship between price a perfomance. And no mention the android 4.0 ICS update. I'm very glad I bought. So there is many aplication for android in the android market. The only cons is the difficulty to find the accessories to that phone.Es un telefono muy bonito y elegante, para mi es la mejor relacion costo-beneficio debido al precio y la rapides del telefono. Y sin mencionar la actualizacion a Android 4.0 ICS preparada por Sony. De verdad que estoy realmente complacido de haberlo comprado. Ademas hay muchas aplicaciones en le Android Market. El unico inconveniete es la dificultad para encontrar accesorios como forros y estuches.Lo recomiedo ampliamente.SaludosBye.", "Date": "May 14, 2012"}, {"Title": "Good and Excellent to use", "Author": "karthik", "ReviewID": "RRCHMLRYUN2LS", "Overall": "5.0", "Content": "Excellent and it is good to use, I love very much, my mobile. User friendly for use and excellent clearity", "Date": "June 3, 2014"}, {"Title": "NIce Phone. Great price. Just what I needed.", "Author": "M. Anderson", "ReviewID": "R2P1X2TLIDU8BH", "Overall": "5.0", "Content": "Everything's cool about this. Runs well and keeps up with the demands of 2014. I'm not impressed by newest or fanciest -- but effectiveness, definitely.", "Date": "June 2, 2014"}, {"Title": "died after 8 months", "Author": "DCorredor", "ReviewID": "R221IQZRODN2S5", "Overall": "2.0", "Content": "did not like this cell, too slow. After 8 months it started to shut down completely, I had to urgently find a replacement. Camera was very bad.", "Date": "February 16, 2014"}, {"Title": "Best unlocked gsm phone in it's price range. Few Cons", "Author": "C.C. from Florida", "ReviewID": "R2WGHDAO7TCVX0", "Overall": "4.0", "Content": "I've owned my Sony Xperia Neo V for 11 months now and I absolutely love it so I felt it was time to put in my user review. After a ton of research I felt that this was the absolute best bang for my buck. It's the perfect size for me. My son got an iphone 4s and my sister got an iphone 4 at the same time. All of them are fantastic phones but each have different qualities. Some better than the other.FYI - THE COMPARISONS MENTIONED BELOW WERE STRICTLY MADE OUT OF FUN AND BOREDOM ( :Pro's for Sony -* Browsing - My Sony was faster. It pulled up all video's and web pages quicker than both iphones.* Price - Sony was way cheaper to purchase new and unlocked. I paid $230 for mine with NO WIRELESS CONTRACTS* Cool widgets such as timescape and great customizing and organizing capabilities. (My son liked these features on my Sony better as far as this goes.)* Lot's of great aps that are FREE on android and NOT on apple.* HDMI port , FM radio* Was able to download a super easy ap called Double Twist that synced all my Itunes. (It even looks like itunes)* Nice color options and can take a SD card up to 32GB !  yeah !!* Screen display is 3.7 and the iphone is 3.5 however...the iphone screen is a little wider so it's a tie there.Con's for Sony -* NO COOL PHONE CASES or COVERS for Neo V !!! It's slim pickens for sure. I was able to find one case that I liked by MOMAX which I purchased right here off Amazon.  Iphone has a GA-ZILLION cool phone cases. UGH !!* Camera quality is very good for a cell phone but low light pics can sometimes have a pinkish purpleish tinge on them. It takes 3D photos but you can only view them on a 3D TV.  ( I'm not gonna lie the iphone camera quality is superb )Both Neo V and Iphone can take panaramic photos.* This phone is upgradable to ICS which is great BUT after reading countless reviews and blog sites I'm not gonna chance it. I'll stick with gingerbread. Supposively there are a lot of bugs with ICS that still need to be fixed.MY #1 COMPLAINT .........* The light sensor can not be disabled.I know it's supposed to help with battery drainage , eye strain etc. but sometimes no matter how dark the room is I want my screen to be super bright but it stays dim even at 100% maximum brightness. This is by far my #1 complaint. This phone has a really great display which would be beautiful if it could be even brighter. I JUST WANT THE OPTION TO DISABLE IT WITHOUT ROOTING !I use my Sony Neo V with Straight Talk wireless. It's fantastic and I had absolutely NO PROBLEMS setting it up. Phone worked within 5 minutes of calling ST and processing my Sim card. No problems with connections whatsoever.Bottom Line - I will definitely purchase another Sony Xperia phone in the future. (They have some really amazing phones they have just released) I feel that Sony offers a really great phone at an unbeatable price. Right now I'm loving my Neo V !", "Date": "January 12, 2013"}, {"Title": "Improvement over Blackberry", "Author": "Andres Avila", "ReviewID": "R6WO4477A2Z7M", "Overall": "5.0", "Content": "Its all i think it was and more, im from venezuela and i was looking for a change over the blackberry that i had, didnt have a lot of money so that was an issue but when i found this phone problem solve!.. its a medium to high phone, its not a 500$ phone but for the price i think i just stoled Sony.. I recommend it if you are looking for a cheap phone with lots of benefits.*************------------Second Review:I bought this phone when it was much much cheaper, i bought it por 280.. And for that price i would buy two, but now that i see the new price my previous review does not make sense, for this new price you can buy a much greater and complete phone.. The xperia neo v its a great great phone probably around 330 its ok but no further...", "Date": "December 14, 2012"}, {"Title": "Nice!", "Author": "PablogoO", "ReviewID": "R2GHZVFGTA9F8V", "Overall": "4.0", "Content": "Its a cool phone, HD video and photos on a plasma tv is great! but it has so many sony apps on it that works slow after a couple of days, so I had to root my Neo V and now is better than always. I had to uninstall timescape because consume so much memory, the same with facebook integration, it doesnt help when you need to make a phone call right now and its very slow and other apps can do the job. So buy this phone Ice Cream Sandwich update makes it worst so dont do it. I keep it on version 2.3.4 Gingerbread 4.0.2.A.0.42 (this is the version you can root the phone).", "Date": "November 7, 2012"}, {"Title": "Great cellphone", "Author": "Karen", "ReviewID": "R3FE51B353IWC1", "Overall": "4.0", "Content": "I love it, the only problem with it is that the battery does not last much. I just can use it for 8 hours, then I have to recharge it.The screen is amazing, you can see every picture in high resolution.", "Date": "October 22, 2012"}, {"Title": "GREAT PHONE!", "Author": "Lucero Correa", "ReviewID": "RAVY6281MJZAO", "Overall": "5.0", "Content": "this phone is amazing and its just what was described in the description! two day shipping fast and easy and now i can enjoy android ICS 4.0 without buying an expensive phone :)", "Date": "August 28, 2012"}, {"Title": "good", "Author": "dan", "ReviewID": "R1YAED8HVTJKL7", "Overall": "5.0", "Content": "Its a nice cellphone , using android and the last operative sistem ice cream sandwich 4.0.4. Nice resolution and a cool camera", "Date": "August 5, 2012"}, {"Title": "Good value for price.", "Author": "Marios Karaoulis", "ReviewID": "R9BXV1Z2EZ4SM", "Overall": "5.0", "Content": "In general, I am very pleased with this phone, especially if you consider the price.I am writing this review, just to inform you, that this phone mt11a (nor the mt11i) will have 3G support on t-mobile.T-mobile are using their own network bands, 1700/2100. In order for the 3G to operate, you need both. 1700 is not suppored but this phone (as many other phones, like the iPhone), therefore you will end up using EDGE speeds.Now, T-mobile, realized that using their own bands, isn't going anywhere, therefore they are switching to the more traditional bands, the 1900. Some cities have that, some not. Rumors say that by end of 2012, all cities in us will be covered.So if you are thinking to use it on t-mobile, be aware.", "Date": "July 31, 2012"}, {"Title": "i just love it", "Author": "L. carigli LIMAICO G", "ReviewID": "R35UV2DJO6V3P3", "Overall": "5.0", "Content": "It's thin, delicate easy to use, and my battery its good, for what use it for it last a lot. Love the everything about it!", "Date": "July 29, 2012"}, {"Title": "Pretty Pleased", "Author": "littleme", "ReviewID": "R28PQAGGMN8LXQ", "Overall": "5.0", "Content": "So far so good, i purchased this phone for my sister as she was using only her iPod to communicate with us( when she had wifi available) so after her lack of interest in researching phones was evident, i took it upon myself to look up an ericsson phone ( I LOVE SONY PHONES!) and phone this pretty number. The camera is fantastic,  the phone feels light yet sturdy and from what i see she is really enjoying it... So I recommend! It has the 4.0 Ice Cream Sandwhich update available, so yay for that too!", "Date": "July 26, 2012"}, {"Title": "Great Purchase!", "Author": "Maria Urdaneta", "ReviewID": "R20H5LD76NHZ5V", "Overall": "5.0", "Content": "I totally recommend the phone, as much as the seller, I'm in love with my phone it does all android cool stuff, the camera is great, no complains at all!", "Date": "June 28, 2012"}, {"Title": "Just great!", "Author": "JC", "ReviewID": "R2JB9OCJBROXDF", "Overall": "4.0", "Content": "I got the phone yesterday, it did upgrade to Android 4.0 at the time I plugged it into the computer, and thats just great.One thing though, while using certain applications, like Instagram, the phone freezes, until it restarts itself.", "Date": "June 26, 2012"}, {"Title": "Misleading Product descriptions. Fraud.", "Author": "Aditya", "ReviewID": "RYJ9F0HFLDQGH", "Overall": "5.0", "Content": "Hi All,I bought this phone few days back. The phone's specification and my order details says it includes 8 GB Micro SD card. This was one of the deciding factor for me to go with Amazon. But when my order arrived, to my surprise the SD card included was of only 2 GB which was a shear disappointment.Hope Amazon sees this comment and act on it. This is not expected out of a giant like Amazon.\"http://www.amazon.com/gp/product/B0061JP49Q/ref=oh_details_o01_s00_i00\".Thanks", "Date": "April 22, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Screen  3.7-Inch 16,777,216 colour, TFT LCD display/854x480 pixels. Touchscreen. Reality display with Mobile BRAVIA Engine. Keyboard - Onscreen QWERTY\nNetworks: UMTS/HSPA 800/850/1900/2100 GSM/GPRS/EDGE 850/900/1800/1900. Android 2.3.4 (Gingerbread), Internal phone storage: 1GB (up to 320MB free), RAM: 512MB, Memory card slot: microSD, up to 32GB\nCamera - 5 megapixel, Digital Zoom - up to 16x, Auto focus, Front-facing camera (VGA), 3D sweep panorama, HD video recording (720p)\nConnectivity: Synchronisation with computer, WiFi, HDMI support, Micro USB support, aGPS, Bluetooth technology, TV out, 3.5 mm audio jack, USB mass storage. Wisepilot turn-by-turn navigation (Free trial version included).\nIncludes charger, battery, microUSB cable, stereo headset, 2GB microSD card.", "Name": "Sony Ericsson Xperia Neo V Unlocked Smartphone with Android OS, 5 MP Camera, 3.7-Inch Multi-Touch Display, Wi-Fi, and aGPS - MT11a-WH", "ImgURL": "http://ecx.images-amazon.com/images/I/41aZ2dJGSmL._SY300_.jpg", "ProductID": "B0061JP47S"}}