{"Reviews": [{"Title": "love my evo!", "Author": "debaum2", "ReviewID": "R8NHTRZW7SN7T", "Overall": "5.0", "Content": "I love my evo shift! Its one of the best phones I ever got. The coolest thing about it is the slide out keyboard. I have nails, and its hard for me to type with the touch screen. Plus, my husband has fat fingers and he uses the keyboard much easier! I love this phone and ill be staying with HTC!", "Date": "July 2, 2012"}, {"Title": "Replacement phone", "Author": "Jim Haldeman", "ReviewID": "RPHH3CWT9WJ5R", "Overall": "3.0", "Content": "My mother needed a replacement phone. Although I ordered this phone for her used, it would have been better served to be scrapped instead of being put back on the market for use. I've always liked sliding keyboards, but this one moves a bit roughly. You could definitely tell it was not reconditioned. I'm sure it was a trade-in that was purchased by the dealer and just moved from on box into another to be pushed out again without any attention to details. It was also missing the charger cord. I will not be using this group again.", "Date": "May 4, 2013"}, {"Title": "so far so good", "Author": "Zee", "ReviewID": "R2ZACS3H43GP3K", "Overall": "4.0", "Content": "my daughter likes the phone thus far.  lets see how it goes from here.  i have a wait and see approach with items i have never used before.", "Date": "October 9, 2012"}, {"Title": "ok but the battery", "Author": "Bryant D.", "ReviewID": "R3345GPOECNHSJ", "Overall": "3.0", "Content": "the phone overall is descent, it is a little slow and the battery is garbage though that's all i got", "Date": "February 1, 2014"}, {"Title": "Awesome", "Author": "brodey", "ReviewID": "R22QQ8IQ0FWLHR", "Overall": "5.0", "Content": "Thanks guys works great... Will defnatally be using you guys again when I need a new phone in the future.", "Date": "August 23, 2013"}, {"Title": "It broke", "Author": "alice sullivan", "ReviewID": "R2PTE4Y8L5353K", "Overall": "2.0", "Content": "Product worked fine, for a couple of days. The touchscreen wouldn't work and have a mind of its own. Find a different phone.", "Date": "July 23, 2013"}], "ProductInfo": {"Price": "$120.00", "Features": "No contract Sprint cell phone ready to activate on your Sprint Wireless account\nExcellent Conditioned Pre-Owned Phone, You Will Be Very Satisfied\nUsed No Contract Sprint Cell Phone\nFull 30 day customer satisfaction warranty\nPlease contact us with any questions and we will reply ASAP", "Name": "HTC EVO Shift 4G No Contract Sprint Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/51w2to9C5AL._SY300_.jpg", "ProductID": "B006YG5X4M"}}