{"Reviews": [{"Title": "Love this phone!", "Author": "Jonathan Hefner", "ReviewID": "R2TY5HISKUVQX7", "Overall": "5.0", "Content": "This has been my favorite Windows Phone, that I have owned. I've owned the HTC Arrive, Samsung Focus Flash, Dell Venue Pro, HTC Titan, and the Lumia 800. The best part of this phone are the awesome apps that Nokia provides, exclusively for these devices. None of the other OEMs come close to supporting their product this way (heck this phone already runs the Tango update, unlike any of the other WP7 devices).If you are going to get a Windows Phone, get a Nokia. They are fully invested in the platform, and offer a rich experience with their apps. Also, the camera is really good, not quite as good as the Titan's camera, but almost as good...definitely better than any other WP7 device.", "Date": "October 16, 2012"}, {"Title": "The wrong color", "Author": "Yan", "ReviewID": "R3CZLPHCRFE3UU", "Overall": "3.0", "Content": "I really liked the blue one, the title of this product also says blue/cyan, but the one I received is a total black one!!", "Date": "July 4, 2012"}, {"Title": "Gran telefono, pero....Great smart phone but...", "Author": "DP", "ReviewID": "R1UIY40EEVL38T", "Overall": "4.0", "Content": "Me encanta mi muevo teléfono inteligente. Es fácil de manejar y entender (tipico de nokia). Si hay buena señal, navega rápidamente. Lo único q puedo decir en contra es sobre el tiempo de duración de la batería. Si lo usas como un teléfono inteligente, debes cargarlo mas de una vez al día, cosa que no gusta mucho. De resto estoy muy contenta por mi compra.I love my new smart phone. It's the firts in this tipe, it is easy to understood, whit good signal (wi fi or data) is quickly. The only thing that i have to respect it's about the time battery. If you use the telephone like a smart phone, you must to be charge more than one time in the day, and it's no so good. The rest im'happy.", "Date": "November 25, 2012"}, {"Title": "NOKIA TRIES TO SAVE FACE (Microsoft COULD NOT CARE LESS)", "Author": "NeuroSplicer", "ReviewID": "R2GKVDF5VF9FTX", "Overall": "3.0", "Content": "I have been a loyal NOKIA customer ever since my first cell phone, the legendary 6110 (and what a great phone that was!). Over the years I have upgraded or simply replaced a number of NOKIAs and my loyalty may have been tested at times but it was never scorned. Until recently.My latest 6500s was at its last of its nine lives (after its second battery replacement and numerous drops) so I decided to bite the bullet and go shopping for a smartphone. I have always refused to submit to APPLE's fascism whereas I judged ANDROID's deep waters too dragon-rich for me, so a Windows Phone seemed to be my best option. Or so I thought.THE PHONE HARDWARE IS GREATIf I were to review the device itself, it would rate at 4.5 stars (and my past experience with NOKIA products would had made me round it up to a perfect score). Other than the flimsy USB door (that, in my case, I predict will not survive long enough to see the first snow) and the (cheap) plastic feel of the silver side buttons, the phone is perfect. Reception is good and sound quality (both sending and receiving) is excellent. Unfortunately, no matter how good the hardware may be,a smartphone is as good as its operating system. And the list of my grievances regarding the software is long...BASIC FUNCTIONS ARE MISSINGI know all about Apps, free and paid, and how they are supposed to enrich and personalize the experience smartphones get to offer. And after spending several afternoons raking the Windows Phone Marketplace I can tell you this: once a basic function gets yanked out, there is no getting it back intact!ALARM FAILSIt took me three days to find a CountDown Timer that is able to work after the screen saver lock kicks in. No such luck with the Alarm though. The Alarm will not work unless the phone is turned on. I have tried every suggested Alarm clock app and this problem remains. Apparently this is a well known problem. For over 2 years now!Think about it for a moment. Either at home or on a trip, you want to set the alarm before going to bed, turn the phone off (not only to preserve the precious battery juice but also to get some hours of privacy as well) and expect your phone to wake you up the next morning. But this is not allowed on a Windows phone! I have updated mine to WP7.8 but this function (as well as all that follow) is missing from the latest WP8 as well.Just because the iPhone does it this way, Microsoft, it does not mean it is the right way. Wake up! (apparently your alarm clocks did not go off either...)CHARGES ONLY IF TURNED ONWhen I bought my new LUMIA 800 I went to my cell phone service provider and requested a twin (micro)SIM card. Since I kept my old 6500s, I tried charging my LUMIA while it was switched off (the provider does not allow both SIM cards to be active at the same time). Surprisingly, the Windows Phone either switched back on or (if turned off while connected to the charger) it simply refused to charge!Again, to appreciate the problem, keep in mind that a smartphone will need to be charged every single day for 2-3 hours.TOTALLY IDIOTIC SOUND LIMITATIONSWith my old phones if I wanted to use any sound or song as a ringtone, wakeup music, SMS sound or eMail alert, I could just choose one from the phone folders. Any mp3 or wma file would do. And I could transfer them there using a simple USB connection and NOKIA's Suite. Well, if MICROSOFT has its way, those days are over.First off, you have to use a PC to install their own suite, Zune. You have to use this interface to transfer and synchronize files between your PC and your Windows Phone. So far, no foul, Zune works fine. And then you decide that the generic chimes provided by Microsoft are crap and want to customize how your phone sounds. No go.NOKIA tried to fix this by releasing a free RingTone Maker (only available for NOKIA Windows Phones) but that too comes with ridiculous limitations: only sound files less than 2MB can be used and even then, only a 30 sec soundbyte can be made into a ringtone! Why do we even have 16GB phones if such 1990's limitations are to be in place?PLEASE CHOOSE YOUR CUSTOMIZATION STRAIGHT JACKETSmartphones have much larger screens than our old phones. Why can we not choose the size of the font and strain to discern the phone numbers of our contacts? (There is a Big Phonebook App but it has to import all your contacts and it does not auto-update every time it is used).Smartphones have far greater processing power. Why can we no longer switch our contacts between a list and card format? In the much larger screen I can see less information about each of my contacts than I did with my 6500s.Smartphones can now project 16,000,000 colors. Why can we not choose to change the color of each individual tile?Swiping from the right edge will take you to the Apps list. Why is swapping in the opposite direction not allowed? It is not reserved for anything, so why yet another counterintuitive limitation?Finally, where are our easy to use and trusted Profiles!? The movie is about to start, am I to go through the damn menu to silence my phone?The lack of Applications for the N9 made me choose the LUMIA 800. As the days go by, I start to realize that I did not chose the lesser of two evils. And I have now seen the face of Evil. And its number was 7.8.", "Date": "August 17, 2013"}, {"Title": "Nice phone. It meets my mom expectations", "Author": "J. Adolio Cascante \"George Adolio\"", "ReviewID": "R3K4TTRD8A4C63", "Overall": "5.0", "Content": "I bought this phone specifically for my mom who has been always a big fan of Nokia phones. She recently had to throw away a HTC phone that I bought also to her from eBay since the firmware got corrupted so there was no way to make it work.Up to this moment the phone is working 100% fine without any major problems. Good purchase overall!!", "Date": "November 19, 2012"}, {"Title": "I love it", "Author": "cricketfan", "ReviewID": "RYV0PI5SJ6GTJ", "Overall": "5.0", "Content": "This phone is just awesome. I just got it today. When I opened my package, it has everything what I need. I read the customer review and they wrote that the headphone was not included but i got my headphone also which really made me happy . the product is really good and well packed. One negative side is that the phone is kind of heavy but otherwise the phone is AWESOME!!", "Date": "December 3, 2013"}, {"Title": "Good purchase", "Author": "S. K.", "ReviewID": "R2GKRGILAC49UG", "Overall": "5.0", "Content": "When I received the phone the seal was broken, which concerned me. However, I received a call from Breed customer service, explaining that it was done so to unlock the phone (and that is the same with all unlocked phones).I am glad I learnt that. I still have not used the phone because it is actually a Christmas present, but will keep you posted with how it works. I am sure everything will be fine.", "Date": "November 19, 2013"}, {"Title": "Best phone I've ever had", "Author": "Vanessa Weaver", "ReviewID": "R25IZ8O2AVT8PN", "Overall": "5.0", "Content": "I love the blue color first of all. I've been using an iPhone for a few years and I switched to this phone after my iPhone broke. Best phone I could've chosen. I was thinking about the pink one but didn't care for the shade. I get so many compliments on the Lumia 800 and its nice color. The price isn't too bad. I paid under $200 for mine from someone else on Amazon.***PROS***Screen is easy to maneuver and readSo many settings to pick from for personalizationLove the layout of squares for easy organizationThe blue color is my favorite of all colors it comes inCharger has a fairly lengthy cordCamera is really niceCOMES WITH SAME COLORED CASE!!!Slim and fairly light weightCharges quickly***CONS***Not as lightweight as an iPhone (I like the weight)Doesn't come with headphonesNot too many CONS I can think of. It's a great phone. I am very happy with it.", "Date": "July 22, 2013"}, {"Title": "something new for me", "Author": "Dajun Wang", "ReviewID": "R3KSOU6SSQ8GTK", "Overall": "4.0", "Content": "I have been using Android phone a lot, windows phone is something new for me, and Nokia is something I trust. It will be better if the price was lower.", "Date": "March 21, 2013"}, {"Title": "It is awafull....", "Author": "blend", "ReviewID": "R1WTU3EY6DMHOU", "Overall": "1.0", "Content": "It is fall down and ıt is broken now. I hate from it!...... I can't use it  .............................. ............. ............................", "Date": "December 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007C9VPN8"}}