{"Reviews": [{"Title": "Simply a beauty", "Author": "s", "ReviewID": "R3NOGXQ7W1C8SP", "Overall": "5.0", "Content": "Sony Xperia P is one of the very few elegantly designed phones in the market. The best I like is the design including its aluminum unibody, which distinguishes itself from plastic bodies of the vast majority of cell phones, including Sony Xperia S. The transperent bar across the lower part is particularly interesting. Just don't know why Sony abandoned this really good looking thing in its Ion (which looks boring and too big). 4\" screen (960x540) of this phone is simply the best (who really use 720p in cell phone?). The three touch buttons in the transparent bar are very responsive, as contrast to those in Sony Ion. Although I don't care others like Android 2.3 (updating soon, but why?), less fast CPU, no-microSD, fixed battery, etc, it runs perfectly smoothy and responsive. Preinstalled gallery/wall paper are of super quality. Stronly recommend.", "Date": "August 24, 2012"}, {"Title": "Good and bad", "Author": "Derek Yien \"Mr. D\"", "ReviewID": "R3BDATFNC31QHJ", "Overall": "5.0", "Content": "The product is as excepted after my hours of researching. This phone shipped with a much unexpected foreign wall charger. Not good. Included headphones and USB cable. But now I have to order a new charger.EDIT:There was a adapter for the foreign charger in the packaging. I didn't find it until 12 hours later. I change the star rating from 3 to 5 now. No complaints.Edit again:Someone stole my Xperia P. I now have a iPhone 4s. I would rather have my Xperia P back. The screen on the Xperia is superior to the iPhone 4s. Also, I like the different design of Xperia P, iPhone is common and boring.", "Date": "July 30, 2012"}, {"Title": "Great Phone!!!", "Author": "Rodson desauguste", "ReviewID": "R26L2IMV44T57P", "Overall": "4.0", "Content": "great product. I really like the brilliant and unique design of the phone. the phone is definitely worth the price.", "Date": "September 10, 2013"}, {"Title": "Amazing quality!", "Author": "Shelby Knowles", "ReviewID": "R2ITSQHS9KK6RD", "Overall": "5.0", "Content": "This phone functions exactly how it's described. It's super sleek and easy to use. The look is stunning as well. Excellent phone!", "Date": "June 26, 2013"}, {"Title": "Excelente", "Author": "alex", "ReviewID": "R39LA63TJT1K0M", "Overall": "4.0", "Content": "excelente producto en VZLA trabaja bien con movilnet!!Lo Recomiendo 100%muy rápido aunque esperaba algo mas Great Product excelent a elagant phone", "Date": "October 5, 2012"}, {"Title": "Just awesome", "Author": "Osama Gamal", "ReviewID": "RRHU9VWL2NXY2", "Overall": "5.0", "Content": "Everything works fine. Shipped with two power adapters (from European to American) for those living at US. Phone works pretty nice as expected, no problems so far.", "Date": "October 14, 2012"}, {"Title": "As good as it gets", "Author": "Bernardo A. Mercado", "ReviewID": "R2TOLCDGCAVE6W", "Overall": "4.0", "Content": "Is what i expected, good speed between apps, hd screen, it`s worth the money that i paid, if you want a smartphone whith lots of apps, this is the one that you are looking for.", "Date": "October 5, 2012"}, {"Title": "feeling good", "Author": "waleedullahkhan", "ReviewID": "R26XMN8C9ACWZL", "Overall": "5.0", "Content": "I like the set at first and still but the battery problem still exist it has a very poor quality  losts in 4 or 5 hours on 3g and wifi network although phone is good", "Date": "April 5, 2013"}, {"Title": "Its perfect", "Author": "by Gaston", "ReviewID": "R2YWJN06VLYS5W", "Overall": "5.0", "Content": "It has a gorgeous and stylish design. Despite his 4 inches display it is not a big cellphone, so you can handle it easily. From the point of view of the software it works perfectly, it doesn't lag, nor get stuck", "Date": "March 4, 2013"}, {"Title": "Great smartphone!", "Author": "alexhosen", "ReviewID": "R33IX4V6ZKA5J5", "Overall": "5.0", "Content": "A great phone, with a really good camera and excellet music player, and i love how it looks.Is a great choice for the price.The only downside imo, is the lack of expansion storage support.", "Date": "February 3, 2013"}, {"Title": "Muy bueno", "Author": "Argenis Fontalvo", "ReviewID": "R2F6FZJQ5DBH2H", "Overall": "5.0", "Content": "Excelente teléfono! se actualizó a la versión 4.2 solo, solo tuve que confirmar la actualización, muy bueno aunque aveces se descontrola, por ejemplo que el escritorio aveces se rota con el teléfono cuando tengo esa opción deshabilitada.", "Date": "January 2, 2013"}, {"Title": "excelente", "Author": "D. Torres \"liz\"", "ReviewID": "RJUM2GBKJMZ2V", "Overall": "4.0", "Content": "es mi primer telefono android despues de haber tenido un BB; para quien este acostumbrado al touch estaran encantados, para mi el unico problema es el volumen que alcanzan las cornetas, es muy poco en comparacion a mi telefono anterior; no pareciera Sony; por lo demas es excelente.", "Date": "December 29, 2012"}], "ProductInfo": {"Price": "$699.99", "Features": "Network: GSM GPRS/EDGE 850, 900, 1800, 1900; UMTS HSPA 850, 900, 1900, 2100. Internal phone storage: 16 GB, RAM: 1 GB.\n8 megapixel camera with LED flash and Auto focus\nWi-Fi and Wi-Fi Hotspot functionality, HDMI Support, aGPS, Bluetooth technology, NFC\nTrackID music recognition, xLOUD Experience, FM Radio with RDS, 3.5 mm audio jack, Motion gaming, Clear bass and clear stereo\nDisplay: 4-Inch, 960x540 pixels 16,777,216 color TFT; Reality display with Mobile BRAVIA Engine; Scratch-resistant, shatter proof sheet on mineral glass; Capacitive touchscreen with on-screen QWERTY keyboard; WhiteMagic technology", "Name": "Sony LT22i Xperia P Unlocked Android Smartphone NXT Series with 4-Inch Reality Display, 1Ghz Dual Core, 8MP Camera, 16 GB Memory - No Warranty - Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/410baYjpfuL._SY300_.jpg", "ProductID": "B007P1G33K"}}