{"Reviews": [{"Title": "Motorola W755 Cell Phone for Verizon", "Author": "Barb", "ReviewID": "R20VWU02LFCVQR", "Overall": "5.0", "Content": "My second Motorola W755. Ideal small purse/pocket size and light weight. Clear screen and great options with buttons, not touch. New in box, older model phone AND the battery is excellent! Perfect for those of us who want to keep the flip phone.  Very happy with this phone.  Love it!", "Date": "August 30, 2012"}, {"Title": "Excellent quality basic flip phone", "Author": "Sammi", "ReviewID": "R27SH0XJL6CZX0", "Overall": "5.0", "Content": "This has got to be one of the best flip phones ever made.  We got this phone when it first came out about four years ago and it kicks butt when compared to most of the basic flip phones available today.  It is solid, well made and sturdy.  The voice clarity is crystal clear and as a nice bonus it takes surprisingly good pictures and videos.  Our phone still has the original battery and has no problem whatsoever holding a charge.  If you are looking for a great quality flip phone that is dependable and will hold up over time, you can't go wrong with this one.", "Date": "October 13, 2012"}, {"Title": "what i wanted", "Author": "Cameron Babineau", "ReviewID": "R2B2Q5I5Q5XDXW", "Overall": "4.0", "Content": "what I wanted it just sucks about the not being able to9 get new apps thing anyways what I ordered and on time", "Date": "July 19, 2013"}, {"Title": "Satisfying and Simple Sophistication", "Author": "L. Henderson \"His Kagome\"", "ReviewID": "R1BVIFZJ9KUI29", "Overall": "5.0", "Content": "I bought the Motorola W755 to replace a smart phone on a line that was barely used. I wanted something basic with a camera and this was the perfect choice. The phone has a beautiful design and better than I expected. I arrived quickly and I am quite pleased. I highly recommend this phone for someone that just wants a basic phone.", "Date": "July 8, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "1.3 MP camera with 4x digital zoom\nCreate and manage playlists with Windows Media Player 11\nStereo Bluetooth wireless technology\nVCAST Video to download or stream video in news, sports, entertainment and more\nmicroSD card memory port with up to 4 GB support with an optional memory card", "Name": "Motorola W755 Cell Phone for Verizon (Blue) Camera - MP3 - No Contract", "ImgURL": "http://ecx.images-amazon.com/images/I/41UTZnKZwnL._SY300_.jpg", "ProductID": "B007W5V9ME"}}