{"Reviews": [{"Title": "Better than expected", "Author": "Gabrielle Pace", "ReviewID": "R40IB3GWEXFA1", "Overall": "4.0", "Content": "I honestly expected the worst, but I was pleasantly surprised. I ordered the phone on a Thursday and it arrived Monday morning so kudos for the fast shipping. This was my first experience buying a phone online. The phone was listed as in very good working condition and I do agree. There are several minor scratches on the front and back but they're light and 3 or 4 at the most. However, I was disappointed that it was not listed that the phone didn't come with a SIM card. I'm not sure if that's common knowledge or not, but for those of you who are unaware. I ended up going to Sprint who sent me on a wild goose chase to get one from Apple. Apparently, a SIM card is something you should receive from your phone carrier. Again, for those who do not know. But so far, I am satisfied with this product and the seller.", "Date": "May 13, 2013"}, {"Title": "What I Needed!", "Author": "John Jaramillo", "ReviewID": "R1IAQGBSWWKH8M", "Overall": "5.0", "Content": "All I can say, that the 32GB memory is just what I need for pics, music, movies, and apps!  Just awesome!", "Date": "December 10, 2012"}, {"Title": "Like brand new!", "Author": "Selita", "ReviewID": "R3BV4XF1AZO5OO", "Overall": "5.0", "Content": "The phone came in great condition; it came just as described but better. I had a couple problems ordering other iPhones on Amazon but I ordered this one and couldn't be happier.", "Date": "April 12, 2013"}, {"Title": "Great buy, just what I expected.", "Author": "FreddyGee", "ReviewID": "R3BDLNTZUT6S1S", "Overall": "5.0", "Content": "I was looking for IPhone 4 and I got a good deal with this buy. Excellent phone. Got it late, but was worth it.", "Date": "March 17, 2013"}, {"Title": "Great phone!", "Author": "Raw Foodie", "ReviewID": "R12JFOY0YFYJJZ", "Overall": "5.0", "Content": "I had a problem with my phone when I received it.  I contacted the seller and they called me within 30 minutes and made everything right.  I couldn't be happier and the phone works beautifully.", "Date": "April 30, 2014"}, {"Title": "Exactly like a new unit", "Author": "Dye Junior", "ReviewID": "R2SL2KLMNQPKJZ", "Overall": "5.0", "Content": "This might as well have been a brand-new iPhone. It was in perfect condition and came in the same packaging with the same accessories as a new unit. Bought for my wife to use with Ting and we'll be in the black versus a contract plan in under 6 months.", "Date": "March 15, 2014"}, {"Title": "Wonderful purchase", "Author": "Belle Poppenberger", "ReviewID": "R1JMOZM5BWL3J3", "Overall": "4.0", "Content": "This phone shipped quickly, was in excellent shape and works perfectly.  The only reason for being one star short is that the MSID number on the box and the one on the phone were different.  This caused a huge problem with activation, but the seller was very helpful when I called him.  If we had not used the code off of the box it would never have been a problem!", "Date": "February 15, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "iPhone 4S\nSize 32 GB", "Name": "Apple iPhone 4S 32GB (White) - Sprint", "ImgURL": "http://ecx.images-amazon.com/images/I/41ua5HiV45L._SY300_.jpg", "ProductID": "B0074REVF2"}}