{"Reviews": [{"Title": "Great seller, great phone!", "Author": "DangerBabyDanger \"BeAt ChiC\"", "ReviewID": "RAMAQGSUIN46A", "Overall": "5.0", "Content": "I am new to smartphones, but I researched for awhile before choosing this.  Does everything I want it too and its great with multi-tasking as far as I can tell.  This is a great deal with the one month free unlimited plan that is included.  So you are getting a new phone for $50 basically!", "Date": "June 14, 2012"}, {"Title": "Satisfied", "Author": "Baynes500", "ReviewID": "RSKHSJYL0FFJA", "Overall": "5.0", "Content": "I was amazed that I received the product so fast and my 19 year old grandson loves it.The price of the phone with one month service plan was unbeleivable.Such a great deal and great price.I am so satisfied.", "Date": "August 8, 2012"}, {"Title": "Dont like", "Author": "charmaine lewek", "ReviewID": "R19UV8EBID1DG7", "Overall": "1.0", "Content": "I have had this phone 1 month and the phone turns off by itself and the screen freezes all the time...i feel it was a hundred dollars down the drain", "Date": "November 25, 2012"}, {"Title": "Net10 LG Optimus Net No-Cotract Touchscreen Prepaid Cell Phone with Unlimited Calls and Data", "Author": "Michael Horstmeyer", "ReviewID": "RZFH0QGEMMWI4", "Overall": "5.0", "Content": "I have had the phone for about 5 weeks and love it. I upgraded to this phone from an LG pay-as-you-go flip phone with only calling ability. I wanted to have Internet service....to browse, check email, gps, google maps, etc. The service I feel makes it worth the $50.00 a month ( $45.00 with auto-refill ) Is the unlimited mobile data. For the people not having knowledge of what the advantage of unlimited mobile data means I will explain. Most of my friends have some brand of Contract phone service. This includes high dollar I-Phones, etc. Contract phone have different monthly fee's based on how much mobile data they want to pay for. So you see them always trying to find a hot spot for free internet to browse, email, etc. They do not want to use their mobile data and exceed their limited time or minutes or they are charge extra. I do not even turn my wifi on ( just more drain on battery ) and I do not need it. This also means unlimited Texting. Hope this helped!!!", "Date": "February 1, 2013"}, {"Title": "Lg Optimus 2", "Author": "dougefresh", "ReviewID": "R1MU822N6AL77S", "Overall": "4.0", "Content": "Had phone for two years with no problems. For the discounted price you couldn't get a better phone and I did a lot of research on it", "Date": "December 15, 2013"}, {"Title": "some phones malfunction be aware", "Author": "isaac rodriguez", "ReviewID": "R2RFP9WID46QCP", "Overall": "3.0", "Content": "i chose this rating because i have this phone and it worked great but as soon as i ordered a phone for a friend this phone acted up as soon as she downloaded the app for games memory storage is limited and will start to malfunction if theres is too much dada on the phone but otherwise if your a problem solver u will be happy if ur not a problem solver stay away also u run out of service after 30 days when some months have 31 days all in all its an ok phone for the money if ur a senior citizen and dont know much about  these types of phones stay with the conventional flip phone its your best bet", "Date": "April 28, 2013"}, {"Title": "Net10 LG Optimus", "Author": "Tammy Burchell", "ReviewID": "R33M6EFS0JRWBA", "Overall": "4.0", "Content": "I gave this product 4 stars because it was EXACTLY what I was expecting, I'm very happy with the product itself, and would recommend it to anyone looking for this kind of phone and service.", "Date": "December 31, 2012"}, {"Title": "Nice", "Author": "Keshia Odom", "ReviewID": "RK0QEN0SNQ6V9", "Overall": "4.0", "Content": "Bought this for my 13yr old... Good first phone does just what I expected he's very excite to have a touch screen phone", "Date": "December 21, 2012"}, {"Title": "affordable entry level smart phone", "Author": "Charles G Peterson", "ReviewID": "R1NLY1TO8PT4IH", "Overall": "5.0", "Content": "This is a very functional entry level 3G smartphone at an affordable price.However the battery must be charged almost daily and the screen size is a little bit small for my far-sighted vision.I will probably purchase another phone with a larger screen in the future.", "Date": "December 9, 2012"}, {"Title": "Bad Service", "Author": "Issy", "ReviewID": "R319A59YCQFUDG", "Overall": "2.0", "Content": "I don't get service anywhere but main city places. Pretty lame, I don't recommend this phone to anyone. Net10 is great but buy a different phone.", "Date": "November 9, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007SNGW22"}}