{"Reviews": [{"Title": "Closest I could come to what I was looking for", "Author": "Uchi", "ReviewID": "R2MBV6MLPYZ8B7", "Overall": "4.0", "Content": "My preference would have been to stick with my old phone, but after 6 or so years of regular use, it died and had to be replaced, so I got this one a couple of weeks ago.I wanted another small-form, clamshell phone with a long battery life, good sound quality, and an alarm feature.This phone is slightly longer than the old phone, but thinner and narrower. The battery life is rated as about the same or better than the phone it is replacing, although I'm not sure yet whether the real-world battery life is as long as what was advertised. (I certainly don't have to recharge it every day, though.) It does include the alarm feature I needed. Sound quality is adequate, not great (I would rate the quality of the earpiece speaker at about 6 or 7 out of 10 stars -- very slightly garbled voices at times, not perfectly clean and crisp, and it's necessary to work to position the phone just right to get the best volume at your ear). Mobile phone signal reception seems as good as the phone it was replacing.The main feature I miss is the absence of any window showing who is calling when the phone is ringing -- it's necessary to open the case to see who is calling. At least it is possible to adjust the settings so that the phone only answers a call when you press the accept button (the default setting is to answer as soon as the cover is raised).This phone's case is not as durable as that of the phone it is replacing, which had an almost rubberized feel to the case. I accidentally dropped the new phone last night on the garage floor, and the outside of the case shows a few tiny scratch marks already. The few times I dropped my old phone, it never showed scratches.It was also a pain in the rear to get the messaging and internet features activated with my carrier. Carriers provide lots of info on how to set up the latest smartphones, but virtually no info on how to set up those features on phones with older technology, like this one. The manufacturer's website provided no help whatsoever, since they apparently did not intend for this phone to be used by US carriers. (The manufacturer's website does provide detailed info on how to set up this or very similar model phones for use on carriers outside the US, though.) It took several hours of internet searching, messaging, and calls to my carrier, but eventually I was able to get it all sorted out.I would have preferred a phone with US warranty, but Amazon was only selling the silver version of the phone with US warranty at the time of my purchase, while I wanted the black version (which came with no US warranty). So far, the phone I received seems to be working well, so I am not as concerned about needed warranty-type servicing.However, apart from the issues with setting up the phone for use with US carriers that I previously mentioned, another issue is that the phone I received did not include a US-type charger in the box; it came with a charger that seems to be a British-style plug (as I believe is used in Hong Kong, Singapore, Vietnam). Someone, apparently the seller opened the box to add a bulky adaptor to accommodate the foreign charger to US electrical sockets. I would much have preferred that the seller had simply added a US-type adaptor to the outer packaging (or, better yet, had added a regular US charger cord, instead of a non-US cord plus a large, clunky adaptor), rather than opened the manufacturer's original case, since in this age of widespread identity theft, there is no telling what security issues are raised once the original manufacturer's case has been breached. Buyers would feel more comfortable with their purchase, given all of that, if the description of the item in the ad mentioned that the case would have been opened to add an adaptor.Overall, I would purchase this phone again, but probably would opt for the US warranty phone, despite the color, next time.Update (March 31, 2013):  Phone has been working well. I dumped the original non-US charger/clunky adaptor and now just use a US charger that I had from a different piece of electronic equipment (obviously, using non-approved components like this isn't recommended, but there's no warranty anyway). Battery life is much longer than even with my old phone, so I am happy on that score. The only real, but minor, complaint now (aside from wishing there were a window showing who incoming calls are coming from) is that it would be nice to be able to raise the volume of the ear speaker higher. I find that with some callers I have to position the phone just right or it can be a bit hard to hear the caller clearly.", "Date": "February 12, 2013"}, {"Title": "so far so good...", "Author": "Zoraida Haibi", "ReviewID": "R16PG901FRVQ72", "Overall": "5.0", "Content": "I bought this phone for my husband since his other phone is completely obsolete and about 5 years old.  He started using it and already I am impressed with the phone.  He says he has to get use to the phone and the options, but he already stated he can hear everyone MUCH better and I can definitely hear him better too.  The volume for the music on his MicroSD card is fantastic and so glad it came with earpieces so he can now listen privately to all his music.", "Date": "December 22, 2012"}, {"Title": "Slick flip-phone", "Author": "Richard Wyckoff", "ReviewID": "R1B23P71WUUM1C", "Overall": "5.0", "Content": "I got these phones for me and my wife.  All we want is to talk plus I use the Calendar for reminders.  Also look forward to getting local SIM cards when we travel abroad.  This phone is great:  nice big clear display and really good battery life.  I have a pre-pay plan so can't take advantage of the data possibilities.  Highly recommend.", "Date": "December 12, 2012"}, {"Title": "What I expected and more", "Author": "Miglena Marinova", "ReviewID": "R98N01BCC64T1", "Overall": "5.0", "Content": "I have been using this phone for a week and the battery is half full!I am pleased with the functionality and the design. It is not a smart phone but that is exactly what I have been looking for.. tired of all 'smart' phones being everything else but not phones.Wont be disappointed if you like/prefer old style phones (like me).", "Date": "December 30, 2013"}, {"Title": "EXCELLENT PRODUCT, I WAS VERY HAPPY WITH IT !!!!!!!!!", "Author": "transitranger", "ReviewID": "R8BKACJ6NYOIN", "Overall": "4.0", "Content": "EXCELLENT PRODUCT, I WAS VERY HAPPY WITH IT until it suddenly stopped working about a month after I got it, But they were very good about letting me return it for a full refund !!!!!!!!!", "Date": "April 16, 2014"}, {"Title": "Samsung GT-C3520BLK Unlocked GSM Cell Phone with Camera, Bluetooth and FM...", "Author": "HaiL.", "ReviewID": "R1CFA93PBG40EU", "Overall": "5.0", "Content": "Bought this cell phone for my wife. She loves it. It has the needed features + design + the battery does not need charging for days. I recommend it.", "Date": "January 20, 2014"}, {"Title": "bluetooth does not work", "Author": "F. E. Belluso", "ReviewID": "R2CGVDL9I4HHUC", "Overall": "4.0", "Content": "i like this phone just fine. except the bluetooth doesnt work.. i have several bluetooth device's and this phone cant find them...other then that its a good cell phone. oh one other thing  the charger for this phone is a piece of junk. not up to samsung standards.  its a European type charger with a real flunky adapter so one can use it in the usa.", "Date": "January 8, 2014"}, {"Title": "Performed as Expected", "Author": "Lethifold", "ReviewID": "R39N6OTPVDCKTG", "Overall": "5.0", "Content": "This phone performs well, has nice large buttons and an easily navigable menu. It is a bit large for a cell-phone, but perfect for someone who likes to have an actual phone in their hands when speaking and not a computer.", "Date": "December 28, 2013"}, {"Title": "awesome", "Author": "Sergei Shelukhin", "ReviewID": "R2A8D052UQQ12G", "Overall": "5.0", "Content": "This phone is epic, very good if you like flip phones that you can flip with one hand, and if you like tactile feedback. The case is really pleasant to the touch and the keyboard is superb, I want to type stuff. The battery lasts forever. It's pretty big when opened, little bigger than you'd expect e.g. after Razr. One small problem is that I cannot seem to find the setting to automatically sync time with network.", "Date": "November 12, 2013"}, {"Title": "Arrived with faulty speakers", "Author": "Phil Baker", "ReviewID": "R2C8S3J7ZWAK57", "Overall": "1.0", "Content": "I bought this to use in Central America. The box looked old like it had bounced around or been sitting in a warehouse for ages - and when I powered it up there was no sound - no ringing no radio etc - I had to pay $25 to fix it in Costa Rica as I did not power it up until I arrived there - The products seems suspicious to me...", "Date": "February 8, 2014"}, {"Title": "Would not buy again", "Author": "LC", "ReviewID": "RHQE97VJAGRP1", "Overall": "2.0", "Content": "This phone is okay, but I do have some major gripes1) Don't purchase this phone if you text moderately (10-15 texts a day). I wouldn't say this if the T9 utilized a good dictionary, but the onboard dictionary is incredibly poor and also seems to be set to German. I haven't been able to find an option to change the dictionary, and so the texting experience is very frustrating. If you don't mind pressing the \"1\" button 3 times to get to \"c\", then this may not bother you.2) The speaker and speakerphone are both poor, even with the volume settings high up. I also found that the people I was speaking to had trouble hearing me at times, even when I had full reception.I bought a flip phone to text and make calls. This phone does neither very well.", "Date": "April 25, 2014"}, {"Title": "Very good product", "Author": "maame k.", "ReviewID": "R1JVLBT06SG27C", "Overall": "5.0", "Content": "So I put my simple mobile SIM card in this phone and it was on the way...haven't had the time to set up anything about the internet tho, actually cos my mom wouldn't mind and the other setting didn't give me a hard time, not at all...It came unlocked as described and it's very cute......The phone works very good and simple to use. My mom will love this cos just as I have...", "Date": "March 24, 2014"}, {"Title": "works", "Author": "Daniel", "ReviewID": "R3PPNEHVAY4ZV7", "Overall": "4.0", "Content": "Bought this for my mom. The phone works fine and it's really simple to use so i would recommend it for that purpose.", "Date": "March 20, 2014"}, {"Title": "Very Good", "Author": "Jinsik Cho", "ReviewID": "R3PVQE8XT54W8O", "Overall": "5.0", "Content": "I bought this for my parent who is not familiar with technology. I think this is a very good one for seniors.", "Date": "March 11, 2014"}, {"Title": "Top Notch", "Author": "luvmypup", "ReviewID": "R124VHAGN0ZUWL", "Overall": "5.0", "Content": "Thought I was  \"die hard\" Nokia user.  Turns out that the Samsung GT-C3520 is a great competitor.  The Samsung is well made - and feels sturdy.  I think I am going to like the update features and still feel comfortable with flip phone preference. Would recommend this phone to others - like me - who are NOT ready for a touch screen / speed of light phone with features that are way beyond my needs.", "Date": "March 2, 2014"}, {"Title": "Good Basic Phone Marred by Poor Design", "Author": "BlueCat", "ReviewID": "R2IWQX4AO4ZY6A", "Overall": "3.0", "Content": "Good: basic functions easy to use, good battery lifeBad: missing expected functions: exterior volume control, speakerphone only works when call is connected, Kies is pretty awful software.  Dealer, 24hrsDeals.com, offers NO warranty, unlike other 3rd party merchants hosted by Amazon (for same price).", "Date": "July 10, 2013"}, {"Title": "Excellent Phone", "Author": "Zee \"MZIA\"", "ReviewID": "R2OWRG7H5K6OIH", "Overall": "5.0", "Content": "Very good, and easy to use. I sent this back to Home country to use for my in law.No problem working with various carriers. ( Unlocked phone.I will recommend to others.", "Date": "June 20, 2013"}, {"Title": "Great", "Author": "Albertha Pegeron", "ReviewID": "R3V62MWX85IJQV", "Overall": "3.0", "Content": "It does everything I need it to do.  The size is perfect and I like that there is no screen on the outside to break.  Great item.", "Date": "April 6, 2013"}, {"Title": "Great clam shell (flip) phone", "Author": "rick parkinson", "ReviewID": "R1SBCNHVVURBNJ", "Overall": "5.0", "Content": "As I keep my phone in my pocket I love that it does not have any exterior buttons that can get accidently pressed, even the on screen ones, as my other phones did, even with the 'lock' feature on. I don’t know how many pictures of the inside of my pocket I have had to delete. And being a  clam shell phone the screen does not get scratched by keys kept in the same pocket.", "Date": "May 20, 2013"}], "ProductInfo": {"Price": "$149.99", "Features": "This unlocked cell phone will work on GSM carries like AT&T; and T-Mobile. Not all carrier features may be supported.\nUnlocked Quad-Band GSM Cell Phone compatible with 850/900/1800/1900 MHz frequencies and GPRS/EDGE data capabilities.\n1.3MP Camera with Autofocus and Smile Detection; MP3 and MP4 Player; FM Radio; Social Networking Applications; SMS, MMS, Email, Push Email and IM and Instant Messaging with Windows Live Messenger, Yahoo, G-talk, FB Chat and Samsung Messenger (MR).\n3.5mm Audio Jack; 2.4\" TFT-LCD Screen, 256K colors and MicroSD Card, up to 16GB; Java MIDP 2.0; Browser WAP 2.0/xHTML; 28MB Internal Memory; 2.0 High Speed USB; Bluetooth v2.1 with A2DP\nTalk time up to 9 hr 10 min - Standby up to 610 hours.", "Name": "Samsung GT-C3520BLK Unlocked GSM Cell Phone with Camera, Bluetooth and FM Radio - No Warranty - Charcoal Gray", "ImgURL": "http://ecx.images-amazon.com/images/I/51ABMQQ2OEL._SY300_.jpg", "ProductID": "B007N0RAXK"}}