{"Reviews": [{"Title": "Waste of Money", "Author": "deangelo", "ReviewID": "RPA291X2UBLPW", "Overall": "1.0", "Content": "Because the phone was break by the charger port an the speaker an microphone didnt work wish I had knew it before", "Date": "December 10, 2013"}, {"Title": "Go for the G2", "Author": "CJ muniz", "ReviewID": "RPFWVQMTJ1Q5V", "Overall": "2.0", "Content": "I was hoping to get the same features as the G2 but I was disappointed.The battery life is incredibly short and the software is outdated.", "Date": "August 7, 2013"}, {"Title": "Misleading: Defective Phone, NOT NEW", "Author": "Anabel", "ReviewID": "R32X006HZYRMF1", "Overall": "1.0", "Content": "I owned a G1 a couple of years ago when I was in high school. It worked great and has been BY FAR the best phone I've ever owned. Unfortunately, it got stolen and I browsed through each T-Mobile store to find it, but to no avail. Years later, imagine my surprise when I saw that it was on Amazon, at a great price, and NEW.I should've known better.The phone worked AT FIRST, but there were little things that wouldn't work:1) The QWERTY keyboard had some buttons that would type itself when I didn't even go near the letter in the first place (for example, I would press the letter \"a\" and the number \"0\" would join in after).2) The bluetooth wouldn't connect to other devices.3) The time kept changing and I would constantly have to set it.I decided to deal with the phone--they were no big deal for me. The G1 was my dream phone. A week later, though, it just wouldn't cooperate with me:1) The Home button wouldn't work2) The phone wouldn't ring or vibrate whenever I received a message3) The phone couldn't receive calls4) Whenever I'd click the red button to lock the phone, when I'd press a button, it would automatically go to the desktop screen rather than the screensaver5) It'd turn off randomly, even when I was in the middle of typing6) It wouldn't let me connect to wi-fi7) I couldn't get on airplane modeAnd finally, 8) One time when I turned my phone back on after it turned itself off, a music sound that I NEVER DOWNLOADED or the phone DID NOT OWN (was not in the files whatsoever) played on my phone, and the phone would not turn off until I removed the battery (even though I continuously held the red button)I went to the T-Mobile store TWICE just to get the phone fixed, and after both times, I would still receive the same problems I just listed above a couple of days later. I asked them if they could perhaps replace the phone with another in the store, but they said only Amazon could do it.Here's my advice: If you want to risk purchasing this phone, then I advise you to save your receipt and the box that it was stored in because of the possibility it may malfunction. The phone I had was defective, and in the end, wasn't worth it.", "Date": "June 4, 2013"}, {"Title": "Not worth purchasing", "Author": "Anthony", "ReviewID": "R30KQ5M2Q67IAI", "Overall": "2.0", "Content": "I needed a phone because my last phone broke and Tmoblie now requires a deposit before purchase. The first thing I noticed about this phone is the battery needs to be recharged after two phone calls. I've had phones that lasted longer and anyone who decides to acquire this phone should get an extended battery. The G1 phone is not worth purchasing considering it's been less than one month and two of the keys have stopped working and during an incoming call I have to wait for the call to go through and then call the number back because the answering button doesn't work.", "Date": "May 18, 2013"}, {"Title": "Great birthday present for my daughter", "Author": "Lana", "ReviewID": "R163JBFW0KITBZ", "Overall": "5.0", "Content": "Phone was great and my daughter loved it. It was exactly how it was descriped on the screen. Thank you", "Date": "February 20, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007AOKXZ6"}}