{"Reviews": [{"Title": "Motorola Droid 2 A955", "Author": "LadyofLakeSeminole", "ReviewID": "R3K6X3FEW6HD5W", "Overall": "5.0", "Content": "This is my first smartphone up grading from a Razor I've had for a few years,and I have been very pleased.  It does work wonderful with the Pageplus service, which is why I brought it.(No costly contracts) I also like the keyboard, enough room between letters not to hit two. The battery holds up well for me, I charge every couple of days. The delivery was quick and on time, it appeared to be a new phone as the ad stated. Overall this was a good purchase and a good experience.", "Date": "October 1, 2012"}, {"Title": "Very satisfied customer", "Author": "Susan Clopton", "ReviewID": "R2VW2UZLGVV8KT", "Overall": "5.0", "Content": "I bought this Motorola Droid 2 from Ross Cellular new and it appeared to be so. First off I want to say excellent cutomer service. I had a battery issue but didnt want to return the phone and I relayed this to Ross and the company sent me out a new one along with a new battery charger and a MicroSD card within two days. That was cool. This is really my first smart phone and I am quite pleased with it. I am using it with Page Plus and it works great with the 1200 Talk and Text plan with 100mg of data. Whenever I need the data I am able to turn it on and off easily. The only negative thing is the camera only focus's in macro but after getting on the Android sites this is a software problem I know I can solve. This phone gets updates OTA. I already been updated twice for the Android version. I highly recommend Ross for their excellent customer service and I do recommend the Droid 2 for the price and the ease of using this phone. I'd also recommend splurging for a few accessories like the docking station and the super car charger you can get off amazon.", "Date": "July 10, 2012"}, {"Title": "hate it", "Author": "brittany powell", "ReviewID": "R1IXR6E2FL9WA", "Overall": "1.0", "Content": "this phone sucks. i got it and 2 weeks later the screen blacked out. and i had to keep reseting it everyday", "Date": "June 26, 2013"}, {"Title": "Use of the phone", "Author": "Helen Brown", "ReviewID": "R3LLDU5446445M", "Overall": "4.0", "Content": "I chose this phone it had a 4 star rating and it was what I was looking for in a phone.And it was a good price. I love it;.", "Date": "June 26, 2013"}, {"Title": "Love it", "Author": "qtpie31719", "ReviewID": "R2GV7L5BIVE3IC", "Overall": "5.0", "Content": "Received phone as stated.Played around with phone before giving to my daughter and it worked great. has more options than my iPhone.My upgrade this month will be the Droid Razr.This is the second phone I have bought. I have two daughters and they both are enjoying the phone.", "Date": "March 9, 2013"}, {"Title": "Motorola droid 2", "Author": "Desert Girl \"Janet\"", "ReviewID": "R1AG57ELTHFE3C", "Overall": "5.0", "Content": "I really like this phone. It is easy to use even though I'm more familiar with Apple products.  I prefer a phone with a slide out keyboard which this one has. If I had a question about the phone online resources are readily available and very helpful. Especially the Motorola droid sites.", "Date": "January 30, 2013"}, {"Title": "Great phone at great price", "Author": "izzy706", "ReviewID": "RLYM74W7BU0OV", "Overall": "5.0", "Content": "Upgraded from a palm pre plus. This android phone works well, is sturdy, and android os works great. Would be better with latest android os.", "Date": "December 2, 2012"}, {"Title": "excellent value.great phone.", "Author": "thomasgiannetti", "ReviewID": "R1S39AMUHTG79O", "Overall": "5.0", "Content": "For the money your cant beat this phone.Excellent value.Great reception.Only draw back is the battery life.So I purchased and extended battery.", "Date": "December 3, 2012"}, {"Title": "Bad Item Indeed", "Author": "Linda Batson", "ReviewID": "R20AW0ZWY9E50W", "Overall": "1.0", "Content": "This item is a POS.  I've had nothing but trouble with it since I purchased it, and of course it only had a 30 day return policy.  What a joke.  I purchased it on Jan 26th and only had till March 2nd to return it.  So I've had to deal with this screwed up phone ever since.  Would NOT recommend it to ANYONE.  And with only a 30 day return policy, I don't believe I would ever purchase another phone or electronic item on line again.  Sorry.", "Date": "July 14, 2013"}, {"Title": "Broke phone", "Author": "damian blanton", "ReviewID": "R33GZGHWV4L6DT", "Overall": "1.0", "Content": "It dont charge they sold me a broke phone it wont turn on it very difficult not happy at all like to return it but i cant", "Date": "December 24, 2013"}, {"Title": "motorola droid2 excellent", "Author": "marion whiteside", "ReviewID": "R227EYWGIH5RKX", "Overall": "5.0", "Content": "very nice phone praise god and thank you so much...mjayfaith@yahoo.com we are enjoying this phone immensely thank you so much", "Date": "December 23, 2013"}, {"Title": "Did not work as advertised", "Author": "Peggy P.", "ReviewID": "R3LL69C3BLKC0B", "Overall": "1.0", "Content": "This phone was advertised to work with PagePlus and it did not work for us here in Colorado.  We had to return it after spending many hours on the phone with PagePlus and finally coming to the conclusion that it was the phone and not the service.  My son, who lives in Rochester, NY purchased the same phone to use with Page Plus and his works fine there.", "Date": "December 19, 2013"}, {"Title": "Great product!  Love my droid.  Cheaper than insurance", "Author": "Robert E. Harrison", "ReviewID": "R286VE22YQFVW5", "Overall": "5.0", "Content": "it is works great and meets my expectation!  Has lots of memory and I am used to the interface.  I buy an extra one instead of insurance.", "Date": "December 2, 2013"}, {"Title": "It will betray you.", "Author": "Self", "ReviewID": "R25BSAYEF5ISRE", "Overall": "1.0", "Content": "I bought this hoping for a cheap, minimal smartphone.  What I got instead:-- a phone that appears to turn off its own ringer (a single-swipe operation when the phone is locked)-- a phone whose screen has accumulated microabrasions that now look like glaucoma-- a phone whose microphone abruptly stopped working (apparently an internal grommet is dislodged into the air canal)-- a phone whose \"alarm\" functionality is unbelievably bad:  the alarm unlocks the phone, then your first touch of the phone (e.g. to take it out of your pocket) puts the alarm on snooze and takes it off your screenThis phone is the worst of both worlds:  not simple enough to operate reliably without studying the manual, and not powerful enough to be worth studying.", "Date": "November 1, 2013"}, {"Title": "LIKED it & PagePlus Cellular for 6 months...THEN IT DIED!", "Author": "dayclean", "ReviewID": "R9OUFKHSKYR1J", "Overall": "1.0", "Content": "I really liked this phone when I got it. It worked will on Verizon via PagePlus Cellular. It worked WAY better than my last 2 LG smart phones.........THEN 6 months after I got it, the touch screen SPAZZED OUT and pressed keys and made calls on its own. The bottom right corner buttons never worked well and at 6 months they stopped working entirely. This phone is still far too expensive to have to ditch and buy another after only six months. I will never buy a Motorola product again!", "Date": "October 11, 2013"}, {"Title": "Great phone, though outdated", "Author": "Dan P.", "ReviewID": "RBT404VD2UPJZ", "Overall": "4.0", "Content": "Works great. No complaints. Word of caution though. Many apps, including Android Marketplace, are so far removed from current apps they are no longer updatable. This doesn't bother me though, as I don't need it to say Google Play for my Google Music, Books, and other stuff to work. This device came in great condition and has served me well. I'll keep using it until it dies.", "Date": "October 9, 2013"}, {"Title": "When it works, it's okay.  But that isn't a lot.", "Author": "Joe", "ReviewID": "R11FLTLZ7UHWD8", "Overall": "2.0", "Content": "I bought this phone brand new.  4 days after I got it, it would start \"freaking out\" for lack of a better phrase.  Usually, locking it then unlocking it solved it.  Fast forward a week.  it does this more often.  Not responding to my presses, clicking things at random, calling, etc.  It took a lot more locking/unlocking to get it back to normal.  fast forward another week, and it's now a paperweight.  Literally every time I unlock it, it goes \"berserk\" if you will.  I tried bringing it to the Verizon store, but they said all the phones did this, and that it was a tech problem, and that I was stuck with it.Now, it's all I can do not to throw this junk out the window, it's so frustrating.  When it works, it was alright, which is almost never.Don't waste your money.", "Date": "September 19, 2013"}, {"Title": "Okay", "Author": "jen7571", "ReviewID": "R2TZNZLQ3B6W40", "Overall": "3.0", "Content": "Droid isnt the greatest. Would restart itself at least once a day for no reason. Sound would work sometimes then sometimes it wouldnt. Was a somewhat okay phone until it got dropped. Then didn't work anymore. Be nice if they made them better...more durable.", "Date": "August 13, 2013"}, {"Title": "Great Phone", "Author": "Shelly", "ReviewID": "R4KAYI5AG6426", "Overall": "5.0", "Content": "The phone has been great it was actually new. I havent had any problems with it. Good battery life and great phone!", "Date": "July 24, 2013"}, {"Title": "First Smart Phone", "Author": "Kaitlin M.", "ReviewID": "RKU75IX2NAF22", "Overall": "4.0", "Content": "I like this phone so far because it's relatively intuitive and I figured most features out without having to google \"how to...\". The only problem that I have had so far with it is that the slide out keyboard doesn't work at all. I can't delete letters, and it double types or forgets letters, and if it doesn't recognize a word it won't allow you to type any farther. Luckily the touch screen keyboard works fine.", "Date": "June 21, 2013"}, {"Title": "Phone quit working.", "Author": "Kyle A. Williams", "ReviewID": "R19CYH8S457P44", "Overall": "1.0", "Content": "Phone worked good for less than a few months then spazzed out for no reason and wont work at all. Dont buy!", "Date": "June 20, 2013"}, {"Title": "I love my Droid 2....Its great value for the price....", "Author": "Florence Kaplan", "ReviewID": "R3C0IKNITJAP7V", "Overall": "5.0", "Content": "Be careful to turn off data or it wil cost you a lot, especially if you have to pay of each megabite....The phone is very nice and I would recommend it to whom ever is considering buying it.  It does not come with a sd chip so you have to add one if you want to take photos or videos.  It takes a little getting used to but it is delightful. The apps are awsome...", "Date": "June 13, 2013"}, {"Title": "Broken upon delivery!", "Author": "L. Summers", "ReviewID": "R1AKRP3RRVRP8D", "Overall": "1.0", "Content": "The keyboard didn't work, the phone didn't ring, the touch screen seemed to have tourette's, and the last contact list it retrieved was from 1992!  Awful!  Sent it back...prompt refund was great...switched to Ebay and my Droid 3 was 40 bucks cheaper and works GREAT!!!", "Date": "June 8, 2013"}, {"Title": "it works", "Author": "D. Brown", "ReviewID": "RUGZBB8UBBIW2", "Overall": "4.0", "Content": "like the phone, some software issues have already started but for what i use it for and the frequency of use its fine to deal with", "Date": "May 26, 2013"}, {"Title": "was not happy with this phone", "Author": "williamz12", "ReviewID": "R1PXA8CN2OGZ7P", "Overall": "1.0", "Content": "from the day i goy this phone it was problem freezing up all the time. then when the screen goes off the it won't come back on, its got good reception, but avoid dropping it it chips very easy", "Date": "May 10, 2013"}, {"Title": "the is a great phone", "Author": "nailman", "ReviewID": "R228GNT0BPH8LB", "Overall": "5.0", "Content": "this is a great phone,it has more things in it.To tell you the truth,i don't know if ill ever know everything in it", "Date": "April 30, 2013"}, {"Title": "Love my new phone!", "Author": "Nikki Williams", "ReviewID": "R30EKNKPQ3HD5J", "Overall": "5.0", "Content": "I received this phone a few days ago and I absolutely love it!  It is gonna be a huge asset to my small business.", "Date": "April 25, 2013"}, {"Title": "Purchased for my page plus plan", "Author": "J. Arsenault", "ReviewID": "R10CAEAM3Q3F9P", "Overall": "3.0", "Content": "Registering the phone with page plus cellular was very easy (I had worried, needlessly, that it wouldn't be compatible).  Unlike some sellers mentioned in other reviews, Oakland Wireless did NOT include a memory card in the phone.  Never having had a phone that accepted memory cards and not realizing the SD card wasn't in the list of included accessories, it took a while, with no help from Oakland wireless (but they did respond quickly to me emails asking for help), to figure this out.  The pictures on how to insert the card were clear but it wasn't obvious to me what the SD card looked like installed). Installing/removing it is easy. I downloaded the manual from Motorola but mostly haven't used it.  Maybe reading it would allow me to move some of the icons to other 'pages' of my screen and/or remove some I would never use.  I can only reposition them within the same visual portion of the page.  At this time I'm not using it for internet access (but bought the phone should I one day want to).  The camera quality is pretty poor - 6 pixels, as I recall, isn't sufficient for a decent picture.  I don't use the keyboard because the logical one, with the camera turned sideways, has been fine (but the tiny keyboard is not fine at all for my fingers).  The phone arrived very quickly; probably at the beinning of the arrival timeframe, in fine condition.  It's heavier than some of my friends' phones; that's probably due to the keyboard.  Sound quality is ok. I don't use it often and keep it in sleep mode most of the time. It holds a charge for about 2-3 weeks.UPDATE JULY 2013: After several months, I find the phone ok, nothing special.  The scrolling on the touch screen is 'too fast' for my klutzy fingers.  BUT the biggest problem with the phone - I am on a prepaid plan (I pay for each minute):  It is VERY difficult to end the call, and I often pay for an extra minute of time.  I have pressed the end-call button, held it down, pressed multiple times, contemplated throwing the phone against a nearby wall, and have even exited that screen to put the phone into sleep mode (effective but a big pain).  Ending the call is a capricious enterprise. Also, turning the phone on and off is a bit difficult - the button is small and seems recessed.2nd UPDATE Nov 2013.  I seldom use the phone.  Last week the battery stopped holding a charge and would only charge to 60%.  A battery store person said that because it would only charge to 60% the problem isn't in the battery. The phone's charge did hit 0% charge at least once (lack of use and interest). I'll be ordering a new battery just to be sure (if turns out ok, it will be a backup), I've purchased a different phone as I'm heading out of town in 2 days and need it for the trip. I did prefer the touch screen to the keyboard after a while.", "Date": "April 24, 2013"}, {"Title": "poopy", "Author": "jena", "ReviewID": "R3R0ZZHJWOE4S1", "Overall": "1.0", "Content": "this phone had lots of problems, couldn't keep in running for four hours. Shut off on its own all the time, wouldn't receive calls or texts. I was very unhappy with this product.", "Date": "April 10, 2013"}, {"Title": "good price for what it offers", "Author": "J. JIN", "ReviewID": "RDWTBN9W1IWOW", "Overall": "4.0", "Content": "The only complain is the battery life is terrible.  Other than that, it offers all the functions I need.  I recommend it to anyone who wants an inexpensive uncontracted smartphone.", "Date": "April 8, 2013"}, {"Title": "just what i wanted!!", "Author": "omar", "ReviewID": "RIE3QVOC8ZAP3", "Overall": "4.0", "Content": "I really like the phone. it was what i wanted and everything came with it, such as the charger ,earphone.very nice product I would defenelly buy more stuff from this seller!!!", "Date": "January 11, 2013"}, {"Title": "love it", "Author": "whatupfool", "ReviewID": "R2OX02AC7DSVOZ", "Overall": "5.0", "Content": "got here fast it was what i order i would shop there again 1 2 3 4 5 6 7", "Date": "January 3, 2013"}, {"Title": "Good Buy!!", "Author": "Brenda \"BCS\"", "ReviewID": "R6IK62SNE3PYC", "Overall": "4.0", "Content": "I like the slide keyboard better than the touch screen keyboard.  Really good phone.A little heavy, but worth the difference.", "Date": "January 3, 2013"}, {"Title": "Droid review", "Author": "OBXannie \"OBXannie\"", "ReviewID": "R6C4VVVJRYX6S", "Overall": "3.0", "Content": "I wanted a new and affordable smart phone for my son. The phone arrived on time, was brand new and had all accessories. After going through at least a half dozen calls to Verizon, I eventually was able to activate the phone online. My son went to set up Facebook access on the phone, only to find it also downloaded the 100+ friends into his contact list. The majority of these friends do not have phone numbers on their accounts. He can only delete them one at a time. Few other minor issues, but he will wait for an I phone this summer.", "Date": "December 27, 2012"}, {"Title": "First smartphone", "Author": "Sarah", "ReviewID": "R1CNSOVNJL6UXO", "Overall": "5.0", "Content": "So far so good, this is my first smartphone and I like all that it offers. I have not experienced any difficulties and would recmmend it to anyone. My only disike it that it doesn't ave a long battery life but I do not have another smartphone to compare it to.", "Date": "December 14, 2012"}, {"Title": "Cool phone", "Author": "Douglas Oaks", "ReviewID": "R33HY3SBTPMC5Z", "Overall": "5.0", "Content": "I am still learning to use it but it seems to be a good phone for my 1st smart phone.", "Date": "December 10, 2012"}, {"Title": "Great Phone/Price//Delivery", "Author": "Doug Spickard", "ReviewID": "RGF77RKPQN3CX", "Overall": "5.0", "Content": "Phone works great as advertised and shipping was phenomenally fast.As long as I can stil get good deals like this it's hard to justify renewing my contract for 2 years just to get a phone!!!!!  This way I just get a different phone every year without worrying about ruining a grossly overpriced phone from my carrier.", "Date": "December 7, 2012"}, {"Title": "Awesome Phone", "Author": "Ribbitter \"Ribbitter\"", "ReviewID": "RP4XRUKHU8BRI", "Overall": "5.0", "Content": "I bought this phone for my grand-daughter and she loves it.  It was very easy to connect up to my carrier.  Thanks", "Date": "December 2, 2012"}, {"Title": "Works with Page Plus \"out of the box\"", "Author": "J. P. GRANT", "ReviewID": "R1A6V3TZODJF56", "Overall": "3.0", "Content": "I'm new to the world of smart phones, and I wanted an inexpensive way (cost about $135 at Amazon) to see if I even wanted to have one. And whether I could get by without a $100 monthly bill. Where I live only the Verizon system offers decent service. I didn't realize it, but you need to figure on buying a micro SDHC card, or this phone is pretty useless - like no camera function. Added about $28 to the cost for 32 gigs.So why do I give it only a 3? It works right away and that's a big plus. As a phone, it won't download my contacts to my 2013 Lexus, and the bluetooth connection keeps flipping on and off. But it has never cut off while I was talking. For very brief intervals I am unable to initiate a call or receive one. The manual is a .pdf only, and that is often not much help. The manual itself doesn't seem to describe my phone and its functions, it's more like it's for a series of phones and often not for mine. The Android manual for this software version is equally general but sometimes helpful. The phone keeps asking me which \"switch off\" option I want to select, and I have to keep pressing the \"go back one step\" icon to not switch off. Stays on when it's connected to the car. It's very unstable in Google Maps, and won't let me enter a destination with the onscreen keyboard. But the pull out physical keyboard does better.Page Plus (PP) service has been excellent and very inexpensive compared to Verizon. It's hard to figure out how to set up their service, but they have a reseller called Kitty Wireless which is fantastic. They walk you through the whole intricate process online. PP offers only prepaid service, but you can set it up with automatic renewals through Kitty that let's you dispense with the need to buy PIN cards each month. So it seems like a contract service, with the plus that you can't unknowingly run over your plan limits and can also terminate anytime.I am still learning the phone, so maybe I'll like it better in time. Otherwise, I'll wait till a later model phone is available at a reasonable price, and that works with PP.", "Date": "March 20, 2013"}, {"Title": "Great Phone, Great Price, Charger Issues", "Author": "Judith", "ReviewID": "R14IFBJF0ROPT9", "Overall": "4.0", "Content": "Bought this phone to replace my HTC Evo Shift with Sprint.  Never could get reception with Sprint and was paying a fortune, plus the phone software and updates caused repeated problems and cost me $99 a month.  Now I get reception, switched my 32GB sd microcard to the new phone, used backup pro app to save and then restore it everything without problem onto the new phone, set up Pageplus for $29.99 per month, ported my number in 3 hrs via Pageplus (you need your \"passcode\" from your current carrier which I discovered well hidden in my online Sprint acct access, so get it before you start the porting) and am good to go, get reception and saving hundreds per year.  Phone comes without (at least mine) a micro SD card (I had extras so no worries) and with an electronic charger.  You do not need to buy extras as my car and extra phone chargers from other brands work fine with it.  I like the weight and keyboard is an easier interface than the Evo.  Took me a few minutes to get used to the HTC vs. Motorola quirks, but all good in about 8 hrs total.This phone worked well until a few months ago when it refused to charge in my car.  Now the charger only works now and again.  Looks like just a matter of time until I will need to purchase a new one as it's now happy charging via the wall either.", "Date": "November 16, 2012"}, {"Title": "Droid 2", "Author": "G", "ReviewID": "R1VV7K966GCDYR", "Overall": "4.0", "Content": "The phone is ok,but I'm not as thrilled a I thought I would be with it.  I got my son the Droid X and my daughter the Omnia II and if I could return the Droid2 and get the Samsung Omnia II I would.  There is nothing wrong with the phone, I just wish I had picked something else. I like the Omnia because it has windows and I really need that feature...it also comes with a stylus which is really neat.", "Date": "October 29, 2012"}, {"Title": "Broke within a couple days", "Author": "Lynn Anderson", "ReviewID": "R1LUZSSNFKWPCZ", "Overall": "1.0", "Content": "If something is too good to be true, it probably is...The price was phenomenal, but within a couple days the on/off button no longer worked and I had to order a replacement and go a week with no phone.", "Date": "February 28, 2013"}, {"Title": "Awsome Phone", "Author": "Gegee", "ReviewID": "R1NCGIML1TKLFD", "Overall": "5.0", "Content": "I bought this phone for my husband and I ended up falling in love with it!!  I am so buying one for myself.  It is easy to handle and the features it has are great!  I would recommend it to my firneds and family and anyone who is looking for an inexpensive and easy to use phone.  We got the Verizon pre-paid plan for $80 a month, and so far so good, no problems with the internet use or anything else.", "Date": "December 10, 2012"}, {"Title": "phone did not work right after 2 weeks", "Author": "Brandon Miles", "ReviewID": "R1EHHOTJFH6GQW", "Overall": "1.0", "Content": "phone would not take a charge I thought It was the battery I took it to the store The personel told me there was a glitch in the phone im sending the phone back asap!", "Date": "January 17, 2013"}, {"Title": "motorola droid 2 cdma", "Author": "Linda", "ReviewID": "R2GICVH2853MHA", "Overall": "5.0", "Content": "great phone even better price has all the features we were looking for for the price we could afford to get each of us one and no contract", "Date": "October 17, 2012"}, {"Title": "Droid 2", "Author": "Taylor", "ReviewID": "R3FJ3H20EM2636", "Overall": "4.0", "Content": "phone is great, ive had it now for a long time, the only problem ive had from this phone is the qwerty keyboard doesnt function properly btu if your use to the screen its not a bad phone!", "Date": "February 11, 2013"}], "ProductInfo": {"Price": "$168.94", "Features": "3G\nQWERTY\nTouchscreen\nMP3\nAndroid 2.2", "Name": "Verizon Motorola Droid 2 A955 3G QWERTY Touch Android Smartphone Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/41GhYOCJIyL._SY300_.jpg", "ProductID": "B007QVADHQ"}}