{"Reviews": [{"Title": "Great phone!", "Author": "Nick Bridges", "ReviewID": "R1IPIOGY3IKZMY", "Overall": "5.0", "Content": "I wanted a durable simple phone to replace my smartphone. I am not a huge fan of smartphones. I just want a phone to do what a phone is supposed to do - call and text! This phone is straightforward and simple to use. The buttons are big, and are easy to push without pushing more than one at a time. It is a step above a plain phone; it has a calender and allows the creation of a \"to-do list\" - I don't use it, but I'm sure it would come in handy for someone. It's design is sleek and easily slips into my pocket. The back of the phone is metal, and so far has been goof-proof! It has already endured 2 drops. The entire bottom of the phone is a speaker. The speaker is loud and has a little bass to it. The two megapixel camera is decent, it's a little shaky - but that may just be me. The light show on it is pretty cool too. It gets good reception, and is loud and clear... a big problem I encountered with my iPhone. All-in-all I love this phone! If you're looking for a great flip phone that is durable and easy to use I would definitely recommend this product!", "Date": "February 22, 2013"}, {"Title": "I love the Nokia Mural", "Author": "shryco", "ReviewID": "RI9BJ1EXKOR24", "Overall": "5.0", "Content": "For starters, I love the Nokia product. I've tried other brands of cell phones and have kept coming back to Nokia. The Mural 6750 is quick and easy to learn with simple steps to get to menus. I love the calendar function as well as the To-Do function!!I love the fact that when I've missed a call or text, the phone color fades in and out! When I walked into the store to get my old one replaced (after 3 years, the speaker went out), the employees laughed and said it wasn't made anymore & tried to talk me into a SmartPhone. I'm not dumb but I didn't want or need (nor wanted to pay extra for a data package) a phone that is smarter than I am.I walked out of there with a different type of flip phone and couldn't stand it. I ended up on Amazon & purchased another Mural!! I just hope that when this one takes a dive, I can still get another one!!", "Date": "September 30, 2012"}, {"Title": "Great", "Author": "Amanda", "ReviewID": "R3N530XYLT08NO", "Overall": "5.0", "Content": "Its a heavy sturdy phone. I don't have to deal withe all the smart phone crap. Sleek design, everybody asks me where I got it.", "Date": "February 4, 2013"}, {"Title": "Wife loves this phone", "Author": "GRUMPY JIM", "ReviewID": "R13ZNPNQ2C87MZ", "Overall": "4.0", "Content": "I bought this phone as a replacement for another one of my wife's dead Motorola razor phones.Having gotten tired of replacing another Motorola piece of junk I decided to get her a phone made by Nokia because I have always had Nokia phones for myself and love their reliability and endurance.I was not sure what to expect with this phone due to the low sale price but I would do it all over again.This phone has great reception and clarity,and my wife likes the option of changing the color of the outside light.The only problem with it is the difficulty in latching the back cover properly,but at least it's made of metal unlike the cheap plastic found on many of the Motorola phones.The battery life could also be improved some but it's sufficient if you don't keep playing with the colored lights.", "Date": "November 2, 2012"}, {"Title": "The phone does not work", "Author": "Tara", "ReviewID": "R3ABJTEZ81EGVS", "Overall": "1.0", "Content": "This phone looks very nice and stylish but unfortunately the phone did NOT turn on so I had to return it.", "Date": "January 20, 2014"}, {"Title": "My views on this Nokia 6750 flip phone.", "Author": "Richard A. Ruble", "ReviewID": "R3I3TDY4PML76X", "Overall": "4.0", "Content": "Nice phone. I'm old school so don't need all the smart phone features as I would be lost anyway. It's a little tough to open as It is so skinny and kind of slippery like the old Motorola Razor, but all said It works nice sounds good, and the loud speaker works well. I was disappointed that It didn't come with a car charger, but again It's a pretty decent phone.", "Date": "June 16, 2013"}, {"Title": "Flip phone", "Author": "Michael", "ReviewID": "RSWS8WX06YX39", "Overall": "5.0", "Content": "I like the phone very much, it is like new. There were a few snags but everything was corrected in a very professional way.", "Date": "September 27, 2012"}, {"Title": "Pretty colors!", "Author": "Avid Amazoner", "ReviewID": "R2284LA4JC02TA", "Overall": "4.0", "Content": "Nokia flip phones are great and this one is really easy to use.  Only reason did not give a 5 is because the battery back cover has a button that moves so it falls off suddenly.  Of all the different brands of flip phones I have had, Nokia makes the best!  I tried a iPhone and took it back.  I only use a phone to talk on so this is perfect for me.", "Date": "June 10, 2013"}, {"Title": "My Opinion.", "Author": "THE BOX SMOKE SHOP, LLC", "ReviewID": "R2SDZXBRXYNBL2", "Overall": "4.0", "Content": "I really like flip phones, but after going to the LG NITRO, which is a smart \"ass\" phone. I can truly never go back. However, I did break my LG NITRO and while my insurance was replacing the phone I needed something to hold me over so I bought this phone. I truly only use this phone now if I break my smart phone. This is a good flip phone. The antenna compared to my smart phone isn't as good. Places where I get reception with my smart phone, I can't with this one! Which is the only reason why I have rated it a 4 star. I still prefer the old school RAZOR flip phones, if your going to get a flip phone that is. Otherwise I would recommend the LG NITRO, texting has never been easier!!!!", "Date": "April 16, 2013"}, {"Title": "Product did not hold up", "Author": "virginia patrick", "ReviewID": "R2ZX283Z2YF3QJ", "Overall": "2.0", "Content": "This phone was supposed to be a new phone,but it has stopped working completely. It was purchased on Jan. 3rd, 2014", "Date": "May 16, 2014"}, {"Title": ":(", "Author": "FERNANDO DE JESUS MUN304581", "ReviewID": "RBZ51EA2VGNUO", "Overall": "1.0", "Content": "When I read Unlocked I thought it was unlocked from factory but when I receive it, it seems that it's not, and I really need the phone and I'm not from the U.S., is you could send me the code to unlock the phone :(", "Date": "April 28, 2014"}, {"Title": "Quality as expected", "Author": "Amanat Dewan", "ReviewID": "RVK9YYXE8XRVE", "Overall": "4.0", "Content": "It  is running ok. No complain till now. I like it. People can buy it. I have good experience with it.", "Date": "April 22, 2014"}, {"Title": "no good", "Author": "awali", "ReviewID": "R39SY328IKM4SS", "Overall": "1.0", "Content": "that product just work for1 month only in my contry.....problem with the charge(battery problem)I don't no if anything we can do.....", "Date": "April 21, 2014"}, {"Title": "Telefono", "Author": "Belkis C. Camacho", "ReviewID": "R1QK4VZ8QO3VM", "Overall": "5.0", "Content": "Good day excellent attention when solving the problem that introduced me to phone Nokia Mural 6750 Unlocked GSM Flip Phone with Second External OLED Display, 2MP Camera, Video, Bluetooth, I am very grateful for the attention brought by you, I hope also solve every problem that comes your way to another customer who purchases in their stores. thanks", "Date": "April 17, 2014"}, {"Title": "LOVE IT", "Author": "dawn", "ReviewID": "R2PCMYWFLV9JVC", "Overall": "5.0", "Content": "I had one and it started acting up after years of use. I tried to buy one at my cell store and everything they sell is touch / flat screens. I love flip phones and this is my all time favorite. I am very happy and I will be so upset when I have to go to a smart phone. This is my second purchase of this phone I loved it so much", "Date": "February 4, 2014"}, {"Title": "MY FAVORITE PHONE EVER", "Author": "Tech toy lover", "ReviewID": "RHK39YYI1LFF6", "Overall": "5.0", "Content": "This is my second Mural because I love it so much. Yes, it does have its glitches but it's the best-non smartphone out there. Texts, takes nice photos and video, holds a removable memory card. The removable back plate is stainless steel but the rest of the body is sliver plastic.  I wish Nokia would make MORE phones available in the US for less than $500. I should buy like 5 of these so i can have one forever.It's only exterior flaw is the button that holds the back plate on where the battery access is. The button is easily moved out of place and lets the back plate fall off, but I know that about this phone and I check it all the time as I put it in my pocket. Easily doable considering how great this thing is.It's only operational flaw is, when your SMS texting Inbox/Sent box gets real full, the phone will crash when you try to \"delete all items by folder.\" So the workaround is to \"mark all,\" \"move to folder,\" then in the destination folder \"mark all\" again and THEN delete. Or, remember to delete messages when they stack up. Or delete groups of messages by marking 30-40 at a time. I think the phone's internal memory can't handle deleting more than 200 msgs at once.", "Date": "January 8, 2014"}, {"Title": "Great replacement phone", "Author": "Shari", "ReviewID": "RRQAGR1SK61FI", "Overall": "5.0", "Content": "The phone is working great!  My husband needed a replacement phone.  It has more features than he is used to.  I wish there was a Ghost Armour cover for the outside. I can see how much scratches he has made already", "Date": "October 31, 2013"}, {"Title": "No reception", "Author": "Mikhail Burash", "ReviewID": "R3PDG163Q7J5JP", "Overall": "2.0", "Content": "In the zone where old Nokia 6350 is showing full bar, this phone was jumping from 0 to 40%. Numbers and letters are not contrast at all.", "Date": "October 29, 2013"}, {"Title": "Missing some languages", "Author": "Fa_Fa", "ReviewID": "RXTU1LG413YBF", "Overall": "3.0", "Content": "Its unlocked ok but it dose not has all international languages like Arabic and Indian. It is not said that in the description. What I know that unlocked phone has many international languages and its expensive and its worth it", "Date": "October 19, 2013"}, {"Title": "Way past my expectations", "Author": "Cherie", "ReviewID": "R1ZPYX9CW7ASVD", "Overall": "5.0", "Content": "This phone looks better, works better and has more cool features than I hoped for.  Also, very, very, easy to use and navigate.  Ease of use is my top priority for a phone.  Only downside is no hard copy instructions", "Date": "September 6, 2013"}, {"Title": "Great and Simple!", "Author": "Yvonne Lapierre", "ReviewID": "R3143CVI0V9GCX", "Overall": "5.0", "Content": "Great basic phone. Ideal for elderly people who doesn't need or want smart phones. Small and beautiful phone at an excellente prize.", "Date": "August 27, 2013"}, {"Title": "It was in better condition than I expected", "Author": "Samuel", "ReviewID": "R2Q6R4MT07YDFL", "Overall": "5.0", "Content": "The phone appeared to be brand new even though it was advertised as refurbished.  I am very satisfied with the purchase.", "Date": "August 23, 2013"}, {"Title": "my nokia", "Author": "Pamela", "ReviewID": "RYCOM3U2EIUOM", "Overall": "5.0", "Content": "im old school hate the new phones out these days break to easy so of course I love my old school flip", "Date": "August 16, 2013"}, {"Title": "Great", "Author": "John", "ReviewID": "RDM0CABJHPKQ9", "Overall": "5.0", "Content": "good phone new I haven't used it yet but it look just like ny old one I bought it for a back up phone since my other one is on its last leg from getting dropped to much :)", "Date": "August 12, 2013"}, {"Title": "Old school, nice flip phone.....", "Author": "eb \"watch junkie\"", "ReviewID": "R1QFE80G69DQNW", "Overall": "4.0", "Content": "I have been carrying a Samsung Galaxy Note (first version) for about a year and a half.  All of the sudden I found myself missing the feel of a flip phone.  I still have my old Motorola Razor but I don't like the look of it anymore.  I found the Nokia Mural online and really liked the look of it.  Although the Mural was new back in '09, I still find this phone quite snazzy.  It is far from my Note, but that's why i like to use this phone from time to time.  It fits nicely in my pocket, it's very sleek looking, and it handles in my average size hand perfectly.  I like the fact that it uses a usb charging port just like my Note, plus it has a mini SD card slot for additional memory.  I love how the speaker is placed at the bottom of the phone.  I find when listening to music to have the volume placed about mid-way.  Having the volume at max makes it sound quite distorted.One annoying aspect is the push to talk (PTT) button.  It is placed right above the volume rocker and I accidently hit it quite a bit when first using this phone.  I DO love how the external display is hidden on the front of the phone.  I also love how the external display and a portion of the bottom is your entire indicator light, which my Note lacks altogether.  I will admit the external display is nearly impossible to see in the daylight.  I do recommend downloading Opera Mini Browser for your internet usage.  It's quite fast, when the phone isn't sitting there waiting to make action when trying to upload a webpage.Bottom line, if you're looking for a phone that has a ton of bells and whistles and is a smartphone or anything close to one....keep looking.  However, if you want a very simple flip phone that's very reliable and looks great, by all means get this phone.", "Date": "August 10, 2013"}, {"Title": "My mom loves this phone.", "Author": "Mohideen Khader", "ReviewID": "R2JH5CRQV704HF", "Overall": "4.0", "Content": "I got this phone for my mom who is over 65 and she is so not tech savvy. She likes the look of the phone and the easy menu options.", "Date": "July 7, 2013"}, {"Title": "Cell phone does not turn on", "Author": "Ivan Alcedo \"Ialcedo\"", "ReviewID": "RXXLK1Q7QRY6A", "Overall": "1.0", "Content": "The cellphone does not turn on, the battery is not the original from NOKIA and I paid for an item that not works", "Date": "June 18, 2013"}, {"Title": "Nokia Mural 6750 Flip phone gray", "Author": "Steve", "ReviewID": "RY3N82AAO08WV", "Overall": "5.0", "Content": "This is a well made phone it is unlocked and works very well in my duty in Afghanistan. I like the blue lights though I have no used for the extra features here but the phone is unlocked and this was number priority for me.", "Date": "December 28, 2012"}, {"Title": "A real hassle", "Author": "AJ", "ReviewID": "R186OUSBAVBHOM", "Overall": "1.0", "Content": "I can't truely review this phone because when it arrived it wasn't working. The phone seemed new, but did not come with a Nokia battery- seemed to have been an aftermarket model of some kind. The phone would not charge or turn on despite my best effort. Had to send it back. Not happy with this seller- they need to check if their product works before they send it out.", "Date": "July 9, 2013"}, {"Title": "Phone OK", "Author": "Charles Burks", "ReviewID": "R30V8RY3QD4HB2", "Overall": "3.0", "Content": "The phone works Ok.  I thought I had a problem with the phone, it was the sim card. I was just about to return it but change my mind.", "Date": "September 27, 2012"}, {"Title": "not working properly", "Author": "the bigo", "ReviewID": "R9TCZSZPNYV4R", "Overall": "2.0", "Content": "i bought this phone and cant use this phone. i think it maybe locked to a network even its suppose to be unlocked. i have been so busy am finally getting a chance to write my review on this", "Date": "October 16, 2012"}, {"Title": "Don't Buy!!!!!!!!!!!!!!!!", "Author": "Kim Jackson", "ReviewID": "RJ6L50MW7C7RL", "Overall": "1.0", "Content": "This phone does not work!!! I had to buy a new battery before I could even get it to turn on, and when I did finally did get it to work, I could not send or receive pictures or do anything else pertaining to the media center. ALL this phone is good for is calling.  What a joke!!!!!!!!!!", "Date": "September 16, 2013"}, {"Title": "Battery dies after a couple of hours!", "Author": "navi s jax", "ReviewID": "R2U0N8YBSA2GE", "Overall": "1.0", "Content": "The phone is defective on arrival. The battery dies after a couple of hours on standby. A total waste of money!", "Date": "December 21, 2012"}, {"Title": "poor", "Author": "lez", "ReviewID": "R2T319QDIELVG9", "Overall": "1.0", "Content": "poor qualitydo not reccomend buying this producthad faults and had diff back coververy tacky over all .", "Date": "April 8, 2013"}, {"Title": "Locked Phone", "Author": "Obialeke", "ReviewID": "RLMVGOXLBPS5Q", "Overall": "1.0", "Content": "Looks simple but it seems it requires decoding if one intends to use for other network other AT&T.I; can't say much now about this product because I've still not been able to decode it.", "Date": "April 15, 2012"}], "ProductInfo": {"Price": "$149.99", "Features": "2.2\" LCD screen\nexternal 128 x 160 pixel OLED screen", "Name": "Nokia Mural 6750 Unlocked GSM Flip Phone with Second External OLED Display, 2MP Camera, Video, Bluetooth, MP3/MP4 Player and microSD Slot - Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/51mszVXcyPL._SX300_.jpg", "ProductID": "B0076ML4LY"}}