{"Reviews": [{"Title": "Buggy", "Author": "Sn00ze", "ReviewID": "R1GNCLWUANDN4U", "Overall": "1.0", "Content": "When I was looking for a cellphone I was going to buy the Samsung Galaxy S3 at the time, but the salesman convinced me that this one was better because it had a better LTE coverage. Boy! have I regretted that decision for the following reasons:1) I had to pay $50 bucks. Galaxy was free.2) It's buggy, It crashes all the time, many times by itself. (I can just hear the phone rebooting from within my pocket)3) Wi-Fi is buggy. I have to restart the application/phone sometimes just to continue browising the internet, and of course while I do that, the Data-network kicks in downloading whatever it is I was trying to view. Effectively defeating the purpose of usign wi-fi.3) Its typing is slow and cluncky. I'm no fan of the iphone but the HTC Raider is not user friendly at all. Sometimes if you click outside of the keyboard area it will kick you out of it and browse to the first message you have saved of whoever your writing to. Leaving you with 1 of 2 choices. A) exit and go back to it as a draft, or B) scroll down your saved messages, all the way to the message you are writing. Hopefully you set it up for ie: 50 messages, because otherwise you will be scrolling through hundreds and hundreds of old messages... you get my point.4) Deleting apps is haard as f$%^. You have to go into 'applications' then go to 'delete applications' then you have to look for the application through pages of apps because they are not organized or categorized separately. Just all meshed together, and of course sometimes this won't delete your application after all that. Confused? you can imagine my frustration.5) Cannot delete apps that come with the phone, ie: twitter. You have to hardwire it to the computer and delete from there. Do you have time for that? Neither do i.6) Battery doesn't last (Very big and bright screen - could be a plus)All in all, annoying to navigate and operate. VERY buggy. Save your money and go get yourself a Samsung Galaxy.", "Date": "January 21, 2013"}, {"Title": "Great phone nice screen", "Author": "Mark V. Epelbaum \"Mordechi\"", "ReviewID": "RJ2UMMSJQWNYJ", "Overall": "5.0", "Content": "Very nice phone big screen lots of toys to play with crisp connection works super fast love the super fast WiFi connection. The battery life is pretty good lasts almost a full day on a single charge, great speaker phone. Using with my simple mobile sim card no contract required, I get it all $G internet unlimited calling.", "Date": "June 5, 2013"}, {"Title": "BEST PHONE I OWNED", "Author": "TECKELI", "ReviewID": "RFP2G097884XW", "Overall": "5.0", "Content": "GOT THIS PHONE FOR MY PREPAID PLAN AND WORKS GREAT . 4G SUPER FAST DEFINATTLY A KEEPER HIGHLY RECOMMANDED TO ANYONE", "Date": "June 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007RQJ1TG"}}