{"Reviews": [{"Title": "Very Good but Not Perfect", "Author": "Doggymcnuggets \"doggymcnuggets\"", "ReviewID": "R3C0UUS2MGXF1F", "Overall": "4.0", "Content": "I have had the LG Nitro for about 3 months now and have had enough time with it to weigh in with my opinion.  Couple of things to note - first, I use this with Straight Talk's prepaid monthly plan - unlimited everything for $45 through Walmart.  Second, it is operating on AT&T;'s network (Straight Talk has deals with AT&T;, T Mobile, and Sprint and will use one of those networks depending upon your phone and the area where you live).  Because I use Straight Talk, I am unfortunately limited to HSPA+ speeds and cannot comment on 4G speeds.  I knew this going in, and it's just a carrier limitation - not an issue with the phone.  In any case, I typically get 4.5mbs download speeds in my area and am happy with that, but 4G users will likely get much faster download rates.  Third, I immediately upgraded the OS from Gingerbread to Ice Cream Sandwich when I bought the phone, so everything in my review is based on the experience with ICS.First, the negatives.  The only potentially glaring issue with the LG Nitro is battery life.  In my experience I have to charge my phone every night minimum, and often times under heavy use I have to charge it during the day to keep it going.  I hardly every use WIFI because I have a good strong signal where I work & live with good data speeds.  I also keep GPS turned off unless I'm using the navigation features while driving, which mostly happens only on longer trips.  I keep my screen brightness around 30% most of the time.  In other words, I work hard to maximize my battery life.  Still, I find the battery life to be annoyingly short.  Most days under mixed use of lots of talk & texting, a moderate amount of web browsing, and a few short periods of gaming (maybe 20-30 minutes total) I can make it from the time I get up (7am) until I get home from work (6pm) and I might be down to about 20% or less - doing all I can to conserve battery life as mentioned.  I deal with this by having a couple of spare batteries charged & ready, and keeping a usb & wall charger on me all the time.  It works, but I'd love to feel more freedom maxing out my phone capabilities without being nervous that it will conk out if I do.  I've talked to friends with other Android phones and all of them complain about battery life too, some giving similar reports of their own experiences with their phones, but by most accounts the Nitro HD is on the weak end with battery life.Fortunately, that's the only REAL negative in my experience.  The design is very straightforward and perhaps plain, but that's a matter of taste and I like the low-key aesthetic just fine.  The build quality is good - lightweight phone but it feels solid and has survived numerous drops (though I do keep it in a minimalistic plastic snap-on case).  I've read complaints of the phone getting hot, but that has not been an issue with mine.  It can get warm around the top of the back of the phone depending on what features are being used, but never enough to seem problematic or disconcerting.  I have had some occasions where the phone freezes or resets, but those experiences seem to be caused by software programs I've installed and have so far been fixed by uninstalling the offending programs.  Other friends with different Android phones seems to have more issues with freezes and shutdowns that I do.Aside from battery life, I pretty much like everything else about the phone.  Call quality is very good, I can hear them great and they can hear me.  Speakerphone quality is also good.  No dropped calls aside from those caused by a loss of AT&T; signal when I drive through the boondocks.  The HD screen is wonderful - very crisp, very bright, looks as good as or better than any other one currently out there including the Retina display.  The camera is pretty good - takes very sharp pictures outdoors or in well-lit environments, but low-light shots aren't as strong (to be expected on a phone camera).  The video quality is even better.  The HD videos look really sharp with very fluid motion and surpass my Canon point & shoot camera's video.  Not a perfect camera but pretty darn good for a phone.  The dual core processor is quick and has no problem keeping up even when multitasking.  The touch-screen is responsive, though I am not a fan of typing on the virtual keyboard - but that's nothing to do with the phone and everything to do with my stubby fingers.  The LG interface is perfectly usable and very customizable.In the end your consideration of this phone ought to come down to battery use.  If you want a phone with stellar battery life, keep looking.  But if you are generally within reach of a charging source when you need it (like me), or if you use your phone mostly for talk & text with lighter reliance on web, GPS, etc, then this is a great choice.  Quality build, good camera, incredible screen, capable processor - lots to like here & definitely worth considering.", "Date": "December 13, 2012"}, {"Title": "Excellent features but with some serious flaws.", "Author": "Josh Rochester", "ReviewID": "R3HCF5I8P7A9ZB", "Overall": "2.0", "Content": "As others have commented the phone has an excellent display (one of the best out there), super fast processing, great call quality, great built in camera, and the ability to multitask quite well.  This phone was seriously ahead of it's time.  Taking the phone out of the box I immediately charged it as preferred.  Within 30 minutes of using the phone afterwards, it shut itself off.  Mind you this is a fully charged battery.  I tried to turn it on, no success. Waited about 5 minutes, still no success.  Eventually after repeatedly trying after a few more minutes I was able to get it to turn on.  Alarmingly I saw a red haze around the screen that would not go away.  It was as if it was burned into the LCD screen.  I restarted the phone and then it was gone after reboot, it never came back.  An hour later the phone starts to vibrate then turns itself back off.  I try to power it back on and with no luck.  I looked up this issue online and I was amazed to see how many people were having this same issue.  It turns out that this was a common issue with the LG Nitro HD.  Techs in the LG forums have posted that it was due to  either faulty batteries or that they tend to overheat as well with contribution to the big dual core processor.LG asks that you update all the software.  I updated the firmware as well as installed ICS 4.0 which made the phone run a lot smoother and seemed faster.  I felt confident after running the phone for 2 hours without a glitch, until, it powered itself off again.  So about all you can do when this happens is take the battery out and put it back in every time, which to me is a hassle.  Also on a side note, this phone does get very hot.  Uncomfortably hot in my opinion for a hand held device and that cannot be good for long time use.  I adjusted various settings such as brightness to lower settings to lower battery consumption and still gets hot.I am not a hardcore user.  I just use my phone for calls, texting, and streaming music.  This would be an amazing phone if it didn't have those glitches.  I do not suggest taking a chance on this phone and look to other brands/models.  LG makes some great products but does not have the reputation for having the best support for their products as I have been a customer of theirs for many years.  Thanks to Amazon's great return policy this phone will be returned.", "Date": "October 13, 2012"}, {"Title": "Great all around experience", "Author": "T Bone \"T. Benjamin.\"", "ReviewID": "R190UMCCKKISAN", "Overall": "5.0", "Content": "Received this phone this afternoon and I am a happy camper.  Was going back and forth between the Nitro and the HTC Vivid.  Specs on the Nitro were the determining factor mainly the bigger processor and battery.  Seller shipped this out very quickly and upgraded to priority mail at no additional cost.  Order was placed on Friday morning the 20th and I received the item Monday afternoon the 23rd.  Even shipped with a 4 gb sd card and adapter besides the 16 gb sd card already installed.  Phone is responsive and I am awaiting my Straight Talk sim and activation card so just playing around a bit with it for now.  Did come loaded with Android 4.0 ICS and for those that are complaining about battery life I am at 70% and the phone has been running for 6 hrs and 40 min.  That seems a lot better than the 10% or more battery life I was losing hourly with my Samsung Galaxy Indulge.  Have already been recoommending this phone to my cousin who is having problems with his phone and wants to cut the Verizon bill.  Don't see why anyone would stick with the big carriers paying $90-$120 a month with limited data while Metro PCS is $50 and Straight Talk at $45 for unlimited everything.  I was with Sprint PCS for 9 years and spent the last 3 with Metro.  The only reason for leaving Metro is I wanted a higher end phone as I had no problems with the coverage here in Southern California and no issues with their customer service either.  Also I would definitely use this seller again and recommend them for this pleasant transaction going above what was expected.", "Date": "July 31, 2012"}, {"Title": "Excellent Device", "Author": "Jimboukfk", "ReviewID": "R1RQAGO431RITY", "Overall": "5.0", "Content": "Once I got it, I instantly updated it to ICS.This phone is amazing, fast, good design and has an Epic display.Pros:-Big HD display-Dual Core-2gb free internal memory (which is a lot for me, compared to the ~100mb that my previous phone had)-ICS updatable, I'm waiting for Jelly Bean though-Amazing media support, it plays every video and song I put in it.-Great picture capturing.-Able to run top games-Good built quality (but not the best)Cons:-Battery drains fast-It gets hot, very hot.-The box says \"16gb included memory card\" and well, it doesn't (this was seller's issue)-It's supposed to be \"Unlocked\" (this was also seller's issue)", "Date": "January 9, 2013"}, {"Title": "LG 930 Nitro randomly reboots constantly", "Author": "ATT Customer", "ReviewID": "R1VTRM85X6X154", "Overall": "1.0", "Content": "After reading the previous reviews I felt that perhaps I was cursed by the Android gods. I ordered number of LG 930 phones for my organization and all of them would randomly shut down. Some would stay up for a few hours then start rebooting on their own more and more frequently until they were completely unusable. Two were like this from the moment you turned them on. I ended up breaking out the old, but reliable phones they replaced.I researched the keywords \"LG 930 Nitro randomly reboots\" and found that the Android gods evidently hate a lot of Nitro owners. I would give this one a pass unless you like watching your phone restart itself over and over again.", "Date": "April 12, 2013"}, {"Title": "good phone with an epic display", "Author": "Neutronstar \"NB\"", "ReviewID": "R3MB0RG4IDD1AC", "Overall": "4.0", "Content": "The display is a major highlight. Its absolutely gorgeous. The build quality of the phone is decent. It feels better in the hand than the motorola atrix series. The battery life is horrible and the skin on top of gingerbread is hideous. However unlike several unlocked phones,Most of att's stuff is removable which is a plus point.Update:ATT has finally, almost two months after the ics rom leak, decided to give us the official rom. ICS, inherently, improves battery life and lg's skin is pretty awesome. Sadly, the bootloader is still locked. Now to ask ATT santa for jelly bean by the end of this year.The link below contains update directions.<...>", "Date": "July 1, 2012"}, {"Title": "Excellent when it's updated to ICS", "Author": "Super", "ReviewID": "R1XSOCN9XQBXTX", "Overall": "5.0", "Content": "The phone comes originally with GB and was very slow with an awful battery life, I updated to ICS 4.0.4, after that the phone is very fast, with an average battery life and a very nice UI.", "Date": "September 13, 2012"}, {"Title": "i love it", "Author": "Inri", "ReviewID": "R1RGHZONVRCABF", "Overall": "5.0", "Content": "I just love it... Great phone. My only complain is that it says it comes with a 16Gb micro sd card and it arrives without it", "Date": "May 2, 2013"}, {"Title": "Great Phone if it worked", "Author": "Fee Evans", "ReviewID": "RQW7H8Q5RORC2", "Overall": "2.0", "Content": "I purchased this phone because I wanted a little larger display, faster processor, upgraded Android OS and a better camera than I currently had on my 3.7\" Huawei Impulse 8800. The LG Nitro met all of these requirements without breaking the bank, but it came with Android 2.0.2. After I checked on the LG website and found out the they supported the upgrade to 4.0, I did the upgrade as directed on the LG website using their tools and Installation software. Everything went as expected. All looked good until the phone started randomly shutting off about 5 or 6 times a day. I could not related the shut downs to any particular event and after much research could not resolve the problem. Thankfully, I bought it from Amazon as they always cooperate 100% with refunds on items that don't perform correctly. I have since purchased another LG Nitro from my plan carrier and after several problems with the speaker and shuts down have gotten one that seems to perform very well. Battery life doesn't last long on heavy use so I bought an extended life battery and am happy with the performance.", "Date": "June 12, 2013"}, {"Title": "very very nice", "Author": "Timothy Williams", "ReviewID": "R25OA0HOBKH0J1", "Overall": "4.0", "Content": "This is a very nice device. The only reason it is not getting the full five stars is that it started restarting all by itself. I did the update and so far so good.", "Date": "February 11, 2013"}, {"Title": "It came with Gingerbread", "Author": "Janet", "ReviewID": "R1BTH0JE2TO8WV", "Overall": "5.0", "Content": "Arrived on time. It works fine, but I was hoping to get it with ICS (It came with Gingerbread. I'll try to update it myself.", "Date": "August 31, 2012"}, {"Title": "The phone turns itself off", "Author": "yudimar misel", "ReviewID": "R1SJO84L91C9OU", "Overall": "1.0", "Content": "Great features, but the first day the phone was restarted, turned off, I feel I lost my money on this phone, and the worst is that I tried to change the software that but I think it's a month I have not been able to have it. very bad.", "Date": "June 11, 2013"}, {"Title": "Wow very good device", "Author": "William C. Howard \"DynamicLynk\"", "ReviewID": "R1ZA3VM4MOZVYW", "Overall": "5.0", "Content": "This is a great LTE phone that I got at an awesome price from Amazon Warehouse deals. The phone is very well made and runs the latest Android OS.", "Date": "November 28, 2012"}, {"Title": "Nice Phone", "Author": "Josue Lopez", "ReviewID": "R28WDYXUD4PVOW", "Overall": "4.0", "Content": "Simple Amazing!.Great phone for the price and it have a nice performance.And it's work everything very well.Desde Venezuela", "Date": "May 19, 2013"}, {"Title": "Very nice hardware at a good price", "Author": "TheDude", "ReviewID": "R4ZHB7890Z3J6", "Overall": "5.0", "Content": "Pluses: Dual core processor and very nice hardware, at a good price.Minuses: Loaded with bloatware.However, you can install Cyanogenmod and get Icecream Sandwich running on this, with no bloatware.  It is not easy to do but it does work.  All in all if you're planning to run Cyanogen this is a great phone!", "Date": "November 28, 2012"}, {"Title": "Not as advertised", "Author": "Jose Salas \"--J--\"", "ReviewID": "R1XDXTEFLV2P0S", "Overall": "1.0", "Content": "This phone is not 100% unlocked, hotspot option locked, usb tethering lock, all those functions are lock by AT&T;, I called them and confirm that information with the IMEI number of the phone .. and that information is not on the product description.", "Date": "June 20, 2013"}, {"Title": "it is amazing.", "Author": "Shawn Olson", "ReviewID": "R3UDEG3BITACZ8", "Overall": "4.0", "Content": "i was impressed with the phone. so happy to have ordered a product that met my standerds. thank you for the phone.", "Date": "June 6, 2014"}, {"Title": "Gem : Believe it or not", "Author": "Jonathan Swift", "ReviewID": "R3JMKD0JA1C20", "Overall": "5.0", "Content": "I am using this phone for the last two years. As soon as I used it I repented why I did not buy a Samsung Galaxy. I always cursed this phone for last two years that not enough memory and cpu etc etc. I finally and accidentally dropped it on a concrete floor and thought aah wonderful lets buy Samsung and other brands.No matter what I buy I am returning them in two to three days.This phone is faster than Samsung, Much advanced and intelligent than other Android phones, you can \"extend\" storage space with miniSD [I never realized that this was a feature absent in many other phones]Well Samsung S4 and S5 are great phones as I hear but LG-P930 is as good as them or may be better. I will buy this phone again and again. LG rules", "Date": "May 23, 2014"}, {"Title": "Exactly what i ordered!", "Author": "Evelyn", "ReviewID": "ROFCWL9F1E9UF", "Overall": "5.0", "Content": "Arrived promptly, packaged, completely new! I was afraid it would be a scam and recieve a used phone. It runs well, hasn't failed me yet, except for a random split grapic that happened once. Other than that it was a great buy!", "Date": "May 21, 2014"}, {"Title": "THIS IS THE WORST PHONE I HAVE EVER OWNED!!!", "Author": "Jill Petsche", "ReviewID": "R1UF1SNZ455NJX", "Overall": "1.0", "Content": "For spending over $300.00 this is the most disappointing purchase I have ever made from Amazon. The batteries last a couple of hours at best in this phone. I have to keep 3 extra batteries charged at all times and that makes traveling a nightmare! The screen constantly freezes and When the phone gets hot (often) it drops calls and I have to wait for it to cool down before I can use it again. I made the mistake of buying this without a warranty and I will never do that again!", "Date": "April 13, 2014"}, {"Title": "Two years and going strong", "Author": "Josh", "ReviewID": "R1HOVEQDQB447S", "Overall": "4.0", "Content": "I have had the LG Nitro on AT&T; for over two years. This thing as been put through its paces. I was pleasantly surprised at the durability. From multiple drops from head height (6+ feet) and there's nothing more than mild scrapes on the bezel on the side. So durable that I have no problem making fun of iPhone users by throwing it on the floor. Water had never hurt it too badly, at least after it dries out. The touch screen is very precise and the processor is very good and for the first year-and-a-half, worked like new. The camera is very good and the display, for being 2+ years old, is still second to none. It is very easy to use and would be very god for a smartphone buyer who is a little tentative about the switch. It is an easy phone to learn and use, is relatively cheap, and it fairly durable.Now the bad, most of this happened in the latter months of the phone, and are rather trivial so I can't knock off any more than a single star. The only REALLY bad thing is that on occasion (2 times in two years), when I have charged it on lower than 2%, it has started to malt itself to the point were it was too hot to touch. I solved this by taking the battery out and letting it cool and then charge it while powered off then it fired right up. In the last 6 months (maybe less) the back cover started cracking (my fault) and the processor started slowing down considerably. It can't do a whole lot at once, but I never used it for more than one or two things at a time.", "Date": "April 8, 2014"}, {"Title": "Don't waste your time and money.", "Author": "Jason C.", "ReviewID": "RD77C7OJ5AFTQ", "Overall": "1.0", "Content": "Beware! The phone I bought from this seller is NOT a fully functional \"AT&T;\" phone ( the data service of the phone doesn't work on the AT&T; data network) and certainly the phone I bought is questionable as to whether It was actually \"new\". I have my doubts. AT&T; couldn't get the phone to fully work on the AT&T; network and through a very long trouble shooting effort eventually looked up the IMEI number of the phone. At that time AT&T; informed me that its actually a T Mobil phone and as such the T Mobil data network works differently than the AT&T; data network and that is why the data service on the phone will not work on their (AT&T; ) data network. Period. Did AT&T; do this because I didn't buy the phone from them? I don't think so. The phone simply doesn't fully work on their ( AT&T; ) network as the advertisement/ description from the seller suggests. To be clear, just because the phone will send and receive calls on the AT&T; network doesn't mean the phone is a fully functional AT&T; phone. I don't know if the seller knows this or not but they should. Read the \"No warranty\" language in the description with a skeptical eye. Amazon will refund the full amount of the purchase. I gave it one star. Less would be preferable.", "Date": "March 17, 2014"}, {"Title": "product review", "Author": "Dianna Johnston", "ReviewID": "R32L7D27595VE9", "Overall": "3.0", "Content": "Had lots of problems with the phone, but vendor was very good and replaced it with a different phone that I have been very satisfied with...LG Thrill is what I am using now.", "Date": "February 20, 2014"}, {"Title": "Not a bad phone for the price.", "Author": "S. Mitchell", "ReviewID": "R209OJN08RC9PO", "Overall": "2.0", "Content": "I was searching for a phone to be able to access straight talk's at&t; 4G LTE. This fitted the bill. I agree with the comments that this phone wasn't built to last though. I had it for about a month before the charger port took a crap and the phone wouldn't charge anymore. I felt the texting lagged a lot. The screen at times doesn't pick up your fingerprint. Every time I texted there were several letters inaccurate to the actual key I was pressing. Games involving sliding left and right I would always die because the screen wouldn't sense my finger. As for the all the reviews about terrible battery life, they are all absolutely correct. This phone has the worst battery life of any phone I've ever used. If you can tolerate a phone that's definitely going to break within a year, has terrible battery life, and the screen sensitivity is way off. This phone is perfect for you. I spent some extra money and bought the LG Optimus G E970 (AT&T;) and I am very satisfied. I bought it new on ebay for $175. Works with straight talks 4G LTE. Has a quad core processor, 2gb ram, and a 16gb internal hard drive. Also comes with a 16gb SD card. The LG Nitro HD now seems like a total waste of time to me.", "Date": "February 9, 2014"}, {"Title": "Works really well......", "Author": "Melle1970", "ReviewID": "R1044PQZRNLV49", "Overall": "4.0", "Content": "Great pictures. Great sound, great calls. I only had one issue, it's with a app that is a voice mail. I contacted the seller-they were very nice, and recommend that I took it to the AT&T; store. The At& T store said that it already came with the phone. Not sure what they did, but it works now.", "Date": "February 7, 2014"}, {"Title": "Seller \"psxpro\" sold me a damaged phone.", "Author": "Daniel Scott", "ReviewID": "RRLALQ18XCD9Z", "Overall": "1.0", "Content": "Just as the title says, the seller \"psxpro\" sold me a damaged phone. It won't turn on even after charging for several hours or trying a battery from a working LG Nitro HD.I couldn't return it because I live in South America and I'd spend more on the shipping back and forth than the cost of the phone. Imagine the surprise if you had to pay lots of money for the shipping and getting a damaged product...I don't recommend this seller.", "Date": "January 13, 2014"}, {"Title": "Cheap Junk", "Author": "Heather Leasure", "ReviewID": "R2QXO9S970SSMU", "Overall": "1.0", "Content": "This Phone lasted a grand total of 6 months. $250 down the drain. Nothing but cheap junk! DO NOT BUY", "Date": "November 24, 2013"}, {"Title": "LG Nitro HD", "Author": "JT", "ReviewID": "R2LI0XM9LBXZF8", "Overall": "4.0", "Content": "Phone arrived as advertised, new in original package. This phone was truly unlocked, not just clear ESN. Phone works fine. 4G LTE works great and is very fast compared to 3G or Wimax. Battery life is poor so I bought an extended battery for it, now it works all day.", "Date": "October 30, 2013"}, {"Title": "well what can I say", "Author": "jkaman", "ReviewID": "R3V0UKABZCLU3S", "Overall": "3.0", "Content": "First let me say I didn't purchase this phone from amazon! I was with Verizon and decided to change to another carrier because of the OUTRAGEOUS costs of Verizon $ 125 mnthly for my plan well I went with a carrier that was $ 45 month all included 2gb data unlimited text& 500 min mnth. great deal  but you had to buy their phone bought a Samsung exligrate first time with them didn't like returned for free & got the lg nitro hd loved it at first had a few problems with it freezing up called carrier followed  their directions did factory reset worked fine for day or so but freezes up when texting constantly have to take battery out and restart so I decided to check on line reviews of this model and guess what all of them having same problems as me but to late to return been more than 30 days don't get me wrong nice phone when it working properly, nice camera, nice sleek design feels great in your hand and excellent screen display but really a piece of crap you'll have to take the back off and take battery out so much it just isn't worth the hassle take my word and go with something else I paid way to much for this piece of junk have since ordered a new phone that I hope will preform better and please read and believe all the poor reviews about this phone wish I had done more research before purchasing", "Date": "October 1, 2013"}, {"Title": "Serious Quality issue", "Author": "Jie Qian", "ReviewID": "R11QS09C2JUYLO", "Overall": "2.0", "Content": "The phone worked great for 2 weeks, then cannot charge the phone anymore.Returned the defective one and received a replacement, the replacement phone's microphone is not working, so had to return again.", "Date": "September 18, 2013"}, {"Title": "This phone is Beutiful and Grate!!!", "Author": "Angel Atily \"A. Atily\"", "ReviewID": "R1R5BWSREWZVXT", "Overall": "5.0", "Content": "The phone is out of the box beautiful, came with everything except the 16GB memory Card. Guess when you purchase an unlocked device, they do not come with the intended memory. It had the updated version of Android 4.0.4 ICS and worked very fast on apps and other tasks. For a starter Android phone, is not up to date like other devices as the Galaxy's from Samsung, but it is a great phone for me..", "Date": "September 17, 2013"}, {"Title": "A Very Great Phone!", "Author": "Almolano", "ReviewID": "R31WLVWAN3H1W4", "Overall": "5.0", "Content": "I have this phone since August 2012 and I am still happy with it. It has a very good performance (just check and compare the technical specs). Yes, the power comsumption is high but is not quite different from any other high-end smartphone in the market. The solution: A battery management app and a moderate use (e-mail, chatting and web browsing from time to time) for a daily charge. In addition, you can have a battery charger at home as well as in your car and in your office according to the needs. If you have problems trying to activate the wifi hotspot in ICS just take a look for a solution on the Internet (You apply a special sequence of characters by using the phone's keyboard, change a given parameter and you are ready to go). You can take full advantage of the phone's functionality by using a lot of free apps (cameras, streaming, texting, chatting, gaming, scanning, etc.). There is no need to use a screen protector by taking care of not getting it close to sharp objects such as keys and coins. A protector cover is a must in order to preserve the phone in case of accidental falls. Based on my long experience with the phone is better to have a manufacturer supported Android version installed.", "Date": "September 9, 2013"}, {"Title": "Don' t waste your money on this phone", "Author": "jo Ann Philips", "ReviewID": "R3GJHTN5R80T26", "Overall": "3.0", "Content": "The battery life is lousy you need a charger every four to five hours.  The camera takes nice crisp pictures.", "Date": "September 2, 2013"}, {"Title": "Poor performing phone", "Author": "Tyler S.", "ReviewID": "R2IVH146GBKIUL", "Overall": "2.0", "Content": "everything excluding the screen quality sucks about this phone. The browser performance is choppy unless a rom is installed and then still the phone has sluggish performance.", "Date": "August 19, 2013"}, {"Title": "Don't buy a used phone without checking it out.", "Author": "Ethel", "ReviewID": "RIID3EJHMIG8U", "Overall": "1.0", "Content": "I hate it because since I received the phone I have not been able to activate it because it is a stolen or lost phone. I was without a phone for a few day.", "Date": "August 18, 2013"}, {"Title": "Great phone but ...", "Author": "michael rowe", "ReviewID": "R31UTN09K61UXC", "Overall": "5.0", "Content": "Got this phone for my wife who is on the Consumer Cellular network. Not a heavy data user but call & text. Data & mail are accessed through WiFi. Couldn't be happier.", "Date": "July 27, 2013"}, {"Title": "Good underrated phone", "Author": "Dom", "ReviewID": "R1TFQONAHEK219", "Overall": "4.0", "Content": "I just got mine a few days ago. I use it with a straight talk prepaid AT&T; sim. It's a good phone... fast, beautiful HD screen, good camera. The main drawbacks for me are that it doesn't use the latest Android OS, it is currently on Android 4.0 Ice Cream Sandwich. Battery life is poor when not using a battery saver mode. The internal storage is only 4gb, but it does have a Micro SD card slot, so that's not really a big problem. Overall id give this phone a 7.5 out of 10", "Date": "July 17, 2013"}, {"Title": "Not Great at the time", "Author": "Jeremy P. \"3dm\"", "ReviewID": "R1ZAIVTHH1QCZM", "Overall": "3.0", "Content": "I only had this one for a day or two. I needed a replacement for my old p999. Unfortunately, even though this unit was unlocked, I found out that I couldn't use it with t-mobile without installing some software or patch, which I really didn't care to find.", "Date": "May 29, 2013"}, {"Title": "The worst phone i have.", "Author": "Aster H.", "ReviewID": "R1MKOY080DSS1E", "Overall": "1.0", "Content": "This is the worst smatphone i even have.The screen is amazing, but  is the only good.The battery only work a few 6 or 7 hours.You can't give a hard use to the phone because suddenly reboot, if upgrade to ICS is worst.After a 5 monts is dead, don't turn on. A nice briked phone.", "Date": "December 24, 2013"}, {"Title": "very good team recommend 100%", "Author": "Juan C Gamez Pastells", "ReviewID": "RD9NYXVCISXR", "Overall": "5.0", "Content": "very good team recommend 100%Sharp picture and very good video hdrecommend equipmentthe only thing that is not as make video calls", "Date": "April 17, 2013"}, {"Title": "Badbadbad", "Author": "Lemane F.", "ReviewID": "R1PF0AWZDE4LMN", "Overall": "1.0", "Content": "This item was an issue if can explan it like that... It didn't function like I hope. More effort is recommended.", "Date": "January 4, 2014"}, {"Title": "SCAM!", "Author": "Emir Chajtur", "ReviewID": "R17GV2IYUHQWM2", "Overall": "1.0", "Content": "This is a total scam! I bought this phone on July 28 it work perfectly like one or two month and suddenly it stop working I can't make or receive calls, it seems like it's perfect but I can't make or receive calls and I can't make a claim, refund or return cause it says that its not longer able to initiate a return for this item that the return window expired on August 31. How can it be possible that this phone  just has one month of warranty?Am going to make a bad reputation for this seller.", "Date": "September 26, 2013"}, {"Title": "Lg Nitro product", "Author": "daniel", "ReviewID": "R3CRB63PO2U8FN", "Overall": "4.0", "Content": "hi guy thanks ,it's a very nice product good quality ,NOTE:could u helme to fix portable  WI-FI  hotspot because i have proble to share my internet wiht my laptop", "Date": "October 30, 2012"}], "ProductInfo": {"Price": "$129.99", "Features": "4.5\" HD display\n1.5GHZ dual-core processor\n8MP camera", "Name": "LG Nitro HD LG-P930 AT&T 4G LTE Unlocked Cell Phone No Warranty - AT&T Logos [AT", "ImgURL": "http://ecx.images-amazon.com/images/I/410zhpwp4DL._SY300_.jpg", "ProductID": "B007ILUCKW"}}