{"Reviews": [{"Title": "Great", "Author": "GUSTAVO G TRUNCI", "ReviewID": "R14SYOROJFQ7IU", "Overall": "5.0", "Content": "Great phone. Used an iPhone before and I am much happier now with the Lumia.I did not had a tousand apps in my iPhone so the transition was nice and easy.", "Date": "July 10, 2012"}, {"Title": "Very nice phone", "Author": "Imran", "ReviewID": "R2JQN8EXIMBOZK", "Overall": "5.0", "Content": "i realy love it. it looks great feel great. very easy to use. i did not have any problem with any hardware issue. the battery is worlking long", "Date": "October 8, 2012"}, {"Title": "Excellent Phone!", "Author": "Belkis", "ReviewID": "RUEJTLCXEQJVK", "Overall": "4.0", "Content": "works great in venezuela, good O.S,, i love the pink color.if only the case wasnt damage, i would rate it perfect.", "Date": "June 27, 2013"}, {"Title": "Great phone! Lovely color!", "Author": "Jonathan Hefner", "ReviewID": "RZ4K8HDIYVOBX", "Overall": "5.0", "Content": "The lumia 800 Windows Phones are just downright beautiful to look at, hold, and use. My daughter uses this phone, and she loves it. The phone comes with Windows Phone 7.8 update, so you get all 3 sizes of tiles, with lots of new accent colors to choose from.Inside the box it comes with a USB cable, wall plug adapter, and a very nice pair of earphones that have a built-in microphone.It's a shame that these phones didn't have a longer lifespan, as they are a really great phone, for anyone. I highly recommend them.", "Date": "September 6, 2013"}, {"Title": "Love it/ Hate it relationship", "Author": "Sandro Rizzi", "ReviewID": "RL536753VJLAW", "Overall": "1.0", "Content": "Although it is an earlier model in the windows phone evolution, it works and performs great. I am very pleased.Or at least I was until this past week when the phone started freezing when I would receive a text message. First two times I was able to reset the phone with the multi-button method. The third time it happened it went berserk and just started a repeating pattern of vibrations (one long a little pause then one short and then a longer pause, etc,) I have tried to find a resolution in the forums and through searches and find that this is more common than I thought. Imagine that, Nokia puts out products that last just 3 months, Shame on you. Microsoft is not without fault here either as the limitations on the OS put many basic Symbian OS functions way ahead of this WP7.8. No multi-file deletion capabilities, no street names in navigation. and many more basics lost in this OS. I will likely have to eat the repairs on this one as the international phone has no warranty.", "Date": "June 16, 2013"}, {"Title": "Conexion 2G Digitel, 3G con Movistar o Movilnet (Venezuela)", "Author": "Juan Carlos Urriola Maita", "ReviewID": "RYO74RNVTZW2I", "Overall": "3.0", "Content": "The seller does not specify the difference in the 3G network which works this phone (WCDMA), this results in Venezuela this phone is only for Movilnet operators Movistar and Digitel, however placed in his description that works for all specified bands 2G network GSM 850/900/1800/1900 3G network HSDPA 850/900/1900/2100.. 3G network WCDMA Digitel evolves not 900Mhz, 900Mhz HSDPA only, in Conclusion the phone works on 3G WCDMA only .. Earrings with this .. It is the American not European version .. Of the rest is a Great Phone.Solo Trabaja en Conexion 2G Digitel, 3G con Movistar o Movilnet ya que la frecuencia Utilizada es WCDMA para 3G.", "Date": "June 1, 2013"}, {"Title": "The cell phone dont work fine", "Author": "Angela Archila", "ReviewID": "R1UNV0GUQSQEK3", "Overall": "1.0", "Content": "The cell phone dont work fine, the battery is damaged, I need to connect all time the cell phone to energy, and it is restared many times in the day. I wrote to the seller but I dont have a solution.", "Date": "May 17, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0071JU224"}}