{"Reviews": [{"Title": "What is a phone supposed to be designed for? TALK!!!", "Author": "Amazon Customer \"Daniel\"", "ReviewID": "R1SHLN5J5X2QJM", "Overall": "5.0", "Content": "Here it is my story. I got myself and android tablet, 8.9 Samsung galaxy tab. There I play, work, watch movie, ETC. But I still needed a phone. You can get a smartphone but it is very big, and the baterry life sucks. I used to own and iphone 4. Got sick of charging baterry every 5/6 hours.This phone is outstanding, you actually have facebook, the camera is fairly decent and it is very compact, so I can always take it with me everywhere, texting is easy, the display... can't complain. The signal is 4 times better than my iPhone 4s. Never missed a call.I charged it on Friday, we are on Sunday... and it still has baterry. That's all I was looking for, a Phone that is designed for what a phone is supposed to be designed.. Talk!!1. Excelent signal2. Email account support3. Facebook.4. Forget about charging your freaking phone every 5 hours. Get this phone, and buy a tablet to have fan ETC.", "Date": "March 4, 2012"}, {"Title": "An afordable and easy to use smartphone but with limitations", "Author": "Adelis B.", "ReviewID": "R8M1VLXU4TAZ", "Overall": "4.0", "Content": "So far this phone is everything I expected; its easy to use, has a decent processor, stable software, good camera and lots of apps to download.But it has some limitations I was simply not expecting to see in a new Nokia phone:- The camera despite having a decent quality is has none of the basic options other simpler phones provide, it lacks filters, color modes, and even brigthness adjusment.- The battery life can be kind of short, I don't make many  calls but I do browse the web a lot and this can consume the battery in just 2 days specially if you are using 3G.- The internet browser doesn't display most pages in the most ordely way one would expect and you have very little control over the zoom so you either see the pages from too far or you see them way to close, so much that the text sometimes gets compressed in a very thin column- It doesn't display menu options in spanish, despite being international and having, italian, french and portuguese language packages installed.Another problem I had was that the signal reception is kind of weak, but this One is mostly caused by my current carrier (MOVILNET) here in Venezuela. Aparently some carriers here are not very friendly with unlocked phones some apps that require internet accses like \"Whatsapp\" are not supported or barely suported, I had to change the data packet acces point manually to use internet and still I have a lot of limitations and I will probaly have to move to a more stable but expensive carrier like Digitel or Movistar.ALWAYS MAKE SURE YOU CAN CONFIGURE ANY UNLOCKED PHONE YOU ARE GONNA BUY TO USE IT AT ITS FULLEST IN YOUR COUNTRY, READ LOTS OF REVIEWS, AND CONSULT FORUMS, YOU CAN'T JUST PUT A NEW SIM CARD EXPECT EVERYTHING TO WORK FINE SOMETIMES IS NOT THAT SIMPLE.", "Date": "May 22, 2012"}, {"Title": "Great Phone", "Author": "Toni", "ReviewID": "RGOYH99AOCXU4", "Overall": "5.0", "Content": "This phone is great, light weight, easy to use, the camera is decent and it is very compact and fits in my pocket. Texting is easy, the display is great and easy to see. The signal is much better than other phones.Once I charge it after 4 days of use and it still has battery life on it. This is all I'm looking for, an easy to use and great looking phone.1. Excellent signal2. Email account support3. Social Networks4. Great battery life5. Great camera6. Light weight7. Nice screen that you can touch and no need for navigation key", "Date": "June 20, 2012"}, {"Title": "Nokia asha 300", "Author": "Rafael Arevalo", "ReviewID": "R2DGNHSG16ELHZ", "Overall": "4.0", "Content": "buen equipo, en exelente estado, solo actualice el softwere a español y listo, opera muy bien hasta ahora, excelente lo recomiendo", "Date": "March 31, 2013"}, {"Title": "Excellent phone", "Author": "Quique Rivera", "ReviewID": "R2E3Z8EP6KR3AM", "Overall": "5.0", "Content": "As you can expect from a Nokia phone, great performance. The only problem I had with it... no Spanish menus... that's not a problem for me, but it is for the person I bought the phone for.Maybe is because it's an International Version, besides that, great phone.", "Date": "April 2, 2012"}, {"Title": "DENTRO DE LO ESPERADO.", "Author": "Ali Linares \"ALi\"", "ReviewID": "R8ATE7VAESF0", "Overall": "4.0", "Content": "Definitely NOKIA are another thing, this model meets my basic needs (text messaging, internet and other functions that I have not put into practice). I'm not passionate to highly sophisticated handsets, such as Ipods, galaxy and similar person. The 'only criticism that I make is not very good sound quality, it sounds dull, as if the caller had a cloth covering his mouth. Curiously, it is the only technology that does not move me the floor. Sorry you did not include in its menu the Spanish language, but I still works well.Definitivamente los NOKIA son otra cosa, este modelo cumple mis necesidades elementales (mensajeria de texto, internet y demás funciones que no he puesto en practica) . No soy persona apasionada a teléfonos de alta sofisticación, como los Ipods, galaxy y similares. La 'unica critica que le hago es la no muy buena calidad de sonido, suena opaco, como si la persona que te llama tuviera un paño tapándole la boca. Curiosamente es la única tecnología que no me mueve el suelo. Lamento que no haya incluido en su menu de idiomas el Español, pero igual me funciona bien.", "Date": "April 12, 2014"}, {"Title": "Better than expected", "Author": "yskander flores", "ReviewID": "R1ZUWIL0E9DJXM", "Overall": "5.0", "Content": "I can not find anything I do not like about this phone. Size is comfortable. Call quality is great and the interface is easy to figure out.This phone had some really great features I liked. Easy to use,you could record a call you were on and a few other neat things preinstalled. Looks nice, feels good.", "Date": "December 18, 2013"}, {"Title": "EASY", "Author": "T-Bone \"T-Bone\"", "ReviewID": "R27A92DPNTBYQY", "Overall": "5.0", "Content": "Great Basic EASY to function/use phone.It has a few fun options but nothing crazy. I got this for my mom who has no clue how to use simple functions of a phone but this phone was pretty easy to set up for her and she liked using it.", "Date": "August 6, 2013"}, {"Title": "Can't go wrong with Nokia!", "Author": "Gdua", "ReviewID": "R1LRXG53PC9PVB", "Overall": "5.0", "Content": "This phone is for my dad and I wanted to buy something small and standard. He's not into smart phones so I thought this'd be a good purchase.", "Date": "May 21, 2013"}, {"Title": "Good bang for the money", "Author": "Waheed Onisemoh", "ReviewID": "R1FUVRF03JJRO2", "Overall": "5.0", "Content": "The product was delivered on time and it's not different from the picture.It's a good value for the price paid. There were no scratches or dents noticed upon delivery. I will recommend it to my friends", "Date": "March 15, 2013"}, {"Title": "Nice phone", "Author": "double-r", "ReviewID": "RG66PAJ6ORVCI", "Overall": "5.0", "Content": "Item was for my dad. Seems to work fine till now so no complaints.The touchscreen is also not to bad.", "Date": "February 27, 2013"}, {"Title": "ALTA TECNOLOGIA", "Author": "Carlos Reyes", "ReviewID": "R12VW1ECAH000A", "Overall": "5.0", "Content": "CARAMBA NOKIA TENIA QUE SER...QUE TECNOLOGUIA TAN  MARAVILLOSA, HASTA AHORA NO HABIA TENIDO UNO CON TANTOS ADELANTOS COMO LO TIENE ESTE MODELO DE TELEFONO", "Date": "January 1, 2013"}, {"Title": "Don't have wifi", "Author": "Oscar Humberto Pimentel Piña", "ReviewID": "ROD2UQLPF3K24", "Overall": "4.0", "Content": "It is very good, but it don't have wifi. Its design is friendly, ergonomic and intuitive. Alone have languajes english and chinese.", "Date": "December 16, 2012"}, {"Title": "Excellent Basic phone", "Author": "Shiaz", "ReviewID": "R3DHBH746RG0EB", "Overall": "5.0", "Content": "Bought this to use on my international trip, this is a nice phone does all the basic function better than all the high end super computers we carry in our hands. so who love the basics and want just that, this is definitely a good pick. good job nokia!!! but dont know how long you will be in business....", "Date": "November 13, 2012"}, {"Title": "Good phone and affordable price", "Author": "harlincrc", "ReviewID": "R1D7H0V0F49P6B", "Overall": "4.0", "Content": "This phone is totally recommended , basic functions good signal excellent touchscreen applications and light.In general I recommend to buy this product.(For Spanish users it has one disadvantage , it does not have Spanish text for SMS and menu either)", "Date": "July 4, 2012"}, {"Title": "No wi-fi", "Author": "Yovanna Segarra \"Yova\"", "ReviewID": "R1O8FRNHB3LAMN", "Overall": "4.0", "Content": "The only bad for this cel phone is that is no have wi-fi, but everything else is very good, is easy to use phone", "Date": "July 14, 2013"}, {"Title": "Very Satisfied", "Author": "Teddy Villacres", "ReviewID": "R3IEGP9F77SCNB", "Overall": "4.0", "Content": "The phone comes with an angry birds game for free, this was a very cool surprise :) XD 1 2", "Date": "March 28, 2013"}, {"Title": "Does not work internationally", "Author": "Vidhya R.", "ReviewID": "R3K8VRRVUQLYTE", "Overall": "1.0", "Content": "I sent this phone to my parents who are living in India. The phone is locked to US region. Zero stars!!", "Date": "July 19, 2013"}, {"Title": "disappointed", "Author": "Lu Xu", "ReviewID": "R3FLZI0D5O8I21", "Overall": "2.0", "Content": "The mobile is said international, but it have no Chinese language. I am very disappointed. So I think it should tell buyer what language it have in product Details.", "Date": "April 27, 2013"}], "ProductInfo": {"Price": "$219.99", "Features": "Asha 300 Grey Brand New phone", "Name": "Nokia Asha 300 Gray Touchscreen Unlocked QuadBand 3G Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41-wYvURH2L._SY300_.jpg", "ProductID": "B007AKLBM4"}}