{"Reviews": [{"Title": "If you don't want Android or iOS this is your phone.", "Author": "cadhead", "ReviewID": "R257S65NZ6L7F5", "Overall": "5.0", "Content": "This is as close as you can get to a smartphone without a mandatory data plan (Verizon).This phone does not fall apart, the hinges are very strong.I used this phone for two years so far without any case or screen protector.Clearly the top 1 star review is wrong,or they don't know how to treat electronics.I have three complaints though....Once in a great while calls echo, just hangup and redial, it is just a \"bad line\", not the phone.The headphone jack is not 3.5mm, but smaller.Connecting the phone to Windows is hit and miss, but I have Windows XP.You can also use this phone as a modem with Verizon's VZ Manager software.It has basic voice commands, a great camera and so much more. Amazing, this was my 1st LG phone.BEST cell phone I've ever owned!", "Date": "October 21, 2012"}, {"Title": "AMAZING!!! ExcellENT!!!", "Author": "davik27", "ReviewID": "RFUEX0QPQAMIZ", "Overall": "5.0", "Content": "This phone is amazing!! I absolutely loved it! It works great, has a amazing screen and battery lasts forever!! The buttons are easy to text on and even make a phone call quick. The keyboard is easy to type on. The phone itself is really easy to run, its not like the smart phones now a days that are complicated, this phone is very simple and easy to run. Its very self explanitary. I would reccommend this phone to anyone that doesn't want to be on a smart phone plan!! Its amazing!!!", "Date": "October 2, 2012"}, {"Title": "GREAT PHONE", "Author": "wendy", "ReviewID": "RNMUVBRKBDXF", "Overall": "5.0", "Content": "I liked the OCTANE LG  so much that when I lost it and got it  stolen  there was no other cell phone I could replace it with in terms of high quality. I received the OCTANE LG many days sooner than promised, and it only took me 10 seconds to activate it. The speaker is very clear and loud. The keyboard is large, sturdy and thick ( not found with other  keyboard cells ). It takes good pictures and great 30 sec. videos with clear sounds, plus the battery lasts super long. I dont need internet on my phone, and this phone is the best!", "Date": "October 22, 2012"}, {"Title": "Cell phone is the best", "Author": "Lara", "ReviewID": "R21MUG418OS0VH", "Overall": "5.0", "Content": "I have had a LG Octane cell phone for almost 4 yrs. now and love it. I am not ready fora smart phone yet. I got my son the same phone for his birthday. He has had so many problemswith all of the others. So far he likes it and has not had a problem.", "Date": "May 17, 2013"}, {"Title": "Great Phone", "Author": "Louis E Karrer Sr", "ReviewID": "R31URCN5MOY53S", "Overall": "5.0", "Content": "I am only a voice and text person.  I am really sorry they do not offer this phone at Verizon any longer.", "Date": "March 16, 2013"}, {"Title": "work horse of a phone", "Author": "Teenmom", "ReviewID": "R1MRBE3IUZ14SM", "Overall": "5.0", "Content": "I have had this phone for over 3 years and it still works great. I am buying another here for my husband because the 4 options at the Verizon website & store for basic phones are terrible. I have a 16 GB micro SD card memory chip in this phone with lots of music (and it fits a 32GB chip as well but I switched that to my Samsung Galaxy media player). It has 2 speakers built in that provide amazingly good sound if you want to hear it without earbuds.  I bought the plug converter at the link below on Amazon that allows standard 3.5mm earbuds to be plugged into the adaptor which then plugs into the older style 2.5mm hole in the phone.  This adapter auto answers the phone with the push of a button on the adapter if you are listening to music and want to answer the call.  The adapter also has a volume roller on it.  I love this adapter for when I take walks with music, the microphone/answer button/volume roller part clip to my shirt.  You could use this adapter and put 1 earbud in your ear while driving to answer the phone if you have an older car without Bluetooth.  The Bluetooth works very well in newer cars so that music and phone calls come through the car speakers.  I text a lot and the keyboard has big buttons compared to for instance the Samsung Intensity that my daughter has, and clicks so you have positive feedback that you entered your data. The phone flips open length wise which gives you a larger inside screen to see your texts bigger than on the newer slider keyboard phones where you only have the front smaller screen. I set the hotkeys (directional keys) to have fast access to calender, music player, text inbox and photos/camera.  The camera is 3.2 megapixels which is better than most basic phones.  The best part of this phone is that when you use the USB cable to pug it into a computer, it just becomes an extra drive that you can drop-and-drag stuff to, instead of having to load the Verizon music player.  Even with playing music a lot it holds it charge for a few days.  I set multiple alarms for daily, Mon-Fri, Weekends, Select days.  I do not use mobile web on this but it does have the option to do so if you have a data plan.  My whole reason to get this phone was to have a phone with tons of features that does not require a data plan. It is a great phone.Here is the adapter that plugs into the 2.5mm hole on the phone and accepts standard 3.5mm earbud plugs:B001P4OADS", "Date": "September 29, 2013"}, {"Title": "very satisfied", "Author": "D. Stratton \"band mom\"", "ReviewID": "R1P3TMZKO6ER4C", "Overall": "5.0", "Content": "I was bummed because Verizon no longer offers this phone. I am not interested in a phone with a data package. I took a chance and ordered this phone a few days ago. I have already received it and am using it already. Just like brand new. I am very satisfied. I was able to activate the phone in about 5 minutes.", "Date": "September 13, 2013"}, {"Title": "Octane", "Author": "Rca27278", "ReviewID": "R3JM6MXP0EZ25M", "Overall": "5.0", "Content": "I love my octane! I went swimming with my other one and was so glad to find this one because verizon does not carry it anymore.", "Date": "July 11, 2013"}, {"Title": "love the lg octane", "Author": "damaris ibarra", "ReviewID": "R15F3XSBQF7KYF", "Overall": "5.0", "Content": "this is our second octane... love it... love it... love it... it does everything it is supposed to do as a basic phone... texting is so easy, we love the full size of the  keypad... battery lasts and reception is always great! Wish LG kept producing this model!", "Date": "August 4, 2013"}, {"Title": "Best Phone Ever", "Author": "Arturo Simmonds", "ReviewID": "RENL6EULYT4UE", "Overall": "5.0", "Content": "I have owned the same phone for 2.5 years and is still running.  Liked it so much decided to buy me a new one, and pass up the \"free\" phone offers from Verizon.  Battery life is eternal, and does everything I need when I am away from the computer (which is very limited).  The best part, I save $120+ dollars/yr by not having the cell data plan charges!!  I may be a lonely Mohican, but I am a happy one.", "Date": "November 5, 2013"}, {"Title": "Sturdy and easy to use", "Author": "Ali", "ReviewID": "R1HRF38IQYTFX5", "Overall": "5.0", "Content": "I've had this phone for almost 4 years and it's still holding strong. When I first got this phone, the pictures were crystal clear and the detail was amazing. The sound quality was wonderful, no static or dropped calls. People could hear me and no matter where I went, battery life lasted about 2 days with constant texting and about 2 calls each day. I've dropped it several times and there are chips at each of the corners, but this hasn't affected its performance at all. Now that I've had this phone for several years, some things have changed. I have the volume all the way up and sometimes open the phone to put it on speaker so that the larger inner speakers can help me hear whomever I'm speaking to. Even then, I have trouble hearing unless there isn't any background noise. The camera is still working well but the pictures aren't as stellar as they once were but it does what I ask it to. There is a photo editing capability within the phone that will allow you to turn and crop the photo as well as add stickers, change the lighting, clarity, etc. But don't confuse this with photoshop or other detailed photo editing apps. It stores a TON of contacts, photos, videos, etc. without complaint. However, it maxes out on text messages and will flash a memory warning whenever you open a new message so that you will go through your inbox and delete past messages. Occasionally (roughly once a month) it will freeze up and I have to remove the battery to reboot it. Other times, it will simply restart itself for no reason and with no warning. After FOUR years, this phone is holding strong and still does what I ask of it. If you don't want a smartphone or a data plan, this is a great phone. I definitely recommend it to parents for their teenagers.", "Date": "October 4, 2013"}, {"Title": "Aprehensive - my 1st time", "Author": "JR", "ReviewID": "R1XL30IBVSOMYA", "Overall": "5.0", "Content": "So my Dad-in-law damaged his cell so I decided to give this one a chance.  I have never bought a cell online, outside of carrier, and I am happy.  The cell was brand new - not even a piece of lint.  I bought the screen protector and cell case cover all from here.  Thank you for treating me right guys!", "Date": "September 3, 2013"}, {"Title": "great little phone", "Author": "LORELEI LEE \"DIAMONDSGRLSBSTFRND\"", "ReviewID": "RPB2AVL1CWHDB", "Overall": "5.0", "Content": "ive had my phone for 2 years & it has never given me a problem voice clarity is fantastic!!!! every thing about this phone is fantastic why cant you just renew your contract with verizon&keep; your old phone?????????? not every body wants or needs a smart phone& most of the basic phones they now offer are pieces of junk any way i love my phone", "Date": "October 11, 2013"}, {"Title": "non data phone", "Author": "Julie", "ReviewID": "RWBK8LQTILSAM", "Overall": "4.0", "Content": "There are limited non data phones that are actually note worthy.  My husband has had one for 1.5 years and recommended to me when my intensity was going bad.  Is similar to the intensity, but there is still some getting use to.  The battery life doesn't seem to hold as well, but maybe be just my adjustment to it.", "Date": "August 9, 2013"}, {"Title": "best phone ever", "Author": "confused1", "ReviewID": "R3JJQFEKW8FCQN", "Overall": "5.0", "Content": "this is by far the best phone i've ever owned.  i'm pretty rough with phones and this lil thing is amazing.  its been dropped in a toilet, in a cup of vodka and once i put it in bag of white rice and let it dry out works perfectly.  i've thrown this thing at concrete steps and it didn't break.  keypad is so easy to type on also.  i'm buying another one as a back up just in case", "Date": "July 6, 2013"}, {"Title": "Great Phone...Great Service", "Author": "Alan Dwayne Mason", "ReviewID": "R31J900DJ504XQ", "Overall": "5.0", "Content": "I received my phone earlier than expected.  I am very pleased with the LG OCTANE. It looked absolutely new i the box.  I've been using it for a week and have had no echo problems or any other problems.  I switched from my Droid Smartphone and dropped $45/ mo in data fees that I wasn't using.  The texting on the LG is easier since it has a physical keyboard...and the voice quality is good. I just decided that I don't need to check FB & email every 15 minutes.  If you want high quality voice and text...you should definitely chech out this phone.", "Date": "June 27, 2013"}, {"Title": "Verizon LG Octane Cell Phone", "Author": "judith convery", "ReviewID": "R2LK86F7X9UKRQ", "Overall": "4.0", "Content": "This was a replacement phone for the exact item that I had damaged ...and it was no longer available through Verizon, and I was very pleased to find it on Amazon.", "Date": "January 10, 2013"}, {"Title": "Excellent Phone for the not so tech savvy.", "Author": "Naomi Philocles \"Ladyiceberg\"", "ReviewID": "R2Q7MLW7KH82PY", "Overall": "5.0", "Content": "I purchased this phone for my mom who will just use it to make phone calls and text once in awhile.  So far no complaints. Great little phone.", "Date": "January 4, 2013"}, {"Title": "bad bad", "Author": "Emily", "ReviewID": "R2B3LVP1RFRQ9U", "Overall": "1.0", "Content": "Do Not buy from cellular seller.. I purchased this phone and they said it was in very good condition. When I received it the front screen was so scratched up I couldn't read it and it's constantly freezing up so I have to pull the battery at least twice a day. I notified the seller and they said they would send out a phone in better condition! When I received the phone it was in worse condition than the first both screens are scratched and the hinge is extremely loose... ridiculous I am VERY unsatisfied!!", "Date": "May 22, 2014"}, {"Title": "Phone is great, the battery that came with it bad!", "Author": "archie", "ReviewID": "RDBJUZ8455BZC", "Overall": "3.0", "Content": "I bought the octane to replace my old one i dropped in the water. The phone would not work after i charged the battery, so i took it to my Verizon store and found out the battery was bad. I contacted the seller by email and never received a reply that's why only gave it 3 stars", "Date": "January 19, 2014"}, {"Title": "Octane Cell phone", "Author": "Barbara Collyer", "ReviewID": "RJNP1M85FJEAP", "Overall": "5.0", "Content": "This was a replacement for my Octane that took a bath. I like the phone so much and couldn't get one from Verizon because they no longer make that phone.", "Date": "January 9, 2014"}, {"Title": "Love this phone", "Author": "A. Thornhill", "ReviewID": "R36R9A7RVF493B", "Overall": "5.0", "Content": "I keep getting this phone when ever I need a new phone. It's very durable and easy to use. Thank you!", "Date": "January 9, 2014"}, {"Title": "VERY DISAPPOINTED", "Author": "brginhunter", "ReviewID": "RZLA6PQSXL01H", "Overall": "3.0", "Content": "THIS PHONE HAD GOOD RATINGS SO I DECIDED TO TRY IT. THE VOLUME ON THIS PHONE IS VERY LOW COMPARED TO OTHERS. IF IT RINGS, YOU BETTER HOPE THAT IT IS NEAR BY SO YOU CAN HEAR IT. ALSO, THE BATTERY LIFE IS VERY SHORT, SO IF YOU TALK/USE THIS PHONE MUCH, YOU CAN EXPECT TO CHARGE IT A COUPLE OF TIMES A DAY.", "Date": "December 18, 2013"}, {"Title": "Good little phone for us folks not needing a smart phone.", "Author": "ruth pottingeramato", "ReviewID": "RH9843D9KW4N8", "Overall": "4.0", "Content": "Works well. The only think I do not like is that these keys are a bit different than my last phone and since I text so much, I am always hitting a \"b\" button  when I want to hit the space bar. The space bar seems to be off center to then left and therefor use the left thumb where before it was more to right and used the right  thumb. I could be a creature of habit and need to adjust! I like  that it locks and I don't purse dial anymore! I also purchased the rubber case for it for peanuts also on amazon and it works well and is somewhat protected and easier to hold.", "Date": "December 10, 2013"}, {"Title": "got what i expected", "Author": "mollysmom", "ReviewID": "RTOVTQL9F2CXB", "Overall": "5.0", "Content": "replaced the one I had, so did not have to deal with learning how to use another device. came complete with battery, charger in excellent condition. It was shipped promptly and I received it in 3 days.", "Date": "November 19, 2013"}, {"Title": "great basic phone", "Author": "papamike", "ReviewID": "R3LH4IHG68DBQC", "Overall": "5.0", "Content": "easy to use, perfect for talk and text only. texting required for my job, and talk with co-workers (trucking industry).", "Date": "November 13, 2013"}, {"Title": "LG Octane Cell Phone", "Author": "MEC", "ReviewID": "RXSKDW5G6KWMP", "Overall": "5.0", "Content": "I had bought my teenage daughter one of these phones when they first came out.  My younger daughter (13 year old) needed a new cell phone due to dropping hers and destroying the screen.  The camera on this phone is nice.  The phone is simple to use.  Overall I believe this phone is a nice little phone (if you aren't into all the bells and wistles).", "Date": "November 4, 2013"}, {"Title": "Phone", "Author": "bevs", "ReviewID": "R2L9T1GH1TZWQJ", "Overall": "5.0", "Content": "I tried to find this phone everywhere since I had my old one for nearly three years but the mike was going bad.  When I found it on Amazon, I immediately ordered it and love it.", "Date": "October 27, 2013"}, {"Title": "LG Octane glad I found you a second time.", "Author": "Rachel L. Ricketts", "ReviewID": "R3V23BRXSPDSGU", "Overall": "5.0", "Content": "This is a backup for my original phone that I have had almost 3 years.  I love it that is why I purchased another even though mine is still good.  Ordered it Thursday the 10th and it came today.  I will not be turning it on yet so hope it will still be good when I actually activate it.  So glad it was still available.", "Date": "October 15, 2013"}, {"Title": "Great Phone! and Great service!", "Author": "Sheri", "ReviewID": "R11ATTHTZ1E9IR", "Overall": "5.0", "Content": "This is a great phone! Easy to use and durable. I would recommend this phone for anyone. The dealer I would recommend highly to purchase from. They will treat you right!!", "Date": "September 16, 2013"}, {"Title": "Fast delivery, product as described", "Author": "M Johnston", "ReviewID": "R3SCBT6D3GWLYF", "Overall": "5.0", "Content": "I would definately buy from this seller again. The phone worked perfectly. He said there would be a few scratches on the screen from wear and tear. My husband and I have the same phone and the one I bought for my son looked just as good as ours. We have had ours for over 2 years. I was worried that I couldn't transfer the phone to Verizon. I asked the seller about it and he told me it would not be a problem. It wasn't. It took me less than 10 minutes to transfer my son's old phone for this one.", "Date": "August 2, 2013"}, {"Title": "Love this phone.", "Author": "Saphirs", "ReviewID": "R1SJZ7UVXURENX", "Overall": "5.0", "Content": "My husband has had this phone for a couple years. Its a shame they discontinued it. Very durable for our jobs we do. It has lasted a  long time. I now have the same phone. Camera and video work good, and if you like us just like to talk and text its perfect for your need. Battery life is good which we need for our jobs, unlike all these new phones that the batteries go dead in an hour.", "Date": "June 10, 2013"}, {"Title": "BEST PHONE I EVER OWNED!! JUST AWSOME!!", "Author": "NoMoneyG", "ReviewID": "R30SKAYFJM2NFI", "Overall": "5.0", "Content": "I have had this phone for 2+ years now and it is super durable and Great for Texting with the almost \"tiny Laptop Feel & Look\" to it with it's QWERTY keyboard. Much better in my opinion to a slider phone with the QWERTY keyboard that just slides down. This has several positions when open that it \"Snaps\" into to Text(or whatever else you are doing when open). Also if you are really an \"Old School Texter\", you can use the front number/symbols buttons to Text! Also I am still using the same battery that it came with and it still holds almost the same charge as when it was new 2 years ago! This is just an Amazing Phone that is Super Highly Recommended! I LOVE MY LG OCTANE PHONE!!!BEST PHONE I EVER OWNED!! HIGHLY RECOMMENDED FOR JUST A SIMPLE AND EASY TO USE PHONE, AND GREAT FOR TEXTING!! THIS REALLY IS A EASY & SIMPLE TEXTING PHONE AS WELL!! JUST AWSOME!!", "Date": "May 5, 2013"}, {"Title": "LG Octane Cell Phones", "Author": "Butch Geis", "ReviewID": "R19ANVAN85PVTD", "Overall": "5.0", "Content": "Received my two LG Octane cell phones very quickly. I searched for what I wanted and they arrived very quickly and they were very easy to activate with Verizon.  They are great phones.  Thank you very much!!! I would recommend seller to others with out hesitation.", "Date": "April 25, 2013"}, {"Title": "Great Phone!", "Author": "KRJ", "ReviewID": "R354U78ELKNVBE", "Overall": "5.0", "Content": "I love this phone. At first the pictures were cloudy. Ha! I had to remove the tiniest piece of plastic from the lense.", "Date": "April 10, 2013"}, {"Title": "Great phone great service", "Author": "Riccardo B Rivas", "ReviewID": "R35AC65EVMZ0X1", "Overall": "5.0", "Content": "The phone arrived on the designated arrival date.  The enclosed directions were easy to follow. Loved this smartest of dumb phones", "Date": "March 11, 2013"}, {"Title": "New LG cell", "Author": "Martha Wieman", "ReviewID": "R28FMKDVXG9YRN", "Overall": "4.0", "Content": "I had a cell phone just like this one but damaged it using Radio Shack adaptor for ear jack. The new phone is very similar, which I like. Verizon wanted to sell me one with sliding keyboard, but I wanted the flip open one. It is better made and will hold up longer. Just glad to have my kind of phone again. It was better priced than those Verizon offered me.", "Date": "March 2, 2013"}, {"Title": "These are not brand new", "Author": "blacam", "ReviewID": "R37JJIYNV9SNUA", "Overall": "1.0", "Content": "Buyer beware. Despite the description saying these are brand new these phones are not. I received mine and had a friend at verizon verify whether it was new or not and it was in fact used on another account and is a reconditioned/refurbished phone. So it looks new but it is not new at all. If you don't believe me, once you get ur phone call up verizon and ask them if the esn is a new or used. Can't believe they are allowed to false advertise like this.", "Date": "April 4, 2014"}, {"Title": "great phone", "Author": "Gavin smith", "ReviewID": "RXV0777GN4YW6", "Overall": "5.0", "Content": "wife has used hers for years. when I wanted an inexpensive phone solution it seemed an obvious choice. does not require a pricey data plan. works very well for calling and texting.", "Date": "March 29, 2014"}, {"Title": "pumped", "Author": "te", "ReviewID": "R3BSLGPRBMD2YM", "Overall": "4.0", "Content": "I really love the good old fashion phone, it has been my favorite for years.  I have had no problems so far!!!", "Date": "March 10, 2014"}, {"Title": "Excellent phone", "Author": "hilltop mom", "ReviewID": "R28F3I9RWK5LSV", "Overall": "4.0", "Content": "For my needs, this is a perfect phone. I don't need all the bells and whistles of a smart phone, along with the data package charges. For my texting needs, there is a full-sized qwerty keyboard, which is much superior to those keyboards that slide out on other phone models. My only complaint is that even on the highest setting, the volume is not loud enough. For that reason I gave it 4 stars.", "Date": "March 4, 2014"}, {"Title": "Died quickly", "Author": "eordzo1", "ReviewID": "R3O7R4QQYQ4UG3", "Overall": "1.0", "Content": "This phone died pretty quickly on me. I had it for maybe two months before it started losing its charge, so I replaced the battery. That wasn't it. The phone actually died on me, so now I'm out the cost of the phone and the new battery.", "Date": "February 25, 2014"}, {"Title": "Octane", "Author": "L. White", "ReviewID": "R21UJX4LEABFXR", "Overall": "4.0", "Content": "I really like the phone.  It is sturdy and I love the keyboard which is larger than other ones I have had.  Some of the features take quite a few steps to access.  Other than that, I have no other dislikes.  I would definitely recommend it.  Most people could figure out how to use the features easier than I did.", "Date": "February 25, 2014"}, {"Title": "Thanks for a great phone", "Author": "Cory Holkesvig", "ReviewID": "R6GJPSLS93ZOU", "Overall": "5.0", "Content": "Great phone nothing fancy but does its job well. I don't need a phone that does every little thing thats what a computer is for. They also shipped the phone fast came neatly packaged you could tell they take time and care of the products they ship...", "Date": "February 13, 2014"}, {"Title": "LOVE IT", "Author": "Julie", "ReviewID": "R3OUWH9MOTAIFX", "Overall": "5.0", "Content": "LOVE THIS PHONE !!!! Easy to use.....great sound, pictures, simple, can add features later if you like.... not into smart phones !!! live on a computer all day at work !!!!", "Date": "February 12, 2014"}, {"Title": "Solid phone.", "Author": "Peter J. Gagliano", "ReviewID": "R1W88WK9IZIY9I", "Overall": "4.0", "Content": "The phone is solid and a good performer for a basic phone.  It is clearly, the best of the last four flip phones that I have had.  It appears the manufacturers are not interested in producing good basic phones.  The want us to purchase smart phones. Unfortunately, the ear plug jack is 2.5mm. Most of mine are 3.5mm.  Waste of time getting a converter. Just purchase a 2.5mm with mic and earbuds.", "Date": "February 9, 2014"}, {"Title": "Nice Phone!", "Author": "Victoria", "ReviewID": "R2A7QIHTPT7DI1", "Overall": "4.0", "Content": "The delivery was timely and exactly what I wanted. The phone itself works well and does what I need it too. THe battery life i snice and the calls are nice as well.", "Date": "January 16, 2014"}, {"Title": "LG Octane cell phone from Applewireless", "Author": "Ted K. Schnell", "ReviewID": "R2I9J4NAZDTHW8", "Overall": "5.0", "Content": "The LG Octane was delivered as promised....new in the Verizon box.  We bought it for my 78 year old mother for Christmas so she could learn how to text.....she loves the phone and she loves the fact that she can text now,", "Date": "January 14, 2014"}, {"Title": "Great  alternative  to a smart phone!", "Author": "Susan Chelone", "ReviewID": "RSU1HK170GXWJ", "Overall": "5.0", "Content": "I purchased this phone about a week ago. It came in excellent condition in the original box from Applewireless. It was easy to activate and set up. The only problem I had was I couldn't get on line so I called Verizon and the rep was very helpful with trouble shooting.I now have my email account set up and Facebook which is all I really go on line for except maybe to check the weather. I use WeatherBug for that. The keyboard is great. The camera works really well,too.I found out that I can go onto the Verizon web site and send pictures from my online albums back to my phone to use for wallpapers.I was also able to download all of my contacts from the website.This phone has the capacity to store a lot of music with a mini SD card, but I will not be using that as I have an Ipod for my music. It has a lot of ringtones to choose from and you can also record your own songs or sounds to use for alerts. It is also durable which is good because I own a farm and sometimes drop my phones on the ground or cement. I haven't had this one long so we will see how long it lasts! The battery life seems to be an issue for some people. I am not on the phone a lot so it hasn't been a problem for me. I have been charging it every 3 days or so. The charger that came with the phone works by the wall outlet or hook it up to your PC or laptop.I would recommend any of these similar LG phones especially if you don't want to pay huge data fees.I have 500MB with my Verizon plan which I never go over.If you have a teenager this would be a great phone for them because they can do a lot of texting,social networking, and picture or videos and it wouldn't break the bank. I hope this is helpful to those of you who are undecided about buying this type of phone.", "Date": "January 14, 2014"}, {"Title": "Phone works great", "Author": "john", "ReviewID": "R3MCH4KDI2KEUG", "Overall": "5.0", "Content": "This is my second phone when i got the first one it broke and was replaced immediately !! Great job !!!", "Date": "December 30, 2013"}, {"Title": "best phone ever", "Author": "arthur daniels", "ReviewID": "R3RBM6IR7Z7G1I", "Overall": "5.0", "Content": "will never give it upwas new in box.. sealed just like they promisedneed a phone with actual buttons HATE TOUCH SCREEN PHONESwill keep buying new ones till there ain't no mo...", "Date": "December 26, 2013"}, {"Title": "phone", "Author": "Carol A", "ReviewID": "R1RZO1C2EFKJ35", "Overall": "5.0", "Content": "Already owned one just replaced it because I wore out the letter S & E and send on the keypad.", "Date": "December 20, 2013"}, {"Title": "SMART PHONES ARE NOT ALWAYS SMART", "Author": "karen laberge", "ReviewID": "R7EH853XE54S8", "Overall": "5.0", "Content": "SMART PHONES ARE NOT ALWAYS SMART AND I DO NOT WANT A SMART PHONE AND I LIKE THIS FLIP STYLE WITH LETTERS TO TYPE", "Date": "November 30, 2013"}, {"Title": "Great phone", "Author": "D. Dorn", "ReviewID": "R3S9L3IAOXLU68", "Overall": "5.0", "Content": "Needed a replacement phone for my child.  Arrived in great shape, works great and has the physical qwerty keyboard.  Very happy with this purchase.", "Date": "November 30, 2013"}, {"Title": "LG Octane Defective", "Author": "Amazon Customer", "ReviewID": "R1PGTAVMO443BR", "Overall": "1.0", "Content": "I have had 2 of these phones in the last 2+ months. Both failed.1st one: turned off randomly.  VZ navigator worked for about 2 weeks, then the GPS stopped working.  I contacted the vendor (Applewireless) and they replaced it within 10 days.2nd one: within the7-10 days it turned off randomly and will not hold a charge.  I charge it, get 1 text, battery is dead and it shuts down.  I plug it in and it says battery is fully charged!Hoping Applewireless comes through on a refund!  Due to a family emergency, I need a working phone now, so I went to the Verizon store to get one.", "Date": "November 14, 2013"}, {"Title": "LG Octane", "Author": "Julie Clemen", "ReviewID": "RJSWPIIBPSPA1", "Overall": "5.0", "Content": "I LOVE this cell phone... especially the speaker phone.. I use it open all the time especially if I'm typing.. no feed back or tunnel feeling for the other person I'm speaking with!!  Plus I live out in the boonies and it has exceptional reception.", "Date": "October 26, 2013"}, {"Title": "Not Half as Good as the Original", "Author": "Lawrence W Soltysiak", "ReviewID": "R1ZCU8GTMKNVYO", "Overall": "2.0", "Content": "I was expecting something akin to the original LG Octane.  That it was in looks only.  Otherwise the performance was terrible.  Sound was awful.  It was like the speaker had been set to low and no amount of adjustment could change it.  Signal strength was poor also.  The operation of the phone was exactly like the original, but signal strength and sound quality was bad.", "Date": "September 16, 2013"}, {"Title": "ok, better if it was actually new like they said or damaged screen was mentioned", "Author": "Edward J. Moreau", "ReviewID": "RXV95IDYLDNCB", "Overall": "3.0", "Content": "I like the way this phone works. I like the large keyboard also. The ringer doesn't seem that loud and it has a permanent looking water spot on the screen that doesn't seem to affect the performance. I decided to not send it back because  I got it for 100.00. Other that that swift shipping and phone functions well so far .I have only had it a month.", "Date": "July 30, 2013"}, {"Title": "Great deal!", "Author": "Mary A Parvaresh", "ReviewID": "R1HNYID3XQ1IE6", "Overall": "5.0", "Content": "My husband is not a technogeek.  This phone is what he wants.  I got it for Father's Day, and it arrived on time.  I have not used it yet, but the seller sent me information on what to do if I have any problems.  Sure it will be better than the five year old phone he has now.", "Date": "June 14, 2013"}, {"Title": "you need to bring the OCTANE  BACK!!!!!", "Author": "bombergr61", "ReviewID": "RR402YLFJFFO7", "Overall": "5.0", "Content": "I love this phone soooo much... it has all I need.  great camera...great keyboard...great size and is sturdy...again I love this phone so much that I have ordered another one and really thinking about maybe getting 2...just sayin..Its sad that the only choices I have at Verison is 3 crappy phones or the spendy Iphones or Droids... I dont need or wantto use those types of phones... but still want a quality phone that stands up to everyday use and thats what I get with the Octane!!!Brenda of Sioux Falls, SD", "Date": "November 27, 2012"}, {"Title": "Great phone", "Author": "Karen", "ReviewID": "R19EN2M1SFB9II", "Overall": "4.0", "Content": "Key pad is good and it's a great phone to have if you don't need a smart phone . I use my iPad for Internet. I like it so much that I purchaed two in case I break one :-)", "Date": "September 2, 2013"}, {"Title": "fair reception", "Author": "Judith bernstein", "ReviewID": "R2IZSWJOQ11NGL", "Overall": "4.0", "Content": "Sometimes cuts out on calls, also often speech is not understandable. Not better than the envy2 I replaced.  Eady to use", "Date": "June 5, 2014"}, {"Title": "Great little phone", "Author": "sunshine", "ReviewID": "R2Q0ARCND275K4", "Overall": "5.0", "Content": "Just starting using it today, seems to be a great phone so far, volume is loud enough and keyboard a good size for me.", "Date": "June 2, 2014"}, {"Title": "Bought two of them", "Author": "Tanzy", "ReviewID": "R13ZV5I4RAJF3", "Overall": "5.0", "Content": "I bought two of them. One for my wife and one for my son.  Great phones at a great price.", "Date": "June 1, 2014"}, {"Title": "Better than any new basic phone available", "Author": "Richard L. White", "ReviewID": "R3R8ADUHPXTAGA", "Overall": "5.0", "Content": "We have been using this model phone for several years.  My wife lost her phone and we had to replace it.  She was not in need of a smart phone and did not want the additional monthly cost.  After using the only \"basic\" phone Verizon has available, we purchased this NOS phone.", "Date": "June 1, 2014"}, {"Title": "Not loud enough", "Author": "CK", "ReviewID": "REK2CBO2T9ATE", "Overall": "3.0", "Content": "I like my Octane, basically because it's very much like my enV3 I passed down to my granddaughter.  BUT ... even though it's set at HIGH, since the speakers are inside the phone, with no outside opening, it's not very easy to hear when it rings.  I have to put the phone face down to hear it a little better if I'm not right next to it.  The other problem is the 2-minute reminder if I miss a text .... it's VERY LOW, and there's no way to make it louder.  I check the phone often to make sure I haven't missed a text or call.", "Date": "May 31, 2014"}, {"Title": "Great Deal!", "Author": "Cathy Wright", "ReviewID": "RM50XA4YI4BPH", "Overall": "5.0", "Content": "I needed a replacement phone for my son who is very hard on these little devices. This was a great low cost solution, which arrived in perfect shape. It's exactly what was advertised.", "Date": "May 29, 2014"}, {"Title": "LG OCTANE CELL PHONE", "Author": "Pattilu \"patti\"", "ReviewID": "R3W0OWZQ2WUMX9", "Overall": "5.0", "Content": "This is my second LG octane cell phone i just love this phone and i do not want a smart phone i was glad i found this phone on line because Verizon does not carry this phone anymore and i did not like the choices they had in there stores.", "Date": "May 25, 2014"}, {"Title": "New Verizon LG Octane Cell Phone", "Author": "Sharon L Calkins", "ReviewID": "RK8XXDR3MFC3Z", "Overall": "5.0", "Content": "I love my new Verizon LG Octane Cell Phone.  It is easy to use.  My only problem with this phone is that the keys are too small for my fingers.", "Date": "May 17, 2014"}, {"Title": "Great Replacement for Basic Phone", "Author": "VideoJockey", "ReviewID": "R39PVDZPZANKY6", "Overall": "5.0", "Content": "We got this phone to replace my daughter's broken phone. So far she loves it! The keyboard works well, and the phone seems very sturdily built - better than her previous phone, which was also an LG. The phone and accessories look to be in 'like New' condition.", "Date": "May 17, 2014"}, {"Title": "stands the abuse", "Author": "Kindle Customer", "ReviewID": "RRYLDVRGFJC91", "Overall": "5.0", "Content": "Although this is .it a smart phone, it is a sturdy, dependable phone for all who want a singleplease basic phone.", "Date": "May 16, 2014"}, {"Title": "Great Phone.", "Author": "Joannacol", "ReviewID": "R1Z2DL5S3LL52K", "Overall": "5.0", "Content": "Got this for a Birthday Gift. It was a hit. Wonderful phone for those who love a basic phone. He had broken his, and this was perfect. Thanks Amazon for having just about anything.", "Date": "May 15, 2014"}, {"Title": "this phone is just what I needed", "Author": "Wyoming", "ReviewID": "R4EC6W9YHY306", "Overall": "5.0", "Content": "Easy to type and text, nice big qwerty board. This is a flip phone which in my opinion is easier to use than phones that \"slide\". The battery doesn't seem great, but maybe I need to let it completely discharge, then fully charge. Had no trouble whatsoever with the seller. Phone arrived new in a Verizon box. You will have to read the user's manual online, as there is no printed version included. Verizon activated the phone for me, but I think you can do that online. If you don't need a fully-smart phone this is the best option.", "Date": "May 11, 2014"}, {"Title": "This is my 3ed Octane....ran over the last one", "Author": "Ralph H.", "ReviewID": "R2DA7ILKIQKMAO", "Overall": "5.0", "Content": "This is the greatest phone ever...I don't need a smart phone...I have an Octane which is the closest thing to a smart phone without being one...I have a laptop at home and I don't need to carry a computer with me. The Octane has an incredible navigation system...It takes me where I need to go", "Date": "May 5, 2014"}, {"Title": "Phone not working right.", "Author": "Boni Gamradt", "ReviewID": "R115X6S6FKNGTA", "Overall": "3.0", "Content": "Its was what I wanted but had to send it back cause some buttons didn't work. The Bluetooth didn't work and the reception was bad. Could not program the phone.", "Date": "May 3, 2014"}, {"Title": "Arrived as described, works perfectly", "Author": "Dymphna10", "ReviewID": "R1408ZCXSKMAER", "Overall": "4.0", "Content": "I ordered this as a replacement for my other \"dumb phone\" when the screen went out and I effectively lost all of my contacts. I was concerned that it wouldn't work with my Verizon plan (I'm currently done with my contracted time so I wanted to bring in my own equipment at way less than retail rather than having to start another 2-yr agreement). The phone arrived, powered up, activated easily (I didn't even have to go online to do it), and I was in business.", "Date": "May 2, 2014"}, {"Title": "Great deal", "Author": "Alan J. Franzi \"AJF\"", "ReviewID": "R2YWEQVEBZRDJF", "Overall": "5.0", "Content": "The phone worked well as a replacement for a lost hone . I saved a lot of money as I was in mid contract..", "Date": "April 28, 2014"}, {"Title": "Enjoying the phone!", "Author": "Pegogo", "ReviewID": "R1OSY9FX50CAWF", "Overall": "5.0", "Content": "The phone works wonderfully!! It was a lot cheaper than going to Walmart for a prepaid phone. I love this phone it is so much like my old envy.", "Date": "April 24, 2014"}, {"Title": "Perfect for me!", "Author": "blessedone79", "ReviewID": "R15JPQSJ98UH06", "Overall": "5.0", "Content": "I've had this phone for about a month now and I'm very happy with it. I didn't want a phone that required that I pay for data each month.  I'm on the computer constantly at work and I really don't like the idea of walking around with a little computer in my purse.  The voice clarity is much better than my old Samsung, and it is real easy to use.  I would buy this phone again.", "Date": "April 21, 2014"}, {"Title": "They need to keep making this", "Author": "Kim Ranger", "ReviewID": "RBZSSMTZ5FFYN", "Overall": "5.0", "Content": "I already have this phone and didn't want to get a different one so I bought another one! I love this!", "Date": "March 28, 2014"}, {"Title": "Enjoy", "Author": "Janell Langston", "ReviewID": "RCHWS1UXE13XE", "Overall": "5.0", "Content": "I like this phone because of the keypad I have  very bad arthritis in my hands The numbers on the keypad feel as if they are raised a little it also looks nice I would recommend", "Date": "March 21, 2014"}, {"Title": "Very Happy", "Author": "J", "ReviewID": "RE6GN5SYFDNQ3", "Overall": "5.0", "Content": "I wanted the same model as my previous Octane Cell Phone.  .  It is so functional and I am able to talk and text(with the buttons) easily.  Touch screens are very frustrating and messy.  Two screens front and inside make it much easier for viewing.", "Date": "March 16, 2014"}, {"Title": "New Verizon LG Octane cell Phone", "Author": "Christine Hyman", "ReviewID": "R32OIYVS6RUJ6A", "Overall": "4.0", "Content": "It was a good phone and they said it had a little scratches on it and that was all. Otherwise it works good.", "Date": "February 24, 2014"}, {"Title": "Sorry", "Author": "miriam kaplan", "ReviewID": "R3OETDX0H92JG4", "Overall": "1.0", "Content": "I chose to rate this 1 star because I got the phone on time and all but I got it broken i don't know if it broke en route or they sent it to me broken but I got a broken phone", "Date": "February 10, 2014"}, {"Title": ".", "Author": "Dusty Wulf", "ReviewID": "R2OB15SRA087DM", "Overall": "3.0", "Content": "I have had several of this model phone, this one shuts down when it feels like it and it takes fuzzy pics. I have never had that problem with any of my other phones that were just like it. Very Disappointed! ! !", "Date": "December 9, 2013"}, {"Title": "Need data plan!", "Author": "Feinli", "ReviewID": "R1CVF3BYIS6RL6", "Overall": "2.0", "Content": "In the review, it's said do not need a data plan, but it actually does need one! And it's so complicated to return it and get the refund!", "Date": "September 26, 2013"}, {"Title": "worst phone I've ever had", "Author": "New Moon", "ReviewID": "RJW9CAC9JRN7P", "Overall": "1.0", "Content": "I did NOT purchase from this seller.  I purchased it directly from Verizon.  This phone lasted six months and fell apart.  I am not hard on my phones at all.  I even purchased a protector case for it, and it still fell apart.  The hinges became loose, and the phone no longer stayed closed.  I have two friends who have the same phone, and a similar problem is happening to them. Very cheaply made.  I went out and searched for a used LG Env2 phone like the one I used to have--that phone is a tank (awesome).", "Date": "June 22, 2012"}], "ProductInfo": {"Price": "$77.38", "Features": "30 DAY RETURNS ACCEPTED! 100% SATISFACTION!", "Name": "NEW VERIZON LG OCTANE CELL PHONE!", "ImgURL": "http://ecx.images-amazon.com/images/I/41k6XrtakTL._SY300_.jpg", "ProductID": "B007PWGO4W"}}