{"Reviews": [{"Title": "Perfect for what is is designed to do! (This is not a top-of-the-line kind of phone!)", "Author": "John I. Gonzales", "ReviewID": "R2TAY53I1CG06P", "Overall": "5.0", "Content": "I just got this phone for my wife. I of course set it up and played with it until she ripped it away from my finger tips! I have to say... for a free phone the LG VIPER is just awesome!As much as I like it you have to keep things in perspective... this IS NOT meant to compete with the super phones like the EVO 4G LTE or the Samsung Galaxy III LTE... or the Google Nexus. It is far above the \"entry level\" class of phones too! I have to admit, I felt like I was cheating my wife by getting a \"free\" phone for her... but after using it I feel that I ripped Best Buy for getting the phone free on an upgrade... and trading in her old EVO 4G for a $65 credit! This is by far the best free phone I have ever seen.... and I worked for Sprint as a store manager for 4 years.So here are some bullet points on why to consider the LG Viper;* Smallest of the 4G LTE Android phones - For my wife the size of the other LTE phones was a tad bit too big. The size of this phone is perfect for her.* Speed - This phone hands down \"smokes\" the EVO 4G that she had. When I was doing updates I was amazed of the speed of the phone. This thing is a fast and powerful as you need!* Covers the basics well - Good camera, access to the web, facebook, gmail, apps, etc. For the NON TEENAGER... this phone works very well! If you are a a power user (business or teens) then you may want to explore the higher end phones. But if you need a phone for your day to day basics this phone is for you! (and then some!)* Value - Like I said, I cannot believe that this phone is free. If money is a consideration then look at the LG Viper before dropping $150 to $200 on a larger more powerful handset... then look at this phone and compare the \"true\" needed features that you will use daily.* Sprint LTE - It is coming... when it does you will see a huge performance gain compared to the old WIMAX 4G network Sprint uses. So you are buying the newer technology, not the old one. (Check with Sprint to see when your area is scheduled to get 4G LTE)* This phone currently runs on Android 2.3 (older version)... but from what I have read it is getting Android 4.0 (Ice Cream Sandwich)... so you have a huge upgrade coming in the future! (Which helps \"future proof\" this device)Here are a few reasons why not to consider it;* Small phone - In my hands the EVO 4G LTE fits a lot better than the LG VIPER. The Viper is too small... and I feel like it will slip out of my hand easily. This can be solved by using a protective case (since they have a better grip material)... none-the-less, it is too small for me, but perfect for my wife!* If you have to feed your ego - LOL, I am serious, some people have to have the BEST, most top of the line phone out there... this one is good, but not that good!* Screen size - The trend is to make phones big enough to use as a \"small tablet\"... yet small enough to still be a phone. Having a 4.7\" screen is significant enough compared to the LG Viper... but the Viper's screen is big enough for normal \"regular people\" usage. For example, I would NOT watch a high-def movie on any phone, regardless of screen size... that is what my 55\" HDTV is for! So having a larger screen is not necessarily \"critical\" for our needs.For the money, the LG Viper is HARD to beat. It is very powerful... so I can see it being useful for the above average users as well. The only group I do not see adopting it is the HARDCORE power junkies out there. But for the more average phone users out there this phone is just awesome!", "Date": "June 21, 2012"}, {"Title": "Happy with new phone", "Author": "Kristian Faulkenberry", "ReviewID": "R3PATFQ1U4NFX4", "Overall": "5.0", "Content": "If you are reading this review then you too are looking for good and bad to help sway your purchase. Be sure and write your own review when you decide to buy something to help out other people. As I write this, there are only six reviews For The LG Viper 4G LTE on Amazon so I thought I would add mine.Purchased the LG Viper two weeks ago on Amazon since they had a discounted price ($0.01) compared to Sprint ($59) with my two year upgrade. I think I am exactly the customer this phone was designed for. I like new technology, but I am not willing to pay $150-200 for a new phone, so when this one came out that was on the 4G LTE network, had a fast processor and great screen, I immediately went looking at reviews. CNET had reviewed it, as well as Endgaget and several others. They all spoke of the green construction and great camera, but it came out in April and was followed by the \"high dollar\" phones from Samsung and HTC so you didn't hear anything about this phone after that.The LG Viper 4G LTE is a very nice looking handset that has a lot of amenities. The weight is good and the size is near perfect for me. I may eventually go with a case for it, but currently don't see an immediate need to. Normal use and keeping it in my pocket have not shown any scratches or wear on the exterior. It comes with a 4GB micro SD card so storage has not been a problem. It says it will support a 32GB card if you want to carry all your music with you.I was upgrading from another LG phone, the Optimus S, so the button layout was the same. It was a change switching for physical buttons to soft keys, but having them in the same place made the transition easy. The extensive use of recycled materials is a nice feature, but doesn't sway me one way or the other. The phone was released on Earth Day and I am sure they thought the \"green\" construction would sell more phones, but I am not sure it did. The Gorilla glass was something I had not had before and I am very impressed with...I will be looking for this feature on the next phone I upgrade to. But I was more concerned about the telephone reception. I like have the ability to search the internet when I have a question or have more entertainment options when I am bored but I need a phone to also be a phone! The LG cell reception is equal but not better with the Viper vs. the Optimus S in outlying areas; Both were fine in full coverage. I have no home phone and just use the cell phone, so this was important to me. It does seem to work better while roaming then the Optimus did. The Viper does not sound \"tinny\" as the professional reviewers have said and I don't have a problem with the external speaker either. At full volume the speaker is too loud to have close up but perfect to have in the cup-holder giving me turn by turn directions. I have used the camera for taking quick snapshots and brief video, and while good enough for Facebook uploads, I will not be using it as my only camera. If this is important to you, go to one of the stores that carry phones and play with it. You may be more impressed than I was.Others have spoken of the dismal battery life, but I have not seen it. If you have not had a smartphone before, they all are this way. The Viper is better than my previous smartphone on standby and normal use, but using it as a GPS runs it down faster. My best time has been 15 hours with no Bluetooth or GPS on, but wifi was on. The worst was 7 hours with the last two using as my GPS and having the display on the whole time. I have not had as much problem with battery use when on wifi; I was able to watch two Netflix TV 30 min episodes while trying to run my battery down from 15%. You will have to judge your own phone, but this is plenty for me. I already had to keep a phone charger with me at work, so I don't balk at having to do the same now. As for speed, the processor is much faster than what the Optimus had, so downloads are speedy and normal page loading is very quick. As said before I can watch Netflix and play fast moving games without the buffer problem I had before, so I can say I am very pleased with performance.Unfortunately I do not live in one of the 15 released areas with Sprint 4G LTE, but plan on trying it out in Baltimore next time I go. The speed should increase, but I also expect the battery life will decrease. I will update when I have more info. Bottom line, I am happy with my phone. It was one I would have been happy had I paid more for it, and I felt that it had not had enough good reviews to do it justice. If you are not looking for the newest phone to show off to your friends, you will be happy with the LG Viper.**************Update 23 Mar 2013**************Still very happy with my phone, screen has held up well. I have been able to leave a few scratches in it, but I do not have a case or screen cover on it; I am surf if I did, they would not be there. The back, being plastic, shows much more wear and though I am not happy with this, I will not deduct a star for it. Making an all aluminum back would have pushed the price much higher and gone away from the green theme that the phone was released with. Battery life has continued to be where it was and I found that while overseas, I can run the phone in airplane mode with wifi on and get more than double what I was getting before (no Sprint service here, so no need to waste battery searching for signal.) Again, there are many phones out there that will beat this one, but it was still free with upgrade last I looked and it is plenty powerful running ICS, so it is the best bang for your buck.", "Date": "August 18, 2012"}, {"Title": "Surprisingly good device", "Author": "M. Mejia \"nakmario\"", "ReviewID": "RHIBF5AT3W94Q", "Overall": "4.0", "Content": "At $99 at Sprint (sorry Amazon, bought through Sprint), i thought this device would be a 'whatever' simple Android phone. But it's actually speedy and responsive.The battery life is bad but not worse than other Android phones - which is why i use JuiceDefender (app) to keep my battery lasting all day.HW quality is solid, though i wish the back cover were rubberized. NFC is cool, takes a while to get used to it and get into the mode of pulling out your phone instead of your wallet.I'm not gonna hold my breath for Sprint to turn on LTE here in San Diego, so i can't say much about the LTE capabilities BUT as a 3G phone, it's solid.", "Date": "May 2, 2012"}, {"Title": "fed up with this phone", "Author": "webcat48", "ReviewID": "R305Z8BDKV9Z2B", "Overall": "2.0", "Content": "I made  a review at sprint. Com one week after I recieved  it.  I have tried to update the review but sprint won't allowed me to alter it or even write a new one.My newest assessment of this phone sharply contrasts with the old. While I like this phone in general, one major issue,  and I mean major!,  is the battery life.  It is the worst!!!!!  You cannot use the phone's functions for half an hour without the battery draining significantly.  I spend most the day constantly recharging it.Now LG has given us an update for the Android os to 4.0 which is great in thought.  Now my phone is super buggy,  slower than ever in loading anything and I'm also getting dropped calls very often.I am ready to throw in the towel,  pay a ridiculous early termination fee and go elsewhere because it is only a daily source of frustration.  Thank  you black Friday!  You're  the perfect opportunity  for me to get a great deal on a fabulous  HTC phone!", "Date": "November 22, 2012"}, {"Title": "So far so good...", "Author": "The Hat Diva", "ReviewID": "R3BZLQNWMMVZNW", "Overall": "4.0", "Content": "I just received my LG Viper this afteroon(6/5) and couldn't be happy with it so far. I've had LG cell phones in the past that worked very well for me so I thought I would give it another chance. The last phone I had Samsung Intercept that gave me nothing but trouble( had to replace the touchscreen once and had it replaced the total phone twice.) So far I was able to downdload apps that my Intercept wouldn't let me do. I took a picture of my son with the phone and it came out clear as day. I know the battery life is a little iffy but I think that I can work with that. I did download an app killer to see if that will help extend the battery. I'm home alot anyway so it easy for me to plug it in when needed. The phone is a little bigger than my Intercept, but it fit well in my wristlet purse. I felt that Amazon gave me a great deal with my Sprint upgrade I only paid $19.99 with free two day shipping ! Sprint would had charged me $86.00 for the same phone !! I'll come back to Amazon when its time to upgrade again. Thanks Amazon. I'll come back later to let you know if I have any problems with my Viper.", "Date": "June 5, 2012"}, {"Title": "My first smart phone", "Author": "llesaag", "ReviewID": "R23OJGAPCF03G5", "Overall": "4.0", "Content": "Got this phone about 2 weeks ago and Love It!!  Had a blackberry previous to this phone which was nice but the LG Viper is like going from a horse drawn carriage (blackberry) to a Viper - race car.  The only complaint I have is the battery life, but then I guess all smart phones have short battery life. I have a car charger and plug it in while driving. Also the touch screen is very sensitive, but then I'm not used to it.  There are a lot of widgets on the phone which I probley will never use, but they don't seem to slow it down at all.  Again I'm very happy with it. Very good phone sound quality and screen quality and also the camera is very, very good.  I would recommend this.", "Date": "June 1, 2012"}, {"Title": "Worst Phone I Have Ever Had", "Author": "Thaddius Mumford \"Shop Saver\"", "ReviewID": "R21AQFW66HHY8I", "Overall": "1.0", "Content": "The LG Viper 4G LTE (LS 840) smartphone on the Sprint network has been the worst experience that I have ever had.  I switched from AT&T; to Sprint so I could get unlimited voice, data, and text.  Now I am not sure if switching to Sprint was the right thing to do.  I have had numerous call drops, garbled voices, and tower signal fluctuations.  I rarely get a 4G LTE connection and when I am in range of a tower, I don't see 6 Mbps Internet speed, I am getting less than 1 Mbps and even then it is slow.  I have complained about downloading Apps that sometimes take over a half hour yet the file size is a mere 2 megabytes!  As for the phone (not sure if all this has to do with the phone or network) but for sure, the phone stinks.  The battery life for this phone is terrible.  The phone on standby won't even last a day at work.  If I use it to make a few calls and use GPS, then forget it!  The phone is dead in about four hours.  Also, this phone gets very hot!!!!!  I cannot use the GPS in my vehicle for more than an hour and the phone heats up and I get a warning message that the phone is overheating and then it turns off right when I need it most, traveling using GPS to guide me.  This phone sucks.  The makers of this phone (LG) need to get some design engineers that know how to make a phone.  I absolutely hate this phone.  Don't get it.I recently had a terrible experience.  A family member had been stung 30 times by a hive of yellow jackets, I received a call from my family member's neighbor and then my phone drops the call.  I called 911 to get help to my family member and the phone dropped the 911 call!!!!!  That was it for me.  I called Sprint and demanded a replacement phone.  They agreed, and are sending another LG Viper.Sprint won't let me switch to a better phone because my 2-year contract with this junky phone just started a couple of months ago.  Now I just hope the Sprint network is not the reason for all these horrible dropped calls. I do believe the phone is definitely a piece of junk.  It does not pull in the signal and it gets extremely hot.", "Date": "September 9, 2013"}, {"Title": "The Viper is lurking", "Author": "Robert J. Allen", "ReviewID": "R3EB9N8YWYXR7S", "Overall": "5.0", "Content": "The lg viper is a great phone ive had this phone  for 3 days and i also got one for my fiance for free and didnt pay anything battery life is good and using the stock charger charges the phone very fast and the phone core process is great im just waiting for sprint to bring out the 4g lte.", "Date": "July 15, 2012"}, {"Title": "GREAT PHONE with a GREAT DISPLAY", "Author": "dg1", "ReviewID": "R2KFSOQI7BQDMH", "Overall": "5.0", "Content": "Just got my new LG Viper 4G LTE...and so far this phone is Awesome gets the job done.  Sound,display,look and feel are Great. Just hoping to get LTE soon..3G in my area is a bit slow.  The Display screen is by far the best I've ever seen.", "Date": "June 4, 2012"}, {"Title": "Surprised and Happy", "Author": "shadowedby6", "ReviewID": "R3ARQ94TL7CJOQ", "Overall": "4.0", "Content": "I opted for this phone as I got it for a penny (thank you Amazon) :)  the many reviews I read prior to purchase had me a bit doubtful as to the battery life.  I am pleased with the life of the battery for my purposes.  My teens take the phone often and with my other phones they always returned it with the battery almost dead.  This phone hasn't come back to me near that yet.  I am a happy customer", "Date": "August 20, 2012"}, {"Title": "LG Viper 4G mediocre at best", "Author": "Pen Name", "ReviewID": "RU78XWPMY9270", "Overall": "3.0", "Content": "I have had this phone for over a year now, so It has had plenty of use.  The one positive aspect of the phone is that it WILL NOT break.  I have dropped it numerous times, including into a puddle of water, and it still functions.  When dropped, the back cover falls off, and battery drops out THATS IT.  Aside from a few small blemishes it looks fine, and works okay.  Performance is dismal, but what would you expect from a mid-grade smart phone offered for such a cheap price?  The phone lags even when sending text messages, especially when switching from one conversation to the next. I often have to reset the phone to clear the memory for it to operate normally. I use Facebook, Instagram, Gmail, Twitter, and a host of other social media apps, including google play music, pandora, and spotify.  The lag time can be up to a minute from the time I select the app, to the time it actually loads all the content (pandora espicially).  Battery life is another serious downfall if your into anything except making phone calls or sending text messages.  During a normal day (listening to music, surfing the web, few calls, social media) I have to charge the phone again, even after it has a full charge from the night before.  I bring a charger everywhere I go.  I bought the phone for 4G service but even after a year and a half, have not had a 4G signal for more than a few moments.  Even where I live my 3G service is intermittent (and I live in a populated area).  I'm not sure if it is the service or the phone.  On the plus side it has a small feel, and fits in your hand nicely.  It can slip into your pocket easily and takes up as much space as a few business cards, which cannot be said for larger phones.  I prefer smaller handsets personally.  The touchscreen is adequate, as is the main camera.  The front facing camera seems like an afterthought, and is not very good.Synopsis: The LG Viper 4G is adequate for someone who wants the very basic android experience, or who isnt concerned about living online.  It does basic tasks relatively well, and is a bargain for the price.", "Date": "September 13, 2013"}, {"Title": "LGViper", "Author": "Dogchat", "ReviewID": "R3OFIK24VSMM24", "Overall": "2.0", "Content": "Battery life is not good at all and you cannot use the 4g since Sprint does not offer it. Sound quality is poor and I get repeated dropped calls.not worth the money", "Date": "August 22, 2013"}, {"Title": "AWESOME", "Author": "cinderellaronda", "ReviewID": "RO1O8ESRKJ9GD", "Overall": "5.0", "Content": "My new LG Viper is so awesome. I was amazed on how easy all the features where to use. Speaker phone is awesome and makes hand free calls an ease. Uploading was very simple. It shipped in less than 48 hours. Not missing the stupid slide down QWERTY keyboard at all. I love how the phone turns on to standby fast when you are not using it and locked the phone. Smallest of the 4G LTE Android phones - The size of this phone is perfect for me. Speed - This phone hands down \"smokes\" the phone that I had. I was amazed of the speed of the phone. Basics are all there - Good camera, access to the web, Facebook, G mail, apps, etc. For the being my first smart phone it works very well! Before dropping $150 to $200 on a larger more powerful handset... then look at this phone and compare the \"true\" needed features that you will use daily. I feel like it will slip out of my hand easily. This was solved by using a silicone protective case. I can't say enough and could go on and on. Best deal I ever made!!!!! I was able to get 3 different accessories for this phone for under $8 (including shipping). Just have to love Amazon when it gives you a better deal than Sprint!  LG Viper 4G Android Phone (Sprint)", "Date": "October 13, 2012"}, {"Title": "not good", "Author": "Tiki", "ReviewID": "RF73SSCAAC6WV", "Overall": "3.0", "Content": "The phone overheated a few times battery life is very bad! This phone glitches a lot  well it's a free phone from Sprint what do you expect!  if I knew this I would never join sprint!", "Date": "December 22, 2012"}, {"Title": "Dont do it...", "Author": "Renlaan \"Renlaan\"", "ReviewID": "R3OWS9IJXFKO3H", "Overall": "1.0", "Content": "Horrible phone. The only reason I have this is because I broke my Galexy S2 and this was the replacement through the insurance.Its SLOW and unresponsive a lot. It drops WIFI all the time. The stock keyboard sucks. And you pretty much have to charge it at least twice a day. The only aps I have are FB and weather channel and its just horribly slow.If you can afford please save yourself the frustration and research a better smart phone!", "Date": "September 7, 2013"}, {"Title": "Tough customer", "Author": "RickSkinner", "ReviewID": "R2ECVTIDRCJKHN", "Overall": "5.0", "Content": "I was very pleased when I first got this phone.  The battery life is totally dependent on type of use.  GPS is a killer.  I still am very pleased with it.  I do have one complaint (not really).  When I bought it, it was not free on amazon and it may be the best deal out there on phones.  I have been looking for better since I need to get two more phones, but I may get two more even though I am tempted to see if the grass is greener somewhere else.  Looked and looked and now have two.", "Date": "October 30, 2012"}, {"Title": "Worst phone ever had", "Author": "Shawn Ference", "ReviewID": "R1P75MDCAYTZOB", "Overall": "2.0", "Content": "Overheats and absolutely no battery life!  It literally has melted two batteries. Due to the heat the phone drops calls, freezes, shuts off in mid conversation. Spend more time charging it then actually using it. Worst phone ever.", "Date": "December 25, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007SNSZTA"}}