{"Reviews": [{"Title": "Works As Advertised, Great Alternative to Apple", "Author": "nanietta", "ReviewID": "R1KCR6XS4PB3TD", "Overall": "4.0", "Content": "I'm using this product to view full feature length movies (mp4s) from micro SD cards on my Samsung Galaxy Note II.  Unlike its counterpart that was released by Apple for iProducts, this item has the ability to play directly from the card itself (without transferring to the device).  The Apple version also requires a specific folder and file naming structure (to imitate a digital camera), whereas this product doesn't require any fancy folder or file naming and can be opened simply by with a file managing app.  I also like how there is a light to indicate which source (SDHC Micro SD Micro SDHC or USB Flash Drive) is being accessed.  My one complaint is that it feels a bit fragile, and the design is such that some cases (such as otterboxes) will need to be removed for it to fit into the micro USB port.", "Date": "April 3, 2013"}, {"Title": "it works with Note 2 with a catch", "Author": "matt.mingkee", "ReviewID": "RLQ0IOU83QE0O", "Overall": "4.0", "Content": "Purchased from local store for Note 2 (T889 stock).It works right away when plugged in, but I only tested with USB flash drive (it shows USB A).Here is a catch: you can't charge your Note 2 even when the micro USB charge port plugged in, but you can use it to power the USB data port. USB speakers works when everything is set up.You cannot blame the adapter because the phone does not accept external power when it is in USB host mode, but the indicator should light up when USB charge port is plugged with power.This is a must for Note 2 users if they want to have USB flash drive access (no external power required).", "Date": "March 4, 2013"}, {"Title": "Great product for Galaxy Note 2 users works as advertised", "Author": "tony vitale", "ReviewID": "R3UXM7PKS4CLHJ", "Overall": "5.0", "Content": "Great way to download any computer file to and from your phone to sd and micro sd cards if your Note has the Otter box defender you will have to purchase a cord ($11.00) to attach to Note otherwise you'll have to take the case off to attach. WORKS as advertised!!", "Date": "April 25, 2013"}, {"Title": "Defective", "Author": "The Man \"thesherwood\"", "ReviewID": "R3K9ZN44WYROI9", "Overall": "1.0", "Content": "REceived the item on time, when I looked at the item the one side that holds theSD card slot, the guts were missing. Only the master receiving connector on the inside.Wouldn't it be nice if the shippers, took a look at the product before the spend my moneyshipping a defective item?", "Date": "February 13, 2013"}, {"Title": "Worked Great", "Author": "G M Howard Financial", "ReviewID": "R2KDEOA1KLB641", "Overall": "5.0", "Content": "This product was sent on time and worked great for me.  I will do business with them again in the future.", "Date": "January 23, 2013"}, {"Title": "It does the job well, needs different form factor", "Author": "theo kersjes", "ReviewID": "R20SZVA8OFAACG", "Overall": "4.0", "Content": "Work greate, use it on vacation. My first vacations without a laptop,or computer. Used 64GB in the phone to store photos from the cameras and videoIf you have a thick case it may need to be removed, else the connector can not go into the phone.", "Date": "September 7, 2013"}, {"Title": "THEY MAY WORK IF THE ADAPTOR WAS LONG ENOUGH", "Author": "Winstone66 \"Winstone66\"", "ReviewID": "RD1HT27TTGG4H", "Overall": "1.0", "Content": "THE ADAPTOR IS TOO SHORT TO FIT INTO THE OPENING ON THE PHONE SO YOU NEED TO SPEND AN ADDITIONAL $15 TO BUY A DONGLE.", "Date": "June 23, 2013"}, {"Title": "works", "Author": "Quinn", "ReviewID": "R2M35OFF0W3MCU", "Overall": "5.0", "Content": "I'm glad I purchased this. So that don't have to via bluetooth to my devices. This is faster to do, If I want more data off a memory card. I use it with all my phones, it works. .", "Date": "January 10, 2013"}, {"Title": "Doesn't work", "Author": "T. Roberts", "ReviewID": "R3P94KYZ4PAQMV", "Overall": "2.0", "Content": "I tried this on my Note as well as three other devices. It didn't work on any of them and actually caused one to freeze and then reboot just by sticking it in. Can't recommend it.", "Date": "October 7, 2013"}, {"Title": "nice gadget for samsung galaxy note2", "Author": "zandro cabaral", "ReviewID": "R3DY2F1YYM6D25", "Overall": "5.0", "Content": "Very nice gadget for samsung galaxy note 2. So easy to use and handy. Very light in weight and is very useful for people like me who keeps on travelling. I suggest students should have this gadget so they can transfer  notes from usb to their mobile.", "Date": "August 15, 2013"}, {"Title": "not at all what it seems.....:(", "Author": "riley", "ReviewID": "R203HR4GC9M8L", "Overall": "2.0", "Content": "This `thing' doesn't do a darn thing.  You can plug it in, place a flash drive, camera chip, usb what ever-NOTHING happens.  BEWARE..", "Date": "September 24, 2012"}, {"Title": "dont buy waste of money", "Author": "Airreea Hayes", "ReviewID": "R127TC8HL0APBI", "Overall": "1.0", "Content": "It doesnt work. I followed directions the phone never reconized it. I was disappointed because this device would have made my life easier.", "Date": "November 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00790RY0S"}}