{"Reviews": [{"Title": "Not a Brand New Phone as Advertised", "Author": "B.C.", "ReviewID": "R1FO366CKZSVON", "Overall": "1.0", "Content": "Stay away from this seller.  Bought what I thought was a brand new Samsung phone.  Received it, started to charge it and screen kept coming on and off even though phone was turned off.  After fully charging, battery won't hold a charge.  Called Samsung, took my IMEI number only to find out the warranty on this phone expired in 2011, the charger is not a Samsung charger and the battery is not a Samsung battery.  Not a happy Amazon buyer.  Amazon needs to drop this seller!", "Date": "August 30, 2012"}, {"Title": "easy to read", "Author": "curley", "ReviewID": "R30C23EXKZK2PP", "Overall": "5.0", "Content": "Great little easy to use phone, my wife likes it because she can enlarge her text messages to read them easier.", "Date": "October 4, 2013"}, {"Title": "easy phone to use", "Author": "R. Y. Tan \"sunnie\"", "ReviewID": "RKBOTIF6PLIZX", "Overall": "3.0", "Content": "I brought this phone for my husband who needed something easy to use. It has the 10 key as well as the qwerty keyboard in case he should ever need to send a text. The menu is easy enough to use but I don't like the fact that I have to go to the menu when I want to do something like sending a text or use the clock or calculator. However this is for my husband and it is okay for him for his needs and wants. For the price I can't complain.  The seller had the phone delivered to me within the time frame I was given. I would recommend this phone for someone who needs basic phone with access to the internet.", "Date": "October 12, 2013"}, {"Title": "excellent", "Author": "Frank DeLucca", "ReviewID": "R32Z05QB7XQ9GQ", "Overall": "5.0", "Content": "a refurbished item restore to original specs...it works graet..Samsung definitly a leader in cell phone products, better then Iphone it is", "Date": "January 5, 2013"}, {"Title": "it has not been working right.", "Author": "ARLEY NOZAWA", "ReviewID": "RQLSKH2O0P0AU", "Overall": "1.0", "Content": "It has not been working right.  It has been turning itself off and on.  so disappointing.  don't know what to do", "Date": "January 29, 2014"}, {"Title": "went totally black", "Author": "Millie Rice", "ReviewID": "R4YMGWOEK5X1H", "Overall": "2.0", "Content": "I would not recomend this seller to anyone. I bought a refurbished samsung Gravity 3.Sept 11 2013. when I received it it waspretty. It stopped working Dec. 18th. went totally black. I was told warranty was out. I asked if I sent back would they repair at my costbut got no responce. Its still pretty but don,t work. I bought another but not from this seller. My favorite phone. Me and my familyhas 5. I love amazon but not this seller. Seller was cellular Gallery INC.", "Date": "January 7, 2014"}, {"Title": "Great Deal", "Author": "Tristan Stone", "ReviewID": "R1EL0746KZQPC2", "Overall": "5.0", "Content": "This product was a great deal it works great and I enjoyed the more advanced features compared to the gravity 2", "Date": "August 9, 2013"}, {"Title": "poor battery life", "Author": "Zosia", "ReviewID": "R3A4KSWCEQ5SQ3", "Overall": "1.0", "Content": "Ordered this phone for my daughter, she liked the phone but it would not hold a charge for more than  several hours  with very minimal talk/text time; fully charged in AM but died before she got home from work in the late afternoon. Noticed that the battery that came with the phone was not a Samsung battery even though the phone was supposedly new. Returned without a hassle and ordered another - second one was even worse, charge held for for only a few hours, only few minutes of this was talk time. Don't know if this is a poor quality phone or we just got 2 defective ones. Too bad because the phone had many nice features. Both phones were purchased from Unlocked Cell Phone King. I had purchased another phone, different model, a short time earlier from this same seller without a problem.", "Date": "September 30, 2012"}, {"Title": "Battery problems", "Author": "J. Hardman", "ReviewID": "RK2KEYTAE2NNB", "Overall": "3.0", "Content": "A great phone except for power problems.  The battery didn't hold the charge very long.  Had to turn the phone off to charge it.  And then it would take 4 or 5 tries each time to turn it back on.  May have just gotten one with problems.", "Date": "September 28, 2012"}, {"Title": "great battery life", "Author": "C.J.", "ReviewID": "R158BBLOEJEZG3", "Overall": "5.0", "Content": "Great battery life. Good standard phone. great for normal usage. just wish I could turn the mobile network off but oh well.", "Date": "September 7, 2012"}, {"Title": "Terrible phone, AVOID", "Author": "Mook \"Enjoy Every Moment\"", "ReviewID": "R1D7SHF7O4H2XW", "Overall": "1.0", "Content": "This phone is cheaply constructed, has poor form-functionality, and feels like it was manufactured 15 years ago.  Not a good match for ANY ONE, including the budget consumer.  You'd do better writing paper letters and mailing them.  Avoid avoid avoid.", "Date": "January 27, 2013"}, {"Title": "Samsung Gravity 3", "Author": "Mells", "ReviewID": "RK6K4SPZ481EE", "Overall": "4.0", "Content": "I just bought a Samsung Gavity 3 and I do like the phone. Although I don't like how there is no reject button for unwanted calls or that the emo-cons are plain, I do love how clear the music player sounds and how loud it can get. On my other phone if I received unwanted calls, I could put the number on a block list so whenever they called, it would go straight to voicemail. Still trying everything to see how it works but overall, a great phone. I would recommend this phone.", "Date": "September 4, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007J66HF0"}}