{"Reviews": [{"Title": "Some of us don't want/need a smartphone!", "Author": "MdniteEagl", "ReviewID": "R2SLQ4Y5ZMY826", "Overall": "5.0", "Content": "I've had the original Samsung Rugby A837 since it came out in September of 2008.  It's been a good phone all these years, but I was ready for an improvement.  Unfortunately, everything was headed the smartphone route (even the Samsung Rugby line has migrated to a smartphone), and the remaining \"phones\" were aimed at the truly \"basic\" market, like the Pantech Breeze line.  For me, I just don't need to carry what is essentially a nanocomputer with me; I just want a phone for calls and quick texts, maybe check a sports score, and grab a basic picture once in a while.The LG A340 came almost out of nowhere in April 2012, and after reviewing the specs, I jumped on it.  I qualified as an upgrade from AT&T;, so it didn't cost much at all ($19.99 for me), and it arrived in a couple of days.  The first thing you will notice about the A340 is that the screens are HUGE for this type of phone.  The external screen is a remarkable 1.7-inch 128x160 - not that long ago, that was a typical size for the *internal* screen!  The A340's inside screen is a 2.4-inch 240x320 that's very clear and sharp.  Another thing I like is the clock reading on the internal screen doesn't take up an unnecessary amount of space, so you can actually put up some wallpaper that you can see without having it obliterated by what time it is.  Not the case for the external screen though; wallpaper or not, the date/clock is just below dead center.The sound quality is pretty good during phone calls (no issues hearing or being heard), and the keys respond quickly for basic texting.  The camera is only 1.3 megapixels, so you're not going to replace a true camera with this, nor should you expect to.  The camera has one drawback, though... the lens is on the back of the lower body (above the battery door) so you have to be very mindful of keeping your fingers out of the way when lining up and taking pictures.  You'll also want to clean off the fingerprints before you take a picture, as your hand will otherwise normally be over the lens.The A340 comes with a basic WAP browser, but AT&T; does include its new Social Net app that allows direct access to Facebook and other social networks.  Again, it's not a smartphone, so don't expect to watch movies with it.  The A340 also handles AT&T; Navigator for driving directions, and a few other built-in applications that may make life easier for some.Physically, the A340 isn't as thick as the Rugby I'm replacing (and I did like the feel of the Rugby for that reason), but it's not wafer-thin, either.  The A340 is very long when open, easily reaching from ear to mouth like a normal phone handset, and is over 2 inches wide as well... us guys with larger hands can get a comfortable grip.  Battery life is listed as 3 hours talk and 250 stand-by, about the same as the Rugby, so no issues there.  The A340 is also a \"greener\" phone, using recycled materials for the case and an energy-efficient wall charger.This is what I want from a cell phone... a well-featured, full-size flip phone without too many bells and whistles.  Thanks LG and AT&T;!", "Date": "April 13, 2012"}, {"Title": "FULL OF CRAPWARE THAT CANT BE DELETED", "Author": "glnz", "ReviewID": "R2WV6Y8G3FMLC6", "Overall": "1.0", "Content": "This would be a decent voice \"dumb\" phone except that AT&T; and LG have loaded it FULL of crapware that CANNOT be deleted.  Ignore what you might see on the AT&T; web site - NOT ONE of the numerous idiot apps has a \"Delete\" option.  This phone is designed to trick you into using data.  Here are the apps that I cannot delete:- Star Tweets- Wikimobile- snap- UNO- Pac-Man Champion- My-Cast Weather- Bejeweled- Maps- City ID- Browser- YPmobile- Mobile Web- AppCenter- AT&T; Navigator- AT&T; FamilyMap- Social Net- AT&T; RadioBut wait - it gets worse !!  My speed dial menu is ALREADY POPULATED with the following AT&T; numbers that always appear at the top of the list and CANNOT BE DELETED OR MOVED TO THE BOTTOM OF THE LIST:- AT&T; Check Bill Balance- AT&T; Customer Care- AT&T; Directory Assistance- AT&T; Pay My Bill- AT&T; View Data Usage- AT&T; View My Minutes- AT&T; VoiceDialBecause these seven appear at the top of the list, the speed dials for my family members DO NOT APPEAR ON THE SCREEN unless I scroll down.  THERE IS NO WAY TO CHANGE THIS.I have now spoken with AT&T; four times about this.  AT&T; has finally admitted that NONE OF THESE CAN BE DELETED OR MOVED.So - it's your call.", "Date": "August 11, 2012"}, {"Title": "Great non smart phone option", "Author": "shuebacca", "ReviewID": "R1RNP8F3WBJ0UF", "Overall": "5.0", "Content": "It's almost impossible to find a non smart phone these days.  Your options are limited to crappy made in China phones or Nokia phones circa 2001.In looking for a phone for my father, I wanted something simple, easy to use and cheap.  I was able to get this on an upgrade for 1 cent.  Amazon literally charged me 1 penny on my credit card.  No rebates to deal with and in California no sales tax on the full price of the phone.I really like the flip design of this phone, it prevents accidental butt dialing.  Easy operation, open the phone to answer the phone and close it to hang up.  I was able to transfer contacts easy enough by simply copying them to the SIM card and back again to the LG phone.Another plus is the ability to increase the font size, for the overall menus and the screen where you dial a number.  The large displays already help a lot, but the bigger fonts make it even easier.One minus with AT&T; is the inability to remove the default AT&T; contacts from the phone.  There may be a way to do it but I'm still trying to figure out how.", "Date": "May 24, 2012"}, {"Title": "The one to buy. Great Senior's Phone", "Author": "John Frederick Hill \"american consumer\"", "ReviewID": "R103BSVTUS0BDQ", "Overall": "5.0", "Content": "LG/AT&T;  saw a niche (the U.S. Seniors Mkt) did some research and made a good 3G phone/2G EDIG) for us.  i.e., They accounted for high frequencies hearing loss by Seniors.  This phone has a capability to deal with it.  I have had the phone three weeks. Seems to have enough battery. Comes with a USB type a/c wall charger. Good phone sound and the text is easy to read.  I believe there is a capability to block selected unwanted incoming (phone numbers)  calls or messages.  Saw it someplace while tinkering with the phone just can't recall where its located. Well written manual (PDF) is available on line. Can't locate call block in there either.If you want you can set up voice commands to make the phone dial for you plus several other verbal command functions.  If your laying on the floor and can get the phone open you can tell it to call someone on your list of phone numbers.. and it will do it.  When your at Best Buy just tell them what you want the phone to do and they will set it up for you. Service is the one thing that Best Buy is better at then Amazon.  Something the bozo's that run Best Buy don't seem to understand.  The A340 has lots of alternative sounds, ring/vibration and other settings.  When the phone rings the screen on the front shows who's calling or what the text message says.  Just flip it open to talk or see the message on the larger screen.  Push a button and it switched to a loud speaker phone.This is not a $400 Apple. It's a free (sorta) phone from AT&T; via Best Buy and its loaded with capabilities that I have no use for.  I just handed over my 5-year old Nokia and Best Buy transferred all my phone numbers to the new phone and handed me the Nokia back. So I drove a nail through the Nokia sim chip and took the phone to the recycle center.  Best buy will also get you a new phone number or set-up an AT&T; account  if you want one.Bottom Line:  Most Seniors could care less about Facebook, maps and the mobile web. But it's all available in this phone for an extra $20 or so  per month.  Set it up and give it to Grandma. This one she should be able to use.", "Date": "July 8, 2012"}, {"Title": "PHONE OVERHEATS. JUNK", "Author": "neil", "ReviewID": "R203L054GJQOIC", "Overall": "1.0", "Content": "I purchased two of these phones. after a month of use if you use the phone for more than a few minutes it feels as if your ear is frying. And when it starts doing that the party that you are talking to cant hear what you are saying. This is not just on one phone but both of them which leads me to believe that this model phone is an ATT reject as they do not sell them on their website. Now the only thing that ATT can do is replace them with the same model.Why would i want two more of these? I just paid two upgrade fees and cannot get another upgrade until i am due for one. I am just using my old phones. Do not purchase these phones unless you really dont want to talk to anybody on them.", "Date": "July 23, 2012"}, {"Title": "LG A340 Phone (AT&T;) not supported well by ATT or LG", "Author": "Abe \"quantpro\"", "ReviewID": "R1NIE196F3JCPT", "Overall": "1.0", "Content": "The good first.  Calls are clear and as loud as you need.  It can take up to a 32GB micro sdcard.  Relatively large display.Now for the bad news. LG and ATT do not make backup software you can use on your PC called PC synch, very bad for anyone who values control over their contacts, calender and all other data. There is no backup command or restore command on the phone as all my previous Nokia's had. Hours with ATT on phone resulted in no help in transferring my contacts or Calendar.  If you have less then 250 contacts you can copy basic contact details only to your new sim card and then use it on your new LG a340. I have over 800 contacts.  I got a $25 credit for wasting my time from ATT then they told me to go to an ATT corporate store who had equipment to do those transfers.  They took my phones and told me that they cannot move the contacts because the LG a340 is not supported.  They told me to contact LG for backup software. I contacted LG and they told me the Carrier develops the software. I am now blue toothing one contacts at a time from my Nokia.  I will have to do the same with my calendar.  They promised that it would be trivial to transfer when I ordered the phone.  Excuse me I need to spend the next week manually transferring my contacts and calendar.  I'll come back and edit after I have more experience with this phone.Finished the A's and B's.  Still no luck finding backup software for this phone.  Another disappointment for a phone which can take a 32GB sdcard is that when I attempt to see files on that card which started off 90% full there is a very long delay accessing the memory card. I think it should only take a memory card it can obtain files from in a reasonable time frame not so long I want to leave it and get back later. Now to get my C's transferred. byeMore calls to ATT sent me to a Corporate store on the Upper West Side. Same problem as other store. Phone not supported.  Spoke with a new agent on phone, she agreed I must return phone and get a different one made by a company that provides backup software and possibly backup/restore command to sdcard.  LG A340 should be labeled Senior Phone. No way to back up except only contacts with internet to ATT cload. This is my first time returning a phone.  All my Nokia's had the functions I needed with sdcard backup and PC sync. If I don't like the next phone I will have to buy an unlocked Nokia and use that. Oh yes they gave me another $25 credit.", "Date": "June 21, 2012"}, {"Title": "Nice phone, with one major annoyance", "Author": "pfps", "ReviewID": "RBLVDT7TBX9B9", "Overall": "4.0", "Content": "This is a very nice phone, particularly if all you want to do is make and receive phone calls.  But then, what else is a mobile phone useful for?There is one major flaw with the phone that has been noticed by many others.  It is impossible to delete the seven stupid contacts for AT&T.;  Worse, \"AT&T;\" is early in the alphabetization, so these seven contacts end up dominating the contact list.  My work-around, which is a total hack, was to prepend \"A \" to all my other contacts.  This works, but it is ridiculous that one has to resort to this kind of hack.Are you listening AT&T;?  (Yes, stupid question I know, they don't care, they still think they are the phone company.)  This phone would be ever so much better if these contacts could be deleted or put somewhere else.", "Date": "October 12, 2012"}, {"Title": "Wolf", "Author": "Wolf M \"Wolf M\"", "ReviewID": "R3T3E7OUUQ4EOF", "Overall": "1.0", "Content": "I acquired this model directly from AT&T; as an upgrade. The first major problem encountered was that the Address Book was taking up to 15 seconds or more to load. The second problem was the same slow loading of AT&T; Navigator. In addition, Navigator appeared to have difficulty homing in on my location. When I spoke to an AT&T; Tech, he believed the problem was in the instrument and further stated they had issues with this phone. That was enough for me. Instead of accepting a simple replacement unit, I requested an altogether different model.", "Date": "March 23, 2013"}, {"Title": "Couldn't get calls", "Author": "Jimmy", "ReviewID": "R3KZX5PPK55D1T", "Overall": "1.0", "Content": "These phones are pretty bad.We missed calls all the time.  My wife is pregnant, so we had to buy a pair of Go phones to get better reception so that I wouldn't miss her call when she went into labor!The software running the phones is glitchy too.  Sometimes it would take up to a minute to open our address books, and then it would open up other software, called CityID when we ended a call.Bad news.", "Date": "March 20, 2013"}, {"Title": "Really Bad Phone Design", "Author": "William Penn", "ReviewID": "R2M6P65054ZB3G", "Overall": "1.0", "Content": "Beware of this phone. The face plate is too heavy and is secured to the body of the phone by two weak outer hinges, rather than one strong central hinge. If the face plate slides when you touch it, you should return it asap because it means that one of the outer hinges is beginning to fail.", "Date": "December 5, 2012"}, {"Title": "2nd brand new LG A340 in a week & still sucks", "Author": "Paulina", "ReviewID": "RZ64JT8ZOI5NU", "Overall": "1.0", "Content": "My mom got this phone from AT&T; and it rebooted itself every 5 minutes. She took it back to exchange it for a new one. After a day, the new phone started doing the same thing...this time rebooting itself every 6 minutes! This is ridiculous. If this phone came out in April 2012, they should have worked out the bugs by now, 3 months later.", "Date": "July 5, 2012"}, {"Title": "Great phone at first, but not anymore", "Author": "Spencer & Ilene", "ReviewID": "R2CI8EP5R9679L", "Overall": "2.0", "Content": "I loved this phone at first for many reasons, but unfortunately it has gone down hill. I've only had it about 4 months. I'm beginning to think the battery is faulty. I noticed it was getting worse when it would do buggy things-- like not opening my address book until I rebooted it a few times, or when making a phone call it would say \"call divert set\" and just shut off. And it has been turning off on it's own very often for no reason or without warning. Very frustrating because judging from other reviews the only thing att will do is send me a new one, and it will probably do the same thing. And I've already used my upgrade for this.", "Date": "October 18, 2012"}, {"Title": "It makes phone calls...thats about it.", "Author": "Timothy G. Hudson", "ReviewID": "R20HE9PFQ4PUTD", "Overall": "1.0", "Content": "I am not ordinarily the guy that makes 1-star reviews but this is seriously a waste of your time and money. Please don't buy this phone. Other reviewers have mentioned and I will again when you are dialing or are entering numbers the first digit will not register until you press it the second time. Most annoying when entering your voicemail password. Also, I though I had a crappy battery and bought a new one. Turns out I get about 4.5 to 5 hours between charges if I use my phone at all. LOUSY camera. I will state this again: please don't buy this phone.", "Date": "March 30, 2013"}, {"Title": "Horrible Phone", "Author": "infoplease", "ReviewID": "R2ONEPIV7C9YSY", "Overall": "2.0", "Content": "I purchased this phone as an upgrade after using my Motorola Razr phone for 7 years. No real problems with it when I upgraded, just wanted new basic phone as I use my IPad for Internet and texting. I purchased the LG A340 and I have never been happy with it. There are lots of useless numbers in the address book that cannot be erased. The voice call is almost useless as it hardly ever got a name correct so I put numbers on speed dial. The battery was never long use but now I have to charge daily and it will show a charge and then die. The charger doesn't work unless I place it in certain position with cord wrapped around phone to hold it. My daughter sent me a picture 7/4 and I got it on the 6th. Many times it won't ring yet I will check and have a voice mail. This just may be a bad phone but I will never order another LG phone. AT&T; has very few basic phones available and as I am already paying for Data for my IPad, two cell phones and home phone I didn't want to add more charges to my acct.. Be advised do not purchase this phone. It is a total disaster and I can hardly wait to be able to upgrade. I may have to go ahead and pay for a phone.", "Date": "July 10, 2013"}, {"Title": "LG A340 stay away.  Bad phone and LG  won't stand behind product", "Author": "Edward Lanton", "ReviewID": "R2SAD2375RKCVZ", "Overall": "1.0", "Content": "Like many users, the display on my LG A340 failed within weeks after purchase.  They claim it is physical damage, although there is absolutely no physical damage to the phone and the so called physical damage occurred overnight while the phone was in a drawer.  I would not purchase this phone and I will never purchase another LG product again.  Period.", "Date": "June 19, 2013"}, {"Title": "Great phone with 2 sad bugs, still not fixed.", "Author": "Wavebourn", "ReviewID": "R3KO9TMKRKK86A", "Overall": "3.0", "Content": "Bug #1: sometimes when answering calls it looses Bluetooth audio I/O connection, while Nissan navigator shows that the phone is still on-line. I did not try it with other Bluetooth devices, only with 2 navigators, in Nissan Sentra and Nissan Rogue. No problems with outgoing calls.Bug #2: when calling voicemail can't enter password: it swallows 1'st entered keystroke and does not transmit it. A bug in screensaver behaviour: the screen goes dark on the answer immediately. Each time I call voicemail I have to press the first digit of the number twice, or will need to re-enter the password.I hope somebody who can address the issue properly will read this. Techsupport is horrible: \"No known isues, install our MS Windows support software, blah-blah-blah...\"", "Date": "October 2, 2012"}, {"Title": "Contact info", "Author": "Mcgraw", "ReviewID": "R2OQJ260YTK56U", "Overall": "3.0", "Content": "For those of you that don't know how to put your contacts at the top of the list. put a number in front of the name.", "Date": "July 31, 2013"}, {"Title": "I miss my old motorola razr v6", "Author": "sngdebi", "ReviewID": "RDMJTCALZB155", "Overall": "3.0", "Content": "I dot this as a replacement for a lost Razr v6 I have had for years. It was way more easy to personalize with options for operations without the phone having to be opened and more ability to program the various  buttons including a few more outer buttons to work with. Th LG phone was purchased from ATT and did not com with a printed users manual! It had to be downloaded from their site  but it ain't easy to find and; 120 I have to print?! Wow OK.  Also the outside screen has already been damaged with normal use and carrying it in a special pocket. I carried my Razr with me all the time in my pocket or purse and never had anything like this happen. But, I guess a littler screen is harder to break the crystals and cause the bleed I've apparently suffered on my less than a month old LG A340. I was just waiting for pay day to get a snap-on cover for it; But Sela-vie. ATT said to go buy a phone from a store and just switch out the sim cards. But are all Sim cards the same? I know my new LG Sim card was to big to fit in my old Motorola so I had to use blue tooth to transfer my contacts and pics etc. Worked! But tedious and time consuming.", "Date": "February 24, 2013"}, {"Title": "Useless", "Author": "Jacki Barber \"Jacki\"", "ReviewID": "RM0V1BQ8NV73W", "Overall": "1.0", "Content": "I was provided this phone by my employer for the sole purpose of making & recieving calls while working off-site. (For everything else, such as contacts, calendar, email, Internet, etc., I use my personal smart phone.)Unfortunately this phone fails at these two most basic tasks. The sound quality is terrible & the signal is even worse. AT&T; is the provider for both phones. Having both phones with me in the same room (of a Courthouse packed with signal boosters & so much wi-fi I could probably use my dental fillings to access the Net) my iPhone works fine while the LG has such a weak signal it won't even tell me if I have VM waiting. I have to leave the room & stand next to a window just to see if I've missed any calls, which I can return with my personal phone while standing in the elevator.The voice mail option menu is excessively difficult to navigate, especially given the much-noted issue of having to press certain keys more than once.I honestly don't understand the reviews stating the sound quality to be \"crisp & clear\" as even with full strength signal, it sounds like I'm calling Siberia from a submersed submarine.How bad is this phone? This phone is so utterly worthless that I am giving criminals my personal phone number and just praying they don't know how to use location services.", "Date": "September 4, 2013"}, {"Title": "Decent, basic phone", "Author": "j singleton", "ReviewID": "RFKNZ97VCI1BY", "Overall": "3.0", "Content": "I only care about 3 things in a phone- call quality, ability to send text, and dependability. I've only had the A340 for a couple of months now. So far call quality is good, I can send text messages, can't speak for dependability yet. Battery seems a little weak. I made sure to charge it properly when it was new, but still only get about 2 days out of it even though I barely use the phone (5 or so texts and about 5 minutes of voice calls per day). Can't say anything about apps or internet browsing because I don't use any of that. I only use a small amount of storage, so there's no problem there. There is one thing I CAN'T STAND about this phone. The low battery alert is loud and obnoxious, and according to tech support at LG, it can't be disabled. I've nearly thrown the phone out the window due to this noise! Most of the time, I turn the phone off when the battery is low until I can get to a charger just so I don't have to hear it.", "Date": "June 29, 2013"}, {"Title": "Lousy Phone", "Author": "ST", "ReviewID": "R2RRVRJV4SVNUS", "Overall": "1.0", "Content": "I got this phone on an \"upgrade\". All of the negative reviews on here are true. The worst thing about the phone is the horrible sound quality. Everyone that I talk to on it complains that I am hard to hear, sound wavers in and out, etc. I have to yell to get anyone to  hear me.", "Date": "December 30, 2012"}, {"Title": "Disappointing flip phone, no timer function!", "Author": "DZ", "ReviewID": "R2HBNKI78UCKIW", "Overall": "2.0", "Content": "Got this phone since I only want to carry a light and small phone in my pocket. However, this phone is disappointing.What is missing to me is a timer function. I have been using my phones as a time for many years at work and at home. This one got me upset... Am I asking too much?On the other hand, some other functions of the phone are useless and can be annoying. For example, a big att button sits in the middle, to make sure you accidentally go to att.net daily. It takes a while to load, then you have to press stop and confirm \"YES\" to get out of the trap.  Question to the designer(s): How many people would use their flip phones to browse att.net?", "Date": "November 13, 2012"}, {"Title": "Great cell phone!", "Author": "N. Richko \"tarkin\"", "ReviewID": "RLL5JNDI09JYB", "Overall": "5.0", "Content": "Had to upgrade my cell earlier this week  due to the fact that the touch screen phone i had for 3 years finally conked out meaning.. the screen got messed up and caused lots of problems. you know how that is  the screen goes and well,the phones basically useless! i always wanted another flip phone..because, im not jazzed  about the touch screen phone format anyway...I DONT NEED a smartphone with a so called \"data plan\" tacked on to my bill..its an extra expense i can live without  .. plus the touch screen phones are more likely  to get messed up..and are way OVER PRICED..  think about it for a sec  would you rather have the internet in its full glory viewed on a 24 inch monitor or a dinky little 4 inch screen?  its a no brainer..  its amazing how the \"phone jockeys\"  at the stores try to push data plans  its rather pathetic...so anyway,  i found this awesome LG phone..checked it out online(free on my plan which was awesome ) and there you have it.. this is really a great phone.  i have to say that the people that slam this phone really dont know what they are talking about.. the screens are vibrant, the call quality is crisp and clear..it DOES NOT overheat like somebody here claimed.  its stylish and sleek..has an actual keypad..  remember people its a PHONE!  its used to make calls...not check your e mail, play angry birds,  butter your bread etc..  if you want to access  the internet...buy a computer.bottom line, this is an excellent phone for people that dont have (or want) a smartphone.", "Date": "February 8, 2013"}, {"Title": "ATT pans this phone", "Author": "Bill C. \"Bill C\"", "ReviewID": "R1B5X9KTYON06R", "Overall": "1.0", "Content": "Went to 2 ATT Wireless stores here in the Phoenix area this weekend to get this phone, to replace my Pantech Breeze.  The LG A 340 has large numbers showing when you dial and adjustable large font for the Address Book.  Just what I wanted.  Both ATT Wireless corporate stores sales people told me the phone would probably not last through the 2 year contract I would have to sign, they had been getting a lot of returns and it was overall not a good phone, just in the line because ATT demands suppliers have a phone for all age groups - this was the phone for \"seniors\".If I had been with ATT or LG I would have had the sales people fired.So I keep my Breeze until I can find a phone with large font for numbers and Address Book and requiring no data plan.", "Date": "September 15, 2013"}, {"Title": "Piece of Junk", "Author": "Jeffrey K. Smith", "ReviewID": "RESYJRZRWTRVZ", "Overall": "1.0", "Content": "The LG A340 is a piece of junk. But what would else would you expect from the crooks at AT&T;?The microphone is terrible, so you have to shout into the phone in order to be heard. Don't even consider this phone if you have to call someone who is hard of hearing.I have received voice mail when I had the phone with me and turned on but the phone never rang.It's ridiculously annoying that if you have to enter anything during a phone call (you know, from those menus that say \"press 1 to get more menu options, press 2 to get directed to the wrong dept.\", etc.) you have to remember to press the number TWICE because the phone needs a wake-up before it will accept.The instructions that come with the phone don't include anything about the basic functions, such as how to turn the speaker phone on or how to retrieve your recent phone calls. I figured out how to use these features by trial-and-error.You can tell it's a piece of garbage because AT&T; sells it. They'll tell you that they're giving you an upgrade but then they'll stick hidden charges in the middle of the stack of papers that they give you. For example, if you look at page 1 of the receipt, it will say that you paid $0.00 for the \"upgrade fee\". But page 3 says that you will be billed the following month for the \"upgrade fee\". The receipt will say that you signed a 6-month on contract on page 1 but a 2-year contract on page3.I've junked my LG A340 and reverted to using my old, battered, primitive Motorola phone. At least I can hear and be heard.", "Date": "July 21, 2013"}, {"Title": "Good Basic mobile device.", "Author": "Larry D. Crum", "ReviewID": "R2QDGP8I1Y3SV4", "Overall": "4.0", "Content": "I've been using this model for a little over two years with no operational problems,  I have no need for \"smartphone\" apps, just basic voice service.  For that purpose its just fine.  I'm hearing disabled & the unit works well with my digital aids.  Downside is that dumb ATT listing as others have mentioned.  I'm retired ATT so I hate to badmouth them but this is a non starter.  I'll steal the append A idea someone mentioned.  Primary complaint-can't find a high quality belt holster for it.", "Date": "May 19, 2014"}, {"Title": "Old School Phone, I love it!", "Author": "Pardon and Freed", "ReviewID": "R3DOWLL38Y1NGN", "Overall": "5.0", "Content": "I cannot stand the new cell phone these days because I have rheumatoid arthritis (RA) and it hurts my hands to use the scroll thing on those smart phones. This phone has EVERYTHING I need in a phone: talk, text and NO internet! Who would want to use the internet when on the road anyway, oh please, everything else can wait till you get home on your desktop computer. I am 54 years old and my husband is 58 years old and this phone is just perfect for us.", "Date": "May 9, 2014"}, {"Title": "I hate this phone", "Author": "karen l. alexander", "ReviewID": "R1TF6ZJJKP20GS", "Overall": "1.0", "Content": "I wanted a simple phone to make calls. I did not want one that has it's theme song blasted at above full volume when I witch it off or on. It wakes other people up in the house. The clerk at the store told me the theme can not  be turned off. The low battery signal is also too loud and I am stuck with it. As soon as this contract is over  I am going to switch to Verizon.", "Date": "March 25, 2014"}, {"Title": "stinks. seriously.", "Author": "mark", "ReviewID": "R3VMEDJFJDXZCP", "Overall": "1.0", "Content": "1) no dedicated \"contact\" button. i mean seriously, this is a talk and text phone and you need 3 button presses to get to contact list?2) you cant see the name of the person you are sending a text to while typing/sending it3) the time disappears from the screen when doing anything else. seriously? huh?4) try accessing my contacts i get a \"working\" bar while the screen tells me \"opening address book! what is that about? and it can take 2 min to allow me to access my contacts!5) flip open the phone, then go get a coffee while waiting for the screen to go on. 3-5 seconds of a black screen? my 4 year old sprint sanyo was instant6) try accessing your inbox, of texts! it can take 5-10 seconds to load7) you cannot really personalize the buttons8) 9 speed dials. again, my old sanyo had 999) you cannot send a text from the speed dial contact10) you can only send a text to 10 people at a timeall in all i think the only thing good about this phone is the large outer screen (big deal) and the 1000 contact memory (which is only alot considering my old sanyo (its only drawback) only held 300. but even there the sanyo allowed 7 numbers per contact, this only allows 4 or 5.overall i'd give this phone a bit lower than the lowest possible rating", "Date": "March 24, 2014"}, {"Title": "LG A340", "Author": "Philip A. Ortiz", "ReviewID": "R37F41MF5GW58X", "Overall": "1.0", "Content": "NOT WHAT I THOUGHT IT WOULD BE. NOT EASY TO USE, SO I RETURNED IT FOR CREDIT WHICH I PROMPTLY RECEIVED", "Date": "August 29, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "LG A340, Silver (AT&T;)", "ImgURL": "NULL", "ProductID": "B007QVV942"}}