{"Reviews": [{"Title": "Upgraded from Samsung Admire (1X) to Attain(1X&4G), it's amazing!", "Author": "Forrest W. Smith \"moviemadnessman\"", "ReviewID": "R1LCOCOAIT7PK", "Overall": "5.0", "Content": "Pros: 4G Coverage, Screen brightness & flow, different android gingerbread theme, back&front; camera, really fast phone with no lag, 7 home screen pages, wallpaper doesn't stretch, lock screen is nice, descent battery life, CAN USE APPS AND INTERNET WHILE ON PHONE CALL. AMAZING.Cons: Gingerbread keyboard not installed..but that's not such a big deal since you can download it from android market. Other than that it's awesome!Summary: So I upgraded from the Admire (2.5G) to the Attain 4G. I was so sick (even in Boston) of Facebook being so slow due to the 1X speeds and boy was it worth it! With the 4G in Massachusetts I seemed to get 1-2 1/2 mbps of speed which is actually nice! I did a lot of research and decided to get the Attain since I like the 3.5\" screen size and the phone is so sexy! I just wanted the 4G upgrade I didn't feel the need to get the Connect!!! I have to say 4G speed is amazing, and it has a new theme in the phone since it is 2.3.6. and It's green!!One thing I like is the 4 touchable buttons on the bottom of the phone. I had that with the admire and I love it. Unlike with the Admire when u press them for a sec the phone will go on but the attain you have to hit the power button because the screen won't go on so no butt dialing ever again!I live in a basement apartment where I mostly roamed, but for some reason I get 0-2 (5 max) bars throughout my house without roaming! It's amazing! My ex bf had the esteem and he roamed everywhere like my Admire did in my apartment. Amazing phone couldn't be happier!! Got it from Best Buy for $229 and I am a very happy customer now :) Good job metro!!", "Date": "March 27, 2012"}, {"Title": "awesome!", "Author": "giovi \"Giovanna\"", "ReviewID": "R2OCIYLIWP20ZV", "Overall": "5.0", "Content": "So now I dont have to carry my itouch and my phone! As a massage therapist I relied on my itouch for music,such as Pandora and my ph well for keeping in touch with clients. Now that metro offers a 4G phone,ipicked this one up. It is an easy transition easyto use and offers all the same things I could get on the itouch,plus I can make calls with no contract! And what a deal buying it through Amazon :-)", "Date": "May 30, 2012"}, {"Title": "Not a good choice", "Author": "junior", "ReviewID": "R3FHD8AYESXGWG", "Overall": "3.0", "Content": "I bought this phone about 5 months ago.. It's not a bad phone just that the one I owned started to go crazy when I charged it.. It would go on and off quickly.. This also happened to a close friend with the same phone I'm guessing it's a problem on how they are made... The battery life itself is not good at all if you are a constant user .. Unless you carry the charger around with you. Most apps are not compatible with this phone like the optimum app or games like FIFA", "Date": "March 26, 2013"}, {"Title": "beware!! this is a rip off!", "Author": "lucy69", "ReviewID": "R1GHROIE9J21GY", "Overall": "1.0", "Content": "The phone is a total rip off for your money. First of all it comes w no sim card so theres no way to even use it bc metropcs cannot supply u  one. U have to buy a whole new phone if u need a sim card. Second..there snt any battery or back to it. When i received mine in the mail i noticed there was no back nor battery so u cant even use it! Beware of buying this or anything else from this seller.", "Date": "February 1, 2013"}, {"Title": "Serious problem activating these (2)- notified seller still not done.", "Author": "Jeanne B. Green \"Craigwatcher\"", "ReviewID": "R1RBJJH0LQI7HF", "Overall": "1.0", "Content": "After sending to another area (gift) we find the item is on a lost or stolen list & cannot be activated after purchasing required card to activate. Sadly-- the two phones were disposed of by recipient (out of frustration) so I can't get a refund ( seller did offer) but I am NEVER going to make a purchase like this again (Used items from unknown seller). I have given up -it is a $260.00 loss to me but I learned a lesson .", "Date": "March 21, 2013"}, {"Title": "Last online cell phone purchase.", "Author": "SANDRA BELL", "ReviewID": "R1KS13Y5WVR63E", "Overall": "1.0", "Content": "Okay, when I had to travel cross town to purchase a sim card and was told the phone was obsolete, i thought no big deal. But to my surprise it kept getting worse,found out that i could not use camera w/o memory card okay fine. had the phone about a week battery is dead. thought i was getting a good deal, but guess not. So again I am looking to purchase a 4g phone but this time i will go to the store so i can see what i am getting. yes i know i will pay a little more, but i feel confident that it will work. I did learn a valuable lesson...will never purchase cell phone online again!!!", "Date": "July 17, 2013"}, {"Title": "Great phone!", "Author": "Violetb69", "ReviewID": "RR9ONJN8ZDCMM", "Overall": "5.0", "Content": "Wonderful phone for android. This was my first android phone and I loved it. sad to say I was truly disappointed with metro pcs. The coverage was not very good to say the least. The $40 unlimited was awesome though! But I was very happy with the phone.", "Date": "September 20, 2013"}, {"Title": "No, no, no, no Stay Away", "Author": "noname", "ReviewID": "R3TRGAA3CDJ711", "Overall": "1.0", "Content": "I had this phone for less than 6 weeks, babied it and then one day it just stopped working.  I tried to take it back and they opened it and said \"oops, water damage.\"  Well it was never near water, I did not carry it on my person so perspiration was not an issue.  I have air conditioning, so humidity was not an issue.  Each place I took it to did the same thing, open the back, pull out the battery and say \"water damage, you have to buy a new phone.\"  Samsung said to go to Metro PCS (don't use them) and Metro PCS consistently told me I'd have to purchase a new phone.  AFTER SIX WEEKS????  No, this is a scam.  Also, as others have said, it is hard to get activated. You also have to watch out when paying your bill online.  The website does not go to a payment center, it is some franchisee or something.  Just be careful.  The reception was fine in the city, but you won't want to travel to the suburbs with it.  I've had ATT and Verizon.  So far, Verizon is the best reception.  However, I have unlimited text, data, phone and they will not honor that if I switch from my blackberry to a 4G phone which this one was.  Also, the speaker phone on this phone is absolutely horrible.", "Date": "July 20, 2013"}, {"Title": "Ugh! Battery Life", "Author": "MCMoneypenny", "ReviewID": "R5T9J9O68D896", "Overall": "2.0", "Content": "I switched over from a virgin mobile triumph to Metro PCS. I think because Virgin was all-in-all such a good deal that MetroPCS  has felt like a buzz-kill. The phone has an anemic battery life and I feel like I virtually have a landline because it ALWAYS needs to be plugged in charging. Charge at home, charge in the car, charge whenever at a computer. The damn thing is always out of juice. It feels like 4 hours is all one can get from a charge. I'll buy the expanded battery off of ebay if I can stand rocking this phone any longer.As for the interface, it works; nothing special. I do like tethering the phone via Wifi Hotspot & Tether through the app store, but ultimately it doesn't seem all that worthwile as the \"4g\" isn't that much faster (if at all) than Virgin's 3g. This phone would be a good lateral step for someone who was coming off of post-paid, but I have been eyeing the HTC EVO V 4g since I heard about it (which was right after my BB return would have expired :(Metro has ok coverage in Boston, but anywhere outside of the city and poor service can be expected. Poor choice for me, maybe better for someone else. Rhapsody is a decent feature to be included by Metro, but I would just use Tinyshark anyways on another carrier. Bluh!", "Date": "June 25, 2012"}, {"Title": "Very so-so phone", "Author": "Xray Review", "ReviewID": "R36F6431TUCKQD", "Overall": "2.0", "Content": "Screen is fairly small and the battery life doesn't last an entire day if you do texting.  The camera is horrible...no zoom.", "Date": "June 4, 2013"}, {"Title": "So So", "Author": "J. Hencoski \"JNoob\"", "ReviewID": "R100F9XR0LGQMV", "Overall": "2.0", "Content": "I was okay for the first four or five months, but then after that it just started having problems. Freezing, slow loading, dropping calls all of the time and restarting itself. Now it's about 2 years old and the ringer doesn't work anymore. All it does now is vibrate.", "Date": "February 5, 2014"}, {"Title": "great reliable phone!", "Author": "allstar28", "ReviewID": "R2M8P40XOW22B6", "Overall": "5.0", "Content": "great fast bright reliable one of a kind good looking durable i dropped it in water and still worked after it dried up rhapsody on this phone is grade A++", "Date": "February 21, 2013"}, {"Title": "awesome", "Author": "Jairo", "ReviewID": "R2DFRLJ4BOLXLB", "Overall": "5.0", "Content": "I bought this cellphone for my Step-father, and he is so happy with it... its easy to use, and also bring a lot of internal memory excelent product.", "Date": "November 25, 2012"}, {"Title": "NO WRK", "Author": "JENNY", "ReviewID": "R2O0W1OB0EB4D5", "Overall": "1.0", "Content": "SPENT MY MONEY ON A WORKING PHONE SO I THOUGHT BUT THE PHONE USB CHarger port is noticeably malfunctioned so UN-pleased with the item", "Date": "November 1, 2012"}, {"Title": "This phone is something i would never buy again", "Author": "denzel", "ReviewID": "RHX6Q5U9W9GHX", "Overall": "1.0", "Content": "First of off, its a okay phone, but once you had the phone for  6 to 9 months that when you start to have problems with it. By the way I bought mines from metro pcs in store. the phone would have problems such as: cutting off by it self, restarting by itself, don't letting you text sometimes, cutting off your internet and etc. I just been having problems after problem and when I went to metro pcs to see what I can do they said that I can pay $45 dollars to replace. I said hell no! I not going to pay $45 dollars for the same damn phone and $10 dollars for activation fee and $50 bucks for them to cut it on. I said once you add all that s*** together I minus well just get a newer phone. So I bought the Samsung galaxy s3 instead. So if you are looking to buy this phone GOOD LUCK TO YOU.", "Date": "November 17, 2013"}, {"Title": "samsung attain 4g", "Author": "nancy hammond", "ReviewID": "R3S34ZD3O647KH", "Overall": "1.0", "Content": "The is a good phone but the company is bad got the phone and when i went to metro pcs to active it they said the serial numbers didnt match and it appears to be stolen and it made me loik bad like i stole it on top of that the company off my return refund even throu the phone was defective on there part which i through was unfair and they didn't want to give me back my money i had to call amazon to get my refund.", "Date": "June 18, 2013"}, {"Title": "samsung galaxy attain 4g", "Author": "meme", "ReviewID": "R2B414MBEMW65D", "Overall": "5.0", "Content": "Samsung galaxy 4g is the best phone i ever i had :) i might have problems here and there but i love it i can talk on the phone at the sametime be on the internet", "Date": "July 4, 2012"}, {"Title": "It wasn't for me.", "Author": "Eli", "ReviewID": "R37DS8VU96HXV4", "Overall": "4.0", "Content": "Although I didn't order this phone for me but for my mother I have to say that it worked rather well for the first year then slowly started to malfunction.", "Date": "May 20, 2013"}, {"Title": "Samsung", "Author": "Santana Cleveland", "ReviewID": "R1Q1GG9DOH85E", "Overall": "5.0", "Content": "I like how light weight this phone is and it loads with no problem. This is my first Samsung for metro pcs Love it !!", "Date": "March 4, 2013"}, {"Title": "great MetroPCS phone", "Author": "Elysha Valerio", "ReviewID": "R32TWDXBW2M68B", "Overall": "4.0", "Content": "got it as a gift and not bad. Has cool apps and can video call clearly with no problems to other people who have the same app. The person I got it for was and continues to be very impressed. It may not be the same as all the other Galaxy phones that have recently come up but its a good phone. Plus I got it used and when opened it was like new..very new. just didn't understand what was with the card without chip for.", "Date": "December 28, 2012"}, {"Title": "Liar", "Author": "Kathy F. Sweeney", "ReviewID": "R20ZB7O2GIEBJK", "Overall": "1.0", "Content": "This phone is on metro pcs for only $200 stop trying to rip people off. This is a use phone, you all are better off getting it from MetrPCS.com", "Date": "August 28, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.5-inch capacitive touchscreen LCD display\n4GLTE connectivity with 1 GHz processor\nAndroid platform - 2.3 Gingerbread\n3MP rear camera with auto-focus, LED flash, and video\n1.3MP front camera for face-to-face video chat\n3.5? capacitive touchscreen", "Name": "Samsung Galaxy Attain 4G Prepaid Android Phone (MetroPCS)", "ImgURL": "http://ecx.images-amazon.com/images/I/416cqhIB22L._SY300_.jpg", "ProductID": "B0074SJON0"}}