{"Reviews": [{"Title": "Pretty good for the price", "Author": "Corey Garrett", "ReviewID": "R2UQFALF3IOGJV", "Overall": "4.0", "Content": "Pretty good for the price. It does let you load two SIM cards, a memory card and calls and receives. The software is beta at best, and most annoying is that it doesn't have T9 text recognition. That said it is an affordable dumb phone if you need a quad band phone for international travel.", "Date": "December 21, 2012"}, {"Title": "excellent", "Author": "bib", "ReviewID": "R1393ICO0G7VW9", "Overall": "5.0", "Content": "everything you need in a such a small phone. And the battery is better than I expected. It last very long time. I wished it had an audio output for headphones, though.", "Date": "December 15, 2012"}, {"Title": "Good basic phone with long battery life", "Author": "Aged Cheddar", "ReviewID": "RJBP2A00PPYIH", "Overall": "5.0", "Content": "\"Very affordable GSM bar phone. Some problems with documentation, but manufacturer customer service is available and very helpful. Look for user instructions online and don't hesitate to contact customer service. A good deal.\"", "Date": "October 9, 2012"}, {"Title": "How to install the SD card", "Author": "Steve Richardson", "ReviewID": "R1CUBJRIY42M8Y", "Overall": "4.0", "Content": "Here is a trick to save time and frustration installing an SD card in this phone.DO NOT SLIDE the SD card under the silver metal retaining clip as instructed, you will bend the contacts. Instead, use a slight downward pressure on the clip and SLIDE it toward the center of the phone. When loose raise the clip and seat the SD card into position. Then reverse the process by sliding the retaining clip toward the outside of the phone until it snaps in place. Put the battery back in and snap back the case and you are good to go.", "Date": "July 2, 2013"}, {"Title": "it's ok so far", "Author": "mn", "ReviewID": "R13X5OG8UH9U2E", "Overall": "4.0", "Content": "pro:-small and cheap, of course- 2 simcon:- the buttons are a bit harder than the same other shape like nokia or samsung- Spanish at first boot so i had to go up and down to change to English", "Date": "April 18, 2013"}, {"Title": "Phone great, but no contact number for information", "Author": "Brendan Usen", "ReviewID": "R1OEK7SJ6ILFK4", "Overall": "3.0", "Content": "Phone was small and with two sim cards, it made it easier when traveling overseas.The reason I am rating it a three is that the information came in Spanish and I had a hard time changing the settings.  My son who was taking Spanish class change the setting to English.  There was no 800 number to call when you need additional information.  Went online but you still could not find a number to contact a representative.", "Date": "December 11, 2012"}, {"Title": "Solid simple dual sim phone ... great for the price.", "Author": "Jilly \"covert shopaholic\"", "ReviewID": "R3SWX1HAO9901D", "Overall": "5.0", "Content": "If you are looking for a solid simple dual sim phone ... this is it. The built-in fm radio and flashlight are good bonuses. The camera is horrible. The numbers are quite big for older users and it is easy to use.  I bought this for my mum and if I needed a simple phone I would buy one for myself. She loves it so much that she even asked me how she could buy another one to have for a back-up in case she sits on this one or accidentally drowns it as she has done to several cell phones in the past.", "Date": "July 14, 2013"}, {"Title": "Just what I ordered", "Author": "Jan C", "ReviewID": "R130X2OO2ZCAQC", "Overall": "3.0", "Content": "My husband and I are just now entering the 21 century with our cell phones.  The first phone I got for him waws difficult for him to navigate and theBLU Jenny is eaier for him.  It fits his hand and does everything he wants it to do. However, the instruction book required a magnifying glass and the phone was configured in Spanish.  It took me quite a while and a visit to the Hispanic neighbor to get it into English.  The neighbor said that it was not easy for him either.  that is why I only gave it three stars.", "Date": "June 26, 2013"}, {"Title": "It's ok but...", "Author": "Steve", "ReviewID": "R18BXBQJWPLDDM", "Overall": "3.0", "Content": "For some reason, the cell phone reception randomly goes up and down even in a stationary environment.  It's not just an observation of the bars, it's also obvious from a live call.  When a call is made, reception is clear, and then diminishes to zero, then comes back.  This contradicts my other phone which does not behave this way.  I am going to try the other SIM slot to see if it's any better.", "Date": "June 12, 2013"}, {"Title": "camera actually not work", "Author": "Jenny Xue", "ReviewID": "R31WILF9J4GXOQ", "Overall": "2.0", "Content": "only one or two pic could be taken and low quality. but battery is good. Also, it comes with Spanish screen and I don't know how to switch to English. I went to ATT store, and one rep helped me to solve this in a minute.Since there are 2 sim card slots, you have to put your card to the right slot, otherwise, phone could not get through. FYI.As a phone, it is good at this price.", "Date": "May 10, 2013"}, {"Title": "Works OK but fragile", "Author": "BILL_CO", "ReviewID": "R1DLOJ5DX3EA8V", "Overall": "3.0", "Content": "Used in several European countries with no problem, even tho the screen was cracked for no known reason -- did not drop or crush.", "Date": "April 14, 2013"}, {"Title": "It's okay, I will use my iPhone next year over seas", "Author": "Uniquegrl", "ReviewID": "R2COE1KIZ7TKAD", "Overall": "3.0", "Content": "I will say that you get what you pay for.  The phone was overall a good phone.  The only things that I did not like was the static that I got while using that phone.  I also did not like the fact that in order to place a call you had to call the number, hang up and then wait for the number to call you back.", "Date": "December 3, 2013"}, {"Title": "As expected.", "Author": "Cristina", "ReviewID": "RR42Z0IU4V51S", "Overall": "5.0", "Content": "Very basic phone, but perfect for the price. It works great. I wanted it to be sent to Cuba that operates in the 900 band, and it has been in use for a little while now with no complains.", "Date": "September 28, 2013"}, {"Title": "A phone to call home with when I got injured in Palanga, Lithuania", "Author": "Anthony Navikonis", "ReviewID": "R37LRJULX0A8RG", "Overall": "5.0", "Content": "I was able to keep in touch with my Lithuanian family when I was in Lithuania no matter where I was.  When I got injured, I was able to let my family in America know immediately even with the 7 hour time difference.  Finally I was able to make changes to my flight schedule to amend my flight schedule and leave earlier in order to get medical attention in Boston upon my return.  I will do it again no matter what country i go to in the future.", "Date": "September 2, 2013"}, {"Title": "Worked great in France", "Author": "J. Montgomery", "ReviewID": "R28E60N85KAA5G", "Overall": "5.0", "Content": "I bought a sim card at a Tabac in Paris and it worked perfectly.  The volume is very low, however.  There is an english menu. Google for directions to get to it.  Not easy to find.", "Date": "March 8, 2013"}, {"Title": "Good Phone with Limitations", "Author": "Philip K. Buchanan", "ReviewID": "R3PFZ6OMRMGJ66", "Overall": "3.0", "Content": "The phone is as discribed and arrived in a timely manner. The construction and sound quality are acceptable with plenty of volume. Inserting the simm cards was easy. I've not yet installed an SD card. Pairing the Blu Jenny with my car's voice operated blu tooth system for hands free calls went smoothly. However, the phone (unlike some other brands) requires accepting the pairing each time the car's system is turned on. I'm also unable to port over the phone's directory to the car's system. There are many features -FM radio, camera, MP3/4 player- I will seldom, if ever, use. The phone was delivered programmed in Portuguese. Took a day to figure out how to reset it to English! The so-called instruction manual is awlful.", "Date": "February 25, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008RBJXFC"}}