{"Reviews": [{"Title": "Quick snappy phone", "Author": "Timothy Oneill", "ReviewID": "R1CH946N7R0W9P", "Overall": "5.0", "Content": "Pretty responsive to taskings, snappy processor and sufficient RAM and memory to run apps, plus an SD micro expansion slot...", "Date": "February 21, 2013"}, {"Title": "RIPPED ME OFF!", "Author": "Cliff T.", "ReviewID": "R2FWDJG9UZ71HM", "Overall": "1.0", "Content": "What a fubar! This seller is not to be trusted! First I ordered this phone on the 15th. On the 19th I got an email saying he was out of town and would ship it the next day. That was a lie. Then a few days later after no status update he emails me some bull crap excuse why it still had not been mailed. So finaly I recieve the phone and 1.it had a huge crack in the screen. 2. The packaging had been torn all to pieces.  3. Sprint hinted that the reason they could not activate it  was becuse it was in someone else's name still. POSSIBLY STOLEN. This will probably be my last time using this site unless this gets fixed.", "Date": "July 25, 2013"}, {"Title": "An Ideal HTC phone.", "Author": "Joann miller", "ReviewID": "R23B3CLXIS5P3E", "Overall": "5.0", "Content": "I had an HTC Hero which was ok, but I wished it was a little faster and the screen was a little bigger; however I didn't want to have to Renw my contract to get a better phone so after reseaching I decided to buy the EVO 4g LTE.  It is just what I wanted.", "Date": "March 24, 2014"}, {"Title": "No issues with the seller. Just the device.", "Author": "KB", "ReviewID": "R1FJ7G54C5DW9H", "Overall": "1.0", "Content": "Not the best track record for a phone.Seems like Sprint pushed a Over The Air update to the phones firmware or software that broke the standard call functionality unless the call was switched to speaker phone allowing you to hear the caller and them to hear you (I forget if this was an issue with the microphone or the regular speaker) Sprint was unable to fix the phone (still under warranty at the time).Got a replacement from Sprint after that and made sure not to update it (same phone model).It bricked about two months after I received the replacement.So overall not my best experience with HTC devices I've ever had considering I've had them all since they were first making Sprint and other branded PPC series Windows Mobile phones...", "Date": "February 16, 2014"}, {"Title": "Battery Life (internal) Lame, Microphone Issue", "Author": "Eric", "ReviewID": "R3UWP7PEAXW73I", "Overall": "2.0", "Content": "It ws a great phone for about a year, then little by little the battery life dropped to about 25% of original time.  About 6 months after that the microphone wouldn't pick up anything when using the speaker phone function and after 20 months the microphone has gone out so I can only hear calls but nobody can hear me.  Seems was made to survive almost the 2 year contract period and that's about it, similar to my first EVO.", "Date": "January 7, 2014"}, {"Title": "great phone", "Author": "Tyler Barron", "ReviewID": "R9UW69AEU8KS9", "Overall": "4.0", "Content": "This phone has a great camera, great, screen, very fast, and expandable memory, its a nice phone to have, even got a kickstand", "Date": "June 29, 2013"}, {"Title": "Sleek and mean", "Author": "Wildcat", "ReviewID": "R1LQRLOQ1RI2LG", "Overall": "5.0", "Content": "Its a beast, with lte speeds, a big screen, a fast processor an integrated image chip, pictures look great, its very thin, and had a mostly metal body, micro SD card slot, great battery life a full day of use, stays very cool, and with the image accelerator built in, it blows the one x and one s out of the water due to its increase in speed and performance.", "Date": "January 21, 2013"}, {"Title": "Great Phone", "Author": "D. Carter", "ReviewID": "R3U7X67YV1JNYJ", "Overall": "5.0", "Content": "I originally lost my EVO 4g LTE at a bar, and was worried that I would have to pay $600 to buy a new one (out of contract).  But I bought this one, and it literally looks brand new.The phone itself is a great phone - beautiful screen, fast processor, LTE (when available), and even a dedicated camera button (which definitely comes in handy).  I know many are going for the Samsung Galaxy S3 - but I think this is on par, or better!", "Date": "April 8, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008CPWCLK"}}