{"Reviews": [{"Title": "Nice Smart phone", "Author": "Richard C.", "ReviewID": "R345ETSMYS8BAB", "Overall": "5.0", "Content": "Great phone, ordered a grey but received black. Didn't return because I couldn't be bothered with the hassle. Notified customer service, but they didn't seem too interested to help/reimburse. Overall, it was brand new and works great! I love the size, holds right in the palm of your hand. It had the capability to transfer all of my contacts from my old phone to the new one via bluetooth. That saved me a lot of time and headache. I would highly recommend this phone.", "Date": "August 27, 2013"}, {"Title": "Great phone", "Author": "Raul Arias \"bluepanik\"", "ReviewID": "R1TTYE3C2SSTMH", "Overall": "5.0", "Content": "Light, well made and strong for being a smartphone. I recomend. Seems that HTC is oing their job. Not a problem with it.", "Date": "June 24, 2013"}, {"Title": "Ok but with some issues", "Author": "Jose J. Montiel Cedeno", "ReviewID": "R3NJO5QF770XZ7", "Overall": "3.0", "Content": "It doesn't have a good performance, it's not so fast as I thought it woulb be. It's nice anyhow.  I'll try to root it and keep it.", "Date": "January 31, 2013"}, {"Title": "HTC One V", "Author": "Ariel Hare", "ReviewID": "R3ASME2J8QWU1P", "Overall": "2.0", "Content": "The phone came quick and in the condition I was expecting, however for a brand new phone it does not meet my expectations as far as functionality goes. When in use, my back light for the screen will dim and brighten, then it'll pulsate(go bright and dim many times in a row). I cannot receive any pictures or send them, and I cannot upload any pictures via HTC Sense, it will only go as far as 1% and then the upload comes to an abrupt stop. I am not satisfied with my product by any means, I am definitely not getting what I paid for out of it. If I could send it back for something better I would in a heartbeat.", "Date": "January 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0080EJ4QO"}}