{"Reviews": [{"Title": "Really a 4.5. 5 for waterproof phone, 4 for a nomral phone.", "Author": "Adrian", "ReviewID": "RUM6HJ1H0Q1TD", "Overall": "4.0", "Content": "I've been looking for a waterproof mobile phone for a long time. I even bought one made for use in the Japanese market, but had to give it up because it's features were so dumbed down for outside Japan, that it wouldn't receive signal outside the country I bought it in I'm in Asia). So when Sony came out with the Acro, a waterproof phone which wasn't tiny (I can't type on screens smaller than 4 inches) and wasn't slow as a dog (not mentioning Motorola's attempts at waterproof mobiles), I decided to give it a try. I chose white because it looks better than black, and I have this fear that if I drop it in the pool or ocean, it'll be eaier to see when trying to catch it before it disappears from sight.So far, it's not perfect, but overall it's useable. Let's work out the pros and cons:The Good:---------- looks good.- well spec'd- good processor and latest Android OS.- Generally good phone- clarity of both listening and speaking and it's external speaker are more than acceptable.- 12mp camera with good easy to get at features, such as white balance- Comes with charging dock included. It's attractive, but I suspect more importantly, it reduces how often yo have to open the USB/charger socket at the top of the phone- thus it will not lose it's seal as quickly.- Has a LCD light on the front of the phone to notify you if you've received messages, etc- decent battery life. I know some reviewers on the black acro have been bitching about bad battery life. Well let me tell you, I think it's just fine. I used a Sony Ericsson Acr S before the Acro, and it's battery would be down to 15% after just 6 hours using msg apps only, like whatsapp. In contrast, I took the Acro kayaking and took 100 photos and 4 x 20 sec videos, and the usual whatsapp messages, and the battery was still 50% after 7 hours of this. What are you comparing it to? a DSLR with attached optional battery grip??? If you truly want a phone with long long long lasting battery, get a Philips- they have mobile phones which can last several weeks on a single charge- no joke.- and speaking of kayaking- did I mention it's waterproof? Forget testing it in the shower or dunking it in a glass of water- I full on used it while kayaking 8km along the coast, and dunking it at the beach to show off to my fellow kayakers who were amazed!The Not so Good:----------------- It's too sensitive. I'd have my camera on and somehow sometimes I'd find several extra photos taken as I just held the phone. Sometimes I'd find the camera mode changed from still to video too. Need to be careful- The top of the screen shows icons of apps being used or messages received eg by whatsapp, sms, gmail, etc. However, they are all only in grey. In the Arc S, they were all different colours, so it was easy to see what app had received a message. Now you have to squint more to see the tiny icon shape.- The bottom of the phone has three touchbuttons. The middle one is for going back to main screen. Unfortunately, it's too close to the space bar on the keyboard. So far, I've accidentally hit that over a dozen times while typing and gone back to the main screen. Bit annoying.- Perhaps I dont know how to use it, but the dim screen feature doesn't seem to work- it actually makes the screen go brighter! To me, the make the screen dimmer button (swipe to see on left from middle screen) should make it dimmer, right? But no.- taking screenshots is awkward- you have to hold down the on/off switch and the lower part of the volume switch simultaneously.- This is a minor thing, but it's a bit too symmetrical for me. I often take it out of my bag upside down because there are no obviously physically distinguishing sides, unlike the Arc S.Overall, should you buy this phone?If you want a waterproof phone, then definitely yes!If you are looking for a normal touchscreen phone, then it's defintely worth a look! It has decent features, is well made and has good holdability, good speakers, battery life and is attractive.If you've made it to the end, then thanks for reading!Update 2013 May 19th-------------------- - internet upload and download speed is good. Was fast when it came out, still comparable with current releases - still waterproof, but when I take it in the shower to type, sometimes it's not as precise as when I first bought the phone - The phone has frozen several times now. (seems to know exactly when I need to use it the most to choose when freeze) Thanks to googling the problem, I've found I can unfreeze it by pressing on/off button and the \"up\" part of the volume button at the same time. I'm happy to have discovered this because you can't get access to the battery and remove and reinsert, which was my previous fixit technique for such problems. - Despite the gradually increasingly unreliable software, I still like the phone and use it with no intentioon of replacing it. I've wanted a physically rugged phone for quite a while and I'm sticking with it. Sony has brought out 2 new waterproof phones now, so maybe the Acro can be had at a better price :)", "Date": "November 27, 2012"}, {"Title": "loving it with a huge (.) PERIOD!!!!", "Author": "Joey", "ReviewID": "R23TH6AB9995XD", "Overall": "5.0", "Content": "I lost my Arc S, good thing I was able to save enough money when this product came out. I even tricked a few people when they see me sinking this on an aquarium, which they gave an \"is this person insane?\" look. The product really is water proof!!! & I just clean the screen with any cloth, and it leaves no scratch marks whatsoever (thus far). The camera does a good job even when it's being captured at night time even when it is pitch dark. I just adore this phone and the countless things which i can do with it (with the help of the google play apps), the processor's fast... way fast, and even faster than my Sony Tablet S when playing heavy-duty videos with a huge chunk of filesize. I will be keeping this phone for years, and I couldn't ask for anything else. Well worth the money.", "Date": "August 18, 2012"}, {"Title": "Beautiful and amazing cellphone ever", "Author": "jeremy", "ReviewID": "R3UVJ1POZG2OTR", "Overall": "5.0", "Content": "after my first day having this I can feel and see the perfection in this phone(pretty much spent all day yesterday and today on this fun device). it feels very solid and has a very rounded out craftsmenship to its design. I like how it came with a pre installed screen protecter(shine it up to the light and you'll spot it on the screens edge. i put an additional screen protector on just for safety). runs very smooth while handeling multiple apps, awesome 3d animated wallpapers and smart looking minimul theme. the android app store is great. The phone is also very beautiful and recieves damn good phone signal.HOWEVER I really wanted to put up a review because a lot of people were complaining about not getting 3g on this for att. Heres how you do it(as i am streaming hq music using the Music Unlimeted app by sony with my acro s using 3g)GO TO menu/settings/more.../mobile network settings/access point names/ now hit the bottom right tab/new apn....NOW fill in these blanksName: can be anythingAPN: wap.cingularProxy: leave blankPort: leave blankUsername:WAP@CINGULARGPRS.COMPassword:CINGULAR1Server: leave blankMMSC: [...]MMS Proxy: wireless.cingular.comMMS Port: 80MCC:310MNC:410APN Type: leave blankyou should get an H by your signal within a minute. the H means you have 3 g. enjoy your acro s <3UPDATE June 6, 2013Just to update this, for everyone who doesnt know how to configure the phone since it is unlocked, go to google and type \"apn settings (your phone carriers name here)\" and it will tell you all the stuff to put into it. You can use my steps i showed here to get to the cofiguration if the website you searched for didn't tell you how to do so. I'm saying this because in my previous comment, under MMSC, amazon.com automaticly made it say [...], I didn't put that there they did, i actually typed data there for you guys to read but the websites not letting it happen.So yeah, again, google \"apn settings (your phone carriers name here)\" and you will find out how to make it work. THIS PHONE DOES GET 3G AND 4G FOR ATT AND TMOBILE from what I have personally experienced with my acro s using the tips ive given you just now, which do work. For the record I still love using this phone. It's as great or better since the day I got it(happy customer ^^! Sony 4 life!)", "Date": "February 25, 2013"}, {"Title": "Amazing Phone!", "Author": "Umed Narzuloev", "ReviewID": "RQZZSZEY9PEMP", "Overall": "5.0", "Content": "This phone is has a very slick design! Camera, Screen size, Processor, design, waterproof, dust resistant. what else would you need from a modern phone?! Highly recommend to everybody!", "Date": "December 3, 2012"}, {"Title": "consumes battery very quickly, behaves 'glichi'", "Author": "aharon zbaida", "ReviewID": "R1KYJ0VEMC0J20", "Overall": "2.0", "Content": "Phone shuts down by itself, sometimes goes through cycles of chain 'self restarts' for hours on end. Glitchi behavior.When it works, it is not bad.", "Date": "September 11, 2013"}, {"Title": "Good smartphone", "Author": "José Sánchez Pulido", "ReviewID": "R1DMDHM970NVK4", "Overall": "5.0", "Content": "It was the celular i was looking for Good price smartphone recomend it my next Sony Z hope next year", "Date": "September 9, 2013"}, {"Title": "missing smart tags and had a scratch on the display", "Author": "cristian talero", "ReviewID": "R34810NJIAF3BA", "Overall": "2.0", "Content": "when i opened the box i didn't find the smart tags and i turned on the cellphone and it had a scrtach on the screen, i think that i received a second hand product", "Date": "July 19, 2013"}, {"Title": "Now the phone is not working", "Author": "Ewaldo Chiang", "ReviewID": "R2IXGNMY0QGCZ9", "Overall": "1.0", "Content": "Greetings Sr, today when I plugged the charger on the phone, I noticed there was no signal of my SIM card. I thought it was a problem of my phone company. While the phone was being charged, some updates were being done. Later, when the battery was full, I realised it was still with no signal. Then, I tested the sim card in other phone (nokia) and it was perfect.I've contacted the Sony Ericsson support in Brazil, but once it was not possible to identify the IMEI, they've told me to contact the seller at the country I've bought it.So far, all configurations of phone have changed, as wall paper, color of the screen, frames and I've lost all my contacts.What would be possible to be done to fix this problem by you once my manual is in japanese and the phone model doesnt exist in Brazil ?sincerely", "Date": "July 13, 2013"}, {"Title": "Lovely", "Author": "andrujazz", "ReviewID": "R3PAIPAVIZW598", "Overall": "5.0", "Content": "Sin duda alguna, un buen equipo, he actualizado además a la versión Jelly bean y me va genial.Un equipo rápido, resistente al agua, ya he hecho la prueba e incluso se me ha caído un par de veces y sigue intacto.Thanks.", "Date": "June 26, 2013"}, {"Title": "Excelente", "Author": "Alexis Rojas", "ReviewID": "R1LNC9EHJGNJJ3", "Overall": "5.0", "Content": "EnglishI bought this phone from the seller HassleFreeCell, arrived in excellent condition, fully recommended, wine packing the charger, charger base, 2 Sony Smart Tag, manuals. Thoroughly recommendedEspañol:Compré este telefono del vendedor HassleFreeCell, llegó en excelentes condiciones, totalmente recomendado, en el empaque vino el cargador, la base del cargador, 2 Sony Smart Tag, manuales. Totalmente recomendado. Le coloque linea movistar y todo funcionó excelente.", "Date": "February 17, 2013"}, {"Title": "Recibi un equipo dañado / Receipt a damaged equipment", "Author": "Michael Vásquez", "ReviewID": "RFX17WEVY3ZQD", "Overall": "1.0", "Content": "Recibi este cellular phone con problemas en el tactil, ademas presento fallas con la resolucion. Es lamentable ya que yo soy de Venezuela y es muy dificil realizar la devolución del producto.He perdido mi dinero y mi tiempo con esta compra.Receipt this cell phone with problems on the touchscreen (tactile), also this equipment present faults with the resolution. It is lamentable since I am from Venezuela and it is very difficult to realize the return of the product.I have lost my money and my time with this purchase.", "Date": "May 6, 2013"}, {"Title": "model disillusioned with many flaws", "Author": "jesus mendez", "ReviewID": "R2YG5REN49VL16", "Overall": "1.0", "Content": "good afternoon I'm disappointed with the purchase of the phone has many flaws the volume down key is very hard, people do not listen well the microphone has problems NFC does not work and grab free 3g band 900, indeed it seems that was not snugly cell I had one previous well and do not show any of these failures the team is good but that you buy actually has many flaws seems re enhanced, either brought smarttags and charger base in the box no imei with Shows", "Date": "April 27, 2014"}, {"Title": "Love the phone", "Author": "Mariana", "ReviewID": "RO67Z48IP0N2K", "Overall": "5.0", "Content": "I like my product, it is everything I expected, love its features, love the sony operation system, the only dislike, the first time I dropped it it got a scratch, expected it to be a bit stronger, but great product and presentation overall.", "Date": "April 11, 2014"}, {"Title": "Very disappointed", "Author": "toan t. hang", "ReviewID": "R248T6BVA7YJXJ", "Overall": "1.0", "Content": "The phone broke down on me with in few month, it was very poor, and I will never ever buy any products from Sony again", "Date": "April 7, 2014"}, {"Title": "Great deal!!", "Author": "Hunny", "ReviewID": "R2IMDDW1NM628Y", "Overall": "4.0", "Content": "It's shipment was fast. I liked the phone pretty much. It's a great phone with nice camera.According to price, this is a perfect phone. I really loved it!", "Date": "April 1, 2014"}, {"Title": "excellent phone!", "Author": "Emigdio Escalona", "ReviewID": "R3OZ0ZLAFRWPNY", "Overall": "5.0", "Content": "A beautiful phone. It is excellent, work perfectly. You can connect with your smart tv to see any video of your phone on your tv screen.", "Date": "March 11, 2014"}, {"Title": "Nice but not as described", "Author": "Ron", "ReviewID": "RE2Q6GRR2R30V", "Overall": "4.0", "Content": "Nice deviceMeets the needs of the partner useThere are several things to consider, the device is not particularly strong and hits it can be broken. And speaker and microphone really weak, when talking with someone, not quite hear you, and you have to raise your voice.And after using it warms up.Is waterproof it is very niceAnd superior quality camera!", "Date": "March 2, 2014"}, {"Title": "Good buy", "Author": "Wendy Mohammed", "ReviewID": "R9XHMRDHGQ44U", "Overall": "5.0", "Content": "If you're looking for a good, waterproof android phone, then you should surely buy this! I bought this for my son's 16th Birthday, and he loves it, it works perfectly fine. I bought it from the seller HassleFreeCell, this is the second smartphone I've bought from this seller, product arrived on time and in excellent condition, I would recommend you buy from this seller when purchasing the phone. Here's a list of cons and pros of the phone:Pros:-Great camera, 12.1 MP, records 1080p full HD videos-4.3\" HD screen-IP57 certification - dust protected and water proof up to 1 meter and 30 minutes; Scratch-resistant shatter proof glass-Dual-core 1.5GHz Scorpion processor-Supports NFC-MicroHDMI Port-1.3MP Front Facing Camera-16 GB Internal Storage-Has a LCD light in-front to notify you about important messages etc.-Comes with a charging dock. (most smartphones these days don't come with one in-box)Cons:- Chipset is rather modest for the class-Thicker than most rivals-Display viewing angles are mediocre-No preinstalled document editor-Non-user-replaceable battery-Home button is too close to spacebar, when typing-------------------------------------------------------------------------------------------------------So, should you buy this phone?If you want a waterproof android phone, then definitely yes!If you're not so interested in the waterproof thing but want a good phone, you can get other Sony or Samsung phones for around the same price or less with nearly the same specifications. Overall a good phone in my opinion. If you have any questions, please ask.", "Date": "January 26, 2014"}, {"Title": "like it", "Author": "Maria", "ReviewID": "R17UGZNX02R04U", "Overall": "4.0", "Content": "is great!!! is fast, the camera it's amazing, but i haven't try the waterproof feature get. i'll be updating the product review", "Date": "January 16, 2014"}, {"Title": "Happy with the order", "Author": "Aruna Pant", "ReviewID": "RQXYEXJKW6H3R", "Overall": "5.0", "Content": "I have no complaint with the product as I found it as it should be. This is the first online shopping I have done and I have found it impressive. Most of the people I know are already purchasing online, but I have had doubts on buying online. This purchase has convinced me it is worth.", "Date": "December 19, 2013"}, {"Title": "Amazing", "Author": "Rafael Andres Perez Perez", "ReviewID": "R3NUHJ9IT1HXOD", "Overall": "5.0", "Content": "Amazing phone. Great camera. I have not tested in water haha. I think I'll do it later. But, what a great buy I did!", "Date": "December 5, 2013"}, {"Title": "Very good product", "Author": "Jean Manuel Zaa", "ReviewID": "R3UXILALYHCOLF", "Overall": "5.0", "Content": "Excellent cell works without any problem, the only thing the battery lasts very little but all smartphones suffer this problem.", "Date": "November 22, 2013"}, {"Title": "Sony Xperia Acro S", "Author": "Charnix", "ReviewID": "R12RIDZWNP4N2X", "Overall": "4.0", "Content": "I like this phone. It functions well and has interesting features. It's cover is a little slippery though and the company should offer covers for it as well as a screen cover. I'd gladly pay more for that.", "Date": "November 15, 2013"}, {"Title": "Suddenly stopped working", "Author": "Cesar L", "ReviewID": "R3SS8GGCFRLRQM", "Overall": "2.0", "Content": "Few months ago (March 2013), I bought this model of phone for my 17 year old son. He has been extremely careful with the device and it has been working without problem until now. Yesterday, he tried to answer a phone call and the phone stopped working.  We have tried to turn it on by several ways (following Sony website and bloggers recommendations) without any success.  Unfortunately, in Venezuela there is not technical support for Xperia owners, i called to a Sony's Service Center and i was informed that i have to manage this problem with the operator's technical support (Movistar in our case), but Movistar informed us that the phone was bought abroad and they don't have technicians for this model. At this point we have no clue about the origin of the fail neither the next step to follow to solve the problem.  My son is VERY happy with this phone, it has been an useful tool for him because of its camera and strengths but is hard to believe that it's a disposal device. Is there any warranty on it?", "Date": "November 9, 2013"}, {"Title": "Atahualpa Carrero", "Author": "Patricia Rivas", "ReviewID": "R21HCTQ5Q2M8VH", "Overall": "2.0", "Content": "Muy decepcionado del telefono, solo 6 meses usandolo y la pantalla quedó en negro  luego de recibir un mensaje, a pesar de sus fallas estaba contento con el telefono pero se daño por una tonteriaDisappointed the phone, just six months using it and the screen went black after receiving a message, despite its flaws was happy with the phone but silly damage", "Date": "October 29, 2013"}, {"Title": "I CHARM WORKED SUPER WELL", "Author": "Kelvis", "ReviewID": "R1MC4CWL907O25", "Overall": "5.0", "Content": "I CHARM WORKED SUPER WELL WITHOUT PROBLEMS, DID TESTS OF WATER AND NOT IS DAMAGED, ALREADY AS I WANT BRAND NEW ON A BEACH", "Date": "September 17, 2013"}, {"Title": "lie", "Author": "Carlos", "ReviewID": "R3DUBF9C59TP2O", "Overall": "1.0", "Content": "the product was not what I expectedthe seller is a scammercell is Chineseis imitation and the price is super expensive for imitationthief", "Date": "July 29, 2013"}, {"Title": "Excellent", "Author": "aragua11", "ReviewID": "R2EJMQS1LD3D9G", "Overall": "5.0", "Content": "Great phone, the best undoubtedly brought everything indicated by the publication, is great quality, has exceeded my expectations. Great buy. From Venezuela recommend", "Date": "June 19, 2013"}, {"Title": "All I could ever want (Until they invent something else)", "Author": "Peter Murray", "ReviewID": "R3LGKTVPXV5ZOZ", "Overall": "5.0", "Content": "Great phone, easy to read screen, waterproof, the camera is fantastic, HD movies (HDMI to TV) and lots of apps.", "Date": "June 8, 2013"}, {"Title": "good smartphone", "Author": "dan", "ReviewID": "RLVU69OASZBQ4", "Overall": "4.0", "Content": "this smartphone works great, sometimes have some crash but nothing to worry, fully recommended.and works in venezuela with any operator", "Date": "May 29, 2013"}, {"Title": "Excellent purchase", "Author": "Anibal", "ReviewID": "R3DXX24CBWOO4Z", "Overall": "5.0", "Content": "Perform buy the 03/25/2013 the received 03/29/13 04/03/13 UPS and arrived at their destination (Doral Fl). He was on time.In Caracas, Venezuela slow, arrived 04/30/13 I get the selected color and all accessories; works Movilnet and Movistar 3G. The packaging is great s*** twice the Xperia phone, weight 3 Libras (Note if sent internationally).", "Date": "May 4, 2013"}, {"Title": "Sony Xperia", "Author": "Richard Martinez", "ReviewID": "R1NE5UYZ564D9R", "Overall": "5.0", "Content": "the phone is the ultimate expression of technology. not change it for anything. the photos are of top quality. the internet connection is very fast. the videos are high quality. the only thing I do not like and it's no big thing is its plastic housing is but otherwise I highly recommend it.", "Date": "May 4, 2013"}, {"Title": "Excellent phone, bad Accesories", "Author": "J. R. Perez", "ReviewID": "R2XNR39YWVO5MD", "Overall": "3.0", "Content": "Sony is creating amazing phones, but the problem is they don't care about accessories, even the basic CASE!!!. Is hard to find a case for Sony cellphones, and is hardest for this model >:[.About the phone, the screen and colors are great, the speed is perfect, no problem so far, I haven't test the water resistance.", "Date": "May 2, 2013"}, {"Title": "It was everything I expected.", "Author": "Winz1", "ReviewID": "R7UDE13NUEYSS", "Overall": "5.0", "Content": "When I was doing research, I read all the available reviews. Even with bad reviews I decided to get the phone. The phone came in two days and I've had it for a month. This is the best phone I've purchased. All those who complained about the phone didn't stop me from getting the phone. I've had it over an month now and it's great. I've had no problems with the OS or the the buttons responses. Yes it's water proof. The rear camera is the best on any phone auto focus is way cool. In short this is the best phone out here. I recommend this phone to any one who wants a good phone.", "Date": "April 16, 2013"}, {"Title": "Great Phone", "Author": "Jose Goncalves", "ReviewID": "R1UXXYQ1P4NANI", "Overall": "5.0", "Content": "is a great phone with android buy it from Venezuela and works perfect with any line used here and works perfect with Digitel 3G", "Date": "April 15, 2013"}, {"Title": "Excellent choice", "Author": "Manuel Pinero", "ReviewID": "R16WIZNFRVCKYT", "Overall": "4.0", "Content": "This phone may not be the state off the art when it comes to OS, camera features among others stuff like processor or RAM, yet it does very well its job, is pretty durable and even with ICS runs smoothly. I recommend not tu use the ports too much so you it doesn't affect the dust-water resistance the dock for charging and a Bluetooth headset are enough and the DNLA technology you dont even have to use the HDMI port. Battery last for all day with normal use, web surfing is also great and it doesn't comes with chrome, just the android default web browser so you can pick another if you prefer. Until now I only installed dead trigger and it runs smoothly, touch responded pretty good. Screen is awesome, maybe exaggerate with the color, watching movies on it is pretty cool. The loudspeakers isn't the best so you will have to connect a headset to have good quality sound.", "Date": "March 12, 2013"}, {"Title": "The greatest andriod phone I ever owned so far", "Author": "A. Charoensupyanan", "ReviewID": "R20U1UWPOOBNI9", "Overall": "5.0", "Content": "This phone is great in many aspects including its water resistant as a plus. It's fast, smooth, and very responsive with attractive design.Over all, everything works great with zero lag or crash on any apps.The keyboard layout is somewhat like iPhone with high accuracy and this is the only phone that its keyboard (Xperia) has been integrated with Thai.So no need to look for additional keyboard plug-in in the Play Market.The size of this phone is about right between iPhone 5 and Galaxy S III which is exactly what I want.Love this phone, Highly recommended!!Otherwise, wait for Xperia Z (water resistant too) which is equipped with quad-core 1.5 Ghz and 1080P in 5 inch screen size.Yes, your TV screen is in that phone :D !!", "Date": "February 10, 2013"}, {"Title": "Android and Sony make just the perfect combination.", "Author": "Reynaldo Alvarado", "ReviewID": "R36THZR2GS4GCN", "Overall": "5.0", "Content": "I've always loved Sony-Ericsson phones, and having the chance to get a great sony phone with android just makes things better.Even though it's kind of big for a phone (I was used to have a smaller smartphone), nowadays you can't have a phone that gathers all those new features without sacrificing size, and by sacrificing size I mean making the phone as big as necessary to put all that in.12MP Camera works out just great, videos and photos shot with cybershot technology are guaranteed to be good. Sound quality is good too.Talking about design, well I love the square edges of the phone. It's a bit different from what other highly commercial phones are (galaxy, iphone). But in my case, I have always loved to have something different and unusual. Something not everybody has. The other good thing, is the water proof thing. Be safe that if your phone ever falls to a pool, or a glass of water on your table, on even your fish tank, It won't stop working. Just clean it off with a cloth you're done.The performance of the phone it's great. Never lags down, and the response is always fast and fluid. Just as it should be. In my opinion, no cracking or rooting is needed. You can get what you need from the Google play market and the software it comes with works out flawlessly.", "Date": "February 10, 2013"}, {"Title": "The best cellphone ever!", "Author": "Carlo Alva", "ReviewID": "RD78UJG7EUI0A", "Overall": "5.0", "Content": "I like a lot, great sound, it's unbreakable. The only thing I dislike is that you can't quit the battery.", "Date": "February 7, 2013"}, {"Title": "Good smartphone", "Author": "A.G.", "ReviewID": "R3MM1Z9ZXQ3NBJ", "Overall": "4.0", "Content": "+ Very good photos and video fullHD+ Waterproof it's true.+ Fast processor- Turn on/off screen side button and volume side button are quite difficult to push, a little hard.", "Date": "January 20, 2013"}, {"Title": "A Beautiful Device.", "Author": "LJH", "ReviewID": "R4F4PAKH648LY", "Overall": "5.0", "Content": "A great device. Whether you prefer android, or don't care for which smartphone Operating system you use; this is a very user friendly experience.Sony doesn't do much at all to alter the Google intended interface or features of the Android operating system. They do add a few nice features with the Xperia models to simplify or 'pretty up\" some preexisting features.- I tested the water proofing thoroughly. The IP55 and IP57 standards that this claims to meet are definitely on spec.- The screen is beyond what I imagined in terms of clarity and vibrancy. Samsung can claim all they want with their AMOLED screens, but the fact is they remain cartoon-y, over-contrasted, and apart from reality. Sony has done an amazing job with this device; the glass over the screen does a great job at deflecting stray light, so that even when the screen is dim, it is 100% visible in bright sunlight. The iphone 5's screen is amazing but does not hold a candle to the Acro S.- The Acro S feels very comfortable in hand, quite light but not too much, and has a great use of screen to front real-estate; as to not waste space.- The matte finish on the body(I purchased white) is great for avoiding scratches and other such marks.- The camera is actually very responsive for its level of features. In low light situations with no flash, the camera will obviously have to crank up the ISO to grab more light faster, but the rear(primary) camera does a great job at handling the noise. The front camera will show a good amount of noise in these situations, but really, why are you using the front camera for pictures you want done right?-The charging dock is a great concept and execution. I will be ordering more from amazon. To those that try to use a micro USB charging cable they already own, with the dock and are unable to charge, the solution is simple. The dock requires 5 volts(standard USB voltage) and 1.5 amps. Most common micro USB chargers provide much less amperage and can charge the phone directly, but will not with with the dock.- The battery life is comparable to most phones in its class, at work for a day with signal issues pulling on my battery life and the average use of camera, messaging, and searches, and having wifi on. I can make it a 10hour work day leaving with above 50% battery._ _I bought this to use on T-Mobile USA, and at the time of writing this(January 7th, 2013) I am only able to use 2G with this network, until the roll-out of the re-farmed network reaches my area for 3G. I have no complaints as I use wifi most places. The 2G is more than enough for checking traffic on Google maps, quick Google/Wikipedia/IMDB searches, and I am fully able to send/receive picture messages without delay. Android will automatically set up all the ports and settings for you when you put your SIM card in for whatever network you choose and go to \"Mobile Networks\" in  the settings., and if not the internet or local store for your network should help you(T-Mobile does).", "Date": "January 7, 2013"}, {"Title": "Impressive Hardware; Phone OS Not So Much", "Author": "Jamil Taylor", "ReviewID": "R3VEBP1MSBO26V", "Overall": "3.0", "Content": "The is my second world unlocked phone.  My first was a Nokia N900 that was a no-brainer for setup over T-Mobile in the USA (just plug in the SIM card and you're good to go).  The Sony Arco S, on the other hand, requires the user to enter network settings for data access.  While the spoken conversations will work by simply plugging in a SIM card, you must enter network specific APN settings for the phone to have any Internet access. So, I deduct points for phone setup.I switched from T-Mobile to AT&T; when I purchased this phone.  Note that although this phone lists 3G as a feature, it is not 3G compatible with AT&T;'s wireless network.  I had this same issue with my Nokia N900.  3G works over the t-Mobile network, but it does not on AT&T.;  Also, be warned that you will not get setup help from AT&T; for this phone.  I walked into two of their core stores where the sales person contacted second level support for help.  After hours on the phone with them, the setup of my phone was a failure.  I was able to resolve the setup issue within ten minutes of Google searching when I got home (try searching for \"AT&T; APN settings Xperia\").  The fastest speed over the AT&T; wireless network shown for my phone is:  EDGE:2As I write this review, the T-Mobile wireless network is extremely poor in my area.  Even though my Arco S only gets a 2G connection with AT&T;, everything (and I mean everything) is so much faster due to the much improved network when compared to T-Mobile.  Please note this this paragraph and the previous one is not specific to the Arco S (my rating of the phone is not due to network provider compatibility or issues).  I have added this information to aid those who use this phone in the USA.For reasons unknown to me, simple things that I wish to set on this phone are done in a not so user friendly way.  As an example, I wanted to set an MP3 file as my ring tone.  I copied a few MP3s under the Music folder on the internal storage but could not figure out how to set one as a ring tone.  I tried Google searching where I found results stating to simply play the file followed by selecting a menu option to set as ring tone.  No such menu option exists on the Arco S though.  It turned out that I have to copy all audio files to the ringtone folder for them to show as a ring tone option.  I am not sure why I have to copy the same music file in two different places.  Hence, a usability rating decrease due to this.I do like the hardware of the phone.  The water resistance is a terrific feature, and the screen looks very good.", "Date": "December 25, 2012"}, {"Title": "item never arrived.", "Author": "Hilda Ruiz Martinez", "ReviewID": "R28IL0M34D3EWW", "Overall": "1.0", "Content": "I don't know if usps lost it or the store never sent it, but I never got it. I only got money refunded instead. Too sad", "Date": "August 10, 2013"}, {"Title": "\"0/5\" for Waterproof Claim. 3/5 for everything else.", "Author": "Mark Stiller, PhD", "ReviewID": "R1AZMB9DKU7ZU", "Overall": "1.0", "Content": "Dropped it in the hot tub for about 20 second in a depth of about 30 cm. Result? Unresponsive touch screen.Sony claims it's \"Water proof up to 1 meter and 30 minutes.\" I called Sony and told them about my incident. \"We do not repair phones that have been damaged due to water.\"Ok, let me get this straight...You don't repair your waterproof phone if it has been damaged by water....??? Talk about believing in your own product!!! Wow. False advertising much?Why do most people buy waterproof phones? Because they're afraid of being pushed into a pool or being sloshed in a hottub and doing something weird. Most people don't think \"Oh, I'm gonna gently dip my waterproof phone into this pristine lake for a few seconds\" and show everyone how amazing me \"waterproof\" phone is.3/5 rating for everything else. Why?*It's one-second sleep-to-photo/video function takes more like 10 seconds.* The phone is extremely glitchy - will randomly shut down when it feels like it.* The touch screen messes up when you plug it into a power source* it's very slow overall - apps, showing photos/videos to your friends. All very slow.* Sometimes need to wait about 5 minutes before I can type something on it.Would I recommend this phone to a friend? Hellllllll no. Buy a Samsung GS4 or a Note instead.", "Date": "August 6, 2013"}, {"Title": "WATER RESISTANCE", "Author": "Roberto Carrasquero", "ReviewID": "R1NJKSJM9S71QT", "Overall": "3.0", "Content": "This phone does not have a high level of water resistance. I dropped it in my drink by mistake and it absorbed all the humidity inside and stayed wet. The phone was damaged so I do not consider to be true when they say its water resistance.", "Date": "February 4, 2013"}, {"Title": "be aware", "Author": "Nashwan Al Zbairi", "ReviewID": "R2KS6U95YXOC0M", "Overall": "1.0", "Content": "It's water resistant and slash resistant , BUT SADLY it's not scratch resistant.Make sure to place it in the protective case from the first day.And don't forget the screen protector.", "Date": "November 14, 2012"}, {"Title": "i didn't but it, coz still expensive", "Author": "Abdullah", "ReviewID": "R1UAQDBXAA7QG9", "Overall": "3.0", "Content": "First when i compare this price with other websites i find a lot cheapersecond this phone is just like Xperia S but waterproof and Scorpion processor which doesn't make differencewhy it's that expensiveI am either waiting till they give us good price around 350 or i'll look at Galaxy 2, which is a really good phone", "Date": "October 26, 2012"}], "ProductInfo": {"Price": "$239.99", "Features": "3G Network - HSDPA 850 / 900 / 1900 / 2100\nDisplay - 720 x 1280 pixels, 4.3 inches (~342 ppi pixel density)\nInternal Memory - 16 GB storage (11 GB user available), 1 GB RAM\nCamera - 12 MP, 4000x3000 pixels, autofocus, LED flash\nCPU - Dual-core 1.5 GHz Scorpion", "Name": "Sony Xperia Acro S LT26W Unlocked Water Resistant Phone 12MP, 3G, Wifi, Quadband International Version/Warranty White", "ImgURL": "http://ecx.images-amazon.com/images/I/410pZMZl3gL._SY300_.jpg", "ProductID": "B008SAZMHU"}}