{"Reviews": [{"Title": "I like my used Pantech Ease P2020 Cell", "Author": "Helen Tran", "ReviewID": "R1MQPQSNTDC7FS", "Overall": "4.0", "Content": "my used Pantech phone:  for a used one I don't expect it's in excellent condition.  it's good, fits my purpose for now until I can decide what phone to renew.  I like it.Thank you Seller, thank you Amazon", "Date": "January 24, 2014"}, {"Title": "pantech ease", "Author": "John Grillo", "ReviewID": "R2IDLB1XXTVY60", "Overall": "5.0", "Content": "It is like a new phone. The battery holds up well, short time for recharge, all functions work well and with ease.", "Date": "January 16, 2014"}, {"Title": "Don't Buy - I am returning it after 2 days of use", "Author": "AnXin", "ReviewID": "R1ZCESELMD8C5Z", "Overall": "1.0", "Content": "Phone would randomly shut down in the middle of texting. It would randomly decide to not send texts out and leave them in the Outbox with no reason, because moments after one text would not go out properly, another text to the same number (from the same location so reception was not the issue) went out. It would randomly not receive incoming calls or make outgoing calls.Microphone and speakers are inconveniently placed all on the back of the phone by the camera, so if you want to use speaker phone you need to turn the phone upside down and hold it close to your mouth for the person to hear you. The \"speaker\" phone activation button on the touchscreen was intermittently non responsive. The touchscreen in general was very inconvenient  with little precision in control when you swipe, making it very hard to use. You definitely could not use this phone to make a call, check texts or send texts at traffic lights because there are too many steps to navigating each of those basic functions.Pro: it looks cute", "Date": "December 17, 2013"}, {"Title": "bummer", "Author": "Karl R. Adams", "ReviewID": "R3UP42HYXKW38O", "Overall": "2.0", "Content": "this phone had many other issues, buttons did not all work and it would shut down saying it had no sim card then quit all functions randomly. these phones are usually pretty good but we got took on this one.", "Date": "February 28, 2013"}, {"Title": "Perfect phone for my teen", "Author": "Karen Sullins", "ReviewID": "R3L6WS9X32SBU", "Overall": "5.0", "Content": "It's a great value without needing a long-term contract. Seems to be working really well. No problems even with the refurbished model", "Date": "November 29, 2012"}, {"Title": "I had this phone before, and lost it.", "Author": "AT&T customer", "ReviewID": "R31PFUAJZWOX1S", "Overall": "5.0", "Content": "I was so glad to find it available on Amazon...  I did't like being told I had to purchase a data plan, and with this phone I don't have too.  I don't mind not being connected 24/7.", "Date": "November 10, 2012"}, {"Title": "bad battery", "Author": "TW1", "ReviewID": "R3J6ESCNCTFWQH", "Overall": "3.0", "Content": "item was received in good condition however battery was old, unused and not working well, only has a one day charge so I needed to order a new battery - from another vendor - description should indicate battery issue", "Date": "October 11, 2012"}], "ProductInfo": {"Price": "$59.99", "Features": "2-megapixel camera, with digital zoom\nThis offer includes the following accessories 1. Battery 2. Battery Cover (if applicable) 3. Wall Charger\nTouchscreen\nQWERTY Keyboard", "Name": "Pantech Ease P2020 Cell Phone for AT&T", "ImgURL": "http://ecx.images-amazon.com/images/I/5138zpr-73L._SX300_.jpg", "ProductID": "B008GWEYBK"}}