{"Reviews": [{"Title": "My LGL85C", "Author": "Christian D. Wuerth \"Samsung Proclaim\"", "ReviewID": "R29AW8IRUIJKT1", "Overall": "3.0", "Content": "It was initial price. Then, I found this phone to be old technology. That would explain why it came down from $330 to $100, the only thing was it was further reduced in price to $65. The seller and I reached an agrement. Still though it has a front facing camera and a rear, which makes Skype possible. I added a 32mg card for storage and of course alot of applicatipions and works great!", "Date": "February 9, 2014"}, {"Title": "nice phone", "Author": "Edward Johnson", "ReviewID": "R176NXU5OOT26E", "Overall": "5.0", "Content": "bought it for my wife and she loves it. It has all of the bells and whistles that she wanted in a phone.", "Date": "April 6, 2014"}, {"Title": "bad phone", "Author": "Lora LaShay Corpening", "ReviewID": "R2NM9C9FKBE4FO", "Overall": "1.0", "Content": "The phone doesn have good signal it roams, it also freezes up a lot as well have to keep restarting it.", "Date": "March 17, 2014"}, {"Title": "Terrible Phone", "Author": "Anthony", "ReviewID": "R3VBCXPG6V3PU5", "Overall": "1.0", "Content": "i spend 150 dollars on this phone thinking it was a top brand phone when it is a horrible phone. I have many problems with it. problems:1.Very Laggy all the time.2. freezes and have to take battery out and put back in once a day.3. has typing problems key board freezes and have to restart phone for it to work.4. has alot of trouble staying connected to wifi.5. very sensitive push one button and 5 go off at the same time.Overall im very displeased and would have returned i had knew i only had a month to return it very poor phone for price.", "Date": "March 10, 2014"}, {"Title": "Nice phone", "Author": "DEEJAYNIGHT", "ReviewID": "R2U7SF5KVA9W3I", "Overall": "5.0", "Content": "I had this phone 2 years ago and now I have it once again in 2014 and I love it works great I don't know why people keeps on complaining about the battery just don't use the phone to much I bet you people use the phone all day long smh appreciate the phone okay people God :)", "Date": "February 23, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008BLQHY8"}}