{"Reviews": [{"Title": "iPhone or Galaxy S3? no way!!", "Author": "Luca Cascianini", "ReviewID": "R30NYF9HMY9BBU", "Overall": "5.0", "Content": "I got the S3 yesterday, since I owned a iPhone 4S here the comparison:DESIGN: Galaxy S3 design is stunning, the feeling on hands is incredible. The ergonomics makes all the difference. The iPhone 4S is very squarish and definitely more solid but heavier too (way heavier);SCREEN: Galaxy S3 screen is wonderful with vivid colours and sharp imaages, 4,8 inches vs 3.5 of the iPhone, after you make the transition you wont never come back, impossible.OPERATING SYSTEM: S3 usability is a boom. iPhone is good but never at the level of the S3, way way slower.BATTERY: S3 gets full day + 30% remaining battery, iPhone last till four or five PM;GPS: Galaxy S3 gets locked in less than 10 seconds inside a building, iPhone searches and searches with no success;CAMERA: they are very similar, S3 is faster and iPhone is may be a bit better in term of quality. No dramatic difference.S-VOICE vs SIRI: they are both very basic and more fun than usefull.USB-BLUETOOTH: iPhone only works with iTunes, no Bluetooth, no radio. Galaxy S3 can be usb-connected to computers and flashmemory, it has easy bluetooth connection and yes ... it has an amazing radio :)APPS: to be sincere, all relevants apps in iPhones are present in Android. They have better design but they are at payment while in Android are always free. No mayor differences.Galaxy S3 is an extraordinary good purchase. Recommended for all ex-iPhone users. You wont regret, there is a world outside iTunes :)", "Date": "June 22, 2012"}, {"Title": "Phone not actually what it was disclosed to be", "Author": "Carolyn Omokeye", "ReviewID": "R2T1OKGSRZC3BW", "Overall": "1.0", "Content": "This seller indicated that this phone works with ATT and TMobile. What they did not say was this phone does not work well with TMOBILE USA and if you have text, data and internet you will not get 4g internet you will only get Edge2g or none at all. Giving that much information would be enough for a TMobile subscriber NOT to buy this phone. Also this phone has a lag time of about 2 seconds when you touch the home key, because it is not totally compatible with TMOBILE you constantly go without service and during conversations there is this weird noise on the phone and when you try to end a call it stays connected no matter how many times you tap to end the call....you eventually have to remove the back and take the battery out and restart this phone. This company is not receptive to customers and through no fault of the customer to return the defective phone....this seller will charge you a restocking fee. I communicated this with Amazon.com and filed and AZ claim. Communication between me and the seller is to go through Amazon. This sell got my telephone number and called me and told me that there are over 1000 carriers around the world to use and TMoble USA just happens to be on this unlocked phone which TMobile prevents from using all of their services. They actually know this and do not disclose this because they want you to purchase the phone....they want money. And to purchase this phone and not get what you have contracted TMOBILE for because you will pay for your services whether this phone is capable or not.  On this site it says.... Seller:FGS Trading Seller Rating:93% positive over the past 12 months. (9,404 total ratings)In Stock. Expedited shipping available.International & domestic shipping rates and return policy.Works with all GSM phone companies (ATT, T-mobile, etc). Will NOT work with Sprint, Nextel, Verizon, MetroPCS, etc. This is the international model. « Show lessDO NOT BUY THIS PHONE IF YOU HAVE TEXT, PHONE AND DATA WITH TMOBILE........YOU WILL REGRET IT.", "Date": "September 20, 2012"}, {"Title": "wasn't what they said", "Author": "markus", "ReviewID": "R1FBZF7VY2EPGK", "Overall": "1.0", "Content": "they said the phone was unlocked for any sim card carrier like T-mobile and AT&T; but i put my current sim in there it was a simple mobile sim it works with all phones T-mobile works with but it didn't work in the phone they gave me I went to a T-mobile store and said it was reported stolen so they sold me stolen property", "Date": "May 6, 2013"}, {"Title": "wrong info", "Author": "jamal clarke", "ReviewID": "R1M7IRP3MRXHBT", "Overall": "1.0", "Content": "seller did not mention that the back key and the menu key does not work this product is by far the worst product. I now have to spend money to fix this issue. i would not recommend this product to anyone", "Date": "April 25, 2013"}, {"Title": "Amazing!!!", "Author": "Juani", "ReviewID": "R2I4H8ZQ4P430M", "Overall": "5.0", "Content": "The product is amazing!!!The best cell phone I've been. The shipping was successful.Quad-core chipset allow you to do everything at the same time, it's incredible!!!The camera has an excellent definition and the record video is awesome!!!I am very satisfied with the S3!!!", "Date": "October 4, 2012"}, {"Title": "Wonderful!!!!", "Author": "Delfos", "ReviewID": "R3EHZQP7X70D0L", "Overall": "5.0", "Content": "Is the best phone I've had, powerful, versatile with many apps, great battery life and excellent screen with vivid colors and high resolution.", "Date": "December 5, 2012"}, {"Title": "Excellent phone from NYC Blackberry", "Author": "Brian Schoenrock", "ReviewID": "R1RSHN7XCH7ZGI", "Overall": "5.0", "Content": "I am stationed in Afghanistan and needed a replacement for my aging and failing Iphone 3GS.  Most companies refuse to mail phones through the USPS to an APO address, but this one had no issues.  I contacted them prior to purchasing and was told it wasn't an issue.  True to their word, they shipped it quickly.  The shipping was slowed down significantly by the storm that hit New Jersey, where all APO mail must funnel through, but that is not the companies fault.  To be clear as I know Amazon sometimes shows the same reviews for different sellers, I am referring to NYC Blackberry.As for the phone, it is exactly as they advertised and it works fantastically, even on the crappy cellular service here in Afghanistan.  I cannot wait to bring it back home in the Spring and let it loose on a proper cellular service provider.  This phone blows away my old Iphone.  No wonder Apple is trying to sue them out of business.  Its screen is absolutely stunning to look at.  It is so thin and light that I am afraid to break it, yet it is solidly constructed.  I love that I can add in storage and have already added an additional 16GB.  I had to cut down the sim chip since the local provider doesn't have micro sims, but this wasn't difficult to do (there are easy guides online, just search).If you are thinking of upgrading, this phone is the one.  You will not be disappointed.  If you are at an overseas APO address, trust this seller.  I was a bit unsure as their advertising is a bit weak and their listings could use more information, but they came through.  The phone is covered by a Samsung warranty.  The seller even included a power adapter in the packaging since the included power plug is a European standard.  I only use the USB cable, but it shows some added thoughtfulness on their part.", "Date": "November 16, 2012"}, {"Title": "Quad Core Processors will not get 4G speeds in the US", "Author": "Jeremy S. Wanamaker", "ReviewID": "R1Q45UEFV1722Q", "Overall": "2.0", "Content": "For starters, it has taken me about 45 days to finally get a hint at the problem: I cannot and will not get 4G connections with this phone.  The rep at the AT&T; store recommended being dishonest and returning it under manufacturers warranty to Samsung USA in hopes they would replace it with a dual core phone that works.  This news came after 4 trips to the AT&T; store to get different SIMs, and doing a complete phone reset because my phone was so slow.  Apparently my experience is the common experience for US customers with international Quad Core Samsung Galaxy III S devices.  In addition to slow speeds, my particular phone rebroadcasts dial tones of the person I have called, to the person answering, though I cannot hear.  I was told this is a less common but known issue.  If the answering line is receptive to button pushes, my phone just dials away at there auto-attendant.The last rep that helped me said he feels bad for people that bring these phones in to get set up because the phone is great for everything but data speeds; most customers don't realize they are not even getting full 3G speeds with these phones and to save headaches, the service reps just don't mention there is a problem. Seems strange that such a widely known flaw wouldn't be discussed in the seller's writeup as a caution at the least.The 22 tests (since the reset) in the Dallas Fort Worth area (AT&T; HQ) between 2012/12/23 and 2013/01/02 on my particular phone pan out as follows (casting out the the worst result):Download speeds:Avg: 4.08Mbps  Min: 2.01Mbps  Max: 7.295UPload speeds:Avg: 0.78Mbps  Min: 0.47Mbps  Max: 1.099MbpsLatency: Average 111msYou will notice that my results closely match PC Magazines published findings for 3G service in my area (last June).According to PCMag, my EXPECTATION in the DFW area with 4G-LTE service (and 3G) is:Download speeds:Avg: 14.68Mbps  Max: 41.18Mbps3G:  3.25Mbps  Max:  5.14MbpsUPload speeds:Avg: 3.58Mbps  Max: 4.98Mbps3G:  .089Mbps  Max: 1.09MbpsAn informed buyer is usually the happiest customer.", "Date": "January 2, 2013"}, {"Title": "oliver", "Author": "oliver familia de oleo", "ReviewID": "RFIKW52G1N40P", "Overall": "1.0", "Content": "do not buy this phone from berrysweet it is a fake item ,,,,this is a Korean version it looks like the original one but when you turn it on you realize it is fake ,,,,,,,it does not have any of the sensor the original has ,,,,,,terrible seller", "Date": "December 13, 2013"}, {"Title": "excelent product", "Author": "ivand2", "ReviewID": "R2HEI94EN4OE7E", "Overall": "5.0", "Content": "Its a very funny phone. Works as fast as I had imagine. The quality of the transmission is very high, the screen always surprise with the high definition", "Date": "August 7, 2013"}], "ProductInfo": {"Price": "$545.00", "Features": "Samsung I9300\nFactory Unlocked\nPebble Blue\nSamsung GT-I9300 Galaxy S III\nSamsung GT-I9300", "Name": "Samsung I9300 Galaxy S III Pebble Blue - 16Gb", "ImgURL": "http://ecx.images-amazon.com/images/I/414UItZxqzL._SY300_.jpg", "ProductID": "B0084T4D34"}}