{"Reviews": [{"Title": "A bright little projector in an otherwise ordinary Android phone", "Author": "Mala", "ReviewID": "R1OSEUAW7FBNPV", "Overall": "3.0", "Content": "Samsung has had this projector phone on the back burner for a while. But finally it's out in the market (at least where I live).Let's get straight to the projector. It works. It's impressive for something that's on a phone. And if you step back, it give you an image that's 50 inches. I used it to watch a few YouTube videos beaming it on my wall at night but with one soft lamp on. It was fine. Obviously it's better in pitch dark. The 15 Lumins Pco projector beams out from the top of the device. You hold it like a remote. There was a stand with the phone but unless I'm misting something placing the phone into the stand beams the image up on the ceiling at a tangent! There's a dedicated projector button and a projector app for a few settings including a Rotate which you'll need. The brightness of the projected image is separate from the phone's own screen and you will need to just keep it on max all through. You can beam anything from the hoe screen to photos to videos. But there is a bit of fiddliness involved despite the button.Samsung obviously thinks the novelty of the projector is enough to sell the phone because it doesn't seem to have bothered to put in anywhere near the newest version of Android. Gingerbread is now 2 versions old and while we may think Jelly Bean is expecting too much, what's up with not putting in Ice Cream Sandwich? But well, Samsung is bringing out other phones apart from the Beam that are also only on Gingerbread. If I'm not mistaken, the S3 is its only ICS phone so far.You'd be right in worrying about battery life if you're going to be projecting stuff around a lot. So, they give you two batteries. That's a nice touch. But other aspects are not so thoughtful. Why just 8 GB of internal storage when you may want to store videos ad presentations to beam? Why just a 5MP camera when you should be able to shoot better stuff to project?Anyone thinking of buying this phone should consider carefully just how much they need that projector on the fly. There are screens all around us. There are few places, during the day time, that you can project in without losing some of the brightness. That's the case with any projector, but in \"projecting situations\" there are darker rooms and the lights are turned off. A projector in the pocket may not get the same treatment. Think about it.", "Date": "August 14, 2012"}, {"Title": "Great phone", "Author": "Dave", "ReviewID": "RJM3G2COV92V7", "Overall": "5.0", "Content": "I came to this phone from an iPhone and honestly, I prefer this one. I can change the battery, it has external SD storage, and of course, a projector. I'm a teacher and I use the projector in class for powerpoint, videos, flinging vocabulary notes on walls/ceilings/etc. It's pretty cool.The battery life is surprisingly good, better than my iPhone was, even when projecting. I've watched up to one hour long videos and it's only brought the battery down by 1/3 or so. It came with an extra battery, but I have yet to use it!Someone else commented negatively on the 5MP camera, but it's enough for me; I'm a photo buff, and if I want hi-res I'll use my DSLR. This is awesome for snaps that you're just going to upload to Instagram or whatever.", "Date": "February 4, 2013"}, {"Title": "Great phone, enternainment for the kids", "Author": "J. Proctor", "ReviewID": "R32Z0QJ49I7L9A", "Overall": "5.0", "Content": "I am very happy with the phone.  The kids love the projector, they watch youtube videos, play games, and more.", "Date": "December 21, 2012"}, {"Title": "great phone", "Author": "munther", "ReviewID": "R3TEMUUFIKU3MA", "Overall": "5.0", "Content": "a very cool phone  it has everything the other galaxies have  the only difference  is  it is cheaper and cooler", "Date": "May 21, 2013"}, {"Title": "Awesome", "Author": "Sam", "ReviewID": "R16BISFM08P8HA", "Overall": "5.0", "Content": "I just bought this phone  when there was 7 left from the seller then i saw it to my friends and 2 of them bought it rightaway because its worth it and projector works perfect but i love the iphone touchscreen much batter if samsung make screen like apple thn samsung winnerAnd fast shipping and great service i love to watching movie all night.  Oops its 4.49 am", "Date": "July 13, 2013"}, {"Title": "excelente", "Author": "giilmer carrero", "ReviewID": "R2HLRIQT32217V", "Overall": "5.0", "Content": "todo bien el producto funciona excelente como lo explica el proveedor, que diga asi me llego ayer a venezuela gracaias", "Date": "March 22, 2013"}, {"Title": "Great cellphone", "Author": "Livia", "ReviewID": "R2ENI3L7ERADDS", "Overall": "5.0", "Content": "This cellphone is awesome, it comes with and extra battery . . . . . . . . . .", "Date": "December 13, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "3G HSDPA 850 / 900 / 1900 / 2100\nInternal - 8 GB storage, 768 MB RAM\n5 MP, 2592 x 1944 pixels, autofocus\nAndroid OS, v2.3.6 (Gingerbread)\nDual-core 1 GHz Cortex-A9- GPU NovaThor U8500", "Name": "Samsung Galaxy Beam i8530 Factory Unlocked Droid QUAD BAND 3G HSDPA 850 / 900 / 1900 / 2100", "ImgURL": "http://ecx.images-amazon.com/images/I/51Cysm4sE%2BL._SY300_.jpg", "ProductID": "B008KA79RE"}}