{"Reviews": [{"Title": "semi smart phone", "Author": "tom shirk", "ReviewID": "R2G4RJVEW5YPAD", "Overall": "4.0", "Content": "this phone is well worth the money. Good introduction to someone starting out with a touch screen. Does not require the additional $10. data coverage but does allot more then the basic phone..I own 3..", "Date": "April 29, 2013"}, {"Title": "Perfect for our teen", "Author": "Amazon Customer", "ReviewID": "R37JOZPG4KML5H", "Overall": "5.0", "Content": "This phone works even better than the previous we received from Sprint! I plan to order another one to replace my daughters phone.", "Date": "November 2, 2013"}, {"Title": "Avoid this.", "Author": "Josh", "ReviewID": "R8K0OEGQWHMW9", "Overall": "1.0", "Content": "Do not purchase this phone.My previous phone had died and I had the option to switch to another phone without any contract penalties.Unfortunately that was the biggest mistake I ever made.This phone has almost no internal storage, even with an added microSD card  the sheer fact that you need to use some of the internal storage even while keeping every other file on the SD card I can keep less than 10 programs on this phone without getting low memory warnings, and can't install errors. This is further hurt by the fact that it comes with almost 20 megs (Out of 140) of bloatware you can't uninstall, AND all the internals of just normal android operation mean you can install almost nothing. I Have a handful of needed apps, and deciding what to install and delete feels like picking my favorite body parts. (We're talking simple stuff here like DO I want a lost phone finding program or A small 700 Kilobyte game!This phone like most phones will have some weird glitches, but overall, it's not usually that bad, but can still at times be frustrating.The charging glitch is an odd one, sometimes if you charge it and unplug it the phone will think it's still charging which will heat up the phone and cause it lose charge faster, this easily is fixed by plugging it in again and re-disconnecting it...Oh, and even though I mentioned there's little room for apps, that will be okay, because the video resolution is so small compared with even (free with 2 year contract phones) that you won't be able to run 70% of those apps anyways.My non-android tablet I hacked to have android has a higher compatibility list than this phone.Overall this is scrapping the bottom of the barrel android phone it IS usuable, but it is not something that does anything well. The ONLY advantages these phones have is that it has a blackberry style keyboard, and the parts are cheap (new battery, replacement phone, etc) are all pretty cheap. This would be a good phone for a little android exploration, or for an absent-minded child's phone.The only reason I still use this phone is for the cost, It's cheap enough, and my employer won't cover any more expensive of a phone. (Plug my provider charges a monthlhy fee for all OTHER android phones)My girlfriend did bring up one more positive for this phone. It has taken YEARS of abuse. I am very rough on my electronics... I've had this phone for 3-4 years now, dropped it, fumbled it, and more and the worst I've had to do is buy it a new battery once or twice for a few bucks (mind you this is with No additional case or anything)", "Date": "October 13, 2013"}, {"Title": "Good for teens", "Author": "LAKEYTRA SIMMONS", "ReviewID": "R1IF8VBKKVYX82", "Overall": "5.0", "Content": "Decent phone for a teen. This was a replacement phone for my daughter until she was due for her upgrade on our contract.", "Date": "January 8, 2014"}, {"Title": "I like it", "Author": "Haley smedstad", "ReviewID": "R1V3PJWM19322Y", "Overall": "5.0", "Content": "I have had this phone previously and I broke it :( I've been living on flip phones and basic phones for the past 8 months and I'm sick of it so I'm re-purchasing this phone again until my contract expires. Love this phone!", "Date": "December 26, 2013"}, {"Title": "You get what you paid for", "Author": "Amanda Gonzalez", "ReviewID": "R13PABTYABHD9H", "Overall": "3.0", "Content": "It had a lot more scratches on the back than I thought it was going to have, but all in all it worked for a good 6months... you get what you paid for.", "Date": "October 8, 2013"}, {"Title": "it sucks", "Author": "juejue", "ReviewID": "R2GS60F3RUPJR8", "Overall": "2.0", "Content": "Doesn't work very well. Not worth the trouble of sending back. I wasted my money on this purchase. Never again.", "Date": "October 2, 2013"}, {"Title": "Bad Battery", "Author": "Kristine Dollberg", "ReviewID": "R11HYWX4V3LBXE", "Overall": "2.0", "Content": "The phone lasted 2 weeks and now we are sending it back with a bad battery.  It may just be our phone and not the model.", "Date": "September 15, 2013"}, {"Title": "Seller and Phone Exactly Right", "Author": "Sean James Cullen \"Office Guy\"", "ReviewID": "R1ZT9M83XE7VK1", "Overall": "5.0", "Content": "The phone was very well priced by the seller, and was delivered on time and in straight-from-the-factory shape.  This is the second Replenish I've owned in the last 19 months.  Replaced it because of a fair amount of banging around it took.  While still deliberating on whether to stay with Sprint (the contract is up in December), I found it made the most sense for now to find a seller on Amazon, in to avoid a new contract when purchasing a new phone through mobile phone co.  Again, good solid phone, good solid seller.", "Date": "August 19, 2013"}, {"Title": "Crashes every hour or so", "Author": "Shane Breeman", "ReviewID": "R1P5UCU51HGQZ2", "Overall": "1.0", "Content": "Probably the worst phone i've ever had...seems to always crash. It won't read my sd card half the time. Says it's charging when it's not plugged into a charger...Needless to say i'm returning it.", "Date": "July 29, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Fast 3G connectivity; Android 2.2 OS (Froyo); Android Market; Preloaded Android apps\nWi-Fi networking (802.11b/g); Built-in mobile hotspot functionality\nBluetooth connectivity (version 2.1); Onboard GPS; Music player; Video player\n2-megapixel camera; Video capture capabilities; Google Maps Navigation; Google application\n2.8-inch capacitive multi-touch display; Physical QWERTY keyboard; 600 MHz processor", "Name": "Samsung Replenish M580 Sprint CDMA Phone with Android 2.2 OS, 2MP Camera, GPS, Wi-Fi and Bluetooth - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51CDwp-NNeL._SY300_.jpg", "ProductID": "B008LXDCMQ"}}