{"Reviews": [{"Title": "Great phone for a senior", "Author": "Kim", "ReviewID": "R3T0MG3SPUG79K", "Overall": "5.0", "Content": "I purchased this phone a few years ago for my parents who are both in their 80's. It's simple and uncomplicated.  Dial the number, push green and \"go\" and when you're done, close it up or push red and \"stop\".  Also, the ear piece volume is very high and they have no trouble hearing with it.  Also, I did the research and this is the only phone of its type that you can change the font size on and the letters/numbers are pretty big. My mom is 85 and much to my surprise she taught herself how to text using a numeric keypad. I highly recommend this phone.", "Date": "January 1, 2013"}, {"Title": "replacing this phone", "Author": "Mary", "ReviewID": "R1AGBXFF2SLJYK", "Overall": "2.0", "Content": "bought this phone 3 months ago, looking to replace it.  im getting constant complaints from friends/family that they can't hear me.  i called my own phone to experience it, the voice faded in and out, was choppy, very hard to hear.  also the phone doesn't always ring, randomly sends calls to voicemail, alarms may or may not ring.  incidents have become more frequent. design of phone is awkward, hard to hold without pressing buttons on side.  i find the phone not as user friendly as other flip phones.  ive never had to read a user manual to use a phone before. with this phone i had to read just to get my contact numbers in.  in my opinion its junk.", "Date": "November 30, 2012"}, {"Title": "Great basic phone! Are you ready to downsize?!", "Author": "Diamond Star", "ReviewID": "RD7109NYFGRXV", "Overall": "5.0", "Content": "Has your contract expired?After my cell phone contract expired and my Apple Care expired, I accidentally dropped my Iphone on a ceramic floor thereby shattering the glass rendering it undesirable and unusable and decided that it was time to downside and get a phone and service that would be more affordable/practical each month without paying for a phone that costs almost as much as my mortgage!It was a bit tricky because I had a recent expired previous contract AT&T; plan but this prepaid phone was only available on their site WITH the prepaid plan and not in the store. I thought I was going to be able to easily switch to the prepaid plan in the store but they were only offering the contract in the store. Then tried to order the latest version of this phone from their site BUT that proved to be a hassle because the only way I could order the new phone was to order a NEW phone number! NOT!So, I changed to prepaid but needed a phone:That's when I decided to look on Amazon, which I found this phone. I have to say that I am quite happy with this phone. It's a nice basic cell phone, which allows you to customize ringtones to your different callers. It didn't come with directions but it's so very intuitive to figure out (love user friendly technology) It does have internet, which I can check my email or when to expect my transit bus. With the money I saved about $50. monthly (that's the smartphone data plan itself!)Since I'm saving $50 a month,I was able to get a refurbished Ipod Touch, enabling me to transfer ALL my backed up data that once lived on my broken Iphone, including my contacts, calendars, etc.I conclude to say that the Pantech Breeze II may not be fancy, but to me, it's  sensible, a real SMART PHONE because it's smart to save money.", "Date": "July 15, 2013"}, {"Title": "Old Style Phone", "Author": "Marney", "ReviewID": "R2NQG6VQ4G3CWG", "Overall": "3.0", "Content": "I got this phone for my father who threw is in the trash (by accident). For him it is a great standard phone. He only uses the phone to talk. he does not text or get on the internet with it. So far it has worked great for him.", "Date": "April 19, 2013"}, {"Title": "Love the Pantech Breeze II", "Author": "Teri Stamper", "ReviewID": "R3G3NDXZ4KNK7J", "Overall": "5.0", "Content": "I got this phone for my husband to replace the exact same phone.  The first one got water damaged.  He is not techno savvy so a smart phone was not an option.  He needs to be able to turn up the volume and increase the font size.  This is the perfect phone for him.", "Date": "November 15, 2013"}, {"Title": "great buy", "Author": "MAV", "ReviewID": "R36VWM5N53KZ5W", "Overall": "5.0", "Content": "I rate 5 star because phone arrived looking newI recommend because it is a good phone. the phone is simple to use for an older person  or a younger person. has lots of setup options", "Date": "October 15, 2013"}, {"Title": "Horrible battery, otherwise OK....", "Author": "hotchas \"hotchas\"", "ReviewID": "R1DYSNON8V1MXK", "Overall": "3.0", "Content": "The 3G phone works fairly well and is geared towards the older generation with big buttons, bright screen, large numbers/letters, and fairly loud speaker, though using the hands free option for making calls creates an echo and a practically inaudible voice to the person on the other end.  I tried to leave messages on my home answering machine and could not understand my own words when using the hands free option.The BEST feature is the 3G which allows me to get a signal at my rural home where a regular cell phone reads 'no signal'.  I get at least 1 strong bar and occasionally 2 bars.The MAIN problem with the phone is the horrible battery life.  The phone has to be charged every other day, if used 2 or 3x times a day for a few minutes.  Otherwise is barely lasts 3 days on standby, i.e. no usage.", "Date": "December 11, 2012"}, {"Title": "Does The job", "Author": "cm", "ReviewID": "RAZ2Z4K6TA1WI", "Overall": "3.0", "Content": "Works great. Really wish it was in better condition and with less damage, and wish it came with a charger. Other than that works fine.  Got here fast.", "Date": "October 16, 2013"}, {"Title": "Great for me", "Author": "JFAJack", "ReviewID": "R31KOKK5B9ZUS2", "Overall": "5.0", "Content": "I only want to have a phone I can read, is tough, and works in my highrise.  It also must program to my 2007 Lexus Bluetooth, which it does although Lexius said the Breeze III would not.It has a clear signal ..not fuzzy like my samsung it replaced.", "Date": "October 3, 2013"}, {"Title": "Parents are able to use", "Author": "Monica Bowden", "ReviewID": "R10P6NCI410PD7", "Overall": "5.0", "Content": "Perfect phone for my 85 year old parents.  Simple with larger keys and large font on the screen for them to read.", "Date": "August 4, 2013"}, {"Title": "Good phone for elderly parent", "Author": "Readerwreck", "ReviewID": "R2XNWDZXANQEGH", "Overall": "5.0", "Content": "The Pantech Breeze II is the most user friendly ATT phone I've found for my 90 year old step father.", "Date": "July 18, 2013"}, {"Title": "Great Phone.", "Author": "Donna L Green", "ReviewID": "R10O5W0ETVPNCK", "Overall": "5.0", "Content": "The phone was delivered on time and in Excellent condition for my Mom. The phone was a nice price and  I am very pleased.", "Date": "May 6, 2014"}, {"Title": "Good phone", "Author": "Satisfied User", "ReviewID": "R1JQSGYMJBEJVA", "Overall": "4.0", "Content": "I had a phone like this before that bit the dust, so I was glad to find this phone. It does what I need it to do. If you just need a phone without all of the \"bells and whistles\" that Smartphones have, this is a good one to use.", "Date": "April 22, 2014"}, {"Title": "back in business", "Author": "gary j robertson", "ReviewID": "R3NUYAQ8GIVV80", "Overall": "5.0", "Content": "Just like the original!  The price was perfect.  Should last for years to come.  Feel like christmas all over again.", "Date": "April 2, 2014"}, {"Title": "Best cell phone I ever owned for sending and receiving calls", "Author": "Pink Breadsticks", "ReviewID": "RTPFJ1OOBHOOK", "Overall": "5.0", "Content": "If you are like me and want to leave the modern love of gaming, apps, chat, email  etc to the tablets and computers then you will just love this phone. As just a phone, it is by the far the best one I ever purchased. I git tired of the touchscreen phones getting broken, and battery drain etc. I just need one to make calls that I can trust. With it being flip phone it is less likey to get broken. (It had been dropped numerous times on the sidewalk, in the mall, on marble floors, and fell off th  roof of my car into the highway) It still works. It has different modes of operation. For tech lovers there is advanced mode with all your icons, apps, etc. For simple folks, there is a simple mode. The camera is pretty good too. Has micro sd card slot and voice controls too. It charges faster than any phone I have. A plus when rushing out with a low battery. In a few minutes I have full charge.", "Date": "March 17, 2014"}, {"Title": "#4", "Author": "gerald yoshikane", "ReviewID": "R328KJUKTPA0UX", "Overall": "4.0", "Content": "Did not know that it has been unlawful to unlock phones after 1 jan 13.  I will open account with AT&T; after I use up all minutes with T Mobil", "Date": "March 26, 2013"}, {"Title": "Pantech Breeze 2", "Author": "fish", "ReviewID": "R1S7SIB5623Q8", "Overall": "5.0", "Content": "Same phone I had years ago , comes complete with charger which is also a usb charger\\and data link from the phone to your computer via the USB plug on the cord.Battery went bad after a few months , amazon has them cheap enough.", "Date": "March 24, 2013"}, {"Title": "good deal on unlock phone", "Author": "John White", "ReviewID": "R3ED7P859HRZYC", "Overall": "5.0", "Content": "Easy to use, with large number. Address book is a little slow updating, but that ok. Texting is a breeze", "Date": "March 2, 2013"}, {"Title": "Great little phone", "Author": "Sandra K. Petteway", "ReviewID": "R3FLEU19KBN2UP", "Overall": "5.0", "Content": "I replaced a Pantech Breeze with a new one because my original phone broke.  I love this phone!  It's a great basic phone, very easy to use, for those of us who are not into all the new technology.  All I want to do on my cell, is to talk, I don't do much texting and I don't want to get on the internet on my phone.  This is a perfect phone for a beginning cell phone user or an older person.", "Date": "February 19, 2013"}, {"Title": "Cell Phone", "Author": "Dee Guerriero", "ReviewID": "R6UPYYN7BSG42", "Overall": "5.0", "Content": "I have this same phone and wanted to get my husband one to swap out his smaller phone he could hardly see. He loves this new phone and gets better service with it. Thank you for shipping it on time. Came with battery and home charger.", "Date": "January 27, 2013"}, {"Title": "Pantech Cell Phone.", "Author": "phats", "ReviewID": "R3OU1FF7DM3PY5", "Overall": "5.0", "Content": "I gave this as a gift, to a close friend. she wanted a phone easy to use and not hard to use.This was the best.", "Date": "January 26, 2013"}, {"Title": "Worst Cell Phone I've Ever Owned", "Author": "Ghetifal \"Jono\"", "ReviewID": "R21VV7QW4CBNU0", "Overall": "2.0", "Content": "OK, I don't need a lot of features on a phone. I don't use it for internet access. I just want text and the ability to make and receive calls. This phone is ok at making and receiving calls, but I swear that you're better off using Morse code over a telegraph then fighting this phone's text messaging system. For one thing, it always wants to predict \"93\" instead of \"we\" and \"48\" instead of \"it\". In fact, it tries to predict a lot of stupid things, meaning you can't just let your fingers fly. You sit there individually screening words and scrolling through them. Also, there is no easy way to use words that aren't in its library. In previous phones, you could spell out words on letter at a time while still in predictive text mode. On this thing, you can't \"lock in\" letters and continue. You just have to go through the menu and go into the old school text mode from before predictive text. The battery life is less than 2 days, and I'm talking with minimal use and no internet access. If you use your phone a lot, I don't imagine you'd make it home from work even if you charged it over night. I went cheap because I didn't need a lot of features (I think the phone was $30 or less with the plan), but now I know you are much better off forking over more money. I really wish I could just use my phone from 2001 which was more convenient and had more features and a much better battery life than this cheap product.", "Date": "January 22, 2013"}, {"Title": "Love this phone!", "Author": "Glacia", "ReviewID": "R3G0VDC64ZIV2M", "Overall": "5.0", "Content": "For the money, you absolutely can not do any better than this phone.  It's durable, doesn't drop calls and it's not bad looking with a rubberized cover, which I recommend to increase it's durability.", "Date": "November 14, 2012"}, {"Title": "Phone did not work!", "Author": "Eva Fimbres", "ReviewID": "R19CSGFHFH6MCT", "Overall": "1.0", "Content": "The phone did not work; Wouldn't keep the charge and was not able to go to the main menu. It was a blank screen. Phone was sent back to the shipper :(", "Date": "January 23, 2014"}, {"Title": "BRENDA", "Author": "BRENDA WILLOUGHBY", "ReviewID": "R3DF9FKV6SQ2DF", "Overall": "5.0", "Content": "THESE PANTECH BREEZE II CELL PHONES ARE A GREAT VALUE FOR THE MONEY.  I WOULD BUY THEM AGAIN.  GREAT PHONES.", "Date": "November 2, 2012"}, {"Title": "simple to use, just perfect", "Author": "B. Allmon", "ReviewID": "R2Y940SI8I5KZS", "Overall": "5.0", "Content": "I hope the cell phone manufacturers never stop making the world phone that has mechanical keys (not touch screen).  Why lug some big device around in pocket that is unnecessary?  Sometimes, simple is better.", "Date": "December 6, 2012"}, {"Title": "returned", "Author": "gr8islife", "ReviewID": "R25EZ6OLHIEWS9", "Overall": "5.0", "Content": "This was a mistaken purchase due to my being technology challenged. :) I had a very easy time returning the purchase.", "Date": "January 13, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "check with service provider on service compatability\ncontact us for more info on the phone if needed.", "Name": "Pantech Breeze II P2000 3G GSM Cell Phone for AT&T Wireless", "ImgURL": "http://ecx.images-amazon.com/images/I/41fG2uJZFXL._SY300_.jpg", "ProductID": "B008DJ4I1M"}}