{"Reviews": [{"Title": "Great basic phone", "Author": "WM", "ReviewID": "RJ6ALIEQU2N0Y", "Overall": "3.0", "Content": "Did not buy from Amazon but from brick n mortar store and another from an on-line retailer.Pros:1. Dual Sim2. Simple to use if all you want is to dial, no browser feature (don't have a data plan anyway, its blocked).3. Music player (see con)4. Bluetooth5. Speakerphone very loudCons:1. Size, its kind of thick and lenght wise is about as long as my Motorola XT360 Android with keyboard2. Because its a simple phone, menu and features limited (what do you expect, an iphone competitior)3. Very limited instructions both in the box and even on their own website4. BT, but no voice command or dialing, again what would you expect for under $305. Downfall, it was almost perfect for a basic phone till the music player, major fail, since there is no audio plug, had to use bluetooth headsets.  The BT headsets works great with iPhone, iPod Touches.  However, when it came to the phone the quality is very poor. More like AM radio quality. Oh well.  Again, if camera, music is not your thing, this phone works great. No ATT bloatware or accidentally pressing the \"Net Key\" by mistake and get charged for \"internet/data\" use.Hints:To \"Activate Speed Dial\" (assigns a phone number to the keypad): Menu->Phonebook->7.Speed Dial->1.Status->On (yes, took me a while to figure it out.  You can assign the name/number through the contacts menu but each time I press and hold down the key, nothing happened until I went into the menu system to \"turn it on\".For manual keypad lock:Press the center of the d-pad (4 way directional pad - \"square pad right underneath the screen\"), yes the \"menu screen pops up\", but  then quickly press the \"*\" (star) key.  Its the same way to unlock it.Yes, these two pieces of information was NOT in the directions nor were they on the web site and could not find it online including google.", "Date": "October 29, 2012"}, {"Title": "inexpensive and very good dual sim phone", "Author": "eladbk", "ReviewID": "R26P42ROUTS7MV", "Overall": "5.0", "Content": "Very good phone especially for those who travel because it can significantly reduce your costs abroad, has excellent battery, very simple menu (too simple - one might say poor), but for phone calls and text messages do not need anything better, there's also an FM radio with built antenna, which can be useful sometimes, and built-in lamp. All in all, more than expected for the price. The only criticism is a little delay when writing sms, but nothing to worry about, and that's all. I've tried many samsung dual sim phones, which are multiple expensive but none are good enough. So if you need a cheap and reliable dual sim phone my recommendation is that you consider this phone.", "Date": "October 13, 2012"}, {"Title": "A good basic phone", "Author": "lilgranma", "ReviewID": "RMS8RHW0CXC15", "Overall": "4.0", "Content": "I am pleased with the phone.  It has large numbers, pretty easy to navigate seeing it doesn't give you instructions.  I love the long life of the battery.  Had  it a few days shy of a month now and not had to charge the battery once. I would like more choices of ring tones since it only has two ring tones; but that is minor.  I couldn't figure out how to access my voicemail at first. It didn't have a number to access it so we tried putting in the AT&T; number my husbands phone showed and it worked.  All in all = its a good solid phone for the money.", "Date": "September 27, 2012"}, {"Title": "Great for seniors.  Basic functions work great.", "Author": "Jung Y. Han \"Pungury\"", "ReviewID": "R2WVZYCFDZ4SNI", "Overall": "4.0", "Content": "I bought this phone for my father in law.  He uses T-Mobile pay-as-you-go plan.  He wanted a bar phone, big buttons, light, and easy to use phone.Ease of setup:  I charged it and put the old T-Mobile SIM card in to the first SIM slot (it has 2).  Turn the phone on, and it found the signal in 5 seconds and worked.SIM slot was little tight, but not bad at all.  The menu was not intuitive and the manual is not comprehensive.  To find out how to lock the keypad, I had to search the web.  Changing the ringtone and ringtone volume also was not easy to figure out.  Setting up clocks were pretty easy.  I give it 4 stars.Call quality:  Signal was stronger than his old T-Mobile phone.  He has a hearing problem, but did not have any problem hearing the ringtone and was able to hear the other person fine.  I give it 5 stars.Ease of use:  Just to send and receive phone calls, it is very straight forward.  Locking the keypad is little challenging because the middle navigate button really has 5 buttons hidden inside, you have to click the middle one then * key.  Could've been a little easier (like use the menu button and * button).  It has pretty decent size battery in it, so I am expecting it to last long time.  4.5 stars.Feature: The phone comes with only 2 ring tone (both are pretty lame).  It can use MP3 ringtones, but you will have to add them in.  It is not an easy task for technologically challenged people.  I love the built in flash light.  It can play FM radios.  If this phone was for me, I would give 4 stars for the features/price.  But for my father in law, not having extra built in ringtones, and not having physical volume control is major disappointment.  So 3 stars.  But flashlight adds another star.  So 4 stars.Overall, I would recommend this phone to someone who travels outside of US often, someone who wants a basic unlocked GSM phone.", "Date": "November 7, 2012"}, {"Title": "I'm either the smartest man to buy this phone or the average user/consumer is a moron.", "Author": "Justin A. Wells", "ReviewID": "RDQFKZHI83N3G", "Overall": "5.0", "Content": "This phone is a cheap piece, perfect for travel. I was concerned at all the people that couldn't get it to work properly, no instructions, etc. I played with it for about 3 mins, figured out most features. I could care less about social networking, and anyone that complains about the quality of this phone or camera is just a moron. This is FOR MAKING CALLS! if you are thinking about getting this for your everyday phone.... i don't even know what to say. the cheapest virgin mobile is a million percent better for surfing, social media. This should be gotten for a cheap travel phone, if you lose it, no huge deal, you get a crappy camera, but its better than none and its on par with a camera phone that's 10 years old. The fm radio, long battery life, emergency camera, and flashlight really make this a great travel phone. So go take your vacation, quit complaining about how you can't twitter from your 30 dollar burner phone or go buy a 40 dollar virgin mobile phone that actually does stuff apart from being a phone. I'll be hanging in the rain forests of costa rica for a month, social media and the outside world besides calls to only close family and friends are going to be a nice thing to take a break from and just live life.PS. get a small capacity/cheap micro SD card, i found a really cheap 4gb one, that will hold about a bazillion photos, voice recordings, etc. (this camera could get away with like 128md or something tiny that probably doesn't even exist anymore.  if you don't get a micro SD, the camera and other items will be useless. cant save anything on phone, it has no memory.", "Date": "January 23, 2013"}, {"Title": "good basic phone", "Author": "M1911 Guy \"m1911guy\"", "ReviewID": "R2B471N3LAFICB", "Overall": "5.0", "Content": "This is a good basic phone. good for overseas travel. the memory is very small basicly about 20 kbytes. on the phone. but you can add a mini sim card. and have tons of memory. but i did not by this phone for memory and music. thats why i have an ipod or regular cell phone. this is good for basic use. and works great in latin america.", "Date": "October 5, 2012"}, {"Title": "Great for the non-techie that wants a simple phone, long standby battery life.", "Author": "William J. Law \"World Travelers\"", "ReviewID": "RQN7GALJT6MPW", "Overall": "4.0", "Content": "Needed a non-touch phone for a relative that just wanted to be able to call. So far so good with this one. Did not care about the dbouble sim. Very reasonable price, LONG standby time.", "Date": "February 10, 2013"}, {"Title": "Nice Phone", "Author": "Amazon Customer", "ReviewID": "R39O0XHN5WUG99", "Overall": "5.0", "Content": "As a replacement for an OLD Motorola 'flip phone', it is great. Simple to use, long talk and standby time.Pulled sim card out of old phone, inserted in new one, turned it on and all was working. Has better coverage than old one too.Still working on getting the alarm to go off when I want  lol......but every thing else was easy to set up. Have recommended to others.", "Date": "January 21, 2013"}, {"Title": "Overseas phone ok", "Author": "baste boy \"pinoy\"", "ReviewID": "R1DI9KHX22A188", "Overall": "4.0", "Content": "This phone is for trips to overseas.  Works real well especially it has dual sim card.  I can use my local before and after I get home and a foreign prepaid since it cost a lot less than roaming.", "Date": "January 21, 2013"}, {"Title": "Great basic phone for the price", "Author": "Joe Punol", "ReviewID": "R2PN07J6SN49AD", "Overall": "5.0", "Content": "Bought for a foreign trip, popped in the SIM on arrival and it worked very well. It gave no problem for my entire trip of two weeks.  Great basic phone for the price.", "Date": "November 15, 2012"}, {"Title": "Wrote this for my mother (how to use phone & do basic things)", "Author": "FilG", "ReviewID": "RIOK34EO96H0I", "Overall": "5.0", "Content": "To unlock keypad:1. Press center of round button2. Press “*/+” key (lower left, below “7” and left of “0”)3. After 30 seconds, screen will dim a bit (press any key to get another 30 seconds)4. After another 30 seconds, keypad will automatically lock.You WANT this, so your phone does not accidentally make a phone call that eats all your minutes!******** Do this if you want to do ______ follow these steps: ***********To add contacts/phone numbers:1. Unlock keypad2. “left” menu → Phonebook (round button left & right, press center to “ok” or press “left” menu to “ok”) →move up until “Add new contact” turns BLUE3. Enter Name: press round button in center, move to top line: enter name using keypad; when done pressOptions key and “Save”4. Enter Number: move to second line & press round button: enter number; when done press Options key &“Save”5. SAVE new entry: press Options key & “Save”To make a phone call:1. Unlock keypad2. “right” menu (“Names”) and pick line & press “DIAL” key (green)Modify Speed Dial entries:1. Menu → Phonebook → Options → “10 Phonebook settings” → “2 Speed dial” → “2 Set numbers”2. You can change settings for numbers “2” through “9” (9 is empty right now). “1” is reserved for your ownnumber which is how you check Voicemail.3. To change any position, move to it & press Options key then “1 Edit” and PICK A NUMBER FROM YOURCONTACTS. You can not have same number assigned to two different keys – it won't let you do that.To Turn off keypad lock (NOT recommended) or change number seconds it waits:1. “left” menu → Settings → “6 Security settings” → “3 Auto keypad lock” → set Off or number of seconds itwaits before locking keypad (shorter is safer)Turning flashlight ON or OFF:1. Unlock keypad2. Press “End call” twice and press round button “UP”: will toggle between light on & offTo check dialed number, missed calls, etc1. Call center → Call history → pick from list2. OR Press “End call” twice and press “left” on round button.To call number from Speed Dial1. Unlock keypad2. Press and hold down # you want:List for your phone is 1 = Voicemail, 2 = name1, 3 = name2, etc.To change ringer/silence/vibrate only:1. Unlock keypad2. Settings → “3 User profiles” → Pick from list “General (normal), Silent, Meeting (vibrate only), Outdoor(loud)”.3. Move to line you want → Options → “1 Activate”4. To change/customize any of these, move to it and “Options” → “2 customize” and change any setting youwant. “Options” → “Save” to make change.5. OR Press “End call” twice and press “right” on round button.To change shortcuts (4 pictures on main screen):1. Settings → “4 Phone settings” → “3 Shortcuts” →To change what “left, up, right” of round button do:1. Settings → “4 Phone settings” → “6 Dedicated key” → pick “1 up”, “2 left”, “3 right” & assign newfunction. Right now “1 = flashlight/torch”, “2 = missed calls”, “3 = User Profiles”", "Date": "December 12, 2013"}, {"Title": "A headache", "Author": "jayessar", "ReviewID": "R358PVD4G82D5F", "Overall": "2.0", "Content": "I bought this phone because it is dual-SIM, to use with both my ATT and T-Mobile MVNO SIMs.  The only good thing I have to say about it is the FM radio works okay, and sounds and feels good at the lowest volume level, without distorting on hard rock music.  It also has a large battery.  There are two signal strength indicators and two missed call indicators, but only one voicemail icon.  I left a message on SIM-2 voicemail, and a TINY \"2\" appeared in the corner of the voicemail icon.  Next, I left a message on SIM-1 voicemail, and the TINY number changed to a \"1\".  I then left another message on the SIM-2 voicemail, but the TINY number still read \"1\".  Also a scrolling message appears near the bottom of the screen which says that you have voice mail, and tells you which SIM received the last message.  During a call on one SIM, I called the other SIM on the cellphone.  I did not hear any sounds to alert me of the incoming call, and nothing was indicated on the display.  I was unable to adjust the call volume.  I read a review somewhere that said you have to go into a menu somewhere to adjust it, but I searched high and low but could not find it.  I could not get the speed-dial to work right, and verified that it was set to \"ON\" in the menu.  The clock was not accurate.  Several times when it was turned on the clock would show an hour later, and then within an hour the minutes would be off by two minutes. The date has to be manually entered, and reads the non-standard day/month.  The color of the blue phone as pictured in the ads and on the box is not accurate.  The blue color phone is turquoise, which I did not like.  There are only two ringtones.  It comes with a small user manual in Spanish followed by English, which will require reading glasses to read.  It doesn't tell you much.  I bought this phone on sale at Newegg, but was shocked to find that they will refund only if the box is un-opened.  Now I'm stuck with it!  This is a strong example of why it's better to buy from Amazon, with their much better refund policy!", "Date": "November 11, 2012"}, {"Title": "Bad phone", "Author": "Daniel", "ReviewID": "R1FGEV3OS81K2V", "Overall": "1.0", "Content": "It said that I am getting BLU T190Q and it said it has good sound quality, but I got BLU T190i and the sound quality is bad. I send that am email about it to get a full refund and said no.", "Date": "December 22, 2012"}, {"Title": "Wish I could afford a better phone", "Author": "Katie Dorsch", "ReviewID": "RTSXGS20OSVFI", "Overall": "2.0", "Content": "I just got this phone.  I haven't used it for calls yet because I've spent a ton of time just trying to figure out the basics.  The manual is tiny tiny print and useless.  The one online is just as useless--why did they even bother writing one?  I wish I had the time to research more before buying this phone but when your phone is dead you have to move fast and when you're broke your options are, well, this phone.  So far I'm not impressed but hopefully what people say about that battery is true--I always love a long lasting battery!!  Either way I'm sure it'll allow me to make basic calls until I win the lottery.", "Date": "February 14, 2014"}, {"Title": "disapointed", "Author": "Amazon Customer", "ReviewID": "R1HBTLF6G80PET", "Overall": "1.0", "Content": "the speaker for hearing the person you talk to stopped working. This was a gift to my mother in law and she lives on a native reservation with no way to return the phone. It was a waste of money. sad to say...", "Date": "October 15, 2013"}, {"Title": "Great Sound and awesome battery life", "Author": "Atul Shukla", "ReviewID": "R17P4ML6U2T1UQ", "Overall": "5.0", "Content": "I bought this simple cell phone for my father (who lives in India). He wanted a simple phone (no touch screen). Based on his feedback, he loved this phone with its great sound quality and great battery life. He used the phone for 4 days and approximately 6 hours of talk time.It is dual SIM, as he travels to two different states and to avoid roaming charges, he has two SIMs. One phone is serving both state SIM cards.Nice simple phone for aged people who wants to live simple.", "Date": "August 22, 2013"}, {"Title": "more than expected", "Author": "karen lowe", "ReviewID": "R2SCOSMVWWCUCP", "Overall": "5.0", "Content": "I was looking for a very simple plain phone, this phone ended up doing more than my expensive smart phone.  I had gotten it for my mother and I really needed large buttons and simple operations however, the buttons weren't larger than normal and the operation not that simple due to all the different functions.  BUT, it is a really nice phone.  more than she needs but would be great for a inexpensive  phone for someone that wants a lot for a little.  It works good too, never malfunctioning and the battery lasts for weeks.", "Date": "August 18, 2013"}, {"Title": "As expected.", "Author": "Dmitry-Floridian \"Floridian\"", "ReviewID": "R1EWKHEWW35YH3", "Overall": "5.0", "Content": "No thrills, as simple as it is possible in current age of overloaded gadgets. The cheapest phone on the market and it does the job.", "Date": "August 7, 2013"}, {"Title": "Good device", "Author": "MCoer \"mcoer\"", "ReviewID": "R35LHTKDY7KSCK", "Overall": "4.0", "Content": "Device works as advertised.  Battery lasts forever!  It is difficult to work your way around adding entries etc. to the phonebook, but it's manageable once you get the hang of it.  I'd definitely recommend if all you need is a talk and text phone.  I couldn't figure out how to view text attachments, but that may have been user error.  Who knows.", "Date": "June 30, 2013"}, {"Title": "Good for travel, but probably worth it to get a better phone", "Author": "The Junglee One", "ReviewID": "RGS4WTNUBOB83", "Overall": "4.0", "Content": "This was a cheap phone I used travelling in Nepal and Thailand. Being able to hold 2 SIM cards was a plus. It was durable and had a loud ringer. BUT, a lot of prepaid SIM cards in Asia have pretty cheap internets/3G, so looking back, it may have been worth it to buy a more feature oriented phone.", "Date": "April 27, 2013"}, {"Title": "No SIM card recognition", "Author": "Heavy top", "ReviewID": "R3HPHTJPC1WBB8", "Overall": "1.0", "Content": "My phone did not work even after inserting a new SIM card as instructed after I called to complain that my older SIM card was not working in the phone. I liked the size of phone, but it did not work.", "Date": "March 23, 2013"}, {"Title": "T190 tank", "Author": "artimos", "ReviewID": "R37FLWWRGHTA2Q", "Overall": "3.0", "Content": "I was looking for a cheap but reliable phone so i picked the tank which fit the price,the phone is ok,the manual sucks thou and poorly laid out,but overall phone is good as you can expect for price. oh the battery life is great", "Date": "February 15, 2013"}, {"Title": "Good radio cell phone", "Author": "Feng Ning", "ReviewID": "RQOCPA4V3NL68", "Overall": "4.0", "Content": "The radio antenna is quite good and the speaker is loud enough, I really feel this feature is so functional!", "Date": "June 14, 2013"}, {"Title": "awesome phone!", "Author": "Bonito Bilaoen", "ReviewID": "R24KBHQI18P5UN", "Overall": "5.0", "Content": "this phone is amazing and very sleek in style, my friends are asking where i got it, very nice investment!", "Date": "January 8, 2013"}, {"Title": "It did not work", "Author": "Paul Bragaw", "ReviewID": "RRTCCUVNDLK5", "Overall": "1.0", "Content": "The phone arrived.  I charged the battery.  It did not work.  I returned it and bought a different brand from a different company.  If you have the time to send a phone back and wait for a replacement, maybe you will have a different experience.  I wish you luck.", "Date": "December 17, 2012"}, {"Title": "Could not get it to add contacts and the manual is awful! I returned the phone", "Author": "Cynthia Boehm", "ReviewID": "R9GL6IMRQYOCA", "Overall": "1.0", "Content": "I was getting this phone for an upcoming trip to Australia. It sounded perfect but it has a very unclear manual and although I am pretty good with technology I could not add any contacts. I check the manual which is so basic it did not help at all and even checked online at the web site and again just in a general  search with no help at all. Finally I returned it and bought a different phone.", "Date": "May 25, 2013"}, {"Title": "sent back.", "Author": "Minimalist Momma", "ReviewID": "R2AOFCZCYAFCMY", "Overall": "2.0", "Content": "Bought this for my parents and they had trouble seeing the small screen and texting was difficult,  Big buttons are nice but it's a basic phone.", "Date": "May 9, 2013"}, {"Title": "I NEED INFORMATION", "Author": "BULELE", "ReviewID": "R162Z7WEDJK7PU", "Overall": "3.0", "Content": "BLU T190b Unlocked GSM Mobile Phone with Dual Sim and GSM Dual-Band 850/1900-Black/BlueI¡M IN VENEZUELA I HAVE TWO QUESTIONS: WHAT HAVE THE PACKAGE?. ONLY DE PHONE?i NEED THE USB CABLE AND BLUETOOTH-AIRPHONE ¿HOW MOUCH?", "Date": "September 5, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "GSM Quadband, Unlocked Dual Sim 850/900/1800/1900\n30 Days Standy-By Battery, 16 Hour Talk Time\n1.8\" LCD Display, Camera, Bluetooth\nBuilt-in FM Antenna, MP3 Player, MP4 Player", "Name": "BLU T190Q Tank Unlocked Quad-Band GSM Phone with 1800 mAh Battery, Built-in FM Antenna, Camera, and Bluetooth  - US Warranty - Red", "ImgURL": "http://ecx.images-amazon.com/images/I/41BaWeTWsGL._SY300_.jpg", "ProductID": "B008LR0TY6"}}