{"Reviews": [{"Title": "good form factor, great phone", "Author": "Steven P. Spinella \"USteve\"", "ReviewID": "R2NPV2D6IDASQM", "Overall": "5.0", "Content": "The HTC One S is more narrow than other current smart phones. It actually fits the HD screen you see on modern TVs when held horizontally. This means more scrolling when reading horizontally and a smaller onscreen keyboard when swype-ing, so it gave me pause when ordering. Having used it for six months, I can say that I've gotten used to these challenges, even though I do have big fingers and I especially enjoy the form factor.Bottom line is that a phone fits in your hand, and this one fits better than others with large screeens. It is also very thin with rounded edges. Even with a form-fitting cover (see separate review) it fits in my pocket and my hand so much better than the other options. As you know, I carry it every day, so this really matters more than the hypothetical loss of screen real estate.Phone calls are clear, reception is excellent, and wifi works great (I usually don't have a data plan, since when I'm away from buildings I generally only want to do phone calls, read books, or look up information in my databases.My go to app is google mail, calendar, and contacts, all of which are syncing fine between my computer and phone.For reading, I have used kindle for android, adobe reader, and Olive Tree Bible Study app. I am satisfied with all of them. I also occasionally use the built in software to access MS office files (through dropbox) and it has worked fine.I have used the phone to watch you tube videos, but I don't really see a phone as a TV.I do use the camera quite a bit. While the optics are a step down from the larger lens on my Nikon P60, I always have it with me and the resolution is adequate for screen viewing, but not for extensive enlargements. E.g., it's better for memories than for publication.I am totally pleased with this phone. It is plenty fast enough for my mobile apps and it has already served me well for six months. I hope you can get a good deal on one yourself.Technical note: it does take the smaller sim cards. It also has 16 gb storage, but no removable sd card or battery. I have not found this a problem though it was something I considered at the time of purchase, and as you can see, I greatly appreciate the form factor, which benefits from these space saving measures.And if you're wondering, it's so much nicer than any iphone I've seen, just in my humble opinion as someone who doesn't subscribe to the istore game..", "Date": "December 9, 2012"}, {"Title": "Not software supported anymore, not the best One series phone.", "Author": "Michael S. \"Mike\"", "ReviewID": "R3EIYQL3QGR3NT", "Overall": "2.0", "Content": "This phone for T-mobile was ok not the best. Unforntally HTC stopped all software support for it so there will be no more updates to it, and if your lucky you wont encounter the dreaded home button(Helicoptering) issue. Overall: don't recommend this phone to anyone, you might as well go for the ONE.", "Date": "July 18, 2013"}, {"Title": "Excellent cell", "Author": "Vanessa", "ReviewID": "RQ6XTGVPFF9ZY", "Overall": "5.0", "Content": "It's a fast phone, with bright colors on the screen, and also is unlocked so I had no problems with DIGITEL VENEZUELA use it. I love it.", "Date": "November 13, 2013"}, {"Title": "Much better than what I assumed", "Author": "YS", "ReviewID": "R2VGTRL9S4K865", "Overall": "5.0", "Content": "When I first received I think the software is suck! But I called the customers services and I got hold of real person to help me to walk through a bit.  I get used to blackberry in past decade and it took me sometime to learn how to use the new software.After more than one year usage, I really think it is a great phone in many ways.  From time to time, I take photos in restaurants and need to take closer look under the low light situation.  I found my friends who use iPhone & Samsung do not have the same functions at all, because their photos obviously can not be compared with mine. I dropped my phone several times and got some scratches on the back covers and it is still in perfect condition. Finally, I bought a gel cover and it seems it will last longer than any of my past Blackberry.", "Date": "November 1, 2013"}, {"Title": "Would be a great phone if not plagued by Home screen button issue", "Author": "Thomas", "ReviewID": "RVRWBBQ745W1F", "Overall": "1.0", "Content": "Very nice device, but be aware that numerous users are experiencing a SERIOUS ISSUE whenever carrier signal is weak:The phone will then switch homescreen/multiple screen view on its own in very quick succession, and disable all the capacitive buttons. It will keep doing this until you find a spot where the signal is better (if you're lucky). In the meantime, you will not be able to do anything at all: call, pick-up, use apps, whatever. Basically, you then completely loose control over your phone. Just google \"HTC one S touch button issue\" and you'll see many times many posts about it.This issue has been reported to HTC by many users FOR SEVERAL MONTHS NOW, but no patch or update has been released yet as to address the problem. So keep this in mind if you want to purchase this device... You have been warned.HTC, please FIX THIS ISSUE! Thank you...", "Date": "September 15, 2012"}, {"Title": "Amazing", "Author": "Amazon Customer", "ReviewID": "R73N2XDZEZLXV", "Overall": "5.0", "Content": "Let me just start by saying that i love this phone. i have experienced none of the problems that other reviews have been talking about.Screen- the screen very good. idk if it is anything speciel but its got great graphics.Sound- great... thats the only word that describes it. as you know its got beats by dre audio installed so whenever any media is playing it turns on.Build- the phone is very nice. the body of it is aluminum, its so thin!!!Battery- battery life isnt great only like 8 or nine hours if your using aplications.internet browsing- its very fast. about 70 persent of the time the conection. some of the other reviews say that when the phone has low bars that it like goes nuts of somthing. i have had the phone for about 2 months and never had this problem.", "Date": "November 29, 2012"}, {"Title": "Great phone!", "Author": "Fearless203", "ReviewID": "R2IFOM67U223DD", "Overall": "5.0", "Content": "This phone is great, I have One and I love it. The screen is huge, the responsive time is instant, and the amoled HTC screen is timeless. I am running Jelly bean! and yes there is a Jellybean update for it.Fast phone, had some problems with the camera coming in foggy before, but the update looks to have patched that bug.I LOVE THIS PHONE. THANKS HTC!:).", "Date": "September 17, 2013"}, {"Title": "meh...", "Author": "Season", "ReviewID": "R2U9K45O61GBDM", "Overall": "3.0", "Content": "Well...this phone looks great, fancy..HOWEVERat the first time I inserted my sim card and turned it on, it freeze. After maybe one minute, it finally response but it didn't have sound. If you think it sets to silence mode or vibrate mode then you are wrong. When I play music, no sound; when I use home phone to call my cell, no sound. I look up on internet and find out that many people have the same problem. The solution is to pull out your sim card and insert one more time. So I did it and when I turned my phone on, I hear the welcome sound!BUTafter few days, it happened again so I did the same thing. This time didn't work out. So I try to reboot again again and again. Finally after 4(?) times, I hear welcome sound.I don't know if this will happen to everyone, but this is really disappointing.", "Date": "April 8, 2013"}, {"Title": "Such a lovely piece of kit... unlucky it got that nasty Home Button Issue", "Author": "Kerberos", "ReviewID": "R2AAQ0HFY79GR", "Overall": "1.0", "Content": "Would be a nice phone if not plagued by a VERY SERIOUS BUGPros:- Light, but strong- Slick and elegant- Battery ok (with some tweaking it lasts me a fair day with about 3-4 hours screen on time, with stock software it still does 15 hours runtime)- Good Audio- PERFECT CAM!!!- Very good screen- Fast!Well, then there is this (same text as some other reviews - says it all):Be aware that numerous users are experiencing a SERIOUS ISSUE whenever carrier signal is weak:The phone will then switch homescreen/multiple screen view on its own in very quick succession, and disable all the capacitive buttons. It will keep doing this until you find a spot where the signal is better (if you're lucky). In the meantime, you will not be able to do anything at all: call, pick-up, use apps, whatever. Basically, you then completely loose control over your phone.This issue has been reported to HTC by many users SINCE APRIL 2012, but no patch or update has been released yet as to address the problem. So keep this in mind if you want to purchase this device... You have been warned.HTC refuses all liability and is lately even refusing to exchange or repair phones, saying we should now keep waiting for Updates! I am VERY DOUBTFUL an update can adress this as we have already seen 3 relevant Radio-Updates which where meant to address this yet failed!Various threads on XDA forum are currently discussing this issue, gathering testimonies from hundreds of users and organizing a communication campaign to inform the masses. Don't forget to check them out before you invest in this phone:Discussion thread:[...]Campaign thread: [...]HTC, please FIX THIS ISSUE! Thank you...", "Date": "September 30, 2012"}, {"Title": "phone simply does not work", "Author": "Rodney Mahabir", "ReviewID": "R3DBUSAQWNGRF9", "Overall": "1.0", "Content": "The phone makes a wonderful camera,but its has almost zero reception for signal strength. I should have read all the reviews on the phone before I purchased it......hmmm", "Date": "March 21, 2014"}, {"Title": "Nice Phone and was Original", "Author": "Kofi", "ReviewID": "RD6T3J2A9VQS2", "Overall": "5.0", "Content": "Phone arrived on time, Was original as described and has worked very well for about a year. Good looking slim phone. Solid phone and dealer was also honest", "Date": "December 12, 2013"}, {"Title": "Exactly what I was looking for", "Author": "C. JOHNSON", "ReviewID": "R2H8DGJAQKVIQT", "Overall": "4.0", "Content": "Prior to purchasing this, HTC One S 4g Android Phone Grey Blue 16gb with Beats Audio, I had been holding onto my Sidekick 4G Touch, I am very happy with this upgrade, would recommend to anyone, all ages.", "Date": "June 24, 2013"}, {"Title": "excellence everywhere", "Author": "Lordshall", "ReviewID": "R1I4ZX75UZG5MH", "Overall": "5.0", "Content": "This is one of the most gracefull experience that i've had. The phone not just is all what it says but more. I tried all day discoverying break new thing each time it Doesn't have any trouble. It's excellence everywhere", "Date": "June 21, 2013"}, {"Title": "fully satisfied", "Author": "Ricochet", "ReviewID": "R2N6QHU2PEH0KI", "Overall": "5.0", "Content": "the phone has everything I want at an acceptable price, I have nothing bad to say, therefore, recommend the purchase and use of this phone ... thanks", "Date": "March 3, 2013"}, {"Title": "Love it but there is a problem!", "Author": "alejandra", "ReviewID": "R1U3JA75VFCN7R", "Overall": "3.0", "Content": "The phone is awesome! Te delivery was really fast. the package was really well build and the cellphone was new, in a new box, all perfectly sealed. BUT!!!!! The cellphone is T-mobile, so I bought a SIM card for an UNLOCKED phone like the title said and it does not work why? because is T-MOBILE!!! it says T-MOBILE on the phone it does not says HTC like in the picture! Beside that the phone is the best! super pretty, comfortable and fast!", "Date": "June 29, 2012"}, {"Title": "Scammers", "Author": "Idalmys Garcia", "ReviewID": "R1SN0QSV8Y8YTO", "Overall": "1.0", "Content": "This seller is a scammer and that made me return the phone to me a replacement and it takes time to send the replacement and what is my surprise to get replacement?, Which was the same cellular damage that I had returned, now ask you to give me back money and tells me that my time ran out as if they were at fault because they were slow to return my phone and made ​​me lose more money in return and remove cell arrival and at all because the phone was the same that I had sent. Scam ....", "Date": "June 9, 2014"}, {"Title": "New phone with no hype", "Author": "Patrick S Pelletier", "ReviewID": "R4NZWLYNWDWY9", "Overall": "5.0", "Content": "This phone is the practical solution that I was shopping for. I wanted a phone that could make calls #1, and could do so easily. I did not need the latest but for my needs this phone was the answer. Small enough to carry like a phone and not a tablet as many are coming out today. If I want to watch TV I will sit in front of the 60\". This device exceeded my expectations.", "Date": "June 2, 2014"}, {"Title": "it was not as it was describe", "Author": "moraima", "ReviewID": "R3O96Y9TDSME5F", "Overall": "1.0", "Content": "I need to use in my business and I need it to make video but the phone does not work as it was describe and when I contact the seller never got back to me.", "Date": "May 21, 2014"}, {"Title": "Good phone", "Author": "douglas rafael rojas orta", "ReviewID": "R26XDP4TCOBSYR", "Overall": "4.0", "Content": "Very good phone as I expected I recommend it to everyone ;) very fast, the camera is best of all.", "Date": "May 10, 2014"}, {"Title": "wow", "Author": "t.k", "ReviewID": "R3AG4PM7QZ9JZJ", "Overall": "5.0", "Content": "it has been a 3 months since i have this phone and it is working beautifully,no complains,i received it in a blink of an eye.", "Date": "April 22, 2014"}, {"Title": "not satisfied with this phone", "Author": "J.Garcia", "ReviewID": "R2AUZGGLG9XNA9", "Overall": "1.0", "Content": "can only use phone thru speaker. phone is defected. wont recommend to anyone that is looking for a phone. very unsatisfied", "Date": "March 23, 2014"}, {"Title": "defective item and in very poor condition", "Author": "valentin velasquez", "ReviewID": "RW7TEIHBG0U6V", "Overall": "1.0", "Content": "not received the item you purchase as indicated by the order ... I received one phone htc one s in poor cosmetic condition, had broken the casing and the screen broken glas on the corner ... it's important to say that buying a phone black color - red and received one of a different color .... I feel cheated by the seller", "Date": "March 7, 2014"}, {"Title": "Quite Pleased", "Author": "Benjamin Mendez", "ReviewID": "R3NJ7QHGYJDSJR", "Overall": "4.0", "Content": "Updated from a Samsung Dart, and I must say it has been quite a big leap from what I had originally. Its pretty responsive and overall a great phone. Only complaints are; the speakers aren't too loud to blast music or speaker phone, and the front-face camera is only vga. VGA cameras...kinda blow.", "Date": "March 4, 2014"}, {"Title": "htc one s 4g", "Author": "angie Gibson", "ReviewID": "R2BYK220OL0ANR", "Overall": "1.0", "Content": "i received phone fast which is great but phone  is defected it wont updated and memory is very low... I wouldn't purchase this item again.", "Date": "March 3, 2014"}, {"Title": "Very Happy", "Author": "Tricia Navarro", "ReviewID": "R2M19ELO612O0P", "Overall": "5.0", "Content": "Even tho I didn't get the red one like it said on my order I got the blue but can't complain. Works perfect like brand new. Took like a week to get to me can't complain I had a back up phone in the mean time. Very good business tho.", "Date": "February 28, 2014"}, {"Title": "Great!", "Author": "Dainius", "ReviewID": "R2XO5DX1AYYV6S", "Overall": "5.0", "Content": "Was shipped as expected.Came packed in T mobile box.Works fine, unlocked as promissed on the web. I have taken it to Europe. No issues with network connectivity, works fine even with prepaid SIM card.", "Date": "February 25, 2014"}, {"Title": "LOVE", "Author": "S. M. Jnbaptiste \"S. Jn Baptiste\"", "ReviewID": "RRR68S4AIW8Y8", "Overall": "5.0", "Content": "What can I say about my HTC One S apart from, I love it very much!! Physically, its so elegant and sleek and thin and light weight. The screen is so maneuverable with one figure and three finger touch.  The Beats Audio is a PLUS, Great! the 16GB is good enough for me, because the use of the cloud drives is good to have. The only thing I have an issue with is when you put in the headphones it sometimes automatically calls the last number or goes to Google speech search. If now on, I am only buying HTC!!", "Date": "February 6, 2014"}, {"Title": "Very good", "Author": "ayaguas", "ReviewID": "R3LQRYEZHFNDOU", "Overall": "5.0", "Content": "I received the product new and excellent conditions, it operates very well and I do not have complaints about it.", "Date": "January 19, 2014"}, {"Title": "HTC One S 4g Android Phone", "Author": "Daniel Spiess", "ReviewID": "R1MSQ87ASBDTJF", "Overall": "4.0", "Content": "Could not be more happy with the HTC. Great camera and zippy performance. Only negative points, no access to battery and no memory slot. Underrated phone.", "Date": "January 7, 2014"}, {"Title": "Best Phone ive had", "Author": "Cody", "ReviewID": "R2BEXN1ARCMDLZ", "Overall": "5.0", "Content": "I love this phone its my 3rd phone the same kind. The screen is kinda small but the quality and battery life is unbelievable.", "Date": "October 6, 2013"}, {"Title": "very good", "Author": "Adina dor", "ReviewID": "R1QZZN4U9MG4OS", "Overall": "5.0", "Content": "Phone calls are clear, reception is excellent, and wifi works great (I usually don't have a data plan, since when I'm away from buildings I generally only want to do phone calls, read books, or look up information in my databases.", "Date": "September 7, 2013"}, {"Title": "Good Phone, But One Camera issue after another", "Author": "Corey Y.", "ReviewID": "R3PXOPXP7S6A7S", "Overall": "2.0", "Content": "I like Google and everything they are adding, but too many camera issues. The camera is stuck in self portrait now. I have rebooted it, updated it and everything else. It will not scan bar codes and says there is no forward facing camera. I gave it a 3 stars at first and got more pissed off when I started typing.", "Date": "August 11, 2013"}, {"Title": "Great phone... when it's working", "Author": "Guillaume", "ReviewID": "R1P6GX0C78IRVY", "Overall": "1.0", "Content": "I love the design of the phone and the performances are great.However the infamous \"home\" button issue has completely ruined my experience and caused the phone to be unusable for most of the time. I had been in situations where I can not even terminate a call and end up being connected for many long minutes without been able to do anything about it.HTC sent me a replacement which is having the same issue. Think twice before buying this phone.", "Date": "September 17, 2012"}, {"Title": "Nice", "Author": "Jace K. Bybee \"J. Knight Bybee\"", "ReviewID": "R1A4H9F9Z06IN5", "Overall": "5.0", "Content": "I bought this for my wife, and for the most part she loves it. Fast & responsive, good picture quality (for her needs), and the audio is crisp & clean.", "Date": "November 9, 2012"}, {"Title": "Phone is ok..ok dont expect much", "Author": "Manish C.", "ReviewID": "R284ADZS79TBK8", "Overall": "2.0", "Content": "I expected a lot ftom this device but disappointed. I am experiencing following issues...Back cover is not at all fit..it is slow.battery life is not good..it is lasted only in 2/3 hours call...Internate surfing is to slow..took much time to launch any app compare to other device at the same price...Overall this is not a good buy and wont recommend to any one....", "Date": "December 18, 2013"}, {"Title": "malfunction", "Author": "djordje", "ReviewID": "R6A69L9YHLE7G", "Overall": "1.0", "Content": "The cellphone which I bought month and a half ago is already causing some problems. When you go online it disconnect's you by it's own... Sometimes when you are talking on the phone it turns off the call just end it. When it is locked stage in the phone it starts taking pictures more than 1 and don't wanna unlock sometime. Please tell me what to do,thank you in advance. And what is the policy on this matter??", "Date": "October 22, 2013"}, {"Title": "two bad elements", "Author": "Gabriel", "ReviewID": "REUBLS0KFABB0", "Overall": "3.0", "Content": "the headphones do not function, and the charger's cable dont plug ok, the phone is ok, but the manul that comes with, is not of this phone!", "Date": "October 13, 2013"}, {"Title": "Fragile. Not for Manly man", "Author": "D. Tan \"dantee\"", "ReviewID": "R37PHCB1TE2S9A", "Overall": "3.0", "Content": "Got this excellent android phone thru T-Mobile upgrade. Display Gorilla glass is scratch proof as claimed but is breakable even with a 3 feet drop to hard surfaces. So be extra cautious.", "Date": "April 5, 2013"}, {"Title": "Good phone, good seller!", "Author": "Denys", "ReviewID": "RADLL70L55513", "Overall": "5.0", "Content": "I like this phone, seller good and fast, but I did not use before smart-phones with beeg screens, may be i will train myself...Still no bugs described in Internet about One S software. This proportion between price and parameters is best, all competitors  has something - too high price ore no front camera, ore no glass on screen, ore main camera not so good...", "Date": "July 8, 2013"}, {"Title": "Used and damaged!!", "Author": "Juan", "ReviewID": "R1UTH6B9XTAXOJ", "Overall": "1.0", "Content": "I bought this product 20 days ago, expecting a brand new htc one s (didn't care if it was t-mobile or not, even if the picture shows a htc one s t-mobile) but what i got from these guys was a used one, on top of that, it's completely damage!! it won't start no matter what it's useless, now i have to wait till amazon return me my money so i can buy another one! THANKS!! Be warned that this could happen to you with them!", "Date": "October 29, 2013"}, {"Title": "Used and damaged!!", "Author": "Juan", "ReviewID": "R1UTH6B9XTAXOJ", "Overall": "1.0", "Content": "I bought this product 20 days ago, expecting a brand new htc one s (didn't care if it was t-mobile or not, even if the picture shows a htc one s t-mobile) but what i got from these guys was a used one, on top of that, it's completely damage!! it won't start no matter what it's useless, now i have to wait till amazon return me my money so i can buy another one! THANKS!! Be warned that this could happen to you with them!", "Date": "October 29, 2013"}, {"Title": "good product", "Author": "Cliveland Contreras", "ReviewID": "R2YXJVJR3GMK8G", "Overall": "5.0", "Content": "Excellent team, HTC works perfectly without details ... very grateful to the people of amazon and Liberty Express! to a next purchase", "Date": "July 5, 2013"}, {"Title": "not as described", "Author": "Jenn", "ReviewID": "R1CT5JSKILVS7H", "Overall": "2.0", "Content": "This is only a 3G phone and does not have beats audio as described. Couldn't return since I needed a replacement phone. OK phone for the price,  but definitely not what I thought I was buying. Aside from that , shipping was fast.", "Date": "May 4, 2013"}, {"Title": "This phone from abe-123", "Author": "Asmaa", "ReviewID": "R1FD6XHXEH67UB", "Overall": "1.0", "Content": "The phone is amazing but it wasn't unlocked phoneit was T mobile version and I will return itI was planing to use it but it is useless in my country Kuwait", "Date": "August 16, 2012"}, {"Title": "Review of the company, not the phone --FGS trading", "Author": "Jayjay", "ReviewID": "R3SMK4SK0CIVGF", "Overall": "1.0", "Content": "I had this HTC One S phone gradient blue from TMobile stolen from my purse after owning it for 6 mos. I LOVED that phone! So of course I tried to buy a replacement. No joy from TMobile as this model is discontinued due to the forthcoming HTC One. So off to trusty Amazon where I find the phone reasonably priced at FGS Trading --who promptly send me the WRONG phone! It is BLACK not blue. The gradient blue is a TMobile proprietary color which is what I specifically wanted so it would be guaranteed to work with my existing TMobile account. The description clearly states that I was ordering the blue gray phone.I may be able to edit this review if my return and refund are handled well by FGS Trading.", "Date": "April 17, 2013"}, {"Title": "not so good", "Author": "rocky yin", "ReviewID": "R26WHL4W6JXVP3", "Overall": "3.0", "Content": "a little old. a lot of marks on the back, i do not know why,but it can be good  used ,.", "Date": "July 9, 2012"}], "ProductInfo": {"Price": "$799.99", "Features": "Operating System: Android\nNetwork : 2G (E) Network inside USA and 3G in Europe/Asia\nFor GSM Carrier Only , accept Micro SIM card like T-Mobile , ATT....  (not for CDMA carrier Like Verizon , Sprint ,MetroPCS, PagePlus...Please check with your carrier before purchase.\nStorage Capacity: 16GB (available memory to use less due Pre-installed Apps and software).\nbox include : Phone , charger ,cable ,headset and manual papers.", "Name": "HTC One S 4g Android Phone Black Red 16gb with Beats Audio Unlocked GSM Android SmartPhone", "ImgURL": "http://ecx.images-amazon.com/images/I/41PeC9BZaXL._SX300_.jpg", "ProductID": "B0084H23CY"}}