{"Reviews": [{"Title": "This thing is pure 4GLTE regardless if you're prepaid or contract and the hidden configuration settings make it worth every cent", "Author": "Anonymous \"Anonymous\"", "ReviewID": "R1LMD2F12YGQO8", "Overall": "5.0", "Content": "It performs equally to contractual versions since Verizon doesn't differentiate from prepaid and full service subscribers.A neat trick about buying prepaid airtime, buy a WalMart GiftCard and buy Verizon Airtime from walmart online and whether you create an account or pay as a guest, USE AN OREGON BILLING ADDRESS THAT HAS NO SALES TAX AND YOUR AIRTIME CARD IS EMAILED FREE OF SHIPPING AND JUST FOR THE AMOUNT OF AIRCARD CREDITS.It has an adjustable XML config file that allows adding more than five connected devices, you can downpower the WiFi side to preserve a miniscule amount of battery but more importantly -control the broadcast radius of your hotspot.The XML is human readable with mainly boolean 0=no/1=yes values.The MicroUSB connector makes charging compatible with any Android charger and second gen blackberry plugs.", "Date": "December 27, 2013"}, {"Title": "HOT SPOT is ok", "Author": "martha", "ReviewID": "R2K83DRL5SPHXB", "Overall": "3.0", "Content": "The hot spot is ok for the price but to use as a pre paid device you must call Verizon wireless to get a sim card in order to use on verizons 4g service.", "Date": "March 5, 2014"}, {"Title": "An Excellent WiFi Unit", "Author": "Steve Lower", "ReviewID": "R39H2FQL2D5BFU", "Overall": "5.0", "Content": "The old wifi unit I had (Internet on the Go from Walmart) was very iffy, working well then slowing to a crawl. My daughter and son-in-law have a Verizon wifi, which is much faster. The price this Verizon Novatel wifi was offered at couldn't be beat, so I bought it and had it activated. It is super fast compared to my older wifi and has excellent signal strength, with no dropped connections like was happening with the Internet on the Go unit. And the monthly cost of operating the Verizon, while more than the Internet on the Go, is actually much more cost effective when you realize how many gigabytes you get and the excellent service you get from the unit. I'm very, very happy with this WiFi unit. Thank you Amazon!", "Date": "February 16, 2014"}, {"Title": "Works really well!", "Author": "Elizabeth F. McNally", "ReviewID": "R2S5PPOQZ7WYHW", "Overall": "4.0", "Content": "This product works very well, but you do have to hook it up through Verizon, I did get a pretty good deal in attaching it in with my plan.  I received it very quickly and it was well packaged.  I would recommend it to anyone who needs wifi service.", "Date": "May 5, 2014"}, {"Title": "It worked", "Author": "Casey", "ReviewID": "R2B4I8US2LGHHJ", "Overall": "5.0", "Content": "I was not sure if the device would work with my Verizon account.  It was easy to set up and one phone call to Verizon had everything on line.  No software to load and quick service.", "Date": "May 15, 2013"}, {"Title": "Trouble free hot spot", "Author": "Jennifer K", "ReviewID": "R1B3SZ7G7QJEKY", "Overall": "5.0", "Content": "I originally had this device for a few years before exchanging it for the 890L, a \"new and better\" hot spot.  I've had nothing but trouble with that version.  It stopped working.  Motorola send me a new one.  The new one stopped working.  I opted to go back to this one.  It is almost $200 cheaper and works beautifully.  You must have a Verizon SIM card that is the right size.  I just used one from an old phone.  I called Verizon to be sure this model would be recognized.  The Verizon store retailers work on commission and will sometimes lie and say you must buy a new one.  Not true.", "Date": "May 27, 2014"}, {"Title": "Doesn't work when plugged in", "Author": "AnarchyJim", "ReviewID": "R2UY9M2V9234J1", "Overall": "2.0", "Content": "Good modem, reasonably fast connection BUT if the battery runs out, it doesn't work plugged in. WTF. so, here I am in an airport with an outlet and no internet. as soon as I plug it in, the hotspot goes dark. Why in the world would you make a device that doesn't work when charging the battery? I thought it might be defective, but a quick google search reveals, nope... That's just the way it is. Unbelievable.", "Date": "April 23, 2014"}, {"Title": "Good when it works", "Author": "puppyluv \"mitsuli\"", "ReviewID": "R1E2X41QJ97ILY", "Overall": "3.0", "Content": "Not so good when it doesn't'.  it's an awesome little gadget when it works.  Does the job just great when it does at a a very reasonable price.  Connection can be iffy though.", "Date": "June 8, 2014"}, {"Title": "Great product awsome dealer", "Author": "Thomas", "ReviewID": "R1SJVSAZHNM0F1", "Overall": "5.0", "Content": "This was a replacement for one I broke, I pulled the USB port clean out with a faulty cord..  It providesd exactley the service I need for routine mobile access.", "Date": "May 12, 2014"}, {"Title": "Passe model", "Author": "W. Cottrill", "ReviewID": "R99B5CEJ5EUCU", "Overall": "2.0", "Content": "When the router was taken to the local Verizon store to make it work, I was informed that it was not a current model and therefore needed to purchase the latest version.  Wouldn't have purchased it if this fact was known.", "Date": "April 27, 2014"}, {"Title": "Irregular Internet use", "Author": "J M LEES", "ReviewID": "R351DF0U3GU06N", "Overall": "5.0", "Content": "Works just fine, having previously used a USB stick on Virgin(Sprint) where speeds were reduced over time. Monthly charge $90 for 10GB, seems high but suits the way we use our internet connection.", "Date": "April 20, 2014"}, {"Title": "Nervous about service but works just fine", "Author": "Todd T", "ReviewID": "RSX8WOZX1G56Y", "Overall": "4.0", "Content": "I bought this to replace a lost item. Verizon sells them, too, and was nervous about getting this one activated. No problem at all! Went to a local Verizon store where they gave me a new SIM card (required) and even activated it free of charge. Works just like my other one.", "Date": "March 31, 2014"}, {"Title": "Ehhh", "Author": "chelsea", "ReviewID": "R2OUA49G4AMFUF", "Overall": "1.0", "Content": "Wifi worked fine but Verizon charges WAY too much....I paid 60 dollars for 3 gigs NOT WORTH IT save your 40 dollars", "Date": "March 11, 2014"}], "ProductInfo": {"Price": "$269.99", "Features": "Brand\tNovatel Model\tMiFi 4510L MPN \t4510L\nWireless Technology\tWireless N Built in Modem\tNo Connectivity\tWireless\nHeight\t3.74 in. Width\t2.36 in. Depth\t0.53 in. Weight \t0.19 lb\nPlatform\tPC", "Name": "VERIZON NOVATEL 4G LTE MiFi 4510L MOBILE HOTSPOT WIRELESS N ROUTER (WITHOUT CONTRACT)", "ImgURL": "http://ecx.images-amazon.com/images/I/410QE1b-rAL._SX300_.jpg", "ProductID": "B008FEP0JY"}}