{"Reviews": [{"Title": "Chinese Configuration and Settings", "Author": "andrea bendeck", "ReviewID": "R1RHF4T10F2FB2", "Overall": "1.0", "Content": "1. There's no Google Play on my phone.2.I can't add a gmail account.3. There are a lot of apps installed in chinese. (I don't speak chinese)4. How can I download apps from Google Play?I have serious problems with the software, But the hardware is ok.5. I want my money back. :)", "Date": "April 17, 2013"}, {"Title": "Awesome", "Author": "Mohammad shahadat ullah", "ReviewID": "RS2RXTKYUKO34", "Overall": "5.0", "Content": "this one of the best phone that i have ever used. within this price you can not get a best phone like xperia. camera is good. touch is awesome.", "Date": "January 4, 2013"}, {"Title": "i love it", "Author": "RC", "ReviewID": "R3PFBA0KT13QUX", "Overall": "5.0", "Content": "It is not a high smart phone , but it has great specifications, it  has good display, great processor, dicent camera and adding to all it is a goo looking phone, i recommended", "Date": "December 28, 2012"}, {"Title": "Would have got 5 stars if it was not filled with bloatware from TIM", "Author": "The Architect", "ReviewID": "R2MR7XTVRECSU5", "Overall": "4.0", "Content": "The phone is great however it seems to be shipped with carrier bloatware from the carrier TIM. Bloatware takes up space and OS upgrades are dependent on TIM.", "Date": "January 15, 2013"}, {"Title": "GREAT PHONE, GREAT PRICE", "Author": "Cailitin", "ReviewID": "R1A3O4NWO4JJ7K", "Overall": "5.0", "Content": "This phone is one of the greatest between specs and price.It's like a mini Xperia S, and all it specs are very similar to SGS 2:Xperia UCPU Dual-core 1 GHz Cortex-A9GPU Mali-400MPSGS2CPU Dual-core 1.2 GHz Cortex-A9GPU Mali-400MPAND THE PRICE IS BETTER THAN THE SGS2", "Date": "October 2, 2012"}, {"Title": "problem with bands", "Author": "ARNOLDO", "ReviewID": "R1QT5WAWUJ6B00", "Overall": "3.0", "Content": "it is a phone good but i cannot use 3g with my operator it's a problem because 2g is low", "Date": "December 1, 2013"}, {"Title": "Chinese OS, unusable", "Author": "M. Juman \"Ninja Pirate\"", "ReviewID": "RJTKBENTIO5DI", "Overall": "1.0", "Content": "The OS is Chinese and while you CAN change the language to English easily..You CAN'T change the web browser or search engine or Google Play from the crappy Chinese version..This means it's insanely frustrating to use the browser and search engine.Google Play (chinese version which you can't change) is unusable, so you now have no apps which makes this phone strictly a call and text phone.It sucks.", "Date": "August 15, 2013"}, {"Title": "good product", "Author": "Thabang", "ReviewID": "R18UF9S0F4SX91", "Overall": "5.0", "Content": "I love it, its stylish, portable, big screen.. the smartest phone ever, I love the apps and the camera is so good", "Date": "April 29, 2013"}, {"Title": "Nice phone", "Author": "Candy", "ReviewID": "R2GCN4C2KHF5CS", "Overall": "3.0", "Content": "I like this phone since it has a good design and affordable price. The only problem with this phone so far is that it run battery really fast. Install the Battery Saver app for Adroid may help a little bit though", "Date": "January 23, 2013"}, {"Title": "muy bueno", "Author": "olimar", "ReviewID": "R1R38IJ7O9PBG0", "Overall": "5.0", "Content": "excelente resolucion de la camara, buen sonido, delgado y practico, muy bonito el celular, me gusta mucho el color bien delicado", "Date": "January 29, 2013"}, {"Title": "Branded phone!", "Author": "karl-heinz malsbenden", "ReviewID": "RP9JGQUKV2376", "Overall": "1.0", "Content": "The sony Xperia U st25i is great, but when you order this spicific phone you will get a branded one. From an italian provider named TIM. This means there are 20mb of TIM apps on the phone. And you have to wait for a TIM update in order to update the phone.(takes often a lot longer then the original update)", "Date": "November 15, 2012"}], "ProductInfo": {"Price": "$208.98", "Features": null, "Name": "Sony Xperia U St25i (White+ 1 Additional Bottom Cap): Brand New Unlocked GSM Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41wVCqtJuEL._SY300_.jpg", "ProductID": "B0087IMKPK"}}