{"Reviews": [{"Title": "Do not buy", "Author": "hannah", "ReviewID": "R2T4Z6Y3WEF0MD", "Overall": "1.0", "Content": "Phone arrived on time but after an hour out of the box was stuck in dock mode turned it off for the night as not to want to worry about it then in the morning I go to plug it in and it doesn't turn on. Will be returning and buying from someone else.", "Date": "March 1, 2014"}, {"Title": "great phone!", "Author": "jamie", "ReviewID": "R1PSVRXSS332OL", "Overall": "5.0", "Content": "It looks and acts like a brand new phone, i love it! The battery life on this is pretty good too, i am able to only charge it every other day, only if im not on it all day, standby time is awesome! i highly recommend!", "Date": "June 3, 2014"}, {"Title": "Great phone really", "Author": "Eduardo Mariano", "ReviewID": "R9LA5ENU3ZQ6I", "Overall": "5.0", "Content": "The phone has a great screen, excellent sound, the battery life is much better than other teams, the camera can shoot good photos.", "Date": "May 27, 2014"}, {"Title": "Great Phone, I didn't know what I was missing of using android", "Author": "Mario Canelon", "ReviewID": "R3JJC1DOSPCAL1", "Overall": "5.0", "Content": "Great Phone, I didn't know what I was missing of using android instead of Blackberry excellent product Buy It for sure.", "Date": "April 29, 2014"}, {"Title": "best phone ever", "Author": "mom12", "ReviewID": "R2OR1Q85Y2YS56", "Overall": "5.0", "Content": "This phone is great.  The screen gives a great, clear picture. the audio is clear and loud and feels as if you were in a movie almost. the camera takes wonderful pictures, as sharp as any $200 camera would do. not to mention all of the apps and other many conveniences such as just being pretty much everything you can want in a little device that you can take with you to the store, to exercise, to run errands, get directions, Skype, etc...It's light, it fits in my hand, it's easy to set up. the only thing that's a little disappointing is the battery life. for a phone that can do everything, it doesn't last long once you start doing everything on it.This seller seems reputable as the phone they sent me looks exactly as pictured and is exactly as described. it was unlocked and worked.", "Date": "March 11, 2014"}, {"Title": "IGUAL QUE EL SAMSUNG GALAXY S3 X u$s100.MENOS", "Author": "PINGUI", "ReviewID": "R2TEHCRMI3NUAA", "Overall": "4.0", "Content": "HOLA, Si como pude comprobarlo despues de Un mes de USO.-Ambos equipos son similares...... a saber: HTC ONE X - a)Mejor Agarre el Formato se presta para ser sostenido en la mano.-  b) El display es más práctico y Ya Característico de HTC.-  c) Es más consistente la carcaza...Y en general por su diseño  Desventaja.....NO POSEE MICRO SD.....! Bat- 1900  SAMSUNG GALAXY S3: a) POSEE MEJOR COLORIDO Y MÁS posibilidades de Opciones -Aunque con Todo Brillo y cuando Hay SOL....No es fácil ver la pantalla...!  b) Pantalla un poquito más grande-Boton Home mecánico-y Bat- con más capacidad 2.100  c) Más acc- en el mercado (Ya se parece al Iphone)  PERO- DESVENTAJA DE PRODUCCIÓN EN MAZA.- Rechacé uno por ERROR EN LA CÁMARA  GRACIAS  CARLOS DE USHUAIAHi, yes as I check after a month of Use-Both teams are similar ......  namely HTC ONE X - a) grip the format lends itself to be held in the hand. -  b) The display is more practical and already characteristic of HTC. -  c) the housing is more consistent ... And in general by design  Disadvantage ..... NOT HAVE MICRO SD .....! Bat-1900  SAMSUNG GALAXY S3: a) has better chances of colorful and options-though with all brightness and when the sun .... It is easy to see the screen ...!  b) slightly larger screen, Home Button Bat-mechanical, with over 2100 capacity  c) More acc-market (already resembles the iPhone)  -DISADVANTAGE BUT PRODUCTION HUB. - I rejected one camera error  THANKS  CARLOS DE USHUAIA", "Date": "September 4, 2012"}], "ProductInfo": {"Price": "$260.00", "Features": "htc touch sense 4\nhtc wifi gps bluetooth international version\n8 mega pixel hd video camera\nAndroid 4.0 ice cream sandwich\nNew htc one x Grey Black", "Name": "New HTC One X Android 4.0 Ice Cream Sandwich Os with Beats Audio System 16gb Memory 1.5ghz Processor 8 Mega Pixel Camera Hd Video Capturing At&t GSM Wifi GPS Bluetooth Smartphone Color : Grey / Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51GdWPBFykL._SY300_.jpg", "ProductID": "B008OPOED2"}}