{"Reviews": [{"Title": "good phone with (possibly annoying) permanent facebook screen", "Author": "RH", "ReviewID": "R2WZL3MX36USL3", "Overall": "2.0", "Content": "The Motorola MotoKey EX117 3-chip cellular phone is in fact triple-SIM triple-standby and works as well as the KimFly K9300 I imported from DHgate, China, two years ago and with which I am still satisfied. However, a facebook screen occupies invariably the lower half of the MotoKey EX117's screen and also covers the lower half of whatever screen background one may choose; this may be annoying for non-facebookers at least. The facebook screen cannot be eliminated, deactivated nor put \"behind\" the screen background, according to Motorola Canada and US. This has motivated Motorola Brazil (the phone seems to have been mostly marketed in that country) to offer a firmware (phone operating software) update which takes the facebook screen away, but unfortunately this update does not work with MotoKey EX117 purchased outside Brazil. The Amazon Marketplace seller of the phone, UnlockedCellPhoneKings in Miami FL, confirmed that the facebook screen cannot be taken away from the display ; I could return the phone and got a full refund.", "Date": "October 27, 2012"}, {"Title": "3 SIMS is awesome", "Author": "S. Peters \"kingstu\"", "ReviewID": "R2AWEPB5HDT95C", "Overall": "5.0", "Content": "I was impressed by this triple-sim device because although being a basic phone, it has the basic features implemented very well. The device implements the SIM application toolkit and the USSD flawlessly. There might be a few other triple-sim qwerty devices but from no-name manufacturers. The only thing I didn't like about it is something many people would like--a dedicated facebook key. It has facebook status and information on the homescreen. I haven't found a way to disable it.The battery life on standby is very good but the battery is small. I didn't use a constant data connection because I would mainly use it for text and calls. The keyboard is adequate and I haven't had many problems with it. The user manual is very small and doesn't have a lot of detail, but I would assume it's menu structure and settings are similar to other Motorola basic phones.There is a camera but I haven't used it and wouldn't expect it to be high quality. There is an expansion slot for micro-SD so you can also use it as a basic music player. The FM radio is nice and it allows you to record what you hear (a headset is required for antenna.)If you don't know why you would need a triple-SIM phone then don't get this phone. There are many dual-sim phones and even dual-sim smartphones out there. If you do a lot of texting and calling and you want to be able to select between 3 SIMs then this is the device.", "Date": "October 23, 2012"}, {"Title": "Buen telefono", "Author": "Moicam.", "ReviewID": "RYW2HS1BRPR1U", "Overall": "4.0", "Content": "El telefono es muy practico... pequeño y ligero..buena presentación... un menu sencillo.. está desbloqueado... le coloque mi sim card movilnet y funcionó muy bien...recomiendo al vendedor..!", "Date": "January 31, 2013"}, {"Title": "I like it", "Author": "Jorge Ivan Bustamante Fong", "ReviewID": "R16401U3JJLCOS", "Overall": "4.0", "Content": "great article if you don't need a smartphone is easy to use and the sim cards works very good,  is annoying the facebook in the screen but doesn't matter the phone is great", "Date": "February 19, 2013"}, {"Title": "I love this phone!", "Author": "Vegas Lotus \"www.GoddessVega.com\"", "ReviewID": "R3DJAI0LGRHMDS", "Overall": "5.0", "Content": "All 3 SIM cards worked just fine as soon I inserted them in, no activation by AT&T; was needed.I'm not using the Facebook right now, but may start doing it soon, so the Facebook button will be handy.This phone has better & more stable connection and louder/clearer sound than my previous Anycool dual SIM card phone from China.Numbers and symbols on the keypad are somewhat hard to see, need to put reading glasses on.Takes good quality pictures and videos, although the main reason I got this phone is using it with my 3 SIM cards.", "Date": "December 8, 2012"}, {"Title": "Small but with more options", "Author": "Daniel Mwakasungula", "ReviewID": "R2GVDZCVLZLANW", "Overall": "4.0", "Content": "The phone met my expectation of subscribing to 3 mobile phone service providers. However, I did not like the facebook logo on the phone and and I could not remove it from the screen.", "Date": "December 4, 2012"}], "ProductInfo": {"Price": "$149.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nGSM Quad Band 2G 850 / 900 / 1800 / 1900 - SIM 1, SIM 2 & SIM 3\nTriple SIM; Dedicated Facebook Button; 2 MP Camera; MP3/MP4 Player\nFull QWERTY Keyboard; microSD card slot for expandable memory up to 32 GB\nTFT/Color Display; SMS, MMS, Email, IM; Stereo FM radio; WAP 2.0/xHTML Browser", "Name": "Motorola MOTOKEY EX117 3-Chip Unlocked GSM Phone with QWERTY Keypad, 2 MP Camera, Dedicated Facebook Button and microSD Slot - Brown/Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51Y3sKrzLAL._SY300_.jpg", "ProductID": "B008HQRSKY"}}