{"Reviews": [{"Title": "The product description is meant to deceive the consumers", "Author": "Bowen Zhao", "ReviewID": "R3B920JW4HDCVD", "Overall": "2.0", "Content": "I received the phones from the seller \" Open Group Wireless\" a few days ago and found out the seller intend to deceive the consumers by saying this phone is \"I8160bk\". There are three versions of this Galaxy Ace 2 cellphone: I8160, I8160P, I8160L.The actual product this seller sent out is the \"I8160L\" version, which is the \"Thailand\" version. This version can't be upgraded to Android system 4.1.2.I definitely don't recommend this seller \"Open Group Wireless\".", "Date": "May 24, 2013"}, {"Title": "It is what I expected", "Author": "Ray_CcsVen", "ReviewID": "R2MKLGG3CQEAAS", "Overall": "5.0", "Content": "An important specification to consider before buying this item is to make sure that the 3G operating band is the desired for the service area or country, there are two versions for this phone, the i8160 for 3G in 900 / 2100 and the i8160L for 3G in 850 / 1900.", "Date": "July 7, 2013"}, {"Title": "It CAN be upgraded to 4.1.2 via Kies but you DO NOT want to!", "Author": "Aka", "ReviewID": "R14N75T9GFFCBZ", "Overall": "5.0", "Content": "I read Bowen Zhao review, and he's wrong... Actually I own an I8160L and I upgraded it to 4.1.2 via Kies. However I had to roll it back to Gingerbread... believe me you DO NOT want Jelly Bean on your phone, it turns it too sluggish and it constantly gives you tons of errors and you have to keep restarting it! With Jelly Bean on this phone just trying to make a phone call or send a message is a nightmare! This phone has not enough memory/processor for Android 4.1.2He must be glad he could not upgrade it, rolling it back is kind of complicated.This phone is GREAT just the way it is, with Gingerbread!!!", "Date": "December 10, 2013"}, {"Title": "Very Good phone so far", "Author": "Sophia", "ReviewID": "R2OKCJ6HNG5935", "Overall": "5.0", "Content": "It is as I expected. Only have it for 3 days so far and all is well. My first smartphone. I'm recommending it to friends. Still have a lot to learn about this phone", "Date": "August 4, 2013"}, {"Title": "Review", "Author": "Monica B.", "ReviewID": "R260BOX1QMB2ZJ", "Overall": "5.0", "Content": "This phone is amazing, which I had bought it long time ago.  I am recommending it to all my friends and relatives", "Date": "July 10, 2013"}, {"Title": "Samsung Galaxy Ace 2", "Author": "Trini", "ReviewID": "R37DN1MHXT64QD", "Overall": "5.0", "Content": "Samsung Galaxy Ace 2.....this one GREAT PHONE for the value, it is really fantastic and great size. With heavy usage like i do you will get about 8 hrs on the battery. Use the power save feature and you will get more.", "Date": "May 28, 2013"}, {"Title": "EXCELLENT", "Author": "VE377028 Lilcheidan", "ReviewID": "R2VL099NFCNWV9", "Overall": "5.0", "Content": "excellent quality product certainly at an affordable price and with exceptional features full super, super practical... definitely a great phone", "Date": "July 9, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008TN8778"}}