{"Reviews": [{"Title": "Great phone, poor instructions", "Author": "chubtor", "ReviewID": "R30M2D6CKW5JBM", "Overall": "5.0", "Content": "I did a lot of research before buying this phone, I needed something that was smaller than the 5\" Note and bigger than the standard 3.5\" phones plus I needed a dual SIM phone that was unlocked so that I could use it my pre-owned ATT and Vodaphone SIMs. I wanted decent front and rear cameras and a phone operating with Bluetooth and Android 4. My sole hesitancy before pushing the \"buy\" button was when I saw the delivery promise of several weeks.I need not have worried as delivery from Hong Kong to the USA was 10 days. The phone was well packed and arrived with both batteries charged to around 75%. The phone started first time, recognised both SIMs immediately and connected easily to my WiFi. However unless you have some experience with Android 4 you may have difficulty in using all the features as the booklet that is supplied is totally useless. It tells what features the phone has and what most of the symbols mean but that is about all.If you have never unlocked an Android screen before you will be baffled about what to do to get into the various operating screens.I use Hotmail for my main email and the phone picked up incoming mail readily but it took several days of Google searches and lots of trial and error before I could get the outgoing email server to work. Gmail was fine though and was automatically picked up once the username and password were entered.Phone calls are clear and loud although I have yet to find out how to get the speakerphone to work. The AMOLED screen is exceptionally clear and bright and readable even in strongish sunlight.The fm radio works fine and camera pictures are sharp, I have added a 16Gb micro SD card for extra storage. Accessing this via a pc and usb allows me to add lots of music, pictures and videos but I cannot find many apps that can be transferred to the micro SD card.One minor problem I forgot to mention at the beginning is that inserting the phone SIMs reqires that you push down vertically on them as you insert them into the slot. For a while I was convinced that my standard size SIMs were too big, it took an ATT rep to show me the error of my ways.I have had the phone just over a week now and I am still convinced I did right by buying it, especially as I got it for just over $100 by agreeing to have a Chase/Amazon credit card.", "Date": "November 16, 2012"}, {"Title": "Great phone", "Author": "Gary", "ReviewID": "R1L3V2Q9D52O96", "Overall": "4.0", "Content": "I'm re-writing my entire review.  Great looking and functioning phone.  Horrible instructions, it took a long time to figure out things like changing the ringtone, as the settings menu doesn't match what I found on the web for this version of Android.  It doesn't allow the Chinese character set to be turned of, and the \"help\" when typing a search defaults to Chinese so you have to manually switch it to English every time.If it weren't for those issues I would have given the phone 5 stars.", "Date": "January 5, 2013"}, {"Title": "Surprisingly pretty good", "Author": "Sandra", "ReviewID": "R4FMPAJQV40TX", "Overall": "5.0", "Content": "This is a very well made phone I actually really like it it has. A lot to offer and it looks so pretty... Although one thing for some reason it doesn't send nor receive pictures very well..", "Date": "March 25, 2013"}, {"Title": "Batteries Batteries, Batteries!", "Author": "Caribbean Queen", "ReviewID": "R22DX18HUW97U8", "Overall": "2.0", "Content": "The phone itself is fine but the batteries (yes both of them) take too long to charge completely - about half a day-  and then they both last just a few hours. This is FRUSTRATING!! And don't even think about trying to buy new batteries.  I was told to Google the battery Standards and Type (located on the battery) to see if I can locate a replacement battery to buy, which, by the way I have not found because of course the phone is not an OEM product. I advise against buying this (save yourself the stress) but if you must get it make sure you get solid information about where to purchase essential replacements if the need arises.", "Date": "February 11, 2013"}, {"Title": "I love it", "Author": "Bryan", "ReviewID": "R3584KT6VRHIWA", "Overall": "5.0", "Content": "The smartphone fits and meets all my needs, but it is difficult to customize with skin, shields, etc.. In short it is a good product, better than I expected. The only bad thing is the instructions, which are difficult to understand and the headphones that are a little uncomfortable.", "Date": "December 19, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "N800 MTK6575 Android 4.0.3 3G Smartphone GSM+WCDMA Dual Standby Quad Band with 4.3 Screen and GPS (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51jalGQ8arL._SY300_.jpg", "ProductID": "B008ZYT2IE"}}