{"Reviews": [{"Title": "Finally..... a decent dual sim phone!!", "Author": "Lionel B.", "ReviewID": "R1B5K35WCMA0GZ", "Overall": "5.0", "Content": "This dual sim is an upgrade to its cousin the Samsung Galaxy Y Duos S6102 Android Dual SIM Quadband Unlocked.Pros:- Dual sim works flawlessly. The Samsung software to manage the sim cards is very easy to master. By pulling down the top curtain you can easily switch which sim is the primarily and thereby choose which sim to call/text from. Also, from the sim setting you can quickly decide which sim should be used for data or turn off the data completely.- Excellent for frequent travelers that need to handle multiple sims cards without the burden of multiple phones. Also works well for those that want to separate work and private lines without having to carry two phones.- Android 2.3 Gingerbread (have not heard of any update to ICS 4.x)- Full functioning Google play market for apps.- SD slot that takes up to 32 gb (I am using it with 16gb)- Wifi and bluetooth 3.0- Very good battery life. The phone will easily take you through the day with average use.Neutral:- Okay specs for a budget dual sim phone. It's single core and has 832MHz CPU; 512 MB System memory and 3.5MP Camera- 3.5\" size screen (this the minimum I feel that any smart phone should have in order to browse and read easily).- Okay screen resolution 320 x 480 Pixels and 165 ppi pixel density. Screen is responsive to scrolling.- Good call quality.Cons:- No front-facing camera for video conferencing- No camera flash (but camera has Auto focus and Smile detection)- No support for Adobe Flash- No Mobile hotspotOverall, a decent mid-range dual sim android phone by a reputable company for under $250. There is a slight but useful upgrade to the Galaxy Y Duos mostly in the display. Whether this improvement is worth $100 extra over the SG Y Duos will depend on the value you place on having a slightly larger screen (3.15\" vs 3.5\") with better pixel density.NB:- I bought my phone here on Amazon for $232.99 from HassleFreeCell on August 27, 2012. I had no issues with my shopping experience.- Although the product description above lists 3G Network HSDPA as 850/1900, be aware that sellers get their phones from different markets. So check with your sellers before buying to avoid surprises.", "Date": "September 6, 2012"}, {"Title": "Small number of language packs", "Author": "Martin Gelter", "ReviewID": "RKKCMFU5WEHL0", "Overall": "4.0", "Content": "By and large, I am happy with this item. However, the phone only comes with four language packs, namely English, Spanish, Portuguese and Korean. I need some other languages and have so far not been able to find an offical download site . This infomation ought to be disclosed to potential buyers.", "Date": "September 30, 2012"}, {"Title": "Duos rip off", "Author": "Mark", "ReviewID": "R2BWTETIS3L575", "Overall": "1.0", "Content": "Brought this phone from breed was meant to be new -Lies it came with someone else's pictures on it and it is a piece of junk, Screen continually goes to white screen and you have to restart it can not even call out on it , keep a way from this phone and Breed , no wonder there's no warranty", "Date": "November 17, 2013"}, {"Title": "Very frustrated with this faulty device", "Author": "Vivek M Agrawal", "ReviewID": "REB3Y740GITZ5", "Overall": "1.0", "Content": "This device came in an open box but I did not mind that. After charging it overnight and using it next day, the phone kept hanging and would suddenly shut down. Installed all updates for the softwares, and ran system cleanups but the issue persisted until I finally decided to return this.The wifi will drain battery very fast (within couple of hours) and the phone kept getting off without any reasons. The dispaly will get off by itself and there is no response until to attach the power cable back.Very frustrated with this product and returining it.", "Date": "April 16, 2013"}, {"Title": "Eh eh", "Author": "Candy Cane", "ReviewID": "R3U7ZCEHXUUDCX", "Overall": "3.0", "Content": "Small and difficult to type or text, but the smallness was also a positive...depending on what you like.  Navigation never worked, it  just read \"loading\" forever.  The dual sim feature worked fine.  Call quality was adequate.  Internal memory seemed to be an issue as apps were slow to open, run, etc.It is a sleek looking phone and not bad quality.  I was looking for something slightly larger and more functional, especially with the GPS.  For the price, unimpressive.", "Date": "February 17, 2013"}, {"Title": "Awesome phone", "Author": "Audrey", "ReviewID": "R3D2D9TZHTM03V", "Overall": "5.0", "Content": "I totally loved it . I bought for my mom so that she can use it outside the US and it perfectly works. She s loving it .", "Date": "December 16, 2012"}, {"Title": "Could have been a better phone if it wasn't the internet problem", "Author": "Andris Dormeus", "ReviewID": "R32OPUZGZLYQNM", "Overall": "1.0", "Content": "I purchased this item for my wife, upon receit of it, I input her sim card into the phone thinking everything would be fine,infact everything worked except for the internet.Know matter what I did I could not get the internet to work.So take that into consideration before buying.", "Date": "March 25, 2013"}, {"Title": "Seems to be perfect", "Author": "Nicolas Villoria", "ReviewID": "R1637LMHBS7HWW", "Overall": "5.0", "Content": "The delivery was in a perfect time and condition. Good seller. The item was that was promised. I hope when i give it as a gift in a month it work as well as today!", "Date": "September 30, 2012"}, {"Title": "PERFECT", "Author": "humberto Aleman", "ReviewID": "R15IZGWZEXPPLF", "Overall": "5.0", "Content": "Im happy with this, unfortunatelly I lost in a Supermarket, very reliable and functional, hope buy a next one, perfect phone", "Date": "April 8, 2014"}, {"Title": "Review", "Author": "Anthony K. Dotse", "ReviewID": "R2V3X45YA90TTS", "Overall": "5.0", "Content": "I have used this GSM International Unlocked Smartphone as a replacement for another BlackBerry and I loved it.  It is great!", "Date": "February 17, 2014"}, {"Title": "Excelent Amazing Phone", "Author": "juan carlos", "ReviewID": "RGZ5VWYEBF3WE", "Overall": "5.0", "Content": "Excelent, the device is great, runs fast, the battery is durable enought, has everything one could wish for a Cell, the relationship PRICE-VALUE is excellent ..I recommend it 100%", "Date": "October 10, 2013"}, {"Title": "Great buy!", "Author": "Tatiana Molina", "ReviewID": "R73HESVTBI1BW", "Overall": "5.0", "Content": "This telephone was for my sister in law and she is very pleased with it. We are in Venezuela and the telephone works perfect.", "Date": "October 2, 2013"}, {"Title": "love it", "Author": "R. Mclennon", "ReviewID": "RMTDPF6VPWDEZ", "Overall": "5.0", "Content": "this phone works great, ONLY draw back is that the  keypad letters are small but  besides that its a  great  great  phone", "Date": "September 15, 2013"}, {"Title": "THEY LOVED IT!", "Author": "Bee305 \"Bee305\"", "ReviewID": "R3VZ4CXGEV9JWY", "Overall": "4.0", "Content": "WE BOUGHT IT AS A GIFT AND THEY LOVED IT!  WE WOULD BUY IT AGAIN. AWESOME PHONE. IT LOOKS GREAT IN WHITE.", "Date": "August 13, 2013"}, {"Title": "Good except few issues in usabilities", "Author": "VIJAY JOHN BRITTO", "ReviewID": "R3EZ4CACTV3RL3", "Overall": "3.0", "Content": "Good except few issues in usability to unlock the screen , ending the call, switch on the phone display .", "Date": "August 5, 2013"}, {"Title": "Ok", "Author": "Cynthia Bennett", "ReviewID": "R17R8BHE5KEZ0S", "Overall": "3.0", "Content": "Good phone, didn't realize that it's not a t-mobile phone.  I had problems with pictures being sent via e-mail.  T-mobile team worked real hard to help me get through.", "Date": "June 7, 2013"}, {"Title": "it could be better...", "Author": "dania", "ReviewID": "R1L2SXKS8R2I95", "Overall": "3.0", "Content": "The phone is good, like the dual sim option. It's a good size for a good price. could be better. the cellphone sometimes it shuts down unexplectadly and don't have flash.", "Date": "May 1, 2013"}, {"Title": "excelente a mi esposa le encanto  excellent my wife loved this gift", "Author": "junis", "ReviewID": "R22Q4SK23I5E32", "Overall": "5.0", "Content": "excelente a mi esposa le encanto este regalo.excellent my wife loved this giftlo recomiendo ampliamente a todos . saludos", "Date": "April 3, 2013"}, {"Title": "Great!!!!", "Author": "Service member", "ReviewID": "R1J5ZE53Q15YA6", "Overall": "5.0", "Content": "This product can on time and was packet nicely. I have to admit the quality of the phone is very nice. I recommend this product if you like good quality products.", "Date": "March 10, 2013"}, {"Title": "Functional and beautiful", "Author": "Paula Renata Cerdeira Gomez", "ReviewID": "R1N1D2MXUWDZQ9", "Overall": "4.0", "Content": "A very nice looking phone, very functional. Especially google apps work really well. Has some limitations in multiple email accounts.", "Date": "March 3, 2013"}, {"Title": "very good phone and high technology,", "Author": "manuel", "ReviewID": "RAOO3JBPC6NKR", "Overall": "5.0", "Content": "Samsung has been producing lately a good range of phones and this I like to have dual sims its a great product", "Date": "February 24, 2013"}, {"Title": "its ideal", "Author": "Mary Awuku", "ReviewID": "R32R696JYPY1VA", "Overall": "4.0", "Content": "its terrific, easy to use, not heavy, very nice, neat presentable has fast internet services n all it takes  for a gud phone", "Date": "February 19, 2013"}, {"Title": "Love my new phone", "Author": "Sherine Barnes", "ReviewID": "RDCMQV5VBF3NF", "Overall": "5.0", "Content": "Very excited to have a dual sim smart phone. The size is perfect, plenty apps. Love the GPS. It also works well as a music player. Great product overall.", "Date": "December 17, 2012"}, {"Title": "Great Cell for the price !", "Author": "DiegoL", "ReviewID": "R37FWNL5SXOR0O", "Overall": "4.0", "Content": "If you are with the idea of buying a double SIM phone, undoubtely this is one of the best option.The only thing that is missing, in comparison with other cells, is the flash of the  camera.But I am really happy with this phone. The main advantages:- Very easy to use- The quality (5Mp) of the camera is very good.- Is a Samsung, Android. Fast", "Date": "December 7, 2012"}, {"Title": "Very good unlocked phone", "Author": "topcat", "ReviewID": "R2V0HPJFCTJ9RF", "Overall": "4.0", "Content": "The Ace Duos worked very well on a three week trip in Asia. We only used one Sim card but for our travel it was sufficient. The only problem is that the ringer/notification volume is a little low and on max volume, we missed a couple of messages.", "Date": "December 4, 2012"}, {"Title": "Great! Good size and functionallities. II have also another Galaxy ace but some applys don't work in both of them.", "Author": "Katia", "ReviewID": "RV6BZ5QT29OZW", "Overall": "4.0", "Content": "Great! Good size and functionallities. II have also another Galaxy ace but some applys don't work in both of them.", "Date": "November 17, 2012"}, {"Title": "not a very good product", "Author": "hsoni87", "ReviewID": "R24NDUF0501MG", "Overall": "3.0", "Content": "it has a low quality on touch basis...dual sim works fine...looks are good...overall an OK product in this range", "Date": "November 16, 2012"}, {"Title": "Great product", "Author": "amazing", "ReviewID": "R3OZ64J3848SUY", "Overall": "5.0", "Content": "I love this one, it works good so far!I had a problem with input language in Chinese, but I download app. from Samsung, it's good now.", "Date": "November 7, 2012"}, {"Title": "Maria", "Author": "Maria alejandra lopez", "ReviewID": "R1FJ4ZKC7AQJ63", "Overall": "5.0", "Content": "Excelente vendedor, muy útil y en perfectas condiciones el teléfono llego sin problema en la fecha indicada gracias por la atencion", "Date": "February 28, 2013"}, {"Title": "Replacing the S6102", "Author": "Gordinho", "ReviewID": "R1X7FWY6G53DLM", "Overall": "4.0", "Content": "I bought this cell phone to replace my not so old S6102 ....I thought this was going to be better , actually I didn't read the fine lines ...and the operating system is Gingerbread 2.3 - so not so new !!But it is an Android phone ... and dual sim card ! Works very nice !", "Date": "October 3, 2012"}, {"Title": "CELL NO TEAM HAS COME TO MY HANDS, SO I CAN NOT ISSUE OPINION ON ITS OPERATION, WHEN MY POWER IN DARE COMMENT ABOUT IT", "Author": "Olivia Mora", "ReviewID": "R4M1C9QGTRAHP", "Overall": "1.0", "Content": "CELL NO TEAM HAS COME TO MY HANDS, SO I CAN NOT ISSUE OPINION ON ITS OPERATION, WHEN MY POWER IN DARE COMMENT ABOUT IT", "Date": "December 2, 2013"}, {"Title": "Flawless international use and the perfect size", "Author": "Kahlyn Keilty-Lucas", "ReviewID": "R3S6R7HCNPV87H", "Overall": "5.0", "Content": "I have owned this phone for almost a month now, and have yet to have any problem. My biggest concern going into the purchase was weather it would work in Spain where I reside, yet i only had to put in the sim card and I could carry on with my business with no issues.I am also very satisfied with the size and how nicely it fits into my palm. Unlike other smart phones I looked at I can even carry it comfortably in my pocket.", "Date": "September 6, 2013"}, {"Title": "Malfunctioning hardware", "Author": "pius mark", "ReviewID": "R35AXJGS0KOKQD", "Overall": "3.0", "Content": "the phone is a compact dual sim smart phone, good for the price. However, at times it would shut down unexpectedly, and would need to be powered back on, this can be frustrating. The battery also runs down quickly, and needs to be recharged every 24 hours or less, resulting in the charger to be available at all times.", "Date": "June 10, 2013"}, {"Title": "Excellent", "Author": "Pedro Lopes", "ReviewID": "RBRTUI7AEZYDJ", "Overall": "5.0", "Content": "As always, since one would expect the quality of handsets from Samsung.Great quality, android working perfectly, it was just plug and insert the chip, which has recognized the city, temperature, and everything else ... I recommend buying, and I know you will not regret it.", "Date": "May 21, 2013"}, {"Title": "Problem with Instagram", "Author": "Denise", "ReviewID": "R33M9W0J77YNXJ", "Overall": "3.0", "Content": "Hi all!I had a problem with the app Instagram. When I try to edit photos from gallery or camera, it just appears a black screem. I have already looked for a solution, and the problem is with the camera of Galaxy Ace Duos. Practcally everybody who bought this model of mobile phone had the same problem!I'm really disappointed with it!", "Date": "November 6, 2012"}], "ProductInfo": {"Price": "$399.99", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 2100 Mhz", "Name": "Samsung Galaxy Ace Duos S6802 - Factory Unlocked, Dual SIM, Android Smartphone - International Version, No Warranty (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51PpaJ0pWUL._SY300_.jpg", "ProductID": "B008GX64JY"}}