{"Reviews": [{"Title": "\"Excellent Phone\"", "Author": "Ananth", "ReviewID": "R2RLLBAPL4I7QU", "Overall": "5.0", "Content": "Great phone and I purchased three of these. very smooth operation, touch controls are smooth..... simple and handy (not big).... it is unlocked and works fine for me", "Date": "October 30, 2012"}, {"Title": "very good product", "Author": "Jesús salvador pino ferrer", "ReviewID": "REI7UQM83JO1C", "Overall": "5.0", "Content": "thank you very much the product is brand new, very good very careful attention is everything I wanted the product. I am satisfied with the service of wrapping and sending thank you, I look forward to shopping with you in the future thanks", "Date": "June 11, 2013"}, {"Title": "It is a very bad and worthless phone as it did not last more than few weeks.", "Author": "Debabrata Panja", "ReviewID": "R3OGYOI9EM64DS", "Overall": "1.0", "Content": "This phone is very bad in quality as it does not recognize SIM card any longer after just few weeks of functioning.", "Date": "April 19, 2013"}, {"Title": "This is a good product.", "Author": "lalitlodhi", "ReviewID": "R2Y3FVXY3WHVJH", "Overall": "5.0", "Content": "Good Features, good quality, in good competitive rates, sound quality is as expected from sony, it is a good deal.", "Date": "April 16, 2013"}, {"Title": "Relacíon Precio Beneficio Excelente", "Author": "Jose Gregorio Rojas", "ReviewID": "R518VWTQDF6O0", "Overall": "5.0", "Content": "Teléfono el cual al precio que se encuentra tiene muchas facilidades para los usos requeridos por mi persona. Buena Adquicisión", "Date": "March 9, 2013"}, {"Title": "muy bueno", "Author": "Juan", "ReviewID": "R1AVR008X414MS", "Overall": "5.0", "Content": "excelente teléfono 100% recomendado, super rápido con todas las opciones necesarias para el uso diario, la música suena genial en pocas palabras gran producto.", "Date": "March 2, 2013"}, {"Title": "good price for unlocked name brand phone.", "Author": "sdg", "ReviewID": "R2AI6FHY8ONLH6", "Overall": "3.0", "Content": "I was really excited to receive this phone. It's the perfect size- 4\" screen. I love the look of the 4.0 android OS. The phone quality though could be better. I previously had a Motorolla Milestone. The phone quality was better than the Iphone, all metal casing but it's Android 2.1 was ridiculous. Made the phone worthless. I endured it for a year and finally bought this one. Unfortunately the 4 buttons at the bottom are really flimsy. It feels like they won't work for long. The screen response when web browsing is annoying. When playing Angry Birds Star Wars, it keeps going back to pause while playing. Some pre-installed apps crash when opened. Fortunately the phone itself hasn't crashed yet. Is it better than the Motorolla Milestone I was previously using? Yes. Is this the Iphone killer? Absolutely not but it could easily have been if the hardware was of better quality and the screen had better response.", "Date": "November 25, 2012"}], "ProductInfo": {"Price": "$199.99", "Features": "2G Network\tGSM 850 / 900 / 1800 / 1900 3G Network\tHSDPA 900 / 2100\nDISPLAY\tType\tLED-backlit LCD, capacitive touchscreen, 16M colors Size\t480 x 854 pixels, 4.0 inches (~245 ppi pixel density) Multitouch\tYes, up to 4 fingers  \t- Timescape UI\nHSDPA, 7.2 Mbps; HSUPA, 5.76 Mbps WLAN\tWi-Fi 802.11 b/g/n, DLNA, Wi-Fi hotspot Bluetooth\tYes, v2.1 with A2DP, EDR USB\tYes, microUSB v2.0\nCAMERA\tPrimary\t5 MP, 2592х1944 pixels, autofocus, LED flash Features\tVideo calling, touch focus, geo-tagging Video\tYes, 720p@30fps, video light Secondary\tYes, VGA\nOS\tAndroid OS, v4.0.3 (Ice Cream Sandwich) Chipset\tQualcomm MSM8255 Snapdragon CPU\t1 GHz Scorpion GPU\tAdreno 205", "Name": "Sony Xperia Neo L MT25i Black - Factory Unlocked, Android Smartphone - International Version", "ImgURL": "http://ecx.images-amazon.com/images/I/41IawkboDqL._SY300_.jpg", "ProductID": "B008HAEF5G"}}