{"Reviews": [{"Title": "Excellent product overlall, the physical Keyboard could have had better keys", "Author": "G. Luigi Rota V.", "ReviewID": "R363ODQDG537ZK", "Overall": "4.0", "Content": "The product is great overall in its functionality. My only rants are:1. Coming from a Blackberry and having been disappointed with the touchscreen keyboard on an Iphone 3, I was looking for an Android phone with an actual keyboard. As it turns out the keys on the physical keyboard just don't feel right. I ended up using the touchscreen keyboard, which defies the purpose of having the slideout keyboard.2. Because of the slideout keyboard, the level of protection you get from protective cases is not the same you would get from a Seidio case for a phone without a physical keyboard. On the first fall the protective cover flew off and the phone was cosmetically blemished but fortunately no functional damage3. Camera takes great photos and video but is terribly slow to react. I also have a galaxy s3 and there is just no comparisonUnless you definitely need a physical keyboard, go with the Samsung s3 mini or the s2. I ended up paying a bit more and went up to an s3 and will never go back, but now thatmy wife has the captivate she is quite happy.", "Date": "April 11, 2013"}, {"Title": "GREAT PHONE", "Author": "Amazon Customer", "ReviewID": "R2PIYVVTXSZ348", "Overall": "5.0", "Content": "great PHONE.! SIZE IS PERFECT AND IT WORKS GREAT WITH ALL APPS :) BEST IT WORKS WITH ALL GSM CARRIERS", "Date": "February 10, 2014"}, {"Title": "so far so good", "Author": "Thelma S. Scott", "ReviewID": "R1K99EB3JFVYLY", "Overall": "5.0", "Content": "I am still in the getting acquainted stage with this phone and so far it is very nice. I am not techno savvy  but I can do what I want on this phone no problem.", "Date": "February 24, 2014"}, {"Title": "100% Funcionality", "Author": "Edison Macleiry Tejeda Nunez", "ReviewID": "R18ESL26JPV2KI", "Overall": "4.0", "Content": "Although not Celular October 9 as I said the Descripsion, if it was October 8 and works perfectly, Thank you for your responsibility. I am very happy with my purchase", "Date": "December 10, 2013"}, {"Title": "Good", "Author": "Laura", "ReviewID": "R2TXK1AMVOPB7L", "Overall": "4.0", "Content": "Works great just a little dinged up on sides but to b expected from a used phone but pretty satisfied", "Date": "November 9, 2013"}, {"Title": "Keyboard glitches", "Author": "Maddie", "ReviewID": "R2CVU2RYVRP81N", "Overall": "2.0", "Content": "The keyboard has tons of glitches. I have to turn off and on my phone for it to work sometimes. And the charger broke the first week of having the phone. Not only that but the battery dies so fast. I do not recommend to anyone.", "Date": "January 3, 2014"}, {"Title": "Awesome Phone", "Author": "Thea", "ReviewID": "RYI8R2SNFNRMD", "Overall": "5.0", "Content": "We had one of these phones that had been stolen.  The phone was actually returned so we thought about returning this item but because it performed well one of my other sons decided to take the phone.", "Date": "April 14, 2014"}, {"Title": "stopped working with 90 days", "Author": "Kelvin Wiley", "ReviewID": "R2OFH2EPOX41TT", "Overall": "1.0", "Content": "Item stopped working within 90 days...samsung says out of warranty even though I purchased new.  I've been dealing with this since January 30th and still nothing.", "Date": "March 16, 2014"}, {"Title": "True Samsung Mobile Phone", "Author": "SGE", "ReviewID": "R1JG5MEWRUML5G", "Overall": "5.0", "Content": "Hi, this mobile phone is awesome , is a true samsung mobile phone i already registered online.The only problem is that this mobile phone has a battery short life, but this is normal whatever place you are going to purchase this mobile phone.But this Samsung Captivate glide is great!", "Date": "October 31, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008DJ4HAO"}}