{"Reviews": [{"Title": "Good-- Not Great", "Author": "Sarah", "ReviewID": "R3PN9EYXCHWKIL", "Overall": "3.0", "Content": "I received the skyrocket as a free upgrade from AT&T; after my Atrix II decided to stop working. This phone is okay, but I'm having a lot of trouble with dropped calls and the person on the other end not being able to hear me and saying that I'm always breaking up. Whenever I go on instagram or facebook, half the time it says 'cannot refresh feed'.On a positive note, the screen resolution is amazing, the camera is great, and the battery is OK. Make sure you install juicedefender and advanced task killer, they really help extend the battery life to almost double what it was prior to installation.however, do NOT install Samsung Kies. I installed it on two different computers and both have stopped working. I don't know if it's a bug or what but I wouldn't risk it.", "Date": "September 12, 2012"}, {"Title": "Love this phone", "Author": "ar1234", "ReviewID": "RC8CKLVKVZ9HG", "Overall": "5.0", "Content": "I've had this phone for 2 years now and It's the best phone I've ever had. I never get dropped calls like the other reviewer. I love the large screen too. Not to mention how fast it is. I'm sticking with the Android.", "Date": "March 18, 2013"}, {"Title": "Samsung S2 Skyrocket Unlocked White Android - A Very Detailed Review", "Author": "Daisy S \"Daisy S\"", "ReviewID": "R2974HIPTWRH3Q", "Overall": "5.0", "Content": "This superb phone with many features and being a techie, I have fully tested this phone. Since this phone has EXCEEDED all of my expectations, here is my very detailed review of this very special and fun to use Skyrocket S2 phone. And note that I bought this from a seller on Amazon NEW and it was fulfilled by Amazon. My goal in this review is to help in your buying decision one way or the other regarding this phone.PROS:- SIZE AND WEIGHT: Perfect size for me (with a 4.5\" viewing screen like the S3 has). For me, I keep this phone inside a case and cover and it still fits easily into a rather small purse. And also I take it with me to the gym to listen to my music when I work out.- Unlocked Sim - Yes, the phone I received is NEW and I tested the Sim slot to make sure it was unlocked. First I inserted my neighbors T-Mobile standard Sim card (she has a pre-paid plan with no data plan). I simply popped it into the phone and it worked right out of the box, called someone and it worked great. Sent a text (with no pictures or attachments, just text and went fine). Then I removed her Sim and placed my own AT&T; Activated Sim card (Standard sized card). With the T-Mobile and AT&T; Sim cards, this phone worked perfectly as the phone is SIM UNLOCKED, the basic AT&T; Logo is still there, the original AT&T; Apps still there. But you can use say T-Mobile, Straight Talk, or MOST GSM Sim cards should work just fine--just make sure you buy the UNLOCKED ONE not the locked to AT&T; one.However, if you want to use anything other than AT&T;, please contact me in comments for the APN settings for Data and MMS as I have all the settings.One more thing if it says UNLOCKED rather than International Unlocked, it means that JUST THE SIM CARD SLOT is Unlocked for most GSM Standard Sized Sim Cards but still shows the AT&T; Logo on the top front of the phone. Since I did not do anything on my neighbors Sim card but make a quick call and try it for about 30 minutes (she is thinking about buying this phone for herself and using T-Mobile as she does not an AT&T; Account). Also, if you use WiFi like I do, no need for data unless you are in an out of WiFi area a lot of the time. For me, I am around WiFi 95 to 99 percent of the time!- LARGE SCREEN WITH GOOD RESOLUTION - The screen measures 4.5 inches (seems larger) and it is just the right sized screen.  Before this phone I used to use a Galaxy Note and Grand (both had 5 inch or more screens),  both were too big, heavy and bulky. Now, I am using the S2 Skyrocket as the screen is large and has good resolution with 207 ppi (pixels per inch) and higher is better. This has a very sharp screen with easy to read screen. It looks to me as sharp as my old Galaxy Note I did and MUCH MUCH sharper than my Galaxy Grand (which just had 187 ppi and it was not as clear as the S2 Skyrocket) so that extra 20 pixels per inch makes a big difference in my opinion.- STANDARD REGULAR SIZE SIM CARD: This phone has a regular/standard Sim card slot. (Note the S3 regular phone and S4 phones accept a micro Sim.-- Phone call clarity etc. - No matter what my location using this phone for phone calls the clarity of calls is loud and clear whether on the phone's speaker, headset etc. I even had to turn down the volume quite a lot as the calls come in so well.- WiFi/3G (Internet): Connects to any WiFi I have tried very quickly and easily. (For browser, I installed Opera Mini free from Playstore and found it to be a very easy to use and fast browser).- Overall speed, performance, smoothness, picture quality of the screen--very fast and peppy. And I found a way to SAVE on both memory and on battery. What I did was to go into Apps/ Manage Apps and DISABLED the apps I don't use. Without rooting the phone, you cannot uninstall pre-installed factory apps, but you can disable them. Disabling the ones you don't use makes the phone run faster and frees more memory! Since I am a techie, I know which ones to disable and which ones not to disable, so if in doubt, please ask me in the comments and I will be glad to assist you in this.- BATTERY LIFE: This phone has given me the ONE OF THE BEST battery life of ANY smartphone or that I ever owned. And I use 100% brightness. For me, even at 100 brightness, if I use WiFi when I need it and then turn it off, I get all day into the night on one single charge! (I charge nightly and the phone is at 100% ready to go the next morning).- EXTERNAL SLOT FOR MICRO SD CARD - This helped to sell me on this phone as I can add my personal music, photos, videos and more to this phone!And I placed a 32g in mine for music, files etc. *Keep in mind where External SD cards are concerned: They are JUST for your personal files: music, videos, photos, and other files. When you install apps from Playstore or other sources, they store either in INTERNAL Memory Card or sometimes in the phone area (most store in the INTERNAL SD AREA). This is the law of the land where Android is concerned and ALL newer Android devices (including Samsung) work this way when storing your downloaded apps are concerned.- INTERNAL STORAGE SPACE:This phone is advertised at 16GB of Internal space. The 16GB is the space BEFORE the drive was formatted, OS installed and then factory apps installed. So what I had on the phone BEFORE I installed any apps it had 10.75GB left. This is how it is on any flash drive, SD card, Hard Drive as formatting alone takes up space.Also, since 3.0 Android and above, you cannot save any apps to your personal SD card. Instead the apps are installed one way or the other to the INTERNAL SPACE. However, the good thing is that your personal files as photos, music, videos, and more can be installed to your EXTERNAL SD Card so you do have that space for yourself.**I have a few apps I downloaded from the Playstore, but no games so I still have about 4.08 GB left on my phone for more apps later should I wish to install them.- CAMERA - The 8MP camera concerned me that is UNTIL I took both indoor and outdoor pictures and even video. Well, I was pleasantly surprised. When I printed out some close up and other shots, I was really happy with the detailing in the pictures. Turns out to be a very good camera.- Bluetooth Speed and Performance - The Bluetooth paired quickly with several devices and copied files at a great rate of speed.- OTG (On the go) USB plug for flash drives, mice, etc. For me, I use an OTG Micro Adapter (S3 and S4 ones work) and am able to plug in a flash drive, mouse and more. Could not get my portable Hard Disk to work, but flash drives work fine.- NFC (Near Field Communication) has been advertised to work on this phone. Have not yet tried this feature.CONS:- No built in FM Radio like the regular SII has. Not a problem because I installed TuneIn Radio (free) from the Playstore and I can play lots of radio (FM or other) when WiFi is on.- Adobe Flash is not supported in this phone or ANY ANDROID DEVICE after 4.0 OS. The only way to get flash is to get a archived flash and use a high end browser such as Puffin or Maxthon Browser. So downloading the older archived flash gives the ability to view SOME internet videos, but this is better than no flash at all. Keep in mind this is a problem with ALL brands of Android devices with 4.0 OS and higher it is just after 4.0 Android came out, the NEW and best flash is NOT supported for Android devices. It is what it is...Bottom line: Would I buy this phone all over again? Yes I certainly would. Hope this review has assisted you and thank you for reading it. Please feel free to ask me any questions in the comment area and I will answer all questions in a very timely manner.", "Date": "September 21, 2013"}, {"Title": "I love this phone", "Author": "AmBass", "ReviewID": "R1G82KQU9C8DYZ", "Overall": "5.0", "Content": "I have had no problems out of it. It is easy to use. This is my first smart phone too. I highly recommend. Shipping was fast and have had no problems at all.", "Date": "January 23, 2014"}, {"Title": "This phone is great!!!", "Author": "Tony", "ReviewID": "RP8TKO0ZZANPM", "Overall": "5.0", "Content": "I like this phone!!!! No traces of scratches the surface of the phone.one thing is the phone and the earphones are white but the charge is black.......however, this is a great phone....", "Date": "October 6, 2013"}, {"Title": "It's a great phone.", "Author": "Marcelo Aliberti", "ReviewID": "R134DU6X326VCW", "Overall": "5.0", "Content": "I bought it for my wife. She has never used any android device. I had very little experience with android because I'm iPhone fan. Now I'm seriously considering move to Samsung. It has a great screen, it fells ok and has a great size to see web pages. The only downsize I have found is that this phone is less responsive than the iPhone 4S, which I have. Please, beware, we are talking about the S II skyrocket, not whatever S II.", "Date": "October 1, 2013"}, {"Title": "Fast", "Author": "Pat", "ReviewID": "R1KRADSAVKR3EG", "Overall": "4.0", "Content": "This is much faster than I expected.  The voice recognition is top notch, that's all I ever use.  The back is a little slippery, so I have to be careful that I don't drop the phone.", "Date": "October 8, 2013"}, {"Title": "do not get a used phone from this company EVER", "Author": "matt", "ReviewID": "R3TAUWSDZ3LXUT", "Overall": "1.0", "Content": "Garbage. phone was fried buttons did not work. The phone wasn't worth the shipping and handling charges.  Do not buy used phones from this company.", "Date": "September 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008GWF25W"}}