{"Reviews": [{"Title": "Don't waste your time", "Author": "Jeanette J. Johnson \"Slick Chick\"", "ReviewID": "R1BNJCSNQNV7Y9", "Overall": "1.0", "Content": "Phone began to give problems in less than six months. Not worth it at all. Find something better and pay a little more for better quality", "Date": "April 9, 2013"}, {"Title": "A great user friendly phone", "Author": "Avid reader \"avid reader\"", "ReviewID": "RKOY7C1LCQNZN", "Overall": "5.0", "Content": "If you don't need a big fancy phone but one that does nearly as much in a much simpler way, this is the one for you!", "Date": "March 23, 2013"}, {"Title": "NIce", "Author": "Maribel Soto", "ReviewID": "R3VKIGB4NEV7SG", "Overall": "5.0", "Content": "It is perferct to me, it is easy to use, the camera it is excelent! I love it. If I need a New one I buy a similar", "Date": "January 30, 2013"}, {"Title": "One of the worst phones I have ever purchased", "Author": "Balu", "ReviewID": "R1ZRHX5PAS6YIG", "Overall": "2.0", "Content": "If you are looking for a phone just for texting and receiving calls, Go for it.The display and the touch sensitivity is good  for a phone in this price range.I have tried to download few basic apps for the phone but I couldn't connect to Samsung apps; there are many bugs in the Samsung Bada OS.", "Date": "November 28, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\n2G Network: GSM 850 / 900 / 1800 / 1900 - 3G Network: HSDPA 900 / 2100\nBada OS, v2.0; TFT capacitive touchscreen; TouchWiz UI; GPS Navigation with A-GPS support\nBluetooth v3.0 with A2DP; Wi-Fi 802.11 b/g/n, Wi-Fi Direct, Wi-Fi hotspot\n2 Megapixel Camera; Video HVGA@30fps; microSD Slot up to 32GB; Stereo FM radio with RDS", "Name": "Samsung Wave Y (Young) S5380 Unlocked GSM Phone with Bada OS 2.0, Touchscreen, Wi-Fi, A-GPS, 2MP Camera, NFC, Bluetooth and microSD Slot - Sand Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/51PLgkOTZyL._SY300_.jpg", "ProductID": "B008RKNM5U"}}