{"Reviews": [{"Title": "Check first regarding prior owners info downloaded into products", "Author": "Buyer55", "ReviewID": "R118K19N4UMK2G", "Overall": "5.0", "Content": "I love my phone but I did have some trouble at first.  The previous owner hadn't had all his info. cleared out and ready for mine.  I had to contact him a few times until I was able to load my info and use it.  I would recommend to other buyers of this type of product to communicate about the clearing of info prior to the purchase.", "Date": "November 3, 2013"}, {"Title": "Iphone 5", "Author": "Ajiane Lee", "ReviewID": "R25NB6JUR4P8KX", "Overall": "1.0", "Content": "I've received my phone broken. Half the screen was cracked. I would not recommend this product. I did not order a broken phone!", "Date": "February 18, 2014"}, {"Title": "Was still activated", "Author": "Charlene Bendon", "ReviewID": "R3QDNDW6GIVEDL", "Overall": "1.0", "Content": "It had no sim. Had to go toApple store to get a new Sim card. Then went I went to Sprint to get it Activated I was told it was still activated to someone elses account. I could not use this phone at all", "Date": "October 2, 2013"}, {"Title": "Will buy again if I need it", "Author": "ramon", "ReviewID": "R3E2UN10XT1SI3", "Overall": "5.0", "Content": "Fast delivery great product awesome price met all my expectations and will highly recommend to buy. Easy to activate as well", "Date": "April 12, 2014"}, {"Title": "Iphone 5", "Author": "Julian bermudez", "ReviewID": "R2Z548T3JV452H", "Overall": "4.0", "Content": "Got the phone just in time for my bday lol phone came in excellent condition brand new . Giving it 4 stars just for the fact it didnt bring a sim card but other than that phone works great", "Date": "February 28, 2014"}, {"Title": "No SIm Card!!!", "Author": "JayzFlightpath", "ReviewID": "R3BAXTNO86WUIK", "Overall": "3.0", "Content": "I figured it would come ready to activate but that would be a no! Had to buy a specific sprint sim card for 40 bucks.  Kinda disappointing.  Also was brand new no scratches.  It had tons of scratches and dents all over it.  Yikes! Not gonna spend", "Date": "September 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0097BY4CI"}}