{"Reviews": [{"Title": "Super Lightweighted High Quality Phone from China", "Author": "Not in This way", "ReviewID": "R3KAYB9YWYQZYC", "Overall": "5.0", "Content": "I have an orange briefcase and was trying to find a phone just to match its color. This phone is so beautifully designed, and to my surprise, very lightweighted. It is not an Android/IOS type of sophisticated smart phone, but does serve the basic functions really well, like calling, texting and basic apps like calculator, calendar, alarm... The operating system looks like was designed 6-7 years ago but that does not bother me at all considering the price. Being Cisco's main competitor who mainly makes electronic communication switching devices, I am impressed that Huawei even makes these nice phones these days, and gadgets \"made in china\" could be of top quality. The only thing I found a bit awkward was that it is a phone made by a chinese company but it does not have Chinese unicode nor input, so if you are looking for chinese input, you may have to look for something else. overall, i give an \"outperformance\" and \"buy\" rating to this device.", "Date": "February 10, 2013"}, {"Title": "Just the basics, but does a good job at them, even on T-Mobile USA", "Author": "C. Gounaud \"DIY Devotee\"", "ReviewID": "R29WP789WG6RA0", "Overall": "5.0", "Content": "This was to be a replacement phone for our daughter who texts a lot and talks a little.The phone works well on T-Mobile USA's GSM network for talking and texting. If you want to access T-Mobile's data network to surf the internet, check e-mail,etc., this phone probably isn't for you as you won't be able to access T-Mobile's 1700 MHz frequency data service with it.Again, for talking and texting, not a problem, works great, great price.", "Date": "March 30, 2013"}, {"Title": "Nice little feature phone for voice text w T mobile", "Author": "Bob \"Bob\"", "ReviewID": "R2O5A98FECSX9E", "Overall": "5.0", "Content": "Inserted sim card. Worked fine. Good voice quality. No problems with text. Couldn't get MMS to work (like others here) Instruction booklet is in Spanish but English version available from Huawei web site: [...] search by model(not sure if Amazon allows external links if not you can internet search for huawei downloads like I did)I think this is a nice basic keyboard phone. You will be disappointed if you are expecting it to be comparable to a $400 smart phone.", "Date": "August 23, 2013"}, {"Title": "Great phone for what it is", "Author": "Cole", "ReviewID": "R2X86VH06TD0OK", "Overall": "4.0", "Content": "If you're looking for a blackberry or iphone at a discount price, this isn't it.  But for a basic phone for my mom, to replace her \"too complicated\" blackberry, it's great.  When she asked me for a phone, her only requirement is that it had a qwerty keyboard.  This has exactly that, and while the ringtones and interface are somewhat dated, it's a great value for money, well constructed, and the battery life is pretty good too.", "Date": "March 7, 2013"}, {"Title": "not smart phone but very cute", "Author": "Sharon Dong", "ReviewID": "R3T1381D6XU65H", "Overall": "5.0", "Content": "it's not a smartphone, but is cute with radio and camera.languages include english, spanish and portugues.i recommend it.", "Date": "January 31, 2013"}, {"Title": "Nice, but....", "Author": "A. bergman", "ReviewID": "R1FF0KQCEDYP0", "Overall": "1.0", "Content": "This phone is designed for the Latin Amrican market. No customer support in North America.Nice little phone, but unable to send or receive photos.  Did not meet my needs.", "Date": "March 21, 2013"}, {"Title": "GREAT!!!", "Author": "Zulmira Salazar", "ReviewID": "RKX1CFHO1QDS8", "Overall": "5.0", "Content": "Great! Excellent! It works great! I love it! I bought it for my two others lines! I bought 3 for family!", "Date": "January 10, 2014"}, {"Title": "You get what you pay for", "Author": "Randall Fisher \"wildtroutfisher\"", "ReviewID": "R1CINHBN77WXJZ", "Overall": "1.0", "Content": "Was able to download English PDF of manual and switch from Spanish... But the battery never kept a charge and after a week wouldn't charge at all.", "Date": "December 29, 2013"}, {"Title": "Good Phone", "Author": "Danielle", "ReviewID": "R1ARTTXF6REMLU", "Overall": "4.0", "Content": "Bought this phone for my boyfriend who broke his phone and needed one quick. The price was great. It comes set in spanish but he was able to go into the settings and switch it to english without reading the manual so it's pretty user friendly. He said the keys are exactly the same as his blackberry he was using so he didn't have to spend time getting used to it. He only uses the phone for making calls and texting so if that is what you're looking for in a phone then this is perfect for you.", "Date": "October 30, 2013"}, {"Title": "I love it", "Author": "Wilfredo Ferrebus", "ReviewID": "R7GLMPQRWP8ZJ", "Overall": "5.0", "Content": "this phone is very very good is beautiflor two sim card sound and video excelent is an good phone ok", "Date": "May 26, 2013"}, {"Title": "good basic phone with AT&T; service.", "Author": "Kindle Customer", "ReviewID": "R3KIT6EOOTBMZT", "Overall": "4.0", "Content": "Bought this phone hoping to be able to access the web.  Should have read more reviews. Great size and shape.  Like that is has a radio and comes with microphone so great for hands-free.  Cannot send text photos or access the internet (so far).  Worked with old sim card.  Great little phone for talking and texting due to the full qwerty key board.", "Date": "April 17, 2013"}, {"Title": "Another Gift", "Author": "Pa", "ReviewID": "R3RGFZR9BGBVMU", "Overall": "5.0", "Content": "I bought this cell phone for a family member who lives in south america, he really loved it, thank you.", "Date": "April 3, 2013"}, {"Title": "easy to use", "Author": "erica mena", "ReviewID": "RA8S24QB31DA4", "Overall": "4.0", "Content": "my dad was given this phone and loves it so easy for him to understand and use.  His old phone was too complicated but this is a deal.", "Date": "March 6, 2013"}, {"Title": "I can barely hear people when I'm calling", "Author": "emilyvsconan", "ReviewID": "R3HEJFMG7P0I7V", "Overall": "4.0", "Content": "When I received my first phone call today I could not hear them at all and I asked them to yell to the phone. I tried the headphones later and they made it much better. And I couldnt find the sound settings (it seems they dont have it in the system). Other things like texting and alarm clock work pretty well.", "Date": "February 22, 2013"}, {"Title": "great", "Author": "sol", "ReviewID": "R2WWONXHXVQCAY", "Overall": "5.0", "Content": "this was for my son, he lost his blue samba, and this replaced it  fora few more dollar came supper great bargain", "Date": "January 4, 2013"}, {"Title": "Voice and SMS - Junk otherwise", "Author": "V. Ratan \"Vee\"", "ReviewID": "RRNBVFAE7P1YW", "Overall": "2.0", "Content": "The letters and numbers are almost invisible. Setting the APN is impossible. Works for voice and SMS but junk otherwise. There are cheaper phones which will do the basics better and at a much lower price.", "Date": "August 15, 2013"}, {"Title": "Older User", "Author": "Pet", "ReviewID": "R1KIXMFWWDERFJ", "Overall": "3.0", "Content": "this phone is ok , very simple to use and manage by an older person, this is totally not a smart phone only it looks like one, plays good music and not so good pics", "Date": "August 6, 2013"}, {"Title": "key Simply not enough", "Author": "Curtis", "ReviewID": "RBPOE94QYG6RE", "Overall": "2.0", "Content": "This is a pretty phone but definitely lacking some key features.  Just can't compare to what's on the market now.", "Date": "March 9, 2013"}, {"Title": "nice", "Author": "Ganiber", "ReviewID": "R1YGEVGOCBTGF9", "Overall": "5.0", "Content": "Very nice products i like it alot and customers do as wellonly if i can get discount when i take many of it everytime this is will be great", "Date": "February 24, 2013"}, {"Title": "doesnt work with T-Mobile carrier - useless", "Author": "Phuong Tran \"phuong tran\"", "ReviewID": "R1G5IQV7ERK3P0", "Overall": "1.0", "Content": "this phone doesn't work with T-Mobile network, keeps saying Emergency call only when T-Mobile SIM is inserted. Wasting my money. Seller doesn't provide technical support.", "Date": "February 26, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz", "Name": "HUAWEI G6620 Unlocked GSM Phone with Dual SIM, 1.3 MP Camera, QWERTY Keyboard, B", "ImgURL": "http://ecx.images-amazon.com/images/I/51UWZ71mHKL._SY300_.jpg", "ProductID": "B009G2E29I"}}