{"Reviews": [{"Title": "Nice design/crippling specs", "Author": "rpv", "ReviewID": "R1IGD7HC1LEY49", "Overall": "4.0", "Content": "I tried this phone recently for a period of few days. This is a midrange 4\" 480x800 pixels (Gorilla Glass) phone in a  growing and crowded market of smartphones. This is a lower end of lower-end version of the Windows Phone 8X by HTC, but unlocked versions are available for relatively cheap. This is not sold by carriers in USA. Compared to Android, the market of Windows 8 phone is limited. However compared to Lumia 920 and HTC 8X this is a cheaper alternative. Has Qualcomm® S4 1 GHz, Dual-core processor, 512MB of RAM, 4GB onboard storage, microSD card slot which can take up to 32 GB. Beats' audio is available on several smartphones, but speakers are of decent quality in this phone. Battery capacity 1,700mAh which is not that great. Compared to a high end Android Galaxy Note II, which has a battery of 3100 mAh Battery. One main thing is this has a microUSB port and can be connected to computer for drag and drop of files. This is great! MicrosSIM standard, has standard GPS. I tried with Navigon which turned out to be great in giving voice directions.I have used in the past extensively HTC Titan I and II which is pre Windows 8 (7.5) and I was surprised it has become more buttery smooth now even on this phone which is way underrated. Windows Phone is now (early-mid 2013) the third-leading mobile phone platform, more than tripling its market share year-over-year. One recent report I read Android and iOS are ahead in games with 162.1 and 37.4 million shipments in 1Q13 and Windows phone came in 7 million. This is more than double from previous year.Overall though this phone is cheaper compared to other phones in an unlocked versions, the 4GB has a crippling effect in all, and may turn out to be an issue in the long run once app space grows. Still giving 4 stars as it cannot be ruled out for a Windows 8 enthusiast.", "Date": "May 18, 2013"}, {"Title": "Fine for a beginner smartphone", "Author": "Suzie", "ReviewID": "R1JLUALKL4EYSN", "Overall": "5.0", "Content": "I bought one of these in Europe and switch SIMs so that I can use it in both Europe and the US.  Since it uses SIM cards it has to be a GSM network (ie newer technology than Verizon); I use a T-Mobile prepaid plan.I use it for email, web, NY Times app, taking and storing photos, checking weather forecasts, etc.  For all of these features it is great.  I love that I have consolidated my phone contacts with my email contacts.  If you want to install many additional apps then this is probably not the phone for you.No problems with speed or battery usage for me.  Especially compared to my partner's iPhone.", "Date": "October 14, 2013"}, {"Title": "You get all you need for a prefect price", "Author": "FAISAL", "ReviewID": "R365SFA9Q3IQRS", "Overall": "5.0", "Content": "I loved this phone never faced any problems with itI bought just for business but I couldn't resist to use it for even more its really perfect", "Date": "September 28, 2013"}, {"Title": "Nice, slim Windows Phone but concerned about reliability", "Author": "SeesRain", "ReviewID": "RDC1L3REKXCXH", "Overall": "4.0", "Content": "The main reason I got the HTC 8S was that it's the most slim and smallest Windows Phone 8 that I could find and it feels solid since it doesn't need a large battery cover (the battery is designed to be non-removable by the end-user).Some apps won't install because it doesn't have as much memory as more expensive phones, but this is okay with me.I was disappointed because the \"Factory Unlocked\" phone was locked to Cincinnati Bell and the seller thought that was okay, but hopefully this was a problem with the seller and not other \"unlocked\" phones.The biggest problem with the HTC 8S phone is that after one month, it would blink orange and green when connected to the charger and would not charge.  I did a little research and found that others had a similar experience with HTC phones of all types and that it was likely a bad battery connection or an overheat problem and that the phone would need to be replaced.  Since the phone was not from an authorized and did not have a warrantee, I took it apart using screen replacement instructions, checked the ribbon connections and some separation between the connector and battery and the charging started working again with a solid orange light while charging.I would by an HTC 8S again since I really like its size and design, but I would be more careful about who was selling it to make sure it had a warrantee and that they would guarantee that is was unlocked.", "Date": "July 13, 2013"}, {"Title": "It's awesome", "Author": "Saami", "ReviewID": "R3S0V87SISH0CA", "Overall": "5.0", "Content": "Loved it it was the most amazing  phone ever. !!U should really get itWindows did a great job", "Date": "August 17, 2013"}, {"Title": "htc windows 8s", "Author": "htc", "ReviewID": "R1EBE2AYCLWI87", "Overall": "3.0", "Content": "The phone is ok found out isn't carried by American mobile providers it only has 4gigs but has a place to add more. Its overall ok better than what I had before its almost the same as the radar.", "Date": "May 17, 2013"}, {"Title": "Not Verizon comparable", "Author": "Paulsurra", "ReviewID": "R25O0U5N5SWGQF", "Overall": "1.0", "Content": "I could not put this phone on my Verizon plan,had to return it. I wish the listing would gave said something to that fact and not wausted my time.", "Date": "September 22, 2013"}, {"Title": "Windows did it again!!", "Author": "ENRICOMORALI \"EM\"", "ReviewID": "R35NF3BFIQ3DRE", "Overall": "1.0", "Content": "I wanted to upgrade a new phone for the temporary crappy replacement phone that I got after my Panache phone went dead, but this one is not that far from my crappy HUAWEI replacement.Yes windows did it again, trying to look pretty but that's all about.No functionality or easy, good feats.The design of HTC android was perfect, easy and sophisticatedly simple.-Windows no needs to know your identity when you are on the phone, so why are they asking you sign with user@hotmail.com, user@live.com so, once you sign with you @hotmail, @live account they want to know everything about you.-For text messages they removed the options for more characters ( _ , [] , = , +  etc) on the keyboard, bye bye to typing optionso n eb yo n e letter vs slide through the keyboard which I loved in my previous HTC panache) now you have only one option,t y p i n go n el e t t e ra tt h et i m e...On the keyboard the \"send\" icon (and so tiny) is so close to the space bar that you will be sending messages every time you supposed to hit \"space\", brilliant!!-When you are typing a txt message and if you exit the txt msgs application by accident; there's not drafts folder, the message is lost is that happens (or at least I haven't been able to find a \"drafts folder\") a lengthy reply was lost but some others were saved in a thread.-Saving a new phone number or contact is just confusing and so illogical (not to say stupid) you have to go page after page to do so, instead to put all the necessary contact info in just one page (name, phone edit, home phone, work phone, email, address, birthday, etc.) or a single step.The most complicated as Windows loves to do it at every time.-You CAN NOT access to the apps store unless you sign with hotmail.com/live.com.-Not front camera on this one; so, no Skype!-Battery drains very quickly, in less than one hour is at 87% when was at 98% in the morning and spend all night connected to charger.-\"Beats audio IS NOT available for phone speaker\" that what it says on \"system applications\".-Many of the options from old version (which were way better, are not available in this phone anymore).-So, if you like HTC android system stay together, but if you are trying to upgrade to a newer phone to something new and never had a windows phone, run away... avoid frustrations and deceptions.-One more thing, you CAN NOT REPLACE THE BATTERY (at least by yourself), the blue part of the back (same size as the blue side in the front) is there where the sliding cover is, it has only space so you can slide in a Micro SD memory card, and a MICRO SIM CARD, (if you are upgrading to a new phone, most likely you will be ending up paying $15 - $25 EXTRA, for a new MICRO SIM CARD which is of course smaller than a conventional sim card.-The music player won't do anything when you tap twice, (some other player will give you more options other than\"Play smart dj mix, Share (Not even bluetooth option), \"Save as playlist\") kinda useless options in comparison to some other phone music players (artist/song info, share, look for similar music, etc).June 24 Update-I tried to send via BlueTooth some pictures I took with the camera and of course they can be sent to my Mac, not compatibility issues here is just that the \"smart\" phone won't connect, the other way around it works (Mac sending stuff to Phone yes it works).Five minutes and stupid phone still \"waiting\" trying to send three pictures, (which by the way you have to go back to settings, then pair it first and the turn it on, my old Sony Ericsson just will allow a temporary BT turn on to send whatever to wherever right on the spot without much complication).The BT MUST be turned on first in order to make it work, otherwise it just will not.More than five minutes and still a color bar on the top of the screen, it says \"waiting\" to what? I wonder.It won't go away, you have to shut down the phone to make it away or turn off the BT.And when you turn off the BT it comes the next message\"The device you're trying to send to doesn't support sharing over BT\"So the \"smart\" system doesn't realize that before, no until you turn it off, despite I send music and pictures FROM my MAC TO the crappy phone, that is exactly what you can expect from a Windows product, not a standard working compatibility at least in BT connection.+On the bride side the camera (5mp) includes \"Bing vision\" the QR scan and photo translator of a image/pictured picture-taken text. Kinda crappy automatized translator but, oh well!Have you used/owned a Windows PC in the past before? Good!So I dont have to tell you what to expect from a windows phone or try to convince you otherwise of anything.ANDROID is brilliant (with some less flaws than this thing), Windows phone not that much.I can say... Windows phone definitely \"WAS (NOT) MY IDEA\"Save your hard earned money and get something else.", "Date": "June 8, 2013"}], "ProductInfo": {"Price": "$312.00", "Features": "NEW HTC 8S 850 3G -WINDOWS 8 UNLOCKED\n3G bands are 850/1700/1900/2100 MHz or 900/2100 MHz, depending on the cellphone version. Check the description in Condition note.", "Name": "Brand New HTC 8S Blue -WINDOWS 8 Factory Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/41spPHn4mxL._SY300_.jpg", "ProductID": "B009HQAR56"}}