{"Reviews": [{"Title": "very pleased", "Author": "Ashleybubs", "ReviewID": "R1IC7N793O9X8", "Overall": "4.0", "Content": "I bought this phone for my boyfriend because hes very rough with phones. He loves it bc Its very rugged, the battery life is amazing, he only charges it once every 2 days.  He still gets good pictures on the screen when using the internet. It has really good sound quality. It has an easy to understand layout for applications. My boyfriend just wanted a rugged phone that has easy and good call quality with a screen he could still use the Web for without squinting. ..and he got it! I would def recommend this phone to someone that doesn't want all the crazy add ons new phones have but still use internet and calls and texts allot. Again if your very rough with phones this is the phone for you! Very durable!", "Date": "March 10, 2013"}, {"Title": "nice phone but looks deceive", "Author": "IBRAHIM CASIAS", "ReviewID": "R28YYGXBBDEAZ6", "Overall": "2.0", "Content": "This phone wroked very good for the first week, i had seen other reviewers who had warned tostay away from this but i didnt take the warning, so after the first week my phone would freeze and restart, the right hinge of the flip broke in a out a month. Those three things made the phone like hell for me.", "Date": "January 7, 2014"}, {"Title": "Exactly what I wanted", "Author": "Shann", "ReviewID": "R3IAOGTDTYDK6X", "Overall": "5.0", "Content": "This phone is exactly what I wanted for my husband. Rugged and easy to operate. It in better shape than described.", "Date": "March 13, 2013"}, {"Title": "I like it", "Author": "VAP", "ReviewID": "RQZ45271GSXXH", "Overall": "3.0", "Content": "The phone came in handy for my mom she can use it and the phone came in great shape for a 2nd hand phone. The phone works", "Date": "January 27, 2013"}, {"Title": "Add said Like new. Product is very scratched up not at all \" like new\"", "Author": "TWilks", "ReviewID": "RYJYO7IOPMONF", "Overall": "1.0", "Content": "I was very disappointed getting the phone today. It is very dirty and scratched up! It didn't come with a charger so I don't even know if it works. I feel like I got scammed.", "Date": "February 21, 2014"}, {"Title": "Great Phone!", "Author": "Van", "ReviewID": "RGGIN0VQCRDFV", "Overall": "5.0", "Content": "My husband's HTC One phone had a cracked screen and stopped functioning.  When we went to a Sprint store, it was going to cost too much to terminate our service contract or purchase a new phone.  Since we couldn't afford to spend hundreds of dollars replacing his Smart phone, we opted to purchase a basic flip phone for his line and found this vendor selling a used Motorola Renegade.  Although we were worried about the condition of the phone, we liked that this vendor provided Customer Support and had good reviews.The product came on the day promised and it is in great condition even though it was used.  We were worried about how our experience purchasing a used phone and if we would have problems connecting the service through Sprint, but in actuality I was able to connect the phone within 15 minutes of receiving it and my husband likes his replacement phone.Thanks AllStar Electronics for making this experience so great!", "Date": "December 10, 2013"}, {"Title": "love my V950 Renegade", "Author": "Rodney Sutton", "ReviewID": "RAE8BPY9HKJDU", "Overall": "5.0", "Content": "This is my 3rd one, so when ever a break one i has to have another one. Best phone i ever had for the work i do in construction", "Date": "December 8, 2013"}, {"Title": "Awesome phone", "Author": "Steven espinal", "ReviewID": "R2B3TPP9Q03M7O", "Overall": "5.0", "Content": "My mom loves it considering she's not very tech savy. It's built well and sounds great with very vibrant colors.", "Date": "October 22, 2013"}, {"Title": "Good solid phone!", "Author": "catolona", "ReviewID": "R3291M4QYG57EP", "Overall": "5.0", "Content": "My husband really likes this phone.  It's rugged and holds up well.  He likes the flip feature so there are no pocket dials!", "Date": "October 5, 2013"}, {"Title": "Satisfied!!!", "Author": "remy314", "ReviewID": "R1E21IZWD1911F", "Overall": "5.0", "Content": "I bought this phone for my mother, who wants to never leave the flip phone world. She has been able to use with ease & no complaints. Got for great price & condition of phone was great!!!!", "Date": "September 26, 2013"}, {"Title": "buyer beware!", "Author": "gadget  roland", "ReviewID": "R15173RCT42NDP", "Overall": "1.0", "Content": "product was not new and did not work! buyer beware! SHOULD HAVE LOOKED AT OTHER REVIEWS from the beginning oh well", "Date": "September 16, 2013"}, {"Title": "Renegade phone", "Author": "R C George", "ReviewID": "R1XO0TTBYT9FHB", "Overall": "3.0", "Content": "The phone was a little bit beat up and that was disappointing.  We knew it was used but not misused.  It came in a timely manner.  No other complaints.", "Date": "August 24, 2013"}, {"Title": "Can't complain, or can I?", "Author": "Cheezy310", "ReviewID": "R3K7BQOFJ4LIGE", "Overall": "2.0", "Content": "Phone arrived early. There was a bit to be desired as far as packaging goes. Buyer rated the phone as excellent condition, it was a bit of a reach. No major flaws or cracks. Overall I'm satisfied with the purchase. Activation was a bit of a pain as the phone was still tethered to another account. Previous user information still on phone when it arrived. Had to jump through some hoops but was able to get it activated on my account. I don't blame the seller for the activation pains, although phone should have been wiped of all information before being sold.", "Date": "August 14, 2013"}, {"Title": "Nextel phones are no longer supported by sprint", "Author": "devan", "ReviewID": "R7JSZ15Y341RJ", "Overall": "1.0", "Content": "Sprint will no longer activate nextel phones. I'm sure otherwise it worked fine but without that it's pretty much a paper weight.", "Date": "August 2, 2013"}, {"Title": "great", "Author": "trixie", "ReviewID": "R1VY8Y502JDCJQ", "Overall": "5.0", "Content": "My husband ordered the phone.  It arrived on time and is exactly like the one he has.  Will start using it when his current phone breaks.  Thanks for your sevice.", "Date": "July 22, 2013"}, {"Title": "So far so good", "Author": "NightRider", "ReviewID": "R28CJ1KZ9NCARD", "Overall": "5.0", "Content": "I gave this to my teenaged grandson and he loves it. There have been no problems with the phone itself. However, I went through a living hell with Sprint in the process of getting it activated. That wasn't the phone's problem though...that was Sprint's screw up. Jus' sayin'...:).", "Date": "July 11, 2013"}, {"Title": "Great", "Author": "J", "ReviewID": "R5WI0F3PHNCKM", "Overall": "5.0", "Content": "Great Flip phone for basic use very loud ringer feel durable long battery life no problems so far with a used one", "Date": "June 10, 2013"}, {"Title": "Broke in 3 weeks", "Author": "Daniel Davidson", "ReviewID": "R1PPJLGM122AYU", "Overall": "1.0", "Content": "The screen section broke off of the body of the phone within 3 weeks. This phone is not rugged as claimed.", "Date": "May 25, 2013"}, {"Title": "phones suck dont buy the ones with the extended life battery the seller wont replace or sell to you again.", "Author": "anthony beddow", "ReviewID": "R25GJQ8306DUJW", "Overall": "1.0", "Content": "they are beat to death when used the extended life battery dose not hold a charge and the charger ports are beat and u have to hold the charger wire in the right spot for it to even take a charge then the pins in the phone get bent.", "Date": "May 23, 2013"}, {"Title": "The phone was just as described, and I knew what to expect from the seller.", "Author": "smartshopper", "ReviewID": "R2GUUBU6Z15019", "Overall": "5.0", "Content": "I was happy that the phone came in a timely manner, via USPS.  The battery still holds a decent charge and it had a house charger, too.  The entire phone was almost immaculate only having one small blemish on the screen, but was better than I was expecting for a rugged used phone.  It was defiantly like new! I am happy and hope that it will last a good while.", "Date": "March 19, 2013"}, {"Title": "Highest Rating", "Author": "Charles Hayden", "ReviewID": "R1XCIJYA6VBQIK", "Overall": "5.0", "Content": "I gave this cell-phone the highest rating because it arrived on-time, was everything I expected and more, and is currently working as one of my cell-phones. I bought the phone as a \"used product\" and was surprised to find a phone that looked and felt like new.  Kudos to the seller!", "Date": "February 25, 2013"}, {"Title": "Works perfectly great price", "Author": "JeffreyLee", "ReviewID": "R3PYPYBZHEFVUP", "Overall": "5.0", "Content": "I bought this to replace one with a bad battery latch.  Took it down to the Sprint store and they were able transfer the account as well as all the contacts!", "Date": "January 27, 2013"}, {"Title": "Gave up on smart phones", "Author": "Tim F", "ReviewID": "R20EDEFZFNC7G9", "Overall": "5.0", "Content": "I must have the worst luck when it comes to smart phones, because 4 in a row gave me terrible performance.  From poor battery life to poor voice quality.  I found this phone and easily swapped it for the smart phone I was replacing.  Aside from saving the $10 per month with Sprint, this phone lasts forever!  The battery is great, the voice quality is good, and the features are just what I need in a PHONE.  So impressed I bought another one and replaced my wife's smart phone.  We're both much happier customers now.", "Date": "June 27, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009HLVD7C"}}