{"Reviews": [{"Title": "Good Alternative to the name brand smart phones for half the price", "Author": "Heath Spidle", "ReviewID": "R2O08O1VO81S5N", "Overall": "4.0", "Content": "There were not many reviews of this product on amazon, and searching this didnt reveal much either.  The company website looked pretty legitimate.  So I took a shot with it.  I ordered two of them one for me and one for my wife.  We were switching from a contract plan to prepaid plan that allows the use of Unlocked GSM phones you just need a sim card.  These all take standard size Sim cards BTW.  This will allow us to change from carrier to carrier until we find one we like without needing to buy brand new phones everytime.I like the phone, for half the price of the name brand phones here in the US it is a great deal.  Has android 2.3 installed and does everything that i need it to do.  Has Google Play store installed allowing you to download all the apps that you could need.  My wifes only complaint is that with the native messaging application you cannot to landscape while typing, but you can download aftermarket messaging applications that will let you do this.  As mentioned in a previous review there is a bug in some that you have to calibrate the proximity sensor which i had to do on my wifes phone but that is easy enough and not a big problem.  Just dail *#36#, then calibrate proximity sensor.As far as quality the phone seems pretty well built, i havent dropped them and dont plan to, so i dont know about back cover coming off or if the screen will shatter.  Accessories seem pretty hard to find, I am experimenting with different cell phone covers to see if they will work.  According to GSMarena the size is very close to a samsung galaxy S Duos, so i have a gel case in the mail to see if that will work on this.Overall i would recommend to a friend who is looking for a phone and doesnt want to pay $400+ for a name brand similar phone.", "Date": "December 27, 2012"}, {"Title": "Don't buy", "Author": "T. Scott", "ReviewID": "R37HUQB4YQ9FQJ", "Overall": "1.0", "Content": "Update 10/1/2013I now DO NOT RECOMMEND this phone.  The one phone we have does not work and we have replaced with Samsung S3 Mini (see reason in 4/16 update below). The second phone is still functioning except for the problem with GPS crashing after a 10-15 minutes of Navigation usage.  I think the problem is memory.  The memory is limited and if you load it up with apps it takes FOREVER to wake up from sleep and to switch between apps.  I am ordering a Samsung S3 quadband (US version) phone today.Update: 4/16/2013Have downgraded stars.  The phone is now malfunctioning during longer calls.  The person on the other end of the call begins to hear tones like you hear when you dial a number.  It starts intermittently and then the tones last longer and then the connection is lost.  'Have sent email to Blu support. Will report on how they respond.Update 3/5/2012: Went on road trip this past weekend and used phone for navigation.  GPS lost signal fairly frequently.  If I turned the GPS off and on it would recapture.  I am REALLY grateful for the Off and On switches in the drop down notification bar at the top of the phone for making it super easy to toggle key functions off and on.Update 3/1/2013: I finally had a response from Blu Products regarding accessories.  24hrsdeals.com has batteries for $9.99 each.  That is a great deal.  Still no cases that I can find.We bought these phones because we need a dual sim phone to use with work number and personal number. Work only needs voice and text so SIM2 works great for this.We are switching after 2 years using an HTC Incredible on Verizon.Pros:-Unlocked gsm plan fees are half the price of Verizon.-Phone is good size, only slightly larger than the HTC.-Android system with access to Google Play works great.-Phone voice quality is good.  Have not paired the bluetooth to the car yet.-The micro usb works with our existing chargers.Cons:-Native apps are not as full-featured as on HTC, but plenty available on Google Play.-Battery life is not good, but not much worse than the HTC. The two SIMS apparently draw a lot.  We have auto-syncing for mail turned off, but still have to keep the phone on charger.-The phone seems to lose connectivity to the networks every now and then and have missed some calls.-NO ACCESSORIES including spare batteries.-NO SUPPORT from Blu, either through email or Twitter.-We had the proximity sensor issue, but when I tried to fix it following the instructions elsewhere here found the settings language to be in chinese and could not figure out how to adjust it.  Did figure out to turn it off, so that is what I did.In the end, you get what you pay for and the phone's little problems can be dealt with by changing habits. I recommend it so far.", "Date": "February 2, 2013"}, {"Title": "need phone accessories but good phone overall", "Author": "kash", "ReviewID": "R3QDH8VCHE2DW9", "Overall": "4.0", "Content": "it really is a good phone.. only thing that sucks is that u hardly can find any accessories for it.. other then that i really like the phone", "Date": "December 8, 2012"}, {"Title": "User Friendly - Older adult approved", "Author": "C. Sapp \"Knowlege w/o application is NOTHING\"", "ReviewID": "R1I6SYPU81R9KZ", "Overall": "4.0", "Content": "The pictures underestimate this phone. This phone was made in the likeness of the Apple iPhone 5. Coming out just one month before it's counter, July 2012. The design is flashy, attractive and about the same thickness as the iPhone 5. Don't plan on getting a case for this phone using the iPhone's case, it won't fit due to the beveled edge on the back of the phone. The phone has a back cover that pulls off with a battery, 2 sim card (full size, not mini) and a microSD card reader slot. It come with a 4GB microSD card already installed. The phone is light and fits pleasantly in the contours of the hand. The screens glass is clear and the touch and response is very sensitive. The lag time is not bad at all, apps open and run smoothly. The on screen keyboard is tight in vertical mode but in landscape is fine. It has WiFi, bluetooth, gps,and gsm connectivity. It is an android platform with google play to download more apps. I was impressed with the phone from the unboxing and first operations. I'll wait and see if the functions still sustain after usage. I used a Simple Mobile sim card and the phone adapted well. It had no problems reading the carrier. BLU Elite 3.8 D430b Unlocked GSM Phone with Dual SIM, 3G 850/2100, Android 2.3, 1GHz Processor and 5MP Camera - White [[http://astore.amazon.com/maujacinc-20]]", "Date": "May 4, 2013"}, {"Title": "Two soup cans with a string between them are a better communication device than this POS.", "Author": "LOUIS BERARD", "ReviewID": "R3C1OI7Q6L9WI6", "Overall": "1.0", "Content": "An instruction manual with no instructions in it. No customer service. No telephone number and no response to emails. The phone doesn't receive photos on your messaging app and after a few weeks wouldn't receive text messages either. Hours in the AT&T; store with several calls to technical support but no one could help. The phone cost $200+ so it wasn't exactly a bargain either. This company WILL go out of business but they for all practical purposes non-existent already.", "Date": "February 16, 2013"}, {"Title": "battery", "Author": "donald church", "ReviewID": "R367R9H1GXIXBV", "Overall": "2.0", "Content": "the batterygoes dead in ten min or less an there is no way to stop apps that u don't use", "Date": "February 11, 2013"}, {"Title": "So so!", "Author": "Lester", "ReviewID": "R34D6FUV7E4BSO", "Overall": "3.0", "Content": "Its kinda slow!2 sims work well but im havin some issues with 3G internetNo accesories for this model .....", "Date": "January 11, 2013"}, {"Title": "outstanding", "Author": "slim w", "ReviewID": "R6NCMF1MY5C29", "Overall": "5.0", "Content": "Love the phone no real problems with it i recommend anyone who looking for a great phone for a low price just wish they made cases for it", "Date": "February 16, 2013"}, {"Title": "I really need a phone like this!", "Author": "GTomi001", "ReviewID": "R2MWMKA52XS3RW", "Overall": "4.0", "Content": "Hi everyone!I don't understand american market.\"They sell\" their product via Amazon,but I can't buy it,cause I'm from Europe...or what?We've got GSM and HSDPA as well.So what's the problem?I've got money.I've got account.I really want a \"cheap\" but useablephone.Can anyone help me,please?Cheers", "Date": "January 23, 2013"}, {"Title": "Excellent Product", "Author": "Javier Antonio Pardo Ocampo", "ReviewID": "R20NX0IPBS4BSU", "Overall": "5.0", "Content": "It's a great phone, this phone is lightweight, fast and high throughput for applications that need. Thank you very much.", "Date": "November 20, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0090I9SC4"}}