{"Reviews": [{"Title": "A fabulous used smartphone", "Author": "Gordon Halfpipe", "ReviewID": "R3B1HOHUZNFEPQ", "Overall": "4.0", "Content": "This was far less expensive than even the cheapest, shabbiest iPhone 4 I could find, and it's bigger, yet lighter, and more powerful.  I bought it as a Ting phone, and the overall bargain is pretty amazing.  My 12 year old daughter could not be more thrilled, especially since her more wealthy friends have the iPhone 5.  Side by side, this more than holds its own.", "Date": "July 21, 2013"}, {"Title": "Pleased", "Author": "Amazon Customer", "ReviewID": "R2DIORYFJZ73LS", "Overall": "4.0", "Content": "very please with phone and appearance of it. I receive this product within 2 days of placing order. very happy", "Date": "February 6, 2013"}, {"Title": "Great phone, defective USB charging port", "Author": "Peter", "ReviewID": "R36V3AV3G2VGIE", "Overall": "3.0", "Content": "UPDATE (3/2/2014): After a little over a month, I am beginning to see the USB port charging problem as well. Sometimes it would charge when I put it face down. At first, I thought it was the USB cable itself, but once I tested the two cable that came with the phone... it wasn't the cable at all. It seems like the USB port is a design flaw and the only way to charge the phone is to take the battery out and put it into the charger like a camera battery. I'm now testing it with another USB cable I bought today to see if that would fix the problem.I didn't purchase this through Amazon. The phone is amazing in design and the screen is beautiful. About a few days after getting the phone, I updated to Jellybean 4.1.2. Prior to updating my phone had that TouchWiz crashing problem. It became apparent that it's a firmware issue with Samsung affecting most users who uses the Jellybean update. The design is thin and very light. I use the phone for e-book reading, calling/texting, checking emails and weather, and writing down my tasks. It's so much more efficient than the iPhone.This is coming from a long-time Apple user with iPhone 4 and iPod touch since 2009.I am rating this as a four-star because the phone has a tendency to restart itself when TouchWiz crashes a lot, and it's quite annoying.", "Date": "February 4, 2014"}, {"Title": "Worht the purchase!!!", "Author": "Melissa Blakely", "ReviewID": "R1BKF7OKYOYWW9", "Overall": "5.0", "Content": "I absolutely love it!!!! The phone is near perfect condition and works excellent. Being able to purchase off Amazon is great!", "Date": "January 9, 2014"}, {"Title": "Bad Charger Port", "Author": "Jarod", "ReviewID": "RWCD6HTQ12PPF", "Overall": "2.0", "Content": "The charger port would not work at random times. Sometimes it charged and worked perfectly fine but the longer I had it began to stop working more frequently.", "Date": "October 16, 2013"}, {"Title": "Great phone!", "Author": "Petrina Beugre", "ReviewID": "RZGJE9LO0EW5Y", "Overall": "5.0", "Content": "So far this is a great phone for my daughter since her other phone is no longer working and I could not upgrade yet to get another phone.  Actually the seller was right on target in his description for being honest regarding this phone.  No problems as of yet and my daughter loves it!  She received many compliments even though this is a used phone.  I am a fan of Samsung Galaxy and I thank the seller for being hones and shipping the phone on time.", "Date": "October 7, 2013"}, {"Title": "ESN not clean", "Author": "CHARLOTTE ROBINSON", "ReviewID": "R1DIT4XNQKQTJ7", "Overall": "1.0", "Content": "The phone came in great condition and in an orderly fashion, but when we went to get the phone turned on it was flagged as stolen. The ESN was NOT clean.  Yes, there going to refund us or money, but the issue for me is not the money it's the principal and I will not be buying anything else from this vendor.", "Date": "March 22, 2014"}, {"Title": "Rating the Seller and the Phone", "Author": "Stew Meat", "ReviewID": "R1VI44EAAGX815", "Overall": "5.0", "Content": "Perfect condition.  This was refurbished and was better than expected.  I didn't think I wanted a phone this big, but I'm glad I ordered it.", "Date": "March 8, 2014"}, {"Title": "great but...", "Author": "Chardai walker", "ReviewID": "R2YA3KXE2TWUHZ", "Overall": "3.0", "Content": "Saller didnt mention a few things like Battery had shortage charger did not work but fixed that little problem Great pphone", "Date": "March 3, 2014"}, {"Title": "Not a bad phone", "Author": "Emily", "ReviewID": "R1G4JSJJ6PQJDE", "Overall": "3.0", "Content": "I've had this as my main phone for a while now, buying it as a replacement for an older smartphone.  It's running Jellybean and does fairly well.  I would say this is best as a basic or first smartphone, especially if you don't want a contract.  Battery time is decent, depending on the apps running.  My biggest gripe is the size, it's just a bit too big for me.  My next one will definitely be smaller!", "Date": "February 25, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009XUFHK6"}}