{"Reviews": [{"Title": "soso", "Author": "lulu", "ReviewID": "R23CJVZIS9DRP5", "Overall": "3.0", "Content": "The battery life on this phone sucks !!!!! It charged pretty fast but battery drains very quickly .not sure if I will keep..its an decent phone nice HD screen . BTW the camera sucks too if you like to take pics I wouldn't recommend but if you just want a phone to use as an phone (call,text) I guess i would recommend. On the good note the phone is pretty fast and I should prov insert that this phone uses an micro sim card .I had to get my original sim card cut and the battery is non removable .", "Date": "April 18, 2013"}, {"Title": "Problems and value", "Author": "Ryan", "ReviewID": "R1JFG4JKC2KLOA", "Overall": "3.0", "Content": "The problems with this phone is quite obvious. The battery life is quite significant and drains quickly. Widgets help a little and the jellybean update helped it but not that much. It would be a much better phone if it had a better battery. On the good side, it got a great screen, alright camera (need to be sunny or bright outside), slightly faster than an iPhone 5 and keep in mind the iPhone 5 has the same battery life as the atrix hd. I would recommend this phone if you can't get the galaxy s3 or iPhone 5.", "Date": "May 18, 2013"}, {"Title": "First smart phone I've owned. Very pleased with its features and speed.", "Author": "Pete D.", "ReviewID": "R1QWLU5TIR9PWB", "Overall": "5.0", "Content": "First smart phone I've owned. Very pleased with its features and speed. It does however drain the battery quickly when using data. I don't know how other smart phone battery's compare. Battery drain on stand by is reasonable. Crystal clear video with the HD screen.", "Date": "July 29, 2013"}, {"Title": "Poor overall performance", "Author": "Chris Xu \"Chris\"", "ReviewID": "R3EACSP1H9DCK8", "Overall": "2.0", "Content": "this phone has \"good\" specs but don't be fooled. specs are not everything. i had this phone for about 7-8 months and it was pretty bad. it claims it has a 1.5 ghz processor but this phone was very very slow. apps crashed all the time. probably because it only had 1 GB of ram. sd card slot was unreliable. it had trouble reading the card much of the time and i would have to take it out and insert again sometimes 10 times to get it to work. battery life is awful, especially the standby battery life. even if you don't use it it drains very quickly. the smartactions on the phone don't really help either and are pretty annoying. camera is slow and not very good. needs a lot of light to be effective. the only real good thing about the phone is that it's very durable.i own an iphone 4s now and while the specs on paper lose to the atrix hd, it beats the atrix hd in every way in real world usage. i still think both android and iphone have their pros and cons and i'm not a \"fanboy\" of either but at least for me, the iphone 4s definitely beats the atrix hd. i'm not sure if it is really better than a galxy sIII/IV or htc one or nexus 5 etc, but for now, i'm sticking with the iphone.", "Date": "December 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009DNTXFI"}}