{"Reviews": [{"Title": "Excellent phone in Windows 8 Space", "Author": "rpv", "ReviewID": "R3MAYTCV93MJVQ", "Overall": "4.0", "Content": "HTC 8X is definitely a incredible design and ergonomic. Windows 8 apps are a welcome change from iOS. Among the three ecosystems, I prefer Android, Windows 8, and iOS in that order. I got access to few Windows 8 phones to review. I will try to review them, but since I have not used for a period longer than a month I am not reviewing for reliability. 4.3\" Super LCD 2, 720x1280 resolution, 342 ppi, Corning Gorilla Glass 2. Glass 2 is overlooked. Glass 3 is in the making and supposed to be even better. Stating following because this is highly underrated in reviews. From Corning's Gorilla Glass specs; WHAT MAKES GORILLA GLASS SO DAMAGE RESISTANT? The unique composition of Gorilla Glass allows for a deep layer of high compressive stress (created through an ion-exchange process). This compression acts as a sort of \"armor,\" making the glass exceptionally tough and damage resistant. Ion exchange is a chemical strengthening process where large ions are \"stuffed\" into the glass surface, creating a state of compression. Gorilla Glass is specially designed to maximize this behavior.1.5 GHz dual-core Qualcomm Krait processor, 16 GB internal flash, 1 GB RAM NO microSD slot! Battery is 1800 mAh Li-ion battery. Compared to a high end Android Galaxy Note II, which has a battery of 3100 mAh Battery. Battery is also not removable. __Not having a storage expansion slot is a bummer for lot of people! Not being able to remove battery is a double bummer.__ 8 MP camera is awesome, and HD videos were fantastic. For me, storage expansion and removal of battery is very important, so I was disappointed. This is the downside the unibody design. This is the reason for me giving a 4 star review.I have used in the past extensively HTC Titan I and II which is pre Windows 8 (7.5) and I was surprised it has become more buttery smooth now. Apps are very smooth on 8X even compared to Nokia Lumia series. Apps are limited in Windows 8 marketplace. Yes, we have heard this a gazillion times. I tried with Navigon which turned out to be great in giving voice directions.Engadget wrote after the release: \"Yes, the 8X is a fantastic ambassador to Windows Phone 8, but after using it for several days, we're longing for a similar phone from HTC running Android -- at least until a stronger app ecosystem develops for Microsoft's latest mobile OS\" This is a chicken and egg situation. Unless more phones are sold, developers don't have incentives to write apps. Apps are less now, because people are not buying in big droves. Windows Phone is now (early-mid 2013) the third-leading mobile phone platform, more than tripling its market share year-over-year. One recent report I read Android and iOS are ahead in games with 162.1 and 37.4 million shipments in 1Q13 and Windows phone came in 7 million. This is more than double from previous year. I really hope for Windows 8 platform to surge ahead because having a 3 way competition with iOS and Android is good for the ecosystem.", "Date": "May 18, 2013"}, {"Title": "A simple smartphone with character", "Author": "Ricardo Melo", "ReviewID": "R8ABZ274HSLTV", "Overall": "4.0", "Content": "The first Windows Phone 8 smartphone coming to market is always a liability. And we can say that HTC and quickly grabbed this opportunity well.Focusing on hardware me, and leaving only a few small lines for the OS, I can say that HTC has struggled to put this piece of technology in our hands. Since the quality of construction materials used, so I took the 8X was led by a sense of beauty and security. All want a telephone robust and durable, but preferably not resemble a brick. HTC Mission accomplished!This beauty combined with some of the latest technological specifications, such as a Super LCD2 screen, 720p 4.3-inch screen, a dual-core Snapdragon S4, NFC and supported by a sound beatsaudio, we are undoubtedly facing a high-end Windows Phone.Of course these days, the issue of high-end becomes increasingly relative, as the speed of technological innovations from major manufacturers starting to become supersonic. We can not wonder too if our new smartphone after 6 months no longer feel so \"new\", but since it accomplishes its goals, we always say that this is a good phone. And here at HTC with its 8X not let your credit for more alien, not letting us look bad.The Super LCD2 has excellent viewing angles, combined with a more than sufficient resolution (341ppi), not disappointed, either inside or outside, where despite the brightness, remains excellent viewing ease. The Gorilla Glass assures the durability and beauty of these characteristics covering practically the whole front of the body of 8X.This body is gifted with slender lines and curves, which fit like a glove (silk) to our hands (regardless of size). The ratio of the screen size and thickness was really well done. Nothing to say also in the use of materials. Give a feeling of robustness perfect (despite the rubberized surface is subject to certain risks ...) and security.Hardware buttons, the needed: power, volume and much desired button dedicated to camera. Just a reminder to the stylized and slightly projecting power and volume buttons, which are sometimes not the easiest to find ... at least in my case! At the bottom we find the microUSB standard, right next to the microphone. At the top, the output 3.5 mm microphone secondary and side access to micro-SIM. And nothing more. Simple and effective.Inside we find an 8X 1800mAh removable battery, which provides us energy for a day of use under normal conditions. On a more personal note, I would like to start seeing better times and longer use. It seems that battery technology has not advanced much or not be a major issue? ... We also have an internal memory of 16 GB, without physical access, the minimum needed for normal use. Anyway, we can always bail us of cloud storage, with services like Microsoft Skydrive.Speaking of cameras, we have a page with 8 MP f/2.0, allowing us to take pictures acceptable in low light conditions. The quality of the images is one that HTC has accustomed us. Good images with detail and vibrant colors. More than enough to post our photos in various social networks. The video is also acceptable, HD 1080p / 30 fps. Just did not like the service in low light conditions, revealing image with enough grain. The front camera is only reasonable, with 2.1 MP, finding that the 8X deserved something a little better.Not going deep into the universe of Windows 8 OS, I can only say that a smartphone is easy to use, with the buttons as usual Back, Home and Search (customary and compulsory for all Windows Phone), and which easily gets used. The entire interface is simple, clear and easy to habituation, which makes this 8X accessible to anyone, whether beginners or advanced users.One last reminder of something \"strange\". The hardware includes an FM radio module, which can not be used due to lack of available software! Blame Windows 8 OS or just something \"forgotten\"?In short:The 8X has a fantastic body, shows up well dressed, but not just appearances. Accompanied intelligence enough to compete with the best smartphones on the market to date. Specifications top and helps complete enough that the 8X remains present for some time. And if you're looking for a smartphone easy to set up, use and durable, it can be yours.Most:ScreenQuality constructionPerformanceBeautyEase of UseThe least:BatteryInternal MemoryLack of FM radioStore applications undeveloped", "Date": "February 19, 2013"}, {"Title": "Runs Ok", "Author": "Gabriel Vicoveanu", "ReviewID": "R2CN3FGCJCHHKO", "Overall": "5.0", "Content": "It is surprisingly slick and fast. The battery it is acceptable. Bottom line I think it is a very good phone", "Date": "May 20, 2013"}, {"Title": "very good cell phone", "Author": "Xuanyu Chen", "ReviewID": "R23EG4ICY1EX41", "Overall": "5.0", "Content": "very good cell phone, but sometimes if I use my cell phone during charging, it's gonna be very hot.And what I think about the Windows Phone and iPhone.. WP is a new system, so there are not so much APP in the app store, but it's cheaper than iPhone a lot, also it's a useful phone.iPhone is expensive, but many APP, for girls one of the reason to choose iPhone is many many many cute and funny cas~~ :DThis cell phone is very good, and pretty, but if l have enough money I would like to get an iPhone =3=", "Date": "December 23, 2013"}, {"Title": "Not as good as you'd think", "Author": "Eric L. Willard", "ReviewID": "R7XPVS0D0BUX6", "Overall": "2.0", "Content": "This phone is aweful. I can't install iHeartRadio because the WVGA screen is incompatible with the app. That means no fm radio programs that I listen to every day. Pandora downloads at 3mb and has zero fm radio options.When you plug in the charger, it vibrates every few seconds and I can find no fix for it online. At work it's constantly vibrating and annoying. While sleeping I have to unplug it so t's not vibrating all night. There is no indication that it is in fact charging while plugged in.When you are charging it, it is impossible to turn it off so it can charge properly. With the window/screen stuck open, it takes longer to charge. It tries to dim down but the charging forces it back open. Also, when you are charging, if you press the power button to close the main screen, it will open up on it's own and will remain open as long as it's charging.After 3 hours on a plugged in charger, the phone refused to charge and died. It will only charge on the USB charger.If you have an app running, there's no icon to touch to see what apps are currently running in the background that are killing your battery. Pandora is one example. It lets you pause the app but not close it entirely.The Facebook app is very limited and is almost completely text based. The images my friends upload or links they share show up as text messages. You have to click 2-3 pages to see the actual post.I've only had one Android smartphone before and will be returning my Windows phone for a Droid Razor (HD or MAXX HD).I tried going to the Explorer icon and it kept asking me to log onto my microsoft account and I was already logged into it. Also, Xbox/windows live is always logged on. It then forces you to use Bing which is a painfully boring search engine.Only 16GB storage and after activation, it said I had just over 11Gb..Where did 5 whole GB go?Zero Micro SD card slots so don't plan to expand the memory.The screen is flashy and the icons nice to look at. That's all this phone is. A pretty piece of nothing.EDIT:After taking my phone back, I told the tech guy the same thing as in my review. He laughed and said he has heard the same things from multiple people. They took it back, no questions asked. I got my Samsung Galaxy phone in it's place and love it.", "Date": "June 10, 2013"}], "ProductInfo": {"Price": "$699.99", "Features": "GSM 850/900/1800/1900; HSDPA 850/900/1900/2100\nS-LCD2 capacitive touchscreen, 4.3-Inch\n8 MP Primary Camera, 3264 x 2448 pixels, autofocus, LED flash; 2.1MP Secondary Camera; Video: 1080p@30fps, continuous autofocus, video light\nOS: Microsoft Windows Phone 8; CPU Dual-core 1.5 GHz Krait; Chipset: Qualcomm MSM8960 Snapdragon; Internal Memory: 16 GB storage, 1 GB RAM\nBeats Audio sound enhancement; Browser: HTML5; GPS with A-GPS support and GLONASS; Wi-Fi 802.11 a/b/g/n, dual-band; Bluetooth v2.1 with A2DP, EDR; NFC", "Name": "HTC Windows Phone 8X Unlocked GSM Smartphone with 8 MP Camera, 4.3-Inch Touchscreen, Dual-core 1.5 GHz, 16GB Memory, Wi-Fi and GPS No Warranty - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41vdDkw6-mL._SY300_.jpg", "ProductID": "B009E3RSRM"}}