{"Reviews": [{"Title": "Works perfectly", "Author": "uberammergau", "ReviewID": "R2ZX826JQ2LS9M", "Overall": "5.0", "Content": "Ordered this iPhone 5 after much research and finding that it's the ideal phone for traveling because it is unlocked and it has the most LTE bands covered compared to the Euro/Asia GSM and US AT&T; models. It has worked perfectly although currently I'm traveling to places with limited LTE coverage, so I can't say much about how fast it loads up on data connections. A few things to consider when moving from the 4 and 4s (per my experience): the wallpapers will look wrong so you'll need to get new ones especially made for the iphone 5's screen size; on the Converter that I use, I'm glad to see more of the currencies I've selected, without having to scroll down; and, the lighter weight kinda takes getting used to. It really is lighter than the 4/4s and is wonderful in that regard. For music lovers, I recommend getting the bigger memory models as the 16GB one easily get filled up.", "Date": "February 5, 2013"}, {"Title": "Iphone is a time capsule", "Author": "Chad", "ReviewID": "R3JLG6EY2NWIJT", "Overall": "3.0", "Content": "Iphone was as revolutionary as the Mac Plus was when it first came out.  But it seems Apple is once again letting the competition not only catch up but pass them up once again.  The iphone 5 sure its a quality device, and it works and its very easy to use.  But when you get used to what the competition has to offer the iphone seems limited and in a lot of ways just silly.Pros:  Quality screen, very sharp.  Tons of quality apps from the app store  Soldi design, nice sounding speakers for a phone  neat when using it with an apple tv and airplay  Nice CameraCons: Screen is too small after getting used to one that is larger  The overall user interface is outdated and way too limited (Live widgets to show mail, texts etc on the main screen)  Siri is neat but overall takes too long to interact with vs doing things yourselfI was an Apple fan boy,  I really liked their phones from 2007 - 2013,  but now that I experienced what the competition has to offer.  I think I have changed sides.  Now the Ipad,  that has no competition so far.  The competition is still really far behind.  But for the phone, Apple is in trouble.", "Date": "June 21, 2013"}, {"Title": "Watch out who you buy from!!", "Author": "wendy teal", "ReviewID": "R3M1DAB07WL626", "Overall": "2.0", "Content": "The seller that I bought from wouldn't ever email me back and once the phone got here, it had nicks and dings in the outer metal and the screen is messed up in one spot beneath the surface and now the screen can be bended in on the side and top right corner. You get what you pay for I guess.", "Date": "March 16, 2014"}, {"Title": "Shipping in one day not.", "Author": "DAMON SALVATORE \"KILLER\"", "ReviewID": "R3IEILCJT40VZV", "Overall": "5.0", "Content": "I ordered an htc evo phone. They said this phone Was a 10 out of 10. It was pretty nice", "Date": "August 4, 2013"}, {"Title": "a good experience", "Author": "Met", "ReviewID": "R1IS0RGCK4VJMI", "Overall": "5.0", "Content": "He is a honest person. And he responses very quickly to the question. I may make a deal with him again.", "Date": "February 16, 2013"}, {"Title": "Greatest phone ever !!!", "Author": "Emad", "ReviewID": "RCXZOKTIYWUQV", "Overall": "5.0", "Content": "i love it ,, it is a sold phone , have great look ,, i recommend it to all my friends ,, but they stuk with android !!!", "Date": "January 20, 2013"}, {"Title": "Never buy From this Seller", "Author": "David Asman", "ReviewID": "R2U4SGSA02VLSL", "Overall": "1.0", "Content": "Had the phone Labled as a verizon phone they lied it was not actually got a Tmobile phone! People if you read this Verizon phones do not take sim cards. so heads up don't buy a phone here for verizon if it requires a sim card.", "Date": "August 20, 2013"}], "ProductInfo": {"Price": "$649.95", "Features": "With the iPhone 5, Apple equips this smartphone with a larger 4-inch retina display, adds 4G LTE high-speed data, and includes a faster A6 processor\nAlso features global roaming, Siri voice assistant, AirPlay media streaming, an 8-megapixel camera with HD recording, and a HD front facing camera\nThis model comes with 32 GB of internal storage and supports WiFi connectivity\nThe iPhone 5 offers a slim and stylish design that is both lightweight and easy to carry\nOffer includes USB Cable and Wall Charger", "Name": "Apple iPhone 5 32GB 4G LTE White - Verizon", "ImgURL": "http://ecx.images-amazon.com/images/I/31%2B96a-0UHL._SX300_.jpg", "ProductID": "B009F9MZ64"}}