{"Reviews": [{"Title": "Good phone at a good price and no contract needed", "Author": "Winter", "ReviewID": "R1J2T32EADDHOJ", "Overall": "4.0", "Content": "I am on a month to month plan with Verizon and needed to replace a Motorola Razr 3 phone as it is no longer supported by Verizon's tech support people. I did not want to commit to another 2-year contract with Verizon to get a new phone so buying this one was an easy decision. It also sells for less on Amazon than the cost from Verizon with their pseudo discounts.The phone itself has much better reception than the Motorola Razr 3 or Blackberry Storm phones which is important as where I live in Monterey the reception from Verizon Wireless cell towers is often spotty or does not exist at all.The picture of the phone is deceptive. I thought the phone would be a lot thicker than the Motorola and it is not, even with the larger battery in the LG phone. The phone is only 0.75\" thick and fits perfectly in the palm of my hand and also slips easily into a pocket.Battery life is roughly double that of the Razr3 from Motorola and for that of the Blackberry Storm. Not having to recharge the phone every night is good thing as is not having to plug it into the cigarette lighter in the car when using it while driving.Bluetooth works as it should and was easily paired in my Prius and GM truck for hands free talking while driving. Having used this feature in two vehicles I would not want to go back to using a Bluetooth headset while driving.The phone appeared to be new but came in a non-descript box without any instructions or a warranty card so it is not a straight from the factory phone that is being sold.", "Date": "September 13, 2012"}, {"Title": "Verizon LG VN150 Revere, new or refurbished", "Author": "Dennis Friedman", "ReviewID": "R2HQH5C0STX8EJ", "Overall": "3.0", "Content": "It does work with my Verizon contract, I had 6 months yet to go, I really like this cell phone, it has a nice large display, large buttons, all I needed was a basic cell phone, this fits the bill, I like putting all my contacts in groups & I had seventeen contacts in one group and it still was not full, no other cell phone I have owned has done this, speed dial let you chose which number you would like to use for each contact, be ready as soon as you activate the phone it will ask you to chose which settings you want, also in your setting set it to when your receive a phone call it \"Rings & Vibrates \" for the times when it's in your pocket, hooked on your belt or covered by a coat.  Also this would also be a nice for our Seniors who can't see very good. Thank you  UPDATE,  I had bought a refurbished cell phone and I new it, the problem with this model phone, seller claims that when you push the send button when programming the cell phone, it reprograms the phone in to excepting automatic up dates, that is incorrect software and ruins the cell phone, I have had this happen to me two times, the correct way of programming it is, do not push send to program the cell phone, there is supposed to be a paper in with the cell phone that explains this.  He knows of other sellers that are selling refurbished cell phones as new, if you find a cell phone that price seems a little low, call the seller and ask them if it is new or refurbished, I called another seller looking for a new cell phone and asked this same question, as of yet the seller has not returned my email,Thank YouUPDATE,  LG VN150 RevereIMPORTANT  if you own this cell phone you must make this change as soon as possible,  if you are buying this cell phone do this just after you activate  your cell phone, if it starts to do this updates, stop it, do this1. Open the flip and press [MENU].  2. Press Settings & Tools.  3. Press Phone Info.4. Press Software Update.  The two options shown will be Status and Check New.Press Status to see the status of a download or update and see information on the last successful update. If updates have not yet been performed, status information will be unavailable.Press Check New to check if any new software updates are available to download. If a newer software version is available, it will automatically begin downloading after 30 seconds or you can begin the download immediately by pressing ok, look for options icon in the lower right hand corner and select# 2  reject, ( if it does this up date it will ruin the cell phone )the users guide is what I copied part of this from, on page 94Thank you", "Date": "December 6, 2012"}, {"Title": "Great Basic Phone with Excellent Camera", "Author": "Patrick Mc Kenna", "ReviewID": "R17SLC832AFHGG", "Overall": "4.0", "Content": "Now retired, I realized I didn't need al features offered by a smartphone, and could save considerably on my monthly bill.The basic features of just phone, camera, occasional texts, time, date & weather and navigation suit me just fine.  It's durable and doesn't drop calls, and voice clarity is better than my Droid HTC. Very happy with it.", "Date": "November 24, 2012"}, {"Title": "Great phone", "Author": "Ron Beasley", "ReviewID": "R18HP8ZCDUTKRH", "Overall": "4.0", "Content": "Excellent sound quality and reception, large keys, thin and light, very long battery life, easy to use features. Suits all my needs. Only shortfall is poor speaker phone quality. Otherwise, great little phone.", "Date": "October 23, 2012"}, {"Title": "Good basic phone", "Author": "Daniel J. Albert Sr.", "ReviewID": "RB12IOCQQ4WML", "Overall": "5.0", "Content": "If you don't want a smart phone, this is all you need.All the fundamentals are well made and work.Good signal quality.", "Date": "December 8, 2012"}, {"Title": "Better than expected", "Author": "Connie Santinello", "ReviewID": "R3H72ZDQCL1JVU", "Overall": "5.0", "Content": "almost like new.  Much better than I expected for the price. Transfer of info from old phone was seamless. Great value.", "Date": "November 19, 2012"}, {"Title": "lg works for me", "Author": "dabill", "ReviewID": "RL6QHNGWZ402C", "Overall": "4.0", "Content": "this is my second lg revere phone lost the first one' phone arrived on time restored contacts an has worked just like the first one iam very satisfied with this phone  an the seller.", "Date": "February 20, 2013"}, {"Title": "LG review", "Author": "Samuel Torres \"Samuel Torres\"", "ReviewID": "R8VJYNVMBVZ6R", "Overall": "4.0", "Content": "This is a good phone that works fine with no problems what so ever and I would recommend this phone to anyone.", "Date": "February 9, 2013"}, {"Title": "replacement phone", "Author": "BDL", "ReviewID": "RV9MCISGBZKQB", "Overall": "5.0", "Content": "My husband washed his phone like this one in wash. Did not recovery well. Ordered thisphone since it was like his old one and he does not want fancy gagets. It works great.It was in perfect condition. Also much cheaper they buying from our cell store since our contract was not ready to renew.", "Date": "January 19, 2013"}, {"Title": "So far so good", "Author": "P. Morgan", "ReviewID": "R3O5DXRHZCQ9FU", "Overall": "5.0", "Content": "I bought this to replace an LG Accolade that broke.  It works the same, so I didn't have to learn a whole new system, but it looks even better.", "Date": "January 16, 2013"}, {"Title": "This is our emergency Home Phone", "Author": "Cindy McCullough", "ReviewID": "R1YYNEFE89BISQ", "Overall": "5.0", "Content": "This phone does just what is needed, a back up phone for the house in case we leave our personal phone in the car, at work, school...  It does the job for much cheaper than Verizon charges for the same phone.  :)", "Date": "November 26, 2012"}, {"Title": "Nice phone perfect for mom!!!", "Author": "Mortgage Banker \"Scott G.\"", "ReviewID": "R1XHIOSREOVBRH", "Overall": "5.0", "Content": "So I purchased a starter smart phone for my Mom LG Lucid,(my daughter 12 loves this phone by the way) we showed her how to use, her grand kids repeatedly keep showing her different features.... but Mom was frustrated and refused to learn how to use the smart phone.  After 3+ months I finally broke down and bought her the LG Revere, she loves it!!! Perfect for the parents that don't want to learn how to use a smart phone.  I read some of the other reviews and agree on one item speaker phone could be louder other than that it's a good, small, solid, flip phone.11/20/12 update the speaker phone is fine I just did not know what button to push, very loud speaker, so disregard my old comment about the speaker phone it works great.", "Date": "November 16, 2012"}, {"Title": "Dont be fooled!", "Author": "Diesel09", "ReviewID": "R38W97IIFLUGAP", "Overall": "5.0", "Content": "you can buy this phone at walmart for $20! the price listed here on amazon is crazy! i bought my dad this phone at walmart for $20! which is half this price! the phone is great, it works on prepaid, and has great internet! just dont be fooled by this price! go to walmart! you get it wham bam and its way cheaper!", "Date": "November 30, 2013"}, {"Title": "Garbage", "Author": "Aply Stefin", "ReviewID": "R2PGRHWHWS4MTK", "Overall": "1.0", "Content": "I bought this phone from Radio Shack. and it quit after 1 month. I called and sent it back to LG. I just got it back today and it isn't any better then when I sent it. Crap. The battery charges but as soon as you unplug it, it's dead and doesn't work. I bought another battery for it. no better. I wouldn't buy anything from Radio Shack. Even the people at LG didn't fix it just sent it back to me in the same shape. Shame on you LG and Radio Shack.", "Date": "June 5, 2013"}, {"Title": "Exactly what I wanted.", "Author": "Helen", "ReviewID": "RW6U4Z13TLO3X", "Overall": "5.0", "Content": "My husband has the same phone and I was unable to find it locally. It arrived perfectly packaged. Everything was in plastic packaging and obviously came straight from the factory. It is a simple phone which is hard to find nowadays. The company even sent info in case I had a problem or needed to return it. I would not hesitate to make future purchases from them. They are strictly A1 all the way and I am very, very pleased.", "Date": "May 29, 2013"}, {"Title": "Arrived sooner than expected", "Author": "fudgbug", "ReviewID": "RZP403B6M7KE4", "Overall": "5.0", "Content": "We ordered this phone on the recommendation of Verizon staff to replace a Smartphone that was more than we really need.  The phone arrived in 2 days (sooner than expected) and new.  The Smartphone is being given to a relative to replace her phone that is 10 years old.  I wonder if the Smartphone will last that long?We took the phone to the Verizon store who set the LG up for us and transferred contacts with no problem.We'd order from this vendor again.", "Date": "May 26, 2013"}, {"Title": "Cell Phone", "Author": "Beth Buss", "ReviewID": "RM73OQ3E2W0GD", "Overall": "5.0", "Content": "I purchased this phone to upgrade as my old Alltel phone was going to lose some features. The phone works very well. I am happy with it.", "Date": "May 17, 2013"}, {"Title": "Great phone", "Author": "Flash", "ReviewID": "R3KBK2194W2T21", "Overall": "5.0", "Content": "I am what people call old school. I had a touch screen phone and had a lot of problems with it. Me more than the phone. I bought this phone and love it. it does everything that I want a phone to do.", "Date": "April 1, 2013"}, {"Title": "Absolutly wonderful product!!", "Author": "P. Welch \"holocaust girl\"", "ReviewID": "RSUYKDIKVXKL1", "Overall": "5.0", "Content": "Bought this product for a family member who had the same phone through a carrier but had lost the phone.  This was the best price I could find for a replacement.  Got the phone and she activated it right away.  Can’t even tell the difference!  Great deal and great product, would buy again anytime!", "Date": "February 25, 2013"}, {"Title": "worked fine", "Author": "Jim wright", "ReviewID": "R36KTB2TVJAHEG", "Overall": "5.0", "Content": "worked as advertised and arrived early I am happy Verizon wanted $230 bought here for under $50 so I was happy", "Date": "February 21, 2013"}, {"Title": "J G cell phone", "Author": "J. G. wyland", "ReviewID": "RWOBSW6QLOJ6R", "Overall": "5.0", "Content": "PURCHASED 2 NEW CELL PHONES ,POOR PERFORMANCE.PURCHASED THE LG LOVE IT,GOOD SOUND,EASY TO READ .I HAVE NO COMPLAINTS WITH THIS PHONE.WOULD HIGHLY RECOMMEND IT TO ANYONE", "Date": "February 3, 2013"}, {"Title": "New phone", "Author": "Cynthia Altieri", "ReviewID": "R2W7TDZVJYGOM7", "Overall": "5.0", "Content": "Phone is just what we wanted. It was shipped promptly, ver satisfied w the price an choices available. Would recommend this company. 5 stars to them.", "Date": "January 12, 2013"}, {"Title": "good cellphone", "Author": "Susan Gordon", "ReviewID": "R3OBTP9JBQ7JN2", "Overall": "4.0", "Content": "Only have this phone a month or so - but no problems.  Replaces the exact one I had (but lost).  It was nice to be able to get this phone for a lot less money than the store wanted.", "Date": "January 3, 2013"}, {"Title": "aminor", "Author": "ANNIE L MINOR", "ReviewID": "R3E1AOI2LY1236", "Overall": "5.0", "Content": "I am enjoying my new LG phone.  It replaced my previous phone that was washed in my pants pocket.  It is providing the service that I am used to in my previous  phone and even more.", "Date": "January 1, 2013"}, {"Title": "Good basic function phone with excellent battery power", "Author": "mcingram \"mcingram\"", "ReviewID": "R38HEWW1QNQRG6", "Overall": "5.0", "Content": "This is a good basic function phone. The battery has a lot of staying power.  If yours doesn't hold a charge; then you might have a bad battery.  My only annoyance is this app that has daily offers.  However, that's more of verizon issue than an Amazon issue.", "Date": "December 28, 2012"}, {"Title": "As Advertised, existing contract", "Author": "Mark Dickson \"Cheap Scott\"", "ReviewID": "R2Y0DNAGO910PZ", "Overall": "5.0", "Content": "I had to send the first one back (different vendor), but this one works well, seems to be easy to manage for my 87 yr old dad.", "Date": "December 27, 2012"}, {"Title": "Great phone for cheap", "Author": "Ashley Hoglund", "ReviewID": "R1B31M66RFNQA0", "Overall": "5.0", "Content": "This was the second revere that I purchased and it works great. The first one got washed (thanks dad!). For a simple phone, it works great and does what it needs to.", "Date": "December 6, 2012"}, {"Title": "Great battery life but poor call quality and lots of dropped calls", "Author": "Tyler", "ReviewID": "R3PLSJXDUT55CY", "Overall": "2.0", "Content": "It seems fairly obvious at this point that the big cell phone companies, particularly Verizon, are refusing to sell quality feature phones (i.e. phones that don't require a data plan) to force people to upgrade to smart phones. I'm not quite ready to pay $30 a month for a data plan I would barely use and so I still have an LG Revere.The phone is reasonably small which I like (I avoid the qwerty phones because of their ridiculously large size and poor battery life). The battery life is also great with the phone able to go for days without needing a charge. That's about where the positives of this phone end. The call quality is fairly bad and if you want to put in a wired headset you are limited to 2.5 mm headsets, which are generally of poor quality and becoming increasingly hard to find. There's no reason for LG and Verizon to do this except to punish people who refuse to get on board with the smartphone bandwagon. The phone also gets an extraordinary number of dropped calls. I'll have full coverage and with no warning at all the call will drop. It happens on average every 25 minutes or so, so during a long call it can happen multiple times.The camera is also quite poor. I had a free feature phone from AT&T; five years ago that had a 3.2 megapixel camera, this one has a 1.3 megapixel camera. LG has also gone out of its way to make it impossible for you to backup your contacts onto your computer. They have discontinued the software that was used to interface Outlook with your phone and they have made it impossible for open source solutions like BitPim to access the address book (backup software worked with previous iterations of this phone like the LG Accolade but not on the Revere).Overall, this is a pretty lousy phone but its your best choice for a new phone from Verizon unless you feel like adding $360 a year to your phone bill.", "Date": "January 5, 2013"}, {"Title": "FALSE ADVERTISING AND UNTRUE!!!!!!!", "Author": "Joss", "ReviewID": "R1JP78BOB44YKQ", "Overall": "1.0", "Content": "This phone DID NOT work with Verizon existing plan as claimed.Therefore, it is still sitting here and not able to be used.Very disappointed in this advertising scheme.", "Date": "March 10, 2014"}, {"Title": "White screen within 15 minutes of taking out-of-the-box", "Author": "Billy Whisenant", "ReviewID": "RZD3BS0FP38DR", "Overall": "1.0", "Content": "This product shipped, and was received sooner than expected. This was a plus, the only plus. It does work on an existing prepaid plan and with assistance set up very easily. By the time I got to the parking lot, The screen was completely white. I've submitted a request to return it and so far have not heard from the seller.This is inconvenient, and hopefully they will do as advertised and reimburse me if not replace this phone  with one that is operable very soon.", "Date": "March 7, 2014"}, {"Title": "Worst phone I've ever had", "Author": "Tarryl Benedetto", "ReviewID": "R3FIJQJDIZC2GR", "Overall": "1.0", "Content": "I expected a basic-use flip-phone but this was worse than any flip phone I've owned. It's so glitchy that while texting if you hit the number \"8\" three times to enter the letter V it will give you three Ts instead. Makes texting hell", "Date": "February 7, 2014"}, {"Title": "Verizon says can't use on my Standard Plan", "Author": "Ratherbefishing \"Terry\"", "ReviewID": "R1376MDY4O6L9G", "Overall": "1.0", "Content": "Seller says in their ad that it will work with existing plans.  DO NOT BELIEVE IT!!!!  Ordered one to replace a bad flip phone on Verizon.  I have standard Family plan with nationwide coverage.  When I received the phone, I noticed it said it was a pre-paid plan phone, but the sellers ad said no problem with this.  It will work on any Verizon Plan.  NOT TRUE.  When I called Verizon to activate, they advised me this phone COULD NOT BE ADDED TO MY PLAN.  IT REQUIRED A 90 DAY PRE-PAID ACTIVATION.  WHAT????  Notified Amazon who contacted seller.  They responded with \"we never stated it would work on a standard plan\".  They did refund my money minus $9 for \"fees\".  I asked seller for prepaid shipping return instructions, but to date have received nothing.  I guess they do not want this worthless phone back.  BEWARE THIS PHONE IF YOU WANT TO ADD TO STANDARD PLAN.", "Date": "January 29, 2014"}, {"Title": "Verizon LG VN150 Revere", "Author": "Stephen W. Bartlett", "ReviewID": "R3CDKFCJG1F2IN", "Overall": "5.0", "Content": "I got this phone for my husband. He is the basic phone kind of guy and he can use this phone with no problems. He works construction and the phone has been very durable so far. I would recommend this phone as a basic phone.", "Date": "December 23, 2013"}, {"Title": "NO CAMERA R U SERIOUS!", "Author": "mark finney", "ReviewID": "R3UMJM70OK5BEL", "Overall": "1.0", "Content": "Ship date read 16th of December being my communication device I needed it FAST! I got it on 19th and the camera is in error mode and don't work The only two things I needed Don't buy from this company they don't come close to living up to what they say or sell!", "Date": "December 20, 2013"}, {"Title": "Great inexpensive flip-phone", "Author": "Diane", "ReviewID": "R3IFQIY6XSWRDA", "Overall": "4.0", "Content": "The phone works very well.  All I had to do to get it hooked up was take it to my local Verizon office and wait about 5 minutes for the salesman to punch a few buttons and voila!  The phone was ready to use.  My only complaint is that it takes longer than my old phone to turn on.  Setting it up with the bluetooth component in my car was a breeze.  I highly recommend this phone for someone who doesn't want to spend a whole lot but wants a dependable cell phone.", "Date": "December 2, 2013"}, {"Title": "LG Revere works", "Author": "C Ellis", "ReviewID": "R2LA53LS20GP5F", "Overall": "5.0", "Content": "After washing my cell phone and rice didn't perform a miracle, I turned to Amazon for a replacement.  Verizon was going to charge $200 for a new one.  I bought this new one on 10/22. At the time of this review,less than a week later, this phone has dropped in price $5.00.Once the phone arrived, I took it to the Verizon store and transferred the account. The Verizon employee verified it was a new phone; she was surprised at the cost of the phone. There was NO charge for the transfer and all my contacts were restored.It's a simple phone, with low monthly charges.  I can keep my land-line and cell phone without paying whopping monthly payments.", "Date": "October 26, 2013"}, {"Title": "Did not work with existing plan,", "Author": "Steve Bilyeu", "ReviewID": "RSN24GZ96H06F", "Overall": "1.0", "Content": "It was a total waste of time and shipping cost. It said it would work with existing plan but was a prepaid only phone.", "Date": "October 18, 2013"}, {"Title": "Good phone, great price", "Author": "gnomelover", "ReviewID": "RK44MKV490G0O", "Overall": "5.0", "Content": "apples to apples, it's a great phone!  The OS is good and easy to use.  Not like the cosmos 2. It's hardy.  But it does not have a slide out keyboard. It's the old school number method.  So if you're adamant about having a keyboard don't get it.Personally, I like this phone a lot.  I recommend it to anyone looking for an affordable phone!", "Date": "October 16, 2013"}, {"Title": "Buyer beware", "Author": "MsFutureAttorney", "ReviewID": "R2YAW5ZJKQN0B5", "Overall": "1.0", "Content": "They said that this phone was new. When I got it, not only had it been previously used, it was still attached to the original line. I couldn't get it turned on. Do not purchase this phone with Universal Cell Services, it was the worst experience.", "Date": "July 30, 2013"}, {"Title": "First time purchasing a used phone", "Author": "S. Doubek", "ReviewID": "R1TOHO7BT03ESP", "Overall": "5.0", "Content": "My husband washed his phone and I tried to dry it but it still did not work.  I had not idea you could purchase cell phones on Amazon but the Verizon Wireless person is the one who steered me to Amazon to purchase a phone for my husband.  Great that the same phone was available which he loved this phone!  Happy purchase and would go this route again.", "Date": "February 19, 2013"}, {"Title": "a nice basic phone.", "Author": "RoRo Young", "ReviewID": "R1CL9I8L0HEKBX", "Overall": "4.0", "Content": "Battery really lasts long. I only need to charge it once a week.Signal is good overall, though when Sandy hit NJ and we lost land phone line and electricity, this phone can only receive phone calls, can not dial out. Only my Iphone (4S) can make phone calls during that difficult time.Very robust. It fell out of my pocket many times, nothing happened besides scratches on some places.I keep it as a second phone besides Iphone since Iphone's battery run out pretty fast.", "Date": "December 6, 2012"}, {"Title": "Everything I need", "Author": "Jason Schneider \"Horology buff\"", "ReviewID": "R3FSY41O6JVLJG", "Overall": "4.0", "Content": "Simple, compact design with all the features I need and no extraneous bells. Navigating the menus was pretty easy, but could be even more intuitive for non-techies,", "Date": "November 29, 2012"}, {"Title": "Charger issues", "Author": "Jeshua", "ReviewID": "R22KQGF40UNMFS", "Overall": "4.0", "Content": "Phone is great, however the charger has some issues. Works, but with minor difficulties. Battery seems to not be 100%, but it's still good.", "Date": "November 26, 2012"}, {"Title": "Verizon LG VN150 Revere-works great.", "Author": "Ana Palomo-Zerfas", "ReviewID": "R1BVMCGPX8UB6W", "Overall": "4.0", "Content": "The phone works great! Looks good as new, doesn't even look refurbished. I was able to it with my existing plan without a problem.", "Date": "June 8, 2014"}, {"Title": "Bad phone", "Author": "timothy guillot", "ReviewID": "R1M0WE2R84TCU6", "Overall": "1.0", "Content": "This phone has no reception and some of the buttons do not work.  Do not recommend this phone to anyone.", "Date": "June 3, 2014"}, {"Title": "Good phone", "Author": "Karen Bowling", "ReviewID": "R11YMV71BKJ90R", "Overall": "3.0", "Content": "Good phone for the beginner cell phone user. If you put it on the speaker a person that cannot hear very well can hear better.", "Date": "May 29, 2014"}, {"Title": "Great classic phone", "Author": "Todd Weaver", "ReviewID": "R22LMF37AGDC5N", "Overall": "4.0", "Content": "This phone is a perfect choice for teens that just need to communicate to Mom, Dad and friends! No hassles.", "Date": "May 21, 2014"}, {"Title": "nice for money", "Author": "GM", "ReviewID": "R181A68QXUH5T2", "Overall": "4.0", "Content": "Still have this phone and is still working well. Bought for a replacement phone.Seems to stay charged well. Ok out of words but review says I have to say more. lol", "Date": "May 17, 2014"}, {"Title": "could of been better", "Author": "jessy", "ReviewID": "R3HD440PYHTHAZ", "Overall": "3.0", "Content": "I gave this phone to someone as a gift. They have problems with the back battery cover falling off. It is also slippery and hard to hold. The preloaded ring tones aren't very loud and are hard to hear. But it some what gets the job done.", "Date": "May 11, 2014"}, {"Title": "good for teens", "Author": "melissa willborn", "ReviewID": "R5U2EA18AN7RP", "Overall": "4.0", "Content": "works very well if you have a teenager that you don't want a smartphone but you want to be able to use it for your family base plan to keep track of phone calls and texts.", "Date": "April 24, 2014"}, {"Title": "Love my phone", "Author": "Lawrence Steinbacher", "ReviewID": "R11HYXP30P0HZ4", "Overall": "5.0", "Content": "Good price on this phone, works well with my Ford SYNC in vehicle, and just the right size to fit in my pocket.", "Date": "April 20, 2014"}, {"Title": "Great phone for the kids", "Author": "SeaBass", "ReviewID": "R12YVSHE7ATA48", "Overall": "4.0", "Content": "Durable, reliable, portable.  Perfect for teenagers when you don't want them having access to the functionalities of a smartphone.  It makes calls, the sound is clear, and it allows texting.  There is a web interface you can access if you have a data plan, but it's so clumsy to navigate that it's almost not worth using.", "Date": "April 16, 2014"}, {"Title": "Great Cases!!", "Author": "Laura", "ReviewID": "R3CHMZ65EKB2TZ", "Overall": "5.0", "Content": "We ordered two cases, one bright red and the other purple.  They fit perfectly and we're loving the fun colors.  Easy to locate in your purse or pocket.  Thanks.", "Date": "April 14, 2014"}, {"Title": "simple phone", "Author": "dwayne yoder", "ReviewID": "RY8H5QMT3Z3Q9", "Overall": "5.0", "Content": "It Works great So I Gave It Five Stares Charge Holds Out Great Very Simpel Phone Big buttons Nice Screen", "Date": "March 30, 2014"}, {"Title": "Phone did not work", "Author": "Cathy Cannon", "ReviewID": "RTAA9KAJT7D06", "Overall": "1.0", "Content": "Ordered the phone and we never received it.... not sure if someone stole it from the mailbox or it was lost prior to getting to me.  Had to request another (filling out another form).  We finally got that phone, plugged it to charge and disconnected charger and phone never charged.  Thought the battery might be bad so we charged again with the battery we had, the charger killed the battery.  So basically the phone did not work and because the charger ruined the other battery we had no phone at all.  Ended up sending the phone back and are waiting for refund.  Will not order from this site again.  We found that Radio Shack had the SAME phone for $10.00 (we paid $54.00 through Amazon).  If you are looking for this type of phone, save yourself the aggrevation and check out Radio Shack.", "Date": "March 22, 2014"}, {"Title": "excellent product for the price", "Author": "Ann M.", "ReviewID": "RSSOT4N18EA5E", "Overall": "5.0", "Content": "The phone is excellent for the price. It has all of the features we need in a cell phone and it was delivered in very good time.", "Date": "March 1, 2014"}, {"Title": "Great Cell Phone", "Author": "Herb Hutchinson", "ReviewID": "R2KBL68UPJNJ9E", "Overall": "5.0", "Content": "This is an easy to use cell phone for those of us who need just the basics in communication. It doesn't have all the confusing and unnecessary bells and whistles that other cell phones feature.", "Date": "February 28, 2014"}, {"Title": "Perect!", "Author": "waytago", "ReviewID": "R22PPZO02FW4FV", "Overall": "5.0", "Content": "Bought this for my Mother for Christmas 2013. She was having trouble learning to use a smart phone. This unit has performed flawlessly thus far.", "Date": "February 23, 2014"}, {"Title": "verizon lg phone", "Author": "greg", "ReviewID": "RM8SUO69EGVTK", "Overall": "5.0", "Content": "the prodic was like new  and easey to use ,  and got sent to me in 3 days ... thank  you  greg papania", "Date": "January 30, 2014"}, {"Title": "great purchase!", "Author": "Teacherfeature", "ReviewID": "R7IK5LEG24JC7", "Overall": "5.0", "Content": "Arrived quickly and was a perfect replacement phone for my husband. It was identical to the one he had and started right up with his charger. He could not have been happier.", "Date": "January 19, 2014"}, {"Title": "Rugged and reliable", "Author": "C. Bertaut", "ReviewID": "RP8CSYXU2N21Y", "Overall": "5.0", "Content": "I have used this phone model for years. Battery lasts and lasts, calls are clear and functions always work. I just ordered this one for my daughter.", "Date": "January 12, 2014"}, {"Title": "Good little phone", "Author": "izzie", "ReviewID": "R2OMUJZWKJXVK7", "Overall": "5.0", "Content": "I bought this phone to use the parts to repair m y phone and i decided to use this one instead. Works great!", "Date": "January 11, 2014"}, {"Title": "This phone was just as advertised.  It arrived promptly and works with my existing plan.  I am very satisfied.", "Author": "Judith D. Carto", "ReviewID": "R78HJUFPR32S3", "Overall": "5.0", "Content": "It is a great phone for those who don't want any bells and whistles.  I can hear well on this phone where I am unable to on an android.  Battery lasts a long time before needing to be recharged.", "Date": "December 22, 2013"}, {"Title": "Good for a simple phone", "Author": "mountaincat", "ReviewID": "R3DKU3HEBDTVCI", "Overall": "3.0", "Content": "Bought this for partner who dislikes fancy phones. It's a basic flip phone and is pretty simple and easy to use.", "Date": "December 20, 2013"}, {"Title": "great phone for basic user", "Author": "booklover", "ReviewID": "RW06O1J4OEXKC", "Overall": "5.0", "Content": "this phone is perfect for my husband. all he needs are the ability to make calls, set two daily alarms, take pictures, and send/receive a text once in a while.  this phone is perfect for him!  and the battery lasts for several days without recharging.", "Date": "December 19, 2013"}, {"Title": "just what I needed!", "Author": "ravenklaws", "ReviewID": "R2PNV46VSKV87H", "Overall": "5.0", "Content": "washed mine, needed a  new one. Better than the one I had. Could start it up with my old contract! Thank you !", "Date": "December 18, 2013"}, {"Title": "Phone shuts of completely when it shouldn't", "Author": "Edgar R. Mallison \"eddianne\"", "ReviewID": "R96TDVAUAXY5I", "Overall": "2.0", "Content": "Is shut off twice without anything being done to it.  I had to take the battery out twice and reinsert it to get it to work.", "Date": "December 6, 2013"}, {"Title": "Phone Returned", "Author": "Michael J. Madden", "ReviewID": "R3TTHA13EXV1J3", "Overall": "2.0", "Content": "Phone did NOT work with my existing Verizon plan. Mistake was quickly rectified however, and refund was quickly issued.I would still like to find a used LG VN150 Revere.", "Date": "December 5, 2013"}, {"Title": "Excellent", "Author": "Gordo Shumway \"Gordo\"", "ReviewID": "R244RS0B3W2ZI8", "Overall": "5.0", "Content": "Great price for good flip phone.  Seems to be all we needed it to be. Seems to be holding up after all these months since ordering.", "Date": "December 2, 2013"}, {"Title": "great", "Author": "Darla Waldron", "ReviewID": "R3U6H3KR1B8UBG", "Overall": "5.0", "Content": "was a replacement for same phone works great, had nor problems transferring  every thing over to it. would recommend to anyone", "Date": "November 20, 2013"}, {"Title": "Very Happy With This Vendor", "Author": "Tom \"Tom\"", "ReviewID": "R20K0VRH5JW1U2", "Overall": "5.0", "Content": "I had this exact phone previously and it worked well with my Blue Tooth Hands Free Phone in my Jeep. The Blue Tooth stopped working and I needed to get a compatible phone which is not an easy task since I like the flip top cover cell phones. The phone was delivered promply and we are very pleased as it works perfectly with the Blue Tooth. We are very pleased.", "Date": "November 19, 2013"}, {"Title": "Okay, but Link-to Cell could be better", "Author": "GeoMasonFan", "ReviewID": "R1XIFIBFY99FMX", "Overall": "3.0", "Content": "The LG Revere 2 is pretty good as a standalone  basic phone. Sound quality is acceptable, although quite loud and on the edge of distortion at times, even with the volume turned down. The issue I am having is that I want to use it with the Panasonic Link to Cell phone system in my home. It pairs well, but the call quality clips and crackles constantly at both ends. Also, when paired, it will not transmit key prompt tones through the Panasonic handset when using a telephone menu. I have no trouble at all with call quality or key prompts with our other cell phones when using Link-to-Cell. The  VN150 works well with my Motorola headset, so Bluetooth seems to be working okay there. Don't know whether it is an LG or Panasonic issue, but thought I'd put this out there in case others have experienced a similar problem.", "Date": "November 14, 2013"}, {"Title": "Perfect", "Author": "Linda Lee", "ReviewID": "RD4PAHVYRZE8Y", "Overall": "5.0", "Content": "I purchased this phone as a replacement for my husband.  He had an identical phone but the USB port was broken and would no longer charge the battery.  This phone connected to our existing Verizon plan with no problem.", "Date": "November 9, 2013"}, {"Title": "FULL DISCLOSURE", "Author": "Marcey", "ReviewID": "R6C8QQRM05JLV", "Overall": "2.0", "Content": "Physically, this is a very nice phone. It feels sturdy, not cheap... it's just nice. Visually, it looks pretty good too (although my \"NEW\" phone came with a scratch on the front). But if you text more than ten times a day, you're going to HATE this phone. First, the inbox and outbox are scrambled: messages are stored as they come in, not the typical conversational way of newer phones. That's not an enormous problem, but the text input really is. There is no way to permanently change the mode of input (say from Abc to T9). Every time you open a text, it will start with Abc, and you will have to go into the settings from the text input screen to change it TEMPORARILY to what you want. There is also one single page of symbols, even when you change the input mode to symbols, which, ps, is the only way to use symbols other than hitting the 1 key repeatedly and hoping you land on the right one. Also, if you go past the symbol you wanted, you have to delete it and start over. Same goes for changing words in T9. If you type \"good\" and you want \"home\" and you accidentally go past \"home\" when hitting the next key, you have to delete the entire word and try again, or go through the whole cycle of words again. You can't highlight words and go forward and back through the list. My new phone was ALSO defective in that a few of its keys are too/not sensitive and I either end up with 4 of the same letter or I have to press it three times before it even registers once. If you don't text, then you'll really like this phone. If you text... beware. Oh, you can also give individual contacts their own ring and text tones, which is really nice! You also can't change the shortcut keys, and they suck. One is a tip calculator, the other is \"shortcuts\" which you can't change, another is a list of \"events\" which seems to just be a list of things you've done, like turn the speaker on and off and change the volume or get a message, and the last is the web browser, which I doubt many people use on flip phones. Overall, bleh.", "Date": "November 6, 2013"}, {"Title": "Love my LG VN150 Revere!", "Author": "Michael H Plunkett", "ReviewID": "RDPDLLECOKSPA", "Overall": "5.0", "Content": "Unlimited txt, talk, and internet. The internet is basic but I can forward my business email to my yahoo account and keep track of that, and I can check the weather and news effectively. You just can't beat it for $50 bucks a month!", "Date": "November 6, 2013"}, {"Title": "Worked out well", "Author": "Wilbur0776M", "ReviewID": "R234N1XFQ0OB73", "Overall": "4.0", "Content": "For me, this was a replacement phone under an existing plan as my original Revere 150 was damaged and no longer functioned.  Was able to put this new phone on my existing Verizon plan without any problems.  Works fine for my limited needs.", "Date": "November 6, 2013"}, {"Title": "Not for existing plans", "Author": "Melissa", "ReviewID": "R1ZCQ8EU5108YQ", "Overall": "2.0", "Content": "It did not work with my existing Verizon plan. The Verizon store said it would only work for pre-paid plans.", "Date": "October 30, 2013"}, {"Title": "only feature phone for verizon I found", "Author": "fred sloan \"fred\"", "ReviewID": "RKBVF3XB8OEM9", "Overall": "5.0", "Content": "great phone except volume of ringer too low, among the almost nill feature phones for verizon. Works with regular plans", "Date": "October 24, 2013"}, {"Title": "Reliable phone", "Author": "CJS123", "ReviewID": "R2LQ2V7V46MGDZ", "Overall": "4.0", "Content": "I've used this phone for well over a year now, and have been very happy with it. The reception is very good whether at home or traveling, and the photos are of surprisingly good quality. I like the variety of alarm options and ring tones, and use the notepad feature often. The glossy black exterior looks sharp; the display screen looks nice and is easy to read. The phone charges quickly and holds a charge well (I do not talk on the phone constantly).Note: The USB line provided with the phone is a charger only, not a data transfer cable. You cannot use this line to transfer your photos (there is a way to do it via the BitPim application; info available online).If you are looking for a reliable flip phone, this is a good one.", "Date": "October 11, 2013"}, {"Title": "Exactly What Was Needed", "Author": "Mishell Magnusson", "ReviewID": "R1HIGXSZ27K8A7", "Overall": "4.0", "Content": "I was looking for a flip phone with current technology.  This fit the bill exactly.  It works with the Blue Tooth in my new car automatically transferring all the contacts and favorites.  Perfect product!", "Date": "October 11, 2013"}, {"Title": "As advertised", "Author": "Roger Knox", "ReviewID": "R2HK028EXVV11O", "Overall": "5.0", "Content": "No problems. Came in mail in timely manner. No complaints at all. Just what I was looking for. Love it when things work out well!!", "Date": "October 2, 2013"}, {"Title": "Works Great!", "Author": "M. DeMond", "ReviewID": "R3NPB8Y9V21WE5", "Overall": "5.0", "Content": "Purchased the phone for my husband and it works great! He easily figured out text and voice mail. Very happy with the phone and price.", "Date": "September 18, 2013"}, {"Title": "Good Phone", "Author": "Prudence Remick", "ReviewID": "R2VNNI0INWYO39", "Overall": "4.0", "Content": "The phone is a good, sturdy phone that is simple to operate.  Just what my husband wanted. It would have been nice the the product was shipped sooner, but it came when promised.", "Date": "September 3, 2013"}, {"Title": "My favorite Cell Phone for the last 4 years", "Author": "william rossi", "ReviewID": "R1BYJIEEV1NEWG", "Overall": "5.0", "Content": "I've never needed a \"smart phone\" . In the past 8 yrs I've had Samsung and Motorola flip phones , but ever since I purchased an LG Revere 4 years ago , I've never wanted anything else. a month ago , my original Lg , started acting up , and shutting off by itself , or the display screen , would start display backwards ( weird ) ..... anyhow , I just ordered another one off Amazon . Works great . Phone arrived in 4 days . Turned it on , immediately did my set-up and activation on my Verizon website , and in 5 mins I was finished.", "Date": "August 26, 2013"}, {"Title": "Was not able to use product, but was refunded money with no problems,", "Author": "John Posey", "ReviewID": "R2DZW0FBA9ZEHT", "Overall": "5.0", "Content": "The phone I ordered was not the phone I needed and I was able to return it with no problems.", "Date": "August 26, 2013"}, {"Title": "Great basic phone", "Author": "Todd Cox", "ReviewID": "R3TAWTBD7Q2VWW", "Overall": "5.0", "Content": "Great basic phone to make/receive calls.  Battery life is amazing (>7 days with moderate to heavy voice call usage) after living with smart phones who crush battery life.", "Date": "August 22, 2013"}, {"Title": "Love the phone", "Author": "sawadee", "ReviewID": "R3OMHA439KWLZV", "Overall": "5.0", "Content": "Phone is in great condition...batteries lasted long as I expected and was exactly was I was looking for..Thanks for a great phone!", "Date": "August 12, 2013"}, {"Title": "frustrated!", "Author": "Paula Fox", "ReviewID": "RTZU9BAQ1181E", "Overall": "2.0", "Content": "This phone was sold as \"New\" but there was no way at all this phone was actually new. We paid quite a bit more money vs. a refurbished phone as we needed it right away and I didnt want any problems. We received it in a decent amount of time but after setting the service up the phone worked for one day, quite, and that was it.  Not knowing the problem we were forced to request both a new battery and then a new phone sent to us. Again, both items were sent in a decent amount of time but what a struggle!!!", "Date": "August 7, 2013"}, {"Title": "battery", "Author": "pat", "ReviewID": "R23C4MSWMHJ6SY", "Overall": "4.0", "Content": "Battery does not work as good as my original phones I purchased from Verizon....As for the phone, I am very pleased with this style of phone.", "Date": "June 28, 2013"}, {"Title": "A simple but standard cell phone.", "Author": "John Clayson Spencer", "ReviewID": "RL67U8PN8OIXD", "Overall": "3.0", "Content": "I chose LG Revere for durability and ease of use.  The battery however discharges too early compared for time used.  For a simple user looking for simplicity, it has a few too many items on some menu's", "Date": "June 19, 2013"}, {"Title": "Verizon LG VN 150 Revere", "Author": "Robert M.", "ReviewID": "R3K2T9IPICHO4M", "Overall": "2.0", "Content": "We bought two of these phones. My wifes phone works well. I could not get mine programed. Even the person at our Verizon store could not make it work. The company we bought it from was very helpful and sent a credit when I returned the phone.I have since purchased a refurbished phone which is working well.", "Date": "May 22, 2013"}, {"Title": "the right stuff", "Author": "steven  shepard", "ReviewID": "R2ZDXCEP6IGP0W", "Overall": "5.0", "Content": "the phone was in real good shape and was able to be used with an existing plan just as advertisedmy mom thanks you", "Date": "April 6, 2013"}, {"Title": "Ringer volume is horribly low at max volume.", "Author": "Larry", "ReviewID": "R1T0LTT975C5A2", "Overall": "3.0", "Content": "There is not much to say about a \"feature phone\" AKA Flip Phone, they make calls. The basic features of the phone are typical of other feature phones, but the ringer is sad! This phone is horribly quiet at max ringer volume.", "Date": "April 4, 2013"}, {"Title": "Amazing", "Author": "priscilla torres", "ReviewID": "R1Q4UUZSAN8GRL", "Overall": "5.0", "Content": "This device arrived on time. It was amazing and worked great for my mom. I replaced it for my moms old iPhone that she was tired of. Cheap and in great condition. Thanks a bunches", "Date": "March 20, 2013"}, {"Title": "Great replacement phone", "Author": "CBreeze", "ReviewID": "R4RAUMQ90P7TG", "Overall": "4.0", "Content": "We needed to replace the same model from Verizon, without signing up for a new contract.  The phone is basic, but works for what we need it for.", "Date": "March 18, 2013"}, {"Title": "Last only a year.", "Author": "Montanawoodsman", "ReviewID": "R3NR1526WTQWSO", "Overall": "1.0", "Content": "Was hard to activate as it had been a prepaid phone on the ESN. Had to call Verizon for activation, as online activation was denied. Only lasted a year, my wife takes very good care of her phone. After a year it stopped taking charge, and started to glitch a lot. Obviously not a good lasting product for my sake.", "Date": "February 4, 2014"}, {"Title": "Good overall - Bad For Texting (if others experience same problem)", "Author": "RJ", "ReviewID": "R3BXRF9ZMTJOQE", "Overall": "2.0", "Content": "This phone is exactly what I expected (paying a price no higher than $50). I purchased this phone solely for texting and calling. Overall, this phone works for its intended purposes...But, I have an issue 50% of the time when I am texting. The phone, for some reason, does not input the correct letter associated with how many times I press a key (#2: 1x=a, 2x=b,3x=c -you get the point). This causes me to delete, and re-attempt, which becomes very annoying and time consuming, especially if it continues several times in a row (occurs often). If you can care less about texting so much, then this phone is a good phone overall (and i would rate it a 3/5). If you purchased this phone with anticipation that you could avidly text, then this phone will annoy the be-jusus out of you :). Personally, I rate this a 2, mainly because of the text issue. If this issue is a glitch based on my individual phone, then I would rate it a 3/5. Hope this helps.", "Date": "February 4, 2013"}, {"Title": "DO NOT BUY from these GUYS", "Author": "Dad of 6", "ReviewID": "R4A4Q1FX9W1L7", "Overall": "1.0", "Content": "The cell phone does not ring . . . the only way you can tell someone is calling is it vibrates . . .  DO NOT BUY...", "Date": "October 7, 2013"}], "ProductInfo": {"Price": "$79.99", "Features": "LG Revere for Verizon's Network Regular Post-Paid or Prepaid (Also PagePlus)\nBluetooth, Speakerphone, VZ Navigator etc..\nTalk Time: up to 420 minutes\nStandby Time: up to 630 hours\nPhone Book with up to 1,000 contact", "Name": "Verizon LG VN150 Revere - (works with Existing Plan / Regular Plan / Post-Paid and Prepaid) VN 150", "ImgURL": "http://ecx.images-amazon.com/images/I/51sH%2BNiEnUL._SY300_.jpg", "ProductID": "B0091POJKW"}}