{"Reviews": [{"Title": "Legit 4G LTE S III", "Author": "Joe", "ReviewID": "R9CMYE1JHXB6P", "Overall": "4.0", "Content": "I don't need to review the device itself, since if you're reading this, you know what you're getting. I just wanted to alleviate any fears that this device is in anyway \"fake\" or a knockoff of any kind.This is:- The International version of the GT i9305, and equipped to handle LTE at the frequencies advertised above- NOT referred to as \"4G LTE\", not on the box or the device. It simply says \"Dual Carrier\", but it works perfectly fine- IF importing (which you likely are), then rest assured that this will work with your 4G LTE provider SO LONG AS THEY ARE PROVIDING THEIR 4G SIGNAL USING ONE OF THE FREQUENCIES LISTED ABOVE. I for one am using it in the middle east, and it works like a charmWhy four stars? The color came as Grey and NOT black. Not returning it since it works fine and I would wait a while for a replacement to reach me.", "Date": "January 8, 2013"}, {"Title": "Very fast", "Author": "Johan Rios", "ReviewID": "R1WLDJL01WKRLJ", "Overall": "5.0", "Content": "Excellent phone, it really is very fast .. I live in Venezuela and here it works perfectly with Movistar. I just had to put the sim card. Also very nice in this color black, in this country S3 is not common in this color. The only detail was the electrical outlet that does not conform to the outlets here, but I bought an adapter and go. This means, this being a European version.", "Date": "October 27, 2013"}, {"Title": "Samsun Galaxy S 3 Rating", "Author": "Everold A. Thompson", "ReviewID": "R3SP19CF26YO9W", "Overall": "5.0", "Content": "I am sorry that it took me so long to experience this Samsun Galaxy phone, because i had a Iphone before, and all i can say is that this Samsum is awsome, it's great and now both my wife and i have one, the samsum is like i said AWSOME. I would not only recommend it to someone but to the hole world, thanks samsun.", "Date": "February 8, 2013"}, {"Title": "Nice!", "Author": "Olavo Arthuzo Duarte", "ReviewID": "R3GWJXJL2LWWQ3", "Overall": "5.0", "Content": "I do not know why people buy Iphones...Sansumg can do much moreA lot of free apps and better hardware.This is it!", "Date": "February 3, 2013"}, {"Title": "user's manual", "Author": "Peter Adeoti", "ReviewID": "R1MAMPLU1BT5HU", "Overall": "4.0", "Content": "Although international, the item's user's manual should still be in the language acceptable to the owner/user. Mine came in German and I live in the US.", "Date": "September 10, 2013"}, {"Title": "Not receving calls at times", "Author": "chandra sekhar", "ReviewID": "R26GJ0AR7CB1UQ", "Overall": "1.0", "Content": "Hey there!! I jus bought this S3 phone in last month and since the starting day i am not receiving calls . My friends are complaining that most of the times its going to voice mail and at times my phone not even rings!! I am missing too many calls and not sure whats going on!! Please let me know if someone is having similar issue and if its been resolved for them?Thank you!!", "Date": "July 13, 2013"}, {"Title": "Outstanding smartphone... nuf said.", "Author": "R. ZUNIGA", "ReviewID": "RQLX60PZ4LU6C", "Overall": "5.0", "Content": "First of all I have to say that I waited long enough to get my S3, actually I have a HTC Amaze 4G which is a outstanding and also underrated smartphone. When I got the news that Samsung released the S3 I9305 with QUAD processor I decided to buy it and I don't regret it at all.This phone is very very fast, comfortable to use, great camera, the multitask feat is quite fast and easy to use. If DUAL CORE version of this smartphone is fast (S3 I9300), well this one is faster (I9305). HD AMOLED screen looks awesome. Video and photo editing tools are very good and useful. Battery life is good but it all depends the way how to use it.Don't look for iPhone cause its getting old and boring. This phone can do much more...", "Date": "April 15, 2013"}, {"Title": "Good", "Author": "alexandrebondezan", "ReviewID": "R3E6VPDCMHE22N", "Overall": "5.0", "Content": "Seller OK....good price and deliver ok. Iam using in Brazil....its work very well. We don't have 4G yet...then I couldn't try this function....We are having 4G in august....Iam happy.", "Date": "June 5, 2013"}, {"Title": "Damaged product", "Author": "Ruben", "ReviewID": "R1QS9C7SCISMYL", "Overall": "1.0", "Content": "The product came damaged.After 3 days of use I had serious issues with the sound of the device, as well the device stopped working completely after 4 days of use!!!!I am now in process of replacement of the product with this seller. I am very disappointed with the service, they are really slow in their replies.Bottom line: I am frustrated + did not have the chance yet to use the phone i bought.", "Date": "June 4, 2013"}, {"Title": "The phone was as the seller Cell Lounge Inc offered.", "Author": "Miguel Uzcategui", "ReviewID": "R1PTBQP1QD340K", "Overall": "5.0", "Content": "The features correspond to the gt-9305, the Lte frequency employed it's for europe, not for the United States, to the buyers from Venezuela the GT-9305 will serve to digitel both 3g and 4g for movistar and Movinet only work on 2g as the 3g frequency for these operators is not supported by this phone, if you want use the S3 for those two carriers chosing  the GT-9300 is more recomended, I'm still reviewing it but so far it looks good.", "Date": "May 7, 2014"}, {"Title": "great cell phone", "Author": "Nathaniel shelton", "ReviewID": "REYM2IES1J7J2", "Overall": "5.0", "Content": "Bought this phone off amazon a loong time ago... and I still use it daily great product and seems to be long lasting", "Date": "January 11, 2014"}, {"Title": "i love it", "Author": "Christian Andres Hidalgo Paredes", "ReviewID": "R1NZYRQ0STRG3I", "Overall": "5.0", "Content": "the phone works 100 % and i dont have any problems with the functions off them and works 100 % in ecuador and is easy to configure  its a exellent phone", "Date": "August 28, 2013"}, {"Title": "It is a nice Smartphone. Very use friendly and light. But the battery duration is not satisfactory.", "Author": "Márcio Antônio Estrela", "ReviewID": "RGIYT1SR0P6Q", "Overall": "4.0", "Content": "It is a nice Smartphone.Very use friendly and light.But the battery duration is not satisfactory.It would be better if the one I’ve received was not with some APPs from Paris installed.", "Date": "May 27, 2013"}, {"Title": "It came on time !!!", "Author": "Peter", "ReviewID": "R3P0UODNGUJO5", "Overall": "4.0", "Content": "First of all everyone knows what he or she buys.The package came on time. (protected and stuff..)However, if it is caught on the border you'll have to pay +- 1/3 of the products price. plus carriers taxes, I speak about UPS. ( Yes they're great delivering, but if you don't want to take no more coins from your pocket it's better to choose another carrier. ( It came in Portugal )", "Date": "May 26, 2013"}, {"Title": "It's okay", "Author": "Johannes Birgir Atlason", "ReviewID": "R21IA0YQKWL34N", "Overall": "3.0", "Content": "My phone came in france language and also the whole manual, so I can't understand it.The 4G did not work while I staid in California so I do not know if it will work here home in Iceland when 4G arrives here.", "Date": "May 20, 2013"}, {"Title": "Only good if not used within the US. No 4G Service", "Author": "I.K", "ReviewID": "R3Q1OCMQTCRDTN", "Overall": "3.0", "Content": "This Unlocked International version is only good for outside of the U.S.  It does not work on 4G in the U.S.  So, don't buy if want to use the phone for majority of the time at home at 4G.", "Date": "May 5, 2013"}, {"Title": "the phone does not work in US", "Author": "Shane Bilpodiwala", "ReviewID": "R3ADJ6QFYLPGS3", "Overall": "1.0", "Content": "the phone does not work on 4G which is total opposite to what the reviews are . very disappointed with the phone. although the distributor was very prompt in delivering the phone. but feel there should have been clear cut information on what to expect in the terms of services.", "Date": "June 11, 2013"}, {"Title": "fast shipping, everything working fine after several weeks", "Author": "Carlos Gomez", "ReviewID": "R2V60TM1GZW95V", "Overall": "5.0", "Content": "everything went through fine, fast shipping and phone is working great, the only thing I could mention is that I contacted them about the seal in the box was broken and they reply right away  \"We open the international phones to see which US adapter to provide\" and an adapter was provided, so far happy with my phone", "Date": "June 8, 2013"}, {"Title": "Zero Communication.  Very Poor Seller.  Failing Grade for in \"Amazon Seller Citizenship\" for this Seller!", "Author": "M. Eads \"Lizel\"", "ReviewID": "R1EKM8QVLUJM93", "Overall": "1.0", "Content": "BEWARE! This seller will not contact you. This seller has ZERO communication. If you have a problem, give up on the idea of ever hearing back from this seller.  Plan on being abandoned, with junk product in your hand, and money gone from your pocket.  What good is a seemingly good price WITHOUT SERVICE is no deal at all. STAY AWAY!  You have been warned.As far as the phone itself?  If yours is not defective.....and/or you are buying this from a seller that is service oriented, it is a great phone.  So, not one to give up, I am buying my nest phone elsewhere.", "Date": "April 23, 2013"}, {"Title": "good phone so far", "Author": "Monsell", "ReviewID": "R1MBYN47D7TG1S", "Overall": "4.0", "Content": "why 4 stars..still have to wait a few more months to see if it freaks out on me but doubt it will. Pretty light feels great in hands but make sure buy a proper case not a knock off to protect this great phone..price could have been $400 since the 4 is out..9305 better buy than 9300 for users in the caribbean works with all 4g network flawlessly...came with EU charger  standard detachable usb cable220v/110v with the american standard adapter so no worries about getting power. Samsung earphones looks cheap but plays average. 1 battery, instructions...starts in german but easily switched to english..unbranded start up screen samsung only...sell shipped faster than expected got it in about 5day. One month phone working well...used it in France as well", "Date": "May 18, 2013"}, {"Title": "Muy bueno rapido y eficiente", "Author": "David \"Tawey\"", "ReviewID": "R1RHIUMFPXZPKK", "Overall": "5.0", "Content": "El celular es muy bueno rápido y eficiente, se conecta con facilidad ha 3g es un lastima que en mi país Venezuela aun no exista 4g del resto me parece un celular muy rápido con sus 2gb de ram, 5 estrellas para el vendedor y para el smartphone", "Date": "February 28, 2013"}, {"Title": "Works Perfect", "Author": "Victor Silva", "ReviewID": "R1NOZN0G6YWH60", "Overall": "5.0", "Content": "I bought it as a gift for my mother, here in Venezuela and it works perfect, it is 100% original.", "Date": "May 31, 2014"}, {"Title": "not international Seller is not reachable", "Author": "Maged", "ReviewID": "R1BO00JLWH5UOE", "Overall": "1.0", "Content": "I tried my international simcard but it didn't work . what is more disappointing that the seller isn't reachable. the contact seller option isn't available after purchasing., I had hard time until I get it then I returned it back", "Date": "May 14, 2014"}, {"Title": "Quad Core Exynos 4412, 2GB Ram, International 4G (but not in USA)", "Author": "Rakesh Ranade", "ReviewID": "R22QBHOLZ6ILNV", "Overall": "5.0", "Content": "before buying if you do little research for the product, you tend to understand more on what youwill or should be getting.  So that said I got exactly what I wantedand I am happy with the phone, just hope that this device will get android kitkat update from samsungrest all is excellent about the device", "Date": "May 3, 2014"}, {"Title": "Product as advertised", "Author": "Jan Tamminen", "ReviewID": "R1750JNWPVU2A8", "Overall": "5.0", "Content": "This is just what i was looking for; not too fancy (pricey) and not too shabby either. I've had newer phones, and bigger, but this just fits the bill. Excellent screen, plenty of memory and good connections and works like a charm. Hmm. how well do charms work? Pretty well, all my charms at least but this is like them. Only better. Well, battery life could always be better (lasts a day). And i'd prefer if this kind of smart phone would come without all the preinstalled stuff (or at least i'd have an option to uninstall them). Overall, i would highly recommend this product.", "Date": "April 15, 2014"}, {"Title": "Great for the UK & Spain", "Author": "Tommy Dee \"EnglishmanHi Tech\"", "ReviewID": "R23LESE8CA050I", "Overall": "5.0", "Content": "I have a Virgin S3 in the US and purchased this phone to update from my Galaxy Ace 2 to use in the UK & Spain, I put in my UK Sim, it works great and with my UK service I can call my UK numbers from the US, and only pay the same as I do in the UK, I do not need the S4/5, this works just as good and is a lot cheaper, I did change the battery for the higher powered Anker Battery as I did the same with my Virgin S3, you cannot go wrong with Samsung, I did buy a Square Trade extended Warranty, so I am well covered all over the World", "Date": "April 9, 2014"}, {"Title": "Great phone!", "Author": "Karan", "ReviewID": "R1CDC0661MZHDL", "Overall": "5.0", "Content": "This is great phone even after S5 has come out. Samsung really hasn't added that many features in the past 2 years to make this phone obsolete. I guess we're reaching a point where just like computers, manufacturers aren't really adding any new features that make the new phones a must have - other than the camera.For people on a budget, I would recommend to save their money and just go with this phone instead.", "Date": "April 2, 2014"}, {"Title": "Love it", "Author": "Anil Patel", "ReviewID": "R3L2ZCFY50XQ62", "Overall": "5.0", "Content": "Love my S3 - upgraded from the Galaxy S finally and this phone exceeds all my expectations. thanks Samsung, great product", "Date": "August 3, 2013"}, {"Title": "One of my favorite phones.", "Author": "DJKat", "ReviewID": "R2O727ZHCNY36P", "Overall": "5.0", "Content": "This thing is fast, responsive, and has enough power for me to play my games on. Even when watching flash videos or playing flash games this thing doesn't stop. Ideal for ROMs and other processor heavy task.", "Date": "July 31, 2013"}, {"Title": "Great mobile", "Author": "Shay Waxman", "ReviewID": "R2Y2SVSPL99T98", "Overall": "5.0", "Content": "Excellent cellular. Very quick and reliable. Looks good even though it's all plastic. Great phone. I recommend it very much.", "Date": "July 27, 2013"}, {"Title": "Worked great overseas for a month in Australia", "Author": "carrerascott \"carrerascott\"", "ReviewID": "R340YK6A8A42ZX", "Overall": "5.0", "Content": "Purchased this specifically to use overseas during a month long trip to Australia.  Stopped at a Telstra store there, got a sim card, and off I went.  Worked perfectly, just as expected.  Would have cost me a fortune to roam with my regular AT&T; phone, so this was a good choice.  Make sure you get the 9305 and not the 9300 as it supports the 4G bands overseas (I believe the 9300 does not).  A great smartphone for sure.", "Date": "July 12, 2013"}, {"Title": "Fast phone", "Author": "Andres Znidar", "ReviewID": "R3Q9NCGMR4FQG5", "Overall": "5.0", "Content": "This phone is fast. The processor's speed is unbeatable and it runs almast any app.I received it very quickly and the price was good too.I'm very satisfied with it.", "Date": "July 5, 2013"}, {"Title": "Excellent", "Author": "Albino", "ReviewID": "R10NKH9NB3P6RE", "Overall": "5.0", "Content": "Amazing speed in internet with 4G. I advise.Impressionante velocidade quando em 4G. Eu recomendo a compra deste ótimo modelo.", "Date": "June 7, 2013"}, {"Title": "Great Deal", "Author": "Robert Hatley \"trebor4321\"", "ReviewID": "R2H80Z3HLQA0ZL", "Overall": "5.0", "Content": "I've wanted this phone for a long time and finally, I found it, at the price I could afford.  After I had purchased it, there was a little discrepancy with the price and the seller, immediately rectified the difference.  I'm very happy and would buy from this seller again.", "Date": "June 2, 2013"}, {"Title": "Awsome", "Author": "Shelley Morgan", "ReviewID": "R3MYKOONJRS6QU", "Overall": "5.0", "Content": "This phone is great I would recommend this phone to anyoneThe only problem I had with this phone was when I turned it on the first time language wasin French so I had to go online to got it translatedThank you Amazon", "Date": "June 2, 2013"}, {"Title": "Perfect Cell phone", "Author": "Castro", "ReviewID": "R2CCPUAJAWQ6JO", "Overall": "5.0", "Content": "I couldn't be happier with this Cell phone.This phone is very very fast, comfortable to use, great camera, the multitask feat is quite fast and easy to use.I recommend this cell phone!!!!!!!!", "Date": "May 13, 2013"}, {"Title": "Great phone", "Author": "Andres Arenas V.", "ReviewID": "R2U500Y7ZFD5RV", "Overall": "5.0", "Content": "I just love this phone.  The shipping was in time and even included the adaptor to the US plug since this is an International version.  Very nice!UPDATE________________My phone started to show randomly a message telling the SIM card was removed (Had to restart, turn off the phone and remove the SIM, put it again and turn on the phone).  It happened almost twice a day (Usually on low coverage areas).  I panicked because I'm outside the US and returning it is very difficult. On several forums everybody suggested the phone was damaged and it needed to be replaced.Well, one person suggested to change the SIM with the phone provider to see if it works.  Fortunately for me it worked.  New SIM  card and now my phone is working as expected.  Excellent phone so far.", "Date": "May 13, 2013"}, {"Title": "A good buy", "Author": "Amazon Customer \"erict\"", "ReviewID": "R1FO1LBUXA1F43", "Overall": "5.0", "Content": "The Galaxy GT-I9305 Is a pretty nice device. It surpassed my expectations easily. It does everything I need in a mobile device, almost.", "Date": "May 13, 2013"}, {"Title": "Its Okay", "Author": "Suguna K. Koduri", "ReviewID": "R2U6M6H9O38MY2", "Overall": "3.0", "Content": "Its a good phone but not that super.I am not sure whether its my service provider issue or not, Some times its getting disconnecting the network.Its working only after i re start the phone.But other features are good and no issues.", "Date": "May 11, 2013"}, {"Title": "Perfect Cell phone", "Author": "David Loor", "ReviewID": "R2VX5CLW6O3TR9", "Overall": "5.0", "Content": "It's a really good cellphone. It has everything I require for my daily basis. I recommend this cell phone. The 2 GB memory improves the performance of S3.", "Date": "May 1, 2013"}, {"Title": "And now what do I do??", "Author": "ANDREA", "ReviewID": "R26KWIPYWFGJJE", "Overall": "3.0", "Content": "Although it's functioning, the phone that was purchased with option I9305 model with LTE ... Settings in the phone displays as a model I9300. And now what do I do??ATTVinicius", "Date": "April 29, 2013"}, {"Title": "Great phone, little pricey but I expected that.", "Author": "ARKcomputers", "ReviewID": "RNCWSJQYUGA03", "Overall": "5.0", "Content": "It does everything I need and more. Couldn't ask for a better first time smart phone. I simply love it.", "Date": "April 29, 2013"}, {"Title": "Just Boss.", "Author": "Allan Smith \"Allan Smith\"", "ReviewID": "R169UE4PDYZWA7", "Overall": "5.0", "Content": "I couldn't be happier with this model. It is indeed the Quad Core, 2GB RAM model, and I just love the power it punches. Why would I want the any of the other S3 model. For United States users it does work on T-mobile. Calls are fine, however data runs on 2G Edge on about 0.25mbps speeds. While still good for email and casual googling, youtube suffers greatly on 2G Edge. But thats fine, if you need hardcore data usage just hit a Wifi hotspot. I find the power tradeoff between the local Dual Core true LTE speeds and this Quad Core LTE Slower 2G (on T-Mobile) a more than worthy tradeoff.", "Date": "April 24, 2013"}], "ProductInfo": {"Price": "$899.00", "Features": "4G Network: LTE 800 / 1800 / 2600 | 3G: HSDPA 850 / 900 / 2100\nSuper AMOLED: 720 x 1280 pixels, 4.8 inches (~306 ppi)\nInternal Memory: 16 GB storage, 2 GB RAM\nCPU: Quad-core 1.4 GHz Cortex-A9\nOS: Android OS, v4.1.1 (Jelly Bean)", "Name": "Samsung Galaxy S III i9305 Black 4G/LTE International Version only LTE BANDS LTE 800 / 1800 / 2600 (Not 4G in USA)", "ImgURL": "http://ecx.images-amazon.com/images/I/51-3W2ztsJL._SY300_.jpg", "ProductID": "B009PJHAS2"}}