{"Reviews": [{"Title": "Amazing value", "Author": "John C. Kulli \"amateur historian\"", "ReviewID": "R23RSLRA8ZOCXP", "Overall": "5.0", "Content": "This phone is amazing for the price.  I purchased two of them, and 8GB memory cards for each.  I got the SIM cards from Consumer Cellular, which DOES NOT CHARGE for SIM cards, just for air time.  Consumer cellular does not support this model phone, but if you go to http://www.unlockit.co.nz you can find the Mobile Carrier Settings that will make it work.  Several reviews claim that the GPS doesn't work, and at first I thought that also.  But get the free app GPS test from the Google Play store and stand around outside for a while.  Eventually the phone picks up the satellites and you're in business.  One other detail:  the phone comes with the default British version of English.  You can change that with another free app.Several reviews complain about the keysize.  This is a minor flaw.Overall this phone does everything pretty well, and for $60 it's a steal.  Just be patient and be prepared to spend some time with Google figuring out how it all works.  There is no user manual.One last thing: there are two SIM card slots behind the battery, labelled SIM1 and SIM2.  The software has them reversed, so if the card is in the slot labelled SIM1, the OS thinks it's SIM2.  Again, a trivial problem.", "Date": "June 7, 2013"}, {"Title": "good", "Author": "Native America", "ReviewID": "R3KT5C7G1BSR9D", "Overall": "5.0", "Content": "the phone i received lives up to the billing BUT its kinda small for my use. i have a 5.0\" screen on my other phone and i got used to it so this phone with 3.5: screen is ok but i need the bigger screen because i do work on it. it's a great phone and everything is great on it, it's just the size. another person asked to buy it from me so i might just sell it. The main option I liked is the dual sim option which is number 1 for me but it's the size. I do recommend this phone because it does what it's supposed to, it's just the size is small than what i wanted.", "Date": "March 28, 2013"}, {"Title": "GPS never worked", "Author": "jimny", "ReviewID": "R1FALHUZ63J66Z", "Overall": "2.0", "Content": "I got the same phone from another store. The GPS does not work at all and It seems that it can not communicate with satellites.  Others are all OK.  Battery life is around 3 days with moderate use. Ringtone volume is so low probably you will ignore it when on the street.", "Date": "April 6, 2013"}, {"Title": "Good Buy", "Author": "Shar", "ReviewID": "R2H3LY28GPVTXC", "Overall": "4.0", "Content": "It worked well. Clear signal and good reception. Had to install a few apps to make more compatible with other androids.", "Date": "April 18, 2013"}, {"Title": "JUST SAY NO!", "Author": "Jim", "ReviewID": "R2V2VWYCGSJ5HW", "Overall": "1.0", "Content": "Late arrival. Never held a charge. Don't know if it really worked. Wishh I had believed the others. Donnnnnt'tttt'ttt buy this piece of......", "Date": "May 29, 2013"}, {"Title": "Great gift", "Author": "couplafish", "ReviewID": "R3IB69LVYBA4G2", "Overall": "5.0", "Content": "My 13yo niece LOVES this phone, Its great for her. mp3 player works great and she can browse online with it and her mom can set limits on it.", "Date": "September 25, 2013"}, {"Title": "Works AWESOME in Kuwait", "Author": "David Allen \"David Allen\"", "ReviewID": "R10MFDZ0YQ9QOQ", "Overall": "5.0", "Content": "I live/work in Kuwait City, and wanted something with dual sim (for travel to other countries) but could still function here in Kuwait.  Works FANTASTIC on Wataniya.  Have dropped it a couple times and it still works like a champ.", "Date": "September 20, 2013"}, {"Title": "the lowest price android", "Author": "1st smart phone", "ReviewID": "R2BRK10NU79DWU", "Overall": "4.0", "Content": "I really like the phone for its price.  However, it is my first smart phone, so I am bound to like it no matter what.  Everything in the other reviews is true. It is small, which I like; the gps doesn't work, though I did make get my location with some apps like gps injector.  The battery life is longer than a couple days. The speaker and notifications are on the quiet-side. Best of all it runs Torque well.Most disappointing is that Airvoice Wireless cannot help me set up data because the phone isn't in its data base.  Other providers may have the issue, or not.  Would SVP please help me? Or AirVoice?  What's the problem?  This phone and Airvoice's $10 plan is a winning combo.  I should be happy, but I want full functionality--am I asking too much, even if I won't use much data?Bottom line:  the phone is just fine for gsm calling and text on Airvoice's ATT network with wifi access for data.To follow up, with a little internet research in the next day, I found the settings to make data work on my own.  Anyone can do it.  So, I'll give the phone another star.", "Date": "April 9, 2013"}, {"Title": "Nice appearance , piss poor phone and service", "Author": "harold hunter", "ReviewID": "R3NI33JPPIPXKV", "Overall": "1.0", "Content": "The reason I gave this phone a 1 is due to its appearance , which I think is really nice.. However ,this is a absolute piece of crap ...don't waste your time and effort and more importantly your money buying this phone. Cant receive or send pics through messaging service. Cell carrier states it is in the phone internally. Called seller and got piss poor customer service. and no help at all. Given email address to contact their one and only tech person... who after 7 days has never responded.Lousy ......plain and simpleReturned it to purchase tin cans and wire.....", "Date": "January 9, 2014"}, {"Title": "DO NOT BUY THIS PHONE....", "Author": "Sammy", "ReviewID": "R2R7NBZ2BC2BVI", "Overall": "1.0", "Content": "you will be completely disappointed if you do. I bought it thinking I could switch the current phone service provider I have, but it did not work. It does not connect to my home wifi network. It does not recognize the sim I added to it. I am also disappointed with the overall functionality. Since this is an android phone I was expecting more functions, but this is no better than the current non-smart phone I have.BE SMART- this is no smart phone!!!", "Date": "December 17, 2013"}, {"Title": "leave it where it is", "Author": "S. Marble \"Charlie\"", "ReviewID": "RYQWXK85GTFXS", "Overall": "1.0", "Content": "this is nice to look at but can't get anything to work withit DO NOT buy this phone it sucks", "Date": "September 16, 2013"}, {"Title": "ok", "Author": "Jr", "ReviewID": "R3KNR4BU4UYGFF", "Overall": "4.0", "Content": "pretty good phone for price really like the phone if you have big fingers dont get it if you do you wish you had not", "Date": "August 10, 2013"}, {"Title": "great travel phone", "Author": "mike", "ReviewID": "RO3PPOSLAGWQU", "Overall": "3.0", "Content": "the camera is not that great other then that the phone work well,and its a good travel phone and good battery life.", "Date": "June 13, 2013"}, {"Title": "I got a bad one", "Author": "Maurice Hamilton \"rastacrab\"", "ReviewID": "R2I9QFQU8VZMQ4", "Overall": "1.0", "Content": "I got this white one for a friend & I'm thinking maybe I got a bad one.  The phone was easy to set up but it didn't last through the night.  My friend put the phone to charge and drift off to sleep, when she got up and look at the phone the screen was blue, she plugged it out and that was it, nothing else, it just died.  To make matters worse I'm in Jamaica, so even if I wanted to return it, its more expensive to ship back to Amazon.", "Date": "June 10, 2013"}, {"Title": "NOT FULLY FUNCTIONAL", "Author": "Mr. Terence J. Dalton", "ReviewID": "RQ6V9VVPQ49RF", "Overall": "2.0", "Content": "I PURCHASED THIS ITEM TO UPDATE AN OLD LG THAT I OWNED. IT WAS A VERY GOOD PHONE BUT UNFORTUNATELY THE BOTTOM LINE ON THE QWERTY KEYBOARD DID NOT OPERATE CONSISTENTLY. THEREFORE RETURNED THIS PHONE.", "Date": "May 21, 2013"}, {"Title": "Not totally as expecyed", "Author": "Carol A. Madsen \"Loves Christmas\"", "ReviewID": "R3TQO9DA7BA5CB", "Overall": "3.0", "Content": "Never figured out how to use it properly, I guess.  It always turned itself off after just a few seconds and I felt like I was totally turning it on all the time..", "Date": "May 20, 2013"}, {"Title": "its ok", "Author": "Louisa", "ReviewID": "R1N1BKH5PS2W8W", "Overall": "3.0", "Content": "ehhhhh product works but the features aren't what I expected and I ended up going to a different phone for my taste", "Date": "April 30, 2013"}, {"Title": "B606 android 2.3", "Author": "JC \"James Brown\"", "ReviewID": "R2K0SQ87AJSR0M", "Overall": "3.0", "Content": "It works as well as can be expected for the price. magic jack works good but skype will not work at times.wifi is ok but not much range. but great for mail, weather and web search. If you do not have a smart phone...its better than nothing.", "Date": "October 2, 2013"}, {"Title": "Bad Product", "Author": "Jeffrey", "ReviewID": "R2XAED8SAIGTQQ", "Overall": "1.0", "Content": "I bought this  cell phone  for  my  daughter , one  week and  the  problems  started  unstable , re start one and one time , don;t accepted  the slim card correctly . for  this  problem I returned  the  product .", "Date": "August 31, 2013"}, {"Title": "not true android", "Author": "hani asad", "ReviewID": "R3RZ8XHF246O89", "Overall": "1.0", "Content": "dont have android installed its just a copy phone freez as soon you insert the sd card and non of the apps opens in the main screen cause its just a copy not partitioned very bad i dont recommend it for free even", "Date": "August 26, 2013"}, {"Title": "every on who saw it loved it and not i have to order 3 more next week", "Author": "nicola bethel", "ReviewID": "RNUM1WHPH2D98", "Overall": "5.0", "Content": "it was great the only problem i have is the phone keeps force closing on me an i have to keep cutting the phone off to boot it up when ever this happens ohter than that the phone was good!", "Date": "July 25, 2013"}, {"Title": "A great device for international travel.", "Author": "Dorcav1986", "ReviewID": "R28X309XIY7ZH5", "Overall": "5.0", "Content": "This phone is a great purchase, I use it when I'm going to Costa Rica, just I have to buy a SIM card and is ready to use, works with all the companies around the world, is a excellent for those that goes for vacations or business trips so they stay in communications with their family. If they want to save money instead paying for roaming international (that is a expensive) ;)", "Date": "May 11, 2013"}, {"Title": "no user manual", "Author": "patsy pitts", "ReviewID": "R1YPY9Q1GLMQG5", "Overall": "1.0", "Content": "there is no user manual with this phone. how do you load the sim card? the website sucks. the phone might be great, but since I can't figure it out, who knows.", "Date": "April 8, 2013"}, {"Title": "Product is not fancy but does it all (most of it)", "Author": "Concertive Son", "ReviewID": "RIZRJPCSDWRY2", "Overall": "3.0", "Content": "For around $50, this product brand new does a lot but not as well as LG or Samung.  What's great is good:- Good as a phone- Great that it can support two SIM cards simultaneously- WiFi works great- Blutooth works great- daytime camera is OK- Videos work OK- texting OKDeficiencies:- no flash for camera or flashlight- screen is smaller than an LG or Samsung, making texting more difficult to type", "Date": "December 26, 2013"}, {"Title": "Piece of crap - GPS never worked, and now it's completely broken", "Author": "mb", "ReviewID": "R3LFWSVZXU7TPV", "Overall": "1.0", "Content": "When I received this phone the GPS didn't work, there is almost no memory, and it's totally buggy. You can't do group texts. The camera is aweful, aweful, aweful.Now after a few months it's totally broke, the screen has stopped responding altogether.Do NOT buy this phone, you will be very sorry if you do.", "Date": "October 14, 2013"}, {"Title": "Love the Dual Sim capabilities", "Author": "SM", "ReviewID": "RMLWE05YGPNCC", "Overall": "4.0", "Content": "Love the Dual Sim capabilities, bought this for my family members who live in a country where almost everyone has 2 or more cell phones, they love this.", "Date": "August 6, 2013"}, {"Title": "phone languages", "Author": "Roberth J. Suarez T", "ReviewID": "R3S7R5VA606WLW", "Overall": "4.0", "Content": "Good evening, please could I report the following:the phone language is Spanish and you can place another,I'm interested in the phone menu and messages in Spanish dictionary.", "Date": "June 22, 2013"}, {"Title": "Good Phone only for the one month...", "Author": "Leoni", "ReviewID": "R5OINOGWN1OII", "Overall": "1.0", "Content": "Phone is too bad...I bought and received the phone about 2 months ago,It worked well, and exactly 2 months later the Phone broken down by itself...Sensor went bad. Which can not be done ...I would not recommend this phone to buy ....", "Date": "June 19, 2013"}, {"Title": "GPS Works...sort of", "Author": "James Bradshaw", "ReviewID": "R2IRJEAIRDXOHS", "Overall": "4.0", "Content": "A common complaint about this phone is that while GPS is listed as a feature, it doesn't work.  While it's not easy to get it to behave, there is a GPS receiver in the phone and it does work as long as you're outside and the sky is relatively clear (again, not ideal).The screen is quite small and typing is difficult, but I'm getting used to it.  I highly recommend buying an SD card at the same time the phone is purchased, as it's pretty much required to make the phone useful.  This is my first time purchasing an unlocked smartphone, and the pricepoint makes this phone a great deal for me.", "Date": "May 25, 2013"}, {"Title": "super value phone", "Author": "John Elkins", "ReviewID": "R2EFKLJUEJU5UB", "Overall": "3.0", "Content": "I purchased this phone so that I had something that could access the google play store and load up with some apps I can't get to on my kindle fire.  It can and does do that.  So if your looking for something inexpensive to load up some apps on and use under a Wi-Fi connection this phone would probably somewhat work for that.I had to put a couple apps on it right away to improve the usability.  A better keyboard (touchPad) is a must as well as an app for changing the locale.  It defaults to UK English so an app is needed to change the locale to US English, otherwise google and all your favorite sites will think your in UK.When I went to thinking that maybe I could use the phone to make calls and do other phone like things I discovered it doesn't really perform well in that department.  I took my sim card from my flip phone and stuck it in this one.  It only could establish a connection to AT&T;'s edge network for me, even though my flip phone connects with 3G just fine.  The camera is a step down from the one on my flip, and there is no telecoil compatibility (which probably won't matter to most, but it does to me).I ended up returning this SVP phone and spent a little more and purchased the pantech pocket.", "Date": "May 17, 2013"}, {"Title": "Fast, but keyboard is way too small for me to use", "Author": "Kristin", "ReviewID": "R1TMYQTSZEYZZT", "Overall": "2.0", "Content": "I ordered this phone from another site. I have little hands, but the keyboard on it is way too small for me!", "Date": "March 28, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00917RGC8"}}