{"Reviews": [{"Title": "The seller", "Author": "jorge", "ReviewID": "RL0UDFF5VQVOL", "Overall": "1.0", "Content": "I bougth a new 64GB Iphone factory unlocked white, the package arribes in 4 days as expectedand was sended to my country (venezuela) when I open it the Iphone was a 16GB factory unlocked withe, not a 64 Gb iphone... i did write to the seller and the response was that send back the phone and if it was rigth they would then change the phone, would send it free of charge and give 50 dollars in compensation. The problema was that the shipping to Venezuela is very costly so made it you know and after several emails to ratify that the phone was 16gb they agreed to refund the diference.Now i have a 16gb phone that works perfect BUT ITS NOT THE PRODUCT THAT I BOUGTH", "Date": "October 16, 2013"}, {"Title": "Good Phone but overprized", "Author": "Tomás Cittá", "ReviewID": "R13R1YTP7TTLHC", "Overall": "4.0", "Content": "I used to have an S3 before the i5 and I still miss it.The iOS is more stable than the Android however, that stability comes because its so boring, no animated wallpapers, etc.We will see if the new iOS 7 will turn things, if it does not I am planning on getting the new S4 which I believe is a better phone for less money.Also, the battery life is bad, it does not last more than half a day if you use it like a phone...", "Date": "June 11, 2013"}, {"Title": "Iphone5", "Author": "rajesh rawal", "ReviewID": "RG34OL43AG4JI", "Overall": "5.0", "Content": "It is really wonderful phone with much stuff and still lightening fast. I love iPhone 5. I recommend this product for tech lovers but battery life is issue but charging is fast.", "Date": "June 12, 2013"}, {"Title": "iPhone5", "Author": "tommy", "ReviewID": "R1DCDBZYWSSJ2", "Overall": "5.0", "Content": "arrived as advertised, Excellent condition with ALL packaging etc...  Looked absolutely brand new, has run perfectly ever since with very heavy usage.", "Date": "March 4, 2013"}, {"Title": "LOVE THE iPHONE 5!", "Author": "SERGIO LUIZ M MOREIRA", "ReviewID": "R20XOADBXBN2WY", "Overall": "5.0", "Content": "Well, I had never been keen of fancy and expensive cell phones but heard so much about the iPhone that I decided to give a go. Since I didn't have at many expectations I simply love all the features. It has so many useful apps. Love it and am satisfied with the investment. Cheers!", "Date": "March 3, 2013"}, {"Title": "I happen to like iPhone...", "Author": "KissaMew", "ReviewID": "R1JWEA9AH0N96O", "Overall": "5.0", "Content": "I received a white iPhone 5 for a Christmas gift. I enjoyed my iPhone 4 and appreciate the differences between the two. Tech-wise I have not had enough time, but there is a good review that goes over that sort of thing. I can revise this as I get more familiar with my phone, but as for now I am enjoying the experience!", "Date": "December 23, 2012"}, {"Title": "iphone", "Author": "Rudi Niessen", "ReviewID": "R3VJJ3FMN0DOAM", "Overall": "5.0", "Content": "it was well and nice package, arrived in good time and is being used, requirement where and sometime the box is way to big", "Date": "March 28, 2013"}, {"Title": "Very like!", "Author": "Tran Quoc Trung", "ReviewID": "R1XYANK4260VC6", "Overall": "5.0", "Content": "iPhone 5 is the best one. The speed is over the top on, no phone can compared with iPhone! I used to take pic and make checkin by 4sq. It's make me feel better!", "Date": "March 24, 2013"}, {"Title": "love it", "Author": "adriana Gomez-Ruiz", "ReviewID": "R33N1QIRWHNKQP", "Overall": "5.0", "Content": "it was perfect ... ... ..  .  ... ... ... ... ...... ...  ....  ..  ....  ....  ..  ... ..", "Date": "December 24, 2012"}, {"Title": "DONT BUY!!", "Author": "Connor", "ReviewID": "R2ZBW0YEOZ4B9D", "Overall": "1.0", "Content": "$1.000.00 for a iphone 5 64GB unlocked!! RIP OFF if i were you right now, i would go outside and pay someone to slam it on the ground because if you think someone will buy that, you need to just give it to them free. the point here is LOWER THE PRICE im not being mean but no one will buy that. THnaks reply", "Date": "December 28, 2012"}, {"Title": "Resolution of iphone vs SIII", "Author": "ABookheimer", "ReviewID": "R2K9W6AOVZ1Q0C", "Overall": "1.0", "Content": "the iphone has a screen that is an inch smaller so its easier and cheaper to to make a better smaller quality screen than it is to make one that is almost 5 inches big. also the iphone 5 has only about 20ppis more and if you scaled the screen up to the size of the s3 the s3 would look better also the ipone didnt get any wider it just got longer lol.", "Date": "October 19, 2012"}], "ProductInfo": {"Price": "$860.00", "Features": "Apple iPhone 5\n64GB\nSmartphone", "Name": "Apple iPhone 5 64GB white FACTORY UNLOCKED", "ImgURL": "http://ecx.images-amazon.com/images/I/41gOjrtkGLL._SX300_.jpg", "ProductID": "B009DSPB5E"}}