{"Reviews": [{"Title": "Awesome phone/tablet!", "Author": "rpv", "ReviewID": "R1NSR3V0W4XUJR", "Overall": "5.0", "Content": "When one opens the box, there is a sense of awe. People ask \"Is this really a phone\" was one reaction I got. It is an amazing piece of hardware. I have used Android devices starting from Cupcake version, used iPhone, HP Veer with webOS, Windows 7.5 HTC Titan 2. This phone is the sleekest and one of the best so far. It is fabulous!  I find the big size to be very good and not a problem at all. Will the Galaxy Note 3 be 6\" ?!Out of the box, connect to wireless and get the phone logged into Google account. The advantage of Android phones is that once you are logged into Google universe, everything gets synced up especially if you have been using Android.  The position of power button is at an excellent position for your hand on this Note 2. The additional LED for notification on top is very handy. Listen Apple? The camera serves some really futuristic ideas also. It can check if you are looking at the phone and disable screen lock (even if you set timeout to say 30 sec). Also it can serve as password unlock. Amazing! These can be set from Settings Menu.The Android version as of Oct 26 2012 is Jellybean 4.1.1. Kernel version is 3.0.31-259982. Model GT-N7100. I got the 64 GB microSD card. Get this mobileUltra, it is the latest as of Oct 2012. (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging. Settings show an available space of 59.45 GB. So along with 16 GB built (system shows only around 10.46 GB), my Note 2 has 80 GB memory. With music in the  Google Music cloud, I intent to use the memory for video/pictures as a camcorder/camera.I strongly suggest going through Settings and customizing many things as per your desire. I did Voice Input, Keyboard (this comes with English(UK), change to English(US) for example. Fiddle around the settings and you will be amazed how much you can customize. I also did Battery % to appear in notification bar.One thing I found the default keyboard did not show Mic button. I realized it was next to Sym button. Long press it and choose Mic. And then on, it will appear in default keyboard. Also customize the accent. It can do magic for typing. I type paragraphs at a time effortlessly. This is Google backend servers at work. The Mic on Samsung Galaxy Note 2 does a fantastic job!S-Pen, Ah.. I was truly impressed. You have to use these to believe it. The note taking was very fluid. Samsung seem to have nailed it. I wrote up an equation in Equation mode - x^5 = x^2 + 2x + .... Something completely random, another one d/dx(an equation) and it recognized perfectly and asked it to search, it went to Wolfram Alpha and solved it. It is at first unbelievable and then it starts to sink in this is a computer program made well. Like it should be in first place! Export to pdf is very good. The main thing is the pen is very fluid and feels like a fountain pen writing.Overall, the phone feels very smooth and snappy. The screen is crisp and clear. Apps can even be multi screened. Samsung approved apps can be placed two in a screen. Eg. Maps on top and email on bottom portion. I doubt I will use this, but handy.One gripe I have with this phone is speaker is on the back. Typically if you lie the phone down, the speaker is blocked on bottom. I wish the speakers were in the side. This is a design decision and not sure why phones have speaker on back. But the speaker volume is very high, so I am not complaining too much.One big pain point with Android is once you purchased/downloaded for free Apps, they cannot be permanently deleted. So even if you get a junk app, and delete immediately they are permanently there in your Google Play store. From the phone's play store I got 300+ Apps. One cannot choose 50 apps and say get all these. You have to do one by one. After getting one, the screen resets to beginning. So I went to a computer browser and pushed apps to pone. This is easier and faster.Some of apps I have as of now :Amazon MobileAndroid Status : Android Status app shows ARMv7, Max Freq 1.6 GHz, BogoMips 1592.52 Memory 1.79 GB, Free 365 MB, Internal Storage 10.46 GB Free 7.18 GB. Total Process running 271! Kernel 159/User 112 Interface has IPv6 as well as IPv4 addressAndroidifyAngry Birds (Space/Seasons)Asphalt 7Amazon App StoreBoxCar Maintenance Reminder ProChromeCNET TVGoogle Currents (nice way to read News)Draw SomethingGoogle DriveEbayFM Radio (needs headphone)LinkedinGoogle MusicOverDrive Media Console: Library eBooks & Audiobooks (public library consumption of media)Microsoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for Android (excellent twitter client)Twit.TvGoogle VoicePlenty of WidgetsAsk questions, the review cannot do justice to Note 2, I find something new always. I will be glad to answer any questions.", "Date": "October 27, 2012"}, {"Title": "The Best Phone Around", "Author": "shy2papa", "ReviewID": "R3HEDQAMJOVLL2", "Overall": "5.0", "Content": "Just bought this phone and after a week with it this is the best phone on the market now, battery life is really really good, the camera is amazing and running multiple app is a breeze thanks to the quad core and 2 gigs of ram, if size is not an issue i would highly recommend The Samsung Galaxy note II you won't regret it :)", "Date": "October 22, 2012"}, {"Title": "Travel sans laptop - Apple take \"note\"", "Author": "P. Scott Pope \"Scott Pope\"", "ReviewID": "R1WLR7PMD6N8LV", "Overall": "5.0", "Content": "During a recent excursion to NYC, I had my first trip without a laptop computer. Not only could I leave my computer at home, I had excellent all around functionality in a single device that was on my person at all times. Whether in my hotel room or on foot in Manhattan, I was able to realize the true power of the Note II. During the day, I was able to extensively use the Google Maps function. At night, the large screen provided an excellent way to read text on web sites. My one complaint is that 4G was seldom if ever available. When it was, such as at Midway airport in Chicago, I was getting 30 MB/second.*************The most important issue that any prospective customer should understand about the Note II is its size limitations are far outweighed by the benefits. Specifically, 1)it fits in a jacket or pant pockets and 2) can be operated single-handedly by someone of average height. At the same time, the 5.5 inch screen allows for reading mainstream websites in native form. It may look odd at first but just remember how large early mobile phones were. The Motorola DynaTAC weighed 4.3x as much as the Galaxy Note II does today. At 179 grams, it weighs 41% less than an iPad Mini and 63% more than an iPhone 5.While I love my iTunes on my iPod Nano, my extensive music library and podcast list stays with me on my iPod Nano with lanyard headphones. No iPhone can supplant this setup, especially when exercising. If I want to watch full-length video, the screen size of the Note II is worth more to me than the convenience of iTunes. Again, the cost benefit makes sense for my use case.With GPS and mapping, a larger screen offer inherent benefits. Yet, Google is far ahead of Apple when it comes to built-in bicycling and walking directions along with indoor navigation of large buildings. Recently, Google embarked on Street View Trekker, which employs sophisticated navigation-surveying backpacks that their employees use to map natural wonders, such as the Grand Canyon, on foot. Apple is WAY behind on the non-automobile navigation, which is important for many urban dwellers.On a separate note, my shopping experience with Sprint is mixed. There was no clear evidence that I purchased a phone on my account. No confirmation email was ever sent (checked spam folder). Sprint still appears to have best data plans pricing with perhaps the lowest quality LTE network for now. I hope the new Japanese owners inject some capital to improve the network. Fortunately, Sprint has not forced the offensive Nascar application on Galaxy Note II owners as it did with earlier smartphones.Lastly, I am glad to see Samsung employing NFC (near field communication). Apple and other major phone makers should have installed NFC years ago. All research suggests the delay is due to squabbles over credit card transaction revenue. In the future, NFC-enabled phones such as the Note II will be your car keys, house keys, credit card and transit pass.Pros:90% more screen area than iPhone 5Weighs 41% less than iPad Mini, 72% less than iPadNFC includedMicroSD slotLong battery lifeCons:Looks strange in front jean pocketNo wireless chargingNiche applications often delayed on Android as Apple IOS given priorityTips:Order accessories ahead of time from Internet at ¼ the price of retail", "Date": "February 4, 2013"}, {"Title": "Realy exellent smartphon", "Author": "gil", "ReviewID": "RJITTBWCIQFQ9", "Overall": "5.0", "Content": "smart, easy to use and friendly, not as big as you think,real tablet with all the charachters that you need.  I love it. My wife comlainning that it is my second wife....", "Date": "December 8, 2012"}, {"Title": "I Love it", "Author": "Aat", "ReviewID": "R2G11UN3Q7W25S", "Overall": "5.0", "Content": "I already have Galaxy Note 1 and just bought note 2 for my wife. She is enjoying using it. Only drawback is you cannot register the international products with them (samsung website).", "Date": "November 24, 2012"}, {"Title": "The best", "Author": "Alonso Velasco", "ReviewID": "R13KP27HWSRYCV", "Overall": "5.0", "Content": "This is the best smartphone on the market, really fast with the best features available, you have to get it.", "Date": "November 17, 2012"}, {"Title": "Half a year in, and I am still in love with it!", "Author": "DrRuth", "ReviewID": "R3AO2SMSMU4A4E", "Overall": "5.0", "Content": "I have traveled the world (OK, parts of Europe) and the US with this phone, and it does everything I want and need to do.", "Date": "January 9, 2014"}, {"Title": "great~", "Author": "CY", "ReviewID": "RK3E0CGE1CISL", "Overall": "5.0", "Content": "great~ good cellphone to have ~ nice use, but requires a big hand, ladies need 2 hands to use it~", "Date": "December 22, 2012"}, {"Title": "Big Screen, Pen Memo Function, Easy to use", "Author": "Agnes", "ReviewID": "RS3WKGOXBEU0I", "Overall": "5.0", "Content": "I think that this is the best smart phone I have ever seen.I bought this as a gift for my mother, and she loves it too.I would highly recommend this product if you are looking for a new smart phone..", "Date": "December 12, 2012"}, {"Title": "crashes alot", "Author": "Kiyoshi Mukai \"Overchan2\"", "ReviewID": "R1PCCNNNSYRQQS", "Overall": "2.0", "Content": "I received this phone as a gift from my father on christmas. It was sealed. After 2 months of playing games. The phone started crashing randomly. I dont have warranty but its horrible now. Im back with my old iphone. Its slow but it doesnt crash that often.", "Date": "March 6, 2013"}, {"Title": "the best", "Author": "maz", "ReviewID": "R2UD46UWIAPA02", "Overall": "5.0", "Content": "you can never go wrong with that phone. long life battery, big screen, and the fastest processor in the market.", "Date": "December 23, 2012"}], "ProductInfo": {"Price": "$459.99", "Features": "2G Network\tGSM 850 / 900 / 1800 / 1900 3G Network\tHSDPA 850 / 900 / 1900 / 2100\nDISPLAY\tType\tSuper AMOLED capacitive touchscreen, 16M colors Size\t720 x 1280 pixels, 5.5 inches (~267 ppi pixel density) Multitouch\tYes Protection\tCorning Gorilla Glass 2  \t- TouchWiz UI\nDATA\tGPRS\tYes EDGE\tYes Speed\tHSDPA, 21 Mbps; HSUPA, 5.76 Mbps; LTE, Cat3, 50 Mbps UL, 100 Mbps DL WLAN\tWi-Fi 802.11 a/b/g/n, dual-band, DLNA, Wi-Fi Direct, Wi-Fi hotspot Bluetooth\tYes, v4.0 with A2DP, LE, EDR NFC\tYes USB\tYes, microUSB (MHL) v2.0, USB Host support\nCAMERA\tPrimary\t8 MP, 3264x2448 pixels, autofocus, LED flash, check quality Features\tGeo-tagging, touch focus, face and smile detection, image stabilization Video\tYes, 1080p@30fps, check quality Secondary\tYes, 1.9 MP\nOS\tAndroid OS, v4.1.1 (Jelly Bean) \tExynos 4412 Quad CPU\tQuad-core 1.6 GHz Cortex-A9 GPU\tMali-400MP Sensors\t Radio\tStereo FM radio with RDS GPS\tYes, with A-GPS support and GLONASS Java", "Name": "Samsung Galaxy Note II N7100 16GB - Factory Unlocked, International Version, No Warranty (Marble White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41wL8qMHMGL._SY300_.jpg", "ProductID": "B009LDPWKU"}}