{"Reviews": [{"Title": "galaxy s3", "Author": "Fernando", "ReviewID": "R138WO35HPERVZ", "Overall": "5.0", "Content": "i was looking forward to buying this phone and it exceeded all expectations in comparison to the iphone 4s, looking forward to the galaxy s4", "Date": "July 25, 2013"}, {"Title": "S3 is one of the best phone out there", "Author": "Julio A M Neto", "ReviewID": "R3IZ99FPH5FJ3C", "Overall": "5.0", "Content": "The S3 is one of the best phones out there. I'm definitely not the best person to speak of it, probably GSMarena.com has much better reviews on cell phones than me, that's one of many websites I use on my researches.It comes with the phone on the top, the manual right below and after opening the box you see the charger separated from the USB cable (both black) in a custom space and a pair of headphones comes with them. The headphones has the single cord and the right ear cable passes behind your neck. All together also comes the battery inside a sealed plastic to protect it.If you're coming from other Android or iPhone, definitely a good phone for the price! A little outdated by now but still a really good product. Go for it!", "Date": "July 14, 2013"}, {"Title": "The perfect cellphone", "Author": "jossmail \"jossmail\"", "ReviewID": "R1T17RG28DV96D", "Overall": "5.0", "Content": "Its a terrific cellphone. The speed, the multiple applications, the graphics, the perfect photos. Its a wonderful phone. The only aspect disappointing is the battery duration. As expected i'm testing the phone all day, and the battery die before a hole day use. I try not use the phone too much during the day, and it was the same result, battery die before the night arrive. I don't know if I get a bad battery, or its normal with this cellphone.", "Date": "December 4, 2012"}, {"Title": "very good", "Author": "Dinarte", "ReviewID": "R286HHO67H9E2R", "Overall": "5.0", "Content": "very good experience, I recommend it widely, the shipment arrived on time. the product was exactly the that I wanted", "Date": "January 1, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009KS8SOS"}}