{"Reviews": [{"Title": "A Great Phone with Inherent Flaws", "Author": "Johnny Saigon®", "ReviewID": "R11TOSXXSLUN3L", "Overall": "4.0", "Content": "Let's get to the nitty gritty:Pros:1- It's BIG. Big for gaming, big for videos, big for web browsing. Simply put, if you want a phone with the most real estate on the screen size, then there is no alternative. Don't be so mesmerized on the 1080p screens that will come out soon. Unless you want to destroy your eyes and use the phone from an inch away, you will not notice the difference in everyday use.2- It's fast. Yes, the Qualcomm S4 Pro quad-core beats this Tegra 3/Exynos 4 CPU in most benchmarks, but again, unless you are a hard-core geek that is OCD on numbers, you will not notice any difference in everyday use. There is no discernible lag anywhere (it's probably just your slow Internet connection).3- It's beautiful. Not HTC or Sony beautiful, but this is one sleek and stylish phone. The white is classic, but the Titanium Gray is also super slick. Just check out the back cover and you will see what I mean (yes, even with that cheap-feeling plastic material).4- Did I mention the screen? It's BIG, it's bright, and it's beee-ay-eeww-ti-ful! AMOLED screens have awesome color saturation and contrast (most times even overkill, actually). Some people say it's not good in daylight. Um, have you tried cranking up the brightness??5- The Samsung/Android touch. Not everyone may like Samsung's Touchwiz user interface compiled onto Android, but I dare you to find a phone with more features than this one (and similarly the Galaxy S3). Here are the main highlights:a. Samsung utilizes the front facing camera almost to perfection. You can use it to control your music player; it has facial recognition to sense you are directly in front of the screen so it won't dim and turn off the screen (for reading, web browing, video playback, etc.); it recognizes your facial orientation so that when you are lying down sideways looking at the screen, the accelerometer will not kick in to auto-rotate the screen in the wrong orientation. That is something that has always bothered me with other phones and FINALLY someone has added that feature! Granted, not all these features work flawlessly, but it's a great start.b. Integration with Google is finally starting to show off in good ways. It was always once that Apple had the superior ecosystem. But now we see the future is bright indeed. Not just evolution, but finally innovation!c. The S Pen and all the neat things you can do with it. Preview a point in the movie before skipping to that point, and other things like going old-school back to the PDA days!6- It accepts up to a 64GB microSD card. That turned out to be the dealbreaker for me. Explanation in \"cons\" section below.Cons:1- It's BIG. With my tiny hands(hey hey), I can hardly do anything one-handed with this phone. Pocketability rating: -2. Putting it up on your face to make a phone call is also a big fail if you're sensitive to public ridicule like me. Have your Bluetooth earpiece ready.2- It's quite heavy. I really wanted to switch to the Verizon Droid DNA - for a 5-inch screen, it was remarkably svelte and light. And if it wasn't for the fact of pi$$-poor Verizon customer service at their call centers, and that it only had 16GB of memory with no microSD card option, I would have made the switch. The Droid DNA is superior in every way except those things mentioned. I have absolutely no doubt that the Samsung Note 3 (and maybe even the Galaxy S4) will be a 1080p screen with the Exynos 5 quadcore - can't wait!3- The screen may be bright and colorful, but it's way over-saturated and unnatural. Fortunately, you can go to the screen options and set it to \"Natural.\" \"Dynamic\" is overkill, and even so is \"Standard.\"Conclusion:Even with its inherent flaws, I can't help but love it. It's not even a phone, it's a cellular tablet(cablet, anyone??). I'm going to keep it. Until the next big thing is already here....", "Date": "November 29, 2012"}, {"Title": "PROBLEMS WITH RECEIVING TEXT MESSAGES", "Author": "Tiffany Schulze", "ReviewID": "R1JEELSMQYTQU3", "Overall": "3.0", "Content": "I love the phone, but I have been having problems not getting my messages. I have spoken to AT & T and they dont have any idea why this is happening.  I wouldnt order the phone unless you get it from the company store. I am not sure if its because of the phone being made it China.  But I have tried to contact the company and all they have to say is that its probably the network.", "Date": "March 28, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009MB80FK"}}