{"Reviews": [{"Title": "Great Phone!", "Author": "M. Morton", "ReviewID": "RIXIFMQ0VPNBD", "Overall": "5.0", "Content": "First of all, I am not an iPhone or Apple faithful. I use products based on how well they perform and suit my needs. This phone blows away the others. I had an iPhone 3, then switched to an HTC Android, then the Droid Razr. Now I'm back to the iPhone again. I like the clarity of the screen, which helps when reading text with these old eyes. The Facetime feature is great and the Verizon LTE is super fast. The screen and all of the apps are much more responsive than the iPhone 3 or any of the Android devices I've had. I'm sure another stunning Android phone will come around and I will just as likely switch again. For now, the iPhone 5 performs at every level.", "Date": "June 19, 2013"}, {"Title": "A lot of good and few bad.", "Author": "MD", "ReviewID": "R1SCEAIKXK6WOS", "Overall": "3.0", "Content": "The shipping was rather quick (though I did pay extra for expedited), it came in a padded envelope rather than a box and without the IPhone box itself (which i don't understand as the item is listed as brand new) in addition with a charger stuffed in there, both the cable and solid wall charger which could have ended up badly. A bit more caution should have been taken in my opinion. The listing also said \"accessories\" which was false as the headphone that come with the phone were not included costing me another $32 after tax. However, when I received the phone all things seem in working order and had no issue activating it with my Verizon carrier. So far it seems to be in flawless condition visually and operationally. I shall update if anything happens with in. All and all I am happy with my purchase and will consider buying from this seller again.", "Date": "August 26, 2013"}, {"Title": "Phone Great. Seller, Bad.", "Author": "Ron M. Kolman \"Subtext\"", "ReviewID": "R3A179YUZ6CDJR", "Overall": "5.0", "Content": "What can I say about the iPhone 5? My wife attempted upgrade from 4 with this Amazon seller and we received a defective phone. Be VERY careful with \"refurbished\", or \"loose\" (not in box and sealed) phones.Beware THIS seller in particular: \"Quag's Buy, Sell, Trade.\"", "Date": "March 28, 2014"}, {"Title": "It's an iPhone.", "Author": "Mike D.", "ReviewID": "R23SSN93T0C2B4", "Overall": "4.0", "Content": "Ordered this for my daughter, switching from an Android. It came in new manufactures packaging. Phone works on Verizon network, no problem. However, it did NOT come with a blank SIM card, so that was an unexpected added cost. Also, be aware that this is the iPhone 5, NOT the 5S. It does not have the fingerprint scanner. Apple has discontinued the 5, so we might run into issues later. Maybe.", "Date": "March 16, 2014"}, {"Title": "Whack!!!", "Author": "Varry", "ReviewID": "R3B07V7A5MDJCY", "Overall": "1.0", "Content": "It sucked. The guy who sold it sell it to me tried selling me the line with the phone. That was not my intentions", "Date": "May 31, 2014"}, {"Title": "Front facing camera not working!!!!", "Author": "Edin Maslesa", "ReviewID": "R1YWPMIMBGVGU0", "Overall": "1.0", "Content": "I bought this before going overseas. The front facing camera is not working. I am really disappointed in this purchase.", "Date": "May 26, 2014"}, {"Title": "Amazon screwed this one up", "Author": "Pinchvalve", "ReviewID": "R398TW7G8O3L29", "Overall": "5.0", "Content": "The product was as described, no worries there.  The seller was 100% with the listing and the item was as 100% described.  EXCELLENT condition, everything works, thank you for the great item.The problem was that I was looking for an iPhone 5c.  Amazon WILL NOT limit searches to what you actually want, they throw in all this other stuff.  So while sifting through listings, it is easy to jump from one model to the next without ever realizing it.  I filtered on a 5c with accessories from Verizon and picked this one from the results.  It was a regular 5 with no accessories.Yes, had I read the listing more closely I would have realized, or the order confirmation.  But I was looking at a FILTERED list and assumed that Amazon know how to conduct a basic filtered list and I was busy at the time of order and didn't properly read everything.  So DO NOT trust the check boxes off to the left, they don't necessarily filter or include what you want and READ everything closely before you One Click Order!The phone was in such good shape, I decided to just keep it rather than attempt a return.  The seller did nothing wrong and I did not want to bother the seller with my mistakes.  Live and learn.", "Date": "May 22, 2014"}, {"Title": "Activating issues but overall great phone", "Author": "Keria Caldwell", "ReviewID": "R1H6RSAR3KJF20", "Overall": "4.0", "Content": "Have a hard time activating phone because I have a Verizon carrier and normally their phone doesn't require sims cards.", "Date": "April 2, 2014"}, {"Title": "Great", "Author": "lauran", "ReviewID": "R3UYPXJEN30ESM", "Overall": "5.0", "Content": "I love this iphone. It shipped to my home in a reasonable amount of time and was truly in great working condition.", "Date": "March 16, 2014"}, {"Title": "Great Phone", "Author": "Greg Rothwell", "ReviewID": "R2YT9YW53N22YM", "Overall": "5.0", "Content": "The phone is great.  I have been an iPhone person since day one.  I bought this for my girlfriend and this is her first iPhone.  Too bad it is with Verizon, their customer service lacks compared to AT&T.;", "Date": "March 13, 2014"}, {"Title": "I love my apple products.", "Author": "Nicole Ker", "ReviewID": "R3DU0DBEPV7HYP", "Overall": "5.0", "Content": "I LOVE all of my apple products and I love this phone! I have a lot of experience with apple though, so it is easy for me to run it.", "Date": "December 2, 2013"}, {"Title": "very good !!", "Author": "daihualong", "ReviewID": "R2VXXAJMBH1Y4B", "Overall": "5.0", "Content": "Apple iPhone 5 16GB (White) - Verizon Wireless .....  this iphone can spport gsm wcdma cdma200  i like it very much !!", "Date": "April 28, 2014"}, {"Title": "NOT A VERIZON WIRELESS PHONE", "Author": "Joseph My Castle", "ReviewID": "RJ881HVGNIKS9", "Overall": "1.0", "Content": "I specifically searched for an iphone 5 for Verizon Wireless. Verizon will not accept any phones that are \"jail broke\" or another carrier, they MUST be issued to Verizon. Well the title to this iphone said \"verizon wirelss\". I will say the phone arrived quick and looked perfect, not a scratch on it. It powered up fine. But when we headed to Verizon to have the service turned on we were told that this phone is NOT VERIZON and it basically a $380 paper weight that we cannot do anything with. I walked over to a tablet and logged in to file a dispute and get a refund, we have YET to hear from the seller on what will get done to fix this situation.", "Date": "January 27, 2014"}, {"Title": "All the accessories are postiches.", "Author": "Panzhiheng", "ReviewID": "R367YC7UN61DGF", "Overall": "2.0", "Content": "The phone works well.But i found that all the accessories are postiches. It makes me feel disappointed.No once more.", "Date": "November 7, 2013"}, {"Title": "Perfect!", "Author": "Lenzy Strunk", "ReviewID": "R2DEMM3KTGHB9P", "Overall": "5.0", "Content": "Everything about this phone works great! Exactly as described and a great deal! Exactly what I was looking for and the extra accessories were a great help when going from an iPhone 4s to 5!", "Date": "January 13, 2014"}, {"Title": "iPhone not as advertised", "Author": "Erika Olson", "ReviewID": "R3BT4RNFGV2785", "Overall": "1.0", "Content": "When we ordered this iPhone we asked for a Verizon iPhone and we received an at&t; phone.  Verizon did give us a credit for the phone but not as much as we paid for the phone.  Not happy lost $150.00", "Date": "January 11, 2014"}, {"Title": "very very good", "Author": "henrysun", "ReviewID": "R1WZWKCX6BMLV1", "Overall": "5.0", "Content": "NEW GOOD,CAN'T USE,i use it insert china cdma card,china unicom and china mobile is noproblem.iphone great  run fast run fast", "Date": "August 27, 2013"}, {"Title": "producto es excelente", "Author": "Luis Mendez", "ReviewID": "R17U2ZUFLEDR1L", "Overall": "5.0", "Content": "Desde Venezuela confirmo que este producto es excelente. entregas eficaz. Muchas gracias.. espero volver a realizar compras a este vendedor.", "Date": "February 15, 2013"}, {"Title": "excelente", "Author": "Enrique Reyes \"HENRYKINGS\"", "ReviewID": "R261HR3373KO95", "Overall": "5.0", "Content": "muy buen producto y muy rapida la entrega, excelente la profesionalidad del vendedor y 10 puntos la calidad del producto", "Date": "November 27, 2012"}, {"Title": "the power Button does`t work", "Author": "Jorge", "ReviewID": "RLH1PGMGIO2WI", "Overall": "1.0", "Content": "Y try to activate the phone but the Power button some times does`t work Y try to take to the apple store but they said the phone does`t have  garanty", "Date": "December 27, 2013"}, {"Title": "wrong kind of phone", "Author": "Jeffrey", "ReviewID": "RH2KBVG96T97G", "Overall": "1.0", "Content": "I ordered this as a gift. My friend spent hours at Verizon trying to activate it when in the end it was a sprint phone and he ended up not being able to use it.", "Date": "August 31, 2013"}, {"Title": "can't talk and surf on the Iphone 5 via Verizon", "Author": "Dwight", "ReviewID": "R5ZQGQTRJWZU4", "Overall": "3.0", "Content": "If your internet illiterate mother calls you and needs you to look something up on the web pronto - you have to tell her, \"hang up and call you back\" because Verizon's Iphone 5 won't let you do those two things that \"inferior\" Android phones allow you to do because the latter have two separate antennas to do allow data and voice to work at the same time.  So much for Iphone being the luxury ne plus ultra classiest of all smartphones.  Just as Apple won't give us removable memory or batteries, they didn't give us two separate antennas for the Iphone 5.  I'm not sure if the older iphones have two antennas.FYI if this is a deal breaker for you.  How much is retina display really worth then?On the plus side, this phone at one year old is holding its own in new reviews of the Samsung Galaxy S4 with one article asking if you prefer Brains (Iphone) or Brawn (Samsung).The best thing about the Iphones is that despite the walled garden layout, its IOS updates are guaranteed regardless of your phone model so you will never be shut out because you own a two year old phone.  I have read numerous announcements about older model Android phones that won't get the latest update because the manufacturer can't be bothered to write the necessary modifications for a no longer topselling model.  Sucks right?the best thing about this phone compared to the androids is the apps, the feeling that you are in the loop when you read something in the media about smartphones as opposed to if you owned an Android or a Blackberry and you have to wonder gee I wonder if they make a version for my phone.  With an Iphone, you know the answer is of course.Memory cannot be expanded nor removed so if your phone dies, you lose the extra memory you may have paid for.If the only thing wrong with your phone is that you've blown out the battery.  You are SOL.  A dead battery means you don't even get to keep the phone as an ipod for your car music.Things to bear in mind about whether to go with this year old phone:1080p resolution is going to be the minimum in the future (comparable to retina display) as  will a quad-core processor and everyone else is offering more powerful battery life.I really think that Apple should have dropped the price of this phone to $99 then the IOs and Apps advantage would have taken away the temptation to spend for the latest and greatest.Wireless charging is also going to be available on future models.", "Date": "April 29, 2013"}], "ProductInfo": {"Price": "$649.00", "Features": "New iPhone\nSize 16 GB", "Name": "Apple iPhone 5 16GB (White) - Verizon Wireless", "ImgURL": "http://ecx.images-amazon.com/images/I/31wjOELyfBL._SY300_.jpg", "ProductID": "B0097BVA70"}}