{"Reviews": [{"Title": "I love it", "Author": "jason", "ReviewID": "R20ECKGXDSPFYL", "Overall": "4.0", "Content": "I really love this phone. It takes great pictures everything processes really fast and the operation is smooth. An other feture i like about it that I didn't have on my last android phone is on the home keys you can control apps running in the backround. Also I love that you can get it practactly for free. There is only about three things I don't like about it and they are 1: no LED flash for the camera which I got used to on my old phone for a flash light, 2: It doesn't have an 8 mega pixel camera which I am also used to, and 3: I think might just be a software issue because the phone is new which is when I try to log into my netflix app the keyboard won't let me put my name and password correcty so I can use netflix on the phone like i did with my last phone.", "Date": "September 23, 2012"}, {"Title": "Dials itself", "Author": "Disappointed", "ReviewID": "R1HEC3RK6N977F", "Overall": "1.0", "Content": "I have had this phone for 6 months and it is not very user friendly.  In the last 2 months it keeps hanging up on the call I am on and starts dialing someone else.  I was on hold with a client and the next thing I know the phone is dialing my son. My e-mails are not coming through and every other day I get like 80 e-mails and then nothing for the next 2 - 3 days again.  I would not recommend this phone at all.", "Date": "April 9, 2013"}, {"Title": "Garbage", "Author": "tguy802", "ReviewID": "R1LDJN15OW6GTS", "Overall": "1.0", "Content": "If you are looking for the most worthless horrible piece of junk in the milky wa then you have found it with the samsung stellar if you want it to unlock in your pocket. make emergency calls by itself. there is no such thing as just plain vibrate. i must take the battery out of my phone a minimum of 2 times a day because my touch screen decides not to work i mean if you want the worst phone of all time this is the phone for you.. give me back my fascinate 100 times better phone all in all i would never recommend this phone to anybody except one of the idiots at the verizon store that told me it would be a good phone.. ill take the free iphone next time..", "Date": "May 20, 2013"}, {"Title": "All kind of problems with this phone", "Author": "LMN", "ReviewID": "R3TIJU8XK2ZC7H", "Overall": "1.0", "Content": "My husband chose this phone when he upgrade and renewed his contract with Verizon. He specifically chose it because it got good reviews online and because it was advertised for those users entering the \"smartphone\" market. He has had no end of problems with it. He has problems making calls from our house. His phone can have a bar to a bar and a half of service my (iPhone) is at five bars and we are sitting along side one another. He has to move to the large picture window at times to make a call, or send a text. He didn't have to do that even with his very old flip phone. The call reception is poor and most often crackly. We called Verizon and got a \"certified\" refurbished version of the phone, it was even worse than the original. The new phone did not have any improvement in reception (bars.) Apparently the GPS didn't work because it could not locate us. He found it hard to end a call because, for some reason, there command to do that was missing from the screen. After when making subsequent calls, despite tapping the next person he wanted to talk to in his Contact List if would call the last person he spoke with?? It would not download/upload all his Apps....it was no end of trouble. And after three phone calls for a total of about four hours trouble-shooting verizons answer was to offer yet another \"certified\" refurbished version of the same phone. Beware with this phone. It is not all it says it is. Do your research. We are two very dissatisfied customers and would NOT buy another Samsung phone. He's stuck with this one for another year and a half unless he want's to pay for another model phone.", "Date": "February 9, 2013"}, {"Title": "Stellar phone at stellar price", "Author": "Moi", "ReviewID": "R16TGQYCEOZF9Q", "Overall": "4.0", "Content": "Really good phone at a really good price (free). Good battery life, runs well on Verizon 4 g, one star off because camera is lacking slightly. Comparable to an iPhone 4.", "Date": "November 7, 2012"}, {"Title": "The best smartphone I have ever owned.", "Author": "Erik", "ReviewID": "R396D7M0QVEKL4", "Overall": "5.0", "Content": "Before this phone I had the DROID X, which I loved. Then I got this and noticed a major difference in processor and data speed. This phone is amazing with games and apps that didn't work very well on my DROID X. The camera on the phone is okay, but would be a lot better with flash, but I got over that pretty fast. So overall this is a wonderful phone that is very fast and user friendly.", "Date": "May 14, 2013"}, {"Title": "Probably the worst phone I've ever owned.", "Author": "jeremiah n toller", "ReviewID": "RNAXZZ7846CI9", "Overall": "1.0", "Content": "This phone makes me not want to ever own another Samsung device.  I thought Samsung produced good devices, but how could a company that makes good products even think of defacing their reputation with a phone that has so little storage and so much bloatware that it is nearly impossible to install more than a couple of apps (no way of sd card app installation that I know of), requires multiple battery pulls per day AND can't even function well enough to use Swype, one of the primary reasons I use Android?No wonder they are selling for a penny on here.  ...which is still overpriced.", "Date": "December 18, 2013"}, {"Title": "worst phone ever", "Author": "teresa burnham", "ReviewID": "R37OT6ED01QFSL", "Overall": "1.0", "Content": "this is the worst phone I have ever owned...........got a replacement with Verizon, samething happening as did the first one, have had it just over a year...............I've contacted Samsung, they want me to send it in an be with out a phone for a week or two, nope not happening............thinking I may never buy a Samsung again.", "Date": "November 29, 2013"}, {"Title": "Great Phone !", "Author": "April", "ReviewID": "R2KLOFMLLRZDL6", "Overall": "4.0", "Content": "This is a really good phone. I have had the phone for approximately 7 months. Being my first smart phone I am pleased to say that it is really easy to navigate. The only draw back on this phone is the camera, otherwise it would be perfect. I live in a rural area, my battery lasted close to the 12 hours it is supposed to last until my area got 4g, then it was lasting less than half of that. I did some research and found that if I turn off the mobile data and the gps when I don't need it, the battery lasts Alot longer. I have a router at home and at work and have set up the phone to use those for internet. I was surprised to read the bad reviews for this phone. I would buy this phone again and recommend it to friends.", "Date": "August 5, 2013"}, {"Title": "Use EHRPD to turn off 4G LTE", "Author": "BEA \"research reader\"", "ReviewID": "R18MC2WSBIMADX", "Overall": "4.0", "Content": "I have a Nexus 7 Tablet with Jellybean... but I had an old LG Dare phone from Verizon that I loved but not data plan. Then Verizon offered me the Loyalty 60 plan that few know about. If you are already a customer of Verizon you can upgrade to a Free Samsung Galaxy Stellar phone with a 2G data, and unlimited everything else for $60. Its great!BUT... we live in a very rural area. My hubby has a Verizon phone/plan through his employer and his Droid phone allowed him to use the Thunderbolt app to shut off his 4G to save his battery from endlessly searching for a 4G signal which we DO NOT have in our area. His battery only lasted 4 hours here at home... my new Samsung Galaxy Stellar was doing the same thing... but the Galaxy with Jellybean seems to look like it was built to block your attempt to shut of 4G. None of the 4G toggle Apps worked...Then... my hubby read that the Galaxy has the option to use a software that fools your phone into thinking it has a 4G signal and its built right into the phone... Verizon geeks didn't know this. Here's howSettingsThen under the Wireless and NetworksMore SettingsMobile NetworksAccess Point NamesSelect EHRPDthen on your phone tap the bottom right triple dotselect reset to defaultProblem... this will not stay put. You have to keep redoing this if you have a lock on your phone. Every time you have to unlock you have to reset! AUGH. But so far it is the only fix around the 4G for people like us WHO HAVE NO 4G COVERAGE AND WANT TO HAVE A BATTERY LAST MORE THAN 4 HOURS! I hope Samsung heard that!I love my phone... that 4G LTE not so much. And the camera... eh, it fine for a phone. And I hear that the battery heats up if you are a HUGE INTERNET/APP junkie... so if you're a smart phone'aholic... this phone won't ring your bell. For a granny in the country; its sweet as a Gospel song on a glory sunrise morning.", "Date": "August 2, 2013"}, {"Title": "Excellent Little Smartphone!", "Author": "William Potter", "ReviewID": "R3UQDH8QS6QMQY", "Overall": "5.0", "Content": "I have had this phone for 5 months and not the first problem.The phone does everything I want a phone to do from making simple phone calls and texts to online browsing, social networking, weather warning apps etc and it is GREAT for running emulators of classic videogame consoles.No complaints whatsoever and the battery life is unbelievable.", "Date": "June 23, 2013"}, {"Title": "You get what you pay for...", "Author": "k.rae", "ReviewID": "R11ZIU9XLT4YQH", "Overall": "2.0", "Content": "I am waiting for my 3rd Stellar to arrive. The camera quit working after three weeks. I have since found I wasn't the first customer to have this problem. Now the replacement arrived less than a week ago. It does not hold a charge. I have replaced the battery and have used a portable battery attachment. The plus side is if you are a novice with smart phones, you can easily manage this model.", "Date": "January 3, 2013"}, {"Title": "Great phone for the price", "Author": "Pamela Lehman", "ReviewID": "R2T1OWETNRI03U", "Overall": "4.0", "Content": "I expected a lot from a Samsung phone and this device has delivered.  Beautiful, bright display and the OS (Jelly Bean) is very user friendly.  I started out in \"starter mode\" and now I'm in \"standard mode\".  Only problem is the camera (only 3.2 mp).  Other than that, this phone is a winner for me.  It's a keeper!", "Date": "April 9, 2013"}, {"Title": "Hate this phone", "Author": "Gavin Knight", "ReviewID": "R3ADVX1LY61X4I", "Overall": "2.0", "Content": "Honestly, the worst smartphone out there. Well, at least for anyone who does more than call someone on their smartphone. The Samsung Galaxy Stellar is a horrible phone. To start off, it only has about 1.5gb of available user storage. The rest is taken up by the OS and bloatware. The feel of the phone is bad, it feels very cheap and plasticity. The camera is horrendous, the zoom is useless, any zoom past 1.5 is way too blurry to get a decent pic out of and all around it is a terrible camera. The OS feels outdated. It runs android Jellybean 4.2 and it doesn't feel right, I mean it feels slow and buggy. Most games run OK, but some are just horrendous on this phone. Plummer's Crack, a relatively simple game, lags and freezes often on this device. Typing on this device....... WORST PART ABOUT THIS DEVICE! The typing is so bad I often have to use a friends phone to text someone. Both keyboards, the Samsung keyboard and the SWYPE keyboard lag so bad and when you try to type, its so delayed you have to wait on average 2-3 seconds for the text to show up in the textbox. You feel the vibrations when you touch the keys, but it takes a long time for the text to actually show up. When the phone tries to bring up the keyboards, it takes forever as well. Calling on this phone isn't as bad. The sound quality is bad. Is sounds like your talking to a robot.. I often have to repeat my self to people because they cannot understand me. The battery life on this phone is probably the only thing that isn't bad. The battery life is DECENT... It last me usually all day on a good charge. The only reason it lasts that long is because I try to use it as rarely as I can, I hate using it in front of my friends too.. I am so embarrassed to have this phone because of how bad it is. My friends have PREPAID phones that are better than this.. Oh, but it gets really good service in my area. The Verizon 4G LTE is really fast and reliable. If you have any questions, feel free to ask! I'm always willing to help!", "Date": "February 2, 2014"}, {"Title": "Good Phone", "Author": "Alex Eveslage", "ReviewID": "R107RK0OY6KIO7", "Overall": "4.0", "Content": "Pros:Virtually Indestructible- I have dropped this thing down at least 2 flights of stairs and dropped it on tile floors constantly. I happen to be very clumsy. Only minor marks on the side. I don't even have a case.Easy User InterfaceUp-to-date with the latest Android VersionCons:No camera flashNot much storage space for music (But I just use Pandora so it doesn't use as much space)Overall: One of the best phones I have ever had, yet there could still be more improvements.", "Date": "February 1, 2014"}, {"Title": "Great Basic Smart Phone ! !", "Author": "Todd", "ReviewID": "R2K8O3W9IUYMPX", "Overall": "4.0", "Content": "THe phone is rugged with the top of the line case from Verizon. Camera not so good since it doesn't have a flash ? Mine works GREAT as a mobile hot spot for my Tab and Computer. Could use a better antenna for better inside building reception. Most phones have serious problems with that issue. NEEDS MORE BUILT IN PHONE MEMORY ! ! ! The \"REMOVEABLE\" battery and micro-sd card are a big plus. I have had it for almost 9 months without any issues. i did purchase a PowerRocks 2600mAh battery stick which charges the phone FAST ! !  Great entry level smart phone.", "Date": "January 23, 2014"}, {"Title": "Amazing phone", "Author": "Tawny Tauscheck", "ReviewID": "R1QP5EZY0W5ILE", "Overall": "5.0", "Content": "I absolutely love this phone! I will have had this phone a year at the end of April and its been nothing but amazing. The phone calls are clear, it processes really fast, the battery life is amazing! The only problems I have with it, is it has no external memory, I have a memory card in it right now and I cant save anything to it, if I could find a way to change that than that would be great! also the camera is okay for a quick photo, would be so much better with a flash.  I would definitely recommend this phone to family and friends!", "Date": "January 23, 2014"}, {"Title": "My first smartphone: underwhelming", "Author": "Pen Name", "ReviewID": "R4G0TZ9JE8L5C", "Overall": "2.0", "Content": "After I had held out for years, my salesman friend at the Verizon authorized retailer talked me into getting my first smartphone, at the unbelievable deal of no cost, no mail-in rebate required. Boy, did I get what I paid for. I started as something of a power user in terms of running apps, and this battery can't keep up with me; I have to charge it frequently. (Also, the cord packaged with the phone started shorting out with exposed wiring in two weeks.) This device can't handle tasks--like clipboard-based text editing and picture display--that would present no challenge to a desktop manufactured in 1996, and I find myself forced to remove the battery about once a day. I get frequent notifications that the RAM is near capacity. Shortly after I got the phone, it had a period of arbitrarily refusing to recognize the additional SD card I have for music storage; this has stopped for now. The camera is low-resolution and has no flash. The speech recognition is accurate, but I couldn't get the hands-free speech control mechanism to work.  On the plus side, the interface is very intuitive (though the \"join contacts\" feature doesn't seem to work right, and the app manager has me scratching my head sometimes) and the touchscreen is quite responsive and fairly accurate, and the phone has survived a few falls with no visible damage yet, but of course I as a first-time smartphone owner have a less than expertly qualified opinion in these matters. Overall I would have to agree with a judgment I've seen posted in a review elsewhere: this is a decent, inexpensive phone for someone who only barely needs smartphone functionality to begin with, but if you use heavily, invest in something that isn't the bottom of the line.", "Date": "December 9, 2013"}, {"Title": "Amazing for it's price!", "Author": "Chris Rush", "ReviewID": "R36EPOLI22C5LP", "Overall": "5.0", "Content": "I just got this phone 2 days ago, it is really cool! It's super easy to use and it has awesome battery life it can last for about 7-8 hours. If i were you i would pick from a stellar instead of a iPhone 4 8-gigabyte. Overall if your looking for a free phone pick the galaxy stellar. I am Chris's son Ian,13 years old.", "Date": "October 18, 2012"}, {"Title": "No Complaints So Far....", "Author": "ChristineInCleveland", "ReviewID": "R2658GFJOZKWJ9", "Overall": "4.0", "Content": "I got my Stellar at a local Verizon store & they didn't offer it free as upgrade, tho I got the price out of pocket for $60. I'm one of the few left with Unlimited Data & Email for $30 a month. I was told repeatedly by various Verizon reps that I had to give it up if I wanted a subsidized phone, or pay full retail for a smartphone.  So the sales rep said he could work around that with some kind of loophole & still get me into another smartphone with unlimited data .  Right now I've had this Stellar a week & everything is fine so far. It does have smaller keys & screen than my former HTC Thunderbolt, & yeah there's no flash. I can handle that alright tho.  Overall I found it fairly simple to navigate, considering the manual it came with was not very helpful after initial setup, which the Verizon dudes did for me. They wanted to sell me an extended warranty for around $100, but we have another line that can be upgraded after end of year.  I do have a Kindle Fire that does all my data tasks so if this Stellar dies after a year I could replace with an upgrade available on another line in our acct.  The graphics are very good with videos playing as sharp as any HD TV. Overall I think its a decent phone, tho I haven't had it all that long. I still think its worth considering. For me, its easier to buy a new phone in person so someone can help me with set up out of the box.  :)", "Date": "March 22, 2013"}, {"Title": "Not an I-Phone", "Author": "Mazz", "ReviewID": "R39Z0OLMKY4SFZ", "Overall": "2.0", "Content": "I like the other reviewer am waiting on my 2nd Stellar, the first one the battery did not hold a charge. Verizon sent me a brand new battery, it too would be drained down by the phone within 2 hours.  Now I'm waiting for a \"refurbished\" phone, that Verizon claims is 100 percent refurbished and tested.  We'll see. If I had a choice to re-pick I would of gotten the I-phone, my wife has it and it seems to work much better than this Stellar phone. The only good thing about this phone was that it was free (with a 2year activation of course).  Unfortunately free doesn't cut it if the phone is less than \"stellar\"", "Date": "January 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0094JWX8U"}}