{"Reviews": [{"Title": "no regrets", "Author": "erika", "ReviewID": "R2DUHPKBV9EIES", "Overall": "5.0", "Content": "works great- great condition- we have had no problems and saved a lot of money. Great phone. nothing more to say", "Date": "November 2, 2013"}, {"Title": "Best iPhone yet!", "Author": "WIMinnesotaWildFan", "ReviewID": "R3KEIQZLI14PMJ", "Overall": "5.0", "Content": "I just got an iPhone 5 for Christmas this year and I just have been loving it so far!Pros:slightly bigger 4\" screen (they essentially just made it taller, the width is entirely unchanged; but now the landscape orientation is true 16:9)4G LTE (the speeds in my market, Milwaukee, are blazing fast!)dual core a6 processor (huge upgrade from the A4 on my iPhone 4)improved front-facing and rear cameras (the front one is now above the earpiece, the rear one is still 8 megapixels like the 4S, but now has a crystal sapphire lens cover and a more separated flash)better feeling home buttoncolor-keyed stainless steel and new two-toned design on the back (which looks stunning for this black & slate color)new, smaller Lightning connector (be sure to get the 30-pin to Lightning adapter for your current accessories)Cons:noneNeedless to say, I haven't been missing my iPhone 4 for a single moment!", "Date": "December 27, 2012"}, {"Title": "Great Phone", "Author": "Londonnoise \"Robby\"", "ReviewID": "R2F2MOCT7UAS9X", "Overall": "5.0", "Content": "Pretty easy to diss the iPhone (especially if you prefer other devices), but this really is a hardware and software triumph. Beautifully built, amazing screen and an easy to use OS that also has some depth to it. You'll like iOS or you won't, but it's undeniable that this is an amazing device.", "Date": "November 18, 2013"}, {"Title": "Exactly As Described", "Author": "Erica Steinson", "ReviewID": "R2VUZ62HJF3K9I", "Overall": "5.0", "Content": "This phone was exactly what the description said it was. I was a little hesitant, since it was somewhat of a risk, but it was unlocked, gently used, and functioning perfectly. I'm very happy with my purchase.The USB-outlet converter plug didn't work, but that was easily replaceable, so not an issue whatsoever.I ordered it with standard shipping & I had it within a week. Very very happy with my purchase, thank you!", "Date": "February 25, 2014"}, {"Title": "great", "Author": "Larry", "ReviewID": "R3G7IU2FO5IF9V", "Overall": "5.0", "Content": "Not one scratch. Just as advertised. I got it faster than expected and I will buy again when needed. Thanks a lot!", "Date": "January 24, 2014"}, {"Title": "Not good", "Author": "paula erika denisse p matriano", "ReviewID": "R283UVMFNY2YIW", "Overall": "1.0", "Content": "It have alot of scratch. And It looks like its really used. I dont think i will buy again here.", "Date": "April 4, 2014"}, {"Title": "GOOD PRODUCT EXACTLY WHAT I ORDERED", "Author": "Dwayne Mangus", "ReviewID": "RQ5OW6GF2MV9R", "Overall": "5.0", "Content": "EXACTLY WHAT I ORDERED THE PHONE IS WHAT I ORDERED FOR MY GRANDSON, HE SAID IT IS EXACTLY WHAT HE WANTED, WORKED GREAT....", "Date": "March 24, 2014"}, {"Title": "Iphone 5", "Author": "MSB", "ReviewID": "R2ISKVAG8NZLZ3", "Overall": "4.0", "Content": "Recently upgraded from Iphone 4-5.Likes:Larger screen, faster access time on web, panoramic camera, improved clarity in calls.Dislikes:Map app needs improvement. When working, properly, the app is much improved over the iPhone 4 version, however I was late to a recent business meeting when the map sent me to the wrong office building several blocks from the correct address.  Once an update is available, this should be a much improved and usable app.If purchasing the extended warranty make sure it is within the month of purchase.  I purchased phone from AT&T; and wanted to buy the warranty from Apple. After sorting out the details to purchase the warranty, the 30 days had just lapsed and  Apple would not allow the purchase (warranty). Would also suggest that an adapter is purchased for earlier cables at same time phone is bought if you have a number of older style cables and accessories still being used.Would give it 5 stars if not for the maps. Otherwise, quite satisfied with phone at present time.", "Date": "October 31, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0097BX26C"}}