{"Reviews": [{"Title": "Be very careful when buying this phone used", "Author": "Scott B", "ReviewID": "RW698M4TY7PX3", "Overall": "4.0", "Content": "I bought from the seller smartphones2588 and when I got the phone it worked fine then it popped up on the screen that there was an update which I was expecting I updated it to the official AT&T; JB 4.1.2 through an Over The Air Update. That is when the problems started the battery would not charge at all until I reset it back to the official AT&T; ICS firmware.The seller claimed that this phone was not supposed to be updated which was a lie I finally found a shop that charged me $35 to fix the problem and I am updated now and it is working fine.During my quest to fix this problem I called Samsung and they told me that the phone had been modified from the original firmware.I would be very careful if you buy this used and if you do buy used buy directly from Amazon so if you need to return it there will be no problems.Once I got mine fixed it works great and is a wonderful phone with a great screen and it is very responsive.", "Date": "August 20, 2013"}, {"Title": "Good cell phone", "Author": "miguel jordan", "ReviewID": "R1W9TK6QTSPANP", "Overall": "5.0", "Content": "This is a complete phone for those who are staring in android and want a phone with all functions, great camera, a good processor and rom memory", "Date": "January 23, 2014"}, {"Title": "Great phone", "Author": "Freddy R. Bonilla", "ReviewID": "R3LRWG8SNXW8J1", "Overall": "5.0", "Content": "This phone is very good, decent processor and my wife loves it, it was worth every penny we paid for it", "Date": "December 15, 2013"}, {"Title": "Good", "Author": "Pratik Babariya", "ReviewID": "RY8QHABFHUTKA", "Overall": "4.0", "Content": "I like it; I did not compare with iphone but not bad. I buy as a spare phone but it work as regular.", "Date": "February 26, 2014"}, {"Title": "Great phone", "Author": "Mateo Castillo", "ReviewID": "R2MD2FF76OAD15", "Overall": "5.0", "Content": "Ordered the phone Thursday got it on Monday. It is used but looks just like new. Fast delivery, I got this phone since I had a phone with a broken screen and this is my first samsung. I didn't know if I would like a samsung but my wife recently got the Note 3, and I liked it but I wanted something similar but not too big. This phone is perfect and for a used phone that looks new not a bad price.", "Date": "February 25, 2014"}, {"Title": "Galaxy SII", "Author": "Chris S.", "ReviewID": "R3SGD563M8F0ZB", "Overall": "5.0", "Content": "Samsung like always a great phone and very user friendly. Galaxy's are a must have smart phone 5 stars all the way", "Date": "August 31, 2013"}, {"Title": "celular good", "Author": "WILSON MEJIA", "ReviewID": "R2L6HVTUO1EC2B", "Overall": "4.0", "Content": "Hello To allthe equipment is ready a nd work perfect the battery is damaged but is not important....Wilson Mejia", "Date": "August 12, 2013"}, {"Title": "DO NOT BUY", "Author": "jason", "ReviewID": "R8OTM8WRA4OY4", "Overall": "1.0", "Content": "I not only had a heck of a time trying to order this for my husband, but it had so many issues. already broke and he only had it for a few months. I wish i didn't buy this phone at all not to mention for full price when i can now get it for 89.99.", "Date": "November 20, 2013"}, {"Title": "GSM is a missleads", "Author": "magdalene gomes", "ReviewID": "R2XT68170I3OD3", "Overall": "2.0", "Content": "this is only AT&T; service!!! does not work on any GSM i even though it says it works on any GSM SIM. Very disappointed, so had to return it.", "Date": "September 9, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0099HIW5A"}}