{"Reviews": [{"Title": "Seems like a great little phone", "Author": "Jim", "ReviewID": "R2OYRKYZOBJGGZ", "Overall": "4.0", "Content": "It might even be worth 5 stars, I haven't had it that long. As other reviews have pointed out this arrives with the language set to Spanish and a manual in Spanish. However, an English manual is easy to find online in pdf. Using this it's easy to change the default language of the phone, even without the manual a little scrolling around would do it. So don't let this language issue bother you.I was afraid it would be too small but it's about the same size, and similar in appearance, the the Samsung I've been using. It's small but not unusually so. Despite the small size the sound is fine and the volume is capable of going quite high.There are a lot of features for such a small cheap phone. I'm still figuring these out, which is a bit of a challenge when you're used to a different phone with a somewhat different layout. However, I really just wanted to be able to use the phone and send/receive simple occasional texts. With two SIMS.The dual SIM feature is great as long as it works when I add a second one in another country. I took the ATT Gophone SIM out of my  old phone and put it in this one and everything worked fine right away. It looks easy to use two SIM cards at once but we'll see.Since I just received this I can't comment on durability or longevity. But it appears to be as well made as my otherphones have been, all of them budget models and all of them having lasted long enough.I don't leave many reviews but I especially wanted to dispel the myth that language is a problem - just download the manual in English or your other preferred language, change the default setting on the phone, and you're set to go.", "Date": "June 1, 2013"}, {"Title": "So far, seems like a great deal", "Author": "notwarrenbuffett", "ReviewID": "R1RV3SBX1CST0D", "Overall": "4.0", "Content": "I've had this phone for about 2 weeks now, and bought it to use while traveling internationally.  Here's what I've discovered so far:1) As others have posted, the instruction manual that comes with the phone is in Spanish.  If you're not fluent in Spanish, consider downloading the English manual BEFORE the phone arrives (easily found via Google).  (See point 8, also.)2) The first picture instructions you see upon opening the box show you how to remove the back.  I still couldn't do it.  I was lifting the little lifting slot on the bottom of the phone (step \"A\" in the picture) but it would barely lift one millimeter and if I tried to change my grip, it would drop shut again.  I looked around for suggestions in other Amazon reviews but couldn't find any tips.  Then I finally decided to apply some more pulling pressure on the little lifting slot and the tabs holding the back to the chassis gave way--at first I was afraid I might break it, but it turned out OK.  (Later on I decided the best way to open this thing is with some kind of thin flat-blade tool. A dime works too: twist the dime to lift the slot and crack the seal, then slide the dime around to the side as you twist it.)  The back feels like a really flimsy piece of plastic, but for under $40 for a dual-SIM phone, I'm not complaining about that!3) I put in the battery and the screens came up in Spanish (no surprise, now).  I know just enough Spanish (and icons) to figure out how to switch it to English in less than a minute.  (a) Left soft key (menu). (b) Select the gear icon [second row of icons, on the left; not the icon with the phone AND the gear, like I tried the first time] (c) select menu option 2 \"Configuración de teléfono\" (d) select menu option 3 \"Idioma\" and you should be able to figure it out from here.  Then use the right soft key \"Back\" until you're back at the main menu.4) After activating the phone (with H2O Wireless, which wasn't exactly an intuitive process, but I figured it out reasonably quickly) I successfully used the menus to configure some appearance options, and set the time and date (before finding the setting to keep it automatically updated).  But then I couldn't figure out how to simply place a call!  It may have had something to do with a SIM card setting I changed.  When I set that back the way it had been before, I was able to simply hit the number keys & dial my call. (And as others have said, the keys and their labels are REALLY tiny!  I'll definitely be using my bifocals for this phone!)5) The Call/Answer key not is not labeled with any icon, or in the usual green color, so that's not helpful, and its location will simply have to be memorized.6) The first time I received an incoming call, the ringtone was HORRIBLE, with laughing baby sounds!  So the next priority was to figure out how to change that!  Found it under User Profiles, and I couldn't find a SINGLE built-in ringtone that I liked.  Good thing I checked other settings because the default SMS Message notifier was the same incredibly annoying laughing baby sound!  (A couple of weeks later I figured out how to create my own custom ringtone, which I'd never done before, and it worked fine.  In short, I used iTunes to create the MP3 audio clip from a song, then used Bluetooth to send the MP3 clip from my laptop into the phone, and assigned it to the \"profile.\")7) I had great difficulty installing the second SIM card, into the #2 (top) slot.  I was trying to slide it in flat, parallel to the SIM in slot #1.  I finally figured out that if I tilt it up before trying to slide it in, it goes in easily.  After testing the phone for a few days with a new H2O SIM and their cheapest option (a $10 PIN), I had them port in my existing Page Plus number.  Once that was complete, I could use the Dual SIM feature, and after figuring out a few things (like configuring two different voicemail inboxes, and trying to find out what happens when I switch the SIMs between slots), I had no trouble making or receiving calls or texts on either SIM.  Usually an extra step or two is involved in each case (mainly when dialing or texting--you have to let the phone know which SIM to use), but it's not a big deal.  Honestly I don't expect to really NEED to have two active SIMs at once, but for only $40, why not?  I'm planning to do some long-term overseas travel, and I figured that this way I can have a cheap U.S. phone that's immediately ready to work when I land back in the U.S., as well as a way to have a cheap local number in most every other country in the world.  (The cheapest setup I've been able to find is H2O's Pay-as-you-go, which for $10 every 90 days will keep my U.S. number alive; I will have to manually \"recharge\" it over the Internet every 90 days, but I don't think that will be a problem.  Their auto-recharge system's biggest time interval is 30 days, currently.)8) It was a bit of a headache to figure out how to get this thing to use data on H2O Wireless, but I eventually figured out most of what I needed to do to configure it to at least browse the web (old-style \"WAP\" mobile sites, only).  Turns out the built-in web browser (Opera Mini) is also in Spanish and I haven't yet figured out if it's possible to change that.  Of course, the pages you surf to are still in whatever language you want, but (assuming there's no way to change the browser language) it will help to know a bit of Spanish to use the few menu choices to navigate the browser.  I haven't found any kind of built-in email client, but I successfully checked my main email account (Yahoo).  It's painful to use, but it might help in an emergency.So I've been using the phone for only 2 weeks now, in the U.S. only, but I haven't yet used it for the main purpose for which I bought it, which is to travel internationally and pick up cheap local SIM cards to use as I go.  But I've been happy with the overall performance and the sound quality (and my elderly mother says she can hear me better on this phone than on my previous Verizon Motorola Droid X2).  The battery life looks like it's going to be great, and it's very tiny & light weight--I hope it will be a very good traveling phone (and one that I won't worry about if it gets lost, broken, or stolen).One other note:This phone uses \"Mini SIM\" cards (25 x 15 mm, sometimes also referred to as \"Standard SIM\" cards).", "Date": "September 23, 2013"}, {"Title": "Value Value Value", "Author": "LingCPA", "ReviewID": "R1H2CRW9206LKO", "Overall": "5.0", "Content": "Does the job, slim and easy to use.  Would recommend anyone who uses a phone for a phone (i.e. not smart phone) and light texting.", "Date": "March 21, 2013"}, {"Title": "a defective phone?", "Author": "h0804river", "ReviewID": "RPFPXPBYGGXSM", "Overall": "1.0", "Content": "When I received the phone, no matter what I did it was impossible to hear the person calling me.The pre-set ring tones are awful (baby laughing - really?).The phone wasn't very intuitive even though it isn't that different from my last phone.I'm very glad that the vendor allowed me to return it even though it was a couple of days past the deadline (I kept trying to fix the problem).  Maybe I just got a defective model, but be aware this is a possibility.", "Date": "November 18, 2013"}, {"Title": "Worked Perfectly For What It Is", "Author": "Amazon Customer", "ReviewID": "R3KAU1QWS92LME", "Overall": "4.0", "Content": "My personal phone is paid for by my company and isn't GSM, so I bought this as a solution for travelling through Europe.  I think it worked perfectly.  I used this phone through Czech Republic, Austria, Slovakia and Hungry w/o any issues.  This doesn't have data access or all the bells and whistles of what I would want in my daily life; however, as a solution for buying a SIM card in a foreign country, this works perfectly.  In the two cases where I bought SIM Cards (Czech Republic & Austria), I was able to activate them using the SIM card instructions and use the phone immediately.  There are only 2 things I would warn about the phone, which is why i've given it 4 instead of 5 stars.  1) the factory setting comes with the language set to spanish and directions in spanish only.  You'll need to know (or have a friend who knows) spanish to change the language setting, since its require going through a number of menus to get to the language preferences.  2) The phone does not save a copy of outgoing text messages, so you can't go back to see what you said to a person.  Potentially not huge issues, but things to be warned about if this is important to you.", "Date": "October 14, 2013"}, {"Title": "Better than expected", "Author": "cafc66", "ReviewID": "RR4D1RYBJ5KA5", "Overall": "5.0", "Content": "I bought this for my wife's aunt, she lives abroad and needed a dual phone. I tried it here before travelling, with a T-Mobile and an ATT card, worked great, better call quality than my old BB Curve 8100 and as good as my unlocked iPhone 3GS. Lightweight and probably not super high quality but so far it has been reported to work perfect", "Date": "September 2, 2013"}, {"Title": "Small!!!!", "Author": "ISLAND GIRL", "ReviewID": "RIDZ4MFN6VMQJ", "Overall": "4.0", "Content": "I have been using this phone for about 2 weeks, both sims works fine and what I like is, it prompts you when making a call asking which sim, my previous dual sim phone you had to go in and choose the sim to make the call from.The phone is smaller than I expected and that makes the keypad small however as soon as I got accustomed to it, it was good, overall, for the price you really couldn't ask for much more.", "Date": "August 27, 2013"}, {"Title": "Works well for kids", "Author": "Yuriy E Sokolovsky", "ReviewID": "R1Z4A7TLFDSH5Z", "Overall": "5.0", "Content": "The phone works well for kids on T-Mobile USA's network for talking and texting. No internet or MMS. The quality of this Huawei G6620 is very good. I am very pleased with my purchased item.", "Date": "August 29, 2013"}, {"Title": "excellent", "Author": "HENRY BRICEÑO", "ReviewID": "R3MB1JRA7TMUK5", "Overall": "5.0", "Content": "excellent product is in very good condition because I get everything perfect and I am very pleased with the seller because all the products specified characteristics are equal to the publication. very good product I am very pleased with my purchased item", "Date": "March 7, 2013"}, {"Title": "Workable phone.", "Author": "Li Pi", "ReviewID": "R3PLP6L5DIGPNZ", "Overall": "4.0", "Content": "Needed a phone with a long battery life for travel. This fits the bill. It doesn't really run apps very well, but handles texting and calling nicely. Getting data setup was pretty difficult, but eventually figured it out.", "Date": "January 31, 2014"}, {"Title": "Gustavo Celso Atencio Chourio", "Author": "Gustavo Atencio", "ReviewID": "R36VWIYX0WBMQS", "Overall": "1.0", "Content": "The HUAWEI phone is imperfect... is blocked. I can't use it. I can't use it doesn't recognize the chips. I hete it.", "Date": "January 26, 2014"}, {"Title": "It works well, and is relatively simple to useq", "Author": "Izzy", "ReviewID": "R1RM01MQT7E638", "Overall": "4.0", "Content": "I got this for someone who was travelling who had difficulty using other cheap phones. The interface is simple, the phone is sturdy, and they're able to use it easily.", "Date": "January 22, 2014"}, {"Title": "GREAT!!!", "Author": "Zulmira Salazar", "ReviewID": "R3NFOE2TBI2UNH", "Overall": "5.0", "Content": "Great! Excellent! It works great! I love it! I bought it for my two others lines! I bought 3 for family!", "Date": "January 10, 2014"}, {"Title": "Waste of money", "Author": "Courtney Phillip", "ReviewID": "R3K9T5XGYI3P63", "Overall": "1.0", "Content": "After 3 months of using this phone it kept cutting off on its own and I will only know its off when I'm about to make a call. Now it refuses to turn on altogether. The phone did not fall nor was it abused in anyway whatsoever. Very disappointed!", "Date": "January 4, 2014"}, {"Title": "Great buy!", "Author": "Nga Nguyen", "ReviewID": "R1H1D8EL8PXYUV", "Overall": "5.0", "Content": "Bought this phone to use as a backup in Vietnam. Figured my AT&T; phone would work over there. Nope. Very glad I bought this! All I did was pop in a Vietnam SIM and worked great over there. Was in Vietnam for a month and probably only had to charge this phone a handful of times. Can't beat the price!", "Date": "December 12, 2013"}, {"Title": "don't like it", "Author": "Faye Ngai", "ReviewID": "R36TIBELT66C4D", "Overall": "2.0", "Content": "It sets up as Spanish, and it took me long time to switch back to English. Some times the phone can't turn on even the battery is full. Have to take out the battery many times before it works again.", "Date": "December 9, 2013"}, {"Title": "Good little phone", "Author": "K. Chason", "ReviewID": "R1RWCOQQCI6Y7K", "Overall": "4.0", "Content": "Works fine. I needed a replacement for my candybar phone that I lost...somewhere. Wanted one that was easier to text with but not as pricey as some of the \"name brand\" phones. Yes, it does come in Spanish; rudimentary knowledge of the language will help with converting the menu to English, but there are user manuals online. I took it down to T-Mobile, they popped a new SIM card in, the phone works on their network with no problems. Good reception, battery life is fine. Nice selection of tinkly ringtones. Only complaint is that it flies apart easily if you drop it, but the plus of that is that it didn't break.", "Date": "October 21, 2013"}, {"Title": "The phone came in Spanish!", "Author": "Camiel", "ReviewID": "R1HNJAQS9SIIXF", "Overall": "4.0", "Content": "Thank goodness I knew a little bit of spanish to help me change the settings to English. Its very light but seems sturdy enough for decent use. The keys are small but shouldn't be a problem if your fingers are small enough and if you have pretty good eye sight. It's a simple enough phone. I bought it for my husband, he's 50 and likes it very much.", "Date": "October 14, 2013"}, {"Title": "Nice little phone with battery that does not last.", "Author": "dlor", "ReviewID": "R20PI8S5Y1GYLI", "Overall": "1.0", "Content": "Battery problem - it does not last.Nice little phone with battery that does not last. It was a waste.", "Date": "October 12, 2013"}, {"Title": "Great Phone", "Author": "DJ", "ReviewID": "RBO37A29KECRR", "Overall": "5.0", "Content": "This is a nice phone with great reception and dual sim advantages as I was carrying two phones (work and private). I am amazed they can sell this so cheap.", "Date": "September 14, 2013"}, {"Title": "Almost perfect", "Author": "Robert F. Hunka", "ReviewID": "R2VFD2P76ZCATE", "Overall": "4.0", "Content": "The the factory sealed phone arrived before the promised Delivery Date. Set-up and hook-up in two countries with two SIM cards was no problem. The only (slight) problem was a phone set for, and Instruction Book written in, Spanish. Downloaded the English version. All is well.", "Date": "September 9, 2013"}, {"Title": "Does the job", "Author": "not worth the 99c", "ReviewID": "R2M6MEYXN0EOBZ", "Overall": "4.0", "Content": "I just receive this phone for my 12yr old son. It came looking new. However, everything was in Spanish. No English anywhere. Fortunately, I was able to figure out where the language settings were and changed it English. However the manual was in Spanish as well so I've had to download an English copy from the Huawei website.There appear to be previous texts leading me to believe it may not be entirely new. However, its a sturdy little phone, works well for the price as I needed my son to have a texting phone. He also likes the radio and some of the basic ape it has. I'm sure after I go through the owners manual it will explain things I havent been able to sort out yet. Or just give it to my son. They figure everything out themselves anyway. :)So far its well worth the price and does have internet capabilities if you have a data plan.", "Date": "September 7, 2013"}, {"Title": "Great cell for the price.", "Author": "Buyer From Dom. Rep.", "ReviewID": "R31R7TYZBE8KXM", "Overall": "5.0", "Content": "I consider this has been a great buy. The quality of this Huawei G6620 is surprising. I'm glad I bought it.", "Date": "July 28, 2013"}, {"Title": "Good Cell Phone", "Author": "Moicam.", "ReviewID": "R15T4KAR8I8G0T", "Overall": "4.0", "Content": "The phone is rugged, comfortable and lightweight .. has an easy to use menu. I put my sim card in and it worked instantly movilnet", "Date": "May 27, 2013"}, {"Title": "So far so good!", "Author": "burkiboro", "ReviewID": "RSQ69MLVR5VDC", "Overall": "4.0", "Content": "It is working well with my carrier here and I hope it will when I travel overseas. So far I like the functions and it gets the job done.", "Date": "May 5, 2013"}, {"Title": "Gift", "Author": "Pa", "ReviewID": "R22E8K64F8K63I", "Overall": "5.0", "Content": "This was a gift for a family member who lives outside the United States, suffice to say that he loved it.", "Date": "April 3, 2013"}, {"Title": "Only buy if you speak Spanish.", "Author": "ELLEN", "ReviewID": "R5EF7W9D6FVLN", "Overall": "1.0", "Content": "The directions are in Spanish.  It gets very limited service. Not a good option for my needs. I do not recommend this.", "Date": "December 11, 2013"}, {"Title": "Question?", "Author": "Amy Rodriguez", "ReviewID": "RKRV1YRGY0JA", "Overall": "1.0", "Content": "I didn't rate this well because I have a question that I hope some one can answer. I currrently have the iphone 4 that is severely damaged on the outside. But my phone works perfectly fine. I'm interested in buying this phone as a replacement and I plan to just use it in the U.S. my question is, will this phone work for Verizon because I am currently under a 2 year contract?", "Date": "November 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009G292OI"}}