{"Reviews": [{"Title": "So much for technology", "Author": "Dan", "ReviewID": "R29XZYUCB65VO9", "Overall": "1.0", "Content": "I bought one of these dogs and it lasted three weeks before the battery would no longer charge. The initial phone could not hold a charge longer that 30 or so hours. I received a replacement and apparently the company was aware their batteries were insufficient. The new one came with a battery three times as big which now protrudes out the back a half an inch and weighs almost a pound. It feels like someones hand is in my pocket now though it has extended the charge a whole six hours! With all the fabulous technology in this highly advanced phone it lacks one of the most important features necessary in a phone, the ability to redial a number from someone that has called you. That is apparently a service for this phone that must be paid for and not available to prepaid phone users. I liked the features on the phone but they are useless without an extension cord.", "Date": "November 4, 2013"}, {"Title": "The phone might be good if it had a decent battery!", "Author": "Shopper", "ReviewID": "R232KRYVMJASQF", "Overall": "1.0", "Content": "I regret buying this phone. I feel I was cheated. The battery life is non existent. I have to charge the phones battery daily and I only make approximately 4 calls per day at about 5 minutes or less per call.", "Date": "August 16, 2013"}, {"Title": "not good service.", "Author": "Kimberly Lapointe", "ReviewID": "R3L6TYKM5FQ4CY", "Overall": "2.0", "Content": "the phone itself is durable like he wanted. The only problem is it doesn't get good service.. This phone is used for business. Good service is a must.", "Date": "June 14, 2013"}, {"Title": "casio", "Author": "brandy", "ReviewID": "R3KSB8WG41S1M5", "Overall": "5.0", "Content": "Casio phone is working good so far for my sons first phone. It seems to be easy to use for him.", "Date": "January 10, 2014"}, {"Title": "It can teleport you up to 3,000 miles", "Author": "Michelle Gabriel", "ReviewID": "R3HOVWNXFQPM8S", "Overall": "5.0", "Content": "At 6,000 dollars, it's a steal! 10/10 it flies and dispenses your favorite soda. Bad reception, but it's a good price.", "Date": "November 14, 2013"}, {"Title": "Phone works great for me except no web browsing for Page Plus Celluar", "Author": "OldRaschal", "ReviewID": "R2HMJBA028ICCI", "Overall": "3.0", "Content": "I like the phone okay but, I do feel it is a replica of the older version. Phone will not get on the Web service for PagePlus Cellular maybe Verizon I do not know.", "Date": "March 2, 2013"}, {"Title": "just like other reviews-", "Author": "Russell Butler", "ReviewID": "RZEIS0AG051JF", "Overall": "1.0", "Content": "rugged but lowsy speaker, battery very poor, echos, pretty color,would not recommend to anyone but hey I do not want to buy a smart phone at the moment so it will have to do", "Date": "February 28, 2013"}, {"Title": "PHONE WONT CHARGE THE AREA WHERE YOU CHARGE IT IS TORN-UP", "Author": "tina stevens", "ReviewID": "R19FRAU8M64GR9", "Overall": "1.0", "Content": "THIS ITEM IS TORN-UP THE CHARGEING AREA IS MISSED UP...THE WHILE CHARGEING THING PULLS OUT AS YOU TRY TO CHARGE IT.", "Date": "February 26, 2013"}, {"Title": "Outstanding product", "Author": "Brandon Mildren", "ReviewID": "RYXG130SC9KUK", "Overall": "5.0", "Content": "Works great looks good and is best if you are rough on phones like I am.  My second Gzone phone and I have liked them both.", "Date": "December 18, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Military Spec. 810F for: Water, Shock & Dust Resistance, Immersion, Vibration, Salt Fog, Humidity, Solar Radiation, Altitude, Low and High Temperature Storage. A-GPS LBS/plus compass\nHigh speed internet enabled* (EVDO)\nStreaming Video\nCamera with Flash\nYour purchase will include a Cell Phone, Rechargable Battery, and Wall Charger", "Name": "Casio GzOne Boulder Water Proof Orange Camera Cell Phone Verizon or Page Plus Pre-Paid No Contract Required", "ImgURL": "http://ecx.images-amazon.com/images/I/31GsDLV9QIL.jpg", "ProductID": "B009MBLNFY"}}