{"Reviews": [{"Title": "Better than expected", "Author": "PuntaCana Mike", "ReviewID": "R3PUNFMN9BV2KM", "Overall": "5.0", "Content": "I don't know but call me old! I can not find anything I do not like about this phone. Size is comfortable. Call quality is great and the interface is easy to figure out. Have not tried the water test yet, but I know sooner than later I will forget it is in my pocket when I jump in the pool.", "Date": "January 3, 2013"}, {"Title": "Motorola Defy XT535", "Author": "James C", "ReviewID": "R1FZCANLWPWUBI", "Overall": "1.0", "Content": "This phone had some really great features I liked. Easy to use,you could record a call you were on  and a few other neat things preinstalled. Looks nice, feels good. But it kept freezing up. Had to remove the battery to get it working again several times aday.", "Date": "February 11, 2013"}, {"Title": "Solid cheap device", "Author": "Shane", "ReviewID": "R3ARIBYX06BSXM", "Overall": "4.0", "Content": "The XT535 is a solid phone. It is a little under powered compared to the top of the line devices but it's also hundreds less. I have had a few strange things happen with random reboots, but this is my first unlocked phone so I'm not sure if that's a problem with the SIM I'm using for service or the phone but it hasn't caused any problems and has only happened once in the month that I have had it. Battery will usually last me between 24 and 36 hours but I'm not a heavy user by far. It came with a 2 GB micro SD card in the slot when it arrived it seemed a bit hard to get out but the trick is to slide it loose from the contacts then face the screen toward you and it will fall out. Full specs in the link below.[...]", "Date": "December 14, 2012"}, {"Title": "Not for T-Mobile in US", "Author": "Foster", "ReviewID": "R1HYTU0CKRRTR8", "Overall": "2.0", "Content": "Does not to Data on T-Mobile in US.  Connects 2g only and 2g will not do Data on this phone.  May be OK for AT&T.;", "Date": "January 8, 2013"}, {"Title": "the phone is great ,,,but has small  some issues, at setup", "Author": "juan", "ReviewID": "R2M0OQNV8SIWQR", "Overall": "4.0", "Content": "i bought the phone for a very good price  refurbished for  109.99. plus shipping and handling 129.00 next day air ,i ordered it on a Wednesday,, i got it on Monday,,  ,it came unlocked ,,,and had some data,,  mms apn setup problems ,low signal , the gps didn't  work properly,,,,i had connect to the internet through wifi and download these apps so the phone would work properly 1-[tweaker]  mms apn setup app which setup my phone to t mobile ,,,,then i got a gps app that got to work,,and setup the gps ,,navigation,,,and another for the signal ,,after all that ,,the phone is good ,,,the camera ,,,, recording video is good,,but sound is not that good,,,the display is great,,the graphics on the games are beautiful,,,dead trigger --a game that looks and  proves that the phone looks great  in gaming ,,,after putting the wallpaper and setting  all the apps  ,,which didn't take too long ,,, the phone looks and works good ,,this phone is supposed to be just as good as the Motorola defy plus and better than the 525 so after all i can compare to other more expensive android phones ,,,oh and the battery is great ,,the internet  on [wifi] looks great plays full videos and sites with e-zz so ,,so far  ,,it  is good ..", "Date": "April 4, 2013"}, {"Title": "jt", "Author": "JESUS TOVAR", "ReviewID": "R23PLI50MXWUGA", "Overall": "5.0", "Content": "veryvery good, good size, color chosen. Adjustable exceed expectations. according to the proper use, recomendado al 100% para cualquier persona", "Date": "February 21, 2013"}, {"Title": "Good phone, some problems", "Author": "Sarah J", "ReviewID": "R3R1YMZJJA3EU2", "Overall": "4.0", "Content": "I bought this phone because I wanted something that would not break on me. It it certainly very durable and has yet to scratch though I keep it in my pocket with keys and coins and don't use a screen protector. However, my proximity sensor was broken from day 1 and this caused the phone to freak out when I'd actually try to use it as a phone. I ended up rooting it and flashing the Chinese version of ice cream sandwich, which did not fix the sensor but it stopped freezing in-call. Other than that, the phone is pretty fast for the price and runs ICS smoothly, once you root it and get rid of all the Motorola bloatware... :)", "Date": "February 25, 2013"}, {"Title": "The phone was faulty, couldn't write, did not charge the battery", "Author": "Marcela", "ReviewID": "R2GD7CTXJVJG6M", "Overall": "1.0", "Content": "This phone was useless, I couldn't write anything, the virtual keyboard dindn't pop up. The battery didn't charge, It displayed a message of \"invalid battery\" I bought another battery and the problem persisted.I returned it to Amazon, they did a great job refunding me the cost of the telephone and the cost of the shipping from Argentina.", "Date": "June 5, 2014"}, {"Title": "REALLY GOOD PHONE!", "Author": "William Holmes \"Woodshed Bill\"", "ReviewID": "R23FNYR043RG6W", "Overall": "4.0", "Content": "I bought this phone a few weeks ago.  Waited this long to insure that I knew the quality of my purchase before I commented.  I don't use a cell phone much but this one is really different from previous models I've owned.  The battery life is exceptional and the sound quality is the best I've heard.  I'm a bit hard-of-hearing so I use the speaker phone mode most of the time.  It works great.  Additionally, I'm a cheap bugger so I have a pay-as-you-go program with AT&T.;  I'm actually thinking of spending the money so I can get some of the applications offered by the other contract type programs.Anyway, this is a quality phone and I think you'll enjoy one as much as I do.", "Date": "June 4, 2014"}, {"Title": "No thanks.", "Author": "Mr Peve", "ReviewID": "R2J3T5UFJD1TFK", "Overall": "1.0", "Content": "Not a good purchase. All apps were in chinese. Could not download any new apps. Had to send it back.", "Date": "May 22, 2014"}, {"Title": "The speaker is damaged", "Author": "Carlos Humberto Mejia", "ReviewID": "R3UZH2JPBSEOWD", "Overall": "1.0", "Content": "When you make a phone call you hear strange noise and the other person can't hear you. I travel to Honduras to use it but is not working. I can¨t return it because I'm on another country.", "Date": "March 3, 2014"}, {"Title": "Bait and switch tactics", "Author": "Douglas Lyon \"docjava\"", "ReviewID": "R2GPC9U22YMMGH", "Overall": "1.0", "Content": "Using this phone and republic wireless will require you to use their unadvertised $19/month rate.Jon M. (Republic Help)Dec 23 04:23 PMHi DL,Sorry for the confusion with our first response but you can not get the $10 plan on the Defy. They only plan available for that device is the $19/mo plan.Thanks,Jon M", "Date": "December 24, 2013"}, {"Title": "Better than expected", "Author": "yskander flores", "ReviewID": "R22JH49LFF66E8", "Overall": "5.0", "Content": "I can not find anything I do not like about this phone. Size is comfortable. Call quality is great and the interface is easy to figure out.This phone had some really great features I liked. Easy to use,you could record a call you were on and a few other neat things preinstalled. Looks nice, feels good.", "Date": "December 18, 2013"}, {"Title": "averia", "Author": "viviana blanco", "ReviewID": "R21FZH8C707OUB", "Overall": "3.0", "Content": "I need to know if the smartphone still has warranty and that fell into the water and stopped working .", "Date": "July 2, 2013"}, {"Title": "Awesome phone!", "Author": "Paulo Roberto Casarin Benetti", "ReviewID": "R10JZRFD9UKJY4", "Overall": "4.0", "Content": "This a good and solid phone. The best option for those who doesnt want to spend a lot of money.", "Date": "January 23, 2013"}, {"Title": "Great  Duriable Phone", "Author": "Amazon Customer", "ReviewID": "R38CNQ06P194FR", "Overall": "4.0", "Content": "Perfect Duriable phone, Just a little small for my hands.  But works really good for and Android Phone. needs more RAM!!  Perfect for a really active person, water resistant, dust proof, and shock resistant.  OK to put in pockets and forget about, and never damage it....", "Date": "January 1, 2013"}], "ProductInfo": {"Price": "$229.99", "Features": null, "Name": "Motorola Defy XT535 Unlocked GSM Phone with Android 2.3 OS, Touchscreen, 5MP Camera, GPS, Wi-Fi, Bluetooth, FM Radio and microSD Slot - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/410OwuyBm6L._SY300_.jpg", "ProductID": "B009AY88B0"}}