{"Reviews": [{"Title": "Great Phone But....", "Author": "ANDREA", "ReviewID": "R32B43E7G83KSC", "Overall": "3.0", "Content": "I love this smartphone....it really lives up to the hype in all that it can do. My problem with this handset though is that it freezes a lot and i find that i constantly have to be pressing the reset button.At times the screen goes black and i literally have to open the phone and take the battery out and re insert it before it works again. The memory on the device is not even half full and i purchased this device in October 2012 so i expect that it would still be working well.....", "Date": "April 15, 2013"}, {"Title": "perfect", "Author": "Liliane C. Brooks", "ReviewID": "R1A92EPPDDMOL8", "Overall": "5.0", "Content": "All I need in a smartphone. love the size, the screen is vibrant and has more features than I can even use.", "Date": "April 23, 2013"}, {"Title": "I love this phone.", "Author": "Erika Assebbane", "ReviewID": "R5GQLEW6L2ITT", "Overall": "5.0", "Content": "I do everything on it. It has replaced my laptop.  My old phone iphone 4s didn't even come close to the performance of this phone. I'm writing this review from it.  I would not change it for another. Not even the 4s.", "Date": "October 22, 2013"}, {"Title": "The best phone I've had!", "Author": "DR", "ReviewID": "R2K16G2D6H6LNZ", "Overall": "5.0", "Content": "No complaints on this phone. It is fast, reliable and easy to use. I have had 4 other mid level androids and they would all have issues with freezing or loading very slowly. I think this phone is still top of the line.", "Date": "May 30, 2013"}, {"Title": "I LIKE THE SAMSUNG S3 VERY MUCH!!!", "Author": "T. Burleson", "ReviewID": "R5DW2MSVFH3PJ", "Overall": "5.0", "Content": "My Husband proposed to by this phone for my B-day and I agreed.This phone is everything how the compnay Described it would be, even so mucch more beautiful, the Garnet red is simply a sexy color. We had some hickups after the phone left the seller's warehouse on time, but the phone was shipped from Germany and took forever to arrive to the United States and way later then originally delivery date, but finally I have it in my possession and I enjoy every bit of it.I do highly recommend the Seller, their assistance was on point and very helpfull. I even was reimbursed for the Speedy 2 day Shipment for not delivering this item on time, which is appreciated. I will buy with this compnay again. Keep up the good service, however Buyers keep in Mind, during the Holidays the third party Shippers services can really have lots of delays and your items may not reach on time for the planned dates.I am a happy camper Yeeey Tswana Nunes", "Date": "January 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0097DJKWU"}}