{"Reviews": [{"Title": "One of the Best Non-Smartphones You Can Get", "Author": "Erin Sheffield \"MushyKetchup\"", "ReviewID": "R1VTO3EYI4EF8", "Overall": "5.0", "Content": "I've had this phone for three years and barely had any problems with it. I usually text with it, and everything sends smoothly and swiftly. When I call (I'm a kid, so I use it for emergency purposes), I can understand and reply to people. It works with calls as well as our $30 telephone. Photos aren't too good, but you can do some good ones. A camera is better if you're getting this for the cam. You aren't able to take videos. Sorry. But it stores music and has a bunch of ringtones and preset backgrounds. I've dropped it a lot and rarely get cracks, and the ones it has are shallow and do not damage the phone in the slightest way. They're more like scratches. I don't use the internet on it, so I can't tell you about that. :( There is a slide-out keyboard that I have never had problems with. The thing charges in 30 minutes and will last quite a while, though it beeps its fat head off when it's about to die. While it is a wide phone, it fits in pockets and in your hand. You butt-dial people a lot, but you can lock the phone two different ways, so that takes care of that problem. You can access the camera very quickly with the camera button on the side so you don't miss big moments. My family all has non-smartphones that they've all hated and replaced after a year, and I've loved mine for three. Unfortunately, this does not have a touchscreen. But if you want a non-smartphone, get this one - it's your best choice.Erbie's Reviews, December 2013", "Date": "December 18, 2013"}, {"Title": "Don't Buy!", "Author": "S.Dobbs", "ReviewID": "R1M5P7BAEFR96N", "Overall": "2.0", "Content": "I carry a cell phone for emergencies only. Even though I need this phone to do very little, I wish I didn't have it. The biggest problem is that it frequently makes pocket calls. This is particularly annoying since it's specifically designed to fit in pockets. It has very minimal features, is not user friendly or intuitive. In all, it has nothing going for it.", "Date": "July 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009AKMDJ2"}}