{"Reviews": [{"Title": "I'm not an Apple fanboy, but this is the most powerful phone on the planet.", "Author": "Austin", "ReviewID": "ROB6WWN2TP1J3", "Overall": "5.0", "Content": "The Apple A6 chip screams in front of every competitor phone. The new gorilla glass two make the phone MUCH less likely to shatter (the iPhone 4 & iPhone 4S were awful when it came to screen durability). The battery life is about the same as the iPhone 4/4S (which is really good, but people are spoiled) it also charges extremely fast. The new USB port makes syncing music and charging much faster, compadability with old devices is an issue, but eventually new products will take their place. The 64GB version allows you to endlessly film and use the phone's true processing potential. The new, bigger, screen is 4 inches rather than 3.5 which believe it or not is a huge difference. iOS 6 is amazing, very smooth, whatever small bugs (none that I've seen, but I'm sure there are some) that are there now will surely be fixed in upcoming updates (free). NOTE, the main reason I recommend this phone, is as newer operating systems come out (iOS 7, 8, 9, etc.) they will demand more and more processing power. This phone is twice as fast as the iPhone 4S and four times faster than the iPhone 4, in a year or so with iOS 7, the operating system will be so demanding the iPhone 4 will be slow to the point were it isn't usable. Even the iPhone 4S will begin to have lagginess, so if you're on a 2-year contract and want a phone that will perform well until the day you upgrade again, you need to spend a little more now. You won't regret it. Plus, the iPhone 5 is gorgeous people, what woman could resist taking a picture with you on it ;)", "Date": "December 10, 2012"}, {"Title": "\"Black\" is \"NOT\" White !", "Author": "James Grady Pino Jr.", "ReviewID": "R3H1TLA8OHLALS", "Overall": "2.0", "Content": "Well, the listing showed a New \"Black\" !  The iPhone is as \"White\" as \"Sunlight\" plus, Verizon could \"NOT\" get the phone to work on the \"DATA\" System for the Internet! I was told it had an Insurance Claim from 2 Sources!The iPhone was new as stated. This was the only truthful part of the information describing the Apple Zebra Cellular Phone.I had to purchase a new phone from Verizone with a 2 yr. contract, & it works.Just my luck !", "Date": "December 24, 2013"}, {"Title": "iPhone 5", "Author": "Brett A. Barnett", "ReviewID": "R1SIRAF73TC2LR", "Overall": "5.0", "Content": "The item was just as advertised like brand-new.  Thanks very much!  Really like the added memory and the 4G LTE.", "Date": "October 17, 2013"}, {"Title": "Love it", "Author": "Cliff Lohner", "ReviewID": "R285C9H7N6ZITA", "Overall": "5.0", "Content": "I had the iPhone 4 for over two years. I was good. The 5 is amazing. Super fast and screen resolution and camera pictures are insanely clear. I have the 64 gb and put 13 movies on it and I haven't even used half of the phones memory yet. Def get it", "Date": "June 4, 2013"}, {"Title": "Excellent Product", "Author": "Michel Verdaguer", "ReviewID": "R2SSE2KUB4VT3J", "Overall": "5.0", "Content": "I already had an iphone 4, so I change it for an iphone 5, got it in time and was as I expected it", "Date": "December 14, 2012"}, {"Title": "Great Phone", "Author": "Batman#49", "ReviewID": "R2FDW5GWVC46XR", "Overall": "5.0", "Content": "Really great phone, this is my fourth I phone, and it is the best, and fastest.  However the I wish the phone would stay charged longer.", "Date": "February 13, 2014"}, {"Title": "Excellent product", "Author": "CoolJohnB", "ReviewID": "R3S0G1MJLBFIXG", "Overall": "5.0", "Content": "This is my first Apple iphone, and I wish I had had one before the OS is so easy to use, brilliant choice of apps and I like the way in synchronizes with my computer.", "Date": "February 18, 2013"}, {"Title": "I like this item.", "Author": "Bunta Iwata", "ReviewID": "R1U9NBTMNTYF3R", "Overall": "5.0", "Content": "This items is very good! I using in japan now. Japan is best this cellular. Maybe, I think this iPhone5(cdma unlocked) is that it is a cellular had been longing for many Japanese.", "Date": "January 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0097BV55C"}}