{"Reviews": [{"Title": "Pantech P7040P", "Author": "Sheryl D Coleman", "ReviewID": "R1BX0I0OJO1S7S", "Overall": "4.0", "Content": "I really liked this product because the keysare easy to read and clearity of talking on the phone is great.  Every feature and programs on the phone is user friendly and easy to access.  Texting is great as well because of the key boards.  I do hope in the near future that they would consider making a 3.0 mega pixal camara on it insead of the 1.0.  The quality of the photos are not so great but other than that it is a great phone and i would recommend it to everyone who is not yet ready to taclke the iphones and tired of the touch screen phones.", "Date": "August 3, 2013"}, {"Title": "Best of the non-smart GoPhones", "Author": "James S.", "ReviewID": "RS1BKYXR1T74E", "Overall": "5.0", "Content": "I used this phone for a year and was well satisfied with the texting and call quality. Prepaid phones (regardless of carrier) are being \"dumbed down\" in recent years and the newer cheap prepaid phones are pathetic in terms of quality & speed. All of which makes this phone more attractive now than when it first arrived on the scene in 2011. That explains why there has been no price drop with this phone, it costs the same today as it did 3 years ago. My biggest complaint is the camera, by far the worst of any cell phone camera I've ever used. So bad is the picture quality that I resorted to using a digital camera and emailing pics, then using the phone to retrieve the pics from my email account and THEN texting those pics to friends. Now a note about GoPhone service. This phone offers an e-mail add-on for an extra $5 per month and is well worth it. You can still go to your email provider's mobile website using the phone's browser. But the $5 add-on is so much faster and easier to navigate. If you plan on sending/receiving emails with this phone, pay the extra $5 a month (only available with the $50 plan). I used both of the only plans available for this phone in 2012, which were the $25 plan (250 minutes & unlimited text) and the $50 unlimited everything plan. When I switched from the $50 plan to the $25 plan, I lost the $5 monthly email app. That was infuriating because getting it back meant switching plans again and losing the $25 + the $5 that I had just paid only 3 days before, then paying another $50. And everything was taxed so I lost about $45 by the time I got my email app working again. Today there are 4 different plans for this phone and each are worth investigating. Just be aware that when you switch between plans you lose every penny spent on the previous plan, doesn't matter if it still had 28 days of service left when you switched.", "Date": "September 29, 2013"}, {"Title": "this is a durable phone", "Author": "hexara", "ReviewID": "R2L1M7HVU9TL9R", "Overall": "4.0", "Content": "I swam in the pool with this phone, and it survived.  It took about 3 days to dry out, but the only function that didn't return was the speaker phone.  I like the size of this phone more than a smaller size and with a cover, it should last through almost anything.", "Date": "October 8, 2013"}, {"Title": "ripped off", "Author": "ronald gene brown", "ReviewID": "R2IFVU083AEGOL", "Overall": "1.0", "Content": "Purchased this from Breed on Amazon. Paid for 2nd day air delivery. Plugged phone in and screen does not work. Have had this same model phone for two years and loved it, till i purchased a replacement from Breed. What a rip off. Buyer, beware who you purchase from. Very disappointed with this company.", "Date": "July 24, 2013"}], "ProductInfo": {"Price": "$38.89", "Features": "No contract hassles\nFull QWERTY keyboard for texting\nMobile email, IM, text and picture messaging\nAT&T; Social Net, Web browsing, AT&T; Navigator and AT&T; Mobile Music\n1.3MP camera with video", "Name": "BRAND NEW !!!!!! Pantech P7040P - Black (AT&T) Cellular Phone go phone prepaid without compromise NO ANNUAL CONTRACT * NO CREDIT CHECK", "ImgURL": "http://ecx.images-amazon.com/images/I/5108Csr-MDL._SY300_.jpg", "ProductID": "B009KGG554"}}