{"Reviews": [{"Title": "Very happy with purchase", "Author": "Enki", "ReviewID": "R14BYXAA4VRPLB", "Overall": "5.0", "Content": "Product match all depends on what you're looking for and for me, this is turning out to be a fantastic product.  Handset size is certainly something of choice, depending on how you're planning on using your phone, I was looking for something I could use as a phone/communications/productivity/navigational tool.Pros:-Call quality and signal: excellent so far, even in areas with traditionally poor signal.-Nokia city view: Love it, very handy when I'm traveling and it has an awesome 'interactive' feel to it.-Microsoft office integration: fantastic,syncing through your live account is easy and controlled, you only put what you want onto someone else's server and maintaining that split is easy for both contacts/calendars.  OneNote syncing is the same way, again, very controlled and then seamless once you've setup what you're willing to share.-Email:  Love the windows 8 tiles (for the phone, I have the opposite feeling for the desktop and I'm ambiguous on the tablet) for separate email accounts, very handy for splitting work/business/priorities since you can control what notifies to your lock screen per tile.-Overall OS feel: again excellent, surprisingly so actually.  I was expecting more bugs but this is really polished and slick.-App store: there's enough here to be functional, which is all I wanted ~ although someone really wanting a plethora of games will be disappointed.  The nav/prod side is solid though.-The Win7 desktop phone app ~ is really all about syncing your itunes to your windows phone and its AWESOME.  Best itunes/win translation I've seen.  Its bare bones visually, but recognizes all of your non-DRM content and pulls your playlists and catalog seamlessly from iTunes.-The phone itself: great design, high quality, excellent feel.  Camera is fantastic (amateur photog - it won't replace my larger cameras/lenses but I might just dump my point and click for it).-New features: haven't tried out things like smartglass yet, but I'm excited about the queue of features coming out for the windows phone and what it can do as part of the msft platform.-Micro usb:  I can't tell you how happy I am they used a common standard as their physical interface/charging port.  :)Cons:-Win7 desktop phone app ~ can't sync to your office suite directly, you can upload docs but it wont' handle merges/changes like the online sync does.  Given msft's segmentation of their business lines, not surprising but I'd like to see it added at some point.-ATT-Lack of documentation ~ this is annoying.  Very poor documentation on W8 phone and google turns up results about the OS, not the phone implementation.  The limited manual that comes with the phone runs out real quick for usefulness.  I disagree with their naming strategy, when I google the iphone (my family has them) finding the answer is easy, ditto with an ipad or an apple OS problem (have those as well) but with the win8 phone I can't find a good segmented knowledge source just about the phone section of the OS.", "Date": "December 5, 2012"}, {"Title": "Best Smart Phone I've Ever Owned!", "Author": "Connie S. Litrenta", "ReviewID": "R16WUD9V9F2FY9", "Overall": "5.0", "Content": "I totally disagree with the person who called this a \"phablet\". Really? Not even close. There are MANY phones out there bigger than this right now. Reviewer must have owned an iPhone 3gs to draw this conclusion.  The phone is heavier than most but definitely not a deal breaker. It's still relatively thin and easy to hold.  Of all the phones I;ve owned (MANY) and they include iOS, Android and Blackberry devices, this is by far the best one and it isn't even close.  Now understand, I'm referring to the overall experience as I'm sure there are devices out there that may beat it in a specific area. For my money though, the Lumia 920 gives the best overall experience in every facet.1. Screen - very bright and rich display with touch screen that can be used with gloves on or with your fingernails.2. Camera - best camera I've used on a phone and the Blackberry Bold had some very nice cameras (I've also just come from a Galaxy S3)3.  OS - Say what you will but Microsoft totally got this right. Live Tiles are great. They're refreshing, fun, colorful and just a joy to look at. Oh and the OS is smooth and freaky fast4. OS - Integration with Windows 8 desktop is excellent out of the box and I'm sure it will get better with time.5. Office Mobile - This could stand some improvement to make it a little more robust but it works good and I love OneNote. Flawlessly syncs with SkyDrive6.  Voice Recognition - Very surprised at accuracy when dictating text messages. Excellent7. Maps - GPS has excellent accuracy as well, certainly on par with Google8. Build Quality - This thing is a beast9. Music - I'm not a crazy music fiend like some but for me, this is plenty good and also syncs with Windows 8 desktop10.  Apps - While the store may not have as many as Apple and Android, it has more than enough for me. I found almost everything I used with Android/Apple and what I couldn't find, I found suitable replacements11.  Performance - Blows iOS and Android out of the water. I FINALLY found a phone that actually comes close to all the bragging that  cell providers do about speeds.  This is it and it is the ONLY one I have thought that of.If you're thinking of trying this out after having iOS, Android, or Blackberry, do so with an open mind. It is NOT any of those. It has it's own way of doing things. But as different as it is from Android, it makes up for it in many other ways. As for what I might miss right now, about the only thing that comes to mind is the lack of a notification LED (C'Mon Nokia!) and more customization with notification tones, all things that can be corrected with software updates.", "Date": "December 6, 2012"}, {"Title": "Great Windows Phone, question how \"new\" this phone was when I received it", "Author": "Thomas Potter", "ReviewID": "R2FVOTVVB2NIHF", "Overall": "4.0", "Content": "TL: DR: awesome phone, I enjoy WP8 platform, I question how \"new\" this phone was when I received itI really enjoy this phone. For reference I've had an iPhone before making the switch to a Samsung Focus Windows phone, and then replaced that with the Nokia 920.***The pluses for Windows Phone 8***+ Live tiles are great and give loads of info at a glance. I considered getting a new iPhone or Android phone but the lack of a Live Tile analog killed that idea. I've come to depend on them. Basically each app icon is a tile, occupying space on the main screen. Those tiles display bite sized bits of info so you don't have to open the program to see new info. For example, new emails show the first couple sentences, meeting info shows up on your calendar tile, etc+ Great phone for business users - MS Office integration, Live Tiles+ Cool xbox live integration+ Good social integration if you are into that. A continuous feed of Facebook/Linked in updates in one place+ Tile UI is cleaner, more usable than the iphone/android phones I've compared. I liken those UI's to a desktop computer cluttered with shortcut icons.+ Separate inboxes for all my email accounts***The Minuses for Windows Phone 8***- The marketplace is not nearly as robust as the iPhone or Android market. However if you are like me, you only use 1% of the stuff you download - the important stuff - and that is fully represented on the marketplace.***Pluses for the Lumia 920***+ Feels sturdy. Looks big and bulky to carry in pocket, but I don't notice it when I do.+ Beautiful display. This was a standout for me in the ATT store doing comparisons with other phones.+ Stunning night pictures - this aspect of the camera really impressed me. Very high detail photos+ Runs fast - apps open fast+ Decent battery life. I'm a heavy user and I can usually get away with charging it when I get home at night and having a day's charge the next day.+ Gorilla glass prevents most scratches+ Good call quality+ Speakerphone is pretty good, but volume perhaps a little low+ Infinitely better than the Samsung Focus I had.***Minuses for the Lumia 920***- The Nokia Drive app (think Google maps navigation) is really hit and miss sometimes.- Day shots with the camera can look blurry on occasion- I never had a protective case - dropped it many times without issue - but one drop smashed the entire display. But like I said, I did not use a protective case.AS FOR THIS SELLER: I have to question how *new* this phone was when I received it. This is actually my second 920 since my cat knocked mine off the table, hitting it just right and smashing the display. I was searching for a way to get a new phone without paying a ridiculous amount of $$$ since I was not ready for upgrade discount. When I pulled the laminate off the screen I noticed a number of very small micro-scratches. A brand new factory-sealed phone would not have these scratches. I wonder if this was a used phone that could pass for new, and then someone cleaned it up for resale. I'm speculating here, but the micro-scratches seem suspicious to me. But I did get this far below what my carrier would charge me.My advice, get the phone, but buyer beware when using this seller.", "Date": "November 26, 2013"}, {"Title": "Best Windows Phone as of early 2013", "Author": "rpv", "ReviewID": "R2YQKEFSZYEL21", "Overall": "5.0", "Content": "Windows 8 apps are a welcome change from iOS. Among the three ecosystems, I prefer Android, Windows 8, and iOS in that order. Blackberry, what ?! For ease of use, Windows phone is really easy to use. For someone interested in a first smartphone, Lumia 920 is an excellent choice. I got access to few Windows 8 phones to review. I will try to review them, but since I have not used for a period longer than a month I am not reviewing for reliability. User interface in Windows 8 is very pleasing and this is one of best phones with awesome user experience. If you prefer great user experience over infinite hackability, aka Android, then Windows 8 phones are great choice.The Lumia 920 has a stunning 4.5\" IPS LCD, 1280x768 resolution, 332 ppi display. This phone has up to 32 GB storage and 1 GB RAM.  8.7 MP camera and a 1080p HD Video.  1.5 GHz dual core processor. I have extensively used in the past HTC Titan I and II which is pre Windows 8 (7.5) and I was surprised it has become more buttery smooth now. This phone has Gorilla Glass 2. Glass 3 is in the making and supposed to be even better. Stating following because this is highly underrated in reviews. From Corning's Gorilla Glass specs; WHAT MAKES GORILLA GLASS SO DAMAGE RESISTANT? The unique composition of Gorilla Glass allows for a deep layer of high compressive stress (created through an ion-exchange process). This compression acts as a sort of \"armor,\" making the glass exceptionally tough and damage resistant. Ion exchange is a chemical strengthening process where large ions are \"stuffed\" into the glass surface, creating a state of compression. Gorilla Glass is specially designed to maximize this behavior.Lumia 920 does not support microSD expansion. I always feel this is a bummer. But with 32GB it is plenty with current app ecosystem.  These phones seem to be copying iPhone philosophy.  Battery 2000 mAh Lithium polymer battery (Compared to a high end Android Galaxy Note II, which has a battery of 3100 mAh Battery.) Unlike the Nokia Lumia 820, the Lumia 920 doesn't have a removable battery cover, which means you can't access or replace your battery. __Not having a storage expansion slot is a bummer for lot of people! Not being able to remove battery is a double bummer.__  For me, storage expansion and removal of battery is very important, so I was disappointed. This is the downside the unibody design.  Wireless charging is a big plus, though!Phone quality was excellent and speakerphone was awesome. Nice to see built in active noise cancellation with a dedicated mic. Nice to see Lumia 920 has Bluetooth 4.0. Bluetooth low energy (BLE), known as WiBree,is a subset of Bluetooth v4.0 with an entirely new protocol stack. As an alternative to the Bluetooth standard protocols that were introduced in Bluetooth v1.0 to v3.0, it is aimed at very low power applications running off a coin cell. I was able to get excellent reception with Bluetooth headset, Jaybird Sportsband Stereo Bluetooth Headphone - Bulk Packaging - Midnight Black and JayBird BlueBuds X Sport Bluetooth Headphones - Midnight Black  All the usual smartphone stuff, facebook, twitter, music, emails etc are all excellent. It is only the third party apps that are lacking in some arenas. If you are Microsoft heavy like Office suites, Lumia phone are awesome!Apps are limited in Windows 8 marketplace. Yes, we have heard this a gazillion times. Lumia has GPS receiver with A-GPS and GLONASS support. I tried with Garmin Navigon app which turned out to be great in giving voice directions. App ecosystem is a chicken and egg situation. Unless more phones are sold, developers don't have incentives to write apps. Apps are less now, because people are not buying in big droves. Windows Phone is now (early-mid 2013) the third-leading mobile phone platform, more than tripling its market share year-over-year. One recent report I read Android and iOS are ahead in games with 162.1 and 37.4 million shipments in 1Q13 and Windows phone came in 7 million. This is more than double from previous year. I really hope for Windows 8 platform to surge ahead because having a 3 way competition with iOS and Android is good for the ecosystem.ONE LINE SUMMARY: The Nokia Lumia 920 is certainly the best Windows Phone 8 smartphone on the market right now.", "Date": "May 18, 2013"}, {"Title": "I like the hardware", "Author": "matthew", "ReviewID": "R1BSGBOZIE7Z91", "Overall": "3.0", "Content": "To give some background, I have been an iPhone user since the first one was introduced in 2007.  I loved my iPhone.  It did everything I needed and more.  As more and more options came out, I was interested in what else was out there and decided to give this phone a try.  LEt me start with the hardware:Pros:-I love the screen size.  This is one of the things that attracted me to this phone because I really wanted something bigger and felt that the iPhone 5 really didn't add to the screen size as I had hoped.- I couldn't ask for a better camera, it is awesome.  One of the best I have seen in a cell phone.- The feel of the phone.  It just feels solid and well constructed.  Some phones feel flimsy and cheap, but not this one.  Some people don't like this because of the weight, but I don't find it to be that heavy.- Wireless charging built into the device.Cons:- I wish the camera was placed a little differently.  It is right in the middle of the phone and I find myself covering the lens when shooting one handed.- It doesn't have expandable memory.  I thought this is something everyone used to differentiate themselves from the iPhone.One thing to mention is the battery life.  I was lucky if I made it through the day on a single charge when I got the phone.  After letting it drain completly and doing a full charge, the battery life has improved greatly.  I can now go about two days with no issues.Now the Software.  I have to admit that the Windows look and feel is totally different from iPhone or even Android.  I find some things to be easier to navigate.  I also think that there was some bad choices made that make it less intuitive.  This OS also has the feeling of an immature platform.  After having been out for two years, I expected a lot more from it.  It does not have a lot of the top apps yet.  MS is working on this, but it shows.  I also feel that there is a lack of quality apps compared to the iPhone apps.ONe of the biggest complaints, as mentioned above, is just the immaturity of the platform.  There are certain things that I would consider critical that are just missing.  ONe fo the biggest that has plagued me the last few days is playlists in the music app.  You can create them on the phone if you use some roundabout set of instructions.  Once you do this, there is no way to edit the playlist.  You can simply delete it.  Also, the app that is used for syncing has absolutely no functionality and cannot handle anything like this.  There are other things that pop up like this that make me grumble and check my eligibility for an upgrade.My overall impression is that the hardware is solid.  The OS is lacking.  All of the issues I have mentioned can be fixed in a SW update, but I will be switching back to my iPhone when I can and dropping this phone.", "Date": "February 12, 2013"}, {"Title": "Ugly Fast", "Author": "Ben", "ReviewID": "RPHT4FW5PMY1R", "Overall": "4.0", "Content": "I wonder why the white is better rated than black??It looks better... ? It helps add to design by accentuating contrast?... I believe. I've had both in person, and believe the white is much more refreshing.I've never cared much about size or weight... as long as its evenly distributed and stylish.  The IPhone 5 looks much more sleek in my opinion... Of course with a case it looks like a 4S and everyone has those. Everyone has a case, cause the 4S will break if you sneeze incorrectly.  The 5 is supposed to be better, but also better at scratching??My girlfriend has one... she got rid of her Lumia 920.  Why?Because she couldn't have her bank app.Because the phone was too big and she kept dropping it.  Never showed damage though.  If you want a phone that you can be tough with, this is definitely it.  It'll be tough with you too.  I suppose it's so heavy because of the protection around all that's going on inside.  Especially the camera stabilization system.  I believe this takes all around better pictures than any phone I've ever had.  IPHONE comes pretty close though.  My girlfriend loved the shutter button.Zooming is odd.. you have to pinch and zoom , and then it doesn't look quite as good.I also have an HTC One X,  a very nice Android.  Like the Iphone 5 it weighs nothing.  Which makes it seem more modern in my opinion.  The Iphone looks more expensive though.  And everyone know's it is.The Lumia also looks much more expensive.... It looks very new , and weighs expensive.The screen is amazing.  Its a shame there are no wallpapers.. just lockscreens.  Which I don't quite get.. It has a lock/unlock button.  Why push, then swipe up?  why not one or the other??  That worried about butt dialing??I realize many phones are like this... point is you dont see much of this lockscreen.  You dont get to see much of that screen.Instead, you see color.  Lots of it.  You can choose from 20 colors with weird names, all on white or black.To me this makes a great theme , but shouldnt be your only option.. Ive mixed it up as much as I could by pinning contacts, pictures, different colored tiles... and it looks nice.., but say goodbye to wallpapers....theyve been around forever.  Its a bigger change then you think.Say hello to simplicity.  (exception of customizing your Start screen)To me, this simplicity reminds me of how fast this phone is.  It's like a beautiful car screaming down empty towns with not much to see.  The apps and fonts look a little rushed.. But compare to Android?  Android is familiarity ... Android is too many relatives squished in a car, with great fun and ideas but too slow to gather focus.  Android gets cluttered many times , very easily. Windows doesn't.  Windows Phone 8 is the epitome of organization and control..  which Apple seems to be pretty good at as well. I also love Pinning webpage bookmarks, which show a screenshot of the webpage.  For one, it works so great, and is so fast... for 2 , it's less plain color monopolizing my start screen. Windows is a little more loose when it comes to file management and sharing, but no music sharing via bluetooth like the good ole days.  No loading any video you want expecting to watch it like Android.  Android may let you do a little more, but it'll be slower...Android is fun to play with when you have time and patience..When you want to get through tasks with much efficiency  , Windows shines.. But so does Apple. And Apple has better apps and selection....for now.If I want offline satellite radio, offline GPS , and offline youtube watching (after downloading with app), WINDOWS rules.If I want excellent hardware and top-notch camera, with innovative features NOKIA rules.If I want no surprises and my bank app, Apple rules.If I want unlimited customization options and compatibility , albeit at the risk of losing  a little speed, Android rules.  Samsung is a little quicker in my opinion than HTC, but seems a little more delicate.. I cant stop breaking Samsung phones.  Samsung also stands out with colorful vivid screens.... The NOKIA and Iphone have better whites, and are sharper, but Samsung has deeper blacks,...Pros:Plenty of control and offline options. AMAZING GPS offlineVERY VERY responsive.Very Tough, and pretty stylishBRIGHT FAST SHARP displayAMAZING SOUND quality via headphones..loudspeaker ok.Plenty of availble Storage out of total storage compared to many phones. 27 or 28.. cant rememberFantastic cameraAMAZING Video, especially sound.Very responsive , sensitive touch display.. I now dislike scrolling through HTC.Cons:Too Heavy and thick...and a little too much unused space for screen.  HTC is slightly smaller with bigger screen.Is attractive, but not really sleek...like the Iphone 5 ( without a case.) Even HTC ONE S (although as light as a  toy, seems more sleek... utilizing more space for screen , while being much thinner.ITs almost like its wrapped in clear packaging tape a million times.  Everything is well protected but deep in there.. very thick ..... whereas the HTC One X and Iphone 5 have that feel where the screen is floating on top. NO unused space.Lack of apps..  It only takes one to really get you .. like your bank app.Lack of music sharing via bluetooth.Lack of video format compatibility.In my opinion,  ugly interface.... as far as fonts, colors, lack of wallpapers, etc.", "Date": "January 19, 2013"}, {"Title": "Blown Away!", "Author": "Salvatore A.", "ReviewID": "R3GX5RBGNH6WF4", "Overall": "5.0", "Content": "I am completely blown away by this phone. More than what I was expecting in a phone. The only thing I am having a bit of an issue with is the music sync. It could be me but I am pretty computer savy so I doubt it. I synced my music to the phone from windows media center and when I try to play a song it says the phone does not play this file format. I checked with the guidelines and the phone support and it says it does. so there is clearly something wrong. Because wmc files are support for this phone. I am sure it will get resolved. I am a huge music lover and I have a large extensive music collection. I would be more than disappointed if this does not get resolved. Needless to say microsoft hit a home run on every other aspect of this phone. It is more like a computer experience than a phone. So .99 percent blown away by this phone. All other applications worked flawlessly. It has online and offline sync you just need to configure it. Both Microsoft and Nokia have downloads for this. Can't express how much I like it simply blown away.", "Date": "May 25, 2013"}, {"Title": "unlocked? not, does not work in Latin America", "Author": "Pablo Valentini", "ReviewID": "RDMTUM9XQK33B", "Overall": "1.0", "Content": "Bought this phone due to the fact the seller stated was \"unlocked\", after getting it, came back to Argentina, where I put my local chip and the phone recognized it, no problems so far, then I realized that I was/am not able to use the data connection of my telco, called the company (Telecom Personal) and we did several changes including the configuration of the APN, updated the phone to the latest versión, and the result is: Simply does not work, flashing the OS did not work either. Spent hours trying to solve this problema. Finally realized that AT&T; does something to their phones that does not work in Argentina.Unfortunately, I spent more than 200 dollars in a phone that does not work. Has been the worst experience in Amazon since my first purchase years ago.Don't know what can I do now.", "Date": "May 21, 2014"}, {"Title": "Needed to replace my original AT&T; phone", "Author": "jax", "ReviewID": "R21FE0BY9V6VQ8", "Overall": "5.0", "Content": "Needed to replace my original AT&T; phone as the flash no longer worked and the charging (micro-usb) port was intermittent.  Decided I couldn't wait until the two years was up for a new phone--and I've become accustom to how this phone works--I', NOT an apple person (IBM was my career for 32 years and I won't have an apple product in my home...)I had a very delightful surprise as this phone wasn't black as shown but white--and that's neat.  Charged it up overnight, added a screen protector and changed the sim card and everything worked great.  No trouble syncing with my existing Bluetooth devices.The only thing wrong this this phone--I mean this brand--is that the vibrate function could stand to be a little more powerful.  I'm a person with some additional padding, and that seems to insulate the vibrations when the phone rings...yeah, I know, I could stand to lose a few (perhaps a dozen...) kg.I'm having my original phone repaired--hopefully somewhat less than $100 so we have a spare in our family of FIVE of these phones!", "Date": "May 3, 2014"}, {"Title": "Major upgrade from the iPhone 3GS that I had", "Author": "traveleinfool", "ReviewID": "R1IDNLAXTHHCZ5", "Overall": "5.0", "Content": "This is a truly awesome phone.  Since my iPhone 3GS can't upgrade to iOS7,I figured it was a time for an upgrade.  I considered long and hard before choosing a Windows Phone and I am glad that I did  Sure, some apps I was used to having are not yet available, but I find the Windows Phone experience truly superior and this phone is a real gem.  The size is just right, even with a nice leather case.  It is fast, and fun to use.  It paired perfectly with my car and other Bluetooth devices and has met and exceeded my every expectation.  Since I generally charge every day, the battery life is perfectly acceptable for my needs.  I am very glad that I chose this over an iPhone 5.", "Date": "April 19, 2014"}, {"Title": "LTE phone with 4G signals Only !", "Author": "JLo", "ReviewID": "R2FOT2TXOLKKEE", "Overall": "3.0", "Content": "I ordered 920 LTE phone-BLACK with paid delivery fee. It arrived fast from SHIPFASTTECH, but I also discovered fast that the phone from this seller could not get LTE. I compare my wife's phone, same model different color, ordered from different seller for lower price and no shipping fee. Hers has LTE signal, and mine doesn't. No matter how I change the settings, update the software or call ATT, 4G is it, an LTE phone with 4G signals only.Just to make the matter clearer, Lumia 920 has two models, one with 4G/LTE and another 4G only.  I tried ##3282# for phone Field Test.  Initially, it showed nothing, but after multiple phone software updates, it did show something, but still without LTE.  Actually, it shows LTE is Invalid and NA in all LTE related fields.  As for my wife's 920, it has every parameter/value shown in her phone Field Test results.What has happened to this phone now?  I still have it, because it's such a nice phone.  It would be perfect only if LTE is available to my phone.", "Date": "April 17, 2014"}, {"Title": "Everyone I know with different phones cant stop looking at it.", "Author": "scott sanders", "ReviewID": "R2842YS8SQDF7L", "Overall": "4.0", "Content": "Works great. Good camera, volume, and design. Just have to watch how many live tiles you use cause it drains power pretty fast, but easily manageable.", "Date": "March 18, 2014"}, {"Title": "Once I got the update, it was a whole new world!", "Author": "Jeff D Bean", "ReviewID": "R38W253VQFTTT5", "Overall": "5.0", "Content": "This phone is just simple to use and does everything you (need) to do!!!!! If you want to play with settings all day, buy an android. If you want a phone that just works, this is it. I can see where people didn't like windows because before the update it didn't have enough control. But since the update, I LOVE IT! you gots to get you one of these!", "Date": "February 18, 2014"}, {"Title": "Works fine!", "Author": "Tobin Maule", "ReviewID": "RBP7DJ6ORQ6ZK", "Overall": "5.0", "Content": "Best thing is it is not an Iphone anything and I don't have to deal with iTunes to do all sync operations.", "Date": "February 18, 2014"}, {"Title": "love it", "Author": "david scott", "ReviewID": "R1419X0YZQ171Q", "Overall": "5.0", "Content": "I'm still getting used to the wp8 setup but so far am loving it. It is fast and easy to find what you want.", "Date": "February 5, 2014"}, {"Title": "bright", "Author": "Adolfo Gallardo Díaz", "ReviewID": "R379Z3O3EDRU7", "Overall": "5.0", "Content": "My Nokia Lumia 920 is my constant companion returned a year ago to buy it on Amazon and the experience has been superb, WP 8 each day grows more and more, there are no top app that are in the store, and the camera with the photos at night is unsurpassed.", "Date": "December 17, 2013"}, {"Title": "Great Phone", "Author": "Gunite", "ReviewID": "R2YOV9VO72R6C7", "Overall": "5.0", "Content": "I love this phone so much I bought six of them for my entire family :) Windows Phones are great!!", "Date": "December 7, 2013"}, {"Title": "Best phone but would be better if it had 64GB or 128GB", "Author": "Horacio Z. Flores \"SYNTAX\"", "ReviewID": "R19086JOML1T0E", "Overall": "3.0", "Content": "COME ON! With a camera like that-  like THAT Nokia, what the hell is the deal with a measly 32GB??? This phone rocks, rocks like a boss - OR WOULD rock like a boss if it had the storage capacity of the modern century. It's ridiculous, if you're an audiophile - like me! And a serious pro photographer - again like me! 32GB will go like yesterdays hot wings.Bottom line if you are like me and make a lot of pics and listen to a ton of photos, this phone can't handle it, not at 32GB. But if you don't have music and wouldn't bother making a lot of great photos with the amazing camera on this phone, then by all means buy it. It is a fantastic device.", "Date": "September 10, 2013"}, {"Title": "Nice phone at a reasonable price.", "Author": "D. Alan", "ReviewID": "R2ZSICE39TKD1L", "Overall": "5.0", "Content": "I love this phone.  My very slightly out of warranty iPhone went kaput and replacing it while still under ATT contract would have cost me a fortune. The Nokia Lumia 920 is nicer than the iPhone, in my opinion. All the apps I would ever need are included or free at the store. The display is nicer than the iPhone display. Collecting my contacts and storing them in the new phone was painless. The wireless charging with the optional wireless charger is sweet! I come home after work and set my phone on the pad.  In less than 30 minutes my phone is fully recharged.  The price is right.  There is a lot of bang for the buck with this phone.", "Date": "September 6, 2013"}, {"Title": "Great phone", "Author": "The Cpt", "ReviewID": "R40PEXBEL5XVK", "Overall": "4.0", "Content": "There is no perfect phone, but this as close as it gets.As a phone the reception & transmission is very good. As a PDA, its integration with windows, desktop PC, is great. The build quality, like all the Nokia phones I've had in the past, is very good. There are some complaints about the weight & size, not here - fits my shirt, jacket & pants pocket just fine & the size makes it easier to retrieve from pockets & type on. The weight is hardly noticeable.", "Date": "September 6, 2013"}, {"Title": "Best WP8 phone, nay, smartphone on AT&T;", "Author": "Liam Murphy", "ReviewID": "R1UOQW81OVGCLJ", "Overall": "5.0", "Content": "I have been a fan of the MS devices since the zune, so I am a bit of a fanboy, but I have owned a Galaxy device, and my wife owns an iPhone 4S, so I do have actual comparisons to make.  If you are locked into the Apple ecosystem, you may want to stop reading, as there is a sharp difference coming from all Apple products, but if you have an open mind, or are tired of the same junk getting pushed on you from a closed ecosystem, then read on.The OS:  MS took the best of a closed ecosystem like Apple's, wherein they control the look of the OS, and the overall functionality and reliability, but took a page from Android, and are letting OEM's create individual hardware to suit different needs/desires.  The OS is fluid and fast, there is hardly ever a hang-up, and it just works.  I have found no bugs, and I find the structure of the OS to be very intuitive.  iOS tend to bury certain settings functions deep within other settings, and can be cumbersome to change, like turning on and off cellular data, which on the iPhone can take a long time, and on the Lumia I can do it in about 2 seconds and then be right into whatever I needed the data for (I switch it on and off a lot because I have a low data plan, just too expensive to pay for data when Wi-Fi is readily available and free in most places I go).The live tiles are fun, and the ability to add just the people I want from my contacts to my start screen and get just their updates keeps me from spending most of my life on Facebook.  I can see what they posted, and I don't care much about anyone else, and if I want to post something, it is just a press away.  Same with Twitter and many other social services.The ever-scrolling tiles on one screen is much faster and more intuitive than having pages and pages to scroll through, again, makes doing what I want much quicker than on other OS's.MS did their customers a favor by providing semi-regular updates that you don't need to buy a new phone for.  I still have an original WP7 device that I use as my work phone (had to drill out the camera and wasn't doing that to my Lumia), and it has received up through the 7.5 update.  It is almost 3 years old and works as good as the day I got it, albeit with a more limited app selection since most devs are not making WP7.X compatible apps, and instead are focusing on WP8, but it functions and the experience is similar from 7 to 8.  If this were an Android phone, I would have had to root it to upgrade the OS (as I did on my Galaxy S), and in order to stay current, Android OEMs force you into buying a new phone, well before the 2 year cycle of most carriers, which can be expensive and annoying.  At least MS tried to keep the ability to update an old phone, but I understand why they chose to change that from WP7 to WP8, a necessary evil.If you have kids, this is the phone for you.  The Kid Zone is the best thing for smartphone owners with children: put just the apps and media you want there, and that is all your kids can do.  They can't buy stuff, or surf the web, and they can still play games and be entertained.Finally, the OS does not slow down over time like Android does.  That was my biggest complaint about my Galaxy S was that after a few months I would have to do a hard-reset and start from scratch, very annoying.  The only hard reset I've had to do with a WPx device was to try to fix the screen problem I had that Nokia fixed for me.The Hardware:  It is difficult to find a phone that compares to Nokia's upper echelon phones.  The build quality is excellent, it holds up to the beatings of my children and random drops, and the camera is top-notch.  I would love to have the 1020 for the infinite zoom and 41MP, but the 920 holds its own against just about any other phone out there.  The dedicated camera button allows me to quickly snap a photo and not have to fumble around with the phone in order to get the camera going, and if I get a good shot that I want to share, sending to facebook or IM or email is just a swipe to the right away.The sound with and without headphones is great on this phone, although my wife's iPhone 4S seems to be a bit crisper, but it is a great improvement over my old WP7 phone which was inaudible without headphones.Wireless charging... need I say more?  I set it down on my bed-side table in the dark, and pick it up when my alarm goes off in the morning without fumbling with wires.The screen is a thing to be seen, especially in bright sunlight.  The auto brightness combined with Nokia technology here makes it the envy of most other phones outside during the day.  The colors look a bit funny in that super-bright mode, but that shift of brightness and saturation is better than not being able to see the screen at all.Overall, I would recommend this phone to anyone fed up with their current phone.  Most people want to dismiss MS as not being able to put out a quality product, and may be turned off by older versions of other MS products (Vista anyone?...), but they hit a home run with this one.  Go into a store and play around with the demo model, and then take it for a test drive.  Mess around in the settings and read a forum or two to find out everything it can do (took me forever to discover you could turn off Facebook calendars so I stop getting birthday announcements for random people that I friended for various FB games), and give it an honest try.", "Date": "July 30, 2013"}, {"Title": "sometimes I think the radio is a bit weak compared to other phones.", "Author": "Joe Dickinson", "ReviewID": "R9VAQOL46RS9D", "Overall": "4.0", "Content": "The radio isn't as goos as some of the other phones, not sure if it's frequency spatter, or other interference issues.", "Date": "July 15, 2013"}, {"Title": "very good quality", "Author": "Claudio Coronado", "ReviewID": "R37OUZ8D6O1KZM", "Overall": "5.0", "Content": "I chose the 5 stars because the product itself is spectacular, nothing to say. All my cheers go for Nokia.What I do not like is that At&t; does not include any accessories such as handsfree.Would you recommend this team to all who love the fluidity and innovation and do not recommend them who like to get their hands on Operating System codes. Greetings.", "Date": "June 19, 2013"}, {"Title": "i love it.", "Author": "macks", "ReviewID": "RYL2C1SFBPH6O", "Overall": "5.0", "Content": "am a fun of nokia and that is why I bought this nokia lumia 920. its not the best smartphone out there but its the best for those who knows what they are looking for. try one and u will be happy u did.", "Date": "May 13, 2013"}, {"Title": "Excellent", "Author": "Eduardo Capobianco", "ReviewID": "RWCZW3PGVERL1", "Overall": "5.0", "Content": "Excellent! The only thing I do not like is that the battery does not last long. But otherwise the Nokia lumia 920 is excellent. I'd just like to send me the unlock code, you can use it with my carrier here in Venezuela.", "Date": "April 18, 2013"}, {"Title": "A Step in the right Direction for Nokia, and a Giant leap for Smartphones", "Author": "Vikram", "ReviewID": "R1QOIHZ4K1K47B", "Overall": "5.0", "Content": "What Can I say, I am fairly impressed with the latest version of Nokia's offering, its Crisp and there is no lag in the OS whatsoever, the features are endless and I was lucky enough to get a charging pad which does work and I see little difference in wired charging and wireless charging which is just as fast. Another thing the super sensitive screen works with gloves when turned on just as Nokia states, The screen is 4.5 inches and has more pixels per inch than the iPhone 5. As for the camera, it is perfect if you are in a pitch dark surrounding as it captures a lot of details with low levels of light and with even flash off. In other situations it takes better pictures of everything than my digital camera which is about a year old, however I have seen the iPhone 5 photographs on couple of my friends phones and the Nokia has a slight advantage as things are crisper, but it isn't a great difference as the other features, as all phones are getting better camera's. Finally the phone has Nokia's Killer apps for the phone such as Nokia Drive which can tell directions even when off line if you download maps, and Nokia city lens does create a useful augmented reality by pointing out businesses and sights through the phones camera. All of this is only $99 at At&t; with a contract and even better only $450 without one, so you definitely get more for your money.", "Date": "November 20, 2012"}, {"Title": "The World's Most Elegant Brick", "Author": "Randall G. Arnold \"texrat\"", "ReviewID": "R3T7MP1M83BK65", "Overall": "4.0", "Content": "I must preface this review by stating that I am a Nokia employee and all following comments may be tainted by incidental bias.  Also coffee.I must also state that I am a button-pusher.  All day I push buttons here and there.  I push them almost everywhere.  I've come to love the button push.  I've come to love it very much.I'm not a touchscreen sort of guy.  Yet I use touchscreen phones and know not why.  I love their look, their feel, their glow.  So maybe, after all, I really DO know.The Lumia 920 has been called a brick.  \"Excessive length, excessive thick\".  It is not featherweight nor thin.  Neither plasticky nor crackity nor prone to spin.Yet in my pants it loves to ride.  And in women's purses darkly hide.  But, oh!  the gasps when it's in sight.  Sexy lines and colors bright.Some swear there are no apps for it.  But owners know they're full of... spit.  How many, how much, can you install?  There's only so much time, after all.When I gave up keys, at first it hurted.  But now I am complete converted.  Adjust, adapt, adjust some more!  You too can be a touchscreen... connoisseur.So here I sit, a-fondly staring; touching, flicking, swiping, sharing.  Enjoying the little live tile show.  Feeding my info addiction, you know.I like.", "Date": "December 7, 2012"}, {"Title": "Great Phone but...", "Author": "Jacob", "ReviewID": "RT85KRG1WJFCD", "Overall": "4.0", "Content": "I really enjoyed the 920 however, there were a few features lacking that made me switch back to the iPhone such as custom ringtones for text messages.", "Date": "September 13, 2013"}, {"Title": "Worked fine for a while", "Author": "Sri", "ReviewID": "R2U7XMQQ5SDRR3", "Overall": "1.0", "Content": "I got this unlocked and it was working fine for a while. I was coming in from using a HTC Titan and I like Windows phone so it went well for a couple of months - until it starting acting weird.https://www.youtube.com/watch?v=jUqH7No88mghttps://www.youtube.com/watch?v=jjtreGaaQUAthe screen basically gets a mind of its own sometimes and starts selecting/touching stuff on the display by itself. It started out pretty random - was typing a text message and it started to type gibberish. This went on and off for a while - until it completely bricked last night.I used to love Nokia- had a few of them while growing up but this is a huge disappointment. My old HTC Titan ran for 2 years without any major problems..:(", "Date": "June 22, 2013"}, {"Title": "NOkia lumina 920", "Author": "Edmund Rajkumar", "ReviewID": "R1374EDPLPTHUU", "Overall": "5.0", "Content": "Better than Iphone5 and samsung galaxy4, Better battery and reliable phone from windows. Hats off to lumina 920. Best phone I have ever used.", "Date": "June 8, 2013"}, {"Title": "I'm surprised how much I like this phone", "Author": "Thaddeusf", "ReviewID": "R1R45B6Y9QOQL5", "Overall": "5.0", "Content": "And the service from the seller was excellent.  I still don't think I will replace my 'personal' phone, but the Windows phone is an outstanding corporate phone.  Microsoft has come a long way in their chatch up plan.", "Date": "February 18, 2013"}, {"Title": "scam", "Author": "Kenneth Delisle Jones \"las vegas\"", "ReviewID": "R3KCD9QYM7CDVW", "Overall": "1.0", "Content": "The seller TURBOTRONICS-USA sold a locked phone as unlocked. I assume the reason for this was to jack the price up. I contacted the seller several times to assist me on trying to get the phone unlocked, and of course no response. I finally had to go on-line and buy and unlocked code for $50,00. I thought that a company like Amazon would screen its re-sellers a little better. My only advise is avoid this seller.", "Date": "April 1, 2014"}, {"Title": "No Earphones in the box", "Author": "Kishan Bhutra", "ReviewID": "R3PTJ9ZV6RKEA7", "Overall": "3.0", "Content": "Delivery was within time. Product as per specification except for the earphones which is not provided in the box. Dissapointed due to that. Deliver the Ear phones and I'll be the happiest person :) Thanks", "Date": "June 23, 2013"}, {"Title": "Desbloqueo del telefono", "Author": "Hugo Barrios", "ReviewID": "ROG2SJOTVCLWA", "Overall": "3.0", "Content": "El teléfono no puede entrar en servicio porque me pide numero de PIN, favor ver para desbloquearMe gusto por que es rapido y tiene muchos accesorios", "Date": "January 17, 2013"}, {"Title": "Like the Phone, Don't like OnTheGo merchant", "Author": "Laoblue", "ReviewID": "R302PMLXVD7LVO", "Overall": "3.0", "Content": "Beware of this merchant!  After several emails, I was informed that the Lumia 920 is locked to AT&T; network (still not sure if it is a black color or white one though).  If I had purchased the phone before I pressed for more information, I would have surely been dissappointed (they even offered a refund if I had purchased it).  Their advertising of this phone is not very clear, and misleading - so be careful!  Ask detailed questions BEFORE you purchase from any of these Amazon merchants!", "Date": "December 10, 2012"}, {"Title": "Dissapointed", "Author": "Sarah Burgoyne", "ReviewID": "R3J59GOR5DND8O", "Overall": "1.0", "Content": "Purchased this unlocked from this supplier which I also paid for as a new phone and it did not come with the ear phones and is not unlocked. I live in a country which is hard to change all items! Do not buy from this supplier. Phone however is pretty cool.", "Date": "December 30, 2013"}, {"Title": "ATT Nokia Lumia 920", "Author": "Dan L. Johnson \"Dan279\"", "ReviewID": "R15O36977EZ9DY", "Overall": "1.0", "Content": "Look.....You pay for the phone upfront. ATT will not honor a DATA Plan with the Phone unless you have a contract..........they want a 2 year contract now, whether you buy the phone outright or for 19 bucks with plan....This is a ripoff to say the least.  The possibility exists to have it unlocked, but your at the mercy of ATT and their senior level management in MAY when the exclusivity contract expires between ATT and Nokia. Leave it alone you guys. If you love ATT, buy the phone and plan for 39.99", "Date": "April 1, 2013"}, {"Title": "JUNK JUNK JUNK", "Author": "David B.", "ReviewID": "R1GIFM1FM71SIB", "Overall": "1.0", "Content": "Do NOT ever purchase a Windows based phone. They are absolutely trash. Stay with Samsung or any other Android based phone!", "Date": "February 3, 2014"}, {"Title": "Not a phone, it's a phablet", "Author": "<", "ReviewID": "R17CPFV9DE7554", "Overall": "1.0", "Content": "The size and weight of this thing is a non-starter for many people.. like most women, and men who wear their phones in a pocket. What a brilliant idea on Nokia's part, to make a \"flagship\" WP8 device that serves the niche market - geeks with large palms.", "Date": "December 2, 2012"}], "ProductInfo": {"Price": "$599.99", "Features": "Includes original box and all original components\nNokia Lumia 920 AT&T; Windows 8 LTE Smartphone 32GB/1GB RAM - BLACK\n100% Original and Authentic Item", "Name": "Nokia Lumia 920 AT&T Windows 8 LTE Smartphone 32GB/1GB RAM - BLACK", "ImgURL": "http://ecx.images-amazon.com/images/I/41XuElzKZ8L._SY300_.jpg", "ProductID": "B009ZC91AY"}}