{"Reviews": [{"Title": "The Perfect Phone For Someone Who Needs Just The Basics,  And Nice Big Keys", "Author": "MJNC367", "ReviewID": "R3U2EIX9B2990Q", "Overall": "5.0", "Content": "I've had tracfone for 12 years now, and this is the best phone I've had. It has a large bright display. The number keys are large and brightly lit. No more tiny buttons to fumble with. The phone has a very comfortable feel in your hand, and it's thin enough to easily fit in a shirt pocket. It is really easy to use. The phone comes with a car charger, a home charger with a charging stand and power cord. But you can plug the cord directly into the phone if you wish. The instructions are really poor, so my advice if you need help, get a kid to help you, they will have it set up in 10 minutes. Seriously.  It has a speakerphone which is loud and clear. You can attach one of those camera type wrist straps if you wish. The FM stereo radio has a jack for headphones or ear buds and it sounds excellent. You can preset radio stations and access them with a single key push, just like your car radio.  If you text, it deducts 1/3 of a minute per text message. When it is finished charging it will beep. You can't go wrong if  the features meet your needs. I purchased mine on Amazon in January, 2013, and I am very pleased with it.  This is a very good deal considering that the card alone costs $40.00. So it's like getting the phone for free. The 400 minutes are only for 3 months, then you have to buy another card to keep the phone activated.  I am a light user, so I buy a 60 minute card (automatically doubles to 120 minutes) every 3 months. Total airtime cost for me; $88.80 per year, $7.40 per month, tax included.Thanks for reading. I hope someone finds my review helpful in making a buying decision.____________________________________________________________________  Amazon also has the phone without any airtime for $14.98 with shipping.  --->  Alcatel 382G Prepaid Phone With Double Minutes (Tracfone)  And the phone with 400 (800 doubled) minute/1 year card for 89.99 plus shipping.  ---> Alcatel 382G Prepaid Phone With 800 Minutes and Double Minutes (Tracfone)____________________________________________________________________******UPDATE 12/12/13- A lot of people have asked if this phone has a cover over the keys, which it does not. I was on tracfone.com and they have a new version of this phone called \"The Big Easy Flip\", model # 392G. It is $29.99 with free shipping. The keypad is the same, but the screen is a lot bigger, and it has 3G/WiFi, a 2 mp camera, bluetooth, mobile web access, FM radio, MP3 player, micro SD card, external caller ID and time window, and more. I checked and it is not on Amazon yet.  I'm seriously considering getting this one, mainly for the the flip style, which I prefer over the bar style of this phone. It looks like a welcome improvement to an already great phone, even if you don't need all the other extra features.********************************************************************", "Date": "September 26, 2013"}, {"Title": "Great simplicity", "Author": "MoBob", "ReviewID": "R18MBLLBLUP8VH", "Overall": "4.0", "Content": "This phone was bought for my 94 year old mother in law but after setting it up I kinda wished I had one.  It is easy to see, use and generally operate.  I especially like the contacts option on the home screen,  It also has a built in radio which functions quite well.", "Date": "June 17, 2013"}, {"Title": "got it for hubby...", "Author": "B. Gill \"15 grands\"", "ReviewID": "R3P6ET26TS91HW", "Overall": "5.0", "Content": "who is electronically 'challenged'!! LOL...we like it simple!! This is it!! also helps if your hubby wears GLASSES so he can read the little 'symbols'...(rolling my eyes here) anyway, it's just as it says it is, simple to use, large numbers, LOVE the backlit numbers and I got him a nice case for it too. GREAT DEAL!", "Date": "September 29, 2013"}, {"Title": "Super Good Deal!", "Author": "Charles V Schwartz", "ReviewID": "REWP3WZQL4O88", "Overall": "5.0", "Content": "So, last time I had a Tracfone, well it pretty much sucked.  This thing is just awesome.  I do agree that the instructions are pretty bad, but there is a good tutorial on line at Tracfone. The price is just great, and not only did it show up with the 200 minute card, plus double minutes for life, but it already had about 15 minutes just to set it up. So when I set it up it pops up with 410 minutes and says it has 455 service days.  Man, i don't have to worry about adding time for quite a while.  I only use it when on the road, or when the power goes out and kills my internet phone.  Oh, it also, in my area code, runs Verizon as a carrier.  So the coverage is just great.  If you need a cheap cell phone....can't beat it!", "Date": "February 18, 2014"}, {"Title": "Love this", "Author": "s juanita", "ReviewID": "RA3K5LHZ24HJ", "Overall": "5.0", "Content": "My husband need a new phone. He only uses it for occasional calls and, of course, in case of emergencies. He did not need a phone with long term contracts of other things on it that he would never use. He is very pleased with it. It fits the budget well and does what he needs.", "Date": "January 15, 2014"}, {"Title": "High Recommend Alcatel 382G Prepaid Phone", "Author": "bettyz", "ReviewID": "R3E8HQQS213B4S", "Overall": "4.0", "Content": "It's a large phone with large buttons which we like very much.  The only problem is the directions we received on how to use it were very sparce.  It takes several calls to get customer, but they are very helpful once you get them.", "Date": "March 27, 2013"}, {"Title": "Great Deal!", "Author": "The Little Red Train", "ReviewID": "R1M762D95TXHRH", "Overall": "5.0", "Content": "Sister-inlaw loved it, easy to us. Not hard  to see the numbers. Good for the elders suggest to buy it.", "Date": "February 11, 2013"}, {"Title": "Perfect!", "Author": "Louise G.", "ReviewID": "R9H9WXT2LXEM8", "Overall": "5.0", "Content": "Works great, easy to activate, got my double minutes - no problem.  Perfect for my Mom.  Large numbers, easy to read screen, simple to use.", "Date": "March 22, 2014"}, {"Title": "Purchased twice!", "Author": "Patricia A. Genier", "ReviewID": "R3Q0E8I89JXMAQ", "Overall": "5.0", "Content": "This phone was purchased for my husband twice......the first phone fell into the lake while he was ice-fishing!  When he came home and told me, I immediately ordered the second one.  He likes the larger numbers on the keypad, and the size of the phone is perfect to fit into his shirt pocket.", "Date": "March 5, 2014"}, {"Title": "Good for people that need large buttons.", "Author": "GARY BROWN", "ReviewID": "R2V0HJJGGP8LZ8", "Overall": "4.0", "Content": "I got this phone for my wife who has bad hands and the large buttons are great! She likes this phone.", "Date": "February 23, 2014"}, {"Title": "Alcatel382G", "Author": "Mary Fillinger", "ReviewID": "R2207YDI4RNJ62", "Overall": "4.0", "Content": "It was ok for the money. I like the large numbers I can see them much better than the ones on my other phone.", "Date": "February 9, 2014"}, {"Title": "Great, simple phone!", "Author": "Diana Rodemyer", "ReviewID": "R1ESHENM78XWYO", "Overall": "4.0", "Content": "Great phone for my father.  He is not tech savvy and just needed a basic, easy-to-use phone.  This was a great choice.", "Date": "January 14, 2014"}, {"Title": "Battery problem", "Author": "james a barnes", "ReviewID": "R3GRLLZ1UBKQIT", "Overall": "4.0", "Content": "I have had the phone for about a month and it has been working fine. I seldom use it so I was surprised recently when it needed more and more frequent  charging. Then, yesterday the phone rang and there was a message onscreen that the battery was about  expired. It has been charging for about 12hours and all I can get from the screen is a picture of a battery. I cannot use the phone. I suspect the battery is defective and will have to be replaced. How common this is I have no idea.", "Date": "July 25, 2013"}, {"Title": "big buttons but still hard to figure out", "Author": "B.F. \"B.F.\"", "ReviewID": "RBX8V001YQM44", "Overall": "3.0", "Content": "bought this for an elderly relative. it's still hard to figure out the menus for contacts. numbers are big but that is not all an elderly person needs to use a cel phone.", "Date": "July 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AEB4DEY"}}