{"Reviews": [{"Title": "Absolutely beautiful, functional, fluid device", "Author": "aceoforder", "ReviewID": "RDE5OSK4JY06T", "Overall": "5.0", "Content": "I manage mobile devices for a corporation in Rhode Island, USA and chose the Nokia Lumia 822 when we switched our account over to Verizon. I couldn't be happier.I previously had an HTC HD7 from T-Mobile, and here some some of my observations:- The AMOLED screen on this device is superb and quite possibly one of the best smartphone screens I've ever used. It is made of Gorilla Glass 2 and easily adjusts brightness to ambient light surroundings, keeping the colors sharp and bright whether in sunlight or in a dark room. Don't be turned off by the lower resolution of the 822 - it didn't make any sort of difference to me. Also, it is true that this screen features Nokia's high-sensitivity glass augmentation that allows it to be used with gloves. I can successfully choose music, tap on tiles, and even text without unnecessary effort.- Compared to my 1ghz HD7 running Windows Phone 7, this device is incredibly quick. WP7 was not a laggy operating system by any means, but the 1.5ghz dual-core in this device plus WP8 is a dramatic change. I have experienced absolutely no lag, whether I am switching apps, opening apps (the splash screens for most apps appear for less than a second, even with some video games). Alot of this is due to the OS itself: WP7 was built on Windows CE which had its own hardware and coding limits. WP8 shares the Windows 8 kernel for maximum hardware compatibility and optimization.I'll leave reviews of the actual Phone 8 OS to the rest of the Internet.... but it is elegant, beautiful, fast, capable, and very very under-appreciated in the marketplace. I believe this'll change, and am recommending my company to deploy Windows Phone 8.", "Date": "November 20, 2012"}, {"Title": "Lumia 822 In Depth", "Author": "James", "ReviewID": "R27CUKJNGTVP4G", "Overall": "5.0", "Content": "The Nokia Lumia 822 from Verizon is an excellent choice for Verizon customers looking to move to a Windows Phone.ASTHETICSI'll start off with the asthetics of this phone. This phone is much more attractive then the photos make it appear to be.PLASTIC - The plastic is sturdy and thick with a high quality fit and finish to it. The black and grey is a flat finish while the white is glossy. It is a plastic with no grip coating and a nice textured look. It does not have the rubbery looking finish as seen on the 8X. For the White glossy finish it however takes a hit in the quality department. The glossy finish gives off a cheap look and feel. It's sad because I was really gunning to get it in white until I saw it. The back cover uses a snap on clip system that hold firmly and does not flex without moderate force. The back cover features NFC but the WIRELESS CHARGING IS NOT INCLUDED. A new cover is required.FEEL - The sides of the phone have and inward slant from bottom to top which makes it comfortable to hold and easy to maintain a firm grip.The phone uses a wider display then you see on other phones. I have big hands and it fits well into them. It feels nice weight wise. It has a little heft to it when holding it but not heavy enough to be bothersome. It feels durable but it a little thick. If you like the iPhone 5 for it's size then this will surely let you down.BUTTONS - The buttons are located on the right side and are thin. They have a firm placement and a nice click to them. The click isn't loud but it makes for an excellent feel. The power button is placed perfectly for your right thumb, I however am left handed and I find it a little more difficult to press.The Photo button is a 2 stage button. It takes a little getting used to as the second stage feels muddy and firmer then the size of the button leads on to be.GLASS - The glass uses an edge to edge front with the exception of the plastic on the bottom portion of the phone. The bezel around the glass is very slight with no gaps. It sports a nice solid black surrounding the display with very responsive touch buttons below.HARDWAREDISPLAY - The display is a 480x800 AMOLED Gorilla glass 2 display. Don't let the resolution fool you though. The screen is bright and the colors pop nicely. I found it to look much better than the 8X display. When the display is turned off or is showing black it blends in with the bezel and looks great. The display sesitivity is great and features an ultra sensitive capacitive touchscreen that works with gloves on although your experience will depend on the gloves. Thicker leather gloves do not work. The touch buttons are just as responsive.PHONE- Phone calls are crystal clear and other callers hear me perfectly. Easily the highest performing phone I've ever owned smartphone wise.  The speakerphone is loud and clear as well. The reception on this phone is great as well recieving a reliable signal in even the most problematic areas.CAMERA - This camera is amazing, for the most part. Low light shots come out great with the extreme flash good enough to take a good photo in a blacked out room. it does however suffer from oversaturation and sometimes the white balance just does not work out so well. I think it's more of a software issue and I expect the problems to be resolved in future updates. Nokia exclusive software includes Creative studio for photo editing and Cinemagraph to make animated photos. I took a picure with my daughter moving round in front of a mirror and edited it so she was standing still and just the reflection was moving. Everyone loves it. It outpaces my iphone in every way imaginable. The front camera stays on average grounds however.AUDIO - It features a mono speaker located on the bottom left of the phone. It's really loud but it suffers from a tinny sound. I could hear this thing from across the house though. The earpiece however sounde great and has excellent balance to it. I can hear people even in a noisy room. the headphone jack is on the top right of the phone and features features audio processing from Dolby to include an EQ and \"Dolby Headphone\". Dolby headphone would be best described as the equivelant of the Beats Audio software. It boosts some frequencies and thats about it. It helped out my high ohm headphones out a little bit but is not a replacement for a hardware amplifier.BATTERY - The battery is average and nothing to write home about. I use my phone moderately and it gives me about 16-17 hours on a charge. It stays at the 100% mark for about 2 hours and slowly rolls down hill after that. It is nice having the removable battery though. This includes talking, web surfing, apps, games, photos, texting, ect.MEMORY - 16GB on board memory provides about 12GB of free space after a hard reset is performed (deletes all of the downloaded maps from Nokia Drive). You can then download only the areas you need from Nokia Drive. It also sports an internal SD slot and the battery has to be removed to insert/remove the card. Apps cannot be stored on it.CPU/RAM - This phone has all of the same core hardware specification as every other windows Phone currently available in the U.S. The lower resolution display frees up some memory though and enables the OS to be zippier.SOFTWAREAPPLICATION EXCLUSIVES - One thing you get with Nokia is exclusive software. Nokia Drive is not on other handsets yet. It also includes a few extra \"lenses\" (photo apps) such as the aformentioned cinemagraph, Panorama, and smart shoot which takes a series of pictures and then lets you replace peoples faces until you get a shot where everyone is simling. These apps all work great and are fun to play around with. It also includes Creative Studio which is like a photoshop/Instagram filter app. It works well and holds alot of features. Other apps include ESPN, Univision, Words With Friends, Foursquare, Groupon, Nokia City Lens and more. There are currently 32 apps exclusive to Nokia phones on the store as of this writing.OS - Windows phone 8 is a whole new review, I came from the iPhone and I love it. There are enough note worthy apps available to keep me comfortable and the operating system holds enough features to be more then usable on a daily basis. It has it's fall backs but there is nothing to make me run for the hills. I can say that it runs like a champ on this phone. No stuttering, slow loading times, or crashes have happened on this phone. It outpaces my iPhones performance enough to make me go wow. The Verizon exclusive (for now) Data Sense software works great and tracks your data usage and breaks it down to Cellular/Wifi and each app usage and resets whenever you want it to.APP STORE - It's got alot of junk, but if you sift through it there is alot of cool stuff on there. Some things are slim pickings while others have a copy of a copy of a copy. It's no better then android or Apple. There are alot of big name developers announcing new titles every day.OVERALLOverall the phone is fairly attractive, solid, well designed, high quality and very usable. The only design problems I have is the power button being odd for a left hander and the 2nd stage of the camera button just not feeling quite right. The OS is fast, responsive and zippy. The phone works like a champ, The camera is a little quirky but it still is a great camera considering what you have to compete against. It's big and heafty but not quite a brick and I love that. The display is amazzzzzing even though he resolution is a little below current industry standards. Battery is good enough but could be better, I feel like I will get caught with my pants down one of these days.For 100$ you cant go wrong with this phone. It is way better quality then anything else you can find for this price and sets a standard by which every phone in its price range will need to improve to outpace it. If your looking into a windows phone This will surely not disapoint unless you really cant settle for the lower resolution display.", "Date": "November 29, 2012"}, {"Title": "Beautiful and Innovative Phone", "Author": "J. Rothwell", "ReviewID": "R2KFB123HN4DQL", "Overall": "5.0", "Content": "Basaed on reviews and confidence in Nokia, I switched from a Motorolla Droid 2 Global, which I liked, to the Nokia Lumia 822. Here are some of the main reasons why I am delighted with that decision after having a chance to use the phone:The Lumia 822 camera is excellent; the video and photos are clearer and the lighting more natural than the droid's camera and any smartphone I've seen.The Lumia music features are amazing. Not only can you sink all of you ITunes material with the Lumia device, Nokia provides a free no-add Pandora-like service. Moreover, I've downloaded an app \"Amazing Music,\" which allows you to stream and store quick links to entire albums.Nokia/Lumia's driving and mapping services are rated as the world's best. Though I haven't taken a road trip yet, I tested it with my commute to work, which involves walking and taking the metro: It was incredibly accurate and even told me the stops in between the one I needed.The homepage is incredible. The Windows operating system lets you customize the location and prominence of your apps, and let's you pick a few for live constant updates. For example, when you \"pin\" your contact to the front page (or further down), you see his or her facebook, twitter, or linked-in updates displayed overtop the app. So, you don't even need to log into Facebook to see what your closest friends and family are posting.Indeed, the Facebook and twitter synching is the best I've ever seen. It takes seconds to take a photo, post it on Facebook, and tag your friends. It even remembers your recently used tags. It also shows pictures you were tagged in as a banner as you scroll and read upadates, which you can change if you want.Another plus is that Microsoft office is readily available, so you can edit Word documents and Excel documents, which is very useful for work. It also has a family room app that allows you to sink to-do lists, grocery lists, and anything else across phones and accounts with anyone who has a facebook, hotmail, or MSN account, or wants to create one for free.The keyboard is my only complaint, since I have big thumbs. I moved from the slideout QWERTY from Motorolla to the Iphone-like keyboard here. Still, it is larger, I believe, than the iphone board when you turn it sideways (it has a very wide screen), and the word suggestion tool is very good. I'm getting better at.The app store is a minor issue too, as developers are still getting use to Microsoft's new and impressive operating system (Windows 8). Yet, there are many excellent apps, and almost all of the apps I used with Google's operating system are available (and often look even better), including: Public transit trip planners, Gmail, white noise, chess, YouTube, a photo editor, Wikipedia, Facebook, a flashlight, bike share services, weather channel, a public parking payment app, and The New York Times. For gamers, there are an increible number of options, including Xbox compatibility, but I don't play games other than chess.Overall, these issues are minor. The best part of the phone is its elegance and beauty. The image, picture, and video quality are the best I've ever seen, and the tile colors can be easily changed to your mood or preferences. The conversation and sound quality is also superb.It is easily one of the best phones on the market and is roughly half the price. I highly recommend it.", "Date": "December 2, 2012"}, {"Title": "An excellent phone, especially for Microsoft Office users.", "Author": "liverdonor", "ReviewID": "R359QBHI4WVLL2", "Overall": "4.0", "Content": "I purchased a grey 822 from the Verizon store on November 9th (sorry, Amazon - couldn't find it on your site).Nonetheless - this phone has some excellent features, and a few nits.Pro: As has been mentioned, the screen is nice. Surprisingly, you can read it outdoors although direct sunlight reduces visibility somewhat.Pro: Real, honest-to-God Microsoft Office applications - not knockoffs. I've even edited Powerpoint presentations on the way to meetings, with no problems.Pro: RF. I have owned cellular phones, both dumb and smart, since 1992. Sometimes the radios are good, and sometimes you can't hold onto a session to save your life. Out of all the smartphones I've used (including Motorola, who normally makes great radios), this has one of the best. I get reception in places my wife's feature phone can't even pick up one RSSI bar and my older iPhone 4 can't get any reception at all. A fine radio. Can't wait to try it out overseas and see how the HSPA radio works!Pro: Bluetooth 3.0. Very good performance with all my BT devices (including my boat's BT navigation equipment).Con: Bluetooth profiles missing. Why, oh why, didn't Nokia include the HID profile? iPhone and the higher-end Android phones have it, and it's really handy to be able to whip out a BT keyboard to edit some documents.Con: So, Microsoft - where the heck is VPN support? This is easily the biggest complaint I have. I NEED VPN support to connect to machines in my office and monitor builds, perform IT support etc. As it is, I have to kludge by with using WiFi connection sharing and hooking through with my laptop, which is slow and lame and uses up my precious GBs. I have heard rumors that MSFT may include it in Apollo+ (or WP8.1 or whatever they're calling it). We'll just have to wait and see, but that was a big mistake, IMHO.Pro: I concur with previous reviewers on the Nokia apps. They are, for the most part, excellent - especially the \"offline map\" mode in the Drive and Maps applications. Tested by driving all over the lower mainland (British Columbia, Canada for those of you who don't know it), in offline mode and never got lost.Con: Another nit is the lack of connection between the Favorites in the Maps application and the Drive application. One would think you could store a Maps fave and have it show up in the Drive app, but no dice. I had to do everything twice. Annoying.Pro: Audio quality, especially over A2DP (stereo Bluetooth) connection. I play through my BT-enabled receiver and it sounds awesome - especially high-quality rips of discs I own. Who needs an iPod or other player anymore?Summary - a little over one month in, I still like this phone very much and find it a lot easier to use than Android and generally smoother flow than Apple's iOS. If any of you are software folks, you'd appreciate that this OS's design seems to have taken a lesson from this book The Inmates Are Running the Asylum - almost all of my most common tasks are very easy to accomplish with very few gestures/keystrokes. All in all, very satisfied with this device.", "Date": "December 17, 2012"}, {"Title": "Love It!", "Author": "Amocat", "ReviewID": "R144XCN0QZ2BLE", "Overall": "5.0", "Content": "I just switched to the Nokia 822 from the HTC Trophy.  Many in the store were getting the HTC 8X, I think because it seems like a Nokia 920 (only on AT&T; for now).  I did lots of research on both the 822 and the 8X and I kept coming back to the 822.This phone is wonderful!  The screen is so easy on the eyes, everything is so clear.  The Camera is very good.  The screen response is spot on.  The Nokia FREE apps are fabulous (Nokia Drive, Nokia Maps, Nokia City Lens, Nokia Music and more).Not sure if Verizon, MS or Nokia added this, but FINALLY you can change the font size in text/messaging, people, email and more.  You can also \"magnify\" the screen.  (See \"ease of access\" in the Settings area).The only negative I have found with this phone, is the hard edge where your ear touches the phone.  I am already adapting to that.", "Date": "November 19, 2012"}, {"Title": "Excellent", "Author": "Kym/Kyle", "ReviewID": "R1C5Z3VWVG7MMG", "Overall": "5.0", "Content": "I switched from the HTC Incredible to this phone.  I absolutely love it!  It is very fast, the free apps (Nokia city lens, free music streaming - with offline play mode, etc.) work wonderfully, it's really easy to customize just about everything, and the layout is very easy on the eyes...I just love it!Pretty sure extended life battery will fit in an Otterbox case.Now for the cons:There are a limited number of apps at the moment.  So far - the only app I have not been able to get that I wanted was the Nook app (although it seems like it will be coming any time now).  Furthermore - I think the app dev's will come once more people pick up this phone.Battery life on this puppy (without using the battery saver) is about one to two days depending on your usage of the music streaming, etc.  Although, I am NOT using the extended life battery - so that would probably significantly improve.TL: DR -- really nice lookin, easy to use phone; not alot of apps right now & battery life can be short.  Overall, the pros far outweigh the cons imo.", "Date": "November 27, 2012"}, {"Title": "Elegant Phone - Recommend", "Author": "regves", "ReviewID": "R13GMKS1HMQ0GN", "Overall": "5.0", "Content": "I've had this phone since mid-November. Windows 8 is very easy to learn and works well. Internet surfing is exceptionally fast, especially when on wifi or 4G. It also seems to be durable, having dropped it twice while standing. Both times the battery and cover flew off but putting it back together it worked fine. I would subtract a half star for thickness and weight if possible. Additionally the screen is bright and clear and the camera works great under most conditions, lacking a bit in low light as most small digital cameras seem to. Battery - twice since I've owned it I've run out of battery during the day after quite a bit of game playing/web surfing so that seems good to me. Haven't experienced any functionality problems. Highly recommend the phone.", "Date": "February 28, 2013"}, {"Title": "Nice Phone, But...", "Author": "Christian Book Reader", "ReviewID": "R2GPF6J6VQ5MA5", "Overall": "3.0", "Content": "I purchased this phone directly from a Microsoft Store based on many positive reviews.  After using the phone for a couple of days, I seriously question whether the reviewers actually use this phone as their primary smartphone.  I consider myself an average smartphone user, and based on the Lumia's still lacking features, I have since returned the phone.  However, I would highly recommend buying products from a Microsoft Store as they are very helpful answering questions, and have a good return policy.Here are the things that I liked about this phone:* The screen is bright and crisp.* The email and calendar apps have nice features and are easy to use.* The battery life was very good.* Call quality was good.Here are the things that I did not like about the phone:* The Nokia Drive navigation app does not announce street names.  It does show the names on the screen, but having to look down at the phone defeats the purpose of using voice enabled navigation.* Many websites do not recognize the phone as a mobile device, so the page is the desktop version.  As such, the text does not automatically wrap across the screen.* A widely used podcast/mp3 was not recognized by the phone, so I was unable to download.* There are still quite a few popular apps that are not designed for Windows 8.In summary, if the above items were addressed, I would definitely purchase this phone.", "Date": "December 5, 2012"}, {"Title": "Waaaah! I Miss My Android!", "Author": "lisaloopers", "ReviewID": "R2KXQCE01B4GR8", "Overall": "2.0", "Content": "I thought I really wanted this phone. Had a Droid Pro for almost 4 years (I'm thrifty like that-not a sucker for trends) and was finally ready for the switch to virtual keypad (not to mention a much larger viewing area!) Still not impressed by the iphone, even though I got suckered into a Mac a few years ago, so I thought I'd try a the Windows platform. I saw the hype about the Nokia Lumia 928, but really didn't like the rectangularness of it--too angular. The rounded corners of the 822 seemed more hand-friendly (and pocket-friendly). Plus I was opposed to an iphone-like unchangeable battery (?!?!), so I chose the Nokia 822.  Besides, it still has that Carl Zeiss lens, right?  I'm a photographer from the analog days, so I thought the Zeiss was a touch above...call me a sucker.Unfortunately, I have not had good luck with the few things I've ordered online this year. Out of 4 things, 3 had to be returned for refund or exchanged. All from different companies, but I swear, this year there was a trend toward not giving any refunds until the customer starts hollering, YOU HAVE YOUR PRODUCT BACK, NOW WHERE'S MY REFUND????? Seriously, they all denied receipt of respective products until I produced tracking numbers or receipts for certified mail, so Customer Un-Friendly (take THAT, SkinScript and 1800Contacts!)Sigh. I wish I'd played with this phone in the store somewhere, but where can you go that they'll leave you alone for a few minutes?  Oh, wait, the Verizon store, but only if you have that I Have A Problem look on your face. Kinda like Home Depot...but those are whole other talk shows. I'm tangenting, sorry.You should really be sure you like this phone and the Windows Mobile platform, before you're stuck with it for two whole years. Otherwise, you'll be like me, wishing you could switch back to your crappy, taped-together, barely holds a half day's charge, can only make a call on Speaker Phone, half your texts go crazy w Auto Complete Android phone. Can you tell I'm not looking forward to the next year and a half til my phone can be upgraded? While I'm at it, next time, I'm going back to Android and I'm leaving Big Red behind for a no-contract HTC EVO or some such. And another talk show. Sorry.What I like:--As mentioned, the hand-friendly shape and the size of the viewing area--Large tiles, easily rearranged to the size and position that best suits your needs--Fairly simple to navigate your way through the phone/screens--Calendar and other reminders are more useful than with my Droid/google calendar--The speakers SSSSSSUUUUUUUUUUUUUCK! I am not a headphone gal, none of you should be wearing those things. If you only knew how much wax people are impacting into their ears nowadays with their earbuds, not to mention the increase in decreased hearing function in younger people, well, you catch my drift (whispers, Can ya hear me now?) The speakers for my Droid were decent, but compared to the tinny, Hello Kitty radio sounding things on this Nokia, well, it makes my Droid sound like a boombox. Ugh. Forgot how much I hate (yes, hate is suitable here) those Nokia speakers. Ugh Ugh Ugh.What I Do Not Like (Hate is a strong word, but I'm almost there):--Half the web pages I view are so tiny I can't see them--both online grading websites for my kids' schools and craigslist are too small to read, and I am not paying even 99 cents for an app that will allow me to read craigslist-this issue alone renders the phone useless to me--Had to set up 2 more email accounts just to set up the phone (msn for the phone, Nokia for the music player and a couple other ones)If you have msn or hotmail and a Zune account, well, forget about this one gripe. And say hello to that brontosaurus over there for me!--Yes there are probably plenty of apps for this platform, just not the ones I use (and I'm no social media junkie-no Twitter for me) Seriously, is craigslist and Instagram too much to ask?  Come on, you Finns! I thought you were the tech leaders of the world!Thanks for letting me vent.Good luck with your search for the perfect phone. You won't find it. You'll have to adapt like the rest of us. Root and adapt, I suppose.", "Date": "October 17, 2013"}, {"Title": "Windows Phone 8 is TNG!", "Author": "Chris M", "ReviewID": "R3QHOU0AFPK6FM", "Overall": "5.0", "Content": "Windows Phone 8 is the best. I have a Windows 8 PC and once I got the Nokia Lumia 822, my Windows 8 experience got better. I can transfer files with ease. With the PlayTo option I can play videos and music to any compatible device, such as my Xbox 360, and watch them on a larger screen. Plus, with 7gb of SkyDrive, I can save my photos, PDF files, etc and view them on any Windows 8 device. It also takes a micro SD card, up to 64gb, so I can store music and videos on my phone as well and save my phone's internal storage for the apps I install on it. I sometimes feel like I'm in Star Trek TNG with the way it all works together. Now when I see Lt. Commander Data with his data pad, I keep looking at it to see if he's on Facebook. Windows 8, Windows 8 RT and Windows Phone 8 is truly TNG. I like the Family Room option a lot, too. My brother and my sister's fiancee also use Windows Phone 8 and, even though my sister's fiancee is on another service provider, we share the Family Room to post pictures, events, and news to each other or just simply keep in touch. To truly appreciate it, you have to try it out.", "Date": "October 2, 2013"}, {"Title": "great phone for the price.", "Author": "R. Bozzuto", "ReviewID": "R10NB3A3I77RZO", "Overall": "4.0", "Content": "This is a great phone so far. I thought I ordered the black model but they sent it in white. I came from palm pre 2 and so far I love the Lumia. I didn't want an iphone I think they're overrated and clunky. Ive seen my sister in laws with the case on it its like half the size of my kindle. I don't carry a purse and don't want to but with something that big it wouldn't fit comfortably in my pocket.  Ive had a droid x too I wasn't impressed with call quality with some calls being echoed.  It also didn't have a vibrate option for all alerts which was a turn off here.I was tired of the short battery life of my pre 2 so thats already a step up Id say its average as someone else put it but still one day more than I got out of my old phone.The crisp features of the Lumia are great and receiving and or editing MS docs is a no brainer.  The music option is great as you can add your favorites to your desktop.  Tune in radio and Pandora are already installed. GREAT for me I'm a music person.I noticed you have to shut it down when it doesn't react like it should. Ive had to once in two weeks so no biggie. One thing I did which I think is a great idea is that for $5-6 you can buy a small case for the phone since it has a slick feel to it you might not hold onto it easily. Ive dropped mine a couple times and it hasn't cracked the screen as someone else said. Its still nice and slim too.The bigger screen is a plus from the pre2 but no real keyboard its all about touch with the Lumia. Id given it 5 stars if it had better battery life.I'm not a big gamer but I see the xbox option on the home screen and I'm sure any of the apps not updated will be soon.  It was free to me with a Verizon upgrade so that's great too.After using the a couple weeks after writing this I had to order another phone. The OS didn't seem to be working properly and I want a different color.", "Date": "January 7, 2013"}, {"Title": "great phone", "Author": "ezcamper", "ReviewID": "RVEWEC5YE5EGM", "Overall": "4.0", "Content": "I was concerned about switching from my Android phone (Samsung Galaxy Nexus).  I thought I would miss my apps and the Google ecosystem. I don't. Even though there aren't a lot of apps yet, there are enough to keep you well connected to your community.  My whole reason for changing my phone was the bad battery life of the Galaxy Nexus. I was surprises at how much longer the battery lasts in 822, well at least at the beginning.So how long is it lasting?  Well I took a trip to Disneyland with the kids... taking lots of pictures, using the theme park app, and checking in on foursquare.  The phone outlasted my wife's iPhone 5, lasting 16 hours before I decided to charge it.  It still had charge.  I don't know if this attributed to the phone or the OS.I really liked Android, but I find Windows Phone 8 to be plain beautiful and simple to use.I have completely converted over WP 8; and there is no looking back.Love this phone.", "Date": "January 8, 2013"}, {"Title": "Very Happy with my choice", "Author": "Gary Watson", "ReviewID": "R1WMJS336RXWO1", "Overall": "5.0", "Content": "I was interested in trying this OS and I keep hearing good reviews, even from the Apple fan-boys. The start screen is fun to watch and it definitely gets attention. So far it is very stable. Not one single lockup or crash. It happened all the time with my Galaxy S. There are only a couple of Apps that I haven't found a substitute for, but something will come along soon.", "Date": "December 30, 2012"}, {"Title": "A Great Choice", "Author": "Ryan", "ReviewID": "R3BWNIB19CQ28O", "Overall": "5.0", "Content": "I picked up the Nokia Lumia 822 last week and so far I absolutely love this phone.Hardware:Overall--outstanding.Rock solid construction--it feels substantial and well-made.Screen--crystal clear, smooth animation, vivid colors.Camera--I'm not a heavy camera user, but in the few pictures I've taken the camera has worked well, even in low light.Phone--During calls, earpiece audio is clear.  Folks I am speaking with say I sound much clearer than my previous phone.Size--the right size for me at a 4.3 inch screen.  I don't want anything larger than this because it gets too large to fit comfortably in my pocket.Battery Life--good.  I keep most of my apps from running in the background and I can get 2 days out of it.  Other users who keep more apps running will likely get one day from the battery.Software/Ecosystem:Windows Phone 8 is awesome.  The level of integration between the phone OS, Microsoft Office (including Outlook), apps, Facebook etc., and hardware is outstanding.  A great example of this is the People Hub.  From one live tile, I can access any of my contacts, whether they are contacts through Facebook, Outlook (from work), Skype, or just a regular contact on my phone--they are all in the People Hub.  If I pull someone up, I have several options--I can call them, text them, email them, write on their Facebook Wall, call them on Skype, get directions to their house, etc.  The phone pulls in all this information automatically from all of its sources (Facebook, Skype, etc.) so I don't have to spend hours assembling the information myself.  Rather than opening up a specific app to do a specific thing, all I need to do is pull up my contact in the People Hub.  This is a simple example, but it's one of many innovative features on Windows Phone.One final note--the phone is great for work because it has Microsoft Office & Outlook.  I can sync Outlook on my phone with my work email server so that I can easily stay on top of things at the office, without having to rely on a third party app written by a no-name company.  I can easily edit Office documents on my phone and sync them to SkyDrive so they are immediately available on all my devices (work computer, personal computer, tablet), all integrated into the phone out of the box.The app selection is somewhat limited compared to iOS & Android, but I haven't had any trouble finding most of the stuff I need.  I imagine the app selection will continue to improve once Windows 8 has been out for several months.Folks who are skeptical of Windows Phone 8 should just do one thing--give it a try.  The more you use it, the more you discover how good it really is.", "Date": "December 4, 2012"}, {"Title": "Love Hate Relationship", "Author": "Someonereallyimportant", "ReviewID": "R1ZUP5OKA0XRDU", "Overall": "5.0", "Content": "I used to work at Microsoft and I can remember overhearing conversations at lunch where launch teams were laughing at how their new program was going to market with a 33% fail ratio and it was a major part of the applications that come with Windows when you get the full version.  So, basically, they considered it a success that only 1 out of 3 attempts to use this software only worked. Imagine if Boeing were to adopt that sort of thinking?  It would not be good.So, knowing this, I was skeptical about jumping into line to be one of the first to own a Microsoft Windows Phone. I had been an Android customer primarily for shear economics.  The iPhone is a polished elegant product and they have so many great apps.  The Apple product sells for so much more than, well, just about everyone else.  The Android has some phones that were better than others.  Some were real junk and others were very nicely done.My last phone was the Droid Incredible and I thought it lived up to its name really.  It never seemed to run out of memory for tons of texts, emails, and photographs.  I was pretty heavy into all of that.  My phone was an extension of me, as it is with most people these days.  I recently had to go 2 weeks without a phone.  Can you imagine?  I was constantly reaching for my Android to save the day.  I wondered how high we were in mountains, I remembered my altitude app and reached for my phone. Oops, not there.  I was at a garage sale and trying to communicate with someone from Russia.  No worries, I had this great free app that they could speak into and it would tell me aloud what they said now in English, then I could flip the settings in reverse and answer them with confidence, but not this time.  My phone was being replaced and in the mail.  We jumped in the car to go for a drive and the last couple of minutes of a great old song was playing, so I grabbed my Android to use Shazam which can listen to any song for a few seconds and then tell you the name of the song, the album, the song writer, producer, and singer.  It would tell you when it was produced and released, show you photos of the album cover, provide you with a link to the Artist's Webpage, and show you the best prices online and locally, based on the GPS info that your phone already had.  But not that day.These smart phones in general are amazing and incredible.  Can you imagine the reaction you would get a mere 100 years ago if you popped out an iphone, fully loaded with all of the best apps?  They would probably have you burned for worshiping the devil or for witchcraft.The big question has been there since it all began?  Should I buy an iPhone or an Android?  Well, we weren't even done with that huge debate and now there is a new contender in the ring.  The WINDOWS PHONE.  It hit the market with all of the pizazz of a damped firecracker on a winter day.  Microsoft should be ashamed of such a pathetic introduction to the world.  When it was first released they didn't even have a compatible install of something as basic as Instagram.  I am having Vista flashbacks, or even Windows 95.Well, it was mine and I had about 10 days to decide if I was going to keep it or send it packing back to Verizon.  The lack of applications was really painful and I wondered how long it would be before MS Got it together with their beloved updates that we all detest so much on our computers.  They are a necessary evil, but it would be nice if they got a little closer to getting it right to begin with. :)Looking beyond the app issue, I liked the feel of the phone.  The screen was large, bright, and very clear.  The software was a bit confusing since it really didn't look like anything we had ever seen on anything before.  The live tiles seemed odd at first, but after a few days, I began to get it.  I learned how to customize the screen and how to determine what is visible in all aspects of the phone's operations.  Then there was the smoking gun.  This phone had one thing that I personally hadn't had in such a long time that It frankly shocked me.  This phone had a Minimum Rated Talk Time of 900 minutes and a Minimum Rated Standby Time of  480 hours or 20 DAYS. That was it for me.  This brand new Windows Phone may not have had all of the bells and whistles just yet (apps), but it looked great, worked well, and had the most amazing battery life I had ever seen.It had a slow start, but the latest reviews are indicating that the sales have doubled in the last year alone and that Meanwhile, Apple’s iPhone lost market share in every country reported by Kantar except Australia and Spain.  I recently spoke with a Representative at Verizon who advised that the latest word from Microsoft is that they are approving approximately 100 new apps per day.  They are adding them as quickly as they can screen and approve them.  Its just a matter of time before they not only catch up, but possibly even dominate the market.  Step aside iPhone, you may have a serious fight on your hands this time.Review by Jim Bennett, Snohomish , WA", "Date": "December 23, 2013"}, {"Title": "Elegant Device With A Few Quirks", "Author": "Matthew K. Morgan", "ReviewID": "R3UJZ0FBYD2L1S", "Overall": "4.0", "Content": "I moved to a Lumia 822 Windows Phone after having had a first generation Droid for several years. I was happy with my Droid and it worked well, but after it finally started to degrade it was time to move to a new phone. I decided to try the Windows phone platform for no reason other than wanting something different, and of the options available to me I was most impressed with the Lumia 822. I wish I had made this switch a while ago...The Lumia is a larger phone than my original Droid, and I was a little apprehensive when I bought it because of this. My concern was that it would be bulky and would be cumbersome to use, but this has not been the case. It fits almost perfectly in a pants pocket and it is just the right size when in operation for comfortable talk. It is large enough to allow for talking into the actual receiver instead of relying on the way someone holds the phone which means consistent sound clarity for the person on the other end.Call quality has been great. So far I have had no issues with the ability to speak and be heard in a call. In fact, when switching between speaker phone and regular calling mode the person on the other end has said that they cannot always tell the difference. This was an unexpected bonus - most phones I have used do not work as well as speaker phones.It is important to understand that this phone does not have a standard physical QWERTY keyboard but instead has a virtual keyboard that it displays on the screen. This is becoming the norm anymore, though I personally prefer having a phone that has a physical fly-out keyboard. In use, the keyboard works fairly well though I have occasional issues with tapping the right keys as I have larger fingers which means that sometimes the phone registers the wrong button pressed. This is more the exception than the rule but it happens often enough to merit attention - if you have larger hands, be aware that typing can get a little frustrating if you're in a hurry.The greatest difficulty I have had with this phone is when using it with the car. I have a Ford Focus with full Sync system, and my Droid worked flawlessly with it. The Lumia works almost as well, though I have had the same problem many have had - when making an outbound call the system can shift into privacy mode and no one on either end hears anything. I have found that by using the phone to dial instead of using voice or the dashboard keypad the problem can be completely avoided but this is inconvenient. Recently my phone downloaded a large update and since then it seems to be working more consistently - time will tell if this has truly fixed the issue, but for now I have an acceptable workaround.Now, about Windows 8 on the phone... I am not a huge fan of Windows on the normal (non-touchscreen) computer, but on a touchscreen phone it seems like this is the way a phone should work. The Windows phone OS is very intuitive, easy to use and it just works. I love the tile-based screens. With my Droid I occasionally had issues where I somehow scrolled to a different screen and got icons messed up because of it; I have not had any issues of that kind with the Windows OS and so far am absolutely pleased. The one drawback I have with the platform is that once in a great while the phone will simply reboot without warning - never during a call (so far) but always unexpected. To be fair, I had the same problem with Android at about the same frequency, but it still needs to be mentioned.As at least one other reviewer mentioned, the number of apps in the online store is small compared to the quantity of apps in the Android or iPhone store. So far I have had no problem finding applications to suit my needs. There are more applications being added all the time but the problem is that the market share does not favor the Windows phone. The biggest targets are Android and iOS and that is where the majority of the applications are found right now.There is one application that I have been unable to find that I think is sorely needed - a reputable security suite. As I write this I have found none at all. I have looked at Norton and Kaspersky in particular for applications of this type and they do not support Windows 8 on the phone. To me, this is a big deal. There are partial solutions in the store but so far I have not found an antivirus or anything else that would be termed good mobile security. I do sincerely hope this is corrected soon. This is not a shortcoming of the phone itself; rather, it is a reflection of the Windows 8 mobile market share.The Lumia 822 is not without its quirks and issues but overall it is a very nice phone. It has a good feature set, it is easy to use and it's the right size for me. When it eventually dies, I will likely get something similar.", "Date": "May 17, 2013"}, {"Title": "excellent phone!", "Author": "I. Smith", "ReviewID": "RZG85E9HNDGUY", "Overall": "5.0", "Content": "I've owned so many phones from all OSes... And this is one of my favorite phones, hands down. Windows Phone 8 has minor, but very nice upgrades over windows phone 7. Most impressive is the hardware. I never owned a Nokia phone, but this one is really nice for the price. The quality and feel are excellent. Highly recommended.", "Date": "May 3, 2013"}, {"Title": "Excellent 4G LTE Smartphone with some limitations", "Author": "PSP Fan", "ReviewID": "R2TKJI9ST0QE9H", "Overall": "4.0", "Content": "I purchased this phone as an emergency backup phone should my primary (Samsung Galaxy Note II) ever need repair or be out of commission. I was able to pick one up off Ebay for roughly $140.00 and it was one of the better investments I have made.Before writing this review I will tell you a little about my tech experience: I've been with verizon for over 8 years, have used IOS, Android (current) and intermittently used Windows Phone Operating System. Each operating system (and ecosystem) has its advantages and disadvantages, as does the manufacturer. Let's begin with what the Nokia Lumia 822 has going for it.Pros:Build Quality-- The Nokia Lumia 822 is exceptionally well made. While thicker than most smartphones currently on the market, this phone feels surprisingly good in the hands. The weight is evenly distributed throughout the body of the phone, and all the necessary buttons (i.e. power, volume, and camera) are located on the right-side for easy one-handed use. The true black display is 4.3\" and is doing a well job of displaying color. This phone is readily viewable outdoors at 75% brightness, and the Gorilla Glass 2 glass panel is very durable (Though I would still recommend a SKINOMI TECH SKIN SCREEN PROTECTOR for added protection).Battery Life-- The Lumia comes with a 2100MHA battery. This is one of the largest OEM standard batteries a manufacturer can put in a phone right out of the box. (For instance, the original galaxy nexus on verizon only came with a 1800, with an extended that pushed 2100). Depending on your use the phone can last a solid 20hours of light-moderate use, and roughly 12-14 hours of heavy use (I define heavy use as video streaming). This is respectable battery duration and let's face it, most people will have a charger in the car, carry an external battery backup etc.Operating System: Windows Phone 8 Operating System is extremely user friendly. You are limited in personalization but that's not necessarily a bad thing. Live-tiles (which are re-sizeable) dominant the viewing screen and like with most functions, a single tap opens the desired program. Unlike other operating systems (i.e. android and IOS phones), windows phone provides you the ability to REMOVE BLOATWARE FROM YOUR DEVICE WITHOUT THE NEED OF ROOTING/JAILBREAKING. This, for me, is a huge plus as rooting a device generally voids your warranting at you run the risk of damaging (bricking) your phone.Manufacturer Support/Investment-- Nokia's suite of apps are simply AMAZING. You get Nokia Map/Drive and Nokia Go-Music. The Nokia Map/Drive is similar to Google Maps and Navigation. The Nokia Go-Music is a FREE music streaming service native on all Nokia smartphones. This app is similar to Pandora but unlike Pandora it is commercial free, you do not need to register, and you are allowed to download approximately ~250songs for offline use. Nokia customer/tech support is also one of the best.GLOBAL ROAMING/UNLOCKED-- One of the primary reasons I bought the lumia is that ALL WINDOWS PHONES FROM NOKIA ARE REGION-FREE SIM UNLOCKED. Meaning, so long as the carrier (other than verizon) produces the cell bands the phone's modem can pick up, you will be able to use the phone on that network. The Lumia 822 CAN BE USED ON T-MOBILE, ATT, ROGERS... and EVEN OVER SEAS. Verizon, a CDMA network, offers very few phones that are unlocked, let alone as capable of being used on GSM networks. So not only is this phone a good back-up phone, it's also a phone which can be used in case you want to switch carriers and don't want to sign a 2year contract/buy a new phone.Cons:Lack of Developer Investment-- The Windows Store has roughly 150,000 apps on the market, as compared to IOS and Google which have over 700,000. The list of apps also grows very slowly in Windows Store-- some of the more popular apps aren't available either.Lack of Mainstream Appeal-- The lack of personalization is a deterrent for some. The live tiles can get boring.>>List will be updated at a later date", "Date": "April 13, 2013"}, {"Title": "I wish I would have known....", "Author": "Mickey Batin", "ReviewID": "R3BJ2WVS7WP40C", "Overall": "2.0", "Content": "I have had this phone since the end of November and have had nothing but problems.  The phone always shuts off when it sits too long and reboots.  I've also experienced a problem with the volume control.  I am a customer of Verizon Wireless, and all they have done is offer a replacement and a factory reset, both of which have done nothing.  I was told by tech support that this is a known issue with this phone, but they have no clue when Nokia will be providing a system update for this phone.  I do not recommend this phone, especially if you don't have time to sit around and wait for Nokia to fix the issues or to make several calls to Verizon Wireless Customer Care as they provide ZERO service for these issues.", "Date": "February 3, 2013"}, {"Title": "Best phone I've ever had", "Author": "sparkshaha", "ReviewID": "RA1THNGXL9I34", "Overall": "5.0", "Content": "I've had android phones, blackberry phones, and others.  The Nokia 822 is by far my favorite.  I've never had an issue with this phone and I've had it for about 9 months now.  The Windows Phone platform is really cool as far as I'm concerned, and the apps available cover a lot of bases.  Do they have as many apps as Android or Iphone?  No.  Do I care?  No.  The fact is there is an app for everything I need and want, and there are more being released all the time.  The user experience on this phone is so good, my two daughters (ages 15 and 12) both wanted this phone, so they each have one now.  They are the only ones in their circle of friends that have a Windows phone.  Do they care?  No.  I think I taught them well.  'Nuff said.  Highly recommended!", "Date": "August 17, 2013"}, {"Title": "Great phone, perfect size", "Author": "A. massena", "ReviewID": "R2V4T9U1ADL1ZF", "Overall": "5.0", "Content": "I had a windows phone with at&t; for about 18 mos.  When I moved to Utah the at&t; signal was so bad I ended up going to Verizon.  When I went to Verizon last summer they had one windows phone which did not seem very good so I bought a Samsung S3.  The Samsung is a really solid phone and I like it...However I missed my windows phone so I purchased an 822 on Ebay.  I have been using the phone for the past 3 months.  I personally like the 822 much better than the S3 because..The 822 is a bit smaller and it is easier to hold.I get much better battery lifeWindows phones are infinitely easier to use.I prefer one long page to 5 pages.Fits in my pocket better.I have 4 emails and I can set icons for each on the screenI love the new small/large icon setup.I love the history tab on each contact.  I hate having to dig up emails from months ago..flip to the person who sent it and go to history and there it is.You cannot go wrong with either the S3 or the 822. It all comes down to personal preference.  One thing I love about Verizon is that you just pop out your sim card and put it in your other phone and your good.  You could not do that at at&t; when I was with them.  I did try my S3 a week ago just to see how the experience was....I was back to my 822 in a few days.", "Date": "May 15, 2013"}, {"Title": "Awesome Phone", "Author": "W. Dillon", "ReviewID": "R3NEDYTKDM0RDK", "Overall": "5.0", "Content": "The 822 is overall a solid phone. The screen looks great, and while it's not as high of a resolution as some other phones are, it still looks excellent, and video looks really good on it. Call quality is good. The speaker for music isn't that great, but it gets the job done. The phone is built well, and it's survived a few drops. I love the fact that it has a microSD card slot and a removable battery. I have a 64GB card in it with plenty of videos and music on it. Currently you cannot have apps on the microSD, which is a bummer, but not a huge deal.As far as the OS, WP8 is awesome. It's beautiful, super fast, and has a lot of cool things built in. It is currently missing some features, but it is expected that Microsoft will add many wanted features with future updates. The live tiles are awesome, I couldn't imagine a phone without them now. The one thing I do miss is the ability to sync with Zune (WP7 had this ability), which, in my opinion, is the best syncing software out there. Hopefully Microsoft will add the ability back as many people have cried out for its return.So overall the phone is great. I do recommend it, but do know that there aren't as many apps as iOS or Android, though they are getting there, and most popular apps are already available.", "Date": "March 6, 2013"}, {"Title": "Just a great phone!", "Author": "Sierra Sam", "ReviewID": "R2CELF3Z7WTRSF", "Overall": "5.0", "Content": "I switched from an ancient iPhone and could not be more pleased.  I was a little unsure the first couple days if I had made the right choice, but I did.  I actually use my phone as a phone and I have a hearing impairment.  Sound is very good and is this thing ever fast.Only drawbacks I can see is I wish the speakerphone was better and that the battery lasted longer.Try it, you may like it.  Mine was particularly appealing as it was free through Best Buy matching WalMart.Update 12/12/12-I really like this phone but the battery just does not cut it.  I have everything turned off and it still drains like crazy.  I am running a WPBench test on it now and may try and exchange it tomorrow.  On my old iPhone 3G with my normal usage it would go 3-4 days.  At best, the 822 will go one day.  I am hoping this is a defective phone/battery.", "Date": "December 5, 2012"}, {"Title": "i have had the phone for over a year.", "Author": "Constantino Soria Jr", "ReviewID": "R3BAYHAEIFRZG", "Overall": "5.0", "Content": "The phone itself is great. I don't have to reboot because of slowness or lockup. The Battery last long with minor setting changes. Nokia does a great job in creating apps for WP8. In general lack of apps does suck but over this past year I have seen great improvement in apps and in OS updates which improve the phone while not slowing it down. The built is solid over the past year I have drop my phone plenty of time and the screen never cracked or has any scratches. The sides have minor scratches but the screen is what matters.OS is improving, One Note, Office apps and mailbox are great.Bulit is durableSpeed is awesome regardless of how many apps you have installed or updating the OS.Size is ideal it isn't the biggest screen nor the smallest but it is the great.Camera is average but the Nokia apps help it a ton.The fact that it is a verizon and nokia phone helps it out for service and nokia apps", "Date": "January 14, 2014"}, {"Title": "Very pleased with the Lumia 822 phone!!!", "Author": "Mr Bill", "ReviewID": "R11MV45W2CUDOJ", "Overall": "4.0", "Content": "I wanted a Windows 8 phone, especially after working with my wife's Apple 4s. It's a toy, my opinion.  I wanted a smartphone  that would work with real world applications and hardware.  The interface took some time to master, but it is very versatile.The camera takes get pictures and with the new lens apps they are look professional. There are plenty apps to do whatever someone would need to do.", "Date": "December 28, 2013"}, {"Title": "Nokia Phone", "Author": "pjc", "ReviewID": "R1BMVCZKF08GDY", "Overall": "5.0", "Content": "I received my phone on time and the phone was exactly what I wanted.  It has preformed perfectly.  I am very happy with my overall experience.", "Date": "December 1, 2013"}, {"Title": "A real review from a real person", "Author": "Chris", "ReviewID": "R1HCCJZ22G0MNK", "Overall": "1.0", "Content": "This phone is absolute junk. From the first day I got it from Verizon I've had NOTHING but problems. I've had androids that were better than this useless phone. You would think that if the two greatest tech companies in the world (Nokia and Microsoft) teamed up to make a phone, it would be something of top quality but this isn't the case unfortunately. I've had so many issues with this phone that I had to call Verizon to get a new one..and the new one was EXACTLY the same..im not even going to waste my time calling them again because im so done with verizon and im done with windows phones. These phones are like this straight from the factory because of improper testing by Microsoft, improper testing by Nokia and worst of all...verizon for not intervening when its in their best interest to provide their customers with good phones..because after all....its a telecom company..thats what they do. I am dissapointed with these reviews as well..either they're fake or people just dont know how to review a product or what a review even is. You're supposed to evaluate a product thoroughly before judging it. Everything seems nice when its new but when you have it for more than a year like me then you begin to see why it deserves one single star and nothing more. I came to windows from several androids because I got tired of all the bugs and unreliability that android devices have..also the fact that the phone looked incredibly gorgeous in the store and on YouTube. I can now say this is probably the worst operating system out of all 3 (android, apple, msoft) For crying out loud they dont even have proper apps like a fully functioning browser, a non browser based YouTube app that actually works, a chat app not even a proper video chat app. Everything is garbage..- phone shuts off at random times once a week- the microphone doesn't function when pressed against your ear and no one can hear you..because for some odd reason the mic is at the earpeace- the back cover is paper thin and the phone is hard to assemble if you need to take the sim out or access the battery compartment- GPS is literally useless unless you want to be taken to a random location you didn't ask for ( happened to me a lot of times) unfortunately nokia thought it was a good idea to block their customers from using the only functioning maps app available..which is google maps..because they have a stupid partnership with windows..so now I have to use a map app that doesn't work- Browser closes by itself..the back button doesn't take you back to the last page you've visited- phone has problems loading images in the browser- problems loading webpages- silent mode isn't silent mode at all, its vibrate mode, loud mode doesn't have the option to turn off vibration- apps close by themselves daily- phone locks up for a few seconds at a time- the app store has probably 1/10th the amount of apps that android does- contact transfer to windows live doesn't work (I've lost so many numbers after I got a replacement for this phone from Verizon- after turning flash off on the camera phone the flash still flashes- highlighting individual words isn't accurate..the phone highlights the complete sentence instead- messages sometimes dont get through- Bing sucks- battery life is really bad- the phone wasn't properly tested- this is my last windows phoneOn a positive note the phone is extremely rugged. You can probably drop this phone from the first floor of a building and it will still work.This phone is a mess stay away", "Date": "December 17, 2013"}, {"Title": "Slightly Disappointing", "Author": "Wilson", "ReviewID": "RL29U9R2O5P0G", "Overall": "3.0", "Content": "As someone who is very into Andriod, I decided to go out on a limb and try out the Windows OS. I have had this phone for about a year now. I am not going to lie, I am pretty disappointed by the phone and the operating system. but it works alright for what it is.PHONE:I have issues once or twice a week where the phone will shut off unexpectedly. After consistently happening for this long, I was hoping a software update would help fix the issue but it clearly has not. This leads me to believe it is a hardware issue, but the people at Verizon keep telling me it's a software issue and the next update would fix it.As far as durability, this phone is an absolute tank. I have yet to put a case on my phone (living dangerously) and I have dropped it a handful of times. There are some scratches on the corners of the plastic housing, but the screen is in perfect condition.The response time has it's ups and downs. Some times it will be lightning fast, some times it will lag a few seconds. I am always careful to kill all my tasks too.WINDOWS 8 OS:This OS looks sweet. I love the minimalistic layout and the customizability it has. In terms of function, it's kind of limited. Nokia has put out a bunch of really cool apps, like city lens and panorama. The GPS system it comes with is absolutely amazing. It beats all of my friends iPhones and Androids to crap. I would argue it rivals a legitimate GPS system for your car. But in actuality I don't use all of the stock apps to much.The live tile idea is awesome, but it rarely works how it should. They don't load properly until you open the apps, then they will update, which kind of defeats their purpose. The ideas they have going into the OS is great, but they need some optimization.App development is leagues behind Apple and Android. If you're someone who likes a lot of apps, you're going to have to rely on a bunch of 3rd party software. If you're okay with that than go ahead, but I prefer to go with the big developers. It seems like no one really makes quality apps for it. Give it a couple years, i bet it will be fine, but until then I am not going to rave about app availability.OVERALL:I will not be getting another windows phone. I would not really recommend it to anyone else unless you're more business oriented. As a college student I find Android and Apple will better suit my desires. It's not well enough developed for me to really get into it. It was well worth the try, but it's not for me.", "Date": "July 8, 2013"}, {"Title": "Quick shipping.", "Author": "polska blondynka", "ReviewID": "RI2444ASL26N9", "Overall": "4.0", "Content": "This is a great Windows phone I bought for my brother, although it kept turning off on its own. We are switching to a different phone.", "Date": "July 3, 2013"}, {"Title": "Great phone", "Author": "Pamela Miller", "ReviewID": "R5PNJ1R4UPHMD", "Overall": "5.0", "Content": "I am still getting to know what this phone is capable of doing, but so far I love it!!  I really like the ease of the keyboard.  I love the large captions at the top. It is pretty easy to transition into after using a droid for 3 years!!", "Date": "June 18, 2013"}, {"Title": "Unreliable phone shuts off randomly and doesn't power back on", "Author": "Idsfa", "ReviewID": "R31V7Z54O1WLC0", "Overall": "4.0", "Content": "Update 9/22/13: I am on my 4th Lumia 822 and it works perfectly. Not sure if it's because it's a different phone, or if they fixed the underlying issue, but I am now a happy camper!Old review: DON'T buy this phone if you need your phone to stay on. I bought the Nokia Lumia 822 after having another Nokia phone for about 7 years. It was durable and easy to use, and I never had any problems with it. But I've had problems with the 822 since day 1. It randomly shuts itself off and stays off. The first time it happened, I was late for work because the alarm doesn't work if the phone is off. This happens every 2 nights or so. It also happens during the day. One time, it shut off 3 times within a couple of hours. I couldn't power the phone back on except by taking the back off, removing the battery, counting to 10, and then putting the battery back in. Yesterday, I learned that you can also hold the \"volume down\" button at the same time you hold the power button, and you have to hold them both until it powers back on, about 12 seconds. Better than taking the battery out, because when you remove the back of the phone, sometimes several times a day, the back gets loose. I reported the problem immediately to Verizon, and they told me to keep the phone because they were expecting a software update by the end of the following month that would fix it. So I kept it, but when the next month went by and the phone was still not working, I called back to ask what had happened. They said this is a known issue, and they didn't know when it would be fixed. So I asked them to send me a new phone and they agreed to do so, but it was only when we talked about it some more that I found out they were sending me a refurbished phone. I explained that I reported the problem within the 14 day time limit, so I expected a new phone. They said it didn't matter, all they could send me was a refurbished phone. When I got the refurbished \"phone\", they only sent the front half of the phone. You have to use the old battery, SIM card, and phone back. On this phone, we couldn't even get it set up because of error messages, so I returned that the next day. I'm on my third phone now, and it also shuts off. I powered it on for the first time yesterday around noon, and it shut off by 2:00 PM. It shut off last night during the late evening hours, and it shut off again during the night.My recommendations:1) don't buy this phone,2) if you get a phone with a problem and Verizon tells you a software update will fix it soon, don't believe them, and3) if you have ANY problems with a new phone, don't let them talk you into keeping it - return it ASAP and get a new one.", "Date": "August 4, 2013"}, {"Title": "Verizon Lumia 822. Trouble! Don't buy this phone!", "Author": "lacelgca", "ReviewID": "R3MCHX9OU3FVV5", "Overall": "1.0", "Content": "I just purchased this phone about a month ago and it has been nothing but trouble. Now I am having to pull the battery several times a day and reinsert it in order to get it to boot up. It shuts all the way down by itself and won't power up without pulling and reinserting the battery. I called Verizon on it and they told me that they are having this problems on lots of the Lumia 822s and there is supposed to be a software fix coming but they cannot/won't tell me when.Anyone else having this problem?", "Date": "July 8, 2013"}, {"Title": "3 strikes = out", "Author": "Shorthair \"shorthair\"", "ReviewID": "RTJB4J1ZMWVFI", "Overall": "1.0", "Content": "I bought this phone from another provider & exchanged it the first week due to the camera quit working. Enter the second one where the camera worked for 2 1/2 weeks before failing, so Verizon exchanged it again & the third one failed after 10 days for the same problem camera quit. I spoke to tech for about 25 minutes & they confirmed that the camera was a known & well documented problem & reluctantly agreed to replace it with a upgraded phone.", "Date": "July 27, 2013"}, {"Title": "Cute Phone but Not Ready for Prime Time", "Author": "Gretchen Kromer", "ReviewID": "R182ET9KO9RS42", "Overall": "2.0", "Content": "My 3-year-old XV6800 smart phone was working fine but so obsolete that I couldn't use Wi-Fi in some locations, so it was time for a change.  I spent several months considering my options and settled on the Nokia Windows 8 phone, partly because I'm a Windows user and partly because of the extra-good camera.  Over the next two weeks I had a lot of problems with it, mostly software-related, so I traded it in for an Android.Whenever I get a new piece of equipment, I like to start off with the user guide in front of me so I can survey the features and be sure I understand how everything works.  The introductory booklet said I could get a user guide by downloading it or by calling Nokia or Verizon .  The guide was full of graphics and fancy fonts and choked up my printer so I called first Nokia and then Verizon.  Both said that they would not send me a user guide.  An obliging Verizon store rep finally printed one for me.I connected the phone to my Windows 7 laptop.  It found the phone and gave me a link to download the necessary software.  I downloaded it and tried to install it but got the following error message:\"Windows Phone requires Net framework 4.0.  Please install from '[...]\"No actual link was given and the address didn't work but I managed to find the necessary page and downloaded the software.  After that the laptop recognized the phone but I was not able to set up playlists using either Windows Media Player or Zune and finally gave up on that.  I haven't taken the time to tackle this issue on the Android.  I'm still using my old phone to play music at the gym.  When I tried to get help from Nokia and Verizon they didn't seem to know what to do either.  If manufacturers of hospital equipment or kitchen appliances treated their customers this way there would be lawsuits; why do we tolerate this sort of behavior in the case of tech companies?The front screen of the Nokia phone with the flipping tiles was very cute and I loved being able to make a little mini version of my blog page there but these features were not enough to compensate for the hassles.  Also, after the withering review by Walter Mossberg in today's Wall Street Journal, I won't be upgrading to Windows 8 anytime soon.", "Date": "January 9, 2013"}, {"Title": "Don't buy to use in GSM network Or better avoid Verizon WP8 phones...", "Author": "P. Jain", "ReviewID": "RWK7RRZ5QTAVJ", "Overall": "2.0", "Content": "Although it works it Verizon network, they are altered the WP8 OS in such in way that it's GSM capability cannot be used.It disallows these in GSM mode-Changing APN-Sending SMS (group sms also)(For now, you can downgrade OS to pre portico update & enable these features)Nokia Customer care has said, based on Verizon request, they have disabled these features. And same they will do in upcoming WP8 phones.Verizon said they can restrict customers in whatever way they want.Verizon greed !!Note Microsoft customer care said they will not do anything in this case despite the fact they claim they will control the updates, features in OS", "Date": "May 19, 2013"}, {"Title": "Nice features are pointless if the battery doesn't last!", "Author": "brenda", "ReviewID": "R3I6MOCUCWSY5H", "Overall": "1.0", "Content": "I read all the reviews and was excited to purchase this phone for my daughter for use on the Verizon 4GLTE Network, normally 3 bars of 4G reception.  After 2 weeks we sent it back due to poor battery consumption and exchanged it for a Motorola Razr M.All the nice features and functions are of little use if you have to continually charge the battery even when the phone is barely used and the applications are turned off.  Very disappointed in the Nokia 822.  My fault for not doing better research and finding the Nokia site with the long list of negative customer feedback about poor battery consumption and the lame excuses and fixes offered up by Nokia such as disabling desirable applications.After 1 week with the Motorola Razr M, my daughter couldn't be more pleased and has none of the battery consumption issues previously experienced with the Nokia 822.Amazon Wireless made the exchange process very easy, however, we did have to pay full price for the RAZR M and Amazon Wireless had it overnighted to us and also picked up the tab for returning the Nokia.  Upon return of the Nokia, we were credited for the cost of the RAZR M.  Thanks Amazon Wireless!", "Date": "February 8, 2013"}, {"Title": "Too soon to buy", "Author": "Bullmoosie", "ReviewID": "R1PJSH79ZJ3QBH", "Overall": "2.0", "Content": "First of all, I'm not an experienced smart phone user. I have to say the phone is fairly easy to learn and has great features.  Unfortunately, after only 5 weeks I dropped the phone and it cracked the glass.  I can still use it, but, and here is my problem, there are no parts readily available to get it fixed. Both Nokia and Verizon were unable to help except to direct me to a single repair shop (not local) which would take 5 to 10 days, (not including shipping time) to have fixed.  If I could do this over again, I would avoid a phone that isn't this new on the market, especially for someone who needs their phone and can't be without it for 2 weeks.", "Date": "February 7, 2013"}, {"Title": "Could be 5 Stars if Verizon didn't Alter the OS to Charge for Visual Voicemail", "Author": "P. Carlson", "ReviewID": "RWFZ9J6AGCCPR", "Overall": "1.0", "Content": "WARNING Verizon has altered Windows Phone 8 and requires you to pay $2.99/month for Visual Voicemail. This ends up being a hidden penalty of $71.76 over the two year contract per phone.I have had windows phones on AT&T; and T-Mobile and neither charge for Visual Voicemail. If AT&T; or T-Mobile coverage is good in your area, I would highly recommend going with them instead of Verizon who alters the phone operating system to stick you with hidden costs.I have two Lumia 822 phones, and enabling Visual Voicemail will cost me $143.52 extra compared to T-Mobile or AT&T.; When purchasing the phones I asked the store sales person about Visual Voicemail and he indicated it was free. I called support once I found out it costs and they were of no help.Shame on Verizon, perhaps I should have stuck with AT&T; and my Lumia 920. The Lumia 920 was an awesome phone, the only issue was I had poor LTE service at my house.", "Date": "March 9, 2013"}, {"Title": "Defective Lumina 822 and My Experience with Nokia", "Author": "Nakinc", "ReviewID": "REMA9CO9VF1MP", "Overall": "1.0", "Content": "I love Windows 8, I like this phone, I owned it for less than 24 Hrs when it slipped between my bed and its foot board, as I went to retrieve it, it fell less than 1 foot to the floor and cracked the glass from one side to the other. Not a scratch visible on the phone or a cracked place on the glass. I contacted Nokia customer service and they refused to do anything about it except to tell me to call their service center, since this phone has Gorilla glass, a gentleman commented on my review and advised me of the same, I am now convinced that this phone was defective from the factory,  repair will be 143.00. this is un- acceptable , My previous phone was a Galaxy and I dropped it at least a dozen times over the 3 years I owned it, no broken glass ever. I understand glass breaks, Think twice before you buy this phone unless you never drop your phone (LOL). Oh by the way you cannot just replace the glass itself it requires the entire  Display unit as it is all one unit so expect to pay big bucks to replace broken glass, Verizon offered this phone for 50 bucks /2year contract, now I understand why. I have to say otherwise it is a great phone but companies must back their products or lose their customers. I have insurance on the phone they will replace for 99.00 which I appreciate but this is really a Nokia Problem and I will never buy another Nokia product because of this.", "Date": "December 5, 2012"}, {"Title": "Ford SYNC", "Author": "Amazon Customer", "ReviewID": "R3FDO6TH5IN2VK", "Overall": "1.0", "Content": "Piece of crap phone. I had gotten a new car a brand new 2013 Ford Focus ST and it has issues getting connected to my car. The damn thing ended up freezing up my main computer in my car and it had to have a master reset done to it. I am switching to a Motorola Droid 2 the last motorola phone I had lasted 2 years....go RAZR. DONT GET THIS PRODUCT EVER EVEN THOUGH IT IS CHEAP IT ISN'T WORTH IT.", "Date": "March 17, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Nokia Lumia 822, Black (Verizon Wireless)", "ImgURL": "NULL", "ProductID": "B00A7F57EM"}}