{"Reviews": [{"Title": "Great Phone! (I have the US version)", "Author": "Tim", "ReviewID": "R3TJC1G3BBMLGP", "Overall": "5.0", "Content": "I will start off by cutting to the chase. If you are looking for a new phone, this is a great phone. I highly recommend it.Now, lets get to the reasons why I love this phone.First of all, the screen on this phone is amazing. I recently switched from an iPhone, and I have to say, I was very nervous about moving to a new device that didn't have a \"retina\" display. However, all nerves went out the window when I held this phone in my hand the first time. The screen packs more pixels per inch than the iPhone and is very true to color, offering a phenomenal viewing experience. The screen on any new phone is the biggest decision point, and HTC does not disappoint; this screen is simply gorgeous.After you get past the screen, the overall design of the phone is striking. I love the black on black design (again, I have the US version), and this is the first phone I have been excited about getting in black. (I actually prefer the black on black to the international black and red, but that is purely personal preference.) The screen melts into the unibody design, and the body of the phone is covered in a matte black finish that has the perfect amount of grip to it. The phone feels as solid as any phone I have ever used.Beyond the exterior of the phone, there are man features worth mentioning. First, the camera is great. HTC has loaded this phone with one of the best cameras I have ever used on a cell phone. There is a dedicated image chip inside the phone that allows the phone to process images unlike any of the competition. As if taking great pictures is not enough, you can also take full HD video, and snap photos while filming. Even when watching your video later, you can snap a picture during playback. What a great feature! The camera can also be placed in \"sight seeing\" mode, allowing the user to bypass the OS and go straight to the camera when unlocking the phone. This is one of the many features added to the Android experience by HTC with their Sense 4+ overlay.Alright, that provides a perfect transition to the geeky stuff. The sense 4+ overlay is not bulky, and actually adds some useful features. I would still prefer vanilla Android, but this overlay is very tolerable and does not get in the way too much. The One X+ features Jelly Bean out of the box,  which is an awesome OS, and it is the main reason I switch to Android from iOS. Additionally, the One X+ is running on a quad-core Tegra 3 processor, with 1 GB of RAM and 64 GB of storage. In other words, this phone can handle all you can throw at it.Now on to the dislikes.One complaint and concern I have read about is the protruding camera. The back of the phone has a curve to it, which keeps the camera from sitting directly on the surface you have placed it on, and the camera housing feels like it is made out of a metallic material adding further durability. This has dampened my concern, but I have seen others with the original One X put a case on the phone specifically related to this concern. I am currently not utilizing a case, but there are many options available, and all One X cases do fit the One X+ because the body is the same exact dimensions.(Most of this section will only affect people buying the AT&T; version in the US)Also, AT&T; and HTC have thrown some bloatware on the divice, but most of it can be disabled through the settings, and with 64 GB of storage, the concern is further alleviated. I am a little ticked off that AT&T; continues to block the free 25 GB Dropbox account (Verizon does this too, FYI). AT&T; encourages you to use their \"Locker\" service as an alternative, which does not work and is a waste of time. I was primarily concerned with using Dropbox to back up my photos, and have since discovered that signing up for Google+ will instantly get you a free backup of all photos and video you take with the phone through their \"intant upload\" service. I even had photos from my iPhone on there.", "Date": "November 26, 2012"}, {"Title": "Simply Awesome", "Author": "Amazon Customer", "ReviewID": "RET5HL0N5JFKV", "Overall": "5.0", "Content": "This review is for the HTC ONE X+ International Version (not for the HTC One X+ ATT version).The phone is just plain awesome!!!  If you're thinking about an Android, this is the ONE. Miles better than the SG3 or Nexus  (in fact much better than the IP5 in my opinion).I bought mine via Amazon in early DEC, 2012, from eXpansys Inc..  The phone arrived within 2 days and it was exactly what I expected:  an unlocked HTC One X+ with Quad 1.7GHz Tegra3 processor, 1 MB Ram, 64GB internal storage. (It looks like mine was made for the UK, but it seems to work just fine in the US via AT&T.;  No LTE, but HSPDA is plenty fast for me on everything including flawless video streaming. Additionally I travel a lot and the added compatibility with ... pretty much everywhere, is important to me.)One thing I did not expect is that it uses a micro-SIM, so if you have a full size SIM you'll have to get it cut (ATT store nearby did that free for me).The phone is incredibly fast! Not one hesitation in any of the 50+ apps I have loaded on it thus far.  Plenty of memory built in (1MB RAM + 64GB storage).  Currently running 43 apps simultaneously, memory is at 87%, everything working smoothly.The sound is nice and clear, both via the ear piece and via the built in speaker (which sounds a lot louder and more \"hi-fi\" than I expected).The display is crystal clear, easily viewable from every angle and easy on the eyes as well. HTC's Sense UI makes it a pleasure to use android and let's you customize your phone to your lifestyle, right out of the box.The 8 megapixel camera may not be the highest resolution available on the market, but it certainly takes the highest quality pictures I have ever seen (and that includes the 5th version of a certain over-hyped fruit-named phone). I compared photo quality (focus, color aberration, etc.) to my excellent 16MP Lumix with a Leica lens and I can hardly tell the difference. It does all that the SG3 or the IP5 cameras can do, but it does it better and faster.There has been a lot of chatter about the battery life and I have to say that I was very nervous about this.  I was wrong to worry.  The 2100mAh battery is perfect for this phone.  Let's put it this way: with continuous WiFi and heavy usage (downloading apps, sync via WiFi, lots of calls and moderate streaming) I get ... are you ready? ... 13 hours 29 minutes! It looks like HTC has done some major work to improve battery life and it shows. There is a \"Optimize battery usage\" option (checked by default) under Settings, which seems to make all the difference.I wanted to do a Pros vs Cons type review, but I simply have nothing bad to say about this phone. IMHO, it's simply the best phone on the market at this moment, and HTC deserves some serious credit here.  Would not be surprised at all if this ends up being named best smartphone of 2012.", "Date": "December 11, 2012"}, {"Title": "Hands up for this rival", "Author": "Germis Muñoz", "ReviewID": "R1P53X0EVMWKMK", "Overall": "5.0", "Content": "First of All, for those customers who are wondering if this is the + version, YES, THIS IS THE HTC ONE X + with 64 gb of storage plus a 25 more gb with a dropbox account for 2 years. it comes fully unlocked for any GSM carrier in the world, BEWARE IT USES A MICRO SIM.Now, my opinion:I live in venezuela and this was my first visit to amazon, i bought this amazing device to eXpansys and after a couples of weeks (due to internal issues of my country) i got my phone. People, seriously, this phone is just gorgeus and i thought S3 was it. i know s3 owners (here in Venezuela s3 is like iPhone for USA) who admire my phone. the HTC Sense layer fits amazingly perfect with android 4.1 (jelly bean) the filters for the pictures, the screen, the way how tegra makes games more perfect is just mind blowing. I decided to go for this little beast since i heard that s3 where facing sudden death issues, so i did not wanted to wake up one day and see almost 600$ \"dead\". yeah i know there is an update for that, but i did not wanted to risk. so, if you do not care about not having an SD slot (honestly i dont think you are going to need it) and a non removable battery you can go for this baby. battery life is average, all depends on your use, i watch videos, play for a while and also surf the web a lot and i make it to the end of the day with some charge. sometimes because of the size of the processor and gpu (45 nm i think) you can feel it gets a little hot, something that happens in any phone. overall this is a great phone, i do not regret of the choice i made, you have nothing to look for in a s3 that this phone does not have. if you are wondering if this phone turns off when you close your eyes let me tell you that the power buttons does that job pretty well.", "Date": "February 18, 2013"}, {"Title": "awesome phone", "Author": "avvi", "ReviewID": "RN66AWVWNXTN9", "Overall": "5.0", "Content": "I replaced my aging HTC desire hd with this phone.Out of the box:The photos don't do this phone justice, it is sleek , elegant and manufactured to the highest quality. It is also really light, especially compared to my old phone.  It also feels good in your handSetup:I ran through the setup wizard and had my Google, HTC , corporate exchange  and other accounts setup in minutes. One quirk,  being international version, there is no US English to choose in setup.Performance:The 1.7 ghz quad core makes its presence known, with amazing performance and no lag at all. Its really a pleasure to experience such a fast phone.Screen:The display is first rate, rich color and sharp as a razor.Network:This is the international version, and I was concerned about getting hspa download speeds. I put a t-mobile micro sim in and tested their '4G' speeds, I got a range from 2.5 mb /s to over 10. Average is about 3.5 here in Atlanta. Good enough for me!Overall:This is by far the best phone I ever owned and it certainly owns the Android pack and imho iPhone too. if you want the best grab this phone.", "Date": "January 19, 2013"}, {"Title": "Huge UpGrade", "Author": "ONE X PLUS", "ReviewID": "RUP81RAUB9NQZ", "Overall": "5.0", "Content": "I own this One X PLus international just sold my international s3 for this and im not regretting. Battery life is very good i honestly am getting better battery results with it than the s3 which i had. The screen is perfect no doubt the amplified speaker is just great and better than the original one x and the s3 IMO. If you are looking for a new phone with jelly bean and you got the money to spend i would definitely recommend this pretty handset with this superb looking design and great feeling in the hand. This phone makes u feel like you're a millionaire just the looks of it just wonderful. The sense UI and the whites the way the page splits between when ure done scrolling to the end that's just really innovative and unique. One more thing its very fast with opening apps very noticeable. Only down side i wish the multitask was the same as stock but i am ok with will never prevent me from getting this phone", "Date": "December 3, 2012"}, {"Title": "First purchase", "Author": "Mohamed Abdul Faththah", "ReviewID": "R1GRIN8N48HIRG", "Overall": "5.0", "Content": "This is my First Purchase ever in Amazon, Anyway the best phone I've seen that Time. Still I Really love the Body of this phone.Awesome Seller, Happy Customer. Satisfied Very much. :)", "Date": "March 31, 2014"}, {"Title": "The best phone....", "Author": "Oliver E. Arria Z", "ReviewID": "R1VESUWEZOA0D4", "Overall": "5.0", "Content": "I'm very gald with this one. The screen is amazing, is fast and agile... The beats sound is just perfect, although, I'd like it has a customizable EQ. The rear cam is just as they describe, but I think they could put in the phone a better front cam... Sense 4+ is the best stock launcher for me... And waiting for sense 5...Just Love it.", "Date": "August 12, 2013"}, {"Title": "Great Phone", "Author": "MISRA, Canada", "ReviewID": "R2OYTVEVR7TW90", "Overall": "5.0", "Content": "I have to see it to believe. Nice phone,fast response, good price and good features. Its Unlocked as I wanted.", "Date": "June 29, 2013"}, {"Title": "great!", "Author": "Renee", "ReviewID": "RKST2QY67XF06", "Overall": "5.0", "Content": "great phone! i bought it for my brother and he loves it. I had no issues with the phone. It works perfectly fine", "Date": "May 2, 2013"}, {"Title": "Just what I need it", "Author": "yury takayama", "ReviewID": "R3SUVU4JKBVFX", "Overall": "5.0", "Content": "so far it is the best cell i ever had. I purchease this cell for the sound and it is excellent I totally recomended.", "Date": "March 24, 2013"}, {"Title": "i love it", "Author": "Hennio J. Medina P", "ReviewID": "R2LW5G2T9EZL00", "Overall": "5.0", "Content": "Really this is the maximum team, one of the best teams in the world. have enough power in your processor and best of all, your own brand processor Tegra 3", "Date": "March 22, 2013"}, {"Title": "Very good", "Author": "juan Carlos Surmay Garcia", "ReviewID": "R1TEVWCIKDV1AS", "Overall": "5.0", "Content": "Ya hace un tiempo que lo compre y hasta ahora todo ha funcionado perfecto no tengo quejas de el, mi esposa tiene el one x de 1.5 y también le funciona a la perfección los recomiendo completamente.", "Date": "March 18, 2013"}, {"Title": "just perfect for my", "Author": "Jonathan Villarreal", "ReviewID": "R24VP9MP8RTL50", "Overall": "5.0", "Content": "Perfect size, perfect design, perfetc weight, un very pleased with this phone, 64 gb plus 25 dropbox its a lot even for the most exigent, with stock rom the battery life its not so good, but i install Android hd revolution a now my phone last a full day, possibly more, the seller send an adapter for the Wall charger for free, anyway i recomend this phone over the galaxy s3 its fluid enough and stilish enoug", "Date": "March 3, 2013"}, {"Title": "SLEEK", "Author": "pauley", "ReviewID": "R34KJCYSBB9KAK", "Overall": "5.0", "Content": "Man, this phone is fast/quick at the touch,super L.C.D ,very clean,perfect design to fit in the palm of your hand comfortable,solid built quility,with rich deeep black all round,unlike the paper back on the galaxys3. WELL done H.T.C BIG UPGRADE, (your ahead of the game in my world)  pauley", "Date": "February 14, 2013"}, {"Title": "Excellent", "Author": "Romulus F.", "ReviewID": "R2VABCO6KF0GNS", "Overall": "5.0", "Content": "I bought this for use in Europe, where I am a student and need a sim capable phone.  The company that sold it and the phone itself are incredible.  I think someone commented earlier that it came from England, I believe they're right because mine also came with a British prong plug, however, a converter is included so it's useable in N. America as well.  The speed is spectacular, the camera is excellent (even in poorly illuminated areas).  To give you an idea, I placed a clear screen protector on the phone and my friend couldn't even tell.  It is pricey, but you'll be very happy for a long time.  It's top of the line, it's fast, I doubt you'll ever need more than 64 gb of memory.  It is microsim, but any phone repair shop can cut it for $5.  The screen is definitely cleaner and clearer than the Samsung S3.  There was one glitch, which happened during an update.  While updating it lost connection to the internet and it got blocked in what I thought was the infamous \"airplane mode\" (google it).  However, it was merely a coincidence, I reinstalled Jelly Bean and it runs beautifully.  It's definitely for people with bigger hands, I'm 6'2 and the phone looks normal in my hands, while for other people it's \"huge\".  Also, the audio is excellent, I tested it with beats headphones and it's...it sounds multidimensional, very crisp and clear.  The ear buds you get with it are nothing special, but if you have beats headphones, it's definitely worth it.  Definitely love this phone, highly recommend.", "Date": "January 31, 2013"}, {"Title": "The Best smartphone...", "Author": "José Miguel Figueroa", "ReviewID": "R3D8XRMZ6X842T", "Overall": "5.0", "Content": "I was the HTC sensation, but this smartphone works pretty fast. I don't have any problem with the daily use.I love it,", "Date": "January 30, 2013"}, {"Title": "amazing phone", "Author": "kpavio", "ReviewID": "R2ICBWVI71KFD7", "Overall": "5.0", "Content": "I love this phone.it's powerful as beautiful.I recommend this phone because the price is affordable for the capacity of his storage and the battery life", "Date": "December 30, 2012"}, {"Title": "Best Phone Currently on the Market", "Author": "P. Strickland \"Tech Man\"", "ReviewID": "R3VFCX0Y1CNGJS", "Overall": "5.0", "Content": "Simply the best phone I have owned to date. I'm one of those crazy people that need the newest and best of everything. I tried the iPhone 5...disappointed again that it ready was not a grand leap from the 4. S3, bought when it first came out internationally for my trip to Italy. The S3 is a killer phone, took great pictures, fit nice in the pocket, great for movies etc. One down side to me was the placement of the on / off button on the side. Really a problem when taking pictures especially when letting others take photos. I did crack the screen once. So why do I like the HTC one x+ better.1. Overall feel of the phone is better.2. When all my setting are set the battery life is better.3. 64G storage standard. No SD slot used to be a deciding factor to me and I would put an extra 64g in my galaxy and I never used it. With the box or dropbox and instant HD photo uploads to google plus I find the 64G internal storage to be plentiful.4. this phone is very snappy.5. Perfect size for my huge hands. (I found the Note to be too big)Again I feel this is the best phone on the market currently...Hands Down.Peter", "Date": "December 29, 2012"}, {"Title": "BEST SMARTPHONE TO DATE!!", "Author": "NUCLEARDOC", "ReviewID": "R34CYXVCLB1MWV", "Overall": "5.0", "Content": "ALREADY CHANGED AN IPHONE 5 FOR A GALAXY S3 AND NOW I'M GIVING A TRY TO THIS POWERFUL MACHINE.THIS HTC ONE X+ PLUS WITH 1.7 GHz QUAD-CORE HAS AN AMAZING STABILITY AND INTUITIVE INTERFACE COMPARED TO S3. GREAT IMPROVE FROM FIRST HTC ONE X.IT HAS A POLYCARBONATE BODY THAT GIVE A BETTER LOOK, AND SOPHISTICATED SLEEK DESIGN, COMPARED TO THE CHEAP PLASTIC MATERIALS ON S3.SCREEN HAS A MORE REALISTIC COLORS THAN S3.ON HANDS YOU FEEL IT MUCH MORE SECURE THAN THE S3. FORGET ABOUT IPHONE 5, GALAXY S3 AND NOTE 2.EXPENSIVE BUT, THIS IS DEFINITELY THE BEST SMARTPHONE TO DATE ....DEC 2012!", "Date": "December 11, 2012"}, {"Title": "great in everything except wifi", "Author": "Yasser Salama", "ReviewID": "R1D8E8K95SO61S", "Overall": "3.0", "Content": "great display, ram and processor can handle any application without any troubles, nice mod by HTC based on Android Jellybean  , only a problem with wifi, always disconnect after 2 minutes or 3, and I always have to switch wifi off and on again to work .. i quit using wifi becuase of that!!", "Date": "December 30, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "NETWORK HSPA/WCDMA: 850/900/1900/2100 MHz GSM/GPRS/EDGE: 850/900/1800/1900 MHz\nCPU SPEED NVIDIA® Tegra® 3 1.7 GHz, Quad core\nMULTIMEDIA Audio supported formats: Playback: .aac, .amr, .ogg, .m4a, .mid, .mp3, .wav, .wma (Windows Media Audio 9) Recording: .amr Video supported formats: Playback: .3gp, .3g2, .mp4, .wmv (Windows Media Video 9), .avi (MP4 ASP and MP3) Recording: .mp4\nPLATFORM AndroidTM with HTC SenseTM\nCAMERA WITH HTC IMAGESENSETM 8 megapixel camera with auto focus, LED flash, and BSI sensor (for better low-light captures) F2.0 aperture and 28mm lens 1080p HD video recording 1.6 megapixel front camera (720p for video recording) Dedicated HTC ImageChip VideoPic: Capture a 6 megapixel photo while shooting HD video at the same time Continuous shooting: One-press continuous shooting captures up to 99 shots Smart Flash: Five levels of flash automatically set by distance to subject Smart Scene: Automatically detects the environment and sets you up to capture the best shot Sightseeing mode: Ensures that your camera is always ready for your next great shot Video stabilization: Removes shakiness for smooth, professional videos Slow motion video capture and playback", "Name": "HTC One X Unlocked Android Smartphone - NVIDIA® Tegra® 3 1.7 GHz, Quad core - International Version", "ImgURL": "http://ecx.images-amazon.com/images/I/41msHLYMJCL._SY300_.jpg", "ProductID": "B00A6WOPPS"}}