{"Reviews": [{"Title": "Good phone. It works very well", "Author": "Jorge P.", "ReviewID": "R74QCUCT3OZH6", "Overall": "5.0", "Content": "This phone is very good. It is easy to use and really fast. The dual sim system works very well. I recommend this phone for people that  reallyneed two sims. It is a basic smartphone.", "Date": "January 6, 2014"}, {"Title": "Not bad for a basic dual SIM phone and cost is low!", "Author": "Phred", "ReviewID": "R1PDM89DFI2JTO", "Overall": "4.0", "Content": "I bought one before it was offered here on Amazon (about a year ago). I live in Singapore, but I am a US citizen.I have used the phone in the USA, Singapore, Malaysia, Russia, and Hong Kong.Wifi works well, signal reception on networks is good. Voice quality is good, even through the wired headset. Battery life is Just about average.I chose it specifically because it uses a full size SIM. Switching those tiny SIMs while traveling is clumsy and often results in dropping the SIM on the floor.The spec says the phone can support a 32gb mSD. I am using a 64gb mSD with no problem.On a recent trip I used it as a wifi hotspot with my primary phone (iPhone). It worked very well.I have only encountered two minor annoyances:1. Dual SIM cannot work with ReadySIM in USA.2. Slow performance, but movies and games work OK. Not really for a power user.Camera, and Bluetooth do not interest me so I have never used them.I rooted mine, and customized just about everything. I replaced the default mail, browser, and SMS apps. I removed all stuff I did not need. The phone is easy to hack.", "Date": "November 3, 2013"}, {"Title": "good, but......", "Author": "L. M. Drada Marmolejo", "ReviewID": "R2H28XVJXD3FVE", "Overall": "4.0", "Content": "I think this is a godd phone from samsung. dual sim is very good to make and receive calls from 2 different carriers. But the phone processor is slow sometimes (almost always), so, in many times you have to wait a little until it respond. But for the price, I think this is a good option", "Date": "July 29, 2013"}, {"Title": "It does not work", "Author": "Jorge Aguilar", "ReviewID": "R1LXZN8FGKQS80", "Overall": "1.0", "Content": "The phone looks and works great but after the screen is blocked automatically the phone does not response when any key is pressed.", "Date": "May 30, 2013"}, {"Title": "good", "Author": "harold leon", "ReviewID": "R3CINHDA9ZUEQP", "Overall": "3.0", "Content": "While some functions but slow the processor to make a call habrir take long for that part is slow what can others say it works well for that I give this calificasion thought was faster by your processor", "Date": "May 6, 2013"}, {"Title": "Good", "Author": "JD", "ReviewID": "R3L7SP8NS1NOZ1", "Overall": "4.0", "Content": "Best dual SIM phone I've ever owed! Had it about a month now, there's no probs thus far.  Would recommend!", "Date": "May 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AZCYKAY"}}