{"Reviews": [{"Title": "Cheap price, high quality phone!", "Author": "astro_mike", "ReviewID": "R1M32R6MQDUSG7", "Overall": "5.0", "Content": "Being a loyal Straight Talk customer I was skeptical purchasing this phone given it's under 100.00 price (usually you get what you pay for).  When I did finally decide to buy it at my local Walmart store I lucked out as it was on sale at a special promotional price of 39.88!! I couldn't believe it, the listed retail price is 89.99 on Straight Talk's website! It has the look, feel and performance of an Android 2.3 that you would think costs well over 100.00. It streams youtube, tune-in and iheart radio flawlessly (never buffers)! Battery life is much stronger then other android phones I have owned and it charges fast too. The one drawback to this phone is the camera is not the greatest sharpness but that is no huge deal with me. This phone is still somewhat new so accessories take quite a bit of looking around to find but they are out there (amazon). Bottom line.... this is the cheapest android phone I have ever purchased and it has performed the best and seems to have the best quality compared to more expensive Straight Talk android phones I owned in the past that ended up disappointing me. Buy one now!! It is a smart buy!Pros:-Affordable 2.3 android-Streams Pandora, iheart radio and other music apps flawlessly-Thin, clean design and very portable-Stronger battery life then most other Straight Talk androids-Charges fastCons:-Camera not as sharp as other android phones-Accessories while available take a lot of researching to find.  Can also be found under model name LG S3 E400", "Date": "December 10, 2012"}, {"Title": "Great phone", "Author": "Martin J. Zakarauskas", "ReviewID": "R2SQV35HA22C3L", "Overall": "5.0", "Content": "This phone works on the at&t; phone towers. Excellent service. Very easy to set up and use. Anyone want a less expensive phone will not be sorry if they buy this. I am very happy with the Lg Optimus Logic phone", "Date": "December 8, 2012"}, {"Title": "Straight Talk Fan", "Author": "ms. patton", "ReviewID": "R1O1SJX8U3LXQH", "Overall": "5.0", "Content": "When i first saw this phone  i fell in love with it my bf has one and i can't wait to get mine i just ordered...trust me you getting your moneys worth and its affordable so what you waiting on go and get your straight talk LG optimus.", "Date": "December 15, 2012"}, {"Title": "Nice LG Phone.  Sleek.", "Author": "Colleen", "ReviewID": "R2T73WU9YHWI2G", "Overall": "5.0", "Content": "This is a great phone for the price.  Good features.  Really nice design, easy to use.  It arrived quickly, too.", "Date": "January 6, 2013"}, {"Title": "Love my LG phone", "Author": "Pattie49", "ReviewID": "R1DBS41O5P8TQ2", "Overall": "5.0", "Content": "Being a Straight talk customer I love my phone. I have had no problems what so ever.The one thing that is even better is the price of the phone.", "Date": "December 10, 2013"}, {"Title": "Touchscreen stopped working", "Author": "Kim Slaughter", "ReviewID": "R28BNHL2V5YM12", "Overall": "1.0", "Content": "I've had this phone for 6 months, and have taken very good care of it. The touchscreen just stopped working and there is no way to fix it. All my contacts, pics, texts are lost. Don't waste your money!", "Date": "July 22, 2013"}], "ProductInfo": {"Price": "$139.95", "Features": "Straight Talk\nLG Optimus Logic Cell Phone", "Name": "Straight Talk LG Optimus Logic Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BgxaLO8qL._SY300_.jpg", "ProductID": "B00AFP6XYW"}}