{"Reviews": [{"Title": "Do not recommend.", "Author": "Gufort", "ReviewID": "RL5WM6TR2GEQ7", "Overall": "1.0", "Content": "I would recommend the product but not the vendor. The advertised product is not what they have delivered. The say RM-821 that is the factory unlocked version and send AT&T; unlocked phone, that is RM-820 working at different LTE band. On top of that, this product is not new. It came with small scratches, looks like it was used for demo, or by someone before. It is unbelievable.Beside that, Lumia 920 is a great phone and I would recommend it to anyone that likes Windowsphone platform. It does not relate to what it does, but how it does. It is very efficient.", "Date": "June 10, 2013"}, {"Title": "Do not buy.", "Author": "Elias E. Mendez Montero", "ReviewID": "R1LQ6D9ESUGM8T", "Overall": "1.0", "Content": "This company is selling products refurbished as new, I got this phone and the display had a flickering issue I decided to live with that problem, 3 months later touch screen stops working I called to On The Go Solutions and they told me to contact Nokia support, Nokia support told me that this phone was manufactured at Africa, for that reason they will not honor warranty.In one word I wasted 330 dollars + shipping.", "Date": "November 2, 2013"}, {"Title": "Best phone of 2012", "Author": "Robbie Brar", "ReviewID": "RIE1C1OYQZKD7", "Overall": "5.0", "Content": "everything is top notch. The built quality, hardware, camera, fluid UI, and a great software experience.Only short coming is that it has fewer apps than iOS or Android, but all the significant ones are there.", "Date": "December 7, 2012"}, {"Title": "Best Windows Phone as of early 2013", "Author": "rpv", "ReviewID": "RGNGITRE7IFQ8", "Overall": "5.0", "Content": "Windows 8 apps are a welcome change from iOS. Among the three ecosystems, I prefer Android, Windows 8, and iOS in that order. Blackberry, what ?! For ease of use, Windows phone is really easy to use. For someone interested in a first smartphone, Lumia 920 is an excellent choice. I got access to few Windows 8 phones to review. I will try to review them, but since I have not used for a period longer than a month I am not reviewing for reliability. User interface in Windows 8 is very pleasing and this is one of best phones with awesome user experience. If you prefer great user experience over infinite hackability, aka Android, then Windows 8 phones are great choice.The Lumia 920 has a stunning 4.5\" IPS LCD, 1280x768 resolution, 332 ppi display. This phone has up to 32 GB storage and 1 GB RAM.  8.7 MP camera and a 1080p HD Video.  1.5 GHz dual core processor. I have extensively used in the past HTC Titan I and II which is pre Windows 8 (7.5) and I was surprised it has become more buttery smooth now. This phone has Gorilla Glass 2. Glass 3 is in the making and supposed to be even better. Stating following because this is highly underrated in reviews. From Corning's Gorilla Glass specs; WHAT MAKES GORILLA GLASS SO DAMAGE RESISTANT? The unique composition of Gorilla Glass allows for a deep layer of high compressive stress (created through an ion-exchange process). This compression acts as a sort of \"armor,\" making the glass exceptionally tough and damage resistant. Ion exchange is a chemical strengthening process where large ions are \"stuffed\" into the glass surface, creating a state of compression. Gorilla Glass is specially designed to maximize this behavior.Lumia 920 does not support microSD expansion. I always feel this is a bummer. But with 32GB it is plenty with current app ecosystem.  These phones seem to be copying iPhone philosophy.  Battery 2000 mAh Lithium polymer battery (Compared to a high end Android Galaxy Note II, which has a battery of 3100 mAh Battery.) Unlike the Nokia Lumia 820, the Lumia 920 doesn't have a removable battery cover, which means you can't access or replace your battery. __Not having a storage expansion slot is a bummer for lot of people! Not being able to remove battery is a double bummer.__  For me, storage expansion and removal of battery is very important, so I was disappointed. This is the downside the unibody design.  Wireless charging is a big plus, though!Phone quality was excellent and speakerphone was awesome. Nice to see built in active noise cancellation with a dedicated mic. Nice to see Lumia 920 has Bluetooth 4.0. Bluetooth low energy (BLE), known as WiBree, is a subset of Bluetooth v4.0 with an entirely new protocol stack. As an alternative to the Bluetooth standard protocols that were introduced in Bluetooth v1.0 to v3.0, it is aimed at very low power applications running off a coin cell. I was able to get excellent reception with Bluetooth headset, Jaybird Sportsband Stereo Bluetooth Headphone - Bulk Packaging - Midnight Black and JayBird BlueBuds X Sport Bluetooth Headphones - Midnight Black  All the usual smartphone stuff, facebook, twitter, music, emails etc are all excellent. It is only the third party apps that are lacking in some arenas. If you are Microsoft heavy like Office suites, Lumia phone are awesome!Apps are limited in Windows 8 marketplace. Yes, we have heard this a gazillion times. Lumia has GPS receiver with A-GPS and GLONASS support. I tried with Garmin Navigon app which turned out to be great in giving voice directions. App ecosystem is a chicken and egg situation. Unless more phones are sold, developers don't have incentives to write apps. Apps are less now, because people are not buying in big droves. Windows Phone is now (early-mid 2013) the third-leading mobile phone platform, more than tripling its market share year-over-year. One recent report I read Android and iOS are ahead in games with 162.1 and 37.4 million shipments in 1Q13 and Windows phone came in 7 million. This is more than double from previous year. I really hope for Windows 8 platform to surge ahead because having a 3 way competition with iOS and Android is good for the ecosystem.ONE LINE SUMMARY: The Nokia Lumia 920 is certainly the best Windows Phone 8 smartphone on the market right now.", "Date": "May 18, 2013"}, {"Title": "Very Good device", "Author": "Felipe Melo", "ReviewID": "R258FWE1FZ6ZKJ", "Overall": "5.0", "Content": "One of the best devices I had. You will find every feature you need here. The only point you need  to pay attention is regarding the 4G frequency, as it varies country by country and Nokia ships this device with diferent frequencies.", "Date": "February 25, 2013"}, {"Title": "If you are going to buy the phone, buy it from BREED company at least", "Author": "Amr Aggour", "ReviewID": "R3F1LBNSRLAG57", "Overall": "2.0", "Content": "I used the phone for about 4-5 months, and then I hit issue with sim card reader ( the phone does not recognize any inserted sim card)After searching on the internet I found that it is common issue, and no way to fix it.Although I give the phone  2 stars because of the sim card bug, but I want to give 5 stars to the seller  \"BREED\"I send them back the phone and they partially refund me with around 70% because it was out of return period.I send them back that I returned it because of the sim card bug, not because I do not want, and they completely refunded, so Thank a lot.", "Date": "March 29, 2014"}, {"Title": "Worst decision to buy this phone", "Author": "Devendra Singh", "ReviewID": "R1CNL42X58RUE7", "Overall": "1.0", "Content": "I bought this phone for ($489) and it lasted 3 months and I faced problem related to frozen and unresponsive screen and needed to soft/hard boot it almost every week.Now the screen is completely unresponsive. I check with Nokia and they are telling that phone is not under warranty and I need to spend almost 150 for the repair.I would not recommend this phone to any one and definitely not buying from this seller.", "Date": "March 23, 2014"}, {"Title": "The cell phone seems Used", "Author": "Herman A. Rojas", "ReviewID": "R11S84HXE7E9Q9", "Overall": "1.0", "Content": "This seller is dishonest, I bought a new nokia 920, and has wear and tear not included headset, the sound is dead, the data cable is not the original, the protection labels were not, the packages were uncovered and wrinkled in short it appears that it is a used model. Now I'm afraid I'll have to return it to amazon.", "Date": "January 13, 2014"}, {"Title": "Good phone", "Author": "Jose Miranda", "ReviewID": "RA8FML412844D", "Overall": "5.0", "Content": "Yea it's all good and the best phone ever I really like it so much thank you so much ,", "Date": "January 5, 2014"}, {"Title": "An AT&T; retread device which can not read SIM card", "Author": "Morgan", "ReviewID": "R1D9M4H21TA6WK", "Overall": "1.0", "Content": "With AT&T; LOGO. Found little scratch on the top of the phone body. No earphone in the box.It can not find my SIM card, but other 920 device can.Do not buy it.", "Date": "December 23, 2013"}, {"Title": "Signal problems", "Author": "Luis Fernando Mondragon Mejia", "ReviewID": "R1CC746B5X9XA3", "Overall": "1.0", "Content": "The phone is fine, but appears to have a defect of manufactures, it has a defect in the main card, the signal from my carrier in Colombia dropped much, is intermittent, maybe you have a replacement for this, or I indicated as available in your store, and we do it, by that if it seems to me a very good phone, here not have managed to get that spare, you got the card's signal and not improved anything.I am waiting for your comments.", "Date": "December 22, 2013"}, {"Title": "Wish I could give this Zero. Phone had TWO prior owners", "Author": "Florida Hillbilly \"Alex\"", "ReviewID": "R3DMRZPTAVTGAH", "Overall": "1.0", "Content": "I called AT&T; because when I put my SIM card in the phone, it said that it had to be unlocked. I thought it WAS FACTORY unlocked.  AT&T; told me they were so very sorry that my phone was actually owned by two previous owners & I had to give them both prior owners information in order to apply to them to unlock the phone.The phone was in a sealed box, all items were in plastic baggies (sealed). The phone had a sticker on the front of it.  BUT it had scratches on the back.  They weren't bad.  I liked the phone enough that I was going to keep it if it worked.  Well... It did not work!  AT&T; said they could not help.  I returned the phone to Amazon.com.  Thank God -- and many blessings to Amazon.com!  I went to TMobile and got a Nokia 925 from them. It is $20 off online right now. With the plan it cost me $480. I had to pay taxes and a small shipping fee. Not a problem.  My payments on my plan and phone will be the same as my old plan ($5 less actually).  I'm happy with TMobile and Amazon... but not the JERKS from Tablet Distributors! Be careful out there people! There was no warranty either, so with 2 other owners, it was a sure bet there was something wrong with the phone. I'll never try something like that again! BUT the nice little case I got from Amazon.com won't work with the 925 either.Phone said I had 10 tries to get the unlock code right or the phone would lock up & become unusable.  Like I said earlier.  I thought it was already unlocked.  I'll tell you thought, AT&T; was SUPER nice!  They did go above and beyond trying to help me.  The lady was really sad for me as well -- and genuinely.", "Date": "December 18, 2013"}, {"Title": "Excellent", "Author": "Jing", "ReviewID": "R3EUMS5PA29JM0", "Overall": "5.0", "Content": "Excellent , Item delivered on time, was as described.Everything is top notch. The built quality, hardware, camera, fluid UI, and a great software experience.", "Date": "December 10, 2013"}, {"Title": "very good!", "Author": "Xu Liang", "ReviewID": "R23PGRJYX4FFO5", "Overall": "5.0", "Content": "even the wp8 is still on developing state for the software, the cell phone is very good itself. I am glad.", "Date": "September 26, 2013"}, {"Title": "Phone all around was great but i had issues", "Author": "YVONNE K BODDEN", "ReviewID": "R6TPWZ1H2NO56", "Overall": "3.0", "Content": "after 2months it stopped reading the sim card tray, i tried different sims but all  i get is emergency calls only. So i am now left with a wifi only Nokia Lumia 920.", "Date": "August 4, 2013"}, {"Title": "Excellent!", "Author": "Francisco", "ReviewID": "R240HE10S2YHOV", "Overall": "5.0", "Content": "I received AT&T; un-locked phone. I am using it without any problema. It works very well.Fantastic and modern mobile phone.", "Date": "July 30, 2013"}, {"Title": "Absolutely wonderful phone", "Author": "albert", "ReviewID": "R1DQCCY9BP0P1D", "Overall": "4.0", "Content": "It's much better than what I had expected. The phone's screen is big and seems very sturdy. I really like the tiles concept of the windows phone. The big screen really helps my aging eyes. The phone takes good photos day and night as well. Setting up e-mail is easy.However, there are some cons:1. The camera button is either extremely hard to press or the response time is too slow. I just can't get a handle on whether the picture was actually taken or not. I look later to find that some photos weren't taken because of the inconsistent button.2. The 'Bing' tab on the lower right hand side of the screen seems so sensitive that even the slightest touch, brings up a new Bing screen for searching the net. Just wish this button was for the camera instead (at least I wouldn't miss shots)3. Once your directed to a new internet page, i.e. via  facebook or other applications, you can't get back to that particular application unless you exit and tap the application anew. - i.e. you can't get back to the spot in facebook that launched the internet page. You start reading again from the top!As for quality of materials and hardware, It's a very good phone altogether.", "Date": "June 6, 2013"}, {"Title": "Incredible", "Author": "Karim S.", "ReviewID": "R86PHK55THO6A", "Overall": "5.0", "Content": "a great phone for everything. Have a very good camera and the windows phone 8 OS is very beutiful. AWESOME", "Date": "May 31, 2013"}, {"Title": "Nokia Rocks.", "Author": "Benjamin Piedra", "ReviewID": "RHOKBDZA1QSHQ", "Overall": "5.0", "Content": "I gift this mobile phone to my brother, and he love it, he said is one of the best, and is 4G.", "Date": "May 23, 2013"}, {"Title": "The best phone", "Author": "José P.", "ReviewID": "R134U9HAFTM17L", "Overall": "5.0", "Content": "The best phone, this was all my expectations, the phone works perfect. The best phone that I had having in my life.", "Date": "November 22, 2013"}, {"Title": "Great Phone, great performance, work with SV networks", "Author": "Juan V.", "ReviewID": "R3NTOL324SK8XJ", "Overall": "5.0", "Content": "Works great!, my wife is happy with this phone.  Cons no BBM available for Windows Phone 8 yet...  Works well with SV TIGO Network", "Date": "November 6, 2013"}], "ProductInfo": {"Price": "$290.00", "Features": null, "Name": "NOKIA LUMIA 920 IN WHITE NFC 32GB FACTORY UNLOCKED GSM GENUINE OEM PYARM-821 (LTE 4G 800/900/1800/2100/2600 & 3G 850/900/1900/2100 & 2G QUAD BAND) NEW", "ImgURL": "http://ecx.images-amazon.com/images/I/41WcBEW2S9L._SY300_.jpg", "ProductID": "B00A5TWFN6"}}