{"Reviews": [{"Title": "Stay away from this phone", "Author": "JZ2000", "ReviewID": "R2NWXWURDKRWVN", "Overall": "1.0", "Content": "Stay away from this phone! Stay away from LG!Similar to what happened to the last reviewer, the internal LCD in my phone cracked after only two months of light use. What was worse? LG refused my warranty claim.I bought this LG Neon II GW370 Blue phone here at Amazon.com (sold by Breed) at the end of April, 2013. I'm a light cell phone user. I probably used this phone for a total of 300 minutes and 30 text messages. This phone stayed in my pocket well protected all the time. On 6/27/13, I pulled out this phone and found out that the internal LCD cracked.Well, I thought I just had a bad buck and LG would take care of it. I was wrong. I emailed LG immediately and got a RA number on 7/1/13. I mailed the cell phone to LG service center in Fort Worth, TX on 7/2/13. On 7/8/12, I received an email from the LG service center which said that a cracked internal LCD was considered a physical damage and would not be covered by warranty. I was told to send $65 to LG to get it fixed.I just could not believe it. What physical damage? The phone was in perfect condition cosmetically. The glass panel on top of the LCD looked brand new. There was no abnormal use at all. I think the LCD in this phone had a quality control issue and could fail easily during normal usage and storage.I then went back and forth 5 or 6 times via email with LG care center reps. They gave me some inconsistent excuses not to honor the warranty. In the end, I called the supervisor at LG escalate department to complain. But he flatly told me LG stood by the decision made by the service center technician and would not do anything for me. I was given a physical address to file paper complaint. Seriously? Nowadays using regular mail?Today, to add the final insult, LG sent back my broken phone with nothing done.I guess I will stay away from LG from now on.", "Date": "July 18, 2013"}, {"Title": "Two major issues", "Author": "Vipin Mittal", "ReviewID": "R3B7MN6PJPRBFS", "Overall": "2.0", "Content": "It says so but it does not support FM radio. That was a big deal for us. Supplier agreed to take the phone back (we did not return it)  for this. Further, this phone has really bad standby time. Even if no call whole day, the battery is down to 1 bar by night time. Since it is a kid's emergency phone, we do not use it much but would have been a real problem if we had to.", "Date": "August 30, 2013"}, {"Title": "Nice, for the first 2 weeks.", "Author": "Brad Fritz", "ReviewID": "R1LLIKTWQ63RH4", "Overall": "2.0", "Content": "Phone worked well for the first few weeks, then the internal LCD screen cracked and the whole top half of the screen went black.  Not cool.", "Date": "June 16, 2013"}, {"Title": "Love the phone", "Author": "Diane Harrison", "ReviewID": "R1FPFBW3TCMPGV", "Overall": "5.0", "Content": "The phone is excellent once I was able to figure out how to work it.  Unlocked so I was able to use it on the Rogers carrier.  But the manual was only 40 of the 126 pages and so tiny and blurry I couldn't make out the symbols. I had to go to the LG website and download the full manual to learn all the features.  The slideout keyboard is nice too, a bit bigger then the regular phones so it is probably easier to use.", "Date": "June 2, 2013"}, {"Title": "Decent phone for those who don't like touch screens much.", "Author": "Nicks", "ReviewID": "R1YURZLROR4ALY", "Overall": "3.0", "Content": "I bought this for my mom when her phone broke. She's used to flip phones and keypads but hates touch screens so I got this one since it's cheap and looks ok. She likes it enough, has no real complaints against it. Personally though, I feel the trackball is too fidgety, the size of the keys on the slide out keyboard are a bit too small, and overall its just a bit clunky. In the end, it's a good buy for someone who doesn't like technology too much or dislikes touch screens, but for anyone who has used an iphone, WP7/8, or android, its too slow and clunky.", "Date": "March 13, 2013"}, {"Title": "Lg", "Author": "Talitha Davis", "ReviewID": "R2D9F3Q57VWWU5", "Overall": "5.0", "Content": "I have bought LG Neon before and i have to say if you want simple this phone is perfect! As A clumsier type of person I am always dropping things, and I have to say that this little guy is more then durable and doesn't scratch easy. Comparing it to my more expensive samsung phone, that only lasted a whopping month and was covered in scratches within the first week, this phone gets the job done well at a nice price. If your main concerns are texting,email and etc, and your not a \"smart phone\" person, I highly recommend this phone. Its layout is simple, sleek and lovable. WHy else would I buy it a second time?", "Date": "April 1, 2014"}, {"Title": "Great - but is this a used product?", "Author": "Buyer", "ReviewID": "R2Q3JTS0L0FHCM", "Overall": "3.0", "Content": "Phone is fantastic.  Everything I wanted and more!However, a bit confusing.  The charger had some gunk in it that looked like food residue that I had to scrape out.  Phone looked new, but who knows.  Is this a used phone?Aside from the gross-out factor,absolutely love this phone.", "Date": "December 25, 2013"}, {"Title": "Not great!!", "Author": "L. Rees \"avid reader\"", "ReviewID": "R3UX6Z1UQJMGPD", "Overall": "2.0", "Content": "The battery life is horrible!!  You can't make a few texts without charging, constantly freezes up and needs to be rebooted, instruction manual is pointless and doesn't help, not user friendly in the least!!", "Date": "August 2, 2013"}, {"Title": "Love it .....again", "Author": "Kathy Durocher", "ReviewID": "REPLWKEJOVJUE", "Overall": "5.0", "Content": "My daughter has this phone and has been using it without any problems for 2 years, so when my son wanted the same phone I did not hesitate. All they wanted was a good phone for talking and texting. This one fit our needs nicely.", "Date": "May 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AVYZHQC"}}