{"Reviews": [{"Title": "NO contest, Note 2 is the best.", "Author": "All Powerful Wizard Of Oz", "ReviewID": "R25NUUO14J8UWN", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo289EO9L2UDWEIembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo289EO9L2UDWEIrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo289EO9L2UDWEIchiDiv\").innerHTML = document.getElementById(\"cv_mo289EO9L2UDWEIhiddenPre\").innerHTML;\n};\ncv_mo289EO9L2UDWEIrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo289EO9L2UDWEIso;\t   \n\n\nfunction cv_mo289EO9L2UDWEIloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo289EO9L2UDWEIso = new SWFObject(swfLocation, \"cv_mo289EO9L2UDWEIAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo289EO9L2UDWEIso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo289EO9L2UDWEIso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo289EO9L2UDWEIso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo289EO9L2UDWEIso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo289EO9L2UDWEIso.setAttribute(\"height\", swfHeight);\n          cv_mo289EO9L2UDWEIso.setAttribute(\"width\", swfWidth);\n          cv_mo289EO9L2UDWEIso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo289EO9L2UDWEIso.write(\"cv_mo289EO9L2UDWEIflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo289EO9L2UDWEI', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo289EO9L2UDWEI';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo289EO9L2UDWEI', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo289EO9L2UDWEIloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo289EO9L2UDWEI\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m11K60IO9VIVK8\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m11K60IO9VIVK8\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R25NUUO14J8UWN\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m11K60IO9VIVK8/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo289EO9L2UDWEIduration')) {\n      document.getElementById('cv_mo289EO9L2UDWEIduration').style.display='none';\n    }\n    cv_mo289EO9L2UDWEIloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo289EO9L2UDWEIloadSwf(movieID, playerVersion) {\n   return _cv_mo289EO9L2UDWEIloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo289EO9L2UDWEInewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo289EO9L2UDWEI', 0, h);\n}\n\nfunction cv_mo289EO9L2UDWEIresetPlayer(w,h,bw,cc) {\n  cv_mo289EO9L2UDWEInewHeight(h);\n\n  cv_mo289EO9L2UDWEIso.addVariable(\"resetBandwidth\", bw);\n  cv_mo289EO9L2UDWEIso.addVariable(\"cacheCode\", cc);\n  cv_mo289EO9L2UDWEIso.setAttribute(\"height\", h);\n  cv_mo289EO9L2UDWEIso.setAttribute(\"width\", w);\n  cv_mo289EO9L2UDWEIso.write(\"cv_mo289EO9L2UDWEIflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo289EO9L2UDWEIRollOverImg = new Image();\ncv_mo289EO9L2UDWEIRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81tpEWtkwGS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo289EO9L2UDWEIpreplay = document.getElementById('cv_mo289EO9L2UDWEIpreplayImageId');\nif (cv_mo289EO9L2UDWEIpreplay) {\n  cv_mo289EO9L2UDWEIpreplay.onmouseover = function() {\n    cv_mo289EO9L2UDWEIpreplay.src = \"http://ecx.images-amazon.com/images/I/81tpEWtkwGS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo289EO9L2UDWEIpreplay.onmouseout = function() {\n    cv_mo289EO9L2UDWEIpreplay.src = \"http://ecx.images-amazon.com/images/I/81tpEWtkwGS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo289EO9L2UDWEIpreplay.parentNode;\n\n  var cv_mo289EO9L2UDWEIcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo289EO9L2UDWEIcurrentClick) {\n      return cv_mo289EO9L2UDWEIcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 3:14 Mins3.12.13 UPDATE --- the music video I have uploaded will be used for MTV dot com for the band The Perfects. (the song is called Forever off the album Sudden Victory)It was 100% filmed with the Samsung Galaxy Note 2 along RT 66.I used a lens attachment kit and tripod combo I purchased on Amazon for $40 for some of the shots.The footage exports from the Note 2 as full 1080p HD MP4s .I used Imovie 11 to edit, and color correct.Added in a tweak to the codecs in Imovie 11 so the final video exports out as an Apple ProRes422 file at 24fpsAmazon does not showcase the HD element of uploaded videos when using full screen so it does not do justice to how good this really looks fyi.I stand by my original review below, this device is simply the best ever and it's just beyond words at this point of it's capabilities and continues to amaze me.ORIGINAL REVIEW ---I have been an Apple fanboy for years.I own everything Mac in my house and I still stand by that decision over PC.However when it comes to the Iphone I reached my breaking point of dissatisfaction as I kept hearing about the Galaxy SIII which in turn I found out about the Note 2.  Before I get to that let me say that Apple deserves all the credit for the current direction in which smartphones have evolved, the only problem is the Iphone IMO has not evolved past the Iphone4 and once the 5 was released and I saw that it really was no different then the 4 and I wanted something more, I started to look.So enter the Samsung Galaxy Note II. Everything I wanted in a phone and tablet this device had. The question for me was how did it function? Would I lose some of my apps I adored? What were the drawbacks from moving on from an Iphone to an Android after using IOS for so long. Well I can tell you that if you are on the fence it's time to take the plunge, this is the phone that Apple should have made with the 5 and did not.Let me break down what I love:* First of all this phone is fast in all areas, and I mean super fast as in it smokes the Iphone 5 in responsive feel and internet connectivity by a large margin. You will have NO problems with any videos or apps working properly.* Upgradable. I owned a 16gig and it really was infuriating that I was stuck with that always having to manage photos, videos, apps, music etc and not having that option to upgrade without out right buying a new Iphone or jailbreaking it which I did not want to do. The Note II can be upgraded for $49 to a full 80gigs with a 64gig Micro SD card. Win.* Clear phone calls. The Iphone seemed to have some issues with my ear as the speaker had to be lined up just the right way in order to clearly hear a call. The Note2 I have not had this issue what so ever and the calls are clear coming through the speaker so no issues there.* The preloaded Apps that come with the Note 2 are just amazing. My favorite is the Office App which is pretty much a fully functional copy of MS Office on a hand held and it works great!* The camera and video are stunning. Absolutely stunning. My pictures and videos look way better on this then they ever did on my old Iphone. (the screen size helps with that which I am going to talk about next)* Screen size. This was one of the selling points for me. I wanted a tablet but after discovering the Note 2 and realizing that this was pretty much a hybrid between a phone and tablet (phablet) this solved my concern of owning two devices to lug around. The screen size is perfect. I mean it's just great to actually be able to see what it is I am looking at and stream videos with clear resolution. Not to mention you can add flash to this device! Another annoyance I had with my Iphone which was the lack of support for flash. Now I am able to watch Amazon Prime at the gym! Woo Hoo!!* S-pen. Amazing. The ability to write in my hand writing and draw on my phone takes this to a whole new level that the Iphone cannot even compete with.* Sexy. Yup, the phone is very attractive from a design perspective. I love the look, feel of this device.Samsung has come a long way from their first days of the smartphone, remember the terrible Samsung Behold? Granted they did rip off a lot of the features that made the Iphone great to begin with, but honestly they have improved them and made them better. Everything you are able to do that you are used to on your Iphone is you can do with the Note 2, just better. Have no fears about making the move if you are on the fence. Honestly I cannot even imagine going back.Bravo Samsung for delivering and this is one of those situations where the hype really matches the product. Everything you're reading about this phone is true. It's the real deal.", "Date": "December 29, 2012"}, {"Title": "Best smart phone I've owned", "Author": "M", "ReviewID": "R1EWOMCCWH2IU1", "Overall": "5.0", "Content": "I've owned phones within both the Apple and Android ecosystems (iPhone 3G, iPhone 4, Samsung Galaxy S II Skyrocket). I also used several generations of corporate issue BlackBerry devices.  I found that after the novelty of the iPhone wore off, Apple's \"take what you get and like it\" attitude towards customization didn't work for me. I had to jailbreak just to get the phone to do kinda what I wanted it to do, but Android truly lets me unleash the device's potential. If you like to tinker, the Note 2 is a great one, but it's also great on its own. Fantastic user experience out of the box.This is the first of the bunch that's been instantly satisfying. Unlike the others, I'm not too concerned about watching and waiting for the next best thing. It's a great device to interact with, and if you're prepared to deal with the extra size it's a wonderful upgrade. It fits just fine in any of my pockets, though obviously it's bulkier. Expect comments about how huge the phone is, especially from people who want thin, tiny, air weight phones like the iPhone 5 that could probably take flight in a strong Autumn breeze. Let them have it! I'll take this :)It's actually not even that heavy (6.3oz), and the larger screen size makes a big difference for browsing, taking notes, and reading books on the Kindle app.  I can't comment too much on the S Pen since I don't really use it much - look elsewhere for feedback on that.One of my peeves with smart phones has always been battery life. Remember when you could charge your mobile one or twice a week? Smart phones are basically small portable computers so obviously they're going to take more juice... but, with all of my previous smart phones I was lucky to get a full working day out of a single charge. I use my phone *a lot* during the day. With my iPhones, I had to carry a spare pre-paid mobile since I couldn't change batteries. With the Galaxy SII, I carried two spare interchangeable batteries and had to do at least one change each day. With the Note 2, I have stretched a charge out to *3 days* on light-use weekends, and can go a full day plus an overnight on a single charge of normal use. Wow! They nailed it on this one...  No wonder given that the stock battery on an iPhone 3G was about 1600mAh, on a Skyrocket was 1850mAh, and on the Note 2 is 3100mAh.  Sure, the larger screen and faster processors, etc should be expected to draw more... but there also seems to be better power management in the stock Jelly Bean OS.  On all prior phones I disabled push notifications, location services, and so on just to get mediocre battery life. On the Note 2 I have it all running full bore, as I should be able to, and still get great battery life.In short, the battery life is amazing and I no longer feel like a slave to the nearest wall charger. If you need a device that doesn't lose 30% of its charge during a 1 hour phone call or browsing session, this one is will please you.Neither AT&T; nor Samsung bloated the phone with an extraordinary amount of bloatware, though the usual junk is present. Unlike with prior devices, the quality of the stock ROM / UI is pleasing and I did not feel an immediate need to root it just to make the device tolerable. I still rooted it to install a number of apps that I like to use that require root. Unnecessary unless you want to.Thank you Samsung for finally nailing it!", "Date": "December 28, 2012"}, {"Title": "I'm so glad I ditched my iPhone!", "Author": "A E D III", "ReviewID": "R32SLR054JBV0O", "Overall": "5.0", "Content": "I had always been an Apple fanboy, but lately I found that their products lacked the innovation they once had. A few months ago, I sold my iPad and switched to an Android tablet. I was happy that I did. Changing phone's was the next logical step, and when I saw the first commercial for the \"next big thing\" I was hooked.There are so many things to like about this phone. The screen is huge, but it is gorgeous. Although it is large, I still find it easy to hold, although I do prefer my headset. But I always have. The battery life is great, so much better than my iPhone was. Plus, the battery is removable and thus user replaceable. You can also add up to a 64gb memory sim, which was the first thing I did after buying the phone. I'd recommend you do the same. Android Jellybean OS is easy to use, easy to customize, fast, and packed with great features.I was pleased to see I would not have to go without such things as do not disturb (called blocking here), reply with text, and all my favorite apps like Facebook, instagram, and more! Switching from iOS to Android was simple. Google play gives you a free tool to upload all your  music from iTunes, and I already had a Google account set up. I was up and running in a few moments.But the best part of the phone is the S-Pen! I have found this phone to be my notepad in meetings and when I need to quickly jot down ideas when on the go. I recommend turning off the hover feature however, as with it on I found the pen too sensitive. I love being able to take notes in my own handwriting, and doodling can be fun if not distracting as well. The ability to sign my name to an email is really cool!Google now is much better than Siri, and S-voice is not so bad either. I love that the phone checks my calendar and gives me information about where I am going, including travel time, traffic, and weather. It even figured out my work schedule and checks the roads before my commute.I invested in the flip case which also protects the screen, as well as an iHome dock for it. The call quality is clear, the phone has 4g, and it works great and is not buggy at all. The camera takes great pictures and the front camera for chatting is not so shabby either.Are there drawbacks? Sure, but to me they were insignificant. For me, the only drawback would be that unlike iPhone, there are not many docks and stuff out there. Sure there are many bluetooth items available, but a good quality plug in dock is hard to find. For me, that was the only downer.If you plan to purchase this phone, I recommend you also invest in a memory card (no less than 32gig but 64gig would be best) and some kind of case. It's a big phone and I'm sure you'd want to protect it if you were to drop it. A bluetooth headset would also be a good investment. No need for extra chargers however, the batter lasts all day!", "Date": "February 19, 2013"}, {"Title": "A Great Phone with Inherent Flaws", "Author": "Johnny Saigon®", "ReviewID": "R3O6LL9PZKGPZJ", "Overall": "4.0", "Content": "Let's get to the nitty gritty:Pros:1- It's BIG. Big for gaming, big for videos, big for web browsing. Simply put, if you want a phone with the most real estate on the screen size, then there is no alternative. Don't be so mesmerized on the 1080p screens that will come out soon. Unless you want to destroy your eyes and use the phone from an inch away, you will not notice the difference in everyday use.2- It's fast. Yes, the Qualcomm S4 Pro quad-core beats this Tegra 3/Exynos 4 CPU in most benchmarks, but again, unless you are a hard-core geek that is OCD on numbers, you will not notice any difference in everyday use. There is no discernible lag anywhere (it's probably just your slow Internet connection).3- It's beautiful. Not HTC or Sony beautiful, but this is one sleek and stylish phone. The white is classic, but the Titanium Gray is also super slick. Just check out the back cover and you will see what I mean (yes, even with that cheap-feeling plastic material).4- Did I mention the screen? It's BIG, it's bright, and it's beee-ay-eeww-ti-ful! AMOLED screens have awesome color saturation and contrast (most times even overkill, actually). Some people say it's not good in daylight. Um, have you tried cranking up the brightness??5- The Samsung/Android touch. Not everyone may like Samsung's Touchwiz user interface compiled onto Android, but I dare you to find a phone with more features than this one (and similarly the Galaxy S3). Here are the main highlights:a. Samsung utilizes the front facing camera almost to perfection. You can use it to control your music player; it has facial recognition to sense you are directly in front of the screen so it won't dim and turn off the screen (for reading, web browing, video playback, etc.); it recognizes your facial orientation so that when you are lying down sideways looking at the screen, the accelerometer will not kick in to auto-rotate the screen in the wrong orientation. That is something that has always bothered me with other phones and FINALLY someone has added that feature! Granted, not all these features work flawlessly, but it's a great start.b. Integration with Google is finally starting to show off in good ways. It was always once that Apple had the superior ecosystem. But now we see the future is bright indeed. Not just evolution, but finally innovation!c. The S Pen and all the neat things you can do with it. Preview a point in the movie before skipping to that point, and other things like going old-school back to the PDA days!6- It accepts up to a 64GB microSD card. That turned out to be the dealbreaker for me. Explanation in \"cons\" section below.Cons:1- It's BIG. With my tiny hands(hey hey), I can hardly do anything one-handed with this phone. Pocketability rating: -2. Putting it up on your face to make a phone call is also a big fail if you're sensitive to public ridicule like me. Have your Bluetooth earpiece ready.2- It's quite heavy. I really wanted to switch to the Verizon Droid DNA - for a 5-inch screen, it was remarkably svelte and light. And if it wasn't for the fact of pi$$-poor Verizon customer service at their call centers, and that it only had 16GB of memory with no microSD card option, I would have made the switch. The Droid DNA is superior in every way except those things mentioned. I have absolutely no doubt that the Samsung Note 3 (and maybe even the Galaxy S4) will be a 1080p screen with the Exynos 5 quadcore - can't wait!3- The screen may be bright and colorful, but it's way over-saturated and unnatural. Fortunately, you can go to the screen options and set it to \"Natural.\" \"Dynamic\" is overkill, and even so is \"Standard.\"Conclusion:Even with its inherent flaws, I can't help but love it. It's not even a phone, it's a cellular tablet(cablet, anyone??). I'm going to keep it. Until the next big thing is already here....", "Date": "November 29, 2012"}, {"Title": "Best Phone I've Ever Owned", "Author": "Amazon Customer", "ReviewID": "R1OBY0E3E1ZUZZ", "Overall": "5.0", "Content": "I've been doing the Android thing for years now. Been through a few manufacturers in that time. And the Samsung Galaxy Note II is, by far, the best phone I've ever had the privilege of using.First and foremost, the size. It's hard to talk about the Note II without mentioning its size. Based on the reviews I read on the web, I expected this thing to be enormous. Turns out it's really not nearly that big. It's amazingly thin, and a very comfortable size for my hands. Mind you, I do have somewhat large and clumsy hands. For my purposes, this is the perfect size for a phone. If anything, the Otterbox Defender case I put it in is what makes this phone appear really large. Without the case, most people don't really have anything negative to say about its size. Since I always have large pockets on my person (cargo pants, cargo shorts, jackets with large breast pockets, etc), I have no trouble accommodating this device no matter where I go.One drawback to the size is how ridiculous it looks holding it up to your face when you use it as a phone, especially with the Otterbox Defender case. For this reason, I got a Bluetooth earpiece (Motorola Elite Sliver) which interfaces perfectly with the phone and allows me to make and receive calls without taking the phone out of my pocket. I can also interact with the phone in various other ways via voice commands.Of course, the Note II's size brings us right into... the beautiful screen! What a fantastic screen. Best I've ever seen on a phone or handheld device. It's large, clear and colorful. In fact, it was so vibrant that I changed the screen mode to \"Natural\" to help mute some of the colors a bit. As a photographer, I can really appreciate this screen for reviewing pictures and doing some quick edits. It's the best compromise between a normal phone and an unwieldy tablet. It's also fantastic as a driving tool. Navigation is a dream to use on the large screen, and I can fit a ton of huge shortcuts on one home screen to safely interact with the phone while driving without ever taking my eyes off the road. In many cases, it's possible to use the tablet version of apps on this device for better functionality. For example, I use the SwiftKey Tablet keyboard rather than the phone version. This gives me a huge split keyboard in landscape mode, with room for arrow keys and other neat features, thereby making two-handed thumb-typing a joy. (note: the tablet version of Photoshop Touch is not available for the Note II, Adobe specifically blocks it. Only the Phone edition is officially available, which is a shame)Can you say fast? This thing is blazing fast. I've got well over 100 apps installed, with at least 30 running in the background at all times. I've got 17 active widgets on 6 home screens, all of which update with online data on a regular basis. The interface never misses a beat, and everything runs smooth as silk. I've run some pretty demanding games (Real Racing 3, Modern Combat 4, etc), and none of them needed any special treatment to run properly.With all those apps and widgets, I was worried battery life would become unbearably short. But that's not the case at all! If I'm using the phone constantly (which I often am), I can get a solid 8 hours out of it. Mind you, this is with constant use of data, heavy graphics, etc, all without ever plugging it in. If I'm just using the phone occasionally for communication tasks and checking updates (like a sane person), then I'm good for about 2 days on a single charge. None of my other Android phones ever lasted much more than a single work day on a charge, so this is a vast improvement.Another very unique aspect of the Note II is the S Pen. Some might dismiss this as a gimmick (I did at first). But after learning to use it efficiently, I now see the S Pen as a revolutionary way to use a phone! Taking notes is quick and easy, regardless of my current task. Using the S Pen to interface with the screen helps prevent the accumulation of dirt and oil on the surface. And swiping on the keyboard is much more precise. I can type quickly and efficiently with the S Pen in a way I never could with my fingers. As proof, I'm writing this review on my Galaxy Note II right now!Some will complain about the Samsung TouchWiz layer on top of the stock Android interface, and I guess they have a right to do so. Samsung imposes some frustrating limitations upon users. For example, the included music player is the default music player, and there's no simple way to change that, even if you have another one installed. If you use the call button on a Bluetooth earpiece, S Voice gets triggered, and again there's no simple way to change that. Then there's all the bloatware that comes pre-installed from both Samsung AND AT&T;, and most of it is complete garbage. Media Hub and Music Hub are useless memory drains that can't be disabled, S Suggest and S Voice are inferior alternatives to what's available on the Google Play Store and can't be removed, and the TouchWiz launcher is sorely lacking many features that can make the Home screens so much more useful.But the beauty of Android is that it's endlessly customizable! There ARE alternatives for all of those crappy included apps. And while I state above that some things can't be disabled or removed, that's not exactly true. If you're willing to root your Galaxy Note II, then the sky's the limit for customization. Rooting this device is unbelievably easy and opens the door to making the device truly your own. I've rooted mine. I'm still running the stock Samsung version of Android on my Note II, but I've gotten rid of all the unwanted bloatware, and replaced the built-in \"default\" apps with my preferred versions from the Google Play Store. My own music player, my own voice command interface, my own launcher, my own lock screen, all without any interference from the Samsung bloatware. No more Media Hub and Music Hub auto-scanning my device and running in the background every time I turn on the phone. In addition, rooting the Note II has allowed me to better secure my phone (Avast! Mobile Security works better on a rooted device, full system backups are now possible, etc). The Note II is a fantastic device as it comes from the factory, but it really becomes the perfect device once it's rooted.The only version of the Note II available from AT&T; is the 16GB edition (in gray and white). I was initially disappointed that the 32GB edition wasn't available, but it turns out that 16GB is more than enough for all my needs. With a 64GB SDXC card installed, there's plenty of room for all 100+ apps that I use, AND all the data they generate. I still have 9GB available on the phone and 35GB on the SDXC card (with over 30GB of music on the SDXC card). I also keep full system backups handy at all times. Turns out the 16GB of onboard flash memory are more than sufficient, and I had nothing to worry about.Have I heaped enough praise on this yet? But wait, there's more! The current official Android version for the Galaxy Note II is 4.1.2, which is a very recent version, even if it's not quite the latest. But apparently the upcoming version of Android (version 5, Key Lime Pie) is scheduled as an update in the near future! This device is getting a lot of attention from Samsung, they're not going to abandon it anytime soon, and that's great news for someone who's looking for a phone that will remain relevant for a while.Yes, it's an expensive phone. And it's larger than most phones. But this device has almost completely replaced my desktop as a daily computing device. It's the best portable computing device I've ever used, and I plan to keep it for a long, long time. Worth every penny.", "Date": "April 3, 2013"}, {"Title": "I love the bigger screen", "Author": "MKL", "ReviewID": "R1VL49YR9NN5FZ", "Overall": "5.0", "Content": "Love the big screen: the size didn't bother me; I always wanted a bigger screen. And once you go big, the smaller aka regular size screen just seemed so confining and comically dwarfish.Love the S pen: I can draw quite well on there. It all depending on the correct apps (autodesk is what I use). Everytime I took out the pen, S note popped up: very useful when taking note while calling or just to jot down stuffs.Love the multitask feature: surfing for TED videos on youtube while GPS navigating! searching internet while watching netlfix!!! surfing internet while reading news!!! I can't get over how much I craved for this feature for so long and never even realized it. This feature is just begging for the bigger screen ;-)I have the Xperia X10 for quite a while, so a lot of the features that I love might be common on android phones in general.", "Date": "June 4, 2013"}, {"Title": "Phabulous!!", "Author": "William J. Schober", "ReviewID": "RONSMMBK48M9U", "Overall": "5.0", "Content": "It's not a Phablet it's Phabulous!It is fast, big and beautiful!Samsung just keeps getting better!Google's Android is nearing perfection!Definitely the best smartphone on the market!!!A Phabulous Phone!!", "Date": "November 18, 2012"}, {"Title": "The best smart phone I have ever owned.", "Author": "Wendy Hunter", "ReviewID": "R2Y2YUPFJAO1RD", "Overall": "5.0", "Content": "Wow, where do I even begin!  I got this Note in white.  I love the color so much.  Great snow white color.  The phone is really large like I expected but I really do love it.  I am a woman so I always have a handbag.  Not sure how guys would go with such a large phone.It's really light!!!  I thought it would be heavier but it's not.  So sharp in screen color.  Sound and color are so crisp!  Videos and photos are amazing and the speed of the device is like nothing I have ever seen.  I got the phone for $239 as I was due for my ATT upgrade.  ATT wanted $299 so thank you Amazon for the savings!!!!", "Date": "April 12, 2013"}, {"Title": "Galaxy Note 2 Review", "Author": "xSTMELVINx", "ReviewID": "R24I3R9H5LTCIJ", "Overall": "4.0", "Content": "Overall, an excellent phone. It has a ton of features and excellent battery life/stand by time even with background downloads. the only problem is that some of the features aren't pre-activated and it takes some time to navigate the menus to find them. the s-voice isn't as good as i was hoping for, but hopefully there are different voice assistants to download and set to default than the samsung voice. ive had the phone for a few days and im satisfied. i would've rated it 5 stars had it not been for the trouble of finding and activating some of the features.", "Date": "December 9, 2012"}, {"Title": "I love my Note II", "Author": "James W", "ReviewID": "R3FMLWJN92BRI", "Overall": "4.0", "Content": "Greetings,  Just got my Note II this week.  Prior to this I had a G2 and a Kindle Fire.  The G2 was too slow to use as a portable PC, and the Kindle Fire required the G2 to tether it for internet access.  Now with the Note II, I have a combination phone / tablet that is more powerful than my desktop at work and at home yet small enough to carry in my pocket.  I am loving it.", "Date": "November 30, 2012"}, {"Title": "Best phone we have ever owned---", "Author": "Christopher Kesling \"McLovin fan\"", "ReviewID": "R1CX4WPXZK8XHV", "Overall": "5.0", "Content": "I have had my Note 2 for six months and it is by far the best phone I have ever owned!!!  My wife has been a die hard Blackberry fan--  she always wanted the keyboard with buttons--  her phone finally died and she just ordered and received the new blackberry q10 as a replacement today---  it was absolutely the worse phone I have ever had to deal with--  we drove to the local AT&T; store and traded it for a new Samsung Note 2--  she loves it!!!  Her fears of using the touch screen are totally not an issue!!!  We both love our phones!!!", "Date": "September 10, 2013"}, {"Title": "great size", "Author": "L. Yacino", "ReviewID": "R22CKNVN4EH54P", "Overall": "5.0", "Content": "This phone is amazing.  Great for the 50 year old eyes.  Lolol. Everyone thinks it is to big but let me tell you it is perfect.", "Date": "August 20, 2013"}, {"Title": "Awesome!!", "Author": "Katie", "ReviewID": "R1YHBQ9W5I4PSJ", "Overall": "5.0", "Content": "This phone is everything I wanted it to be and more. At first I thought the size would be too big, but I love the big screen and it's very light weight. It is also super easy to use. There are so many functions that I haven't even learned yet. It is fun to continue to learn more new things about my phone.", "Date": "August 2, 2013"}, {"Title": "BEST PHONE EVER!!!", "Author": "Cari", "ReviewID": "R3P8H8IJKQLK4T", "Overall": "5.0", "Content": "Best phone ever...LOVE IT!!!!  Too big...? that would be a crazy statement...never too big.  The features are amazing!  I recommend it to everyone...each time I get a Compliment", "Date": "June 24, 2013"}, {"Title": "Galaxy Note 2.", "Author": "larbaugh", "ReviewID": "R3E9TJWZJADWAI", "Overall": "4.0", "Content": "This Samsung galaxy note 2, is a very good product, I had a little bit of worries about the phone when I realized how big it was. I had a Samsung infuse before and I thought it would be a pretty nice phone like the advertising, but it wasn't it always froze, and basically had a mind of its own. And I had a protective case on it, and my grand daughter drop it on her way down the steps, and the screen shattered, its definetly not as strong and durable as it says it is. And this phone is the same way. But other than that, Yes it has its time when it freezes but all phones do, and sometimes the internet on the phone, sucks. But other than that the Galaxy Note2 has nice camera quality, a very efficient and capable battery life. The art on the phone is amazing! And that's all I have really found out about the phone.  -Thanks!(:", "Date": "January 9, 2013"}, {"Title": "good！", "Author": "Wenliang Sun", "ReviewID": "RNHPDG09LGCAU", "Overall": "5.0", "Content": "easy to use, good product! better than i thought. like this cell phone very much. i've use it for 1 month, and it works well.", "Date": "January 29, 2014"}, {"Title": "Wife is in love...", "Author": "zipturtleaz \"zip!\"", "ReviewID": "R3G7YKJY4I18RK", "Overall": "5.0", "Content": "She wanted a new phone despite getting an HTC One VX only a few months ago.  Got her this and moved her phone to her Mother who is on our family plan and everyone is happy.  Not a cool as My note 3 but more affordable for her.  Both are now happy.", "Date": "January 21, 2014"}, {"Title": "samsung galaxy note 2", "Author": "R. Monell", "ReviewID": "R3B7SYKRCKVRQZ", "Overall": "5.0", "Content": "my phone has very helpful features. I love the camera and how I can multi-task. great phone to have for work or pleasure.", "Date": "December 29, 2013"}, {"Title": "Great phone", "Author": "Christopher", "ReviewID": "RBJRN77NAOZT5", "Overall": "5.0", "Content": "everything is great and can't really elaborate on this product any more than what all the other reviews out there have said.", "Date": "December 28, 2013"}, {"Title": "Great phone - rather a great small tablet!", "Author": "Bikash Jajodia", "ReviewID": "RACGH3Y0J0O6F", "Overall": "5.0", "Content": "This phone is just awesome except that the audio quality for voice calls is not up to the mark. Luckliy I have other phones that I can use for that. Other than that, I love it completely. The stylus works great. The word guide while typing is a great help. Many more awesome features.I am glad I made this choice.", "Date": "December 26, 2013"}, {"Title": "so great easy", "Author": "hyunmin park", "ReviewID": "R1YQ845EL00J1Y", "Overall": "5.0", "Content": "Activation is easy. It comes w/ direction. Just follow up directions. Price is $100 or more lower than the retail store.This is my third purchase from amazon wireless. Found no disfunction nor defection.", "Date": "October 15, 2013"}, {"Title": "great phone", "Author": "Danielle N. Metellus", "ReviewID": "R1Q87A5LXKG5Z7", "Overall": "5.0", "Content": "i really like the phone. the screen is an excellent size. i love using the stylist pen. overall experience is great. i hope by the time i'm due for an upgrade there will be another phone like that or better for me. I love big screen phones.", "Date": "October 2, 2013"}, {"Title": "Satisfied", "Author": "Ben", "ReviewID": "R210RT5DW1QPH5", "Overall": "5.0", "Content": "I am very much satisfied with using this phone every day going to school.I can read pdfs all the time on way to school and way back home on much bigger screen.In addition, S-pen handwriting postcard is another fun thing", "Date": "September 23, 2013"}, {"Title": "Bad antenna gets horrible Wifi and LTE reception on ATT network", "Author": "Kimberly L. Estep \"miata71\"", "ReviewID": "R35XSUORB7INKE", "Overall": "2.0", "Content": "I do not recommend this phone for Connecticut users. My husband has a Galaxy S2 that is a couple of years old, and he gets wonderful data signal in our home over the At&T; non-LTE network. My Note 2 only finds the LTE tower and my upload speed is less than 5 megs and download speed is .82 megs. I do not know how to make it find a 3G tower.The Note 2 is much better over Wifi, but its speeds are still half that of the iPhone 4s's that my daughters have.The Android operating system on this phone runs many Google background apps, using up data and battery life. Task manager does not stop them. Maybe they are slowing the phone down, but iphone didn't have this problem.I'm trading it for the new Iphone 5s as soon as the iphone is available.", "Date": "September 10, 2013"}, {"Title": "Best android phone ever!!!", "Author": "Ralph Molina", "ReviewID": "R3L8BHN955C5A3", "Overall": "5.0", "Content": "This is my 5th Samsung product and the best so far. I highly recommend this cell phone, the Samsung Galaxy Note II with all new powerful tools, and the big 5.5 screen with better display than the Iphone. It connects super fast to download all your data at 4G speed. My download even tops more than 25Mbps. I use it mainly to connect online to my college classes.Very happy to have it!!!", "Date": "August 28, 2013"}, {"Title": "Love it Love it Love it!!!!", "Author": "Lee Anne Green", "ReviewID": "R2TJCGPOQ9WQ6S", "Overall": "5.0", "Content": "I am completely happy with my new phone!!  It does more things than I knew and it is wonderful to use!!!", "Date": "August 26, 2013"}, {"Title": "Best phone ever", "Author": "NJshoreKindleMom \"NJshoremom4gurlz\"", "ReviewID": "R2D75MDW91CV2F", "Overall": "5.0", "Content": "I have switched from iPhone, prior to iPhone was blackberry. Those phones are fine, but this is AMAZING.... BLEW ME AWAY. First the speed, it's blazing fast. I have no patience for some electronics and older phones due to the note 2!!! I ONCE WAS SKEPTICAL ABOUT THE SIZE, haha, no... The size is absolutely perfect. If your like me and enjoy your cell phone for photos, reading, occasional you tube and movies.... Games... Whatever you could want to do. This is the phone for you.There is NOTHING, you cannot so with this phone.Battery life... Had been a GODSEND. I have a spare and a car charger just in case. I never needed to swap batteries as of yet. Just a perk to owning any removable back phone.Memory... I LOVE having the ability to load ALLL my pictures, videos, in the SD card along with my books!!! I also have a kindle and can easily and mobi books to my account right through the phone. Kindle and any ereaders.i will enjoy that as well as reading IN THE NOTE ITSELF!!! AT 5 . I LOVE IT!!!AGAIN, the size is perfect. It fits perfect in my hand. I have perfect vision and find myself looking at my last phone as I'd is too small lolThe phone itself operates perfect. Touch wiz performs without a hitch and project butter... I promise that Android is now a SMOOTH EXPERIENCE! MY Husband has the first galaxy phone going back a few years called the captivates and it still works very well ... But this is perfection.The spen, a fun tool to use for many things. I grab pictures, or whatever I wish... Can send to people, or do multiple things with it.I advise watch some you tube videos so you can be assumed at all this phone can do . I'm very happy and now writing this review using the spen with the otterbox defender case:')!!!I'm addicted, hooked, whatever. I've had this phone six months and I'm not even close to being bored.We can easily customize the phone into anything we wish. I am soglad iI bought it.My first phone was white.. I shattered the screen by pulling it bit aware it was plugged into the charger. Now I'm always with one ofmy best cases.My next phone is grey, let me tell you... Both look stunning.The ONLY  thing with this phone, is we need to protect the screen ... Use a case that protects against drops in cement and hard tile floors.I give this phone 5##### stars across the board. Cabt wait for note 3!!!!", "Date": "August 24, 2013"}, {"Title": "Great phone", "Author": "David Reed", "ReviewID": "R2PMP6275H6A7G", "Overall": "5.0", "Content": "I love this phone! It does everything right. All the other androids I've owned I always rooted and installed aftermarket roms but I don't feel like I need to with this phone. AT&T; is ok, better than Sprint but not as good a Verizon but it'll suffice.", "Date": "August 12, 2013"}, {"Title": "Galaxy Note II", "Author": "Sheila", "ReviewID": "RAVGJ68DBN4EO", "Overall": "5.0", "Content": "I love this phone! It's huge but it fits just fine in my hand and my pockets.  It's fast too! I haven't had a single problem with it and I know that this phone has many capabilities I have yet to tap into. I went to a store and the clerk showed me a few fantastic tricks I could do with this phone.  I need to go back and have him train me on these functions.  I love the size of this phone, I can actually see the screen without squinting.  While the Galaxy S4 has a smaller screen size, it is really more advanced but this does everything I could not imagine a phone could do.  Phablet is definitely an accurate description.", "Date": "May 31, 2013"}, {"Title": "A GIFT FOR MY DAUGHTER - SHE LUVS IT", "Author": "jagjean \"jagjean\"", "ReviewID": "R2BJU8CW86Z4W3", "Overall": "5.0", "Content": "I had previously purchased this phone in a different color for myself - I LUV IT!! - My daughter (an IPHONE junkie) saw it, went thru some of the features, and VOILA - a Samsung convert. She begged for 2 months, I caved and got it for her. She's in love! The phone is absolutely phenomenal. It's smarter than my previous Samsung smartphone and sometimes I think, smarter than I am! LOL!!", "Date": "May 28, 2013"}, {"Title": "Galaxy note 2", "Author": "bobbijo", "ReviewID": "R1SGJTQ3AC9U5D", "Overall": "5.0", "Content": "A wonderful piece of equipment looking at others I am happy that I decide to go back go my 1st choice when I was ready to up grade", "Date": "May 19, 2013"}, {"Title": "Incredible phone/tablet", "Author": "rpv", "ReviewID": "R2K76Z44ZGUFT3", "Overall": "5.0", "Content": "When one opens the box, there is a sense of awe. People ask \"Is this really a phone\" was one reaction I got. It is an amazing piece of hardware. I have used Android devices starting from Cupcake version, used iPhone, HP Veer with webOS, Windows 7.5 HTC Titan 2. This phone is the sleekest and one of the best so far. It is fabulous!  I find the big size to be very good and not a problem at all. Will the Galaxy Note 3 be 6\" ?!Out of the box, connect to wireless and get the phone logged into Google account. The advantage of Android phones is that once you are logged into Google universe, everything gets synced up especially if you have been using Android.  The position of power button is at an excellent position for your hand on this Note 2. The additional LED for notification on top is very handy. Listen Apple? The camera serves some really futuristic ideas also. It can check if you are looking at the phone and disable screen lock (even if you set timeout to say 30 sec). Also it can serve as password unlock. Amazing! These can be set from Settings Menu.The Android version as of Oct 26 2012 is Jellybean 4.1.1. Kernel version is 3.0.31-259982. Model GT-N7100. I got the 64 GB microSD card. Get this mobileUltra, it is the latest as of Oct 2012. (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging. Settings show an available space of 59.45 GB. So along with 16 GB built (system shows only around 10.46 GB), my Note 2 has 80 GB memory. With music in the  Google Music cloud, I intent to use the memory for video/pictures as a camcorder/camera.I strongly suggest going through Settings and customizing many things as per your desire. I did Voice Input, Keyboard (this comes with English(UK), change to English(US) for example. Fiddle around the settings and you will be amazed how much you can customize. I also did Battery % to appear in notification bar.One thing I found the default keyboard did not show Mic button. I realized it was next to Sym button. Long press it and choose Mic. And then on, it will appear in default keyboard. Also customize the accent. It can do magic for typing. I type paragraphs at a time effortlessly. This is Google backend servers at work. The Mic on Samsung Galaxy Note 2 does a fantastic job!S-Pen, Ah.. I was truly impressed. You have to use these to believe it. The note taking was very fluid. Samsung seem to have nailed it. I wrote up an equation in Equation mode - x^5 = x^2 + 2x + .... Something completely random, another one d/dx(an equation) and it recognized perfectly and asked it to search, it went to Wolfram Alpha and solved it. It is at first unbelievable and then it starts to sink in this is a computer program made well. Like it should be in first place! Export to pdf is very good. The main thing is the pen is very fluid and feels like a fountain pen writing.Overall, the phone feels very smooth and snappy. The screen is crisp and clear. Apps can even be multi screened. Samsung approved apps can be placed two in a screen. Eg. Maps on top and email on bottom portion. I doubt I will use this, but handy.One gripe I have with this phone is speaker is on the back. Typically if you lie the phone down, the speaker is blocked on bottom. I wish the speakers were in the side. This is a design decision and not sure why phones have speaker on back. But the speaker volume is very high, so I am not complaining too much.One big pain point with Android is once you purchased/downloaded for free Apps, they cannot be permanently deleted. So even if you get a junk app, and delete immediately they are permanently there in your Google Play store. From the phone's play store I got 300+ Apps. One cannot choose 50 apps and say get all these. You have to do one by one. After getting one, the screen resets to beginning. So I went to a computer browser and pushed apps to pone. This is easier and faster.UPDATE: In Jelly bean, you can make the apps vanish from the list entirely. Look at comment #1 from Mark. In the My Apps in settings, at the end of the app there is a circle with a / in middle. Tap on it and confirm to remove. This is great, but if you have a list of 200 apps, you have do this one by one. Also the list resets to beginning after each delete.Some of apps I have as of now :Amazon MobileAndroid Status : Android Status app shows ARMv7, Max Freq 1.6 GHz, BogoMips 1592.52 Memory 1.79 GB, Free 365 MB, Internal Storage 10.46 GB Free 7.18 GB. Total Process running 271! Kernel 159/User 112 Interface has IPv6 as well as IPv4 addressAndroidifyAngry Birds (Space/Seasons)Asphalt 7Amazon App StoreBoxCar Maintenance Reminder ProChromeCNET TVGoogle Currents (nice way to read News)Draw SomethingGoogle DriveEbayFM Radio (needs headphone)LinkedinGoogle MusicOverDrive Media Console: Library eBooks & Audiobooks (public library consumption of media)Microsoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for Android (excellent twitter client)Twit.TvGoogle VoicePlenty of WidgetsAsk questions, the review cannot do justice to Note 2, I find something new always. I will be glad to answer any questions.", "Date": "May 18, 2013"}, {"Title": "Awesome Phone!", "Author": "Love Stageplays", "ReviewID": "R1B12LIIKGO9QL", "Overall": "5.0", "Content": "This is a very smartphone. I enjoy have it as a part of my daily life. It's awesome and very easy to understand. Thanks Amazon.", "Date": "May 3, 2013"}, {"Title": "Samsung galaxy  Is the best to me.", "Author": "sandra mckenzie", "ReviewID": "R23YPEAPU90PMX", "Overall": "5.0", "Content": "To me this is the best NOTE & PHONE AT&T; ever came up with I got one for my boyfriend and he love it if I had to upgrade and they come out with a four and a five I'm sticking with the Samsung galaxy", "Date": "April 16, 2013"}, {"Title": "The Best Phone Ever", "Author": "YesiKen", "ReviewID": "R1QBI9TKC0G4KR", "Overall": "5.0", "Content": "I bought this Phone from Amazon Wireless. It its the best. Shipping was super fast but it didn't have the headphones.  I had to buy my own. Not a big deal. Phone is great. I went from apple iphone to galaxy note and i have no regrets whatsoever.... love my galaxy and i got it for a real good deal. Awesome.", "Date": "March 26, 2013"}, {"Title": "The best", "Author": "Luis C.", "ReviewID": "R2C7UGCVCC8MEN", "Overall": "5.0", "Content": "Love this phone, it rocks. Super fast, love the size and the screen looks great. Glad i made this purchase, plus it was less than the AT&T; website.", "Date": "January 31, 2013"}, {"Title": "LOVE LOVE LOVE!!!!", "Author": "edbal", "ReviewID": "R30YICGKXTLYN6", "Overall": "5.0", "Content": "This phone is amazing!!! nuff said!! Fast as hell, s pen is also useful and easy to use, phone is a bit oversize but trust me you will get use to it as i did in just less than a day. best phone in the market as of 01/10/2013.", "Date": "January 10, 2013"}, {"Title": "This phone is unreliable, poor build quality", "Author": "Anand Daga", "ReviewID": "R5BJ12OOTCRTE", "Overall": "1.0", "Content": "I bought this phone this February and already had a replacement in June. The second replacement is no better - the phone does not retain charge, randomly has freeze issues.", "Date": "October 9, 2013"}, {"Title": "Once you go Note II", "Author": "VVV", "ReviewID": "R1ZIUBARYDG8QV", "Overall": "5.0", "Content": "Used to have an iPhone 4 for 2 years.having experienced Samsung Note 2 for couple weeks, there's really no going back.The screen size is amazing for reading articles online as well as for playing games.Now when i see an iPhone i can't believe i used to read stuff on such a small screen.Android compared to iOS is also an amazing upgrade.  its nice to be able to download thingsright onto your phone without having to go through iTunes.", "Date": "May 15, 2013"}, {"Title": "The Note II is a toy, not a tool.", "Author": "J. W. Rogers", "ReviewID": "R2NNRUEIJSGZMB", "Overall": "2.0", "Content": "I received my Note II straight from AT&T; in late November 2012. I was very pleased with my phone. And then AT&T; updated the firmware. Where I was previously able to use cursive handwriting to enter text, the phone no longer recognizes my 'n's vs. 'm's. The hw recognition while as good as I've seen is still more frustrating than not. Yesterday, I finally ... in a pique of pure frustration from having written the same sentence five times threw the blasted chunk of crud into a wall. The drywall was easily fixed; the phone I plan to smash to bits to protect any data left accessible prior to funerary rites and proper recycling. I do NOT plan to purchase a replacement; nor do I plan to seek quotes on repairing the glass (phone still boots successfully) as I have come to hate the device with great passion.A minor part of my frustration with the Note II was simply the device's size: the Note II isn't quite large enough to replace a small-sized lined note pad: it lacks about an inch to an inch and a half on the diagonal. I suspect the Note 10 tablet would solve this issue; however, I have been poisoned by my previous experiences with an Asus Android Transformer 10.1in tablet and will not purchase another Android tablet for at least 5 years.The largest component of my frustration with the device is the general horror-show that is the dearth of applications for the S-Pen. The default note taking application SNote (whose name is appropriately reminiscent of  South Park's \"SNuke\") is largely garbage. The virtual note taking surface is broken up into pages, which are too short and not of configurable length. Adding a new page requires touching a particular spot on the screen with the S-Pen and breaks writing flow. Of course, these issues could be forgiven were a solid \"pen-to-file-to-OCR\" pipeline included with the application. No OCR software is included with this app, and setting up such a pipeline is not fun. A ribbon-style widget is provided, which never worked even once for me. I found no other note taking applications for the S-Pen.Adding to this frustration is the Samsung keyboard that works with the S-Pen. It's horrible; the recent update made it worse. Previously, I could communicate entirely using cursive sentences which the Note II would --with barely acceptable accuracy-- translate into text. After the update, I was unable to write a single simple sentence the device would recognize. Revising errors using the Note II's interface is an exercise in futility. Editing strokes are routinely mis-identified as symbols and are placed in seemingly random spots, making previously correct text incorrect. There is no Undo history for this process: once an error is introduced, that's it. Nor is there any sort of learning mode or learning tutor with which to actively teach the Note II the meaning of your strokes or correct its 'perception' of continuously mis-identified strokes. Thank you Samsung.No one else seems willing to make a keyboard that takes advantage of the SPen. Nuance's Text9 keyboard is unacceptable as it is stroke-based not sentence or word based.On top of that, the touch pad accuracy is --as I have come to expect from all touch devices-- dismal.Save your money. Buy a less expensive phone & wait 2 - 5 years for the next generation. The Note II simply isn't worth your time and effort as it will never be any better than it is right now. And right now, it stinks. Expect for all bugs and grievances with the device to live on safely ensconced in its lovely plastic form forever. Well... safely ensconced in phones that don't meet with sudden destructive deceleration syndrome (get thrown into walls). Heh.I do not watch video on my device. I rarely have time or inclination to play games anymore. Primarily, I work while awake, and I expect my tools to do likewise. The Note II is a toy, not a tool.I plan to switch to a Galaxy S3 or similar Android device as I own a substantial clutch of Android Apps.  I am tempted to go back to a simple phone & SMS only device, and carry a small Android with me for Email & reading.General gripes with all Android devices:I have no need for another 'toy' or 'almost-there' device. If the manufacturers would continue supporting and upgrading devices for even 5 years, they would be well-worth the purchase price as initial functionality would be the device's guaranteed low-point. However, past experiences with Samsung & Asus lead me to believe that will _never_ be the case. As such, further out than 1yr post-launch, aftermarket ROMs must be used to fix the often many remaining device issues and improve performance. Add to this the fact that manufacturer-released updates are as likely to harm your ability to use the device as they are to fix anything wrong, and perhaps you can understand my ambivalence toward what should be wonderful, fascinating, computing technology and is delivered instead as useless, frustrating, toy garbage. Wake me up when the real technology gets here and is ready for work.", "Date": "February 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A40BOBA"}}