{"Reviews": [{"Title": "GOOD CHEAP DUAL-SIM CELLPHONE BUT NOT FOR EVERYONE", "Author": "Chaz Souder", "ReviewID": "R1G92DOIZKE5VC", "Overall": "3.0", "Content": "I didn't actually bought this phone from Amazon, but from a local provider. Still, I would like to comment on this cellphone, so it can reach the right customers.PROS:Dual Sim factory-unlocked cellphone.FM Radio.Analogic TV (surprisingly good quality, even with the antenna inside the phone).Flaslight.MP3 player.MicroSD card slot (can take 8gb)Big screen (2.4 inches).Bluetooth.Fast device, overall.Reasonable quality for photos taken with this camera.Reasonable quality for videos in 3gp format.Good quality build (although looks cheap and fragile).CONS:No predictive text input (this means: VERY SLOW text typing).Only 50 sms capacity + 40 each sim (this means, you must continuosly erase old messages to make room for new ones).MP3 and FM radio quality like old AM radio stations (don't expect the quality of more expensive cellphones).I would accept most of the cons, but the lack of memory for SMS and lack of predictive text input is a deal-breaker, at least for me.I hope this can help you decide if this phone is actually for you.Regards.En español:En realidad, no compré este teléfono de Amazon, sino de un proveedor local. Aún asi quisiera informar mi experiencia, para que llegue a los compradores correctos:A FAVOR:Célular liberado de fábrica, doble sim card.Radio FM.TV analógica (se ve bastante bien, incluso con la antena sin desplegar).Linterna.Reproductor de MP3.Tarjeta de expánsión de memoria (acepta hasta 8GB, quizás más).Pantalla grande (2.4 pulgadas).Bluetooth.El teléfono es bastante rápido, en general.Calidad razonable en fotos y videos, considerando la resolución de esta cámara.Buena calidad física del teléfono, aunque parece frágil y barato.EN CONTRA:No tiene texto predictivo (asi que hay que presionar tantas veces comos sea necesario cada letra para que vayan apareciendo las palabras, eso significa que ES LENTO ESCRIBIR con este telefono).Sólo le caben 50 mensajes de texto + 40 por cada sim card, ello implica que hay que estar borrando continuamente los mensajes guardados.La calidad de la radio FM y de los MP3 es similar a las antiguas radios AM, no esperen el sonido de un celular de gama media, incluso la mayoria de los de gama baja.Yo estaria dispuesto a aceptar la mayoria de las limitaciones de este telefono por tratarse de un telefono auxiliar, menos la falta de texto predictivo y la escasa capacidad de memoria. Eso si es fatal, al menos en mi caso.Espero que esta reseña le ayude a decidir si este telefono es realmente para usted.Saludos.", "Date": "August 1, 2013"}, {"Title": "simple phone, works internationally", "Author": "preschool mom", "ReviewID": "R34VLLZWB3PEYW", "Overall": "5.0", "Content": "We needed a \"family phone\" for when the kids go out and should be in contact.  This was super - low price, easy to use, and a bonus that it works on international frequencies too.  The display \"insert SIM\" because it's dual confuses everyone, but otherwise it works well and is easy to navigate.", "Date": "June 9, 2013"}, {"Title": "Great spare phone", "Author": "half \"half\"", "ReviewID": "R1YELD0TLQK6E0", "Overall": "5.0", "Content": "For the price, this phone packs features.  It has snappy speed and the user interface is simple enough that my 12-y.o. went through every feature in less than 5 minutes.  It has great feel even in my adult hands, and is sturdy.  The battery life is great, and the camera is also great when you are in a pinch.  The only possible complaint is the little screen, but I am willing to overlook that for the price.", "Date": "March 26, 2013"}, {"Title": "Large buttons easier to use", "Author": "George W. Scott", "ReviewID": "R3L3GX723Y181U", "Overall": "4.0", "Content": "I bought this cell phone because it had buttons instead of the touch screen.  This does make it a lot easier to learn but there is still some difficulty in following the directions from instructions that are printed on a 5x7 piece of paper that folds into a 1 1/2 x 2 1/2 inch sized booklet that fails to explain the use of the phone.  I may have to attend Cell Phone Class to learn how to use my new Blu-Jenny.  George", "Date": "September 19, 2013"}, {"Title": "So far disappointed...", "Author": "Radhika Guru", "ReviewID": "R2NNBFL1QA4NXO", "Overall": "2.0", "Content": "I bought this phone so that I can use it in India during my travel there. I am disappointed because after I landed I inserted a valid prepaid vodafone SIM and nothing happened. I went to the Vodafone store and they were not able to help (they seemed more keen to sell their store inventory to me).I am willing to change my rating - If I can use it. Any help will be greatly appreciated. Thanks.", "Date": "September 12, 2013"}, {"Title": "Littel disappointed", "Author": "patricia mcleod", "ReviewID": "R2MDQJQKTDJ5G6", "Overall": "3.0", "Content": "If you are looking for a really basic phone, this is it.  Good to travel for the dual sim card sense.  As much as this phone has a camera, this does not accept picture messages.  it also does not pull up any addresses from your phone book.  Will keep this phone for outer country travel and for the flashlight purposes, but plan on getting something else.", "Date": "September 12, 2013"}, {"Title": "An interesting phone", "Author": "Izzy", "ReviewID": "R2LO953CHG817I", "Overall": "3.0", "Content": "This is an interesting small phone, I got it for someone who needed an unlocked phone for travel. I was able to easily use this phone, but the person I got it for really struggled with it. The interface is not intuitive, and it takes a lot of getting used to, especially if you're not accustomed to using old cell phones.", "Date": "January 22, 2014"}, {"Title": "blu jenny", "Author": "terry withers", "ReviewID": "R2SY048XPFBV9R", "Overall": "5.0", "Content": "I am very pleased with this product .. it has really exceeded my expectaions . so happy I purchased this", "Date": "November 4, 2013"}, {"Title": "Good cheap phone.", "Author": "Alexander", "ReviewID": "R3K2OAAW33EL3Y", "Overall": "5.0", "Content": "I can use it without any protection. It's cheap!I can answer very fast.It can work more than week w/o charging.", "Date": "October 13, 2013"}, {"Title": "Bad Phone...cheap quality!", "Author": "Shaya M. Seward", "ReviewID": "R36EBSE0T0N8XI", "Overall": "2.0", "Content": "We bought this phone as a cheap backup to the iphone we use as our primary phone. We wanted something where we could pay as we go. Whenever anyone calls, they can't hear you talk because the phone has a really bad connection and produces lots of background noise. I would not recommend this phone.", "Date": "June 24, 2013"}, {"Title": "BLU Jenny T172i Unlocked GSM Phone with Dual SIM, VGA Camera, Video,...", "Author": "Manuel G Idrogo P", "ReviewID": "R208JBHJ2KX5TP", "Overall": "5.0", "Content": "I chose this rate because it seems excellent product.I am satisfied with the product.recommend to all this Produco", "Date": "June 19, 2013"}], "ProductInfo": {"Price": "$49.99", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nGSM 850 / 900 / 1800 / 1900 - SIM 1 & SIM 2 (Dual Standby)\n1.8\" LCD Display; Stereo FM Radio; MP3/MP4 Music Player; Speakerphone\nVGA Camera; Video, Bluetooth v2.1; SMS; Facebook, Twitter; Yahoo, MSN; Flashlight\n16MB ROM, 32MB RAM; microSD card slot for expandable memory up to 8GB", "Name": "BLU Jenny T172i Unlocked GSM Phone with Dual SIM, VGA Camera, Video, Bluetooth, SMS, Social Networking, FM Radio, MP3/MP4 Player, Flashlight and microSD Slot - Blue/Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41SH9%2BrNuDL._SY300_.jpg", "ProductID": "B00AYYJ4YA"}}