{"Reviews": [{"Title": "great but tricky...", "Author": "r.rijkhoff", "ReviewID": "R1EHZRPI4XEVSF", "Overall": "4.0", "Content": "great little machine that emulates several old systems and does google too. But you have to be technical to do it. the emulators provided are in Chinese and get the games from the root and not your sd card. so instead of looking for a solution everywhere, save yourself some trouble, I just bought the emulators I wanted from the google store and all works! great little machine!", "Date": "April 11, 2013"}, {"Title": "good game console", "Author": "girl likes gadgets \"shadow girl\"", "ReviewID": "R3M1JQS9ABBWBD", "Overall": "4.0", "Content": "I like this game because it is like a mini gaming tablet.  I can do email and games on it.  but I did struggle to understand this game at first because I am not that tech savvy. but now its all good", "Date": "May 23, 2014"}, {"Title": "Wonderful Gaming System", "Author": "BuffaloDad", "ReviewID": "RGNS4W2576KRS", "Overall": "5.0", "Content": "This is great to use as a gaming system. You can download just about any android game, app, etc. It definitely is fun and easy to handle. Works great and the controller can be customized to any emulator to play any old/ classic system.", "Date": "March 6, 2014"}, {"Title": "Work out a few bugs and make it more compatible and I'll give it 5 stars", "Author": "jay", "ReviewID": "RKF9APLZJHC8E", "Overall": "3.0", "Content": "This is a cool little gaming console. It plays android games flawlessly. The emulators work well, although I haven't tried the playstation emulators. Movies, music and browsing all work well, or as well as any other android I have ever owned. My main gripe with this is that the device lacks the controls required to make the n64 games very comfortable, and when you change the mappings, it usually don't work or gets glitchy. Also the play store won't let you download many of the other emulators because it says the device is not compatible.", "Date": "November 26, 2013"}, {"Title": "Does take technical knowledge", "Author": "MongoGrubb", "ReviewID": "R38LOMIIY1ULMI", "Overall": "4.0", "Content": "It definitely does take technical knowledge to use this.  I had to re-install google play to get it to work right.It has plenty of horsepower for all app type games.The only con I see in it is the screen can be difficult to activate along the edges due to the lip of the device curling over a portion of the screen.", "Date": "August 31, 2013"}, {"Title": "OK console but...", "Author": "rex", "ReviewID": "R42QU3V2BWX9L", "Overall": "3.0", "Content": "This is an OK console but anyone considering this should look at the JXD s5110b which has MUCH better specifications.  Any of these JXD consoles perform better with custom firmware developed by the community of owners.", "Date": "August 28, 2013"}, {"Title": "5\" 4GB JXD S5110", "Author": "Thomas R. Ally", "ReviewID": "RXRRYHPU4XFVR", "Overall": "5.0", "Content": "Great little device but I would suggest buying some of the emulator apps from the Google play store if you want the best experience :)Was way cheaper then a game-boy DS or any of the usual hand held games and in my opinion it's a lot better. Built more for adults then kids or for older kids that are used to android devices.Everything worked great but I noticed on the Amazon information it says \"Storage: 8GB (Updated from 4GB to 8GB since July 13th,2013)\" but I looked at my storage and it was 4GB and not 8GB like the Amazon page says. I don't mind since I plan on getting a 32 GB card for it but I had to share it since others may not like not having that extra 4GB they were told they would have.Also WiFi works best when closer to the router as it's not as sensitive as my other devices that use WiFi and kept giving me problems until I moved closer to the router and then the device had no problems in loading pages and downloading emulators, etc.Everything works so far for the games I have tried. I may remove one of the free games that came with it called Fishing Joy HD since my virus scanner said it had some sort of ad-ware in it but that may have been a false positive but all the other games passed the test. Also the system came with an English Manual which I was not expecting since everyone complains about the non-English manual as well as a small paper with support instructions as well as a back up CD of all the games that were installed on it as well I think and 2 cables as well as a power supply that worked with my power outlets with no problems.I have not used it much since I am still excited about finding such a device for this cheap that works great for the most part just out of the box. One thing I almost forget was the the N64 emulator I noticed when playing a certain racing game that came with it , there was no button to use the specials in the game after you collected them so I will probably have to remap a button or check the settings for that emulator to get it fully working. Too busy testing it all out to make sure it works like I want to change too many settings at once though.For those that are interested the version of android that came with my game is 4.03 at the moment. Even with the bad info of it supposedly coming with 8GB of memory and not 4GB like it did I would definitely order one of these again as for what I use it for it does what I want.", "Date": "October 11, 2013"}, {"Title": "EXCELLENT PRODUCT AND SELLER", "Author": "freemaiden", "ReviewID": "R34QQSBSD7ALWA", "Overall": "5.0", "Content": "I purchased this device for a friend, he has enjoyed nearly every minute he uses it! The Seller, \"Yosemite Dave\" was willing to jump major hurdles when the device had a freak issue(it turned out to be an easy fix). All things considered, only \"complaint\" was the chinese charger(hint:USE THE USB INSTEAD!).", "Date": "July 23, 2013"}, {"Title": "Wifi didn't work", "Author": "Bly", "ReviewID": "R3RN2P8V4FYQY7", "Overall": "1.0", "Content": "Waited the 3-4 weeks for this game console to come in for my son's Birthday. It arrived on time and was shipped as promised. The problem with this game system was the wi fi not working, did all that comapny said to do to put back to factory default. It showed that the wifi was working when in fact it would not. I tried turning wi fi on at different places just to see if it was my home network. It wasn't. Company did refund my money. My son had wanted this because a friend of his had one which was a later model. He was Truly disappointed for his Birthday when he couldn't down load the pre loaded games due to no wi fi!!!", "Date": "June 4, 2013"}], "ProductInfo": {"Price": "$89.90", "Features": null, "Name": "5\" 4GB JXD S5110 Capacitive Game Console 5inch Cortex A9 1GHz DDR3 512MB Android 4.0 Tablet PC Wifi TV-out HDMI OTG Support lots of Games - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/414%2B8WlbuKL._SY300_.jpg", "ProductID": "B00ASHURMQ"}}