{"Reviews": [{"Title": "All Set and Ready to Go, this will be FUN", "Author": "Hombre Wells \"Fix-It Man\"", "ReviewID": "R3PQF6Q9SR1FT7", "Overall": "1.0", "Content": "Not able to figure out how to turn it on is a non starter for most people but I do like a challenge.  The instructions do say to push the power button but the image of the phone does not indicate which is the power button.  So, I try the typical Power Buttons to no avail. Perhaps, in My haste the full charge was not achieved and thus as a bonus feature keeps the phone from booting up.  I will be back to report on this, seeing as I am a pioneering poster on what should be a splendid product. Dual Sims! Quad band! for less than 50 bucks, get outta here.......Plus, I am furthering my language skills with some magnificent ChingLish training. I am begin to start think in this manner complete.update 1: well, not even going to get off the blocks.  Never powered up. Searched for Power Up button and nada, except a user posing the same question on one of those fix ya type sites and we know where that leads..  So, I have sadly requested a return due to defective.  I was so looking forward to deciphering the instructions and menu.  It almost makes me think the big US cell monopolies are putting a squish on these products in order to stop the proliferation.  I mean really, how hard would it be to tamp down the enthusiasm by putting a few up on amazon and generating a bunch of whiners?  hmmmmUPDATE 2: Battery spin test completed and the results are that it spins like a top and looks like a feather pillow.  Thus, indications are that what otherwise be a fine phone is being sent with a bad battery.  Now, I wonder why would this happen.  My guess is that the battery is labeled SVP meaning they bought some really cheap ones that crapped out at the get go...  I would be willing to keep the product(phone) and but the battery cost localy are around 30 bucks and some 9 dollar ones from china.  It is a BL-4d batt which fits the Nokia97 mini and others.  It seems to be a very popular battery.  I so want this phone to work because of the qwerty feature...  But my UPS pick up order for return has been requested....  At least other Amazonians will have something to read...  and maybe, the seller will send me a battery and I will keep it and give them a big HOORAY ATTABOY.Update 3; Battery Bird Doggin it.  The CLKBP4L by Lenmar seems to be a replacement and it is 10 bucks plus shipping via Buy.  If I can get one in for 10 buck all inclusive, I may give it a go. But Monday the brown man will be here for the box, so the pressure is on....Update 4; Found a battery for $4.50 on ebay with free shipping and the seller has 97% rating with thousands of transactions. So, this will be a test to see if indeed the battery is the faulty link.  I have requested a delay from Amazon on the UPS pickup for return.  Hopefully the driver will not show up for a wasted effort.  Now, I will say it was a learning moment surveying the phone replacement battery arena.  Visited two retailers who specialize in ALL battery types.  Perhaps you have seen the new stores popping up.  Well, you would think I was asking for a battery for a secret space mission.  One gave up and the other can get it for 39 dollars... Both stores had a wall rack of phone batteries, too at very high prices..Update 5:  Excellent, received a reply from SVP, the mfr, concerning problem and willingness to resolve.  However, in trying to reply to email, it Bounces and thus responding here.. They appear to be offering to help find a battery. encouraging, indeed.", "Date": "October 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A3XC71O"}}