{"Reviews": [{"Title": "Strange AC Adapter", "Author": "Shark88", "ReviewID": "R1HKRQ1YG8HCLA", "Overall": "2.0", "Content": "This phone is unbranded, but it shipped with an ac adapter that is unlike any I have seen before.  The prongs are at an angle.  Not sure which country has these type of outlet, but I have about 15 assorted adapters and none will work with the provided AC adapter.  Also, I cannot get the phone to work on my wireless router.  It will connect, but the connection drops immediately.  It was a gift, so I hope she likes the phone.  If it was for me I would have returned the item.", "Date": "May 19, 2013"}, {"Title": "A+ phone", "Author": "Shirlan", "ReviewID": "R1K8C8OWUX86NN", "Overall": "5.0", "Content": "Loaded my SIM card and charged up the phone, it works and the price is definitely right. I have no complains.", "Date": "January 27, 2014"}], "ProductInfo": {"Price": "$97.98", "Features": "This unlocked Cell Phone is compatible with GSM carriers like AT&T; and T-Mobile. Not all carrier features may be supported. It will not work with CDMA carriers like Verizon Wireless, Alltel and Sprint.\nUnlocked Quad-Band GSM cell phone compatible with 2G Network 850/900/1800/1900MHz frequencies and 3G Network HSDPA 900/2100MHz frequencies plus GPRS/EDGE data capabilities.\n2MP Camera with Geo-tagging; 3.0\" TFT Capacitive Touchscreen, 256K colors, with TouchWiz UI and Touch sensitive controls; GPS with A-GPS support; Stereo FM radio with RDS; MicroSD Card Slot expendable up to 32GB; MP3 and MP4 Player and Social Networking.\nAndroid OS, v2.3.5 (Gingerbread); CPU 830 MHz ARMv6; Wi-Fi 802.11 b/g/n, Hotspot functionality; Bluetooth; Speed HSDPA, 7.2 Mbps; 3.5mm Audio Jack; Accelerometer, proximity and compass Sensors; Java MIDP 2.1 and Quickoffice document viewer.\nTalk time Up to 17 h (2G)/Up to 6 h 20 min (3G)- Standby Up to 850 h (2G)/Up to 540 h (3G).", "Name": "Samsung Galaxy Y GT-S5360T Pink GPS Unlocked International Version GSM Android Smartphone", "ImgURL": "http://ecx.images-amazon.com/images/I/41li4hutofL._SY300_.jpg", "ProductID": "B00AH5PQ02"}}