{"Reviews": [{"Title": "Clamshell Phone", "Author": "Honesty", "ReviewID": "R1ZKKN7USFOWHB", "Overall": "5.0", "Content": "I bought this phone for my mother in law. She needed something inexpensive, simple, basic, and visible. When she received it I helped her via phone to activate it with Sprint. It took a while, but we accomplished the activation. She says the phone is very sturdy and easy to use. She seems to enjoy her new phone. So, that makes me happy. I would definitely recommend it to others..", "Date": "April 22, 2013"}, {"Title": "duramax", "Author": "mkanatzer", "ReviewID": "RN4DN3EBY980V", "Overall": "5.0", "Content": "I order this got it with in 3 days. took it to a sprint store to have it added to my acct. works great no problems at all.", "Date": "September 2, 2013"}, {"Title": "Great", "Author": "Bori Lenard", "ReviewID": "R2AQ2LGX1Y874E", "Overall": "5.0", "Content": "Great starter phone worth the money. Very reasonable in price and is also very durable.  Would by one for every one.", "Date": "April 24, 2013"}, {"Title": "I bought this to replace my smart phone and it exceeds my expectations", "Author": "Ryan Roberg", "ReviewID": "R3BXPQ4RJPBEDE", "Overall": "5.0", "Content": "I bought this clamshell phone from Sprint on amazon.com about a month ago and I have to say it is the best phone I've ever bought even being a first time buying a cell phone from amazon.com this phone has met my expectations it says on amazon.com the battery life is about 2 hours I'm getting almost a week battery life out of it is pretty darn good considering the fact that it says you can only get an average of two hours it feels solid in the hands as a very good rubber grip to it. the camera on this clamshell phone is somewhat decent but its account what's up that's not going to be like a Samsung Galaxy Tab on ipad its just a basic camera on a flip phone. there is nothing negative about this flip phone from kyocera obviously they do make very good cell phone of this model nice job kyocera.", "Date": "December 3, 2013"}, {"Title": "Really Good!", "Author": "ChaseMorrison1", "ReviewID": "R1RNQ9QGLFABO4", "Overall": "5.0", "Content": "Order two phones and received them three days later. Phones where in excellent condition with battery and mini sd card. Only thing is I did not receive either chargers for phones, but i will let people know for the prices of these phones they are in the best shape just like they came out the box and i am glad i gave this company a chance.", "Date": "October 22, 2013"}, {"Title": "I bought two", "Author": "Kathy", "ReviewID": "RTVZ3R0SZZOGV", "Overall": "5.0", "Content": "I got two of these because they are rugged and built for a little more abuse than a normal phone.  They are used by pre-teens, and so far I am quite pleased.", "Date": "October 9, 2013"}, {"Title": "Kyocera Duramax", "Author": "None", "ReviewID": "R2XAJBM567ML5S", "Overall": "5.0", "Content": "I wish I could buy another one at the same great price I bought this one.  Actually I bought two from different sellers.  Both were as represented.", "Date": "May 28, 2013"}, {"Title": "Great phone but even better this store!!!!", "Author": "Danny boy", "ReviewID": "R3QO3BC20PV7LC", "Overall": "5.0", "Content": "For what this phone purports itself to be, a reliable phone for voice and Direct Connect (DC) that can take extreme abuse, I am very pleased. The voice quality is clear, the external speaker is nice and loud, the screen for a basic phone is exceptionally crisp (above standard flip phones), DC works nice with an option to quick connect to your favorite contact or group, you can have phone closed and use like a walkie talkie with the DC. The numerical keys are nice and big and easy to use layout. Texting is to be expected with a basic feature phone, it has T9 and several other options of saved quick messages. The batter life is good, considering it has the GPS on the whole time, and the DC radios as well as the cell voice. I averaged about two days with moderately light use before charging. The phones were in great condition, the charger was included and the batteries seem to have the robustness to hold the full charge. Now here's one incentive that's worth noting; the store Phone Zone is top notch service. I received my order in 2 days express USPS (and that was with free shipping!!!) I was sent a wrong phone model among the three DuraMax phones I ordered, but after contacting the store, Phone Zone, I received a reply the same day assuring me that the model I ordered was shipped out immediately to exchange the wrong model sent. I received that in 2 days, along with a self addressed prepaid postage to mail back USPS the wrong item sent. I'm very pleased with this store and will buy other phones from this reliable store.", "Date": "August 29, 2013"}, {"Title": "Perfect for construction", "Author": "Alfred Kocovic", "ReviewID": "R1A0WEQVNFOHTD", "Overall": "4.0", "Content": "Perfect for construction. I would have bought two but one really gets the job done. All in all, a good phone", "Date": "March 10, 2014"}, {"Title": "The best", "Author": "Juan Aguilar", "ReviewID": "R2MI7YBQEAEPHY", "Overall": "5.0", "Content": "I chose to rate it to five stars because it is a wonderful phone and it has many features .", "Date": "March 2, 2014"}, {"Title": "Late but Great", "Author": "Kaydee Smith", "ReviewID": "RQ7WO12WYOVL7", "Overall": "5.0", "Content": "The phone didn't get here till like two weeks after the last estimated date, which was disappointing. But none the less, it still came and even though it said it was used it was still in perfect condition. It's just a great deal in general for the money you spend.", "Date": "February 9, 2014"}, {"Title": "Birthday gift for him.", "Author": "Angela Leonard", "ReviewID": "R2551Z5X760H7Z", "Overall": "5.0", "Content": "I ordered this as a birthday gift.when we first switched to Sprint they didn't have any of these phones in the store.He was very unhappy with the phone they gave him.Now he's happy,and it's cheaper than the one at the Sprint store.No problems at all with activation or anything......Happy,Happy,Happy!!!!!!!!!!!", "Date": "February 2, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AWVM0DW"}}