{"Reviews": [{"Title": "Great Phone for the Money", "Author": "CL", "ReviewID": "R3A4SDX123VAPM", "Overall": "4.0", "Content": "I like the phone.  It works great.  I cant figure out how to get the internet on my phone but that is the least important to me.  I have the internet at home.  I bought it because it fits T-Mobile SIMS cards and wanted a querty keyboard.  Cant beat this phone for the price.  I recommend getting a cover at the same time.", "Date": "March 12, 2013"}, {"Title": "it's okay", "Author": "Francis Mensah", "ReviewID": "R1ZQINWJGJHM5V", "Overall": "3.0", "Content": "I like  the phone ,  work perfectly well and exactly as i expected . The delivered was on time  too and recommend to anyone who is looking for a  simple phone to use", "Date": "July 6, 2013"}, {"Title": "What I expected", "Author": "Melissa Cable", "ReviewID": "R3T2MR8WS5AGEZ", "Overall": "3.0", "Content": "I purchased this camera for my daughter as her first phone.  I didn't want anything fancy, and that's exactly what this is.  She can call and text, and thats all she needs it for.  I would recommend this phone as a first-time phone for a child.  However, if you want to be able to spy on your kid, this is not the phone for you.  The texts done link into a conversation, and the storage is small, so after about 70 text messages (sent or received) it's full and you need to delete them.  The camera is not good - I got what I paid for and what I excpected to get.", "Date": "June 3, 2013"}, {"Title": "don,t buy it..", "Author": "k & J", "ReviewID": "R3M77V1P7UBSZP", "Overall": "1.0", "Content": "want to wash your money. buy this one.  just  one week used it.  i need go to best-buy buy other phone.", "Date": "October 25, 2013"}, {"Title": "You get your  money's worth,  no less no more.", "Author": "Nicole", "ReviewID": "R2Q1S0720C33J6", "Overall": "3.0", "Content": "Does what a phone should. Call, text -  and that's about it. All its missing is the snake game, and you'd have a lighter version of the throwback Nokia phone everyone used to have in 2000.", "Date": "October 11, 2013"}, {"Title": "not used", "Author": "gt", "ReviewID": "R1G3869X2RWBON", "Overall": "3.0", "Content": "purchased for use in Europe but never could find a sim card for each country keyboard is small but complete", "Date": "July 12, 2013"}, {"Title": "Sencillo y Económico", "Author": "Rogmel A. Cubiro V", "ReviewID": "R1PEX6PB6DP1CS", "Overall": "4.0", "Content": "Es un teléfono que posee las funciones básicas ademas de ser compatible con internet móvil y todas las operadoras por ser cuatribanda.", "Date": "March 21, 2013"}], "ProductInfo": {"Price": "$36.99", "Features": "Unlocked Quad-Band GSM phone compatible with 850/900/1800/1900 MHz frequencies (both SIMs) plus GPRS data capabilities.\nVGA Camera with a QWERTY Keyboard for Social Networks: Facebook, Twitter, MSN, Yahoo\n3.5mm Audio Jack, FM Radio, MP3 Player, MP4 Player", "Name": "BLU Q53i-VLT Samba JR Plus Quadband Phone with QWERTY Keypad, Camera, Bluetooth and Facebook - US Warranty - Violet", "ImgURL": "http://ecx.images-amazon.com/images/I/41YtsuIvMCL._SY300_.jpg", "ProductID": "B00AA6WRF0"}}