{"Reviews": [{"Title": "Does not work on PagePlus as advertised", "Author": "Nicholas", "ReviewID": "R3HJK47D2Z9ABA", "Overall": "2.0", "Content": "Let me start by saying I think this phone is an excellent product.  However, the title which states the phone is flashed to PagePlus is not correct. What you get is a Verizon prepaid phone ready to activate on their network.  I am an existing PagePlus customer and confirmed with them that currently all prepaid Verizon phones are banned on the Pageplus network which is a shame as I really like this combination.As always, Amazon's excellent customer service resolved the situation promptly and efficiently - thank you Amazon.", "Date": "February 5, 2013"}, {"Title": "Nice phone but...", "Author": "J. Mahun", "ReviewID": "R6S2ISEWTTSSQ", "Overall": "4.0", "Content": "It's a nice phone with all the basic features I want. It was a branded previous model that no longer is available from my wirelss provider (who doesn't believe in basic phoines anymore). Unfortunately this is a pre-paid phone. I was specifically avoiding pre-paid phones because most can't be used on a wireless contract. I carefully checked the ad which didn't say this was a pre-paid phone and said something to the effect of \"easily activated.\" I purchased on the assumption it would workIt didn't - it wouldn't activate. My wireless provider said the phone would have to be used for 6 months as a pre-paid before I could use it on my service (I couldn't just wait 6 months, I had to used it for 6 months).Anyway, I contact the seller and explained the situation. They were very understanding and accommodating. I was immediately sent a prepaid shipping label and got a refund within a few days. The refund was for the purchase price and shipping. Since the return label was prepaid, the whole ordeal only cost me time and for that I blame my service provider.The seller offered help when I asked for it, treated me courteously, and made the return as easy as possible. I wouldn't hesitate going back to this seller in the future should I decide to confront the wireless demon one more time.", "Date": "May 2, 2013"}, {"Title": "Not the phone described", "Author": "bwnr", "ReviewID": "RSVLRBLBR78P6", "Overall": "3.0", "Content": "The description of this phone does not show it as a pre-paid phone.  I was hoping to replace a broken phone on contract, but this phone arrived and cannot be added to my plan. Disappointed with description.The phone, itself, is good for basic users.  I currently use one.", "Date": "April 18, 2013"}, {"Title": "Incomplete Description", "Author": "Adrian Bostic", "ReviewID": "RH6DVRYF29NUX", "Overall": "1.0", "Content": "I purchased several of these phones and recieved them brand new in the package, however I didnt realizeat the time that they could only be used on prepaid accounts when I have a postpaid account. Nowhere in the product desciption was this ever mentioned. I still tried to use the phones but found out eventually that it had to be used as a prepaid device for at least six months before it could be transfered to a postpaid account. These phones are still collecting dust and I have not recieved any interest from anyone wanting to buy a prepaid flip phone.", "Date": "October 3, 2013"}, {"Title": "The carrier expectations didn't meet my own.", "Author": "Joseph Drawbond", "ReviewID": "R1C214CZ1H6GVN", "Overall": "2.0", "Content": "I bought this phone to replace a Verizon phone that was previously lost. what I didn't know is that Verizon has the phone set so that if you buy this prepaid phone it must be on a prepaid plan for at least six months before it can be transferred to another contract. It would be a great phone for someone who doesn't spend much time on a cell phone.", "Date": "September 20, 2013"}, {"Title": "Was no as advertised", "Author": "Marion ison", "ReviewID": "R24MNW27KJSG2J", "Overall": "2.0", "Content": "This was a pre pay phone that was advertised that you could use also as post pay phone but according to Verizon this no so also saw them at Walmart for ten dollars less so I will just chunk it", "Date": "September 13, 2013"}, {"Title": "Phone", "Author": "Mary Closs", "ReviewID": "R25IXYYRVRIRSV", "Overall": "3.0", "Content": "this phone was ordered to replace the old one my father in law had. He washed it in the laundry so we got him this one to replace it but was unable to use it because verizion would not let us use it because it was pay as you go?? do not understand all of that stuff but we are holding on to it for back up until we switch.", "Date": "September 6, 2013"}, {"Title": "Disappointing phone", "Author": "Linda White", "ReviewID": "RY8PBGWF3TOJV", "Overall": "1.0", "Content": "This refurbished phone was a disappointment because it kept turning itself off. We are returning it. We were hoping it would live up to its year long warrany.", "Date": "September 1, 2013"}, {"Title": "Did not work", "Author": "lablack49", "ReviewID": "RCCKZ2U5UCG57", "Overall": "3.0", "Content": "The phone was nice but would not work on Verizon contract. It was prepaid only. Had to negotiate with them for a different phone.", "Date": "May 16, 2013"}, {"Title": "Prepaid phone", "Author": "Jane \"What I was sure of years ago, I do not ...", "ReviewID": "RRJQSO6G6R1RS", "Overall": "1.0", "Content": "This phone was a prepaid phone but was not advertised as prepaid.  We could not use it with our current plan.", "Date": "June 7, 2014"}, {"Title": "sorry but sending back", "Author": "Ann Balcerzak", "ReviewID": "R1C7O7CSCFDDWN", "Overall": "1.0", "Content": "Could not use.pre pay phone..not with my contract with Verizon..they would not activate. Sending back this and got the exact same phone from local Verizon store.", "Date": "April 16, 2014"}, {"Title": "track phone", "Author": "Joe Reister", "ReviewID": "RUC3WAFEWSF8C", "Overall": "1.0", "Content": "I did not need a track phone and that is what I received. the description did not point this out clearly enough for me and I missed it as well. the phone is no good for me or for what I needed it for.", "Date": "April 7, 2014"}, {"Title": "Works good.", "Author": "keith", "ReviewID": "R78A7VOM10P0F", "Overall": "5.0", "Content": "Gave to my grandma she says it real easy to use. That alone makes my life better. And hers easier.", "Date": "January 21, 2014"}, {"Title": "It does what it's designed to do!", "Author": "Meghan", "ReviewID": "R2MRR3DFWXGT1K", "Overall": "3.0", "Content": "A cheap phone that works, but has a few annoying design issues. The first thing is that, if you're texting on this phone, when you're done typing a word, you can't go back and change it (i.e. if you typed \"mothers\" instead of \"movies\" in T9 and pressed space before realizing your mistake, you'll have to delete the whole word and type it again--you can't just go back and change it...this is more annoying than you'd think!) The second thing is the ads. I don't know why, maybe it's just my plan or something, but this phone pops up full screen ads several times a day. They're also more annoying than you'd think.Other than that, it's a cheap, fairly reliable, and fairly good phone.", "Date": "December 29, 2013"}, {"Title": "Didn't do the job", "Author": "Sondra Powers", "ReviewID": "R2E2E193ZHO15M", "Overall": "2.0", "Content": "It was not listed as a prepaid phone.Couldn't activate it at Verizon. I wound up having to purchase another phone anyway and couldn't return it.", "Date": "December 18, 2013"}, {"Title": "4 star", "Author": "julie m. bibeau", "ReviewID": "R1RODICSBUIFO7", "Overall": "4.0", "Content": "Love these types of phones, arrived in good time. It was just hard to find one to buy and for an old type of phone it was pricey.", "Date": "December 15, 2013"}, {"Title": "Did not work for me", "Author": "S. Derge \"nana214\"", "ReviewID": "R1OGHHWHVEOWGS", "Overall": "1.0", "Content": "Did not work out for me as I could not port it over to my Verizon service. Apparently it can only work in a certain prepaid plan, I don't know, maybe Walmart can do it???", "Date": "December 3, 2013"}, {"Title": "basic", "Author": "Donna J. Clay \"k&j; mama\"", "ReviewID": "RMLOF8WGWC63W", "Overall": "4.0", "Content": "not fancy, just needed a phone... basic, sturdy, etc. not a lot of doo dads to it, but its simple and sturdy.", "Date": "December 2, 2013"}, {"Title": "PRE-PAID CARD PROBLEMS", "Author": "MICHAEL C.", "ReviewID": "R1XPDOKZ18YMG5", "Overall": "1.0", "Content": "Okay, I understand I must purchase a phone card in an amount of my choosing but what I don't understand is that after you have tried to add this card to your balance, and fail on the third attempt you are locked out. Also what is not told to anybody , you need to wait 15-30 mins before trying each time to add. So your phone has locked you out of the system. No problem ,I'll call customer service and they will help me. The message is repeated ; I'm sorry all our lines are busy please wait for the next available operator. That is if you get pass the automated unit which is not a real person. Maybe on your 3rd or 4th try you will be connected with a real person. Now lets get back to the actual card, it my not work in the first place since we have been having problems with them a lot says the cashier at Walmart. Oh great, here's my 100.00 for a card that my not work. I asked my stupid question next, well what if it does not work -can I get my money back ? No sir once you scratch off the pin number we can not refund your money... You might try Verizon's customer service to see if they could help you. After reaching Verizon's operator and running through what has happened so far - 2hours later they finally successfully add 100.00 to my account balance.  Their final words are if we can be of any further assistance just call anytime. At this present time I've had problems with 7 cards of variable amounts and will be looking for a contracted carrier soon; better services , better connections and less time wasted. Thank you for reading my review.", "Date": "November 7, 2013"}, {"Title": "Love it.", "Author": "Ernie", "ReviewID": "R3E2XNOMS6Q1LQ", "Overall": "5.0", "Content": "As an older man , I wanted a flip phone  with big numbers and letters.  Also wanted one that did not pocket dial!!", "Date": "September 20, 2013"}, {"Title": "Love it!", "Author": "stargazer16", "ReviewID": "R1C9MY92F1PAWI", "Overall": "5.0", "Content": "It's just the phone I was looking for without the bells and whistles, clear calls and no drops btw I have Verizon Wireless in NYC.", "Date": "August 13, 2013"}, {"Title": "works great", "Author": "snowfrey", "ReviewID": "RCGBJ3NJMXTDB", "Overall": "5.0", "Content": "Phone works as advertised. It was just what the buyer was looking for as far as a phone goes. Works great.", "Date": "July 13, 2013"}, {"Title": "CAUTION for non-Verizon users", "Author": "John R. Jago", "ReviewID": "R1Z5HNQSJ06RAA", "Overall": "3.0", "Content": "For a very basic cell phone this will satisfy.  You are not buying this phone to surf the web!BUT since it doesn't have a slot for a memory card, you will not be able to transfer any pictures you take directly to your PC.  If you are a Verizon user, they have a back-up feature that will help.  BUT for non-Verizon users, e.g. PagePlus,  the work-around would be to send pictures one by one to another cell phone that is capable of transferring them to a PC.BTW you can use Bluetooth to transfer your contacts to/from another Bluetooth capable cellphone that accepts V-card info.", "Date": "July 6, 2013"}, {"Title": "Fit my needs nicely.", "Author": "Henry Gardiner", "ReviewID": "R2988ZN43RQH0C", "Overall": "5.0", "Content": "The vendor was prompt.I'm 63 and I used this cellphone as my first ever cellphone for a one-week trip to the Connecticut coast with a Verizon on-line $15 pre-paid arrangement costing $1 per day of use and 25 cents per call.  (Walmart.com)  The cellphone worked with total reliability, almost perfect coverage and good audio quality.  As a former tech, I am still astounded by the technology in this unit and particularly by the standby battery life considering how small the battery is. I can't read a paperback book without glasses but I could read the cellphone display and buttons adequately without glasses.There is a limited web browsing capability but I didn't use it.I was able to use the unit without perusal of documentation beyond that provided.  Older first-time cellphone users would be wise to practice a bit before answering the first call while merging onto I95 in Providence like I did...  Also, perhaps there are resouces on the web like \"cellphones for dummies\" that explain things in an easily absorbed manner.  However, it is not equivalent to a Jitterbug cellphone in button and display size or menu simplicity and would be problematic for people with Alzheimer's .I am very happy with the unit.  I hated to put it away after the trip and return to the landline.", "Date": "July 17, 2013"}, {"Title": "VERY \"basic\" pos cell phone from ten-fifteen years ago. Functions w/ Verizon. Kinda sucks, ok in a pinch.", "Author": "Lavender Lace \"Anonymouse\"", "ReviewID": "RZOIIOKEHYQ3O", "Overall": "1.0", "Content": "Verizon sold me this plastic POS for $50. Functions. Considering that its 2013, this cell phone pretty much sucks. its barely below-average, requires 1 1/2 minutes, literally, to \"connect\" to internet. Omg. $49.95 \"on sale\"! @ Verizon store. Total bs. My home phone and republic wireless cell stopped working today, wiley Verizon MISrepresentarive flat out lied to me about how adequate this phone is with their no-contract, $50.00/ month plus addtl $9.99 per month Navigator (directions) service= $60./ month. NOT worth it. There is no contract, so I will flush this plastic pos cell phone when i get another cell service with a cell company who cares...or at least who will only lie on paper, not to my face. FACT: My 90 year old father has this same phone from years ago. Its great for a 90 year old who is frightened of technology, has big buttons and fifteen year old technology. If you're really adventurous, u can take a hammer to this cell phone, buy a real cell phone that actually connects to the internet. This Verizon phone does not allow u to access internet, except directly to Verizon account to check your minutes. Omg, do yourself a huge favor, do not buy this phone! Do not use Verizon contract service. Go to Walmart or other and buy throw away cell phone. Its a better cell phone. Seriously.", "Date": "July 13, 2013"}], "ProductInfo": {"Price": "$34.75", "Features": "This is a PREPAID CELL PHONE. IT IS ONLY USE FOR VERIZON PREPAID PLAN\nThis cell phone won't work on Verizion Contract", "Name": "Samsung SCH-U365 Gusto 2- Verizon Prepaid", "ImgURL": "http://ecx.images-amazon.com/images/I/41E5pN4rCtL._SX300_.jpg", "ProductID": "B00AH0OLV2"}}