{"Reviews": [{"Title": "I like it so far!!!", "Author": "Nana Baffour", "ReviewID": "R1G67T2N62DLP5", "Overall": "4.0", "Content": "Personally I like the itself my self but other hand I sent the phone to Ghana my country Africa but so far they haven't told me anything about it yet so I guess it working fine for now but at appropriate time if anything comes out I promise I will let you guys know so please hang in there for now. There is another thing I need to comment on, I know usually when you buy new phone it normally comes with some plastic form of screen protector but this particular phone there was nothing so I recommend next time you guys should find way to cover the screen so there would be no scratching whiles trying to access it. Thanks I really like it so far!!!", "Date": "September 3, 2013"}, {"Title": "A straight forward phone with lovely interface and functionality, not the primary computer to do everything with though.", "Author": "Christian R. Unger", "ReviewID": "R2E0AVE02NKP2C", "Overall": "4.0", "Content": "The big elephant in the room is that this device is running Windows Phone 7, upgradeable to 7.8 which is what is running on mine. That was not the elephant but rather that there are no apps for Windows Phone, and as a result that this phone (as all other Windows Phones) MUST be useless.First up, that's untrue. Although it is true that there is a limitation of apps on Windows Phone, the range of apps available does not appear to me to be lacking. YES, it's not like the iPhone/iPad eco system, but switching from Android to Windows Phone did not really highlight any deficiencies. I don't know why, but I very consistently failed to find what I wanted for Android, sure things there are getting better, but so are they here. Also, in fairness, I don't use my phone for much other than ... phone things, to me: Calls, Messaging, Email, Camera, Calendar, Contacts, some light web browsing and that is about it.The biggest problem the Lumia 610 has is not that it is a entry level phone, with response times generally being fine (there are slow downs, but overall the variance is minor) and it isn't that the lack of RAM (only 256MB) means some apps won't work (Skype being the biggest issue). No, the biggest problem is my home router: it fails to reconnect the phone when it comes out of stand-by and given that everything else keeps working it strikes me that it has to be an issue with the phone. Also, it works just fine on more expensive kit at work, so there is some clash there, and maybe investigate if there are issues known for your home router.Another issue, very reminiscent of iPhone actually, is that there is a lack of good messsage notification sounds and Windows Phone does not allow you to customise those. You can select 10 sounds or so, but only 2 seem popular so at work when a message arrives for someone, we all reach for our phones of various generations of Lumia, both Windows 7 and 8.Oh and one last bad point: search. Firstly, Bing, last time I searched for \"What are baby geese called\" and it returned me NSFW tips about women which would not even have resulted in a baby ... so not sure what Bing did there, and it doesn't do it from Firefox on my PC. Secondly, the search button is badly positioned and gets touched by accident far too often, tapping back takes you back to where you were, but even though response time is consistent generally it isn't fast, so that is a bit of a drag especially when using the camera (which is overall slow to start).So, those would be the bad points. The good: the screen is lovely and functional, a massive step up from my previous Galaxy Fit, and compares fine to iPhone 3GS and not bad to 4S. Brightness auto configured works incredibly well be it outside in the sun or inside. Phone calls work well, with no apparent drop out (talking to land lines, talking to other mobile users remains a comedy of errors in Australia). Camera is nice, with a flash which was a big point for me, pictures turn out well and although it is \"only\" 5MP it's a far better camera than the Galaxy Fit, and it has a feature where if your picture did blur, it can attempt to fix it, which seems to succeed every time I've used it, though that isn't often. Overall very happy with the camera. Battery Life is also good, easily making it through the day, and it has a battery save feature that disables some features when it is getting low, which seems like a good idea. And, lastly, the web browser stands out to me as a well designed app, because it has the address bar on the bottom of the screen, where you can actually reach it.I rather like Windows Phone's screen customization (with the live tiles and them being re-sizable), especially the live tiles for pictures and calendar notifications, including calendar notifications on the lock screen for the next appointment. However, because I like my phone as a communication device and not the central hub around which my life evolves (so no facebook [which i gather does integrate well] and a fair few apps), this all works really well for me. But, for some people it might not. There are no folders and as you put more and more apps on the screen you'll find that you'll be scrolling more and more, which clearly eventually becomes an issue. Add to that, that your second screen (everything in alphabetical order) doesn't make this better ... and this might not be the phone for you solely because of how you might want to use it. As phone: great. As primary computer ... not so much, but at that point the lack of apps (I assume there is some truth in this space for people that want LOTS of apps) and speed (again, it is consistent, but not fast) would surely have to be an issue.So, as a phone, this device is great. It has decent battery life for a smart phone, and a good interface that thrives on being used for minimal app multiplicity. As a primary computer for email, gaming, social networking many facts probably offer a significant drawback, be that screen size, speed, variety of (non-phone centric) apps. If that's what you are looking for, don't look here, this is a phone. It is cheap and cheerful, but it's not powerful and large.One final thought: the Lumia 610 is so good as a phone, I'd actually like to get a better, more expensive Windows Phone. It is so good I can see what some people see in their iPhone (which I also use for work) and/or Android as being this massive hub in their lives. Though realistically, the Lumia 610 does everything I want and I'm very happy to use it, though keep in mind: I bought it, and use it as a phone.", "Date": "July 7, 2013"}, {"Title": "HE likes it ..........", "Author": "Grahame W. Bush", "ReviewID": "RD0OK6VO487RY", "Overall": "4.0", "Content": "Bought for a family member who wanted to upgrade his mobile phone here in the Dominican Republic. It works well on the local service (always a problem knowing if a US styled machine will actually work down here) so the family member is very happy!!", "Date": "February 3, 2014"}, {"Title": "Good phone, but 3G doesn't work", "Author": "arsanbr", "ReviewID": "RLZSPGMF1MSTS", "Overall": "2.0", "Content": "Good phone, but 3G doesn't work. I have a samsung S3 that connects immediately to the 3G network.With Nokia 610 you have to check nokia website and follow some instructions on how to make 3G available. The problem, is that even after following these instructions, I couldn`t connect. Wi-Fi works well, though.", "Date": "January 20, 2014"}, {"Title": "Great phone", "Author": "Damani Johnson", "ReviewID": "R2QIV0DX8P5FNR", "Overall": "4.0", "Content": "Bought it for my mom and she absolutely loves the phone. It is her first touch screen and she is enjoying the simplicity of it. It takes great pics as well.", "Date": "December 26, 2013"}, {"Title": "No Data Plan Require For ATT", "Author": "Happy Customer", "ReviewID": "R2BXB5DIXEZ09L", "Overall": "5.0", "Content": "For this who uses ATT and dont want a data plan. The phone will not be detected by ATT. I gave this to my Dad and he loves it. The only problem with this phone i had was that the ringtone noise is slow but once you reset the phone it would be okay", "Date": "October 10, 2013"}, {"Title": "Nice phone", "Author": "Jairo", "ReviewID": "R16VGRTA4X22GM", "Overall": "2.0", "Content": "I bought this phone because is cheaper and is like windows 8. I like or I prefer use NOKIA's brand.you would be able to install many apps, but you can not install Skype in this phone because it hasn't enough Memory RAM.", "Date": "August 28, 2013"}, {"Title": "Its an okay phone", "Author": "Joshua J. Womack \"Avid Gamer\"", "ReviewID": "R1HKMHFKIFTC0E", "Overall": "3.0", "Content": "For those interested. This phone works with StraightTalk with the TMobile Network. Had some issue with getting texting and picture texts to work but all is resolved now.", "Date": "May 28, 2013"}, {"Title": "RESPONSE", "Author": "NASH G", "ReviewID": "RVAP2Z5WGV0DI", "Overall": "5.0", "Content": "I like response time and the packaging is very good and simple.Glad I got this on Good Friday;looking just cute as described in the ad.Yet to test it and send it down to my sister in Ghana.I sure will come back to this store for some more.Thanks", "Date": "March 29, 2013"}, {"Title": "I thought I bought a brand new phone", "Author": "DMH", "ReviewID": "RYCYJMI6LPN1C", "Overall": "1.0", "Content": "When I buy a brand new item I expect it to arrive in an intact, non tempered with package. With this phone this is not the case and I am considering returning it as I received it. The package had been opened and then taped up. In other words, the phone could easily have been used! I am very disappointed to say the least!", "Date": "September 24, 2013"}, {"Title": "very good, thanks.", "Author": "Juan Hernandez", "ReviewID": "R17B7EQ749B875", "Overall": "3.0", "Content": "The phone did not come into proper manufacturer's box! others so all good! thanks works perfectly. thanks, thanks, thanks, thanks", "Date": "July 22, 2013"}, {"Title": "some apps like whatsapp is slow and camara its no bad but can be better", "Author": "Fernando David Ramirez Morales", "ReviewID": "R1O2HMJA6HVAQD", "Overall": "3.0", "Content": "Whatsapp is slow facebook is slow have to actualize software its ok but can be changed,the nox is.not original is not from nokia is a telefonical company box", "Date": "July 18, 2013"}], "ProductInfo": {"Price": "$499.99", "Features": "2G Network: GSM 850 / 900 / 1800 / 1900, 3G Network: HSPA 850 / 900 / 1900 / 2100,  Takes a Micro Sim Card\nEnjoy Windows' smart and intuitive tiled interface on the 3.7\" touchscreen display\nCapture awesome pics using the 5MP with autofocus and an LED flash\nWi-Fi, Bluetooth, GPS, 8GB of memory (please note some of this memory is used for the operating system)\nBULK ITEM, NO RETAIL BOX, MAY BE CARRIER BRANDED BUT IS COMPLETELY UNLOCKED, INCLUDES:Phone, Travel Charger, Micro USB Cable, Rechargeable Battery, Earpiece", "Name": "UNLOCKED Nokia Lumia 610 3G Phone, 3.7\" Touch Screen, 5MP Camera, LED Flash, Windows Phone, NEW, BULK PACKAGED, 2G GSM 850/900/1800/1900MHZ, 3G HSPA 850/900/1900/2100MHZ", "ImgURL": "http://ecx.images-amazon.com/images/I/41G%2Bj2qRIgL._SY300_.jpg", "ProductID": "B00B06HDIA"}}