{"Reviews": [{"Title": "Buying an HTC is like THROWING AWAY YOUR MONEY -- warranty is utterly useless", "Author": "S. E. Hebert \"social scientist, social worker...", "ReviewID": "R2DV7WR40L5KJG", "Overall": "1.0", "Content": "Needing warranty service and \"repaired\" after only 2 months of use, this $300 phone is unusable on my cell phone provider's network!I bought my first HTC phone in August and by the end of September, it was frozen on the home screen and would not turn off. Calling for support, I was told to remove the battery and that it would need repair. When I received the phone back in the mail, there were no details about the repair and no instructions. Now, the phone had to be reactivated, but that process failed even though I tried numerous times. Unbeknownst to me, the motherboard was replaced in the phone and the device now had a new MEID/serial number, which was not in the . Six months later, the company still has not gotten around to putting that new number in their network database so that I can activate it.I wasted $300 on HTC for a phone that has no possibility of ever working again because of a technicality in their limited warranty repair service. HTC handed off this disaster to me with the claim that they took care of their responsibility to the buyer under warranty -- though, obviously their policy of repair with new MEID is responsible.This is not a one-time thing or a rant from me, one unsatisfied customer. Numerous of their CSRs have told me this is a very common problem they get phone calls about every day. They refuse to send me a phone which can be activated right away.Thus, I will never, ever buy another HTC phone (for instance, I had to buy yet another phone to be able to have service again and though an HTC phone was at a lower sales price, I chose to get a Samsung instead of throwing my money away with HTC). I would never and will never recommend an HTC phone simply based on my experience with their customer service, which was of no service whatsoever.", "Date": "April 21, 2013"}, {"Title": "Smartphone for less than $35/mo!", "Author": "Dallas Clark", "ReviewID": "R3R61LD2SLZ82H", "Overall": "5.0", "Content": "Got this phone hooked up with unlimited talk, text, mms and 100MB for less than $35/mo! So happy right now. I'll save over $700 this year. The phone is great too. HTC makes a great product and I am completely satisfied with my purchase.", "Date": "February 8, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android 4.0 ICS with HTC Sense\n5 MP Rear-Facing Camera with Flash and Video\nWi-Fi Capable\nStereo Bluetooth\nFactory Furnished - Like New!", "Name": "HTC Evo Design 4g Black", "ImgURL": "http://ecx.images-amazon.com/images/I/31wmQeLeuwL.jpg", "ProductID": "B00B8EC14U"}}