{"Reviews": [{"Title": "fantastic phone.", "Author": "Monique", "ReviewID": "R1M7BK5TO6X5V0", "Overall": "4.0", "Content": "I ordered this phone for my brother and he absolutely love this phone its just what he wanted great features  good size and the weight is great.", "Date": "October 21, 2013"}, {"Title": "Loved it AFTER I learned how to operate it.", "Author": "Godzgirl42", "ReviewID": "R2UUR6R82HAOMS", "Overall": "5.0", "Content": "It's of great usage in Cameroon where I am. My only problem is that I don't know how to regulate the internet usage through the service provider. I'll have to learn. Otherwise, all of the problems people said they had with it, I haven't had. Although sometimes the touch pad is slow to respond but it's good.", "Date": "October 19, 2013"}, {"Title": "Overall good phone", "Author": "Travelpro", "ReviewID": "R1N5PBJYRVNE4V", "Overall": "4.0", "Content": "Good phone for heavy travelers. Feels a bit (too) large at times, especially when you're used to iPhones. Although I found the dual SIM very useful, it is a nightmare to put or remove the bottom one, especially when the SIM has been cut to fit iPhones. Finally, I can't find a case to fit this phone! But again, overall decent phone for the price.", "Date": "October 28, 2013"}, {"Title": "SO FAR SO GOOD", "Author": "RMD \"RMD\"", "ReviewID": "R1EPG4E120DRDP", "Overall": "5.0", "Content": "Only had this phone a short while, but so far so good.  Wi Fi works fine, as does domestic US phone service.  Have used an Asian Sim card (Thailand) and that has worked as well.  Can't speak for battery life yet, but so far it's as advertised.", "Date": "April 18, 2014"}, {"Title": "IT IS NOT A LG E615F - Is the normal one", "Author": "Santiago Ramirez", "ReviewID": "R2N71RLEY72783", "Overall": "1.0", "Content": "Please,Be aware that what they send is not the E615F, is the E615. So if you purchase this cellphone be aware of the bands that supports.I purchased this one because it worked with other bands, and I sticked in my a##.", "Date": "April 13, 2014"}, {"Title": "great for the price", "Author": "PSsnk", "ReviewID": "R3LST5QOWT5A4B", "Overall": "4.0", "Content": "not much space on it. but works great....good price, that is. not that fancy or anything like my Z10 Blackberry.", "Date": "March 3, 2014"}, {"Title": "Very Poor Battery Life", "Author": "Victoria Milne", "ReviewID": "R2FQ1A1942HZS9", "Overall": "3.0", "Content": "The phone works quite well except for the fact that the battery life is really brief.. especially if you're using wifi.", "Date": "March 2, 2014"}, {"Title": "Excellent", "Author": "Angel Aranguren \"AUTOLOOK\"", "ReviewID": "R3UUELEIKUG7BJ", "Overall": "5.0", "Content": "Everything ok. Kids loved it. on time. Fit ok. Better than described. As fun as expected. Only need to buy case", "Date": "February 4, 2014"}, {"Title": "Great Phone.", "Author": "Dinesh Bora", "ReviewID": "RHCB85GGVVOH9", "Overall": "5.0", "Content": "Great Phone for the price.Works with all carriers in various countries that I have tried.Good battery life.Will highly recommend.", "Date": "January 31, 2014"}, {"Title": "I Like it", "Author": "Wladlen Correa", "ReviewID": "RTD8W9THEIVPB", "Overall": "4.0", "Content": "RAM memory is a bit slow but the phone is pretty friendly and applications run very well, and the battery lasts", "Date": "January 9, 2014"}, {"Title": "Everything excellent", "Author": "Carmen", "ReviewID": "R3FH5JBJDB7WNR", "Overall": "5.0", "Content": "Item arrived on time in the original box. Cell phone works perfect, no problem with the sim card. It's all I was expected.", "Date": "December 16, 2013"}, {"Title": "This Phone's from India", "Author": "John Bozeman", "ReviewID": "R3V66Z9VCGSSX", "Overall": "4.0", "Content": "I took the phone out of the box and could not get the battery to charge.  LG USA could not help me.  It does not recognize or support this model, because it says it's for the international market.  It thought the charger might be bad and suggested going to Best Buy to buy a new one.  First, however, it suggested searching on Google.  There I found LG India supports this phone.  The manual and downloads are there.  And from the manual I got a suggestion to plug the phone in to a computer through the USB cable (provided).  It's charging!  The charger/adapter was indeed bad.I'm giving this phone four stars because of the hassle it's been so far, but it still has potential.", "Date": "November 15, 2013"}, {"Title": "YES I LIKE THIS PRODUCT VERY MUCH SO I AM SATISFICED", "Author": "ABEL NIETO", "ReviewID": "R2BODJD9K9HMYX", "Overall": "5.0", "Content": "I SHOOSED THIS ITEM BECAUSE OF ITS PRICE AND PERFORMANCEI LIKE IT BECAUSE IT WORKS VERY WELLI RECOMEND IT TO EVERY BODY WHO WANTS QUALITY PRODUCTS", "Date": "March 7, 2014"}, {"Title": "Thanks item received", "Author": "Jose Velasquez", "ReviewID": "R16RM8TT1R3ABV", "Overall": "5.0", "Content": "Item arrived in optimal conditions and the expected timepicked this item for the brand and priceI liked the model and color", "Date": "April 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 1900 / 2100 Mhz", "Name": "LG Optimus L5 E615F 4Gb Black WiFi Android Touchscreen Dual SIM 3G Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2B4i3cFPyL._SY300_.jpg", "ProductID": "B00BAZV8KK"}}