{"Reviews": [{"Title": "My Phablet", "Author": "Sims", "ReviewID": "R3FOVWX5GMTC94", "Overall": "4.0", "Content": "First off this wasn't the phone I ordered from HD Design, it was the orange N9776.I was sent an email stating what I had ordered had some defects & they would replace it with the I9977 with no extra charge. I was hesitant at first since I didn't know anything about this phone so I agreed to receive this phone and what a good choice. It works off straight talk wonderfully it's very responsive the only complaint so far that I absolutely hate is that a few apps doesn't work especially the widgets. I found out after you placed your order you could request to get it jail broke which was to late for me. Also some people complained about not being able to track their package after my order was shipped I just emailed them asking for a tracking # and received my # within the hour and it only took 13 days to receive my phone. Would've been 5 stars if the I9977 came in orange. To HD Design thanks for being so quick to respond to my emails I would definitely buy more products from here.", "Date": "February 27, 2013"}, {"Title": "i9977 Mini Pad 6.0 Inch Android 4.0 MTK6577 Dual Core 3G Phone", "Author": "gregory neve", "ReviewID": "R3037Q98838M3V", "Overall": "4.0", "Content": "I really am impressed with the phone! The company stayed in contact with me at all times,all besides tracking no. getting mixed up and the 2 week wait it was worth the wait.All an all great phone! It is as described.", "Date": "March 27, 2013"}, {"Title": "Recived a broken device...", "Author": "BOBERT9603", "ReviewID": "R3H0P6HPP17RAD", "Overall": "1.0", "Content": "Well first off the camera is garbage. Mine is very loose and it's popping out very badly. I can literally push it back in the phone! I'm afraid one day I'm going to take the back off and it's going to fall out. Another problem I'm having is the buttons on the side are hard to push it was like that since day one. The bottom 3 touch sensitive buttons are very unresponsive and sometimes it take like 3 or 4 tries. Sometimes the touchscreen is very laggy. Speaker quality is horrible. The headphone jack is not 3.5mm like their ad says. It's longer than the normal ones and I can't find replacement headphones because I did not get a set with the phone. I tried so hard to like this phone even with the problems I am having but I simply cannot. There are just too many things wrong to be able to like it. I don't know it it's just my phone or there all built like this but it's horrible I do not recommend it to anybody else. Like the old saying you get what you paid for. I'm in the process of getting my money back and hopefully it goes well. Hope I helped.", "Date": "May 1, 2013"}, {"Title": "Phone not good!", "Author": "Mark Bryant", "ReviewID": "R1Q22TA70RLXWF", "Overall": "1.0", "Content": "Overall good phone. Resolution on this phone is terrible, though. All in all I could have spent my money better.", "Date": "January 19, 2014"}, {"Title": "Fantastic Product", "Author": "Yolanda", "ReviewID": "R2J9OB2JTRFJ0Q", "Overall": "5.0", "Content": "I haven't been able to sit it down yet .It works just fine . The camera takes really good pictures with the proper lighting . The screen  display is the best I've seen . Very clear .I also have a tablet and it functions just like it . Its big and bold and does everything I need it to . The shipper gets a five for the package and handling of the phone . I received it in two an a half weeks via us mail on a Saturday after hours . Nothing bad to say about it at all . Both sim card slots work .The sdcard slot works  . I've added some apps from the gmarket to tweak to my needs and it all works fine . The only problem that I have with this phone , is not being able to find a case that fits it  . Anybody that knows where I can get one , let me know . Highly recommend this phone for the price as well as this shipper .", "Date": "May 10, 2013"}, {"Title": "Never buy from lolbuy or any seller directly from China", "Author": "kawas", "ReviewID": "R11TRCG4C76JK2", "Overall": "1.0", "Content": "This phone is a piece of junk. The camera doesn't work. So many annoying features. Cheap cover, comes off when you plug in the charging cable. Seller was ready to take it back. But you have to send it following his directions.1. Send it using first class mail.USPS2. Show it as cell phone accessory3. shipping fee cannot exceed $16.00No insurance or any delivery guarantee options can be used by above restrictions.Sellers claim is that, if i don't  follow above rules, he may not get the item on time, because Chinese customs will hold his item, possibly i may not get my money back or delayed 2 months or more.I went to USPS. The minimum cost to send a 1st class letter to China is $16.00. But for a box of this size it costs minimum $23.00 with $0.00 value shown and no delivery confirmation.I came back home without sending to contact the seller for further direction. He said, he won't reimburse any shipping charges beyond $20.00.I sought help of Amazon customer service for help.Amazon started a A-to-Z claim process and asked me to send the item with delivery confirmation and insurance and send them the tracking number. I went back to USPS, filled out the customs forms showing the actual value. Came to find out that, I cannot send two Li-Ion batteries in one pkg for international shipping. The phone comes with an extra battery. More over it has to be installed in the phone.I called Amazon to inform this issue. Talked to multiple people and each time they filed my case and send emails with information for something different than what my issue is. I got tired of both the seller and Amazon return service and ended up not sending this item.So, if you are NOT ready to get stuck with a junk Chinese phone and loose $200.00, please take my advice and buy it from a local seller or directly from Amazon and NOT from their Chinese re-sellers. This seller have since changed their name and appears in many different names. So please watch out.Only thing I don't understand is, why Amazon is allowing it, regardless of multiple complaints !!!", "Date": "May 19, 2013"}, {"Title": "Disappointing but still a good value", "Author": "William B. Cox", "ReviewID": "R3OF8542QZZKQ4", "Overall": "3.0", "Content": "The screen is big and bright but for some reason I have to tilt it towards me to be able to have good contrast, otherwise it can look washed-out.It cannot play Hulu or Netflix.  Have spent hours researching, tried many fixes but none work.  Youtube works great, so no issues with Flash.The exterior is, well, serviceable, the included protective case is Soviet.All that said, it comes with two bigass batteries that last a good long time, it is a pretty fast and functional  At near the price of a Samsung Galaxy Tablet it seems a lot to give up just to be able to make calls.", "Date": "May 12, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "CPU\tMTK6577, Cortex A9 dual core, 1.0GHz\nDual SIM Card Dual Standby\nBluetooth\tBluetooth 2.0\nMulti-Touch\tYes, 5 point touch\nGPS\tYes, built in, support A-GPS With EPO assistance to speed up postioning", "Name": "I9977 Mini Pad 6.0 Inch Android 4.0 MTK6577 Dual Core 3G GPS 8.0MP Camera- Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41mVioC4K3L._SY300_.jpg", "ProductID": "B00B67YMX2"}}