{"Reviews": [{"Title": "Awesome phone, incremental upgrade from SIII", "Author": "rpv", "ReviewID": "R3TPRQX407VVYR", "Overall": "5.0", "Content": "Galaxy S4 is  an incredible phone. I have been using this unlocked S4 for past 2 days helping a friend to migrate from iPhone 4S. My friend has been on iPhone and it also gave me a unique perspective. I used iPhone for couple of years and been using Android for past 3+ years.I have used Galaxy S3, Note II and for me S4 is more like a S3s :) If you have a Galaxy S3, it is perfect and there is no need to move to S4. The new features are more like minor upgrades for me. Just like Detroit rolls out new cars every year, phone manufacturers have found excellent way to make yearly upgrades.Battery came for almost a day. The video playback was crisp and my friend was amazed at the customization options. It is heaven for a iphone user to come out of shackles and explores the wonderful world of Android. It sure sounds like it is for geeks, but Samsung has created lot of ways to simplify and make it less intimidating. The EASY mode is for one such reason. Samsung's addition of all those apps (commonly referred as crapware) is not as bad as HTC or LG. Android experience is classified as pure vanilla in phones like Nexus. Vendors like Samsung have added a whole lot of extra programs.5\" HD Super AMOLED 1920 x 1080 display  (441 ppi) is just plain gorgeous. 13 MP camera takes ginormous image sizes. I put a 64 GB microSDXC card  SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging as my friend wants to take lot of movies (built-in 2 GB RAM, 16 GB ROM). No stuttering, and very smooth playback of videos captured in varying light conditions (HD Playback; HD Recording). Compatible video types are AVI/DIVX, WMV/ASF, FLV, MKV, MP4/3GP, WEBM. HDR and Panaromic photos were incredibly sharp. Compatible audio types are:  AAC, AMR, MP3, OGG, WMA/ASF, 3GA/M4A, FLAC, WAV. Google Music, PlayerPro Music player are producing excellent music.  Audio/Video is one section where S4 has nudged S3. For a normal user, if you are not into lot of video processing this does not matter.S4's infrared sensor is the same technology as TV remote control, so with WatchON you can change the TV channel from your phone. My friend was shocked to see this feature. Having used Android for a long time, I explored all new features one by one. My friend is still getting used to and feels this is too complicated. I broke down into lot of sub features and told my friend he may not use 50% of features, but told him to explore one feature at a time and focus on that.Games were very buttery, this phones runs ARM®-based octa-core mobile CPU. This is apparently world's first!  Inside this chip is Imagination Technologies' PowerVR SGX544MP3 GPU. I tried several car racing games and performance was phenomenal. People on the XDA-Developers forum report seeing smearing and ghosting when scrolling on the phone. This especially occurs to people when scrolling among darker colors, which begin showing up as purple. I tried hard to see if I could on the S4 I was testing with my friend and I could not see it. I am sure these can be upgraded with software over due course.Air View and Air Gestures - are they worth it? Air view is similar to how the S-pen on the Galaxy Note 8 works. Simply hover finger a few millimeters above the screen and in supported apps, you'll see a preview of content. This works with many of Samsung's built-in apps, including the photo gallery, the dialer, Samsung's browser and email client. It also works with Flipboard. Air View works by cranking up the capacitive sensor on the screen. Another new feature is Air Gestures. This uses the IR sensor on the top of the phone to detect movement by your palm or finger. One can flip between open tabs in Samsung's browser app, skip to a new song in the music player and do many other things. I say these are still in works and sometimes not very efficient.GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). I tried multiple apps to demonstrate to my friend. In the end, my friend was impressed with what all Android and in particular S4 had to offer. Smooth and Stunning display!I tried following apps and they just worked awesome.Amazon MobileAndroid StatusAndroidifyAngry Birds (Space/Seasons)Asphalt 7Amazon App StoreBoxCar Maintenance Reminder ProChromeCNET TVNAVIGON (from Garmin - offline maps)Google Navigation/Earth/MapsGoogle Currents (nice way to read News)Draw SomethingGoogle DriveEbayLinkedinGoogle MusicTapatalk (awesome forum browsing app)OverDrive Media Console: Library eBooks & Audiobooks (public library consumption of media)Microsoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for Android (excellent twitter client)Twit.TvGoogle VoicePlenty of WidgetsAsk questions, the review cannot do justice to Galaxy S4. I will be glad to answer any questions.", "Date": "May 6, 2013"}, {"Title": "Great But Not Groundbreaking", "Author": "Colin R. Craib", "ReviewID": "R1TVIY0F870V5", "Overall": "4.0", "Content": "I'll start off giving a bit of background on my smartphone usage.  I've pretty much been a Droid user for my whole life.  I'm definitely a power user and I greatly enjoyed having a keyboard.  I could type long text messages or emails with ease, and I never really had that much interest in switching to a non-keyboard phone.  Unfortunately, that decision was taken out of my hands somewhat.  I have the Droid 4 which I greatly enjoy, but it has it's own problems.  After having it for about a year it got a pretty nasty crack on it.  I played around with some friends GS3's and was very impressed with them.  However the rumors about the GS 4 coming out had already started so I decided to hold off.  I'm glad that I did, but a lot of my review will be based off of not having the GS3 and making such a drastic switch.  As I put in the title, it seems to be minor improvements upon a design they've found worked as opposed to the drastic changes previously seen.  Without further ado...The Looks:There isn't much positive to be said about the aesthetics of the Galaxy S4 body to be honest.  It looks and feels like a cheap toy.  It feels... clammy might be the best way to describe it.  It really isn't the best feel when you're holding it, and compared to the HTC One it's disappointing.  It doesn't seem like it had that much effort put into changing it.  It does feel sturdy though, despite being a very thin phone.  I was able to get a good grip on it though which is important to me since I'm rather small.  Overall I would give the looks a 2.5/5The Hardware:Huge upgrade over.. well anything but a computer.  This really is just a small computer, and it runs flawlessly.  The screen is massive and great.  Easily the best one that I've seen on a phone.  The 5\" screen could be a little bit big for some people I think, but for most of the younger generation will be ok with it though.  The battery is incredible as well.  My Droid 4 would die around 4 or so after a normal days use (streaming music, internet, tons of emails, etc).  This will last me all day, including going out at night which is a massive incentive to me.  The camera is great on it as well, much better than any other Android phone.  It is still slightly edged out by the iPhone though.  Overall though I would give it a 5/5 on hardwareThe Software:I'll start with the obvious, it's actually running the latest version of Jelly Bean, and should keep up better than other phones do (minus Nexus 4.)  This is a huge bonus, because Android's because fault is that the OS is so fragmented.  Now, Samsung has put a ton of their own software on top of Jelly Bean.  The best description would be that it's overwhelming probably.  There are a lot of Samsung apps that really will just never be used.  So I'm not even going to bother going over the party trick type apps.  Instead I'll talk about a few that really caught my attention.S Health:  Helpful now, will be awesome in the future.  The premise is that it's a basically a fitbit built into your phone.  It helps you track calories, steps walked, workouts, etc.  It works great now, but I don't think that it will get better with accessories.WatchON:  Basically it acts as a universal TV remote and a Netflix browser.  It's great, and I don't even watch very much TV.  I suspect that this will become the standard soon, but until then this is the best version you can get.Air View/Gesture:  A great idea, but not great in practice.  It's glitchy currently and doesn't always work (or does work in ways that you don't want it to.)Camera Software:  There's actually a lot of really great features that come with the camera.  The most novel of them is the ability to take a picture from the front and back cameras at the same time.  I can see this actually becoming standard in the future as well.Overall I think that the software is good, but not perfect.  Overall I would still rather just have stock jelly bean.  Samsung adds some good features, but it also adds a lot of stuff that I really don't need and can't get rid of.Final Impressions:It's a good phone, there's no doubt about that. It's not a great phone though.  The screen is amazing, the body isn't.  The software is good, the hardware is out of this world.  It all comes down to personal preference between this and the HTC One I think.  Personally I'm fine just putting a case on my GS 4, but I've always been more interested in battery and hardware.  I can completely understand picking a slight downgrade on those areas though in return for a great body like the HTC One has.4/5", "Date": "May 2, 2013"}, {"Title": "Love it", "Author": "AM", "ReviewID": "R1DFICSFYM4QWH", "Overall": "5.0", "Content": "Switched from IPhone S4.  I love this phone!  The greatest features are:- you can add a SD card and expand memory;- more apps and they are cheaper;- pictures are sharp and the quality is great!", "Date": "September 8, 2013"}, {"Title": "Kool", "Author": "Darry", "ReviewID": "R49AZR5TTVGB0", "Overall": "5.0", "Content": "Well i think the rating speaks for it's self. This is the best purchase i have done on amazon so far and the S4 19500 really lived up to the hype and satisfied my needs. I just cant put it down for a second.", "Date": "July 20, 2013"}, {"Title": "performance", "Author": "mullo2012", "ReviewID": "R3NNBWXP3IP260", "Overall": "4.0", "Content": "The only hold back is the freezing respond from this s4 when I use the password uption to open it from the main screen, it annoy me so I'm just using the swipe uption now, it slow me down when I want to make a quick call.", "Date": "June 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BV4NG82"}}