{"Reviews": [{"Title": "great phone bad battery", "Author": "thomas bright", "ReviewID": "RZL7AG55MGZYC", "Overall": "4.0", "Content": "Excellent phone. Works great. Does everything u can expect from a smart phone. Has horrible battery life. Would have given five stars if it weren't for battery life but I would definitely recommend. Overall very happy just have to keep a charger handy", "Date": "March 25, 2014"}, {"Title": "Battery doesnt last long", "Author": "Kristina M. Cordova", "ReviewID": "RY61URXNGXKHY", "Overall": "2.0", "Content": "Just bought this in March and the battery life would last like 13 hours today it lasted only 6 hours?? what the heck happened.  I do not like this. and I cant get a new battery s there is no place to put this in.  I would like seller to contact me since this is on warranty please.  I loved this phone when I first got it and am truly disappointed that the battery life is less now ? why>?", "Date": "May 27, 2014"}, {"Title": "default screen", "Author": "Ana Ropero", "ReviewID": "R11IKQJYLZPNTI", "Overall": "1.0", "Content": "the HTC arrive with a defect on the screen.is inaceptable this problem and less that i  don't have choice, the only one is buy a  new screen,", "Date": "May 24, 2014"}, {"Title": "Won't be buying an HTC again.", "Author": "k \"KB\"", "ReviewID": "R16P1I2X4IGFR2", "Overall": "1.0", "Content": "The phone was plagued with issues from the start. And then right at about 10 months, the phone s*** the bed. I called HTC and told them that performance was taking a nose-dive, the battery lasted half a day with regular use, and the phone would drop cell service all the time. Their solution? They mailed me a new SIM card holder... are you kidding me? What a joke. They jerked me around until I hit 12 months, and I went over the warranty period.Problems with this phone include but not limited to:* Freezing. Apps crash often. The HTC UI will crash too. I'll go to the home screen and the UI will take 30 seconds to return.* HORRIBLE battery life. I have to charge the phone twice a day, and sometimes three.* Drops cell service consistently. Too, friends have 4 bars with AT&T; while I consistently have 1 or 2 less.* No removable battery. Really? This is just a gimmick to earn money from users needing battery replacements.* No expandable storage.* The most free memory (RAM) I can ever get is around 150MB. The rest of the 1GB is spent on the OS and HTC background apps. * This thing gets HOT. If it weren't for the Otterbox, you wouldn't be able to hold it comfortably.* HORRIBLE support from HTC. They had zero interest in solving my problem.I'll be buying a different brand as soon as I can. This phone needs to be taken out back and shot.", "Date": "April 28, 2014"}, {"Title": "maybe the worst phone i ever owned", "Author": "D. O'Donnell", "ReviewID": "RTTK922TIMMPF", "Overall": "1.0", "Content": "Anyone who tells you HTC's are superior is a moron. ---First, there is no way this should be running the most recent version of android; the number of background processes means you ar perpetually around 100 megs of ram free.- there is no hot button to get to a task manager, so if your phone hangs, you are stuck til it wants to catch up.-you can't pull the case apart and take out the battery, so if it really freezes you are just screwed-no way to add an SD card-can't toggle WiFi, Bluetooth etc from drop down menu-takes around 3-4 touches to adjust brightness, so good luck compensating for glare-no keyboard options aside from language-literally NO WAY to type an acute accent mark by itself on this phone, so god forbid you have any in your user names or passwords-options for application associations are extremely limited (youtube links open in web browser instead of application.In conclusion: Dear HTC, stop making phones because you suck at it", "Date": "April 21, 2014"}, {"Title": "love it", "Author": "CHris brown", "ReviewID": "R3IF8T4YRGKMN1", "Overall": "5.0", "Content": "works better than my Samsung s3 and my note 2. love the feel of it. shipped very fast! the best phone I've ever owned.", "Date": "March 27, 2014"}, {"Title": "second and last time I buy htc phones.", "Author": "Jose", "ReviewID": "RPPKLPD0VT0M", "Overall": "1.0", "Content": "I did not buy it from this seller, but I have the exact model htc one x at t, the phone always restart and turn off. I need to be connected all time because I work with gps maps routes, and suddenly restart and that makes me mad for job. The first phone was htc amaze, battery last 4 hours and the phone died I tried to contact HTC and bad support.I wont never trust htc phones again. I will go for sony xperia, samsung or nexus.A 30 dollar phone does much better than those htc crap. Buying htc phones is putting money in the trash.", "Date": "March 27, 2014"}, {"Title": "HTC ONE X - Second Phone", "Author": "Mark Forbes", "ReviewID": "R3N8FEYDT7K8GO", "Overall": "5.0", "Content": "Ordered this phone to replace my older One X that died at 15 months old. Exact same model, except my old one was black. So far so good!", "Date": "March 17, 2014"}, {"Title": "Great", "Author": "Kathy", "ReviewID": "R1HKTXDE56CSSA", "Overall": "5.0", "Content": "Great price! And works great. Very pleased with quality of phone. Looks good and love the color. Very very  pleased", "Date": "March 11, 2014"}, {"Title": "great product", "Author": "sheldon", "ReviewID": "RXK4M7TB47DMM", "Overall": "5.0", "Content": "this is a really great phone its thin and light has a big display and its one of HTC top phones", "Date": "March 1, 2014"}, {"Title": "Good seller", "Author": "Jean Modeste", "ReviewID": "R12YS9UF3BK53O", "Overall": "3.0", "Content": "This item gave me hard time. It works correctly but the one problem that I had was the mic. I return it and buy another new.", "Date": "February 1, 2014"}], "ProductInfo": {"Price": "$599.99", "Features": "Fast 1.5 Ghz Dual Core Processor\nLarge 4.7 Inch HD Touchscreen Display\nBeats Audio Compatible (Headset not included)\n16GB Built In Memory\nIncluded in box: HTC ONE X Phone, USB Cable, Home Charger, Manual, Eject Tool for Micro SIM Card, (Phone has internal battery)", "Name": "HTC ONE X UNLOCKED AT&T World Phone - 16GB Memory - DUAL CORE Processor - No Contract (WHITE)", "ImgURL": "http://ecx.images-amazon.com/images/I/41dd-je6uXL._SX300_.jpg", "ProductID": "B00B3DCQL4"}}