{"Reviews": [{"Title": "Great Buy!", "Author": "S.L.C.", "ReviewID": "R1XU4BJOERG6W3", "Overall": "5.0", "Content": "Phone was just what I wanted and less than if I had purchased it from Consumer Cellular.  Very pleased so far.", "Date": "May 2, 2013"}, {"Title": "High Hopes Dashed", "Author": "Better than McCarthy", "ReviewID": "R1KPJVRX76AO13", "Overall": "1.0", "Content": "With electronics, you can sometimes get a bad copy of a generally good product. I can't speak to the product in general but my phone was horrid.  Froze, erratic starts and stops.  At the end, commands took 3 1/2 minutes to execute.", "Date": "June 13, 2013"}, {"Title": "Nice little phone!", "Author": "Lisa in CT", "ReviewID": "R2J4R0598U6LQ9", "Overall": "5.0", "Content": "This is a really nice little phone. It feels solid in your hand, is very easy to use & sounds great! Consumer Cellular is a great company too. I only left them because just having a data plan with them uses data, so you may use it up without even knowing it. Great company for calls & text though! Highly recommended!", "Date": "April 18, 2013"}, {"Title": "Good for Consumer Cellular", "Author": "Hanh Dinh", "ReviewID": "R2G0B1R6IX4K2J", "Overall": "2.0", "Content": "It's a good phone for Consumer Cellular. But it is LOCKED into Consumer Cellular. You cannot use it for AT&T; or other providers.If you buy an AT&T; phone instead, you could use it for Consumer Cellular. So the AT&T; phone is \"backward compatible\", but the Consumer Cellular phones are not.", "Date": "February 26, 2014"}, {"Title": "Great phone", "Author": "IRENE SARGENT", "ReviewID": "R2ARO2AKF65JJD", "Overall": "5.0", "Content": "This phone is better than expected. I am still learning how to use all the features. I would recommend this phone.", "Date": "May 13, 2013"}, {"Title": "Great Phone, Great Price", "Author": "Christian Houston", "ReviewID": "R2XUJI68MSZT57", "Overall": "5.0", "Content": "Great phone for the price, does everything I need it to. Very capable device despite the fact that it only runs android 2.2 (FroYo)", "Date": "November 19, 2013"}, {"Title": "Not Fantastic, Not Terrible", "Author": "Anima", "ReviewID": "RNK3F3NPK5Q7D", "Overall": "3.0", "Content": "I have had this product for a couple of years. It functions well enough. Sometimes it will randomly restart itself, and sometimes the camera won't open and you have to restart the phone to get it to work. More often than not games lag. However, it is a good functioning phone and I do not plan on getting a new one any time soon.", "Date": "August 11, 2013"}, {"Title": "Excellent Smart Phone for the money", "Author": "Jim Ramey", "ReviewID": "R3FCISA8CUC4W4", "Overall": "4.0", "Content": "For the cost this is an excellent 3G smart phone, especially for the money. Processor is a little slow for today's standards, but works fine. Came with micro SD card and plenty of installed apps. Would recommend this phone.", "Date": "August 9, 2013"}, {"Title": "Sometime it restart, it self?!", "Author": "Daniel Oldakowski", "ReviewID": "R27KXE6DCPDNQE", "Overall": "3.0", "Content": "Some day it work great and, sometime it will restart it self?!For no reason it will restart it self!!", "Date": "July 22, 2013"}, {"Title": "A great phone.", "Author": "mdb", "ReviewID": "R3IY842E5HZE68", "Overall": "5.0", "Content": "This ius a terrific phone if you don't need all the bells and whistles. I use it for making/receiving calls (amazing!), checking emails, a bit of texting. I wish the battery lasted longer before requiring a recharge -- I need to recharge every 2 or 3 days, and do not use it that much. It would probably last 4-6 hrs with constant use. Anyway, it is great for the price, and exactly what I need.", "Date": "July 20, 2013"}, {"Title": "good", "Author": "Joy R", "ReviewID": "R1KU29AZIXY5IC", "Overall": "4.0", "Content": "It is a good phone. But where it said it was an fm radio, it should have stated must be with AT&T; service for this function to  be available.", "Date": "June 11, 2013"}, {"Title": "A bit dated but good value", "Author": "cascade hiker", "ReviewID": "R4U3LGU89DRYL", "Overall": "4.0", "Content": "If you mainly text and talk, this is a great phone.  Voices are loud and clear, reception is awesome, and the camera is OK for basic MMS and cell phone use.  The internet surfing is a bit glitchy, I think the processor is a bit stretched as the phone will occasionally lag and freeze up if you're on wifi or using the browser.  Battery life is decent if you don't use it heavily.", "Date": "February 4, 2014"}, {"Title": "The phone is great!", "Author": "C. Smith", "ReviewID": "R1NXHCUJALNG8U", "Overall": "5.0", "Content": "this was a very good deal , it works great and is easy to use. Much cheaper than the others", "Date": "January 3, 2014"}, {"Title": "3 Weeks After Purchase I Own A Brick", "Author": "JONATHAN", "ReviewID": "R3LQTZLRLLW9JZ", "Overall": "1.0", "Content": "Phone frequently locked up, probably because it's running Froyo slooowly and I load it up with apps that all worked well on my Gingerbread. Access to battery to hard boot is not well designed and I broke the plastic clips with little effort. I must have also done something to the battery and/or contacts as it died before I could even take the battery out.The seller was 5 stars, very prompt service and shipping, and sold me exactly what was advertised. I would add them to my Trusted Seller list for future purchases. The one star in no way reflects the seller and their service", "Date": "December 18, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.7-inch colorful touchscreen display\nPerfect messaging phone with virtual Qwerty touch pad\n3-megapixel digital camera/camcorder with digital zoom\nMemory slot expandable to 32 GB\nAndroid 2.2 operating system", "Name": "Motorola MB520 Bravo Smartphone Prepaid Phone (Consumer Cellular, Locked) Android OS, 3MP Camera, FM Radio", "ImgURL": "http://ecx.images-amazon.com/images/I/41Vlxx4juaL._SY300_.jpg", "ProductID": "B00B8B3G9W"}}