{"Reviews": [{"Title": "well", "Author": "Debbie", "ReviewID": "R16FUGQJ1SXVQ8", "Overall": "3.0", "Content": "no where in the ad does it say it is a Samsung. Do you really think you could buy a brand new Galaxy Note for under $200?  Read before you buy", "Date": "July 24, 2013"}, {"Title": "Android S7100 \"Samsung Galaxy Note II\"", "Author": "Neal39157", "ReviewID": "R2LOLHIT6HGQ05", "Overall": "5.0", "Content": "I was looking at the Galaxy Note II and it was just to much (579.00 with T-Mobile). I looked on Amazon's web site and I found the Unlocked Android version and after reading all comments and looking at the features I picked the S7100. It will do everything I want it to do plus it has a 5.5 screen. I'm still learning it but for 150.00 I think I got a great deal. So far I just put my SIM card and my Micro SD in and downloaded my contacts and within about 30 minutes it was ready to use. I just found the mobile hot spot on the phone wasn't expecting that! I will keep you updated on my Android S7100 and yes I love my phone so far!!!!10/25/13 Update: I found out how to make a \"screen copy\" but I couldn't figure out how to block a call. Non of the options were there to do that so I downloaded an app the blocks numbers. Also it will not let you download too many apps I have about 30 different apps that I use and I could only get about half of them on my phone. The picture quality is not that great as well and it was only 5MP not 8MP which is one of the reason I purchased the phone. I still like the phone no other problems yet.", "Date": "September 25, 2013"}, {"Title": "kerry", "Author": "kerry", "ReviewID": "RS5P2DP6S7ZPY", "Overall": "1.0", "Content": "This phone suck its slow it freezes all da time I wish I kept my money but u get what u pay for I guess", "Date": "August 13, 2013"}, {"Title": "andriod (wise it worked) galaxy note 2", "Author": "mark", "ReviewID": "R2RYQWWOIFK0Q1", "Overall": "1.0", "Content": "Had to take it to a phone store and pay an extra $100.00 dollars to get it working. The ear plug and half the keys would work. Am mad that I paid for this phone and it SUCKS!!!! You should have a zero rate spot that the only reason you get one star. Not happy with the phone not at all happy", "Date": "May 30, 2013"}, {"Title": "Your milage may vary", "Author": "H. Eng", "ReviewID": "RBIOHJ6VDB4UP", "Overall": "4.0", "Content": "Dear all, this is NOT a Samsung phone.  It is just one of the many Chinese lookalikes of brand name phones.  Physically, this looks like a crpss betweem a Samsung Note I, II and III, but the hardware specs are very different.  It uses standard Android, so software wise it is as good as any, if not better (because it does not carry the telo garbage), than any other Android phone.What this phone has that brand name phones do not have:a. Ability to use 2 SIMs.  When you are traveling, you can plug in a local one so as to optimize your usage cost.b. You can program it to switch off and on at your specified times.c. Some may already be officially rooted.What this phone does not have that brand name phones have:a. No LTE, only 3G.b. Lower resolution display (960x540 vs 1280x800 of Note 1)c. Slightly heavier.d. Less RAM and built-in storagee. Doesn't have a brandf. No in-country repairsBecause it does not have in-country repairs, warranty support requires mailing it back to China.  If you are lucky with the hardware and have no need for repairs, you get a capable smartphone for a very low price.  But first check that the 3G frequency bands are what your telco uses.I have purchased four of such China Android phones.  One died, after I left it unused for a few weeks.  Apparently, if it is not powered up, humidity built up can damage it.", "Date": "September 29, 2013"}, {"Title": "Ok for the money", "Author": "LaShondra Bell", "ReviewID": "R23MZCW6QQ50NZ", "Overall": "3.0", "Content": "I constantly had problems with the phone freezing up. It was ok for the money I spent, but you get what you pay for. I had to shut it down after having it powered for more than 2 days, so it can reboot. I was able to trade it though, and get some of the money back.", "Date": "June 5, 2014"}, {"Title": "Not so what I was expect it", "Author": "PEGGY", "ReviewID": "R17QNZZHM8REWT", "Overall": "3.0", "Content": "Not clear and hd picsSlowwwwI won't get anything like this mobilePhone everNot what I thought it would be sorry!", "Date": "May 11, 2014"}, {"Title": "screen maxxxx", "Author": "LAWACO TOE", "ReviewID": "R3M8JQ3NWKZJ3L", "Overall": "5.0", "Content": "phone creen pixel is amazing, work as a phone tablet, wifi work great ,touch screen nice and over all nice phone.Picture not Good u need a lot of light and the flash cant help ,so if you trying to start a cameraman career ,please head somewhere else.", "Date": "February 12, 2014"}, {"Title": "The phone is great", "Author": "shirley mcphee", "ReviewID": "R1ZIEEWU5NZGFS", "Overall": "5.0", "Content": "Yes the phone is wonderful . Its working well  I love it, Will order another one soon for a friends birthday gift", "Date": "December 17, 2013"}, {"Title": "Fast delivery and works great!", "Author": "Coretta Baker", "ReviewID": "R1MQGEHGMW73WC", "Overall": "5.0", "Content": "Recieved my item ahead of time and works perfect on simple mobile cellular service.Will definitely order another one as a gift", "Date": "November 28, 2013"}, {"Title": "Android Galaxy Note 2", "Author": "Salsaboriqua1", "ReviewID": "R178PB0G2K47FY", "Overall": "5.0", "Content": "PRoduct is great, runs fast and adjusted to any sim card.  I love it and will definately recomend product to anyone.", "Date": "May 15, 2013"}, {"Title": "yes its a copy", "Author": "Michael Mccurdy", "ReviewID": "R3QXO9TLHR9K2P", "Overall": "5.0", "Content": "Bought this for my wife after her unhappiness with a number of discarded phones. Yes there is a learning curve for the over 50 group but we grew up on rotary phones, radio telephones and the like. The screen is readable and the Android programs are very handy. Sound clarity is best on the speakerphone / I believe we are going to need a Bluetooth headset to make this (or any of the touch screens for that matter) practical. The included stylus is a fantastic addition if it only worked. It doesn't  come close to accessing any part of the screen. I have tried a few others with no luck as well. If anyone has a suggestion (preferably tested and proven) let me know. Overall we are happy with this one so far /time will tell", "Date": "January 29, 2014"}, {"Title": "NOT SAMSUNG", "Author": "Chi Wai Man", "ReviewID": "R2D8ZVKWJ92PLR", "Overall": "1.0", "Content": "There's not from Samsung, I only found 2 can peel off label which shows Samsung (fake), although turn on the phone, not show Samsung, no water unlock screen, no S Pen app or other Samsung app. Case size like same as Samsung Note, but no Samsung on front and peel off label on back. Seller TechWorld101 only sent RNA label for me to return, but no return shipping label, there's a loss and that's not my fault to pay for it. I'll take more pictures to show that's not from Samsung, and take video to pack for return, wish I can get full refund. I purchased a lot of good stuff from Amazon, but can't trust to buy phone again.", "Date": "June 11, 2013"}, {"Title": "AMAZING!!! SO HAPPY <3", "Author": "Mary Lou Montalvo", "ReviewID": "R2SGX1Z5AA5WHE", "Overall": "5.0", "Content": "First of all the product is exactly as the Galaxy Note II. Its beautiful and the product has exceeded all my expectations.  It came in only 5 days. Work fast, it's beautiful, the packaging in which it arrived was seamless and secure. Actually several friends, when they saw the phone, were shocked with all the details, how fast and the beauty of this phone and I just refered to several friends to buy from Mr. Keydoper as this is the second time I buy from him, and I was not disappointed. I am extremely happy with my investment.Mary Lou", "Date": "June 8, 2013"}, {"Title": "Android Note", "Author": "gr8auntcyb", "ReviewID": "R31LOX8MLGAQ4E", "Overall": "3.0", "Content": "Since my cell service is with straight-talk I was so excited to get the android note.  I ordered a sim card thru straight-talk, but it still wouldn't work.  Evidently the sim card was not compatible with the note.  Very disappointing.", "Date": "October 2, 2013"}, {"Title": "FAKE Product", "Author": "Pastor Bobino", "ReviewID": "R2PZLM2J42LEIZ", "Overall": "1.0", "Content": "This is a FAKE product it's NOT a Galaxy Note 2 I have one, on the back of a real Samsung Galaxy Note 2 phone it doesn't say ANDROID but SAMSUNG. Not saying the fake phone doesn't work well but the advertisement is deceiving.", "Date": "May 19, 2013"}, {"Title": "Miss Represent item", "Author": "Jack Flenor", "ReviewID": "R2SQM4870F7SH2", "Overall": "2.0", "Content": "I wrote the company and asked to return this item. It is NOT a Samsung. They did not state it does not work with Sprint. I am not happy with it and want to return it. PERIOD!", "Date": "July 16, 2013"}, {"Title": "n7100 phone copy cat need to send this phone back doesn't work.", "Author": "lorettea dozier", "ReviewID": "R2EWLMV0JM4D43", "Overall": "1.0", "Content": "This phone doesn't work, I need to send it back, it is a copy cat of a note book, what I received is a n7100 phone copy cat international.  I need refund and to send back.  If everything worked it would be find but it doesn't in the united stated.", "Date": "July 12, 2013"}, {"Title": "its really cheap", "Author": "addski28 \"Clarke\"", "ReviewID": "R23QPAQLEX9XQ6", "Overall": "4.0", "Content": "I've NOT bought this phone, come on though at this price its not going to be samsung.if its a working replica of the note 2 then I would be happy! ...I've had many samsung..my s2 is on its way out so I'm considering this!", "Date": "June 29, 2013"}], "ProductInfo": {"Price": "$119.99", "Features": "5.3 INCH ANDRIOD PHONE, ANDRIOD 4.1\n8.0MP BACK CAMERA,0.3 FRONT CAMERA\n3G,GPS,4GB ROM,512MP RAM\nNetwork type: GSM+WCDMA Frequency: GSM 850/900/1800/1900MHz WCDMA 2100MHz\nCPU: Media Tek MTK6577 Dual Core 1GHz", "Name": "Android S7100 Unlocked 1.4 Ghz Dual Core 3g Smartphone with Wi-fi, Gps, Bluetooth, IPS Touch (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41fOicuHxzL._SX300_.jpg", "ProductID": "B00B5X8LF2"}}