{"Reviews": [{"Title": "Beautiful & unique, but some problems with texting", "Author": "Katherine", "ReviewID": "R36E7XK8EE45B5", "Overall": "4.0", "Content": "When I opened my package, the Docomo SH-11c was neat, clean, brand new, & beautiful. Every time I close it, there are stars that light up on the front of the phone. So cute!!! It comes with manuals and most of them are in Japanese, but if you skip to the middle-end of the manual book, you can read it in English instructions. Make sure you buy the charger wire for this phone since it does not come with it! The seller was very sweet. She made cute origami shurikens as cute gifts. I can't wait to get a sim card and a plan for it!UPDATED: OctoberSoooo, I went to AT&T; & got a sim card. It worked for me. I receive text messages just fine, but sometimes I can't receive certain text messages. For example, if someone were to send me a picture text, I wouldn't be able to receive any other text messages. I can call & receive calls perfectly fine, but I was disappointed by the fact that the sms text messaging can act up sometimes. Sigh. I tried finding out what was wrong with it & I tried every option I could think of like replacing it with a  new sim card or resetting it etc. but the problem still resumes. So, I'm either going to buy a new phone or stick with this one since it's too cute. If I can't tolerate it anymore & the text messaging keeps acting up, I'm going to stop using it.UPDATED: NovemberSo, I have been using this phone & it has been working fine. I found the answers to my problem. I realize that this phone won't receive text messages if someone were to send a picture text, group text, contact information text, or video text, which sucks, but I don't have a problem with it. I have a GoPhone from AT&T; just in case this Japanese phone doesn't work, so I can switch the SIM card back & forth.", "Date": "September 7, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Available from US sellers\nMulti Color Notification Lights / Micro SD memory card supports up to 32 GB\nVideo Recording (864×480 video capture resolution) (Capable up to 30FPS recording)\n8.1 Megapixel Camera (2448×3264 pixels max picture taking resolution)\n(3G) UMTS HSDPA  800, 850, 1700, 2100 MHz", "Name": "Docomo SHARP SH-11C Unlocked Waterproof Phone White", "ImgURL": "http://ecx.images-amazon.com/images/I/41ugWTxbPLL._SY300_.jpg", "ProductID": "B00BAOA84S"}}