{"Reviews": [{"Title": "Depends on what you want", "Author": "Ichigo", "ReviewID": "R18MU24L8MDU8L", "Overall": "3.0", "Content": "I was wanting a wifi android phone, this was the cheap way to go.The phone is nice, pretty much does what I need, but it's a 'cheap version' of a android impo.It's not bad, but I would rather have a Samsung Note or Galaxy.Not much to say, it does what a phone should do, I just want something of more HQ. >_< Dropped lots of time and the screen has not shatterd yet, but I did sit my printer on it by mistake and cracked the screen some..", "Date": "March 9, 2014"}, {"Title": "Recently Purchased", "Author": "CLSUT", "ReviewID": "R3PYO6HXX1GSFS", "Overall": "4.0", "Content": "So far it has met my satisfaction and my current needs in a phone.Only drawback is that I have to charge it on a daily basis even though my usage is not that much.I would still recommend it to someone.", "Date": "March 8, 2014"}, {"Title": "perfect!", "Author": "LOLEE", "ReviewID": "R2FTC4LWICM55P", "Overall": "5.0", "Content": "The size was perfect great pictures and most of all you don't have to charge it every day. Great price!", "Date": "March 7, 2014"}, {"Title": "perfect", "Author": "olaiza pacheco", "ReviewID": "RHE4SPNVETRX9", "Overall": "5.0", "Content": "love u is the mejor product, is the more perfect, i like it mire thanks love u more you like", "Date": "January 1, 2014"}, {"Title": "Huawei: Chinese Takeover Company", "Author": "Everett", "ReviewID": "RXYDN8R118EP1", "Overall": "1.0", "Content": "Huawei is owned by the Chinese government, so expect to be tracked. This phone is not very high quality, so I would recommend getting a phone made by a more trusted company. Do not buy this, no matter the price. It is what China wants.", "Date": "February 6, 2014"}, {"Title": "ms.lin", "Author": "sandi", "ReviewID": "R1YMO2XWZA1ZBE", "Overall": "4.0", "Content": "I like this phone so much.it was brand new when I first brought it:-)so happy I got that phone It was fast and free shipping.the first time i order it .it only take 2-3 days to be here.was brand new too.I'm glad i didn't waste any money on that phone;-)hope u Guy like it too;-)", "Date": "October 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BGYOO60"}}