{"Reviews": [{"Title": "Better than an iPhone!!!", "Author": "Christopher Bothwell", "ReviewID": "R3HCE4BPCNL3CS", "Overall": "5.0", "Content": "I have had 2 iPhones before this one crossed my path. It is faster than either of my iPhones and I like the navigation platform much, much better than apple. This is my 2nd purchase of an HTC MyTouch 4G phone. I loved my first one so much I upgrade my wife to the same phone. She loves it too! Good Bye forever to the iPhones.", "Date": "April 21, 2013"}, {"Title": "SO GLAD I PURCHASED MY FAVORITE PHONE!!!!", "Author": "Mizperja", "ReviewID": "R340SQ7CI6XI6B", "Overall": "5.0", "Content": "THIS PHONE MADE ME SO HAPPY!!!!!!! I WAS SO UPSET WHEN I BROKE MY PHONE. I AM A CUSTOMER OF TMOBILE AND WHEN I TRIED TO REPLACE IT THEY NO LONGER WAS MAKING THE PHONE :(. THEY TRIED TO MAKE ME UPGRADE AND GAVE ME 3 OPTIONS.....WHICH I FELT THE OPTIONS THEY WAS GIVING ME WAS A DOWN GRADE FROM MY PHONE BOO HOO LOL. ON TOP OF THAT I WOULD OF HAD TO PAY $150 WHICH IS MY DEDUCTABLE CAUSE I HAVE INSURANCE AND PICK A PHONE I DO NOT LIKE....SO I CAME TO GOOD OLE AMAZON AND I AM SO HAPPY I FOUND MY PHONE. IT WORKS GREAT AND I AM SO HAPPY I DIDNT SETTLE FOR WHAT TMOBILE WAS OFFERING ME. I GET ALL MY UPDATES ON MY PHONE AND I CAN DO EVERYTHING I DID PREVIOUSLY. ITS GREAT AND I AM SO HAPPY!!!", "Date": "September 3, 2013"}, {"Title": "Love This Phone", "Author": "zajdela", "ReviewID": "R1BTCYQ2HFZCUY", "Overall": "5.0", "Content": "This phone is great.  It has everything except the kitchen sink (for me) as far as cell phones go.  I have had the phone for 4 days now.  I purchased the phone from Oakland Wireless.  Shipping was very fast.  From the day it was shipped to the day that I received the phone, 2 days.  I would buy from Oakland Wireless again and I would also recommend Oakland Wireless.On to the phone.  There is more on this phone than I could ask for.  My gosh, I am just so impressed.Before purchasing the phone, I read many reviews.  There were many good reviews for this phone. One review that I came across stated: 6 hours of talk time and 11 days of standby.  This may hold true if there were no preinstalled apps on the phone.  I charged my phone the minute I received it. 3 hrs later I noticed that the battery was going down. (I didn't even talk on the phone yet)  I knew how to fix this.  I would just go in and uninstall the apps that I do not need.  No can do!  Any preinstalled app cannot be uninstalled.  So I stopped the apps from running that I do not need.  My battery doesn't seem to drain as much now.All smart phones have preinstalled apps on them.  In my opinion just preinstalled the important apps and if a person wants more then they can go and download what they want.I gave the phone 5 stars as I feel it is a great and excellent phone. The phone is very user firendly, takes great pictures, sound is great.", "Date": "February 10, 2014"}, {"Title": "bad product", "Author": "rene c", "ReviewID": "R22F9SJ74PCZS9", "Overall": "1.0", "Content": "don't buy  from this seller, the product comes defective. don't waste your money. I had many problems with the phone so I decided to returned it", "Date": "April 7, 2014"}, {"Title": "Cellular Phone", "Author": "Juan A Guerrero Jr", "ReviewID": "RW378STYFFAFC", "Overall": "5.0", "Content": "New in condition as advertised, can't say how it performs due to the fact it is a gift for some one. Guesssing if they asked for it they must know how it performs. Looking to due more business with them I am very happy with their service. Thanks.", "Date": "December 15, 2013"}, {"Title": "Love it", "Author": "Amazon Customer", "ReviewID": "R2EIFR2J6ZPFLB", "Overall": "5.0", "Content": "Of all the cell phone I have had this one the just right for me. It the right size it have everything I need.", "Date": "October 23, 2013"}, {"Title": "Didn't work for me", "Author": "Eve K", "ReviewID": "R2JLSJ0HCGTHG0", "Overall": "2.0", "Content": "I don't think it is a bad product but it didn't work well for me. I prefer the blackberry phone so I upgraded to another blackberry.", "Date": "August 13, 2013"}, {"Title": "Smart Phone", "Author": "JAM \"JAM\"", "ReviewID": "RU2F1EPGJVU1E", "Overall": "4.0", "Content": "Better than any Iphone and able to download more apps than Apple; battery last a long time without recharging !", "Date": "August 28, 2013"}, {"Title": "Good phone", "Author": "Angel Aaron Jimenez", "ReviewID": "RMJIMQA5GO3UW", "Overall": "5.0", "Content": "I love this phone, i recently had to order a new one due to an incident with water in Florida, that old, \"forgot to take my phone out of my pocket\", incident. Anywways, received the package and am loving this phone, it is very efficient.", "Date": "August 4, 2013"}, {"Title": "Love this phone!", "Author": "Mel46 \"RetiredGeek\"", "ReviewID": "RURGYFLQ4FOIF", "Overall": "5.0", "Content": "We bought this phone originally to replace my wife's aging Blackberry phone. However, she found it to be to heavy for her, so I decided to upgrade my older Blackberry also and gladly accepted it when my wife offered it to me. It is easy to use and has a lot of nice features. I have had no problems with it, and it seems to have great battery life. I plug it in every night without turning it off, and by morning it is ready for another day. Of course, I have customized it to my taste, which wasn't too hard after I played around with it for a while. I have no book on it, but I don't really need it.", "Date": "May 16, 2014"}, {"Title": "love my phone", "Author": "L. Priest \"avid learner\"", "ReviewID": "R1W9U5XTHAI5BH", "Overall": "5.0", "Content": "I love the phone.  wanted one just like my old one so I would be comfortable with it.  Wish it still had a keyboard, that was easier to type for me.  Would have liked a user guide book but that's ok, its online.", "Date": "May 2, 2014"}, {"Title": "Excellent and pretty!", "Author": "Edmundo", "ReviewID": "R1CCAWL6ZF1TMV", "Overall": "5.0", "Content": "I bout 2 phones and they work well!And they have all I need, and also are very fast.Yes I recommend people to buy them!", "Date": "April 29, 2014"}, {"Title": "Broke college students need this phone", "Author": "Nick", "ReviewID": "R3GG2BOX2O3IHF", "Overall": "4.0", "Content": "great smart phone for really cheap! I did a lot of research. Needs a stronger battery, but i'm on my phone all the time.******Some reason the google play snap chat app doesn't send snaps to Iphones....*******", "Date": "April 10, 2014"}, {"Title": "Great Phone!", "Author": "Catherine Starnes", "ReviewID": "R256XTAU84VYCK", "Overall": "5.0", "Content": "I bought this phone for my son and he loves it.  He says that the phone has good reception and he likes it a lot!  Would refer friends to use this product.", "Date": "March 21, 2014"}, {"Title": "Heavy", "Author": "Mimmees", "ReviewID": "R1NJRHGVXJQIJC", "Overall": "4.0", "Content": "This phone is pretty heavy. Case seems to be a heavier metal than the first one I bought. So far it's been working pretty good. Hope it doesn't give up after the warranty runs out. That's what happened to the last one. Started acting up when the warranty expired.", "Date": "January 29, 2014"}, {"Title": "it could be better", "Author": "N. Jones", "ReviewID": "R1PNX0Q3QNK096", "Overall": "3.0", "Content": "The good thing about this phone is that it came fast.Bad thing is that it came with no manual and some ancient car charger that broke after one use. At times toss phone had trouble connecting to wifi when I need it and apparently it was used because I get updates on some one's appointments on the regular. Otherwise it's an alright phone.", "Date": "May 28, 2014"}, {"Title": "Issues!", "Author": "Nydia", "ReviewID": "R44GED323AFYE", "Overall": "1.0", "Content": "Total issues with the phone even though it was refurbished it acted like it was used for YEARS  I hate this phone needs better quality.... Suggestions just buy A BRAND NEW PHONE", "Date": "January 11, 2014"}, {"Title": "Awsom", "Author": "David", "ReviewID": "R98MF60R734PV", "Overall": "5.0", "Content": "Htc my touch 4g is really reliable to navigate in the internet for work ,school and for fun. I loved it", "Date": "December 26, 2013"}, {"Title": "great phone for how outdated it is", "Author": "David", "ReviewID": "RPH8CIDRJTE7H", "Overall": "5.0", "Content": "I broke my phone and needed a fast replacement. This phone did just the job. Its not super fast like the new phones and doesn't have a huge screen but its a good phone just to get you by.", "Date": "October 22, 2013"}, {"Title": "bait and switch", "Author": "Amazon Customer", "ReviewID": "R22RYUTXO9RZPF", "Overall": "2.0", "Content": "The seller said it was a NEW phone, but the one I received is a USED phone. My daughter has the same phone, and hers works great. The ”new” phone I bought on Amazon has tons of glitches. Beware!", "Date": "October 18, 2013"}, {"Title": "Phone is rooted, but no root access", "Author": "R. Navarro", "ReviewID": "R2EPLT1J63WECO", "Overall": "2.0", "Content": "The phone was delivered physically in good shape, but has issues with the software. The Google play store does not work. When trying to update it, I found out that the phone was rooted and thus T-mobile will not support it. If it was rooted fully, then I could have installed an updated OS. But, the phone is an intermediary state in which it is rooted (S-OFF), but does not have an su binary or anyway to access superuser. Perhaps there is a way to recover, but I have not figured it out yet.", "Date": "July 28, 2013"}, {"Title": "Phone stopped working in 6 months", "Author": "Vicki L. Sparks \"vicki\"", "ReviewID": "RK61JQMU75X0B", "Overall": "2.0", "Content": "I like the keyboard and I liked the phone while it was working.  This was my very first \"smart\" phone.  It's functions are very different from most phones, so my son wasn't able to help me find and do certain functions.  This phone was listed and sold as \"NEW\" and since I hadn't dropped it or gotten it wet (I put a case on it and screen shield) I expected it to last much longer than 6 month.", "Date": "July 21, 2013"}, {"Title": "dont buy..", "Author": "tyeonna ford", "ReviewID": "R1EUMSTY67I86F", "Overall": "2.0", "Content": "The back or the phone keeps coming loose ..cant find phone case anywhere..needs sd card right away if u want to take pics or get ringtones", "Date": "January 21, 2014"}, {"Title": "Miss it!", "Author": "shirley", "ReviewID": "R1RWDJYBLSOSEA", "Overall": "1.0", "Content": "I have used this phone for 3 - 4 years.  It was the best ever!  I rated it one star because I was forced to give it up.  It started taking pictures at random and I researched with the mfg.. I was told.  \"Time to get a new phone.\"  Hum?  Looked up glitch on line and, sure enuf, lots of people having the same problem.  I didn't want to give up this phone but seriously believed the mfg specifically encoded or electronically bugged this glitch to stimulate new sales as no one having the problem on line could find a solution.  I endured... after many weeks the picture taking slowed...but other glitches kicked in. Like just freezing - up.  Anytime, except when engaged in an actual call.  But other users I found actually had their calls freeze. Hummm?  Ok.. the freezing was the nail in the coffin.Two other adults in my home are still on their MyTouch phones and not having the problems I experienced.  Perhaps it would have been too obvious for all three of our phones to start going hay-wire?  Also, Four other family members have the new Galaxy's, ie. 2, 3, & the 4.  They are very happy, (except my Daughter, she has the G-2 which I actually tried) They acquired their phones with service discounts, for which I did not qualify. Do I like my new phone? ( the 3Gs iphone) not nearly as well. (Couldn't afford the more current models)  I did try a  Galaxy 2 - very disappointing!  Might have liked the Galaxy 3, but $200 was my budget.  The 3Gs iphone doesn't glitch, well, not much, anyway,  It was not a used phone but a factory new one.I'm not a happy camper.I actually think I would have been better off with a reliable cheapy phone and a decent ipod for the net.. Oh well... That's just my story..", "Date": "August 23, 2013"}], "ProductInfo": {"Price": "$129.99", "Features": null, "Name": "White HTC myTouch 4G Unlocked GSM SIM Card Smartphone Android Large Screen GPS WiFi", "ImgURL": "http://ecx.images-amazon.com/images/I/41QORssRbML._SX300_.jpg", "ProductID": "B00B8Y852M"}}