{"Reviews": [{"Title": "Beware it may not work abroad at all!", "Author": "Avid Reader", "ReviewID": "R38OGCTH2TPYXA", "Overall": "2.0", "Content": "I am no rookie with mobile telephony and have owned several mobile phones this being my second Samsung phone. I previously had a quad band Nokia E51 that worked fine in Panama as well as in Europe and long ago a two-band Sony Ericsson that worked in Europe but not in Panama.I bought the Samsung Chat 357 (GT-S3570L) in The Netherlands, Europe (GSM Shop) during my trip to avoid roaming costs. It came included with a T-Mobile Prepaid SIM but the phone itself is NOT SIM locked. However, I used another T-Mobile prepaid SIM I had acquired a week earlier and it worked fine.The phone when started shows the T-Mobile logo regardless of the SIM card provider; However, both the shop salesperson and T-Mobile (T-Mobile was the most helpful) assured me there was NO lock on that phone, in other words SIM lock free.Another reason why I bought this rather than a cheaper 2-band phone was because with 4 bands I thought it would surely work abroad. WRONG!!!Once I arrived to Panama I powered up the phone and it showed the No Network icon. I tried then the manual network search and it said \"No networks could be found\" which is rather strange for a quad band phone operating in a country where 3 of the 4 GSM bands are in use. None of the 4 network providers showed up in the search.I tried using two local SIM cards instead of the prepaid foreign (Dutch T-Mobile) SIM but the results where the same.If you want to buy it make sure to try it locally if that is your primary use but don't be fooled by the quad band thing, it does not assure it will work abroad!I would have given it a 3 star if it worked in Panama. The button interface may be a bit convoluted at time but once you get the hang of it it becomes relatively easy to use. The ringtones however are kind of crappy (most of them).Pity it doesn't support WhatsApp either with such nice little keyboard as almost nobody seems to use Samsung Chat (I hope it picks up...)", "Date": "April 23, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "2G Network - GSM 850 / 900 / 1800 / 1900\nSIM - (Mini-SIM)\nDimensions - 111.9 x 60.4 x 11.5 mm (4.41 x 2.38 x 0.45 in)\nCard slot - microSD, up to 32 GB\nCamera - 2 MP, 1600x1200 pixels", "Name": "Samsung Ch@t 357 GT-S3570 Unlocked GSM Phone - Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/213ks8FNtrL.jpg", "ProductID": "B00B8PB76C"}}