{"Reviews": [{"Title": "LOVING IT!!!", "Author": "wyatt wheeler", "ReviewID": "R10GUTOVJDYA6P", "Overall": "5.0", "Content": "I wished that it was white, but i got a case and it was all good.....Who ever puth this on here...YOU ARE A GOD!!!!!!!!!!", "Date": "November 18, 2013"}, {"Title": "Thank you!", "Author": "Keiana James", "ReviewID": "R2PS996DTYPIGH", "Overall": "5.0", "Content": "I was worried at first that the phone might be faulty or something would be wrong, but I am completely satisfied! Great deal and it came with everything that I needed!", "Date": "February 24, 2014"}, {"Title": "It really work excellent good job Amazon.Love  it it", "Author": "cassandra", "ReviewID": "RBTNHDVHAKNEL", "Overall": "5.0", "Content": "Yes very good my son really like it perfect.Thank u so much for your convience.★★★★★Execellent Clean New Works Good Enjoy", "Date": "February 6, 2014"}, {"Title": "very upset", "Author": "Raine", "ReviewID": "RCFSC58S8HL0S", "Overall": "1.0", "Content": "this item was purchased as a gift for me and I never got the item. I tried to ask them where it is and all they said was what is the order number. I do not have that it was a gift. so now I have no idea where this item went and whoever bought it is out of a lot of money. I will never order from this seller myself.", "Date": "June 9, 2014"}, {"Title": "I love it", "Author": "DON", "ReviewID": "R2N5QC9Y9ZS6AJ", "Overall": "5.0", "Content": "THANK YOU A+++++", "Date": "May 9, 2014"}, {"Title": "Apple Iphone 8gb for Straight Talk", "Author": "Retired Maven", "ReviewID": "R2SVW9MGJRYZRR", "Overall": "5.0", "Content": "My first smart phone. Phone works fine; absolutely no problems at all.I already had a Straight Talk 'dumb' phone. I made the change to theIphone4 online at Straight Talk web-site. In one hour my service wasswitched. For my area, the service is AT&T.;Still in learning curve for the abilities of this phone. It does everythingI need. Certainly would recommend making the change in thisway. The Iphone4 came in its original case with earphones. I purchasedthe Sim card at Walmart. Make sure to use the frame for the Sim Card.If you are not comfortable with the Sim Card, go to your nearest Applestore; they will help you for free.IPhone4 was received in secure package in no time! Very happy withthis purchase.", "Date": "May 6, 2014"}, {"Title": "Excellent Phone", "Author": "William", "ReviewID": "R1WWM15Q0RXOQQ", "Overall": "5.0", "Content": "Just as described.  Very smooth transaction.  Phone is working great and once I aquired SIM card phone was activated without any issues.", "Date": "May 3, 2014"}, {"Title": "AHHHH~~~ LOOVEEEEE", "Author": "Bakers Heart", "ReviewID": "R2P7MZZDM2B0FO", "Overall": "5.0", "Content": "PERFECT. WHAT IT SAID IT WAS. THIS WAS MY FIRST I PHONE AND IM HOOKED! ACTUALLY MY SON WASHED THIS ONE. ... AND I WENT TO AN \"ANDROID\" AND HATED IT SO I BOUGHT ANOTHER ONE!!! SHIPPING WAS A LITTLE SLOW BUT THATS OK. I DIDN'T HAVE A SPECIAL SHIPPING DATE. SO IT CAME WITHIN THE TIME ON THE RECIPT. VERY HAPPY WITH THIS!!!! THANK YOU", "Date": "April 12, 2014"}, {"Title": "when i had to call in about the product they were quick to respond", "Author": "nashira", "ReviewID": "R39ZY9OQQ4YA33", "Overall": "5.0", "Content": "great experience and thanks for the quick response. they were able to fix my concerns and address the questions i had quickly and professionally.", "Date": "March 28, 2014"}, {"Title": "Great", "Author": "Rae", "ReviewID": "R3UCAS2F2TPIY5", "Overall": "5.0", "Content": "Love my iPhone it really works great. It looks brand new and it also works like it is brand new.", "Date": "March 17, 2014"}, {"Title": "Good", "Author": "Bonnie Baker", "ReviewID": "REDU9W1ISGTI2", "Overall": "3.0", "Content": "Coverage is not as good as my old phone in certain areas, but it's great for games & is great in coverage area", "Date": "March 17, 2014"}, {"Title": "great phones bad area", "Author": "M. Jackson", "ReviewID": "R12Z1XJNLPJCDQ", "Overall": "5.0", "Content": "Phones were great just didn't work in our area.looking for ones that do. Love the iPhones and the apps on them.", "Date": "March 16, 2014"}, {"Title": "My iphone experience", "Author": "Limmea Whitley", "ReviewID": "R2C9R9O5ZFM6W9", "Overall": "3.0", "Content": "Yes it met my expectations,but  sometimes the person on the receiving end of my telephone call can't hear me! This happens a lot.", "Date": "March 13, 2014"}, {"Title": "Works great", "Author": "Kim Thornton", "ReviewID": "R38Z37E8IWZ1EI", "Overall": "5.0", "Content": "It works great. Love it! Best phone I have ever had. And no more contracts. It's the best. Thanks timberline", "Date": "March 12, 2014"}, {"Title": "Phone works great, but charging cord not so much", "Author": "Bethany D jarrett", "ReviewID": "R26PR86LM0WH77", "Overall": "5.0", "Content": "I have had this phone for about 3 weeks and I am happy with it. No problems porting my phone number and it came with a SIM card, which I had already purchased. Wish I had known it was coming with the SIM card. Anyway. The charging cord was obviously damaged, hard to believe seller didn't know it was broken, and no headphones were sent. Emailed seller, he apologized and said he would send charging cord and headphones. Like I said, it has been 3 weeks, and I have not received them. I don't really expect to at this point.", "Date": "March 4, 2014"}, {"Title": "pleasantly surprised", "Author": "Brian H. Myers", "ReviewID": "RAPVKD8NOM84H", "Overall": "5.0", "Content": "I was really skeptical about placing an order online for this phone, especially bc I couldn't see it in person, I wasn't sure if it came with a SIM card for straighttalk (it did not state if it did)...but I was pleasantly surprised that this phone was as good as NEW, I LOVE IT, especially for the price, you truly can't beat that!! It, also, did come with a SIM card for straighttalk, along with a number to call. The ONLY thing was that I did request for was faster shipping and it still took almost 2 weeks to receive - but I can't really complain too much bc it snowed here and the weather may have permitted it later or bc it was being shipped to a PO Box. Anyways, I do love this phone and are very happy, I will buy from you in the future. :)", "Date": "March 4, 2014"}, {"Title": "tbre8197", "Author": "tina brewer", "ReviewID": "R1JWKUUNA622WT", "Overall": "5.0", "Content": "I love this phone its awesome!! love the pay as you go plans toonly 45$ a month for unlimited deffinetly worth it!I paid 100$ a month through Verizon  Thanks!!!recommend to everyone!!!  Tina", "Date": "March 1, 2014"}, {"Title": "Good customer service", "Author": "Jessica Nalley", "ReviewID": "R375M1DOKJKL4N", "Overall": "3.0", "Content": "I was unable to get Straight Talk to activate this phone, but \"Johnny\" was very nice and helped me return this item.", "Date": "February 27, 2014"}, {"Title": "Not the best service...", "Author": "Jordan Hughes", "ReviewID": "R12U2SSLX0SCFT", "Overall": "2.0", "Content": "It was a Verizon phone that can't be switched to Straight Talk. It came with the charge chord but, not the wall plug in box. Unhappy.", "Date": "May 8, 2014"}, {"Title": "Haven't gotten it yet.", "Author": "Amber", "ReviewID": "R10STPI40C3448", "Overall": "3.0", "Content": "I was really excited to buy this, but I paid extra for expedited shipping! It's now like a week later.... I'll update more when I actually get to use the phone.", "Date": "February 17, 2014"}], "ProductInfo": {"Price": "$329.95", "Features": "$45 monthly service plan time card not included but can be purchased online or on phone during activation directly with straight talk\nStraight Talk SIM micro card included (powered by ATT cell coverage through Straight Talk)\nUSB Cable and Wall Charger Block\nKeep your phone number or get a new one\nNo contract! Pay month to month $45 for unlimited everything (talk, text, data)", "Name": "Apple iPhone 4 8GB, Black, for Straight Talk, No Contract", "ImgURL": "http://ecx.images-amazon.com/images/I/51PEJoYiBvL._SY300_.jpg", "ProductID": "B00BV6ZCU0"}}