{"Reviews": [{"Title": "Perfect", "Author": "Kimberly Molina", "ReviewID": "R3A91SAGR7EP9D", "Overall": "5.0", "Content": "I had this exact phone in blue. My blue one feel and cracked i got an estimate on how much it will cost me to change the screen and it wasn't worth it. so i brought this one. I love the phone. Reason being that i brought it in yellow was because yellow is my favorite color and they didn't have it at first. So yeah. I paid for faster delivery but i did get it when it said it was going to come. and thank god comes with a tracking number. So i was always checking and it was always up-to-date. Thank you! Enjoy your new phone!", "Date": "January 15, 2014"}, {"Title": "love love love this phone", "Author": "Mrs. Gibson", "ReviewID": "R2UU4DPY0G34Q2", "Overall": "5.0", "Content": "We purchased 2 of these! Fabulous phone! We already had SIM cards from our previous phones so we cut them down to fit. These phones require micro SIM cards and we had standard SIM cards. At first we had them in upside down but once we put them in correctly and gave it a minute to load up it worked great! These phones run 4G and they are FAST! I love these phones! Totally worth the price. I will buy more in the future I'm sure. Also the seller was super fast I got my phones in 48 hours!", "Date": "February 21, 2014"}, {"Title": "Internet sharing function is not enabled and I was not notified before shopping", "Author": "josuemb", "ReviewID": "R105C3TT1K7J90", "Overall": "3.0", "Content": "I have a problem with a feature of the phone I bougth: The Internet Sharing function is not working, specifically, is locked. A  message appears: \"To activate tethering in this device go to [...]\" of course I wento to [...] and there is not any option to unlock this feature.", "Date": "April 16, 2014"}, {"Title": "Unreponsive Seller", "Author": "C. Jiminian", "ReviewID": "R18J1OJVG5KBDK", "Overall": "1.0", "Content": "The phone does not work quite right and sometimes freezes on a black screen until the batteries run out and I charge it again. Even though it's unlocked, it doesn't quite fit my T-Mobile service and several features, like picture messaging, do not work. I tried to return it, but seller never responded until I got a message from Amazon telling me the return request had expired. Will refrain from buying used phones online in the future.", "Date": "April 1, 2014"}, {"Title": "Great product", "Author": "Shawn", "ReviewID": "R3UA5EEAWJ89O0", "Overall": "5.0", "Content": "I give this a 5 star because I love this phone and it is great thank you for the fantastic service!!!", "Date": "March 31, 2014"}, {"Title": "excellent", "Author": "Andreina Vicuña", "ReviewID": "R3GCQE9SIRP6IK", "Overall": "5.0", "Content": "comprehensive application in question, has a large and compact when taken into the hand, pretty useful and complete operating system, no complaints, excellent", "Date": "March 11, 2014"}, {"Title": "Excellent phone in Windows 8 Space", "Author": "rpv", "ReviewID": "RBGHQIG2388PS", "Overall": "4.0", "Content": "HTC 8X is definitely a incredible design and ergonomic. Windows 8 apps are a welcome change from iOS. Among the three ecosystems, I prefer Android, Windows 8, and iOS in that order. I got access to few Windows 8 phones to review. I will try to review them, but since I have not used for a period longer than a month I am not reviewing for reliability. 4.3\" Super LCD 2, 720x1280 resolution, 342 ppi, Corning Gorilla Glass 2. Glass 2 is overlooked. Glass 3 is in the making and supposed to be even better. Stating following because this is highly underrated in reviews. From Corning's Gorilla Glass specs; WHAT MAKES GORILLA GLASS SO DAMAGE RESISTANT? The unique composition of Gorilla Glass allows for a deep layer of high compressive stress (created through an ion-exchange process). This compression acts as a sort of \"armor,\" making the glass exceptionally tough and damage resistant. Ion exchange is a chemical strengthening process where large ions are \"stuffed\" into the glass surface, creating a state of compression. Gorilla Glass is specially designed to maximize this behavior.1.5 GHz dual-core Qualcomm Krait processor, upto 16 GB internal flash, (this model has 8GB) 1 GB RAM NO microSD slot! Battery is 1800 mAh Li-ion battery. Compared to a high end Android Galaxy Note II, which has a battery of 3100 mAh Battery. Battery is also not removable. __Not having a storage expansion slot is a bummer for lot of people! Not being able to remove battery is a double bummer.__ 8 MP camera is awesome, and HD videos were fantastic. For me, storage expansion and removal of battery is very important, so I was disappointed. This is the downside the unibody design. This is the reason for me giving a 4 star review.I have used in the past extensively HTC Titan I and II which is pre Windows 8 (7.5) and I was surprised it has become more buttery smooth now. Apps are very smooth on 8X even compared to Nokia Lumia series. Apps are limited in Windows 8 marketplace. Yes, we have heard this a gazillion times. I tried with Navigon which turned out to be great in giving voice directions.Engadget wrote after the release: \"Yes, the 8X is a fantastic ambassador to Windows Phone 8, but after using it for several days, we're longing for a similar phone from HTC running Android -- at least until a stronger app ecosystem develops for Microsoft's latest mobile OS\" This is a chicken and egg situation. Unless more phones are sold, developers don't have incentives to write apps. Apps are less now, because people are not buying in big droves. Windows Phone is now (early-mid 2013) the third-leading mobile phone platform, more than tripling its market share year-over-year. One recent report I read Android and iOS are ahead in games with 162.1 and 37.4 million shipments in 1Q13 and Windows phone came in 7 million. This is more than double from previous year. I really hope for Windows 8 platform to surge ahead because having a 3 way competition with iOS and Android is good for the ecosystem.", "Date": "May 18, 2013"}, {"Title": "Piece of junk on many levels", "Author": "kt", "ReviewID": "R30QSED7MY2VFC", "Overall": "1.0", "Content": "1.  The power button broke within 3 months.  Now I have to turn the phone on with the camera button, and wait until the screen times out to toggle it off.2.  Reception is mediocre.3.  It does not have a radio tuner.  I was told that I could purchase the AT&T; radio app, which I did, and it works about 30% of the time.  The rest of the time there are \"bandwidth\" issues, even when I am connected to WiFi.total crap.", "Date": "October 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BPGTLUS"}}