{"Reviews": [{"Title": "I am rating the phone Right?", "Author": "NightOwl", "ReviewID": "R3IX54K7YGUV5E", "Overall": "3.0", "Content": "The Steller is a good phone, Its powerful and it's well made. It has great battery life and if you have a fast Very fast SD card you would not know it was not internal memory, I am using UHS-I Class 10 Wintec Filemate Professional Plus 326GB Micro SDHC . My only disappointment is the screen, its a low end screen for Samsung. Not up to the standards of their  Super AMOLED screen  . The Old Samsung Illusion and Fascinate had a Super AMOLED screen so it has a way much better screen but  unless overclocked,  its a waste of money to use it on that pokey old as the hills phone. The Steller is a good Phone tho, the screen is OK for most people and because everything else is great I just don't understand why they did that,  I guess its because Verizon spected the phone. Well anyway it is  not a common phone and finding ROMs and Roots are hard to do, so maybe three stars because its hard to find software, I would never be happy if I were in a contract with Verizon for this phone, its not worth paying 2500 dollars over the next two years OMG no never what a rip off  .", "Date": "September 28, 2013"}, {"Title": "fairly nice phone", "Author": "hail", "ReviewID": "R2CEJ1VJPLCL65", "Overall": "4.0", "Content": "not the best phone on the market but it works and not crazy expensivepros:screen quality is goodspeaker is surprisingly loudupdated to the android jellybean4g network is fastbattery life is better than expected.the buttons on the bottom are usefulpretty sturdy considering I've dropped it about a million times ( once in the toilet!) and it worked finecons:slow wificameras are s***not all apps are compatibleheavy/ thick/widenot many good casescall quality is ehhhno flashno memory what so ever", "Date": "February 9, 2014"}, {"Title": "no complaints", "Author": "Amazon Customer", "ReviewID": "R3QSNDL0IL70R5", "Overall": "5.0", "Content": "Item was in perfect condition and fast shipping.  this was a perfect replacement phone for my son who always breaks his cell phones.  this item was just as described and was in perfect condition.thank you", "Date": "February 4, 2014"}, {"Title": "Not working when received", "Author": "Daniel J. Fleming", "ReviewID": "R171WM0Z1DD1HT", "Overall": "1.0", "Content": "Unable to send/receive text messages, despite two trips to cell phone repair shops. Really wanted dual format feature as I am new to smart phones, but this particular one I was sent should be discarded. Vendor did, however, issue full credit on return.", "Date": "December 20, 2013"}, {"Title": "Everything I need", "Author": "Michele Molstad", "ReviewID": "RAXZ9J8WHIQQR", "Overall": "4.0", "Content": "The Stellar does everything I want it to do and it easy to set up the way I want it. All of what I want without feeling like I'm being Imanipulated.", "Date": "November 26, 2013"}, {"Title": "Quick turn around", "Author": "Janis Eshowsky", "ReviewID": "RWB7BGU1URAP", "Overall": "4.0", "Content": "This item was received within 3 or 4 days after purchase.  The device was in good working order and has been working well since the purchase.", "Date": "October 21, 2013"}, {"Title": "Great Phone, Great Price!!", "Author": "Amazon Buyer", "ReviewID": "R2KVFI1VQAP7XC", "Overall": "5.0", "Content": "Great phone for a great price.  This phone has everything you could possibly need in an android phone.  Graphics are awesome!!", "Date": "July 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BEH379Y"}}