{"Reviews": [{"Title": "Blackberry Got it Right", "Author": "Bob", "ReviewID": "R1UNS0DLAN8PEJ", "Overall": "5.0", "Content": "The Z10 is not withstanding the best cell phone that I have owned yet.The apps that the Blackberry App Store has are relevant and high quality.  On Apple's and Android's app store I find myself flooded with non-relevant selections and wasting my time shifting through trying to find what I am looking for.  On Blackberry's App store I do not have this problem.  Some may find the number of apps on the Blackberry App Store as discouraging while as I find it a blessing for that fact alone.I am no longer an Android fan as their Operating Systems just seem to crash or freeze up more than anything else.  No problems with this on the Z10.To sum up the Pros:*Long lasting battery*Touch is responsive*Interface super smooth*Operations are fast*Not to mention the superb sharpness and brightness of the Screen*I am also a fan of the auto brightness functionality (the brightness of the screen auto adjusts to the light conditions).*The keyboard is better by far than any other phone I have used to include the IPhone and Nexus 4.*Not bombarded by irrelevant Apps*BBM*Security of the Blackberry OS*The price of the Z10 is comparable to Android and IPhone*Expandable memoryTechnical Features:Size: 130mm X 65.6 mm X 9mmWeight: 135.4 gDisplay: 4.2in multi-touch IPS LCD displayResolution: 1280 x 768OS: Blackberry 10 OSMemory: 2 GB RAM, 16 GB Flash and hot swappable microSD Slot with capacity up to 32 GBProcessor: Dual Core 1.5 GHzGPS: Assisted, Autonomous, and Simultaneous GPSBluetooth: Bluetooth 4.0 (low energy)NFC: NFC enabled for security file exchange and paymentsHDMI: microHDMI out portAdvanced Sensors: Accelerometer, Magnetometer, Proximity, Ambient Light Sensor (Auto Brightness), GyroscopeWi-Fi: Dual Band 802.11 A/B/G/N, Mobile HotspotNetwork Connectivity: 4G LTE, HSPA+, support for global roamingBattery Life: 1800 mAh  (Exceeding the battery life of the IPhone 5)Talk Time: up to 10 hours on 3GStandby Time: up to 305 hours on 3G, up to 316 hours on 2GAudio Playback: up to 60 hoursVideo Playback: up to 11 hoursOverall:I think this is the best phone on the market right now.  You will be pleasantly surprised and not disappointed.", "Date": "July 2, 2013"}, {"Title": "Delirious with anticipation, Zeeeeee it is!", "Author": "P. Estwick", "ReviewID": "R3BK2RJ136AQ24", "Overall": "5.0", "Content": "The phone is something else. Learning curve steep but the promise is fantastic. My local provider I yet to launch the platform to give me full support and I will gladly return and update when I get access to WhatsApp etc. contact transfer was a real challenge and getting a few email accounts set up...but again all due to some limitation on island. Great handset, white is really cool, it's super light and easy to manage all the gestures. So much to learn , the downtime is going to be worth it.", "Date": "March 16, 2013"}, {"Title": "OS is still new.", "Author": "Clayton", "ReviewID": "RE3OPNNETWHYF", "Overall": "4.0", "Content": "This phone is a quality built phone. BalackBerry is back! The OS still has some minor kinks but those will be fixed in time.", "Date": "April 16, 2013"}], "ProductInfo": {"Price": "$449.99", "Features": "BE FIRST IN USA TO OWN A BLACKBERRY 10 DEVICE!\nQuad band LTE 2, 5, 4, 17 (700/850/1700/1900 MHz)\nTri band HSPA+ 1, 2, 5/6 (850/1900/2100 MHz)\nQuad band EDGE (850/900/1800/1900 MHz)\n* WILL NOT WORK CDMA CARRIERS - LIKE VERIZON/SPRINT. MAY NOT RECEIVE 3G/4G SPEEDS WITH T-MOBILE.", "Name": "Blackberry Z10 - White", "ImgURL": "http://ecx.images-amazon.com/images/I/51r-3l5HG1L._SY300_.jpg", "ProductID": "B00BBHF5Z6"}}