{"Reviews": [{"Title": "samsung note 2- AT &T;", "Author": "madhoo", "ReviewID": "R3RX85F5JM2S7D", "Overall": "4.0", "Content": "everthing is good as expected .after a month of usage i really found it worth buying it.4G speed is good.battery comes around 48 hours at nominal use.", "Date": "June 2, 2013"}, {"Title": "I love this phone!", "Author": "Brandi", "ReviewID": "R2XY6P7FMNEJK3", "Overall": "5.0", "Content": "I was a little worried about purchasing such a large phone but in the end after always wishing I had a bigger screen decided to give it a try.  I'm so glad that I did.  I even have small (female) hands and I have not found, so far, any issues with having a large phone.  I love the camera, the screen, the larger keyboard and even have discovered that I use the S-pen (which I never thought I'd even remove from its cubby).  I never have any issues reading texts or emails (the type is large enough to not have to expand the view).  And the features (I find a couple of new ones every day) are amazing!  There are some gimmicky features, sure!  But I am surprised how many features of this phone I have now integrated into my daily routine.  I no longer carry a sketchbook (interior design student) or a note pad (list maker).  I just pull out the s-pen and all of my sketches and lists are created and stored in the same spot.  I also love the fact that I can just jot down a friend's contact info and then save it into my phone!  The camera isn't the best on the market these days but I can't complain at all!  I knew when I was doing my research that other phones had better cameras but so far the Note 2 has far surpassed my expectations!  The battery is surprisingly powerful too given how often I use this phone throughout the day.  Because of it's generous size and ease of use I am constantly looking up anything and everything online whereas with my previous phone I sometimes put it off until I could use my laptop.  I also have put away my Kindle and have now added the Kindle app to my phone.  Again, since the screen is larger I have no problem reading books right on my phone.  Once again, I love this phone!  It does everything but wash my dishes.", "Date": "January 15, 2014"}, {"Title": "GNote 2", "Author": "Sonia", "ReviewID": "R18FN5ZL41UHUW", "Overall": "4.0", "Content": "This is a really good phone. Battery holds better than the note. I got it at a good price because the G Note 3 came out with a hand full of extras but I'm sticking to this phone for a while on my $ 45.dollar Straight Talk Plan which works great on thid plan.", "Date": "November 2, 2013"}, {"Title": "good phone", "Author": "kwame", "ReviewID": "RR227VKP21Z7I", "Overall": "5.0", "Content": "Hi my name kwame I bought my phone from bayshine there is not one single starch on the phone everything works perfect the phone is so big however the charger they sent with the phone dont work so buy your own charger but good phone love it", "Date": "January 3, 2014"}, {"Title": "My Galaxy note 2", "Author": "Arline", "ReviewID": "R171AL7LXFAE3H", "Overall": "3.0", "Content": "I love the phone, but when I put  it on speaker no one can hear me talk. It is infuriating and I am disappointed but I love it otherwise.", "Date": "December 9, 2013"}, {"Title": "Battery was not authentic. Overall great phone.", "Author": "Nathanael Noel", "ReviewID": "R357I4RG6VFUIU", "Overall": "4.0", "Content": "The phone was in a great shape,  no doubt,  but it was said to be new but wasn't.  I know this because the battery was not genuine and cannot hold a decent charge.", "Date": "March 20, 2014"}, {"Title": "good quality", "Author": "Asawinee", "ReviewID": "R6ADMVCTSV90M", "Overall": "4.0", "Content": "It is a good quality mobile for me. It make me happy and convenience when I use it. I love it so much.", "Date": "March 18, 2014"}, {"Title": "galaxy note 2", "Author": "Melissa Bragg", "ReviewID": "R2Q5OEQRKB525A", "Overall": "3.0", "Content": "Charger did not work with the phone that was sent. Not the original charger.  Was very irritated about that. Phone worked good but how am I suppose to charge it.", "Date": "March 16, 2014"}, {"Title": "Works great and did not loose sound.", "Author": "Chan Sisouvong", "ReviewID": "R1BK8WAKTRTRAS", "Overall": "5.0", "Content": "My friend loves it and he praises it every day.  I popped in his AT&T; sim and he was able to get it up and running with no issue.  He works and plays on it every chance he gets when we're out at the restaurant.  So that's one phone that's got more attention than me.  LOL, but overall he was happy with the movies and music files  I loaded on his 32GB SD .  I'm an Apple lover and not a fandroid.  Not that I have any problems with Android phones (i.e. Google phone - 1st generation).  But I have to admit I love the response on it and the display is ridiculously \"big\".  I can do the same thing pretty much on my iPad mini using Skype or Pinger to make phone calls.  Anyhow, get a case and get a Zagg Shield to protect the display from cracking and getting scratched.  Highly recommended on any big phone purchases.", "Date": "February 20, 2014"}, {"Title": "very good", "Author": "Iryna", "ReviewID": "R3CLKZXSMYBJ9X", "Overall": "5.0", "Content": "The samsung galaxy note 2 is very good I like is work very  fast thank you very much love it", "Date": "February 8, 2014"}, {"Title": "great phone", "Author": "James Baughan", "ReviewID": "R2RA6WY6O0DCDF", "Overall": "5.0", "Content": "like the size of the touch screen easer to work with has a long battery life the Samsung galaxy note 2 has lots of nice function and nice size to read booksall my friends love it.", "Date": "October 10, 2013"}, {"Title": "This is Cheating", "Author": "wei jia", "ReviewID": "R7FUZ276LRELL", "Overall": "1.0", "Content": "The seller said that the cellphone is in very good condition.but Item was come repackaged. There are serious scratches on the screen. and it has Serious damage to whole phone.This is Cheating", "Date": "October 12, 2013"}, {"Title": "messaging not working", "Author": "skenton", "ReviewID": "RMQC4CRAZP352", "Overall": "1.0", "Content": "I wanted to get a phone that has a great camera. Which this phone does. What this phone is not allowing me to do is send and receive pictures. For the amount of money spent on this phone that is unacceptable. I tried to use two different phone services with the same results. No one has any idea why it is not working.", "Date": "May 29, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BHM8WOG"}}