{"Reviews": [{"Title": "Nokia Lumia 620", "Author": "Capt Slow", "ReviewID": "RCD2CPHX8K6M9", "Overall": "3.0", "Content": "Nice little phone but has some issues. This is a Hong Kong market model and the instruction manual came in Chinese (Mandarin one assumes). The phone was also loaded with a number of Hong Kong specific apps. The Windows OS is fairly intuitive and with some googling about and help from a teenager or two I was able to get along fine without the manual. The phone is of decent quality, has a nice display and very good signal connectivity. The main issue with the phone is the tiny 1300 battery which struggles to make it to 24 hours. Give it a 1700 battery or better and it easily moves to 4 stars.", "Date": "July 28, 2013"}, {"Title": "Meeting my minimum-requirements.", "Author": "madhu", "ReviewID": "R10C427L617GM0", "Overall": "3.0", "Content": "This is my first exp with smart phone and didn't face major challenges. The experience is good so far and yet to explore some more features.", "Date": "September 13, 2013"}, {"Title": "Excellent HW for the price, but not enough apps.", "Author": "jms \"jms\"", "ReviewID": "R2DOP4SXOJMLFN", "Overall": "4.0", "Content": "- HW features are great for the price (~$200 for factory unlocked version) - 5 star rating on this point.- Windows Mobile app development community is still small, and some important Apps are missing (e.g., a data usage monitor) - 3 star rating on this point.  Some of this is made up by some of the very good free apps suplied by Nokia and Microsoft.  These include, a navigation SW that doesn't need a network connection (HERE Drive+) and Translator, which were very useful on may summer holiday.Hopefully with these new mid tier Windows Mobile phones, Limia 620 and Lumia 520, the number of users will increase, and thus resulting in more Apps.- Ease of use - 4/5 stars.  Had no major problems getting used to the Windows Mobile operating system.- In all I would rate this as 4 stars.  If this becomes more popular, and the variety of apps improves, this phone would surely deserve 5 stars.", "Date": "August 27, 2013"}, {"Title": "Great small phone", "Author": "FJS", "ReviewID": "R19YDAF11IM43F", "Overall": "5.0", "Content": "Great phone, nice size and well made. It would be nice if back covers were easier to get. It was delivered on time and in perfect condition.", "Date": "October 11, 2013"}, {"Title": "great", "Author": "Boao Xia", "ReviewID": "R2G1JYXZ1MT6GI", "Overall": "5.0", "Content": "the screen is far more smooth than I expected. the back cover it like Lumia 520's, flattening and comfortable. Size fits girls with small hands", "Date": "August 31, 2013"}, {"Title": "Great Phone", "Author": "C. Pedraza \"cped\"", "ReviewID": "R121Q9LVP3DS5F", "Overall": "5.0", "Content": "Purchased this cell phone as a gift for my son, it is beautiful and runs great so far and you can't beat the price.  Great Cell Phone!", "Date": "July 18, 2013"}, {"Title": "Smart purchase!", "Author": "catalina", "ReviewID": "R4OT7KDWXREUF", "Overall": "5.0", "Content": "I am really happy with this purchase.  The cellphone is awesome. I received the product on time and according to the description of the seller (HassleFreeCell). The cellphone is unlock and is an international version. I will definitely buy from this seller again", "Date": "July 13, 2013"}, {"Title": "Good phone", "Author": "Anslem John", "ReviewID": "R2DK5XQZN8PBSS", "Overall": "4.0", "Content": "I really enjoy this phone. It takes a while to get accustomed. Works great with you Hotmail. I would recommend it for anyone with all their contacts in Hotmail.", "Date": "July 9, 2013"}, {"Title": "Review", "Author": "Gerardo Viera", "ReviewID": "R1CR61DRQC6QPZ", "Overall": "5.0", "Content": "The cell phone it great, the initial language is chinese so it become a little scary, but easily the language can be changed", "Date": "August 10, 2013"}], "ProductInfo": {"Price": "$194.99", "Features": "Dual Core Factory Unlocked\nWindows 8", "Name": "Nokia Lumia 620 3G, 5MP, Windows 8, Dual-Core Factory Unlocked World Mobile Phone - Black - International Version", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BAzmmUcvL._SY300_.jpg", "ProductID": "B00BL7ASGW"}}