{"Reviews": [{"Title": "Good choice", "Author": "May Monsalve", "ReviewID": "R1EWALI1MUZCO0", "Overall": "5.0", "Content": "Small phone (good size for my mother), great features and comfortable. No regrets about gettin' this. Also the price was the best", "Date": "April 7, 2014"}, {"Title": "Great phone", "Author": "Kerwin A.", "ReviewID": "R10VYM0QOOGWMR", "Overall": "4.0", "Content": "It's a great phone love it will recommend buying it for yourself of a friend or a relative they will love it", "Date": "October 24, 2013"}, {"Title": "Very good phone", "Author": "Jose Pequeno \"Peq\"", "ReviewID": "R19BCK47EJT6P8", "Overall": "5.0", "Content": "I love this phone. I have an Xperia Ion, and this one is like my tablet :), and the optimus L3 is my phone for heavy use, the battery keeps charge abaout 2 days with wifi, bluetooth, 3g, GPS on, when I drive use with waze, read my emails, etc, etc. Is very good to carry on, very compact.The resolution is not to see movies, pictures, etc, is a phone to have an excelente mobility and for mobile work.", "Date": "August 15, 2013"}, {"Title": "Does not work", "Author": "Alejandro Enriquez \"For an open world\"", "ReviewID": "R2IBA4NALIS1V2", "Overall": "1.0", "Content": "The celphone only restart and restar always, It doesn't work, can't do a single call or open the menu, terrible!!! Not recommended!", "Date": "August 12, 2013"}, {"Title": "Nice phone large screen good price", "Author": "Mark V. Epelbaum \"Mordechi\"", "ReviewID": "RSHPHFM1K2AMY", "Overall": "5.0", "Content": "This phone is perfect for me it has a big screen slim modern design and a very responsive touchscreen. Now I can do all my business on the move, because of the features that come with the phone. The WiFi is very easy to set up just a touch of the button. The best thing is that I just popped in my SIM and the phone was ready to use.thank you!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "July 11, 2013"}, {"Title": "It doesn't work", "Author": "Camila Ekizian", "ReviewID": "R2MSG6S5PCRHWD", "Overall": "1.0", "Content": "It came failed. It only loads and loads and loads without an end.I have been waiting for this product and it came failed.I'm very sad about this because I thought that this purchase will be good, but it is nothing of what I wanted.The product came good, with all the manual, warranty etc, but it doesn't work!!!Please buy things in good statee!!!!!!!!!!", "Date": "July 10, 2013"}, {"Title": "thank you.", "Author": "Jimmy Juarez", "ReviewID": "R3QCJZ88TSXCCF", "Overall": "1.0", "Content": "This is not the phone I am looking for.  It is my mistake to not look into details. I am looking for LG Optimus vs950.", "Date": "January 8, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BL9TV5Y"}}