{"Reviews": [{"Title": "Fast and Frugal!", "Author": "Wade Norman", "ReviewID": "R2HAK1JGWHZVVW", "Overall": "5.0", "Content": "This phone is amazing for the price listed. If this was a Samsung device they would charge this price for half the specs. I got this phone when it dropped down to 179.99 and I am so pleased that I was able to grab such a capable device for less than 200$.I got this phone in order to replace the Samsung Exhibit 2 (now called the Galaxy Exhibit). If anyone has the Samsung Exhibit 2 and are on the fence about making the switch wait no longer. It is worth it.Out of the box this phone is running on the Jellybean update 4.1.2 that was released earlier this year(2013) I think it first rolled out in March. P76920d is the proper name for it. It was pulled within weeks because it had security issues and other bugs that made the phone run less smooth. However, as I am writing this review T-mobile sent out another over the air(OTA) update to Jellybean now P76920f and I have to say it is running so smooth. So if you buy this phone just do the OTA update and your device will be running as smooth as it can from here on out. The main reason that users desired the update in the first place was the fatal flaw in the Ice Cream Sandwich software which doesn't allow apps to be stored on the External SD card. Orginally this phone only had 4gb in the internal memory and after you account for all the LG and T-mobile bloatware it comes down to a measly 1.8 GB making that flaw a real annoyance for anyone who are heavy app users. The new update finally allows you to move apps to your sd card. You have to go into your file manager and move the folder of that particular app to your External SD. Not as simple as having the ability to move them directly from the app settings but still works. So now your External SD actually has a purpose.THe 4.5 inch screen on this device is gorgeous. Not as bright as all of the other higher end devices but then again it doesn't sport the price tag of those other devices either. The display is all you would hope for in a device that costs this much! I just can't get over the reality that this phone is under 200$ It is actually the perfect size for me. I didn't want a phone that was to large to fit in my pockets and this phone is just right. It isn't bulky at all and LG is a quality brand that always takes its time in building a cohesive design. It's rectangular shape makes it feel really sleek and smooth.The phone has a dual processor with 1gb of ram and it is a really fast device even without lte speeds. I haven't experienced any lag at all with this device.I do wish you could get rid of all of the tmobile and LG bloatware because it would really be a device to be rivaled. I wouldn't be surprised if they made a sequel to this device that had a cleaner version of android.the bloatware doesn't hinder the phone speed from my point of view. However I do realize that My main comparison point is with my previously owned Galaxy Exhibit . I was testing this phone alongside my friend's nexus 4 and it was actually providing legitimate competition in terms of speed.So I am happy with the performance of this device!The battery life on this phone is also a strong point.The phone's charge last about a day of moderate usage and 8-10 hours of heavy use. The part that drained my phone the most was the gps when I was heading from Carol Stream Illinois back to Chicago.(about a 50 minute trip) For some reason this is the only thing I have experienced on the phone that dramatically eats away at the battery. I was able to watch 8-12 episodes of shows on netflix without needing to recharge.The camera on the phone is a weak point. In well lit areas the Camera performs as most point and shoot devices but in areas where lighting is limited its presence is nonexistent. The hd camcorder is the same story. In well lit areas I was actually impressed with the quality of video the phone captures.The speaker on the phone is ok. It isn't as great as the htc one or even the iphone 5 but it isn't the worst speaker. As far as call quality goes it is actually pretty good but listening to music or streaming videos it is just ok. Not bad not great just alright.Well those are all the things that come to mind so far but I will continue to update this post as problems arise or new treasures are discovered!", "Date": "July 22, 2013"}, {"Title": "Good phone with one huge flaw.", "Author": "Dave", "ReviewID": "R39WSE95HBJMTC", "Overall": "3.0", "Content": "Other people have done a great job speaking good of this phone and I agree with them. However, nobody seems to have mentioned a really huge flaw with this phone.  The internal memory is only 4GB of which about 2.5GB is used by the OS, leaving you 1.5GB for Apps.  There is an SD card slot, but you cannot install Apps to the SD card.  You can put movies, music, pictures on the external card, but there is no way of using the external SD card for Apps.  This is a huge limitation and I cannot recommend this phone for that alone.  Want to put a GPS program with maps on this phone?  You can't since most maps easily go over 2GB.  Want to install a 1GB game like Asphalt7?  You can't due to this limit.  Other than that huge problem, it is a good phone.  Camera is also pretty bad.  Screen is great, speed is great, Jellybean update is nice.", "Date": "July 28, 2013"}, {"Title": "LG Optimus L9 4G Android Prepaid Phone (T-Mobile)", "Author": "F. Giorgio", "ReviewID": "R20ORI1583H2PZ", "Overall": "5.0", "Content": "love, this phone. I've always had a phone with a QWERTY keyboard and this super light phone has led me into the world of on screen keyboards! I love that it comes loaded with Google Chrome so it's easy to use and I can sign in and access all my computer bookmarks. The display is easy to use, the commands and buttons are amazing. I would recommend this phone to a beginner or an expert smartphone user! :)The LG Optimus L9 from T-Mobile has a snappy dual-core CPU, 4G, Android 4.0, and a 1080p HD camera.Reasonable price half the price of the Samsung galaxy s2 and much better phone ,love LG and design .", "Date": "June 24, 2013"}, {"Title": "Love this phone!", "Author": "Phia7", "ReviewID": "R2XFK6X3CVFHYZ", "Overall": "5.0", "Content": "My husband had a samsung dart phone and it kept losing reception and it just eventually stopped working completely. So I got online and started doing some research and came across this phone. I read reviews on cnet and other sites and people seemed to really like this phone, so I ordered it. When we received it, it came well packaged and was very easy to switch from our old samsung dart to this one. It does take a different sim card than the samsung dart, so we had to call T-mobile to get it activated but that took less than minutes. It has a large screen size, very vibrant colors, gets much better reception and has all of the latest features you would want in a smartphone. The battery does drain if you have a lot of apps going or if you have your wifi or gps running, but if you use it just to check email or normal browsing then the battery last as long as any other smartphone. Highly recommend this phone to everyone!", "Date": "July 19, 2013"}, {"Title": "Very Nice Phone For The Money", "Author": "J. Stuart \"Sinth\"", "ReviewID": "R3RZOQV5MZ9TRC", "Overall": "5.0", "Content": "I purchased this phone back in November 2012. I got it directly from T-mobile at the time for $200 with $50 prepaid minutes. I upgraded from the T-mobile Optimus-T. This was a HUGE upgrade from what I had.PROS:I love the screen and the controls. It is very peppy, equipped with a dual core processor. The colors are vibrant and the 1080P video recording looks great. The camera is excellent outdoors and so-so indoors. So far this has run pretty much every app I have thrown on it without a problem. I would easily buy this phone again. I love LG phones and consider them as good if not better than Samsung. My screen is much bigger than what you would find on an iPhone, but the resolution seems to be just as good (side by side).The phone quality is excellent. It allows for 4G data, although you can specify 2G only or disable data altogether. The GPS works great. I currently use Co-Pilot for my GPS maps and GPS status for tinkering around. It also works great with Torque. I use the Bluetooth a lot and have no quarrels with it. The Bluetooth range is excellent.The Wi-fi also works great. I use this phone without a data plan, so the wi-fi is a lifesaver when I'm at home so I can check my e-mail and browse the internet. Internet browsing on this phone is so good, thanks to a nice large screen, that I don't even use my computer anymore.CONS: My old Optimus-T allowed me to copy apps to the SD card, saving me on my limited 200mb internal storage. The Optimus L9 does NOT let you copy programs to the external SD card, which I though it could when I bought the phone. The 2gb internal storage is much bigger than my old phone, but it fills up very fast. I wish they had either put more inside this phone or allowed transferring apps to the external SD.  I understand this is a limitation put on by the Android ICS OS and not LG.It WILL allow you to put music, pictures, videos and other files on the external SD card, so all is not lost. You can also set up the native camera and video recorder to put files on the external SD card, saving internal storage space.CONCLUSION: I would easily buy this phone again. The phone quality is excellent and it functions like a dream. If you need more internal storage, consider going with the LG Optimus G. You can't beat the price on this phone.", "Date": "August 3, 2013"}, {"Title": "Check the stereo jack as soon as you get it", "Author": "Hareesh Janakiraman \"swapice\"", "ReviewID": "R3DOO6WCYWE2RS", "Overall": "1.0", "Content": "The audio connector was broken in mine. I had not used it even once. It is unbelievable a new phone can have this problem. By the time I noticed the issue, it was too late to return it. (I think)", "Date": "November 12, 2013"}, {"Title": "Perfect for me", "Author": "Slnrd \"slnrd\"", "ReviewID": "R10EB4QMACQWN2", "Overall": "5.0", "Content": "Very happy with my phone. I use this as T-mobile prepaid (no monthly plan).Nice size, fast, great screen color & resolution, excellent wi-fi and bluetooth.  My home wi-fi speeds are 16000 kbps download and 5500 upload.I installed a big SD card for music, pics and video.  Downloaded all the apps I need: FB, Chrome, banking, etc. (I don't play any games on it).The MagicJack Talk Back app let's me talk for free when wi-fi is running - saves me $$$ and automatically routes calls from my MJ Plus at home to my cell anywhere in the world if I'm connected to wi-fi - very cool because people don't have to call home and then my cell.Battery life is good for me with wi-fi and bluetooth on, checking email all day and some occasional web browsing. I have USB chargers in my car, work and home so keeping charged is no problem.Love the ICS 4.1.2 (rev. F) update (July 2013). Camera is OK (it's not a Nikon).  Speakerphone plays out of the back but I have bluetooth in my car and don't use the speakerphone much anyway so not an issue for me.Great phone for the money.", "Date": "August 2, 2013"}, {"Title": "great phone for the money", "Author": "intothewild", "ReviewID": "R1CQVJ1ZSQGJ05", "Overall": "4.0", "Content": "I have / had several phones including the iphone 5 and this phone for the price is great !  It works very well and is 4g service.  I am not sure why you would buy or pay more for a phone.", "Date": "July 26, 2013"}, {"Title": "Believe the Reviews, Stellar Phone", "Author": "Chunky Drummer", "ReviewID": "R2633U70DSKAOQ", "Overall": "5.0", "Content": "Selling points: Lightweight, fast, love the skin they put on android (great GUI for the custom menus), camera quality seems great so far, etc.Cons: So far the only thing I don't like is the power button could be more elevated. Minor issue thoughUPDATE -->Recommended accessory for a runner: http://www.amazon.com/gp/product/B00B1EXGRI/ref=oh_details_o01_s00_i00?ie=UTF8&psc;=1Ok I'll admit I only just opened the runband, but it fits so perfectly I don 't see how I'll be upset (that was my only concern). Product seems sturdy.", "Date": "July 12, 2013"}, {"Title": "Easy to use,", "Author": "Elaine Reichard", "ReviewID": "RM9JEHNDF4B3U", "Overall": "4.0", "Content": "I switched to this phone from a basic phone and had no problems with the transition. I'm fiftyish and the large dialing keypad is helpful. The contact list is also easy to read. I also purchased a case which is great protection, but it also makes the phone too large to carry comfortably in a pocket.  Overall, I really like the phone.", "Date": "July 20, 2013"}, {"Title": "Totally awesome phone!", "Author": "Jason Brink \"Jason\"", "ReviewID": "R1RI455DU9KCY6", "Overall": "5.0", "Content": "The phone is an excellent phone! I get great service and it is packed full of features! This is by far my best purchase of a phone.You will love the size of the screen and the thinness of the phone. Battery life is exceptional, and bluetooth features are seamless!I highly recommend!", "Date": "June 22, 2013"}, {"Title": "A very nice handset!", "Author": "A&F; Moose 1892", "ReviewID": "R20ZKWHDJ6ZM15", "Overall": "4.0", "Content": "Bought this LG for my mom whom has never owned a smart phone. She really loves it! After helping her set up her emails and favorite apps, I would summarize this device as the following:-Pros-Excellent call quality. When she calls me on my HTC her voice is loud and clear, which is a significant contrast to her previous Sony Ericsson.Good battery life. She charges it probably once every other day.Smooth scrolling. No lagging at all.Bright and colorful screen. Nice color contrast and depth.Modern (although not the latest) Android OS.Micro SD card slot.-Cons-Too many bloatware from T-Mobile. I'd have to root the phone to get rid of them.Mediocre camera. Slow to get it to work and so-so image quality.Overall, I'd recommend it if you are not a huge geek and need a phone that does well at calling, emailing, texting, and some gaming. Enjoy!", "Date": "August 8, 2013"}, {"Title": "You won't be dissappointed!", "Author": "ReadLoveEat", "ReviewID": "R1Y8K2JCP9MX7L", "Overall": "5.0", "Content": "This phone is amazing! I've had it for several months now. First of all, the T-Mobile Pre-Paid plan is a straight $50 a month ... consistently. Unlimited text, talk & 500mb of data.  If 500mb of data isn't enough, upgrade to 1GB for $60. No contract and you can upgrade/downgrade your plan month to month. No hidden charges or fees attached.The phone itself is nearly flawless. It's fast & extremely responsive. The camera is decent & video is excellent. The speaker is also decent. You can use voice commands for almost anything, talk to text/email, voice search Internet/Google Maps etc..., you can even say \"cheese\" or \"whiskey\" and the camera will snap a photo.Nice built-in LED light, which responds to any flashlight app. It's extremely bright and will light up and entire room.. The phone is very slim w/ a large \"gorilla glass\" screen. It's very comfortable to hold and easy to stow. It uses a mini-usb jack which will work with any LG or Samsung plug. It also acts a multimedia storage device (a giant jump drive) so if you plug it into your computer, it bypasses the phone and allows you to transfer files or media instantly. Very easy to use interface. Uses current Android software and updates easily.Having previously owned both an iphone 3G and a 4G, I absolutely prefer this phone ... hands down.", "Date": "July 27, 2013"}, {"Title": "Highly recommend!", "Author": "Jeremy R Barfield", "ReviewID": "R3P2IH8QV3IKC7", "Overall": "5.0", "Content": "The LG Optimus breaks the barrier between mid range and high end smartphones. This phone has all the latest features from lg and it comes with the Google now feature which can not be understated as epic. You can play all the latest games to capuring pictures with the new apps from google play store.*4.5 qHD with 900x640 screen with Gorilla Glass and quickmemo*5mp with HD recording/flash, panarama, continous shooting, and a front facing camera*.36 thickness that has a rubberized back for easy holding and the stylish design that can easily fit in your pocket*2150 Battery that surprisingly is longer than the iphone, galaxy, and blackberry*1ghz dual core processor A-9 chip (that makes gaming beast)*4.1.2 Android version with all the cool designs and features from googleI love this phone for its design, high end features such as texting well watching a home video you took with this phones HD camera, and the way the apps are smooth to open and close. Not only does the battery last long but the graphics on game play are above average for such a budget friendly phone. Dead Trigger was great to play with little to no lag and the zombies appeared to be as gruesome as they are on the samsung galaxy s3 to racing on the streets with ashphalut 7. Enough cant be said about how great this phone is for beginners to experts in either the movie watching, game playing, taking pictures, muiltie tasking between apps, taking quick memos for work, or just reading a good book; this phone is the new standard for getting things done. For the price of this phone and what it can do in the high end features its just to great of a deal to not take advantage of!", "Date": "July 3, 2013"}, {"Title": "Good Phone On T-Mobile & MetroPCS - Replaced By LG F6", "Author": "Alan  Houston", "ReviewID": "RBHJB6MUTRIVT", "Overall": "4.0", "Content": "The LG L9 has a large screen, yet is slim and fits in tight pockets.  It does NOT have 4G LTE but has the almost as fast 4G HSPA+ to stream Pandora Radio or watch Netflix videos.It has been replaced by the new LG F6 with 4G LTE but the LG L9 is an equally good phone.Check prices.  T-Mobile has been selling the L9 at its MetroPCS stores for a much lower price than at T-Mobile stores.", "Date": "October 24, 2013"}, {"Title": "Would definitely recommend this phone", "Author": "Ryan Kersten", "ReviewID": "R2W624RPBRXN5I", "Overall": "5.0", "Content": "Very good phone for the price! If you're not a constant mobile game player, battery life is awesome too. And the screen is extremely scratch resistant; i have had the phone for a couple months now without a screen protector, and have yet found a scratch.", "Date": "October 15, 2013"}, {"Title": "I like it; the only problem is the battery is running out fast and not last long. LG need to improve battery", "Author": "Shamal", "ReviewID": "R39DR8Q6E880SR", "Overall": "4.0", "Content": "I like it; the only problem is the battery is running out fast and not last long.If LG improve that problem I recommend it to everyone.", "Date": "October 3, 2013"}, {"Title": "my 2nd smartphone and so far, it is great", "Author": "Katya \"NYCAmberLady\"", "ReviewID": "R11M9R5NTZ7O5P", "Overall": "4.0", "Content": "I got this a month ago.. and it is so far, superior to a previous my touch slide unit I had.  It is lightweight, slim, responsive,attractive and a bargain by comparison.  I use it for a $ 50 or $ 60 prepaid monthly plan by T Mobile, while my friends pay MUCH More for two year plans with, for example Verizon.  . I bought a case through amazon, which makes it bulkier, but feels safe when dropped.  I appreciate the dictation feature, and never type a text, and rarely type an email, rather dictating themI suspect I am only using a few of the available features.. I do know that Sending photos is easy.. I actualy don't know what else to say, using the 4G network, things are comfortably fast.. and without any instruction, I have found my way around all the features that I have, so far..needed. Based on my experience, I absolutely recommend this phone.", "Date": "September 4, 2013"}, {"Title": "Amazing phone for the price.", "Author": "Nicholas K", "ReviewID": "R1C3T4XB7OKQC9", "Overall": "5.0", "Content": "For under $200, this is one AMAZING phone. I bought it about 6 months ago at target, when it was still $200. since then I have played around with many apps and games, and also rooted it. I can tell you that the 1000mhz dual core processor will not dissapoint, and there are very few times that I have experienced any lag. The only downside I can think of is the fact that it is only HSPA+ 21, not LTE. Although, I usually get speeds around 8-9mbps down and around 2 up, which is more than enought for me. Lastly, the battery life. I have bought 3 extra batteries for it, but rarely use them. The 2100 mah battery will usually get me through the day.", "Date": "July 29, 2013"}, {"Title": "Nice Product.", "Author": "NiK", "ReviewID": "R2ZNYCHLAK1QSI", "Overall": "5.0", "Content": "This is a Nice Product. This product is, as described in adv and does as it is said in adv.", "Date": "February 3, 2014"}, {"Title": "A poor man's S4", "Author": "RJ", "ReviewID": "R3UIN4B0I8W0ZH", "Overall": "5.0", "Content": "It does everything an S4 does, minus the Samsung SuperAMOLED screen.  Picked this up for 179 on sale.Perfect phone, with one little flaw.  The headphone jack is finicky.  It works with some headphones, but rejects others...not sure what's going on here.  A few people have commented on here with failed headphone jacks too.", "Date": "January 1, 2014"}, {"Title": "Now the kids can't tease me about my \"dumb\" phone!", "Author": "MaryBeth J.", "ReviewID": "R3DGD88O9VFFCK", "Overall": "4.0", "Content": "The phone works fine on the Walmart Family Mobile plan. I am not a big app user. The 4G speed is very good at my location. I just wish I could use it as a mobile hot spot. I may root the phone; but, I need to do a little more research.", "Date": "November 27, 2013"}, {"Title": "Very good phone", "Author": "Georgi Popov", "ReviewID": "R33XOS4L4W1VJZ", "Overall": "4.0", "Content": "It is a very good phone in the price range. It is not indented for gaming, but everything else runs OK.", "Date": "October 31, 2013"}, {"Title": "amazing for the price", "Author": "Bob", "ReviewID": "R18K4R0S08CJS6", "Overall": "4.0", "Content": "This is a tremendous bargain for the price. Surely the best $ value currently on the market. Combined this with the Myfamily mobile for $39.88 a month from Walmart. (Via t-mobile) getting 2.5 gb of g4 and we are happy happy campers.", "Date": "October 19, 2013"}, {"Title": "I love this phone", "Author": "rosie", "ReviewID": "R2IJOSC5Q6N1FC", "Overall": "5.0", "Content": "The phone does everything i expected it to do, which is a good thing. They only thing I wish was better is the music volume. My music does not play loud enough.", "Date": "October 17, 2013"}, {"Title": "Great Buy", "Author": "Jim G. Hurd", "ReviewID": "R1W4YQRB3DXVY5", "Overall": "5.0", "Content": "One of the best phones I have ever owned. Easy to use, great sound, and very easy to view. Sure is better than buying a phone from TMobile.", "Date": "October 2, 2013"}, {"Title": "Great!", "Author": "R. Tepper", "ReviewID": "R20FNJUIYU3O7N", "Overall": "5.0", "Content": "Much better than anticipated! Great price too! Bought Mania Gear cover with it. Clip broke off, but still a very nice case!", "Date": "October 2, 2013"}, {"Title": "LG phone", "Author": "michelle borrell", "ReviewID": "R2J4EYZDEOMFMB", "Overall": "5.0", "Content": "I love it best phone ever im glad i got it from here and no where else big smile on my face", "Date": "September 24, 2013"}, {"Title": "Great Phone, Great Price", "Author": "Tameka  Jordan Wimbush", "ReviewID": "R120NHH3GT54DG", "Overall": "5.0", "Content": "This is a great phone.  I love it.  I've notice several people with one, so it must be pretty good.  Can't beat the price.", "Date": "September 23, 2013"}, {"Title": "Great purchase for it's price!", "Author": "Milena N. Trifonova", "ReviewID": "R3FM32G8B9KACV", "Overall": "5.0", "Content": "Great purchase for it's price! My first smart phone-great colors of the screen, fast, reliable. The screen is big enough so you can see , but you can still put this phone in your pocket!", "Date": "September 18, 2013"}, {"Title": "Great phone overall!", "Author": "Drae Burgener", "ReviewID": "RK4YSQ73218E9", "Overall": "5.0", "Content": "A lot of people will say that this phone is \"good for the price,\" but it is great in general.  The stats are good, the community around it is great, and the build quality is awesome!", "Date": "September 16, 2013"}, {"Title": "Nice phone", "Author": "Ashok Nath", "ReviewID": "R3QTNKO90A8FOK", "Overall": "5.0", "Content": "Nice phone for the price, battery life is also as expected(if you are not in WIFI all the time), large screen with descent screen resolution.", "Date": "September 16, 2013"}, {"Title": "LG L9 cell", "Author": "corgi", "ReviewID": "R2UZRUBZT6LDG7", "Overall": "5.0", "Content": "AS promised and working fine within 15mins...so good we will most likely buy another. On time, undamaged priced fairly.thanks", "Date": "September 13, 2013"}, {"Title": "awesome fast phone", "Author": "brian thomas", "ReviewID": "R13XNSUCYNZG6Q", "Overall": "5.0", "Content": "i switched from the sprint galaxy 2 after it got stolen and found this phone during my search for another and love the choice i made", "Date": "September 9, 2013"}, {"Title": "About what I expected", "Author": "Jonathan Manz", "ReviewID": "RX9EG3QTKPEUL", "Overall": "4.0", "Content": "Surprisingly comfortable to carry considering its size.  Seems to hold a charge well.  No unpleasant surprises, so I guess I'm satisfied.", "Date": "September 7, 2013"}, {"Title": "Love this phone!", "Author": "Nicholas J Malm", "ReviewID": "R59XR8V0NQ0ZD", "Overall": "5.0", "Content": "Does everything I want! Does come with a lot of useless T-mobile bloatware that can't be removed. Not a huge issue.", "Date": "September 4, 2013"}, {"Title": "Great Product, great price!!", "Author": "Jay Mittal \"Dr. Mittal\"", "ReviewID": "R2KFCQR7WA7Q79", "Overall": "5.0", "Content": "It comes as a T Mobile Prepaid phone and it is a great phone, fast speed on WiFi, nice and large screen with several options to add on!! great price,", "Date": "September 3, 2013"}, {"Title": "Superb device for the price tag.", "Author": "sudarshan anand", "ReviewID": "R24SDM3FR5YTUQ", "Overall": "5.0", "Content": "I use it for basic features such as voice call, text, emails, GPS, camera and lite browsing. This device scores a 5* in all except the camera category. Do not hesitate to buy this if you are looking for similar use.", "Date": "September 3, 2013"}, {"Title": "Good and reliable. This is a great starter phone", "Author": "DChang", "ReviewID": "R3HV5MWDBSQ060", "Overall": "4.0", "Content": "I bought this phone for my dad - who has had a dumb phone/flip phone his whole life. With that being said - this phone was good - it felt a bit flimsy in the hand, but the functions were great.I think everything works pretty well - the speakers, the \"grip\" feel, the rocker buttons, to the screen - they all feel good; not excellent - good.The screen brightness should have an AUTO setting, the home button is a bit mushy - but these are all small qualms.Overall, if you are considering another flip phone or \"dumb\" phone, you might as well get this. Go android!", "Date": "September 2, 2013"}, {"Title": "Good phone", "Author": "anh", "ReviewID": "R3E9V8J7IMF47Y", "Overall": "5.0", "Content": "I got this one when it was on sale. Good price for the features. I hope the deal will be back soon.It has duo core CPU, 1GB RAM. I do not like the 4GB of internal memory but it has micro sd slot --> fine to me. The screen is 5xx by 9xx (not HD but enough). Easy to unlock.It has big screen (4.3\" as I remember). A little bit hard to put in pocket. But it is not a problem to me.The back panel is plastic. You can change the back color easily.", "Date": "September 2, 2013"}, {"Title": "Superb quality phone for a superb price", "Author": "Daniel", "ReviewID": "R2E32VO2EZ9SBS", "Overall": "5.0", "Content": "I purchased this phone for use with T-mobile's new-ish Simple plan. I jumped on this particular phone because there was an Amazon promotion that allowed me to purchase this for $150 before taxes.Prior to my purchase, I read plenty of reviews for this phone (on Amazon as well as on other tech sites). The general consensus around this phone is that it was a mid-range Android device that would get you the most bang for your buck. Part of the reason is because of the price point for this phone. In the coming months before I bought this phone, I saw it drop to $180 and $150. I understand that this is partly because the next iteration of this phone is coming out soon (or has already been released), so this would be considered \"yesterday's technology\" by today's standards.After receiving and using the phone, I would have to echo the general consensus' positive sentiments. This is my first Android phone and it certainly doesn't not feel the least bit \"mid-range.\" The phone is speedy and super responsive. The screen is beautiful. The call reception/volume is superb. The battery is just fine for a smartphone (\"just fine\" meaning it can go through a single day with \"regular use\").The only complaint I have with the phone is that it comes pre-loaded with a ton of bloatware. This isn't a huge issue, but there is certainly some housekeeping to be done when you first receive the device.Another thing I would like to point out is that this phone is capable of making Wifi calls. By default, the phone turns on this feature. This means that if you're connected to a Wifi network, the phone automatically switches over from cell towers to your Wifi network in order to place and receive calls. I dislike this because if your internet connection is not that great, your call quality is going to be subpar. Furthermore, T-mobile still \"counts\" your Wifi minutes towards your bill if you're on a metered plan (which makes no sense to me because you're not relying on their cell towers to conduct your calls.) But either way, everyone should turn off this feature for this phone. It's simply annoying and would cause more problems in your service. The only instance I can see this feature being useful is if you are in an area where you get spotty reception, but do have great a Wifi connection/speed. Then that might potentially be a life saver.All in all, this is still an AWESOME phone! Love it!", "Date": "September 1, 2013"}, {"Title": "Content", "Author": "Sally Chaney", "ReviewID": "R4LI4FJLOMQ09", "Overall": "3.0", "Content": "I like the phone dont get me wrong, but it does not go on the internet very well when you have no wi-fi. Thats the main reason i bought it. The phone itself is okay.", "Date": "September 1, 2013"}, {"Title": "Thin, light, functional", "Author": "J. Lee", "ReviewID": "R2317J1CZERTMA", "Overall": "5.0", "Content": "This was purchased for my mother who WAS an iPhone 4 user.We were worried that she wouldn't be able to adapt to android, but she had no trouble zipping through apps, mp3s, and other functions.She really loves the larger screen & the best part is that she now only pay $20 per month through t-mobile's family plan.", "Date": "August 31, 2013"}, {"Title": "Love it, but could be better.", "Author": "Daniel Estrada", "ReviewID": "R35B3M4ZY4ZZ4H", "Overall": "4.0", "Content": "I just got this phone today, and let me tell you, for the price is excellent!However, I already have less than 1GB memory, I got a 32GB SD but it's merely useless since you CANNOT move apps to the SD card.", "Date": "August 29, 2013"}, {"Title": "Great Value", "Author": "David G.", "ReviewID": "R1W651IZSV8CQV", "Overall": "5.0", "Content": "So far I find this phone to be fantastic. Now, I know it doesn't stack up well to the newest high end phones on the market, but as an upgrade to an older LG Optimus T, this thing is fantastic. I don't really play a bunch of games on my phone, so the paucity of storage on the phone doesn't bother me. The phone operates smoothly and is very responsive. Apps open quickly. The screen is bright and crisp. The phone is very light and feels good in the hand. My phone received the OTA update to 4.1.2 very shortly after I booted it up. For the price, it seems to be an excellent value.", "Date": "August 27, 2013"}, {"Title": "Good phone for the money (T-mobile version)", "Author": "Hardware Traveler", "ReviewID": "R1QASC626A87US", "Overall": "4.0", "Content": "Pro:  T-mobile allows wi-fi calling on this phone which means not having to worry about cell tower bars around home.  Basic android phone; fits OK in your pocket, and battery life is acceptable.Con:  crapware that comes preloaded on the phone cannot be all removed without rooting the phone.", "Date": "August 22, 2013"}, {"Title": "A definite upgrade!", "Author": "Me", "ReviewID": "RVQ38BUYVE7CA", "Overall": "4.0", "Content": "I bought this phone as an upgrade from my Exhibit 2 and it certainly is an upgrade. Everything about the phone is better than my previous one. Now that is not to say it is perfect, there are several aspects about the jellybean operating system I don't like. The biggest drawback of course, is the inability to move the apps to my SD card. Yes this can create an issue with a lack of internal memory which is the whole reason for having an external memory card but the Google developer in their wisdom decided we shouldn't be able to use it any longer. But the fact is that I load very few apps on my phone anyway so this was not a big deal to me. This is not a top dollar HTC 1 or a Galaxy S4, but for an inexpensive prepaid phone it works great! It is much faster and smoother than my old Samsung. The Screen has great resolution and everything just seems to work a little better. T-Mobile still loads it with too much bloatware but once again that is the name of the game.", "Date": "August 20, 2013"}, {"Title": "It's a good phone!", "Author": "DVB", "ReviewID": "RD51WWXDC19BC", "Overall": "4.0", "Content": "I like the phone but I am a little disappointed with the sound quality, it's not the best! It is very hard to understand people sometimes, a lot of backround noise, static? I purposely waited awhile before I reviewed it because I wanted to use it for awhile first. After having it for over 2 months now I like it but I don't love it! It has a lot of great features and apps and I got a really good deal on it so I really can't complain.", "Date": "August 15, 2013"}, {"Title": "Very good for the money", "Author": "Caesar 62", "ReviewID": "R1I1P0693DEBXN", "Overall": "4.0", "Content": "I think another reviewer said \"Fast and Frugal\" and I would second that remark. Certainly the biggest, clearest screen I've seen on a $200 phone. Pretty much anything you want a smart phone for, this will do, including 4G, an up-to-date OS, mapping and GPS. However, you will notice several drawbacks to this unit:- Only 4 gb of internal memory.- The Android OS, as implemented by LG, does not allow for moving applications to the memory card slot, and many apps do not have the ability to store data on the removable SD.- That 4 gb is filled with a bunch of applications you cannot delete (\"bloatware\")- I was unable to access the phone from my Mac.- The speaker is neither loud nor clear, so you will find yourself holding the phone up when using as a GPS in the car.But again, I would be pissed if a $600 phone had these issues, but at $200, this phone is pretty easy to live with.", "Date": "August 15, 2013"}, {"Title": "Nice phone, but the touchscreen is junk.", "Author": "Reges Vobis", "ReviewID": "R1VCZ3MJKDSKGI", "Overall": "2.0", "Content": "My wife has been using this phone without any problems for the past month, so I figured I'd order one to replace my old Nokia Windows Phone. Initially I was pleased with the responsiveness of the device, and the OTA update to Jelly Bean (Android v.4.1) made everything much smoother. However, about 3 days into owning it, the touchscreen started sporadically working without me touching anything. It would randomly launch apps, press buttons, and select options with no input from me and no way to stop it. Then the screen would freeze entirely and I'd have to remove the battery to reboot the device.At first I thought this was either the fault of a third-party app that I installed on the phone or that maybe I just needed to wipe it and start over. I performed a system recovery and used the phone for a couple of days without installing any additional apps other than the Jelly Bean update. Sure enough, two days into using it, the phone began its sporadic, jerky behavior again, prompting me to return it to Amazon.I really wanted to like this phone. After all, my wife enjoys hers. I could even deal with the paltry 4 GB of storage. Unfortunately, the strange touchscreen behavior is a dealbreaker.", "Date": "August 12, 2013"}, {"Title": "Great for the price", "Author": "eseb1", "ReviewID": "REV8MXDDT1KOF", "Overall": "5.0", "Content": "I love this phone, its quick, and paired with the 30 bucks a month plan its hard to beat. The 4G isn't the quickest T-Mobile offers, but its plenty fast compared to 3G.  My only complaint with the phone is the position of the lock button. It's on the right side of the phone instead of the normal top position.The screen resolution isn't amazing, but unless you look very closely you won't be able to tell.Battery life is about a day of heavy use, or two days of little use with data enabled.", "Date": "August 3, 2013"}, {"Title": "worst phone ever", "Author": "herb", "ReviewID": "R3TK6ETA5XDEDY", "Overall": "1.0", "Content": "this is absolutely the worst phone that I've ever owned, it's full of bugs and glitches.  It needs to be reset multiple times a day and even then it refuses to work properly.  I don't understand who has good things to say about this phone they must be paid by LG to make those statements but if you own one of these you know that it's junk.  Another guy at work has one and has the same issues, it will freeze and bulk then needs to be restarted, the power button will not turn off the phone without a prolonged pressing and when it restarts it's often in airplane mode.  The memory on the phone is too small and any podcasts are stored on the phone's memory not the memory card (I have a 32 gig card), no apps can be stored on the memory card which to me is a serious flaw.  This is cheap chinese junk and please avoid it.  I guess t-mobile sends these out as replacement phones so u'll get frustrated and upgrade to a htc 1 or something that's going to cost you 600.I'm going to send this junk back to t-mobile and demand one that works and will keep sending it back til I do get one that works.Avoid this junk, just ask anyone that has one.", "Date": "October 15, 2013"}, {"Title": "Great performance, great value", "Author": "Swriter", "ReviewID": "RYNQM06KCT4HV", "Overall": "5.0", "Content": "This is a sleek and powerful smartphone no matter how you cut it.  Sure, it's not meant to be a 'top end' phone, but for most everyday users (i.e., non-tech fanatics), this phone has more than enough power and memory.  It is also light and thin - very stylish!  The battery life is also amazing - easily goes all day, and then some.  It's also designed in a way so that it doesn't feel like a big phone.  You can now upgrade this phone to Android Jelly Bean.  A great phone.  A fantastic value.", "Date": "August 13, 2013"}, {"Title": "Best deal for T-mobile subscribers", "Author": "Jacky", "ReviewID": "R3UW3KEDPH6N0C", "Overall": "5.0", "Content": "For T-mobile subscribers, this is the best deal for a smartphone under $200.Pros- Modern Android OS 4.1- Few bugs or weird behaviors (I haven't noticed any)- Smooth for most uses and apps- Good screen size 4.5\"- Plays videos smoothly- Optimized for T-mobile network and good signal reception (for T-mobile coverage)- Support Wi-Fi calling- Decent mic and speaker phone- Good battery life- Can easily swap in spare battery (although haven't needed, I carry a spare battery so that I can use my phone as I wish without worrying about battery consumption)- Wi-Fi supports both 2.4 and 5 GHz- SD card slot (support up to 32GB)- Decent camera (just make sure there is good lighting)Cons- Apps can not be moved to SD card. I tried several apps and they get errors and say this phone does not support it. As a workaround, I use app backup & restore and back up the apps that I don't need in the short term to SD card and free up space in internal memory. Although this is an Android limitation, I hope LG can fix this issue as Samsung has done.- The performance is decent but in some apps there are small lags. And when there are heavy background tasks (e.g., auto update apps), it becomes very slow. It's a good idea to turn off auto app updates and do so manually at convenient times.The cons are in comparison to my previous phone (Nexus 4) which I gave up mainly due to lack of Wi-Fi calling, poor battery life and non swappable battery.As you can see, even when compared to high end quad core Nexus 4, the LG L9 stands up well and offers advantages.", "Date": "August 10, 2013"}, {"Title": "Didn't work Properly", "Author": "Tamika", "ReviewID": "R3ITAWFY3XPSEL", "Overall": "2.0", "Content": "The phone freezes and shut downs automactically without me touching it.I haven't dropped it or anything and it still freezes.", "Date": "August 5, 2013"}, {"Title": "I Love This Phone", "Author": "scott tyner", "ReviewID": "R3RSLSUAWQZPHS", "Overall": "4.0", "Content": "This phone is much better than I was expecting. the screen is big the phone fits my hand good and the wifi is very sensitive.", "Date": "June 28, 2013"}, {"Title": "Nice fit, does what I want", "Author": "Michael W. Hickman \"eggsngrits\"", "ReviewID": "R38821CUF2A09N", "Overall": "4.0", "Content": "Fits as it should, and seems to protect the phone.  Certainly it protects against scratches, but protection from a fall may be too much to ask from a cheap case like this.  I would give it five stars, but some of the tabs look a little flimsy.  Let's see how they last.", "Date": "August 28, 2013"}, {"Title": "Good!!", "Author": "M Jeong", "ReviewID": "RPFV5PV2WZAKZ", "Overall": "5.0", "Content": "Very light, slim, enough to me.GPS, email, music.... OK. Little week rear camera.Just want to unlock the phone.", "Date": "August 6, 2013"}, {"Title": "Great.", "Author": "permeo", "ReviewID": "RGBMC203Z32YD", "Overall": "5.0", "Content": "I order this phone for my sister and it works great. Thinking of getting the phone for myself. Order came when it was supposed to and it was Brand New like the seller said.", "Date": "July 29, 2013"}, {"Title": "Awesome Phone!!!", "Author": "K. Wenz \"shorty\"", "ReviewID": "R130523JLPPT2C", "Overall": "5.0", "Content": "This phone has a lot of the features the more expensive smart phones have.  Camera works fast.  The sound is very good.  Easy to use. The screen size is very nice.  Many apps already loaded on it for you.  Would recommend it.", "Date": "July 19, 2013"}, {"Title": "Great!", "Author": "cb5020", "ReviewID": "R8HO1Q7I9ITGT", "Overall": "5.0", "Content": "Love this phone! ......Good job! I find this phone very easy to use, that I am happy about!. Thank you!", "Date": "June 26, 2013"}, {"Title": "Love it", "Author": "Ladonna", "ReviewID": "R1ZWDDPDEE8B3R", "Overall": "5.0", "Content": "I'm so happy I purchased this phone!!! You will not regret it! If you looking for a phone this is the one!", "Date": "July 2, 2013"}, {"Title": "Better than I thought for the price.", "Author": "Gary Pease", "ReviewID": "R235O4DVUQZI75", "Overall": "4.0", "Content": "As good as the top price ones.The 1 thing I don't like is tthe tintie sound of vioces on the phone", "Date": "August 10, 2013"}, {"Title": "Decent midrange phone with terrible build quality", "Author": "Joe G", "ReviewID": "R2QC8XB77NS1FP", "Overall": "2.0", "Content": "So my wife and I just made the switch to T-Mobile and bought two of these phones.  Set up was simple since it is a Google phone, and the phone has decent specs although not exactly overwhelming.  The reason I gave this phone two stars is because my wife was transporting it and her old iphone in one hand and a bowl with food in the other.  Apparently, since the Iphone was laying on the screen during the 10 foot walk the whole screen cracked.  She had the phone literally for 15 minutes.  T-mobile informed her she would have to pay the deductable for a new phone since the screen was so badly cracked it couldn't be used safely.  She has had her iphone for years without even a scratch on it and my Galaxy S3 has been very durable as well.  Oh yeah, did I mention she had a case protector on it???", "Date": "August 15, 2013"}, {"Title": "great great!!A must Buy .", "Author": "Christian", "ReviewID": "R1X9AZBEGWVRQE", "Overall": "5.0", "Content": "im using it with solavei.....and love it 4G speed unlimited text and datasolavei.com/drakchrisfacebook.com/share2earngreat mobile service for studentsmilitary and college guy aproved", "Date": "July 29, 2013"}, {"Title": "perfect", "Author": "tina harris", "ReviewID": "R21QZ5JBDVAE0L", "Overall": "5.0", "Content": "Came n 2 days n im loving da color just waiting on the phone to c does it fit !!!", "Date": "July 11, 2013"}, {"Title": "LG Android needs work.", "Author": "joe_consumer", "ReviewID": "R3UNHLYYZ2X5SF", "Overall": "2.0", "Content": "I've had this phone for less than 1 month and have already encountered several problems. Probably the biggest problem is with the virtual phone (number) key pad. Every time i call my bank for automated account info and enter the requested numbers, the system either misunderstands my entry and/or rejects what i enter. Same thing happens with this phone when i try to check my mom's balance and its two totally separate banks. I never had this problem with my old flip phone.Other problems- swiping the icon to answer incoming call is frustrating because it takes about 10 tries before it actually works.Scrolling the page on Facebook is tricky because virtually any spot you touch is an active link that takes you to another page.Im sure there's more suprises waiting for me with this phone!", "Date": "August 16, 2013"}, {"Title": "It sucks", "Author": "Yulian", "ReviewID": "R29CBWMXXZ78B1", "Overall": "1.0", "Content": "This phone is very bad.... it looks very affordable but it will make your like a living hell.... do not even think of purchasing this phone. Samsung galaxy s is much better than this even though it is older.", "Date": "July 23, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "4.5-inch qHD Corning Gorilla Glass 2 display\n5 megapixel rear-facing camera with LED flash and VGA front-facing camera and camcorder\n1-GHz dual-core processor\nAndroid 4.0.4 (Ice Cream Sandwich)\nIn the box: Handset, Battery, USB charger, Data cable, Manual, and Micro SIM card", "Name": "LG Optimus L9 4G Android Prepaid Phone (T-Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/41jiyBDrtFL._SY300_.jpg", "ProductID": "B00BMN46HW"}}