{"Reviews": [{"Title": "CrackBerry is back in the Z10.", "Author": "Ugly Tuco", "ReviewID": "R64DD2TYFY4PD", "Overall": "5.0", "Content": "I am currently typing this review on my Z10, simply because I love flick typing on the new keyboard so much!I just dropped my Android for the Z10, and could not be happier.The biggest surprise has been the apps. With all of the negative press about how BlackBerry World does not have as many apps as Apple and Google...My expectations were very low. However, comparing my Android experience to BlackBerry has been a surprise. I was with Android fairly early on, and I can tell you that BlackBerry has come to market with a much better app environment than Android did. Since Android improved greatly over the last few years, I am very confident that BlackBerry will far exceed my expectations.The operating system on the Z10 is awesome. After a couple of days it now feels second nature.My wife has an iPhone, and she may switch after seeing the Z10. Neither of us have ever owned a BlackBerry. I believe that says a lot.One final comment... I love the control I have over my security. BlackBerry allows me to encrypt my personal files and data. The control I now have over my apps is also refreshing. I can see what each app accesses and control what I feel comfortable with.Overall, I highly recommend this phone to anyone. I will be putting this phone in front of friends and family.PS: Video BBM is also great fun, and free! Although, I never realized how scary I looked on camera!", "Date": "April 2, 2013"}, {"Title": "BlackBerry is back! LOVE IT!", "Author": "B. Khlok", "ReviewID": "RD5QXDJX9VAZ4", "Overall": "5.0", "Content": "From a CrackBerry User: \"AsianGloBo\"My Z10 Review:I had recently made the switch from to Sprint to Verizon, because i have been wanting the Z10 since it was first released. However at the time, i thought i could hold out for the Q10, but i was getting very impatient. The release for U.S. Carriers is probably a few weeks from now, but no matter.  Now on to my personal phone experience..My Personal Mobile Device journey:I have owned everything from iPhone to premium Android devices. Both rooted/jailbroken. They were both great, but they both had their flaws. And from trying all of these different devices i realized what kind of \"Phone Crowd\" i was in.iPhone Crowd:I feel that iPhones are made for the people who want \"simple.\" But, I think that was how the phone was made to be in the first place. People who want something nice, reliable, and a polished OS right out of the box. Only drawback is the customization is limited, and everyone has one. iPhone is more of a toy, with the option of being a mobile phone.Android Crowd:I feel that these phones are made for people who refuse to buy anything Apple or they just dont want to \"be like everyone else.\" Also people who enjoy rooting/hacking these phones to make them even faster, or customize even deeper than what it is out the box. Now with my experience with Android devices, is that they do have impressive performance numbers and specs, as well as wide variety of devices that run on android, but when it comes to actually using the phone itself, during daily operating usage, it feels choppy/ laggy at times. Android is still behind when it comes to providing a stable OS compared to Apple, but its getting closer. I believe the HTC One is the most recently stable android device on the market. Its almost near perfect according to reviews. Apple has been in the safe zone for awhile, but Android is catching up, and Apple's next generation device needs to be fresh, and innovative, as well as keeping the core elements of power/ease of use/polished OS.BlackBerry Crowd:I feel that this crowd is for the power communicator. Its not for everyone. Just smart people (lol). A BlackBerry user is someone who values communication, and does not care about apps/games. We enjoy logistics, and just like complicated things. We dont buy BlackBerries because we hate Apple products. (I currently own an iMac and LOVE IT) We simply like quality products made to do what its best at. BlackBerry owned the smartphone world for awhile until Apple released its \"TOY\" and had raised the bar significantly on \"smartphone standards\" and really challenged BlackBerry. So they lost alot of people due to the growing interest of \"apps.\" And Apple sold this idea to the market, that its all about apps, apps, apps!I prefer BlackBerry because I like to get things done quickly, efficiently, and having a reliable email service. These are the things I personally value in a mobile phone device. Now i will admit, when i had the iPhone i was downloading all kinds of apps, and they were fun to play with, but i found myself being un-productive with an iPhone, and with lack of customization, that just wasnt me.My Verizon Wireless White Z10: First ImpressionsSo i just got this phone yesterday around 4pm, and have been using it for roughly 12 hours, and this thing is blazing FAST. I got use to the gestures quickly, and was able to setup my phone in minutes. My contacts were linked to my GMAIL account, so no entering contacts in manually. This phone is also very stylish and sexy in white. Its just like holding an Ice Cream Bar. A handful of sweetness if you may. Call quality, virtual keyboard, emails, and 4G LTE all work flawlessly. This is my first 4G LTE device and it is very fast. Sprint's 3G service was very slow, although unlimited, it was slow. I am also the only person at my job with a BlackBerry. If people see anything BlackBerry on TV, they always say \"I saw, this and that about BB and thought about you.\" In a way, it is a compliment. Im glad people know that i am a BlackBerry guy, and i always will be. I give so much props to BBRY for fighting in the smartphone world. Producing a completely new and fresh OS built from the ground up, and giving us BlackBerry people a chance to bring BBRY back to the top. Its not gonna be easy, and its gonna take awhile, but BBRY knows quality. That is their reputation. And for that sole reason, I will forever be a BlackBerry fan. I hope this review was helpful. Cheers!-Boramy", "Date": "May 2, 2013"}, {"Title": "Excellent New (Old) Option", "Author": "ashertopia", "ReviewID": "R2XM131CYZA9OX", "Overall": "4.0", "Content": "I've been using this phone for the last few days and I have to say I'm surprised at how good it is. I was a Blackberry user several years ago and then switched to Android and frankly BB didn't come close in terms of functionality, performance or customization. But this new BB Z10 is much better. Why? Because it's finally like the Smartphones that have been kicking its butt.The Good+This BB has the same ease of use in setting up accounts that you would expect. I set up Yahoo!, Gmail, and enterprise with just a few clicks. I also set up Facebook, Twitter and Dropbox (all built in). All these messaging systems, along with BB Messenger, are in the BB Hub, which is found on any screen by swiping right on your screen. You get all the notifications from all your messages in a unified inbox. If you want to view specific services swipe right again and you can edit your hub or simply click on any of the services to view only those messages.+The camera is outstanding! The time capture is something that Google will be ripping off, er, emulating ASAP. You take a picture and it actually takes 10 in a row. You can then move the slider back and forth to find the best pic (you know for blurriness, closed eyes, etc) and - this is amazing - you can find the best pic of each of the faces from DIFFERENT captures, select the best, and then merge them together. So if me and my wife are taking pictures of ourselves (for Facebook of course) and I'm blinking on capture 1-9, but am perfect on capture 10, then click my face on capture 10, and pic the best of my wife from any of the others and then merge and you have a perfect picture. I can't say enough about how awesome that is!+Functions like you expect with all swipe and touch controls.+Dedicated BB screen for apps that are currently being used. And all other screens to the right are you installed apps. No app drawer, which is nice. You can easily create folders on your home screens by simply dragging and dropping. Apple users will love that you can create folders from EVERY icon, unlike that magazine rack icon that can't be messed with on iOS. Apple users will also feel right at home with the constant home screens lined up in rows.+The keyboard's predictive text is amazing. It learns what you type and will start to select likely words for you and allow you to choose them by simply sliding your finger from below to above the word. Or you can ignore it and continue to type.+Processor and RAM is right on target. 4G LTE with Verizon makes this one run as fast as it can.The Bad-I don't like the lack of back screen. I never got used to having to swipe off the app I was in (ala Palm Pre, swiping up). I wanted to simply go back one screen.-I missed swipe keyboard. I like the predictive text and for button pushers that's great but for those of us who swipe it was a slower way of writing.-There are 100-150k apps as of launch, but that is still way below Android and iOS. The good news is that BB created a conversion program to convert Android to BB apps and is actively pursuing the top apps. In fact, they have more at launch than Windows or Android did. Good start, but it will be a while before I get all the ones I want and use daily.Overall, this is a great phone. I recommend it to Apple users who like the walled garden and look of their home screens and also to enterprise users looking to continue with BB. Casual users of Windows or Android may also like this. But for those of us who are heavily invested in Android, hacking, have a ton of apps, etc it may not work for us. A worthy competitor. Welcome back Blackberry!", "Date": "April 2, 2013"}, {"Title": "Blackberry scores a winner!", "Author": "Amazon Customer", "ReviewID": "R2VWIWBUPMUGTN", "Overall": "5.0", "Content": "Had this phone for one week! Left iPhone for it! Night and day difference from my 9930 AND Android AND iPhone OS's. love the Hub, Peek and Flow. Not a big app person, but the store is growing! Handles documents, and all my other needs great! Definitely recommended!", "Date": "April 7, 2013"}, {"Title": "BLACKBERRY Z10", "Author": "SK", "ReviewID": "R2L2XDB2XUXM5X", "Overall": "5.0", "Content": "Bestever smart phone by blackberry !! Great user interface !! great camera, my kids love it, already bought two for my family !", "Date": "March 31, 2013"}, {"Title": "Wow !!", "Author": "auvils", "ReviewID": "RXC9YU104D44Y", "Overall": "5.0", "Content": "Ordered a black and white Z10 . I would recommend these phones to anyone except for people that are enslaved into crApples ecosystem. Those that have invested $$$$$ into Apples ecosystem may find it difficult to transfer everything over but maybe not, would take some research.Some of what's great:Blazing fast browser.Messaging unlike anything else available.Much better battery life than my previous windows phone metro, was surprised.Gesture based OS is a load of fun and addicting.Blackberry 10 Hub; bow down competitors.Apps that are unavailable work so well in the browser that its not noticeable to me.No Netflix app, no problem I don't have one of their wasteful accounts anymore.Phone is a joy with a rabidly engaged user community that is willing to help with any issue or question.Blackberry is back with a vengeance.", "Date": "June 13, 2013"}, {"Title": "All about preferences", "Author": "Desiree", "ReviewID": "RBHKRDKDOSPOS", "Overall": "5.0", "Content": "I LOVE this phone. Its all about preferences though. I'm coming from an Iphone 4s and now whenver I've gone back to it, it certainly feels dated. I didnt think that was possible!In order to navigate the phone you have to swipe the screen, it took all of 20 minutes to get used to it. I love the OS and the peek feature. It also allows you to \"wake the phone up\" by swiping upward, and if you want to put it back to sleep, just dont lift your finger off the screen and swipe back downward. The OS is VERY smooth.But as I said: preferences. If youre a person who needs EVERY app NOW, maybe it isnt for you. Although most banks and websites have a mobile version that works very well with the browser. I've added the mobile sites of Groupon, Livingsocial, banks, etc as \"home screen\" bookmarks and I usually forgot its not the app because the mobile site works just as well.At first I had reservations about the size. It actually isnt that big. Its the perfect size in my opinion and if you ever watch movies/videos/etc its PERFECT. It runs flash seemelessly, something my pervious IPhone or my fiance's android cant do.One last thing I noticed about the GPS. When you have to nav your way somewhere its usually because you havent been there or you dont know where it is. The GPS tells you in advance what side of the street your location or entrance to the highway is on, which to me, is SO helpful.Love it!", "Date": "May 16, 2013"}, {"Title": "My first 'smart phone'", "Author": "Marie Lewis \"MiLewis\"", "ReviewID": "R242YD7KNJ4Z7U", "Overall": "5.0", "Content": "I have used a cell phone for a number of years, but when my present phone stopped holding a charge, I decided it was time to make the big jump to a smart phone.  I read the reviews of several models and decided to go with the Blackberry Z10 and so far I have not been dissapointed.  I love all the apps and being able to get my mail on my phone.  It was no problem getting hooked up to Facebook and was surprized to see my contacts had all been loaded to the new phone.  I had dreaded thinking of putting them in one by one.  But there they were from my outlook account.  Hurray!!! Now I could get on to getting familier with the great phone it is.  I am still discovering things, great things.", "Date": "April 28, 2013"}, {"Title": "I LOVE THIS PHONE!!!", "Author": "Michelle in NJ \"Michelle\"", "ReviewID": "R23XNTY0EFS0SP", "Overall": "5.0", "Content": "I was a Blackberry user who almost defected.  3 iPhone users in my house.  The delay on this device almost made me buy something else I was SOOOOO frustrated.  But everytime I tried my family member's iPhones I just didn't really love them, especially the on screen keyboard.  I went to the store and tried the Galaxy, same thing didn't love the keyboard.  Then I was going to wait for the Q-1o for the physical keyboard, but when that was delayed I took the plunge on the Z-10.  AND I LOVE THIS PHONE.  This on-screen keyboard is great.  I was really reluctant because I could type very very fast on my Bold, but this keyboard is awesome.  Predictive and autocorrect is cool.It is lightening fast.  You won't believe how fast the browser is.  I love the hub.  I love size of it, it is bigger than the iPhone 5 substantially on screen size, the screen is awesome.  Love the camera updates, burst mode and time shift.  I went to a roller skate party for kids the weekend and the parent of the birthday child gave me her iphone to take pics.  Then I also used mine.  The shutter on the camera was much, much faster on the Z10.You can side-load Android apps which are not on Blackberry World.  Go to crackberry.com for instructions.On CIO.com you can find an article on 10 things the Z10 can do an iPhone can't.  Some include, the memory chip you can replace by yourself, so you can swap when full.  The battery is removeable, so you can keep a charged spare when you travel or otherwise won't have access to charging for extended periods.  Standard mini-HDMI out port...show your pics on your TV with the right cable.  Standard charging port which matches other devices you might own...no Apple specific ports.  It can run 8 apps simultaneously live - serious multi-tasking.  Yes, you can minimize the phone app, leave it running (after you put your call on speaker ofcourse or while with headset) and open the browser and search for things.Apps:  Foursquare, Twitter, LinkedIn, DocstoGo, Evermore, Kindle, FB, YouTube, Dropbox, Slacker....AND DO DOWNLOAD \"SAY IT\"....which is siri-like voice control and is better than the pre-loaded one.  Skype I understand is out there but some bugs which should resolve this week with an update.  That's mostly all I use.Just buy it...", "Date": "April 24, 2013"}, {"Title": "BlackBerry Z10 Intelligent Machine", "Author": "Domingo Galdos", "ReviewID": "R236XO50GIA2KC", "Overall": "5.0", "Content": "This is without doubt the best smartphone in the market. I've had experience with two other major brands, namely the iPhone and Samsung and this BlackBerry smartphone is by far the best. Superior in every respect: visual, display, software, handling, browser, email, hotspot, intelligent typing (fantastic!) etc., etc... too many features/benefits to mention.There are also enough applications to satisfy most users even when it does not have as many as the competitors.Unfortunately, RIM (BlackBerry) was too late to market this great machine and by the time they made it available consumers had fled to Apple and Samsung. BlackBerry shut the gates after the horses had left the barn. It's a shame.Perhaps another company or group of investors may buy the BlackBerry company. I think it would be a good fit with someone like Lenovo (IBM's PCs).I'm very happy with this phone as it fulfills all my business and professional requirements. I don't regret having purchased it. I hope BlackBerry (the company) survives. I surely recommend anyone looking for a state of the art smartphone to buy a Z10 or a Q10. They are great values and will last a good many years. I upgraded from a 9650 BlackBerry Bold.I wish the BlackBerry management and staff good luck as they face a tough uphill battle.", "Date": "September 21, 2013"}, {"Title": "Grown and sexy!", "Author": "Vondale Reynolds", "ReviewID": "R3HT9H275SC4YW", "Overall": "5.0", "Content": "This is not your average device, its even better. I have to admit, the new BB has met my expectations. All the swipe movements are pretty simple to get a handle on, I had 90% of it figured out within an hour.The BB app store is even better, even though I have some gripes about some apps. such as Face Book (will not allow you to share), and there are some apps. I would like to see as well, like XM/Sirrus, stitcher radio. I almost never use my phone for games, but there seem to be some pretty good ones for those who do. As a former BB Storm owner, I can say, the Z10 blows it out the water. Its so fast, I often find myself reaching for my BB Z10 instead of my iPad.", "Date": "September 4, 2013"}, {"Title": "Switched from Nokia Lumia 928, and iPhone 4S", "Author": "DenzelFrance", "ReviewID": "R2U86UE6MJAERP", "Overall": "5.0", "Content": "This phone is actually pretty good! I love the BlackBerry 10 OS and how simple it is to use! The phone is surprisingly light and has pretty decent battery life to go with the thin form factor. I love all of the gestures you use to navigate around, and it easily becomes second nature after a day or so! The phone quality is right up there with the Lumia 928 and the loud speaker is loud and clear. Overall, this is a great little phone to have, but of course it has some issues, like the camera isn't the best, but with the right modes you'll get some great shots! Also, the lack of apps, but there are more of the popular apps, and also Android side loading! I recommend this phone for anyone!", "Date": "August 12, 2013"}, {"Title": "Finally, a gesture based phone!", "Author": "Chris", "ReviewID": "R3KXVALR60YB0R", "Overall": "5.0", "Content": "The gestures on this phone will change the way you view touchscreen phones. You will wonder why other smartphones haven't incorporated gestures the way BlackBerry has. I love it!", "Date": "August 10, 2013"}, {"Title": "The best", "Author": "FlyingGuy", "ReviewID": "RIGD65WPS05TG", "Overall": "5.0", "Content": "There are a whole lots of new technologies in this phone, which is much much better than my previous Iphone 4s i was really bored abpit.Great gadge and love it every minute.", "Date": "July 30, 2013"}, {"Title": "amZing", "Author": "GADA", "ReviewID": "R1B3JGNHLU7GSX", "Overall": "5.0", "Content": "This is the best phone I've ever used it has a brand new feel to it I've had iphones just came from HTC incredible 4G and this is like opening something new with the gesture only OS you must try it to love it.", "Date": "July 7, 2013"}, {"Title": "Best Available Cell Phone", "Author": "Bob", "ReviewID": "R11GYBW1DOY3KQ", "Overall": "5.0", "Content": "The Z10 is not withstanding the best cell phone that I have owned yet.The apps that the Blackberry App Store has are relevant and high quality.  On Apple's and Android's app store I find myself flooded with non-relevant selections and wasting my time shifting through trying to find what I am looking for.  On Blackberry's App store I do not have this problem.  Some may find the number of apps on the Blackberry App Store as discouraging while as I find it a blessing for that fact alone.I am no longer an Android fan as their Operating Systems just seem to crash or freeze up more than anything else.  No problems with this on the Z10.To sum up the Pros:*Long lasting battery*Touch is responsive*Interface super smooth*Operations are fast*Not to mention the superb sharpness and brightness of the Screen*I am also a fan of the auto brightness functionality (the brightness of the screen auto adjusts to the light conditions).*The keyboard is better by far than any other phone I have used to include the IPhone and Nexus 4.*Not bombarded by irrelevant Apps*BBM*Security of the Blackberry OS*The price of the Z10 is comparable to Android and IPhone*Expandable memoryTechnical Features:Size: 130mm X 65.6 mm X 9mmWeight: 135.4 gDisplay: 4.2in multi-touch IPS LCD displayResolution: 1280 x 768OS: Blackberry 10 OSMemory: 2 GB RAM, 16 GB Flash and hot swappable microSD Slot with capacity up to 32 GBProcessor: Dual Core 1.5 GHzGPS: Assisted, Autonomous, and Simultaneous GPSBluetooth: Bluetooth 4.0 (low energy)NFC: NFC enabled for security file exchange and paymentsHDMI: microHDMI out portAdvanced Sensors: Accelerometer, Magnetometer, Proximity, Ambient Light Sensor (Auto Brightness), GyroscopeWi-Fi: Dual Band 802.11 A/B/G/N, Mobile HotspotNetwork Connectivity: 4G LTE, HSPA+, support for global roamingBattery Life: 1800 mAh  (Exceeding the battery life of the IPhone 5)Talk Time: up to 10 hours on 3GStandby Time: up to 305 hours on 3G, up to 316 hours on 2GAudio Playback: up to 60 hoursVideo Playback: up to 11 hoursOverall:I think this is the best phone on the market right now.  You will be pleasantly surprised and not disappointed.", "Date": "July 2, 2013"}, {"Title": "The Mini Cooper of phones", "Author": "D-Hens", "ReviewID": "RRUCEHU7JPYWI", "Overall": "5.0", "Content": "I have had this phone for a few days, and it has been working very well. The screen is crystal clear, the BlackBerry Hub is unbelievably simple and efficient, the camera is far better than the one my Motorola RAZR M had, and the keyboard is very unique.I am actually using the keyboard to type this review because is is so efficient and intuitive. I do have an android tablet that I had previously been using for all of my personal, or unproductive tasks such as browsing amazon, but my Z10 is such a breeze to use that I have hardly used my tablet.The z10 probably isn't for everyone, hence the allusion to Mini Coopers in my review title. It is very different from any android device I have used so far, but it is also so much better. At first, I thought I might struggle with the absence of so many apps that android has, but the browser is so much more user friendly and so well integrated with the Z10 that a person really doesn't need the apps like you would with an Android phone.A quick warning, don't expect to pick up a new BlackBerry and be a professional user right away. This device will definitely take a bit of getting used to, just as other reviewers have said.This phone is rock solid in build quality and software quality, as was expected, but it is also stylish. I had it out watching a new Youtube video that was recommended to my by a friend and either a high school or college aged girl told me I have a \"Really cool Phone\".I am extremely satisfied with my z10, and I suspect you would be, too, if you are the type of person that is actually showing interest in it. Take the chance, you won't be sorry.", "Date": "April 23, 2013"}, {"Title": "Overall a great phone", "Author": "D. Jackson", "ReviewID": "R2ICNNEHHBMYFZ", "Overall": "5.0", "Content": "A coworker was looking at my phone today and we got to talking about it. I have had it for about 2 weeks now, and realized I really love this phone.I have been an Android user for the last few years. I left my old blackberry behind because it just felt old and outdated. I enjoyed android, but it was always a little buggy. I had to restart the phone every day or two or it would get laggy.The Z10 is fast and responsive. It works great. I haven't taken the time to really get to know the keyboard, but I do notice that it fixes more of my mistakes than the Android keyboard did. I can just type haphazardly away and then when I go back and read my message, most of the time it is 100% accurate.I also use voice controls quite a bit, and for the most part it works very well. I would like to see more features in the future, but it does all the things I really need it to do.I had serious battery drain issues at first, but I made 3 tweaks and now I get through the day without dipping below about 60% battery life:1. Settings - Network Connections - Mobile Networks. Changed Network Technology to LTE instead of Global.2. Settings - Display. Allow Gestures when locked to OFF. This is a tradeoff because it's pretty cool to just swipe up from the bottom of the screen to wake up the phone. But I don't mind pushing the on button instead. This is supposed to save a little battery life.3. Settings - Security and Privacy - Encryption. OFF. I read somewhere that this helps the battery life. I don't know how important it is to have the encryption. Maybe I should turn it back on. But I'm not really that important, and after doing all 3 of these things, I am getting great battery life.My wife is not a techy person, she just wants her stuff to work. I was a little worried that she wouldn't like the phone, but so far she is really liking it. She would like Pinterest and Instagram apps. Not currently available, so that is a bummer.We both went in with the attitude that we had 14 days to try them out, so we would send them back if we didn't like them. Well, we like these phones. We are keeping them.", "Date": "April 12, 2013"}, {"Title": "BlackBerry Garbage", "Author": "Latasha Flowers", "ReviewID": "R346MUGG6ZN6J3", "Overall": "1.0", "Content": "Horrible phone. I well never, ever get this phone again. It was a waste of my time and money. It has no app I need. Smh.", "Date": "January 10, 2014"}, {"Title": "This is a great phone", "Author": "Abstract Cool Shopper \"Abstract Difference\"", "ReviewID": "R33O86264KR8AJ", "Overall": "5.0", "Content": "Blackberry finally made a winner but no one is listening too much, lol.  Unfortunately Blackberry had to build a totally new operating systems that took TWO YEARS.  In the cell phone world that is a life time and they lost massive amounts of customers those two years because they didn't introduce any new products.  Everywhere I go am the only that has a Blackberry.  Most people say the same exact thing, \"Blackberry is still making phones?\"  I will say this because I've had Apple products and I've used Android products but Blackberry operating systems BB-10  is outstanding and I think it's the best of the three.  It is truly a multi-task phone that allows you to do so much at one time.  The texting experience is the best out there.  The only thing that is somewhat a negative point about this phone is Blackberry Apps.  If you're a app person then this phone is not for you.  But if you're not much on apps like me, you will love this phone I guarantee it.  I've had my phone since May and I love it more today.", "Date": "September 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BW69W3M"}}