{"Reviews": [{"Title": "A real Dark Horse", "Author": "Tor Slettnes", "ReviewID": "R3I8VAAYOB6B6Z", "Overall": "5.0", "Content": "With all the attention is on its more flashy sibling, the Xperia Z, the ZL is actually more capable in many ways.  In particular, many reviewers tend to compare the Xperia Z with the HTC One, and the latter tends to be favored; however most of the complaints against the Z are actually improved in the ZL.====Size====To start off with, both the Z and the ZL have a 5\" screen.  The resolution is 1920x1080 (aka 1080p) - too ridiculously high to even care.  The ZL is more compact though; it is basically all screen!  It has the highest ratio of screen surface to overall phone size of any smartphone in the market, and is in fact slightly shorter than even the HTC One (with its smaller 4.7\" screen).That said, the HTC one, although slightly longer, FEELS smaller and easier to use with one hand.  It has a more curved surface on the back, and so the side edges appear much slimmer than the ZL.  And it's slightly narrower as well.I did a side by side comparison with my ZL and a HTC One in a nearby AT&T; Store.  Yes the screen is visibly larger on the ZL, but you mostly notice that in terms of the width.  That's because the Xperia (both Z and ZL) have \"soft buttons\" at the bottom of the screen, whereas the HTC one has dedicated capactive buttons below the screen.  So the larger screen is mostly noticable when you use all of it, e.g. watching movies.======Screen======That brings us right into the screen itself.  Much noise has been made about \"poor viewing angles\", noticeably in Xperia Z reviews.  And to be sure, when viewed from the side, you do see a slight dulling of the colors - but hardly anything I would notice unless it was explicitly pointed out.  I also tend to use matte (anti-glare) screen protectors, which seems to slightly improve (!) the viewing angle.Now, my previous phone was a Nokia 808 PureView, which despite its smaller screen and much lower resolution, actually had by far the best contrast ratio of any phone on the market (incl. Samsung Galaxys).  So side by side, the black is not quite as black on the ZL, and the white is roughly comparable.  But the ZL screen is perfectly crisp as it is, and outdoor legibility (in sunlight) is great!So even though many reviewers seem to prefer the screen on the HTC One, I would actually go for the ZL one - as it is noticeably bigger and still very crisp!=====Sound=====Another point reviewers tend to bring up when comparing with the HTC One is the quality of the loudspeakers - since the HTC is quite extraordinary in this regard.  As said in the introduction, though, most reviews compare the One against the Xperia Z, which has a noticeably poorly placed and tinny speaker (its design is focused on water resistance/IP57 certification).  The ZL in contrast has a pretty capable speaker thank you very much!  I did a quick test vs. the HTC One in the AT&T; store, and could really only tell the difference in clarity when held very close.  Of course, the HTC One has stereo speakers, so in close proximity you get extra depth as well.I compared also against my Nokia 808, which also has one of the better speakers on the market.  The 808 can go slightly louder without noticeable distortion, but again, I rarely need volume cranked up that much.  (In situations where you want to listen to music or play movies, you usually do so via external equipment anyway...)The Xperia ZL music player has some sound controls (loudness, equalizer...), which can improve the sound even when playing to external equipment.  The HTC has none.Phone/Voice clarity on the ZL is excellent!  Actually in GSMArena's test, it outclasses most other current phones out there, including the HTC One.(Actually, according to their test, the ZL also has better dynamic range for music playback!  At moderate volumes, of course.)======Camera======This is one area where I am very picky.  Realizing that no other phone (now, or ever!?) will replace the Nokia 808 PureView in terms of photo and video recording quality (Even Nokia's own forthcoming \"EOS\" or \"Lumia 1000\" phone won't be able to match it), I definitely had lower expectations for the ZL.And yes, those lower expectations were appropriate.  Sony have pretty much been the driver in the \"megapixel race\" in smartphones; they had the first 12MP phone (known as \"Sony Ericsson Satio\") out some 4-5 years ago now.  But in terms of actual optical resolution, dynamic range, and nearly every other quality metric, all of their recent smartphones have been somewhat disappointing in that regard.It's hard, I know...  Manufacturers have pushed onto consumers an irrational obsession with slimness, which is quite counterproductive as far as the camera optics (Sensor size, lens) is concerned.The Xperia Z and ZL were the first smartphones to include the Sony Exmor RS sensor, where the \"S\" indicates that it uses backlighting to improve low light performance.  And to be sure, indoor photos are slightly sharper/richer than with the predecessor, Xperia TL (which I previously purchased/returned).Also, compared to the HTC One, it definitely has more resolved detail in good lighting conditions.  Again, in my in-store comparison tests, I could make out small details/prints to a much higher degree with the ZL than with the One.Perceived image noise is the biggest culprit.  Part of this is probably due to sub-par image processing with the phone's firmware, which means it could be fixable with a future firmware upgrade.  To illustrate this, if you take pictures in \"burst\" mode, they often look crisper and less noisy than in regular mode!  (The \"burst\" mode does away with much of the processing that otherwise takes place).  For this reason, a workaround may often be to use the \"burst\" mode even for regular still shots.This is one area, though, where despite its lower resolution and lower detail, many will opt for the HTC One.  That phone has gone in the opposite direction in terms of megapixels (4MP), focusing instead on larger photo cells for improved dynamic range/low light performance.  What REALLY sets it apart, though, is its innovative capture mode, \"Zoe\", which once you push the capture button takes not one, but a series of 20-30 pictures in rapid succession - starting as early as 1 second BEFORE you push the button!  That gives you a lot of extra options to work with - you can pick out the best of these pictures, you can remove moving objects (e.g. a person walking by in the background), and in its built-in album/gallery application, you'll see images not as static tiles, but movable ones (Harry Potter style...)The Xperia ZL's answer, albeit more primitive, would again be the \"Burst\" mode.One advantage the ZL has over both the Z and the HTC one is a physical shutter button, complete with half-press-to-focus.  Even if you use a PIN code to lock your phone, you can go straight to the camera (if enabled in settings).As for me, I'll definitely keep my 808 PureView around for travels and other occasions where I want to have a compact phone/camera solution without sacrificing image quality...=======Network=======There are actually several flavors of the Xperia ZL, like the Z.  This phone (C6506) is the only one among them to support AT&T;'s LTE network - and unlike the HTC One, it also supports T-Mobile's 3G/4G networks.  Otherwise, what's the point of buying an unlocked phone, if you were to be tied to a given carrier's network anyway?That said, there are some AT&T; policies you need to be aware of.  Even though this phone supports their LTE band, it does not qualify you for one of their LTE data plans.  So unless you already have an AT&T; branded LTE capable phone, you will need to get the IMEI (serial number) off one and use that one to register for such a plan with AT&T.;  (In my case, I went into a local store, where the sales clerk was nice enough to use the IMEI from his own AT&T; branded Xperia TL to give me such a plan...)AND - this is important - BE SURE to specifically request an LTE plan, not simply a \"4g smartphone data\" plan.  Without an LTE plan, you will be limited to HSPA+ speeds.  Even though they like to call the latter \"4G\", it actually a \"3G\" technology, running on the same frequency and air interface as UMTS and HSPDA.  (I blame T-Mobile mostly, they were the ones who started marketing this technology as \"4G\", mainly because they did not have immediate prospects of getting LTE like the big guys...)Implicit in all this is that yes, with AT&T; you do need a \"smartphone\" data plan with this phone, whether you use 4G or not.  AT&T; have recently started to compare the IMEI (serial number) of connected phones with vendor models, and ANY Android phone will automatically \"qualify\" you for such a plan.  Meaning, to serve you better, they will automatically \"upgrade\" your $10 or $15 \"data unlimited\" plan (if that's what you currently have) to a $30/month \"3GB smartphone data\" plan.  So if you are buying an unlocked phone in order to avoid this tax, better look at something like the Nokia 808 PureView instead.=======Battery=======Android sucks juice through triple straws.  No two ways about that.The ZL has a slightly larger battery than both the Z and the HTC One.  However, since the screen is also larger than the One (and with the same resolution), it does consume the battery slightly faster when in active use.  Since most people interested in this phone are likely to be \"power users\" that play with their phone a lot, this should be of some concern.Sony has added what they call a \"Stamina Mode\", where data connections are turned off for most background applications while the display is sleeping.  You can add exceptions (e.g. the mail reader, WhatsApp/Viber, etc).  And yes, this DOES help the standby life to some degree.With or without Stamina mode, the ZL lasts a bit longer than both the Z and the HTC One when idle.  (Again, how often will it remain idle in playful hands though?)This also brings me to one of many things I don't like about Android.  The GPS is enabled or disabled by you, the user.  While it's enabled, the battery runs out pretty fast.  When it's disabled, navigation (e.g. Google Navigation, WisePilot - also included) don't function well.  I wish they could fix some of these obvious shortcomings (I'll get back to more) from the Symbian playbook.  Maturity counts, you know.==============User Interface==============The world of Android UIs is gradually coalescing around the \"stock\" interface provided by Google.  By now, Sony is in most respects more \"in line\" with the stock experience than Samsung or HTC, and so there should be no big surprises (that's a good thing!)They've added a few bells and whistles here and there, though:* In the task manager, you'll see a few \"mini apps\": A calculator, a notes application, etc.  You can download additional ones, such as an \"IR Remote\" application to control the built in IR blaster and thereby your TV.  These are miniature overlays on the screen, similar to e.g. the \"Dashboard\" in Mac OS X.  Quite handy for quick access to these functions.* The drop-down notification pane includes toggles at the top (WiFi, Bluetooth, Mobile Data, Silent Mode, and a Settings icon).  This being Android, though, you don't get the quick access to specific settings (e.g. Bluetooth connections while a Bluetooth is active, USB modes while a USB cable is connected, etc) the way Symbian does.  Instead, you get a bunch of noise - each time an email arrives, each time an application has updated itself, etc...  Ah well, c'est la vie.* The \"WALKMAN\" music player - it's nice!* Extra homescreen widgets: \"SociaLife\" for a quick summary from FaceBook, Twitter, news sites, etc.; Image gallery where you can quickly flip forth/back among your recent pictures; Toggle bar to quickly turn off/on various things (WiFi, HotSpot, Bluetooth, Flight Mode, GPS, etc..), and a few more.There are also some Sony services, for instance to access the \"Sony Entertainment Network\" (Movie rentals, etc).  Most users will use Netflix instead of course.=======Storage=======The phone has 16GB of storage built-in, but supports SDXC cards (currently the largest one available is 64GB).This was one of the main selling points for me vs. the HTC One, which does NOT take expandable memory.  With the latter, you are stuck with the 32 or 64 GB in the phone itself - whereas for the ZL, you can upgrade once 96 GB or 128 GB cards become available.  And more importantly, if the phone dies (say, water damage), you cannot get your data off the built-in memory (HTC One), but can easily retrieve it from a removable µSD card.That said, the Xperia Z and ZL have issues with certain µSD cards - notably the SANDisk Ultra class 10 cards.  I had been using such a card for a year on my Nokia 808 without any issues, but in the ZL, I would get frequent \"disconnected\" errors when writing large chunks of data (e.g. music/movie synchronization).  I now placed that same SANDisk card in my wife's Samsung Galaxy Note phone, also without any issues.Ironically, ZL works fine with a SAMSUNG 64GB, as well as earlier generation SANDisk Class 6 card.=====================Media synchronization=====================I use a Mac, so one important selling point for me vs. a Samsung Galaxy was the availability of the Sony Media Bridge application, to synchronize media (photos/videos with iPhoto, music with iTunes), browse the filesystem, etc.  HTC also has such software - at least for iTunes synchronization - I find it rather ridiculous that Samsung does not.  Animosity, perhaps?That's the theory.  In practice, I also found that the Sony Media Bridge appellation chokes on large synchronization jobs.  I have been trying for several weeks to synchronize a few playlists (a total of ~3000 songs), and while some of the issues were related to the SANDisk µSD card incompatibility, the Media Bridge application also errors out quite frequently.  On top of it, it consumes ~300% cpu (3 full cores), 5GB of physical memory, and makes other appellations on my Mac run very slowly.3rd party applications do exist to do such synchronization, though with Android, this is quite clunky.  It involves either mounting the µSD card in \"Mass Storage\" mode (dumb!), or syncing over WiFi (slow, battery draining, EMR inducing...)  I eventually got the job done using \"TuneSync\", available in the Android store.  Still, this is one area where manufacturers (incl Sony) could do a better job.  (The now-defunct Symbian OS does this much better...)============To sum it up============The Xperia ZL is a very nice phone!  The screen is incredibly crisp, if not with quite as vibrant (or gaudy) colors as OLED displays like on phones from Samsung or Nokia.  And with the highest ratio of screen to phone on the planet, this is definitely a phone that appeals if you want a large screen but still pocketable device.I ended up returning mine, mainly because of the disappointing camera -- I said I was picky!  The \"Sony Media Bridge\" fiasco did not help.  I may yet get a HTC One, though I am not too thrilled about Android in many ways (mainly for small details such the way multiple email accounts are handled, difficulty in importing photos to a Mac, etc), and certainly would want to have a way to disable the \"BlinkFeed\" feature in that device.  But in the meantime, I have returned to my Nokia 808, which lets me use a cheaper data plan, and which on balance has fewer annoyances...So the Pros over the HTC one are:- Larger screen (Noticable!), while phone is nearly as compact- Removable memory - better for post-mortem data recovery- Longer battery life when idle/in your pocket- Less annoying UI (no BlinkFeed, toggles in notification pane, better widgets)- Higher resolution camera/more detail.- Camera shutter button.Pros of the HTC One over the ZL:- More classy construction; aluminum body. (But the ZL is no slouch; also you'll probably want a case around it anyway...)- Faster processor (but the ZL's is ridiculously fast too... you won't notice)- Better viewing angles on screen (but again, you won't normally notice)- Better battery life when in active use (e.g. watching movies)- Crisper sound, especially with higher volumes; stereo front-facing speakers- Some nice HTC customizations in the default email reader, incl. more professional quoting style in replies- ZOE!  That's the ONE thing for which I may get it!I should also mention the Samsung Galaxy S4, which many will choose based on marketing and the spec sheet.  For me, that is not an option, for these reasons:- Very cheap plastic construction.  The phone feels cheap.- No FM radio.  I use this while commuting to work by train or bus.  Internet radio is not as versatile, and eats up data.- Poor/no Mac support.- Inferior reception/call quality.", "Date": "May 2, 2013"}, {"Title": "A real Dark Horse", "Author": "Tor Slettnes", "ReviewID": "RPKUGABZCM9PF", "Overall": "5.0", "Content": "(Copied from here)With all the attention is on its more flashy sibling, the Xperia Z, the ZL is actually more capable in many ways.  In particular, many reviewers tend to compare the Xperia Z with the HTC One, and the latter tends to be favored; however most of the complaints against the Z are actually improved in the ZL.====Size====To start off with, both the Z and the ZL have a 5\" screen.  The resolution is 1920x1080 (aka 1080p) - too ridiculously high to even care.  The ZL is more compact though; it is basically all screen!  It has the highest ratio of screen surface to overall phone size of any smartphone in the market, and is in fact slightly shorter than even the HTC One (with its smaller 4.7\" screen).That said, the HTC one, although slightly longer, FEELS smaller and easier to use with one hand.  It has a more curved surface on the back, and so the side edges appear much slimmer than the ZL.  And it's slightly narrower as well.I did a side by side comparison with my ZL and a HTC One in a nearby AT&T; Store.  Yes the screen is visibly larger on the ZL, but you mostly notice that in terms of the width.  That's because the Xperia (both Z and ZL) have \"soft buttons\" at the bottom of the screen, whereas the HTC one has dedicated capactive buttons below the screen.  So the larger screen is mostly noticable when you use all of it, e.g. watching movies.======Screen======That brings us right into the screen itself.  Much noise has been made about \"poor viewing angles\", noticeably in Xperia Z reviews.  And to be sure, when viewed from the side, you do see a slight dulling of the colors - but hardly anything I would notice unless it was explicitly pointed out.  I also tend to use matte (anti-glare) screen protectors, which seems to slightly improve (!) the viewing angle.Now, my previous phone was a Nokia 808 PureView, which despite its smaller screen and much lower resolution, actually had by far the best contrast ratio of any phone on the market (incl. Samsung Galaxys).  So side by side, the black is not quite as black on the ZL, and the white is roughly comparable.  But the ZL screen is perfectly crisp as it is, and outdoor legibility (in sunlight) is great!So even though many reviewers seem to prefer the screen on the HTC One, I would actually go for the ZL one - as it is noticeably bigger and still very crisp!=====Sound=====Another point reviewers tend to bring up when comparing with the HTC One is the quality of the loudspeakers - since the HTC is quite extraordinary in this regard.  As said in the introduction, though, most reviews compare the One against the Xperia Z, which has a noticeably poorly placed and tinny speaker (its design is focused on water resistance/IP57 certification).  The ZL in contrast has a pretty capable speaker thank you very much!  I did a quick test vs. the HTC One in the AT&T; store, and could really only tell the difference in clarity when held very close.  Of course, the HTC One has stereo speakers, so in close proximity you get extra depth as well.I compared also against my Nokia 808, which also has one of the better speakers on the market.  The 808 can go slightly louder without noticeable distortion, but again, I rarely need volume cranked up that much.  (In situations where you want to listen to music or play movies, you usually do so via external equipment anyway...)The Xperia ZL music player has some sound controls (loudness, equalizer...), which can improve the sound even when playing to external equipment.  The HTC has none.Phone/Voice clarity on the ZL is excellent!  Actually in GSMArena's test, it outclasses most other current phones out there, including the HTC One.(Actually, according to their test, the ZL also has better dynamic range for music playback!  At moderate volumes, of course.)======Camera======This is one area where I am very picky.  Realizing that no other phone (now, or ever!?) will replace the Nokia 808 PureView in terms of photo and video recording quality (Even Nokia's own forthcoming \"EOS\" or \"Lumia 1000\" phone won't be able to match it), I definitely had lower expectations for the ZL.And yes, those lower expectations were appropriate.  Sony have pretty much been the driver in the \"megapixel race\" in smartphones; they had the first 12MP phone (known as \"Sony Ericsson Satio\") out some 4-5 years ago now.  But in terms of actual optical resolution, dynamic range, and nearly every other quality metric, all of their recent smartphones have been somewhat disappointing in that regard.It's hard, I know...  Manufacturers have pushed onto consumers an irrational obsession with slimness, which is quite counterproductive as far as the camera optics (Sensor size, lens) is concerned.The Xperia Z and ZL were the first smartphones to include the Sony Exmor RS sensor, where the \"S\" indicates that it uses backlighting to improve low light performance.  And to be sure, indoor photos are slightly sharper/richer than with the predecessor, Xperia TL (which I previously purchased/returned).Also, compared to the HTC One, it definitely has more resolved detail in good lighting conditions.  Again, in my in-store comparison tests, I could make out small details/prints to a much higher degree with the ZL than with the One.Perceived image noise is the biggest culprit.  Part of this is probably due to sub-par image processing with the phone's firmware, which means it could be fixable with a future firmware upgrade.  To illustrate this, if you take pictures in \"burst\" mode, they often look crisper and less noisy than in regular mode!  (The \"burst\" mode does away with much of the processing that otherwise takes place).  For this reason, a workaround may often be to use the \"burst\" mode even for regular still shots.This is one area, though, where despite its lower resolution and lower detail, many will opt for the HTC One.  That phone has gone in the opposite direction in terms of megapixels (4MP), focusing instead on larger photo cells for improved dynamic range/low light performance.  What REALLY sets it apart, though, is its innovative capture mode, \"Zoe\", which once you push the capture button takes not one, but a series of 20-30 pictures in rapid succession - starting as early as 1 second BEFORE you push the button!  That gives you a lot of extra options to work with - you can pick out the best of these pictures, you can remove moving objects (e.g. a person walking by in the background), and in its built-in album/gallery application, you'll see images not as static tiles, but movable ones (Harry Potter style...)The Xperia ZL's answer, albeit more primitive, would again be the \"Burst\" mode.One advantage the ZL has over both the Z and the HTC one is a physical shutter button, complete with half-press-to-focus.  Even if you use a PIN code to lock your phone, you can go straight to the camera (if enabled in settings).As for me, I'll definitely keep my 808 PureView around for travels and other occasions where I want to have a compact phone/camera solution without sacrificing image quality...=======Network=======There are actually several flavors of the Xperia ZL, like the Z.  This phone (C6506) is the only one among them to support AT&T;'s LTE network - and unlike the HTC One, it also supports T-Mobile's 3G/4G networks.  Otherwise, what's the point of buying an unlocked phone, if you were to be tied to a given carrier's network anyway?That said, there are some AT&T; policies you need to be aware of.  Even though this phone supports their LTE band, it does not qualify you for one of their LTE data plans.  So unless you already have an AT&T; branded LTE capable phone, you will need to get the IMEI (serial number) off one and use that one to register for such a plan with AT&T.;  (In my case, I went into a local store, where the sales clerk was nice enough to use the IMEI from his own AT&T; branded Xperia TL to give me such a plan...)AND - this is important - BE SURE to specifically request an LTE plan, not simply a \"4g smartphone data\" plan.  Without an LTE plan, you will be limited to HSPA+ speeds.  Even though they like to call the latter \"4G\", it actually a \"3G\" technology, running on the same frequency and air interface as UMTS and HSPDA.  (I blame T-Mobile mostly, they were the ones who started marketing this technology as \"4G\", mainly because they did not have immediate prospects of getting LTE like the big guys...)Implicit in all this is that yes, with AT&T; you do need a \"smartphone\" data plan with this phone, whether you use 4G or not.  AT&T; have recently started to compare the IMEI (serial number) of connected phones with vendor models, and ANY Android phone will automatically \"qualify\" you for such a plan.  Meaning, to serve you better, they will automatically \"upgrade\" your $10 or $15 \"data unlimited\" plan (if that's what you currently have) to a $30/month \"3GB smartphone data\" plan.  So if you are buying an unlocked phone in order to avoid this tax, better look at something like the Nokia 808 PureView instead.=======Battery=======Android sucks juice through triple straws.  No two ways about that.The ZL has a slightly larger battery than both the Z and the HTC One.  However, since the screen is also larger than the One (and with the same resolution), it does consume the battery slightly faster when in active use.  Since most people interested in this phone are likely to be \"power users\" that play with their phone a lot, this should be of some concern.Sony has added what they call a \"Stamina Mode\", where data connections are turned off for most background applications while the display is sleeping.  You can add exceptions (e.g. the mail reader, WhatsApp/Viber, etc).  And yes, this DOES help the standby life to some degree.With or without Stamina mode, the ZL lasts a bit longer than both the Z and the HTC One when idle.  (Again, how often will it remain idle in playful hands though?)This also brings me to one of many things I don't like about Android.  The GPS is enabled or disabled by you, the user.  While it's enabled, the battery runs out pretty fast.  When it's disabled, navigation (e.g. Google Navigation, WisePilot - also included) don't function well.  I wish they could fix some of these obvious shortcomings (I'll get back to more) from the Symbian playbook.  Maturity counts, you know.==============User Interface==============The world of Android UIs is gradually coalescing around the \"stock\" interface provided by Google.  By now, Sony is in most respects more \"in line\" with the stock experience than Samsung or HTC, and so there should be no big surprises (that's a good thing!)They've added a few bells and whistles here and there, though:* In the task manager, you'll see a few \"mini apps\": A calculator, a notes application, etc.  You can download additional ones, such as an \"IR Remote\" application to control the built in IR blaster and thereby your TV.  These are miniature overlays on the screen, similar to e.g. the \"Dashboard\" in Mac OS X.  Quite handy for quick access to these functions.* The drop-down notification pane includes toggles at the top (WiFi, Bluetooth, Mobile Data, Silent Mode, and a Settings icon).  This being Android, though, you don't get the quick access to specific settings (e.g. Bluetooth connections while a Bluetooth is active, USB modes while a USB cable is connected, etc) the way Symbian does.  Instead, you get a bunch of noise - each time an email arrives, each time an application has updated itself, etc...  Ah well, c'est la vie.* The \"WALKMAN\" music player - it's nice!* Extra homescreen widgets: \"SociaLife\" for a quick summary from FaceBook, Twitter, news sites, etc.; Image gallery where you can quickly flip forth/back among your recent pictures; Toggle bar to quickly turn off/on various things (WiFi, HotSpot, Bluetooth, Flight Mode, GPS, etc..), and a few more.There are also some Sony services, for instance to access the \"Sony Entertainment Network\" (Movie rentals, etc).  Most users will use Netflix instead of course.=======Storage=======The phone has 16GB of storage built-in, but supports SDXC cards (currently the largest one available is 64GB).This was one of the main selling points for me vs. the HTC One, which does NOT take expandable memory.  With the latter, you are stuck with the 32 or 64 GB in the phone itself - whereas for the ZL, you can upgrade once 96 GB or 128 GB cards become available.  And more importantly, if the phone dies (say, water damage), you cannot get your data off the built-in memory (HTC One), but can easily retrieve it from a removable µSD card.That said, the Xperia Z and ZL have issues with certain µSD cards - notably the SANDisk Ultra class 10 cards.  I had been using such a card for a year on my Nokia 808 without any issues, but in the ZL, I would get frequent \"disconnected\" errors when writing large chunks of data (e.g. music/movie synchronization).  I now placed that same SANDisk card in my wife's Samsung Galaxy Note phone, also without any issues.Ironically, ZL works fine with a SAMSUNG 64GB, as well as earlier generation SANDisk Class 6 card.=====================Media synchronization=====================I use a Mac, so one important selling point for me vs. a Samsung Galaxy was the availability of the Sony Media Bridge application, to synchronize media (photos/videos with iPhoto, music with iTunes), browse the filesystem, etc.  HTC also has such software - at least for iTunes synchronization - I find it rather ridiculous that Samsung does not.  Animosity, perhaps?That's the theory.  In practice, I also found that the Sony Media Bridge appellation chokes on large synchronization jobs.  I have been trying for several weeks to synchronize a few playlists (a total of ~3000 songs), and while some of the issues were related to the SANDisk µSD card incompatibility, the Media Bridge application also errors out quite frequently.  On top of it, it consumes ~300% cpu (3 full cores), 5GB of physical memory, and makes other appellations on my Mac run very slowly.3rd party applications do exist to do such synchronization, though with Android, this is quite clunky.  It involves either mounting the µSD card in \"Mass Storage\" mode (dumb!), or syncing over WiFi (slow, battery draining, EMR inducing...)  I eventually got the job done using \"TuneSync\", available in the Android store.  Still, this is one area where manufacturers (incl Sony) could do a better job.  (The now-defunct Symbian OS does this much better...)============To sum it up============The Xperia ZL is a very nice phone!  The screen is incredibly crisp, if not with quite as vibrant (or gaudy) colors as OLED displays like on phones from Samsung or Nokia.  And with the highest ratio of screen to phone on the planet, this is definitely a phone that appeals if you want a large screen but still pocketable device.I ended up returning mine, mainly because of the disappointing camera -- I said I was picky!  The \"Sony Media Bridge\" fiasco did not help.  I may yet get a HTC One, though I am not too thrilled about Android in many ways (mainly for small details such the way multiple email accounts are handled, difficulty in importing photos to a Mac, etc), and certainly would want to have a way to disable the \"BlinkFeed\" feature in that device.  But in the meantime, I have returned to my Nokia 808, which lets me use a cheaper data plan, and which on balance has fewer annoyances...So the Pros over the HTC one are:- Larger screen (Noticable!), while phone is nearly as compact- Removable memory - better for post-mortem data recovery- Longer battery life when idle/in your pocket- Less annoying UI (no BlinkFeed, toggles in notification pane, better widgets)- Higher resolution camera/more detail.- Camera shutter button.Pros of the HTC One over the ZL:- More classy construction; aluminum body. (But the ZL is no slouch; also you'll probably want a case around it anyway...)- Faster processor (but the ZL's is ridiculously fast too... you won't notice)- Better viewing angles on screen (but again, you won't normally notice)- Better battery life when in active use (e.g. watching movies)- Crisper sound, especially with higher volumes; stereo front-facing speakers- Some nice HTC customizations in the default email reader, incl. more professional quoting style in replies- ZOE!  That's the ONE thing for which I may get it!I should also mention the Samsung Galaxy S4, which many will choose based on marketing and the spec sheet.  For me, that is not an option, for these reasons:- Very cheap plastic construction.  The phone feels cheap.- No FM radio.  I use this while commuting to work by train or bus.  Internet radio is not as versatile, and eats up data.- Poor/no Mac support.- Inferior reception/call quality.", "Date": "May 2, 2013"}, {"Title": "Almost perfect powerhouse multimedia phone. (Edited)", "Author": "Amazon Customer \"apartoflife\"", "ReviewID": "R2EUMO2HBYP2QK", "Overall": "3.0", "Content": "I originally ordered an international Z but due to a bad experience with the network, I returned it. After noticing the LZ would come to the US with LTE, I started to research it and it began to grow on me. In the end glad I went with the LZ.Like the Z it has a monolithic classy front but this version is very compact which is impressive given the huge five inch display. In the hand it feels like a Samsung galaxy 3 which has a much smaller screen so again impressive. The camera is located in the bottom left hand corner. The location neither improves or degrades video angles. If anything it just makes the phone look cooler and unique. The notification light is also one of my favorite things about the phone. It has a sharp led light design at the bottom middle. It is so bright and viewable from all angles I can even see it when my phone's wallet case is closed. Nice touch. The light is not overbearing either which is great. Not sure why the Z didn't get these neat aesthetic features but they are great. The notification light lights up different colors for different notifications and it also turns on when viewing pictures and changes color based on the overall color the picture. Purely aesthetic beauty and I love it.The screen is super sharp but does suffer badly in viewing angles. Which is not a huge deal with me anyway since I don't like people seeing whats on my screen. The only phone I would say has a superior screen head on is the HTC One. Even this Sony fanboy can't deny that. Where this screen does shine however, is VIDEO. WOW it's beautiful five inch screen made for video. Pictures are beautiful to see on this screen too. Definitely a multimedia phone.The back is another story. While the plastic does not look cheap, it's ribbed with soft rubber and feels great in the hand; it does lose the aesthetic factor and starts to look like a typical smartphone. I really wish they would have made the back flat and glass like the Z. Not sure why they went this route but since it's either in my wallet case or protective case, the back never sees the light of day anyway so no big deal for me. I'm glad they decided to include the small aluminum power button on the side like the Z though. It make the phone pop with classiness.As far as the software goes, like my old Xperia S, it's very similar with a light skin added by sony which I love. It's minimalist and classy looking in my opinion, once you get used to it, it's very intuitive. The walkman music player is the best app in the market in my opinion. It looks beautiful and includes equalizer. The notification light also lights up and changes color based on color album art. The video app is neat to adding movie info and uses snippets of the video as a preview when in the main screen too. A + on Sony's multimedia apps. It's also powerful with minimal lag.The Camera is definitely a plus on this phone. Pictures are clear and it includes many more feature options over it's predecessor. This camera can easily replace a point and shoot camera.Of course, this is not a high end smart phone without the LTE. Another huge plus over it's \"big\" brother the Z. While the Z is LTE outside the US, it has been confirmed it will NOT be LTE in the states. To have such a beautiful screen for video, it would be a huge minus with no LTE. After testing it out, it blows away HT+ without a doubt. Average speed is about 30mb compared to 7mb fir HT+.  This of course if your area has LTE service. At first I thought I could live without it, now I can't.The phone does come with a remote control sensor for tv's and its super simple to program but they flubbed this one.... they put it in the side. So if you buy a protective case or in my case, a wallet cover, it covers the sensor! So you have to take the phone out to use it. They could have easily put the sensor near the earphone jack which is at the top of the phone and avoided the problem. Also, it's not intuitive to use as a remote control if you have to hold it sideways. I would think you would want to hold the phone vertical like remote control. Big flub Sony.Finally, Phone quality experience is the best I have ever had on a smart phone. The Z has awful call quality and speaker quality. This is probably due to the fact that it is waterproof and they would probably have extra filters to protect the phone. If I have the option, I would rather have good call quality and speakers. I Mean it is a phone after all. Sony has even included software to tweak the sound quality of phone calls! Impressive feature no one probably knows about. Comparisons with my wifes samsung galaxy 3 and brother's Iphone 5 also confirmed the superior call quality.The only thing that would make this phone perfect for me would be is if it was as thin as the Z, it had the glass back like the Z and the remote sensor at the top of the phone. Otherwise, this phone is superior to the Z and merits a five star rating.In the end, I am super happy with my decision and very happy with this phone. I have to admit, it is very expensive but if you want high end, this is high end.******UPDATE******* PLEASE READ!6/4/12 My ZL DIED. Simply put died. I put it on the charger overnight and and when I woke up late due to my phone alarm not going off, I discovered the charger light was not on and the phone would not turn on. I tried a hard start with volume up power, different charges, hard start with charger, new software update. EVERYTHING.  I then did some research on the net and discovered this is apparently an issue with both the ZL and Z. It appears to be something with the battery when letting the battery near zero charge. The night before I plugged in the phone the charge was nearly at zero. Support forums have mixed results with many people able to turn their phones back on. But I could not.TWO REASONS FOR THE NEW 3 star rating:1-There is apparently a major defect with the Z's capable of bricking the phone. (unacceptable for such an expensive phone)2-I have never had a sony defective phone from sony, I've had three. So I never discovered how truly horrendous sony support is. Rude and impatient. I managed to finally get a return authorization number so that they can repair the phone but not after jumping through many hoops. To ad insult to injury, I have to pay to ship it to their facility and no apologies for the fact that I paid nearly 800 dollars for this phone and my Data pictures and apps all gone. And it's a turn around time of 14 days so nearly a month before I get my phone back. Did they ask how I was calling them? Did they do anything to make this inconvenience better? Damn, if I spend nearly a grand for a phone, I expect to be treated like dealerships treat luxury car owners when they take there car to the repair shop. Luckily I kept my trusty xperia s and currently using that.While I don't want to take away anything from this wonderful phone, I just can't look past this HUGE inconvenience thus the new 3 star rating from  5.", "Date": "May 20, 2013"}, {"Title": "Fully satisfied", "Author": "M. Burke", "ReviewID": "R294B0AI6T76FG", "Overall": "4.0", "Content": "I love the phone, but I am not blown away by it.  The complaints about the screen angles are overblown, it looks just fine - yes you will experience wash outs frequently, but really you're usually looking straight at the phone anyway.The phone feels solid as a rock, unlike my old beloved SGS2.  It's also a fair bit heavier, but overall does not feel heavyThere is noticeable jitter and lag occasionally.  However on the whole the phone flies through tasks, you won't think to yourself \"ah man, slow phone\".People pan the battery life, but I find it quite good.  It's easy to get over a day of power out of it with medium usageI had it not even two weeks and already had a nasty drop.  The front and back look great, but surprisingly the metal edges dent and scratch very easily, so I recommend some kind of protective case, even a minimal one.  Sadly mine still hasn't arrived yet... dang.The white looks damn classy in person.  Finger-on-screen feel is better than any other phone I've ownedSide note:Be ready to frog-march AT&T; through your LTE activation process.  This isn't anything to do with the phone obviously, but I spent a good 5+ hours with their support before they pulled their heads out of their butt and activated LTE properly.  Be clear and be persistent if you are on AT&T; and buying this phone.", "Date": "June 11, 2013"}, {"Title": "Value of your expectation.", "Author": "pradyumna", "ReviewID": "R2X28NY6CJAW28", "Overall": "5.0", "Content": "I just love Sony phones. This my 3rd Sony phone. Earlier I was using xperia ray and it was too a sneak peace developed by Sony. But with 5' display, 1080p and stunning Camera  I couldn't resist to buy xperia Z. Initially I thought to buy Xperia Z but due to lack of 4G LTE support in US I decided to go with Xperia ZL. But now I don't feel any regret.Only one concern is about battery life. Sony could have done better. Nevertheless on new power management app you can rely on.", "Date": "June 19, 2013"}, {"Title": "Best phone I ever owned", "Author": "David C", "ReviewID": "R3H6OWD8AS8SRV", "Overall": "5.0", "Content": "This is a phenomenal phone , big screen in a very small form factor , IR blaster (which the z does not have) , camera is great and the benchmarks test that I have run are fantastic and have beat every other phone I have put it up against (iphone 5 , gs3 , and one x), sold my iphone 5 to buy this and I don't regret it a bit , if sony stays on top of software updates and releases them quickly it will be hard to beat this one.", "Date": "April 11, 2013"}, {"Title": "excellent smartphone", "Author": "MikePS3", "ReviewID": "R33Q6CYA7SY3ZU", "Overall": "5.0", "Content": "Switched to T-mobile so I needed a new phone. Initially I was looking at the Xperia Z but I saw the ZL and decided to get it because it is smaller despite having the same 5 inch screen (although its nots waterproof like the Z).Ive had the phone for over a month now and its been great. Battery lasts the whole day with moderate use, the stamina mode really works well to preserve the battery. Sony's UI is simple and very close to stock Android which is a big plus. The phone is very fast, screen is clear and sharp although not as vivid as the screen on the HTC One or the newer Xperia Z1. The camera and walkman apps are fantastic. Speaker and earpiece are loud and clear.  I also love that the ZL has an IR blaster that can run macros so with just one touch of a button my tv turns on, sound system turns on, tv switches to the internet menu and goes to netflix... No more fumbling with 2 remotes!.Overall a great phone, I intend to keep this for a while.", "Date": "December 2, 2013"}, {"Title": "great phone", "Author": "T. Duba", "ReviewID": "R33PHRSQB41LKF", "Overall": "5.0", "Content": "fast, nice display, nice battery comsumption, good looking, lightweightgood camera, i use with smart tags that works perfectly well", "Date": "May 15, 2013"}, {"Title": "Great Phone", "Author": "Ronald Hepburn", "ReviewID": "R3BHS2OABYJUNA", "Overall": "4.0", "Content": "Bought this phone over the Galaxy S4 because of its being a true international 4G phone and its FM radio, which the galaxy does not have. The worst thing about this phone is it camera, absolutely lame images, my old 8MP C905 produces better images than this. It does get a bit warm especially when surfing the net. Other than that this is an awesome phone, the viewing angles are not as bad as most reviews make them out to be, the colours just get washed out a bit. Its fast and snappy, just a bit of stutter at times I find, but this can be fixed with an update. If you want a true international phone this is it.", "Date": "May 20, 2013"}, {"Title": "One Stop Shop! Great Phone", "Author": "Jesse", "ReviewID": "R27DTRN8B02KNU", "Overall": "5.0", "Content": "This phone works like a charm! Sony out did themselves with this one! The screen is crystal clear and is easy to use. I have had no complaints here! I would recommend this phone to anyone! Sony should do more advertising on this phone!", "Date": "March 5, 2014"}, {"Title": "One of the best yet.", "Author": "Ike Mcfadden \"Ike Mcfadden\"", "ReviewID": "R10FWSUZOCPV8O", "Overall": "4.0", "Content": "The Xperia ZL is my 4th Xperia phone, and it's the best so far.Prior, I've owned the Xperia Mini Pro, the Xperia U, the Xperia T and now the ZL.Though I was sometimes less than thrilled with some of the prior incarnations, I'm happy to have stuck with Sony in order to get the ZL, which is one of the best phones I've ever owned.The T was a solid contender, thought the curved-back made the phone overly flex-prone, and the build-quality didn't feel terribly solid.  With the ZL, Sony has essentially put the excellent Xperia Z into a slightly smaller case, while keeping the screen size the same, and eliminating the water-proofing.  Given that I don't drop my phone in the toilet too often, this was a fine trade off for me for a phone that has the innards of a Z, but is about the same size as the T...and therefore fits pretty comfortably for one-handed usage.The screen on the ZL is beautiful, and takes up most of the front of the phone itself.  The bezel surrounding the screen is truly minimal.  I've seen a variety of posts criticizing the viewing angles of the ZL, but can honestly say I've never notice a problem.  Granted, I tend to look straight at my phone when I'm using it...but perhaps there exists a critical demographic out there that enjoys or needs to hold their phone at highly oblique angles while in use.  I don't know these people.Build quality is high; it feels solid all the way around.  It's not quite up there with the standard-bearer in build quality, the iPhone 5S, but it's head and shoulders above competitors like the Samsung Galaxy series, which feels positively toy-like in comparison.Perhaps most important to me, the battery life has been dramatically improved.  One of the primary shortfalls of the Xperia T was it's dismal batter life.  But with the ZL, I've no problem getting thru an average day of use, with energy to spare.  Of course, your own usage might give you different results, but I'm a fairly intensive-user when I'm working remotely, out of the office.  My impression, not having actually measured it, is that the battery life of the ZL is probably *double* that of the T.All my prior Xperia models were great, but all had one or more nearly-unbearable shortfalls that ultimately made them a bit painful to own in some fashion.  I'm happy to say the ZL is the first Xperia phone about which I can honestly say I have trouble coming up with any criticisms or complaints.Sound quality is great, build quality is solid, processor speed is fine, expandable SD card slot is awesome, LTE and WiFi speeds are top-notch, and the new implementation of Bluetooth 3.0 has significantly improved connectivity and stability with other bluetooth devices/accessories.Some users have commented on not liking the rubbery/plasticky back on the phone.  I think this is specific to the black-model.  I purchased the red one, and the back does not have the textured/rubbery back to it; it's solid and smooth and sturdy as far as I can tell.", "Date": "January 20, 2014"}, {"Title": "Sony", "Author": "OMONGOREME", "ReviewID": "R2ZN4BG8L77QDS", "Overall": "2.0", "Content": "In general the phone is okay, the only issue is that it does not keep charges. I wish it could allow to instal another battery. Good customer service though.", "Date": "January 17, 2014"}, {"Title": "Great Phone very few have heard of", "Author": "A. Law", "ReviewID": "RUEI3M41JUO4H", "Overall": "5.0", "Content": "The Sony Xperia ZL, a sibling of the much hyped Sony Xperia Z in the rest of the world, it's a great Android smartphone. Size wise it is similar to the earlier generation Xperia Ion so it is amazing engineers at Sony are able to pack a massive 5 inch screen into the tiny body. Though perhaps because of the sheer size of the screen, the front facing camera is placed at an awkward position which makes any kind of video calls funky.Feature wise this phone can give the Galaxy S4 a run for its money.Sony has been making great phones since separated from the failed joint venture with Ericsson. Unfortunately, the marketing arm doesn't seem to know a thing or two about the US mobile market. This phone is priced competitively with other \"unlocked\" devices like iPhone and Galaxy S4, but in the US there is almost no meaningful market for \"unlocked\" devices. US consumers are so accustomed to device pricing with network subsidies from 2-year contracts they will scream at $500+ price tags for smartphones even though that is how much these phones are priced outside the US.", "Date": "October 11, 2013"}, {"Title": "Fantastic phone", "Author": "Vince", "ReviewID": "R3NHB893Z0DMQ3", "Overall": "5.0", "Content": "This is perhaps the best phone I've yet had when you consider it's feature-set and design both independently and compared to it's contemporary peers.Between the small bezel and frame housing a 5\" screen, the extensive LTE support and usual high-end specs -- 1.5GHz snapdragon, 2GB memory, 12MPixel camera, 2370mAh battery -- it's an impressive piece of hardware. The industrial design is just sexy, in my opinion. I do wish it had the waterproofing of the Z or ZR, but this is a worthy trade-off in my mind for it's smaller size, especially considering my usage.I've heard a few complaints that it shipped with the Snapdragon APQ8064 processor clocked @ 1.5 and while I'll take any processor improvement I can get (Snapdragon 800 would be great), so far the UI is smooth and 1080p x264/AVC videos run well. Frankly, these phones summed over a normal usage pattern spend most of their times down-clocked, so the extra head room is only seen in edge-cases. And in the long-term, as Android advances it seems to be most sensitive to memory capacity, which all these phones have 2GB of.So, I very much like this phone. In hardware terms it's fantastic. I have no complaints and as long as Sony keeps up the quick work in porting over new Android revisions, I'll be happy.", "Date": "July 10, 2013"}, {"Title": "amaizing phone & love it.", "Author": "HRevie", "ReviewID": "R3BJ92PTQ0WPCD", "Overall": "5.0", "Content": "I used Xperia Ray then went to iPhone4 after that choose Galaxy SIII then change operating system bought Nokia Lumia 920. Everything was right except lacking of applications in WP system I came back to Android and was waiting for something Stylist and has good features. Finally I found Sony Xperia Zl and the best part of it I can use any network.I'm now using SIMPLE MOBILE and it's wroking great.So far no problem. Love the phone.", "Date": "June 11, 2013"}, {"Title": "Great Phone", "Author": "Ricardo", "ReviewID": "R2FE0QDCSYLK4J", "Overall": "5.0", "Content": "I found it to be a great phone, great screen, great performance, excellent camera (in good light conditions), Sony additions to Android don't bother or even are good, solid construction... to summarize, I really recommend this phone.The only bad thing is that the screen has some small scratches by just putting it into my pocket, by itself, with nothing else in the same that you could say caused them.", "Date": "June 7, 2013"}, {"Title": "Very happy with my new phone", "Author": "Juan", "ReviewID": "R1ZBOJ7J832WO9", "Overall": "5.0", "Content": "Product arrived on time.I love this phone. Great specs. I like the camera. The stamina feature works very well for me.", "Date": "May 20, 2014"}, {"Title": "Is not a good phone", "Author": "Roger Fallas", "ReviewID": "R3BYEM0STJM75I", "Overall": "2.0", "Content": "This phone does not work well. It get hot when it is charging.Sometimes sounds good, sometimes does not sound at all.I would like to know if this model has been showing problems or is bad luck.I want to know what can I do to fix it or replace it.Thanks.", "Date": "May 16, 2014"}, {"Title": "Great Transaction", "Author": "panblondie", "ReviewID": "R28RSFE57G9LQD", "Overall": "5.0", "Content": "Great transaction. I do like the phone but it does have what I might consider a bit of a \"software glitch\". The voice recognition for auto dialing.... it often does not understand regardless of how clear I speak... it also gets stuck - I have to shut the phone down to reset that function. Otherwise it seems like a nice phone so far.", "Date": "May 9, 2014"}, {"Title": "Best Phone ever", "Author": "CM", "ReviewID": "R39DIH0CG1J4J7", "Overall": "5.0", "Content": "Very satisfied with this phone. One of the great functions is the remote control via infrared that allow you to control many devices. Screen is very clear, much better that the Nexus 4.Only one issue is with the android version, is not the lasted one but Sony is working on that.", "Date": "April 10, 2014"}, {"Title": "very high quality product", "Author": "V Magic", "ReviewID": "R1QR247VIMRGPZ", "Overall": "5.0", "Content": "This is a very high quality product which in-person is just as advertised. I was very surprised at the overall look of the book. Images are clear and step-by step is well done.", "Date": "November 20, 2013"}, {"Title": "Great Phone", "Author": "Jose Vaca", "ReviewID": "R2TPMK89YID71I", "Overall": "5.0", "Content": "I really love it. This is not only a phone. This UE have a great camera 13M and it is: walkman, ebook, radio, clock, etc...", "Date": "September 2, 2013"}, {"Title": "Beautiful phone by Sony", "Author": "Zardoz", "ReviewID": "RGDHT6359AW6S", "Overall": "5.0", "Content": "Technologist and early adopter here (sort of). Sony has made a great product with the Xperia ZL. I did my research and upgraded from a 2yr old Samsung Galaxy S2 which was starting to freeze and just being a complete inconvenience. The Xperia ZL is a gorgeous phone with lots of very cool features (check out the tech specs from any reputable site). Battery life is good (with the Stamina mode), doesn't feel cheap or commonplace to hold, and not a whole lot of bloatware to whine about. Love it!", "Date": "July 20, 2013"}, {"Title": "A step above", "Author": "Brian Linton", "ReviewID": "R1B508TLTYQ6NY", "Overall": "5.0", "Content": "By far the best smartphone I've ever had. Or used. Its not that any one feature stands out, but everything is high quality and works flawlessly. The only thing better might be the xperia z, but for those of us who don't use tmobile that doesn't help much. Other phones might have one feature with better specs, but you lose nothing overall with this one. Great video and picture quality. The viewing angle problem reported by others is greatly exaggerated. It depends more on the quality of the media being viewed.", "Date": "July 7, 2013"}, {"Title": "Excellent phone, short battery life.", "Author": "R. Flores \"KDT\"", "ReviewID": "R27UK1LMMCMSCR", "Overall": "5.0", "Content": "This is one of the best phones I've had. Thin, fast, excellent camera, large screen. Though the screen is large it is the same size as the Lumia 920 I owned. The battery life is short, on heavy use only last 4 hours, on average use can last almost all day. It comes with a Sony back up feature that backs up an \"image\" of the phone into the microSD card. The PC interface is also very useful.I wish the headphone set that comes with it would be of better quality. The front facing camera placement is odd.", "Date": "July 1, 2013"}, {"Title": "awesome phone!", "Author": "carabina", "ReviewID": "R30Q1ZV42I9R21", "Overall": "5.0", "Content": "The phone arrived on time, its bigger then what I'm used too but still comfortable in my hand.  I went back and forth between t5his one and the z model but Im glad I ended buying this one.  The earphones are better quality then I expected.  Love it!", "Date": "June 10, 2013"}, {"Title": "This Sony Android  Super Smart Phone Is in the Top 3 Reviews Worldwide", "Author": "Ricanguy007 \"Ricanguy007\"", "ReviewID": "R1B0Y4RHZPM3Q3", "Overall": "5.0", "Content": "This Sony Xperia  ZL LTE C6506 Unlocked Android Cell Phone is actually one of the best and in the top 3 line up ,It has corrected most of the problems that the models before had, the other 2 that compete not to mention models but I will mention names Samsung and HTC, all 3 models are good but Sony has a better reputation the parts come from Japan reliability and quality  although they are built in China that's because of labor cost like all of them. Most of your waterproof phones have poor air circulation and they over heat not the new Sony, the Sony's only 2 problems could , not be a problem and would make it better than the rest 1. ear piece for listening is a little low there is a free Android  application called soundabout get the pro , set it to let phone decide option that takes care and improves it tremendously and 2 put a good screen protector and you will have the best phone money can buy you. Super fast, has most of the best android apps included and even better made by Sony, looks way better than the others, Beautiful and Sexy  and  sounds really nice is also more solid and closer to perfection than the others, I did purchase other models and returned them after a week  they have their issues because there isn't such thing as a perfect cell phone. The other 2 1. is very cheaply made as usual and the other has many issues and very ugly grey phone.", "Date": "August 14, 2013"}, {"Title": "Unlocked?", "Author": "Sphinxly", "ReviewID": "R243NGPGM684NC", "Overall": "3.0", "Content": "I would only recommend this phone to someone intending to use the T-Mobile/AT&T; platform.  I made the mistake of thinking unlocked meant it could be put on any plan.  The person who laughed at me in the Verizon store happened to be a good friend, so I wasn't upset, but I intend to return/sale this item.", "Date": "April 22, 2014"}, {"Title": "Refurbished isn't always garbage... only when not done properly", "Author": "Rism", "ReviewID": "R1C8TLL1P4NWUW", "Overall": "1.0", "Content": "The phone didn't work properly straight from the package.  It was obvious that this device wasn't tested since it was refurbished and you would think that would be taken care of prior. Would have been a good deal if not for that, but I thought this whole transaction was a waste of time for all involved and could have been avoided.", "Date": "March 15, 2014"}, {"Title": "excellent cell...AMAZING", "Author": "roberto zambrano", "ReviewID": "R1031NLVYRM2P", "Overall": "5.0", "Content": "excellent cellthe screen of this phone is amazing, wonderful interface, browse great with the chrome and opera, the videos look excellent, and the audio 8 of10.the headphones can hear a little low.FINAL NOTE: 9", "Date": "August 3, 2013"}, {"Title": "Battery Life Poor", "Author": "PC", "ReviewID": "RZW3IACHF4RDV", "Overall": "2.0", "Content": "This is my first Android phone and it's not a bad phone but the battery life is very poor. It would not last a whole day if I were to use continuously, especially watching movies.", "Date": "December 14, 2013"}, {"Title": "Awesome", "Author": "eLectr1c1an \".\"", "ReviewID": "RWEUWYB79GTJU", "Overall": "5.0", "Content": "Great phone - Very fast - I have other sony products and works great with my playstation and TV. Great buy, well worth the money.", "Date": "July 16, 2013"}, {"Title": "I dont have this product", "Author": "Dori J.", "ReviewID": "R389XXGJXCK709", "Overall": "4.0", "Content": "This product,I have to return, so far my instinct works...when in doubt about  a certain item, return for it will just become a headche in the end.", "Date": "June 22, 2013"}], "ProductInfo": {"Price": "$759.99", "Features": "5 inch brilliant display powered by the Mobile BRAVIA Engine 2\nStandby Time : Up to 460 hours1 Talk Time: Up to 13 hours1\nThe 13 MP camera is built with the Sony?s Exmor RS for Mobile image sensor for better sensitivity under low light.\nBattery STAMINA mode gives you up to four times more standby time by recognizing when your screen is off and will then turn off functions you don?t need, while keeping the notifications you want.\nCPU/ Processor : 1.5 GHz Quad Core Snapdragon S4 processor", "Name": "Sony Xperia ZL LTE C6506 Unlocked Android Phone - US Warranty - (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51qw6EtptLL._SY300_.jpg", "ProductID": "B00BP54X2K"}}