{"Reviews": [{"Title": "great phone, works perfectly on t-mobile's network in refarmed areas", "Author": "Vekoma", "ReviewID": "RTM8KWK3SB5BE", "Overall": "5.0", "Content": "Phone looks very stylish and feels solid.I have no of the complaints about the viewing angle of the screen as some reviews suggest. Screen is very bright and colors are vibrant and yes they fade out when viewed from an angle but you can still easily read the screen from any useful angle. I feel this issue is greatly exaggerated by some.Call quality and especially speaker quality are excellent for a phone. Signal is great on T-Mobile network in the area where I live (refarmed area). 3G and LTE both work out of the box.Battery life seemed less than what I was expecting at first. I suspect the media server service that was running in background was draining the battery. Killing that service and turning on Stamina made it only lost 4% battery on standby for the last 18 hours.", "Date": "September 16, 2013"}, {"Title": "Extremely pleased with the product.", "Author": "John Alexander", "ReviewID": "R27564WT5GXSRL", "Overall": "5.0", "Content": "Packaging and equipmentThe sales package, as well as user manuals quickly, contains a battery charger with USB port and a USB data cable / microUSB and a pair of stereo headphones of good quality.ErgonomicsAluminium case makes it feel solid in your hand, size still allows for one-hand operation and fits easily into your pocket. It has beautiful design.DisplayScreen quality is excellent, colours are sharp, graphics are quick, no lag on screen swipes or task switching.Usability and multimediaBattery life often runs for a day without charging (Note: I am a heavy phone user ... answering several calls, taking a lot photos, using Waze on the car, play games when I can, wifi and mobile data always on). It always has between 200-300Mb of RAM free. It can handle your DualShock 3 natively. Xperia settings has screen mirroring, Xperia link and a new option MyXperia!! (With my Xperia you can locate your device with a sound alert or display its position on a map. You can also erase data and/or lock your device if you lose it.) The camera is good for me.SoundSound is terrific, both from a music listening or a telephone call.SoftwareCompletely unlocked (No rooted, It only assures you will get last updates from SONY without any problem). I comes with Android Jelly bean 4.1.2 (12.0.A.1.211). It automatically update to 12.0.A.2.245 when you connect to WiFi.SignalGreat!! I’m from Colombia. Actually I’m with Claro which use 850MHz for GSM, 3G and HSPA  bands and works perfect. I can’t use LTE because there is no service of it yet. But if you want to buy this phone ask to your service provider the frecuencies they will use for LTE. For Colombian this phone (C5306) will work fine on LTE with Tigo, Movistar, Exito and Virgin. For Claro users buy Xperia SP C5303.", "Date": "September 4, 2013"}, {"Title": "MISSING ITEMS", "Author": "jadie", "ReviewID": "R3ILXOS41EZQBE", "Overall": "5.0", "Content": "I love this phone however I did not receive any data cable or charger for this product. It was a huge disappointment to me because not only did I have to wait longer than I anticipated to use my new phone but I had to purchase a charger separately", "Date": "October 11, 2013"}, {"Title": "Great Phone for a  Great Price", "Author": "Russell Jasper", "ReviewID": "R29UO4RTZ6RV02", "Overall": "5.0", "Content": "Fast and responsive. It may not be the lightest phone it's the quality that matters and Sony has always made good stuff -- It feels like a real phone... Not as big of a screen as like the Galaxy 4s but big enough...Battery life is amazing. I usually put the phone on charge each night but the battery is usually still around 60-70% by the time I head off to bed. I could probably go two days without a charge. I use it for Strave, facebook, some music, email, and maybe 20-30 minutes of talking a day.For the Camera this is important! There is a separate button for the camera and it's a button where you press it half way and the phone will do it's auto-focus and stuff so when you fully press there isn't any shutter-lag... Great when you are trying to capture action-style photos.  This is where those galaxy phones cannot compare...Also, prepare to get your scissors out because you probably will need to trim your sim card down to the mini size. I have straight talk and all their sim cards will work but the wrong size... So don't freak-out that the card won't fit at first... Download a template or just eyeball it...One last thing is a peeve. The on/off button is right smack in the middle of the side of the phone. Good luck not inadvertently turning it on all the time from just holding it or picking it up. I have a security screen so it doesn't accidentally do any crazy stuff but  you will realize pretty quick that that button could be place in a better spot...", "Date": "October 12, 2013"}, {"Title": "Xperia SP Model# C5306 (USA)", "Author": "RH", "ReviewID": "R1HJ7R3776IMMT", "Overall": "2.0", "Content": "Nice size phone and features for the money...but. Out of the box, the phone has a great feel and size. I spent a week researching a GSM phone with LTE that I am able to use oversees. After looking at the usual phones, (Samsung, HTC, Apple, etc.) I decided on the Sony Xperia SP. The initial setup of the phone went smoothly, however, as soon as I turned on \"Wi-fi\" to update my Android Apps, that's where my problem started. The phone immediately went into \"reboot\" mode. It wouldn't stop re-booting, I immediate called the Sony Technical help line. Tech Support walked me through and was able to shut the phone off after about 30 minutes of constant re-boot. He had me do a reset to the phone since he said it was a software glitch. He then emailed me a link to a file that Sony uses on their products in order to update software. I did that. The phone accepted the update and the phone re-booted as normal. I re-inserted my sim card and did the normal \"new\" phone setups. However as soon as I turned on the wi-fi, the phone did the same thing! I immediately goes into re-boot mode.I called Sony since I bought this product directly from Sony dot com and they told me to return the phone for a replacement. If you buy this phone, please research the Xperia Model you intend to buy for wi-fi problems on the internet and you'll find this is an issue with these phones. If you decide to buy this phone, make sure you have the option to either 1) return the phone for repair 2) have/buy a warranty and 3) the patience to deal with Customer Service", "Date": "July 19, 2013"}, {"Title": "Great phone, but with some memory issues...", "Author": "J. L. Ajaye \"Lee\"", "ReviewID": "RZ0DE1UB7N4FJ", "Overall": "3.0", "Content": "I purchased this phone, so that I wouldn't have to deal with paying a phone contract. While it is tons better than my old Nexus S, it has one fundamental flaw. that my Nexus S didn't. While the Nexus S had the same amount of ram as the Xperia SP (16 GB), the Nexus S would allow me to move programs from the main phone memory to external phone memory. Something about the way that Sony handles their memory will not allow that to happen. I verified this on both my phone (Xperia SP), as well as my friends Xperia Z1. Then I tried to download about 4 or 5 apps that will allow this increased functionality. They all failed, and came up with either an error message, or the section that would allow you to manage the memory was faded out. Sucked! Great phone otherwise, oh and the other issue is that the camera seems to have issues focusing. Other then these two short comings, i'm happy with the phone.", "Date": "May 22, 2014"}, {"Title": "My Best Phone Ever With Great Battery", "Author": "Amazon Fan", "ReviewID": "R1HKX6BG3GVJ8W", "Overall": "5.0", "Content": "I have bought this phone for 2 months.It is so great for its price.What I liked most:1- its performance: its touch is so responsive.2- its appearance is Wow.3- it has a nice camera.4- The battery lasts for long: I always use it for all the day, and it is still 30% left at the end of the day.It is a wonderful phone for daily use.", "Date": "April 5, 2014"}, {"Title": "A great choice offered by Sony!", "Author": "Dynamic Six", "ReviewID": "R2WKR2ZRGNJBB2", "Overall": "5.0", "Content": "In the sea of Samsungs and iPhones, it's refreshing to still able to own a mobile phone that somewhat separates the user from the masses. Thankfully, there is Sony, which not very many people knew that they still even makes phones.I started using Sony Ericsson phones since 2006 and along with Nokia, they were the best phones ever made IMO. I didn't go with a Nokia Lumia model is because I just can't get used to Windows Phone OS. I did try one for 2 weeks and just couldn't do it.The build quality and functionality of the Xperia SP is top notch. Not to mention the design and engineering of it itself. It's strange to me as to why people would rather shell out money for Samsung Galaxy S1,2,3,4, which I think is extremely unattractive due to the oval body, than purchasing a Sony mobile phone. This SP has awesome call quality, fantastic battery life, and excellent construction. I have had it for almost a month and so far it performs very well for my needs. I should mention that it is used on US T-Mobile LTE network and I get signals everywhere; even in remote areas where our other HTC would have absolutely no chance.First and most importantly: Call quality is superb. Caller on the other end have reported significant better sound and clarity from HTC and Samsung. On my end, same thing.Secondly: Graphics and everything else. The screen is very clear and color is crisp. There is no lag in the touch screen and all apps booted up very responsively. Out of the box, there is not a whole lot of useless bloatware either, so that's definitely a plus.Also: Battery life is very good as I had expected. Without the STAMINA mode phone lasts an entire day with moderate usage. With STAMINA mode on, a little over 2 days. Which for a screen of this size, that is pretty darn good.Extras: I especially like the LED light strip on the bottom which allows me to know when and what notification just came in so I don't have to always turn the screen on. It also illuminates accordingly when viewing photos and playing MP3 with album art. Camera is okay for a 8mp phone cam as no one should expect DSLR image quality. For that, I have my Canon 5d Mk3.I have not had any issues to Wi-Fi connectivity or phone randomly rebooting as mentioned by another reviewer. If that does happen, I'd say to get an exchange from Amazon as it is probably a bad copy.At the price point, I would highly recommend the SP. If you have another $150 to spare, you might want to get the Xperia ZL (model #C6506 LTE). The Xperia ecosystem has many models that can often be confusing so be sure to check out the whitepaper document on Sony Mobile's website for specifications. Cheers!", "Date": "February 18, 2014"}, {"Title": "SUPERIOR SONY QUALITY!", "Author": "jOHNNYCASH", "ReviewID": "R1Y5QAJYZFPJ23", "Overall": "5.0", "Content": "IVE DROPPED THS PHONE OVER 20 TIMES AND IT NEVER CEASES TO IMPRESS ME. IVE BEEN A LONGTIME SONY FAN AND HAPPY TO CONTINUE TO PURCHASE A HIGH QUALITY JAPANESE ITEM. KEEP IT SONY", "Date": "August 27, 2013"}, {"Title": "Good value", "Author": "Yang G", "ReviewID": "RS3ZAOI92ZJ7I", "Overall": "4.0", "Content": "Decent phone with decent specs simialr to a 2012 flagship, but at a much reduced cost.  Pretty fast with only slight lag when heavily multi-taskingWorks well with t mobile 3g hspda and lte in the US.When purchased price was $235.  The main competitor at that price point for unlocked phones with LTE was the 4g version of the Moto G at 220.  Has similar specs, feature sets, and build quality. Light strip is a cool feature as the led color can be changed for different kinds of notifications.  Audio quality from the jack is decent as expected from sony.  Aluminium border makes the SP heavier than the G for a more solid feel.  The SP is dual core compared to the G's 4 core,  but clocked higher, which means that single apps run better on SP while multitasking is a bit better on the G. The SP's gpu is much faster so gaming performance is better. SP is only 4.3 while G is 4.4 kitkat though an upgrade is possible.  Sony's skin is pretty decent and isn't too far from stock android.I chose this over the G for the better graphics performance in games and the heavy aluminum frame, which i felt sufficiently justified the $15 premium ove the 4G Moto G.", "Date": "June 2, 2014"}, {"Title": "Disappointing Sony Product", "Author": "ryan", "ReviewID": "R2CHI3RMTHQVFF", "Overall": "1.0", "Content": "I've had this phone for around 7 months. Since I have received it, it's gone downhill fast. I've had to uninstall nearly every app and widget that I have just to be able to open my phone from the lock screen without it freezing up on me. After around 2 months is when I started having problems such as google chrome not responding, my messages not wanting to open, not being able to receive emails, and the list goes on. It finally reached the point that anytime I received a message or email I would have to wait anywhere from a few minutes up to half an hour waiting on my phone to unfreeze itself. I tried rebooting, connecting it to my computer and anything else I could think of and nothing would work. I love every Sony product I've ever bought except for this one. I would advise saving your money and investing it in another phone. For the price that I originally paid for this phone I could have gotten a Google Nexus 5. But as I said, I've had great experiences with Sony up till now. I don't know if I may have just received a \"bad apple\" or what the issue is. But based on the other reviews this product is working great for others. I just wanted to share my experience with this phone since it has by far been the worst phone I've ever had.", "Date": "June 2, 2014"}, {"Title": "Really sleek but a little slow", "Author": "ZAC RICCIARDI", "ReviewID": "R30UIJSLAMONJK", "Overall": "4.0", "Content": "So I bought this phone after reading that it would have 4g coverage in metro areas. I liked the fact it was a Sony. I'm bummed because it only supports 3g. Lucky  for them most of the data I use is wi-fi anyway. I wanted a step up, this was just a step over.", "Date": "May 16, 2014"}, {"Title": "sony still needs Ericsson", "Author": "yaw", "ReviewID": "RWG2RRK7OIUWF", "Overall": "1.0", "Content": "I bought sony xperia sp for just one month and this phones started freezing.Am so pissed because for all I know I thought I could use this phone for a while.this freezing style is beyond repairs.sony xperia sp needs a recall .", "Date": "May 13, 2014"}, {"Title": "High Expectations - Mediocre performance.", "Author": "krashreport", "ReviewID": "R21U5T89MNFO8K", "Overall": "3.0", "Content": "I chose this phone for many reasons - primarily: 4g LTE capability, price and styling. I didn't want one of these big tablet sized phones that seem to be popular now but I needed it to have a useable screen size. I also prefer the squared look rather than rounded corners of the Samsung look alikes. 4G Lte was available and the price point was in that $250 - $300 sweet spot. This phone fit the bill in those areas.So here's what I found after using the Sony Xperia SP C5306 for a couple months:PROS:- The screen size is perfect for my viewing & operational needs, exact ratio for HD & widescreen movies.- The phone size is not too big for one-handed operation - something I find indispensable when I'm on the move.- 4G LTE capability with all the GSM carriers - I've used it with AT&T; and T-Mobile so far, and got excellent LTE connection.- Android 4.3 OS- Dedicated camera button with shooting capability while locked. Very useful- Camera is pretty sharp with a good feature set for shooting options.- Operational buttons are ergonomically well located. Charging port is not.- Ability to disable some native apps that cannot be uninstalled. More a feature of the OS than the phone.- Speakerphone is quite loud with the xLOUD feature - much louder than other phones I've used.- NFC (Near Field Comm) feature actually works.CONS:- 1 GB RAM is not sufficient for this phone with all the bloatware- Lots of Sony & Google Bloatware. Disabling any Google feature requires a cache- Fixed Battery with mediocre capacity. I dont think android devices should ever have fixed batteries until the power consumption efficiency is up to par with the iOS mobile systems. This battery lasts 1/2 day and requires repeated charging throughout the day . Of course, its going to become the single suckiest annoyance 9 months from now when the battery's efficiency naturally drops to half its capacity.- Does not boot quickly - takes about 2 - 4 minutes to completely find itself.- WiFi & Bluetooth dont play well together. I sometimes have to disable one feature for the other to work. A rather frustrating problem as I need to use both constantly.- Bluetooth is flaky with multiple devices. In my car it bounces back & forth erratically between my headset and the car system, rather than just locking on to one. Or both, like my Samsung does.- An annoying lack of small but important feature: the restart option. In order to reboot we go back to the old method of waiting for shutdown & if you remember, hard bootup again. Just a personal pet peeve.- Screen brightness auto control does not work well and does not keep its settings. It drains the battery if not monitored constantly.- Cannot truly turn off the large notification light at the buttom of the phone to save power. This flashes for all messaging & call alerts even when the alerts are turned off. Sometimes it works, sometimes it doesnt...there doesnt seem to be consistency in its operation.- Charging port is peculiarly located. At first everything seemed to be in the opposite positions than I was used to on my other phones...like driving a car in London. But I realized that the charging port, which has cables hanging weirdly from the top left corner of the phone, made it difficult for a right-hander to handle while charging. Which happens often.- Sound volume on calls is disappointing especially when the Clear Phase feature is turned on, which ironically is meant to improve sound.- Sonys UI leaves a lot to be desired in many areas. The messaging applet is simple, cannot be reconfigured and lacks many useful features. I installed Handcent third party messaging app just so i can text normally.Overall the Sony Xperia SP LTE is a very capable mid-level phone at a very good price point that attempts to imitate its more capable (and much more expensive) sibling the XPeria Z. The slower processor is really what makes a significant difference in the experience. Despite the flaws i like it. But I know it will become a useless brick in 13 months after the fixed battery loses most of its charge capacity.", "Date": "May 8, 2014"}, {"Title": "It's lighting up blue", "Author": "NYCTechie", "ReviewID": "R2DSEA9E185GD6", "Overall": "4.0", "Content": "Overall, I really like the phone. The bottom glass-like plastic lights up when you receive a text, email, or alerts. It also lights up when charging (you can set the lighting options)The only thing I don't like is that it lags a bit, and it does get annoying, but for the money i would figure this issue wouldn't come up in 2014 smartphones from sony.hence only 4 stars", "Date": "May 7, 2014"}, {"Title": "I admt..", "Author": "Cathy Knox", "ReviewID": "R17ZB85XXBM7O2", "Overall": "4.0", "Content": "Great phone, Great layout, Great sound. The light at the bottom is wonderful, yes it came unlocked brand new with a charger and earphones with a mic :).. What i will say is that it does have some glitches but im sure that is just regular android or dual core stuff during some games. I am however scared to update it to 4.3 due to all of the complaints about issues involving buggy update. LOVE the interface and everything though.", "Date": "May 6, 2014"}, {"Title": "disappointed!!!", "Author": "Dahomey Romero", "ReviewID": "R153XK48LX6G8F", "Overall": "1.0", "Content": "I am totally disappointed with this phone the first thing I noticed was that the top of the touch screen DOES NOT WORK no use I can not select the notifications.", "Date": "May 3, 2014"}, {"Title": "I got this phone like new He don't have even a scrach But works ...", "Author": "Nicolae", "ReviewID": "R2QFQWE5EMLI9G", "Overall": "3.0", "Content": "I got this phone like newHe don't have even a scrachBut works really slowHopefully I can fix it by warranty", "Date": "April 29, 2014"}, {"Title": "very good", "Author": "Aenlly", "ReviewID": "R2RDDD9PIERNQS", "Overall": "5.0", "Content": "It is a very good phone, looks nice, i like, it is advanced technology, but the frontal camera is poor.", "Date": "April 15, 2014"}, {"Title": "Sony Xperia SP", "Author": "David", "ReviewID": "R35MZ8P9EV1FHS", "Overall": "5.0", "Content": "I bought this smartphone for my wife.  This is her first smartphone and she loves it.  It is 4.6\" and large enough to use like a small tablet.  For 8mp, the camera takes clear and accurate photos.", "Date": "April 15, 2014"}, {"Title": "Excelent phone!", "Author": "Alex S", "ReviewID": "R2JPXGHGBVGO4I", "Overall": "5.0", "Content": "I bought Sony Xperia SP as a Valentine gift for my wife.Great phone and simple, logical, easy to use Sony's user interface. Absence of bloatware that phone comapnies add to their phones is a huge plus! Overal I'm impressed how the phone works. At some moment battery started to leek by the hours, but after reseaching the internet I found that it was Skype for Android, which seems to be fixed sinse that itime. I think for the price it's a very good phone and I'm thinking to buy one of the new Sony phones to replace my Sumsung Galaxy S3 from T-Mobile.", "Date": "April 9, 2014"}, {"Title": "great stylish phone with usual android bugs and glitches", "Author": "Booluvgoo", "ReviewID": "R23SIUIJVMJLQQ", "Overall": "5.0", "Content": "There are plenty of \"professional\" reviews out there.  Mine: great product although not without glitches and bugs.  Bought for my fiancée and she loved it.  Heck I love it too! But it IS a gift for her...  My decision for purchase was based on gsmarena.com review.  It is a very accurate review of this phone. This is not a statement based on just a week or so of usage.  Phone really stands out among typical iPhone and Samsungs in term of look - gotta love the status light!!  The screen can be crack very easily!  Learned this the hard way - she pulled it out from her purse and a line ran across the screen at bottom corner! Called Sony and after a few frustrated transfer calls and two heated arguements with a particular stubborn and \"dense\" rep (she told us the crack has to be caused by accident if it was to be replaced/repair! Um Duh?) we finally were able to add a warranty for accidental damage and got 1 brand new sent to us for exchange in just 4 days!!  Great program no doubt so highly suggest it in case you decide to buy this phone.", "Date": "March 27, 2014"}, {"Title": "Great mid-range phone that does not work fully on T-Mobile", "Author": "dko3tgk", "ReviewID": "ROE6W8TXRLO4H", "Overall": "2.0", "Content": "This is a great mid-range phone.  Nice sized, nice processor.  It has the cool and useful led light bar at the bottom for notification.  But it completely confuses me why Sony would design this phone with T-Mobile's LTE bands, but NOT T-Mobile's HSPA+ bands?  If you use this phone on T-Mobile, it will only work on LTE, when you don't have LTE signal, it only works at 2G super slow data.  What poor planning.", "Date": "June 27, 2013"}, {"Title": "1GB memory is not enough", "Author": "hf", "ReviewID": "RGIYX3QTVHMAL", "Overall": "3.0", "Content": "nice design.solid feel.good enough screen.bit on a heavy side, but it's manageable.when running smoothly, very good phone...BUT lacks memory.1GB of memory is just not enough to run the phone smoothly with all the apps and stuff you're expecting to run when using a smart phone.  Phone freezes every other day or so....my advice, unless you're using this phone to just make calls, buy a phone with at least 2GB of RAM.", "Date": "April 11, 2014"}, {"Title": "A good purchase", "Author": "Julio Cesar Martin", "ReviewID": "R39GOCX30NQ0EX", "Overall": "5.0", "Content": "Sony did not disappoint with this model, good signal, fast response, upgrade to the latest version available, LTE and NFC support. I love the screen size and the ability to withstand heavy games", "Date": "October 28, 2013"}, {"Title": "Should have bought a later and faster phone", "Author": "howard weinstein", "ReviewID": "R16PM3UFHBLGK2", "Overall": "1.0", "Content": "I am not happy with this phone. Could not receive lte. Found data very slow. Would. Not recommend it. Not the latest model.", "Date": "March 31, 2014"}, {"Title": "Great Phone!!!!", "Author": "K. Dryden", "ReviewID": "R2A2KDRVPUVHP6", "Overall": "5.0", "Content": "This is a great all around device. You really cant beat it for the price. Sony makes an excellent smartphone!", "Date": "March 14, 2014"}, {"Title": "Excellent", "Author": "Victoria Pimentel Díaz", "ReviewID": "R1RICAWW0CRJMI", "Overall": "4.0", "Content": "Excellent product filled the expectations, I will recommend to family and friends. Perfect and consistent packaging. May. Thank you. Sincerely. victory", "Date": "March 13, 2014"}, {"Title": "Good bang for your buck", "Author": "Simonarturo", "ReviewID": "R2RWM2YWOVATTC", "Overall": "4.0", "Content": "Recently bought one of these for my mother. This would be her first Android phone, and even though adjustment was not easy (formerly a Blackberry User) the phone itself is pretty good.For regular use (email, instant messaging apps and the like) the phone works wonders. It has a nice design, feels solid on the hands  and has been an overall nice experience. It has a light indicator at the bottom for different things such as incoming calls or mails, it's a nice touch, specially if you tend to use the phone muted while on meetings or work.Would definitely recommend this phone for users that want a good Android phone without having to pay a premium (tho you could also take a look at the Google Nexus brand). Regular users don't really notice the difference between a dual core or quad core processor, or between 1gb and 2gb of RAM. If you are a power user, gamer or a technophile you could do better taking a look at this phone's big bro, the Sony Xperia Z (or the aforementioned Nexus 5)For those buying this phone for overseas, bear in mind that there are actually 3 models of this same phone and the only difference between them is the supported bands. I'd suggest taking a look at what bands are used by your carrier in your country and then at the bands each Xperia SP supports.", "Date": "December 19, 2013"}, {"Title": "pleased", "Author": "carla rappe", "ReviewID": "R7Q7BH6L4V6W7", "Overall": "4.0", "Content": "well I am very pleased with it. the screen is beautiful, its plenty fast for my needs, the wifi connection is very good, call quality is not incredible but good enough. great sound when playing music, very good camera. the one real downside is that Sony stuffs it up with lots of bloatware, Sony-specific apps that I don't really need or use. And accessories for it are quite a bit harder to find than for Xperia Z", "Date": "December 4, 2013"}, {"Title": "you get what you paid for", "Author": "vveliz30", "ReviewID": "R5ROP5IMS5KO9", "Overall": "4.0", "Content": "Very good looking phone, it has a good performance even with several applications running at the same time, be careful when looking for the bands that works with the different models of the phone. it takes a long time to get fully charged and its kind of hard to find out additional accessories.", "Date": "October 28, 2013"}], "ProductInfo": {"Price": "$489.99", "Features": "Black Xperia� SP LTE 4.6\" HD Android� Smartphone", "Name": "Sony Xperia SP LTE C5306 Unlocked Phone--U.S. Warranty (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41YzCB6YzzL._SY300_.jpg", "ProductID": "B00CHHE3W0"}}