{"Reviews": [{"Title": "Tricky Phone", "Author": "Kenneth E. Morris", "ReviewID": "R3MWSC92JV60YR", "Overall": "4.0", "Content": "I only got this phone a few days ago, so can't speak to longevity issues, but my inclination is to like it, with one exception:  There is no manual and it's almost impossible to find basic instructions online.  Oh, it does come with a very short manual in small print, but that doesn't even tell you what keys do what (or what all the keys can do).  I had to run it by it a tech-savvy computer instructor to learn basic things like how to get the menu up.  And come on, while I'm not Mr. Techie, this is my 6th or 8th cell phone over twice as many years, so I'm not completely clueless.  My feeling is that Blu is making a mistake to market a low end phone (which this is anymore in a world of smartphones) that requires users to already know enough to be able to guess how the phone operated without decent instructions, since anyone who can figure out the phone probably wants a smarter one.  However, for me with a little help, I like it.", "Date": "June 28, 2013"}, {"Title": "I like it. It has dual-sim and BLACKLIST!!! Yes, it's weird in some ways", "Author": "BTH", "ReviewID": "R3REVGBEICZ9T6", "Overall": "4.0", "Content": "I've had it for several months. It is true that there is no manual, but if you phone them, they are always helpful. The company has more of a following, I am told, in Latin America. But to get a dual-sim phone that has blacklist (I think you can only blacklist 20 numbers, but still, pricer phones often don't have this feature) is impressive.Some weird things: You can't set it to just simply lock after a call. You have to set it to lock after a certain amount of time, in my case, one minute. You will never ever be able to discern how to turn the ring to silent w/out calling them. I guarantee it.As for the Web, I don't use it to I don't know.The main icons are fixed, you can move to change them, which is silly. Some features can only be accessed by hitting a key, which pulls up a bizarre menu that looks like pop art.I purchased a memory card, inserted it and now I have I don't know how many gigs of memory.One VERY IMPORTANT thing: If you buy this phone, remember that it is unlocked, which is a good thing. But it does NOT have your carrier's  software on it, which it would if you bought it from them. So you have to phone your carrier and tell them the make and model number of the phone. They will text you w/instructions on how to install the software. It's just one click. If you don't do this, the phone will not work properly. I speak from experience.Simply put, this is a phone for people who want to talk and text (SMS or MMS). And I paid $30. And it's one of the tiniest phone out there. 4.02\"x2.28\"x0.33\".And do not even think of looking for a case. Blu makes none, which is nuts, because they could make more money selling cases than phones. At this writing, there are no skins or silicone cases out there. The best you can get is a pouch that fits lots of other phones. I really wanted the case to prevent damage. Surprisingly, the phone is VERY sturdy. I haven't dropped it a lot, but when I have I've always thought that, because of its low price point, it would disintegrate. It hasn't.Bottom line: While the Blu Tattoo S isn't smart, it requires smart owners to figure out just what it can do. If you're lazy or stupid, buy something else.", "Date": "January 29, 2014"}, {"Title": "total crap", "Author": "Honesty first", "ReviewID": "R2422RM7F614WI", "Overall": "1.0", "Content": "it was tiny like a childs toy like I said before the picture in the ad was deceptive .Who would I give it too?? maybe a 2 year old", "Date": "July 20, 2013"}], "ProductInfo": {"Price": "$89.99", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz", "Name": "BLU Tattoo S Q192x Gray QWERTY Unlocked GSM Dual SIM QuadBand Bar Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/51MRQz87XYL._SY300_.jpg", "ProductID": "B00CBYTIII"}}