{"Reviews": [{"Title": "Awesome phone!!!!", "Author": "Ryan", "ReviewID": "R1K2IG0K0GICYK", "Overall": "5.0", "Content": "This phone honestly had only one flaw and that was that it would get pretty warm. Other than that though it was a very good device to use, only problem was that Straight Talk data capped my so called \"unlimited data\" plan. Your better off going with verizon, 60 bucks for unlimited talk, text and 2 gb of data is plenty and a lot better service compared to straight talk", "Date": "September 10, 2013"}], "ProductInfo": {"Price": "$209.95", "Features": "Unlocked world GSM phone. 3G/4G - 850/2100, 2G -850/900/1800/1900. Compatible with AT&T; (4G), T-Mobile (2G), Straight Talk, Simple Mobile and other GSM networks. Please make sure your SIM card is not locked with PUK code.\n4G HSPA+ - 850/2100 bands. Fully compatible with AT&T;, Stright Talk(AT&T; Tower) & Net10 (AT&T; Tower) at 4G HSPA+. Compatilble with T-Mobile, Simple Mobile, Straight Talk(T-Mobile Tower) & Net10 (T-Mobile Tower) at 2G (EDGE). For Straight Talk, Simple Mobile or Net 10 will requires a manual APN setup.\nMTK6589 CPU - Quad-Core 1.2GHz. 1G RAM & 8G ROM (5G available internal storage). Newest Android 4.2.1 Jelly Bean.\nBeutiful large 5 inch HD IPS screen with 1280 x 720 resolution. 5 Point Capacitive Multi-Touch Screen.\nNo contract AT&T; $50 unlimited everything plan - I recommend getting AT&T; prepaid go phone plan for none smartphone with $50 unlimited everything plan. Get the AT&T; Go Phone SIM card from Walmart website or  just go to AT&T; store and (don't bring your phone) and tell them you have a old AT&T; Motorola razr that you can use and pay $50 and open account for $50 plan. They will give you a SIM card and phone number or transfer your phone number. After SIM card is activated just install that SIM card on your new phone and turn on data connection under SIM management and enjoy it. You can still surf internet on their 4G network. they will not find out what kind of phone you are using since it's unlocked and serial # never registered in their system.", "Name": "PAE920 Unlocked Android Phone 4.2.1 Jelly Bean 5 Inch HD IPS Screen MTK6589 Quad-Core 1.2GHz 1G RAM 8G ROM Dual SIM 4G HSPA+ Tether WiFi GPS AT&T Straight Talk T-Mobile Net10 - Shipping from California", "ImgURL": "http://ecx.images-amazon.com/images/I/515h9myvC7L._SX300_.jpg", "ProductID": "B00CTWKLE2"}}