{"Reviews": [{"Title": "Excellent phone!", "Author": "debmc", "ReviewID": "R11QVS5FIDG9UX", "Overall": "5.0", "Content": "I owned a PDA 10 years ago. Then the first gen iphone in 2007. Then I upgraded to the iphone 4 three years ago. This purchase was my first android smartphone and while I was a bit apprehensive since my android tablet crashes daily, I have been very pleased with this item. It is an excellent phone with so many extra functions that iPhones just cant do such as telling me the temperature and humidity in the room I am in and how many meters I currently am above sea level. It also counts my steps in a day as long as i have it in my pocket. Just an overall convenient tool for life in addition to all the typical smartphone functions like email, calendar, internet, ebooks, music, etc. The only feature it is missing is FM radio.Fast shipping and great product!", "Date": "August 10, 2013"}, {"Title": "Pleased", "Author": "Southern Lady", "ReviewID": "R2FMZIL61LRPGL", "Overall": "4.0", "Content": "I love the many features and capabilities of this mobile phone. It exceeds my expectations and needs of a phone. I was searching for a AT&T; (Unlocked) phone; received a T-Mobile (Unlocked) phone. Not particularly happy with this; but was still able to get the phone activated and am pleased with the performance.", "Date": "January 25, 2014"}, {"Title": "DREAM PHONE AT LAST!", "Author": "J. CABIRAC \"BOOK LOVER\"", "ReviewID": "R16SKQ1ZTSSF5J", "Overall": "5.0", "Content": "Love this phone it has everything and more!!!! I have all the apps I ever wanted and nice big screen it is really a cool phone!", "Date": "March 25, 2014"}, {"Title": "Camera not working!!! Common failure of the phone!", "Author": "Damian Scelato", "ReviewID": "R3L0FHSIYWA2XP", "Overall": "1.0", "Content": "I am from Argentina and I purchased the phone ins the US. I would have never expected the \"so called\" Samsung flagship to have a faulty camera. Accordign to what I checked online this has been a common ocurrence in many cellphones (s4) and even after following every advice I found online I was not able to fix the issue. It seems to be a hardware problem.Basically the camera does not work. Whenever I want to uses the camera the phone freezes and then it display an error message.  Only the front camera works.Maybe it was my fault for not checking it, but Samsung does not provide international warranty for the cell phones, though it advertise the S4 I9500 as an international version.So, imagine my dissapointment when someone ask me to take a picture and I have to say, sorry my brand new S4 does not have a working camera. jajaja it is shameful.I can now understand apple user who would never change their iphones.I have had a Galaxy S, an S2, an S3 and an S4. However,  I now know that my next phone will be an Iphone 5s (as soon as I can get one)!", "Date": "October 2, 2013"}, {"Title": "muy bueno", "Author": "eltyko", "ReviewID": "R57854QSXNNFP", "Overall": "5.0", "Content": "great care was expected immediate delivery good good model material fact in this comfortable well-defined colors etc etc etc etc.", "Date": "December 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00C56FL4C"}}