{"Reviews": [{"Title": "This'll do while Apple gets its act together", "Author": "Alfa", "ReviewID": "R3AZ3GTRVWHCH6", "Overall": "5.0", "Content": "A step up from the iPhone 5.W8 is a much better app launcher than IOS6. Better integration, better layout, far better typography. Just much nicer all round adn looks stronger and less east to damage. No need for aftermarket cases. No need for iTunes!!Been an iPhone fan since they first came out but IOS6 was a step backwards.Battery life needs watching and a few of the regaular apps like Trains have a bit of catching up to do. But apart from that, everything feels like as good or better than the iPhone.This will do very nicely.", "Date": "August 19, 2013"}, {"Title": "Great Uncomplicated OS - Jury is still out on the firmware", "Author": "Chris Lee Mullins", "ReviewID": "R5E0S5OLKZ6K6", "Overall": "3.0", "Content": "Bought this phone for my wife who was complaining about the complexity of the Android ecosystem. Really, she couldn't care less about multiple apps or widgets or rooting her phone. She just wants Facebook status updates, a decent Contacts app in a form factor that is somewhat smaller than the recent spate of monster-sized Android phones. (As an aside, personally, I use either a Galaxy Note 2 or a Galaxy S4, both rooted - she wants nothing to do with all that).This phone fit the bill perfectly. After a bit of a learning curve, she fell into a routine with this phone. Call quality is great. The keyboard is spot-on perfect for her smaller hands. She loves this phone.Well, she loves it when it works, anyway.Lately, this phone has been powering off at strange times. Sometimes it requires a soft reset to bring it back. Other times, simply plugging it into the charger is enough to bring it back to life. After a quick trip through the Googles, I'm finding that we're waiting for a specific over-the-air firmware update to resolve this problem.Thing is, that firmware update hasn't hit her phone yet. So...the waiting game.If your phone's OS is  8.0.10327.78, you are still waiting for the firmware update.Aside from this absolutely MAJOR issue with the phone's stability, its a wonderful flagship device for Windows Phone 8. Its really too bad that people don't give it a fair shake. Its not nearly as feature rich as a Droid, nor does it have as many apps as an iPhone. But there are just certain people out there who really...don't care about all that. They want the uncomplicated basics. Most of those people buy iPhones because family insists or have Androids foisted upon them by overeager Best Buy geeks. (nothing against the geeks - I am one)Those people should be looking at Windows Phone 8. And provided they get a phone that isn't firmware-broken right off the bat, I think they'll enjoy the experience.", "Date": "August 12, 2013"}, {"Title": "Great hardware, but Windows Phone needs improvement", "Author": "Parka", "ReviewID": "R29EDY2VNXXW0D", "Overall": "4.0", "Content": "Update: I've updated this review as of 7 April 2014 after an OS update.I was previously an Android phone user and recently decided to give the Lumia 925 a try.I don't have any complaints with the hardware as it's a really well made phone. I'm reasonably satisfied with the phone.My main issues are all related to Windows Phone OS and apps.Let me go through everything though.- Design -The phone is thin and looks really sleek.Fonts and pictures look sharp on the 768 x 1280 pixel resolution display. The display seems very close to the surface and it looks really good. Readability is good under the glaring sun.The screen is optimized for black background. When the screen is black, it blends with a black coloured phone nicely.Power button, unlike other phones, is located on the right side instead of the top, and accessible by the middle finger. You don't have to use the power button though because double tapping on the screen will wake the phone from sleep.Sound quality of the speakers is good.- Ease of use -Overall, it's a simple phone to use for calling and messaging.If your contacts are stored with Google, you'll be able to download them and store them in the phone.User interface is generally snappy. Applications open fast, and if they are slow it's because of the app design (i.e. Skype).- Camera -The camera is about 28mm wide, f2, 8MP with OIS. So it's a relatively capable for taking photos in low light. Looking at comparison photos online, the image quality seems as good or better than other brands, but as with camera phones, they all have that digital feel to them.There's a dedicated physical camera button at the bottom right side for launching the camera app and taking photos. Very convenient. You can also half-press that button to focus, and full press to shoot.If you're getting a case, get one that does not cover the camera button as you'll want to feel the half press.The issue with the camera is that it's quite slow to have the camera app launched and running. This is not a camera phone where you can shoot quickly whenever you see a picture moment, but there aren't a lot of camera phones that can do that anyway.- Apps -Availability of applications is the biggest issue to note when you're switching from other OS. Windows Phones has a smaller library compared to Android and iOS. If you need certain critical applications, you will want to research to see if there's an alternative here.For me, I just use Facebook, Twitter, Whatsapp, Skype and a couple of photography apps. For photography apps, definitely go and download Nokia Pro Cam which gives you all the manual functions to the camera.The inbuilt music player isn't terrific but works. If you've iTunes, you have to install the Nokia software to be able to import your playlists.Search is via the inbuilt Bing search button. There's a Google Seach app available.- File storage and transfers -I'm using the Lumia on a Mac. There are Nokia softwares for photos and document transfers.As far as copying (drag and dropping) a file from the desktop to phone via the USB cable, I still cannot find any good app for that. Come on, sometimes I just want to put a Photoshop file on the phone and work on it further at home, but I can't with this phone. With iOS, you can install the many file manager apps. With Android, it's plug and play. With Windows Phone, I've nothing to say. We all work with files so there really is no reason to not have such basic functionality.For files that the phone support, e.g. photos and video that the phone takes, you can install the Nokia Windows Phone software on your computer (I'm using Mac) and you can select the files to download or upload. It's a very simple software, I wished there are ways to create folders.- Email -You can set up Gmail with the phone. However, you won't get all the Gmail features like search, archive, etc. There's an unoffcial Gmail app available for download.Windows Phone syncs Gmail every 15 minutes, but syncs their Microsoft mail instantly. This could be an issue for those who use email a lot for work, and require close to instantaneous response.- Quirks -The status bar shows only the time. You have to tap it once to show battery life, internet and phone connection. There's no (aesthetic) reason why it should not show all the statuses.With most applications, if you scroll down too far, it's not easy to scroll back up. In other phones, you typically tap the top status bar to scroll up automatically.The most irritating thing of all is the phone is not smart enough to know the orientation of photos and videos taken. There are times when I take photos with the Nokia Pro Camera app in landscape mode, the photo when viewed (phone held vertically) is upside down. Sometimes, videos taken in landscape mode, when downloaded appear in vertical mode. There's no easy way to tell the orientation that is being recorded -- just because you're shooting in landscape does not mean you're recording in landscape. If there's a good reason not to buy this phone, it's this one.There also needs to be some way to show clearly (upload bar) whenever a photo or video is being uploaded to Microsoft Skydrive.All these quirks are usability quirks that can be fixed via firmware upgrades if there are any.Microsoft has already fixed quite a few quirks since the last time I wrote this review in September 2013.- Conclusion -As I've mentioned, the hardware is great but Windows Phones as an OS certainly has a lot of room for improvement. Minor tweaks really.If you're on a budget, I would suggest Google Nexus 4. I would have gone that route if that phone can be sold and shipped to my country Singapore. Personally, I prefer Android running on phones. There are some who say it's not as user-friendly, but hey, the learning curve is extremely gentle.Price is the real consideration. I've seen phones with rather similar specifications selling for less than half the price. The premium you pay for a brand oftentimes does not translate to a significantly smarter phone.I've been using the phone for a few months now. There are no terrible crashes. It's generally smooth sailing.Battery life could be better. How much time you can get out of the battery can be erratic. You'll have to charge daily that's for sure.Hardware - 5 out of 5 stars.Windows Phone OS - 4 out of 5 stars.", "Date": "September 3, 2013"}, {"Title": "Great all-around smartphone", "Author": "Yumi", "ReviewID": "RVY032D4M3X34", "Overall": "5.0", "Content": "Pros-Performance- The phone is snappy and quick no matter what I've thrown at it.Camera is amazing. Seriously. Please disregard marketing that focuses mainly on megapixel count. Everyone who sees pictures or videos taken with this phone comments on how impressed they are with the quality.Screen is perfect for this OS. I have my tiles on a black background and you cannot tell where the edge of the screen is because of the inky blacks.Nokia Apps set the phone apart. If you are considering a windows phone, you would be doing a disservice to yourself by buying something other than a Nokia. Nokia smart cam, job lens, creative studio, photbeamer are all examples of Nokia-made apps that I use frequently and are unique to Lumias.Cons- App selection. While Nokia has rallied to keep wp8 on pace, major apps are still coming to iPhone>android>>>maayyybe WP8. If you will not settle for a non official instagram, vine, or snapchat app you will be frustrated. 3rd party apps exist for all of the above though, so really you could stop whining IMO. The one MAJOR app that wp8 NEEDS to have would be square. WP8 is such a perfect business phone, and many of those businesses would like to be able to take payments....Myself included. I can't bring myself to take away a star for this though because thats not Nokias fault.", "Date": "August 13, 2013"}, {"Title": "Good product", "Author": "Josh B", "ReviewID": "RMMJFQX0JJCSJ", "Overall": "5.0", "Content": "Everything that I expected from the phone as described and priced very well.  Only feedback to the reseller is to offer more quicker options to ship. I needed this much sooner than it was shipped, but no options were offered.  other than that, good phone.", "Date": "August 1, 2013"}, {"Title": "Great Phone", "Author": "J. Glass", "ReviewID": "R3CYXTO966PB6", "Overall": "5.0", "Content": "Replaced my 920 with this phone; wanted to share my internet and the locked 920 wouldn't allow it.  I was able to share the connection with this phone with no problems.  Downloaded the Spanish keyboard just in case but didn't need it.The phone updated pretty quick with no problems, and I am quite happy with it.", "Date": "March 21, 2014"}, {"Title": "T-mobile version AWESOME 4G LTE", "Author": "Euro_Classy", "ReviewID": "R22JOSX22IUHV3", "Overall": "5.0", "Content": "Before I purchased I contacted the seller to make sure the version he sells is for US T-mobile and will enable 4G LTE. The box I got was a Tmobile box, it even included a microSIMcard. I have had it for a week now and I am getting 4g LTE speeds and everything seems to be working very well! I am so happy about my purchase from an Amazon seller, because the price was $200 less regular price for T-mobile customers. Just make sure you ask the seller directly which version it is - there are 3 versions of Lumia 925: RM-892 (international), RM-893 (US version for Tmobile and AT&T;), RM-910 (asia version with no 4G) (source: Wikipedia). I got the RM-893 and 4G LTE works great on T-Mobile.", "Date": "April 14, 2014"}, {"Title": "So glad to get rid of iphone", "Author": "games", "ReviewID": "R1NDG1GXNUNLV5", "Overall": "5.0", "Content": "Wonderful phone. Always been a nokia phone fan but they lost out with their OS. Windows 8 phone seems to have fixed the problem. It is smoother and easier to use especially for work that my i\"toy\"phone. I have not found a problem in the apps department at all why does it matter if iphone has 1000 flashlight apps and windows 8 only has 100? All the ones I need and used on the iphone I have found for windows 8phone and having office is extremely useful.", "Date": "March 7, 2014"}, {"Title": "Hard to put it away", "Author": "Ulrich Ehlert", "ReviewID": "R35JF7UM1NSVMW", "Overall": "5.0", "Content": "This is a spectacular piece of electronics. Everything flows nicely, looks great, is very intuitive.The camera is just great, the editing capability for the pictures hit the right line of not too complex but still powerful enough.All smart phone functionalities work great, office even better as in Android.Not too manz apps out there yet, and batterz run time should be longer.Still the best phone I have ever had (including an Iphone and several Android ones)", "Date": "February 5, 2014"}, {"Title": "excellent", "Author": "emmlemaudit", "ReviewID": "R2BUH0PZ8I30VE", "Overall": "5.0", "Content": "Excellent phone, Nokia and Microsoft did a great job for a good price.beautiful, well finished, quick. I Love it!", "Date": "January 16, 2014"}, {"Title": "Best Nokia", "Author": "Nsilu", "ReviewID": "RQEM8KVC62OHG", "Overall": "5.0", "Content": "Best Nokia in the market, and now with call and sms blocking features, this phone, makes any phone wish it didn't exist", "Date": "September 1, 2013"}, {"Title": "I'm a fan", "Author": "Justin Lancaster", "ReviewID": "R2FV6G2IFJWBV5", "Overall": "5.0", "Content": "Very fun OS as long as it is on WP8.1. I'm an IOS and Android power user that wanted to try something new. Needless to say, I'm impressed and will be sticking with this phone for a while. Hoping that the app situation improves but I've found that my addiction to Google services/apps can be broken on WP 8.1.", "Date": "April 17, 2014"}, {"Title": "Love this phone", "Author": "Yazzidawg \"Will\"", "ReviewID": "R2ESSYXX1V3PE8", "Overall": "4.0", "Content": "Gets 1 missing star because it has no memory card slot. SIM only. The camera is very nice and intelligent. The scrolling, page open / close controls are easy, and wifi and Bluetooth are great.", "Date": "April 10, 2014"}, {"Title": "FASTEST PHONE IVE EVER HAD", "Author": "Telvin", "ReviewID": "R1SX7AD9ASIIBN", "Overall": "5.0", "Content": "Never going back to Android...only con is battery life other this is a great phone needs more aps but has almost everything I need", "Date": "March 28, 2014"}, {"Title": "Windows Phone is good, but still needs improvement", "Author": "Charlie", "ReviewID": "R3AHYW8O96Q14H", "Overall": "4.0", "Content": "With Nokia 925 you will get a solid body with great build quality, but not the latest and greatest specs.WP 8 is a good mobile OS, but actually still needs a lot of improvement, specially when it comes to the quality and availability of apps. It looks like there are a lot of developers trying to put a lot of apps available, but with no consideration about quality and user experience. Just to give you an example, toast notifications are a privacy issue for a lot people (cannot be disable for system apps like SMS messaging), but it is in fact a parameter that can be control at programming level for a lot of other popular apps like Whatsapp and Line but it is still a missing feature. It does not have anything to do with the OS per se, but at the end it affects the overall user experience. I have read a lot of complaints about it and there are people that are actually willing to return their WP because of this, so it is important to consider.Another interest thing is that even though you are not getting the latest and greatest hardware, WP minimalist approach to user interface feels very fluid. It is not for everyone for sure, but I like it. Android will give you a lot of options to personalize your phone, but sometimes if you don't have great hardware specs, you will get lag and hurt user experience at the end. I believe that WP is not design for people who like to change and personalize their phones a lot, just to get something functional and minimalist.Do your own research and see if it matches what you expect from a smartphone. You will find good video reviews online that will help you with your decision. As far as I'm concerned, Nokia Lumia 925 is a solid phone, with a good OS, and expecting an OS upgrade in 2014 (WP 8.1) that will bring new features to get it closer to Android or iOS functionality.", "Date": "March 5, 2014"}, {"Title": "Amazing!", "Author": "Hector S.", "ReviewID": "RMYHI6KCH35LJ", "Overall": "5.0", "Content": "Even though Windows Phone 8 still has a lot of way to go, it's really a phone tan I can trust. It's stable, fast, fluid, and integrates all my Facebook, Outlook, Google and Twitter accounts. You have to go through the learning curve to squeeze out all it's potential. Regarding to the cell phone, I always have good signal reception, I only had to put my micro-SIM card inside (my company is Movistar, México) and automatically I was having 4G and my phone line back. It's a solid phone. The quality of the photos is amazing. I love it!", "Date": "January 18, 2014"}, {"Title": "Nice phone.", "Author": "c.wallace", "ReviewID": "R2JA80S6KWLFRF", "Overall": "4.0", "Content": "Love this new phone. The only problem I have come across is that I found out there is an updated for it but I can't get it to download.", "Date": "December 3, 2013"}, {"Title": "Great phone, great job by nokia", "Author": "R. Patel", "ReviewID": "R3I03D1HK9XHR9", "Overall": "5.0", "Content": "The switch to aluminium from what I thought was a gaudy and bulky poly carbonate plastic casing the 920 has is a huge step in the right direction. This phone is great all around. I am a big fan of windows phone so I am completely fine with the OS and its current standing with it's app limitations.The phone itself is great and the different suites of apps that nokia provides makes all the difference. I used to have the HTC 8x. That was also a great phone although the lumia 925 has the better features, better battery life, and camera quality. The only thing the HTC 8x outdid compared to the lumia 925 was sound quality via headset and/or speakers. Of course HTC has the upside of using Beats technology and built-in extra amps, but the difference in quality seems incredibly noticeable even after messing with the equalizer in settings.Overall though, great phone. I hope Microsoft continues to improve the lumia lines in the same matter as Nokia as done so far.", "Date": "October 8, 2013"}, {"Title": "The Phone is not unlocked!", "Author": "Rocky Macias", "ReviewID": "R1IND0VJ4129Y0", "Overall": "2.0", "Content": "I waited for so long to get this NOkia, but I can't use it, Because the phone is locked, even try to unlock with several cell phone web sites and still can't use my phone", "Date": "March 25, 2014"}, {"Title": "Fantastic Phone...", "Author": "Osias Pinheiro de Castro", "ReviewID": "RKLG2AUGWH4KH", "Overall": "5.0", "Content": "For the past 10 years I was a HTC crazy. I had a dozen. I do not regret the change! For the firat time I see a product that had not just tech put in it, but it was carefully crafted and also very well designed. It is not perfect yet! as technology has it limitations still.The Nokia Apps gives some edge to it, and i am in love with it... Can't stop exploring... Nokia has given WP a bit of more salt.If you are not yet a WP person, just try this beauty and you will see...", "Date": "October 29, 2013"}, {"Title": "Great phone", "Author": "Nick", "ReviewID": "R2DPWEXC9KH1SU", "Overall": "4.0", "Content": "Great Phone, but make sure you realize that this \"International version\" won't get 4GI'm loving the windows phone operating system. It's not as popular as IOS or Android, but it works great. I love that it syncs right up with MS Outlook and/or windows computers without having to go through some corky iTunes or Google program.I've tried many phones of all types, and this one has a beautiful screen, fast speeds, good reception, and sound quality, and it seems to be really durable.", "Date": "October 16, 2013"}, {"Title": "Maybe someone more tech savvy would like it.", "Author": "K.J.", "ReviewID": "RCX5SGBCPXLKX", "Overall": "1.0", "Content": "I can figure out a cell phone just fine but this is so feature heavy that it's confusing. I don't run a business from my phone, I'm not a photographer, and I don't need social media sites updating every time someone blinks. If you do, great, it's got a nice UI, ever updating live tiles, office apps, and three different cameras. It's just too convoluted for me.", "Date": "March 7, 2014"}, {"Title": "Do not buy this phone", "Author": "Ben Francis", "ReviewID": "R3RS3IFCW5EVIK", "Overall": "1.0", "Content": "Poor call quality with a speaker phone that isn't even usable due to the plastic sound that causes call to sound so muffled that you can't make anything out. Basic features such as orientation lock and programming call waits when dialing are missing. This is an incomplete poorly built phone at best.", "Date": "August 7, 2013"}], "ProductInfo": {"Price": "$339.00", "Features": "Microsoft Windows Phone 8\nQualcomm MSM8960 Snapdrago\nCPU \tDual-core 1.5 GHz Krait GPU \tAdreno 225", "Name": "Nokia Lumia 925 dark grey LTE", "ImgURL": "http://ecx.images-amazon.com/images/I/51khA8f8eLL._SY300_.jpg", "ProductID": "B00CS2ZWKQ"}}