{"Reviews": [{"Title": "Waste of time", "Author": "Don G", "ReviewID": "RU2CEDZ97HRW4", "Overall": "3.0", "Content": "*Battery life suckWhen you want to get into the phone it turns off on you or it takes a while to turn on. Other than that it is a good unique phone, it's just the phone turns off quick. I hate it when I am in an emergency situation.", "Date": "August 4, 2013"}, {"Title": "Excellent Features", "Author": "Katie Dargan", "ReviewID": "R33J6B9J0EFXD7", "Overall": "5.0", "Content": "Had trouble charging the Phablet, but, had excellent response time in getting a replacement in 2 days.  Very pleased with the unexpected 2 telephone lines and the attached cover to protect the front surface.  Those who saw the Phablet liked the cover also.  Excellent features for the low price.  I would recommend it for friends for business purposes and leisure.  The battery life could be a litter longer, but overall the item is excellent!!", "Date": "February 7, 2014"}, {"Title": "My views on the Phablet", "Author": "Andrew", "ReviewID": "R2AU5VU6TS46JI", "Overall": "3.0", "Content": "Hey Good Day:I am writing this review to say that overall this tablet isn't bad at all.The phone bit works here in Jamaica after all. Its very functional.There are some problems though:1) The camera is poor2) It tends to shut off at times3) When the battery is too low you can't just plug it in and use it you have to wait a few minutes.Outside of that its a good tablet.The battery power is't bad at all plus the features are good.I would recommend it.", "Date": "March 10, 2014"}, {"Title": "THE PHABLET", "Author": "19992020", "ReviewID": "R1DWFR7J3UGIW7", "Overall": "3.0", "Content": "Its working great I am accessing my data service efficiently.I have tried the phone but its not too clear without the hearset", "Date": "June 5, 2014"}, {"Title": "Amazing Phablet tool", "Author": "aima", "ReviewID": "RYIRYKRBHR6BA", "Overall": "4.0", "Content": "The device does so many lovely things, but the battery runs down so quickly and the picture quality is not very clear. It's however OK", "Date": "June 4, 2014"}, {"Title": "Phablet (tablet + cell phone)", "Author": "Wabing Mileng", "ReviewID": "R2APJ8NI6HKMBK", "Overall": "4.0", "Content": "The item I bought has imporved my requirement for carrying two things at the same time, a cell phone and tablet.Instead of going around with two items, I only have to take my phablet which does both jobs.", "Date": "May 11, 2014"}, {"Title": "No GPS! Battery Hog.", "Author": "Paula A Anderson", "ReviewID": "R1U4Q9WC4HWVRL", "Overall": "3.0", "Content": "I like it, but there are a couple issues.It is advertised as having a GPS -- it does not.  It may have google navigation, but it does not have an internal GPS.I wanted the 7in form factor, which combines two devices (tablet and phone).  This idea is fine for me, I understand not everyone would like this form factor.So with that in mind, I expected to use bluetooth connections for the phone.The difficulty comes in that it does not stay connected to the bluetooth device.  I had to get an app BlueTooth KeepAlive and configure it so that it can maintain a connection.When using this configuration -- the battery is used very quickly -- in just a few hours.Also, if I walk out of range (or turn off the car briefly) the bluetooth connection is lost.  In order to reestablish the connection I must re-awaken the phablet with the screen swipe.Without the bluetooth connections, the battery is ok, 48 hours or so.As a comparison ... with my previous cell phone, it would automatically recognize the bluetooth device when I got in the car, I did not have to 'wake it up' after turning the car on each time.  (Car has integrated blue tooth)", "Date": "May 2, 2014"}, {"Title": "phablet a flop", "Author": "mistery lee", "ReviewID": "R3SCFJ7A9LX4Y1", "Overall": "1.0", "Content": "When I received the tablet it was a problem charging it and the piece was broke and within a week the inside piece where u charge it fell down into the phone..couldn't charge the phone anymore ..sent it back", "Date": "March 21, 2014"}, {"Title": "Fantastic product.", "Author": "Gayle", "ReviewID": "R3KO2YSERC8J3U", "Overall": "5.0", "Content": "Bought two of these to send to Panama and they work great.  It was key that the tablet was unlocked and it could support GSM that is used there. Plus is that it is a phone and a tablet since they don't always have WIFI in certain areas.", "Date": "March 13, 2014"}, {"Title": "not for everyone", "Author": "Justin L.", "ReviewID": "R1FFR13I569HWB", "Overall": "2.0", "Content": "All carriers in Galveston refused or said the product was not compatible with their services  it could have been this one unit. The Co  swears everyone is adaptable to it, but not in this case. Would have saved me $$$$ if someone could have got me on their service.", "Date": "June 1, 2014"}, {"Title": "Product Details", "Author": "Flower", "ReviewID": "RWAMJAGOEEMSC", "Overall": "3.0", "Content": "7-inch Phablet Smart Phone + Tablet PC Android 4.0 Bluetooth GPS WiFi Unlocked!It DOES NOT include a bluetooth or GPS or Wi-Fi accesories.It IS NOT advertised as such.If you understand common sense, you'll understand that the title is describing the capabilities and features.", "Date": "May 25, 2014"}, {"Title": "7 in phabet", "Author": "Susan B. Krohn", "ReviewID": "RM864RD3V94BT", "Overall": "2.0", "Content": "the idea is great, the execution...not so much.  Wanted so much for this to work, but it just takes FOREVER to load...every time you try to change screens and the free bluetooth, not worth it.  Sent them both back, just waiting for my refund", "Date": "May 24, 2014"}, {"Title": "Got  it quickly mixed emotions", "Author": "Rev. John Timothy Owens \"Tim\"", "ReviewID": "RTQNMPF8FWRPQ", "Overall": "3.0", "Content": "The Phablet was shipped very quickly.  The screen is pretty good.  Plays movies well.  The instruction book did not really help.  I found the charge usually lasted just a few hours.  Internet was adequate at best.If you need internet I suggest other brands would be better.This is okay for kids but not so great for adultsI got what I paid for.", "Date": "May 12, 2014"}], "ProductInfo": {"Price": "$103.99", "Features": "7.0 inches Android 4.0 Tablet PC Smart Pad + Phone (Call as mobile phone) with Google Play Store and Capacitive Touch Screen\nAllwinner A13 Cortex-A8 Processor 1.5GHz CPU, 4GB Internal Memory, WiFi Capability, Bluetooth, Dual-Camera and more.\nMake and receive calls directly from the tablet itself with the built-in MIC and speaker\nWiFi 802.11 b/g/n Support - Connect to internet for A full Internet experience | Bluetooth enabled - connect to any bluetooth headset handsfree\nSupport Google Play Store - access to millions of free and paid-for applications available to download straight to your phablet.", "Name": "7-inch Phablet Smart Phone + Tablet PC Android 4.0 Bluetooth GPS WiFi Unlocked!", "ImgURL": "http://ecx.images-amazon.com/images/I/516h3VhAUrL._SY300_.jpg", "ProductID": "B00CY9EG3C"}}