{"Reviews": [{"Title": "The Nokia Lumia 520 is an awesome phone but make sure you get the right one.", "Author": "Derek B. Norton", "ReviewID": "R2WFU8WIRDACYO", "Overall": "5.0", "Content": "My wife and I bought the international version because it said that it was unlocked. We thought that meant it was the right one to get if you want to use straight talk for your cell phone service in the US. It does work but you can only get GSM or EDGE cellular service NOT 3G or 4G. So if you are in the US and you want to use a Nokia Lumia 520 with the straight talk plan get the Nokia Lumia 520 GoPhone (AT&T;) which is also sold here on Amazon.com. That one will let you use the 3G and 4G service that straight talk has. With that phone we are now able to get 4G and it is way better than being stuck with only EDGE service.", "Date": "December 21, 2013"}, {"Title": "excellent phone", "Author": "Mark", "ReviewID": "R3APS7HGIZS25V", "Overall": "5.0", "Content": "This is the best phone I have ever had. The Microsoft store is limited, but other than that it is awesome. Buy an SD card. With it as it is limited on storage.", "Date": "September 23, 2013"}, {"Title": "It suppose to be international version and Factory UNLOCKED!!!!", "Author": "Ken", "ReviewID": "R2FBFML3YKT3K8", "Overall": "4.0", "Content": "I bought this phone for use in Jamaica, it suppose to be international version and factory unlocked. the phone is partial unlocked, I can put my Digicel sim in the phone and it work for most features. but the ONE and only that I care is not working! INTERNET SHARING. I can't turn it on. It say I should goto ATT.com or call 611 to enable this device for tethering. I don't have account with ATT&T;, how the hel* I goto att&t; to change the setting? This is suppose to be international version FACTORY UNLOCKED. for God sake.What Am I going to do now?Update: Got it work using the instruction from the seller. I give it 4 star rating.", "Date": "February 8, 2014"}, {"Title": "Awesome smartphone for people on a budget", "Author": "Burak Yigit Kaya", "ReviewID": "R2ALSXAY2UEXSI", "Overall": "5.0", "Content": "My brother, an ex-Android fan had to switch to this due to its low price and boy he was satisfied. Even as a tech-savvy and advanced user he expressed his delight with the phone a lot. It still lacks a few important things that I will list but at this price range, I think it is unbeatable. -1 stars if you don't care about the price.A few things I wish were different:  1. Slightly better build quality. The plastic cover feels good but I still expected something a bit more sturdy.  2. Windows Phone 8 is GREAT. Yes I'm serious but it can definitely use more apps  3. The new IE on WP8 is great too, but I'd like to be able to use Firefox or Chrome too occasionally.  4. 8 GB storage is not much, especially almost half of it is used by the system. I mean this is probably related to the low price and since it has an SD card slot not a very big deal.", "Date": "November 20, 2013"}, {"Title": "Great phone", "Author": "Rodney G. Watson", "ReviewID": "R2FQHXXOLFBA0N", "Overall": "5.0", "Content": "I love this phone.  It is speedy and does everything most people need.  Don't be fooled by the 8 GB storage space.  It is plenty and especially with the ability to add up to a 64 GB chip in it then who needs more.", "Date": "January 7, 2014"}, {"Title": "Awesome phone with all the features intact with low  price tag", "Author": "Rudra", "ReviewID": "R3GDO6V6XZG8YS", "Overall": "4.0", "Content": "Value for money...I am using this phone for past 2 months,I could not find any problem.You can bet on it.", "Date": "March 31, 2014"}, {"Title": "so far so good", "Author": "Leah Dimmott", "ReviewID": "R2CJNE2TL0BAOA", "Overall": "4.0", "Content": "So far so good! My nokia lumia is working fine...I am still getting to know it. I never owned a windows phone before. My only issue is that I dont think it has a front camera :(", "Date": "March 17, 2014"}, {"Title": "AWESOME", "Author": "Al Parras", "ReviewID": "R2H6J9JB6DWKZ6", "Overall": "5.0", "Content": "different from iphone ios and android based...live tiles cool...apps more user friendly and graphics on the game are cool responds better than iphones.", "Date": "June 5, 2014"}, {"Title": "Nice Phone but glass design poor", "Author": "Eric Sell", "ReviewID": "R2IW4OFVLUHCZ8", "Overall": "3.0", "Content": "The phone is nice and worked great but when opening the back (be careful), the glass covershattered and made the phone useless.  I have had many phones but never had the glass cracklike this phone....bad design.", "Date": "May 25, 2014"}, {"Title": "Good low cost phone", "Author": "Venkatesh", "ReviewID": "R8UCQK5AJI7YC", "Overall": "4.0", "Content": "Value for money. But windows phone is not working for me so mostly will go for kids for games. Cheers!!", "Date": "May 8, 2014"}, {"Title": "Plenty of power, good price, bad camera....", "Author": "PR", "ReviewID": "R30L0368942KIU", "Overall": "3.0", "Content": "This is a great phone if you need something cheap but loaded with features. Here are the things I like:PROS:1. It's fast and fluid. It just works.2. It's cheap! Can't beat the price3. The screen is nice and the feel of the phone is great.4. It has an offline GPS mode (but there is a slight problem with this...see CONS section)CONS:1. The GPS is only free for local use. If you try using the offline free GPS in another country it will ask you to pay for a licensing fee. That's what happened to me when crossing back and forth from Canada and the USA.2. There is no led light or camera flash on this device. Makes it useless to shoot pictures with at night.3. The keyboard is CRAP! It is seriously terrible... I find that many users like myself end up hitting the comma button repeatedly instead of the space bar. I swear I'm pressing the space bar, but the comma always registers. Also the accuracy of the keyboard is terrible. It makes for an unpleasant experience at times..... I'm not the only one with this issue, as several of my friends have the same problem.Conclusion:Overall, although there are many shortcomings with this phone, it is still good considering the price. I don't think you'd be disappointed with it considering what you get for for the price. But, don't expect perfection, as this phone does fall short in many aspects.", "Date": "May 7, 2014"}, {"Title": "Excellent", "Author": "ydac \"ydac\"", "ReviewID": "R30M8IVSGFKXMA", "Overall": "5.0", "Content": "Excellent I loved and liked the phone a lot, I got the color that pedi. It gives me the lightest smartphone I practice, especially how easy it is to manipulate all functions. The perfect camera, the photos can accommodate without much computer knowledge, especially for someone who does not know much of these electronic devices. I highly recommend it, I wish to send me the lining of the camera but then do not buy it. Buying this camera and will not regret.", "Date": "April 17, 2014"}, {"Title": "Very Good the Product", "Author": "Jonhny Solorzano", "ReviewID": "R1RDRGLB8HNZ9C", "Overall": "4.0", "Content": "I think they are responsible with what they provide.I like the quality of the product and would recommend it to people who buy it.", "Date": "March 4, 2014"}, {"Title": "Super phone for this low price", "Author": "Givi Bagdavadze", "ReviewID": "R2PN7Q19JXQIUC", "Overall": "5.0", "Content": "This phone exceeded my expectations. I never imagined such an amazing phone for this low price. It is fast and with a very good software. Delivery was also relatively fast.", "Date": "February 20, 2014"}, {"Title": "fantastic choose", "Author": "Mustafa Mohammed Alfardan", "ReviewID": "R3Q2HBKLWHVCYI", "Overall": "5.0", "Content": "Unlock lumia 520 so different more than what we have in my country and supply many languages with windows 8. Excellent phone", "Date": "February 7, 2014"}, {"Title": "Good", "Author": "risbo", "ReviewID": "R3Y6RA6AI9NKC", "Overall": "4.0", "Content": "The smartphone good as i expected.  It is a good deal between the price and the quality. It a good present.", "Date": "April 5, 2014"}, {"Title": "hi", "Author": "Pierre R Nagha", "ReviewID": "R1SMUY7YXG2SLA", "Overall": "4.0", "Content": "Does the seller has a phone number for questions about the product in case the item is defective or not as describes", "Date": "March 25, 2014"}, {"Title": "Refurbished Phone.", "Author": "alevp45", "ReviewID": "R2EJ5VE04DLDOV", "Overall": "1.0", "Content": "This phone does not seem to be a new phone, a refurbished phone, plus battery discharges very fast. I had to buy another, this did not fulfill my expectations.", "Date": "March 12, 2014"}, {"Title": "Awsome", "Author": "nekatibeb hailu", "ReviewID": "R3UFHY3PT7VBU9", "Overall": "4.0", "Content": "I bought for my brother in Africa, he just text me today for appreciate and also liked it specially the phone size, futures. It's really awesome phone.", "Date": "February 9, 2014"}, {"Title": "bad phone", "Author": "mayada", "ReviewID": "R1CVQBW7083D1X", "Overall": "1.0", "Content": "I bought it as a gift to my sister and unfortunately i sent it to Egypt so i can't return it. the phone performance is very slow and bad. it's a nightmare don't buy it", "Date": "February 18, 2014"}], "ProductInfo": {"Price": "$134.99", "Features": "Dimensions - 119.9 x 64 x 9.9 mm, 75.7 cc (4.72 x 2.52 x 0.39 in) Weight 124 g (4.37 oz)\nIPS LCD capacitive touchscreen, 16M colors\n480 x 800 pixels, 4.0 inches (~233 ppi pixel density)\n8 GB, 512 MB RAM\nOS - Microsoft Windows Phone 8", "Name": "Nokia Lumia 520 8GB Unlocked GSM Windows 8 OS Cell Phone - Yellow", "ImgURL": "http://ecx.images-amazon.com/images/I/41Z4hRCngKL._SY300_.jpg", "ProductID": "B00CKUH92A"}}