{"Reviews": [{"Title": "xperia sp", "Author": "I <3 Sony", "ReviewID": "RM2EQZB3EF6UR", "Overall": "5.0", "Content": "Packaging and equipmentThe sales package, as well as user manuals quickly, contains a battery charger with USB port and a USB data cable / microUSB and a pair of stereo headphones of good quality.ErgonomicsThe dimensions of Sony Xperia SP are of 130.6 x 67.1 x 10 mm for 157 grams of weight. Excellent ergonomics and very beautiful aesthetic lines of this device whose design is characterized by a plexiglass bar that acts as a status LED that lights up in different colors.UsabilityXperia SP is equipped with a processor Qualcomm Snapdragon MSM8960T dual core Krait from 1.7GHz, Adreno 320 GPU and 1GB of RAM memory that allow the system to be always fluid. The onboard memory is 8GB, of which 5.37GB available to the user, expandable via microUSB.MultimediaThe quality of photos taken with the 8 megapixel camera Xperia SP is generally good, not great, in any condition. Discrete, however, the video may have a maximum resolution Full HD at 30fps with autofocus. Very nice media gallery that can be enlarged or reduced by pinch. By viewing the photos, the LED bar will light up with the dominant color of the display. The video player has allowed us to play all our classic test files, including DivX, MKV and the Full HD. The audio player, the classic Walkman allows you to manage playlists, play music via DLNA and integrates \"social.\" Present an equalizer and different systems of sound improvements. Playing music through the speaker, whose sound is strong and clean, it is possible to illuminate rhythmically RGB LED and the color will be \"colored\" with the album cover chosen.OVERALL RATINGSP Sony Xperia Mobile smartphone is a very balanced from every point of view. Excellent is the battery life of the phone part. Nice design. Only the display is slightly below par with regard to the visibility in direct sunlight and for blacks not well defined.", "Date": "June 11, 2013"}, {"Title": "sony xperia sp a evolution of sony xperia s to me.", "Author": "hectorvnzla", "ReviewID": "R9461J3BED0M4", "Overall": "5.0", "Content": "Sony Xperia Sp C5303 White (Factory Unlocked) 4.6\" Hd,8 Mp, 1.7ghz Dual Core S4 Fast Shipping All the World By Fedex\"Excellent phone was a gift for my sister , just had to turn to update the latest firmware and ready for use. the phone came in excellent condition as it indicates the seller completely new . this is the second time I buy from this seller FGS Trading the 1st time was a Sony xperia S LT26i even keep it, and I recommend this seller for his impeccable delivery time and quality in what sells. of the phone I can say it is a hardware evolution of the sony xperia s lt26i , has better processor and graphics, but the camera is 8mp compared to the 12mp sony lt26i xperia s , but has the help of a sensor Exmor RS , so the sony xperia sp takes a very good photographs . in section multitasking is excellent as well in the graphics thanks to its 1.7GHz dual core processor and Adreno 320 if they like a phone that meets the daily needs and has excellent battery life and does not have a high price I recommend you buy it. greetings from Venezuela and remind them that even #HAYUNCAMINO \"", "Date": "October 19, 2013"}, {"Title": "Amazing device", "Author": "Alexander", "ReviewID": "R3OWD2DFJOQFRA", "Overall": "5.0", "Content": "This phone is an amazing device, I sold my Xperia J and got this about 5 month's ago, I think it's a great product, Works really efficient, Fast, Sleek, And really responsive, I hope they bring out the KITKAT update for the OS, but overall this phone is a great buy, Camera works just great, I love all the features it have to offer, The system it self is smooth and really iconic design to the body, The back cover however has a bit of a problem it tends to pick up smudges and gets stained easily so I recommend a casing, It supports a lot of games and run them smoothly, I still play NFS Most Wanted and it works great, Phone overall experience is amazing I love how the NFC can be able to just touch and go.I think the phone is a great buy, Originally I wanted the Z1 but didn't have enough cash, So if you have a budget then this is the perfect phone if not, Get the Xperia Z1.", "Date": "November 13, 2013"}, {"Title": "am digging it", "Author": "Kevon", "ReviewID": "R1UZHCRO8YW3WS", "Overall": "5.0", "Content": "Am really digging this phone, first Android I've own and I've like it thus far. If.Microsoft doesn't continue with Nokia phones I'll just buy more Sony,.that.z2 looks so seductive", "Date": "June 2, 2014"}, {"Title": "Light pulses problem", "Author": "Yunus", "ReviewID": "R2WRBPC69ZHDJ7", "Overall": "1.0", "Content": "I have no problem with my phone it is really good and operates very well. However  I have light pulses problem and how I can fix it, it really drive me crazy,", "Date": "June 1, 2014"}, {"Title": "first Smartphone for us so I can not compare.", "Author": "JENN", "ReviewID": "R3P3M4LV791E3O", "Overall": "4.0", "Content": "But, the battery is for 3 & 4 hours max  with phone calls about 4min each.  !!!!!The zoom is too sensible and the front camera is I think cheap quality.The large screen is great for internet and the sound is good.", "Date": "May 11, 2014"}, {"Title": "slow Data", "Author": "Sena  R.  kouedjin", "ReviewID": "R2OMNBFY7FHENG", "Overall": "3.0", "Content": "slow data even at 4G lite, need update to Android 4.4 kitkat I wish I can exchange it with different phone.", "Date": "April 20, 2014"}, {"Title": "My opinion", "Author": "Lourdes Sempertegui", "ReviewID": "R3U3JHDFAMWQEG", "Overall": "4.0", "Content": "It's a excellent Smartphone for me and I received it in perfect condition and right on time. I recommend this product.", "Date": "April 7, 2014"}, {"Title": "My Lovely Phone", "Author": "Amazon Fan", "ReviewID": "R9JXTTH85CDBE", "Overall": "5.0", "Content": "I have bought this phone for a month.It is the best phone I have ever used.It works great.Its performance is fabulous.The best things I love in this phone- the appearance- the battery life- its materials- the camera- the screen resolution.", "Date": "March 17, 2014"}, {"Title": "Good phone", "Author": "Yunga", "ReviewID": "RSU8QD4MYD9ZP", "Overall": "4.0", "Content": "The phone is great just that the back camera is not the best for videos but good for photos and the front camera is not as good as the back camera too. It's also a lil heavy. But I'll recommend it to a friend. It's a nice phone", "Date": "February 18, 2014"}, {"Title": "Super Device", "Author": "kollis86", "ReviewID": "R3OFD4JY252R78", "Overall": "5.0", "Content": "Item is made of excellent material, what would you expect, its sony! buyers do make sure to purchase a case for this phone as cleanliness of the white colour you would love to see throughout your usage.", "Date": "January 24, 2014"}, {"Title": "Wonderful Device!", "Author": "Alejandro Renderos", "ReviewID": "R697JQ2PKT62N", "Overall": "5.0", "Content": "Big Screen, 1080p video recording, powered by playstation network, 1.7Ghz Dual-Core, Amazing sound and Jelly Bean, my best inversion in years!", "Date": "September 16, 2013"}, {"Title": "Good, but didn't live up to my expectations", "Author": "Roxanna Calvo", "ReviewID": "R2RIAZYC73HUVY", "Overall": "3.0", "Content": "Over all the phone was a great purchase. Was easy to connect to t-mobile. Signal is good, haven't had any problems so far. Internet runs above average speed. Look of it is sleek, fits pocket perfectly, also has very nice lighting effects for notifications and themes. The graphics on the screen could be better. Not super HD like I expected.Now the only issue I have with this phone is the front camera. Taking regular photos with the back camera come out great and clear. But the front camera to take a \"selfie\" for example is complete crap. Blurry and very foggy look in pictures and video chat. Also the flash is horrible. It makes all your pictures come out with a red tint to them.", "Date": "May 19, 2014"}, {"Title": "Bad", "Author": "Maria Urriola", "ReviewID": "R2U88VLLDH3ZE1", "Overall": "1.0", "Content": "Sony Xperia SP Pedi and I delivered a Sony Xperia J and this team is of lower quality than desired, I thought it was not going to have problems with this purchase", "Date": "February 15, 2014"}], "ProductInfo": {"Price": "$244.88", "Features": "3G HSDPA 850 / 900 / 2100 MHz, LTE 800 / 850 / 900 / 1800 / 2100 / 2600 MHz .\nOne-touch functions from Sony.\nEnhanced battery life with Battery STAMINA Mode, Up to 19 hours talktime.\nStunning shots in any light &mdash; 8 MP camera with Exmor RS for mobile.\nTrue Screen intelligence - Mobile BRAVIA.", "Name": "Sony Xperia SP C5303 Smartphone - White (Factory Unlocked), 1.7GHz Dual Core CPU, 4.6\" HD Screen, 8 MP Dual Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41vo9QjKp4L._SX300_.jpg", "ProductID": "B00C57NRLU"}}