{"Reviews": [{"Title": "Nice Phone but", "Author": "K", "ReviewID": "R1UKAWTBBWVDQO", "Overall": "3.0", "Content": "I will start off by saying the phone is not 3G  and will only work at 2G... The phone is built with good quality.. I had the Phone  for two weeks before I returned it. It wasn't due to the quality but because it was not 3G as advertised. Comes with the standard apps and not much internal memory. The good thing is that you can install apps to the SD card, two batteries and a soft case. The back cover is very very hard to take off.The instructions was a lot to be desired. Android 2.39, wi-fi, bluetooth paired with ease. The APN went with the defaults according to your sim,both sim slot worked, you have to update your APN with your carrier settings to get the MMS to work and that's pretty much a given with unlocked phones. I had no problems  or issues after updating APN. The internet  is only edge.. The camera takes good pictures and videos. You do not have GPS it that is important to you. The description has been updated since I purchased the phone  to reflect the proper specs. The speaker is OK, the feel is nice without the cover and it has a 4\" screen. If your looking for a good phone without a lot of extras this will work. The battery is like any Android you can get a good work day use out of it, I didn't find ebooks or games on mine , standard email setup,, I did not use the earphones so I can not comment on the radio. the music player good, It did support my 16GB SD card. I would of kept if it had 3G and GPS. Once Cubot releases GT99(3G) I will give them another try. It appears that none of Cubot phones have GPS. Here's the website www.cubot.net", "Date": "June 29, 2013"}, {"Title": "Great Buy But", "Author": "Deionzell JM Jackson", "ReviewID": "R38W0EBQH1QLP", "Overall": "5.0", "Content": "This Is A great buy for anyone the phone is practically flawless for the low price of $80 but their is one kink that i notice.. \"the camera\" i take a lot of photos with different application and the camera seems to make everything a tade darker but still its a great buy.", "Date": "November 19, 2013"}, {"Title": "disappointed on arrival..", "Author": "Merlicka Glasgow", "ReviewID": "RQIF45F16TLAJ", "Overall": "3.0", "Content": "Very disappointed. i was really excited to receive my cubot c9. Got home, unboxed it and tried to switch it on to no avail. I changed the batteries and still ...ABSOLUTELY NOTHING. i ordered this phone on one day shipping because i needed an emergency phone, I didnt fuss about the specs too much but to deal with it not even switching on. THATS UNACCEPTABLE. so I just placed it on charge till morning to see if it makes a difference, If not I will be shipping It right backThe phone itself Isnt a bad phone. Just guess the seller was.", "Date": "December 27, 2013"}], "ProductInfo": {"Price": "$399.99", "Features": "High performance 1GHz processor Android 2.3.6 operating system to download apps Conveniently transfers data via Bluetooth Supports Wi-Fi, G-sensor and FM radio Supports an external TF card up to 16GB(TF card not included)", "Name": "Cubot C9 - 4.0\" capacitive touchscreen Android 2.3 OS 1.0GHz Smartphone dual SIM with Bluetooth Wi-Fi black with white base", "ImgURL": "http://ecx.images-amazon.com/images/I/51-PKTF1YvL._SY300_.jpg", "ProductID": "B00CS253IC"}}