{"Reviews": [{"Title": "Great phone", "Author": "Pasky", "ReviewID": "RCRMUHQASP0K9", "Overall": "5.0", "Content": "Bought this phone for a friend and she loves it very much,, The pattern is unique and looks much better than the plain white..Only one setback though, it did not come with an English manual and the phone itself was not in English when turned on... I got through however and so far no other problems......", "Date": "July 9, 2013"}, {"Title": "great fancy cellphone", "Author": "E.Malo", "ReviewID": "R92VVT4B6HTEQ", "Overall": "4.0", "Content": "I recommend this cellphone for his quality and color, compare to other brands on the market! But the only limitation it's the features languagues it has english but it doen't has spanish!!!", "Date": "July 18, 2013"}, {"Title": "Bought this for my wife and she likes it.", "Author": "A. Gupta", "ReviewID": "R1XMQQQZY1WP49", "Overall": "4.0", "Content": "I bought this for my wife and overall she likes it.I'm a phone junkie.  Having the Nokia 5800, IPhone, S2, S3, S4 and mega.Pro:  Very compact, full android features, very similar to S3 in terms of features.  Much better battery life than S3.  Standard micro USB chargerCons:  The backing is plastic and very light similar to all Samsung phones, it was disappointing for a customized flower back plate.", "Date": "January 12, 2014"}, {"Title": "VERY GOOD TOY!!!!!!!", "Author": "Nestor Hernandez R.", "ReviewID": "R1Y2510FYF8D62", "Overall": "5.0", "Content": "VERY GOOD TOYGOOD PHONE GIFT!! ! EXCLUSIVE AND VERY CUTE DESIGN.RECOMMEND IF YOU WANT SOMETHING DIFFERENT THAN WHAT YOU NORMALLY SEEN ON THE MARKET", "Date": "January 12, 2014"}, {"Title": "Great phone", "Author": "Mike Gillespie", "ReviewID": "R113PE6ADJXM5Y", "Overall": "4.0", "Content": "very happy with it. Looked at several different kinds. This is my first smartphone. Great apps. Good size to handle.", "Date": "January 9, 2014"}, {"Title": "Samsung is the best I 'm happy with it", "Author": "María Belén", "ReviewID": "RT7S760962NE2", "Overall": "5.0", "Content": "The sammsuny galaxy is awsome!, its has a beautiful designer and its easy for understand. Its a best for you", "Date": "December 31, 2013"}, {"Title": "Fabulous phone!", "Author": "Lilia", "ReviewID": "R1TZK3FJ7N7X34", "Overall": "5.0", "Content": "This smartphone is amazing. The best buy I've ever made in Amazon. Plus to its capability as a S3 smartphone, it has these beautiful flowers that make it so cute. Besides it's fancy and very feminine, also has a very quick processor and works perfectly in Venezuela. The only thing I'd change is that its OS doesn't has Spanish as a configurable language. I tried to install the Morelocale tool in order to set the phone in Spanish and it did work, but the language just wasn't well translated, so the best option was leaving it in English. Anyway, I still love it and recommend it for sure.", "Date": "December 1, 2013"}, {"Title": "Great!", "Author": "Sam", "ReviewID": "R3B9HN77NOQNS5", "Overall": "5.0", "Content": "This is a great phone!! I enjoy it very much and it is cheap, most samsung are very expensive! I love the floral design!!", "Date": "December 1, 2013"}, {"Title": "Gorgeous", "Author": "Nahomi87", "ReviewID": "R3C6NDEDX20MQJ", "Overall": "5.0", "Content": "The cellphone arrived in time and in perfect conditions, I love the flowers detail. I live in Venezuela and it works perfectly with movilnet", "Date": "November 12, 2013"}, {"Title": "Great phone, but it hasn't NFC technology", "Author": "E. E. Y. Reyes \"EY\"", "ReviewID": "RFY3KPQMUZCQX", "Overall": "3.0", "Content": "I'm pretty disappointed with this, in the description indicates that this product has NFC technology and it's not true, but it's a great smarthpone", "Date": "November 6, 2013"}, {"Title": "Works in Barbados with Lime Network", "Author": "CaribbeanChic", "ReviewID": "R10PLFY92QP05A", "Overall": "5.0", "Content": "Neat cute phone to have, very addictive. android os, nice sleek. endless apps and you dont have to worry about getting the sim card cut to micro to fit it.", "Date": "November 5, 2013"}, {"Title": "Very good", "Author": "veruska parejo", "ReviewID": "R3UMWJ3DNY4WIE", "Overall": "5.0", "Content": "Good phone, at first I thought that the Spanish language menu but would not last if you could achieve, is tops!", "Date": "October 27, 2013"}, {"Title": "Not fill my expectations", "Author": "Yngrid Vega", "ReviewID": "R2I2MOH8ODS0Y7", "Overall": "2.0", "Content": "The reference image is different from the actual product, the detail of the flowers on the back cover does not bring, is all white. I expected the product as referred to.", "Date": "September 24, 2013"}, {"Title": "love it", "Author": "Marcia Iwaki", "ReviewID": "R3IFWHURPPH2CL", "Overall": "5.0", "Content": "The product was perfect. Love the flowers design and the color. Confortable and fast. Really good. Totally recommended. Love it", "Date": "September 5, 2013"}, {"Title": "Good", "Author": "Kerri- A.", "ReviewID": "R11A1IB0XPAU1Y", "Overall": "3.0", "Content": "Product was what I ordered. Battery life aint the best at all. But overall, just glad it works and it arrived on time", "Date": "September 3, 2013"}, {"Title": "perfect version", "Author": "Rober H", "ReviewID": "R2RXK2Q9ONLGRA", "Overall": "4.0", "Content": "I love it. pretty handy. beautifull and useful software. I wish it could had a spanish version of the sw", "Date": "September 2, 2013"}, {"Title": "bought it as a present", "Author": "PPSS", "ReviewID": "R2SYRF7FD7DHRL", "Overall": "4.0", "Content": "gave this to my niece and she loves it!!! needs Mini SD card so remember to buy one at least 16GB", "Date": "August 31, 2013"}, {"Title": "I love this phone", "Author": "Chopper1 \"end user\"", "ReviewID": "R1BTCRD9K31346", "Overall": "5.0", "Content": "I got this to replace a stolen S3 and now I'm almost glad I got robbed. This does everything the other did but the battery lasts longer and it fits in my hand (pocket and purse) WAY better. I used to have to hold it in one hand to dial with the other. This one fits me. Everything is in Korean, change the settings as you do the initial set up. Not sure if there was a warranty since I can't read the paperwork. The camera is better than any phone camera I've ever used. It comes with a US charger and ear buds.", "Date": "August 29, 2013"}, {"Title": "I like it", "Author": "Xavier Arias", "ReviewID": "RMUJ2MH580MIK", "Overall": "4.0", "Content": "Its a beautiful edition.  It is better than I expected. It doesnt have spanish language but not problem!Sure, that you enjoy it like me!", "Date": "August 20, 2013"}, {"Title": "language", "Author": "Recep", "ReviewID": "R3JLU3IB8BJZG3", "Overall": "2.0", "Content": "i bought this item for my wife and she doesn`t speak Chinese or English.Also This phone has just 4-5 language options.design is wonderful.camera nice.just language problem.if i can update language software this cellphone is very nice gift.", "Date": "July 31, 2013"}, {"Title": "ok", "Author": "Maria Razo", "ReviewID": "RA4XV3LV2M2EK", "Overall": "3.0", "Content": "I like the phone its really nice, but it's not what i was expecting. It has a cauple of languages English and I think is Chinesse or Korean. And I wanted Spanish.", "Date": "July 24, 2013"}, {"Title": "Languaje", "Author": "Alberto Ruiz \"TRUCUMAX\"", "ReviewID": "R3EAQL94DZZ3X7", "Overall": "1.0", "Content": "i bought this item for my wife and she doesn`t speak Chinese or English.Also This phone has just 4-5 language options.design is wonderful.camera nice.just language problem.if i can update language software this cellphone is very nice gift.", "Date": "August 4, 2013"}, {"Title": "My gf loves it", "Author": "Alister Ronald Allert \"g_shock\"", "ReviewID": "R31NKCTZNN5YIK", "Overall": "5.0", "Content": "It's a great alternative to the full sized S3 with a few scaled down features absent, and the flower design looks great", "Date": "July 9, 2013"}, {"Title": "Super Cute!!!!", "Author": "Pamela L. Stuart", "ReviewID": "R1MEBT2XYD42GI", "Overall": "5.0", "Content": "This phone is very cute, feminine and compact.  The only downfall is that you have to change the language from japanese to your preferrred language, you'll have to google how to.  My first smartphone and I'm in luv!!!", "Date": "August 28, 2013"}, {"Title": "Love it!", "Author": "Amazon Customer", "ReviewID": "R1SGG5449A4XU7", "Overall": "5.0", "Content": "Very good phone, doesn't have all the features of the SIII like touching a similar phone to send a file or 8MP camera, but still a really good device. Front and back camera, loads apps quickly.. I especially like using my Kindle app on it, really quick. I love the La Fleur designs and ring tones, really different experience unlike the normal SIII mini with. Only thing I was disappointed with was that the mini doesn't have the LED flash option with the different colors per message or app use.But I digress.... really good phone, La Fleur.. great job!", "Date": "August 25, 2013"}, {"Title": "good product", "Author": "Marcelo Paraquedas", "ReviewID": "R36R1L5OKHVBKT", "Overall": "4.0", "Content": "this product is great quality as expected, a pity not to have Portuguese language. I still recommend buying this phone.", "Date": "June 24, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Samsung Galaxy S III Mini S3 i8190 La Fleur - Flower Edition (Factory Unlocked)  SHIP Worldwide", "Name": "Samsung Galaxy S III Mini S3 I8190 La Fleur - Flower Edition (Factory Unlocked) Ship Worldwide", "ImgURL": "http://ecx.images-amazon.com/images/I/51GTQrg6c-L._SY300_.jpg", "ProductID": "B00CO2RENI"}}