{"Reviews": [{"Title": "Awesome phone, incremental upgrade from SIII", "Author": "rpv", "ReviewID": "R282P6RDBBLS7D", "Overall": "5.0", "Content": "Galaxy S4 is  an incredible phone. I have been using this unlocked S4 for past 2 days helping a friend to migrate from iPhone 4S. My friend has been on iPhone and it also gave me a unique perspective. I used iPhone for couple of years and been using Android for past 3+ years.I have used Galaxy S3, Note II and for me S4 is more like a S3s :) If you have a Galaxy S3, it is perfect and there is no need to move to S4. The new features are more like minor upgrades for me. Just like Detroit rolls out new cars every year, phone manufacturers have found excellent way to make yearly upgrades.Battery came for almost a day. The video playback was crisp and my friend was amazed at the customization options. It is heaven for a iphone user to come out of shackles and explores the wonderful world of Android. It sure sounds like it is for geeks, but Samsung has created lot of ways to simplify and make it less intimidating. The EASY mode is for one such reason. Samsung's addition of all those apps (commonly referred as crapware) is not as bad as HTC or LG. Android experience is classified as pure vanilla in phones like Nexus. Vendors like Samsung have added a whole lot of extra programs.5\" HD Super AMOLED 1920 x 1080 display  (441 ppi) is just plain gorgeous. 13 MP camera takes ginormous image sizes. I put a 64 GB microSDXC card  SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging as my friend wants to take lot of movies (built-in 2 GB RAM, 16 GB ROM). No stuttering, and very smooth playback of videos captured in varying light conditions (HD Playback; HD Recording). Compatible video types are AVI/DIVX, WMV/ASF, FLV, MKV, MP4/3GP, WEBM. HDR and Panaromic photos were incredibly sharp. Compatible audio types are:  AAC, AMR, MP3, OGG, WMA/ASF, 3GA/M4A, FLAC, WAV. Google Music, PlayerPro Music player are producing excellent music.  Audio/Video is one section where S4 has nudged S3. For a normal user, if you are not into lot of video processing this does not matter.S4's infrared sensor is the same technology as TV remote control, so with WatchON you can change the TV channel from your phone. My friend was shocked to see this feature. Having used Android for a long time, I explored all new features one by one. My friend is still getting used to and feels this is too complicated. I broke down into lot of sub features and told my friend he may not use 50% of features, but told him to explore one feature at a time and focus on that.Games were very buttery, this phones runs ARM®-based octa-core mobile CPU. This is apparently world's first!  Inside this chip is Imagination Technologies' PowerVR SGX544MP3 GPU. I tried several car racing games and performance was phenomenal. People on the XDA-Developers forum report seeing smearing and ghosting when scrolling on the phone. This especially occurs to people when scrolling among darker colors, which begin showing up as purple. I tried hard to see if I could on the S4 I was testing with my friend and I could not see it. I am sure these can be upgraded with software over due course.Air View and Air Gestures - are they worth it? Air view is similar to how the S-pen on the Galaxy Note 8 works. Simply hover finger a few millimeters above the screen and in supported apps, you'll see a preview of content. This works with many of Samsung's built-in apps, including the photo gallery, the dialer, Samsung's browser and email client. It also works with Flipboard. Air View works by cranking up the capacitive sensor on the screen. Another new feature is Air Gestures. This uses the IR sensor on the top of the phone to detect movement by your palm or finger. One can flip between open tabs in Samsung's browser app, skip to a new song in the music player and do many other things. I say these are still in works and sometimes not very efficient.GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). I tried multiple apps to demonstrate to my friend. In the end, my friend was impressed with what all Android and in particular S4 had to offer. Smooth and Stunning display!I tried following apps and they just worked awesome.Amazon MobileAndroid StatusAndroidifyAngry Birds (Space/Seasons)Asphalt 7Amazon App StoreBoxCar Maintenance Reminder ProChromeCNET TVNAVIGON (from Garmin - offline maps)Google Navigation/Earth/MapsGoogle Currents (nice way to read News)Draw SomethingGoogle DriveEbayLinkedinGoogle MusicTapatalk (awesome forum browsing app)OverDrive Media Console: Library eBooks & Audiobooks (public library consumption of media)Microsoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for Android (excellent twitter client)Twit.TvGoogle VoicePlenty of WidgetsAsk questions, the review cannot do justice to Galaxy S4. I will be glad to answer any questions.", "Date": "May 6, 2013"}, {"Title": "Worldwide distributors sucks!!!!!", "Author": "Hernando", "ReviewID": "R241HFZUELCBUY", "Overall": "1.0", "Content": "The cell phones is great, but DON'T BUY IT FROM THE THIS SELLER WORLDWIDE DISTRIBUTORS!!!I Bought from them because I saw all the good rating, but they sold me with a faulty camera, all the photos taken was out of focus all the time, it seem like a hardware problem I they gave me a very very hard time trying to refund or replace it, finally the gonna reimburse to me, but $160 less than the amount of money I've paid", "Date": "June 13, 2013"}, {"Title": "WorldWide Distributors Sucks!!!", "Author": "RR", "ReviewID": "R2VJTUSPK6COSX", "Overall": "1.0", "Content": "The phone itself is great, BUT DO NOT BUY IT FROM WorldWide Distributors!!!\"WorldWide Distributors sold me a defected Galaxy S4, which rebooted itself. I sent it back in order to get a full refund, however they lied me that the phone in excellent working condition. I lost more that $150 plus $30 for shipment. DO NOT BUY ANYTHING FROM THEM!!!!\"", "Date": "June 24, 2013"}, {"Title": "Beware - the Galaxy S4 is not one product, but a family of products !", "Author": "Kent L. Estes \"KLestes\"", "ReviewID": "RGRD9RL5IY0K4", "Overall": "3.0", "Content": "So far I love everything about this phone, except:1)  It eats battery - such is the price for computing power.2)  The model I got DOES NOT have 4g LTE capability.  Amazon advertises this as a feature of the S4.  It is only on certain models of the S4 !  the I-9500 does not have it !  Not happy at all with this marketing gimick ! -2 stars, thanks Amazon.Other than that, it can cause insomnia - I haven't been able to stop playing with it !", "Date": "June 27, 2013"}, {"Title": "GSM Shop SOLD ME A GALAXY S4 CLONE AND CHARGE ME FOR A ORIGINAL S4", "Author": "Marcos Paez \"marcos paez\"", "ReviewID": "R26VS44KQP3FV4", "Overall": "1.0", "Content": "BE ADVICE THERES A LOT OF CLONES ON MARKET IT TOOK ME A COUPLE OF MONTHS TO FIGURED OUT GALAXY S4 SELLER GSM SHOP IS A CLONE. AND I PAY FOR A NEW ORIGINAL PHONE.", "Date": "September 5, 2013"}, {"Title": "Great device, beautiful screen **UPDATED**", "Author": "BarbZ", "ReviewID": "R2AXVFBUV9JU5M", "Overall": "5.0", "Content": "I've been waiting for this phone for months, while also planning on switching carriers at the same time.  Here's what I like about the phone:Beautiful screen - for those of us who don't have perfect vision, this screen is very readable. The fonts are an appropriate size, with good contrast.Nice speed. The screen is responsive, and allows multiple windows to be open at once.Screen size:  For certain apps, I.e. the kindle app, this screen approximates an e-reader very well (as opposed to reading on a smaller phone screen.)The interface is very thoughtfully designed.  Great job, Samsung!  Unobtrusive, noninvasive methods of accessing critical apps are available from almost anyplace on the phone.Icons/graphics are adorable, and creatively designed.  No boring manila folders on this phone!  Your folders show contents from the outside of the folder... Cute.Ease of use:  There is a little bit of a learning curve on this phone (I had the Samsung Epic previously), but I've pretty much figured it out in a few hours.  It's going to be great. Once you get the hang of the graphics, it's really quick to move things around, personalize, etc.It really blurs the boundary between a tablet and a phone, without becoming too huge, like the Note (which I am now glad I did not buy).Voice quality: I'd read reviews in the last few days that state that it is not very good... I think it's fine. The sound is clear, and volume is fine.One of my favorite apps for Android:  Out of Milk.  Running out of groceries?  Scan the bar code into one of your shopping lists, (or input by voice or typing), and your shopping list is complete.  I keep a running shopping list for Trader Joes, and my other local market.  When I go to the store, I simply move the items I need to the top of the list, and go for it!  No more paper lists!One heads up: (carrier, not phone related):  check on Visual Voicemail.... I use it all the time, and really like it.  I was surprised to discover that I had to pay for it as an add on with Verizon.... It was part of my Sprint service previously.** UPDATE **I've had the phone for almost a week, and it's simply a PLEASURE to use!  Lots of nice touches:  pop up asking if you'd like to add someone to your contacts after a call from a non contact, for example.Camera:  is great.  I photographed an entire exhibit in a museum.... No flash, in dark rooms, and the photos are stunning.Battery life:  surprisingly good!  I used the phone all day yesterday, on and off trains where it would have been seeking service in tunnels (usually drains battery quicker), used my Kindle app, made calls, sent texts and emails, and I still had 60% at the end of a ten hour day.Battery recharging:  using the charging cord that comes with the phone, it charges in no time... A couple of hours at most.  I've been amazed at the recharge speed, compared to my previous phone.Kindle app is like a baby Kindle... there's just enough on the page to not feel like you are only reading a few sentences at a time like on some smaller devices.I'm so pleased with my choice,  I hope you enjoy it, also.(And in case this is helpful to anyone:  if you are debating about a case, I have the Seidio holster case... Please see my review.)*************Enjoy this great device!  Questions?  Drop a note, and I'll get back to you.", "Date": "May 25, 2013"}, {"Title": "lost stolen phone", "Author": "Chris C.", "ReviewID": "RP5830UZRMF8", "Overall": "1.0", "Content": "Spent $400 Dollars on this phone.Description says it was an unlocked phone, but when i tried to activate it, it came back reported lost/stolen. Why are these phones aloud to be sold .. Also phone shuts off with full battery charge. I will not buy from company again.", "Date": "March 17, 2014"}, {"Title": "OK", "Author": "David Ickowicz", "ReviewID": "R2ZXXX0OCMD7AO", "Overall": "4.0", "Content": "The phone comes with so much fixed software, and it takes up too much space of the 16 GB offered, you have availability for storage of about only half", "Date": "June 14, 2013"}, {"Title": "a display scratch", "Author": "Juan Luis Ferret C", "ReviewID": "R2LP40OJV2XQIJ", "Overall": "4.0", "Content": "The phone is great, brand new, just a very small vertical line on the display, difficult to me returning the device because im in ecuador, but the phone works great", "Date": "July 27, 2013"}, {"Title": "Best Android Phone I've Owned Thus Far", "Author": "SK", "ReviewID": "R3HXNWU1AVOLW4", "Overall": "5.0", "Content": "I gotta say, I'm Impressed.  At first I was a bit hesitant with the phone: holding it felt a little awkward (I'm used to the Motorola Atrix 2 which is smaller and quite a bit more bulky) being bigger than I'm used and much much thinner and lightweight.  Honestly, I was afraid I would drop it!  After getting an Otterbox Defender Case for it (if you haven't had an Otterbox try it, you won't get another case) the size is now perfect and the case really makes it easier to hold and grip.  Like any other phone, your going to find a bunch of apps you don't want but can't get rid of unless you jailbreak the phone which is an annoyance but nothing to fret for along time about.  As far as performance goes, the phone runs very smoothly and very rarely \"lags\" which is a plus because I have very little patience when it comes to technology :D.  If you need more space for music, pictures, or movies, there is a MicroSD expansion slot.  Being an avid camera user, I was also impressed with both the video quality and the photo quality with this phone.  With the camera you have several different \"modes\" to set it on such as Night, Auto, Sports, Panorama, etc.  This phone does also have allot of cool features which I'm not particularly interested in like a setting that will pause a video when you look away and \"air gestures\" which will allow you do some things without actually touching your phone screen.  The one I saw that looked very useful was a setting that increases sensitivity so you can still use your phone with gloves on.  Overall it is the best Android phone I have ever had and I have absolutely no complaints (except for those annoying apps you can't get rid of)!  If there is something your curious of that I did not cover, ask me a question here!", "Date": "June 11, 2013"}, {"Title": "Excellent phone but lousy seller.", "Author": "Jesus Piñeiro", "ReviewID": "R1IM2HQZPVDEBX", "Overall": "1.0", "Content": "Excellent phone but the seller sent me the warranty seal open, the cell had a scratch and they sent me a black phone with white wires, if you want to buy a galaxy s4 buy it from another seller.", "Date": "December 4, 2013"}, {"Title": "Stay away from the Samsung Galaxy S4", "Author": "elicious", "ReviewID": "R1OHGFT108ZKON", "Overall": "1.0", "Content": "I purchase the Samsung galaxy s4 from amazon and it was delivered to me on time. They only allow you a 30 day return policy and that is stated no where prior to the purchase from the seller. One day after my 30 day probationary period was up the phone began to behave erratic. The charging port had issues, the phone had to be charged twice or thrice for the day and I am not running a whole lot of apps and to top it up I got this message during charging: 'charging paused, battery temperature to high\". I have replaced the battery, the charger and have done a factory reset all to no avail. The seller refuses to allow me to return the product for another one or at least offer any form of compensation in part or in full after such a huge investment. This behave is definitely unacceptable and I am alerting everyone to stay away from this seller until full disclosure is made on the terms and conditions of purchase prior to the actual purchase. Amazon themselves should suspend and investigate this seller.", "Date": "September 4, 2013"}, {"Title": "Unfortunate Choice Of Company", "Author": "Jim", "ReviewID": "R3BMCT60KNQQEP", "Overall": "1.0", "Content": "It was unfortunate that I bought a phone from World Wide Distributions. In my opinion this company can not be  trusted to do the right  thing when they have taken your money and kept  the returned Samsung Galaxy S4 I9500 16GB version Phone.I have constantly kept in touch with this  company to try and  come to some sot of  resolution but  they have chosen to stop communicating with me.There  seems to be some dispute about shipping  costs!! here is a breakdown of money I have spent with this company.Price of the phone in US $605.28 : £449.25 Unfortunately the Phone  was not compatable  with the European Network so I returned it and asked for a replacement Phone but  never received another phone, on top of that I received a customs bill for  £86.30. I then had pay an extra  amount to ship it back to the  company for £47.74.Purchase of the phone was ordered Sept 28/9/2013  and shipped on the  30/09/2013 to arrive between October 2 and  October 7. This company should  not be allowed to trade as not only have they kept my money  they have also kept the phone which no doubt they have probably resold. And have acknowledge the fact that they had receive it!!!How does one get redress when dealing with a company in the U.S. If I am In the wrong in some way then the company should have the decency the inform me be e-mail instead of  ignoring my e-mails this company should hang it head in shame? I suppose my only redress would be is that you think before you buy.", "Date": "June 4, 2014"}, {"Title": "Wife loves it", "Author": "J. Maier \"Consumer\"", "ReviewID": "R2VWPIF51TSTLS", "Overall": "5.0", "Content": "Christmas gift, it is NOT 4G, but unless you are streaming movies all day so what...otherwise works great. A happy camper here.", "Date": "February 12, 2014"}, {"Title": "Rip off", "Author": "Angry", "ReviewID": "R1FFCFFZY95JML", "Overall": "2.0", "Content": "I thought I was getting a phone wit a 16g memory....instead I got only 8g..........love the phone tho.....jus didnt get exactly wht I paid for..... x(......2 stars cuz i was ripoed off....... however the fone deserves a 5 ★★★★★", "Date": "February 7, 2014"}, {"Title": "DON'T BUY IT!!!", "Author": "M. Figueroa \"myriad\"", "ReviewID": "R2YZPG4NT3IO5G", "Overall": "1.0", "Content": "The phone itself is not so much the problem, I'm sure it's a great phone BUT I decided to buy an unlocked phone so that I wouldn't add any more time to my contract with Tmobile and just in case I wanted to switch providers. The problem is that because I didn't get it from Tmobile, the phone does not come \"preloaded\" with whatever stuff they put on their cells to pick up the 4G signal! so I'm stuck with a $700 phone that has the slowest internet I've ever had in my life!!! so all of the great features that I cannot enjoy!! can't watch vids online or see pics on fb or anything!! I contacted the seller and nothing was done!! SAVE YOUR MONEY! DON'T BUY IT!", "Date": "June 22, 2013"}, {"Title": "DO NOT BUY this phone unlock (Not a good idea to buy from Open Group Wireless)", "Author": "tech_guy", "ReviewID": "R23P4PW75P1TZX", "Overall": "1.0", "Content": "You won't be able to get this phone repair under warranty by Samsung in the US.Not a good idea to buy from Open Group Wireless)", "Date": "June 4, 2014"}, {"Title": "fake", "Author": "Samplerman \"samplerman\"", "ReviewID": "RSPWM8DH6I6CT", "Overall": "1.0", "Content": "first and foremost...if the startup screen says life companion, it's a chinese one-off.  does not have an amoled screen and the software is full of bugs.  it's true value is about $150 on a good day.  I know, I fell for this scam.  info posted is for a real samsung galaxy.  not this unit.  go to youtube and look up the comparison.  they look amazingly the same and this phone is fast and sleek but not upgrade-able.  beware.", "Date": "May 11, 2014"}, {"Title": "nice phone", "Author": "Carlos D.", "ReviewID": "R12SK6PKK48U2I", "Overall": "5.0", "Content": "its nice but from my point of view not too difference from the previous version. Based on cost value I think the galaxy 3. its better. I received on time and it works well in Venezuela", "Date": "October 25, 2013"}, {"Title": "Great cell phone!", "Author": "International Buyer", "ReviewID": "R1H9I1HEL122UM", "Overall": "5.0", "Content": "I think this is the best cell phone out there! I bought it to be used in Venezuela and had some concerns about how it could work with Venezuelan carriers but when installed the micro SIM, It inmediatly recognized the carriers name and got a full radio signal. I also took a look at the features of the phone and everything worked very well. I recommend this product without hesitation.", "Date": "September 13, 2013"}, {"Title": "Outstanding Phone", "Author": "James Kitchens", "ReviewID": "R4G6VEVVZULHO", "Overall": "5.0", "Content": "I purchased this phone for a friend of whom I work with overseas. He resides in Argentina and travels abroad for his work and did not have access to such an item without paying allot for shipping cost. He was very pleased with the item and the shipping was super fast.", "Date": "July 20, 2013"}, {"Title": "General Info", "Author": "Marco", "ReviewID": "R1M4LCYNJJQS86", "Overall": "5.0", "Content": "The smartphone is the most complete pone I ever had. It has all the applications and functions everybody could need. I recommend it 100%.", "Date": "June 10, 2013"}, {"Title": "Excellent mobile device.", "Author": "Roynier", "ReviewID": "R2C3HTNPXWVQ2T", "Overall": "5.0", "Content": "excellent, everything went well the product meets my expectations, 100% reliable and recommended. hope to continue like this. excellent excellent", "Date": "June 8, 2014"}, {"Title": "Product cuality", "Author": "Cristopher Gomez", "ReviewID": "R1JQ0QZD57CA5Y", "Overall": "5.0", "Content": "high product cuality is the best in what you want of mi home and leave in the doors of mi home", "Date": "June 6, 2014"}, {"Title": "Amazing product!", "Author": "Federico", "ReviewID": "R20ZYC8LICZLC3", "Overall": "5.0", "Content": "Although an iPhone user since... a long time, this phone is amazing. It's a Samsung, which means a lot was copied from Apple, but they managed to equal or even surpass the Cupertino company in several areas. Mainly, the screen is bigger and slicker, the total weight is near to nothing and the size is just about right. Bad aspects? I still prefer iOS over Android (better UX), the back cover is a little cheap for my taste.", "Date": "June 6, 2014"}, {"Title": "tanks", "Author": "JAURREST", "ReviewID": "R2EIK9JK2TP7ED", "Overall": "4.0", "Content": "Everything with my package at the moment I do not have any problem in your operation that I give you 4 stars.Best wishes", "Date": "May 15, 2014"}, {"Title": "The everything phone for (almost) everyone", "Author": "Hernando Del Castillo", "ReviewID": "R2BFP00IJBN69J", "Overall": "5.0", "Content": "Its laundry list of features require time and effort to truly master, but the Galaxy S4 is the top choice for anyone looking for a big-screen, do-everything smartphone.", "Date": "May 14, 2014"}, {"Title": "Excellent phone", "Author": "Terry", "ReviewID": "R33OUAYOPL07OB", "Overall": "5.0", "Content": "Very happy with my purchase.  Bought it outright and unlocked.  Now doing a month by month contract.  Again, very happy.", "Date": "May 12, 2014"}, {"Title": "phone works ok", "Author": "kiki", "ReviewID": "R19HORG07TYZ0O", "Overall": "4.0", "Content": "The phone works well but the charger I got doesn't work the adoptor was the wrong size for the phone so I have to get a different charger to charge the phone.", "Date": "May 9, 2014"}, {"Title": "Very useful", "Author": "Daniel Mendonça Vargas", "ReviewID": "RLIKGX451Y1YN", "Overall": "5.0", "Content": "My new cell phone is very good. Fast, reliable. I know we already have S5 to buy, but this is pretty nice to me", "Date": "May 8, 2014"}, {"Title": "no isssues at all", "Author": "Sheldon Anthony", "ReviewID": "R1XQ9TN1MWN9V8", "Overall": "5.0", "Content": "delivered early and as advertised genuine Samsung Galaxy 9500it even with kitkathave an i337 got this one for girlextremely please thus far", "Date": "May 6, 2014"}, {"Title": "Device is great but back cover is made of cheap plastic.", "Author": "LC", "ReviewID": "R2C99UG37ADQXR", "Overall": "4.0", "Content": "Samsung has used plastic for their whole Galaxy S line thus far and I believe this separates it from a luxury such as the iPhone materialistically. Overall, it's a good phone and I would recommend it.", "Date": "May 1, 2014"}, {"Title": "A+", "Author": "Aurica Mihai", "ReviewID": "R333OEXI71RW3S", "Overall": "5.0", "Content": "I'm very happy with this phone. If owner manual and other information they'll be in English was even better. Thanks.", "Date": "April 5, 2014"}, {"Title": "Without any problem", "Author": "Roman Nemec", "ReviewID": "R3SZUUU3NGPLKJ", "Overall": "5.0", "Content": "So far so good...Now I am just waiting for a software update (Android 4.3 to 4.4)....And I hope it will works properly", "Date": "March 18, 2014"}, {"Title": "Favorite phone ever", "Author": "kongo1997", "ReviewID": "R3SK75I29VR3CM", "Overall": "5.0", "Content": "I bought this with intentions of rooting and installing a custom rom.  It's been great.  I especially like the IR blaster.", "Date": "March 13, 2014"}, {"Title": "Samsung Galaxy Rocks", "Author": "Faride H.", "ReviewID": "RAOU8N6XPGQH1", "Overall": "4.0", "Content": "This phone does every thing I need and more. A lot more to discover. I not cyber coinsure but looking forward to becoming one.great product.Faride Helms", "Date": "March 12, 2014"}, {"Title": "We are testing it", "Author": "Jesus Arellano", "ReviewID": "R2F8KSNU5X6HF5", "Overall": "5.0", "Content": "The equipment is a very nice phone and Internet terminal but now we are learning from it. We expect it will do everything.", "Date": "February 27, 2014"}, {"Title": "Excellent Smart Mobile Phone", "Author": "Esaa Gonzalez Abelardo Jose", "ReviewID": "R384422OGFQ1PW", "Overall": "5.0", "Content": "Excellent Phone Great look, very light, high performance, no overheat, confortable, easy to use, works really really fine. Both cameras are fine. Highly recommended.", "Date": "February 23, 2014"}, {"Title": "Great phone!", "Author": "dquin656", "ReviewID": "REZBBI4IJKR8E", "Overall": "5.0", "Content": "My daughter loved her Christmas present this year.  But, I paid top dollar and wished I had waited a week or two.  Prices dropped after Christmas.", "Date": "February 22, 2014"}, {"Title": "so so", "Author": "Jamal Alwadi", "ReviewID": "R2RM37DJUOROF7", "Overall": "3.0", "Content": "The phone is good as aplication but i face problem that its start to be hott as tempercher  and the sicren is black  now and and when i asked they told me factory problem with lcd  and i contact the source and he didnot answer me  and it sell by samsung", "Date": "February 4, 2014"}, {"Title": "Battery Problems", "Author": "Ram Raphaeli", "ReviewID": "R26ET5MAWO3J6T", "Overall": "2.0", "Content": "Hello,Only one month after purchasing the battery has bulged and some cracks at the back have occurred.Unfortunately, Samsung don't want to take any responsibility although its a world known problem with the batteryBe aware!!!", "Date": "January 20, 2014"}, {"Title": "Samsung Galaxy S4 I9500 16Gb Black WiFi Android Unlocked Cell Phone...", "Author": "José Cayones", "ReviewID": "R2ZJZD8FR2BCQ2", "Overall": "5.0", "Content": "Since it was first turned on to today's date has behaved excellent, without any kind of detail. It's fast, with a generous screen in Full HD, the battery will lasts the entire day (except when you are traveling, I guess because of the coverage ago weaken the battery faster). In short, good product.This is written from Venezuela, works excellent with Movilnet and Movistar.", "Date": "January 15, 2014"}, {"Title": "NOW IT IS BAD and dead", "Author": "abdulmohsen", "ReviewID": "R2FM537XF2O66V", "Overall": "2.0", "Content": "My phone cannot charge and it was not complete one year. I have to return it back as soon as possible", "Date": "January 14, 2014"}, {"Title": "Awesome phone", "Author": "Ava", "ReviewID": "R2MU3AHMSY1LV9", "Overall": "4.0", "Content": "Phone is awesome. Works well but had one concern with the adapter. I guess since it is the international version they had two adapters that can work in other countries. I am enjoying the use of my phone.", "Date": "January 12, 2014"}, {"Title": "Great", "Author": "Abusosa", "ReviewID": "R1EVCTLVSA4H6O", "Overall": "5.0", "Content": "Just got mine set up and its fantastic, I got i unlocked and ready to go, love it! Will order more for the rest of the family.", "Date": "January 12, 2014"}, {"Title": "Huge mobile", "Author": "Andres Lopez Jimenez", "ReviewID": "R1WEK1I8RYT82D", "Overall": "5.0", "Content": "This phone meets the requirements and this is a great phone service store has a rapid, secure delivery and quality definitely recommend this product", "Date": "January 10, 2014"}, {"Title": "very good", "Author": "Alexandre", "ReviewID": "R1NNYV6O0JCXV5", "Overall": "5.0", "Content": "Samsung Galaxy S4 I9500 16Gb Black WiFi Android Unlocked Cell Phone...it works very well and Im very satisfied with", "Date": "January 7, 2014"}, {"Title": "Best of the best", "Author": "Manuel G.", "ReviewID": "R1IUZCX4IQNQYL", "Overall": "5.0", "Content": "Amazing phone. It is just the best in performance, and all the innovation that brings to you. I love it", "Date": "January 4, 2014"}, {"Title": "Bought this for overseas use", "Author": "Rita Dalbert", "ReviewID": "R28WUKM8QAA9A9", "Overall": "4.0", "Content": "I travel a lot and have different phones for different countries.  It finally occurred to me to buy one great phone and just switch sim cards.  This phone was recommended to me by someone who traveled all over Italy using it's GPS, and was raving about it.  So I bought one in time for my forthcoming trip, also to Italy.Got to Pisa, bought a sim card for 19 Euros, and used the phone constantly for the rest of the trip.  Great coverage, even in the most remote parts of the country (the provider was \"3\").  The GPS was a total lifesaver, and the camera is pretty great on it too. The only reason I gave this phone  four stars instead of five is that I don't love the OS.  As much as I'd love to switch to this phone full time, I'm much more comfortable with the Apple OS.  This is a great phone for international travel, though!", "Date": "December 15, 2013"}, {"Title": "Be complete on the advertising", "Author": "S.A. A.Q.", "ReviewID": "R1AMEQAQYVAFMQ", "Overall": "4.0", "Content": "I had some email back and forth with the seller. The main issue was that the seller did not mention specifically that the phone is a SGH - I337.  So I bought the phone with in mind that I will receive an i9500.I suggested the seller to put this information on his advertisement,so avoid unnecessary discussion.  I want to return the phone, but cost wise I decided to keep it.  The phone looks good and works good, I have no complain on the phone.  I looks and works perfect as advertised, the only issue was the type of the phone nothing else.So for not advertising the type of the phone I am giving a 4 star, otherwise it would be a 5 stars.", "Date": "November 16, 2013"}, {"Title": "excellent product", "Author": "geoffrey", "ReviewID": "R7KRCLNP5TC75", "Overall": "5.0", "Content": "I love really great product. Meat all my expectations and more. Having  it in your hand and seeing it and the tv or on the net is nothing like having it in your own hands.", "Date": "October 30, 2013"}, {"Title": "Unlocked sadly doesn't mean \"stock android\" it turns out", "Author": "B. Foley", "ReviewID": "R1OJGW7ZSB426H", "Overall": "4.0", "Content": "Everything came as advertised, and it's a really lovely phone. I really, really hated the Samsung pre-installed OS, to the point that I spent days learning how to root and install stock Android on the phone. There was so much AT&T; bloatware, and redundant (inferior) Samsung copies of perfectly good Google software. If this doesn't bother you, go for it. If it does, do a little more research (as I should have done.)", "Date": "October 14, 2013"}, {"Title": "Samsung Galaxy S4 is the bomb.", "Author": "Barry", "ReviewID": "R70LGXJ14EJJ0", "Overall": "5.0", "Content": "I love the design, the screen is wonderful,  the interface is good and of course the abilities of the phone is just remarkable", "Date": "October 4, 2013"}, {"Title": "This is on data, and do not have this phone (yet).", "Author": "bobtec", "ReviewID": "R3NBBBGAXAR4JF", "Overall": "5.0", "Content": "When I get this phone as an upgrade next year, It will be great. What is great is that (according to AT&T; - my carrier) this runs Google jellybean os, and will RUN sdxc memory cards. After reading about sd data, they are planning on developing xd cards that will hold 2TB of data (that's 2,000 GB) which will be like having a hand held computer at your fingertips. The only way this could get better is if Google incorporates Android jellybean with Chrome OS vanilla versatility. That's why I like Android, and Google over Microsoft. Google runs like a race horse, whereas Microsoft runs like a snail. And don't believe those stupid \"scroogled\" adds from Microsoft. Speed wise, Google is actually better than Apple. I'm sort of an amateur techie, but I know what I like. This is it.", "Date": "September 25, 2013"}, {"Title": "love it", "Author": "Berry", "ReviewID": "R2SR21FDMLHXN7", "Overall": "4.0", "Content": "4 stars because it does not have a swype option in keyboard settings but besides that this a wonderful phone.. everyone should have one", "Date": "August 30, 2013"}, {"Title": "YouTube Review", "Author": "Hammad", "ReviewID": "R13FU3RXGY144C", "Overall": "5.0", "Content": "I made a video on this device, watch it here:[...]It is a really nice device, better than the iPhone, software and design wise.  But it is a plastic device.", "Date": "July 30, 2013"}, {"Title": "best phone ever!", "Author": "J. Bedard", "ReviewID": "R3MDU5I14E8AYO", "Overall": "5.0", "Content": "I've had this phone for about a month now, its the first time I've had a 'smart' phone. It works well with the S View cover (I did not want to mess with a screen protector). It is truly unlocked and I have not had any problems with it on T-Mobile. It works so well, that I plan to take it with me to Europe for a month--I won't need a laptop! I can transfer all my pics from my digital camera with the MicroSD memory and backup to dropbox.", "Date": "July 24, 2013"}, {"Title": "pretty good mobile", "Author": "Valeria Gisela Bonazzi", "ReviewID": "R318S6CKNYKARQ", "Overall": "5.0", "Content": "My new Samsung s4 is awesome!!!! Has everything what it says and more I really recommend this mobile....is the best so far", "Date": "July 24, 2013"}, {"Title": "Great Phone", "Author": "Chadwick G. Goldberg \"Chad\"", "ReviewID": "R21UWRKR9ZVG7A", "Overall": "3.0", "Content": "An excellent phone for feature hounds or people looking to escape ijail. Would highly recommend the product. The screen quality and camera are very impressive.", "Date": "July 23, 2013"}, {"Title": "need updates to fix some bugs", "Author": "Rodrigo Marcus", "ReviewID": "RQPE9KP7NK7ZJ", "Overall": "4.0", "Content": "Depending on the firmware it comes with it can reboot after opening the camera app.  But the features and the speed of it are amazing.", "Date": "July 23, 2013"}, {"Title": "Matt S", "Author": "Mister S.", "ReviewID": "R3KK8UR6UK1205", "Overall": "5.0", "Content": "Totally Awesome phone! It has more bells & whistles then I know what to do with. The battery life could be a little better.", "Date": "July 18, 2013"}, {"Title": "Great smartphone!", "Author": "Eduin J.", "ReviewID": "R17ADW32E1AGI8", "Overall": "5.0", "Content": "This is the best smartphone now (may 2013) i am waiting the new model since that I'd take this one.", "Date": "July 12, 2013"}, {"Title": "amazing screen", "Author": "WANG JI XIANG", "ReviewID": "R24PZEOYOY7FFS", "Overall": "5.0", "Content": "so big ,  so  clearly and so fast ,  i think it is better than i 5,pretty good ,you should buy", "Date": "June 10, 2013"}, {"Title": "wonderfull cellphone", "Author": "Marcelo da Silva Pereira", "ReviewID": "R3JFGQ67MCTSED", "Overall": "5.0", "Content": "This is the most amazing experience in cellphones that I had. You can trust it. Brilliant gadget that makes you, think about how would be the future.", "Date": "June 7, 2013"}, {"Title": "Beautiful Cell Phone", "Author": "ANICHIQUITA", "ReviewID": "R3DLMBX6OYJVAP", "Overall": "5.0", "Content": "I bought this cell phone for my husband. He loves this new samsung galaxy s4, it's better than the samsung galaxy s3. For us the best of all is that for latin america it really cames unlocked, it works great.", "Date": "June 5, 2013"}, {"Title": "Samsung Galaxy S4 Rocks!", "Author": "Ronald P.", "ReviewID": "R15LVCV2442JSS", "Overall": "5.0", "Content": "This phone wow's everyone who sees it.  It is fantastic.  On the downside - the battery life goes down to maybe one day if I leave the GPS and WiFi enabled.Disclosure:  this is the first smart phone I have had.", "Date": "June 4, 2013"}, {"Title": "wao!!! impresive", "Author": "Danilo", "ReviewID": "RLIXYXY15Z3V2", "Overall": "5.0", "Content": "Definitively an improvement specially for work  .With few steps you can now attach files and send them in different sizes.in the technological aspect is much  better than de S3 even though the s3 its still a very good phone.but as Im a tech fan person, I take advantage of every aspect of it, and there's when you can say wao!!!!!The only cons for me of  \"all the smartphones\" is that the run out of battery so I really need a second battery. if  I have a full day  working on it and didn't find a charger because I was out of my office I just look for the second one that is in my wallet (very thin) and solve the problemI just cant be out of contact because of my work and family I always had bought a second OEM battery for any phone I have ever used....", "Date": "June 5, 2013"}, {"Title": "Turned a negative into a positive", "Author": "D&apos;artagnon", "ReviewID": "RH9KJ6SQNEUU2", "Overall": "5.0", "Content": "I inadvertently ordered the wrong phone for my purposes, and only realized this after I had opened the package.  Though there was some original disagreement based on my misunderstanding of the advertisement, this distributor went out of their way to make sure that I was satisfied after they understood the situation.  In my opinion, they went above and beyond what they others would have done and in the process proved themselves to be a reputable company who is concerned about their reputation.  Some companies only talk about their customer service, but this one stands squarely behind theirs.  I would gladly do business with them again, with no hesitation, should the occasion arise.", "Date": "August 6, 2013"}, {"Title": "Excelent product, best smartphone in the market", "Author": "Marco Silva", "ReviewID": "R253K7Y5H8Q3PJ", "Overall": "5.0", "Content": "Totally worth this excelent price. Galaxy S4 is definetelly the best smartphone in the market. Lots of usefull functions... that are really usefull, and some cool functions that you will use to show your friends and never more.Totally recomended for all hardcore android users, and for all iOS users that noticed their OS lacks of new functions.", "Date": "June 12, 2013"}, {"Title": "Thank you", "Author": "Arsen Danielyan", "ReviewID": "R8P6SUZ6NRBOJ", "Overall": "5.0", "Content": "Got it on time  and of course LOOOVE the the phone itself , Works just perfect and i hope there will be no issues with it . Thank you again , and will shop with this seller again", "Date": "June 3, 2013"}, {"Title": "Awesome phone", "Author": "Christian Letamendi Espinoza", "ReviewID": "R3MPAXWLBD0UE", "Overall": "5.0", "Content": "Perfect samsung galaxy s4. It's amazyn.The best, this phone is exactly as the seller offer... when you use it, no other cellphones can be compare.Excellent.", "Date": "May 28, 2013"}, {"Title": "Great Product", "Author": "Rodrigo Franco Campos", "ReviewID": "R1OXZXZUK1K1GG", "Overall": "5.0", "Content": "Samsung Galaxy S4 is definitely better than Iphone 5. I loved the fact of not having to touch the phone to answer it.", "Date": "May 20, 2013"}, {"Title": "excellent", "Author": "mave", "ReviewID": "R25Z39SKVCLZUW", "Overall": "5.0", "Content": "Perfect samsung galaxy s4..it's amazyn... the best, this phone is exactly as the seller offer...  when you use it, no other cellphones can be compare... simply excellent...", "Date": "May 9, 2013"}, {"Title": "Galaxy S4 Unlocked", "Author": "Richard Stack", "ReviewID": "R314TE77UUKMNC", "Overall": "3.0", "Content": "I did not realize when I got this phone that it would not or Verizon would not allow it to be usedon the Verizon network.  So had to exchange it.", "Date": "June 27, 2013"}, {"Title": "Excellent Cell Phone", "Author": "Francisco Silva", "ReviewID": "R12GA00IOPLRGU", "Overall": "5.0", "Content": "Great look, very light, high performance, no overheat, confortable, easy to use, works really really fine. Both  cameras are excellent. Highly recommended.", "Date": "February 6, 2014"}, {"Title": "thank you .", "Author": "Amazon Customer", "ReviewID": "RQ9CWOEHRNF3F", "Overall": "5.0", "Content": "the product  was brand new  and I blamed  amazon  accounts specialist  for not providing me any feedback  on my order ,this is not the sellers fault .everything thing came genuine as they said  and fast shipping .in future I will order again of my Samsung galaxy s4thank you guys you are the best :)", "Date": "July 5, 2013"}, {"Title": "Beutiful phone", "Author": "Ed", "ReviewID": "RU6JM3K3W0I1C", "Overall": "5.0", "Content": "this phone is truly amazing, cost alot but its worth it, the display is so beutiful i cant complain, runs everything i throw at it with little to no lag at all.", "Date": "June 18, 2013"}, {"Title": "MAY NOT WORK WITH YOUR WIFI", "Author": "J. Meagher \"jenifer\"", "ReviewID": "R3W09M2KO1KZGV", "Overall": "1.0", "Content": "I purchased the S4 brought it home and it wouldn't work with my wifi. I returned it and got another s4 only to have the same problem. After 4 hours of Samsung tech chat and 2 hours of Samsung phone tech help I find out that they are aware of a software issue with some routers.  However they are not currently working on a fix!! I asked if he could recommend a router that it would work with and he couldn't do that. {I have a new, brand name router that no one else has issues with}  So after hours of frustration I will be returning this phone for a different brand. You have been warned :)", "Date": "July 11, 2013"}, {"Title": "The I9500 is not run in 4G LTE", "Author": "Héctor Octavio Teco Madrigal", "ReviewID": "RX7WGGRY0RVOL", "Overall": "2.0", "Content": "may the exactly problem was that I don't check it at the description and I need an equipmment that run in 4G LTE", "Date": "June 14, 2013"}, {"Title": "shsh", "Author": "francisco", "ReviewID": "RIGRD4FHAGSIQ", "Overall": "1.0", "Content": "no warranty bad serves but the phone is good just buy it where some one can help you out no good", "Date": "November 14, 2013"}, {"Title": "Galaxy S4 I9500 Russia users", "Author": "segyo jung", "ReviewID": "RP869GMSVA4JQ", "Overall": "2.0", "Content": "i did try to update software via samsung kies.That says to me 'this  device is not available update via kies'and i feel What!!! are you talking about this cannot be happend.so did googleing. they said this version for 'RUSSIA'Whatever this device have some app i never saw that things sounds like bannk or something. unavailble to delete which is bothers me", "Date": "June 29, 2013"}, {"Title": "Cracked screen", "Author": "JJ", "ReviewID": "R25Y63B9NNLPPL", "Overall": "1.0", "Content": "DON'T BUY THIS PHONE. THIS PHONE IS THE WORST PHONE EVER MADE FROM SAMSUNG. i HAD IT 3 DAYS AND THE SCREEN CRACKED WITH THE LIGHTEST BUMP.AND THE FACTORY WILL NOT COVER ANY DAMAGE TO THE PHONENO GOOD DON'T BUY IT... POS.", "Date": "August 6, 2013"}, {"Title": "screen cracks", "Author": "A. Dhanani", "ReviewID": "RHQ3OAXL7FSHU", "Overall": "1.0", "Content": "Be very careful the screen cracks way to easily. I had the phone in my shorts and must have bumped into something and when took my phone out the screen was cracked. I did not drop or sit on it. Gorilla glass 3 is a joke if walking and bumping into something cracks the screen. Mine is right at the home button. It is smashed there and the crack goes half way up the phone.", "Date": "May 26, 2013"}], "ProductInfo": {"Price": "$899.99", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 900 / 1900 / 2100", "Name": "SAMSUNG GALAXY S4 i9500 16GB INTERNATIONAL VERSION NO WARRANTY BLACK", "ImgURL": "http://ecx.images-amazon.com/images/I/51iyUJryeeL._SY300_.jpg", "ProductID": "B00CIF9MJK"}}