{"Reviews": [{"Title": "HTC 8X", "Author": "Michael", "ReviewID": "R1Y82DQYZZ9RZL", "Overall": "5.0", "Content": "I was looking for something different so I went for a Windows phoneThe features (including Beats Audio) and the funky blue interface exceeded  myexpectations. Despite apps that are generally not as developed astheir apple counterparts it more than does the job.Huge pleasure/aesthetic factor I don't understand why this phone wasnot a big", "Date": "August 30, 2013"}, {"Title": "I love it... It kooks great", "Author": "Felipe Dalorzo Marin", "ReviewID": "R228NQ3VGR7KGP", "Overall": "4.0", "Content": "I love it... It kooks great. Apps, I found what I needed..My only regrets... It came wIth an Auatralian carrier(unlocked) but this limited the languages options to only English. The radio FM option was not present in this model.", "Date": "October 2, 2013"}, {"Title": "best ive had, no lie", "Author": "khaida", "ReviewID": "R5I48WKK3KGE8", "Overall": "5.0", "Content": "Runs so smoothly, I haven't had too many smart phones to compare properly, but it really is an amazing phone. I do things so much faster and I can multitask like crazy on this phone. Partly the windows system and partly b/c the phone is just great :) highly recommend, shipping was fast, all around good service.", "Date": "January 29, 2014"}, {"Title": "Great Buy", "Author": "Onyx Lee", "ReviewID": "R1BT2LUI9NPH9S", "Overall": "5.0", "Content": "This is such an awesomeeeeee phone! Moves smoothly, Love the material of the battery cover because if your phone falls it bounces, camera is great, colour looks good. Many people ask about my phone", "Date": "January 24, 2014"}, {"Title": "Phone of the century", "Author": "Raymond Burden", "ReviewID": "R16U1XTWXT6A3I", "Overall": "5.0", "Content": "I bought the phone for my wife and she was ecstatic . The sleekness and clarity is great . We will be buying more through your co.", "Date": "August 18, 2013"}, {"Title": "I Love It", "Author": "Allan J.", "ReviewID": "RIIL9IHKEWU1J", "Overall": "5.0", "Content": "excellent phone, I love the design, super thin, thin side buttons, camera quality regular, nothing special, the operating system that has many things to improve, but that has nothing to do with the phone, but rather with windows 8, but if the cell is very good .. modern, design, price and the company really work very well for me to get the phone I wanted, elcelular work with most comapañias inthe United States.", "Date": "April 20, 2014"}, {"Title": "Confirmanción receipt of product / consultation doubt about the product: International Version or is directed only speaks Englis", "Author": "Felix Lara Caña", "ReviewID": "R7S7CPP1MI6NC", "Overall": "5.0", "Content": "I agree, but product version international bid, upon receiving notice that this led to Australia, I have no ability to select native Spanish language. would have a solution to this?", "Date": "March 8, 2014"}, {"Title": "Great phone", "Author": "Miguel", "ReviewID": "R2TLFVK2PWF2EA", "Overall": "5.0", "Content": "This phone is very beautiful and windows phone 8 is a great OS. I would recommend this phone to anyone looking for a upper mid-range smart phone.", "Date": "February 22, 2014"}, {"Title": "Buggy", "Author": "Allison Stauch", "ReviewID": "R39VG1QT4HVPHG", "Overall": "1.0", "Content": "I am unsure if the problems I experienced with this phone were due to general manufacturing defects, or if the seller I had purchased it from was unethically selling me a damaged phone at a normal retail price, without disclosing damage. Within a month of receiving it, the screen began freezing, requiring a manual reset approximately twice a day. Not happy.", "Date": "January 31, 2014"}, {"Title": "Nice & Beautiful", "Author": "Guillermo A Avila", "ReviewID": "R3AE5JFTKLRETU", "Overall": "5.0", "Content": "The phone is great, considering that I switch from a BlackBerry is more than I expected for, really fast and beatiful screen, the operating system is like home. I love it. Buy it if you can.", "Date": "January 22, 2014"}, {"Title": "decent phone", "Author": "patrick cayer", "ReviewID": "R2Z7N1T7LYLIHM", "Overall": "2.0", "Content": "I bought this phone to replace my old Samsung Galaxy 2 which has ran its course... in comparison to this phone, I find the windows phone less user friendly by the placement of the buttons and the fact that compared in a Wi-Fi environment, the Samsung is always faster at alerting me a message has came in, as a matter of fact the HTC sometimes will not alert me at all that an email has arrived until I prompt it to refresh. the phone also seems to struggle with connecting to HTC store from time to time . All said and done... I've ordered a new phone, the LG G2... I hope to have better results", "Date": "January 14, 2014"}, {"Title": "nice phone", "Author": "Silvio Allara", "ReviewID": "R1QCT6GHF69C5Q", "Overall": "4.0", "Content": "nive but have not chance to change languaje, still nice phone, perfect for pictures and internet, we recomended HTC phone", "Date": "December 29, 2013"}, {"Title": "htc 8x", "Author": "ayjoshi", "ReviewID": "R2N7JWOZ4RTSPG", "Overall": "5.0", "Content": "A great phone.. One of the best I've ever owned! WP8 is highly underrated in comparison to IOS and Android, but it is a great interface!", "Date": "December 15, 2013"}, {"Title": "Internet troubles with the other carriers because it is an unlocked phone.", "Author": "Travis Honeycutt", "ReviewID": "R2QZ4QBUYF13FM", "Overall": "4.0", "Content": "I couldn't get the internet to work.I couldn't get any to really take my issue seriously and help me.", "Date": "December 6, 2013"}, {"Title": "ok", "Author": "Alex", "ReviewID": "R1YMYN3RI7ZI3V", "Overall": "3.0", "Content": "Phone is comfortable to use,but somehow GPS programs were preinstaled for Australian location and no way to change it,so i downloaded side programs", "Date": "December 4, 2013"}, {"Title": "Will recommend this product many times over.", "Author": "Arlene Ferguson", "ReviewID": "RTC4MNNTMRR2B", "Overall": "5.0", "Content": "Excellent phone. I bought one for my sister and everyone literally fights for it. No one wants to use their phone and is therefore asking for one as well. The only draw back is that I now have to either say no or get them all one. Thanks amazon for putting me in experience. LOL", "Date": "November 5, 2013"}, {"Title": "A great phone", "Author": "skaguy88", "ReviewID": "RI4WBQQNC1WA2", "Overall": "4.0", "Content": "Yeah it has some flaws, but for the most part I am very impressed with this phone.  I've had it for 6 months and its still as fast and as responsive as when I first got it, unlike my android phones which after a year always seemed to slow down to the point of being unusable. Wish this thing had an external memory slot or at least some way to get more memory on the phone, Oh and I really miss swype from my android days, other than that I got no complaints: Call quality good, reception and data speeds good, responsive touch screen and tiles, the front and rear cameras are good, not great, but good.", "Date": "September 19, 2013"}, {"Title": "Worthless", "Author": "kuri", "ReviewID": "R158L97WBV30CR", "Overall": "1.0", "Content": "I bought this phone about six months ago and have nothing but problems with it, which seems to be a symptom of HTC. This being my second phone from them, I should have learned the first time around that a pretty design is hardly worth the infuriating software.To begin, my camera went green the SECOND day after it came out of the box. I took it to an ATT store (the provider) and they gave me lackluster feedback, claiming I was just being silly; after all, when it goes green you just have to restart your entire phone! Picture moment=gone.Thinking it may be a one time issue, I relied on the HTC warranty in case of future issues. Can you see how gullible I am? Of course, the issue happened again, and is currently happening more often.Not only that, but I am now having an issue simply trying to unlock the screen. When I type the password in, it opens to a black screen that states \"resuming...\" This screen appears for a good five minutes, rendering the phone completely useless. The only option to stop this is to take out the battery, which hasn't been an easy (or fun) thing to accomplish.Like I said before, I hoped to rely on HTC's warranty, at least some decent customer service. Mistake twenty three! They are awful. I could hardly get my point across without the lady insisting there was nothing they could do.Needless to say, I am completely frustrated. Look it up online and you'll see I'm not the only one with these issues, either.This isn't even touching on the fact that the interface isn't as nice after owning it for a while and just about any app you want is NOT going to be available.Fair warning: Skip the sparkles and glitzy design, they're all this phone has to offer. I promise you, I would gladly crush this thing to pieces and feed it to rabid monkeys if it weren't my most important form of communication. This phone has proven to be absolutely worthless to me and I will never in my life recommend or purchase another HTC phone.", "Date": "September 17, 2013"}, {"Title": "Great case", "Author": "Barbara L. Logsdon", "ReviewID": "R1IW2PZV7I00U", "Overall": "5.0", "Content": "Nice case and very protective of the HTC 8X windows phone. Quick shipping. Easy to use and great color for everyone.", "Date": "November 20, 2013"}, {"Title": "It is a good phone had it been from the US", "Author": "William", "ReviewID": "R2BPVPMH8AYTO0", "Overall": "2.0", "Content": "I like the phone except that it is from Australia I found out after it arrived.  It will not do everything a AT&T; American phone will do", "Date": "August 29, 2013"}, {"Title": "EXCELENT", "Author": "JOANA MA", "ReviewID": "R2J22CV4MEE256", "Overall": "5.0", "Content": "VERY GOOD CARE. I HAD A PROBLEM AND HELPED ME TO TIME.I WILL RECOMMEND. EXCELENT. THANK YOU SO MUCH", "Date": "November 10, 2013"}, {"Title": "Good phone, bad OS", "Author": "Mohamed Elgohary", "ReviewID": "R1X8F16C1EYJL1", "Overall": "2.0", "Content": "The phone is good, solid, and nice looking. The O.S is a different story though. Windows phone is horrible and stupid. Had to return it and ordered an Android phone the next day.", "Date": "August 12, 2013"}], "ProductInfo": {"Price": "$499.99", "Features": null, "Name": "HTC 8X 8GB Unlocked GSM Phone with Windows 8 OS, 4.3\" HD Display, 8MP Camera, 1.5 GHz Qualcomm Dual-Core Processor, Beats Audio, GPS, Wi-Fi and Bluetooth - Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/41hMiVcNnwL._SY300_.jpg", "ProductID": "B00COUABIA"}}