{"Reviews": [{"Title": "Nice phone", "Author": "rpv", "ReviewID": "R2LWQFWWSBX31W", "Overall": "5.0", "Content": "Windows 8 apps are a welcome change from iOS. Among the three ecosystems, I prefer Android, Windows 8, and iOS in that order. Blackberry, what ?! For ease of use, Windows phone is really easy to use. For someone interested in a first smartphone, Lumia 720 is an excellent choice. I got access to few Windows 8 phones to review. I will try to review them, but since I have not used for a period longer than a month I am not reviewing for reliability. User interface in Windows 8 is very pleasing and this is one of best phones with awesome user experience. If you prefer great user experience over infinite hackability, aka Android, then Windows 8 phones are great choice.Nokia Lumia 720 has Qualcomm Snapdragon S4, 1 GHz dual-core Qualcomm Krait, 512 MB RAM (big minus?), 8 GB internal memory. microSD slot up to 64 GB which is awesome. Nokia Lumia 720 is the first time Nokia added an expansion slot for microSD (up to 64GB) into one of its polycarbonate builds. To access that slot you don't need to open the back. Like SIM card in iphones, you need one of those pins and push it to eject it and the microSIM card.This is a HSPA+ device, not a LTE. HSPA+ provides an evolution of High Speed Packet Access and provides data rates up to 168 Megabits per second (Mbit/s) to the mobile device (downlink) and 22 Mbit/s from the mobile device (uplink). These are theoretical of course, and in reality one can get 6-7 Mbps down and 1-2 Mbps up.Currently Temple Run is one of the Apps that require your device to have 1 GB of Memory hence I am surprised why the phone makers go in this route. Memory of 512 MB is not that expensive to put if they can sell in bulk. Microsoft says \"Memory (RAM): Some apps and features won't work on phones with less than 1 GB of RAM. To see how much memory your phone has, check the manufacturer's website or your phone's documentation.\"Screen is good, not great - 4.3-inch IPS touchscreen 800 x 480 pixels at 217 ppi. I have extensively used in the past HTC Titan I and II which is pre Windows 8 (7.5) and I was surprised Windows 8 has become more buttery smooth now. This phone has Gorilla Glass 2. Glass 3 is in the making and supposed to be even better. Stating following because this is highly underrated in reviews. From Corning's Gorilla Glass specs; WHAT MAKES GORILLA GLASS SO DAMAGE RESISTANT? The unique composition of Gorilla Glass allows for a deep layer of high compressive stress (created through an ion-exchange process). This compression acts as a sort of \"armor,\" making the glass exceptionally tough and damage resistant. Ion exchange is a chemical strengthening process where large ions are \"stuffed\" into the glass surface, creating a state of compression. Gorilla Glass is specially designed to maximize this behavior.Battery is rechargeable 2000mAh Li-ion battery. (Compared to a high end Android Galaxy Note II, which has a battery of 3100 mAh Battery.) The Lumia 720 doesn't have a removable battery cover, which means you can't access or replace your battery.Camera 6.7 MP is good enough, Bluetooth 3.0, 802.11a/b/g/n, G-Sensor, Digital Compass, A-GPS &GLONASS;, micro-USB. I was able to get excellent reception with Bluetooth headset, Jaybird Sportsband Stereo Bluetooth Headphone - Bulk Packaging - Midnight Black and JayBird BlueBuds X Sport Bluetooth Headphones - Midnight Black  All the usual smartphone stuff, facebook, twitter, music, emails etc are all excellent. It is only the third party apps that are lacking in some arenas. If you are Microsoft heavy like Office suites, Lumia phone are awesome!Apps are limited in Windows 8 marketplace. Yes, we have heard this a gazillion times. Lumia has GPS receiver with A-GPS and GLONASS support. I tried with Garmin Navigon app which turned out to be great in giving voice directions. App ecosystem is a chicken and egg situation. Unless more phones are sold, developers don't have incentives to write apps. Apps are less now, because people are not buying in big droves. Windows Phone is now (early-mid 2013) the third-leading mobile phone platform, more than tripling its market share year-over-year. One recent report I read Android and iOS are ahead in games with 162.1 and 37.4 million shipments in 1Q13 and Windows phone came in 7 million. This is more than double from previous year. I really hope for Windows 8 platform to surge ahead because having a 3 way competition with iOS and Android is good for the ecosystem.Overall, for the price point this is a great phone in the Windows family. I am really surprised Nokia has been able to turnaround quickly when I thought they are out in smartphone area.", "Date": "May 18, 2013"}, {"Title": "Great and easy to use", "Author": "Kevin Ramcharan", "ReviewID": "R2BWYYGA6W9CV1", "Overall": "5.0", "Content": "I bought this phone for a friend who was switching from the blackberry platform.  It has all the apps she needs and she loves its simpliicty.  the camera is awesome for a mid-range phone.  well done Nokia and Microsoft`", "Date": "August 17, 2013"}, {"Title": "Great device", "Author": "GAVCINDAUS", "ReviewID": "R1JDF1KFKPR0EG", "Overall": "5.0", "Content": "Arrived on time and exactly as purchased. Device itself is fantastic - too bad none of the US carriers actually sell it. But seems to work fine on TMobile.", "Date": "September 23, 2013"}, {"Title": "Greaaat phone", "Author": "Ramon Bruzual", "ReviewID": "RF66GIWXBTI0Y", "Overall": "5.0", "Content": "Forget about Android. I have a Sony XPeria and this Windows Phone...Windows Phone is so much faster and efficient, plus, I have tried two different Nokia Lumias and the battery does not die in less than a day, as it happens with EVERY Android/Iphone mobile", "Date": "December 24, 2013"}, {"Title": "My favorite cell phone so far!!!", "Author": "oscar", "ReviewID": "R36K16UQ18FJIT", "Overall": "5.0", "Content": "One of the best mid-range smartphones that Nokia has ever built using Windows Phone operating system throughout its history with the Lumia series of devices.Who cares about 512mb, I do not. Everything runs very smooth. Endowed with good specifications, excellent performance and unmatched multimedia experience in its segment. The design of the Nokia Lumia 720, in my opinion, close to perfection and shut the mouths of many (like me) who deny the polycarbonate, is robust, elegant, highly stylized and has a very bold, rounded design.The battery is awesome between 1,5 and 2 days has been their autonomy. The screen is really clear with ClearBlack and Corning Gorilla Glass 2 protection, the viewing angle of the screen is almost 180 degrees. And the best are their cameras, front and rear is too close to the 920.Is the perfect choice.", "Date": "December 23, 2013"}, {"Title": "i can't be happier!", "Author": "Fatima M.", "ReviewID": "R2L94XFULQO6XV", "Overall": "5.0", "Content": "I'm from Venezuela, I use it with Digitel and It works with 3G... and this cellphone makes me very happy. It's better than any android. I just love it.", "Date": "April 11, 2014"}, {"Title": "perfect !", "Author": "Veronique Spiquel", "ReviewID": "R1K9A6FFX76I31", "Overall": "5.0", "Content": "the product was perfect, in the good packaging (not always like that), on time. Nothing to say more except perfect", "Date": "January 4, 2014"}, {"Title": "Item defective after 3months,can't contact sellers,got charge restocking fees even return defective item", "Author": "Nhu Nguyen", "ReviewID": "R2PS92CDDINEJG", "Overall": "2.0", "Content": "Phone is beautiful .Arrived on time.but I bought on August/2013and around December /2013 the phone started have issues.Tried contact seller but no one answer.and on 01/2014 ,phone stopped working.Return back to Amazon,even item defective you still have to pay for restocking fees.This ridiculous .i Worked for CS at some retail store ,when I tem defective cust don't have to pay for restocking fees.I didnt rate bad because I got charge for restocking fees.Its just i can't contact seller,Item defective after 3months I bought ,I just want to get another phone but still got charged restocking fees.Beware .", "Date": "January 15, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "2G Network\tGSM 850 / 900 / 1800 / 1900\n3G Network\tWCDMA 850 / 900 / 1900 / 2100\nInternal\t8 GB, 512 MB RAM\nCamera 6.7 MP, 3088 x 2152 pixels, Carl Zeiss optics, autofocus, LED flas", "Name": "Nokia Lumia 720 White Unlocked Quad Band GSM Smartphone - WCDMA 850/900/1900/2100", "ImgURL": "http://ecx.images-amazon.com/images/I/41LLG59HwgL._SX300_.jpg", "ProductID": "B00CB99MXO"}}