{"Reviews": [{"Title": "Apple iPhone 4S, Does it Live up to the Hype?", "Author": "The Gifted One", "ReviewID": "RU8SSJU4T6AUW", "Overall": "5.0", "Content": "I entered the smartphone world back in 2008 staring with the Apple iPhone 3G.  Coming over from my old Sprint flip-phone, the iPhone 3G was a major upgrade and blew my mind with how much it could do.  It was amazing that cell phones had advanced into a sort of mini-PC.Fast forward to the present-day and I have now used and experimented with various smartphones, different cellphone companies, and smartphones OS's (iOS, Android, Windows, etc).  I also run my own small cell phone shop and get to play with these devices on a daily basis.  Back in the iPhone 3G days, there were only a few smartphone options to choose from.  Today there are literally hundreds of devices across several carriers.  All with different functions and designs.  I'm going to cover how the iPhone 4S stacks up to the competition, what the competition is, what the 4S can do, and what improvements it makes over its predecessor, the iPhone 4.HARDWAREThe iPhone 4S is almost identical in hardware design to the iPhone 4.  It features the same rectangular shape with the flat gorilla glass back and front screen.  The front and rear camera are in the same position.  The only visible difference on the outside of the phone is that the volume controls are slightly moved on the 4S.  The real difference in the hardware is on the inside.  The iPhone 4S uses a dual-core \"A5\" processor.  This makes it significantly faster than the iPhone 4.  The processor is the raw power that apps need in order to operate fast and fluidly without slowdown or hiccups.  With basic use, users probably won't notice much difference from the iPhone 4's speed.  The extra power boost mainly shows its worth when playing some of the more high-end iOS games and apps.CAMERAIn addition to the new processor, the iPhone 4S has an improved 8 megapixel camera.  It also now has the ability to capture full 1080p HD Video.  Unless you're a professional photographer, you will be blown away with how great the 4S is at taking pictures.  It is on par with most of the dedicated point-and-shoot cameras that are currently on the market.  Images are clear, crisp, and very colorful.  I even sold my 10MP Canon point-and-shoot after using the 4S for a few weeks.  When comparing pictures taken with the iPhone 4 side by side to the 4S, the difference is like night and day.  As for the 1080P videos, they're also very beautiful.  Just like the photos, the videos rival dedicated point-and-shoot devices and look absolutely gorgeous on the iPhone's retina display screen.  The only drawback to these 1080p videos is that they can take up large amounts of memory.  So if you plan on shooting a large amount of video, you may need to consider getting the 32GB or 64GB iPhone 4S.SIGNAL RECEPTION AND DATA SPEEDSThe iPhone 4S has been expanded to include a 3rd US carrier Sprint.  This brings your total choices to Verizon, AT&T;, and Sprint.Signal reception and data speeds will vary by carrier and location, so I'll give you some basic information about what to expect on average.  Signal reception is greatly improved compared to the iPhone 4.  The antenna problem from the iPhone 4 has been removed and the 4S uses separate antennas for incoming and outgoing calls in order to increase overall reception. AT&T; is a GSM carrier while Sprint and Verizon are CDMA carriers.  Verizon has the overall largest and most expansive voice coverage of the three, closely followed by AT&T;, with Sprint in third.  The 4S Data speeds will largely vary by carrier and location.  Being a GSM carrier, AT&T; is the only iPhone carrier capable of using the 4S's improved HSPA+ data speeds.  AT&T; users will notice their iPhones showing \"4G\" in the top left corner rather than 3G.  Though this is faster than standard 3G, do not confuse it with the much faster 4G LTE network.  The iPhone 4S is not yet capable of using that network.  Verizon is second in 3G data speeds, with Sprint bringing up the rear.  Again, these are average speeds from across the nation.  Individual results may vary depending on your location.  It is also important to note that Sprint is the only carrier that still offers unlimited data.  This may be an important factor in choosing a carrier for some.BATTERY LIFEiPhone owners have come to expect excellent battery life from their devices.  Previous iPhones have ranked among the most impressive in terms of battery life compared to rival Android devices.  In the past each new iteration of the iPhone had better battery life than the previous device.  With the 4S however, the overall battery life is about the same as the iPhone 4.  Apple claims this is mainly because of the dual-core processor used by the 4S as well as the more demanding iOS 5 software that is included with the iPhone 4S.  Due to this, there were some widespread complaints about the iPhone 4S battery life initially.  Apple has since addressed the issue with their iOS 5.1 update.  The iPhone 4S now ranks among the top smartphones in overall battery life.  I can easily get through a full day on one full charge of average use.SOFTWAREUsually when comparing the iPhone to other phones, it comes down to the software.  There is a big ongoing debate among techies between the iPhone's operating system \"iOS\" and Google's \"Android\" operating system.  It's comparable to the famous PC vs Mac debate.  Rather than type a whole page comparing the two, I'll just cover a few basics.  The main difference between the two is choice.  Customize or not customize.  iOS is more fluid and crisp out of the box.  All iPhones/iPods/iPads use this standard OS.  Less powerful iOS devices are often able to move as fast or faster than more powerful Android counterparts.  However, major modifications and customizations of Apple's iOS are not possible.  The standard 4x4 row of icons is what you will get.  Android offers tons of customization options.  This is great for advanced tech users, but can be overwhelming to novice smartphone users or those not really interested in editing and customizing a lot to get the device to do what they need it to do.  I usually recommend iOS to customers new to smartphones due to its more simple and easy to use interface.  If you like customizing and making your the software on your phone look different from everyone else, I recommend an Android device.The other major software difference between iOS and Android is the Apps.  The Apple app store still has by far the most support and overall apps from developers.  Most developers create an app for the iPhone first and port it later on to Android, or sometimes not at all.  From personal experiences with both, I can say that many times the iPhone version of an app usually runs better or has more features.SIRI Personal AssistantUnless you've been under a rock for the past few months, you've heard of the iPhone 4S's SIRI personal assistant software.  Apple touts it as a feature that allows you to speak voice commands to your iPhone and SIRI will do whatever you ask it to do.  Well it can do some things, but not quite everything.  SIRI is great for finding places for you.  You can say simple things like \"I'm hungry\" and SIRI will open the Maps App and show you the location of all restaurants in the nearby area.  You can also do things like tell it to play a certain song or artist from the music stored on your iPhone or ask it the Weather forecast for any given day.  SIRI can also be pretty entertaining when asked random conversational questions.  Questions such as \"How old are you?\" will cause SIRI to respond \"Does this concern you?\", \"I didn't think so\".  Or saying silly things such as \"SIRI I love you\" will cause it to say \"I'll bet you say that to all your Apple products\".  Overall it's a pretty nice added feature, but not a major selling point at this time.  It's limitation is that it currently is only integrated with the standard apps that Apple provides on the iPhone.  Once it is integrated with more of the third-part apps, I can see it becoming a seriously useful feature.Overall I would definitely recommend the iPhone 4S.  From the sleek hardware design, the beautiful camera, and the very large Apple App store, it's my top phone at the moment.  The iPhone 4S has the battery life to last most people a full day and in terms of overall speed and ease of use, it is currently among the best available.  The only people who I would not recommend the 4S to are current iPhone 4 owners.  With all of the iPhone 4S's improvements, I don't feel like they're significant enough to spend more money to upgrade from your iPhone 4.  You will be better off waiting for whatever iPhone Apple releases later this year.  However if you're looking to purchase your first smartphone, tired of your old Blackberry or Android device, or just have an older iPhone 3GS or 3G, I would strongly recommend getting the iPhone 4S if possible.  Using a smartphone has never been easier.", "Date": "March 23, 2012"}, {"Title": "Siri, Call...Siri, Send An E-Mail to...Love This new iPhone", "Author": "Vincent E. Martin \"Darkbard\"", "ReviewID": "R1WSYPW281JIVZ", "Overall": "4.0", "Content": "First a confession: I make my living installing, configuring, and supporting Microsoft products, and I even own a Windows Phone 7, but I am fast becoming an Apple convert.  My portable MP3 player is an Apple iPod Touch (4th) Generation and I am on my second iPad!  The Apple name has become known for innovative products that just work and work well. Sure they're a little more expensive than their competitors, but the company's product are well worth the entry price.So, even though I own and use a Windows Phone 7, I had to spring for an Apple 4S 16GB phone not long after it hit my local Best Buy.The \"iPhone 4S 16GB\" FactsThe \"iPhone 4S\" is the latest and greatest smart phone from Apple. The top-of-the-line unit features an Apple A5 Dual-Core processor, IOS 5.0 & iCloud, all new 8MP camera and optics, 3.5-inch (diagonal) Retina widescreen Multi-Touch display with 960-by-640 pixel resolution.  And introducing Siri, a truly remarkable voice recognition system that has thus far lived up to its considerable commercial billing.The 4.9 pound iPhone 4S is the same size and weight as its predecessor the iPhone 4, but is an improvement over its older sibling.  Other new features include: 1080p High Definition (HD) video recording, all new optics, Notification Center, Photo Stream, iMessage, iCloud, and Twitter integration all made possible by IOZS 5.0.No matter what hardware version (16GB, 32GB, or 64GB) you chose the Ultra-Portable, iPhone 4S is a simple device with very few moving parts.  The power button sits on the top of the device on the right, while a standard 3.5mm headphone jack is situated on the top to the right left of the power button.  Along the left edge of the ultra-thin (0.37\") iPhone 4S you will find the vibrate/sound slider switch along with the volume control buttons.  On the bottom of the unit you will find the proprietary USB power port. And since it is proprietary you cannot plug a USB memory stick into it, but with the provided cord, you can plug it into your computer and sync with iTunes and charge the device.  There is also a standard 120 volt plug-in so you can change the unit via an outlet.Siri Likes MeBefore I picked up the iPhone 4S a friend and colleague of mine purchased one.  When I asked her about it she stated that Siri \"was not her friend!\"  When I asked her to explain further she stated that about the only thing she could get Siri to do was wake her up in the morning; the voice commands were just not producing the expected or desired results.Needless to say I was a little apprehensive about Siri myself, but my experience with the technology has been vastly different from my colleague's.  Siri has never failed to deliver for me, not once and I am in love with the convenience the technology represents.What is Siri?  Siri is billed as an \"intelligent assistant that helps you get things done.  All you have to do is ask.\"  Siri is voice recognition software taken to a whole new level.  Now the technology has been around for years, but it has never been perfect and never heavily commercialized, but the technology is now ready for commercial debut in a big way.With Siri I can make phone calls, ask for directions, send text messages, dictate and send e-mail, schedule meetings, set reminders, locate hotels, restaurants and other commercial establishments in a given location, etc., all of which I have done successfully with Siri.  So, I can only conclude that Siri likes me!iCloudApple IOS 5.0 ships with Apples' newest innovation iCloud a technology that allows one to sync all of your various Apple devices (iPhone, iPad, iPod) wirelessly via the \"cloud.\"  iCloud \"stores you music, photos, electronic books, apps, mail (only @me.com e-mail), contacts, calendars, and documents (only iPage documents). Once turned on it works automatically across devices.  Add something to one device and it will show up on the other device when it syncs.Now this does not mean that all of your music will suddenly appear everywhere.  Default space for iCloud is only 5GB (more space can be purchase if needed; 10GB: $20.00/Year, 20GB: $40.00/Year, and 50GB: $100.00/Year), and only purchased music is synced via iCloud unless you sign up for iTunes Match a technology that allows you to access all your other music from iCloud -- including music you've ripped from your CD collection.  Price: $24.99 a year and requires IOS 5.0.1.Setting up iTunes Match is a three step process and takes a while to complete.  All of your various devices will need to be setup for use the service once it's completely set up.  I signed up for the service and it works rather well.First Impressions:I really, really like my new iPhone 4S 16GB with a couple of reservations; 1. the phone doesn't always place a call the first time a number is dialed.  When this happens I have to hang up and dial again.  Another gripe is one I share with most iPhone 4 users: battery power, or the lack thereof.  The unit is only good for a day of moderate use.  Standby time will last a little longer, say 48 hours.Like all Apple devices setting up Wi-Fi is easy enough; when turned on the antenna continually looks for new Wi-Fi connections and once connected, it remembers and automatically connects to the Wi-Fi network when next encountered.What make the iPhone so useful, far and away more than any phone I have ever used, are the Apps.  And iPhone ships with plenty.  New with IOS 5.0 is iMessage a texting app that speaks via e-mail address or phone number.  Texting is automatic between iPhone, iPad, and iPod.Heat & NoiseThere is neither of both; end of story.ConclusionsThe iPhone 4S is a winner in my book, despite the lack of a \"5\" moniker.  The combination of light weight, functionality, and connectedness is far better than phones I have used in the past.  The Windows Phone 7 comes close, but falls short of the mark in several arenas.  And Siri, I like Siri and Siri likes me.", "Date": "December 20, 2011"}, {"Title": "I LOVE APPLE but lukewarm on iPhone 4S", "Author": "wcorcoran", "ReviewID": "R3JWJ66A3OQEUT", "Overall": "3.0", "Content": "I love my Apple Products and will continue to buy them.  However, am a little disappointed in the new 4S.  The mapping features have a lot of inaccuracies.  Siri can sometimes help, but is mostly annoying.  She stopped being funny a long time ago.  I have four kids that can get smart with me.  If she was more helpful, it wouldn't be as annoying.  But, in all honesty, I find it easier and less distracting to simply use the internet.  An important footnote.  If you are new to the iPhone, I think getting the 4S is a good idea.  It is the best of the iPhones.  But if you have an iPhone 4 (like I did), you might just want to wait until the next generation!", "Date": "January 13, 2012"}, {"Title": "Excellent little device.", "Author": "Kelsey Beaudion", "ReviewID": "R3O1YTXLJ4WX8W", "Overall": "4.0", "Content": "Before I begin, I have to say that I did not purchase my iPhone 4S here on Amazon; instead, I upgraded through AT&T;'s website, so I cannot speak for the speed of shipping, packaging, etc.I upgraded from the iPhone 4 because my fiance dropped it in a bucket of bleach water.  Despite the fact that it did dry up and work again, the speaker when making phone calls was completely shot.  I was hoping to hold out until a significant change in the iPhone lineup came out, but things do not always go as planned - I am sure you all know that story.The call quality seems to be much better than my old phone, as long as I have at least two bars or more of signal, even though they may not differ much in the looks department.  Friends and family have also reported being able to hear me better as well.I LOVE the camera.  The picture clarity is unbeatable.  Unless you are an aspiring photographer, I really feel as though I do not need to carry around a camera, too.  Since you can now double click the home button to get the camera to launch, it does not take nearly as long as it used to.  Love that feature!  I was initially concerned that they had removed the zoom feature, so that would have been my only complaint with the camera.  However, while playing around with it on, I noticed that if I touched two fingers to the screen and moved them outwards in opposite directions, the zoom option appeared.  I decided to test it out and take a few pictures, and the quality is still great even zoomed in!  Pretty impressive, considering when I zoomed in on my old one, the quality diminished significantly the more I zoomed in.iCloud is a fantastic addition, too.  I love being able to track my iPhone in the event it gets lost, though I surely hope it does not!  It is quick and easy to locate, if necessary... and yes, I have had a blast testing that out as well.I have had no issues with Siri.  I do have a pretty strong southern accent, so I find myself having to think about what I am saying and adjust the way I say some words.  Siri almost always gets what I say right.  And I love being able to set reminders for myself... being forgetful is definitely disadvantageous - especially for me.* Why I took off one star.I took off a star because battery life is very important to me, and it seems that this phone does not live up to my expectations.  I do not do much on my phone as I work 8am-5pm every day, but I do check Facebook every now and then and I play Tiny Tower (not really enough to make a huge difference).  With that being said, I do expect the battery to drain because of this - I am not expecting a Super Batter that only loses 10% throughout the day.  However, when I get home around 5:30pm and have 5% battery left when it hardly got used, that's not entirely acceptable to me.  Through a little research, though, I learned that if Location Services was turned on, it drains battery life even if you are not using it.  I have not noticed much difference even when I have Location Services off, so I really cannot comment on that.Over all, Apple did a great job upgrading and fixing many issues I had with the previous models of iPhones.  This is my fourth iPhone, and each time I have upgraded, I have been pleased.  This is no exception.  It is a great little device full of everything I expect.  I am happy.  While this phone may not be for everyone, it is great for me and I absolutely love everything it can do.", "Date": "February 13, 2012"}, {"Title": "Siri and iCloud make me lazy...", "Author": "M. Hagler", "ReviewID": "R39N2P777SYK44", "Overall": "5.0", "Content": "I did not want to upgrade to the iPhone 4S.  My 3GS was fantastic, did everything I could want it to; why spend the money?  However, the battery charge port on my old and trusted sidekick started to have problems, and I was eventually left with no other choice.  In the beginning the differences seem subtle, and I missed the 3GS.  While the screen sports a much higher image quality, it is also slightly smaller than my fat fingers expect it to be.  Otherwise I noticed no difference on day 1. In a couple of hours I adjusted to the screen size and we were rolling.  The retina display does make a difference, and you will notice as you upgrade apps and spend time with the phone.  Pictures look much better, web pages are less eye straining; it's a good experience.  The camera is much better than my 3GS; the 4S sports an 8mp HDR camera that captures portraits and sunsets with ease and quality comparable to a high-end point and shoot camera.  It is great for days I want to leave my DSLR and camera bag behind.  There is a flash built in, but you will find yourself using that more as a flashlight than anything (there's an app for that).But we haven't gotten to the feature that really sets the 4S apart from its' competitors and successors.Siri.I can not say enough how much I love this feature.  \"Send my dad a message saying I found his wallet\".... and it's done.  \"Where is the nearest place to order chinese food\"... and there's a map and a phone number.  Driving and receive a text message?  No problem.  \"Read me that last message...\" done... \"and reply with _____\"... and done.  You do need access to signal or wifi, but any more where do you not have one of these things?  Initially I did not use this feature much, but as I have grown accustomed to having it at my disposal and learned how best to command it for proper results I have become increasingly inclined to use Siri over navigating between apps and typing.  There are a few things I think Siri should be able to do that it can't (like enable/disable bluetooth, wifi, location settings, etc.), but as this software is in beta I can't be overly critical.Buy this phone if you don't have an iPhone.  I'm not a fan boy and this is the only Mac hardware that I own, but it is a great piece of equipment that will make your time on your phone more productive.If you have an iPhone 3 or prior model, buy this phone at your next upgrade.If you have an iPhone 3GS or 4, you may as well wait.  Siri is great and the camera is nice, but the differences in processor speed and screen resolution are not, while noticeable, mind blowing.  At some point there will be another major hardware overhaul.  Wait for that.Either way, fantastic phone.", "Date": "April 25, 2012"}, {"Title": "Samsung Galaxy -> IPhone what a difference!", "Author": "Kathryn Peer", "ReviewID": "RSKWKGRYN4U1L", "Overall": "5.0", "Content": "I did use a Samsung Galaxy before but got frustrated by:Unstable Software:To many times the system got frozen. I had to restart my phone, sometimes even had to take the battery out to do the restart since the Software restart didn't work anymore.Sometimes the Phone also freezes for a short time while e.g. playing a game.The web browser crashes to many times.Design:Actually not the biggest issue for me, but the Samsung Galaxy Case is way beyond the Quality and design of the IphoneSo I bought an iPhone instead and I didn't regret it for one second.-> Software and Hardware really fit together. Way less crashes and much smoother operating!-> Case looks way better.Should have bought an iPhone instead of a Samsung already a long time ago!", "Date": "July 26, 2012"}, {"Title": "Incredible improvement over my Android phone", "Author": "Todd Justman \"Regional Man of Mystery\"", "ReviewID": "RVUC15YUDGHLU", "Overall": "5.0", "Content": "I suffered over a year with a Samsung Transform Android phone.  I have an iPod Touch but I wanted to try an Android for cost as well as Sprint's unlimited data plan.  I found that the Android didn't do a good job as a music player like the iPhone.  I had trouble finding apps that always run like on an iPhone.  I found that unlike the iPhone, doing simple things like powering on and using the GPS was laborious and very slow.The iPhone simply works.  It turns on quickly and turns off.  The GPS is not always in use but it's always ready and providing location data.  The form factor is elegant and substantial.  The iPhone interface is wonderful.  Having a phone integrated with your apps, music, and video can't be understated.  Take it from someone who tried to have an iPod and a smartphone.  You're so much better off having everything in one device.The Androids just have varying levels of hardware capability, whereas with Apple they control the hardware and the app store so everything runs fine.  Also, unlike Android, you have one memory store for everything.  No more moving apps to an SD card before running out of phone memory, and then finding out the app publisher disallows you from moving the app to the card!  With an Android you find yourself needing to do system code changes to get admin privileges to do the things the phone should do itself, all the while risking turning it into a \"brick.\"  Unless you want to play around with your device all the time, get an iPhone if you just need something to do a job fast and neatly.A few words about Siri: she mostly works well.  I find I use her when I want to find something out but am driving or unable to type, or just don't feel like opening Safari and typing something in a search engine.  I should use her more often.The only thing the Android had better was Google's navigation program.  Apple's map program isn't a good GPS.  Fortunately there are two programs you can download that are in Apple's Top 25.  The one I chose is comparable to Google's GPS program, and it has the traffic integration.  The only problem is that it's subscription-based.", "Date": "March 31, 2012"}, {"Title": "Thoughts from iPhone 4 to 4S upgrade", "Author": "James Maeng", "ReviewID": "RPEERCJL8YNZR", "Overall": "4.0", "Content": "I have few thoughts for those that have an iPhone 4 and curious about doing an early upgrade to the 4S. I was able to find a deal on iPhone 4Ss through the online classifieds and sell my and my wife's iPhone 4 for a very good price so in the end it cost me about $120 in the end.Primarily the camera has been upgraded to 8MP and improvements with the lens. In real life usage compared to the 4, I noticed sharper photos and better exposure and it's taking more time away from my point and shoot and SLR. Video quality has improved dramatically, there's much better clarity with 1080P, less hunting with the autofocus and image stabilization makes it slightly less jerky when moving. It also does startup faster where you don't have that 4-5 seconds of looking at the closed shutter, but perhaps 1-2 seconds pause. We take a lot of pics and videos of my son, so having the better camera really is nice to have.In terms of CPU speed, the iPhone 4S is noticably faster but hard to describe because it's not that the same apps won't run fine on an iPhone 4. It's mostly just snappiness in starting up apps, navigating menus, games, etc and this makes is a pleasure to use. The 4 has a small delay once in a while after installing iOS5 that makes you wish it has just a bit more power and this delivers.The other aspect of speed is the improved 3G speeds which is really hard to compare between cities and locations. What I can say is that in areas of strong signals, you probably get the same speeds as the iPhone 4 as the bottleneck tends to be the cell carrier. However if you're like me you're not always in the best areas, my office tends to get awful signals due to the walls and I'm on the edge of getting between No Service and I've mapped out my desk to one location I can get 2-3 bars with 3G. The 4S doesn't give additional bars so don't assume that if you had a dead zone, that the 4S will solve that problem. However for weak signals, my speeds are significantly faster with 2-3 bars, going from a barely usable 0.5 Mbps to 2.5 Mbps. Since I'm at my work the most, I found this made the iPhone more useful and productive. I can download podcasts, stream videos, install apps, etc.The last point from upgrading to the 4S is piece of mind. I was out of warranty with the 4 and buying new provided me another year of support and as well I reused my case which was $30 saved.Again, the list is small and sounds like it's not worth upgrading, but I  really love using the 4S, it really does feel this refined and perfected where the 4 was 80% where they wanted to go. This is the sleeper model similar to performance cars, STI for Suburu, SRT for Chrysler, M3 to BMW, AMG to Benz, etc. It's not for everyone to upgrade but if you use an iPhone everyday, you won't be disappointed.", "Date": "February 14, 2012"}, {"Title": "Best phone on the market.", "Author": "MTH", "ReviewID": "R23LLFFORDPVDP", "Overall": "5.0", "Content": "AWESOME phone. like other people, i LOVE all the previous iphones i've encountered. and this is one of them.I do have to admit, i'm a bit biased because i'm a fan of apple, so i seem to like everything good about the product and omit the bad things.if you're still deciding on an iPhone 4, 4s, or a 3gs, here's how it goes:only big difference i noticed in the iphone 4 and 4s is that the camera is better, faster loading(I tested), and of course, who could forget the sexy robotic voice, SIRISIRI: Honestly, Siri isn't that smart. she repeats everything she said. her favorite line: \"i don't know what you mean by....\" so, if you're thinking of the iphone 4s JUST for siri, then i suggest you wait for the iPhone 5, they'll make siri better, or add more money worthy features.CAMERA: I LOVE the new camera they put in. the aperture was completely flawless, just like i took my pictures of a $1000 camera. it's just amazing. HOWEVER, I am a camera maniac, as i've taken photography classes before. the iPhone 4 isn't that bad. If you don't take a lot of pictures, or just isn't a professional camera fanatic, then you might want to think twice about buying it for that purpose. again, i suggest waiting for iPhone 5.SPEED: it's not that big of a change. i had two iPhones side by side to see the difference. you'll barely notice it. DEFINITELY do not choose the 4S over the iphone 4 just for the speed.", "Date": "January 11, 2012"}, {"Title": "iPhone 4s", "Author": "Cogy", "ReviewID": "R4K5UVBT7XZ43", "Overall": "5.0", "Content": "I've had my 4s for about 3 weeks I always keep it in a bumper cover and have a screen protector on it.  That being said I've dropped it several times one of which was on the metal edged coaster at work which only tore the screen protector, didn't scratch or even mark the glass in any way, as far as I'm concerned it's a tough phone considering it's made of glass.  I love Siri she helps me often! I've had the 3g, the 4 and now the 4s gotta say the 4s is my fav.", "Date": "December 10, 2011"}, {"Title": "Amazing", "Author": "Jebediah", "ReviewID": "RVS9D6ELLGUXU", "Overall": "5.0", "Content": "Two weeks ago I bought my very first ever smartphone: the iPhone 4S. I didn't even need to think about which smartphone I wanted. I had been dreaming of getting an iPhone since I knew what an iPhone was. Not only is it everything that I have ever imagined it could be, it's so much more. Did you know it can be a compass?? Opening that app blew my mind (my house faces North, btw).And the GameCenter! I spent two hours sending friends requests to like, 200 people who play Happy Street. Do you even know how many Flooz I have?? (155) (Also, only 39 people friended me back. Whatever. I'm over it.)And can I just tell you how cool I feel when I use it? It's like how smoking makes you cooler except it's actually true. You really are cool if you have an iPhone. (My sister-in-law has a Droid and she doesn't have nearly as many friends in Happy Street as I do.)Siri is the coolest. Sometimes she has trouble understanding what I say, but just speak very clearly and she won't have a problem. The one downside is she won't pick up on my three and a half year old niece's voice (\"Siri, do you know what my daddy's name is?\")And the screen! It is so f'ing nice to touch. My finger just glides across it. It's like running your finger over a cloud. A cloud full of puppies.Also, the battery life is quite good. I can play games and surf the web during my entire three hour class, and the battery does very well. I don't know if it'll hold up for long (though I can update you during the fall semester). I do have to charge it every night, but that's not really an issue since I'm sleeping.The rear camera is super nice. My pictures are always very clear. There is also a flash in the back. The front camera could be better. The pictures are a little grainy, but they're still good enough to put on Facebook.Literally the only bad thing about this phone is I can't take pictures of myself using it and looking cool.", "Date": "January 28, 2013"}, {"Title": "Excellent professional smartphone, the whole is greater than the sum of it's parts", "Author": "Jaffrey W. Ali \"Relentless Pursuit of Technology\"", "ReviewID": "R42H8OAWFFFCU", "Overall": "5.0", "Content": "While I have owned an iPhone 4S for around a year now, the purpose of my review is for someone who may be considering the iPhone 4S as a current buy. Getting straight to the pros and cons of the iPhone:1. Extremely well balanced feature set that makes it ideal for everyday use. The redesigned antenna works very well even in low signal areas, the music player, the web browser, the email client, the App Store, the camera and battery life are all best in class in my opinion.2. Out of the Apple services, the Maps app has a very good UI and is good for turn by turn navigation but the points of interest database isn't as good as Google - BUT you can always use Google Maps over the browser if you like so that is NOT a limitation in my opinion, AirPlay is very useful if you also have an Apple TV at home, iMessage and FaceTime are not unique in that other platforms have similar inbuilt apps, but the iPhone 4S implementation is simply better because the UI is much more straightforward and it never ever locks up the device or causes it to crash.3. Siri works very well for voice commands and has gotten much better of late. iCloud is also another well executed service if you want to store music and movies in the cloud and then access it from any Apple device. The iPhone 4S integration with iCloud is very good and with it, you don't need to ever connect an iPhone 4S to a computer. I have never connected mine to a PC in a year.4. The screen is very clear and is easily visible even in direct sunlight - even at max brightness the iPhone 4S has more than acceptable battery life. All the other large screen phones I have used, at max brightness the battery life start declining at very fast rate. In a nutshell, with the iPhone 4S one is not compromising acceptable battery life for screen brightness.5. While some may find the Apple UI boring, the advantage is that the UI is not intrusive and let's a user focus squarely on using apps and not on fiddling with features and functions on the device.6. The size is smaller than the typical Android phone, but the iphone 4S has a very good overall feel and for my daily use it is very convenient. I guess if you play a lot of games then a larger screen may be acceptable, but as a daily smartphone the iPhone 4S is extremely well designed aesthetically and in size. The iphone 4S is completely one hand operational without any issues whatsoever. The phone is also very well balanced to hold.7. The glass back is likely to break and that is probably the biggest drawback of the iPhone 4/S design. If you are someone who drops their phone then you simply have to get a bumper, with the bumper the phone is pretty much shatter proof. I have dropped mine with a bumper several times and the phone is still scratch free.In my opinion, the iPhone 4S is a true classic. It will easily meet the needs of most people who use smartphones. It is extremely well balanced with features and design. I didn't really mention games as a strong point, but the Apple App Store easily has the most compelling games available for a smartphone even if the screen is smaller on the iPhone. In the end the difference in screen size between the iPhone 4S and iPhone 5 is only half an inch and between an iPhone 4S and the larger Android phones it's only an inch or so. In terms usability, the extra screen real estate does not matter much especially since the UI on the 4S is so smooth and responsive and zooming in and out is not an issue. It is much worse when you have a larger screen but the phone's UI stutters and apps crash and you need to remove the battery every now and then to reboot it.The iPhone 4S is one of the best consumer electronics products I have ever owned. It is so well executed that I believe it will be considered a classic. The 4S is a much better phone than the 4 and justifies the upgrade, but in my humble opinion the jump from 4S to 5 is much more subtle in terms of what more the phone can do.", "Date": "December 4, 2012"}, {"Title": "Iphone4s vs Galaxy epic 4G", "Author": "Gerald Brown", "ReviewID": "RBJT409E3L89A", "Overall": "5.0", "Content": "i had both phones and at first i thought the galaxy was gonna be better cause it had the larger screen and the swype text mode and other little featuresbut......the iphone 4S is actually better i was shockedthe 4G that the galaxy has is very fast.....its faster than the iphone 4S but its not that much faster.........the screen on the galaxy is bigger than the iphone...however the iphone is still the better phonethe reason why is because the set up.......iphone has 1 home screen button that brings you back to the main screen it is much easier to navigate through the iphone than the galaxy....if i need to get to something fast i can do it much faster on my iphone than on the galaxy...also if i need to do something without looking on the screen i can use the siri function which although it is overrated , it is very useful sometimes....also because there is a bigger screen on the galaxy you also have more clutter..which means you have to fish through icons to find what you want to get to...the video display and pictures on the iphone are amazing...OverallAndroid has nice phones but there are sometimes too much stuff on them......keep it simple with the iphone you will be happier...easier to navigate on the iphone 4S", "Date": "May 15, 2012"}, {"Title": "Great phone! but seller not good at all!", "Author": "G. Fleury", "ReviewID": "R38IZUCCJSY070", "Overall": "5.0", "Content": "The phone is a great phone, Although the phone that was bought from Amazon seller sent me a used phone, when a new one was purchased. It took a month to get my money back.", "Date": "July 19, 2012"}, {"Title": "Unexpectable thing on package", "Author": "Amy", "ReviewID": "RGYYCI17EMVJ0", "Overall": "3.0", "Content": "The iphone 4s works well after I bought it two weeks ago. The only unexpected thing was that the box containing iphone was opened. The seller said that it's because they checked the products and its accesseries before delivery. Additionally, I had to ask the receipt from the seller. I was worried about it. Will update news soon.", "Date": "June 30, 2012"}, {"Title": "Solid Phone", "Author": "Wayne Luke", "ReviewID": "R3C72A85CBWI9G", "Overall": "5.0", "Content": "So I got this right before a trip two-day trip to Disneyland. My wife has an iPhone 4 and my teen kids recently each received the iPhone 3GS for Yule 2012. I was worried about battery life but the phone made it through each day with moderate use of texting the kids and my parents about meetups, checking and posting to Facebook and taking pictures throughout each day. We also used an app on it to check wait times for various rides to make the most of our visit. The battery lasted from 7 a.m. to midnight the first day. Charged overnight at the hotel and no problems the next day.It has replaced my iPad for a lot of things because it is easier to carry around on the go. Will probably flash the iPad to allow it to be a household controller, media device. All in all the iPhone 4S is a much better device than my previous Blackberry and I am very happy with it. The only disappointment is Siri. It just isn't as helpful as they make it out to be. Can't dock the phone because of this though. Just isn't for me. I do love the dictation features and use those more than Siri so all is not lost.", "Date": "April 15, 2012"}, {"Title": "Amazon non ethical trading", "Author": "Paulo G. Valente", "ReviewID": "R2O079UN73CEGF", "Overall": "1.0", "Content": "I am an old APPLE customer, I had and have Ipods, Iphone, Ipads etc.I recently bought through Amazon a Apple iPhone 4S 16GB - AT&T; - Black [Unlocked Phone] Condition: New Sold by: WorldWide DistributorsTo my surprise this phone was delivered LOCKED, in spite the Amazon offer was UNLOCKED as above.I did complain to Amazon, which denied help also in appeal, saying that I complained late.I did talk and write to AT&T; to help me unlocked the Iphone, and they finally said they do not unlock phones sold by AmazonSo Apple is the maker of the iPhone and I am the customer, but between us there is Amazon and AT&T; doing what I call non-ethical distribution of Apple's product (selling UNLOCKED and delivering LOCKED phones).I have all documents (invoices, orders, e-mails with me.After this I will quit being a Amazon client.Paulo G.ValenteRio de Janeiro Brazil", "Date": "July 28, 2012"}, {"Title": "Recently switched from Android: iPhone is wonderful, but has flaws.", "Author": "Johnny Walker", "ReviewID": "R3HNKYF3DWEX2P", "Overall": "4.0", "Content": "I recently switched from a HTC Desire (Google Android) to an iPhone 4S, and I have finally got to experience what the fuss is all about. Firstly it's a beautiful phone, both externally, and in terms of interface. Everything is gorgeous, smooth moving, and clean looking. The interface never becomes jerky or slow, unlike with my Desire, and although that sounds like a minor thing, it actually makes a huge amount of difference: Just using the phone is enjoyable, everything feels really \"solid\".The keyboard is also FAR improved to the one I had to suffer with for two years on my HTC Desire. I've only had my iPhone a few days and I'm already a fast typer than I ever was with that phone. Well done, Apple!That said, there are few things that my HTC Desire did better:1. The Desire came with an LED indicator that would flash green if I had any updates. That meant that I could glance at my phone across the room and see if I had any texts, missed calls, emails, Facebook updates, etc. It was very handy. The iPhone 4S has a feature to use its flash in a similar manner, but it actually only flashes the instant you receive a text or email. Then it stops, meaning it's pretty useless.2. The Desire came with a way to control the cursor. The \"home\" button on that phone also detected finger movement. If I was typing something and I wanted to go back a few characters, I could just move my thumb across it, and control the flashing cursor between the letters. It was extremely useful and I find myself trying to do it on the iPhone. Unfortunately on the iPhone all you can do is hold your finger on the screen and drag the cursor to where you want it to be (you also had this option on the Desire, but I never used it because the other way was far more efficient). It's a little glitchy and a lot slower. Shame.3. When I wanted to search the internet for something with my HTC Desire, I could just press the \"Search\" button on the case. It was quick and intuitive. On the iPhone it's astonishingly laborious: You must go into the web browser and select the \"Google\" bar on the top right hand corner of the screen. It's not THAT bad, however, because there's a shortcut that allows you to zip up to the top of the screen.4. Although the scrolling is wonderfully smooth on the iPhone (certainly smoother than the Desire was), it's a lot slower. On my Desire I could \"flick\" the screen with my finger and it would keep scrolling on its own, with its own inertia (it would eventually slow down depending on how fast I had \"flicked\" it). This was fantastic when all you want to do is check for new comments on a blog post. You could quickly and easily scroll down to the bottom of a page, without any finger strain.On the iPhone the scrolling stops soon after you let go, making navigating long pages a very arduous experience indeed.5. On top of the lack of an LED indicator, the iPhone is also lacking with regards to keeping you informed of updates. On my HTC Desire there would be an icon at the top of the screen, no matter what I was doing, letting me know if I had any updates. A different icon for each update: An email, a text message, a missed call, a Facebook update, a new Twitter message, etc.On the iPhone you get informed, but then it's gone. It's hard to explain how this isn't as good as the Android equivalent, and I understand that it probably sounds minor to those who have never used an Android phone.Update: I've actually gotten used the Apple way of doing things, so while it may jar for those who move across, chances are you'll adapt like I have.6. One of the best Apps on the Android is a free one called \"FoxyRing\". It has a terrible name, but it's brilliant: It automatically adjusts your ring/notification volume for you, depending on the loudness of the ambient sound around you. Just walked into a Library? It will turn the volume down for you. In the middle of a gig? It will turn it up for you. All done automatically. You can also set it so that your phone automatically goes to silent at a given time, every evening (say 11pm) and goes back to normal (i.e. automatically adjusting your volume) at 8am. In other words, I never had to worry about my phone's volume, it was just taken care of.Sadly Apple do not allow Apps to have this sort of control, and they don't have the equivalent system built in to their OS. It's a real shame because I think it will eventually become standard in the future for people not to have to worry about their phone's volume.Anyways, this is a minor concern, because a lot of people won't have that particular App.So ultimately, while there are flaws with this phone, they don't ruin the experience. It's a little shocking to me, as a new user, that Apple has seen fit to focus their attention on gimmicks like \"Siri\" (I don't know anyone who really makes use of it), when there are could be some great improvements made to the interface.Would I go back to an Android? Nope. At least, not right now. The experience on the iPhone, however frustratingly idiosyncratic at times, is still an enjoyable one. The little graphical touches, the slickness of the presentation, and the simplicity of use, all make it really satisfying. After the many quirks of my Android phone, it's really nice to have a phone \"that just works\". It may not do exactly what you want it to do, but what it does do, it does extremely well.Final note: Be prepared to spend a bit extra on a case and/or screen protector. Not only is the iPhone notoriously fragile and prone to smashing if dropped (I know about five people with cracked screens), it's also pretty slippery in your hand compared to other phones. A rubber case will make it less likely to take a tumble out of your hand, and a screen protector will keep that glass screen scratch free. It's an unfortunate hidden cost, in my opinion.Additional note: If you're an Android user, you may also be shocked to discover how lacklustre Apple's support for Facebook and GMail are. Both of these apps are not as good as their Android counterparts at the time of writing, and there's no way to \"link\" phone numbers to Facebook accounts. Another annoying, but minor, quirk of the iPhone to be aware of.", "Date": "May 6, 2012"}, {"Title": "Nightmare to Set-Up; Fun To Use Afterwards", "Author": "Eric K.", "ReviewID": "R3TFU8MWPT617U", "Overall": "3.0", "Content": "Let me begin by saying that setting up the iPhone initially is a nightmare that can take -- literally -- days.  I can't even imagine how horrifying it would be for someone who isn't familiar with network connections, programming issues, etc.  There's this connection, that connection, linking it up to iTunes on a computer, contacting Sprint to resolve issues, contacting Sprint again to resolve more (or the same) issues.  I had better luck with reception in the 1970s with a sheet of tinfoil and a TV antenna.  I've had the phone for over a week, and I'm still contacting Sprint to resolve set-up issues.The iPhone activated in stages.  An hour after \"activating\" it online (and connecting it to iTunes), the phone part started to work so I could make outgoing calls.  Two hours later, the Internet kicked in.  Three hours later, texting became available.  Why it's not \"plug and play\" baffles my mind in today's fast-paced, instantaneous world.Then came issues with the phone calls and texts.  We finally discovered that it was because the Airave that Sprint sent us because we have poor Sprint reception at our house (in a heavily populated neighborhood) wasn't/isn't compatible with the iPhone.  It \"hiccups.\"  Phone calls go straight to voicemail.  Texts won't send out.  Multiple same texts come in.  Over and over and over again.  After reading up online about other people's similar problems and contacting Sprint over and over again, we finally just unplugged the Airave.  It was the lesser of two evils.Another problem that arose was that when sending texts to email accounts, they showed up as picture mail, regardless of a picture being attached or not.  Several chats with Sprint later, there's still no resolution.  We've given up on that.  Similarly, when sending these \"texts\" to email accounts, the email address shown was a randomly generated email address based on the first person's name of the shared family plan.  That became confusing when the person sending the text wasn't the first person on the plan.  Two hours of chatting with Sprint, that was finally resolved.  (You can't manually change it online yourself for whatever reason.)The actual iPhone itself is fun to use.  The apps available are numerous, and you have to hunt and peck to find out which ones appeal most to you, download them, arrange them, and learn how to use them.The sound on voice calls isn't as good as my last non-smart Samsung phone, but I'm getting used to it.With my old phone, I could charge it every three days or so.  With the iPhone, I have to charge -- at the minimum -- nightly.  It drains energy/power faster than a half-working air conditioner in NYC in the middle of summer.  And this is just casually using it during the day, not heavily.  I also practice steps to reduce the power usage: toning down the screen brightness, closing all apps after use, etc.  I recommend getting multiple charging adapters -- for home, work, and car.  But make sure to only charge them fully when they're close to being out of power.I went with the iPhone 4S vs. the iPhone 4 mainly for Siri.  I thought that would be a great addition/concept, especially while driving.  Unfortunately, Siri has a mind of her own and only wants to work when she wants to work.  I'm constantly getting, \"I'm sorry, but I cannot take requests at this time.  Please try again later.\"  Isn't the main purpose of asking things of Siri because you need that information RIGHT NOW?  Like directions?  Or to remind you of something later because you'll forget?  In those cases, \"trying again later\" isn't feasible.  My advice is to NOT get the 4S for Siri alone.  Get it for other features/reasons.  Otherwise, stick with the very similar 4 and save yourself a hundred bucks or so.Do I recommend it?  Maybe.  Once you get over the huge hurdles of set-up, it can be fun to use, and the features are nice to have at your fingertips.  I don't have any comparisons to other smartphones, though, so I can't say whether the iPhone is better than others or not.  Sometimes I wonder if it's better to go back to having one device to use as a phone (that's small and actually works) and one to use as a computer, though.", "Date": "May 1, 2012"}, {"Title": "Exactly what I expected.", "Author": "MomaSue", "ReviewID": "RMFSMZH9Q4VNY", "Overall": "5.0", "Content": "Product was exactly as described, but also included a screen protector and case, which was a pleasant surprise.  Thank you.", "Date": "January 3, 2014"}, {"Title": "iPhone 4s", "Author": "Connie M. Leamont \"grshpr\"", "ReviewID": "R3PF4VI10DY15F", "Overall": "4.0", "Content": "I have had the iPhone 4s for a few months now, getting it as an update on my cell plan with Verizon. So far, I like it. It runs well, the battery life seems to be pretty good, and I don't have problems with things working on it.My only real complaint is that it has far too many apps that I will never use, and I have been unable to delete off my phone. It's a little frustrating to have to deal with all those useless apps being there when I honestly don't need them.", "Date": "May 10, 2013"}, {"Title": "Amazing.", "Author": "Harry Heslop", "ReviewID": "RMQWMDX3XEIHW", "Overall": "5.0", "Content": "the chances are, you are surrounded by people that are on their iphones often, killing pigs with furious birds or talking to a robotic voice.. my point is, there is a good reason that you find yourself surrounded by these people. because the Iphone is such a good quality product and undeniably the best on the market. I know people will argue that there brand new 'HTC' or 'ANDROID' has a better computer inside or 43 more pixels in the screen... but these arent the reasons for making a phone great anymore, it is simply APPS. and  there is not a better app store out there than Apples! the quality and quantity of apps out there is more than you can hope for.That said, if you currently own an older generation of this phone then i would suggest waiting until the iphone 5 comes out (which wont be long with the rate Apple bring them out) before you upgrade. because the only additional features from this phone to the plain 4, is that it has a faster computer in it and a clever voice recognition program (SIRI), not enough reason to upgrade.", "Date": "April 24, 2012"}, {"Title": "Amazing", "Author": "Nancy", "ReviewID": "R33GYDS0IUK8ID", "Overall": "5.0", "Content": "This phone is amazing! I'm always finding new features about this phone. It's very user friendly and intuitive and I had no problems getting used to the phone right out of the box. It's a great entertainment center and toy all rolled into one and oh yah, a great phone (haha). If you're debating between this and an Android phone, do your research and see which one suits your personality/taste more.", "Date": "February 12, 2012"}, {"Title": "Phone is GREAT, SIRI is a nice novelty if you have time", "Author": "P. J. Humphreys \"Pamigirl\"", "ReviewID": "R1Z4CTRNPEANB2", "Overall": "4.0", "Content": "I am new to the \"smart\" phones, but have been researching them for a while.  I decided on the iPhone 4S because of all the positive feedback. I was prepared for a battery life that lasted as long as a goldfish memory and purchased every means of recharching available. I learned how to get Apps and there are millions out there! The more Apps, the more memory usage .. I charge. Charging with a computer does not give you a complete charge, so mid day, I charged.  I got quite a few calls and made quite a few calls to test the battery ... and I charged.  Siri worked like a charm when she could decipher my New England accent, but mostly I heard \"I didn't understand what you are saying...\"  I found that although my phone worked from inside my work building, that Siri doesn't. I get an \"unavailable\" until I go home, even when I have 4 bars.  So, Siri is fun, but not always available.  Phone has great reception.  Battery life ... keep charging.", "Date": "February 9, 2012"}, {"Title": "Corey Slockbower Review of IPhone 4S", "Author": "Corey J Slockbower", "ReviewID": "R1F3BAIKLS0DZ7", "Overall": "4.0", "Content": "Very quick and powerful phone. I use it for both work and personal use. The service provided by AT&T; however is horrible. I do not recommend AT&T.; Subscribe to Verizon service if you plan to buy this phone.", "Date": "July 2, 2012"}, {"Title": "Worldwide Distributors Selling used iPhones as new", "Author": "Karol", "ReviewID": "R2HDQ573WP5BOQ", "Overall": "1.0", "Content": "I bought iPhone 4S from WorldWide Distributors. They shipped me an used iphone, which was already tied up to an iTunes account. The local AT&T; dealer couldn't activate the iPhone. I filed a claim and they didn't respond back immediately. Then I have to involve amazon.com to get my money back. But I lost 28$ in returning the product as per shipping standards (i.e.) shipping with tracking and insurance.I wanted to save 100$ and bought the iphone from Worldwide distributors (through amazon.com). But I ended up loosing 30$.", "Date": "June 24, 2012"}, {"Title": "Lots of gimmicks....more like a toy.....serious shortcomings....", "Author": "BudNJax", "ReviewID": "R2LJPIC4CE63N3", "Overall": "2.0", "Content": "I bought one of these based on all the hype but wish I had researched the iphone 4s more before throwing away my money on a fun-to-play-with toy which has serious shortcomings as a true communication device.  Don't believe it?  Battery life is much shorter than claimed...I work with 3 other iphone 4s owners.....all have computers at home and at work and don't use their iphones all that much, yet all agree that even with minimum use they are having to charge their iphones almost every night....I have to charge mine at least every day and a half.....this is far less than the claimed battery life.  Like to put your phone on vibrate when you're in a meeting or theater?  Do it with the iphone 4s and mostly likely you won't be able to feel the vibration, even in a shirt pocket.  I have yet to feel my iphone 4s actually vibrate on an unexpected call.  Oh, I've phoned Apple customer support about both the battery and vibrate issue and have been told there's nothing they can do about either. Have another computer at home and/or at work where you get a lot of e-mail?  Don't plan on deleting it easily from your iphone 4s:  there is no \"select all\" or \"delete all\" option on the inbox.  You have to individually click on each email you wish to delete, first.  Takes forever if you have a lot of mail to delete and is a real pain.  I find it hard to believe that a company supposedly as modern as Apple would leave out such an option from one of their \"premiere\" products, but that's the way it is.....again, Apple support told me \"there's no fix out there.\"On the plus side, the image quality on the screen as well as with the built-in camera is superb....about the best I've seen on a cell phone.  Voice quality is pretty good, the push buttons and other controls work well so far although some are not logically laid out: for example, under settings for Sounds there are two buttons for Vibrate, one also marked \"silent!\"  I haven't figured those out yet, nor found out how to set the iphone 4s to both vibrate and ring.  Siri is a joke....all right for just telling her to dial a phone number to dial and not much else....she's no HAL computer.This is my first Apple product and I am not really impressed.  I was considering an Apple computer, but having found such serious deficiencies in the 4s iphone I think I'll just keep my PC.", "Date": "January 19, 2012"}, {"Title": "Disappointing", "Author": "K. Carlson \"WhatStuff?\"", "ReviewID": "R2PB807VJ38L7C", "Overall": "3.0", "Content": "I have only had the 4S phone a couple weeks after \"upgrading\" from my iPhone 3GS.  The GOOD: The camera is much improved.  It really makes your digital camera pretty obsolete.  I'm considering ditching my camcorder as well.  THE BAD: The problem that I have with this phone is the battery life.  When you use all the fun goodies it zaps the battery.  The phone doesn't make it through the day without recharging.  This is really a drawback for a phone and a disappointing product for Apple.  Another serious issue I have with the iPhone and Apple is the the syncing feature of this phone with contacts.  It duplicates your contacts every time you sync.  It got so bad that I had over 700 contacts where there should have been less than 150.  I have to constantly delete duplicates by hand.  I bought an App to do this faster but it is still time consuming.  If you update a contact and have 7 listings for that person you have to go through each individually to find the one that was updated so that you don't delete the new information.  I did a search on trying to fix this issue.  I didn't find any answers.  All I found was more people that have had this problem dating back to 2005!!!!  I had gone into the Apple store to get help with this.  They couldn't help me either.  They said that it had something to do with Mobileme and the way that you set up syncing.  Enough already!  Apple is slipping.", "Date": "February 28, 2012"}, {"Title": "The best phone for the price", "Author": "Brian J. Pastor", "ReviewID": "R34IR83B8P0F66", "Overall": "5.0", "Content": "Lost my iPhone 5 and needed an affordable replacement.  Had an android phone for a few weeks and hated it. I just HAD to get an iPhone back in my hand. Great phone and easy to use!", "Date": "August 15, 2013"}, {"Title": "Seller was not upfront about limitations of phone", "Author": "Cindi", "ReviewID": "R9VM3NVBMRPQG", "Overall": "1.0", "Content": "I paid extra money to get an unlocked phone but still had to pay $20 upon receiving this phone to make it usable with T-Mobile. Then we found that this phone can't send of receive picture messages without further visits and money paid to the Apple store, and I'm still not sure it's going to fix the problem.  The seller should have been up front about the limitations of this phone.  It would have been worth it to get a refurbished phone directly from Apple or even a new one after all the money I've paid and time I've spent trying to fix the problem.", "Date": "April 10, 2013"}, {"Title": "iphone", "Author": "william", "ReviewID": "RHMHXANVC6FEH", "Overall": "5.0", "Content": "el producto cumplio con mis requerimientos y lo recomiendo a todo el publico en general. muy satisfecho en pocas palabras", "Date": "March 12, 2013"}, {"Title": "Absolutely wonderful", "Author": "Kaylie", "ReviewID": "R3NSM0IAO3BGR", "Overall": "5.0", "Content": "This product was said to arrive within 4 days of its shipping, and it came in 2. It was so easy to activate with my carrier, and the phone was in perfect condition! I have had zero glitches (knock on wood), and would definitely recommend not only this product, but also this company!", "Date": "March 7, 2013"}, {"Title": "Apple iPhone 4S 16GB - AT&T; - Black", "Author": "Sergio Magana", "ReviewID": "R211U65X5ULIDY", "Overall": "5.0", "Content": "This is an awesome phone. Siri tries her best haha but the phone itself is great. I use it for my business a lot and it keeps me well organized. The software is great (iOS 6.1) but of course like any other phone it has its bugs. Great phone overall!", "Date": "February 6, 2013"}, {"Title": "Well Worth It!", "Author": "CAW", "ReviewID": "R1I073JL79LVYM", "Overall": "5.0", "Content": "I purchased this unlocked phone for my work phone.  Work pays the bills so I could afford to pay the full unlocked price for the phone.  The iPhone works so well between my Mac and keeps me on top of things.  It also updated from the iPod touch I was using before I got the phone.  Really no hassle at all.  I cannot imagine not having my iPhone.  It also got me to purchase the 3gs for my daughter and wife.  They love them as well!", "Date": "January 7, 2013"}, {"Title": "Arrived very quickly, in excellent condition!", "Author": "Barbara Melvin", "ReviewID": "R35E7G5QWOLGMH", "Overall": "5.0", "Content": "I was nervous about ordering this on the web, but everything was perfect! I will feel more comfortable ordering a high ticket item again!", "Date": "January 6, 2013"}, {"Title": "Exactly as advertised", "Author": "MGhazal", "ReviewID": "R3ADK8SX21SW3K", "Overall": "4.0", "Content": "Exactly as advertisedArrived on timeNo scratchesWorked fine out side USA with different carriersIt was missing the pin to change the SIM card but was not a problem", "Date": "December 25, 2012"}, {"Title": "Best phone out there other than the 5", "Author": "Ben Harrison", "ReviewID": "R2QRV7R2M76KB2", "Overall": "4.0", "Content": "I have always been an iPhone fan for a few years and have always upgraded accordingly when the next one would come out. I was not disappointed when I got the 4S. I would say I love the glass HD display, it has always ran smoothly and efficiently for me, and does pretty much anything I could want it to do except for Flash support online. It has a fantastic camera resolution, even higher than my actual Canon camera. My only complaint off the top of my head would be that my battery seems to dwindle down in a hurry, but after getting a battery case, it actually seems to have improved, and I'm a power user. So overall, I would say this phone is definitely worth getting if you don't wanna shell out the bucks for the 5 just yet. Not really anything that majorly stands out as issues for me, and am satisfied yet again with Apple delivering a great product.", "Date": "December 22, 2012"}, {"Title": "iphone = awesome :)", "Author": "aaron", "ReviewID": "R1TWYZJIGRURPB", "Overall": "5.0", "Content": "Love my iphone!  No problems with glitches or anything like that, and love the compatibility with my macbook.  Lots of good apps and very easy to use.", "Date": "December 9, 2012"}, {"Title": "Good, solid phone", "Author": "Tycho", "ReviewID": "R194ETY0LX5HCL", "Overall": "4.0", "Content": "I bought the 4s a while back when it just came out, so I've had it for a while. Prior smart phone was the Galaxy S, which wasn't bad either until a few months in when the thing bogged down.The 4s has been pretty stable, especially prior to the IOS 6 install. Ever since the last update I've noticed some delays or hick-ups that are only solvable by rebooting the device. Overall it's a solid device for which you don't need a screen protector. The glass is scratch resistant and mine still looks like new.Facetime is great, iMessages are awesome, especially since some of my relatives live overseas.If you're wanting an iPhone, start with this one, it's the same as the 5 only a smaller screen and much cheaper now. Don't think you can personalize the phone completely to your liking, because after all, it is an Apple.", "Date": "December 3, 2012"}, {"Title": "I phone review", "Author": "Amelia Sheesley", "ReviewID": "R1RU56Q8AKCUDQ", "Overall": "4.0", "Content": "I like this product because of its sides changing and go onto Sri and say anything and it reads what you say to it most of the time.", "Date": "November 19, 2012"}, {"Title": "Yay!", "Author": "Michael", "ReviewID": "R28JURIZ5LA3WV", "Overall": "5.0", "Content": "Excellent camera, much faster than previous iphones.  Siri is fun, and ive used it for its intended purposes a few times as well and it seems to work just fine.  Still the best phone out there imo", "Date": "November 18, 2012"}, {"Title": "great product :)", "Author": "mjhs7english", "ReviewID": "R39UPKMOA428H5", "Overall": "5.0", "Content": "GREAT PROUDUCT :0) :-)I wanted the i phone ever since it came out , but unfortunately I had to wait . But fortunately for me I waited until the right time! My new I phone 4s is great I bring it everywhere and use it every chance I get. I constantly use it even after almost a year of having it .PROS.fun.great for someone who wants one.cool.its slickCONS.nothing", "Date": "November 8, 2012"}, {"Title": "I've tried em' all but Apple does it the best!", "Author": "Prashant Patel \"Prashant Patel\"", "ReviewID": "RXCCDU26GGDGV", "Overall": "5.0", "Content": "The Apple iPhone 4S is a fast phone and reliable.  I've tried other Android phones from various providers, but none were able to deliver the CONSISTENT results that the iPhone delivers.  I rarely have any Apps crash, and I always get great reception.  The user interface is easy to use for even someone without ANY computer experience.  Sound quality is great and 16GB is more than enough built in storage for the beginner to intermediate user.  Unless you are looking to shoot a great deal of HD movies with the phone, the 16GB should be sufficient.  Also, battery life is of huge importance to me and like all of the other iPhones, this one does GREAT! SIRI is very helpful and works better than other phones that I've tried with comparable voice recognition software.  The screen is CRISP and the camera shoots significantly better photos than the iPhone 4, and at a much faster rate without any significant lag.I'd buy this phone over and over before I'd go back to an Android phone.", "Date": "October 28, 2012"}, {"Title": "Very Good Experience", "Author": "Anuj", "ReviewID": "R3MXIC9XS7FFP8", "Overall": "5.0", "Content": "Apple iPhone 4S is simply good and worth buying/value for money.The touch screen, speed, connectivity is pretty good.The only drawback is the bluetooth as unable to connect to non-iOS devices", "Date": "October 20, 2012"}, {"Title": "Poor Call Quality, Lots of Dropped Calls", "Author": "P. McWhorter", "ReviewID": "RBBTSVJCR4TEG", "Overall": "2.0", "Content": "I wonder if I am the only person on the face of the earth that does not like the Iphone 4S. Call me an old curmudgeon, but I just call them like I see them. I got the phone when it first came out, so have had it for some time.Bottom line is that it is not a very good telephone. The number one reason I have a telephone is to make telephone calls, and I would like that part of it to work exceptionally, and it does not. Here are my list of concerns.1) Dropped/Missed calls- I live very near an AT&T; tower, and have a clear line of sight to the tower, but rarely have more than one bar at my house. The phone does not ring when someone calls me, but informs me later that I have had a missed call. Similarly, it regularly drops my calls, or gives me a \"no service\" error message.2) Poor Battery Life- I would expect a cell phone to get me through the day on a full charge. I do not mind charging the phone every night, but I want it to get me through the day. I have found that you can not depend on this phone to make it through the day. Even doing things like turning the bluetooth off and all that does not get me to the point that I can even moderately use it and not have the battery dead before I get home.3) Poor sound quality- When on the phone, I do not get crystal clear voice quality.4) Jams up - Phone jams on me every couple of weeks and I have to reset it. In particular, the skype ap appears to cause the phone problems.This phone was designed to do it all . . . it just does not do it very well.", "Date": "April 27, 2012"}, {"Title": "iPhone 4 and 4s, Great Phones in a Case in a Case", "Author": "Keith N. Moore", "ReviewID": "R2R4GEXM28LALO", "Overall": "5.0", "Content": "I am a Blackberry user of many years but now I have switched to Apple as the iPhone 4 is simply amazing (the current AT&T; phone upgrade price for the iPhone 4 is equally amazing also). The problem is, these phones are as fragile as Amazon reviewers say they are and must be used in a case.Solution: I purchased 1 Otter Impact Series iPhone 4s case for my iPhone 4 and trust me, while it will not slip out of your hands using this silicone case, this will not be enough as the screen will still be vulnerable to the unavoidable drop (I have seen a number of iPhone users with broken iPhone screens in cases, complaining).Solution: Just by chance I had a spare Archos 605 4gb-30gb standard leather case. It works almost perfectly with the iPhone 4 or 4s inside the Otter Impact Series iPhone 4s case--you will have to make a small adjustment to the Archos 605 case for the earphone output of the iPhone 4 or 4s. Now your iPhone can can take the unavoidable drop hopefully with no problems as it will be as safe or safer as Blackberry phones are in standard Blackberry leather cases. Good luck and enjoy, you should not lose with an iPhone 4 or 4s in a case in a case.", "Date": "March 28, 2012"}, {"Title": "Great Phone", "Author": "Rosie", "ReviewID": "REBBCVQL96ND4", "Overall": "4.0", "Content": "Great Phone.  Only thing on the wish list would be zoom for the video camera.  I've dropped mine 10 times and still works great, so they are built really well.", "Date": "March 21, 2012"}, {"Title": "If you require Bluetooth Avoid the iPhone 4S", "Author": "An  M.K. Fan", "ReviewID": "R4XGT3UIFOTPM", "Overall": "1.0", "Content": "Just picked up my first iPhone 4S and quickly discovered that the BLuetooth feature will not work on many devices including other Apple products.  Check the web and you will see what I mean.  This phone is going back to the carrier tomorrow.  Wish Apple would acknowledge such a major flaw and fix it.  Call to Apple support did not help.  They are in denial.  Try a Motorola or Samsung phone if this feature is important to you.", "Date": "February 19, 2012"}, {"Title": "It's LOCKED !!!!!", "Author": "Tatiane", "ReviewID": "R3KUHTSDVUP0NE", "Overall": "1.0", "Content": "Although it had the word \"Unlocked\" in its description and it's listed under: Cell Phones & Accessories > Unlocked PhonesThat's a huge lie!The phone is locked to AT&T; and won't work until you manage to have it unlocked which is very hard if you don't leave in US.After 3 months I bought it I still can't use it.I tried to contact AT&T; and they refused to help me saying that since I'm not a \"AT&T; customer\" they can't unlock my phone.Frustrating!", "Date": "July 3, 2012"}, {"Title": "Fragile, fragile...", "Author": "CRV", "ReviewID": "R2UZU1TN2DO3XN", "Overall": "1.0", "Content": "Cons: This phone is nice looking, but you will have to buy a case to hide the beauty.  So, don't be fooled by its beauty, instead, imaging the phone with a case.  All the hype about the \"gorrila glass\", which boasts \"exceptional damage resistance to the scratches, drops, and bumps of everyday use\" (from Corning web site) is nonsense.  At the end of the day, it is still a piece of glass, and it is going to break.  This is the first phone I broke after so many years.About Siri, she is funny sometimes, but most of the time she doesn't understand.  She thinks everything is related to a restaurant.Pros: Lots of apps, good time killer, convenient, easy to use. For managers: do not approve to buy an iphone for your employees, it will reduce productivity with millions of apps.", "Date": "December 19, 2011"}, {"Title": "Iphone is getting stale", "Author": "J. Limandri", "ReviewID": "R2NG8YX4T0XQ2D", "Overall": "2.0", "Content": "Same old locked down ecosystem and OS.  I owned every iphone since the original and I finally had enough and sold my 4s and got a Galaxy Nexus.  The first 3 iphones were ahead of the crowd.  But over the last few years iphone has gotten stale while the rest of the industry is innovating and is now way ahead.", "Date": "August 14, 2012"}, {"Title": "Used sim card", "Author": "RB", "ReviewID": "R2IM850BAK90XW", "Overall": "3.0", "Content": "The phone is great but when my husband went to have it turned on they said that the sim card had been used and that he would have to buy a new one. I would have hoped that for a $550 phone, it would have been brand new.", "Date": "July 14, 2012"}, {"Title": "Software is very good BUT Hardware is very bad!!!", "Author": "C. Nguyen", "ReviewID": "R180CV33GUE8KT", "Overall": "3.0", "Content": "There is nothing I can say on the software part.  It is the best right now.  Except for flash which I do need to use for video on some websites that the iphone cannot do.The hardware design is very bad although I know it looks good.  But what is the point of looking good if it can crack easily from small falls?  So I have to use a case for the iphone.  It makes the phone feel like a big brick with the case on and is too heavy.  I think apple need to do better than this.  Other companies like htc and samsung have better lighter and more durable phone designs.  I would have switch to android or windows phone If I have to use a case to protect the iphone 5 when it comes out.", "Date": "June 5, 2012"}, {"Title": "dont have my product yet", "Author": "arnaldo", "ReviewID": "R3E5FZ2MU7ZP1Z", "Overall": "1.0", "Content": "It has passed a month since I oredered the iphone and I havent receive it yet, it is the worse service I've ever had", "Date": "March 8, 2013"}, {"Title": "A worthy replacement after years of blackberry use", "Author": "imaginists", "ReviewID": "RSW0F2Q3BP3P", "Overall": "5.0", "Content": "I recently got this version as a refurb and locked to AT&T.;I'm using it on Straight Talk prepaid service, which pretty much is half the monthly cost than most postpaid carriers (AT&T; and verizon).The phone is great.  I've been using BB's since 2005, and then early this year, I made switch to the 3gs.  That phone was ok, but was it slow and painful.  It really made me miss my blackberry's speed and composure.However, this 4s is super fast.  While my typing will not rival my speed on BB, its very close.  Luckily I don't compose that many emails or txts anymore, so I prefer that the 4s can do more intensive internet tasks with minimum of effort.If you are on BB or iPhone 3gs, you really need to upgrade to the iPhone 4s to see what you are missing.  The phone is sturdy (I dropped it the 2nd day on concrete sidewalk on there were the minimum of scratches on the side), though, I don't think it will handle multiple drops and survive like a BB does.  Everything else on this phone is great, fast and fun to use.", "Date": "July 25, 2012"}, {"Title": "Stylish with great usability", "Author": "Amazon Customer", "ReviewID": "R222EIUEBWM2AK", "Overall": "5.0", "Content": "Why I like the Iphone:-> Stylish timeless case that gives you a high quality impression.-> A software which is specially written for this phone, no compatibility issues like you always get with android phones-> Better Battery duration", "Date": "July 24, 2012"}, {"Title": "Very Durable", "Author": "Miguel Valencia", "ReviewID": "RL98RHV0DWLLD", "Overall": "5.0", "Content": "I love the iPhone 4S! I'm writing my review on it actually. lol. I have dropped this phone on concrete floor WITHOUT my cover on it and the glass did not break but there were a few scratches. It wasn't anything major the scrathes are barely visable. You cannot tell that it got dropped.", "Date": "July 22, 2012"}, {"Title": "Outsanding", "Author": "everydaynormalguy", "ReviewID": "R1TG5A5JUFPOGX", "Overall": "5.0", "Content": "Previously had an Iphone 3G and glad I finally upgraded. Phone is super-fast and I was able to download my other's phone data right on to my new phone. Siri makes driving and trying to call someone easier and she can help you do almost anything. I just wish the Iphone would get better reception in some areas and have priority over other phones. In crowded areas it does preform very well.", "Date": "July 10, 2012"}, {"Title": "Amazing!!!", "Author": "Spartan208", "ReviewID": "R1BMLTPGT3KO1C", "Overall": "5.0", "Content": "This is the newest apple iPhone and it's amazing! New and improved retina display, improved mega pixel camera, shoots 1080p video and Siri. If you don't have one of these you need to get one!", "Date": "July 1, 2012"}, {"Title": "very nice phone", "Author": "Ailong Yang", "ReviewID": "R4FE3R0Q5M8FT", "Overall": "5.0", "Content": "very nice mobile phone ,so many applications,and works perfect. I think I maybe a new fan of iphone . Bring much convenient to my daily life.", "Date": "April 19, 2012"}, {"Title": "It's an iphone", "Author": "Pizzabrick", "ReviewID": "R3DLZD4QQG3DKN", "Overall": "4.0", "Content": "I guess I'm more of an Android type.. I got this the day it came out, I was happy with my previous droid incredible until it got lost, and than on my way to out of country I found out that Steve Jobs passed away. I was never to exited about apple products (except for the first iPhone which to me was a game changer), but Steve Jobs was always a hero for me so I decided to get the new iPhone instead of an android (for the memory of Steve).First, the battery is bad! I need to charge it twice or trice a day and no, I don't speak for more than 3 hours straight a day. Second, after use to android (my ex droid incredible anyway) using the iPhone feels kind of crippling. I have it for about 4-5 months and I still find my self long pressing blank spots hoping to add an app or a widget.The phone options are very limiting compering to the incredible and the operating speed feels almost identical! I'm not sure if it something to criticize the iPhone for or to kudos the incredible for, but I have to say that in the monarchy of movement and smoothness, iPhone 4s is still a king.The screen is beautiful, the app selection is vast, the speaker is loud and the device is slick which are all good things.As far as a phone, the reception is good and so is call quality but I'm getting more drop calls than on any device I had before (I'm on Verizon). Again, the battery drains real fast which is a bummer but I had the same problem with my incredible R.I.P so I guess it's a general smartphone issue (still a drag though).I know it seems like I have more bad than good to say about the iPhone, and it is a review I'm posting after 5 months of use, but I'm aware that a lot of this negativeness is due to me getting use to a different platform. My next phone will defiantly be an android phone but objectively speaking, the iPhone is still a wonder thing and I'm sure most people will like the Apple experience way more than the more customizable android way which I prefer!", "Date": "March 13, 2012"}, {"Title": "A phone made of glass", "Author": "Jib", "ReviewID": "R22G5TC82SRKVI", "Overall": "3.0", "Content": "It is all ugly sharp angles and is made of glass. Nothing special about this glass, kids....it is glass. When dropped, it shatters, glass everywhere. Had my old iPhone forever, dropped it everyday with no case - the thing still works. Even felt safe letting my 3 year old play with it. With this New phone, first dropping incident, the phone is shattered on the back (not the front, thankfully - still works, but taped together to keep the glass from falling out.) had it for a week. So... weird product update, ugly new design, and bizarre choice of materials for a mobile heavily-used object. maybe next they'll update using spun sugar as the material to replace the glass. That way you'll have to buy another when you get it damp from the humidity in the air! Seriously, if you buy this thing, invest in a heavy-duty case. Still no guarantee that will protect it, but hey, buyer beware!", "Date": "January 5, 2012"}, {"Title": "Phone had passcode on it!", "Author": "Coleman K. Glover", "ReviewID": "R32DURB9NI8Y71", "Overall": "1.0", "Content": "Received phone with passcode on the phone, and sender was contacted, didn't know the passcode at all!Very unprofessional for an experience salesperson.  Wouldn't recommend this salesperson at all!", "Date": "September 13, 2012"}, {"Title": "Best Phone Ever", "Author": "Maulzey", "ReviewID": "R2IHQB9VG3P7UH", "Overall": "5.0", "Content": "No question asked, This is the best phone ever.Using iPhone last 4 Years. Happy to be part of Apple family", "Date": "February 6, 2012"}, {"Title": "Not perfect, Just astonishing", "Author": "Kelvin Brown", "ReviewID": "R113OY1KPA1AX2", "Overall": "5.0", "Content": "Love it or hate it, the new iPhone 4S is one of the best buys around.Where else can you find - all in one unit - the dictation machine that is world-class, a digital camera that produces consistently good results... Guaranteed to knock your socks off, a telephone, and an iPod all in one little gadget that cradles  in the palm of your hand. it is completely interoperable with your Macintosh computers and gadgetsFirst, the downs:*There are occasionally little Siri hiccups. Either the system goes down or can't understand completely articulate English.*I generally find the sound quality coming from the music player extremely substandard compared to previous versions of the iPhone. I've taken this and, exchanged the unit, and have just had to live with it.*Apple customer service is notoriously highbrow, presumptuous, and not particularly user-friendly.*Apple seems to keep raising the bar. For them and for us.  Not all that crazy about buying a product and being used to beta test their new services or concepts.* iCloud. Not too much of a fan of the iCloud services especially when it comes to my music library. I have about 15,000 songs in my iTunes collection.  iCloud, from a iTunes standpoint, was an absolute nightmare. It is nice to be able to sync pictures and email between all of your Macintosh gadgets but this is a service that needs to mature for a year or two more before it is really ready for prime time. It works okay but, there are glitches that need to be worked out. If you have multiple accounts and you want the iCloud service for all the music your purchased from iTunes, you're going to have to pay for each separate account. They don't have a way of combining accounts and rolling them all together.The ups:Siri, the Camera, and the Messaging Capability:  All integrated. This is a product that you can't live without. I go everywhere with this iPhone, I dictate about 30 to 40 pages of work a day into this telephone, I take scads of pictures everywhere I go, and by using Siri I can fire off texts  so many times per minute that people tell me it should be illegal to be able to text as fast as I do. I've adjusted to the new technology, and they are slowly getting over it.The applications.  Got to hand it to Steve, the iPhone 4S really has become something that I can't go anywhere without. If I misplace it for 15 minutes, I start to have a complete nervous breakdown. I take more pictures with this than my Panasonic or my Nikon, and you can quickly insert pictures and video text messages or emails. There are numerous applications for the iPhone -- my bank and other finance companies --productivity applications like Wunderlist and iPage -- games like Monopoly and Scrabble.  All make this not only the most useful thing I've ever carried around, it makes it absolutely addictive.Ergonomic design - mentally and physically:  For those people think this is a gimmick or has to many gadgets, oh well. Whatever. All you need is a phone to talk on and hold a few contacts, this would be a little bit overkill to say the  least!  But for those people who have pretty much integrated and adapted to current technology, there's a lot to take advantage of here. Never a better time to get an iPhone.  For the hardware, the ability to dictate, a stunningly great camera and video cam, and the ability to use some of the applications, (could write ten pages on iBooks alone), I am still going to give this five stars. One of the best products out there for innovation, and integration with your workflow and the way you live.For those people think this is a gimmick or has to many gadgets, oh well. Whatever. All you need is this phone to talk on the get a hold of you contacts, this would be a little bit overkill to say the least! But for those people who have pretty much who can handle the technology, as you'll be looking a while before you find another piece of technology that can make your life easier.It isn't perfect yet.  But it is still amazing.", "Date": "February 6, 2012"}, {"Title": "Not sure what all the hype is all about", "Author": "RichieRich", "ReviewID": "R3EIH2GFWC3JSU", "Overall": "1.0", "Content": "I have been a loyal Mac fan since I switched to a MacBookPro about 8 years ago but after switching to the iPhone from a Samsung Galaxy, my loyalty level has taken a big drop.  I found the Adroid OS to be MUCH more user-friendly, full-featured and intuitive.  In fact, I feel that Apple is behind the 8-ball.  For example:1)  The security pattern feature to login is NOT available on the iPhone making it more difficult to login.  Heck, when driving you may as well be sending text messages since typing in a security code is essentially the same thing!!2)  The Calendar app is an absolute JOKE!!  - There is no way to simply Snooze an alarm.  You have to open the event, select Edit and change the reminder, then select done.  Having said that, there are no real snooze options available (like snooze for a time period)For someone that relies heavily on the Calendar, this drawback alone makes this crappy phone unusable.3)  When a notification comes up, you can't simply click the reminder, login and go directly to the reminder.  Instead, you have to login to the desktop, drag down the notification bar and click the notification.4)  There is no menu button.5)  There is no back button.  In fact, there is only ONE button which ALWAYS ONLY takes you back to the desktop.As you can tell, I am very unhappy with this thing and am blown away that there are so many users.  Thank God for third-party apps giving added value, huh Apple?", "Date": "September 27, 2012"}, {"Title": "Dissapointed first time Apple product user", "Author": "Elknur", "ReviewID": "R1PJ63CS4NGNVG", "Overall": "1.0", "Content": "I am a new apple product user. I purchased a new phone within the last 6 months. To date I have had nothing but problems. It started with the unique password I had to create. Not a big problem, but your requirement to put in the password multiple times if I'm down loading two or three apps, is excessive.Then I had the problem with my voice mail. My clients started reporting that my voice mailbox was full. My IPhone said I did not have any voice mails but when someone tried to leave a message, the mailbox was full. It took 2 weeks for you (Apple) to correct the problem.Siri has become a joke. It works great when hooked to a local network. I love the features and became used to asking Siri to provide info when needed.I was traveling in my car with 3G service needing info from my phone and Siri stated it could not help me. Getting used to how easy my new phone worked, then in a time of need, it let me down. This is not acceptable. I started keeping track and 50% of the time Siri lets me down when needed in my car even though the phone signal is strong.My wife and I were enjoying a night out with friends and we were discussing a new app call Gas Buddy. I tried to download the app and a whole new level of security was required. I responded with the answer to a required security question and another question was asked, and another, and another. Finally my phone required a second email address which I could not provide because I do not have one.My friend responded what a joke the IPHONE is. You cannot load a simple app. I agree. You have not thought out your product. To have to keep track of multiple email addresses, security questions and to be required to type in my password over and over during the same phone session is a waste of time and a frustrating burden.I called your support line and was told I'm over the 90 day free support and need to purchase support time.That was the last straw. I ordered a new android phone hoping my wife would like the IPhone. She does not want the hassle. I will try and sell the Iphone on ebay. My son who has a IPhone 4 informed me I should have purchased a 3s or 4 model that the 4s has had many problems. Great news, you put out a product that has obvious issues and require the consumer to pay for support.I wonder how long you will be able to continue this scam.I would be great if Apple would refund my money. In fact I would be very happy if you would stand behind your product and refund my money. But based on my experience to date, I'm not holding my breath.My company was planning on purchasing Ipads. We will be looking at other solutions.Apple has created a loyal customer market for their products. The Iphone was my first Apple product. If my experience with IPhone performance and company support is common, you will surely diminish and erode that customer base.I do not expect a reply or a solution to the above mentioned problems. My only recourse is to spread the word and post my frustration on the web as often as possible.", "Date": "April 18, 2012"}, {"Title": "Nice upgrade from an iphone 3g", "Author": "EPA316", "ReviewID": "R10ZO2PS8WHFJR", "Overall": "5.0", "Content": "I had been waiting for the longest time for the rumored iphone 5. I made an old-school 3G (non-S) model last for over 2 years, and it was getting to be painfully slow. Plus, thanks to my getting it wet and dropping it many times, it was literally falling apart. The volume switch on the side fell out.. well anyway, it was on its last legs. I was very tempted by the iphone 4, but I said no, as soon as I sign up for that, they'll just release something better. And I was right. The iphone 4S leaves the older 4 and my 3G in the dust. I like all of the features on this thing. The camera is great, it has a flash, and the video camera is really good. Such a huge leap up from my old 3G it's unreal. I even found a way to get siri to cuss at me! I tell her to play a song by Pantera, \"F***ing Hostile,\" and she says, \"playing F***ing Hostile.\" Cool. That siri gal has a bit of an attitude, too! She will give you some snarky answers.So anyway, I realize this phone is a stopgap to hold people until the REAL iphone 5 is released. I realize I'm locked into this phone for 2 years, and it won't be the newest thing for all that time. So? This is way better than the one I had, and I'm a patient person. I'm enjoying vastly improved performance and features I never had before in a phone. It works very well for me, and it has yet to drop a call. In 2 years, I'll see what the iphone 5 looks like, maybe I'll go for it if it's a big enough step up over this phone.", "Date": "December 25, 2011"}, {"Title": "Iphone 4s 16gb", "Author": "hamza malik", "ReviewID": "R2CT7OURTDTJPN", "Overall": "5.0", "Content": "Top Phone My tips  The Calendar on the iPhone is a wonderful functional tool to help you get organized. You can quickly use this tool by directly adding events rather than using \"+\" button. When in an individual day of the calendar, simply by tapping any hour and holding it on there will bring about a new event during that time period. Fast scheduling helps you more time to work with!You can take a picture with just one hand on the iPhone. You do not sacrifice quality by taking pictures are just as high as if they were taken the traditional way. http://youtu.be/VBVfSWDm5go", "Date": "May 14, 2014"}, {"Title": "Not bad and not excellent on it's outlook", "Author": "wei ji", "ReviewID": "R3OZI1L9GTVEXB", "Overall": "4.0", "Content": "It's outlook is not so new,while it's function can reach my need.I should have a deep clear and prison-break for it.", "Date": "March 2, 2013"}, {"Title": "very cool", "Author": "alex", "ReviewID": "R1CRCTEJZ5589L", "Overall": "5.0", "Content": "It's my dream. Thats the ideal product! And color is really \"deep\" black. 16 Gb should be enough for a lifetime!", "Date": "September 24, 2012"}, {"Title": "I've never seen a phone with so many features", "Author": "TylerSimpson", "ReviewID": "R3STOU8ZFQ6UHQ", "Overall": "4.0", "Content": "This is by far the best phone I know of its not to big or too small. It has a huge selection of apps. It has almost everything. I definitely think its worth the money", "Date": "September 19, 2012"}, {"Title": "ABOUT MY CELLPHONE", "Author": "NESSA", "ReviewID": "R1ET1FPSPV7JLZ", "Overall": "5.0", "Content": "ok i understand that! but my phone carrier its not from ATT CARRIER IT SAYS ITS FROM VERIZON, AND UNDER MY CELLPHONE BOX HAVE THE WRONG IMEI NUMBER AND MY PHONE HAS ANOTHER ONE!I WANT U EXPLAIN ME ABOUT IT, CUZ WHEN I BOUGHT IT SAID IT WAS FROM ATT NOT VERIZON", "Date": "September 8, 2012"}, {"Title": "great!!!!", "Author": "mnwright", "ReviewID": "R3JE8S8QTF9G2P", "Overall": "5.0", "Content": "product came on time and is in amazing shape, it looks brand new no smudges or scratches definitely a good product", "Date": "July 30, 2012"}, {"Title": "Apple, you've really outdone yourselves with the 4S.", "Author": "JV", "ReviewID": "R12ECQ4N1DF723", "Overall": "5.0", "Content": "I actually got my 16 GB 4S at Best Buy. It was well worth the money. I've seen a lot of people with iPhones, and I take pride in saying that I am part of the clique. Finally-- all that time hearing about these great apps and how great Siri is, I finally got to use these features. In fact, I dictated this entire review using Siri. I would, however, like to point out that in the description for this product here on Amazon, \"assistant\" is misspelled. They accidentally spelled it \"assitant.\" Spot on, Apple... I mean with the iPhone. What's next?", "Date": "March 30, 2012"}, {"Title": "A very good Phone", "Author": "DrNel", "ReviewID": "R3GIFEK9F74P6U", "Overall": "4.0", "Content": "It is a very good phone. It is just like described, and the battery is not so bad like they say.", "Date": "March 12, 2012"}, {"Title": "\"iPhone 4S\" is the latest and greatest smart phone from Apple.", "Author": "darren king", "ReviewID": "RCSPHQSQNDFDI", "Overall": "5.0", "Content": "The \"iPhone 4S 16GB\" FactsThe \"iPhone 4S\" is the latest and greatest smart phone from Apple. The top-of-the-line unit features an Apple A5 Dual-Core processor, IOS 5.0 & iCloud, all new 8MP camera and optics, 3.5-inch (diagonal) Retina widescreen Multi-Touch display with 960-by-640 pixel resolution. And introducing Siri, a truly remarkable voice recognition system that has thus far lived up to its considerable commercial billing.", "Date": "February 17, 2012"}, {"Title": "Incredible Fragile!", "Author": "Attitude is Everything", "ReviewID": "R1UYV9Z8L1A36Y", "Overall": "1.0", "Content": "I had to give this phone a 1 star rating simply because it is just so incredibly fragile. I've had the phone for 2 months now, and have already had the glass faceplate break twice. Both times from minor drops of about 2 1/2 feet. I've already spent $150 repairing the thing. If I could return it and get out of my contract, I would.Here's a couple of tips:1) Purchase the applecare+ support agreement. It's an extra $100, but it means that you can get the phone fixed 2 times for $50 each time, rather than paying the $200 per incident that it will cost without the agreement.2) Purchase a case to protect it. It makes the beautiful phone ugly, but at least it won't break from a minor drop. I'd recommend the otterbox defender.As far as how the phone works... It's a wonder. Does much more than any other phone on the market.From an operational point of view, I love the phone. From a reliability point of view, it's a horrible phone.", "Date": "November 26, 2011"}, {"Title": "iphone 4s", "Author": "joguz26", "ReviewID": "R1ZJLIY10OFTLU", "Overall": "5.0", "Content": "Hello i want to know it the iPhone 4s its new never used before, and you said its unlocked its truth?", "Date": "June 26, 2012"}, {"Title": "Great!", "Author": "J.Franz", "ReviewID": "RTXVXXWNTBO5P", "Overall": "5.0", "Content": "I have to admit I was a little nervous buying an electronic item through the internet, but the phone works perfectly and was a STEAL. Thanks for the wonderful review system- I can always rely on it!! Amazon is the best invention of the new millennium. Period. ;)", "Date": "June 23, 2012"}, {"Title": "Best one yet", "Author": "hillmaxwell \"Max\"", "ReviewID": "R3V1N2H23N2Z3G", "Overall": "5.0", "Content": "You don't realize how helpful siri can be. Whether if its checking the weather forecast or sending a text it really saves time and effort.", "Date": "February 3, 2012"}, {"Title": "Love my iPhone 4s", "Author": "dan loney", "ReviewID": "R1HZ2P5CNN9Q3B", "Overall": "5.0", "Content": "This phone continuously makes me happy. After having the 3G for so long (3 years), I finally decided to upgrade. I couldn't hold out for the iPhone5.Pros:Great Video QualityAwesome CameraBeautiful lookingExcellent ServiceSiri makes me happyCons:Wish the 3G internet was fasterAppreciated the roundess of the 3GI'm also happy Verizon has picked up iPhones! I had been waiting for so long. If you want to get a super low price deal from Verizon, just go here: [...]", "Date": "February 8, 2012"}, {"Title": "Amazing", "Author": "Jack", "ReviewID": "R3J8ZQWCXASEKJ", "Overall": "5.0", "Content": "This phone is simply amazing, Siri is a wonder that does way more than I ever imagined just by talking to it. I cannot imagine anyone disliking this phone. yeah, it probably will break if you drop it, just about anything electronic will, buy the thing a case, everyone does. I love this phone and can not imagine ever using anything different.", "Date": "December 16, 2011"}, {"Title": "don't buy", "Author": "connie", "ReviewID": "R7H2R9R04YIGP", "Overall": "1.0", "Content": "Don't buy this apple product.  The home button will stop working and Apple will not stand behind their product.  I will never buy another apple product again.  Had the phone for 11 months home button was not working all the time sent it to apple and got it back and the button would not work at all, and they claimed the phone was tampered with.  All I can say is yeah by apples terrible warranty department.  They don't stand by their products!!!!", "Date": "June 20, 2012"}, {"Title": "Best phone that I have ever used!", "Author": "Hoppaguy", "ReviewID": "R2TS4R1R3RQY3N", "Overall": "5.0", "Content": "I have been using my iPhone 4S for about 6 months now and I love the phone. I was a heavy Blackberry user in the past but as everyone knows that company has gone downhill. At that point, I made a conscious decision to switch phones and I had to decide between Android, Apple, or a Windows based system. I use a Windows laptop at home so I thought I would go with an Android or Windows phone. I tried many Android and Windows phones but did not like the user interface. The Android phones seemed so fragmented in that there was no standard; every phone manufacturer has their own version of customized Android. For me I like things simple. I next tried a Windows phone but that was the slowest phone I had ever used. I'm not sure how Metro will be but hopefully they fix a lot of those issues. I finally tried the iPhone and fell in love with the ease and simplicity of the phone. I really like iOS and how simple it is to operate. I do have to say that I would not have gone with the iPhone if it could not sync with Outlook but luckily Apple built an Outlook plugin which works very well.In terms of the phone itself, the screen is beautiful and the 8 mg pixel camera is great. The phone is quite fast running any type of app and battery life is pretty good. I thought that I would never get used to the touchscreen keyboard rather than the Blackberry physical keyboard but it is actually quite easy when you turn the phone horizontal. The accuracy is still much better on the Blackberry but you get used to the touchscreen pretty quickly! Overall, this is the best phone that I have ever used!", "Date": "April 8, 2012"}, {"Title": "Pacemaker interference", "Author": "MDB", "ReviewID": "RRPMPXCP4WMKT", "Overall": "1.0", "Content": "If you are around anyone with a pacemaker be very cautious!  I have to stay 3 feet away from them.  As you can imagine this complicates everything from elevators to grocery shopping to doctors appointments and people waiting for anything. They are everywhere. The only thing that compares to the way it feels is when the doctors play with the voltage and skip beats.  The phone is much worse.", "Date": "April 28, 2012"}, {"Title": "Ups and downs", "Author": "SLBS", "ReviewID": "R39FFYY566WE6O", "Overall": "2.0", "Content": "So I placed an order for a AT&T; iPhone black 16GB. It came super fast. Placed the order saturday and it arrived Monday. The phone looked spanking' new ! I was very impressed. The only problem was, is that it was Veerizon ! I knew it was Verizon because 1) it didn't want to accept my sim card and 2) when I called Apple they surely told me it was Verizon. So I waiting for the seller to contact me back. Hopefully it was just a simple mistake.", "Date": "July 16, 2012"}, {"Title": "Outdated size and technology", "Author": "CRV \"CRV\"", "ReviewID": "R2ZH2EDOAWQCNF", "Overall": "1.0", "Content": "The only good thing about this Smartphone is its sleek look and nice stylish cases. Once you get beyond those smoke and mirrors you're left with a smartphone that has a 3.5\" screen and an annoying OS that has limited on screen options to go back and forth, open multiple windows, and even the typing is rediculously bad with the single letter options instead of word predict. I will admit that Androids have their shortcomings on their OS design along with their apps seem inconsistent but overall, Androids offer a bigger screen and more flexibility for surfing the web which is what I really want my phone to do.", "Date": "August 23, 2012"}, {"Title": "Say No to IPhone, stay Droid!", "Author": "John doe \"It's what I think\"", "ReviewID": "R2V2GIX8T5DJIK", "Overall": "1.0", "Content": "My Verizon Droid X finally died, so it was time for an upgrade. There was mixed reviews about the New Droid phones so I decided to go with the IPHONE 4S, no one seemed to have anything bad to say. I have a Ipod touch and a few other Ipods which are great MP3 players, The best.  However, I'm returning The IPHONE 4S, it's just an Ipod touch with a phone. Here is what nobody ever told me about their glorious Iphones:  Cons-  ~There is no swype  ~No Picasa app  ~Audible app is limited( you must be on Wi-Fi to download a book)  ~Actually, you must be on Wi-Fi to do anything( that Icloud, ya, not unless you are on Wi-Fi)  ~ No Smugmug App  ~Really no good way to upload your pics to an online account  ~ No Google Play app( store your music in the cloud then stream to your phone, doesn't take up  All your memory.  ~No Firefox  Some of you might say there is a way to get past most of those Cons by Jailbreaking the Iphone. But if the Iphone is so great, why do I have to \"hack\" it just to make it as good as my android phone. The IPHONE IS JUST AN IPOD TOUCH WITH A PHONE. I'm getting the new Razr Maxx.", "Date": "May 26, 2012"}, {"Title": "Thats good!!", "Author": "O. Lawson", "ReviewID": "R21TB2B2VJSML6", "Overall": "5.0", "Content": "Very Clean.Amazing!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!Great Product!!!•An explanation for what you liked or disliked about the product •Product pros and cons •Facts and feature details •Comparisons to similar products", "Date": "March 6, 2013"}, {"Title": "Apple mobile device is so user friendly!", "Author": "Hang Nguyen", "ReviewID": "R3VILZL9TDNAUY", "Overall": "5.0", "Content": "I have both iPad and iPhone, these have been the best mobile device I've used to date.  I don't think I will use anything else anytime soon.  So easy to use and tons of apps to choose from, you cannot go wrong with any Apple mobile device.", "Date": "August 16, 2012"}, {"Title": "Question From a Non-Techie", "Author": "Mary D. Cole \"MDC\"", "ReviewID": "R2HFDOON7WM1IB", "Overall": "5.0", "Content": "I've read that you can get a free iOS 5 download for the iPhone 4. What would be the key benefits of such an update?I don't currently even have a cell phone. My wife has the 4s and wants me to also have a phone on a family plan. From extensive reading I  believe I would be satisfied with the 4 while my wife believes I should get the 4s. Still, I would like to understand (in a non-techie way) how the iOS 5 update would narrow the difference between the 4 and the 4s.BTW, our Amazon account is in my wife's name. My first name is really not Mary (-:Thank you, rlc p.s. Hopefully, a Factory Unlocked iPhone 4s is the same as a regular iPhone 4s. Going through all those categories in the \"Insert a Product Link\" is confusing. Apple iPhone 4S 16GB Black - FACTORY UNLOCKEDApple iPhone 4 16GB Smartphone Black (AT&T;)", "Date": "April 16, 2012"}, {"Title": "Really Great", "Author": "App Trailers", "ReviewID": "R2UT45AARD1UE9", "Overall": "5.0", "Content": "Its really good,fast,and easy to use like all iphones its great.You can make free money from it tooGo to the' AppStoreDownload app trailersEnter the code idk456 for one of the gift cards", "Date": "March 14, 2012"}, {"Title": "iPhone 5 is launching today... I still love my iPhone 4S", "Author": "Bishal Adhikary", "ReviewID": "R1C1YQAV895SSM", "Overall": "5.0", "Content": "the highly awaited gadget of the year by the mighty company Apple is being launched today. But I am not very much excited about the new iPhone because as seen in the leaked images ([...]), it doesn't look very promising. I love my iPhone and with the personalizations I have made on it, I guess it is the best suited smartphone for myself.", "Date": "September 12, 2012"}, {"Title": "Apple \"Just Works\" ROFL", "Author": "DAVID \"Crosslines\"", "ReviewID": "RBD6TUX9RNUWB", "Overall": "1.0", "Content": "Apple \"just works\" like Siri \"just works\" I'm stuck with this iphone that doesnt work as advertised. I went to Apple store and they were glad to lie to my face about how great Siri is. It rarely works. And if you say more than 3 words it doesnt understand anything.", "Date": "March 31, 2012"}, {"Title": "can anyone answer me a question?", "Author": "sherry", "ReviewID": "R29XQSPGJ4NH2O", "Overall": "3.0", "Content": "i want ask a question, is this phone a locked phone or unlocked? can i used it in other countries?", "Date": "May 23, 2012"}, {"Title": "You will never want another phone again!", "Author": "Dane", "ReviewID": "RM8Q9G1TG14NJ", "Overall": "5.0", "Content": "I have had every Apple iPhone since the 3G came out.  I will never go to another cell phone again because of the high quality of the product and the large selection of apps that are available.  The iPhone 4S builds on the great features that already existed by adding Siri, advanced voice recognition technology that can interact with you and actually understand normal human speech - like \"schedule me an appointment with Lisa tomorrow at 6pm\"...Siri gets that.  The battery life on the iPhone 4S is amazing as well.  Buy an iPhone and you won't be disappointed.", "Date": "February 6, 2012"}, {"Title": "Buyer beware", "Author": "JRay", "ReviewID": "ROO5HE0ULALEQ", "Overall": "1.0", "Content": "If the price is to good and there is no tracking number, beware. We ordered a product and was given an arrival date. It never arrived and Amazon said to wait another week. We called our credit company and canceled the transaction. These guys are long gone!", "Date": "April 10, 2012"}, {"Title": "I am convinced this is a flawed system, if not a fraud", "Author": "J. Xin", "ReviewID": "R17QKEO6D87O9Y", "Overall": "1.0", "Content": "I charged it overnight. In the morning, it shows 100% battery. I left it at home. So It was on stand-by for about 24 hours before I got back the next morning. It has 20% left. I tested on another 3-year old BlackBerry Storm2. It has 80% left the next morning.Today I used my Iphone 4S to record some street walks. One recorded file is ~439MB. It ran out of disk space. So I pulled out the BlackBerry to record more. Returning home, I copied several video files off the BlackBerry including one ~450MB to my Free Agent external back up hard drive USB2.0. It went just fine. Then I copied several video files off the Iphone 4S. It hung on the 439MB file for ~2 minutes. Then it gave up without warning. That is, on the USB hard drive, it shows 0 KB. I then carefully inspected all the videos files of similar sizes. There are 6 files set at 0 KB on the destination USB hard drive.In my personal history of copy and pasting, first time a system copies and sets the size to zero as the Iphone did. This never happens even when coping files with a floppy disk. The USB hard drive has about 100GB left.Using password log-in is  not very lucky. My password once started with number 9. When I put in number 9, it often landed on Cancel key. I had to try several times to make it work. I also have to push the OK key several times to make it accept the password.This is a phone my company gave me. I have no plan and intention to buy anything from Apple Store. But to install app, I have to create Apple ID. The problem is that if you don't give Steve Jobs your credit card number, it keeps on asking you for your billing address. Well, I provided a valid address: my company's address. It refused to take it...I will ask my company to give me a phone that supports free Cisco VPN app installation without me having to give up my credit card number and residential address.Sometimes if you view youtube video clips, older ones do not release memory so that I have to power down and reboot the whole thing.Overall, it is a system that does not do basic things well. It seems to have sacrificed too much for the nice video features. Its memory and hard drive storage smell suber-par compared to regular SD card performance.", "Date": "December 30, 2011"}, {"Title": "question", "Author": "Paola Camargo", "ReviewID": "R1S36O2SZEEIK1", "Overall": "5.0", "Content": "hello i have a question about this cell phone, need to know if this phone is unlocked. nowhere is that I see a sign saying so", "Date": "May 31, 2012"}, {"Title": "The best small phone I have ever owned", "Author": "Brian Hammerman \"brian\"", "ReviewID": "R19873HOWS2L08", "Overall": "5.0", "Content": "The iPhone 4 is a touchscreen slate 3G smartphone developed by Apple Inc. It is the fourth generation iPhone, and successor to the iPhone 3GSIt is particularly marketed for video calling marketed by Apple as Face Time LED back lit  960×640 display. The iPhone 4 features an additional front-facing VGA camera, and a backside-illuminated 5 megapixel rear-facing camera with a 3.85 mm f/2.8 lens[ and an LED flash. The rear-facing camera is capable of recording HD video in 720p at 30 frames per second. The iPhone 4 is powered by the Apple A4 chip  ARM Cortex-A8 CPU PowerVR SGX 535 GPU so i love this phone the batter life is great playing video games on it is amazon so get one if you wont to go to apple side ps this is the sprint pcs GB one", "Date": "May 15, 2012"}, {"Title": "Damaged head set", "Author": "Shalini Harikrishnan", "ReviewID": "R1B4XY2SO33OKX", "Overall": "3.0", "Content": "Head set is damaged. It would be greatful if you are able to send a good head set..I'm satisfied with the iphone except for the headset damage..", "Date": "April 26, 2012"}, {"Title": "The worst phone I've ever owned, again.", "Author": "Phillip", "ReviewID": "RY5SN88UF41TH", "Overall": "1.0", "Content": "So I promised to myself after the 3Gs no more iPhones ever again.... Well I lied... I broke my HTC Evo 4G and was eligible for an upgrade. NOTHING has changed with this phone :/ I can do so much more with my rooted HTC than Iphone will ever be able to do... Even over clocked the iPhone doesn't put out half of what I was getting... Great phone for beginners, old people, or those who don't know much about electronics and want to pretend they do (Every girl in California)... Guess I'm just going to have to suck it up and buy the GS3 or Evo LTE next week at full price...", "Date": "June 28, 2012"}, {"Title": "Best Phone", "Author": "SgtMaj", "ReviewID": "RM9L5PAR4KEPZ", "Overall": "4.0", "Content": "This phone is the best ever. It is fast...the dream cell phone.The only thing that has not help is AT&T;! Data plan is not so good.Very hard to get on the internet or search anything. The cell phoneis all anybody can think of. the Phone is 100% ready but the plan may bethe downfall. There are a total of four 4S 16GB in this house. that is the storyand I am sticking to it!", "Date": "December 17, 2011"}, {"Title": "iPhone 4s is AMAZING!", "Author": "J", "ReviewID": "R36N5AIPU4S84C", "Overall": "5.0", "Content": "Best phone I've ever had, I didn't buy this specific product (mine is Sprint) but needed to review so Amazon would recommend better products.", "Date": "November 9, 2011"}, {"Title": "Be sure to activate your new phone at the store", "Author": "Amazon Customer", "ReviewID": "R71JUG7BIZCUC", "Overall": "3.0", "Content": "I bought an iphone 4s to replace my wife's old iphone for Christmas at an ATT store. They gave me a new sim to sneak into the old phone so she could use it until the new phone was activated. I assumed that meant powering on and letting the phone register. WOW!!  Activating the iphone is the worst plan I have ever seen. Between the ATT and Itune web pages it is a complete circle jerk. We are now waiting until the store opens to activate the thing.I gave the phone 3 stars because I think it will be great once we get it activated. Just be sure not to leave the store without the phone activated.", "Date": "December 25, 2011"}, {"Title": "Iphone 4s, 5 whatever...", "Author": "Ken", "ReviewID": "R2D3KC6JVV6AKW", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3R9235XAJ5ULNembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3R9235XAJ5ULNrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3R9235XAJ5ULNchiDiv\").innerHTML = document.getElementById(\"cv_mo3R9235XAJ5ULNhiddenPre\").innerHTML;\n};\ncv_mo3R9235XAJ5ULNrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3R9235XAJ5ULNso;\t   \n\n\nfunction cv_mo3R9235XAJ5ULNloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3R9235XAJ5ULNso = new SWFObject(swfLocation, \"cv_mo3R9235XAJ5ULNAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3R9235XAJ5ULNso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3R9235XAJ5ULNso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3R9235XAJ5ULNso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3R9235XAJ5ULNso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3R9235XAJ5ULNso.setAttribute(\"height\", swfHeight);\n          cv_mo3R9235XAJ5ULNso.setAttribute(\"width\", swfWidth);\n          cv_mo3R9235XAJ5ULNso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3R9235XAJ5ULNso.write(\"cv_mo3R9235XAJ5ULNflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3R9235XAJ5ULN', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3R9235XAJ5ULN';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3R9235XAJ5ULN', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3R9235XAJ5ULNloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3R9235XAJ5ULN\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m29B5KEP995GIM\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m29B5KEP995GIM\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2D3KC6JVV6AKW\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m29B5KEP995GIM/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3R9235XAJ5ULNduration')) {\n      document.getElementById('cv_mo3R9235XAJ5ULNduration').style.display='none';\n    }\n    cv_mo3R9235XAJ5ULNloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3R9235XAJ5ULNloadSwf(movieID, playerVersion) {\n   return _cv_mo3R9235XAJ5ULNloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3R9235XAJ5ULNnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3R9235XAJ5ULN', 0, h);\n}\n\nfunction cv_mo3R9235XAJ5ULNresetPlayer(w,h,bw,cc) {\n  cv_mo3R9235XAJ5ULNnewHeight(h);\n\n  cv_mo3R9235XAJ5ULNso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3R9235XAJ5ULNso.addVariable(\"cacheCode\", cc);\n  cv_mo3R9235XAJ5ULNso.setAttribute(\"height\", h);\n  cv_mo3R9235XAJ5ULNso.setAttribute(\"width\", w);\n  cv_mo3R9235XAJ5ULNso.write(\"cv_mo3R9235XAJ5ULNflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3R9235XAJ5ULNRollOverImg = new Image();\ncv_mo3R9235XAJ5ULNRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91xpfdgrjaS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3R9235XAJ5ULNpreplay = document.getElementById('cv_mo3R9235XAJ5ULNpreplayImageId');\nif (cv_mo3R9235XAJ5ULNpreplay) {\n  cv_mo3R9235XAJ5ULNpreplay.onmouseover = function() {\n    cv_mo3R9235XAJ5ULNpreplay.src = \"http://ecx.images-amazon.com/images/I/91xpfdgrjaS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3R9235XAJ5ULNpreplay.onmouseout = function() {\n    cv_mo3R9235XAJ5ULNpreplay.src = \"http://ecx.images-amazon.com/images/I/91xpfdgrjaS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3R9235XAJ5ULNpreplay.parentNode;\n\n  var cv_mo3R9235XAJ5ULNcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3R9235XAJ5ULNcurrentClick) {\n      return cv_mo3R9235XAJ5ULNcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 5:09 MinsHere we review the Iphone 4 and talk about the future Iphone 5... so get in line.John and Ken", "Date": "February 10, 2012"}, {"Title": "ICopy Android Lots of Android Features taken", "Author": "Brock", "ReviewID": "R2HHIUGSD6P8D9", "Overall": "1.0", "Content": "Battery life sucks period.  Very Fragile Watch out! IOS is not as good as android's Ice Cream Sandwich which is way more refine and way more powerful.  The best features of this phone is a copy of android features but the copied features are not good.  Too Little to Late.  Multitasking (taken from android) still need work.  It is still not true multitasking.  The New notification bar (taken from android) not even close to android, androids notification bar is customization. Siri another rip of google voice command from 4 years ago still needs work.  Icloud another copy of android cloud sync is still in the baby stages.  Apple is copying android, the features copied from android are still in the baby stages as you can tell when you use the phone.  I rather not get a phone that lacks features like navigation, true multitasking, true cloud base and more.  Get the Galaxy Nexus, IOS = IFail.", "Date": "December 31, 2011"}], "ProductInfo": {"Price": "$699.00", "Features": "8 mega pixel camera with full 1080p video recording\nSiri voice assitant\niCloud / App Store / Air Print / Retina display\nUMTS/HSDPA/HSUPA (850, 900, 1900, 2100 MHz); GSM/EDGE (850, 900, 1800, 1900 MHz)\n802.11b/g/n Wi-Fi (802.11n 2.4GHz only)", "Name": "Apple iPhone 4S 16GB - AT&T -", "ImgURL": "http://ecx.images-amazon.com/images/I/412fjFwu-jL._SY300_.jpg", "ProductID": "B00CL8XDF8"}}