{"Reviews": [{"Title": "good quality", "Author": "Daniela", "ReviewID": "R1G40HANBQD81V", "Overall": "5.0", "Content": "The phone works perfectly on t-mobile. Haven't had any problems with the functionality. Phone was in great shape, delivered quickly and set up was a breeze.", "Date": "July 30, 2013"}, {"Title": "Nokia Lumia 810 phone through T-Mobile", "Author": "Mitch Brock", "ReviewID": "R275Y14X5T7AGS", "Overall": "5.0", "Content": "Wow. I really love this phone. I like the windows 8 OS much better then any other smart phone OS.Even though would like to see more flash memory. I am thankful that you can add 64GB of memory to it by using s micro SD memory card. The camera is very nice and with the Nokia smart cam it makes it even better. Plus the many other lens apps that you can download to it. I would like to be able to download apps to the micro SD card. It would save the flash memory on the hard drive on the phone. Processor is fast and really is up there among the best of them. Over all I can that everything on this phone happens to be very nice. Over all a great phone that I would recommend to anyone.", "Date": "November 8, 2013"}, {"Title": "It does everything!", "Author": "Judy W.", "ReviewID": "R1MNG0CRO1LX6Y", "Overall": "5.0", "Content": "I've been waiting over a decade for a Windows phone to be invented. It stores documents in SkyDrive, which I can pull up on my phone, edit, and email. I can work with pdf or any doc attached to an email. The tiles make it easy to use. The navigation has directions and even public transit directions. Nokia has a ton of apps, including ESPN, TV, and City Lens, which views your surroundings and tells you what businesses (i.e. restaurants, convenience stores) are nearby. A ton of free apps, too, like a translator (which translates text, spoken word, or a photo), flashlight, games, and great radio streaming. I love this phone! The only downside is that the battery depletes quickly. I have to charge it every night & carry a battery charger.", "Date": "April 24, 2014"}, {"Title": "Nice sweet spot of cost vs features, not sure why it not made anymore.", "Author": "Jaime", "ReviewID": "R2VR2R6L5I2QBS", "Overall": "5.0", "Content": "If you are looking for a nice WP handset with some more features than the entry level 520/21's, but don't won't to go into too high of price range, this is a perfect phone. Does not have the super-duper camera of the top-of-the-line, but takes very acceptable photos. It supports all the other features (NFC, City Lens, Compass, etc.), not found on the basic Nokia phones.Call quality is very clear and loud when listening and I have people remark that it sounds very good on the other end as well. Battery life is pretty good. I normally remember to charge it during the day at work; but when I haven't, I still can go more than a day on a charge (although, I mostly use if for phone/checking email, and a little web lookup)Only real problem is availability, for some reason, Nokia only made these for a very short period of time, but they still can be found new.", "Date": "January 21, 2014"}, {"Title": "Perfect Phone for me", "Author": "Arcadio Ruiz", "ReviewID": "R28O27OWOR9B6I", "Overall": "5.0", "Content": "This phone is amagizine , has a ver good camera , many application in the market(all the ones that care me), and very important is the office compatibility.The voice reconize is very good, i always use to avoid to search manually the contacts in the phone.\\Great product hardware and great OS.", "Date": "January 3, 2014"}, {"Title": "BETTER THAN EXPECTED", "Author": "31f", "ReviewID": "R193L87F7SE2Z6", "Overall": "5.0", "Content": "I ONLY HAVE THIS PHONE FOR JUST ONE WEEK. AT THIS TIME I LIKE THIS PHONE MUCH BETTER THAN NOKIA 900 AND OFCOURSE BETTER THAN NOKIA 710 . SOUND CLARITY IS TOP NOTCH AND CAMERA IS VERY GOOD, DOWN LOAD IS VERY FAST. I WILL GIVE AN UPDATE MY REVIEW IN 6 MONTH THAT IS WHEN YOU REALLY BE ABLE TO REALLY KNOW THE GOOD THE BAD AND THE UGLY.", "Date": "August 24, 2013"}, {"Title": "good quality", "Author": "Mark A. Semet \"goodbook\"", "ReviewID": "R2NWODH9Z0SZDL", "Overall": "4.0", "Content": "So far it stacks up quite well to another 810.  A great model phone at a good price.  Consider it.", "Date": "January 9, 2014"}, {"Title": "Love it!", "Author": "Unity", "ReviewID": "R2T8D1RCMY4D7", "Overall": "5.0", "Content": "I've had this phone for about a week now, and I love it! I don't really have anything bad to say about it at this time.", "Date": "December 30, 2013"}, {"Title": "Nokia Lumia 810 8GB Unlocked GSM Phone with Windows 8 OS", "Author": "Krishna Chaitanya", "ReviewID": "R1T1MQ9ABM6IQ6", "Overall": "5.0", "Content": "Got this before the estimated date of delivery. Unlocked. Supports 4G depending upon the network provider.May look bit bulky for some. Nice phone overall.", "Date": "November 23, 2013"}, {"Title": "Very good, solid phone", "Author": "xrye \"Sean\"", "ReviewID": "RD2CB2LCVZIZJ", "Overall": "4.0", "Content": "This phone is great for everything. Easily get contacts from hotmail, gmail and facebook account. Very friendly! The GPS and Camera are very good. Wifi works smoothly. The only problem is that I still cannot connect via cellular data. The APN is active, 4G signal also show up. Just cannot connect to internet. I tried it with ATT and Lycamobile networks, neither works. Otherwise I will give five stars. Can anyone have a suggestion for the problem?", "Date": "November 19, 2013"}, {"Title": "Fair enough to give a 4 star after 5 months' use", "Author": "Lucy Z.", "ReviewID": "R3SL8B38RFY1VX", "Overall": "4.0", "Content": "I decided to edit a review and give it a four star instead of three.  After using it for 5 months, these are something I noticed form the phone.1)The W8 system is fast most of the time after 5 months.  Not like the Andriod I used last time.2)The battery time is about 2 days with wifi off and less than 1 day with wifi on.  Not as great as I expected but can be accepted.3)I have problem playing the vedios in my WeChat and haven't figure out how to solve it.4)I happened to dropped it several times to the ground.  There were twice the battery came out the the back cover apart from the phone.  The back cover was worn at the corner because of the drop but the screen and the phone is fine.5)The screen is sensitive, it can be used when I have my gloves on, but not as sensitive as usual.So, if you want a phone with reasonable price and acceptable performance, this one can be considered.", "Date": "August 6, 2013"}, {"Title": "Not Unlocked", "Author": "vivek", "ReviewID": "R2NDMICCLEKJVQ", "Overall": "1.0", "Content": "I bought this mobile thinking it is unlocked but it is locked...If I insert the card of different provider its asking for a pin", "Date": "February 15, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Windows Phone 8 OS; 1.5 Ghz dual-core processor\nNokia Drive navigation\n8MP Rear-facing camera + 1.2MP Front camera; HD 1080p video recording\n4.3-inch, 800x480 OLED display including Nokia ClearBlack technology\n8GB internal memory + microSD card slot for up to 32GB", "Name": "Nokia Lumia 810 8GB Unlocked GSM Phone with Windows 8 OS, 8MP Camera + Seconday 1.2MP Camera, Video, Dual-Core Processor, Dolby Sound Enhancement, Nokia ClearBlack Display, 4.3\" AMOLED Touchscreen, GPS, Wi-Fi, Bluetooth, MP3/MP4 Player, SNS Integration and microSD Slot up to 64GB - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41HKukRESZL._SY300_.jpg", "ProductID": "B00CXRTI74"}}