{"Reviews": [{"Title": "best phone ever", "Author": "victorb", "ReviewID": "R1EQVF4QHN9VME", "Overall": "5.0", "Content": "At first I was a little worried that the phone would betoo small for me but I didn't want a big phone so I went with this anyway and it's actually perfect! It doesn't lagg, the camera is great for taking pictures and videos of my grandkids although I still have yet to learn how to upload them to the internet it's great for me! I love this phone and absolutely give it my recomondation", "Date": "October 24, 2013"}, {"Title": "Excellent", "Author": "Felipe E.", "ReviewID": "RO95ABYKHB1SC", "Overall": "5.0", "Content": "I needed an unlocked phone to upgrade my old Nokia (7 years old) without changing my current plan. I removed the micro card from my old cell and installed in the new Galaxy Ace S5831...everything is working perfectly in my new smartphone.", "Date": "January 8, 2014"}, {"Title": "minimum smart phone - good price, but....", "Author": "France R.", "ReviewID": "RFRFGZC8867WE", "Overall": "3.0", "Content": "no back camera, poor front camera, slow, the minimum.  however, it is unlocked and it is a smartphone.  there are others, albeit without the brand name, though, that far exceed the capabilities of this one.", "Date": "December 10, 2013"}, {"Title": "Small but efficient", "Author": "quin n.", "ReviewID": "R3EG10RFNQPDLA", "Overall": "5.0", "Content": "Small but okay does what I expect it to do. Cases are not easy to find in the US. Nice features.", "Date": "November 13, 2013"}, {"Title": "GREAT PHONE", "Author": "eli", "ReviewID": "R3SIJZE5ZL0IBK", "Overall": "5.0", "Content": "WORKS GOOD, ITS THE SAME IN THE PICTURE I LIKE A LOT MY NEW PHONE HAVE I FEW FEATURES THEN I LOVE. WAS A GREAT PURSHACE.", "Date": "November 8, 2013"}, {"Title": "Worst cell i've had", "Author": "D.R.C.", "ReviewID": "R14OER2SBKWAMT", "Overall": "1.0", "Content": "The worst cellphone i have had, is too laggy and slow, i cant even use whatsapp like i should, i have to delete all the call logs so that the internal memory gets some space and the cell doesnt start crashing whenever i open an app. I'm going to give away this cell and buy an iphone.", "Date": "November 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DV9LG1O"}}