{"Reviews": [{"Title": "Excellent Straight Talk phone, uses Sprint cell towers", "Author": "Cable Monkey", "ReviewID": "R3H7RYUNA16U0U", "Overall": "5.0", "Content": "This is one of the best Straight Talk phones available.  The screen is a little larger than the one on my S2, and the Android version is newer. As with all Straight Talk phones, cell reception is dependent on which carrier that model is attached to.  In this case, the Straight Talk Galaxy S3 uses Sprint towers, so it's a great choice if you have good Sprint reception in your area.  If you don't have good Sprint reception in your area, I recommend you get the Straight Talk Galaxy S2, which uses AT&T; towers.", "Date": "December 13, 2013"}, {"Title": "Great phone!", "Author": "Jennifer H.", "ReviewID": "RXZB82T80BVQ8", "Overall": "5.0", "Content": "I love this phone. Best phone I've ever owned. Received with one minor scratch on the front screen, but not even recognizable with a screen protector. I have had this phone for 2+ months and have had no problems thus far. Would definitely buy from this seller again.", "Date": "November 29, 2013"}, {"Title": "quality and knock off", "Author": "erica kenenitz", "ReviewID": "RBIZKXKEEN225", "Overall": "1.0", "Content": "The reason its so cheap is because its a knock off version of the s3 all they did was put a samsung sticker on it. The price you pay is the quality of the phone you get. Would not reccomend this phone. My friend bought this phone and the screen was so busted and damaged still fighting for their money back", "Date": "June 5, 2014"}, {"Title": "Galaxy s", "Author": "John A. RUSS", "ReviewID": "R3A10HTDNI0AFM", "Overall": "5.0", "Content": "It's a great deal. Love  the phone. Would reccomend to any one.And it's so simple to use this great phone", "Date": "April 6, 2014"}, {"Title": "Is a good seller and trust worthy", "Author": "Lexi", "ReviewID": "R1DPSDBIFBI4AF", "Overall": "5.0", "Content": "This person is good and communicate with you ass soon as she can.  I had a problem and she fixed it in a hurry.  i would suggest buying from her to any of my friends and or family.", "Date": "March 11, 2014"}, {"Title": "Good Phone", "Author": "Joseph", "ReviewID": "R13KGH335JJLG3", "Overall": "4.0", "Content": "This phone is a very well made phone, it executed apps and other programs without flaw. The only disadvantage to this phone is that you can't stream videos as well using straight talk coverage. You are supposed to be able to get 4G but I have yet to see 4G on my phone. But this is not the phones problem it is the network provider. So overall a great phone.", "Date": "February 28, 2014"}, {"Title": "Love the phone!", "Author": "Carrie Warnecke", "ReviewID": "R3K0TFLQJ9OHKR", "Overall": "5.0", "Content": "Great phone for the price. I love that you can be able to download apps and be able to do things faster than my old android smartphone could. Very happy with the phone.", "Date": "February 16, 2014"}, {"Title": "love this phone", "Author": "rose", "ReviewID": "R27YZK8XXH0XY3", "Overall": "5.0", "Content": "Very excited to get it :). There was none in stores or walmart.com and none at straight talk website. Got this phone yesterday very fast shipping.  Paid almost 500 but its well worth it. This is the best straight talk phone out there. I would diff. Buy from this company again.", "Date": "February 22, 2014"}, {"Title": "wonderingwhitney", "Author": "whitneyl", "ReviewID": "R3NJ2EUZOZS10R", "Overall": "4.0", "Content": "I'm really thinking about purchasing this soon. But I do have a quick question. Is it new? I seen a couple reviews that say the phone has a scratch or a knick on it and I'm just wondering if it's new or if the problems happened during the shipping?", "Date": "May 14, 2014"}, {"Title": "bad seller", "Author": "Dawn Shumaker", "ReviewID": "R1KSQHUQ3PKO63", "Overall": "1.0", "Content": "was advertised as a straight talk phone when in fact it was not. paid over $400 for this phone and cannot send or recieve mms messages picture messages and worst of all can only get 3g on a 4g lte phone. do not buy from this seller ever", "Date": "March 29, 2014"}, {"Title": "I love the phone but. .", "Author": "Megan peacock", "ReviewID": "R138ASGVELZNL4", "Overall": "2.0", "Content": "Can't send pictures and the back is chipped a little piece at the bottle.But other then that I love this phone!", "Date": "March 12, 2014"}, {"Title": "could not activate.", "Author": "mrsford", "ReviewID": "RPEWTEMNKR2Y7", "Overall": "1.0", "Content": "The one i received had a bad serial/imei number. Straight talk claimed it was stolen or not scaned right, so get a receipt and date of purchase if you buy.", "Date": "February 22, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Straight Talk Samsung Galaxy S III Prepa", "Name": "Straight Talk Samsung Galaxy S III Prepaid Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/413o5vtAS7L._SX300_.jpg", "ProductID": "B00D0NU6RQ"}}