{"Reviews": [{"Title": "Work around is possible", "Author": "Michael R Spence", "ReviewID": "R2SC2TQ37DOAWJ", "Overall": "4.0", "Content": "If you do a google search for \"bypass activation optimus zone\" this phone will become a lot more useful to you.  I currently use mine with GrooveIP to make free calls anytime I have wifi access.", "Date": "December 1, 2013"}, {"Title": "LG Optimus Zone limited plan", "Author": "Gluten Free Girl", "ReviewID": "R2OPT67E5834IU", "Overall": "3.0", "Content": "This phone can only be used with a $60.00 or $70.00 per month phone plan. I was hoping to use it with a plan where you only pay for the days you use the phone, which you can't do with this phone.....", "Date": "September 16, 2013"}, {"Title": "NOT AS ADVERTISED", "Author": "Barron J. Barton \"BJB\"", "ReviewID": "R2G8CO4F6MI4YS", "Overall": "1.0", "Content": "Purchased this phone expecting to use it with Verizon's pay as you go plan. Verizon informed me that this phone will only work with their $60 or $70 a month plans.Amazon needs to update the product information for this phone.", "Date": "October 7, 2013"}, {"Title": "Awesome phone, great for beginners", "Author": "Trance Pacifica", "ReviewID": "RKX2UX1EKL3VN", "Overall": "5.0", "Content": "Decent priced phone. Easy to navigate and customize.Also has 3G, not bad for a prepaid.Great smart phone for beginners.", "Date": "December 9, 2013"}, {"Title": "VERY disappointing phone, lacking many common features", "Author": "Nagronsky \"Nagronsky\"", "ReviewID": "R2QLNHJN3S66WQ", "Overall": "2.0", "Content": "OK, so this was my first \"smart\" phone, and after more than SIX hours on the phone with both Verizon & LG support, I finally got it activated. That should have been an indication of things to come, I think this phone was rushed onto the market because:No ability to assign contacts their own ringtones......even my first cell, a cheap Tracfone had that ability. 10 out of 11 LG support staff people said that I should be able to take it to a Verizon store & they would show me how to do it. One said \"no how, no way\". I took it to my local Verizon store, & they were astonished to see that that one LG person was right......no individual ringtones: you can have one & one only. Additionally, you cannot have no ringtone for a contact, so people that I don't want to hear from.....it's gonna ring. Verizon suggested that LG issue an upgrade, but who knows?No ability to batch-delete call history.....scroll down, & delete them one at a timeMissed calls that go to voice mail don't show up on the Call Log, and there's no indication that you have voicemail. How lame is that??Crap battery life, which was something that seems a common complaint with this phone, even when not using apps or Web browserLousy cameraI'm going back to my LG V8300, & hope it forgives me. The Optimus Zone sucksPS- LG asked me to review my new phone. Evidently that's only if you give a positive review, since all three times I submitted a review, they were rejected. No chance, no how, no way!!", "Date": "May 6, 2014"}, {"Title": "LG Optimus Rating", "Author": "ilene fay", "ReviewID": "R1KZY58BSD7UAA", "Overall": "5.0", "Content": "I just love this phone. It does everything that I wanted it to do. I would highly recommend it to my friends.", "Date": "April 15, 2014"}, {"Title": "Great smart phone, great company, great price!", "Author": "Margaret Cast", "ReviewID": "R1X9062GFRFT9V", "Overall": "5.0", "Content": "It's a good smart phone for a great price. Highly recommended for anyone looking for a reliable and efficient cell phone!", "Date": "December 5, 2013"}, {"Title": "Get the LG Optimus Dynamic instead.", "Author": "Mark Feuerborn", "ReviewID": "R5RIVBSVVOD15", "Overall": "3.0", "Content": "I bought this phone thinking I was going to able to connect it to Page Plus's $30 per month plan. Unfortunately, Verizon locks all of their prepaid phones into their service for at least 6 months after activation. Verizon's prepaid plan is ridiculously priced ($60 per month), so if you want Verizon coverage for 20 dollars cheaper, buy the LG Optimus Dynamic for Net10. Both are CDMA phones, so they both use Verizon towers.", "Date": "March 13, 2014"}, {"Title": "My first smartphone, the gift that keeps on giving", "Author": "Joie Fulton", "ReviewID": "R120JGMTYQ4HON", "Overall": "5.0", "Content": "I can understand why this phone has reviews all over the place. The screen is not visually impaired friendly; it's a challenge to put together, and you don't get monthly bundles like you do with other phone plans. However, if you are looking for a budget friendly smartphone for the beginner, this is the one to get. I really had to sit down with the Verizon people to get my phone activated verified and registered. However, it IS worth it. If you want to adjust things with the services, just go to Verizon.com. It works best with the $60 $70 prepaid plans but it is worth it.", "Date": "December 5, 2013"}, {"Title": "I really like this phone!", "Author": "Samantha Watson", "ReviewID": "R2MIITE29M1T9G", "Overall": "5.0", "Content": "If youre looking for a phone that is a smart phone this is the way to go. It does everything that the other smart phones do.", "Date": "January 24, 2014"}, {"Title": "Time to make a change", "Author": "MizzKittie", "ReviewID": "RAQXAQWD8MQW0", "Overall": "3.0", "Content": "December would be a year since I've had this phone but I'm getting a new one soon. At first it was great (like MOST phones in the beginning) but now its a pain in the butt. It drops my calls, makes unwanted calls without me touching the screen, cuts off my games while in the middle of playing and that's just a few of the problems. Just tired of the crap. Overrall its a nice starter phone for a new android user but once you get the hang of it, you'll quickly want a new android.", "Date": "June 8, 2014"}, {"Title": "Good inexpensive 'smart phone'", "Author": "Kelly", "ReviewID": "R135L628ROUWCD", "Overall": "5.0", "Content": "Good inexpensive smart phone.  Phone is smaller then what I thought it would be.  Simple design makes it easy to use.", "Date": "June 7, 2014"}, {"Title": "LG Optimus Zone Prepaid Phone (Verizon Wireless)", "Author": "Amina", "ReviewID": "R2SP6KDOW4IASN", "Overall": "3.0", "Content": "The phone is good for what it does.  It is only a 3g, but it gives decent service through Verizon.", "Date": "May 18, 2014"}, {"Title": "Great phone!!", "Author": "Jo", "ReviewID": "RXEUQ0GXMHNEB", "Overall": "5.0", "Content": "The rest of the family has one so went w this phone again for my teenage son. have no problems with this phone. compact and up to date. AWESOME price!!", "Date": "March 9, 2014"}, {"Title": "Can pay for per usage! Read how below.", "Author": "Benny Cross", "ReviewID": "R5PFKTSS1NV1L", "Overall": "5.0", "Content": "I think Verizon has changed their Smartphone prepaid plans now and this phone currently falls under the $45 unlimited talk/text and 500 mb data.  Not bad if you are light on the internet and do indeed talk/text alot.  But for our purposes this plan is a little too much.  This was a gift from Grandma for our 6 year old \"smart boy\" that needs a \"smartphone\" according to grandma.  So I called Verizon to explore my options and after extensive questioning I found that you can add whatever amount of money you want and be billed 25 cents per minute/ 20 cents per text.  The data is something like 5 cents a mb.  But what I did was add $20 to the phone, disable the data and hook up to wifi.  Voila!!! The kid can now make a quick call or two, download and play all the games he likes and we aren't committed to a monthly prepaid bill. And I don't know about that unlocking the phone stuff, was a little skeptical of all that.  But we'll try this out and as far as I can see this phone can grow with him for a little while.", "Date": "April 8, 2014"}, {"Title": "prefect for my 8 yr old son", "Author": "Theresea Robinson", "ReviewID": "R1K37O6WMG09YP", "Overall": "5.0", "Content": "i got this phone for my 8yr old son b-day and he loves it he downloads and plays games on it !!", "Date": "March 24, 2014"}, {"Title": "for my wife", "Author": "david jaybird", "ReviewID": "R5L7TZ4X4H4AV", "Overall": "3.0", "Content": "I bought this phone for my wife so she could call her daughter anytime and not just on weekends. The problem is this is first touch screen we have ever owned. I bought a stylus for it because of my big fat finger. My wife wants free games to play on it but I haven't been successful in putting any on the phone. It is a work in progress for us", "Date": "March 5, 2014"}, {"Title": "Great low end phone, but would not work with Page Plus", "Author": "Gordon H.", "ReviewID": "R15HXN3FQO3LA0", "Overall": "4.0", "Content": "I returned it becauase it would not work with page plus.Purchased elsewhere & now that one works with Page Plus", "Date": "April 9, 2014"}, {"Title": "Optimus  Zone", "Author": "robert plath", "ReviewID": "R3L1EYSDCFNNHT", "Overall": "4.0", "Content": "Met what I wanted in low-end smartphone @ low price. Not unpleased at all since the phone does what I need it to do.", "Date": "January 9, 2014"}, {"Title": "DISAPOINTMENT  IN AMAZON", "Author": "EDITH KEETON", "ReviewID": "R2RI16F06P2KBF", "Overall": "1.0", "Content": "HAVEN'T HAD THE CELL NOT EVEN A MONTH, I HAD PUT $45.00 BOUGHT SID CARD, AND A BUBBLE COMES UP ON CELL, I'VE NEVER BEEN SO DISAAPOINTED IN THIS PRODUCT, IT WAS BAD ENOUGH I WAS BEING CHARGED FOR TWO LG OPTIMUS ZONE  WHEN I ONLY RECIEVED ONE, AND FOR THIS TO HAPPEN, THE ONLY THING THAT HAPPEN, I WAS ABLE TO CHAT WITH SOMEONE WITH YOUR COMPANY, AND HE WAS KIND ENOUGH TO TELL ME WHAT TO DO, AND THAT HE WAS SORRY, I UNDERSTAND THAT ORDERING SOMETIMES GET MIXED UP, AND ORDERS GET SENT ELSE WHERE, AND EVEN PRODUCTS GO BAD, BUT THIS TO HAPPEN WITH A BUBBLE ON THE SCREEN FOR NO REASON, AT ALL. ON MY PART. WAS SO UNCALLED FOR,", "Date": "May 3, 2014"}], "ProductInfo": {"Price": "$79.99", "Features": "Optimus Zone Prepaid Phone (Verizon W", "Name": "LG Optimus Zone Prepaid Phone (Verizon Wireless) - For Prepaid Verizon Smartphone Plan", "ImgURL": "http://ecx.images-amazon.com/images/I/419ozrr7UsL._SY300_.jpg", "ProductID": "B00D8GSY5G"}}