{"Reviews": [{"Title": "Love this phone!", "Author": "Alain Le Lous \"ALLred\"", "ReviewID": "R4E0YRM1WTI8V", "Overall": "5.0", "Content": "This is a great phone, yes sometimes it gets slow but all in all its great and performs great! I play Real Racing 3 and it performs fantastic, the only issue is when I got some apps opened in background, those slows it but it's normal, just be sure there are no more than 4 apps opened when playing this kind of games.So most of the time it performs fast and smooth.I really like the camera even if it has less pixels than the S4. It's very good! Take pictures underwater is not the reason why I bought it, but tried as it's water resistant. Went to my friend's house and took some pics of her huge aquarium. The results were amazing! The only issue is that water penetrates where goes the headphones and then if you try to call, the phone gets confused and thinks there are headphones plugged in; so you cannot talk properly. In my case, I were able to listen to the other person well but when talking that person were not able to listen to me. So the best thing to do is to wait for about 5 hours or more to talk properly (Resolved this by using the speaker).I found that this is normal concerning this device so it's ok.Battery life is ok, not great but it handles the day. If you want it to last the entire day, then don't play games,don't connect to wi/fi and do not download too much things.The sound is great and the screen is amazing, just when you are in outdoors it gets too dark and it gets difficult to look at the screen. Mostly when it's sunny or too lighted but it's ok, not big deal.Add that it comes with the \"torch light\". A gadget to use the led at the back to illuminate in the dark. I found that helpful.I like this phone and I recommend it.No problems to me going into the humid woods of Costa Rica as it's water resistant. That's why it suits me great!I bought a good case protector and now I'm confident that I can carry it anywhere.", "Date": "October 27, 2013"}, {"Title": "Review after purchasing my Galaxy S4 Active", "Author": "christie schuh", "ReviewID": "R3RK2RPKCMR7DD", "Overall": "4.0", "Content": "This phone is great in terms of everything you can do with it. But compared to my Samsung Galaxy 3 it goes way slower, constantly having to switch on and off between WiFi and my mobile network. Now I know most would say this is a problem with the carrier and not the phone itself, but I am still with the same carrier as my S3 and this phone runs sooo much slower. I heard from someone that once you upgrade to the S4 or S4-Active you start to use more data and your network will slow you down after you reach a monthly limit? Also the only other thing I don't like are the buttons on the front, where as the S3 only had a button for the home screen. But again I heard these buttons are necessary for under water mode because the phone can not longer be used as touch screen so you use the buttons instead to take a picture/video.All and all I'm not thrilled but I am happy.", "Date": "October 16, 2013"}, {"Title": "Excelent phone", "Author": "Jaime \"Jaime\"", "ReviewID": "R2QM8DC9V7ZAIK", "Overall": "5.0", "Content": "Love this phone works great use mine with over seas carrier and T mobile with no problem. and the camara takes very good pictures", "Date": "April 12, 2014"}, {"Title": "Product Ratings", "Author": "ROMUALD RENIA ABREU", "ReviewID": "R1NKF91JJ5T77J", "Overall": "5.0", "Content": "100% recommend the product sastifecho am very with the purchase I made and I had no problem with the product", "Date": "April 6, 2014"}, {"Title": "VERY SHADY BUSINESS!!!!! NOT HONEST AT ALL!!!!!!!", "Author": "Jonathan Guy \"Jonathan G\"", "ReviewID": "R3BV7ICLO0I98G", "Overall": "1.0", "Content": "My wife purchased the US version for me about six weeks ago!!!!! What we ended up with is this one, it did not work whatsoever, keep dropping calls, internet did not work, and connection was slow as hell!!!! When we called them about it, they told to return it \"for inspection\"  DO NOT DO BUSINESS WITH THIS COMPANY!!!!!! YOU HAVE BEEN FOREWARNED!!!!!!", "Date": "March 26, 2014"}, {"Title": "Excellent", "Author": "Keisan A.", "ReviewID": "R3637PKQ248N8O", "Overall": "5.0", "Content": "My husband loves this phone. It certainly has not disappointed him. He hasnt really tried out the \"whatever\" aspect of it though.", "Date": "January 9, 2014"}, {"Title": "great nphone", "Author": "Kathy-ann  Mendoza", "ReviewID": "RZ9CI5WDINJAY", "Overall": "5.0", "Content": "It is not as indestructible as the say it is though so be careful. It fell and it did get a dent.", "Date": "October 7, 2013"}, {"Title": "NOT WATERPROOF or even water resistant!  1 week, fail....", "Author": "K. Sandbek \"Kevin\"", "ReviewID": "R2IY9PDZC1IERX", "Overall": "1.0", "Content": "Had it a week.  Rinsed the screen under a faucet..  Guess what, it is NOT waterproof, or water resistant.  Yes, i followed the instructions to the T when assembling the cover/battery about pressing all the special spots to make sure its water tight.Phone now says \"Insert SIM card\" if i try to turn on data, and both front and back cameras have water in the lenses.  Opening the back cover, there's water on the battery and SIM.", "Date": "October 17, 2013"}, {"Title": "Extremely slow, bad battery life, very fragile, horrible phone.", "Author": "Celina", "ReviewID": "R32AXHPB0A4D91", "Overall": "1.0", "Content": "After only having this phone for 3 days the screen cracked after falling 9 inches onto a blanket.  After that I would occasionally just wake up in the morning and find another crack in the screen until it eventually completely shattered one night. The battery life is horrible, it would last at max for four hours and would take forever to charge.  It is extremely slow and occasionally will just stop reading the sim card.  Then there is a huge list of steps that must be taken in order to get it working again.  The camera on the phone is also horrible!! I contacted Samsung about all of these problems, and was told it is not their problem, and to just fix the screen they want $200.  Samsung claims the phone is durable, but I have seen the exact opposite in my experience.", "Date": "February 19, 2014"}, {"Title": "A hoax", "Author": "Mr Awareness", "ReviewID": "RQ5LOTSTEHT2S", "Overall": "1.0", "Content": "They took my money and I waited for 3 weeks and never received my package. They just took my money as like a loan. This is the most unprofessional and biggest gimmic as a company I ever experienced. And if it wasn't for amazon I wouldn't even see my money back.", "Date": "January 16, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D7ZMT0E"}}