{"Reviews": [{"Title": "I LOVE THIS PHONE!!", "Author": "Vickie B", "ReviewID": "R3CZ2WPWQNB4D1", "Overall": "5.0", "Content": "I have been using this phone for almost a month now, and absolutly LOVE this phone!! It is just as fast as the big brother. There are just three features the mini don't have that the S4 has: the drama shot, the duel shot, and the hover sensor. Other than that, you can hardly tell the difference! It has the other bells and whistles as the S4 and comes in a smaller (but not by much) lighter body. This is by far the best mini out there!! For the price, it is a perfect alternative to the S4.", "Date": "August 30, 2013"}, {"Title": "Galaxy S4 Mini - Just the right size with many superb features - Detailed Review", "Author": "Daisy S \"Daisy S\"", "ReviewID": "RKJTMOG6ICNXF", "Overall": "5.0", "Content": "Great phone, one of the best, if not the best I ever used--the screen is 4.3 inches and for me the perfect size! In the past, I owned BIG SCREEN PHONES as Galaxy Note (with 5.3\" screen, too heavy and too big) and wanted something smaller that I could hold in one hand comfortably. Since I am a true techie, I researched this phone for all specs as soon as it was released on several websites. Since this phone has EXCEEDED all of my expectations, here is my very detailed review of this very special and fun to use Mini S4 phone. My goal in this review is to help in your buying decision one way or the other regarding this phone.Kit Kat is coming soon to this phone on the OTA (OVER THE AIR) software update from Samsung. This was announced on several websites on February 23, 2014. So even though this device came with 4.2.2 Jelly Bean, not to worry, if you want Kit Kat, it should be on this phone soon. I tried Kit Kat on the Tab Pro and it is very different, but it is a beautiful OS.Till then, I shall keep on trying to update and keep you informed...PROS:+  SIZE, SIZE COMPARISON and WEIGHT - The screen size is a just right 4.3, I find not too large nor small. Looking at this phone side by side with the older S3 Mini, it is just a bit larger in overall size than the S3 Mini, yet the screen size on this phone is larger and clearer and so easy to read compared to the S3 Mini! Also it is still slim and pocketable like the S3 Mini as it is so lightweight to carry as it fits easily into my jeans pocket or smallest purse. And I purchased a leather vertical case that clips to my waistband so I take it with me to the gym to listen to my music or radio when I work out.+ MICRO SIZED SIM CARD: The S4 Mini has a new type of Micro Sim card slot (Since I had a Sim cutter I bought on Amazon, I simply cut my old standard Sim card, popped it into this phone and it works fine). So you can cut your Sim, or go to a phone store and they will cut it for  you are just transfer your info onto a Micro Sim. The APN settings automatically set up when I set this phone up, so I was able to keep all my plan working great.Info about Sim cards: Standard Sim cards are not being used much in newer phones these days, most of the time Micro Sims are required and some are requiring the newer Nano Sim such as the new Samsung Galaxy S5, and newer Apple phones.+  Phone call clarity etc. - No matter what my location using this phone for phone calls the clarity of calls is loud and clear whether on the phone's speaker, headset etc. I even had to turn down the volume quite a lot as the calls come in so well.+ WiFi/3G (Internet): Connects to any WiFi I have tried very quickly and easily and the signal strength is excellent even when I am far from my router. And when not near a WiFi hotspot, I use AT&T; for data and easily get 3G and found the data to be very fast, almost as fast as my home WiFi is. (For browser, I installed Opera Mini free from Playstore and found it to be a very easy to use and fast browser). The WiFi signal on this phone is VERY STRONG!+ DATA - I get very fast data on my S4 Mini, just about as fast as my WiFi at home. It shows up at 3G+ (I do not have 4G or LTE in my area). Overall, the websites loaded quickly in data. Also, I have a small data plan that I use with my minutes and I have a No Contract Monthly plan which I find very reasonable.+ Overall speed, performance, smoothness, picture quality of the screen--very fast and peppy. And I found a way to SAVE on both memory and on battery. What I did was to go into Apps/ Manage Apps and DISABLED the apps I don't use. Without rooting the phone, you cannot uninstall pre-installed factory apps, but you can disable them. Disabling the ones you don't use makes the phone run faster and frees more memory! Since I am a techie, I know which ones to disable and which ones not to disable, so if in doubt, please ask me in the comments and I will be glad to assist you in this.+ BATTERY LIFE: This phone has given me the BEST battery life of ANY smartphone or that I ever owned. And I use 100% brightness. For me, even at 100 brightness, if I use WiFi or Data just when I need it and then turn it off, I get all day into the night on one single charge! (I charge nightly and the phone is at 100% ready to go the next morning).+ EXTERNAL SLOT FOR MICRO SD CARD - This helped to sell me on this phone as I can add my personal music, photos, videos and more to this phone!This will accept up to 64GB SD card, but I had a 32g in mine for music, files etc. *Keep in mind where External SD cards are concerned: They are JUST for your personal files: music, videos, photos, and other files. When you install apps from Playstore or other sources, they store either in INTERNAL Memory Card or sometimes in the phone area (most store in the INTERNAL SD AREA). This is the law of the land where Android is concerned and ALL newer Android devices (including Samsung) work this way when storing your downloaded apps are concerned.+ INTERNAL STORAGE SPACE:This phone is advertised at 8GB of Internal space. The 8GB is the space BEFORE the drive was formatted, OS installed and then factory apps installed. So what I had on the phone BEFORE I installed any apps it had 4.75GB left. This is how it is on any flash drive, SD card, Hard Drive as formatting alone takes up space.Also, since 3.0 Android and above, you cannot save any apps to your personal SD card. Instead the apps are installed one way or the other to the INTERNAL SPACE. However, the good thing is that your personal files as photos, music, videos, and more can be installed to your EXTERNAL SD Card so you do have that space for yourself.**I have a few apps I downloaded from the Playstore, but no games so I still have about 4.08 GB left on my phone for more apps later should I wish to install them.+ Reading/Creating/Editing Word, Excel, Text Files: I downloaded a FREE APP called Kingsoft Office which I use for Office files (it reads, edits and creates Office files). And it also reads PDF eBooks so there is no need to download a separate PDF Reader app. *This is a MUST have if you have to read PDF or Word Docs etc, my docs are crisp and clear using this app.+ CAMERA - The 8MP camera concerned me that is UNTIL I took both indoor and outdoor pictures and even video. Well, I was pleasantly surprised. When I printed out some close up and other shots, I was really happy with the detailing in the pictures. And it compared to the picture quality I had with my regular camera, so what a happy surprise! Turns out to be a pretty good camera and I have been happy with all the pictures I took!+ Bluetooth Speed and Performance - The Bluetooth paired quickly with several devices and copied files at a great rate of speed.CONS:- Runs somewhat warmer than past Android phones - Due to a larger processor and faster processor, this requires more use of the battery causing the battery to heat up more and the battery to drain faster than say the older S3 Mini, S3, S2 etc. It is natural for the battery/phone to get a little warm when downloading a app, charging the phone, playing a game (some games really heat up this phone), running lots of apps at the same time. Also, the regular S4 runs very warm due to the larger processor.However, the battery/phone stays pretty cool when I am NOT downloads apps from the Playstore, and I do not play games on this phone.- Adobe Flash is not supported in this phone or ANY ANDROID DEVICE after 4.0 OS. The only way to get flash is to get a archived flash and use a high end browser such as Puffin or Maxthon Browser. So downloading the older archived flash gives the ability to view SOME internet videos, but this is better than no flash at all. Keep in mind this is a problem with ALL brands of Android devices with 4.0 OS and higher it is just after 4.0 Android came out, the NEW and best flash is NOT supported for Android devices. It is what it is...- Very small instruction \"manual\" provided with the tablet, however, I went to the Samsung site and downloaded the full manual and saved it in PDF on my laptop for reading anytime I need it. If you want the link for the manual, let you know in the comments and I will give it to you.- This phone will NOT accept an OTG (On the go) USB plug for flash drives, mice, etc. This was not a problem for me, I just plug in the USB Cable to copy files to the phone. So no big deal.- International Phone so NO US WARRANTY. Not a problem for me because I have learned over time that if a device is going to fail, it usually does it within the first 30 days. This phone has been great--no problems at all!- No NFC except on the model with the N on the model number. I do not use NFC so I have no problem with that.Bottom line: Would I buy this phone all over again? Yes I certainly would. Will this phone be the best for you? Yes, if you want to carry a phone that is not so large and fits into your pocket and you do not expect every bell and whistle feature from the BIG S4, then I totally recommend this phone!Hope this review has assisted you and thank you for reading it. Please feel free to ask me any questions in the comment section and I will answer in a very timely manner.", "Date": "February 25, 2014"}, {"Title": "I bought it from WorldWide Distributors and it is not the same as the description", "Author": "Reinita55", "ReviewID": "R2PDO82VTN9FLB", "Overall": "1.0", "Content": "The title say \"Samsung Galaxy S4 mini GT-I9190 Unlocked International Version - White\" and I have to say it is not the 9190, it is the 9192, basicly the same phone but dual sim, at first I was upset because it wasn't what I bought, but I'm from an other country and it took long time to sent the phone to me, so it wasn't easy to send it back right away because I'm going to USA in march, so I thought that I should not make a big deal out of it... so I was happy with it, and it is actually a very good phone, perfect size, good screen, I love android (I had a Windows Phone before, it was good but now I think a prefer Android), but what really bothered me was that when I turned on the phone and was putting my settins, specificly the google account (pretty much the most important one) it just collapsed, I spend a whole day trying to do the that so I could use the phone properly (download apps from the market for example) and I just couldn't, I even had to do a hard reset to the phone, that one pressing the home button+volume up+power button, and then it let me do all  the settings... it works great but every 2 days o once a day it shut down, and a had to start it again, or it simply reset itself... I really dont know why, if its a refurbished peace (it doesn't seen like it was), I havent istalled a lot of things, basics stuff (and candy crush of couse LOL), but I really cant say what the problem is...Conclusion, be carefull because you may not get what they are saying (GT-I9190)", "Date": "January 10, 2014"}, {"Title": "Great Product", "Author": "JESUS OLIVO", "ReviewID": "RXQWJR6ATCDLT", "Overall": "5.0", "Content": "Great product. Works perfectly with Movistar Cell System in Venezuela and believe it will work with other cell system in venezuela", "Date": "December 14, 2013"}, {"Title": "Dilyoli Flores-Venezuela", "Author": "Dilyoli Flores", "ReviewID": "R2ZVBSSCBSSPE0", "Overall": "5.0", "Content": "100% recommended, the product is amazing.Digitel use a line and it works fine,life of battery is great and unique. I love it", "Date": "December 28, 2013"}, {"Title": "Fine for me", "Author": "Amazon Customer", "ReviewID": "RQJZQUGZ0LKWG", "Overall": "5.0", "Content": "Does everything I need to do, and fits so nicely in the hand. Screen is bright and sharp and it's compatible with StraightTalk", "Date": "November 16, 2013"}, {"Title": "S4 mini :)", "Author": "Thao Nguyen", "ReviewID": "RHLFZP6UDZCCQ", "Overall": "5.0", "Content": "I just lost my old S2, so I decided to give this S4 mini a try. It was really cute, fast, and affordable. I read some bad tech specs reviews that many websites say about this phone, but this lil S4 is so far so good. It might not have all those \"cool\" features that the S4 has, but it is fast enough to do anything a smart phone is supposed to do. :)", "Date": "October 17, 2013"}, {"Title": "i love it!", "Author": "anderson alexander salave urbano", "ReviewID": "R2E61AQ6K58X3U", "Overall": "5.0", "Content": "excellent phone, comfortable, lightweight and good performance, in very good condition as advertised, I love my s4 mini, very with my purchase", "Date": "September 20, 2013"}, {"Title": "Warranty doesn't apply", "Author": "Julio Cesar", "ReviewID": "RNE3SILD86GGM", "Overall": "1.0", "Content": "The seller and Samsung doesn't help you in order to apply the warranty because it is an online purchase. One cell phone can't use it because it has got a factory error. No one answered me to resolve this issue. Dont trust in this seller.", "Date": "March 28, 2014"}, {"Title": "good", "Author": "anastasio", "ReviewID": "RFUVXQ65TAGOD", "Overall": "5.0", "Content": "very nice phone.. i like it. i always buy in this store. its white and its small. thanks for your cooperacion", "Date": "October 30, 2013"}, {"Title": "Excellent mobile", "Author": "Andres Landazabal", "ReviewID": "R2V6X3TMIHYBOQ", "Overall": "5.0", "Content": "Excellent mobile computer, it works perfectly with Movistar Venezuela. a great team 100% recommended, super fast, really fantastic, perfect size and design. ultimately the best.", "Date": "March 20, 2014"}, {"Title": "Nice!", "Author": "Milene Oriett Manterola Echague", "ReviewID": "R3ACFXBR3ZBLQ5", "Overall": "5.0", "Content": "It's a great cell!. 100% recommended!. I hope it keeps working good. In Venezuela, I belong to Movistar. Greetings, folks!", "Date": "March 15, 2014"}, {"Title": "Great! recomended", "Author": "Walter Aguirre \"Walter\"", "ReviewID": "R1S1UQAFBMMWEV", "Overall": "5.0", "Content": "Great mobil it is awesome. Fill totally my expectations, when I arrive to my country my sim card works perfectly!", "Date": "December 7, 2013"}, {"Title": "I love the phone", "Author": "Gregor Lucena", "ReviewID": "R3GXY0LZ3FP3BV", "Overall": "5.0", "Content": "The phone is perfect I love all your systemRecemendado 100%the phone meets all described and comes with accessories", "Date": "January 1, 2014"}, {"Title": "best phone ever !", "Author": "R. Parisot \"Roger29\"", "ReviewID": "RLWG14G7OYU9D", "Overall": "5.0", "Content": "The phone is amazing. I love the smaller form factor. Received on time and as desceibed, new in box and unlocked.", "Date": "October 26, 2013"}, {"Title": "I am totally happy with this purchasing", "Author": "Bellaluz Escalante", "ReviewID": "R2RS28HRDTKFZ0", "Overall": "5.0", "Content": "I bought it a few weeks ago.. came in original box with all the accesoriesIt completly works in Venezuela with movistar.", "Date": "May 4, 2014"}, {"Title": "This phone does not work like it should", "Author": "Mary Mackay", "ReviewID": "R394UCIKUTVNTS", "Overall": "1.0", "Content": "I experiencing problems with the phone and its very annoying that I purchased a brand new phone and still experiencing the problems of an old phone....and I do NOT think that its the phone but rather with the hand set that was sent to me....the battery life is terrible no more that 6 hours on good day, using the phond or not 6 hours and it must be charged, the phone gets hot to the point that I cannot put to my ear and have to use the speaker which is not condusivein all situations amd lastly the phone goes blank from time to time even if the battery isnt dead. Most ratings on the phone are excellent so I do not understand why I am experiencing this but what bothers me the most is that I have contacted amazon and left a seller feedback and no one has responded....I would like some assistance please!!!", "Date": "March 6, 2014"}, {"Title": "The cellphone is dead", "Author": "Yulenny Bencomo", "ReviewID": "RSFNAD4J44VT5", "Overall": "1.0", "Content": "the phone does not work. It is dead. I'm stil waiting for an answer about my case. I need a solution.", "Date": "January 5, 2014"}, {"Title": "Even free is too expensive for this phone!", "Author": "Kimberly Sherry", "ReviewID": "R3Q2G9QHQZKUI5", "Overall": "1.0", "Content": "Terrible phone!  48 hours out of the box and it won't even turn on.  Tried a new battery, different charger, the reboot recommended by customer service...nothing!!  I hesitated going with another Samsung product and now I know why!", "Date": "December 2, 2013"}, {"Title": "No warranty for this product", "Author": "Tulio R.", "ReviewID": "ROFCA8S8K8NNK", "Overall": "1.0", "Content": "Buy this phone in October 2013, and after two months began to get hot and drain the battery, the worst is that Samsung does not warranty their products purchased on Amazon.I do not recommend buying these phones because both the seller and Amazon say that the warranty is given by the manufacturer and this says purchases by internet or amazon has no warranty with samsung, and is not necesary register them to do validate the warranty.", "Date": "January 23, 2014"}, {"Title": "Hello", "Author": "Cesar Cordova", "ReviewID": "RNNHYYOMVYMRO", "Overall": "1.0", "Content": "I bought a Samsung Galaxy S4 mini GT-I9190 Unlocked International Version - White , but I would like to know why I receive a cell phone \"Made in China by Samsung\" , is this a fake celular pone?Thanks", "Date": "December 27, 2013"}, {"Title": ":)", "Author": "vincent", "ReviewID": "R1O68W1TFKP0Q", "Overall": "4.0", "Content": "PROSComfortable size. Excellent call quality. Long battery life. Good value.CONSCarrier branding and bloatware. Lower-res display.BOTTOM LINEThe Samsung Galaxy S4 Mini is a solid midrange Android smartphone, with a good set of features at an affordable price.", "Date": "June 9, 2014"}, {"Title": "excelent", "Author": "enrimar molina", "ReviewID": "R1YY63ZFOCEQLU", "Overall": "5.0", "Content": "I will choose 5 stars because I likedI would recommend this to someoneYes I like this productis good", "Date": "June 4, 2014"}, {"Title": "Excellent phone", "Author": "Luis O.", "ReviewID": "R33BDTVMKI5RI8", "Overall": "5.0", "Content": "amazing phone... i'm using this phone with venezuelan operator like movistar without problem because is unlocked for any gsm carrier", "Date": "June 1, 2014"}, {"Title": "I love, works perfect for movistar in Venezuela.", "Author": "Estefania Espinoza Arango", "ReviewID": "R2LYPKLJAB1WCE", "Overall": "5.0", "Content": "Just love, excellent equipment, excellent seller. Very useful and very nice, light and easy to use. In Venezuela Movistar works great with the I9190 model. I recommend it.", "Date": "May 28, 2014"}, {"Title": "EXCELLENT", "Author": "Enaly", "ReviewID": "R34FS4RGCFJKTR", "Overall": "5.0", "Content": "excellent fits my needs, just wonderful, I highly recommend it to anyone who wants to buy, I'm happy with my wonderful phone", "Date": "May 27, 2014"}, {"Title": "Excellent phone, very powefull", "Author": "NDuca", "ReviewID": "R1YY6RICFZA9MY", "Overall": "5.0", "Content": "A very good phone. I recommended for young people. Very nice and powered. The phone have power and have a lots of things to do.", "Date": "May 26, 2014"}, {"Title": "Excellent Smart Phone", "Author": "Alfredo Calderon", "ReviewID": "RCOEBMW4LCPI6", "Overall": "5.0", "Content": "Met all my expectations, and works great in Venezuela... Would recommend it to anyone looking for a great phone without paying too much for a new released phone", "Date": "May 25, 2014"}, {"Title": "love it", "Author": "ASTRID SAYAGO", "ReviewID": "R3VG2WD21LEHY4", "Overall": "5.0", "Content": "I really like this article, is of excellent quality and super tough, fully useful for me i can use in venezuela, very efficient", "Date": "May 20, 2014"}, {"Title": "overheated", "Author": "leonardo sierra", "ReviewID": "R2EAPBC6XHQNHJ", "Overall": "2.0", "Content": "Not only the battery , the phone is always over heated, and do not work...bad very bad.. an my wife phone is the same", "Date": "May 12, 2014"}, {"Title": "I love it", "Author": "Amazon Customer", "ReviewID": "R1ZQL3FVGML7CY", "Overall": "5.0", "Content": "muy bueno", "Date": "May 8, 2014"}, {"Title": "Cellular", "Author": "Marina", "ReviewID": "R171C8CORCOXDF", "Overall": "4.0", "Content": "A great phone, easy to use, really good camera, nice sound, even with headphones.Multiple apps available, to play and or organize schedules, events or such..", "Date": "May 7, 2014"}, {"Title": "perfect", "Author": "luis daniel", "ReviewID": "R1AF9RZDA1UEJV", "Overall": "5.0", "Content": "the desired product was and is the original samsung s4 mini i9192  thank you very much  thank you very much", "Date": "May 4, 2014"}, {"Title": "beautiful cell phone that I recommend to people who want speed and compact design is ideal for them", "Author": "A. Ojeda Martinez \"Alejandro Ojeda\"", "ReviewID": "RBPM5C393M5Y", "Overall": "5.0", "Content": "buy these phones on offer for the whole family, everyone was happy with the speed and because samsung is samsung is quality and a fast processor tinenen", "Date": "April 22, 2014"}, {"Title": "no regret", "Author": "felisha frederic", "ReviewID": "R3L4XSKZA8593D", "Overall": "5.0", "Content": "It came as i expected ...the delivery was fast it came with everything  i have no regret so far for purchase this phone i love it good for the price and i love the  size", "Date": "April 22, 2014"}, {"Title": "Great purchase", "Author": "Ernesto", "ReviewID": "R2IIY7ZLZD5036", "Overall": "5.0", "Content": "I really liked the pone. Great purchase. Brand new, with all accessories. No details of any kind. Happy with it", "Date": "April 21, 2014"}, {"Title": "Works well", "Author": "Consumer Helper", "ReviewID": "R1PWVVTUFWYBNT", "Overall": "3.0", "Content": "This is a nice phone for sure. But for the cost it seems like iPhone is better. My daughter wanted something special so i got this for her.", "Date": "April 19, 2014"}, {"Title": "Not so good, but it wasn't for me", "Author": "Feld", "ReviewID": "R34IPII2KC977Z", "Overall": "3.0", "Content": "I don't like the phone that much, but my mother asked me to buy it. It has tons of unnecessary apps that make it slower than it could be. Also, it should be running KitKat by now...", "Date": "April 17, 2014"}, {"Title": "Samsung Mini", "Author": "Shunda", "ReviewID": "R13SSDOI6S0CKI", "Overall": "4.0", "Content": "I bought the phone for my daughter.  So far she likes it ok. I just hope it works for her in Korea when she goes.", "Date": "April 11, 2014"}, {"Title": "perfect", "Author": "Eliu C.", "ReviewID": "R2WJY7UZ5XKP8D", "Overall": "5.0", "Content": "perfect for people who use outside the country has very good connection with international, fast and very smart operators, I like this model because personally the screen is the right size, not too big nor too small and white is more unique yet", "Date": "March 19, 2014"}, {"Title": "great phone for a good price!", "Author": "Anne Müller", "ReviewID": "RNB3T7A2RY4ZT", "Overall": "5.0", "Content": "I got this phone today (it arrived one day earlier) and, so far, I am very happy with it. It's working and I just really like it.", "Date": "March 17, 2014"}, {"Title": "It is good", "Author": "jesusdgch", "ReviewID": "RCXPL0X1X2IM4", "Overall": "5.0", "Content": "For a first impression with Samsung is a really good option, be careful of following correctly the instructions when updating the software", "Date": "March 17, 2014"}, {"Title": "Samsung Galaxy", "Author": "Laura Moore", "ReviewID": "R1TXMYM3WV2K5Q", "Overall": "5.0", "Content": "The description was accurate and it is unlocked. I am very pleased with my purchase. I am happy to have it", "Date": "March 14, 2014"}, {"Title": "Great Phone", "Author": "Anthony J. Mollica", "ReviewID": "R37WFRK64UYQU7", "Overall": "4.0", "Content": "My first smartphone. It is amazing in all respects. Love the light weight. I Went to Mexico and had no problem using it there.", "Date": "March 14, 2014"}, {"Title": "Samsung Galaxy S4 mini", "Author": "mdb", "ReviewID": "R2250IVFAXT51K", "Overall": "5.0", "Content": "Love this phone!! It's not to big and bulky! It's just difficult to find a good case for it!  Phone arrived right on time! No complaints so far!", "Date": "March 5, 2014"}, {"Title": "excellent", "Author": "Jose Manuel de León Santana", "ReviewID": "R2EVKI78GGN9DI", "Overall": "5.0", "Content": "one of the best i like i love its work great still like that il buy as son as posible", "Date": "March 5, 2014"}, {"Title": "Excelent", "Author": "Ana Hernandez", "ReviewID": "R4UCBRFKWSE7J", "Overall": "5.0", "Content": "I love this cellphone. It comes indeed unlocked and It is gorgeous and its functions are awesome!! small&smart; :) Love it !!", "Date": "March 2, 2014"}, {"Title": "love it", "Author": "Patricia", "ReviewID": "R1F2WAZ51YRPJI", "Overall": "5.0", "Content": "I love my new samsug Galaxy S$ mini, it has a  perefect size. Pictures are awasome! easy to use and download apps!", "Date": "February 26, 2014"}, {"Title": "Good cellphone you can use every where. it have meet my expectation of working outside the US as well as in the US.", "Author": "Djeneba Coulibaly-Traore", "ReviewID": "R2JEJBA1ZTEGNU", "Overall": "4.0", "Content": "It is fine and working outside the US which is fine. I like it but have to learn well how to use it.", "Date": "February 22, 2014"}, {"Title": "I love", "Author": "Militza de Virla", "ReviewID": "R33NTGJVU7E1DW", "Overall": "5.0", "Content": "Android Samsung S IV mini is super great, I love it all, applications, download speed, features, finally, is a very good mobile. and white is very cute", "Date": "February 19, 2014"}, {"Title": "Great Phone", "Author": "Angela Goddard", "ReviewID": "R2KS94XBEADS4Y", "Overall": "4.0", "Content": "I need a phone for when I am traveling and the Samsung Galaxy seems to be the best choice.  Will used it in the two weeks when i travel and see if its as good as they say.  so far its working quite well.", "Date": "February 19, 2014"}, {"Title": "good deal", "Author": "Marcos", "ReviewID": "R1Z7TMVRL8WL7G", "Overall": "4.0", "Content": "Good and works fine, worth the price.I can do all the things I think is important in a smartphone.", "Date": "February 17, 2014"}, {"Title": "Great Phone!", "Author": "Kery", "ReviewID": "R2T6G8PDEUT5LB", "Overall": "5.0", "Content": "Amazing phone, works really good on Movilnet (Venezuela) you will be surpridsed on how light this phone is, also is very fluid, the sound on stock earphones is GREAT, the size is right for my taste, the finish is beautiful, and feels well constructed, it comes with a OS update as soon as you insert your SIM card, so long has been perfect!", "Date": "February 12, 2014"}, {"Title": "Love it!", "Author": "Doris Eledui", "ReviewID": "R2HAI3YHOMEEY0", "Overall": "5.0", "Content": "It's perfect for my daugher, I dont hear any complaint so far. So I guess it's just perfect for her.Doris Eledui, Koror Plalau", "Date": "February 9, 2014"}, {"Title": "Samsung rocks!", "Author": "Lisa R", "ReviewID": "R1QLSOKB8H1RHC", "Overall": "5.0", "Content": "This phone is awesome. It is unlocked and works (it uses a microSIM card so I had to cut mine to fit) outside of the US, I got this version because I heard the later ones are region-locked. I've only had it for about 2 days but I love it already. As mentioned before...I thought it was way smaller than the S4 but turns out that it is just a little bit smaller. It's user friendly. It is a slim, sturdy, white good looking phone. Just one regret...I didn't buy a flip case.", "Date": "February 9, 2014"}, {"Title": "the mobile looks great i love it", "Author": "frhad mahmood", "ReviewID": "R3B12ZNT8WL0DV", "Overall": "5.0", "Content": "the s4 mini looks great like s4 with smaller size and you can use to TV also by HDMI cable or all share cast, which i thought it doesn't has", "Date": "February 4, 2014"}, {"Title": "Best phone ever", "Author": "victoria Xochilt Guevara", "ReviewID": "R208VOUQ419QU8", "Overall": "5.0", "Content": "It is a powerful phone but on the perect size, I chose it for its size and I am glad i did, for I think his older brother (The S4) is a great phone but is too big. Doesn't have all the cool stuff but it is still powerful and fast.", "Date": "January 19, 2014"}, {"Title": "Good buy", "Author": "Karl Nembhard", "ReviewID": "RW628D478C40E", "Overall": "5.0", "Content": "I bought this as a gift and it works like a charm. What was stated was delivered. Only wished it had a LED notification", "Date": "January 14, 2014"}, {"Title": "great phone", "Author": "Steve L Salley", "ReviewID": "RQPXV7NVLXXYA", "Overall": "4.0", "Content": "this was a gift.....the phone is awesome.....living here in Bermuda the cell is working great.....Loving this phone...wow wow wow wow", "Date": "January 11, 2014"}, {"Title": "GREAT CELL PHONE", "Author": "Sad", "ReviewID": "R20FI0BCHLMFZU", "Overall": "5.0", "Content": "CHECK THIS YOUTUBE VIDEO FOR A BETTER REVIEW GALAXY S4 CHECK VIDEOhttp://youtu.be/fGqeZxOqKhgCHECK THIS YOUTUBE VIDEO FOR A BETTER REVIEW GALAXY S4 CHECK VIDEOhttp://youtu.be/fGqeZxOqKhg", "Date": "January 10, 2014"}, {"Title": "Good price", "Author": "NANA", "ReviewID": "R2N7Z7J1RMMGB2", "Overall": "4.0", "Content": "It works ok but sometimes it is so slow especially when play some games. But it's good price any way", "Date": "December 27, 2013"}, {"Title": "excelent", "Author": "Alberto B.Niño M.", "ReviewID": "RAIAV09QRMPPD", "Overall": "5.0", "Content": "I recommend a very good product worth buying, I get a problem WITHOUT ANY time, very excelente very good nice", "Date": "December 17, 2013"}, {"Title": "S4 Mini", "Author": "victormanuel3007", "ReviewID": "RYYOOS7MLQR01", "Overall": "5.0", "Content": "S4 Mini is a great cellphone, it has the latest Android and the screen looks really fine and clear. the cellphone is fast, has a dual core and 1.5 ram memory. i recomended it.", "Date": "December 6, 2013"}, {"Title": "I love it", "Author": "Cristina Bustamante", "ReviewID": "R2XXKUCBRV8HGZ", "Overall": "5.0", "Content": "I was not sure about buying this phone because a lot of people do bad reviews about cellphones but my boyfriend convice me to do it and I really like it", "Date": "December 4, 2013"}, {"Title": "Nice phone", "Author": "EMENIKE CHIDI SIMON", "ReviewID": "RBQSQKAJX7OHX", "Overall": "5.0", "Content": "Very nice phone.  Can easily slip it in my front pocket and move around without discomfort.  It is flat and of light weight.", "Date": "November 26, 2013"}, {"Title": "Very Nice Phone", "Author": "Miguel Castellar", "ReviewID": "RW0EZUNJ6GAVV", "Overall": "5.0", "Content": "excellent! this phone filled my espectations, nice design, also comes with the latest android wich makes it really fast and smooth", "Date": "October 7, 2013"}, {"Title": "fraud", "Author": "Jorge Corado/Monares", "ReviewID": "R3KOR0GQ7BVCB", "Overall": "1.0", "Content": "until yesterday that I returned the phone that did not work with the network I wanted my client I realize that I phone is a replica of samsung s4 mini Hoax the phone has a fatal chamber, in a part of the software was placed which is 32gb just have 2GB when the touch screen is not as sencible and letters on the front of the phone where it says samsung is not the original I compare against a legitimate samsung and great disappointment in this product such as prestigious pass scams that what pays for the phone was priceless imitation of the original price was, the truth not expect anything from you but all xtreme glam as they say here \"wet is wet leaves\"", "Date": "December 26, 2013"}, {"Title": "Good purchase", "Author": "Micaela", "ReviewID": "RENRSO67O4YJZ", "Overall": "4.0", "Content": "It would be useful for all you need. Lags a little bit but still perform as expected. Definitely the camera is not the strong point, but it isn't worse than other smartphones cameras (just average).", "Date": "December 14, 2013"}, {"Title": "U get what u pay for :)", "Author": "Evelyn", "ReviewID": "R1BRGIRZ1KG4Q6", "Overall": "4.0", "Content": "Works perfectly fine! :)  I mean this phone is great for what you've paid... But not good enough to take photos at night with too mmuch light like in 5th ave. NY :p", "Date": "December 13, 2013"}, {"Title": "IS A NICE PHONE, PERFECT SIZE AND EASY TO USE IF YOU ARE NOT A YOUNG PERSON. HD RESOLUTION, MORE APPS THAN OTHER PHONES", "Author": "Andres", "ReviewID": "R1D9IOIOWN1JB1", "Overall": "5.0", "Content": "IS A NICE PHONE, PERFECT SIZE AND EASY TO USE IF YOU ARE NOT A YOUNG PERSON. HD RESOLUTION, MORE APPS THAN OTHER PHONES", "Date": "November 25, 2013"}, {"Title": "excelente", "Author": "Maickel Cano", "ReviewID": "R18CG4CIDDZKSN", "Overall": "5.0", "Content": "is exactly what I needed, I am satisfied with this item and it was exactly as described on the page. thanks", "Date": "November 20, 2013"}, {"Title": "So cute and fast!", "Author": "Lin Xu", "ReviewID": "R3RV85ZHJKV08A", "Overall": "4.0", "Content": "Really like it! It is very light and in the size I want! I do not like those huge phones. I can't even hold them in one hand. This one is perfect for me. Also, it is very fast.But there are two problems. One is the introduction about this item does not mention about the internal memory. It is 8G so if you want a bigger one, maybe you need to find others.The other is sometimes it does not work smoothly when I play games on it (Candy Crush). I don't know why, maybe it's the network problem.Overall, I recommend you to buy this if you need a cute, light, normal size and functional phone.", "Date": "November 1, 2013"}, {"Title": "I got a problem cellphone", "Author": "jie min li", "ReviewID": "R2P9RTSNPKWDOJ", "Overall": "1.0", "Content": "I ordered a Samsung Galaxy S4 mini on 10/6.  When I received the cellphone I knew that it needs a micro sim card, I called T-mobile to sent me a micro sim card. It took 10 days usps deliver.I got it and I started to use it on 10/16. After 9 days,on 10/25 I found there was a dark shadow in the left corner of the screen. . ( I didn't drop it  or any accident with it)  The dark shadow always right there no matter how I try to get rid of it. The seller said that I couldn't return it because I already pass the 14 days defective return period.  Now I must use a new cellphone with problem screen. I would never bought any cellphone online.", "Date": "October 27, 2013"}, {"Title": "I LOVE IT!!!", "Author": "Carmen Lozada", "ReviewID": "RY3ZRQBAD6I61", "Overall": "5.0", "Content": "ex ce llent, beau ti ful, u til, i lo ve it. It is so great. Fun. This is a ve ry ni ce .", "Date": "March 20, 2014"}, {"Title": "Overall a great deal", "Author": "Joachim Bach", "ReviewID": "R3U1OH5J3J46F", "Overall": "4.0", "Content": "The S4 mini is working perfectly fine for international use. The only negaive Point is, that the power Adapters is really poor. It has no USB General cable, but is connected dierctly to the plug which big and only used in some countries. For North Americy an additional Adapter gets delivered, but now the plus sticks about 4 inches off the wall. And there is also no european wall outlet Adapter that fits. Since the cable is hard connected, a new chargingcable Needs to be considered.Other than that - a great phone and quickly delivered.", "Date": "March 7, 2014"}, {"Title": "i like it", "Author": "Mbali Promise Thwala", "ReviewID": "RT3HETQ0PRKSB", "Overall": "4.0", "Content": "i like it because I can use it in South Africa too and I love the colour, u will recommend it to my friends", "Date": "February 24, 2014"}, {"Title": "s4", "Author": "Mario A.", "ReviewID": "R1MK234D1UKO08", "Overall": "4.0", "Content": "It's slow, I would have preferred the conventional. Good battery, the sound is poor headphones and headsets and the application of twitter also", "Date": "February 23, 2014"}, {"Title": "I orderd the BLUE one, it looks much better and shiny than the white one or black one. And its unlocked", "Author": "Maria T. Sotomayor", "ReviewID": "RM7QEG02MQMFL", "Overall": "5.0", "Content": "Phone works great! Looks great! It has decent battery life (I always have it on full brightness) the phone is pretty fast and the screen size is just perfect. Not too big not too small. Really recommend this phone", "Date": "February 18, 2014"}, {"Title": "This phone is really good !", "Author": "manuel", "ReviewID": "R3SH5YYMXBZ8GT", "Overall": "5.0", "Content": "The phone works perfectly ! Thanks for everything , it has no technical issue ,  and it works with any kind of server !", "Date": "January 1, 2014"}, {"Title": "I love it", "Author": "Dorys Gutierrez", "ReviewID": "R3QYJBB4T5OQVN", "Overall": "5.0", "Content": "I love it:excellent product, meets my expectations, ideal weight, easy handling, perfect,i just love my S4 mini and recommend", "Date": "November 19, 2013"}, {"Title": "Not happy", "Author": "joseph klein", "ReviewID": "R20SSNKDH71CL3", "Overall": "1.0", "Content": "I wasn't happy because + Version and I were looking for Verizon and I I was searching for Verizon and I looked for Verizon and I got this phone for option and I got mixed up this now I have to send it back it's not fair", "Date": "February 24, 2014"}, {"Title": "The amazon gift card service is very effective, we can give gifts to our friends and puden them choose what they want to buy wit", "Author": "Johnny Alemán", "ReviewID": "R1DLOTLU3D7S7A", "Overall": "5.0", "Content": "The amazon gift card service is very effective, we can give gifts to our friends and puden them choose what they want to buy with the variety of products offered by them.", "Date": "December 10, 2013"}, {"Title": "one star", "Author": "Soraya Lopez", "ReviewID": "R3L69RPMWOMA27", "Overall": "1.0", "Content": "it's a nice product soo pretty, i would like that more person try have it. because is nice but to speak it's not good.", "Date": "December 17, 2013"}], "ProductInfo": {"Price": "$399.99", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 900 / 1900 / 2100-LTE Mhz", "Name": "Samsung Factory Unlocked Galaxy S4 mini GT-i9190 - 8GB - White International Version", "ImgURL": "http://ecx.images-amazon.com/images/I/3155ONviU6L.jpg", "ProductID": "B00DMS77K8"}}