{"Reviews": [{"Title": "BESSSSSSS PHONE", "Author": "Tresor S.", "ReviewID": "R187HXF72O0D5C", "Overall": "4.0", "Content": "A very good smartphone for a very good price.......its light weight......display is crisp.......audio is clean...and the video playback is boss", "Date": "March 18, 2014"}, {"Title": "Annoyed and frustrated", "Author": "Bahamuth01", "ReviewID": "R3D2YX8NEX41I6", "Overall": "1.0", "Content": "good afternoon I'm calificadon this because I acquired according to their description of the phone with these frequencies Quad-Band 850/900/1800/1900 Mhz Cellular Band 3G - 850/1900 Mhz, and sent me to the cellular band 3G 900 / 2100 Mhz and it does not work in movilnet or movistar Venezuela. now not to do on your their carelessness, so I elected just phones with specifications do uestdes I inportaban and sent me this.", "Date": "November 20, 2013"}, {"Title": "Great phone But !!!", "Author": "K. Brown", "ReviewID": "R2GW5VWKCNDE3Z", "Overall": "3.0", "Content": "Really was excited to get this phone versus the crappy Go phone I needed to purchase in a bind. First the phone is lightweight and not oversized but neither too small also. Bought this unlocked phone for use on AT&T; and setup with Sim Card from original Go phone, I immediately was able to connect to Wifi and it had great response for navigating and so forth. Unfortunately no phone signal and I must have a AT&T; Microcell booster in my place for any kind of service, so long story short with probably an hour on the phone with AT&T; tech support who tried deligently to figure out with no success I went to local AT&T; store who immediatly got phone signal.Success short lived got back home no signal, back to Tech support another 20 minutes plus and he figured out issue. Be very cautious when reading specs and not all specs related to this phone are specified correctly, unfortunately where I purchased it from, it did not specify that with service with GSM 850 / 900 / 1800 / 1900 - SIM 1 & SIM 2 its only 2G, it is 3G but only with HSDPA 850 / 900 / 1900 / 2100.  Sadly my Microcell only works with 3G so no signal again with this in my house. And I'll have to exchange for something specific to my network, but I think this phone is a really great phone otherwise, just be cautious when purchasing and expecting it to work well with AT&T.;", "Date": "November 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D89JVXM"}}