{"Reviews": [{"Title": "Assurance & easy to read", "Author": "Milyvan", "ReviewID": "RXRMYSETCK1Q5", "Overall": "5.0", "Content": "Love this phone!  Have Assurance EBT service and declining reading vision.  This phone is not only easily compatible (Call Assurance -not Virgin- to set up.), but the large screen and large, separated keypads are easy to read.  Also has a convenient, easy to use camera.  It's certainly nothing fancy....  (If you want tech advanced, look elsewhere.) But if you want a low-cost, easy use phone with easy to see features to replace your assurance phone for ma, grandpa, etc. you're in the right spot.  (Also, Amazon had the lowest $ even with s&p; and it arrived 2 days early.  Kudos to Amazon!)", "Date": "September 24, 2013"}, {"Title": "Disappointing reception", "Author": "Debora Henderson", "ReviewID": "R1Q7R6V0X58V09", "Overall": "3.0", "Content": "I like the larger display. I am better able to see everything on this phone. On other phones I've had, I haven't been able to see much at all. It's very good for people with lower vision. The phone is longer than most, but will fit in your pocket.There is some wiggle room at the hinge. It seems that could make it easier to break at that point.  It also doesn't get good reception in the city because of the high rises. I don't know about stores. It has dropped a few calls due to this. Other phones I've had also got poor reception in the buildings, but they never got so bad as to drop a call. I would have given this a 4 star if the reception was better.", "Date": "July 8, 2013"}, {"Title": "I'm 22 n never been happier with a phone!", "Author": "chaye calvert", "ReviewID": "RD1HKVJRQ8HMP", "Overall": "5.0", "Content": "Great phone! Does just what I want it to do call and text, I get great service here in Albuquerque nm. Big screen, big buttons, and best of all slim not all bulky like all the smart phones out today. Got mine at radio shack for $4.99 such a great deal for just what I wanted, a cell phone.", "Date": "November 2, 2013"}, {"Title": "Great basic phone", "Author": "Richard Steelreath", "ReviewID": "R2VZ2T1THIO3Q7", "Overall": "5.0", "Content": "I bought this Kyocera Kona phone to use in place of the Kyocera Jax phone that was providedto me by Assurance Wireless. It is a much better phone and has a camera and bluetooth function, which is great. Best of all it only cost $7.99 plus shipping. Great deal!", "Date": "October 28, 2013"}, {"Title": "Good phone, but no USB download of photos", "Author": "Jeff12345", "ReviewID": "R1XJ1R4MVMI3RF", "Overall": "4.0", "Content": "Good phone. Seems solid, and I like the old clamshell style phones. Of course, given the price, it's extremely basic. If that's what you're looking for, it's a good choice. My only complaint is that it is apparently impossible to download photos from the camera to a computer via USB or Bluetooth. So you have to do so by text message. But if you Virgin Mobile's payLo service, messages aren't free.", "Date": "September 2, 2013"}, {"Title": "Does it's job.", "Author": "kmn086", "ReviewID": "R116UFC0B5WMUE", "Overall": "5.0", "Content": "Got this as a replacement for the stock phone sent by Assurance Wireless because the one they send you is tiny. It's just your basic phone, it calls and texts. The camera on it is on a 2 mp, so it pretty much stinks, but if you are considering this phone you probably are not worried about camera quality.", "Date": "July 28, 2013"}, {"Title": "For the price this is one great phone.  Setting up with Virgin was fast and easy", "Author": "A. Nishioka", "ReviewID": "R1Z05UJUKXKDSF", "Overall": "5.0", "Content": "I needed to replace my aunt's T-Mobile with a lower cost prepaid and Virgin had the best plan for her.  This phone was delivered very fast and getting Virgin to transfer her T-Mobile phone number to Virgin was very easy - this was a surprise to me.  For my aunt the keys are large and easy to see.  The display is clear and ease of use is very good.", "Date": "January 24, 2014"}, {"Title": "For just phone calls it's great.", "Author": "Book Maven 2005", "ReviewID": "R3O0AESJZMDAQY", "Overall": "5.0", "Content": "As someone who has lived for years without a cell phone this seems just fine to me. I only use it for emergencies and for while driving and retain a land line.  I tried it first with a media package but it is a complete waste as the screen is too tiny to surf the internet with properly. I am also not a big texter. If you just want it for phone calls it is great.", "Date": "January 19, 2014"}, {"Title": "Incredible deal for $5 with no sign-up requirements.", "Author": "Robert Marxhausen", "ReviewID": "RZ111DED80T7T", "Overall": "5.0", "Content": "It comes with the plug-in charger and having the time on the outside in large numbers in a dark area is really helpful. It has a good size screen and the inside of this flip phone. No worries about butt dialing.", "Date": "February 3, 2014"}, {"Title": "You have to check the Virgin Mobile site or call if your already a customer.", "Author": "John Gingrich", "ReviewID": "R29Z3GQ5ETKN3W", "Overall": "1.0", "Content": "The quality of the phone seemed fine without actually using it. So the low rating is not about the Kyocera Kona, but about the carrier Virgin Mobile  I got the phone to replace a broken phone. But turns out this phone would not work with the plan I had.  They change the deals and plans a lot and they push you to new plans by having different phones work with different plans.", "Date": "March 20, 2014"}, {"Title": "Great replacement or upgrade for ASW.", "Author": "Chad Farrell", "ReviewID": "R1U9PZZRP6QCFN", "Overall": "5.0", "Content": "My free Assurance Wireless phone got a cracked screen while carrying it.  So I couldn't read the screen.  This phone I got it activated and phone swapped in minutes upon arrival.  Works great, can't beat it for the price.  I wish I knew I could of got this as a replacement months ago.", "Date": "February 19, 2014"}, {"Title": "great deal, use with assurance wireless", "Author": "In My Old Age \"Jean\"", "ReviewID": "R2QEDMFBL43AMF", "Overall": "5.0", "Content": "got this for my 95yr dad to use with his assurance wireless (Virgin mobile). Nice size buttons and easy to setup speed dial numbers for him. Flip style good for him not breaking it when in shirt pocket. These were all problems with other phones he has used. The jaz that comes with assurance account was too small buttons for him. But easy to swap phones .It actually looks just like my stepbrothers expensive contact phone.", "Date": "February 13, 2014"}, {"Title": "great simple and small", "Author": "Shelby Lee Kirk", "ReviewID": "R15OIPUTFOIWON", "Overall": "5.0", "Content": "i brought this for my boyfriend for a work capable phone. it was inexpensive , shipping came 2 days early. and he loves it. he says that you can download ringtones from Myxer.com.", "Date": "January 31, 2014"}, {"Title": "Great phone for seniors", "Author": "dlkhollywood", "ReviewID": "R21D8L730IMTOU", "Overall": "4.0", "Content": "This is a great phone.  I'm a senior citizen and the large keys and font makes it easier to see and use.  It also has a \"voice guide\" feature/setting that tells you what keys you are pushing.  I have federal lifeline service through Assurance Wireless and this is a 200% improvement over the free phone they sent me when I signed up.  This is a great phone for anyone who only needs talk and texting capabilities.  It can be set up for email and surfing the web, but I have no need for those features since a have a home computer for doing that.  But as I said, this is a great phone.", "Date": "December 11, 2013"}, {"Title": "nice phone", "Author": "dena j", "ReviewID": "R1ZN8ENQX0CJSB", "Overall": "4.0", "Content": "the phone came in a timely manner and undamaged. i really like the features on the phone, and the many ringtones offered. the only downside is the phone doesn't stay charged beyond 8 hrs. every night i have to remember to recharge or by morning it's dead. for the price you can't beat it.", "Date": "November 28, 2013"}, {"Title": "Cheap phone - how can you criticize it?", "Author": "Jimmy Hoffa", "ReviewID": "RLKX6J49CXT49", "Overall": "5.0", "Content": "For all it does - and does well as advertised - how can anyone complain? If they are too young to remember how we used to get gouged just to rent an old handset from the phone company and how much we had to pay for long distance. This thing is a marvel at this price point - and if it breaks or I spill something on it - I can buy another one cheaper than I could get an ADAPTOR for my previous 'Smart' phone. The era of the disposable cell phones they use once and throw away in the movies has arrived - we can do that now too if we wish.", "Date": "August 31, 2013"}, {"Title": "Good features; poor reception", "Author": "Thomas H. Knapp \"hazenmel\"", "ReviewID": "R3SO9XK6MWWXKZ", "Overall": "1.0", "Content": "I had a LG-101 \"candy bar\"  phone that worked well but was so limited it didn't even record 'recent call' numbers.  This KONA phone is biger and has good features, BUT the reception is much worse.  In my offic at home I get one or no bars; my LG-101 got 3-4 bars.  People often tell me they can't understand me and callers often sound broken up to me.  Disappointing.1 *", "Date": "August 17, 2013"}, {"Title": "Cell phone.", "Author": "Cynthia @ MA", "ReviewID": "R199WI13FV1Z6O", "Overall": "4.0", "Content": "My husband needed a new cell phone and wanted a flip one.  He is happy with this one, except that he has started texting and finds it difficult with the limited keys on the phone.  Live and learn.", "Date": "May 3, 2014"}, {"Title": "Warning: does not work with old Virgin Mobile Minute-by-Minute plan", "Author": "Karlo Marx", "ReviewID": "R3A3MH1JCM77O8", "Overall": "3.0", "Content": "The phone is OK, very simple, large, easy-to-read buttons.  Has few extra features other than the camera.  Prying the back cover off to install the battery was a bit awkward, and I worried a bit about breaking the cover.  Can't say how it works as a phone - turns out it does not work with my old Virgin Mobile Minute-by-Minute plan (got it in 2006, currently at $20+tax/90 days).  I carelessly assumed that 'payLo' phones were compatible with my plan, but no - I should have paid more attention to the reviews.  The old plan is being phased out and Virgin no longer offers phones that works with it.  I ended up getting a replacement battery for my existing phone (Kyocera Cyclops) to stay in the old plan.", "Date": "April 15, 2014"}, {"Title": "Kyocera Kona mobile", "Author": "Lisa Shelton", "ReviewID": "R12NYY3UTC8CNO", "Overall": "5.0", "Content": "I love my kyocera kona phone; also on the front, I like the large clocks numbers too.  I am old school, and the flip phones are still my choice of mobile.", "Date": "April 8, 2014"}, {"Title": "Great Bargin", "Author": "Anthony Mattia", "ReviewID": "R3FFH2036G9EQQ", "Overall": "5.0", "Content": "Excellent phone, has all the feature of more expensive phones. Great product, works well in Virgin Mobile network. Purchased to replace other phone.", "Date": "March 23, 2014"}, {"Title": "Low quality - lots of features", "Author": "Naomi Johnson \"Dancing Jane\"", "ReviewID": "R15UARNBMWT4SO", "Overall": "2.0", "Content": "This gives you a lot of features for the money. Unfortunately, if you intend to use this phone a lot, it does not stand up well to use. Shorts out, malfunctions, drops calls, can't hear anything (even with the signal indicator at full power). Changes settings without you telling it to.  This is the 3rd one of these phones i bought in the last year. Unfortunately its the better of the cheap pay low phones - but not very good quality in any way.", "Date": "March 17, 2014"}, {"Title": "Not my main phone- but it is perfect for me.", "Author": "L. Da Vinci \"Renaissance Man\"", "ReviewID": "R1X6JDSOPULZQB", "Overall": "4.0", "Content": "This phone, considering how simple and inexpensive it is, is not meant to be the only cell phone you have. I consider this my \"emergency\", temporary  phone, in case my main phone, a Galaxy Note 3 is lost/stolen, or unavailable. At $20 a month, it is a bargain to have an extra phone. Not everyone will agree with this way of thinking, but it works for me. One night I left my Galaxy Note 3 in a friend's car, after he dropped me off at a train station. I had a hard time getting in touch with him, since there are few remaining public phones, AND I had not memorized his cell phone number. It was not easy getting in touch with him and getting my phone back. This was a learning moment for me. I now keep all my important numbers in this Kyocera phone, it is always fully charged (turned off), and in my pocket. Every now and then I check it to make sure the battery is fully charged, and there is a balance in the account.For me, this phone is ideal, only for emergencies, and it is money well spent!", "Date": "March 7, 2014"}, {"Title": "I disapprove. But it works.", "Author": "Jordan", "ReviewID": "R2SSNEEDM6C7LN", "Overall": "3.0", "Content": "This phone is just pretty looking. It is no more functional than a regular 'feature' phone. It was only $5 so there is not really a whole lot specific complaints. You get what you paid for.", "Date": "February 26, 2014"}, {"Title": "Awesome!", "Author": "Dita155", "ReviewID": "R3KKUPS86DOD9O", "Overall": "5.0", "Content": "I purchased this phone for my mom. She is a senior citizen and the size and style of the phone makes it easy for her to see the numbers and the flip is easy too! Definitely a great buy!", "Date": "February 25, 2014"}, {"Title": "this phone is good", "Author": "thu vu", "ReviewID": "R5QMXHC8YO1VY", "Overall": "3.0", "Content": "this phone is look nice to me , it is ok. to used, i recommend to my friends , it is fit for people who donn't have much money", "Date": "February 21, 2014"}, {"Title": "Good phone for what it is.", "Author": "Kristy Kemp", "ReviewID": "R27RKQBHTQKK3", "Overall": "5.0", "Content": "It is a pretty great phone for the cheap price. It does it's job. It takes pics and has pretty good service.", "Date": "February 19, 2014"}, {"Title": "SUUUPPER SERVICE", "Author": "dennis59", "ReviewID": "R2UDEUPJC4L1RI", "Overall": "5.0", "Content": "The service was fast i mean like 2 days wow wasnt expecting it till thursdaythanks for the great service and the great phone it works great for a basic phone which is all i need", "Date": "February 11, 2014"}, {"Title": "great cheap phone", "Author": "WC", "ReviewID": "RWXQR0BZK7F7X", "Overall": "4.0", "Content": "i got this for my mom and she loves it.  she has difficulty hearing as she is up there in age but she hasn't had any issue with this phone.  it's cheap and easy to use.", "Date": "February 7, 2014"}, {"Title": "Phone!", "Author": "Werewolf", "ReviewID": "RT29N85KQ98P9", "Overall": "5.0", "Content": "This phone I bought for my dad. It works just great for him! I see that there is one on sale at Target right now and I am thinking of buying that one too so I have a backup if he breaks his current one.", "Date": "February 3, 2014"}, {"Title": "perfect for my 9 year old", "Author": "Val D", "ReviewID": "R2GJ4SFBITV1FV", "Overall": "5.0", "Content": "Right size for my son, easy to use, love the outer screen, not expensive, basic phone for the average 9 year old.", "Date": "January 29, 2014"}, {"Title": "great!", "Author": "Melissa", "ReviewID": "R2P3KJX9IZJT13", "Overall": "5.0", "Content": "The phone arrived in its original package brand new never opened, and delivered fast. I was very pleased with the phone and the price was perfect.", "Date": "January 28, 2014"}, {"Title": "Good Deal", "Author": "Cynthia", "ReviewID": "R1PINBX6VLP0OB", "Overall": "5.0", "Content": "If your looking for a simple phone just for calls and text , this is a good phone to use. The buttons are big and everything is easy to use and navigate.", "Date": "January 27, 2014"}, {"Title": "It's a great inexpensive phone.", "Author": "jtcen", "ReviewID": "RHCQU81SIMBYG", "Overall": "5.0", "Content": "I got this for my mother since she's old and had a hard time reading the small LCD screen (1.8 inches) on her previous feature phone. The larger front and interior screen along with the larger keypad definitely helped her navigate the phone better. I highly recommend this phone for an older demographic!", "Date": "January 19, 2014"}, {"Title": "For $5 how can you go wrong?", "Author": "C. Andew Currie", "ReviewID": "R3VE6C59PMRXLC", "Overall": "5.0", "Content": "My mom's old phone was giving out and she wanted a new cheap phone. She liked the look of this but the local store wanted $50 it! Happened to check Amazon and this same phone was listed for $5 at the time.For what it is its great. It suites her needs and the camera is even halfway decent. For $5 can't go wrong!", "Date": "December 24, 2013"}, {"Title": "Works Great!", "Author": "Jels", "ReviewID": "R12PT191JJUCZI", "Overall": "4.0", "Content": "No issues so far with the phone. For the price, it's great for just your basic phone usage. I wouldn't suggest dropping it too many times...it feels like it's made of a cheaper plastic", "Date": "December 18, 2013"}, {"Title": "Meets and exceeds my needs", "Author": "Angela", "ReviewID": "R2UDQDEMU1ET0B", "Overall": "5.0", "Content": "I would tell everyone about this cell phone. It meets all my needs and i was very surprised of all its features. Thank you.", "Date": "December 15, 2013"}, {"Title": "yep it is a phone", "Author": "KayD", "ReviewID": "R30BW9EEU6QMK6", "Overall": "4.0", "Content": "Good phone. You get what you pay for. Inexpensive, does the job. Does not like metal shavings which is normal", "Date": "November 7, 2013"}, {"Title": "Bought this for a friend who is extremely broke", "Author": "M.K Ultra", "ReviewID": "RO5Y5VFVKWK0T", "Overall": "4.0", "Content": "I bought this phone for a very poverty stricken friend as his old VM phone was on death's door. He didn't like it at first but that's him.Now he pretty much likes it a lot. It was 6 bucks omg what do you expect? My advice - if this is still only 6 bucks buy it for a friend that's having rough times. There is a government program that you can get free minutes with if you have this phone.My broke friend is now using this phone to adequately call all the programs he needs to get a hold of. He's 50 years old and has a decent way to get ahold of his voc-rehab people, his medical people, his everything he needs to get back on his feet.Thank you Amazon for helping me help my friend.", "Date": "March 19, 2014"}, {"Title": "Its a five$ phone", "Author": "edward a regul", "ReviewID": "R21FTM87J9YUNH", "Overall": "5.0", "Content": "Works great has a 3.5mm head phone jack a big plus in this category. Battery is simply amazing I get about a week from each charge.", "Date": "January 20, 2014"}, {"Title": "BEST PHONE FOR THE OLDER FOLKS!", "Author": "Mr. Natural \"Randy\"", "ReviewID": "R1VUWBCCW5XB2", "Overall": "5.0", "Content": "This is a WONDERFUL phone!  For those with diminished eyesight or hearing, it offers a superb LARGE font and a very LOUD speaker and earphone.  The buttons are LARGE and LIGHTED, the camera is a good one, the build quality is excellent, and Sprint service is good.  It also has lanyard holes near the BOTTOM of the phone ... the ONLY phone I've found with this sensible design.  You want to NEVER lose or drop your phone again?  Get a neck lanyard and use it!This phone is identical to the Kyocera Coast(Boost Mobile) except the Coast has a black background for some screens instead of a red one.  Earlier phones with all the same features but a weaker camera were the Sanyo Vero and Sanyo Mirro (both with Sprint itself).  My family still uses the Mirro and Vero, and they are superb!  This Kona and the Coast are even BETTER!", "Date": "October 9, 2013"}, {"Title": "Great", "Author": "ELAINE", "ReviewID": "R2VTM8EOO8JQKA", "Overall": "5.0", "Content": "Awesome starter phone I especially like the large print.  I will recommend this to a lot of people. thank you", "Date": "July 26, 2013"}, {"Title": "RUBBISH. ONLY GOOD FOR CALLS!", "Author": "Thomas Grillo \"Thomas Grillo\"", "ReviewID": "R2UWJ3MWVWOGBN", "Overall": "2.0", "Content": "I took photos with this phone, but when I went to connect a USB cable to transfer them, but no dice. The USB port makes you think it's able to transfer data. NOPE! You can only recharge the phone with that port.Next, I tried to use Bluetooth to transfer the photos to the PC. NOPE, NO CAN DO! NO WAY! The devices paired up, but the only options for transferring files was transferring name cards, receiving name cards, or exchanging information, but no way to transfer photos to the PC. Even the name card thing failed to connect.I'm guessing I'll have to try transferring files to another hand held device the \"can\" connect to the PC. ABSURD!I really hate having to figure out stuff.I've tried emailing the photos, but NOPE! Not having any of that, the phone says with a resounding FAILED!REALLY??ABSOLUTE RUBBISH as far as file transfers go.As far as the screens go, they're bright, and after selecting large print features is easier to see.Call quality is poor, as usual.", "Date": "August 5, 2013"}, {"Title": "my opinion", "Author": "cheryl", "ReviewID": "RZVNIW9DJQAAI", "Overall": "5.0", "Content": "Love the phone...hate the service !! Virgin Mobile is the worst service anyone can have.. I canceled the service after 2 days. No towers, no connections to other phones, and they don't care. The phone itself is a great phone!!", "Date": "December 7, 2013"}, {"Title": "VERY PLEASED", "Author": "Steady Customer", "ReviewID": "R2CNSR8F3U1ZX7", "Overall": "5.0", "Content": "GREAT PHONE, I REALLY LIKE IT.  GREAT FOR THE OLDER PEOPLE WHO JUST NEED PHONE CONTACT.  I WOULD HIGHLY RECOMMEND THIS PHONE.", "Date": "September 16, 2013"}, {"Title": "It works great with Assurance Wireless!", "Author": "Greenwick", "ReviewID": "R3O40SJF1Y4GK3", "Overall": "4.0", "Content": "I like this phone a lot! It is super cheap, takes pictures, and the calls are much clearer on this phone than on the Jax that comes free with Assurance Wireless. And if you happen to use Twitter, this phone lets you use hashtags, which the Jax does not. I don't think the photos are as bad as many people say, and you can take some really big photos with this phone. This is a very sturdy phone, something I've come to expect of cheap Virgin Mobile phones. I would actively have to work at destroying it.I have found that with Assurance Wireless texting, I can only send photos to phones or e-mail addresses, and not to services like Twitter. I don't have any other technology with bluetooth, so I'm working on a way to get the pictures off without having to waste a text to send each one to myself.", "Date": "June 9, 2014"}, {"Title": "Easy and simple", "Author": "Kay", "ReviewID": "R3R4KJCT2SL7MG", "Overall": "4.0", "Content": "Just pick a plan and pay online 40$ a month and that's it. Simple to use really like it for a cheap price.", "Date": "June 9, 2014"}, {"Title": "good for the money.", "Author": "Amazon Customer", "ReviewID": "R3KS6RK1OREUX5", "Overall": "4.0", "Content": "easy to use. larger buttons. small screens bot inside and out. VERY HARD TO OPEN, EVEN WITH TWO HANDS. CANNOT BE OPENED WITH JUST A FLIP. MUST BE PRIED OPEN WITH BOTH THUMBNAILS UNDER THE LIP OF THE TOP OARY. durable long long battery life. mriley. il.", "Date": "June 8, 2014"}, {"Title": "Pretty Good Phone", "Author": "Jim", "ReviewID": "R2UJLB1VPO7NC8", "Overall": "4.0", "Content": "I'm a Virgin Mobile pay-as-you-go customer and when I saw this phone at Amazon for $6 vs VM's \"discounted\" $16 I took the plunge:) It's a decent flip phone, bigger and better photos than my last flip from VM.  Keys are a bit harder to push, but more tools.  Small enough to slip in my back pocket.  I charge it once every 5 days or so, though I don't use it a lot. You can't go wrong with it.", "Date": "June 6, 2014"}, {"Title": "kyocera kona", "Author": "Lesley Johnson", "ReviewID": "R1GKI56GR77UIV", "Overall": "4.0", "Content": "It is fine and certainly worth the price.  I rated it four because in my opinion the advertising was lacking.  I thought I was buying just a phone and could activate it with any company but I find that it comes with a specific company designated", "Date": "May 23, 2014"}, {"Title": "Haven't had it long", "Author": "YARNOVERMOM", "ReviewID": "R3MAMAEN7EJZPE", "Overall": "4.0", "Content": "Just got this phone about a week ago (5/7/14).  So far I have only one complaint and that is really just because of me.  I have not figured out, nor had much time to figure out how to lower the sound of the key tone.  You know the tone the phone makes when you punch a key.  On this phone it is really loud.  The good part of that is that if I don't hear the tone then I check to make sure I have entered the right info and that really helps.  I can't say that it gave me a better signal because I have NEVER had a good signal here at my house.  I will say this...I have big hands for a girl (I do a lot of crafts stuff with my hands so it is more muscle than not) and the keys are not so small that I mistype stuff, as in I hit more than one key or the wrong key.  They keys are larger than on most phones I have used in the past.  The sound quality is okay, but then I have not had the phone long and have not really used it to make or receive many calls.  I am on the Government Cell Phone plan and the other phone I had was a Kyocera JAX and that thing was a piece of ...... well you get the idea.  I had the thing over a year and had to replace it 8-10 times.  So to say the least this one is like a breath of fresh air.", "Date": "May 13, 2014"}, {"Title": "Good Buy", "Author": "bizbroka", "ReviewID": "R32V1UFU7SG3AZ", "Overall": "5.0", "Content": "This phone was certainly worth the $5 I paid. I like the large display, speaker phone and volume capabilities. Adequate for messaging too.", "Date": "May 11, 2014"}, {"Title": "I like my new phone that I just got easy to use", "Author": "Sherrie Marker", "ReviewID": "R8VU1JZ3ZXICM", "Overall": "5.0", "Content": "the phone was a good prices and easy to useit works with my lift line phone service companet plus I like to take pictures", "Date": "April 28, 2014"}, {"Title": "Good!", "Author": "Disappointed customer", "ReviewID": "R2BOFKIZQLB6SP", "Overall": "4.0", "Content": "This is a good basic phone, it's prefect for the not so technologically savvy. I have no complaints yet :)", "Date": "April 24, 2014"}, {"Title": "Works great", "Author": "Anna", "ReviewID": "RHQRR9KT4KPN2", "Overall": "4.0", "Content": "My son lost his phone so I got this one as a replacement and with a phone call he was up and running. No issues with the activation or the phone. He is a heavy user and is rough on phones but so far this phone has held its own!", "Date": "April 22, 2014"}, {"Title": "cell phone", "Author": "Kathleen Kammerer", "ReviewID": "R1TATXTATTGQEJ", "Overall": "5.0", "Content": "It was just what I was looking for. It replaced my old one and am glad to see the 911 feature ,", "Date": "April 18, 2014"}, {"Title": "My daughter loves it!!", "Author": "Ebony", "ReviewID": "R37XSKCPV5IC9U", "Overall": "5.0", "Content": "She wears glasses and this phone sparked her to be more responsible because she likes it so much. She has to learn how to set the ringtones and keep it charged. I am going to have to spend $5/month because she has friends to text and talk to.", "Date": "April 17, 2014"}, {"Title": "bought for my brother in law", "Author": "Antoinette Mesko", "ReviewID": "R30V4S4FV7BOJJ", "Overall": "5.0", "Content": "my brother in law is not tech savvy but this phone is easy for him to use he loves all the features", "Date": "April 16, 2014"}, {"Title": "kyocera kona review", "Author": "Beverly", "ReviewID": "R256SOI53L5NXD", "Overall": "4.0", "Content": "very good phone for the price those big numbers and time are great to have everything was good about the phone except the camera could have been betterand no sim or sd card place for it.", "Date": "April 12, 2014"}, {"Title": "Bang for your buck", "Author": "Shawn from Ohio", "ReviewID": "R3OFNHIZDKVOGR", "Overall": "5.0", "Content": "I love this phone.  I really love that I got it for $5.99.  Very well made and it works well.  I get a good signal with it and I have no issues.", "Date": "April 11, 2014"}, {"Title": "it is great paylo phone", "Author": "Michael F Acevedo", "ReviewID": "R3OUU8L5HJWXZS", "Overall": "5.0", "Content": "the only you must a data plan i have 10 bucks 20mb i think that it is check balance and use interent otherwise great phone", "Date": "April 8, 2014"}, {"Title": "Awesome Phone.", "Author": "David", "ReviewID": "R1PXBV7TG625VU", "Overall": "5.0", "Content": "Great phone. Big buttons. Very loud sounds and different ringers to choose from. The camera wasn't that great..it does take OK pics. Very good phone.", "Date": "April 5, 2014"}, {"Title": "Worth it", "Author": "James Beith", "ReviewID": "R3RXIVN7TO1P84", "Overall": "4.0", "Content": "Very good phone it does every thing I need and the set up was effortless outstanding!!!I would highly recommend this product.", "Date": "March 31, 2014"}, {"Title": "Cool phone", "Author": "Amazon Customer", "ReviewID": "R2ZCUW2AORM7T7", "Overall": "5.0", "Content": "This phone is awesome.  You can do amazing things with this flip phone. This phone is cool for traveling out of town on long trips.", "Date": "March 27, 2014"}, {"Title": "Good flip-phone", "Author": "B V", "ReviewID": "R57FASZUE02UJ", "Overall": "5.0", "Content": "Good and cheap entry level flip-phone. Great looking screen and nice buttons! Great battery life. Eventually I upgraded to the Kyocera Brio because i needed a full keyboard. (Although unlike the Kona, the Brio's buttons are awful)", "Date": "March 24, 2014"}, {"Title": "It's Pretty Good for the Price", "Author": "C. A.", "ReviewID": "R2NDHJZZ3EFCV6", "Overall": "5.0", "Content": "I bought this phone for my elderly mom and she likes the big keys for number.  It has a lot of features for the price.", "Date": "March 21, 2014"}, {"Title": "Does not function right with Assurance wireless through Virgin Mobile.", "Author": "Lisa  kay", "ReviewID": "R2J5OVPO471VIB", "Overall": "1.0", "Content": "This phone doesn't function properly. I won't send picture messages. I really dislike this phone. I have 3 of them.", "Date": "March 12, 2014"}, {"Title": "Easy to use!", "Author": "tea", "ReviewID": "R1ICH18GS5QHBL", "Overall": "5.0", "Content": "I got this phone for my 6yr old son to use when he is away visiting relatives. It's perfect for the price and very easy to use so he can call me anytime he needs too!", "Date": "March 9, 2014"}, {"Title": "Thought I Would Like it Better", "Author": "Michael Cadonic", "ReviewID": "RAXUP3OX73XVJ", "Overall": "3.0", "Content": "I got this phone thinking it would be a great flip phone. It's fair. Nothing special. The clock takes forever to display on the front. The ringer volume won't stay turned up or stay on vibrate. Very difficult to add people to the address book. It's difficult to flip open but better then some. I rarely use a cell phone anymore, so this will do for me. I wouldn't use it for business or making lots of calls. The monthly plan is very cheap for this phone.", "Date": "March 7, 2014"}, {"Title": "virgin mobile product", "Author": "Sarah Marie", "ReviewID": "R8WZF2MC1QNME", "Overall": "4.0", "Content": "I bought this cellphone for my 63year old mother...she loved it....thanks for the great price Amazon.com!!!!!! and virgin mobile for a great product!!!!", "Date": "February 8, 2014"}, {"Title": "Wonderful phone", "Author": "priscilla clark", "ReviewID": "R3C4KCPFFHNFUK", "Overall": "5.0", "Content": "this is a great phone for 5.99!! has a camera phone, large letters, go on web, facebook!  You can also, transfer from another phone to this Kona phone and  it is larger!!  Love it , love it!", "Date": "January 14, 2014"}, {"Title": "A good basic phone", "Author": "Jason616", "ReviewID": "R1AR3VU1RM30SE", "Overall": "4.0", "Content": "Got this for my mother, it has good sound quality, the 2mp camera as well as a large display on both the inside and outside.", "Date": "January 13, 2014"}, {"Title": "Virgin Mobile you are the best", "Author": "mama. duke", "ReviewID": "RABD299GQJ2VR", "Overall": "5.0", "Content": "My kyocera virgin Mobile phone is good work I ng fine so far only problem is it won't up grade that's not important will keep trying till I figure it out good hesring loud ring no problems in any othet area.Thsnks cost was great too.", "Date": "January 10, 2014"}, {"Title": "Got em for 4 dollars!", "Author": "R. Wade", "ReviewID": "R2XQ264RIICQT5", "Overall": "5.0", "Content": "Did I need them. No.  But I got 2 for 7.90 (3.99) Each Prime. These may be able to work on Ring plus or Cricket.", "Date": "January 6, 2014"}, {"Title": "Great buy!", "Author": "Laura Cook", "ReviewID": "R1SOQ0LHQKYG9F", "Overall": "5.0", "Content": "Good quality phone for the money. I would  recommend it highly to anyone.Kyocera has really made a comeback with this quality product.", "Date": "December 26, 2013"}, {"Title": "Significant Cons", "Author": "Matthias", "ReviewID": "R1RCTEE6ZSW7FP", "Overall": "2.0", "Content": "having used this phone for about 1 year, I have some notes for anyone considering buying this phone.The phone has significant aggravations:The vibrate is way too loud / obnoxious. It's a loud rattle; don't place it on your office desk! (IMO, don't buy this phone at all).The texting feature is moderate to severe crap. It's better than nothing, but I WILL SINCERELY BREAK THIS PHONE IN HALF ONE DAY. Let me explain. If you type too fast, it ignores key presses. If you don't press hard enough (regardless of the tactile click), it can ignore the keypress. It preselects random crap for certain words. Like \"Haga\" (yes, capital H) for \"haha\", ... and 10 other equally retarded mistakes for words that are common in texting.I can't stress enough that this phone will COMPLETELY IGNORE some of your key presses when texting! I have intentionally tested this over the course of the past few months. This is a huge problem that interrupts you and wastes loads of time. \"I know I pressed that button. I heard it click.\" ... but it ignored it because the processor was overloaded or something. DO NOT BUY THIS PHONE if you EVER text.The battery life is good, but that does NOT outweigh the downsides!", "Date": "February 24, 2014"}, {"Title": "Pretty good dumb phone", "Author": "SweetDaddy \"Darkmaster\"", "ReviewID": "RQINZY4E81EPD", "Overall": "3.0", "Content": "This is a very good dumb phone very good for old as people! like mom and dad. If you have a old as mom like i do (50) then please do not get them an s3 AT ALL! This phone is perfect this phone that has almost no features by today standards. This is a very good phone for old people.", "Date": "December 23, 2013"}, {"Title": "Kyocera Kona Cell Phone", "Author": "jimbid \"Car and Truck Buff\"", "ReviewID": "R3TGHWDKPPZC3R", "Overall": "5.0", "Content": "If you are in the market for a very nice flip phone, this should be given a thumbs up. I have a Smart phone and it did not have the ease of use as this simple cell phone does. This phone is just the right size to hold in your hand.", "Date": "December 10, 2013"}, {"Title": "Good little phone", "Author": "RowanAmarynthe", "ReviewID": "R1MMU8FC0BK757", "Overall": "5.0", "Content": "I got this phone for my roommate with low vision. She is delighted with the large buttons and alarm! A great little phone to use as -a proper phone for someone not needing or expecting smartphone bells and whistles. With the $40 unlimited  she is able to talk to doctors, friends and family without having to keep track of minute usage. A treasure.", "Date": "November 15, 2013"}, {"Title": "Not too shabby", "Author": "the frenchman", "ReviewID": "R3LLFEBU60ZSG2", "Overall": "4.0", "Content": "For $4.99, I decided to purchase two of these phones (one for me, one for my wife). I have been using a Samsung Restore Prepaid Phone (Virgin Mobile). The Restore is a bit buggy and my wife's T-M@bile phone has poor reception in the house where VM provides strong service.Functionally, I like the Restore better as it has a gmail app allowing me to send and receive emails via gmail. The Kona has no email apps. Instead, I had to set up gmail to forward to the Kona. I'm at least able to receive emails but don't like having to send emails via the VM email account...it screams out \"Technologically, I live in the year 2002.\" Additionally, many of the emails I want to read cannot be rendered on the phone, so I still have to use my compy to view.Call quality is no different from other Virgin Mobile phones.Camera is lame; basically useless based on its placement (on the handheld portion) where one's fingers tend to obstruct the camera.Alarm settings are nice and every alert can be customized (including phone calls based on groupings and individuals).I like the large display on the exterior. The large backlit keypad is nice and the screen on the interior is large and colors are vibrant - while nice, there is a price to pay when it comes to battery life.The physical footprint of the Kona is a bit larger than most flip phones while also being quite thin. It is very lightweight, so doesn't drag down clothing when on your person. There are also lots of faceplate options for this phone if you search Amazon. Also has a place for hooking a charm to it...old school, I know, but my wife loves that.After a full day of standby and 10 minutes of talk time (and sending a few texts/emails); the battery went down by one bar. This surprised me. I adjusted the screen's brightness down to medium and turned off the keypad backlight. After doing this, I got 2 full days of standby, 20 - 30 minutes of talk time and texts/emails before losing a battery bar.The charger the phone takes is pretty universal - I already have a slew of chargers that will work with the device, which is nice.This phone does meet my needs: phone calls, texting, and email. T9 is great and is under-appreciated. If you can embrace life without a smartphone, this phone might be a good fit for you. If you need a better camera, you'll want a smart phone. Low budg phones like this take mediocre (at best) pics.", "Date": "November 7, 2013"}, {"Title": "Not too shabby", "Author": "the frenchman", "ReviewID": "R3LLFEBU60ZSG2", "Overall": "4.0", "Content": "For $4.99, I decided to purchase two of these phones (one for me, one for my wife). I have been using a Samsung Restore Prepaid Phone (Virgin Mobile). The Restore is a bit buggy and my wife's T-M@bile phone has poor reception in the house where VM provides strong service.Functionally, I like the Restore better as it has a gmail app allowing me to send and receive emails via gmail. The Kona has no email apps. Instead, I had to set up gmail to forward to the Kona. I'm at least able to receive emails but don't like having to send emails via the VM email account...it screams out \"Technologically, I live in the year 2002.\" Additionally, many of the emails I want to read cannot be rendered on the phone, so I still have to use my compy to view.Call quality is no different from other Virgin Mobile phones.Camera is lame; basically useless based on its placement (on the handheld portion) where one's fingers tend to obstruct the camera.Alarm settings are nice and every alert can be customized (including phone calls based on groupings and individuals).I like the large display on the exterior. The large backlit keypad is nice and the screen on the interior is large and colors are vibrant - while nice, there is a price to pay when it comes to battery life.The physical footprint of the Kona is a bit larger than most flip phones while also being quite thin. It is very lightweight, so doesn't drag down clothing when on your person. There are also lots of faceplate options for this phone if you search Amazon. Also has a place for hooking a charm to it...old school, I know, but my wife loves that.After a full day of standby and 10 minutes of talk time (and sending a few texts/emails); the battery went down by one bar. This surprised me. I adjusted the screen's brightness down to medium and turned off the keypad backlight. After doing this, I got 2 full days of standby, 20 - 30 minutes of talk time and texts/emails before losing a battery bar.The charger the phone takes is pretty universal - I already have a slew of chargers that will work with the device, which is nice.This phone does meet my needs: phone calls, texting, and email. T9 is great and is under-appreciated. If you can embrace life without a smartphone, this phone might be a good fit for you. If you need a better camera, you'll want a smart phone. Low budg phones like this take mediocre (at best) pics.", "Date": "November 7, 2013"}, {"Title": "cdma", "Author": "Matt", "ReviewID": "R135JUP8T5XY73", "Overall": "1.0", "Content": "UGH! I hate this stupid phone, it is not GSM so you can not unlock it (at least not yet).", "Date": "January 21, 2014"}, {"Title": "Love this phone!", "Author": "Amazon Customer", "ReviewID": "RW7UFXQS1IHFL", "Overall": "5.0", "Content": "Love this phone! Easy display for texting and dialing. Back of phone is rough for easy gipping. Have had no problems with making or receiving calls.", "Date": "November 28, 2013"}, {"Title": "FANTASTIC!", "Author": "Kelsie LeCrone", "ReviewID": "R20NEPPQWPTW5S", "Overall": "5.0", "Content": "I bought this phone for my grandmother, and she LOVES it.Crystal clear calls, and it's really loud.I definitely recommend this phone to anyone looking for a great basic phone.", "Date": "November 16, 2013"}, {"Title": "Low Quality Frustrating Phone", "Author": "Tammy Wallace", "ReviewID": "R3MG5CUYTH9TJ6", "Overall": "2.0", "Content": "The sale went through great and as expected. The product itself is terribly made. I would not buy it again.", "Date": "March 3, 2014"}, {"Title": "A good buy.", "Author": "Angel Crossroads", "ReviewID": "R2RNQS0TSKLZQ3", "Overall": "4.0", "Content": "I am only able to have certain phones with the plan I am with, & the price couldn't of been better. Haven't had it that long yet, but I have a feeling it will be a good phone.", "Date": "February 11, 2014"}, {"Title": "awesome", "Author": "Lydia Vessels", "ReviewID": "R1KH2BHJ71JVZ2", "Overall": "5.0", "Content": "it works really good and hasn't had any issues yet I like the fact that its not broken or freezing", "Date": "November 22, 2013"}, {"Title": "GREAT CELL FOR ASSURANCE PHONE", "Author": "SPIRITED FLAVOR", "ReviewID": "R182VWYZV64YH4", "Overall": "5.0", "Content": "GREAT CELL PHONE NEEDED LARGER KEY PAD AND IT IS IDEAL, IT SHOWS CLEAR LARGE PRINT AND EASY TO NAVIGATE IN, THANKS.", "Date": "November 14, 2013"}, {"Title": "phone good for elderly and anyone with sight issues", "Author": "Janclair", "ReviewID": "R1LX2TKT22DZRM", "Overall": "5.0", "Content": "I was expecting the phone to be cheaply made because it was very affordable lexulous When I inspected it upon receiving it, I was pleasantly surprised It is well made. I ordered it for anelderlyfriend who has sight issues and numbness in her fingers. She has been a leader to work the phone without problem because the keys are larger and are backlit. She is delighted with the phone and the service so far. It is awesome!", "Date": "November 7, 2013"}, {"Title": "Poor Reception. Low Volume", "Author": "jim", "ReviewID": "RTWWSUID3ZG00", "Overall": "3.0", "Content": "This is a complaint about the phone and Virgin MobileThe phone I had and liked a lot got run through the clothes washer.I called VM and asked specifically if this phone would work with my plan.  The representative said yes.  Not trusting one answer I called and got a tech support person.  He also said it would.  After I had it and couldn't transfer my number to it I girded my loins and called their godawful support people.  They said the phone wouldn't work with my plan.  I explained I was told by two different reps I could or I wouldn't have bought it.  Then came the famous, \"I'm so sorry.  I can't imagine who have told you that.\"  In order to preserve my $700 accumulated in my account I took another plan that costs about three times as much as my original plan.Now to the phone.  I've had it and been using it for three weeks.The bad: The reception is MUCH worse than my previous phone. I don't remember having no access anywhere but in the bowels of a hospital.  With the Kona at least three places I've been unable to get a signal -- once while standing in a large window on the 17th floor.  I'm a little hard of hearing and the volume is MUCH lower than my previous phone and, so far, I haven't found a way to increase it. It's large and doesn't fit in the pocket my wife made for my previous phones.  I can't flip the phone open with one hand. The quality of the 2 megapixel pictures is poor. I downloaded the drivers so I could get pictures from the phone without having to email them.  After calling Kyocera support four times and doing the driver installation five times I've concluded you cannot connect the phone to your computer except for charging.The good:  The battery lasts twice as long as my previous phone.  The external display is larger, clearer and prettier, but I was happy with my old one.  The menus and settings work good enough.  It's amazingly cheap.Update:By now (6 months later) I've encountered several more than 3 places where I get no signal or not enough signal to make or receive a call, but where my previous phone did. I guess I have to retract some of my praise of the battery.  It's no longer holding a charge for a week (just turned on with no usage). Originally it would hold a charge for two weeks.", "Date": "December 18, 2013"}, {"Title": "Big and Easy To Read", "Author": "JaniceJimerson", "ReviewID": "RK28IBEOCF0Q8", "Overall": "5.0", "Content": "Nice large screen and easy on the eye.  I don't have trouble seeing, but I do like the large screen and large key pad.  Real easy to use phone.  I like virgin Mobile too.  They do strive to please their customers.  I own another fone by them, but it is not activated or has been used in years.  It is so very small  but a nice fone too.  May activate it too.  Great deals on their talk plans.  Just love them.  I really do.  They make efforts to fix any problems you have.Janice", "Date": "August 11, 2013"}, {"Title": "all you really need", "Author": "Steve", "ReviewID": "R2Y844LRPEXDNT", "Overall": "5.0", "Content": "this phone has all the bells and whistles that I need for a means of communication plus large print on buttons", "Date": "October 5, 2013"}, {"Title": "Junk!", "Author": "John W. Byler", "ReviewID": "R2UK2DLRK7W1AY", "Overall": "1.0", "Content": "Don't bother to buy it. I have had two of them from RadioShack at didn't work. Go to a good service and pay the price.", "Date": "December 30, 2013"}, {"Title": "This phone does not work with old phone plan", "Author": "C. LIN", "ReviewID": "RN1DROFS7CP7", "Overall": "1.0", "Content": "Note: The 1-star rating is for Virgin Mobile, not for this phone.I am a long-time customer of Virgin Mobile, so I have an old phone plan that is not available any more. When I tried to swap my dying phone with this one, Virgin Mobile won't let me. So, don't buy this phone if you have an old phone plan (call to make sure).", "Date": "August 9, 2013"}, {"Title": "Kyocera Kona RUBBISH!", "Author": "Leonard Lauro \"Len Lauro\"", "ReviewID": "R2QSH75YP8TEU6", "Overall": "1.0", "Content": "I owned this phone for free as a Sprint upgrade. In 3 hours I returned it even though I would pay a $35 recycling fee. The phone is super thin making opening the flip top with the thumb of one hand difficult if not impossible. It is wide and flat which means you need an unnaturally bendable thumb to open it - and you must get exactly into the right 'slit area' between the top and the body to do so. In the open position it's long so when lining up the earpiece to your ear, you must move the phone to speak into the mouth piece and must be right over the ear piece to hear; slightly off and you hear nothing. The flip top part is a bit heavier than the phone body making the phone feel out of balance and clumsy when open. Given these handicaps right from the start, I didn't care to learn about it's functions. I originally wanted the Kyocera DuraCore but the Sprint employee winced when I requested it and I thought this was professional disapproval but later surmised  that Sprint knows what a crappy phone this is and instructed their employees to push them out the door. Three hours later I returned it, got the DuraCore and could not be happier.", "Date": "October 2, 2013"}], "ProductInfo": {"Price": "$19.99", "Features": "Large, tactile keypad with visual separation for faster, easier typing\nLarge 2.4? main and 1.44? external color TFT display\nLarge font option support\n2.0 MP camera with dedicated function key\nWhat's in the Box: Kyocera Kona, li-ion battery, charger, user manual", "Name": "Kyocera Kona (payLo by Virgin Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/41jRGDR7xLL._SY300_.jpg", "ProductID": "B00D99DHH2"}}