{"Reviews": [{"Title": "Good phone for people who spill and drop their phone...like me", "Author": "Amazon Customer", "ReviewID": "RQTOEF1FICYNX", "Overall": "4.0", "Content": "The phone is great, but there was an issue with the listing. The vendor mistakenly listed it as an I9295 - the international version of the Galaxy S4 Active. It was in fact an I537 - the ATT model. It was, as listed, not locked to the ATT network, which is what I wanted, so I was not impacted as much as I might have been by the mistake. The vendor did send a couple of nice accessories to apologize for the mistake. They were quite responsive, and I will use them again.", "Date": "December 10, 2013"}, {"Title": "Not SAMSUNG factory unlocked!!!!!!!", "Author": "Gregory Mc Burnie", "ReviewID": "R2JRQUP07WL7UX", "Overall": "4.0", "Content": "This Phone is great, works as advertised except that when i received it I expected it to be factory unlocked from SAMUNG and it turned out to be factory unlocked from VODACOM with many useless pre installed apps. However, I guess once you are willing to work around that, the phone is a grt buy.", "Date": "November 17, 2013"}, {"Title": "This seller didn't send me what offered", "Author": "Johann Arispe", "ReviewID": "R36GZWFAQP5JOL", "Overall": "1.0", "Content": "It is very disappointing that the phone was offered as NEW, but it is very clear that the phone is a REFURBISHED(used) one. It even came with the screen protector(not the sticker of samsung) and clear marks that somebody had used it before. I am traveling this week, so I won't have time to wait for another phone. I really don't recommend this seller: \"mercate group\".", "Date": "February 10, 2014"}, {"Title": "No 4G in America", "Author": "Wilmer Charles \"SteelPantherArmy\"", "ReviewID": "R173M0IOPJGT23", "Overall": "2.0", "Content": "It is not listed as an international version phone, but the one I received was. It is apparent from the other reviews that they have collected these phones from multiple sources. I had to send my phone back.", "Date": "February 13, 2014"}, {"Title": "It is NOT waterproof", "Author": "Diego Haim \"Diego Haim\"", "ReviewID": "R3865API6UE4ZS", "Overall": "1.0", "Content": "I was afraid to test it underwater and I was right. Although it states that it can hold up to 30min under 1m, after 15min on the surface, the water got into the phone and caused it to stop working! Now the phone doesn't power on (it frezes after the samsung logo appears).Regarding the phone itself it is great", "Date": "April 25, 2014"}, {"Title": "My new phone S4 Active", "Author": "Janice D.Williams", "ReviewID": "R306JQXIDA7112", "Overall": "5.0", "Content": "The product is excellent.  It arrived sooner than I thought it would. Furthermore,  it works perfectly. I don't think I could have gotten a better deal anywhere else.", "Date": "May 4, 2014"}, {"Title": "it is best that resists water and the photos are wonderful", "Author": "A. Ojeda Martinez \"Alejandro Ojeda\"", "ReviewID": "RAKLBXGA9W8OD", "Overall": "5.0", "Content": "excellent team for nature lovers and those who we are in extreme environments, like adventures and other activities, a durable phone", "Date": "April 22, 2014"}, {"Title": "Great Phone - Great Seller", "Author": "Kate", "ReviewID": "R36M8VQPR2Y2LB", "Overall": "5.0", "Content": "I am very happy with my Galaxy S4.  The screen size is great but it's still easy to carry in my pocket or purse.  It arrived as promised the day after I placed the order.  As others have mentioned, they were purchased overseas, so the plug and users guide are not US standards.  They did include an English version quick start guide and the cord works with any standard USB plug, so it is well worth it for the cost savings.  I would buy again.", "Date": "April 8, 2014"}, {"Title": "its every thing i wanted", "Author": "Tareq Ali", "ReviewID": "R1XNHI207KBW5F", "Overall": "5.0", "Content": "its every thing i wanted , crystal clear camera and monitor .has lots and lots of feature and very user friendly .", "Date": "April 1, 2014"}, {"Title": "Excellent phones", "Author": "Hank W.", "ReviewID": "R3HK8QML228O0H", "Overall": "5.0", "Content": "I live in latin america and travels all over the world and it works excellent with any phone network, i would recommend this phone.", "Date": "March 13, 2014"}, {"Title": "awesome work", "Author": "Vic \"El Tigre77x\"", "ReviewID": "R20SK08EGNW378", "Overall": "5.0", "Content": "So far, so good. I've had the phone for two days now and its exactly what I wanted. I was coming from a Galaxy S2 and it was dying from some issues I caused. The price is over a third less than Best Buy and a couple hundred off of AT&T.; Quick trackable shipping from Wireless Everything and exactly as described. They added a US plug adapter since this is the International version. Transfer of contacts through Google service is easy, but Apps take some time.Make sure you go and get a micro Sim card for the phone. Just 10 bucks and 5 minutes at the AT&T; store AFTER you get the new phone in.", "Date": "March 8, 2014"}, {"Title": "this phone is great", "Author": "Tierney Dyas", "ReviewID": "R29PT690UMRVUG", "Overall": "5.0", "Content": "I have no complaints with my phone still learning about it everyday really love it i recommend this phone to everyone!", "Date": "March 5, 2014"}, {"Title": "super product", "Author": "Deli", "ReviewID": "RUI31Y1281H7M", "Overall": "5.0", "Content": "I think it's better than the original S4.  Sturdy build, water resistant, just the flimsiness of the charging port cover gives me unease.  KitKat update just came out for it.", "Date": "June 4, 2014"}, {"Title": "LOVE my phone", "Author": "Celia de los Santos", "ReviewID": "R3ME0HYU56WRMF", "Overall": "5.0", "Content": "My son talked me into buying this phone. I love it! Very reliable phone, the only thing i don't like is the battery life on itI don't use it that often, but still have to charge it ever 24 hrs", "Date": "June 4, 2014"}, {"Title": "How can an International phone have Qualcomm LTE", "Author": "Almost Golfer", "ReviewID": "RPZ0P14GT6BOH", "Overall": "2.0", "Content": "I received the phone and took it overseas the next day only to find out that it is not exactly an international version. I can't get LTE because the LTE is Qualcomm which is CDMA so it is limited to 3G . I found written in fine print on the side of the phone \"Qualcomm 4G\" which doesn't match what was advertised by the seller. I'm disappointed and not impressed by the false claims and specs written for the product by the seller.I like the phone in every aspect except for the LTE.", "Date": "May 29, 2014"}, {"Title": "I like it", "Author": "anely", "ReviewID": "R3PQOZEOVUPQS6", "Overall": "5.0", "Content": "Really it is excelent , I m happy whit this . I hope keep it long time working with me", "Date": "March 4, 2014"}, {"Title": "Excelent !!", "Author": "Enrique Valencia", "ReviewID": "R2FOEKOAAD90OR", "Overall": "5.0", "Content": "This product is good. The software, the response is very good.Just the batery need more life because if I use a lot to see things in internet, only is longer one day.I recomend buy a protect case.The speaker I cant hear if I put the cellular phone with the back in the table.", "Date": "February 27, 2014"}, {"Title": "Great", "Author": "shauna-kay creary", "ReviewID": "RXFQ5R25P2Y8M", "Overall": "4.0", "Content": "I'm in love with phone it's great my only problem is that the battery dies quickly but its features are wonderful!", "Date": "February 20, 2014"}, {"Title": "awsome", "Author": "efrain", "ReviewID": "R1MLCQCUHR2R9E", "Overall": "4.0", "Content": "This item works great i like it is bery awsome and it takes a clearly pictures What you can edit so good", "Date": "April 23, 2014"}, {"Title": "Not as advertised!!", "Author": "Mark Frazier", "ReviewID": "R30ZUMTWKFB2RI", "Overall": "1.0", "Content": "First of all. It wasn't a 4G or even a 3G phone. That doesn't matter anyway. It only worked for 2 days then it died. Just started flashing the Samsung screen and would not boot-up completely. That was a wasted $460. I advise anyone in the continental USA DO NOT PURCHASE!!! Unless you plan on spending a great deal of time in England.", "Date": "March 27, 2014"}, {"Title": "Didn't work and didn't get our $420 back from Amazon - Worthless and not as advertised", "Author": "Brian", "ReviewID": "RS0P7T4ZMUV1F", "Overall": "1.0", "Content": "As far as I can tell, this phone does not work at all outside of Malaysia. My wife and I tried to get this working with AT&T; for a month and switched back to a locked phone on Verizon. We lost our $400 and are extremely dissatisfied with Amazon and AT&T.;", "Date": "March 7, 2014"}, {"Title": "Amazed", "Author": "John Paul Leonardo", "ReviewID": "R1BDXD6WWD62UC", "Overall": "5.0", "Content": "Been over a month and it works fine.  Looked totally brand new when I took it out of the box.", "Date": "December 28, 2013"}, {"Title": "I love it", "Author": "Ana María González", "ReviewID": "R3SB9UZRRV6MS", "Overall": "5.0", "Content": "phone in perfect condition, works very well is a bit heavier than the S3. I have not wet it scares me haha", "Date": "May 8, 2014"}, {"Title": "I am very please with the condition of this phone and how fast i got it", "Author": "trevil", "ReviewID": "RZ08SOAB3HW3H", "Overall": "5.0", "Content": "Works perfectly and i plan to buy another for my friend, no issues what  so ever.i even got an adapter with it to plug in", "Date": "March 24, 2014"}, {"Title": "The only Con: Must have a wireless charging option. If it is important anywhere, it is here and for the S5.", "Author": "Adar Omry", "ReviewID": "R37479050YCQ9X", "Overall": "5.0", "Content": "Wish it would have the wireless charging option because it is only an amount of time before the rubber seal of the USB falls off, then this phone losses it's most important advantage.", "Date": "March 3, 2014"}, {"Title": "FiveStars", "Author": "January Cayaya", "ReviewID": "R1KHU9N3DQXMJZ", "Overall": "5.0", "Content": "Its so cool! I dont need to use my wallet because it has the compartments that i need for everyday living.", "Date": "February 2, 2014"}], "ProductInfo": {"Price": "$399.74", "Features": "GENERAL\t2G Network\tGSM 850 / 900 / 1800 / 1900 3G Network\tHSDPA 850 / 900 / 1900 / 2100  \tHSDPA 850 / 1900 / 2100 4G Network\tLTE 800 / 850 / 900 / 1800 / 2100 / 2600  \tLTE 700 / 850 / 1700 / 1900 / 2100 / 2600 - SGH-I537 SIM\tMicro-SIM.\nDISPLAY\tType\tTFT capacitive touchscreen, 16M colors Size\t1080 x 1920 pixels, 5.0 inches (~441 ppi pixel density) Multitouch\tYes Protection\tCorning Gorilla Glass 2.\nMEMORY\tCard slot\tmicroSD, up to 64 GB Internal\t16 GB (11.2 GB user available), 2 GB RAM.\nCAMERA\tPrimary\t8 MP, 3264 x 2448 pixels, autofocus, LED flash, Features\tSimultaneous HD video and image recording, geo-tagging, touch focus, face and smile detection, image stabilization, HDR, Aqua mode Video\tYes, 1080p@30fps,  Secondary\tYes, 2 MP,1080p@30fps.\nFEATURES\tOS\tAndroid OS, v4.2.2 (Jelly Bean) Chipset\tQualcomm APQ8064T Snapdragon 600 CPU\tQuad-core 1.9 GHz Krait 300 GPU\tAdreno 320 Sensors\tAccelerometer, gyro, proximity, compass, barometer, gesture Messaging\tSMS(threaded view), MMS, Email, Push Mail, IM, RSS Browser\tHTML5.\nBATTERY\t \tLi-Ion 2600 mAh battery Stand-by\tUp to 312 h Talk time\tUp to 17 h\nBODY\tDimensions\t139.7 x 71.3 x 9.1 mm (5.5 x 2.81 x 0.36 in) Weight\t153 g (5.40 oz)  \t- IP67 certified - dust and water resistant - Water resistant up to 1 meter and 30 minutes.", "Name": "Samsung Galaxy S4 Active Dive I9295 Unlocked International Version Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/517klS1rR3L._SY300_.jpg", "ProductID": "B00DELEBY8"}}