{"Reviews": [{"Title": "I was scammed!!!", "Author": "Gerardo Garces", "ReviewID": "R3IVPV50QIC8PO", "Overall": "1.0", "Content": "I ordered and paid for a 16 Gb phone and I received a 8 Gb phone for the price of  a 16 Gb one!!!!. I didn't recommend to anyone buy this item and if anyone wants to take the risk, watch out.I'm really disappointed with amazon.", "Date": "August 3, 2013"}, {"Title": "White 16gb Nexus 4 lmited edition", "Author": "S. Frederick \"SteveF101\"", "ReviewID": "R2W2D3EPMVV6OM", "Overall": "5.0", "Content": "This is my third Nexus 4 and as there are more than enough reviews on the phone itself, I'm not going to comment on what a great phone it is, and will instead comment on the supplier and Amazon. I could not be more pleased with this supplier. Both of the other Nexus phones I have I ordered directly from Google and had to pay tax and shipping which bumped the price up considerably and took a week before I received them. I wanted the white version which is not available on Google anymore so turned to Amazon this time and am really glad I did!I have the Prime subscription, ordered the phone on Thurs morning, paid the $4.00 for next day service and received it Friday afternoon, so was able to set it up over the weekend to be ready for work on Monday morning, it really doesn't get much better.  I really like the white limited edition, the bumper is also a great choice.  I did indeed receive the 16gb model and it works perfectly with AT&T; service, I pulled the sim from my Nokia Lumia 920 (also an awesome phone!), popped it in the Nexus and was good to go.  I also received a screen protector with the order which I wasn't expecting which was a pleasant and welcome surprise, you can never have enough screen protectors :).The bumper that I ordered at the same time seems to be exactly the same OEM version at half price of the same Google play store bumper, I highly recommend it. It keeps the back and front of the phone from getting scratched when you set it down and it works perfectly with the controls without adding much bulk to the phone.LG Mobile CCH190WH Bumper Nexus 4 White", "Date": "August 22, 2013"}, {"Title": "Great phone!", "Author": "Jordan Santos", "ReviewID": "R2NALUPEQLS7UG", "Overall": "5.0", "Content": "It worked with a brazillian SIM card without any problems.The white limited edition is very nice! Couldn't find it in the play store.I recomend it!", "Date": "August 13, 2013"}, {"Title": "Great phone and user friendly", "Author": "Billysbayte", "ReviewID": "R16WPVA2SWBU7C", "Overall": "5.0", "Content": "I especially like it for the screen size,unlocked feature and updated operating system. If your looking for a top of the line android  phone I believe this is it.", "Date": "August 29, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D5P308Q"}}