{"Reviews": [{"Title": "Very very very angry", "Author": "Guillermo", "ReviewID": "R2G7UHEN6WFDBX", "Overall": "1.0", "Content": "This phone does not work in the 850 mhz with 3g. Although in ad was saying that yes.It say: WCDMA 850/2100 MHz[...]", "Date": "August 23, 2013"}, {"Title": "WOW", "Author": "Ant", "ReviewID": "R1VZ043G91IOUY", "Overall": "5.0", "Content": "Ok, first day with the thing and just playing around with it....ITS CRAZY. For the price you cant beat it really. You want a good mix between a tablet and a cell phone but only 5 inches this your best buy. Then you get dual sim...both of mine work fine and my navagation works fine. The box is in Chinese, but the phone was already set in ENGLISH. Both cameras work fine, and the only down fall which i dont really care about is its a 3g phone...4g is over rated anyways. Its a great phone, and im happy with it.", "Date": "January 15, 2014"}, {"Title": "Great phone, but...doesn't support 3G 850.", "Author": "Steven Gwynne \"restive\"", "ReviewID": "R2XTOZWS7VQUOD", "Overall": "2.0", "Content": "Big screen with crisp resolution, excellent phone reception, thin, light, 13 megapixel camera, 1.5 quad core cpu. Works great...but it doesn't support 3G 850. Which means someone living in North or South America can't access the internet through the AT&T; 3G network. You can access the internet through your home or work network or at Starbuck, but that's about it.I should have guessed. All the dealers for this phone are in either Asia or Europe. Too bad. If this thing supported 3G, I would recommend it highly.", "Date": "January 8, 2014"}], "ProductInfo": {"Price": "$399.99", "Features": "Upgraded version Full HD Android 4.2 Phone with 5 Inch Capacitive 1080p Screen with 441 PPI, 1.5GHz Quad Core CPU, GPS, Bluetooth, 13MP camera and so much more. Life in HD looks just fabulous!\nAndroid 4.2 5 Inch Full HD Phone 1920x1080 Resolution 441 PPI 1.5GHz Quad Core CPU MTK6589T 13MP Camera", "Name": "iOcean X7 pro - 5 Inch 1080P Full HD Screen, 1.5GHz quad core, 441PPI, 9mm Ultra slim Android 4.2 SmartPhone Dual SIM GPS, Bluetooth 13MP (Black,white)", "ImgURL": "http://ecx.images-amazon.com/images/I/413GP4ViEmL._SY300_.jpg", "ProductID": "B00DTRM3F6"}}