{"Reviews": [{"Title": "My emergency phone, but not for long", "Author": "Gabriel Fritz \"-Gabriel\"", "ReviewID": "R3GDIZTMODR5WB", "Overall": "2.0", "Content": "After my phone got stolen when I was traveling and I didn't have the opportunity to replace it with a decent phone, I quickly bought this one as a bridge phone, a short term replacement. And this is the only purpose I would recommend this phone for. It is clearly underspeced and I find it a pain to use. Let's see why.Touch screen: The responsiveness is very laggy. Sometimes I try to unlock it and it just won't work. I have to turn the screen on and off several times by pressing the lock-button and hope that it works the next time. I have a pattern lock and I usually have to swipe it in more than once until it recognizes what I did. When typing, sometimes it would get stuck and then suddenly write four or five letters at once. The touchscreen is very inaccurate though and I constantly hit the wrong keys. This also makes the swipe-input method difficult to use. I dislike typing on this phone so much that when I receive a message on my phone, I will walk to my laptop and respond there. Unfortunately this doesn't work for WhatsApp.OS: The phone runs 4.1 and doesn't seem to be able to handle it. Animations are never smooth and sometimes when I press the home-button it will take up to 10 seconds until it loads up the home-screen. Multitasking is therefore also not very helpful. When long-pressing the home-button in order to open the multitasking menu I also wait about 8 seconds until it can show me what applications were running recently. It can barely do two things at once. When I listen to music on this phone and at the same time surf the Internet (which is also horribly slow) the music will randomly stop playing until I re-open the music app. I assume this happens because the phone ran out of memory. I like to take my iPod with mid for this reason. This is why the multitasking menu is not exactly a multitasking menu than it really is a recently-opened list of apps. Every touch on the screen should be well-considered as it will take several seconds in order to show you what you did and if you are not sure if the screen recognized your input and bother to try again, it will usually turn out that it did recognize your first input, took a while to load the screen, recognize your second input as well and applies your second input on the following screen, messing up what you actually wanted to do because you have to return to the previous page, which will also take several seconds and so you waste a lot of time and battery life on fixing wrong inputs. I can't tell you how annoying it is if you can't turn off your alarm in the morning after the third try or pick up a phone-call and end up missing it. There are some strange bugs here and there. For example, when I turn the phone on, I unlock it and I type in the SIM-pin. Then I have to unlock it again and it goes back to the lock screen for some reason and I unlock it a third time.Battery: Even if I don't do much on the phone it will run out of battery very fast. I usually unplug it at 8 o'clock in the morning and by 2 pm it will complain about the battery being low. It will do that for about half an hour and then turn itself off. The strange thing is, that when I turn it back on it shows that I still have 30% of my battery left and I can use it for another hour or so. This is still unacceptable and I can't leave my house without a second charger handy. To be fair, because the battery is very small, it will charge quickly. In about 2-3 hours it is full and ready to go again. Until it turns itself off 7 hours later. With casual use. When I listen to a podcast or music the battery will die more quickly of course. Then this phone is only usable for about 5-6 hours.Build: The phone is made with cheap plastic all around and has the typical Samsung look to it. The back of the phone is removable (VERY easily) and you can exchange the battery, put in a micro-SD card and swap the SIM. The plastic back comes off so easily that I am afraid it will fall off by itself after a year of using it. The touch-screen in the front scratches very easily and won't recognize your input if it is not clean enough. The capacitive back and menu buttons usually recognize all inputs if the OS happens to not lag at the moment and so does the home button. The ear-peace and the microphone are acceptable for quick calls but for longer, enjoyable calls I would recommend a headset. The phone looks pretty fancy but after a month or two it won't have any of this fanciness left. The phone doesn't have a proximity sensor and tries to work around that by locking the screen automatically when you are on a call. The screen turns off after a couple seconds. If you want to hang up you have to press the power-button, wait for the screen to turn on, double-tap the middle of the screen and then hit the red phone icon. This process takes about 8 seconds and by then the other caller already hung up. I usually wait for that honestly.Camera: Let's not talk much about the camera. It's worthless and should only be used to ... no never mind. It should never be used.Conclusion: As I stated in the beginning, this phone should really just be considered a bridge-phone, a gap-solution that gets you excited for the next phone you are going to buy. The phone does everything needed at a bare minimum. It shows your location on a map, makes phone calls, sends SMS, uses WhatsApp, streams YouTube (more or less) and can handle basic apps. This is all this should be used for.  With any other slightly better phone you will get spoiled. The only reason to buy it is because you lost yours or your phone got stolen and you happen to have only 80€ ready to buy a new one. This is the only pro to this phone, it is cheap. And this is what I was going for when I came in the store to buy it. I asked: „What is the cheapest phone I can WhatsApp with?“ and here I go. Enough for survival.", "Date": "December 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D06Y9D0"}}