{"Reviews": [{"Title": "Great Bluetooth Watch", "Author": "Frank", "ReviewID": "R1B3ECS60EH8AK", "Overall": "5.0", "Content": "It does the basics. When your cell rings, you can answer it on the watch. The speaker on the watch is acceptable and loud enough to hear at most noisy places. You can set an alarm on the watch, it tells time, day and year as well. Otherwise it's basic and does what it says. Oh, the battery life on it is fantastic! Not bad price for a beginner basic bluetooth watch.", "Date": "October 9, 2013"}, {"Title": "the watch I wanted", "Author": "cabman", "ReviewID": "R15I61YYJBTJSM", "Overall": "5.0", "Content": "I gave this item a 5 even though I should have gotten an earpeice to go with it to hear better. For the money I thought it was worth it.", "Date": "December 24, 2013"}, {"Title": "Nice watch!!!!", "Author": "DERRICK LOFTON", "ReviewID": "RXXVC3AXJ14JC", "Overall": "5.0", "Content": "Great product, is wored as advertised, best worn in the summer, like most phone or speaker phones watches it bulky so don't expect slim comforts but it nice!!!!", "Date": "December 7, 2013"}, {"Title": "newnow is a great seller.", "Author": "os_cali", "ReviewID": "RPH7WGFHD63CZ", "Overall": "5.0", "Content": "this watch is good. its has 24hr time. battery last long. have not used it in awhile and its still on. can read the numbers and time verry well. but most of all the seller is top notch. thanks for the help with this.", "Date": "September 1, 2013"}, {"Title": "Dick Tracy Bluetooth Speaker", "Author": "John Gilbert Sorenson", "ReviewID": "RS0H21RAN1Z6K", "Overall": "4.0", "Content": "It works well.  I was suprized that it projects enough volume to be heard in a normal background environment.  It is a hands-free speaker phone bluetooth worn on your wrist so that you do not need to dig into your pocket or backpack to answer incoming calls.  Other bluetooth wrist watches merely alert you to an incoming call, but you stil need to answer them with your phone.  This one allows you to answer the call, speak, and listen without fumbling around for your phone.  You actually speak into your watch, just like Dick Tracy.  It keeps good time and has easy to read numbers.  Its one and only drawback is battery life.  It requires to be recharged every night.", "Date": "December 5, 2013"}, {"Title": "Beautifully and somewhat stylish", "Author": "Brutus", "ReviewID": "R3TZYJINERDV7Z", "Overall": "4.0", "Content": "Linked fast and easy to link to my new I phone ,easy to navigate for a non techie person. I enjoy it very much not having to handle my phone all the time. Great product", "Date": "February 15, 2014"}, {"Title": "Use it all the time", "Author": "john", "ReviewID": "RRC1IUGUOE1E1", "Overall": "5.0", "Content": "I have a large phone that I don't want to get dirty in my shop. Having this Bluetooth is so handy to use in the place of my phone while working. The only draw back is that you better charge it every day. Small milliamp battery", "Date": "February 13, 2014"}, {"Title": "Pairing smart watch to samsung galaxy note 1, headphone only not speaker phone", "Author": "Richard W.", "ReviewID": "ROFL7RGKAN890", "Overall": "1.0", "Content": "Smart watch will not pair in speaker mode, only headphone mode.....If I turn headphone off in cellphone I can hear caller and they can hear me thru the watch. This requires me to access cellphone on every call, which defeats the purpose of having the watch only.", "Date": "November 9, 2013"}, {"Title": "Yeah but....", "Author": "Damon", "ReviewID": "R1ERI3TV4WOBEY", "Overall": "2.0", "Content": "Connectivity can be an issue , there is no internal volume control,and the caller iD only shows #s no name, thought it would sync and show name... Doesn't show txts or emails... But it's a fair value for the money... A good starter watch for smartphone users", "Date": "February 17, 2014"}, {"Title": "telling time", "Author": "BARRY NEVINS", "ReviewID": "R1Z94ZUHWYT59R", "Overall": "2.0", "Content": "problem is that it only keeps military time (24 hours) and difficult to pair. I would not recommend this watch", "Date": "May 17, 2014"}, {"Title": "Didn't work", "Author": "Hal H.", "ReviewID": "R3GZH7B6AL969W", "Overall": "1.0", "Content": "I had hoped this inexpensive, modern looking watch would update its time from my AT&T; Android phone.  It was larger and thicker than expected, too big for my wrist.  And it did not connect with my cell phone using bluetooth at all.  It turns out the time is not set from the cell phone signal anyway, it is just a large quartz watch that would notify the user that there is a call on the cell phone if it worked.", "Date": "May 15, 2014"}, {"Title": "\"Didn't make the cut\"", "Author": "troy stokes", "ReviewID": "R34VRICBDFKJ26", "Overall": "3.0", "Content": "This watch did not meet my expectations. Although it does works as designed, the lack of versatility causes this watch to not make the cut.", "Date": "May 11, 2014"}, {"Title": "Cheap....Get the better one!!", "Author": "Frances Donaldson", "ReviewID": "R3Q3RLYOFS85RA", "Overall": "2.0", "Content": "Cheap!! What a waste, it's a Bluetooth just not on your ear... I should have spent a couple more dollars and got my son the better one.... Lesson learned!!", "Date": "May 10, 2014"}, {"Title": "volume should be better", "Author": "ken", "ReviewID": "R18VIR9TJT4VXG", "Overall": "3.0", "Content": "The volume needs improvement.  Other than that I love it. Oh and seeing names on caller id would be awesome", "Date": "March 11, 2014"}, {"Title": "Nice gadget", "Author": "Erich F. Stocker", "ReviewID": "R2DBTEF1ENN33Y", "Overall": "5.0", "Content": "I have been amazed at how far this watch will still stay in contact with my iphone.  Also I can hear through the watch when I get email, etc. I have answered via the watch and a friend tells me it sounds ok but not like talking directly through the phone.  So far I have enjoyed the watch and its features.", "Date": "February 15, 2014"}, {"Title": "bluetooth 3.0 works", "Author": "ray", "ReviewID": "R1UTYLCUPRQRT0", "Overall": "3.0", "Content": "nice watch.does connect with phone.speaker is a pinhole and sounds like you have a mouse.pinhole is also the mic.very low audio.answers phone as soon as call is received.does not give you a chance to hang up.battery is to small.250mah.to little capacity.battery is a lipo.they are used in small remote control aircraft.never,never charge the watch whil you are wearing it.they can swell up and burst into fire or explode.always charge the watch on a fireproof surface.i have these batteries for my model flying aircraft and they really stress this warning.just go to a hobby shop and ask them about this battery.i want this bluetooth 3.0 in my 2012 phone watch.it would operate it fine.the 2012 new watch has loud audio.i just have to get amazon to either offer this firmware upgrade or sell it to me.i want it for the other watch.the watchband on this current watch cannot be changed.yuk.this watch is not waterproof also.has vent holes in back of case.if battery starts burning,you will get your skin cooked.this is because as this battery charges it does get hot.i repeat,do not charge it while you are wearing it.that is for your own safety.other then that.it does work.", "Date": "January 29, 2014"}, {"Title": "Great remote for answering the phone,  IT JUST WONT TELL THE TIME OF DAY!", "Author": "BJF", "ReviewID": "R1N2UJCXQZLUQ3", "Overall": "1.0", "Content": "The bluetooth works ok it pairs and answers the phone. I can set the Time and Date, and alarm just fine. JUST ONE BIG PROBLEM ! THE TIME WILL NOT UPDATE OR EVEN RUN. The alarm works if you have both the time and alarm set to the same time. I bought it while I was on vacation in the states so returning it is not an option.  I guess If you can be happy with a watch that is only correct for only one minute a day this is the watch for you.  The manual says nothing about any app that is needed. so a bluetooth answering device it works but poorly.  I just really want a watch that tells time accurately.", "Date": "January 29, 2014"}, {"Title": "Not worth the aggravation.", "Author": "Evelyn F. LeBaron", "ReviewID": "R24782EQFA5RFZ", "Overall": "1.0", "Content": "This came with no instructions and the display broke after 1 week of wear. (won't show some of the numbers/letters.) Very disappointed.", "Date": "January 4, 2014"}, {"Title": "i don't like it....", "Author": "Jamarr Lynch", "ReviewID": "R3FQH09MMEVHBD", "Overall": "2.0", "Content": "i got this watch and the mic where u suppose talk into is very low and u can't here anything from it even when u turn the volume up from your phone and i had to wait almost 3 weeks for this watch to give to my son for Christmas and it's not even working smh....", "Date": "December 30, 2013"}, {"Title": "Wrist watch a hit!", "Author": "phoenix_dawning", "ReviewID": "R3F3506ND4XLBH", "Overall": "5.0", "Content": "I purchased this for my boyfriend for christmas and it is a very handsome watch. The sound is crystal clear and even when not held to his mouth you could hear it very clearly. He was very pleased with his gift. It seems to match up well with his cell phone and has proven to be of decent quality and very useful. I would recommend this. It is a very large faced watch as a side note.", "Date": "January 10, 2014"}, {"Title": "Waste of money", "Author": "Joseph Stephen \"Joe Nadukkudiyil\"", "ReviewID": "R1IL5WKXA778DB", "Overall": "1.0", "Content": "Does not work half the time.  Proximity alarm is a non starter.  Fortunately did not cost much so I can live with my loss.", "Date": "January 25, 2014"}, {"Title": "piece of junk", "Author": "jpete \"jpete\"", "ReviewID": "R2U69Y2UX878CW", "Overall": "1.0", "Content": "Piece of junk...this watch is horrible. The speaker does not work and it hangs up the call on its own while your trying to answer. Trust me don't waste your money because that's what this is.....this watch is junk complete junk....give me my money back......", "Date": "January 24, 2014"}, {"Title": "boring", "Author": "Pablo", "ReviewID": "R1PU2DG2ANWO88", "Overall": "3.0", "Content": "Really does not do as much as others as far as I can tell.only phone. Instruction brief. Would not buy again.", "Date": "January 18, 2014"}, {"Title": "not worth the money.", "Author": "Quinones63", "ReviewID": "R24H4X2YNBD8YG", "Overall": "1.0", "Content": "for the price i dont think it was worth it. cant recongize the names. and it doesnt  keep time well. i tryed several times with it and it just didnt work.", "Date": "January 17, 2014"}, {"Title": "Function is great but cheap looking！", "Author": "Jlee", "ReviewID": "R9NTNX8AP0FN", "Overall": "3.0", "Content": "Function is Good but too bulky looking and battery life is not last for a day！ Looking for another one with better looking！", "Date": "January 7, 2014"}, {"Title": "Not a good buy", "Author": "Barry Theodore", "ReviewID": "R1T6BX1VZ934Y5", "Overall": "3.0", "Content": "Not loud enough and it's very hard to hear  volume needs to be adjust for future purchasing and that's base on my rating", "Date": "January 7, 2014"}, {"Title": "Garbage blue tooth watch", "Author": "Paul", "ReviewID": "R3W3UF6L88XWST", "Overall": "2.0", "Content": "This is garbage can't here the phone ring or here the person that you are talking too it's always on 24hour time and no volume", "Date": "February 20, 2014"}], "ProductInfo": {"Price": "$79.99", "Features": "Bluetooth watch with OLED caller's ID display\nThe Bluetooth wristwatch can be applicable for every brand bluetooth mobile phone.\nBluetooth wristwatch ringing when distance on watch and mobile phone is more than 5-10M\nWhen not in use it can perform as a watch with fashion design\nIt is easy to conversation/answer/ dialing/hang up", "Name": "NewNow Wristwatch Bluetooth Watch with Mic for iPhone 4S, 5,HTC ONE, Android Cellphone", "ImgURL": "http://ecx.images-amazon.com/images/I/41aVHmcD0nL._SY300_.jpg", "ProductID": "B00DY03N2U"}}