{"Reviews": [{"Title": "A REAL mobile phone for the rest of us !", "Author": "AndyC \"AndyC\"", "ReviewID": "R1WA5XT7WZ07TJ", "Overall": "5.0", "Content": "This is a GREAT phone for the many, many of us that want a PHONE, not an overpriced piece of techno glitter with a bazillion features we neither want nor use. Why U.S. cellular providers do not offer this or similar phones is a mystery to me.It's classic Nokia - solid build, clear and logical user interface, real keyboard, good size clear display, camera that's fine for the occasional quick photo and it's affordable. As to the power consumption issue that has appeared in some European reviews, I just don't see it - I fully charged the phone over 2 days ago, have left it on  - with Bluetooth enabled - and made several calls and the battery shows 75% full. Works for me !", "Date": "November 4, 2013"}, {"Title": "T9 at its best", "Author": "John", "ReviewID": "R1PKGWME7SWOYQ", "Overall": "5.0", "Content": "An avid smartphone user for 6 years now, I bought this 301 this week to augment my Berry for those weekends and other times when I don't need the full pocket computer rolling. Battery life has been solid so far. Need to still do a full run-down test, yet the four bars keep staying on for a nice, long time. This review is a first impression.Don't let the 1990's look fool you, it's packing 3.5G (T-Mobile 4G for me) underneath this fully global, quad-band factory unlocked package. For not much more than a dual-band, I upgraded to the quad-band for some planned travel this coming year, and this should do the job quickly and happily. While it's nice to be \"unplugged\" from back home, it's a solid setup to be able to tie into web browsing and the email apps for Google, Yahoo, and Exchange built in. This won't replace your typical 4-6\" touch screen device for video consumption, however it loaded up my 32GB SD card that I use in my other device and played audio tracks within two minutes.I don't see this replacing my smartphone needs with work and such, however it has been a joy as a number two phone, ideal for those nights out when you are expecting a phone call/text and may want to hop on the web while waiting in line or whatnot. Bust out this 301 and pop onto the Xpress Browser or email your friend on their big screen pocket computer/phone and be prepared to see some shocked faces. This thing cooks. I wish that it would be sold in stores, however I'm a happy Amazon customer and this device seems to hit a nice medium between \"dumb phone\" and \"smart phone\" with sharp, near landline call quality and quick T9 typing.With the ability to quickly swap out the SIM from my Berry to this 301, I've got a fun and useful duo for the same price as compared to upgrading to popular 32 GB models of other smartphones, while using the latest iterations of some longtime players in this still, relatively new field.In sum, I'm impressed. I haven't had a Nokia since before my work BlackBerry days, yet I can tell you this, this is a great second SIM phone for those of us tethered to those devices and a solid telecommunication device, complete with up to date wireless tech baked in. If you're looking for a phone that does the talking thing with a clear voice, look no further.", "Date": "October 29, 2013"}, {"Title": "Not my E51 - But a Flawless Voice Phone!", "Author": "Andrew A. Russell", "ReviewID": "R1BE9OXH0MQZU1", "Overall": "5.0", "Content": "I just use this as an awesome pay-as-you-go \"Voice Phone\" to supplement my work-supplied smartphone with unlimited voice/internet. I just wanted something small and easy to slip in my pocket, because my old E51 can only hold about an hour charge after 5+ years.  For voice calls, it's great. And the ringer gets CRAZY Loud. I do miss ability to connect via wi-fi (because I've never tried any of the internet features)... but I'm too cheap to burn my pay-as-you-go minutes for internet. With internet/Bluetooth disabled, and only voice/text enabled  the phone seems to hold a charge for about 24 days... and I've talked as long as 11 hours on it before the bar got down to 1/3 to 1/4th power.  My phone generally just sits in a low-power sleep mode awaiting calls, so that might explain my highend battery life.  It beats the pants off of the \"Disposable\" TracPhones... and my HTC Sensation/Blackberry/Samsug Galaxy S for voice calls and ring volume. I can hear it from the other side of the house (Though I did set the electronic screeching of Skrillex \"Boomerang\" as my ring tone so it would be extremely audible!) Decent MP3 Player too. Camera is small in MegaPixel but the seamless Panoramic Patch-View mode that stitches together pictures by connecting invisible \"floating boxes\" works really well. Wish my high-end Digital Cameras did that!  I should also mention that I dropped my contracts with T-Mobile, and switched to pay-as-you-go.  I was really hesitant to do this, but on paper it saved $1000/year for my wife and I.  Now, we load about 1000 minutes every 6 months @ 100 dollars for 10 cents a minute and a 1 year expiration.  Since these are our \"backup phones\" for inbound calls and we my work phone with unlimited minutes... this works perfectly.  I couldn't ask for a better Voice Phone with a simple keypad, Camera and MP3 player. I picked this over the E52 largely because this is a new phone, and that is technology from 3 years ago which I'd have to buy from the Gray Market overseas.  I didn't figured that battery life on any new \"Prior Generation Phones\" (like the E51 or E52) would be dubious at best -- since and the battery would have been resting in a \"New Unopened\" box for so many years in a discharged state. I'm on the Internet enough at work... and I have my Work Phone for that.  As a great Voice/Text phone, the sound, volume and quality is perfect.", "Date": "February 5, 2014"}, {"Title": "Pure Phone Function", "Author": "Mogambo", "ReviewID": "RDGKQPS9IWBKQ", "Overall": "5.0", "Content": "Charged it up before going to Costa Rica. In the airport baggage area while waiting for my bags I went over to the ICE Sim card sales desk and in less than 10 minutes had purchased 200 minute prepaid Sim card for $5. The phone takes me back to the \"old\" days of cell phones ... but I have to say that the reception and speaker/mic quality was top notch. Typical Nokia quality ... Great phone at twice the price!", "Date": "December 27, 2013"}, {"Title": "A great bang for your buck as far as feature phones go", "Author": "Jessica Lares \"Likes Everything\"", "ReviewID": "R27XWRJ12R2QCB", "Overall": "5.0", "Content": "I'm using this on AT&T; around Dallas, Texas. I've been switching between GSM and 3G because one gives me more bars in certain situations. It's replacing my Nokia Lumia 520 which I have used for a few months now, but am starting to get tired of all the carriers fighting about smartphone plans and wanted to get myself out of that mess by ditching mine and going on the GoPhone feature phone plans.And I really don't regret it.The phone itself is made out of this really nice and smooth premium plastic. It feels great in the hand. The keypad lights up and is very easy to use. The directional-pad is pretty good too. I really like that the MicroSD slot is on the side and not in the back like the 520. The charging port bugs me that it's on the top, but at least I can reuse my old one and have a backup.I haven't tried the camera yet, but the software has so many point-and-shoot like features. You can also actually shoot video much easier than the 520 (I still haven't found out how to without an extra app, heh).The Series 40 operating system is great. Really, really nice and robust for dumb phone software. The built-in productivity apps aren't all that fancy, but are very valuable once you start inputting the data. The best thing that you can push things to the SD card for easy exporting. You can easily add your own .jar apps by sending it to the phone via Bluetooth. It worked instantly with my Late 2011 MacBook Pro. Sonic Advance and Block Breaker 3 are two games I've tried with it so far and they play nicely. Albite Reader works great for ePubs too, not that I plan on reading much on here, but it's good for some offline longform.I was also able to print to my Polaroid PoGo printer with it.Plugging in some headphones also gives you access to local radio. Unlike the 520, it lets you pull up the RDS, but it doesn't sound as good, even in stereo. It lets you record though.Call quality itself is very good too. I've only called AT&T; this far in, but it sounded good!Overall I'm pretty happy with it. I have a new 64GB iPod Touch I'm going to use alongside it, so I'm not going to miss too much.", "Date": "January 12, 2014"}, {"Title": "Great phone for five days", "Author": "Lawrence Brogan", "ReviewID": "R2ZUOT2P3CVHOZ", "Overall": "1.0", "Content": "It was a great phone while it lasted. The phone worked well, it was very high quality for a feature phone, and had plenty of apps that made it border on the realm of a semi-smart phone.However, five days into using it, I was notified that there was a system software update. It warned about using a high amount of bandwidth (1MB update), and recommended that the battery was over halfway charged. I made sure everything was fine and good to go. After the phone rebooted, a progressbar came on, finished, and then NOTHING. The phone doesn't turn on anymore, it gets recognized by my computers for about three seconds before it can't be detected (in a ROM mode no less), and even when it gets detected, all of Nokia's recovery programs fail to work.Overall it was a great phone for five days. I would have loved it had the thing been able to update properly. One more thing: You can't even update it via USB, the only way to update the phone is OTA (Over The Air). That seems like a serious issue.", "Date": "April 2, 2014"}, {"Title": "Excellent basic phone for USA and Rest of the world", "Author": "Midhun Mathew", "ReviewID": "RZZVIJIF6GT84", "Overall": "5.0", "Content": "This phone has 3g and basic email setup. It will work with ATT (including 3g and mms).Best part is you can take it to anywhere in the world and it will work fine. Especially INDIA.Battery life is excellent. It has facebook, whatsapp etc. I have an Iphone 5 and the main reason for getting this phone was for international travel and battery life (backup phone)Also this is not the dual sim phone version. But it has a micro SD card reader.Comes with US charger, a basic headphone with mic and all the manuals.", "Date": "February 10, 2014"}, {"Title": "Durable, easy to use", "Author": "Tripp", "ReviewID": "R3L45YS5K992VN", "Overall": "4.0", "Content": "It does what it's supposed to do very well. It's very durable too I dropped it from about 7 feet in the air and it bounced another couple feet off the ground and it had no scratches afterwards and it still works fine.", "Date": "November 26, 2013"}, {"Title": "Very fast, non-touch, good music", "Author": "Igor", "ReviewID": "R256NCUTOH9HP8", "Overall": "4.0", "Content": "Overall it is very good phone and most of it's good comes from absense of touch technology which is sux.UI response is very fast, you don't have to wait while media player is opening or smth else.I don't use mobile internet (never used) so I know nothing about how it works with this phone.Body is very good made - no gaps or smth like this.It is heavier then it looks but it's advantage for me.I managed to connect it to Nokia PC Suite (not Nokia Suite) to copy new music, but I found thatjust copying mp3 with tags to corresponding folders on Micro SD card is faster and easier.I use free mp3tag app to set tags to multiple mp3 files at once.Media player supports playlists, albums, artists, genres.Photo size is 1536x2048.Pros:Fast, non-touch, very good look and feel.Missed, received and dialed numbers are in one list which shows up when you press Send button.Music sound (with good earphones) is very, very good - it is louder than on my previousNokia 5800XM which is music-oriented, so to speak.Supports A2DP bluetooth profile, so I use it in the car w/o problems so far.Photo camera is very good too - self portrate, panorama, smth else which I'm not going to use.Simple photo editor.Photo gallery supports timeline mode - see photos specific to this date, press right and left to go to next/prev date.Video recording.Simulated calls - if you really need it.Feature to record current call.Can customize any function to right/left or 4 middle buttons.Can customize where to display contacts from - SIM, phone or both.Timed profiles (but Flight profile cannot be timed).Cons:Ringer is not so loud as it could be - can miss a call in noisy environment.Vibro is not very strong.Battery lasts for ~4 days (with very moderate usage of music player) which is not as much as I expected.No way to remove not needed apps and games like Facebook, Twitter etc.When turned on 1st time it tries to send some text message to Nokia -I've text messages blocked so I got notification about unsuccessfull attempt to send it.Screen is very scratchable, buy a screen protector.Wish it have a flashlight)).Advice: turn of 3G in menu if you are not using Internet - battery should last longer.", "Date": "April 8, 2014"}, {"Title": "Nice feature phone", "Author": "Hai H. Phan \"hphan\"", "ReviewID": "R2H5A794R7EHOZ", "Overall": "4.0", "Content": "I downgraded because the smart phone is such a hog of time.  This fits the bill, works well so far in the US with T-mobile, and looks slick.  The menus and organization is all over the place, probably because I'm used to smart phone, so it takes some familiarizing.  But I no longer check mail, find direction, check traffic, etc. while driving, so peaceful!", "Date": "March 25, 2014"}, {"Title": "Great Phone, but AT&T; is charging me Smart Phone rates to use it.", "Author": "Teo", "ReviewID": "R1N98REB372JXA", "Overall": "5.0", "Content": "I really love this phone. It's got better reception than my iPhone 4, and sounds better as well. Way less dropped calls. I travel a lot, and gauged that over the span of a 240 mile round trip I used to get cut off at about 12 different spots with my iPhone 4, whereas this phone only drops calls at 2 spots, and that's occasionally. More often the call just gets distorted until I pick up a new tower.The interface is nothing to get excited about, but the small form factor is great. Very light, yet durable. I fits in the coin pocket of my favorite jeans. The ability to access the micro SD without opening the phone is nice.I recently bought a Samsung Rugged II to replace this while I duke it out with AT&T; whether this phone is \"smart\" of not, and feel like I am poised to lose the battle. I will bad sad if so, because the Samsung can't hold a candle to this.AT&T; is telling me their network identifies my phone as an Acer Laptop, and the their is nothing they can do about it, since it is not one of their phones.", "Date": "March 18, 2014"}, {"Title": "Very nice basic feature phone", "Author": "Sam Fam", "ReviewID": "R31WBNCEZ6T5EB", "Overall": "5.0", "Content": "I had to replace my 10 year old Nokia flip phone. I love Nokia and this little phone is perfect. It is not a smartphone, but I did not want to have to pay hefty monthly fees for a smartphone. Connection to the internet on At&T;'s Pay as you Go plan would require a $60 a month data plan. With this phone, I pay $25 every three months and I can access the internet as well. Since I don't use it often, it's just perfect for me.", "Date": "March 15, 2014"}, {"Title": "Love it.", "Author": "Cristi", "ReviewID": "R5UQBPJDFUJ2", "Overall": "5.0", "Content": "For what I need, is a very good phone. The battery last around a week, with a 3-4 hours talking, around 15 text messages, alarm clock every day. It feels good in hand (pretty heavy, not cheap, even though is a cheap plastic).I don't listen music, I don't play games, I don't surf the net with the phone. I just needed a phone that makes phone calls, has a good sound, good volume, can receive and send text messages. This is all I need from a phone. For the rest I have tablet and computer.What I don't like is that missing calls and messages reminder is not a feature of this phone.", "Date": "January 20, 2014"}, {"Title": "One of my favorites.", "Author": "Porunga", "ReviewID": "RW89CTU968KKE", "Overall": "5.0", "Content": "I love this phone, plain and simple.I actually thought about buying ANOTHER one just in case anything happened to the one I have now.My only complaint was that it didnt support official 4G but I mean what can you expect.Other than that, this phone definitely deserves a 5 out of 5.", "Date": "June 6, 2014"}, {"Title": "great", "Author": "Yedeling P. Danvide", "ReviewID": "R3V9ZD0EIV6WCB", "Overall": "4.0", "Content": "Phone was really unlocked and works perfectly. The sound evrything was designed to place quality calls. I will buy it again if i have to", "Date": "May 9, 2014"}, {"Title": "Not Great For Europeans", "Author": "Valerie", "ReviewID": "R369BIW17OQOIQ", "Overall": "3.0", "Content": "My husband tells me it's a fine Nokia cell phone, but because he's Italian and uses it primarily in Italy, he finds some difficulty with no italian language selection.", "Date": "May 5, 2014"}, {"Title": "It is good but not the best phone.", "Author": "Budhi Rai", "ReviewID": "R8H6KPQU6HMZH", "Overall": "4.0", "Content": "I rated only 4 stars because it's camera and loud speaker needs to be corrected/reformed.It is good but not the best product.I recommend to get to those who want to use basic phones.", "Date": "April 29, 2014"}, {"Title": "Excellent basic phone", "Author": "Christopher T.", "ReviewID": "R3DHT84L35LD3U", "Overall": "5.0", "Content": "I love my basic phone, nothing like a simple phone used to make calls and text. Battery life is amazing compared to my smartphone and I'm saving a ton of money each month by getting rid of the smartphone.", "Date": "April 8, 2014"}, {"Title": "Old-fashioned bliss", "Author": "Val Ivanov", "ReviewID": "R38I87V4W49YOF", "Overall": "4.0", "Content": "I would have been happier if this phone was a dual SIM model as, is available and advertised for 301.2 unlocked quad-band world phones.  A USB cable would also have enhanced the rating.  I am otherwise satisfied and happy with the phone.  It is lovely to find an \"old school\" phone that features such a high standard of functionality and quality.", "Date": "April 6, 2014"}, {"Title": "Great phone.", "Author": "Brandee N Williams", "ReviewID": "RWJ78UYRGZ366", "Overall": "5.0", "Content": "Popped in SIM card and it started working immediately.  Next test will be Australia.  So far it's been a great, easy to use phone.", "Date": "March 4, 2014"}, {"Title": "i didn't want a smartphone", "Author": "L T", "ReviewID": "R4I5AESH1AI6W", "Overall": "4.0", "Content": "hey this phone is awesome if you don't want a huge touch screen 2-hour battery-lasting phone that falls and breaks!for Nokia oldschool phone fans, this is it! however, don't assume the battery life lasts like the old Nokia1100 and all.. but still, lasts way longer than the new smartphones' batteries! bye", "Date": "December 30, 2013"}, {"Title": "feedback", "Author": "pvchan \"pvchan\"", "ReviewID": "R2FCQSZQX1GW2R", "Overall": "4.0", "Content": "for me it works well for my purposes.  I just need a phone to place and receive calls and messages if I cannot answer.  I had wanted the Nokia 500 series as it has a dual sim card slot - but that series is not available for the US market as yet...thanks.", "Date": "December 3, 2013"}, {"Title": "Simple and advanced", "Author": "gimpy9195", "ReviewID": "R1XFY1MRDW1ZFM", "Overall": "4.0", "Content": "Came from an iPhone 5 to this phone in a long story. Like this little thing a lot. I'm not glued to it like an iPhone but if I get really bored and can still get on Facebook and Twitter. Once you get all your shortcuts set up the phone is golden. Even dropped it just today... :) in Nokia fashion is survived and the asphalt was destroyed. Not a statch... Love it!", "Date": "March 13, 2014"}, {"Title": "A Great Simple Mobile Phone", "Author": "M. Caruso", "ReviewID": "R14FVN0UWPZBKI", "Overall": "5.0", "Content": "I love this phone! My previous phone was Nokia 5310 and I got this one as an upgrade recently because the buttons had cracked on my old phone. I like that this is a simple phone (not a \"smart\" phone, has no touch screen, menus are easy to navigate) but has all the features I need in a phone. The battery life is pretty good. I don't make many calls or send many texts and I get about 3 days of battery life before I need to recharge it. It was very easy for me to set this up with my contacts and plug into my (Windows) computer to install custom wallpapers and (MP3) ringtones. The camera is decent, seems to take better photos than my old phone did and the camera has more settings than the camera on the 5310 did. I have T-Mobile service and it was very easy to simply switch my SIM card to this phone from my old one. The USB cable from my old phone worked perfectly with this one to connect it to my computer and drag/drop files and photos onto this phone. The Nokia 301 did not come with a USB cable. This phone has the ability to check emails and such but I never use that feature (I don't have the upgraded phone service) so I can't comment on how quickly it allows you to accomplish those tasks. My only real complaint about this phone is that it does not have full-screen photocall (like my old Nokia phone did) and it doesn't let me view photos as organized by folder from the mini SD card (just views them as if they were all in one huge folder). Other than that, it's a great, simple mobile phone for those that are not really very tech-savvy. It seems to be made well and I'm confident that it will last longer than my old phone did. It is slightly larger than the Nokia 5310 and the buttons are bigger and more sturdy so they won't crack from texting a lot (like the 5310's buttons). I easily found a nice protective gel cover and clear screen protector film/cover for it on eBay.", "Date": "January 27, 2014"}, {"Title": "Not as adverstised", "Author": "Mark T.", "ReviewID": "R9CQF2Z1CR54", "Overall": "1.0", "Content": "Bought this phone to use in France. Upon arriving in France I found it was not unlocked and unusable in France.", "Date": "May 12, 2014"}, {"Title": "awesome", "Author": "lion", "ReviewID": "R20GGRN5DXO97A", "Overall": "5.0", "Content": "I just love this phone. It works well, battery good. Sent it to Nigeria and its working well there. i always love Nokia products", "Date": "March 20, 2014"}, {"Title": "its great", "Author": "Wayne Pengelly", "ReviewID": "R3330TSE2ZAWBK", "Overall": "5.0", "Content": "i waited a long time to find one of these ,,now i'm wrapt that i found one ,, its great !!", "Date": "February 28, 2014"}, {"Title": "Thought this might be a good basic phone...", "Author": "100 Watt Walrus", "ReviewID": "R1MH2VQKUM91UI", "Overall": "3.0", "Content": "Thought this might be a good basic phone, but it definitely has its shortcomings. The construction is good, but I got a better signal on my 6-year-old Nokia 5310, and it couldn't read the music and photos on my SIM card, only the address book. Wish I could have liked it more.", "Date": "January 24, 2014"}, {"Title": "Do not recommend this phone if you really need a simple one.", "Author": "Exid", "ReviewID": "R21HSK6AKXNPMQ", "Overall": "3.0", "Content": "This phone is small, quad band, it is nice to look at but has many limitations:1.  Very low volume, both on the small speaker and on the speakerphone.2.  Poor RF sensitivity in low signal areas.3. Complicated menu- this is supposed to be SIMPLE phone, but stupidity of Nokia programmers is unlimited.  There is almost no action that doesn't require at least 3-4 button clicks...", "Date": "November 8, 2013"}, {"Title": "Do not buy", "Author": "Andrew Atlas", "ReviewID": "R3B4JBBICYLEWY", "Overall": "1.0", "Content": "Does not do what all earlier nokia models do. Terrible battery life. Poor reception.  Terrible call quality, speakerphone unusable.  Heavy and surprisingly large. Had to go back to my C2.", "Date": "June 5, 2014"}], "ProductInfo": {"Price": "$149.99", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 1900 Mhz", "Name": "NOKIA 301.2 FACTORY UNLOCKED QUADBAND 3G 850/1900 WORLD PHONE - BLACK", "ImgURL": "http://ecx.images-amazon.com/images/I/41AS3aA44eL._SY300_.jpg", "ProductID": "B00DRQ9500"}}