{"Reviews": [{"Title": "IT CRASHES AFTER 2 WEEKS", "Author": "Verna Winarni", "ReviewID": "R1LIHWOOEWRQ3Y", "Overall": "1.0", "Content": "Was just playing this game called Cavemania which I've played so many times before on my S3 (had no problems) and then suddenly the phone just crash, and when I try to turn it back on all I see is the SAMSUNG words and nothing else. Wont change to home screen.I have tried countless times to get the screen up, nothing works.Rebooting and Wiping all data now to see if it works.WHYYY????", "Date": "March 13, 2014"}, {"Title": "Good Stuff", "Author": "Abraham", "ReviewID": "R1FVAKQBR6AHGK", "Overall": "5.0", "Content": "great stuff, highly recommended, good value for money, I've saved more than $240.00 and doubled the memory from 16GB to 32GB.", "Date": "April 2, 2014"}, {"Title": "Excellent", "Author": "Jesus Garcia", "ReviewID": "R27V1Z4DH9P5V8", "Overall": "5.0", "Content": "This is a really excellent phone to have. I love it. I recommended. It has a really nice resolution and really cool features.Thank you.J.Garcia", "Date": "December 18, 2013"}, {"Title": "counterfeit Galaxy S4 I9500", "Author": "Robyn A. Barnes", "ReviewID": "R12MG6OXBIRZC7", "Overall": "1.0", "Content": "Please be VERY cautious when purchasing a cell phone from this seller. I purchased a cell phone from him and had problems from day 1!!! I kept taking it to a large chain electric stores Samsung reps trying to get help with my Galaxy S4 I9500. By sheer luck I happened to go in and was able to speak to and expert Samsung rep who had just gotten back from the Samsung training seminar whereg he was taught how to spot counterfeit Samsung phones. Upon seeing my S4 his immediate response was, \" You have a counterfeit S4 on your hands\" and showed me the Samsung website video on how to check for counterfeits. I had every one of the 'red flags' they look for!!!The seller refused to refund my money, but thanks to Amazon's A to Z Guarantee, I was able to get my money back, anyway.", "Date": "October 21, 2013"}, {"Title": "Best deal for the Galaxy S4", "Author": "belkis20", "ReviewID": "R276NNO6KCEW5P", "Overall": "5.0", "Content": "this is by far the phone out there , the resolution and the smoothness is incredible, I highly recommend this phone to anyone", "Date": "September 22, 2013"}, {"Title": "discouraged", "Author": "Darwin Lee", "ReviewID": "RR6H49J0WZC1B", "Overall": "1.0", "Content": "Completely out of my expectation! The voice and ring tone are barely heard, even I already set up the voice volume to maximum, sometime the voice suddenly shut down while talking, there must be something wrong with this device, I doubt it's a fake product that bearing the brand name.Darwin LeeA Frustrated consumer", "Date": "September 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DXYWBT8"}}