{"Reviews": [{"Title": "Awesome Smart Camera Phone", "Author": "D. Goding \"Technologist with a passion for kn...", "ReviewID": "RQOGL92S4TE63", "Overall": "5.0", "Content": "Great camera that happens to be an awesome phone too. Carrying this should replace all your gadgets: smart camera, smart phone, and great music player. No longer do I worry about capturing the perfect photo with all of my friends, nor do i debate with self anymore whether to bring my camera (Cannon S90) Now, I just bring my NL 1020, no stress about missing the most epic facebook photo shot, or having the perfect shot turn up less than perfect afterview. Plus, the screen is beautiful and sharp. When I set it next to the NL 920, the NL 1020 screen is much brighter and crisper.Enough, about the camera. Windows Phone OS has came a long way. It's a great fresh OS.It's a great phone, and the perfect companion to those that never want to miss the perfect picture.", "Date": "July 29, 2013"}, {"Title": "Throw away your camera!", "Author": "digsblues", "ReviewID": "R2V78OP0NSMOYS", "Overall": "5.0", "Content": "I just upgraded to the Nokia Lumia 1020, and absolutely love it. I take lots of pics and my old Nokia wasn't that great. However, it seemed like often, I missed pictures because I didn't have my camera along.This phone is a bit bulkier (there's a bulge on the back for the newer camera), and I got a camera grip with it, which makes it even bigger. That's not a problem for me because I carry it in my purse. That might be a drawback for guys who carry a phone in their pocket because it doesn't have that slim design.The phone comes with an app, Nokia Pro Cam, which lists the settings along the edges of the viewfinder. You can tap a setting and a menu comes up at the bottom to change the settings, almost like the dials on a regular camera. It also has a half press to focus and full press to shoot button, much like a traditional camera. There is a built in lens stabilizer that is works perfectly. I've taken several hundred pictures and not a bad one in the bunch, even in less than optimal lighting.There's also a Creative Studio app for performing various trick edits. I haven't used it yet but will update when I have more experience with it.The 2,000 mAh unit easily lasted me a day of regular use, talking on the phone, checking e-mail occasionally, sending and receiving text messages, stalking FB pics, and taking pictures. So far I'm really happy with this purchase. No more missing nice shots because I left my good camera at home.Thanks for taking the time to read my review, and I hope you found it helpful in making a purchase decision.", "Date": "August 2, 2013"}, {"Title": "Incredible, absolutely amazing!!! Its pictures are UNBELIEVABLE !!!", "Author": "Ram Wats \"Ram Wat\"", "ReviewID": "R39WWRIK2NKU38", "Overall": "5.0", "Content": "Really I bought the black one, but this is such a good phone that I want everyone to know it! I have to say that I own a Lumia 928 and loved the simplicity of Windows Phone, coming from an Android device from a Galaxy that shall remain nameless. I heard about this phone and started thinking I don't need lossless zoom or any of that stuff. Then I went to the store and tried the camera. WOW was I impressed. Not only does it take better, sharper, clearer, it blows the doors off my year old digital camera with a 20x Optical Zoom! I can not say enough good things about this phone, if you love taking pictures get it don't wait just get it. I love the app selection, there is not a single app that I am missing from Android contrary to what they were telling me in the store that I went to. I have them all Instagram in the form of an awesome app called Instance, Facebook, Hulu Plus you name it most likely it is there. Again I LOVE LOVE LOVE my phone and won't trade it for anything out there.", "Date": "August 10, 2013"}, {"Title": "Great phone, but I'm not convinced it's worth the expensive price tag.", "Author": "J. Ciriello \"AdWhois\"", "ReviewID": "RYZLV3Y8OBDUC", "Overall": "5.0", "Content": "First off, let me say. This phone is amazing. It's lightning quick, never hangs on any tasks and consistently gets the best benchmark when I test it on any of the benchmarking apps available on the marketplace. Oh yea, and the camera is otherworldly, I will never need to bring my point and shoot camera with me again...Now, let's get to the review.I picked this phone up for $299 at an AT&T; store after Amazon had problems processing my order. Almost as soon as I walked out the door I had regrets (let me explain). Windows Phone 8 is amazing, it's so smooth, capable and polished; it really is the best mobile OS, that being said. If you've had a Windows Phone 7.8+ device before then WP8 on the Lumia 1020 just feels stale, not unlike any other OS at this point, the difference between the 1020 and the other devices is the price tag. $299 is just too expensive for me to recommend this phone to people who already have a high-end WP 7.8 or WP 8 device, aside from the camera there really is nothing different...Windows Phone 8 PerformanceAll that being said, if you don't currently have a WP 7.8 or WP 8 device, by all means go for the 1020, it's a wonderful device and Windows Phone 8 will make you smile at every turn, the Lumia 1020 has a whopping 2GB of ram, easily 4 times more than the ultra-efficient Windows Phone 8 needs to operate, this means that there really isn't any task the 1020 can't handle, and background tasks won't weigh you down. Like the 920, 928, and 925, the Lumia 1020 has a 1500mhz Dual Core processor which is more than enough to run Windows Phone 8, you won't get the satisfaction of saying \"I've got a quad-core\" like some of the android phone owners, but when they go head to head I have no doubt in my mind the 1020 will be faster than any android device you pit it against. The beauty lies in the software; Windows Phone is slim and professional, while most Android offerings are bloated and laggy...Build QualityThe build construction of my Lumia 1020 is exactly what you'd expect from a high-end Nokia device, top of the line, solid construction. Although my 1020 will wear a protective case for its entire life I have little doubt that this phone could withstand a few unprotected drops and suffer only a few scratches on the case, Gorilla Glass 3 gives you that added piece of mind that your screen isn't going to crack after one drop.Pictures/Videos\"Second to none\" is the phrase I would use to describe the Lumia 1020's camera. Nothing else even comes close (including my Sony Cyber shot), night time pictures without a flash, though still worse than what your eyes can see (obviously) are the best I've seen on any phone, or point-and-shoot camera. If you somehow have a tripod for this phone you can have it leave the shutter open for up to 4 seconds, giving you extremely bright night time pictures (and blurry if your subject is moving). The delayed shutter function does allow you to set the phone down after telling it to take a picture so you can minimize movement while taking a night time picture.Video on the Lumia 1020 is spectacular as well, smooth HD capture and clear audio recording are high points of any phone, and like the 928, the Lumia 1020 dons multiple microphones to make audio recording in hectic environments possible.On top of the physical pleasantries of the 1020's camera, there are a plethora of apps that make use of the camera. My favorites so far are Photosynth (lets you capture a spherical image around you) and Fresh Paint (think \"Take on Me\"). Instagram or not, there is certainly no shortage of cool apps you can use with the 1020's awesome camera.Storage SpaceLike the other unibody Lumias before it, the 1020 has no way of accessing its battery compartment, and no way of adding a micro SD card. What you see is what you get (actually it's about 5GB less than what you see); with no apps installed the Lumia 1020 will have a maximum of 27 GB of free space. 3 GB lost to formatting, 2 GB lost to the OS. In a battle of fortune, the 1020s full res pictures are almost 10MB a piece, that's great because you really are getting full quality pictures but not so great because you will eat into that chunk of free space alarmingly quickly if you take a moderate amount of pictures. When you add apps, music, and videos into the mix, that free space gets even smaller. To combat this, AT&T; is offering a free upgrade to their 50gb of cloud storage through AT&T; locker (limited time offer they say), and as always SkyDrive offers 7gb of free cloud storage (I'm still on the 25gb free they gave me for being an early WP user). Even with those two free cloud storage options I long for expandable memory. If I could, I would throw in a 64 GB MicroSD and carry around tons of music and videos. Cloud storage, is not the answer to phone storage in my opinion...Battery LifeA key question people seem to ask me all the time is what kind of battery life they should expect. The Lumia 1020 is on par with any other modern smart phone out there. It has a large 2000mAh battery and lasts me an entire day using it for email, web browsing, the occasional game and of course picture taking. If you do data heavy tasks or talk on the phone a lot you can expect your phone (any phone) to run out of juice much faster. Comparing the battery life of my 1020 to my 900, I'll say that my 1.5 year old 900 still gets better battery life than the 1020, but I hear that Xenon flashes use a lot of juice.PriceLike I said, the Lumia 1020 is expensive, currently ranging from $266 on Amazon to $299 at the AT&T; store. The Microsoft Store also sells the Lumia 1020 for $299 but includes the camera grip free of charge. I mean, sure it's a free grip, but I can't see anyone using it on a daily basis or ever taking it with them, it's huge...The only way I have been able to justify spending $299 on the Lumia 1020 coming off the Lumia 900 is by realizing that this will replace my point-and-shoot camera, so if you think of it as paying $150 for a good camera and $150 for a great phone it feels a little better.IssuesI have to disclose the fact that I am on my second Lumia 1020. The first handset I got was plagued with a few issues. The phone had reception issues and would drop calls when I was standing still in places my Lumia 900 had full LTE coverage and call quality was genuinely poor, on top of the signal problems that first 1020 had issues where Bluetooth would disconnect every 5 minutes or so. My phone says it has the Amber update which is supposed to mean BT 4.0, so I originally chalked the BT problems up to that, but my new handset has none of these problems (and does have the Amber update). AT&T; swapped out both the handset and my SIM card to cover all the bases on the reception issues. My new handset has yet to drop a call and seems to get a much more solid connection; call quality is still nothing ground-breaking however.There are a couple minor issues that both my handsets share.The first issue is that when looking at the phone in a completely dark room with brightness on auto, I noticed what appear to be streaks or irregularities in the black back ground of the screen. Both 1020 handsets had this problem and although you can't see them with any external light on, or the brightness turned up, it makes me wonder what those irregularities are, and if they will be a problem further down the road.The other issue that both handsets I've had share, is that the loud speaker on the phone is quiet, disappointingly quiet. There is really no comparison between the 1020 and the Lumia 900 when it comes to loudness of the speaker, the 900 takes the cake...ConclusionThe Nokia Lumia 1020 is a great phone, easily worth 5 stars. If you don't currently have a Windows Phone 8 or 7.8 device and you want to take amazing pictures, by all means go out and get this phone. It will be 100% worth its expensive price tag. However; if you do have a Windows Phone 8 or 7.8 Lumia I would seriously think about how much you value picture/video taking. Aside from the camera the only measurable difference between this device and even my Lumia 900 are the few WP8 exclusive apps and .2 inches of diagonal screen width. I haven't noticed any real improvement in performance over my 900. If you currently have the Lumia 920, the ONLY differences between it and the 1020 are the camera, and the fact that the 1020 doesn't have built in wireless charging, it really wouldn't be worth upgrading from the 920 to the 1020 unless you are a true camera nut in my opinion.Perhaps what the Lumia 1020 has shown me most so far, is just how amazing my Lumia 900 was/is; dated camera aside, that 900 can still go toe to toe with the 920 or 1020 on most tasks with ease. In addition to the best cellphone camera ever, the 1020 does offer something the Lumia 900 never will, future proofing.", "Date": "August 14, 2013"}, {"Title": "best phone ever", "Author": "dawu", "ReviewID": "R2I9APU8CNK4WE", "Overall": "5.0", "Content": "Great cameraGreat batteryGreat receptionBest phone I have ever had periodLove Windows Phone 8  OS so smooth and intuitive", "Date": "August 21, 2013"}, {"Title": "I really like this phone.", "Author": "J. Henderson", "ReviewID": "R3MR9AO2X936ZT", "Overall": "3.0", "Content": "I'll confess...Im a bit of a Nokia fan.  Ive had several of their phones b/c of the awesome cameras but couldn't stomach Symbian any longer.Enter the Lumia 1020.  I'm not homer enough to say this is the best phone ever.  Its the best camera on a phone ever, but there are some flaws...Coming from an iPhone, the OS takes a little to get used to.  Its definitely not as fluid or intuitive but its not bad.  It does do some very cool stuff as well that iOS doesn't. The Facebook integration into the contact list is awesome. Likewise with pictures, email, etc.  My only real complaint so far is the voice recognition is just terrible compared to Siri.  I used the talk-to-text feature a LOT on my iPhone for web searches, email dictation, and SMS.  The keyboard and autocorrect are mediocre.However, I was so incredibly bored with iOS I'm not upset about my upgrade at all.  The hardware is superior, the phone just looks awesome and has a great feel.  I don't need to talk about the camera.  If you're reading this you get it already.The phone is definitely an attention getter...I have it in white which looks awesome.The lack of apps is not a big deal to me as I'm not an Instagram/Twitter/whatever kinda guy.  I've only found a few things missing that I was looking for in their app store.  Additionally I have an iPad that I do all of my playing on.  My phone is for business and pictures.  Thats it and Im very happy with it.************UPDATE************Now that I've had this phone/camera for a while, I thought Id come back and update my review.  I have removed 1 Star.The white balance issues on this phone are unacceptable.  In any sort of mixed lighting environment, the camera performs poorly.  Its well documented on the web, and I thought that I could over come many of the issues by adjusting white balance before shooting.  It doesn't always work.  It game me some great photos at a trip to Disney the other day, but even some of the outdoor shade shots had subpar white balance performance. I'm hoping a firmware update will correct this as there are still many things I like about the phone.  If Nokia/Microsoft doesn't fix this, back to Apple for me and I won't be buying another Nokia/MS phone.", "Date": "September 7, 2013"}, {"Title": "Best phone I've ever owned.", "Author": "RaiderLALaker", "ReviewID": "R1JC8YTYAV90OC", "Overall": "5.0", "Content": "Let me just preface this by saying I've worked in IT for the past 20 years in many different positions. Everything from desktop support to technical manager. I've been a Windows Phone user from day 1. Before that I was a Windows Mobile user. This is my 4th Windows phone, Samsung Focus, HTC Titan, Lumia 900 and now Lumia 1020. I have also had a Galaxy S3 and my sons own Galaxy S4s. This is by far the best phone I have had. I don't want to get into a platform war between Android and Windows Phone. I get enough of that at work and home! I enjoy the Windows Phone platform immensely. It's minimalistic, fast, secure and modern. It does everything I want a communication device to do and more in an elegant and sophisticated manner. Nokia has done a fantastic job with Windows phone. Admittedly, I didn't care much for the NL900. I mostly carried my Titan. The NL1020, however, is another story. The phone is deceivingly light. It fits comfortably in the hand and pocket due to the smooth, curved edges. The front of the phone is practically all glass. It is not all screen, however. The glass is also gracefully curved at the edges. The shell is polycarbonate. I purchased the 1020 in white. It's a matte finish that feels fantastic. Some have said the matte finish is slippery. I wouldn't say it's slippery, but it's not tacky either. It is very smooth, but there is no way I would consider it slippery. The camera hump does not bother me in the least. I don't even notice it's there when I'm holding it. There are a couple of small annoying things about the shape and camera hump. First, the phone doesn't lie flat. At first i thought this wasn't an issue. However, all throughout the day the phone lies on my desk. Flicking the screen up to unlock it. swiping from side to side, scrolling web pages or responding to texts while the phone is on its back can be frustrating at times. It wobbles and moves around when performing those gestures. I almost always end up picking the phone up to do these tasks. Next, that aluminum disk gets amazingly hot! When I first got the phone, I thought something was wrong with it. Also, I can't really tell what makes it hot. Sometimes it gets hot while charging and sometimes it doesn't. Sometimes it gets hot while charging and being used and sometimes it doesn't. Sometimes it gets hot for no apparent reason. However, I have noticed that this happened much more frequently when I first got the phone. It now happens rarely. The best thing about this phone has to be that fantastic camera. It won't replace your DSLR camera but it most defiantly can replace your point and shoot and beats any current smart phone camera by a wide margin. If for no other reason than its innovation and versatility. Some phone cameras may be able to take some pictures just as well as the 1020, the GS4 camera is very good. However, none can match the picture quality of this camera in so many different situations. Zoom, macro, low light, motion, video. The others usually fall short in several of these categories. As you can imagine, I am often challenged to a photo contest. Whether it's my sons and there GS3s and 4s or co-workers with iPhones and various Androids. I seldom lose and it's not because I'm a great photographer! And, to the credit of my sons and co-workers, they have, for the most part been completely in awe of the photos and videos. I have already made 1 Android and 2 iPhone converts. I went away on vacation for 2 weeks and when I returned they all 3 had their shiny, new NL1020s. I've taken hundreds of summer family outing pictures and videos, vacation pictures and videos and, my new favorite, insect photos with this phone. All look fantastic. Especially the insect photos. The camera allows me to take the picture from a distance and then zoom in AFTER the picture is taken. I have been able to get beautiful pictures of bugs that would usually have flown away if I got too close. After about a month, I still keep learning more about the camera and how to take better pictures. This camera invites experimenting and exploring. Like the old saying, the best camera is the one you have with you at the time. I now have a pretty darn good camera with me all the time.", "Date": "September 3, 2013"}, {"Title": "Wife loves the switch from Iphone 4s to Lumia 1020", "Author": "333watch3r", "ReviewID": "R13763QCOC7X5C", "Overall": "5.0", "Content": "Just wanted to share that after 2 years with her iphone 4s, wife made a switch to Lumia 1020 and so far she is happy with the phone. I have compared images from Lumia 920, 810 and iPhone 4s, Lumia 1020 is definitely the way to go. I own a canon 7D and have 4 lenses with me when we travel, but with 2 kids; the extra convenience of having an easy to get camera helps. Also I have the GoPro Hero 3. So for most of the family oriented trips, I will probably be just have my goPro and borrow her 1020. However for serious photography I will still bring my Canon 7D.One of the features I like (on my Lumia 810) that she also likes is the screen saver images from the Facebook albums. So its always alive and reminds you of old images stored in facebook album. The app easily refreshes the mind of happy moments. I believe iPhone might have the same features but we didn't have time to experiment.Also if your state have a Microsoft store, they offer FREE camera grip (worth $75), while the Local AT&T; store did not have such offer. We also got $10 credit on Microsoft store to buy apps. If you plan to trade an iphone bring the charger and get an additional $10 credit.  I am also looking forward to buy the wireless charger and the back plate when there is a white backplate. The headphone is not included in the purchase and at the $100 price I don't think I will buy that.Call wise, I believe the reception on LUmia is cleaner, I remember getting frustrated having to hear poor voice quality with her old phone.As for the apps, I think its just a matter of finding the right comparable apps. Some Apps she misses is Pocket Gallery, Mint and CW app. Hopefully the first two will be available soon.", "Date": "August 6, 2013"}, {"Title": "Hook. Line. Sinker.", "Author": "Sen", "ReviewID": "R3HEE7NKRMZZR5", "Overall": "5.0", "Content": "cked up the phone today replacing my already awesome (and still on contract) Lumia 920. It was unintentional purchase. Emotional purchase. A must have now purchase. Yeah one of those...What got me? I went into the store and played with the camera (obviously), taking multiple shots and videos. Comparing both side by side to my 920. WOW. What do they call that? Lossless zoom for both pictures and video. Color saturation that is so rich and balanced. Details that boggle the mind. I'm done. Take my money. Next customer.Now I wait for Microsoft to step up to the plate and deliver on WP8.1. Soon right, Microsoft!?", "Date": "August 7, 2013"}, {"Title": "Unparalled camera on a very good phone", "Author": "Peej", "ReviewID": "RY5VFZITP9FQJ", "Overall": "5.0", "Content": "After using iOS, Android, BlackBerry, and other mobile operating systems, and reading about Windows Phone I was looking forward to trying it. So far it's been great, including lots of good apps. The phone is very well built and fun to use. The camera is breathtaking, and I regularly get positive comments from others when I share photos I've taken.", "Date": "October 2, 2013"}, {"Title": "Bye Bye Iphone..Welcome Lumia 1020", "Author": "K. Kanaujia", "ReviewID": "R1K21APCKL4SB7", "Overall": "5.0", "Content": "Would not post a long review..for detailed analysis you can see experts reviews everywhere on the web...just google..My Review:After using Lumia 1020....it made me feel the Iphone 5 was very mediocre device that i used earlier...Now with Lumia 1020 it felt a clear evolution to an ultimate smartphone experience that cannot be described in words... who says windows is missing apps..i got all the apps I needed and they felt more faster and smoother...the camera is huge...just go for it...its worth the every dollar...", "Date": "August 16, 2013"}, {"Title": "Great phone with minor flaw.", "Author": "Santosh Geddamuri Sr. \"Happysan\"", "ReviewID": "RKSWGM88NLDTN", "Overall": "5.0", "Content": "This is my 4th Lumia phone after 900 and 920 and 520. I bought 920 a developer edition for 1000 bugs but sold in 3 months as it felt heavy. I have owned all models of iphone, Htc One etc. But the beauty of lumia 1020 is not comparable. I bought it at full price from at&t; and got it unlocked by them.Things I love:1 Obviously Camera. The whole idea of not carrying another camera for most daily shooting was my prime motto in buying this phone. I had HTC One and iphones but they are not comparable to this phones Cam.2 Screen: Though it is smaller than HTC One, I don't miss HTC One. The white on black background is what I missed in all other phones. Emails looks so good that I got never satisfied with other phones.3 Speakers: Much Much better then HTC One. Every one praised htc one's dual speakers. But I owned it and I never felt htc one speakers were adequate. But my lumia 1020 easily overtakes htc one. Moreover the quality of sound is very very good. You can easily hear different notes in the music.3 Form factor: !020 is much smaller and lighter then lumia 920. First feel of lumia 920 was heavy and thicker then comparators. But I was still happy with it. But 1020 is an improved one. I don't think much changed except making wireless charging external and reducing the weight.4 lanyard: This may not be big thing for others, but for me it is. It is much easier to wrist strap and don't worry to slip phone. Also I keep it out of pocket and easily pull it out. All old phones used to have this but in Smartphone I don't remember any other maker used it.5 Wireless charging: Though external, but still has the wireless charging feature. So easy to charge in office. Don't need to look for cables . Just place it on the wireless charger and you have full charge when u need it.6 YouTube: I believe YouTube video downloads only available in windows phone. I couldn't found in iphone or HTC. There were workarounds but not anything native. It is so much easier to download YouTube movie and watch it in gym in just 5-10 minutes. I love this app.7 Build quality: As per nokia the body of lumia is made of plastic which is throughout one color. I mean if you make a scratch on it, you can rub or remove that layer and original color will pop out. This is unlike coloring done on iphone.8 Apps: Though there are fewer apps then ios and android, I don't miss any specific apps. I had iphone for 4 years and android for a year but still I don't miss any app. Moreover apps on lumia looks much beautiful then others. Also they are more stable then android. May be fans won't agree but it's my opinion. Even I was fan of iphone until steve's demise. After Steve there is no innovation at all.9 Interface: Windows interface is so simple and easy to learn. OLED screen really makes difference. White fonts on black screen really pops out.10 Battery: If you are careful, you can easily get whole day battery life. If you want more then you can turn on battery saver. Battery saver easily doubles battery life. On my lumia 520 it runs almost 5-6 days. However I rarely use lumia 520. but still being 4g LTE, I expect it o run down within 3 days.11 Call quality is good.Things I hate:1 Though phone by itself not heavy, but adding external wireless cover make sit heavy. I can still live with it, but it would have been better if we got wireless charging with same form factor.2 When online music is played through lumia speakers, I noticed that other web browsing like Microsoft store app browsing becomes very slow. I have very high speed internet and I don't think playing music will slow down other browsing. I never had this issue with other phones.3 Though it has 2 Gb ram, it felt some time its getting slow. Response is slow some times. If I close all apps by clicking back button, phone responds normal. So I guess hardware is lagging somewhere.4 Speakers: Though it is awesome for music, it is not enough for phone calls. There must be something restricting it from being loud. May be because of echo they reduced volume on calls. Volume on call could be better.5 Bluetooth profile selection is missing. I want to connect to 2 bluetooth devices same time. One for voice only and other for music only. But there is no way I can configure that in phone.Going forward I will update this review according to my experience with it. So far I whole heartedly recommend this phone despite the flaws.Update: After using for a while i found the ear piece volume is not enough for slightly noisy places. I prefer the sound to be 30% more then what it is. I believe this is definitely firmware as the speaker also produces very less volume during call and loud enough for music.", "Date": "September 27, 2013"}, {"Title": "Best phone ever", "Author": "George H. Hackett", "ReviewID": "RJ6YP8B1SR0T8", "Overall": "5.0", "Content": "If you are considering an iPhone or a Samsung, you owe yourself to check out this amazing phone first. The camera is simply amazing, but the rest of the phone is just as awesome. Simply holding it makes you feel happy.", "Date": "August 29, 2013"}, {"Title": "Switched from iPhone 4S & It lives up to expectations!", "Author": "Melissa", "ReviewID": "RGXSA9EDMXUNI", "Overall": "5.0", "Content": "I wanted this phone for the camera.  AND it really is as great as they say.  It has replaced my point & shoot camera completely.  And while it lacks the app selection (of Apple or Android) it has either a replacement app (or better) for most of what you could need or want.  Some of the apps that are available free on iTunes cost on Windows, but personally before switching I really started to discover that with the smaller storage in my iPhone & the actual use I got out of apps that it wasn't going to be a huge issue.  And it turned out I was right.  Windows 8 is really neat, love the beautiful interface, the hardware works flawlessly, battery life is about the same as that of my iPhone, but you get a lot more screen for that!  I didn't really find the weight or size a burden as some people have mentioned.  It's beautiful, I love the music player (you can copy & paste files directly to your phone-so much easier than syncing with iTunes), you can download ringtones directly to your phone.  Managing the included photo apps is confusing at first, I just suggest trying each one out and seeing which ones you like best.  The built in Drive Here app is comparable to the GPS with iPhone.  Overall I would (and have) highly recommend this phone.", "Date": "August 28, 2013"}, {"Title": "Great Phone, Incredible Camera", "Author": "Eric Wallin", "ReviewID": "R3D1TGR8CWJH3T", "Overall": "5.0", "Content": "The camera on this phone is amazing.  I've taken some low-light shots that are simply impossible to take with other phones.  The automatic mode shoots great, but I was able to take some great shots of water fountains by lowering the shutter speed in the Nokia Pro Camera app.  The Panorama app included also works seamlessly - it is so easy to make a 3 or 4 shot panorama, the app shows you where to point the camera for it to auto-stitch together.  I was at a wedding and the photographer saw me using this phone and wanted me to show it to him.  When I showed him the photos and video I took, and showed him the features he told me he was going to upgrade from his iPhone 4 to it because he wanted an amazing camera.  If that's what you are looking for, the Lumia 1020 is it.The Windows Phone 8 operating system is really easy to use too.  This probably isn't any different than other Windows Phones, but it was a welcome change from my Android experience -- everything is very simple to use.  You pin apps from your app list to the start screen if you want to access them conveniently and see their Live Tile updates.  Otherwise, you just sweep the screen to the left to see the entire app list and select to launch.Build quality of phone overall is solid.  This is my first Nokia and so far I'm delighted.  Everything fits tightly together, there are no rough edges, and the grip in the hand is very comfortable.  The camera lens does bump out from the back of the camera slightly, but it still feels good in hand.  It doesn't feel like it is going to shatter or break anything if I were to drop it -- but I really don't want to find that out.I also got the removable camera grip accessory which is a nice addition.  It gives you 50% more battery life and gives you a convenient two stage shutter button and something easy to hold on to for taking pictures easily.  The camera grip is well designed.  The phone has loop to put a strap in, and the camera grip accommodates this strap very well so that the same strap acts like it is part of the camera grip when the camera grip is attached.  The grip makes the phone a bit bulky when it's attached, but that's the point of it -- so you have something sturdy to grab on to.  I used mine at a wedding and it worked great for handing to people and telling them to \"just use the button like a regular camera\".I did buy this with the intention of using it on T-Mobile's network, however that hasn't worked out so well.  The phone does not support the radio frequencies that T-Mobile uses for their 3G and 2G service, so you either get 4G/LTE if it is available, or you are stuck with the EDGE data service, which is the slowest offered.  After paying full price for the phone, I called AT&T; to get the unlock code and they provided it.  I got a micro-SIM from T-Mobile and transferred service from my old SIM to the new SIM and the phone worked.  I had to change the MMS APN settings in order to get Picture Messaging to work properly though.  If you go with T-Mobile, their support site has a document that can tell you what the setting should be.Going forward, I am considering changing my service from T-Mobile to AT&T;'s new \"AIO\" Wireless prepaid service.  The AIO prepaid service runs on the AT&T; network, so there should be no service compromises like what you would experience with T-Mobile.  They have a plan that includes unlimited talk / text / picture messaging + 2GB 4G/LTE data for $55/month.  After you use your 2GB data, the plan goes down to 2G and 3G speeds.  They also have a plan for 7GB + unlimited everything else for $70/month.  These appear to be the best value plans out there for AT&T; configured phones.This is an amazing camera phone, I highly recommend!", "Date": "September 3, 2013"}, {"Title": "...nothin' but net", "Author": "davisbr \"davisbr\"", "ReviewID": "R3SLNP114AB74T", "Overall": "5.0", "Content": "BACKGROUND: When we moved, our new-to-us house had extremely sub-par Sprint reception (more on what Sprint offered \"too late\" later in the review). Outside the house we had 0-1 bars. Inside was worse lol.Rather than put up with another two years of having to step outside (we live in Washington state, and it's COLD in the winter lol) to have a reasonable expectation of a telephone conversation ( i.e., one that was _not_ peppered with back-and-forth soliloquies of \"Can you hear me?\" - \"Yeah. Can you hear me?\" - \"What? - I can't hear you. Are you there?\", etc., etc.), I decided I'd buy cheap smartphones from other major cellular providers (T-Mobile, ATT, and Verizon) and try them out to test what the actual signal strength and call quality was going to be, *before* committing to a new contract.\"Cheap\" in the case of TM and ATT meant purchasing Nokia Lumia 520/521 Windows Phone 8, off-contract phones ...and the winner for our new location was easily ATT (2 bars LTE to 4 bars 4G *in the basement*).Signal strength is very location dependent, so the caveat \"YMMV\" is apropos. For us, it was AT&T; by huge margin.But the *real* revelation of the test was how very, very nice the inexpensive little non-contract phones based upon Windows Phone 8 were. (I've had various \"nice\" smartphone over the years: Treo, iPhones, and Androids.) Indeed, it was obvious after less than a week on those inexpensive Lumia 520/521's that Microsoft had very much \"got it right\" with regards to WP8.There was literally nothing about Windows Phone 8 that wasn't superior to iOS and Android, as far as the phone's user interface [UI]  ...well, except apps availability. But as I use my phone primarily as a communicator, the superiority of the *phone* features negated the relative unavailability of specialty apps ...plus, there's the already realized expectation that as more people become aware of how very good WP8 is, and as the Windows Phone market matures, the specialized phone apps that are in abundance at iTunes, and Google Play, will arrive is Microsoft Land.NOTE: to you Nexus users, who bought a Nexus - like we did - as much because you'd get timely OS updates from Google upon OS release as anything else. First, if your Nexus is two hardware cycles old or so, Google ain't gonna patch your phone (or, presumably, tablet); I did not know that going in. So you're probably going to have to root your phone and go Cyanogenmod ...which isn't a bad option, as Cyanogenmod works great. But still, it was disappointing. - Here's the sweetener for you though: all Windows Phone phones from Nokia, even the cheapies, get the most recent OS version when it's released. That just seems to be what Nokia *does* lol ...with the caveat being that the vendors have some say over what particular OS features are released in their version. Even the inexpensive Lumia 520/521s were patched within a day of my activating them. Cool. Very Nexus-ish.Anyways ...since we're phone snobs, we returned the Lumia 520/521 no-contract phones after verifying connectivity, and looked for \"better\" Windows Phone 8 phones with an AT&T; two year contract purchase (about the cost of the plan: I don't really understand any hesitation to go with a two year contract, btw: there's really not much - if any - monetary advantage in paying month-to-month off-contract ...plus you get a new, subsidized, phone).LUMIA 1020 REVIEW:After about two minutes of searching (and a week of in-depth reading), it was pretty obvious that the \"hot\" WP8 hardware was [still] the Nokia Lumia 1020. Period.Disregarding the WP8 OS, if you want the best, most extraordinary camera available in a smartphone, the Lumia 1020 (which is more properly called the Nokia model 909) has - inarguably - the best camera in a smartphone that any amount of money can get you. From any manufacturer. On any phone OS. Between the hardware (semi-pro in quality and function), and the Nokia camera & photo apps ...there is nothing else that really comes close in a smartphone.In April of 2014, the Nokia Lumia 1020 still entirely deserves the sobriquet \"the best\"....in a nutshell, that's my entire review.CONCLUSION:Just buy it.You'll be happy.You will not have regrets nor smartphone camera envy (heck, you won't need to carry a point-and-shoot, most of which are probably not as good, or as feature rich, as the semi-pro level 1020 hardware anyways), even if you're a pro or amateur photographer. (Actual photographers who are traveling light for the day will want the optional hand-grip ...it adds functionality and additional battery life to the camera.)If you're a phone geek, who actually *needs* a phone \"as a phone\" and would prefer that phone-as-phone to be a superior communication device (voice, text, email), you will likely acquire a certain smugness about having \"discovered\" Windows Phone 8 before all your sadly behind-the-curve iOS and Android buddies.And you *will* have sufficient apps - including the biggies - to keep you happy. (Only if you're primarily a \"phone gamer\" - are there such beings? - should you keep looking.)RECOMMEND!THOUGHTS:In no certain order.You can pretty much disregard everyone remarking that the camera interferes with and/or adds bulk to the \"feel\" of the phone. I have no idea why almost every reviewer remarks on the \"awkwardness\" of the added thickness of the camera. Balderdash. Your hand - I have small hands, and my wife's hands are extra small - naturally assumes a curve when you hold *anything*, and the added thickness of the superb Nokia lens isn't noticeable at all when you're holding the phone for almost any purpose, including using the camera. So just disregard any caveats in reviews about the non-flat back of the phone. Pretty much, they're meaningless.Adding even a thin case (I prefer the EnGive Nokia Lumia 1020 EOS Slim Snap-on Fit Matte Quicksand Hard Cover Case Shell with Cleaning Cloth (Grey)) will rather adequately \"flatten up\" the shape.The 1020 fits in my front pants pocket just fine.If you're a normal person - and not a pro or semi-pro photographer - you don't need to be intimidated by the complexities of the camera's functions and software: it functions perfectly as a simple point-and-shoot too. So even if you're a neophyte, the pictures you get will be pretty much uniformly superb. And if you want to delve deeper into photographic minutia that fascinate camera buffs, the 1020 camera will accommodate you as no other smartphone camera can (with the possible exception of the Icon 1520 ...and even so, the 1020 has better camera hardware).Windows Phone 8 is simply a superior, better integrated OS for a smartphone. Microsoft came late to the game, but they thoroughly studied the competition, and it shows. Windows Phone 8 is a polished phone operating system. Kudos to Microsoft. (As sucky as the original release of Windows 8 OS indisputably was, the Windows Phone OS shows why they're heading in the direction they're heading.)If you're a typical 'Droid geek, the Metro (now called \"Modem\" I think) interface/tiles is more like customized widgets on 'droid ...all the cool things that you can customize Android with, are \"kind of\"  included with the WP8 UI [live] tiles (developers decide on whether tiles are \"active\" or not). Umm, but those similar features come without the additional power drain of the typical 'droid widgets.You will not find many major apps that aren't available from Windows Phone Store. Plus, Office is included in the WP8 OS, free (huge incentive).You *will* find yourself peeved that support from the secondary tier of developers (like your bank, for example) is typically sorely lacking in Windows Phone apps. Grr.You will certainly \"heart\" Nokia support. Nokia is awesome in their support of their Windows Phone phones (even the inexpensive ones). They are at the Apple level in quality support for their product. Google and Samsung should take note.It is very difficult to separate the general use functions of the Lumia 1020's non-camera hardware from the Windows Phone OS, and \"what makes what, what\" as regards hardware requirements of the OS ...really, even the inexpensive Lumia 520/521 phones functioned superbly at the OS level (the 1020 is obviously faster, but that hardware superiority shows up more \"in the margins\" from the user perspective than my experience with Android phones caused me to expect).My experience with WP8 is that all phone OS's are not alike when it comes to the processor power required to run an OS well. Window Phone 8 simply doesn't *require* the level of hardware that Android (for example) requires to perform. The dual-core processor of the 1020 was *superior* to the quad core of the Nexus in running the WP8 OS, as is obvious from the \"fluidity\" of operations (like browsing, texting, calling, and the like). The WP8 code-base seems to be much less hardware dependent if you get my drift.Battery life is *amazing* for a smartphone of this power. I used to feel lucky to get through a typical work day on my old Nexus, and that with light-to-moderate usage. With the Lumia 1020, I get through a whole day (easily) with moderate use (including maybe 2-3 hours of voice). And light use will stretch that to almost 2 days (I could never get two days with my old iPhone of a few years back). Plus, the 1020 fast-charges (using the included wall wart) in a bit less than 2 hours.AT&T; service-to-the-home so far has been ...superb (way better than Sprint at anywhere we've lived, though I've *never* had cause to complain about Sprint support). Our original family plan included \"only\" 300MB of shared data (more than enough for us, as in a typical month, my wife and I use less the 150 megs combined). But on a whim I checked out what current AT&T; plans were just before our first 30 day period ended, and for $10 *less* per month, I was able to change to a 2GB shared data plan. Yeah. $10 less per month. And here's the kicker: AT&T; let me *back date* that plan to the first of March??? (when my contract began). For a *credit*. Eleventy11!1. In a decade and a half of cellular contracts, that has never, ever happened to me. YMMV (of course), but somewhere at some point AT&T; seems to have upped their game in regards to customer relations. Kudos to 'em.Oh. And for basically the same plan as Sprint (the comparable ATT plan is 500MB less data per month), but with LTE and 4G speeds (Sprint's local coverage was/is improving in our city, but not at our address, so the miserable signal strength was 3G at best), we're paying $60 per month less than we did with our old provider. Yowza.Sprint did offer us an in-house cell booster for free if we stayed with them. But by then, we'd already committed to Windows Phone 8, and AT&T;, and had ordered phones.", "Date": "April 3, 2014"}, {"Title": "Best phone/operating system out there.", "Author": "Carolyn Clements", "ReviewID": "R7IGDDH7DHQKF", "Overall": "5.0", "Content": "I never thought I would choose Windows Phone over iOS and Android, but here I am, writing a review for the best phone I've ever owned. The OS is so fluid and integrated with the hardware, that if you're worried about specs not being as up to date with some other leading smartphones out there, don't be. In fact, prepare yourself for the smoothest OS out there. Never crashes, never glitches. As for the phone, the camera is AMAZING. You'll never need your point-and-shoot again! This camera, when adjusted correctly to your environment, could give a professional photographer a run for their money. The battery life is great, built-in apps like Office and the People Hub work flawlessly, call quality is just as good as every other phone, and the Windows app store is ever expanding. I'm telling you, if you're considering the Lumia 1020, buy it. You won't regret it.", "Date": "March 18, 2014"}, {"Title": "Just what I wanted", "Author": "Justo", "ReviewID": "R1L3GQ7SM3K1HQ", "Overall": "5.0", "Content": "It was exactly what I paid for and little to no haste to get it up and running with my cellular provider. Perfect working condition and the shipping was nonparallel to any other of my past experiences with other companies. Absolutely love the phone, just what I was looking for, does not take long to get used to the layout or operating system, in fact its a bit easier to get used to then other OS's. I would highly recommend this phone to anyone that is looking for a phone with an amazing camera, Microsoft Office already embedded into the phone, and just basically a fast and reliable phone, and I would HIGHLY recommend looking here on Amazon first before any other online alternative, because Amazon has yet to let me down on my expectations on a product.", "Date": "January 21, 2014"}, {"Title": "Amazing Phone, Amazing Camera", "Author": "Will_R \"Will\"", "ReviewID": "R23P1GU3FU2ED4", "Overall": "5.0", "Content": "I purchased this phone in December and I have been very pleased with the phone's performance and build quality. I was a die-hard Android fan-boy but now that I have a Windows Phone, everything seems so much simpler to use. I spend more productive time with my phone and less time \"tweaking\" the OS. I get a ton of compliments on the phone (I also purchased the Speck Cand Shell Grip Case and use an IQ Shield LIQuidSkin as my screen protector.) This phone is sharp!Here were my top three purchasing factors:Battery Life: This has been the best battery life I have ever experienced with a smart phone. I haven't had to do any special tricks like I did in Android to make it a complete day. With my Lumia 1020, I am usually around 40% before I plug it in the evenings.Screen Quality: I just started wearing glasses, so this was a deciding factor. Text is *razor* sharp and the Windows Phone OS has the ability to set saturation for color and color temperature. I am not a big fan of \"melt your eyeballs\" color pop, but I will have to say that this display has to be one of the most color-accurate displays I've experienced. Details are sharp, but colors are not overdriven. I've been able to spend hours reading on my phone without having to take a break or feeling like my eyes were been drilled out. I read a lot more on my phone because of this.Camera: The sharpness and resolution capabilities on this phone are amazing. There are different \"lenses\" (read apps) for different shooting styles, capture modes and special effects. Being able to set your depth of field really makes your photos stand out. I have yet to take a bad picture. If you want an impressive camera phone, this is the one.", "Date": "January 19, 2014"}, {"Title": "Great Phone", "Author": "Dartman", "ReviewID": "R3V6LVXME6GM5Z", "Overall": "4.0", "Content": "I enjoy this phone very much. The camera is unbelievable! Beats any other phone camera by miles! Phone is good too great call quality and texting is easy too. Only downside is not a lot of apps for phone but im sure they will be coming!", "Date": "October 16, 2013"}, {"Title": "Great camera phone!", "Author": "instantmovies \"DrVo\"", "ReviewID": "R1WGFKNZ0BG7XZ", "Overall": "5.0", "Content": "I had been a iphone user since apple been in the phone business....finally took the bold jump to a window's phone!  Love everything about it!  Biggest thing for me is the camera, windows 8 operating system, and great big screen.  I don't miss the overpriced iphone!", "Date": "October 6, 2013"}, {"Title": "Very good camera and stable OS", "Author": "mogliu", "ReviewID": "R3GHZT9F1RDWT6", "Overall": "5.0", "Content": "The camera performs very good under most circumstances, especially under low light condition. For the OS, as I've tried android and ios before, I think it's fair to say the WP system is very stable and nice to use. If you don't rely much on some of the apps WP doesn't have, then it's good to try.", "Date": "September 18, 2013"}, {"Title": "Best phone by far!!", "Author": "Jason Jackson", "ReviewID": "R12N9MQFR0QHPJ", "Overall": "5.0", "Content": "I couldn't wait to get this phone after seeing the specs and it's exceeded my expectations. I've had an iPhone for the past 4 years and was happy with it but felt like it was the same thing, nothing new, and not keeping up with all of the advances. The 1020 is light years ahead on so many levels. The camera is incredible! I have a dslr that I love to use but obviously a phone is more portable, and with kids, easier to handle. The clarity and control is amazing, even on full auto. Also has a great selection of photo editing apps that are far above anything I had on my iPhone. Besides the camera the phone itself is so smooth, easy to use, has so many great features and is just so much fun! Don't be afraid to try this phone, you won't be disappointed!!", "Date": "September 15, 2013"}, {"Title": "Fantastic", "Author": "Anon", "ReviewID": "R2ACS7JLSNSFX2", "Overall": "5.0", "Content": "I've owned this a week or two now.  I came from Windows Phone 7 to this and it was a great jump.  For me this phone is perfect.  WP8, battery life, weight, feel, everything.The camera is amazing as you probably know.  What's really fun is that when people see it out, they recognize it as the \"new phone with the crazy good camera\" and they ask you all these questions and ask you to show pictures.  I will say though that the camera seems to eat away at the battery after taking pictures.  Considering how advanced the camera is this isn't surprising or a complaint, but worth noting.The lack of cases for this phone is annoying too.  I just ordered the clear Poetic Atmosphere for it, so we'll see how that goes.My only gripe is not the phone's fault.  If you didn't know (like I didn't know and came to be a very upsetting shock), WP8 doesn't use Zune to sync between your phone and PC.  Instead you have two other alternatives which don't work nearly as well as Zune did.  Honestly how much I loved Zune was the reason I picked up Windows Phones in the first place.  But still, I can't deduct a star since Microsoft is to blame with that.", "Date": "September 10, 2013"}, {"Title": "excellent phone  excellent camera", "Author": "aarons06", "ReviewID": "REXCP7JQWGO7M", "Overall": "5.0", "Content": "Coming from a Droid, then an iPhone I was very hesitant to get a windows. Phone.. After all I hate Microsoft.  With that said I love this phone and live the camera more.  The software is great the phone is fast and I have zero complaints on the hardware.  The only issue I have is the app store.  There are quite a few apps missing but I've over looked that based on my desire to have a phone and camera that are the best quality... After all, you can always play can't crush on your iPad.", "Date": "August 31, 2013"}, {"Title": "LOVE THIS PHONE", "Author": "kykelvest", "ReviewID": "R2ROQH42BLJQ1D", "Overall": "5.0", "Content": "I have a yellow 1020, but the phone itself is just incredible.  I was an iphone user for 4 years and I don't miss it one bit.  The phone is faster, easier to use, incredible camera.  Better speakers and screen.  I would highly recommend to anyone!", "Date": "June 5, 2014"}, {"Title": "Amazing Phone", "Author": "Eric Immerman \"- ImmerTech\"", "ReviewID": "R2IT5NZYII921W", "Overall": "5.0", "Content": "This is the best phone I have ever owned.  The email interface is large and easy.  Attachments work flawlessly.  Great games are available.  I get more information from just glancing at the home screen then I do from opening 10 applications on iPhone.  Oh yeah and it has a tiny little 41mp camera.", "Date": "May 17, 2014"}, {"Title": "dont believe you could possibly get a better camera phone", "Author": "malcom", "ReviewID": "ROTAT6K4UPCYE", "Overall": "5.0", "Content": "I am used to using a palm or hp, and windows really does a nice job with this phone! Camera of course is totally awesome. And plenty of processing power plus storage is a plus!", "Date": "May 9, 2014"}, {"Title": "excellent camera phone", "Author": "Brian T Himes", "ReviewID": "R39F7JKNBNL3ND", "Overall": "5.0", "Content": "For Windows Phone, you can't go wrong with Nokia. They have poured their heart and soul into this platform and even assisted tremendously to the development of apps. Out of 4 family members, all of us have Nokia, 3 of the 4 have the 1020. All of us love our Windows Phones.", "Date": "May 3, 2014"}, {"Title": "Amazing phone, camera, and mobile ecosystem.", "Author": "Cameron Nielsen", "ReviewID": "RGIERB7NMH3YD", "Overall": "5.0", "Content": "I can't emphasize enough how much I love this phone. I got it in matte white. It looks amazing. It takes amazing photos. Windows Phone has improved about 1000% since I got my Lumia 900 2 years ago, and with 8.1 on the way it will be amazing. I also own the white camera accessory - it is so awesome to have when you know you're going for a day trip or vacation or to have in your bag in an emergency.I can't recommend this phone strongly enough.", "Date": "April 29, 2014"}, {"Title": "Love some of it !", "Author": "mes888", "ReviewID": "R1A7BW44W2ROPZ", "Overall": "3.0", "Content": "The camera is amazing on this but I used to have an iphone and it is a pain to get text from the Iphone to this phone.  Too much of a hassle.", "Date": "April 29, 2014"}, {"Title": "Bought for my daughter", "Author": "Lumia 900 case", "ReviewID": "R1RPQNDRCGRBXW", "Overall": "5.0", "Content": "She absolutely loves this phone.  It has the best camera I've seen on a smartphone; it even does better than many point and shoot cameras!", "Date": "February 21, 2014"}, {"Title": "I love my 1020", "Author": "Troy Maheu", "ReviewID": "R3JGOZLHLIYC0T", "Overall": "5.0", "Content": "I own a nokia lumia 920 and I recently bought this phone. I love the camera and the weight of this phone. It is much lighter then the 920. The camera seems like it would get in the way but the curvature of the housing actually fits comfortably in my hands. I love the windows phone os and I would gladly pick it over android or Ios. Easy to get used to and the camera is a huge bonus.", "Date": "February 4, 2014"}, {"Title": "Best photos you'll get from a phone", "Author": "Tall Gal", "ReviewID": "R18HX0UIKUKEUG", "Overall": "4.0", "Content": "Camera:I'm no camera expert, so I may be missing the finer points like \"color saturation\", etc.  However, the 1020 takes photos superior to my old iPhone.  That's why I made the switch...I found that I hardly ever took photos with my \"real\" Nikon camera anymore and most of my iPhone photos were too grainy to crop & print. I never used to get good photos of my kids under gymnasium lighting.  Those days are over and I finally have some decent photos from basketball / volleyball.OS:The operating system is easy to use, but definitely different that Apple's.  On my iPad, I hate the change from iOS6 to iOS7, so I don't miss it on my phone.  However, it is an adjustment to switch and one thing I especially miss is the timer feature.  I used it daily on my iPhone.  I downloaded an egg timer app, but I wish a timer was native to the phone's OS/clock.Syncing to your computer:Since I use Microsoft Outlook to manage my contacts and calendar, I thought surely, this would be even easier now that I'm using a Windows phone.  That is not the case, and I have to say this is the only thing I really do not like about the phone.  In the past, I  chose not to sync through iCloud - I just hooked up my iPhone to my PC and it synced effortlessly.  Apparently, with my Windows phone, I have no choice but to put my information online...NOT cool Microsoft / Nokia.  This is what keeps me from giving the phone 5 stars.  I still use my iPad Mini for contacts, calendar and email, just as I always have and I enter contacts manually on my Lumia 1020 as needed - it's crazy :o\\Home Screen:On a more positive note, I do really like the home screen and the \"Live Tiles\".  It is very easy to personalize the phone with tiles in 3 different sizes.  Down the left side of my screen, I put a small tile for each of my most frequent contacts, so I have access to them with one tap.  I created medium sized tiles right down the middle for Photos,Texting, Notes, and the Phone app...which are the things I use most.  Along the right edge of my home screen, I added a small tile for less used, but still important applications like contacts, clock, settings, and the calculator.Overall, the phone is exactly what I needed...a convenient way to take decent quality photos.  Though the need for a Windows Live account is annoying, I'm still happy I made the switch.  I don't see myself changing phones until the new Lumia 1020 is produced.", "Date": "January 20, 2014"}, {"Title": "A Great Camera with a Phone", "Author": "Dennis Azevedo", "ReviewID": "RQQOCDBPWGTC2", "Overall": "4.0", "Content": "I received this phone at the beginning of October.  So far I have been more than happy with it.  The apps are a bit lacking because it is a Windows phone and coming from an Android that is a bit of a disappointment.  I don't blame the phone for that though, that lies with Microsoft and app developers.  The real selling point for me is the camera.  I bought this so that I could replace a camcorder and digital camera.  This acts as both!  The picture quality is great and the video quality is also very good.  The ease with which it syncs with my Skydrive is a great feature that has saved me a couple of times already.  If you are looking for a great camera and good smart phone, this is a very good option.I would caution and recommend getting insurance.  Just dropped the phone the other day and broke the screen.  The only thing that really stops this from being a 5-Star phone is the lack of support from Nokia and 3rd part screen repair places.  There is only 1 repair center that Nokia works with and the cost to repair is more than the phone cost me to purchase!  With this being the top of the line phone from Nokia I was expecting the repair process to be a little more robust, but I suppose I should have been more careful when signing up with my carrier to get the insurance, as I can not do so now.Pros:-Amazing camera-Auto sync with Office and SkydriveCons:-Limited apps-Limited repair options", "Date": "December 24, 2013"}, {"Title": "from IOS to Windows Phone 8 and loving it!", "Author": "LBI Doc", "ReviewID": "R3RT2D30VVWF78", "Overall": "5.0", "Content": "I never thought I would be able to switch from the iPhone, having used each new generation from the day they launched, but I have to admit I was getting a bit bored with it, and heard all the hype about the camera on this 1020 so I thought I would give it a try. Let me say, I am glad I did. The interface is snappy, screen is bright and very nice, and the camera really is excellent, especially if you are willing to shut off auto and take some control of exposure and white balance. Will it replace a DSLR? Of course not, but I would definitely say it can replace the point and shoot many people carry around. Overall very happy with the purchase, bought a Lumia 1520 as well and now using that as my main phone and this as my backup/point and shoot for those days when I want to leave the DSLR behind.", "Date": "December 21, 2013"}, {"Title": "Great phone", "Author": "Stephanie", "ReviewID": "R324HPL4QKGWIL", "Overall": "5.0", "Content": "Great phone.  It's sturdy, takes great pictures, had decent apps, good battery life for being a smartphone, and isn't anywhere near as glitchy as the Samsung Infuse I had prior to this.  I would definitely recommend it to others.", "Date": "November 28, 2013"}, {"Title": "Best smartphone camera yet", "Author": "M. Perkins", "ReviewID": "R244RJZRRIETU9", "Overall": "5.0", "Content": "I had a Lumia 920 prior to this.  Hardware and Software wise they are practically the same, which is to say fantastic.  Windows Phone flies despite being lower speced than the latest iPhone and Android flagships.  What really sets the Lumia 1020 apart from other smart phones(including the 920) is the camera.The camera on the Lumia 1020 features Optical Image stabilization(just like the 920, and a handful of Android phones), xenon flash(unique to the 1020, other than the aging Nokia 808), mechanical shutter, and best in class 2/3\" 41 megapixel camera sensor.  This tech combines to create images that rival midrange compact cameras.  Though the 1020 is unable to compete with DSLR and high end cameras like the Sony RX100 M2(Which I also own), it bests every other smart phone camera out there.What I particularly enjoy is the \"reframing\" feature.  Due to the large image size you can take pictures and then reframe(read crop and reprocess the image into a 5 mega pixel version).  These reframed images are perfect for sharing on popular social media sites.  Trust me when I say this, this smart phone makes most compact cameras redundant.", "Date": "November 25, 2013"}, {"Title": "Great choice for MS users", "Author": "DeDub", "ReviewID": "R2YEEM1E3JUI56", "Overall": "5.0", "Content": "My laptop is Windows 8, my tablet is Windows 8, so I figured I might as well go 100% MS and try a Windows 8 Phone. The Lumia 1020 is one of those oddball offerings that isn't going to make a lot of sense, but is still a great phone, nonetheless. First, everyone talks about the camera, and it is really as good as they say. Plus, there are plenty of native apps for modifying, enhancing, etc. Regarding size and weight, it's about the same as my old iPhone 3G, so didn't feel like I was taking a step back. As for the \"camera bump\", once I put a case on the phone, the bump essentially goes away.  As an iPhone convert, there's a slight learning curve to the OS, but the \"live tile\" format is so similar to Windows 8 on my PCs that I can customize and navigate with ease. Note, you have to use some cloud-based system to sync your calendar and email between your PC and phone. For example, MS Exchange, Microsoft 365, even Google all work well. There is really no native way to sync via cable, like an iPhone. Windows app store has all of the business apps I use and about 70% of the \"fun\" apps I had on my old iPhone. Battery life is average. My only gripe is a centralized notification center, but there's talk that's coming soon. A great choice if your other computers are all MS-based.", "Date": "November 18, 2013"}, {"Title": "Nokia 1020 from an Iphone", "Author": "Stacey Dieck", "ReviewID": "R3FD6UC4LWXQH9", "Overall": "4.0", "Content": "I switched from an iPhone to the Nokia 1020..  I am having a time trying to figure it all out.  I'm a bit disappointed that the other apps that iphone and android have, are not available on windows phone yet.  I hope they catch up soon.  The camera is really great, although i am also still figuring out how all that works.  Overall, I am happy I switched and I'm sure I become more familiar with this phone, the more I will love it.  I gave 4 stars only because of the apps I miss from my iphone.", "Date": "November 11, 2013"}, {"Title": "What a great camera...Did I mention it has a phone too...", "Author": "Dingodog", "ReviewID": "R2Y34JU4NDH0RV", "Overall": "5.0", "Content": "Needed to upgrade.  This one is great.Arrived faster than I thought and was packaged in the AT&T; box.  It's been a few weeks now but still learning how to use it.  Great photos but 41 meg pics can't be downloaded to a printer.  It instead, prints out 5 meg.  Bummer.", "Date": "October 2, 2013"}, {"Title": "A great phone and a great camera", "Author": "Alan", "ReviewID": "RRUC06679WNAV", "Overall": "5.0", "Content": "I've closely evaluated many different mobile devices professionally, and the time came for me to pick a new personal phone. After doing a bunch of research, I decided on the 1020.The camera lives up to the hype, and then some. (I wish I could post links to Vimeo or Flickr here, but...)The phone itself runs the Windows Phone 8 operating system, which is picking up great new apps every day, although it's still a bit behind the other major OSes. After taking the time to set up the \"people\" and other great apps, I really like this innovative operating system, much more than I expected.", "Date": "August 10, 2013"}, {"Title": "Good Camera Phone but not a great product", "Author": "nag", "ReviewID": "R3CJLAR6EJ6XIB", "Overall": "3.0", "Content": "Firstly, Most attractive feature of this phone is the 41 MP Camera thats very cool but Nokia/Microsoft should have taken care of the battery/Hardware considering all other phones in the market. Its very frustrating if your phone drains very fast even without any application running in the background .Few Portals suggest to turn of the applications ,it doesnt make any sense  to shut all the applications, putting your device stand by and use only for Calling & Texting(still the phone drains very fast).Present generation phones are not only meant for Calling but they should perform well with all other multi media stuff (Videos, Camera, Social Networking , Web Reading or browsing etc) . Its a promising attempt to produce this high Mega Pixel (MP) Camera ,would have been worth purchasing if the Battery Life was better. Some times Trouble with the Software ,cannot make a call or answer a call. The focus was only on the 41 MP Camera instead it should have been on the whole device, Unfortunately i had to return the phone and shift to another device . As usual Amazon is best at its Customer Service ,they helped me revert back my upgrade and also refund my bucks3 rating is for the cool intuitive Camera App in 1020", "Date": "December 30, 2013"}, {"Title": "After the Windows Phone 8.1 update came out, ruined Bluetooth Voice Navigation", "Author": "Gengol", "ReviewID": "R3PPCMI8KTIT54", "Overall": "1.0", "Content": "The voice navigation of the \"Nokia Drive+\" was perfectly working through Bluetooth when the OS was still Windows Phone 8.0 but after the update Windows Phone 8.1, the voice navigation through bluetooth disappeared. The music & video audio through bluetooth is fine, what I need is the Voice Audio that is working with \"Nokia Drive+\"  navigation app that is when connected through bluetooth on my car radio disappeared after applying the Windows Phone 8.1 update. Its working fine using the audio jack on the phone but it beats the purpose of having a bluetooth radio and cellphone. I hate this 8.1 update, everything was working fine on 8.0, I wish i did NOT update this once a beautiful phone. Microsoft you ruined everything once more! THANKS FOR NOTHING!Below this line is my previous complaints and compliments ----------------------Everyone, I'm glad to announce that they actually fixed the \"yellow-tint\" pictures on the Nokia Lumia 1020 by this recently released update on AT&T; users called \"The Nokia Black Update\" release date December 19, 2013. So I tested the camera and little by little, those yellow-tinted problems have gone away so \"CHEERS\" Nokia and Microsoft, I apologies if I gave it a 1/5 star on my rating because its frustrating at first but I changed it recently thanks to that recently released black update. Now and forever I'm a Nokia fan and a Microsoft product user, I'm still testing the phone so I only gave it a 4/5 stars for now and might comeback again in a few days to test out the black update on the Lumia 1020. Who knows, I might give it a complete 5/5 star rating. Keep up the good work Microsoft and Nokia! Thanks so much.------- IGNORE MY REVIEW BELOW ----------- FOR NOWI recently have something of a problem in taking photos! All of my pictures have a yellow-tint that mixes with the white color... and in the commercials they always say its the best camera, shame on you NOKIA! I have a lot of respect before, and even bought 2 of your flagship phones, not its your fault this issue was hidden to the masses...  BEWARE, IT DESTROYS YOUR PICTURE AND MIXES YELLOW during post processing of the photo... regardless whether or not with flash or not! SHAME!", "Date": "December 10, 2013"}, {"Title": "awesome device, suspected defective or second-hand battery", "Author": "M. Ventour \"creative geek\"", "ReviewID": "R1UJMYUKVBZDCU", "Overall": "3.0", "Content": "I'll just preface this by saying that I bought this device from AT&T; off contract so I don't expect any support from them. Additionally, I had the device carrier unlocked.The device I got works perfectly. The one downside I noticed was the battery would ruin down remarkably quickly when using the camera. I thought with 41 megapixel sensors, heavy battery consumption could be expected. But address to the unusual heat produced using the camera, and the unexpected heat charging the device, as well as the quick drain led me to believe the device was not brand new as I hooked it would be. I had damaged the headphone port with one of those mini capacitive touch stylii and when I opened the device to change same, I saw that there battery was indeed not a factory original unit, and it appears that it had already been replaced.So beware when buying an off contract phone from a carrier. There's a good chance it won't be 100% brand new. You'd stand a far fairer chance buying one factory unlocked.5-stars for the Nokia Lumia 1020, 3-stars for poor carrier refurbished sales.", "Date": "May 30, 2014"}, {"Title": "NONdurable \"Gorilla\" Glass 3, VOIDED Warranty, >$158 Screen Replacement", "Author": "Leah M.", "ReviewID": "R2I6QENSQB5SWF", "Overall": "1.0", "Content": "I love the phone. I bought into how great Gorilla glass is supposed to be, so I hate how NONdurable it turned out to be--when a maybe 1 foot drop cracked mine. And the customer service was highly disappointing. If the screen cracks, expect Nokia to give you the number to a repair company that charges $158 PLUS shipping. To replace the entire screen, when only the glass is cracked. (I know nothing of repairing phones, but there is no way the small cracks in one corner are worth that much.) Even worse, I was informed that as \"physical damage,\" that crack voids whatever warranty there was!So I regret switching from my iPhone; Apple certainly had MUCH better service. When my iPhone was totally waterlogged, I got a one time FREE replacement.  Even when my popsicle mold shatters, Zoku sends me TWO new ones.", "Date": "November 19, 2013"}, {"Title": "POOR Battery Life on a Great Phone", "Author": "Amazon Customer", "ReviewID": "RNP2OTO4LG2BT", "Overall": "5.0", "Content": "*****UPDATE***  After following the advice of other reviewers, the battery issue has been resolved.  I'm convinced that the actual fix is to let the battery FULLY discharge and then let the phone charge overnight.  After doing this three times, I have great battery life.  I'm now in the process of turning back on many of the services that I disabled (save GPS only when needed), one by one, to ensure battery life suits my use.  Thanks to all who provided advice.Note:  I purchased this phone at an AT&T; store.Bottom Line:  I'm on my second phone in four days and I'll probably return this one.  Battery life kills an otherwise great phone.  The first phone was obviously defective.  I used 20% battery life in about an hour and all I did was answer two text messages.  My second phone was much better, however, it drains the battery at a rapid pace.  I tried the battery saving tips on Nokia's website with little to no improvement.  Surf the web on 4G or turn-on Wi-Fi and in I lose 5% in 15 minutes.  I went for a run, turned on GPS for tracking, and I lost 6% in 30 minutes.  Conversely, the needle barely moved on my wife's iPhone 5 on a 45 minute run while using GPS AND playing music.The Good:  Everything else.  This is my first Windows phone.  I've used Android and iPhone IOS and this operating system is my favorite.  It's simplistic and buttery smooth with no hang-ups.  Construction on this phone is very nice.  It feels solid and good in the hand.  The screen, while not as pixel dense as the Galaxy S4, is beautiful and it is remarkable in sunlight.  The camera is superior to any other I've tried on a phone.  If you are an amateur photog, you'll love it and have control over shutter speed, white balance, etc.  The external speaker is a little tinny, but I don't believe that many phones have good external speakers.  I'm sorely disappointed, as the phone in every other way is terrific.Summary: I wanted to love this phone and were it not for the battery, I would.  Why did Nokia go through all of this trouble to design a superior phone, with the best camera on the market, and then implement it with such poor battery life?  If you're okay with a good battery backup then I believe most customers will love it.", "Date": "August 6, 2013"}, {"Title": "Well", "Author": "Alexis", "ReviewID": "R1OUUF858WLK35", "Overall": "4.0", "Content": "Great device but won't work on any other network (I am talking about the close to $700.00 no contract one!!! That is insane, why does Nokia think I'll splash $700.00 on a device & still be constrained to useless AT&T;?!?!? I am at this very moment preparing a return package for it!", "Date": "August 15, 2013"}, {"Title": "windows phones are horrible", "Author": "Aquesance Averun", "ReviewID": "R25UZ2I4VIVHF4", "Overall": "2.0", "Content": "~~~~~~~~~~~14 DAYS TO USE OR RETURN~~~~~~~~~~~~~~~~~~~~~~~~~~***this is a review on my initial mistake of getting a windows PHONE, but does include my over all opinion of the phone so dont get your panties in a wad.*** Look for the stars to read only the opinion on the phone.Horrible decision on MY part. I read a review on this phone vs the iphone. It went on to state the stats accordingly and said speed and function this phone was surprisingly way better then the iphone 5s. What I didn't read about this phone was that it was a WINDOWS phone. I have had only android phones in the past, and for some stupid reason I thought this was an android phone. Boy was I wrong.Things I hate about this phone. Thought I would just download the things I always used, in the app store....WRONG!!!No SWYPE. Swype is only available on android, its a google app. No firefox...that is google as well, and this phone will only use internet explorer, ie. WINDOWS products.The app store on a windows phone is very limited. They have their own version of their own apps. And due to their monopolist attitude, they are unwilling to allow other apps to work on their products. Aka, firefox, and swype. And Im sure google feels the same way about them. So if you have any fav apps you liked on your other NON windows phone, and are thinking oh well I will just download them to my windows phone, chances are they arent going to be in the windows app store, so think again.****actual texting is nigh impossible without two hands. Trying to use one hand to hit the send button which is on the opposite side of the screen is a reach my fingers couldn't make. So texting on the go with this phone? Not likely to happen, especially without swype.***Also my favorite game Pocket Legends, is not compatible with a windows phone. Apparently the makers of the game decided the windows phone market wasnt big enough to even make a Pocket Legends app format. According to their facebook page, this is exactly what they say. Their words not mine.***You will find most of the apps you would prolly most likely want on this phone, are not compatible and their makers have no intention of making a windows phone app version, so get used to it. I heard rumors of instagram and vine maybe coming out in app version for this phone soon, but these programs are VERY old. And yet still not on the windows phone yet?! really!?++++++++COST AND SERVICE, NOT ABOUT THE PHONE++++++++++I got the phone thru At&t; option which was offered by amazon. Ironically enough this was the cheapest plan possible and amazon lets you look at other plans to compare. This plan comes with unlimited calling, texting and ONLY 1gig of data. ONLY 1 gig of data... its cost $89.99 a month. Now you might say well thats a bit much but I bet I can stretch my finances and pay it. But thats not all of it.Once your bill actually does come, you will find that AT&T; actually charges you around 15$ more dollars on what they call fees and taxes. Be there specific state cell phone fees or state imposed charges. So your actual bill after all taxes and fees will be more around $100+. What are these fees and taxes you ask?I know your thinking maybe I incurred some fees via too much data usage or some other non allowed use of my phone? Nope they are the fees and taxes that you will receive on EVERY months bill no matter what.I was on cricket before, and my bill was $59.99 a month. Now my phone sucked, but I did have unlimited text, calling, AND DATA, AND..AND!! when I got my bill, it was $59.99, no taxes no fees. Just $59.99 like I was told when I signed up for the plan. How At&T; justifies these fees and taxes being added onto your bill I don't know. But lesson learned here is, whatever ever plan you pick, just know there will be around 15$ extra added onto it after these fees and taxes.My friend also has sprint she says she pays 99$ for unlimited text, calling and data, but she has a family plan where all her phones are connected so I'm unsure of how that works. The one limitation on the phone is that although you may like your plan on your other company, these phone may not be sold by said company, so it may not be available. So thinking you may get your own plan at the old cost, may not happen or be available. So be prepared to pay more for the plan then the phone after a 2 year contract. But of course that's how the phone company makes its money, not on the phone, but on the plan.***Now is the phone fast? I believe so, though honestly I haven't had any apps I like to use work on it. Does it download things at breakneck speed, yes, but with the limited want to use my data usage. I cant really say to what extent.***Is the camera high quality and easy to use? So far the camera is fairly nice and of decent quality. The phone comes with a lot of apps built in to edit pictures, and even has a panoramic pic taking ability where it lines up pics to make a very wide viewed pic. But most of the apps are no diff then what you would find on instagram.The camera has a flash which I like.***The one thing I don't like about the camera is it sticks out of the back of the phone leaving a hump which can get caught on things, banged around on, and scratched, and the lense of the camera is on the part that sticks out of that hump. Not very practical or safe for the life of the camera imo.***The phone does hook up to wifi networks whenever available, so if you're lucky enough to be near an open wifi network, say at a starbucks, mcdonalds, etc. (almost everyone has a guest wifi) you can in theory save a lot of data usage. Now the speed onto which these wifis work though is at most of them very limited. So this is also not very practical.***I have had problems charging this phone as well. I don't know if that's because the wifi is on, and its using more energy then the phone is able to recharge or not. I did turn it off and then charge it and that was the only way I got it to recharge back to full.***The phone with wifi on with limited or little to no use, will use about half its battery life in one day. The phone comes with one charger and removable usb on the charger to interface with your computer.***It did NOT come with any hands free device or extras like removable different color casings.For the days when the phone at least came with wired hands free device for safety.***The instructions were very limited, and most instructions you will get are on the phone via internet links and help tabs and guides built into the phone, but beware some of those are links to online sites with videos and explanations, but to veiw them THEY USE DATA MINUTES!***The ring tones are very limited. The volume on the ringer, texting, and speaker phone option I thought was very low. Many times someone would call, and I would never hear it.***The phone comes with a leather string attachment used to carry the phone like a hand strap, but its very thin at points, and could easily break, so depending on it for support on holding the phone worries me. It could in all cases break or snap easily, thought Ive been lucky and that hasn't happened yet...***So far the screen has not been scratched, though I did see many covers you could buy for the phone that reminded me of an ipad type fold over case, along with stylus you could buy to use with the phone.***And to be honest, the phone is big and awkward, as I said before you cant text on it without two hands, so honestly it seems like a phone that would require a stylus to use and the screen is bigger like a ipad (but no bigger than a samsung galaxy), so you might want a flap flip over cover to protect it.I find myself always worrying if when its in my purse is something rubbing against the screen scratching it. It is by no means a phone u could easily put in your pocket. You could not sit down with it in your pocket without bending it or possibly breaking it. Its not a in pocket cell phone, kind of phone.***I think to buy this phone u really have to like windows phones. And want to use it like a ipad stylus option, and hope that the company you use has unlimited data so you can really get full use out of it.I unfortunately got the phone realized it was windows, and thought oh I will try it out, maybe I can get used to this \"windows phone\" and then realized after a month of use, that I STILL didn't like it, unbeknownst to me, that there is a 14 day return policy, and after 14 days, you're stuck with it.", "Date": "November 2, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Nokia Lumia 1020, White 32GB (AT&T;)", "ImgURL": "NULL", "ProductID": "B00DVRJBE0"}}