{"Reviews": [{"Title": "great cell phone!", "Author": "Carlos J. Miranda Pantoja \"Carlos Miranda\"", "ReviewID": "RL98DBN3B83XM", "Overall": "4.0", "Content": "works like a charm. Very happy with it. Don't forget to wipe all the AT&T; crappy apps and buy a case protection.", "Date": "October 2, 2013"}, {"Title": "The ONE To Rule Them All", "Author": "Johnny Saigon®", "ReviewID": "R39NYD87HMYWWF", "Overall": "5.0", "Content": "What is there to say about this phone? If I just write about it, I'm just going to ramble on and on. So to save everyone some grief, here are bullet points (my direct comparisons are to the iPhone 5, Samsung Galaxy S3 and Note 2, but mainly to the Galaxy S4):The Good:1) THE SCREEN: If there was such a better screen on a phone, I have not yet seen it. The iPhone 5 is lauded for its excellent screen, but at its current resolution, it trails behind the One's screen by far. Everything just POPS out at you. Even in direct sunlight, everything is CLEAR and BRIGHT. I really loved the Droid DNA/HTC Butterfly's screen, but once again HTC has outdone itself and given us a true masterpiece in 4.7\" 1080p(468ppi) form. This is THE BEST screen on the planet right now - WOW!!!2) THE DESIGN/HARDWARE: Why do most reviewers laud the iPhone 5's aluminum construction so much, when it chips and nicks so easily?? If you want a true masterpiece in design and craftsmanship, look no further. The One feels THICK and TOUGH. I don't have to worry about carrying this around case-less(except from drops, which is a whole other case). I will not be worried about this phone nicking and scraping like the iPhone 5. Personally, it may not have the flair of some of the Sony and Nokia phone of the past, but in totality the One has the best combination of design and craftsmanship. It oozes style and sophistication(*cough*Samsung*ahem*).3) THE DUAL FRONT-FACING SPEAKERS: We have all been desensitized to the modern smartphones nowadays with their crappy, tinny, mono speaker. I remember the days of the Nokia n95 and n84 with their stereo speakers - whatever happened to phones after that? Whoever agreed to a mono/solo speaker with all the smartphones thereafter?? FINALLY, someone has the senses to come back to reality - thank you, HTC!. Trust me, your ears will thank you and you will realize all phones should have been made like this. Especially when you use ringtones/alerts that were specifically created for this phone, the sound is loud, immersive, expansive, and POPs into your ears. It's simply a re-revolution.4) THE CAMERA: I don't use my phone camera to make prints from photos, I have my dedicated cameras for that. So to me, the paramount function of phone cameras is the convenience/accessibility - it has to be able to capture what I want quickly and clearly, with decent enough quality to post online. Therefore, the 4MP size in the One's camera does not bother me at all. Who cares if the camera isn't THE BEST phone camera ever? Because it is not, but it is a GREAT low-light shooter, and to me that's more important than pixel count. The sensors in the camera are bigger than other phone cameras, therefore, it can capture a lot more light, which in laymen's terms it can give you better photos in more situations than other phone cameras can. Also, the touch spot focus is almost instantaneous - this camera is quick, quick, quick!5) For a near 5-incher, it's quite svelte, at least at the girth. It's easier to hold in the hand than the Samsung Galaxy S3/S4, and for sure a heckuva lot better than the Note 2. It fits in your hands nicely and securely, with just the right combination of size, weight, and balance.6) The UI and software design is now very minimal and simplistic. For better or for worse, if you are used to the old Sense UI's, you will need some readjusting. Personally, I like this new one better. If you're a casual news reader, then you'll like new default home screen which displays a gathering of news sources - some of its own partners, some for your Facebook and Twitter, etc. - to form a Flipboard style of news reader. Personally, I'm a huge Pulse news reader fan, so I only use that.The Bad and Ugly:1) The battery is only 2300mAh - I wish it was bigger because I'm one of those paranoid people who always needs my phone at fully charged, just in case, of you know, something. But so far it's been holding steady at about 40% at the end of the day(from 9am-6pm). I check emails, read the news, text, Facebook, etc. throughout the day - I would say that I'm a moderate to heavy user. Another bad thing that I've noticed is it charges slower than most other phones.2) Comparing features with the Samsung S4, the One is lacking. It's not a deal breaker, but for those who like fancy functions, the One will not make you as happy. The HTC One is very simple in its feature set. The one feature I miss most from the new Samsung phones is Smart Stay, where the phone can sense that you're looking at the screen, and won't dim/turn off the screen - that was a HUGE convenience for when you're watching a movie or reading the news.3) Like I wrote earlier, the size is both good and bad, and it's also heavier than most similar phones. It's taller than the S4, and with the power button up on top, it's almost impossible to do one-hand phone operations without shifting your hand up and down to accommodate both the screen gestures and buttons. The buttons(power and volume) don't protrude enough to make it easy to press them.All in all, I feel the combination of the One's screen, design/craftsmanship, and audio experience trumps over the Samsung S4's fancy functions. The S4's screen is almost just as good - AMOLED screens are known for their deep blacks and saturation, while the One's is much better in direct light. The S4 has a higher MP camera, therefore able to take better photos in broad daylight, while the One's camera is more versatile and MUCH better in low light conditions. The One has a much better audio experience, while the S4 gives you better convenience with its features - userability goes to the S4 for sure.But in the end, considering the totality of things, I feel the HTC One provides me the best TOTAL experience, and is the king of the smartphones right now.", "Date": "November 25, 2013"}, {"Title": "It's an awesome phone", "Author": "Nique", "ReviewID": "R1CM4ZI0UEEUEU", "Overall": "4.0", "Content": "I love my phone. It's everything they said it would be. I won't be needing another for a long time. LOVE IT!!!", "Date": "January 14, 2014"}, {"Title": "Everything perfect and on time!!", "Author": "luciano", "ReviewID": "R14DT5HLY091NS", "Overall": "5.0", "Content": "Everything perfect,,!  I did like a lot amazon locker!!!! The phone is amazing, it come with all originals accesories,. Perfect", "Date": "January 6, 2014"}, {"Title": "I love this phone!", "Author": "Rhonda Livingston", "ReviewID": "R1O2STSX3AT0VM", "Overall": "5.0", "Content": "Phone received just as advertised in excellent condition.  I live in the Cayman Islands and ordered this phone to be shipped to my hotel while on vacation in florida, the package was received within the delivery time stated.  Excellent phone, I previously had a galaxy S3 and S4 but would definately rate the HTC One M7 over any samsung phones. I just sold this phone only because I purchased a HTC One M8.  I totally love HTC One phones, particularly for the battery life and android features.", "Date": "May 22, 2014"}, {"Title": "great phone quick delivery", "Author": "G", "ReviewID": "R8NEE9P20DSLP", "Overall": "5.0", "Content": "Love love love this phone!! Reasonable price, delivered quickly. Everything was in tact and came as described and listed. Had the Samsung S4 before purchasing this HTC ONE. this phone is such a better quality. Hard exterior, but still has a big screen and all the features I look for in an android. Much more durable than the Samsung.", "Date": "April 17, 2014"}, {"Title": "Prefer to Replace or return", "Author": "zafa kokab", "ReviewID": "R3EM9NLN7N2KMT", "Overall": "1.0", "Content": "Actually, most of the time I have to share my mobile internet data with my laptop but HTC one's mobile network sharing does not work for some reason. I have visited my network operator technician as well to set up its mobile network sharing setting(APN setting). But, its not fixed. They told me cell has some software/hardware issue and needs to be fixed by HTC.I have to take prints from my cell some time as well but I am unable to upgrade its android version as well. I talked to HTC and they told me to use Rogers or Telus sim card to upgrade it but its not upgrading though i used these sim cards as well.I like this cell, but it needs to be fixed. I will prefer if it will be replaced.", "Date": "March 21, 2014"}, {"Title": "SPLENDID!", "Author": "April Swope", "ReviewID": "RTFA0O0WHTKGF", "Overall": "5.0", "Content": "LOOOVE THIS PHONE! THE SPEAKERS ARE THE BEST WHICH IS ONE OF THE REASONS I GOT THIS PARTICULAR MODEL! BEST IDEA YET! SUPER THIN, I DID BUY AN OTTERBOX TO PROTECT IT, I WAS AFRAID OF DROPPING IT , VERY STURDY METAL BODY!", "Date": "March 21, 2014"}, {"Title": "Works perfect out of the box", "Author": "Jonathan", "ReviewID": "RTRFGZOO5EOHE", "Overall": "5.0", "Content": "This phone is one of the best phones out there.And the unlocked version just works as expected.Thanks !", "Date": "March 5, 2014"}, {"Title": "Great", "Author": "Jonathan Medellin", "ReviewID": "RGXQJK5DT6YRJ", "Overall": "5.0", "Content": "It is exactly as described and works great. Everything is as described is in great working condition. Only one scratch, but was I was told about it so awesome.", "Date": "February 28, 2014"}, {"Title": "I'm not satisfied", "Author": "Saad", "ReviewID": "R3KGJ25EC3YTT7", "Overall": "1.0", "Content": "I got the phone but it was not same  my expectation ,not same that picture showed, and not same that description  because the phone has physical damage .", "Date": "February 15, 2014"}, {"Title": "Best Android Phone in the Market!", "Author": "Ismael Al-Omari \"Obstacles are what you see w...", "ReviewID": "R2IRKBL6JZ06PH", "Overall": "5.0", "Content": "Great product, new as described, working perfectly so far and great manufacturer. This is the best Android smartphone in the market with a full HD screen and built-in 32 GB memory with 4G support and customised with HTC's best softwares and widgets!Camera is great with the unwanted motion cancelling feature and videos are flawless.Fantastic support to copy to or from all other types of mobiles. Made my life much easier with this.", "Date": "February 8, 2014"}, {"Title": "best phone i've ever used", "Author": "Alvaro E.", "ReviewID": "R1GEF1PWUG810O", "Overall": "5.0", "Content": "Fast, beautiful, user friendly. Best android phone on the market. The screen size is perfect for watching movies and I don't need to turn on my computer to listen music. It is just perfect.", "Date": "January 27, 2014"}, {"Title": "best phone ever!", "Author": "Ali", "ReviewID": "R11ZJZ7F0M4Q80", "Overall": "5.0", "Content": "excellent smartphone! all is the best! high quality aliminium and all in original box! im verry happy to buy it! great thanks!", "Date": "January 21, 2014"}], "ProductInfo": {"Price": "$799.99", "Features": "1.7 GHz Qualcomm Snapdragon 600 Processor\nAndroid Version 4.1.2, with HTC Sense 5\n4.7\" HD 1080P DISPLAY\nFull METAL BODY\nAT&T; LTE Version (Unlocked) with ONE YEAR US WARRANTY", "Name": "HTC One 32GB 4G LTE AT&T Unlocked GSM Android Phone w/ Beats Audio - Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/41jWYYfaMRL._SY300_.jpg", "ProductID": "B00D3YHDUA"}}