{"Reviews": [{"Title": "wellll", "Author": "sara serafine", "ReviewID": "R3UDKDV8XFPQ1W", "Overall": "3.0", "Content": "Although this phone is unlocked, and I can use it on my carrier (Straight Talk), It seems to want to go back to the at&t; towers. There is no way to delete the APN for AT&T;, and it also keeps trying to do AT&T;'s updates, which gets really annoying. The only way to get rid of this is to root the phone, which will then void the warranty. The phone did ship super fast. I paid for overnight shipping and received the phone in 22 hours from ordering it, however I wish I would've known about the At&T; updates, that you can't get rid of.", "Date": "April 6, 2014"}, {"Title": "was not for me", "Author": "Amazon Customer", "ReviewID": "R35ZYJD2G524ZR", "Overall": "5.0", "Content": "this phone was ordered for my brother in law and he loves it. he is loving the fact that it is water proof lol.", "Date": "March 18, 2014"}, {"Title": "A lot of phone", "Author": "J. Yates \"GR Fan\"", "ReviewID": "R22APDT0JM4QRF", "Overall": "5.0", "Content": "Got this for our German exchange student to use. She loves it. I'm an iPhone user, but she has agreed to show me all the stuff this phone will do. Who knows. Maybe it will be my next phone.", "Date": "March 30, 2014"}, {"Title": "compatible phone", "Author": "Judy", "ReviewID": "R2B9Q9LASLVCVS", "Overall": "4.0", "Content": "so far this seller dilivered very fast and phone is working great so far. with att compatible carrier - only thing is I cannot remove the ATT logos on it and for updates its updating ATT service, dont know it thats gonna be a promblem - being I have the phone for 1 weekThe unlocked phone is suppose to remove that ATT logo ??????????", "Date": "June 9, 2014"}, {"Title": "Excellent product", "Author": "Javier Alfonso Pulido P", "ReviewID": "R12K90Q0D64R51", "Overall": "5.0", "Content": "i am a colombian costumer and i needed a good phone like this one for using it in my country, it works really great with every phone service provider. Infortunately it did not come with a headset but it is not important beacuse the phone works awesome. by the way, the seller had a great service with me.", "Date": "May 28, 2014"}, {"Title": "Great phone to use for AT&T;'s new family share plans", "Author": "A. Blumenthal \"Drumnast\"", "ReviewID": "R2L26DRN5X02LG", "Overall": "5.0", "Content": "This phone gives me everything I need for connectivity to work email, personal email, social networking, internet radio ,etc. Not sure what upgrades the S5 offers, but this phone is more than adequate in terms of its camera, storage, connectivity, etc.", "Date": "May 18, 2014"}, {"Title": "Love this phone!!!!", "Author": "silka", "ReviewID": "RSWTLS9Z5A16M", "Overall": "5.0", "Content": "I have Straight Talk AT&T.; I took my sim outta my iPhone & put it in this. Starting talking/texting right away.  A quick call to program it so I can use the MMS & I was set. Sooooo much better than my iPhone, hands down!! The BF wants one now!!", "Date": "May 14, 2014"}, {"Title": "Not a new phone", "Author": "marie sicari", "ReviewID": "R36M0M8KH2JHAV", "Overall": "1.0", "Content": "Labelled as new, but received in old packaging and had a strange error message on the start-up screen.It was basically non functional and buggy.", "Date": "May 8, 2014"}, {"Title": "Great phone at a good price!", "Author": "KenSoren \"Ken\"", "ReviewID": "R2SLA441XVYKCR", "Overall": "5.0", "Content": "First of all, I have a Consumer Cellular plan that is really reasonable but they don't sell the Galaxy phones yet.Second, I am a retired computer nerd and this is my first smart phone, so I have been having a lot of fun learning about the phone in general plus APN settings, etc. It took me a 15 minute phone call to Consumer Cellular to get the phone to work on the 4G network but all is well now.I love the phone but anyone wanting to use it with Consumer Cellular needs to have lots of patience along with a little smarts on how to access settings and make the entries into an APN file that works.Overall, great phone and I hope it provides years of service.", "Date": "May 2, 2014"}, {"Title": "Great phone", "Author": "David G.", "ReviewID": "R31LV6A8BI92WB", "Overall": "5.0", "Content": "Am getting into the \"smart phone\" era and wanted one that I didn't have to baby.  Like the water resistance and tough screen of this model as I'm an outdoor person.  Liked the fact that I could get it unlocked and get a SIM from my plan provider since I have no contract.  This phone has plenty of features for me.", "Date": "April 25, 2014"}, {"Title": "Great phone", "Author": "Amazon Customer \"BGKE\"", "ReviewID": "R3MAXBMPMGAG8U", "Overall": "5.0", "Content": "Great seller and great phone. I had a Galaxy II Infuse before this that would barely work on Straight Talk. This phone works great on Straight Talk at almost one third the cost of AT&T.;", "Date": "April 25, 2014"}, {"Title": "Incredible", "Author": "SF", "ReviewID": "RWLGXFPR2AC55", "Overall": "5.0", "Content": "Excellent phone. Blazing fast, reliable. The only negative aspect is the speakerphone is not very loud, I guess because of the waterproofing. Other than that all good.", "Date": "April 16, 2014"}], "ProductInfo": {"Price": "$749.99", "Features": "IP67 certified - dust and water resistant / Water resistant up to 1 meter and 30 minutes\nOversized 5.0 Inch Touchscreen Display / Corning Gorilla Glass 2\n1.9 Ghz QUADCORE Processor\n3G 850 / 1900 / 2100; 4G LTE 700 / 850 / 1700 / 1900 / 2100 / 2600\n13 MP Main camera and secondary front facing 2 MP camera w/ 1080p HD video recording capability", "Name": "Samsung Galaxy S4 Active I537 AT&T Unlocked GSM 4G LTE Android 4.2 Smartphone - Urban Gray", "ImgURL": "http://ecx.images-amazon.com/images/I/51i1UW9aH0L._SY300_.jpg", "ProductID": "B00EPCQN4G"}}