{"Reviews": [{"Title": "Not Compatible with T-Mobile 3G/4G!", "Author": "ZMaali Dental Inc.", "ReviewID": "RA740WCUM53T0", "Overall": "3.0", "Content": "it was supposed to be compatible with T-Mobile, and the details and summary on the page say the frequency includes 2100mHz, so I bought the phone. T-Mobile, however, requires 1700 and 2100 together in most cases for the 3G and 4G to work. I was not aware, and am now stuck with 2g(edge) with this phone. The dual sim works great, and the android software is fast on this device,but I cannot use much of it on the road or away from WiFi until I switch carriers, or T-Mobile deos something with their towers.", "Date": "August 21, 2013"}, {"Title": "Perfect for what this money could buy...", "Author": "Vlad", "ReviewID": "R6ASXFN2C38OV", "Overall": "5.0", "Content": "Build quality, performance, OS & apps installed - all is pretty enough for this price. No obvious disadvantages worth mentioning", "Date": "October 22, 2013"}, {"Title": "This is a great phone for the money", "Author": "Alice Garrison", "ReviewID": "RDYV37LP3T892", "Overall": "5.0", "Content": "I am really enjoying this phone, great size, easy enough to use and not bulky.  I love the features, however, I have a plan with consumer cellular which uses AT T towers but the tech support (they are very good) with consumer cellular could not get it to work with my data plan with them.  When I am home I get my wi fi signal from my home internet to work my email, etc.  With so many open wi fi signals I don't think this will bother me when I travel.  My travel will probably all be within the U.S.", "Date": "April 2, 2014"}, {"Title": "good phone", "Author": "Francois P.", "ReviewID": "R2BDX7UZ599MGO", "Overall": "4.0", "Content": "this was my second BLU Life Play phone, both for use in France, Europe. no problem so far, great phone. 3G and sometimes H+ depending on the French \"B&YOU;\" network. I use it in the USA with my ATT pay per use SIM card. SIM 1 is micro SIM. SIM 2 is normal size sim card.", "Date": "March 10, 2014"}, {"Title": "Loved it", "Author": "Fabio Leonardo Longo da Graca", "ReviewID": "R27J2MX93EJ8LI", "Overall": "5.0", "Content": "It's cheaper and lighter than samsungs and iphones and it's got everything those others have.Pay attention because L100A is to be used in the USA, thats why I chose L100I that is compatible with the 3G and 4G frequencies in Brazil.", "Date": "December 6, 2013"}, {"Title": "BLU Life Play", "Author": "Antonio Braquehais", "ReviewID": "ROQYAO5NVVVJD", "Overall": "5.0", "Content": "It works better than I expected. For those who love Galaxy and IPhone I recommend discover it. Much more for much less.", "Date": "September 13, 2013"}, {"Title": "BLUETOOTH drops out when operating in vehicle", "Author": "Phil in Baltimore \"Baltimore's Best Home Chef...", "ReviewID": "R1WC7IRW5R68E7", "Overall": "2.0", "Content": "Although I very much like this phone it has one very serious problem which is a deal breaker. When I am using it in my car it constantly drops the bluetooth pairing.  Thorough testing has shown that it is not the car (Honda Accord) nor is it the Android operating system. Another \"Droid\" worked perfectly as did my wife's iPhone. It has been narrowed to this piece of equipment. It's a shame that it will have to be sent back unless the manufacturer can come up with a suitable fix as it is against the law to use a cell phone without a hands free device in Maryland.", "Date": "December 25, 2013"}], "ProductInfo": {"Price": "$229.99", "Features": "Unlocked Dual SIM, 4GB storage; Android OS, v4.2 (Jelly Bean), Micro SD up to 32GB; 3G HSPA 850/1900\n4.7\" IPS Display: HD (1280x720)\n8MP Camera with LED Flash with HD recording (1080p), 2MP Front Camera for Video Calling and instant self portraits.\n7.9mm Slim Body Design\nBLU Next Lens Technology: \"One Glass Solution\"", "Name": "BLU Life Play L100I Unlocked Dual Sim Phone with Quad-Core 1.2GHz Processor, Android 4.2 JB, 4.7-inch IPS HD Display, 4G HSPA+ up to 42Mbps and 8MP Camera (Grey)", "ImgURL": "http://ecx.images-amazon.com/images/I/41fpW%2BB0CVL._SY300_.jpg", "ProductID": "B00E9KXNVA"}}