{"Reviews": [{"Title": "Excellent so far.", "Author": "Brendon Bigelow", "ReviewID": "R1UPRQNWOKY279", "Overall": "4.0", "Content": "I'm only giving this phone 4 stars because I've only had it for 3 days. I plan edit my review later after I see how it does over the course of a month. As it is now, I have to say that this phone is fantastic. This is quite a statement coming from me as I am a great lover of the desktop computer and generally find smart phones to be extremely limiting. My previous phone was a leading model by a manufacturer who shares it's name with a common fruit. I was completely underwhelmed by that product. This product, on the other hand is really impressive.The Android OS is extraordinary in itself. The fact that it natively makes use of all the wonderful Google functionality is a stellar feature. This, coupled with the DROID ULTRA's seemingly formidable processing power, makes for a great user experience. In use, everything just seems to \"Go off without a hitch\". It doesn't bog, lag, or seem challenged in any way.As for the hardware... It's great. The camera is great... The big screen is great... The sound is great. It seems really tough too. I've yet to scratch the screen and I find that to be absolutely amazing as I typically beat phones up.Bravo! Great product.", "Date": "March 13, 2014"}, {"Title": "Upgraded from the Droid Razr", "Author": "Ian McAndrew", "ReviewID": "ROFZSLSQ3JSTW", "Overall": "5.0", "Content": "and was really happy we did. My wife and I got two of these on a black friday deal and were very impressed. Love the larger screen for viewing video and comics.Only drawback: no SD card slotHowever: Google gives you 50GB of free storage on your drive account (for two years) when you add your google account to the phone...so bonus.", "Date": "December 31, 2013"}, {"Title": "More than satisfied", "Author": "Amazon Customer", "ReviewID": "R7X0N6CF62UY7", "Overall": "5.0", "Content": "This phone is one of the best. You can never go wrong with the android operating system. The battery life exceeded my expectations. The screen size is perfect for any activity that you want to do. I would recommend this phone to others.", "Date": "December 16, 2013"}, {"Title": "Great Purchase", "Author": "jAMES", "ReviewID": "R36GFKFORFNNHK", "Overall": "5.0", "Content": "It has met my expectations.  Battery last 2-4 days. Do not have heavy use.  Very user friendly.  Verizon initiated it for me and they did a very professional job.  I am still learning some of it's capabiities.  Very satiisfied.  It was a great price.", "Date": "February 11, 2014"}, {"Title": "Great Phone, annoying battery", "Author": "Brian J. Carragozela \"Devilatwork\"", "ReviewID": "RFK47PBXNDVQE", "Overall": "5.0", "Content": "This phone is awesome with really good features that would make any phone fanatic spend hours playing with it but the phone has a small battery life that if you forget to put it on charger, then you have a dead phone in your pocket for the rest of the day.", "Date": "December 27, 2013"}, {"Title": "Nice, delicate thing.", "Author": "7yl4r", "ReviewID": "R2UCE62DJYJE7S", "Overall": "3.0", "Content": "Don't ever sit on it. I'm thin (130lbs), but all it took was one time in my back pocket and now I need to shell out $50-$100 to fix it.Delicacy aside, it is a well-polished and high-quality product that you would expect to get for the price of a house in Detroit.", "Date": "April 16, 2014"}, {"Title": "Good So Far", "Author": "Amazon Customer", "ReviewID": "RR7NEZZNAP2GH", "Overall": "5.0", "Content": "Very good phone for the price. Still learning how to use all the features. Only had it a couple of months, but so far so good", "Date": "February 22, 2014"}, {"Title": "great phone!", "Author": "matthew kardiban", "ReviewID": "R30EPYPMSSD7A4", "Overall": "5.0", "Content": "everything I could expect and more. have always loved the Motorola droid series and hope to continue with their next great achievement", "Date": "December 31, 2013"}, {"Title": "nice phone", "Author": "Mohan", "ReviewID": "RYCTQCMKDDBTB", "Overall": "4.0", "Content": "everything looks good except the skiddy exterior. Pretty fast then their old droid version. Lot of extra features because of google company phone.", "Date": "May 28, 2014"}, {"Title": "Excellent light case.", "Author": "Travis Meusel", "ReviewID": "RSD92WSF3VTRI", "Overall": "5.0", "Content": "Good quality case. Nice and slim. Fits really well. Matte finish is a little slick so make sure you have a good grip on your phone!", "Date": "April 24, 2014"}, {"Title": "My first Smartphone  -  -  WOW", "Author": "bigeye \"bigeye\"", "ReviewID": "R355IEKRAMRGOC", "Overall": "5.0", "Content": "I had to learn everything, and I mean everything that it could do.  Never even held one prior to getting the Ultra.  Sort of the 'caveman to astronaut' routine.  Phone is very forgiving.  So far I am amazed at how it is coming together. Both Verizon and Motorola have been very helpful when I got myself into a corner and could not get out.  The phone is extremely capable, the support from the carrier and manufacturer is excellent.  I actually am getting SO much more out of the phone than I ever expected.  If I can do this, anyone can........", "Date": "April 22, 2014"}, {"Title": "Screan cracked obviously not not made with corning gorilla glass any more", "Author": "Moneymkr24", "ReviewID": "RQ1EP5N1WHR99", "Overall": "1.0", "Content": "Screan cracked! Obviously not not made with corning gorilla glass any more. My wife loved the droid Ultra phone until then.", "Date": "January 12, 2014"}, {"Title": "Pray that your phone works", "Author": "Angel", "ReviewID": "R3SMV7ZQRF1BDC", "Overall": "1.0", "Content": "When the price dropped down on this phone I was excited to upgrade from my older Droid. But I started to have problems from the start. The phone takes a few seconds to unlock but the main issue was it would drop calls because it would freeze up or just completely shut off or randomly reboot itself during a call. After about 3 weeks of this I finally decided to return it to Motorola to see what the problem was (I had to pay for shipping.) I received an e-mail saying they got the phone and they would contact me with the results. Well a week past, then another, then another! I was finally fed up and called Motorola about my phone! They said they didn't have any new information and to call back tomorrow! In total I had to call Motorola four times about the status of my phone. They finally told me that it had a bad antenna and that they would replace it, only problem was, they don't have any phones in stock! So it seems I'm outta luck till they have more in stock, but they never e-mailed or call me back with anymore info. So now it's almost been three months and I still don't have a phone and after paying $200 dollars for this device.", "Date": "January 15, 2014"}, {"Title": "Nice", "Author": "Url", "ReviewID": "R3OJ70AIGSRHX8", "Overall": "5.0", "Content": "Better than the iPhone! Amira, you are wrong! Don't hate cause team Android is better than team iPhone. Just admit,  I'm right & you're wrong cause the Droid ultra is the best of the best.", "Date": "December 18, 2013"}, {"Title": "Nice", "Author": "Destiny", "ReviewID": "R3RS11QMXI3F5T", "Overall": "1.0", "Content": "This phone was great at first ! But then it started giving me a lot if problems after a couple of months. Now I have an iphone and I love it!  I would suggest going with an iphone because, Aeriel, team iphone is better !", "Date": "December 18, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Motorola DROID ULTRA, Black (Verizon Wireless)", "ImgURL": "NULL", "ProductID": "B00E9WBCP2"}}