{"Reviews": [{"Title": "Any doubt is misguided  !  This Phone blows all others away !", "Author": "Timothy Fox", "ReviewID": "RI7IM18MMUZYV", "Overall": "5.0", "Content": "Took to T-Mobile for Sim and the agent was floored by the value of this Phone !This phone performs like phones twice the cost, has amazing features and an Outstanding package.Android 4.1 and works 3G on T-Mobile right out of the box.have tested most of the features and it is as billed Flawless phone and service!Missed T-Mobile after being on hind tit Sprint (Virgin) never never again..Nothing but Smiles !!Edit: Battery life is 48 Hrs. + fairly heavy first  days use.", "Date": "December 14, 2013"}, {"Title": "4g on T-Mobile...excellent value for straight talk!", "Author": "J. C. hodnette", "ReviewID": "R1OZNZWZE7408T", "Overall": "4.0", "Content": "Phone is tough, waterproof to 1m.  Comes with screen pro, silicone case and head phones.  Set up on straight talk was easy.  Just purchase a Sim card kit, includes 30 day service card.  I used the T-Mobile Sim card, kit includes at&t; as well, but not sure if you can get 4g.  You can easily try it or discuss with straight talks excellent tech support.  Couple is decent drops and it's still working great. 3d games work fine.  Bright, clean screen.My only complaints are:  no magnetometer (google sky map doesn't work well), could use more RAM as once you put a lot of apps I had to use a cleaner app to clear memory (no apps can go on SD card).", "Date": "November 15, 2013"}, {"Title": "This phone is amazing", "Author": "Thania", "ReviewID": "R1W7P6AXCOPWYY", "Overall": "5.0", "Content": "this phone is amazing ... It is super fast, good design ... I made a good buy. the only problem is the battery", "Date": "December 18, 2013"}, {"Title": "Battery Life", "Author": "Jameisa C.", "ReviewID": "R2KAKHIE9DPFD4", "Overall": "4.0", "Content": "Battery Life for this phone sucks, seriously. Having to charge it twice a day when i don't use it often is ridiculous. My other concern is finding a case for it, not even amazon has any good ones. I'm starting to regret buying this even though it has some great features.", "Date": "January 14, 2014"}, {"Title": "Great por the price", "Author": "Antonio Cantu", "ReviewID": "R14KUSNTPWD6XI", "Overall": "4.0", "Content": "It's a great Android. Good screen size, great resolution and great memory capacity. Plus the dual SIM really helps, specially if you travel frequently.", "Date": "April 10, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EO458RS"}}