{"Reviews": [{"Title": "Great Phone", "Author": "M. Stevenson \"From space the stars are no nea...", "ReviewID": "R1Y9XVOSPWG3TL", "Overall": "5.0", "Content": "This is an amazing phone for the price. It has the look performance & feel of a $500 phone for only $200. Probably the only concern is the small internal memory but you can put in a microsd & root it (both android & sony are open source so its completely easy) & then you can install apps on the memory to preserve the internal memory. I also liked that it came with almost no bloatware for me to remove. My only concern is its featherlight feels like nothing is in my hand(or pocket when not holding it) so I'll be sure to get a case for when I inevitably drop it.", "Date": "January 3, 2014"}, {"Title": "good price and quality", "Author": "Oleg Gritskov", "ReviewID": "R286OE1M84KECA", "Overall": "5.0", "Content": "Very good quality, phone works perfect, has a long battery life, comfort Sony virtual keyboard, non-sliding plastic like rubber when you touch it, size the same as iPhone 5, android work fast and smooth, fast 3d graphic chip", "Date": "October 18, 2013"}, {"Title": "I LOVE IT", "Author": "Ana K.", "ReviewID": "RWGJELBQBTV06", "Overall": "5.0", "Content": "ITs soooo gorgeous , perfect , but the sim card is MICRO SIM , i love it. ( es hermoso lo recomiendo funciona en Vnezuela perfectamente solo que es sims MICRO hay que cortarlo)", "Date": "April 19, 2014"}, {"Title": "Great Device for A great Price.", "Author": "Sherwin Binarao", "ReviewID": "R38O5YUZLD52ZE", "Overall": "5.0", "Content": "After buying a windows phone 8 device, I wanted to try how android is doing so I bought Xperia M.I love it's design, it resembles Xperia Z just a bit smaller though. It is light and easy to carry. Fits just right in my hand.What I hate about the device is it's hardware materials, the back cover feels fragile and cheap.Camera captures decent images in daylight and in low light situations.", "Date": "October 1, 2013"}, {"Title": "Best upgrade alternative", "Author": "M. Rogers", "ReviewID": "R3BLYZ3YRD0JTT", "Overall": "4.0", "Content": "I had the option to buy the Z model from my current phone company but it was closer to $600. In comparison to that model, by going with this one I missed out on a few options but not major ones. It has a front-facing camera and does everything else I need it to without being bulky. The regular camera seems to be lower megapixels than I'm used to but the phone's photo editing options pretty much make up for it. I love the ease of customizing screens and notifications. I had to get a micro SIM card to fit in the phone so it delayed me using it until I could get to my phone company's store but the card was free so it wasn't a major setback. The Xperia app that downloads once you connect the phone to a computer allows for a lot of options, including transferring contacts from your old phone so I did not lose anything. The battery life is a little shorter than I would prefer but there are battery-saving options that are pretty effective. I would definitely recommend this phone as a cheaper alternative to upgrading through a phone company!", "Date": "January 7, 2014"}, {"Title": "Good enough for me..", "Author": "Jorge Alvarado", "ReviewID": "R3MDHXZ1WODEZB", "Overall": "5.0", "Content": "I was originally going to rate this phone at 3 stars due to the inability to move apps to the sd card (Like every other phone).. But I rarely come across any memory problems.. The front facing camera is really bad, But I have no use for it so it would mean just as much to me as if it weren't there.. The rear camera is decent.. But again, I'm not a huge fan of taking pictures.. Another problem would be that MOST of the time, Their is a menu strip (Home button, Back button, Running apps button) that don't go away using certain apps..", "Date": "April 1, 2014"}, {"Title": "Nice phone though", "Author": "Philo Bwabwa", "ReviewID": "R2ZK6JX59WJPKP", "Overall": "3.0", "Content": "I love this phone, but the front camera is just horrible. nothing good comes out of it...Still it is a very nice. I also noticed that the battery doesn't last that long, which is unfortunate.", "Date": "March 26, 2014"}, {"Title": "Very nice phone, good price", "Author": "midmich", "ReviewID": "RDMY5Z2TUXQZ", "Overall": "4.0", "Content": "I purchased this phone to replace my Xperia X8, which had become painfully inadequate for today's apps. My new Xperia M actually cost less than what I paid three years ago for my X8, and is a vastly superior product in almost every respect. It came pre-loaded with Android 4.3, by the way.When I received this phone, it had an issue with the Google Play store. I could connect (via wi-fi) and select apps to download, but it could not download them (I got an error message). Rebooting the phone did not solve the problem. I quickly \"googled\" this issue, and found the solution on a user forum. I had to connect the phone to my PC, install the Sony PC Companion software, and use the \"repair my phone\" function. It took about 15 minutes to download and install the phone software, after which everything has been working perfectly. Not a huge deal for an experienced user, but it could be a deal breaker for the less experienced.I really enjoy the new OS and how fast and responsive this phone is. It looks very nice and is very well built, although the plastic and glass used are really thin, and therefore I think it must be handled with care. In terms of size, it has basically the same length and thickness as an iPhone 5, is about 1 mm wider, and weighs the same (actually, 0.6 grams more!).As other owners wrote, the available internal memory is limited (2.05 GB), but it is adequate for my needs. I can always add/delete apps whenever needed.I added a 32GB micro SD card to store media and data files. Beware that without rooting the phone (which I do not intend to do) apps can only be installed in the phone's internal memory.Overall I am very satisfied with this purchase and I recommend this product, although with the reserve I explained about the Google Play store issue.", "Date": "May 23, 2014"}, {"Title": "Mixed feelings!", "Author": "Brandon A. Mikel \"absurdist\"", "ReviewID": "R1MJLNI94RSHBY", "Overall": "3.0", "Content": "This phone does its job decently enough, but the fact that I bought a 32 GB memory card for it and I can't use it to save apps really puts it down a few pegs. I can use it for music (not for the Walkman app that comes pre-loaded) and for other apps that keep data aside from their executables. Other than that it's a fine cheap phone that works for me just fine over in New Zealand. I've had it for about two months now and it's holding up in all other capacities.", "Date": "February 7, 2014"}, {"Title": "Excellent!", "Author": "Oswaldo Cova", "ReviewID": "R3N1PY47KIGLB4", "Overall": "5.0", "Content": "I really like this phone! just the better relation between price and quality! it works perfectly in Venezuela! i recommend it!", "Date": "June 8, 2014"}, {"Title": "very nice and handy phone", "Author": "Ken M.", "ReviewID": "R164TFDQISNL3D", "Overall": "5.0", "Content": "so cool and good to use, the price is just enough for this phone, totally satisfied.sony it is.. :)", "Date": "May 26, 2014"}, {"Title": "Great product, Great Seller.", "Author": "Katherine Bresee", "ReviewID": "R1XF1TCWUGF69M", "Overall": "5.0", "Content": "Seller shipped incredibly fast! I had the phone within two days!!! Love the phone, great camera quality. Only small issue I have with the phone is that you can't move apps to SD card without rooting, but with 2gb for App storage that's really not a problem for me. Phone is FAST and truly customizable to the user.", "Date": "May 26, 2014"}, {"Title": "Nice Phone, good price", "Author": "Bosun Rob", "ReviewID": "R2BTIVN5VESTUZ", "Overall": "5.0", "Content": "I have been looking for a phone to use when I go overseas and this one works perfectly.  I've traveled all over Asia with it and it never skips a beat. Not a huge fan of the purple, but I leave it with my daughter when I come back to the States and she loves purple. The touchscreen works well, especially for a guy like me with big fingers. Some phones I fond cumbersome to use, but this one was great.", "Date": "May 15, 2014"}, {"Title": "very good value", "Author": "K. Ryan", "ReviewID": "R1X1WPQ72BSBC9", "Overall": "4.0", "Content": "Not only lots cheaper than an Iphone or unlocked Galaxy s5, but cheaper than an Ipod Touch!I'm not a heavy cell phone user, but I found that while traveling I wanted more functionality than my old flip phone offered, so I bought the Xperia M as a \"starter\" smart phone.My needs were really more for a highly-portable tablet computer than for a cellphone, and I think that the Xperia M will serve well in that role.  I do have simple voice/text service on it--I migrated a prepaid T-Mobile account to it, which required only moving the account from the old, standard-size SIM to a micro card (the local T-Mobile store did it for free)--and I look forward to using it in Europe with a prepaid SIM to be acquired when I get there--a key feature of this phone for me was its multi-band capability.  I was looking for a device that could be a more sophisticated MP3 player than the one I have, that could take decent pictures, be a GPS, and provide wifi connectivity on the go--basically, an Ipod touch with better value and that I could use for occasional phone calls--and this phone does all that.  FM radio is a nice bonus, and seems to work fine.  I don't watch movies or TV on little devices like this so I won't comment on that functionality.Hardware Notes:responsivebuild quality gooduses standard micro USB cablesharp readable screen, bright enough to view outdoorscontrols good, especially camerareally compact and lightmedia storage works fine with a not-super-fast SD card (one I had lying around)(app installation on the old SD card wasn't tested)battery life not really tested thus farSoftware Notes:Android version is stable so far--no hangs to datenot too badly cluttered up with pre-installed apps, but some stuff I don't want isn't deletablepretty simple interface and options navigationgood utilities, including power management optionsneeds a good way to back up to a Mac--that function in Mac bridge doesn't work (along with several other functions--be prepared to improvise to get Mac data onto the phone, unless you already use the Google cloud for all your personal information)The Sony mac bridge software (I can't comment on the Windows version) is not very good--get Android File Transfer.  Music, pictures, and videos are easy to move to/from the phone even using the Sony utilities (although the Mac bridge is slow), but it's a little tricky to move e-books to the phone. It's probably easier for ITunes users, but I am not an ITunes fan.  Since my e-books are all loaded into the Calibre e-book manager on my Mac, I finally ended up using Calibre's ability to act as a server (hint:  turn off your Mac firewall), which worked, but is a little complicated.  There's also a (not free) client utility available that is supposed to interface with the Calibre library that might be simpler than the Calibre server option.  Again, if you read Google or ITunes books you won't have as many hoops to jump through.  I was surprised to find that reading a book on such a small screen is not terrible.I have used the Office Suite only for reading pdfs so far, but it's nice to know that it's there just in case I need to read a Word doc or something.I'm still shopping for GPS software that will do a decent job without a data connection, so I can navigate without a cell phone data connection without depending on saved maps.  I've done some simple tests for walking navigation using MyTracks and found that GPS-only performance was good, so I'm hopeful that more complex navigation is also possible.Since these phones are more popular in Asia than the US, model-specific accessories (e.g. cases) aren't as common as for more popular models, but the good news is that Asian accessories are cheap, if a little bit slow to acquire:  I ordered some cases through Amazon that were scheduled to take 4-6 weeks to arrive, but I actually received them much more quickly.Probably not the phone for serious cell phone connoisseurs, but a capable bargain for less phone-centric buyers.", "Date": "May 9, 2014"}, {"Title": "I like it.", "Author": "Nguyen Q Vinh", "ReviewID": "R1TB2E7P7INDG6", "Overall": "4.0", "Content": "Form, fit, function, & look - everything is good. No complain.I'm not addicted to talking, texting, chatting, and browsing, so I don't need thousands of apps. This one is perfect for me, especially when I travel overseas for work. I can simply buy a local SIM and I'm ready for actions.", "Date": "April 10, 2014"}, {"Title": "Great budget phone", "Author": "c_busta", "ReviewID": "R1VQ4FOMBY1IHG", "Overall": "4.0", "Content": "I got this phone for my girlfriend because her other Xperia smartphone died on her after 2 years use. We needed a cheap option and it seemed like a good choice for the price. Overall it's a great phone, little to no slowdown when using several apps, great battery life, NFC, good size for one hand use, decent camera and nice build quality and design.The only downside is the screen. Colors are a bit washed out so everything has a paleish blue hue. It really is a shame because it's  a very good phone for every day use and it performs better than what I expected. With a better screen, I would easily give it 5 stars.", "Date": "March 15, 2014"}, {"Title": "Excellent phone!", "Author": "Martin Tzanov", "ReviewID": "RH6OLH35JEGRJ", "Overall": "5.0", "Content": "This phone was a nice surprise. It is fast and full featured. Sure it doesn't have premiumscreen and the sturdy metal frame but these weren't things I was looking for. This phoneis very responsive. It has GPS, Bluetooth, Wifi..... Pretty much everything. If you needbasic phone that does it all look no further. Another surprising thing is how light thisphone is which you don't get with metal frame. The other real good feature is the sizeof the screen. It is compact and I don't have the feeling I am talking into a tablet.", "Date": "March 12, 2014"}, {"Title": "thx", "Author": "ALBERT O ARAGOZA F", "ReviewID": "R3R56MI3RQ3OLZ", "Overall": "5.0", "Content": "good.excellent and on time thank you very muchvery good phone and very good attentionhappy new years. s", "Date": "January 25, 2014"}, {"Title": "I arrived in excellent quality thanks tremendous product. I hope your oferts on other products.", "Author": "CARMEN RAMIREZ", "ReviewID": "R33B74ADYHQ662", "Overall": "5.0", "Content": "This product is excellent'm very really exceeded my expectations thank you very much. I hope to keep getting your offers of other products.", "Date": "January 7, 2014"}, {"Title": "a perfect phone to me", "Author": "Raylbert Fernandez", "ReviewID": "R3FP03A66CH3B", "Overall": "5.0", "Content": "the price is great, is not too big, the size is perfect, is super slim and light, interface is confortable, camera is good and is a very fast cel phone. love it", "Date": "January 5, 2014"}, {"Title": "Disspointed", "Author": "Erich von Hein", "ReviewID": "R2NGG1RYBFCCKP", "Overall": "1.0", "Content": "i have a problem with this cellphone. you can use headphone with him. when you plug your headphone you can ear nothing. other problem: both camera are a disaste.the wors mistake is that i can't do a request i just time because the person who receives told me so late abou this trouble. you need to be carefull to check yuor products when you received inmediately.watch out at time and don'be surprised latereste celular lo encargó un cmpañero y yo se lo compré pero el detalle por el cual no pude hacer una reclamacion de los problemas que trajo este equipo fue porque me vaiso depsues de los 30 dias y ya estaba cerrado para hacer reclamaciones o devoluciones. por reso lo califico mal", "Date": "March 19, 2014"}, {"Title": "good buy", "Author": "Peppersquid", "ReviewID": "R3EU3YWM9NPYXO", "Overall": "4.0", "Content": "This phone is a great buy for the price. One of the only down falls is the with the camera there is a blue hue, when viewed on the phone's display. If the picture is sent via email to someone else, there is no blue hue.", "Date": "February 19, 2014"}, {"Title": "JACQUELINE RAMOS", "Author": "Jacqueline Ramos Castillo", "ReviewID": "R13PNDMB9L8KCU", "Overall": "1.0", "Content": "IN A LIGHT, WITH A GOOD SMART PHONE SYSTEM AND MULTIMEDIA CAMERA EXCELLENT, THE NEGATIVE IS THAT I DO NOT WORK IN MY COUNTRY BUT NO DICE UNLOCKED WORKS IN VENEZUELA WAS WRONG TO BUY ME EVERYTHING ELSE IS A GOOD PHONE", "Date": "April 18, 2014"}, {"Title": "am not happy", "Author": "kyeran", "ReviewID": "R3LZ9RGT02TJIV", "Overall": "1.0", "Content": "On the 16/02/2014,an a nice Sunday evening chilling and using my new phone and all of a sudden it froze up. the touch shop working. i then remove the battery and chip but i still it doesn't respond. so i take it to an technician the next day.i then get to know dat the digitizer  stop working. come on! how can a brand new phone digitizer stop working,its never being squeeze r drop.tell me this, there i was downloading a game off of play store and it just froze. can u please explain this to me. now i got the feeling dat i brought a new phone but i was deceive and was giving  a old one or refurbish. now i have to go and spend more money to get a digitizer, come on people.why?.", "Date": "February 19, 2014"}, {"Title": "Nice phone. Used it for all of 3 days.", "Author": "Didier Billiouxe", "ReviewID": "R268JW00WWPNTV", "Overall": "3.0", "Content": "Ok this is a \"nice\" phone.Basic, simple to use, and user friendly.It is just too darn small for my hands. Unfortunately, once you open the box Amazon will not take it back. I had it activated and tried it for three days.The screen is only 4 inches. I'd go for the Xperia Z1 folks.", "Date": "February 16, 2014"}, {"Title": "Cannot install software on SD Card!!!", "Author": "Vaxo", "ReviewID": "R2QNAY9V5VGRCR", "Overall": "1.0", "Content": "you can use SD Card for only media files such as videos, pictures, musics but NOT FOR APPS. Now I hate it, because it has only 500 MB free(this will be, if you delete everything or after factory reset) and I can't install GTA SA, vice city, NFS: Most wanted and NFS: Shift!. Even Real Racing 3 or 2!!!!! I hoped it will be corrected in next OS update but, today I am VERY Disappointed! I installed Newest Update, I Hate Sony! Hate xperia. even Fly, HTC, Samsung and other low budget smartphones can do that!! but not SONY!!!!!!!Edit: two months, after this review installed latest official Android 4.3 update (Build number: 15.4.A.0.23) and STILL NOTHING!!!!!I think root is the best way.I have 16 GB Sony SD Card. Still can't use it... and also Sorry for my bad English.", "Date": "March 3, 2014"}, {"Title": "Bad", "Author": "Maria Urriola", "ReviewID": "R2BWUECFU6E32Z", "Overall": "1.0", "Content": "Had not included headphones or headset, which also brought a Samsung charger, I thought it was not going to have problems with this purchase", "Date": "February 16, 2014"}, {"Title": "Just it's Ok", "Author": "Mel", "ReviewID": "R3QZA1R1SGEDGS", "Overall": "3.0", "Content": "Basically this phone works pretty fast. The screen quality is very very good. The music sounds great. BUT if you want a good quality camera. The camera of this phone sucks. Previously I had a galaxy ace phone and obviously these two are not comparable, however the camera of galaxy ace is far better of xperia M camera. This is really shameful for SONY vs SAMSUMG. It has a lot of functions and effects but the final product : A lot of noise (even in daylight), and poor focus quality.", "Date": "December 16, 2013"}], "ProductInfo": {"Price": "$249.99", "Features": "One-touch connectivity with NFC  for easy pairing and sharing of content with other NFC-capable devices, including one-touch mirroring with NFC-capable televisions.\n5MP fast capture camera with HDR for photos and 4? display for immersive entertainment\nQualcomm Snapdragon? S4 Plus dual-core 1.0 Ghz  processor and Battery STAMINA Mode", "Name": "Sony Xperia M C1904 - Single SIM - Unlocked -  US Warranty -(White)", "ImgURL": "http://ecx.images-amazon.com/images/I/415eHYPTe8L._SY300_.jpg", "ProductID": "B00E391NW8"}}