{"Reviews": [{"Title": "Good features, works fine", "Author": "DaniLion", "ReviewID": "R1SZMVZPFKM694", "Overall": "4.0", "Content": "I've had this phone only for a week but have really enjoyed its features. Touch pad is quick and clear. I don't find the QWERTY key pad too small, it's just as crammed as the rest of them but works smoothly. The sound/talk quality is GREAT when in an area of good coverage. No missed calls or texts. The camera is good, obviously not great, and the one time I tried a video it didn't pick up the audio from very far away (over 10 feet). However, I didn't buy it for good video.  My only problem is that our house is in a hollow of BAD reception, so the antenna on the LG Freedom isn't enough to make it work for me. Very sad to have to trade in this phone. Have heard that the best US Cellular phones for reception are Motorolas, but unfortunately they don't have an equivalent phone (don't want a smart phone). Overall, I found this phone easy to use and well-made and disagree with the previous reviewer.", "Date": "November 25, 2013"}, {"Title": "Worst phone I have ever had to endure...", "Author": "Paul B. Kennington \"PaulK\"", "ReviewID": "R3NXB7IQY88P50", "Overall": "1.0", "Content": "This phone is just awful, absolute rubbish. The qwerty keyboard has its keys too close together, it sometimes decides to capitalize the first letter of a sentence, sometimes not, it often puts several letters in when I press the button once, and hanging up takes several presses of the 'hang up' key. Often the phone tells me that I have an 'easy edge' message when there is no such thing, it often fails to ring/vibrate then tells me I missed a call, and overall I despise the little piece of junk. Update: Phone just beeped & told me I missed a call. It was sitting right here the whole time. The ringer is set to high. Garbage garbage garbage!", "Date": "November 15, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "Display: 3.0-inches\nCamera: 2-MP\nInput: QWERTY Keyboard\nOS: Other", "Name": "LG Freedom (U.S. Cellular)", "ImgURL": "http://ecx.images-amazon.com/images/I/51hT1Hqt7pL._SY300_.jpg", "ProductID": "B00E3IC5H6"}}