{"Reviews": [{"Title": "Great at First But Then Trouble.", "Author": "Steven Metz", "ReviewID": "R3E30YS34B7R7G", "Overall": "2.0", "Content": "I don't use my wireless phone much to watch video and while it's great having a camera in it, the phone is not my primary still or video camera.  For me, portability--fitting easily in a shirt pocket--is more important than having a huge, high resolution screen or the best camera.  For that reason, the Ultra made sense.  For me it was the perfect size--bigger than an Iphone or HTC One--but smaller than a Galaxy.I went to the Verizon store intending to get a Droid Maxx based on reviews but decided that since I don't stream video and don't need to go multiple days between charges, my use didn't warrant the larger phyical size of the Maxx.  I've found that I can get through a day of what is for me heavy use and still have 20% or so left.  The Maxx also has more ROM but since I don't use my phone as a music player or to store video, that wasn't a factor.  The same with cordless charging.  It would be nice but wasn't a big deal for me.I played a bit with the Galaxy and One before buying the Ultra but having had a Razr and Droid previously, I was familiar with the Motorola interface and decided that the advantages of the Samsung or HTC interfaces didn't justify having to learn a new one.  All I really needed to do was become familiar with the new features like touchless control which allows you to train the phone to respond to your voice even when sleeping, and the slightly different way of accessing menus.Two downsides of the Ultra are the slick back does show more smudges than the matte finish of the Maxx, and Verizon still insists on loading a lot of bloatware which can be disabled but not actually removed.  Like all of the new Droid generation, it doesn't have a memory card slot which might be a consideration for someone who does use their phone as a music player.I don't want my wireless phone to be an \"everything\" device.  I have an Ipod to play music.  I have still and video cameras for those functions.  I have a Macbook Air for serious computing when I'm away from home. So I want my phone to be a highly portable means to do what these specialized devices don't, especially Gmail, Twitter, Facebook; provide good note, to do, shopping, and flight tracing apps; and tether to my laptop to provide Internet access when I'm away from wireless networks or don't want to pay for wireless in a hotel.  And, oh yeah, to make phone calls and send SMS.  I don't want my phone to substitute for a a television, a regular camera, or a laptop.  So for me, the Ultra hit the sweet spot.  The size is right, the camera and screen aren't the best available but are perfectly fine.  The call quality is excellent. And being quad core, it is significantly faster than the Razr I had before.  So I'm happy.  We'll see what the long term brings but after a week, this is my favorite wireless phone of the 15 or 20 I've owned in the past twenty years.-------------------------I had to downgrade my rating of this product and update my review. At about the six month mark, the camera app began crashing every time I tried to record video. The local Verizon store suggested doing a hard reset. Did that, took me two hours to reinstall everything and configure it. Had to pay for my ringtones again. It worked for a day then began doing the same thing. This time the Verizon store did a warranty replacement. Again, two hours of work, paid for ringtones again, worked for an hour, then began crashing. Spent two hours on the phone with Verizon \"level two\" tech support and they admitted it was a hardware problem, but had no solution. I liked the phone a lot but it annoys me to not have basic functionality. But Verizon wouldn't swap it for another brand.  So I'm stuck with a phone missing part of its functionality. And by the way--Verizon refused to post this review on their web page.", "Date": "October 20, 2013"}, {"Title": "I love this phone!", "Author": "CCE", "ReviewID": "R3D60S703CJ5CT", "Overall": "5.0", "Content": "This phone is amazing! Besides having the Android OS that I love, it is extremely quick with no lag. Overall the BEST part is that the battery can last for 2 days of regular use and over a day of VERY heavy use. I was shocked since it was the Ultra and not the MAXX. This is much lighter versus the MAXX so it feels better. It can easily fit into a pocket and hardly feels like it is there.", "Date": "October 28, 2013"}, {"Title": "Reponsive", "Author": "Brian Whiting", "ReviewID": "R1TYHZLPDX5Z0", "Overall": "5.0", "Content": "This device is great, with a slick interface and basically bare bottom Android 4.2 UI. The device is fast, not much lag in the device but only had it for a few days. The touchless option is very good for the device too and useful for the drives.When I want to use the device for a long time it can last on a full charge for about 8 hours for me.", "Date": "October 21, 2013"}, {"Title": "Really like this phone", "Author": "Amazon Customer", "ReviewID": "R1N1VRFJ8MIVE8", "Overall": "5.0", "Content": "This is my 4th Android phone and this is my favorite by far.  By descending order of preference they areDroid UltraSamsung Galazy SIIIDroid BionicSamsung Illusion", "Date": "February 26, 2014"}, {"Title": "It's what I hoped it would be.", "Author": "Leon", "ReviewID": "RFC7046Q1VIS3", "Overall": "5.0", "Content": "Light, fast and with a very slick display. I was upgrading my Bionic. Coming from a two-year-old phone, it's easy to be happy with this device.", "Date": "December 17, 2013"}, {"Title": "Pretty fast/amazing/thin/sexy/gorgeous phone", "Author": "HalfMarvin 23", "ReviewID": "R2P4DQ3FXN5E5P", "Overall": "5.0", "Content": "This phone is pretty cool, it's my third Droid. I've had the Droid 3 and 4 and this phone is better than them all. This phone is really good looking, it's also very fast this phone has everything. It's better than the current iPhone 5s but not as good ass the Samsung S4. I recommend this to everyone!!!!!", "Date": "September 16, 2013"}, {"Title": "Great phone!", "Author": "Amazon Customer", "ReviewID": "R13WGEK49OHE1C", "Overall": "5.0", "Content": "Great phone.  Highly recommend.  Very sleek, fast and has a long battery life.  Only issue I have is there isn't a nice docking station for it.  The only one available is the Griffen, very unsteady and doesn't have a port for speakers.", "Date": "October 22, 2013"}, {"Title": "wonderful", "Author": "rzarev", "ReviewID": "R77GI23Y6LUHO", "Overall": "5.0", "Content": "this really is a nice phone.  you can do so many things with it.  hands free features are great. has a rich red cover and a long battery life.", "Date": "May 19, 2014"}, {"Title": "Not so good!", "Author": "Joe A. Valdez", "ReviewID": "RVD5BB568GKMZ", "Overall": "3.0", "Content": "Phone seemed to be fine until the second week I had it! It started seizing up or freezing n I would end up waiting till it decided it wanted to start working again before it would start responding again? Aggravating at best! Sending it back n getting Samsung S....hope it works cause u only get a month then ur stuck with a small boat anchor for two years or buying another phone out right for $$$$ big bucks!", "Date": "May 7, 2014"}, {"Title": "wonderful", "Author": "anissa", "ReviewID": "R1PR4UP5TXGCCG", "Overall": "5.0", "Content": "I love this phone so much,but it is kinda big.5 stars for sure,it has a lot of those emotrones and cool fetures.", "Date": "April 27, 2014"}, {"Title": "best phone I've had in a long time", "Author": "Amazon Customer", "ReviewID": "R1W69K80DVA7M", "Overall": "4.0", "Content": "Very fast with plenty of memory but, no SD slot. Other than that it's a great phone. The hands features are impressive.", "Date": "December 17, 2013"}, {"Title": "don't buy this phone", "Author": "Kenosha", "ReviewID": "R1N24TMVI35EY4", "Overall": "1.0", "Content": "This is the worst \"smart\" phone I've had in almost 10 years of smartphones. It's several steps backwards as many very common droid features are missing. There are very few widgets; missing are calculator, a page of favorites for direct dial, clock widgets, WiFi widget, hot spot widget, and the list goes on. The Contacts area is complicated and virtually inoperable. Contacts will not sync with Facebook so photos of your friends will not appear. Every contact appears 4+ times and there is no fast way to link them, and linking them loses phone numbers. Terrible programming choices. Don't buy this phone.", "Date": "April 11, 2014"}, {"Title": "its ok but nothing great", "Author": "Jamie", "ReviewID": "R1NWFFAF501UA3", "Overall": "3.0", "Content": "My husband and I had gotten the droid RAZR when they  first came out a couple years ago and loved them. And I was very happy with my droid till ifinally the charging port got to where it was very difficult to get it to charge without putting some kind of paper weight on the cord. And it took me 30 mins to get it to even charge. And this was only issue i had from the phone and it was caused from my boy being rough on it when he wld play it. But luckily this happened around time it was time to upgrade. I initially was going to get the Samsung note 2 or 3 but my husband being money meiser he is talked me into getting the ultra, being it was only 50 with an upgrade. So I get the ultra and I like the 5\" screen that is a lot brighter than the RAZR. But it has no memory SD slot and I cldnt transfer my 32g SD card with all my pics to my new phone and I cldnt add the extra storage BC of that. These phones don't have as much memory. They changed some of the buttons, like taking away the settings button at the bottom. It was just a gripe for me maybe because I was so used to having one. Then after a month of having the ultra that I bought in store I couldn't answer calls or hang up if I called someone because the in call screen would not pull up. Even the customer rep couldn't fix it and order me a used certified replacement. Out of curiosity I did a factory reset which deletes everything you save in ur phone and that fixed the problem. So I don't know if the issue was from an app I downloaded or a software bug. But overall its not much more special than what my RAZR was. And since the incident with my calling malfuntion I have decided to let my husband use the replacemnt phone until he can uprgrade and just pay out right for one of the notes.", "Date": "February 1, 2014"}, {"Title": "Best Choice I Could Have Made", "Author": "Jtallant", "ReviewID": "R1KBBSVOU1UCHV", "Overall": "5.0", "Content": "I bought this phone as a surprise upgrade for my husband. He Loves it! It's perfect for playing games/ streaming movies & it has gorilla glass so it's not easy to scratch. Which is wonderful, because he is very rough on electronics. I wish I had bought this phone for myself too, instead of getting an Iphone.", "Date": "November 26, 2013"}, {"Title": "Absolute trash", "Author": "dan", "ReviewID": "R2USZRXA4D125K", "Overall": "1.0", "Content": "I got this phone to replace my droid bionic which i loved and I was absolutely disappointed.The bionic hit the ground probably over 200 times onto my concrete floor before it finally broke. I was told that the droid ultra was even more durable so I figured it would be a perfect choice. The screen cracked the first time i dropped it and it fell less than a foot. I can deal with the cracked screen because it's not even that bad but what really pisses me off is that the camera stopped working before i even broke the screen. Also most of my apps wont work until i reinstall them and then they stop working again after about a day. Half the time the messenger and phone apps don't even work. I don't want to be desperately trying to call 911 when my phone application keeps crashing. As a matter of fact I lost my job after 30 minutes of restarting my phone trying to get it to work so I could make a very important call. I wouldn't recommend this piece of garbage to my worst enemies and I'm actually about to smash mine with a hammer right now.", "Date": "April 24, 2014"}, {"Title": "terrible phone, wonderful computer", "Author": "Matty G \"MIG\"", "ReviewID": "R28OGI00D74SLF", "Overall": "3.0", "Content": "CONS:- a terrible \"phone\" in almost every conceivable way and i have come to believe this is deliberate.  cell phone companies don't seem to want people to SPEAK to each other, they want you to TEXT to each other (more on that later)- has annoying requirements to perform what are terrifically simple functions for an ordinary stupid phone like replying to back to back texts (you can reply easily to the latest text, but not the next to latest one)- battery life, lucky to get through a single day and my phone is only a week old- your kids will LOVE themPROS:- awesome speech recognition software - you will never type another text or email again and this feature alone makes all the cons bearable.  NOTE: This bears on my point earlier that cell phone companies are doing everything they can to get you to text and stop that annoying human interface thing called \"talking.\"- this is a pretty good phone at the \"free\" pricepoint (for Verizon, it's a freebie with contract)- your kids will LOVE themAs phones go, it really sucks.  Doing something as simple as hanging up requires two separate functions (assuming the person on the other end doesn't hang up first and i am the kind of person that usually hangs up abruptly since i handle tons of calls).  Just to hang up you first have to wipe at the touch screen to get the phone interface to come up, and, assuming you didn't accidentally touch the wrong thing, then and only then can you hang up.  so if the other person is being a weirdo and not hanging up, and your driving, basically, you're screwed.Texting.  OK, so if ytwo people send you a text one after the other, you can't reply to the person who texted you first.  at least, i haven't been able to figure out how and I own ever single kind of computing device known to man and have been a techno geek for well past 2 decades.  If it's hard for me to figure out, it's hard for anyone to figure out (I have 4 teenagers, all have same phone, and every single one of them is unable to solve my problem).I am still awaiting the arrival of my case but without a case or something to bulk it up,, going hand's free with it between your face and shoulder = impossible.  it will just squirt away and crash to the floor but, that is a good description of almost eveyr smart phone so not a big deal.", "Date": "March 5, 2014"}, {"Title": "!Droid Does!", "Author": "JohnPrime95", "ReviewID": "RQQROGCHIMZZQ", "Overall": "5.0", "Content": "I've recieved this phone as a gift for my 18th Birthday and it's my first Droid Phone, it's been about 48 hours to the time I'm making this review and I'm still getting to know what I've got. I'll be honest its bigger than I expected even though I looked at it online and it said it had 5 inch screen; way bigger than my old iPhone 4GS and just a tad smaller than the Galaxy Note II and very Sleek with It's Do-Pont Kevlar and Corning Gorilla Glass (assuming it has that kind of glass). Over all, It's Great for watching videos on youtube and I'm still finding more features on this Sharp Piece of Technology. I'll be with this phone for Months to come. Thank you, Motorola!", "Date": "August 31, 2013"}, {"Title": "Peather S.....", "Author": "Peather", "ReviewID": "R3N77STB0VEFWK", "Overall": "2.0", "Content": "That is perfect cell for me because it is big size . And come  with everything . I need..  compare...  with iPhone 5. No way..I like my new Motorola ultra", "Date": "January 7, 2014"}, {"Title": "Big marketing gimmick", "Author": "Franko", "ReviewID": "R2B61K4EVRG2WC", "Overall": "1.0", "Content": "I had this phone for 1 week and the screen has cracked. It is a super delicate phone. Repairs are very expensive and can only be done by Motorola due to the parts being glued together to make this phone so thin. The gorilla glass and kevlar are complete marketing tools. The goriila glass in the thickness used on this phone provides no real strength benefit. The kevlar does nothing but sound cool. Anyway they suckered me in and now I am stuck with this phone. The battery life is less than desirable. I would look for any other phone before buying this one. Btw- the phone is through my company and they do not carry insurance so I am responsible for damage to the phone, bummer.", "Date": "October 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Motorola DROID ULTRA, Red (Verizon Wireless)", "ImgURL": "NULL", "ProductID": "B00E9WAUKU"}}