{"Reviews": [{"Title": "great phone!", "Author": "Xavier J.", "ReviewID": "R2O8O9TG821OH", "Overall": "5.0", "Content": "I've owned a Samsung phone before this one so I know what to expect. However there are some many great software features that I don't think I could use another smart phone without them. One thing I love is the separate row of numbers on the keyboard. This makes for faster typing and less errors. Having a notification light is such a convenient feature. In all Samsung stepped up its game with this phone.", "Date": "August 5, 2013"}, {"Title": "this should be the base model", "Author": "Johnathan M. Burger", "ReviewID": "R1TK20J66OC6JF", "Overall": "4.0", "Content": "Due to how much space is used by the firmware and junk installed by carriers that can't be removed, this should have been the first version released.Most of the \"features\" are useless, gimmicky and don't really work.Still suffers from the low impedance headphone issue.This is the same phone as the 16 Gb, no other changes were made.", "Date": "June 29, 2013"}, {"Title": "T-Mobile customer", "Author": "Shalisa R \"Shalisa\"", "ReviewID": "R3V58SM7W0LQZ4", "Overall": "5.0", "Content": "i absolutely love this phone. keep in mind i had the T-Mobile MyTouch4G before this. its more advanced to use but its awesome if you're cellphone savvy already. and the smart scroll and no touch features are too cool. the only main thing i don't like about it is that it gets really hot sometimes and drains the battery. quick fix is to restart the phone. not a big deal at all considering all that the phone does.", "Date": "June 4, 2013"}, {"Title": "No Contract, No Commitment, and the Samsung Galaxy S4 is all mine.", "Author": "Buckeye", "ReviewID": "R35NHQ285K946P", "Overall": "5.0", "Content": "This is my first android smart phone ever and I like it so far.  I'm impressed with having come from a Motorola Bag phone to this, and not only that, but Freedom from the Cell Phone Capitalists in the US!  The US is the only country where the cell phone company charges you from both ends, when making a call, and when getting a call.", "Date": "August 14, 2013"}, {"Title": "good", "Author": "Gustavo Felipe Klauck Kern", "ReviewID": "R3M9SNLJ8T43E", "Overall": "5.0", "Content": "I liked it very much, it is very fast and adjusting the screen brightness you can make the battery lasts 13 hours more.", "Date": "October 2, 2013"}, {"Title": "An awesome phone......", "Author": "Jacqueline B.", "ReviewID": "R2HK33J5BQT0SY", "Overall": "4.0", "Content": "I had a Samsung Conquer before I bought this phone, which was very old, but still a good smartphone. Since I was changing cellular networks I decided it was time to update phones too. I had no idea  the excitement and joy I was in for. The phone is quick, has features galore. I do agree that the back casing is flimsy which is the only reason I didn't give it the last star. The camera has crisp clear photos with the ability to use both the front and rear view camera at the same time. I did get 32gb because of the OS space usage the reviews talked about. Bottom line is the phone is awesome  and I definitely would recommend it. I haven't added an otterbox yet but I am for added protection. a previous reviewer told about many other features.", "Date": "March 2, 2014"}, {"Title": "great phone!", "Author": "PMar", "ReviewID": "R27BDFVVZJILX9", "Overall": "4.0", "Content": "It has everything.  Only reason I'm withholding the last star is all the bloatware installed by cell provider (and I know that isn't the phone's fault).  Phone is fast and calls are clear and dependable.  I'll keep it!", "Date": "February 2, 2014"}, {"Title": "Battery life deteriorated rapidly.", "Author": "Old MSgt", "ReviewID": "R122U3NH2FX30H", "Overall": "1.0", "Content": "Nice phone otherwise, however battery life swiftly deteriorated and recharge rate is now dog slow. My use is very light. I've a Hyperion battery on order and will give that a shot, but I should not have to replace what was a perfectly good stock battery three (that's \"THREE\") months ago.I'm not the only victim with this problem. I regret buying the S4 and strongly advise others to avoid it. I've considerable computer, avionics, etc background and this level of \"performance\" is totally unsat. I have to keep this piece of guano connected to a charger to use it for more than a few minutes.If you feel compelled to get one of these, do yourself a favor and get additional batteries. At least they are replaceable, though I'd never buy a phone whose battery was not.A big vertical finger salute to the nice people who chose to defecate this product with unremedied known software and/or hardware defects on innocent customers. Thanks for nothing. I will revile this expensive annoyance to all who will listen that I may save them exasperation. Multi-billion-dollar companies have zero excuse for this conduct.EDIT:I just bought an Otterbox Defender case and modded it to clear the Hyperion battery (both obtained via Amazon) per the instructions on the xda developers forum. Capacity problem now solved.", "Date": "May 27, 2014"}, {"Title": "A great upgrade from my last phone.", "Author": "Jon N.", "ReviewID": "ROGEPS3KQL0DY", "Overall": "4.0", "Content": "I agree with the review written by Johnathan M. Burger re: how much space is used by the firmware and junk installed by carriers that can't be removed.Overall I really dig this phone, it was an upgrade from an HTC Inspire that I'd had for several years. The difference in power and function is like night and day compared to my old phone. Plus, the large viewing screen and light weight even had my wife - an Apple-phile - a bit envious, especially after the iOS7 debacle (although she refuses to give me the satisfaction by admitting it).I recommend this phone, it was worth the money.", "Date": "October 2, 2013"}, {"Title": "Excellent!", "Author": "Jeff Jones", "ReviewID": "R1Y90MDBNZWYGJ", "Overall": "5.0", "Content": "It really seems odd , in a way,  to call it a phone.  It obviously is a phone but it's so much more than that. Like a lot of \"phones\" today it's a pc or a super-pda with a phone,  a high quality camera,  and too much to explain here. For me it works great and is enjoyable to use.", "Date": "August 12, 2013"}, {"Title": "Good", "Author": "Sócrates", "ReviewID": "R2RJX9IAK3WTDH", "Overall": "4.0", "Content": "I'm a iphone guy. Just do not liked the 5 and 5s, so tried a new phone.Has a lot of futures and fast.Will be back to iphone when they make a wider one. Lol", "Date": "November 17, 2013"}, {"Title": "Update Problem", "Author": "aswini", "ReviewID": "R1FENUFWCFL24S", "Overall": "5.0", "Content": "AT&T; and Samsung have released a software update for the Samsung Galaxy S 4 (i337). This software package updates the Baseband version to I337UCUAMF3 .. I Did Not Got This update Still My Phone In : I337UCUAMDL. Please Help Me ..", "Date": "October 19, 2013"}, {"Title": "Eh... I just didn't care for it but you might love it...", "Author": "NLWPS \"Computer User\"", "ReviewID": "RTZ463MU8QFHP", "Overall": "2.0", "Content": "I ordered this with great expectations & after a few days of trying to use it I returned it. I had the HTC EVO 4G LTE which had roughly the same size screen as this thing so perhaps that is what I disliked the most about this thing. I selected this when I came to AT&T; because I'd heard such great things about it but the other line on my phone account  got the LG Optimus Pro & I found I really liked the screen size on the LG. What I didn't like about the LG was the operating system & LG's general lack of updating their past phones. I exchanged this phone for the Samsung Note 3 which should arrive today. This phone seemed to take good pictures. I really liked the removable battery & micro sd card options. I didn't find any of the lagginess issues I've seen mentioned in other reviews of this phone but then I only tried to use it for a few days. I wanted a bigger screen but I would recommend this phone for anyone else that wants a smaller screened device. I tend to use my phone more for the none phone features than for talking on it & when I am talking on it I am usually using either speakerphone or a hands free bluetooth device.", "Date": "October 8, 2013"}, {"Title": "Very good phone but not outstanding.", "Author": "Lachu", "ReviewID": "R2C0UISI56RAHY", "Overall": "4.0", "Content": "I am an iOS user for the past 4 years. I took a major decision in switching over to android.  This phone has ton of features to begin with and compared to Iphone 5. I was desperate to use a little bigger and wider screen envying android users. 5s didn't meet my expectations so I switched to S4. Battery life is decent lasting for a day. The only reason I am giving a 4 star is due to lack of fluid and smooth navigation of OS. I see a touch lag, spinners while launching the android Apps which I haven't experienced in Iphone OS or in their Apps. I am loving the phone with a positive attitude. Camera is good but very slower while processing night shots or in few modes. I hate the processing bar which prevents to take fast pictures. Screen and resolution is gorgeous.", "Date": "October 24, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Samsung Galaxy S4, Black Mist 32GB (AT&T;)", "ImgURL": "NULL", "ProductID": "B00E6FGHAW"}}