{"Reviews": [{"Title": "Poor spec page lead to confusing purchase", "Author": "OPT", "ReviewID": "R3OB5VV6TZ8QEL", "Overall": "1.0", "Content": "This Quad Band world phone looks like a great buy from Samsung, however it is optimized for Latin America not the United States.  As a result there was a great deal of confusion as it can't be properly activated in the US for full speed as it doesn't operate on US based 3G\\4G frequency bands.Worse yet, trying to find the phone on Samsung's site (which automatically goes to the USA side) leads to \"no results found\".  It took a generic web search engine OUTSIDE SAMSUNG and AMAZON to find the model phone and even then it took some additional digging to find out that it is listed exclusively on Samsung's LATIN AMERICA support site and only there do you find out about the frequency discrepancy.Bottom Line:It would great if the title description on Amazon's site was amended to show\"\"Target Market:Latin America\" or\"International 3G ONLY not for US Wireless carriers or users\".", "Date": "February 24, 2014"}, {"Title": "Eurepen charger without adapter. TO BAD", "Author": "Andrés Mendoza", "ReviewID": "R305HSPM3WCO2T", "Overall": "3.0", "Content": "Phones were received with European charger. I can not use in USA or Soth American countries. I`m disappointed, now I have to make an extra expense because you did not incicate in its advertising.", "Date": "February 5, 2014"}, {"Title": "very good product", "Author": "VE-297060 Elio Aponte", "ReviewID": "R20XA1NPGI2Y67", "Overall": "5.0", "Content": "Exellent product, very good phone, this is the number 3 phone i bougth, good signal good reception and much more", "Date": "March 18, 2014"}, {"Title": "This phone is awesome.", "Author": "J. Coffey", "ReviewID": "R34WWOFXER1WCC", "Overall": "5.0", "Content": "I was nervous about swapping the micro SD card from my old phone, it is simple to do. This phone is very user friendly and performs better than expected. Owners manual is readily available online, if I needed a second I'd buy it from here.", "Date": "March 10, 2014"}, {"Title": "Small & Compact", "Author": "Neil J. Taylor", "ReviewID": "R2FFF4MMD5TWTW", "Overall": "5.0", "Content": "Work great and is unlocked too.  Finding a case to fit was a bit more of a challaenge.  Batery life is OK.", "Date": "January 15, 2014"}, {"Title": "Short Battery Life", "Author": "Non PC", "ReviewID": "R11UMFLY3PLKSS", "Overall": "3.0", "Content": "This is my first smart phone and it has more features than I'll ever use.  It has worked well on US and UK phone networks (voice and text only tried).  It was a deal at under $120 in a factory sealed box.  However, the battery life has been an extreme disappointment.  After charging it the first time, the battery lasted 36 hours in standby mode.  When I turned off all unnecessary features and recharged it, the battery lasted 48 hours.  The battery has gone as long as 72 hours -- not the 168+ hours that Samsung advertises.  I'll be getting a new battery (NOT Samsung) tomorrow as this is getting very old.  Maybe there is happiness ahead, just not with the factory supplied battery.", "Date": "May 6, 2014"}, {"Title": "sansumg galaxy young s6310l", "Author": "Fiztgerald R.", "ReviewID": "R3YNSMY5ON9CN", "Overall": "5.0", "Content": "Great cell phone. It came with no problems at all. I recomended it.high quality for the price. big deal.t5hank you", "Date": "March 26, 2014"}, {"Title": "They send blue not silver...", "Author": "A disappointed buyer", "ReviewID": "R3GYM4GNQ7H282", "Overall": "3.0", "Content": "I ordeed this phone since it says silver young s6310l......It is the blue version they sent.....I am so unhappy about this misleading sale...", "Date": "December 17, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 1900 Mhz", "Name": "Samsung Galaxy Young S6310l Unlocked GSM Cell Phone Silver Android Quadband", "ImgURL": "http://ecx.images-amazon.com/images/I/41Pzw6utpNL._SY300_.jpg", "ProductID": "B00EKSG4R6"}}