{"Reviews": [{"Title": "Tough Phone, Poor Mic, O.K. Battery", "Author": "John in N.H.", "ReviewID": "R3HRE1WKP8L7EY", "Overall": "3.0", "Content": "I will say, I've beat up 2 of these phones and they take a licking. Waterproof? Yup!! It is. ( dropped in a 3' stream, 5 mins, was fine)Battery life is OK, not awesome , but 2 days max if you use less than 2-3 hrs total.Texting is pretty easy, if you like text with a flip phone. T9 works ok, mine learned a few words andwas simple...ONE CON...the Microphone for calls/talking is at the Hinge,against your cheek, and you WILL muffle calls!!It makes it IMPOSSIBLE for anyone to hear you if you try to hold it between your cheek/shoulder.!! If you block/lean on this phone during a call they won't hear you. Annoying. It has great volume and clarity, but the above is very annoying. People telling you to repeat yourself is annoying.You have to make a Conscious effort to modify how you hold this phone so folks can hear you, and it Sux!, Also, the side button activates a 'recorder' which will record only the other persons voice, during phone calls if you hit it by mistake.. I never did figure out how to stop that. It is a tough, good phone and it never dropped calls or did anything radically bad. I used mine for 2 yrs and it was always ok and functional, yet annoying enough for me to upgrade as soon as it was possible. I did keep it , however, Because it won't die!! I did have a Backup Assistant issues, but once I found a good Tech Support person(3 tries) it was fixed in 30 seconds.", "Date": "February 3, 2014"}, {"Title": "Great phone w/one BIG EXCEPTION", "Author": "Linda E. Moree", "ReviewID": "R6PKWKTWZMJX5", "Overall": "4.0", "Content": "The only \"con\" to the phone so far is the battery life. I purchased an extended life battery and it only lasts 2 days! My previous phone, the Motorola Barrage, had an extended life battery that lasted a full 7 days! So, that in itself, is a real downer. otherwise, I have no other complaints.", "Date": "March 4, 2014"}, {"Title": "The worst phone I have ever had.", "Author": "Trick", "ReviewID": "R2RARXTYSYDMR8", "Overall": "1.0", "Content": "I am on my third one of these in less than six months. The first one kept loosing time and had the below listed problems. The second one shared the same issues and the screen went blank. The Nuance voice recognition is aweful. It doesn't recognize anything that is said. I did all of the voice mode training and the adapt voice. This did not help at all. Texting is horrible.  It comes up with words that don't exist and there is no way to delete them from the list. I have to verify that each text sends and sometimes I have had to send it three times before it will send without error. The phone has software\\firmware issues. Sometimes whe I open it the screen stays blank then half of the display will show. Then it needs rebooted to work again. It will not update the contact list. Always has an error message. The phone will randomly shut down then will not reconnect with the micro sd card. The camera will not focus unless you change the setting for each picture. It constantly drops calls. The battery lasts 2 day's tops. I bought an extended life battery and still 2 days tops. On the upside the walking counter is pretty accurate and the g'zgear features are pretty cool and you can take it in the water. I would really like to rate it a zero. I can't wait until I can get an upgrade.", "Date": "April 8, 2014"}, {"Title": "Nice phone but won't last", "Author": "C. Scott", "ReviewID": "R11095XMLCICWX", "Overall": "2.0", "Content": "I picked this up for my Dad and it only lasted just over a year.  I will say that he licked the call quality and volume a lot.  Sorry to say the screen started going out when he would open it.  I looked around and it turns out this is a major defect that happens a lot.  I picked up a new Ravine 1 for him on ebay for about $100 and he loves it.  So far no problems.", "Date": "December 31, 2013"}, {"Title": "Casio G'zOne Ravine 2", "Author": "Mike", "ReviewID": "R11SKBCI2JK8S5", "Overall": "5.0", "Content": "This is my 3rd G'zOne in 7 years.  Great phone for my lifestyle and working conditions.  This phone is made to withstand very rough treatment.  I work in a shop that builds and repairs steam locomotives.  We deal with a lot of dust, dirt, and rough environment for electronics.  I have dropped the phone on concrete, got it wet, and dirty.  The phone is not fancy, but it does a good job for what it was designed to do.", "Date": "February 17, 2014"}, {"Title": "Mostly waterproof", "Author": "Dana", "ReviewID": "R3MKGCJVTB577M", "Overall": "3.0", "Content": "Waterproof, or is as long as the battery compartment is closed. Have rinsed it, swam with it, showered with it, rinsed it off after pouring bleach on it, and it was fine. Just don't drop it and also dunk it at the same timel", "Date": "December 6, 2013"}, {"Title": "Love the phone!", "Author": "k0r3n_ooh", "ReviewID": "RLDEK4YIXXEK0", "Overall": "5.0", "Content": "Love the phone. Although i am stumped why they have removed rugged phones in my area. I am in the great northwest and there is nothing but backcountry and people who play and work in that area.", "Date": "March 6, 2014"}, {"Title": "Sturdy and durable", "Author": "Trina L. Tully \"*Trina*\"", "ReviewID": "R1VKKITFBHEZ9M", "Overall": "5.0", "Content": "My husband loved this phone!  He works in construction and doesn't have to worry about having it on the job site.", "Date": "December 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E9W873M"}}