{"Reviews": [{"Title": "Too bad this is the last one", "Author": "Joe Mathews", "ReviewID": "R1AT75KRSU9ZAO", "Overall": "5.0", "Content": "I love my phone. simple. I'm a real bb fan. I know there aren't a bunch of apps and things, but for phone features, I love it. The company is losing because we're in a \"application\" world and there aren't any real exciting apps for bb", "Date": "October 18, 2013"}, {"Title": "LOVE IT!", "Author": "Celeste", "ReviewID": "R1CZFC56LQLX3C", "Overall": "5.0", "Content": "I had a Blackberry Curve about 4 years ago.  When my fiance' decided to put me on his account, I had to switch providers and phones.  Missed the Blackberry ever since!  I cannot get the hang of touch screen typing.  I have to have an actual keyboard.  The Q10 is awesome!  I love it because it has a bigger screen and the keyboard is wonderfully easy to use!  I would recommend this phone to anyone!", "Date": "February 18, 2014"}, {"Title": "Best Blackberry ever!!", "Author": "Wekiva", "ReviewID": "R3SDC6815UXFRX", "Overall": "5.0", "Content": "BB Q10 has it all and more, very simple setup, easy to navigate and professional!! . . . I would recommend BB Q10 without reservation.", "Date": "October 18, 2013"}, {"Title": "Incredible Phone", "Author": "LanceW", "ReviewID": "R11VYVZFQVT34K", "Overall": "5.0", "Content": "I simply can't believe more people don't own this phone; it absolutely rocks!! Blackberry 10 OS is the most stable OS I have ever used.", "Date": "January 6, 2014"}, {"Title": "AWESOME", "Author": "jason manilla", "ReviewID": "R1DTKTJ8K3GWWN", "Overall": "5.0", "Content": "I waited for this phone for almost 2 years. I have been a very proud and happy Blackberry user for 5 years now. The phone is very polished and  a very solid phone. The blackberry 10 OS took some getting use to after using the older BB 6 OS but after a couple days I was very impressed. Very Reliable and I can use it from 5 in the morning until 10  at night with a single charge with heavy texting and the screen brightness turned all the way to maximum. I find this is to be a very serious phone for those who value communication, emailing, and texting. Although the screen is smaller than most phones I tend to use the phone as a phone and not so much a entertainment tool. This phone may not be perfect BUT it is perfect for me! I know there are other phones than may be faster or bigger but I wouldnt choose any other phone than my Q10. Even though the generally population may not appreciate Blackberry I think those who are discriminating as i am  realize that this a solid well made very secure communication tool! I love this phone! Jason Manilla", "Date": "May 9, 2014"}, {"Title": "Get this phone, you won't be disappointed!!!!", "Author": "corey burrough", "ReviewID": "R3KG4FNCSS8O6L", "Overall": "5.0", "Content": "Ok, after months of waiting for Sprint to start carrying this phone and youtube reviews (plus months of waiting for the price to drop), I can honestly say that it was worth waiting for. The browser is lighting fast, the OS is different than before but very easy to use and it feel great in my hand. I got the hang of it in about a day in a half, it gives you a tutorial that shows you all of the how to use it which I thought was really neat. I upgraded the OS last night so I am now able to download and use Android apps which is a huge plus. Plus it was so simple to do, there are plenty of youtube videos that will give you detailed steps. The only some what issue I think people would have is the battery, I performed my own stress test today on my commute to work. For 2 1/2hrs I listened to music, surfed the web, played candy crush and angry birds, texted and used bbm (my all time favorite app). When I made it to work my battery was at about 52%, which isn't bad at all but I know some phones can got a lot but I can always buy a portable battery packs. Other than that, I'm in love with this phone. Hopefully people will take note of it's awesomeness and jump off the Iphone bandwagon. Oh, did I mention that it has 16GB of internal storage and you can add memory card up to 32GB", "Date": "March 20, 2014"}, {"Title": "Great Upgrade!", "Author": "Jeff Lamb", "ReviewID": "RCXD31UMJ0HR8", "Overall": "5.0", "Content": "Had the Blackberry Bold before this purchase.  What a difference in the speed web surfing.  While some of the features of the Bold are not on the Q10, I still love it!!", "Date": "March 8, 2014"}, {"Title": "GREAT phone", "Author": "randy burns", "ReviewID": "R2LA1F7SA1TQB6", "Overall": "5.0", "Content": "Great Blackberry phone. I have had Blackberry for years and this one is by far the best one I have had", "Date": "March 1, 2014"}, {"Title": "Q10 is GREAT", "Author": "W A R", "ReviewID": "R1O5WP6LEFVIVT", "Overall": "5.0", "Content": "I have had blackberrys since the 7230, the first color screen blackberry.I have an iPhone for work. It's ok. I only use it as a second line and for Grindr. Other than that, I'm not in love.The Q10 is a messaging MACHINE. Still the powerhouse I know and love, great keyboard, no issues. Worth every penny and more. My mommy has one too and she likes it a lot more than her 9330, and I find that its better than my 9930.Battery life is FANTASTIC. It lasts all day and more. Much better than last gen BBs.", "Date": "February 21, 2014"}, {"Title": "BlackBerry Q10", "Author": "T-Rob", "ReviewID": "R1XWJ2OLB0HDND", "Overall": "5.0", "Content": "I'm a BlackBerry fan,upgraded to q10.Its wonderful,fast,and loaded with so many features.Battery life is great.Got the best price with Amazon.", "Date": "December 31, 2013"}, {"Title": "Don't care what anyone says...love this Blackberry!", "Author": "Ina", "ReviewID": "R30I38KNLVKUUG", "Overall": "4.0", "Content": "I love my new Blackberry.  It's fast and easy to use.  My only con is that Blackberry took too long to release a new device and I am not sure how long they will be around for support.", "Date": "December 31, 2013"}, {"Title": "Love BB and this pricing", "Author": "Lee", "ReviewID": "R2VG1ZQEN405WT", "Overall": "5.0", "Content": "Took longer then exprcted to get shipped out.  I did buy it right after it was released so there may have been a supply issue.  I was given a long delivery window so it wasn't considered late.  Just being an avid Amazon customer I am used to getting things faster.  It did come with directions to activate it at home but I went to the store anyway.  They had no problem changing it on the account and my upgrade was used properly when purchased.  I saved about $150 compared to the sprint price so can't go wrong there!", "Date": "November 26, 2013"}, {"Title": "Blackberry Q10 - a much newer model than my old phone", "Author": "patinab \"patinab\"", "ReviewID": "R9XLFOAXA6T43", "Overall": "5.0", "Content": "Updated version of Blackberry replaced Curve that I had before.  Its a little harder to use than my old BB but I'm slowly learning how to make all the functions work.  NOT a very technology savvy person so its me that's having to learn to make the phone work -- its not the phone itself.  I've only had it for a couple weeks but so far I really like it!!!!", "Date": "June 1, 2014"}, {"Title": "The best smartphone ever", "Author": "Tõnis", "ReviewID": "R2SG0HES5WBKRL", "Overall": "5.0", "Content": "In addition to the best security and other features I have always expected from my BlackBerry smartphones, the BlackBerry Q10 delivers:1. The best mobile browser in the world over lightning fast 4G/LTE2. Free voice and video calling over BBM3. Remote File Access to my computer when I'm away from home (ie I can access files stored on my computer from my BlackBerry)4. The best voice call quality I have ever heard on a mobile phone5. Excellent battery life with a removable battery so I can bring a spare charged battery with charger and never be stuck with a dead battery", "Date": "May 18, 2014"}, {"Title": "Q10 success", "Author": "V. Sattler \"Depp lover\"", "ReviewID": "R2WDK639ZC0LJW", "Overall": "5.0", "Content": "Bought this phone as an upgrade for my hubby who needs to stay with Blackberry.  He is loving it and has had absolutely no problems with it.  And the price ($.01) was out of this world good!", "Date": "May 12, 2014"}, {"Title": "Not What it used to be!", "Author": "Stanley J White", "ReviewID": "RVM76H68SS6A4", "Overall": "3.0", "Content": "The Blackberry used to be the pinnacle of cell phones. RIM should work on their product to regain that title.", "Date": "April 29, 2014"}, {"Title": "Awesome!", "Author": "backinblackberry", "ReviewID": "R2IYN1BQRAIG6D", "Overall": "5.0", "Content": "I absolutely love this phone. I have had a Blackberry phone before, but a few years ago I switched to a different brand. While I liked that phone, I'm so happy that I decided to switch back to blackberry. The physical keyboard combined with the touch screen is perfect to fit my needs. The phone is a good size, the screen is clear, the battery life seems solid, and the interface is so easy to use. This is a quality product from a quality company.", "Date": "February 18, 2014"}, {"Title": "I Love this phone!!!", "Author": "Octavia Vernon", "ReviewID": "R1BKB1Q133BE8O", "Overall": "5.0", "Content": "love how easy the phone is to navigate I thought I would not like it because it does not have the tracking pad but I love it. It was much cheaper to purchase with a two year agreement on Amazon for $79.99 than from Sprint for $200.00", "Date": "February 13, 2014"}, {"Title": "Great phone", "Author": "April \"Yardy215\"", "ReviewID": "RT8DPLZKRBXFZ", "Overall": "5.0", "Content": "I love this phone because of the keyboard.  I'm old fashion and don't like only touch screen.  It took some getting use to not having a trackpad but worth it.", "Date": "February 12, 2014"}, {"Title": "BB Fanatic!!!!", "Author": "Alexandria", "ReviewID": "R2117CLXKWOHX5", "Overall": "5.0", "Content": "I'm a diehard BB fan and I love the Q10! Its fast powerful AND stylish.  Not alot of apps for it yet, but they're on the way!  Great phone!", "Date": "February 10, 2014"}, {"Title": "**GREAT GREAT PHONE**", "Author": "NT~", "ReviewID": "RKUH00STG769", "Overall": "5.0", "Content": "I have been a faithful blackberry user for nearly 10 years and I was hesitant to get this phone because of all the bad publicity. But I've had it for a few days now & it is unbelievably awesome. There is no learning curve at all; put it in your hands & start using it. It's a slightly different OS as compared to BB 07, but it is 110% better. If this phone had \"Apple\" or \"Samsung\" on it, it would be selling a million devices.The buttons are wonderful & easy to use. Switching between various apps is a breeze, and its download speeds are extremely fast. The screen is crystal clear, as is the phone sound quality. I am not a \"candy crush\" or \"instagram\" person. The only thing I really miss about my old Blackberry is the green blinking LED service light, im not sure why the BB10 took this feature away. I also hope to see Netflix added sometime in the future. These are things they could always add as updates sometime down the line (hopefully). GO OUT AND GET THIS PHONE.", "Date": "January 31, 2014"}, {"Title": "Met my expectations", "Author": "CYNTHIA THAMES", "ReviewID": "R2HC0MMY9UD6Y2", "Overall": "4.0", "Content": "The new design of the keyboard and the size much better that the curve that I was using. My only wish to date would be; to make a phone call by just starting to push the numbers on the keyboard.", "Date": "January 20, 2014"}, {"Title": "The best for the busy person!", "Author": "Ortodontic", "ReviewID": "RY1SJLXU0QRHP", "Overall": "5.0", "Content": "I was in the iPhone world, I became BB user 3 months ago with Z10, now I bought this Q10 and its better by far.", "Date": "December 9, 2013"}, {"Title": "Wanted to Love It", "Author": "Reesiecup", "ReviewID": "R3M27MLZVR29KA", "Overall": "2.0", "Content": "I fell in love with the blackberry bold 9650 several years ago and have been looking for a worthy replacement(but with a touch screen and qwerty keyboard). I've been waiting 2 years for blackberry to come out with a phone that has it all. I was hoping the Q10 would be it. Though I like the form factor and design of the phone, I must point out that it's greatly lacking in features that seem to come standard on other smartphones. Call quality is decent, web surfing is quick enough, and everything else is just ok. Though I'm not a heavy user battery life is very important to me. Unfortunately the battery life on the Q10 is horrible. I can't get through 4 hours without significant battery drain (even after trying all of the battery saving techniques recommended for this device). The great price on Amazon prompted me to buy the phone and I'm glad I did not pay more than $50, as it's not worth the price to me. I would have been extremely upset had I paid more. I was really hoping to get a new phone that has everything I need, but I'm sad to say the Q10 must go back.", "Date": "December 18, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "BlackBerry Q10, Black 16GB (Sprint)", "ImgURL": "NULL", "ProductID": "B00EZW9H1C"}}