{"Reviews": [{"Title": "Solid Low or Mid Level Android Smartphone w/ Perks", "Author": "ashertopia", "ReviewID": "R8TJA8786GIQ5", "Overall": "4.0", "Content": "There are a ton of low to mid-range Android Smartphones out there and to set yourself apart you've got to have something new, different and valuable. Kyocera's Hydro Elite succeeds because of one killer feature. It is frakkin waterproof! Everything else is pretty average.Pros:+ Waterproof (IPX7) up to 3 feet for 30 minutes with NO EXTRA plugs or cases (I tried this with great trepidation and dropped it in a cup of water - I'll post a video later of when I did this at a restaurant; oh the poor waitress! Hilarious! - and pulled it out after a minute with no issues. You will want to blow out the ports, but it worked straight through the water!+ Android 4.1.2 (no news yet on moving to KitKat)+ 720p display is nice indoors+ Dual-core 1.5GHz Qualcomm Snapdragon MSM8960 is right in line with most Android phones+ 4.3 inch display is as big as a Droid Razr or Lumia 928 (see my pictures above)+ Sized almost exactly like an iPhone 5 which is a pretty comfortable one-handed size for most people (does not fit iPhone cases; I tried!)+ Android starter mode for new users (or users with poor eyesight as the icons are bigger and havs a simpler interface)+ No speakers; this phone uses a type of sonic vibration that our ears pick up as sound but isn't actually a speaker (hence no need to plug the speaker when wet as there is no speaker)+ Verizon's LTE network is very fast and has consistently great coverage+ FREE with 2yr upgrade or activationCons:- Bloatware from Verizon can't be deleted or hidden or disabled. One terrible example of this is that the NFL Mobile app that comes preloaded is outdated so you actually have to install another NFL Mobile app. You end up with two in your app drawer even though only one works. Terrible.)- Memory starts at 16GB, but after system and bloatware you get 8.6GB usable- Android 4.1.2 is two versions behind the newest and low or mid range phones tend to not get updated- 8 MP camera is average MP and low end software. Your pics will come out less vibrant, less in focus, and lower quality than other 8 MP phones. It's about the lense and the software and Kyocera didn't put much in to this- Screen is terrible outside (like a lot of Android devices) and worse than others (see pics)Conclusion: this is a solid low or mid-level phone with low end technical specs but at the price is a pretty good deal. This is for a cost conscious parent or new Smartphone user who wants the protection of waterproof and the functionality that comes with a free Android phone.", "Date": "November 25, 2013"}, {"Title": "battery life too short", "Author": "Cathe Fein Olson \"So many books, not enough time\"", "ReviewID": "R2AL9N7YVLO7C0", "Overall": "3.0", "Content": "I received this phone to review. I am a Verizon customer but have never used a smart phone and figured this would be a good way to find out if it was worth the $30/month extra charge to have one. I called Verizon to switch my account over to this phone, but since there was no SIM card in the box I was unable to activate it. However, I was able to use the other features, such as connect to the Internet, access my email, and link to my Kindle ebook via Wi-Fi so I was pleased with that. I find it hard to type on the tiny keyboard but since I have not used other phones I can't really compare it and assume they are all like that. I do love the slim size of the phone. I'm happy with the graphics and clarity in indoor light. I also like the photos this phone takes. My main complaint and why I probably won't bother paying extra money to switch from my old phone to this one is that the battery life is so short. I'm not even using this as a phone and it died in less than a day. I'd have to carry a charger around with me if I needed to rely on this phone. Again, maybe all smart phones are like that but this one doesn't have me sold.", "Date": "November 12, 2013"}, {"Title": "Don't waste your money", "Author": "James", "ReviewID": "R34HQTBCN5Z1YA", "Overall": "1.0", "Content": "I will never buy another kyocera product for as long as I live. I bought this phone for it's water resistance which I haven't really tested but also have no problems with. My issues are the fact that if you are using head phones with the phone the phone will automatically reduce your volume to 50% after a set period of time. After spending an hour on the phone with two different tech supports, the first from verison and the second from kyocera, I was informed that this is a feature that cannot be changed. Another issue I have is the battery life. By itself the battery life is probably pretty good, but with a dozen or so built in applications like facebook, slacker radio, nfl, youtube, google+, amazon, google play store, amazon appstore and many others starting themselves up every ten seconds or so my batter will lose about a 20% charge in 15 minutes. You can sit there and constantly kill these applications or download task or app killers but they wont work. I have other issues with the phone but I am a very disgruntled customer and just listing some issues I have with this phone is making me angry. I honestly can't believe that people gave this phone positive reviews without being paid to do so.", "Date": "December 3, 2013"}, {"Title": "There Are Better Options Available", "Author": "SevereWX", "ReviewID": "R2IDDRM88Q1AUM", "Overall": "3.0", "Content": "The Kyocera Hydro Elite looked like it had a lot of potential, but it seems to fall short of greatness and land squarely into the mediocre category. I really was hoping for something much better out of this smartphone, but I'm left feeling \"meh\", which is quite unfortunate.Pros:** Small - Easy to hold and easy to carry.** Water resistant.** Stylish and simple design.Cons:** Slightly below average battery life. Can't even make it through an 8 hour work day without needing recharged.** Low volume: Not loud enough to hear clearly in anything but quiet settings. Slightly muffled sounding too.** Overheats: Not good for any game apps. This thing heats up so hot the touchscreen become uncomfortable to touch and the display starts flickering.Just Okay:** Performance - not the fastest, but not sluggish enough to ruin your day either.** Memory size - add on a micro-SD card and you're good to go.** Screen is like most others, impossible to see in sunlight and has horrible glare.** Back cover just snaps on, doesn't feel very secure. Not sure how this affects it's water resistance, and I'm not dunking it to find out.It is my opinion that this might be a good starter phone if provided completely for free by the carrier, but I wouldn't spring for one otherwise.", "Date": "October 28, 2013"}, {"Title": "Buy it for the waterproof feature.", "Author": "M. Hertzler", "ReviewID": "R1586BT7F2QXT", "Overall": "4.0", "Content": "Let's be honest, this phone's big selling point is the fact that it can withstand being dropped in water, being splashed in the shower or a rainstorm and can handle a quick plunge into a toilet. For this reason alone, buy it.I am a longtime iPhone user. The Kyocera Hydro Elite arrived in a nice black box with red interior. Included in the box: Kyocera Hydro Elite C6750 smartphone, 2000mAh battery, wall charger, microUSB cable, and user guides. All of the pieces were packed nicely and easy to locate. I took out the phone, installed the battery and plugged it in to get going.Having an iPhone for so long, there was some trial and error with turning it on, setting it up and getting ready to go. The size is very comparable to the iPhone 5, as is the weight. The curvy corners and textured, matte back are nice touches and make it easier to hold on to than the sleek, somewhat slippery iPhone. I worry about how dirty and grimy it will become in those back grooves though.The Kyocera's screen is bigger than the iPhone 5's. it is bright and easy to read, the graphics are flashy and the keyboard is simple to use. I am not impressed with the camera and the videos are kind of dark. The call quality is just ok. I don't use my phone for calls all that much, ironically, but I would be happier with less muffled sounds. I am partial to Apple, but my Android software experience is a good one.With all this said, I will go back to the main point. This is a mid-level smart phone with all the bells and whistles.... AND it won't die when accidentally dropped into the toilet.", "Date": "October 29, 2013"}, {"Title": "One woman's quest to escape the tyranny of Apple...", "Author": "Susan Tunis", "ReviewID": "R3AJGXL8T1U8I8", "Overall": "3.0", "Content": "While my computer has always been a PC, when it comes to devices, I've been a faithful Apple devotee.  iPhones, iPads, accessories--it gets expensive!  Lately, I feel that my iPhone, in particular, is a money suck.  (I've had two stolen, had to pay to replace one out of pocket, am now paying steeply for theft insurance, and the speaker on the new phone is currently broken and needs replacement.  Yeesh!)  I have my reasons for sticking with Apple, but the primary one is comfort and familiarity with the Apple operating system.  My level of annoyance with Apple is such that at this point I'm really interested in investigating non-Apple products that may be better and/or less costly.  Therefore, I positively jumped at the chance to test and review this Kyocera Hydro Elite Verizon cell phone.Speaking with a techno-geek pal, he offered some good advice--namely that I separate out the features and qualities that were specific to this Kyocera phone, versus those endemic to the Android environment.  So, let's start with the Kyocera features.  The same techno-geek pal picked this little phone up and said, \"It's thin and light; feels cheap.\"  I picked it up and thought, \"Wow, it's thin and light.\"  I guess it's all a matter of perspective, but there's nothing about this phone that feels \"cheap\" to me.  It's got a sleek, glossy black look.  In size, it's about the same width as my iPhone, slightly thinner, and less that .5 inch longer--though the screen is a little bit bigger than the size difference would indicate due to usable space.So, I have no problem with the look and feel of the Kyocera Hydro Elite, but I do have a significant problem with one of its features: the sound quality.  Whether using headphones or speaker, there's just not enough volume.  Or perhaps I should say, there's JUST enough volume most of the time.  If I put the phone's volume on its maximum setting, I can hear okay in most reasonably quiet environments, but that doesn't help me in a noisy, crowded room, on a busy city street, or heaven forbid, on public transportation.  I shouldn't have to listen at the phone's highest volume, either.  If I did that on my iPhone, I'd blow my eardrums out.  This goes for phone conversations and for listening to music or audiobooks (which I do a lot).  Out of everything I'll discuss below, as far as I'm concerned, this is the phone's fatal flaw.  What is a phone for, if not to hear conversations?This particular is phone is supposedly hardened against environmental damage, like being immersed briefly in water, getting gritty in dirt and sand, etc.  I declined to test these claims.  However, for a girl who talks in the bathtub regularly, it's not the worst feature to have in a phone.  I've never dunked a phone, but who am I kidding?  It's only a matter of time.  Let's give Kyocera the benefit of the doubt on this one.Now let's talk about my main area of interest:  Android vs. Apple.  I'm truly sorry to report that, for me, Apple continues to be the hands-down winner.  The operating system is  just more intuitive, efficient, and even aesthetically pleasing--despite Apple's annoying and ridiculous redesigns.  Most of the apps I use are available in both environments, and in rare cases they're even better in the Android environment (Audible was one example), but those are the exceptions that prove the  rule.  Perhaps I'm just so indoctrinated to Apple, I can't change, but I'm both willing and anxious to make a switch at this point, and I still think the Apple products are better at most things.Two notable standouts in the Android phone were the voice recognition, which was significantly better than Apple's and typing on the phone's keyboard.  The same techno-geek taught me this, bless his geeky soul.  Rather than peck out each letter, if you sort of trail your finger from key to key without lifting it, the phone guesses what you intend to type.  In my tests, it guessed correctly an astonishing 100% of the time!  Is it faster?  I have no idea.  But it was really cool!Voice recognition comes into play with Siri on my iPhone.  Unlike some people, I consult with Siri constantly.  She's my friend.  I find myself in unfamiliar surroundings frequently, and she tells me where to find food, post offices, dry cleaners, etc., as well as random facts, the score of the Redskins game, and much, much more.  The Android phone has nothing to compare to Siri's AI sophistication.  I was intrigued to see that there's a Google feature that was at least attempting to compete.  From an easily accessed Google screen, if I say, \"Okay Google,\" I can put my query to the machine verbally.  It'll do basic web searches, tell me the weather, and access other data from my phone, but as noted previously, it can't begin to compete with Siri's sophistication and, well, personality.  Google doesn't tell jokes.  Though that does remind me of one more significant benefit of this Android phone--Google, and all that it brings to the party, is far more smoothly integrated into the phone's functionality.  It's really nice.As you can see, it's a mixed bag, and I'm just not won over to Android yet, but I can see benefits.  I think it's worthwhile diversifying away from Apple's over-priced monopoly on my life, so I plan to continue exploring Android devices and keeping as open a mind as possible.", "Date": "November 30, 2013"}, {"Title": "Waterproof feature is one of it best qualities", "Author": "BMAR", "ReviewID": "R2LZQ1FN3XC5DK", "Overall": "4.0", "Content": "This is an average smart phone with average battery life.  The size is comparable to most current smart phones, including the iPhone.  Having been a previous Android user, the set up was easy and the learning curve not to steep. The phone has a sleek black design that is attractive and is relatively lightweight for its size.  The biggest selling point for this phone is that it is waterproof.  Having nearly ruined a phone more than once in the winter by dropping in snow, the waterproof casing alone is enough to warrant a good rating.Drawbacks are that the battery life is not super long and the sound could be improved to be clearer.  Otherwise a nice option for a smart phone with extra security of being waterproof.", "Date": "November 27, 2013"}, {"Title": "Nice little phone", "Author": "Karla Cook", "ReviewID": "R14KHJZVTHNHRL", "Overall": "4.0", "Content": "I've never had a top-of-the-line phone, but I don't think this is it. That being said, it does seem to be a nice little phone. It is thin and sleek... nice to carry around. The screen is responsive with very sharp graphics. I found it easy to use. It's supposed to be water resistant, but I chose to not deliberately test that feature! Just mentally filed it away as \"good to know.\"", "Date": "November 27, 2013"}, {"Title": "If signing up for Verizon, this is your best pick for a free Android phone", "Author": "Mad Max", "ReviewID": "R23RE6VSEGXAOI", "Overall": "5.0", "Content": "Compared to Galaxy or iPhone, I would give this an average rating (maybe 3 stars).But as a free phone (or 1¢ phone) for your Verizon plan, this is a slam dunk great deal.Kyocera makes a solid phone. Durable, can sustain being dropped, fairly intuitive.Obviously the big feature is water resistance (*NOT* water-proof). You can't go diving with this or anything like that. But if you spill some coffee or water on it, if it's dropped in a puddle, no big deal. Very neat feature.If you're undecided about operating system, do yourself a HUGE favor and get an Android phone like this one. It has way more aps, way more features, better browsing, etc, than Windows or any other operating systems.Speakers are better than average. Screen size better than average. If you've got a $100 budget for a new phone, check out Samsung Galaxy 3, the Note 2, or you might even catch the Samsung Galaxy Mega on sale. But for a free phone with plan, this is one of the best you will find.", "Date": "November 27, 2013"}, {"Title": "If you need the water resistant feature, this is a good device to own", "Author": "R.Suarez \"R-Suarez-\"", "ReviewID": "R1D31PFRUNPR4P", "Overall": "3.0", "Content": "The selling point of the Kyocera Hydro Elite is pretty much explained in its name, it is a water resistant Smartphone. I can think of several scenarios in which this would be a welcomed feature, being in a pool or at the beach, carrying a Smartphone is always a concern as those places besides being humid, are potentially unsafe for an average Smartphone. Even when not in those places there is always the risk of dropping it into the toilet. So if are constantly in a situation like the ones mentioned before, this might be the phone for you. The Hydro Elite does look good, it has a 4.3 inch screen (slightly larger than that on the iPhone 5), it feels very light and the textured back of the phone makes it feel safe in your hand, it is easier to grasp. Coming from an iPhone 4 and then an iPhone 5, this was quite the change, despite Android being generally acclaimed as the better Operating System, I had never used it before so it took me some time to get used to the navigation in this phone. I found some slight problems with the touch screen, at first I thought it was me trying to get used to the phone, but then I found myself doing multiple swipes so the Hydro Elite would respond. This may not sound that bad but I thought it was worth mentioning it happened. The quality of the pictures is above average, exteriors look great both in picture and video, but it suffers from the same evil of most HD recording devices, when using it for interior shots/videos, the resulting photos/videos are not really that good but dark and bland. So after all those first impressions it came down to using it, I am sorry to say I was not impressed with this phone. For starters, if you are a Smartphone heavy user, you will immediately notice how hot this gets after playing with it for a while. While I will admit the heat is not as severe as to burn one's hands, heating is never good for this type of devices. This leads me to the second issue I found, while I am familiar with Smartphones and their short battery life, the Hydro Elite is just ridiculous in regards to that, not even half a day passed without having to recharge the battery (and I used to complain about the iPhone5) So again, if you plan on using it a lot, make sure you get additional chargers for your car, office and/or travel, you will need them. I will say that more than the fact that this was a water resistant phone, I was excited to see and use a device running on Android, after testing the Hydro Elite, Apple devices are better in my humble opinion. Doing some research I found out that the Android version running on this device is also an old one, which may not necessarily be a bad thing but for a brand new phone it was kind of disappointing. Bottom line, if you need the water resistant feature this is a good device to own, I am sure the advantage that will bring will balance the inconveniences I described above. If the water resistant feature is all the same to you, there are definitely better devices out there in the same price range.", "Date": "November 26, 2013"}, {"Title": "Solid Performance With a Few Issues", "Author": "Bradford Schmidt", "ReviewID": "R16WB8WYJDWGCL", "Overall": "4.0", "Content": "I've had a lot of Android phones, and while this isn't the very best, there are things about it I like more than any others I've had.To begin with, form factor is excellent. Compared to my Galaxy SIII, it's narrower - but that makes it far easier to hold and text one-handed - something I'm fond of doing. The back of the phone is also nicely textured, minimizing the chances I'll drop it (I've, um, dropped my GSIII due to it's slick and sexy back).Verizon bloatware is extreme though - and some of it caused a major problem for me until I updated it. One of the apps was failing and throwing error after error message (on screen, too - not some hidden file) that could not be cleared. Like I said, once I updated it, the problem stopped - but it should be noted that Verizon was NO HELP fixing this at all - they were utterly clueless about this phone. And once that was resolved, I was still stuck with a bunch of crappy software I didn't want and couldn't delete which is extremely irritating to me. Sadly, it's all too common these days.The screen is quite good when viewed head on, though it does lose some of it's color accuracy when viewed off-axis. Not a problem for me, but it may be an issue. It's quite bright though, and colors are strong, if a bit on the cool side. The high resolution in a smaller overall screen size may make for slightly smaller type, but it's also sharper than on my GSIII thanks to the smaller pixels. The glass is not up to the quality on my GSIII though - in what way is hard to explain, but it just never feels as smooth and clean. I had no overt issues with it however, and it cleaned up well and suffered no scratches during my time using it.Although the dual-core 1.5GHz Snapdragon chip is slightly underpowered compared to today's fastest phones, I found no issues starting up, opening apps, and running multiple apps. I had no problems with any of the apps I downloaded.Sound is better than I expected. Rather than using an open speaker port, the Hydro Elite transmits sound through the glass on the phone. I found no real downside here, and you actually CAN hear the thing if you're wearing a motorcycle helmet, or hat, or whatever. Very neat bit, that. External speakers for media are, of course, crap - but that's true of every phone I've ever heard, so take it with a grain of salt. Earphone volume, though, is extremely low. While not an issue with headphones, I can't come close to getting enough output for the Aux-in in my car (a total drag) to deliver music to my (admittedly on the loud side) liking.Kyocera runs a skinned version of Android (as almost ever phone on the market does), though I find it less intrusive than the interface on my GSIII. Odd, perhaps, as the GSIII has more bells and whistles, but then I don't really like gimicky features - I just want a phone that works and works well, which the Kyocera does (pretty much).Batter life, which I thought was a bit short, is actually longer than on my GSIII, so no complaints there. Finding spares is a bear though; I couldn't find any vendors that supplied them, so if you like to carry a spare, you're out of luck right now.The 8 MP camera is actually quite good - sometimes. Settings offerings are about average, with different focus, white balance and shooting modes (including color effect modes and HDR), and it often takes beautiful pictures. However, in tricky lighting situations (even mildly), it's totally hit and miss. While shooting a closeup of some soap I recently made, it kept adding an odd purple tinge in the middle of the shot (no, it wasn't a lens flare or smear). Irritating. The front-facing camera is fine - about average in class. One quick note here: you CAN turn off the camera click, which you can't (stock) on my GSIII. Yay Kyocera.Video quality is on par with stills, which is to say that sometimes it's quite good, but in any tricky lighting you're going to be gambling.Then there's the waterproof bit, which is really the meat and potatoes. In a work: excellent. I can't tell you how much I like not worrying about spilling a drink on the table, or leaving it out on a chair in the rain. Plus, it's fun to throw it in a sink of water in front of unsuspecting friends and family. I have submerged it, poured water all over it, even used it in the shower, and have had NO ill-effects. Plus, the chunkiness of the thing makes it feel sturdy enough that I feel far more secure carrying it than I do my GSIII.Frankly, the decision about which to carry is MUCH harder than I thought it would be. I really, really love a lot about this phone - in partiuclar, of course, it's ability to shower with me. But the occasional camera issues and low-level headphone output have me jumping back to my GSIII (particularly if I'm driving anywhere), which is where I'll probably stay. For now.A solid mid-range phone with a fantastic feature: it doubles as a shower buddy!", "Date": "November 26, 2013"}, {"Title": "Capable, but not stellar", "Author": "Dave Astle", "ReviewID": "R1O69WX59I9HOI", "Overall": "3.0", "Content": "I picked this up because my stepson needed a phone, and the specs looked decent for a starter smartphone. Although, being obtained through Vine, it did not come with a SIM card, obtaining one was a matter of a brief visit to my local Verizon store.Overall, this is a capable, but not stellar phone. It is powered by a Snapdragon processor which is now a couple of generations old, but it is still quite powerful. It also ships with Jellybean, albeit an earlier release.The phone itself feels rather flimsy, but perhaps it's just suffering by comparison to my HTC One. I do like that it's water resistant. I've been hesitant to fully test this feature out, but since it's being used by a 13-year old, it gives me some confidence that it'll survive a little abuse.if you're looking for a phone that's nearly free (with upgrade or new customer pricing), this is a decent choice, but if you can afford to spend a little bit, there are much better alternatives.", "Date": "November 26, 2013"}, {"Title": "Misses the mark in a crowded space", "Author": "Tim E Robertson \"Publisher MyMac\"", "ReviewID": "R2WN6Q77IYU8ER", "Overall": "3.0", "Content": "The Hydro Elite is a very decent phone for the price. To be honest, I never actually dared to submerge it in water. That being said, as an Android Phone on Verizon, it was only okay on call quality, tested in both West Michigan as well as Chicago. Voice clarity was sub-par next to other, more expensive Android phones (HTC Plus).Responsiveness of the screen was also sub-par. Many faux-swipes. Multiple touches were needed at times.Battery life is not great. I average about seven hours before in goes dark. Not great, not terrible. Have a charger handy.The OS is Jelly Bean 4.1.2, which over a year old, but still a good OS.The camera on the phone is an 8MP, but the photos it takes are sub-par to just okay. In really bright sunlight, it's fine. In doors? Not so much. Grainy would be the word I would use.Video capture? See above.I do like the feel of the phone. The textured back makes it less likely to slip out of your hand. It is also easy to open the back if you have to insert a SIM or change the battery.One oddity. This phone runs very hot when you try to play games on it. If you are looking for a good gaming phone, this is not it. Star Wars Angry Birds played decently for ten minutes, then the phone got too warm. And higher graphical games? Don't bother. Most are just too much for this phone.There are quite a few bundled apps, but most are garbage and you won't use even half of them. That's what the Google Play store is for. Thankfully, you can delete the garbage apps you don't want.All in all, I would only recommend this phone if you spend a lot of time on the water and want a phone that can withstand some liquid in short bursts. Again, i didn't test that part, but it seems to be the main selling point.For the price, you an get a MUCH better phone from HTC or Nokia.", "Date": "November 15, 2013"}, {"Title": "Keeping Perspective", "Author": "Jeffrey Borden \"Pastor\"", "ReviewID": "RFHHB9XW3JMRN", "Overall": "4.0", "Content": "I've had the opportunity to spend some time with this phone now and I think the most important thing I've gleaned is that perspective is key. This phone is good at what it does for what it is. I think one of the mistakes some folks might be making about this Kyocera Hydro Elite is wrongfully comparing it to some of the other \"super phones\" on the market available today. Truthfully, bigger and faster isn't always better. Sometimes you need a device, in this case a phone, to do a job and nothing more. This KHE does that and more.The phone is ergonomic, slim, thin, lightweight. It rides well in the pocket and is very easy to use with one hand. That cannot be said for my Samsung Galaxy S3. With my S3 in its Otter Box case it is slightly bulky and not so easy to use with one hand. Win goes to the KHE on this measurement. Surely my S3 has more power and a bigger screen, but as I mentioned, the Hydro Elite connects well to the www and handles my favorite apps with ease (google apps, facebook, twitter, instagram, navigator, dropbox, a few newsreaders, and a couple specialty apps. I didn't notice any measurable difference between the way my S3 handles those apps and the KHE runs them. I've gotten spoiled with the bigger screen of my S3, but that's a trade off as I mentioned earlier.The waterproof feature of the KHE is a unique and noteworthy feature of this smartphone. While I did not have the boldness to test this, I've read the reviews of several owners who have and they all reported positive outcome.This is a good phone. It performs well for what it is and the market for which it was developed. Buy with confidence.", "Date": "November 13, 2013"}, {"Title": "You Can Do Better", "Author": "Krystal Hillsman \"genie\"", "ReviewID": "R2JD7RV6LBNF16", "Overall": "3.0", "Content": "So first off: The Good:- it has an attractive & lightweight design- it's easy to set-up and use- it's water resistant.The Not-So-Good:- call quality: everything sounds a little muffled like it's coming from far away- the speakers don't get very loud and they have a \"teeny\" sound to them- it's kind of sluggish performance-wise compared to other smartphone models out thereThe Bad:- battery life. These days I expect a smartphone to be able to last all day. This was just doing what I normally do, light gaming during a break at work, email, light internet use. Lasted from about 8 am to 6 on a full charge. I'm used to my phones still having juice at the end if the day.Honestly, for the price, I really think you can do a lot better. And you can always buy a waterproof case for your current phone if it's that important to you. Of you know, just not take your phone to the bathroom so much. ;)", "Date": "November 12, 2013"}, {"Title": "Standard cell phone choice if the price is right", "Author": "Miss Barbara \"Barbara\"", "ReviewID": "RVD14CRP30SXA", "Overall": "3.0", "Content": "I chose the Kyocera Hydro Elite (Verizon Wireless) Cell Phone mainly for the selling point of it being waterproof.  My brother and I do a lot of surf fishing and many a cell phone has gone to cell phone heaven as a result.  This one has not yet ended up in the Pacific but it will and when that happens I'll include an update in this review.Otherwise the phone seems run-of-the-mill.  The battery seems to run dry quicker than my last phone and the volume can't be turned up high enough for me to hear comfortably.  I received this phone with no SIM card so there was a lot of rigmarole in having to go to the Verizon store and getting things changed over but they were very nice and helpful to this old gal.The screen, like so many others, is hard to see in direct sunlight.  You think there's be a fix for that in this day and age.  All in all I think it's a standard cell phone choice if the price is right.", "Date": "November 7, 2013"}, {"Title": "Smart looking, lightweight, and convenient size", "Author": "The Movie Man \"tenebre89\"", "ReviewID": "R601CRPJWX1TL", "Overall": "2.0", "Content": "This phone was received through Amazon's Vine Program and, like other users, I was disappointed that it did not come with the required SIM card. You cannot use the phone immediately. You must first set up an account with Verizon.As size goes, it's smaller than several smart phones on the market. Though you sacrifice screen size, you gain convenience since it is easier to carry, fit into a pocket, and just use for simple phone calls. The waterproof feature is appreciated, since I'm a coffee drinker and there is usually a cup of coffee close at hand. I'm happy to know that if the phone gets wet, it won't die.The design is sleek and attractive. I already have a cell phone and an account with Verizon, but I have yet to switch service to the Kyocera. So my review, unfortunately, is based on appearance and features, rather than actual use. That SIM card should have been included.", "Date": "October 28, 2013"}, {"Title": "water resistant", "Author": "Michael L. Knapp", "ReviewID": "R46PQO7OUVWLC", "Overall": "4.0", "Content": "As far as it's functions go it's pretty standard & certainly not as good as an iPhone. It's specialized listening system does make it a bit better to hear in a noisy environment. I was at a concert the other day & I could sort of hear. The one thing that makes this phone worthwhile is it water resistance. If you spend a lot of time near water & you are prone to accidentally letting your phone end up immersed in water this phone is for you. The other day I was using the camera & it was accidentally dropped in a hot tub. After I fished it out it was still good as new. A lot of people's phones end up in the toilet & I'm sure it would survive that as well, provided you weren't too squeamish to fish it out. All in all if you are a watersport enthusiast or happen to be clumsy around a toilet or a sink this is your phone. If you just need a good smartphone you would probably be better off choosing a different phone.", "Date": "October 28, 2013"}, {"Title": "MY SON HAD TO GIVE UP HIS iPHONE FOR WORK, HE GOT THE KYOCERA HYDRO ELITE", "Author": "Robin Simmons", "ReviewID": "R38JPR1S277M8Q", "Overall": "5.0", "Content": "For his new job at a tech-company, our son had to give up his iPhone since his work specifically required Android related concerns and applications. I suggested the Kyocera Hydro Elite as an excellent replacement.  So far, he is very happy with the choice.  He says the sound of phone conversations is clearer even in crowded train stations and the big screen (larger than his iPhone) is bright and super sharp.  Memory can be expanded and the device is waterproof up to 30 minutes in 3 meters (great for underwater video and photos!).  The latter is a huge plus for him.  Camera is 8 MB (most smartphone cameras are 5). He says the downloads are very fast and it's easy to wirelessly share files (photos and music). Web navigation is quick and easy and there's no problem running multiple apps!  The 4G Lite is many times faster than 3G (check the specs) and the 1.5GHZ dual-core processor and Android 4.1 (Jelly Bean) is state of the art (as of this writing).  Also the device has wireless recharge.  Recommended.", "Date": "October 23, 2013"}, {"Title": "Good Phone With A Few Negative Behaviors", "Author": "Matthew K. Morgan", "ReviewID": "R1VZVEQY22R9Z3", "Overall": "3.0", "Content": "I have been a Verizon customer for several years and I had a first generation Droid for many of those years. I have used phones from Samsung, Motorola, LG and Nokia but up until this point I have never used a Kyocera phone. I was interested in trying the Hydro Elite, and so far my experience has been middle-of-the-road - there are some areas for improvement.First things first - I received the phone through the Vine program and it did NOT come with the SIM card. This is probably because it was not a purchased phone but is an evaluation handset. The phone does not come with service right out of the box, it has to be activated and a SIM card is needed for that. People buying a service plan should get a card. People (like me) who are already on Verizon and already have a smart phone will have a card in their old phones which can be used in this new phone. The SIM card itself does not make the card work, it needs the data written on it. Verizon customers (new and existing) will get what they need to activate this phone, so if you buy this phone and subscribe to a plan you'll have a card in it when it arrives.I took the SIM card out of my current phone, popped it into the Hydro Elite and powered it on. It immediately connected to the network, acquired my phone number and activated itself. Within just a couple of minutes, it was ready to go.The Hydro Elite is a petite Android phone, smaller than most other smart phones I have seen. Very curvy and smooth, it is similar in looks to an iPhone, but it's actually an Android-based offering. It's a tight and solid little device, built to handle a little moisture and some jostling.I particularly like the brightness and clarity of the screen. In spite of being slightly smaller than other smart phones I have used, the screen is very clear and crisp.One of the main complaints I have seen regarding this phone is about call quality. I think the call clarity is acceptable although I have used clearer and better-sounding hand sets in the past. It has the very slight sound of talking in a tunnel or in a can, though I have to look for this in order to really mind it much. The volume is fine too and can be adjusted. That all said, the sound quality when the speaker phone is used is mediocre at best.My first issue occurred when I tried to connect to my wireless network. It located it, allowed me to put in my security key, and then constantly insisted the network was out of range - even when I was three feet from the router. I deleted the connection, put it in again and the problem is gone. I suspect I entered the key in incorrectly, but I never received a message as such.The next issue I ran into involves the Verizon stuff installed on it. Once I connected to the wireless network I get a very persistent message that appears about Verizon's location service sending a large number of SMS messages. I have not yet figured out the silver bullet to make this stop and it interferes with everything I try to do on this phone. I am sure there is some way to make this quit happening but I have not found it yet. I don't care if the application sends SMS data or not - I just don't want to hear about it every 10-15 seconds (yes, it's that persistent). This is not Kyocera's fault - this is Verizon's issue, and for me this is absolutely unacceptable.I use my phone in my car every day and my car is set up to allow Bluetooth phones to connect to it for voice commands and hands-free operation. Connecting the Hydro Elite was very simple and I had no difficulty connecting the two. However, one thing that did not happen was that the phone book never downloaded and I could not call anyone by voice command. This is an inconvenience and is probably not entirely Kyocera's fault, but I have not figured out how to get the car's system to see the phone book which was automatic with other phones I have used. I can still use the dashboard buttons to dial, but that's not ideal.This is not that bad of a phone. It's actually a nice little phone and it works pretty well. I love the screen and it's an attractive little device. However, it has some issues with implementation that make it a little harder to recommend.UPDATE 10/30/13: Following the suggestion of a fellow reviewer, I allowed the phone to connect to the Play store and updated the VZ Security application and this solved the issue with the persistent message about SMS data. It is unfortunate that Verizon's application made it out the door in this state but I am glad it has been fixed. From the message that would appear, it was not at all clear that the security application was behind the issue. I am leaving the rating at 3 stars for now.", "Date": "October 22, 2013"}, {"Title": "Looks nice, but missing something in pkg", "Author": "M. Jobbagy \"Follow Your Bliss - Joseph Cambell\"", "ReviewID": "R1TMWYYKN40192", "Overall": "1.0", "Content": "I too got this item for review and was all revved up when it arrived. Nice packaging, not too much waste and easy to get into.But as the previous reviewer noted, I too have no sim card in the package. Phone? check, battery, check, charger, yup...... excessive amount of 'info' booklets, there they are...... but no sim card. Pulled the back off the phone, nope empty sim slot and empty micro sd card slot.So I'll add my review of: looks purty, not too heavy, not too big, but can't tell ya how it works unless I manage to carry it around awhile and try to remember to see about getting a sim card for from a verizon kiosk/outlet/store, whatever.....And I'll verify that yes, as of this moment anyway, the product page DOES say a sim card is included. I would have thought so anyway, because recently they haven't been needing them, but the switch to LTE seems to have brought them back......", "Date": "October 21, 2013"}, {"Title": "Something Important Was Missing", "Author": "mayfayre \"mayfayre\"", "ReviewID": "R290FJ96P1FVFB", "Overall": "1.0", "Content": "I was really excited to get this product for review. I opened up the nicely designed packaging and found:- a phone- a USB cable- an AC adapter- 6 instruction/warranty/consumer info/support bookletsUnfortunately, the one thing the box was missing was the all-important SIM card, without which this Kyocera Hydro Elite for Verizon is useless (apparently the new Verizon 4G LTE phones require a SIM card while older models don't).  According to the information on the Amazon product page, one is supposed to be included in the box.  The first instructions in the Quick Start guide are about installing the SIM card. But without that, I am unable to go through the set-up wizard, register the phone with the Verizon system or sign up for one of their plans online.Absolutely no immediate electronic gratification.I suppose to get this phone to work I will have to search out a Verizon store and see if I can get a SIM card from them, but that step shouldn't be required at all.If I ever get this phone working, I'll update this review, but right now I can't rate this product highly because an item essential to its operation was missing on arrival, and I am unable to use it to test out its features or sound quality.  If Amazon had allowed a no-star review I would have preferred to label it that way, since a one star review equates with \"I hate it\", and I don't know yet if it is worthy of like or dislike.  But I can't rate it higher than that because as provided, it is not functional.Too bad - it looks like a nice phone.", "Date": "October 20, 2013"}, {"Title": "Not my favorite, but it will do it's job.", "Author": "T. Drake", "ReviewID": "REI6R8QD9LRRU", "Overall": "3.0", "Content": "My other cell phone works better than this one. Only part I like is that it is smaller and is water resistant.", "Date": "October 16, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EP2CAFW"}}