{"Reviews": [{"Title": "Best Phone Money Can Buy", "Author": "nvw250", "ReviewID": "RW66HOL2ACK2O", "Overall": "5.0", "Content": "This phone is amazing.  Far better than any iPhone.  Amazing display, fast responses, and cool gesture movements and voice commands.  Would recommend this phone to anyone.", "Date": "July 30, 2013"}, {"Title": "Gee whiz G4.", "Author": "Cynthia B \"seabee\"", "ReviewID": "R1VRSRCFDGMU2O", "Overall": "4.0", "Content": "Love the size and adjustable screen brightness! Responds readily to the touch,  but must say I don't enjoy charging it so frequently and the phone becomes very warm at times.", "Date": "January 3, 2014"}, {"Title": "Great phone!!!!!!", "Author": "Spencer", "ReviewID": "R1MXSZRGADOYAC", "Overall": "5.0", "Content": "I loved my galaxy s3. Just upgraded to the s4 and am not disappointed. Check for a few upgrades out of the box. I was a little frustrated the first day checked for upgrades a couple times and phone is running perfect now. Love the bells and whistles like the ir remote can show what's on TV and tune right to that station. Size is almost identical to s3.", "Date": "December 22, 2013"}, {"Title": "Wow!", "Author": "Mr Jeramy W Jenkins", "ReviewID": "R32XV7GC6WMMBN", "Overall": "5.0", "Content": "I love my new GS4! This phone is everything my other phones weren't. For the first time I feel like I got it all in one.", "Date": "January 12, 2014"}, {"Title": "love this phone", "Author": "nadine", "ReviewID": "R3L18MKUZPEDEI", "Overall": "5.0", "Content": "It's a great phone  it had all the features I was looking for love it. I would recommend this phone to all my friends. I plan on buying another one soon.", "Date": "January 7, 2014"}, {"Title": "S4", "Author": "angela lewis", "ReviewID": "R1WA5PMJFNI95O", "Overall": "5.0", "Content": "i choose this phone because i needed and upgrade but after i got it a like it alot and you can do alot of things with this phone i recommend it", "Date": "January 2, 2014"}, {"Title": "Best guy toy on the Planet", "Author": "Tony L. Montjoy", "ReviewID": "R5AZG0I1Z2VMO", "Overall": "5.0", "Content": "Being an old fogey who used a flip phone for years, this was one of the easiest transitions in technology I have ever made. It has also helped that I downloaded the on-line owner's manual and also have a son who has the same model. Fantastic product and easy to transition into.", "Date": "December 28, 2013"}, {"Title": "Samsung Galaxy S4", "Author": "Lynda L Gage", "ReviewID": "R2SY2M0AY8SW5", "Overall": "5.0", "Content": "I love this phone and it is so easy to navigate! I actually set it up myself which was quite easy.", "Date": "December 27, 2013"}, {"Title": "Went Back to iPhone", "Author": "Keith A Evans", "ReviewID": "R19NDGNUZABL7F", "Overall": "3.0", "Content": "Great phone packed with tons of features. I'm also a fan of the Android OS. Unfortunately for me this phone had issues freezing periodically (once I had to remove the battery to unfreeze it after trying everything else) and had intermittent messaging issues where the phone refused to send certain pictures to certain individuals. Due to these issues I switched back to Apple.", "Date": "October 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E3DY740"}}