{"Reviews": [{"Title": "Great except the battery...", "Author": "Oliver W", "ReviewID": "R3JIJRFX1DJBBE", "Overall": "4.0", "Content": "I've had my JXD S5110b for about a week now, and I think it's great, with a few small problems. The battery life is way too short for a device like this. Leaving it in sleep mode overnight, with nothing running, drained about half of the battery. The solution is easy, but can get annoying. Just turn it off when you're not using it. I can get about two hours of playing games and listening to music, maybe more if I turn off the wifi. The other problem I had with it is I wasn't a fan of the bloatware that came on it, so I put on skelrom for JXD S5110b, which was really easy. Doing that made the device way more usable, it seems to load faster, and not freeze up. It seems to play every game I throw at it, but I haven't really tried that many.Overall, I think it is worth it, and would buy another, if something happened to this one.", "Date": "August 13, 2013"}, {"Title": "The best Android tablet I've ever used", "Author": "Vanessa Kindell", "ReviewID": "R2340D4ONTX88L", "Overall": "5.0", "Content": "Before I say anything else, I have to point out that if your intrest isn't gaming, then why are you considering a gaming tablet?I absolutely love my JXD S5110b! Let's start with the fact that this is the most intelligently designed tablet I've ever used. Having buttons and joysticks just make so much sense to start with since they're infanitely easier to use than a touch screen and the tactile feedback is so important when it comes to playing games. It's capability to map the buttons and joysticks to areas on the screen make it so much better than any Android controller I've seen, and the fact that this capability is built into it's version of Android OS keeps it from having any of the slowdown you see with other similar features in other devices. I've tested it with a variety of apps and from my experience it works quite well. You might still have to use the touch screen for some games, like Minecraft Pocket Edition when it comes to pointing to things on screen, but the fact that you don't have to get oily fingerprints on the screen for the majority of functions makes using the device for long periods of time a much more enjoyable experience. It has been able to play every game I've tried on it, including some of the more advanced games like Need For Speed: Most Wanted and ARC Squadron: Redux without hiccups.The only two complaints I could make is the battery doesn't last very long, the device resets your home screen every time you restart it (though things placed on anything but the first page are left alone so it's only a minor annoyance) and the device tends to run rather hot when running the included N64 emulator and higher-graphics games like Need For Speed: Most Wanted.I've seen some folks complain that the devices brick easily but I've had no problems at all. The only thing I can imagine is that they're trying to do weird things with the firmware, or misinterperting the recovery mode having been disabled as having bricked the system. If you attempt to put the system into recovery mode, the system will appear to endlessly boot without getting all the way up. However, it's not bricked, it's simply lacking a recovery mode (though there is supposedly a fix but I could not seem to get it to work as it requires a MicroSD card which I did not have a working one handy). All you have to do is press the reset button on the top of the system, wait for it to do it's thing, then hold the power button until the JXD logo appears on the screen and you will be right as rain.While this item's description reads Android 4.1, my JXD is running on a modified 4.3 Jellybean and I haven't had any issues with compatability with any Android apps. Also, folks try to say that you need to install a skelrom to get full support for the device and be able to use rooted applications. I can tell you for a fact that this is false. The device comes already rooted and ready to go.I'd deffinately reccomend this over any other Android device I have ever used and even over the S7800 which from what I gather has quite a few issues with it's OS.", "Date": "January 7, 2014"}, {"Title": "It broke after two months of use!!", "Author": "Lucas Cesar Bernardi", "ReviewID": "RGMMF69WM2GAJ", "Overall": "1.0", "Content": "DO NOT BUY THIS!look it up online and you will find out that these things are no good!Mine broke after two months of use. I tried contacting the JXD company but they never answered or anything!", "Date": "January 16, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Special Game Button: Dual joysticks, dual LR buttons and dual speakers, crossing, ABXY\n5-Point capacitive touch screen, games could be played by touching\nButton mapping + 1080 professional HDMI output screen TV + Professinal game button control, play games cool, mobile phones and ordinary tablet cannot do it\nS5110b supports online movies, web browsing, twitter...\nphysical button to play the android games, the professional gaming experience", "Name": "JXD S5110b 5-Inch 8GB Game Handheld Console Tablet PC (White) - Cortex A9 Dual Core 1.5GHz 1GB RAM Android 4.1 Double Joysticks 3 Axis Gravity Sensor HDMI OTG -Support lots of Games @Priceangels", "ImgURL": "http://ecx.images-amazon.com/images/I/41IHPCmTW9L._SY300_.jpg", "ProductID": "B00E4AMG36"}}