{"Reviews": [{"Title": "Excellent phone!", "Author": "Peter \"Pete\"", "ReviewID": "R1IKODMUWN1WQL", "Overall": "5.0", "Content": "We have 2 of these in my family now. Bottom line is this is a great phone.Strong Points:* Battery life. This phone goes all day and then some with normal use. Beats any other phone we've had in our family.* Physical slider keyboard* 4G data is fast* Plenty of memory for normal use* Plenty of CPU speed* Notifications system is very good* Built in apps for messaging, email, etc are all very good* Screen is clear and crisp. Not OLED or super hi res, but fine in general* INEXPENSIVE! This phone is a lot of capability for the cost!Weak points:* keyboard is not great. Keys are flat and it is easy to press the wrong one.* Easy to hit back button when sliding keyboard openIs it the greatest phone for games or movies? Nope. But it's a great smart phone if you're not a super power user or just have to have the fastest, highest res phone out there. But it will still be going strong when those high end ones are dead or hunting for a charge!", "Date": "September 23, 2013"}, {"Title": "Love", "Author": "Amazon Customer", "ReviewID": "R5BPVQJMHQ98F", "Overall": "5.0", "Content": "If you are a person that loves to have a physical keyboard this phone is AWESOME!!!!!! I had a Razor (the newer one) and I understand this is a kind of a step down but I don't care cause I love it!!!!!", "Date": "September 13, 2013"}, {"Title": "enjoy", "Author": "Marci Smith", "ReviewID": "R1W1UEAI8G0P1O", "Overall": "4.0", "Content": "I really enjoy my phone.  Works well. I love the swipe text feature. I also like the slide out keyboard. I use it when I get on the web. I would buy again.", "Date": "October 13, 2013"}, {"Title": "Love it!", "Author": "A. Hibdon", "ReviewID": "R1NNOQ0Z9GUHC1", "Overall": "5.0", "Content": "My previous phone was the Droid Razr, and I had really gotten tired of recharging the battery mulitple times a day and it was large enough to be uncomfortable in one hand.  The Enact has solved both problems and I have been delighted to find dozens of other little handy features as well.  I love it!  It has features like facial recognition that will keep the screen on if you are reading, and a great pop-up text screen that will let you continue what you are doing while you write a text... Even my Hubby's Galaxy 4 doesnt have that.  I love LG products, and this is no exception.  It is really well designed.I can't really coment on the keyboard because I don't use it!  But the on screen keyboard is great, very simular to what's on the Galaxy 4.  I use this just like any other smart phone. Scrren only. I have noticed it is MUCH better at recognizing when I turn the phone sideways to watch a video than my Razr was.  Since Adobe isn't supporting flash for phones at this time that caused a little headache for me, but I found a flash suporting browser and haven't had any media problems since.  Oh, battery life is great! I can be on facebook, online, watch vids, text, all day long and still have a charge at the end of the day.  And it seems to charge a lot more quickly than the Razr did.The body is a little thicker than most smart phones out there, because of the slide out keyboard, but I still find it cmfortable and it feels so much more sturdy than some of the others that crack so easily.Overall, I just love it and haven't lost any functionality since switching.  Great phone and free with online contract. Awesome.", "Date": "November 26, 2013"}, {"Title": "BEST droid with a keyboard and OH and 700 MIN of battery life....can it get better? LOVE it....", "Author": "Molly \"Wazoo Books\"", "ReviewID": "R3HUBMURLH720V", "Overall": "5.0", "Content": "I had a Droid 4....I really loved the phone. But after only 15 months of used battery died. I took a gamble on this one since I love my keyboard. Touch Screen is extremely fast and very responsive. It takes very little time to have this one up and running just the way you want it. Apps set in fast and especially if you have the Back Up Assist feature. You can add photos to your contact list and add an app called Zedge and I had every ring tone and notifcation tone I could want. the phone has some notification tones including one that sounds kind of like a Harley LOLthis has about 700 MIN of battery life....over 12 hours.....WOW that is impressive my geezer droid lasted 4 to 6 hours at the most.  The Video Quality is first rate and I have listed to audiobooks on Audible on mine and it has NO drop offs. The Quality of sound when talking is incredible and when moving or walking or in the car I have not had one issue and hear clear as a bell. I have a headset ....Plantronics that is working perfect and I am so impressed I can actually walk over 10 feet away with NO problem...the Camera is a big leap up in Quality and vastly better photos than my droid 4.This keyboard has tiny round flat keys but I am getting used to them. I would give this a 10 if I could. the ONLY thing I have found is the keyboard does not light up. I believe this is the way they made it. I not found a way of changing this. a small minor issue but I will mention it.other than the missing keyboard light I am not finding any flaws. GREAT phone and works wonderful and also IT HAS REPLACEABLE BATTERIES. so it can extend the life of this phone. I love that feature. Good phone for a keyboard lover on a smart phone.", "Date": "January 11, 2014"}, {"Title": "Great phone", "Author": "S. Medina \"Books > Food.\"", "ReviewID": "R3E7HN8C5XLBCG", "Overall": "5.0", "Content": "It always takes me a long time to upgrade from one phone to the next because I'm very picky, especially about wanting a slide-out keyboard that has a certain feel to it - I want to be able to feel the keys under my fingers so I can type without having to stare at it the whole time. This one fit that bill so I bought it, and so far I've been very pleased with the whole phone - it's sturdy, well-laid out, and the perfect size. It's got a nice big screen, but it's not SO big that it drains my battery quickly or makes the phone too big for a pocket or something. I've already dropped it several times but it just keeps on trucking, no issues.", "Date": "January 26, 2014"}, {"Title": "Great Keyboard, but overall not that great.", "Author": "Allison Rubio", "ReviewID": "R2AP01HSW7L68R", "Overall": "2.0", "Content": "I didnt like it because it was very very simple and didnt have a lot of features that I wanted in a new smart phone. I returned it--even though the keyboard is what I wanted.", "Date": "November 8, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EN6DHZM"}}