{"Reviews": [{"Title": "Great Phone - Love the display, Google Play, and Quality", "Author": "User", "ReviewID": "R18E3SFIC5QYAT", "Overall": "4.0", "Content": "Switched from the iPhone after a lot of research and waiting for the Moto X price to drop.  At $99, you can't go wrong. Received the Moto X and installed the camera fix OS update.  From there it was just learning the environment and migrating my phone contacts, etc.  For me that was relatively painless.What's nice about this product?-Display is crisp and clear.  Some of the fonts appear that they are popping out of the screen.-Google Play is (in my opinion) better than iTunes.  You can upload 20,000 of your own songs to their cloud for free.-Call quality is better than iPhone.-Battery life is great.-Now all my Google Apps really work (i.e. Gmail, Calendar, Drive, etc.).-Size is just right (not too big, not too small).-Built in USA! Yes, the parts are from all over the globe, but that's the world we live in.  I'm glad that I can buy some tech gear that is made here.What could be better about this product?-I do miss the home button at times.  I'm always looking for a way to get back to the screen when it goes dark; especially when i'm finishing a call.-Phone could come with earbuds.  For some reason Motorola wants to charge separately for that.  Gotta love Apple for handing out decent earbuds.In the end, I would buy this product again...", "Date": "October 25, 2013"}, {"Title": "Why 5 Star rating??", "Author": "Alexander Fillalan", "ReviewID": "R3DZJCGB3740ED", "Overall": "5.0", "Content": "Great Phone!  OK, here is why I give this a 5 Star rating.  Solid build, latest Android 4.4 update, basically stock android experience, Very Solid Battery Life, very fluid performance and the size is perfect, for me.I originally purchased the Samsung Galaxy S4, which is a great phone, however, with all the advanced specs, it lagged a bit.  I don't care what anyone says, it lagged.  Too much bloatware, etc..Moto X, you also get 50GB cloud space on Google Drive.  And also, if you purchase phone via Amazon, they give you some cloud space on their Amazon cloud as well (I think 80GB space).", "Date": "December 5, 2013"}, {"Title": "Great phone - AT&T; service problems", "Author": "P. Nelis \"patrickjn\"", "ReviewID": "RO4YQYC1PUUJO", "Overall": "4.0", "Content": "the device itself rates 5 stars.  You shipped it with instructions for installation on the SPRINT network.  I bought it for use on the AT&T; network.  There was some difficulty finding the AT&T; instructions.  It is particularly difficult to get through the AT&T; wall that separates real person assistance from the usual press-a-button help.  Once I reached the installation instructions and instructions for use the process was  excellent.  It takes some time to get used to a smartphone device, but the service, clarity, ease-of-use, and overall experience is excellent. I live in an area with marginal signal strength, but the device works well with only one or two bars. I like the size.  It is slightly larger than my old flip phone, but still fits well in my trousers pocket.  The battery is not as long lived as I would like (lasts about a day with very moderate use), but it recharges quickly.This phone replaces a Motorola RAZR v3, which was experiencing difficulty receiving calls.  Calls would be dropped, voice mail would be lost, and callers would get strange responses (this phone is not in service, mailbox full, constant ringing with no response).  unfortunately the new phone is getting some of the same responses.  AT&T; seems to be having trouble serving the Reading PA area.  And it is very difficult to reach a human being to report trouble.", "Date": "November 17, 2013"}, {"Title": "Features > Specs", "Author": "A. Patkar", "ReviewID": "ROT7OBIGC819E", "Overall": "5.0", "Content": "This phone embodies what I feel manufacturers should be doing rather than pushing for faster processors. It has a slew of unique and extremely useful features that you never knew you needed but you end up using every day all the time. The ability to turn it on by just picking it up, the ability to answer calls and messages while driving and the ability to just talk to it while its still in your pocket, in the car or on a table beside you are simply fantastic. Its fast and has zero lag although you might see a difference when running graphics intensive games which might not run as fast as on a g2 for example. For everything else it works flawlessly. The stock android with no bloatware and kit kat is great because bloatware was one of the things that drove my crazy on my previous samsung galaxy s2. The shape and size is the absolute best and it fits nicely in your palm unlike the s4 or g2. The screen isnt as good as its competitors but you will not notice it at all unless you are comparing them side by side and even then its difficult to tell the difference. If you go to a store and try it instead of comparing specs online, you will see what i'm talking about. I'm very happy with this phone and would definitely recommend it to everyone.", "Date": "February 25, 2014"}, {"Title": "Awesome phone!", "Author": "Jennifer Yaney", "ReviewID": "R2F4MC4CF17W2", "Overall": "5.0", "Content": "Great phone for a great price! I have been very pleased with this phone, and it just got android 4.4 as an update!", "Date": "November 26, 2013"}, {"Title": "Wonderful!", "Author": "Stephen", "ReviewID": "R1VP20520I611R", "Overall": "5.0", "Content": "This phone's features make my life a lot easier. Especially the active display and twist to activate the camera features. This phone may not have the highest specs, but don't let that fool you. This phone is very very fast. From loading internet pages to multitasking, it just breezes through it. I have yet to notice any slowdown or lag. The amoled display is amazing also. I haven't done a real test of the battery life, but it easily takes me through my day (about 6 a.m. to 4-5 p.m.) while using it for about 80% of that time. Its great for me. The camera interface is very very simple, some say its too simple, but for me, it gets the job done and quite well in my opinion (after the update, that is. the way the camera pictures turned out, right out of the box, weren't bad, but they seem to be much better after updating).", "Date": "March 26, 2014"}, {"Title": "great free phone", "Author": "jerry", "ReviewID": "R23NZEGFABK753", "Overall": "5.0", "Content": "great free smart phone. top of the line android on the market right now. Just as good as the Nexus 5.", "Date": "March 19, 2014"}, {"Title": "Glad again I didn't go with an IPHONE.", "Author": "Gary M. Fletcher \"vito01220\"", "ReviewID": "R3UVMXJ74XEV9N", "Overall": "5.0", "Content": "Just a fantastic phone in every way. No problem to navigate thru screens, apps, etc. Simple, clean, colorful. I'm very happy with Moto!", "Date": "February 17, 2014"}, {"Title": "Motorola Moto X, White (AT&T;)", "Author": "GMAshops", "ReviewID": "R12KZB5PG5WSNC", "Overall": "5.0", "Content": "I am happy with my choice of cell phone, I am able to take pictures more quickly and the results are more clear.  The sound is better than my last phone.  It has been some getting used to as the features are set up a little different, but that is more about me and not the phone.", "Date": "February 5, 2014"}, {"Title": "Phenomenal Moto X", "Author": "Amazon Customer", "ReviewID": "RNJ85DZ9LWEA4", "Overall": "5.0", "Content": "It is lightweight with a phenomenal display.  I love how the phone knows when I am driving and reads my text messages to me!", "Date": "January 23, 2014"}, {"Title": "Great android phone", "Author": "H. Timmons", "ReviewID": "R1T4POKCRJSXR8", "Overall": "5.0", "Content": "Replaced an old gingerbread android. I like the google now features. Speech to text is pretty good, sometimes I have to really yell to get the feature to work. Love the driving assist mode and the sleep feature. Phone is durable and I like the white. Camera is ok but color is off sometimes. Battery lasts like any other android I've had. More I use it quicker its drained. Active display/locked screen feature doesn't always work that great, sometimes it flashes on/off when I'm not touching it. Great call quality, great speakerphone. Like the google swype keyboard. I don't have a problem with storage space (about 8gb still free) but if you had a lot of info you'd probably want the bigger data size. I'm just running standard stuff and a few games. No music files or any big data suckers. I would buy this phone again if given the choice. No issues with it, like the new kitkat.", "Date": "January 20, 2014"}, {"Title": "Great phone", "Author": "Paul Neuhaus", "ReviewID": "R1WM2A2PYD5QRC", "Overall": "5.0", "Content": "This replaces a Motorola Atrix.  There is nothing about it yet that I do not like.  It is the right size for me, but a little large for small hands; this is a trade off for a nice large screen; I feel that this is balanced between the two.  Motorola is awesome about staying with standard connections so that you do not have to upgrade them too, and they assemble it in Fort Worth, Texas - awesome.  I use my phone quite a bit, but do not walk around glued to it like so many.  It has great call quality and easily gets me through the day on a charge.", "Date": "January 16, 2014"}, {"Title": "Great Phone!", "Author": "Mike", "ReviewID": "R36CJ6JV51IOIK", "Overall": "5.0", "Content": "I bought this phone and ditched my iPhone and I'm so pleased I did. The phone's appearance is pleasing and the Android OS is preferable to iOS. I'm no longer paying the Apple tax and I'm not certain why the Moto X isn't more popular.", "Date": "January 11, 2014"}, {"Title": "Motorola Finally Makes a Phone Worth Owning", "Author": "Timothy Swann", "ReviewID": "R1PBSQ1J2L42RU", "Overall": "5.0", "Content": "I purchased this from Moto Maker (on Verizon, the only difference is the radios so this is relevant) during their holiday sale where the off contract price came down to $350. Since I've had this phone for a while now, and I am now equipped to write my review. I wrote one for the Galaxy Nexus(GNex) after that was released since I bought it the day it came out and my review received nearly 200 votes (mostly helpful), so it seems like people found my review useful. I've posted this review for all the different carrier variants since the hardware and software are all the same except for radios.Hardware DesignThe design of this phone is truly one to appreciate. The fact that I was able to customize the look of mine is not the reason I say that. I can say that this phone does not feel like you're holding an iPhone or a Samsung or any other phone for that matter. It does not feel cheaply made (and being made in the US, it isn't!). It had just enough weight and the part on the outside, don't feel like plastic like most Samsung phones. Don't get me wrong, Samsung makes very good phones, but they all feel cheap, but that's my opinion and others feel the same way. I happen to think the Moto X has a premium feel compared to my old GNexThe screen is much more enjoyable than my Gnex was. This is not to say that I didn't like the screen on my GNex because I did, but the colors seem better on the Moto X. Every user will have a different opinion though. Many people like the IPS Retina display on the iPhone and the best comparison to that is the LG G2, which has a great screen. The AMOLED screen on the Moto X is very good for me though.Continuing with the design near the screen, the rounded edges all around the front of the phone actually feel great. What do I mean by that? Since this screen is truly edge to edge, if you find yourself swiping from the edges a lot, you won't feel the sharpness an edge usually feels like.The mic is on the front of the screen and very noticeable, so when using speaker phone and turn the phone face down to have the speaker facing up, it results in the other person hearing an echo. Didn't have that problem with my GNex, but that is probably because the mic was not very visible on the bottom.I do have a gripe about the design of two things though. Perhaps it's because I'm used to have my GNex, but have the volume rocker and the power button on the same side (the right side), feels awkward to me. But Samsung has it correct in my eyes with the volume rocker on the left side and the power button on the right side. The other thing for me is having the micro USB port on the bottom of the phone and the headphone jack on the top. I don't like this part AT ALL. For those that don't have cars that have Bluetooth Streaming, this creates cord clutter. However, there are times where having the headphone jack on the top can be nice. For example, as a runner I take my phone with me on runs and use headphones. Since the cord doesn't need to go to the bottom of the phone that can make that experience better.SoftwareThe first Android phone I had was the Galaxy Nexus. So why do I say that here in this review. Well, I've experienced the software of other android phone through demo units and phones of friends. I don't like skinned versions of Android like what Samsung does to Android on their Galaxy phones. I do truly enjoy the stock Android experience. The Android experience is nearly stock android. There are some small Moto tweaks, but otherwise, it's the experience I enjoy.Active Notifications are truly awesome! Yes, this falls under software. Now what is that? Well instead of a notification light, a portion of the screen turns on when you have a notification, telling you exactly what app the notification is from. You can pick and choose what apps you want to show notifications through this feature. Now you might be wondering is the screen continuously shows this notification until you dismiss it. Well, you can dismiss it if you want to, but you can preview the notification and see if it's an email or a text or whatever app.Now for Touchless control. Some people may find this to be a gimmick, but it's actually not bad. I use it when in the car to make phone calls. That's about it, though occasionally, saying \"OK Google Now, what's the forecast for today\" is easier than launching an app. (call me lazy for that, it's true haha).Battery LifeI have been putting my phone through test of my everyday usage. That includes, streaming music in my car, using Google Maps for traffic conditions to and from work, texting, calling, checking personal and work emails, checking Facebook, taking the occasional picture and then some sports-related stuff too. I would imagine the average user might use their phone as much as I do in a typical day. Now, the verdict...it's very good. I was shocked at how well the battery lasted. I got more than a full day's worth of usage out of it (wake up at 5am to sleep at 10pm). That's 17 hours for me. That means most people should be able to get a full day's worth out of this phone before plugging in before going to sleep. Moto really did a fantastic job of optimizing the software, processor and screen to maximize battery life.CameraTruthfully, I haven't taken enough pictures to give a great assessment of this, but coming from my GNex, this takes far better pictures. The pictures I've taken have been in great lighting conditions and the pictures have come out great. If you want to get a good idea on the performance, you can google reviews. Keep in mind when this phone first came out, the camera wasn't great, but that was due to the camera processing software. They have fixed that. Droid-Life has samples of the before and after. They show that Moto fixed this. It's a 10MP shooter and should be good enough for everyone's every day camera taking needs.OtherThrough moto maker the phone came with Android 4.2.2. I have not upgraded to 4.4 yet becaue from what I've seen in forums, in 4.4, Verizon is able to block tethering for those who still have unlimited data (like me). I'm holding off on installing the update for now.", "Date": "January 2, 2014"}, {"Title": "I like my phone, but...", "Author": "Amazon Customer", "ReviewID": "R1B620TAGJI587", "Overall": "3.0", "Content": "You should be aware that you can never use the phone while it's charging.  It causes the phone to get super hot and overheat enough that the screens get blue lines or really weird and over pixelated.  Apparently this isn't a new problem, so Motorola doesn't want to talk about it but tech support at AT&T; told me it was an issue after I called a few times and reset the phone.It does have some great features and a really large screen but I'm not very happy that Google sold Motorola right after I bought it or that I cant use it while its charging.  I wonder what else I'm going to learn as time goes on.  Next time I'm going back to the iphone", "Date": "February 16, 2014"}, {"Title": "Custom Moto X", "Author": "Igadgetgeek", "ReviewID": "R3W07MVRB7ZMY", "Overall": "5.0", "Content": "The Moto X is all about customizing your smartphone experience. With the Moto Maker you can make a custom Moto X to reflect your style. If you don't want to make a custom Moto X that is cool they come in Black And White with either 16 or 32Gb of storage. The Moto X does not have expandable storage but if you purchase one you will receive an additional 50Gb of Google Drive storage to help offset the onboard storage. I have used my Moto X for a few day and one of the coolest features is the quick capture camera all you have to do is twist your wrist twice and the camera app opens. The display is a 4.7\" with 720p Amoled. The camera is a 10mp clear pixel and in my testing does a great job of capturing still and action photos alike. The new Active Display is a very useful feature of the Moto X it allows you to quickly get info on emails, text, notification, and missed calls all with out unlocking your phone and it will help to conserve battery life. With the touchless controls you can interact with your new Moto X with your voice with out touching it. You will be able to get directions, set alarms, check the weather, or just about anything you can access with Google now.If you are looking for a new Android phone that give the consumer lots of option and the latest operating system from Goggle then I would recommend the Moto XI have used the following cases for the Moto X. The Cruzerlite Bugdroid Circuit TPU Cruzerlite Bugdroid Circuit TPU case for Google Moto X - Greenand the Cruzerlite Experience case Cruzerlite Experience case for Google Moto X - ClearI like the fit of the TPU cases from Cruzerlite they give great protection with out changing the look and feel of the Moto X.", "Date": "August 27, 2013"}, {"Title": "TOO FRAGILE With a Case and Has HIGH Insurance Deductible!", "Author": "Sharon \"ladyangel4\"", "ReviewID": "R3PQNL5F7DPGPD", "Overall": "2.0", "Content": "My daughter had a full glass screen smartphone for years before we upgraded to this, no problems with dropping. We actually put a case that put a buffer edge around the front of the screen, and it still broke in less than 2 months just from falling out of her handbag! The glass is solidly glued to the digitizer, which is a $200 part, so forget fixing it yourself.  The insurance deductible is $199!  This phone is KNOWN to have issues with breaking easily. One slight jolt after the glass shatters, and the digitizer fried!  Some phones can go years with a broken screen, NOT this one.I put 2 stars, because the OS and apps work flawlessly with a decent amount of memory, and the phone was holding a charge well, although it's still only 3 months old and having to be replaced.", "Date": "March 12, 2014"}, {"Title": "Great Phone - easy to use", "Author": "Cindy Gaudette", "ReviewID": "R4RVQIAONM028", "Overall": "5.0", "Content": "Phone was very easy to set-up; the migrate app was fabulous for transferring all of my contacts & photos.  The phone is slim and light weight; easy to navigate.  There are a number of ringtone options, which is good.It took some getting used to finding a contact without having the phone call the person!  I haven't been able to find the zoom on the camera or a notepad app.", "Date": "January 28, 2014"}, {"Title": "DO NOT buy terrible customer service", "Author": "Shannon Patrick", "ReviewID": "RL1DQAK0ZB2Z5", "Overall": "1.0", "Content": "I work for AT&T; and was given a Moto X as a work device. I was very excited to try out the software and the design your own style was pretty cool. After getting the phone out of the box setting it up and getting ready to use it it began to power cycle whenever plugged in to charge. It wouldn't charge and had since died, my manager said that I needed to contact Motorola for a replacement. I did and they said to send a new one under the 14 day DOA period they had to place a $580 hold on my credit card, which is insane and no consumer is going to want to do that. The only other option is to send it in for repair and not have a phone for 3-6 weeks, which is also insane. I think that this is terrible customer service practice and yet again motorola is not off to a good track, their phones have been iffy in the past and this just solidifies the fact that morotola shouldn't be in the phone business. I refuse to sell motorola until these issues have been fixed, I wouldn't want my customer to go through the nightmare that I've been having for the last 2 days.", "Date": "September 24, 2013"}, {"Title": "moto maker site does not work with motorola phone", "Author": "attempted user", "ReviewID": "RGY5QDF0KO4H4", "Overall": "1.0", "Content": "Can't review the phon because Motorola and Google could not manage to create a website that works with a current Motorola Atrix HD phone with Jelly Bean and the Google browser.  If they can't write the software to sell their own phones how good is the software actually on the phone going to be?  Called Motorola customer support and they just say sorry, you should go use a Microsoft computer with a browser that actually works to order this android phone.", "Date": "November 5, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Motorola Moto X, White 16GB (AT&T;)", "ImgURL": "NULL", "ProductID": "B00EKXFRFG"}}