{"Reviews": [{"Title": "May be too good to be true", "Author": "Kathryn Torrez", "ReviewID": "R2JYRJIXOUQEX5", "Overall": "3.0", "Content": "I ordered this Tracfone to replace my old one. The price was great, almost too good.  When checking on the item it said new and Tracfone, when I received it, earlier than I expected, it was a refurbished phone.  I can live with that for the price, but while it had the charger, new battery and a 2g memory chip it did NOT HAVE THE SIM CARD.Not a good thing, I have emailed the company to see if they will send me one, without it I cannot set it up.  I am hoping they will give me more info on what I can do and make this right, if not I will return the phone and just buy from another vendor.I am usually careful with my purchases, my first time to be dupped.Just got an email from the vendor.  They had me call Tracfone and Tracfone is sending me a new sim card with all of my info transfered to it.  I will be up and running in 3 to 5 days.", "Date": "August 26, 2013"}, {"Title": "Good deal.", "Author": "buyer777", "ReviewID": "RZQOK9PTJE91M", "Overall": "5.0", "Content": "I don't know if this particular item will ever be in available again, but just in case it is... Its a good deal. Although the description does not say so, it does come with triple minutes for life, at least mine did. Also, order the sim card as soon as you buy the phone; you will need to call Tracfone customer service for that. It will save you a few days.", "Date": "September 6, 2013"}, {"Title": "satified", "Author": "luvv999", "ReviewID": "R2QN47AUQSZ373", "Overall": "4.0", "Content": "If you are looking for a simple phone to male calls or receive text message this is worth the money.", "Date": "January 28, 2014"}, {"Title": "Love it!!!", "Author": "Sharice McGee", "ReviewID": "RH0YEV8MTJKB", "Overall": "5.0", "Content": "I ordered this phone new for my daughter, and she loves it. I arrived in a timely manner and it included everything the seller advertised as being included. She is able to do everything she wanted to with it... mainly down load her music on it.", "Date": "January 14, 2014"}, {"Title": "new to cell phones", "Author": "Hoody", "ReviewID": "R1GUKOAKCJP64X", "Overall": "5.0", "Content": "Have had it for 3 days now, so far it works fine, am just learning my way around this cell phone stuff as its the first one I've owned, I wasn't going to go nuts on a 500 to 600 dollar thing.It does what it says it will do, I bought it mainly as a portable MP3 player, since they wew the same price. I figured why not just get this and try it out, if it didn't work I could just use it as a MP3 player. But all is just fine, I added 30 min for 10 bucks just to start, and ended up with almost 100min (3x30+10)  they started me off with 10 and 60 days service time, so when I added the 30 I ended up with 98 and 90 days service time, plenty time for me to test it out.Today I have it loaded with my MP3.s, some pic's, and have sent messages, and emails, my usual email isn't connecting right now, but that's my fault. So I'm content with it. Good cheap java OS pay as you go simi-smartphone.btw I got this thing as a referb unit, for a only 14.95, and even included the USB cable and 2gig SD card and a year warranty.Edit:Ordered 2 more for friends that wanted one, received them today, both were missing the USB cable, sent email to WorldWide about it, we'll see...Update: called the seller, will send me the 2 missing USB cables, so all is good", "Date": "February 21, 2014"}, {"Title": "GOOD FOR GIFT.", "Author": "TOOLSEESING DOMUN", "ReviewID": "R1O2SQXPGJ3LYE", "Overall": "5.0", "Content": "IT A NICE ITEM TO GIVE AS A GIFT.MAY BE HELPFUL AND PRACTICAL TO OTHERS.IT CAN DO THE WORK WELL WITH THE MODERN ELECTRONICS.", "Date": "September 23, 2013"}, {"Title": "Great so far", "Author": "SR \"SR\"", "ReviewID": "R14JP26Q3E7FYT", "Overall": "5.0", "Content": "I received the product yesterday. It is for my 12 year old so he has a \"cool\" phone while not spending too much. I received the SIM card, microSD and activation card with the phone. There was no USB cord, however the seller, TalkinTree offered me a $5 partial refund for my trouble which I used to order a USB cable. Apparently it is not supposed to be included in the box. My son was also able to get some games and Apps using the information in the reviews for the new phone and he transferred some of his songs using the microSD card. The wifi works pretty well, much faster than my Samsung 390g tracfone. Anyway, my son loves the phone!", "Date": "March 3, 2014"}, {"Title": "OK", "Author": "barry barbaretta", "ReviewID": "R1Z1CU9D21T8W6", "Overall": "2.0", "Content": "Not bad for a \"pretend\" smart phone, very limited; but you get what you pay for as they say. I still use it.", "Date": "May 20, 2014"}, {"Title": "LG 840g TracFone", "Author": "Charlie Dilmore", "ReviewID": "R2YGI4MAPZD194", "Overall": "5.0", "Content": "Purchased two of these ( one for use and the other for backup) due to the very reasonable price.  Units arrived on time and was well packaged.  Still learning how to use and am very pleased with the phone.", "Date": "April 30, 2014"}, {"Title": "Lost Phone", "Author": "Bella", "ReviewID": "R2OPM7X9NCF4R2", "Overall": "5.0", "Content": "Purchased this for my grandaughter because she lost the one she had.  She is extremly happy that it was received as quick as it was.  Good Job.", "Date": "April 14, 2014"}, {"Title": "Great buy", "Author": "lajara henderson", "ReviewID": "R2MW5CP0DZ4H3M", "Overall": "4.0", "Content": "Excellent ,triple minutes feature is the best.....touch screen works great .smart buy for prepaid phone ..very pleased with this purchase", "Date": "April 14, 2014"}, {"Title": "Great Phablet", "Author": "Chuck AB", "ReviewID": "R1ZPCIPBAR4UN3", "Overall": "5.0", "Content": "Easy to operate, many great features that my former phone didn't offer, bought refurbished and it works like a dream and looks like it's new.  Definitely would recommend others to purchase.", "Date": "April 12, 2014"}, {"Title": "Nice phone", "Author": "Pam", "ReviewID": "R16I1XSPVBKES6", "Overall": "5.0", "Content": "I upgraded from an LG800 after my husband purchased this phone. I especially like that you can have free internet access when you are connected to wifi. The phone I bought was sold as reconditioned. So far no problems.", "Date": "April 6, 2014"}, {"Title": "lies....", "Author": "smilez5696", "ReviewID": "R2LU0RKXYM8230", "Overall": "2.0", "Content": "I guess it was okay I was just disappointed to discover when I received the product it was not new as promised but used. I expected to get wjat I was told I was paying for if I had known that I would have paid theextra money for a better phone", "Date": "April 5, 2014"}, {"Title": "It is a great product", "Author": "Candle lady", "ReviewID": "R1UR02D234ZTBZ", "Overall": "4.0", "Content": "I really liked the phone, but I had problems with it constantly turning off so I sent it back.  Once fixed it will be great especially for those on \"pay as you go\" as it is a smart phone!  The customer service was excellent! But, I decided against getting another one and just staying with my old Samsung as I couldn't get network services out in the country where we live anyway and would just use it in town.", "Date": "April 3, 2014"}, {"Title": "Real Winner", "Author": "John M", "ReviewID": "R2U9EYHY0QHT00", "Overall": "5.0", "Content": "The LG 840G offers features and performance similar to the service provided by phones costing multiples of its initial cost. Small size makes it easy to carry,but its display is large enough to be easily seen.", "Date": "March 29, 2014"}, {"Title": "good, non android", "Author": "Larry wilson", "ReviewID": "R2FUZN1PKRIEKS", "Overall": "5.0", "Content": "phones good runs a a non android, haven't seen any free apps yet, battery has seemed pretty good. Bast trackfone i had yet.", "Date": "March 25, 2014"}, {"Title": "phoneof lg 840g", "Author": "jackie motta", "ReviewID": "R3R4INEL013CKY", "Overall": "2.0", "Content": "i don't care for this phone it's not what i expected , i've talked to other people and they agree it's not the best,it is what it is.but i will be looking for a different phone thank u have a great day ok here is headline required as above", "Date": "March 24, 2014"}, {"Title": "LG 840 G", "Author": "Charles A.Gardner", "ReviewID": "R31C5QSZ2JL3QD", "Overall": "5.0", "Content": "This phone was everything that I had hoped it would be, the price, the quality and the phone its self. It has all the bells and whistles plus you get triple minutes. I am still learning all it will do. Great buy. C. Gardner", "Date": "March 24, 2014"}, {"Title": "Good phone for the price", "Author": "Danny Owen", "ReviewID": "RP2336FJIVZX3", "Overall": "5.0", "Content": "Got the phone faster than expected and in perfect condition.If you need a cheap phone this is a good choice.", "Date": "March 23, 2014"}, {"Title": "If you don't expect too much....and for the money, this phone is ok.", "Author": "Jon Kleeberg", "ReviewID": "R1O0875VWDGQNC", "Overall": "3.0", "Content": "I like this phone. For only being $15 shipped you can't go wrong. This is NOT a Smartphone. Don't listen to what they say in the item description. You could call this an ALMOST Smartphone. Sure, you can connect to WIFI, but it's still only mobile web pages. Any regular HTTP pages are really too big for the browser to handle. As for apps; you won't be going to Google Play for them, this isn't an Android phone. I've found that it's hit and miss finding apps that work. What you have to do is search out \"Java\" apps on the web from your computer and download the .jad or .jar files and transfer them to the memory card. Take your chances launching them because some of them don't work. The video players is nice. I can convert full length movies down to 320X240 in iPod Classic mode with AVS and it plays them fine. The mp3 player works nice too. I put a 32 gb memory card in the phone and have music for days. Plus having a BT Stereo Headset is a bonus. There is NO Voice Command software. So you cannot say \"Call So & So, Mobile 1\". That's kind of a bummer. I bought this phone to replace my Universal Lifeline Phone through SafeLink (they require the replacement to be a Tracfone.) Compared to the original phone they gave me, it's 300% improvement. If you want a REAL Smartphone, pay the extra $10 and get  the LG Optimus Dynamic (http://www.amazon.com/Optimus-Dynamic-Android-Prepaid-Tracfone/dp/B00GFTFG6S/ref=sr_1_sc_3?ie=UTF8&qid;=1395245751&sr;=8-3-spell&keywords;=traphone+smartphone) It at least runs Android.", "Date": "March 19, 2014"}, {"Title": "Missing Accessories", "Author": "Susan", "ReviewID": "R2ZUUN4PZUZWYH", "Overall": "1.0", "Content": "It arrived in a timely manner but it did not have the LG USB cable, Tracfone activation card, or 4GB microSD memory card. I will have to purchase these items myself (separately) if I want to use them for this phone. The phone is in good shape and charged up properly. I will not know how well it works until I purchase the activation card to add minutes.", "Date": "March 12, 2014"}, {"Title": "SUPERB VALUE!", "Author": "Robert Charles Reese", "ReviewID": "RJKIX249IGWNC", "Overall": "5.0", "Content": "I paid more for the brand new phone that I upgraded from with this one. I only paid one third of the new cost of this phone, with a one year warranty. Yes it is reconditioned, yes it is used. But you would never know it. It works, looks, and performs like it is brand spankin new. Could not be more satisfied.", "Date": "March 6, 2014"}, {"Title": "LG 840G Tracfone", "Author": "Sandra J. Ferguson", "ReviewID": "R2L8LGFYHLEQ1J", "Overall": "5.0", "Content": "The color screen, ease of texting, and quality of using the phone is nice. It does not come with a USB Cord and 4GB Micro SD Card, you do receive a 2GB Micro SD Card. I contacted the seller regarding the missing items and they responded right away. I'd recommend this phone to anyone. I'm very happy with my purchase!", "Date": "March 5, 2014"}, {"Title": "Works great and LOOKS great", "Author": "PRISCILLA VALDEZ", "ReviewID": "R2WB2O682TEL44", "Overall": "5.0", "Content": "I found this phone for a great price. The color screen is great, the ease of texting, and using the phone. Its basic yes but I wont complain for the price and quality Id recommend this to anyone out there. The sound and volume, great too. IM very happy with this purchase.", "Date": "March 4, 2014"}, {"Title": "great price", "Author": "fetti", "ReviewID": "R383UU966QBRS9", "Overall": "4.0", "Content": "great basic phone ok browser, mp3 , camera no flash, facebook twitter myspace, bluetooth, wifi,3g, good graphics, email, 3x mins for life fast shipping 2 days", "Date": "March 4, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Factory Refurbished\n1 YEAR TRACFONE FACTORY LIMITED WARRANTY!\nUses AT&T; Towers for best service\nPackage includes: LG 840G (Black color), LG Battery, LG Battery Door, LG Home Charger, LG USB Cable, Tracfone Activation Card, 4GB microSD Memory Card and Tracfone User Guide", "Name": "LG 840G Tracfone Triple Minutes Black 3.2\" Touchscreen 3G WiFi Smartphone Cell Phone", "ImgURL": "http://ecx.images-amazon.com/images/I/41jmHL9GXvL._SY300_.jpg", "ProductID": "B00EJMZO3S"}}