{"Reviews": [{"Title": "Not too bad", "Author": "Jamie Custureri", "ReviewID": "R29S5OOKNUMN5W", "Overall": "3.0", "Content": "Decent for the price and the purpose that I bought it for. Bought it for a friend who has a prepaid cell phone that she could easily put the sim card in. Easily fits her needs for texting and calling. Battery life isn't that great but Facebook works well and she can browse the internet at a reasonable speed. So pretty much happy with the purchase", "Date": "November 12, 2013"}, {"Title": "Inexpensive handset with limitations", "Author": "Phil Lembo", "ReviewID": "R3DZ051XSMC5C3", "Overall": "3.0", "Content": "Note: This review has been revised in light of more experience with it.Pros:* Inexpensive.* UNLOCKED.* Nicely constructed, compact and attractive.* Good selection of basic apps.* CPU passable for most tasks.* Defaults to installing apps to the external sdcard if you have one.* Standard connectors for usb, phono, SIM and SD cards.Cons:* GPS not recognized by some apps (like Google Maps).* Only supports 2G (EDGE) data (most navigation software wants 3G).* Wifi radio receiver has poor sensitivity.* Battery capacity (1000ma) is seriously limiting.* Sound quality on calls is below par.After living with this phone for a few weeks I finally replaced it with another, slightly more expensive, model from another vendor (a Huawei U8665) because of the frustrating limitations noted above. The deal breaker for me was the inability to get any navigation software to work (mostly, I think, due to slow EDGE network speeds).Update (5/27/2014):Recently needed to take this little guy out of storage to use temporarily. Although it's still hobbled by its inability to deliver GPS navigation, I was reminded again of what a bargain it continues to be. This is a very nicely packaged device that delivers smart phone tech to anyone on a budget.", "Date": "October 28, 2013"}, {"Title": "a great product.", "Author": "James D. Elton \"jdelton\"", "ReviewID": "R15TYT4O0NJLT7", "Overall": "5.0", "Content": "Hi this is a great phone and i am happy with it. it is for my brother and he likes Versizon but this only supports T-Mobile and AT&T; but he got it activated just the same and it is great.he likes it and i am happy that i bought it.sincerely i thank you for the timely sending and nearly perfect product. jdelton", "Date": "March 14, 2014"}, {"Title": "okay phone", "Author": "KHANISHA", "ReviewID": "R2IB4IS2L847BM", "Overall": "3.0", "Content": "for the price of this phone and what it delivers it's a grate phone.love that't it has wifi capability.i don't like the camera quality though but it's an ok phone.", "Date": "March 31, 2014"}, {"Title": "Blu Dash Jr D140 unlocked Dual Sim Phone (Black", "Author": "Sylvia Durant", "ReviewID": "R16PPWW8U3U4JU", "Overall": "1.0", "Content": "I am so unaccustomed to this type of phone.  So hard to turn off.  I notices it has dual sim not sure how that works.  It will be used internationally not sure how they will use it. confusing.", "Date": "May 21, 2014"}, {"Title": "Blu mobile", "Author": "Giacomo Podavini", "ReviewID": "R1PRCNA68V05LA", "Overall": "5.0", "Content": "Cheap 2 sim mobile, works good. Android a little bit slow but for the use that O so is perfect!!!", "Date": "May 17, 2014"}, {"Title": "BLU Dash JR D140", "Author": "silvermine", "ReviewID": "R1WINZ52VPSUNZ", "Overall": "4.0", "Content": "This little phone rocks. Just put in a 4 or 8gb memory card and you're good to go.Picks up wi-fi signals really well. The camera isn't the best but works fine. Fifty bucksfor an unlocked android phone what's not to like?", "Date": "March 15, 2014"}, {"Title": "Very good Andriod phone for the price", "Author": "C. Bakhos", "ReviewID": "RYRTID9ORFFN1", "Overall": "4.0", "Content": "Now you can purchase a very good Android phone for a very low price. I use this phone with Instragram and WhatsApp, You can't install very much programs on it because turns very slow. I connect to the Internet using WiFi that is OK for me, this is the phone I was looking for, cheap, good quality and WiFi connection I not interested in using 3G or 4G.", "Date": "June 8, 2014"}, {"Title": "great", "Author": "IT-SolutionsNYC", "ReviewID": "R7JH40V91INMW", "Overall": "5.0", "Content": "For the price these are great phones, I gave it to my 10 years old son and he loves it.", "Date": "June 2, 2014"}, {"Title": "This phone sucks, go with another BLU phone that has more memory and space.", "Author": "Jeffrey Stanley", "ReviewID": "RBN9QQ7GDG1Q0", "Overall": "2.0", "Content": "This phone is the POS entry level android from BLU.  I went with this for a while after my Galaxy Note II broke (and I was broke).I've used it for a few months now, and I'm disappointed every time I look at the dammed thing.  It drops my calls, has bad reception (all the time), can't handle very many apps (I had to delete facebook, instagram doesn't work very well), and will not receive larger data/pic/vid texts.  Save your money and go with a more powerful BLU, or my personal favorite, the Samsung Galaxy phones.There is one great feature in this phone.  BLU has a great music player which is on the Dash JR.  It will recognize and playback any file I throw at it.  It organizes and categorizes music in a really friendly user interface.  I can tell there are some great things coming from BLU, but this isn't it.", "Date": "June 2, 2014"}, {"Title": "1", "Author": "Haroldo M Cua Cua", "ReviewID": "R3E58B8SCNLCOM", "Overall": "3.0", "Content": "I like this nice and is ideal for small double excellent work my card I recommend to shop at amazon", "Date": "May 30, 2014"}, {"Title": "not bad", "Author": "rossy", "ReviewID": "R1HSDEBRD54BG4", "Overall": "2.0", "Content": "I like a basic computer and enjoyable qualities only thing is that it has little internal memory and fewer permissions", "Date": "May 25, 2014"}, {"Title": "not all things cheap is good", "Author": "cam", "ReviewID": "R1MQU9UVZEDE1W", "Overall": "1.0", "Content": "It freezes up all the timeIt sometimes miss my calls or doesn't ringI don't think it's worth my money", "Date": "May 17, 2014"}, {"Title": "phone problem", "Author": "Derick", "ReviewID": "R2H1ED2E5ICSEI", "Overall": "2.0", "Content": "this item when tring to use it , the phone lock and now i can not use it because of that reason, this item malfunction to soon, and for this reason i dont like it.", "Date": "May 9, 2014"}, {"Title": "cool cell", "Author": "Christina Eismann", "ReviewID": "R3CTOTSWJ10BTM", "Overall": "5.0", "Content": "i love this phone use it with tracfone and i can have any plan and have a good quality smartphone!", "Date": "May 3, 2014"}, {"Title": "defective phone delievered", "Author": "Maneesh Kumar", "ReviewID": "R3FCA1C55GQXVI", "Overall": "1.0", "Content": "I dont know whats wrong with the phone... works well but the ringer volume automatically raises up and down.. very irritating.. ringer volume changes continuosly and suddenly phone goes to mute..", "Date": "March 4, 2014"}, {"Title": "Don't go anywhere else.", "Author": "Jim Audet", "ReviewID": "R3IKK512L2QY5E", "Overall": "5.0", "Content": "bought this phone at top10cell and you are crazy to go anywhere else. Their after sales help will blow your sox off. What ever you do  stay with them. I am 84 and hard of hearing which tests the patience of anyone and they came out with flying colors and they did not make me wait hours for service.", "Date": "March 31, 2014"}, {"Title": "farahmand samimi", "Author": "farahmand", "ReviewID": "RG10IEL8YF2QP", "Overall": "2.0", "Content": "this phone is not very good  It is like a Chinese phone  The keyboard does not work  No phone memory", "Date": "January 4, 2014"}], "ProductInfo": {"Price": "$79.99", "Features": "Unlocked Dual SIM 3.5-Inch High Resolution HVGA Display, 1 GHz Processor\nGSM-GPRS-EDGE 2G 850/900/1800/2100\n2MP Camera, Android 2.3 Gingerbread, 512MB ROM-256MB RAM\n3.5mm Audio Jack, FM Radio, MP3 Player, MP4 Player", "Name": "BLU Dash JR D140 Unlocked Dual Sim Phone (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41PVTwnU8VL._SY300_.jpg", "ProductID": "B00FJ92RYO"}}