{"Reviews": [{"Title": "Perfect for the price", "Author": "John J \"JP\"", "ReviewID": "R3M1RN5ZWWZK7U", "Overall": "5.0", "Content": "I have been waiting a week to reflect on the phone - it arrived in time.  It's my first try with the Smartphone phenomena.  I was attracted to the price and to the positive experiences noted.  I would only echo how easy it was to set up.  I have a Pay-as-you-go plan with Spotmobile and an Italian SIM card for Italy, where I travel frequently.  I chose not to have a dual-SIM phone - I'm used to simply changing the cards when I arrive in the country.  In any case, I love the freedom the Europeans have to pay per use and forget the costly Smörgåsbord.  I average $15 a month for the US SIM.  The Italian SIM is much less than that since I am only there for work.  This phone is, thankfully, unlocked.  I inserted my SIM card and my 16GB memory card into the phone (directly from my previous Samsung flip-phone).  Voilà! I was up and running.  The screen is tremendously clear, the apps I've been able to upload have been super helpful and the Wi-Fi connections work flawlessly.  I am WAY too happy with this phone. I feel badly for most Americans who are stick with the fables and myths fed them about  (1) what a phone actually costs and (2) why anything like International texting, International calling or data access has to exponentially feed only the profits of AT&T; and Verizon.  It's a crime . . .  . . . but I digress.  The phone is perfect for me.  I'll let you know if it breaks down, but I'm pretty savvy electronically.  My only complaint is that I'm still waiting for the holding case to accompany it (The \"Elegant leather case for the Huawei Ascend G510 with magnetic fastener and stand function in Black from kwmobile\").  The delivery date is not projected for another MONTH. It's the only case made specifically for the phone sold on Amazon.  If I had to do it over again?  I'd shop a regular store and forget skimping on the cost if they can't deliver a leather case for over four weeks.  Is it coming from China - on donkey?", "Date": "February 25, 2014"}, {"Title": "Nice phone", "Author": "marctheshark", "ReviewID": "R3D1YYQLVS5TBM", "Overall": "4.0", "Content": "I purchased this phone as a gift for my wife; so far she is very satisfied with it and likes the many features. My only dissappointment was that the phone was not dual SIM.", "Date": "January 14, 2014"}, {"Title": "So fast, so good", "Author": "Daniel U.", "ReviewID": "R3420BN3Y1TT13", "Overall": "5.0", "Content": "This phones it's a madness xD i like the white color, it came quickly to Miami. 100% i recommend. i comes with Android 4.1 and everything comes good at the moment.", "Date": "April 11, 2014"}, {"Title": "Good", "Author": "Andres", "ReviewID": "R2V9GUTDGP82PJ", "Overall": "5.0", "Content": "Nice cell phone, was on time and most important \"Unlocked\". The color was the desired and is working without any problem.", "Date": "April 9, 2014"}, {"Title": "My opinion on the HUAWEI ASCEND", "Author": "Zaida N. Vásquez V", "ReviewID": "R32SI76EWPWGV2", "Overall": "4.0", "Content": "The seller and the product meet the expectations, but recently withdrew the product in Caracas Venezuela on 06 February, the only problem I have is that the cell is in the language fully mandarin and I have not been able to work because no they speak or write in that language, the manual is entirely in Chinese language, even English. I speak spanish I know I do. As I do? I would love to help me and answer. Thank you in advance help you can give me. Zaida Vásquez", "Date": "February 13, 2014"}, {"Title": "Dissapointing", "Author": "Ildermar", "ReviewID": "R3OP6OURNFRAFC", "Overall": "1.0", "Content": "After 5 months waiting for my cell phone, i realize that it doesn't work with 3G Movistar Venezuela, only Digitel. I asked before my purchase and the seller told me that every band work perfectly, but . is not true. If you want it for Movistar don't buy.", "Date": "May 6, 2014"}, {"Title": "The worst thing and bought", "Author": "Alexander", "ReviewID": "R13FZTHC6I7V1O", "Overall": "1.0", "Content": "Wifi does not work if it is literally next to the router's battery does not last up to 3g in Venezuela. Not arrive after 4 months is a lousy product and also the screen and is usually glued wrong exit. disappointed", "Date": "April 6, 2014"}, {"Title": "Great Phone!", "Author": "Johanna Salazar", "ReviewID": "R1FG8404RRS6LI", "Overall": "5.0", "Content": "Really love this phone, simple design, with the all-glass front alluding to a premium device, a little bit too large for me but it came with great functions...The only thing that bothers me, its the RAM memory (only brings 512mb) and after extended use the phone can feel a little heavy; However the low price shows that Huawei really does have the ability to compete against the well established smartphone manufacturers. It's fine for everyday use.", "Date": "February 27, 2014"}, {"Title": "saludos", "Author": "Honorio Aldana", "ReviewID": "RXA5NWWKR812Z", "Overall": "5.0", "Content": "It is a very good phone, I like the color and how fast it is, is having android 4.1 is fast .. for what I need it's perfect ...", "Date": "June 10, 2014"}, {"Title": "Good Cellphone", "Author": "Fernando Martins", "ReviewID": "R3LE90LWYBVS4A", "Overall": "5.0", "Content": "good phone the only thing that I wish is to bring more and languages ​​included as it comes only in English and Chinese and at least in my case I speak Spanish is sometimes necessary to understand certain things. Rest all good, recommended buy", "Date": "June 6, 2014"}, {"Title": "excellent", "Author": "Henry", "ReviewID": "R36MD3JEC2TW4", "Overall": "5.0", "Content": "good morning .. I am pleased to inform you that I am very satisfied with the service you provide, I recommend you buy both pruduct their services ... I hope to continue with this wonderful shopping system ...... congrats", "Date": "June 1, 2014"}, {"Title": "The worst buy", "Author": "Ivan Gomez", "ReviewID": "R345MEJMWDBGSL", "Overall": "1.0", "Content": "El equipo viene con el sistema Android TOTALMENTE BLOQUEADO debido a la censura que hay en China. Por ende, no se puede instalar ni siquiera la Play Store. Para el continente americano no sirve.The kit comes with the Android system TOTALLY BLOCKED because there is censorship in China. Therefore, you can not even install the Play Store. For the American continent does not work.", "Date": "May 30, 2014"}, {"Title": "Excellent Cell Phone", "Author": "Victor R.", "ReviewID": "REZEZ0LFKVEPN", "Overall": "5.0", "Content": "I just want to say that this cell phone is AWESOME. It is everything that I expected. Great cell phone, great skills, great Vendor who gives an awesome attention. 100% recommended.", "Date": "May 20, 2014"}, {"Title": "Good phone", "Author": "Jose Gabriel Cabrita Delgado", "ReviewID": "R1I9NWQW80CAHK", "Overall": "5.0", "Content": "Good phone. Unloqued for digitel and movistar in venezuela. I have not tested with movilnet. I like Google AndroidTM 4.1 Operating System", "Date": "May 17, 2014"}, {"Title": "it`s a great smartphone", "Author": "Judith", "ReviewID": "R3HPA5YTH7A516", "Overall": "5.0", "Content": "it is a fantastic smartphone with a great screen, the batery is fine, this smartphone has good materials, and here in venezuela work with all bands specified", "Date": "May 7, 2014"}, {"Title": "Nice Phone!", "Author": "denisez", "ReviewID": "R3A1IQ89S5Q7V", "Overall": "4.0", "Content": "Nice cell phone with low price. I'm very satisfied with it. The only reason I gave it 4 stars is the video taking is not that good.", "Date": "May 6, 2014"}, {"Title": "work very good in venezuela movistar", "Author": "juan carlos", "ReviewID": "R3N3R928QYGBFQ", "Overall": "5.0", "Content": "im happy whit my new phone¡ only is a littel slowly..but all es very good. is better than galaxy III for me", "Date": "March 24, 2014"}, {"Title": "Great phone, and it is OPEN.", "Author": "F. Perry", "ReviewID": "R1U65PG9YBNYB0", "Overall": "4.0", "Content": "I love this phone, the ONLY reason I gave it 4 stars is sometimes it will change the personal ring tones I have setup. Also it will shut off the auto screen flip. But other then that this is a great phone. And it is A OPEN PHONE if I do not like the carrier I can tell them to, well I think you get the picture. NO CONTRACT.", "Date": "March 13, 2014"}, {"Title": "Hylene", "Author": "hylene", "ReviewID": "RV1Y90UWUJAAI", "Overall": "1.0", "Content": "You cheated me, the phone does not have flash and the description says it does. I can not put accents to words in my language. In addition, the phone that long in coming three months.", "Date": "April 15, 2014"}, {"Title": "I cheated", "Author": "ENRIQUE R.", "ReviewID": "R39O6RI1YD7US7", "Overall": "1.0", "Content": "I cheated because the product has not reached me! because if resppuestas need not take legal action, buy it in christy520", "Date": "March 24, 2014"}, {"Title": "product purchased does not match what", "Author": "aldo linero", "ReviewID": "RH2BX79Q4IQO3", "Overall": "1.0", "Content": "I write so I received the following phone that do not match the code of the device with the code that's in the box also came with full of pictures and other things innermost memorized. so buy 2 new phones ... so I see are scams", "Date": "April 8, 2014"}, {"Title": "bad cell phone and wait another", "Author": "Deivis Piña", "ReviewID": "R32NASN17PAIKM", "Overall": "1.0", "Content": "this cell phone lacked some featur es, and I want it replaced with one that if this good, I'm disappointed", "Date": "March 13, 2014"}, {"Title": "no PRENDE", "Author": "juan", "ReviewID": "R3MNKUO4B7OBSB", "Overall": "2.0", "Content": "good evening, I am writing from, Venezuela. the phone huawei g510 came in perfect condition with no scratches or anything. tlf but does not turn me, how do? I await your response. fair to good nights", "Date": "April 21, 2014"}], "ProductInfo": {"Price": "$149.95", "Features": "Android OS, v4.1 (Jelly Bean)\nWi-Fi 802.11 b/g/n, Wi-Fi hotspot, DLNA\n5 MP, 2592x1940 pixels, autofocus, LED flash, Secondary: VGA\nDual-core 1.2 GHz Cortex-A5\nGSM 850 / 900 / 1800 / 1900 3G: HSDPA/WCDMA 850 / 1900 / 2100", "Name": "HUAWEI ASCEND G510-0251 Unlocked GSM Android Cell Phone - White", "ImgURL": "http://ecx.images-amazon.com/images/I/41jHbCUAoUL._SY300_.jpg", "ProductID": "B00FL3I9G8"}}