{"Reviews": [{"Title": "Great Phone", "Author": "Devin", "ReviewID": "R3VNEA7YENKL5G", "Overall": "5.0", "Content": "This phone is great for what we need it for.  It has a nice large display.  great wifi connectivity and smooth interface.  Great for someone Not looking for the latest and greatest, or fastest phone but wants something stylish.  It looks like the s4 mini with same quality finish.  Just be aware the phone looks nice but isn't the most powerful underneath.  It can be slow, the camera isn't that good either and has weak flash.  For my 13 yr old daughter it works great.  For me, not so much....  I have a real S4.  The phone is great for what it is and especially for $65, as long as you keep your expectations in line with a phone in that price range You cant go wrong!", "Date": "February 11, 2014"}, {"Title": "save your money", "Author": "carol obear", "ReviewID": "R2B7Y9NYFH1XPX", "Overall": "1.0", "Content": "This phone is a piece of crap.  Does not work like it should.  Camera quality is terrible.  Only good thing is the speakers work well.", "Date": "March 3, 2014"}, {"Title": "Read below if you have questions ask me", "Author": "Beautifullj", "ReviewID": "R1VWS8U5QKKTFH", "Overall": "1.0", "Content": "I didn't like this phone I thought it looked like a nice phone it is but it's more for someone who doesn't get on the internet and it doesn't have slide text and the wifi on it doesn't work. I would get this for a first phone for a teenager.", "Date": "May 21, 2014"}, {"Title": "Not good", "Author": "karen", "ReviewID": "R92SKDPKYQ3QO", "Overall": "1.0", "Content": "This phone stopped working after 3 weeks. I would not recommend anyone purchase this phone. Its not worth the price.", "Date": "May 21, 2014"}, {"Title": "Great", "Author": "nabin nepal", "ReviewID": "R1SX0N7ZDCOOT2", "Overall": "5.0", "Content": "This is great smart phone. This phone works good and for this prize. I bought it for my friend as a gift.", "Date": "May 11, 2014"}, {"Title": "Not for me", "Author": "Robin", "ReviewID": "RS673EG5DTPSP", "Overall": "3.0", "Content": "I purchased the phone to replace a broken phone that i had. Although this phone didnt quite work out for me iw as able to return it and received my full refund.", "Date": "March 16, 2014"}, {"Title": "frist smartphone", "Author": "Dave L.", "ReviewID": "R3SHE5LDUK3N4R", "Overall": "5.0", "Content": "hey great job love it the reason why i brought the phone cuase i going from verizon to t mobil and this is my first smartphone", "Date": "December 24, 2013"}], "ProductInfo": {"Price": "$179.99", "Features": "Android 4.0(2.3)\nSim Card:Dual SIM Card Dual Standby Unlocked Smart Phone\n4.5\" Capacitive Touch Screen\nBand:GSM 850/900/1800/1900MHz\nROM:256MB RAM:256MB", "Name": "Eson Unlocked Quadband Dual Sim with Android 2.3 Os (Android 4.0 Ui) Smart Phone 4.5 Inch Capacitive Touch Screen T-mobile Simple 3G Mobile (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51HY6gSj38L._SY300_.jpg", "ProductID": "B00FQHLMBI"}}