{"Reviews": [{"Title": "This phone is great!", "Author": "Robert W. Murphy", "ReviewID": "RF5P5DGJL5IBM", "Overall": "5.0", "Content": "Phone has sturdy (water-resistant) aluminum case. beautiful display and all around awesome phone. I use it as an AT&T; go-phone and it works great. The phone is factory unlocked with no bloatware. You will not be disappointed with this phone! I bought directly from Amazon, not vendor. I have had to many problems in the past with vendors.", "Date": "November 29, 2013"}, {"Title": "Another Awesome Sony Product.", "Author": "Knuckles", "ReviewID": "R1THLTCMAC744G", "Overall": "5.0", "Content": "This phone is extremely nice. The display is gorgeous not to mention the pictures that this camera produces. I highly recommend this phone to any one looking for a high quality phone.", "Date": "January 13, 2014"}, {"Title": "very nice one", "Author": "joseM", "ReviewID": "R3G9YRYTZO1Z1T", "Overall": "5.0", "Content": "Im not a fan of big phones, but this one feels nice in my hand and pocket.....super fast , easy to use...clear calls...connects fast to internet..easy to read messages and emails....the best ..water proof feature grabs everyones attention..even iphone users are impressed...im using on at&t;  without contract , it works perfectly , i recommend it to anyone looking for a fast phone", "Date": "December 17, 2013"}, {"Title": "You bet!", "Author": "Laoblue", "ReviewID": "R2HIFMUXBHEGS5", "Overall": "5.0", "Content": "Great phone!  Has a solid feel with metal-like, firm edges that don't cut into your palm like to older version.  Speaker is on the bottom, so audio is clear - unlike the older version.  The camera iawry ally good for a phone!  Once you get to know all the functions, you will be impressed!  Close-up shots are the best though.  Landscape shots suffer a little in detail when blown-up, and there is some purpling with the sunshine - maybe because of the small lense.  Great screen too, any bigger would be a pad, with vivid colors and fantastic detail.Ok, all the great things....the no-so-great...is the battery, but I don't play lots of games or watch movies, so no problem.  It wont last long if you are a heavy gamer in between texting or calls.  And come on, this is a thin phone, what can you really hope to get out of the thin battery?  Yeah, the phone is a little heavy and bulky, especially for a gal, I would think.  Also, like other phones, it can get warm to the touch after playing games, or operating the camera for a while - a nice hand warmer maybe.", "Date": "February 2, 2014"}, {"Title": "battery consume too fast and difficult to put on silent mode when in a meeting or when required", "Author": "lout \"foehne\"", "ReviewID": "R1ONO23M1VCM9Y", "Overall": "3.0", "Content": "battery consume too fast and difficult to put on silent mode when in a meeting or when required too bad", "Date": "January 23, 2014"}, {"Title": "wonderful phone but must find another company", "Author": "Anh Nguyen", "ReviewID": "RNRTZR01WMD49", "Overall": "3.0", "Content": "I had the same problem like \" T Ekici\" who commented b4. When the phone's screen freeze and turned black, i called Amazon customer service. Bc i really like Sony Z1 so I had a new phone just One day after USPS came and pick up my dead phone. After i used new phone about 35 days, it was happended again. This time, Amazon customer service told me :\" the quickest way to have this issue resolved is to contact the manufacturer directly for troubleshooting.....\" so i must called Sony ( Thank you for all Amazon customer service help me that night, you are so nice with me also my English is so bad  .... much better than Sony customer sv a lot ....I cant return to Sony bc it was over 30 days. Now im just waiting from Sony after i sent my phone last 2 days ago by Fex ex.", "Date": "January 19, 2014"}, {"Title": "Beatiful phone but had to return it", "Author": "T. Ekici \"Panoptican\"", "ReviewID": "R2ML76JRTJEMMV", "Overall": "2.0", "Content": "I bought a Sony Z1 via Amazon. within 3 hours I unpacked the phone and turned it on the phone's screen freeze and turned black. Search the issue in internet Re: frozen black screen Sony Z1. Apparently Sony z series phones already suffering from this issue. There is a software update but not clear whether it fixes the issue or not. Hence returned the product to Amazon. It was a good phone with large screen a good camera and features but frozen black screen issue is very common and apparently Sony could not fix the issue.", "Date": "January 9, 2014"}, {"Title": "The best of Sony for the best of You - Excellent Phone.", "Author": "H. Batra \"aks316\"", "ReviewID": "R1R2PPB321ZOQV", "Overall": "5.0", "Content": "The best just got better. All the negatives of Sony Xperia Z has been solved in this phone. Awesome phone.", "Date": "November 23, 2013"}], "ProductInfo": {"Price": "$690.00", "Features": "Display: 5 inches\nCamera: 20.7-MP Camera\nInput: Touchscreen", "Name": "Sony Xperia Z1 (C6902) Black Unlocked US Version", "ImgURL": "http://ecx.images-amazon.com/images/I/41jCp-Av9dL._SY300_.jpg", "ProductID": "B00F2GR5Q4"}}