{"Reviews": [{"Title": "I advice this smartphone, Lenovo a760 (I think the same would be for other Lenovo smartphones)", "Author": "Matt", "ReviewID": "R3IIORK5GL66JY", "Overall": "4.0", "Content": "This is what I wanted without spend a lot of money.Good quality of the screen and touch (of course, it doesn't have big resolutions). It's very light. The best quality of this phone is the speed, it opens applications quickly. The battery is even very good, two days with a normal use.When I received the phone the rom was multi language, but when I upgraded the firmware everything was in Chinese or English, but I don't mind it. Everything functions well so I don't want to risk to install another rom, I wouldn't risk to not enjoy deeply the power of this phone.It does even good pictures and video (until 720p).Nothing to say about wi-fi and bluetooth, everything works well. I notice that the gps it's excellent, in same places with other phones I couldn't find the signal, but with this phone I find it quick.", "Date": "November 19, 2013"}, {"Title": "It's a phone, with its usally phone-niness", "Author": "Adanna", "ReviewID": "R3DSLD71021ODU", "Overall": "4.0", "Content": "The phone blinks out from time to time, depending on the app being used, mainly viber. I guess we can always throw out viber. This model from The LightInthebox supplier did not come with google playstore installed, and it was such a problem to install it now. Other than this extreme major problem, I like everything else about the phone. It's a solid grip, not too heavy at all, quite thin in line with the competition and has a really nice screen resolution. It came way sooner than expected. I ordered it on the 14th December, and got it January 3rd. When taking the december holiday into consideration, I'd expected it to be a while again before receipt.The seller responds well to all queries, so far - except the one on google playstore. I understand though that it is up to us the clients to root the phone. I don't know how to do that. Even though the lenovo store is in full chinese, I was still able to search and download youtube, facebook, whatsapp, viber, spellathon, angrybirds and so in full english.  the keypad input is also semi-chinese, but there are options to change all that, and the chinese apps can be deleted. Once playstore opens, I'll download a new input method, instead of Sogou. The themes are nice, the launcher is also quite nice. The audio is nice and clear - its a good experience, once I fixed the chinese hiccups. I can't say I love it because of the minor headaches. It does not come with a screen protector in the box, but it does have a clear film on the screen that works a little.it takes quite a looooooong time to charge from the laptop, oh dear!", "Date": "January 3, 2014"}], "ProductInfo": {"Price": "$153.23", "Features": "3G:WCDMA 900 / 2100MHz\n2000mAh Rechargeable Li-ion Battery\nSupport MS Office Word, PPT, Excel", "Name": "Lenovo A760 4.5 Inch IPS 854x480 Qualcomm MSM8625Q Quad Core Mobile Phone 1GB RAM", "ImgURL": "http://ecx.images-amazon.com/images/I/41B6ZibdoKL._SY300_.jpg", "ProductID": "B00F968AZC"}}