{"Reviews": [{"Title": "iPhone 5s versus Galaxy S4  (I've owned both and reviewed them here, side-by-side)", "Author": "Steve Morty", "ReviewID": "RXY3U1A321FR8", "Overall": "4.0", "Content": "My review of the iPhone 5s versus the Galaxy s4 (in case any of you are upgrading phones and trying to decide). Side note: Like Coke and Pepsi, there will be folks that are biased toward one or the other, but my hope is to point out some key differences should it help others in their overall decision making process.iPhone 5s-Better native keyboard – more precise and predictive. More natural feel when typing. The auto correct is great on the 5s.-Siri – Smoother and better voice accuracy. More natural and intuitive. I provide commands (“remind me about the 8am dentist appointment on December 31th”) and Siri understands. If I issued the same command on the Galaxy S4, the voice recognition would be confused and misinterpret.-The overall Volume of speaker is louder on the 5s than on the Galaxy S4. I can hear the ringer from other rooms.-In my car and using the speakerphone on the 5s, others tell me the sound quality is night and day compared to the Galaxy S4 (Verizon). When I had my S4 (two different ones), they said I sounded garbled or as if I was talking through a tin can.-I have yet to experience an application crash on the 5s-The Camera is quick to snap shots and pictures are sharp-Availability of iMessage and Facetime. Makes communicating with other Apple users simple. I can see when they are typing a reply back to me, and I can even Facetime in the car or from anywhere without having to download an configure a 3rd party app such as Skype, and then hope the person on the other end had done the same (I have family who are not technology savvy, but easily use Facetime).-The iOS7 operating system is overall more refined and user friendly (i.e. – you can hold down and click X to delete an application on the iPhone rather than get confused trying to find the Settings/Application submenus on the Android/S4)-In my area, better overall signal quality / antenna strength. No dropped calls in the same spots I used my S4.Galaxy S4-I like having a ‘Back’ button (bottom left arrow)-The S4 has a larger screen / more real estate-The S4 camera can lag (would display ‘Processing’ message for 2-3 seconds while images save). Images were often blurry or not as sharp as I had hoped even after adjusting various settings.-I do like having a removable battery and accessories available with the S4 such as a wireless charger.-I don’t like having to close various apps at least daily when they lock up/crash (Android Force Close / Process Stopped Unexpectedly errors). This may be more developer related than phone related, however, this does not happen with my iPhone 5s.-Larger variety of apps. Not as restrictive as Apple in how you can modify and customize your phone (could be both a pro and con). I also like being able to use the Amazon App Store, where you can get a free download each day.Overall impressions:For me personally, the iPhone 5s is the way to go. Although the perfect phone, for me, would include combining the best features from both, Apple is the clear winner with regards to the features and functionality that matter most to me.", "Date": "December 28, 2013"}, {"Title": "Review on iPhone 5s 64GB (Space Gray) - Unlocked", "Author": "Michael Kintner", "ReviewID": "R19L3L0X460PDF", "Overall": "5.0", "Content": "I haven't purchased this product yet but the only thing that I want to say is that about the other people that type up these reviews about it being Unlocked and then when you get it it you can't use it with any other carriers other than T-Mobile or AT&T.;  This is because the unlocked iPhones are called GSM and these type of phones are only compatible with these carriers plus a few others.  Then if you want to use it with any carrier like Verizon, Sprint, etc...You would probably want to get the iPhone 5s 64gb (Space Gray) - Factory Unlocked to use it with these carriers and this is known as a CMDA iPhone.  Thank you for your time for reading this if you read the entire thing", "Date": "January 20, 2014"}, {"Title": "WARNING", "Author": "Delton23", "ReviewID": "R3ESX3LPDV7EEP", "Overall": "5.0", "Content": "WARNING OVERPRICING FOR THIS DEVICE THIS DEVICE SELLS UNLOCKED FOR 650 FOR 16GB, 750 FOR 32GB, AND 850 FOR 64GB AND THE PHONE COMES LOCKED WITH CARRIER", "Date": "October 8, 2013"}, {"Title": "Great phone", "Author": "High Plains Drifter \"Joe\"", "ReviewID": "R2FIETMBWK7S1F", "Overall": "5.0", "Content": "A little history on my situation. I just upgraded from a Blackberry Storm 2. My wife has an iPhone 5 and previously had a Motorola Droid 2. These are the phones that I can compare to, so keep that in mind when reading my review.My first impression out of box was that the phone was beautiful. I seriously didn't even want to touch it. I debated between space gray and white silver. I ultimately chose white silver because my wife has a black iPhone 5 and everything electronic I have is black. I though white was refreshing and if I can always put a case on to make it any color I want. I am so happy I chose white. It really makes the phone look fresh - sorry that is the best word I can find to describe it. The colors on the screen pop against the background. It doesn't show finger prints as much as my wives black phone.I got a clear case for the phone that just adds to the appearance. It also protects it from scratches and drops. In my opinion a case is required for an iPhone 5S. I honestly think that Apple designed it with the intent to use it with a case. Other competitive phones advertise a built in grip or that it feels better to hold than an iPhone, which is probably true. Apple made the phone so thin and light that adding a case just makes it feel better. Where other phones if you add a case it just makes the phone larger and heavier. I personally like putting my phone in a case. It is a way to personalize your phone and protect it. If the case gets dirty or worn, just spent $10 or $20 bucks and buy a new one.The screen on the iPhone is not as large as some of the Android giants. Android seems believe that a bigger screen is better. For me this doesn't make sense. I carry my phone in my pocket which you can do with the iPhone 5S because it is skinny enough to fit. I also like that I can reach all the screen with one hand. The screen is much larger than my old Blackberry. The retina display is beautiful. The colors and crispness are very pleasing to look at. It seem similar to my wives iPhone 5. Does clarity make a difference - yes it prevents eye strain. I have had no trouble with the moving elements on the display. I have no idea why people are complaining about that, but maybe they have some vision troubles or motion sickness issues. You can turn off the moving screen and I would expect future IOS 7 updates to allow users to disable all features people are complaining about.I use the phone for work and the speakerphone is in use for several hours a day. The sound quality is great on speaker phone, on handset and with headset. My wife noted an improvement over my Blackberry.The camera is incredible - even better than my wives iPhone 5. I am getting rid of our Nikon compact camera because the quality is so good. The video modes are so easy to switch between. It takes no time to shoot a phone and upload or send it multiple ways. I am still discovering all the features but some items like panorama and slow motion are just fun to use.E-mail is way better on the iPhone than my Blackberry. Calendar integration for Outlook is awesome.The speed of the phone is really fast. There are never any delays on anything and touch response is immediate and accurate. I have not had apps crash, but I don't doubt there are some buggy ones out there. Just nothing I am using.The touch ID has been getting a ton of attention - good and bad. When I got the phone it scanned my thumb and took just a minute to complete. I scanned it at all angles. It works perfectly. In the last month I have only had a couple times that I needed to reposition my thumb to get it read properly. It was due to me not having it on all the way. It will read your print from many different angles. This feature for me is HUGE. My company mandates a password that has lower, upper, number, special character 8 digit password. That is a total pain to enter in the phone throughout the day. My companies security team has approved touch ID as an alternate. That means no more password. Just to be clear the phone still has a password, so you can optionally use it. For example if your touch id gave you trouble or wanted to get access to your spouse or friend. Plus you can load multiple fingers. I don't know why other people are reporting troubles with touch ID. I assume either their phone is defective or their finger print is damaged by cracked skin. I have some experience with finger print scanners from a previous job and we did have one employee with dry hands that could not be read on a finger print scanner. The issue is that his skin was cracked and cracks kept healing and showing up in new places. In other words the scanner had nothing consistent to read. I am sorry for those people that suffer a skin condition but to blame the phone for not reading it is not really fair. Those people will have to use the password which is no worse than any other phone.Battery time seems ok. I need to charge it every day but I use it all the time. I am used to charging my phone every night. I purchased an external battery pack for recharge when I travel if I cannot find an outlet at an airport.I purchased the 32 GB the day after it was released and waited 2 weeks for delivery. Verizon sent it overnight delivery.Final thoughts - this phone is the best and fastest according to speed tests. It has changed my life my making things easier. That may sound over the top, but it is my first iPhone. After comparing it to the iPhone 5 I would say it is better. I don't have an iPhone 5C but as I understand the hardware is similar to my wives iPhone 5. Honestly I am sure you would be happy with an iPhone 5C if you are trying to decide. You would be missing the touch id and better camera. You gain colors and a more comfortable feel (without case). I chose the 5S because I use my phone all day for work. I need the best tools for my job.-----------------Added May 7, 2014I have had the phone for 6 months now. I thought I should include an update:First I want to talk more about the finger print scanner (touch ID). For me this is a huge feature because my company requires complex password entry. The touch ID allows me to instantly get into my phone by touching it with my thumb at any angle. The touch ID has always worked fairly well for me. When I first got the phone I would occasionally need to reposition my thumb. I also found issues after having my hands in water a long time because when your skin is wet it puckers up and therefore the fingerprint is distorted. That is totally acceptable in my opinion. I also found that if my thumb was only half on the button it may not work the first time, but I always got in on a second try,. With the recent IOS updates I get in on the first touch every time. It is really amazing how well it works. It works so well that I have tested it with non-registered fingers a couple times just to make sure it was still working. Compared to the new Samsung scanner that you have to swipe your finger, the touch ID is way better. It may seem minor but think about how many times you get into your phone every day.I carry the phone in my front pocket and it fits well in my jeans pocket. I have not broken the screen or had any issues with scratches. I use no screen protector because I like a clearer view on the screen.I still use a case on my phone and find when the phone is out of the case it is not comfortable to hold. I would recommend to Apple that future designs have rounded corners similar to my iPad so it can be used without a case. This would not stop me from buying the phone, because I would never use my phone without a protective case, but I know some people who do. I have dropped my phone several times with no issues, but I could just be lucky.The Apple ecosystem is amazing. Every good app is available for iPhone first or exclusively in some cases. The shear number of iPhones and the high end nature of the device ensures developer attention.The speed benchmarks indicate the 5S is the fastest smartphone. It also scores high on the most available memory. In other words if you buy a 16GB phone, keep in mind a good chunk of that is the operating system. Android can be bloated and take up considerable space. The Google versions are better. The 5S still scores as top selling phone with all carriers after 6 months, so the phone has staying power.The battery needs charging daily. I use it for business and spend considerable time on the phone, so I feel I represent an extreme user. Sometimes I wish the battery was bigger, which Apple could easily do by increasing the phone size to match competitors. That is how Samsung and Motorola get the long battery time, by just making the phone thicker and heavier. Apple made the choice to keep the size and weight down. There are extended battery packs you can purchase. I have one that I use when I am traveling and it more than doubles the battery life.Other phones have replaceable batteries. The battery on my old Blackberry went out after 1.5 years so the replaceable battery was great. Now by comparison I have a 4 year old iPod touch that still has a good battery and I know people who have iPhones several years old with good batteries. The point is that you only need a replaceable battery if the battery needs to be replaced. I know that sounds strange but if the battery is good it should last as long as the technology. For those that die early, they can be replaced at an Apple store. One other thing to consider - have you ever dropped your phone and the cover falls off. It happened to me all the time on my Blackberry, but with the iPhone when I drop it nothing falls apart.Other phones have expanded memory capability. I have the 32GB version and the only time I have had trouble is when I loaded a bunch of videos on for watching while I work out. I had hours of video that I had already watched on the phone, so it was just a matter of me needing to delete what I had watched. As long as you are removing content you dont need from the phone, I found 32GB is more than enough.The camera continues to work great. I have stopped using my camera and video cameral and I am getting rid of them. Everything I shoot is with my iPhone and the video is superior to my 4 year old Nikon camera and Panasonic video camera. I mean superior when shown on my 50 inch TV. When you consider that a good phone can replace devices that cost me six hundred dollars four years ago, that is amazing.I am really still waiting for the true power of the 5S to be realized. The motion co processor and 64 bit CPU are so new that I am not sure they have even scratched the surface on what they can do. That is great because it means I will be able to enjoy future IOS updates and new features for a long time to come.As I write this, I am waiting for a MacBook Air to arrive from Amazon. The iPhone has caused a chain reaction making me convert to Apple. I used to be the guy that said \"a windows laptop gives you more power for your money, Apple is just paying for a name\". I was wrong and I am here to tell you it is ok to convert to Apple.", "Date": "October 18, 2013"}, {"Title": "Dont Promise an unlocked phone when you cant give one", "Author": "Daniel Encinoza", "ReviewID": "R3QH67Y83PZI6X", "Overall": "1.0", "Content": "Here is my advice, if you can buy a Iphone 5s from the Istore or try to buy it unlocked from any carrier do it because here in Amazon they promise you a unlocked phone for 100 more dollars than its original price and guess what, you get a locked phone that has a AT&T; gsm card, i live here in Venezuela, i bought a new nano sim for my phone and it didn't work, if you are out of United States and you want a Iphone 5s i recommend you to wait for it to arrive to your local carriers.", "Date": "December 9, 2013"}, {"Title": "I phone 5s unlocked", "Author": "Margaret I O Wandolo", "ReviewID": "R1Y1JG5GFAFNTY", "Overall": "1.0", "Content": "I bought an unlocked phone but apparently it is locked and we are unable to use it. I do not understand why it was shown as unlocked and yet it is not. We are now expected to pay money for it to be unlocked. Kindly assist.", "Date": "January 3, 2014"}, {"Title": "I WAS LIED TO THE PHONES ARE NOT UNLOCKED", "Author": "ron johnson", "ReviewID": "R3ICG5GQ8K9OHM", "Overall": "1.0", "Content": "This company is lieing there phones are lock to AT&t; SERVICE you can only use these phones with AT&T; so don't buy them. i am hope amazon will help me with this problem or i am out 604.00 dollars.", "Date": "March 18, 2014"}, {"Title": "Pretty cool but mostly bells and whistles", "Author": "kitrulz", "ReviewID": "R3UVNUE38BAMDP", "Overall": "5.0", "Content": "I wasn't planning to buy this phone but life happened and I had to switch cell providers. I wanted the 5 (nice discount and I like the look of the black metal rather than the colored plastic of the 5c) but they were sold out. The store I was at happened to have 1 black (space grey) 16g left so I decided to go for it.I was upgrading from the 4s which I still think is a great phone. The 4g/LTE capabilities of the 5s are really great, the larger screen is also really great, but other than that the extras that are 5s exclusive are more of a gimmick at this point. The fingerprint sensor is a nice touch but not a necessity as your phone could still get hijacked. It does work pretty well and I like that you can program up to 5 fingerprints (I have thumb and index for both hands programmed on mine as well as the 4 digit pin) the camera is definitely better in low light, but I don't know of the dual flash actually makes a difference for me that is noticeable. The slow motion video camera is fun but I wish you could do more than one section in slow mo (can decide which section is slow mo but can't split it up. You also can't post slow mo to Instagram which is what I use video for mostly. Haven't tried with vine)I mean, don't get me wrong, it's a nice phone and definitely a notable upgrade from the 4s, but I would've definitely rather had more space on the 5 for the same price or waited for the 6 (supposedly going to have a larger screen.) But if you're an apple fan and due for an upgrade it is a really nice device and you'll probably be happy. I wouldn't upgrade from a 5 though. The biggest thing I care about is this phone has the dependability I have come to expect from Apple (the main reason I switched back to iphone from the buggy android incarnations I was experiencing a couple years ago) and of course the resale value is higher with apple devices later on. So overall it is a good phone and I'm happy with it, but the exclusive upgrades may or may not be worth it depending on what you're looking for.", "Date": "October 16, 2013"}, {"Title": "Don't support", "Author": "funsani moyo", "ReviewID": "R3NYP8TPJ09SR", "Overall": "1.0", "Content": "I suggest you purchase this device from the apple store or wait until  the device is sold by your local carrier. I purchased one and received a LOCKED iphone 5s I don't live in the US and now I have to pay more money to have it unlocked sighh DON'T SUPPORT these amazon sellers", "Date": "December 10, 2013"}, {"Title": "It is not unlocked!", "Author": "Amazon Customer \"manoelaleao\"", "ReviewID": "RLPEZ3YTVF817", "Overall": "1.0", "Content": "It was not unlocked as advertised by the seller. It jad AT&T; sim card inside it and it doesnt work with other carriers. I live in Brazil and now I have to pay extra money to unlock it.", "Date": "March 7, 2014"}, {"Title": "BEST OF THE BEST", "Author": "Jennifer Jahn", "ReviewID": "R3K2P86OU4UH86", "Overall": "5.0", "Content": "I love this phone way better than the iPhone 4. The extra long screen makes way more of a difference than you would think. Now that I am used to it and see someone with a regular sized iPhone 4 I feel bad for them. Such a great device- I will never go with any other brand", "Date": "November 5, 2013"}, {"Title": "please don't buy this phone", "Author": "nicknickcnick", "ReviewID": "R1PN6CKH61L8MD", "Overall": "1.0", "Content": "Don't buy this , iy is locked. i was crying. this phone can't use network.This is doesn't use. I want to know how to fix this problems.", "Date": "November 21, 2013"}, {"Title": "Apple iPhone 5S 32 GB Space Gray", "Author": "kellyclarksonfan", "ReviewID": "RZKB4XC8ZA664", "Overall": "5.0", "Content": "I recently had a Droid phone, and when it started to lose functions and work properly, I got the iPhone 5S. It is a lot different than I had expected.Cons:I had expected Siri to be more accurate, even though it is helpful sometimes.I wish you could have Live WallpapersWhen you set a photo to wallpaper, it zooms in too much on the photoScreen size- I wish that it was a bit bigger, considering that the Droid MINI has a bigger screen than the iPhone 5S, Apple kinda made a few customers unhappy.I wish that you could get most of the same apps as you can on Google PlayPros:The fingerprint scanner is amazing. But if you don't think that you're gonna use it, just get the 5C for $100 cheaperThe iPhone 5 and 5S can apply to the same case- Something that I really like about itiOSiSight CameraAbility to connect by iCloud- I can watch TV shows, play movies, or listen to music without downloading it to my iPhone 5SSlo-Mo Video option, square, and panoramaA7 Chip and Processor- It literally does make it nearly as fast as a computerAnd a lot more- Too much to explainOverall, this is a five star product and I would only recommend this if you care about how fast it is, the fingerprint scanner, slo-mo video, or screen size.Or, the 5C- Not as fast (but still fairly quick), and the 4-inch display.If you don't care about any of this, but you still want iOS 7 and siri, or just an iPhone in general (you get the point), you can get the iPhone 4S, with Siri, but not as big of a screen size, for usually less than a dollar with a two year contract.Thanks!!!", "Date": "December 30, 2013"}, {"Title": "Technologically brilliant, but with some practical limitations", "Author": "Michael J. Edelman", "ReviewID": "R346D03W7IRNJB", "Overall": "4.0", "Content": "After years of prodding from friends (\"What? A techie like you doesn't have an iPhone???\") I finally broke down and bought one- the top of the line, with all the bells and whistles, and the maximum memory. It's a bit of a hit to the pocketbook, but I thought the payoff would be in portability and the computing power. And for the most part, I've been pleased with it. I love how it shares data with my iMac and iPad. But I do have some issues.It's certainly amazing how Apple has managed to cram all that computing power and battery life into such a tiny package, but they've done so at the expense of ruggedness and battery life. The first purchase I made for mine was an Otterbox Defender, and the second, an auxiliary battery and a second charging cord for in-car use. The case, because I can just see dropping this wand watching $849 turn into several ounces of inert plastic, glass and silicon, and the cord and battery because compared to the cell phones I've been using, this phone is a real power hog. While it gets a lot of oohs and aaahs for its tiny packaging, it would be nice if they made it a bit thicker and doubled the battery capacity. It would be even nicer if they made a ruggedized version with extended battery life; I'm thinking of spending another $99 and buying a Morphie case with a built-in battery.I would have also like to see Apple provide better tools for importing data from an older technology cell phone. The use of the nano-SIM means that this was the first phone I has where I couldn't simply slide the card out of one phone and into the next. It also means that I can't quickly switch to a back-up phone if this one suffers a failure and needs repair or replacement.So yes, an impressive phone and impressive technology. But not quite as practical as I'd hoped.Two week Update:As the novelty has work off, and I'm no longer checking it every few minutes just because of the novelty of it all, I find that the battery life is much better than I'd thought as first. But I'm still keeping a charger at bedside, a charging cord in my car, and a small back-up battery in my parka. I'm also finding more useful apps for it- even after having used an iPod Touch and an iPad for years. In fact, I'm starting to realize tha Apple has now successfully locked me into the iPhone.... forever. Sneaky, Apple. Very sneaky.", "Date": "December 14, 2013"}, {"Title": "Don't pay any more than 849 + taxes for this device", "Author": "Amit", "ReviewID": "R3M8DO6FW1JOKH", "Overall": "5.0", "Content": "Get the AT&T; iPhone 5s as \"device only\" at full price (849 + tax).Set it up as a new phone.Connect to iTunes on your computer using the lightning and do a factory reset from itunes.Voila !! iTunes will show you your phone as unlocked !!Paying anything more than what i mentioned is foolish.I got it from Apple Store and unlocked it in an hour.In case you goof up, you can always return the phone within 30 days :)", "Date": "October 8, 2013"}, {"Title": "iPhone was not unlocked", "Author": "Lowell L.", "ReviewID": "R80PSDO0O9YOJ", "Overall": "2.0", "Content": "The phone itself is great, however, it was advertised as unlocked and it wasn't. It was locked to t-mobile network.", "Date": "December 6, 2013"}, {"Title": "iPhone 5S", "Author": "Majed K. Alghurabi", "ReviewID": "R23G4XC1D83FZ7", "Overall": "4.0", "Content": "I liked the device and the new Touch ID feature. I didn't find any difference between iPhone 5 & 5S in regards of the Camera! I don't think that the iPhone 5 owners will find it attractive to upgrade from their phones to 5S!", "Date": "October 23, 2013"}, {"Title": "Warning", "Author": "Ash", "ReviewID": "R2VK3V7SI39TFH", "Overall": "1.0", "Content": "Do not buy u can get one on Apple for much cheaper. The phone here is a locked phone do not buy", "Date": "November 14, 2013"}, {"Title": "Iphone 5s best", "Author": "Fabiano", "ReviewID": "R3SJ2MG73BNHHS", "Overall": "5.0", "Content": "5s is the best iphone! The speed and screen are amazing! I had a 4s and i decided to buy the 5s... No complains about it!", "Date": "December 1, 2013"}, {"Title": "Excellent choice", "Author": "Nour", "ReviewID": "R1RZXVXEDSZUYM", "Overall": "5.0", "Content": "As usual , very nice reliable and wonderful phone.Totally recommend it to anyone who is looking for an easy, fun, professional phone.", "Date": "December 29, 2013"}, {"Title": "the best service ever .", "Author": "ESTER .H.", "ReviewID": "RBQ9ZB72ES3YU", "Overall": "5.0", "Content": "i think,it was the best  experience that i got on that day.first of all i ordered  my  iPhone  on weekend and  i got it on Monday morning before 10:00 am.it was in good condition and the delivery was quick.thank you.", "Date": "November 26, 2013"}, {"Title": "Best iPhone yet", "Author": "Wael Bubseet", "ReviewID": "R33088JBQUHWWR", "Overall": "5.0", "Content": "iPhone 5S gold is really amazing. Fast processor, good camera, and beautiful design. It also comes with the beautiful iOS 7 which is the best operating system to iOS devices so far, in my opinion. I'm in love with this iPhone!", "Date": "November 7, 2013"}, {"Title": "Not as description", "Author": "peter", "ReviewID": "R2IMUA6B8TRJZ4", "Overall": "1.0", "Content": "because it was locked, not as the description online, so i considered it as cheating from the provider, but i will keep trusting Amazon", "Date": "November 28, 2013"}, {"Title": "Very fast and so many app's.", "Author": "Tiago Guimaraes", "ReviewID": "RBNT4EA1ICAZC", "Overall": "5.0", "Content": "Very fast and so many app's. Everything is easy to do, nice photos and videos, and the touch id fingertip identity is a real inovation to make it faster than ever.", "Date": "November 25, 2013"}, {"Title": "It's unlocked", "Author": "Nathalia", "ReviewID": "R10R7B500ZABOM", "Overall": "5.0", "Content": "Truly unlocked (worked in Brazil) amazing phone. Really love it. There is no big differences between iPhone 5 and 5s but I think still worth it to buy", "Date": "November 3, 2013"}, {"Title": "Believe the hype", "Author": "mojo", "ReviewID": "R1GVT3LTGQNTZP", "Overall": "5.0", "Content": "This phone is nothing short of spectacular.  Smooth as butter. It never lags, app store has a ton of apps and battery life is awesome. I jumped from android with glitchy slow apps to a high end device.", "Date": "December 11, 2013"}, {"Title": "excellent", "Author": "Gabriele Grunig", "ReviewID": "R3MIPGMZCFBYDR", "Overall": "5.0", "Content": "perfect, love it.  Works 'out of the box'.  It makes excellent pictures, works as flashlight, phoning is excellent, texting perfect, it's unlock so that I can swab providers,  it is super-fast that's why the internet runs even on 3-4g very well.", "Date": "November 4, 2013"}, {"Title": "Excellent Iphone", "Author": "Benjamin Navarrete", "ReviewID": "R3TZFZ9AJE2RNX", "Overall": "5.0", "Content": "It is faster than iPhone 5, and it worked here in Mexico very well. No problems with the system in Mexico", "Date": "November 1, 2013"}, {"Title": "Unlocked phone arrived just fine", "Author": "MET", "ReviewID": "RP7QER8V1GD73", "Overall": "5.0", "Content": "I live in Ecuador, and I bought the unlocked iPhone 5s. I sent it to some relatives in Miami, who then brought it to me personally. Contrary to other reviews, the phone is indeed unlocked, and it works perfectly with a new nano SIM card. Just make sure that you double check the specific seller you're buying it from, read their reviews, and then make sure the order is fulfilled by Amazon to have an extra amount of certainty. I suppose some sellers have mistakenly sent locked phones, that's why you have to do the homework and check them individually.", "Date": "January 31, 2014"}, {"Title": "iPhone 5s: state of the art and hard to fault", "Author": "The Guardian", "ReviewID": "R3KWG6J16N8H5D", "Overall": "5.0", "Content": "In the past 4 years I have owned Android and (the now virtually redundant) Blackberry phones prior to buying an iPhone 5s in early December 2013. Overall I prefer the iPhone over the others and would recommend it, with a few minor reservations.The iPhone 5s is superior in these areas:1. The design is a work of art, finely sculpted and proportioned; a pleasure to hold and use2. The screen is fantastic; big enough to be really useful but small enough for the phone to be easily pocketable. The Blackberry screen was maybe too small for most applications except for email, and the Android too big and heavy for portable use. I particularly like the long narrow screen on the 5s3. A lot of thought has gone into the way a user can navigate around the screen through the different functions. I have owned an iPod Touch for a couple of years and have become a fan of Apple's clear and simple graphics: on the 5s, it's even better. The software never crashes, which it did with both my Android phones frequently4. For a user with larger than average hands/fingers, the on-screen keypad of the 5s is really well designed - especially true if you use the phone in landscape format which has the effect of widening the keypad. In comparison, the Android was frustrating and not very user-friendly and the Blackberry Storm completely hopeless - though the permanent keypad on the Curve was great5. The ring tone & speaker volume is louder and clearer on the iPhone than any of its rivals6. Phone reception is the best. I don't know how Apple manage this, but I have made and received calls in locations where other phones don't seem to work  - like travelling on the London underground and in deep underground car parks7. The camera is so good it's up to the standard of a dedicated Canon or Nikon compact, for the first time on a cellphone8. The memory (64GB) is vast, with a storage capacity so huge you're never likely to need more no matter what you download and store on it9. Siri, iMessage and Facetime are genuinely useful apps, not just gimmicks. They actually work well. The fingerprint scanner works too, though how much of a real security feature this is remains doubtfulGripes: very few -1. The battery life isn't great, but no worse than the Android Galaxy 4 and you can substantially improve it on the 5s by turning off power-hungry applications2. The unique nano-SIM means you can't swap the SIM over to another phone in an emergency, or for example if the phone is damaged and needs repair3. The price of the 5s is a bit steep, but here you really do get what you pay forOverall I have become a reluctant Apple convert. It's easy to see why they have become market leader with such an excellent product. Of course in another 2 or 3 years the tech will have moved on again, there may be a new market-leading manufacturer and the 5s will be an antique. But until then, the 5s for me is the King of cellphones.Finally, a lot of one-star reviews posted on amazon are from buyers griping about having been shipped locked phones by online sellers. This must be very frustrating but these are not really product reviews, they are complaints about the seller. The solution is easy: buy from an Apple store and they'll set up the new iPhone for you and transfer all the data from your old phone.", "Date": "January 15, 2014"}, {"Title": "Great Phone", "Author": "CH", "ReviewID": "R2Q6WE3KF87ZAJ", "Overall": "5.0", "Content": "this phone is great...Pros:Touch ID is fantasticSIRI understands accentssleek designhigh resolutionfaster processor makes a big differenceGreat cameraCons:IMESSAGE has problems and i need to restart phone to send messages some timesEssentially, this is a fantastic phone!!", "Date": "December 25, 2013"}, {"Title": "Good and believe unlocked (model A1533)", "Author": "MONICA MARO DA SILVA", "ReviewID": "R5BOO6GLM3447", "Overall": "5.0", "Content": "Belive, it's really unlocked (Model A1533). I bringed it to Brazil and It works nicely making calls and with 3G.", "Date": "December 24, 2013"}, {"Title": "The phone is amazing �", "Author": "Raneem A.", "ReviewID": "R2KJUHT3X2K5D7", "Overall": "5.0", "Content": "1-The Iphone is unlocked2-the Iphone is super amazing3-so in love with the color4- i'm writing this review with my gold Iphone 5s5- thankkk youuuu thankkk youuu so much6- couldn't thank you enough ❤️❤️❤️❤️7-I recommend this phone for everyone8- i'm from saudi arabia and the phone works perfectly ��❤️9-the seller is : Tech Tycoon ❤️❤️", "Date": "December 21, 2013"}, {"Title": "Not happy", "Author": "bob duffin", "ReviewID": "R32MSZ5ART5LUI", "Overall": "2.0", "Content": "Battery life is very disappointing. Uses at least 50% charge a day without a lot of use! wifi usually off", "Date": "November 15, 2013"}, {"Title": "Gregg L. Friedman MD Reviews iPhone 5S", "Author": "Julie L. Friedman", "ReviewID": "R19K8ZX8PGZYRR", "Overall": "5.0", "Content": "The iPhone 5s is wonderful. Apple did a wonderful job. It is simple and easy to use and packed with many great features. The dual antenna provides better reception than the iPhone 4. I give the Apple iPhone 5s a 5 Star A++ rating. By Gregg L. Friedman MD", "Date": "April 22, 2014"}, {"Title": "Apple has done it again", "Author": "Diego R.", "ReviewID": "RP5TIB824LAV6", "Overall": "5.0", "Content": "This is an amazing phone. I switched my iPhone 4 for a 64gb HTC One X+, but now that I switched back to this model, I 'm never going away again.I totally recommend this phone. The design is beautiful and clean. It doesn’t weight much and the size is perfect! Not as big as the other smartphones on the market.", "Date": "April 16, 2014"}, {"Title": "iPhone is iPhone", "Author": "Ignacio Holguin", "ReviewID": "R23OC1NK4BNN9V", "Overall": "5.0", "Content": "I used to have a galaxy S3 but I changed it for this iPhone 5s and I can tell you iPhone is iPhone. The best iPhone ever, works perfectly and I really like it. Recommended in a 100%.", "Date": "April 6, 2014"}, {"Title": "Iphone Locked", "Author": "Roberto", "ReviewID": "R373357OKSFXMG", "Overall": "5.0", "Content": "You have to be aware about what are you going to buy because they sell cellphones overpriced and it says that is unlocked but when you receive the phone, it is locked. Dont buy any phone to these guys because they deceive you and then you will pay more for a cellphone locked wich is not fair. Dishonest people. I bought this iphone and they sent me a locked one and I had to get my iphone unlocked so keep in mind that.", "Date": "March 19, 2014"}, {"Title": "iphone 5s", "Author": "Jiaxin Yin", "ReviewID": "R2Y1CNRATPD66M", "Overall": "5.0", "Content": "i have been using iphone for 3 years and I am so used to it.. No matter how other brands of smart phones look attractive, i think i will still choose iphone in the near future... BTW love the silver one!", "Date": "February 23, 2014"}, {"Title": "The Phone You Want & Need!", "Author": "Francisco Arias", "ReviewID": "R2B3SYR3DIO75U", "Overall": "5.0", "Content": "Flawless is an adjective that seldom applies to anything, but in this case is highly appropriate for this device, it's far more than a phone it's a companion to your daily life.It disregard those things you don't need and do perfectly the very things you want to be done.A must have in this day and age.", "Date": "February 22, 2014"}, {"Title": "Apple Picking", "Author": "JB", "ReviewID": "R3H5DZLX3JEBZD", "Overall": "5.0", "Content": "Attempting to review a device with the dizzying profile of the iPhone is oddly bemusing; it means different things to different people, and in the end, it depends what you want or expect to get out of it. To use it only as a phone is a bit like living in the Taj Mahal when all you really need is a tent. I've only had the iPhone for three days, and it's my first. This review will therefore be from a new-user's point of view and without reference to the competition. In other words, what it's like to live with an iPhone 5s.The presentation of the phone, with its exquisite Zen-like packaging, builds the anticipation, until finally the waiting's over and there it is: looking and feeling like a bar of gold or precious metal, its solidity and weight are somehow reassuring. The harmony in the architectonics is a triumph of aesthetics, and that's without even switching it on. But before you do that, you'll be required to fit your nano sim card. Using the pin supplied, this requires the dexterity and sensitivity of a concert pianist matched with the optical facility of an eagle, but once done you're ready to fire it up.If you already have other Apple devices you'll find your phone exchanging data straightaway, with your contacts, photos etc being ported over the airwaves. There's relatively little to do in the way of set-up as most of it appears to happen automatically. You can then personalise the phone even further, first with the famous finger-print. This involves (as does so much from now on) in going into Settings. Choose Touch ID and after rolling your digit around on the Home button, the sensor registers your details, and from then on opening up the screen is quick and easy, plus you can use it in the ITunes store. If you can't decide whether you'll be using your finger or your thumb then why not register both, and if you want to allow anyone else access to the phone then they can add their fingerprint too. An extra precaution of a numerical passcode is required to access your credit card information. Once set, this also transfers to other devices, meaning you never have to manually fill in an internet payment form again.I have the 16GB model, and possibly some juggling might be required in deleting and later re-loading apps/photos/downloaded songs on Spotify, but that doesn't look as though it'll be a problem for some time, as at the moment there's 11GB free. What might be an issue however is data allowance from your provider; I seem to have got through 100MB already, and that's only in a couple of days. It might be best then to choose a contract with an unlimited data allowance if you are going to want to make the most of the iPhone's entertainment value.Navigating around the phone is intuitive enough, the Home button being the key to changing between apps. Double-click this and it will bring up all of your open applications, which is often a clearer way of orienting yourself. A swipe upwards reveals the torch (which is very powerful), the calculator, the timer and camera, as well as Wi-Fi, Bluetooth, Do Not Disturb shortcuts, plus your music player. A downward swipe within an app displays your schedule. A downward swipe on the Homescreen brings up the search facility, which can be used with confidence. Siri, the slightly surreal footman character can be activated by bringing the phone up to your ear. Using its mystifying powers, Siri can then find the way to the nearest Tandoori or be grilled for the sum of 4.3339 + 2.7, its seemingly inexhaustible knowledge providing hours of amusement. If Siri can't solve your problem directly it'll find references on the web which should provide you with an answer.YouTube and iPlayer are rendered in a crystalline clarity and the dimensions of the 5s give a panoramic quality to the theatre. The sound is remarkably full, and the earphones supplied seem excellent. Photos are catalogued in Years, drilling down to Collections and then Moments which sounds overly complicated but is actually coherent in use and quick to comprehend. The quality as you'd expect, is uniformly excellent and the new flash arrangement leads to an enhanced quality in poor light.From then on the sky really does seem to be the limit, with apps for just about every conceivable occasion. In short, the iPhone is a device which you possibly never knew you needed, but once you've lived with it for a few hours, it's hard to imagine life without.", "Date": "November 10, 2013"}, {"Title": ":)", "Author": "Hyojin Kyle Kim", "ReviewID": "R3LDD2CESGF2A2", "Overall": "5.0", "Content": "Thank you, for getting things done in a short noticeYou did great job !I am glad I got it :)", "Date": "November 8, 2013"}, {"Title": "A beautiful and stylish phone with some new features! This shows the silver and gold versions and ours are from Verizon.", "Author": "jjceo", "ReviewID": "R5733U3IP1WLF", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1HJK77EXIPB93embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1HJK77EXIPB93refresh_preplay() {\n\ndocument.getElementById(\"cv_mo1HJK77EXIPB93chiDiv\").innerHTML = document.getElementById(\"cv_mo1HJK77EXIPB93hiddenPre\").innerHTML;\n};\ncv_mo1HJK77EXIPB93refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1HJK77EXIPB93so;\t   \n\n\nfunction cv_mo1HJK77EXIPB93loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1HJK77EXIPB93so = new SWFObject(swfLocation, \"cv_mo1HJK77EXIPB93AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1HJK77EXIPB93so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1HJK77EXIPB93so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1HJK77EXIPB93so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1HJK77EXIPB93so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1HJK77EXIPB93so.setAttribute(\"height\", swfHeight);\n          cv_mo1HJK77EXIPB93so.setAttribute(\"width\", swfWidth);\n          cv_mo1HJK77EXIPB93so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1HJK77EXIPB93so.write(\"cv_mo1HJK77EXIPB93flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1HJK77EXIPB93', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1HJK77EXIPB93';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1HJK77EXIPB93', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1HJK77EXIPB93loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1HJK77EXIPB93\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1RAGJHRKL78CB\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1RAGJHRKL78CB\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R5733U3IP1WLF\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1RAGJHRKL78CB/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1HJK77EXIPB93duration')) {\n      document.getElementById('cv_mo1HJK77EXIPB93duration').style.display='none';\n    }\n    cv_mo1HJK77EXIPB93loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1HJK77EXIPB93loadSwf(movieID, playerVersion) {\n   return _cv_mo1HJK77EXIPB93loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1HJK77EXIPB93newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1HJK77EXIPB93', 0, h);\n}\n\nfunction cv_mo1HJK77EXIPB93resetPlayer(w,h,bw,cc) {\n  cv_mo1HJK77EXIPB93newHeight(h);\n\n  cv_mo1HJK77EXIPB93so.addVariable(\"resetBandwidth\", bw);\n  cv_mo1HJK77EXIPB93so.addVariable(\"cacheCode\", cc);\n  cv_mo1HJK77EXIPB93so.setAttribute(\"height\", h);\n  cv_mo1HJK77EXIPB93so.setAttribute(\"width\", w);\n  cv_mo1HJK77EXIPB93so.write(\"cv_mo1HJK77EXIPB93flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1HJK77EXIPB93RollOverImg = new Image();\ncv_mo1HJK77EXIPB93RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81kJKcEUegS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1HJK77EXIPB93preplay = document.getElementById('cv_mo1HJK77EXIPB93preplayImageId');\nif (cv_mo1HJK77EXIPB93preplay) {\n  cv_mo1HJK77EXIPB93preplay.onmouseover = function() {\n    cv_mo1HJK77EXIPB93preplay.src = \"http://ecx.images-amazon.com/images/I/81kJKcEUegS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1HJK77EXIPB93preplay.onmouseout = function() {\n    cv_mo1HJK77EXIPB93preplay.src = \"http://ecx.images-amazon.com/images/I/81kJKcEUegS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1HJK77EXIPB93preplay.parentNode;\n\n  var cv_mo1HJK77EXIPB93currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1HJK77EXIPB93currentClick) {\n      return cv_mo1HJK77EXIPB93currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 8:02 MinsMy wife and I have been using the iPhone 4 since it was released and it was time for an upgrade.  We don't use unlocked phones as we use Verizon but I thought that some people would like to see what the phones looked like and hear about the phone installation process from someone who has gone through it.  One phone was easy to set up and install and the other phone had issues.  Even though the phones came from Verizon the gold 64 GIG phone SIM would not register with Verizon's servers.  It took Verizon about 45 minutes to get the phone's SIM to be forced into the system while I was on the phone with them. This has been a problem with this new phone and the carriers are slowly resolving the issues.The fingerprint recognition system is really neat and easy to set up.  You can register 5 fingers and so I registered two of mine depending on the different ways that I would grip the phone and then my wife registered on my phone.  We then did the same thing on her phone.  I immediately changed the simple password to a complex one and I strongly suggest that you do the same thing.  The four digit number code is just too easy to break.  You can program your phone to erase itself after 10 failed log in attempts but we have not done that as of yet. I figure that the fingerprint access and a complex password will slow them down a lot!In my video I did not go through the technical details as Apple has them plastered all over the web in a much better format that I could do justice to.  For us we were looking to going to the LTE system (Faster Speed), making our phones be personal hotspots for our WIFI iPads, the finger print security and the enhanced camera and slow motion videos were of interest for us.I did notice that the iPhone 5S runs warmer and it feels warmer in my hand.  I had my iPhone 4 in an Otterbox Defender case all the time that I owned it and perhaps it was just as warm and I never noticed it because of the case.  We were able to trade in our old phones and we got a reasonable trade in value for them and that helped with the expense of a new phone.After the phones are registered you can only make basic calls and texting but all of your personal information is not on the phone.  I don't use iCloud as I don't want to pay for 64 GIG of backup space but I use iTunes religiously.  I backed up both of our phones before I turned off the old iPhone 4 products.  I then connected the new iPhone 5S phones and one took 1 hour and 35 minutes and the other about 1 hour and 45 minutes to sync.  I was immediately asked to upgrade to a new version of IOS 7 which took an additional 30 minutes or so for each phone.  Now all of our data was there except our MP3 music and MP4 videos that had to be reinstalled.  If you use apps that require unique passwords you will have to reregister and reenter your passwords.The phones knew who we had our email accounts with but again we had to re-enter in our email account passwords and then they immediately downloaded.  Syncing , downloading emails and adding music and videos to your new phone is much faster thanks to the new quad core CPU.The phones are beautiful and stylish and we both like our phones a lot.  We both would rate them as a 5 star item.  We like iPhones and we have a ton of iTunes apps which so far has kept us rebuying iPhones. It has been a good product line for us and so far we are happy.", "Date": "September 27, 2013"}, {"Title": "this has nothing to do with the phone itself....but the seller", "Author": "sheldon", "ReviewID": "R1QA8OGXPCWFKM", "Overall": "1.0", "Content": "this phone was purchased from HOUSE OF GOODS. NEVER BUY ANYTHING  FROM THIS PERSON !!!! THEY POST THINGS FOR SALE AND THEN CHARGE YOUR CREDIT CARD. THEN THEY MAKE A LABEL...WHICH GENERATES A TRACKING NUMBER AND GIVES YOU THE FALSE IMPRESSION THAT YOUR STUFF HAS SHIPPED. I GOT THIS  INFORMATION STRAIGHT FROM USPS. YOU WILL NOT REASLISE ANYTHING UNTIL AFTER YOUR DELIVERYDATE HAS PASSED AND YOU RECIEVE NOTHING. BE AWARE !!!! DO NOT BUY ANYTHING FROM THEM......HOUSE OF GOODS......YOU HAVE BEEN WARNED !!", "Date": "May 5, 2014"}, {"Title": "Clunky to use, very limited in what one can do.", "Author": "10splayer", "ReviewID": "R3LPIID7W8ARVX", "Overall": "1.0", "Content": "If you're going to use only Apple downloads and apps, and not use Audible or anything else that isn't bought from Apple, then this phone might be okay.  However, Apple discriminates against products not bought from the iTunes store.  For example, an audio book bought from iTunes can be backed up to the iTunes library on one's PC.  Not so with an Audible book downloaded with the Audible app.  So far, I have not found any way to back it up into the iTunes audiobook library on my PC.In addition, Apple seems to use my cellular data on a daily basis to upload about half a megabyte (think of a 100,000 word term paper's worth of data) daily, even when I have turned off push notifications, Siri, location services, and just about everything else.  The only thing that stops this upload is turning off wifi and cellular data.  So much for  having a \"smartphone\"!Then there's the matter of \"garbage collection\".  When one loads something onto the phone and later deletes it, the storage doesn't seem to become available.  One has to back up the phone and restore it in order to have that storage amount available again.And, then there are the bugs.  Sometimes the backup and restore fails to restore the photo album.  Other times, it fails to restore the ringtones.  And, if you manage to change the setting for manually dealing with music, a restore might try to load all your audiobooks onto the iPhone.  The only thing that gets this to stop may be to restore to factory settings, and then to manually add back everything.", "Date": "March 28, 2014"}, {"Title": "IOS is Programmed to eat away at memory", "Author": "Steplander", "ReviewID": "R2R9W7OLSS3WFL", "Overall": "3.0", "Content": "The iPhone 5s is a pretty amazing phone and I would get the next version, when it comes out, if it weren't for the following MAJOR problem:APPLE has programmed the iOS so that all messages, inbound and outbound, including attachments, are saved on the phone with absolutely no option, within the OS, to delete them.Sure, they let the user THINK they have deleted the messages and attachments, but a quick dive into the phone's list of memory hogs shows that the MESSAGES app is taking up more and more space every day.If you enjoy sending and receiving pictures and videos via message, every time you do, it deletes from your available memory with no option, within the OS, to recover the memory that was just used.Now some people, in the conspiracy world, may think that this is a way for your personal messages to be recovered or spied on.... But I think the reason is more insidious. They don't care about your messages. They care if you buy another phone and buy one sooner and buy one with MORE memory because they cost MORE. And, yes, that new, more-memory, more expensive I-phone is going to experience the same memory choking end.Yes, I have confirmed that Apple is aware and has been aware of this \"problem\" and that they have been aware of it through the release of one iOS after another. Considering the logical ease of programming the ability to actually delete a file and recover memory, (we do it all of the time when we take photos off the phone) it's a logical conclusion that APPLE wants this included in the design of the phone.It's highway Robery It's unethical. It's grounds for a class-action lawsuit.And it's why I would never buy another one.Extra note about the 5s: (and APPLE is also aware if this one... And has no plans to fix it.): the power button is seated in such a way that it rattles. It may not sound like a big deal when you first hear it. It's a light tapping. But, the way the button is designed, pill shaped and curved on each end, when you are taking a video, the button teeters within the case portal and rattles. To the ear, it sounds like nothing. On the video it sounds like garbage cans being hammered on.Apple's response is that \"it is not a defect. It is a \"feature\". It was designed for those people who accidentally dunk their phone in soda or coffee. If they do, this special metal button won't stick\"I've actually talked to a few APPLE \"geniuses\" who read this prepared response to me. Ingenious! Call a defect a \"feature\" and avoid a recall.So, there is my sincere review of the iPhone 5s.I cannot suggest a different phone because I have no idea if the other companies are resorting to the same nasty tactic. If I learn more, I will update this post.", "Date": "March 11, 2014"}, {"Title": "it's a locked phone", "Author": "Lamaia N.", "ReviewID": "R2LTLHPOV2G1D8", "Overall": "1.0", "Content": "I bought an unlocked phone and ended up with a locked phone on at & t. We filed a complaint for the seller and so far we did not get back to me. So now amazon is filing a a to z guarantee. I am so upset because I wanted the phone badly and it flew all the way from us to egypt and I ended up with a uselless machine.", "Date": "December 28, 2013"}, {"Title": "One Big Flaw For Me...", "Author": "Avid Camper \"WS\"", "ReviewID": "R3GNRPFDWIGMLV", "Overall": "2.0", "Content": "I was so very excited to get my new iPhone 5S in gold.  I had to wait as it was on back order.  My excitement turned to frustration within a day and I had the phone returned within 3 days.  This new phone would NOT recognize my finger touch.  I would have to try over and over--sometimes twenty times to get the phone to respond.  Sometimes, even then, it would not.  I contacted Verizon, my cell provider and was told my hands were too cold for the screen to respond.  I was told to purchase special gloves with something in the finger tips or a stylus as large around as a marker and as long as the phone to use for everything on the screen.  I was told there was no case available to store the phone and stylus, so I was to try to keep them together or not be able to use my phone.  Alternately, I could wear special gloves, day and night.  I am older.  I do have chronically cold hands (inside and out) and live in a currently cold upper Midwest state.  I had my spouse try the phone, with somewhat better results, but never on the first try.  My son tried it, he had better results, but not perfect.  I was told by Verizon, it was me, not the phone and many people with cold hands had trouble with smartphones.  The fingerprint reader did not usually work either (maybe 1 time out of 10), even though it said my print was captured and I put in 4 different finger prints.  I was told by Verizon that no smartphone would work for me.  There was nothing wrong with the phone.  There was no other solution.  I should just use a flip phone.  I made a call to Apple after the phone was returned.  They said they never heard of the cold hand touch screen response problem.  I am so disappointed and upset that there seems to be no solution.  Otherwise, I think this phone was pretty and might have had some nice features.  But, if I can't make a simple phone call in an emergency--what good is anything else?  Any ideas folks?  Thanks!", "Date": "November 11, 2013"}, {"Title": "iPod heaven", "Author": "munster1975 \"munster\"", "ReviewID": "RQVMVWJAWFIPR", "Overall": "5.0", "Content": "I love this phoneThe apps are faster the screen is clearer it's faster to load and it has a sleek design", "Date": "May 19, 2014"}, {"Title": "I like this mobile", "Author": "Swapnil", "ReviewID": "R1KQZD9BI8KCX3", "Overall": "5.0", "Content": "Osmmmm mobileI got this mobile instant and mobile is superbbbb. I am loving itWill buy iPhone 5s more if they will allow in more competitive price", "Date": "May 7, 2014"}, {"Title": "Reliable and Professional", "Author": "Ashwani", "ReviewID": "R1D9MUPRX0N2Q9", "Overall": "5.0", "Content": "I bought my new I phone 5S from Cell store and I must thanks you for your commitment, reliability and professionalism .The product is great and was delivered to me as communicated.I will certainly recommend your name within my friend circle", "Date": "May 6, 2014"}, {"Title": "best phone ever! siri gets fired every day", "Author": "Nur", "ReviewID": "RWZ4L6RMT1HL2", "Overall": "5.0", "Content": "this is the best phone i ever hadcamera is EPICboth still and video and SLO-MO is AMAZINGfinger print touch security is funi wish they open the APIbut siri is a false promiseshe sends the wrong message to the wrong personand sets meeting at the wrong time", "Date": "May 3, 2014"}, {"Title": "This mind blowing piece of technology is such a cool and convenient thing to have no matter what you ...", "Author": "Miranda", "ReviewID": "R115HZ9BBAS063", "Overall": "4.0", "Content": "This mind blowing piece of technology is such a cool and convenient thing to have no matter what you need your phone for. It offers everything any other phone has, and it has a lot more than many phones can offer. The iphone 5s is one of two new apple cell phones that came out in September of 2013. It is fun, helpful, easy to use, and I could not be happier to own it, and I have never owned a phone that does so many things with so little flaws. Although I said it has few flaws, it could make or break someones purchase of it. The iphone 5s is supposed to have a bigger battery, but It dies way to quickly for me. You cannot be on the internet long, listen to music long or even constantly text without it dieing quickly. It is extremely sensitive to touches, it can turn on the voice command with a touch of the home button, and it will call people without you knowing if you do not lock it back when your done. The phone cannot use the iphone 4, 4s, 5, or 5c cases due to the home button, so you have to buy certain cases for the phone. The final flaw I have with it, is that the phone is that the lock screen is slow sometimes. However, the good things it has to offer are way too many to say, but the main things are super cool. It offers a ton of apps like games, social media, emails, calculator, flashlights, fitness, health, banking, reminders, calendars, and so much more. This phone even comes in black, white, and gold, so you have options now. The back of the phone is not even made of glass anymore, so it is a better chance of not cracking it. This phone has a thumb print scanner that allows you to enter your phone, download apps, or update your phone. This phone is the only one I have heard of that has this. It just keeps your thumb print in the memory of the phone, and you place your thumb on the home button and it will allow you and you only into your phone.The camera comes with an LED flash, filters, slow motion videos, panorama pictures, and takes amazing pictures. The phone comes with siri which is the voice command that talks to you, gives you GPS, gives you close gas stations, gives you close restaurants, sends text messages on your command, and calls people on your command. That is really a site to see. Lastly, it opens up Microsoft documents and even PDF files for anyone that uses it for business, and it is good quality too. Overall I can say the good outweighs the bad by far, and this phone is totally worth buying. I am very pleased with buying this phone, and it is a wonderful to own. Everyone who wants a good, durable, and fascinating phone should buy this one now!", "Date": "April 24, 2014"}, {"Title": "Excelent product", "Author": "JOSE DIEZ", "ReviewID": "R22N0XB4779M58", "Overall": "5.0", "Content": "The best product in its classEasy to use, very very fast.I have use this product for quite a time", "Date": "April 20, 2014"}, {"Title": "Back in the saddle again.....", "Author": "Kris", "ReviewID": "RA00GXLJ6GQEW", "Overall": "4.0", "Content": "I had the iPhone 3G, some years back. In 2010 I switched over to an Android phone. I was happy with them.... but, something about the iPhone 5S caught my attention, and now that I'm back, I LOOOOOVE IT! One of the things that I really like is the fingerprint use on the home button. It has a really good battery, for me. And I'm on my phone, all the time.One of my only complaints is that you can't use an app, like Zedge, to add ringtones to your phone. That's a huge deal, for me... and one of the things that really makes missing my Android phones a little bit more.", "Date": "April 9, 2014"}, {"Title": "Have a problem with charger.", "Author": "Alexander", "ReviewID": "R13Q8AE4IDJPVO", "Overall": "3.0", "Content": "There is some issue with its charger cable. On plug in it says \"This cable or accessory is not certified and may not work reliably with this iPhone\". I supposed everything should be original. But seems the cable is fake and not applicable with this phone. I hope the phone will not have issues.", "Date": "March 23, 2014"}, {"Title": "best phone on the planet", "Author": "Amazon Store", "ReviewID": "RHR94NKSY3OAX", "Overall": "5.0", "Content": "best phone on the planet. its worth the money. you wont regret buying this phone. I love all the new features", "Date": "March 22, 2014"}, {"Title": "absolutely fit on me", "Author": "Dias aja", "ReviewID": "R3NMG5YXTNAV0I", "Overall": "5.0", "Content": "apple product gave me so much perfection, like always. Iphone 5s is totally fulfill my daily activities, nothing less or more. Despite, some people don't like it because of its screen size and no external memory card slot. For me, what iphone 5s gave, is absolutely on me. Perfect size on my hand, faster processor, and etc. Apple always something different for me", "Date": "March 20, 2014"}, {"Title": "Works in Venezuela", "Author": "Fanaticox", "ReviewID": "RN66Z70P3BILE", "Overall": "5.0", "Content": "Great phone, indeed unlocked, worked with Venezuela's Movistar Sim card right out of the box, go for the 64Gb, it is a little expensive, but worth the extra space", "Date": "March 15, 2014"}, {"Title": "love it very much", "Author": "Haam", "ReviewID": "R1HRBMI3EG9SCP", "Overall": "5.0", "Content": "My goodness it's my baby nice and gentle I bought two of us me and my husband has actually loved Thanks Amazon for your performances wonderful love to be a permanent customer for your shop beautiful", "Date": "February 26, 2014"}, {"Title": "love it very much", "Author": "Haam", "ReviewID": "R1HRBMI3EG9SCP", "Overall": "5.0", "Content": "My goodness it's my baby nice and gentle I bought two of us me and my husband has actually loved Thanks Amazon for your performances wonderful love to be a permanent customer for your shop beautiful", "Date": "February 26, 2014"}, {"Title": "Awesome!", "Author": "Gustavo Achang \"Gussie\"", "ReviewID": "R3LVDDW7M35GLL", "Overall": "5.0", "Content": "I'm an apple addict, I love my new Iphone 5s! I had before this one an Iphone 4 and what an upgrade I made! :D I saw the differences between them.  I think I bought it expensive for 16gb but what can I say... Iphone worst it!", "Date": "February 16, 2014"}, {"Title": "Great phone!", "Author": "Anson", "ReviewID": "R2MUIO9ETO4K2R", "Overall": "5.0", "Content": "A bit of background about me: my previous phone was an iPhone 4s and I've had the 3Gs and 3G. I have other Apple products. I'm not a head over heels Apple fan, but I do appreciate and am usually very satisfied with the Apple products I have.When the iPhone 5 came out, I didn't feel that it the upgraded features were enough to spend on the upgrade. There were definitely features that were better than the 4s, but again, I don't need to get the new Apple iPhone just because it's new. However, given the speed claims on the 5s along with the bigger screen than the 4s and touch ID and LTE, I decided to go for it. Regardless of speed claims, when I received the phone and started using it, the speed increase was huge! the bigger screen is very nice to have. Seems like a good size to me (I'm not sold on the size of bigger phones). Even with the length increase it still feels good in your hand. The camera upgrades and LTE are great and not much more is needed to say on that.On the touch ID, it's gotten more hype than I feel it deserves. I've never use a passcode on my phone, because I hated putting it in every time I got into my phone. I use my phone extensively so it was enough that I left it off. However, having the Touch ID has made it much easier to have more security on my phone. It rarely works if your finger is remotely wet. The nicest feature of the Touch ID is not having to put in the password when I buy apps. Not having to enter my password makes it much more convenient without losing security. Overall, it's a nice feature, but it needs a bit of work to make it truly efficient. Nothing out of the ordinary for a first time feature.The feature I like about this phone is that it just works and it works well. There's not a lot of customization that you could get with Android phones, but it's nice to know that what it does, it does well. Also having other products, it's a nice way to integrate with other Apple products. You won't regret getting this phone!", "Date": "February 11, 2014"}, {"Title": "Great iphone 5S, great seller", "Author": "CARLOS DE CASTRO RUEDA \"cardcastam\"", "ReviewID": "R24E4T2GHMR5O3", "Overall": "5.0", "Content": "Great phone, simply the best you can get nowadays, in a really good condition Simply the best phone you can get today in a fabulous maintenence, and with all the accessories and features that are supposed to this great terminal. Maybe at the end, after paying customs duties to enter Spain, not as economically good chance as I supossed, but anyway good operation.", "Date": "January 31, 2014"}, {"Title": "Ester", "Author": "Ester Delespiritusanto", "ReviewID": "R1CKSUDIS2FW34", "Overall": "5.0", "Content": "I love it. I got everything what I want in a phone.I recommended it to my nephew so he both his parents , sister and himself", "Date": "December 28, 2013"}, {"Title": "iPhone 5s", "Author": "Thomas G.", "ReviewID": "RD2WPO5AK1AZD", "Overall": "5.0", "Content": "The phone was actually unlocked as promised.  My friend wanted it to take to their home country.  It was exactly what they needed.  It works in Mongolia.", "Date": "December 26, 2013"}, {"Title": "Great phone!", "Author": "Makumbi Johnson", "ReviewID": "R1T8IZ0UUISD1Q", "Overall": "5.0", "Content": "The phone works great!! Am using it here in Uganda; thaks!!! Again this is a great phone it met my expectations!", "Date": "December 24, 2013"}, {"Title": "I would do it again without any hesitation", "Author": "Francisco Pabon", "ReviewID": "RCUQ2U4B0DWBF", "Overall": "5.0", "Content": "Expectations 100% met on time! Effectiveness , promptness and outstanding client service three key issues that deserve to highlight in this order.", "Date": "December 20, 2013"}, {"Title": "charger cable plug with adaptor!", "Author": "Paulo Cesar da Silva", "ReviewID": "R15EGKC8GJ7K5R", "Overall": "3.0", "Content": "Only problem is not apropriate  charger cable plug. ! Regarding mobile it is ok, fine!  In fact I am Satisfied !", "Date": "November 4, 2013"}, {"Title": "bad seller", "Author": "Daniel A. Altuve V", "ReviewID": "R3NVPV1A2YMJTY", "Overall": "1.0", "Content": "total scam sold as new released brand new and the phone was blocked by the AT & T had to pay $ 200 extra to unlock the iphone and I can not use because I requested Zip Code and Social Security Number (SSN) which is not porporcionado me . very poor service I want my money back", "Date": "March 30, 2014"}, {"Title": "Thank you", "Author": "Abdulrhman Alzanki", "ReviewID": "R1XU33INN1L0A3", "Overall": "5.0", "Content": "Iphone 5s is great smart phoneiphone 5s device has many advantages and speed superchargersI am very happy with this device", "Date": "December 31, 2013"}, {"Title": "some design limits", "Author": "marco", "ReviewID": "R31DL33YVK26V", "Overall": "2.0", "Content": "Has no expandable memory and non-replaceable battery lasts little ... too bad because otherwise it's a product cured even if unreasonably expensive ...", "Date": "December 24, 2013"}, {"Title": "Great, Fast, Easy Phone", "Author": "Tana", "ReviewID": "RTTY1BHFJ20OE", "Overall": "5.0", "Content": "I have always loved apple and am a loyal customer. I currently own all of their new products but have never had an iPhone intel now. I bought my Gold 64 gb iPhone 5s and waited a few weeks for it to come to my local verizon wireless store. I have researched a lot about the iPhone 5s and most of my friends have the 5 or 4s so I know how the system works. I love the 5s but really dont think it is much of a step up from the 5. I mean ya, fingerprint censor...that's great and all but not that useful. Who cares that you save 3 seconds pressing your finger to a button instead of typing in a password. The system with the A7 chip runs faster and more efficiently and siri has been upgraded but I believe they should have brought in more physical features to differentiate the 5s from the 5. I like how fast the phone is but I think they could have added a bit more, even if it is a \"s\" model.", "Date": "October 21, 2013"}, {"Title": "Maybe I have a lemon", "Author": "STOAK \"soffak\"", "ReviewID": "R1HFLIYCU11TMD", "Overall": "1.0", "Content": "I have had IPhones for years. I gave up the IPhone 4 for this one and regret it almost every day. The finger print scanner only seems to work for a few hours before I have to input a new phone. I added my daughters and my wife so they could unlock it and none of their finger prints work now either. I add my almost everyday and by the end of the day it will not recognize my finger print.The keypad is a nightmare. As I said I have had IPhones before. This one is so sensitive (and I have fat fingers) that I can never get a message out without getting a cap rather than an \"a\" and/or several other mistakes that autocorrect invariably screws up. Never had that problem so regularly on other phones.I have not had Siri before but it is worthless on my phone. I have used voice recognition programs on my computers and never had problems there so I have a hard time imagining it is my voice but most of the time I cannot get Siri to work well enough to use it.All in all this phone is a nightmare but maybe it is a lemon.", "Date": "February 4, 2014"}, {"Title": "Absolutely SHOCKED to learn about the SHORT battery life of the iphone 5s!!!", "Author": "R. K. Oden \"RKO The Health Buff\"", "ReviewID": "R222QVU58YAMD9", "Overall": "1.0", "Content": "I am so sorry I purchased the iphone 5s unlocked a week ago to replace my iphone 4s without due diligence or proper research. I purchased it for home country and overseas use, including long haul flights to Asia, Australia, and East Africa and was absolutely SHOCKED to learn about the SHORT battery life of the iphone 5s. I now have to devise a plan B to replace the phone at an enormous loss.", "Date": "December 31, 2013"}, {"Title": "Super Smart Phone - Love It", "Author": "Mr.Frost", "ReviewID": "R24E5IJ4VHI05J", "Overall": "5.0", "Content": "Super nice phone .... Very useful tool as well .....This is my first iPhone and I'll never be without one!", "Date": "November 28, 2013"}, {"Title": "Overpriced", "Author": "Michael W. Taylor", "ReviewID": "R3RNPDFBZLPHU6", "Overall": "1.0", "Content": "Why would you pay $100 more for something that is available directly from Apple for less????  Do your homework first ....", "Date": "December 18, 2013"}, {"Title": "unlocked", "Author": "elizeu c branquinho", "ReviewID": "R3MUP8MLIU4QZB", "Overall": "5.0", "Content": "its like it was described(unlocked)every iPhone that says factory unlocked it does come with a T-Mobile sim card, and I didn't know that, so I contacted the seller and he clarified how apple unlocks their Iphones and from there I did a research at apple store and found out that every unlocked IPhone comes with a sim card, weather  T-Mobile or At&T.;", "Date": "December 14, 2013"}, {"Title": "Customer with complains of the service of the Shop", "Author": "lorenzo brizzi", "ReviewID": "R2XOU6Y9EOFBR", "Overall": "1.0", "Content": "My main reason to accepted the offer of the Shop, was the color available. It was supposed that i was buying an Iphone with Silver Color. When i received the Iphone my first sorprise was that the color was Gold.My question is what kind of refund i can get for such mistake of the Shop?Lorenzo Brizzi", "Date": "November 28, 2013"}, {"Title": "Glitchy phone", "Author": "Joshua", "ReviewID": "ROX7DPAKU1RRA", "Overall": "2.0", "Content": "Lots of glitches I am shocked are STILL not fixed on this poorly designed OS. Here's the short list: Voice mail deletion is no good, stock browser is garbage, screen rotation is slow, camera is probably worst camera on the market, flash takes forever to focus the lens, battery percentage notification won't let you turn phone off when you're trying to with low battery, battery only last about 12 months with heavy usage and then this $700 is garbage, mic and noise cancellation mic do not work properly together, no one can ever hear me on this thing, mute switch is almost impossible to reach, finger print scanner cool idea but doesn't work properly, the way the apps all fall onto the screen each time you turn the phone on is annoying and there's no way to turn it off, may features have no preferences that absolutely need them, WIFI reception is poor, when your camera is full you can't even access the images which is extremely frustrating , you have to delete an app just to get back into camera roll, you can't delete multiple voice mails at once and it takes about 15 seconds of freezing up till a msg is actually deleted... I could go on and on. This phone is terrible.", "Date": "February 18, 2014"}, {"Title": "Great phone, but a little glitchy so far, update needed", "Author": "ccmasta4465 \"chris\"", "ReviewID": "R2BWWWK7PDOKQM", "Overall": "4.0", "Content": "had a lot of music installed, and was a little llag, updted to the latest update and runs smooth now, nicest phone for the money!", "Date": "January 3, 2014"}, {"Title": "JUST ONE THING", "Author": "SANDRA LOZOYA", "ReviewID": "R24VTNA6G9QDEZ", "Overall": "3.0", "Content": "I been having a troubles to connect the iphone,  since I trusted that was unlocked, now I have to pay extra money to unlock it.I still like my iphone tho", "Date": "December 30, 2013"}, {"Title": "JUST ONE THING TO SAY", "Author": "Salma Lozoya", "ReviewID": "R3RZDR89F7IX30", "Overall": "3.0", "Content": "I been having troubles to connect the  iphone, since i trusted that it was unlocked, now i have to pay extra money to unlock it.I still like my iphone tho", "Date": "December 30, 2013"}, {"Title": "Loving My New Phone", "Author": "Peaceful_Inhaler", "ReviewID": "R1XA2XE1IQSEOA", "Overall": "5.0", "Content": "I love my phone.  I chose the white silver.  It's beautiful, fast, user friendly too.  I never thought I would change from a Blackberry, I was pretty much forced to do it, I went into this with a negative attitude.  Was I ever wrong.  I can't wait to download some much used apps later tonight.  I highly recommend it.Do not ask me if the phone works in other countries. I have no idea.  I'm in the US", "Date": "November 14, 2013"}, {"Title": "Happy with my idevice", "Author": "A. Hernandez", "ReviewID": "R2T95BZ22N0QRR", "Overall": "5.0", "Content": "Best phone ever, upgraded from the iphone 4, and cant live without it, also bought a nice case from spigen", "Date": "November 13, 2013"}, {"Title": "Awesome", "Author": "Federico Arbio", "ReviewID": "R17EIVCKV2KOJ", "Overall": "5.0", "Content": "It talks by itself...it's an Iphone S5 with the best technology and really good looking, it looks more elegant than the previous version.", "Date": "November 12, 2013"}, {"Title": "Wow", "Author": "Wilo", "ReviewID": "R16VOEP7DFQYD0", "Overall": "5.0", "Content": "I was amazed could not believe, everything as described. The only thing thought, my shipping company charge me a lot to clear but other wise, this phone is boss, thanks again and keep up the good work", "Date": "November 10, 2013"}, {"Title": "Good, but with some battery issues", "Author": "Mitchell Kossoris", "ReviewID": "R23OHJVO09KWMV", "Overall": "3.0", "Content": "The iPhone has been the choice of phones for me for the past 5 or 6 years for its high quality materials and performance. When I first upgraded from the 4s to the 5s, I was absolutely amazed be the performance enhancements, from data speed (4G LTE instead of 3G) to the great materials and small improvements like the fingerprint sensor and camera. Unfortunately, I had a problem with the battery life. I was using the phone for about 1 and a half hours almost straight on the internet, starting at around 95% battery life and ended up with 5% at the end. According to Apple, I should be getting 8-10 hours. Looking into this problem online, I saw that this was a somewhat common problem.I decided to go to one of Apple's stores to talk to the \"Genius Bar\" about the problem. They ran a program and said there was no problem with it. We talked to a manager to hopefully get a better understanding and they said that a lot of apps were running in the background (multitasking) and that I should update to the latest version of iOS 7 (I was at the version before the most recent one). I can understand why those two things would take up some battery life, but am I really supposed to believe it changes by almost 90% just because of that? I don't think so. As of right now, I haven't tested it again, but I plan to write an update to this review in case it does get better.Overall, the performance of the phone is great, but until I can get the battery working as it should, I will be disappointed with it.", "Date": "November 7, 2013"}, {"Title": "Iphone 5S ... YEAHHHHHHHH", "Author": "Carlos Garzon", "ReviewID": "R3NEJASIJEJUIH", "Overall": "5.0", "Content": "Iphone 5s the best phone in the world, very fast and is a complete phone, and well designed completely in all aspects. when you have an iphone you'll want to not leave this never. I am very satisfied with this, I really recommend it, just what I wanted, delivery was fast, and conditions as the seller described it, everything works perfectly. Thanks.", "Date": "June 10, 2014"}, {"Title": "addicted", "Author": "Jack Chen", "ReviewID": "R3E1VTEIBVR36L", "Overall": "5.0", "Content": "This phone is awesome: light, looks cool and does everything you want/need. it does things you don't even know you want/need yet :)", "Date": "June 9, 2014"}, {"Title": "It's OK, certainly don't switch from a top shelf Android", "Author": "Amazon Customer \"StanO360\"", "ReviewID": "R15E3XTHGG7Y7B", "Overall": "3.0", "Content": "I was forced by my work to get one of these. So far it's a pain in the rear. Small, awkward interface, iTunes is a hassle. Fast, nice touch screen. The fingerprint scanner works!At the end of the day, wait for a bigger phone if you're an Apple fan. If you're on Android or Windows there are better choices. I was waiting to be awed coming from Android. Yes, less glitches, but glitches with getting my contacts, the interface is either hard to adjust or not adjustable, it's smaller than my cheap LG L9.", "Date": "June 5, 2014"}, {"Title": "Very good smart phone", "Author": "Frank Nunez", "ReviewID": "R2MYYCYBONHWVO", "Overall": "5.0", "Content": "Comparing it with galaxi 4 ,which I used for longer tan one year, I feel happ yor far  with this unit.", "Date": "June 5, 2014"}, {"Title": "About the Apple 5s.", "Author": "Norma Carmona", "ReviewID": "R1UAOYROE6OXSG", "Overall": "5.0", "Content": "I am very happy with the phone was a gift for my daughter and she love it.Thanks once again Amazon for the quality of your services.", "Date": "June 4, 2014"}, {"Title": "Honest Seller", "Author": "Hannah9161", "ReviewID": "R3EAYDBF5MTDMF", "Overall": "5.0", "Content": "Great seller and product. The phone came exactly as described. He was also quick and helpful when responding to questions. Shipping was a fast 2-day delivery. Just keep in mind that \"new in box\" doesn't mean the phone has never been opened from its original packaging. I was aware of this and it wasn't a problem, it's just a note to potential buyers. Overall, I'm very satisfied and love my new phone!", "Date": "June 1, 2014"}, {"Title": "The best iphone touch ID phone out", "Author": "MekoRush", "ReviewID": "RQJOEUF61DL8R", "Overall": "5.0", "Content": "Good: slick, feels so light in your hand just makes you want to get a case for it, battery life i'd say about 9 hours of heavy use but it will last all day if you just check emails and send texts all day.Meh: audio isn't anything special but it doablebad: inside the lifeproof case audio quality gets cut in half, in phone calls most of the time people couldn't hear me unless i had the headphone jack port open. touch ID works 90 percent the time when using lifeproof case, if you use a aux cable and want to use a bulky case well you will need to use a extender.", "Date": "June 1, 2014"}, {"Title": "Love this phone!", "Author": "Maria Velez", "ReviewID": "R1Z0HQ9QU2MHX9", "Overall": "5.0", "Content": "The color is awesome, its super fast! Quick! Easy to use.Everything about it is clean and professional.Love Apple products for this reason.Never a disappointment.", "Date": "May 29, 2014"}, {"Title": "Lifesaver", "Author": "Syed", "ReviewID": "R277W8EA0CL9U0", "Overall": "5.0", "Content": "I used to have the old iphone 4 but this thing is just the best it does not make any problems. I do not like that the screen can get scratches fast.", "Date": "May 28, 2014"}, {"Title": "Loved it.", "Author": "Manish", "ReviewID": "R3MLMKPFUV2GV", "Overall": "5.0", "Content": "I am an iOS fan and I love this phone. Upgraded from my iPhone 4S and I don't regret it at all.", "Date": "May 27, 2014"}, {"Title": "Thank you very much", "Author": "Naser", "ReviewID": "R2N85CS5SJ77FA", "Overall": "5.0", "Content": "I do appreciate all you on your honesty and trustworthiness. I am totally happy with my brand new iPhone 5 s. Thank you for your recommendation.", "Date": "May 23, 2014"}, {"Title": "shipping", "Author": "Brittany Reed", "ReviewID": "R15Z9LHDA03EYB", "Overall": "3.0", "Content": "it has took a very long time to get this item,it has been 8 days today i still have not got my item. they said it could still be a week before i get I sure hope not. speed on how long it takes to get my item really goes a long way for me to reorder this does not look good for this seller.", "Date": "May 22, 2014"}, {"Title": "all good..", "Author": "Brian Green", "ReviewID": "RANAF7KLM464L", "Overall": "4.0", "Content": "Ok i have to write 20 words for a review.. everyone knows the iphone is good, but is it worth that kind of money?  It must be people are buying them.  I bought this as a gift, and my wife loves.. Btw, it was to replace a broken iphone..", "Date": "May 19, 2014"}, {"Title": "Phone Charger", "Author": "Marvie", "ReviewID": "R1ZW5FZ99OF93R", "Overall": "3.0", "Content": "The phone was okay but the charger isnt working at all so I had to buy a new one :(", "Date": "May 15, 2014"}, {"Title": "overall phone is a good phonr", "Author": "felix", "ReviewID": "R3KZUQC1DXI2VN", "Overall": "3.0", "Content": "was disappointed a bit of the lil damages on the outside of the phone and a scratch on the screen sometimes phone touch freaks out but im satisfied", "Date": "May 14, 2014"}, {"Title": "so happy!!!", "Author": "Mariela M", "ReviewID": "R4VW6TKMU3XAK", "Overall": "5.0", "Content": "I just love my Iphone!!!!!! totally works with any band in Venezuela, and it came with all the accesories, it  was all the I wanted", "Date": "May 14, 2014"}, {"Title": "iphone 32gb", "Author": "SERGIO VINUEZA", "ReviewID": "RON7UAR9GVA9M", "Overall": "4.0", "Content": "Great phone, and it holds a lot of photos and music...a must...do not get the 8Gb or 16, get this one at least  32Gb", "Date": "May 11, 2014"}, {"Title": "The Phone Was As Described", "Author": "Julio Barrera", "ReviewID": "R27GEISY0XWOGC", "Overall": "4.0", "Content": "I gave them 4 stars because the USB cable and the wall charger didn't work. Both came damaged, fortunately for me I still had the cable from my last iPhone.", "Date": "May 7, 2014"}, {"Title": "Iphone are the best", "Author": "Nike", "ReviewID": "R1Y01UPHNHOHE8", "Overall": "5.0", "Content": "dont need to write a review for anyone to know how great apple products are and this is no exception.", "Date": "May 7, 2014"}, {"Title": "Touch ID might not work well if you are in the construction/remodelling business.", "Author": "M. S. Anderson \"bUzzbOmb\"", "ReviewID": "R2OZ91G1U7N19H", "Overall": "5.0", "Content": "Love the phone in every way. It is more functional than I had expected and the camera is really amazing.I couldn't be more pleased with this phone.One Caveat:Just wanted to let people know that touch ID is great and worked well for me until my latest remodeling project.My fingertips are always changing with minor wear or nicks.I haven't been able to get my Touch ID to work for months now.It seems that this might be useful information for those who work in construction to consider.If you fingertips take a bit of daily wear in your job, this feature might not be very handy.", "Date": "May 5, 2014"}, {"Title": "I love it", "Author": "lailac", "ReviewID": "RFPS3BXB962GC", "Overall": "5.0", "Content": "excellent", "Date": "May 4, 2014"}, {"Title": "Honest review", "Author": "vincent", "ReviewID": "R1ETCQJ4T0SPR3", "Overall": "4.0", "Content": "ProsTouch ID works perfectlyExcellent performanceGreat all-round cameraVery light and comfortable in one handConsBattery life could be better4-inch screen too small for someExtra storage costKey Features: 4-inch Retina display; Fingerprint unlocking; 8MP Camera; True-Tone LED flash; A7 Dual-core processor; Aluminium bodyOn a day to day basis the iPhone 5S does everything I want it to do, and does the things I do most, better than any other phone I’ve used. It’s not gimmicky and other than the lack of widgets and customisations there’s not much I miss from using bigger Android phones. If, as expected, Apple does up the screen size in the iPhone 6 I’ll be interested to see whether I’ll enjoy the experience quite as much.", "Date": "May 4, 2014"}, {"Title": "good improvement on iphone 5", "Author": "Amazon", "ReviewID": "R4G5ZP9BZIZTS", "Overall": "5.0", "Content": "the good thing about the 5s is that it can handle the ios 7 that the iphone 5 cant handle well due to lags in applications. the fingerprint is very cool and works very well no problem so far. satisfied", "Date": "May 3, 2014"}, {"Title": "Great phone", "Author": "Frank", "ReviewID": "R9BM17FCPG21C", "Overall": "5.0", "Content": "I upgraded my 4S for the new 5S and I'm loving it. The phone is way faster and sound quality is amazing. Battery life is also improved and now I don't have to charge my phone after 4 hrs of use.", "Date": "April 27, 2014"}, {"Title": "Good phone but wait for the iPhone 6 if you still want to have an iphone experience", "Author": "SciTech Outline", "ReviewID": "RQ49B7C72MOAL", "Overall": "4.0", "Content": "iPhone 5s Review!IPhone 5S is the last year’s flagship from Apple .The design is pretty much the same like the previous iPhone the iPhone 5 which looks very premium and well-built but the hardware has been changed featuring 4-inch Retina display; Touch ID sensor; 8MP Camera and A7 Dual-core processor. The iPhone 5S price starts from 200$. Available in space gray, silver and gold.Personal Review:· The Screen is 16:9 offering a resolution of 1,1360x640 with 326pixels per inch. It is relatively bright.  It can be easily seen at sunny days comparing it to other phones in the market.· The Touch ID sensor is integrated into the metal ring around the home button. I find it to work well and responds fast especially after the new update and you can setup up to 5 fingerprints. It takes few seconds to do so but make sure that your finger is dry.· The iPhone 5S camera on paper is very similar to the one on the iPhone 5 however, it has been magnificently improved especially the low-light performance because apple has enlarged the sensor from 1/ 3.2 to 1/ 3. The camera overall takes glorious pictures and stable videos as it is very responsive and fast in processing pictures but I have a problem with the focusing as it doesn’t detect small objects to focus on so what I do is I focus it on my hand from the same distance of the object and lock the settings.It is very easy to capture professional photos I mean god knows I am amateur in photography and stuff like that but I took pictures that look very professional in my opinion. In darker conditions, the objects are barely visible apart from the fact that there are some obvious noise but it is way better than other flagships.· The iPhone 5S is the first phone to feature a 64bit processor allowing the developers to make better quality applications and to run apps faster and smoother.·  It also have a secondary processor called “M7” which is used mainly for low-power tracking of movements. Some apps have taken advantage of it like the M7 pedometer and what it basically does is counting the number of steps you take every day.· The battery life is above the average which I charge it sometimes more than once a day when using it intensively however it charges very fast..The IOS 7 has a great user interface and smooth transitions but I think it’s more optimized for the iPhone 5C and I hate it when I download an app that has the old keyboard. Overall it’s a great phone despite the fact that the screen size is relatively small to its rivals.Watch the full review on youtube: [...]", "Date": "April 26, 2014"}, {"Title": "Excellent", "Author": "Harngid Cho", "ReviewID": "R13KNIV1VIPMD", "Overall": "5.0", "Content": "Excellent company. I would highly recommend. I was able to save a lot of money thanks to this purchase and had no problems!", "Date": "April 25, 2014"}, {"Title": "Good phone but could be better", "Author": "Ethan", "ReviewID": "R3GX5QH4D7B6V1", "Overall": "3.0", "Content": "Is the iPhone 5s just another iPhone? Yes it is another iPhone but with this updated version comes many new features.  The purpose of the iPhone is to serve people that require a higher standard of technology out of their mobile device. I believe that the aim of apple in creating the iPhone 5s was to create a better version of the previous version to keep and edge on their competition and ultimately make more money.My evaluation of the product is that it is a great device. The new improvements begin with a sleeker design than before and slightly different hardware scheme. The biggest improvement is the new touch id sensor. This allows someone to use his or her fingerprint to gain access into the phone. The next biggest improvement is the camera. Its improvements in picture sharpness and low light visibility far outdo the previous model. Some of the negatives of the product include the screen, which has remained exactly the same. As most people know who have owned an iPhone in the past will know that one of the biggest problems is the battery life. The life of the battery has always been an issue with iPhones and this model is no exception with the problem still occurring. All i can say is that i hope they fix this on the next model that is released. Also the iPhone 5s continues to be the most expensive smartphone on the market. The final thing that has gotten the iPhone models criticism in previous years and continues to be a problem for the 5s is its battery life. The life of the battery per charge still seems to be a slight issue even with the iPhone 5s. In conclusion I believe that over all the iPhone 5s is a great product. I have had an older model iPhone for many years now and they just don't compare to the competition in my opinion. The technology is always one step above the competition and the platform is very user friendly. These reasons are why the IPhone sells so many units every time they release a new model. Im sure the iPhone 5 will be the same way. When a product is better than the completion it always sells better. This has been shown through the number sold being extraordinarily high regardless of it being the most expensive smart phone out there. I think that it is a great phone and is very up to date on the technology. If you have been thinking about one, its undoubtedly worth looking into.", "Date": "April 25, 2014"}, {"Title": "Its an iphone!", "Author": "Ruben", "ReviewID": "RWF3Q1MEV8ZMN", "Overall": "5.0", "Content": "well nothing to say.. it works fine.. speed its a bit better.. compared to the 5.. so.. its okay! its expensive though..", "Date": "April 21, 2014"}, {"Title": "It's a great phone!", "Author": "Gicly Rodriguez \"Gicly\"", "ReviewID": "R15ZNM4GKRBUG1", "Overall": "5.0", "Content": "Just loving this phone!i really trusted the seller, they were very kind and answer Bach my emails when I had doubts, always! Thanks! Really guys! About the iPhone, really don't need to say mug that anyone hasn't read,very fast processor and incredible screen quality, among others things, the shipping was within de estimated delivery date, so thanks again! Is a great phone!", "Date": "April 11, 2014"}, {"Title": "Good buy!", "Author": "stan", "ReviewID": "R2GQX94NOKQLQO", "Overall": "5.0", "Content": "I am new to the iPhone and I am really impressed with this one. It does more than any other brand I have bought in the past. When you buy accessories they are geared more to the iPhone I have noticed, and they make some pretty nifty things to go with it. I do not like contracts so I read all the reviews about the unlocked phones and they were mixed, some good, some bad. This phone came exactly like the ad said. It is brand new in the box and since I wanted to use it on at&t;, all I did was take it to an at&t; store, they gave me a sim card for it and I bought the plan I wanted with no contract. Even though it cost more, I like the idea of the unlocked phone as I am more in control of what I do with it. Glad I went this route!", "Date": "April 7, 2014"}, {"Title": "A brilliant phone as always", "Author": "George Z", "ReviewID": "R1DZOE4KHH4H7S", "Overall": "5.0", "Content": "If you own an iphone of an older generation it's difficult not to appreciate this ultra-fast beautiful iphoneExcellent device", "Date": "March 31, 2014"}, {"Title": "Love it", "Author": "Juliana", "ReviewID": "RFVPCYISHKGDR", "Overall": "5.0", "Content": "Loved it. It worked un Colombia and the price was fine. I was very happy that i found it! :)", "Date": "March 29, 2014"}, {"Title": "Good buy!", "Author": "stan", "ReviewID": "R2GQX94NOKQLQO", "Overall": "5.0", "Content": "I am new to the iPhone and I am really impressed with this one. It does more than any other brand I have bought in the past. When you buy accessories they are geared more to the iPhone I have noticed, and they make some pretty nifty things to go with it. I do not like contracts so I read all the reviews about the unlocked phones and they were mixed, some good, some bad. This phone came exactly like the ad said. It is brand new in the box and since I wanted to use it on at&t;, all I did was take it to an at&t; store, they gave me a sim card for it and I bought the plan I wanted with no contract. Even though it cost more, I like the idea of the unlocked phone as I am more in control of what I do with it. Glad I went this route!", "Date": "April 7, 2014"}, {"Title": "A brilliant phone as always", "Author": "George Z", "ReviewID": "R1DZOE4KHH4H7S", "Overall": "5.0", "Content": "If you own an iphone of an older generation it's difficult not to appreciate this ultra-fast beautiful iphoneExcellent device", "Date": "March 31, 2014"}, {"Title": "Love it", "Author": "Juliana", "ReviewID": "RFVPCYISHKGDR", "Overall": "5.0", "Content": "Loved it. It worked un Colombia and the price was fine. I was very happy that i found it! :)", "Date": "March 29, 2014"}, {"Title": "It was not exactly brand new", "Author": "DONG K SHIN", "ReviewID": "R8GC0Y3OSCW3Y", "Overall": "2.0", "Content": "As I activate the phone, T-Mobile  technician found that the phone was set up for someone's icloude and email.It required password to delete which I did not have. So I had to return the product.", "Date": "March 28, 2014"}, {"Title": "Great", "Author": "Kayani1120", "ReviewID": "R27I5TXG1PP2HF", "Overall": "5.0", "Content": "iPhone is great Work so for I'm happyI need one more phone like that but 32 gbPlease gave me answer", "Date": "March 28, 2014"}, {"Title": "Great product!", "Author": "Jorge Cabrelles", "ReviewID": "RR9LL3V928MIJ", "Overall": "5.0", "Content": "Great product! salesman is very attentive, helpful and very responsible. The product is everything you can hope for and you get it at the best price! Recommended!", "Date": "March 27, 2014"}, {"Title": "excellent condition but", "Author": "Joyce Coleman", "ReviewID": "RHBPNXFE0XBPS", "Overall": "3.0", "Content": "the phone was in excellent condition .. tried to unlock it and found out it was blacklisted reported as stolen", "Date": "March 27, 2014"}, {"Title": "Pretty good phone", "Author": "Petunia Skincare", "ReviewID": "R35DS1NT8I9GDC", "Overall": "4.0", "Content": "Its a nice phone to use. However, there isnt anything too new with the new 5s that I would say its amazing.Just another updated Iphone and hopefully the new Iphone 6 that comes out later this year will be good.", "Date": "March 26, 2014"}, {"Title": "GOOD AND SO GOOOD", "Author": "Tony  Tran", "ReviewID": "R35JDXSTIH9SA8", "Overall": "5.0", "Content": "On time and perfect qualit and packaging is perfect. grant new as it mentioned in Amazone. I sure will have introduce othere to buy it", "Date": "March 24, 2014"}, {"Title": "AAA+ seller", "Author": "KyleChristina", "ReviewID": "R1V26V73A1CBFG", "Overall": "5.0", "Content": "Item was perfectly described. No damage at all, It even included a case for free! Thanks. Made my first amazon experience a good one.", "Date": "March 24, 2014"}, {"Title": "Why fix something that's perfect?", "Author": "Caohu09", "ReviewID": "R1J0VHK642E8L2", "Overall": "5.0", "Content": "I got the iPhone 5s on the day it came out. I usually would have wanted a black computer, but I got the white one. (Silver MBP and MBA, and now the iOS is white. Uniformity is beautiful ;) )The touch sensor is nice so I don't have to always punch my code in. The phone is SO slim and light it feels fragile. (It is definitely anything BUT!) From customer service, their applecare, and their warrantee, Apple is the place to go.", "Date": "March 12, 2014"}, {"Title": "As Always", "Author": "FRANCISCO DENEVI", "ReviewID": "RBF2IT80J26CC", "Overall": "5.0", "Content": "What can I say about it?Gorgeous, fast, superb design.A little faster than Iphone 5 on games.I've noticed almost the same performance on simple tasks than Iphone 5. iMessage/Mail/etc.No doubt best phone made by Apple so far...", "Date": "March 12, 2014"}, {"Title": "I like my product and it was all i expected", "Author": "darrel walker", "ReviewID": "R2W4GAOPKGYDZL", "Overall": "5.0", "Content": "My phone came sealed with all it's accessories and the box said that it was factory unlocked and everything the seller said in his or her ad is true because i used the phone in New York after i went to Trinidad and Tobago and i also used the phone there and it worked perfectly and finally i came to Venezuela and it also works perfectly with no problem", "Date": "March 8, 2014"}, {"Title": "Left the Note 3 and NO REGRETS AT ALL!", "Author": "Larry Roberts", "ReviewID": "R3LU8N1NE9B9V0", "Overall": "5.0", "Content": "I have bounced between Apple and Adroid for some time now and while I liked my Note 3, the iPhone 5S just feels better in the hands. Outstanding phone! I have decided at this point to go all Apple MacBook Pro Next!", "Date": "March 8, 2014"}, {"Title": "Amazing cellphone", "Author": "Joao Vitor Silva Moreira", "ReviewID": "RWLDQ8PULO4P3", "Overall": "5.0", "Content": "The best phone ever! Great camera, amazing speed, everything is good! Too mucu better than the iphone 5... Grear choice", "Date": "March 8, 2014"}, {"Title": "excellent phone", "Author": "Franklin Vargas", "ReviewID": "R1FLYOJGFDIUWR", "Overall": "4.0", "Content": "the phone came in as promise, in mind condition and no problem at all installing a sim card from my phone provider", "Date": "March 4, 2014"}, {"Title": "Great product.", "Author": "RAFAEL VARGAS", "ReviewID": "RTVWQ4CGT577G", "Overall": "5.0", "Content": "I'm loving my gold iPhone 5s its just amazing. Worth the money.  Really like the look of the iPhone. Apple is reliable.", "Date": "March 2, 2014"}, {"Title": "Although This Is Over Prized!!!!", "Author": "D.I.Y. Soup", "ReviewID": "RPM6DWERUAQ1M", "Overall": "5.0", "Content": "I would never pay this amount for a phone, I don't care if it is unlocked.  It is way cheaper just to get one from your carrier and unlock it yourself.  There are ways.  The iPhone 5s is awesome though!!I have been using the Apple iPhone since it was first introduced and I am currently using the Apple iPhone 5s.  All though this write up is Apple iPhone 5s based, my experience with this phone goes back to the Apple iPhone 1 and the tips and tricks on this page will work on all iPhones including the older generations.  I love the Apple iPhone and will never use another cell phone, because I am able to do so much with this phone.  It's funny because making phone calls is one of the lesser activities that I do with it.  I have checked out android phones and even though there are tons of apps there, I don't feel that there are as many useful apps as you can find for the Apple iPhone.  My phone keeps track of all my internet log in's.  The new calender app is very very useful at keeping me on schedule.The Google Maps app keeps me from getting lost.  I do have a vehicle with GPS navigation, but prefer my Apple iPhone over it.  The camera on the Apple iPhone is my main camera for this website and I love how clear the pictures turn out.  My only complaint about the built in app is that it does not have a self timer.  The Pan and Slo Mo options that Apple has added is awesome to play with.  I can control my home thermostat with my phone.  I can turn my home security system on and off with my phone.  The new finger print reader is insane too.  I love that I can just hover my finger over the unlock button and my finger print logs me in, instead of having to type in a code every time I want to use my phone.  I've had friends over the years arguing with me which phone is the best.They would swear up and down that their Blackberry is better, or their Android blows the iPhone out of the water.  Guess what, after watching me with my iPhone for a few months they always end up with one in less than a year.  I am putting this page together since there are so many options and settings that many of my friends ask me how to do some basic stuff.  If you wonder why the iPhone doesn't do something, it most likely does and you just need to look around a little to find the setting or option to make it do what you want.More information along with some tips and tricks here diysoup.com - Apple iPhone Tips and Tricks.", "Date": "February 28, 2014"}, {"Title": "Very nice Phone", "Author": "Marco Antonio Olivo \"Marco Olivo\"", "ReviewID": "R1RAZNPB3UFE8K", "Overall": "5.0", "Content": "Very good iphone, better than the iphone 5 , faster and more easy to access with just one touch, same size that iphone 5 and can use all the acessory.", "Date": "February 24, 2014"}, {"Title": "Excellent phone", "Author": "Rene Gomez Pineda", "ReviewID": "R2XCHY7HZ95X8V", "Overall": "5.0", "Content": "It is exactly what I ask......the phone meets my expectations. It is unlocked.....ideal for use abroad. Very fast internet and very good to call through viber or skype when I am out my country.", "Date": "February 24, 2014"}, {"Title": "Excellent phone", "Author": "Rene Gomez Pineda", "ReviewID": "R2XCHY7HZ95X8V", "Overall": "5.0", "Content": "It is exactly what I ask......the phone meets my expectations. It is unlocked.....ideal for use abroad. Very fast internet and very good to call through viber or skype when I am out my country.", "Date": "February 24, 2014"}, {"Title": "Perfect", "Author": "Andres Elias Loreto Hernandez", "ReviewID": "R2UDLAMTDWJZ87", "Overall": "4.0", "Content": "perfect but the price without the accessory seemed to me a little off balance, but if it is in excellent condition ready to use released", "Date": "February 22, 2014"}, {"Title": "Excellent", "Author": "VESTALIA TORRES", "ReviewID": "R6G4QTN6Z18PQ", "Overall": "5.0", "Content": "Excellent model for all the use I give to mobile devices. Operating system and quick access to all the applications I use daily. 100 percent preferred.", "Date": "February 21, 2014"}, {"Title": "just bought the iphone 5s just waiting for shipment", "Author": "cody74", "ReviewID": "RJRTWLY1QREWB", "Overall": "5.0", "Content": "Bought the iPhone 5s from tech trend they have really good customer service always answer your emails and such. But bought this for my son for his birthday and hope it comes in time. If shipping goes as planned I will be more happy", "Date": "February 16, 2014"}, {"Title": "Gold beautiful.", "Author": "Deborah Valdez", "ReviewID": "RDQMJG6ON744Z", "Overall": "4.0", "Content": "I've always had IPhones so no suprises.  But love the gold color this time, the antena is disappointing again it seems androids have the advantage still.", "Date": "February 9, 2014"}, {"Title": "Love my phone", "Author": "Sebastian Graetzer", "ReviewID": "RIBAH8QG8J8V0", "Overall": "5.0", "Content": "I love my phone. Everything worked out perfectly. It was totally worth it!. Thanks for everything guys. It was fun!!", "Date": "February 8, 2014"}, {"Title": "Connector is horrible", "Author": "S. Venema", "ReviewID": "RWEY8SJ96M6SS", "Overall": "2.0", "Content": "Plus: very good cameraBig minus: connector is really unpractical for daily use. On chargers it wobbles, the connectors are to short to use with a case, thus you need a flip case for everything. For someone who is used to the big connector this is going back into stone age, very upset with it. Other than the camera, the same as my I4s", "Date": "February 8, 2014"}, {"Title": "iPhone 5S is awesome! iOS7 is Not!", "Author": "Corbin Williams", "ReviewID": "R3MFB59I0SM5K3", "Overall": "4.0", "Content": "I have the space grey 64GB 5s and I love it. Although it is not much different then my 5 I still use my phone all day long and this 5S gets the job done quick and right! If I knew the only difference from my 5 which is brand new was going to be the figner print reader and the processor I may not have gotten the 5S. But I do get every model the day they are realesed and couldn't help myself!iOS7 however is a pretty big annoyance! Why did Apple release such a sluggish and buggy iOS that wasn't ready for the public? But a sluggish iOS7 is always better than androids candy ice cream systems ha ha ha", "Date": "February 3, 2014"}, {"Title": "very nice", "Author": "Eduardo Jose Areco", "ReviewID": "R3NZL6O9ZKJ7FV", "Overall": "4.0", "Content": "I am very pleased with this phone. Everything works fine. It has a very nice look and the fingers id is very useful", "Date": "January 31, 2014"}, {"Title": "SEALED", "Author": "GANDUL", "ReviewID": "R2LMGGSMWGI1TK", "Overall": "5.0", "Content": "I AM AN APPLE FAN AS WELL AS A SELLER. SO I APPRECIATE THE FACT THAT THE PHONE COMES SEALED.BRAND NEW,WELL PACKED AND .....FAST. EXCELLENT EVERYTHING!! IN MY OPINION IPHONE 5S IS THE BEST AND MOST BEAUTIFUL PHONE IN THE MARKET.", "Date": "January 31, 2014"}, {"Title": "very nice", "Author": "Eduardo Jose Areco", "ReviewID": "R3NZL6O9ZKJ7FV", "Overall": "4.0", "Content": "I am very pleased with this phone. Everything works fine. It has a very nice look and the fingers id is very useful", "Date": "January 31, 2014"}, {"Title": "SEALED", "Author": "GANDUL", "ReviewID": "R2LMGGSMWGI1TK", "Overall": "5.0", "Content": "I AM AN APPLE FAN AS WELL AS A SELLER. SO I APPRECIATE THE FACT THAT THE PHONE COMES SEALED.BRAND NEW,WELL PACKED AND .....FAST. EXCELLENT EVERYTHING!! IN MY OPINION IPHONE 5S IS THE BEST AND MOST BEAUTIFUL PHONE IN THE MARKET.", "Date": "January 31, 2014"}, {"Title": "What can i say, is apple please!!", "Author": "Diego", "ReviewID": "R1G9HITQMW4MKE", "Overall": "5.0", "Content": "i have an iphone 5 and this was for my sister in law, she love's it, excellent phone and very light.Gold color doesn't go very good to guys, is more like a women's color.", "Date": "January 21, 2014"}, {"Title": "love this iphone", "Author": "brittney kostick", "ReviewID": "R26GUQ5DOCVSNE", "Overall": "5.0", "Content": "I kept debating which new smart phone to get I chose this one and I'm thrilled unlike the Windows phones this is very user friendly and easy to use", "Date": "January 18, 2014"}, {"Title": "Satisfy", "Author": "Chamberlais", "ReviewID": "R16CUOP8G056OP", "Overall": "5.0", "Content": "I was 100% satisfy for this order,it met my expectations as i was expected. No more coment. Well done and many thanks", "Date": "January 15, 2014"}, {"Title": "5S is outsatnding", "Author": "Kuan Chun Huang", "ReviewID": "R2HP2BFFWSH02G", "Overall": "5.0", "Content": "The shipment is a little slow. But 5s is indeed a great phone and better than my expectation. Strongly recommend", "Date": "January 12, 2014"}, {"Title": "Good looking, well manufactured and easy to use", "Author": "Johan René HENDRICHS", "ReviewID": "R1BO5OMAWU8BMR", "Overall": "4.0", "Content": "Together with the IPad the IPhone works great and above all easy to use. A pleasure to have and use the IPhone.", "Date": "January 7, 2014"}, {"Title": "I like it", "Author": "darren king", "ReviewID": "R8C4A1OMLHJU8", "Overall": "4.0", "Content": "We've been here before: the iPhone 'S' conundrum. The new phone comes along, taking the shell of the previous model, adds some new bits and pieces, and then claims to be an entirely new phone.Scores in depthWhich it is, of course. But also it isn't. Well, mostly is. To be sure, it's the kind of move that only Apple can pull off with any kind of conviction: the notion that it can take the same chassis, have a little tinker, throw in a new CPU, slightly better battery and camera, and call it an all-conquering device.", "Date": "January 6, 2014"}, {"Title": "Everything went OK. Fast delivery. Product mostly as describeb.", "Author": "Dax", "ReviewID": "R3VIHCXKMAPVJG", "Overall": "4.0", "Content": "I do subtract one star because the supposed original Apple Lightning-USB cable is not an original one. The mac always warns me when I connect the phone with this one (but no problem when using my old iPhone 5 cable...)And second issue: the iPhone does suffer from a rattle noise when shacking it - which does bother me..The condition was excellent as described and otherwise it does work as it should.", "Date": "January 5, 2014"}, {"Title": "Excellent", "Author": "Rafael A Maceira", "ReviewID": "ROKKKCYA8HHS4", "Overall": "5.0", "Content": "No complaints, as usual the house apple makes quality products, take care of every detail, and much specialize in details that matter to users, such as the duration of the battery, the RAM is extremely fast since it is dedicated, Camera, and other small details.shame what they are in their closed systems of internal exchange of photos, music, and the vast majority of applications have to buy them, but I think that if you want a quality product is well.", "Date": "January 3, 2014"}, {"Title": "Unlocked IPhone 5S", "Author": "Michael J. Charles", "ReviewID": "RPL1RKLGTRD6J", "Overall": "5.0", "Content": "Bought this as a Christmas gift fo my wife. The item arrived as advertised on time and has worked well. The gift was well received.", "Date": "January 1, 2014"}, {"Title": "love this phone", "Author": "Bobby Faulkner", "ReviewID": "RVESFDX1ZTO2Q", "Overall": "5.0", "Content": "purchased this for myself as a christmas gift to myself only complaint is the phone is advertised as unlocked but it had a verizon sim card inside the sim card slot", "Date": "December 28, 2013"}, {"Title": "the phone won't work", "Author": "Barbara H Browning", "ReviewID": "R39YS59IGT8RSJ", "Overall": "2.0", "Content": "I got the phone for my Husband to use over seas and it won't work and now there's now way I can get it back, He can't get it unlocked to use to get in touch with me,", "Date": "December 19, 2013"}, {"Title": "awesome", "Author": "Herminio Mello \"Herminio\"", "ReviewID": "R2F6JX7KMJ520H", "Overall": "5.0", "Content": "awesome smart phone, i paid a lot more for an iphone, but i'm happy as an early adopter, actually in brazil that's the price...", "Date": "December 15, 2013"}, {"Title": "TouchID", "Author": "Dusan Petosevic", "ReviewID": "R2W1LG0D0AWOUK", "Overall": "4.0", "Content": "It has excelent features only TouchID is unreliable and after some time simply does not work. This function should be improved.", "Date": "December 9, 2013"}, {"Title": "Iphone 5s recomend", "Author": "Julian R.", "ReviewID": "R1WF51QESAEJGY", "Overall": "5.0", "Content": "This phone is amazing, great technology, easy use, light weight, everithing is possible with my Iphone 5s, the design, and colour.", "Date": "November 10, 2013"}, {"Title": "fast fast fast, but still the same phone", "Author": "mfountain", "ReviewID": "R1ZFPL0CQ2VFA3", "Overall": "4.0", "Content": "This phone is super fast! everything you do on it is very quickly downloaded or uploaded. The new ios is hit or miss on a few things, but overall the most useful thing is still Siri. If you actually spend the time to work with setting up contacts and their addresses she can take you to your friends house. I put walmart in my phone as the store with its address and now she reminds me when i walk into walmart to get whatever i forgot! The finger print scanner isnt bad either, just takes some times to get it right. Oh, you also can not use it successfully if your hands are at all damp", "Date": "November 4, 2013"}, {"Title": "a great choice!", "Author": "N. Fallah", "ReviewID": "RJ7PP0FIL7SFG", "Overall": "5.0", "Content": "this was a gift purchase & they loved it! it does everything it said it would & was easy to set up & use & they don't know how they lived without it!!", "Date": "November 4, 2013"}, {"Title": "DO NOT TRUST AMAZON PRIME READ PLEASE", "Author": "ShirleyZhang", "ReviewID": "R34J520FWPS8KE", "Overall": "1.0", "Content": "I ordered the iPhone 5s, and they made a stupid mistake. I got the iPhone 5 instead of the iPhone 5s. I do not know how much amazon pay for their staff. Please let your staff afford a pair of glasses in order not to make stupid mistakes like this.Unluckily, I closed the credit card that I used to purchase this phone, and they have sold out all the iPhone 5s, which means I cannot make an exchange. Also If I cannot get the refund, because I closed the credit card, and I donot have another credit card that is from the same bank. If I want to get the refund, I have to go open the unuseful credit card that I have already closed. The credit card that I used to purchase this item is from a bank in China, and I am not going back to China recently, which means I cannot open the credit card that I have closed. If I sent this item back to Amazon, I cannot get the refund, or exchange the item.I really needed the phone when I ordered this item, and this experience has brought me WAY TOO MUCH STUPID TROUBLE JUST BY MAKING ONE SUPER STUPID MISTAKE. In order not to go back to China and open the credit card, which is going to waste me about 2000 dollars for the round tickets. I do not think I am going to change the wrong item. ANYWAY, I PAID MUCH MORE THAN I SHOULD PAY FOR AN IPHONE 5. THIS HAS BOTHERED ME WAY TOO MUCH. IF YOU ARE A HUMAN-BEING, PLEASE SPEND SOME MONEY BUYING SOME DOG FOOD, OR GIVING OUT MONEY TO THE HOMELESS PEOPLE. I'D RATHER HELP THEM INSTEAD OF PAYING FOR THE SUPER STUPID MISTAKE THAT YOU GUYS HAVE PAID. THANK YOU SO MUCH.", "Date": "December 2, 2013"}, {"Title": "Same thing every year", "Author": "bigbub", "ReviewID": "R3P46QD7RUEI7Z", "Overall": "1.0", "Content": "First off I would like to say I only upgraded because At&t; gave me a discount on this 5s. Before I had the 5 which I was kinda stuck with. I swear sometimes I forget I got the 5s. Its almost the exact same phone, but slightly faster, and a poorly made finger print scanner. A 64 bit chip? That may some in handy if it had more than 2gb of ram! I swear apple puts out the same phone every year! I'm sick of it so I'm switching to android. If you still love apple there is really no difference between the 5 and 5s. And literally no difference between the 5c and 5", "Date": "December 12, 2013"}, {"Title": "Same thing every year", "Author": "bigbub", "ReviewID": "R3P46QD7RUEI7Z", "Overall": "1.0", "Content": "First off I would like to say I only upgraded because At&t; gave me a discount on this 5s. Before I had the 5 which I was kinda stuck with. I swear sometimes I forget I got the 5s. Its almost the exact same phone, but slightly faster, and a poorly made finger print scanner. A 64 bit chip? That may some in handy if it had more than 2gb of ram! I swear apple puts out the same phone every year! I'm sick of it so I'm switching to android. If you still love apple there is really no difference between the 5 and 5s. And literally no difference between the 5c and 5", "Date": "December 12, 2013"}, {"Title": "Great Upgrade", "Author": "tmntmn", "ReviewID": "R157WGN12M65VF", "Overall": "5.0", "Content": "I didn't purchase iPhone 5s 64g here but after a couple weeks of using the phone with touch id has been excellent, i would hate using another phone without it since making unlocking the phone so much easier. I went from an iPhone 5 to 5s which i believe has been a huge improvement in speed, can't wait to see what Apple has next up its sleeves", "Date": "October 17, 2013"}, {"Title": "I love this phone", "Author": "David Smith \"smithdav\"", "ReviewID": "R2TIVDVJEM0AWA", "Overall": "5.0", "Content": "I upgraded from an iphone 4.  I bought it from Apple with a 2 year AT&T; Contract.  The phone is amazing.  It is so fast compared to the 4.  All of my APS boot up with lightning speed.  The screen is clear, crisp and the colors great.  The battery life is about the same as my four.  I live in an area with very poor cell phone reception.  It is my feeling that the 5s handles that better than did the four.  Areas that I could not make calls from on my 4 are doable with the 5s. I have read many negative reviews from various sources, but my own experience has been nothing less than positive.  In my mind it is a great phone and well worth what I paid for it.", "Date": "October 10, 2013"}, {"Title": "Iphone 5s Pro's and Con's", "Author": "daniel", "ReviewID": "R1SK8TMAOLR9N3", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moNW6JBEAHUXO3embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moNW6JBEAHUXO3refresh_preplay() {\n\ndocument.getElementById(\"cv_moNW6JBEAHUXO3chiDiv\").innerHTML = document.getElementById(\"cv_moNW6JBEAHUXO3hiddenPre\").innerHTML;\n};\ncv_moNW6JBEAHUXO3refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moNW6JBEAHUXO3so;\t   \n\n\nfunction cv_moNW6JBEAHUXO3loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moNW6JBEAHUXO3so = new SWFObject(swfLocation, \"cv_moNW6JBEAHUXO3AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moNW6JBEAHUXO3so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moNW6JBEAHUXO3so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moNW6JBEAHUXO3so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moNW6JBEAHUXO3so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moNW6JBEAHUXO3so.setAttribute(\"height\", swfHeight);\n          cv_moNW6JBEAHUXO3so.setAttribute(\"width\", swfWidth);\n          cv_moNW6JBEAHUXO3so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moNW6JBEAHUXO3so.write(\"cv_moNW6JBEAHUXO3flashcontent\")) {\n          fp_resizePlayerSpace('cv_moNW6JBEAHUXO3', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moNW6JBEAHUXO3';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moNW6JBEAHUXO3', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moNW6JBEAHUXO3loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moNW6JBEAHUXO3\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m97SJP04Z25UC\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m97SJP04Z25UC\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1SK8TMAOLR9N3\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m97SJP04Z25UC/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moNW6JBEAHUXO3duration')) {\n      document.getElementById('cv_moNW6JBEAHUXO3duration').style.display='none';\n    }\n    cv_moNW6JBEAHUXO3loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moNW6JBEAHUXO3loadSwf(movieID, playerVersion) {\n   return _cv_moNW6JBEAHUXO3loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moNW6JBEAHUXO3newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moNW6JBEAHUXO3', 0, h);\n}\n\nfunction cv_moNW6JBEAHUXO3resetPlayer(w,h,bw,cc) {\n  cv_moNW6JBEAHUXO3newHeight(h);\n\n  cv_moNW6JBEAHUXO3so.addVariable(\"resetBandwidth\", bw);\n  cv_moNW6JBEAHUXO3so.addVariable(\"cacheCode\", cc);\n  cv_moNW6JBEAHUXO3so.setAttribute(\"height\", h);\n  cv_moNW6JBEAHUXO3so.setAttribute(\"width\", w);\n  cv_moNW6JBEAHUXO3so.write(\"cv_moNW6JBEAHUXO3flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moNW6JBEAHUXO3RollOverImg = new Image();\ncv_moNW6JBEAHUXO3RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81InuolnJwS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moNW6JBEAHUXO3preplay = document.getElementById('cv_moNW6JBEAHUXO3preplayImageId');\nif (cv_moNW6JBEAHUXO3preplay) {\n  cv_moNW6JBEAHUXO3preplay.onmouseover = function() {\n    cv_moNW6JBEAHUXO3preplay.src = \"http://ecx.images-amazon.com/images/I/81InuolnJwS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moNW6JBEAHUXO3preplay.onmouseout = function() {\n    cv_moNW6JBEAHUXO3preplay.src = \"http://ecx.images-amazon.com/images/I/81InuolnJwS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moNW6JBEAHUXO3preplay.parentNode;\n\n  var cv_moNW6JBEAHUXO3currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moNW6JBEAHUXO3currentClick) {\n      return cv_moNW6JBEAHUXO3currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:50 MinsiPhone 5s PRO'S1.New processor- chip run on 64 bit A7 chip which is said to be twice as fast as iPhone 5. Which is also desktop class2. Fingerprint scanner- Scans finger when you place on home button(does it pretty fast.3. Great camera-  has 15 percent larger sensor and wider aperture. Also includes slow motion video and burst mode which takes multiple snaps at once( can shoot 10 pictures in a second).4. Available in three colors grey,black, and gold.  CON'S1. Battery Life- There is a slight improvement in battery(which is about ten hours of talk time on 3g networks).2. ExpensiveWATCH VIDEO TO SEE PHONE  Overall its a great phone if you that money to spare.", "Date": "November 1, 2013"}, {"Title": "You should try something else", "Author": "Bethany Hillworth", "ReviewID": "R38ZPX7YNM8KFP", "Overall": "1.0", "Content": "Phone was slow. It doesn't take long for it to start acting up. I would choose an android or galaxy phone. Those are more stable and if you drop those phone they won't break but if you drop and iPhone it'll crack. Get something that will be able to last long. Don't spend your money on something that can break easily.", "Date": "May 18, 2014"}, {"Title": "iPhone 5s - Loved it!", "Author": "Marcela Sounis", "ReviewID": "R2SU2CJISQOXA8", "Overall": "5.0", "Content": "Great phone! Loved it! It came with everything, I could access ir from Brazil and had no problems. Thanks a lot", "Date": "April 14, 2014"}, {"Title": "GREAT PHONE", "Author": "c", "ReviewID": "R3LHBJ0GQW6CY2", "Overall": "5.0", "Content": "GOOD PRICE, GREAT PHONE. LOOKS VERY SLICK. WORKS GREAT. EVERYTHING GOOD ABOUT IT. JUST LOVE IT.BEST PHONE EVER, WOULD BUY AGAIN.", "Date": "April 10, 2014"}, {"Title": "Unlocked??", "Author": "Francis G.", "ReviewID": "R3VXUQ60FQQK7X", "Overall": "2.0", "Content": "Phone was not unlocked and I could not get in touch with the seller which was very frustrating. Had to pay extra to get it unlocked.", "Date": "February 11, 2014"}, {"Title": "Phone is very good, but i have some problem with touchscreen.", "Author": "Jiri Belohlavek", "ReviewID": "R154PO2JW1RW2T", "Overall": "4.0", "Content": "Iphone is my best phone what i ever had. I have some problem with touch screen.Sometimes just stop work and i have to wait a long time.", "Date": "February 4, 2014"}, {"Title": "iPhone 5s purchasing", "Author": "Ronen Rozenshtein", "ReviewID": "R163TLLJDM69XK", "Overall": "5.0", "Content": "I purchased the new iPhone 5s few weeks ago through Amazon.com and I'n very satisfay from the good service both from Amazon.com and the suplier.The product delivered in the proposed time fame.The product itself is amazing !!! I had the 4s until now and there is a huge difference between the two versions!!!", "Date": "January 1, 2014"}, {"Title": "Excellent! I use it in Argentina and works great. I had no problem to use it with my country operators.", "Author": "Marcelo Iorfino", "ReviewID": "R2E708XEE8B1FS", "Overall": "5.0", "Content": "Excellent! I use it in Argentina and works great. I had no problem to use it with my country operators.", "Date": "November 16, 2013"}, {"Title": "Perfect", "Author": "George loumakos", "ReviewID": "R1DG5TCNR3OT64", "Overall": "5.0", "Content": "Exactly as i was expected to be. It works perfect in GSM networks in europe and i am not sure but also works perfect with any GSM network.", "Date": "November 3, 2013"}, {"Title": "Foward Thining idea.", "Author": "michael", "ReviewID": "R5I4YDJIR9JDB", "Overall": "4.0", "Content": "This phone, is a 64bit Foward thinking development idea. It was made mostly thinking about what is going to come in a few years from now. not just for what you need NOW at the present time. just with a 64bit proccesor you know you will have a phone thats going to last and thats going to be compatible with Apps that are coming to the new era of technology. If thinking about buying it. Just click that darn Add to Cart Button. you wont be dissapointed.", "Date": "November 1, 2013"}, {"Title": "Very good", "Author": "Suliman", "ReviewID": "R8PO0NMG1MEXP", "Overall": "4.0", "Content": "I like iPhone it is easy to use nothing complicated very fast very smoothiPhone 5s battery is good alsoexcellent computability on mac os x and iCloud", "Date": "October 31, 2013"}, {"Title": "WHY IS AMAZON ALLOWING FRAUD!", "Author": "B. Wright", "ReviewID": "R1BUA1GZHN7SIA", "Overall": "1.0", "Content": "Why is Amazon allowing those who are deceiving buyers, by selling them Locked phones, when they are advertised as being Unlocked? I got kicked off of Ebay for doing too good for a new seller, selling phones, without a single complaint, where as ebay though I was cheating the customers, and not sending them anything. So they started holding payments until I shipped the phones first, then get paid later, but I just kept cancelling the orders every time they held payments, and eventually they closed my account. Now this guy has almost as many complaints as he have good reviews, yet, it seems Amazon is simply being hush, hush about it, as long as they're getting their percentage.", "Date": "December 11, 2013"}, {"Title": "Terrible", "Author": "Eliete Verissimo", "ReviewID": "RPBW4LD2VQIEZ", "Overall": "1.0", "Content": "I received the Iphone on beginning of april. I bought how new iphone And didn't open the box. Now that I'm in Brazil  I open the box and I discovered that this is not a new iphone.  As matter of fact is a old cellphone in a new box locked with password. I want to return this iphone.", "Date": "April 28, 2014"}, {"Title": "scam", "Author": "Andres Mora", "ReviewID": "R3RDACHVACPCZ9", "Overall": "1.0", "Content": "I bought a new unlocked iphone 5s and I send a cell into a paper bag used striped and q is not what I bought, I sent an iphone 5.this is a scam, who will vouch for that", "Date": "December 28, 2013"}, {"Title": "I love it!", "Author": "Len Ye", "ReviewID": "R16U3H5193226P", "Overall": "5.0", "Content": "It's unlocked and unopened.I love it!Thank you very much!I will buy the iPhone6 in your shop next year~~~And the FedEx was very fast~", "Date": "November 2, 2013"}, {"Title": "Fantastic", "Author": "Ezrahi \"ezrahi\"", "ReviewID": "RGTSSR4BWHX7S", "Overall": "5.0", "Content": "What can go wrong with the iPhone 5S Gold? Nothing. Exactly.Great phone from Apple. This is the fastest iPhone yet.", "Date": "October 28, 2013"}, {"Title": "Excellent Service", "Author": "Martin Blazquez \"martin abj\"", "ReviewID": "R2TY0Y2B2EM9XR", "Overall": "5.0", "Content": "On time and the product complyed all the requirements.IT arrived in very good conditions, Brand new.I have been using for a month a no problem at all.Finger print recognition works perfectly.", "Date": "October 26, 2013"}, {"Title": "Excellent Service", "Author": "Martin Blazquez \"martin abj\"", "ReviewID": "R2TY0Y2B2EM9XR", "Overall": "5.0", "Content": "On time and the product complyed all the requirements.IT arrived in very good conditions, Brand new.I have been using for a month a no problem at all.Finger print recognition works perfectly.", "Date": "October 26, 2013"}, {"Title": "Best phone ever", "Author": "Abdullah Binhayyan", "ReviewID": "R15ULE6MSPRL1P", "Overall": "5.0", "Content": "Best Handset ever made by appleTouch id is fast and resposive, camera is amazingPros: touch id, light weight,fast proseccerCons: Price", "Date": "October 26, 2013"}, {"Title": "Best phone", "Author": "Mireya zavala tea", "ReviewID": "R28YWRTMEXPTOC", "Overall": "3.0", "Content": "It was great I love it I use it like all the time every day I love how the pictures come out", "Date": "May 16, 2014"}, {"Title": "Facetime and camera is horrible!!!", "Author": "Sanjay Ramjattan", "ReviewID": "R3UTQSGR0MYXWB", "Overall": "2.0", "Content": "Phone works fine but facetime works tereble my call keeps dropping every 10secs or less also the camera zoom is not the best. I wont advise any one to buy this phone if these features are impotant to you. I would go with the samsung s4 or s5 the camera together with video chat is much better. Samsung is the way!!!!", "Date": "April 21, 2014"}, {"Title": "Avoid iMessage like the Plague", "Author": "Martin Smith", "ReviewID": "R1EBNOPB5FCE3G", "Overall": "1.0", "Content": "I bought an iPhone and now I can't switch away. Any other iPhone users will always iMessage you after you switch away from an iPhone and they'll always iMessages and won't ever see that their messages never reached you.It's like getting herpes. Once you get it, you got it forever and then you go and give it to other people. Absolutely pathetic.I've talked to multiple \"senior\" Apple support people. There is no cure.", "Date": "April 15, 2014"}, {"Title": "Super Speed on deliver it", "Author": "Santiago Fernandez Herrero", "ReviewID": "RLGWDKROS3KX6", "Overall": "5.0", "Content": "The phone is really amazing, I'm a new Apple fan. The rest of the phone a can't be compared with this one", "Date": "April 12, 2014"}, {"Title": "excellent team", "Author": "efren bastardo", "ReviewID": "R36VIODQJ9ATYJ", "Overall": "5.0", "Content": "my first iphone was more than I expected the truth must be taken in hand, to live the technology in its broadest concept, I can say here really does not represent what you can do with it, I think the limit of team is the imagination of the Board Index", "Date": "April 12, 2014"}, {"Title": "not recommend buying this product,", "Author": "Eduardo Salazar", "ReviewID": "R1RD54ZKBK5P6H", "Overall": "1.0", "Content": "not recommend buying this product, at least for a country outside the U.S.. Upon receipt I could not use, but thought this phone unlocked", "Date": "March 23, 2014"}, {"Title": "CRAP!", "Author": "delani 123", "ReviewID": "R2EY3PLYNS3R6L", "Overall": "1.0", "Content": "Don't get it! thats all i can say! Huge waist of money! And it took 20 days to get here.", "Date": "March 12, 2014"}, {"Title": "Too expensive.", "Author": "Fei Lin", "ReviewID": "R2Y32046W18D49", "Overall": "3.0", "Content": "Too expensive. I don't know why it's so expensive and why the price changed to $750 quick after I paid $790 for it and refresh the wet site.  The price on apple' official net is only about $650.", "Date": "March 10, 2014"}, {"Title": "Nice", "Author": "cirllee", "ReviewID": "R3SUPBC4FQ545X", "Overall": "5.0", "Content": "To be honest i hate apple with a passion, but i bought this phone because a friend wanted it . and i was very impressed that the item came as ordered, within a matter of days, also it is so clean and neat, popped the sim in and bam it was working like a dream. this facetime thing was kinda interesting and just a all around good product from a great seller.", "Date": "February 10, 2014"}, {"Title": "Iphone 5S did not come unlocked as offers", "Author": "Hans Holec", "ReviewID": "R1W4MMNLJ20E7J", "Overall": "1.0", "Content": "The Iphone 5S was definitely not available as unlocked and that is in my eyes a scam! He offers me to send them back at my expense, I will not do! I do not have an address of the supplier or a phone number. I want to stay a recall on my phone number he has not made.Only short messages without name, adress or phonenumber! This ist not serious!The Iphone 5S can be unlocked by T-Mobile USA on the basis of IMEI No. He just needs cause.Why the dealer does not do that? Something seems to be wrong here. I come only in June back to the U.S..I will appoint a lawyer to examine the issue.ORDER PLACEDJanuary 9, 2014Order Details | InvoiceORDER #107-1597809-1345043Apple iPhone 5s, Silver 16GB (Unlocked)Sold by Deaviator", "Date": "February 10, 2014"}, {"Title": "I love this phone", "Author": "L. Irvin", "ReviewID": "RXAEEK79LV147", "Overall": "4.0", "Content": "Iphones are the best and this provider delivers.  The phone is a little on the high price side of things but its a Iphone.  Don't complain", "Date": "January 20, 2014"}, {"Title": "I am impressed", "Author": "Tobias T.", "ReviewID": "R1ZG2EE0FR6T65", "Overall": "5.0", "Content": "Still one of the greatest phone out there.  I really don't need a 5s. I believe 5 is just as good as the 5s.", "Date": "January 15, 2014"}, {"Title": "GREAT PHONE", "Author": "Sad", "ReviewID": "R1Z7J669VFPSJ4", "Overall": "5.0", "Content": "CHECK THIS YOUTUBE VIDEO FOR A BETTER REVIEW VS GALAXY S4http://youtu.be/fGqeZxOqKhgCHECK THIS YOUTUBE VIDEO FOR A BETTER REVIEW VS GALAXY S4http://youtu.be/fGqeZxOqKhg", "Date": "January 10, 2014"}, {"Title": "Great Thank you.", "Author": "C. Ash \"Carolyn\"", "ReviewID": "R1PA10N2DEWU70", "Overall": "5.0", "Content": "I haven't had time to play with it but it looks wonderful.  I am going to use it in Turkey and have to register it first so really can't comment on performance.", "Date": "January 4, 2014"}, {"Title": "It exceeded my expectations", "Author": "Mangraskinbeauti", "ReviewID": "RMFBD365FT601", "Overall": "5.0", "Content": "This phone has truly exceeded my expectations. The camera alone is worth the purchase. I would highly recommend to my friends and family.", "Date": "January 4, 2014"}, {"Title": "iPhone 5S", "Author": "lucia", "ReviewID": "R27XL31PP6YFA3", "Overall": "5.0", "Content": "I bought it as a present for my son, for Cristhmas.As I have my one, also a 5S and he liked a lot, i decided to surprise him and I did.It is easy to deal with, and so far, and it is my 2º iPhone , never  had any problems with none of Apple stuffs.It's a matter of trust.Lucia", "Date": "January 3, 2014"}, {"Title": "Not worth it", "Author": "meinfla", "ReviewID": "R3RCA1ZESZHRFS", "Overall": "2.0", "Content": "Bought an unlocked version compatible with T-mobile. Fastest speed it would get without turning on the 3G button was E speed with 1 bar. I am in an area where 4G and Lite are readily available. WI-FI wouldn't work. I have an android phone with identical connectivity ( no lite) and I get 4G with 3 bars minimum. Apple says it's the Network, the Network says it's Apple. Too much of a hassle for a high priced phone, I sent it back.", "Date": "December 24, 2013"}, {"Title": "nope not even for phone lust", "Author": "SheShops2much", "ReviewID": "RM4V7ZLTYZMJT", "Overall": "5.0", "Content": "Love this phone but at $649 16GB, $749 for 32GB and $849 for 64GB  from Apple online why i the world would I spend this much?", "Date": "December 20, 2013"}, {"Title": "iPhone 5S", "Author": "lucia", "ReviewID": "R27XL31PP6YFA3", "Overall": "5.0", "Content": "I bought it as a present for my son, for Cristhmas.As I have my one, also a 5S and he liked a lot, i decided to surprise him and I did.It is easy to deal with, and so far, and it is my 2º iPhone , never  had any problems with none of Apple stuffs.It's a matter of trust.Lucia", "Date": "January 3, 2014"}, {"Title": "Not worth it", "Author": "meinfla", "ReviewID": "R3RCA1ZESZHRFS", "Overall": "2.0", "Content": "Bought an unlocked version compatible with T-mobile. Fastest speed it would get without turning on the 3G button was E speed with 1 bar. I am in an area where 4G and Lite are readily available. WI-FI wouldn't work. I have an android phone with identical connectivity ( no lite) and I get 4G with 3 bars minimum. Apple says it's the Network, the Network says it's Apple. Too much of a hassle for a high priced phone, I sent it back.", "Date": "December 24, 2013"}, {"Title": "nope not even for phone lust", "Author": "SheShops2much", "ReviewID": "RM4V7ZLTYZMJT", "Overall": "5.0", "Content": "Love this phone but at $649 16GB, $749 for 32GB and $849 for 64GB  from Apple online why i the world would I spend this much?", "Date": "December 20, 2013"}, {"Title": "Exellent phone", "Author": "A E A", "ReviewID": "R3TD0B525QWSH3", "Overall": "5.0", "Content": "Great And Very nice phone its faster than i phone 5 and more tech than iphone 5Thanks v muchApple", "Date": "November 3, 2013"}, {"Title": "iPhone 5s Breakdown", "Author": "yoseaweed", "ReviewID": "R3M12EKDT08D30", "Overall": "4.0", "Content": "I just received my brand new Apple iPhone 5s and overall my experience has been rather pleasing. Apple only releases one iPhone each year so I had to act quickly to get my hands on one, especially the gold color since supplies went to China first. Nerveless, I was able to get my hands on the 32-gigabyte gold iPhone model for $299 on contract with AT&T.;I had upgraded from the iPhone 5 so I was familiar with the design and features but customers who are upgrading from older generation devices will be rather surprised with its results. The gold color is a nice touch since its new, but once a case covers it the color is unnoticeable. If you decide to use the device naked, the gold color differentiates the 5s from the 5 greatly.Apple's Touch ID, the fingerprint sensor, is a cool feature but to me it does not appeal. As of now its use is limited to unlocking the device, signing into your apple account to make purchases, and store five prints, but the potential is great. Developers could soon utilize this feature and incorporate it into their apps or games to make them more exciting.The 120 fps feature on the 5s's camera is a great way to show off action shots in slow motion to friends and family. The camera quality is OK but needs to be upgraded from the iPhone 5. The upgraded duel flash is a great improvement from previous generation iPhones, particularly in dark conditions. In addition, Apple's new A7 chip allows for faster responses on iOS 7. Apps that require more power such as iMovie can run faster on the 5s compared to the 5, which takes longer to export data.Apple says the iPhone 5s is five times as fast as the iPhone 5, but my speed and responsiveness tests confirm it is actually twice as fast. The 64-bit architecture allows faster apps to run on the 5s, but compatible apps on the App Store are limited since its \"new\" technology.In all, if you are available for an upgrade, the iPhone 5s is worth it from an older generation device such as an iPhone 4 or 4s. If the 5s's new features appeal to you, upgrading to the 5s is not a bad choice either, especially with the new technology. Additional warranties are offered from Apple to protect the device, but a simple case can prevent uncertain accidents from happening for years to come.- Mitch ( an iPhone user )", "Date": "October 3, 2013"}, {"Title": "defected phone", "Author": "ryan Kinjo", "ReviewID": "R14ME0ZNJLK9OF", "Overall": "1.0", "Content": "This seller sold me a defected product whom they blame on my part, but the only way i touched the phone was to charge it. Moreover, Apple says the iphone has a water spillage of some sort, which is impossible for that issue to be on my end. Although most reviews are very good for this seller, be aware that there will always be those few people who get f***** over by Technomaster.", "Date": "March 14, 2014"}, {"Title": "Unacceptable and the product sold as a scam!", "Author": "Kurtis Yip", "ReviewID": "RM8O0R0AAF9KS", "Overall": "1.0", "Content": "The product I ordered did not match its original description! Instead of \"new\" and \"unlocked\", I found that the iPhone 5S is pre-owned and locked! It is totally unacceptable. I took it to a local apple shop and has been examined by the staff. They told me it is a locked phone and even found an old SIM card in the sim slot!", "Date": "March 13, 2014"}, {"Title": "Great Product and as advertized", "Author": "Bala K.", "ReviewID": "R37ZU5M1JVK75J", "Overall": "5.0", "Content": "Came on time and is good product. No issues at all. Got all the accessories as well. No scratches at all.", "Date": "January 21, 2014"}, {"Title": "Nice iPhone", "Author": "Zo0oZo0o", "ReviewID": "R17BO3BIAK77PM", "Overall": "5.0", "Content": "All thing new . It has new style and new iOS 7 and has three colorsIt's choice to chooseThanks Apple", "Date": "November 1, 2013"}, {"Title": "Not worth the upgrade", "Author": "Sandy", "ReviewID": "RKARHR48JTTQ2", "Overall": "1.0", "Content": "Its got A7 64bit processor, fingerprint scanner. But for 99.9% of the users.. its not going to matter. I upgraded from a 5 to a 5s for my wife and now I regret this decision. A total waste of money. Rightly said.. the 's' in 5s stands for 'Same'There are still a lotta bugs in iOS7 which need to be fixed.", "Date": "November 5, 2013"}, {"Title": "Won't do it again", "Author": "Marcelo C.", "ReviewID": "R2ZLW39CQ1EKFL", "Overall": "1.0", "Content": "It never worked.First the \"blue death screen\" and following this it even did not turn on.Sent back to Amazon for refunding.", "Date": "November 4, 2013"}, {"Title": "iPhone 5S is AMAZING!", "Author": "Ivan Lopez", "ReviewID": "R3IGTFUMTMXARV", "Overall": "5.0", "Content": "Today, a cell phone is much more than just a cell phone. A cell phone is a fashion icon and a result of great engineering and design. It is more a computer than fits in the palm of your hand. The new iPhone 5s from Apple is a vast improvement in all aspects when compared to the older iPhone 4s. For consumers looking for a new iPhone, the 5s does everything the 4s did but with an even bigger convenience while still looking elegant and being ergonomic.Apple works meticulously to design their products and misses no detail. The 5s is no exception. With a design that just feels natural in your hand considering its size and weight. It is much thinner and lighter than the 4s so it just feels even better than before. It is slightly taller but it is so miniscule that only when comparing will you be able to notice the difference. The aluminum material used in the bezel provides a feeling of a very sturdy phone and the small weight of the phone. The design is not the only thing that makes the iPhone a good phone but more the other aspects.There is an improvement in screen size from the iPhone 4s. The 4s, had a 3.5 inch screen and the 5s packs a 4 inch screen but just increasing the height of the device but a small bit. The .5 inch improvement might not seem like much on paper but it adds a whole section of more viewing experience. We get one extra row of icons, which will de-clutter the phones home screen. Once having the 5s and experiencing the change you will never want to go back to the 4s.When wanting to do something whether you're in a hurry or just sitting relaxing, you will always want you phone to run fast. In todays world we are used to instant gratification when we want to do something and the iPhone 5s provides just that. The 5s, provides a new processor called the A7 chip, another huge improvement over the iPhone 4s, A5 chip. The A7 gives the iPhone 5s a smooth experience and will never lag when doing tasks. Opening an app takes less than a second after opening the app. It also provides a better video and picture viewing due to the new and faster processor. Images taken with the 5s will even look better since the phone processes images with more power and speed. Phone calls and text messages are a must on any phone and these days the quality and speed of them are up to par.If those improvements aren't enough, then maybe this feature will convince you. Putting in your passcode every single time you use your phone can become a hassle and when wanting to access the phone really quick, this can become an annoyance. Apple has implemented a new sensor in the phone called Touch ID, this is integrated into the home button so nothing big has changed other then the ability to access the phone with your fingerprint. The process of the phone recognizing your finger and letting you inside the phone is almost instant and is so accurate that it will never mistaken someone else's finger with yours. This feature is also accessible when wanting to buy a song or app from the app store. Instead of imputing your password when you want to buy something, just set your finger on the button and before you know it, it will be downloading.The iPhone also has `industry leading' camera optics and it is said that the best camera is the one that you will always have with you. Combining those, the iPhone 5s is also the best camera out there. With an increased image sensor from the 4s, the iPhone 5s will capture all the colors that you see and capture it beautifully and with great clarity with its 8MP camera. The video the iPhone 5s captures is 1080p with great sounding audio. A cool feature of the camera is that it features a slow-motion video at 120 frames per second.For people who want a phone that does the basics and then goes beyond while still looking amazing, get the iPhone 5s. It offers amazing features that you will actually use. If the carefully designed body of the iPhone is not enough than maybe the increase in screen size will. The phone is much fast than the iPhone 4s, has the fingerprint reading capability for unlocking, and offers amazing picture quality. The iPhone sales for $199 with 2 years contract and overall the iPhone 5s is an amazing phone that will not leave you asking the question, \"Why doesn't it do this?\"", "Date": "October 15, 2013"}, {"Title": "Iphone 5s owners review", "Author": "Bryce Hale", "ReviewID": "R3VY1G29DPJOVA", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moVFEK4VRFAGDUembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moVFEK4VRFAGDUrefresh_preplay() {\n\ndocument.getElementById(\"cv_moVFEK4VRFAGDUchiDiv\").innerHTML = document.getElementById(\"cv_moVFEK4VRFAGDUhiddenPre\").innerHTML;\n};\ncv_moVFEK4VRFAGDUrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moVFEK4VRFAGDUso;\t   \n\n\nfunction cv_moVFEK4VRFAGDUloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moVFEK4VRFAGDUso = new SWFObject(swfLocation, \"cv_moVFEK4VRFAGDUAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moVFEK4VRFAGDUso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moVFEK4VRFAGDUso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moVFEK4VRFAGDUso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moVFEK4VRFAGDUso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moVFEK4VRFAGDUso.setAttribute(\"height\", swfHeight);\n          cv_moVFEK4VRFAGDUso.setAttribute(\"width\", swfWidth);\n          cv_moVFEK4VRFAGDUso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moVFEK4VRFAGDUso.write(\"cv_moVFEK4VRFAGDUflashcontent\")) {\n          fp_resizePlayerSpace('cv_moVFEK4VRFAGDU', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moVFEK4VRFAGDU';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moVFEK4VRFAGDU', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moVFEK4VRFAGDUloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moVFEK4VRFAGDU\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1UGFNAHCY1L7G\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1UGFNAHCY1L7G\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3VY1G29DPJOVA\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1UGFNAHCY1L7G/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moVFEK4VRFAGDUduration')) {\n      document.getElementById('cv_moVFEK4VRFAGDUduration').style.display='none';\n    }\n    cv_moVFEK4VRFAGDUloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moVFEK4VRFAGDUloadSwf(movieID, playerVersion) {\n   return _cv_moVFEK4VRFAGDUloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moVFEK4VRFAGDUnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moVFEK4VRFAGDU', 0, h);\n}\n\nfunction cv_moVFEK4VRFAGDUresetPlayer(w,h,bw,cc) {\n  cv_moVFEK4VRFAGDUnewHeight(h);\n\n  cv_moVFEK4VRFAGDUso.addVariable(\"resetBandwidth\", bw);\n  cv_moVFEK4VRFAGDUso.addVariable(\"cacheCode\", cc);\n  cv_moVFEK4VRFAGDUso.setAttribute(\"height\", h);\n  cv_moVFEK4VRFAGDUso.setAttribute(\"width\", w);\n  cv_moVFEK4VRFAGDUso.write(\"cv_moVFEK4VRFAGDUflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moVFEK4VRFAGDURollOverImg = new Image();\ncv_moVFEK4VRFAGDURollOverImg.src = \"http://ecx.images-amazon.com/images/I/8113JGevLRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moVFEK4VRFAGDUpreplay = document.getElementById('cv_moVFEK4VRFAGDUpreplayImageId');\nif (cv_moVFEK4VRFAGDUpreplay) {\n  cv_moVFEK4VRFAGDUpreplay.onmouseover = function() {\n    cv_moVFEK4VRFAGDUpreplay.src = \"http://ecx.images-amazon.com/images/I/8113JGevLRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moVFEK4VRFAGDUpreplay.onmouseout = function() {\n    cv_moVFEK4VRFAGDUpreplay.src = \"http://ecx.images-amazon.com/images/I/8113JGevLRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moVFEK4VRFAGDUpreplay.parentNode;\n\n  var cv_moVFEK4VRFAGDUcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moVFEK4VRFAGDUcurrentClick) {\n      return cv_moVFEK4VRFAGDUcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 3:02 MinsI bought a iphone 5s the first day it was out, I like it much better than 5s, the speed, camera, fingerprint ID, motion chip, make it a decent upgrade. A larger screen will be the next step, hopefully in 2014. Thanks for checking it out, more videos here [...]", "Date": "September 20, 2013"}, {"Title": "To much", "Author": "geneva russell", "ReviewID": "R33AIARTNN584Q", "Overall": "1.0", "Content": "You guys are saleing these iPhones more than you can buy in stores .......need to lower the price on these phones", "Date": "April 4, 2014"}, {"Title": "nice phone", "Author": "van eylen", "ReviewID": "R3MRC5QXT9OOT7", "Overall": "5.0", "Content": "it's beautiful, nice phone but we really want to see something different, everything is a little bit the same, I hope apple take advantage from the released of the Samsung galaxy s5 to use a little bit of benchmarking to build a better iphone 6", "Date": "April 12, 2014"}, {"Title": "OK", "Author": "Sherman.zhou", "ReviewID": "R2GFWO162QL1CL", "Overall": "5.0", "Content": "It looks quit new and runs wll, no any problem but no earphone I noticed, however I marked its 5stars", "Date": "January 25, 2014"}, {"Title": "An appliance very special and superb working.", "Author": "Vicente J. LLorca \"Musicólogo\"", "ReviewID": "R1SN49R5LCHS9J", "Overall": "5.0", "Content": "An appliance very special and superb working. I have had some cell phones in a similar category, but none work as well as this one in every way. So I recommend it to anyone who can afford the cost.", "Date": "January 22, 2014"}, {"Title": "Get a iPhone!!!!!", "Author": "C249", "ReviewID": "R3MAPK7K2NKFXL", "Overall": "5.0", "Content": "I think people should bye an iPhone.  I really like this product a lot!!!!!!They are very easy to use.  You can have unlimited talk and text any whereyou go.  If your going somewhere  and it takes along time you can by games and books.  If somebody is away and you want to text then you can by going on the texting app.  Its alot of money but it is worth every single penny.  If you have kids you can download books and GAMES.  The iPhone pretty much works whereever you go.  It takes about 30 min to charge it and get to a hundred.  If your battery is low it gives you a reminder.", "Date": "January 2, 2014"}, {"Title": "Warning!! The phone is not unlocked", "Author": "Alex", "ReviewID": "R1BPANDB0Y9E7K", "Overall": "1.0", "Content": "I buy this Unlocked for use in another country, but it dont work with carrier movistar, i write to amazon since 2 weeks and they don't help me.They close the case writing to me\"Motiur has closed the return request listed below. Reason for the closure of your request: Solved a technical issue\"900 dolars and i can use the pone!!only work with T mobile.", "Date": "December 17, 2013"}, {"Title": "Whatever you do don't drop it", "Author": "colleen cotee", "ReviewID": "R51BR7OGCO8EF", "Overall": "1.0", "Content": "The phone it's self is great but after having a family of 4 owning iPhones for the past 5 years and dropping them occasionally without any damage being done I have to give this phone a one star.  I had my new phone for 3 weeks when it slipped out of my hand onto the pavement and the screen is completely shattered.  What does apple have to say, too bad you have to get a new one, we can't fix it because we don't have the equipment to do so yet.  I believe there is a defect in the manufacturing, a phone should be durable enough to take a fall and this thing is not.", "Date": "October 17, 2013"}, {"Title": "New font style/size/color difficult to see!!!", "Author": "N", "ReviewID": "R1XVSLV691AUY8", "Overall": "1.0", "Content": "I recently purchased an iPhone 5s and really hate the new font style/size/color and some of the background colors. I called Applecare for a question and had so much difficulty to read the serial number under settings. The serial number font is too small and in light gray!!!! I gave the wrong serial number to the apple care agent and the he added my name to someone else's account. Finally I took the phone under a bright light and managed to read and give the correct serial number to the agent. It seems that people who designed the new 5s screens do not have good common sense and Apple has not had proper review of the visual design before making the phone available to the public. My old iPhone 4 screen design was much much better. Also I do not understand why Apple insists to keep the phone screen size so small? This is making reading or watching video's really unpleasant.", "Date": "February 8, 2014"}, {"Title": "WORST PHONE EVER!", "Author": "Stephanie", "ReviewID": "R8PQBO6YZFF00", "Overall": "1.0", "Content": "\"I don't know why Apple is trying so hard to emulate Microsoft! There iOS systems have been getting worse over the last couple of years. 12 hours and counting and I still can't get everything downloaded off my cloud and into my phone, even tried the backup on my computer and it just sits there waiting to sync! Phone is going back!!\"", "Date": "December 21, 2013"}, {"Title": "ASK BEFORE U BUY UNLOCKED!!!!!!!!", "Author": "BizyLady", "ReviewID": "R11LC7HUFSA6YA", "Overall": "2.0", "Content": "I didn't purchase this phone yet, as I am looking to buy the iPhone Gold 16GB without the T-mobile logo on it. No one can tell me if the T-mobile logo will come on the phone. So please disregard the rating.The sellers must specify which phone you are buying.........as Apple DOES NOT SELL ANY UNLOCKED iPhone. What they sell is the T-mobile with NO CONTRACT phone, which is LOCKED. An Apple rep told me that if you decide to buy this phone, you will have to buy a $50 prepaid card (minimum) in order to use the phone and after 40 days you will have to go to a T-mobile rep to unlock it for you. So any new iPhone 5S sold as \"new\" or sealed.......will not be unlocked. BUYERS BEWARE!", "Date": "November 16, 2013"}, {"Title": "Cool gizmos, bad call and data reception", "Author": "Kevin Shea", "ReviewID": "R1LG7KYCYONYA8", "Overall": "1.0", "Content": "I bought a new iPhone 5S from Apple in April 2014 to replace my iPhone 4 and while a few things impressed me, several of the most important things you'd expect to do took a step backwards. As I compare the two, note that both the iPhone 4 and 5S were running on the same carrier with the same plan.Pros:- Lots of memory- Quick processor (when it didn't lock up)- Great camera- Lightweight- The fingerprint sensor is a godsend if you need to have a \"strong\" password, and it works very wellCons:- Poor phone reception -- no phone service on the first floor of my house (my iPhone 4 gets two bars/dots and doesn't drop calls when I step in the house)- Bad 2G (Edge network) reception -- despite having a connection it can't get mail, connect to servers, etc (again, my iPhone 4 would connect in the same places without problems, albeit slowly)- Phone pauses/locks up in some apps (email and iMessage were notable since they're apps that come with the phone) and the home button needs to be pushed repeatedly to escape- The battery life is no better than my now 2+ yr old iPhone 4In the end the iPhone 5S went back because it wasn't worth taking a step backwards in cell and data coverage combined with a steep price tag.  I was very disappointed.", "Date": "May 7, 2014"}, {"Title": "very not good.", "Author": "gûolinliwei1234", "ReviewID": "R2S3ZSQLSYWDJY", "Overall": "1.0", "Content": "I didn't order is to be new of kaifeng. Did you send me is open box, and lack of parts. Good faith has a problem. I think we don't have the cooperation opportunity.", "Date": "December 9, 2013"}, {"Title": "Error sending product.", "Author": "Claudia Maia", "ReviewID": "R1T9UHE79VIA1O", "Overall": "1.0", "Content": "I bought the product and got locked unlocked. I need a document to make the switch in one of the Apple stores in Brazil, where I live.", "Date": "January 16, 2014"}, {"Title": "Phone suddenly stopped working", "Author": "Sue in Valpo", "ReviewID": "R6ISJKF8C337S", "Overall": "1.0", "Content": "I purchased my iPhone 5S less than a month ago (thru AT&T;, not Amazon) and it suddenly died. It had about 80% power, so I don't think it was the battery. I put it on the charger to be sure, nothing. It was working fine, I set it down on the table, and then the next time I picked it up, it was dead.I will work my way back to the AT&T; store tomorrow through all of the holiday traffic, but I'm sure they won't have a replacement in stock 3 days before Christmas. I probably lost all of the pictures I took today since it backs up to the cloud nightly.I wouldn't recommend purchasing one of these this year - wait until they work out the issues.", "Date": "December 21, 2013"}, {"Title": "Best phone I have ever had", "Author": "joaquin", "ReviewID": "R35MU85GDPUH6R", "Overall": "5.0", "Content": "This phone is amazing. IIt is very stylish and light . I love the new finger print scanner it works great as well Very satisfied", "Date": "October 5, 2013"}, {"Title": "I am not satisfied with the product", "Author": "Monica Heredia", "ReviewID": "R3MQ3FY4PWPQFM", "Overall": "1.0", "Content": "I am not satisfied with the iPhone 5s, because I bought an unlocked iPhone but the one that I recieved is not unlocked, I am not any more in the US, could you tell me how Will you solve this problem.In despiste of your decision, I want yo tell you I am completely not satisfied with the product.", "Date": "January 7, 2014"}, {"Title": "USPS 2 business day delivery failed", "Author": "Cesar Rodriguez", "ReviewID": "R38LD4RZ81JU80", "Overall": "3.0", "Content": "The phone is ok, the quality of the phone is fine and it is faster than its previous version (5).The only aspect I am not satisfied is for the USPS two business days delivery didn't work, as I received my item one day late (it took 3 business days). If I knew it I'd better pick the 3-5 days,delivery that is quite cheaper.", "Date": "November 15, 2013"}, {"Title": "I will give them total of. 5 stars", "Author": "Francisco Jacquez", "ReviewID": "RWXZWK9H2810I", "Overall": "4.0", "Content": "Ok I like my iPhone 5s I thank you for making this happen it's great thanks I will tell all my family about so they can used amazon it safe and very true", "Date": "January 24, 2014"}, {"Title": "excellent saler", "Author": "abdullah almarzooq", "ReviewID": "RPNSGVN2UEPSI", "Overall": "5.0", "Content": "I appreciate quick respond from the saler and  he is very ownest with costemer i will continoue buying goods from him", "Date": "January 22, 2014"}, {"Title": "HUGE disappointment.", "Author": "Joseph M. Davis", "ReviewID": "R3Q1R8EL26OJ8A", "Overall": "1.0", "Content": "I expected to love it just like all of the other iPhones that I have owned. There is one ENORMOUS problem with it. You cannot hear your voice speaking into the mic through your headphones very well at all.  I have done resets, tried various headphones, had the phone replaced, spent hours on the phone with Apple and in person at their so-called genius bar, upgraded to the new OS, and nothing has worked. I will change my review if they can fix it but so far this has been a huge let down and I have to admit that my 4S is a vastly superior phone.", "Date": "November 20, 2013"}, {"Title": "Not my purchase, my account was compromised.", "Author": "Lori Joseph \"momyhawk\"", "ReviewID": "RYR5XI46ZDRH9", "Overall": "1.0", "Content": "This was fraudulently purchased on my account! I DO NOT WANT TO WASTE MY TIME WITH YOUR RIDICULOUS WORD COUNT POLICIES !", "Date": "November 13, 2013"}, {"Title": "Work of Art", "Author": "kpg23", "ReviewID": "R14XOYL8P5021Q", "Overall": "5.0", "Content": "I'm a dedicated Apple customer and have been for many years. I find their consumer products and iOS to be simply better than any alternative. Having said that, upgrading to the 5s was magical. It's an absolutely stunning piece of hardware, and it is a perfect complement to iOS7. The day I bought this phone (release day) I toyed around with some of the Samsung and LG smartphones in the ATT store. I was actually somewhat impressed with these devices as well, but I would never pass up on this phone (5s) to get one of them, even at a better price. I enjoy paying a premium for quality, and that is what the 5s is. The quality is impeccable.I love the fingerprint reader. I never locked my iPhone 4s before, but its ease of use makes it far more logical to leave my phone locked.I have read some of the reviews of the 5c, and most are pretty rough. I played around with it at the apple store the other day, and while I wasn't blown away, I wasn't disappointed either. I will likely gift this phone to family for the holidays because they will appreciate the colors and how cool it looks with iOS7 (they aren't as tech savvy and younger). I think the price on the 5c is definitely higher than one would like especially without a contract, but the internal quality doesn't seem to be as bad as some of the reviews I was reading.All in all, this phone, as with almost all of the iPhone updates, is ahead of the competition, and the premium price is worth it.", "Date": "October 9, 2013"}, {"Title": "Require Passcode: Immediately means you can't use the finger print sensor", "Author": "Laurel \"I love the internet.\"", "ReviewID": "RSEDVB9I81MNO", "Overall": "1.0", "Content": "Require Passcode: Immediately is the only option if you want to use the finger print sensor. It takes more time to enter a passcode then it does to swipe. What is the point of paying for the finger print sensor so the iphone can be easier if you have to Require Passcode: Immediately each time you touch your phone. The finger print means your finger can touch it, but if there is also a passcode why make you enter that also? There are two thing that both need doing, that wastes tons of your time. If you add up all the times you entered the passcode, and did the finger print sensor, it would come up to hours wasted entering passcodes.", "Date": "November 3, 2013"}, {"Title": "Phone screen quality is bad", "Author": "Nitin", "ReviewID": "R31S578FE52YIT", "Overall": "1.0", "Content": "I got an Iphone 5s and broke its screen in just the first drop of the phone (I am extremely surprised that this happened and such is the flimsy quality of the phone). This never happened with other smartphones I have used.To my surprise none of the Apple stores do a screen replacement at the moment for 5s.Its funny that none of the support folks know that information. I had to find this the hard way out after spending several hours calling each of the stores and then the support.Its been 4 months apple launched the phone 5s and you guys tell me to shell 269$ to get a new phone. You guys will loose customers in this way. You have definitely lost me. I am not buying any apple product again. To me you guys are a rip off.", "Date": "February 1, 2014"}, {"Title": "this seller doesnt respect customers!!!!", "Author": "JOSE MARIA FIGUEIREDO LIMA NETO", "ReviewID": "R1Z2TULF84DVL", "Overall": "1.0", "Content": "this seller sold me a locked iphone 5 saying that was unlocked. i paid expesive price for a phone that doesnt work!! i want my noney back!!!", "Date": "January 10, 2014"}, {"Title": "LOW SPEAKER VOLUME,  WIFI and SENSOR ISSUES :  $360 to upgrade from Iphone 4", "Author": "Dwight", "ReviewID": "RW9XWRTXR9SXI", "Overall": "3.0", "Content": "ETA 5/11/2014:  Apple is now committed to pushing this into their affordable category.  The $99 deals abound not just for mother's day and store employees have been given this device in exchange for the last lowest commonn demoninator model - the ipod touch.***This phone is not as audible as the 4 for an unknown reason - it has to be on its maximum volume level and even then words are missed and you have to ask the caller to repeat themselves.The White/Silver version looks VERY Korean.  It's not slick and sophisticated in my opinion.  It evokes the spirit of a Samsung smartphone in white that has been shrunk down.  If this were the Iphone6, I would be much happier since a Samsung Galaxy Note 3 order was cancelled to get this phone but we felt we really needed an updated smartphone.  Hopefully, Apple devices will retain their resalability.We have laptops and rokus using wifi with no problem but the touch 4g always buffered after a few minutes and you would think that this latest and greatest would have as decent wifi as a $35 Roku LT but that is not the case.  Since I am not an Apple addict, I would return this phone and never touch another Apple device but I am not primary user of this brand's products so I try to do as much research as I can stomach to cushion the expected frustrations of signing on to own and participate in this artificial reality.The sensor issues seem to be due to a new supplier, Bosch, and that means ALL the new phones are affected and Apple is not known for doing a product recall.  The sensors are off by DIFFERENT degrees so it is not believable that any firmware or app will be able to offset the sensor - at best, they will embed software that will throw the sensors off in the opposite direction to minimize the amount it is off level.  SO LAME. I haven't pulled out a carpenter's level yet to test it but the ongoing revelations including a teardown of the phone indicate that Bosch screwed up and all 5s and 5c owners will be stuck with this because Apple never fixed antennagate on the iPhone 4.  They certainly never contacted owners of the 4 to offer them a free case as their idea of a \"fix\" for the antenna problem.It takes forever for the fingerprint sensor to identify your fingerprint so get comfortable before you press your finger on it because you can't lift it up until Apple is finished.SIRI is a toy - an elaborate Magic 8 Ball with more responses tuned in.  It is easier to voicedial on a dumbphone than to use Siri's primary purpose in life because ultimately, Siri is NOT AT ALL intelligent.  What Siri does do if you play around long enough to realize is RECORD YOUR VOICE and then repeat what you said in Siri's voice which means their software coded your voice and translated into Siri's voice - it does NOT mean that Susan Bennett happened to record the same words that you just spoke to Siri.  That in addition to the fingerprint sensor and the cameras mean this device can COPY you.Still, we are okay with upgrading to this phone.  There simply were too many things after two years that the Iphone 4 could not do like iBook.  We never updated the iOS 4 sparing us battery issues like the ones for the Touch 4G so this is how we think the Apple devices work - when you can afford to upgrade, pick the latest model even if an older version is free so you don't get locked out of new features like \"autofocus\" that only works with the 5s camera.Don't sell your old iphone for ninety bucks or whatever.  Keep it and don't order product protection so if the new phone gets destroyed or stolen before the two years are up, you have a cheaper backup than the monthly protection plan.When the next iphone after your version is iminent, upgrade your iOS and then never upgrade it again to spare yourself all the coincidental problems that make you want to upgrade to the latest and greatest that don't suffer all these handicaps after ugprading to the new iOS.Scour the repetitive articles and then turn off all the settings that drain the battery like auto app refresh.KNOW that Apple does not do product recalls and be careful with overcharging your nonremovable battery.  If not for Android updating and malware issues, we would have broken from Buying American (Chinese suicides) for the Samsung Galaxy Note 3.  Ultimately, we just didn't want to do too much work with a smartphone so we are still with Apple.  Apple customer service is not that great, not at all generous but if we have to have a smartphone which is driven by the media to be a keeping up with the Jones, it is better to be with the operating system that seems favored by app developers and yes, there is a cultural comfort level with dealing with an American brand.After our problems with the touch 64gb and Apple customer service being no help with the battery issue, we are loathe to max out storage for any Apple device with nonremovable memory and battery but 16gb fills up pretty easily so we are going with 32 gb.  The Iphone has not sold me on Mac computers which I have never owned and I think are overpriced and some kind of IDEA of computing that is not value for money though it may look and be easy to use.  As smartphones go however, Android is an unpreposessing name and so are their iterations especially \"jellybean\" - very offputting.  The fact that even if you don't mind not getting a timely OS update may still kill the apps you do have and that malware is an issue with the apps forcing some phones to get bricked is why we are not indulging in the tempting Samsung offerings.We don't trust Apple because of what we learned from the touch 4g battery issues but we don't trust nonApple brands more as a result of not trusting Apple.The issues with Gmail privacy have certainly cast suspicion on the integrity of what Google does including their Android OS.  Whatever happened to not being evil?If Microsoft had the breadth of apps and media products for sale (Android doesn't have the scope of the iTunes store) then I would consider a Windows phone but browsing the Android app store - no South Park episodes! - made me cancel the order for the Samsung Galaxy Note 3.  Hopefully, the resale market for Apple will still be healthy then - another difference from Android phones.CASE of choice:Tylt Energi Power Case for iPhone 5/5S - Retail Packaging - Black/Gray which is subtly shaped in a charming way and feels MUCH better than the rubbery grippy silicone cases so even if it did not provide the extended battery, I would still use this case BUT the lightning cables are no longer needed as it has a provided micro usb cable.CASES THAT BLOW:SPIGEN SGP SGP10088 Slim Armor Case for iPhone 5/5S - 1 Pack - Retail Packaging - Metal Slate has a too low ridge around the front offering little if any protection and it was too thick to allow the lightning cable from monster to charge the phone.  I am using the provided screen protector however.The very expensive Lifeproof iPhone 5 Case - 1 Pack - Retail Packaging - White And Gray covers the fingerprint sensor but shows the back of the phone so everyone know which color you got and they are coming out with a case for the 5s BUT I got the feeling it was scratching the sides of the phone when I tested it out.If Buying American, Choosing Apple versus Google's Motorola, REMEMBER The Pacific and know that if Apple falls, so might these suppliers:Japanese electronics makers appear incapable of making the world-winning products that they made a generation ago. Even credit agencies are not optimistic about their prospects. Sony's credit rating? Junk. Sharp? Junk. Panasonic? Junk.Research by Morikawa and Goto shows how in 2012 Japan's electronics giants were using Apple as a life support system.Some of the figures are staggering.At Sharp's Kameyama No. 1 factory near Osaka, 100 percent of liquid-crystal display panels were devoted to Apple. Of the camera sensors from Sony's Kumamoto factory, 50 percent were for the US company's devices. Half of the DRAM production at Elpida's Hiroshima factory: for Apple.", "Date": "October 11, 2013"}, {"Title": "Dislike about this product.", "Author": "Jose Roberto Losada ve212788", "ReviewID": "R51P7QZSZLYF3", "Overall": "1.0", "Content": "Hello, I am writing from Venezuela. I chose this rating because I asked for an iPhone 5S unlocked SIM Free. When I trying to prove a Venezuelan SIM says: incompatibility does not work, insert another SIM card from a support operator.Insert Sim card that is installed on this iPhone is an operator not permitted according to policy currently assigned by the activation server activation This iPhone brought a T-Mobile SIM.I would like to know how could we solve this error or something to unlocke this iPhone please.Iphone 5S, Space Gray, 16GBPart No. ME323LL/ASerial No. C39LH5QDFF9RICCID 8901260132538141950FIMEI/MEID 013885000475680", "Date": "January 19, 2014"}, {"Title": "It is ok for an iphone", "Author": "Carlos J Arce", "ReviewID": "R10L9Z0I235LLF", "Overall": "3.0", "Content": "Not a bad phone, not great though. It is quite alright. this is not the phone I wanted to buy.", "Date": "December 12, 2013"}, {"Title": "Nexus 5 is better than the iPhone", "Author": "hollywood bob", "ReviewID": "R1SGDZNIU8XEQL", "Overall": "3.0", "Content": "The only reason I have an iPhone 5s, really, is because I already have a Note 3 and I do appreciate Apple's FaceTime for vchatting with the rest of the clan. Outside of that you have to really be an Apple/iPhone fan to pick the iPhone 5s over the current Android offerings. With the Nexus 5 being so reasonably priced it will be quite the popular choice.", "Date": "November 10, 2013"}, {"Title": "iPhone is overrated", "Author": "Nezar Bashir", "ReviewID": "R1K8C51WF48MNV", "Overall": "3.0", "Content": "I received the product as advertised, new & nicely packed.It took 22 days to reach me (Middle East) but that was expected.They only thing is the iPhone itself, an overrated product.I used it for 3 days then sold it out!", "Date": "November 4, 2013"}, {"Title": "Iphone", "Author": "MONICA SANCHEZ C", "ReviewID": "R1FWHXQN3NCVF3", "Overall": "5.0", "Content": "Beautifully phone it is one of the best phone I ever had the touch I'd awesome can't believe this phone was really good", "Date": "October 9, 2013"}, {"Title": "You need coarctation", "Author": "Hormoz K.", "ReviewID": "RW32GWFDRL0GG", "Overall": "1.0", "Content": "Please make coarctation on you fill and update system, I did ordered iPhone 5s in two deferent date first one was canceld by seller in same day of order I find out day after du date I tracked the order then I find out same thing in second order, and I had hard time to gat credit from Amozon and reviving email from Amozom to fill up forms and wait be on there merci, but after all I but my iPhone 5s 32GB unlocked from Apple store inculoding sales Tax $103 las than Amazon.com", "Date": "February 15, 2014"}, {"Title": "\"DON:T BUY\"!!", "Author": "George A. Vanicek", "ReviewID": "REXYSNVELPK5F", "Overall": "1.0", "Content": "SAVE your money and  you won't have to deal the  AGRIVATION this product imposes on folks,  just read the  reviews. the ones not written by apple employees tell the truth they're all negative.", "Date": "February 1, 2014"}, {"Title": "Overpriced mediocre phone", "Author": "J. Limandri", "ReviewID": "R981SY2VWQX0Q", "Overall": "1.0", "Content": "I was due for an upgrade on Verizon So I got the iphone 5s.  I was not impressed at all.  The phone feels outdated and so does the software.  Its very limited.  You can't change your default browser or email programs...etc  So if you don't like the one apple has made its too bad.  The display is surprisingly good for how small it is.  But after a few days i decided to sell it out of frustration.  I sold it and bought the moto x.  I am very happy now.  The moto x is only a little larger than the iphone but has a much larger display.", "Date": "October 29, 2013"}, {"Title": "I did not come to my order and did not return the money, and not vidpysuyut my message. Bring me my money has gone a very long t", "Author": "Igor", "ReviewID": "R756OWD3LA1WO", "Overall": "1.0", "Content": "I did not come to my order and did not return the money, and not vidpysuyut my message. Bring me my money has gone a very long time.", "Date": "January 11, 2014"}, {"Title": "Bad phone", "Author": "Jacob Kennedy", "ReviewID": "R3KPF41TNLGV1Y", "Overall": "1.0", "Content": "Save money, get a galaxy s4, this phone is so overpriced, and it broke on the first fall. I now have a gs4, so much better", "Date": "January 18, 2014"}, {"Title": "Would rather buy 2 laptops or 4 tablets for the same price.", "Author": "Captain Jack", "ReviewID": "R3V15DX3O96TFW", "Overall": "1.0", "Content": "$860 for a phone. I think this is a joke. Absolutely no new feature after Siri. Yes a faster processor, but I guess that was needed as the new OS is soo slow on older iphones anyway. I guess this was intentional so that customers are forced to upgrade from a slower experience that they get in their iphone 4,4S and 5.I would rather buy an unlocked S4 and Kindle HDX (or a nokia lumia 1020 and surface 2) for the same price depending on whether I want an android or a windows experience.", "Date": "October 22, 2013"}, {"Title": "The headphone jack placement ruins this phone", "Author": "Amazon Customer", "ReviewID": "R32GPCGZB5QQ45", "Overall": "1.0", "Content": "I am giving the iPhone 5s one star for one reason only: the headphone jack on the bottom of the phone.  Apparently a lot of people like this feature.  But a lot of people also like \"2 and a Half Men\" and CSI.  My point is, a lot of people are idiots.Seriously, this phone makes me irrationally angry each and every time I try to use headphones with it.  If I am working out, I have to set the phone upside down on the machine as I run.  If the phone is in my pocket, I am constantly flipping it over every time I take it out of my pocket.  That is annoying in and of itself, but it also causes the headphone cord to get tangled and shorten when I put it back into my pocket.  Also, it makes it difficult to work on the phone while listening to my headphones.  The cord sticking out from the bottom prevents me from using my pinky to stabilize the phone in my hand.  I almost never dropped my iPhone 4s in over two years that I had it.  I drop the iPhone 5s once a week because it won't let me hold it securely.I realize I should not care this much about a headphone jack.  Maybe some people get used to it.  But that is like getting used to the smell of a dead animal in your house.  The feature sucks and it makes the entire phone suck.  I would not buy an iPhone 5s if I had it to do over again.", "Date": "January 18, 2014"}, {"Title": "Rip-Off", "Author": "EJ A.", "ReviewID": "R1SH8FZM8OZ325", "Overall": "1.0", "Content": "On the apple web, you can get one of these for $199 - $399. You can also customize it for free. Space gray, gold, silver. Those are the colors.", "Date": "January 12, 2014"}, {"Title": "ooooo a new shiney button.....YAWN!", "Author": "Deimos \".\"", "ReviewID": "R20DP5G7MC7FMS", "Overall": "1.0", "Content": "So other than a .5\" larger bordered screen, shiney button (minus the little white square such innovation) and a new 9 pin connector there is nothing new here. Same old boring IOS, the same issues that plagued as far back as the 3gs (for me) such as getting locked in headphone mode, freezing/crashing apps, losing service for no reason and having to reboot the Iphone to get it back, being way to delicate if dropped or hit, way over priced, and the simple fact that are much better smartphones out there namly Windows Phone and Android. I have seen and personally did speed tests on browsing, boot up times and app lauching and Windows Phone 7/8/920 and Android beat this device hands down everytime in all catagories. They say Apple could sell a turd wrapped in tin foil with an Apple logo on it.....well this is that latest turd. There is no reason to buy this recycled iphone as there will be another one out in less than a year, possibly the usual Iphone 6/6s/6se/6LT/Iphone 6 Turbo/Super Iphone 6 turbo....and all makes and models will be the exact same over priced phone lol. Wake up people, go with whats best for you, not whats popular this week.  Apple is obviously out of gas, this piece of garbage can't do anything more than the one you have now and is nothing more than a self indulgent shiney piece of over priced junk.", "Date": "October 24, 2013"}, {"Title": "This phone is not what it seems to be", "Author": "Randy Collado", "ReviewID": "R1N9E8FZKB3F6T", "Overall": "1.0", "Content": "I've had the iPhone since the first one came out. It was a very good product, and it was one of the best phones that I've ever had. However, this iPhone is A PIECE OF S***. The 3GS was great, and the 4S was better than the last, but the 5S was utter trash. If I were you, I would go with the Samsung Galaxy S4. It's a better buy, and it comes with better features", "Date": "January 27, 2014"}], "ProductInfo": {"Price": "$1,500.00", "Features": "4-inch Retina display\nA7 chip with M7 motion coprocessor\nTouch ID fingerprint sensor\nNew 8MP iSight camera with True Tone flash and 1080p HD video recording\nUnlocked cell phones are compatible with GSM carriers like AT&T; and T-Mobile as well as with GSM SIM cards (e.g. H20 and select prepaid carriers). Unlocked cell phones will not work with CDMA Carriers like Sprint, Verizon, Boost or Virgin.", "Name": "Apple iPhone 5s 32GB (Silver) - Unlocked", "ImgURL": "http://ecx.images-amazon.com/images/I/51k0rD7-BzL._SY300_.jpg", "ProductID": "B00F3J4RIE"}}