{"Reviews": [{"Title": "Technical review", "Author": "None", "ReviewID": "R3108LAJGCO7T", "Overall": "5.0", "Content": "____2 month update (5-19-14) at the end of this review.____Pay attention as Sony makes several versions, C6833, C6806, C6802 etc.  Sony also makes the Z Ultra in three colors, black, white and purple.C6833 and C6806 have DIFFERENT LTE bands while C6802 has NO LTE bands. Shop accordingly.The USA Sony Store sells model C6806LTE for $449 and C6802 for $429 (as of 5/19/14) fully factory unlocked and with full Sony backed USA warranties.  USA Sony Store does not sell C6833.*note*  read comments section for update on warranty coverage. Thanks to OhCanada for his efforts with Sony Xperia Customer Service.I posted a size comparison photo that can be viewed under customer photos on the right --->And yes, i own all the phones shown in the photo :)____USA major carriers use the following frequenciesAT&T; 4G LTE:700MHz (band 12, 17) ~MOST WIDELY USED~850MHz (band 5)1700MHz and 2100MHz (band 4)VERIZON 4G LTE:750MHz (band 13) ~MOST WIDELY USED~1700MHz and 2100MHz (band 4)T-MOBILE 4G LTE:1700MHz and 2100MHz (band 4) ~MOST WIDELY USED~700MHz is being implemented by T-MobileSPRINT 4G LTE:800MHz (band 26)1900MHz (band 2, 25)2500MHz (band 41) ~MOST WIDELY USED~____Canada major carriers use the following frequencies:TELUS (including Koodo)2G CDMA 850/1900 EVDO 850/1900 3G HSDPA 850/1900 HSPA+ 850/1900 UMTS 850/1900 WCDMA 850/1900 1x EV-DO CDMA2000 4G (called 4G+) LTE 1700/2100BELL (including Virgin Mobile, PC Mobility)2G CDMA 850/1900 EVDO 850/1900 3G HSDPA 850/1900 HSPA+ 850/1900 UMTS 850/1900 WCDMA 850/1900 1x EV-DO CDMA2000 4G LTE 1700ROGERS (including Fido, Petro-Canada Mobility)2G GSM 850/1900 GPRS 850/1900 EDGE 850/1900 3G HSDPA 850/1900 HSPA+ 850/1900 UMTS 850/1900 WCDMA 850/1900 4G LTE 1700____If having LTE is important to you than make sure the device supports ALL bands with your provider as they switch them up based on regions and terrain.  In short only having one band supported doesn't guarantee you will get LTE all the time or even any LTE service based on where you live.Match up the LTE bands I list above for your provider with the bands I list below for the given models.____Another important consideration is GSM VS CDMA. What does your carrier use?Verizon, Sprint and US Cellular (Telus, Bell for Cananda), use CDMA technology while AT&T; and T-Mobile (Rogers for Canada), use GSM.  CDMA (Code Division Multiple Access) and GSM (Global System for Mobiles).  These technologies don't cross over; however manufactures today want to make multiple platform devices so if you have a device made in the last year on your CDMA carrier chances are it already has the GSM radios in it.  BUT- many manufactures still make GSM only phones that will not have the CDMA radios and will NOT work for Sprint, Verizon or U.S. Cellular.A good example of a crossover phone is the iPhone 5/5c/5s and LG G2.  They have built in every technology for just about every service worldwide and can easily go from Verizon to AT&T; and others without issues.Unless the phone has CDMA EVDO radios you will not be able to use it on Verizon, Sprint or other CDMA carriers effectively.The Short Version is the Sony Xperia Z Ultra is GSM ONLY.____The last thing to make sure of before purchasing is whether or not your Carrier has BLACK LISTED the phone.  Just because a phone is `unlocked' does not mean it will automatically work.  It could still be region locked by country.  Why would a carrier black list a phone you ask?  In rare cases the phone is not new (when purchased from unknown sources), but most often it has to do with contractual agreements between the manufacturer and the carrier to only allow certain models on their network, Remember when the iPhone could only be had thru AT&T;?  Other times it might have to do with law suits or differences of opinions between the companies.  A good example of this currently is Verizon black listing the Nexus 5 from their service.  While this phone is fully capable of functioning on Verizon network, Verizon will immediately shut it down when detected.  That is until Google and Verizon iron out their differences with Nexus products.____Here are the specs for the Sony Xperia Z Ultra:____2G/3G CDMA EVDO: Not supported2G: GSM 850 / 900 / 1800 / 19003G: HSDPA 850 / 900 / 1700 / 1900 / 21004G: Model C6833 ONLY -- LTE 800 / 850 / 900 / 1700 / 1800 / 1900 / 2100 / 26004G: Model C6806 ONLY -- LTE 700 / 850 / 900/ 1700 / 1900 / 2100 / 26004G: Model C6802 No LTEDemensions: 179.4 x 92.2 x 6.5 mm (7.06 x 3.63 x 0.26 in) ~Slightly smaller than a Nexus 7 2013 edition FHD tablet~Body: Full metal alloy frame with Corning Gorilla glass 3 front & back.Certification: IP58 certified - dust and water proof - Water resistant over 1 meter (5 feet).Display: 1080 x 1920 pixels, 6.4 inches (~344 ppi pixel density) - Triluminos display - X-Reality Engine.  Currently (April-2014) the largest consumer phone.OS: Android v4.2 (Jelly Bean), upgradable to v4.4.2 (KitKat)32bitStorage: 16GB, (11.8GB user available)Expanded Storage: microSD up to 64GBRAM: 2GB LPDDR3 1833MHz dual channelCPU: Qualcomm MSM8974 Snapdragon 800 Quad-core 2.2 GHz Krait 400GPU: Adreno 330 @ 450MHz speed burst to 550MHz 1GB VRAMBattery:  3050mAh non removable.  See below to learn about expected battery usage times.Camera Rear: 8 MP, 3264 x 2448 pixels, autofocus, (no flash). 1080p@30fps, video stabilization, HDR. Geo-tagging, touch focus, face detection, image stabilization, HDR, sweep panorama.Camera Front: 2 MP, 1080p@30fps____Side Bar: unplugged. 130 hours.____Average battery life between charges before changes was about 8-10 hours, now its 75-130 hours.Go to settings > applications > All. Disable the Services and Apps you don't use or need.I have switched off 82 applications and services without effecting anything I do with my phone.Next toggle WiFi, Cellular DATA and Location Services (GPS) off and only turn it on when in need and then back off when you are done. This will keep the radios from constantly searching when in sleep mode and also stop all the apps on the phone from pushing data until you tell them too.Turn your screen brightness to the minimum you can while still being able to read it. Often I can set mine to zero and still see it fine.With these settings I have never gone less than 3 days, (72 hours), and often go over 5 days (130 hours) before having to plug into a wall socket.When I need to download apps I will go into settings and applications and switch on the Google Play Store, Sign In and then when done disable again.If I need Location Services such as Maps I turn on DATA and GPS, use the services and then turn them back off.____UPDATE 5/19/2014:I wanted to report after living with the Sony Xperia Z Ultra for a couple months.My background:I am not on a contract plan and because of work both me and my wife have T-Mobile and AT&T; providers.  We rotate handsets about every 6 months. Between the two of us and both services we go thru about 4 devices a year, (by choice).  My wife prefers smaller handsets while I like large ones.  In a nutshell I have had tons of experience with different devices and have had to learn a lot about these things.  I am an owner of every phone in the photo i uploaded to Amazon for size comparison.  This Includes the Z Ultra, the Z1, the G2, the Nexus 5 and the Note 3.My usage:I depend on my phone for everything, its my lifeline.  I would say its in my hand more than its not, but it does make the trip to my pocket many times a day.  It also mounts on a magnetic mount in the car for use such as GPS, music, texting (by voice command), and searching the web, (while stationary of course).Z Ultra Accessories:The Z Ultra is on the verge of being too big.  What I mean is going from pocket to hand over and over takes a risk of dropping it, and I cant sit down with the phone in my front pocket so have to remove it every time I sit.  It most certainly requires both hands to manipulate.  There just isn't many choices as far as protective cases go.  I have used folio cases and TPU cases.  Folio cases end up getting in my way and TPU cases don't protect the screen so I have settled on a TPU case with a 9H tempered glass screen protector.  I have also experimented with the Sony SW2 watch and the Sony SBH-52 bluetooth headset, and concluded neither added ease of use with the Z Ultra.  The SW2 requires the phone to receive and make calls and answer text messages so I still had to pull out the phone often. Then SW2 was hit and cracked in the first week and the SBH-52 became tiresome after 8 hours of tangled wires and clipping it on/off my collar for the mic usage.  I am not saying the SW2 or the SBH-52 aren't great devices and may serve your needs to a T, just not mine.Hardware:The mechanics of the phone are awesome and the large screen while not as bright as many others I have had is still a pleasure to view and use.  Being able to adjust the white balance is a great feature.  I love the waterproofness of the phone and have rinsed it off under the faucet many times.  The quick magnetic charge port is a great idea (but they need to learn from Apple to make it more effective).  Their is flex in the phone having only a thin metal/plastic frame sandwiched between two pieces of glass but it hasn't caused any issues yet, although I am concerned that flexing while in my pocket will eventually crack or break some solders inside.  The operation of the phone has been a dream and I have no complaints except for the camera.  I don't care about the oversight of a flash unit but the photos have been really sucky, no where near the quality of any other phone I have used including the lower pixel count phones.  Which is a shame because Sony makes phenomenal cameras and in fact the best phone camera i have used to date is on the Samsung Galaxy Note 3 which is made by Sony.  I simply quit using the camera on this phone.Buy Again:I will not go back to this phone when I am done with it, not even if Sony updates it, here is why.  For a man that has to carry this thing in a pants pocket or coat pocket is just not quite economical.  If the 6.4 inch screen had zero frame all the way around, then maybe it would be easier to handle on a daily basis.I think for a daily driver phone that is handled all day long for work or pleasure a 5.5 inch screen with a very thin bezel is the max size to handle regularly.  Even the SGN3 by the time you add your Otterbox Defender case is too big.  The New LG G3 looks to be this phone and I will try that one next.Don't get me wrong, I love the Sony Xperia Z Ultra, its just not a daily driver for someone that has to take it from pocket to hand a hundred times a day.It definitely is one of my top 10 phonesHere is how the Z Ultra can improve:> better rear camera> better magnetic dock with Data capabilities> Stronger frame with zero flex> brighter screen> thinner bezel top and bottom> better sound from internal speakers> bigger battery (has same size battery as its baby brother the Z1)> better integration with sony branded accessories i.e. sw2, playstation, TV's____Peace.____", "Date": "April 4, 2014"}, {"Title": "Great", "Author": "Paul", "ReviewID": "R134NI38AT1WWT", "Overall": "5.0", "Content": "I enjoy the phone, it's fast and the screen is huge and vibrant. I'm using T-Mobile and the 4G LTE works fine. I have to use two hands to use the phone and keep it in my back pocket in the Incipio Watson folio wallet case. It's not as easy to pull out and check the time as with my original RAZR Maxx; I had it on a belt clip. I wanted a huge screen and a phablet that not many people have; lots of people have the note 2 and note 3. Definitely check out some YouTube reviews for the phone because it's not just a bigger version of the smaller Xperia z, they are two different phones.", "Date": "December 14, 2013"}, {"Title": "More \"Ablet\" than \"Ph\". Recommended For Media Junkies", "Author": "Amazon Customer", "ReviewID": "R3AAUS2ZP9VTRE", "Overall": "5.0", "Content": "OverviewI've had the Sony Xperia Z Ultra for over a week now and I can't stop but be impressed by the gorgeous screen and just how absurdly massive it is. At first you won't believe just how thin it is despite its size. Its practicality becomes questioned immediately after holding it in your hands for the first time and you wonder if you made the right choice buying it. Of course with most things, as time passes you'll start to grow fond of its hefty girth. Its charming design and elegant screen becomes translucent to the fact that it is too big to hold. If by now you haven't noticed, for the rest of my review you'll probably be hearing a lot of words that have to do with it being big and beautiful.DesignI haven't had the pleasure of owning any other Sony handset so this is my first impression of the design language in question. The handset sets standards to what a \"premium\" phone should be. I have just upgraded from the Samsung Galaxy Note (N7000) and have also dealt with a number of Samsung devices and honestly, it is refreshing to have something in my hands that isn't made out of poly-something-plastic. I am not going to goad on Sammy's devices, but Sony nails the design with the Z Ultra. The power and unlock button located on the right side is big and prominent and easy to feel out when you're not paying attention. The volume rocker unfortunately sits directly below it promptly accidental locking of the phone, it'll take some getting used to. The glass back and huge screen induces paranoia of you dropping it and shattering into pieces so you'll end up gasping for dear life whenever you bump into something. The water resistant design incorporated into the chassis gives it a complete look unhindered by port holes. The ports are enclosed by flaps that protect it from the elements which is a really neat feature if you plan on going all-terrain with an expensive fragile phone. I won't go into the screen size that pretty much covers the entire front because I'm pretty sure I'd said enough at the beginning. The screen is gorgeous (I've run out of adjective to describe this phone's beauty). Viewing angles are wide and color saturation is minimal, but present. It is a 1080p resolution so watching movies at anything less would be unpleasant because of the noticeable pixilation. Higher resolution however is a joy to watch, which goes without saying.User InterfaceAs I have already stated, I have been a long time Samsung owner and for a brief time, have owned the HTC Sensation and in my opinion, Sense is the best Android overlay. I have not had any experience with Sony's User Interface. My first impression with it is, very minimal in design and features. Sony was probably not going for any thing drastic, but that UI becomes intuitive and straight to the point without any of the gimmicky things other OEM's have stuck into their UIs. I like the fact that the homescreen allows for resizable widgets for both stock widgets and others downloaded from the Play Store (ie. Beautiful Widgets) allowing for easy homescreen filling. The app drawer is your usual run-of-mill affair except for the organizing tab found when you swipe all the way to the left. The drop down notification shade allows the user to customize quick setting toggles which makes it easier to toggle the things most important to you. One other thing worth noting that for some odd reason other OEM tends to omit from their devices is the battery percentage.PerformanceOut of the box you get the Snapdragon 800 processor and yada yada, I'm not going to waste time talking about specs. This is my real-world experience with the handset. It is fast and when I said fast, this thing is fast. Regular tasks such as swiping on the homescreen or opening apps responds accordingly and without a hitch. Graphic intensive games such as NOVA 3 play just fine without any stutter. However, prolonged playing results in overheating. Not sure if the game is too much for the phone to handle or it might be some defect. I've played Grand Theft Auto: San Andreas on max settings and Modern Combat 4 to test its capability and I am impressed. This thing is a beast. I did notice slight overheating for both games as well, but it is to be expected.The battery is rated at 3050mah, which according to most reviews I've watched and read should last almost the entire day with moderate to heavy usage. However I have yet to simulate the same results. On average if I kept it off the charger with heavy web surfing I'd say it'll last about 5 hours. I still find myself keeping a charger in my bag. Stamina mode is exactly what the name implies; it boosts your phone's battery life. However it does this by turning off all radios when you lock your device. It'll automatically reactivate them upon unlocking of your device.ConclusionThere's not much else to say about this device that I haven't said already. It is a monster of a phone both for its size and specs. It is for those who are looking for a device that is more tablet than phone, which is exactly why I bought it. If you are tired of lugging a 7inch table everywhere and a phone than look no further than Sony Xperia Z Ultra. It is a device that is sure to turn heads and drop jaws. It is a powerhouse and a media-centric device that is sure to fill that void.Update 3/13/13I noticed that the screen is prone to greasy smudges from the oil from your fingers. It is hard to wipe off with just a rag or paper towel, I find myself having to wash it with water and wiping it down. Also found that the problems other reviewers have with the screen glitching stems from the smudges left on the screen.", "Date": "February 22, 2014"}, {"Title": "Absolutely perfect!", "Author": "AndyG", "ReviewID": "R3CLEZ6ZOU5Y22", "Overall": "5.0", "Content": "After having the note 1 for years I wanted/needed something new. My area is saturated with note 3's and S4's, it made me want something different. I've been keeping up with the Z ultra for quite awhile but was skeptical on the screen size. I finally broke down and ordered this phone. Let me tell you, this thing is a beast! It's so sleek and thin, I love this thing. Screen size is huge but I'm kind of used to it since I already had the note. It's so fast, everything loads in no time. Android is so fluid and works so well. I don't have to worry about this phone messing up around water since it's completely waterproof too! I'm not a big picture taker so having no flash wasn't a big deal to me. The picture quality is great either way. This phone definitely attracts attention if you use it in public, it's almost guaranteed. I have at&t; and the 4G works great! The battery life could be better but it still lasts all day for me. I'm extremely happy with my purchase and I'm sure anyone will be, who are out to find themselves a phablet, too. If you are on the fence about buying this phone, just go ahead do it. You won't be disappointed, I promise!", "Date": "December 19, 2013"}, {"Title": "Best phone I have owned. But...", "Author": "Kevin W. Willis", "ReviewID": "R1V5I7L9R539F8", "Overall": "4.0", "Content": "It is awesome, but it is missing some standard features and needs improvements including:FlashLoud speaker is oddButton placementCamera quality is lowOtherwise, its the best phone I have ever owned. I have owned many of the top phones.", "Date": "March 5, 2014"}, {"Title": "Nice phone......I am happy  with it.", "Author": "Amazon Customer", "ReviewID": "R1LWZGCRL8Z172", "Overall": "5.0", "Content": "Let's face it, I bought this phone for the 6.4 display and I wasn't disappointed. It is fast,thin, light and in an entirely different catagory.  I have a Samsung note 2 which I love but this fills a spot no other phone can. It is International and works great in China and has 4g in the USA. It serves as a tablet and a phone if you want to travel light.", "Date": "May 22, 2014"}, {"Title": "Poor Battery Life", "Author": "PC", "ReviewID": "R3GY7SLHUORFKU", "Overall": "2.0", "Content": "I do not know why people say this cell phone has a good battery life as this is not true. If I watch a movie and use the phone constantly the battery life is far below par.", "Date": "May 20, 2014"}, {"Title": "sony xperia z ultra the best", "Author": "philliplewis", "ReviewID": "R2SDIHATP0DYNK", "Overall": "5.0", "Content": "This phone has a beautiful screen and a pretty Nice camera and that snapdragon 800 is so fast I love it I wish the speaker was louder but I already knew Wat i was gettin but anyways this a great phone and oh I forgot about the beautiful build quality one of the best I've seen in a while", "Date": "April 28, 2014"}, {"Title": "BEST PHONE EVER FOR THE PRICE", "Author": "Alex Gutierrez", "ReviewID": "R2W97Y0DQA1U19", "Overall": "5.0", "Content": "This is possibly the best phone you could buy for the price. LTE on AT&T; works in some areas that's a drawback and no flash either but c'mon the phone is a beast in person and beautiful.", "Date": "April 13, 2014"}, {"Title": "Updated - I need help from Amazon and Justbuydealstoday!", "Author": "Duc Phan", "ReviewID": "R1SNPDNDKL9X2Z", "Overall": "4.0", "Content": "Hi Amazon and Justbuydealstoday!Thanks for clearing up all issues we've been thru.I don't know how but your responds were very quick and helpful(both Amazon and Justbuydealstoday). I received promtly update status and got final email said that refund from Amazon back to my credit card(I thought I can exchange another one :).This is very good customer service from you, not leaving customer behind once sold products.I will continues shopping at Amazon and I give 4 stars for Customer service Not for defected product.Thank you! 5/19/2014Dear Amazon and Justbuydealstoday,My wife likes this phone because large size, lightweight and it's from Sony, a brand that we trusted for years.Today when I received the phone, before open I felt something wrong with this this box. The IMEI label from the case was scratched off or removed by(???)When picking up the box, I heard sound from parts(kind of rolling inside-this is not right).Opened, the gray plastic that holding the phone has a lot of finger prints on it(I bet it's not packaged that way at Sony)Ok, now there is NO USB CHARGING CABLE(How do I charge my phone??)This is special cable from Sony I think, by looking at the plug on the phone.One more thing, the AC plug is NOT FIT my standard AC outlet(too big and weird size)Well, we have a small fight(my wife and I, sorry to mention here). She told me before that we should order this expensive phone from SONY. I told her I ordered many things from years with Amazon and I have no issues, well...now is one)Sent replacement request and still waiting to hear from Amazon and Justbuydealstoday. I hope they will send me a fresh, brand new, unopened, original packaging from their warehouse.I haven't have a chance to use the phone yet(NO charging cable and AC plug is wrong size too-nothing can do at this time).Will update later once these issues are cleared.Thank you! 5/16/2014", "Date": "May 16, 2014"}, {"Title": "Great huge and convenient", "Author": "Mahamet", "ReviewID": "R2ZADFJQM9R7FY", "Overall": "5.0", "Content": "A little bigger than expected but I like the phone its light and fits in my pockets I bought it with the smartwatch 2 and don't regret it", "Date": "April 14, 2014"}, {"Title": "Sony's best kept secret!", "Author": "Tashawna Ellis", "ReviewID": "R1QOGZ774UI6V3", "Overall": "5.0", "Content": "This is exactly what I was looking for. I wanted a tablet but also needed a new phone and I didn't want to look like everyone else w/ a Note or a Mega. So I dared to be differnt and give this beast a try... I received my case first which startled me b/c it was massive. But once I received the phone and held it for the first time I was throughly impressed. The screen is huge and vibrant w/ color, not overly saturated like Samsung phones. It's the perfect device for HD movies, games and Internet browsing. Very fast and efficient no matter how many apps are running. Light weight and very comfortable to hold (w/ two hands). The Best phone I've ever used (and Ive used them all, including the Note 3)", "Date": "March 14, 2014"}, {"Title": "Excellent device but the battery life could be better", "Author": "Victor Hernandez", "ReviewID": "R3RD1AK97OC55U", "Overall": "5.0", "Content": "The device itself is great, however unless you are very aware of your battery usage it will die way too fast.", "Date": "May 7, 2014"}, {"Title": "like it", "Author": "Richard Marfisi", "ReviewID": "R1ZPF8079LPRT4", "Overall": "4.0", "Content": "the product its nice and atractive... my problem with this is when i take out the slot cover from the simcard part and try to put in again the part is not stay in and for some reason it came out again... after that the sony xperia z ultra beaging to act like crazy, vibrate, moves apps a total mess....", "Date": "February 10, 2014"}, {"Title": "great phablet!", "Author": "danny", "ReviewID": "R1SMIPC0SNTO29", "Overall": "5.0", "Content": "The product is great! great design, performance, image quality, and waterproof!! this is the best phablet by farConsider the size before buying, this product will suit very well to executive people.", "Date": "February 9, 2014"}, {"Title": "Amazing Amazing Amazing!", "Author": "Sam", "ReviewID": "R22ZXNRFSDC1Q7", "Overall": "5.0", "Content": "Love every bit of it, I am using my iPhone 5s as my main phone but this thing I can't stop resisting the colorful display and responsiveness of the operating system. I had bad memories when it comes to android but not anymore, it was so slow with previous generating Sony phones.  With the external SD card, I can add my movies and tv shows with just a drag and drop from my computer :DAnd again I will say the display is outstanding! Making this phone so vibrant in its colors and interface.total 5 stars for Sony", "Date": "January 25, 2014"}, {"Title": "No internet on ROAD !!!", "Author": "VjL", "ReviewID": "R3B98LPA6M3X9Y", "Overall": "1.0", "Content": "Not working on 2g,3g,4g, lte. No data ! Good for wifi, call, text. They sent a unsealed box and ask for a factory seal for return !!!", "Date": "March 26, 2014"}, {"Title": "sloppy packaging", "Author": "christian", "ReviewID": "R4WFKHI48HJW2", "Overall": "3.0", "Content": "Yes. I love this phone!!.. Ok, and now for the disappointment: Only reason I give 3 stars and not full 5 is because when I received the phone ,(package dropped at doorstep in a open-unsecured area, and not hand delivered and signed to resident like it should have been been done with any expensive item  ) when i got home i saw the delivery package by doorstep and it looked like it was packaged inproperly because the package was open!!When I proceeded to open the package and pull out the phone box it as well looked like it has been open because the security tabs been removed from the phone box. I quickly looked at the manual to see what the phone includes and what it could be missing, and by my surprise the Sony ear buds was missing..Don't know if the company attentionally removed the item or stolen during delivery, but all I know is that I received an open package at my doorstep.", "Date": "April 8, 2014"}, {"Title": "NOT WORTH THE PRICE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "Fasih Siddiqui", "ReviewID": "R2XTY5SSMQ0U6V", "Overall": "1.0", "Content": "-Sony says you can write with any pen or pencil but you CANNOT. Sony lied, you can only write with an HP pencil. Led pencil, pens (ballpoint, fineliner) DO NOT WORK.-The camera is DISGUSTING. My brother note 2 camera (8MP) is much more clear and vivid then this phones 8MP camera.Don't be fooled and think the that nice appearance of the phone means it is also nice from the inside.", "Date": "April 20, 2014"}], "ProductInfo": {"Price": "$415.00", "Features": "Sony Xperia Z Ultra C6833 Factory Unlocked International Version No Warranty LTE LTE 800 / 850 / 900 / 1700 / 1800 / 1900 / 2100 / 2600 3G 850/1900/1700/900/2100 White", "Name": "Sony Xperia Z Ultra C6833 Factory Unlocked International Version No Warranty LTE LTE 800 / 850 / 900 / 1700 / 1800 / 1900 / 2100 / 2600 3G 850/1900/1700/900/2100 White", "ImgURL": "http://ecx.images-amazon.com/images/I/41VoKEKMfdL._SX300_.jpg", "ProductID": "B00F7HH7N4"}}