{"Reviews": [{"Title": "Terrific $49 Smartphone LOCKED To MetroPcs Network", "Author": "Alan  Houston", "ReviewID": "RRVWRC4BLCH75", "Overall": "4.0", "Content": "The Nokia Lumia 521 is a great basic smartphone at its low $49 price at MetroPcs stores. This version of the Lumia 521 is LOCKED to MetroPCS so carefully verify the quality of Metro's signal in your neighborhood using the coverage map on the MetroPcs website BEFORE you buy a MetroPcs phone.  Live in Venezuela, Dubai or Colombia?  This is a LOCKED phone for people living in the USA who have a MetroPcs prepaid phone plan.The Lumia 521 uses Windows 8, NOT Android.  Window 8 provides an easy to use introduction to smartphones for people upgrading from a basic dumb phone.  The Lumia 521 and Windows 8 make it easy to make phone calls, send text messages and check email. The 521 is NOT for the folks who think they need 5,000 apps, or who play 3D action games, nor can it substitute for an expensive camera.  People who are in love with the apps on their current Android phone or their Apple iPhone will be frustrated not finding their favorite app in the Windows App Store.The camera take adequate photos in bright sunlight, but it has no flash for indoor photos. The rear speaker is loud but is designed for use as a speakerphone and it is mediocre for playing music.Extra batteries are available for very low prices. Take two or three extra batteries on a camping trip and go the whole weekend without needing to charge your phone.  MetroPCS is now part of T-Mobile and the Lumia 521 uses the T-Mobile GSM and HSPA network which provides 4G data speeds in most large cities.The Lumia 521 does NOT have 4G LTE, but its 4G HSPA is fast enough to stream Pandora Radio or stream Netflix if you are in a strong 4G signal area.  Again, check the coverage map at the MetroPcs website to verify that 4G coverage is available where you live and work.The MetroPCS monthly plans are the least expensive unlimited plans in America. The plans include ALL taxes and fees. The $40 unlimited plan IS $40 period. Never any surprise penalty charges because you talked with your mom in Wyoming for three hours on Mother's Day or listen to Pandora Radio ten hours a day.", "Date": "November 8, 2013"}, {"Title": "Feature Packed Smartphone from Nokia", "Author": "Always Samsung \"ravereviews\"", "ReviewID": "RFCF2KJSQXF5C", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moV04SOTSUZ7GQembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moV04SOTSUZ7GQrefresh_preplay() {\n\ndocument.getElementById(\"cv_moV04SOTSUZ7GQchiDiv\").innerHTML = document.getElementById(\"cv_moV04SOTSUZ7GQhiddenPre\").innerHTML;\n};\ncv_moV04SOTSUZ7GQrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moV04SOTSUZ7GQso;\t   \n\n\nfunction cv_moV04SOTSUZ7GQloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moV04SOTSUZ7GQso = new SWFObject(swfLocation, \"cv_moV04SOTSUZ7GQAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moV04SOTSUZ7GQso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moV04SOTSUZ7GQso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moV04SOTSUZ7GQso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moV04SOTSUZ7GQso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moV04SOTSUZ7GQso.setAttribute(\"height\", swfHeight);\n          cv_moV04SOTSUZ7GQso.setAttribute(\"width\", swfWidth);\n          cv_moV04SOTSUZ7GQso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moV04SOTSUZ7GQso.write(\"cv_moV04SOTSUZ7GQflashcontent\")) {\n          fp_resizePlayerSpace('cv_moV04SOTSUZ7GQ', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moV04SOTSUZ7GQ';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moV04SOTSUZ7GQ', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moV04SOTSUZ7GQloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moV04SOTSUZ7GQ\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m18AZ53OM1ZZJI\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m18AZ53OM1ZZJI\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RFCF2KJSQXF5C\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m18AZ53OM1ZZJI/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moV04SOTSUZ7GQduration')) {\n      document.getElementById('cv_moV04SOTSUZ7GQduration').style.display='none';\n    }\n    cv_moV04SOTSUZ7GQloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moV04SOTSUZ7GQloadSwf(movieID, playerVersion) {\n   return _cv_moV04SOTSUZ7GQloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moV04SOTSUZ7GQnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moV04SOTSUZ7GQ', 0, h);\n}\n\nfunction cv_moV04SOTSUZ7GQresetPlayer(w,h,bw,cc) {\n  cv_moV04SOTSUZ7GQnewHeight(h);\n\n  cv_moV04SOTSUZ7GQso.addVariable(\"resetBandwidth\", bw);\n  cv_moV04SOTSUZ7GQso.addVariable(\"cacheCode\", cc);\n  cv_moV04SOTSUZ7GQso.setAttribute(\"height\", h);\n  cv_moV04SOTSUZ7GQso.setAttribute(\"width\", w);\n  cv_moV04SOTSUZ7GQso.write(\"cv_moV04SOTSUZ7GQflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moV04SOTSUZ7GQRollOverImg = new Image();\ncv_moV04SOTSUZ7GQRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91%2BxnO2EAlS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moV04SOTSUZ7GQpreplay = document.getElementById('cv_moV04SOTSUZ7GQpreplayImageId');\nif (cv_moV04SOTSUZ7GQpreplay) {\n  cv_moV04SOTSUZ7GQpreplay.onmouseover = function() {\n    cv_moV04SOTSUZ7GQpreplay.src = \"http://ecx.images-amazon.com/images/I/91%2BxnO2EAlS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moV04SOTSUZ7GQpreplay.onmouseout = function() {\n    cv_moV04SOTSUZ7GQpreplay.src = \"http://ecx.images-amazon.com/images/I/91%2BxnO2EAlS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moV04SOTSUZ7GQpreplay.parentNode;\n\n  var cv_moV04SOTSUZ7GQcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moV04SOTSUZ7GQcurrentClick) {\n      return cv_moV04SOTSUZ7GQcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:29 MinsThis is a feature packed phone for the price. For under one hundred dollars, users get a great smart phone on a great network and in addition, no one is locked down to a two year contract. I tried to cover as much as i could in the video review, but due to file size limitations, i maxed out if i exceed a three minute video review. I am a huge Windows OS fan. I think their OS is great and offers users a different experience. It is NOT the most exciting OS out there, but at the same time, it is a very solid OS and runs very smoothly. It is not a battery hog or glitchy like the Android OS. My pros and cons are below. I know my cons list might be a bit long, but remember that you are getting a lot for the price. Feel free to ask me any questions and i'll be happy to respond.Pros:- Price (A smartphone under one hundred dollars and no contract)- T-Mobile network after merging with Metro PCS- 4G (HSPA Plus Network no 4G LTE but faster than 3G)- Built in Wi-Fi- Mobile HotSport Feature- T-Mobile's awesome affordable plans- Wi-Fi Calling after merging with T-Mobile- Windows OS- Features packed smart phone for the price- LCD display (LCD is brighter than AMOLED displays)- Expandable memory up to 64GB via micro SD card- 720P Video recording on the phones built in camcorderCons:- No HD display- Display is 4 inches (5.2 inches would be perfect)- No front facing camera for video chats- A larger battery- Not a 13 megapixel camera- No flash on the camera- No Starbucks or Hangouts App yet- No 4G LTE (Runs on HSPA Plus which is faster than 3G)", "Date": "January 5, 2014"}, {"Title": "Best Cheap Phone on the Market", "Author": "gibby", "ReviewID": "RQG4TT68HIYXU", "Overall": "5.0", "Content": "I bought 2 of theses phones for my mother in-law and my niece and they both love the phone and cant believe how much it costs with out a contract.its fast calls sound great and it works great with their windows 8 laptops.. taking pics show up on their computers I no longer need to teach them haw to get photos off their phones..awesome Job NOKIA...", "Date": "October 21, 2013"}, {"Title": "Surprised and wowed.", "Author": "Jon", "ReviewID": "R20D64ZTN5APRL", "Overall": "5.0", "Content": "I was expecting only a tolerable experience with this Nokia 521 MetroPCS Windows8 phone. I'd had a Samsung NOTE for almost 2 years and enjoyed Android/Google interface, but wanted to save money so I switched from AT&T; to Metro PCS, and I figured the no-contract, cheapest-offered Nokia (Only $89.00 on Amazon!!!!) would be a low risk entry point. After using this phone for a month I have to conclude that it's easily and by a large margin the best cell/smartphone experience I've ever had. Truly  I wasn't expecting this Nokia and Windows8  to be such a breath of fresh air. Firstly the mechanical  functions of this Nokia are mercifully simple to understand right out of the box. I'd read that some people are confused by Windows8, and I realize everyone's brain works differently, but this interface speaks my language, I guess. It's easy to look at, easy to hold, elegant or nothing fancy, depending on your personal taste. The row of  physical buttons are placed at the lower end of an incline curvature that makes accidental turning off and on of the phone difficult. One of the physical buttons is the camera shutter, like a real camera has, so no more tapping at a touch screen to take a snap. (No flash though, but still manages decent shots, even in low-ish light) The screen is only two-thirds of the size of my  Samsung Note's screen, but the Windows interface places  multi sized app boxes atop each other that scroll/float up and down with gentle swipes.  The boxes are customizable so although my eyesight is only average to getting older I can read what's on the screen without strain, the navigation feels effortless.What don't I like? I became addicted to Words With Friends, which doesn't have a good WIndows8 Phone app, so I had to  convince everyone that I play with to switch to WORDS BY POST, which is a multi phone platform scrabble-like game that works for everyone except  my poor Blackberry using friends (Sorry this is too much information!).  Another thing I don't like is though I can use voice for Google Searches, it will answer me in text, but not with a voice which Android will do.But back to more things that I like: Outlook synced up my PC and phone calendar and contacts effortlessly....and wirelessly.  Notifications of mail, texts and voicemail work great, nice Nokia music and maps apps.  About MetroPCS: I felt genuine trepidation about switching from a top three carrier to whatever rank they are but I actually get CLEARER voice quality now than I did with my AT&T; Samsung. Maybe the superior call clarity comes from Metro PCS, maybe it's the Nokia handset, but what matters to me is how clearly my parents are coming in from Florida and my sister from MA sounds like she is in the next room. Bottom line: I've trimmed $70 off my monthly phone bill PLUS have found the perfect phone for me.", "Date": "January 19, 2014"}, {"Title": "Love it", "Author": "Michelle", "ReviewID": "RZGSK21QJ492U", "Overall": "5.0", "Content": "Love the phone...... it was an adjustment from android to windows phone...... but I love it and would buy another.", "Date": "December 6, 2013"}, {"Title": "Very impressed", "Author": "clamarama", "ReviewID": "R3KUUYI6AMIVZK", "Overall": "5.0", "Content": "I got this phone because it seemed to offer the best quality hardware on a budget price, plus switching to MetroPcs saved me $10/month over Virgin Mobile. I wasn't crazy about the idea of switching from Android, but figured it was worth a try. Before switching, I checked the Windows Phone app store to make sure that I could get apps that I find essential.I've had the phone about a week now and it is definitely better quality than any of the similarly priced Android phones I've owned, and the Windows OS is far superior to Android. I love the live tiles and the ability to customize the home screen. The interface and animations are so elegant and beautiful - the attention to aesthetics makes the phone fun to use.I had a little bit of trouble with the set up, especially getting contacts loaded. On the surface, it seems very easy - you enter your account info and if you check the box to sync your contacts, it syncs them. My problem was that I have several hundred gmail contacts and only wanted a small number of them on the phone. If I tried to delete a contact from the people app on the phone, it would give me a warning that it would also delete the contact from Google. I asked Metro PCS and Microsoft support how to get around this, and they didn't have any answers. Eventually, I set up a new Outlook.com account and imported a list of the contacts I wanted and had the phone sync contacts for that account only. That worked well, but I was frustrated at how little help I got from Metro and Microsoft. The next day, I got a welcome email from Windows Phone, and it included info about a Nokia app called \"Transfer My Data.\" It turns out that this app transfers contacts from your old phone via Bluetooth. It worked quickly and effortlessly, but I'm so annoyed that they didn't tell me about it when I asked for help!The other problem I had was when I added the Block-it service from Metro. This is a call-/text-blocking app that they offer for $1 a month. After I ordered the service, I couldn't find the app. It took an hour for the support person at Metro to figure out that my phone was not compatible with this service, although it was included on the list of compatible phones. AND, the next day I got an update of the Lumia software that included an app that provides call and text blocking for free. Again, I'm annoyed that the support person didn't know this.Here are some of the things I like best about the phone so far:-Seamless integration of multiple accounts. It shows events from my personal and work calendars (even Facebook events). The calendar color codes events by source account. Office provides access to my SkyDrive files for both my work and personal accounts, and even includes lists of recently accessed files on both my home and work computers, including files that aren't on my SkyDrive. It correctly integrates information on contacts that comes from different sources, even when I use private nicknames for those contacts - so people's birthdays and other info from Facebook are added to their entries in the phone. (You can also write on a person's Facebook wall from within the contact list, without actually going to Facebook. I think you can do this with Twitter, too, but I don't use Twitter.)-The camera is surprisingly good and it doesn't matter that there's no flash. It's not great, but far better than I expected. It has some way of adding light without a flash. When you open the camera in low light, you can see that there's more light in the frame than there actually is in the room. My daughter has a 5MP camera phone with a flash, and the Lumia actually took better pictures in our fairly dark living room. The pictures had comparable light levels, but hers were washed out from the flash in some areas.-The processor speed doesn't look impressive, but it's a good match for the OS. Everything opens very quickly, way faster than on my Androids (I did have cheap Androids, but this phone is also cheap.)-The sound quality from the speaker is very good. I mean, it's still a speaker on a phone, but I find the music listenable on it, which has not been the case with any of my previous phones. It can also get surprisingly loud, both for media and calls. (It also has an FM radio.)-It will read your texts to you. You can set it to do this all the time or just when you have a headset connected. When you turn on this feature and a text message arrives, the phone will ask whether you would like to hear or ignore the message. After you listen to the message, it will ask you whether you'd like to reply. It is a completely hands-free experience and it does an excellent job. Even when my daughter sent me texts with made up words, the reading was flawless. The dictation of my spoken texts was also excellent.-Word prediction when typing is outstanding. It will often accurately predict the next word before I've even typed the first letter of that word. Example - I typed \"Are you working tonight? I have an extra...\" and it offered \"ticket\" as an option before I had typed the 't.'-The media app is great, and I find it much better than Google Music. It's really easy to access both music and videos. I had trouble with video playback on Android.-The GPS works great. It seems functionally equivalent to Google Maps. It's a little more customizable and the settings are easier to access. It has a \"find my car\" feature to locate your car in a garage. This sounds really cool, but I haven't tried it.-When you tap the phone tile to make a call, the first view is of your call history, rather than the dial pad. At first, I thought that was stupid, but in reality, I most often call people who have recently called me or who are always near the top of the call history list. Plus, you can create tiles on the home screen for your most frequent contacts and call them from there, or you can click the \"people\" tile to go straight to your contact list. It actually is rare for me to need the dial pad to dial a number, so it makes sense not to have it be the first thing you see.-You can set the phone to automatically silence when it's placed glass-down.-You can tether without additional software (I think Metro PCS charges $5 a month to do so, though.)-The kids' corner feature seems cool - you can set it up so that your kids can only access specified apps. My kid is too old to need this, but a few years ago I'd have found it very useful.-It doesn't include all of the 'bloatware' commonly found on Android phones.Things I don't like:-You can't set separate volume levels for different functions like you can on android. There is a single volume level for everything.-Some of the apps are not as good. I've found apps to replace all of my favorites on Android, but a couple of them aren't as good.-There isn't an \"official\" (Google-produced) Gmail app. The biggest problem with this is that you can't get push notifications for Gmail accounts. The shortest interval available for checking Gmail is every 15 minutes. I found an app that claimed to resolve this (but not in its free version). The app was so slow and laggy that I didn't want to pay to find out if it worked. UPDATE: This issue is resolved in Windows 8.1 and I now get instant notification of new gmail messages.Overall, I'm very happy with this phone - both the hardware and Windows - and highly recommend it.", "Date": "January 19, 2014"}, {"Title": "works well", "Author": "Turi", "ReviewID": "RG3HUSEDFX2WZ", "Overall": "5.0", "Content": "not sure why there are less than positive reviews.  I have one, use it every day and it works just fine, even overseas when I travel", "Date": "November 26, 2013"}, {"Title": "After hours of extensive research on what would be my next phone....", "Author": "B. L. Morando", "ReviewID": "R24PZQQ455RI1A", "Overall": "5.0", "Content": "I have been a Metro PCS customer since 2010 I think and I have never been happier. This phone is my 6th phone with their service not because I was unsatisfied but that I wanted to get to a new level of satisfaction so each phone was an upgrade from a previous one and with no contract its easy to breathe when that bill time comes around because there are no hidden fees. I have had no major problems with their services or coverage areas. This phone is beautiful in every way. I am a team Android player but android lacks unity within the phones and each one differs as far as upgrades and features. I was scared to get this windows phone because of the lack of knowledge and the rumors saying that it was a one trick phone like the iPhone. SO...I mad the decision to try it out and I love it. I still use my android phone like a camera and media input device because some applications on that phone are not available on the windows phone just yet. So I use my windows phone for the unity of the messaging so there will be no outside application that I need to download to keep all my messages in one place. The support for customers is phenomenal and I love the fact of having office on this phone for those last minute class assignments. I love the fact that my email account is also connected to my skydrive which is wonderful in itself. I could go on and on all day about the many features of this phone that make up for what it lacks compared to android but I will stop here and conclude with:If you are a loyal Metro PCS customer and you want to experience some unity and wonder get this phone...otherwise dont dare take the risk. (Mind you this phone is worth like $200)", "Date": "January 1, 2014"}, {"Title": "No flash", "Author": "Mitch", "ReviewID": "RA3MYH3MYG7MZ", "Overall": "3.0", "Content": "Be aware if you don't look close, there is no flash for the camera. Bought to use at work where I make a lot of calls and take pictures. I just didn't think to look and see that it didn't have a flash. The phone works well, better than my old Metro PCS phone. The internet is pretty fast. Importing contacts could not be done because the stores did not have the software to import for this phone.", "Date": "October 15, 2013"}, {"Title": "Grandson.", "Author": "Paula Gallegos", "ReviewID": "R2IU66U6ZYQPF9", "Overall": "5.0", "Content": "Grandson's loved them and were so excited. Easy to access everything, easy to hold; slimline. Everything they wanted in a phone.", "Date": "December 22, 2013"}, {"Title": "Nokia Lumia 521 (Metro PCS)", "Author": "larry brown", "ReviewID": "R2M2K1Z0M58438", "Overall": "5.0", "Content": "Bought for wife @ Christmas setup super easy.Very nice sound for music and pictures are clear beautiful.I believe she will like it.Just a little jealous! : )", "Date": "December 21, 2013"}, {"Title": "great windows phone", "Author": "Alexander", "ReviewID": "R8K8EH4MWF7JF", "Overall": "5.0", "Content": "this phone was a gift to my mom and she loves it easy to manage and speed is great very responsive", "Date": "January 19, 2014"}, {"Title": "One of the best phones I've ever had!", "Author": "Eve", "ReviewID": "R3CP6RE5HSCET6", "Overall": "5.0", "Content": "This is my first smartphone and I am so happy I picked this one!! I've had Nokias in the past and they are so user-friendly, and this one's no different. I was a bit apprehensive about entering the world of smartphones, but the Lumia 521 has made the transition easy and pleasant :) I'm recommending this phone to all who ask and even convinced my mom to get a Lumia :D", "Date": "January 10, 2014"}, {"Title": "Only needs flash to make it five stars", "Author": "Jorge Lopez", "ReviewID": "RBOFQJH0XKR8I", "Overall": "4.0", "Content": "Only major turn-off is that is does not have flash for the camera - even if it has good night picture performance. - it would be best to have a dedicated one. Outside of that, it works great, superb performance for its price, thin and light at this price point with good screen. This was a gift for my mother-in-law and she moved from a Samsung android phone and she loves this Nokia so much more.", "Date": "January 7, 2014"}, {"Title": "SCAM!!!! DO NOT BUY FROM THIS VENDOR", "Author": "online shopper", "ReviewID": "RGO293IO9VV50", "Overall": "1.0", "Content": "I received my phone in the mail and it was a beat up soiled box. Well I went to activate the phone just to find out the phone was not serviceable it was broke some way the salesman at the store told me I would have to take it back to the store I got it from. I told him I got it offline. He shook his head and said I am sorry but you will have to purchase a new phone this phone cant be activated its no good.", "Date": "March 27, 2014"}, {"Title": "love this phone", "Author": "angelbaby", "ReviewID": "R1WGAOH5Q421IM", "Overall": "5.0", "Content": "I love everything thus phone has to offer. The apps r great and it works very fast and well. Havent had a problem wit it at all.", "Date": "February 8, 2014"}, {"Title": "Great Phone", "Author": "Jenny", "ReviewID": "RTCLSYQFPM2QH", "Overall": "4.0", "Content": "This is a really great phone. Let me first say that I bought mine straight from Metro's website --  not from Amazon. It packs alot of punch for such an inexpensive price. The total cost is $52 with a $20 rebate. It's a steal :) You will be very pleasantly surprised. The camera is awesome. Sound quality is good (honestly better than I expected). I listen to di.fm on it. No complaints so far (first month).. Good for us old school'ers.. TechTransition is quick, ha ha :)", "Date": "February 8, 2014"}, {"Title": "GREAT phone for people who HATE cell phones", "Author": "Thomas M. Sipos", "ReviewID": "R3H31Y68O1JXX", "Overall": "5.0", "Content": "I don't need the latest, highest-tech cell phone. I hate cell phones. Early this century, I bought the cheapest flip phone -- black & white, no camera -- that I could find, and kept it till 2011. I only made calls once or twice a year -- seriously -- and gave my number to no one, so no one could call my cell phone. I prefer landlines and email. I've never texted in my life.After a billing dispute with Verizon in 2011 concerning their broadband wireless card, I canceled all my Verizon wireless accounts, cell phone included. So I've not had any cell phone for over two years. I didn't miss it.But now I might do some heavy traveling (within the U.S.), so I decided to finally get a smart phone, so I could have GPS, internet, and email in my new cities.After my experience with Verizon, I knew I wanted a flat rate plan. I initially got an Android flat rate phone at Staples, but it was more complicated than I cared to figure out, so I returned it. Then I saw this Nokia uses Windows. I've used Windows on my laptops since 1996, so I figured it'd be easy.This Nokia -- with the MetroPCS flat rate plan -- turned out to be a good choice for the cell phone hater in me. It's easy to figure out -- important for those who've never used a smart phone. You can download an easy-to-understand PDF manual from their website.I've yet to download an \"app\", but the ones that came with the Nokia are useful. A GPS that locates where I am -- quick and easy and accurate. Another GPS that provides all nearby mass transit options, schedules, and routes -- very useful if visiting a new city. Another GPS that locates nearby restaurants, tourists sites, etc.There's a Weather Channel app which is easy to use (though not always accurate -- once the app told me there was 0% chance of rain where I was -- even as I was holding an umbrella to keep the pouring rain off my Nokia.)There's a free Angry Birds app, with free Angry Birds movies. I had no idea what Angry Birds was. I learned on Wikipedia that it's a video game. Luckily, it was easy to delete, movies and all.It's easy to connect this Nokia to my laptop, and transfer MP3 podcasts and MP4 movies onto it. (I've not tried other formats.)I have not tried to download podcasts or movies directly onto the Nokia.I find the touch screen to be bright and sharp, with good color saturation (though admittedly, it's my first smart phone, so I've nothing to compare it to).The Nokia's still camera and video camera are easy to use. The images are okay, not that great -- nowhere near as good as the images from my Sony Cybershot, which is 3 years older. But I don't suppose a smart phone's camera can be expected to match that of a dedicated digital camera.Some reviewers have complained that the Nokia's camera lacks a flash. This is true. But then, I didn't get a cell phone to use as a camera.The MetroPCS plan I signed on for is $40 a month, all taxes and fees included. So far, that's been the case. Payment is easy. I log onto their website (via my laptop), and easily find where to pay another $40 for another month. I like that I can control when and how much I pay -- unlike my past experience with Verizon, with their unexpected charges.Since the MetroPCS plan is flat fee, I sometimes use my Nokia instead of my landline. I've had some problems there. Three times I called the post office, and when I finally got through (average wait, 50 minutes), I was disconnected shortly after I began speaking to the postal rep. I wonder if this was the post office's fault, or if my face brushed some part of the Nokia's touch screen that caused it to hang up.I used the Nokia's speaker phone option while the post office put me on hold. So yes, this phone has a speaker phone.The only catch in MetroPCS's plan is that, while phone and text are unlimited, if your data use goes over a certain amount during the month (I forget how much -- 500 MB, I think), then the data speed lowers from 4G to 3G. But I don't download much data, so it's not an issue for me. I mainly got this phone for emergencies when I travel.Not the highest-tech phone -- no flash, so-so camera -- but a cheap, HONEST rate plan, and easy to use for those already familiar with Windows.", "Date": "March 25, 2014"}, {"Title": "Do not like it at all", "Author": "M. Theresa McCain", "ReviewID": "RZLW1XXN10ABR", "Overall": "2.0", "Content": "I didn't like the phone.The windows format is not hard to learn, but the phone itself did not always work .  I couldn't make calls sometimes even with all bars full charge. Not a good buy.", "Date": "April 7, 2014"}, {"Title": "Unable to use", "Author": "Decadent De", "ReviewID": "R1B75JXT4ZFNEH", "Overall": "1.0", "Content": "Cant use phone it is locked and can only be used on Metro PCs network.  I don't live in the USA.  I think that Amazon needs to sort information according to what the customer is requesting.", "Date": "June 7, 2014"}, {"Title": "necesidad de des codigo pim", "Author": "Carlos Josï¿½ Yegres", "ReviewID": "RO3BBQ9BTKPLE", "Overall": "4.0", "Content": "Hello, the product is very good and is received in an acceptable time. But I have a problem with the phone and this is locked, calls me a 8 digit pin and which is not. I appreciate if you can help me with this. Best regards.Carlos Jose Yegres", "Date": "May 25, 2014"}, {"Title": "unlocked phone", "Author": "Dalimar", "ReviewID": "R3KCV125D4ZM6V", "Overall": "1.0", "Content": "Before I bought this phone I did ask if this was an unlocked phone, now I'm trying to use the phone and it is not unlocked, what can I do??? Please advise.", "Date": "May 4, 2014"}, {"Title": "No front cameria is a downfall", "Author": "Shannon McHenry", "ReviewID": "R20BNS7CK9NVH5", "Overall": "4.0", "Content": "Other than no front camera or a flash, this phone runs smoothly and accurately. It comes preinstalled with Microsoft Office. So you can enjoy the helpful tools of Powerpoint, Word, and Excell. The live tiles are also a unique launcher for a phone as it updates contact photos and social media through a live feed via 3g/4g. 7/10 WORTH THE MONEY.", "Date": "May 4, 2014"}, {"Title": "phones", "Author": "IDA VAZQUEZ", "ReviewID": "R1M2G6RSUMH0BU", "Overall": "5.0", "Content": "this phone on the other hand was great i love it it works fine all and all i love it", "Date": "April 24, 2014"}, {"Title": "luv our lumina", "Author": "RNTvideos", "ReviewID": "R303CI02FCJ6L8", "Overall": "5.0", "Content": "love it so much that we're getting 2 more for the family soon. easy to navigate, see, and hear on this phone.", "Date": "April 23, 2014"}, {"Title": "phones are not unlocked", "Author": "Mayra Lozano \"mara0612\"", "ReviewID": "R2AU4Q0GYMNHSE", "Overall": "1.0", "Content": "Phones should be unlocked. However when I went to the local communication company to get a plan, they told me that the 3 phones are locked devices. They told me ¨ If you want to unlock them you need to go to Singapore¨. (I am in Venezuela). Question is what can I do? I need the phones in Venezuela.", "Date": "April 12, 2014"}, {"Title": "Nokia Lumia 521", "Author": "American Express \"ABDULGHANI ALBAYYAT\"", "ReviewID": "R3QD5RMSVF1843", "Overall": "1.0", "Content": "This was to be used in Saudi Arabia .  although the add said the  phone is no contract one, it did not work here.  It has to be used in USA via metroPCS.  I could not find any help anywhere so I can use it here in Saudia  outside US.Apparently, the add should say unlocked for the phone to work outside US.", "Date": "April 9, 2014"}, {"Title": "Great experience, except wifi calling didn't work.", "Author": "Mark Midura", "ReviewID": "R1GI02S6MBJ1LI", "Overall": "3.0", "Content": "I really loved the experience of the Windows OS, it ran smooth and clean, but the phone has some key issues:Pros: Clean and smooth interface. Camera is quality with good lighting.Cons: WiFi Calling/Texting doesn't work, cheap plastic feel, no front facing camera, no flash on camera.I would recommend this phone to someone who doesn't need the WiFi calling, but unfortunately I do. It's a feature that shold work, but Nokia has messed something up somewhere that causes it to not work. Shame because I could have overlooked the cons if I could have gotten service at home, I mean let's face it the budget phones have crappy front facing cameras and all cell phone flash sucks anyway. If you want a budget Windows phone and get service without the need for WiFi help then get this phone. It's nice. Otherwise look elsewhere.", "Date": "March 25, 2014"}, {"Title": "very good phone", "Author": "Jonathan", "ReviewID": "R1LJ56QLSBL10", "Overall": "5.0", "Content": "The phone is awesome its a easy to use phone I originally got the phone when my LG esteem started to use a lot of battery. This phone is good for people who gust want a good phone for cheap and want to be able to use it to play games sometimes call people, calling is very clear, and is very sturdy I have dropped it and does not crack anything ,its very easy to learn to se and its fun to have one without having to worry about it breaking and if it does you can get a new one for 20 dollars path the metro store , the phone is fast and for the money is better than most phones only bad things are that the back has buttons built into phone, case is slippery ,the case is white but never gets dirty, and has no flash and no front facing camera. Then again its a budget phone and if you want to get a phone with a crazy camera then get the Nokia Lumina 1020", "Date": "March 23, 2014"}, {"Title": "Great Buy!", "Author": "Keith Kologey", "ReviewID": "R15KQ28ND7GC5L", "Overall": "5.0", "Content": "It's has all that u need and looks great! It s light but durable n has all the apps of the IPhone at 1/2 the price.", "Date": "March 20, 2014"}, {"Title": "My son loves it!!", "Author": "Amazon Customer \"Lady Dreamer\"", "ReviewID": "R3RE2BK5K72NNS", "Overall": "5.0", "Content": "I bought this phone for my son and he absolutely loves it. It has everything at your finger tips. Very user friendly!!", "Date": "March 18, 2014"}, {"Title": "For what its worth!!!", "Author": "ryan", "ReviewID": "R20P3TAFX42BTG", "Overall": "5.0", "Content": "This is an awesome phone..... before i had this phone ive never owned a so called smart phone and never considered a windows phone but it has been awesome since day one of recieving this phone! i recommend anyone on the metro pcs service to purchase this phone you wont regret it!", "Date": "March 17, 2014"}, {"Title": "Nice beginner Windows 8 phone", "Author": "J. Lee", "ReviewID": "R3FYZM0X0FZ7CX", "Overall": "5.0", "Content": "I have no complaints.  It uses T-Mobile's network even though it MetroPCS.  The mic is more sensitive than my past phones.  It's dropped in price since I bought it, but it was still worth what I paid for it.", "Date": "March 15, 2014"}, {"Title": "Nokia Lumia 521 (Metro PCS)", "Author": "Happygil", "ReviewID": "R29DZ86GNPBVBA", "Overall": "5.0", "Content": "I brought this phone for my 13 year old daughter and she's loving her new phone. I can't get her to put it down. I myself love it and I made an excellent choice by buying this cellphone. It's a cute little with great features.", "Date": "March 11, 2014"}, {"Title": "Wish I Still Had my Android", "Author": "Kim", "ReviewID": "R13HDYEO63MZ9U", "Overall": "2.0", "Content": "This phone has a lot of nice features. I wanted a Windows phone and when Metro PCS started running their 4G Windows phones for $29, I thought it would be the perfect time to switch from Straight Talk. We purchased 2 of these phones at a Best Buy near our house. It has been 2 weeks and I still have problems finding my way around this phone. It took forever to set up my contacts, and I didn't have internet for a day after buying the phone. I can't get any of the same apps (or even remotely close apps) as I had with my android. Have yet to find a FREE app for downloading music that I can turn into a ringtone, and there is no GPS like you would find with the Navigation app that comes preinstalled on most of the Android phones. The camera is ok, and the screen size is good; however, I might just reactivate my Straight Talk phone and get rid of this one. Traveled an hour out of town (was still in a big city) this past weekend and had absolutely no service. Calls drop constantly and the touch screen is extremely sensitive and will hang up your call without you even touching the screen. Overall, I hate this phone and the Metro PCS service. I would not recommend this phone, or this company to anyone.", "Date": "March 10, 2014"}, {"Title": "Great phone", "Author": "ray", "ReviewID": "R1GEFZGEJL2563", "Overall": "5.0", "Content": "Got this for my wife for Valentines Day. She loves it. It is really easy to navigate through all the features of this phone with windows 8 Tiles I highly recommend this phone, can't be beat for the price.", "Date": "March 10, 2014"}, {"Title": "Great Phone", "Author": "Jack k hall-vaughn III", "ReviewID": "R1UTLUKLWODO9T", "Overall": "5.0", "Content": "I'm really satisfied with this phone the only thing I wish it had was the front camera and the official snapchat, instagram app", "Date": "March 8, 2014"}, {"Title": "Very nice phone, but Metro PCS isn't very competent", "Author": "R. Fischer \"ray42\"", "ReviewID": "R1S80OEKELZZFP", "Overall": "3.0", "Content": "Here's what's really nifty about this phone & service:1) I can keep track of multiple email accounts, messages, voicemail, facebook, and meetings, all from the home screen.2) It handles Excel and Word documents as well as PDFs and I can connect to meetings with Lync.3) Decent camera4) Really cheap5) I happen to like the Metro interface6) MetroPCS is cheapSo what are the downsides?1) No front facing camera (no Skype)2) No flash (not important to me)3) MetroPCS as a phone company is incompetent.  Their web site is more aggravating than useful.The coverage is good (same as T Mobile) but the web site is often broken.  I've had to reset my login password more than once because their computers forgot it (!).  Good luck finding clear details as to what services they offer on their web page.Calling them up puts you into menu hell.  The trick of hitting zero to get to a person?  \"We understand that you want to talk to somebody.  Select from the menu what kind of help you want ...\"It's a good thing the phone doesn't cost much because when I hurl it trough a window it will be cheap to replace.  But if you don't need to deal with them to change anything it's a good service.", "Date": "March 1, 2014"}, {"Title": "love it", "Author": "ashley velasco", "ReviewID": "R21ZU1E9P1QMLI", "Overall": "5.0", "Content": "Got it as a gift my husband loves it, it great phone and had no problems getting it all hooked up at metro pcs.", "Date": "February 27, 2014"}, {"Title": "Missing a few features and TALKING feature isn't very good!!!!", "Author": "Sherri", "ReviewID": "RYSIBLJF1YOZQ", "Overall": "3.0", "Content": "My LG of 4 yrs was awesome in allowing me to have separate volume controls for ring tones versus listening to someone talk on the phone.  I could also adjust my email setting to prevent me from permanently deleting emails in my Inbox until I did so from my pc.My biggest issue with this phone is not having good cell reception and experiencing dropped calls which I hardly ever experienced with my LG.  I truly thought 4 year newer technology would mean better!!  I thought Nokia was supposed to be top of the line...but simply talking on the phone has been my greatest challenge.Metro PCS sent me a survey to complete 2 days after activation.  Wish I'd waited to give my opinion after experiencing continued problem of dropped calls and lack of good reception inside my home.Windows 8 has been fun to learn after always having an Android.  My issues aren't w/the Windows OS ... it's all about the phone quality when talking and not having control over different functions that I had with my LG.  :-(", "Date": "February 27, 2014"}, {"Title": "Great phone", "Author": "victoria", "ReviewID": "R1NJQSYOD0FVVP", "Overall": "5.0", "Content": "Great phone for the price. This my first windows based phone, I actually have nothing bad to say about it. Makes good calls, battery life is great and I can play all my games on it too. I'd say buy it. Can't beat the price.", "Date": "December 27, 2013"}, {"Title": "Just as good", "Author": "D4N3R5", "ReviewID": "R205ZM5FZY0PTT", "Overall": "5.0", "Content": "Received the phone earlier today and immediately put it to charge. Need to get it ready for my wife when we go to activate at the local MetroPCS store. Luckily I had some screen protectors left from my sons phone. I may just consider getting one for myself too.Hmm...~[0_0]~", "Date": "February 4, 2014"}, {"Title": "UNLOCKED KEY", "Author": "Morella Guevara", "ReviewID": "RZCZNYV8O1MLS", "Overall": "2.0", "Content": "GOODNIGHTabout a month ago and half acquired two phones NOKIA LUMIA 521 to send them to VENEZUELA. ARRIVING IN THE COUNTRY A FEW HOURS AGO THE PHONE ASKED ME A KEY FOR PÓDER USE ANOTHER LINE THAT IS NOT IS IS RELEASED. I WOULD LIKE TO KNOW IF YOU CAN SUPPLY ME WITH SUCH KEY, SINCE THE PURCHASE IS PERFORMED BECAUSE IS SAID THAT IS COULD USE IN ANY COUNTRY.Thanks for your help", "Date": "May 20, 2014"}, {"Title": "I just dont like the phone very much", "Author": "Justin Crandell", "ReviewID": "R1ROJDO4MO3UB1", "Overall": "2.0", "Content": "Well the phone freezes a lot and im just not happy with it id rather have the galaxy S4 preferably but it costs too much", "Date": "March 24, 2014"}, {"Title": "locked to Metro PCS", "Author": "richard rayment", "ReviewID": "R1X5SQ7KI87O11", "Overall": "1.0", "Content": "Found under Unlocked Nokia Phones but it is in fact locked to Metro PCS for at least 3 months.  Don't believe all the comments saying it will work on T-Mobile.  It does not and even though Metro PCS are part of T-Mobile they wont unlock it unless you subscribe to them for three months first.Shame coz the phone itself is good and well made.Just pay the extra & get the fully unlocked version.", "Date": "March 11, 2014"}, {"Title": "Great phone!", "Author": "Michelle White", "ReviewID": "R3FK21ET4FU6SB", "Overall": "5.0", "Content": "Very affordable, wonderful phone for the price. I love Windows so I wanted a Windows phone. The Nokia Lumia is not a cheap phone, it is lightweight but heavy on the apps that I need to keep my life together. I had to return it because it did not work with my carrier's sim card. That was disappointing because I thought it was an unlocked phone, but after talking with my carrier, I ordered another one that will work with my carrier. I hated to return it. Very usable friendly, very quick response. Easy set-up and ready to go. With all the expensive phones out there, everyone thinks to get a good phone you have to pay some ridiculous price. Not so, I say! This phone can hang with the big boys! This purchase was well worth it.", "Date": "December 14, 2013"}, {"Title": "Great phone. Mediocre network.", "Author": "Zak Dwyer", "ReviewID": "R29AYKRMQAXC15", "Overall": "4.0", "Content": "Not many good apps for Windows Phone, but as far as style and build quality goes, you literally can't get a better deal. Feels like a good, solid Nokia product. Very responsive, but the network it's on is slow - you're either on 4G (of which there isn't much coverage) or on 2G (which might as well not exist considering it's slower than dial up). But as far as the phone goes, it's probably the best of the choices besides the Galaxy S3/S4, and that's only because Android has better quality apps.", "Date": "December 1, 2013"}, {"Title": "unable to unlock the lumina 721", "Author": "Headley johnson", "ReviewID": "R2GPLAVRMSJ99K", "Overall": "1.0", "Content": "The phone was not unlock And I was unable to get it unlock while Un Vatican in Jamaica but the phone look good", "Date": "February 21, 2014"}, {"Title": "not simple at all", "Author": "DR MOUSE", "ReviewID": "R1X72IH7SWUS32", "Overall": "3.0", "Content": "i switched from a lg text phone to this nokia and as a novice it is truly a pain ....too many steps...not figured out shortcuts...nice call tone text space is too sensitive making a lot of wasted time in texting...used to hard buttons.....all in all it is not simple...not in love with it at all", "Date": "February 13, 2014"}, {"Title": "it could've been better", "Author": "mads", "ReviewID": "R2B7EMAE7OUWJN", "Overall": "3.0", "Content": "It does not get good reception inside my house. The camara is not as good. As I thought. No flash so at night time is very difficult to take pics. The Facebook app I a little. Bit hard to understand. The most upseting was the camera.", "Date": "January 9, 2014"}, {"Title": "worst phone ever", "Author": "trice", "ReviewID": "RBDIUR5LSX64L", "Overall": "1.0", "Content": "Ok so I'm 21 years old, I've had 20+ phones cause I'm very neglectful and I seem to lose my phone every three months or so. So Im typically really cheap when it comes to buying phones. I've always bought GooglePlay phones, but I saw a cheap nice looking phone that was different from any other phone I've had, so I went on and bought it. Not even 2 weeks after I bought it it started powering off by itself. All the brand new cool apps that everybody has, windows takes forever to get! Like literally four months. Instead they'll give u some knockoff apps that constantly closes down and freezes up! (for instance instead of instagram, windows has instance.. or 6tag, and they are not great, they suffice.) Four months later when they finally upgraded to instagram it was not even worth taking up space in my phone. It had so many technical problems. I stuck with 6tag. With a windows phone or at least the Lumia 521, you are not able to block certain calls or send certain people straight to voicemail.. I've always had that option with my other phones! Another thing I really hate is that u need WiFi. So anytime I leave my house I can't get on YouTube, i cant download stuff, or even use most of my apps! I H A T E this phone, and i never thought that was possible considering the fact that I'm a \"a phones a phone\" type of gal. This phone is such a headache and the worst part is that i cannot for the life of the lose it! But since I'd prefer to have a reason before getting a new phone I've just started to slowly break it. So like when it powers off by itself, I'll throw it. When it freezes for 10 minutes, I'll throw it. Anything this piece of s*** does, i throw it. Bottom line, don't buy this phone no matter what anyone says. Metro actually has cheaper phones that are better than this one. Always get googleplay!", "Date": "March 14, 2014"}, {"Title": "ohone locked", "Author": "carla", "ReviewID": "R2FDLP2NSMEKOY", "Overall": "3.0", "Content": "I need to know how to unlock this phone so it can be used on a mobile network....  The item description  said T-Mobile so is there anyone that could pm me so I could actually get to enjoy this phone.", "Date": "January 25, 2014"}, {"Title": "Don't get this phone", "Author": "Jay Stallworth", "ReviewID": "RMRLOQ8OUB6D7", "Overall": "1.0", "Content": "After 2 weeks it feel on the carpet and every since it doesn't stay on. It cuts on and off in the middle of calls and deletes all contacts and text messages", "Date": "January 13, 2014"}, {"Title": "A waste of money", "Author": "Alyssa Juros", "ReviewID": "R3FPW0XQ90DIRA", "Overall": "1.0", "Content": "Phone gave me trouble from day 1, and is generally unstable and unreliable.  The person on the other end sometimes can't hear me, I get frequent dropped calls, texts that don't go through, and the phone randomly shuts off.  I have no GPS since the App \"Here\" doesn't allow me to enter an address. The latest is that I am having difficulty turning the phone on.  It doesn't help that Nokia customer support is only available on weekdays until 7pm.  I can't really spare an hour during the day to leave my desk and call them.  Metro PCS does not service phones unless you buy it from one of their stores.  So the only solution is to mail in the phone to the manufacturer.  I will not do this again as last time (with a prior phone) I went 10 days without a cell phone after which time ZTE informed me the phone was damaged and ineligible for the warranty.  Take my word for it and do not purchase a Nokia Lumia 521 as it is without a doubt the worst phone I've ever had.", "Date": "January 5, 2014"}, {"Title": "No internet service!!!!!!!!!!", "Author": "De", "ReviewID": "R2APAYAXZFO2WX", "Overall": "1.0", "Content": "I received my phone on 11/04/13 and the internet has not worked since I brought it.  Call customer service everyday and went in the Metro cell phone place and I still don't have internet service.  Returning this phone as soon as I can find a phone that works.", "Date": "November 18, 2013"}, {"Title": "unbreakable POS, DO NOT BUY", "Author": "michael", "ReviewID": "R2LCMKM9NVS9IG", "Overall": "1.0", "Content": "hate the entire phone, especially the part where you can throw the phone 25 ft and have it hit a wall, without a case on it, and not damage the phone at all. you have to have talent to break this, and that would be fine if it was nicer and formatted better, and every app costs even more for this than it does for apple. trying to find an idea on how to \"accidentally\" break it, just so I have an excuse to get the SIII", "Date": "February 6, 2014"}], "ProductInfo": {"Price": "$109.98", "Features": "Display: 4-inches\nCamera: 5-MP\nInput: Touchscreen\nOS: Windows", "Name": "Nokia Lumia 521 (Metro PCS)", "ImgURL": "http://ecx.images-amazon.com/images/I/41jBNDMTGcL._SY300_.jpg", "ProductID": "B00F9S94R8"}}