{"Reviews": [{"Title": "very unsatisfied", "Author": "Bria", "ReviewID": "R29C28CTV6FHVM", "Overall": "1.0", "Content": "When I received this phone it was already activated to another persons name so I can not put in on my account as I wanted to. I either want the phone deactivated or my money back I am very unsatisfied with this product. I have went to three sprint stores and they have all said the same thing to me in such this phone is most likely stolen, if so I want my money back as soon as possible.", "Date": "January 10, 2014"}, {"Title": "Very Pleased", "Author": "Blake", "ReviewID": "R2VRBUYCKEXVS1", "Overall": "5.0", "Content": "I just got my new iphone 5s Today it came in the iPhone 5s gold box and looked brand new! Everything is in tact no scratches or any screen problems at all! Shipping also came very early. My predicted shipping was 5-110 days after my purchase and it came two days from after i put my order in!", "Date": "March 15, 2014"}, {"Title": "Still in love", "Author": "Cutenchunkiimami", "ReviewID": "R3HGYZ2GGIXGTX", "Overall": "5.0", "Content": "I had the iPhone 4S before and was waiting to upgrade to a newer version but didn't really see the need with the iPhone 5, I'm so glad I waited because I'm in love with my new phone. It came just as it was described and the seller communicated with me in reguards to any questions I had, I would deffenately buy from this seller again in the future.", "Date": "January 2, 2014"}, {"Title": "VERY PLEASED", "Author": "Rachael", "ReviewID": "R197TF9T305IFC", "Overall": "5.0", "Content": "I bought this iphone the other day and I am absolutely in love. Everything came as described. I had the iphone 4s prior to this phone and was inneed of a upgrade, Im very satisfied with the iphone 5s, battery lasts much longer and the camera is way better on this phone. I recommend people to order this phone from here, it really is worth it!", "Date": "January 13, 2014"}, {"Title": "I love it !!!", "Author": "Schonsteienfeger", "ReviewID": "R20JN2P3W58FMT", "Overall": "5.0", "Content": "I love it !!! After just 3 days it was here, everything works excellent and I'm just in love with my new iPhone !!", "Date": "January 30, 2014"}, {"Title": "Love this phone!", "Author": "Kadycakez", "ReviewID": "R1AN0FQA28ZFC6", "Overall": "5.0", "Content": "Great phone! I've had the 4 and the 4s and the 5s is amazing! So slim and fast and there is definitely a BIG difference in the phone compared to the 4/4s. Absolutely love apple and iOS 7. And I'm in love with the gold color!", "Date": "February 11, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FG9VTGE"}}