{"Reviews": [{"Title": "A great smartphone and the best camera out there.. (4.5/5)", "Author": "ManiS", "ReviewID": "R3ISMFV7DARG7X", "Overall": "4.0", "Content": "Wow!I didn't buy this from Amazon (bought an unlocked AT&T; version from Negri and am using it in T-Mobile).  After years of iPhones, and after a frustrating IOS 7 crashes and freezes, I finally gave up on iPhone and went for a Nokia. Biggest attraction is, of course, the 41MP camera that I can use instead of lugging around a Canon DSLR all the time (now DSLR only for occasions that demand a SLR).First impressions:Pros:1. Windows Mobile has come a long way. It is quite stable (compared to iOS 7! Yes, really!) Interface, for the most part, is easy to use. There are only a few things that could have been better (listed under cons below)2. Surprisingly, AT&T; version has less bloatware too (and easy to uninstall/remove from the app list).3. Nokia Maps! You get free OFFLINE maps so you can really use it even in places without a cell coverage!4. Beautiful pictures, particularly without flash! Flash seems to add some color cast (but nothing too difficult to fix with picaso or photo shop/paintshop pro). Low light, without flash, turns out great photos that normally require a SLR.5. Right size for a good smart phone, great display (could be better with a better full 1080p resolution... but can't complain); netflix is actually watchable on this phone.6. Great wireless performance (gets 20Mbps download speed on LTE with T-Mobile).7. Call quality is great (this is expected of Nokia anyway)8. Speech recognition/control is quite good. While quite a few people like SIRI better, Windows version is not far off /bad; quite useable.9. Battery usage is quite good and comparable to other leading smartphones. I used to charge iPhone 4s everyday, while I am charging this about every 1.5 days.10. Comes with mobile version of Office (and of course, skydrive for cloud storage)11. Auto-complete feature of iphone while typing used to irritate me a lot. In Windows, they have done a smart thing: a rolling sticker row at the bottom shows the possible word options as you start typing; you just pick the right word. Even better, this gets better with your usage as it learns and improves its dictionary. After about a week, I only start typing a letter or two for each word, even for long emails. No more typos! Thank you Windows!Cons:1.  Windows - lack of applications. Not a big issue for me, but I still miss a few (shoutcast, webex for office use, paypal/square apps, and a few more...); there is no default stock market app etc..2. A little clunky (finish is not as good as HTC one/Sony Xperia/Galaxy 4 or iPhone 5S), and a little difficult to hold without slipping in the hand; solved by having a phone cover.3. Battery is not replaceable. For those who take lot of pictures (and flash) battery will be drained fast, but then if you buy the optional Camera grip, it comes with additional battery, so the problem is solved nicely.4. Windows integration of phone features and user interface has a few issues: - I couldn't find a favorite list for contacts (frequent ones I call) - several music apps are present (windows, at&t;, nokia etc etc..) and so you start playing with one of them, and after it auto-locks, I can't easily figure out and go to the app again. It took some time to figure out: keep pressing the left arrow in the lower left corner and it shows up the currently running tasks that you can slide and select for foreground. (I can list a few like this for iPhone too..btw)5. FM Radio could have been useful.. (Update: it is found in music+video and uses the plugged in headset wires as the FM antenna; good but still not that great - because I tend to use bluetooth headsets and with that there is no FM radio tuning)In all, I love this phone and haven't found any serious issue so far.Update 1/12/2014: I stil love it! New apps are showing up. After the last review, I got Paypal and Cisco webex apps now. I use them both and it is quite good. In fact, I can use webex while driving using data connection - which I had massive issues with iphone in Bay Area (that may be a bad sprint coverage; and sprint doesn't allow data and call simultaneously but taking the webex through data doesn't work well with sprint+iphone connection in this area; but T-mobile or AT&T;, I can do all this with this Nokia 1020.", "Date": "November 16, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F585PZM"}}