{"Reviews": [{"Title": "Best phone I have ever owned", "Author": "M. Clayton", "ReviewID": "R1A4S5KOZOOT41", "Overall": "5.0", "Content": "First thing I want to say is that there was an audio issue when the phone came out. However, it was fixed with a software update 2 weeks later. This is by far the best phone I have ever owned. Previously that title went to the Note 2. It has a long lasting battery, an unbelievable HD display, an easier than ever to use stylus, and an infared remote control that can control any tv and cable box. Disregard previous negative comments about the audio issue. This is the phone to buy. It is a 5 out of 5 start phone.", "Date": "November 9, 2013"}, {"Title": "My perfect phone", "Author": "Ashton P. Johnson \"Zepaw\"", "ReviewID": "R2VS4RH4MY0EI4", "Overall": "5.0", "Content": "I've been a fan of the bigger sized phones for some time and Samsung has been paving the way in terms of quality large phones. I remember when I had the 4.5in screened Samsung Infuse and it was considered large. I've had a Note and Note 2 and loved both. Note 3 continues the tradition of keeping everything that worked, improving where needed, and adding features I wouldn't have even thought to ask. So many of the little annoyances I had with my Note 2 have been addressed.  Its clear they put a lot of thought into finding out what people loved and wanted changed.When I first held the phone I fell in love. The form factor is just great and the screen is a noticeable jump up. That's saying something when the Note 2 already had a stellar screen resolution. I don't feel the need to have this one in a case. The slippery back of the Note 2 required a case as I dropped it a couple times when holding it bare.Rather than go on feature by feature I'll suffice to say everything feels like a great and noticeable improvement. S-pen, camera, screen, on and on its the phone I loved before but better in every way I could have asked for. I've tried dozens of smartphones over the past 5 years. The Note 2 was the first one I actually held onto for a year. I easily see myself holding onto the 3 that much or longer (depending on when they bring out a 4th ;) ).I highly recommend this phone.*Update a week in. I'm still just as impressed with this phone if not more so. The biggest thing I've found since my review is how much battery this phone offers. The battery size is insignificantly larger than the Note 2 which means they really improved the performance greatly to have increased battery efficiency this much. With the Note 2 most days of average us (lots of music streaming but not much else) I'd be about out of battery by end of work 5pm-ish. Now I'm at around 50%. I can make it through a full day without charge using the phone a good amount throughout. I did a test a couple days ago purposefully trying to drain it as fast as possible. Screen on high brightness near continuously while downloading several GB of data over 4G and it lasted over 6 hours! I remain extremely happy I got this phone.", "Date": "October 4, 2013"}, {"Title": "Sprint resolved the sound quality problems with Note 3!", "Author": "Suresh Varala", "ReviewID": "R3Z63PJ6WKZSH", "Overall": "5.0", "Content": "I loved this phone from initial go but as many complained, I had issues with voice quality issues too on Sprint network.  Last night I received the firmware update (N900PVPUBMJ4 - 29MB) to my phone, and made couple of calls earlier and I no longer have voice quality issues!  Go for it!", "Date": "October 28, 2013"}, {"Title": "Freaking Amazing!!!!!", "Author": "BigDawgATL", "ReviewID": "R1KDNAFGV00Q7Q", "Overall": "5.0", "Content": "Don't know what the others are having problems with, sorry to hear it but my call quality is great! In addition... the phone it self is amazing! Have several in my office who have already switched from their new I-phone 5s's to the Note 3 after seeing what it does. It may seem large at first, but you get use to it quickly. Considering it allows me to leave my note-pad behind, that I have been carrying around for over 20 years, I actually gained pocket space... a whole empty pocket. I am in sales so I have to be able to take notes on the fly, stock numbers, customers names, pricing etc. This thing is a God-send! I live in Roswell GA so the 4G-LTE service from Sprint is great. Buy this phone... you won't regret it, but be sure to learn all it will do. It will amaze you! It will pay for itself in productivity gains. Just being able to make a call, or bring up a calculator, or web surf while staying on the page you are already on, or e-mail, text etc. will reward you. Write notes on the screen w/out leaving the screen you're on. WOW!", "Date": "November 8, 2013"}, {"Title": "An Amazing Phone with ONE MAJOR PROBLEM", "Author": "eskay", "ReviewID": "RMVWCMPP45382", "Overall": "1.0", "Content": "I'll start off by saying I've had these Sprint phones:The Galaxy S2, the Galaxy S3, the Note 2, and now the Note 3.Maybe Samsung and Sprint have a thing about having problems every other generation. One of the reviewers alluded to the fact that their S2 Epic Touch was basically unusable for GPS/Location services along with a host of other problems. This is true because I had the same issues. When the phone was upgraded to Jellybean from Gingerbread, battery life was 2-3 hours and there's tons of information online about how Sprint and Samsung basically failed to support that phone and/or fix it's issues.I ended up selling it and bought a Photon which served me well until I got a S3. The S3 was great and I passed along to a family member when I got the Note 2. The Note 2 was by far the BEST phone I'd ever used. It eliminated my need for a tablet and I pretty much turned on my laptop in the rare instance that I needed a full 15 inch screen for work. That's how good the phone was, with amazing battery life, solid performance, and an absolutely reliable background. The only thing that disappointed me was the screen resolution...it was good, but it wasn't great when I compared it next to the HTC One or S4.I was so excited for the Note 3 that I sold my Note 2 for $400 and bought the Note 3 off contract for $700. I figured the $300 I was paying was equal to what I would have paid if I had an upgrade that was available. Initially I was in awe of this device. It was everything that the Note 2 was, but improved. I rarely make calls because I usually use messaging so I didn't expect anything to be wrong with the most basic part of the phone. This past week, I've had to make quite a few phone calls for work and that's when I noticed the problems. I looked up, \"Sprint Note 3 call problem\" and ran into a slew of forums and websites stating this issue.On one Android specific site, the reviewer even said that during his review period, the phone made flawless calls. Just this past week, he hasn't been able to make any calls.This may be a software/network issue but Sprint seems to be completely dropping the ball. There's no reassurance to the people who bought this phone and they strangely deleted a thread on their own community forum that they started, which basically said they were looking into the matter. Now, why would they go through the trouble to post that, and then delete it the next day?This is a fantastic device, but it's not a phone. A phone is something you can make and receive calls with. As it currently stands, you can't with this version of the Note 3. Check online and research before you buy this. I'm unable to return my phone because I bought it off contract and am hoping a fix is issued. If that happens I'll change my review, but until then STAY AWAY!", "Date": "October 12, 2013"}, {"Title": "Be Aware of this issue before you purchase sprint note 3", "Author": "Michael", "ReviewID": "R1PL9S6OK0P33M", "Overall": "1.0", "Content": "Lakewood CA. Yes the Android Google side of the phone is Awesome but .....I have excellent 4G lte now... thanks sprint!  I have had the note 3 for 3 days and on 100 percent of the calls i have the horrible popping crackling distorted digitized dropped segments of voice and now some dropped calls too.  I haven't dropped a call on my end in a couple years.... but when I call a land-line on my new Sprint Note 3 and it drops it must be your cell right? I really like this phone but.... I use the phone for business and its pointless to continue with the note 3 when i dread a customer incoming call or outgoing as i know that i will have to have them repeat almost every sentence as a few words will be unrecognizable and important such as addresses, phone numbers and job description.  I hope with the help of the community this issue will be quickly resolved.... Thanks everybody!There are several forums with many sprint note 3 customers having this problem.  sprint.com and XDA forums do a search on Sprint note 3 garbled voice and you will find them. http://forum.xda-developers.com/showthread.php?t=2471286Sprint Site  http://community.sprint.com/baw/message/651391#651391latest review site documenting the issue...  http://www.androidheadlines.com/2013/10/sprint-galaxy-note-3-reporting-serious-call-quality-issues-dropped-calls.htmlShannon pm sent", "Date": "October 11, 2013"}, {"Title": "Exceptional Phone", "Author": "Kelly DeGuzman", "ReviewID": "R3MIVQWQ97JXXV", "Overall": "5.0", "Content": "I don’t normally write do many reviews.  I have been keeping up on the post here and was very reluctant to purchase the GN3 to replace my GS3.  I ordered from Amazon w/ 2 year contact $249 no tax and no shipping fee.  So I saved more then $100 dollars.  I ordered on 10/17 and received it on 10/21, can’t beat that.  I have made several calls and for long periods of time and so far so good, not having any of the issues mentioned.  I will update if I have any issues.  Without these issues the phone is exceptional, but then again I’m only on day 2.  I am sorry for those who are having issues.  In Florida by the way, if that helps anyone.FYI, did not use One-up Program, do not like it.  I have 4 phones on my account and love my Everything Family Plan and did not want to change it and besides I am the only phone geek in the group so I used my son’s upgrade and then just swapped phones after I activated it.  I used the on-line chat to accomplish this and only had one issue because we had to update the profile.  It did not take very long and the operator was nice.I hope this helps..", "Date": "October 22, 2013"}, {"Title": "All of the iphones suck!", "Author": "Sean \"sti turbo hyped\"", "ReviewID": "R27LB388XDBJ8U", "Overall": "5.0", "Content": "For those of you that are die hard iphone fans and will not even look at another phone: WAKE UP!  The iphone is at least 2 years behind in the electronics curve.  They are outdated buy the time they are released.With that being said I went from a galaxy s2 (which still has more features than the current iphone) to this beast.I am very happy with my purchase and reviewed several other phones before buying this one.  Look no further.  This is the most powerful phone on the market right now 10/23/2013.  You will not be disappointed.  Buying it on amazon is the easiest ever.  100 bucks cheaper than the sprint store.  It arrives, you turn your old phone off and your new one on and you are done.  No talking to a customer service rep or anything like that.What are you waiting for??  Another outdated iphone release??", "Date": "October 23, 2013"}, {"Title": "Best phone i've ever own.", "Author": "392guy", "ReviewID": "R1NSTOZFVEB36Y", "Overall": "5.0", "Content": "Pretty good phone.  After going to best buy and other stores in my area.  I learned that it was 100 more in the store then on amazon.  Needless to say I got it off of here.  Did about 2 weeks of reading reviews to make up my mind on what new phone to get. Phone is great.  I still dont really know all the stuff that its does and had it over a week. I have yet to run into anything that will slow this phone down game wise.  Also I have no ideal why people are saying there call quality sucks.  Mine is clear as day.  So if your in the market for a top of the line phone that will last you to the end of your contract and then some this is the phone to get.  When i find out what the rest of this phone does i'll give a more detailed review in a couple weeks.", "Date": "November 10, 2013"}, {"Title": "LOVE this phone!", "Author": "B. Janiak", "ReviewID": "R27WSHCMT02411", "Overall": "5.0", "Content": "Super duper fast, LOVE the S pen and the size takes a little getting use to it - but overall - I am very very happy with this phone!", "Date": "March 14, 2014"}, {"Title": "I LOVE IT!!!!!", "Author": "blkformula", "ReviewID": "RY1H7R17M5NGG", "Overall": "5.0", "Content": "I wanted this phone before it came out in Oct. 2013! I have been able to upgrade my phone since 2012 but held out overlooking the Note 2 to get  the Note 3.  The graphics are great! The speed is amazing and voice commands are out of this world!  It did not take long for me to  work my  way around the phone and I am still learning which is great. I love how easy it is to sync via bluetooth to my car and tv! I can only imagine what the Note 4 will be like!", "Date": "March 21, 2014"}, {"Title": "Samsung Galaxy Note 3 - Excellent!!", "Author": "Fernando Oglivie", "ReviewID": "R31KHXZGC2R2EA", "Overall": "5.0", "Content": "This phone is exactly what I was looking for.  It is huge!!  I enjoy the big screen and the speed of it's processor.  The phone is thinner than the predecessor and a bigger battery.  Come to papa!!", "Date": "December 18, 2013"}, {"Title": "Horrible call quality", "Author": "grd117", "ReviewID": "R2WSD6SGBPOGFO", "Overall": "2.0", "Content": "I bought the GN3 on release date, i am on my third device since, and still experiencing crackling,chirps,bleep and morphing noises while on call. Besides this problem the phone is very good.", "Date": "October 12, 2013"}, {"Title": "my note 3 works well on sprint", "Author": "td", "ReviewID": "R50CZ3GDLM1QY", "Overall": "4.0", "Content": "I've been reading these reviews on Amazon about how bad this phone is on the Sprint network. I haven't experienced any call problems or dropped calls I did roam a couple of times. Can't say to much about the wifi issues because I live in a dead zone and we're always having wifi issues in my house. But when I was over my sister's house my phone connected and stayed connected to her wifi.Unfortunately most phone comes with  problems.sounds like a bunch of defective ones got out. But as for me and my note 3 the only thing I find horrible is the quality of the speakers for a phone this size I would think the speakers would be louder.I have no problems with s note, multitasking works well and is very fluid, call quality on my note 3 is good , I'm not having any  of that gargling,popping, cracking sounds that others are experiencing, swype keyboard is smooth, photo taking is good, videos are crisp with vivid colors.the remote control feature works great, so does gestures.In a nutshell I love my note 3 it's a step up from my note 2 , my next purchase will be the galaxy gear. I'm sure with a new update issues that are arising will be addressed.", "Date": "October 14, 2013"}, {"Title": "Multiple Returns of Note 3 \"El Problemo\" (phone nickname)", "Author": "John", "ReviewID": "R15ODIAVWF8YHW", "Overall": "1.0", "Content": "Nationwide Sprint edition of the Note 3 is problematic and non-functional as a phone. Garbled, cracking, popping, voice frequency morphing, tinkling and call dropping. Wi-Fi hangs on \"identifying IP address\" and or \"can't connect, signal strength too weak\" all while my LAPTOP is connect to the same Wi-Fi at \"Excellent\" signal strength and speeds (sitting right next to \"El Problemo\" [Note 3]). Lagging on simple app games (like Atomic Bomber) where my Note 2 doesn't. Laggy touch wiz interface. SNote has major text entry problems, quirky and buggy. You cannot transfer native \"phone\" calendar info from a Note 2 to Note 3. Kies 3.0 (New Note 3 compatible version) won't see/recognize prior Kies backups, nor does the Smartswitch app support native phone app info syncing. So, if keeping your prior native phone data is important, you'll be out of luck (yes, Samsung released a buggy phone which had no means to receive Note 2 native phone app backups. You'll also loose all your SNote book covers as SNote for the Note 3 is not compatible with the Note 2 (but the raw Note 2 data will sync with Smartswitch to the Note 3... You'll just loose all your formatted covers). Nada on the Note 2 native phone calendar entries.There's no way to get them to the Note 3 unless you manually change all your calendar entries to a Google or Samsung account. Also Google will only Sync a few months worth of Data. Thus, if you were leery of keeping your calendar on Google's or Samsung's \"might be hacked someday\" server, and saved your info to the native galaxy note 2 calendar app instead, you're outta luck getting your calendar info onto the Note 3. Some thanks for using native \"Note\" apps eh? There are a slew of other El Problemo (Note 3) Issues. Just Google \"Note 3 Issues\" or go to the Sprint Community website and search the same text. Don't get this phone! Trust me. I'm on my third one.", "Date": "October 12, 2013"}, {"Title": "This Note is a great phone to upgrade from the Samsung Galaxy S3.", "Author": "W. R. Blair", "ReviewID": "R2K20D2CA5ETCG", "Overall": "5.0", "Content": "All the good things you have heard about this phone are true.  I had a Galaxy S3 before this phone, and the Note III improved on it in every way.  It's not as slippery, which means it never falls out of my pocket.  The battery lasts about 3 times as long as my S3 but charges in about a quarter of the time.  The processor is powerful enough for every app and it loads web pages much faster than the S3, about as fast as my laptop computer.  If you are thinking of upgrading from an S3, you will enjoy the Note III.", "Date": "March 27, 2014"}, {"Title": "Best android I've had so far", "Author": "T'andre", "ReviewID": "R31REL96WZA3IR", "Overall": "5.0", "Content": "I was use to the galaxy S series phones and after a while they got slow and laggy for no reason. Also the battery life on older those S series phones got worse over time. This phone on the other hand is still going strong, it chargers really fast, and sometimes I can go through out the day without charger it until night time.pros- 1080p  great sound quality  32gb (without sd card)  smart screen (eye recognition)  motion control  voice control(has gotten closer to iphones \"siri\") Very good/useful  battery>other samsung phones  fast charging  Came with 50gb for dropbox (2years) when i bought it from amazon  dual screen applicationsCons  I still cant find any", "Date": "January 22, 2014"}, {"Title": "The professional reviewers were right; this is an excellent device.", "Author": "Patrick English \"West Coast Pat\"", "ReviewID": "R17XT7TMHFS1PQ", "Overall": "5.0", "Content": "In researching my options for a new phone, I read many very positive reviews of the Galaxy Note 3.  I was intrigued but not sure if I wanted a \"phablet.\"  I went to the Sprint Store to try the phone on for size and performance and realized it wasn't so large as to be cumbersome, while still providing an excellent viewing and use experience.  In comparing the screen resolution with the iPhone 5 it was clear that the Note 3 had brighter colors, more clarity and was simply sharper.  The processor is very fast with no lag time and the ability to run multiple applications on the screen at the same time is highly useful.  I haven't used the S-pen much yet but the apps designed for it look promising.If you are looking for a top-end device and open to any of the three top operating systems, try the Note 3 side-by-side with the iPhone and top Windows Phone handsets and I think you'll find Samsung makes the best device.", "Date": "December 31, 2013"}, {"Title": "awesome", "Author": "irma rodriguez", "ReviewID": "R34JBKABY9NEHW", "Overall": "5.0", "Content": "Love this phone. Love the big screen. Features are amazing. Camera is high quality.  This phone will not disappoint...great phone.", "Date": "December 31, 2013"}, {"Title": "My Shiny New Ph-ablet!", "Author": "R. Collier", "ReviewID": "RJEEPQGC65MST", "Overall": "5.0", "Content": "I just brought this phone 12/11 and recieved it 12/13 it is an awesome reliable device with great battery power! I charged the device on Friday and did not have to charge it until Sunday evening, this is with use of 4GLTE, 3G in some spots and Wi-Fi for a few hours. The interface is the same as the old familiar Samsung, so its easy to navigate and the S-pen features have definitely been upgraded. I love using the feature called Scrapbooker and Action Memo with the S-pen, really make this device a solution for when you need a pen and paper and you can't get to it. The Super AMOLED  display is BEAUTIFUL to say the least, very crisp , clear and color saturation is excellent. Things that are ok is the camera quality, I fail to understand that with a phone with this type of technology that they did not put an optical image stablization to allow the camera to capture clearer photos. Don't get me wrong the Note 3 boasts a nice 13 MP camera but if you are not standing still you will not get a good , quality photo. Another thing I don't like is the faux leather (plastic) piece in the back of the phone, it really cheapens the phone to throw plastic leather like material on it.Overall I love this phone it's definitely a great device, also the call quality is superb, there are alot of reviews here talking about call quality, well believe me they have fixed it this is coming from someone who uses at minimum 100 mins a day!", "Date": "December 17, 2013"}, {"Title": "PERFECT FOR THOSE WHO REALLY WANT TO MULTI-TASK! SUPER FAST & SMOOTH!", "Author": "Walk3rt", "ReviewID": "R1WASAC3BCQ7HT", "Overall": "5.0", "Content": "This device ROCKS!!! GET THIS BAD BOY IF YOU LOVE TO MULTI TASK WITHOUT DELAY OR PROBLEMS! THIS THING IS SUPER FAST, MINUS THE IFY SPRINT SERVICE NETWORK, BUT ROARS ON WIFI!!! THIRE IS NOTHING THIS BEAST CANT DO! THE SIZE IS PERFECT TOO. I keep mine in my pocket all day, no issues. Love the s-pen feature, now I can jot down all my spontaneous ideas, plus I love being able to write fluently as if I were writing it down on a piece of paper, SUPER SMOOTH!! THIS IS BY FAR MY MOST FAVORITE DEVICE YET!!  HIGHLY RECOMMEND IF FINANCIALLY-ABLE?? 5*s!", "Date": "December 16, 2013"}, {"Title": "autocorrect where are you?", "Author": "Michelle Winegardner", "ReviewID": "R19O9LCRRBCA2X", "Overall": "4.0", "Content": "Only 4/5 because the autocorrect features are nonexistent and search of the S2 was far better. Otherwise happy with the phone.", "Date": "December 12, 2013"}, {"Title": "I can dig it", "Author": "Brandon J Willis", "ReviewID": "R1L6C3W27T61BQ", "Overall": "5.0", "Content": "Even though I'm still learning how to use it, I couldn't be more satisfied with the price i got it for! No bs, I was in the sprint store and they tried to charge me an arm and a leg to upgrade. I ended up ordering it from an iPad right there in the store and it was $199 originally, but I believe it was because I did order from an iPad on amazon that the price dropped to $124.99. Of course it was with a 2 year contract, but I can't complain! It came fast and I wasn't expecting headphones, but it had everything it would normally come with. #satisfiedcustomer", "Date": "December 11, 2013"}, {"Title": "GLORIOUS", "Author": "C. Kneip \"Running Enthusiast\"", "ReviewID": "R3HFU87CWFP4E7", "Overall": "5.0", "Content": "Huge Amazing Screen / Fast and able processor / spectacular battery life / Great LTE Radio: ARE YOU NOT ENTERTAINED?No seriously this is the best giant cell phone ever. The only other phone I'd consider is the HTE One Max. It is not as well built, but it does have a triband Sprint Radio and better speakers. Also no removable battery which can be a deal-breaker.Also this comes with all the standard Samsung Bloatware no one will ever use. It's a little gross but easy to ignore.", "Date": "October 31, 2013"}, {"Title": "BUYER BEWARE if buying on SPRINT !!", "Author": "That Guy B", "ReviewID": "R16ZLWPHO2FZCI", "Overall": "1.0", "Content": "This phone is amazing hardware wise. When using it for data and media consumption it's an awesome phone. I have two of these devices, but am unable to return them as Sprint wants to charge $36 restocking fees for defective phones.The problem is using it as an actual phoneRead this:[...][...][...]Sprint has yet to respond to consumers, nor has a fix been put out.If you plan on using your phone as a phone, then skip this or wait until the software is properly updated.Otherwise you're basically buying a tablet because phone calls are horrendous.", "Date": "October 11, 2013"}, {"Title": "AMAZING 10 OUT OF 10", "Author": "Moe", "ReviewID": "R21FTNRUBNIYA4", "Overall": "5.0", "Content": "Coming form the Note 2 here are my Pros and ConsPros:- Amazing screen; Great Clearly- Big improvement in battery life coming from the Note 2- S-Pen a lot more easy to use then with the Note 2- All round faster and more crispy on command then the Note 2- Has a premium feel to it, a lot better then all the current Galaxy line(GS3, GS4, GN2)- Camera is a big improvement much faster and cleaner looking pictures- Feels lighter and smaller then the Note 2- A lot of free memory; 26 out of 32 GBs useable out the box.- The Note 3 takes about a hour to go from 0% to 100% full chargedCons:- Sometimes you get a wired feedback during calls.Overall I would recommend this phone to anyone I give it a perfect 10 for what I use it for.", "Date": "October 23, 2013"}, {"Title": "do your research", "Author": "Jonathan", "ReviewID": "R2JC1BOPDVVJ5G", "Overall": "1.0", "Content": "everyone do your research all you have to do is google note 3 call quality and you will see how this PHONE has horrible call quality that makes it impossible to actually is this phone as a phone.im sorry if you cant post links but here is a thread all about it so far its up to 12 pages of people complaining about the same thing.[...]", "Date": "October 13, 2013"}, {"Title": "A Technical/Hardware Masterpiece", "Author": "Johnny Saigon®", "ReviewID": "RBN26DVEEM4YY", "Overall": "5.0", "Content": "Last year I owned the Galaxy Note 2. I thought it was a near perfect phablet, except for just two main areas for improvement: Screen resolution/sunlight legibility, and after a while there was noticeable slowdown after too many apps were installed. Now that I have the Note 3, things are getting very very interesting....Lets do this review by bulletin points for easier viewing:PROS:1) The biggest and most obvious different when you first pick this up is the screen. There are a handful of improvements:* The resolution has been upgraded to 1080p(from 720p). You can noticeably tell that it is crisper.* You will also find out that it is a bit brighter. For us geeks, that means Samsung has upped the brightness levels to an incredible and unheard of 660 cd/m2 max(when auto brightness is turned on).* Sunlight legibility is MUCH improved over the Note 2. However, it is still not as good as the HTC One's screen. The Super AMOLED has AWESOME contrast levels(velvety deep blacks). As a whole however, and because of its Pentile pixel system, it comes just a bit short of the HTC One's Super LCD 3. It is really nitpicking though, so you won't ever regret this.2) This phone flies, almost literally. The Samsung Exynos Octa-core/Snapdragon 800 processors mean this thing will hardly ever lag, and 3GB of RAM means you can multi-task to your heart's content!3) Improved S-Pen hardware/software mean it's no longer a gimmick gadget from the original Note. Too much to describe all the functions, and you can do without it for most functions. But business users will really appreciate this once you work on productivity/design apps.4) All those software features! Granted, you can do without most of them for day-to-day things, but being there nonetheless means it will improve your ease of use. The are also too many to go through all, I but what I love most is the Smart-Stay, which uses the front camera to monitor that you're looking at the screen and won't dim/turn off, which is super duper useful for when you are reading the news/web pages, etc., holding the phone up with one hand, and your other hand is pre-occupied. No more having to shuffle around to tap the screen when it auto-dims to bring the brightness back up. This is especially and specifically useful for me when I'm reading in bed on my Pulse News app.5) The sound is noticeably louder as well. It doesn't have that immersive stereo effect of the HTC One's dual stereo speakers, but by itself it is louder. This is useful when you are in a noisy environment, and having one loud speaker is more useful than having two immersive speakers that are softer and harder to hear. As good as the HTC One sounds, I hate that for most things like music and video, it is so darn soft and frustrating. I now appreciate this one loud speaker setup more for regular everyday outdoors use.6) Having a huge battery means I can do whatever the heck I want with it, and even after heavy use I can still not have to charge it until I'm in bed at night. The one thing that frustrates me most about the HTC One is this very flaw - I literally have to be near a charger/portable charger ALL THE TIME. I just use it to read the news for about 30-40 minutes and 20% will already be gone. And when I charge it, it trickle charges like a turtle! With the Note 3, being able to replace the battery is an added plus, and the USB 3 port means it can charge very quickly. But even these two advantages cannot compare to the simple fact that it has a huge-capacity battery in the first place.CONS:There are few things you can nitpick, like the design/material quality - for a flagship device it still feels a bit chintzy, not like the premium look and feel of the HTC One or even the Sony/Nokia phones. With rumors of a new Galaxy line, this may be changed very soon though. Also, the Touchwiz user interface can be hit or miss. It's not for everyone, that's for sure. Luckily, being Android means we'll never have to settle. My recommendation - especially if you like the simple/minimalistic look, is Smart Launcher Pro. Try the free lite version and see for yourself.I can't think of much else really to fault this phone, except for the fact that simply for what it is: It's a niche machine that's half tablet/half phone - it will never satisfy you as a tablet replacement(I feel the perfect size for video/game usage is the 8-9 inch range), and it will frustrate you as a phone because you can never comfortably hold it, and do all the things you need one-handed(I feel the perfect size for a PHONE is the Apple 5/5S). But if you can compromise to this form factor and accept it for what it is, then there is no better alternative. This is a nearly flawless phablet with an brilliant screen, powerful hardware, useful software, and awesome battery life.", "Date": "October 12, 2013"}, {"Title": "Absolutely love this phone!", "Author": "Socrates", "ReviewID": "RWL0CC2J8XK2Y", "Overall": "5.0", "Content": "Upgraded two lines on our family account with this phone!  Both came in extremely fast and in perfect condition.  Many reviews for the sprint variant of this phone say that they experience terrible call quality that is almost unbearable.  I'm lucky enough to have no problems what so ever on the two we ordered.Everything about this phone is heavenly.  The specs give me a total nerdgasm.  The camera, s-pen, screen all work flawlessly and I have nothing bad at all to say about the phone.Hope you can enjoy yours as I do mine.", "Date": "October 16, 2013"}, {"Title": "Garbled Voice", "Author": "S. Williams", "ReviewID": "R1NFA9LKTB2FJK", "Overall": "1.0", "Content": "Just got a pair of Note 3's on Friday and they worked great until today. Both phones are experiencing audio issues. Both phones have chirps, buzzes, cutting in and out and garbled transmissions & reception. We have Sprint versions. We went through 3 phones for my wife's phone today at the Sprint store and still no luck. The manager said he had one with the same problem yesterday. He said that Samsung is shipping out more phones for this known problem. He also said this is affecting about half the phones shipped and with every carrier. This is doesn't sound good at all. Looks like it's a nationwide issue too. Maybe I should have waited!!Tucson, AZ", "Date": "October 13, 2013"}, {"Title": "This is a great phone!", "Author": "londongirl \"londongirl\"", "ReviewID": "R28ANWF8T4362W", "Overall": "5.0", "Content": "I have not stopped using all the functions from I got this phone. I can surf the net faster and smoother. All the apps are easy to navigate. I use the pen sometimes, it is very handy. Now that I have this phone, I can never go back to a small regular phone, the screen is large, but not too large that you cannot hold the phone in one hand. I love the large screen, it is much better to surf the internet on a bigger screen. I would recommend this phone. The only issue I have is the volume is a bit low. I have to use the volume boost button.", "Date": "May 4, 2014"}, {"Title": "A Note 3 for Me!", "Author": "Mz. Timmons", "ReviewID": "R1FB1C96GZAJ9L", "Overall": "5.0", "Content": "I absolutely love my new cell phone.  It is totally an upgrade from the HTC EVO 4G LTE. I am now and forever a Samsung fan!", "Date": "April 23, 2014"}, {"Title": "My Daughter loves the phone", "Author": "Chewy61", "ReviewID": "R2J3BBN93I51YR", "Overall": "5.0", "Content": "This was a much easier and less expensive process than going through Bestbuy or Sprint.  We will purchase all of our new phones through Amazon.", "Date": "April 16, 2014"}, {"Title": "For me", "Author": "Ronald E. Browne", "ReviewID": "R3ECGLNWR1K5WJ", "Overall": "5.0", "Content": "All that I need, it is big, but not too big, I am still learning all of the qualities of the phone.", "Date": "April 4, 2014"}, {"Title": "LOVE THIS PHONE", "Author": "Desiree Logan \"handbag fan\"", "ReviewID": "R2227H0DFMS6NF", "Overall": "5.0", "Content": "Best samsung product so far!!! It works great. I had a Samsung Galaxy S2 and decided to get a Note for the bigger screen and updated apps. It works great. No complaints!", "Date": "April 2, 2014"}, {"Title": "Great buy!", "Author": "michele talley", "ReviewID": "R3I3QLPB1KFF0U", "Overall": "5.0", "Content": "I love this phone!I love the s pen and the apps for the s pen are awesome.Thanks amazon.", "Date": "April 1, 2014"}, {"Title": "Couldn't be happier", "Author": "Ashley Durham", "ReviewID": "R3TEKWJSS753QM", "Overall": "5.0", "Content": "I love this phone. I thought I would have issues with how big the screen is, but once you start using it everything else seems small by comparison. The applications run lightning fast and the functionality is mind-blowing. You can really customize it to do and be anything you want. I feel like I got a great deal buying through Amazon, even at the Sprint store they were charging at least $200 for this model. I seriously feel like I have a tiny laptop or tablet with all the power they packed into this phone.The only downsides are the fragility of the phone (looks one unfortunate drop away from being a paperweight), the pre-installed bloatware apps (some are useful and some not, but it comes with A TON), and the battery life (I'm usually around 20% at the end of my work day). In this case, though, the awesome power and coolness of the phone make it more than worth it.", "Date": "March 26, 2014"}, {"Title": "Almost my dream phone", "Author": "William D Scheidegger Jr", "ReviewID": "RB7O8NOZ9YQYH", "Overall": "3.0", "Content": "The screen is big enough that I was able to ditch my tablet. Some say the big screen is a downside, but since I always use my LG HBS-730 Tone+ Stereo Bluetooth headset with it, I don't count it as such.My only downside is that it has all the Samsung stuff pre-installed and there is no easy way to uninstall it. I wish I could have the Nexus experience on this hardware. I am moving from an open Google Nexus branded phone and the proprietary Samsung experience and it is not even comparable. The Google Nexus experience wins hands down. The Samsung hardware wins hands down. This is why the old Google Nexus S by Samsung did so well; the best of both worlds.", "Date": "March 13, 2014"}, {"Title": "Samsung Galaxy Note 3", "Author": "JESSICA CRUZ LEGARDA", "ReviewID": "R4MO8E0WR4CYW", "Overall": "5.0", "Content": "The price I got this for was amazingly affordable. Getting my upgrade at the Sprint store would of cost me double what I paid here at amazon. The option to upgrage here instead of at the store was a plus. It arrived quickly and I had a bit of a mishap on activation, but the reps at Amazon help fix the problem with ease. I am very impressed and will from now on search and buy phones for my family come upgrade time.", "Date": "January 7, 2014"}, {"Title": "Samsung is great", "Author": "yakima browne", "ReviewID": "R1EQGY68LAIT6R", "Overall": "5.0", "Content": "I love my Samsung note 3 I could watch my movies and control my Samsung tv with my phone as a remote control. Also with screen mirroring I could reflect what's on my phone on my Samsung smart tv. I love this phone its awesome. I also love the sensors for eye movement and hand movement. The phone is really big but still manageable.", "Date": "January 3, 2014"}, {"Title": "best phone ever!!!!", "Author": "Courtney Block", "ReviewID": "R2QGHMU8Y9I8UG", "Overall": "5.0", "Content": "I love this phone. So helpful. Works great for work and fun!!!!! Wish I had it sooner...Plus I got the Gear to make it better", "Date": "January 1, 2014"}, {"Title": "Galaxy Note 3", "Author": "end1109", "ReviewID": "R227X0AA38C4RK", "Overall": "5.0", "Content": "Awesome phone cool features. This is what I have been looking for in a cellphone.  Call quality is very good", "Date": "December 31, 2013"}, {"Title": "I love the battery life! I don't know how I lived without it", "Author": "Jeaneen", "ReviewID": "R1N976WJ1I2XJM", "Overall": "5.0", "Content": "I love the battery life! I love the battery life! I love the battery life! The phone is great with a lot of fancy functionality especially with the addition of the pen. It's my new boo. I especially love the fact that I can go longer than a day with regular use and still have a lot if battery life. When it does need charging it charges really quickly. It's a super phone. It detects my eyes, hears my voice, adapts to my style of writing & lasts long... worth the money!", "Date": "December 22, 2013"}, {"Title": "Best Phablet in the Market!!", "Author": "D. Gater \"dgater\"", "ReviewID": "R39Q59YNXR617T", "Overall": "5.0", "Content": "Awesome phone!  Since I acquired the phone, I can't keep my hands off it. Call quality is outstanding and graphics is Superb!Get this phone!", "Date": "December 16, 2013"}, {"Title": "My favorite Android device", "Author": "Mark S. Ragland", "ReviewID": "R3CE8CWXKUHR4K", "Overall": "5.0", "Content": "Best Android phone I have owned since my Note 2. I love that it now has ANT+ as a radio frequency protocol. I can now pair my ANT+ devices like my Garmin Hr monitor to it to better track calories burned on my workouts. I love the new functionality of the SEN and the screen is beautiful. Every aspect of this phone has been improved and it shows.", "Date": "December 8, 2013"}, {"Title": "Must have phone for every business User.", "Author": "Nick", "ReviewID": "RBONKV46YAW3T", "Overall": "5.0", "Content": "Has every you need plus more. Intuitive and very easy to use. Excellent phone quality and the S pen feature is a winner.  I will recommend this to any business user.  It beats any phone out there.  Puts Apple to shame.", "Date": "December 8, 2013"}, {"Title": "GREAT PHONE", "Author": "Lillian Hubbard", "ReviewID": "R319OOWCQBBBQ7", "Overall": "5.0", "Content": "I LOVE MY NEW NOTE GREAT FEATURES AND NO PROBLEMS.  I WOULD RECOMMEND TO ANYONE WHO ASKS ABOUT IT. TY", "Date": "December 5, 2013"}, {"Title": "Top Of The Line says it all!!!", "Author": "Larry Thomas", "ReviewID": "R1296ERAU3HYOF", "Overall": "5.0", "Content": "Everything I expected. Upgraded from Epic 4G Touch. Very fast & responsive. S Pen and features a major plus. Beautiful bright display. My hat off to Samsung. Performs flawlessly.", "Date": "December 2, 2013"}, {"Title": "Worst Phone I have ever owned", "Author": "John K. Hart", "ReviewID": "R22G4LS28PEQNL", "Overall": "1.0", "Content": "I have a Samsung Galaxy Note 3 that has several intermittent problems:1. The phone does not ring.2. It goes on mute for no reason or the same effect as mute as the listener cannot hear me when I speak. Listener thinks the call has been dropped and hangs up.  Most common thing I hear on my phone are “Hello?, Hello? , Hello? And “Are you there.”3.  If I put the phone in speaker the listener hears an echo whenever they speak.  It’s is so annoying that the listeners insist I take the call of the speaker function.I have never had problems with any other phone I have owned and I have used all the service providers at one time or another and have lived at the same location.", "Date": "April 5, 2014"}, {"Title": "Confused with phone quality", "Author": "Laura", "ReviewID": "R3TZ4AWXLPZ9KZ", "Overall": "3.0", "Content": "Me and my husband both got the same phones but different colors  and my speakers are crap. even at its highest volume you can barely hear the sound, where as my husbands phone speakers work great.", "Date": "June 9, 2014"}, {"Title": "Samsung Note 3 is great and I love it.", "Author": "Janice Hill", "ReviewID": "R184ZIHZPAV65Q", "Overall": "5.0", "Content": "Awesome!!! It is everything that I thought it would be. ..I have also recommended to others as well...Thank You very much. ..", "Date": "June 2, 2014"}, {"Title": "Awesone phone and form factor", "Author": "rpv", "ReviewID": "R196CCEZCSKEHE", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moI90L1UL3SZKOembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moI90L1UL3SZKOrefresh_preplay() {\n\ndocument.getElementById(\"cv_moI90L1UL3SZKOchiDiv\").innerHTML = document.getElementById(\"cv_moI90L1UL3SZKOhiddenPre\").innerHTML;\n};\ncv_moI90L1UL3SZKOrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moI90L1UL3SZKOso;\t   \n\n\nfunction cv_moI90L1UL3SZKOloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moI90L1UL3SZKOso = new SWFObject(swfLocation, \"cv_moI90L1UL3SZKOAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moI90L1UL3SZKOso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moI90L1UL3SZKOso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moI90L1UL3SZKOso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moI90L1UL3SZKOso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moI90L1UL3SZKOso.setAttribute(\"height\", swfHeight);\n          cv_moI90L1UL3SZKOso.setAttribute(\"width\", swfWidth);\n          cv_moI90L1UL3SZKOso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moI90L1UL3SZKOso.write(\"cv_moI90L1UL3SZKOflashcontent\")) {\n          fp_resizePlayerSpace('cv_moI90L1UL3SZKO', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moI90L1UL3SZKO';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moI90L1UL3SZKO', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moI90L1UL3SZKOloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moI90L1UL3SZKO\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1MVL755AEIKOP\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1MVL755AEIKOP\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R196CCEZCSKEHE\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1MVL755AEIKOP/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moI90L1UL3SZKOduration')) {\n      document.getElementById('cv_moI90L1UL3SZKOduration').style.display='none';\n    }\n    cv_moI90L1UL3SZKOloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moI90L1UL3SZKOloadSwf(movieID, playerVersion) {\n   return _cv_moI90L1UL3SZKOloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moI90L1UL3SZKOnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moI90L1UL3SZKO', 0, h);\n}\n\nfunction cv_moI90L1UL3SZKOresetPlayer(w,h,bw,cc) {\n  cv_moI90L1UL3SZKOnewHeight(h);\n\n  cv_moI90L1UL3SZKOso.addVariable(\"resetBandwidth\", bw);\n  cv_moI90L1UL3SZKOso.addVariable(\"cacheCode\", cc);\n  cv_moI90L1UL3SZKOso.setAttribute(\"height\", h);\n  cv_moI90L1UL3SZKOso.setAttribute(\"width\", w);\n  cv_moI90L1UL3SZKOso.write(\"cv_moI90L1UL3SZKOflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moI90L1UL3SZKORollOverImg = new Image();\ncv_moI90L1UL3SZKORollOverImg.src = \"http://ecx.images-amazon.com/images/I/81jqIwi-RhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moI90L1UL3SZKOpreplay = document.getElementById('cv_moI90L1UL3SZKOpreplayImageId');\nif (cv_moI90L1UL3SZKOpreplay) {\n  cv_moI90L1UL3SZKOpreplay.onmouseover = function() {\n    cv_moI90L1UL3SZKOpreplay.src = \"http://ecx.images-amazon.com/images/I/81jqIwi-RhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moI90L1UL3SZKOpreplay.onmouseout = function() {\n    cv_moI90L1UL3SZKOpreplay.src = \"http://ecx.images-amazon.com/images/I/81jqIwi-RhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moI90L1UL3SZKOpreplay.parentNode;\n\n  var cv_moI90L1UL3SZKOcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moI90L1UL3SZKOcurrentClick) {\n      return cv_moI90L1UL3SZKOcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:26 MinsNote 3 is an awesome device.  Check my video review for review of phone, some apps and GPS capability at the end. The resolution and real estate you have is mindblowing for a phone.  It is a very powerful device in your hands! I had Note 2 for a long time and our family is a big fan of phablets. Note 2 are still really good. If you have them and they work keep using them. Phones don't get obsoleted. The previous gen phones still make phone calls and take great pictures as they did on day 1. Both Galaxy Note 2 and 3 have Micro-SIM. I have played around with a Note 3 and using on a regular basis and it is gorgeous phone in itself. The following paragraph applies to buying unlocked phones..DISPLAY: Super AMOLED capacitive touchscreen.Note 3 has 151.2 x 79.2 x 8.3 mm (5.95 x 3.12 x 0.33 in) and weight 168 g (5.93 oz).Note 2 has Dimensions 151.1 x 80.5 x 9.4 mm (5.95 x 3.17 x 0.37 in) and Weight: 183 g (6.46 oz).Note that it has become slightly less taller and 15 gm lighter! This is great as weight is a very important factor in handholding and for long uses. Both the phones have excellent S Pen stylus.Note 3 has 1920 x 1080 pixels, 5.7 inches (~386 ppi pixel density).Note 2 is 1280x720 pixels, 5.5 inches (~267 ppi pixel density). Note the superb increase in resolution. This is great as Note 3 has full HD finally. For comparison, Galaxy S4 has 5\" HD Super AMOLED 1920 x 1080 display (441 ppi).MEMORY Both Note 3 and Note 2 has Card slot : microSD, up to 64 GB. Internal: 16/32/64 GB storage, Note 3 has 3 GB RAM whereas Note 2 has 2 GB RAM.WLAN: Wi-Fi 802.11 a/b/g/n, dual-band, DLNA (Both Note 2 and Note 3)Bluetooth: v4.0 with A2DP, LE, EDR (Both Note 2 and Note 3)NFC: Yes (both Note 2 and 3)USB: microUSB v3.0 (MHL 2), USB Host (Note 3, finally USB 3 on phones!)microUSB v2.0 (MHL), USB Host (Note 2)CAMERA:Note3: 13 MP, 4128 x 3096 pixels,autofocus, LED flash, Video 2160p@30fps, 1080p@60fps (Note 3, Note the substantially improved camera resolution)Note 2: Front: 8 MP, 3264x2448 pixels, video: 1080p@30fps, check quality; Back: 1.9 MPI feel for low light the camera did not perform well and this is an improvement I would like Samsung to make in low light sensors.Chipset:Note 3: Quad-core 2.3 GHz Krait 400 (LTE model)/ Quad-core 1.9 GHz Cortex-A15 & quad-core 1.3 GHz Cortex-A7 (3G model) Note 3 has Qualcomm Snapdragon 800 and if you see they have several technologies for different models.Note 2: Exynos 4412 Quad CPU: Quad-core 1.6 GHz Cortex-A9 GPU: Mali-400MPSensors: Accelerometer, gyro, proximity, compass, barometerGPS: with A-GPS support and GLONASSBATTERY: Li-Ion 3100 mAh battery (note 2) 3200 mAh (note 3)SAR (radiation level is often not considered in many reviews and it is an important level of comparison).SAR:Note 3 US Model: 0.55 W/kg (head) 1.49 W/kg (body)Note 3: EU Model: 0.21 W/kg (head)Note 2 US Model: 0.23 W/kg (head) 0.95 W/kg (body)Note that SAR ratings have increased for Note III version.Galaxy Note III is an awesome phone for its use cases. It is a delight for note taking purposes. I have used Galaxy S3, S4, Note II, Galaxy Tab 2/3 and I really love the Galaxy series. I can see the high end smartphones really getting saturated. For users with Note II or S4, I will not recommend upgrading unless you always want the latest and the greatest. You still have a great phone and it is not outdated just because Note III has come out. Your camera takes just great pictures as it did last month. Just like Detroit/Japan rolls out new cars every year, phone manufacturers have found excellent way to make yearly upgrades. If you have a different phone or a low end phone or you are from that iSomething world, welcome to Galaxy series!Battery life is good.  The video playback was crisp. Vendors like Samsung have added a whole lot of extra programs. I am not that annoyed with the Samsungware as I really like S-Health and some other apps. Mainly note taking apps are awesone.  People of course can root and put Cyanogenmod at some point later.I used to put a 64 GB microSDXC card SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging for video/song/ebooks.  I have since upgraded to 128 GB MicroSD and it works great! No stuttering, and very smooth playback of videos captured in varying light conditions (HD Playback; HD Recording). Compatible video types are AVI/DIVX, WMV/ASF, FLV, MKV, MP4/3GP, WEBM. HDR and Panaromic photos were incredibly sharp. Compatible audio types are: AAC, AMR, MP3, OGG, WMA/ASF, 3GA/M4A, FLAC, WAV. Google Music, PlayerPro Music player are producing excellent music.Note III infrared sensor is the same technology as TV remote control, so with WatchON you can change the TV channel from your phone. Games were very buttery. I tried several car racing games and performance was phenomenal.GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). Smooth and Stunning display! NFC works awesome. I use a Qi charger with a Qi wireless receiver and they work great as well.Some Extra Accessories:NFC has lot of use cases. I got the WhizTags NFC tags - NTAG203 Chip - 10 Pack + Keychain + Free Bonus Tag - Android Writable & Programmable - Adhesive Sticker Back - Samsung Galaxy S4 S3 Note 2 - HTC One First One X Droid DNA - Sony Xperia - Nexus - Smart Tags - Best Money-Back Guarantee! which is awesome. I use in conjunction with NFC Task Launcher App. Samsung also has TecTiles App. When I go to office I tap a NFC Tag to get the settings I desire - eg vibrate, wifi on etc. At CAR different instructions and so on.I tried following apps and they just worked awesome.Amazon MobileAndroid StatusAldiko Premium and Kindle Reading AppsAndroidifyAngry Birds (Space/Seasons)Asphalt 7Amazon App StoreBoxCar Maintenance Reminder ProChromeCNET TVNAVIGON (from Garmin - offline maps)Google Navigation/Earth/MapsGoogle Currents (nice way to read News)Draw SomethingGoogle DriveEbayLinkedinGoogle MusicTapatalk (awesome forum browsing app)OverDrive Media Console: Library eBooks & Audiobooks (public library consumption of media)Microsoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for Android (excellent twitter client)Twit.TvGoogle VoiceTemple Run series of gamesPlenty of WidgetsAPPENDIX: If you are comparing multiple phones, here is the quick highlevel breakdown of top phones as of mid 2014.In my opinion, following are key specs to consider when you buying a phone. Most of others are standard or does not matter at all. First size, weight and resolution are part of look and feel. RAM/CPU part of performance.  External storage is part of expandability. Camera is obvious! SAR (Specific Absorption Rating) is an often ignored, but I feel essential to making a buying choice. Manufacturers don't advertise or mention SAR prominently.phone parameters: {size, weight, resolution, ppi, RAM, ext Storage, camera, CPU, USA SAR rating}Samsung Galaxy Note 3 N9000: 5.95 x 3.12 x 0.33 in, 168 gm, 1080 x 1920 pixels, 5.7 in, 386 ppi, 3 GB RAM, micro SD upto 64 GB, 13 MP/2MP, Exynos 5 Octa 5420, Quad-core 1.9 GHz Cortex-A15 & quad-core 1.3 GHz Cortex-A7, SAR: 0.24 W/kg (head), 0.72 W/kg (body)Google Nexus 5: 5.43 x 2.72 x 0.34 in, 130 gm, 1080 x 1920 pixels, 4.95 in, 445 ppi, 2 GB RAM, no ext Storage, 8 MP/1.3 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.3 GHz Krait 400, 0.92 W/kg (head), 1.23 W/kg (body)Samsung Galaxy S5: 5.59 x 2.85 x 0.32 in, 145 gm, 1080 x 1920 pixels, 5.1 in, 432 ppi, 2 GB RAM, microSD upto 128 GB!, Qualcomm Snapdragon 801, MSM8974-AC Processor: Quad core, 2500 MHz, Krait 400, 0.63 W/kg (head), 0.82 W/kg (body)Samsung Galaxy S4 (Intl version): 5.38 x 2.75 x 0.31 in, 130 gm, 1080 x 1920 pixels, 5.0 in, 441 ppi, 2 GB RAM, microSD, up to 64 GB, 13 MP/2MP, Exynos 5 Octa 5410 CPU, Quad-core 1.6 GHz Cortex-A15 & quad-core 1.2 GHz Cortex-A7, 0.85 W/kg (head), 1.55 W/kg (body)HTC One M8: 5.76 x 2.78 x 0.37 in, 160 gm, 1080 x 1920 pixels, 5 in, 441 ppi, 2 GB RAM, microSD upto 128 GB!, 4 MP (rear), 5 MP(front for selfies), Qualcomm Snapdragon 801, Quad core, 2300 MHz, Krait 400, 0.94 W/kg (head), 0.83 W/kg (body)LG G2: 5.45 x 2.79 x 0.35 in, 143 gm, 1080 x 1920 pixels, 5.2 in, 424 ppi, 2 GB RAM, no ext Storage, 13 MP/2.1 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.26 GHz Krait 400, 0.50 W/kg (head), 0.69 W/kg (body)Apple iPhone 5S: 4.87 x 2.31 x 0.30 in, 112gm, 640 x 1136 pixels, 4.0 in, 326 ppi, 1 GB RAM, no ext storage, 8 MP/1.2 MP, Apple A7, Dual-core 1.3 GHz Cyclone (ARM v8-based), 1.12 W/kg (head), 1.18 W/kg (body)Nokia Lumia 1520: 6.41 x 3.36 x 0.34 in, 209gm, 1080 x 1920 pixels, 6.0 in, 367 ppi, 2 GB RAM, microSD up to 64 GB, 20 MP/1.2MP, Qualcomm MSM8974 Snapdragon 800 CPU Quad-core 2.2 GHz Krait 400, SAR: 0.59 W/kg (head), 0.24 W/kg (body)Motorola Moto G: 5.11 x 2.59 x 0.46 in, 143 gm, 720 x 1280 pixels, 4.5 in, 326 ppi, 1 GB RAM, no ext storage, 5 MP/1.3 MP, Qualcomm Snapdragon 400, Quad-core 1.2 GHz Cortex-A7, SAR: 1.17 W/kg (head), 1.06 W/kg (body)Given the above key specs, my suggestion to my friends is to choose 2 or 3 KEY features you require (may be large screen size, maybe less weight, maybe more CPU power) and then start nailing down the phones. Definitely and definitely go to a phone or a big box store and feel the phone. Nothing replaces that. In the end end you are using it for days and years, so the tactile feel is very important.Ask questions, the review cannot do justice to Galaxy Note III. I will be glad to answer any questions.", "Date": "May 31, 2014"}, {"Title": "Cool Phone", "Author": "Stephanie", "ReviewID": "R3NLEZDB00KGQO", "Overall": "5.0", "Content": "I love my new Samsung galaxy note 3.  I'm writing this review now from this phone.  First I had a lame phone,  now I gotta cool phone :-)", "Date": "May 31, 2014"}, {"Title": "GREAT!", "Author": "tamika", "ReviewID": "R35SF81KSO2LAH", "Overall": "5.0", "Content": "This phone works great!  I definitely would recommend this phone. The battery life is long and this phone is like a tablet.", "Date": "May 30, 2014"}, {"Title": "great phone", "Author": "Daniel Rosete", "ReviewID": "R3J9OVL8TOCKJG", "Overall": "5.0", "Content": "This phone does more than what I expected.  The S pen is a nice added feature to this awesome phone.", "Date": "May 21, 2014"}, {"Title": "TeamSamsung....ForgetiPhone", "Author": "Rhonda Elliott", "ReviewID": "R2AX3UJC43S9BJ", "Overall": "5.0", "Content": "Decided to go Android after my iPhone crashed and couldn't have made a better decision. On top of that, the price is reasonable here in comparsion to my wireless provider.It's super fast, and easy to manuever. I know there are many uses for this phone that I will be finding out about for months to come!", "Date": "May 20, 2014"}, {"Title": "Great Device", "Author": "Alicia Smith", "ReviewID": "R1MVFDFJUED9M8", "Overall": "5.0", "Content": "I'm completely satisfied with my new note 3. The phone exceeded my expectations. I'm still learning how to use it but the features are awesome! Plus for the price I paid I couldn't have gotten a better deal anywhere else. My carrier wouldn't even give me this great deal that Amazon gave.", "Date": "May 12, 2014"}, {"Title": "Fantastic phone", "Author": "PPosey", "ReviewID": "RSU3CE0AUS6UT", "Overall": "5.0", "Content": "I have had this phone for a few months and I love it as much now as when I first purchased it.  Great phone with lots of features.  No regrets.", "Date": "May 2, 2014"}, {"Title": "Great phone", "Author": "njc \"njc\"", "ReviewID": "R24LHCN4FPSAB3", "Overall": "4.0", "Content": "I Bought this as a birthday gift. He loves it! So many options and long battery life. Love samsung phones.", "Date": "April 26, 2014"}, {"Title": "awesome phone", "Author": "RJ_NYY_77", "ReviewID": "R3NL80Z4L2B6O6", "Overall": "5.0", "Content": "Had the note 2 so was expecting a good phone but once I picked it up it felt awesome in the palm of my hand in I have big hands. Slightly thinner check out the specs my only down fall is I have Sprint signal is on going on tampa area with 4G or maintaining any signals in certain areas of tampa bay but the phone itself is still great!", "Date": "April 18, 2014"}, {"Title": "awesome phone", "Author": "RJ_NYY_77", "ReviewID": "R3NL80Z4L2B6O6", "Overall": "5.0", "Content": "Had the note 2 so was expecting a good phone but once I picked it up it felt awesome in the palm of my hand in I have big hands. Slightly thinner check out the specs my only down fall is I have Sprint signal is on going on tampa area with 4G or maintaining any signals in certain areas of tampa bay but the phone itself is still great!", "Date": "April 18, 2014"}, {"Title": "Amazing phone.", "Author": "Michael", "ReviewID": "R27IEAVC4KJXO6", "Overall": "4.0", "Content": "Have this phone on Sprint and I love it. Speakerphone sucks and you can't go to full volume or it starts peaking. The battery lasts for days and the processor will take anything you throw at it. The screen is a sight to behold. I love watching movies on this and I'll still get 6 hours on the battery watching movies on full brightness. Very happy.", "Date": "April 11, 2014"}, {"Title": "Great phone", "Author": "melanie alexander", "ReviewID": "RNQ5UPX0XY0VR", "Overall": "5.0", "Content": "I love my note 3, It is so big and light weight. Very fast no dislikes what so ever. Just wish it was a little cheaper", "Date": "April 3, 2014"}, {"Title": "great phone", "Author": "Stephanie Jimenez", "ReviewID": "R3AIB7VG571OIH", "Overall": "4.0", "Content": "Love the phone. Its not all that crazy but has great features and holds up pretty well. Cant  go wrong with this phone", "Date": "April 1, 2014"}, {"Title": "the best phone ever !!!", "Author": "Kenneth", "ReviewID": "R3C12LMG4HZDWY", "Overall": "5.0", "Content": "THE BEST PHONE EVER MADE IN RECENT YEARS.  I REALLY LOVE IT AND WOULD RECOMMEND TO MY FRIENDS.  SUMSUNG  DID AN EXCELLENT JOB.", "Date": "March 18, 2014"}, {"Title": "love it", "Author": "JUSTIN DOLAN", "ReviewID": "R2DIOYEZECZPFB", "Overall": "4.0", "Content": "Love this phone. Still haven't even used all the features yet. The only complaint is the calls sound like rattling? I have sprint. Phone is big but not overly big and I have tiny hands.", "Date": "March 17, 2014"}, {"Title": "the galaxy", "Author": "Catherine Ammons Cofield", "ReviewID": "R29OKTGQD7E7B1", "Overall": "5.0", "Content": "Rceived on time and I'm  loving it. Wonderful phone… ............love love love it now have to buy cases to protect.", "Date": "March 13, 2014"}, {"Title": "Great!!!!#", "Author": "Keith Cooper", "ReviewID": "RCQLOLN9SG07F", "Overall": "5.0", "Content": "This is a great phone and very user friendly. I would recommend to anybody. My wife is ordering hers today.", "Date": "March 12, 2014"}, {"Title": "SUPERPHONE!", "Author": "Amazon Customer", "ReviewID": "R3HFHMSLAJ1ACW", "Overall": "5.0", "Content": "I'd been \"no contract/economy phone\" for 4 years to save money.  When I got my Samsung Galaxy Note 3, I felt like I came out of a cave and went to the stratosphere.  The screen, keyboard,,features, apps are so amazing. Too much to name.  I've become more organized, efficient,responsive, and happy since I started using it. Tremendous tool for business and hand held computer. I accomplish double the productivity. Love this phone! It's like having a personal assistant! Not to mention a cash register (using it to swipe credit cards for consults).", "Date": "March 11, 2014"}, {"Title": "Note 3", "Author": "melissa tilley", "ReviewID": "R2GR4JI95LGKYN", "Overall": "4.0", "Content": "I love it but it freezes up a lot. It may be because it has so much stuff factory on it.", "Date": "March 11, 2014"}, {"Title": "A phablet that does it all!", "Author": "jerod gerken", "ReviewID": "R121RIUBLGWC9Z", "Overall": "5.0", "Content": "This phone does everything! Everyday I discover a new use for it. The phone is, for the most part, intuitive to use. Some functions take a little practice to master though.  But one should expect no less from a device with.so much functionality.", "Date": "February 22, 2014"}, {"Title": "Love this phone!", "Author": "Adina", "ReviewID": "R1M2XNGNTHV66N", "Overall": "5.0", "Content": "I love this phone, do I really have to say more?I used to have the s3 which I also loved, but I wanted a bigger screen.I read all the time now whenever I get the chance and the big screen allows me to read comfortably without straining my eyes all the time.Obviously that's not the main reason why I got this phone, but its great overall :)", "Date": "February 19, 2014"}, {"Title": "A positive NOTE!", "Author": "F. Kersey \"Prismatic\"", "ReviewID": "R3STOA36HYIKOI", "Overall": "5.0", "Content": "I ♡♡♡ this phone! The clarity of the screen, the battery life, the ability to multi task and on and on my list could go but simply stated, it's UH - MAZING! !", "Date": "February 13, 2014"}, {"Title": "Excellent features ...when they work.", "Author": "DRL", "ReviewID": "R2DST6X3TGURLU", "Overall": "4.0", "Content": "I've had the galaxy note 3 for about 2.5 months now. It's packed with features that seem impressive at first but do have some glitches. I had to return my first phone as the charging port wouldn't work. But Amazon quickly replaced it. The phone is supposed to have voice commands for its music player which seldom work. The other hand free commands work well though. The stylus is excellent and offers great functionality. The greatest drawback of the phone is its size which can make its use pretty cumbersome and outright difficult with one hand even with the one handed feature. I have small hands though and this could be the problem. The camera is really good. I have used the s4 also and most of the features are present in the s4 while being less unwieldy.  The scrap book is great!  Obviously movies are awesome on the wide screen.The bottom line is...if you like the stylus go for it but if you like something less gigantic and still with nearly all the features, look elsewhere but then again if that was the case...you wouldn't have looked at the note in the first place!  Enjoy!", "Date": "February 13, 2014"}, {"Title": "I love my new phablet!!!", "Author": "Terri R. Hansen", "ReviewID": "R1K2KEN3CKTHEN", "Overall": "5.0", "Content": "It's so intuitive.  I have had slide out keyboards on my last two phones and was hesitant to transition to a phone without one.  With the features this phone has, I'll never miss my keyboard.  Additionally, the resolution is unbeatable.I keep learning new things all the time and am excited each time I do.  I highly recommend this phone!!!", "Date": "February 10, 2014"}, {"Title": "enjoying my Galaxy Note", "Author": "Christina L Sheahan", "ReviewID": "R1M95TS6E13P3V", "Overall": "5.0", "Content": "Great features. Love the stylus functions and multi screen options. Large screen for watching shows or reading documents. Better service with this phone as well.", "Date": "February 4, 2014"}, {"Title": "GOOD RIDDANCE iPhone !", "Author": "Gerry", "ReviewID": "R1O61AQVGTH114", "Overall": "5.0", "Content": "Good riddance iPhone! This phone is sooo impressive that I can't stop playing with it. This phone kicks iPhone butt!", "Date": "February 3, 2014"}, {"Title": "Best phone out", "Author": "cierra", "ReviewID": "R2TDGLYAJJTH9L", "Overall": "5.0", "Content": "Love it, Love it, LOVE IT!!! I have no complaints at all!! Battery last forever, display is so bright....major upgrade from my s2!", "Date": "February 3, 2014"}, {"Title": "real good improvement from the galaxy note 2", "Author": "Rashun brown", "ReviewID": "R3PBGEACIDMRB", "Overall": "5.0", "Content": "This is the best smartphone I ever had and I had a lot of them to say the least the muilti task feature is great the upgraded s pen is a nice added feature it take real good photos as well as video nice amount of storage there nothing bad I can really say about the galaxy note 3", "Date": "February 2, 2014"}, {"Title": "Can't love it any more!", "Author": "Anne Cheng", "ReviewID": "R3QM15GCTMPI09", "Overall": "5.0", "Content": "The Note 3 looks big when it is put together with other phones, but it is fine when I hold it in my hand. After a while, I can even use one hand to operate it. It is so convenience to punch the keypad and write on it. The resolution is so high and images are so colorful. There are still so many functions that I need to explore. Due to the big screen, I paid more to buy a explosion proof screen protector but it is worth. Fantastic phone!", "Date": "January 30, 2014"}, {"Title": "Best phone I've had so far. .", "Author": "Gerardo", "ReviewID": "R1RS8XNX0OS039", "Overall": "5.0", "Content": "Great phone. No problems with it.The battery life last forever, I only have to charge it up once a day.", "Date": "January 28, 2014"}, {"Title": "Love it", "Author": "Damaris R. Acosta", "ReviewID": "R9W4W6E8553IW", "Overall": "5.0", "Content": "I did have my doubts about his phone, but after receiving it, I fell in love with it. The image is very crisp. I love it", "Date": "January 27, 2014"}, {"Title": "Great!!!", "Author": "Ronald Haywood", "ReviewID": "R3LR34YUIJSTO1", "Overall": "5.0", "Content": "Great phone for everyday life. Best price online cost even less than Sprint. Very happy customer.  I dont have any complaints", "Date": "January 19, 2014"}, {"Title": "Great Phone...Great Device", "Author": "Ravi Rajesh", "ReviewID": "RNGLOW65C24Y8", "Overall": "5.0", "Content": "I got my Samsung Note 3 last month after a lot of thought, research and discussion. The transition was from iPhone 4S to Samsung Note 3. Initially, I was very hesitant of doing this but now after a month, I would say I am not repenting on my decision. I love every single bit of owning this phone.", "Date": "January 14, 2014"}, {"Title": "Great Phone!", "Author": "Adam Cook", "ReviewID": "R1OITOHJVEX17K", "Overall": "5.0", "Content": "Great Phone! This phone works great and runs smoothly. It can run any application you ask of it without a problem.", "Date": "January 14, 2014"}, {"Title": "Great phone.  I Love it for my 2y/o", "Author": "Bluelegacy5 \"Pretty Ree\"", "ReviewID": "R1Q8WKLGGGCV4M", "Overall": "5.0", "Content": "The phone is great loves it more...... I can stream movies and much more for him and he's content.  Ppl who have kids this is cool.  I don't like always bringing out the tablet and more to keep him calm. And for business things it does its job.", "Date": "January 14, 2014"}, {"Title": "Beautiful phone", "Author": "gadgetcollector \"mimi\"", "ReviewID": "R7IUX7ARI293P", "Overall": "4.0", "Content": "Pros: lightweight, beautiful screen, fast, powerfulCons: Somewhat awkward to hold, confusing software, expensiveAwesome phone with plenty of potential. Great if you are willing to put in some time to optimize it. Software suffers from having 3 masters: Samsung, Google and wireless carrier(in my case Sprint). Everyone wants you to use their store and apps. My advice is to use Google (it is an android phone after all) and add the other bits as you need them. If you're really ambitious troll YouTube for Note 3 tips and techniques.If you prefer phone use with one hand there are special setting to shrink and move the buttons to facilitate that. But I'd recommend a Galaxy S4 or iPhone instead.Update 06/06/2014Still love the hardware.  The software or rather the battle with the software providers is getting on my nerves.  For example, picture handling is totally out of control. Google started automatically downloading my pictures to my google+ account. Samsung would like to but I don't have a Samsung specific account. Dropbox has to be stopped from automatically doing this.  What I really want is to download pictures to my computer where I can edit them. Simple huh? Well not in this new world. Android phones and Mac computers don't like each other. If you want to do what THEY want you to do, life is a trip down a water slide. If you want to do something else its a climb UP a water slide.Also:  car chargers are an issue for this phone. See my review for the PowerGen 4.2Amps / 20W Dual USB Car charger Designed for Apple and Android DevicesIf you DON'T keep your phone in a pocket or on your belt  this is a great, inexpensive case:i-Blason Samsung Galaxy Note 3 Note III N9000 Smart Phone Leather Slim Book Case Cover with Stand Feature (Black)", "Date": "January 13, 2014"}, {"Title": "Cheaper than phone company", "Author": "Jarilyn Torres", "ReviewID": "RSGX9ZWN5DUV9", "Overall": "5.0", "Content": "The price was better than that of Sprint. They asked for $350 even with the renewal of my contract. I found it appalling especially since other companies had it for way cheaper with a two year contract.", "Date": "January 13, 2014"}, {"Title": "excellent cel", "Author": "too late", "ReviewID": "R1MKGF0JPLU907", "Overall": "5.0", "Content": "First time getting a cell phone from a 3rd party.  took a long time to activate but other than cool and neat cell!", "Date": "January 8, 2014"}, {"Title": "Best phone I ever owned", "Author": "Alexsis Williams", "ReviewID": "RU7GAVIA0ZGXF", "Overall": "5.0", "Content": "This phones is the best I was reading some reviews and was worried about the size but the phone does not feel to big I can't imagine going to a smaller phone.", "Date": "January 8, 2014"}, {"Title": "One of the hottest phones out ...", "Author": "Antwon", "ReviewID": "R1GH4W52REF515", "Overall": "5.0", "Content": "Very pleased with the phone and all that it offers.. Wouldn't trade it for nothing ...Works as a mini tablet ..", "Date": "January 7, 2014"}, {"Title": "Great Phone.", "Author": "MuzicalAmbition", "ReviewID": "R278WOH1DP6OSX", "Overall": "5.0", "Content": "Love this phone. I do tech support for a company that ryhmes with snapple n this phone does just as much if not more than their latest phone. No buyers remorse. Its great.", "Date": "January 7, 2014"}, {"Title": "Great phone", "Author": "Ana", "ReviewID": "R2V2CWZ29ZF9GO", "Overall": "5.0", "Content": "My expectations were met with this phone I am still learning all the features there are so many.I went from the Iphone to my new Samsung and I love it!", "Date": "January 3, 2014"}, {"Title": "i Wanted the iPhone at first", "Author": "Amazon Customer", "ReviewID": "R3Q5832BPVSZ52", "Overall": "5.0", "Content": "I ,really wanted the iPhone 5s because of the finger print technology, but my husband convinced me that the Galaxy Note 3 was a better chose. I think the Note 3 is awesome! and the gear. I have a iPad in which, I  love but it is limited on what I can do with it.  Everything is set up for marketing to make more profits for apple whereas with Samsung is more convenience for the customer.  The only thing I do not like is that I can not find a really nice luxury case for the Note 3.", "Date": "January 3, 2014"}, {"Title": "I can see everything on screen and you can write on it,it is very large but it fits in my pocket", "Author": "Charlie Woodward", "ReviewID": "R3SI8A7OYRRBHT", "Overall": "4.0", "Content": "It is large but it can do everything good pictures and you can write on it. You can see all information on screen very good", "Date": "January 3, 2014"}, {"Title": "Best phone ever....", "Author": "901phatboi", "ReviewID": "R12F918IX2DJUD", "Overall": "5.0", "Content": "Best thing since sliced bread.. ...I luv my galaxy note 3!!!! No matter what you throw at it.....the speed and power knocks it outta the ballpark.....I was an Apple head but now I've been galaxized!!!!!", "Date": "December 31, 2013"}, {"Title": "What's the big hype", "Author": "Southern Gal", "ReviewID": "R1T7A4RGA2OD1H", "Overall": "3.0", "Content": "I had my note 3 for a month and still getting use to it. I had the i-phone 3. The size is definitely something I have to get use too. The biggest thing for me was I no longer have to pay to download music and the battery life. I have to only charge my phone once a day in the morning and it's good to go for the rest of the day.I had an issue with my bank card and I needed to call Amazon to correct the problem before I was billed the next day. The woman I spoke to from Amazon customer service was not very friendly or helpful. She made it seem like I was a criminal She had no sympathy or made me fell a since of relief when I told her my situation. I am a true Amazon shopper and expect to be treated like you are happy to earn my consumer dollars.", "Date": "December 29, 2013"}, {"Title": "Bought as gift", "Author": "philip", "ReviewID": "R1PUZR5NHN66RV", "Overall": "5.0", "Content": "My daughter loves it, hasn't put it down since the moment it arrived. She just loves the camera and size.", "Date": "December 29, 2013"}, {"Title": "WHAT CAN I SAY", "Author": "Dan E Kraft", "ReviewID": "R2NMCGXO79OGC9", "Overall": "5.0", "Content": "This is my husband's TOP Christmas present.  He was blown away by this and the screen is huge, so many features; he has been 'playing' with this phablet since Christmas morning.  I am switching to this as soon as I can.", "Date": "December 27, 2013"}, {"Title": "Excellent phone", "Author": "Jay", "ReviewID": "R35748YCY6BTU2", "Overall": "5.0", "Content": "This phone is powerful and feature rich.  If you can catch it at the right price I highly recommend it.", "Date": "December 26, 2013"}, {"Title": "Another converted Iphone user. \"Up your game, Apple\"", "Author": "Hugo Chavez", "ReviewID": "R3QQWTAGXDUPHG", "Overall": "5.0", "Content": "Love the Phone. Had 3 evolutions of the Iphone in my lifetime. But lovin Samsung. My wife uses my phone more than her iphone.It does feel weird switching but you get use to it.The display is impressive.S pen is super responsive. Photos are crisp. phone has screaming speed.The downsidesApple owns the app market. I couldn't find several of my favorite apps in \"play store\"Sprint service is intermittent. Drains battery.Sprint Customer service is terrible.Replacing apple accessories is costly", "Date": "December 13, 2013"}, {"Title": "Good", "Author": "Matt", "ReviewID": "R2OR1NGR39CIF2", "Overall": "4.0", "Content": "I have noticed a tendency for the phone to turn on the wifi after I have turned it off.  Besides this, the phone easily lasts an entire day, if not two (if not used excessively, but still moderately).Nothing else out of the ordinary.  Bloatware and ease of use drop it to 4 stars, but overall very good.", "Date": "December 9, 2013"}, {"Title": "Awesome!!!", "Author": "Tito", "ReviewID": "R2V8FWGBWMOBGM", "Overall": "5.0", "Content": "Great Phone, more than i expected.  Upgraded from an iPhone that i loved but needed a bigger phone.  Great phone, easy to use and love the operating system.  Would recommend to all!", "Date": "December 7, 2013"}, {"Title": "works great! !", "Author": "thong thor", "ReviewID": "R2WOAQRR338NSC", "Overall": "5.0", "Content": "very fast shipping, works exactly as expected. These are brand new and no complaints. this can working out of the box just needed to activate.", "Date": "November 30, 2013"}, {"Title": "Great Phone", "Author": "Boogie \"Just Chillin..\"", "ReviewID": "R319Q33N0HIUVI", "Overall": "5.0", "Content": "This phone has everything you need in a phone plus a beautiful screen and surprisingly the size is easy to get use to.", "Date": "November 28, 2013"}, {"Title": "Great Tablet Horrible Phone", "Author": "G. Rondan \"VenpaCasa\"", "ReviewID": "R3W293F8D0MJUG", "Overall": "1.0", "Content": "So I got this phone from best buy and was extremely happy with it until I tried to have a voice conversation. It crackles sounds robotic and does this loud high pitch sound that hurts at times. I loved my note 2 hell I love the note 3 except for this very important issue. As a tablet this phone is flawless but it isn't a tablet it's a phone first. When I first experienced the issue I thought hey I is this making wife calls cuz it sounds distorted. Found out nope that's not the issue then I thought oh maybe sprint is having tower issues but my GF's sprint s4 sounds great so it wasn't that either. Exchanged at best buy after geek squad told me it's a known issue and still have the same issue..... I wouldn't recommend this product to anyone until sprint and Samsung get their act together. The carrier that charged the most for this phone is the only carrier with the issue.... not cool SPRINT!", "Date": "October 20, 2013"}, {"Title": "White Note 3 tx", "Author": "Steph", "ReviewID": "R6TKGCYTOR3DQ", "Overall": "2.0", "Content": "I purchased my phone through Sams.com on 10/09/13 AND I do like this phone...I previously had the HTC EVO yes it was an old phone. Since I have Sprint I have gone on to several Note 3 forums on Sprint.com and there are so many wide spread problems with calls dropping, garbled voice calls, and several other problems. I do not have any problems with my phone HOWEVER BUYERS BEWARE..DO YOUR RESEARCH. Go to the Sprint store and try out the phones..ask questions. Please do not spend your money on a phone you can't use.", "Date": "October 12, 2013"}, {"Title": "The Note 3 is amazing!", "Author": "Betty A Porter", "ReviewID": "R1YZC3TZH9AWO2", "Overall": "5.0", "Content": "Excellent battery life and super fast. I'm still on a learning curve with all the features, but they are pretty straight forward. Nascar race view in 3D is amazing! Capturing and saving pictures or information with the S Pen is so easy and fast.", "Date": "March 29, 2014"}, {"Title": "Best phone for your money!", "Author": "ashley", "ReviewID": "R1KDOK8W41V8GB", "Overall": "5.0", "Content": "Greatest phone out right now hands down! Love the fact I can do my work on this device through word, Excel, and power point. Puts every other phone out there to shame! Trust me, I use to work for Apple!", "Date": "January 2, 2014"}, {"Title": "DROPS CALLS WHEN PHONE SAYS IT HAS SERVICE", "Author": "Ivan", "ReviewID": "R33VHAS53P0RQ1", "Overall": "2.0", "Content": "great phone. sweet features.  but if u have sprint.. stay away. drops calls when the phone has service. first sgn3 i thought it was a bad phone. sent it back and got another one. still drops calls. its either a software issue or sprints network issue.", "Date": "December 14, 2013"}, {"Title": "DROPS CALLS WHEN PHONE SAYS IT HAS SERVICE", "Author": "Ivan", "ReviewID": "R33VHAS53P0RQ1", "Overall": "2.0", "Content": "great phone. sweet features.  but if u have sprint.. stay away. drops calls when the phone has service. first sgn3 i thought it was a bad phone. sent it back and got another one. still drops calls. its either a software issue or sprints network issue.", "Date": "December 14, 2013"}, {"Title": "GREAT phone with AWFUL call quality!", "Author": "amariespence", "ReviewID": "RX4Z75TRI48IR", "Overall": "3.0", "Content": "LOVE this phone, but I realized that I don't use all of the features the phone has. It works great for social media, texting emailing, and web-surfacing. Previously I had the Samsung Galaxy S2 and switching from that to the Note 3 was a huge jump because the Note 3 is HUGE! It's a little difficult to handle with one hand, but you'll get used to it over time. I thought the S4 was large, but hold a Note 3 and see the difference! The call quality is AWFUL, unfortunately! This is one of the most popular phones on the market and the last thing anyone would think would be wrong with the phone is the call quality. The calls are fuzzy and are in and out all of the time. I read the reviews about the call quality before purchasing the phone and didn't think that I would experience it, but I am experiencing it. That's certainly a downer for spending $300 on the thing.", "Date": "December 5, 2013"}, {"Title": "A phone nerd's dream on Verizon.", "Author": "Alex Goolsby", "ReviewID": "R15RV7GTRUM2FC", "Overall": "5.0", "Content": "My first phablet and I'm a believer. A few random thoughts:1. Compared the screen quality to my friends Galaxy S4 yesterday and the Note 3 blows it away - SO much more vibrant, the screen just pops, the s4, which is a great screen with even higher pixel density, looks dull in comparison. (on identical brightness, wallpaper, and screen mode)2. I know this sounds childish but I get a visceral rush just looking and using the huge, luscious screen. It seems to be the prefect size to give you that tablet effect - that invitation to sit back and actually get absorbed in the experience a la the iPad - while not being too big to carry and use for utilitarian purposes too. Sure, an iPad mini or Kindle would be even more inviting but carrying those things around is problematic. Your phone is with you at all times. The bottom line for me is that this is a very acceptable and practical compromise, YMMV.3. My first new phone in two years and I'm very impressed with how much snappier and responsive it is because of the chip developments. I'm sure that would be the case with any new high end phone but rest assured that this flagship Samsung phone has the latest and greatest guts and snaps with the best of em. I am more inclined to use various features because I know there will be no clunky snafu or delay.4. The stylus is a welcome novelty (even beyond the nostalgia it gives me for my old Windows Mobile phone) So many nice things you can do with it. Draw a circle around any web content and it's 'scrapbooked'. Draw a rectangle on the screen and you can open an app IN that rectangle. I use it to draw up complex estimates in my home service business and then add a photo to the estimate on the same note and it automatically syncs with Evernote! This is an estimators dream. If you are sitting back at the coffee shop intent on surfing your phone a while try actually using the stylus instead of your finger.  As a typing and tapping tool it is undoubtedly more accurate and rapid than a thick finger tip, so why not? Sure, to the other Starbuckers this will mark you as a non Apple outlier but so what, don't follow the herd, think different!5. Call and sound quality - I see where apparently some people have had issues with call quality but I have had no issues. Perhaps this is a Sprint only issue? So far so good on Verizon.  If you think maybe you would like the Note 3 but are holding back for fear it will be unwieldy I say go ahead and get it. It's light as a feather and you get quickly used to the size. It will of course never be as easy to whip about as a smaller phone so you will have to weigh the loss of a little agility against the increased usability and joy of having a tablet in your pocket at all times. I vote Note! It's a phone nerds dream.", "Date": "October 26, 2013"}, {"Title": "I never enjoyed this product in Sprint Network.", "Author": "Pete  Ander", "ReviewID": "R3NT2HI96HGV4E", "Overall": "1.0", "Content": "I never enjoyed this product in Sprint Network. It was a nightmare as I could not stay on a call for more than 1 minute. Sprint service with Samsung Note 3 is horrible. Their support and customer service made my experience with this product worse. I ended up terminating the contract with Sprint, returned the phone and lost my $350.00 paid for it. I regretted buying Sprints Samsung Note 3.I had to buy another Samsung Note 3 for Verizon network. Now I am very happy with the product.", "Date": "April 9, 2014"}, {"Title": "DROPS CALLS!!!!!!!!!!!", "Author": "A. BEMILLER \"Bematorial\"", "ReviewID": "R2XJBEPI6101KQ", "Overall": "1.0", "Content": "The stinking phone keeps dropping calls for no apparent reason. A Google search brought this up immediately after I typed in \"Note 3\" & rumors have it that I just have to live with it. I'm supposed to always talk on speaker phone or always use blue tooth. REALLY?!? I need to see if I can return it perhaps. It is proving to be VERY frustrating.", "Date": "January 25, 2014"}, {"Title": "Nice phone, but...", "Author": "Nelson Vazquez", "ReviewID": "R3P521L8527J5N", "Overall": "2.0", "Content": "Its dropping calls like crazy... Thinking of going back to my old phone.. Now I dont have time to return it..", "Date": "January 2, 2014"}, {"Title": "love", "Author": "Ramona Williams", "ReviewID": "R230KGZQMKBWN6", "Overall": "5.0", "Content": "love this phone could not ask for a better phone i would recommend it to everybody best phone ever love it.", "Date": "April 8, 2014"}, {"Title": "Best Phone Around", "Author": "Rico M.", "ReviewID": "R370ZJLYYZSX8", "Overall": "5.0", "Content": "Fantastic screen size and image. Top quality hardware & the best & fast Software. there are not enough good things being said about this phone. only complaint is that Samsung web browser does not support Adobe Flash for video viewing. but web browser can be replaced.", "Date": "January 6, 2014"}, {"Title": "Galaxy Note 3 Rules. Sprint does not.", "Author": "ArizonaOnly", "ReviewID": "R2LSL12DH58PJF", "Overall": "5.0", "Content": "The galaxy note 3 is the best phone on the market to date, hands down! Sprint? Not so much. Go with another provider, but get this phone!", "Date": "December 31, 2013"}, {"Title": "Battery life is not good and crackling sounds when on call!", "Author": "Salman S.", "ReviewID": "R1RPMZKBKYUI4O", "Overall": "1.0", "Content": "The battery life is poor, and I hear crackling sounds when I am on the call. I do not know whether it is only my phone or its happening with other people too. I will not recommend this product to anyone!", "Date": "October 19, 2013"}, {"Title": "Only this purchase", "Author": "Miss T", "ReviewID": "R3MTA96Y2BWDCN", "Overall": "2.0", "Content": "The phone I always wanted and waited for over a year however was not able to connect/activate it to the Sprint network.", "Date": "January 2, 2014"}, {"Title": "I love this phone so far and I haven't even used it yet!", "Author": "COURTNEY ODOM", "ReviewID": "R3BG66QFHIMA6R", "Overall": "5.0", "Content": "I just received my Galaxy Note 3 today. Although I have not set up service with my carrier yet, I had to voice my opinion on how well and secure it was packaged. Not to mention I thought the wood style paper box had a sexy design (I will save it for display in my boutique looking closet).  I wanted this phone more than any phone I have ever had (Note: I am not a high tech cell phone fan), but this one was a must have. After careful researching and reading as many reviews as possible on this phone, I decided to order it on Monday. The price was more than excellent, so far no regrets. Everyone had it for well over $300 Did I pay that? Nope! I will update status of usage and quality on the review board once I experience it for a while. So!!!!!!!!!!!!!!!!!!!!! Happy.", "Date": "December 4, 2013"}, {"Title": "upgrade fee?", "Author": "Brandon", "ReviewID": "R2O21LIPYUNF7M", "Overall": "5.0", "Content": "if you buy the phone off contract due you have to pay an upgrade fee when you activate your phone with sprint when your not eligible for an upgrade?", "Date": "November 13, 2013"}, {"Title": "Tried it at the store and noticed many of the issues mentioned in this thread", "Author": "Amazon Customer \"MontWat\"", "ReviewID": "R2Y2X9BOQBTOHR", "Overall": "1.0", "Content": "Voice quality suckked. Wifi was dropping. Phone seemed warm to touch, but it was hooked up to a wire.I have a SGS2 for last two years. Despite all ths issues below I was considering the Galaxy Note 3. My SGS2 has the following problems that were NEVER solved1. GPS could never lock2. after a \"update\" sent out by sprint about 18 months ago3. The battery life became very short4. The phone over heats constantly5. the buttons are laggy esp. when the phone wakes up6. The 3G connection doesn't work at all for long stretches of time, when when I have all the signal bars lit.Why are these issues relevant to the Galaxy Note 3?After TWO YEARS, none, I mean NONE of these issues  were fixed by Sprint/Samsung. I have never been able to use Google Maps or anything that depends on location. The data connection failed at critical times causing me to lose thousands of dollars.WHY would I believe that \"this time it will be different?\"I am in fact SURE, two years from now anyone f00l enough to buy a GN3 will be still be facing poor voice quality, unreliable wifi plus god knows what else.I got ripped off once. I am not going to get ripped off again by Sprint/Samsung. I have paid $200 a month for two years of basically having a phone worse than my old flip phone which cost $30 a month. Sprint/Samsung have ripped me off for $5000+.Do not renew your contract with Sprint and do not buy the Galaxy Note 3.", "Date": "October 12, 2013"}, {"Title": "poor phone quality", "Author": "Karla", "ReviewID": "R22EKSHR0919B1", "Overall": "3.0", "Content": "hard to holdso many functions I don't know how to operatemany functions to cameraibook imusic kindle doesnt cross over.drop box hard to use", "Date": "January 1, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Samsung Galaxy Note 3, White 32GB (Sprint)", "ImgURL": "NULL", "ProductID": "B00FJ8YCZM"}}