{"Reviews": [{"Title": "Best Android Phone Period!", "Author": "BobCz \"The CIZE\"", "ReviewID": "R2N1EUPU6QWM55", "Overall": "5.0", "Content": "I have had my Moto X for around 6 months now. I traded up from a Galaxy S3. I purchased one (subsidized by AT&T;) directly from Motorola. Since the time I have owned the phone is has had two major updates. Today I just received 4.4.2. This is the only phone besides the Nexus phones that get these timely updates. The is also the only phone that keeps AT&T; software layer from messing up my smartphone and Android experience.If I were going to say anything negative about the phone is would probably have something to do with the camera. The camera wants to take pictures in low-light and it does that very well, the problem is that when I want to use the flash, most of the time it \"lights out\" the picture and the quality is not up to expectations. 4.4.2 is supposed to contain a bug fix to alleviate that problem. I haven't tested it yet so I don't know if the fix is in.The phone is self if a fantastic piece of hardware and software. The battery really does last a whole day and many times depending on my usage it will go two days. I also use Google Now all the time. This is the feature where I wake up the phone and create a text, timer, search, etc, just by saying \"Ok Google Now\" and giving it the appropriate hands free command. My iPhone friends get really jealous of the effectiveness of this application, it works that good. There are also the silent notifications that appear on my screen to tell me when I have text messages, email, phone calls etc. So I can tell what is going on with my phone without turning it on, a real battery saver and time saver. Of course Assist is one of my favorite applications. When I'm driving my Moto X automatically goes into Driving Mode and will notify me of calls or text messages so that I can deal with them hands free. Assist also includes automated Meetings processes and automated sleeping processes. You setup the Assist and tell it how you want to phone to respond.Really there are just too many features of the Moto X to go over them all. I just hope that the Lenovo purchase of Motorola will not take my positive experience and make is a negative one because I love this phone.", "Date": "March 25, 2014"}, {"Title": "Great phone", "Author": "Simon R.", "ReviewID": "R2YJF7WOB3LQ3Q", "Overall": "5.0", "Content": "The best phone I have ever used. Can't imagine using another phone for quite a while. Way to go Motorola!", "Date": "March 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F3XUAJ0"}}