{"Reviews": [{"Title": "Finally it’s here!", "Author": "Mukhtar Singh", "ReviewID": "RQSP9PBG21LU3", "Overall": "5.0", "Content": "I’ve been waiting for this phone since it was announced in January at CES. The phone looked beautiful when I saw it on YouTube videos and when I received it, I’m glad that I waited. This phone is definitely an upgrade from my Nexus 4.PROS: This phone is just beautiful, I love how it looks and feels in my hand.  Makes sense why it won a design award. My wife and friends always tell me how the design is unique and great-looking it is. Don’t mind showing this off in public. I really like the white color on the sleek body, but I wished the phone came out with more colors (would've chosen red).The screen size is a plus, the 5-inch display makes typing and viewing much easier. I can notice the difference between the screen sizes when I compare this to my older phones. The picture quality is very sharp, watching HD videos on Netflix is quite entertaining, especially with the Dolby sound enhancement.The 13MP camera is a big upgrade from my Nexus 4. When I got the phone, I took pictures of my kids and they came out great! Took a video of my son’s football game with it, I was impressed at the quality. I usually Skype with my family aboard, the quality of the front camera is pretty good too. The large screen definitely helped.Overall, the phone is smooth and snappy. I haven’t had any lag when running apps or playing games. One thing that bugged me about my Nexus was the lack of expandable memory, I was so glad to see that there’s an expandable microSD card slot. Now I don’t have to constantly upload pictures to my computer to make room on my phone. Their MiFavor skin is different, in a good way. I was able to access my favorite apps quickly by just swiping out on the lock screen.CONS: I have been using my wife’s iPhone with LTE to watch videos and surf the web. It’s amazing how fast it is! It’s a little disappointing that the Grand S doesn't have LTE, but it’s not the end of the world. Luckily, I have T-Mobile’s 4G network, so I can still stream videos and download apps pretty quickly. Plus, I’m on Wi-Fi majority of the time.Not trying to be picky, but I hope that ZTE will upgrade the Android version, since all the phones these days are getting newer versions of Jelly Bean.So far, I’m really satisfied with the phone, it does everything that a smartphone needs to do. Transferring all my information to this device was easy, thank you Google! I’m glad that this device is unlocked and is sold at a decent price. I still can’t believe how beautiful this device is. It’s very thin and light to carry as well. ZTE, please bring more color options!! Besides that, I definitely recommend this phone to everyone.", "Date": "November 1, 2013"}, {"Title": "The Good and the Bad. Would buy again.", "Author": "B. Gartner", "ReviewID": "R1PIUMP90EXKAH", "Overall": "4.0", "Content": "This phone while it's a 5 star phone because the off branding and lack of addition market support it is reduced in a star rating. They put the POGO pins on it but can't find any dock. Limited phone cases also will hold you back. Currently from my search there are only two phone cases. I bought them both MoFi and Nillkin.  None seem to have a Life Proof or Otterbox premium feel to them.Root support of the phone currently is not existing in any of the major software root tools out. Thus you are left with a phone that is stuck with some things that I would normally remove or freeze in Titanium or other App/backup management tool.The phone itself,  the screen is raised off the uni-body. Thus it has a bit of screen border around it and I think it leave the screen exposed to pressure. And if you push on the screen were the sims card and the SD card you will find that the phone body creaks. But have have this same thing on the old S2 I think its just the nature of a plastic body phone.I used My GPS the first time the other day and I would say while it activates quick The location seemed to float. Causing the phone to think it has moved and the navi would say rerouting.  I'm still sitting on the same street.  I can't tell if that is because of the Skinomi Tech Skin I have it which seems to be semi aluminum sticker, which I believe is causing the problem.Browsing is Great, Battery Life if the screen is left on bright settings you will drain it quick.Heavy Pandora use with large headphones will result in about 8hour play time  before needing charge. IE one work shift. You will have about 10% battery depending on volume playback level.  This is using Data and not wifi.Heave browsing you should get one of those battery pack's.Texting/phone calls light browsing on breaks will result in a all day battery and make it to the end of the night with 20%. I'm not a teen or have many friends I text during the day so if you are heavy txt user you would probably need that battery pack.If you put a screen protector on it. You will loose a bit of touch screen sensitivity.Phone when answering phone calls sometimes when you drag it to the answer position you will find it doesn't  answer. Try hitting the home button and then drag it to answer phone call.The volume and power button are good.While its not a brand name, it had solid performance and screen is bright when you need it most of the time I use the phone at 10% bright level and find that During daylight direct sun I need to bump it to 50% I could use the meter but think I probably do a better power management job than the sensor.Pricing I picked up when Amazon had on lighting deal put the phone at $325 with tax.Additionally, at the 325 price I can buy next years model.I would not recommend Insurance on a smart phone. I will show you cost point as why I feel this way. I had Samsung S2 added insurance at the tune of 8 dollars a month. 8x12=96  additionally you will now have to pay 150 replacement for broken or damaged phone. Thus you  add those up simply round off that 96 to 100  add those up  100+150=250 you are near the price of this phone. If went with an older model your cost of replacement doesn't add to the insurance value, as you are getting old tech.But with this I'm getting close to new tech.  For the price the nexus 5 is near this phone. I would make the statement Nexus Is just a bit to prototype for me and just want it to work.  The Nexus @ 30 days from release has had problems spotty WiFi and camera problems.This Just works.  I wouldn't pay what opening price is for this but for the 325 I got it for I would do it again.", "Date": "December 10, 2013"}, {"Title": "Impressive phone - galaxy s what?", "Author": "Emina Brancov \"emicloud\"", "ReviewID": "R33UGEN9IOAAMQ", "Overall": "4.0", "Content": "Pros : Gorgeous sleek design, light, slim, fast, beautiful 1080p screen, price.Cons: Bad battery life - barely lasts 1 day with minimal use, no gorilla glass.I bought a battery pack so I can plug it in whenever needed.", "Date": "December 4, 2013"}, {"Title": "I won't recommend to buy this phone .", "Author": "Sanjay Dewase", "ReviewID": "R3UKX7FPDK3SS9", "Overall": "1.0", "Content": "I agree it's big HD display phone , however that display doesn't work properly .I bought this phone and from the first day bottom half of the display start flickering and it turns blue sometime , I reported to amazon and the sent me another phone asap , which I really appreciate however new phone is even worst that display flickers into blue and become unresponsive sometime .I also contact ZTE and they want me to send this phone to Texas to there service centre and they will return this phone in 15 day's ..I should say if they are marketing this phone for US warranty than they should have service centre in most of all capital city with better response time .Anyway I just got the bad deal .", "Date": "January 16, 2014"}, {"Title": "Great specs except for battery life", "Author": "Edmond", "ReviewID": "RJKEJYOAXFNND", "Overall": "4.0", "Content": "Specs: The cell phone hardware wise is excellent except for the battery life.  The screen is beautiful with a 440 pixel density. Quadcore snapdragon processor and 2 gb of ram. The phone comes with an irremovable internal battery of only 1750 mAh. This means the battery dies quickly and you'll probably charge it again same day.The software remake of android KitKat by the company is crap. I downloaded nova launcher to replace it.I took a star away because I had to replace the phone twice due to hardware malfunctions and the battery life. I got this phone for $280 off contract on a deal so I won't complain that much.", "Date": "December 15, 2013"}, {"Title": "It's a  good phone, but not worth more than $300", "Author": "AC", "ReviewID": "R95P1X5YX19FW", "Overall": "4.0", "Content": "Large HD display looks great while playing games or looking at HD content.Takes great quality pictures and videos.No variety of cases available unfortunately, only managed to find a snap on caseBack panel with the camera is glossy tends to get scratched due to regular usageHad some issues with the gps, had a real problem pin pointing your exactlocationBattery life is not great. Have a charger handy", "Date": "January 6, 2014"}, {"Title": "Poor battery, low-end phone.", "Author": "Luigi Bianchi", "ReviewID": "RIZI0WXPGB7ID", "Overall": "1.0", "Content": "Like other reviewers stated, the small battery makes this phone almost unusable. I installed a \"battery saver\" from Google store and that improved battery life just a little. Watching the battery going 10% down within 5 minutes of ANY activities, gets distracting and frustrating at once. Statistics show the screen to be the battery drainer. Even with all apps and services off, the screen usage still remains the main problem. During standby, battery life is actually decent. What's the point of having a smartphone if you need to worry on keeping the screen off?It runs Android 4.1.2 jelly bean. Kitkat not available from ZTE website and no plans. Tech support big question mark. Nevertheless, construction quality is poor. It feels plasticky everywhere: back, screen, earphone and charger. Don't take a chance to drop it, or it might be the last time you see it. Personally, I prefer a phone with lower specs on paper, but better build quality and, most importantly, without having to watch the battery indicator while reading emails, browsing news or using skype. Usability comes first. BATTERY AND QUALITY issues are deal breakers. Paid $200 on lighting-deal, sent back, sorry Zte.", "Date": "December 26, 2013"}, {"Title": "Good product!", "Author": "RC", "ReviewID": "R2JBDTK0ZVH3B2", "Overall": "5.0", "Content": "Good phone, nice design, user friendly. I especially like the slimness of the phone, looks very neat, I think ZTE had improved a lot on their phones.", "Date": "December 5, 2013"}, {"Title": "Very Poor ZTE customer service. Stay away. Far far away !", "Author": "Das Framas \"dasframas\"", "ReviewID": "R2U25JCRKJNNZ0", "Overall": "1.0", "Content": "the screen and the dimensions make this a very attractive phone. The phone itself is fast and very responsive. I only used it for browsing over WIFI since the phone refused to work with 4 different GSM carriers i tried with.(more later). the ZTE bloatware is far less than its peers which is a good thing IMO.The only con i can see is the camera. Dont go by the 13 MP tag on the camera specifications. 13 MP may sound good, but the lens quality is not as good as its peers.I was initially very excited to get this phone. It was advertised as an unlocked GSM phone and i purchased it for use while travelling internationally to Malaysia and India.To my pleasant surprise, this phone refused to accept any GSM SIM i try with it. I tried 4 different carriers each of which match the GSM frequency band listed on this phone but none of them were picked up by this phone.When i contacted ZTE support having spent about 8 hours over a course of 2 weeks on the phone with them, they explored all kind of possibilities starting with -- 'you seem to have received a locked phone, we will provide the unlock code and you will be all set'- 'you seem to be putting the SIM card in the sd card slot !! (someone tell them the difference between the size of a full sized SIM and a micro SD card please)'- 'This phone was designed for international use but not tested international networks'At the end of all this waste of time and effort, i was told by their technical expert 'Jackie' that the phone does not support the PSTN frequency range for india. Till then i was trying to understand from them and work with them, but at this point i gave up.I will never buy a ZTE phone. End of story.", "Date": "January 30, 2014"}, {"Title": "Good phone except for its battery", "Author": "Brian", "ReviewID": "RVD29ICLGU7PI", "Overall": "4.0", "Content": "I really like the design of the phone, it is gorgeous.  The phone is fast and the screen is beautiful.  The reason I gave this phone 4 stars is because of the battery which does not have enough juice to support a powerful phone.  I think I need to look for a power bank soon.", "Date": "December 31, 2013"}, {"Title": "Battery life is sad!", "Author": "J. NGUYEN \"JL\"", "ReviewID": "R1FANEOIKEZ1X2", "Overall": "3.0", "Content": "I paid $200 for this ZTE Grand S during the holiday sale.For the price that I paid, I can't find any other phone with specs like this phone. I used it for a few days, and during the usage period, I was always thinking about the possibility to keep or to return the phone. When I had so much doubt about it, surely I should return the phone.- The main reason made me returning the phone is because of the battery life, and the possibility to replace the battery in the future. The battery life is SAD! The phone big HD screen, its processor, and apps drains the battery fast. A full charge gave me roughly 2.5 hours of usage. It is annoying to keep watching for the battery indicator. With the battery, the more often you charge, the faster it will deteriorate. Can't change this battery at home because the battery is sealed inside the phone body.- The sim slot is a challenge to remove sim.- Camera beeps with every auto focus is annoying.", "Date": "December 24, 2013"}, {"Title": "nice phone!", "Author": "Ying Wang", "ReviewID": "RRFD1L81WEKEG", "Overall": "5.0", "Content": "i am very satisfied with the product. It is a good looking phone and the speed is really fast. I  recommend it to everyone highly.", "Date": "December 5, 2013"}, {"Title": "Worth the Money", "Author": "Xiaobiao Yin", "ReviewID": "R1A94MADOTSYTA", "Overall": "4.0", "Content": "I bought this phone in a big deal. Its outlook is very charming just like the name of Athena.Although APQ8064 is a little out, it is very fast for daily use.The battery is not positive.", "Date": "January 24, 2014"}, {"Title": "Everything is good,but the battery capacity is a little small", "Author": "abnerabbet", "ReviewID": "R3ORWJEUG4VCF0", "Overall": "4.0", "Content": "The phone is good,even not worse than Samsung S4,but the battery capacity is a little small.You will have to charge after one day", "Date": "November 13, 2013"}, {"Title": "Bad", "Author": "Mauro C.", "ReviewID": "R3L8SPNCT8VDBG", "Overall": "1.0", "Content": "buy this phone very illusion for my husband but could not use it because it does not recognize the simcard or usim and is not fixed in the slot, I could not return before that buy it with plenty of time to give it at Christmas, the window to return already disappeared, someone please tell me or seller should I do with this phone that is with the plastic factory and smells new, but does not work why not grab the usim or simcard", "Date": "January 2, 2014"}, {"Title": "I,m very happy and confy with my new ZTE", "Author": "Luiz Lopes", "ReviewID": "R3JKEJYMF6XF07", "Overall": "3.0", "Content": "Very powerful, thin, beatiful and elegant. The sound is much more superior than my  Samsung Google. Only thing  bad in my opinion is the earpeace.", "Date": "December 6, 2013"}], "ProductInfo": {"Price": "$399.00", "Features": "5-inch 1920×1080 Full HD screen (440 ppi)\nAndroid 4.1 Jelly Bean operating system\n13MP camera with unique applications, provide a more vivid and real shot\n1.5 GHz Quad-core Qualcomm Snapdragon S4 Pro processor\nWinner of the 2013 iF International Design Award", "Name": "ZTE Grand S - Unlocked - US Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/41gCqVVPkLL._SY300_.jpg", "ProductID": "B00FBQ7W0O"}}