{"Reviews": [{"Title": "Couldn't be happier!", "Author": "A. Erdelyi", "ReviewID": "RXCY16MPF4GOY", "Overall": "5.0", "Content": "I love this phone! I am rather clumsy and decided to try out this phone more for the price than anything. I love it! It is easy to use and works for Straight talk in Arkansas U.S. The battery lasts a long time even with my constant use and game addiction lol I did have some trouble with the sensitivity of the touch screen but my husband who is more tech savvy showed me how to recalibrate it and its has worked perfectly since. One of my favorite pros for this phone is it does not come with all the rooted factory apps like The Samsung does. I can add or delete only the apps that I like! Also it honestly doesn't seem as fragile as the Samsung version I have dropped it twice already and no damage. We just ordered my husband one in black!", "Date": "March 19, 2014"}, {"Title": "I Love My New Phone", "Author": "Tyrell King", "ReviewID": "RA3M5E5YYYXCO", "Overall": "5.0", "Content": "This phone is the best phone I've ever purchased. It's fast, and I could do just about everything on it....I gave this phone a five star rating, because it's everything I ever wanted in a phone including the cheep price...", "Date": "December 24, 2013"}, {"Title": "Didn't work for Net10", "Author": "Barbara Ann O'Toole-Flores", "ReviewID": "RQ5ZEF7CEC9RM", "Overall": "2.0", "Content": "It was a nice looking phone and it shipped out faster than it was scheduled to but it wouldn't work for net10 (it would call and text only) and it wouldn't allow me to change the APN to get it to work.", "Date": "March 20, 2014"}, {"Title": "Great service from this seller!", "Author": "Daniel Gabrielli", "ReviewID": "R18LWH3XQ5QKSF", "Overall": "3.0", "Content": "This phone performs very well for the price. However there was a defect in the glass, so I requested a return approval from ESON-AM.They immediately responded with a very gracious note of acceptance.", "Date": "December 28, 2013"}, {"Title": "I love the phone", "Author": "Judith Woolcock", "ReviewID": "R1AZXSMTO5P0FJ", "Overall": "5.0", "Content": "this phone is amazing for the price but can someone tell me how i change the startup screen from saying Demon it is a bit creepy, i need to know if its the company that make it ,i would give a 5 star still but just need to get the demon word out", "Date": "April 28, 2014"}, {"Title": "Good", "Author": "Carlos B.", "ReviewID": "R1U8G7NRH3Q45N", "Overall": "4.0", "Content": "Good cellphone, most everything is good, I recommended, only has the defect that its reset each 1 hr, or if you do not have a continuous time working with it.Overall: Good shape, speaker, touchscreen. Has a regular camera 8 mpx & 5 mpx (front).Excellent Wifi reception.", "Date": "February 14, 2014"}, {"Title": "It's OK.", "Author": "Olive", "ReviewID": "R2GC88LDUWBCIP", "Overall": "3.0", "Content": "Processing is slower than hoped. The phone is having trouble connecting to wi-fi. The touch isn't as sensitive as hoped. I can't find a case that fits the phone...", "Date": "May 12, 2014"}, {"Title": "does not read sim cards", "Author": "CRYSTAL", "ReviewID": "R3AWZGL1NBLL95", "Overall": "1.0", "Content": "I BOUGHT A STRAIGHT TALK SIM CARD AND T MOBILE SIM CARD AND THE PHONE IS NOT READING IT . ALL I CAN DO IS TAKE PICS AND LISTEN TO MUSIC .", "Date": "March 28, 2014"}, {"Title": "not working ... just want to cry after waiting so long for my phone", "Author": "richard thomas", "ReviewID": "R2WV8VA5IXEZ3Q", "Overall": "1.0", "Content": "i was so excited to received my phone.. the package was in a nice silicone type box, .. an ear phone.. a black an white charger, the out let part white an the data cable black.. battery x 2 an a book in Chinese... really? anyway so excited i took out my phone an start to examine it.. it had scratches like it a use phone ... a battery was already in the phone so i put i on, put in my sim, an to date its not accepting my sim.. i try the next slot nothing.. tears came to my eye.. cause i know ,y money has gone down the drain... so the phone will just sit their doing nothing... maybe again i was a bad lucky person, i bought the phone only because of the good reviews, as am typing am still trying to see if the phone will surprise me ... an i bought it as a gift.. now i have to face the store again... i just give away $119.00 us on a phone thats not working .. an to date am still waiting on the company to reply me ... the choice is yours but my advice spend your money an buy something better.. \"Good things are not cheap an cheap this is not good \"", "Date": "June 9, 2014"}, {"Title": "Good phone", "Author": "Eduardo Aranguren", "ReviewID": "RA3FT2JL8MKKD", "Overall": "5.0", "Content": "it's cheap. goo performance for price. screen isn't brilliant. Elegant and cool design. you shouldn,t install so much app s.", "Date": "June 6, 2014"}, {"Title": "don't like it at all", "Author": "chinoredd", "ReviewID": "R1FPZDYBUVZGV6", "Overall": "2.0", "Content": "to slow an stops n take to long to open any programs did i say slow very. you text an have to wait on the phone", "Date": "April 14, 2014"}, {"Title": "good product", "Author": "Carlos C.", "ReviewID": "R3HJYU4U2Q4XSS", "Overall": "5.0", "Content": "excellent product all arrived in perfect condition, I am satisfied with the price and product quality. I recommend it for the quality of equipment", "Date": "April 14, 2014"}, {"Title": "Great Service", "Author": "Jesse Galloso", "ReviewID": "R6PQDTS0U1M63", "Overall": "5.0", "Content": "Got here earlier than said. Also had a lot of extra accessories. Overall a great product and worth its value.", "Date": "March 1, 2014"}, {"Title": "screen not working", "Author": "Carol Ann", "ReviewID": "R1SLANO1YSJSN1", "Overall": "1.0", "Content": "The screen is not working and it is too expensive to send it back from Barbados before January 31, 2014.", "Date": "January 3, 2014"}, {"Title": "greaT", "Author": "Anthony I. Auguste \"razer38\"", "ReviewID": "R3QIDWXCCU6JQ0", "Overall": "5.0", "Content": "The item has reached my all expectations I could not ask for more. It has done what I was exacting it to do anD more.", "Date": "May 26, 2014"}, {"Title": "Eson 5.0 Phone", "Author": "Cynthia Myers", "ReviewID": "R3FRW5NE0K4BMO", "Overall": "4.0", "Content": "This phone is a total disappointment.  We cannot get the phone to work. We called Straight Talk to get help but without success.", "Date": "May 5, 2014"}, {"Title": "I bought two, returned both!!", "Author": "Abigail Olson", "ReviewID": "R1PM90915N4RCV", "Overall": "1.0", "Content": "I had a difficulty hooking up to my new company, Verizon couldn't switch my contacts because it wouldn't connect to the switch- transfer box thing. It never connected to the internet. DOESN'T WORK WELL WITH NET10! and on my net 10 account it claimed my phone was inactive and I was still paying and I could still make calls and the texting sucked, I pressed one button and the touch bounced to the other side of the phone wierdly... Dont know how but nothing responded and I hated it!", "Date": "January 29, 2014"}, {"Title": "this phone is great! You should buy it!", "Author": "jeannie attignol", "ReviewID": "REP18J74QPYR2", "Overall": "5.0", "Content": "This phone works so well with games and apps. Both cameras on this phone work great, the quality of this phone is shocking it works smooth and fast. The screen is a really good decent size for a phone, iphones have smaller screens than this phone. This phone has air gestures just like the gs4. This phone is really good for a person looking to upgrade from a slow freezy phone. But if your a person who likes all of the name brand phones than this phone is not for you.This phone is great for the price.", "Date": "May 17, 2014"}, {"Title": "I like the style and the big screen", "Author": "Chrissy", "ReviewID": "R23FQHJYF54SNQ", "Overall": "3.0", "Content": "This phone is great to have but it`s slow I have prepaid T-Mobile and it runs slow on this phone...How would I make it faster? Any suggestions", "Date": "April 3, 2014"}, {"Title": "uhhhh...", "Author": "review", "ReviewID": "R26HKR0ZXE152", "Overall": "2.0", "Content": "Why does this phone say \"demon\" when I turn it on and off?? This really creeps me out and I don't feel comfortable having the phone in my room...", "Date": "March 28, 2014"}], "ProductInfo": {"Price": "$104.50", "Features": "Model:Feiteng H9503 S4 Band: 2G : GSM 850/900/1800/1900MHz 3G : WCDMA 850/2100Mhz(if your sim card doesnot fit these frequency,pls donot buy it.) Sim Card:Three SIM, Three standby (2 x SIM Card Slot and 1 x Micro SIM Card Slot) Service Provide:Unlocked Style:Bar Color:Dark Blue, White Shell Material:Plastic   System OS:Android 4.2 CPU:MTK6572 Cortex A9 dual core, 1.2GHz    ROM:2GB RAM:512MB\nScreen Display Size:5.0 Inch Type:IPS, Capacitive touch screen Resolution:854 x 480 pixels  Screen Color:260K Colors   Support Format  Ringtones Type:Polyphonic/MP3 Audio File Format:MP3/WAV/AMR/AWB Video File Format:3GP/MPEG4 Image File Format:JPEG/BMP/GIF/PNG/GIF E-book Format:TXT/CHM/DOC/HTML FM Radio:Yes, earphone needed Earphone Port:3.5mm Card Extend:Support TF card up to 32GB extended   Data Transfer & Connectivity Data transfer:USB/Bluetooth Mobile internet:WAP/WIFI\nGeneral   Camera/Picture Resolution:Dual Cameras, front camera 5.0MP, back camera 8.0MP with flashlight   Language:English, Bahasa Indonesia, Bahasa Melayu, Cestina, Deutsch, Spanish,Filipino, Italiano, Magyar, Nederlands, Polski, Portugues, Romana, Slovenscina, Vietnamese, Turkish, Greek, Russian, Hebrew, Arabic, Persian, Hindi, Thai, Korean, Simplified/Traditional Chinese Phonebook:500 Message:SMS/MMS Input:Handwrite/Keypad WIFI:Yes, 802.11 b/g/n Bluetooth:Bluetooth 2.0 Gravity Sensor:Yes Multi-Touch:Yes, 2 points touch Dimensions:140.4*72.2*9.4mm Net Weight(Including battery):130g Standby Time:About 2~3 days Other Feature:GPS, WiFi, FM, camera, Bluetooth, play store, Email,Tethering & portable hotspot, VPN, etc\nPackage Size:153 x 92 x 58 mm  Weight:560g Accessories:2 x 2600mAh Battery 1 x Earphone  1 x USB Cable  1 x Charger  1 x User Manual\n5.0\" Inch Eson Original H9503 S4 Mtk6572 Cortex A9 Dual Core Android 4.2.2 Smart Phone Unlocked Bluetooth Back Camera 8.0mp 3g Wifi", "Name": "5.0\" Inch Eson Original H9503 S4 Mtk6572 Cortex A9 Dual Core Three Sim, Three Standby (2 X SIM Card Slot and 1 X Micro SIM Card Slot) Android 4.2.2 Smart Phone Unlocked Bluetooth Back Camera 8.0mp 3g Wifi (white)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Eev5B0KiL._SY300_.jpg", "ProductID": "B00G5E3KSY"}}