{"Reviews": [{"Title": "A Technical/Hardware Masterpiece", "Author": "Johnny Saigon®", "ReviewID": "R2A5VC3DR55WGE", "Overall": "5.0", "Content": "Last year I owned the Galaxy Note 2. I thought it was a near perfect phablet, except for just two main areas for improvement: Screen resolution/sunlight legibility, and after a while there was noticeable slowdown after too many apps were installed. Now that I have the Note 3, things are much much improved.Lets make this review simple and straight to the point, with a few comparisons to other phones:PROS:1) The biggest and most obvious different when you first pick this up is the screen. And WOW, what a screen it is!There are a handful of improvements:* The resolution has been upgraded to 1080p(from the Note 2's 720p). You can noticeably tell that it is crisper.* You will also find out that it is a lot brighter. This screen has been technically measured to be the brightest screen of any phone, and just now bested by the Samsung Galaxy S5. For us geeks, that means Samsung has upped the brightness levels to an incredible and unheard of 660 cd/m2 max(as tested by DisplayMate).* Sunlight legibility is MUCH improved over the Note 2. The Super AMOLED has AWESOME contrast levels(velvety deep blacks). I can finally use it in the bright sunlight now!* Touch input response is lightning quick. This means when you touch something, it responses nearly instantaneously. It even beats the iPhone 5S, the previous champion, and is only just bested by the HTC One M8.2) This phone flies, almost literally. The Samsung Exynos Octa-core/Snapdragon 800 processors mean this thing will hardly ever lag, and 3GB of RAM means you can multi-task to your heart's content! This phone is AWESOME for gaming.3) Improved S-Pen hardware/software mean it's no longer a gimmick gadget from the original Note. Too much to describe all the functions, and you can do without it for most functions. But business users will really appreciate this once you work on productivity/design apps.4) All those software features! Granted, you can do without most of them for day-to-day things, but being there nonetheless means it will improve your ease of use. The are also too many to go through all - there are literally over 30 features! One of my favorites is the Smart-Stay feature, which uses the front camera to monitor that you're looking at the screen and won't dim/turn off, which is super duper useful for when you are reading the news/web pages, etc., holding the phone up with one hand, and your other hand is pre-occupied. No more having to shuffle your hand and risk dropping the phone to tap the screen when it auto-dims to bring the brightness back up. This is especially and specifically useful for me when I'm reading in bed on my Pulse News app. Also, there are tilt and hand-gesture features for when you want to scroll web pages, emails, zoom in on photos, switch to the next or previous photo or music track, answer a phone call, etc. etc. etc!5) The sound is noticeably louder as well. It doesn't have that immersive stereo effect of the HTC One's dual stereo speakers, but by itself it is louder. This is useful when you are in a noisy environment, and having one loud mono speaker is more useful than having two expansive speakers that space the sound out wider and making it harder to hear. As good as the HTC One sounds, I hate that for most things like music and video, it is so darn soft and frustrating. I now appreciate this one loud speaker setup more for regular everyday outdoors use. Although the new HTC One M8 has much improved and louder speakers than the older M7.6) Having a huge battery means I can do whatever the heck I want with it, and even after heavy use I can still not have to charge it until I'm in bed at night. The one thing that frustrates me most about the HTC One is this very flaw - I literally have to be near a charger/portable charger ALL THE TIME. I just use it to read the news for about 30-40 minutes and 20% will already be gone. And when I charge it, it trickle charges like a turtle! With the Note 3, being able to replace the battery is an added plus, and the USB 3 port means it can charge very quickly, usually from 20% to full charge in about 2.5 hours. But even these two advantages cannot compare to the simple fact that it has a huge-capacity battery in the first place. from about 10am to 2am, with heavy usage, I usually end the night at about 30%, which is actually quite amazing since I am on it constantly - phone calls, checking emails, web surfing, checking sports stats and news, and spending hours using my Pulse News app.CONS:*There are few things you can nitpick, like the design/material quality - for a flagship device it still feels a bit chintzy, not like the premium look and feel of the HTC One or even the Sony/Nokia phones. The plastic back nice a nice leathery LOOK, but it is still cheap plastic and feels just like it. Thank goodness most of us cover our phones with cases, so in that aspect it's not a big deal, just that for a $700 phone it should have been made with much better materials and craftsmanship. With rumors of a new Galaxy luxury line, this may be changed very soon though.*The Touchwiz user interface can be hit or miss. It's not for everyone, that's for sure. There is a minute, but noticeable lag when you open certain apps or switch between apps with the multi-tasker. Luckily, being Android means we'll never have to settle. My recommendation - especially if you like the simple/minimalistic look, is Smart Launcher Pro. Try the free lite version and see for yourself.I can't think of much else really to fault this phone, except for the fact that simply for what it is: It's a niche machine that's half tablet/half phone - it will not satisfy you as a tablet replacement(I feel the perfect size for video/game usage is the 8-9 inch range), and it will frustrate you as a phone because you can never comfortably hold it in one hang, and do all the things you need one-handed(I feel the perfect size for a PHONE is the Apple 5/5S). But if you can compromise to this form factor and accept it for what it is, then there is no better alternative, period. Samsung dominates the phablet market, and that's because this is a nearly flawless multimedia machine with an excellent, crisp, brilliant screen, powerful hardware, useful software, and AWESOME battery life. If you like big phones, you will NOT be disappointed!", "Date": "November 24, 2013"}, {"Title": "All these Note 3's should be unlocked.", "Author": "Marbely Menendez", "ReviewID": "R3DW0DUDER0MT7", "Overall": "3.0", "Content": "This about the 3rd time buying a note 3 from these guys and noticing that either it takes a long time to ship or that the phone is not fully paid of from the original seller. Im writing this as a recommendation to stay cautious on what you buy and no to endure all the headaches of this phone. However, this phone is beautiful and worth it just wish it was much easier to buy.", "Date": "January 30, 2014"}, {"Title": "EXCELLENT", "Author": "tasapio", "ReviewID": "R2RBNTC0OMBTI6", "Overall": "5.0", "Content": "My note 3 came a little sooner than expected and I have loved it! It was exactly as described and I recommend it to everyone! I never want to lose it or brake it. I bought the otter box defender case for it also. HIGHLY RECOMMENDED!", "Date": "March 28, 2014"}, {"Title": "love this phone", "Author": "Kelly Erickson", "ReviewID": "R8DFKB6E6YGD5", "Overall": "5.0", "Content": "Quad core and does multi-window multitasking. This replaced a note II. Large screen. 32 gig rom and put 64 gig sd card in it. Does everything a small computer can.", "Date": "March 13, 2014"}, {"Title": "Recommended!", "Author": "m. demarco", "ReviewID": "R22L9HTLEB60ZN", "Overall": "5.0", "Content": "Fast shipping. Product was as advertised.  Seller was great about communication. I would highly recommend. however. and i knew this before purchasing. and this is why I'm still giving it 5 stars this phone was not unlocked. no idea why but amazon grouped it with other note 3s that were unlocked. it was as simple as a $24 code. Thanks Joey. You are Recommended.", "Date": "February 9, 2014"}, {"Title": "fantastic", "Author": "Mary", "ReviewID": "R4ME70PXV83ZJ", "Overall": "5.0", "Content": "This Note 3 is fast and perfect for business use. I am using it to run Credit cards remotely and customers love it.", "Date": "May 6, 2014"}, {"Title": "Love it!", "Author": "Lisa White", "ReviewID": "R2XXY1EC6K8Y8Z", "Overall": "5.0", "Content": "Love this phone, screen size is wonderful! Battery life is much better than the note. Would surely recommend this one.", "Date": "April 28, 2014"}, {"Title": "Is this a stolen merchandize?", "Author": "Paras & Dave \"PH&DT;\"", "ReviewID": "R4510TMEFJ27I", "Overall": "5.0", "Content": "Nice phone with tons of user friendly features. Powerful wireless communications and crystal clear voice. Its large screen makes it fun to watch video, work and read emails or go through your calendar. I recommend it even though it is a little pricy.", "Date": "April 26, 2014"}, {"Title": "SAMSUNG GALAXY NOTE 3", "Author": "irfan omer", "ReviewID": "R2WFIYAT9DT0SQ", "Overall": "2.0", "Content": "Hello,First of all,I purchased this item to overseas.I bought as a white color phone however it's came black.I am not happy about that.", "Date": "March 31, 2014"}, {"Title": "Not really satisfied", "Author": "Anthony Wilson , Jr.", "ReviewID": "R4T9MJX1JPT5T", "Overall": "1.0", "Content": "I was told this was on tmobile network only but this phone is unlocked.  I wanted the tmobile note 3", "Date": "April 24, 2014"}, {"Title": "Yes, but...", "Author": "Bradley A. Pritts \"Brad\"", "ReviewID": "R1VKSRUG3R382T", "Overall": "1.0", "Content": "Terrific capabilities.  Wonderful Android.  Neat capabilities with voice recognition.  Comfortable size screen (I wanted the \"phablet\" size phone; I have big clumsy fingers!).  Fast response with WiFi.Just one problem.Can't make calls, or connect to the internet well.  Duh.....I am replacing an HTC 1 which died.  My backup phone is an antique Samsung T109 -flip phone with no camera.  My wife's phone is a dumb LG. So why do all of thesephones do a better job of connectivity?????????Problems were not just at home, but at a number of locations around metro Detroit.Because of tight return policies, I cannot afford to study this in engineering detail;when I ask sellers for tech specs they are clueless... (ignorant of customer complaintswith multiple carriers, found online.)So.... sorry, guys,  I really expect to be able to connect to a network!!!!!I requested an RMA from my seller and the phone goes back.", "Date": "May 13, 2014"}, {"Title": "FLAGSHIP Phone for A Reason. Sorry Apple, you have no innovation anymore.", "Author": "Christian", "ReviewID": "R35FY67XHQW5E7", "Overall": "5.0", "Content": "This phone has it all.. Big screen for my big hands, amazing camera quality, GREAT battery life, and customization. I really don't get the FanBoys and Girls that swear that their 3.5in phone and subpar features are better.  Especially since you get a bigger screen, better cpu, more ram all while the price for both iphone and android phones are the same.  You get more tech for your money with Samsung.  What's worse, is that when apple comes out with bigger screens, theres gonna be more of a fan club over a subpar phone.  I own both kinds of phones and tablets (IOS and ANDROID)  And hands down, I would choose android over and over again.  To be exact, I would choose Samsung over and over again.  I can go on and on about this but nowadays its more about preference than anything else.  ANYWAY...Pair this phone with the Galaxy watch and it's a tech junkies heaven.The speed of the CPU makes multitasking and getting things done a breeze.  SO quick. Apps launch faster than ever and I would say that the amount of ram this has, helps in that feat.  There is no lag or latency that i can see when ever i open apps or the camera.The battery, will last me a full day with moderate to heavy use of  the camera, social networks, texting, phone calls, emails, and whatever else this phone has. This is amazing because since the display is a monster, you would think the battery life would suck.The display is breathtaking.  All those blacks and colors makes any HD photo look so crisp and clean.The SView is great.  I love being able to take photos, jot down to do lists or notes, or play music all while the s view gives me the time of day, date, weather, and the amount of steps i took that day.For all you selfie prodigies, the front camera is heaven.  2 megapixels? seems like its at least 5. So clean and clear.The back camera and the Features it has? just wow. You won't actually know until you try it.Most of my phones are rooted and have custom OSes.  Most of the androids I owned before were great but i knew it could make it better.  This phone is at it's best. I won't need to root or change the OS becuase this phone is already a beast.Another plus is that many tech people, Cnet, all those big names say that this phone is future proofed.  They say that this phone can last for 3-4 years and will still be able to compete with the newer phones in the future.  This is the best bang for your buck.  Try it out. I love Android and Samsung. I started with iphone and now i have seen the light with samsung.", "Date": "April 26, 2014"}, {"Title": "FRAUD... SCANDALOUS..BEWARE!", "Author": "LOVE", "ReviewID": "RHMN8T8PI3018", "Overall": "1.0", "Content": "Please be advised that this guy and/or company will communicate with you BEFORE the sale...NO PROBLEM... but as soon as you purchase they do not honor their word... Never ship the Device... Will not respond to your inquiries... Simply put... just a POS!  Thank goodness for a good Credit Card Company that quickly and easily reversed all charges...Even better... Thanks to this... I actually found similar product for $60 cheaper and I have it in hand 3 days later... I guess things do happen for a reason.. THANKS BUDDY!BTW... How do you give ZERO star rating?", "Date": "February 5, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Brand new in Box Galaxy Note 3 Black For T-Mobile Network Only. Clean ESN and Ready to Activate,", "Name": "Samsung Galaxy Note 3 SM-N900T (32 GB, T-Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/41uDN0dvaIL._SX300_.jpg", "ProductID": "B00G197Q4M"}}