{"Reviews": [{"Title": "Incredibly light, fast and beautiful. Is it the best tablet for you?", "Author": "John Ryan", "ReviewID": "R2L2JV5K8KU4SV", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer. Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about. If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game). Then I bought my first iPad, and the laptop became redundant, a boring \"work device\". Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems. It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay. Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked. This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together. The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online. Obviously - you could be reading a review on Amazon about the iPad Air!* Reading web pages. As you can hold it like a book it's great to read the news online (my wife loves the Daily Mail Online).* Reading Books. It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages. Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films. I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Watching TV. With the free BBC iPlayer app you can catch up or download BBC programs* Reading and replying to mail. I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos. Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games. From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio. With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.* Listening to music. I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* Editing Word, Excel and Powerpoint documents using FREE App \"QuickOffice\" (owned and supported by Google).* Editing Pages, Numbers and Keynote documents (Office for the Apple) on the FREE Apple apps.* The list goes on and on.Update: You can edit Word, Excel and Powerpoint documents (plus Pages, Numbers and Keynote) on the iPad (although I'd recommend an external keyboard - see below). It's definately powerful enough, although I'd not expect these apps to cope with REALLY complex document layouts. Great for general letter and document writing though.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus 7 which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen. If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay. Avoid this one.2. iPad mini is a lovely tablet. A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen. Worth the upgrade if you can afford it.4. iPad Air. Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference). Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options. The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store or John Lewis (which I would highly recommend), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory: Once bought, you can't add memory (space for apps, films, books etc). However, the basic price goes up a huge amount (+£80 for the 16g to 32g iPad Air). But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads. Only you can decide, and if you're lucky enough that money is no object then splash out. Otherwise, 16g should be fine for most people.Celular: Allows you to connect to the internet while you're out and about. This will add an additional +£100 to the price and means you can slip in a mobile phone SIM card. This means (for an additional £7-15 a month extra), you can access the internet on the move. Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover. Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it. There's versions which cover the back, or just the screen. Apple charge from £35 to £65 for their (admittedly) high quality fabric or leather covers, but there's many available from £10. Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard (£25-80), as I tend to write a lot of mails and documents (remember it comes with a word processor). I'd recommend the Logitech Ultra Thin iPad Air Case with Keyboard - Space Greyand the ZAGG Keys iPad Air Case Folio with Backlit Keyboard - Black although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully. For example, you can create a reminder on your iPad and it appears on your iPhone. Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip. Blazingly fast!* Improved sound (compared to the iPad 4)* Software including+ iMovie - edit and publish home made movies+ Numbers - Fully functional Excel for the iPad+ Pages - Word processor+ GarageBand - Play a piano or a drum kit+ iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat. As \"Which?\" magazine (in the UK) put it - \"...the best tablet we've ever tested. Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart. If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Date": "February 23, 2014"}, {"Title": "Better power charger, longer lasting power, faster, lighter, and free top quality apps to download!", "Author": "jjceo", "ReviewID": "R4OJ2Q7Q6EGAZ", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moO5TL4XF4CEVJembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moO5TL4XF4CEVJrefresh_preplay() {\n\ndocument.getElementById(\"cv_moO5TL4XF4CEVJchiDiv\").innerHTML = document.getElementById(\"cv_moO5TL4XF4CEVJhiddenPre\").innerHTML;\n};\ncv_moO5TL4XF4CEVJrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moO5TL4XF4CEVJso;\t   \n\n\nfunction cv_moO5TL4XF4CEVJloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moO5TL4XF4CEVJso = new SWFObject(swfLocation, \"cv_moO5TL4XF4CEVJAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moO5TL4XF4CEVJso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moO5TL4XF4CEVJso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moO5TL4XF4CEVJso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moO5TL4XF4CEVJso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moO5TL4XF4CEVJso.setAttribute(\"height\", swfHeight);\n          cv_moO5TL4XF4CEVJso.setAttribute(\"width\", swfWidth);\n          cv_moO5TL4XF4CEVJso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moO5TL4XF4CEVJso.write(\"cv_moO5TL4XF4CEVJflashcontent\")) {\n          fp_resizePlayerSpace('cv_moO5TL4XF4CEVJ', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moO5TL4XF4CEVJ';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moO5TL4XF4CEVJ', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moO5TL4XF4CEVJloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moO5TL4XF4CEVJ\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2HJGOUWG5LOWE\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2HJGOUWG5LOWE\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R4OJ2Q7Q6EGAZ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2HJGOUWG5LOWE/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moO5TL4XF4CEVJduration')) {\n      document.getElementById('cv_moO5TL4XF4CEVJduration').style.display='none';\n    }\n    cv_moO5TL4XF4CEVJloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moO5TL4XF4CEVJloadSwf(movieID, playerVersion) {\n   return _cv_moO5TL4XF4CEVJloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moO5TL4XF4CEVJnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moO5TL4XF4CEVJ', 0, h);\n}\n\nfunction cv_moO5TL4XF4CEVJresetPlayer(w,h,bw,cc) {\n  cv_moO5TL4XF4CEVJnewHeight(h);\n\n  cv_moO5TL4XF4CEVJso.addVariable(\"resetBandwidth\", bw);\n  cv_moO5TL4XF4CEVJso.addVariable(\"cacheCode\", cc);\n  cv_moO5TL4XF4CEVJso.setAttribute(\"height\", h);\n  cv_moO5TL4XF4CEVJso.setAttribute(\"width\", w);\n  cv_moO5TL4XF4CEVJso.write(\"cv_moO5TL4XF4CEVJflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moO5TL4XF4CEVJRollOverImg = new Image();\ncv_moO5TL4XF4CEVJRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81kRb%2BHbC3S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moO5TL4XF4CEVJpreplay = document.getElementById('cv_moO5TL4XF4CEVJpreplayImageId');\nif (cv_moO5TL4XF4CEVJpreplay) {\n  cv_moO5TL4XF4CEVJpreplay.onmouseover = function() {\n    cv_moO5TL4XF4CEVJpreplay.src = \"http://ecx.images-amazon.com/images/I/81kRb%2BHbC3S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moO5TL4XF4CEVJpreplay.onmouseout = function() {\n    cv_moO5TL4XF4CEVJpreplay.src = \"http://ecx.images-amazon.com/images/I/81kRb%2BHbC3S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moO5TL4XF4CEVJpreplay.parentNode;\n\n  var cv_moO5TL4XF4CEVJcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moO5TL4XF4CEVJcurrentClick) {\n      return cv_moO5TL4XF4CEVJcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:12 MinsI use an Apple iPad about 6 to 8 hours a day. I own an iPad 2 and 3 and now this new iPad Air version. My main reasons for updating were that I literally fill up my 64 GIG iPad every day or two with videos and photos that I shoot. Having this larger version at 128 GIG allows me to work longer and add more to my iPad. In addition this new version is much lighter and easier to use all day long. Even though the battery is smaller in capacity than my iPad 3 the battery life is longer and it is very noticeable. This is because the faster A7 CPU and the motion chip actually use less power.Please watch my video as I go into more details in it.I immediately noticed the increase in speed. The unit connects to the WIFI faster, synchs with iTunes faster, downloads emails faster and speeds up your web browsing. The differences are very noticeable and enjoyable as a user. The dual speakers are a nice change but I also use a lot of Bluetooth speakers to enhance the sound of the iPad.In my video I do a size and weight comparison to an iPad 2, an iPad 3 and the iPad Air. I also show how the basic set up takes place and for advanced users you can just speed through that portion of the video. The iPad 2 weighs 1 pound 5 1/8 ounces, the iPad 3 weighs 1 pound 7 1/8 ounces, and the iPad Air weighs 1 pound and ¼ ounce. The iPad Air is narrower but has the same screen size. The left and right edges of the iPad are thinner on the sides of the useable screen and you can see that in the video.Here are the key improvements for me:* Much lighter in weight* Thinner, smaller design with the same screen size* Much faster when synching with iTunes* Much faster when browsing the web* Much faster when downloading emails* Stronger WIFI connection and faster WIFI synching* A more powerful AC wall adapter with 5.2 VDC and an output of 2.4 Amps. It charges at 12 watts of power. It operates at 100 to 240 VAC and 50/60 Hz and it is UL approved. It features folding AC wall plugs for easy packing when traveling.* Lower CPU and motion chip power consumption that makes the smaller/lighter internal battery last longer! This is very noticeable!* As usual a beautiful high resolution retina screen with 2048 by 1536 resolution at 264 pixels per inch. You can see the difference in the photos, videos and reading quality of the screen.* Dual speakers in the bottom* Free high quality Apps* iPhoto* iMovie* GarageBand* Pages* Keynote* Remember to download these from Apple!Overall this is a superior product that really outperforms the older iPads that I have. I was disappointed that the new iPad Air did not have the home button with the fingerprint sensor built in. Since I have used it with my iPhone 5S I have really become attached to it and it just seems like a way to cheapen the unit and be more competitive instead of showing and using the enhanced technology. I would have paid a little more for the iPad Air with that sensor.This is still a 5 star product and I recommend it as a very good tablet.", "Date": "November 9, 2013"}, {"Title": "Great apple iPad air.", "Author": "Kolavit Rapeepun", "ReviewID": "RGYAAGM7RK0GH", "Overall": "5.0", "Content": "It is the great tablet I ever have, it works very good in any applications. I want to recommend this iPad air.", "Date": "January 15, 2014"}, {"Title": "Amazing technology! Great if you have a bad back...so light!", "Author": "Dr. Oceanfront \"Oceanfront\"", "ReviewID": "RLU10MLIKRJMZ", "Overall": "5.0", "Content": "First my background...I am an Apple user with a lot of Apple gadgets. I need to be on the computer for 7-12 hours a day.I already own a MacAir, which I love, but as light as it is, it still weighs about 3 pounds ( still, I highly recommend and love my MacAir!).Anyway, I also have an ipad 3 and an Ipad mini, iphone etc., you get the idea. The reason I am mentioning this, is because I have a bad back and that is the only reason I have been updating devices. I am trying to find the \"perfect\" computer for my use. If I can help even one other person out there in my situation ( and save them a ton of money I had to spend <g>), I will be happy! :)First let me tell you a little about the Ipad Air...IT ROCKS!!Although the speed on the Air is much faster then my Ipad 3, whether syncing with iTunes, browsing the web or just getting emails, the speed was not the reason I upgraded. I am not a game player or a number cruncher so the speed of the ipad 3 was just fine for me.What did get my attention was the weight! I had already bought the new ipad mini, which is super cool and a lot of fun.I actually intend to keep it. However, as good as it's screen is, I cannot see me using it 10 hours a day. If I had 20 year old eyes, it might have beat out my Air! ;-)The a Ipad 3 was about 1.7 pounds. That may not seem like a lot, but for me it could not be a one handed device. I needed to put a case on it, making it 2 pound device. Compared to the Ipad Air, which is about 1 pound, that was almost a 50% reduction in weight! The reason the reduction is so much, is I do not feel I need a case with the Air. I have covered it with clear coat all over and that is it. I do not seeing it slipping out of my hands. However, when I travel, I will use a 5 oz cover or just a Smart Cover (3.5 oz).I know it can be dangerous, not using a case, but I am extremely careful and i bought the special Apple warranty. Besides, isn't the reason we spend so much on these because they weigh so little and are aesthetically pleasing?It is too beautiful to cover up. So far, no regrets at all, but I need to find something to lean the Air against while lying down.As for the obvious the screen is just amazing and I love how fast the internet speed is. The rest of the specs are in a great review above mine, so I won't bore you with repeating them.If you have any back or neck pain, or are just getting a little bit older, you will appreciate the big difference in weight then this is the unit for you, hands down.If you are looking for a great innovative Ipad, then this is your baby.As for the fingerprint sensor...we'll I have one on my mini. Frankly, there have been times I have used it, such as if a friend needed to get in and asked for my password. I would just reach over and put my finger on the sensor and the issue was resolved. Other then a situation like that, I always use the 4 number code because it just seems faster. Anyway, my point is don't let that be a deal breaker for you.Lastly, I bought 64gb, although I was leaning toward 128. I was told with the \"Cloud\" I won't need all that storage. None the less, I suggest you get at least the 64gb if you can afford it. It will give you better resale, but also you will not be stressing about running out of memory.Good luck and I hope this review helped you in some small way. If so, please click \"helpful\" below. thanks! :)", "Date": "December 22, 2013"}, {"Title": "Amazing, just needs a case", "Author": "Daisy70", "ReviewID": "R1GL7FSRAFO9OE", "Overall": "5.0", "Content": "Beautiful and light!  I was amazed how thin this is and that's what I was so impressed by.  But because it's an expensive tablet I of course I had to get a sturdy case.  My only con about this is that the beautiful lightness is now covered with a rather bulky protective cover.  I have kids so this is a must.", "Date": "April 2, 2014"}, {"Title": "What Do You Expect...It's An Apple!!�", "Author": "Gail Bond", "ReviewID": "R1TYI2KJXQZ1M1", "Overall": "5.0", "Content": "Ease of useLight weightGreat featuresMade for the \"on the go\" personMeets all of my expectationsIt's an \"Apple\"!", "Date": "March 6, 2014"}, {"Title": "Two Ipad Airs wouldn't download apps or rented videos.  24 hours later I was still waiting.", "Author": "Natural World", "ReviewID": "RC2BXZHAZMVOH", "Overall": "1.0", "Content": "It's hard to believe that in one month Apple sent me two new Ipad airs 64 GB Wi-fi+cellular sine the first didn't work right and they sent me a second.  I had difficulties downloading apps on both of them.  The first one after 3 days it wouldn't download the apps.  I am not talking about weird apps, I am talking about the \"best apps\" in the App store.  The Apple technician in Itunes Dept had me go through all of these exercises to diagnose the problem.  He said the Ipad was malfunctioning.  He said that they would take it back, and Apple would send me a new one.  But the Itunes technician said I couldn't return it \"yet\" because they would have to send me a box to pack it in, and the boxes were on \"backorder\".  I told them that I still had the original packaging the ipad came in, and I could send it back in that package.  He said no I couldn't because it wouldn't protect the (malfunctioning) ipad in transit.  Is this ludicrous or what?  I can't send a malfunctioning ipad back to Apple in the original packaging because it might get damaged, but that same packaging was standard for sending customers their new ipads!!!  I called the Apple Store.  Then I called tech support, and I was put through to someone who made sense of this silly matter.  He had a fed-ex label e-mailed to me, I printed it out, and mailed it back in the original packaging.  As soon as my ipad was scanned by Fed-ex, he released a brand new Ipad to me.  Problem solved, huh?  No.  The second ipad had less difficulty downloading apps, and it didn't take as long.  However, I went into Itunes to rent a movie.  I thought I would be able to watch the movie right away, but the download process took 12 hours.  No where on the ipad does it say, \"Once you rent this you have 'x' amount of time to watch it  until you have actually paid for the movie.  I had to wait 24 hours for the whole movie to download.  Then I downloaded another movie.  After two days, the entire movie still had not downloaded.  I called the technicians who again walked me through exercises to determine the problem.  The diagnosis on the 2nd ipad was that \"the ipad has a problem\".  This hasn't been resolved yet.  I sent it back to them today.  I don't know what to do next.  The movies I synced from my itunes library played just fine.I also called the Apple Store to ask how long it should take to download apps and movies.  For movies I was told a few minutes.  I called the technicians at Apple and asked the same question of several employees, and I never got the same answer twice.I am an Apple Fan, I have a mac computer desktop, and I own 4 ipods.  I can't believe that Apple's product right out of the box don't work.  I also can't believe when you call the APple store, the discrepancy from one employee to another with regards to their familiarity with the product.  It's like comparing Apples & Oranges (get it?  Apples.....).  THe same is true with the technicians.  I have had very good luck previously with Apple.  I am wondering if there are many others out there who have had similar problems with this new Ipad Air.  Such a disappointment.", "Date": "February 5, 2014"}, {"Title": "They sent the completely wrong ipad", "Author": "Christi Farmer", "ReviewID": "R3UMZTLIDIWHMN", "Overall": "1.0", "Content": "What I ordered was clearly written on the invoice, and what I received wasn't even close. It was a gift so it was terribly disappointing. They don't have wifi, so I ordered an ipad with wifi and cellular, they sent a wifi only ipad that didn't even have a US plug. I am very very disappointed. I have always trusted Amazon.", "Date": "January 8, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00GCRQYTG"}}