{"Reviews": [{"Title": "State of the Art  Android phone", "Author": "Regi Sylvain", "ReviewID": "R20H34NJP5HVA6", "Overall": "5.0", "Content": "This gets 5 stars as that is the maximum one can rate.Following are the reasons:1. I have been using a Galaxy S3 for the last few years and was looking for a change. Being on a budget this time,I didn't really know what I would get for one sixth of the price.There were of course cheaper ones available but had such horrible reviews that I was deterred to go for one.2. I took a chance on this one and boy what a surprise.3. Set up was quite easy.I inserted ny AT&T; unlocked simcard and network was automatically set up.To my surprise I  saw the \"H+\" on the side of the signal bars indicating that it was hooked up to  HSPA+ equivalent to 3G or above,4. Remember to put \"Data On\" to access Data features.5. The (1280*720) display was awesome. Super clarity and pleasant colors.6. The processor  speed is fast and navigation a breeze.7. Downloading apps could have been easier with a great processor and super wifi speed.8. Camera is good and takes great pictures9. This is an extremely great phone for its price.Highly recommended.", "Date": "January 12, 2014"}, {"Title": "Just Like a Note 2 - Well Built, New and was shipped fast.", "Author": "Todd Johnson", "ReviewID": "R1F3QRRE71XUHO", "Overall": "5.0", "Content": "Like others I had my concerns about a generic phone, but after being with Virgin Mobile/Sprint for 4 months I could not wait to get back to T-Mobile.First, Right out of the box the product was NEW, in shrink wrap, never used.Second, I placed my T-Mobile SIM card in the phone and H+ showed up on the data speed.  Which means this is 3G or 4G.  This is not a LTE phone.  But my download speed was 14.2 and 11.9 mb/s respectively.  This is faster than DSL.  More than I would ever need.Third, The phone is rooted.  Meaning the full android platform is open and available.Fourth, The phone has 4GB of internal memory which is more than I would need and I have added a 8GB SD Card for additional storage.  Others say the phone had limited memory.  I have found this to not be the case.Fifth, It comes with 3 screen protectors, and a white flip cover to protect the screen.  It also comes with headphones and a extra battery.Sixth,  I upgraded from a Galaxy S3 to this phone and have found the call quality excellent, the speakerphone works as any other phone.Seventh, It is well constructed easy to set up right out of the box and have received compliments.  Most my friends could not believe I could purchase such a phone for $150.00 and be this high quality.  Now they are ordering!Eighth, You would be foolish not to buy this phone.  It works, looks and operates just like a Galaxy Note 2, the cases fit same.Ninth,  The phone is also fast on the fly opening programs, with no if not any latency. NO CRASHES!andTenth, Buy this phone over others.  In my professional view, this phone must be manufactured for the \"sam\" company without the name brand on it.  I matched up a Note 2 and most the markings are exactly the same.Well worth the money, dont get into a contract and screwed by the carriers.  You will be more than happy with this phone!", "Date": "March 25, 2014"}, {"Title": "GREAAAATTT!!!", "Author": "jasimand", "ReviewID": "RW1OBJPKLGAM5", "Overall": "5.0", "Content": "I purchased this phone 2 days with one day shipping came on timeThis phone met all my expectations works with straight talk Sim...Pictures are clear..internet moves fast...have not had a prob with memoryI love this phone ..screen size is nice volume is nice and loudSpeaker phone works great.. I love my new galaxy 2 ..lol", "Date": "March 21, 2014"}, {"Title": "Great Phone", "Author": "tbutton4", "ReviewID": "R36BDB6L3SZS8B", "Overall": "5.0", "Content": "the phone is awsome!  We put our AT & T sims in phone and everything worked, no problems.  We had to buy another phone due to not having a warranty with carrier and did not want to spend a fortune.  The phone was priced very reasonable, under $150.00, it is not cheap looking at all......We think is comparable to a note II.  I would recommend this phone to anyone.  Our friends have commented on how nice the phone is.  This phone is very user friendly and easy to get around.", "Date": "February 3, 2014"}, {"Title": "disappointed", "Author": "young", "ReviewID": "R21590YJJY10J2", "Overall": "1.0", "Content": "I wonder why this phone was highly rated by people who purchased this phone. I am very disappointed i purchased it and not able to return it. the quality and hype about the phone is not as it seems. buyers should try and be honest with their rating", "Date": "May 21, 2014"}, {"Title": "Overall, it is good enough device for the price.", "Author": "little corner", "ReviewID": "R1RXW3PAU181EJ", "Overall": "3.0", "Content": "Works well with both ATT and T-Mobile sims.  Speaker is weak, but not a main concern to me.  Receive ROM 2GB instead of 4GB as advertised.  However, I decided to keep it as external memory is my preference anyway.Only problem I have with the device is not enough RAM.  Have to eliminate many apps not run off external SD card.", "Date": "March 27, 2014"}, {"Title": "5.5 inch phone", "Author": "Vicky", "ReviewID": "R333P2KOMMINGX", "Overall": "3.0", "Content": "Nice size phone if you are looking for something big, I have only had it for one day thus far I like what I have experienced with the exception on the fact that I get a message that says this SIM was set as default SIM card for messages service, I get this every time I turn the phone on what is that about?  For some reason I can't send or receive  any picture text message, I really have a problem with that (can't get pictures of my grandbabies :(  Also, there are some numbers in my contact that I can't text to while most numbers I can.  My carrier is Straight Talk which operates on AT&T; tower and I had no problems setting the phone up after inserting my SIM card.This is a really nice phone if you don't mind these few issues", "Date": "March 21, 2014"}, {"Title": "Amazing HD screen.Brand new came out like a hot cake from the box.Works super with AT&T;", "Author": "saun", "ReviewID": "R39FWEF5JEN1DI", "Overall": "5.0", "Content": "Yes I somehow got the same feeling as if a hot cake had come out of the factory sealed shrinkwrapped box.The phone was brand new crisp and one of the biggest surprises.This phone has a super 1280x960 HD screen.Excellent for watching videos and you tube.This awesome display on a large 5.5 inch screen is a feast for the eyes.The dual core MTK does its job well with super fast browsing and makes multitasking easier.One is able to toggle between apps without having to see the phone freezing like most Chinese knockoffs do.The set up is automatic .Takes a few seconds.This phone works best with AT&T; with instant network connection,Great call quality and  super data speed.The wifi range is quite good and the connection secure and solid.The 8 MP camera is one of the best in the market.Most popular apps come  preloaded but downloading any more is fairly quick and easy.I would rate this phone easily over any generic android in the market.The phone is extremely reasonable priced as well.Super value for money.", "Date": "March 10, 2014"}, {"Title": "I am short of words for this fascinating phone.", "Author": "KEITH DEPIRO", "ReviewID": "R1PTPQXB94HAGW", "Overall": "5.0", "Content": "Don’t know where to start I am stunned with the beauty of this phone.....this phone is absolutely WICKED!Here are the reasons for my excitement:- Dual core A7 1.3 ghz PROCESSOR! its really quick!- REAL MALI 400mp graphics chipset! It will run ANYTHING on the appstore effortless!- 512mb of system RAM -and its really efficient too! {under full load,never uses more than 326mb!}- 4gb of on board storage {2.1gb partition storage /and / 1.3gb partition for O.S. and swap file...good thing!}-WILL take a 32gb micro sd card- great touch screen ! very smooth and responcive- android 4x wet jb5 Mother board in phone! {very quick and powerfull! }- runs on a 3.4.5 linux kernal build ver. 8! {its a modders dream!}- runs on Android 4.2.2 {and YES, it had Wireless Display capability! }- display rez 854 x 480 {extreamly sharp on a screen this size!}- Wifi range is AWSOME! {i benchmarked it at 128ft line of sight and no packet loss...very clean!}- great reception on at@t and t-mobile! {quick data speed and never dropped a signal between florida to texas!}-extreamly good battery life! {16hrs of Massive usage on full charge! watches 3full movies/ downloaded 9 torrents/ listened to 2 pink floyd albums/ used calls on bluetooth all day/ and surfed the web constantly ! This phone is a BEAST!=) }Frankly I don’t know where to stop there is so much to say,you really need to use it to find out for yourself.This phone is the BEST amongst its competetors i have ever tested hands down! it ran EVERYTHINGsmooth and clearif you need a big sized phone with POWER stlye and elegance ! than this is the phone to get !comes with a really nice leather case for it , and it looks just like a little version of a Note3 ,its adorable and perfect!i love this phone! and you will too", "Date": "June 10, 2014"}, {"Title": "i like it", "Author": "ossam", "ReviewID": "R24XCWQYDXZSC9", "Overall": "4.0", "Content": "I like the way it looks and it's easy to use also I like the 2 Sim card but one thing it was hard for the at&t; to put the data in the phone but finally I got it right thanks you the cell phone is cheaper then samsung Galaxy", "Date": "June 9, 2014"}, {"Title": "Good phone", "Author": "Dearylle Shields", "ReviewID": "R3U1ZOMSHW4E0Y", "Overall": "4.0", "Content": "This is a excellent phone for the  price. This unlocked android phone does everything that the more expensive phones do. My only issue so far is it didn't arrive when promised. I paid for 3 day shipping.", "Date": "June 4, 2014"}, {"Title": "Worth every cent paid, and more", "Author": "Adedayo Doherty", "ReviewID": "R17HA04V4G18D2", "Overall": "5.0", "Content": "This phone has exceeded my expectation in every area of function, from phone calls to internet browsing, from apps performance to camera use.  Highly recommended for those who do not want to invest too much in a phone but want a great smart phone.", "Date": "June 2, 2014"}, {"Title": "This one's got great looks and brain ! Outstanding phone!", "Author": "terria hall", "ReviewID": "R3L9EC8RHG5PU4", "Overall": "5.0", "Content": "Before I start my review on this gem of a phane I am a bit surprised at some of the critical reviews below as they are way off the actual qualities of the phonethe actual qualities of the phone.My guess these could be people who have something against Lightahead. I wish people would be honest in their review and guide Amazon customers correctly.Here are some of the great features of this smartphone.Ø  Very elegant looking, lightweight and an extremely attractive leather back.Ø  Large 5.5 inch screen ideal for browsing and watching videos.Ø  Call quality is perfect.It is crystal clear and crisp.Absolutely no dropped calls.Ø  Very efficient MTK processor.Ø  Bright and clear screen with great vibrant color display.Ø  Instant set up with AT&T; great connectivity and strong H+ signal.Ø  Instant Wifi set up great internet connectivity.Ø  Accurate GPS which is user friendlyØ  MMS is a breezeØ  Fair memoryØ  Most popular apps are preloaded.Ø  Good music player.Ø  Clear camera with good focused pictures.Ø    The N7100 note2 cover fits well gets everything in right place like the camera etc.Ø  To sum up this is a stael of a deal at one forth of the Samsung note 3 price to which it compares well.Ø  Highly recommended.", "Date": "May 30, 2014"}, {"Title": "danahatesit", "Author": "Bob Fettinger Jr", "ReviewID": "RYGJP0NUNMEXY", "Overall": "1.0", "Content": "Truly terrible phone, has a big screen, but no memory, poor picture quality, constantly disconnects from WIFI and often freeze's up and you have to remove battery to restart.", "Date": "May 29, 2014"}, {"Title": "Was an OK phone for a few days", "Author": "S. Fuhrman", "ReviewID": "R32ECPBEMIZHSL", "Overall": "2.0", "Content": "I wanted to like this phone, and for the first few days I thought we would get along just fine.  After owning an S4 that suffered a bad drop and broken screen, I was looking for an inexpensive smart phone that wouldn't make me cry if it fell in a lake or suffered a bad drop so decided to give this phone a try.First few days went fine, this isn't a really fast phone and sometimes is laggy, but that was to be expected and was something I can live with.  It worked fine for making calls, checking email, and playing music. Bluetooth works fine. Battery life was actually surprisingly good and it made it through a day no problem.  The screen is where you will notice a difference if you are used to more premium devices... it is very directional like an old laptop screen, blacks aren't that black, and brightness control is a bit crude.  Still, it worked and I could put up with a sub-standard screen for the price. GPS seemed to work ok.On day 3 the little ear hole cover piece dislodged itself and things started going down hill. Day 5 the touchscreen calibration was way off, where I had to press about 0.75\" to the right of where I was trying to press.  Day 6 the phone became unusable because the lower portion of the touchscreen became unresponsive to any touch and now I am unable to unlock the phone.  I think I will be returning this phone and probably get a Moto G for a bit more.  Unfortunately this phone seems to be plagued by build quality.", "Date": "May 27, 2014"}, {"Title": "First one didnt work. The second works great. Not a single problem", "Author": "will ma", "ReviewID": "R2UBL7JQLZ4NF9", "Overall": "4.0", "Content": "Its unlocked and its working greatThe 5.5 inch size and price is well worth the purchaseRecommend buying this especially if you're tired of small displays and long contracts.", "Date": "May 25, 2014"}, {"Title": "piece of junk but good paper weight!", "Author": "Mike Collins", "ReviewID": "R2Q6M7T9D5LID9", "Overall": "1.0", "Content": "This phone really sucks, Chinese is NOT the way to go with cell phones!!!! If only I had known before I spent all that money.", "Date": "May 20, 2014"}, {"Title": "Do not buy!!! This is a warning", "Author": "Karisa R Quarker", "ReviewID": "R3F494AKMDY3E7", "Overall": "1.0", "Content": "The phone arrived and the packaging was great. I was so excited to open the box and start using my phone. Upon opening I noticied the screen of the phone had what seemed to appear as a \"sweat mark\" in the middle of it. When I took the backing off of the phone the mark went away but reappeard only when the backing was on it. The charger that came with the phone did not work. Its been exactly a month and the phone won't even charge!!!! I'm disappointed in this product.", "Date": "May 20, 2014"}, {"Title": "Wow! You cant beat this Android Beauty", "Author": "Carl Redford", "ReviewID": "R1ZCRQFJZAO8YQ", "Overall": "5.0", "Content": "This ones got everything one could ask in a high end Android phone.Easy set up.Great 4G connection on AT&T.;I set it up with a net10 card which hooked up to AT&T.;Bear in mind for Net10 you need to set up the APN manually. But at the time of registration the website does provide you with the necessary settings.This one has  a bright screen,a great camera and comes loaded with most popular android apps.The playstore  is awesome and downloading apps couldn't have been easier.The shape is awesome and the huge 5.5 screen is a beauty for watching your favourite videos.The call quality is crystal clear and in 5 months I hevent dropped a single call.It is a very good looking phone and anyone would be proud to carry it.At the listed price it is a steal of a dea.Compares well to note 3 T one one fourt of price.Super buy", "Date": "May 2, 2014"}, {"Title": "I phone", "Author": "Josphat Yego", "ReviewID": "R12EDC5VSZT8BP", "Overall": "4.0", "Content": "The phone is good and can do several functions from phone to e mail and other  daily activities. The only suggestion is that I wish they had a more sturdy cover or one you can us a a cover without necessarily removing the back cover. The screen saver did not stick for the second phone.", "Date": "May 2, 2014"}, {"Title": "fix for mms issue", "Author": "Ron", "ReviewID": "RS36ZREIIDF2G", "Overall": "4.0", "Content": "To Vicki under system settings mobile networks gonto APN settings and make sure APN type is set to default MMS and WAP check mark all 3", "Date": "April 24, 2014"}, {"Title": "Great Value for the price.", "Author": "Ronaldo", "ReviewID": "R1ZBRMX9BNOVVI", "Overall": "4.0", "Content": "Works great with Straight talk getting 3G or H internet speed.When you are buying the straight talk sim use only the white (At&T; network).T mobile or Simple mobile will work only on Edge(slow speed).Stylus pen doesn't work, Camera is Ok not great.Anything else including the Dual sim feature works amazing, I use it for personal and business.I highly recommend.", "Date": "April 20, 2014"}, {"Title": "One of the best android devuces in the market", "Author": "sandra", "ReviewID": "R274UE3NEHSB5T", "Overall": "5.0", "Content": "This has everything you ask for in a good Android smartphone.This is a state of the art device Super large HD screen.Great sound quality. Easy set up.Fully unlocked.Downloading apps us easy and play store fully integrated.Works great with 4G connection of AT&T.;Name sure to use it with AT&T; only.The vendor is offering a free set up kit of net 10 which works on 4G At&t; which will make your  phone experience much better.Overall an excellent phone", "Date": "April 4, 2014"}, {"Title": "Bad batteries", "Author": "luis e rivera", "ReviewID": "R2DY31AC14EL9D", "Overall": "2.0", "Content": "Even though the phone by itself was impressive had issues with both batteries, none would take charge instead it would go up to 40 or 50% but then drop to as low to 2% as soon the charger was disconnected, even though it had been connected for a period of upto 24  hours or so. Also no manual, just a single sheet with no usefull information for someone new to the world of Androide, (I have years of experience with IOS and windows phone) I had to return item and won't risk buying another one.", "Date": "March 27, 2014"}, {"Title": "great for the price", "Author": "Milton", "ReviewID": "R1J20C893A39X5", "Overall": "5.0", "Content": "iPhone is great. it does what is supposed to do. if I have to give any negative comment is the low memory.  that is somewhat resolve because it is rooted.", "Date": "March 21, 2014"}, {"Title": "this phone", "Author": "Autumn", "ReviewID": "RHN6BE6YJWDIY", "Overall": "5.0", "Content": "ahh i love it it cme in perfect condition looks and acts very brand new and is very fast and i just popped my sim card in and it started working like that i believe i would cry if i lost this phone :) thanks", "Date": "March 17, 2014"}, {"Title": "you get what u paid", "Author": "victor", "ReviewID": "R1KINB6BCJWOHU", "Overall": "2.0", "Content": "what i likesince i wear Reading glasses , the  big screen  Works fine for me, the os Works fine and so far wont crash  when surfing  the web.the voice is clear, no problema using it with gsm servers.what i dont likethe camera takes very low quality pictures, the earphones, stylus and case are  99Cents ítems  , they are uselessthe screen isnt very responsive,  i don't reccomend this cell pone.", "Date": "April 23, 2014"}, {"Title": "would give 5 stars if i could get the internet to work", "Author": "Estella", "ReviewID": "R1OKRU67Y94V09", "Overall": "3.0", "Content": "Phone looks just like the note 2 so I was excited to get it. Was delivered on time. Love the big screen. My problem is I can't get the internet to work. I made sure to click the data connection button but still No internet.I can't download anything or even get on the internet. I really like the phone but I really would like my internet to work. So if someone could help solve this issue. Im to the point to where I'm ready to send it back because I can only talk and text on the phone. So lighahead feedback would be helpful.", "Date": "April 2, 2014"}, {"Title": "A super christmas gift.Awesome android phone", "Author": "desmond cruise", "ReviewID": "R2DC4LTDPUGZWA", "Overall": "5.0", "Content": "Where do I start? There ls so much to say about this lovely android phone that I am falling short of words.First the lovely 5.5 inch HD screen is a pleasure to the eyesI have already seen a few movies and the reception was awesome.The sound quality is great.The set up with At&T; couldn't have been easier.Got H+ within seconds of inserting the simThe Wi-Fi connectivity is good.Memory is adequate and most popular apps come with it.Downloading apps couldn't have been easier.Fast downloads.The GPS is accurate .MMS works just fine.Overall great value for money.", "Date": "March 3, 2014"}, {"Title": "lots of issues !", "Author": "Jarol Cruz", "ReviewID": "R2229D2BGIZSWL", "Overall": "2.0", "Content": "Lots of connection issues , does not receive wi fi ,  I guess you get what you pay for, will not recommend this phone", "Date": "February 21, 2014"}, {"Title": "lots of issues !", "Author": "Jarol Cruz", "ReviewID": "R2229D2BGIZSWL", "Overall": "2.0", "Content": "Lots of connection issues , does not receive wi fi ,  I guess you get what you pay for, will not recommend this phone", "Date": "February 21, 2014"}, {"Title": "Great Phone for price", "Author": "Jrstewart83", "ReviewID": "R18E45H0K8CWS6", "Overall": "5.0", "Content": "Very solid phone. Swapped sim card and SD card and i was up and running within minutes of opening. WIFI,BT, everything works. Came with an extra battery and white case to. (case would be good if not white for me) Phone is rooted already. I recommend installing a sim card and telling apps to install to that. There is also and ADB edit to make stubborn apps run off card.  Internal memory isn't much. I think i will be buying china phones from here on out. It could be a touch faster but im sure there are other models with better specs. Now that i feel comfortable with these i will eventually go all out and get a beefier one. Does everything i need though.", "Date": "March 12, 2014"}, {"Title": "decent cell, most Note2 cases will fit it =)", "Author": "Chris Swiontek", "ReviewID": "R2H9HLQJAWR716", "Overall": "4.0", "Content": "decent cell, looks identical to a actual Note2 , and most cases WILL FIT this phone!i used :http://www.amazon.com/gp/product/B00AAN6V1O/ref=oh_details_o04_s01_i01?ie=UTF8&psc;=1and it fits perfectly {all buttons and ports line up exactly}bright sceen and sensitive touch.speaker is loud and reception is quite good.on at&t; you will get 3g data speed , and on T-mobile you will get 2G edo data speed {was still pretty quick tho}good battery life {it will make it thru a day of heavy usage easilly}In conclution,if your looking for a cellphone that looks almost identical to a REAL Note2 ,and ACTUALLY get cases for it, this is the one to get.", "Date": "March 5, 2014"}, {"Title": "dont buy this phone", "Author": "rainbow", "ReviewID": "R2SWLOJ83ICFRR", "Overall": "1.0", "Content": "I was disappointed with this phone.I bought a sim card but It took time and I reprogramme everything but it seems it didn't work good.So, I decided to set aside this phone.And take note the language of this phone I can't re programme.Too bad! I wasted my money to bought this .", "Date": "February 23, 2014"}], "ProductInfo": {"Price": "$199.00", "Features": "*Please scroll down to avail of the free NET10 simcard & activation kit in case you need one*•\n•Another High Quality Android 4.1.1 Unlocked Dual Sim from Lightahead® •Fully Compatible & Works with all GSM carriers like AT&T;, T-MOBILE; Works 3G/4G on AT&T; & 2G on Tmobile\n•Large 5.5 inch HD Super QHD Capacitive screen,\n•MTK 6575, 1.6GHz, RAM 512MB/ ROM 4GB\n•Wi-Fi, Bluetooth, Browser, Gps Navigation", "Name": "Lightahead® Unlocked LA-N7702 5.5 inch HD Super Capacitive screen Dual SIM Card Android 4.1 MTK6575 GPS WiFi 3G mobile smart Phone 3G/4G on AT&T, 2G on T-mobile works with all GSM networks free case (WHITE)", "ImgURL": "http://ecx.images-amazon.com/images/I/51c3QxYCOxL._SY300_.jpg", "ProductID": "B00GBD5CWQ"}}