{"Reviews": [{"Title": "Great on Day 1. Awful After 2 Months", "Author": "Richard Brown \"Rich\"", "ReviewID": "R7LHL7UPW54DD", "Overall": "2.0", "Content": "I reviewed this when I first got it an said: \"This is absolutely the first phone I've had that I absolutely love.\" After 2 months, it has become the first one that I absolutely HATE.First of all, after a week, the screen started showing scratches.  I've been buying smartphones and tablets for 4 years, and never had a need for a screen protector...and never had a single scratch. This one already had a scratch on it by week 1, and now two months later, it's covered with scratches like my old Nintendo DS used to be.The manufacturer faked some of the settings, so that it reports that it's a 1080p screen, whereas it's actually closer to 720 (If you run a diagnostic program, they somehow got it to give the results that you would get on a 4.7 inch screen instead of 5.7).The battery life is atrocious. Worst of all, somehow I managed to get this permanent spot in the middle of the screen that looks like my index finger somehow has become permanently a part of the screen underneath the outer glass.....It's very noticeable and impossible to get rid of.I strongly advise you to stay away from this phone.", "Date": "February 21, 2014"}, {"Title": "U9000", "Author": "Nancy Vu", "ReviewID": "R2OFBGISPGYDDL", "Overall": "5.0", "Content": "This phone has really amazing quality for a knock off phone. Runs smooth, no problems connecting to T-Mobile, comes with all it says like the extra battery, S-View case, charger etc all in a nice box. JellyBean is preinstalled. Why buy a $700 Note 3 when you can get one for $500 less? I'm very impressed! I highly recommend this for those who can't afford the cost of a nice phone but want basically the same thing!", "Date": "March 3, 2014"}, {"Title": "It works perfect.", "Author": "Casca Adjepong", "ReviewID": "R2CWP0TBSRAIK5", "Overall": "5.0", "Content": "This phone works perfect and the touch screen is very sensitive. It is an awesome phone. I have recommended a number of my friends to try it.", "Date": "February 15, 2014"}, {"Title": "This phone is a great Note 3 look alike", "Author": "Juan mendez", "ReviewID": "R1GI0IRUT0S5IX", "Overall": "4.0", "Content": "Pros:PriceQuickResponsiveLightFeels great in your handHuge screenSamsung appsCamera is 13 mega pixelsCon's:The buttons are the bottom are a bit offThe pen is super fake. Plastic and the button doesn't work.Camera takes 50/50 pics. Some are great and others are not so greatBattery lifeSpeaker sound is avg.", "Date": "March 15, 2014"}, {"Title": "Ulefone U9000 Smartphone Android 4.2 Mtk6589 Quad Core 5.7 Inch Hd IPS ( Still testing it out)", "Author": "TeeTee \"Make Everyday Count\"", "ReviewID": "R2XFA3ER1R2U8D", "Overall": "4.0", "Content": "Ok i order this phone 3/2/14, with a 2 days shipping, came on time 3/4/14. This is a true U9000 with the correct rams,rom,and pixels. I'm only getting 2g service via T-Mobile. I might try At&t; next month, The day i got the phone i was leaving out of town 4 hrs later via amtrak train so yano service would be buggy. Before i left home i upload all my apps from play store via WiFi and everything ran fast and smooth. I also sent a few test picture text and that work fast and fine. so far the phone is working great, 1 or 2 minor problems with the Air Command pen, Sometimes when you pull it out it do not always activate the air command window but after re inserting and releasing it will appear, Its also alil hard to pull it out as if its a tight space. The eye sight gestures works sorta of flimsy meaning if your eyes turn away it don't always stop a video right away as if its a delay sometimes. And also same with the hand turning the page/screen gestures it works a little buggy as well. But these few minor things is not a big problem considering this phone is less than 250.00, I got complements about the sharpness of my picture the back side camera take great pics really clear, sharp and nice, and my family had a Galaxy S4 and my pics was better than his pics The front camera takes good pics also depending on the lighting its not as sharp as the back, But trust me both cams take good pics and videos. Sound quality is great and loud.Im doing this review about a week after getting this phone. I will spend the next few days checking it out more. So far its really a 5 Star phone. I will edit my review later this weekend.*******************Updating 3/25/14******************************My only issue with this phone is battery life. I'm so sad about the charging time and life time. This would be a good phone for the price if it last long enough or charge faster. If anyone know of a 3200Mh i can use with this phone please let me know. I will but it.***********************Updating 4/11/14**********************************************************Phone Still working great, Today i went in a radio shack and tried out a Note 3 outta box and it fit perfectly.. and if that fit that means mostly all note 3 cases fit, Everything lines up the same as the S-Note 3 and this phone.", "Date": "March 12, 2014"}, {"Title": "It was even better than expected", "Author": "Jose Gonzalez \"Jose\"", "ReviewID": "R5CS12B263XI9", "Overall": "5.0", "Content": "First off, this is a *DUAL* Sim phone, and NOT single Sim as it says in the description-- that's a good thing!I've also got a genuine Samsung Galaxy III, and this phone matches it in every way, except this one costs 1/2 or 1/3 as much as a Samsung.PROS- Brilliant display, exactly same like my Samsung- Dual SIM cards- Comes with a Note 3 S-View cover, like this one http://www.amazon.com/Samsung-Galaxy-S-View-Cover-Folio/dp/B00F3580BI/ where it turns the phone on and off automatically when you open and close it- Comes with two batteries- It's unlocked (you can choose whatever carrier you want, or have two carriers with the dual SIM cards)- Fits with any Samsung Note 3 case.- This phone is underpowered compared to a Samsung Note 3 (less memory, slower processor), but honestly I don't notice it.  It works fine for Netflix, Evernote, the kind of stuff I use.  If you want to play Halo or graphics heavy games, you might want to get the horsepower in the Samsung Note 3 instead.  But you're saving $400 here-- you can buy a PS4 or Xbox One with what you're saving, if you really want to Halo...- I was worried as this is a \"Chinese Knock off\" delivered from China, but it feels just like a Samsung Note / Galaxy.- Shipping was free / includedCONS- The pen that comes with it-- just buy another pen if you want to use a pen.  Even better, just use your finger.- Ships from China... it took 2 weeks to arrive.- As the manufacturer is from China and the warranty is 30 days... you're kind of screwed if you break this thing.  So get a nice protective case.  That's the trade off for saving all the money", "Date": "April 15, 2014"}, {"Title": "MUCH TO MY DISMAY, HAD TO RETURN IT AS TRACFONE WON'T SUPPORT IT FOR PHONE AND DATA SERVICE!!!!", "Author": "Stephen Spinner", "ReviewID": "R1H28IXQ2FV2AJ", "Overall": "1.0", "Content": "Most unfortunately, the description of what phone services included Tracfone, but Tracfone requires an installation of an incompatible data card for web browsing and no Sim support to attach the phone to their phone service!!! Had to return it and buy a phone on their approved list of Android phones.", "Date": "April 16, 2014"}, {"Title": "Great so far", "Author": "Donna R. Roland \"Az Sunshine\"", "ReviewID": "R1PB9BV6GGKC04", "Overall": "5.0", "Content": "I am a Grand and Great Grand mother this is my first smart phone so I am catching up!!! Had just a wee bit of problem setting up for Straight Talk to get picture messages etc. but follow the steps on the follow up email not what they give you on the phone and it works great.  So much in this phone that it is unreal so it is making me think and work, a younger tech savy person would have no problems and enjoy it to it's maximum abilities.  The only problem I have had is transferring some of my ringtones as they were MP3 and this phone is OGG but I will figure it out!!! Don't hesitate to order this phone it is remarkable.  My tech savy friend says only unremarkable thing about it is only 1GB of Ram but I probably wont use that much anyway. So don't wait if you are on the fence it is a Galaxy Note S with a different name.", "Date": "April 14, 2014"}, {"Title": "Help", "Author": "greatkids6+1", "ReviewID": "R1T3H85M0UWR52", "Overall": "4.0", "Content": "I use my Ulefone U9002 unlocked on Straight Talk network (AT&T;). I rate this phone four stars becauseI can NOT text pics to others and can Not receive pics via text from others.  How do I fix this? rh", "Date": "March 20, 2014"}], "ProductInfo": {"Price": "$399.99", "Features": "Free Tether - Use your 3G data service as a WiFi hot spot and connect your notebook, ipad or other device for free. No need to pay monthly tether fee\nUnlocked world GSM phone. 3G - 850/2100, 2G -850/900/1800/1900. Compatible with at&t;, T-Mobile, Straight Talk, Simple Mobile and other GSM networks. Please make sure your SIM card is not locked with PUK code\n3G - 850/2100 bands. Fully compatible with at&t;, stright Talk & Net10 at 2G/3G. compatilble with T-Mobile & Simple Mobile at 2G. For Straight Talk, Trac fone, Simple Mobile or Net 10 will requires a manual APN setup\nCPU\tMTK6589, Cortex A7 quad core, 1.2GHz; GPU: PowerVR SGX 544\nSim Card:Single Micro-SIM Card Single Standby", "Name": "Ulefone U9000 Smartphone Android 4.2 Mtk6589 Quad Core 5.7 Inch Hd IPS Screen 3g GPS Air Gesture- White", "ImgURL": "http://ecx.images-amazon.com/images/I/41kCHPcq1kL._SX300_.jpg", "ProductID": "B00G4TRU54"}}