{"Reviews": [{"Title": "It's BAD", "Author": "Manuel Negrin \"MRNY\"", "ReviewID": "R1QRCIX4FMPP5Q", "Overall": "1.0", "Content": "This pone is slow. very bad. Don't buy it. The Android is fake 4.2. And the RAM is 256 Mb. very poor.", "Date": "April 20, 2014"}, {"Title": "bs phone", "Author": "jalen", "ReviewID": "R1X4KOQQFT4VXD", "Overall": "1.0", "Content": "Internet sucks because its a foreign phone. It also moves very slow. Apps close on their own very disappointed person", "Date": "March 22, 2014"}, {"Title": "POOR EXAMPLE OF A SMARTPHONE!!!", "Author": "Georgette Anderson", "ReviewID": "R9LFEHPA5HFBL", "Overall": "1.0", "Content": "THIS PHONE IS A TOTAL WASTE OF TIME AND MONEY!  IT DIDN'T EVEN DESERVE 1 STAR. NO INTERNAL MEMORY ...DO NOT BUY!!!", "Date": "March 22, 2014"}, {"Title": "works poorly", "Author": "reevi60", "ReviewID": "R10T35BE5QIY5Q", "Overall": "1.0", "Content": "This phone would not hold a charge, keep on the AT&T; network, It also kept dropping my calls. I love the size of the phone, it answers easily.However. it is not usable for me. I have it in the box it came it and bought a cheap go phone to replace it until I can upgrade my phone and may just keep the go phone for now. I can't recommend this phone to anyone.", "Date": "February 8, 2014"}, {"Title": "It is an excellent phone for this price for overseas use.", "Author": "Ron", "ReviewID": "R36T7Q5AEQ6MJL", "Overall": "4.0", "Content": "Phone is exactly as described in the description (screen size, CPU and tech description); comes with a price tag that is reasonable for what it offers. It is unlocked and offers quad frequency so can be used as cell phone any where in world.For \"data plans\" it has 2G and EDGE that is what I felt reasonable for overseas use. Obviously it is not 3G or 4G and for that reason you don't have to go in the different frequencies issue that different networks use across world.I have reduced one star as its ROM is fairly less as one would expect these days.Overall - great for a worldwide phone and minimal internet use.", "Date": "May 17, 2014"}, {"Title": "Awfule!!", "Author": "Rayceem H.", "ReviewID": "RXCS7KV4F5HHV", "Overall": "1.0", "Content": "I dont recommend anyone buying this phone, it has so many problems that ive been tempted to destroy it so many times!", "Date": "May 17, 2014"}, {"Title": "data not work", "Author": "jose valderrama", "ReviewID": "R3BDRSE9FQIDC6", "Overall": "1.0", "Content": "the phone works fine for making calls, it's okay to take pictures, has good presentation, but to be a smart phone does not work with the data I tested three different lines are the apn changes have commanded them to review, then updated the software and this phone does not work it is essential that the data does not send multimedia message, whatsaap not work, the google play no hunger, nor in short is not a smart phone is a simple cell.", "Date": "May 6, 2014"}, {"Title": "it sucks", "Author": "Michael C.", "ReviewID": "RNMHI0E28N4OH", "Overall": "2.0", "Content": "this phone has many problems. first it won't ;let me send or receive picture messages. then, i can't talk to anyone without my calls being dropped. this phone is really not a good phone.", "Date": "April 25, 2014"}, {"Title": "Very good", "Author": "Sabina Granado", "ReviewID": "ROP42N1HS72JZ", "Overall": "4.0", "Content": "Very good product, I recommend it. Excellent quality, as it says the publication. presentation is very good, the price adjusted.", "Date": "March 10, 2014"}, {"Title": "service needed", "Author": "Kev Johnson", "ReviewID": "R38Z3ZH4JTIS40", "Overall": "2.0", "Content": "I purchased this phone only to use in Barbados. Did not work well with pre paid services. I had to buy a service plan to avoid spotty service", "Date": "June 9, 2014"}], "ProductInfo": {"Price": "$74.99", "Features": "Unlocked Quad Band Dual SIM\nGSM 800/850/1800/1900MHz\nAndroid 4.2\n4.7 inch Touch Screen Resolution:854x480Pixels, 1600K Colors\n256MB", "Name": "Unlocked Quadband Dual Sim Android 4.2 Os with 4.7 Inch Touch Screen Smart Phone - At&t, T-mobile, H20, Simple Mobile and Other GSM Networks (Black) with Free case", "ImgURL": "http://ecx.images-amazon.com/images/I/51x2WejP0mL._SX300_.jpg", "ProductID": "B00G8F2OR8"}}