{"Reviews": [{"Title": "Great Phone, but buy from Google Play Store!", "Author": "Kushal Joshi", "ReviewID": "RFY36NGCV9RYI", "Overall": "5.0", "Content": "12/21/13 Update:So about 2 weeks ago Nexus 5 users received the 4.4.2 update, it brought many small improvements but the greatest being improving the camera. It shoots very clear shots now, the camera app opens quicker and the camera takes a lot less time to focus. If the camera was something that turned you away from the Nexus 5, then come back because the issue has been fixed. Google says they will keep working on the camera to make it even better.(Stay tuned for any other updates)Original Review:I sold my S3 to get this phone on the Google Play Store and I recommend you do as well (It costs less on the Google Play Store)[...] The total ends up being less than $400 for a smart phone that is priced way to low for what it has to offer.Pricing:$350- 16 GB$400- 32 GB A Snapdragon 800 Quad-Core Processor clocked at 2.3 Ghz? A Adreno 330 GPU, all these sound to good to be true! Such great specifications at such a low price? But, nothing matters if there is no applicable real world performance, and I'm glad to say that you will be zipping through games and apps!Here are some Pros and Cons:Pros:-Phone feels great in the hand, not to big or not to small-Great Build Quality, better than phones that use plastic like the LG-G2 or S4 (It uses the grippy plastic found on the 2013 Nexus 5)-Buttery Smooth and Fast as Lightning, this phone is that fastest phone I have ever used, hands down-Pure Stock Android (Kit-Kat 4.4)-You get updates as soon as they roll out! No waiting for months to get the next version of androidCons:-Because it only packs a 2300 mh battery, it does ok for daily use, but don't expect to get any crazy battery life, (Standby time is amazing though, it sipped through only a 1% of battery through the whole night!)-Camera is decent, but video quality is great! The mic is the best I have seen on any smart phone, (A software update may improve camera)-Availability, I love this phone, but getting your hands on one can take a bit, but please believe me, it is worth the wait!-Speaker is just all right, it sounds OK but not greatTotal Scores:Build Quality: 9/10User Experience: 10/10Android Kit-Kat (Nexus 5 Experience): 10/10Camera (Photos): 7/10Camera (Video): 9/10Speaker: 7/10Summery:If you looking for a phone that delivers the best Android Experience, a cheap off contract phone, a phone with great specifications, or just a phone in general, This is the best phone currently on the market. While it has some minor flaws, there is no other phone that offers this much for this little.Total Score:9/10", "Date": "November 10, 2013"}, {"Title": "Fast, super-thin and understated design.  As good as the iPhone?", "Author": "John Ryan", "ReviewID": "R8NYAKQ1TKDJP", "Overall": "5.0", "Content": "The Google Nexus 5 is the latest, fastest Android phone from Google (built by LG). Incredibly fast, light and thin - but is it as good as the iPhone 5s costing more than double the price? Read on to find out.....Firstly, a word of warning. This is a lengthy, thorough and in depth review to compare the two phones - not just trash one or the other. I personally have an iPhone 4S, iPad Air, an Apple TV and several Macs. However, I also have an open mind and limited budget.Display----------The Nexus has a stunning 5 inch HD screen with more pixels on a larger screen, and they're more densely packed. For the techies among us, the Nexus is 1080x1920 pixels and 445 pixels per inch (ppi). This clearly beats the iPhone's 4 inch retina screen at 1136x640 pixels at 336ppi.But what does this really mean? It means you get a bigger, better quality screen than an iPhone 5s (which as a fan of Apple, really surprises me). What it means, is photos and videos just look absolutely stunning, and web pages razor sharp.In short, screen quality on the Nexus is absolutely brilliant, with pure whites and super-sharp text on a larger screen. A clear winner for the Nexus.Speed---------Both Nexus and iPhones are blistering fast. Web pages display instantly, scrolling a breeze, and you can rapidly jump between apps. So not a lot in it. This is an incredibly fast device for the money.It's also worth noting both Nexus and iPhone support the super-fast 4G network as well as existing 3G. You may pay more for a 4G contract (although not from Tesco Mobile or Three), but if you want to get the best out of your phone it's a consideration.Look, Feel and Build Quality-------------------------------------Lets be honest here. The iPhone wins hands down on the top quality, hard edged aluminium industrial design from Sir Jonny Ive. It's lighter, smaller and thinner than the Nexus, and if you have smaller hands (but deeper pockets), it's a beautiful device. A top end BMW 5i compared to a Ford, Peugeot or VW Golf.The Nexus is physically larger with rounded off corners, a lightly curved rubberised back, and tough \"Gorilla Glass 3\" screen. Quietly understated, although the Nexus 5 is (on paper) very slightly heavier, (see specs below), it also \"feels\" lighter - incredibly light in the hand given the relatively huge screen size.I have to admit, the Nexus does sit nicely in the hand, feels light, and the screen is just massive - but if you're looking for top quality Android - you need to pay around double the price, and buy the  HTC One (M8), but on build quality - the iPhone wins.Camera-----------Considering both have an 8 mega-pixel camera with optical image stabilisation (ie. the camera tries to compensate for shaky hands), the iPhone wins by a fair margin. Automatic zoom on the Nexus is a bit hit-and-miss. I often find you need to use the \"tap to focus\" feature, and annoyingly even this doesn't work perfectly sometimes, especially in low-light conditions where the iPhone wins.Having said that, in normal outdoor situations, it's great for quick snaps, and you can always use a \"proper camera\" if you're really serious about photography.Battery Life---------------Always difficult to tell without a head-to-head test, and even then I think it depends upon how you use the phone. Typically video over WIFI burns the battery and a review (search for \"V3 iPhone Nexus compare\" to see) has helpfully done much of the work for us.Nexus ran 7.5 hours compared to iPhone 5S at 7. So (despite other Amazon reviewer gripes), it's pretty much comparable.Having said that, today I've blitzed the phone today. Downloading Apps, searching on Google, navigating and watching videos of-and-on for the past 11 hours, and it still has 18% battery left.I'll update this review after a few months real world experience.Storage----------Nexus comes with 16 or 32Gb of storage compared to iPhone's 16, 32 or 64Gb, and neither have expandable storage. Having said that, I've lived happily with a 16Gb iPhone for nearly five years without issue, but it depends upon how you use it.Price-------For once it's absolutely black and white.  Compared to the iPhone - the Nexus 5 is an absolute bargain.  Fantastic value for money.What about Apps?-----------------Firstly, an App, is a small \"application\" (a program) that runs on your phone or tablet, and there's thousands available from both the Apple and Android stores. Be aware they're \"Apples and Pears\" - an Apple App will only run on an iDevice (iPhone, iPad etc), and you'll need an Android App for this phone.Many apps cost $1 - or 69p in real money, and there's thousands free (frequently advertising funded with an ad-free version for 69p). Here's my favourites:-* Mailbox.  Incredibly slick mail box app (gmail only - sorry).  (Free)* Go SMS pro. (Go Chat on Apple) Send and receive text messages. (Free)* QuickOffice. Edit Word, Excel and Powerpoint documents. (Free)* Evernote. Write and organise notes. Edit them on your Nexus, iPhone, iPad, PC or Mac (Free)* DropBox. Access your files, documents and photos anywhere. (Free)* Tune In Radio. Listen to 1,000s of radio stations world-wide (£2.40)* Spotify. Stream music for £5 a month (or free with ads). Brilliant! (Free)* eBay. Buy and sell your stuff while you're out and about. (Free)* Zite. Online web magazine that learns what you like. Terrific! (Free)* Movies by Flixter. Read reviews of films on cinema and DVD. (Free)* Kindle. Read your books from Amazon Kindle bookstore. (Free)* 1Password (reader).  Read only access to passwords.  (Free)Note: All of the above without exception are available on Apple and Android, and some (Evernote, Spotify, DropBox and Box) also run on PCs and Macs.So to my mind - it's a draw. OK, so it's common knowledge that many new apps (typically games) are first launched on the iPhone first, but the market for Android Apps has matured, finally catching up with Apple.Admittedly, I do find iPhone versions of Apps tend to be slightly better versions, as they seem to be launched on Apple first, and Android second, but the difference is not crippling.Viruses - Apple Vs Android------------------------------Unlike Apple who stop you buying Apps from anywhere else, on Android you CAN buy Apps from the equivalent of a \"dodgy bloke in the pub\" - or indeed reputable companies like Amazon. It's up to you really.On Android, if you try to install an app off the internet you get the message \"For security, your phone is set to block installation of applications not obtained from the Android Market\". You can unset this on \"Settings --> Applications --> Unknown sources.In short, if you get a free copy of an App by mail or a web site and you ignore the warnings and install it - you risk getting a virus. It's your call.Operating System---------------------The Nexus runs Android whereas Apple run iOS. Personally I think much is down to taste and what you're used to.Worth noting however, is the Nexus is one of the few Android phones which aren't loaded with additional \"bloatware\" rubbish. Samsung for example, load their phones with a confusing (and unnecessary) \"Touch Wiz\" interface to differentiate their offering. Personally I'd always stick to a Google Android device. As well as avoiding the useless bells and whistles, you get upgrades direct from Google. Other phones often take months to provide upgrades (sometimes never). Worth knowing, if you're considering another Android phone.The statistics-------------In common with Apple, I've tried to avoid quoting \"the numbers\" except to illustrate a difference as pure stats can often misleading. But for those who like to compare:-GOOGLE NEXUS 5OS: Android 4.4.2 (KitKat)CPU: Quad core 2.27Ghz Snapdragon 800Space: 16g or 32gScreen: 5 inch (diagonal) , 1920x1080 (HD) display with 445 pixels per inchCamera: 8 MP with Optical Image StabilisationSize: 137.9 x 69.2 x 8.6 mm - very thin bezel, almost all screenWeight: 130gAPPLE iPHONE 5sOS: Apple iOS (7.1)CPU: A7 chip with 64 bit architectureSpace: 16g, 32g or 64gScreen: 4 inch (diagonal), 1136x640 with 326 pixels per inchCamera: 8MP with Optical Image StabilisationSize: 123.8 x 58.6 x 7.6 mmWeight: 112gOverall Conclusion--------------------Well, I guess in conclusion I bought a Nexus not an iPhone, and that says it all.On balance, the Nexus 5 is:-* Blisteringly fast* Has a beautifully clear, large display (without being silly)* Runs an excellent version of Android (direct from Google so bang-up-to-date and without bloatware)* Runs all the Apps I already run on my iPhone* Is MUCH cheaper!Lets be honest, if I had cash to burn, I'd love an iPhone 5s (or even better a 6). I think the iPhone is a beautiful example of industrial design with top end build quality. Add to that the superb integration with the iPad, Mac and Apple TV, not to mention the security of the touch ID fingerprint scanner, and I can understand why they charge more.If you really can't stand Apple (or think the iPhone screen size is too small. but have the money, I'd also consider the HTC One (H5).  Apple quality build on Android.However, at this price, it's a steal. Absolutely astonishing value for money, and highly recommended. Buy it!", "Date": "May 10, 2014"}, {"Title": "Great phone", "Author": "Elizabeth Tsurkov", "ReviewID": "RSVMKRKBA5LI3", "Overall": "5.0", "Content": "The phone is very beautiful and slick and Android Kit Kat (4.4) has a very clean touch to it.The phone's camera takes a few seconds to focus, so this phone isn't suitable for people who want to snap quick pics.", "Date": "January 20, 2014"}, {"Title": "Worth the Money...!", "Author": "Kenneth", "ReviewID": "R2KBP2NV688KYZ", "Overall": "5.0", "Content": "As there are already detailed reviews about this SMARTphone, I will keep mine short and simple.-> For a person looking at the latest technology (up-to-date gadgets), this has to be your pick. Definitely comes in the top 3 SmartPhone available in the market today.-> Really fast processor that makes every flick/swipe or tap lightening fast - No lags at all-> Google Play Store sells the unlocked version of this SmartPhone at $ 350 (plus or minus a few dollars).-> Designed to look sleek and attractive. No complaints about the design. (Even with a hard-case on the phone looks impeccable)-> Camera has inbuilt image stabilizer to make every click a perfect picture. No more shaky pictures or shaky-hand syndromes. :)-> Refined microphone for better clarity for all those voice-activated or voice-enabled applications.-> Really good video quality.In short, invest in this SmartPhone and never you will not regret. I am right now flashing my new thing-a-ma-jiggy to everyone and making them envious... :)", "Date": "January 1, 2014"}, {"Title": "Nice phone with some limitations", "Author": "rpv", "ReviewID": "R3N5HMS1NI89U0", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo8ZAJ04IC8AK4embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo8ZAJ04IC8AK4refresh_preplay() {\n\ndocument.getElementById(\"cv_mo8ZAJ04IC8AK4chiDiv\").innerHTML = document.getElementById(\"cv_mo8ZAJ04IC8AK4hiddenPre\").innerHTML;\n};\ncv_mo8ZAJ04IC8AK4refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo8ZAJ04IC8AK4so;\t   \n\n\nfunction cv_mo8ZAJ04IC8AK4loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo8ZAJ04IC8AK4so = new SWFObject(swfLocation, \"cv_mo8ZAJ04IC8AK4AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo8ZAJ04IC8AK4so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo8ZAJ04IC8AK4so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo8ZAJ04IC8AK4so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo8ZAJ04IC8AK4so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo8ZAJ04IC8AK4so.setAttribute(\"height\", swfHeight);\n          cv_mo8ZAJ04IC8AK4so.setAttribute(\"width\", swfWidth);\n          cv_mo8ZAJ04IC8AK4so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo8ZAJ04IC8AK4so.write(\"cv_mo8ZAJ04IC8AK4flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo8ZAJ04IC8AK4', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo8ZAJ04IC8AK4';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo8ZAJ04IC8AK4', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo8ZAJ04IC8AK4loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo8ZAJ04IC8AK4\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1CAHHAB2YY31P\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1CAHHAB2YY31P\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3N5HMS1NI89U0\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1CAHHAB2YY31P/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo8ZAJ04IC8AK4duration')) {\n      document.getElementById('cv_mo8ZAJ04IC8AK4duration').style.display='none';\n    }\n    cv_mo8ZAJ04IC8AK4loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo8ZAJ04IC8AK4loadSwf(movieID, playerVersion) {\n   return _cv_mo8ZAJ04IC8AK4loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo8ZAJ04IC8AK4newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo8ZAJ04IC8AK4', 0, h);\n}\n\nfunction cv_mo8ZAJ04IC8AK4resetPlayer(w,h,bw,cc) {\n  cv_mo8ZAJ04IC8AK4newHeight(h);\n\n  cv_mo8ZAJ04IC8AK4so.addVariable(\"resetBandwidth\", bw);\n  cv_mo8ZAJ04IC8AK4so.addVariable(\"cacheCode\", cc);\n  cv_mo8ZAJ04IC8AK4so.setAttribute(\"height\", h);\n  cv_mo8ZAJ04IC8AK4so.setAttribute(\"width\", w);\n  cv_mo8ZAJ04IC8AK4so.write(\"cv_mo8ZAJ04IC8AK4flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo8ZAJ04IC8AK4RollOverImg = new Image();\ncv_mo8ZAJ04IC8AK4RollOverImg.src = \"http://ecx.images-amazon.com/images/I/716Fo1RGYbS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo8ZAJ04IC8AK4preplay = document.getElementById('cv_mo8ZAJ04IC8AK4preplayImageId');\nif (cv_mo8ZAJ04IC8AK4preplay) {\n  cv_mo8ZAJ04IC8AK4preplay.onmouseover = function() {\n    cv_mo8ZAJ04IC8AK4preplay.src = \"http://ecx.images-amazon.com/images/I/716Fo1RGYbS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo8ZAJ04IC8AK4preplay.onmouseout = function() {\n    cv_mo8ZAJ04IC8AK4preplay.src = \"http://ecx.images-amazon.com/images/I/716Fo1RGYbS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo8ZAJ04IC8AK4preplay.parentNode;\n\n  var cv_mo8ZAJ04IC8AK4currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo8ZAJ04IC8AK4currentClick) {\n      return cv_mo8ZAJ04IC8AK4currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 8:33 MinsI like Nexus 5 in its pure vanilla experience. Main concern, no microSD card slot. Sound volume is low even at highest setting. This becomes a concern when driving in highways. I have to use a powerful bluetooth speaker. Otherwise this is a great device. I knew the limitations, still bought one. Look at my video review of Nexus 5 Black phone.In my opinion, following are key specs to consider when you buying a phone. Most of others are standard or does not matter at all. First size,weight and resolution are part of look and feel. RAM/CPU part of performance. external Storage is part of expandability. Camera is obvious! SAR (Specific Absorption Rating) is an often ignored, but I feel essential to making a buying choice. Manufacturers don't advertize or mention SAR prominently.phone parameters: {size, weight, resolution, ppi, RAM, ext Storage, camera, CPU, USA SAR rating}Google Nexus 5: 5.43 x 2.72 x 0.34 in, 130 gm, 1080 x 1920 pixels, 4.95 in, 445 ppi, 2 GB RAM, no ext Storage, 8 MP/1.3 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.3 GHz Krait 400, 0.92 W/kg (head), 1.23 W/kg (body)Samsung Galaxy S5: 5.59 x 2.85 x 0.32 in, 145 gm, 1080 x 1920 pixels, 5.1 in, 432 ppi, 2 GB RAM, microSD upto 128 GB!, Qualcomm Snapdragon 801, MSM8974-AC Processor: Quad core, 2500 MHz, Krait 400, 0.63 W/kg (head), 0.82 W/kg (body)Samsung Galaxy S4 (Intl version): 5.38 x 2.75 x 0.31 in, 130 gm, 1080 x 1920 pixels, 5.0 in, 441 ppi, 2 GB RAM, microSD, up to 64 GB, 13 MP/2MP, Exynos 5 Octa 5410 CPU, Quad-core 1.6 GHz Cortex-A15 & quad-core 1.2 GHz Cortex-A7, 0.85 W/kg (head), 1.55 W/kg (body)HTC One M8: 5.76 x 2.78 x 0.37 in, 160 gm, 1080 x 1920 pixels, 5 in, 441 ppi, 2 GB RAM, microSD upto 128 GB!, 4 MP (rear), 5 MP(front for selfies), Qualcomm Snapdragon 801, Quad core, 2300 MHz, Krait 400, 0.94 W/kg (head), 0.83 W/kg (body)LG G2: 5.45 x 2.79 x 0.35 in, 143 gm, 1080 x 1920 pixels, 5.2 in, 424 ppi, 2 GB RAM, no ext Storage, 13 MP/2.1 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.26 GHz Krait 400, 0.50 W/kg (head), 0.69 W/kg (body)Apple iPhone 5S: 4.87 x 2.31 x 0.30 in, 112gm, 640 x 1136 pixels, 4.0 in, 326 ppi, 1 GB RAM, no ext storage, 8 MP/1.2 MP, Apple A7, Dual-core 1.3 GHz Cyclone (ARM v8-based), 1.12 W/kg (head), 1.18 W/kg (body)Samsung Galaxy Note 3 N9000: 5.95 x 3.12 x 0.33 in, 168 gm, 1080 x 1920 pixels, 5.7 in, 386 ppi, 3 GB RAM, micro SD upto 64 GB, 13 MP/2MP, Exynos 5 Octa 5420, Quad-core 1.9 GHz Cortex-A15 & quad-core 1.3 GHz Cortex-A7, SAR: 0.24 W/kg (head), 0.72 W/kg (body)Nokia Lumia 1520: 6.41 x 3.36 x 0.34 in, 209gm, 1080 x 1920 pixels, 6.0 in, 367 ppi, 2 GB RAM, microSD up to 64 GB, 20 MP/1.2MP, Qualcomm MSM8974 Snapdragon 800 CPU Quad-core 2.2 GHz Krait 400, SAR: 0.59 W/kg (head), 0.24 W/kg (body)Motorola Moto G: 5.11 x 2.59 x 0.46 in, 143 gm, 720 x 1280 pixels, 4.5 in, 326 ppi, 1 GB RAM, no ext storage, 5 MP/1.3 MP, Qualcomm Snapdragon 400, Quad-core 1.2 GHz Cortex-A7, SAR: 1.17 W/kg (head), 1.06 W/kg (body)Given the above key specs, my suggestion to my friends is to choose 2 or 3 KEY features you require (may be large screen size, maybe less weight, maybe more CPU power) and then start nailing down the phones. Definitely and definitely go to a phone or a big box store and feel the phone. Nothing replaces that. In the end end you are using it for days and years, so the tactile feel is very important.SCREEN SIZE/RESOLUTION:I have experimented with many phone sizes and I have come to a conclusion 5\" is the best form factor for me. Your mileage may vary, but after using Note for a while, I don't use it as a primary phone. The display in Nexus 5 is absolutely stunning with a Super AMOLED display and you have to see to feel it! I like it as much as Galaxy S4 and S5.ANDROID UI:Nexus 5 has Android 4.4.2 KitKat out of the box. User Interface has a flatter and simpler design, as is now the trend across the industry. Once you get used to user interface you get used to it. Android is very flexible and when I show my phone to a iPhone users they are usually in awe. I recently to my friends shows the details of processes. battery usage like which process takes up more battery and it is geeky and impressive.CAMERA:This can just replace a point and shoot camera. Wait, what is a point and shoot camera?! Very impressive. I use it sometimes, but my Nikon D90 still the workhorse.PROCESSING POWER:Don't bother about it. For 99% of users, this is good enough. The phone has more processing power than the rocket that went to moon first time and much more. The games are very smooth, the UI is very smooth.Qi WIRELESS CHARGING:BIG PLUS on Nexus 5 phones. Very convenient. Period.NFC Tags:Wow, this is the most underrated in all reviews. Get bunch ( I mean around 10) of NFC Tags and use in bedrooms, offices, cars, living room and customize what your phone wants to do in those areas. For example in my S4, when I enter the car most often I use a) Navigation b) Listen to Podcasts. So I program my NFC tags accordingly using apps like Trigger and tap my phone to the NFC Tag and boom, phone does both.Micro SD card!!BIG BUMMER. I am so used to SD card and having tons to stuff. I am feling the pain.OTG - USB Hosts:This is also often ignored feature in many reviews. On the GO USB cable + Nexus 5 means you can use with external hard disks, and virtually many of USB devices. If you have a thumb drive and have files, you can in fact read with a phone and don't necessarily have to open a laptop. works out of the box.BATTERY:Do you really need to care for battery anymore. I don't. Just use the phone. I have battery power banks with capacity as high as 30,000 mAh to 8000 mAh that I can charge virtually anywhere without a power supply. So this has become moot for me in past year. I would also suggest you get power banks and not really care of battery drainage. Use the phone and enjoy!MISC FEATURES:GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). Look at my video review.To give a sample, I tried following apps and they just worked awesome.Amazon Mobile, Androidify, Angry Birds (multiple themes), Asphalt 8, Box, Chrome, NAVIGON (from Garmin - offline maps), TOM TOM, , Google Navigation/Earth/Maps, Google Currents (nice way to read News), Google Drive, Ebay, Linkedin, Google Music, Tapatalk (awesome forum browsing app), Microsoft One Note (legacy docs, skydrive of 25 GB is good), Microsoft Office, (yes they have for Android!), Subsonic Music Streamer, TweetCaster Pro for Android (excellent twitter client), Twit.Tv, Trigger, Google VoiceAsk questions. I will be glad to answer any questions within 24 hours.", "Date": "May 10, 2014"}, {"Title": "perfect phone perfect price", "Author": "Manuel Urbano \"Manuel Urbano\"", "ReviewID": "R3OUBVZMHRV9JB", "Overall": "5.0", "Content": "if you are in doubt whether to pick this or a samsung s4 i would totally recommend this one instead, good price for better features", "Date": "March 14, 2014"}, {"Title": "Very good", "Author": "Jose Luis", "ReviewID": "R3D0C5FMYIBD0Q", "Overall": "5.0", "Content": "Every time I get a new phone it is a lot better than the previous one...no big surprise.  Really, this one seems to be very good.  It is my first android based phone, so it will take some time for me to get used to it, but so far, so good.  Buy it.", "Date": "March 11, 2014"}, {"Title": "Great Phone", "Author": "JavierOcandoC", "ReviewID": "R1DC06P53R6OCP", "Overall": "5.0", "Content": "I have two day with this nexus 5 is nice, i Don't like Android but this phone it's awesome. the screen is very very beautifull. Thanks Tromo Electronics. I am from Venezuela.", "Date": "February 23, 2014"}, {"Title": "Pure Andriod, No bloatware. Fast.. very smooth..Fast", "Author": "Farbod", "ReviewID": "R117V7M2ZD99JF", "Overall": "5.0", "Content": "First of all, pure andriod and you get the latest updates from google as soon as it is released and you don't have to wait 6-12 months to get it on your samsung GS 4 and htc and other manufactures. I had a galaxy gs4 and purchased this phone until the next galaxy gs5 comes out cause i broke the screen on my GS4.. Never going to get anything else besides a nexus from now on. I still really like the gs5 but the touchwiz and other bloatware on the samsung make it a little laggy and uncomfortable. Apps open so fast and web browsing is much smoother on the nexus. You won't be disappointed.", "Date": "February 21, 2014"}, {"Title": "nice phone", "Author": "mohammed", "ReviewID": "R3VOX3AYTB8AM5", "Overall": "5.0", "Content": "i love it so much its a powerful phone with quad core and 2g ram and play all new game on android", "Date": "February 16, 2014"}, {"Title": "great purchase", "Author": "Jerrold Forde", "ReviewID": "RBY3FJQ3TO171", "Overall": "5.0", "Content": "Item was received in a timely manner and met EVERY expectation I had. This is an excellent phone and 1 I would recommend to anyone", "Date": "February 4, 2014"}, {"Title": "Buen telefono", "Author": "Davis", "ReviewID": "R358N6SU6CCUQF", "Overall": "5.0", "Content": "Great Shipping, very fast..this phone is greatthe sound in bad...the battery, to achieve load day, you have to sacrifice a lot of settings to extend the life of energyIt is fast, powerful, fluid and a great screen", "Date": "January 27, 2014"}, {"Title": "Google nexus 5 unlocked", "Author": "anselm edole", "ReviewID": "R33EAQ3ZELR20Y", "Overall": "5.0", "Content": "It's a very good phone. A purchase one cannot regret buying. The features are also cool one can navigate very easily. Recommend the buy to any one.", "Date": "January 18, 2014"}, {"Title": "THE BEST SMARTPHONE I EVER HAD", "Author": "Carlos A.", "ReviewID": "R1AP6GR8F3IA00", "Overall": "5.0", "Content": "he Specs for this phone, model D820 are (taken from Play.Google.com) Network 2G/3G/4G LTE GSM: 850/900/1800/1900 MHzIt's amazing the quality of the camera. resolution of the screen. the system. all is perfect", "Date": "January 15, 2014"}, {"Title": "battery And câmera could be better", "Author": "Renato Beltrame Franchetti", "ReviewID": "R23D9JOQJ7CIYH", "Overall": "4.0", "Content": "Battery life And câmera are not so good, but the rest of the phone is amazing. For this price is awesome", "Date": "January 12, 2014"}, {"Title": "great as a 450$ phone, not good as a premium phone.", "Author": "King James", "ReviewID": "RGCHB83FNXPCE", "Overall": "4.0", "Content": "Let me just say this up front.  I don't like the fact that Sprint and all the other carriers are charging 450$ for a phone that Google on Google Play is charging 350$.  This is another way for these cell phone companies to keep the consumer under their thumb.  But, with that being said, the key word for me \"price,\" and for the price I really do like the Nexus 5, although I do have a few complaints about it.  Let me begin by saying that the white version of this phone and the black version are surprisingly distinct from each other.  I had believed that the white and the black version were the same exact phone just like every other black/white variation of every phone.  But they aren't.  First, they come in different looking boxes.  Just something that I'd thought i'd share.  Secondly, the earpiece (where the ear is when taking a call) on the white version is white while the black one blends into the black borders of the phone. Moreover, the white Nexus 5 is glossy around the sides whereas the black Nexus 5 has dull black sides,  Something to think about if one really cares about fingerprints on their phone (personally, I like the white version).  Now with that out of the way, the things that I do like about this phone is that it is very snappy and quick when swiping and bringing up applications, more so than some of the better spec phones such as the Note 3.  Another thing I like about the phone is it is light but it doesn't feel cheap.  It has a build that feels good in your hands.  And, the resolution on the screen is pretty damn good.  I am pretty impressed by the definition and detail when looking at the screen, and colors look great.  Now that's good news, but here is the bad news.  One of the first things that I've noticed when using the Nexus 5 is that the speaker is pretty weak.  It is not loud at all, and at full blast I couldn't hear the person on the other line when I was out in public.  Another thing that this phone is not good at doing is staying alive.  What I mean by this is that on one full charge, the phone will last about 4 to 5 hours max with regular usage.  If I don't use the phone much I may get a few more hours of standby time.  This bothered me because I need my phone throughout the day and I'm not always near an outlet, plus there's no way to open the phone and throw in a replacement battery. So, that definitely is a large negative for me.  Finally, another weak point on this phone is the camera.  Although the phone has a decent 8 mega pixel camera, the pictures I take in good light are not of great quality.  The pictures seem to be not of the right colors and it seems to dull the light out a bit.  Furthermore,  I can't take rapid fire pictures as each successive picture taken requires a about 2-3 second delay between each other.  But, the camera is surprisingly good at taking low light pictures.  As a matter of fact, the Nexus 5 camera in low light is better than some of the more premium phones with better cameras.  This is something that I really enjoy about the Nexus 5's camera.  Overall, if I was to rate this phone as a regular priced phone, (650-750$) or 200$ with a 2 year contract, I would probably give it 3 stars due to all the flaws (camera, speaker , battery life) the phone has.  But, for a 450$ phone or 50$ on a 2 year contract, this phone is exceptional.  It is exceptional because it functions very well as a smart phone (the touch screen is very quick and responsive and on 4G the internet is quick) and it has great screen resolution.  Personally I bought this phone outright for 450$ and I am happy with it.  But, I think I wouldn't be as happy if I paid 700$ for it.", "Date": "November 22, 2013"}, {"Title": "Its big brother of iPhone (5s) literally, best nexus phone and best smart phone period", "Author": "Amazon Customer", "ReviewID": "R3F3RBFT1JS3TG", "Overall": "5.0", "Content": "One short and sweet one liner -> Nexus 5 is literally a big brother of iPhone 5s. Its as beautiful as black iPhone 5S and Kitkat OS is on par (actually better) with iOS. You can say its bigger iPhone (I mean it) because Android OS is more flexible, customizable and powerful and it is bigger than in size like its big brother. The bigger size definitely helps in games and all kind of media consumption.This device performance is buttery smooth and the overall experience inspires utmost satisfaction. Given its size it feels so light and slim even compared to iPhone 5/5s.It is not even best nexus device so far but best out yet among all.And now I will explain it.--------------------------1. Design, look and build quality-> I differ here from most reviewers who says its plain or boring and nothing stands out of this. Its as good looking as black (space gray) iPhone 5S. Its all black like iPhone 5s. Though its made of plastic its feels sturdy, well built with precision only known to Apple. And for the people who tell iPhone made of aluminum, Nexus 5 sides appears no inferior to iPhone 5S black sides. The front glass is very well fused with the body with almost no gaps. Now what we are left with? Back? The back of Nexus 5 is though made of plastic it feels very good in the hand and due to its matte finish does not seem to slip off.Now one step further...iPhone 5S black (or space gray) seems to have identity crisis of being black or something else, Nexus 5 black is perfectly black and it has got radically different sides (not plain round rectangle which all other smartphones have). The sides are beautifully something else.iPhone 5S beauty is revealing and Nexus 5 beauty being black is mysterious and never gets boring.I love this black beauty and don't blame for my taste as they said \"beauty lies in the eyes of beholders\".\"Simplicity is Beauty and Beauty is simplicity, nothing more, nothing less.\" - Oscar Wilde. If any phone on the market lives up to the Oscar Wilde's quote its Nexus 5.In short its unapologetically simple\".2. Processor/speed-> Buttery/silky smooth. Neck to neck with iPhone 5s and second only to Note 3 for all practical purposes.3. Screen/display-> Awesome. Its better than retina any time as its full HD. The feeling of display being washed up goes away very soon and remember the so called best retina have the same problem as they share the same display technology.4. Ecosystem-> Android eco system is as good as Apple's. In fact I find it better because of Android OS power you have kind of powerful applications which Apple fan boys can never have. Apple fan boys just give a try to 'tasker' (Warning: Only if you can handle Android's raw power.)5. Powerful Soul-> \"Fools are those who don't want their souls to be powerful.\" Its as good as iOS but better why? because its powerful and customizable. You can do the things with it when you need. Its no way comparable to inferior iOS. Apple fan boys! People should not be proud of a system which does not even let them change default for anything.6. Call Quality -> Fantastic. I have never had so clear voice on call for very long.7. Network Signal Quality -> Fantastic.8. Volume/Speaker-> Inherently the speaker is very loud. Though in some application it might sound a little short of enough but its software related problem and should be fixed in future update. I have tested the volume in many application like play and in some apps are freaking load. While playing music through play I had to cut down on the volume in car its so powerful.With headphones its fantastic. The voice quality is very superior and has no noise in it. Its as pure as it gets.9. Camera-> I have seen all the comparisons of Nexus 5 with all leading phones (HTC one, Nokia Lumia, iPhone 5s, Samsung Galaxy S4) and its competing neck to neck in every department except its little slow to focus. But once it focus it takes very good images. HDR+ beats all other phones (I swear it). But again Google admitted it was software related issue and would be fixed soon through update. Personally I am pretty satisfied with the camera.Its at least best nexus phone camera and comparable to others except in little slower to focus. The photos are very detailed with accurate colors.Note: I have uploaded some photos for reference.10. Battery-> No complaints. Nothing great or bad here. Its definitely better than many old phones (including galaxy nexus) and equal to many others.It just falls short of only two smart phones right now which are LG G2 and Note 3. But it's battery is comparable to the best smartphone i.e. iPhone 5s. So if iPhone 5S can be the best with that kind of battery I don't understand how we could complain of Nexus 5. For casual usage you will charging it once a day. The noticeable thing is that in idle mode it does not eat battery at all and that's where it will average out better end of the day.11. Reparability-> iFixit has given its 8 of 10 in this department and you should feel comfortable saving your money on costly repair by doing many things yourself and the whole assembly is modular.Summary-> Even keeping its lower price aside, Its the one of best smart phone and should equal or better any best smart phone on the planet right now. And you add advantage of lower price...", "Date": "November 19, 2013"}, {"Title": "Too legit!", "Author": "Christopher M DeGraw", "ReviewID": "ROFX3EZRGVFQZ", "Overall": "5.0", "Content": "I wish Google had had this item in stock, as this costs more than retail. That said, it arrived a day earlier than it was slated to, and it works perfectly. Broke my Galaxy S4 and needed a new phone mid contract. Very comparable and it feels kind of exclusive because it's technically a 'developer device'. The packaging had tape all over it, as if it had been previously opened, but no sign of anyone doing that. I just like mint packaging. 100% satisfied with my purchase.", "Date": "January 9, 2014"}, {"Title": "Angry", "Author": "Monica Garcia", "ReviewID": "R2FIOYIKGWBJX0", "Overall": "1.0", "Content": "I am very disappointed to pay more for a nexus 5 white and they sent me a black one, I feel cheated.", "Date": "June 10, 2014"}, {"Title": "Powerful, light,beautiful screen.", "Author": "Julio Cesar Casiano Quevedo", "ReviewID": "R22KXI7J19BS5", "Overall": "5.0", "Content": "At almost the same size of my previous Galaxy Nexus and with less weight, it packs a bigger, brighter screen. The perfect recipient for the latest Android version.", "Date": "June 9, 2014"}, {"Title": "Pretty good", "Author": "Tommypku", "ReviewID": "R2ONYVUMJ9A3S7", "Overall": "5.0", "Content": "I bought the cell phone last month.It's pretty good, convenient design, good shape,it's your best choice, please.it's unlocked cell phone.", "Date": "June 8, 2014"}, {"Title": "easy interface", "Author": "Claudio Lijalad", "ReviewID": "R2FIGFYPI8427G", "Overall": "4.0", "Content": "very easy interface for a sixtie years old man...the photo programs are not so easy to run because too many stages", "Date": "June 8, 2014"}, {"Title": "Google Nexus 5 Unlocked GSM Phone, 16Gb (White)", "Author": "Hadouken", "ReviewID": "R1JIPH6ILLM1AP", "Overall": "4.0", "Content": "Like the phone it looks cool, had the phone for a couple of months now and so far it still works amazing.", "Date": "June 6, 2014"}, {"Title": "Excellent performance", "Author": "José Ureña Guevara", "ReviewID": "R2DLJTKVTE58PM", "Overall": "5.0", "Content": "The performance, the shape, the weight and the size is really good. As soon as I get it, I received the most recent updates from Google. No complaints", "Date": "June 5, 2014"}, {"Title": "Great phone.", "Author": "Emmanuel Arko-Cobbah", "ReviewID": "R7M03GFLK2JMP", "Overall": "4.0", "Content": "This is a great phone at a great price. Easy to use. Performs all tasks required. Android is the best and easiest to use!", "Date": "May 29, 2014"}, {"Title": "Great phone for great price", "Author": "OMAR", "ReviewID": "R2B4STJALUHJ2W", "Overall": "5.0", "Content": "This is a good phone,it is working as expected and it is nice,I bought the white nexus and I am very satisfied with it.You can have a good phone for a good price.", "Date": "May 27, 2014"}, {"Title": "Nexus 5", "Author": "Roee", "ReviewID": "R2BQ3WM6KF59QB", "Overall": "5.0", "Content": "Nexus 5 is a great cellular. It works smoothly.The price is very competitive comparing to other leading brands in the industry.", "Date": "May 25, 2014"}, {"Title": "fine mob", "Author": "khaled Elsayd", "ReviewID": "RB8E84O6U1W7J", "Overall": "5.0", "Content": "I bought about 6 units for my 2 kids and their friends, all satisfied, it was their choice and I liked it too", "Date": "May 24, 2014"}, {"Title": "excellent condition.", "Author": "Hussain Imaz", "ReviewID": "RDTCLPPKWXH1V", "Overall": "4.0", "Content": "phone is in very good condition looks almost brand new it came with box,charger,manuals. but sad there was no headset :/", "Date": "May 11, 2014"}, {"Title": "it`s just great", "Author": "Walter", "ReviewID": "R1QLIJ3CU1ILZB", "Overall": "5.0", "Content": "In some simple words, this phone is so nice, fast and cheap! I totally recommend it for everyone who enjoys android :-)", "Date": "May 8, 2014"}, {"Title": "great", "Author": "Cesar", "ReviewID": "R1Z3ZBJMKS8L0F", "Overall": "5.0", "Content": "really just a great phone i switch from the iPhone 5s and i dont regret a thing great change. must buy", "Date": "April 27, 2014"}, {"Title": "My Review", "Author": "Daniel Mc Cluskey", "ReviewID": "RD5M9WCUIDQDN", "Overall": "4.0", "Content": "Glichty but no surprise here.  Love Google products and this is no exception to happiness re: cell phones.  BTW....quite beautiful in it's design.", "Date": "April 23, 2014"}, {"Title": "Nice Phone", "Author": "alexpric", "ReviewID": "RCVZTC6WWZRCP", "Overall": "4.0", "Content": "Good in almoust every area but have a few issues, speaker low many people tell me have problema to hear me well, does not come with an integrated widget for flash to use it like flash light, comes without earphone, the charger is only 1.200 mili amps and not 2000 mili amps like almoust every pone of his category.", "Date": "April 14, 2014"}, {"Title": "I love it", "Author": "Efren", "ReviewID": "R1JZ20AKYOZU04", "Overall": "5.0", "Content": "I really love it, it feel great on hands, excellent screen resolution and incredible speed.It work really well for Venezuela operators", "Date": "April 10, 2014"}, {"Title": "Great replacement for iPhone...", "Author": "Eliran Lev", "ReviewID": "R60D2TYU9Y7I3", "Overall": "5.0", "Content": "Very friendly and easy to use.My son switched from iPhone 4 to this Nexus5 and he is Very happy with the new smartphone.Access point definition was required in order to work with Israel Orange, but it's nothing, only few system definition by the user level.", "Date": "April 3, 2014"}, {"Title": "The best phone for the price", "Author": "New_Guy1", "ReviewID": "RUUC5EMA71LCL", "Overall": "5.0", "Content": "I bought this from the Play Store in order to get it at the more reasonable price ($349 before tax/S+H). Sure it's not a Galaxy S series phone, or an HTC One, however for the price, you get a phone that is on par with it's pricer competition. Sure, it has no micro-SD card or removable battery (which for some is a deal breaker), but for those of us that aren't trying to store 2TB of data on a phone, I don't see anything wrong with the phone not coming with the support to have expandable storage. The same logic applies to the battery, as unless you're using it to watch the entire series of Lord of the Rings all day every day, the lifespan, and charge time is fine for normal use (and improves after a couple of weeks after taking it out of the box as the system calibrates). The speaker is a little bit weak, i will admit, however it works fine for normal use (speakerphone). Though as an audiophile, I prefer to use earbuds for listening on a device anyway, as it gives better sound. [LG D820 Google Nexus 5 GSM 16GB Black: Unlocked & Rooted]", "Date": "March 25, 2014"}, {"Title": "BEST. PHONE. EVER.", "Author": "Kevin Keraka", "ReviewID": "R3MNMNX2F220F", "Overall": "5.0", "Content": "Three of the biggest reasons I bought this phone:1. World Phone. (Factory unlocked)2. Pure Android. (Stock KitKat)3. Affordability (only $350?! WOW)All the other android phones have skins that the manufacturers lay on top of these smartphones which creates TONS of problems, any android veteran will understand what I'm saying. loving the phone so far, silky smooth, and frightfully fast, only downside are the external speakers which aren't loud enough and mediocre at best... other that lovely experience so far no complaints!!!!", "Date": "March 18, 2014"}, {"Title": "I love it", "Author": "Johan C.", "ReviewID": "R1EL79O5QXDVZM", "Overall": "5.0", "Content": "recommended", "Date": "March 11, 2014"}, {"Title": "use comfortable", "Author": "Yvonne Liu", "ReviewID": "RK5YYWTXSJQ5E", "Overall": "5.0", "Content": "Google Nexus 5 used very comfortable and safe. it's particularly great if this phone send a earphone. I like this phone.", "Date": "March 2, 2014"}, {"Title": "awesome", "Author": "Mauricio Crisp Fonseca", "ReviewID": "R2TGLW4U2W52CD", "Overall": "4.0", "Content": "The phone is great, at first had some problems by enabling the 3g but now is fine. I just need to find a case which is hard", "Date": "February 27, 2014"}, {"Title": "Abaout Nexus 5 unlocked", "Author": "renata bandeira d aquino fonseca", "ReviewID": "R38OKBI9JUS428", "Overall": "5.0", "Content": "the price is good.I love the android.memory it's OK.I can play games, read books, listen to music.The only problem i notice is that the phone became hot when I'm playing games.", "Date": "February 4, 2014"}, {"Title": "Awesome", "Author": "Kulken", "ReviewID": "R1KRVOEGI1QLV3", "Overall": "5.0", "Content": "This is the best phone I have bought. Screen is so sharp and bright. It is very powerful with Snapdragon 800. The only downside is that the stock camera app sucks so bad. I just bought another camera app for few bucks and problem solved.", "Date": "January 9, 2014"}, {"Title": "Bang for your buck", "Author": "Sumesh Khosa", "ReviewID": "R1G6ME1Y5NR2W1", "Overall": "5.0", "Content": "It is a prize for its price. It is a high resolution and smartphone which is affordable. It saves you so much money since you don't have to get into a contract with these overpriced cellular service companies", "Date": "December 17, 2013"}, {"Title": "Best phone you can buy", "Author": "Diego", "ReviewID": "RPVGCQ2Z0LB5K", "Overall": "5.0", "Content": "My wife bought the LG G2 at the same time I bought the Nexus 5. Clearly both phones are really impresive. But right now she's really upset with the LG G2, and she want to have a Nexus 5. I'm really glad to make the decision of buying the Nexus. Amazing display, fast as hell, good looking, and the Android 4.4.2 give a plus on usability and friendlyness. Battery isn't the best feature but is quite good.", "Date": "December 16, 2013"}, {"Title": "Great hardware, software not so much", "Author": "brent \"brent\"", "ReviewID": "R2OYQO1LAXQWNM", "Overall": "2.0", "Content": "I was really excited to buy the Nexus 5, and stuck with a half broken phone for months waiting for it. After using it for several months in 2 different networks in 2 countries this is how I feel.The processor is fast and the touch screen is responsive. The camera takes decent pictures. The OS is mostly good...However, it is bogged down by the worst messaging program i have ever used: Hangouts. Hangouts does not (1) tell you when you are online, (2) allow you to set a status, (3) reliably tell you when others are online, (4) tell you others' statuses, (5) send your messages in real time / tell you when they are sent, (6) receive messages in real time, or (7) display received messages properly (it may just not update all the messages in a conversation). Oh and you cannot uninstall it. The response from Google to all the complaints from users is a patronizing \"you don't understand how great it is\". Sure you can get another SMS program, but the Google Talk app is irrevocably replaced with this turd. So forget 'instant' messaging as a means of reliable communication.Also, the GPS often takes way too long to tell you where you are. Sometimes 5-10 minutes after hitting the location button on google maps.I have had to hard reset once already because of some 'sync' problem with my Google account. (2 hours of tech support was no help.) I had problems even making phone calls because it was not properly communicating with its cloud-dwelling overlord. Google's charge for providing 'free' services is that you remain permanently tethered to their servers as the phone will not function at all (not even phone calls) if you are not logged in.Google Now has some neat features, but most boil down to 3 clicks and a small amount of typing being reduced to 2 and a verbal command (*if you are in a quiet enough place). Novelty you will get over very quickly.I understand that some of these, particularly the Hangout problems, are going to be problems on any Kitkat-running android phone, but I am yet to find a way to dump KitKat from this phone.", "Date": "February 10, 2014"}, {"Title": "I love my Nexus 5", "Author": "S. Francis", "ReviewID": "R36KZ3I31OGG0", "Overall": "5.0", "Content": "The nexus 5 rocks . Works smooth . I love the fact that it is pure android and that it get update first. Already I have received android 4.4.2 . The phone is not heavy, has a solid built. and very fast, apps load instantly. no sticking . This phone is a great buy for anyone in the market for a new phone.", "Date": "December 26, 2013"}, {"Title": "The Nexus 5! You Can't Go Wrong!", "Author": "Robert Miller \"Rob\"", "ReviewID": "R2DL61ID7IFBWZ", "Overall": "5.0", "Content": "I ordered my Nexus 5 soon after it appeared on the Google Play store. In barely a week, I have come to realize just how impressive this device is compared to my 2+ year old Galaxy Nexus! A sharp, vivid, display along with great specs, makes it a great buy at just $350.00 unlocked from the Google Play store. Battery life is decent and build quality over all seems excellent. Buying a phone like this will allow you to stay out of the prison of 2 year contracts!", "Date": "November 15, 2013"}, {"Title": "close perfect", "Author": "Domenico", "ReviewID": "ROKQGR2JJQ1K5", "Overall": "4.0", "Content": "I Live this Iphone . the desing the screen , all only a better camera make this a perfect smartphone", "Date": "May 26, 2014"}, {"Title": "defective product", "Author": "john", "ReviewID": "RO8Y0515N3M0S", "Overall": "1.0", "Content": "i ordered a nexus 5 and i just worked with it for 2 days then it turned off and is not working again i need to return this item from egypt and i need a refund", "Date": "March 25, 2014"}, {"Title": "Super device", "Author": "Alex", "ReviewID": "R2L4AM4NVULM3B", "Overall": "5.0", "Content": "Nice performance - very very fast, last OS, cool design! I Like it) Recomended! I I want more nexus 5 ^_^", "Date": "December 14, 2013"}, {"Title": "Stunning device. Stunning phone", "Author": "Ange", "ReviewID": "R1Q4PGP3BBT4TJ", "Overall": "5.0", "Content": "WOW. I absolutely love this phone. So smart and easy to use. Can't believe how quick it is. The instructions you can find on-line, but it's such straight forward to use.The camera is amazing, out of this world. The speakers are so clear and using it on the internet as a tablet it's extremly quick to use.I am very pleased with my new phone, much better than the Nokia Smartphone that I used to have.", "Date": "November 26, 2013"}, {"Title": "Easy to shattered screen glass.  LG service is very bad!", "Author": "Jeehyun Chang", "ReviewID": "RRJZHONJZYU3P", "Overall": "1.0", "Content": "I bought nexus 5, about 50 days ago from google play store online. Three days later, I accidentally dropped the phone from only two feet high on flat plastic tile (it fell off fron my y-sherts poket when I pick up somting) but the screen glass shattered. I called google to explain them, the google representative transfer phone to LG company. They charged $170 to replace the screen which is half of new phone price.I received the phone two weeks later. The phone is not receiving signal from T-mobile sometimes received one or two bar of low signal but that was E or H signal which is very slow, not even 3G, 4G nor LTE. I did not get any signals indoor at all. I called LG service again to explain, they told me to return the phone again to their service center with provided return label which was not overnight service it was Fedex ground service. I have to wait another two weeks to received my cellphone back.Two weeks later I received phone back from LG but it was same condition. I seems they did not even looked at it. it did not received any strong or fast signal from t-mobile. I called LG again, they told me same thing like two weeks ago. \"Send it back to LG\".I bought nexus5 I used it for three days, I could not used my phone for more than a month now. LG seems not care, they will send me another ground shipping label to send it back, I have to wait another two weeks. I will never buy LG product again. it broke very easily and their service is very bad.One more, even if evrythig fine, you can not see the screen horizentally while you are wearing sunglases. You can see only black screen untill you turn it to vertical position!!!", "Date": "March 26, 2014"}], "ProductInfo": {"Price": "$499.99", "Features": "AndroidTM 4.4 (KitKat®)\n4.95\" 1920x1080 display (445 ppi)\n1.3MP front facing 8MP rear facing with Optical Image Stabilization\n69.17 x 137.84 x 8.59 mm  4.59 oz (130 g)\nGSM: 850/900/1800/1900 MHz CDMA: Band Class: 0/1/10 WCDMA: Bands: 1/2/4/5/6/8/19 LTE: Bands: 1/2/4/5/17/19/25/26/41", "Name": "Google Nexus 5 Unlocked GSM Phone, 16Gb (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51qBfIpvolL._SY300_.jpg", "ProductID": "B00GD5V5WI"}}