{"Reviews": [{"Title": "READ THIS", "Author": "Inform", "ReviewID": "R8AB8YBQFNPTL", "Overall": "5.0", "Content": "Buy if:You dont text muchWould like simple talk and textDont emailDont need internetDont buy if:You dont use bluetoothYou want an advanced interfaceWant to use wired headphonesIts light, cheap, and easy to read. Once you calibrate touch screen, even texting isnt hard just a bit slow. THIS IS BASICALLY A 2G PHONE ON A WRISTBAND. If you realize that, this is a great item. Also, the battery on this one is 450mah, better than most that only have 200-250mah, so battery life is better.", "Date": "March 15, 2014"}, {"Title": "Works!", "Author": "Kristin J Alkire", "ReviewID": "R1P7WOM1D7GYVT", "Overall": "5.0", "Content": "Easy to use, cheap, and it works. Is pretty big on my arm, but if it lasts for a year I figure there will be smaller ones out by then. Fun to get calls on in public. Everyone wants to see it.", "Date": "February 18, 2014"}, {"Title": "WATCH CELL PHONE", "Author": "Gene", "ReviewID": "RD4YOQU6EDJX", "Overall": "5.0", "Content": "This Smart Watch works great!. I  put my Sims card in and was making phone calls. You will really be happy with this Smart Watch. I use  AT&T; service. works great.", "Date": "February 5, 2014"}, {"Title": "Not bad for the price", "Author": "Amos Browning", "ReviewID": "R2KPE2AEAFDKN5", "Overall": "3.0", "Content": "Prior to buying, I wasn't sure about the size. It is basically the size of a G-shock sports watch.1)Software. It is basically similar to nokia candy bar phones from around 2003. There is a stylus built into the watch band that comes in handy as my big fingers wouldn't be able to do much on the screen.2) Texting. For most people this would not be a primary phone, especially if you are a texter. From my experience it is hard to switch between alpha and numeric because you end up having to scroll through a half dozen languages to get back around to alpha again.3) Bluetooth. I successfully paired it with my car (Ford Sync). When it initially connects the car thinks it is in a call, but that is easily cleared and worked fine from there. Somewhat successful with SoundBEATS Universal Hv-800 which is a knock of of the LG. It worked fine for handsfree which is the only real way to use this. The speaker phone was not great. I could not get the A2DP profile to work properly. Not 100% sure if that was an issue with the SoundBEATS or the watch, but since the Soundbeats streams audio fine from my samsung tab 3 I believe it is the watch.4) MP3 player, the software is very basic but functional. I would have had to use the included earbuds since I could get the audio streaming to work over bluetooth. Succesfully read music from \"Kingston 8 GB microSDHC Class 4 Flash Memory Card SDC4/8GBET\"5)Phone. I use AT&T; and I had a smartphone that had the micro-sim. I had to buy \"AFUNTA Nano SIM Adapter for Iphone5\" To convert it into a full size sim card. It was a little tricky getting the sim into the phone using the adapter. i probably spent a good 30 minutes. I generally showed full bars. Call quality seemed decent. I had a couple times when the audio was not great, but I think that actually had to do with the other caller not this phone.6)Watch. The watch is accurate, but it does reset when the battery is pulled (probably the same if the battery fully dies).The screen blacks out unless you are using it, so you have to touch a button to see the time.7)Battery. The battery is enough to make it at least a day and half on standby. Not sure about with excessive talking, but that was with bluetooth turned on.Ultimately, I ended up returning it. There were two factors that contributed. The first was after cracking my screen on my smartphone, I planned on dropping my data package to save $30/month from the carrier. I no more got the phone in, and my carrier released new plans that covered data for the entire family talk for less that I was going to save by dropping just my data package, so now there really isn't a point in not having a smart phone.I have a 7\" tablet so I didn't have to have a smart phone, but it would have been hard for this to be a primary phone without something like that as I was using my tablet and google voice for texting (which was the plan).If it was just the data plan issue, I would have kept the watch phone simply for the mp3 player, but since I can't get the audio streaming to work reliably that is really what triggered me returning it instead of keeping it.It was a cool little watch. I work in IT, and it was cool little conversation starter. I was so close to keeping it as a backup, but just couldn't quite justify it.I gave three starts because it was fun and I thought it was decent construction, especially for the price. My expectations were low based on other feedback but overall it worked, but did have a few small issues that ended up being a deal breaker for me.", "Date": "April 22, 2014"}, {"Title": "love it", "Author": "Bobbye S.", "ReviewID": "RBBJ2GS9NU7A8", "Overall": "5.0", "Content": "i got it in one day , and its working for the purpose that i wanted it for, would reccommend", "Date": "February 17, 2014"}, {"Title": "Works as described", "Author": "Keith Gravlin", "ReviewID": "R3UY8M5ENOWELC", "Overall": "4.0", "Content": "This item works as described but I have become accustomed to a more advanced user interface on a cell phone.", "Date": "February 9, 2014"}, {"Title": "Thanks", "Author": "Hector M.", "ReviewID": "RYBT96I8LIMBF", "Overall": "5.0", "Content": "Excellent watch thanks it work great as a phone my son love it and use everyday also use as and ipod", "Date": "April 2, 2014"}, {"Title": "works ok", "Author": "Rev. Paul H. Purdy", "ReviewID": "R3ANZ5UY5HNYOH", "Overall": "2.0", "Content": "not to bad once you play with it a bit. i got it to use as an mp3 player well working around the house that i wont need head phones for and play via a blue tooth speaker. it wont sync and also i have to get a new bar for the watch band witch came (new today still in box) broken", "Date": "February 26, 2014"}, {"Title": "This one of my best buy's for 2014", "Author": "Ryno", "ReviewID": "RVL3VQJ619F8R", "Overall": "5.0", "Content": "I love this little device it is not obvious and it travels with me everywhere all I have to say after you take the battery out calibrate the pen as the touch screen works better if it is calibrated every time on my unit other then that. this is an awesome device. love it", "Date": "May 22, 2014"}, {"Title": "Watch Cell Phone Mobile Touch Screen Mp3 Mp4 FM Radio (Black/Gold)", "Author": "John Terry", "ReviewID": "R3JRED23IZZSJ6", "Overall": "5.0", "Content": "I am exceptionally pleased. Every feature works perfectly.  It far exceeds the one I purchased years ago. Kudos to PGD.", "Date": "April 3, 2014"}, {"Title": "Dick Tracy's watch is here!", "Author": "Lyle D Elkins", "ReviewID": "R2DSQY6RSL4IRQ", "Overall": "5.0", "Content": "It does everything advertised. Pretty amazing for something the size of a watch. Already received compliments on how attractive it looks.", "Date": "March 11, 2014"}, {"Title": "great", "Author": "deangelo", "ReviewID": "R2Z09YO251FM52", "Overall": "5.0", "Content": "Yes I did I like it alot everything works only problem is my finger is big to push certain buttons lol but over all its good", "Date": "April 5, 2014"}, {"Title": "A lot of fun...", "Author": "Matthew", "ReviewID": "R33K06HL7LQDSA", "Overall": "4.0", "Content": "This Item is allot of fun, but don't go out and get rid of your smart phone. I like having this but mostly as a second phone to play with. It's nice to have but not very practical.", "Date": "March 12, 2014"}, {"Title": "Dreams do come true, you just have to wait a little while", "Author": "gary", "ReviewID": "R1C6CXQS214JCL", "Overall": "5.0", "Content": "For those of you old enough, Dick Tracy had one in the late 60s early 70s. This was my dream wish for the last 5-\" years. Now I have one ! It's every bit as good as advertised and inexpensive enough to give as a gift to a friend, even if they are not old enough to remember him too", "Date": "June 8, 2014"}, {"Title": "Good but ...", "Author": "nik", "ReviewID": "R3PFJ64KKR1NH", "Overall": "3.0", "Content": "Evrerything good for me but it cant find my bluetooth jabra ... realy sorry.  I hope that im not right but  how can i know?", "Date": "May 20, 2014"}, {"Title": "At&t; \"no likie \" this phone", "Author": "Amazon Customer", "ReviewID": "R3HKCFO8JZVZS9", "Overall": "2.0", "Content": "You may run into issues with AT&t;: Big brother does not like IMEI numbers it does not have in its database.  Unless I am wrong and the phone is broken ( screen becomes unresponsive when you put SIM in ) AT&T; may be blocking this phone on their network. Its a disappointment. We had this gadget for our kiddo from another vendor for over a year and it worked fine.", "Date": "May 19, 2014"}, {"Title": "Definitely worth it!", "Author": "JAE ROBINSON", "ReviewID": "R33HO6JOF52WCW", "Overall": "3.0", "Content": "The product came in a fast & efficient manner, my only gripe is that someone from the company authorized a driver release without my knowledge. That could have been disastrous being it was a last minute birthday gift for my son. I also think you need a stylist in order to operate the menu flawlessly. Good product!", "Date": "May 17, 2014"}, {"Title": "good", "Author": "Chris", "ReviewID": "RB344VIQVD4KG", "Overall": "5.0", "Content": "watch came on time works very good I have a at&t; sim card in it, my internet doesn't work tho headphones that come with it suck so I jus use a Bluetooth! speaker on it is loud so u can hear good when not using a headset", "Date": "May 2, 2014"}, {"Title": "Love it", "Author": "ramon", "ReviewID": "R60W29NOT4UTR", "Overall": "5.0", "Content": "Love it I like these WAtchphones new and different and very noticeable people always comment on them when I wear them", "Date": "March 18, 2014"}, {"Title": "Does not work !  Dont waste your money.", "Author": "Amazon Customer", "ReviewID": "RD93NJ8BEQ3L8", "Overall": "1.0", "Content": "Right out of the box , after inserting sim card .  Says searching......That's it .  Stupidly, I bought a second, pink one , thinking it was a different brand .  It doesn't work either.", "Date": "May 13, 2014"}, {"Title": "Is not working and I coundn't return on time. So I wasted my money", "Author": "Enrique Meza C", "ReviewID": "R1BFHYCGQKY6OT", "Overall": "1.0", "Content": "Is not working and I coundn't return on time. So I wasted my money. This was a bad desition. I regret about that.", "Date": "May 9, 2014"}, {"Title": "Es lo que dicen", "Author": "Leonardo Lopez", "ReviewID": "R1162X9WHN7CE", "Overall": "4.0", "Content": "It is what he says is a good phone that just to set up the internet, but recommend it Chinese phone.", "Date": "March 22, 2014"}, {"Title": "This is cool gadget..", "Author": "Risktaker \"Lex\"", "ReviewID": "R3RIMPEZWA8UZO", "Overall": "5.0", "Content": "Am using it perfectly...IT IS VERY UNIQUE..this would be the best among of the  3 items I've had purchase but return for a refund due to non-functional touch screens..I'll recommend this to all my friends..", "Date": "March 3, 2014"}], "ProductInfo": {"Price": "$42.99", "Features": "Insert GSM Standard Size Sim Card\nAT&T;, T-Mobile and All other GSM carriers Sim Cards are OK\nVerizon, Sprint NOT OK, other NOT GSM Carriers NOT OK\nMP3 / MP4 player / World time / Calendar / To to list / Alarm clock/ Calculator/ Stopwatch\nSmall and comfortable to take and use", "Name": "Watch Cell Phone Mobile Touch Screen Mp3 Mp4 Fm Radio (Black/Gold)", "ImgURL": "http://ecx.images-amazon.com/images/I/31b2s8aNz7L._SX300_.jpg", "ProductID": "B00HFPDY3S"}}