{"Reviews": [{"Title": "A wise purchase", "Author": "Joe Smith", "ReviewID": "RPDZBQ3OB73PE", "Overall": "5.0", "Content": "Have been using this phone about 1 month now, I have found it to be smooth running and runs perfectly.Pros:1) Standard Sized SIM card slot - This device is unlocked and will work for 3G and 2G on AT&T;, T-Mobile and other GSMs. This works perfectly on my AT&T; and I get 3G. Actually for the $150 dollars paid for this model, it is well worth it, I just carry ONE device now.2) HSPA 3G Setting- I did not have to enter the APN settings, it did this automatically when I started the setup, opened the data and I logged on to my Gmail, etc and then turned off data and then on to WiFi settings, etc.3) External Micro SD Card Slot - This is one of the many reasons I purchased this phone and I have a 32GB SD card installed with plenty of room left!4) WiFi setup (EASY) - Here is how I set it up: I went into Settings, WiFi and turned the WiFi on. When it turned on, it showed my home WiFi router modem. I then selected this to connect and it asked me for the passcode (the router had it on it). Then I typed in the pass-code and my WiFi started right up with a excellent connection! Very strong WiFi signal at home and every hotspot I have tried!5) Phone Call Quality / Sound Quality (Both with speaker and headset)- the phone call clarity is clean and plenty loud whether on the speaker or the headset (I tried on both Bluetooth headset and wired headset). NO dropped calls ever! Sound quality for music is good as well on the speakers and on the headset.6) Adobe Flash installed - I can watch all kinds of Internet videos!7) 1 year US Warranty - the warranty information came with the package and full manual can be downloaded from its website.CONS:1) 3G Speed - the average 3G speed is 20% faster than my Internet speed with AT&T;, I get 5.6 Mb/Sec Download, and 1.2 Mb/Sec Upload.", "Date": "January 20, 2014"}, {"Title": "Good value for money", "Author": "Denial Stwen", "ReviewID": "R940UF72G1T22", "Overall": "5.0", "Content": "I bought this phone to replace a galaxy S3 that I gave to my wife. I did not want to spend too much but wanted a good experience and so far it has been great. The device is beautiful to look at and hold, and the screen is very sharp. The size is similar compare to the galaxy S3, and it's bigger than an iPhone 5. Really happy with my purchase and best price for very nice specs comparing with other phones in same class. The shipping was very quick. The only thing about phone is I hope the camera could have been a little better.", "Date": "January 19, 2014"}, {"Title": "Fantastic Phone - Can't Wait for the Case", "Author": "Rachel Palma", "ReviewID": "R1CGXL2TIYFEME", "Overall": "5.0", "Content": "Like the title says really nice phone purchase mine, it is so good, I just had to say something about it.Really nice screen, watching videos either movies or HD YouTube video are stunning on the 4.7 inch screen. With that said the device isn’t too big and I have pretty medium size hands and it fits nicely in my hand, and no difficulty operating the phone with just one hand.The operating system does get some getting use to, however it is simple and straight forward to operate. Has tons of features and I am still learning the features the phone come packaged with. Running apps on it is fast and simple though I have run into some apps that are not fully compatible that lead to speed slower not a biggie but a little annoying.Battery life is so-so to say and it really depends on your particular usage: power user vs normal user. The battery under high usage battery goes really quick fastest was 4-5 hours from 100%, normal usage 7-8 hours and when mostly standby 3-4 days (so far tested, might be more than that).Camera phone is fast almost zero shutter lag, but with that comes blurry image made worse if in low lit setting, under normal phone taking session letting the camera auto focus and snapping picture the photos taken are amazing, outdoor with optimum sunlight practically no issue.Final thoughts a really well rounded phone with its most ups! Still looking for a nice case, but seems no clues yet.", "Date": "February 13, 2014"}, {"Title": "Very Happy", "Author": "J. Wooster", "ReviewID": "R260CN6XXWMAWI", "Overall": "5.0", "Content": "I had no idea that RCA made a cell phone, but am very happy to have found this one.  It is similar to the Samsung Galaxy S3 in size.  After reading a couple of reviews, I tried several cases that fit the Samsung G3, but this phone is slightly thicker, by maybe 1 or 2 mm, so I couldn't get the hard cases to snap shut, but I did end up getting a gel case and it seems to stay on so far, although the holes in the one I got from ebay aren't exact, it will work for protection. I would buy several cases if RCA would come out with some, will keep checking!  As for the phone's functionality, I love it!  It has Jellybean and runs really fast.  I use Straight Talk as my provider and it was super easy to set up.  Just slid in my SIM card and my SD card and Viola!  Didn't have to add APN or anything, the phone did all the work.  The only CON I can comment on is the 3.5 mm plug, could be just the phone I received though.  I have tried 4 new sets of earbuds besides the ones that came with the phone (since that one had the hard earbuds and I prefer the soft), but none of them will work, there is a clicking sound and I can't heard the caller.  They also will not work with the MP3 player.  Really wish I could use the earbuds... Don't know if it is normal or not and it isn't really a CON, but the back does get a little hot when I've been on the phone a while.  Overall, really nice phone.", "Date": "March 3, 2014"}, {"Title": "Great phone, does work with my T-Mobile 3G", "Author": "jason martensen", "ReviewID": "R17939L1D3QFA9", "Overall": "5.0", "Content": "Overall it's a nice looking high value smartphone for business people. Battery life is excellent for an Android phone, last about two days. Call quality is great. Voices come in loud and clear and I never heard any complaints from callers. Connects to any WiFi I have tried very quickly and easily and the signal strength is excellent even when I am far from my router. And when not near a WiFi hotspot, I use T-Mobile for data and easily get 3G and found the data to be very fast.", "Date": "March 3, 2014"}, {"Title": "Excellent", "Author": "Marlene Wormwood", "ReviewID": "RGH0Y3OEZL5A1", "Overall": "5.0", "Content": "This product is awesome. I would recommend this to anyone. Tech support is better than anything I have exp. anyplace on line. If you need an unlocked phone do no hesitate.", "Date": "March 27, 2014"}, {"Title": "Great phone !!", "Author": "Jey", "ReviewID": "R3IP1F0Z4VRTEV", "Overall": "4.0", "Content": "I think this this a good phone for the price. I've only had mine a few days so I can't say to much just yet but so far so good I haven't had any issues with it . The exterior reminds of an samsung galaxy s3 but the only thing I think they could have done better with is the camera. I  think an 8mp would have been better and also placing the speaker in a different location instead of at the bottom of the phone but so far its worth the money .", "Date": "February 9, 2014"}, {"Title": "I love it", "Author": "Amoy Ellis", "ReviewID": "R2IOVEUD5PGVPY", "Overall": "5.0", "Content": "I received my phone, and it is working great, I use straight talk, the only problem I can't sent picture message, Is anyone having that same problem on straight talk and if so, How do you fixed it? But otherwise anything work prefect on the phone.", "Date": "March 17, 2014"}, {"Title": "OMG I LOVE IT!!!", "Author": "Kaiababe", "ReviewID": "R2BLYT8AOFJKFR", "Overall": "5.0", "Content": "I LOVE THIS PHONE ITS AMAZING BETTER SIGNAL NO LAG ON INTERNET DOWNLOADING FROM IT IZ A BREEZE NOT SLOW AT ALL THE SPEAKERS R MAGNIFICENT LOTS OF ROOM FOR PLENTY OF APPS USING A 32GB SD CARD SUPER FLAWLESS GAMES PLAY LIKE NEW INTERNET IS FAST BETTER THEN VERIZON IM WITH STRAIGHT TALK SERVICE N WITH THIS PHONE MY SIGNAL IS UNBELIVABLE I RECCOMEND THIS PHONE TO EVERYBODY KNO HALF THE PRICE OF SS3 SAME SIZE AND EVERYTHING AND CANT BEAT THE PRICE TAG PHONES LIKE THIS R WAY OVER PRICED U ARE GETTING A VERY GOOD DEAL WITH THIS IM SUPER SATISFIED ID LIKE TO THANK THE DEVELOPER WHO MADE THIS ITS THE BEST PHONE I EVER HAD :)", "Date": "February 20, 2014"}, {"Title": "Hoping for a better future with it...", "Author": "SJVM", "ReviewID": "RS25JP88HTUIY", "Overall": "3.0", "Content": "I seem to have got a defective one. Almost immediately, the screen froze and it was basically useless, though it's a handsome thing and would suit my needs very well. I am giving it  3 stars for now, though, because of RCA's excellent customer service. They put a lot of effort into trying to get me to get it to work (they did manage to instruct me to unfreeze the screen but then it happened again, plus, when I tried to use contacts, that icon took me to alarms instead!) and when it was still malfunctioning, they sent me a post-paid label to send it back for a free exchange of a new one, so I am going to give it another go.", "Date": "April 12, 2014"}, {"Title": "GREAT PHONE", "Author": "Robert J.", "ReviewID": "R3UULY30GM0WJZ", "Overall": "5.0", "Content": "JUST HAD TO COMMENT BOUT THIS PHONE. I HAVE AN IPHONE 4S, BUT I NEEDED A DUAL SIM WHEN I WAS OUT OF THE COUNTRY. BOUGHT A SONY EXPERIA DUAL SIM. THE DUAL SIM WORKED GREAT ABROAD BUT WHEN I GOT BACK TO THE STATES IT WOULD NOT WORK WITH AT&T...WORKED; WITH T-MOBILE BUT MY ROAMING SIM FROM THE COUNTRY I CAME FROM WOULD NOT WORK! SO I SAW THIS PHONE AND WORKED WITH AT&T;, T-MOBILE! THE ONLY THING I CAN SAY ABOUT THE PHONE IS THE CAMERA, NOT TOO GOOD, BUT OTHERWISE EVERYTHING IS GREAT! HOPE I CAN FIND A CASE FOR IT THOUGH!! RCA MAKE ONE!!", "Date": "April 9, 2014"}, {"Title": "Very Satisfied with This Great Phone", "Author": "Philip", "ReviewID": "RID9OVBOCXG7E", "Overall": "5.0", "Content": "I have the AT&T; Prepaid package, and I purchased this phone for $140. It's a great phone for not only that price but it's very high tech. I'm very satisfied with this phone, it's got a lot of offer for such a cheap price.PROS:Great screen qualityNice rear and front cameraFeels sturdy and strongSounds great/high volumeFast processorCheap priceAndroid Apps are efficient and easy to useVoice processor works well for text/call for hands free use!CONS:Not a variety of cases to choose from, seller said they will be made and available soon.OVERALL, it's a great phone and I highly recommend it", "Date": "April 5, 2014"}, {"Title": "I love this phone, and AWESOME seller.", "Author": "StoneCold Justin", "ReviewID": "R2B77B14ZNYS4H", "Overall": "5.0", "Content": "I love this phone.  I am using it with Straight Talk, but it can be used by any company that takes a SIM CARD!  Excellent phone, and it arrived a lot sooner than I expected.  I would buy from them anytime.", "Date": "April 16, 2014"}, {"Title": "Love this phone!!", "Author": "Renee", "ReviewID": "R1G7V36U0TK1NN", "Overall": "5.0", "Content": "I wasn't sure about buying a phone online but I'm glad I did because this phone is amazing.  Price is good, does everything the higher priced phone does, and sounds awesome.  If you are looking for a new phone, buy it already!!", "Date": "April 8, 2014"}, {"Title": "NICE PHONE FOR THE MONEY!!!! GOOD DEAL!!!", "Author": "CharlesP", "ReviewID": "R31ACWCH074G59", "Overall": "4.0", "Content": "I have owned this phone now for a couple of days, and im very pleased with it, because the quality (( at this price )) is the best you're ever gonna find hands down. It resembles a Samsung S 3, its not a real high end phone so dont expect perfection friends. Quite simply put, its money well spent. I bought 2 sim cards here on Amazon for the phone being its a dual sim card phone, the sim cards were for Straight Talk phones. I also added a 32 gig Ultra micro SD card.I then called Straight Talk customer service and they helped me free of charge activate the RCA phone. The phone works flawlessly, and is pretty fast. The screen and the flimsy power button could be improved upon, other than those 2 complaints im very happy with my purchase. What do ya want for $150.00 ? Its a good phone for the money, buy it, I did. ( =", "Date": "March 27, 2014"}, {"Title": "Awesome Phone", "Author": "Lindasy", "ReviewID": "RUNE9FY9W9SJR", "Overall": "5.0", "Content": "I was looking for a good phone, after doing a lot of research and comparing with other brands, I decided to buy this. I really like it and satisfy all of my expectations. The dual SIM has been the best feature which helps a lot and feel lighter than carrying two phones, and has all the features of a good Android phone. Mid-range in price and fits the bill. Highly recommend!", "Date": "January 18, 2014"}, {"Title": "Excellent smartphone.....", "Author": "demarie", "ReviewID": "R33A899NQSUNAL", "Overall": "5.0", "Content": "This phone exceeded my expectations. Pros The phone is very responsive Great screen Comes with screen protector already on it External SD up to 32 gb Great battery life (I keep wifi off unless needed) GPS Voice navigation Beautiful looking phone Sound quality of calls and speaker phone great Good camera and has flash and auto focus video good dual sim cards 1 year warranty unlocked You can use the phone as a remote for tv It automatically comes with apps that people will actually use:  Sound Recorder (love this app as I can remind myself of what I need to pick up or do while I am running errands)  Maps  Navigation - You can type the address or speak the address for directions  Calculator  Calendar  Flash Player - Can watch anything  Music app  to store your music  YouTube  Video recording and  video playback (in Camera app)  Camera with flash  Voice search - recognizes your voice  Flash Light  FM radio  Places - lets you know what restaurants, attractions are in the area  Play Store  Gallery - which all pictures and videos get stored inCons  -  NoneAll I had to do was put a 32 SD card in, download Amazon mp3 app, download my music from Cloud Player, which automatically was stored in Music app, downloaded Facebook app, Skype, Voice to Text and I was good to goThe ear buds that came with the phone are clear, (no static),  however, I choose to purchase Sony  MERDX 40LP/WHI ear buds because I like more bass and the sound quality is excellent.FM radio stations sometimes have static, however, I believe that has to do with the signals, not the phone itself.If you are experiencing  dropped calls, unclear calls, static or your WIFI is having problems connecting, please keep in mind that it may not be the phone but actually the provider you choose.  I purchased an A T & T $25 plan with 250 minutes, unlimited text and no data.  I can also add extra minutes to the phone during the month if needed. I have no dropped calls, no static and people say they can hear me very clearly. I have had absolutely no problems connecting to WIFI as well.The seller sells hard covers for the phone in blue and white. The hard cover does not fit over the RCA phone.  You must take off the RCA cover and replace it with the generic hard cover. A Samsung Galaxy 3 gel cover will also fit.  No one sells a car charger, however, Motorola car charger will work with this phone, or you can purchase a USB charger and connect the cable that came with the phone to use as a car charger.This phone is easily mistaken for the Samsung Galaxy 3.  The phones are almost identical. I can't say enough about this phone.  This is the world's best kept secret....a smartphone that works just as well as other expensive androids at a fraction of the cost, and finally, a sealed, unlocked phone that is actually made in the USA.rcamobile customer service is very good.  E-mails are responded to quickly.", "Date": "May 16, 2014"}, {"Title": "Great deal on a smartphone!", "Author": "swansinger", "ReviewID": "RAOW6BYH7HUEJ", "Overall": "5.0", "Content": "This phone does everything it says it will. I get the operational functionality of a 3g Galaxy phone for half the price. The only problem is accessories. I can't find screen protectors or cases. Other than that i love this phone.", "Date": "March 27, 2014"}, {"Title": "Best phone Ive ever purchased", "Author": "mimi", "ReviewID": "RQDV2HN6VOQTZ", "Overall": "5.0", "Content": "Excellent! Excellent! Excellent! That's all I really can say. Very well worth the price. I most definitely recommend this purchase.", "Date": "March 8, 2014"}, {"Title": "RCA", "Author": "rose ellison", "ReviewID": "R17LA6EVMUA9CA", "Overall": "4.0", "Content": "I purchased the phone and had no problems with it being delivered in a timely manor. It was new like stated. But I am having problems with it downloading pictures and my Data wont work. So I can't get pictures or videos as I can't download them.Also if I am outside of my home where my WiFi is, my phone will not work as I am guessing since my Data does not work. I get good service but no at my home. I have the phone thru Straight Talk. My last phone with them worked just fine here. So please be careful when purchasing a phone. I am used to it as I have no luck with phones off the web of any place...Thank you..", "Date": "May 15, 2014"}, {"Title": "Phone to use in the Philippines", "Author": "Jaden Jewel", "ReviewID": "RDJXXAV1PUTFQ", "Overall": "4.0", "Content": "I purchased this phone to use while I'm on vacation in the beautiful Philippines!! I hope it does work. *fingers crossed* Camera though is okay. It turns out dark even when taken outdoor. Also, it vibrates when you type and I don't see how to remove the vibration. Settings is very limited. But then again, you can't expect too much from a phone this cheap without being trapped in a contract. Other than that though, I like this phone. Its size is perfect.", "Date": "May 11, 2014"}, {"Title": "Love it", "Author": "bisdak", "ReviewID": "R2UWT7H0TE823G", "Overall": "4.0", "Content": "Who would imagine an android cell phone with RCA brand?  I was in fact surprised but because of the price, took my chances to buy this phone instead of name brand.  Lo and behold, it works so well and my daughter who has a Samsung even commented that it is a very nice phone and can compete with name brands.  It will be nice for RCA to expand their product and carry more models of mobile phones.", "Date": "April 18, 2014"}, {"Title": "Daniel", "Author": "Daniel Williams", "ReviewID": "R20795XPDOIN3T", "Overall": "5.0", "Content": "The phone is everything they said it would be. Great phone I would buy another one with no problem thanks.", "Date": "April 16, 2014"}, {"Title": "RCA A1", "Author": "Chad Yeary", "ReviewID": "R1T6NOQKQU63LA", "Overall": "4.0", "Content": "Great phone cant send or recieve picture messages only down fall. Hard to find phone case also. . . .", "Date": "April 13, 2014"}, {"Title": "So far, so good!!", "Author": "Corina", "ReviewID": "R21VOG2QOYHN29", "Overall": "5.0", "Content": "I've been using this phone (with T-Mobile) for about one month so far, and it's working wonderfully. Smooth, fast, clear and many useful features. Feels good, perfect size (had a smaller phone before this) and very pleased with the way apps work and the service quality with calls and texts  (even though same  provider, past phones seemed to have poorer connections). I will try to update this later if anything changes but i'm so glad reasonably priced phones like this exist. Not everyone can or even wants to spend a bajilion bucks on a phone so this is great. No complaints at all so far.", "Date": "April 4, 2014"}, {"Title": "Great phone for the price", "Author": "Charis", "ReviewID": "REW7S7MKPW6N", "Overall": "5.0", "Content": "I would recommend this phone to first-time smartphone buyers and anyone who wants a great 3G, Wi-Fi enabled smartphone with no contract. Thats the best feature of all. I can't express how im loving this phone--it's too early to tell if the phone will last for long years. But I can definately say so far, so good.", "Date": "March 31, 2014"}, {"Title": "Really good for the price", "Author": "Nevada Northerner", "ReviewID": "R3P4VGCDU6BRXA", "Overall": "4.0", "Content": "I must say that I do not live in a 4g city. Having said that, I must say that this phone meets my expectations. I don't need 4g connectivity when it is not available. The 3g and wifi work sufficiently for my needs. I use walmart family mobile, which is basically tmoblie service. There is not currently a case available. I receivec my phone with a screen saver already attached however. That's nice. It seems that I can use a gel case intended for a Samsung GS 3 for this phone. The hybrid cases did not seem to fit when I tried at my local mall. Good luck with a case unless RCA Mobile decides to produce one. That I would buy in a heartbeat. The phone is great otherwise. I haven't added too many apps to this point. It seems to work fine with what I have installed however.", "Date": "March 29, 2014"}, {"Title": "Nice..!!!!", "Author": "Brittany Harris", "ReviewID": "RWZ5QXMQN7RE4", "Overall": "4.0", "Content": "for a good price...i love it, just wish i can find a case for it!!! im glad i found it.", "Date": "March 23, 2014"}, {"Title": "llove it.", "Author": "miss.linds", "ReviewID": "R1NY9QFYODKOJT", "Overall": "5.0", "Content": "I love this phone. theres so much it can do. my son loves to watch movies on it. I wouldnt trade it. its great and its the best price.", "Date": "March 16, 2014"}, {"Title": "Love it!!!!!!!", "Author": "Danelle P.", "ReviewID": "R2ZFO06MOL1SUC", "Overall": "5.0", "Content": "I jus had to say that I absolutely love this phoneWhat are you waiting for.... Buy the phone, dang-it!!!!!!", "Date": "March 11, 2014"}, {"Title": "First smartphone, very pleased!!", "Author": "Stanley Kuey", "ReviewID": "R23EDGYVNXKUWI", "Overall": "5.0", "Content": "I have always had very basic phones since I am not a big fan of electronics, however, I can now see the appeal. I have just loved this phone! Easy to use and a beauty to look at, it always gets oohs and ahhs from my friends. There are many applications on it that I do not use, and I feel I could benefit from someone giving me a 30 minute lesson on it.", "Date": "April 1, 2014"}, {"Title": "Good phone", "Author": "Joevanni Camacho", "ReviewID": "R3H9QXDMBG4DZO", "Overall": "4.0", "Content": "The phone resembles the Samsung Galaxy S III when it comes to looks, body of the phone feels sturdy enough.  For $150 for an unlocked phone I would say that this is the best deal out there.  It regards to specs it isn't a flagship phone so expecting the latest would be far fetched.  All in all I would say that the phone has decent specs that will allow you to run popular apps without too much lag.  I do have to say that I put in an ATT Go sim and had trouble getting the phone to connect to the network, I put in a TMobile sim and it worked like a charm.  This phone would be a great alternative if you need a good phone till your next upgrade or would like an android phone with good specs.", "Date": "March 15, 2014"}, {"Title": "Impressed", "Author": "Lais Oliveira", "ReviewID": "R7PDXZ8LRSHD0", "Overall": "5.0", "Content": "I bought this cell phone to replace my note2 that I dropped on the floor and cracked the screen. Price was worth for the quality of the advice. My original sim card is too small for rca a1 4.7... so I called att and order a sim card that will work. Just waiting now on aim card. I'm sure there won't be any problems. My only question is...where can I buy a gel skin protector for my rca a1 4.7? Thank you.", "Date": "March 7, 2014"}, {"Title": "Great phone!", "Author": "Jonathan Swift", "ReviewID": "R362N5QSINCEHY", "Overall": "3.0", "Content": "This is a great phone as long as you do not listen to music.Big screen and all star features but no matter what music app you install you will be disappointed.I returned and bought a Samsung Galaxy ACE II with a smaller screen but with great audio/music feature.", "Date": "May 20, 2014"}, {"Title": "Very good deal", "Author": "Tim Chuck", "ReviewID": "R3QQWP8P4HSLD3", "Overall": "5.0", "Content": "I've been very happy with this amazing phone. The processor is fast, battery life is long enough to last whole  day for voicing, texting and web data. It feels nice in my hand, good signial reception and does everything I need it to do. I would recommend this phone to my friends.", "Date": "May 19, 2014"}, {"Title": "This is our second phone", "Author": "T. Schlueter", "ReviewID": "R357YAL6RLI372", "Overall": "5.0", "Content": "My wife got this phone first and convince me I should by it for myself.  Prior to it all I would use is a flip phone.  But now I am using more of the features, maps, ringtones, etc. and loving it.", "Date": "May 10, 2014"}, {"Title": "Nice phone for the money", "Author": "Eric", "ReviewID": "R8R854P6JIE0G", "Overall": "5.0", "Content": "This phone was a gift to my wife, she appreciates and loves it so much. It performs much better than expected, comfortable in hand without being too big, nice and big screen, and easy to use. Another fascinating thing is that it came right on time and also with a screen protector and case is really nice. Everyone should try this phone, high recommend.", "Date": "May 4, 2014"}, {"Title": "Excellent, 5 star phone", "Author": "Wilson W.", "ReviewID": "R2AA3QB2YAJHMP", "Overall": "5.0", "Content": "Purchased this to replace my old nokia phone, everything works excellent! I  use two sim cards on the phone, T-Mobile for web data ( cheaper than AT&T;) and AT&T; for calling and texting(Better quality than T-Mobile). RCA customer service replied my questions very quick and helped me to set up the Internet. Overall it is a great phone, and the price is accepable. Highly recommend!", "Date": "May 3, 2014"}, {"Title": "As expected.", "Author": "girlinky", "ReviewID": "R2544YI064Q2SV", "Overall": "5.0", "Content": "Love this phone. Perfect size & everything. Only neg. Is the battery don't last as long as my other phone.", "Date": "May 1, 2014"}, {"Title": "Nice Phone", "Author": "Abram Thomas", "ReviewID": "R3SXT7HU1QZYVL", "Overall": "5.0", "Content": "So far its a great smart phone at a great price!! Don't hesitate to buy this one, good job RCA", "Date": "April 24, 2014"}, {"Title": "rca A1 phone", "Author": "alkeitha fleming", "ReviewID": "R3GMAIHI2HV6FQ", "Overall": "4.0", "Content": "Its a good phone to have. Pretty nice size screen kind of like samsung galaxy 3. Works fine but sometime the back button gets stuck an battery life runs out fast. Cant really find a phone case to fit this phone but overall It's Ok...", "Date": "April 11, 2014"}, {"Title": "Good price, good phone!", "Author": "Monkia", "ReviewID": "R20BMVFHOX2NUO", "Overall": "5.0", "Content": "The phone is awesome its a easy to use and good for people who want a good phone for low price  and want to be able to use it to watch videos, play games, call people, calling  is very clear, and is very sturdy I have dropped it and does not crack anything. The phone is fast and for the money is good.", "Date": "April 9, 2014"}, {"Title": "Pleased after one week of use", "Author": "Pondview", "ReviewID": "R96DJLLJPNUQN", "Overall": "4.0", "Content": "Had it and used it for about a week.  A bit of a battery hog, but not excessively so.  Have used it on AT&T; and outside of US with local SIM with no problems.  Odd that cell phones do not show up on RCA's corporate website.  RCA phone only has one item in its Amazon store - this one.  Is the real RCA behind this at all?  As long as it works past several months I don't care.  I have seen that the problem with many Chinese knock-offs is that they work fine at first and then start breaking/failing.  At least this phone has a US warranty.  I'll write an updated review after several months.", "Date": "April 8, 2014"}, {"Title": "great phone", "Author": "user 60", "ReviewID": "R1B3IHKVSD7OJ7", "Overall": "5.0", "Content": "this is a good phone and it is a lot like a samsung s...it is of good quality and works very well", "Date": "April 5, 2014"}, {"Title": "Excellent phone and great service", "Author": "Milton Sculley", "ReviewID": "RNG15YM6K2D0S", "Overall": "5.0", "Content": "I purchased this RCA A1 unlocked phone. I have both a tmobile sim card and an at&t; sim card,  and it works both my tmobile and at&t; providers. I sincerely do love this phone. I had an issue with the USB charging port but the seller replaced it next day I contacted and their customer service is excellent. I suggest if you are interested in an unlocked GSM service provider to look at this phone as your phone of choice.", "Date": "April 2, 2014"}, {"Title": "Excited about the phone", "Author": "whitney", "ReviewID": "R1ACB8K8E0CH4J", "Overall": "5.0", "Content": "I have had my RCA A1 4.7 smartphone for a couple months and love it! It was brand new in the original box and I believe it came with everything but the sd card. I had to go get the sd card and paid $15 for a 32gb. The phone is the perfect size and is feature rich. The screen is nice and bright, perfect for playing games and surfing the web, and the colors are vibrant. This is a very good phone and well worth the money I paid for it or better yet not paid for in a newer model. One other thing to mention the seller service was very helpful, responsed my questions very quick.", "Date": "April 1, 2014"}, {"Title": "A1rca mobile phone", "Author": "Debra T.", "ReviewID": "R3UTEINNRUHRWC", "Overall": "5.0", "Content": "very nice phone. just remember to get a sim card for it. i forgot it. best phone so far. customer service is great at rca mobile phone to . great!!!", "Date": "March 17, 2014"}, {"Title": "Good phone overall", "Author": "Debra Cole", "ReviewID": "R240385IGBNGX4", "Overall": "4.0", "Content": "After I FINALLY got it working, I have Straight Talk, I like it. I only have one issue, when I text someone & then try to reply back, it gives me an error msg, I have to do a new txt (same person), it goes through.  Anyone else have this issue, if do, what did you do?", "Date": "March 12, 2014"}, {"Title": "stopped working after 2 months", "Author": "J. Brewer", "ReviewID": "R11EP0EUR97IAH", "Overall": "1.0", "Content": "A month after purchase I started having problems. I would see messages, or texts but had not heard a ring. At first I thought it was that I was just missing them, but now, it doesn't ring at all. For awhile when a call came in, I got a text message sound, and then the call went to voice mail. But now nothing at all. So that is the biggest CON. Another problem was that the button on the bottom to bring up the screen stopped working. Other problems with the phone are that the picture quality is very bad. Despite having a flash, I can't use it to deposit checks because the pictures of the checks are too dark to read. And the volume control is at the side of the phone, and it is easy to depress this without knowing it lowering the ring voume. (Yes, I checked that, and the failure to ring is not that the volume is lowered by mistake).As for Pro's... It has great features to let you manage the amount of data that you want to use. Also it is very good at finding WIFI just about anywhere and almost always being connected via wifi. My data charges just about went away when I started using this phone.The size is the same as a samsung, so the fact that there is not an RCA case, is not such a problem because a samsung case fits with just a minor adjustment (had to widen the opening to plug in the charger). Another good thing is that motorola chargers fit this phone.The phone claims to have a warranty, but it requires sending in the phone for them to \"fix\". I'll try sending it back as soon as I get a phone to use during the warranty service.", "Date": "May 5, 2014"}, {"Title": "Painful to talk on", "Author": "Patiojo", "ReviewID": "R36C132KZVTGF5", "Overall": "2.0", "Content": "I had to send it back after the first conversation. The sound quality is so bad it actually hurt to listen while on the phone. Cheap poor quality sound.", "Date": "April 9, 2014"}, {"Title": "Super Cell", "Author": "Hjc", "ReviewID": "R3DTBMHJYDZB6H", "Overall": "5.0", "Content": "I have HTC and Samsung also and this cell phone is very good, fast and look high quality and the price and shipping were amazing.", "Date": "March 6, 2014"}, {"Title": "Good phone for the price", "Author": "Alex Fisher", "ReviewID": "R3N5T78OWE5LRJ", "Overall": "5.0", "Content": "Satisfied with this RCA phone, it has a good performance and it is such a great alternative for this price.", "Date": "January 30, 2014"}, {"Title": "Blutooth info", "Author": "Miguel Genao", "ReviewID": "R3POYVYV3DF6JX", "Overall": "4.0", "Content": "Every thing is Ok, but I don't see any  information about the connection via bluetooth with my car's phone system. is it possible to have a handfree connection via blutooth in my car?", "Date": "January 27, 2014"}, {"Title": "works with straight talk, but could not send texts, found a work around.", "Author": "anonymous", "ReviewID": "RNLNTUONSNN2X", "Overall": "5.0", "Content": "I bought this phone to use with straight talk, but for some strange reason I could not send texts. So I downloaded an app from the google play store called go sms and now messaging seems to work fine. Not being able to send texts was very frustrating and was the only problem I had with the phone, other than that, everything works great, the camera could be better but for the price I won't complain.", "Date": "April 8, 2014"}, {"Title": "Unsatisfied.....", "Author": "Bianca Farrior", "ReviewID": "R10HDB5TM9ZTQG", "Overall": "1.0", "Content": "I would not purchase this phone it does not hold a charge n is a waste of money....Do not buy!!", "Date": "April 5, 2014"}, {"Title": "Non existent customer service", "Author": "junior foster", "ReviewID": "REDCWLKUH7GN7", "Overall": "1.0", "Content": "I have called them multiple times and when they returned my call at  5:00 pm( the time they close) he told me he will email me my instructions. That was two weeks ago. I called three more times when they are suppose to be open but got answering machine. Still no returned call. I even went to their advertised 24/7 customer support email a week ago. Today will be day #7 and still not even an email. Straight talk does work on the phone but you will not be able to send or receive MMS, watch movie apps like netflix(the site loads up but movies will not play.the first and only time I talked to customer service he told me it was Netflix 's fault. I told him my MMS was more important)", "Date": "April 4, 2014"}, {"Title": "worth the money and then some", "Author": "Rick A. Malher", "ReviewID": "RCNWAAFQXMXQC", "Overall": "5.0", "Content": "Great phone, lots of memory, I put in my sim card and it picked up my network right away. I would recommend this phone to anyone looking for a great unlocked phone.", "Date": "June 10, 2014"}, {"Title": "I love my phone", "Author": "jose mcrea", "ReviewID": "R1OF9KZ7HBN4E6", "Overall": "5.0", "Content": "this cell phone is very good quality have good speed when I write the screen is good I like it", "Date": "June 10, 2014"}, {"Title": "First Time Andriod User", "Author": "John Anthony", "ReviewID": "R2MYFUJA98UYO6", "Overall": "5.0", "Content": "I am a first time Andriod user and this phone is working out better than I expected.  I had used a friend's Galaxy S3 to familarize myself with the Andriod operating system prior to buying this phone and this RCA is a very close match to the Galaxy interface.  Besides making crystal clear calls, it has pre-loaded apps that are useful in everyday life.  If it wasn't offered on Amazon I do not believe I would have ever heard about this phone as RCA did not advertise it much, if at all.  I have already recommended this phone to friends and continue to enjoy usisng it.", "Date": "June 9, 2014"}, {"Title": "broke in under 2 months", "Author": "timothy mills", "ReviewID": "RX4JK0OSF44FE", "Overall": "1.0", "Content": "I Bought this phone for my wife and she enjoyed it while it lasted, which was just about two months.  The phone still functions but screen went blank.  We will be contacting the factory about warranty options and if they come through we will upgrade the rating based upon the return experience.  There was no damage to phone and she had it kept in a protective case and it did not suffer any significant traumas to explain the malfunction.", "Date": "June 6, 2014"}, {"Title": "All I can say is wow!", "Author": "C.C.", "ReviewID": "R1TGIK7WWKRA8I", "Overall": "5.0", "Content": "I purchased this phone as a replacement phone and read all the reviews related with this phone before I purchased it. All I can say is wow...its just like having a Galaxy S3 phone...I connected it with Straight talk wireless and and after I manually set the APN settings for data content...it all worked....very happy with my purchase so far...everything works as expected....some settings are different than the galaxy phone but its all good....I would recommend this phone to anyone who is looking to buy an economical phone replacement....", "Date": "June 5, 2014"}, {"Title": "Second order", "Author": "Shatter", "ReviewID": "R173KSMM3FEEXT", "Overall": "5.0", "Content": "I can't say enough how much I loved this phone, and how great the phones are that Amazon sent to me. I bought two phones and both have worked profectly.Thank you so much.", "Date": "June 4, 2014"}, {"Title": "Stylish but disappointed", "Author": "Catrece", "ReviewID": "R337XF9O3057FG", "Overall": "1.0", "Content": "Wasn't NOT able to use at all. Had to return phone. Very stylish but nothing like a Galaxy at all. Very disappointed.", "Date": "June 4, 2014"}, {"Title": "They simply do not work outside the US", "Author": "John Gullesserian", "ReviewID": "R1P5ISBS1CI5YE", "Overall": "1.0", "Content": "I've bought three of these units from Amazon and took them to Costa Rica. One worked for phone calls only and did not navigate on the cellular network, the other two did not work at all. The only answer that I received from the seller was \"it should work, let us know who the service provider is.\"", "Date": "June 3, 2014"}, {"Title": "Great Phone", "Author": "Gail Priest", "ReviewID": "R3KOWRCC2USEZD", "Overall": "5.0", "Content": "This phone is awesome, it is my first smartphone and it was easy to learn. I have enjoyed the phone", "Date": "June 1, 2014"}, {"Title": "Will itl it work with gsm 850/1900 MHZ network in india", "Author": "ANANTHAMURTHY", "ReviewID": "RNSSIN54DCNAS", "Overall": "4.0", "Content": "I want to purchase this phone and  use in India on Vodafone or BSNL networksCan I use this in IndiaAnanthBangaloreIndia", "Date": "May 28, 2014"}, {"Title": "One is not enough", "Author": "OJ in Seattle", "ReviewID": "R15LSXYN2ZM98W", "Overall": "5.0", "Content": "Great phone!  I liked it so well I purchased a second for my spouse who gladly gave up her HTC Desire Z..  Unfortunately RCA does not make a backup battery available for purchase.  Their response to my inquiry was they are going to contact the supplier and will notify me when a battery is available for purchase.  Does not sound like good planning to me.  Covers and cases for the Samsung Galaxy S3 will fit after minor adjustments to the openings for the sound and on/off buttons.", "Date": "May 27, 2014"}, {"Title": "rca phone", "Author": "caval miller", "ReviewID": "R1V3TC8SVUVQJJ", "Overall": "3.0", "Content": "not a bad phone for z price if it was a 8 memory instead of a 4 i would giv it 4star but not bad", "Date": "May 2, 2014"}, {"Title": "Works perfect in Jamaica", "Author": "MARTIN", "ReviewID": "REA486NTVJCME", "Overall": "5.0", "Content": "This Dual Sim phone works perfect in Jamaica, if a phone is what you want then I recommend this one. It works good touch screen is sensitive nice looking design and has all smartphone capabilities.", "Date": "April 4, 2014"}, {"Title": "RCA A1", "Author": "JE's momma \"Angie\"", "ReviewID": "RB2S6VX2MMEXP", "Overall": "4.0", "Content": "i kinda like the phone..has lots of features...my phone has been mistaken for the samsung s3 phone and folks go, \"whattt!?!\".... even purchased a cover that fits perfectly with my A1 phone. however, did purchase quite a few covers ...the soft gel cover are the best, especially if you purchase the Samsung s3 cover...RCA please create a cover for my phone. Thanks!", "Date": "April 1, 2014"}, {"Title": "good phone", "Author": "smart shopper", "ReviewID": "RSD2C9OLOUPDY", "Overall": "5.0", "Content": "good phone. lots of features, nice screen. solid data connection with tmobile, super easy setup and more importantly rca customer service is solid. i reccomend it", "Date": "March 14, 2014"}, {"Title": "Great phone", "Author": "Brittany Koehnle", "ReviewID": "R2XYJPJCW0MWPK", "Overall": "4.0", "Content": "this phone has an amazing battery life span, plenty of storage for all my apps, and overall i just love it. only downer is that theres no case for it so when i dropped it the screen cracked.", "Date": "March 10, 2014"}, {"Title": "upset buyer !!!!", "Author": "diana glass", "ReviewID": "R1VN0499DY9YE3", "Overall": "1.0", "Content": "the phone wasn't at all what I was exspecting ; no book to help you try to figure this thing out ; cant find a case to pertect your phone at all just all around upset ! and no response on anything to (HELP ME ) UPSET !!!!can enyone that has this phone help me ? ive asked the seller nothing", "Date": "April 25, 2014"}, {"Title": "Worth buying", "Author": "Tom Dormers", "ReviewID": "R25ZU92DDQONYI", "Overall": "5.0", "Content": "I wanted to own a smartphone, but I didn't want to be locked into a 2-year contract which would cost hundreds to cancel. This unlocked smartphone through T-Mobile Prepaid plan fit the bill perfectly. Perhaps all smartphones have the same features. I just know that I'm impressed that I can actually enjoy reading on a 4.7 inch screen. I've had no problems with the phone other than the sound quality of calls being a little fuzzy.", "Date": "March 31, 2014"}, {"Title": "Some quality issues", "Author": "Whoami", "ReviewID": "R1NUAGK8VVV6WI", "Overall": "3.0", "Content": "The good:  Looks pretty;The bad:  No sound out of box. No help from customer service through either phone or email. Turns out be be some loose contacts inside and I may need to squeeze in a piece of paper or something. Charged the phone to 100% the night before but next morning when turned on, it shows 84%. Internet loading is sometimes slow and erratic, downloading can be confusing -- when installing a software it says installed when nothing happened. This is only the 2nd day of owning it ...", "Date": "March 8, 2014"}, {"Title": "Good looks but a little short on performance", "Author": "Regi Sylvain", "ReviewID": "R3DF7OQVN1U8KP", "Overall": "3.0", "Content": "A sleek good looking phone. I was very happy when it arrived, but for the price, It crashed once. Doesn't seem to work with my network service. .The dual camera works fine. Everything else ok. I would however suggest researching for a more economical phone even if its down there in the looks department.Its ok. But nothing to write home about.Impressive in my hand..", "Date": "March 3, 2014"}, {"Title": "Everything about this phone is good", "Author": "rainbow", "ReviewID": "ROABUKBHVIRC4", "Overall": "4.0", "Content": "I like this phone, good signal, simple and light to carrry.I tried prepaid sim a nd it work good.will recommend you to buy this phone.", "Date": "February 23, 2014"}, {"Title": "Not a true version 4.1", "Author": "ForexTech", "ReviewID": "RN6QAL1U31HHO", "Overall": "2.0", "Content": "For most Android apps these days a minimum version of 4.1 SDK 16 is needed. Well this phone is 4.1 SDK 15. I don't know how they pulled it off because it is assumed in the Android developer world that ver 4.1 standard is SDK 16. So what you find is that apps created for 4.1 will not work on this phone including Google Now.", "Date": "May 6, 2014"}, {"Title": "phones suck", "Author": "Gloria Lovick", "ReviewID": "RM1N24RZ9B8G8", "Overall": "1.0", "Content": "having lots of problems with the phones. Cant get on internet unless somewhere where their is wi-fi plus ather problems.very disappointed.", "Date": "May 5, 2014"}, {"Title": "Disappointed", "Author": "John M. Stamm", "ReviewID": "R2OOFLX8NHHZFV", "Overall": "1.0", "Content": "The phone has two SIM card slots.  It does not tell you why.  Or the difference.  Second.  The phone will not link to internet for data on tmobile.  But they told me the unlocked phone would do same as any android.  Also we spent  hours with tmobile trying to resolve the data issue.  We got codes to load and several passes.  In the end all we can do is call and text.  No data.  Of course I am paying for data feed.  It just does not work.Total disappointment.  Next time back to apple products.  And not from this site.  John", "Date": "May 2, 2014"}, {"Title": "Never had so many problems...", "Author": "Kelly Cesarz", "ReviewID": "ROZG8KRFCW31J", "Overall": "1.0", "Content": "I have never had so many problems with a phone.  About two to three times a day I have to reboot it to get it to recognize blue tooth, or to get internet.  Even basic phone calling is a mess. I thought it was a good deal price wise, but my advice, throw it in the garbage and spend the money for something that is decent.  Oh yes, and forget support, the only thing I could find on the website was an email for support which never responded to my email...", "Date": "April 25, 2014"}, {"Title": "speaker & ring voulume not loud enough", "Author": "ricardo solorio", "ReviewID": "R30ALJJDBYQLW", "Overall": "3.0", "Content": "not satisfied with the speaker and ring volume.  Also, hard to see face in the sun, other than that good price for the phone.", "Date": "April 17, 2014"}, {"Title": "Happy so far.", "Author": "Sabrina Stark", "ReviewID": "R34TQNE5EQ08M9", "Overall": "4.0", "Content": "Good so far. Doesnt have a lot of memory space, but if you dont need a lot of apps it is fine.", "Date": "April 16, 2014"}, {"Title": "Not enough memory!", "Author": "A. Tucker", "ReviewID": "R10UZT3SI2F4J6", "Overall": "2.0", "Content": "Not enough memory!  Too hard to work around the lack of memory if you use a number of apps (even if they're stored on the SD card).", "Date": "April 1, 2014"}, {"Title": "quality of devise", "Author": "Frances", "ReviewID": "R13WJHTXI4H8P8", "Overall": "2.0", "Content": "quality of phone is little to be desired.  battery life is less than satisfactory. conversations are unclear most times. wanted to return but then it will mean to be without a phone...:-(", "Date": "May 13, 2014"}, {"Title": "Scratching my head.", "Author": "maxybu", "ReviewID": "RW4WNWLVSB7M7", "Overall": "2.0", "Content": "I don't know if I just had the bad one of the batch, but it just didn't work for me. It kept shutting off....running hot, etc.", "Date": "March 19, 2014"}, {"Title": "Poor battery quality", "Author": "Louis W.", "ReviewID": "R3LJUGB8JAY20T", "Overall": "3.0", "Content": "I just bought a new RCA A1 cellphone around 3 weeks ago. I have charged my cellphone battery for 4-5 times(only made several times phone call, turned off Wifi, Bluetooth, radio and data transfer etc.)since I bought it. But I found battery's quality is very poor, when I charged this battery for more than 12 hrs at forth time, it is still not full (only 75% of level) and spent battery very quickly. Without any phone call(turned off any other functions just kept standby), only 12hrs the battery's level from 75% has dropped to 36%!", "Date": "March 11, 2014"}, {"Title": "The phone is good but....", "Author": "Tameka", "ReviewID": "RW3VTUD31S7Z9", "Overall": "3.0", "Content": "I got the phone and really liked it, but one week after having it, the speaker stop working.  So, I was unable to hear incoming calls or any sound apps.  Also, the volume was real low from the start.", "Date": "March 4, 2014"}, {"Title": "Walmart not honoring prepaid service", "Author": "keep rollin'", "ReviewID": "RBRUFLE81C3I4", "Overall": "5.0", "Content": "The rating is based on the look and the feel of the product as I have not been able to actually use it yet.Purchased the phone via Amazon and as expected, the product arrived on time. Now that I'm trying to test it  before taking it overseas (long term home), I am having problems activating it. I live close to Walmart and they will only activate on contract basis. Would like to hear from others who have activated this phone in the USA and what carriers they used and what their experiences are. Thank you all for sharing your experiences.", "Date": "April 26, 2014"}, {"Title": "Couldn't hear well", "Author": "JANE RICHARD", "ReviewID": "R2UNAUGDQT3ED6", "Overall": "2.0", "Content": "I returned this item. When I was trying to set up service, I had hard time hearing.  Was cutting out. I decided it wasn't possibly working correctly.  The man on the other end couldn't hear me either. He said it had an echo.", "Date": "March 24, 2014"}, {"Title": "Not satisfied enough to keep", "Author": "IMaRunner2 \"love to read and run\"", "ReviewID": "R1XUZZ06MSO7FY", "Overall": "3.0", "Content": "I just exchanged the Hawei Y300 for this phone and with the exception of this phone being larger, I think I lost out with the lack of specs it has to offer compared to my previous phone. I installed an app that provides me with more features (that came pre-installed on my Hawei) and for the price of this phone I was really expecting it to be better.Pros:1) Screen size is good2) Speaker is a good volume (no bass though so sounds kind of cheap at first but then you get use to it).Reasons I will be returning this phone (cons):1). Slow to load icons - may be conflicting with the app that I installed2). The volume is good on the speakers (was horrible on my Hawei) but with the headphones the sound quality is either horrible or too low  depending on which headphones I use.3). Front facing camera does not work properly - is dark and completely uselessOverall I'm not impressed. I just need to go for what I really want because I don't think I'll be satisfied with the cheaper/no contract alternatives that I have researched/used thus far.", "Date": "February 12, 2014"}, {"Title": "Waste of Money", "Author": "Candace Johnson", "ReviewID": "RVM4Y2S0EYVP8", "Overall": "1.0", "Content": "The phone is not compatible with my unlimited Straight Talk plan, I can't get mms, I wasted my money. On top of that the hinges in the sim card slot #1 were bent. NOT HAPPY!!!!", "Date": "March 27, 2014"}, {"Title": "Didn't work well in the rural area", "Author": "bjay", "ReviewID": "R2QRKH2T31BR3E", "Overall": "3.0", "Content": "Dropped calls and sounded like I was in a tunnel. I am sure it was not the phone but the carrier. Verizon does not work well in my rural community. Need AT+T.", "Date": "March 25, 2014"}, {"Title": "Great Tablet At A Great Price", "Author": "Tanya T.", "ReviewID": "RYO8PJKGGKJM4", "Overall": "5.0", "Content": "I researched many different tablets and when I saw the Wolvol I will say I was a little unsure but then I saw a demo about it on Youtube and it had everything I wanted. I purchased it for my 5 year old grandson to download learning games and he just loves it. We had purchased one for him last year and it stopped charging (and we paid far more for that one). I've used it a few times myself to veiw movies on Netflix and it works great. I'm planning on buying a few more within the next few months as gifts and of course one for myself. I would highly recommend this to anyone looking to purchase a tablet and you can't beat the price.", "Date": "March 4, 2014"}, {"Title": "Looks good.", "Author": "Dana Boatner", "ReviewID": "R39Q50M5FKCDKA", "Overall": "3.0", "Content": "Well the phone looks good, picture quality was good for what I saw, but I could not get my signal for the T-Mobile network. The only network that pulled up for this phone for me was AT&T; and I actually had the T-Mobile representative help me reset the phone, check the IMEI and everything. So since I can't use it right now I am debating if I am going to send it back or sale it to someone that uses AT&T.;", "Date": "March 2, 2014"}, {"Title": "good phone", "Author": "Brian Apangalook", "ReviewID": "R3CNP7QF2V9FRT", "Overall": "3.0", "Content": "i like this phone, good functions AND its a smartphone for only a hundred and sixty dolla. i took two stars away from my rating of this item because i looked thru all the apps and options for an inkpad or notes or something to that effect and there was nothing, one star off.(im the kind of guy who takes notes on certain things like if i see an interesting movie in a preview or what costed me what and stuff like that)another star off for the battery life. first few seconds after its done charging the batt life will already be at 99%, i mean COME ON!! idk, it cud be that i ddnt chrge it for 12 hrs before i sparked it up but other than that its like using a galaxy s3 for a lot cheaper than they originally were. still i am disappointed in the battery life. im also guessing they were made by some illegal org or false company because i kno some ppl will go thru certain lengths for money like that, otherwise it wudnt be a mock up of the s3. now enjoying the phone, thx amazon for displaying a cool phone", "Date": "March 28, 2014"}], "ProductInfo": {"Price": "$299.00", "Features": "This unlocked cell phone is compatible with GSM carriers like AT&T;, T-Mobile, Net10, Simple Mobile, Consumer Cellular, Walmart Family Mobile, and Pure Talk USA. No contracts and data plans required;\nHSPA 3G Smartphone running Android 4.1.1 (Jelly Bean), with 4.7-inch multi-touch LCD display; 2G Network GSM 850/900/1800/1900, 3G Network HSPA 850/1900;\nWi-Fi networking with Wi-Fi Mobile Hotspot and tethering capabilities, GPS for navigation and location services; Dual SIM card slot, 4GB storage, Micro SD expansion to 32GB;\nGPRS, HTML Web Browser, Built-in Apps: Google Play, YouTube, Google+, Google Search, Google Maps, Google Navigation, Voice Memo, Notes;\nDual camera, back-5-MP, front 2-MP; HD 720p recording; Bluetooth 3.0 stereo music; FM Radio, MP3 Player, MP4 Player;Up to 6 hours of talk time, up to 360 hours of standby time, High Speed USB 2.0, 3.5mm Audio Jack", "Name": "RCA A1 4.7\" 3G Unlocked Dual SIM, Android 4.1 US Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/41en96KC1tL._SY300_.jpg", "ProductID": "B00H2FXSKK"}}