{"Reviews": [{"Title": "Awesome!", "Author": "David E Farris", "ReviewID": "R8XL4ZK5G37F0", "Overall": "5.0", "Content": "Bought this for my mom who is in a nursing home, she has never had a smartphone before. I wanted something that would be a great source of entertainment, and functional. It has lived up to my expectations! It was delivered very fast, and the price for what you get is amazing.  I purchased a samsung phablet for myself and payed twice as much. The touch screen is very responsive,no lag in apps. The sound that comes from the speaker is really really loud. Which is great for someone that is hard of hearing. I signed her Up for Walmart family mobile plan popped in the sim card and it was up and running. Phone calls are very clear no echo. It came with two battery's and a screen protector that was already installed. Also came with a case that doubles as a back for the phone. Not the most deluxe but serves it's purpose. Hoping to find a trident type case that with fit. The device it's self is attractive very thin and light.  I got the pink model and the nurses at the nursing home ooh and aah over the color.  If you are on the fence because its a generic model. I would highly recommend it.  I will bedefinitely be buying myself one when my samsung mega retires.", "Date": "March 31, 2014"}, {"Title": "PERFECT PINK PHONE", "Author": "CHARLENE A. MACKALL", "ReviewID": "R3PDLZ4ILCVLRM", "Overall": "5.0", "Content": "THIS PHONE IS FANTASTIC.  At first I was a little skeptical about ordering the phone; especially since I received a bad one from somebody else.  I also didn't know if this would work with consumer cellular.  Well it does, and I am loving the big screen. The pink color just puts this over the top. And yes, it comes with 2 batteries, a cover, a charger that can be attached to your computer, and a protective plastic cover already attached. This phone is better than any phone I've received from the major carriers.  It has a 4.2.2 operating system with play store.  I just can't say enough about this phone.  If you are looking for an unlocked pink phone, this is the one.", "Date": "April 4, 2014"}, {"Title": "love it", "Author": "T D.", "ReviewID": "R3H6RIUISJ1MXQ", "Overall": "5.0", "Content": "I just got my phone its pretty in pink with a pink smart case included it came within two weeks so far I'm loving my new phone!!!!!", "Date": "March 10, 2014"}, {"Title": "The description is a lie", "Author": "Darell106", "ReviewID": "RADG8K31DCTXP", "Overall": "1.0", "Content": "The phone I got was 6mp back and 5mp front. I was expecting 8mp back and 5mp front like the description. Horrible camera. I sent the phone back.", "Date": "March 19, 2014"}, {"Title": "I love it!! ♥♥♥♥", "Author": "Reyna", "ReviewID": "R2C6JEWDXCA0MO", "Overall": "5.0", "Content": "Perfect!! Its one of the best cellphones i ever had!!  I love it.  Its worth it.  So i really would recommend it.", "Date": "April 29, 2014"}, {"Title": "Great Phone!", "Author": "Chi-Yun Lee", "ReviewID": "RGSIA94ZFKAJN", "Overall": "5.0", "Content": "I don't usually write reviews for the things I buy, but this phone and the seller service were so good that I felt that I need to write something to promote them.The phone is fast and every thing works really well. The screen is very big, and I think it is a plus since there are so many people got themselves blind after staring at a small screen for a long time.You can use either the old SIM card or the new smaller one on this phone. The phone is really pretty and the case they gave you complements it. The trick of putting on the case is you need to take off the back shell first. The case is a flip case and one side of the case works as the back shell of the phone.The shipment was fast consider the phone was sent from China. I got my phone yesterday and on the very same day, I decided to buy another one (the white one) for my mom. I really appreciate the seller for providing us such great experience.", "Date": "April 9, 2014"}, {"Title": "LET ME DOWN", "Author": "Brian Williams", "ReviewID": "R12M7TXDMBL7KX", "Overall": "2.0", "Content": "The phone very very good till 3 days later the phone just stopped charging in like wut wut happend all of a sudden my wife told me tht it sounded like something was frying then it stopped.. Sorry but it had to go back..", "Date": "June 8, 2014"}, {"Title": "UleFone N9000", "Author": "Shakira S.", "ReviewID": "R3JBBB56QG5EMP", "Overall": "1.0", "Content": "This item is nice for the price but it is nothing compared to the real thing!!! The product did not meet my expectations.", "Date": "April 12, 2014"}, {"Title": "Case fitting", "Author": "Tanisha \"TPerson\"", "ReviewID": "RLX89B96F4EW7", "Overall": "3.0", "Content": "I just ordered this phone; however, the seller said that NoteIII cases will not fit it. If this is so, where will I order cases for my phone if the one that comes with it as a gift gets broken? Being that it is a clone, I thought it would fit the Note III , otherwise I would not have ordered the phone. Will someone please answer this directly because I have gotten the run around on this.", "Date": "April 2, 2014"}], "ProductInfo": {"Price": "$176.48", "Features": "Compatible with at&t;, T-Mobile, Straight Talk, Simple Mobile and other GSM networks\nPlease make sure your SIM card is not locked with PUK code\n3G HSPA+ - 850/2100 bands. Fully compatible with AT&T;, Stright Talk(AT&T; Tower) & Net10 (AT&T; Tower) at 3G HSPA+. Compatilble with T-Mobile, ------>Simple Mobile, Straight Talk(T-Mobile Tower) & Net10 (T-Mobile Tower) at 2G (EDGE). For Straight Talk, Simple Mobile or Net 10 will require a manual APN setup\nFree Tether - Use your 3G data service as a WiFi hot spot and connect your notebook, ipad or other device for free. No need to pay monthly tether fee", "Name": "Ulefone N9000 Quad Core 1.2ghz 5.7inch IPS Capacitive Touch Screen 3g Smartphone Android Os 4.2.2 with At&t, T-mobile, H20 Black", "ImgURL": "http://ecx.images-amazon.com/images/I/519KxWAmLgL._SY300_.jpg", "ProductID": "B00HQFW3DO"}}