{"Reviews": [{"Title": "crap..", "Author": "James H.", "ReviewID": "R361S754K1DBE6", "Overall": "1.0", "Content": "Piece of crap. Didn't read Sim card. Keyboard too small, battery slow. Too small.. Wouldn't recommend buying it ever. Period.", "Date": "March 21, 2014"}, {"Title": "Poor Product", "Author": "aaron jackson", "ReviewID": "R1A3Y07ULA8F4G", "Overall": "1.0", "Content": "Poor productI would not recommend this item to anyone. I purchased this product about 2 months ago and it is no longer working. When I tried to return the item to the seller sad to say I found out that the warranty was only good for about 30 days.", "Date": "April 8, 2014"}, {"Title": "ok", "Author": "brenda johnson", "ReviewID": "R19CRO90MP163S", "Overall": "1.0", "Content": "The item was to hard to work, if my smart grandson could not work it something is wrong, it did look nice", "Date": "March 5, 2014"}, {"Title": "Not good", "Author": "Larry", "ReviewID": "R1CW57ANWMFBQJ", "Overall": "1.0", "Content": "Was cheap one of them stopped working within two weeks. I would not purchase this type of item again. Just not worth it", "Date": "March 14, 2014"}, {"Title": "hat it", "Author": "bruce owens", "ReviewID": "RBWMOGWB9L3B9", "Overall": "1.0", "Content": "not good bad hard to contrul do not by this phone  save your money i did not like this jounk", "Date": "June 7, 2014"}, {"Title": "Not happy", "Author": "jean-claude", "ReviewID": "R2PZJ0PLGGJ6YV", "Overall": "1.0", "Content": "The SIM card metal comportment came out while trying to install my SIM card.  The plastic part on the SIM card comportment is broken while trying to install my SIM card", "Date": "June 1, 2014"}, {"Title": "not good", "Author": "Tran Mitch Pham", "ReviewID": "R3RX15BJ92MR9H", "Overall": "1.0", "Content": "charge it, put my chips set in use about 48 hours, then no battery, then I charged but no power takethen it stop on, then I returned in heart beat", "Date": "May 18, 2014"}, {"Title": "Cool is show off but that's about it", "Author": "The Hunts \"The Hunts\"", "ReviewID": "R2795NR5M8A6SN", "Overall": "3.0", "Content": "My son was really excited to buy the latest & greatest phone and although he was excited for the first week, he soon realized how impractical it was and switched back to a regular phone.  He couldn't really send or receive texts or access the internet.", "Date": "April 29, 2014"}, {"Title": "Works great!", "Author": "Jakers", "ReviewID": "R3CX8VOOAWX4T5", "Overall": "5.0", "Content": "It is a little big but it is nice for the price you pay. I bought this for my son because he keeps getting phones lost or stolen.", "Date": "March 4, 2014"}, {"Title": "Cell phone Watch", "Author": "Gloria Johnson", "ReviewID": "R1K61CYUYUDVUK", "Overall": "5.0", "Content": "Great product , enjoying it ! I am recommending this to family,friends and co-workers. The durabliity and style is very flexible.", "Date": "March 8, 2014"}, {"Title": "love it", "Author": "moammer", "ReviewID": "REHG0KUISE0AA", "Overall": "5.0", "Content": "great definitely a 5 star works great all people should know about this make a video out of it and make a commercial on t.v trust me u will get a bbbbbiiiigggg big hit  it depends on u yes or no f y i its great and i am not a employe who says this right now i am a customer", "Date": "January 6, 2014"}], "ProductInfo": {"Price": "$54.80", "Features": "Insert GSM Standard Size Sim Card\nAT&T;, T-Mobile and All other GSM carriers Sim Cards are OK\nVerizon, Sprint NOT OK, other NOT GSM Carriers NOT OK\nWide Touch Screen, Mp3/4\nSmall and comfortable to take and use", "Name": "Watch Cell Phone Mobile 1.8\" Wide Touch Screen Mp3 Mp4 (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51izEN3RDgL._SY300_.jpg", "ProductID": "B00HFRDBNO"}}