{"Reviews": [{"Title": "Greatest 2G Andrpid phone in the market .Hands Down", "Author": "desmond cruise", "ReviewID": "R3AZUH4W74BXEI", "Overall": "5.0", "Content": "Got this as a gift from my wife for my birthday and here is why I am giving this rating:This is a good looking phone with super leather back just like the note3.Yes this is not a 3g phone goes upto edge but believe me it is does better downloads than my  my earlier 4GLTE Samsung deviceThe set up was so easy that after I inserted my sim I got automatically connected to the network in 5 secondsMost of the popular apps are already there and I was able to download a lot more.Reception is super! never loses signal.The mtk 6572 (Arm Cortex -A7 dual core 1ghz ) is fast and efficientIt has one of the best one of the graphic chipset for Console Emulators and Games(- Mali-400 mp)The battery life is great ! I got 12 hours of steady usage out of it with data on downloaded apps and watched movies and  pictures with and listened to music on it all day.The 8GIGS of TF card installed is a huge bonus .You can save plenty of stuff there.The camera is  decent and the front camera is good enough  on skype and other video chats.The screen is crystal clear and has super viewing angle. Great resolution.The speaker is loud and clear,.The microphone works well as well. Videos played clean and no lag or hesitation.The phone comes with a really nice case include withThe 2 Batteries included in the pack is a big bonus!AM ORDERING ANOTHER ONE TODAY FOR MY SON.Highly recommended for anyone who wants to own a super smart phone without spending a fortune", "Date": "February 21, 2014"}, {"Title": "NO GPS! but still good phone =)", "Author": "Chris Swiontek", "ReviewID": "R1C38YCFP2GZQ4", "Overall": "3.0", "Content": "first , let me say that i am a BIG FAN of Lightahead, and that i generally rave about all the products by this seller {They sell really good stuff ! and the best prices this side of Asia], but....with that being said:  i really wasnt impressed with this phone. its not bad ,mind you , The touch screen is very smooth and responsive./ The WIFI range is actually incredable =} 110 feet line of sight./ blutooth works great and reconized all my devices ./display is bright and has a good range of viewing angle./ has a really Unique version of android on it {its actually 2.3 running a spoof mod to look like 4.3 -nothing wrong with that really,it still installed and ran every app i downloaded from the google play store just fine}. /and the Specs aint half bad:  -Arm Cortex -A7 dual core 1ghz {not to shabby}  - Mali-400 mp graphic chip set {one of the BEST for running Console Emulators and Games}  - 854 x 480 res screen {240dbi screen density and bright}  - 256mb of system memory {decent -no lag actually with this chipset -and the system is very efficient with it-so its FAST}  - 2600 mAh 3.7v battery [comes with 2 of them actually- and there really good !  - 9 hours talk time [i left the wifi on/ used my blutooth the entire time/watched 1 movie/ listened to 2 pinkfloyd albums / and took 20 pictures with flash / checked my facebook a few times and used all day as my business line....so YES ,its got pretty good battery life =)  - 1.3mp camera on the back {tho the settings constantly say its 4mp} with a Really good Flash {took low light pictures pretty well and still pretty good in total darkness at about 6ft with flash}  - 320x240 res front camera {a little low,but was fast framerate on skype video chat over wifi}  - Record very good Video ! and the sound was very clear and fast frame rate  - Great reception and loud speaker! mike is good too- callers on the other end could hear me loud and clear.  -COMES WITH A REALLY NICE cover /case with a cutout for camera and flash on the back.  -one of the most Accurate 3-Axis Accelerometers i have ever seen in a phone!{its a KXT J2-1009 series /same as 5c iphone]  - back plate has textured pattern on it that looks great and isnt slippery in hand {good thing=)  -comes with a 8gig micro sd card already put in phone and is set up to install apps to sd {very nice}, it will actually take up to  a 32gig {i tried it and it worked fine}  -it may only be a 2G data chip...but it was still pretty quick on data using T-Mobile ,got 1.3mb down and 0.8mb up{not bad}  - Overall A very clean,thin,  and Stylish looking cell and feels very solid in hand and looks expensive.Now....here's what i didnt like about it:  this model cell is advertised as having GPS! {there is NO GPS CHIP IN THIS PHONE AT ALL} it REALLY \"erked\" me a bit !  Now,granted , i always buy at least 1 of every new phone Lightahead sells =) and if i really like it ,i buy many more , but im kinda torn on this one. its not bad , in fact its actually a pretty good cell overall, but it feels more like a  \"$85.oo phone\", than a \"$95.50 phone\" . {because its smaller than a 5\" and has no GPS CHIP], but then again...they do include a 8gig Micro sd card with it ,so i guess it balances out =)p.s. Change the \"has GPS \"part in the product description.  and ,YES , i DO like the phone =) its a keeper,and my employees gave it a solid 8 out of 10  ,so im gonna order a few more=0  -", "Date": "February 11, 2014"}, {"Title": "\" It's not just good looking its got brains! A real smartphone.\"", "Author": "Carl Redford", "ReviewID": "R3RGW1ZPXOOH37", "Overall": "5.0", "Content": "This is my second phone bought from Lightahead and I have already become a fan of theirs.Few reasons to describe this awesome device.1.  Fast and efficient latest Powerful MTK 6572 processor works well.2.  The 4.7 inch screen is impressive.3.  Set up is a breeze.I inserted my AT&T; and it god connected to the network within a few seconds.4.  Dowloading apps couldn't have been easier5.  Extremely nice and pleasant appearance.6.  Wifi range is good and it connects instantly..7.  Most of the popular apps are already uploaded in the device.8.  Call quality is extremely clear and calls do not drop at all..9.  It is a 2g phone but much superior to most 3G phones being sold in the market by Chinese sellers.10.  The 8GB Tf installed is extremely useful when it comes to downloading apps/music etc.11.  MMS works fine.12.  The screen display is great .13.  Camera quality is good.14.  Battery has lasts long enough to keep you going for the day easily.15.  This 4.7 inch phone is one of the best in the market for its price.16.  I would recommend this to anyone on a budget and wanting to buy a decent phone..", "Date": "February 12, 2014"}, {"Title": "Great phone", "Author": "Amazon Customer", "ReviewID": "R356962RPOISXA", "Overall": "5.0", "Content": "I bought this phone for my daughter after considering MANY options. This was going to be her first phone and it had to meet a \"teenager's\" expectations! Well I must say, it has. She loves it and so do her friends.  It looks great and operates like one of the more expensive brands. The only thing she complained about briefly was the camera quality,  but that quickly passed over. The size is impressive and I'm happy if she's happy! We recently purchased a phone case for this phone and I'm hoping it fits. We had a little difficulty finding one that we thought would fit. All in all, great phone, good price, good quality,  kid tested, and mother approved!", "Date": "April 2, 2014"}, {"Title": "dont be fooled", "Author": "Leana", "ReviewID": "R3DVPLF5AWQVRV", "Overall": "1.0", "Content": "the phone's front facing camera didn't work.It also ran slowly and the volume kept going out it sucked  why i had to ship it back waste of my time and money", "Date": "March 17, 2014"}, {"Title": "i love it already!!", "Author": "ang", "ReviewID": "R1PHHH3WYL4ZJY", "Overall": "5.0", "Content": "This is pretty ligit phone to me..I hope it takes metro PCs or simple though I have WiFi on n I'm using the phone to leave this review i just need to get a new sim card hopefully the one i get works it does say any carrier lets see what happens....but I love it already...its deff. Worth the money to me!!!! If u r looking for a phone and come across this one stop! N get it! Its nice its cheap n even though its not a real Samsung its just as good!!!", "Date": "February 23, 2014"}, {"Title": "good for making calls only!!!!", "Author": "Alexis", "ReviewID": "RQ85UC6V75XUL", "Overall": "1.0", "Content": "Phone worked for making calls that's it. I couldn't get the internet to work, camera was horrible, I decided to just return it and get my money back.", "Date": "May 23, 2014"}, {"Title": "VERY DISAPPOINTED!", "Author": "Holly", "ReviewID": "R12ZLU599T0FJY", "Overall": "2.0", "Content": "im sorry i wish i could give a better ratage but i just cant the only reason it got 2 stars is because the phone was very pretty looking and it came on time but the actual phone was junk the internet was super slow even in other areas than i live but what do you expect with a 2g phone. the playstore would hardly ever load. the camera is absolutly terrible you had to be in super lit area to get a half decent pic so the flash really stunk! the front camera was so zoomed in that honestly the front camera was useless and there was no way to fix it! i was extremely dissatisfied with this phone and also another phone i ordered so needless to say i wont be buying anymore phones off here. i was lucky enough to sell this phone and get some of my money back but the lady i sold it to was not happy herself she turned around and sold it too. i honestly dont know if the service was the actual phone or if it wad straight talk. but things on the phone i was still unhappy with! sorry wish i could of gave a better review! needless to say neither of the phones i bought i do not use!:(", "Date": "May 21, 2014"}, {"Title": "Headalight is a wonderful company . Always affirmative regarding there merchant.", "Author": "Wanda W.", "ReviewID": "R1A7XNDBBS0TH1", "Overall": "2.0", "Content": "The phone is cute but it was not what I needed . It froze up and stalled at the worst times . The screen would be blank and I would have to re boot it through out the day. I could not download all my app and music and movies . So I sold it to a co worker and she loves it. This phone is very nice if you have a small amount of things such as maybe Facebook and a few pictures and maybe a small amount of games.", "Date": "May 19, 2014"}, {"Title": "dont bother.", "Author": "Ashley S.", "ReviewID": "R251OPU8XMAK6G", "Overall": "2.0", "Content": "search for something better. The phone is slow and cheap and not the good cheap. you cant hear anything out of the ear part. and its so slow.", "Date": "May 15, 2014"}, {"Title": "No good", "Author": "Monica L.", "ReviewID": "R2HDNF3ZBW23B7", "Overall": "1.0", "Content": "Don't buy this phone please it's no good.  Took it to att an it would not work or turn on when they put it chip it in it.", "Date": "May 1, 2014"}, {"Title": "would recommend", "Author": "rayray", "ReviewID": "R2L9ONJ4G3JLC6", "Overall": "3.0", "Content": "this is a great little phone is worth the price,the screen was really clear did everything that I wanted it to do", "Date": "April 18, 2014"}, {"Title": "LIGHTAHEAD PINK 4.7 INCH", "Author": "PRECIOUS FEAZELL", "ReviewID": "R4JVGA4N8D3YT", "Overall": "5.0", "Content": "I ordered the phone and got it March 12th couldn't wait to open it. I read other reviews but I must say my phone has been good to me and still working just like new will be order again. I recommend you buy you want go wrong!!!", "Date": "April 12, 2014"}, {"Title": "good value. SOME LITTLE GLITCHES. OTHERWISE GOOD. PREFER OTHER COPIES", "Author": "Amazon Customer", "ReviewID": "R1CWAVOU4SR1U9", "Overall": "3.0", "Content": "GREAT FOR PRICE. SOME IRRITATING GLITCHES EVERY ONCE IN A WHILE. LOCKS UP. CAMERA DOESNT ALWAYS FUNCTION. OVERALL OK WITH IT", "Date": "March 27, 2014"}, {"Title": "Good phone", "Author": "Kaisa", "ReviewID": "R8YYASIM3BZLU", "Overall": "4.0", "Content": "Good phone, great price. If you ever have a problem with the phone, LIGHTAHEAD will definitely fix it for you.", "Date": "March 19, 2014"}, {"Title": "lightahead", "Author": "Amazon Customer", "ReviewID": "R3AWAHV1DK6KJ4", "Overall": "3.0", "Content": "The phone was shipped on time. However the phone was not what I expected it was very slow in browser and the apps. Everything else about the phone was good just to slow", "Date": "March 4, 2014"}, {"Title": "Super  smartphone. Fast \"PLAYSTORE\" and great apps.", "Author": "saun", "ReviewID": "R2Q446Q8ICAJX", "Overall": "5.0", "Content": "Here are the reasons for my 5 starts.Super easy set up. Connection is almost instant after the Simcard goes in.Works best with AT&T; and T mobile.Crystal clear call quality. Haven't has even \"ONE\" ever since I purchased it quite a while ago.Instant wifi connection with great range. Just enter the network credentials and you are all set for super fast browsing.The MTK6572 is surprisingly fast and the dual cores fully justifying their role.One of the best things about the phone is the ease with which you can paly around  the \"PLAYSTORE\" which is fully installed and operative in the device.The search in the play store is fast  easy and precise.Haven't so far had a miss on a keyword. Usually the desired app pops up at number one of the search result..Camera quality is good and pictures clear.The front camera is useful as well.The 8GIGS of storage is a boon for music and movie lovers.Screen display resolution is fairly good and watching movies and videos is fun on this cute little device.Useful information for fellow buyers:The APN settings are automatically installed in the device with both AT&T; and T mobile. Hence do not attempt to change them as they are perfect and the moment you see the signal bars go ahead and use internet and MMS with full ease.Ok this phone doesn't have 3G compatibility but believe me the internet with  edge data connection is much  faster than what I had with T mobile 4Glte in my previous Samsung galaxy s3.The leather back makes it one of the most attractive phones in the marketThis is a unique phone in the market for the price at which it is advertised.Grab it before Lightahead  launches a newer more expensive mode.In the end I must say I love this phone.Thankyou Amazon for making such great devices to its customers.", "Date": "March 24, 2014"}, {"Title": "Easily one of the best androids in the market", "Author": "Jadira", "ReviewID": "R2HO1BH6AM2XCW", "Overall": "5.0", "Content": "The MTK 6572 processor is so awesome that even though this phone is not 3g it works as well as any other 3g phone.Call quality is super.No dropping of signal or calls.MMS works fineThe touch screen is very smooth and responsive./ The WIFI range is actually super.bluetooth works great.Downloading apps is a breeze.Set up couldn’t have been easier.Just insert your sim and you are good to go.Screen display is pretty and colors smooth to eyes.Overall a great value for money .A highly recommended phone.", "Date": "February 12, 2014"}, {"Title": "Good looking & Efficient! One of the best androids!", "Author": "Regi Sylvain", "ReviewID": "RZPGAGEXKFUDH", "Overall": "5.0", "Content": "Here are the reasons for a 5 star rating1. It is pleasant to look at with a lovely leather back looks great2. Set up is a effortless.Works great with AT&T.Insert; your sim and you are all set with an activated amartphone in your hand.3. It is a 2G phone but gets great sppeds on edge.4. Super fast experience on theCellphone network as well as wifi5. WIFI set up is perfect6. Dual core MTK 6572 processor works fine7. Call quality is great,no dropped calls8. Screen resolution is good and colors pleasant.9. Dowloading apps is easy and Google Playstore alongwith most popular apps are already installed.10. Memory with 8GB tf is more than sufficient11. Back Camera takes good pictures12. Battery life good enough for heavy browing throughout the day.The second battery is a bonus.13. The free case that comes with it is cool14. To sum up,Great phone at super price.I recommend it wholeheartedly!", "Date": "February 27, 2014"}, {"Title": "no sims as promised", "Author": "jeff bombard", "ReviewID": "R1ZPRIHPJSQCOR", "Overall": "1.0", "Content": "no sims phone won't operate without them.  a waste of my time and money.  mekes me hesitant to buy electronics onlline", "Date": "June 7, 2014"}, {"Title": "Nice phone", "Author": "Kirkland H Bodie", "ReviewID": "R33YLFHD4VFE3K", "Overall": "3.0", "Content": "The only problem I had with this phone, was finding a case for it, other than that, I totally like this phone.", "Date": "June 7, 2014"}, {"Title": "My New Device", "Author": "Yvonne Knight", "ReviewID": "R32VDS8DS1KOHZ", "Overall": "4.0", "Content": "Shipping and arrival time were awesome, I like the device a lot, it is slender and fits well in pockets I appreciate the case that came with it and the fact that it also came with an 8G SD card & an extra battery, the Wi-Fi works wonderfully, the cameras works great.My concern though is that that each time I go to play store to download my favorite games and apps I keep getting the message that there is not enough space on the device so I am yet to download these apps/games.", "Date": "June 4, 2014"}, {"Title": "phone", "Author": "Tblack", "ReviewID": "R1SNC31B0O21IT", "Overall": "1.0", "Content": "I only had the phone a month and already had to purchase a battery. It don't charge good and I have problem with my apps.", "Date": "June 3, 2014"}, {"Title": "Nice phone but did not work", "Author": "Leila Hillman", "ReviewID": "R19MYPM9DKAX0L", "Overall": "1.0", "Content": "I really like the way the phone looked after I received it.  I ordered the SIM card and found out that the phone was not unlocked. Not sure if I want to go through the hassle of ordering another one.", "Date": "May 30, 2014"}, {"Title": "good for the price", "Author": "Gurey", "ReviewID": "R2P75WE5DCTXU4", "Overall": "3.0", "Content": "great phone for a gift. i didnt used but the only isues that i can think of is the phone doesnt have Gps capability.good for the price over all.", "Date": "May 30, 2014"}, {"Title": "Lighthead N900 Easy Light and fun to use", "Author": "A. Bowe \"Dreadslin\"", "ReviewID": "RBLZ8121NMC8H", "Overall": "5.0", "Content": "Light, easy to setup and fun to use.Exactly what I expected.  Delivered on time and in perfect condition.Using on the BTC/Lime network in the Bahamas", "Date": "May 23, 2014"}, {"Title": "DON'T BUY THIS", "Author": "Stephanie Moore", "ReviewID": "R2DF4TXTD35AQ4", "Overall": "1.0", "Content": "I GOT IT OUT OF THE BOX SAID IT WAS NEW WELL THE SCREEN WAS CRACKED. I OPENED THE BACK TO PUT THE BATTERY IN WELL THE SCREEN CRACKED IN A DIFFERENT PLACE JUST BY PUTTING THE BACK ON IT OMG.I CAN'T TALK ON IT KNOW ONE CAN HEAR ME. IT PICKS UP SERVICE WHEN IT WANTS TO THE WORESE PHONE EVER. PLEASE PEOPLE PLEASE DON'T WASTED YOUR MONEY.", "Date": "May 22, 2014"}, {"Title": "Bad Device", "Author": "Evelyn Odiete", "ReviewID": "R2HU5V6GYM185V", "Overall": "1.0", "Content": "Terrible Device . No Manual included. it did not work when I inserted the sim card. I tried two different kinds of sim card it stated it supported but none worked.", "Date": "May 17, 2014"}, {"Title": "Lightahead Unlocked dual sim", "Author": "Marie N.", "ReviewID": "R3R8PI2ON0E2WT", "Overall": "4.0", "Content": "Love it. Easy to handle. Would recommend to any of my family or friends looking for a good  unlocked phone", "Date": "May 15, 2014"}, {"Title": "Good phone, great price!!!!", "Author": "Tamika Uter", "ReviewID": "RRC3TCETJVESF", "Overall": "5.0", "Content": "This phone works great. better than expecteded. i origanlly wanted a samgsung but i got this one and im so happyy", "Date": "May 13, 2014"}, {"Title": "good all fine", "Author": "Pedro Alfonso González Vieira", "ReviewID": "R2U9VMO61SLOJJ", "Overall": "5.0", "Content": "i like the  phone , price and quality is veri good, i live in vzla, its good for latin america companys", "Date": "May 8, 2014"}, {"Title": "Poor quality", "Author": "Jessica Connelly", "ReviewID": "R17PX9A8N0J2AS", "Overall": "1.0", "Content": "Could not hear on calls, other callers could hear me though. Horrible data connection. Very very slow. Battery barely holds a charge.", "Date": "April 29, 2014"}, {"Title": "don't be fooled", "Author": "allicie briggs", "ReviewID": "R64W09ATIL34S", "Overall": "2.0", "Content": "Phone is cute. It is slow. This seller claims it runs a 3g. That is a lie. The phone doesn't get good reception. Hard to hear with a Bluetooth. But u get what u pay for", "Date": "April 8, 2014"}, {"Title": "Works in Mexico", "Author": "loumamba", "ReviewID": "R1LE1YGKKA9K1J", "Overall": "5.0", "Content": "Im happy with the cellphone its nice, but theirs not too much memory on the divice. Im living in Mexico and it works great I just install my sim card and it works.", "Date": "April 2, 2014"}, {"Title": "just alright", "Author": "Nikki", "ReviewID": "R1FMSFVAPY0TS7", "Overall": "3.0", "Content": "It's an over all good phone, but the screen broke the first time I dropped it and it's kinda slow. It was a wonderful temporary phone.", "Date": "April 1, 2014"}, {"Title": "want to love it but concerns....", "Author": "mom", "ReviewID": "RBDF37LM6LKMO", "Overall": "2.0", "Content": "Adorable phone however back of phone never attached completely after installing battery which leaves interior exposed for water dust... Painfully slow to load internet with at t compatible card via net10...and as of this posting no way that I can find to get tech service or replacement cover from seller...hummm...", "Date": "March 26, 2014"}, {"Title": "worst phone I ever had", "Author": "Courtney Alderman", "ReviewID": "R2KQ6IXI23NFZL", "Overall": "1.0", "Content": "I have had this phone for less than 2 weeks and so far I have missed several calls due to it going so slow that I cant even answer.  Programs keep messing up and give me error messages non stop.  Some apps won't open, and my contacts will not sync to the phone.  Don't waste your money NOT WORTH IT.", "Date": "March 19, 2014"}, {"Title": "My  phone", "Author": "Eman D.", "ReviewID": "R1WWKBY8TJWP9Z", "Overall": "1.0", "Content": "i got this phone thinking it was going to be an amazing phone. a lot was wrong with the phone.", "Date": "April 1, 2014"}, {"Title": "Cell Phone", "Author": "Donna E. Shubert \"lovely reader\"", "ReviewID": "R2D2CWDBHE9O24", "Overall": "2.0", "Content": "Even though advertised to be ATT compatible, it was not. My granddaughter could not send text messages.  She had to wait for someone to send her a text first, then she could respond. Very disappointed.", "Date": "March 28, 2014"}, {"Title": "never heard of this phone", "Author": "crystal nicholson", "ReviewID": "R29IX351ZETDMK", "Overall": "1.0", "Content": "the phone was sent with the directions for a iphone and it, i was not happy thanks but no thanks", "Date": "February 18, 2014"}], "ProductInfo": {"Price": "$95.50", "Features": "FULLY UNLOCKED READY TO GO WITH ANY GSM CARRIER IN ANY COUNTRY Dual Sim Dual Camera Android 4.3 Mobile Smart Global Phone from Lightahead® (2G coverage only)\nPowerful latest MTK 6572 , Dual Core, 1.2GHz processor for fast browsing easy texting and excellent call quality.8GB rom 4.7 inch screen\nMost popular apps already installed.Access to 100s of other android apps through Playstore...Wi-Fi, Bluetooth, Browser.\nRAM: 256MB; ROM (8GB TFcard installed) Expandable up to 32GB (not included)\nDisplay: 4.7 inch capacitive touch screen, 854*480 resolutions; works well with all GSM carriers like AT&T;, T-MOBILE", "Name": "Lightahead® Unlocked 4.7 inch N900 (LA550) Capacitive Touch Screen Dual SIM Dual Camera 8GB rom WIFI MTK 6572 Dual Core Android 4.3 Mobile Smart Phone (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41VgI%2BhJMUL._SX300_.jpg", "ProductID": "B00HZS4WTA"}}