{"Reviews": [{"Title": "A $19 LOCKED Phone With Limited Storage For Apps", "Author": "Alan  Houston", "ReviewID": "RWJL7ZRGFVY08", "Overall": "3.0", "Content": "The Evolve is LOCKED to MetroPcs.  The Evolve sells for just $19 at the MetroPcs website and at MetroPcs stores, a huge discount from the T-Mobile version.WARNING:  The Evolve has a tiny internal memory for apps.  You must install a micro SD memory card on \"Day One\" and set it as the default for storage or the Evolve will freeze up when large apps are installed.The version sold at T-Mobile stores is locked to T-Mobile and the version sold at Metro stores is locked to MetroPcs. Both versions can be unlocked after 90 consecutive days of paid service.The Evolve does NOT compare well with the $100 phones sold at the MetroPcs website, but at $19 it is an acceptable choice. The Evolve has 80% of the features and power of $100 smartphones for 20% of their cost.The Evolve can connect to wifi and stream Netflix movies. Its 3G is not fast enough to stream video but it can stream music from Pandora radio or Spotify. The four inch screen has good color and contrast. The Evolve's small size makes it comfortable in your hand and in your pocket pocket. The soft touch coa for Netflix movies but is not sharp enough to read small text.  The soft touch coating on the back cover provides a more secure grip.The Evolve's tiny internal memory requires you to install a micro SD memory card on \"Day One\" and set the SD card as the default for storage. You should transfer large apps to the SD card and uninstall updates for the apps you never use and then disable them in the apps menu.You must keep at least 200mb of internal memory free for your phone to operate smoothly. The \"one star\" and \"two star\" ratings for the Evolve are the result of people not leaving enough open memory for the Evolve to work properly. You can move many large apps, such as Netflix, to the micro SD card and apps that you don't use can be disabled after you uninstall their updates.The battery charge lasts only two or three hours if you are watching videos or using the GPS to navigate. Keep wifi, 3G, Bluetooth and GPS OFF until you need them. Keep the screen brightness at the lowest possible setting indoors. That enables you to get about 12 hours per charge allowing for some texting, downloading email, and some short phone calls.The camera lacks a flash but its takes okay, but not very sharp, photos outdoors in bright sunlight. On a rainy day, set the camera's light balance to \"cloudy\" and lock the ISO at 200 for \"okay\" photos.Double open internal memory and double battery life by disabling bloatware on your Evolve. Go to \"settings\", \"apps\", and then \"all apps\". For each app, uninstall updates, uncheck notifications, then check \"disable\". If decide later to use an app, you can check \"enable\". The useless apps include: Android wallpaper, Black Hole, Bubbles, Face Unlock, Hangouts, Live Wallpapers, Movie Studio, Music Wallpaper, Phase Beam, My Metro, My T-Mobile, Swype Keyboard, Talk Back, Word Clock, Chrome Browser, Google Books, Google+ (Google Plus), Google Games, Google Magazines, Google Movies, and Picassa Uploader.These apps clog your memory and several run even when you are sleeping to drain your battery. Disable them on \"Day One\".After these changes, the Evolve runs smoothly and you will have 700mb of open internal memory to download your favorite apps. Many large apps, such as Netflix, can be moved to the micro SD card to open even more memory.Bottom Line:  If you plan to spend $100 on a phone, the MetroPcs website currently has MUCH better phones than the Evolve.  If you want to spend only $19 for an Android phone, the Evolve can provide acceptable service.", "Date": "February 24, 2014"}, {"Title": "Very good phone for the price", "Author": "Kibrom Berhe Hadush \"Kibrom\"", "ReviewID": "R3A02Q1SKF010D", "Overall": "4.0", "Content": "A very good phone for the price, working well but please you need to inform the buyer that the phone is locked to MetroPCs that I had pay few dollars to unlock and use it other networks", "Date": "April 12, 2014"}, {"Title": "From now on Amazon will be my one stop electronic shop!", "Author": "TYNETTE PAISLEY", "ReviewID": "R1WDXO3FD89Z7M", "Overall": "5.0", "Content": "Purchased this phone for my daughter & she loves it! This phone was the double the price at the local wireless store, but I decided to check out amazon first before making the purchase & i'm so very glad I did!", "Date": "April 1, 2014"}, {"Title": "Nice phone!", "Author": "Julie M.", "ReviewID": "R1JAE5M9X8N7RR", "Overall": "5.0", "Content": "It has meet every expectation we have had. No lag. Takes great pictures. My son likes the front facing camera. Great phone. Great price.", "Date": "March 20, 2014"}, {"Title": "the phone asked me not released a code of 8 digits", "Author": "jhonmata", "ReviewID": "RPEH1QI9FMJYT", "Overall": "1.0", "Content": "The team and I have it in my hands, but my introduce my sim card does not work Venezuelan operator, repeatedly asking me a code 8 digit  metro pcs, ie I have not enjoyed my purchase. It is for this reason that I am not satisfied with the team since buying it when said to work with any band and those of Venezuela. I would appreciate to help me with this 8 digit code to unlock the device and use it with the Venezuelan operators and feel satisfied. I appreciate your prompt response.El equipo ya lo tengo en mis manos, pero al introducirle mi tarjeta sim de mi operadora venezolana no funciona, me pide repetidamente un código de 8 dígitos de metro pcs, es decir que no he disfrutado mi compra. Es por este motivo que no estoy satisfecho con el equipo ya que a la hora de comprarlo decía que funcionaba con cualquier banda  y las de Venezuela.  Les agradecería  que me ayudaran con este código de 8 dígitos para poder liberar el equipo y usarlo con las operadoras venezolanas y sentirme satisfecho.  Agradezco su pronta respuesta.", "Date": "May 29, 2014"}, {"Title": "For Metro PCS Only, not suitable for T-Mobile (this is the reason for 1 star)", "Author": "RADO \"Tolete\"", "ReviewID": "RZMST973AVLKP", "Overall": "1.0", "Content": "When I purchase this device, it said that it was a T-Mobile phone, btu the one I receive is a Metro PCS phone. I called Amazon, and the tech guy who waited on me (Luke), assured me the device was compatible with T-Mobile too. When I went to activated it, ti did not work; after that, I called T- Mobile, and they told me, the device was lock and only work with metro PCS...Eventhough, the girl who waited on me today (Jennifer), was wery kind (in fact all of the people were corteous with me), the problem was not resolve, and after all the hasle I'll be returning the device!!!", "Date": "January 7, 2014"}, {"Title": "The team received not unlocked as it says in the computer properties  Please fix this issue", "Author": "Credencial \"jhtaborda\"", "ReviewID": "R2Y8PQJ9O1D7UO", "Overall": "1.0", "Content": "The team received not unlocked as it says in the computer properties The cell to enter the simcard asks me for a unlock code, and I buy an unlocked phone, but I get this locked for other simcardPlease fix this issue", "Date": "February 26, 2014"}], "ProductInfo": {"Price": "$59.00", "Features": "Affordable, enjoyable smartphone experience\n4 in WVGA Touchscreen\nAndroid 4.2 - Jellybean\n1 GHZ core processor & 512 MB RAM / 4 GB ROM plus Micro SD Slot for Memory expansion\n5 MP camera, VGA Front-facing", "Name": "Alcatel One Evolve Prepaid Phone (MetroPCS)", "ImgURL": "http://ecx.images-amazon.com/images/I/41t9VeSnuAL._SY300_.jpg", "ProductID": "B00H92FYLM"}}