{"Reviews": [{"Title": "Excellent Product, Big Deal", "Author": "Luis M.", "ReviewID": "R2XUV8RE5FQ52H", "Overall": "4.0", "Content": "Very good phone at a very attractive price.The House , but could improve the software , takes very nice pictures . Having 12 and 5 Megapixels for less than $ 300 is very good deal.The size, turned out bigger than I expected , 5 inches is certainly something that begins to be intermediate between a phone and a tablet , but the screen looks great and everything runs very fluid. It is a heavy must therefore be careful to avoid falling out of hand.Android 4.2 nothing to complain about , is very close to giving a full Google experience. Waiting for the update to 4.4 Kitkat .Heat a little playing , I imagine it feels like more because the casing is metal.One last thing is that it is sealed , so you can not replace the battery , so it's a phone whose useful life is inexorably tied to the battery .At the time of purchase , I had not realized the existence of the BLU Life One X , with better features, and only $ 20 more expensive on average ( 16 GB version ) . but surely will share the same handicap of this apparatus.Anyway, I'm enjoying it .", "Date": "March 15, 2014"}, {"Title": "This phone has the worst speaker phone ive ever used plus it doesnt sound off when people call at times.", "Author": "The Tall Man", "ReviewID": "R11IWJF6S6UVYR", "Overall": "1.0", "Content": "First off this phone has a very low speaker phone volume. I do not recommend it to anyone. Also the ringer volume when some one calls is very low as well plus the phone sometimes doesn't even ring when someone calls me. Im using At&t; which is a great network and have never had problems with other phones. Also i tried contacting blu several times but they don't even bother to answer there customer service phones to help customers what kind of a company is this ? I found this is nothing more than  a xolo q1000sChinese knock off that had the same low volume issue and blu never bothered to fix it in a software update. Any way im in the process of returning it in which Amazon has been great with there customer service and help in doing so. The only nice things about this phone was its screen resolution and quad core that's it Wont be buying a blu product again but Amazon is by far the best online store..", "Date": "May 3, 2014"}, {"Title": "So disappointed.", "Author": "N.N.", "ReviewID": "R2ASSDE5MA43H9", "Overall": "3.0", "Content": "I received this phone as an early birthday present. I got to choose my phone and heavily researched all my options, hoping to not spend too much since my family is not on that baller status. I ended up choosing this phone and was so happy with my purchase. Unfortunately, the phone shut off and would not turn on after less than a month of use. Luckily this happened before the return window closed but I was so disappointed. The phone is of wonderful quality and I loved the size and all the accessories that came with it. Yes, the speakers could be louder but it was not a big deal for me. The camera was of really good quality and I didn't have problems running any applications. I just wish it hadn't funked out on me or I would have happily been a BLU phone customer. I should also note that I was on the T Mobile network and this phone is not compatible with the data but it can make calls and send/receive text messages. I would just use the smartphone capabilities with a WiFi connection.", "Date": "May 12, 2014"}, {"Title": "Another great phone and great value from BLU", "Author": "Amazon Customer \"JPM\"", "ReviewID": "R7N38WBALAO3H", "Overall": "5.0", "Content": "This is the third BLU phone added to our family use.  They work wonderfully, are well made & well designed.  I use a BLU 5.5, and my daughter has a 5.0.  My son LOVES this Life Pro model for its superior camera features and very fast OS.  Oh, and they're about HALF the price of the \"brand name\" phones out there.  We operate on Android, and these are as good as Samsungs, HTCs, etc.My family (other than me) has a \"poor history\" of mobile phone survivability.  I used to insure our phones, and that was a good value at the start.  But as replacement phone deductibles have risen, buying a new BLU phone is the MUCH better deal.If I were to do it all over again, I would buy these phones new, and start my family's mobile plan from scratch by providing our own unlocked units from BLU.  I almost feel like we were swindled into the \"reduced price\" option when we got new phones with our initial plan.  HTC and Samsung are fine; BLU phones are better and cheaper.Gratuitous side comment: my mom uses a Nokia/Windows phone.  Blech.  I can't stand it.  You can't connect directly to Apple computers, and the applications aren't nearly as user friendly as the Google Play Store.", "Date": "April 30, 2014"}, {"Title": "Great Phone! Much better than Iphone and more cheaper too", "Author": "Adriano Battagin", "ReviewID": "RTWWUQ9XO67DE", "Overall": "5.0", "Content": "Great Phone! Much better than Iphone and more cheaper too. I bought for my girlfriend and she love it! I recommend", "Date": "March 7, 2014"}, {"Title": "Not enough memory.", "Author": "Alvlack", "ReviewID": "R37VB7132U3U9N", "Overall": "4.0", "Content": "The only bad thing about this is the capacity of memory, 16g is not enough for people who use this type of phones, they should be used 32g of internal memory if they were not going to add external memory.", "Date": "January 4, 2014"}, {"Title": "reliable comfortable phone with a powerful camera", "Author": "timur", "ReviewID": "R3R9AQAXMAP3I6", "Overall": "5.0", "Content": "excellent phone!nice camera and convenient interface,good soft,i choosed this product because i never used phones of this firm and i need  mobile with metal housing and good camera", "Date": "February 24, 2014"}, {"Title": "Bang for the buck.", "Author": "Juma Copeland", "ReviewID": "R35MYQAH96OJTV", "Overall": "5.0", "Content": "My first experience with a blu was terrible, it was the blu vivo 4.3, the phone was slow and very unresponsive, with poor battery life,imagine it took 5 minutes to boot up! After being burnt I was hesitant about trying another of their products but I have to admit I did a double take after I bought the life pro. This phone is the complete opposite, its responsive and very fluid, the display is gorgeous and the battery last the whole day. I am definitely willing to try another of their products, in fact my eye is on the life pure xl. The life pro a alternative for those on a budget and still want a phone with the capabilities of the so called brand name phones.", "Date": "May 10, 2014"}, {"Title": "Question about this product", "Author": "Honesty,PA USA", "ReviewID": "R3AZI5LQXBPUED", "Overall": "3.0", "Content": "Can anyone tell me how to turn off vibration on connection? With this phone? Vibration on connection is very annoying to me.", "Date": "May 7, 2014"}, {"Title": "LOVE IT", "Author": "DQ", "ReviewID": "R2BKO26M49TSRX", "Overall": "5.0", "Content": "I honestly think that this phone practically beats other phones in the market, Gorilla Glass Screen, a Case, 2 screen protectors (Which i don't use because I like the shiny look), the phone is really slim. Blu has great products (even the earbuds they give you are good in quality), I can't wait to see a new product", "Date": "March 12, 2014"}, {"Title": "Lovely but in need of jmprpvement", "Author": "Honora", "ReviewID": "R16W7QOC0LA9VX", "Overall": "4.0", "Content": "I would love to give rhis pone  a 5 rating becauss it is a lovely purchase with many wonderful features.  I cannot however because the volume is to low in comparison to other phones.", "Date": "February 1, 2014"}, {"Title": "product sucks...", "Author": "ivan", "ReviewID": "R1699JFNR4577U", "Overall": "1.0", "Content": "even thugh the product at first was great, after one weel of have purchased my phone, the battery wont charge any more, and as i purchased this item from amazon im not sure they will cover a warranty, i just feel robbed  right now, so if anyone is thinking on purchase this prodcut or any othe rblu product, he/she should be aware that its a low quality cellphone :(", "Date": "April 11, 2014"}], "ProductInfo": {"Price": "$299.00", "Features": "GSM Quadband 850/900/1800/1900, 4G HSPA+ 850/1900, Android OS, v4.2 (Jelly Bean)\n5.0\" IPS Display: HD (1280 x 720) with 1.5 GHz Quad Core Processor\n12MP Camera with LED Flash with HD recording (1080p), 5MP Front Camera for Video Calling and instant self portraits.\n6.9 mm Slim Aluminum Body Design BLU Next Lens Technology: \"One Glass Solution\"", "Name": "BLU Life Pro Unlocked Phone (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41tH6WAy6wL._SY300_.jpg", "ProductID": "B00HE55UV8"}}