{"Reviews": [{"Title": "Awesome phone!", "Author": "rpv", "ReviewID": "RX31P8GEQQZYI", "Overall": "5.0", "Content": "I got to play with a Nokia Lumia 1520 over past few days and it has blown me away. I have used so many phones/OS that I am fascinated by the diversity of ecosystem. I have used HTC Titan, some previous Lumia series  and past Windows Mobile series. After dabbling with iOS, webOS, WM, I have settled on a Android as a primary phone. Nokia Lumia series is elegantly designed. The 1520 is just gorgeous.I am interested in the specs of Lumia from following parameters. phone: size, weight, resolution, ppi, RAM, ext Storage, camera, CPU, USA SAR ratingNokia Lumia 1520: 6.41 x 3.36 x 0.34 in, 209gm, 1080 x 1920 pixels, 6.0 in, 367 ppi, 2 GB RAM, microSD up to 64 GB, 20 MP/1.2MP,  Qualcomm MSM8974 Snapdragon 800 CPU  Quad-core 2.2 GHz Krait 400, SAR: 0.59 W/kg (head), 0.24 W/kg (body)In my opinion, following are key specs to consider. Most of others are standard or does not matter at all. First size,weight and resolution are part of look and feel. RAM/CPU part of performance. external Storage is part of expandability. Camera is obvious! SAR  (Specific Absorption Rating) is an often ignored, but I feel essential to making a buying choice. Manufacturers don’t advertize or mention SAR prominently.The things that pop out is the screen size and the external storage capability. Obviously weight is a downside. The windows phone 8 operating system has matured to a large extent and most of common apps are available. It does still lag its distant cousins iOS and Android. But Nokia has given a splendid hardware. My experience of using camera (one of the best cameras in the smartphone and a key differentiator), navigation, reading articles, books, listening to music, watching videos were flawless. I highly recommend to anyone interested in windows platform. This phone is something to definitely checkout!As for a comparative analysis I have laid the specs of other top 2014 phones. I am sticker to useful specs and I find following spec will help you decide the best phone for your use case.Samsung Galaxy S4 (Intl version):  5.38 x 2.75 x 0.31 in, 130 gm, 1080 x 1920 pixels, 5.0 in, 441 ppi, 2 GB RAM, microSD, up to 64 GB, 13 MP/2MP, Exynos 5 Octa 5410 CPU, Quad-core 1.6 GHz Cortex-A15 & quad-core 1.2 GHz Cortex-A7, 0.85 W/kg (head), 1.55 W/kg (body)LG G2: 5.45 x 2.79 x 0.35 in, 143 gm, 1080 x 1920 pixels, 5.2 in, 424 ppi, 2 GB RAM, no ext Storage, 13 MP/2.1 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.26 GHz Krait 400, 0.50 W/kg (head), 0.69 W/kg (body)HTC One: 5.41 x 2.69 x 0.37 in, 143 gm, 1080 x 1920 pixels, 4.7 in, 469 ppi, 2 GB RAM, no ext Storage, 4 MP/2.1MP, Qualcomm APQ8064T Snapdragon 600, Quad-core 1.7 GHz Krait 300, 0.66 W/kg (head), 0.40 W/kg (body)Google Nexus 5: 5.43 x 2.72 x 0.34 in, 130 gm, 1080 x 1920 pixels, 4.95 in, 445 ppi, 2 GB RAM, no ext Storage, 8 MP/1.3 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.3 GHz Krait 400, 0.92 W/kg (head), 1.23 W/kg (body)Apple iPhone 5S: 4.87 x 2.31 x 0.30 in, 112gm, 640 x 1136 pixels, 4.0 in, 326 ppi, 1 GB RAM, no ext storage, 8 MP/1.2 MP, Apple A7, Dual-core 1.3 GHz Cyclone (ARM v8-based), 1.12 W/kg (head), 1.18 W/kg (body)Samsung Galaxy Note 3 N9000: 5.95 x 3.12 x 0.33 in, 168 gm, 1080 x 1920 pixels, 5.7 in, 386 ppi, 3 GB RAM, micro SD upto 64 GB, 13 MP/2MP, Exynos 5 Octa 5420, Quad-core 1.9 GHz Cortex-A15 & quad-core 1.3 GHz Cortex-A7, SAR: 0.24 W/kg (head), 0.72 W/kg (body)Motorola Moto G: 5.11 x 2.59 x 0.46 in, 143 gm, 720 x 1280 pixels, 4.5 in, 326 ppi, 1 GB RAM, no ext storage, 5 MP/1.3 MP, Qualcomm Snapdragon 400, Quad-core 1.2 GHz Cortex-A7, SAR: 1.17 W/kg (head), 1.06 W/kg (body)", "Date": "February 17, 2014"}, {"Title": "Okay, so this is my first smartphone...", "Author": "J. W. Mattern", "ReviewID": "R27PCUYK8MOIJA", "Overall": "3.0", "Content": "I've had a Blackberry from 2008, but it never could really \"do\" anything other than check email.  My initial thoughts on the 1520 are that it is awesome.My concerns with getting this phone were the large size and the Windows operating system. After some use, I'd have to admit that the size really does not seem to be an issue.  It fits in my dress pants pockets and is really nice when you are working on the phone. The screen is therefore huge in comparison to other phones, but is also amazingly clear in a way that other screens simply lack.I am still navigating through the operating system but it was remarkably simple to get started on.  Windows links your accounts from all over in a way that is seamless but also customizable.  Want to bring in all your contacts from LinkedIn and Facebook?  No problem.  Want to hide them in your contact list?  Simple.  Overall I'd have to say there were only one or two things I tried doing that were not intuitive, and they were easy to figure out with a little looking.  Having the home screen is great and keeps the phone from being too cluttered like I've seen on other devices.I will try to update my review in a couple of months to see if I still love the phone or if some issues come up, but so far everything is great.Revision #1: Okay, so the above was written on a Monday.  Today is Wednesday and my phone is dead.  First the camera would not work.  I'd start the app and it would be black.  A few hours later, the SIM card would no longer work.  Not knowing if the phone was fried or a bad SIM was giving the phone fits, I had it replaced to no avail.  The phone is simply defective.  Amazon wireless is overnighting a replacement which was easy and the best I could ask for.  I will keep a close eye on the new phone, but for now, the product review is dropping a couple of stars.", "Date": "February 18, 2014"}, {"Title": "The best phone I've ever had", "Author": "Mher Alaverdyan", "ReviewID": "R2BP6PXRY99TP9", "Overall": "5.0", "Content": "Pros:Great battery life, don't even think about it anymore. Whereas with all my previous android phones I had to constantly know where the closest charger was, just in case. This easily makes it through the day with just the overnight charge. It's a complete non-issue.Touch Responsiveness is very smooth. On the level or just slightly above that on my iPad, and it absolutely destroys the smoothness (or lack) of any android device I've ever had or tried.Really great camera hardware AND software. Lots of cool stuff you can do with this camera.Large screen is really great for reading. The large keyboard makes typing really easy and efficient. I thought the size of the phone may be a negative for this phone when I got it, but it's probably the opposite. The larger screen allows for so many positive things. If you have small hands it may be an issue I guess, but not so bad for my medium-sized hands. It does require two-hand usage in a lot of scenarios, but I'm pretty used to it.Cons:App depth is not as good as iOS or Android. This is a given, but I have found almost every app I've needed. I don't really play a lot of games except for chess, crossword puzzles and word games. There's good games for all of those. There are more games than I really care to get into. I can't really judge it because I'm not really into it.The biggest issue is really Google services, which there isn't much of at all. It is kind of annoying, but I've been essentially moving away from Google services as a result and at least that part has worked fine. Skydrive is equivalent to (or actually kind of better due to MS Office integration) Google Drive. Bing search is not as good as Google, but the gap is probably smaller than you imagine. For essentially 90% of the things I search, both would give the same thing as the top result. Nokia's HERE maps are surprisingly just as good as Google maps honestly. Outlook.com (forwarded from gmail) has worked well so far. The set up was a little difficult at first but I finally got it working. The only thing I haven't been able to replace is Google Talk, which I relied on heavily on my androids and now I'm having to live without. =/. At least my new plan has unlimited texts, so I guess that isn't so bad. I wish Google would just be a bro and give us some WP apps. It's kind of turning me sour on them for the way they have sort of behaved towards WP.This phone can be difficult to carry sometimes. The size is a negative in some respects. It fits well in some of my pockets and not well at all in others. I usually just go with carrying it in my underarm. I do have a case on it, the material feels a little slippery, or whatever the opposite of being able to have a good grip on it is. It really is such a sexy ass phone without the case on though. I might carry it around case-less sometimes just for that effect. It feels really nice in the hands and looks great, but I don't trust myself not to drop it.Bugs:Sometimes registers clicks when you are scrolling. I've heard this is a 1520 issue. Not a huge deal, but hope they fix it with some software update at some point. It can be annoying, but its fairly rare.", "Date": "March 11, 2014"}, {"Title": "had the 16gb 1520", "Author": "jonathan cotts", "ReviewID": "R1YYXKZSO8QT45", "Overall": "5.0", "Content": "just needed more space for maps and apps and games  none of those can go on the sd card your maps take up about 4gb your os will take up about 3gb thinly leaves you with 8-9gb to split your games and your apps I don't know if anyone else hates deleting a game but  I do because there is no cloud save for the xbox games except for the online gaming", "Date": "March 16, 2014"}, {"Title": "CAUTION When Buying", "Author": "Doug R", "ReviewID": "R2HXXKI4SSG8LN", "Overall": "1.0", "Content": "This device does NOT support bluetooth HID keyboards. An absolutely STUPID limitation. The whole purpose behind buying this device was to use it for my writing and it was only after I specifically Googled \"Bluetooth Keyboards on Nokia Lumia 1520\" that I discovered that Microsoft didn't build this into the operating system.Apparently they're going to include a driver in their late 2014 Official Windows Phone 8.1 release but it wasn't on the phone I received and I wasn't going to invalidate the warranty by downloading any developer's pre-release version.Also: It takes a LONG time for AT&T; to \"unlock\" the phone so if you're in a hurry. . .this isn't the phone for you.", "Date": "May 29, 2014"}, {"Title": "Muy perfecto!", "Author": "R. Clark", "ReviewID": "R109T1Z943LD3Z", "Overall": "5.0", "Content": "The only nit is it doesn't support Qi Wireless charging like the international version... thanks AT&T;!  This is the best phone I've ever owned (including 3 iPhones).", "Date": "May 19, 2014"}, {"Title": "Best Windows Phone", "Author": "J. Angeles", "ReviewID": "R3FYVXRIYATIBW", "Overall": "5.0", "Content": "have gotten used to the size and now find it difficult to use smaller screens.  Phone is fast and I love Windows Phone 8.1.", "Date": "May 10, 2014"}, {"Title": "Works well enough, but it's hobbled by AT&T;", "Author": "Dr. Curmudgeon \"Doctor of misanthropy\"", "ReviewID": "R2K1KOUAHNH2K4", "Overall": "4.0", "Content": "As for the phone itself: if you're looking for a 6\" phablet, this is great.  Great screen, super fast, and about the only thing that would make it better would be a removable battery, but that would be asking a bit.Branding-wise, this is a train wreck.  This is an AT&T; phone.  It's locked to AT&T;, which is a downside right there, but it is further hobbled by AT&T;'s specification to exclude the Qi wireless recharging normally found on other 1520 models, and the elimination of the T-Mobile compatible HSPA AWS bands.  For T-Mobile customers, this means that if you do get it unlocked, it'll only get 2G/Edge speeds in some T-Mobile areas.  In most large cities, though, you'll get LTE and \"4G\" (HSPA+) just fine.I ultimately replaced this with a model RM-938 \"1520.3\" which corrects the above deficiencies.PROs;Great ScreenSD card expandable - works fine with the new SanDisk 128GB cardLarge for aging eyes and unsure fat fingersGood battery life (owing to the fact that being larger, it can accommodate a larger battery)Windows Phone 8/Upgradable to Windows Phone 8.1CONs:Too much AT&T; CrapwareNon-replaceable batteryNo Qi Wireless rechargingNo \"Data Sense\" applicationMissing T-Mobile's AWS 1700/2100 HSPA bandsLocked to AT&T; (works fine on AT&T; MVNOs like Red Pocket)Windows Phone 8 (I mean, some people see it as a plus, others as a minus)", "Date": "May 9, 2014"}, {"Title": "Better than I expected", "Author": "Gary Saenz", "ReviewID": "RPBQJUVUUM7AR", "Overall": "5.0", "Content": "The 1520 has exceded my expectations in just about every way. I truely am impressed with the Windows Phone operating system. It is very easy to figure out on your own. Everybody talks about the lack of apps for Windows Phone but I really haven't seen any on other platforms that I am wishing for. How many different flashlight programs do you need to choose from? The phone is fast in it's execution of programs, the screen is fantastic, and guess what?!? It works great as a phone. Call quality is very good. Having the 32 gb version is also nice even though I can us an sd card to expand my storage. And I can't wait to try out the new 8.1 version of the operating system.Highly recommended.", "Date": "April 15, 2014"}, {"Title": "Pros ans Cons", "Author": "Amazon Customer", "ReviewID": "RO77DCU5N33LJ", "Overall": "4.0", "Content": "Nice device with some shortcomings. The device itself is powerful with a nice build. Not cheap feeling at all. The Snapdragon 800 combined with Windows Phone 8 makes for a speedy and smooth scrolling device. Any high end game will play with no issue at all. But that's also part of the problem. The limited app selection. The game selection is weak. And I am seeing way too many games and other apps that are not optimized for the gorgeous 1080p display. The start screen with all the live tiles looks really nice. Its just some of the apps need updating. Today was another example of the app selection shortcomings. With a block of time available I could use it to finish watching the season finale of “True Detective\" with the HBO Go app. The 1520 has a big gorgeous display that also works really well in the sunlight so it will be perfect. But I soon see that its not possible because although I have the HBO Go app on my iOS/Android devices, its not available on Windows Phone. So I took my Android device. Speaking of apps. I am not sure how many other apps are like this but two of the apps I use that is on Windows Phone is sub par. They lack features that the same app on iOS/Android do not. Spotify on Windows Phone is missing the Radio feature and the ability to see all the top playlists in various genres.Now for more of the positive things about the device. Besides the solid build you have good audio to along with the beautiful display. I like the EQ settings available when using headphones. The camera is a another plus. Powering all that is a battery that will last all day and then some.I more than likely will not use the Lumia 1520 as my primary device. Not because Nokia did something wrong. But because Windows Phone is lacking in various places. I do think Windows Phone will get better as time goes on.Sorry to end this here but I need to go. Hopefully I will get time to write more or make updates as things change. Overall though, if you want or like Windows Phone, the Lumia 1520 is one of the very best devices on it. It's without doubt the most powerful for Windows Phone.", "Date": "March 10, 2014"}, {"Title": "One week after receiving the device I am still unable to use it due to uselessly complicated AT&T; procedures.", "Author": "Georges K.", "ReviewID": "R1Y17MJ61X0HKY", "Overall": "1.0", "Content": "AT&T; needs to ensure a better \"customer care\" service.For instance, the device comes with an at&t; designed logo on the screen and one Nokia rep as well as an at&t; rep told me that such logo would go away as soon as I insert the SIM card...I have since received three SIM cards all of the wrong size for this device.", "Date": "February 28, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Nokia Lumia 1520, Black 32GB (AT&T;)", "ImgURL": "NULL", "ProductID": "B00HUD4IK8"}}