{"Reviews": [{"Title": "Best $99 4G LTE Phone For T-Moble & MetroPCS", "Author": "Alan  Houston", "ReviewID": "R15XDMK0QPVGG0", "Overall": "4.0", "Content": "T-Mobile sells the LG Optimus F6 for $200 at its T-Mobile stores and for just $99 at its neighborhood MetroPcs stores. The F6 is an okay value at $200 but is a \"best buy\" for $99. The T-Mobile version is locked to T-Mobile and the Metro version is locked to Metro. The Metro version is actually running on the T-Mobile 4G LTE network but with a limited ability to roam when you travel outside of the T-Mobile service area.The F6 has very fast 4G LTE data speeds in 30% of American cities and almost as fast 4G HSPA+ data speeds in 70% of American cities. In rural areas, 2G speeds are fast enough to stream Spotify and Pandora Radio but not fast enough for Netflix movies or YouTube videos.BEFORE you buy the F6, study the coverage map at the MetroPcs website and zoom in on your neighborhood to see if 4G LTE is available on your block.The large 4.5 inch screen is great for watching Netflix and the massive battery ensures that most people get 24 hours per battery charge.The F6 has a tiny 2gb of internal memory so you need to buy an SD memory card to store photos, videos and music. You must delete or disable most of the pre-installed apps and uninstall updates for apps you don't use to free enough memory to install your favorite apps.The tiny amount of internal memory makes it impossible to install larger games. The F6 is great for phone calls, texting and emails. It is NOT the right phone for demanding games.A smaller version of the F6 is the LG F3, which is identical to the F6 except for its smaller 4 inch screen and a lower price.", "Date": "February 18, 2014"}, {"Title": "Highly Recommened ( If You Are Willing to Root )", "Author": "John3:16", "ReviewID": "R1K4FC6L6D6R18", "Overall": "5.0", "Content": "As other reviewers have pointed out the phone is crippled with very little internal memory ( 1.3 GB available to user out of a total of 4 GB ).  Otherwise the F6 ( MS500 ) is a solid mid range smart phone with great build quality, good Qualcomm processor, HUGE battery, nice screen, LTE etc.  The camera is rather mediocre.  Don't consider using this phone unless you are prepared to root it, remove the bloatware and use an app like Link2SD / Apps2SD to store your apps on a microsd card. Rooted and correctly configured, this is one of the three best cellphones under $250 ( the Moto G and Nokia 520 / 521 are the other two )  I unlocked my F6 for $1.90.", "Date": "April 12, 2014"}, {"Title": "One Satisfied Customer!", "Author": "Brandie Pollard", "ReviewID": "R46XKT7V0GTST", "Overall": "4.0", "Content": "I really like this phone. Im transitioning from a galaxy cause i was having issues with it so it's much different. However,  this optimus has many many features that my Galaxy did not have or any phone I've had and i really enjoy those features...the memory in the phone is extremely low but i don't download many apps anyway so it works for me.  I found that having the clean-sweep helps with removing useless junk and that alone provides space. Overall the price of the phone and the pros about it outweighs the cons. \"In my opinion\"", "Date": "April 28, 2014"}, {"Title": "Super Phone", "Author": "jawdoc", "ReviewID": "R1ZVJ2ZATHVLUU", "Overall": "4.0", "Content": "Love the phone.  Extensive versatility, very attractive, human intuitive, light, thin.  It holds a charge with limited use for about 3+ days, which was very different from previous phone (HTC) with extended battery that would go 7-14 days on a charge.  However, ti will fully charge in an hour or two, even if very low battery, whereas other phone required full overnight charge.  Camera has much fewer pixels that similar phone and screen difficult to see in full AZ sun (as they all are).  Otherwise, you can not do better.  Highly recommend.", "Date": "May 11, 2014"}, {"Title": "Great", "Author": "Shaquitta Townsend", "ReviewID": "R3W0OECN3C7F5K", "Overall": "4.0", "Content": "It was easy to transfer everything to the phone, easy to navigate, & is overall great. Only issue was the minimal amount of internal storage. With an added sd card, that was resolved.", "Date": "May 5, 2014"}, {"Title": "Great beginner phone", "Author": "J. G \"Johnniee\"", "ReviewID": "RCI119BVMBJF", "Overall": "5.0", "Content": "An entry level phone but powerful.  I liked that I could do a lot of things with this phone that I could do on my Note 2.  I was able to download all of the apps I use.  I just use a few games and a bunch of social apps.  Also media play is smooth on this device. This is not a gamers smart phone, unless you root it because of the space limitation.  But with LTE, WiFi calling (on TMobile), replaceable battery and a SD card slot; it is hard to go wrong.  They limited the ROM size to 4 gig.  Only 1.2 of it is available.  If this were a 16 gig phone it would be hard to chose another.", "Date": "May 27, 2014"}, {"Title": "love it!", "Author": "Zyllah Rickman", "ReviewID": "RSQHG5WO8OBM7", "Overall": "5.0", "Content": "I love this phone. I haven't had any trouble with memory because I have an iPod though that I keep my music and have games on and I use Pandora on the phone itself. The camera is wonderful and the 4G on it is magnificent. I kept the screen protector that came with the phone on and it's still perfect. I highly recommend this phone. It's just amazing.", "Date": "May 22, 2014"}, {"Title": "Great Phone Son Loves it!!!", "Author": "C.L Momof3 \"Momof3\"", "ReviewID": "R1XG0XEILX0I92", "Overall": "5.0", "Content": "Nice Phone, $100 cheaper than the TMobile store. Son loves it. All we did was activate the Sim card which came with it and he was on his way. You can't insure it with TMobile though because it wasn't purchased through them but to replace an insured phone costs $130 anyways might as well just buy another phone. Hope this one lasts with my son, he is a phone killer. I bought an awesome case on here for like $4 it is very protective. Crosses fingers....", "Date": "May 16, 2014"}, {"Title": "This phone isnt working", "Author": "lois mymes", "ReviewID": "RM4DV7GPW3LDY", "Overall": "1.0", "Content": "the phone has been freezing alot and buttons arent working on it its not working at all we took it to the phone place and it still didnt work", "Date": "May 28, 2014"}, {"Title": "Underrated", "Author": "meinfla", "ReviewID": "R1XG4JSEOJQIX3", "Overall": "5.0", "Content": "I wanted a smaller phone in the $100 to $200 price range with 4G LTE.  Although a T-Mobile phone,  I run mine on Simple mobile and is fast on 4G LTE. APN setup data  for SM is available on line and simple to set up. Call quality is excellent. I don't use the camera so I can't comment.I don't load a lot of apps so storage isn't a problem. I did root mine, so I could delete some bloatware.", "Date": "May 14, 2014"}, {"Title": "cant swim", "Author": "James halpin", "ReviewID": "R6VH64NZF0XZ2", "Overall": "5.0", "Content": "it worked great till I I dropped it in the toilet then not so much, luckily had rubber gloves, yes", "Date": "April 27, 2014"}, {"Title": "great", "Author": "BigJab", "ReviewID": "ROLMYP86AA413", "Overall": "5.0", "Content": "Great product got it in 2 days was able to track it. Just the phone i was looking for coming from a dell venue pro.", "Date": "April 27, 2014"}, {"Title": "I saw this phone I thought will be great , do not buy it", "Author": "Maria c O'Phelan", "ReviewID": "R1TGNHHVZDNMSH", "Overall": "1.0", "Content": "Do not buy this phone, this phone has almost none internal memory and is a very terrible phone ,battery problem has is just unaccepable.", "Date": "April 24, 2014"}, {"Title": "It was metropcs phone", "Author": "Esther Ma", "ReviewID": "R1KGG1J3UO4WRD", "Overall": "3.0", "Content": "When I chose to buy this phone, I believed it was a T-Mobile phone. However, when the package arrived and I opened it I discovered it was the metropcs phone.  I had gone through 2 different T-Mobile stores to activate my phone because it was not T-Mobile phone.", "Date": "March 23, 2014"}, {"Title": "worst memory", "Author": "ileana", "ReviewID": "R28LV3W4LV5DDB", "Overall": "1.0", "Content": "This review in not based on Amazon or the seller just on the phone. The f6 is nice at at glance but after using the phone for a week i realized that i made a huge mistake. This phone does not allow you to download more than a few apps, and if you like music on your phone i suggest you definitely look some where else. I have an SD card and a app that allows me to store all of like my five apps to the SD card and it didn't help with the storage. LONG STORY SHORT DONT BUY THE F6", "Date": "March 17, 2014"}, {"Title": "J-U-N-K!!", "Author": "charles lozow", "ReviewID": "R1SREOXFNN4M68", "Overall": "1.0", "Content": "I bought the LG F6 from T-mobile two months ago and use it as my primary mobile (iphone5 is my other phone).  Here are the reasons I called this phone junk:1) Why do you have to push \"OK\" when you type in the numeric pin?  Should unlock.2) \"Not enough memory\" to complete functions.  Happens all the time.  I have less than 10 photos and no songs and the phone won't process basic commands due to memory shortage.3) Repetitive stupid questions or notifications - every time I walk into my home, the phone notifies me that I am connected to my wireless.  Who cares?4) Glass surface is crap and stays cloudy, much worse than apple.5) Sound quality on speaker is terrible.6) Photos are measurably worse than iPhone quality7) Interface with computer is worthless.Otherwise, this is a great phone.", "Date": "May 15, 2014"}], "ProductInfo": {"Price": "$399.00", "Features": "The LG Optimus F6 is an Android-powered smartphone with a 4.5 inch 950x540 touchscreen display and 5 megapixel camera with LED flash and Full HD Video Recording\nThis device comes equipped with 4GB internal memory, with a microSD slot for up to 32GB additional memory\nThe Optimus F6 allows for 4G LTE connectivity. Browse the internet, download apps, and connect with friends on this Android-powered device\nThis smartphone is also equipped with quadband GSM and WCDMA modes for international use\nThis product has been extensively tested, is certified to be 100% functional, and ready for activation", "Name": "LG Optimus F6 4GB LTE 4G Android Black - T-Mobile", "ImgURL": "http://ecx.images-amazon.com/images/I/41ypMptQgFL._SY300_.jpg", "ProductID": "B00HRJI0EU"}}