{"Reviews": [{"Title": "Incredible phone with outstanding battery life", "Author": "Sean D Rice", "ReviewID": "R17KTBLXET53HH", "Overall": "5.0", "Content": "I want to preface this review by saying I owned the original AT&T; HTC One (m7), and had I not dropped it and ruined it I would still be using it to this day. It was my favorite phone I've ever owned and it wasn't even close. I decided to wait for the release of the HTC One m8 and see how it stacked up against it's elder sibling, and for the most part it's an iterative update to the m7. That's not an insult, mind you, considering how well crafted the m7 was. The m8 is an outstanding device, and I would highly recommend it to anyone in the market for a new phone. Here's a breakdown of my thoughts on the phone:--DESIGN--Overall, this is probably the one of (if not THE) best built phones on the market. It just feels premium, and the brushed metal finish looks incredibly sleek. The metal finish is slightly slippery, but gives the phone a perfect fit in your hands. HTC decided to increase the phone size from 4.7 inches to a full 5 inches, and the difference is noticeable in both good and bad ways. The good obviously being the extra space for the gorgeous 1080p screen, the bad being just a tad too long, IMO. I thought 4.7 inches was just about a perfect fit, especially considering the power button is stationed at the top, making it difficult to reach the top when held with one hand. The edges are a little more rounded than the boxier edges of the m7, and the weight is about on par (technically slightly heavier but not noticeable). 9/10--SCREEN--Uses the same 1080p screen as its predecessor, which was at or near the top of its class. Still beautiful to look at, has amazing viewing angles, and is very bright. Is no better and no worse than other top smartphones, however, as QHD mobile phones are just around the corner. 8/10--SPEAKERS--Usually phone speakers are an afterthought, but HTC has put a lot of emphasis on its \"boomsound\" speaker technology, and it shows. Without a doubt the best speakers you'll find on a phone. They're loud, crisp, and clear, perfect for showing off a quick YouTube video to your friends. Will never replace a bluetooth speaker, but impressive nonetheless. 10/10--STORAGE--HTC has finally done what other smartphones have been doing for years: allow expandable microSD storage. This is major news for anyone who takes lots of pictures and videos, especially when utilizing the phone's Zoe feature. The phone comes standard with 32GB of storage, and Google allegedly offers a free 50GB of extra Google Drive space for 2 years (I say allegedly because for some reason my phone never gave me the option; I have reached out to Google and will update if/when they get back to me)*. Plenty of options to save all your photos, videos, apps, etc. 9/10*** UPDATE ***I spoke to an HTC customer service rep on their live chat and they quickly sent me a link which activated the extra 50GB on my Drive account.--BATTERY--I was very, EXTREMELY, happy to discover the battery life on this device has been outstanding thus far. Although I wouldn't consider myself a power user, I am consistently checking my phone for emails, texting friends, browsing the internet, and using various apps throughout the day. On my m7, I would find that by the time I went to bed I would be anywhere between 5% and 30% battery, always requiring me to charge overnight. So far I haven't gone to sleep with the phone anywhere below 50% on one day's use, with it averaging around 65% left. Just a remarkable difference for me, so much so that I no longer need to charge the battery every single night. What I find to be strange is the discrepancy between professional reviews in terms of battery life; for example, Engadget speaks very highly of the battery life while ZDNet lists the battery life under one of it's \"cons\" (it may be worthwhile to note that these reviews were based on the global version of the HTC One while mine is based on the AT&T; variant). All I know is the battery life on my device is extremely long lasting, a very pleasant surprise for me. 9/10--CAMERA--Probably the most criticized aspect of this phone is the camera and its use of 4 megapixels... I mean \"ultrapixels\". The benefit is the pixels are larger and allow for more light to be taken in, essentially making the camera more efficient in low light situations. The phone is very capable of taking nice photos, just don't expect to blow them up and hang them on your wall at home. The m8 has added a second camera to the phone that doesn't actually take a photo but captures depth information in the photo's metadata. This allows for some really cool photo editing tricks, such as selecting an area of the picture to stay in depth of focus while the rest is blurred. It also helps with the autofocus, which is blazing fast. Personally, I don't use my phone to take state of the art pictures so this camera works well enough for me, although I can understand this may not be ideal for others. 7/10--SOFTWARE/HARDWARE--HTC has applied its \"HTC Sense\" software on top of Android 4.4.2 coupled with a Snapdragon 801 processor, which combine for a silky smooth performance. The same signature features from the m7 are once again on this phone, such as Blinkfeed, Zoe's and Video Highlights. The best addition to this phone, however, is the inclusion of motion launch gestures. This feature allows you to make a series of gestures on the home screen that will unlock the phone without you having to reach up and hit the power button. As I previously mentioned, it's not exactly simple to hit the power button especially when using one hand, so it's an absolute relief that you can simply double tap the screen to wake the phone up. You can also swipe up from the bottom of the screen to unlock the phone altogether. So far it has worked flawlessly, as it only works if it detects it has been picked up thanks to the low power sensors inside the phone. Call quality and clarity has been perfectly fine, and the LTE speeds are fast as always. 9/10--OTHER--HTC has thrown in a 6 month cracked screen repair warranty, which is a nice touch for clumsy people like myself.--OVERALL THOUGHTS--If you're in the market for a new Android phone, I can't recommend this phone enough. It's truly a premium device in both looks and performance.", "Date": "April 11, 2014"}, {"Title": "Arguably the best ONE", "Author": "WiseShopper", "ReviewID": "R1C4RDP8YWJZUW", "Overall": "5.0", "Content": "You are probably interested in buying a new phone but having a hard time choosing the right phone because of all the choices that are out there. After researching the best phones that are available or soon to be available (HTC One M8 and the Samsung S5) for weeks, I pulled the trigger on the M8 and picked one up when it was released to Verizon. The LG G3 is too far away to be considered. I can't tell you how awesome this phone is without writing 10 pages but I will try to keep it short and straight to the point. I hope this review helps you decide if this is the phone for you and why this is the best overall phone available right now. Honestly do not get the S5, because you will regret it. If you want a plastic phone that is powerful and probably the best in the Spec department, just wait for the LG G3. It is coming near the summer of this year and it will have amazing performance and the best display. It will probably outperform all phones including M8, but I will be happy with my HTC M8 because there isn't or will be any better looking phone that also has competitive specs this year.Why and who should get this phone?People who want a phone that:-Is well crafted and probably the most beautiful phone ever made (yes better design and materials than iPhone)-is one of the fastest phone currently available-Can live without having the best camera-Simply works without buggy software crashing and want a smooth android experience-Is one of the best phones available this year-Is a solid phone that is 90% metal and feels elegant to hold in your hand-Has very good battery life (not the best) but most people will be satisfied-Makes other people wish they had a sexy phone like it, even iPhone users-Has many \"cool\" features like motion launch, dual camera, step counter, IR blaster to be used as a remote for TVs and more, double tap to wake up, few other tricks that make it fun and easy to useWho should buy something else?People who want a phone that:-Is an iPhone (Apple lovers)-Is a Windows Phone (Microsoft lovers)-Is slightly faster but mostly plastic-Has an amazing camera and loves taking highest quality pictures with a phone-Has the best battery life and does not have a car charger-Is ugly with amazing performance and unnecessary specs.Skip this paragraph if you don't care to know what type of person is giving you this information:It is very difficult to choose a phone today because of all the choices that are available. But I finally found the ONE without compromising much. I want to give a little background about myself before you think I am just an average smart phone user. Like many of you I always want the hottest gadgets and especially the best phone. I honestly love iPhone's design but I hate their software and that is why I have always used Android phones. A few of my previous phones include: HTC EVO 3D, Galaxy S3, Droid DNA, Galaxy S4. I also had the Nokia Lumia for a very short period of time and I was not impressed by the phone or the Windows software. The only reason I did not get the original One (M7) is because of the lack of microSD slot.HERE I WILL LIST THE POSITIVES AND NEGATIVES OF THE PHONE WITH RATING COMPARED TO OTHER PHONES THAT ARE AVAILABLE OR WILL BE SOON:Overall Rating 9.6/10Positives:Design 10/10 : Arguably the most well designed phone available right nowPerformance 10/10 : One of the, if not the fastest phone currentlyDisplay 9/10 : Easily the top 3 displayExtra Features 9/10 : Missing few extras (fingerprint, heart rate monitor) but it has other features that makes up for it.Storage 10/10: Finally a microSD slot that supports up to 128GB and it has a 32GB model.Software 9.5/10: HTC Sense UI is the closest OEM software that is as awsome as the stock Android UI, I personally like the HTC sense more, it is smooth and not buggy like the Samsung TouchWiz. It has useful apps such as: BlinkFeed, Sense TV, and FitBit can be downloaded serperately and the sensors provide very acurate step counts.Negatives:Battery 8.5/10 : The battery life is above average but could have been a little better. Overall it's better than 92% of other phones. Not bad at all. A new update called \"Extreme Power Saving\" is soon to be released and it will help save a lot of battery when you turn it on, almost 70% increase. It basically turns off useless services and will probably increase the rating to 9/10.Camera 8/10 : Kind of disappointed because so many other phones have better cameras (iPhone 5s, Galaxy S4, LG G2, etc). There was no upgrade to the camera from the previous model. But I give it a 8 because the camera is decent and it has other interesting features that make up for the slightly low resulution. The camera is not bad by any means, its just not excellent. It is the first phone with dual camera and it can do some breathtaking and useful trick to the pictures using the depth information captured by the second camera. Overall I am happy with the camera.As you can see the phone is just too good to have extreme negatives, the negatives are just slightly below what is expected of a smartphone in my opinionBelow are more specific details of the phone, read if you pleaseDesign 10/10: \"This is the best looking phone in the world right now\" and that's a fairly accurate statement. Some might disagree but not many. The pictures does not do enough justice, it is truly gorgeous to look at and to hold. It feels like holding a metal artwork. It feels very solid and premium in my hands. I am only 5'3 and I have fairly small hands and I honestly think it is the perfect size, maybe 5% longer than I hoped for. Overall it's hard to find a well-crafted and more beautiful phone than the HTC M8, yes it is more elegant than the iPhone. Don't worry it is not all about design, it packs some serious power.Performance 10/10 : Let's just say it is the fastest phone available right now according to the benchmark tests I have done. The phone is amazingly smooth, everything just opens up instantly. I have not experienced one bit of lag or any errors. The Sense UI is closest as you can get to the stock Android UI experience with any OEM UI. The Samsung Touchwiz and LG UI is a mess compared to the Sense. The Qualcomm 801 processor is a fast and efficient processor. I can almost guarantee you that performance will not disappoint you.Display 9/10: The phone gorgeous inside out. The picture quality is extremely sharp and vibrant. It is easily top 3 in the graphic department. It is very bright and crystal clear. But there are a few phones currently out that outperform the display. My brother's LG G2 has a slightly better display. I hoped for it to be number one in this department but overall its nothing to complain about.Battery 8.5/10: With all the advances in technology I am not sure why there has been such little innovation in the battery field. It is not just cell phone batteries but all batteries in general. Some manufacture like Motorola has done decent job with providing large batteries in recent years. HTC has always disappointed me in this department and this phone is no exception. But I have to admit it is above average and I am fairly satisfied so far. I am able to go through an entire day without a problem. My day starts at 6 and ends at 7. My normal usage include: Frequent texting, 1-2 hours of talking, 3-4 hours of surfing and email, 30-45 minutes of games and the rest standby. I am able to get through the entire day but honestly most of us have chargers at work and in our cars. So overall I am not too obsessed over battery but the M8 does provide fairly decent battery life. Most of the tests reported a full day of normal to somewhat heavy use and I can confirm that. It was supposed to come with a setting called \"Extreme Power Saver\" but apparently it will be provided soon with an update. It supposed to limit the phone to only email, phone, text and few other basic things to save a lot of battery. Supposably up to 70% more battery. I can't comment on it until I receive the update.Extras 9/10: What's a flagship phone without some tricks? The M8 has some cool tricks up its sleeve.Camera Affects: I will complain about the camera quality later but let me state the positives in this section. Basically the camera has some tricks that help me deal with the moderate quality of the images. My brother has a$1200 DSLR camera that he uses to take cool pictures and I can do the same now with my $600 new phone. My favorite feature is the U-Focus which blurs the background and focuses on the object, like your face. Obviously the DSLR camera does an exceptional job but most people can't tell the difference with the first glance. The second camera on the device captures depth information and you can add cool affects to the pictures after you take it using that information. There few other ones like Sketch and Cartoon and Zoom effect but I find the U-Focus to be the most interesting one. But most people will use all of them because they work very well and are very easy to customize a picture.Motion/Sensors Stuff: My favorite trick is double tapping the screen to wake it up and turn it off. It's amazing how this simple feature can be so useful. I hated pressing the power button to turn on the display and now all I have to do is tap the screen. I can also swipe from the bottom to top in order to unlock the device and go to the last app I had open. You don't have to go to the lock screen, you can directly go to the home screen if you don't have a passcode setup. Swiping from right to left take you to the awesome BlinkFeed screen. Swiping from top to bottom brings up google now (voice command). Swipping from right to left take you to the home screen. The final motion trick is answering the phone by simply lifting the phone to your ear. Thre is also a feature where you hold the phone in landscape orientation and press the volume up to activate the camera app.FitBit App: The phone has a built in barometer and bunch of other sensors that can track your steps very accurately. Most phones have some of the sensors but only the iPhone and Nexus 5 has all the sensors like the M8. As a result the M8 and the few other phones can track your steps very accurately without buying a pedometer like the FitBit Flex or Force. The FitBit app was supposed to come preinstalled but you can easily download it from the play store for free. I am currently using it to track my steps and its about 96% accurate.Remote for TV and more: The M8 has an IR Blaster built in, you can control all your electronics with your phone. HTC has this app called \"Sense TV\", it's very interesting and useful. You basically select your cable provider and select the channels you have and the app gives you show times and what's currently playing based on your favorite stations and shows. Basically it's a smart guide on your phone and you simply click on the show and your cable box will bring up the show. The setup is easy, you simply select your cable box model, TV model, home theater model and you can control all of them using your phone. But I highly recommend getting this app called \"IR Smart Remote\", it's about $6 and it is the best remote app for your phone. You can basically throw away all your remotes and use your phone to control everything; it does a very similar job as the Harmony remotes. Do some research on it, you may like this app.Camera 8/10: Compared to all the other phones available, I am very disappointed at with the picture and video quality of the main camera. It is the same exact camera as the previous model except it has an extra camera. The picture quality is not bad but it is not excellent like many other phones. The main problem is the lack of resolution and bright light pictures. If there is too much light, for example capturing the sky in a sunny day might be hard; the picture doesn't capture blue sky properly. Overall it's a decent camera but I was expecting more. It is an average and maybe slightly below average camera.Final Verdict: If you want a beautiful, fast, elegant and a phone that simply works, then just get this phone as soon as you can. I know many people are comparing the Galaxy S5 and honestly the S5 has several advantages but the HTC One M8 is the clear winner to me. If you don't mind the plastic and somewhat of a bland look, then get the S5. If you want the most elegant phone that is available, then get the M8.", "Date": "April 16, 2014"}, {"Title": "A Comparison to the HTC M7", "Author": "Nth Doctor", "ReviewID": "R2W42XVY00KA3R", "Overall": "5.0", "Content": "I told myself repeatedly that I didn't need to get this phone, but after seeing it in person I had to upgrade to it via AT&T; Next. I brought it home from the AT&T; Store a few days ago and took a good look at it compared to my M7. There's several key differences between the two.- The M8 is larger than the M7. Don't let anyone tell you otherwise. It really is larger. It's almost unwieldy huge. My hands are reasonably large, so I have no problem with the size. However, when I did go back to my M7 for brief periods of time, I felt the screen size was very nice.- The power button is still on top. That's where I prefer it, honestly. I never liked how the Galaxy phones put it on the left side so only right-handed people will be able to hit it easily. However, the power button on the M8 is on top to the right side instead of the left. It took me some time to get used to this because the power button is on top to the left side on the M7.- Looking for the headphone jack? It used to be on top on the M7, but they moved it to the bottom next to the micro USB slot on the M8. I'm rather indifferent to this change, honestly. As long as the headphone jack still works then I'm fine with it.- The M8 has on-screen buttons this time instead of the hardware capacitive buttons from the M7. I really like this change because if there was anything I really disliked about the M7, it was how the only two buttons were back and home. After using other devices like the Nexus 7, it made more sense to have the three buttons at the bottom in some form. The M8 has them on screen like many modern Android phones.- There's a micro SD slot. Hallelujah! Granted the built-in 32GB of storage on the M8 is probably enough for most people, but if you're like me and have a massive music collection, you'll want some room to grow. You could pick up a 64GB card on Amazon for an efficient price and effectively increase your storage.- The M8 requires the newer nano SIM card that you see in most iPhones. The M7 still utilizes the widely used micro SIM size. If you're on AT&T; and you upgrade from a phone that requires a micro SIM to one that requires a nano SIM, they'll probably help you take care of that. I was given a new SIM entirely for my M8.- The dual lens camera is very nice compared to the standard camera on the M7. I played around with the M8's camera and discovered how interesting and fun the panoramic mode is. It lets you construct pictures through the overlay's instructions to move to a square and hold the camera in that position for the phone to properly capture it. You can look at these photos again in the gallery and tilt your phone around to explore them. I thought this was a really neat feature.- The M8's screen is a little more advanced. In addition to having the on-screen buttons and whatnot, it also supports the popular feature from the LG G2 where you can double tap the screen with a finger to wake it. In addition, the software supports swiping to the sides when asleep to trigger actions, such as opening up BlinkFeed.- Speaking of BlinkFeed, the new iteration of it is nicer than it was initially on the M7. However, if you didn't like BlinkFeed the first time or don't really use any social networks, you probably still won't care for it. My biggest gripe with BlinkFeed, the ability to use any RSS feeds you want, is still not solved. Until then, I have Press and Feedly, and like the new update on the M7, you can disable BlinkFeed if you're not using it.- No more Beats branding. But don't worry. The M8's BoomSound speakers actually sound better, and the sound quality from the headphone jack is jaw-dropping. I listened to a few songs on Spotify through the headphone jack and felt that the sound quality was greatly improved.- The M8 feels better made as a whole. The M7, although it was carved from aluminum and still looked amazing, had quite a bit of plastic on the edges. The M8 is just curved metal all the way around on the sides.- There's a few other obvious differences. The M8 has Snapdragon 801 and Sense 6, while the M7 has Snapdragon 600 and Sense 5.5.Now, I can say that this phone is extremely well-built. I feel more confident about it's structure than I did about the M7. The M7 has these plastic edges along the sides. The M8 is all around metal with such a nice curvature. It feels so nice, so confident in the hand.Since I got the AT&T; version, there's always the problem with included carrier bloatware. The M8 is no exception. I got a whole bunch of apps I was never going to touch from AT&T; until I rooted and installed InsertCoin. The phone's Sense 6 (or Sixth Sense as they call it, heh) is quite nice. The UI design trades away the gradients of Sense 5.5 and below in favor of flat colors. It seems like the industry is trending in this direction anyway, what with the iOS 7 overhaul and Windows Phone 8's flatness. Compared to Sense 5.X, almost everything is in the same place as before. If you've used the M7 and want to get the M8, you'll feel (mostly) right at home.In the drawer I no longer miss having the Sense 4 style. I've really adjusted to the custom sorting option. Since you can create folders, you can organize your apps any way you like. I choose to organize them by specific actions for the most part. I also changed the grid size to 4x5. Regardless, I really like this feature. If you want to customize and organize your app drawer, you certainly have the option. If not, you can scroll to the top and select Alphabetical to get everything to display. Still, when it comes to Sense 4, if I had to get anything back from it, it would definitely be the Agenda view widget. I miss that widget so much.For music lovers, the M8 is extremely nice. The music player has even improved since the Sense 5.X iteration. The player better supports music tagging than before, with almost all of my albums having the embedded artwork displayed. I tag all of my music meticulously. If you want to play it out loud, the BoomSound speakers are back and still as loud and crisp as ever. Also, FLAC is still supported, so you're all set for extremely high quality sound.The LCD screen is extremely nice with its bright colors. Granted it doesn't look like any of the Galaxy phones with their AMOLED screens, but given the choice, I'll take HTC's screens since they aren't susceptible to burn-in like on any AMOLED phones. I still see burn-in all the time with other Samsung devices whenever I get to hold a friend's phone or look at a display model at a store somewhere. LCD is still the way to go for me, and this screen is surprisingly very strong. Like the M7, the M8 has a glass screen that is nigh unscratchable in day-to-day use. If you look around on YouTube, there's a video of somebody attempting to scratch the M7's screen by scraping a screwdriver over it and failing to leave any damage. HTC knows how to make screens on these things.Like I mentioned above, the phone has expandable storage. I personally purchased a 64GB card to use in it, but if you really wanted and had the extra money to spend, you could easily order a 128GB micro SD card and stick it inside. If I had the option to do that, I could hold up my M8 next to my MacBook Air and say tell everybody how my M8 has more storage.The battery is still not removable, but I still don't care because the odds of getting a bad battery are rather low. If I ever need to travel around and have battery life, I have a rechargeable battery pack anyway. In addition, I can't help but notice that rooted phones on custom ROMs typically have much better battery life. When I had my M7 unrooted and on stock software, I could only go about a day from morning to night before I'd have to plug it in for sure. With my M7 rooted on a custom ROM, I could go over 48 hours on a single charge. I haven't had the M8 for too long, but I think the idea still holds up here.The phone runs extremely smooth as a whole, and I keep feeling that all the things the M7 did that felt insane or amazing are present on the M8, so it's kind of hard to be so blown away a second time. I still really love this phone, however.Now, there's the elephant in the room that I haven't really acknowledged yet: This or the Galaxy S5? I honestly haven't really kept up with the S5 because I'm not really interested in it, but there are clear differences that people will want in both phones.You should get the M8 if:- You are an HTC loyalist. This phone won't disappoint you.- You really like the Sense interface and think TouchWiz has always been bloated and slow.- You want a premium-feeling phone with a metal unibody design.- Features like HTC TV and the built-in infrared blaster are a must for you.- You don't really care about features like fingerprint reading or heartbeat monitor.- You need an extremely good low-light camera and are confident that megapixels aren't everything.- You hate burn-in on AMOLED screens and don't want to put up with or even risk having your screen burn in. The M8's screen is not susceptible to burn-in at all since it does not use AMOLED technology.You should get the S5 if:- You are a Samsung loyalist. If you love Samsung, already own a Galaxy Gear, are already immersed in the Samsung ecosystem of apps, or actually use all the bells and whistles the Samsung phones always include, then the S5 is probably not going to disappoint you.- You are a camera enthusiast. The M8 has a few smaller features missing from the S5, but the S5 really reaches out to enthusiasts by letting users record 4K video and having a higher number of megapixels.- You are extremely clumsy or take poor care of your phone. The plastic body on the S5 is probably less susceptible to serious damage from drops, and the S5 is water and dust resistant. Granted, if this is a serious problem for you, I heard the Xperia Z2 is very nice.- You need your phone to weigh slightly less.- You need to have that marginally better battery life.- You need that 0.1 inches of additional screen real estate.Overall, I am extremely happy with my M8. It's not the big game changer the M7 was last year, but it's still a great upgrade.", "Date": "April 11, 2014"}, {"Title": "Great phone upgrade", "Author": "C. Johnson", "ReviewID": "R1Q4PM5GWXZ3QA", "Overall": "4.0", "Content": "I'm the type of person that doens't rush out and buy the latest and greatest thing every year especially when it comes to something like a phone.  Even as phones became more and more like a personal computer that can also make and receive calls I have always resisted the temptation to shell over hundreds of dollars every year just to buy somethign that will be obselete in a few months.  Sticking to this, I had been using the Samsung Galaxy S that I bought in 2010.  This phone served me well, but over time the battery life started to suck; I couldn't even get 3 hours of standby without it going dead.  Also the apps that used to work flawlessly on the phone stopped working and the phone would lag constantly.  Emails and texts would come in when it was convienient for them.  Still, I stuck with the phone because I didn't want to spend so much money on a new phone nor have to sign a contract.  However one night out of frustration, I threw the phone down on the ground after it locked up for the 100th time.  I picked up the phone and noticed the screen was shattered, but still functioned.  So instead of buying a new phone I kept using the phone even with the broken screen.Finally I decided to go to my lcoal AT&T; store to check out new phones as I figured that even without a shattered screen, it was about time for an upgrade.  Naturally I gravitated towards the Galaxy S 5, but honestly over the years I started becoming unhappy with the Galaxy line due to my experience with poor battery life, plasticy look, and the fact that Samsung never released any update for the Galaxy S.  My second choice was the HTC One m8.  I had some interest in this phone before, but the lack of expandable memory and the non removable battery turned me off.However to my surprise the HTC One m8 finally added expandable memory which was possibly my biggest turn off to this line in the past.  The phone still has a non removable battery, but after using my Sony Xperia tablet for 4 months, I realized this is not really a big deal at all.After thinking about all the issues and frustrations I had with my Galaxy S, and also being kind of irritated wtih the childish back and forth bickering between Apple and Samsung, I decided to go with the HTC one m8.The HTC One m8 may not have all the bells and whistles of the Galaxy S5, like heartbeat monitor which I really don't see the purpose, but overall the phone just looks and feels so much better.  The brushed aluminum is a great upgrade to the plastic look of the Galaxy.  The curved back also is a nice touch and in addition it makes the phone easier to hold.  Finally while some may complain the the HTC One M8 is heavier than the Galaxy S5, I personally see this as an advantage.  Personally I think people make too much of a deal out of having light phones when in reality we are talking about a few ounces difference.  Honestly I perfer a \"heavier\" phone if it means better quality material.The OS on the HTC One m8 seems to be a lot more responsive than the OS on the Galaxy S5.  When comparing them in the store running the same app from the playstore (Math Workout).  I noticed the S5 would lag momentarily when inputting my answers, while the m8 experienced no lag at all.They say the camera on the S5 is better than the m8, and while this may be true, it doens't concern me.  All I care about when taking pictures with my phone is that the picture is clear and there is a flash for low lighting conditions (there was no flash on my Galaxy S).  Personally I can't tell any difference between the pictures on the two phones, but I'm not a professional photographer either.  I'm happy with the picture quality on the HTC One m8 and until I decide to pursue a career in professional photography I won't make a big deal out of subtle differences between the picture quality between the S5 and the m8.Call quality is great and I don't have any issue with hearing people on the other and or vice versa.  One minor annoyance is that it seems if you simply press a contacts name, the phone automatically dials their number; maybe I'm doing something wrong, but its quite awkard than calling someone back after you just got off the phone with them and having to explain to them what happened.The sound is also great and comes with a great set of earbuds, though I really don't use them as I perfer my V-Moda headphones instead.There are a few things I don't like on the phone however.  One being how the \"Swype\" feature (called Trace Key on HTC) works on the m8 versus the way it worked on my Galaxy and my Xperia tablet.  Overall I love the Swype feature; for me it's a lot faster than pecking at the keys on the screen to type a message or email.  It saves me so much time in typing and allows me to type messages using only one hand in many cases.  However on the m8, there is no way to turn off suggestions when entering a word.  If I type a word that the dictionary doesn't know or is not a recognized word at all, the OS will automatically assume what you want to type and enter it for you automatically, making you have to correct it manually.  Also more frustrating is that sometimes the word you actually want to type appears in the suggestion list but its not the first choice, and unless you select it manually, the software will select the first choice in the list which is not always the word you want.  You can turn off the suggestion list, but turning off the suggestion list also means you have to turn off Trace Keys.  I find this stupid as the Xperia and Galaxy OS don't have this type of limitation.Another small gripe is the port cover opener that allows you insert and remove the SIM card and SD cards is so small and compact that you can easily lose it.  Its a handy little tool, but there is no way to attach it to anything so you can keep up with it.  I decided to put it in my wallet but after a week, it fell out after I left my wallet in my pants pocket and it fell out somewhere.  I found the tool in the laundry room a few days later when I was looking for something else.  I wish it were a little bigger and had some sort of ring on it so I could attach it to my keyring or something.  I finally decided to tape it to the inside of my phone case so I will always know where it is.  It works out perfectly because whenever I need to remove the SD card, I also have to remove the case and the tool will be right where I need it.Other than that I am very happy with my purchase, this phone serves all my needs and keeps an adequate charge that allows me to use it normally without always having to be by a power outlet to keep it charged.  My emails comes in without any issue, and between this phone and my tablet, I don't even use my laptop anymore which is also good because it is still running Windows XP.", "Date": "May 15, 2014"}, {"Title": "The (New)ONE to Rule Them All!", "Author": "Johnny Saigon®", "ReviewID": "R38P5TGPNOKA5I", "Overall": "5.0", "Content": "I love HTC phones and I have both last year's One(m7) and this year's(m8). I am NOT affiliated with HTC or compensated by them in any way. I just feel that competition and the underdog companies are crucial and essential for a healthy free market economy, and ultimately, us consumers. I have had the iPhones 4 through 5s, Samsung Galaxy S3/S4 and Note 2/3, and several Nokia(n95-97, n84/85 and several lesser phones) and Sony/Sony-Ericsson(Xperia) phones over the years, and I have loved most of them. For a healthy and positive technological evolution, we NEED the small or struggling companies like HTC to succeed. If Apple and Samsung become duopolies, that will be a dark future indeed. Pick up an HTC One(M7 or M8) and any Samsung Galaxy phones and compare the quality and craftsmanship, and tell me why it's Samsung and not HTC that have more successful phones. It's all about the MONEY and marketing, the bigger guy trying to squeeze out the smaller guy, and that's NOT how a healthy free market economy should be.Now that that is out of the way, let us get down to the nitty gritty. This is my direct comparisons to the iPhone 5s, Samsung Galaxy S4/S5 and Note 3, but mainly to the last HTC One(M7)(and yes, I am mainly updating keypoints from the m7 review):The Good:1) THE SCREEN: If there was such a better screen on a phone, I have not yet seen it. The iPhone 5s is lauded for its excellent screen, but at its current resolution, it trails behind the One's screen by far. Everything just POPS out at you. Even in direct sunlight, everything is CLEAR and BRIGHT. I really loved the 2013 HTC One's(M7) screen, but once again HTC has outdone itself and given us a true masterpiece in 5.0\" 1080p(440ppi) form. The main difference between the M8 and the M7 is the color reproduction on the M8 is better and more true-to-life. This is THE BEST screen on the planet right now - WOW!!!2) THE DESIGN/HARDWARE: Once again, the new One continues the HTC tradition of making really high-quality phones with high-class material and craftsmanship. This version has more of a matted-brushed aluminum finish than the glossier M7. The One feels THICK and TOUGH. I don't have to worry about carrying this around case-less(except from drops, which is a whole other issue). I will not be worried about this phone nicking and scraping like the iPhone 5/5s. Personally, it may not have the flair of some of the Sony and Nokia phone of the past, but in totality the One has the best combination of design and craftsmanship. It oozes style and sophistication, unlike the plastic-y feel of the Samsung Galaxy S4/S5. The One is one real looker!3) THE DUAL FRONT-FACING SPEAKERS: We have all been desensitized to the modern smartphones nowadays with their crappy, tinny, mono speaker. I remember the days of the Nokia n95 and n84 with their stereo speakers - whatever happened to phones after that? Whoever agreed to a mono/solo speaker with all the smartphones thereafter?? FINALLY, someone has the senses to come back to reality - thank you, HTC!. Trust me, your ears will thank you and you will realize all phones should have been made like this. Especially when you use ringtones/alerts that were specifically created for this phone, the sound is loud, immersive, expansive, and POPs into your ears. It's simply a re-revolution. Compared to the M7, the M8 loses the Beats audio engineering, but it actually sounds louder than the M7, which although has really high-quality speakers as well, was known for being too soft in certain scenarios. The new moniker is just BoomSound.4) THE CAMERA: I don't use my phone camera to make prints from photos, I have my dedicated cameras for that. So to me, the paramount function of phone cameras is the convenience/accessibility - it has to be able to capture what I want quickly and clearly, with decent enough quality to post online. Therefore, the 4MP size in the One's camera does not bother me at all. Who cares if the camera isn't THE BEST phone camera ever? Because it is not, but it is a GREAT low-light shooter, and to me that's more important than pixel count. The sensors in the camera are bigger than other phone cameras, therefore, it can capture a lot more light, which in laymen's terms it can give you better photos in more situations than other phone cameras can. Also, the touch spot focus is almost instantaneous - this camera is quick, quick, quick! What's really cool about the new camera is the duo camera functionality - each photo you snap is recorded from both cameras, so afterwards, you can re-focus the image, ala Lytro camera style. This is really cool and quite revolutionary for a phone camera. So in the real world, this means no more out-of-focus photos! You can now always re-focus your photos after the fact, so you will not have to regret missing out on a great memory because your photo was out of focus - awesome!5) For a phone with a 5\" screen, it's quite svelte, at least at the girth. It's easier to hold in the hand than the Samsung Galaxy S4/S5, and for sure a heckuva lot better than the Note 3. It fits in your hands nicely and securely, with just the right combination of size, weight, and balance. However, it is very TALL, even taller than the M7, so trying to reach the power button with one hand while your holding it in a normal position is almost impossible. HOWEVER...6) The One borrows the features of the LG G2 where you can double tap on the screen while it's off, to turn it on! While the screen is off, you can swipe left to turn it on to see Blinkfeed, which is HTC's version of Flipboard/news reader, and swipe right to turn it on to the home screen. The one thing HTC forgot though, is you can't double-tap the screen while it's on, to turn it off, which the LG G2 CAN do.7) The user interface(UI) and software design is now even more polished,minimal, and simplistic. Sense 6.0 is the on-going improvement from the previous versions. It's really quick and light, not bloated like Samsung's TouchWiz UI. It improves on the older, but still good, Sense 5.0 and 5.5. You can move from one screen to the next lightning quick, almost as good as the iPhone UI.8) And FINALLY, HTC has included a microSD slot so you can add your own memory card for more storage(the HTC DNA/Butterfly and M7 didn't have any). You can add up to 128gb more!The Bad and Ugly:1) The battery is only 2600mAh - I wish it was bigger because I'm one of those paranoid people who always needs my phone at fully charged, just in case, of you know, something. But so far it's been holding steady at about 40% at the end of the day(from 9am-6pm). I check emails, read the news, text, Facebook, etc. throughout the day - I would say that I'm a moderate to heavy user. At least it is a lot better than the M7's 2300mAh battery, which drains super quick, yet charges SUPER SLOW.2) Comparing features with the Samsung S4/S5, the One is not as good. It's not a deal breaker, but for those who like fancy functions, the One will not make you as happy. The HTC One is very simple in its feature set. The one feature I miss most from the new Samsung phones is Smart Stay, where the phone can sense that you're looking at the screen, and won't dim/turn off the screen - that was a HUGE convenience for when you're watching a movie or reading the news. The coolest feature so far for the One has been the tap/swipe to turn the screen on.3) Like I wrote earlier, the size is both good and bad, and it's also heavier than most similar phones. It's taller than the S4/S5, and with the power button up on top, it's almost impossible to do one-hand phone operations without shifting your hand up and down to accommodate both the screen gestures and buttons. The buttons(power and volume) don't protrude enough to make it easy to press them.All in all, I feel the combination of the One's screen, design/craftsmanship, and audio experience trumps over the Samsung S4/S5's fancy functions. The S5's screen is almost just as good - AMOLED screens are known for their deep blacks and saturation, while the One's is much better in direct light, and with a more true color reproduction. The S5 has a higher MP camera, therefore able to take better photos in broad daylight, while the One's camera is more versatile and better in low light conditions. The One has a much better audio experience, while the S5 gives you better convenience with its features - userability goes to the S5 for sure.But in the end, considering the totality of things, I feel the new HTC One provides me the best TOTAL experience, and is the king of the smartphones(at least for now!).", "Date": "April 11, 2014"}, {"Title": "Really good phone", "Author": "Sowjanya Garigipati", "ReviewID": "R1VQTJ4URVRVIX", "Overall": "4.0", "Content": "Note: This is one of my first reviews for any site.I had an upgrade coming up. I was using a Samsung Galaxy S3 running Cyanogenmod 10.2. The S3 was the first phone I owned for close to 2 years. Prior to that, I was using an iPhone 4. Before using the iPhone, I was using a s***ty andoird so going from that to an S3 was a huge improvement. I did however, root the S3 after about 6 months and then, in another month, converted to using Cyanogenmod. I was a huge fan of Cyanogenmod. The phone ran smoother, faster and I had a huge gain in battery life and all was good. 3 months back, the phone's hardware started acting up and I had an upgrade coming so about 3 weeks back, before the M8 was released I bought the Galaxy Note 3.The Galaxy Note 3 was a huge improvement, the screen size was fantastic, the battery life - even better. What I hated about the phone though, and what caused me to change sides from Samsung to HTC was that I knew that using the Note 3, I would have to run cyanogenmod at some point. And that upset me. Touchwiz isn't as smooth and although the Note had great specs, it would still sometimes shutter.The M8.Things I like:-> The look of the phone. Coming from Samsung, this felt like an iPhone (in terms of beautiful construction) running android. I'm not sure how the phone will last in terms of durability but i'm planning to get the dot view case as soon as it becomes available. I has a plastic bumper on my S3 from Elago, and I felt that was sufficient to withstand a few drops - I dropped my phone a dozen times. So, for the M8, I feel the dot view should be enough. If I want to leave my phone without a case, I can do so for 6 months, since HTC has the cracked screen replacement.-> Sense 6.0 - I still don't like that I have ATT bloatware running on the phone. However, the phone has impressed in terms of performance. Sense may not have the number of features that touchwiz has, but whatever it has, works very well. The lockscreen for instance, I have face recognition security and I'm quite impressed by the accuracy. The front camera, with 5 MP, does help. I always connect to my car when I'm travelling, and the Bluetooth quality impresses.The best thing about the phone: I can enjoy the phone the way it is, without having to change it's ROM.-> The speakers: Boomsound is amazing, best sound I have heard from a phone.-> The screen: Samsung screens aren't good under direct sunlight. I'm not a screen guru by any means, but I can use the M8 under direct sunlight, without having to squint.-> Storage: Having 32GB on the phone is a blessing and mix that with the ability of being able to add a Micro SD card for expansion, just genius by HTC.Things I don't like:-> The screen size: The M8 does not have a physical button and the capacitive buttons impede on screen real-estate. That reduces the usable area on the screen.-> The phone bezel around the sides seems to scratch easily. I've only had the phone for 10 days and it is showing wear. The bezel is chrome finished and it's really small so not that much of an issue.-> The phone feels a little slippery to hold. Not too bad, but this was bound to happen because of the finish on the back. The phone isn't wide, so you can form a good grip around it.Will update this review on using the phone more.", "Date": "April 14, 2014"}, {"Title": "The Best got Better - Innovated to Inspire Envy!", "Author": "PatriotGyrl", "ReviewID": "RW2BZCOVFB7OL", "Overall": "5.0", "Content": "Coming from the HTC One (M7) I had my doubts as to whether the HTC One M8 would be improved enough to make me want to upgrade so quickly. I was perfectly content with the quality and features of the M7. I was very pleasantly surprised to see that HTC has made a phone that actually made me want to put my HTC One (M7) in a drawer.Now I own the HTC One M8, and it is hard to imagine what could make me want to put it down!The battery is drastically improved over last year's model. I got a strong 11 hours of use yesterday, and it still had 30% when I put in on charge before bed. Today, after 4 hours I have used a meager 10%.The premium feel of the metal casing is something that can not be duplicated. This phone is solid. This year, HTC has seamlessly wrapped the metal all the way around to the glass. This gives a continuity and smoothness that makes the phone easy to hold. The design of the phone, with the softer curves adds an illusion that the phone is slimmer than last year, but it is exactly the same thickness.I love the improvements to Blinkfeed and Sense 6.0 overall. HTC has added personalization options that I have been envious of in other manufacturers phones. HTC has brought back Themes, and I love this also. They have enhanced every part of the UI, and have made it a much faster and smoother experience. On the AT&T; version, they even took AT&T;'s visual voicemail app, and integrated it into Sense, so that there is continuity even there! And, the app works better now than it did without the HTC improvements to it!The screen on this phone is beautiful. The crispness and clarity of photos, graphics, and fonts is phenomenal. The increased dpi in the M8 is definitely noticeable. Blacks are Black - deep and true.I am still getting used to the gestures, but they are quickly becoming very natural.Now- for the camera. I have spotted reviews stating that HTC should have increased the pixels etc. Totally ignoring the fact that they have added an entire second camera! Many feel that 4up are not enough. Initially, I thought more ultrapixels would make the camera perfect also. But HTC added the second camera, and suddenly those 4up seem like 10. The detail in closeups and distant photos after a zoom crop is great. Loss of detail has been greatly improved, and is definitely more than sufficient for my everyday picture taking. The improved advanced software that supports the camera is also excellent. I have played with the 3D effect and was blown away. I took a picture from about 20 feet away, and then snapped it again zoomed in all the way, and the result was a very crisp, detailed, unsaturated photo. Before making a determination as to whether the camera is good enough for your purposes, make sure to try it for yourself. The technology in the camera of this phone is unmatched in the industry today, and is not fairly compared to what people are used to being subjected to. Yes 21mp sounds better, but until you experience the quality first hand, there is no way to properly explain the superior quality that the camera on the HTC One M8 delivers.Overall, this is the best phone I have ever owned. It is solid in the hand, fast in use, the battery is more than ample, the camera is awesome, the software is smooth. If you are undecided, you will be very disappointed if you do not give this phone a hands on try before making a decision to purchase your next phone.", "Date": "June 7, 2014"}, {"Title": "Great Smartphone", "Author": "SAUL PALMA", "ReviewID": "RFKL1Q3S4AZS0", "Overall": "5.0", "Content": "excellent performance of the batteryvery good pictureshigh functionalitythe sound is amazingzoe is tremendous application for my photos", "Date": "May 24, 2014"}, {"Title": "Wonderful phone. A GREAT upgrade from the Galaxy S3", "Author": "Matthew Eberle", "ReviewID": "R2ZHF2L585F18T", "Overall": "5.0", "Content": "As others have said, the phone just feels and looks amazing. It is a very high quality device and it is such a nice change from the plastic phones that have ruled the android world for so long.While the camera is kind of \"eh\", it does amazing in low light settings. For pictures to look at on a phone or computer, the camera is more than sufficient, you just can digitally zoom in quite as far or make quite as big or a print.", "Date": "May 7, 2014"}, {"Title": "Camera is great -", "Author": "J", "ReviewID": "R1GSS4713EWI9V", "Overall": "4.0", "Content": "I had an iPhone 4 for two years, then a Nokia 900 (WIndows) for two years, and now HTC one M8.  I did a lot of research in deciding between the Samsung S5 and the HTC.  I liked the alluminum body for the HTC and did not care about the heartrate monitor or fingerprint scanner for the Samsung.  The HTC also came with more memory for the same price.  The only seemingly legit complaint in the reviews was for the camera.  Online pictures from both always showed the Samsung as taking better pictures.  The fact that the HTC has a lower resolution did not bother me as that has nothing to do with a good picture.  Five MP resolution for the HTC is still huge.  Having ordered the HTC I can say that the camera is great.  The pictures so far have been much better that the windows phone.  Maybe the Samsung's pictures are better, I do not know, but I was frustrated with the Windows phone pictures and could not be happier with the HTC's pictures.Android is great so far.  It is very customizable and easy to use.  My only complaint is all the nonsense apps etc that HTC/ATT/Google preinstall.  I feel like if I am not paying attention, I agree to all kinds of things and services that I do not want but are preinstalled and enabled with little or no consent by me.  I also hate that Google is now monitoring every aspect of my phone to sell me something else.Otherwise, I am happy with the purchase and would recommend the HTC one M8.", "Date": "April 28, 2014"}, {"Title": "Good speaker volume", "Author": "C J.", "ReviewID": "R2OD14FEZARHO2", "Overall": "3.0", "Content": "the one thing I was not happy with is that the volume rocker shakes very loud while talking and moving my head, for example:  while holding the phone to my ear as I talk, if I should look around, up or down, I would hear a sound that is not comfortable at all. after checking it out, I was informed that it was coming from the volume switch.  The speakers are certainly loud, and with the  booster, you can move about 20 feet away from the phone while it is on the speaker setting, and still hear clearly what you are listening to.", "Date": "May 31, 2014"}, {"Title": "Simply awesome!", "Author": "Srikanth", "ReviewID": "R1VQ4EVC9VOL1L", "Overall": "4.0", "Content": "Very good phone by design and hardware. HTC has done a good job. Much better than S5 for sure. Only things I felt little bad is camera which is having low clarity but I am ok with this as I am not a big user of mobile cam.", "Date": "May 2, 2014"}, {"Title": "Not fond of HTC Sense/Keyboard", "Author": "Big Papa", "ReviewID": "RW3G30Y8O8LQ1", "Overall": "4.0", "Content": "I recently have owned a Galaxy Note 3 and think the interface that Samsung developed (Touchwiz) is much better. This phone is very fast, and easier to manage than the Note 3, as it's just too big. The Note 3 that I had (AT&T;) seemingly had several hardware bugs that were specific to AT&T.; One such issue was WIFI connection, another was constant drop of GPS signal. I don't have an issue with either item with this phone. I don't use the Blinkfeed offering since I don't do social networking. I actual like the camera more with this phone. The interface in particular is much better in my opinion. The pictures are much better in lowlight and the autofocus works faster. The pictures don't have the high level of 'megapixel' that the Note 3 has, but overall I like the interface better. The phone looks fantastic, it is sturdy, and well built. I don't like however that it is slick as oil, which is an accident waiting to happen. I am pretty much forced to get a case, like an otterbox, to protect the phone which defeats the purpose of the phone being so aesthetically pleasing.", "Date": "April 24, 2014"}, {"Title": "Great Device", "Author": "Matt Pavelle \"Matt\"", "ReviewID": "R3705DHLR1V0Y2", "Overall": "5.0", "Content": "Currently my favorite Android device. Beautiful design. Very powerful CPU handles all my tasks easily. HTC Sense is very light weight, I don't even mind it running on top of Android. The battery easily lasts through a day of heavy usage (my S4 would last half a day at best) - would probably last two. It can be unlocked by anyone via htcdev.com if you want to run it back to a stock android device. The camera is great - I only look at photos on my phone and computer so the ultrapixel deal is excellent. Screen is the best out there.", "Date": "April 13, 2014"}, {"Title": "Phone is Perfect, but AMAZON open box and acccesories", "Author": "Yolima J.", "ReviewID": "R33935XUXVOG7M", "Overall": "3.0", "Content": "I received my HTC One M8, for my surprise, the phone comes with open and resealed box, and opened accesories. Phone is simply perfect, but I dont like this from Amazon.", "Date": "May 4, 2014"}, {"Title": "works good", "Author": "Daniel Benson", "ReviewID": "R14Q3IYOXWMIJD", "Overall": "4.0", "Content": "Like any new gadget,it will take awile to get used to. The battery holds up good,the camera works really good. But my wireless Bluetooth wouldn't hook up.", "Date": "June 3, 2014"}, {"Title": "Awesome phone", "Author": "Book Buyer", "ReviewID": "R1Y7CPLTFO7347", "Overall": "5.0", "Content": "Others have covered all the bases for why this phone is so great: the build quality, the sound capabilities, the battery life, the elegance of the skin, etc. I will not repeat what they said, but will just say that I've used many different phones (Galaxy S2 and S3, Iphone 4s and 5, and a handful of others).This is by far the best smartphone I've ever used, by some margin.", "Date": "April 12, 2014"}, {"Title": "HTC One M8 takes purple pictures", "Author": "Robert Barger", "ReviewID": "R1Y46QP81VDL0G", "Overall": "2.0", "Content": "I've had my HTC One M8 for less than a month.  Love the phone.  Good thing the camera is not important to me because it takes purple pictures.  On a sunny day, standing in the shade, flash off, I take a picture across the yard and the trees look purple and the grass is bright neon green and the leaves are red.  I wrote a review on HTC (actually I've written 2) and they censored each review not wanting to post anything but positive comments.  I wrote another review being accurate, respectful, polite, factual, etc., everything the \"guidelines\" say to be.  We'll see if that gets canned as well.  Don't believe the hype.  The first M8 I had  was defective right out of the box and I had to take it back.  My second M8 takes purple pictures.  I guess I can live with that because I don't take very many pictures and it's too late to get my money back and I'm tired of exchanging phones and going through all the set up mess you have to perform for a new phone.  I can provide anyone who wants with samples of my beautiful purple pictures.", "Date": "May 16, 2014"}, {"Title": "Phones is great the accessories suck", "Author": "Eric Williams", "ReviewID": "RX0LFRNTFSONR", "Overall": "3.0", "Content": "I got it last night and haven't spent much time playing with it but my initial impression is the phone is amazing the metal, the speed, the display rocks. Huge upgrade from my HTC Vivid. I stuck with HTC because my last one was reliable, fast, and the camera is amazing.The accessories are crap. Anyone who's ever been trying to charge a phone while working at home or in an airport will love the 3 foot charger. I guess you're to plug it into your laptop then plug in your laptop? The headphones look like something I could get at a 99 cent store on clearance for a quarter. For work we use Apple iPhones and Samsung Galaxy phones and the quality of both the charger and headphones far exceeds what HTC has packaged with what I would consider a premium phone. Both have 5-6' chargers and the headphones are high enough quality I could see spending $15-30 on. The Galaxy headset has volume control along with the standard answer/mute button. HTC's headset looks like an after thought. The Dot Case that is displayed in the ATT store looks really sweet, however they didn't develop a method of attaching to the phone that doesn't involve covering the brushed aluminum gunmetal back plate. Might have been cool if like the old palm PDAs they had a tiny stylus hole in the top you could use for stylus or to attach a cover. Maybe the case should have connected to the side?I think being HTC is sort of marketing this phone as \"Sexy\" and \"Refined\" they would have worked out something better for the accessories. If you get the case you can look like you're carrying a a grey plastic galaxy 4s with ghetto headphones crouched next to an outlet in the airport. Sexay. :)I might update this review later as I get more time on the phone. Granted I paid for the handset and I haven't spent much time on it yet but from the un-boxing stand point I'm a little disappointed. On the bright side my Galaxy headset should work with it and my HTC vivid charger, which even being 3 or 4 years old is better, should still work.", "Date": "April 25, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "HTC One M8, Gunmetal Grey 32GB (AT&T;)", "ImgURL": "NULL", "ProductID": "B00IZ1VNZ2"}}