{"Reviews": [{"Title": "A great phone!", "Author": "David", "ReviewID": "R16OBIT4VBZAZA", "Overall": "5.0", "Content": "I moved over from an iPhone 5 and had been using Apple phones since the iPhone 4 came out.  Previous to that I used an Android phone and at the time it seemed like Android was still in a building phase with the overall OS.  Now a few years later and I'm back to Android with the Samsung Galaxy S5.  I purchased mine through a Verizon store a few days ago and so far this phone rocks!  The screen by itself is well worth the move from iPhone to Android.  It's bigger, has a better picture, and works much better while outside in sunlight.  The camera also takes much better pictures than the iPhone 5 I had previously.  Video so far has also been a lot better with the 1080p quality it looks great even off the phone.The OS is responsive and so far has not shown any sluggishness.  I have had a couple of the apps the phone with crash once or twice but certainly nothing different than what I'd see on the iPhone every so often.  The size of the Galaxy S5 is taking some getting used to.  I would just slide my iPhone 5 into my back pocket most times and while I can do that still with the Galaxy S5 it is noticeably larger.I'm also taking some time to adjust to the volume controls on the Samsung Galaxy S5.  With my old iPhone 5 if you dropped the volume low all apps and such that made noise were at the same level.  I found out in a meeting at work that isn't always the case with the Galaxy S5.  A minor annoyance which I'm sure I can adjust to and figure out quickly enough.All in all so far I'm very happy with my Samsung Galaxy S5 and would recommend it to anyone thinking about a switch.", "Date": "April 21, 2014"}, {"Title": "A Samsung Evolution", "Author": "Johnny Saigon®", "ReviewID": "R4WNTA6G8OS7L", "Overall": "5.0", "Content": "First off, I am not a professional reviewer, nor am I employed or compensated by Samsung or any other company. Instead of boring you with facts - which you can find anywhere on the Net - I will just give you some real-world impressions on how it looks, feels, and runs. With that out of the way, let's get to the point and the nitty gritty, shall we?* THE SCREEN - that is the very first thing you will notice when you look at the S5. Samsung has found its niche with AMOLED screens, which are BRIGHT & SATURATED. Everything almost literally jumps out at you, and sometimes even too much so. I had to switch to the \"natural\" setting, as the \"vivid\" and even \"standard\" profiles are too saturated(and FAKE) for me. It's better as a demo unit to draw you in, but for everyday use, I recommend switching to the natural profile.FACTS: The Galaxy S5 has a 5.1-inch Super AMOLED capacitive touchscreen with Full HD resolution - 1080 x 1920 pixels or ~432 ppi pixel density, plus Gorilla Glass 3 to protect the screen from scratches.* The Look - the S5 has a more squared-off edges look than the S4, which is more squared off than the S3, but all three are not as angular as the S2. In terms of roundness-to square-ness, it goes from the S3 - S4 - S5 - S2 (the original S just looks like an iPhone 3GS). Check out my images for an easier comparison. The S5 is the tallest and widest, but not the thickest of the Galaxy S's. The best thing I can say about this is it's an evolution. Beauty is subjective, so judge for yourself. The front side is almost the same as any other Galaxy phone: You have the physical Home button, flanked by the \"back\" and \"menu\" capacitive buttons. Probably the most improved aspect of the design is in its functionality - it is now dust-proof, and water-proof up to 3 feet!FACTS: The dimensions are 5.59\" x 2.85\" x 0.32\"(142cm x 72.5cm x 8.1cm), and weighs 5.11oz(145g).* The Feel - Samsung has taken a lot of flack for making the Galaxy S line so cheap looking and feeling with its plastic bodies, for being the top Android phone maker. HTC has been known to have the best craftsmanship with their all-metal One phones. Perhaps Samsung feel they are so dominant that they don't have to spend more to mass-produce metal phones, but since they don't want to come off as too arrogant, so their compromise is a dimpled, faux-rubber backside like the Nexus 7(2012) and its very own Galaxy Note 3. It definitely gives a better feel - it doesn't slip and slide in your hands or pockets anymore - but it cannot compare to the feel and craftsmanship of the HTC One(both the m7 and m8). It is on the right track though, so let's hope that rumored luxury \"F\" line or next year's S6 will continue to get better.* How it Runs - This phone is fast, fast, FAST! With a 2.5gHz Snapdragon 801, it has the fastest processor out there right now. It terms of real speed, I cannot say if it is faster than the HTC One m8 or the Sony Xperia Z2, but it is definitely up there. When you touch an app icon to launch it, it launches nearly instantly. To really see how this phone flies, just open the gallery app and scroll through all your photos and you'll see what I mean. Usually the gallery is where most phones stutter as it tries to load all your photos and albums - but NOT the S5!* The Camera - FINALLY! Samsung has decided to make a decent camera, and not just as an afterthought. This 16mp camera is really awesome, so much better than the S4. I would always get washed out images with my S3/S4/Note 2, but with the S5, it actually looks like it's from a decent point-and-shoot dedicated camera with crisp, bright, and saturated images. Low-light shooting is also vastly improved, although not as good as the new HTC One m8. 16mp means 5312 x 2988 -resolution images, so you can actually blow them up or crop them down without fearing the dreaded pixelation monster. There are a myriad of other cool and useful camera features that I will save for you to find out(like macro and \"Google Street View\" modes :]). And lastly, the focus is quick, quick, QUICK! Nearly instantaneous focus allows you to capture those hard-to-capture moments easier. A definitely thumbs up to Samsung for paying attention to the camera and its functions.* Software - I'm still trying to figure out everything, as there is A LOT of stuff under the hood. Samsung's TouchWiz user interface this time around is A LOT less intrusive though, as much as can be without being totally stock Android, I guess. The layout and iconography are flatter and simpler, and for the better in my view. There is also a new sensor on the back, just beneath the camera lens. It is a heart-rate monitor/pedometer, and it comes with its own health app called S Health. There is a new battery-saving mode which can save you precious minutes when you're caught in a bind. All in all, I think this version is a lot nicer-looking, more responsive, and better than the precious S phones.The ultimate question is whether this phone is a worthy upgrade over the S4. As my review title suggests, it is an evolution, an incremental upgrade over the S4. So with that said I cannot whole-heartedly recommend it if you already have a good phone, or even over the S4. But I do feel this upgrade is more vast and much better than from the S3 to the S4, so in that sense Samsung has done a much better job this year. If you are switching from an older phone that was made at least 2 years ago, then I would tell you jump right in and try the S5 - it will not disappoint you. But for those with already a good phone, and/or say you just finished year one of your 2-year contract, then I would say think hard before you make the leap. For my money, I think the Note 4 and S6 will be the bigger upgrades more worth waiting for.", "Date": "April 23, 2014"}, {"Title": "Surpasses Any Other Phone!!", "Author": "Danielle Gose", "ReviewID": "R13T1XPJRFHLVP", "Overall": "5.0", "Content": "I am beyond impressed with this phone. Playing with the phone in the store does not give it justice. I came from an iphone 4 so this is a huge upgrade. For a short time I used the GS4 and this is the S4 on steriods. I usually find things wrong with every cell phone, but so far I love this so much and that is why I want to review this. There are so many wonderful things on this phone, but I will just share a few of my favorite things.1. The camera is my favorite feature. With 16 mp it is extremely clear. It is wayyyyyy better than the iphone 4 I had. It is almost unbelievable. I like that you can press a button on top to take the pic rather than using the touch screen.2. Screen Size: This is way bigger that the iphone so it is an adjustment, but I is nice to be able to see what I am doing.3. Resolution: The bright crisp colors and resolution are very impressive4. Snappy: This is my first 4G, but I am so happy with how quick it is. There is no lag time at all.5: Simple to use: There was almost no learning curve, however I have used Android before. I was able to navigate very easily and find what I needed.6. Battery Life: There is a noticeable difference. My previous phones would barely get me through the work day. This gets me through 2 whole days. There is also a feature to put it in grey scale and this will get around 6 days. Unbelievable!There are so many other features such as the TV remote, heart monitor, and much more, but I have not used every feature yet. I just wanted to highlight my favorite features. This phone continues to awe me. I honestly have no complaints. I wondered if I should just get the S4, but I am grateful that I chose the S5. You will see the difference. I would recommend this to anyone who needs a smart phone and likes a slightly bigger screen. This is great for personal and business. You will not regret it!", "Date": "April 22, 2014"}, {"Title": "Upgraded from Motorola Droid 3", "Author": "Toto", "ReviewID": "R27TWZZ32W82GX", "Overall": "4.0", "Content": "As the subject says, I upgraded from a Droid 3 three days ago, so this is quite a difference in capability and performance.Pros:  1. Battery life is extremely good, I can use the phone all day at work (including walking an hour each way while listening to music, texting, playing a game while on lunch, and using various functions to help customers). By the end of the day it is still near 70%.  2. Performance is outstanding. Even on power saving mode it performs as fast as an S4 and w/o power saving is faster than a Note 3. I was especially stunned when using Windows Media Player moved a 10hr playlist to the S5 in the same amount of time it used to take the Droid 3 to verify the amount of space available. And this was through a USB 2.0 port.  3. Space better than I thought. I thought 16Gb would be more limiting, but I've installed most of my apps while waiting on a 64Gb microSD card and still have 7+Gb free. Of course my music library would eat most of that, but not bad considering this is a newer version of Android.  4. Screen is very vibrant. Colors are very distinctive and bright and viewing is a pleasure.  5. Charging is quick using the new cable, but nice that you can still connect legacy 2.0 cables to charge from older products.  6. Camera images quite a bit better than my previous experience. Been cautious given the news of the limited camera bug. Will update after more time of possession.  7. WiFi performance on 5Ghz band is very good. I only have an n-class router, but I get 33Mbps download compared to a laptop only getting 24Mbps using Speedtest and both connected at 300Mbps. Compared to the much slower connection performance on the Droid 3 over WiFi, this is much better.Cons:  1. Samsung keyboard app still has issues with passwords/text being corrected wrong in web forms, etc. Samsung should find a way to correct this or at least have a level of prediction aggressiveness like Google keyboard so you aren't forced into an all or nothing option.  2. Fingerprint sensor is not as accurate through case/screen protector. I understand Samsung states that you shouldn't use such when using the option, but that is like saying don't use wiper blades in the rain. It kind of defeats the whole purpose of having such a sensor.  3. Memory usage. Even with 2Gb of RAM, nearly 1.4Gb is used by the OS & background processes. Not sure if this is due to Android 4.4 or what since the Droid ran 2.3.4 in 512Mb of RAM and my Tab 2 has only 1 Gb running 4.2.2.Note:  Camera files are bigger than the lesser capable cameras of before, so for folks who have camera upload turned on this could cause excessive data use.Overall, if one is going to have a phone on contract for 2 years this is a great choice as it will still be viable at the end of the contract. I can truthfully say I am glad I made the switch, but I do hope that the next update of Android helps on memory usage.Update 5/13/14:Found that I get good accuracy on the fingerprint sensor using my thumb. It also seems to help to running your finger/thumb at a slight rightward-up angle as you move it across the sensor.Update 6/6/14:NFC works well even through my Otterbox case as it was able to read and recognize my VISA card. S5 runs cooler than any phone I've used even under load or charging. Only time it became warm to the touch was from being in direct sunlight for an hour on my walk to work. Battery performance is great still. I run the S5 w/o any power saving features enabled and after a full day I'm still at 50% charge. This phone is a worthy upgrade for anyone with a phone made prior to 2013 and even for phone upgrades from that year a serious consideration.", "Date": "May 4, 2014"}, {"Title": "BEST PHONE EVER!", "Author": "calc \"calc\"", "ReviewID": "R1KPC2QKURAFPM", "Overall": "5.0", "Content": "I just got this at Best Buy.  The carrier is Verizon Wireless.  The phone is really well built.  The back is easy to remove, so you can add a 128GB MicroSD card.  I added a 64GB card myself.  Then, I used a samsung application to use iTunes to write music to my Samsung S5 just like it's an iPod.  This is great.  So I'm not stuck with iPhone/iPod and iTunes.  Sound quality is excellent on my McIntosh/Sonus Faber audio system.I was worried that I would have trouble typing on the touch screen, but this has a bigger screen than iPhone, so it's much easier to type on this than it is to type on an iPhone.", "Date": "May 8, 2014"}, {"Title": "Love my new S5", "Author": "alisonc", "ReviewID": "R2EM7LZ4F5CKUM", "Overall": "5.0", "Content": "I upgraded to the S5 from a Samsung Galaxy Nexus. The biggest improvement is battery life. It's so much better on the S5! Love all the other features that come with the phone, too, including the new OS. No complaints here!", "Date": "May 16, 2014"}, {"Title": "great camera", "Author": "Jessica", "ReviewID": "R1J2IJSE7B6W15", "Overall": "4.0", "Content": "The camera is great. I like how big the phone screen is without feeling bulky. I am having issues with sending picture messages. My internet connection keeps stopping even when I have WiFi and full service. I have to restart my phone, other than that it's cool.", "Date": "April 25, 2014"}, {"Title": "It's good", "Author": "fred", "ReviewID": "RF6Y7LII7QDT3", "Overall": "4.0", "Content": "I do like and recommend the Galaxy S5. However, I am surprised at the missing android elements on the phone. The power save application is not sophisticated enough to be of significant use. I learned this morning, that the alarm does not work if the phone is powered off. This is a first time for me on any of my prior phones. It is the little daily things that make this \"advanced\" phone not so advanced.", "Date": "May 29, 2014"}, {"Title": "awesome phone", "Author": "jason wood", "ReviewID": "RVLRFYB94NDW3", "Overall": "5.0", "Content": "So great. Best android phone to date. I would recommend this phone to anyone interested in an android phone this year", "Date": "May 27, 2014"}, {"Title": "Okay for the Most Part", "Author": "Ava Jordan", "ReviewID": "RP2BYNBA7JDQU", "Overall": "5.0", "Content": "The phone is great, and so is the service.  I recently switched from Verizon to T-Mobile.  After a week with them I switched back. Main differences:Service: VerizonPricing: T MobileCustomer Service: T MobilePhone Features: T MobileCool Marketing: T MobileWebsite: T Mobile", "Date": "May 22, 2014"}, {"Title": "Love this Phone!", "Author": "Amazon Customer \"bj1216\"", "ReviewID": "R3L4AU2H8WDCK4", "Overall": "5.0", "Content": "Might be because my old HTC was so inferior in terms of capacity and ability but thrilled with my Galaxy S5.\\!", "Date": "May 15, 2014"}, {"Title": "nice design", "Author": "Vesna", "ReviewID": "RQ4QRMU2GBD48", "Overall": "4.0", "Content": "the design is nice and sleek at the beginning the screen was freezing up.  now everything works great love it", "Date": "May 12, 2014"}, {"Title": "Great phone", "Author": "DownTown8", "ReviewID": "R3U5WDJ4ZOQI7C", "Overall": "5.0", "Content": "S5 was out of stock at purchase and stated estimated delivery at 1 month later, but shipped 1.5 weeks after purchase. The phone is very fast with minimal lag running any high resource hogging apps. The features over the S4 is minimal so not worth an upgrade, but I come from the galaxy nexus and this phone is pretty amazing upgrade. The processor and ram speed, plus the camera and camera software are the most notable improvements. Pictures have a very fast focus speed and many shooting options available. The phone is also water resistant, not going to test it out, but it does give a peace of mind knowing if I spill on it or go swimming accidentally it'll survive.", "Date": "April 27, 2014"}, {"Title": "Awesome Phone", "Author": "Kindle Customer", "ReviewID": "R36H72OA3RA8W8", "Overall": "5.0", "Content": "Beautiful screen, very light weight. Batter lasts over 11 hours with heavy use.My favorite is the IR. IF I lose my TV/blu ray remote I can now use this as the remote control.Camera works great.Only bummer is fingerprint scanner works 50% of the time, but I dont really want to use that anyways so 5 stars.I upgraded from a droid 4.", "Date": "April 24, 2014"}, {"Title": "Awesome phone!", "Author": "Amazon Customer", "ReviewID": "R3275199M4RH49", "Overall": "5.0", "Content": "I received my Galaxy S5 last night, and I'm absolutely loving it so far!  Setup was extremely easy.  Amazon will send you an email once your order has shipped with instructions on what to do.  Once you've finished with that part, the phone has a wizard that will take you through the rest.  For me, this was much better than having a sales associate do it while I wait.I upgraded from an OLD Samsung Droid Charge, so this phone is quite a jump from what I've been using.  My husband has an S3, and there are noticeable differences between those models, as well.  I'm not a super techy person, so I won't get into specs and the such.  However, I really like the design and the feel of the phone in my hand.  Everything that I've had a chance to set up and play with so far has worked almost flawlessly, and of course the screen looks wonderful.My only slight hesitations are with the finger print sensor and heart monitor.  It's probably just me adjusting to something different, but I rarely am able to unlock my phone on the first scan of my thumb.  I saved my scan at two different angles - straight down and with my thumb held sideways - but I still haven't quite gotten the hang of it.  Hopefully this will improve as I get used to doing it, though.  Also, I'm not sure how accurate the heart monitor is.  It seems a little all over the place, but I really like the rest of the fitness app so far.  Neither of these things are real gripes, most likely just things that will improve with time and use.UPDATE 4/30/14: I felt the need to update my review regarding my last paragraph.  I have definitely gotten used to both the fingerprint security/unlock and the heart rate monitor.  Both are working very well now that I've had the phone a few weeks.Other important things to note are (1) how much I love the driving mode that allows for completely hands free voice commands!  This is WONDERFUL and remedies my concern about trying to unlock my phone while driving using the finger print swipe.  (2) I also am super impressed with the camera on this phone.  It is seriously as good as most point and shoot cameras I've owned.  Still loving my new phone!", "Date": "April 17, 2014"}, {"Title": "love it", "Author": "Duck", "ReviewID": "R3SS9WLVSU59SN", "Overall": "5.0", "Content": "This phone is great for work and personal life. It takes great pics. I wish the battery life was a little longer, maybe if I put it down for a few minutes it would last longer.", "Date": "May 28, 2014"}, {"Title": "Love it", "Author": "Kaitlyn harger", "ReviewID": "RFLIDFXSJLOKK", "Overall": "5.0", "Content": "I switched from the iPhone 4s to the galaxy s5 and I love it! The camera quality is amazing and I am loving the size of the screen! It also runs everything smoothly and is pretty easy to use.", "Date": "May 28, 2014"}, {"Title": "Best phone I've ever owned", "Author": "Knowland", "ReviewID": "R39GMLWRV6HX0A", "Overall": "4.0", "Content": "Great phone.  Display is very clear and apps are very nice.Camera takes supper photos.  I haven't found any negatives on this phone.  I'd recommend to everyone.", "Date": "May 28, 2014"}, {"Title": "Fast", "Author": "Robert", "ReviewID": "R1SDYQPVOWAN4O", "Overall": "4.0", "Content": "Very sleak and fast. Phone is only minus it's hard to use unless using bluetooth. Nice upgrade from razor max.", "Date": "May 26, 2014"}, {"Title": "I Love it!", "Author": "Coretta Scott", "ReviewID": "R1WTTTZ6DZN809", "Overall": "4.0", "Content": "I like everything about it compared to my old Motorola Bionic.It's faster, Great Camera, so far, and batter life is Great.", "Date": "May 26, 2014"}, {"Title": "Superthin and Priced Right", "Author": "Bob Bradley \"Bob\"", "ReviewID": "R35WGE9E7KHXDS", "Overall": "5.0", "Content": "I was impressed how thin the S5 was. The screen was almost too bright and I could read the smallest text. I think I'll be happy with the S5 at least as long as the contract period.", "Date": "May 25, 2014"}, {"Title": "Galaxy S5 is AWESOME!", "Author": "peruvazn", "ReviewID": "R3REOJ0T03RCCF", "Overall": "5.0", "Content": "Came within 2 days. As expected. Love the new phone, definitely a multitasker compared to the iPhone 5 that I had. Had an android phone 3 years ago and with the experience I had, I vowed never to go back, this phone definitely changed my views again, and I'm happy with my decision. Feature packed phone. Must buy!", "Date": "May 23, 2014"}, {"Title": "fantastic", "Author": "James", "ReviewID": "R3JDASWWVLAI8V", "Overall": "5.0", "Content": "Coming from galaxy s3, this phone is great. HD screen on the gs5 is dust proof, feels thicker, and can be seen at any angle with no issues.  I'm amazed at how good images and video look on here. Phone feels it's made of a better quality build than gs3.  The use of the phone is even better.  This phone responds fast.  Going through menus is a breeze.Minor gripe is the speaker is on the back so sound can get muffled. Also the bloatware that's installed  still gets me annoyed. I know you can \"deactivate\" them but I'd like the option to fully Remove them.", "Date": "May 22, 2014"}, {"Title": "Love it", "Author": "sssstttteeeevvvveee", "ReviewID": "R3TQTPSKRQKZ20", "Overall": "5.0", "Content": "Even though I stayed with Verizon (they aren't on the top of my list) I love love love this phone.  Thank you Samsung.", "Date": "May 20, 2014"}, {"Title": "Galaxy S5", "Author": "Red, red, reder", "ReviewID": "R9XSI4FZND8KT", "Overall": "5.0", "Content": "I love it! Best phone yet! Not a lot of new gadgets but it's fast. I would highly recommend to anybody who is in the market for a new phone!", "Date": "May 20, 2014"}, {"Title": "Galaxy S5", "Author": "Dg", "ReviewID": "R12LT5TO94QQFU", "Overall": "5.0", "Content": "I love my new phone. It is everything I expected and more. It has great built in apps. It is amazing. I'm still getting acquainted with it. I'm enjoying it", "Date": "May 5, 2014"}, {"Title": "Downgrade from S3 to S5", "Author": "Craig", "ReviewID": "R1TR4ELSDG9CKM", "Overall": "1.0", "Content": "I upgraded from an S3 to an S5.  I had the S3 for several years and was very happy with it.1) The day after I received my phone, I stopped receiving text messages completely.  I worked with the T-mobile rep to rectify it.  I had to do a hard reset on the phone.  Although I never received my missed texts, it seemed to work after that.  I was told that the phones were shipped with faulty software that Samsung was aware of.  Texts have worked fine since them.2) The speakerphone is a half-duplex instead of full duplex.  That means that when the other person was talking or making noise on their end, they could never hear me.  I was never sure if they were hearing what i was saying or if it was actually going through.  For example, if I was talking to someone on speakerphone who was in their car and had a lot of noise on their end, they would never hear me.  As someone who uses speakerphone a lot, this is a major problem.  My Samsung S3 was full duplex.  I never had this problem.3) My email never properly synced with my server.  If i looked at emails on my computer, they would still show as unread on my phone even AFTER I hit the sync button.  I would delete emails on my phone and after I synced, they would re-appear.4) I would choose a specific ringtone for different friends and it would only work SOMETIMES.  One time I might get the ringtone that I specified and another time I might get my generic ringtone.  No rhyme or reason.5) Because I live in NYC, some subway stations have cell service and others do not.  If I sent a text when I didn't have service, it SHOULD simply send when I got above ground or to a station that had service.  It wouldn't.  The text would just sit there and never send.  I would have to copy/paste it to a NEW text and send again.6) I used the map service to find a friend who was several blocks away.  I had an address and when I put it into the phone, it sent me in the complete wrong direction.  In fact, the map started spinning as if it had no idea how to locate where I was or where I was going.7) There was a serious lag because of Touchwiz.  It's almost as if the phone is thinking about what it needs to do.I'm being shipped a new phone but I'm not sure if it will fix ANY of these problems. If it doesn't, I'm going to have to choose a new one. Samsung REALLY rushed this one out.", "Date": "May 8, 2014"}, {"Title": "Hate it!", "Author": "Yehezkel Yosef", "ReviewID": "R387YR21CZUXTS", "Overall": "1.0", "Content": "Hate it! Hate it! Hate it!!!!!What a stupid design! My galaxy S5 has enough useless features to fill days of exploration yet the home button wakes the phone and there's no way to disable this feature. Every time the phone is in my pocket, the home button inadvertently depresses and wake the phone. Soon after the phone rub against my pants and get unlocked. From there to the misdeal phone numbers to the deletion of important info, the way is very short. I guess it's okay, it only cost $700...I contacted Samsung but they had no help to offer other that going around it by putting a number or pattern lock on the phone. Surly my pants pocket isn't that smart. It's okay for the phone to heat up in my pants and waste battery while the screen is on.Arrgggghhhhhh! you stupid Samsung software engineers! Who the hell is testing your prototypes? We don't all wear suits like you! most of us are a blue collar working class that put our phone in our pants pocket.Please revise software to allow us to disable home button from waking phone up.And NO! I don't wan't to put a code (number, pattern, or unreliable finger print) on my phone. I don't want to see my life waste away on unlocking my phone for every time the screen goes out or with every phone call. I tried it and it suck.If this is not fixed, this is my last Samsung product. Very disappointing...", "Date": "May 30, 2014"}, {"Title": "too big to be a cell phone", "Author": "B.C.D 5249", "ReviewID": "R1ELRSU9FWG29E", "Overall": "1.0", "Content": "I have been searching for quite a while to find a properly sized cell phone. I mean when i saw this thang i thought it would be appropriately sized for a cell but apparently not. How do you expect a cell animal or plant to communicate with such a big device", "Date": "April 28, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Samsung Galaxy S5, White 16GB (Verizon Wireless)", "ImgURL": "NULL", "ProductID": "B00IZ1Y2XM"}}