{"Reviews": [{"Title": "An Evolutionary Step Forward That Still Offers Plenty To Love", "Author": "JJG", "ReviewID": "RTL1A05M89BAI", "Overall": "5.0", "Content": "The Samsung Galaxy S5 offers more of an evolutionary step forward in Samsung's S series smartphones than a revolutionary new phone. There are plenty of new features and advances with the S5 but those who already own a S4 likely will not be rushing to get the S5. I'm coming from an iPhone 4S so the S5 offers a lot of new features for me and provides plenty to love.FEATURES & UPGRADES FROM S4:1.  SIZE: The S5 is slightly larger at 5.59\" x 2.85\" x 0.32\" and weighing in at 5.11 oz compared to the S4 at 5.38\" x 2.75\" x 0.31\" and weighing at 4.59 oz. The S5 is lightweight and feels good in my hand.2.  DURABILITY: If there is one new feature on the S5 that is a game changer it's got to be the IP67 certification. IP67 certified means the S5 has total protection against dust and can survive being underwater for up to 30 minutes at a depth of 1m or less. In order to be protected against water the S5 has a little plastic plug to cover the charging jack on the bottom of the phone. This needs to be in place and the back must be properly snapped into place to prevent water damage. I'm not about to test the IP67 certification however the guys at TechSmartt performed 2 water tests on the S5 that can be viewed on YouTube. First they let the S5 sit in pool at a depth of 1m for 1 hour, not 30 minutes. Second they sent the S5 through a normal wash cycle in a washing machine while in the pocket of a pair of jeans. In both tests, the S5 survived and functioned perfectly afterward.The durability of the S4 came under fire after many people reported cracked screens after minor drops. Samsung stuck with a plastic back for the S5 but did improve upon the durability of the smartphone. In separate drop tests again conducted by TechSmartt, the S5 faired better than the S4 and better than the iPhone 5s. However the S5 didn't fair as well as the durably built HTC One M8. The tests are a decent indication but should also be taken at face value since there is no way to ensure each phone fell the same way.3.  SCREEN: The S5's new screen is nothing short of stunning. The S5 screen is 5.1\" which is slightly larger than the 5.0\" screen on the S4. The resolution remains 1080 x 1920 pixels so the pixel density is slightly less at 432 ppi. The screen does look noticeably better than the S4's screen and has richer colors, better contrast, whiter whites, and blacker blacks than my iPad 3 when viewing identical images.Displaymate who extensively tests smartphone screens said the S5's screen is \"the best performing smartphone display that we have ever tested.\" Displaymate's tests indicted the S5 screen is 22% brighter than the S4 and 13% brighter than the Note 3. The S5 also has outstanding color accuracy. In addition it features a Professional Photo Mode that provides an accurate calibration to the Adobe RGB standard, this is a rare feature in consumer displays.4.  CAMERA: The S5 sports a 16MP camera rear camera up from 13MP in the S4. The front facing camera remains pretty much the same at 2.1MP.  The S5's 1/2.6\" sensor is larger being closer in size to sensors from P&S; cameras than smartphones. The AF is also speedier with the S5 due to its hybrid use of phase detection and contrast detection AF. The S5 is the first camera on a smartphone to use phase detection AF, which is commonly found in DSLR cameras. Other smartphones only use contrast detection AF that simply focuses by measuring the contrast between nearby pixels. This type of AF tends to be slower and not work well if shooting in situations where there isn't much contrast. Phase detection AF however focuses by comparing the actual light received by sensors.COMPARING S5 & 5s IMAGES: Comparing daytime images shot with the S5 against images of the same subject shot with the iPhone 5s, the Samsung's images disappoint in spite of being 16MP vs 8MP with the 5s. At 16MP the S5's resolution is 2988x5312. The images are therefore at a 16:9 ratio. The iPhone 5s's resolution is 2448x3264. The images are therefore at a 4:3. When viewing images shot with the iPhone at 100%, they look sharp across the frame, even in the corners. Images shot with the S5 when viewed at 100% look oversharpened and blotchy. The center sharpness is passible but the edges are soft and the corners have absolutely no detail. If downsizing the images from the Samsung S5 so the lower number, 2448, is the same as the iPhone's the center sharpness between the 2 camera's images is almost indistinguishable but the edge sharpness and corner sharpness from the iPhone 5s blows away that from the Samsung S5.COMPARING S5 & 5s CAPTURE TIME: Both the S5 and the 5s are speedy when it comes to focusing and taking pictures. Holding the S5 in one hand and 5s in another, pressing the shutter buttons at the same time, then turning to take a picture of a new subject, pressing the shutter buttons again, and repeating this process several times, the iPhone 5s is a split second faster than the S5. It's not substantial enough to make big difference for most applications but worth knowing. The images from both cameras when doing so were in focus.5. VIDEO: The S5 will shoot 4K videos with a resolution of 3840x2160 compared to 1080P videos with the S4. Videos look great with S5 and the stabilization works very well.  Sometimes when recording the screen will look at little jiggly but in playback the video looks smooth. I have no way to test its 4K capabilities.6.  PROCESSOR: The S5 is a very snappy smartphone. This is due to the new Qualcomm's Snapdragon 801 chip. It features a quad core, 2500mHz processor which speedier than the quad core, 1900mHz processor in the S4.  The S5's memory remains the same at 2GB.7.  STORAGE & EXPANSION: The 16GB S5 from AT&T; has 10.85GB of free storage space on the phone after KitKat and the preinstalled apps. I read complaints from some S4 owners stating that only 9GB was free on their new phone after the OS and preinstalled apps. If that was the case, Samsung/Google/AT&T; trimmed down a bit for this phone.I love that the S5 along with other Android smartphones allow storage expansion through a microSD card slot. This can be used for music, videos, books, pictures, and other files. It is also possible to move downloaded apps, not preinstalled apps, to the microSD card. To do so, go to Settings, Application Manager, SD card, and then select the downloaded app you want to move to the microSD card. The S5 will allow up to a 128GB micro SD card that is double the 64GB with the S4.8. BATTERY & CHARGING: The S5 features a 2800mAh battery which is slightly larger than the 2600mAh battery in the S4. The S5 has good battery life ratings. The talk time of the S5 is rated at 21 hours while the standby time is 16.2 days. Being a new phone, I've been using it quite a bit. Even at that, I find that I only have to charge the S5 every 1 1/2 days. The S5's battery life is significantly better than my iPhone 4s which I had to charge at least once a day and better than my wife's 5s which has to be charged every day. Charging the S5 using the USB 3.0 Micro cable provided, the phone charges at a rate of 1% per minute with it slowing down slightly when the phone hits 80%. I'm able to fully charge the S5 when the battery is at 20% in about 1 1/2 hours.9.  CONNECTIVITY: The S5 features USB 3.0 connectivity for speedier transferring of files compared to USB 2.0 with the S4. It also features wireless AC. Wireless is extremely fast with the S5 if you have an AC router. It is about 4-5x faster than the wireless N on my iPhone 4s.10. HEART RATE SENSOR: One of the more talked about additions to the S5 is the heart rate sensor on the back of the phone. The heart rate sensor seems to be accurate from what I know about my normal heart rate. I haven't had any wild readings thus far. The phone has simple How To tutorial if using for the first time. The mistake I made the first few times using it was pressing too hard on the sensor. The result was an error message. The sensor only requires a little touch from your finger.My complaint with Samsung's \"S Health\" app which the heart rate sensor is part of is that you are unable to use the heart rate sensor while using the exercise portion of the app. Sadly, that is when I'm most likely to use the heart rate sensor; when I'm running, walking, or hiking. Hopefully Samsung will change this in a future update. If the heart rate sensor is a feature you will use make sure you purchase a case with a large enough opening for your finger to touch the sensor. Some of the cases I've read about have a cut out only the size of the sensor. This makes it extremely difficult to get your finger in the opening in order to touch the sensor.11. DOWNLOAD BOOSTER: One new feature of the S5 that is omitted from the AT&T;, Verizon, and Sprint versions is Download Booster. Download Booster provides simultaneous LTE and Wi-Fi downloading if you need files in a hurry. I have a wireless AC router which provides super fast download speeds with the S5 but it would have been nice to have the feature just in case. If you do want Download Booster you need to purchase an unlocked version of the S5.12. FINGERPRINT SCANNER: Another very talked about new addition to the S5 is its finger scanner to unlock your phone, make payment via PayPal, and purchase content with Samsung services. The S5 requires you to swipe your finger, starting above the home button and moving down through the center of the home button. With the iPhone 5s you simply place your finger on the Touch ID button. The fingerprint scanner works from any angle with the 5s. The design makes the 5s easier to unlock than the Samsung because it can be done with one hand whereas the design on the Samsung requires me to use both hands, one for holding the phone and the other to swipe my finger. With the Samsung you can assign different fingers to perform different tasks, like right pointer finger to make PayPal payment.My wife has the iPhone 5S so I've setup both and unlocked the phones with both. Both are easy to setup. The Samsung allows you to register 3 fingerprints whereas the iPhone 5S allows 5. Here is where I buck the trend of all the tech writers complaining about the reliability of the S5's fingerprint scanner. While I prefer the design of the iPhone's fingerprinter scanner, the S5 more reliably scans my fingerprint to unlock the phone. The only time I've had a problem unlocking my S5 with the fingerprint scanner is while I'm running; I just can't get a smooth enough swiping motion. Outside of running, the fingerprint scanner on the S5 unlocks my phone on the first try 90-95% of the time. I haven't needed more than 2 tries. The iPhone in comparison only unlocks the phone on the first try about 75-80% of the time and sometimes I need 3 tries to do so.13. ULTRA POWER SAVE MODE: This is a great feature to have if your battery is getting low. Switch on the Ultra Power Save Mode to maximizes your remaining battery life. This feature switches to a black and white mode, turning off all colors. It also restricts background data and allows only low power communications like texting, calling, and AT&T;'s internet browser.I've started to use the Ultra Power Save Mode overnight to conserve battery life, no sense in letting the battery drain as the phone just sits there for hours. I still receive texts and calls. After I disable the mode in the morning I have to update my email and weather. Switching to Ultra Power Save Mode, the battery only depletes by 1% overnight! Not in the Ultra Power Save Mode the battery loses 5-15% overnight.INSTALLED APPS:AT&T; Family Map, AT&T; Locker, AT&T; Mobile Locate, AT&T; Navigator, Beats Music, Calculator, Calendar, Camera, ChatON, Chrome, Clock, Contacts, Device Help, Drive, DriverMode, Email, Flipboard, Gallery, Gmail, Google, Google Settings, Google+, Hangouts, Internet, Keeper, Maps, Memo, Messages, Messaging, Mobile Hotspot, Mobile TV, Music, My Files, myAT&T;,  Phone, Photos, Play Books, Play Games, Play Movies & TV, Play Music, Play Newsstand, Play Store, POLARIS Office 5, S Health, S Voice, Samsung Apps, Settings, Smart Remote, Usage Manager, Voice Recorder, Voice Search, Wallet, YouTube.PROS:1. Amazing looking screen. Displaymate says the S5 screen is \"the best performing smartphone display that we have ever tested.\"2.  IP 67 certified. Protection against dust and water immersion up to 1m.3. According to drop tests from TechSmartt the S5 is more durable than S4 and iPhone 5s.4. Professional Photo Mode for screen that calibrates it according to Adobe RGB standards.5. Uses a hybrid between phase detection and contrast detection for accurate and speedy AF.6. Shoots 4K videos.7. Very fast processor. The S5 is snappy.8. 10.85GB of free storage space on new 16GB phone. Allows storage expansion up to 128GB through microSD card slot.9. Heart rate sensor that is easy to use and seems to be accurate. The sensor is good for those who exercise or benefit from closer monitoring of heart rate for health reasons.10. Features wireless AC connectivity. 4-5x faster than wireless N.11. Fingerprint scanner works more reliably for me than iPhone 5s.12. Good battery life. Rated at 21 hours of talk time.13. Ultra Power Save Mode maximizes battery life. Great if battery is running low or for overnight use.CONS:1. Has plastic back instead of more durable aluminum unibody like the HTC One M8.2. Too many cooks in the kitchen. Google, Samsung, and AT&T; have similar preinstalled apps that can't be uninstalled. Each company is obviously fighting for your attention but in the end it creates not as fluid of a user experience compared to Apple which designs the phone and OS and doesn't allow AT&T; to put their garbage on the phone. I don't need multiple ways to check email, play music, watch movies, or get on the internet.3. Disappointing image quality for a 16MP camera. Not as good as the 8MP camera on the iPhone 5s. Daylight images are oversharpened, blotchy, have soft edges, and no detail in the corners.4. Design of fingerprint scanner requires me to use both hands unlike iPhone 5s which I can unlock with one hand.SUMMARY:Samsung's new flagship smartphone the Galaxy S5 is a wonderful phone. I've only had iPhones up until now but was seeking specific features, features that the S5 had. I love having the larger 5.1\" screen. It is fantastic looking, having more vibrant colors, better contrast, and whiter whites and blacker blacks than my iPad 3. Another feature that sold me that the iPhone 5S is lacking is wireless AC. It provides very speedy downloads and internet experience. Of the upgrades from the S4 the IP67 certification and increased durability have to be the most significant. The S5 has very good battery life, is very snappy with its 2500mHz quad core processor, and the Ultra Power Save Mode is a nice addition.While the camera focuses and captures images very quickly, its image quality is disappointing for a 16MP camera. I could do without the bloatware from Samsung and AT&T.; I love that I can cheaply pick up a 32GB microSD card to store pictures, music, videos and even transfer apps onto, something I couldn't do with an iPhone. Having used the fingerprint scanner in the iPhone 5s and S5, I prefer the fingerprint scanner with the Samsung because it works more reliably for me. I highly recommend the Samsung S5 for anyone looking to upgrade or in the market. It may not be revolutionary enough to make S4 owners jealous but still is a mighty impressive phone.", "Date": "April 11, 2014"}, {"Title": "For those upgrading from Galaxy S3", "Author": "Simple Simon \"S S\"", "ReviewID": "R3HKKBJLYA0TTJ", "Overall": "5.0", "Content": "So glad I upgraded. Much much faster than the S3. Compared to the S3: Apps snap open; Windows slide smoothly; Calls are made and answered instantaneously. Battery life is also noticeably better. The size is bigger, but that's a minor tradeoff in my book.", "Date": "April 12, 2014"}, {"Title": "Lots of benefits. Lots of shortcomings. Still a great device.", "Author": "Kevin Nicholls \"jaded, aging hipster\"", "ReviewID": "RAKZ1KAFATIJQ", "Overall": "4.0", "Content": "I'm a self-admitted phone nut, and I've carried around a Nexus 4, Galaxy S4, Galaxy S4 Active, HTC One, HTC One M8, and iPhone 5S over the past year. I don't have a very strong allegiance to operating system or brand. So, without lots of conjecture:Things the Galaxy S5 Does Well:*It feels nice in the hand. Not quite as natural as smaller devices, but less slippery and heavy than the HTC One M8.*The \"one hand mode\" is a brilliant idea. Swipe side-center-side, and the active portion of the display shifts to that side at the same size as the iPhone 5S (a coincidence, I'm sure!). I can't express how wonderful this feature is on a device this size.*The fingerprint scanner is fast and reasonably accurate.*Sound quality from the speaker is decent. The personalized audio enhancement, on the other hand, is truly impressive.*USB 3.0 is speedy when transferring files, and charges the device incredibly fast.*The display -- while not professionally accurate -- is beautiful.*Build quality is excellent. There's no creaking or flexing here.*Bluetooth audio on voice calls and music is probably the best I've experienced.Things the Galaxy S5 Does Acceptably:*The camera quality is decent, but macro photos are exceedingly difficult to take, and taking a picture of something lit (a sign, LED/LCD panel, et cetera) causes the focus to go nuts.*Micro/Mini USB cables aren't going to work with the USB 3.0 interface, but it uses a standard USB 3.0 cable.*TouchWiz is dramatically improved, but after a few hours, I went back to Nova Launcher. (Seriously, Samsung... I don't understand why you think the sanctity of your product is violated by my desire to move the Applications button from the right to the center.)Things the Galaxy S6 Can Improve On:*While the camera quality is decent, it doesn't hold a candle to the iPhone 5S in terms of convenience.*The plastic feels nice, but it's still plastic. It's time to use better materials.*It's at the very edge of what you could use with one hand. Yes, I get \"Bigger phones are the trend!\" So were Walkmans.*As heavily as Samsung wants enterprise clients moving to their devices, they've continually overlooked simple features, like a physical \"silent mode\" button.*To date, the AT&T; version of this phone has a locked bootloader, which seriously limits your ability to customize the phone.*The current implementation of fingerprint scanning isn't acting as a surrogate for a PIN or password (as it does on the iPhone 5S). This means that if you're connecting this to an Exchange server, and the admin hasn't enabled biometrics in the security policy, you'll be forced to use a PIN to unlock the phone.So, is it better than the HTC One M8? Maybe. Personally, I like the way it feels, and how the current iteration of TouchWiz is closer to the stock Google Play Edition. And again, the \"one hand mode\" is a godsend. On the other hand, the M8 looks every bit as expensive as it costs.Personally, I matched my S5 with a Galaxy Gear Neo, and they're great together. If you're willing to buy in to Samsung's ecosystem, the choice is much simpler.", "Date": "April 16, 2014"}, {"Title": "Evolutionary NOT revolutionary!", "Author": "rpv", "ReviewID": "RAUZTOTZMBAIK", "Overall": "5.0", "Content": "Oh, Another year, another set of phones from manufacturers!  I have been hooked onto get the latest phone every year syndrome and love reviewing specifics. Disclaimer, I love Android and have been using from very early days. I will not call Samsung Galaxy S5 as revolutionary, but it is certainly evolutionary. If you have an older phone more than 2 years old, absolutely get this. I love Samsung Galaxy S5 from its competitors for few reasons - removable battery, microSD card support and the maturity of the product. I have been using a S5 for past couple of days and have ordered a unlocked one from my local store. There are so many variants already in the market. So do check local specs. For example, in china market dual SIM S5 is available.Galaxy S5's back plate has a perforated dot pattern and a excellent matte finish. As a result, the phone looks far more sophisticated than its past designs despite its plastic build. Its surface feels nice to the touch without being too rough or too slippery.  I really do _not_ care about the plastic, in fact the lightweight nature is what I care. Some people make a huge deal out of it. A high quality plastic is good for lightweight and I go with lightweight than a heavy phone in the pocket. A reputed tech site called recently Samsung as the “undisputed king of the Android smartphone space”. True indeed. With the plethora of devices in tablets/phones, they have iterated so much that they can produce truly stunning products.If you care for weight, the Galaxy S4 is lighter than S5.  (please see my stats below).  In fact pixel density is slightly higher in S4 due to a 0.1in size difference. So get an S4, it is cheaper and still same phone that came out last year. If you care for heart rate monitor, fingerprint scanner, and water proof, get the S5. Otherwise literally similar set and you can save a lot by getting S4 now. Last year when S4 came out it was a great phone. It still is, though S5 came out now. Obsoletion is in the mind of the us, not on the devices.In my opinion, following are key specs to consider when you buying a phone. Most of others are standard or does not matter at all. First size,weight and resolution are part of look and feel. RAM/CPU part of performance. external Storage is part of expandability. Camera is obvious! SAR  (Specific Absorption Rating) is an often ignored, but I feel essential to making a buying choice. Manufacturers don’t advertize or mention SAR prominently.phone parameters: {size, weight, resolution, ppi, RAM, ext Storage, camera, CPU, USA SAR rating}Samsung Galaxy S5: 5.59 x 2.85 x 0.32 in, 145 gm, 1080 x 1920 pixels, 5.1 in, 432 ppi, 2 GB RAM, microSD upto 128 GB!, Qualcomm Snapdragon 801,  MSM8974-AC  Processor:  Quad core, 2500 MHz, Krait 400, 0.63 W/kg (head), 0.82 W/kg (body)Samsung Galaxy S4 (Intl version):  5.38 x 2.75 x 0.31 in, 130 gm, 1080 x 1920 pixels, 5.0 in, 441 ppi, 2 GB RAM, microSD, up to 64 GB, 13 MP/2MP, Exynos 5 Octa 5410 CPU, Quad-core 1.6 GHz Cortex-A15 & quad-core 1.2 GHz Cortex-A7, 0.85 W/kg (head), 1.55 W/kg (body)HTC One M8: 5.76 x 2.78 x 0.37 in, 160 gm, 1080 x 1920 pixels, 5 in, 441 ppi, 2 GB RAM, microSD upto 128 GB!, 4 MP (rear), 5 MP(front for selfies), Qualcomm Snapdragon 801, Quad core, 2300 MHz, Krait 400, 0.94 W/kg (head), 0.83 W/kg (body)LG G2: 5.45 x 2.79 x 0.35 in, 143 gm, 1080 x 1920 pixels, 5.2 in, 424 ppi, 2 GB RAM, no ext Storage, 13 MP/2.1 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.26 GHz Krait 400, 0.50 W/kg (head), 0.69 W/kg (body)Google Nexus 5: 5.43 x 2.72 x 0.34 in, 130 gm, 1080 x 1920 pixels, 4.95 in, 445 ppi, 2 GB RAM, no ext Storage, 8 MP/1.3 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.3 GHz Krait 400, 0.92 W/kg (head), 1.23 W/kg (body)Apple iPhone 5S: 4.87 x 2.31 x 0.30 in, 112gm, 640 x 1136 pixels, 4.0 in, 326 ppi, 1 GB RAM, no ext storage, 8 MP/1.2 MP, Apple A7, Dual-core 1.3 GHz Cyclone (ARM v8-based), 1.12 W/kg (head), 1.18 W/kg (body)Samsung Galaxy Note 3 N9000: 5.95 x 3.12 x 0.33 in, 168 gm, 1080 x 1920 pixels, 5.7 in, 386 ppi, 3 GB RAM, micro SD upto 64 GB, 13 MP/2MP, Exynos 5 Octa 5420, Quad-core 1.9 GHz Cortex-A15 & quad-core 1.3 GHz Cortex-A7, SAR: 0.24 W/kg (head), 0.72 W/kg (body)Nokia Lumia 1520: 6.41 x 3.36 x 0.34 in, 209gm, 1080 x 1920 pixels, 6.0 in, 367 ppi, 2 GB RAM, microSD up to 64 GB, 20 MP/1.2MP,  Qualcomm MSM8974 Snapdragon 800 CPU  Quad-core 2.2 GHz Krait 400, SAR: 0.59 W/kg (head), 0.24 W/kg (body)Motorola Moto G: 5.11 x 2.59 x 0.46 in, 143 gm, 720 x 1280 pixels, 4.5 in, 326 ppi, 1 GB RAM, no ext storage, 5 MP/1.3 MP, Qualcomm Snapdragon 400, Quad-core 1.2 GHz Cortex-A7, SAR: 1.17 W/kg (head), 1.06 W/kg (body)Given the above key specs, my suggestion to my friends is to choose 2 or 3 KEY features you require (may be large screen size, maybe less weight, maybe more CPU power) and then start nailing down the phones. Definitely and definitely go to a phone or a big box store and feel the phone. Nothing replaces that. In the end end you are using it for days and years, so the tactile feel is very important.SCREEN SIZE/RESOLUTION:I have experimented with many phone sizes and I have come to a conclusion 5” is the best form factor for me. Your mileage may vary, but after using Note for a while, I don’t use it as a primary phone.  The display in S5 is absolutely stunning with a Super AMOLED display and you have to see to feel it!ANDROID UI:S5 has Android 4.4.2 KitKat out of the box. User Interface hasa flatter and simpler design, as is now the trend across the industry. Once you get used to user interface you get used to it. Android is very flexible and when I show my phone to a iPhone users they are usually in awe. I recently to my friends shows the details of processes. battery usage like which process takes up more battery, Qi charging receivers for wireless charging on Galaxy phones and they were in awe.WATER PROOF:Obviously I have not tested this!,  but a very nice to have feature and gives a peace of mindCAMERA:This can just replace a point and shoot camera. Wait, what is a point and shoot camera?! Very impressive. S5 has a 16MP camera with super-fast autofocus, HDR mode with real-time preview, and support for 4K video recording. Definitely state of the art.  I took several indoor photos and they look great. It will be interesting to see how photos appear in a vanilla S5 which Google will release.S-HEALTH:I rely and use S-Health more than any other app in my Galaxy S5. It has driven my fitness regimen to a very good progress and the design of app is nothing short of buttery and beautiful. I am often too in good favor of Samsung loading the phones with S-Ware, but their design of S-Health is definitely breathtaking. Heart rate monitor is a great addition to the fitness tools. I used it for walking several steps and found it same as in S4.PROCESSING POWER:Don’t bother about it.  For 99% of users, this is good enough. The phone has more processing power than the rocket that went to moon first time and much more. The games are very smooth, the UI is very smooth.Qi WIRELESS CHARGING:I wonder why Samsung does not release wireless charging built in. You have to get a external Qi wireless charger and open the back, align it and use with a Qi charger. It should be integrated, but you can do it after the fact.NFC Tags:Wow, this is the most underrated in all reviews. Get bunch (  I mean  around 10) of NFC Tags and use in bedrooms, offices, cars, living room and customize what your phone wants to do in those areas. For example in my S4, when  I enter the car most often I use a) Navigation b) Listen to Podcasts. So I program my NFC tags accordingly using apps like Trigger and tap my phone to the NFC Tag and boom, phone does both. I am programming my S5 also to do host of things.128 GB Micro SD card!!This is just incredible. If you see my reviews, I have been saying having external capacity is very key. With a 4K camcorder you can fill your space in a blink of the eye. Movies take up space. Who would have thought a 128 GB tiny card can fit in  a phone. This is just incredible. I tested with a 128 GB  and it works wonderfully! A 16 GB phone memory will have around 10 GB spare initially.OTG - USB Hosts:This is also often ignored feature in many reviews.  On the GO USB cable + S5 means you can use with external hard disks, and virtually many of USB devices. If you have a thumb drive and have files, you can in fact read with a phone and don’t necessarily have to open  a laptop. works out of the box.BATTERY:Do you really need to care for battery anymore. I don’t. Just use the phone. I have battery power banks with capacity as high as 30,000 mAh to 8000 mAh that I can charge virtually anywhere without a power supply. So this has become moot for me in past year. I would also suggest you get power banks and not really care of battery drainage. Use the phone and enjoy!MISC FEATURES:I tested fingerprint scanner, but I am not sure how reliable it will be over time with scratches/oily fingers etc. I have to test it further, but for now I will settle on traditional passwords till bugs are ironed out.  Apple’s initial fingerprint software had bugs which was fixed subsequently. There are so many other features in S5. Some of them have become so standard that they are not review worthy!  e.g., Infrared for wireless remotes, GPS etc. GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up).To give a sample, I tried following apps and they just worked awesome.Amazon Mobile, Androidify, Angry Birds (multiple themes), Asphalt 8, Box, Chrome, NAVIGON (from Garmin - offline maps), TOM TOM, , Google Navigation/Earth/Maps, Google Currents (nice way to read News), Google Drive, Ebay, Linkedin, Google Music, Tapatalk (awesome forum browsing app), Microsoft One Note (legacy docs, skydrive of 25 GB is good), Microsoft Office, (yes they hve for Android!), Subsonic Music Streamer, TweetCaster Pro for Android (excellent twitter client), Twit.Tv, Trigger, Google VoiceAsk questions, the review cannot do justice to Galaxy S5. I will be glad to answer any questions within 24 hours.", "Date": "April 11, 2014"}, {"Title": "Went from S3 to S5", "Author": "Mahogany Brown", "ReviewID": "R16HF04OP1CR9G", "Overall": "3.0", "Content": "The phone is cool. My S3 was perfect and I would have held onto it for a lot longer if the power button hadn't gone out on me (had it a little more than 2yrs).  The only thing that has really been an upgrade for me is the quick view for texting, no need for a third party app. Other than that I don't feel like there are any major improvements or anything new that I can't live without.  The S5 is supposed to be faster but I feel it's slow when moving through emails and sometimes opening from the lock screen.  If I was waiting for this phones release and expecting something spectacular I would have been sorely disappointed.  But with that said it's a great phone, it has everything I need along with A LOT of things (pre-installed apps) that I don't. I loved my S3 so now having the S5, I'm sure I will continue to be a satisfied Galaxy user.", "Date": "May 7, 2014"}, {"Title": "A Samsung Evolution", "Author": "Johnny Saigon®", "ReviewID": "R21NU4933EWGQW", "Overall": "5.0", "Content": "First off, I am not a professional reviewer, nor am I employed or compensated by Samsung or any other company. Instead of boring you with facts - which you can find anywhere on the Net - I will just give you some real-world impressions on how it looks, feels, and runs. With that out of the way, let's get to the point and the nitty gritty, shall we?* THE SCREEN - that is the very first thing you will notice when you look at the S5. Samsung has found its niche with AMOLED screens, which are BRIGHT & SATURATED. Everything almost literally jumps out at you, and sometimes even too much so. I had to switch to the \"natural\" setting, as the \"vivid\" and even \"standard\" profiles are too saturated(and FAKE) for me. It's better as a demo unit to draw you in, but for everyday use, I recommend switching to the natural profile.FACTS: The Galaxy S5 has a 5.1-inch Super AMOLED capacitive touchscreen with Full HD resolution - 1080 x 1920 pixels or ~432 ppi pixel density, plus Gorilla Glass 3 to protect the screen from scratches.* The Look - the S5 has a more squared-off edges look than the S4, which is more squared off than the S3, but all three are not as angular as the S2. In terms of roundness-to square-ness, it goes from the S3 - S4 - S5 - S2 (the original S just looks like an iPhone 3GS). Check out my images for an easier comparison. The S5 is the tallest and widest, but not the thickest of the Galaxy S's. The best thing I can say about this is it's an evolution. Beauty is subjective, so judge for yourself. The front side is almost the same as any other Galaxy phone: You have the physical Home button, flanked by the \"back\" and \"menu\" capacitive buttons. Probably the most improved aspect of the design is in its functionality - it is now dust-proof, and water-proof up to 3 feet!FACTS: The dimensions are 5.59\" x 2.85\" x 0.32\"(142cm x 72.5cm x 8.1cm), and weighs 5.11oz(145g).* The Feel - Samsung has taken a lot of flack for making the Galaxy S line so cheap looking and feeling with its plastic bodies, for being the top Android phone maker. HTC has been known to have the best craftsmanship with their all-metal One phones. Perhaps Samsung feel they are so dominant that they don't have to spend more to mass-produce metal phones, but since they don't want to come off as too arrogant, so their compromise is a dimpled, faux-rubber backside like the Nexus 7(2012) and its very own Galaxy Note 3. It definitely gives a better feel - it doesn't slip and slide in your hands or pockets anymore - but it cannot compare to the feel and craftsmanship of the HTC One(both the m7 and m8). It is on the right track though, so let's hope that rumored luxury \"F\" line or next year's S6 will continue to get better.* How it Runs - This phone is fast, fast, FAST! With a 2.5gHz Snapdragon 801, it has the fastest processor out there right now. It terms of real speed, I cannot say if it is faster than the HTC One m8 or the Sony Xperia Z2, but it is definitely up there. When you touch an app icon to launch it, it launches nearly instantly. To really see how this phone flies, just open the gallery app and scroll through all your photos and you'll see what I mean. Usually the gallery is where most phones stutter as it tries to load all your photos and albums - but NOT the S5!* The Camera - FINALLY! Samsung has decided to make a decent camera, and not just as an afterthought. This 16mp camera is really awesome, so much better than the S4. I would always get washed out images with my S3/S4/Note 2, but with the S5, it actually looks like it's from a decent point-and-shoot dedicated camera with crisp, bright, and saturated images. Low-light shooting is also vastly improved, although not as good as the new HTC One m8. 16mp means 5312 x 2988 -resolution images, so you can actually blow them up or crop them down without fearing the dreaded pixelation monster. There are a myriad of other cool and useful camera features that I will save for you to find out(like macro and \"Google Street View\" modes :]). And lastly, the focus is quick, quick, QUICK! Nearly instantaneous focus allows you to capture those hard-to-capture moments easier. A definitely thumbs up to Samsung for paying attention to the camera and its functions.* Software - I'm still trying to figure out everything, as there is A LOT of stuff under the hood. Samsung's TouchWiz user interface this time around is A LOT less intrusive though, as much as can be without being totally stock Android, I guess. The layout and iconography are flatter and simpler, and for the better in my view. There is also a new sensor on the back, just beneath the camera lens. It is a heart-rate monitor/pedometer, and it comes with its own health app called S Health. There is a new battery-saving mode which can save you precious minutes when you're caught in a bind. All in all, I think this version is a lot nicer-looking, more responsive, and better than the precious S phones.The ultimate question is whether this phone is a worthy upgrade over the S4. As my review title suggests, it is an evolution, an incremental upgrade over the S4. So with that said I cannot whole-heartedly recommend it if you already have a good phone, or even over the S4. But I do feel this upgrade is more vast and much better than from the S3 to the S4, so in that sense Samsung has done a much better job this year. If you are switching from an older phone that was made at least 2 years ago, then I would tell you jump right in and try the S5 - it will not disappoint you. But for those with already a good phone, and/or say you just finished year one of your 2-year contract, then I would say think hard before you make the leap. For my money, I think the Note 4 and S6 will be the bigger upgrades more worth waiting for.", "Date": "May 7, 2014"}, {"Title": "Love it", "Author": "Jacquita Davis", "ReviewID": "R3DG3GO11DMVB9", "Overall": "5.0", "Content": "I love my Samsung Galaxy S5.  Every day I am learning something new.  This is my 2 Samsung phone and will continue buying them.", "Date": "May 6, 2014"}, {"Title": "solid phone", "Author": "Rod in Phx", "ReviewID": "R2WERCKFLHPZS9", "Overall": "5.0", "Content": "had a note 1 for two yrs - excellent phone, upgraded to a note 3....kept that for about 4 days before returning it back to at&t.; Solid phone but a tad bit too large for 1 hand functionality. Now I have the S5....Pro's:excellent display, clearer, vivid colors brighter than the note 3.ultra power saving mode, lets phone last some 8 days using basic functions.interface: smooth, very user friendly.camera: best pics I've seen taken from a phoneCons:expesnsivewouldnt consider it a \"gamechanger\" compared to the S4Overall, if you're on the fence about getting a new phone or buying this one....you won't be disappointed in purchasing the S5.", "Date": "May 6, 2014"}, {"Title": "Improvements across the board", "Author": "Dan", "ReviewID": "R2WLCUU0S175QU", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo44W5AMDYM26ZembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo44W5AMDYM26Zrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo44W5AMDYM26ZchiDiv\").innerHTML = document.getElementById(\"cv_mo44W5AMDYM26ZhiddenPre\").innerHTML;\n};\ncv_mo44W5AMDYM26Zrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo44W5AMDYM26Zso;\t   \n\n\nfunction cv_mo44W5AMDYM26ZloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo44W5AMDYM26Zso = new SWFObject(swfLocation, \"cv_mo44W5AMDYM26ZAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo44W5AMDYM26Zso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo44W5AMDYM26Zso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo44W5AMDYM26Zso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo44W5AMDYM26Zso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo44W5AMDYM26Zso.setAttribute(\"height\", swfHeight);\n          cv_mo44W5AMDYM26Zso.setAttribute(\"width\", swfWidth);\n          cv_mo44W5AMDYM26Zso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo44W5AMDYM26Zso.write(\"cv_mo44W5AMDYM26Zflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo44W5AMDYM26Z', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo44W5AMDYM26Z';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo44W5AMDYM26Z', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo44W5AMDYM26ZloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo44W5AMDYM26Z\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3TZTGOHPDDA8K\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3TZTGOHPDDA8K\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2WLCUU0S175QU\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3TZTGOHPDDA8K/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo44W5AMDYM26Zduration')) {\n      document.getElementById('cv_mo44W5AMDYM26Zduration').style.display='none';\n    }\n    cv_mo44W5AMDYM26ZloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo44W5AMDYM26ZloadSwf(movieID, playerVersion) {\n   return _cv_mo44W5AMDYM26ZloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo44W5AMDYM26ZnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo44W5AMDYM26Z', 0, h);\n}\n\nfunction cv_mo44W5AMDYM26ZresetPlayer(w,h,bw,cc) {\n  cv_mo44W5AMDYM26ZnewHeight(h);\n\n  cv_mo44W5AMDYM26Zso.addVariable(\"resetBandwidth\", bw);\n  cv_mo44W5AMDYM26Zso.addVariable(\"cacheCode\", cc);\n  cv_mo44W5AMDYM26Zso.setAttribute(\"height\", h);\n  cv_mo44W5AMDYM26Zso.setAttribute(\"width\", w);\n  cv_mo44W5AMDYM26Zso.write(\"cv_mo44W5AMDYM26Zflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo44W5AMDYM26ZRollOverImg = new Image();\ncv_mo44W5AMDYM26ZRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81fF542XVnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo44W5AMDYM26Zpreplay = document.getElementById('cv_mo44W5AMDYM26ZpreplayImageId');\nif (cv_mo44W5AMDYM26Zpreplay) {\n  cv_mo44W5AMDYM26Zpreplay.onmouseover = function() {\n    cv_mo44W5AMDYM26Zpreplay.src = \"http://ecx.images-amazon.com/images/I/81fF542XVnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo44W5AMDYM26Zpreplay.onmouseout = function() {\n    cv_mo44W5AMDYM26Zpreplay.src = \"http://ecx.images-amazon.com/images/I/81fF542XVnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo44W5AMDYM26Zpreplay.parentNode;\n\n  var cv_mo44W5AMDYM26ZcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo44W5AMDYM26ZcurrentClick) {\n      return cv_mo44W5AMDYM26ZcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 8:56 MinsEverything on this phone is better than the Galaxy S4. The internals, the camera, and the build quality. The phone is a little bit larger and harder to hold than its predecessor so if you have small hands you might want to hold the device before purchasing it.Check out the video for an overview of the device and its features! Make sure to check out the beginning of the video on the DarGadgetZ youtube channel since I can't upload videos longer than 10 minutes.", "Date": "April 13, 2014"}, {"Title": "I love this phone! But...", "Author": "Michael Johnson", "ReviewID": "R37B70UUSYKNN2", "Overall": "5.0", "Content": "Apps: I recently upgraded the the S5 from the S3. My S3 is running the latest version of cyanogenmod. With this in mind, I have noticed very little difference in the speed of apps compared to my S5 which is still running the stock ROM.Screen: The screen is larger but it isn't something to get worked up about. This makes the iPhone 5(any model) feel so much smaller in my hands when I play with a friend's phone.Battery: I have noticed better battery life on the S5. I have been using the same apps, checking the phone often, and leaving all wireless services on and have been able to go from 6am to midnight with only needing a short charge in the middle of the day.Fingerprint Scanner: I absolutely do not like this system that Samsung has decided to use. First, you must swipe your finger straight down and must use the entire pad. It is very awkward to do this holding the phone with one hand in a \"natural\" position. Fruthermore, if you have a case on your phone, it is practically impossible to use the scanner. I have a Pelican case on mine (similar to the Otterbox defender series) and can sometimes get a correct read if I use my off hand to hold the phone while the other swipes. This means the scanner is useless for me personally.IR: I really enjoy this feature! With one remote and multiple people in the house, the TV remote is often misplaced. With the IR blaster I can just sit down and not worry about trying to find the remote in the cushions.Heartbeat Monitor: This feature takes a few tries to get used to but seems to work well once you get the hang of it. You want to just lightly let your finger rest over the scanner and you should get a result every time. I have had results be as far as 10bmp off within a matter of seconds of each other. However, I would assume you are not wanting to purchase this device because you need a super accurate heart monitor.USB 3.0: USB 3.0 is amazing! The charging port on the S5? Not so much. Due to the increased water resistant capabilities, the S5 comes with a charging port cover. This cover tends to be in the way when I try to plug my phone in at night and even more so when a case is on the phone. I am also still using a micro USB charger (it is already in place and routed perfectly on my nightstand). This tends to be an issue, esspecially in the dark, as it is not always easy finding the right spot the micro charger plugs into. Once in, the phone seems to charge at the same rate as the S3.Overall: I really like this phone and do not regret this purchase even though it may seem I have nothing but complaints about it. I chose the S5 over the 5s due to OS restrictive apps that I use (such as Tasker). I chose the S5 over the M8 for a few reasons. Firstly because I have the ability to remove the back cover and change out the battery. While I have never needed to actually replace a battery on any android I have owned, I have needed to remove it on occasion when tinkering with rooting and such. Secondly, the M8 does not include Qi charging. Nor does the S5, however, there are kits you can order that will give you Qi ability underneath the back cover with the S5 (S4 and S3 as well). I have ordered one of these kits due to the charging port of the S5. The S5 is another great Samsung mobile device and I expect it should last me until my next upgrade date.", "Date": "April 27, 2014"}, {"Title": "Most fantastic phone ever!", "Author": "IL", "ReviewID": "R2339RUGQ8JCP5", "Overall": "5.0", "Content": "I love the samsung galaxy s5! Although some parts of it didn't live up to the hype, such as the camera, overall it's an amazing phone and I love it!", "Date": "June 9, 2014"}, {"Title": "great", "Author": "g", "ReviewID": "R1XW2E4RHH1OJU", "Overall": "5.0", "Content": "great smart phone that has all the features necessary in the mobile world! You can do more than you can imagine.", "Date": "June 7, 2014"}, {"Title": "Nice and pretty cellphone", "Author": "Moien", "ReviewID": "R1ZSHHBZTH72OF", "Overall": "5.0", "Content": "I like it in almost all the ways.I think, they cannot produce something that satisfies everyone 100%.I cant see any problem with the hardware.", "Date": "June 5, 2014"}, {"Title": "Sound doesn't work on normal call, on when on speaker", "Author": "Mark", "ReviewID": "R1A51FHDEAHCRD", "Overall": "1.0", "Content": "I have had mine for a week and the call sound and speaker have stopped working. When I put it on speaker phone both work fine. I read on GalaxyS5Guide.com that multiple people are reporting the same issue. Very disappointing.", "Date": "June 3, 2014"}, {"Title": "Excellent Phone", "Author": "Paula C.", "ReviewID": "R2F291S2X56WYA", "Overall": "5.0", "Content": "Have had this phone for two months. Prior to this phone, I had a Galaxy S2 since 2009. The speed of transmitting data is remarkable. Camera takes excellent close-up pictures. Have not mastered distance with photos, but haven't really worked much with the camera. I had no difficulty in setting-up the phone to meet my needs. The settings are presented differently than my past phone, but still easy to maneuver. There was one instance, I inadvertently clicked a setting that was influencing my screens. Had to call Samsung technical support. The tech was extremely kind, patient and knowledgeable. He also helped me with other \"bells and whistles\" that were unfamiliar to me. Probably, spent 35-40 minutes discussing my needs. I would recommend this phone on Samsung's support service alone. Other features that stand out are:  it's LONG BATTERY life; Plus, a 30% battery life lasts forever in the \"ULTRA POWER-SAVING MODE\".  Have not had good luck with the fingerprint scanner. Occasionally it will recognize my print, but after 5 swipes...your out. Must put in pass word. For me, just as easy to start with the password. Although I don't have a need for the \"HEALTH APP., it works well. I also enjoyed the voice to note and voice to calendar. It accurately understands my speech and voice. Would certainly recommend this phone. Probably will have it for many years to come.", "Date": "May 30, 2014"}, {"Title": "great choice!", "Author": "Jeriel", "ReviewID": "R1U69B4NXC1W8Y", "Overall": "5.0", "Content": "Love it ! You will absolutely enjoy this phone. Everything you need, right here!  Very durable and fast! No wonder its the best phone on the market!", "Date": "May 27, 2014"}, {"Title": "Great phone!", "Author": "Alan Cohen", "ReviewID": "R1AVJY09A3K3JA", "Overall": "5.0", "Content": "Best android phone yet!I've owned the Motorola Atrix and the HTC One...this is easily the best of the bunch!", "Date": "May 27, 2014"}, {"Title": "overall close to perfect", "Author": "NOFATCHICK1", "ReviewID": "R1NWAT41CCOD5A", "Overall": "5.0", "Content": "This phone is the best phone out on the U.S currently imo amazing camera and good interface with high end specs this phone can do it all, all while being ips 67 certified", "Date": "May 24, 2014"}, {"Title": "Great Phone", "Author": "Happy Shopper", "ReviewID": "R3KC9RW3NAF3X9", "Overall": "5.0", "Content": "I picked this phone up on release day and haven't been disappointed. The battery life is amazing and so is the screen. Although it is much brighter to me (even when I have it dimmed) than the S4 was. The first day I had it I did get a headache from the screen but my eyes have since adjusted to the difference.The shutter time on the camera is lightening fast and the pictures are great.I will say the white phone has the same white face as the S4 but the backing is an off white almost like a light champagne, I really like the feel of it much better than the S4. You won't have any regrets!", "Date": "April 14, 2014"}, {"Title": "Hate it!", "Author": "Yehezkel Yosef", "ReviewID": "R3DI8C875UQJP7", "Overall": "1.0", "Content": "Hate it! Hate it! Hate it!!!!!What a stupid design! My galaxy S5 has enough useless features to fill days of exploration yet the home button wakes the phone and there's no way to disable this feature. Every time the phone is in my pocket, the home button inadvertently depresses and wake the phone. Soon after the phone rub against my pants and get unlocked. From there to the misdeal phone numbers to the deletion of important info, the way is very short. I guess it's okay, it only cost $700...I contacted Samsung but they had no help to offer other that going around it by putting a number or pattern lock on the phone. Surly my pants pocket isn't that smart. It's okay for the phone to heat up in my pants and waste battery while the screen is on.Arrgggghhhhhh! you stupid Samsung software engineers! Who the hell is testing your prototypes? We don't all wear suits like you! most of us are a blue collar working class that put our phone in our pants pocket.Please revise software to allow us to disable home button from waking phone up.And NO! I don't wan't to put a code (number, pattern, or unreliable finger print) on my phone. I don't want to see my life waste away on unlocking my phone for every time the screen goes out or with every phone call. I tried it and it suck.If this is not fixed, this is my last Samsung product. Very disappointing...", "Date": "May 30, 2014"}, {"Title": "Downgrade from S3 to S5", "Author": "Craig", "ReviewID": "R2IT0AG7NISZVP", "Overall": "1.0", "Content": "I upgraded from an S3 to an S5.  I had the S3 for several years and was very happy with it.1) The day after I received my phone, I stopped receiving text messages completely.  I worked with the T-mobile rep to rectify it.  I had to do a hard reset on the phone.  Although I never received my missed texts, it seemed to work after that.  I was told that the phones were shipped with faulty software that Samsung was aware of.  Texts have worked fine since them.2) The speakerphone is a half-duplex instead of full duplex.  That means that when the other person was talking or making noise on their end, they could never hear me.  I was never sure if they were hearing what i was saying or if it was actually going through.  For example, if I was talking to someone on speakerphone who was in their car and had a lot of noise on their end, they would never hear me.  As someone who uses speakerphone a lot, this is a major problem.  My Samsung S3 was full duplex.  I never had this problem.3) My email never properly synced with my server.  If i looked at emails on my computer, they would still show as unread on my phone even AFTER I hit the sync button.  I would delete emails on my phone and after I synced, they would re-appear.4) I would choose a specific ringtone for different friends and it would only work SOMETIMES.  One time I might get the ringtone that I specified and another time I might get my generic ringtone.  No rhyme or reason.5) Because I live in NYC, some subway stations have cell service and others do not.  If I sent a text when I didn't have service, it SHOULD simply send when I got above ground or to a station that had service.  It wouldn't.  The text would just sit there and never send.  I would have to copy/paste it to a NEW text and send again.6) I used the map service to find a friend who was several blocks away.  I had an address and when I put it into the phone, it sent me in the complete wrong direction.  In fact, the map started spinning as if it had no idea how to locate where I was or where I was going.7) There was a serious lag because of Touchwiz.  It's almost as if the phone is thinking about what it needs to do.I'm being shipped a new phone but I'm not sure if it will fix ANY of these problems. If it doesn't, I'm going to have to choose a new one. Samsung REALLY rushed this one out.", "Date": "May 8, 2014"}, {"Title": "AT&T; are awful, Samsung are stupid, and Google Sucks", "Author": "Edwin G. Hartnell", "ReviewID": "R1GBDV29WFWB1D", "Overall": "1.0", "Content": "After you read this review you are probably going to think the author (me) is half-crazy and I've got nobody to blame but myself. Probably true. But in my defense I am merely a consumer and a first-time Android customer.My problem is that I needed to buy an English phone that worked in China (where I live). Yeah - I could have bought the exact same phone in China, but all the menus and apps would have been in Chinese, and the app payment system would have been linked to the Chinese banking system which I, as a foreigner, don't really have access to. I was really excited about the new Samsung Galaxy S5 and thought the blue phone looked cool, so I waited and waited and waited until it was launched.Launch date arrived and at 12:01 AM I was on Amazon ready to buy (it was lunchtime in China). Nothing. Ok - yeah - there were the Galaxy S5 phones that you could buy from AT&T; but they had already been posted on Amazon for weeks. Nothing had changed, and the blue phones that had been plastered all over were absolutely not available. What had happened to them? A complete mystery!This is why I think Samsung are stupid - their big \"launch\" was, in fact, marked only by the complete absence of any marketing activities. Apple's marketing is amazing. But what's even more amazing is that companies like Samsung can't even copy the basic things that Apple do so well. Leading up to the launch Samsung leaked information like a sieve. But after the launch Samsung eliminated all communication. The result was always going to be highly disappointed and frustrated customers!After weeks of more waiting I decided to take the plunge and buy and AT&T; \"no contract\" white phone at the full price of $699. I didn't really want AT&T; to be involved, but it seemed like it was my only option. It was, after all, a \"no contract\" phone. It just appeared as if Samsung couldn't distribute the phone by themselves and needed AT&T;'s help. My friend then hand-carried the phone over for me and placed it in my tingling hands. But the first message that popped-up on the screen was \"Enter Your SIM Unlock Code\".I contacted AT&T.; They explained it like this: \"you don't need to have a contract but you do need to have a paid AT&T; service agreement\". I challenged them: \"but if I have a paid service agreement then that would mean that I have a contract\". I went to law school so I thought it was a pretty clever argument. But I could not prevail - apparently there are legal exceptions for telecommunication monopolies. This is why I think AT&T; are awful, and why I am begging you never to do business with them!But I took my half-bricked phone and persevered. I wouldn't be able to make phone calls, but at least I'd be able to play Angry Birds.Enter Google. I searched the Google Play Store in vain before finally trying to download Angry Birds from the Rovio website. But after sending me back to Google this message appeared: \"This app is not available in your country\". Definitely not true as I had Angry Birds on my old iPhone. So it must just be that Google sucks. Google, for reasons that are just inexplicable, do not want me to buy Angry Birds or, in fact, any app that requires a payment (yes - I was logged in with a credit card). Why, why, why? I can think of a few evil reasons but I certainly can't think of any good ones.Then, out of nowhere, Samsung start selling \"international\" blue phones on Amazon that are $50 cheaper than the AT&T; phones.I really do hate you all!", "Date": "May 20, 2014"}, {"Title": "Lousy sound out", "Author": "roaeja \"Hey you!\"", "ReviewID": "R2PXG1WJLA7KI0", "Overall": "2.0", "Content": "I brought the latest and greatest from wonderful ATT, very nice people and will help you with any problems...I send it back, poor sound quality.  Sounds like people are in a barrel and the back vibrates, if you have it turned up to loud.Plus, no zoom!  I have a Note II and plenty of zoom...I'll wait for Note IV!", "Date": "April 13, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Samsung Galaxy S5, White 16GB (AT&T;)", "ImgURL": "NULL", "ProductID": "B00IZ1XJ3Q"}}