{"Reviews": [{"Title": "Samsung Galaxy S Duos 2", "Author": "Sergey", "ReviewID": "R2UUU7ASHF22MJ", "Overall": "5.0", "Content": "I was a bit skeptical about buying a phone off of amazon but when I received the phone, I did not have any problems with it. I was able to take the sim card (t-mobile) out of my old phone and put it into this one and it worked without any issues. If you are looking for a good phone, you should definitely consider this seller.", "Date": "April 30, 2014"}, {"Title": "this is my opinion", "Author": "VE421556 S.", "ReviewID": "RT3E2TJU61H74", "Overall": "4.0", "Content": "It's a nice product, totally unlocked, i'm from venezuela, I bought this smartphone because it is cheap, and it can use two sim card at the same time. Before these I had an S duos and I liked it. This S duos 2 is more fast and it has an android system more new than the S duos.", "Date": "April 23, 2014"}, {"Title": "I love it but it has a few details", "Author": "Georgina Peña", "ReviewID": "R243VCS976LU8U", "Overall": "5.0", "Content": "It works excellent, the touch screen i love it, it s very fast...it has all I need, read and edit text, wi fi, and it works with the regular chip so it s very usefull to international people that want to bring it back to their countries. The only thing that I don t like its the resolution of the camera and the long flash that burn your eyes.", "Date": "May 23, 2014"}, {"Title": "good very good", "Author": "Andres fernandez", "ReviewID": "R3ISK98YMVAUKV", "Overall": "5.0", "Content": "Great, I love the computer, it works perfectly, I am satisfied with the purchase, came at the right time. good.", "Date": "June 10, 2014"}, {"Title": "No 3G on Phone", "Author": "Francis Kwajan", "ReviewID": "R2SPQCX2VZ9GAM", "Overall": "2.0", "Content": "There is no 3G as advertised. It will not even work on 2G and therefore I cannot use internet on it.", "Date": "May 31, 2014"}, {"Title": "Very good phone", "Author": "Edward Graper", "ReviewID": "R1N7OP145QIK6W", "Overall": "4.0", "Content": "This phone does all the basics very well and the dual SIM is excellent.  It's not leading edge. It doesn't have the Samsung face ID to keeping it on when you are looking.  The case is a bit flimsy,  The back can pop off.  I've taped it.  I've not yet used any of the \"smart\" features so can't speak to them.", "Date": "February 20, 2014"}], "ProductInfo": {"Price": "$161.94", "Features": "Dispaly- 4.0 inches TFT capacitive touchscreen, 16M colors (~233 ppi pixel density), 480 x 800 pixels\nMemory- 4 GB (1.8 GB user available), 768 MB RAM, Expandable microSD, up to 64 GB\nCamera- 5 MP, 2592х1944 pixels, autofocus, LED flash, Geo-tagging, Secondary- VGA\nOS- Android OS, v4.2 (Jelly Bean), Dual-core 1.2 GHz\nBattrey- Li-Ion 1500 mAh battery, Talktime- (2G) / Up to 8 h (3G), Standby- (2G) / Up to 280 h (3G)", "Name": "Samsung Galaxy S Duos 2 S7582L White Unlocked - International Version/Warranty - Smartphone GSM 850/900/1800/1900 MHz, 3G 850/2100 MHz", "ImgURL": "http://ecx.images-amazon.com/images/I/41BcI%2B8wKIL._SY300_.jpg", "ProductID": "B00I0ECBG4"}}