{"Reviews": [{"Title": "Some of the features of Galaxy s4 for LESS money!!!", "Author": "iluv2workout8", "ReviewID": "R4RFTVWJDDAVY", "Overall": "5.0", "Content": "This Samsung Galaxy Ace 3 is a GREAT phone! (Some) of the features of the S4 for why less money upfront and NO contract. Nice display fast Hspa+ data speed with my AT&T; micro sim card. Call quality is very good and the operating system is Android 4.2.2. Got this phone 24 hours after I ordered it with amazon prime membership. Seller: Big box super store I give 5 stars! Would recommend this phone!", "Date": "October 11, 2013"}, {"Title": "exceeded my expectations", "Author": "ADAIRETH BARRIOS", "ReviewID": "R38KUICGHZ5WE1", "Overall": "5.0", "Content": "it's is sophisticated and simple at the same time. It's practical and pretty, I love it very much. thank you", "Date": "October 17, 2013"}, {"Title": "Dual SIM", "Author": "José Gregorio Pérez", "ReviewID": "R1KWXLNUZIC0EA", "Overall": "2.0", "Content": "I want a smartphone that dual sim, and this phone in your specifications saw that dual sim and now dont have it", "Date": "January 14, 2014"}, {"Title": "bad description", "Author": "gerardo", "ReviewID": "R2ZOQX2L7389WL", "Overall": "2.0", "Content": "bad description of the article published on the website of the seller. The team says it's 3G Band 850/1900 Mhz and cell sent me does not work with those bands. try to replace the item and the seller does not accept replacement. Muya bad the definition of the part description. Spanish language brought not just 6 languages ​​and Spanish is not updated. would not buy again with this seller.", "Date": "October 18, 2013"}, {"Title": "excellent", "Author": "Sam andueza", "ReviewID": "R145JEFGIM5XQS", "Overall": "5.0", "Content": "amazing product with a long distance connection falls short is very good very interesting I loved the product and recommend it highly", "Date": "December 26, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00I115OZQ"}}