{"Reviews": [{"Title": "Samsung hit the mark with this flagship.  All other flagships are a step behind.", "Author": "D. Miyao", "ReviewID": "R46GMOKBNCHBG", "Overall": "5.0", "Content": "A little background on my love of smartphones - I used to be a major Apple fanboy from the first iphone to the iphone 5.  Steve Jobs is still my hero.  I made the switch when the Galaxy S4 came out, then moved to the HTC One, LG G2, Note 3, and now the Galaxy S5.  I use two phones, one for work and one for personal use.  I spent a decent amount of time with all of them and can say that most people would be happy with each and every flagship for daily use for 1-2 years at a minimum but most people come to read these reviews for the small details that make the major differences between just \"okay\" with your phone or \"completely happy\" with their device.  I won't list out the specs of the phone since that type of info is listed everywhere.  But this phone as well as the others listed here are spectacular at being fast, having good to great battery life, and all have good to great cameras.  Probably the most polarizing topics of phones these days is the aesthetics, mainly due to the fact that hardware seems to have outpaced the software which means manufacturers cant really make phones noticeably faster than the previous generation.  Okay I'll get to the review.Metal vs. Plastic -  The HTC One and the iPhone are made from mostly aluminum.  Aluminum without question looks fantastic on phones.  The colors also look much better on aluminum because they can be anodized giving them a rich and even color that just look great.  The main problem with metal is, sure it looks great on day one, but the material is so hard that is super easy to scratch and nick without ever dropping it.  I am the type of user who hates cases.  They add thickness and overall just make the phone look ugly, and to top it all off, cases are 40 to 50 dollars for a piece of plastic(major rip off).  I carry my phone in my left front pocket without anything else in there to scratch it.  After a good months use of the iPhone 5 and HTC one, i developed so many nicks and scratches that it really made me question, \"Is metal really so great?\"  The answer is no.  Have you ever seen someone with an uncovered black iPhone?  After 6 months the sides look silver just from normal wear and tear.  Most people who will read this review probably haven't seen an uncovered HTC One mainly because the volume of sales isn't there, but that phone has the same problem.  Sure the metal is gorgeous, but it is only on the first day.  And what is the point of buying a phone for it's looks if you're going to cover it in a PLASTIC case?Plastic - At first try with the S4 and LG G2, I HATED plastic.  The glossy feeling made the phone feel slippery and cheap in my hand.  And to top it off, glossy plastic attracts oil like white on rice, which just makes your phone feel nasty at times(or maybe I just have gross hands which I don't think I do because I am a scientist and wash my hands 10-20 times a day).  But then the Note 3 came out with faux leather plastic.  Sure it's not pretty like aluminum,  but it's light weight, it has a nice texture, it doesn't attract oil, and it doesn't nick and scratch like metal.  Maybe Samsung is onto something with plastic.  Everyone seems so concerned with the way phones look vs how they feel or hold up over time.  I can say without a doubt, my Note 3 looks the same way it did out of the box after a few months of hard usage.  For the S5 they switched  from the glossy plastic on the S4 to a textured dimpled plastic that feels slightly soft, which I think feels fantastic.  It is slightly softer with a more grippy feel and it doesn't look at all tacky.  I love it.  The phone definitely feels sturdy in your hand.Software - The general perception of Android is that it is harder to use than iOS.  After using iPhones for 5 years(iPads and macs), and now Android for just over a year, I can say that perception is absolutely false and anyone who says it probably has not given Android a fair chance.  In fact, I think Android is easier to use than iOS.  With google now built into the phone, it is always listening.  When the phone is unlocked all I have to say is \"Okay Google\" and I am prompted to give my phone instructions like \"get me directions to the nearest gas station\" or \"call Susie\" and the phone does it.  You dont need to hold the home button to pull up siri or open up a separate app to use this feature which makes it super functional.  I know most people don't use siri.  Siri just isn't that good.  It doesn't understand a lot of words or the search results it brings back are not useful.  Google now works on about 95% of the words I speak and I am a mumbler at times too.  So for my friends who say they can't understand me, well google now can!  To me this is revolutionary.  People called the iPhones revolutionary because they added value to your everyday life.  People think, \" can you imagine what it would be like if I couldn't have email 24/7 or internet access 24/7?\" which is what made the iPhone revolutionary.  It changed the way we did things.  Having a phone always ready to hear your commands is revolutionary.  When you're in the car and can't touch your phone, voice control is a huge benefit.  Or when you're cooking and want to send a text without washing your hands you now have the ability to send a text hands free.  Other software advantages.  iCLOUD SUCKS.  EVERY iPhone user at some point says, \"oh crap, I am out of memory.\"  Well the reason is no one really knows how to use iCLOUD and end up leaving everything on their phone until it fills up.  Google's back services allow for any file type to be backed up and you can even view the pictures stored in the cloud.  They just aren't downloaded on your phone until you hit download.  It's a huge advantage over iOS and I love it.  I never back my phones up to my computer anymore to make space on my phones.  As for the rest of the software it is very easy to use and gets better with every update.Battery Life - battery life from my experience from worst to best goes in this order HTC One, Galaxy S4, iPhone 5, Note 3, Galaxy S5.  No this wasn't a video loop test, or some other standardized test.  It is my perception of using each phone for a minimum of 3 days as my primary phone which means I was using the phones for email, text, talking, pictures, youtube, movies, and games.  I just got back from a 2.5 day camping trip and didn't charge the S5 one time and came home with 50% power in reserves.  Absolutely AMAZING battery life.  Another nice feature to have is the removable battery.  Before I had this feature with the Note 3, I thought it was a dumb benefit but now with a spare battery I can go from 1% to 100% with the removal of the back cover and swap of the battery.  No more being tethered to a wall to get back to 30% before I can use my phone again.  I love pointing this out to iphone users who are stuck to walls with their chargers(not to mention those stupid 20 dollar lightning cables that break every 6 months).  The S5 also has USB 3.0 with fast charging built into the processor, so you can easily get a 90% charge in less than an hour.  SO for battery life, and for the ability to swap batteries, the Galxy S5 is best in class by a long shot.  Spare batteries MSRP are 39.99 but on amazon you can buy a generic which works perfectly fine for 20 dollars.Screen color and resolution - A year ago I hated AMOLED screens.  It is the screen that Samsung uses in their displays vs the others who use LCD.  I'm no expert in display technology but a year ago AMOLED screen were cartoonish looking.  It drove me nuts.  LCD screen have a much more accurate color representation.  But with the Note 3 and now the S5, Samsung definitely has solved that problem.  They have adjustable settings for your screen similar to a TV screen.  The also gets very bright and dark which means in sunny San Diego I have no problems seeing my screen in full sunlight and at night when I am in bed I am not squinting my eyes because my phone is too bright.  It definitely gets darker than typical LCD screens.  Resolution, the S5 is top notch.  Only the HTC One bests it with pixels but you can't tell the difference between the two.  When an iPhone user looks at the S5, they say'\"Wow, it looks so clear.\"  Well that is because the S5 has a much higher resolution.  The screens speak for themselves.Camera - The S5 camera kicks butt.  It has a new feature where you can make part of the picture blurry and the other part clear.  It is really neat and I used this feature often on my camping trip.  This camera in practice is better than the G2, HTC one and even Note 3.  i would say it's equal to Apple's camera but I also think that is Apple's best feature.Removable storage - Only Samsung devices, Sony, and the HTC One M8 have removable storage.  Throwing a 64gb memory card in my phone gives me full confidence I can take as many pictures as I want or store as much music as my heart desires without sacrificing other things for them.  My S5 came with 16gb, but now has 80gb of memory to use, although about 6gb is used by the software.  The additional memory was about 40 dollars vs an iPhone memory upgrade to 64gb would cost an additional 200 dollars.  The winner here is rather obvious.IP67 water and dust resistance rating - basically this means the phone is dust proof and water resistant up to about 3 feet of water for 30 minutes without risk of damaging your phone.  Only the Sony flagship models have this feature built into their phones and they were the first to do it.  Basically this rating means, you can drop your phone in the toilet (gross) and it will survive, or you can take it in the hot tub or bath tub and not worry if you will kill your phone or not.  In my case, in San Diego, I can take it hiking or to the lake without worry of damage.  IP67 is not rated for salt water but having that feature means I can probably take my phone to the beach and a few splashes here and there won't kill my phone.  Also, if your phone ever does get dirty, you can just wash it in the sink.  It's really a fantastic feature to have built into your phone especially if you have kids who tend to get stuff wet and dirty.In summary, all flagship phones are great.  Some have a few features like LG with their \"knock on\" code where you can unlock the screen with a double tap.  Or the HTC One with it's spectacular speakers, and the Iphone with it's beautiful design.  The S5 at this very moment is the best phone on the market.  We are fortunate to live in a time with such fierce competition that all phones are great but it's the little details that make the S5 so much better than the rest.  You really cannot go wrong with this phone unless you just hate the size and love your small 4 inch iphone screen.  But you really can go right in so many more ways than the other phones.  If you have any questions for me please post them.  Ill continue to add updates as I see necessary.", "Date": "April 14, 2014"}, {"Title": "An Evolutionary Step Forward That Still Offers Plenty To Love", "Author": "JJG", "ReviewID": "R3IT4UH9I74A0I", "Overall": "5.0", "Content": "The Samsung Galaxy S5 offers more of an evolutionary step forward in Samsung's S series smartphones than a revolutionary new phone. There are plenty of new features and advances with the S5 but those who already own a S4 likely will not be rushing to get the S5. I'm coming from an iPhone 4S so the S5 offers a lot of new features for me and provides plenty to love.FEATURES & UPGRADES FROM S4:1.  SIZE: The S5 is slightly larger at 5.59\" x 2.85\" x 0.32\" and weighing in at 5.11 oz compared to the S4 at 5.38\" x 2.75\" x 0.31\" and weighing at 4.59 oz. The S5 is lightweight and feels good in my hand.2.  DURABILITY: If there is one new feature on the S5 that is a game changer it's got to be the IP67 certification. IP67 certified means the S5 has total protection against dust and can survive being underwater for up to 30 minutes at a depth of 1m or less. In order to be protected against water the S5 has a little plastic plug to cover the charging jack on the bottom of the phone. This needs to be in place and the back must be properly snapped into place to prevent water damage. I'm not about to test the IP67 certification however the guys at TechSmartt performed 2 water tests on the S5 that can be viewed on YouTube. First they let the S5 sit in pool at a depth of 1m for 1 hour, not 30 minutes. Second they sent the S5 through a normal wash cycle in a washing machine while in the pocket of a pair of jeans. In both tests, the S5 survived and functioned perfectly afterward.The durability of the S4 came under fire after many people reported cracked screens after minor drops. Samsung stuck with a plastic back for the S5 but did improve upon the durability of the smartphone. In separate drop tests again conducted by TechSmartt, the S5 faired better than the S4 and better than the iPhone 5s. However the S5 didn't fair as well as the durably built HTC One M8. The tests are a decent indication but should also be taken at face value since there is no way to ensure each phone fell the same way.3.  SCREEN: The S5's new screen is nothing short of stunning. The S5 screen is 5.1\" which is slightly larger than the 5.0\" screen on the S4. The resolution remains 1080 x 1920 pixels so the pixel density is slightly less at 432 ppi. The screen does look noticeably better than the S4's screen and has richer colors, better contrast, whiter whites, and blacker blacks than my iPad 3 when viewing identical images.Displaymate who extensively tests smartphone screens said the S5's screen is \"the best performing smartphone display that we have ever tested.\" Displaymate's tests indicted the S5 screen is 22% brighter than the S4 and 13% brighter than the Note 3. The S5 also has outstanding color accuracy. In addition it features a Professional Photo Mode that provides an accurate calibration to the Adobe RGB standard, this is a rare feature in consumer displays.4.  CAMERA: The S5 sports a 16MP camera rear camera up from 13MP in the S4. The front facing camera remains pretty much the same at 2.1MP.  The S5's 1/2.6\" sensor is larger being closer in size to sensors from P&S; cameras than smartphones. The AF is also speedier with the S5 due to its hybrid use of phase detection and contrast detection AF. The S5 is the first camera on a smartphone to use phase detection AF, which is commonly found in DSLR cameras. Other smartphones only use contrast detection AF that simply focuses by measuring the contrast between nearby pixels. This type of AF tends to be slower and not work well if shooting in situations where there isn't much contrast. Phase detection AF however focuses by comparing the actual light received by sensors.COMPARING S5 & 5s IMAGES: Comparing daytime images shot with the S5 against images of the same subject shot with the iPhone 5s, the Samsung's images disappoint in spite of being 16MP vs 8MP with the 5s. At 16MP the S5's resolution is 2988x5312. The images are therefore at a 16:9 ratio. The iPhone 5s's resolution is 2448x3264. The images are therefore at a 4:3. When viewing images shot with the iPhone at 100%, they look sharp across the frame, even in the corners. Images shot with the S5 when viewed at 100% look oversharpened and blotchy. The center sharpness is passible but the edges are soft and the corners have absolutely no detail. If downsizing the images from the Samsung S5 so the lower number, 2448, is the same as the iPhone's the center sharpness between the 2 camera's images is almost indistinguishable but the edge sharpness and corner sharpness from the iPhone 5s blows away that from the Samsung S5.COMPARING S5 & 5s CAPTURE TIME: Both the S5 and the 5s are speedy when it comes to focusing and taking pictures. Holding the S5 in one hand and 5s in another, pressing the shutter buttons at the same time, then turning to take a picture of a new subject, pressing the shutter buttons again, and repeating this process several times, the iPhone 5s is a split second faster than the S5. It's not substantial enough to make big difference for most applications but worth knowing. The images from both cameras when doing so were in focus.5. VIDEO: The S5 will shoot 4K videos with a resolution of 3840x2160 compared to 1080P videos with the S4. Videos look great with S5 and the stabilization works very well.  Sometimes when recording the screen will look at little jiggly but in playback the video looks smooth. I have no way to test its 4K capabilities.6.  PROCESSOR: The S5 is a very snappy smartphone. This is due to the new Qualcomm's Snapdragon 801 chip. It features a quad core, 2500mHz processor which speedier than the quad core, 1900mHz processor in the S4.  The S5's memory remains the same at 2GB.7.  STORAGE & EXPANSION: The 16GB S5 from AT&T; has 10.85GB of free storage space on the phone after KitKat and the preinstalled apps. I read complaints from some S4 owners stating that only 9GB was free on their new phone after the OS and preinstalled apps. If that was the case, Samsung/Google/AT&T; trimmed down a bit for this phone.I love that the S5 along with other Android smartphones allow storage expansion through a microSD card slot. This can be used for music, videos, books, pictures, and other files. It is also possible to move downloaded apps, not preinstalled apps, to the microSD card. To do so, go to Settings, Application Manager, SD card, and then select the downloaded app you want to move to the microSD card. The S5 will allow up to a 128GB micro SD card that is double the 64GB with the S4.8. BATTERY & CHARGING: The S5 features a 2800mAh battery which is slightly larger than the 2600mAh battery in the S4. The S5 has good battery life ratings. The talk time of the S5 is rated at 21 hours while the standby time is 16.2 days. Being a new phone, I've been using it quite a bit. Even at that, I find that I only have to charge the S5 every 1 1/2 days. The S5's battery life is significantly better than my iPhone 4s which I had to charge at least once a day and better than my wife's 5s which has to be charged every day. Charging the S5 using the USB 3.0 Micro cable provided, the phone charges at a rate of 1% per minute with it slowing down slightly when the phone hits 80%. I'm able to fully charge the S5 when the battery is at 20% in about 1 1/2 hours.9.  CONNECTIVITY: The S5 features USB 3.0 connectivity for speedier transferring of files compared to USB 2.0 with the S4. It also features wireless AC. Wireless is extremely fast with the S5 if you have an AC router. It is about 4-5x faster than the wireless N on my iPhone 4s.10. HEART RATE SENSOR: One of the more talked about additions to the S5 is the heart rate sensor on the back of the phone. The heart rate sensor seems to be very accurate from what I know about my normal heart rate. I haven't had any wild readings thus far. The phone has simple How To tutorial if using for the first time. The mistake I made the first few times using it was pressing too hard on the sensor. The result was an error message. The sensor only requires a little touch from your finger.My complaint with Samsung's \"S Health\" app which the heart rate sensor is part of is that you are unable to use the heart rate sensor while using the exercise portion of the app. Sadly, that is when I'm most likely to use the heart rate sensor; when I'm running, walking, or hiking. Hopefully Samsung will change this in a future update. If the heart rate sensor is a feature you will use make sure you purchase a case with a large enough opening for your finger to touch the sensor. Some of the cases I've read about have a cut out only the size of the sensor. This makes it extremely difficult to get your finger in the opening in order to touch the sensor.11. DOWNLOAD BOOSTER: One new feature of the S5 that is omitted from the AT&T;, Verizon, and Sprint versions is Download Booster. Download Booster provides simultaneous LTE and Wi-Fi downloading if you need files in a hurry. I have a wireless AC router which provides super fast download speeds with the S5 but it would have been nice to have the feature just in case. If you do want Download Booster you need to purchase an unlocked version of the S5.12. FINGERPRINT SCANNER: Another very talked about new addition to the S5 is its finger scanner to unlock your phone, make payment via PayPal, and purchase content with Samsung services. The S5 requires you to swipe your finger, starting above the home button and moving down through the center of the home button. With the iPhone 5s you simply place your finger on the Touch ID button. The fingerprint scanner works from any angle with the 5s. The design makes the 5s easier to unlock than the Samsung because it can be done with one hand whereas the design on the Samsung requires me to use both hands, one for holding the phone and the other to swipe my finger. With the Samsung you can assign different fingers to perform different tasks, like right pointer finger to make PayPal payment.My wife has the iPhone 5S so I've setup both and unlocked the phones with both. Both are easy to setup. The Samsung allows you to register 3 fingerprints whereas the iPhone 5S allows 5. Here is where I buck the trend of all the tech writers complaining about the reliability of the S5's fingerprint scanner. While I prefer the design of the iPhone's fingerprinter scanner, the S5 more reliably scans my fingerprint to unlock the phone. The only time I've had a problem unlocking my S5 with the fingerprint scanner is while I'm running; I just can't get a smooth enough swiping motion. Outside of running, the fingerprint scanner on the S5 unlocks my phone on the first try 90-95% of the time. I haven't needed more than 2 tries. The iPhone in comparison only unlocks the phone on the first try about 75-80% of the time and sometimes I need 3 tries to do so.13. ULTRA POWER SAVE MODE: This is a great feature to have if your battery is getting low. Switch on the Ultra Power Save Mode to maximizes your remaining battery life. This feature switches to a black and white mode, turning off all colors. It also restricts background data and allows only low power communications like texting, calling, and AT&T;'s internet browser.I've started to use the Ultra Power Save Mode overnight to conserve battery life, no sense in letting the battery drain as the phone just sits there for hours. I still receive texts and calls. After I disable the mode in the morning I have to update my email and weather. Switching to Ultra Power Save Mode, the battery only depletes by 1% overnight! Not in the Ultra Power Save Mode the battery loses 5-15% overnight.INSTALLED APPS:AT&T; Family Map, AT&T; Locker, AT&T; Mobile Locate, AT&T; Navigator, Beats Music, Calculator, Calendar, Camera, ChatON, Chrome, Clock, Contacts, Device Help, Drive, DriverMode, Email, Flipboard, Gallery, Gmail, Google, Google Settings, Google+, Hangouts, Internet, Keeper, Maps, Memo, Messages, Messaging, Mobile Hotspot, Mobile TV, Music, My Files, myAT&T;,  Phone, Photos, Play Books, Play Games, Play Movies & TV, Play Music, Play Newsstand, Play Store, POLARIS Office 5, S Health, S Voice, Samsung Apps, Settings, Smart Remote, Usage Manager, Voice Recorder, Voice Search, Wallet, YouTube.PROS:1. Amazing looking screen. Displaymate says the S5 screen is \"the best performing smartphone display that we have ever tested.\"2.  IP 67 certified. Protection against dust and water immersion up to 1m.3. According to drop tests from TechSmartt the S5 is more durable than S4 and iPhone 5s.4. Professional Photo Mode for screen that calibrates it according to Adobe RGB standards.5. Uses a hybrid between phase detection and contrast detection for accurate and speedy AF.6. Shoots 4K videos.7. Very fast processor. The S5 is snappy.8. 10.85GB of free storage space on new 16GB phone. Allows storage expansion up to 128GB through microSD card slot.9. Heart rate sensor that is easy to use and seems to be accurate. The sensor is good for those who exercise or benefit from closer monitoring of heart rate for health reasons.10. Features wireless AC connectivity. 4-5x faster than wireless N.11. Fingerprint scanner works more reliably for me than iPhone 5s.12. Good battery life. Rated at 21 hours of talk time.13. Ultra Power Save Mode maximizes battery life. Great if battery is running low or for overnight use.CONS:1. Has plastic back instead of more durable aluminum unibody like the HTC One M8.2. Too many cooks in the kitchen. Google, Samsung, and AT&T; have similar preinstalled apps that can't be uninstalled. Each company is obviously fighting for your attention but in the end it creates not as fluid of a user experience compared to Apple which designs the phone and OS and doesn't allow AT&T; to put their garbage on the phone. I don't need multiple ways to check email, play music, watch movies, or get on the internet.3. Disappointing image quality for a 16MP camera. Not as good as the 8MP camera on the iPhone 5s. Daylight images are oversharpened, blotchy, have soft edges, and no detail in the corners.4. Design of fingerprint scanner requires me to use both hands unlike iPhone 5s which I can unlock with one hand.SUMMARY:Samsung's new flagship smartphone the Galaxy S5 is a wonderful phone. I've only had iPhones up until now but was seeking specific features, features that the S5 had. I love having the larger 5.1\" screen. It is fantastic looking, having more vibrant colors, better contrast, and whiter whites and blacker blacks than my iPad 3. Another feature that sold me that the iPhone 5S is lacking is wireless AC. It provides very speedy downloads and internet experience. Of the upgrades from the S4 the IP67 certification and increased durability have to be the most significant. The S5 has very good battery life, is very snappy with its 2500mHz quad core processor, and the Ultra Power Save Mode is a nice addition.While the camera focuses and captures images very quickly, its image quality is disappointing for a 16MP camera. I could do without the bloatware from Samsung and AT&T.; I love that I can cheaply pick up a 32GB microSD card to store pictures, music, videos and even transfer apps onto, something I couldn't do with an iPhone. Having used the fingerprint scanner in the iPhone 5s and S5, I prefer the fingerprint scanner with the Samsung because it works more reliably for me. I highly recommend the Samsung S5 for anyone looking to upgrade or in the market. It may not be revolutionary enough to make S4 owners jealous but still is a mighty impressive phone.", "Date": "April 11, 2014"}, {"Title": "Evolutionary NOT revolutionary!", "Author": "rpv", "ReviewID": "R1TV7IZRDRO7R6", "Overall": "5.0", "Content": "Oh, Another year, another set of phones from manufacturers!  I have been hooked onto get the latest phone every year syndrome and love reviewing specifics. Disclaimer, I love Android and have been using from very early days. I will not call Samsung Galaxy S5 as revolutionary, but it is certainly evolutionary. If you have an older phone more than 2 years old, absolutely get this. I love Samsung Galaxy S5 from its competitors for few reasons - removable battery, microSD card support and the maturity of the product. I have been using a S5 for past couple of days and have ordered a unlocked one from my local store. There are so many variants already in the market. So do check local specs. For example, in china market dual SIM S5 is available.Galaxy S5's back plate has a perforated dot pattern and a excellent matte finish. As a result, the phone looks far more sophisticated than its past designs despite its plastic build. Its surface feels nice to the touch without being too rough or too slippery.  I really do _not_ care about the plastic, in fact the lightweight nature is what I care. Some people make a huge deal out of it. A high quality plastic is good for lightweight and I go with lightweight than a heavy phone in the pocket. A reputed tech site called recently Samsung as the “undisputed king of the Android smartphone space”. True indeed. With the plethora of devices in tablets/phones, they have iterated so much that they can produce truly stunning products.If you care for weight, the Galaxy S4 is lighter than S5.  (please see my stats below).  In fact pixel density is slightly higher in S4 due to a 0.1in size difference. So get an S4, it is cheaper and still same phone that came out last year. If you care for heart rate monitor, fingerprint scanner, and water proof, get the S5. Otherwise literally similar set and you can save a lot by getting S4 now. Last year when S4 came out it was a great phone. It still is, though S5 came out now. Obsoletion is in the mind of the us, not on the devices.In my opinion, following are key specs to consider when you buying a phone. Most of others are standard or does not matter at all. First size,weight and resolution are part of look and feel. RAM/CPU part of performance. external Storage is part of expandability. Camera is obvious! SAR  (Specific Absorption Rating) is an often ignored, but I feel essential to making a buying choice. Manufacturers don’t advertize or mention SAR prominently.phone parameters: {size, weight, resolution, ppi, RAM, ext Storage, camera, CPU, USA SAR rating}Samsung Galaxy S5: 5.59 x 2.85 x 0.32 in, 145 gm, 1080 x 1920 pixels, 5.1 in, 432 ppi, 2 GB RAM, microSD upto 128 GB!, Qualcomm Snapdragon 801,  MSM8974-AC  Processor:  Quad core, 2500 MHz, Krait 400, 0.63 W/kg (head), 0.82 W/kg (body)Samsung Galaxy S4 (Intl version):  5.38 x 2.75 x 0.31 in, 130 gm, 1080 x 1920 pixels, 5.0 in, 441 ppi, 2 GB RAM, microSD, up to 64 GB, 13 MP/2MP, Exynos 5 Octa 5410 CPU, Quad-core 1.6 GHz Cortex-A15 & quad-core 1.2 GHz Cortex-A7, 0.85 W/kg (head), 1.55 W/kg (body)HTC One M8: 5.76 x 2.78 x 0.37 in, 160 gm, 1080 x 1920 pixels, 5 in, 441 ppi, 2 GB RAM, microSD upto 128 GB!, 4 MP (rear), 5 MP(front for selfies), Qualcomm Snapdragon 801, Quad core, 2300 MHz, Krait 400, 0.94 W/kg (head), 0.83 W/kg (body)LG G2: 5.45 x 2.79 x 0.35 in, 143 gm, 1080 x 1920 pixels, 5.2 in, 424 ppi, 2 GB RAM, no ext Storage, 13 MP/2.1 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.26 GHz Krait 400, 0.50 W/kg (head), 0.69 W/kg (body)Google Nexus 5: 5.43 x 2.72 x 0.34 in, 130 gm, 1080 x 1920 pixels, 4.95 in, 445 ppi, 2 GB RAM, no ext Storage, 8 MP/1.3 MP, Qualcomm MSM8974 Snapdragon 800, Quad-core 2.3 GHz Krait 400, 0.92 W/kg (head), 1.23 W/kg (body)Apple iPhone 5S: 4.87 x 2.31 x 0.30 in, 112gm, 640 x 1136 pixels, 4.0 in, 326 ppi, 1 GB RAM, no ext storage, 8 MP/1.2 MP, Apple A7, Dual-core 1.3 GHz Cyclone (ARM v8-based), 1.12 W/kg (head), 1.18 W/kg (body)Samsung Galaxy Note 3 N9000: 5.95 x 3.12 x 0.33 in, 168 gm, 1080 x 1920 pixels, 5.7 in, 386 ppi, 3 GB RAM, micro SD upto 64 GB, 13 MP/2MP, Exynos 5 Octa 5420, Quad-core 1.9 GHz Cortex-A15 & quad-core 1.3 GHz Cortex-A7, SAR: 0.24 W/kg (head), 0.72 W/kg (body)Nokia Lumia 1520: 6.41 x 3.36 x 0.34 in, 209gm, 1080 x 1920 pixels, 6.0 in, 367 ppi, 2 GB RAM, microSD up to 64 GB, 20 MP/1.2MP,  Qualcomm MSM8974 Snapdragon 800 CPU  Quad-core 2.2 GHz Krait 400, SAR: 0.59 W/kg (head), 0.24 W/kg (body)Motorola Moto G: 5.11 x 2.59 x 0.46 in, 143 gm, 720 x 1280 pixels, 4.5 in, 326 ppi, 1 GB RAM, no ext storage, 5 MP/1.3 MP, Qualcomm Snapdragon 400, Quad-core 1.2 GHz Cortex-A7, SAR: 1.17 W/kg (head), 1.06 W/kg (body)Given the above key specs, my suggestion to my friends is to choose 2 or 3 KEY features you require (may be large screen size, maybe less weight, maybe more CPU power) and then start nailing down the phones. Definitely and definitely go to a phone or a big box store and feel the phone. Nothing replaces that. In the end end you are using it for days and years, so the tactile feel is very important.SCREEN SIZE/RESOLUTION:I have experimented with many phone sizes and I have come to a conclusion 5” is the best form factor for me. Your mileage may vary, but after using Note for a while, I don’t use it as a primary phone.  The display in S5 is absolutely stunning with a Super AMOLED display and you have to see to feel it!ANDROID UI:S5 has Android 4.4.2 KitKat out of the box. User Interface hasa flatter and simpler design, as is now the trend across the industry. Once you get used to user interface you get used to it. Android is very flexible and when I show my phone to a iPhone users they are usually in awe. I recently to my friends shows the details of processes. battery usage like which process takes up more battery, Qi charging receivers for wireless charging on Galaxy phones and they were in awe.WATER PROOF:Obviously I have not tested this!,  but a very nice to have feature and gives a peace of mindCAMERA:This can just replace a point and shoot camera. Wait, what is a point and shoot camera?! Very impressive. S5 has a 16MP camera with super-fast autofocus, HDR mode with real-time preview, and support for 4K video recording. Definitely state of the art.  I took several indoor photos and they look great. It will be interesting to see how photos appear in a vanilla S5 which Google will release.S-HEALTH:I rely and use S-Health more than any other app in my Galaxy S5. It has driven my fitness regimen to a very good progress and the design of app is nothing short of buttery and beautiful. I am often too in good favor of Samsung loading the phones with S-Ware, but their design of S-Health is definitely breathtaking. Heart rate monitor is a great addition to the fitness tools. I used it for walking several steps and found it same as in S4.PROCESSING POWER:Don’t bother about it.  For 99% of users, this is good enough. The phone has more processing power than the rocket that went to moon first time and much more. The games are very smooth, the UI is very smooth.Qi WIRELESS CHARGING:I wonder why Samsung does not release wireless charging built in. You have to get a external Qi wireless charger and open the back, align it and use with a Qi charger. It should be integrated, but you can do it after the fact.NFC Tags:Wow, this is the most underrated in all reviews. Get bunch (  I mean  around 10) of NFC Tags and use in bedrooms, offices, cars, living room and customize what your phone wants to do in those areas. For example in my S4, when  I enter the car most often I use a) Navigation b) Listen to Podcasts. So I program my NFC tags accordingly using apps like Trigger and tap my phone to the NFC Tag and boom, phone does both. I am programming my S5 also to do host of things.128 GB Micro SD card!!This is just incredible. If you see my reviews, I have been saying having external capacity is very key. With a 4K camcorder you can fill your space in a blink of the eye. Movies take up space. Who would have thought a 128 GB tiny card can fit in  a phone. This is just incredible. I tested with a 128 GB  and it works wonderfully! A 16 GB phone memory will have around 10 GB spare initially.OTG - USB Hosts:This is also often ignored feature in many reviews.  On the GO USB cable + S5 means you can use with external hard disks, and virtually many of USB devices. If you have a thumb drive and have files, you can in fact read with a phone and don’t necessarily have to open  a laptop. works out of the box.BATTERY:Do you really need to care for battery anymore. I don’t. Just use the phone. I have battery power banks with capacity as high as 30,000 mAh to 8000 mAh that I can charge virtually anywhere without a power supply. So this has become moot for me in past year. I would also suggest you get power banks and not really care of battery drainage. Use the phone and enjoy!MISC FEATURES:I tested fingerprint scanner, but I am not sure how reliable it will be over time with scratches/oily fingers etc. I have to test it further, but for now I will settle on traditional passwords till bugs are ironed out.  Apple’s initial fingerprint software had bugs which was fixed subsequently. There are so many other features in S5. Some of them have become so standard that they are not review worthy!  e.g., Infrared for wireless remotes, GPS etc. GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up).To give a sample, I tried following apps and they just worked awesome.Amazon Mobile, Androidify, Angry Birds (multiple themes), Asphalt 8, Box, Chrome, NAVIGON (from Garmin - offline maps), TOM TOM, , Google Navigation/Earth/Maps, Google Currents (nice way to read News), Google Drive, Ebay, Linkedin, Google Music, Tapatalk (awesome forum browsing app), Microsoft One Note (legacy docs, skydrive of 25 GB is good), Microsoft Office, (yes they hve for Android!), Subsonic Music Streamer, TweetCaster Pro for Android (excellent twitter client), Twit.Tv, Trigger, Google VoiceAsk questions, the review cannot do justice to Galaxy S5. I will be glad to answer any questions within 24 hours.", "Date": "April 11, 2014"}, {"Title": "Glad I waited, very good phone", "Author": "W. Fondren", "ReviewID": "RQNYWN6U68Z3U", "Overall": "5.0", "Content": "I owned an S3 and skipped the S4, hoping the S5 would be a major upgrade--and it sure is. As other people are saying, one of the big surprises is the battery life. I went two and a half days of heavy use and still had 20% when I charged it.A few of the bells and whistles feel superfluous, but many of the new features are ones I want. For example, scheduled text messaging is fantastic. At 5:00 AM I can work my text messages and have my responses sent at 8:00. Or scheduling a text to send on someone's birthday is pretty cool.The screen is beautiful. The colors are bright and crisp.The feel of the phone is nice, too--not to heavy, but not so light it feels fragile.It impresses me also that I can use the new adapter for enhanced charging or my old charger if need be. That's the kind of smart design that sells me on upgrading.The only couple things I don't care for are: 1) the cover to the adapter jack is hard to open and 2) the fingerprint scanner takes 2-3 swipes usually to recognize my finger. Apart from that, I'm very happy with my S5.", "Date": "April 15, 2014"}, {"Title": "Versus HTC ONE M8", "Author": "phillydet000", "ReviewID": "R2WDXBBYI8UNE6", "Overall": "5.0", "Content": "I have only had this phone for a day but I absolutely love it.  I owned the HTC ONE M8 for a few weeks and returned it for the S5.Without getting into insane technical comparison, I've listed some subjective comparison points.- Build:The M8 is a thing to behold.  As people say, you haven't seen the phone until you've held it.  That said, I was scared to death to scratch or drop the thing.  I'm not a case guy at all and a part of me dies when I see someone slap a huge Otterbox case around a magnificent piece of hardware. To each his own. I understand people are clumsy and drop things, but I get irritated when 'fanboys' trash a rival manufacturers build....but then put an enormous case on theirs.  Anyways, I just prefer the lighter plastic build of the S5.  The back cover feels great in the hand and the buttons are all placed in the most convenient spots (for me anyway).  I appreciated HTC moving the power button to the right-top side....but it's still very difficult to reach.  I've changed phones a lot in recent years and one thing I've learned is that you need a solid week or two with a phone to really form an opinion on a build.Battery:Seems pretty even here.  Both get excellent battery life that you'll get entire day out of.  Really excited for the wireless charging covers to be released.  Don't think people know how convenient wireless charging is if their device allows for it....especially if you have to remove a cover every time you want to connect a cable (which I know isn't the end of the world, but it's the little things, right??)Unless you're some crazy heavy user that plays games all day and watches movies on a 5\" device.....you'll love the battery life.Camera:GS5 takes this one but not by much.  For normal day to day Instagram photos, both devices are excellent.  The selfie front camera on the HTC One was surprisingly awesome!  Felt like they should have used that lenses for the back. Keep in mind this phone take high res pictures that turn into large files.....so send with caution.  (5-6mb files)TouchWiz:I typically DESPISE Touchwiz.  I've used a Note 1, 2, 3, Galaxy S3, S4...and now S5.  This is the first time I've actually considered it a viable option to stock Android.  Samsung has definitely cleaned things up.  My favorite fixes include the messaging app.  They've changed in subtle ways to bring it up to date. Kit Kat allows you to choose your default messaging app now (which is awesome!) but this is the first time I've wanted to stick with the stock app. (priority senders is a cool option)Speakers:The BoomSound speakers obviously crush the GS5 here.  However, unless this is a feature that you absolutely need....the GS5 speakers are serviceable.  I found it very fun to show off the HTC speakers to friends.....but in normal day to day life I keep my phone silenced almost the entire time. (nobody can stand hearing your notification sound go off constantly). ALSO, nobody has brought this up, but when you leave the HTC ONE M8 in your pocket any kind of small dust or dirt particles get jammed in the speaker grill!!!!  I wish I could attach a photo of this but it was irritating!  That freshly drilled speaker hole look goes away in about a few days.  Tried blowing on it but didn't seem to work.  Just a heads up.Misc:Wish the headphone jack was on the bottom.  Had gotten used to that on other devices.Conclusion:  Just wanted to give a few points to those on the fence. You can't go wrong with either phone.  It really comes down to build quality.  The HTC was something that will definitely turn heads and feel nice and cold in the morning, but remember that summer is coming up.  The GS5 will be much more friendly in the elements.Hope this helps.", "Date": "April 12, 2014"}, {"Title": "Fingerprint reader is disabled if you encrypt device (all carriers)", "Author": "J. brown \"jb from the lbc\"", "ReviewID": "R3B41ZZ2NTOI09", "Overall": "4.0", "Content": "I have been using my new S5 for a few days now and am very impressed with this device.  However I just found a flaw in its use of the fingerprint reader that I found quite disturbing and I have since verified with Samsung directly that this is the way it is designed.The issue is that if you encrypt your device all of the lock screen options go away except for password.  In other words if you want to encrypt your device the fingerprint reader is effectively disabled.  Samsung told me they would forward my concern on this to engineering but I think buyers should know about this.  If you don't intend to encrypt your phone this is not an issue and I would admit most people probably don't.  (though more should IMO)  The camera on this phone is fantastic by the way.", "Date": "April 21, 2014"}, {"Title": "Buggy and terrible considering how long the S-series have been out", "Author": "Kevin Jarboe \"Jarbohydrate\"", "ReviewID": "R1H79V5HO06Y7V", "Overall": "2.0", "Content": "For most people this phone may be OK but not for me and probably other tech geeks:GOOD:  Best build quality I have seen in a phone.  Water resistant not waterproof but still very cool and it works.  After it gets dropped in water pop the back off you will see places where water will collect you will want to dry these places off.  Despite this the OEM seal on the back cover did a great job of keep water out of the vital components.  Phone is very resistant to most drop damage compared to competition.  Heat rate monitor is pretty neat and the screen is the best on any phone I have ever seen.BAD:  Samsung tried to pack a lot of technology into this phone and a lot of it does not work well.  Most if not all of the following problems are common just do a google search and you will see.  Firstly, as with a lot of locked DROID phones this one (at least the ATT model) has a bloated user interface over KitKat.  Just look at the free space on this phone vs others.  I went from a nexus5 to this phone and the difference between OS/KITKAT fluidity was night and day.  This phone is constantly locking up and hanging and at least once a day required me to remove the battery to do a hard restart.  Even the boot graphics are glitchy...really samsung? When the phone is locked sometimes the screen will no come back on when you unlock it.  The finger print lock requires you to stroke your finger at a very specific angle or it wont work. I had about only a 60% success rate after using it for about 2 weeks so I went back to a pin lock.  Camera has a really hard time focusing on really close objects and constantly hangs while taking pics and switching between picture modes sometimes locking the phone up.  KITKAT has limited the user's ability to write to an external SD card so forget about copying music to it and popping it in your media player wont be able to read the songs.  A root could easily fix this and the other issues if one were willing to forgo their phone's warranty but guess what not only is the ATT boot loader locked but it is encrypted so forget about trying to root it for now.  Such a shame too with a root I think this would be the best phone out there but no way to really tell if the phone hardware is buggy or the User Interface.  Personally I would avoid this phone it is a classic example of what looks good spec wise on paper does not always translate into how good the device is.  Very very buggy phone which is unacceptable given this is the 5th series in the samsung S line.", "Date": "May 14, 2014"}, {"Title": "An absolutely fantastic phone", "Author": "Jared Trigili", "ReviewID": "RTG5HMRLLM7XM", "Overall": "5.0", "Content": "If you've done any research about the Galaxy S5 yet, you probably found at least a few people claiming that it has very few improvements from the Galaxy S4. I can honestly say that this is not the case, and that, coming from a Galaxy S4, this is probably the best decision I could have made for an upgrade.The screen alone, if not anything else, makes the product worth buying, is critically acclaimed and has been praised as the best consumer screen available by Displaymate, a long-running display reviewer.The back has also received some negative buzz; if you've ever held the first generation Nexus 7, it's very similar to that. Personally I find that it makes holding the device much easier, and combined with Samsung's build-in \"One-handed Mode,\" the device is as convenient as ever. Ergonomically speaking, this device beats the HTC One (M8) in just about every aspect, as the M8 that I was playing with slipped out of my hands and onto the table a total of three times, at which point I had to rest it on a surface and use it like that.Samsung also included their USB 3.0 charging port on the device which comes with a special cable, but the port was made so that it can support typical Micro-USB cables as well.The camera is also out of this world, and though it takes some getting used to navigating around the different options and modes available, I think you will be impressed with how quickly it is able to focus on a subject. If you create a Samsung account, you also have other camera modes available for download from the Samsung store, some of which are somewhat gimmicky, others are pretty neat. To date, these include Animated Photo (essentially a GIF creator), Sequence shot (a slow motion viewer), Surround shot (which creates a spherical panorama), Sound & Shot (which adds a few seconds of sound to a still photo, actually kinda neat), and Sports shot (which takes pictures of fast moving objects). All of these are free, by the way, which is really cool. As of writing this review more may have been added!Using the device is super snappy and quick, and going back to my old phone I don't know how I ever survived! Only one app has ever force closed on me while using my S5, and that app was in beta so it's difficult to tell whether it was the phone or the app itself. The IR remote is also pretty cool, and the app \"The Off Button\" is recommended because it outputs every TV IR code in a sequence so your device can act as a universal off remote. Perfect for turning off loud TV's at the bar! I've also used it to remotely trigger my DSLR, a Pentax K-30, with the app \"Camera Remote\", which also works great!All in all, there's a lot to be praised about this phone, and I intend on keeping it around for a while!", "Date": "May 19, 2014"}, {"Title": "Amazing phone upgrade from iPhone 4s", "Author": "Jacob Colby", "ReviewID": "R1MXEUU42DI4RN", "Overall": "4.0", "Content": "After 2 weeks with the Samsung Galaxy S5, here is a *short* review for those thinking about upgrading. *Note I switched from an iphone 4S running IOS 6*Looks:The phone is very aesthetically pleasing. Though it is still a plastic casing, it does not feel cheap by any means. The dimpled back plate provides a great grip, making single handed operation easy. It is as sleek as it is sexy. The chrome edges are slightly raised providing screen protection that apple really should look into considering how many cracked screens you see with the iphones.DURABILITY:I titled this in all caps because I want to emphasize how durable this thing is. I've not dropped it too many times and the screen is wrapped in a GLASS screen protector. However, the drops that have occurd have not scratched any part of the phone. The best part is that the water proof housing is legit. The only issue is water gets trapped in the headphone jack and must be blown out. You also cannot make phone calls under water, but that is due to the water blocking your signal so that does not deduct anything from it.Screen:Absolutely beautiful. There is little to no glare and the screens auto brightness works perfectly. Plenty big enough to watch Netflix in bed. Videos are so crisp compared to the iphone.Camera:16 megapixels + Loads of software for image correction and stabilization makes for a camera better than most off the POS cameras. Also, the front camera more than sufficient for you selfie lovers.Battery:I must say, the battery life is quite impressive for the processing power that this thing puts out. I've used it pretty intensely and yet to have it get below 5%. When it did get to 8% and I didn't have a charger, I threw it into Ultra-Power saving mode and it lasted 15 hours with minimal use until I got back to my apartment. Oh, and it was still at 6% battery.IOS to KitKat:The biggest fear for most seems to be learning a new mobile OS. I will be the first to say, it takes some adjusting. IOS made me lazy, but once you learn how to traverse the GUI you'll be asking yourself how you made it so long on IOS. So many features that you never knew were possible on a phone. It literally is a Mobile Computer. I mean, it can run an emulator without any hacks or jail-breaking.Features:- The health monitoring feature is pretty awesome for the active-lifestyle people. The heart rate monitor is a tad finicky, but accurate. Now that I have the hang of it, I rarely encounter issues.- The pedometer is pretty sweet. Set a daily goal and it keeps you informed on your status. Who knew I walked 10 miles on a 14 hour shift.- I haven't used the cal counter but I'm sure it could be handy.All of the SHealth data is plotted so you can see a nice lay out of your day and track progress.- The finger print reader is \"Eh\". I've been using it for a week. Makes one handed operation hard. I'm more of a fan of the pattern lock. If you could use the combo of the pattern lock and the fingerprint scanner I would utilize it a lot more.Overall, I am more than pleased with my switch the the S5. I would highly recommend this phone to anyone older than an iphone 5/ Galaxy S4.For those currently using the iphone 5 or S4, I wouldn't rush to upgrade as it would not be much of an upgrade. From a iphone 4s to the S5 though, the differences are incredible!", "Date": "May 23, 2014"}, {"Title": "Great Phone", "Author": "Rose", "ReviewID": "R3U0UIXYPLM2G6", "Overall": "5.0", "Content": "I used the iPhone and other Apple devices since I've used cell phones, and I always liked them. When this phone came out and it was time to conveniently upgrade, I took the plunge into the Android world. I have a Macbook Pro, Air, and an iPad Air, and was nervous about how I would like an Android and if I would be able to get used to it fast enough.A little over a month later, I am in love with this phone (and was since I turned it on). Apple's iOS gets a lot of attention for being simple and pretty, but this phone (Android) makes tasks that would take three or four actions on an iPhone take only one or two. There are more customizable features, you can delete preinstalled apps, it is faster and has a great screen on it.For me a big selling point was larger real estate on the screen. It is fantastic and is great for reading, watching sports, gaming, etc. Much preferable to the iPhone. When I hold an iPhone, it feels much smaller, and very comfortable, but I find myself missing so many features that I am now accustomed to on my GS5. There are a few cons, such as a few recurring notifications (volume control and power down) that I don't need and can't turn off, but everything else is seamless.", "Date": "May 15, 2014"}, {"Title": "Love the phone. Just one problem that's a real bother..", "Author": "Christina", "ReviewID": "R2PVAHGHEZKYT7", "Overall": "5.0", "Content": "Hey guys. I got this phone (6/3/14) from an authorized AT&T; dealer in my town. I wanted to get on here and leave a quick review.I LOVE this phone, but Adobe Flash is not supported and there is no way to play Amazon Instant Prime Video. I'm quite upset over this. This phone would be PERFECT if it could do everything the iphone can do (without being an Apple product lol). It's really unfortunate. Luckily, I have an iPod and a PS3 (and a laptop, obviously) so it's not THAT big of a deal. I just wish I had a device that I could watch my Amazon Instant Video on that didn't require wifi.P.s. I think I wound up naming 2 problems...", "Date": "June 4, 2014"}, {"Title": "T-mobile Galaxy S5", "Author": "Robert J. Allen", "ReviewID": "RKK891GHYMUQR", "Overall": "5.0", "Content": "i had my Galaxy S5 for about a month now i have to say impressed i love the battery life, it can withstand a drop or two and that is dust proof and water resistance and the heart rate monitor.also i love the signal of the galaxy s5 is much better than my galaxy s4 plus the T-mobile has one feature that exclusive to the T-mobile S5 is the Download Booster.", "Date": "May 20, 2014"}, {"Title": "Made to move from IOS to Android", "Author": "S. Shah \"Hi-Fi 4 Ever\"", "ReviewID": "R107KHREUMB895", "Overall": "4.0", "Content": "I've had the iPhone since day one (The ugly 2g!)  I've always been a fan of IOS but after the last few version of both IOS and Android, I have to say I'm believing there is parity.  NOTE: The AT&T; phone cannot be rooted (at this point, see review date).  I didn't know this at the time of purchase.  I purchased my phone from AT&T; for the full purchase price no contract.Pros:The camera is a vast improvement over the iPhone 5s, we have a toddler and taking pictures with this new phone has been great.  Faster focus, more options and better video.Galaxy S5 – 16MP, 2MP front cameraiPhone 5S – 8MP, 1.2MP front cameraThe screen is great, I was worried about getting a phone this big but a week later, I have no regrets.  I find myself using this phone more than my tablet.  The resolution is amazing and the black levels on the phone are so much deeper than the iPhone.Galaxy S5 – 5.1\" Super AMOLED, 1080 x 1920iPhone 5S – 4\" IPS LCD,1,536 x 640I'm only highlighting the two main pros for me, there are many others but the two above were the most important factors for me.Cons:Specifically for the AT&T; Version:  The phone came carrier locked even though I purchased it with no contract.  The next day, however, I was able to chat with AT&T; online and the rep gave me the unlock pin and instructions so my phone is now carrier unlocked. You will need a sim from another carrier to complete this process. (I used a Verizon sim from an old phone in the office and cut it fit.  Worked like a charm)The plastic back cover of Samsung is taking some getting used to.  I don't keep my phones in cases so I'm used to the feel of the iPhone's solid construction.  Don't get me wrong the Samsung Galaxy S5's back dimpled cover does provide a good amount of grip.  If you're putting this phone into a case the the construction or rather feel of the construction shouldn't be an issue.  Also, a pro for the S5 is the waterproof rating (30 minutes at 1m)!  That is a huge plus for me.Learning a new OS took a bit, however, there are dozens of great guides on how to make the transition from IOS to Android as painless as possible.  You can get 3rd party apps to modify your desktop screens and dock to behave more like IOS if you liked the way they worked.  Also, you can get the parallax functionality of the wallpaper with another 3rd party app.", "Date": "April 20, 2014"}, {"Title": "Paradigm Shift to Excellence", "Author": "Mark", "ReviewID": "R2KA85MV3Y7MFJ", "Overall": "5.0", "Content": "I did not purchase this phone from Amazon, but I wanted to let everyone know how I rate the new Samsung S5.1. Weight of the phone.  Its light, but not feather light.  5 of 5 stars2. Processor Speed.  Holy cow! Smooth and fast.  There simply is no delay with any application.  5 of 5 stars3. Music Sound with Ear Phones or buds.  Excellent bass and overall range.  If you have a good quality set of head phones or ear buds you will really enjoy this phone's MP3 capability.  5 of 5 stars.4. Internal speaker. Its a bit quiet probably because of the extended battery life. 3 of 5 stars5. Screen Quality.  The screen is simply beautiful and large yet its not clumsy to hold on to. 5 of 5 stars6. WiFi Range.  Quite Excellent - It will grab even the most distant WiFi networks. 5 of 5 stars7. Built In Apps.  The email and other built in apps are flawless.  5 of 5 stars.8. App Stores.  I had no problem with Google Play or Amazon App Store running at the same time.  5 of 5 stars9. Battery Life.  The battery lasts all day for me and then some to spare.  I usually have about 50% battery life after a full day of work. 10 of 5 stars!10. Pulse Sensor, The S5 has some built in apps for health and a finger heartbeat sensor.  It works ok, but its a little temperamental.  3 of 5 stars11. Kit Kat Version.  Its awesome! Lots of really cool embedded functions like looking at two apps at the same time on your screen. 5 of 5 stars12. Built In Cameras. Holy Cow! Its the best I have ever used on a smart phone. 10 of 5 stars13. Phone Microphone. The people say my calls are very clear, the clearest of any cell phone I have had ever! 5 of 5 stars.This phone is a quantum leap ahead of any other Android phone or device out there.  It simply runs like the fastest computer you ever owned.  I highly recommend this phone!", "Date": "April 19, 2014"}, {"Title": "A Samsung Evolution", "Author": "Johnny Saigon®", "ReviewID": "R13WJW2246L2WQ", "Overall": "5.0", "Content": "First off, I am not a professional reviewer, nor am I employed or compensated by Samsung or any other company. Instead of boring you with facts - which you can find anywhere on the Net - I will just give you some real-world impressions on how it looks, feels, and runs. With that out of the way, let's get to the point and the nitty gritty, shall we?* THE SCREEN - that is the very first thing you will notice when you look at the S5. Samsung has found its niche with AMOLED screens, which are BRIGHT & SATURATED. Everything almost literally jumps out at you, and sometimes even too much so. I had to switch to the \"natural\" setting, as the \"vivid\" and even \"standard\" profiles are too saturated(and FAKE) for me. It's better as a demo unit to draw you in, but for everyday use, I recommend switching to the natural profile.FACTS: The Galaxy S5 has a 5.1-inch Super AMOLED capacitive touchscreen with Full HD resolution - 1080 x 1920 pixels or ~432 ppi pixel density, plus Gorilla Glass 3 to protect the screen from scratches.* The Look - the S5 has a more squared-off edges look than the S4, which is more squared off than the S3, but all three are not as angular as the S2. In terms of roundness-to square-ness, it goes from the S3 - S4 - S5 - S2 (the original S just looks like an iPhone 3GS). Check out my images for an easier comparison. The S5 is the tallest and widest, but not the thickest of the Galaxy S's. The best thing I can say about this is it's an evolution. Beauty is subjective, so judge for yourself. The front side is almost the same as any other Galaxy phone: You have the physical Home button, flanked by the \"back\" and \"menu\" capacitive buttons. Probably the most improved aspect of the design is in its functionality - it is now dust-proof, and water-proof up to 3 feet!FACTS: The dimensions are 5.59\" x 2.85\" x 0.32\"(142cm x 72.5cm x 8.1cm), and weighs 5.11oz(145g).* The Feel - Samsung has taken a lot of flack for making the Galaxy S line so cheap looking and feeling with its plastic bodies, for being the top Android phone maker. HTC has been known to have the best craftsmanship with their all-metal One phones. Perhaps Samsung feel they are so dominant that they don't have to spend more to mass-produce metal phones, but since they don't want to come off as too arrogant, so their compromise is a dimpled, faux-rubber backside like the Nexus 7(2012) and its very own Galaxy Note 3. It definitely gives a better feel - it doesn't slip and slide in your hands or pockets anymore - but it cannot compare to the feel and craftsmanship of the HTC One(both the m7 and m8). It is on the right track though, so let's hope that rumored luxury \"F\" line or next year's S6 will continue to get better.* How it Runs - This phone is fast, fast, FAST! With a 2.5gHz Snapdragon 801, it has the fastest processor out there right now. It terms of real speed, I cannot say if it is faster than the HTC One m8 or the Sony Xperia Z2, but it is definitely up there. When you touch an app icon to launch it, it launches nearly instantly. To really see how this phone flies, just open the gallery app and scroll through all your photos and you'll see what I mean. Usually the gallery is where most phones stutter as it tries to load all your photos and albums - but NOT the S5!* The Camera - FINALLY! Samsung has decided to make a decent camera, and not just as an afterthought. This 16mp camera is really awesome, so much better than the S4. I would always get washed out images with my S3/S4/Note 2, but with the S5, it actually looks like it's from a decent point-and-shoot dedicated camera with crisp, bright, and saturated images. Low-light shooting is also vastly improved, although not as good as the new HTC One m8. 16mp means 5312 x 2988 -resolution images, so you can actually blow them up or crop them down without fearing the dreaded pixelation monster. There are a myriad of other cool and useful camera features that I will save for you to find out(like macro and \"Google Street View\" modes :]). And lastly, the focus is quick, quick, QUICK! Nearly instantaneous focus allows you to capture those hard-to-capture moments easier. A definitely thumbs up to Samsung for paying attention to the camera and its functions.* Software - I'm still trying to figure out everything, as there is A LOT of stuff under the hood. Samsung's TouchWiz user interface this time around is A LOT less intrusive though, as much as can be without being totally stock Android, I guess. The layout and iconography are flatter and simpler, and for the better in my view. There is also a new sensor on the back, just beneath the camera lens. It is a heart-rate monitor/pedometer, and it comes with its own health app called S Health. There is a new battery-saving mode which can save you precious minutes when you're caught in a bind. All in all, I think this version is a lot nicer-looking, more responsive, and better than the precious S phones.The ultimate question is whether this phone is a worthy upgrade over the S4. As my review title suggests, it is an evolution, an incremental upgrade over the S4. So with that said I cannot whole-heartedly recommend it if you already have a good phone, or even over the S4. But I do feel this upgrade is more vast and much better than from the S3 to the S4, so in that sense Samsung has done a much better job this year. If you are switching from an older phone that was made at least 2 years ago, then I would tell you jump right in and try the S5 - it will not disappoint you. But for those with already a good phone, and/or say you just finished year one of your 2-year contract, then I would say think hard before you make the leap. For my money, I think the Note 4 and S6 will be the bigger upgrades more worth waiting for.", "Date": "April 11, 2014"}, {"Title": "Flagship tech - stream of consciousness", "Author": "Morimoto \"Morimoto\"", "ReviewID": "R2PNTI27T4WM1J", "Overall": "4.0", "Content": "As a mobile developer who uses a lot of handsets on iOS and Android, I am an iOS user as my primary device.The most difficult thing for me when using a large Android phone is that I find them slippery and relatively impossible to control with one hand. It continues to confound me why manufacturers continues to use slippery chromed plastic rather than attempting to have something which remotely allows you to retain a grip.Related to this is my constant tendency to unintentionally launch apps and/or navigate away from what I am doing while handling the phone thanks to the giant screen with then bezel, and super sensitive capacitive buttons.This hasn't changed a bit with the S5 - I even dialed 911 accidentally the first day I had it - but the performance, features, and display on this device are all so amazing I have been using it as my primary for the past week nonetheless.I also tend to get lost as to what app I am in, especially when using apps with ambiguous names and interfaces (like 'gallery' and 'photos' and Samsung and Google camera apps and editors which launch each other). Being constantly asked for default apps is seemingly a neverending dialog no matter how much I select 'always' - just give me some good defaults and let me change them in settings when I want.I really do feel that at some point, Android needs to bit the bullet and move away from the button arrangement and keep all the controls on-screen or limited to one button like iOS.That display - that display. My word. Its simply gorgeous and so high resolution, I haven't even been using my iPad lately - and I do feel that there will be a sweet spot with phablets where I will eventually not want to bother bringing my iPad mini with me, even though it is easier to do work on.Its also really weird that, although these phablets are outstanding to watch video on, there are so few solutions for propping the device up like the kickstand on the original EVO - much less included with the device.As for tech, the camera on this phone is amazing in terms of features, most notably the 60fps 1080p and 30 FPS UltraHD video modes - wow. Both modes look outstanding and work perfectly - iMovie handled the UltraHD video perfectly, although it only outputs 1080P movies. UltraHD is really hard to appreciate without a 4k display anyway - but while it may not be a very cinematic choice, 60FPS 1080P is just mind-blowingly realistic.I have also been using this with a Gear Fit and Fear 2, and the setup and interoperability has been flawless so far, despite the arguable value of the software. I might have seen my last day not wearing a smartwatch just for the convenience of not having to take out my phone so much.Sorry this isn't a proper review, but more of a stream of consciousness, but wanted to share my impressions of this very cool device.", "Date": "April 21, 2014"}, {"Title": "On the Fence...", "Author": "Justin B.", "ReviewID": "R3BBYYWRUUJPUV", "Overall": "4.0", "Content": "My wife and i recently purchased the Galaxy S5 and coming from IPhone I have to say i'm on the fence about keeping them. I enjoy the ease of use of the Iphone, it makes everything simple and quick.  On the other hand i like the customization options on the Galaxy S5. I can't help feel like i'm being ripped off every time i get an IPhone. $100 for an extra 16GB of storage is crazy. An extra $100 on the Galaxy S5 would get me a 128GB Micro SD card bringing the total storage to 144GB. My biggest irritation is that there is NO AMAZON INSTANT VIDEO APP(Amazon i hope you read this!) but i don't hold that against the Galaxy S5.PROSScreen - The screen is outstanding.  Usually Super AMOLED displays are terrible in sunlight but Samsung did a great job making it work.  Everything pops and playing games and watching movies on this device is outstanding.Built Quality - Usually I would knock a phone for being plastic but it works well for this device.  The phone is very comfortable to hold and the water/dust resistance is a great bonus.  The black model looks pretty good as well.Battery - The battery life is good. On a typical day i take the phone off the charger at 5:45am and put it back on the charger around 11pm.  I do some web browsing, text messaging, push email to a Gmail and Exchange account and watch about 35 minutes of Hulu or Netflix. Also, the phone is set to auto brightness. By the time i put the phone on the charger it's at about 10%.CONSTouchWiz - TouchWiz is garbage.  I can't be any nicer about it.  Both my wife's phone and my phone have froze during phone calls. It simply just goes to a black screen and stays there. To fix the issue the battery needs to be removed for a couple seconds.  Same with the Message app.  Upon rebooting after the message app fails it tends to send the message you were trying to send at least 10 times in a row.  I would understand if the phone was rooted or it was just a third party app giving me trouble but these are core functions of the phone that aren't working correctly. In my opinion the TouchWiz skin takes a good OS and trashes it.Fingerprint Reader - The fingerprint reader is an unfinished and worthless addition to the phone.  Trying to use it one handed is a waste of time as it will only work about 10 percent of the time if you try to do a vertical one handed swipe with your thumb.  Using it with your pointer finger will give better result, maybe 60 percent success, but requires both hands.Heart rate Monitor - This is pretty much a gimmick to begin with.  It works about 75% of the time in my experience.  Probably not a deal breaker as I don't see many people ever using it.UPDATE: The freezing issues were caused by the default message app.  Having it opened caused the dialer and other apps to freeze.  Switching the default to Hangouts fixed the issue. Still not good that a core app doesn't work but i feel that Hangouts should be the default anyways.", "Date": "May 5, 2014"}, {"Title": "The only thing I don't like is that the S5 still feels very plastic-y", "Author": "Tien Dieng", "ReviewID": "R3077CK5N4N0KD", "Overall": "4.0", "Content": "I write this review with two question in mind:Is it worth upgrading from the S4 to the S5?I would say maybe. The screen is a bit bigger and the phone works faster. The only thing I don't like is that the S5 still feels very plastic-y. Overall a great phone and worth an upgrade if you can afford it.is it worth upgrading from the S3 to the S5?Yes, definitely. You will experience a leap of difference and really enjoy your upgrade.", "Date": "May 1, 2014"}, {"Title": "apple fan girl no more", "Author": "Nicole D", "ReviewID": "R1AARLTX6ZK45S", "Overall": "4.0", "Content": "The only smartphones I've had have been I phones (3,4, and 5). I loved how intuitive everything about the ios was and the stability of it.I was super nervous about switching,  but it was time to upgrade and to be honest there hasn't been anything new and exciting about the iPhone in a while. My husband and I both made the leap.There's very little I don't like about this phone, and since there are plenty of technical reviews, I'll just tell you what I like vs don't like in comparison to the iPhone.The first thing that I noticed upon turning it on was the screen. My god the screen. It is so. .. crisp. The colors are amazingly bright and clear. It's really beautiful. Let's not forget the size. Looking at it on the store shelf, I didn't think it would be that much bigger than my iPhone. It is. I have rather small hands, so I can't really use it one handed like I did my iPhone. There's some sort of setting that's supposed to shrink it down, but I haven't messed with it. It's not that big of a deal to me.Next, the camera. The 16mp rear facing camera takes amazing pictures. I no longer feel bad about my son's moments being exclusively captured on a phone camera. It seems a little slower than the iPhone, but the quality is so much better it's worth it. Now, the front facing camera is another story. 2mp? ! Really?  It's the age of selfies and I have a 2mp front facing camera. Pictures taken with it definitely leave something to be desired. Oh well.App selection is awesome,  obviously. I did notice a free app on iPhone is like 2 dollars in the play store (genius scan). I also really like kid zone, as does my three year old. I can just hams him the phone and not worry about him getting into other stuff. I did have to download a visual voicemail app. This is such a convenient thing that I don't understand why a phone would not have it already. My husband and I both were displeased about it enough that we found the app and downloaded it separately.It being made out of plastic isn't a big deal to me. Are there really people walking around wit phones not in cases?The fingerprint scanner sucks. It hasn't recognized my fingerprint the first couple tries ever, so I don't use it. The heart rate monitor also seems superfluous.The os takes a little getting used to. Mainly because there's just so much more that you cam do. Most of the stuff you'll be using on a day to day basis is easy. Oh and swype?  Yeah it is fantastic. The phone is just so much faster than the iPhone. Now...I have had to restart it a couple times to get it to stop acting wonky. That was one of the biggest reasons I stuck with iPhone foe so long; none of this stupid turn it off and on again bs. Hopefully it doesn't become a regular thing. Overall there's much more I like about the phone than dislike. Apple would needed to do something drastic to get me back and I really just don't forsee that happening!", "Date": "June 7, 2014"}, {"Title": "Very good phone", "Author": "rustaferd", "ReviewID": "R1X54BAB6GA2JV", "Overall": "5.0", "Content": "Best phone I have every had.  They delivered on time.  It could use instructions on how to set the phone up with your carrier, but else all is good.", "Date": "June 4, 2014"}, {"Title": "Loving it!", "Author": "brit.bunny", "ReviewID": "RTL7GBK5ZOMCD", "Overall": "5.0", "Content": "This phone is awesome! I'm so happy I waited a couple years to upgrade, this phone definitely meets all of my expectations and more.", "Date": "May 28, 2014"}, {"Title": "Best smartphone I had", "Author": "Heiko Köhler", "ReviewID": "R1O2NA3C8PP811", "Overall": "5.0", "Content": "I love the display and resolution of this phone. Battery life is very good compared to my previous Samsung Galaxy Nexus.", "Date": "May 19, 2014"}, {"Title": "Great phone, very satisfied", "Author": "E. Chamberlain", "ReviewID": "R2U7O4ZQBE3SDP", "Overall": "5.0", "Content": "This is my first Android phone; I purchased this to replace my Windows Lumia 900, which in turn replaced my iPhone 4.  I think this is the first smartphone I have used that really sets itself apart from the competition.  The screen is large, bright, and vivid.  There is an adjustment process for new Android users, but nothing that would discourage me from recommending this phone to others.  The rear camera is very high-resolution and takes beautiful photos.  I have had the phone for a few weeks and I still discover new features and settings almost every day.In short, a great phone that should easily position itself at (or near) the top of any smartphone comparison chart.", "Date": "May 6, 2014"}, {"Title": "I used to be a strict Apple user until....", "Author": "Pedro V. \"P.Vieira\"", "ReviewID": "R2MZIUMQOCOBHL", "Overall": "4.0", "Content": "So this coming from an Apple junkie I was extremely skeptical of getting this phone and one of the primary reasons was that I have the AT&T; Next program and can upgrade every year or so too a new phone. My idea was to get this phone and next year get the iPhone 6 but the 5.5 inch screen that is only going too be released later next year due to the fact that they couldn't find a suitable battery to power the phone.I saw the S5 and was pretty much drawn too it because of the way it looked. It didn't have that cheap feel that the previous galaxy's had (I've owned the S3 and the Note 2) and it looked really slim and really light. I decided to purchase this phone and I've actually been pretty happy with it (considering that the battery kind of drains pretty quick). The visuals are extremely beautiful and I can do 1080p video and it also has a 16mp camera.My one biggest problem that I had with previous Samsung phones was the enormous amount of bloat ware that was included with the phone and that obviously hasn't changed because Samsung refuse to make anything simple. The phone is extremely quick and the 4G LTE makes it extremely easy too surf and play games or run documents. It comes with a dual core 2.5 ghz processor which is pretty interesting considering barely any phones can run this type of hardware without the occasional lag and frustration but this one does really good.All in all a solid build just wish I could uninstall programs that came with it that I'll never use.", "Date": "May 4, 2014"}, {"Title": "Encrypted bootloader, CarrierIQ spyware, no root", "Author": "C. Simmons", "ReviewID": "R2N675BAK23Q9C", "Overall": "1.0", "Content": "AT&T; took a great device and destroyed it with the bootloader lock. Do yourself a favor and get the TMO version and use it on AT&T;'s network if you can't switch to TMO.Disadvantages:CarrierIQ - SpywareEncrypted Bootloader - No root, no timely android updates, AT&T; bloatware, no way to remove spywareThe phone it self is a very nice piece of hardware just one that has been made useless by AT&T;'s messing with it.", "Date": "April 25, 2014"}, {"Title": "Proper smartphone", "Author": "Damon Pratt", "ReviewID": "R1J5UZ9UBIKOK1", "Overall": "3.0", "Content": "Galaxy S5 has it all. The display is superb, the new android OS runs faultless, the CPU is quite fast, the camera sensor is high quality and it offers a plenitude of interesting features. But, my main problem with this phone is related to the fact that it doesn't quite deliver anything new. My old S4 already had the a/m characteristics. Of course, there are some novelties in it, but not too many.", "Date": "May 20, 2014"}, {"Title": "Love It", "Author": "Jessie", "ReviewID": "ROQJOAMJG9S42", "Overall": "5.0", "Content": "New Better and easy to use big to fit in my hand to hold easy to read and see opertion", "Date": "May 28, 2014"}, {"Title": "Not enough of an upgrade to make worth paying for...", "Author": "Johnathan M. Burger", "ReviewID": "R2K6YQ9O88S0LY", "Overall": "3.0", "Content": "Phone is hobbled by 16GB internal storage-minimum in modern phone should be 32GB.With the OS, Samsung bloat as well as carrier, you are left with about 9GB for your stuff.You will have to buy a SD card if you have any music or video.Battery life is still pretty bad for me.Dropped 5% in one hour just listening to a podcast.Headphones do not securely plugin-slightest nudge unseats them.Screen is gorgeous.Still get slight lag and delayed responsiveness to touches.Useless features added, such as heartbeat monitor(something you can do on any phone with the flash near the camera).Fingerprint scanner implementation is poor-can't use one handed, security features missing.", "Date": "May 14, 2014"}, {"Title": "Hate it!", "Author": "Yehezkel Yosef", "ReviewID": "R3INEXR0LLOZZE", "Overall": "1.0", "Content": "Hate it! Hate it! Hate it!!!!!What a stupid design! My galaxy S5 has enough useless features to fill days of exploration yet the home button wakes the phone and there's no way to disable this feature. Every time the phone is in my pocket, the home button inadvertently depresses and wake the phone. Soon after the phone rub against my pants and get unlocked. From there to the misdeal phone numbers to the deletion of important info, the way is very short. I guess it's okay, it only cost $700...I contacted Samsung but they had no help to offer other that going around it by putting a number or pattern lock on the phone. Surly my pants pocket isn't that smart. It's okay for the phone to heat up in my pants and waste battery while the screen is on.Arrgggghhhhhh! you stupid Samsung software engineers! Who the hell is testing your prototypes? We don't all wear suits like you! most of us are a blue collar working class that put our phone in our pants pocket.Please revise software to allow us to disable home button from waking phone up.And NO! I don't wan't to put a code (number, pattern, or unreliable finger print) on my phone. I don't want to see my life waste away on unlocking my phone for every time the screen goes out or with every phone call. I tried it and it suck.If this is not fixed, this is my last Samsung product. Very disappointing...", "Date": "May 30, 2014"}, {"Title": "Downgrade from the S3", "Author": "Craig", "ReviewID": "R2QV4YUOFSAO4I", "Overall": "1.0", "Content": "I upgraded from an S3 to an S5.  I had the S3 for several years and was very happy with it.1) The day after I received my phone, I stopped receiving text messages completely.  I worked with the T-mobile rep to rectify it.  I had to do a hard reset on the phone.  Although I never received my missed texts, it seemed to work after that.  I was told that the phones were shipped with faulty software that Samsung was aware of.  Texts have worked fine since them.2) The speakerphone is a half-duplex instead of full duplex.  That means that when the other person was talking or making noise on their end, they could never hear me.  I was never sure if they were hearing what i was saying or if it was actually going through.  For example, if I was talking to someone on speakerphone who was in their car and had a lot of noise on their end, they would never hear me.  As someone who uses speakerphone a lot, this is a major problem.  My Samsung S3 was full duplex.  I never had this problem.3) My email never properly synced with my server.  If i looked at emails on my computer, they would still show as unread on my phone even AFTER I hit the sync button.  I would delete emails on my phone and after I synced, they would re-appear.4) I would choose a specific ringtone for different friends and it would only work SOMETIMES.  One time I might get the ringtone that I specified and another time I might get my generic ringtone.  No rhyme or reason.5) Because I live in NYC, some subway stations have cell service and others do not.  If I sent a text when I didn't have service, it SHOULD simply send when I got above ground or to a station that had service.  It wouldn't.  The text would just sit there and never send.  I would have to copy/paste it to a NEW text and send again.6) I used the map service to find a friend who was several blocks away.  I had an address and when I put it into the phone, it sent me in the complete wrong direction.  In fact, the map started spinning as if it had no idea how to locate where I was or where I was going.7) There was a serious lag because of Touchwiz.  It's almost as if the phone is thinking about what it needs to do.I'm being shipped a new phone but I'm not sure if it will fix ANY of these problems. If it doesn't, I'm going to have to choose a new one. Samsung REALLY rushed this one out.", "Date": "May 8, 2014"}, {"Title": "Cannot use fingerprint scanner for device encryption and no image stabilization in 4k video.", "Author": "Matt \"Custom\"", "ReviewID": "R26DZDZDMCGYKF", "Overall": "2.0", "Content": "You need a couple of days to get used to using the fingerprint scanner.Sometimes it doesn't recognize your finger on the first try, but almost always does on the second try.To increase probability of having my thumb recognized, I programmed 2 of the 3 fingers to be the thumb.That's all fine and dandy, but why is there a limit of only 3 fingers?  Samsung also should have allowed different profiles based on which finger was swyped.But even that's not the biggest problem.  My biggest gripe of all is that the fingerprint scanner cannot be used as the method of authentication for the Encrypt Device feature.  I don't want to type in a long/strong password every time!!  Are they really SSOOO inconfident about the security of the scanner??  We should be able to use the fingerprint scanner and a strong password as an alternative.", "Date": "April 15, 2014"}, {"Title": "do not by samsung phones", "Author": "benc \"fevon\"", "ReviewID": "R1WB3OEZYY24YR", "Overall": "1.0", "Content": "I am here to write an horriable experience with Samsung. I bought an S5 in Asia in hoping to support 4G LTE bands in Asia. And the phone came with no google apps, nor it can be installed, samsung had locked the phone to be able to install any google services. When I talked to samsung see if there's a solution, they simplely refused to help as well as not offering a refund which is with-in the purchase return policy. There's simply no warrning sign or any notice on the box or through any form of education indicated google apps/serices cannot be installed. And the fact is my life and business depends on goolge apps/services. I simply bought a smart phone which has the smart tooken away and non even Google or Samsung or the carrier willling to help. I have been dealing with this for days and no one can help. this is absulotly the worst experience I ever had of buying anything.", "Date": "May 2, 2014"}, {"Title": "great, but too big", "Author": "jjob", "ReviewID": "R1159I9U5U5ROO", "Overall": "2.0", "Content": "I have now owned this phone since the day it came out.Positive:  1.  It has great functions, and works as advertised.  Being able to buy the extra storage is great.Negative:  1.  The cover that is over the plug didn't last.  I plugged in one day and when I unplugged, I noticed it had fallen off.  I took it back to ATT and they told me it happens and to call Samsung.  I did and Samsung wants me to mail it in and it will take 10 days for them to fix it.  If this happens, they should supply the phone companies with the part.  Without it, they told me that their waterproof claim is void.  2.  I wish Samsung made a full function phone with a smaller screen and that would fit in a man's shirt pocket.  There is nothing I use a phone for that requires this big screen.  3.  If you do break the screen, it costs about twice what other smart phones cost to fix ($279).", "Date": "April 11, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Samsung Galaxy S5, Black 16GB (AT&T;)", "ImgURL": "NULL", "ProductID": "B00IZ1XA94"}}