{"Reviews": [{"Title": "Great smartphone", "Author": "Lopez Solimar Maria \"Solimar, MD\"", "ReviewID": "R1IZSQFI88TTMW", "Overall": "5.0", "Content": "Great! Love my new smartphone, its small and so cute, very nice... Work great! Excellent for a woman. Muy feliz con mi tlf nuevo es pequeño y funciona excelente", "Date": "May 11, 2014"}, {"Title": "great phone", "Author": "Oliver Sureda \"topper\"", "ReviewID": "RF188DUWM3EW7", "Overall": "5.0", "Content": "Great! Is faster than 8190. Is working with an Venezuelan operator without problems.  The only think I dislike is the find my mobile service,  is only in Chinese", "Date": "June 5, 2014"}, {"Title": "Great Smart buy", "Author": "Mario Burbano", "ReviewID": "R273OAOWFTOJSK", "Overall": "4.0", "Content": "Great phone. Good price for the value  Not the top of the :line but great smart lhone anyway.  All I need", "Date": "June 3, 2014"}, {"Title": "Good Cellphone", "Author": "Pascalita", "ReviewID": "R2USRN7F9QYQ7C", "Overall": "5.0", "Content": "This cellphone es great for the price, i mean under 200 dollars and it does it all!. Is a must if you want a great app cellphone without expending much money on it.", "Date": "May 9, 2014"}, {"Title": "The Samsung Galaxy S3 Mini GT is such a good, easy to use cell phone!!", "Author": "Eben Loberg", "ReviewID": "RQO1DU8XJSLFV", "Overall": "4.0", "Content": "I have used the Samsung Galaxy S3 Mini for a few months now and I really love it. I have been a keen Samsung cell phone user for at least 7 years, but the Galaxy S3 Mini is the best. If you can lay your hands on one, get it NOW and enjoy it!!", "Date": "April 27, 2014"}, {"Title": "I love it", "Author": "Miosotis Giron E.", "ReviewID": "R32Y3MA7T55KEB", "Overall": "4.0", "Content": "I love my new cellphone+ : camera is excellent, 5 mpx are enough for me.Totally factory unlocked, im from dominican republic and it works perfectly with CLAROSize is perfect and the performance is great.- : the battery isn't very good and sometimes i notice some lagg but for the price is okI love it", "Date": "June 6, 2014"}, {"Title": "good but not great", "Author": "tracey", "ReviewID": "RPXUSI2YX95WP", "Overall": "4.0", "Content": "The phone is great but the fact that my charger was missing a piece  makes me furious,now I have to get a new charger now. This should not have happen", "Date": "May 22, 2014"}, {"Title": "excellent product and seller,i recommend 100 %", "Author": "jose lucena", "ReviewID": "R1NMUQFUR4E4R1", "Overall": "5.0", "Content": "the quality its good, im very very satisfied with purchase, looking good quality, thanks for everything, i recommend 100 %.", "Date": "April 27, 2014"}], "ProductInfo": {"Price": "$193.94", "Features": "Cellular Band - Quad-Band 850 / 900 / 1800 / 1900 Mhz\nCellular Band 3G - 850 / 1900 / 2100 Mhz", "Name": "Samsung Galaxy S3 Mini GT-i8200 White (Value Edition) Factory Unlocked Android P", "ImgURL": "http://ecx.images-amazon.com/images/I/31zJFqukJZL.jpg", "ProductID": "B00INEIZN4"}}