{"Reviews": [{"Title": "Good TV, great price", "Author": "MdniteEagl", "ReviewID": "R16WU4Y9AHQLUV", "Overall": "4.0", "Content": "I just bought this unit from Sears for $759, and it's been everything I expect.  After reading the review at CNET, it appeared to be the LCD I wanted.  I wasn't interested in 1080p because I'm neither a gamer or that overly concerned about seeing every blade of grass during a game.  The Vizio VX37L is very adjustable as far as color - you will see reviews about its color settings out of the box (people look like they have terminal sunburn), but the unit is not only fully adjustable for red/green/blue and tint, but has a separate setting for each input (RF coax/antenna, A/V, component, HDMI) so if you like HDMI a little brighter than standard def shows, you can set it that way.You'll also read comments around the internet about the sound quality.  If you're an audiophile, just connect a sound system to the audio-out connections.  For the integral speakers, the sound improves remarkably if you use an HDMI connection.The 37-inch screen is the perfect swap if you're going from a 32-inch 4:3 unit.  The picture height is almost identical, and you gain 7 inches in width to give you the 16:9 image.If you're looking for HD on a budget, and aren't someone who must have maximum resolution, this is a very suitable television at an excellent value.", "Date": "September 21, 2007"}, {"Title": "People Let's Be Real", "Author": "M. Johns", "ReviewID": "R1MOHNIGLTO8HW", "Overall": "5.0", "Content": "I have heard all the negative about this LCD and I just don't understand.  I purchased mine from Sears 700.00.  This Vizio is an excellent LCD monitor, now I got more than I had anticipated: Internet use(surf the net and watch a game at the same time w/o twisting my neck); HDTV for sports and a few other channels, who cares about seeing every blade of grass, it is all about what marketing does to get into your head about what is good and not so or likes to think they could control your mind and tell you what is good.  Like anything else, one must look at what he/she needs and will you be able to use all of the connections, for instance.  I have a fairly new JVC 7.1 reciever, but it does not have the HDMI inputs(I have component), so I can't use it to the fullest capacity, but in time I will move up and do so, but it is not important now. I see people complain about the sound, but they must remember this is not a stereo LCD TV, now if you want that you must make the hook-up to your stereo system to get the full surround sound. (I did this with my CRT, Klipsch 5.2, Vandersteins;bdrm Bose 5.1 KEF and JVCOne other thing to mention, if your equipment doesn't support our ever-so-changing technology, your Vizio can not morph your stereo system into something it isn't.PROS:Sound: is excellent for what is in it (Bose, Klipsch, KEF, Vandersteins or Bang & Olufsen are not inside the Vizio)but they are adaquate to listen to and not hard on the ears.Picture: great and adjustable and again I can't stress this enough, it is as good as your equipment.Remote Control: can do everything needed and can learn to control most if not all of my equipment.Setup: Very easyCons:Now this is a knock on the industry as a whole, the (I) & (P) is frustrating, because years ago they came out with progressive scan DVD players and I had all my family and friends purchase nothing but progressive and now the LCD's and Plasma are 1080i(p).  The industry is just greedy, so if you don't have DVD(HDMI input), HD-DVD or Blue Ray, your DVD players w/o HDMI will resort back to 480p just like the CRT.Sound: none if you connect it to your stereo and if not, I've had people on the phone telling me to turn it down, again you get what you pay for.PIP: you can only access it if you have the HDMI, Component, RGB.  Why have all the connection if you can only access if you have certain equipment.This is not the Samsung 4665F which I feel is the best on the market (when you can get it for 1800.00).  Vizio is a great viewing device for the price. Do research before you purchase and talk to anyone that has the set you are looking to purchase.MJ from CA", "Date": "November 15, 2007"}, {"Title": "Great TV!! All About Value", "Author": "Mike S.", "ReviewID": "RZZW55MK8OF9A", "Overall": "5.0", "Content": "This is BY FAR the best value on the market for LCD HDTVs!  I have one in my living room for 6 months now and haven't had a single problem with it.  Compliment after compliment from family and friends (and it was cheap!).BTW ANY 37\" LCD is max 1080i, the screen is too small for 1080p.Advice: Mount it on the mall with the mount from Vizio.com, very easy & less expensive than anywhere else(about an hour time, one strong person)Hope this is helpful! -Mike NYC", "Date": "February 2, 2008"}, {"Title": "Consider the size carefully...", "Author": "J. Morrison \"Your average consumer\"", "ReviewID": "R2YLGQARWCEA1H", "Overall": "5.0", "Content": "Okay, I have nothing to add about the performance of this item, as I think the 4 1/2 stars out of 5 says it all.  It's a great TV.If this is your first widescreen TV, consider the size very carefully.  This is something I don't see a lot of people talking about.  When watching standard definition content, there will be black bars on each side of the picture.  This is because standard definition is made at an aspect ratio of 4:3.  Why is this important you might ask?  Because when you buy a 37\" inch TV, you don't think about loosing 3 inches on each side and getting was is basically a 31\" screen.  Actually, I haven't measured it exactly, but it looks smaller than my 32\" that I replaced with the Vizio.  Now, high definition is different as it fills the screen...but not everything is HD or ever will be.Long story short...you loose screen space when watching standard definition broadcasts, so you might consider a larger TV than you had planned on so you're not disappointed.  I almost bought the 32\" Vizio.  Glad I didn't.  This is probably why 42\" seems to be the most popular flat screen size.", "Date": "March 17, 2008"}, {"Title": "HDTV for the working Man...or Woman!", "Author": "H Rod", "ReviewID": "R2GG5318CVOERE", "Overall": "4.0", "Content": "Let me cut straight to the chase, Vizio is the best HDTV brand if your on a budget--and now-a-days who isn't. What with kids, and bills, and groceries, who has the money to spend on a 2K HDTV? I don't, that's why I got a Vizio. And you know what? I love it, not only does it perform well, but It didn't break the bank.I've had so many compliments from friends and relatives, and they can't believe what I paid for it. I highly recommend this TV to any one looking to buy a great HDTV with loads of features and connections. Oh yeah, for those of you who have read reviews that make mention of poor sound--I wouldn't call it bad, but it's not great.Honestly, there really isn't an HDTV (of any price range)that will blow your socks off with the audio quality straight out of the box. How did I remedy this? I bought a ZVOX 325 virtual surround system and the problem was solved with one wire. Now it sounds great too.", "Date": "December 12, 2007"}, {"Title": "Has it where it counts", "Author": "Mo Jo \"Mo\"", "ReviewID": "RA32OT6JOGZZ8", "Overall": "5.0", "Content": "I could not be happier with this TV. I guess it doesn't have some of the bells and whistles that some of the other TV's have. What those are I couldn't tell you. The picture is great, price is great and from what I hear about the company... They seem to care about their products and customers. What more can you ask for.If I had to say anything bad about it, my model (Not sure if this model does) doesn't have 1080 P but I don't really care about that at this point. The speakers could have been a bit better maybe too but for what you get, you really can't complain. If Vizio keep their idea of making a reliable product and taking care of their customers, I will be buying nothing buy Vizio's for the rest of my life.Well done.", "Date": "April 8, 2008"}, {"Title": "Best bang for buck HDTV on the market...", "Author": "Brad Borkowski", "ReviewID": "R1KAB9S9M4GB9C", "Overall": "5.0", "Content": "I purchased this TV about 8 months ago from costco for $750. I was absolutely surprised to learn this had so many features for such a low price, especially never really hearing anything about the company Vizio.To say the least I have been very happy with my TV. The picture is really quite impressive, with detailed and balanced colors...not overpowering like some over-saturated plasmas. The black level is probably the only part that could be improved. I recommend turning off skin tone, and some of the wacky picture enhancing features, and using a color calibration feature on a dvd. (finding nemo and most pixar movies have these buried in their extras menu)I can run my blu-ray and xbox360 at 1080i, along with HD broadcast cable. Now some people will complain about the tv not having 1080p, which in all honestly is a huge gimmick. No broadcast is ever televised in 1080p because of bandwidth constrictions, so making sure you have that for 'the big game' is a COMPLETE waste of your time. Most people cant even tell the difference between the two are unless they are side by side and playing a movie with super fast motion. 1080 resolution for under 800 bucks? You've come to the right place!As far as the sound goes, its pretty average (very mid-ranged)... better than a tv you might pick up for 200-300 bucks, but certainly not home theater quality, but really what did you expect? No high priced TV really sounds that great either... The only people that complain are the same people that end up hooking it up to a surround sound system anyways. The average user should be quite satisfied. I do recommend turning off the 'surround sound' feature, as it picks certain sound frequencies and channels and tries to play with the volume to give the illusion of a wider sound. Really annoying.This is a great purchase for a person who values a dollar. My mother and all her friends have this TV in their houses because of our recommendation. Absolutely nothing less than 5 stars.", "Date": "December 31, 2008"}, {"Title": "Quality equal to Sony but at a cheaper price", "Author": "Diamond M. Dominguez \"diamon2x\"", "ReviewID": "R3AH4JKY4EZKWS", "Overall": "5.0", "Content": "I bought this VIZIO 37\" TV 1 yr ago from Sears for my living room.  I was happy with it then and I am still happy after 1 year. No regrets.  Beautiful picture and color, the most user-friendly instructions and manual that I've ever encountered, and the TV-menu setups for adjusting color,contrast, and other setups, is also very user friendly.The remote has nice large plastic (not rubber) buttons, so you dont have to squint your eyes when looking at the remote in the dark. The buttons are nicely spaced apart too, not tiny & close like other remotes.For digital channels, on the remote there is also a \"Guide\" button that gives you the names & times of upcoming TV programs up to 12 hours ahead.  NOW THAT'S FANTASTIC! I HAD HAD THE TV ALMOST A YEAR BEFORE I EVEN TRIED OUT THE GUIDE BUTTON.  With this feature, who needs to buy a TV guide?  This is like having cable without the bill. So let those name-junkie folks continue to pay high dollar for Sony.  Vizio gives you the same quality for a much cheaper price.  Their corporate office is located in California where you can easily register your product and get your questions answered.I have a Toshiba 19\" HD-TV in my bedroom.  I hate the controls and the picture is decent, but nowhere near as great as my Visio in the living room.  I'm planning on moving the little Toshiba to my kitchen, and buying another 37\" Vizio for the bedroom.", "Date": "January 28, 2009"}, {"Title": "Bought for the bedroom", "Author": "T. Clemens", "ReviewID": "R7RY7O03XLQRZ", "Overall": "5.0", "Content": "I did a lot of research, both on the web and going to the stores to compare the LCD tvs.  I wanted to replace the big and bulky tv that was there.  After reading the reviews and doing my research I purchased this at Circuit City because they price matched + 10% so I got a really good deal! I had read about the audio problems and would say this is true to some degree but I wasn't wanting it so much for sound.  I figured I could always hook up a surround sound system if I wanted that.  The picture quality is just as good, if not better, than the expensive models.  Also, I found that when it was hooked up to just cable and no box then I got more channels than I was subscribing to.  I got a box because I wanted the HD and I wanted to know the channel number.I bought a swivel wall mount from Sam's for $57 and was able to find someone on Amazon that sold just one component shelf so my tv, cable box and dvd are hung very nicely and I don't need any extra furniture in the bedroom--freed up space by wall mounting! All in all the whole set up of wall mounting the tv and the component shelf, and hooking every thing up took less than an hour to do.I think Vizio is putting a lot of pressure on the other maker's and that's why I have their prices come down a little. I don't care, I will still stick with the Vizio just for that reason. Quality and the right price!", "Date": "December 25, 2008"}, {"Title": "No complaints here", "Author": "Zachary R Adams", "ReviewID": "R31S10EB9UB6E", "Overall": "5.0", "Content": "I have heard this unit get so many bad reviews for some odd reason.  I recently purchased a refurbished unit for $600.  That's a steal when looking at the tv market now adays.  The unit is absolutely stunning and produces a really high quality picture.  I'm a bit of a gamer and have my PS3 hooked up through an HDMI cable and it looks absolutely superb.  I also have an Xbox 360 hooked up through the composite cables, and even with the factory cables there is a definitive difference.  I consider myself a pretty big gamer and this TV is exactly what I was looking for.  I don't need a TV that's going to cost so much that I have to re-mortgage my house but I also don't want one that is going to look like it was a budget item.  The sound is simply wonderful and it is simply hooked up to an surround sound system.  I was a little skeptical at first but after a lot of research and actually receiving the unit I am nothing but please with it.  For anyone on a budget and cannot afford a more high end model this is the tv your looking for.  It might not have some of the little extras that the more expensive television sets have but at that price who can complain.", "Date": "September 24, 2008"}, {"Title": "Great TV, poor sound system.", "Author": "Nelson Gomez", "ReviewID": "R2MP5GGZP953VE", "Overall": "4.0", "Content": "The VIZIO VX37L HDTV10A is a good TV,good image, multiple conections.PROS:-HDTV Tuner: thru HDMI or Component YPbPr.-Excellent Picture.-HDMI x 2.(Version 1.2)-Component x 2.-S-video.-Composite video x 2.-15-pin mini D-sub (VGA)-5.1 Digital Optical Audio.-Good Remote Control.-Response Time 8ms.Cont:-Poor internal Audio, Surround audio too bad, is better in stereo mode.-No \"Fine Tune\" feature for channels.in conclusion this TV have more good things that bad thing.", "Date": "October 21, 2007"}, {"Title": "I have had it for a year and a half, still wonderful!", "Author": "Jeffrey M. Wigton \"JW\"", "ReviewID": "R2LZLGD82QINQI", "Overall": "5.0", "Content": "I LOVE my Vizio! I did a lot of shopping in the LCD tv market before I bought this. I wasn't sure what I would get as Vizio is a newer franchise than SONY or SAMSUNG or TOSHIBA.  My father has a SONY 32 inch which is nice and has a good picture.  Well, my VIZIO's pic is just as good, Great HD picture, GOOD standard def, and I think even better than the SONY's!  I am so happy with it. I've heard so much negative talk about VIZIO from salespeople etc. But, maybe I got lucky and got a great one, or maybe they just want you to spend 300 extra for a name brand. Who knows.  Anyway, five stars for this particular model from me. I will add to this that I am NOT a gamer. I do not know how this model works with video games. Good luck in your search for your dream TV. It's fun!", "Date": "September 10, 2009"}, {"Title": "Had for 2 1/2 years and no problems!", "Author": "BeYouTful", "ReviewID": "RU05M12AM4CX", "Overall": "5.0", "Content": "I have had this TV for over 2 years without a problem.  It's not as expensive as others and it is a great TV for us!  We have even moved with it once so it has really been solid.  I would recommend a Vizio!", "Date": "August 31, 2009"}, {"Title": "NICE TV FOR THE PRICE!", "Author": "! MR. KNOW IT ALL  ;-b \"DR SHOCK\"", "ReviewID": "RNNEUP08POTKO", "Overall": "4.0", "Content": "I bought this set for my home bar almost 4 years ago and it hasn't given me one problem to this date. I didn't want to spend a fortune on a TV for a bar TV that was only a few feet from my home theater, so I took a chance on this set and I am very satisfied.The color and picture on this 1080i look very good and it has easy to use controls for adjusting picture etc. The audio is also very good for this set. The HD signals look especially nice and for the price it was well worth it. I have since bought two other Vizio TV's (42 inch 1080p 3 years ago and 47 inch 240hz brand new) one for my guest room and one for my living room and they work very well.I have a Sony Bravia 46 inch in my Bedroom and I like it very much, it does have a slightly better picture than the 37 and 42 inch Vizio's but they are older sets. The Sony doesn't come close to the new 47 inch Vizio 240hz though.Vizio is a brand that is certainly worth looking into as they offer a very good product with smart features for a very affordable price.", "Date": "July 6, 2009"}, {"Title": "Nice design, functions, quality!", "Author": "Stina", "ReviewID": "R264IRV8D75FD9", "Overall": "5.0", "Content": "I got this television about 1 year ago for $800 (including 8% CA tax) at Costco.And I love it!At first, I thought the picture quality could use a little improvement (needed more crisp). But, my eyes quickly got used to it and I was satisfied with the picture.The sound quality is good as well.Further, I like the appearance of it & the remote is nice looking too.The design & color scheme is nice, and I can see it matching a lot of decor themes/colors.Also, it is easy to clean!Personally, I don't like widescreen views when they stretch the picture horizontally (makes things/people appear wider--not at all figure flattering!).. so I set the television view to \"normal\" so the (left &right;) sides are blackened to adjust the picture to it's intended dimensions and not stretched horizontally to accommodate the widescreen. (The television view can be adjusted to: normal, wide, panaromic, & zoom)Overall, I would recommend it! :)(One may question why would a nice television be so economical versus the other HDTV brands..Vizio is a relatively new brand--since their reputation is not concisely established, I assume that they may have their products at more affordable rates to reach wider customer bases)", "Date": "August 16, 2008"}, {"Title": "not so lucky with this one", "Author": "M. Yang \"Peace\"", "ReviewID": "R2H5DVNPC2GAJX", "Overall": "2.0", "Content": "broken in 1 year. still with warranty, but they want you to pay shipping for a replacement of RE-Certified TV!mediocre customer service. Cold polite.", "Date": "July 8, 2008"}, {"Title": "Customer service is beyond horrible!!!", "Author": "Tomn", "ReviewID": "R1KWLXL5V4TLH8", "Overall": "1.0", "Content": "This company is the worst! Horrible customer service....If your T.V. breaks down (which it will) good luck getting someone to come and fix it!!!", "Date": "December 5, 2013"}, {"Title": "Do not buy a Vizio", "Author": "Junk TV", "ReviewID": "R28K6KPA7PBM85", "Overall": "1.0", "Content": "Do not buy a Vizio TV.  It is the epitome of \"junk TV.\"  Customer support is no help. Save yourself the frustration and buy better quality!", "Date": "August 25, 2013"}, {"Title": "Excellent!", "Author": "Research Queen", "ReviewID": "R3P7Y7Y1EYJFS0", "Overall": "5.0", "Content": "I love this tv!! After much research I finally chose to purchase this tv. It is great for what I need for it. The picture is excellent, as long as you are at the right distance, but that goes for any larger tv. I would definately recommend this unit.", "Date": "July 25, 2008"}, {"Title": "Excellent value!", "Author": "L. Frenz", "ReviewID": "RW9BQ8AQV3VMK", "Overall": "5.0", "Content": "The VIZIO VX37L - 37\" LCD HDTV exceeded my expectations. Model 10A from TigerDirect had more features than the model 20A purchased at a local store. Be sure see if you have a model choice and any difference between them. Both TVs were similar in price, but the TV from TigerDirect was delivered to my door at a lower price and faster than expected.", "Date": "May 1, 2008"}, {"Title": "Not bad at all.", "Author": "mav \"mav\"", "ReviewID": "R1X5XVL939F3FA", "Overall": "4.0", "Content": "This is my first HDTV, I bought it for $700 at costco. For that price I am satisfied. Quality and functionality is fair. If you are tight on that budget and can only fork out 800 bucks at most then this TV is for you. Maybe later, if i ever become rich I can buy a Sony.", "Date": "April 17, 2008"}, {"Title": "Junk", "Author": "Gail Knight", "ReviewID": "R20G659AEEXQ93", "Overall": "1.0", "Content": "This is the worst product we have ever purchased. The TV takes between 15 and 30 minutes to warm up each time we turn it on. After switching out the cable box a half dozen times, it still doesn't work. Junk, junk, junk. Don't waste your money. It was a dreadful purchase for us.", "Date": "September 18, 2012"}, {"Title": "Sound is very bad. Decent picture - nothing great about this TV..", "Author": "metaluna00 \"Kim\"", "ReviewID": "RHB5IGQ7JY967", "Overall": "1.0", "Content": "I hate trying to figure out what's being said! This TV makes us think we need a hearing aid! The sound is like people are speaking through a towel. The picture is ok but nothing special. We will never consider another Vizio!", "Date": "December 15, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "High resolution 1366 X 768 pixels wide screen - 16:9 ratio\nNo bright pixel defects - Guaranteed\nNo permanent burn in - Guaranteed\nIdeal in bright-light environments - minimal glare\nDigital HDTV & standard TV combination tuner", "Name": "Vizio 37\" LCD Hdtv - Vx37l", "ImgURL": "http://ecx.images-amazon.com/images/I/51bV3I58nhL._SY300_.jpg", "ProductID": "B000ROO4D8"}}