{"Reviews": [{"Title": "Truly a pleasure", "Author": "A. Murray", "ReviewID": "RMU1RY08WG848", "Overall": "5.0", "Content": "As a college student with Xbox 360, I was looking to get into high definition without spending over a thousand dollars.  At the time (last fall), this limited me to a 32\" LCD, most of which were still significantly over my budget at brick-and-mortar electronics stores.  I knew I wouldn't be buying Sony (too overpriced) and I refused to buy a brand like Vizio or Olevia because you get what you pay for, despite what owners claim.  After doing about a half year of online and in-store research, I had narrowed my search down to Samsung and LG 32\" LCDs, preferring the more expensive Samsung.  I then decided to play the waiting game for prices to drop within my range.  This year, though, using Amazon user reviews and AVS Forums as sources, I had to throw the new Sharp in with my prospective choices.  About two months ago, a wholesale store had a sale on the 37\" set that fell exactly at my price limit and I decided to pull the trigger.I've used the set now for two months and I'm convinced that I made an excellent decision.  Aesthetically, this television is beautiful and it is surprising how tiny the bezel seems.  I'm still not used to the size of this thing, especially because I had been set on a 32\" and I lived in a dorm room.  I think that 37\" is about as big as I could have gone because of viewing distance.  I was worried about the fact that there were only two component and two HDMI inputs, but my amplified over-the-air antenna plugged into the coaxial jack and the digital HD broadcasts were phenomenal, with surround sound, too (Durham, NC area).  If your cable provider feeds digital channels without a converter box, this set has a QAM tuner to pick those up, too, along with the mandated ATSC tuner and NTSC as well.  At home right now for the summer I've got it hooked up to a Verizon FiOS set top box via HDMI and, with some adjustment, the picture is spectacular.  Gaming with Xbox 360 is perfect, with vibrant colors and no perceived lag due to the 6ms response time - I couldn't be happier with that.  Black levels are where this set really shines, and they look truly black, which has historically been the dealbreaker with LCD panels.  With this Aquos, I get deep blacks without having ANY worries about burn-in, no matter how much plasma tech has progressed, one of my big concerns with the 360 and sports scores, etc.  Standard definition is surprisingly good on the \"Smart Stretch\" setting, but it varies by channel.  At 4:3, it is very comparable to a CRT, at least to my eyes.  This is an LCD and it will look grainy/pixelated at times compared to hi-def stuff, but that's the nature of the beast.I do have a few issues with the television.  Like the Sharps have been known to do for years, there was a bit of a factory \"red-push\" that resulted in pinkish skin tones, but again, some tweaking fixed that.  One issue I found annoying was the OPC backlight adjustment that dimmed or brightened the screen immediately after changing channels or going between commercials.  Even on the \"off\" setting, this occurs, but turning it on and decreasing the range to 1 eliminated the problem.  One widespread problem that I saw in my research is a sort of \"popping\" noise from the expansion of the TV casing as it heats and cools from turning on and off.  I did experience occasional loud popping for the first couple weeks, but it had no impact on my experience and that sound has now completely disappeared.  The speakers are fine for watching the news or a program on the Discovery Channel, but they really distort the low frequencies, even at a medium volume.  Of course, these manufacturers have to assume that people who buy LCDs or plasmas have some kind of audio setup.  There's no headphone jack, which I missed sorely because I couldn't watch television while my roommate was sleeping.  At the same time, this TV isn't designed for anyone to sit sufficiently close for headphones, so it's understandable.  I do have my desktop PC hooked up to the Aquos through the \"PC Input\" (RGB VGA), and it works well for playing video, especially HD, and viewing pictures.  Be aware that by default, the TV is set to receive 1280x768 (which looks a little off) from the PC instead of its native 1360x768, so you'll have to change it in the menu; I can't figure out the reasoning behind that.  Don't expect to be able to use it as a primary computer monitor - you'll have to upgrade to 1080p for that.  Still, for video, I'm convinced that at 37\" from regular viewing distance, 1080p is not discernible from 720p and therefore not worth the extra money.  For example, 1080p on 52\" has the same number of pixels per square inch as does 720p on 37\".Overall, this set is fantastic for my needs as a college student and gamer, especially for the price I got it for.  I could not be more pleased with the quality of HD programming, but make sure that at least a good chunk of your viewing will be in HD.  With the 1080p version getting to be only a couple hundred more expensive than this one, I feel that I might have some buyer's remorse because of the PC display difference.  Buyers should know that because of how big retail stores split their video signal to multiple displays and the lack of fine tuning, what you see may not be what you get.  This TV admittedly did not look good in the store, but once I got it home, I couldn't imagine taking it back.  Despite its flaws, my satisfaction is undoubtedly five out of five.", "Date": "May 14, 2007"}, {"Title": "Another great product from Sharp", "Author": "JayJay \"JJAY\"", "ReviewID": "R17WHK9KN9FMX6", "Overall": "5.0", "Content": "The LC37D43U is my second Sharp Aquos this year and I have to say that I cannot think of any reason to purchase any other brand of LCD Television. When I purchased the other one (26\")8 months ago I did not have HD yet and only bought that TV because physically it fit my needs so when I got the HD boxes from Comcast last month it was sort of a gradual transition.The 37D was purchased to replace a 32\" CRT in my basement. I prepared the HD box by getting rid of the damn coax cable and plugging in the HDMI cable for when the TV arrived and set it to the Discovery HD Channel. Plugged the TV into the power strip, hit the power button and almost fell over at how gorgeous the picture was.As almost every other person reviewing LCD HD's, I will say that SD is tough to look at when switching from an HD channel, but 5 minutes after the channel change the picture on the standard channel still looks substantially better than the CRT! I also want to mention the 6ms refresh rate. I know a lot of people don't put any credence in this, but I see a lot of complaints about ghosting in the reviews I read on other (mostly 8ms)LCD's.I watched 20 minutes of a hockey game last night which is substantially more fast paced than ANY football game you could watch and it was clear, vivid and completely lacking any ghosting or weird imagery!6ms refresh rate?? I'm no expert, but it seems like a valid feature to me!Pros:-2 HDMI Inputs (Finally I can take advantage of this on my DVD player)-Easy to use remote-default settings options on ANY configurable criteria. Mess around with picture, volume or input settings and make a mistake? Hit the reset button and start over...Beautiful!!-Sturdy constructionCons:-Switching from HD to SD and from SD to HD channels takes a little longer than I would like as the image needs to resize, but switching HD to HD and SD to SD is as fast as you would normally expect. This may be normal, but I did not see it on the 26\".-The remote does not have any codes that I could find to control the Motorola cable box that Comcast hands out for HD.(If anyone out there knows of a fix for this I would appreciate it)Again, this is my second Sharp LCD in 9 months and I would recommend this brand and this model to anyone wanting a solid, quality LCD TV!!", "Date": "March 22, 2007"}, {"Title": "Worth every cent!", "Author": "Antonio Lopez \"TonyLopez1@wlgdirect.com\"", "ReviewID": "R2LZQ7BK40I64W", "Overall": "5.0", "Content": "The title lets you know what I think.Did my homework. Did not want to step up to the plate and pay the price so, I settled for a \"cheaper\" TV. ...Hated it! Took it back and did what I should have done to begin with, dig deeper and buy one of the best. Sharp is offering us a superior product. ... Worth every cent. Oh, details: (1-10 1=bad / 10=Great): Picture quality-10, Ease of hookup-10 (unbelievable number of component options), Speaker/Sound quality-6 (Picture quality this good deserves an outside source. Ours is a Bose system. Combine the 2 and no need to go to the movies), Appearance quality-10, Warranty-10, Latest features-10 (Just came out), Remote control features-10, OVERALL: 10,10,10,10,10,10,10, and TEN! Thank you Sharp. Give those engineers a raise!", "Date": "March 8, 2007"}, {"Title": "Very Pleased", "Author": "Loveguitar", "ReviewID": "R2ZE455KCRLJ88", "Overall": "4.0", "Content": "I thoroughly investigated LCD vs. Plasma and decided that LCD best suited my needs.  But the job was only 1/2 over - I had to select the set.  I read specs, checked prices, read more specs, went to electronic forums and asked specific questions about various sets, visited stores so I could see and compare images and finally settled on the Sharp Aquos 37\".  I've had it for over 2 months now waiting to see if anything is going to go wrong, but it's just great.  It's been tested hard so far and the picture on HD is amazingly clear - I can only imagine that some news casters would prefer analog since every molecule of every mole on their faces can be clearly seen! (Well, a little exaggerated but the HD picture is truly very, very good).  The colors are beautiful.  We don't have it wall-mounted - sits in a TV cabinet.  No problem with the viewing angle or distance.  I wouldn't go any larger if you are closer than 14 feet or else the picture will look pixilated.  A big LCD screen with a short viewing distance is not the way to go.It has plenty of outputs/inputs on the back  with easy access.  I had to make a call to Sharp Technical Support about an input question and they were very helpful and friendly.  He also told me that since the set was considered a large one and would be difficult to carry to a repair shop  if a problem occurred which would require repair, that they would send someone over to the house free-of-charge for one year to fix it!  I also like the fact that Sharp is reputable company and stands behind it's products.  I avoided the disposable sets despite the raves about picture quality for fear I would have to dispose of it within 2 years if it needed repair.  I hope to be watching this set 10 years from now.If an electronic device is going to go bad, it usually does so within a year.  I have had the set on for 10 + hours a day. I don't plan on keeping it on that much in the future, but I work from home and I like to hear the background noise.  My only complaint is with the sound whenon digital stations and when watching DVD's.  It is very weak and still hard to hear even when it is cranked full blast.  I will probably get external speakers to remedy that.  However, when on analog stations the sound is very loud and easy to hear.  I don't know if the weak sound is due to the set or the station's/DVD's digital signal.What I love also is the fact that if a movie has been filmed in a dark environment - night, cave, or dark interior of a house - it is still easy to see what is going on.  On my old analog set I missed much of a movie due to dark scenes which we could not adjust to be seen.  Try watching, \"Clan of the Cave Bear\" and you will know what I mean.And you don't need a professional calibration to adjust the picture.  The menu is straight-forward and easy to understand.  It's well worth taking the 15 minutes or so to carefully go through all of the picture options and selecting those which make the picture good for you.  It will be glaring when first out of the box so take some time to adjust it.The only minor complaint I have so far is the wait between channel selections.  I'm used to going instantly from channel to channel and there is a lag time of about 1-2 seconds.  NO big deal.I like this TV a lot, and have ordered my 81 year old mother a 20\" Sharp Aquos.  It hasn't arrived yet but I will certainly critique it at a later date.UPDATE:  September 1, 2008This set has been heavily used.  It is on more hours of the day than it should be.  It has worked perfectly.  I still love this set.  No problems ever.  We watched the Summer Olympics games in China and couldn't have asked for a better set with which to view them.  The opening ceremony in Beijing was truly awesome and no details were missed.UPDATE: 2.22.12This set has been great!  Still going strong despite it being used several hours every day.  Especially now that we use it to play Wii games on and watch movies on Netflix.  I love this T.V.!!!", "Date": "November 2, 2007"}, {"Title": "Love this tv!", "Author": "Citizen Jane", "ReviewID": "R284BLI1VMU1AF", "Overall": "5.0", "Content": "Crisp picture, good blacks, good contrast, easy set-up, sound is acceptable though we've hooked up external speakers so that the audio will be as excellent as the video. Before we purchased it we read reviews of comparable sets and are pleased that we chose this one. The first set we got had a vertical line on the screen, so we called Sharp's customer service, and they very quickly picked up the set and brought a replacement, which has been perfect. We are pleased both with the quality of the tv and the responsiveness of Sharp's tech support/customer service. The only thing we would change is the glossy cabinet because of the glare and because it has to be dusted so carefully and so frequently; would prefer matte black. We purchased a Toshiba 19\" lcd hdtv/dvd combo about the same we got this Sharp, and were unhappy with the washed-out picture; we exchanged it for the 19\" Sharp combo, which has a much, much better picture and was so much easier to set up. Happy all around.", "Date": "November 21, 2007"}, {"Title": "Gorgeous!", "Author": "David Wixom", "ReviewID": "R1BFWFHFUCZXCU", "Overall": "5.0", "Content": "I've been using the same 27\" CRT TV for years now and I finally decided it was time for an upgrade. I looked around for a long time and then I saw this awesome TV. I then went into Best Buy, where they don't have this exact TV, but a similar one, and it just looked beautiful. Not only is the picture awesome, the TV itself is as well!!! But I expected all of that, what took me by suprise was how good it actually sounds. You would expect with the speakers being as small as they are, that they would sound well...small. But they really don't, they have a very nice solid sound to them. So if you aren't willing to commit to buying or connecting a sound system, it's not a must.The ONE thing I don't like about this TV, and it's minor, is the remote. I just don't like the way it's laid out. Like I said, nothing big, but if I'm having to find something to complain about...", "Date": "May 13, 2007"}, {"Title": "As Advertised", "Author": "Larry Franke", "ReviewID": "R2ODDLYZJWE8JY", "Overall": "5.0", "Content": "Like others have written, the unit has more than enough inputs and outputs; the picture quality is excellent and it looks really nice athletically. The thing I was most concerned with was the analog audio outputs (rca's), so I have the freedom to use any external amp of my choice for audio. It also has the single rca digital audio out. The unit looks beautiful (piano black) and I could not be happier. Thank you Sharp", "Date": "June 25, 2007"}, {"Title": "Nice LCD", "Author": "PaulRevere", "ReviewID": "R1AX7O5BDONB7L", "Overall": "4.0", "Content": "I was skeptical about buying a TV over the Internet, but went ahead and took my chances. Mine was sold by Amazon and shipped by Eagle services. I tracked the Eagle shipment and noticed it had arrived at the airport in the city which I work on a Friday evening around 4:30. I called and asked them if I could come by and pick-up the TV since I knew it would be Monday (or later) before they delivered it to my house 60 miles away. They said, no problem. So, I went to the airport and got my TV from the Eagle hub. This is where I took another chance. Amazon's White Glove service brings the TV into your house, unpacks and verifies that it works. With me picking up the TV from Eagle, I forfeited that insurance. After inspecting the box and noticing that it was in perfect condition, I decided to bring it home. No problems since the TV works flawlessly.The TV was easy to setup, including mounting the base. The main reason I bought this TV is because our entertainment center is 36\" wide. This is the largest LCD that I could find which was less than 36\" wide. It fits perfectly.I'm using the TV for Directv HD/SD and air/antenna HD. Off air, widescreen, HD video and sound are fantastic. I've ready complaints that you can't stretch HD pictures in 4:3 (box) format. This is true on a Toshiba I own, so apparently this is common.Pros:*Nice bright, crisp picture on HD broadcasts. SD stations are fuzzy, but  that is common on HDTV's.*Lots of inputs*Remote is well designed (and lonnng)*plenty of setup/configuration options.*Manual appears to be well written but I never used it since the TV is that easy to figure out on your own.Cons:*Changing air/antenna channels is a \"little\" slow but I can live with it since I seldom watch more than one air channel at a time. If you are on a dish, changing channels is as fast as your satellite receiver can change. Tuners have been around for decades. Surely Sharp could have done better in this area.*SD channels don't look as good as they do on our Toshiba Regza 32\", but I think this has to do with the extra screen width. The larger the TV, the worse SD channels will appear.*Our Toshiba has better sound, I think, but the Sharp is not bad at all. I hooked up an old set of Logitech Z-2300 speakers to the TV and now it sounds much better.*The HDMI inputs are in a weird location, at a right angle which is not easy to get to. Make sure you get an HDMI cable of sufficient length just in case you have to move the TV out of its spot. Being at a right angle, the HDMI cable connector will bend, destroying the cable and possibly damaging the HDMI port on the TV.Rating: Minus one star for the issues mentioned. Other than that, kudos to Amazon for shipping (free) the day after I ordered and to Eagle for a safe, four day trip to my local hub.", "Date": "January 17, 2008"}, {"Title": "Sharp Aquos 37\"", "Author": "C. Ray \"cray\"", "ReviewID": "R2SZ147SIBEMNI", "Overall": "5.0", "Content": "I recently purchased the 37\" Sharp Aquos and am pleasantly surprised with its performance. This tv was a steal for under $900 with free shipping. If you do not have Direct tv with the HD package or an HD antenna you might be disappointed with the picture quality of regular cable television. The picture will look better on a 10 yr. old tv than an lcd. Get Direct HD package. The Aquos has tons of inputs and has a nice bezel. The built in speakers are fine, but if you love movie watching you should pick up a surround sound theater system. The shipping service was great! The package arrived promptly from FedEx home shipping and was well packaged. This tv is a must buy. I would recommend it for anyone who lives in an apartment.", "Date": "December 10, 2007"}, {"Title": "Avoid Sharp, Consider Samsung Instead", "Author": "M. Donovan", "ReviewID": "R2W3J1PE1PIP05", "Overall": "2.0", "Content": "I got the LC37D43U on 5/30/08, by Nov it had a red line thru it from top to bottom. I called Sharp for warranty service, they came out and said the screen needed to be replaced. It would be 10 days. I called them 25 days later and found out they had not even ordered the part yet. In the end it took 7 weeks, they replaced the TV today.Pros:The PQ is fine. Colors good, chrisp imagesGood remote compared to others, easy to use menus.Good sound for TV speakersCons :Quality, it should not fail in a couple of monthsLOUSY customer service, NO follow up, no calls...zeroThe tuner is slow to change channelsThe side HDMI connections are not easy to connect to unless you  have a small handSharp is famous for having banding issues on larger setsReccommend ; The Samsung 37\" instead. It is a better TV ( I've seen it ) but was not available when I got the Sharp. Not many choices in 37\"", "Date": "January 12, 2008"}, {"Title": "Impressed", "Author": "Jason Severson \"trustbutverify\"", "ReviewID": "R2NPTYAEI2SP8L", "Overall": "5.0", "Content": "The Sharp Aquos LC37D43U 37\" LCD HDTV is -SHARP-, clear, bright and has more input ports than I expected. The Sharp Aquos LC37D43U 37\" LCD HDTV is not the cutting edge 1080P res that you might be looking for but at half the price and my eyes I couldn't justify any other set also, I really like the minimal look -not so much box and a lot more viewable screen (I wanted a TV not an alter built around one!).I also like the PC port, I've gotten rid of my 19\" LCD... wouldn't you!?All and All very satisfied.", "Date": "February 8, 2008"}, {"Title": "Early exit soon after warranty expired", "Author": "Hank B.", "ReviewID": "R28REM716BWK0A", "Overall": "2.0", "Content": "Bought an LC-37D43U from Sears in June of 2007, impressed by competitive price and picture quality in the display room. First purchase of large flat-screen TV.Brought TV home and set it up, TV worked fine. Used in home environment, not abused or used extensively, half-hour to an hour some evenings, kids cartoons on Saturday morning, also hooked up to DVD player. Not a heavy TV-watching household.Forward eighteen months to January 2009, TV is playing daughter's DVD and goes black, completely inoperative. Take it to Sharp authorized service center, diagnosis is fried Main Board, [...] parts and labor to fix.Called Sharp.usa Aquos Advantage service to see if they would comp the new board, cost $280, I felt main component should have been more robust, eighteen months to failure is pretty short in my opinion.No deal. No sympathy for out-of-warranty problems. Will consider more upscale brand for next purchase, will also consider extended warranty, these electronics are looking pretty fragile.  Sharp Aquos LC37D43U 37-Inch 720p LCD HDTV", "Date": "February 18, 2009"}, {"Title": "Awesome picture but sound could be better", "Author": "Sachin", "ReviewID": "R3UDZ90Y27WVOC", "Overall": "4.0", "Content": "I bought this TV since it percieved it to be the highest value for money in 37\" segment. The other TV I was considering was Samsung which was at least $150 more expensive at that time.Pros:1) The picture quality is very good and noticably equivalent to Samsung. 2) Personally I think the TV looks much better than Samsung as a furniture (when shut-off).Cons:1) The max sound is very low. I need mostly around 80% of max vol and for some movies even the max volume is diffucult to hear if you have a air blower (a/c or heater) running at the same time.Adding additional speakers is pretty much required for this TV.", "Date": "March 26, 2008"}, {"Title": "Meets High Expectations", "Author": "Robert J. Micklas \"NothingsEZ\"", "ReviewID": "R1O2KW9EA1JI3C", "Overall": "5.0", "Content": "The User Reviews at Amazon.com were a primary reason that I selected the Sharp. The Amazon.com \"white glove\" shipping policy and product price were also important. Free shipping sealed the deal.The set lived up to the positive user reviews. Some are satisfied with bright, saturated color. I am quite concerned with detail, clarity, brightness, and viewing angle as well. I feel that if you can define the lapels or collar on a black jacket and the whites and blacks are true, and color is acceptable your picture and adjustments are acceptable. I actually had to crank down the brightness a bit, but the other factory settings worked for me. I prefered to turn off the automatic color feature which could be quite useful. I was impressed that apparently this Sharp technology was awared an Emmy.I felt the audio was better than other reviewers, and very good. If you are not satisfied, it is likely that you require a full audio system.I was pleasantly surprised at the quality of broadcast HDTV. I am using my old antenna system. Yes, there are a few of us left. I expect that the HDMI inputs (2) may be useful when I purchase PC / Internet \"by the drink\" TV technology when it is available (supposedly 2008).I placed the set in an armoir that is 36\" wide with about 3/64\" to spare. Side speakers or controls would have been a major problem. Some useful buttons on top, and bottom mounted speakers were a big plus for me.I agree with other reviewers that channel switching is sluggish. I'm not sure how other sets compare on this issue. I found this to be a minor flaw. A true channel surfer should visit a box store to determine if this is a problem for them. Four \"favorite channel\" buttons can be set on the remote to ease this problem.I am pleased with the purchase. I expect that tech prices will always drop, and chose to pass on economy brands. I believe the biggest advantage of HDTV is watching any sports event and enjoyed the second greatest Super Bowl ever (Namath is still King).", "Date": "February 8, 2008"}, {"Title": "Sharp Aquos LC37D43U 37\" LCD HDTV", "Author": "Ricky J. Gray", "ReviewID": "R2F465MPOA2OU6", "Overall": "5.0", "Content": "My wife and I are pleased with this LCD TV.  The picture is sharp (pun intended) and we can't wait to get a Hi-Def or Blu-ray DVD player.  There are plenty of inputs & instructions are clear.  The speakers in the TV are located at the bottom corners (you can see the chrome-colored grilles on the pic) and are very long and narrow making the reproducing of bass-tones noisy at higher volumes but most will be connecting it to a surround sound system, anyway.  Besides that, the only other thing that could make this TV perfect is if the speaker-outs were controlled thru the volume control or remote.  (edit - after using our DTV for a while, we figured out the setting in the options menu to use amplified external speakers and can control volumn thru remote) We don't have a surround system but we do have a three-piece PC speaker system that works wonders on the sound.  If you can't go with a surround-sound, just do like we did.  Use a PC speaker system with sub-woofer.  We had ours collecting dust but now they're back in service.", "Date": "January 29, 2008"}, {"Title": "Great HDTV at a great price to boot!", "Author": "L. Dominish \"HD Converted\"", "ReviewID": "R16MDAPO3689BZ", "Overall": "5.0", "Content": "I just received this TV via Amazon and 6th Avenue Electronics and I am VERY pleased!  The color and sound quality is amazing. The size, perfect! Even my boyfriend, who was sceptical of my purchase and the size, is in love with this TV. Would recommend this set to anyone!", "Date": "January 15, 2008"}, {"Title": "so far, so good", "Author": "Matthew Breen", "ReviewID": "R51MWFJNXXNHN", "Overall": "5.0", "Content": "I bought this around Christmas.  Everything looks amazing and I haven't had any problems at all or dead pixels or anything like that.  I needed to fit the tv in at 37\" so this was my decision after researching a bunch of 37 inchers.  Like I said above, so far so good.", "Date": "January 14, 2008"}, {"Title": "Pretty nice TV", "Author": "B. Carr", "ReviewID": "RI3XL14X6SXBO", "Overall": "5.0", "Content": "I shopped forever before buying an LCD flat panel TV.  I looked at all the major brands, and chose Sharp for it's reputation and having owned one in the past, made the purchase easy!.  I could see no difference in the quality of the picture from the Sony, Samsung and Panasonic models.Only thing I might see as a fault is the fact it takes almost 2 seconds for the TV to change channels.I have also seen others that have complained of a weak base, but it went together easy and seems sturdy.  The sound on this TV is very good and the picture is very good with good response times and very good blacks.If I were to buy another LCD, I am pretty sure it would be this same model!", "Date": "December 7, 2007"}, {"Title": "GREAT TV, BUT!!", "Author": "oneheartca", "ReviewID": "R331H100DHYB2O", "Overall": "2.0", "Content": "The Layman's Summary:Love what I've read about the T.V.  Spent weeks researching the best value around.  Sharp is a good brand.  Purchased it online (first time I've ever bought something with this large of a price tag...because if something goes wrong...then what? Can't go back to Circuit City or Best Buy when you purchase it from someplace you've never heard of in NJ).I digress...Received the T.V. yesterday. I'm excited. Family is excited. Wired it up. Turned it on and PRESTO! A thin vertical black banding line the width of coffee straw is ever-present one-inch to the right of the screen's center running the entire height of the screen.  I'm upset. Family is upset. Dog hasn't stop howling. Worst fears of making big ticket online purchases are confirmed.Emailed 6ave and Sharp customer service that evening for resolution.  Received an email AND a personal call from 6ave customer service who took the time to set up a SHARP service agent to repair the T.V.  Sharp had me take some pictures and send them in for review, which I have done.  Awaiting action.6ave gets credit for jumping on the problem ASAP, but receiving a brand new T.V. that's broke from the get go is not a way to improve customer satisfaction and repeat future purchases.SHARP ARE YOU LISTENING?!", "Date": "February 8, 2008"}, {"Title": "Terrible Disappointment", "Author": "Beyond Disappointed", "ReviewID": "R3IOBPE98RCEFU", "Overall": "1.0", "Content": "I purchased the Sharp Aquos after hours upon hours of reading reviews and THOUGHT I was going to be getting a solid TV. Instead what I got was a $900 piece of junk. The HD channels look grainy at best. The colors in standard definition are terrible. Sure, there are a lot of features that can be adjusted but none of them make the true skin pigment even close to real. If you do get a color setting you are happy with you still have to deal with the fact that people look unrealistic. Every person's face and skin look as though an artist drew them with oil colors. No amount of tweaking can get rid of this problem. Because Tiger Direct does not accept returns, only exchanges, I am now stuck selecting from one of the televisions they carry - none of which I am enthused about. Thanks for nothing Sharp.", "Date": "January 23, 2008"}, {"Title": "LOVE THIS TV", "Author": "Dawn Rago \"kitty krazy\"", "ReviewID": "R2VGS6R5U6SCEM", "Overall": "5.0", "Content": "I bought this tv through Amazon last December.  The first one that arrived worked fine for a couple of weeks, but then the HDMI inputs just stopped working.  I called Amazon and they immediatley sent out a replacment. The replacement has been working perfecly ever since then.  The HD channels are beautiful on this tv, and now I rarely watch standard def tv, even though it looks pretty good for SD.  The sound on this tv is great until it reaches the low base sounds, where it makes a bit of a rumblimg noise.  I eventually intend to get additional speakers for when I watch movies where the sound gets basey.  Any other issues you may come across can usually be fixed by doing general adjustments. Out of all the tv's I've bought (RCA, Sony, Samsung, Philips, Magnavox), Sharp is my favorite. This was my 3rd Sharp purchase, and I am still in love with them all.( I finally let go of my big Sharp 27\" tube tv, which still had a beautiful picture, but was just too bulky and a pain whenever I moved!)I highly recomend this tv, although I would think you could find it for a better price.", "Date": "November 28, 2008"}, {"Title": "Picture is grainy from DVD's + Sharp Warranty consists of threats", "Author": "Everyday purchaser", "ReviewID": "R2AVCD7SXKRQR1", "Overall": "1.0", "Content": "The good points of this TV are: 1. being able to buy it through Amazon, 2. good owners manual.Unfortunately the bad points are:1. The picture from DVD is very grainy. It is an extremely poor picture. Please read the latest issue of Consumer Reports: you will find the Auqos ranked near the bottom in every screen size (I wish I had that issue several months ago).2. The power button has to be hit several times to turn the unit on.3. The volume from one of the HDMI connections is very low.4. When contacting Sharp Warranty for points 2&3, they \"threatened\" numerous times that I would be charged if the tech could not find an issue.  The threat of being charged came up so many times & also very rudely, that it came across this threat was a tactic to avoid warranty work.I suggest your read the latest issue of C.R. before considering this TV.", "Date": "November 8, 2008"}, {"Title": "w00t!!!", "Author": "Benjamin M. Snyder", "ReviewID": "R3APH2LIUDY4HR", "Overall": "5.0", "Content": "I LOVE my new tv. I got it because it fit in my space good and I am amazed at how good it looks and sounds. I would highly recommend this tv. I think for a TV under 40\" you don't really need the 1080 dpi. I did a lot of research and this is teh one I got it is sweet!", "Date": "June 9, 2008"}, {"Title": "100% Satisfied...", "Author": "Joshua Hackler", "ReviewID": "R37ZIIU0D5J53A", "Overall": "5.0", "Content": "I bought this television five months ago, and could not be happier.  My buddy bought a 41 inch 1080p LG at the same time, and i can not see one single bit of difference in picture quality between the two.  Xbox 360 looks every bit as good in 1080i on my tv as PS3 does in 1080p on his, same with hd cable tv and blu ray.  All in all, this is the largest size 720p set you can buy with no difference in picture, and i swear to you that there is absolutely NO difference.  I love this tv, i dont quite understand the opc setting, as it dims and brightens the picture according to darkness, but is sort of annoying so i leave it off, and the only other problem is the cord falls out when you move the television, but how often do you do that.  I now swear by sharp, and i had previously had a very strong loyalty to samsung.  Another buddy is a sony guy, and he is planning on a sharp next time around, even though he had just purchased a 1080p sony.  Out of the box, it is so bright it hurt my eyes, which is good...which is good.  The color and blacks are amazing. Dont hesitate for a second to buy this set, you will not be sorry.", "Date": "May 12, 2008"}, {"Title": "Great picture quality!", "Author": "Cody", "ReviewID": "R1Q80FJLDQENWX", "Overall": "5.0", "Content": "Chose this TV after months on reading reviews, watching friend's TVs and in-store TVs.  Very happy with the Sharp.  Works great with upconverting and normal DVD.  Also was very pleasantly suprised with the clarity of off-air TV with my 20 year old bunny ears - digital stations are so much better than anything I ever got with my old tube TV and very clear w/ RD and HD signals - and I live 20+ miles from the broadcasts.  No prolems at all. Like many other reviewers, the sound is ok, but am happy I got surround sound system in addition to TV (combo DVD, radio/stereo, surround, mp3 input).  Again very happy - and do not miss or regret 1080p at all!", "Date": "May 12, 2008"}, {"Title": "great purchase", "Author": "gadget girl \"sam\"", "ReviewID": "RFT3AKRW0L8LM", "Overall": "5.0", "Content": "i have a few friends that purchased sharp aquos and having been able to watch it and inspect it first hand helped in making the decision to get one myself.  i'm the type that is very hesitant in making such big ticket purchases.  i tend to research things to death and find it hard to commit since so much money is being spent on it.  so after 2 months of researching, i finally made the decision to go with the sharp.  i do not regret it for one minute.  i love it!  but in order to enjoy all that my new HD tv had to offer, i had to upgrade to an HD cable box (a must to have the full experience of HD television).all in all, this was a great purchase.  the quality is amazing, design is sleek and compact, and a wonderful product.", "Date": "April 7, 2008"}, {"Title": "Great Product!  Fast Shipping. A++++", "Author": "John E. Ertle", "ReviewID": "R1ZOAHH7XGP9HN", "Overall": "5.0", "Content": "The HDTV works great in High Definition, Basic Cable, DVD and even as a monitor for my PC.", "Date": "April 5, 2008"}, {"Title": "Excellent value", "Author": "David Lococo", "ReviewID": "R13C75SUMFUHIH", "Overall": "5.0", "Content": "Extremely clear and sharp with HD content.  Automatically adjusts screen ratio for best picture. 2 HDMI inputs greatly simplifies installation.  PC input terrific also.  Placed this in the Master Bedroom and it is now the preferred viewing spot.  Highly recommend for all small screen installations.", "Date": "March 22, 2008"}, {"Title": "Great TV at a Great Price", "Author": "Mark Rinehart", "ReviewID": "R1ZVTVOMHR99R0", "Overall": "5.0", "Content": "This is an excellent tv. Crisp, clear picture especially in high def. Plenty of adjustment features to obtain the picture and sound you prefer. Very easy to set-up and customize. Plenty of input/output ports for most tv viewers. Unbelieveable colors and details. Standard definition broadcasts are also improved. I do not have a high def. dvd player, but since it is a progressive scan player the picture quality is very close to high def. with this tv. I would recommend this tv to anyone looking for a top of the line tv at a great price. I got mine for $900 with free shipping.", "Date": "January 8, 2008"}, {"Title": "great product", "Author": "Julio Ortiz \"Jouls\"", "ReviewID": "R3MG9QRBGCXPKW", "Overall": "5.0", "Content": "Great Image and very useful Operator Interface,I think I have made a very good purchase.", "Date": "December 30, 2007"}, {"Title": "Great TV", "Author": "Stewart Benedict \"dog lover\"", "ReviewID": "R1IHEPZWEEE7LD", "Overall": "4.0", "Content": "I held off for a long time on buying this unit, initially looking at 32\" until I saw some in store and noted they weren't much bigger than my 1980's 27\" I intended to upgrade. Decided to treat myself and the wife for Christmas and have been very pleased. We mostly record programs with MythTV and watch them via an XBox in the living room (running Linux). My daughter bought me an Aeon Flux box set and it looks great on the set. Haven't yet tried a video game. Only complaint is I can't get quite enough volume via the XBox through the set. Looked at some surround systems to enhance the set but was little put off by the prices. In all a great set. I saw my local Walmart had the Sanyo 37\" for just a little less than the Amazon price for the Sharp, and looking at them side by side at a store, there's no comparison, the Sharp picture has much more clarity and contrast.", "Date": "December 29, 2007"}, {"Title": "Nice tv", "Author": "Goonk \"Goonk\"", "ReviewID": "R1ZTB4S4GXYBWP", "Overall": "4.0", "Content": "I was shopping for a new LCD tv with size as a major requirement.  I started looking at this model based on size and purchased it after reading the reviews and looking at the tv at a local Sears.  It arrived fine and we have been real happy with it.  I am using an antenna to receive local digital channels and they are very clear.  Having a few issues with VCR playback, but that is the only complaint I have.  The sound is amazing.  Easy to setup and configure.  PLenty of connections.", "Date": "December 12, 2007"}, {"Title": "Great Purchase", "Author": "Robert V. Carrasco", "ReviewID": "R1DF3G61QT0UGI", "Overall": "5.0", "Content": "Purchased Sharp Aquos LC37D43U 37\" LCD TV from 6th Ave Elec. Arrived in great shape no problems. Beautiful picture; totally blown away by quality of the images in HD. Very happy customer.", "Date": "October 23, 2007"}, {"Title": "Everything I wanted", "Author": "Sean T. Dahlberg", "ReviewID": "R3TPPWPIT2F5I1", "Overall": "5.0", "Content": "I was looking for a cheap but quality TV for playing xbox 360 and this is definetly it. Its not a 1080 or anything but the video quality is still amazing and I have had not a single problem with it since the month ago that I bought it. Easy to set up and small enough still to not take over your whole room. If I had to choose between this model and paying 500 dollars more for the latest 37' from sharp I would definetly go with this. No cons that I can think of.", "Date": "October 15, 2007"}, {"Title": "TV received broken", "Author": "Lisa Warrillow \"Marketpro\"", "ReviewID": "R3LJ08YGYK2E6F", "Overall": "2.0", "Content": "Second TV finally delivered after first one received broken & returned. Eagle Shipping very unreliable and \"white glove\" service poor. Would not repurchase.", "Date": "January 28, 2008"}, {"Title": "Crystal Clear", "Author": "Double_D", "ReviewID": "RBZUIZZ41KUBY", "Overall": "5.0", "Content": "I am very happy with this TV. HD is crystal clear, dvd's very good. Analog is analog. Was an excellent purchase. Would buy it again.", "Date": "September 1, 2007"}, {"Title": "Will I ever get my TV back?", "Author": "A. Williams", "ReviewID": "R36HNWHLHWISUU", "Overall": "1.0", "Content": "Definitely would not recommend any Aquos TV to anyone! I had this TV about three weeks before a purple line appeared across the screen out of nowhere. I took it back to the retailer who told me it would take at three weeks for them to diagnosis the problem. They couldn't simply exchange it because of a deal they have with Sharp. So after three weeks they told me they were going to exchange it. So far it has taken another three weeks for Sharp to send another unit. Sharp and hhgregg have had my TV about twice as long as I have.", "Date": "September 5, 2007"}, {"Title": "Sweet TV", "Author": "Joe Devore \"Just my $.02\"", "ReviewID": "R2RAYWD32HT5OM", "Overall": "5.0", "Content": "I love this TV, Everything works perfectly with my Comcast Digital Cable and Philips up-converting DVD player. The images are crisp, clear scenes. i don't have any issues with image stretching properly as I use the cable boxes feature that locks the output to only those that are fed into it and the TV just reproduces them as-is. I don't get some channels in wide screen and others being stretched to fill the whole screen but rather the black bars on the sides.", "Date": "May 14, 2007"}, {"Title": "My step into a new age !!", "Author": "S. Mcdermaid", "ReviewID": "R1CF9TWS8GBVJ7", "Overall": "5.0", "Content": "After lightning wiped out all my electronics I was forced to replace my old,but relieble TV with the Aquos LCD HDTV.  I'm very pleased with all aspects of this TV.", "Date": "September 8, 2007"}, {"Title": "Sharp aquos HDTV", "Author": "Daniel R. Demeo", "ReviewID": "R5WG0TYOYY27N", "Overall": "5.0", "Content": "The TV is excellent in all respects.  Butterfly Photo delivered my replacement TV(the first TV was defective) by courier. His name was Nuriel and he was extremely helpful and set up the TV by himself in a skillful manner.  I would rate the service of Butterfly Photo as outstanding.", "Date": "August 8, 2007"}, {"Title": "Warning", "Author": "Written Pleasures", "ReviewID": "RL5MQQLHKQ10L", "Overall": "1.0", "Content": "I purchased the 32\" version of this set 14 months ago and the sound just went out entirely.  Of course, the warrantee is for only 12 months, so I am out of luck.", "Date": "August 13, 2007"}, {"Title": "Espectacular", "Author": "N. D. Morel \"Ned\"", "ReviewID": "R3516M5IL4DPPZ", "Overall": "5.0", "Content": "Compre este, mi primer LCD TV hace tan solo 3 dias. Habia oido del prestigio del Sharp Aquos, en particular algunos modelos que no son precisamente el LC37D43U. No se si existe alguno mas espectacular, pero este lo es. Ademas del precio, la calidad y nitidez de imagen y la elegancia del disenio hacen que valga la pena la compra. El sonido no es bueno, en particular con los canales analogos, pero con la television satelite y los DVD, el sonido es aceptable. No imagino como se ve la television digital. Recomiendo un sistema de audio alterno, con lo cual el sonido se torna \"de pelicula\".En fin, recomiendo este tv de Sharp.No he podido configurar o programar el control remoto para operar mis otros equipos de sonido (Home Theater, DVD player, SAT Receiver). Las instrucciones del manual son imprecisas e incompletas. Alguien me ayuda?", "Date": "April 19, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000MKWDJE"}}