{"Reviews": [{"Title": "Great Picture for the Price", "Author": "Rebecca L. Lindamood \"bibliophilebeccy\"", "ReviewID": "R3VUHTH8QA8EE7", "Overall": "5.0", "Content": "I found the TV around which to build our new den.Stores never seem to set up HDTVs properly and do not do them justice. They usually have standard signals that are split to many TVs. The pictures are not true HDTV or the video is highly compressed causing a lot of pixelation (cartoonish squares).The Phillips looks absolutely fantastic when the component cables are used with Progressive Scan DVDs and HDTV broadcast signals.Many people do not realize that your regular attic antenna can pick up HDTV signals from the networks that are high quality pictures at the new 16:9 format. The Phillips built in receiver is a must. Many HDTVs do not have an \"Over the Air\" receiver. This one does! The Super Bowl was crystal clear as was the Piston/Cavaliers game.There is nothing worse than a stretched or squashed picture. The Phillips also makes it easy to change the 16:9 format to 4:3 quickly for the standard format and composite signals from the satellite/cable box.Make sure that you understand the difference between the types of signals used. In order to view HDTV, you have to use component, HDMI or HD broadcast programming. Even if the program says it is HD, if it is not received through any of the three available with the Phillips, then you're watching plain old TV. Kind of like using a Porsche to deliver mail.Summary: The Phillips 42PF7321 meets my standards and expectations.", "Date": "February 5, 2007"}, {"Title": "Was awesome for 4 years", "Author": "imagine_a_world", "ReviewID": "R3G8HRC4QDZV6S", "Overall": "3.0", "Content": "Loved this TV for 4 good years. One day it just went black and some of the pixels turned red and blue and started jumping around like fireworks. The sound still works but we have no idea what happened. This shouldn't have occurred after only 4 years. Gave it 3 stars because picture was outstanding and sound is great. TV is very hot (as plasmas are) but otherwise no complaints.", "Date": "October 24, 2010"}, {"Title": "BEWARE of TECH FOR LESS!!!!!", "Author": "NoBodySpecial \"Fishing\"", "ReviewID": "R2NLTRE1G5GZJ3", "Overall": "1.0", "Content": "I ordered one of these Tvs for my Niece from Tech for Less. It arrived with numerous electrical problems. There was no shipping damage, they shipped a defective TV and they knew it.Be VERY careful if you plan to purcahse anything from Tech for Less.", "Date": "December 22, 2008"}, {"Title": "Spent $1800 bucks - only lasted 1.5 years", "Author": "K. Casey", "ReviewID": "R1PIA9Y4NOMZVQ", "Overall": "1.0", "Content": "We bought this HDTV only to have it break after just a year and a half!  It had some minor problems with the video output during that year and a half, but yesterday we were watching it and it suddenly started smoking and the screen went black.  It only has a one year warranty.  We tried calling Phillips tech support.  They couldn't tell us what happened, how to fix it, what the 4 blinking red lights meant or any sort of helpful information!After looking around online we have found MANY people that have had the same problem with this TV.  This will be the LAST Phillips product we ever buy!Do NOT waste your money on this TV!", "Date": "June 14, 2008"}, {"Title": "Plasma TV", "Author": "danny's charm", "ReviewID": "R635GZTQBJSJP", "Overall": "4.0", "Content": "Now that I have it plugged in and on the table where I can enjoy my tv it's great.  The color is real nice but for other people who buy this item or any 42\" tv MAKE SURE you have someone to help you take it out of the box and help you set it up.  When I got my tv the guy who brought it to me only put it in my house but REFUSED to help me take it out of the box.  It is a big heavy tv. I called my cable company and had someone to hook all the cables to it and help me set it on the table.  I had even put the stand on it myself.  It's a great tv and I love it however the picture goes off then comes back on at times.  it could be my cable box.", "Date": "May 25, 2007"}, {"Title": "Beutiful Display", "Author": "C.M.V.B.", "ReviewID": "R2CGEGN5W238F8", "Overall": "5.0", "Content": "I love this TV - using regular cable analog box the display is beutiful and I have not even used the HDMI or component hook up yet. My childs gamecube display using standard composite hookup is so clear - I cannot believe that it will get better using high def inputs !!!WHAT A GREAT DEAL on a plasma TV", "Date": "December 27, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "Built in ATSC Quam tuner\nPixel Plus for increased resolution\nHDMI and 2 HD-CVI inputs\nUSB connect for picture and music\nSide AV and Headphone output", "Name": "Philips 42PF7321D 42-Inch Plasma HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41TK1EHC60L._SX300_.jpg", "ProductID": "B000FVUCNE"}}