{"Reviews": [{"Title": "A very good value", "Author": "T. TRAN", "ReviewID": "R1SZXP0C4P7BC0", "Overall": "4.0", "Content": "At $499 ($699 minus $200 rebate at CompUSA), this model LT26HVX (not the HVE) with a decent spec (800:1 brigtness, 1200:1 contrast, 8ms response time) is worth every penny. The weak spot is perhaps the standard mode display which is subpar but only when compared with top of the line models only. I watched it alongside other top models like Sony, Sharp, Panasonic, Samsung and the diff is just 9/10.  WHen used with HD OTA broadcast or DVD movies at home, I found the picture quality is quite nice.WHen used as a computer monitor, unlike some complaints in here, I have had no problem using a DVI-D dual link cable at a resolution of 1280x1024. No additional software, no issue whatsoever. Any issue must be from the cable or the graphic card incompatibility. My DVI-D Dual link cable is only $12 from Buy.comOne nice thing about this TV is you can split sources almost at will, including both DVI and VGA allow me to use it as 2 monitors (yes TWO monitors) anyway I like. My Panasonic LCD cannot do this. However, this TV has only 1 SD tuner and no HD tuner.Sound is so so, actually it is a bit loud. Remote is somewhat awkward.At $499, what can I say ?", "Date": "February 23, 2006"}, {"Title": "Good Value Brand", "Author": "Glenn R. Howes", "ReviewID": "R2KIAD5IQZP2DB", "Overall": "4.0", "Content": "I've owned this TV for two months and have been happy with my purchase. It's big and bright and gives sharp pictures when hooked up via DVI to my cable box. Its handling of old fashioned standard definition is nothing to write home about; I have tweaked and tweaked with no joy. On the other hand, high quality progressive scan DVDs look great over s-Video.  After some serious tweaking, I attached my desktop PC to the monitor via the VGA connection to get a 1360x768 resolution without scaling, but I found it impossible to attach a PC via DVI and get a picture without scaling. Just because it's DVI doesn't mean it's a good PC connection.I didn't bother with the built in speakers. If you want the full HDTV experience, invest in at least a 5.1 speaker system. Good sound is just as important as a hi-def picture. If anything, I wish the speakers were detachable.Switching the inputs via remote is cumbersome, and the menu system as a whole is non-intuitable.In summary, good high definition picture, good selection of inputs, mediocre standard definition, and cumbersome interface.I should also mention that the price of this TV varies wildly from vendor to vendor and from day to day. You would be advised to shop around.", "Date": "December 29, 2005"}, {"Title": "Exceptional Value, Best when used with HD/High Res sources", "Author": "David E. Taylor", "ReviewID": "RHNO4FTADD2YN", "Overall": "5.0", "Content": "I purchased this TV today ($499 at h.h.Gregg - $100 less than the price yesterday) after reading numerous good reviews here and several other places.MY EXPERIENCES/TESTING SO FAR:I have watched 1080i and 720p HDTV sources, as well as 480p DVD, all via component (R,G,B) inputs, and they look great.  I connected my laptop with an nVidia go7900GS graphics card, and found that the only resolution that was decent via the VGA connection was stretched 1024x768 - not so good.  Via the DVI connection, on the other hand, the OS recognized the TV as an HDTV, and asked for the most appropriate HDTV resolution (720p) and it looks excellent (crisp, & not stretched), and a DVD played via Windows MCE looked at least as good as via a nice stand-alone HK DVD player.  I also tested Windows Media HD sample content (720p & 1080p), and they look great, too.  Standard Def, even digital SD are what most would expect from this sort of TV; okay, but not great.  The speakers have received mixed reviews, and all I can say is that they seem fine for what they are - inexpensive TV speakers.  If this is your main media display, by all means get a nice 5.1 setup, but if this is just going to be a secondary TV, the speakers are more than adequate.  Overall, I'm very pleased with this purchase, and especially so when price is taken into account.", "Date": "June 30, 2006"}, {"Title": "Worth your money!!!", "Author": "Hediadri", "ReviewID": "R1U0IOWIRUSIXY", "Overall": "5.0", "Content": "This is my 2nd tv, after a 20 inch 90's GE CRT TV. I tought i was just buying a generic lcd tv, but nooo this exceed my expextation on sound quality and picture quality. to the guy that give this TV a bad rating, try something called digital cable or even dish! DVD picture is amazing and Playstation 2 games becomes more real. The only downside of this tv probably the design.. hmm what can i say some silver or metalic color will probably makes this tv better looking rather than just plain black. Anyway for 500 bucks after lining up all nite in front of Circuit city on black friday, i think this TV is well off worth my time and money.", "Date": "May 17, 2006"}, {"Title": "Good value", "Author": "San Jose Reviewer", "ReviewID": "RB0G1U98BXHVS", "Overall": "4.0", "Content": "When compared to other LCD TVs, it's a great value! Overall, I'm happy with the purchase.Pros: It has a great picture quality when connected with something besides coaxial cable. It looks great when viewing widescreen DVDs. Speakers are good. It's much cheaper than most other LCD TVs of the same size (at the time when this review was written). The power light remains off when watching TV. It saves different TV settings depending on the video source used, which is good. Good for high def video. It's much lighter and thinner than a tube TV of the same size.Cons: When turned off, the extremely bright power light turns on. The power light doubles as a bright nightlight. I recommend several layers of masking tape or a bit of electrical over this light. When viewing off the air video through coaxial cable (instead of a DVD or PC video), it's very blurry (too many compression artifacts). The \"HDTV Calibration Wizard\" DVD helped to signifcantly reduced the blurriness. Switching video sources isn't as easy as other TVs. If you're usually watching low def video, most TVs like this won't be a good value for you, and a standard tube TV may be better for you.", "Date": "May 27, 2006"}, {"Title": "Great TV", "Author": "Gary \"Maldonado\"", "ReviewID": "R2H99PZ0VUXEVZ", "Overall": "5.0", "Content": "I purchased this television as a spare DVD/HD set which doubles as a PC monitor and video gaming TV. It performs very ably all of these functions.The color decoder is surprisingly accurate out of the box at \"Middle.\" The unit calibrates reasonably well with DVE, though I have found that after switching inputs, sometimes the brightness setting is 'off' upon returning to say, the DVI input. It will display the brightness of setting '50' when the slider is actually at 46. A quick trip to the user menu to bump it one tick up or down 'restores' it to the proper brightness for the numerical setting.The black level is average for an LCD panel - not as good as newer higher end sets, but much better than a normal PC monitor, and more than usable for movies. As with any LCD panel, the black level is much more forgiving during bright scenes than in dark ones. The viewing angles (which are not incredibly forgiving as far as PQ goes) play a role in this, also. The advertised 170-degree viewing angle is a gross overestimation - you see something, but not anything close to a high fidelity picture. I would say the real-world viewing angle is 100 degrees horizontal by 70 degrees vertical - still not bad compared to a projection CRT screen, or a laptop or small PC LCD monitor.Buyers should know that this is a 15:9 monitor, not 16:9 - this has no impact on picture quality, it just means very tiny black bars on 16:9 dvds, and slightly larger bars on 2.35:1 material.Nevertheless, for the price, I am stunned that this unit performs as well as it does. I am quite happy with my purchase from that standpoint. The build quality is also very good - this is a solid unit. Less discriminating viewers who make this (or a larger Syntax unit) their first HDTV will likely be blown away.", "Date": "February 9, 2006"}, {"Title": "Good picture, lacks details in dark areas", "Author": "Jagadeeshwaran Natarajan \"Jagi\"", "ReviewID": "R2VE9MSQJRRT7", "Overall": "3.0", "Content": "I've owned this TV for couple of months now. The first TV I bought had 7 dead pixel, so called up syntax and they were happy to replace the TV (though it took them 4 weeks to send the replacement). The new(replacement) one had no pixel issues. The picture quality is great for HD signals and standard defenition picture (my cable box upconverts everything to 1080i) is much better than my regular TV. But the dark areas in the Picture lacks detail. I tried to play around with the TV settings, but no improvement yet. I guess that's the inherent disadvantage of the flat panels. You may want to shell out a lil more and get a nicer flat panel if you want more details in black. But for the price I paid i am ok with the quality of the picture.", "Date": "January 31, 2006"}, {"Title": "Excellent TV. Decent computer display as well.", "Author": "IT Guy from Hawaii", "ReviewID": "R3PN96IR6CDVLY", "Overall": "4.0", "Content": "It's a great TV. I bought from Amazon years ago and it's still running strong. The max resolution it supports when hooked up to a computer is 1280x1024. Overall picture quality is outstanding though. Bright picture and rich blacks. The remote is horrible. Controlling some of the PIP functions may take you a while to figure out. The speakers on each side of the screen make the monitor seem a lot bigger then it actually is. The speakers are extremely loud and actually sounds really good. I will run this set until it dies.", "Date": "January 11, 2009"}, {"Title": "Fantastic TV", "Author": "Coby", "ReviewID": "R13IDFDTWOQH7", "Overall": "5.0", "Content": "Had this for quite few yes and still perfect the pic is crisp and looks led quality great buy in this world of \"disposal TVs\"", "Date": "May 19, 2013"}, {"Title": "Olevia 26\" HDTV LCD TV", "Author": "D. Pennie", "ReviewID": "RLU0SNQYNAEMT", "Overall": "5.0", "Content": "I bought this TV from a different website back in 2004. It has been working great all these years! I adore the PIP options. I can game on one input and watch TV/news on another. It's a great quality image and sound with great sound options. I just love this TV. When and if it ever dies, I'm going to buy another just like it. Only warning I have is don't lose the remote. It's kind of hard to find a universal remote that has codes for this TV. I have found one that worked with it, but couldn't do the PIP options, which was a hugely sad situation! Love this TV forever!", "Date": "February 27, 2013"}, {"Title": "Great TV for the price! Very clear and sharp resolution.", "Author": "Michael Edgar", "ReviewID": "ROSMILL47DBJ4", "Overall": "5.0", "Content": "This is a great HDTV with many connections and great picture. It has a VGA and a DVI port for use as a computer monitor and two component connections for HD 720p. When I first took it out of the box it seemed much larger than 26\" and it has a great widescreen. I have never had a single problem with the TV in 5 or 6 years. It looks great mounted on the wall. It is a thin TV for its age, and only weighs about 10 or 15 lbs. Overall I would highly recommend this TV to anyone looking for a reliable decent sized TV with great picture and function. Easily a 10 out of 10.", "Date": "December 20, 2012"}, {"Title": "Problems with using as a computer monitor", "Author": "D. Lindsey", "ReviewID": "RRVVGU34PSKFC", "Overall": "3.0", "Content": "I purchased this LCD for primary use as a monitor for my home computer. Three problems make this less than satisfactory. One, unlike my Toshiba 32 inch, there is no setting to change the blue background to black. This is needed when your computer's power settings \"shut off\" the monitor. It cuts the signal but the screen stays on with a blue background. Secondly, the monitor stand is set at a slightly down angle and does not adjust. I've had to place something under the front of the stand to achieve a viewable angle. Lastly, you cannot change the Aspect in VGA mode.The color and clarity are fine, this monitor would work well as a HDTV if you have an input source as it does not have a tuner. The multiple inputs are a plus.", "Date": "March 2, 2007"}, {"Title": "Surprisingly Great Product!", "Author": "A Photographer", "ReviewID": "R2AY3651MD7KP2", "Overall": "5.0", "Content": "This LCD TV has a great picture quality right off of coaxial cable (no digital cable needed)!  Both sound and picture quality exceeded my expectations!  It looks even better when viewing DVDs.  I've even connected an HDMI Up-convert DVD unit for fantastic viewing - it displays the entire screen!  The speakers are of good quality and sound great - even at low volume. It is very light and thin when compared to other comparable TV's of the same size.  Color decoding is nice and accurate.  It can be easily adjusted to personal tastes and viewing environment.  The black level is good and better than a monitor.  It has great 170-degree viewing angles!  The specs are also great:  800:1 brightness, 1200:1 contrast ratio, & 8ms response time. This TV is well worth the money.", "Date": "February 5, 2007"}, {"Title": "Very Poor Technical Support (if you can get them to contact you", "Author": "Sam Degan \"Kili\"", "ReviewID": "R48ZJ3OXGIE7P", "Overall": "2.0", "Content": "My Tv started to have sound problems and I sent off an email to Olevia. No response. Then tried calling support - had to leave a message.Days later after no response I called and transferred to sales - helpful guy and wanted all the details but again he could not help and would have tech support call me back - NO LUCK with call back3 weeks go by and now I am getting rather ticked at the no response. So rewrote email again - no response.Called tech support and left my number - no response.Again called sales and got another person.Got a live body - Yaaahoo! - could not help but forwarded me to customer service (to give me the service at home number). Customer service could not help and said Tech support were the ones to talk to. After an hour plus on hold I get to talk to a tech. 1/2 hour later he came to the conclusion that I needed service.The support issue is really bad. My recomendation is call them yourself before you buy the TV.Oh, and Good Luck!!!!", "Date": "January 6, 2006"}, {"Title": "decent TV - non existant customer service", "Author": "Terri E. Hartz", "ReviewID": "R1QFVM317WL85Y", "Overall": "1.0", "Content": "We are pleased with the picture quality of this set, better than expected for the money but it does have a major problem. Pre recorded VHS tapes do not work with this TV, when played the screen goes blue. Yes I have tried three different players with the same result. Repeated calls to customer service and technical support Are fruitless, no one answers the phone. Emails are only answered by their computer telling you they recieved your email. I have been trying to contact them for at least a month. Bottom line...Stay away from this company. Read other current reviews from people who had problems with their TV's. If you are considering purchasing an olevio try calling customer service first and see if I'm exagerating.", "Date": "December 15, 2006"}, {"Title": "Save your money for something better", "Author": "John Macy \"jdm513\"", "ReviewID": "RO2MHGMN275DR", "Overall": "2.0", "Content": "As usual, I buy something the impress the Mrs, and end up apologizing for not letting her see it before I buy it, although I attempted to explain that the stores are showing the TV's running special DVD's for display, and not local broadcasts.I replaced my 14 year old 27\" JVC CRT TV with this LCD and what a dissapointment. When playing DVD's thru the DVI connection it looks great (so would any TV), but the regular broadcasts are terrible. Factory defaults are bland and bright. If you turn down the brightness, skin color turns either a sharp pink, or the opposite, a sallow yellow. No happy medium.Same goes for the aspect ratio. It really only looks fairly decent when you set it to 4:3 and takes the \"stretching\" effect out.This will probably end up as a \"very expensive\" computer monitor since watching TV is uncomfortable, or on EBAY.", "Date": "February 1, 2006"}, {"Title": "BEWARE! Syntax Warranties!", "Author": "William L. Mckenzie \"Bill\"", "ReviewID": "R1W7BEL75RPR2X", "Overall": "1.0", "Content": "Syntax clearly states that their warranty is only good for the origninal purchaser. I got my daughter one as a gift, gave it to her bran new, in the factory sealed box and Syntax refuses to honor the warranty, (and yes I calld everywere and tried everything).", "Date": "September 6, 2006"}, {"Title": "Screen busted within 18 months - TV now totally useless", "Author": "A - NYC", "ReviewID": "R217L9UPWG694E", "Overall": "1.0", "Content": "I bought the Olevia 30\" through Amazon back in March 2005 (at a cost of $1150 plus delivery at the time) ... a few days ago - Saturday July 29 2006, the screen suddenly went black and the TV died - the sound still worked but no vision.  I had a TV expert friend look at it yesterday - and he said that it has gone for good ...Lasted less than 18 months --- so much for the 12 month warranty.My recommendation - stay away from Ovelia ... majorly disappointed - and have to falk out $800 for a replacement ....", "Date": "August 2, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "Olevia LT26HVX 26-inch HDTV Ready Widescreen LCD TV General Features: Black cabinet\n26-inch active matrix screen size 16:9 widescreen aspect ratio HDTV display ready\n1366 x 768 native resolution 1600:1 dynamic contrast ratio 700 cd/m2 brightness 8 ms response time\n178° horizontal and vertical viewing angle NTSC TV system support\n480i, 480p, 720P and 1080i resolution support", "Name": "Syntax Olevia LT26HVX 26-Inch Flat-Panel LCD HD-Ready TV", "ImgURL": "http://ecx.images-amazon.com/images/I/416QW4SZFFL._SX300_.jpg", "ProductID": "B000BKN2NQ"}}