{"Reviews": [{"Title": "Great TV despite some flaws", "Author": "stan", "ReviewID": "R11XTZKLZKZB77", "Overall": "4.0", "Content": "I've had this tv for over 6 years and though it's starting to show its age it still works greatThe only cons I have for this television is that it has no HDMI input, and it weighs 170+ pounds.", "Date": "May 18, 2011"}, {"Title": "I love this TV!", "Author": "V. Kim \"Sony lover\"", "ReviewID": "R1PJ1HPKPO8R57", "Overall": "5.0", "Content": "I purchased this television set in 2003 and from the moment I set it up it has been amazing in every aspect. I love the picture quality and the SRS trusurround is a very good sound from a television, it even gives the illusion of surround sound if you put the TV in the right acoustical environment. It does not have 1080P capability but that is not a big deal for me, its hard to tell a difference if any as long as you aren't sitting a foot in front of the television and what do you expect from a TV thats outdated almost 9 years?One bit of advice for anyone who currently owns or is purchasing this set used, don't be afraid to open up the back of the television and clean off the lamps, they are dust magnets so if your picture starts to seem dark, just get a soft cloth and dust them off. After dusting you want to adjust the convergence to get the picture right. Do that every 6 months or so and this tv will last you forever!", "Date": "August 24, 2011"}, {"Title": "Very Pleased", "Author": "deborah lynn trindade", "ReviewID": "ROYYFK6AMU3O0", "Overall": "5.0", "Content": "It has worked perfectly for the three years of ownership. I alway have good luck with Sony products. The Japanese make good products.", "Date": "December 15, 2008"}, {"Title": "Sony Stinks Again!", "Author": "Another Dissapointed Sony buyer", "ReviewID": "R11KKECJ8QJTMS", "Overall": "1.0", "Content": "Once again Sony is lagging from making good products. Sony used to be top of the line buy but has fallen further down the line as they think the name can sell their products. Sony products are \"has been.\" They lack quality. My television lasted a little over four years and went out. The stand by light blinks 9 times and the tv never turns on. If you do any research this is a common issue Sony buyers have. The worst part is there is nothing we can do. The part is no longer made. Their suggestion was to have a repair man come out and see what they can do. Yeah!!! Thanks for nothing! Buy that time, I can purchase a much better tv from Samsung or Panasonic and spend the same amount for a newer better tv and guaranteed to have it work!!! Thanks again for nothing Sony!!!", "Date": "November 28, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0000BVD9P"}}