{"Reviews": [{"Title": "Absolutely THE BEST!", "Author": "J. Weisgal", "ReviewID": "RV1AQLROKVXKF", "Overall": "5.0", "Content": "I feel as though most people make a purchase, and then justify it by raving about it's performance, even if in their heart of hearts they know it is junk.Just recently, an acquaintance of mine purchased an LCD television that, while asthetically pleasing, has one of the worst pictures I have seen.  Trail, ghosting, poor colors, etc...  DLP projection is simply the best picture you can buy if dollars spent VS. quality of picture is your goal. If you MUST hang a TV on a wall, KNOW that you MUST ALSO spend at least $7000 for a picture that begins to match the quality of a $2500 DLP.  The cheaper flat screens are cheaper for a reason.  You do the math.This Samsung model is just gorgeous.  HDTV is simply stunning.  Colors are crisp, black levels are INCREDIBLE, and the picture is 95% perfect right out of the box!  I had an engineer look at this set and say \"it is perfect when you plug it in\".  So many sets need \"tweaking\" for days before they look right, so this is an added benefit on this model.Also, the set has PIP, which can be used for watching TV while also using your computer!  Simply run video out from your computer and you have a 50 inch HD Monitor!!  Awsome!This set has HDMI, which no one really uses yet, but it is nice to have for the future.  For those who do not know, HDMI is ONE cable that carries HD PICTURE AND SURROUND SOUND.  It also has DVI input for the BEST HDTV picture available.The look (pedestal) is love it or leave it, but if you are here, you obviously find it pleasing.I can not comment on the sound as I have never used it (I have a home theater system), and this brings me to a slightly offpoint comment, but one that is important.  if you DO get a surround system, please do this television justice and do not buy some junky home theater in a box!  Sound is actually MORE impotant than picture in terms of a visceral experience, and you do yourself no service to buy this set, and then use garbage sound. Also, BOSE, while nice, is overpriced and simply silly.  DO RESEARCH, and find that no respected audio/videophile respects BOSE, when they know better can be had for less.Sorry...back to my review.  This set is wonderful.  You can use a nice open-air AV rack to complement it visually, and as far as gaming goes, XBOX in HD is fabulous!!!ONE NOTE ON DVD's.  this television has a native resolution of 720P  DVD's only have a maximum of 480P, and as a technology, DVD's are not that great, which is why HD DVD's will be out this year (DVD's that do 480p,720p,1080i,1080p ie. High Definition DVD's) Do not be disappointed if DVD's look a bit fuzzy, pixelated, whatever... they look that way on ALL HDTV's.  It is the DVD, not the TV.  Still, they look nice.Well, that's all.  You may want to wait until 1080 native resolution sets are available later this year, but mind you they come with a hefty price tag!  For now, this is THE set; and I say that not because I own it, but because it is true. Enjoy!TOP NOTES:PROS:Good ClarityGREAT BLACK LEVELSNice ContrastBEST COLOR ON THE MARKETIt is light...about 100lbs for a 50 Inch TV!!!!!CONS:Can't hang it on a wall (it IS only 11 inches deep)Pedestal not for everyone", "Date": "January 5, 2005"}, {"Title": "My Favorite Retreat", "Author": "Chen E. Zhou \"ravencrest reader\"", "ReviewID": "R22UXT0965J1M6", "Overall": "4.0", "Content": "I have this TV in my game room over the garage.  I'll tell you it is the most awesome piece of AV equipment I've ever owned.  The HD Picture quality is breath-taking (I have the HDNet/ESPNHD packages from TimeWarner, the Discovery documentaries shot in HD are just crystal clear and so realistic, feels like you are right there.  Best of all, there is no service adjustments you have to do to make the picture quality improve, it's right out of the box top quality.  I did adjust the brightness and tuned down the sharpness to fit my viewing taste.  I also configured the 1280x702 resolution for my computer viewing pleasure, which is hooked into the DVI port.  I am sitting 10 foot from it and it is like I am viewing it right on my office desk, so clear and sharp.Pros:1.  No service adjustments.2.  Low Fan noise, not noticable at all.  Not much heat.3.  Picture quality is amazing.Cons:1.  Heavy stand, 80 pounds by itself.2.  Not easy to put AV components around.3.  The little shadows sometimes noticable on screen, because the screen hasn't completely heated up yet.", "Date": "May 2, 2005"}, {"Title": "Great Contrast, Great Black-Level", "Author": "Donald H. Nguyen", "ReviewID": "R1A2GBZ3Y0MCDS", "Overall": "5.0", "Content": "The GUY COMPLAINING about \"HD-ready\" being deceptive IS AN IDIOT...  by his argument, he should give every HD-ready TV a bad review.  In fact... very few TVs out there are HD-Integrated, and almost all you'd see in the store are only HD-ready.  This guy probably complains about a car with an AUTOMATIC transmission not driving by itself.This TV has a great contrast ratio, and great black levels.  MY X-Box looks just plain awesome on it - of course, you need a HD Video Adaptor(component video) for it ($20 for the Microsoft adaptor - don't waste your money on a Monster Adaptor, even the EB sales reps advise against the Monster component adaptor, but I digress.)  No signal delay issues with the X-Box.The only thing is that there's no where to put stuff, and when you look at the specs of the add-on shelving unit, it's much wider than the TV, .....  but I just got a glass/metal shelf to put next to it to put my cable-box, X-Box, DVD player on.", "Date": "October 21, 2004"}, {"Title": "Amazing", "Author": "Smart Shopper", "ReviewID": "R1W757QCVNO8M0", "Overall": "5.0", "Content": "This TV has the best picture that I have seen so far. Consumer Reports rated this TV as the best of all DLP TV's as of March of this year when they ran their last DLP comparisons. I was in the market for a plasma but many of the plasma's out there are not able to produce deep blacks and whites are sometimes off-white. In my opinion, DLP's offer more bang and value than a plasma or LCD tv. This TV will not dissappoint and if you are trying to research which TV to buy, you will notice that this model gets excellent reviews from professional reviews and owners from numerous different websites.", "Date": "July 9, 2005"}, {"Title": "Awesome picture...", "Author": "Srinivas Nittala", "ReviewID": "R3CJEY6WG4KSRJ", "Overall": "5.0", "Content": "The picture right out of the box is incredible. I have Dish network HD package. When I powered on the TV and watched the HD channnel, the picture is stunning. The colors are bright and the black levels are excellent. I researched for the TV so long and ended up with this beautiful piece. Just buy it and enjoy. It is stylish. I recommend it.", "Date": "January 11, 2005"}, {"Title": "Ignorance", "Author": "D. Berndt", "ReviewID": "RJZU6O2AVWPLD", "Overall": "5.0", "Content": "You should rate products based on their quality not your ignorance.  \"HD ready\" is a term used in every store which means that it is capable of producing a HD quality picture when provided with a source (i.e. a HD tuner or HD cable box).  If it has \"integrated HD\" then you know it has a built in tuner.  Do some research before you bash a product and a company.This is an outtake from bestbuy's websiteWhat's meant by \"HD-Ready\"?Some HDTV sets on the market incorporate HD-capable displays coupled with a built-in HDTV tuner to receive over-the-air HD broadcasts (currently available only in certain markets, these broadcasts are becoming increasingly common as the 2006 digital-broadcast deadline approaches). Often referred to as integrated HDTVs, these models are indicated on the BestBuy.com Web site by the designation \"with Built-In HDTV Tuner.\"However, the vast majority of HD-capable TVs on the market are what's known as HD-ready TVs (or HDTV monitors) - high-definition displays, often including one or more built-in NTSC TV tuners for reception of conventional analog TV broadcasts, but which must be connected to a separate HD source in order to realize their full potential. Since most current HD content is delivered via satellite or cable systems rather that over-the-air, some consumers (especially those who reside in areas where over-the-air HD content is not yet available) consider an HD-ready set to be the best solution for their current and future needs. But to experience HD broadcasts (where available) right out of the box with no additional investment, a built-in HD tuner is the ticket.Like HD-ready models, integrated HDTVs generally provide exhaustive connectivity options, so you can always add cable or satellite sources as well to broaden your HD options. Conversely, over-the-air HD tuners are also available in stand-alone set-top boxes, often combined with cable and/or satellite reception capabilities. Obviously, there are lots of ways to achieve your desired HD viewing experience, so we advise you to weigh various factors (including cost, convenience, and content availability) before making your decision.", "Date": "October 15, 2004"}, {"Title": "Captain Kirk model hits the mark", "Author": "Doug \"Doug\"", "ReviewID": "R2SRVZI3B97MH", "Overall": "5.0", "Content": "I have a 32\"WegaXBR...awesome TV, but then won a 42\"Phillips Plasma in a contest....was given the chance to take a gift certificate instead.....SHOPPED hard for a few weeks and nearly got the Mitsi 50\" DLP until I saw this newest version of the Samsung 50\"DLP.Was pleased by the next few comparisons I saw and made the purchase.  Excellent HD pictures on my Comcast HD channels.  The SD channels are not nearly what my XBR had, but the Sammy allows for an auto 4:3 setup for NON HD channels...which helps a bit.Anyone looking to educate themsleves, I'd strongly suggest visiting [...]  Since buying I'm on there all the time.  Just bought the stand for this TV from circuit city and LOVE the contemporary look and hidden wires....next up...might need a DVR.Good luck to all who give this a shot...you won't be dissappointed.DJ", "Date": "November 15, 2004"}, {"Title": "Best TV I ever had!", "Author": "A. Cherkashin \"Alex\"", "ReviewID": "R1F3K57W4W7BCV", "Overall": "5.0", "Content": "I have it for 2 weeks now, and love it from the day one. The picture is very good right out of the box the HD is simply incredible (I have dish HD package + locals...) For the standard definition you will need a little tweaking to make it look good (just look around on the avsforum.com) For the absolutely best picture you will probably need professional to do the final tuning on each input. The pedestal is OK for me, I still find a place behind TV for a small AV rack. The only slight disappointments for me are the shiny speaker panels on each side, they sometimes reflect to much light in a not so dark room. Overall I think it's one the finest TVs around, and probably is the best for the price", "Date": "February 11, 2005"}, {"Title": "4 Years old and still going strong...", "Author": "Just Lil' Ol' Me", "ReviewID": "R17T44QPNQGRRV", "Overall": "4.0", "Content": "My HLP-5085 is 4 years old and still going strong.  Over 8000 hours on it and still on the original lamp!  I do have a spare ready just in case.Have had zero service issues with it.There are, however, two design anomolies.1.  With the integral stand, your component (receiver, DVD Player, etc...) storage options are limited to the funky stand made for this TV.2.  Direct-access to the input ports doesn't work.  It makes programming a remote, especially the \"too smart for their own good\" Logitech remotes, extremely difficult.  Attempting any sort of programming to directly switch to the HDMI, DVI or other ports simply doesn't work.  You have to use the \"Cycle\" method, and that also fails most of the time.  The best thing you can do is put the \"Input Next\" button and code on the front page of all your device screens so it's handy.Other than that I have zero complaints about this TV.The new 61 LED 1080p units are dropping in price like a rock.  Less than $1800 for the top of the line 61\" set!I'm going to wait until it hits $1500 then I will bite.  I'll probably give this one to my sister as I'm sure it will be still running strong in a year.", "Date": "July 22, 2008"}, {"Title": "LOVE IT", "Author": "John C. Brewer", "ReviewID": "R129YYD5P5J5R7", "Overall": "5.0", "Content": "I GOT THIS TV AT A STEAL FROM  A CIRUIT CITY DISCOUNT OUTLET FOR JUST 890 DOLLARS IT WAS STILL NEW AND IN THE BOX.I HAVE HAD IT FOR A YEAR NOW AND STILL CAN SAY IT LOOKS AND WORKS BETTER THAN THE NEW SETS IN THE STORES FOR 2500 DOLLARS OR MORE.I HAVE MY COMPUTR HOOKED UP TO IT AND THAT IS SO AWESOME I STILL DROOL ON IT WHEN I USE IT THAT WAY MY COMPUTER HAS BLU RAY SO I WATCH BLUE RAY ON IT AND IT IS AWESOME. I HAVE A SAMSUNG HOME THEATER HOOKED UP TO IT AS WELL AND THE ANY NET SYSTEM MAKES THEM WORK AS ONE UNIT THRU THE TV'S REMOTE. WHEN PEOPLE SEE THIS SETUP THEY ALWAYS LOOK DUMBFOUNDED WITH ITS SLICK OPERATION.IF YOU CAN STILL FIND ONE BUY ITYOU WONT BE SORRY.", "Date": "July 22, 2008"}, {"Title": "Center Piece for Home Theatre", "Author": "Snowdwarf", "ReviewID": "R2EYRIXOKYCWK9", "Overall": "5.0", "Content": "This TV is absolutely wonderful as you may have noticed from other reviews.  I have had this for about 1 year and have had no problems.  The fan is so quiet and the picture quality in HD and black levels are great.  I have an XBOX 360 hooked up with a component inputs and the games look spectacular.  Coupled with an elegant stand, it really makes the living room. One other bonus is the DVI and HDMI inputs for true digital picture and sound from higher end DVD and HD boxes, and input of computers.  Surfing the internet on 50\" couldn't be more fun.Downsides I would say are the heftiness of moving this TV and sound inputs.  Find a good spot and leave it there as it does have a glass bottom for the stand. It could use some digital sound inputs as well such as optical or coaxial.Other than that all you do is plug it in and go.  It looks perfect right out of the box.  It does not produce much heat at all which is also a benefit if you have it in a smaller room with many other a/v products attached.This TV has been the best a/v product purchase I have ever made.  DLP will continue to be the leader in picture quality and price from here on.", "Date": "November 26, 2006"}, {"Title": "Best TV you can Purchase", "Author": "J. Kemp \"Cnet Reviewer\"", "ReviewID": "R2Y0AI8LQKL0ZR", "Overall": "5.0", "Content": "This is the Best HDTV that you can buy.  The DLP picture quality is so far superior to LCD or Plasma.  The sound quality is fantastic.  The built in pedestal is awesome.1 complaint:  The remote control could be better, get a logitech remote or use the cable box remote.", "Date": "August 23, 2009"}, {"Title": "The worst money I've EVER spent!", "Author": "Timothy D. Wainscott \"Psychedelia Fan\"", "ReviewID": "R2ZJ3YDVAFE7ET", "Overall": "1.0", "Content": "I bought this set 11/04 for $3,539.97 from Circuit City.  I did EXTENSIVE research before plunking all that $$ down on a TV.  The pundits were very clear:  for a big high-def TV DLP was the way to go and Samsung was the best at DLP.Liars!!The second year I owned it I had all my friends over watching NFL Kickoff Sunday.  Just as the kickoff was about to happen on the second round of games --KABOOM!  It sounded like a shotgun going off!  What it was was the bulb had blown up -- that took $300.00 and 5 days to get rectified.  OK, I was warned about the bulb issue.  I got over it.After I had the set for 3 years and 1 month suddenly these black pinstripes (10 sets of 8 pinstripes) appeared over the whole screen, just like that.  Samsung was as interested in helping me as a US Marine wants to get Osama bin Laden a cold glass of water and a pillow.So I call a local TV repairman and he came out to have a look.  A VERY nice man and quite intelligent as well.  He told me that the DMD board went bad and Samsung charges $750.00 for a replacement board, plus $200.00 labor to install.  He warned me that in DLP's the color wheel tends to go bad as well and they are equally as expensive to replace.I asked him why a 3000+ dollar TV doesn't last for at least 10 years, like my old trusty Toshiba tube TV?  He said that the new technology TV's -  DLP, plasma, LCD - have an average user life of 2-4 years.  That's right, you read correctly -- 2-4 years!!!I figured quickly that buying a new set that is current would cost me ~ $1300.00 and fixing the Samsung would be throwing good money after bad.I went ahead and bought a cheap Sanyo 46\" LCD -- looks EVERY BIT as good as the Samsung did in it's prime.  Plus, it was hella easier to set up and such.Buyer beware -- Samsung is really bad.If you do buy a new HDTV, be sure to put out the extra bucks to get at least 3 years insurance on it, regardless the brand.  It's a little extra money but will be well worth it if your set is a lemon.It will be interesting to see if the glowing reports on this set are still \"glowing\" after a couple years passes.", "Date": "June 7, 2008"}, {"Title": "The best tv", "Author": "C M E L", "ReviewID": "R3C52PZ5VQE55G", "Overall": "5.0", "Content": "I've had this television for over 7 years and i must say this is one of the best television I have owned.  Crisp, bright colors. Nothing went wrong,well until 2 days ago the picture left.  No picture but sound.  I guess It has done its years.  I prefer to  fix it than buy a new one.", "Date": "November 23, 2013"}, {"Title": "This tv is greath", "Author": "neal", "ReviewID": "R29T2RD2G1KOD8", "Overall": "5.0", "Content": "Love this TV!while all my family are goin threw a bunch of LCD or plasma TVs I just need to change my bulb.the picture is amazing.I feel it is better than my tube HD Toshiba. It might only be  720p but it does the job great. Ive had it for about 9 years. The only drawback is its size.", "Date": "April 3, 2013"}, {"Title": "best buy!!!", "Author": "Pacome", "ReviewID": "R175ADKQ3PCBGE", "Overall": "5.0", "Content": "Very good TV.!!!! I love it!! Very good best buy!!! Samsung did it, very good outstanding DLP TV!!!! Love it!!", "Date": "December 15, 2012"}, {"Title": "Don't buy", "Author": "Gregory Schulz \"M5Greg\"", "ReviewID": "R4O5QC7PV7LP9", "Overall": "1.0", "Content": "I bought mine brand new and loved it. After 3 1/2 years of ownership the video card went out. A replacement card, if you can find one, is $950 plus installation. Do a google search and you will find this is a very common failure. I will never buy another samsung product again. I paid $3000 and it only lasted 3 1/2, that's pretty sad. Half of the screen would go black after 1/2 hours of being on. I'd turn it off for 5 mins. And the picture would come back.", "Date": "April 21, 2012"}, {"Title": "Never was that impressed", "Author": "MichaelLewis84", "ReviewID": "RQVFHDX7LFTB6", "Overall": "2.0", "Content": "I agree with the guy whose TV quit during the football game. Mine has lasted longer than his before messing up. Luckily I won the TV. I was never impressed with the picture. And it does get HOT and makes a noise. Today I've had it almost 4 years and the bulb must have blown out b/c hubby said it made a loud sound (like his did). I will order a lamp, but if it tears up again, that's prolly gonna be it for me. My neighbor has a Panasonic plasma and the picture is unreal. So much better than mine.", "Date": "June 23, 2009"}, {"Title": "Do not buy Samsung", "Author": "William D. Turnipseed", "ReviewID": "R1KOTEM547FKJX", "Overall": "1.0", "Content": "I purchased a Samsung television about eighteen months ago. Two weeks ago the picture became all distorted. Since my television warranty was through Circuit City I had no choice but to call a television repair person out to look at it. As soon as he walked in the door he knew what the issue was. He told me that the part would cost almost as much as the television and that his recommendation was to throw away the television and purchase another one. After doing some research I discovered that there were quite a few Samsung televisions that were going out and that the parts were on backorder for about a month. Samsung was also not helpful. I trying to discuss this with SamsungTweets on Twitter, but he blocked me when I asked why nobody called me like he said they would. The only other answer I got from Samsung was that I needed to take it to a service center; this is after I told them that a television repair person had looked at it. From what I can tell from looking on television repair forums, Samsung televisions look to be pretty flakey.", "Date": "June 22, 2009"}, {"Title": "Great TV, but not the best hardware quality", "Author": "Dapdap", "ReviewID": "R3HBENPGNTSW1X", "Overall": "3.0", "Content": "I had this tv for a little over a year. The picture quality was very good for it's time, and the style of this tv is out of this world.  As soon as my warranty expired I started having issues with this tv. I hardly ever used it(average use once a week), and took very good care of it.  So in my opnion these problems shouldn't occur so early, and the tv itself now is near unusable.  My tv is plagued with green pixels scattered across the screen, and basically you don't know what you're looking at anymore.  This happens every time I use it, and majority of anything I watch is infested with green pixels.Trying to find a fix for the problem, I was told time after time, that many people are having issues with this model. That and Samsung needs to send a Tech out to troubleshoot the tv, and I was told not to go this route. I'd suggest if you'd get an HDTV, that you look at other models with a better failure rate.", "Date": "October 13, 2007"}, {"Title": "One and a half years", "Author": "M. Reyes", "ReviewID": "R8VD0OEAWPEZF", "Overall": "5.0", "Content": "I bought this TV in June 2005. I have not had any problems with it and the picture quality in HD is awesome. This TV is powered up an average of 6+ hours every day and the bulb is still bright and again never had a problem. Like other reviewers noted the DVI and HDMI inputs are nice to have, the picture quality is very good, it has a bright display, but on the downside the unit is heavy and would need at least two people to move safely and it doesn't support 1080p, which at the time of purchase was pricey and not widely available. Overall I am very happy with the TV and would highly recommend it based on my experience.", "Date": "December 6, 2006"}, {"Title": "\"HDTV-ready\" means HDTV-ready", "Author": "Duane Schell", "ReviewID": "R256FI0JM1R28U", "Overall": "5.0", "Content": "I do not feel sorry for consumers who don't educate themselves before making a major purchase such as this.  \"HDTV-ready\" clearly implies that the television is ready for an HDTV feed.  Giving a porr rating to a fine product because you don't like the marketing of the ENTIRE INDUSTRY is just plain silly.", "Date": "October 15, 2004"}, {"Title": "Best Damn Purchase I Have Made on Amazon.com", "Author": "Kailua-Kona", "ReviewID": "R3QL9ZQ4S8DQEX", "Overall": "5.0", "Content": "God I love this TV.  This is why terrorism will eventually fail.  The masses of this world love good deals that they find on-line and we will outspend them to death.Back to the Samsung. . .If you can't figure out HD-Ready from HD-Integrated then you need to cut back on the white lines.  Picture quality from a clean HD signal is awesome.  Garbage in Garbage out.  If you hook up a crusty old VCR to this beauty it will like crap.This is by far the most bang for the buck for a DLP TV.  Those crafty engineers on the Korean penninsula are busy crafting these beauties.  Let's hope the North figures out that DLP's are better use of their time then making ICBM's. . .peace out, I gotta go buy more stuff.", "Date": "October 16, 2004"}, {"Title": "Zero star is more like it", "Author": "David Bentitou \"bentdavi\"", "ReviewID": "R2KGLBQYMUWIQ7", "Overall": "1.0", "Content": "Samsung service is garbage, I have a 2300$ TV purchased 18 month ago , and I am ready to give it to goodwill.I have not been able to find a repair man around Phoenix area, and when I finaly did, he asked for $ 900 to repair it. and that was not sure that would be it, this was only a minimum estimate.So As far as I am concerned, Samsung is JUNK", "Date": "December 28, 2006"}, {"Title": "No HDTV tuner", "Author": "Auroran", "ReviewID": "RM6HHIVPQDTAI", "Overall": "3.0", "Content": "This unit is being sold as a large-screen HDTV-ready television, but has no HDTV tuner.  The FCC already requires that at least 50% of all 36\"-or-larger TVs sold have HDTV tuners, and by 7/1/05 100% of such TVs sold must have HDTV tuners.Frankly, I think it's confusing, perhaps even deceptive, to call this a large-screen HDTV-ready TV without making crystal-clear that it has no HDTV tuner.  Most other stores make this clear by calling such a unit a *monitor*, not a TV.  This unit will be banned from the marketplace on 7/1/05.", "Date": "October 14, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "50-inch HD-ready DLP projection television with 2 digital-video and 1 PC inputs; 53.6 x 54.7 x 20.5 inches (W x H x D) with supplied pedestal\nCompatible with 480i, 480p, and full high-definition 720p and 1080i signals; offers 1,280 x 720 native pixel resolution\n2 HD component-video inputs, 3 each composite- and S-video inputs, 2 RF inputs; 1 RF and 1 composite-video output\nNo risk of screen aging or burn-in effects; offers all-input upconversion, 3:2 pulldown reversal, and other enhancements\n15-watts-per-channel x 2 stereo audio system with SRS TruSurround XT simulated surround sound", "Name": "Samsung HL-P5085W 50-Inch Widescreen HD-Ready DLP Television with PC Input", "ImgURL": "http://ecx.images-amazon.com/images/I/41KBK50YC0L._SY300_.jpg", "ProductID": "B0002MLXA2"}}