{"Reviews": [{"Title": "Glass panel front is VERY reflective", "Author": "Bill in Virginia", "ReviewID": "R16EXJW8SR6T65", "Overall": "3.0", "Content": "The great picture and good viewing angles for an LCD/LED were the reasons I bought this for our living room.  It did not disappoint with either picture quality or viewing angle.  But the EXTREMELY reflective glass panel covering this beautiful TV made it virtually unwatchable even though it was angled away from the main window.  The blacks were so black we could watch ourselves watching TV in the dark areas of the picture -- especially while watching movies, which tend to be darker than regular TV.  Many of the plasmas I've seen in the stores are less reflective, which makes plasmas viable options if you think you can handle a glass panel.  The TV has been returned and we're shopping for less reflective replacement.", "Date": "August 18, 2010"}, {"Title": "Great TV set with amazing functionality", "Author": "RZ \"no nonsense\"", "ReviewID": "R1JQMO2N5BWFGL", "Overall": "5.0", "Content": "I got mine from a local store on sale for a little under $1600. That was about three weeks ago. And since then my entire family just can't get enough of it.Picture quality is just great - and that's expected. But what amazes me is all the extra functionality with what this TV is packed.1. Video streaming with Netflix. (It also has VUDU, YouTube, Picasa - but I did not try VUDU yet, and YouTube and Picasa work just fine, but I do not need a huge display to view some low resolution videos from YouTube). So Netflix movies available to watch instantly look great. Even those that are not HD quality. I must say that I have FIOS internet connection, so that must be also a component for high quality videos, but as far as this set goes - it does a great job.2. This TV has 2 hi-speed USB2.0 input jacks, and it recognizes not just flash drives, but also USB external hard drives - even with NTFS file format. I tried both - FAT32 and NTFS, and also external drives with additional power source and without it, - this TV recognizes them all. It can play your video files (and other media too) directly from external hard drive! And it supports multiple video formats, including Matroska H.264. It also supports external subtitles for AVI files. I did not test multiple subtitles formats, but SRT works great. It supports standard Latin letters languages and Korean. No other encodings though.I want also to add a few words about design. I use a TV stand that it came with, and it allows TV to be turned both sides about 20 degree - just enough to get to the USB jacks or to additional audio or HDMI jacks that are placed on a left side. The main ones are located on the back panel - which is also pretty easy to reach thanks to that rotating feature of a stand. The rotation is very smooth and requires no force at all.I can't be more pleased with it.", "Date": "August 5, 2010"}, {"Title": "Everything I'd hoped it would be ... almost.", "Author": "L. Sims", "ReviewID": "R3DDOTAIOQPEYK", "Overall": "5.0", "Content": "Other reviewers have covered the technical stuff, so I'm going to keep it short and sweet.Pros: Outstanding picture quality in all modes, easy to use.Cons: Some screen glare, widgets not very useful.I've been very happy with the various presets and keep it in one of the THX modes most of the time.To give you some perspective, I've been in the video production business my entire career (30+ years)and the picture watching through my HD cable box is crystal clear.  I've watched 1 Blu-Ray movie and was very impressed.  I've watched football and there were zero artifacts during fast motion.  The screen is a large piece of glass so there will be some glare, as is true with any polished surface.  There is only slight flashlighting I've noticed when changing inputs but never during any programming, including really dark night scenes from the Blu-Ray.The audio is as good as the 32\" standard TV this replaced.  There are different modes and settings, but it is not going to sound like a 500 watt system.  Keep your expectations realistic.The widgets as of this review include weather, finance, a few games and others ... too many to list but as far as I'm concerned, they don't add much value.  There are NetFlix apps like VUDU and YouTube which work very well. These are worth paying some extra.  When I hooked up the Internet through an ethernet LAN cable, it automatically checked for updates...pretty cool.Aesthetically, the set is good looking and construction seems solid.  All the inputs are located in one place on the back panel ... no front or side inputs.  There are cable guides so you can semi-hide the wiring.  This works pretty well.In summary, I'm very happy with the picture quality, which is why I got this model.  If you don't see any updates to this review, nothing has changed with further use.", "Date": "September 29, 2010"}, {"Title": "No Analog Audio Output", "Author": "Wallace Guy", "ReviewID": "RR50UX3KQM9NR", "Overall": "4.0", "Content": "The picture is beautiful.  The frameless glass frame is magnificent.  The speakers are so-so.We went to Best Buy to physically look at TV's, intending to buy a 42\".  Two things became clear.  The best imaging technology (e.g., high contrast ratio, etc.) doesn't really kick in until the 47\" models.  I guess there isn't a big market for high quality / small size TV's.  The other was the fameless frame on this model.  Every other TV in the store, bigger and smaller, had a raised frame that surrounds (and protects) the glass front.  The LG 478500 does not ... there is a single piece of glass that runs all the way to the edge.  The glass just changes to black in color in a thin region around the edge.  It looks more like a painting than a TV.  My wife spontaneously yells out \"that's magnificent!\" and I understood my TV just got more expensive.We bought the TV from amazon with enhanced delivery.  I wasn't there to observe, but my wife said they looked like they had never set up a TV in their life.  At one point they wanted to lay it on it's front, but with the absence of a raised frame, that would most likely scratch the glass.  They did get the TV in it's stand and sitting on the table, but not \"set up\" in any electronic sense.We bought an LG BD590 250GB Blu-Ray player to go with it.  I had read about various incompatibility issues related to various versions of HDMI or different manufacturers' implementations.  Given that the BD590 was among the top reviewed players, it seemed a safe bet.  That's the only source I have tried so far.  At the time of this review, we've watched Avatar and Cars.  I also watched a Hero DVD to check the up-sampling.The picture is stellar.  It looked better in the store than everything else we took the time to compare it to (more detail in the bear's dark fur, more subtle tones on images of snow). Until we get it up on the wall, we're sitting pretty close (about 8') and you can not see a pixel.  I don't have the experience of \"watching TV\" ... it feels more like we are looking through a window.The up-sampled DVD looked great.  It was obviously not as beautiful as the blu-ray disk, but substantially better than my gargantuan Sony Trinitron (the last of the pre-HD monster tube TVs) did with a DVD player.The speakers sound like TV speakers.  With such a beautiful image, I assume that LG assumes that people are going to add their own speakers.Which brings me to my one complaint, but this apparently is a complaint about the industry, not just this TV.  The rest of this review is more about dealing with audio for folks who don't have a home theater setup.This TV has no analog audio output.  Only an optical digital audio output.My setup is simple.  I have  blu-ray player, a TV and an amplifier with speakers.  That's it.  No satellite.  No cable.  No AV receiver.  What I used to do was plug the player into the TV, use the TV volume control with the audio output set on variable, and feed the audio signal to the amplifier from the TV.  It was simple. One volume control did it for all sources.That won't work with this TV.  I called LG customer service (which answered promptly) and they confirmed that only a digital output exists and that, \"all the new TVs are going this way\".  The first comment to this review confirms that.What the industry expects you to do is buy an AV Receiver for a home theater system.  Given that I just want good stereo sound, my problem with AV Receivers is that (a) the TV itself already accepts 10 different inputs and I don't need another box to accept 10 more, (b) it adds another remote control and (c) another volume control and (d) another input select function to watch a simple movie and (e) I'm paying for video up-conversion and other video features I don't need.  My understanding is that the latest HDMI may solve the dual-volume issue.Update: 8/10/2010It's worse than I thought.  From LG customer service:  \"Regretfully, the optical output is a fixed output on this unit, and it will not respond to the television's volume.\".  Thus, it is not possible to connect an external DAC to the optical audio output ... unless you like listening exclusively at full volume.Update: 8/11/2010If you want to use external stereo speakers without buying an A/V Receiver, here are the options that I have found:1)  Almost no-cost solution:Use the headphone jack and run that to your amplifier with a mini plug to RCA adapter cable.  It works, but the quality is about what you would expect ... very compressed sound.  I had to turn the TV volume up to 100% much of the time.2)  Low-cost solution:Use the headphone jack as above, but add a headphone amplifier.  This is the solution I have chosen.  I'm using a Creek OBH-11.  It costs about $200 and is the lowest priced headphone amplifier that audiophiles don't absolutely scoff at.  The Creek has an audio output that you hook into your speaker amplifier and a headphone jack, so you can still use headphones.  This won't improve distortion or frequency response of your sound, but it will improve the dynamics.3) Middle of the road solution:I looked for an HDMI box that might do something similar to an A/V Receiver ... sort of an AV Receiver Lite with a single HDMI input, a pass-through HDMI output, and audio out. Really what I want is an \"Audio Receiver\" to decode HDMI audio without any video.  The closest thing I have found is the Ambrry AU-HDMICP with the very long name of \"HDMI LPCM to Analog Multi-Channel Audio Decoder With Amplifier\".  It's a unique product and it almost does what I want ... but has no volume adjustment.The other option is a Beresford TC-7520.  It's a headphone amplifier with an optical digital input and a manual volume control, and costs about $200.  So ... this works.  You would have to adjust the volume by reaching for the box, which I would prefer not to.  Note one thing ... in the A/V forums this is a controversial product because of the very extreme claims of how fantastic it is and other people saying those claims are a campaign of hype.  For $200, I would not expect a top-end DAC in this product.So, in my opinion, there is no middle of the road solution.  The middle of the road solution is to spend your money on an A/V Receiver and be done with it.4) Audiophile solutionIf you want to put your money into the best audio (stereo) sound and not spend a dime on video switching, you can get the Benchmark DAC1 HDR or Lavry DA11.  They take optical digital input and produce RCA output for your amplifier.  They have nice little remote controls.  The specifications and reviews are impeccable. They are exactly what I want.  Also ... they cost more than the TV.  For $2,000 you could get a decent A/V Preamp, a more audiophile solution than A/V Receiver.  I might have gone down this road except that some A/V forum folks suggested that in a few years, these kind of products will start accepting HDMI and do full, audiophile quality TrueHD decoding.  That would be great.So ... for now ... it looks like if you want to listen to the audio on external speakers, even in stereo, you are pretty much forced to purchase an A/V processor or use the headphone jack.  So be it.Update: 11/30/2010I used the headphone amplifier solution (2) for a few months. It's OK.  But I could only look at those beautiful images so long without screaming inside for better audio.  I broke down and got an Integra 40.1 A/V preamp to go with a three channel B&K; amp that I had. So, after all my bellyaching about the state of the industry, I bought the box I didn't want to buy. The sound is good. I still only use it with stereo plus center channel.  My wife can't figure out all the remotes, so I'll probably also purchase one of those programmable, RF remotes.", "Date": "August 5, 2010"}, {"Title": "LCD is finally competing with Plasma", "Author": "D. Hannan \"David\"", "ReviewID": "R2LCE5ABJCNL4I", "Overall": "5.0", "Content": "I got my new 47\" LE8500 delivered this morning, and this is exactly what I think we've all been waiting for.Fully backlit, local dimming, a little less than an inch thick (but it's still very heavy), gorgeous glass stand, edge to edge glass screen (no raised bezel, one continuous piece of glass), black levels like I've never seen before, and the THX mode is stunning.This is one heck of an upgrade from my 47\" LG70.The picture quality is just stunning - the blacks are so black and crisp, the colors are vibrant and pop, they even improved TruMotion.Beautiful television - and with the deals Amazon have on this set right now is crazy - this model retails for about $2000 + delivery.  I paid $1,800 and change for mine, and at the time of writing this review it's even less at around $1,750.", "Date": "June 30, 2010"}, {"Title": "Much to love and yet much to be disappointed with", "Author": "BTX", "ReviewID": "R4Y38XJ30FQSO", "Overall": "4.0", "Content": "I am writing this after about one week of use.Love:The thinness of this TV is super. Impressive. Admirable.When watching a high quality HD movie or show, such as that transmitted by HBO HD, the quality is stunning. Pleasing. Satisfying. Remarkable. And this is with the TV picture mode set to the standard default.The menus are easy to navigate.Nice that you can stream YouTube.Being able to rotate the TV 20 degrees left and right.Nice looking TV (except for the mirror-like reflection, of course)Happy I was able to get it for $1,800 grand total.Disappointments:While the installation of the base is really easy, the screws are easily stripped. Using a typical screwdriver, the screw heads started showing stripping. Unacceptable. (I didn't strip the screw heads all the way, but there should be no stripping just to install the base on an $1,800 TV.)The speakers. Come on, LG. If Vizio can put in 15 watt speakers, why would you give us 10 watt speakers on an $1,800 TV? The speaker sound is OK for programs like the news, but awful when listening to stations like the Music Choice cable music stations. I tested them with the beautiful instrumental music station and could not turn up the volume very high or else I'd get distortion and/or vibration. This is very upsetting. LG should be ashamed for this. And please don't tell me they expect everyone to connect the TV to an audio amplifier, etc. This is BS. Many people do not want to do this. And isn't $1,800 enough? And again: if other TV companies can offer a flat-screen TV with better sound, LG should be able. I don't have an amp or external speakers, etc. And I don't want to spend any more money. (I am not returning the TV in spite of this speaker complaint. I am just going to live with the disappointment for now. I am just hoping someone at LG will read these complaints and do the right thing in their next TV.)I am disappointed with the quality of the picture when standard def or video via composite RCA cables is transmitted. I know this is to be expected, but I have seen better quality on other sets. If you are still using something like the ReplayTV DVR or VCR where you can only use composite cables, you might be unhappy with the quality of the picture.The remote control does not have a qwerty keyboard. Not a dealbreaker, of course, but Vizio has a qwerty keyboard bluetooth remote with their 47\" LED LCD TV. And their set is $1,400. (And their speakers are better.)The glare of the screen. Highly reflective. If your room lighting is a certain way, you'll certainly get used to it and/or the glare will be less. (With the TV off in a bright room, the screen is a perfect mirror.)Bottom line: I recommend this LG TV if you watch mostly High Def programming, as you will see a gorgeous picture. Nice black levels. Bright and colorful and crystal clear picture that will make you fall in love with watching television. You will never want to go back to a CRT again if this is your first HD experience, of course. (I would give 5 stars for just the picture and the thinness of the TV.) If the best sound quality is important, keep in mind you will need external speakers for that.", "Date": "August 17, 2010"}, {"Title": "The best TV picture I have ever seen", "Author": "ovic", "ReviewID": "R1NUI88JGLSUV7", "Overall": "5.0", "Content": "This is by far is the best picture I have ever seen on a TV I have had plasma's they are good but not like this. I just upgraded from a LG lcd 120 I thought that was the bomb but this new led 240 wow! just use your blu ray player and put in a copy of Avatar (blu ray) and then you will understand why you bought this TV. The picture is so clear it's almost 3-d with out the glasses.", "Date": "July 19, 2010"}, {"Title": "Amazing Picture, LED local Dimming iffy", "Author": "Tallguy1802", "ReviewID": "RKQ9S3QTWPQSE", "Overall": "4.0", "Content": "OK let me start by saying that this TV looks amazing.  I have mine on the stand it that looks great.  Overall very sleek and stylish.  In a bright room, the glare may be an issue, but if I turned the lights off behind the couch, its fine.  the glare is only an issue in dark scenes.  But thats not the least of worries in dark scenes...The idea of the LED local dimming is excellent.  I bought the TV thinking it was an additional feature, but in normal TV and bright scenes the local dimming works well - especially when there is only a small portion of black and the rest is lighter.  However when you watch a horror movie, for instance - The Strangers, which is very dark with few light portions, the blooming around the lighted spots is ridiculous.  I had to turn the local the dimming off when watching this movie last night.  The response rate is great, but it is definitely noticeable when the LEDs switch on an off as the camera moves.  Also, on very bright screens, like an Apple commercial for example, from certain angles you can see the grid of LEDs lighting up.  There are very subtle darker lines in between the rows of LEDs which is starting to annoy me.  With that said, for almost everything besides extremely bright and extremely dark pictures (with a little bit of light) the picture is outstanding.  I've seen the edge-lit LEDs and definitely notice the blooming on those as well during the same extremely light and dark scenes, so its a matter of personal preference.I would highly recommend this TV, plenty of inputs, awesome picture -just that one annoying issue on extremely light and dark scenes.", "Date": "October 21, 2010"}, {"Title": "First large flat panel purchase", "Author": "skuter7199", "ReviewID": "R30A336TQ8AQ4Y", "Overall": "4.0", "Content": "This was my first large flat panel purchase I've made, so I did a bit of research and shopping.  I've only had the tv for just under a week and so far I'm loving it! (Of course, that's easy to say when you replace a 27\" crt tv!)  I only rated the tv at 4 stars because I have not had it long enough to confidently apply 5 stars yet.  The tv arrived in perfect shape.  The first minor issue I had was after assembling the tv stand and setting it in place, I noticed the tv was tilting to the right.  Layed it back down, loosened the screws and was able to shift the stand straight.  I used a tape measure so that I would not have to repeat this process a 3rd time.  Set the tv back in place and it was perfect.  The glare, as many other reviews mention, was a distraction.  The windows directly behind me could still be seen even with a brighter picture on the tv.  I knew this potential going in, so I had a second location already in mind I was able to place the tv with no windows behind me.  Since changing the location, I am very happy with it.  Now, I just need to suck it up and get the HD package from the satellite provider!", "Date": "December 8, 2010"}, {"Title": "A good TV, but a TV w/o sound should not be shipped from the factory", "Author": "Halfzero", "ReviewID": "R2LB6TXADQKUJB", "Overall": "3.0", "Content": "When I turned on the 47LE8500 I received, everything worked, except there was no sound from the speakers. After making sure that it was not the setup problem, I concluded that I received a defective unit. I was very upset, thinking about disassembling the stand re-packing the unit, obtaining the RMA, making an arrangement for pickup, and etc. This is a waste of time and money. The unit was shipped from Vanns. I have 14 days to return for a full refund, but I have to pay for shipping it back.Thinking about the hassle of returning the unit, I thought I should open it up and see what I can do. I am an EE, done quite a bit of display designs from CRT to LCD. I know the manufacturing test process on product like this at the factory. It is unusual that a unit w/o sound could have passed without noticed. The unit w/o sound could have caused by intermittent connection that happened to be OK when it was at the factory, but became loose connection after that. With that in mind, I decided to open the back cover and look.From what I saw, the 47LE8500 was very well designed. The main board is where nearly all external connectors are mounted. There are only 2 or 3 board assemblies and minimum wiring. The power supply, the most vunerable module in any electronic appliance, was well designed and thin. The only thing I don't like is that the power supply uses no-name cheap 105C electrolytic capacitors (e-cap). Given the 100,000 hours LED life, these e-caps could fail 10 times or more sooner. Other than that, I am impressed with the design and engineering of this TV.Based on my assumption above, I looked at audio system starting from the speakers . There are 4 of them, 2 for left and 2 for right. I discovered that one of the speaker terminals touched the aluminum chassis. Even though there is a plastic insulator on the terminal, I noticed a burn mark on the aluminum caused by arcing from speaker's terminal. I bent the terminal away from the aluminum chassis and reinstalled the insulator. Before turning it on, I traced the speaker wiring to the audio amplifier located on the main board. The amplifier is a class-D amplifier (NTP-7000)using pulse width modulation (PWM) technique for better efficiency. I felt much better knowing that this kind of amplifier has internal output short circuit protection. The chip should not have been damaged by the short circuit I discovered. I put everything back together, turned it on, and voila...I had sound.OK, here are my comments for all parties involved:Vanns:They did excellent job, TV arrived 3 days after ordering in good shape. They put the original LG box into another box, making it a double packing.LG design Eng:I would take away 1 star for giving a chance of short circuit to happen by design.LG Mfg:I would take away 4 stars for failing to catch this problem. Seeing the black mark, I knew that this problem was intermittent since it was at the factory.The TV itself is of high quality and I love it. For the reflective front glass that many people don't like, I think this is a trade off of having a glass panel vs w/o glass. It is good if you can control light in your room, and could be annoying if you cannot.Update (2/24/11)As many other reviewers pointed out, there is a 0.5mm thick plastic attached to the front glass. I suspect that over 90% of owners do not notice this transparent plastic that covers the entire TV faceplate. It is not obvious for its purpose as it is not explained in the manual. I think it is for protecting the glass before reaching the end user. It seems like you could leave it on forever, but it could be an issue later when it get old, accumulating scratches, and becomes harder to remove. LG Customer Support had no clue, but suggested removing it. It is extremely difficult to reove. It took me 45 minutes to remove it. This is absolutely unacceptable. It is somehow the reflection of how LG works internally as an organization. Some groups are excellent, but some groups are so inferior. In this case, the 47LE8500 is their portrait. I hope that some bigwigs at LG will see my comments here and do something.", "Date": "February 2, 2011"}, {"Title": "Great color reproduction, some issues with the back lighting.", "Author": "D. Mak \"nedoobie\"", "ReviewID": "R10BL4ADFDAS6K", "Overall": "4.0", "Content": "Other reviewers have covered the features well. I hope to address areas that I felt weren't focused on by others. I'm happy with this, my first HDTV of this size. For me, this was an upgrade from a 25\" 1080p LCD monitor. My input sources are:Pioneer VSX-1120K AV receiverTiVo Premier XL (service from Comcast HD and ATSC via OTA antenna)XBox 360First I'll speak of the applications embedded with the TV. I find myself surprised at how much I access them. I originally expected to use them sparingly, if at all.Since I've had the LG 47LE8500 setup, I've had two firmware updates, so it's nice to see the manufacturer support the product. If you connect the unit to your network via. the built-in ethernet port, it will automatically check for firmware updates when you access the internet applications. I've not tested this with the optional wireless adapter, which I don't have nor need. Most firmware changes appear to be with the internet applications embedded with the unit: Netflix, VUDU, You Tube, Yahoo Widgets. All the applications work well. At the moment, the only application that supports 1080p with 5.1 Digital audio (via the TOSLINK, for me) is VUDU. I'm not sure if Netflix or YouTube will be updated in the future to support 1080p or 5.1 digital audio in the future. I believe Netflix has introduced a few clients capable of both, but with limited content supporting full HD. The highest supported resolution at the moment appears to be 720p for the LG installed Netflix app. Interestingly, despite having the Netflix and You Tube functionality duplicated on my TiVo Premier, I find it more convenient accessing them directly from the TV's implementation, sacrificing sound quality, just for the convenience of not having to turn on the other devices required to view the same content via. the TiVo. Since I have a TOSLink audio connection from the TV to my receiver, I can get better audio quality from these applications just by turning on the receiver, and muting the TV audio.In my opinion, this is a well designed TV. There are plenty of input and output ports, it runs cool, and most importantly, the display is brilliant. The color reproduction is incredible, from my point of view. I haven't had it calibrated, but a simple image check with some blue lenses and a video calibration video resulted in no tweaks or adjustments required, other than setting the video mode to one of the LG provided configurations: THX/Cinema. The source for this test was the TiVo Premier connected via. HDMI through the Pioneer receiver.The full local dimming feature of the TV makes for some incredible blacks in a fully darkened room. Unfortunately, I have observed a few instances where the back-lighting does bleed through. Possibly related to the full local dimming back-light implementation, I can see a horizontal banding effect apparent when displaying a screen of either white or blue/sky blue. This will probably be most visible watching Ice Hockey or scenes showing a lot of daytime sky. Since the bands appear to be static, I'm guessing it's related to the LED full array local dimming back-light. For me, this is a sufficient trade-off, for the brilliant color reproduction, and deep blacks.Another source I have connected to the TV is a XBox 360 game console. For that input device, I needed a TV with flexibility to disable whatever display processing that might introduce input lag. I'm happy with this unit in that it has not appeared to introduce any discernible input lag when I disable the TruMotion or any video upscaling options on both the TV and AV receiver. I have noticed some audio/video sync issues with some television programs from the TiVo input source when I was playing with the TruMotion adjustment options in conjunction with the video processing features available on my receiver, but that's to be expected.I'm very happy with the LG 47LE8500. I had very specific requirements going into my purchase. I researched my options extensively and came to the conclusion this TV met my requirements best, and I'm happy with that.", "Date": "November 19, 2010"}, {"Title": "VANN's Inc is a joke", "Author": "The Hulk", "ReviewID": "RH6K85YZU739S", "Overall": "1.0", "Content": "television broke after one year of use.  Was never offered a warranty or an extended warranty.  This company does not offer a warranty past one year.  I paid almost $1400 for this television, I would have got an extended warranty if offered one.The television was nice whileit lasted, but VANN's Inc is a bad company to work with.  I tried to be friendly and the staff was very rude, I don't think they realize I help pay some of their salary.  Needless to say this company operates like the rest, once they get your money they have no use for you.  PLEASE BE SMART, DO NOT SUPPORT THESE TYPES OF RETAILERS.", "Date": "May 22, 2012"}, {"Title": "Love this TV", "Author": "Mike In Kennesaw", "ReviewID": "RZVCGQP4E2GNX", "Overall": "5.0", "Content": "I bought this TV from Amazon and it actually shipped from Vanns. I had been patiently waiting for the right TV at the right price to upgrade from my 5/6 year old Samsung 720p, 60 Hz DLP TV. (Lots of acronyms there) When Amazon/Vanns dropped the price of this 1080p/240Hz TV under $1,300, I knew the time was right. The shopping experience with Amazon and Vanns was superb. It arrived on time. It was heavier than expected, but the FedEx guy helped me bring it in the house and I gave him a tip for his extra effort. Set up was a breeze for me. It replaced a 50\" DLP, so it is just a bit smaller. The TV has a plastic cover over the glass screen. I tried to get it off, but I think that it had been super glued in place. I called LG to make sure that it was supposed to come off as the manual never mentioned removing it. The lady told me it comes off easy. Well, easy must be a relative term because I could not get it off. I just set it up with the plastic in place. About a week later, a friend's son dropped by and said he thought he could get the plastic off. We took the TV down and placed it on cushions on the floor. He and I both were finally able to get the plastic off after about 30 minutes and a lot of sweat and muscle. I think pulling teeth may have been easier. However, once we reattached the TV without the plastic, I could not believe the picture quality. It was amazing!!!The only audio out is digital optical so I never hooked that up since my TV is about 20 feet from the surround sound system. I play audio through a surround sound system with Klipsch speakers anyway, so who needs the TV sound. However, I did buy a couple of optical audio cables to connect from my Dish receiver and Blu-Ray player to my sound system. I am now seeing and hearing Dish content and Blu-Ray movies like never before. And the Super Bowl was incredible, commercials too!!! The picture is so clear that I never realized how much make-up news casters and TV/movie stars wear.I absolutely love the Lord Of The Rings trilogy. It was the first movie I watched in Blu-Ray on this amazing TV with the digital optical audio. It was like I had never seen these movies before!!I am one happy camper, although I probably should have gone to the zoo to get a Gorilla to remove that plastic cover. I highly recommend this TV as long as you can remove the cover. I would buy another one if I had a place to put it and could get my friend's son to peel the plastic off!!", "Date": "February 10, 2011"}, {"Title": "Great TV overall, but not without cons", "Author": "Ashwin Venkatraman", "ReviewID": "R3KXUSAVOCDJY9", "Overall": "5.0", "Content": "I'm not a TV expert by any means but I did my research before buying this TV.  This pretty much gives you what most reviews have said about this.  The picture quality is amazing, the controls are easy, and the swivel base is very useful for connecting things behind the TV.  The bad piece is that the TV is extremely reflective. You will want to watch your darker movies at night with the lights turned off.  Another bad piece is that LG supplies really poor screws for the base.  I had read enough about this that I was very careful putting it together, but the screws strip very easily.  Also, just FYI, this TV is much heavier than its 47inch LG counterparts.  The only thing I could think of was that LED local dimming makes the TV heavier than the edge lit TVs but like I said I'm not a TV expert :)", "Date": "February 3, 2011"}, {"Title": "Better than I expected", "Author": "Kevin P. Rice", "ReviewID": "R2OCABIV7CVYBI", "Overall": "5.0", "Content": "I had done research on many LED-LCD HDTVs before deciding on this one.  To be candid, the reason I got this one was primarily around the price for the features.  I was pleasantly surprised that I could get this TV for less than some of the others, Samsung, in my wish list.  This had features that the more expensive TVs did not such as 240Hz and Internet connectivity.The seller is a company called Vann's and I was very happy with their customer service rep. I had wanted the TV expedited and I called them to work out the details.  They refunded the extra money when they told me they only ship via ground.  At first I was disappointed, but then pleased when they indicated it would still arrive within 3 days.  The TV arrived right on time and FedEx had called the day before to let me know it would arrive the next day.  The box had another larger box with padding to protect the TV - very nice touch.  I would definitely order from Vann's again.", "Date": "January 22, 2011"}, {"Title": "Great TV but......", "Author": "Mike K", "ReviewID": "R337F4PHSY0U2C", "Overall": "4.0", "Content": "I am extremely happy with the video performance of this TV but the shiny screen will bother many viewers that do not have complete control over room lighting.  This is not a big problem for me but I do have one major complaint about the design.  The panel is thin and would normally look great on a wall but most of the inputs face to the rear.  Wall mounting makes these inputs useless unless you create a fairly deep cavity in the wall to allow plugs to be connected.  It would have made far more sense to face most of the inputs to the side or preferably down to make wall mounting more practical.", "Date": "December 14, 2010"}, {"Title": "Plasma like picture quality", "Author": "Larry", "ReviewID": "R1IZQ9CNK6XVQX", "Overall": "5.0", "Content": "You want a plasma like picture than go with this LG 8500, it's got the best true color picture.  All the other LED TV's I have tried all look fake, the red and blue are so in your face that it takes away what the picture should look like.  Yes, this does have a glare due to the glass screen so make sure you don't put it next to a window or a lamp.  I have noticed that less expensive LCD TV's don't have this reflection, check out the plasma TV's.  I like the Samsungs but the shadow detail just wasn't there, you adjust and it made everything else lighter.  The LG has plenty of fixed picture selections which I liked because I want to buy a TV and turn it on and watch it and not have to worry about spending another couple hundred dollars to calibrate it, what a scam 'BEST BUY'.  One thing to look out for the new LG LX9500 just has the 3-D feature and is not worth the huge price increase, it's the same TV as the LG LE8500.  The TV is very heavy so be careful and have someone help you hang it or just getting it out of the box.  The sound sucks like all 10 watt LED TV's do, buy a sound bar they come in so many sizes now. Compare the specs you are getting a lot of TV with this LG and if your worried about quality just buy the extended LG service plan.", "Date": "November 24, 2010"}, {"Title": "Great buy", "Author": "John R. Baker \"John\"", "ReviewID": "R2SHX41P4CRZMM", "Overall": "5.0", "Content": "We have been considering a new HD television for some time and when the LG came on sale including the surround Home Theater system it was too good to pass up.  We are extremely satisfied with the quality of the picture and the sound system.", "Date": "October 26, 2010"}, {"Title": "Great LED TV", "Author": "Philip", "ReviewID": "R2OYZQK6N4HXU", "Overall": "5.0", "Content": "You know you have made a good purchase when your TV looks almost better off than on. The design of this thing is great. Slim and monolithic. The single sheet of glass design is awesome. It does produce some glare, although not horrible. The worst part about this TV is the speakers. They are just not up to snuff but then again there are few TV's that are. A simple sound bar solved this problem (SONY HTC-150). Love the streaming netflix. The image quality is amazing. The only way to compare it is like going from an iPhone 3G screen to the retina display of the iPhone 4.", "Date": "August 23, 2010"}, {"Title": "Put my money where my mouth (keyboard) is.", "Author": "ALLUSA", "ReviewID": "RKMZ6EWR1P8XC", "Overall": "5.0", "Content": "Did A LOT of research prior to purchasing this unit.  Long story short everything I read pointed me to this unit.  I then checked the unit and setup at many locations until I finally pulled the trigger.  The main concern I had prior to purchasing this unit was the glare that I observed as well as is documented in other product reviews on this unit.  This is a result of the solid glass panel which covers the entire screen.  In a room where light can be controlled, such as my office this is a non issue.  However if you have a bright room (lots of windows) DO NOT BUY THIS TV unless you want to watch only at night.  If, on the other hand, there is not much ambient light entering your room this TV will reward you with the best picture quality and fps of any TV in its class.  The knock I have on it which is not worth of a star deduction is that it does not have built in Wifi o be ready to purchase a LG USB dongle for between $30-$70.  I was so satisfied with this TV's performance that I bought one as a Christmas gift for my folks.  Be advised this panel is not 3D (which I believe to a be a gimmick for rubes) and only goes up in size to 55\".  It took it out of the running for my replacement  as my main home theater screen as I wanted a 65\" or above LED or Plasma.", "Date": "September 1, 2011"}, {"Title": "THIS TV IS FABULOUS", "Author": "L. Fenner", "ReviewID": "RFLSSJL20NV5L", "Overall": "5.0", "Content": "I did a LOT of research on HD LED TV's before purchasing this one right after Christmas.  It had great professional critic reviews as well as good customer reviews. It was an excellent choice for us and we love it. It was easy to set up and easy to perfect your personal preferences with the quality of the picture and audio. I did purchase a soundbar for the audio and it's great. The screen on this one is glass so if you have a very bright room, you may want to consider purchasing one with a matte finish, because it is reflective. We only have lamps in our living room for lighting so it works very well for us. If you have a lot of windows that face the screen, then I wouldn't recommend this one. Other than that, this TV has excellent picture quality. I also purchased the LG usb dongle for a wireless  internet connection and it was simple to set up and use. Took just a few minutes. Now we watch all the Netflix movies we want. My husband is in love with it.It's now 1/31/2013 and we STILL absolutely love our TV.", "Date": "June 8, 2011"}, {"Title": "Incredible TV", "Author": "Bailey", "ReviewID": "R3HE9NQ5M2Q0J1", "Overall": "5.0", "Content": "We've had this set for a few weeks and couldn't be happier.  I set it up with no help which is no small feat as I'm not the handiest person.  The picture was perfect after some basic tuning with the picture wizard included in the set.  I reduced the red and blue saturation a bit and changed some other settings to ones I found suggested on CNET.  The quality is so good it's like looking through a window at the real thing.  I didn't have any problem at all removing the plastic film as noted by other reviewers.  We've hardly noticed any glare from the glass panel but I can say the depth of the picture is phenomenal, hence the reason they did the glass panel.  With 4 HDMI and 2 USB inputs it eliminated the hassle of daisy chaining peripherals together.  The remote has some cool features that bring this set into the 21st century such as Widgets that let you go to YouTube or get a local weather forecast at the touch of a button.  I can't report any cons to this set now that the price has dropped.  I don't see any other TV's out there with a comparable 240 Hz refresh rate, local dimming, and 9 million to one contrast ratio.", "Date": "April 22, 2011"}, {"Title": "A-MA-ZING!!!", "Author": "M. Kincheloe", "ReviewID": "R1ISV25XWESWB9", "Overall": "5.0", "Content": "Awesome picture. Automatically adjust for light.  Super sleek.  I wanted the tv to mount as close to the wall as possible so I couldn't see the wires.  This is so slim and with  the slim bracket it worked out perfectly.  I was left to the research duty and my husband said I picked the perfect tv.", "Date": "April 8, 2011"}, {"Title": "\"47 LED\"", "Author": "E. Mehlhorn \"reading fanatic\"", "ReviewID": "RWO123FK5YPQ7", "Overall": "5.0", "Content": "This being our first Flat screen TV, we wanted to make sure we got a good one. We did a lot of research before we chose the LG Infinia. We wanted 240Hz and slim LED. We started looking at the 42\" and ended up choosing the 47\". We went a little above the budget we set but it was well worth it.  The LED picture is superb and the screen does not give off any heat.You are in the room with whomever is on the screen.The picture is clear, crisp and the colors are incredible. It was easy to set up. The only thing we really had to change was our cable service. We needed to get the HD box from Comcast instead of what we had. After that it has been one great movie, Superbowl and TV show after another.We are thrilled. We are over 60 and that we could even set the TV up was amazing to us( without the Geek Squad). We have not set up with the internet yet. We are saving that for another day.Too much success in one day may do us in.  This was actually the first big ticket item we have ever ordered off the internet and couldn't be happier.", "Date": "February 13, 2011"}, {"Title": "Great TV!", "Author": "SatisfiedCustomer", "ReviewID": "R3JBHOP7QMHCOE", "Overall": "5.0", "Content": "Pros:47\" TV, it's 1\" bigger than 46The color control is amazing!  I love using the picture wizard to calibrate.Internet enabled, great! Can stream media from computers.Swivels!Headphone out for hooking up computer speakersGreat price for the TVLittle to no heat felt.Low power!Slim!Great looking on pedestal.Cons:Wish I could access Facebook and Internet sites via browser.Antenna/Cable plug is vertical?Missing a set of screws but fixed by buying better screws at Lowe'sThe set of screws that did come with it were stripping even with slight tightening pressure, screws at lowe's were MUCH better! and perfect fitting.Manual could be better(contains other TVs).Wish wireless adapter came with TV.", "Date": "February 7, 2011"}, {"Title": "Amazing HD picture", "Author": "Sean M. Kirkpatrick \"Sean Kirkpatrick\"", "ReviewID": "RSYAX8G600XQU", "Overall": "4.0", "Content": "This TV is mounted in a secondary viewing area on a full motion arm purchased from monoprice (ID 4926).  The picture is amazing.  Deep blacks and crisp colors.  My primary TV is the Sony KDS-R70XBR and the picture on this LG is definitely better.  The transaction with OneCall through Amazon was issue-free.  The TV was very carefully secured and shipped from WA to NJ without tripping the shockwatch device attached to the box.  I was a bit nervous about making this expensive a purchase for this fragile an item online, but was immediately more comfortable when OneCall followed up immediately to keep me informed regarding how the TV would be handled from the point of purchase to delivery.I also purchased the wireless 802.11n usb adapter and once switched over to use the wireless device (WPA2), the TV was immediately connected.  Netflix, Vudu, and CinemaNOW are all working great (though I tend to not rent from the latter two).All that said, the TV has its shortcomings.  I don't understand what the TruMotion functionality is actually doing.  I had to turn it off because the images appear to be jittery and almost accelerated when it is on.  I was expecting access to Pandora via the LG Netcast functionality, but that is not available to me.  It may be that it isn't available in NJ, but I felt this was misrepresented in the advertising and was disappointed with this since I am an annual subscriber to Pandora One.The biggest disappointment was the lack of capabilities around the built in DLNA media streaming.  The TV is also heavily advertised as being DLNA certified.  I have a media server configured that I had been accessing via my PS3 using PS3 Media Server.  Most of my home library is stored as .ts containers of h264 encoded HD movies with PCM audio streams (since the PS3 seemed to deal with this combo the best).  The DLNA usage was a bit of a gamble on my part, admittedly, because even many of the review sites mention that LG claims that it is possible but that it was not part of the review (cnet).  I converted a few of my DVDs to MKVs and these will play, but I'm still having issues with the aspect ratio.  The movie that I'm testing with is definitely widescreen, but is displayed as 4:3 full screen (squished) on the TV no matter what.  From my own tinkering so far, it supports low resolution streams ok, but can't handle HD streams.  For a TV that's really made for displaying HD video, this is a bit of a let down.  I still haven't given up and am trying to work out alternative methods to do this, but there is very little to no information regarding the TV as a renderer.As a TV, the picture is phenomenal when connected to an HD source or streaming HD content from Netflix.  The lack of Pandora and the DLNA streaming issues that I'm having are the reasons to dock the review 1 star.", "Date": "January 9, 2011"}, {"Title": "Great Buy", "Author": "Rajean P. Moone \"Abskgkdde\"", "ReviewID": "R2T4FLI89LBACP", "Overall": "5.0", "Content": "I bought this TV when it was deeply discounted. I read up on all the reviews of TVs and found this one to be one of the best. I decided to go with it instead of the 4500 version because of what I've read related to clouding that can occur.It basically was a plug and play. I don't quite have all of the mechanics down related to the issues of movement - I noticed last night there was some pixelating of herbs when they were being shook dry - I imagine I can set that differently.I did hook it up to my computer just for giggles and it's an amazing screen.Is there glare? Yes. Is there reflection? Yes. I have a window opposite it - you can't really reconstruct your home so I deal with it - just close the curtains. It works fine.", "Date": "January 9, 2011"}, {"Title": "Reflective Thought", "Author": "ZIGGY70", "ReviewID": "R1VY50DT0SK4YV", "Overall": "4.0", "Content": "Great picture, and you can set it pretty close to an ISF calibration with the options it gives you. I don't know why this screen needs to be so reflective. I have this set in my bedroom and because there's a mirror behind my bed, even when the room is pitch black, I get reflection from the mirror back on the screen. It can be annoying, but that's just me. My wife says she doesn't even notice it. Go to Hometheatermag.com to get the expert settings for this set.", "Date": "December 11, 2010"}, {"Title": "Just what I was looking for", "Author": "TomT223", "ReviewID": "R6GTESMRO9TLQ", "Overall": "5.0", "Content": "I had been shopping for a new HDTV for several months. So many choices but I definitely wanted something that would stream the internet and had a few other specific functions. This particular model had everything I was looking for. One thing I did not want and have no desire to ever have is a 3D TV so this model also was attractive because of that. It had come down to just a handful of choices and when this TV came up for $1350 with free shipping and no taxes I jumped on it and I could not be more happy with my purchase. Of course it will probably get even cheaper in the future but isn't that the same with all electronics?It helps if you research the proper settings for this TV to get a good picture because the default settings are okay but far from perfect. Once you get it set just right the picture is absolutely phenomenal.The reviews about the glare kind of spooked me but I don't find it that bad at all. Yes I had to adjust a couple of lamps in my living room to eliminate some glare but that was easily accomplished. The glass makes this a really attractive TV that's easy to clean and care for.I'm old school and I also have an analog stereo that I paid huge amounts of money for in the 80's and refuse to let go of so I had to get an audio adapter since it has no rca cable plugs. Here's a secret for those in the same predicament: There's a website called monoprice.com that you can find everything you need under $30 to accomplish this and it sounds great. The TV's own built in sound is not really that bad either, at least compared to my previous TV's.I really love the ability to watch Netflix movies and access my Picassa photo account through this set. If you don't plan on connecting your TV to the internet then you are wasting your money for this set because that's a key feature. Plus the ability to download updated firmware is fantastic.About the only complaint I have is it's kind of difficult to get to the usb ports in the rear. But that's minor and a short usb extension cable should solve that problem.", "Date": "December 6, 2010"}, {"Title": "Best Tv Out There", "Author": "steve", "ReviewID": "R3I9E1T31OZNTC", "Overall": "5.0", "Content": "Ok, so when i received this Tv it took me 15 minutes to find the stand body and protector in the box. While i was putting it together one of the screws did not go all the way in no matter how hard i pushed but i left it that way and completed the installation. The other reviews about the screws not being high quality are 100% right. Other than that the tv is spectacularly beautiful. The picture quality is amazing the sound is awesome. This is for a bedroom not a living room and i love it! I recommend this to anyone!", "Date": "November 30, 2010"}, {"Title": "Second set", "Author": "REM", "ReviewID": "R1C1L9QJI91T4T", "Overall": "5.0", "Content": "This unit is my second High Definition set.  I would have bought a sony but ordered one and had not only trouble with it but the service center was lacking.I decided on LG since the wife and I bought LG before and like the the company.  The set is very heavy so a strong stand is a necessity. The picture qualityis amazing! It takes a little time to get everything adjusted to your taste.  I don't think you can go wrong with this set.  It's really a nice looking T.V.", "Date": "November 27, 2010"}, {"Title": "Great TV.  May buy another one for my bedroom.", "Author": "James Eric Ward", "ReviewID": "R2NIRAK140TTW7", "Overall": "5.0", "Content": "This TV has been fantastic so far.  It looks as good off as it does on.  Going to look for another one around the holidays. The glare is minimal to me.  No different than my old plasma.", "Date": "November 8, 2010"}, {"Title": "Great Picture and Features", "Author": "JohnnyTightLips", "ReviewID": "RC2BOEWGNOV7U", "Overall": "4.0", "Content": "Pros:The set up was pretty simple and straight-forward. It does require two-people though (I did it by myself, but a second person would've helped dramatically).The picture is very crisp and clean out-the-box. I recommend doing the picture wizard feature to get the brightness and color correct. The glare on this tv is pretty noticible but as long as you face it away from windows or direct light, you should be okay.I mostly play First-Person-Shooters on this led-tv and watch blu rays. It is very fast and responsive. Virtually no blur or judder. DVD's look great when up-scaled as well. I haven't used the online services that it offers since my PS3 already offers them.Cons:The price. I paid $1199 brand-new at Fry's Electronics in So-cal on 12/04/10 (but I've heard that people have spent way more then that)The \"blooming effect\" on the local dimming feature. Do yourself a favor and research this before purchasing a LED backlit television. It is sort of distracting when watching a 1080p movie/game in a solid dark room.", "Date": "December 7, 2010"}, {"Title": "Not a good TV at all", "Author": "sam Lone", "ReviewID": "R18GNLQK33V71M", "Overall": "1.0", "Content": "the picture is vey bliary.  Whisle in the sound at start. I was not impressed by the TV at all.", "Date": "January 16, 2014"}, {"Title": "Excellent", "Author": "Adam12345", "ReviewID": "R1KQWRCTKRBMNW", "Overall": "5.0", "Content": "I did my homework before buying this television, and I'm glad I did.  The picture quality is superb, and the power consumption is only 90 W.  Turn on the energy saver (which has 3 levels), and it goes even lower.I would recommend this television to anyone looking for a great mid-size flatscreen and doesn't want any of that 3D nonsense.", "Date": "December 30, 2012"}, {"Title": "Great TV!!", "Author": "aunko89", "ReviewID": "R1A105L1V3FJX2", "Overall": "5.0", "Content": "We use this TV every day in our living room. It's so beautiful and has a wonderful picture. I have a PS3 for Blu-Ray movies and it makes the movies look even better. This is a fantastic TV!!", "Date": "June 7, 2012"}, {"Title": "Amazing LCD for cinema!", "Author": "Jason", "ReviewID": "R15SC2EXC64DQZ", "Overall": "5.0", "Content": "While some complain about reflections being an issue, I have found that as long as I keep any sources of glare directly off the screen (particularly directly behind your seating position), glare is hardly an issue. Off axis viewing is superb, as well as color accuracy and contrast. I DO highly suggest you get your set professionally calibrated for the best viewing experience. (This model supports the highest level of calibration possible unlike most consumer grade LCD sets.)For use in a dimmed home theater setting, I have seen few sets that can equal the quality of the image. (with the exception of extremely high-end plasma displays costing many times the cost of this).The swivel base is both nice looking (glass covered) and proves to be handy when making connections on the back or for different seating arrangements. Wall mounting is handy, but be sure you use screws included with the set to attach the wall mount brackets. The depth of other screws could be too long and damage the internals if you are not careful.Drawbacks are the fact that due to the thin profile of the set, the sound from the built-in speakers is anemic but does play loud enough for general viewing. I highly suggest a proper home theater system for viewing movies, etc.A second \"drawback\" for some would be the fact that the set is quite heavy because the face is solid glass and the rear is metal (not plastic). Personally, I find this to prove the quality of the set inside and out, but it can be difficult to lift/move for many people. And you will want to go with a wall mount that can support the extra weight if you go that route. I have used a heavy duty double arm cantilever mount with no issues with the set for almost a year before using the included stand. Just be sure both the mount is capable of the weight AND the attachments to the wall are STRONG and very secure!", "Date": "March 2, 2012"}, {"Title": "A very good TV", "Author": "Jon in the Southwest \"Jon\"", "ReviewID": "R1SB9Q6O6KIQQD", "Overall": "5.0", "Content": "We bought this TV online from Vann's in November of 2010 and we have thoroughly enjoyed it ever since. It replaced a 2002 Sony CRT Trinitron for the living room. WOW, and what a differnce it has made! LG apparently does not make it anymore, but I am going to upgrade the software today from their website to see if they have added more apps and perhaps some other types of functionalities that I an unaware of.  As far as the screen and the reflectiveness, it is a reflective screen that can glare, but we have it in a place that is not too bright. This does bring up one point though, and this is that when using the Eco mode to reduce screen brightness and to use less power, the screen gets too dark for my taste. As I said, it is placed in a darker spot of the living room and I would not expect the Eco mode to therefore make the screen as dark as it does, but it could just be my middle aged eyesight not being what it one was; cataract formation perhaps...  Whatever the case, it is a great TV with so many functions and inputs/outputs. I can overlook the issue of the Eco mode being too dark for my eyesight. One output that we just began to use is the optical output to our new Yamaha sound bar. Since November of 2010 we have just used the built-in 5.1 speakers and they have done the job, but now with a soundbar connected thru the optical output I would find it hard to go back to just using the built-in speakers. Of course money is limited, so having watched this TV without a soundbar for over a year now I have no complaints about sound quality; in addition to this, the picture at 240Hz refresh is perfect for sports and set to standard brightness it is a pleasure to view sports games with! Not a single issue of blur for  fast paced sporting events.  I saw that someone complained about this TV only doing \"military\" time. What a crock. Most of the world uses a 24 hour time cycle because it is logical and easier. Having lived in Europe as a civilian, it is personally my preferred method of time recording. One does not need be a rocket scientist in order to add 6 hours onto 12 noon in one's head and say that it is 18:00.  Having praised this TV I must add that since technology changes so fast I would look around at the newer models before I would buy this one at 2 grand or even at 1400 bucks (which is what we paid for it, when it was on special from Vann's). There is a great deal of competition and  LED TV models are constantly being updated and/or renamed. This is a very good TV, but look at the newer LG models and other brands as well. Perhaps the side-lit LED models are better when placed in bright spot? Perhaps other models have better Eco modes? Do the research online, go to the stores to check out things and then make a decision.", "Date": "February 3, 2012"}, {"Title": "Incredible Picture!", "Author": "xSK0RCHx", "ReviewID": "R13J8GJ7S7VRL", "Overall": "5.0", "Content": "I am extremely pleased with this TV so I bought another one 55\" with 3D. Inky blacks, I mean really black, as black as black can be. Beautiful colors. Easy set up with Image Science Foundation approved calibration controls. THX certified picture. There aren't many TVs that are to THX certification standards for picture quality & acurate reproduction of color. The speakers are not very good. The Picture & ease of set up are fantastic. The remote is very good. The TV looks great even when its not on, like a work of modern art! BUy it, you won't regret it.", "Date": "October 20, 2011"}, {"Title": "Without a Doubt the Best LED TV (Non 3D) for the Money", "Author": "Andrew R.", "ReviewID": "R1BHQ8IYAWGFZS", "Overall": "5.0", "Content": "This LG 47LE8500 has an amazing picture and really is the absolute BEST LED TV (Non 3-D) thats out there for this price. I ended up getting mine for just under $1,500. I took a very long time to make my decision for the TV. I was not sold on 3D TVs and knew I wanted the LED for not only the picture quality, but also for the slim design. I've owned this TV for roughly 9 months now and I have no doubts whatsoever. Many people complain about the glare/reflection. My TV is currently sitting on a base stand that has a window facing it. While there is a glare/reflection, this is not a big deal, for me at least. With blinds closed its a non factor. Please note, there is a plastic film that coats the TV screen. I noticed this and thought that maybe it should be removed. After reviewing sites and speaking to store personnel, I found that this should NOT be removed. Bottom line, I love the TV and wouldn't change a thing! Strongly recommend this to anyone looking for a 46/47\" LED TV.", "Date": "July 27, 2011"}, {"Title": "nice tv", "Author": "R. Alvarez", "ReviewID": "R2096G25VUME2V", "Overall": "5.0", "Content": "had tv about a week, so far so good. glare not an issue for me, reckon it's a personal thing.the screws were a little flimsy, but with some care you should get them in ok. it's worth it for this fantastic picture.if you want to use the wireless feature and are also getting a bluray disc player, you might want to think about getting a player with wireless already active so you don't have to get a usb adapter. the sony 570 comes recommended. i got the lg 590. it works great and easy setup. it also has 250g hard drie. it is only a little more than the sony and i don't want 3doverall this lg8500 is awesome. highly recommended.", "Date": "March 10, 2011"}, {"Title": "Thanks Reviewers !", "Author": "Snarge", "ReviewID": "RAI9THJ80BMGZ", "Overall": "5.0", "Content": "Wanted to add a unique review here regarding the previous reviewers.And that is a thank you for pointing out the issue with the mounting screws.  Since I was aware of the complaints regarding the screws I was very careful in using a philips head driver that was new and not worn and made sure to apply appropriate torque without stripping the head or causing other problems.  The TV could use more screws to mount the base but with the warning I was able to set the screws with out any problem.As for glare/reflections, yep it's got it, but so did the older tube TVs.  I'm ok with it.Really enjoy the TV.So thanks to you reviewers and for Amazon for providing the forum for such an information exchange.", "Date": "January 26, 2011"}, {"Title": "Amazing LED TV!", "Author": "SST", "ReviewID": "R6MFZZ0E6EQ30", "Overall": "5.0", "Content": "I've had this LED TV for almost a month now, and I do have to say - it's amazing. I do have to agree with a lot of other reviewers that the screen is really reflective. Knowing this in advance I purchased the LG LSW200BG wall mount. This wall mount is pretty amazing too. It allows you to have the TV almost flat against the wall or you can pull it out roughly 8-10 inch. to get at the hook ups. You can also swing the TV left or right and tilt it up or down. Angling the TV down a little helps with the glare. Sorry for the review on the wall mount, but if you are concerned with glare, this is the way to go. Shop around for the wall mount, I found for half the price that amazon wants for it. Again, I'm very happy with the TV.", "Date": "January 23, 2011"}, {"Title": "Great picture quality and real value for money", "Author": "DevD", "ReviewID": "RVNHWXYIJAS55", "Overall": "5.0", "Content": "This is a great TV. Picture quality definitely beats Samsung or Sony. It was extremely easy to setup. Netcast works great. Netflix movies streaming in HD look great. The glass panel and borderless design improves the aesthetics of the tv. Glare is there but it's certainly not a deal breaker. I have been using Standard mode and did not change in default settings. It works well. This is one of the rarely available full led HDTV and it's a great time to buy this as it seems deeply discounted from some of the online retailers. I directly ordered it from Vanns.com and everything was smooth.", "Date": "January 17, 2011"}, {"Title": "A Great LED LCD TV for the Price", "Author": "Phunphil", "ReviewID": "R3380NA72UYQDN", "Overall": "4.0", "Content": "Note: This review is written for middle-of-the-road folks who just want to know if this is a good TV or not, and don't want to get into the nitty-gritty about constrast ratios, refresh rates, etc. (like me!).Summary: If you're looking for a reasonably priced, full LED LCD TV that throws in a few extra bells and whistles, you cannot go wrong with LG's INFINIA LE8500 series.Pros: This TV has a great picture. The full LED display provides excellent picture clarity, and I would argue that this set rivals some plasmas for the black levels it can produce. In a nutshell, the LE8500 produces the kind of image quality that you would expect from a new 1080p LCD TV (and then some).I have not had a chance to use the NetCast features on this TV (more on that later), but I'm looking forward to being able to access features such as Netflix, Vudu, and the Yahoo \"widgets\" that allow you to read news, sports updates, etc. without having to leave whatever show you're watching. Last I checked, however, NetCast doesn't include Hulu, which I'd rather have than Facebook or Youtube.I also really appreciate the functionality of this TV. The menu system is easy to navigate, providing clear symbols for the various inputs you might have plugged in and uncluttered menu screens. I also appreciate the fact that LG throws in two remotes; one for doing everything and one for folks who just want to \"change the channel or volume\".Also, though it's not important in the grand scheme of things, the aesthetic of this TV is really nice. It's slim design and glass finish give it a classy, unobtrusive look. I also haven't had any glare issues with this TV like other folks have, and I have my TV set up next to a large window.Cons: The biggest issue I have with this TV is its TruMotion (the feature that makes whatever you're watching look like a soap opera--good for sports or other \"live\" programming); I just don't see a big difference, even with it set to high. The sound quality is also pretty standard, though this isn't uncommon for most flat screen TVs.  Finally, I was also disappointed to find out that a separate dongle had to be purchased in order to wirelessly connect to the internet. Though in fairness, this is more the fault of the Frys salesman that we bought this TV from than LG's--he told us a separate dongle wasn't required.In closing, I've always been a Sony or Samsung guy when it came to my electronics and TVs, but LG has surprised me with this affordable and versatile TV. Give it a shot and you won't be disappointed.", "Date": "January 14, 2011"}, {"Title": "Nice Television", "Author": "Jason Dragon", "ReviewID": "R3IBYYKS3TMSXN", "Overall": "5.0", "Content": "I've had this TV for 1 day now and so far I'm satisfied. The picture quality does seem much better than my old Sony projection TV. The audio with the built in speakers is a step down, but that I probably expected given the trend towards thinner and thinner TVs. After hooking up and turning on the TV my wired network was automatically recognized and 2 software updates occurred. The built in Netflix streaming app presented a very nice picture and has more features than the same app in my LG BD390 Blu-Ray player. A cable TV signal and a Blu-Ray movie both displayed nicely as well.I find this TV to have much less glare than my old projection TV. There is a film on the glass that goes to within a few millimetes of each edge.  On top of that in the lower left corner was a 4 x 9 inch sticker advertising the TV's features - which obviously is meant to be removed. But it was a bit confusing to me whether the film was meant to be removed along with it. The edge of the sticker was close to the edge of the film. The film was thick enough to make it seem like it was just meant for protection during shipping, but it was perfectly straight and blemish free. I contacted customer support and they said \"Please do not remove this film. That is a protective film for the panel of the TV. It is part of the design of the unit.\" The film does seem to also have an anti-glare property to it.", "Date": "January 7, 2011"}, {"Title": "Great picture", "Author": "Samson", "ReviewID": "R1TT90EOV64DAT", "Overall": "4.0", "Content": "I love this tv and the picture is great super clear the simplink on the remote matches your two systems blue Ray player to tv with a push of a button super easy I don't use half the stuff this tv is capable of bit it is really easy to figure out", "Date": "December 30, 2010"}, {"Title": "Outstanding set for the price.", "Author": "Roger Safian", "ReviewID": "R1PY07WFMXP1L5", "Overall": "5.0", "Content": "The skinny is you won't go wrong if you order this set.I may be wrong, but, I see 3D as a gimmick.  If you want it, better find another set as this set does not have that feature.I would love if the LG Netcast service had a option to check Facebook...what can I say, I'm hooked.  ;-)Setting this TV up was a snap.  I took it out of the package, plugged in the cable and ethernet, set my time zone, and that's all you have to do.  It's a snap.  The picture is great, although I did change the \"picture mode\" to \"vivid\" as I liked the way that looked.  Anyway, I'm happy with the purchase.  FWIW, We bought both the 47 and 55 inch sets.My only gripe, is that I wish that they had included a single, more richly featured, programmable remote control.  They give you two remotes, a mini remote that does just the basics, and a full remote.  I would love to be able to add my Tivo and cable features to their remote.", "Date": "December 24, 2010"}, {"Title": "meets all of my expectations", "Author": "Clavo S", "ReviewID": "R12GB0F60C4J0C", "Overall": "5.0", "Content": "I compared TVs for several months before deciding on this unit.  It had what I wanted in an LED display.  I have had the TV for a couple of weeks.  The setup for the online options such as Netscape, Pandora Radio, You-Tube, et al, was easy, and it works very well.  I did buy a dual-band N series wireless router to facilitate the wireless streaming capability (I bought the USB adapter via Amazon), and it works very well.  Maybe in a couple of years I will regret not going for the 3D unit, but for now, it's about as good as it gets, from my point of view.", "Date": "December 16, 2010"}, {"Title": "Great TV, shipping problem, reflective screen an issue", "Author": "Leading Edge Boomer", "ReviewID": "R1P14SAZZJ6SU3", "Overall": "5.0", "Content": "I bought this to replace an early-adopter Sharp LCD (when the monitor was separate from another electronics box) that was six years old, with the goal to get far better video.  This has been achieved, and I sold the old one to someone who will use it as a 45\" gaming monitor--he may be disappointed with the response times.  I've had this product for a few days now, so here's a review of the process and the product.1.  Delivery: quite fast, I'm in NM, it was shipped from Phoenix, so I had hopes it would endure minimal handling.2.  Delivery condition:  bad.  The manufacturer's box was the shipping container, and it arrived via UPS with a long gash in the box, noted by the UPS guy.  The styrofoam packing pieces were also somewhat broken.  Turns out (by chance) that it was the backside of the product, but something got far in to make a little dent in the metal.  So I was anxious to get the product set up to see that it functioned correctly--OK.  A problem for LG:  When the two straps are removed, the top is lifted from the base of the package, but the bottom packaging is insufficient to hold the unit upright--be prepared to lean it on something.  Better, don't start unpacking before moving the box to very near to the product destination.The product is heavy--70 lb with stand, and requires two able people to handle.  I have a broken foot, but we were able to get'er done.I have bought LCD TVs via the Internet twice before.  They both came with a shipping box encasing the manufacturer's product enclosure, and this one did not.  AMAZON, ARE YOU READING THIS?  The manufacturer's box works when wrapped up on a pallet with others, and when taken home by a buyer from a bricks-and-mortar store.  IT IS NOT AN INDIVIDUAL SHIPPING BOX!3.  Performance:  excellent.  As delivered, even home mode was in carnival colors.  You can search online among \"expert\" reviews to find what they take as optimum adjustments, and modify as desired.  To me, it's completely realistic after that.I don't use the TV audio, so I cannot comment on that.4.  Reflective screen:  definitely an issue.  Daytime, our sliding-door blinds are not black-out, and viewing from my computer desk is a problem.  At night, we have to dim lamps or use others to completely eliminate distraction.  Evaluate this for your own setting, since your mileage may vary.There is nothing in the manual about removing what some have found as a plastic cover on the glass; apparently it is not to be removed.  Cleaning with their cloth has instructions to spritz the cloth with a little water, and use nothing else since, unlike computer monitors, the LCD is not exposed.I'll update this if anything happens.", "Date": "July 2, 2011"}, {"Title": "LG 1080-240hz", "Author": "OIBCOOLEY", "ReviewID": "R2FAIS4RMLHC8K", "Overall": "5.0", "Content": "The setup instructions could be a lot better. It came with some adapters I still don't know how to use.Basic setup was quick and simple.", "Date": "January 23, 2011"}, {"Title": "Bad picture and customer service", "Author": "DK", "ReviewID": "R1FQAKXL5B8FE", "Overall": "1.0", "Content": "I purchased it online and when I received it I had problems with the picture quality. So I contacted LG customer service and they sent a technician. He said it needed to be replaced as the problem is the panel but because LG technical department insisted they decided to change the mother-board. So the technician came a second time and changes the mother-board and installing new firmware but as expected no improvement (and these are the only two services that can be done on a LCD TV). So after contacting LG customer service they told me now another technician has to come and look at it!! so we scheduled another service. the new technician came and confirmed the problem (for each appointment I had to take time off work). So when I call back they tell me that the technician needs to come back one more time!!! At that point I gave up and just returned the TV.", "Date": "December 20, 2010"}, {"Title": "Extremely reflective, Timer issues, Ghosting, Bad Cust service.", "Author": "Garan Grey \"Garan Grey\"", "ReviewID": "R3HN01ZP7U4YU4", "Overall": "3.0", "Content": "Got this in Dec 2010.  The screen is ridiculously reflective.  Powersaver/Autoadjust feature produces bad images, Local Dimming isn't very effective because the LED blocks are huge and any white letters on a black background will have at least 2 inches square ghostly glow around them bright enough to see across the room.  Replacing a 14 year old TV that had 2 timers, this has only one, The clock loses at least two minutes a week, and when you set the timer to turn it on, it turns itself off 2hrs after, even when you do not set an off time.  Did I mention the clock will only show military time?  Who are they making these things for?  Customer service is awful.  They won't send anyone out on weekends, so you would have to take a day off work, and the one kid they DID send (an actual LG rep) knew less about the TV and how it worked than I do.  And I am no expert- I've just been paying attention and doing some research.", "Date": "August 15, 2011"}, {"Title": "Great set, but not perfect", "Author": "David G. Beneke", "ReviewID": "R24ORPUDHKFC13", "Overall": "5.0", "Content": "The picture quality of my LG 47LE8500 is outstanding, sharp picture, deep blacks, accurate colors. There is an infinite number of ways to adjust the picture in the expert modes, so you can make the picture look even more stunning. When shopping for a set, this one stood out above all the others in several retail stores I went to, in regards of picture quality and color accuracy. It certainly beat out the Sharp Quattron series, which is the 4 led technology, in regards to color and picture quality. A word of warning to those who purchase this set, DO NOT TAKE THE PLASTIC SHEET OFF OF THE FRONT OF THE SET!!! LG should have made a note of this fact, because I, like many others who have reviewed this set, made the mistake of doing that, thinking it was a shipping protection cover. Nope, LG says it is necessary for getting a better picture, although the phone tech could not say why. In any case,with mine removed, I have not noticed any difference in picture quality, the screen is highly reflective, with or without the sheet. Taking the sheet off WILL void certain warranty issues.I'll cut to the chase and tell you first what I don't like about the set, as in other reviews on this site (amateur and professional) and in forums, there is the issue of noticeable horizontal banding when the picture is very bright, such as sky, solid color animation (the \"Rhapsody in Blue\" sequence in the Blu-ray of \"Fantasia 2000\" is a great example) or light scenes. To a hard core purest, it could be very annoying, but the majority of the time you will not see it. The next issue is screen glare. I have my LG recessed in a cabinet and a dark viewing room so this is not a big issue with me. However, you will see reflections if you have windows, lamps and so forth in your viewing area, much like a CRT screen. The THX bright room setting will help with most of a rooms glare artifacts, and you can boost the backlight and brightness and contrast, however this will make the horizontal banding more apparent.No set is perfect, and the pluses, out weigh the minuses of this model. The picture is second to none in any category, the infinite number of adjustments and inputs will please the tweakers, like myself, and having worked in broadcasting and motion pictures for 35 years now, I find this set to be the most cinematic I have ever seen, in fact a Blu-ray on this set looks better than any movie screen, period! HD broadcasts stunning, Dodger baseball in HD is like being there. Also this set is very net friendly, assuring that it won't go out of date any time soon, and increases it's versatility. The sound on the set is okay, the true voice technology is good for getting dialog from a noisy source, but I rarely use it, as I have a very nice 5.1 sound system set up. The infinite sound set up does give you a sense of surround sound, but it is not as dynamic as a separate sound system, one shouldn't expect that anyway.I have contacted LG customer service regarding the banding issue, they are sending a tech to my home to hopefully address the issue. If this problem is taken care of, I will write an addendum to this review and bump the rating from 4 to 5 stars, which it will truly deserve.Addendum to review 4-26-2011LG repair came over to my house, saw the banding problem, and ordered a new back panel. A week later, the same LG tech came back, very carefully, and I can not praise him enough for the great care he took to pad furniture, equipment and so on. He installed a new back panel, and the banding is gone! LG is aware of the problem, so if you are bothered by this on your unit, have LG install a new panel. The picture is absolutely outstanding. The only issue is because of the glass front there is a lot of glare. My viewing room is very dark so this is not a problem for me, and if the back lighting and contrast are bumped up, as it is in THX Bright Room mode, I don't think glare will be an issue. Love this set and can not praise its picture enough.", "Date": "April 22, 2011"}, {"Title": "Good TV but LG had a horrible mistake.", "Author": "Miss D \"Dom N.\"", "ReviewID": "R2UBX02PJMAQLU", "Overall": "4.0", "Content": "Bought this LED HDTV during black friday. When i received this product and it did not include any stand for the TV. I was forced to call amazon to help reorder the stand for the tv. Amazon has great customer service, they called for me, but LG asked that I called, which i did. Even though LG is a great electronic company, the employees are nice but the wait was too long. It took about 2-3 weeks for the TV to arrive at our house and another 3 weeks to wait for the stand which was not rushed at all. It took almost a month for us to finally be able to set up the tv. Other than that, the TV works fine, here are some of my pros and cons for the TV.Pros:LED makes screen brightAppearance looks goodincludes two remote (one that looks like for kids)Has netflix and wireless readyPlenty of HDMI portsCons:Bulit in speakers not too great (i didnt expect it to be)Swivel stand only can spin about 45degree.Overall this TV is great, just make sure you have external speakers for bluray movies =)Be sure to check if they include everything they are suppose to!", "Date": "January 21, 2011"}, {"Title": "LG  infinite 47 inch TV", "Author": "Joykar", "ReviewID": "R1LHTCLMRUY5EE", "Overall": "5.0", "Content": "LG INFINIA 47LE8500 47-Inch 1080p 240 Hz Full LED Slim LCD HDTV with Internet ApplicationsGreat TV - the picture is the closest to 3D without  3D, and watching sport programs makes you feel like you are right there!", "Date": "January 15, 2011"}, {"Title": "LG TV", "Author": "Jessica916", "ReviewID": "R2JOW12X35V663", "Overall": "5.0", "Content": "Overall, this TV is great. The picture quality is incredible! The design is very slim and it has been easy to learn to use. At times the glare is a bit much, but easily fixed by turning off lights or turning the TV away from the light.", "Date": "December 4, 2010"}, {"Title": "A Value Buy", "Author": "Fanliao", "ReviewID": "R1WX46HPUWZSEZ", "Overall": "4.0", "Content": "Since money has never been a little more than scarcity for me and I do not want to necessarily living in a compromised way, I am a die hard value buyer in every category. When it comes to time to buy our next TV, there is no difference in my online buying methods. First I 'glanced' at the specifications - i know LED is next thing up from LCD or Plasma, so LED it is; I know 1080i is better resolution than 720i, so 1080i it is; if internet streaming movies is a possible then I do not have to wait for my movie to come at the mail box, then internet application TV it is. And we already know that we want a TV that is 42\" to 48\" in size.Once we kind of know what we want, then we compare the customer reviews and pricing of the suitable candidates. We've looked at Sony, Panasonic, Samsung and LG, and pretty quickly we realize that the LG Infinity has all the feathers that we want, but about at least $400-$500 less than the bigger brands, and the previous more than 100 reviews do not reflect anything that is alarming. Since we have had a LG plasma for the past 7 years, so we have already trusted the brand. So we decided to give it a try.Up to today we have had the unit for more than 3 weeks now, and I am happy to say it is indeed a \"value buy\" that we were looking for and we are quite happy with the purchase.Picture quality - my husband's rating is 'very good' and my rating is 'good'. Since I generally have a little bit more sharper eyes than my husband because of my photography training, I can notice some tiny pixelation in National Geographic Channel when the scenes are rapidly changing, that is when you look really closely. Other than that, all the other High Def channels look very sharp and vivid. (I recommend to simply check CNN high def channel and National Geographic Channel for your High Def TV - if your CNN does not even look good to you, then all of your other high def channels will not possibly look good; and if your National Geographic Channel looks superb, then you can be assured you've got a great high def TV)Sound - as other reviewers already pointed out, you will likely to be disappointed if you intend to use the audio that is directly out of the TV set. We already expected this and we do have a AV system to go with it, so this is not a problem for us.Internet Application - this is a tricky part at first. It wasn't very clear how to connect to internet until you read the manual and figured out that a specific LG AN-WF100 Wi-Fi USB Adaptor is necessary to make it work wirelessly. Once the adaptor is ordered and used, it takes forever to find the home network and then it takes forever to set it up (it took me more than 30 minutes to figure out how to enter the WEB Key by using the remote control). When it was finally done, the downloading from Nextlix still seemed slow and from time to time it would lost the communication with the home network and we would have to start over again. Our TV is about 35 feet from the router and the wireless path includes about 3 walls, so we naturally presume that the 35 feet wireless distance is too much for wireless downloading. It is not! After we also purchased a Sony Blue Ray DVD with Wi-fi built in, I tested by using the Sony Blue Ray DVD to wireless connect the internet and downloading, boy it was a breeze! It turns out, the Sony Blue Ray DVD has no problem connecting our home network and the downloading was super fast! So the verdict is in - the LG LED unit is internet 'not so ready'! LG needs to improve a lot more on the software part to catch up with Sony!A last word about the the reflective glass panel that many customer mentioned as a problem that bothered them - it does not bother us at all! We think that the glass panel looks very very nice! It is a full piece of thick smooth glass with a black frame and thin outer transparent edge. Yes it is reflective, but the reflection is smooth and the overall look of the unit is very high end, much better than the LG Plasma we had before. The aesthetic look of the unit is a pleasant surprise for both myself and my husband!In my book, if you can save 30 - 35% to get 90% what you want, then it is a good value buy. As a matter of fact, the money we saved ($400 - $500) more than covered for our new Sony Blue Ray DVD player with Wifi build in (we paid $189 plus tax at Best Buy). So overall it is a satisfactory value buy for us!", "Date": "January 23, 2011"}, {"Title": "LG Selling Defective Merchandise - Brand New TV Completely Unusable", "Author": "Jeffrey J Freeman", "ReviewID": "R3MCRQ4SJRQ92B", "Overall": "1.0", "Content": "I purchased this television because of positive reviews and a gorgeous picture. But now this television is virtually unusable because of defective screws that are supposed to attach the television to the base.I began assembling the television, and the screwdriver I used immediately began to augur out the screw heads, stripping them out and rendering them completely unusable. So now I have a half-assembled television that won't stand upright, and I can't even use it on a wall mount because the screw heads are too stripped out to get the screws out.Even worse was the customer service line. They accused me of breaking the television and told me I would have to pay $75 for a tech visit. I told them that the screws were obviously defective (a sound argument given that this was the first time I was using them, and I was using a properly-sized phillips-head screwdriver to drive in the phillips-head screws), and he told me that the technician would make that determination. To make matters worse, he could not schedule a technician at that time, and told me that LG would call me back to schedule an appointment. It is over 24 hours later and I still do not have an appointment.A word to anybody considering puchasing this or any other LG TV - save yourself a heap of frustration and don't buy from LG. They sell a defective product that they do not stand behind. I guess it's easier for LG to  blame consumers for LG's own faulty parts instead of taking accountability for their shoddy, defective product.", "Date": "August 2, 2010"}], "ProductInfo": {"Price": "$2,699.99", "Features": "INFINIA Series\nFull LED Slim w/ Local Dimming\nTHX Certified Display\nNetCast Entertainment Access (Wi-Fi Ready)\nWireless 1080p Ready", "Name": "LG INFINIA 47LE8500 47-Inch 1080p 240 Hz Full LED Slim LCD HDTV with Internet Applications", "ImgURL": "http://ecx.images-amazon.com/images/I/41jllBKk4IL._SY300_.jpg", "ProductID": "B0001YH7JW"}}