{"Reviews": [{"Title": "Good TV but has it's problems.", "Author": "SilverZ", "ReviewID": "R2YJSV3SR47P6T", "Overall": "3.0", "Content": "I've had this TV for 2.5 years and it has held up well.It does have a problem with the EPROM getting corrupt.  This will happen probably after year 2.  You will get 2\"-4\" red, blue or green spots on the TV that shows up with certain lighting.  The spots are static in that it stays at the same area.Hats off to Panasonic.  They did own up to the problem and repaired it out of warranty.  The fix was fairly quick....15 minute process to upgrade (reprogram) the EPROM.", "Date": "May 30, 2008"}, {"Title": "Stunning HD Picture for a great price", "Author": "Rajesh Mummineni \"The Techie\"", "ReviewID": "RQ2LM0UL9S2M", "Overall": "5.0", "Content": "Strengths: Life like HD Picture and good sd picutre, sleek design, easy to use remote, sd card readerWeaknesses: No built-in TV guide, could use a second HDMI and co-ax inputsSummary: I have been looking to purchase a big screen HDTV for the past year. After some initial research last year, decided to waited another year to let the LCD technology mature and HDMI technology become common on TVs.This past 4 months, I looked at Sony 3LCD TVs and Toshiba DLP TVs very closely. Sony has good picture but did not have picture-in-picture in this years models and styling looked decades old. Toshiba's 1080P TV was very good with a ton of inputs and comparable pricing but somehow I did not feel comfortable with the Toshiba brand. My research indicated that almost all major brands have good picutre quality so the deciding factor came down to other features like inputs, pip and brandname. The picture quality in Best Buy and circuit city did not look close to what I get at home with a progressive scan DVD. For some reason, the stores want to sell Sonys more than anything else so they hookup Sony with best input and cables and leave Panasonic with ordinary cables making it look inferior.I have been a Sony or Panasonic brand customer so I decided to buy a Panasonic. For some reason, Panasonic does not have many LCD projection models and this was the only newer one in the 55+inch range. I was very impressed with the features ( sleek design, pip, inputs, sd card reader ) and price.I am an avid internet shopper but for reason did not feel comfortable making such a huge purchase online but the price difference between bricks and mortar shops to internet shops like Amazon compelled me to take a chance. The TV was delivered in perfect condition and they even set it up in the room of my choice. The TV design looked much better at home ( up close ) than in stores. It weighs a lot less than my old 27inch tube TV.HD Picture:I hooked a $20 HD antenna to the TV and boy, was I impressed with the picutre quality? Local HD channels looked lifelike. I just could not believe my eyes. This is using a co-axial cable and NOT HDMI. I am glad I did not fork over a fortunate for a Plasma TV because the HD picture quality is just as good as that of a plasma TV.DVD Picture:Make sure you get a Progressive Scan DVD player to enjoy good quality movies. The quality won't be as good as HD but it is very good. I used component video cables to connect my DVD player. I could see significant difference in picture quality between a regular DVD player with composite cables and a progressive scan DVD player with component cables.SD Picture:SD picture ( Dish network ) quality is more than satisfactory. It is not as good as my old tube TV but that is expected and I am very happy with the quality. There is even a significant difference in picture when connected using S-Video or composite cables. I just wish there was an additional co-axial cable input so that I can hook both the antenna and the dish receiver using co-ax cables.For now, I have not decided whether to upgrade to HD receiver from dish or wait because I heard that the output from dish network HD receiver is something like 480p and there are not a lot of HD channels available outside of local channels.I am sitting about 10-15 feet from the TV. I do not notice a lot of grainy pixels from less than 10 feet also although it is not wise to sit that close. HD picture look great from any distance.The remote is very easy to use. The SD card reader is handy although I noticed that it is better to view your picture on a laptop than on a TV. It is just painfully slow on a TV when compared to a computer. The SD card reader can be useful when you don't have a computer(laptop) handy.I have not used the PC input yet. I don't intend to use a 61 inch screen as a my PC input anyways.The TV does not look big in my family room as I suspected. The TV is much smaller than a 60inch Sony model and looks 100times better. It is a great upgrade for me and the details I could notice on this TV are stunning. As I said before, I love the HD picture on this TV. I watched a Pistons game the other day in HD and it was better than being in the stadium :) The detail on the big screen was just awesome. I watched the SuperBowl on ABC in HD with digital audio connected to my Bose surround system and it was simply a superb experience. HD picture is just as good as on a Plasma TV.Overall, this is a great TV. I am glad I purchased this over Sony.", "Date": "February 8, 2006"}, {"Title": "BIG Great TV for the good price", "Author": "Suresh Billa", "ReviewID": "R3EK6SNI2WW62V", "Overall": "5.0", "Content": "bright & crisp picture quality, greate design, good quality sound, good contrast ratio, 3lcd technology gives true colors, easy to select inputs, 4 comonent, 4 composite, 1 hdmi gives more flexibility to have more devices. sd photo card reader is excellent, pc input gives more flexibility to connet your computer. hdtv inbuild tuner, cablecard ready what not, it has everythin you need with great price, this product canbe compared with the most expensive tv's, this tv can sit any place in your home, you can watch the tv in any lighting conditions. i am really liking this tv since last one week, i recommend this tv. only thing i did not like is Stand, it is simply $599.", "Date": "June 16, 2005"}, {"Title": "Awesome TV for a great price!", "Author": "D. Ng \"dennisdpt\"", "ReviewID": "R2MLXQHE9UT3K1", "Overall": "5.0", "Content": "I've spent about 3 to 4 months trying to decide what kind of big screen TV to buy. With so many options available (plasma, DLP, LCD, etc.), buying a TV can be a head-splitting task. However, after considering what I want out of a big screen TV as well as my budget, I finally decided that this TV is the way to go. One drawbacks I read with LCD projection TVs is the \"screen door effect\" which is really obvious if you are sitting close to the TV. Since I'm at a comfortable distance away from the TV, I don't see this at all. Overall, the picture quality is awesome. I have yet to subscribe to HDTV (Charter Communications has a waiting list...sheesh!)...but the picture is excellent for standard TV reception. The picture is even better with DVDs and games (I have hooked up a Gamecube and PS2 to this). I think one of the reviewers below mentioned the price of the stand...yes, it is somewhat pricey...but you don't really much of an option since the manual states that this is the stand they recommend for the TV...and if you're putting down this much money on a TV, it's best to spend a little extra to ensure that the whole thing doesn't topple over. The Panasonic stand comes with features to prevent the TV from tipping over...or you can also chain the TV to the wall (I swear...this is in the manual). So if you're looking for a nice big screen TV for a reasonable price, this TV is the way to go.", "Date": "March 22, 2006"}, {"Title": "Great tv", "Author": "Fred \"Fred\"", "ReviewID": "RYCWI6J2YXASJ", "Overall": "5.0", "Content": "I bought this television in 2006 for approximately $2,500. It still works, with the EPROM issue happening only a few months ago and amounting to one minor annoyance in over six years of regular use. I've recently replaced this model with a 3D LED smart tv. This one is going to a family member and we expect many more years of service.", "Date": "April 8, 2013"}, {"Title": "Not a smart buy", "Author": "Lorrie And Sherwin Palmer \"Lorrie Palmer\"", "ReviewID": "R2P3APZQMO4T38", "Overall": "1.0", "Content": "Problems with this television from the beginning. The lamp was not the issue. The picture created yellow, green, red, and blue spots within one to two years. Within three years the lamp finally went out and by four years the television was gone. Don't buy this tv.", "Date": "August 25, 2012"}, {"Title": "Great Televison for the Price!", "Author": "L. Womack \"crichtonfan1\"", "ReviewID": "R44WC568QNBTH", "Overall": "5.0", "Content": "I did research for a little over a year before opting for the Panasonic PT-61LCX65 television. I have had this TV for almost three years and have had no problems with it. The picture is great whatever the source input I have used. I have a Panasonic surround sound system hooked up to it and that has increased my enjoyment of DVDs emmensely. I have a Playstation 2 hooked up to it and everyone enjoys playing the games on it. Last night I watched the movie Transformers on it and enjoyed it as much as I did in the movie theatre. I plan on purchasing a DVD player with the upconvert feature using the HDMI connection shortly. I have not been disappointed at all with this purchase.", "Date": "December 11, 2007"}, {"Title": "Great TV!", "Author": "JG", "ReviewID": "R3AD6SPUMCKBBZ", "Overall": "5.0", "Content": "Bought this TV in 2006 and it's still running in perfect condition. The HD quality is amazing for sports and movies. The ability to fine tune the coloring allows you to make movies and tv shows look great depending on your lighting/environment. I have not had to replace any parts on this TV in 7 years and counting. The silver stand that it comes with makes this unit look very modern and sharp. I highly recommend this TV!!", "Date": "October 9, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "61-inch, slim-body LCD projection TV with widescreen 16:9 aspect ratio; 56.1 x 40.5 x 18.44 inches (W x H x D)\n1,280 x 720 native resolution; built-in ATSC tuner for free, high-definition 720p and 1080i reception\nDCR (Digital Cable Ready) with CableCARD clot for plug-and-play digital cable (where available)\nSD Card lets you view digital photo slideshows right on your big-screen TV (supports 8 MB to 1 GB cards)\n12 total video inputs include 1 HDMI digital-video input and 3 HD/SD component-video inputs", "Name": "Panasonic PT-61LCX65 61-Inch Widescreen HD-Ready LCD Projection TV", "ImgURL": "http://ecx.images-amazon.com/images/I/51B3J9PD16L._SY300_.jpg", "ProductID": "B0007WKB28"}}