{"Reviews": [{"Title": "My first HDTV and I love it!!!", "Author": "Ryan", "ReviewID": "RPL6MDQR4VLWX", "Overall": "5.0", "Content": "I've been researching alot over the internet the past few months for my first ever hdtv. At first I wanted to get an LCD and I've been looking at the big names like Sony, Samsung, Sharp etc, but even their 32 in. size hdtv's were over $1500! I came across this JVC HD52G887 and it had everything I wanted. It is a hd set. It has a atsc/qam tuner, It's 52 inches! It's under a 1000 dollars!!! This set is DLP which means it is projection, it's not flat in the back. When I got it home it was so easy to hook up. I plugged it in, plugged the cable connection into the back, plugged my xbox 360 and Wii into the back. I love it. I am using my standard Time Warner cable connection to this and It still looks really good! The 360 looks SO good on this set!!! The Wii on the other hand is not too pretty, although I'm not using component cables for it which I heard could help a little. The wii was not meant to look its best in 52\" hd. The instruction booklet for the tv is pretty thourough. I followed the step by step of instructions of setting it up and had it working with my cable box in about 5 minutes out of the box. The remote is decent with many features including split screen, freeze, and an input button which easily let's you switch between tv mode and the different video modes that you are using your game systems for. Overall I couldn't be happier, and recommend this set to everyone!", "Date": "October 9, 2007"}, {"Title": "Kev", "Author": "K. Lewis", "ReviewID": "R339J18Z0OBXNF", "Overall": "5.0", "Content": "Impressive TV....Great Price...Just a remarkably good deal..I have a PS3 and the games look better on this than my Samsung 42 LCD hdtv..The colors are warmer and smoother.  My LCD makes it too bright and annoying.  I must admit this TV is great.", "Date": "August 8, 2007"}, {"Title": "Great TV for the price", "Author": "Jeffrey T. Pratt \"jp\"", "ReviewID": "R21ENC0S9BYUY6", "Overall": "5.0", "Content": "I love this tv and it was such a great deal!!!!!  It looks great, and there is no lag when playing my xbox 360 on it.", "Date": "May 12, 2007"}, {"Title": "best tv i have ever owned", "Author": "scotty", "ReviewID": "R6413YRTITLD4", "Overall": "5.0", "Content": "this tv is a tank, the aftermarket bulbs dont cost much and unlike lcd or plazma tvs, once something messes up in this one (usually the bulb) its easily replaced by removing a small door on the side of the tv. if the picture gets dark. or weird shadows in the picture. the tv is easily taken apart and insides cleaned. the picture is amazing. the aftermaket bulbs are cheap as i said. i got one a year and a half ago and the tv stays on 24/7 playing ps3, netflix. or watching tv or sometimes just stays on for nothing and the picture is still bright. beutifull and perfect. if it gives out, that time paid for the 15-30$ bulb lol. (dont get the tv from jvc directly cuz it costs over 100$)", "Date": "March 27, 2013"}, {"Title": "Second hand awesome", "Author": "Adrian Sewell", "ReviewID": "R3QPJQLAUF0ZLR", "Overall": "5.0", "Content": "I Moved over to Okinawa, Japan in 2009 as a station of my military lifestyle.  I needed a TV and bought this model from my buddy a few months later for $600 USD.  This has had to be one of the best investments that I have made in quite a while. Looks great. Lamps go out but its cheaper in the long run than any plasma.", "Date": "December 6, 2010"}, {"Title": "I LOVE MY REAR PROJECTION TV!!!", "Author": "Happy Camper \"Happy\"", "ReviewID": "R16BC9UG0AAU0C", "Overall": "5.0", "Content": "After many months of checking into all the different types of new HDTVs.  I decided that I rear projection was the right choice for me.  And BOY was I right,  I LOVE MY REAR PROJECTION TV!!!  I would definitely buy another.", "Date": "January 18, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "JVC HD52G887 LCOS Projection TV", "Name": "JVC HD52G887 52-Inch HDILA Rear Projection TV", "ImgURL": "http://ecx.images-amazon.com/images/I/413zii91KPL._SX300_.jpg", "ProductID": "B000FGBVEI"}}