{"Reviews": [{"Title": "Better than advertized in description.", "Author": "ciscoman", "ReviewID": "R1U022T9T6CU1Q", "Overall": "5.0", "Content": "I got the first set in February of 2008 but had to return it since it had 1 bad pixel which was a bright green dot near the top center of the screen. I had no problem returning it to the vendor which was great \"wegotbetterdeals\" and I highly recommend them. The reason I am not upset was because the Amazon details of this product were incorrect. Both the sets I received must of been updated models even tho they were SYTPT3227AB 32inch models. This model has (3) HDMI ports, not one and a 8ms response time, not 12ms as stated in the description.  Needless to say this more then made up for the first set I received with the bad pixel. Set has been working great as of 4/24/2008 and has a quick startup time. Only issue I had was with my Cablevision remote won't operate the TV as well as many other universal remotes I tried. Solution is to buy a \"Learning Remote\". I am using a SONY RM-VL600 and it was under 30 bucks. Also has the option to turn the TV and cable box on and off with one button if you program it. Hope this helps everyone.", "Date": "April 24, 2008"}, {"Title": "Soyo 32\" LCD HDTV", "Author": "Patricia Jude", "ReviewID": "R20GF5HQJPLMKM", "Overall": "4.0", "Content": "Got this TV at Christmas Time at Ecost and got the wallmount too for $606 total. I got it on the wall and found the sleeptimer didn't work so had to call the Soyo company and it was hard to understand what they were saying and had some stupid ideas why it didn't work but after the 3rd try I got ahold of someone who knew his tvs and worked me through how to put the code in and it worked!!  The company is in California.  Otherwise, I LOVE my LCD HDTV!!!!", "Date": "February 19, 2008"}, {"Title": "Soyo burn out !!", "Author": "J. David Morris", "ReviewID": "R97Q5G0SP9S7M", "Overall": "1.0", "Content": "A friend and I each bought a 32\" Soyo at a great price of 700.00 (at the time) after mail in re-bate.  9 months later we still had not received our 75.00 rebate and both of us had to leave nasty messages to get Soyo to honor their rebate program. The TVs had a one year warranty on them and a month after my warranty was over my soyo TV bit the dust. A month later (14 months after purchase) my friend's Soyo died. Since Soyo has no authorised service stations anywhere but in California (again at the time) we discovered we were going to have to pack up the TVs and ship them to California to be repaired and pay the freight coming and going and it was going to cost at least 400.00 and possibly 600.00  to get the sets repaired. So we junked them and bought Samsungs with an extended warranty (which was not offered when we purchase the Soyos). The Soyo's picture was great but I lost 750.00 on a HDTV that lasted a little over a year. Soyo total burn out !!", "Date": "November 28, 2008"}, {"Title": "Perfect in every way but one.", "Author": "Mike Vaughan", "ReviewID": "R2FM12EIPH06DB", "Overall": "4.0", "Content": "Have had this TV for about 3 years now, and it was one of the best deals I've ever found. I did a lot of research, and this model had everything I needed (at the time) at an unbelievable price compared to other brands with the same specs.  The picture quality if wonderful, especially the HD channels on my cable.  Every time I'm in a store with HDTVs on display, none of them seem to compare to the great picture I get on my Soyo.However, I've just purchased a PS3, mainly for the Blu-ray player, and realized I wasn't getting full resolution because the TV resolution goes to 1080i only, but full Blu-ray needs 1080p.  I had bookmarked a review from 2006 saying there was really no reason to buy 1080p at that time, and I took that advise.  That's no longer the case.If you don't care about Blu-ray (the TV does an amazing job with regular DVDs), then this is probably still a great deal.As another reviewer mentioned, this model had an update somewhere along the way. Mine is the older model with just one HDMI input, so perhaps they've updated to provide 1080p resolution.", "Date": "May 31, 2009"}, {"Title": "good", "Author": "brandy", "ReviewID": "R2YS1WYPHFHUDM", "Overall": "5.0", "Content": "I had this tv coming up on 6 yrs and it still works good! There is a little black in the screen but you can hardly tell! The channel also gets turned sometimes when you change the volume up or down, but other than that its pretty good!", "Date": "November 22, 2012"}, {"Title": "So Far So Good", "Author": "AH \"Ash\"", "ReviewID": "RBPUGKLB3H110", "Overall": "5.0", "Content": "I got this TV on Thanks Giving from 6th Avenue..So far so good...Looks like its worth the price...", "Date": "December 12, 2007"}, {"Title": "Haven't", "Author": "J. Garland", "ReviewID": "R12Q1QCLYJ61QL", "Overall": "4.0", "Content": "Haven't recieved this TV just yet but I ordered it yesterday, will write more once I get it in a week or so.  The price was just right.", "Date": "April 24, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "32 Inch LCD HDTV Flat Panel\nDisplays 16.7 Million Colors/12ms Response Time\nUltra High 1366 x 768 Pixel Resolution\n1200:1 Dynamic Contrast Ratio/16:9 Aspect Ratio\n42 Lbs (WxLxH) 9.0\" x 31.625\" x 23.625", "Name": "SOYO SYTPT3227AB 32-Inch LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41xRFjyk07L._SY300_.jpg", "ProductID": "B000QSIOP4"}}