{"Reviews": [{"Title": "Just a Piece of Junk", "Author": "Julie Miller", "ReviewID": "R2JM3WU5Z9RX5E", "Overall": "1.0", "Content": "last for about 9 months, and then blows a fuse in the converter box. rca knows about the problem. can be used as a monitor only now. what a piece of junk by thompson electronics, aka: rca.  Dont buy. Samsung or LG or Sony.jim", "Date": "May 10, 2008"}, {"Title": "9 - 14 month life span", "Author": "Kevin \"Kevin D.\"", "ReviewID": "RYJUH3ORE61L", "Overall": "1.0", "Content": "RCA L46WD250 46-Inch LCD Scenium Flat HDTV  I agree with other review, mine lasted 14 months before power totally died. No sound no picture.  It started temporarily going out within 6 months of purchase.  DON'T BUY!", "Date": "February 12, 2009"}, {"Title": "Totally a pile of expensive junk!", "Author": "PastorLee", "ReviewID": "RXQ0XJ06OA09A", "Overall": "1.0", "Content": "Paid $1,999.00 for it and had to be put into the repair shop in less than 1 week's use! Had to be repaired 2 more times out of warranty; each repair cost more than $300.00. The final disposition was a blown main board, which RCA doesn't have now. Couldn't find a repairman anywhere within 150 miles of Nashville who could find the board. I guess an RCA tv is now a mere \"disposable\" product after about a year. It's the worse TV I've ever owned. BUYER BEWARE!!!", "Date": "August 19, 2011"}, {"Title": "Satisfied Customer", "Author": "TV Pete", "ReviewID": "RFB8WFUESCX3H", "Overall": "4.0", "Content": "I have owned this tv for over 2 years now and have had none of the problems reviewed above...  I was extremely surprised to come across these reviews.  Only because I have used mine thoroughly and have had no signs of problems.  Only down side I can find about this tv is the retail price.  I am a satisfied customer.  I'm also curious if the other customers had the 720p model or 1080i?", "Date": "January 24, 2012"}], "ProductInfo": {"Price": "$1,599.99", "Features": null, "Name": "RCA L46WD250 46-Inch LCD Scenium Flat HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/416hbFQClTL._SY300_.jpg", "ProductID": "B000UD0L2E"}}