{"Reviews": [{"Title": "Sleeper Offering Relative to Most Popular LCDS", "Author": "J. DeStefano", "ReviewID": "R32T3PJ6I9T6O6", "Overall": "5.0", "Content": "I was tending towards getting a smaller Samsung LCD to complement the 46\" model I now have when I came across this Panasonic unit. What a surprise to find not only did it have an even brighter, crisper picture, but it also had a decent set of speakers and some unique features lacking in the Samsung and Sony models.  These features include an automatic shutoff option if the remote hasn't been used for 90 minutes - a handy feature if you fall asleep while watching or have kids who leave the tv on. In addition, if signal is lost or a component feeding the unit is shut off, this tv automatically turns itself off after a period of time.  Also it has a black adjustment setting which provides the pitch black typical of Sharp models, or optionally a lighter black which better shows detail in darker areas like Sony and Samsung offer, if that is what you prefer.  The unique lighting source gets rid of the buzz other reviewers have complained about in some smaller Samsung sets.  Getting back to the speakers - having a decent pair is critical for smaller sets where you likely wont be using a stand alone set of speakers.  The Samsung speakers tend to be marginal in their smaller sets. Perhaps the only drawback I saw to this unit was the design.  Clearly not as striking as the Samsung or even Sony.  However, the construction is solid and it has a decent traditional look.  And for a price lower than Samsung or Sony, it is a steal.  Seems as though Panasonic - well know for its quality plasma sets - is finally getting serious about becoming a major player in the LCD arena.  I love my 46\" LCD Samsung, but this is clearly the best choice and value for a smaller LCD.", "Date": "July 29, 2007"}, {"Title": "Panasonic 32\" LX70", "Author": "jp", "ReviewID": "R20XMV35RIAIZ4", "Overall": "5.0", "Content": "I love this TV!  I've had it for about 3 weeks now, and I'm so happy I went with this model and brand.  First of all, I really like the Panasonic company.  They actually have a customer service department!  (With real people!  In this country!)  Other than that, the picture is great.  It's really just as good as, or almost as good as, a Sony or Samsung, and certainly better than any other brand.  And the price is significantly less than other name-brands.  They say that 720p looks as good as 1080p at this size.  No channels broadcast at higher than 720p or 1080i anyway, both of which this TV supports.  My recommendation is to not waste your money on 1080p unless you get a bigger TV than this, and plan to hook up a HD DVD or Blu-ray player otherwise you will never see the difference.  Except in your wallet.I was close to buying a Sharp, actually, until I read all the reviews that say that standard definition channels look TERRIBLE on the Sharp.  Then I went into a store to compare and you can really see the difference when SD commercials came on.  The vast majority of my channels are SD, so that was important.  I don't have a HD DVD or Blu-ray, but the picture from my progressive-scan DVD player is incredible.  One last thing: the sound is really good for a TV.  I usually hook it up to my stereo, but it's surprisingly good on its own.So if you are waffling between a few different TVs and this is one of them, I don't think you'd be disappointed AT ALL if you settled on this one.  Buy it!", "Date": "December 20, 2007"}, {"Title": "Excellent TV", "Author": "Double Delight \"Rosy\"", "ReviewID": "R1Q506S30Y7NXG", "Overall": "5.0", "Content": "I bought this TV for two reasons: One was that I had decided Panasonic had the best picture in the stores where I had seen it and the other was that I have only an outside antenna and a reviewer said his worked great on a simple antenna.  He was right and I am extremely pleased with this TV.  Almost looks like 3-D on my best stations.", "Date": "August 3, 2007"}, {"Title": "Terrific performance and value", "Author": "A. Amy", "ReviewID": "R2Y6ZDCV481Y3X", "Overall": "5.0", "Content": "After comparing this television side-by-side with many others, including a far more expensive Sharp Aquos, I could detect virtually no reason not to buy it. Upconverted DVDs look EXCEPTIONAL and the sound is surprisingly dynamic; it almost sounds like a far bigger mini stereo system! Of course, it's still no match for a high quality amplifier and speakers, but it's far better than any other TV I've owned. (I cannot comment on how its sound quality compared in the store with that of other sets, as I only looked at the picture.)The menu is easy to use and includes all the features you could expect, including fully adjustable backlight in addition to surround, noise filter, color temperature, parental lock, auto off, timers, etc, with the one notable exception of a memory function that allows the user to store 2 different picture settings -- one for HD and near-HD, and another for standard definition. With the former, sharpness can be increased so much it starts to make standard satellite images look fuzzy. Therefore, the lack of such a memory can potentially be an inconvenience. In an attempt to negate the problem, I made sure the DVD player I bought had its own picture controls. I believe that after lowering the sharpness on the TV to a modest level and increasing sharpness on the DVD player, I should be able to achieve excellent results for both sources without having to constantly make adjustments, assuming that when I upgrade to HD satellite, the receiver will be able to store 2 settings.The back is nicely laid out (unlike my sister's Olevia) and offers 2 HDMI inputs, 2 s-video, 1 component, a \"front\" input concealed in a recessed area on the right side, and, for those who might use it, an optical audio out.The remote, while large, fits nicely in one's hand and is nicely designed.In short, if you can compensate for the lack of dual picture setting memory, this TV is for you!UPDATE: Correction! This TV DOES have a memory feature for picture controls; I simply missed it. In the PICTURE section of the menu there are several \"quick\" picture settings (vivid, cinema, etc.) and what I did not realize before is that all the picture controls can be adjusted separately for EACH of these \"modes\". Just make sure you set each one while tuned to the input with which you want to use those particular settings and the TV will store them. For example, I'm using the VIVID mode for HD signals and CINEMA for standard signals.Some people have complained that this TV does not display standard content well. They apparently haven't spent a few minutes fine tuning the set. Yes, if you adjust VIVID for HD signals by raising brightness, sharpness, and color to levels you never dared use before and then try to watch regular cable or satellite without changing the picture, the quality will be lacking. But if you select another mode like CINEMA or STANDARD and in it reduce sharpness, brightness, and color down to a moderate level, you will quickly see that there is no problem. I tried both standard satellite and even a VHS tape, and believe me, it's fine!Finally, it should be noted that this set can also display 1080i. Perhaps all 720p sets do, but if you are new to HD (like me) then you may not be aware of it.Enjoy! It's a great product.", "Date": "December 28, 2007"}, {"Title": "The Latest Panasonic 32\" LCD", "Author": "William Angelo", "ReviewID": "R2R4F0OA12JPEN", "Overall": "4.0", "Content": "Overall this is a solid, attractive, easy to use system. Please be aware that their is only one Component input connection. This should not matter if you have HDMI accessories. Sound system is OK, not spectacular and not terrible. This is not the Greatest LCD, but a rock solid performer with a Great Price!!!!!", "Date": "August 3, 2007"}, {"Title": "Purchased and pleased", "Author": "Margaret Hutton", "ReviewID": "R3K90JHR4V0MKF", "Overall": "5.0", "Content": "I am very happy with my Panasonic LCD Flat Panel HDTV.  The picture is very clear and the size is perfect for my room.  I was very happy with the ordering and delivery process and would do it again.", "Date": "August 28, 2007"}, {"Title": "Excellent buy for its price", "Author": "K. Vuppamandla \"sparklingsri\"", "ReviewID": "R20XZRUOLDIPTI", "Overall": "5.0", "Content": "I bought it a couple of months back and till now I am quite impressed with both its crisp picture and magnificent sound quality. Thoroughly enjoyed watching world series on this TV! Great buy for its price!", "Date": "November 24, 2007"}, {"Title": "Very pleased with this product", "Author": "James Douglas", "ReviewID": "R1WPROQKP418HQ", "Overall": "5.0", "Content": "After diligent research for suitable television, so far this has been a positive outcome from start to setup.", "Date": "October 31, 2007"}, {"Title": "Good Picture, Sound problems before 30 days", "Author": "Lynn W.", "ReviewID": "R33NSOYUI1JWOQ", "Overall": "3.0", "Content": "I love the picture on this TV. I had it less than 30 days though and I now have a sound problem. There is a vibration type of sound with the bass sounds.  Either a man's deep voice, gun going off, traffic, whatever has a deeper bass sound, has static/vibration. I bought it here from Amazon through 6 Avenue Electronics.  I sent them an email but they never answered me so I just called them today.Update: I now have a problem with the TV when I try to power it up.  About every other time, I have to unplug it or power off the power strip to get it to power up.  IT just clicks with the red light on the lower left.", "Date": "October 15, 2007"}, {"Title": "A Wonderful LCD TV for a Great Price", "Author": "Leslie Schauble \"Andy Schauble(Son)\"", "ReviewID": "R35GJMQBSX3BK", "Overall": "5.0", "Content": "Before purchasing this television, I had already bought a twenty-six inch Sony Bravia. I was content with the tv but there was something significant that was lacking in this particular tv: It was a little too small.I was on Amazon and noticed another tv in the suggestion box. It was this Panasonic set, that was bigger and wore a price that that was fair enough for a thirty-two inch LCD television. I ordered it, opened it, and mounted it. The picture quality is even better than the Sony, and those six inches of difference are quite noticeable. I strongly recommend this tv for a bedroom or a workout room because it is big enough to actually display the LCD picture quality that you're paying for.", "Date": "January 2, 2008"}, {"Title": "Nearly two years from purchase...", "Author": "Stargzn", "ReviewID": "R1WXHJ0S6DBZMJ", "Overall": "3.0", "Content": "I absolutely adore this tv - in sound quality, sharp and crisp picture (even without HD) and for it's perfectly easy programming and changing of settings BUT....I am having a HUGE problem.  The off-on button on the top is rarely used, because I start this tv by my remote 98% of the time.  In the past month, using the remote for on/off has been sketchy at best. When it ceases to work (yes, I've changed it's batteries!) I have to resort to unplugging the unit to reset the brains inside.  And, now, even that is not resetting every time.  I've tried turning it on by manually pressing the button but it doesn't 'click' on and is totally useless.  Repeatedly, I unplug and try the remote over and over again, and sometimes it will then connect. I am afraid I'm looking at a very expensive repair for something which should have lasted for years (the picture is reportedly good for 60 years. Won't do me a darn bit of good if the unit won't turn on!!!!) Of course, I didn't buy the extra warranty. Geez. Anyone else have this problem? If so, what's the solution?  Thanks.  I don't want to tell anyone not to get this great tv, but ya gotta wonder about these cheap parts. It's a crime.", "Date": "December 17, 2009"}, {"Title": "Panasonic Great Value", "Author": "Allen Mudgett", "ReviewID": "R2565762TJLJVR", "Overall": "5.0", "Content": "It's all about value and as usual Panasonic delivers. Easy user interface makes our entry into HD a breeze. We've had the tv for about a month and we are pleased.", "Date": "January 28, 2008"}, {"Title": "Bang!!! for your buck.", "Author": "Marco A. Porrello \"Masta_Fro\"", "ReviewID": "RUANMLO0PUMPY", "Overall": "5.0", "Content": "This TV has a great 7000:1 contrast ratio, 2 HDMI ports and 4 composite ports. Couple of s-video and optical audio ports too. After setting it up and connecting my ps3 to it i realized it also accepts 1080p signals and displays them as such. Im not sure if it's true 1080p, but it does look beautiful and better than the 720p configuration (noticeable only from 3 feet or closer) so i think it is. Great for watching blu-ray movies. Sound is better than average for an LCD tv. Really great price for a very good top of the line 720p native (although 1080p capable) LCD TV.By the way...any TV below 32\" will not show a difference between 720p and 1080p. Even though the pixel count is more than double 0n 1080p displays, the human eye simply doesn't detect these differences beyond 3 feet away from the screen. So unless your going to use it as a computer monitor, stick with 720p for 32\" and under. Take it from me, the term \"future proof\" is overrated.", "Date": "August 12, 2007"}, {"Title": "Panasonic review", "Author": "Richard H. Neve", "ReviewID": "R1U3KF989GI07G", "Overall": "3.0", "Content": "Good quality at a good price.. However, my Samsung has a slightly better picture.  Would recommend as a second TV.", "Date": "October 8, 2007"}, {"Title": "Panasonic 32\" LCD TV", "Author": "Michael E. Woods", "ReviewID": "R1IZT8V60Z6MRD", "Overall": "5.0", "Content": "I bought the Panasonic 32\" LCD TV from Amazon.com and the price was right, the delivery was fast and the product arrived in great shape. I had no trouble setting the unit up and the color was great. The sound is great and no troubles have come about. It was good to work with Amazon and so I give this TV two big tumbs up in quality and performance (well worth the purchase). I especially like how light these LCD TV's are compared to my old Sony Analog TV which felt like a ton.", "Date": "February 22, 2008"}, {"Title": "Great buy!", "Author": "S. Peterson", "ReviewID": "RKRDX3HJIBYJH", "Overall": "5.0", "Content": "We love our TV. The HDTV picture is amazingly clear. We don't subscribe to HDTV programming, but the shows that are not broadcast in HDTV still display clearer than our other TV. I am very satisfied with this purchase.", "Date": "January 24, 2008"}, {"Title": "Panasonic LCD HDTV 32\"", "Author": "R. M. Sycor \"Sycor\"", "ReviewID": "R3QGO1X5U228WC", "Overall": "5.0", "Content": "The Panasonic HDTV was so easy to set up and I was amazed at the picture quality, I ordered the TV on Amazon from Electronics Expo on 12/13/07 and had it in my home on 12/17/07, talk about fast and the price was right too.", "Date": "January 13, 2008"}, {"Title": "Great buy, Great set", "Author": "Rob NY \"NY-Bob\"", "ReviewID": "R1GFFMZ1RU1DT4", "Overall": "5.0", "Content": "I have had this set for almost a month now. It has almost all the features I wanted, except a PC input. The picture quality amazes me every day. Even non HD channels look great. I have it connected to a Time-Warner HD DVR box. Also a Samsung DVD player with 1080i up-scaler using an HDMI cable [also purchased from Amazon].Another positive note Time-Warner remote also has aspect ratio control button.All in all a terrific set would buy again. On a side note Amazon's free delivery was a big plus; they did call to schedule the delivery.", "Date": "January 9, 2008"}, {"Title": "Firmware update is available to fix the Power On/blinking red light issue", "Author": "Computer Tech", "ReviewID": "R2FOLMO79N6CNK", "Overall": "5.0", "Content": "This is a fantastic LCD TV.  Unfortunately it would occasionally refuse to turn on and get a blinking red light.  Then I had to manually turn it off,  and then turn it back on with the button on top of the TV.There is a firmware update that will fix this problem.  You simply download a file and put it on an SD card and install the update to fix the problem.  (You can use a micro SD card if you have an SD card adapter.)Search for TC32LX70 firmware update.  There is a link for the directions and also a link to the actual firmware upgrade on the Panasonic site.If you are not tech savvy, Panasonic will even send you an SD card with the firmware update for around 7 or 8 dollars.Panasonic is great for quality products and has been great whenever I needed support.I hope this helps you to enjoy your Panasonic TV for many years to come!", "Date": "January 12, 2014"}, {"Title": "Panasonic 32\" TV", "Author": "D. Larson", "ReviewID": "R32P599VZFQTTF", "Overall": "5.0", "Content": "This is a great television.  The sound is good and most importantly, you can view the screen from wide angles and the picture remains clear.  Very few other LCD TVs offer this plus.", "Date": "February 5, 2009"}, {"Title": "Don't Sleep On This HDTV", "Author": "Lakisha F. Treherne", "ReviewID": "R1GE0W08CX6Q4", "Overall": "5.0", "Content": "This is a great T.V. Everybody looks at Sony, Samsung, Toshiba, but Panaonic Is the Leader in Plasma, and there on the upcoming of being the leader of LCDS too. Well thats just my opinion, but they are the leader of plasma televisions.", "Date": "April 23, 2008"}, {"Title": "Excellent for playing!!", "Author": "David Jimenez \"dj max\"", "ReviewID": "R1NW2UXASZGLBY", "Overall": "4.0", "Content": "I got this Tv, with my ps3, an it looks great, it preform, better than my friend's samsung plasma, and look at this price is awesome, i really recomend it!!", "Date": "April 5, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "1366 x 768\n178 Degree viewing angle for maximum color and clarity\nNormal, Zoom, Full, and Just modes to meet any broadcast needs", "Name": "Panasonic TC-32LX70 32-Inch 720p LCD Flat Panel HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51RbUdDEubL._SX300_.jpg", "ProductID": "B000OOG3KI"}}