{"Reviews": [{"Title": "Wow ! A very impressive HDTV", "Author": "R. Kauffmann", "ReviewID": "R1DD7O9JD2ZPFH", "Overall": "5.0", "Content": "This is my second big screen HDTV . I am very impressed with it's features and the quality of the HD picture, it's just an overall fine product for the money. I have not had any problems with this set , I did spend the extra $200. for a two year extended warrenty for peace of mind as I did have one problem with my first big screen HDTV after one year,when the HD tuner went out and I was quoted over $500. to have it repaired BUT I did not pay a single penny because I bought the extended warrenty and that covered all cost. What I am getting at here is DO NOT BUY a big screen HDTV without purchasing the extended warrenty no matter what brand of TV. One last thing always do your homework first and know that replacement parts can be available should you have a problem.Oh yes the projector bulb for this HDTV will last longer then 1000 hours, I already have over 2000 hours with no problems. JVC HDTV's are  fine products that you can rely on.", "Date": "November 28, 2006"}, {"Title": "I SHOULD'VE GOT A SONY!", "Author": "R. Slomkowski", "ReviewID": "R2DSRWSD1BAHQ3", "Overall": "1.0", "Content": "The JVC line of HD-ILA televisions utilize a 110 watt mercury bulb, #TS-CL110U, that apparently, as I just found out, has a short life, around 1000 hours (Bulb life info received from internet forums with owners experiencing the same problem and is not mentioned in the JVC user guide). This \"consumable, user replaceable\" bulb cost $200.00 from JVC and takes about 2-3 weeks before a replacement arrives.I purchased the 70\" version of this TV 4 months ago, Nov 27, and after averaging 8.5 hours a day of viewing, the bulb blew out. At $200.00 a pop, I will be spending $600.00 a year for the life of the TV.  Depending on one's viewing habits, the cost could be more, or less. I find it hard to believe that JVC could not engineer a bulb that has a longer life. As far as I'm concerned this is just another money making slap in the face to us consumers. My father has and is watching my old 1987 46\" NEC rear projction TV which still works fine. Got that JVC!?For a 70\" projection TV, the HD-ILA has a very good picture and relatively slim profile and weight. Also, the price is attractive, that is, until you add the cost of the bulb replacement over the life of the TV. If your wallet had testicles, the people at JVC would be more than eager to kick them for you. For this painful, money draining reason, I can only rate this TV one star.Waiting for my replacement bulb and seeing my wallet keel over in pain, I wish I would have spent my money on a SONY widescreen. They cost more, but I've heard they are worth it.", "Date": "April 10, 2006"}, {"Title": "Top of the line circa 2005", "Author": "D. C. Gartner", "ReviewID": "R2IJOXTIBX1OZM", "Overall": "4.0", "Content": "I've had this television for about two years now. When I purchased it they were around five thousand dollars. I've seen them for sale now for about three thousand recently. I think this is owing to the television being only 780p, versus 1080i or 1080p. Unless you are planning on viewing a lot of blu-ray or hd dvd's, be aware that even the best signal from a dvd or satelitte, won't get you to 1080i. This being said the television is terrific in bright light, which is why I purchased it in the first place. The combination of an extremely bright picture and an anti-reflective coating on the screen means you can watch the screen even with direct sunlight on the screen. The one issue I had with the JVC, is the first bulb burned out at six months. I had purchased an extended warranty, so I was covered. The tech came out and changed it in about five minutes. Since then the second bulb has been going  for about a year and a half. At two hundred a pop, I would seriously recommend getting the warranty. Other than that, awesome TV, your visitors will be shocked at the sheer enormity of the screen. 4 times the screen size of a 42\" plasma, think about it...", "Date": "August 27, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "D-ILA - JVC's exclusive three color (1280 x 720) chip technology provides a superior image\n16:9 Widescreen Aspect Ratio\nD.I.S.T. 720p(Digital Image Scaling Technology)\nNatural Progressive Line Doubling\nHD EZ Fill (Cinema Zoom and HD Panorama)", "Name": "70\" Widescreen Tv HD-ila", "ImgURL": "http://ecx.images-amazon.com/images/I/41DRWGYA01L.jpg", "ProductID": "B0009EU2UU"}}