{"Reviews": [{"Title": "Absolutely Amazing", "Author": "Jeff True", "ReviewID": "R3920746RSUIYT", "Overall": "5.0", "Content": "This is the best TV on the market!  Consumer Reports ranks it number one again this year (500U last year).  Please turn the settings down out of the box though.  Panasonic puts the TV in the horrid \"Vivid\" mode which makes you feel like you got ripped off, but once you turn down the settings the TV couldn't look any better.  The sound quality is excellent for non-auxillary sound.  CableCard, PIP, VGA input, better sound and much nicer bezel than the 60U were the reasons I chose this one over the 60U.", "Date": "October 27, 2006"}, {"Title": "Wonderful picture, feature set, sound, I love it!", "Author": "Pocofan \"pocofan\"", "ReviewID": "R1MC30O58W77I5", "Overall": "5.0", "Content": "This is my first plasma TV and I love it.  We bought this to put the icing on the cake after having remodeled our complete house.  The TV sounds great, and looks great.  HDTV is stunning!  I am very pleased with my purchase and would recommend this TV to anyone.", "Date": "December 24, 2006"}, {"Title": "GREAT PICTURE, BUT FEW ADDED FEATURES", "Author": "C. Yu", "ReviewID": "R28M9E0492FU3I", "Overall": "4.0", "Content": "First off as a background, I view HD programs on this TV from a FIOS subscription. I also watch blu-ray movies and play games using PS3.It has only been 10 months and the price of this TV (TH-50PX600U) has dropped to more than half. I purchased mine from BB for $3,200++ on September last year with 36 months, 0% financing . Back then, this was Panasonic's top of the line for their 50-inch models and it was available only at the Magnolia Home Theater section (BB had the 60U, which was $500 less). 1080p models available then were limited and the price was too steep. The price points between the 720p and 1080p made me decide to go for this TV.The good thing with shopping around first and looking at the floor models before making a purchase is that you can personally view the different manufacturer models' side by side so you can clearly discern the difference between them.PROS:- better picture clarity and vividness- comparable to picture quality with the pioneer elite (arguably the best plasmas but the price difference is not justifiable to me).- blacker blacksCONS:- Aesthetically, this TV was on the losing end because all the competition had the elegant pure black front side (panasonic has since then followed suit).- does not have PIP feature when using HDMI- PIP has only one mode (split sreen)- when viewing pictures, you cannot resize or zoom in- has different aspect ratio views but you cannot resize/stretch each setting (I have a toshiba HD TV and it has that feature)Overall, I rate this TV 4 stars because of the cons stated above. Would I recommend to buy this 720p model now that there are 1080p? You have to consider a number of factors. The obvious reasons would be the price point and the screen size.For a 50\" screen is it worth getting a 1080p? I don't think so. The eye can only distinguish or resolve individual pixels at a certain TV viewing distance. Increasing the resolution at this distance will not make any difference unless the viewer goes closer or the TV is enlarged.If you have DVD collections like myself, will there be a difference viewing them on a 720p or a 1080p display? DVDs have 480p resolution. No matter what they say about upscaling of 480p to either 720p or 1080p, it is still 480P and there is really no difference.As regards the technology, there are no 1080p programs at the moment and most HD transmissions are either in 1080i or 720p. Both 1080p and 720p are capable of 1080i image conversions. Which is better in converting 1080i? Well, I only have 720p HD TVs so I cannot make a comparison. For 720p, definitely the 720p will be better as this is it's native resolution and unlike 1080p, no image scaling is required.There is no question that 1080p will eventually be the choice as it is inevitable, but is it worth now to spend twice the cost of a 720p TV or roughly coughing up $1500 more? If you are getting a 50\" TV with a limited budget, then NO. But if you can get the same financing that I got from BB, then GO FOR IT and get a 60\" or a bigger TV.", "Date": "July 14, 2007"}, {"Title": "Great Gift for Dad by Dad", "Author": "Woozer", "ReviewID": "R19623B3ZG5QYC", "Overall": "4.0", "Content": "Just got this 50\" Panny on Father's Day.  It was a terrific Father's Day gift to myself.  I was torn between this 1080i plasma and the new 1080p, but the new models cost twice as much and there is no 1080p programming, unless you have a blue ray or HD dvd player.  Some say go with 1080p to future proof your tv.  However, since the major network just spent millions buying 720p/1080i cameras, I'm doubtful 1080p will appear soon.  I'm in the process of ordering HD cable, so I can't attest to the quality of the HD picture yet.  However, SD and dvd are great so HD should be too.  It does reflect unwanted images in bright light, but this isn't a problem for me because I usually watch tv when it's dark.  (That's why it gets 4 stars.)  For the price, it's hard to go wrong with this tv.", "Date": "June 21, 2007"}, {"Title": "600U is superb", "Author": "J. Dodge", "ReviewID": "RQHSAAYISSGID", "Overall": "5.0", "Content": "I have hardly any criticisms of this set. The picture is brilliant and makes watching Planet Earth on Discovery HD a pleasure. If fact, I would not watch this show were it not for the 600U. It was very easy to set up and my Samsung DLP rear projection which I moved upstairs can't touch it. The 600U is a great TV...", "Date": "April 2, 2007"}, {"Title": "Panasonic TH-50PX600U 50\" Plasma HDTV", "Author": "JB", "ReviewID": "R2MTFPIU0W95K5", "Overall": "5.0", "Content": "This TV was delivered right on schedule with no problems. Installation was very easy with enough connection options to suit most any application. The default image settings are not ideal, but are simple to change through the straight forward easy to use menus. Once properly calibrated the picture quality is excellent.", "Date": "June 2, 2007"}, {"Title": "After exhaustive study...Panasonic TH-50PX600U wins handsdown", "Author": "R. Johnson \"Reyn Johnson\"", "ReviewID": "RSPZV7CYDBICF", "Overall": "5.0", "Content": "Clearest and brightest high-def image of all the plasma sets available. Discovery HD is awesome on this set. If you are in the market for a 50\" plasma TV, and you are not looking at Panansonic, then you are probably making a mistake.", "Date": "March 5, 2007"}, {"Title": "Served for 4 years then died", "Author": "Juls of Antelope", "ReviewID": "R1XNVE9IYNAEMI", "Overall": "5.0", "Content": "I'm leaving this review just for reference only for whoever's needing performance history on this brand name & model.I bought this TV from local brick and mortar store four years ago.  It had the most absolute beautiful picture for many years until it died.  It's picture quality kept up with the newer technology including the higher end LED TV's 5 years newer.  I wouldn't have upgraded had it not started giving me power issues.  It now turns itself off after 5 minutes of being on then won't turn back on until a day or two.I was told it's the power supply board but the power supply board is almost half the price of newer TV's so I decided to just upgrade.I compared the picture quality of this TV to my much newer LED TV by LG model 55LE5400.  Played them side by side.  The panasonic blows the LG out of the water in picture quality.  The black level of this panasonic is just beautiful because they are truly black color and not just dark grey like on my LED TV.Overall the TV was worth the money because it served me for 4 years.  Back then the life expectancy for TVs were only up to 6 years.  I guess the TV didn't reach the maximum because it was abused all through out its life including being plugged in directly to the wall since the day it was bought.  It was moved multiple times.  When I lost the OEM power cable during move, I used a similar cable but didn't have the \"power noise\" magnet on it.  And brightness were always on full blast.", "Date": "October 20, 2011"}, {"Title": "Simply WOW", "Author": "K. Cheng \"kc\"", "ReviewID": "R1GMBW0GTJ72JF", "Overall": "5.0", "Content": "After all the positive reviews, I don't think I need to persuade you into get this visually-stunning plasma tv.  This is by far the BEST HDTV. EVER. Bar none.I have done serious, extensive research before finally taking my chances in ordering the unit.  I wanted an impressive HDTV that could last for over a long haul.  Believe me you: the HD-quality is amazing.  Watching DVD/Blu-ray movies is just unbelievably awe-inspiring.  You simply cannot believe your eyes.My only regret? I probably should have purchased a larger version of the same line.  For me, the set was not as big as I have come to expect.  But 50\" is indeed huge for an average household.Other than that, I made a great decision.  Decently priced, I think you should stop reading: go ahead and get it!", "Date": "August 14, 2007"}, {"Title": "Panasonic TH50PX600U Still the Best There Is!", "Author": "OldSchool", "ReviewID": "R3RB10QYDUN6RA", "Overall": "5.0", "Content": "I purchased this Panasonic TH50PX600U from TigerDirect.com back in 2007 for $1399.00 on sale. We brought it home, took it out of the box, hooked up the DirecTv HDDVR,( here comes the most important part ), reset the color settings that it was shipped from the factory with, ( google it and you will find the url for the best video settings for this set ), and away we went. Here we are 6 years later and this television, even without all the options that the newer televisions have still has the absolute best picture of any we have seen since! We still get comments from guests who have new Samsungs, Toshibas, and Sony flatpanel televisions and they marvel at the picture quality of our Panny! We just laugh and tell them they should have bought a PANASONIC! We did quite a bit of investigation about Plasma and LCD televisions before we bought this Plasma and once we decided to go with a Plasma ( LCD could not produce the blacks needed for a good color separation ) we then started looking at brands and above all people who have actually owned them. Our research basically led us to the Panasonic TH50PX600U. It was getting the best reviews overall than much higher priced models from other brands. So here we are still watching what some have called the best picture they have ever seen from a flatscreen tv. To us that's the best review one can give.If and when we do need another it will be a PANASONIC!", "Date": "March 26, 2012"}, {"Title": "Panasonic TH-50PX600U 50\" Plasma HDTV", "Author": "Jim G", "ReviewID": "R5IDTQA7R02MK", "Overall": "4.0", "Content": "The picture and sound are outstanding. The cable card does not work, after three attempts by my cable company and a firmware update sent from the company Panasonic has established a case # for me and will arrange for a repair person to come to my home. It will not display ABC or CBS in high definition. Interestingly enough the new plasmas will not have cable cards. Also the IR blaster is cumbersome at best. The on screen TV Guide is supposed to tell my DVD/VCR recorder to record a program. To do this I have to connect with analog cables, turn off the sound, and have the tv on. This means I cannot watch (hear) another program while recording, what's with that? Too bad for me that two weeks after my purchase the price dropped $300. The new models came out just after my purchase.", "Date": "April 6, 2007"}, {"Title": "Amazing HD Picture", "Author": "V. Lau", "ReviewID": "R1GBDOTZWZWFZ9", "Overall": "5.0", "Content": "I am so glad that I paid the extra $200 to get the 600U.  It has PIP that the 60U doesn't have.I am able to receive some HD channels through the regular cable.  I am considering getting the HD package because the picture of the HD channels are truly amazing.  You don't feel like watching the regular channels after watching the HD channels.", "Date": "March 7, 2007"}, {"Title": "Best for the money", "Author": "W. SCHAPER", "ReviewID": "R2WTM8K0UEXZNM", "Overall": "5.0", "Content": "I bought this HDTV in late June 2007. I have absolutely no regrets. People can talk 1080p all they want unless you have HDDVD or bluray there is nothing out there. There isn't even that much HDTV on cable or direct tv yet. This set has great sound, if you don't have a home theater system with this TV you won't need one the sound is that good. The picture is out of this world! What you can get on cable in hi def will make it so you won't even want to watch regular tv again. Six months in and I have no complaints everything works as stated by panasonic. The sd card option is great, it makes your photos look BIG with no loss in quality, as a matter of fact they look better! I hooked up an inexpensive upconvert DVD player and my old DVD's look better than ever. This month I purchased an Onkyo HT-S894 HTIB Onkyo HTS894 5.1 Channel Complete Home Theater System w/ Single Disc DVDand now my livingroom is like a movie theater. The effect of sound and vision is out of this world I could not be happier! All of my family and friends love it. Well that about says it all, if you are considering this TV and can still find it get it now you will never regret the purchase. The newer model Panasonics which are more expensive are not as good as this model.", "Date": "December 9, 2007"}, {"Title": "TH50Px600U Panasonic Plasma", "Author": "Klee", "ReviewID": "R30U7P026C8ONF", "Overall": "5.0", "Content": "Shipping 4 days late;however, in perfect condition. Set-up easy, great picture right out of the box. 720P picture is very good, maybe the 1080P would be better; however, for the money difference, I feel the 720P is the better buy at the present time.  Maybe in time, of course the 1080P,  would be a better way to go. Sound quality on this TV is great!  Overall, I think this is a high quality TV and you can't go wrong on this particular model.", "Date": "November 25, 2007"}, {"Title": "Best of the best for picture sound & value", "Author": "Mohammed J. Hossain", "ReviewID": "R387R4NW2LDD70", "Overall": "5.0", "Content": "I buy this tv by amazon just over $1500.But when i on the tv i was stant about the picture clarity & sound.For a medium size room you don,t need any home theater system.Some reviewer say that it makes lots of heat but i don,t think so.Whenever i touch the tv or try to feel it ,it alweys feels me very cold.More then a year of research finaly i decide to get it.First i think to get sumsung-5064. But some reviewrer say that its picture is good but its sound like a comes inside from the barrel.So i think if i buy this tv i have to spend more $500 for sound system.Its sound is great and great picture also $300 less then sumsung5064.  So this is the best TV for picture sound & value.", "Date": "October 20, 2007"}, {"Title": "Awesome T.V.!!!", "Author": "V. Smith", "ReviewID": "R2MHQ2BKJYLX2B", "Overall": "5.0", "Content": "I purchased this plasma 10/05/07 and I love it!!! It has plenty of inputs for all of my components, couple it with a home theater or strong HTIB and it will blow you away. Be sure to buy a good Hdmi cable and surge protector and you are good to go. Make sure that you have some help with assembly because the tv is HEAVY.", "Date": "October 18, 2007"}, {"Title": "Perfect Plasma", "Author": "Daniel J. Muder \"pyrofighter&lighter;\"", "ReviewID": "R27DH5BUMKHSPY", "Overall": "5.0", "Content": "Beware of the \" Box Store \"is all I can say. You literally can save five to seven hundred dollars buying this model online. No tax when buying online. Usually free shipping also.I reviewed scores of makes and models of plasma,DLP's,and Lcd out there and the Panasonic TH-50PX600U 50\" was the right one for me. If you want a plasma go with this Panny. Great HD picture. I was amazed and the standard definition at 480i. We hooked the Play Station 3 up to it via HDMI and watched 480 p dvd's (The Departed) up converted to 1080p They looked every bit as good as Blu-Ray disc (X Men). Lots a features and easy to use onscreen guide.", "Date": "August 29, 2007"}, {"Title": "For the price, it's unbeatable.", "Author": "R. Behrens", "ReviewID": "R2P6FDAVGXTTDD", "Overall": "5.0", "Content": "Bought this TV in August of 2007 and paid just over $1500 including shipping. Couldn't be more pleased with my purchase. HD channels look amazing and even SD looks much better than I expected. Sounds system is more than adequate, number of inputs gives you plenty of options. Panasonic makes one of the best plasmas on the market, and at the reduced price, you can't beat the value of this TV.Don't bother getting a 1080p unless you have something to use it for(only bluray, hd dvd and ps3 broadcast the signal). Go with this Panasonic 720p and be pleased for years to come.", "Date": "August 27, 2007"}, {"Title": "Superb Digital Plasma", "Author": "Mr. Mario Contreras", "ReviewID": "R1G6HOO1UYQCZK", "Overall": "5.0", "Content": "Bought the Panasonic 50\" = 9th Generation Plasma on June 23rd, and Boy was I Happy to make the Best investment in any tv I have bought. Chose the Plasma over the LCD because of brightness and could have been any happier. The thing is a work of art. I am 53 and the TV should last for at least 28 years. I will be 81 before I need another. Easy to set up but requires an extra Person or two. I was lucky to have to friend over that day. My only regret is that I didnt purchase this unit in April so that I could watch my Spurs win their 4th Title but the Dallas Cowboys should be up and running in 6 weeks. Bought it from TigerDiret in Florida through Amazon and Saved 900.00. Thanks Amazon.", "Date": "July 24, 2007"}, {"Title": "Excellent Value", "Author": "G. Mow \"Chairman\"", "ReviewID": "R3U335EWP5DOK0", "Overall": "5.0", "Content": "I've been shopping for an HD TV for a long time.  I've been eyeing the Panasonic TH-50PX600U because of all the great reviews and the great price.  The price was a shade under $1,900 when I started looking but I bought it for less than $1,600.  The 50 inch size makes programing content and signal picture quality less forgiving, but wow.  If there is a flaw in the quality, this size is going to magnify it.  So you might want to consider this when you decide on the 50 inch size.  That was my only hesistation when I first hooked it up.  But with the right content material and cables, magnificent.  The colors are vivid and awsome.  We are loving it.", "Date": "July 21, 2007"}, {"Title": "Satisfaction out of the box.", "Author": "Sharon L. Moore", "ReviewID": "R1HZT1XIUUM1KU", "Overall": "5.0", "Content": "From order to delivery was 5 days. They took it off truck, placed it in Living Room , deboxed it and left. Husband and I hooked up wiring along with base and have been happy since.Soon We will get HD from Directv and they say it will be even better. Right now We are extremely satisfied with our purchase. The sound is great and watching our trip pictures on a 50' TV is awesome.", "Date": "July 4, 2007"}, {"Title": "THE BEST OF THE BEST", "Author": "M. Allen", "ReviewID": "R2U7UZB0FMKRKI", "Overall": "5.0", "Content": "THIS IS IT........PERFECTIONTHIS IS MY THIRD PANASONIC PLASMALAST YEARS-42\" & 50\", AND THIS YEARS 50\" MODEL 50PX600URIGHT OUT OF THE BOX YOU'RE IN HEAVENLOOK NO FURTHER.THE BEST IN PICTURE AND SOUND", "Date": "January 14, 2007"}, {"Title": "Excellect Product", "Author": "Wenhan L. Tsai \"William\"", "ReviewID": "R25WMHMIZ14EUX", "Overall": "5.0", "Content": "We purchased this big time through Vann's and we held our breath since it was the first time we had business with Vann's. Vann's delivered, nicely on every step of the way.In terms of the Panasonic Plama, it has been excellent but we knew it was best in this category anyway.", "Date": "May 7, 2007"}, {"Title": "Good TV", "Author": "John", "ReviewID": "R2E0W25TKA8CX4", "Overall": "4.0", "Content": "This is a good 720p TV for a good price. However, I found the black levels could be a little better. It also gives off a lot of heat.I have a Sumsung 1080P and when hooked up to my Toshiba HD-A20 1080p DVD player produces a better picture than this TV.", "Date": "July 1, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "50 inch screen\nProgressive Scan\nWidescreen 16 - 9 aspect ratio\nUp to 3000 - 1 contrast ratio\nNative Resolution - 1366x768", "Name": "Panasonic TH-50PX600U 50\" Plasma HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51ZN1VGKF9L._SX300_.jpg", "ProductID": "B000GASM4K"}}