{"Reviews": [{"Title": "This is the best!  Forget the rest!", "Author": "Darrell Burns", "ReviewID": "R2MZZEXU0CD13S", "Overall": "5.0", "Content": "I have done extensive research, testing and fiddleling on flat panels tv's.  And I just have to tell you.  You will not find a better display anywhere on this planet for sell right now(2-01-2006)!  The Panasonic TH 50PHD8UK 50 commercial model is far superior to any other plasma display and non plasma displays, like DLP and others!  Even the Panasonic consumer models are no match for this beast! The commercial models are built for precision viewing and durability !  You will never see a consumer model in a news room or government agency!  If anyone tell you that the commercial and consumer models are the same,  They're wrong!  Do your own research!  I purchased my plasma from 1800plasmas.com.  They are very professional, and will give you a sweet price to boot!  Make sure your Panasonic Plasma come from Japan, AND NO WHERE ELSE! These are my Exceptional picture settings for the commercial model:picture menu  =  standardpicture  =  0brightness  =  -2color  =  -2tint  =  0sharpness  =  2color temp  = normalcolor manage  = offadvance set  = off", "Date": "February 1, 2006"}, {"Title": "Outstanding picture!  Excellent versatility!", "Author": "Farid Khan \"KHAAAAAAAAAAANN!!!\"", "ReviewID": "R2T84VCVRRMRP5", "Overall": "5.0", "Content": "ABOUT WHERE I PURCHASED THE TV FROM:I bought this TV (technically a monitor) from Butterfly Photo.  Although they weren't the cheapest (still got a great price), it was an online store I've bought from in the past and I knew they had a physical location if I needed to get in there face about something.  Turned out to be one of my best shopping experiences which is very comforting for such a large purchase.  They called me the next night after I placed my order to let me know that the TV DOES NOT come with the component video (RGB) connections that is used to connect to my DVD player, cable box, and Xbox.  I thought he was just trying to get me to buy more stuff, but it checked out on Panasonic's website, so got me the component video terminal board for $100 off the cheapest site I could find.  Then they upgraded my warranty and shipping for free!  So, much to my surprise, I had the TV the next day.ABOUT THE TV:I should note that every part of my A/V system (TV, audio receiver, cable box, DVD, and Xbox) is connected and powered through Monster cabling and surge protector.  Since this TV does not have speakers, the only thing I can comment on is the picture...and it is OUTSTANDING!  I've had the TV for a couple of weeks now and used a Panasonic white paper ([...]) as a guide on \"breaking in\" the TV.  In general, how plasma TVs are used in the first 100 hours is critical for the longevity and picture quality, particularly their susceptibility to burn-in.  A lot of retailers say that if you are going to play console games, you should get anything other than a plasma.  This is generally wrong for current generation plasmas, and especially wrong for this TV, Panasonic TH-50PHD8UK 50\" Plasma HDTV, because it has a number of options (e.g. wobbling and screen savers) that can be activated to reduce the already low chance of burn-in to a negligible chance.The space scenes in the Fifth Element looked incredible because the empty space was inky yet the stars still shone clearly and distinctly.  Jet Li's Hero was fantastic!  The color themes in the movie really demonstrated the exceptional color saturation and depth that the TV is capable of, especially the lake scene!  There is no lag or blurring during fast action scenes in movies or on the Xbox.My only complaint is that there are not enough HD channels.  This TV does do a far better job of displaying non-HD (4:3) content without pixelating than other HDTVs I've seen.If you're looking for something wrong with the TV, then you won't find it having to do with anything with the picture quality.  It does not come with speakers, so you'll need the optional speakers or an external home theater system.  It does not have a TV tuner, so you'll need a cable box or the optional terminal board.  It does not come with the consumer component connections (RGB), and I did have to buy that.BOTTOM LINE:I honestly would rather watch movies with this TV (plus my sweet sound system) than going to a theater.  It's that good.", "Date": "April 6, 2006"}, {"Title": "The best plasma for the money", "Author": "G. Clayton", "ReviewID": "R3K64ZO3MN3GVY", "Overall": "5.0", "Content": "I've had experience with several HDTVs and this one is the best especially at this price. This is actually a commercial model TV which is a good thing. You don't have to pay for extra speakers and a tuner you won't use and its a generation ahead of consumer models in display tech.Forget having to tweak the settings all day using a setup DVD to get the best picture, this thing looked amazing out of the box. I barely had to change anything to get a perfect picture. My old Sony HDTV required hours of tweaking to get anywhere near the image quality.I've never seen a better picture than this TV displaying from an HD-DVD. Its simply like you are looking through a window.In regards to the person saying you have to buy an add-on board for 'consumer' component inputs, he is wrong. This TV comes with the component input board and you just have to buy BNC->RCA adaptors to connect up to it. Whoever made him buy a consumer component input board just robbed him of 120 bucks when he could of just bought the BNC adaptors for 5 bucks.However you DO have to buy an HDMI input board if you want HDMI. It is recommended with this set because of this (from Panasonics info page): \"Up to 2,048 shades of gradation (4,096 shades via HDMI or DVI connection)\". I'm not sure why that is.", "Date": "August 11, 2006"}, {"Title": "Compared all this one is the Best!", "Author": "Richard D. Jamison \"RDJamison\"", "ReviewID": "R3J09J96EQU8M7", "Overall": "5.0", "Content": "This plasma is awesome! I compared all the 50\" plasma out there and the picture on the Panasonic is by far superior. The blacks are true black, no green or red haze as on some models. Keep in mind there is no tuner or speakers, but if you cannot get over the air reception or are always going to use cable or satellite and have surround sound, who cares! I recommend purchasing the optional HDMI input card for the ultimate picture. You can't go wrong with this one!!!", "Date": "August 12, 2006"}, {"Title": "extremely pleased", "Author": "Paul Brzezinski", "ReviewID": "R21XTPAA43FYQ8", "Overall": "5.0", "Content": "I'm incredibly pleased with the purchase.  The only thing I wasn't really aware of is how much heat the plasma TV produces.  One quirky thing is that the component video in uses BNC connectors, not RCA-style connectors.  Additionally: this item is too large to ship via UPS, it was shipped via freight.  Getting status information via the web was not possible, but the freight company delivered the HDTV on the earliest estimated delivery date.", "Date": "August 6, 2006"}, {"Title": "Incredible", "Author": "W. Kaye", "ReviewID": "R37D87XDXISCAL", "Overall": "5.0", "Content": "I purchased this model based on the other reviews and haven't regreted my decision at all.  The monitor works perfectly adjusting the picture when the HD locals drop out of the HD format, sports have regained my interest, although now I can see the replays and judge how accurate the NFL refs havethe call (they have a lot of improvement ahead).  For anyone buying a HD TV check out the internet sites as to what to expect from content providers (DBS talk is good for sat.) and for me the best HD is being provided by Dicovery HD channel, simply stunning..", "Date": "October 22, 2006"}, {"Title": "Best image ever", "Author": "George J. Snyder", "ReviewID": "R2MHVTXJWAB3T3", "Overall": "5.0", "Content": "I have had this product for three years, and have never been more pleased with a video display.  The viewing is exceptional even from a considerable angle (as opposed to most other types of display), and the colors are rich and vibrant.  With the replaceable connection modules, you can connect nearly any type of modern video output.  Remember, this is a monitor, not a TV, so you'll want a separate sound system that will match this tremendous viewing experience.", "Date": "January 4, 2013"}, {"Title": "Long term SATISFACTION...!!!", "Author": "Pocketchange \"Pocketchange\"", "ReviewID": "R2MXVR0FKL2UQP", "Overall": "5.0", "Content": "I'd like to understand those of us that have no idea what a monitor is, but so be it.  I've enjoyed my 508UK going on 5 years with no problems, nothing to complain about... period.  Friends invite me over to see there new flat panels and to date, I have yet to see anything that is a better viewing experience.  When I asked Panasonic if they were going to come up with a 1080P driver, they of course, fed me a line of pablum.  If you are interested and have enough spare change, check out the new (07'?)TY-FB9HD driver, I think you will find for $1,200 you can have a 1080P monitor.  But... I'll have to see it first to believe the picture can be much better or worth $1,200 than what's standard viewing on the 8UK.  A friend volunteer to come by and plug his set-up equipment (when I brought mine home) and calibrate it, but after looking at it, smiled and had a drink instead.  Next thing, I go over for a visit and guess what hanging on his wall?  For the money, if you can locate a 8UK, I suggest you pony up and get one.  It puts on a heck of a show.", "Date": "April 10, 2010"}, {"Title": "Shopping for a plasma?  Stop here.", "Author": "L. Ekker \"Guiding Directors through the Visua...", "ReviewID": "RG6VDPY5EF48W", "Overall": "5.0", "Content": "I work in Visual Effects at a top shop.  We have ten \"Flame\" compositing systems, and we use this screen in every suite.  The reason? They are THE BEST.  Period.  End of story.  I am in teh Motion Picture Academy (the \"Oscars\" folks) and so I get movies from the studios to watch before I vote.  This means I need what I call a \"critical viewing\" setup at home.  When the time came two years ago for us to go big and flat at home, the coice of a screen was a no-brainer.  Not only did our Vid Techs choose this after extensive research, but Consumer Reports chose it as the top pic for three years now.  It is great.  I do suggest you tape over the Panasonic logo with black tape to reduce visual distraction.Here's the BEST thing about this screen.  It is a MONITOR, meaning it has no video tuner or audion amplifier.  Most folks feed their TV from a cable or satellite box, so a tuner is unneccessary.  They also often use a home theater audio amp, so the speakers and audio amp in most plasmas (and other types of screens) is a waste.  That means you will eb spending around $1.000 for stuff YOU WILL NEVER USE!  Get a MONITOR, not a television.  Besides the already mentioned quality, and ruggedness, you will save enough to upgrade the rest of the system...  While you're at it, check out the OPPO brand DVD players.  They embarrass players costing 5 times as much and up-res to HiDef BEAUTIFULLY!!!  (for about $150!)Hope you like the screen.  We do!", "Date": "January 12, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000B62NPS"}}