{"Reviews": [{"Title": "Nice TV, even if a bit pricey", "Author": "T-Rev \"V.A. China\"", "ReviewID": "R39RFUSXIUW2LF", "Overall": "5.0", "Content": "Never really concentrated to much on the sony products because of the prices of them.  For the money, you can get a larger sized samsung like a 32\", or for the same size TV you can save big bucks by going with a westinghouse or other bargain priced TV's sized at 26\" which is ideal for a bedroom.  After purchasing a 26\" westinghouse and not being extremely happy I bought a 32\" Vizio.  Still not satisfied, I left the bargain TV basement and took the plunge and bought this TV.  Wow, what a difference.  At $300-$400 dollars more than the westy, I'm not sure if it's that much better if tied to a budget, but if you've got it (cash), get it (sony). As far as specs go, read the description, but rest assured this TV is really nice.  Sound is better than expected for a 26\", menus are nice, picture is B.A.  On XBOX 360, the best and most graphically demanding game is by far Gears of War.  This TV makes it look incredible.  The darks are dark enough in the spooky parts unlike other TVs I've tried out which looked washed out and lame.  This set really makes the whole thing look alot better.  I have been switching between the 3 presets (vivid, cinema, standard) and haven't made any tweaks yet exept for turning on the dynamic lighting.  I'm sure you could make the picture even better with some adjustments but it's unnecessary.", "Date": "July 16, 2007"}, {"Title": "great LCD TV", "Author": "ALKJ", "ReviewID": "R1H6C69FRWTM0M", "Overall": "5.0", "Content": "I am very happy with the sony lcd tv. I narrowed down the 26\" lcd tv's to a couple and checked them out at local stores. I liked the picture of the sony over samsung which was my 2nd choice. plus the sony did not have large speakers on the sides or bottom making it too large for the small opening in my entertainment center. the price was comparable and sony quality has always been good for me.", "Date": "October 3, 2007"}, {"Title": "Owned this for a week now.", "Author": "Oh_Please", "ReviewID": "R1NE0C8P7K0M07", "Overall": "5.0", "Content": "This LCD is great, i was nervous because it is the first flat screen that the wife and I have ever bought. We set it up and it was a breeze, plugged our DVD player in and it also worked great. The picture quality with standard TV is very nice, but the HD picture quality is superb. I had to adjust the picture settings out of the box, but that is to be expected. Over all, I am very, very pleased with this product and Amazon's quick delivery.", "Date": "September 26, 2007"}, {"Title": "Very Nice, Perfect for Bedroom, Minor Issues", "Author": "D. Lerner", "ReviewID": "RTST54GIPKN19", "Overall": "4.0", "Content": "I got this LCD a week ago and LOVE IT. PC Richards lowered their price to $699. So I took their ad to a competitor retailer and they matched it. PCR is still selling it for that price.(Updated this part)It is in my bedroom and connected to basic cable, no box. My cable signal was too weak up there and I could not get the free HD channels. I did not want another cable box due to the expense. So, I bought a Motorla signal booster and connected it into the main splitter inside the house and it solved my problem. I am now getting 7 free HD stations in the bedroom and a much better picture in the rest of the house. I also replaced the coax cable from the wall with some RG6 cable that is better for HD.Dislikes:1. The remote is designed funny. The channel up/down buttons are on the bottom of the remote and are not easy to access for channel surfing. They should have put it in the middle of the remote, IMO.2. The analog picture is OK. A little grainy. Get a box if this is an issue for you. The signal booster helped enough to increase the picture quality to satisfy me.3. The small shiny green (power) light on the bottom center of the TV is slightly annoying. It should have been off to the side of the tv, IMO.Likes:1. HD reception is great. I'm getting 480i, 720p and 1080i from basic cable which the TV converts to 720p and the picture is incredible. I really like watching this TV, esp at night with no lights. WOW!2. I like the matte finish. I never liked that high glossy look due to the glare and dust that black gloss cabinetry brings.3. When hooked up to a Sony upconvert dvd player via HDMI, the picture was impressive.4. The tuner is very strong. It found 35 digital channels including some one HBO channel (which I subscribe to via cable box downstairs).5. The \"Wide Zoom\" option is good for the non-HD channels as it doesn't make the faces too wide. I have set it to auto so I don't have to change it every time I watch a non-HD channel.6. The sound is loud enough for me. No external speakers required. And the Sony S-Force \"simulated surround\" is awesome.7. Quick channel changes via the remote. Maybe 1-2 seconds. Unlike some other LCDs out there that take 3 seconds.8. The Xross Media Bar is the best menu system I have used on a TV.This model was made in 2006 and sold in 2007, so it should be on sale now until the Spring 08 models arrive. Buy it if its around $700-725. I am very glad I bought this TV. It is the best 26 inch LCD out there and I highly recommend it to anyone who is looking for this size TV.", "Date": "January 31, 2008"}, {"Title": "Great LCD", "Author": "Timothy Adams", "ReviewID": "R2RF9Y9DPZ6D79", "Overall": "5.0", "Content": "I replaced a Westinghouse LCD with this Sony. It is outstanding. It cost more but it is worth the expense. You won't be sorry.", "Date": "December 13, 2007"}, {"Title": "Wonderful upgrade", "Author": "G. Ryan \"Gmy\"", "ReviewID": "RGYFTMTDEOH1A", "Overall": "5.0", "Content": "One word.....WOW.  No buyer remorse at all. Colors are vivid and bright. Great purchase.", "Date": "December 13, 2007"}, {"Title": "Good TV", "Author": "KBArch \"BedtimeReader\"", "ReviewID": "R29TOS0WI91227", "Overall": "5.0", "Content": "I bought this Sony Bravia for a furnished apartment that I rent out. It is not hooked up to high def...just regular cable. The tenant has the option of buying a high def box. What's excellent about the TV is its ease of navigation. It has a convenient toggle on the remote that switches between wide and standard screen viewing. I think the non def picture is as good as you can find on a new HDTV, but it is indeed a little \"blurry\" when viewed too close. A Samsung I bought at the same time for a different use (mostly high def) has a slightly worse high def picture than the Sony, although it too is a good TV.", "Date": "September 30, 2007"}, {"Title": "If only Sony was as good as Amazon, J&R; & UPS", "Author": "Barbara J. Wertz", "ReviewID": "RG756824HZ7VD", "Overall": "3.0", "Content": "Before reviewing the product I do want to say that I couldn't have been more pleased with the speedy delivery from Amazon, J&R; Music and Computer World and UPS.  I input my order to Amazon at 11:37 PM on a Wednesday evening and the TV was on my doorstep at 1:30 PM on Friday afternoon, just under 38 hours.  J&R;'s warehouse is about 130 miles from my house so no grass was growing between the toes of Amazon, J&R; or UPS.Unfortunately the speedy service was to no avail since it will be about 2 weeks before I'll be able to enjoy my new TV.  It was defective out of the box.  Best guess is a faulty tuner.  It's now in the capable hands of a local Sony Factory Authorized repair shop.  I know this repair shop is capable because in the past they've repaired another Sony TV and 2 Sony tape decks which were also defective out of the box.Why can't Sony get over this tendency?  We're not talking about cheap junk here.  Sony makes good stuff, once it's been repaired.  I went over to Best Buy and checked out all of the major brands side-by-side.  In fact I went to three Best Buys and a Circuit City just in case some of them were better at tuning a TV than others.  Sony definitely had the best picture in this size TV.  Just be prepared to get in line at the repair shop behind other owners of brand new Sony equipment.", "Date": "September 21, 2007"}, {"Title": "Works well as a computer monitor!", "Author": "Marc Martin", "ReviewID": "RAFKG8AOFTNUK", "Overall": "5.0", "Content": "Am I the only one who thinks the pixel size on typical computer monitors is way too small?  Fortunately, one can buy HDTVs and essentially choose their pixel size, which is what I did with this 26\" Sony Bravia.  With my PC, I can run it at 1360 x 768 pixels, and the Bravia is smart enough not to scale it (\"1:1 pixel mapping\" is what it's called).  In fact, no matter what resolution I send to the Bravia via my computer (600x800, 768x1024), the Bravia shows it unscaled, and this results in a smaller, centered image with black borders.  This applies to both the VGA (PC) input  and also the HDMI (via a DVI adapter) input.Also note that I had previously tried using a 26\" LG HDTV, but the LG had fuzzy/blurry text on both the HDMI and VGA inputs.  Not so with the Sony -- text is razor sharp.  However, I do note that colored text (e.g., blue text on a white background) will sometimes have some artifacts around the edges -- this may be due to the S-PVA panel design... I don't know.  I can live with it, though, especially since there is no problem with black text on a white background.Comparing this to the other TVs in the stores, I noticed that the colors were \"truer\" on the Sony than other sets, presumably due to the wide color gamut backlight.  I did notice however that the Panasonic set had a more pleasing degradation for off-axis viewing -- with the Sony, just a slight change in left/right changed the amount of black detail.  The Panasonic image seemed more consistent with slight viewing angle changes (however, the Panasonic didn't appear to be designed for computer use at all).As for the TV's speakers, well, they seem a bit \"tinny\" -- I'll stick with my computer speakers.Also, one nice feature is that when using the VGA input, the Bravia will automatically go into standby mode if no signal is fed into it, and power back up when a signal is detected.  Unfortunately, this feature does not work when the computer is hooked up via the HDMI input, so one would have to manually turn the TV on or off if you use this input (although I can't really discern any difference in picture quality between the HDMI and VGA inputs, which is good, because with the LG HDTV I tried, the VGA quality was far worse than HDMI).", "Date": "July 25, 2007"}, {"Title": "Function vs. Features", "Author": "R. G. Taylor", "ReviewID": "R1WP79NVE0O9JE", "Overall": "4.0", "Content": "I originally purchased a 26\" Samsung LNT2653H.  I was very satisfied with the picture quality and abundant features that I would later discover are more plentiful than the Sony.  But the deal breaker was the absolutely inferior and inadequate audio production from the Samsung.  At relatively moderate volume levels the sound would frequently distort and cut out.  I also found the Samsung picture to break up on one of the major network's HD broadcasts.  I was compelled to return the Samsung and fortunately found the Sony at an equivalent price.  I received fast and free shipping from both Amazon and Abt for each set (Abt even shipped in a double box).  The return to Amazon was also hassle-free. Thanks Amazon.The Sony and Samsung have nearly identical input ports (Samsung has an additional RF input).  Samsung offers a programmable remote, more picture adjustments, an audio equalizer, and much better menu navigation.  Adding and deleting channels and setting up favorite channels was easily accomplished in one, on-screen channel list.  Favorite channels are stepped through using the remote button. Sony makes you select each individual channel, choose options, then add or delete it from the favorite channel list, and then repeat this sequence for each channel (ugh). Instead of stepping through the favorite channels, the remote button pops up another list that you need to scroll through and select from.  This is somewhat indicative of  many Sony features.The Sony has an equally satisfying HD picture and I found it to display SD sources with better quality than the Samsung.  It also detected many OTA digital channels that the Samsung did not.  Overall, I found Sony has a much stronger tuner combination than Samsung.  And the sound is equally satisfying.  In the 3rd Lord of the Rings feature, the shreek produced by the large flying creatures did not clip or distort, even at fairly high volumes (not even close on the Samsung).  Sony also handles various video formats through the PC port better.I'd love to be able to take the best of both sets and make one `super set' from them, but when it comes down to it, I have to choose the superior Sony function over superior Samsung features.", "Date": "April 2, 2008"}, {"Title": "sony flat screen tv", "Author": "colorado farmer \"colorado farmer\"", "ReviewID": "R3AMQ5TW2CB0KE", "Overall": "5.0", "Content": "I bought this, worrying that it would be so confusing to hook up, I would spend money hiring people to do it.It came with a large \"easy set-up\" sheet ( reminds me of what my Apple computers always come with). I was able to hook it up to a Direct TV/HD set-up myself. It worked right away. Amazing!Also, Amazon got it to me very quickly despite a blizzard and the fact that I live up a dirt road in a canyon in Colorado!", "Date": "December 14, 2007"}, {"Title": "Sony Bravia 26\"", "Author": "Robert B. Reid \"rxray\"", "ReviewID": "R2HW2KL2LVVO7Y", "Overall": "5.0", "Content": "I chose this Item after side by side comparison to Toshiba, Panasconic and Sharp.  It had the best picture and the price on Amazon was $150 less than local prices.  The item was delivered promptly and in good condition.  I have had this item for a month and am extremely satisfied.", "Date": "December 7, 2007"}, {"Title": "awesome set and service", "Author": "Donny207", "ReviewID": "R19LY5E097QIVX", "Overall": "5.0", "Content": "This 26\" Sony is a real joy. The high def productions are terrific. Sports in high def are just amazing. Delivery service could not have been any better. Not having to pay any sales tax is a definite plus.", "Date": "December 12, 2007"}, {"Title": "A GREAT TV!", "Author": "A. Berneathy", "ReviewID": "RPNW8B9TTFQ8C", "Overall": "5.0", "Content": "We have been extremely happy with this TV.  Even without the HD hookup, the picture is great, sharp and color is fantastic.  Can't say enough good about this TV.  Would recommend it highly to anyone.Audrey", "Date": "August 23, 2007"}, {"Title": "Great set for the bedroom", "Author": "C. Dreier", "ReviewID": "R2VLIG3DJ3392V", "Overall": "5.0", "Content": "We were looking for a 26\" LCD to replace the old CRT we had in our bedroom.  After doing a lot of research, I chose the Sony Bravia because quality is important to me.  While a set this size is only able to run 720p, this hasn't been a concern for the way we use it.  Bottom line, if you're looking for a flat screen LCD and can afford the premium, this is the way to go.  By the way, our experience with Amazon/Vanns couldn't have been better.", "Date": "January 13, 2008"}, {"Title": "Predictably great...what else would you expect from Sony?", "Author": "C. Brown", "ReviewID": "R3G5M6CT5178C9", "Overall": "5.0", "Content": "Bought this for my wife for Christmas...great 2nd TV.  We bought a 46\" Sony Bravia in November and have been so impressed with its picture quality and the ease of set up, that I decided to stick with the Bravia line for smaller set.  There is, of course, the cost aspect.  The Bravia line is not cheap, but they are predictably great TV's.  For me, the extra cash (considering it's amortized over several years at least) was worth it.  I've no regrets and wouldn't hesitate to do it again.  Bottom line:  It's a great TV, even if it's a bit pricey.", "Date": "January 12, 2008"}, {"Title": "Overview", "Author": "Dan Ayres", "ReviewID": "R35DMEKLBOEP9K", "Overall": "4.0", "Content": "So far I am very pleased. I've been a fan of Sony products for a long time and this one certainly met my expections.", "Date": "December 12, 2007"}, {"Title": "A smaller LCD is ready for prime time.", "Author": "South Dakota \"Plainsman\"", "ReviewID": "R33L00XU12CQS2", "Overall": "5.0", "Content": "The picture on this TV is spectacular with very few analogue exceptions. Most analogue programs are just fine and some are nearing HD quality. The Regis and Kelly show is the worst. Their equipment must be low end.Digtial cable is fine but there are times (not all the time) when the picture stutters a bit. It is not the TV's problem. I have an antena picking up network digital and HD over the air and the picture smooths out when I go from cable to antenae. The antena tuner is terrific. This set picks up channels that my other HD tvs do not. (Sony: One button switching between Cable source and Antena source would be great. That feature is on my XBR 960 and it would be nice on this set.)I hooked my PC to the monitor via 15 pin VGA and played Battlefield 2142. It looked spectacular and did a fine job.The picture is bright. The sound is pretty good but not great. It sounds fine for tv programing but doesn't have much for base if you want to listen to music.I would buy this set again in a heart beat. Sony did a good job and it looks fine with 720p. Nonetheless, if they brought out this same set with more pixels as in 1080p, it would be one fine convergence unit. It would then give the computer monitor panels a good run for your dollars.", "Date": "November 29, 2007"}, {"Title": "Enjoying 21st century technology!", "Author": "C. Alexander \"Meeka\"", "ReviewID": "R1OJB1P2XLDRP6", "Overall": "5.0", "Content": "Having had my old tube TV for so long,it took lots of research till I settled on the Sony Bravia. May I say that in all the time I spent glued to the computer reading about all that was available in the LCD world, Amazon had the most informative views and reviews. Since my living space is small, Amazon had the right size HDTV and the best price! It arrived in an unbelievably timely fashion and packaged wonderfully well. The instructions were clear and I had the TV set up in no time. I thought I would have to go out and buy all sorts of fancy cables, but I used what I had and Voila! The picture and sound had to be tweeked a bit and that was no problem,you just follow the on screen menu. The picture is just gorgeous and you really appreciate it when you watch nature shows or an old black and white film. Sony Bravia really is living up to all the good reviews I read in my research and I highly recommend this television.", "Date": "April 11, 2008"}, {"Title": "720p", "Author": "Z. Falborn", "ReviewID": "RMOP3XXGKQ9HF", "Overall": "5.0", "Content": "I LOVE IT!  This is my first flat screen TV, as well as high def.  When i was searching for a new TV, I came across this one and thought it sounded great after reading all the reviews, and specs that it has.  After telling friends what i had purchased, most of the comments were along the lines of, \"wow, you bought one of those\", or \"going top of the line are we?\".  I did not know that i had purchased some of this quality until after i played my first blu-ray movie on it.  The options are great, quality is great, and sound on stock speakers(the ones on the TV) are wonderful.  I had thought about going for the larger size, but settled with this one.  I have it on the wall, being that its light weight and not too big, i can put it in any room i please without fussing over the weight and size.", "Date": "February 28, 2008"}, {"Title": "Just what I wanted", "Author": "B. Burke", "ReviewID": "R3EF0761ZZ2KO7", "Overall": "5.0", "Content": "This is a GREAT TV for the price.  I haven't had the HD installed yet, but can already see an improvement in the picture quality.  I easily hooked it up myself and made slight adjustments to the default settings for color, etc.  GREAT features also.  Couldn't be happier.", "Date": "February 18, 2008"}, {"Title": "I Think WOW Sums It Up", "Author": "Shaen Oneal", "ReviewID": "R358I12PJX4G2Q", "Overall": "5.0", "Content": "If you own an XBox 360 with an HD cable, the detail on this TV will blow you away. I've owned the 360 for a while now and have been playing on an old 13\" TV. When I got this TV from UPS yesterday and switched the indicator on the plug from TV to HDTV on the 360 I was amazed at the difference. The colors are more vibrant and the detail is wonderful. I've been playing Mass Effect, a game where you explore other planets to get things done. On the old TV the planets had some details, but now I can see individual grains of sand and other details that were not there before. I also own the Sony sound system that goes wonderfully with this TV.", "Date": "January 8, 2008"}, {"Title": "Sweet", "Author": "Ftec \"RjD\"", "ReviewID": "R1GSTVZO2PX220", "Overall": "5.0", "Content": "This is a nice TV,I have no complaints so far. Plenty of inputs and a great picture. I checked out alot of 26\" HDTVs and settled for this because of the Inputs and Features. Nice HD its clean.", "Date": "December 8, 2007"}, {"Title": "If you can still find one...BUY IT!", "Author": "L. Phillips", "ReviewID": "R23C2J2472ZVRW", "Overall": "5.0", "Content": "This model was recently discontinued. I managed to find one for $650, delivered, online from Beach Camera in NJ and it arrived this Tuesday. I immediately ran to my local cable company office and traded in my old digital converter box for a Hi Def converter box.  I require a converter box because I subscribe to all of the Premium channels, so although I could probably pick up many Hi Def channels without it, I would loose the Premium channels.I did see the replacement model in a Circuit City and the picture was equally as gorgeous, but does not have Surround Sound, the speakers are half the wattage of this model and it lacks a number of other features.  Others have reviewed the new model on Amazon, so you can easily read the differences.It has a gazzilon options in terms of picture. I find new things every day. I have the cable box connected with an HDMI cable, which I had to buy, since my cable company only provides composite cables with the Hi Def box and HDMI is infinitely better, having now used both.I am absolutely thrilled with this set. I am a long time Sony fan anyway.If you are in the market for a 26\" Hi Def....and can still get your hands on this model...DO IT!  You will not be sorry.The sound is quite good.  The base is more stable than many of the others that I looked at. (I live in an earthquake prone area, so stability is an important issue for me.) The case is simple and attractive. It is not gaudy or shiney.  I did not want a high gloss finish anyway. It will not be the dust magnet that the high gloss ones are.I have it in my bedroom, which is a small room. When I want larger sound (like for the many Premium cable movies that I watch), I play the TV through my Bose Wave Radio, which has wonderful sound for a small room. However, just for listening to news or whatever, I use the set's speakers, which are much larger than the new model, and sound just fine in surround mode. I also like the fact that it has a stereo, mini plug, headphone jack, as I tend to be a late night person and don't want to disturb my neighbors.I had connected my standard DVD Player (but have since gotten a Sony Uploading DVD Player)and the picture looks wonderful. For my discs, I also play the sound through my Bose Wave, which has an additional Multimedia Pedestal, allowing me to connect the audio of 3 components, in my case TV, DVD and Laser Disc.  Given that I have a small bedroom with no real space for a stereo system with free standing speakers, the Bose Wave, which has a very small foot print, is an excellent compromise.I need to emphasize that this model is a far superior set to all the others that I looked at in 26\".My final words to you are: BUY IT!!!!!!!", "Date": "May 26, 2008"}, {"Title": "I LOVE my TV!!!!", "Author": "Mary M", "ReviewID": "R3RANKDN9QTWJ1", "Overall": "5.0", "Content": "I've been using my Sony Bravia for about two months and I LOVE it!  I only have it hooked up to the antenna for now (until I break down and get HD) and it is a 500% improvement over my old tube TV!!!  It has a great picture and the remote and controls are super easy to use without looking in the manual.  The picture (color, etc) is easy to adjust.  Amazon had the best price I could find when I was ready to buy it and ABT had great delivery.  I am extremely happy with my purchase and I would buy this TV again in an instant...", "Date": "April 26, 2008"}, {"Title": "Sony Bravia TV -- Excellent", "Author": "Rogene Waite", "ReviewID": "RYZSOA46IP06Z", "Overall": "5.0", "Content": "I researched 26 inch TVs.  Consumer Reports recommends the Sony Bravia most highly. It's a super TV.  Deal through ABT on Amazon was exceptional.  Delivery flawless.", "Date": "April 21, 2008"}, {"Title": "Bravia S series", "Author": "C. Burns", "ReviewID": "R22T3980CLG01E", "Overall": "5.0", "Content": "First time this item shipped out, it had a palatte jack gash right through the screen, but Amazon remedied the situation immediately and the second one arrived in prefect condition 2 days later.  Beautiful picture, great sound, easy to use menu.  Some features, like the automatic light adjuster, are neat as well.  Perfect for the bedroom w/o taking up a ton of room.  Lovely set to own, true Sony quality.  Highly recommend!", "Date": "April 5, 2008"}, {"Title": "Excellent LCD HDTV", "Author": "Stephen", "ReviewID": "R3V0RWO9KXCXR", "Overall": "5.0", "Content": "This LCD TV is far better than my previous Cathod Tube 27\" Sony TV which died all the sudden after 14 year problem-free service last month. Although it is somewhat more expensive than the other brands for the same dimension. The feature and picture quality of this TV is worth the extra money. The built-in tuner enable me to get all the local HDTV channel free. The HD pictures from this TV are awesome. No issuees and happy with the purchase so far after having it for a month.", "Date": "February 28, 2008"}, {"Title": "Sony -- Simply Superb!", "Author": "Richard Holmes", "ReviewID": "RMAIQQI99AN5C", "Overall": "5.0", "Content": "This television is -- as I have come to expect from Sony -- absolutely excellent! I have a large Sony HD Wega XBR in the livingroom (a CRT), and I wanted to replace the bedroom TV with an HD LCD. This 26\" Bravia is a perfect fit for the room and the performance is superb. I have satellite service, so the HD picture is so realistic that it was positively spooky at first. I couldn't be happier.If you are at all put off by the slightly higher price for Sony products, don't be! The quality is always there and I consider that well worth a slight premium. Aside from the outstanding picture quality, Sony's tradition of always having the most (and best situated) hookups for various components is wonderful.", "Date": "February 18, 2008"}, {"Title": "SONY BRAVIA KDL-26S3000 26\" 720p LCD HDTV", "Author": "Ralph W. Haneman", "ReviewID": "R1XLCZZ8UHU56B", "Overall": "5.0", "Content": "Reading reviews on the SONY BRAVIA KDL-26S3000 convinced me to purchase the SONY instead of other makes.  Beautiful picture!  Great sound!  Connections are clearly marked and pictures in Quick Setup Guide simplified hookup. A great variety of options for picture and sound. \"Initial Setup\" automatically tuned the Bravia to digital and analog stations with, in my case, an outside antenna.  Dish Nework looks even better.  I don't have cable so I can't comment on that.  DVD's played on a Panasonic (sorry) look great.  Would I buy it again?  Absolutely!", "Date": "January 2, 2008"}, {"Title": "Awesome TV !!", "Author": "A. Sharma \"Anu\"", "ReviewID": "RZHMK6MB3LRPK", "Overall": "5.0", "Content": "My research for 26' TV focused on Panasonic, Sony and Samsung. I loved everything about Panasonic 26LX70 but it does not have VGA input( even though it can be connected to laptop by DVI/S-Video but neither of my laptops had them) So I thought of buying Samsung but did't like it's glossy finish, also I was concerned about sound quality that some reviews were complaining about. Finally, Even though I am not fan of Sony products because of their price, I bought 26S3000...and I found that this model is awesome !! So if you are going to buy it....you won't be disappointed !Here are the pros about Sony Bravia 26S30001. The picture quality is awesome.2. Great features PIP/P&P....Note; that you will find PIP false but actually it has it.3. Brilliant picturewhen connected to laptop - Texts are razor sharp and no fuzzy lines around like other brands.4. Enough connection interfaces.6. Found many more digital channels than PanasonicetcCons:1. Analog channel quality for week signals might need to be improved. Note that I connected TV with Indoor antenna and I do not have cable connection...so probably it seems that antenna needs to be better quality2. Could have given separate ports for Cable and UHF/VHF as Samsung does...also it would have been better to provide easier switching between between UBH/VHF and cable through remote.Overall, I found the TV of awesome quality and worth the money !", "Date": "March 22, 2008"}, {"Title": "GREAT FOR HD...POOR FOR STANDARD BROADCAST", "Author": "Gary Pozsik", "ReviewID": "R1IIN6W3BEH5YT", "Overall": "4.0", "Content": "IN HD..THE SET IS SUPER.....BUT WHEN A PROGRAM IS BROADCAST IN STANDARD FORMAT IT IS SOFT AND GRAINY!!!!", "Date": "September 9, 2007"}, {"Title": "Fabulous", "Author": "Ashley D. Young", "ReviewID": "R2PL2L0Z9E1RBW", "Overall": "4.0", "Content": "I needed a TV upgrade and this was a fabulous choice.  Cheaper here than anywhere else I could find, too.  I was worried that the screen angle isn't adjustable, but it is great from any viewpoint.  I didn't hang it, so I can't say anything on that aspect.  I have a smaller size entertainment center and could only afford to get a new TV or a new stand (for an old TV that didn't work anymore...easy choice).  The 26\" seems small in the stores, but it really isn't that bad since the quality is so great.  Good deal and a great choice.", "Date": "April 28, 2008"}, {"Title": "Very Happy!", "Author": "Ruth \"Lotokats\"", "ReviewID": "R2CHH8GFONW1C3", "Overall": "5.0", "Content": "We are very happy with our purchase.  So happy in fact, our son purchased the 40\" model.  We were going to purchase the television from our local mall but wanted to do a little internet research first.  After all my research, we couldn't find any reason NOT to purchase it, AND it was more than $200 cheaper here at Amazon.  For the money, you can't got wrong!", "Date": "April 21, 2008"}, {"Title": "Sony Bravia while somewhat pricey is still the one to buy @ 26 inches.", "Author": "Tim", "ReviewID": "R2LXH4HOL6PJ0P", "Overall": "5.0", "Content": "I haven't used the pc feature yet, but the picture quality is very good for a lcd type. Easy setup but a little complicated for the menus. I am using an antenna and reception for hd is without problems.", "Date": "April 20, 2008"}, {"Title": "Sony Bravia", "Author": "syp", "ReviewID": "R1V6EE4I7AQN49", "Overall": "5.0", "Content": "Nice product, promptly shipped; only problem is fading of colors when viewed from the side instead of straight on.", "Date": "April 18, 2008"}, {"Title": "very happy", "Author": "bob", "ReviewID": "R1ZDZWN4VR36NL", "Overall": "5.0", "Content": "Once I decided what to buy, my son convinced me to purchase the Sony HDTV from Amazon rather than from Best Buy or Circuit City. The main reason was cost. I saved about $75. ( He had bought a TV from Amazon a few months earlier and had no issues.I ordered the TV on a Monday. It was shipped from Tennessee and arrived in Massachusetts on Friday. Shipping was free.The Comcast technician hooked it up as I was also ordering a DVR from Comcast.I love the TV and I am still getting used to the fact that I can change the picture from Normal, Zoom, etcWhern I buy my next TV, I will seriously consider Amazon.", "Date": "April 18, 2008"}, {"Title": "Sony Bravia HD TV", "Author": "E. Silberstein", "ReviewID": "R39RKRBPQ0GM0H", "Overall": "5.0", "Content": "We are extremely pleased with the Sony Bravia and with the fast delivery service as well.  The price was great too.  I wouldn't hesitate to purchase another TV from the same supplier.", "Date": "April 12, 2008"}, {"Title": "Extremely Happy!", "Author": "Chuck Gove", "ReviewID": "R9LPKQ2MNOC1B", "Overall": "5.0", "Content": "I looked at quite a few tv's before selecting the 26\" Sony. We had bought a 26\" Sharp tv, but was very un happy with the sound portion. It has 5 watt speakers and with the sound all the way up it was hard to hear what was being said. The 26\" Sony is very good and the sound is very good. I have the sound set at midway and it is good. The picture is beautiful and sharp.", "Date": "April 8, 2008"}, {"Title": "Excellant TV", "Author": "William G. Elliott", "ReviewID": "R1VCZ4AV5X5DHA", "Overall": "5.0", "Content": "This TV has a great picture and is just the right size for the room I have it in.  I would buy it again.  As a matter of fact, I bought the 46\" 1080 for the family room.", "Date": "January 7, 2008"}, {"Title": "Incredible picture", "Author": "Day Lily", "ReviewID": "R1VR2AXYZBCZDL", "Overall": "5.0", "Content": "I do not have HDTV service with my provider for this SONY set, yet the picture is as clear and detailed and lovely as the picture I get on my HDTV in another room.", "Date": "November 28, 2007"}, {"Title": "Best quality", "Author": "Sudeep Vishnumurthy \"- degz\"", "ReviewID": "R2FXB04K5H6GBJ", "Overall": "5.0", "Content": "I buy a sony bravia always. I move a lot and usually upgrade every 2 years and I always end up buying in Amazon.", "Date": "July 30, 2011"}, {"Title": "Awesome.", "Author": "zjs1", "ReviewID": "R1H34829YYCPRS", "Overall": "5.0", "Content": "Great TV and computer monitor. HD channels look crisp. Auto-tune was easy. I didn't mess with the settings much. I sometimes flip the Light Sensor (I turn it on when using it as a monitor otherwise it is too bright). It has better resolution than the IBM X61 laptop I hook up to it. My Windows Vista desktop looks cool when it fills up the full 26-inch widescreen (I had to change one setting once to get the resolution set perfectly). Good sound as well - I rarely need to turn the volume above 33-35, and the max is 100.One of my buddies commented that he would be able to use this as a computer monitor from the couch, which is 8 or 9 feet away. Of course, that would strain the eyes after not too long, but the point is that a person with normal eyesight can read 12-point text on a 26-inch bravia screen from 9 feet away. That's pretty good, yes?The week after I got this in the mail (smooth and quick delivery; well-packed), I was at the MOMA (Museum of Modern Art) in New York. One of the floors had a section of video and computer graphic art. All the exhibits were using Sony Bravia TVs. I'm sure it was part of a sponsorship deal or something, but another way of looking at it is that a group of folks (i.e. professional video and graphic artists) that one can expect to be very concerned with picture quality selected this LCD TV. Naturally, I took this as a sign from god.", "Date": "June 11, 2008"}, {"Title": "Good Transaction", "Author": "Robert W. Lull", "ReviewID": "R2Y59QAOWUEJ6D", "Overall": "5.0", "Content": "Product arrived with no delivery handling or timing problems at all.Setup and installation went perfect. I have it connected directy to the cable wire, no cable box. The picture is terrific.Advantages - very reasonable price, no sales tax, home delivery with no problems, easy setup, excellent quality product. Want more than that?", "Date": "May 9, 2008"}, {"Title": "Great tv", "Author": "Mary Nell Schwarz", "ReviewID": "R3SCZCSYW2RLFJ", "Overall": "5.0", "Content": "Sony never lets me down. Great picture for a smaller tv and so lightweight.  So far no problems and I am very satisfied with my purchase.  Lcd's are great in a room with lots of light.", "Date": "May 9, 2008"}, {"Title": "Awesome TV", "Author": "L. S. Davis", "ReviewID": "R27MVRM7SBX4SK", "Overall": "5.0", "Content": "I bought this TV first of all because it is a SONY and I always buy SONY.  Well SONY didn't let me down.  This TV is Awesome, the picture quality is perfect, the controls are easy, the set up is a breeze.  I can't say enough about this TV, but that it is AWESOME", "Date": "April 17, 2008"}, {"Title": "It's a SONY.", "Author": "J. Wunner", "ReviewID": "R15J3MJ5S6WU9L", "Overall": "5.0", "Content": "After buying the KDL40W3000 40\" LCD 1080p from Sony, I was so impressed with the quality/build of that television set that when the time came to buy a smaller set for my office to take over duties of my oooold 27\" Sony CRT which finally died after 10 years of faithful service, it was a no brainer as to what brand to buy.  I looked long and hard and did ALL my homework before purchasing.  I had learned that this is the \"upper\" level 26\" as opposed to the KDL26M3000 model.  M standing for \"mass market\"  (Wal*Mart, Sears et al.) which is the more commonly found model on the shelves.  All I can say is the picture is OUTSTANDING.  NO other make/model could compare.  My TV is connected to a Directv HD receiver via HDMI and the 720p/1080i picture is just pristine.  I find myself looking for HD programming when channel surfing because the HD picture is so good.  The sound is what you would expect from a small television, clear and adequate.  The cabinet is understated and does not have the \"glossy\" look frame that I find distracting on other sets.  The frame on this set does nothing but accent the picture on the widescreen without being flashy or reflecting any ambient lighting in the room.  Good call on Sony's part.As most other reviewers stated in previous reviews, this set costs a couple dollars more, but in the words of a famous somebody who's name presently escapes me...  You get what you pay for.  And with Sony, you get a fine television from the folks who do TV best.", "Date": "March 4, 2008"}, {"Title": "fade", "Author": "T. Near", "ReviewID": "R3T8MI4GKNDZZA", "Overall": "4.0", "Content": "Liquid crystal display flat panel provides excellent picture straight-on but quality fades when viewed from either side. Otherwise, Sony perfection comes through.", "Date": "May 9, 2008"}, {"Title": "Gorgeous quality!", "Author": "Nugget", "ReviewID": "R6OTR81NWAC8D", "Overall": "5.0", "Content": "Set up was a breeze. And the quality is beautiful. I am not a size queen, so the 26 inch is plenty big for any square footage! unless, i suppose, you are trying to build a home theater with stadium seating!", "Date": "April 30, 2008"}, {"Title": "The SONY Bravia KDL26S3000", "Author": "Doris Howard", "ReviewID": "RECOYDW4AADKC", "Overall": "4.0", "Content": "The SONY BRAVIA KDL-26S3000 is fine except for the POWER on/off capacity. It doesn't want to turn ON in response to the remote or the POWER button on the machine. It especially does not want to turn off. The POWER button must be held down for 30-40 seconds on both the remote or the button on the machine. It also needs a full minute to warm up before you can change to another channel.", "Date": "May 10, 2008"}, {"Title": "Best LCD TV", "Author": "Bee \"Tronic\"", "ReviewID": "R1MAVG3UQ8DY8D", "Overall": "4.0", "Content": "This is the best LCD TV I ever seen. The screen is as clear as the tube TV's to compare. And a good picture one to add. I am glad Sony makes these TV's because my other LCD looks like a LCD screen TV. The only down side of this TV is the high cost. But then it does have a lot of features like 2 HDMI", "Date": "November 23, 2007"}, {"Title": "Love it, with one exception", "Author": "Marc H. Danforth", "ReviewID": "R30SL3PNZH4N06", "Overall": "4.0", "Content": "This is a great set and has a very good picture and acceptable sound.The only exception to absolute satisfaction is that I still have to use 3 remote controls when I play a DVD through the system.  One for the satellite, One for the TV, One for the DVD player.  One unit for all three pieces would be ideal.", "Date": "December 30, 2007"}, {"Title": "Moderate picture quality.", "Author": "VJ Chris", "ReviewID": "R1V3BB51PYNARV", "Overall": "3.0", "Content": "the fact that the 26 inch Sony Bravia is not a 1080p TV [it is 720p] makes for moderate picture quality. A built in DVD player would have added a lot of functionality. I like the overall finish and easy to use controls. My wife liked the fact that it is small enough for the bedroom. I wonder if it is worth the $717 that we paid...", "Date": "December 20, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "HDTV with ATSC� Digital Tuner\nBRAVIA Engine� full digital video processor\n16:9 HD Resolution Panel (1366x768)\nLive Color Creation featuring WCG-CCFL backlight\n1080p Inputs - HDMI� (x2), YPbPr (x2), PC Input (x1)", "Name": "Sony Bravia S-Series KDL-26S3000 26-Inch 720p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31BYaHsc1oL._SX300_.jpg", "ProductID": "B000P6R6CO"}}