{"Reviews": [{"Title": "For the Money, an Excellent TV", "Author": "W. E. Horton \"writer\"", "ReviewID": "R3POPN6TUASCCJ", "Overall": "5.0", "Content": "Having finally obtained an HDTV after enormous hassle with Amazon (anyone else notice all the fraudulent listings up here?) I ordered this particular television for around $400. Due to the negative reviews posted by other viewers, I was almost expecting something to be wrong with mine (mind you, I've had it for less than a week so far) but instead have found myself quite delighted with it. My model did not experience any color problems that others have reported, but looked crisp and richly colored. After setting it up with my 5.1 surround sound system, my 1080i HDTV tuner, my cable, and my HDTV antenna, I was able to sit in my smallish bedroom and be caught up in rapturous visuals and thundering sound (with the surround sound cranked up). Another neat feature was the nifty side panel which allowed for easy hookup to my computer (which has an S-Video out). I was headbanging to my massive MP3 collection and watching streaming broadband video on my new TV, and was almost in digital nirvana :-)The remote takes a little getting used to, but if you are smart with your settings you can really squeeze the most features out of your system. Overall, this television ended up being perfect for my digitally-wired bedroom.", "Date": "September 8, 2005"}, {"Title": "Not a great set, but it is a good one.", "Author": "C. Prescott", "ReviewID": "R3T8MZ58T5BKR6", "Overall": "4.0", "Content": "Greetings, I purchased this T.V. quite some time ago and I have been able to work out most of its quirks. From what I have seen the T.V. has 3 basic problems: 1. The color settings and the color red are way, way to high when you first start up this set. I found that I had to turn the color down to almost a 1/4 on the on screen display and in the red/green control I have it almost entirely green. After messing around with it for awhile I am quite satisfied with the results. 2. the second problems is that this T.V. isn't exactly top of the line. It lacks the 720 or enhanced T.V. options and does not support HDMI. However this T.V. does support 420p, 420i, and 1080i, so DVDs and HI-Def T.V. channels look awsome, and the widescreen is a really nice feature on this set. 3. The final problem is that if you have the T.V. set to have it display normal T.V. in the 4:3 ratio you get grey bars on the side of the T.V. but they are not always grey, depending on the brightness of the picture, on the screen, they sometimes shift between light and dark grey which can be distracting, you can strech the picture so you don't have the bars, but then the picture can look a little distorted. In conclusion, I feel that these are minor problems overall. If you can get this set for $400 or less, then that alone can override all the problems I just listed. This is a good set, it won't look as good as those 40+\" plasma T.V.s you see in the stores, but if you compare price and features between them and this T.V. you can get alot for your money from this set. Thank you, and I hope that this review is helpful to you.", "Date": "September 6, 2005"}, {"Title": "Struck out TWICE", "Author": "J. Dammann", "ReviewID": "R1QME5EFP5FKMR", "Overall": "1.0", "Content": "I ordered this and received it very quickly.  Upon plugging it in the color was extremely distorted and 'wavy'.  I returned the set and requested a new one.  When the second one arrived it was WORSE.  There was no picture at all other than a very bright wavy rainbow across the screen.  I tried all the degaussing hints and relocating hints etc. to no avail.  No wonder the set has been discontinued.", "Date": "August 28, 2005"}, {"Title": "Great product for the price.", "Author": "adam lay", "ReviewID": "R1VKMMXEPC5RAN", "Overall": "4.0", "Content": "Overall the television is excellent if a little large and heavy.  The three component inputs and 1080i resolution are great features, and audio options are pretty good (but not near as good as a decent home theater).  If you value screen size over weight and mounting options this is one of the better values for the price.", "Date": "September 8, 2005"}, {"Title": "High Quality and High Weight", "Author": "The Review Man \"J-Lew\"", "ReviewID": "R2ECQL26W37M9K", "Overall": "4.0", "Content": "Working at a retail store this was the first wide-screen high-definition TV we carried.  While working I would find myself staring into the clear picture that this TV had.  At the time the television cost around $700.  I knew this beautiful machine would eventually be mine.  After two years the TV finally went on clearance, so I decided to pick it up.  The only problem I have with it is when I first carried it down the stairs with my father.  The television is heavy and bulky, but i could not be mad at the low price I got it for.  Once situated the TV looks great.  The picture on the television is clear and great with my progressive scan DVD player.  Movies come out with a clear and crisp picture.  Movies in wide-screen do have letterboxes, but they are reduced and some I have watched even eliminated the box.  The picture on regular cable looks fine as well.  I would recommend high definition cable though if it is available.  Setup was easy and quick.  From what I have read many consumers have experienced a problem with the picture having funny colors when the TV is turned on.  This did not happen for me at home, or for the display at the retailer I work at.  The television has not failed me for the half a year that I have owned it.  Overall, if you are looking for a wide-screen high-definition television with a low price, this one will meet your demand.  The price of this television makes up for the bulky size.  With a surround system, it creates a personal theater like performance.  Make sure you have a space for it and enjoy.", "Date": "November 15, 2005"}, {"Title": "HDTV at a great price", "Author": "RecklessOne", "ReviewID": "RFTOOBV5TUH7C", "Overall": "5.0", "Content": "I bought this TV on sale for $349. For the money it is an excellent television. The pros are, of course, HDTV capabilities. It also has decent sound and good picture quality. The cons are no HDMI/DVI interface so no digital connectivity. Also, there is no 720p support so you are forced to go with 480p or 1080i. Something others may be concerned about: When connecting to a computer there is significant overscan and you need to drop the resolution down to get 1080i support. All in all, I am very happy with my purchase.", "Date": "September 3, 2005"}, {"Title": "Not too bad... but", "Author": "bought a samsung", "ReviewID": "R3MBPNXLYAFRSD", "Overall": "4.0", "Content": "For less than $350, this is a great widescreen tv.  It got to my home almost a week before what Amazon said it was going to (which was very nice) so I got to enjoy it sooner.  The big gripe I have about this tv is that if you utilize the component inputs with your DVD player, you will still have the letterboxes.  A friend of mine got a 52\" rear projection, widescreen tv and it automatically adjusts the screen to completely eliminate the letterboxes, I assumed (incorrectly) that this feature was native to all widescreen tvs.  Although some other Samsung widescreen tvs do have this feature (I did some researching afterward)this one does not.  Also, when you first get the tv and set it up and you notice some psychedelic colors on the edge of the screen; don't worry -- just let it sit turned off for a few hours and it should be just fine.Bottom line, if you want to watch widescreen DVDs without the letter boxes, don't buy this tv.  If you want to get a good, budget priced widescreen tv with good quality picture and you can still live with a little bit of a letter box; this is the widescreen for you.P.S. I know that I said that it doesn't eliminate the letter boxes; what it DOES do, however, is significantly reduce them.", "Date": "September 7, 2005"}, {"Title": "Samsung TXN2668WHF 26\" Widescreen DynaFlat HDTV TV/Monitor", "Author": "Dennis Lindfors", "ReviewID": "R20G6QJP72NLS1", "Overall": "2.0", "Content": "Great HDTV for small rooms and the excellent price. No HDMI or DVI inputs, although the quality with Monster brand component video cables is stunning. Non-HD video is mediocre. DVD playback is excellent. There is no onboard HD tuner so you will have to have a HD tuner from you cable company or purchase one.Summary: great HD for a small room and the price.", "Date": "October 25, 2005"}, {"Title": "weak power supply", "Author": "A. Torres", "ReviewID": "R2BNSIAQTZFM5E", "Overall": "1.0", "Content": "Arrived DOA. Due to dead power supply. Returned to amazon with no problem. I asked for a exchange, since thier was none in stock at that time i did not get another one.", "Date": "August 28, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "16:9 widescreen high-definition CRT set with 26-inch DynaFlat screen; 31.5 x 19.9 x 21.8 inches (W x H x D)\nAccepts high-definition 1080i and 480p progressive-scan signals from DTV set-top receivers and progressive-scan DVD players\nFront-panel control keys grant menu access independently of the remote control\nSide-panel AV hookups and controls allow easy connection with a camcorder, gaming console, or other device\nOffers 15 watts per channel through side-mounted stereo speakers, simulated surround sound", "Name": "Samsung TXN2668WHF 26\" Widescreen DynaFlat HDTV TV/Monitor", "ImgURL": "http://ecx.images-amazon.com/images/I/416ZRP9KRAL._SX300_.jpg", "ProductID": "B000A3I49Q"}}