{"Reviews": [{"Title": "Almost perfect", "Author": "K. Hecker \"Ken Hecker\"", "ReviewID": "R2QAKRRBKICBES", "Overall": "5.0", "Content": "I purchased the Olevia 537h LCD flat panel TV for my mother, as she entered an assisted living community.  I wanted her to have the best picture quality.  She loves baseball, and has fairly good eyesight.I had spent some time looking at the Olevia 537h, but had only seen it showing a poor quality documentary.  Still, I could see that the picture was excellent.  When I installed my unit (which by the way was delivered sooner than expected, and in perfect condition), and first played a DVD, I was more than satisfied with the results (the Platinum edition of Snow White and the Seven Dwarfs was almost too good.  You could see the artists' every brush stroke).  The DVD player was one which Up-converted to HD 1080i quality, and the Olevia was up to the task.  The picture was sharp, and the color was pure.As has been stated, the on-screen display menu system Syntax is so proud of takes some getting used to, and I had to print out the manual from disc to have a reference in front of me.  Some things are still not clear (manual-wise, that is)  I almost have it fully programmed, but will probably have to find a simpler remote for my mother's use.  I'm using it with an HD antenna, but will probably have to arrange for cable input, as some local stations just don't come in well.  This I know is not the fault of the unit.Overall it is a gem.  The picture looks great in even bright room light.  No glare from the screen.  The colors are pure.  And the price from Amazon is the best I had found.", "Date": "October 16, 2006"}, {"Title": "A great product at a great price", "Author": "Mark Davey \"Kariato\"", "ReviewID": "R1IPKIYQTONT8L", "Overall": "5.0", "Content": "A great product got better. The 537H is the successor to the LT37HVS which was a great product with a heavy internet following because it provided a excellent picture at a very reasonable price. So how did Syntax top the LT37HVS well they kiazen`d(fixed) its few failings the SD picture, ATSC tuner and the remote while retaining the excellent picture and the great price point.The quality is fantastic, watching PBS's nature shows just shows off the picture.The ATSC tuner works great, I live in a rural area and many of our digital stations operate at low power but with a good indoor power antenna I picked up all the broadcast channels without problem. WKET transponder is a good 40 miles away and operates below 100W but came in with no dropouts.Where this television really separates it self from the other low end HD panels is the SD picture quality. Low end panels normally fail when it up converts an SD 480i signal, the cheap video processors usual included cannot process a decent looking SD picture which a real annoyance since the majority on content will be SD until we go all Digital in 2009 or later if you are using cable sources. The SD up conversion looks great, nearly as good as the up conversion at the local broadcasting stations.Pros:Great contrast ratio 1:1600Excellent colors, bright (though the darks took a little adjustment to get right)An ATSC tuner that works great.Lot's of different sources at the back.Nice stylingCons: (Silly small things)A little thick for a flat panel.Menu system takes a little getting used too.I personally believe that it will be hard to find a better 37\" HD panel at this price point.", "Date": "September 5, 2006"}, {"Title": "SURPASSED ALL EXPECTATIONS!!!", "Author": "Steve \"A Jersey Guy\"", "ReviewID": "RTGLQIP0V47TC", "Overall": "5.0", "Content": "This is an incredible TV.  Aside from some annoying minor problems like the fact that I can't program my cable box remote with this TV's codes to turn the set off and on or to change channels (the codes that Olevia says will work--won't) and selecting the source by rotating through ALL of the options (including the unused ones).  Otherwise this is a truly stellar piece of electronics.  Amazing picture, great sound, nicely designed...oh and did I mention great picture?  The HD channels are so vivid as to look like a photograph.  While channel surfing I hit Madagascar in HD and just stopped because the picture was awe inspiring.  Bottom line, the price is extremely affordable.  Xbox 360 games take on a whole new perspective on this TV.", "Date": "November 12, 2006"}, {"Title": "Agree with the other reviewers here !", "Author": "Millard \"Millard\"", "ReviewID": "R2HDOFY99Z5WDE", "Overall": "4.0", "Content": "I bought the 537H before Thanksgiving for just under $1,000.  The price has subsequently dropped to well under $900.  Shop the net and get the best price.  I did have to update the firmware which requires you to download the drivers and the software from the Olevia site, then hook up your USB cable from the computer to the TV and then follow specific instructions requiring you to unplug the TV two times.  Not real user friendly and if Olevia had a little better product control, the consumer wouldn't have to \"reboot\" a new TV so to speak.  The price is terrific for the size of the screen.  The remote control codes are impossible to find and even Olevia admits that 3rd party remote controls will not work, unless you get a learning remote and program that independently.  So I have three remotes right now, one with the TV to control the volume, the Time Warner cable box remote to change the channels and the Dish Network remote for the satellite.  Got a learning remote on the way to help alleviate the clutter.The 537H does have many input jacks to accommodate your cable boxes, audio receiver, DVD players etc.  The downside is that when your trying to change the input(say going from cable box to satellite TV) you've got to go through a whole list of different inputs to get to the one you want. To be specific it is 10 inputs you will scroll through.If I was going to do it again, I may of spent another $100 or so and looked for more well known maker whose remote codes are more known.Overall for the money it's a good set, just be aware that there are some trade offs.UPDATE March 2007:I've had the 537H since November and now feel competent to write a review after living with this for 4+ months. The TV is now a better buy than when I purchased it for $1,000. It can be had for around $700.00. A terrific value in my opinion. The picture is very, very good. The shipping box is very, very poor. Make sure you know the sellers policy on returns/damaged goods. Don't let the UPS/FED-EX/DHL whoever leave until after you've inspected the box, opened the box and made sure everything is good.The 537 has plenty of inputs especially at this price point. It has like 10 different component settings available(DVD, SAT, TUNER, S-Video(2), Composite(2), component(2) and HDMI. The problem is that one mist scrawl through all of these to get to the component that you want to watch. There is no way to \"turn off\" so to speak those that you do not actually have hooked up. The TV does not have a universal remote code, so if your trying to use a remote from another component(say your cable TV remote or satellite remote), your not going to be able to control the TV with those. I ended up getting a SONY learning remote and programmed that with all the codes from the Olevia remote, my DVD player, Amplifier, Satellite TV box and cable box. Another thing a buyer needs to know is that the TV ships in what Olevia calls \"Showroom mode.\" When you first turn on the TV, you will have to take the TV software out of this mode and put it in \"home\" mode as this will allow you to change audio and video settings, take the tv out of Closed Captioning(yes it comes with CC activated - Why ??? Who knows ?)and change the audio from \"church\" mode(the audio is like an echo) to normal mode(again Why ???). The instruction manual is entirely on a CD and you should spend a 1/2 hour or so opening this CD on your computer and reading the set up instructions. The TV does have a base that can be removed for wall mounting but you'll need an extra long Phillips head screwdriver to reach the screws that are mounted 5 to 6\" up inside the bottom of the base. However once you get it all hooked up and set up, you will really enjoy the picture.", "Date": "January 5, 2007"}, {"Title": "Great Product; Horrible Service", "Author": "Alena Gouveia \"grounded for life\"", "ReviewID": "RA0UGGCWORXBH", "Overall": "1.0", "Content": "This is a great TV.  Unfortunately, my TV only worked for 12 hours before it would not turn on again.  My first reaction was that I got a defective model, but I understand that this sometimes happens.  I immediately contacted Olevia regarding the warranty.  Here's where things went south.  Olevia did not respond to my numerous e-mails regarding the problem.  I've spooken to their representatives on the phone a half a dozen times and while they finally agreed to replace the TV with a new one, I've yet to take delivery of the new unit after a month.  They don't seem to be able to give a definitive answer on the problem OR the resolution.  Very disappointing.Bottom Line: If your TV works, you're in for a treat as the picture quality is nice, with sound that can't be beat.  However, if you have any problems and are counting on the warranty to fix them, you're in for a rough ride.", "Date": "July 28, 2007"}, {"Title": "Modest price, Big performer", "Author": "R. Rasmussen", "ReviewID": "R1DYNX7ZWDQ4C9", "Overall": "5.0", "Content": "I want to first say that the box the Olevia is packaged in leaves a lot to be desired.  I ordered from Target, and it was delivered by UPS.  UPS rang the door bell and left.  By the time I got to the door, the delivery guy was gone.  I immediately noticed a huge, 6-inch hole punched in the side of it, which was no wonder given how thin the cardboard was.  Upon inspection (through the gaping hole), it appeared that the screen had a 2 inch scratch in it.  However, upon removing it from the package, it became apparent the scratch was in the protective film-not the screen itself.  They really should improve the box this thing is being shipped in!!!With that said, I am completely thrilled with my 537h.Pros:Skin tones look very natural.The built in speakers are more than adequate for even a fairly large room.Lots of inputs (10 total, including HDMI).HD quality is very nice and even SD quality is good, though obviously no where near as nice as HD.VERY reasonably priced.  Granted, this was my biggest reason for purchasing this set, and I'm happy I did.Channel autoprogram found several digital channels in addition to the normal analog, so depending on where you live, you can get some unencrypted HD channels without a subscription.1 year in-home warranty.Cons:Boot up time is a little annoying (10 - 15 seconds), though I've noticed if you hit the \"source\" key on the remote as soon as the Olevia splash screen is visible, you'll get an immediate picture.Also, it's a little annoying having to toggle through all 10 inputs.  If you overshoot the one you wanted by mistake, you have to do it again.  Also, I wish the television would remember what input it was on last time, rather than always switching to the \"tuner\" after being shut off.\"Power light\" seems counter-intuitive.  Bright blue LED is on when the tv is off, and turns on when you turn off the tv.  Yes, this means a normally dark room is illuminated in a faint blue hue.I'm giving it 5 stars, because I can't give it a 4.5.  The things I don't like are very small in comparison to the things I do.  Also, I can be a lot more forgiving given the incredible price point.  It really is a very good value.I would readily recommend this television to anyone wanting a mid performance unit at an entry level price.  There are better screens out there, but they cost twice as much.", "Date": "January 7, 2007"}, {"Title": "I agree, a great product!", "Author": "Larry VanDeSande", "ReviewID": "R1IVUH2N7TQ3Q0", "Overall": "4.0", "Content": "The Olevia 537H is a wonderful and inexpensive way to enter the world of HDTV on a budget and still get big rewards. We owned an RCA 27-inch cabinet model we bought in 1991 and repaired once about 2000. It was a great television when we bought it, a big improvement over what we'd owned before. It never quite came back to its glory after that repair, which took it out of our home for two weeks.In recent years, it simply got too old. I watch a lot of NFL on television and those little boxes in the upper left and right hand corners became about impossible to read. The scroll at the bottom of the page could be a challenge, too. I notice the colors were no longer exact, either. They turned pale and wayward when compared with the other television in our house. Since I am about to turn 57, I needed more help than just new glasses to resolve all this.I checked out a lot of TVs before buying this one, both online and by comparison watching in stores. The universal acclaim this model has received is justified. It has a wonderful picture (with one little problem), excellent definition, and beautiful colors. And we aren't even watching in high definition yet. I merely plugged the coaxial cable from Dish Network into the \"Antenna\" line, turned the TV to channel 60, and it played. I was unable to completely rig my remote to do everything, so we are burdened with having to use two remotes for the time being. I hope to resolve this when we switch to HD in a week or two.The one little problem I encounter it a light screen on the left quarter of the screen when the screen goes black. This does not affect the picture when it's in color, only in total black. I have no idea what this is and would like to hear from owners that may have experienced this. It is hardly a problem for me but I wonder if there's a way to eliminate this.As you can tell by reading this, I am a low-tech television viewer. I know the definition on this model is excellent but not as good as the best, and the LCD picture is great but no challenge to plasma. However, I bought my television from a national retailer for $694, making this one of the best buys I've had this year. Even if you pay $100 more than this, it's a great television for the price and delivers the goods in spades. I'm sure it will be a knockout when we commit to high definition, too.", "Date": "November 3, 2007"}, {"Title": "Great TV...a bear to set up", "Author": "Arren D. Dorman Jr. \"Specializing in cold har...", "ReviewID": "RZ3YTX4OU09Y4", "Overall": "4.0", "Content": "First of all...if you have the issue where you cannot change any items in a menu...do this:On the remote, hit the \"Menu\" button and then press the down arrow until you see \"Picture,\" then hit enter, now hit the down arrow until you see \"mode\" and hit enter again. You should then see \"power up\" displayed. Hit enter again to get to the setting choices where you can change the mode back to \"home\"If you are in showroom...the TV cannot be changed in any manner.I found the TV to actually have higher standards than most reviews stated.  The clarity is exceptional, it even picks up 13 HD stations via my antenna; my last tv picked up only 6.  As with most HDTV's the standard definition analog signals do not look as well as they do on the \"old\" sets.  However, the Olevia has a nice option where you can take out some of the choppiness in the blocking setting.I would definitely recommend the TV.  I got it for $749 and would not take it back for $800.", "Date": "April 7, 2007"}, {"Title": "Great deal for your money.  But, beware of the sound quality.", "Author": "Ruben Navarro Jr.", "ReviewID": "R3GP9W3Y61D31I", "Overall": "4.0", "Content": "I paid $699 for this set and I have to admit, even though I ought this for my bedroom, it can be a main room TV with it's picture quality.  For an LCD, the HD channels come in sparkling.  As for the SD channels, they look ok.  But, you can tweak your setting a little (noise reduction) and the channels come in quite well.  The rotary menu takes a little bit to get used to but is actually quite simple to navigate once you get the hang of it.  It has more than enough composite and component inputs.  However, it has only 1 HDMI input.  No DVI input but somewhat makes up for it with SGVA input.I do have to complain about the sound quality.  The on board speakers are pretty sorry to be nice.  If you run a home theater system you will be fine.  Otherwise you should turn the bass down to the mid level range and crank up the treble to about 70%.  It sounds ok then.Again, for the money, you get a very good TV with some mediocre sound.", "Date": "May 28, 2007"}, {"Title": "Love it!!", "Author": "Robert A. Casey", "ReviewID": "R8IRPICLRNRQC", "Overall": "5.0", "Content": "Got a great price on this TV, easy setup and great picture.  TV looks good and is a quality unit.  I also have a 50\" Toshiba HDTV and the picture on the Olevia is as good if not better.  Minor complaint, you need to scroll through the various inputs to get to the one you want, no direct access.  Would buy again.", "Date": "March 8, 2007"}, {"Title": "Great for the $$$ but Still a Bit of a ???", "Author": "Bondiablo", "ReviewID": "R2Y5364H3042N4", "Overall": "4.0", "Content": "The picture quality of this TV is excellent, much better than most LCDs I've seen and close to the best, thanks to the LG panel and MTK processor. The factory default settings look very good and need only a little tweaking. SD channels look as good as I've seen on any LCD, especially with noise reduction on. The sound is decent, for built in speakers, it has a really good selection of inputs, though another HDMI would be nice and overall it's a good looking set. It does have a few quirks, takes 15 seconds to power up, 2 seconds to change channels, can only scroll through inputs in one direction (no going back if you pass the one you want), limited PIP options (eg TV can only be paired with HDMI), manual only on CD and a small but very bright blue LED next to the power button that stays on when the TV is off. However I still can't shake a general feeling of distrust for this company. Their customer and tech support seem either unwilling or unable to answer questions about their products, their 7 dead pixel policy was pretty standard a couple years ago but a bit wanting today and although this model claims to offer a 1 year in home warranty I have heard from others that they still require you to send the TV in to them at your expense if they decide to replace rather than repair it. For those trying to find a universal remote that works with this TV, I have a 2 year old One For All 10820 that does work with it after being upgraded. Their newer remotes should already have the codes but if not, they do have models now that can be upgraded over the phone.", "Date": "April 2, 2007"}, {"Title": "Pleased with my purchase", "Author": "A O Hickman \"AOH\"", "ReviewID": "R25GR41WTWCLSZ", "Overall": "5.0", "Content": "I had read the reviews in Consumer Reports and compared the specs with other comparable manufacturers. So I was prepared to receive a technically excellant product with a very poor operators manual.  I was not disappointed.  The product was packaged well for shipping and arrived in good shape.  Unpacking and setting up was reasonably easy to do.  Some knowledge of cabling is required.  The manual and setup instructions are not written for the novice.  Locating the button on the remote for switching between input sources was the more frustrating part and took several minutes by trial and error to determine which button to press.  Once the setup was completed the system has worked as expected.  In my opinion, it is an excellant product for the money.", "Date": "May 12, 2007"}, {"Title": "Excellent TV for the Price", "Author": "R. James", "ReviewID": "R1NHYZYFNOBWXP", "Overall": "5.0", "Content": "I had researched for a long time before I finally made my purchase. The final reasons for this purchase was the Consumer Reports Best Buy recommendation for the larger 42\" version of this Olevia set. I had debated about purchasing a TV with 1080 but decided against doing so when I read that in a set this size that the naked eye could not tell the difference between 1080 and 720. I needed the 37\" set due to the entertainment center we already owned, which cost 2.5 times the price of the TV, so it wasn't leaving the house. The TV opening would have allowed a 40\" but I am glad I stayed with the 37\" because the set-up would have been difficult if not impossible with a 40\" because of the need to turn the set at angles. I compared the two TVs at the Olevia site and the only difference was the speakers. I also saw the Olevia at a friend's house and was impressed with the quality. The best price was found through Amazon.com. I placed my order on a Friday evening and the set was delivered by UPS in perfect condition on Wednesday. The set-up of the TV was simple. The only problem I experienced was with the remote. Here's the good news: I sent an email to tech support and quickly I had an answer that was simple to follow and the remote worked perfectly the same evening that I set-up the TV. Even though I use the surround sound through our stereo, I actually was satisfied with the sound through the TV speakers. A small problem is that the Time Warner Cable Box remote control does not operate the TV, so we do have to use multiple remotes, but that's only a minor inconvenience. Our family has been very pleased with the TV. I would highly recommend this TV to anyone purchasing this size TV.", "Date": "March 26, 2007"}, {"Title": "Nice TV", "Author": "Penny \"internet buyer\"", "ReviewID": "R2P444L86YE4UK", "Overall": "4.0", "Content": "Very nice TV.  I especially like the picture.  I went to many stores to review TVs because I was especially interested in having a good picture.  So, I would rate the picture 8 on a scale of 1 to 10.  It is much better than other discount TVs I saw at Sam's Club.  I also went to Best Buy, Circuit City and looked at the excellent Samsung and Panasonic TVs.This TV picture is almost as good, I would say.I had a few problems with the remote, so I contacted customer service for Syntax Olevia via e-mail.  They responded promptly.  Telephone service is very slow.  Another time I was on hold for about 10 minutes, but they did answer, and they helped me with my problem.I did a lot of research (about two months of waiting and watching) before I made this purchase.  For the money, it is an absolutely excellent buy.  I weighed options (more inputs, the highest pixels of 1080) when I considered spending more.  But I guess I read reviews that said when high def. is coming through the eye can't discern much of a difference between the 1080 and 768.  So, for the price I just don't think you can go wrong.  I am very happy.", "Date": "January 11, 2007"}, {"Title": "Good Picture, but still needs refinement", "Author": "B. Ankrom \"Skeptic\"", "ReviewID": "R1RZC1HL4DQ7EW", "Overall": "4.0", "Content": "I went through many LCDs, looking and comparing, and stopped on the 537H from Olevia.  Since there were none in my area to look at (and compare screen sharpness, contrast, etc. to others), I was taking a blind shot in the dark to buy it over the internet.  But, from what others were praising about on the features of the 537H on the internet....I took a leap of faith.I'll do my review from a 'newbie' standpoint on review.  The more experienced can sift through it for what they want.The 537H comes in a cardboard box that's found wanting of more sturdiness.  I mean, we're talking about many hundreds of dollars sitting inside of the box.  One wrong hard turn from the UPS/Fedex/whoever delivery guy can send the TV falling into a more stout package on the truck.  Just remember that with newegg's \"bulk shipment\" policy (if you're buying from them).  Mine, thankfully, came undamaged, box and all.Everything was with the TV (remote/remote instructions/quick setup of wires/CD...CD?  What?).  The only problem with the accesories is the fact that the CD contains the ENTIRE instruction manual....and it's only used by a computer.  This is not a playable DVD by a DVD player.  So, remember to have a computer to use so you can get to those valuable instructions in your first days of uncertainty with the TV.  If you don't own a computer, that's a big negative against Olevia.I get my TV all squared away with the wiring hookup and turn it on, hoping that setting up over-the-air digital channels wouldn't be a hard thing to do.  Wrong.  First off, the TV has a great picture.  No doubt.  It certainly competes with the higher-priced/similarly-sized products in picture quality.  My DVD movies haven't looked cleaner/sharper/brighter ever on a component wire hookup.  But......back to the tuner features.  The set automatically started giving me fits with the Closed Captioning.  Why was it turned on?  Who knows?  The big question was \"why won't it turn off?\".  The OSD is about as 'friendly' (Olevia's opinion, not mine) as a rabid dog frothing at the mouth.  First, it is not a list menu, but a 'rolling' menu which can be confusing to some people.  Secondly, the menu has too many choices that could be put under more generalized sections.  And last, you can never be sure that the TV has taken your 'selection' of something on the menu.  No blinking, no beeping, no confirmation at all.  Another negative to add.The remote, however, was refreshingly nice.  Many people in reviews complain that the TV isn't on their universal remote's code list, and therefore can't be used by it.  Soooooo, why not try to use Olevia's?  Olevia's universal remote has an extensive list of components it can control, along with SEVEN (that's right, SEVEN) separate component control...not counting the TV controlling ability.  The remote even had the code to my Yamaha home theater amplifier, which was quite suprising and pleasing to me.  The backlight control is strong and controls can be easily seen in dark rooms.  Sadly, the remote also could use some extra thought.  It does have 'hotkeys' to help you take care of some TV controls, but only a 'Funtion' key to move the control ability down the list of components it can control.  No direct jump to, say, DVD to TV or AUDIO to TV.  The same goes for the source.  If you want to go from TUNER to COMPONENT 1, you have to key your way through the list on the TV until you get to the source signal you want.  A good leap forward would be hotkeys for both of these problems, but they're not on this remote.All in all, you just can't beat the price for the quality picture the Olevia 537H exudes.  However, for many novice buyers of TVs, this LCD will be a challenge to master.I give this set four stars, mainly for picture quality....but it almost fell to three because of the inconvienent features and unfriendly OSD.  As for me, it will be quite some time (and never for any of my relations trying to use it during get-togethers) before I'm comfortable in using the TV and remote.", "Date": "February 15, 2007"}, {"Title": "Very Happy with Olevia 37\" LCD HDTV", "Author": "Chuck Gilbert", "ReviewID": "RYXVSK1WPHUKU", "Overall": "5.0", "Content": "I have read lots of reviews & expected a great picture and all of the quirks that this has (bright blue light when the TV is Off; 15 seconds to start; less than immediate channel changing; unusual menu; manual on CD only [not printed]). All of those things are true.The picture is spectacular. The first time we turned it on, the AllStar (baseball) game was on. I'm not really a baseball fan, but that was fantastic! We have an indoor powered antenna (~$30), which we have used for several years (we try not to watch enough TV to make cable worth it). There are a lot more channels available digitally and a lot more diversity of programming (music videos, southpark, etc. all for free). If you do have standard cable (we got the special sign-up deal for a few months), expect to be able to get a lot more channels on this than with an old \"standard TV\", and without paying for \"digital\". Wahoo! However, most cable channels are NOT HDTV :(Olevia seems to have fixed previous problems with settings, I only changed one feature (picture, noise reduction, high; instead of factory pre-set of medium). I never felt the need to consult the manual (my laptop is always on, so having it on CD is no problem).  The sound is fine (anyone wanting good sound will go through a stereo) and it also has more inputs than I expected.The one unexpected thing about it is that it does take about 5 seconds between the time you push the power button (on the remote or TV) and the time ANYTHING happens (blue light goes off). However, after a week, even my 3 year old has learned to count to 5 to see if the light goes off before pushing the button again. Everything else has been covered in previous reviews.If you get your from Target, sign up for the red card to take 10% off the purchase price & you can get this in your house for less than $800. You won't regret it.", "Date": "July 21, 2007"}, {"Title": "Solid choice in the budget LCD market", "Author": "Maxwell J. Lamouria", "ReviewID": "R1LQVXGTJNXZ8V", "Overall": "4.0", "Content": "This is probably the first Olevia LCD that doesn't have any glaring problems.  The 537h features the new MTK video processor chip.  It does a great job of upconverting standard def. material.  I would strongly recommend buying the 537h over the cheaper Olevia models just for this upgrade.  The cheaper pixelworks chip doesn't do nearly as good of a job. HD material looks great.  Color reproduction in particular is superb.  The 537h also features RGB color control, which is uncommon at this price.The TV itself appears to be well constructed, although the case itself is a little deeper than some.  Connections for VGA and HDMI are placed facing down, which is nice.  Component, S-video and composite face towards the side of the TV which can create a problem when trying to route wiring.  One thing I have noticed is that the TV puts off a lot of heat on the backside.  I wouldn't recommend putting the TV in a space that doesn't have a lot of ventilation.Controlling the TV is pretty straight forward.  Setup functions are accessible through a convenient rotating menu.  The only gripe I have is that with so many inputs, it does take a second to cycle through all of them to get to the input you want.  It would be nice if the TV could remember inputs that are actually used, so you could more easily switch between them.One area where the cost cutting of the 537h does show is in color/tint/contrast/brightness adjustment.  The \"steps\" between each adjustment are very course, making it difficult to fine tune each of these settings.  It is very apparent when using test patterns on a calibration disc like DVE.  While I was able to achieve a very pleasing picture, I was not able to calibrate the TV spot-on.Audio on the TV is only OK.  The speakers are adequate, but don't expect room filling sound by any means.  I do get occasional \"popping\" on all inputs (which seems to be common on this TV.)  Its not a huge problem, but it is a little annoying since the \"pop\" is much louder than the volume that the TV is set at.  I would recommend using external speakers to over come this problem.  The TV does have a volume controlled headphone jack which is nice, but they decided to put it on the backside of the TV which is a little strange.My only other caveat is that the TV does take a really long time to start-up.  You can cut that time down by pressing the volume +/- button when the \"Olevia\" start up screen appears, but it seems like an unnecessary step. The Fluorescent backlight also needs a minute to \"warm up\" to its set color temperature.  When you first turn on the TV, all the colors are slightly off.Overall, I am very pleased with the TV.  It isn't perfect, but I don't expect that at this price point.  Picture quality is where this TV excels and really that is all I care about in a TV.  The problems are acceptable and don't make the TV difficult to live with.", "Date": "July 6, 2007"}, {"Title": "Great TV (when it works)", "Author": "Cyber Steve", "ReviewID": "R2KJBBNPEYUI9N", "Overall": "5.0", "Content": "I bought the Olevia 37\" LCD HDTV to replace an old 25\" standard television that broke down. The TV was delivered in perfect condition two days after I ordered it from Beach Camera. I am delighted with the purchase. The TV is attractive, provides plenty of connection options, is easy to setup, and produces a great picture.Some people have complained about the on-screen menu system. The menu system has the advantage of taking up very little screen space, so you can make adjustments while continuing to watch a program. The disadvantage is that, because so little of the screen is used, you have to navigate through a few layers of menu categories, which can be tedious. Settings rarely need to be changed, however, and any decent programmable remote will allow you to make any type of configuration change with the press of a single button.The image, sound and price of this TV cannot be beat. Buy it!Update: After about 11 months, the TV turned itself off and wouldn't come back on. Pressing the power button on the TV or remote had no effect. Syntax-Brillian Customer Service were quick to offer a replacement. The replacement, which is a refurbished TV, arrived after approximately one month. Although trying to communicate with Syntax-Brillian customer service can be frustrating, they honor their one year warranty. If you search the web, you will find many examples of customers who had their Olevia TVs fail after 6 to 24 months. Now that I have a working version again, I love this TV. I'm worried, however, that it will not be long before this refurbished version breaks down.", "Date": "May 26, 2007"}, {"Title": "A few bumps but worked out fine", "Author": "Twain Game \"ckpishot\"", "ReviewID": "R32YB22Z0GW2XG", "Overall": "4.0", "Content": "I got the TV and it didn't turn on. I called TigerDirect. They paid to ship it back and sent me another one with no shipping charge. The new one worked and turned on fine. there customer service it great. i bought it at 699 and it went on sale for 649 within 3 days and they are giving me the discount.Picture quality is great. The only negative is that it takes a solid 5-6 seconds from when you hit the 'on' button for the tv to actually turn on. set-up is really easy with the dvd and cable box. looks daunting but really just plugging in all in a row on the back.People seem not to like the 'wheel' set-up method on the screen for adjusting the color/tint/contrast, etc but I went to a store and actually was playing around with this feature. not to bad.would highly recommend at the price of 649 for a 37 inch with great quality.", "Date": "May 25, 2007"}, {"Title": "Gamerman", "Author": "S. Cain", "ReviewID": "R2OLVKWMAF48FM", "Overall": "5.0", "Content": "I was looking for a bargain-priced LCD and found this one. Just 6 months ago, you woud find this model at nearly twice the price! The move to 1080p has really brought down the price of the 720p LCD TVs. Now is the time to snatch them up before they are phased out.The 37\" Olevia is great. I've had mine for a few days now and am very pleased. The 360 games look beautiful! You can't go wrong with this buy...unless you really need your instruction manual on paper. Who reads the instructions?", "Date": "March 9, 2007"}, {"Title": "Great Buy", "Author": "JamesH", "ReviewID": "R2JDIJWPO3PB0M", "Overall": "5.0", "Content": "Purchased this set after reading the overwhelmingly positive reviews for this product online.  Thankfully, the reviews were accurate.For the price, this TV has an incredible picture.  I used this set to replace an old 27\" TV that used composite connections.  With a progressive scan DVD player and HDMI connection, the picture is unbelievable.  Because my Tivo box is a bit dated, had to use a S-video connection for my HD cable package.  Still, even with S-video the images are far better than with standard TV on a standard set.All of the coments about the benefits of the numerous input/output ports on this TV are accurate.  The menu is a bit complicated, but can be figured out in a day or so.  The speakers are fine, but when plugged into a home theater (we use a Panasonic 1200W surround), this TV is outstanding.  The remote may not be capable of offering a single \"universal\" remote, it can accomplish a lot of the most common functions needed (volume on home audio system, Tivo channel control, dvd player \"main\" functions)As noted in several other reviews, the box it ships in leaves a lot to be desired, but mine came through UPS relatively unscathed.  Also, the reviews commenting on this set's 15 second start up time are accurate.  When you press the \"on\" button, be prepared to wait for the set to come on.  After that, it is smooth sailing.", "Date": "February 16, 2007"}, {"Title": "Great TV for the price", "Author": "yoyodyne", "ReviewID": "R2O4FP8WXT45W8", "Overall": "4.0", "Content": "Bought this TV on Black Friday and got a very good deal. For the price it's a 5-star TV. At a higher price it's a 4-star.Pros:Cheap, picture is very good on HD channels, has QAM and ATSC/NTSC tuner, HDMI input, sound is great, can update firmware yourself, includes a 1-year in home warranty (for now), works as should and is overall a very nice LCD TV.Cons:Not as great of a picture on SD TV (that's natural), remote is good but not always intuitive, PIP doesn't work that well (limited options for each picture), seems kind of thick compared to other LCDs, menu system is kind of funky but not that bad, have to cycle through all inputs to get to the one you wantI'm using it with an XBox 360 via component as well as a HD cable box and everything looks fantastic HD wise. You get grey bars on the side on the standard channels which is bothersome but normal. QAM didn't work great for me (did pick up a few channels) but that may be the local cable company not cooperating either.All in all a great deal if you get it at a good price. And IMO 37\" is plenty big enough for most small (10x12) rooms.", "Date": "December 14, 2006"}, {"Title": "Terrible, You Get What You Pay For", "Author": "Chris", "ReviewID": "R2SW5ZRCOYHKVY", "Overall": "1.0", "Content": "I'm sure some people have good experiences with Olevia but I definitely didn't.  My only advice is read around for user opinions first before you buy an Olevia and take a look at their website and you will see that online tech support is nonexistent.  Try even calling their tech support # and you will see how unresponsive they are.Seriously, you get what you pay for.  I've had my Olevia for over a year and have had problems after owning it for 2 months.  My problem like most people is that it won't turn on.  Even if I dont watch it for a while, it won't work.  The only solution is unplugging the power cable for about 3-4 hours and plugging it back in, then it starts working again, weird.The only good thing about this TV is the price, and that's if you get 5 solid years out of it.  Other than that, video quality is poor (much worse than a Aquos or Sony), changing channels is slow and annoying, reliability is terrible, and tech support is terrible. I've cut my losses with this and hopefully you won't have to make the same mistake.", "Date": "February 2, 2008"}, {"Title": "Good TV, bad everything else.", "Author": "Eric S. Olstad", "ReviewID": "RICNVEF2BP7GM", "Overall": "4.0", "Content": "I'm definitely pleased with much of this TV: The picture is excellent, the refresh rate is good for games, the speakers are surprisingly decent, and the connections on the back are more than adequate.  Overall, it's a great TV and a great deal.  What is lacking is this TV is, as some have already said, the menu system.  It is absolutely atrocious.  I have 2 Olevia TVs and both have the same crappy menu.  I can name 100 ways in which it could be improved, but it's not worth it.  In my opinion, this is not a deal breaker, and this is still a great TV.  Only 2 other problems:  The blue LED standby button is way too bright, and when you press power, the only feedback that the thing is turning on is that the LED goes off.  You have to wait like 15-20 seconds before the backlight turns on.  Strange and confusing...", "Date": "September 28, 2007"}, {"Title": "Power Problems Some People Have", "Author": "Kenneth E. Epperson \"Kenneth E. Epperson\"", "ReviewID": "R3JXL4OUVUQ8PH", "Overall": "5.0", "Content": "I have two Olevia t.v.s 37 - and the 42. the problem you are describing is due to the power protection circuits making sure your tv is protected from a power surge (like when turning it on for example) and while your tv may be a little sensitive to the power spike when first trying to initialize the set, it is actually protecting the t.v. - there is a reset button on the back of each set - you can easily reach it - but it is the same color as the back of the set and is very hard to see at first until you know where it is. - it is near the power cord but recessed - if you just flip the reset button your olevia will power right up!... I first experienced this issue on my 37inch when I disconnected the set and moved it from the bedroom to the living room - 20 feet away, and when the power was first applied it was as if the set was broken, but it was not - upon closer inspection I found the reset rocker switch, flipped it back on and it worked perfectly again. I suspect this is a common issue after reading some of the more negative reviews, but i noticed no one mentoned the \"reset\" button on the back of each Olevia set.Note: I also use a regulated power supply now and have seen the incoming voltage in my area vary from 115 volts to 124 volts.Ken Of Gulf Shores", "Date": "February 5, 2010"}, {"Title": "Grrrrrrreat!", "Author": "A. Wright \"yetums\"", "ReviewID": "R1SI5DLCBDVKH9", "Overall": "5.0", "Content": "What a deal! 37 inches for under a grand? You can't beat that. It has a great picture and sound quality. It's not 1080p but 720p is pretty darn good. xbox 360 looks frickin tight on here. Make sure you use HDMI. One of the better deals around. Don't miss.", "Date": "March 6, 2007"}, {"Title": "Olevia 437- the truth", "Author": "Paul Deleeuw \"pdl1\"", "ReviewID": "RQ3MGKQPH2TRV", "Overall": "4.0", "Content": "Out of the box it was not smart enough to find channel 3 from my cable box. Once set the picture was quite good with regular cable, excellent with HD. The sound was awful. Cheapest speakers imaginable. Luckily it has an earphone jack (on the back). Plug in good PC speakers and things are much better. Poor, flimsy remote. Looks like all the money went into the picture. But for $669, that is not a bad deal.", "Date": "May 6, 2007"}, {"Title": "OLEVIA FILED FOR BANKRUPTCY!!!", "Author": "A. Hyde", "ReviewID": "R3HWCWQDLZKZ2B", "Overall": "1.0", "Content": "I saw in a local Wal-Mart ad that they were featuring a 32\" TV of another brand for $550.  In the aisle in front of the electronics department was this television for $500.  A larger screen for $50 less?  How could I not?  When the cashier was ringing me up, he asked if I wanted to buy the extended warranty on it.  I believe this is the first time I've ever bought the extended warranty on it and, at the moment, I'm relieved that I did.  I have now had the TV for one year.  About six weeks ago, my TV turned off on its own...I turned it back on.  About 30 minutes later, it did the same thing...turned it back on.  Ever since, it does the same thing.  Occasionally it will turn off and turn back on about 5 seconds later only to show a dropped cable signal.  I contacted Olevia's support line through their website and was informed that I should try to take certain steps to ensure that there was not a problem with the power supply.  The representative then told me that otherwise it would be a problem with the mother board and that Olevia was now bankrupt and could not honor the manufacturer's warranty as they had now been bought out and the warranty was voided.  I then informed the rep that I bought the extended warranty through Wal-Mart and he told me that I would have to wait until the manufacturer's warranty (....that was now voided?) ran out to try to get it repaired through Wal-Mart.  I am going through the steps to do so.  If you find a television through this company and you just can't pass up the price, BUY THE EXTENDED WARRANTY!!!!", "Date": "June 15, 2009"}, {"Title": "Junk", "Author": "Tim Hartman \"Tim\"", "ReviewID": "R3LTTS5DIG1FUD", "Overall": "1.0", "Content": "Do not buy an Olevia TV. I had this TV for 14 months and the HDMI input quit working. No TV repair companies will touch an Olevia TV, I called at least five. They all told me Olevia TV's are what they refer to as 'throw away's'. If they break after the warranty is up, just throw it away.  It is out of warranty, so I am out of luck. This seems to be a recurring problem with Olevia TV's. Customer service department is the worst I've ever seen, call ten times and get ten different answers.", "Date": "January 21, 2009"}, {"Title": "Horrible Customer Service", "Author": "C. Regan", "ReviewID": "R2DW6G257PZBCG", "Overall": "1.0", "Content": "Okay, first off let me say that this TV (when working) has good sound and picture. However, this TV suddenly stopped working about a month after buying it. I called their customer service line since my TV was under warranty, so no big deal right? Wrong. They tell me that they dont have any local repair shops contracted for them and that I will have to pay for shipping to send the TV back to them. Well, my total shipping bill with packaging and the TV weight came to $160 total. Bottom line, when your TV is working, it's a good product. But if you have any problems with it, best of luck to you... because you will get no help from them - period. It's just not worth it, stay away from Olevia.", "Date": "January 5, 2009"}, {"Title": "You get what you pay for...", "Author": "M. Meinhardt", "ReviewID": "R1W68O7EY848T8", "Overall": "1.0", "Content": "I've owned this TV for right at 2 years and it started having significant problems not much after the 1 year warranty was up.  The red in the picture has gotten progressively worse to the point that no amount of tuning the color's gives what I would call a good picture.  In the last couple weeks, the unit has begun to do two things that pretty much put a fork in it.  First it will randomly shut off for no apparent reason.  That's not the worst though, it also will randomly go to a blue screen and emit a shrill noise at max volume.  That'll wake you up.  Anyway, if I had to do it again, I would have saved my $1000.", "Date": "December 28, 2008"}, {"Title": "Very Good but!", "Author": "Diane K.", "ReviewID": "RO5Q399IQDZB8", "Overall": "3.0", "Content": "The Olevia 537H delivers very good sound and picture. This lives up to the Consumer Reports high score. Unfortunately Olevia 537H lacks the  code number necessary to integrate the volume control with the cable TV control. As a result the cable control runs everything except sound so I must use the Olevia remote control in addition to the cable remote.This is an inconvenient product deficiency. If I had known of it in advance I would have chosen another product, e.g. Toshiba 37\".", "Date": "March 12, 2008"}, {"Title": "A quirky but decent TV", "Author": "A. J. Bloom \"BW Arts\"", "ReviewID": "R20H2ARLP9AIQ0", "Overall": "4.0", "Content": "Largely on the basis on a high Consumer Reports recommendation, I bought our set several months ago.The picture quality has generally been excellent in all modes, although I consistently use the screen \"cropping\" setting to get rid of annoying lines at the edges of the screen on a few channels (which may be due to the cable feed we receive).The sound quality is also good, although the lowest volume setting could be lower (for watching the TV very quietly at night). Sometimes when I have the volume set at the lowest level and then hit the mute button, getting out of the mute mode results in no sound at all until I tweak the volume control again.The phone customer service rots. Over several calls, I found it next to impossible to connect with somebody who spoke decent enough English to really understand. And speaking of English, some of the menus and on-screen messages include insultingly poor grammar (e.g., \"not exist\" for a channel selection with no signal, \"not rating\" for an unrated program, etc.); the customer service people had zero interest in hearing about this. The instruction manual is difficult to understand, with no meaningful explanation for what many of the functions and settings supposedly do. Customer service can't explain things any better either. To get around the problem of no printed manual, we printed out the entire PDF file (about 40 pages worth) and keep the printout near the TV.Another quirk: When I switch channels (which can take several long seconds), the program name is often wrong or filled with garbage characters. And even though I have programmed the TV to skip certain channels, sometimes they reappear in the active channel lineup anyway. And yesterday, the \"favorites\" button refused to work after one of the channels had been shifted to a different frequency by my cable operator.On the positive side, the TV is an energy sipper. When off, it consumes 1-2 watts of energy; I measured it. When powered on, it consumes about 135 watts on the \"dark room\" brightness setting and 185 watts on the \"bright room\" setting. In the \"dark room\" setting, the TV emits a faint hum. BTW, for those of you bothered by the bright blue power off light, a little piece of black tape over most of the light (i.e., top two thirds) works wonders! Of course, that doesn't stop the TV from making metallic expansion and contraction sounds (sort of like what baseboard hot water heat sounds like) when it's powered on or off.", "Date": "December 4, 2007"}, {"Title": "Issues", "Author": "Amazon Customer \"earthseagames\"", "ReviewID": "R3HJHPTZP4IMM3", "Overall": "2.0", "Content": "Where is the QA department?  Looked great at first.  We hooked it up in our apartment and enjoyed good movies.  We then threw away the box.  It always seems the day after you dispose of the box, that the problems kick in.  First: A vertical green line seems to appear after 15 minutes of the set being turned on.  The line is to the right of center and stretches from the top to the bottom of the screen.  Second: The audio 'pops' loudly every few minutes.  Most people play their audio through a separate receiver and would never notice the poor amplification unit in the TV.  Unfortunately, I am not one of those people.  I guess the thing is still on warranty, so one of these days I will get around to reporting the problem to Amazon, the fulfiller or to Olevia.  However, I am one of those busy people who doesn't have time for things that don't work out of the box.  I am sure that if these two issues were resolved, I would be very happy with this unit, but like I said, who has the time?", "Date": "July 23, 2007"}, {"Title": "Malfunctioning after three years", "Author": "Caleb Murdock", "ReviewID": "R1JWTYGP2GW1C9", "Overall": "1.0", "Content": "My 537H television worked fine for about three years and then started to malfunction.  It turns itself off two or three times a day, and it won't turn back on unless it is unplugged and then plugged in again.  My reading on the internet has revealed that Olevia TVs have power-supply problems, and that's what this would seem to be.  Some Olevia TVs turn themselves off and then won't come back on again.", "Date": "April 22, 2012"}, {"Title": "Long-term Review", "Author": "Lee A.", "ReviewID": "RE0QKQU5PDCM4", "Overall": "4.0", "Content": "I purchased a recertified (yup, not even new) OLEVIA 537H back in 2007 to use in my bedroom. There were several reasons I chose this TV:- Price (at $600 it was a GREAT bargain for a 36\"+ 720p TV)- TONS of inputs/outputs (exactly what I needed)- Good clarity/resolution & could be used as a PC monitor- Good reviews stating that recertified units could have actually been brand new for all they knew, and that the performance was great, aside from design flaws that the brand new ones have (which didn't matter to me).- I needed an HDTV for my XBOX 360. A low-def and 4:3 ratio screen was extremely frustrating when there was a clear advantage (har har) to a widscreen HD picture.- It needed to be lightweight and able to sit/fit on a piece of wood only 1.5ft deep and 2\"  thick, which was supported only on the ends by 80lb floor cabinet speakers, so therefore it had to be an LCD/Plasma TV.I had this set up in my bedroom and was using it for:- Secondary/Primary PC Monitor for games/Hulu- XBOX 360 / HD DVD player (yeah...)- XBOX- Denon DVD player w/HDMI-upscaler- low-def DirecTV satellite receiverSo, here's my experience from owning one since 2007.Pros:- Reliable (for the most part)- Nice sharp picture (with HD inputs)- Good brightness/contrast- Visible in daytime w/good viewing angle- TONS of inputs/outputs- Very good price (at the time...)- Color/sync can be calibrated with a good amount of options- PICTURE IN PICTURE! I did not know how important this feature was to me on an HDTV until I had an HDTV without this functionality.Cons:- Awful quality speakers that can't be physically removed (not much of a con for me, aside from them being non-removable)- Fairly cheap looking black plastic frame/speaker covers- Awkward menus- Bright blue power LED when it is off (it's a con for me, may not be if it was in a living room as intended, I just blocked it with tape)- Noticed some horizontal image \"tearing\" (this is when the image splits horizontally such as during quick panning movements of the camera). Particularly annoying when gaming with FPS games, otherwise non-important for regular viewing.- When I received it, everything worked fine out of the box, but occasionally when it was jarred/shaken, the picture would go black until I gave it the Fonz (read: hit the frame until the picture returned, usually on the first try). No big deal, I thought. Until I fine-tuned my surround sound system with two 15\" bass drivers connected to a quality amplifier and a separate powered 8\" driver. Anyways, after three years it got to the point where I smacked the frame and the image didn't come back. I figured from the symptoms that something was loose inside, so I unplugged it, made sure the power was drained, laid it flat on my bed, and disassembled the back side. There was a wire that had become disconnected. I plugged it back in, screwed everything back together, and it's been working fine since.Overall, I am happy with this unit - as it has survived this whole time (it surely has several thousand hours of use), has the features I was looking for, great image quality and viewing angle, and at a price that I could afford... Nowadays, it is being used primarily as a PC monitor.However, there are far better TV's out now for the same price. I honestly can't recommend that anybody buy this, considering the new technology that has been put on the market in the past 5 years that this TV has been out.", "Date": "March 29, 2011"}, {"Title": "I Rate it High...But!", "Author": "Billy Jack \"B.J.\"", "ReviewID": "RPEA7KPCWI84N", "Overall": "5.0", "Content": "I bought this in December 2007.  Works real well....BUTthey went bankrupt, chapter 11 July 2008!  So if you buy one you have no warranty as warranties are a liability and they are removed with bankruptcy! I bought an extended warranty like a jerk and I am out that dough.  All I can do is watch and enjoy what I have and if it fails, who knows what to do.  Parts may not be available, but thay have been bought out by a company calling themselves; \"Olevia International Group.\"I do not know IF they will honor warranties from the original defunct company.  Amazon should post the fact that \"Olevia\" is chapter 11.Unsettled times!", "Date": "January 26, 2009"}, {"Title": "Best price on the web", "Author": "John Murphy", "ReviewID": "R26VHWZGHXDUO3", "Overall": "5.0", "Content": "I decided on the Olevia 537 because I subscribe to Consumer Reports and that model had the best review in the price range I could afford.The Amazon price was easily the cheapest I found when searching the web.", "Date": "April 20, 2008"}, {"Title": "So far so good!", "Author": "K. Hanson \"K. Hanson\"", "ReviewID": "R1GSWR4K48D4GI", "Overall": "5.0", "Content": "I have only had this tv for a few days and I am cautiously optimistic.  Great picture and sound.  Consumer Reports rated this tv very high so that is why I chose it - however, they could not comment on its reliability (repair rates) because Olevia is too new.  They did say though that the reliability looked promising.  I hope they're right.  For now I will just enjoy its fantastic picture.  Oh, and I can't believe that people are annoyed by the tiny blue light that stays on when the tv is off.  It's like 1/2\" big!  It is there so you can find the power button in a dark room - duh.  As suggested by another, if that tiny little blue light really bugs you so bad, cover it with electrical tape.", "Date": "April 14, 2008"}, {"Title": "I do not recommend this TV", "Author": "John Bogard", "ReviewID": "RWXJ4NI6VTBSQ", "Overall": "1.0", "Content": "Main picture board needs replacing after 18 months costing at least $350, or about half the cost of the TV.  Customer support and warranty is non existent after first year.", "Date": "March 25, 2008"}, {"Title": "Great TV for the Price", "Author": "A. Seidler", "ReviewID": "R1ZHTTJPC722I1", "Overall": "4.0", "Content": "I purchased this TV at Circuit City and I have been very pleased with my purchase.The \"Menu\" is a really a cube that you flip around to get to different categories but after 10 seconds if common sense is around anywhere you will understand it.The annoying part of the TV is the bright blue LED that is on when you turn the set off but you -CAN- turn this off unlike in another review that that is posted here!I personally like have this set sitting on my desk next to my Planar WS231 LCD computer monitor. I do enjoy being able to switch from VGA (my computer), to HDMI (my ps3) and to tuner with much ease if I wish to watch a TV show.The sound quality is extremely nice!  They did an excellent job blending in the Source, vol, ch,menu, and power buttons on the set! Ever have the moment where you had your set turned to S-Video and you lost your remote and you needed to catch a show on another channel in a hurry... the SOURCE button is also on the front of the TV!", "Date": "February 25, 2008"}, {"Title": "Great Picture for a low Budget", "Author": "K. McDowell", "ReviewID": "R35JT1NXEORX7A", "Overall": "4.0", "Content": "I am very impressed with the Olevia TV set so far. I have been scouring the internet for a couple weeks looking at reviews for low end LCD TVs and finally decided on the Olevia. I had been looking at the Vizio,Sanyo,Emerson and Olevia mostly because of their low prices. The Emerson didn't seem to have to many enthusiastic reviews so it got ruled out early. Both the Sanyo and Vizio had pretty good reviews for the most part more so the Sanyo. The one thing that finally tipped me over to the Olevia was the Contrast ratio. The Vizio only had a 1000:1 contrast,the Sanyo 1500:1 but the Olevia has a 1600:1 contrast ratio. And it really makes the difference. I watched my Time warner HD service on it last night(which really sux,I wanna switch to DirecTv many many more HD choices). Anyway I was really blown away by the picture. I can't speak for the TVs speakers as I have it connected to a HTIB. But I am really impressed with this set. For some reason I can't get the website to allow me to register the set online but thats no big deal I'll just have to call it in. I can't wait to get an upconvert DVD player and watch Star Wars on this baby :)", "Date": "January 17, 2008"}, {"Title": "Excellent value for the money", "Author": "Alaska Computer Tech", "ReviewID": "R2PAQQKTN6K3CM", "Overall": "5.0", "Content": "Rght before Christmas we originally bought a Westinghouse 27\" lcdtv and it was very nice. It had a really bright picture. Unfortunately, it replaced a 27' square Sony and because we use the old 'square' picture technology here in Alaska, the picture on the Westinghouse looked more like a 23\" tv. So the wife said back it goes.I returned the Westinghouse and happened to notice the 37\" Olevia had just arrived and when my friend/store owner turned on the tv, it literally took my breath away how beautiful the pic was. So, since I happened have a couple hundred more stashed that wife didn't know about, I bought this instead of a 32\". The difference is incredible! When the picture is square it looks more like 35\" instead of 23. Wide screen looks great. By the way, the remote code is 1015, I looked it up.I love the clarity, the bright white picture, with excellent deep contrast, and very nice sound system.By the way, I don't like the menu system. i'm a computer professional and it's taken me days to run it easily. And I build computers and networks!This is an excellent purchase. I highly recommend. The wife isn't hollaring about how big it is  anymore, she loves the picture now!", "Date": "January 6, 2008"}, {"Title": "Best TV", "Author": "Sreedhar Dantam", "ReviewID": "R7B3P2B755EVH", "Overall": "5.0", "Content": "Pros:1. Lot of inputs. Now TV comes with 2 HDMI inputs. So, I do not need to change HDMI cables between DVD player and Dish TV input.2. VGA component input. So, I can see youtube videos on big TV easily.3. Excellent picture. You must see picture clarity of discovery HD theater channel. It is amazing.4. Good quality sound. Use HDMI cables.Cons (these do not stop owning this beautiful TV.These are minor. If manufacturer fixes  these, then it would be good. Many other reviewers also wrote similar list)1. It takes around 5 secs to power on.2. Dish remote won't work for this TV. That means you need to use TV remote for volume control and switch on and off.Many other reviewers have commented on NO printed manual and only CD manual. If you have computer, then PDF document is preferred. Because I can search easily.If you are planning to buy this TV, you can go ahead and buy this TV without hesitation. You won't get disappointed. My recommendation is buy HDMI cable from amazon along with this TV. You would get HDMI cable for < 0.5 cents on amazon, if you go to any store it would cost > 25.", "Date": "December 24, 2007"}, {"Title": "Research helps: Olevia 37\" HDTV", "Author": "M. A. Cooperstein", "ReviewID": "R1AKSIA48ZKYY0", "Overall": "4.0", "Content": "The setup is not very hard. Comcast's mistakes were my biggest problem, so be sure you know what kind of box you want and your cables are good ones.Picture very good. Although I have surround sound, the TV's sound is not bad in itself.Discount Jungle even registered it for me.Overall, I'm very satisfied.P.S.: One glitch. The instructions are not printed, but on a disk with a number of pdfs. Saw this reported before by reviewer. The company really should remedy this.", "Date": "December 21, 2007"}, {"Title": "Great TV for the price", "Author": "Dan", "ReviewID": "R2VHV2G57MZFDE", "Overall": "5.0", "Content": "Pros:*Great Price*Great Picture.*Owned it 7 months with no problems.Cons:*Menu's on TV is hard to use. ( But once its set up you never have to use the menu buttons again , not a big deal*Cheap universal remotes don't work with this tv*Sound is not that great, but I don't care about that since I go through my stereo receiver.I would not hesitate to buy an Olivia Brand TV in the future,  I know people who payed way more for there comparable (1080i) HD TV and the picture looks just as good.", "Date": "December 15, 2007"}, {"Title": "Not perfect, but I'd buy it again....", "Author": "Steve \"Steve H\"", "ReviewID": "R2ZGWUQR8JYWYN", "Overall": "5.0", "Content": "The set came yesterday, so I'm on day two.  The little setup sheet that comes with it is not much help, and the user manual is on CD, both poor. Beyond that, I'm completely satisfied.  There was a little leaflet that invited me to call tech support for setup help, which I did.  I had almost zero wait time, the tech was pleasant and competent, and got me set up fast.  We had to wait for the set to do a channel search, and he was patient and pleasant.  I haven't had tech support that good in a long time.  The picture is bright, clear, and crisp.  I like it a lot.  I have not attached a bunch of devices to it, and since my hearing is poor, I really can't evaluate the sound.  It sounds fine to me.  I am attached to DISH TV and an external antenna, and pull in stations from 100 miles away over the air. The tuner must be pretty good.  I'm sure that over time I will experiment with more bells and whistles.  Assuming it just keeps running,  I will be most pleased with my purchase. I am probably going to need another TV for a vacation home, and I will buy another 537H without hesitation. Addendum 12/29/07.  After a couple of weeks with the set, I'm still very pleased.  I'd echo some comments of others that the setup menu display is a little odd, but (1) you get used to it, and (2) once you're set up, you don't refer to it often.  The only other negative is the remote codes aren't readily available, so you really can't control it with another remote.  I tried doing a manual search on my DISH TV remote, but I got tired of pushing the buttons and gave up looking. After all that, what I really care about is the picture, and I think it is great.  It is crisp and bright.  When it comes time to buy another, if there is another set with a more common remote at the same price, I might consider it, but the good picture I have makes me lean toward buying another Olevia.  I do not regret my purchase at all.", "Date": "December 11, 2007"}, {"Title": "Olevia 537H - Best bang for the buck!", "Author": "Richard M. Deteresa \"Rich\"", "ReviewID": "R3CMQT1OQNXCK8", "Overall": "5.0", "Content": "Comparing price/features/performance, I don't think you can beat this unit for a 37 inch HD set.  Got mine on black Friday for a great price, and would buy another in a minute if I needed another TV.", "Date": "January 9, 2007"}, {"Title": "Wow!", "Author": "Charles Hicks", "ReviewID": "R1Y3NWNG7S8QAB", "Overall": "5.0", "Content": "I finally made the switch to an LCD HDTV.  I paid $878 for this television and am very happy.  The picture quality is as good or better than the name brands I see in the big box stores.  I haven't figured out how to update the firmware yet, but I see from the reviews that others have done it so I'll keep trying!", "Date": "December 29, 2006"}, {"Title": "great tv", "Author": "mobile55", "ReviewID": "R16IEHC3GGIMMW", "Overall": "5.0", "Content": "I have to say this has been a great tv. I purchased in 07 & its still working fine after 6 years. I'm getting ready to sell or give it to someone only because I'm ready for a 50\" smart tv. But I have to say when I purchased this tv it had all the bells & whistles. Of course now its a little out dated & bigger, lighter tv's packed with many more features have taken over. So I'm retiring this tv but its still working great after 6 years. The bright blue light when powered off is a bit annoying is my only negative plus finding a remote code for pairing is negative.", "Date": "November 2, 2013"}, {"Title": "Decent TV for the price", "Author": "P. R. Bermon", "ReviewID": "RS819GLCE64NO", "Overall": "3.0", "Content": "We've had this TV for just over 4 years, and have been quite satisfied until this week, when the close captioning quit working. Dish told us that it's a TV issue and gave us a toll free number to call. The message at that number says that support is no longer available - sorry. I guess it's good to have an excuse to upgrade your TV every few years, and except for the close captioning it still works fine. For the price, which is quite a bit lower now, it's not a bad TV, but I'm not sure I would buy it again today. In fact, I'm here on Amazon looking for another one.", "Date": "June 27, 2011"}, {"Title": "Happy with my purchase", "Author": "TA", "ReviewID": "R3CTYUUHT1YAE8", "Overall": "5.0", "Content": "I purchased this TV November of 2007.  It is still going strong over three years later.  The picture quality is great - it's no Samsung, but for the price, I am happy with it.  I mostly play video games and watch football on it and I have been very happy.  Picture in Picture is nice.  Audio quality is just fine  too.", "Date": "January 2, 2011"}, {"Title": "Great Tv!", "Author": "S. Salazar", "ReviewID": "R2778OKTJ1W7LP", "Overall": "5.0", "Content": "Had this tv for 3 years already and working great still. When bought tv wasnt sure becasue never heard of brand before but ended up being great.", "Date": "October 22, 2009"}, {"Title": "Not So Good After All!", "Author": "K. Nordhus", "ReviewID": "R12BFH5KABM4YG", "Overall": "2.0", "Content": "I've had mine for almost two years with no problems at all. I found it to be very easy to set up, the picture and sound quality is also very good. And the price was excellent!  It does seem like quite a few people have experienced problems with this brand but so far it's worked great for me.Update!Well just like everyone else I started having major problems with this television.  I guess that's what happens when they use cheap low quality parts!My advice to everyone is to do your homework and check out the reviews before buying anything.", "Date": "September 28, 2009"}, {"Title": "Satisfied customer", "Author": "Bob", "ReviewID": "R398LHMHAIFHIK", "Overall": "4.0", "Content": "Only thing would have been better if all the assorted accesory jacks had not all been on the back of the set.  Some on side or bottom would be a big improvement. Mainly because I have it mounted on the wall. No problem if mounted on the stand.", "Date": "June 9, 2009"}, {"Title": "Thoughts after 10 months of use...", "Author": "S. Patrick", "ReviewID": "RUEGC0J757NVV", "Overall": "4.0", "Content": "I purchased this in August, and use it primarily for movies (Blu-Ray & Standard) and video games (PS3).  For the price I paid ($699) I'm satisfied.  For me, the on-screen programming that so many people have written about hasn't been that big of deal, but I admit it is strange.  I will say that if you don't have this hooked up to an external sound system (I have a basic Sony surround 5.1), the sound is rather shallow and dissapointing (it's not horrible, but it definitely leaves you wanting more). Picture is fine, and I've had no other problems with the set to date.", "Date": "March 15, 2009"}, {"Title": "Olevia 537H", "Author": "Anna Maria Dienno \"adienno\"", "ReviewID": "RN1A6FSG94DPM", "Overall": "5.0", "Content": "I am very happy with the product.  It was delivered very quickly and the picture is amazing.  My only problem is I can't sync my TIVO remote to it-but that is TIVO's fault for not having the brand on their list.", "Date": "May 27, 2008"}, {"Title": "Good for watching soccer", "Author": "I. Zapata \"changoleonido\"", "ReviewID": "R1LEORVTNCVQRX", "Overall": "5.0", "Content": "My first HDTV. It has been a pleasure to own it. Soccer is now as it should be.", "Date": "May 20, 2008"}, {"Title": "Top dealer", "Author": "C. Wolfe", "ReviewID": "R1OE3SFJZ105D3", "Overall": "5.0", "Content": "The price was great, shipping was fast. We are very satisfied with the Olevia TV. We don't have cable, just antenna and can get way more stations than with our other TV.", "Date": "April 27, 2008"}, {"Title": "Good Goods", "Author": "Jimmy T", "ReviewID": "R3DF7W8M7A7ZTL", "Overall": "4.0", "Content": "The Olevia 537H was definitely the right choice for us based upon all our research.  With free shipping from Amazon and no sales tax it was less money than the 237T on sale locally at Target and it's a upscale version of the 237T based upon a consumer forum I visited.  It worked right out of the box and was the simplest setup I've encountered with a TV or other components since the Black and White days. I spent the first few days of and on just getting familiar with the menu and adjustments.  The only negative I've found so far is the labels on the remote control - small text and very hard to see in low room light conditions.  Otherwise I love it so far after a month of use.  It's also easy to move and keep clean and isn't a dust magnet like our old conventional tube TV.The only challenge now is trying to sort out what kind of Program Subscriber package to choose.", "Date": "April 15, 2008"}, {"Title": "Good experience--Olevia 537H", "Author": "Jerry Von Gerichten \"J. Von Gerichten\"", "ReviewID": "R1WC5BRTMN6GCA", "Overall": "5.0", "Content": "Received quickly from Tiger Direct and in Xlnt condition..Connected, plugged it in and all worked easily with no problems. Beautiful picture, very nice remote.. all great (as was the price with free shipping). Picture as good as higher priced big name brands and better than most that we looked at in the usual stores that offer little information as to what they sell (thanks Tiger direct and Amazon). In use daily now for about 5 weeks no problems..have not found menu difficult, after first use,  followed instructions, Easy to remember since (just roll the cage to select). TV Audio very satisfactory. We also use home theater set-up to A/V receiver for DVDs and music on TV.Very good product and highly recomend it. Only found brite blue standby lite annoying when unit off..taped a small piece of  black plastic electricians tape over half of the lite..fine.. not noticeable and could be remouved easily anytime.", "Date": "April 12, 2008"}, {"Title": "Very happy with this TV", "Author": "M. Clemens", "ReviewID": "R3RROYLH56FGAF", "Overall": "4.0", "Content": "I am very pleased with my 537H. I actually bought it refurbished  a year ago from buy.com after reading a lot of positive reviews about it. I must say that it dramatically changed my tv-watching world. I went from a 27\" CRT that I got in college to a 37\" flatscreen and I was blown away by the size and the quality of the picture for the price. Overall, I would say that this is a well made tv and the quality exceeds your expectations for the price. For everyone out there that cares about *value* (in the true sense of the word) over simply the lowest price, I think you'll love this TV as much as I do.Pros: Definitely the picture quality when it comes from an HD source. I have an HD cable box and an Xbox 360 and the picture still blows my mind a year later. Even watching standard definition cable stations looks good, probably even a little better than what I was used to on my CRT. This TV is really great for gaming and movies. The 720p resolution is perfect for a 37\" screen, if you get something bigger than 42\", then it's worth it to look at a 1080p set.Cons: While this list may seem a little long, most of these issues are minor and easily outweighed by the positives:1) Removing the base in order to mount it was a hassle without the correct screwdriver. The screws are really really deep and there's like 10 of them, so make sure you have a skinny phillips screwdriver with at least a 6 inch shaft.2) The menus, as it is with every Olevia, are a little frustrating but still useable once you get the hang of them.3) As other people have mentioned, changing video inputs is tedious using the Olevia remote -- I use a Harmony 880 Universal Remote Control and downloaded the direct codes for choosing the input source.4) It does take about 8-10 seconds to turn on, but I can't say it bothers me that much since I turn it on and off no more than once or twice a day.5) My 537h had only one HDMI port, that could be different now, but I think you really need two on an HDTV.", "Date": "April 11, 2008"}, {"Title": "Olevia 37\" LCD", "Author": "Steve Mann", "ReviewID": "R2AXLY6RQJLR4", "Overall": "4.0", "Content": "I like the TV a lot, the blacks are rich and dark, which I was afraid of with a lower cost LCD TV, but they are very good, the hd cable desplays very well, dvd looks good. Though nothing to do with this set, the Standard Definition display area is smaller than the 32\" TV that is replaces. Just the way the 16:9 ratio works out. The menu system to adjust and set up the set is different from any I have seen. Consumer Reports said it was not easy to use. Once you get he hang of it, it is not bad, just different that most other sets I have owned. I am happy with the purchase and say that it is a very good value for the dollars spent!", "Date": "March 27, 2008"}, {"Title": "2nd Olevia", "Author": "B. Payne", "ReviewID": "RNGD787OB5LJH", "Overall": "5.0", "Content": "Set up easy. Took it out of the box, plugged it in and it was great. The documentation is a little intimidating when trying to adjust the picture. My first Olevia (32\") was such a successful purchase a year ago I opted to get another one. More bang for the buck and J&R; through Amazon was a fast and great transaction. By the way the Directv remote code is 11601.", "Date": "February 10, 2008"}, {"Title": "Best Bang for the Buck! Impressed", "Author": "MD", "ReviewID": "R9ZJWAOXU3CXT", "Overall": "5.0", "Content": "This is a great TV especially if you can get a deal on it. No complaints, understand that it has a slow turn on time, its hard to get remotes to work with it, do discrete input selection and a few other quirks(these things do not bother me at all). I would recomend to anyone, the 42\" is very similar so expect the same from that, the 32\" has different processing so may be slightly worse picture. Does not come w/ hdmi cable(not even written on the box like some have been, but you can get them cheap online. I would not hesitate to get a T model either as they are very similar.", "Date": "January 27, 2008"}, {"Title": "Do not buy this tv", "Author": "Sam Nizam", "ReviewID": "R9KFL9SQO1WDO", "Overall": "2.0", "Content": "Don't buy a Syntax Olevia! I bought one and it died almost a week befoire the warranty expired i had to pay $90.00 for shipping , they sent me another unit , so i decided to buy 3 year warranty. the tv broke down one more year later called, they will fix but i have to pay another $100.00 to ship back to the company and wait about a month to get unit back. even i paid for extended warranty on this unit and it should be repaired in my house FYI the warranty was sold to me from oleiva it self.", "Date": "December 28, 2007"}, {"Title": "WARRNING", "Author": "inclw \"inclw\"", "ReviewID": "R1GVG1817VNI2X", "Overall": "1.0", "Content": "Don't buy a Syntax Olevia! I bought one and it died almost to the day the warranty went out. Customer service said I would have to pay to ship it back and pay the parts and labor to fix it and that would cost over half of the TV's cost. They wouldn't offer to help with anything and they said they lost my registration card, the same one they used to call me with to ask me how I liked it a week after I bought the TV. So all I can do is to post this to every blog I can to try to inform others.", "Date": "May 8, 2008"}, {"Title": "DO NOT BUY!!!!", "Author": "SMA", "ReviewID": "R21OPDZWP7106B", "Overall": "1.0", "Content": "I'VE HAD THE TV 5 SHORT YEARS, THE TV WILL NOT TURN ON.  IF YOU RESEARCH IT, YOU WILL FIND EVERYONE IS HAVING THE SAME ISSUES.  SOME AFTER JUST TWO YEARS....  DO NOT BUY!!!!", "Date": "November 12, 2011"}, {"Title": "I was so surprised", "Author": "J. Robinson \"Just Me\"", "ReviewID": "R1G54YOZKS1VEG", "Overall": "2.0", "Content": "I have few words, but I have this model and It's sitting on my floor in front of my TV stand where my new TV is Sitting. That should sum it up for future buyers of this TV. YUK!", "Date": "May 16, 2011"}, {"Title": "Piece of @#$%^&&", "Author": "Robert J. Schoenherr \"SunNaction\"", "ReviewID": "R1C15866YXKPJ", "Overall": "1.0", "Content": "NO STARS but Amazon makes yo pick oneWorst TV I have ever had. Audio has never worked correctly.Loadewd  new firmware (which wasn't poste don the website) waited 5 days for anyone from Olivia to get back to me.Know the audio doen't work at all!Great Paper Weight!", "Date": "November 27, 2008"}, {"Title": "Too many problems. Buy another brand.", "Author": "Gayle Durham \"cartridge woman\"", "ReviewID": "R32336J5SZ16VE", "Overall": "1.0", "Content": "The directions supplied with the TV are crazy stupid. And I cannot believe not one person reviewing this product did not mention the problem with remote control.Cable remote control cannot be programmed to control the TV because Olevia customer service told me, \"our TV is too new and does not have codes yet\". So you will always have to use TV remote for volume and cable remote for channel control.Everything on this TV is BACKWARDS. A bright light on the front of the TV stays \"ON\" when TV is \"OFF\". Isn't the light suppose to go off when tv is off?Directions are wrong. You must choose source then click menu. The directions say the opposite. To choose an option you must click \"enter\"' and the directions instead say click right arrow.The on-screen menu is confusing and plain aweful.Took me 2 hrs to set tv up when it should only take 10 minutes.", "Date": "October 29, 2007"}, {"Title": "Not that great", "Author": "C. Taber", "ReviewID": "R2EULD6LGZ23HW", "Overall": "2.0", "Content": "We ordered this online through Target. Not only did Target charge my credit card twice, but the product came defective.The speakers were blown out and the pixals were not that great.I am giving a two star rating based on the pixals. Sometimes there were 2 inch chuncks of defective pixals on the screen. They would come and go but it was very annoying. I am returning this TV for an Emerson from Walmart.", "Date": "December 17, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "Device Type - LCD TV\nDimensions - 36.8\" x 29.4\" x 10.3\"\nWeight - 52.9 lbs\nViewable Size - 37 inch", "Name": "Olevia 537H 37-Inch LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41KD0H49N1L._SY300_.jpg", "ProductID": "B000H312RK"}}