{"Reviews": [{"Title": "Superior EDTV performance rivals HDTV!", "Author": "Writeb \"writeb\"", "ReviewID": "R3HAH5YMO25OM7", "Overall": "4.0", "Content": "Update, I now have bought this EDTV. I have been agonizing-plasma shopping for over half a year, it boiled down to the affordable edtv models, this zenith and the panasonic TH42PWD7UY. For the time being, I rest easy because I am confident this is the best value for an (EDTV) plasma on the market. So many pro's to this TV. I first saw it in Good Guys and Best Buy, next to other HDTV monitors, it still stood out against many others on the same component video feed. The HDTV Discovery signal looked really good. Not only does this Monitor have a built in TV Tuner, but inputs for virtually every video feed you can feed it, decent speakers, slim profile, included stand, and best of all, great picture! 5000:1 contrast?! Faroudja chip in it? These are features embedded into higher priced hdtv models. Very happy with the TV so far, Looking forward to the new HDTV satellite service to be hooked up!", "Date": "November 21, 2004"}, {"Title": "Broke the logjam for me", "Author": "C. Macdonald", "ReviewID": "R35H6QUPRRG8S", "Overall": "5.0", "Content": "Quite happy with this set.  I was totally stuck on my HDTV purchase - bought a used Sony 42B2 and sold it 2 weeks later because it had lousy blacks and was noisy noisy.  I was thrashing around trying to decide on a used CRT RP but worried about burn in and resale (as well as the simple bulk and viewing angle problems)  Finally a friend told me about this set which is available at goodguys in the stores in the SF bay area for $1999.  (oddly it's $2299 online and $2199 at bestbuy.).  For that price this is a great unit.  Blacks are rich, it's very bright, has a lot of excellent inputs (VGA & DVI as well as component and S-video) - computer output looks extreemely good.  SDTV is not great (but I had such high standards because the scaler in the 42B2 was really really good.)  Still deciding how much I like DVD output - sharp and contrasty but not smooth in the subtle tones - I have to do more tweaking before I want to say for sure how I feel about it.  But apparently this is an LG set under the covers, so it seems like a really good deal.update: I returned it because the black crush was too much for me.", "Date": "February 24, 2005"}, {"Title": "Caveat emptor", "Author": "pitugo0311", "ReviewID": "R2F5JQQ591ITL2", "Overall": "5.0", "Content": "There are scrupilous sellers out there that claim to sell this item for less than $1,000 and ask you to email them for details. Please dont buy from these people - they claim to be from Romania and ask you to send money to their country. Here are some of the questionable sellers: boschi26, scapen242 haicuverzisoriiI am buying this item elsewhere (possibly at best buy) and I thinkthis is a very good system. They nomally cost around $2,000).", "Date": "January 23, 2005"}, {"Title": "P42W46X", "Author": "Lo", "ReviewID": "R1CSL8S0U9C9JG", "Overall": "5.0", "Content": "I've had this monitor for 29 months (since January 2004) and I've found it to be extremely pleasing to the eye, I paid 2100.00 at best buy, and today June 6, 2007 the picture went out.  I'm going to attempt to get it fixed, or if its just a better proposition to just get a new Plasma set...I don't know yet, but Up until now I've been very pleased.  Anyone possibly know what the cost of the repairs would be?", "Date": "June 6, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "42-inch-diagonal 16:9 widescreen EDTV gas-plasma monitor with 852 x 480p resolution; 47.6 x 27.4 x 11.6 inches (W x H x D) with stand\nStunning 5,000:1 contrast ratio; ultra-luminous 1,000 cd/m2 brightness\nAcclaimed Faroudja DCDi deinterlacing and line doubling\nDVI-HDTV, 15-Pin/type D PC input; high-definition component-video, S-video, and composite-video inputs\nPicture orbiter and whitewash functions prevent image burn-in", "Name": "Zenith P42W46X 42-Inch Flat Panel Plasma ED-Ready TV with NTSC Tuner", "ImgURL": "http://ecx.images-amazon.com/images/I/516TN956FZL._SX300_.jpg", "ProductID": "B0002TXRFO"}}