{"Reviews": [{"Title": "42\" is the way to go", "Author": "zakkb@AWS", "ReviewID": "RXTCN2FLQOZY3", "Overall": "4.0", "Content": "I went into my local big box retailer with a 32\" flat panel in mind (upgrading from a 27\" CRT) and quickly realized that 42\" is where it's at!  After seeing this Sylvania in action and being incredibly impressed by the clarity and brightness, I went in search of the best price.  I unexpectedly found it here at Amazon and bought.  After having the TV for about two weeks now I'm very happy.  Like I say the picture is great - no complaints - but I would like a more robust selection of inputs/outputs.  This thing also looks great mounted -  with just the thin frame oulining the screen.", "Date": "November 16, 2005"}, {"Title": "Thanks to the reviews", "Author": "Melanie Jemery", "ReviewID": "R326L610G0WKC5", "Overall": "5.0", "Content": "I read all the reviews before I bought this TV, and they were very helpful.  Thank you to all who wrote about it!  This is why I am writing a review (hopefully this will help someone else make his or her decision)  I bought this TV for my husband's birthday and he loved it.  The sound system in the TV is terrible but knowing this ahead of time we put surround sound on the TV and it is great.  I have to say that this TV is excellent for the money.  I have recommended it to my friends and other family members.", "Date": "November 17, 2006"}, {"Title": "Nice Display", "Author": "DeWayne Miller", "ReviewID": "R3E5D9FTSCQ2YB", "Overall": "4.0", "Content": "I purchased this at a local store before finding it at Amazon. (I paid $100 more but no shipping cost) Very nice display. It is not as crisp as HD, but still looks great. I have Direct-tv with S-video hooked up and the bright scenes look fantastic, but dark scenes (blacks and greys) are not to good. (this is not an HD signal which would clean things up a lot) A DVD player with component hookup is much better.I wanted a large display without paying $2000 (typical ballpark price for an HD set the same size) and am very happy with the results. I do not see a difference worth paying the extra $600 for.This set weighs in at 100lbs so be sure you have a solid entertainment center or if you use the wall mount (an extra $150) it needs to contact something substantial. Also the speakers lack depth. They get the job done ok, but with a display like this a surround sound would be a good investment.Remember this is a display, not a set with a tuner. Not a problem with cable, satellite, or DVD players. This has an advantage if you have young children and a universal remote control. The kids cannot accidently change the tv channel and then require help to get back on track.", "Date": "December 7, 2005"}, {"Title": "Good Plasma for Great Price", "Author": "L. reynolds", "ReviewID": "R34KMWWSEB9I9L", "Overall": "4.0", "Content": "I just received this television yesterday.  I was a little concerned about the sound quality as I have seen it being bashed by reviewers. However, bottom line, the t.v. sounds just fine.  You may need a minute to get used to the sound coming from behind or behind/side of the t.v., but I think that has more to do with the reviews warning about the sound, then the sound quality itself.  I must warn you that this is my experience with the t.v., just sitting on a stand AND NOT MOUNTED TO A WALL.  I would reccomend this t.v. to anyone looking for a good deal on a plasma.", "Date": "December 17, 2006"}, {"Title": "Picture Perfect", "Author": "A Greyhound on the Go", "ReviewID": "R2NWPQRPWR7W7J", "Overall": "5.0", "Content": "This plasma TV monitor is ideally suited for any home entertainment system.  The build and picture quality are oustanding.  The 10-watt internal speakers and remote control are inferior.  However, it really does matter since I have all the A/V inputs connected to my 660-watt A/V Receiver and use a universal remote.  The black face and silver cabinet matches both black or silver components.  The TV does not have a built-in tuner, but I use a cable box to change channels.", "Date": "November 11, 2006"}, {"Title": "Beware of the shipping price!", "Author": "Jonathan Birge", "ReviewID": "R9JEUGU3QINBT", "Overall": "5.0", "Content": "This is a great TV, and I can't argue with any of the reviews. However, before you order make sure you're aware that it costs about $250 to ship! This might make it cheaper to find at a local store.", "Date": "November 27, 2005"}, {"Title": "Better than expected!", "Author": "William G. Locke \"Greg Locke\"", "ReviewID": "R31PUNA9RIOPDV", "Overall": "5.0", "Content": "Ok, when I ordered this television, I did so knowing that it wouldn't arrive before Christmas.  Expecting it the second week in January--according to the information on the order page, I was really shocked that I got the tv yesterday--3 days before Christmas.  The delivery person was great, unpacked the TV, offerred to take the packaging with him, was very neat and courteous.  The picture is Great, and yes, as other reviews stated, the built-in speaker system is lacking compared to what we're used to, but I have several surround sound systems and knew that wasn't a problem, but even without the surround sound, when I watched a DVD, I felt the sound was adequate.  I am VERY, VERY pleased!", "Date": "December 23, 2006"}, {"Title": "GOOD TV - BAD SERVICE", "Author": "Lal", "ReviewID": "R3M7EMM5WN4V8N", "Overall": "1.0", "Content": "I bought this TV during the Holiday season in December as a present to my family from Amazon. I received it on Dec 10 & it stopped working within less than 2 weeks!!! I contacted Amazon's customer service & they pretty much told me I was on my own & that this was something between me & the manufacturer as their return policy did not cover TVs over 27\"!!! Unfortunately I had not bothered to read this policy before buying online or I would never had made that mistake. Anyway, I set about contacting the manufacturer. After getting a run around for almost 10 days, one of their local service centers came & picked up the unit. It is now almost a month later & the unit is still at the service center awaiting parts. Apparently, it's the power supply & when I call the service center I am told that they have been advised by the manufacturer, Sylvania (Funai Corp) that the part is on order but cannot give them an estimated date!!! So while, the TV, does look good & had nice picture while it worked, the service is, needless to say, very poor. Lesson - do not buy such items online. Save yourself the hassle & buy it at a local store. You might pay a little more but atleast you can take it back to your local store & won't have to run around. Also, buy from a reputable brand (Panasonic, SONY) as the 3rd rate brands such a Sylvania simply can't provide the necessary support. They are in the business of making & selling products - not supporting them. It's a shame.", "Date": "January 23, 2006"}, {"Title": "Awesome", "Author": "Ellen Williams", "ReviewID": "R299CVKBI9DU07", "Overall": "5.0", "Content": "I am so pleased with my Sylvania 42\" Flat-Panel EDTv Plasma TV. Not only was it a good value. It has a wonderful support staff that comes with it, just call them up and they will help you hook it up! I looked at several models prior to purchasing this one, none really stood out. I was actually reluctant to order the Sylvania because the price was so low, you know, you get what you pay for...but I took the chance and ordered it. Best decision that I have made this year! If you want a Plasma TV there is no better deal or picture.", "Date": "January 30, 2006"}, {"Title": "Lot's of TV for the $$$", "Author": "Daniel Pratt \"Sacdjp\"", "ReviewID": "R3BXIHVA6Q5PNX", "Overall": "5.0", "Content": "I've been lookiing for another HDTV for a while, and have been waiting for a good deal. I didn't plan on getting an EDTV, or one this big. Boy am I glad I did! I was also one of the lucky ones that got a free mounting bracket with it. Even w/o the bracket, $799.98 with no tax or shipping was an awesome deal. I actually like this TV so much that I am ordering another. It does not have a ton of input options, but if you are just running TV/DVD through it I think you will be rather pleased with it. This price is so good, I could turn around and sell it for more on Ebay or Craigslist. Also very impressed with Amazon at offering such a good deal, and thankful for the quality customer service I got. I was a bit worried about shipping such a fragile item, but the delivery company they used did a nice job taking care of my TV.", "Date": "December 5, 2006"}, {"Title": "Great buy!", "Author": "Jeremy Hdpro", "ReviewID": "RFO8A734KI4MU", "Overall": "4.0", "Content": "I'm so happy that I got this for the super low price.  Although the spec of this TV is not that stunning, the actual picture quality is great.  I enjoy watching SDTV on it, actually it performs much better than my other LCD TV with SD source.  It might be a little bit worse than a HDTV when hooked up with HD source.  But I can barely tell the difference when sitting 12 feet away from the TV.Some cons:No VGA or HDMI input so I can't hook it up with my PC.Monitor only so closed caption is not available (some of my family members need the feature)But I can really not complain more with this price.", "Date": "January 22, 2007"}, {"Title": "Great TV for the money", "Author": "J. Lehmkuhl", "ReviewID": "R2TYFQV3HS0RPN", "Overall": "4.0", "Content": "I received this TV about 2 weeks ago and couldn't be happier. Clear picture, ease of operation, and a great sleek look. I rated it 4 stars instead of 5 because the remote control is really big, clunky, and a bit on the generic side. The sound isn't great but will be fine with separate speakers.Overall, great tv for the price so I would recommend.", "Date": "December 13, 2005"}, {"Title": "Will display HD if you have a HD video source", "Author": "Gerald L. Rioux", "ReviewID": "R2P1CPWAA57A8L", "Overall": "5.0", "Content": "I bought the Sylvania 42\" plasma monitor locally just over a month ago.  It is fabulous for the price.  The screen was brighter and sharper than many TVs/monitors in the store that had much higher prices.And despite what another reviewer wrote, the Sylvania will display HD if you connect a HD video source to it.  Monitors or TVs will only display HD if you have a HD video input.Jerry", "Date": "December 18, 2005"}, {"Title": "Great Picture, Style, and Value", "Author": "David", "ReviewID": "RS1MUYE336AQ3", "Overall": "5.0", "Content": "This monitor is an exceptional value that delivers an incredible picture through its plasma display.  Please do note-this is a monitor, not a television.  It only works when set-up with your cable television.  Also, living in a 1950's home apparently did not provide the correct \"grounding\" neccessary for the monitor to function properly and without \"hum\" or lines (a symtom of electronic interference).  To remedy this, just pick up a Monster Power Cable ($80) at your local Best Buy.  With this Monster Power Cable, your cable television gets routed through the Monster Power unit, and then to your plasma monitor, taking care of any electronic interference caused by improper grounding. I hope this little tip on clearing up the \"hum\" lines helps someone else because I know that after having the power company and cable company out and still having problems, it sure was a savior.", "Date": "January 16, 2007"}, {"Title": "Beware", "Author": "L. Saunders \"disappointent\"", "ReviewID": "R1UM2Y4J50N577", "Overall": "3.0", "Content": "For the first 8 months the TV was fine, then one day I turn the TV on and the green power light comes on for about 2-3 seconds and goes right back to the red standby light. Not picture or anything comes on either. I have the protection plan but it been 2 months and my TV is still not fixed.", "Date": "January 2, 2007"}, {"Title": "Not all that and especially not a bag of chips.", "Author": "D. Daigle", "ReviewID": "ROGKML5QH6HEW", "Overall": "1.0", "Content": "I was eagerly anticipating the arrival of mine which I ordered Jan 17th.  It arrived broken so I refused shipment, which was no problem.  Then my husband happened to be at Sam's Club that day, looking at TVs noticed this exact same set on sale there.  Boy, was I glad mine arrived broken,  because of all the sets on display at Sam's this 6842PE had the worst picture.  BTW - I know Amazon's prices usually are great, but in this case not so much, the price at [...] was $[...].", "Date": "January 24, 2007"}, {"Title": "A few things you should know before buying...", "Author": "Desiree Byrd \"~ D ~\"", "ReviewID": "RRUNNM5TGJKAR", "Overall": "2.0", "Content": "So, let me first say that i was so fired up for my tv to arrive.  I read every single review and apart from some people saying the sound sucked  was pretty pleased.  I'm not one of those people that's crazy about their home theater systems anyways so it not being HD and possibly having poor sound was okay by me.  The first tv came and as the delivery guys unwrapped it they revealed a completey smashed screen even though the box appeared fine.  I was bummed and they said to write amazon and request a replacement.  I did, and amazon was very quick with processing my request, the second tv just arrived about an hour ago.  The box was completely torn apart in one of the corners so I was already nervous.  The tv looked undamaged and the guy was in a hurry to leave so i signed the paper and then hooked it up.  I only remember reading about a humming sound in one of the reviews but it's very bad in my tv.  As soon as I plugged in the audio cable the humming started and it gets louder as you turn the tv up, very distracting.  Every time I changed channels flashes of static come on the screen which is not because of the cable box because it doesn't do it on any other of my tvs i hooked it up to.  I looked at the back of the tv and there is a dent.  I don't know if it's because of damage or just a sucky tv but either way i'm getting a refund and feel like i've wasted a month on this ordeal.  Please take my advice, I know it's a good deal, but you do get what you pay for.  There's just no telling what goes on during the delivery.  I'm gonna go to a store and get a better brand name and pick it up myself.  If you do buy I hope you have better luck than me.", "Date": "January 31, 2007"}, {"Title": "WARNING! DO NOT BUY THIS TV!!!", "Author": "Sapphire", "ReviewID": "R32HDTQVCQS6A7", "Overall": "1.0", "Content": "Why can't we rate this with zero stars? One star is far too many! Our story is just about identical to many that have been reported here. One day about a month ago there was a loud POP and the TV just stopped working. Unfortunately we didn't pay $600 for it, we paid $1200 in April '06! Funai/Sylvania should be shut down and we do plan on writing letters to the Attorney General, reporting them to the Better Business Bureau and contacting our Congressman to ask for a congressional investigation into this company. Someone needs to start a class-action lawsuit here. We also got the run around about them sending us a box. We made several calls, talked to supervisors and their supervisors and got no help whatsoever. I cringed when I read the great reviews that some have given this TV who have only owned it a few months. I wish them luck. We, also thought it was great and the picture was beautiful until without warning it turned into a piece of junk! Don't buy it!", "Date": "February 14, 2008"}, {"Title": "TV is great, but Sylvania Customer Service is the worst ever!", "Author": "J. Harmon", "ReviewID": "R2D7USWWZNW4A7", "Overall": "4.0", "Content": "I loved this TV for the first 10 months we owned it. One day it stopped turning on. It would try to turn on for about 5 seconds and then shut itself off. I contacted customer service and was assured it was still under waranty and if I faxed them the information they needed, they would contact me when they sent me a box so it could be shipped to a service center to be repaired. Which I promptly did (the same day). After a week I called again to see what was going on and when I could expect the box. I was told it takes 10 days to 2 weeks. I waited another week, nothing. I called again and this time was told it can take up to three weeks, but they would send a form to corporate to have them look into what was going on. I was assured that someone from corporate (as well as someone from the box shipping dept.) would be in touch within a week. I waited another week, still nothing. I called again and was told that the reason nothing had been done was because they couldn't read the date of purchase on the receipt (which they posted on their computer system as received and read 5 days after I faxed it to them). When I asked why no one had called to tell me this, wasting 2 weeks, all anyone could tell me (including a supervisor) was \"I don't know\". I am so fed up with these people I decided to post this to hopefully prevent anyone else from buying this (or any other) Sylvania product and having to endure the customer service hell I am currently stuck in. I have refaxed the information, including a blown up portion of the receipt with the date so no one can claim they can't read it. I am waiting for yet another week to pass so I can call (yet again) and find out what new and even more imaginative excuse they come up with this time. If I do ever get this TV to the repair center, I am praying that the part it needs is still in production so they can fix it. At this point, I can only hope that my heirs do not have to carry on this valiant, although at times flagging fight, in my name. The bottom line is - DON'T BUY ANYTHING THAT CAN BREAK IF IT IS MADE BY SYLVANIA.", "Date": "October 20, 2007"}, {"Title": "You Get What You Pay For.", "Author": "K.G.", "ReviewID": "RQW7IAL576UVU", "Overall": "1.0", "Content": "I bought this tv in December and it has never worked properly.  The tv emits a high pitched electrical hum that will give you a headache within a few minutes.  I had the tv \"repaired\" under warranty (this took over 2 months).  When they returned the tv to me, it still had the same issue, so they came back to my house and picked it up (that was 3 months ago), and I still don't have it back.  I filed a complaint with the Better Business Bureau and asked my credit card company to refuse payment.  This tv, and Sylvania/Funai Corp are worthless.", "Date": "May 22, 2007"}, {"Title": "BUYER BEWARE", "Author": "Paba \"electronicnutt\"", "ReviewID": "R3LGWAYW9VFR30", "Overall": "1.0", "Content": "I would give this NO stars if possible.  This product is nothing but a piece of junk.  After 4 months power went out and never came back on.  It has been a month and am still waiting for Funai corp. which is sylvania to take care of this.  They ignore you and will not return phone calls.  Quite frustrating but I will not give up.  Totally aggravating but like a previous review stated, YOU GET WHAT YOU PAY FOR.  It is a real PIECE OF ----.  BEWARE!!!!!!!!!!!", "Date": "May 16, 2007"}, {"Title": "Sylvania Plasma Display", "Author": "John Stone \"tomkat02360\"", "ReviewID": "R1MGQJUDUNUWZ7", "Overall": "1.0", "Content": "Low Price - Great picture - poor speakers.  Failed after about 13 months of occasional use with a loud \"POP\" sound.  Warrenty for parts and labor is 90 days, for parts is 1 year, for display is 3 years.  Sylvania was unsympathetic.  Low price, but pretty expensive for only 13 monts of use.", "Date": "May 5, 2007"}, {"Title": "good for the $", "Author": "FunkeeChild AKA Jose Mateos \"J Dealio\"", "ReviewID": "R1DOMFIGUIU3GU", "Overall": "4.0", "Content": "I got this bad boy for $699 which is the most killer deal ever....they posted the price incorrectly something and after they processed my  order tried to cancel it, I had to reorder it at 899 then they gave me a 200 dollar credit...it's pretty darn sweet TV....as the others said definitely needs surround sound, but for any normal person it gets excellent resolution, for the TV freak, it's not the best of the best....one great thing is that it has great color, 16.3 million and its a plasma so the darks are darker and the lights are lighter.....definitely a good deal for anything under 900 dollarsUPDATE to July 2012:Badboy is still rocking...the color quality is definitely lacking now....still good pictures but the darker colors tend to blend...I've got three other flat panels and an Epson 8350 projecting on a 150\" screen so no worries...have this 42 incher in my bedroom...just got the new hopper system and have a joey hooked up to it...only complaint is no HDMI input...but back when I bought it in 2006 there weren't a lot of TVS with HDMI....back then it was all about the Component Video...hahaha....how times are changing :)", "Date": "February 28, 2007"}, {"Title": "Best Deal", "Author": "Y. Dukes \"yolioli\"", "ReviewID": "RQUU3USED7F9X", "Overall": "4.0", "Content": "The tv has not been a problem...but the fact that it is not wired for cable should be advertised. You have to attach a VCR in order to get a cable outlet. Also the mounting they suggested did not fit this tv and I wasted my money and had to go buy the correct mounting from another store.", "Date": "February 22, 2007"}, {"Title": "Great TV for a great price!", "Author": "Danny Fernandez \"Danny F\"", "ReviewID": "RRKIVAPSUJTUW", "Overall": "4.0", "Content": "This Sylvania TV while only a monitor, is a great value for the money.  It is the cheapest model in the 42\" size that I was able to find in plasma.  It is my first plasma TV and I am very happy with the quality of the picture.  The sound portion of the TV I would rate as average.  I found a home theater system made the total experience wonderful.  This is a size that would compliment most needs in a typical home.  It can be wall mounted(optional bracket needed) or self standing with the enclosed footing.  I chose to build 15\" shelves and have the TV free standing on one of the shelves.  This allows room for the Satellite receiver and the home theater unit and speakers.", "Date": "January 21, 2007"}, {"Title": "Very pleased", "Author": "J. Henry", "ReviewID": "R2JJZ45PSSMT67", "Overall": "4.0", "Content": "I got this for the Family for Christmas and love it. Very good color and price. Mounted on the wall and used the sanus mount. HD cables, S-video (better) or component (best) do not come with it you need 2 sets of to get the best possible pic. One for DVD and the other for Cable/Dish (provided) You also need a home theater system as it has no speakers. I have HK +Klipsch and love this set up.Over all this EDTV monitor is very good buy. With all 42 inch ED saves over Hd as all DVDs do not show HD + no 42\" plasma will show true HD you need a 50\" plasma for that.", "Date": "December 27, 2005"}, {"Title": "Overall, the best TV I've ever purchased.", "Author": "Steven Hallmark \"Human\"", "ReviewID": "RIB1DN64LA61R", "Overall": "5.0", "Content": "Picture: Even though HDTV was coming into it's own when this TV was purchased, I had never been exposed to it. My first time viewing a downscaled HDTV image through this set blew me away. The colors are bright and vivid. The contrast ratio is excellent. The set handles fast motion flawlessly, making watching sports fantastic. All this time later, I still watch this tv regularly and it's image is beautiful. That being said, this is an EDTV, not an HDTV. It does not display at a full 720p, but does handle downconverting very well, and delivers very impresssive image quality (Much, much better than my Sylvania 32\" LCD TV) The picture, while not rivaling a good HDTV, still blows a 480p set out of the water.Sound: Garbage. It's not good at all. While the volume is adequate, the sound is muddy and monotone. I don't even think it has stereo sound even if it claims to. You will want to hook this set up to an auxiliary sound source.Inputs: It has 2 RCA connections (1 bottom, 1 side) and 2 component video inputs (bottom). These are extremely difficult to access when mounted, and not very easy to access just sitting on the stand. If you're going to hang this TV, plug your wires in first if you can. Notice that I didn't list any HDMI connections. It doesn't have any. I don't think it has an S-Video input, but I'm not sure. I've never used S-video; has anyone? Regardless, you'll need to use the component for best image quality.Reliability: 7 years in, I'd say I'm qualified to comment on this. I've never had an issue with this TV. I've never had a burn in issue (unlike my Samsung 50\" plasma, which also had other pixel flickering issues). It performs flawlessly every time I turn it on.Important note: This is a display only. It has no tuner. This will not be an issue if you have cable or a satellite provider, but if you want to watch over the air HDTV, you'll need to purchase a tuner.Appearance of the set itsself: It has extremely thick borders by todays standards. I estimate this 42\" TV is as large if not larger than a thin line 47\" LED tv. It does look a little dated.In summation; This is a great TV. I can't imagine paying 500 dollars for one at this point (that's what I paid at a black friday sale for mine back in 2006). With the constantly dropping prices on all flat panel TVs, I honestly can't see another one being sold for any use other than business purposes (ads, in building announcements). I'd say it's strongest point is it's all day every day reliability combined with it's bright colorful picture. I simply love mine so much I felt compelled to review it.", "Date": "August 11, 2013"}, {"Title": "still working 5 years later", "Author": "Benjamin P. Lynch", "ReviewID": "R1IH4TQX290CGW", "Overall": "5.0", "Content": "Haven't had any problems, I've even taken it on vacation with me twice :)  it's a nice big screen to watch dvds on, i've connected it to my computer and that works as well, though i've found that it only works with my nvidia grafix card, not my ati grafix card... not sure if that's a universal problem or specific to my 2 cards.", "Date": "August 24, 2012"}, {"Title": "Not an HDTV, but MUCH better than my OLD TV!", "Author": "Marco Scappa \"Marco\"", "ReviewID": "R254G7MW05ID69", "Overall": "4.0", "Content": "I purchased this EDTV in December 2006 and have LOVED it since day 1!!  I was looking for a 42\" HDTV, and those were priced around $2000.00.  I just happened to stumble across this for $699.99, with free shipping!  I thought it was to good to be real!  Well I WAS WRONG!  It was everything I thought and MORE!  Almost a year later the prices of HDTV's have fallen.  I am happy with my EDTV, but now that the prices have dropped so much, I might get an HDTV, take my EDTV from my living room and move it to my bedroom and put the HDTV in my living room.This was a GIANT step up from the traditional analog TV, for ALOT less than an HDTV!!  A great buy for a step (leap) up!  The HDTV prices will continue to fall, so MAYBE you want to wait more and get the EDTV for now?September 2010  TV is ALMOST FOUR years old, no problems and still LOVING it!  Now that the prices have dropped SO MUCH, wanting to upgrade to a 50\" 1080, but finding it hard to give up my sylvania!", "Date": "October 4, 2007"}, {"Title": "I love it!", "Author": "Karen E. Siewert \"kespat\"", "ReviewID": "R3FKDZPQWRCJ39", "Overall": "4.0", "Content": "Six months and I'm still in love with this TV. Some people mentioned having to pay shipping and handling, but I didn't have to do that. So I paid a total of about $900. The picture quality for HD channels is great---clear, crisp, distinctive colors and gives you an almost \"there\" feeling. As another reviewer mentioned the sound isn't that great, but for the TV sound that's fine and only a bit of a problem when I listen to music. Another minor issue I have is that the screen seems to continually have marks on it that only show when the TV is off. Other than that I think I got an absolutely wonderful bargain. Other TVs I priced for this size were $400 to $700 more.", "Date": "July 17, 2007"}, {"Title": "Awesome Picture.", "Author": "Michael D. Reynolds", "ReviewID": "R32TZ3HMGKCUIL", "Overall": "5.0", "Content": "Got this Plasma set and love it..! Ordered it from Amazon & got it 2 days earlier than expected..! Was sealed securely in shipping containers and was easy to setup with my new DirecTV HD receiver. Also, have it connected to my Home Theater system...AWESOME..! Can' stop watching the Discovery Channel...The colors and vividness of the picture is breathtaking. Awesome deal for $799.00. Would highly recommend this for the price. Same Plasma TV @ Best Buy & Circuit City was around $1499.00Thanks Amazon...!Sincerely,Michael ReynoldsOakhurst, CA.", "Date": "March 31, 2007"}, {"Title": "Wonderful Product... but not at first", "Author": "K. Walker", "ReviewID": "R9FIA8GVQFB9V", "Overall": "5.0", "Content": "I ordered this tv for the low price, of course.  Once I received it (perfect timing)the sound went in and out for the first hour of watching it.  After that, no problems AT ALL!  It's a wonderful tv and I'm glad we purchased it.  It was easy to mount and esay to install our Direct TV satelite box.  No complaints.  Would buy again and recommend!", "Date": "March 24, 2007"}, {"Title": "What an awesome picture!", "Author": "J. Askew \"imte1\"", "ReviewID": "R9GJ4N0AQWPZ9", "Overall": "4.0", "Content": "I have had this plasma monitor for almost a week and absolutely love it! The picture is really amazing. It looks great with regular cable channels, DVD's as well as the ps2. Everything looks great! I highly suggest this monitor to anyone, especially for the price. I am given this a 4 star because of the mount that came with the tv as a \"package\" deal at checkout. The mount that amazon suggest in the package deal 22\" To 49\" Universal Flat Wall Mountwould not work for me. I ended up at walmart a day after getting the monitor, and I was buying another mount. I would suggest the mount at walmart for $88. It is very very sturdy and fit perfectly! Another problem I ran into is that the wall studs were 24inches apart and not 16 like most load bearing walls. That caused the mount that amazon sent to not work as it was 19inches wide and obviously would not work for 24inch studs. I did not return the original mount, instead sold it to a friend who bought a smaller flat panel that would work with this mount. Other then the mount problem, everything else was great. Oh, and I have not tried the speakers on the monitor at all, as I have a surround sound system that I connected instead. Keep in mind this is ONLY A MONITOR and you will need a tuner of some sort. I have a dvd recorder with tuner and several inputs, I simply ran my component plugs to the monitor and that was it.Grab this monitor while you can at this price and you wont be disappointed one bit!I am posting some pictures also. The pictures do not do the screen justice as it was hard to take a picture of the screen without getting a glare or flash, etc.", "Date": "March 23, 2007"}, {"Title": "AWESOME", "Author": "Linda D. Walls \"LINDA\"", "ReviewID": "R33BM7WE7TPXTL", "Overall": "5.0", "Content": "THIS TV IS FANTASTIC I THINK IT WAS A GREAT BUY AND THE PICTURE QUALITY IS PERFECT...WOULD RECOMMEND THIS TV TO ANYONE ***EXCELLENT FOR THE PRICE***", "Date": "February 28, 2007"}, {"Title": "Decent TV for the price", "Author": "James Jonas \"lucyrules\"", "ReviewID": "R1N98ZNWVLW6CV", "Overall": "4.0", "Content": "I caught it at a very low price (below $600), so I figured what the heck.  Decent picture and all, but was slightly confused about the HDTV support.  Even though it can read HDTV signals, ends up it can only display in EDTV (480), not HDTV (1080).", "Date": "February 8, 2007"}, {"Title": "My rating is based on bang for your buck...", "Author": "Author Amanda Beth \"Author Amanda Beth\"", "ReviewID": "R2Z684TA2ICBKO", "Overall": "5.0", "Content": "We bought this TV in February of 2006 and have had it for a year now.  It was side by side with a Panasonic HDTV and the picture was comparable.  Maybe a 5% difference in sharpness but once we got it home you couldn't tell any difference.  My brother has a 46\" Samsung HDTV CRT and the picture on my Sylvania is hands down better.  Of course thats comparing CRT to Plasma.  I am running Digital cable with the HDTV package thru it and the picture is stunning.Cons: - Speakers are horrible but I have it hooked up to surround sound.  - The remote is to basic.  It has everything you need to run the TV and adjust it but it just seems cheesy.  - No HDMI connection", "Date": "February 3, 2007"}, {"Title": "Awesome TV", "Author": "P. dynowski \"pdnycb\"", "ReviewID": "RNH3ZSFPKMDBU", "Overall": "5.0", "Content": "Recommend this TV/Monitor to others due to the price and picture quality.I was resistant to buy this but when it finally came i was pleasantly suprised with the image it produced. In addition use Component Monster cable with your dvd player. This will make the picture sharper.Cons. No HDMI.", "Date": "January 31, 2007"}, {"Title": "Great Plasma TV at Affordable Price", "Author": "Pat", "ReviewID": "R309A8VK2V1R3O", "Overall": "5.0", "Content": "I purchased Sylvania 42\" Plazma TV based on other reviews and low price.  It has been operating for two weeks now and I am pleased with my decision.  It has great picture quality with average sound.  Hooked up with my home theatre system and it's awesome.", "Date": "January 20, 2007"}, {"Title": "Outstanding Plasma product", "Author": "Michael S. Burnett", "ReviewID": "RJD0INMF9CFKQ", "Overall": "5.0", "Content": "I purchased this Plasma T.V. before christmas, The shipping time was exactly what they quoted when I ordered. The Television itself is so much better than everyone else says it is. My wife and I are extremely happy about this purchase. You wont find a better plasma television for the price of these. The sound is not as bad as alot of reviews have said it is. It does come out of the back like all the reviews says it does, but I think that the sound is still really good with or without some additional sound system. The picture quality is great and the Television itself looks great. I will probably be buying another one of these tv's for my bedroom really soon..", "Date": "January 10, 2007"}, {"Title": "Great TV All Around Best Bang For Your Buck", "Author": "A. MALATESTA", "ReviewID": "R3TY1SAH52N3MF", "Overall": "5.0", "Content": "I ordered the television when Amazon had dropped the price to 699 and received free shipping.  I also ordered the wall mount which did not fit the tv so I returned it.  Overall the TV is amazing.  I've seen projection HDTVs and this blows any projection HDTV I've ever seen out of the water.  I just read about the differences between HDTV and EDTV and from my understanding the technology (as in the signals from cable and satelite) for true HDTV will not be realized until 2009 so why would you want to spend and extra $500 or more when you won't even be able to utilize the difference for another 2 years.  By then, you will be able to buy an HDTV for the same price as an EDTV now.  Unless you want to wait 2 more years, this is the TV to get.  I am extermely pleased with this tv and the picture quality is amazing.  (I have it hooked up through component video outputs through my HDTV box from my digital cable)  FIVE STARS!", "Date": "January 9, 2007"}, {"Title": "Outstanding EDTV for the Price", "Author": "TJ Burbank", "ReviewID": "R7G4IOQXPGZM2", "Overall": "4.0", "Content": "I received this TV about a month ago, and other than a small problem with the supporting feet being bent during shipment, I have not had a single problem.  Use it in our master bedroom, and am amazed at the color and brightness this TV offers.  Have it connected to a Dish Network 942 HDTV receiver, and the HD channels look incredible even though it isn't an HDTV.  Using Component Video cables to receiver, and cannot stop watching Discover HD channel.  Audio is fine for our bedroom, but I can see if it where in a large family room it wouldn't get loud enough.  Shortly after purchasing this TV Amazon lowered the price and I was pleased to find that they gave me the difference of the price back to me when I called to ask why the price was dropped shortly after purchase.  That being said, if you want a truly budget TV, then this is your sure thing.", "Date": "January 9, 2007"}, {"Title": "Great TV at a GREAT price!", "Author": "A. Mullins", "ReviewID": "RZOQ3T8OMKGEX", "Overall": "5.0", "Content": "I am very pleased with this purchase.  I got it for the family for Christmas.  The price was $799 and before it shipped, Amazon had dropped the price to $699.  I emailed Amazon to see if I could get the lower price since mine had not shipped.  They happily credited my cc for the $100 plus tax! This made the deal even sweeter.  As an Amazon Prime member, I also got FREE Two Day Shipping! How awesome is that? I was looking for a 20\" or so plasma tv.  The prices were about the same as what I paid for a 42\".  Just couldn't pass this one up!The picture quality is great.  We added a surround sound system to improve the sound.  We LOVE it!", "Date": "January 6, 2007"}, {"Title": "great tv", "Author": "W. Furtado \"familyguyinFL\"", "ReviewID": "R3TLQ3B8XIJOEV", "Overall": "5.0", "Content": "well we bought this tv in 2006 for 600 just got a newer tv for christmas in 2011 still work good so my dad is now retired on  a fix income just got this tv from us he love's it if you buy it you will need a stereo for sound was a great buy", "Date": "December 26, 2011"}, {"Title": "Great Deal", "Author": "I love Smarties!", "ReviewID": "R2FUQUCA7187VK", "Overall": "4.0", "Content": "I bought this in December of 2007 and have had it now for three years. It works fine, with the exception of the really bad sound, which I just thought was something that all flat screens. We bought a sound system/speakers, and it does the job. It is HD compatible and the picture is great.For the price, I am really glad I went with it.", "Date": "March 10, 2010"}, {"Title": "Love it!!!", "Author": "J. Phillips", "ReviewID": "R3D6K952KD51K7", "Overall": "4.0", "Content": "WOW I was shocked to read all the negative reviews. I bought this TV for $900 about 3 years ago and it still works great. My only gripe would be the sound, but I've since hooked it up to a surround sound system and it's great. Of course there are much better TVs on the market but I wasn't looking to spend alot of money and I'm happy I didn't since I pleased with what I have.", "Date": "May 12, 2009"}, {"Title": "Not Bad for the Money", "Author": "A. Slavin", "ReviewID": "R8766K7WCMN7R", "Overall": "3.0", "Content": "I bought this TV from Amazon, 3 years ago.  We live in a very narrow row home, so I was looking for an inexpensive flat panel to replace my large bulky TV.  Space-wise it's great!  Picture quality is average.  Sound quality is poor.First, the picture is not high quality but I knew that going in.  I was not sure what to expect.  I was satisfied with the product when I received it.  It's not great but it's good enough.  However, for the price it could be considered great.As for the sound quality, it sucks!  The speakers are located on the sides facing the back of the TV.  Who sits behind a TV?  When we turn the sound up close to it's highest possible volume, the sounds starts to get even more muffled than usual.  This is just poor engineering.The remote that is included is huge and bulky.  We have comcast cable.  We tried to program the cable remote to Sylvania with no luck.  So we have to used 2 remotes.  The cable remote switches the channels and the TV remote controls the volume and the power.Other than that, this TV has S-video and RCA input jacks.  That is a plus because we connect out laptops to the TV.  It also has output Audio jacks for surround sound.  If this is the way you are going then the TV speakers shouldn't matter much.Lastly, remember that this is a monitor and does not have a tuner!!!  If you do not have cable you will be using a VCR or DVD for the tuner (most VCR/DVD combos have them, not all DVD players do).  This transmits a hum from the VCR/DVD tuner.  We have cable and it eliminates hum.  So if you have cable, that should not be an issue.Overall, I give it 3 stars becuase it served us well for the last 3 years but with the new technology and prices dropping, I would buy something with a tuner and better sound quality now.", "Date": "April 27, 2009"}, {"Title": "NEVER AGAIN - WORST SUPPORT I EVER DEALT WITH", "Author": "FP", "ReviewID": "R139U1W3VCILJ6", "Overall": "1.0", "Content": "My story is almost exactly the same as one of other reviewers, it just took a little longer for TV to fail (18 months) with a loud \"POP\" sound. At the moment it is sitting in the authorized repair center for a month already and that repair center can not get from Funai (Sylvania is their brand name) any reply, not to phone calls, not to email. Same happens with my phone calls, NEVER a live person on the phone. So after a month repair center does not even have ETA on parts they need, they cannot even find out if Funai has these parts. Funai totally ignores their customers and the repair centers they supposed to service. I had no clue that support like this can exist. Absolutely the worst company I had to deal with. I will NEVER EVER buy any of their products. I wish there were minus stars to give this company, they are better of selling garbage disposals, because this is where they belong. The aggravation they cause cost so much more then a few hundred dollars that I saved by buying their TV.Better Business Bureau gives them D rating, which is only 1 level higher from F, which is the worst rating. Here is how Better Business Bureau explains their D rating, I am quoting below:\"We have enough concerns about this company (for example, their offer, customer complaints, advertising, etc.) that we recommend caution in doing business with it.\"I wish I saw this before buying that piece of junk TV.", "Date": "January 5, 2008"}, {"Title": "Pleasantly surprised", "Author": "Swenocha", "ReviewID": "R1X7NCREC36VFM", "Overall": "5.0", "Content": "Bought this during the under $600/free ship period in late '06.  Was looking to buy a true HD, but the price was very hard to pass up.  Did some research and concluded that ED would work for us considering how much $ we were saving, so we pulled the trigger.  Quick delivery and no problems with the setup/hanging (bought the wal-mart mount as others suggested).Here's my take on the TV:- Picture is great with HD signal.  I didn't know what to expect the HD 1080i signal to look like on an ED monitor, but I would say that if I didn't know it was ED, I'd certainly think it was HD (as long as I didn't get too close).  Colors are bright and crisp, blacks are dark, etc.  All around great experience.  I and my kids are totally addicted to DiscoveryHD now, and March Madness was outstanding...- Picture is better than true HD monitor for SD signal.  I've seen SD Comcast signals on friend's HD monitors, and this one looks a lot better.  Still looks awful when compared to the HD, but the upconvert is a lot less, so the picture looks better.  Same goes for DVDs.- Got a component hookup for my PS2 (yeah, I know I need to move up, but I don't play enough to justify the PS3 purchase right now, and the PS2 meets my needs).  It looks so much better than the RCAs.  Got Gran Turismo 4 (which is 1080i), and it looks magnificent.- Sound is awful, but I intended to hook it to my wired surround sound anyway, so I don't care.Very happy with the purchase.  We may look to get a true HD at some point and hang this one in the bedroom or office, but for now we are very pleased with this as our primary TV.", "Date": "May 23, 2007"}, {"Title": "Wonderful", "Author": "Bestbuy", "ReviewID": "R3N912QXP3IVH8", "Overall": "4.0", "Content": "What a great buy this set is. It has a beautiful picture. A perfect choice for most people, and a giant step up from a regular TV.", "Date": "April 5, 2007"}, {"Title": "Excellent deal", "Author": "Naomi K", "ReviewID": "RRWTXWTS2W2E5", "Overall": "5.0", "Content": "I read all the reviews and was worried about the sound but I took the dive anyway.  The picture is excellent and the sound takes getting used to but is exceptable.  I use the surround sound on movies but other than that the TV speakers but I have it on a stand not mounted on the wall.The free delivery was longer than I thought it should be but they carried it in and even set it up.......that was great!!!", "Date": "February 10, 2007"}, {"Title": "Good.", "Author": "Jon R. Roberts", "ReviewID": "R38KO61XBFQHDI", "Overall": "5.0", "Content": "Perfectly content with this.. picture is great, not so good while watching some cable channels but I think that's more do to with the channel, but when we watch a DVD, the picture is great.We've hooked it up to our sound system and the package is very nice.Very happy with this.", "Date": "February 6, 2007"}, {"Title": "Good TV", "Author": "Matt E. Murphy", "ReviewID": "R3GBCQKKL6K775", "Overall": "5.0", "Content": "Very happy with the purchase of the plasma TV.  DVD's look real great on the tv and using the Component Video input.  Will be shocked how nice the picture looks on DVD's.  Using the s-video input with Direct TV and the picture looks good.  The shipping company unboxed the tv and put the tv on stand.  This is great since it was free shipping on the purchase.  Speakers are ok but the tv is for a bedroom and works out just fine.", "Date": "January 20, 2007"}, {"Title": "Outstanding Picture", "Author": "Richard D. Brown", "ReviewID": "R5TE0I1KF6OVA", "Overall": "5.0", "Content": "We received the TV with some delay (Shipped during the week before Christmas)but it arrive exactly on the date the carrier had estimated. We had read the reviews posted by others who had purchased this same item, so we did not expect great sound (10 watts). It turns out that in our small area, the sound was just right. The main difference you will notice is that the sound is mono not stereo, but the picture quality is AWESOME! The TV menu give you several choices for picture quality (Dynamic, News and Movie), as well as choices for widescreen, full screen, etc.As long as you are not trying to fill in a large area with sound, the tv alone, if you can ajust to the mono sound, or the tv combined with a not-so-expensive home theatre/surround sound will give you a high quality super plasma tv experience at a fraction of the cost.", "Date": "January 18, 2007"}, {"Title": "great value", "Author": "A. Kawamura \"weeen\"", "ReviewID": "R3SRMG6A3G7K4Z", "Overall": "5.0", "Content": "I can not belever who can pay more than $4000. Off course there might be a better quality, but if you are an average TV watcher or movie fan, you can satisfy with it. It's a really really a good buy.", "Date": "January 16, 2007"}, {"Title": "Unbelievable for the price!", "Author": "Amazon Customer", "ReviewID": "R2REYLPG3C42PI", "Overall": "5.0", "Content": "i was one of the lucky ones who got this unit for $699 with free shipping. Excellent picture. HDTV stations are perfect and dvd's are awesome. Absolutely georgous screen even when compared with other plasmas and LCD's. I have it hooked up to my Sony home theatre system and it sounds great. Best deal I've purchased in years. Even at $799 this unit is a good deal.", "Date": "January 16, 2007"}, {"Title": "Awesome", "Author": "H. Shine \"H. Shine\"", "ReviewID": "RG6RH1FKF43RK", "Overall": "5.0", "Content": "It took a while but when it finally arrived at the warehouse I went to pick it up myself instead of waiting the additional up to 72 hours for home delivery. Man, we are enjoying this set like there is no tomorrow! I was fully impressed with the picture. The sound is not great, but who cares. I have a sound system hooked up to it and it's awesome!!! The price was a steal for such a product. I would recommend this TV to anyone who is willing to wait a couple of weeks (maybe)!!!H. Shine", "Date": "January 15, 2007"}, {"Title": "More than what I paid for.", "Author": "J. Lowe", "ReviewID": "R1UA6PGVBFDXXR", "Overall": "4.0", "Content": "I was pretty lucky to catch this deal during a brief period that it was listed for $699 (brand-new from Amazon)with free shipping. There was also a rebate for the Mustang tilt wall-mount ($89.99). I don't have an HD tuner yet (probably upgrade my Comcast soon) but with regular SD (using S-video) the picture is fine. DVD's are excellent, crystal-clear picture and like the other reviews state, the audio isn't good. I have this hooked up to a surround-sound system - definately the way to go. The speaker are in the back and can sound muffled if it's too far away. The shipping company Amazon uses(Eagle)is... fair. I checked the tracking information every day to see how it was coming along, it arrived in Atlanta (where I live) and sat for 2 days before I decided to call and find out why it was just sitting there. They told me I needed to set up an appointment to have it delivered. I made an appointment for the next day between 8-noon. At 12:30, no one had arrived so I called. I was told the driver was running a little late and would be there within an hour. At 4:30, still no-show. I called back and got dispatch. It turns out the driver was told to put me off and make another delivery 3 hours away because the customer wouldn't be home after 3pm. It was finally delivered at 7:30pm. The delivery guy was very nice and I could tell it had been a long day for him. So, bottom line; I paid $699 for the set with free shipping, no taxes and a free wall-mount. I also had to spend a day waiting for it along with time and effort to get it delivered at all. Not a bad deal in the end.", "Date": "January 14, 2007"}, {"Title": "This Plasma Is Amazing!", "Author": "Marco J. Genovese \"MangoMan\"", "ReviewID": "RC08HKNERBCX9", "Overall": "5.0", "Content": "The truth of the matter is this screen is a killer deal. No it cannot output HD-DVD in native rez but shines when playing DVD's or HD TV. It has to be one of the best looking screens I have seen even compared to Sony and Philips LCD and Plasmas. The colors are amazing and I have watched TV on it for the past 1 month with no ghosting or burn in. This screen is worth it if you can get it for 1000 or less!", "Date": "January 12, 2007"}, {"Title": "Picture quality is nice for the money, the humming... not so nice.", "Author": "Jaded \"Ani\"", "ReviewID": "R3C6KSKJ38URZV", "Overall": "4.0", "Content": "I was looking for a Plasma TV to fit in my very narrow living room.  Because we do not intend on getting an HD subscription, I decided to go with an ED-TV instead of an HD set.  I did a lot of independant research before purchasing this one.  After owning it for almost 3 weeks, I am happy with my purchase.  When I read that this TV does not have a tuner I was afraid of having problems connecting it but if you have read any of the other reviews, rest assured you will be able to connect it to a Cable Box, DVD, or even VCR.  My only gripe with this TV is the ambient sound that it makes.  I bought this TV after reading all the reviews that were written at the time, none of them mentioned a humming sound that the TV makes when it is on.  The sound is light and I have learned to ignore it.  This is something that I could not do if I had paid more for it than I did.  Otherwise, the set is nice, the picture is very clear and overall, I am happy with my purchase... oh, and another thing, the delivery people were very curtious and careful!", "Date": "January 12, 2007"}, {"Title": "So much for so little", "Author": "M. Ruina \"shaydini\"", "ReviewID": "R2I2LYI10BXGEF", "Overall": "4.0", "Content": "I couldn't believe my eyes when I saw this set at such a drastically reduced price.  We'd been talking about getting a larger TV for the wall, but weren't ready for the extra costs associated with HDTV through Direct TV.  Then we learned about EDTV and thought we'd give it a whirl - couldn't be more thrilled!  The only problem is that I can't get my husband away from the set!  Buyers should be aware that the remote control is not useful by itself.  There are no numbers on it for channel selection and must be used with another box/remote, in our case satellite TV.  Aside from that, this was a wonderful compromise.", "Date": "January 11, 2007"}, {"Title": "good value for the price", "Author": "Jaime Garcia", "ReviewID": "R3UGYAIB645VRS", "Overall": "4.0", "Content": "I've had a good overall experience with this TV. The only reason I did'nt give it five stars was because of the lack of an optical input and the poor speakers.", "Date": "January 9, 2007"}, {"Title": "A Good Video Monitor", "Author": "Thanh H. Nguyen \"THN\"", "ReviewID": "R6NGYRIQPG0HG", "Overall": "4.0", "Content": "Video is good but not excellent.Audio is much lower than average.The feet requires 5\" of space in the front of the screen.", "Date": "January 9, 2007"}, {"Title": "Think twice ...", "Author": "Robert", "ReviewID": "R15DPQYGSOU1Z7", "Overall": "1.0", "Content": "First off, on a scale of 1 to 5 I give it a -5. Here's why;To begin this unit will cost you $200.00 to ship and since it is over the 27\" return policy size don't expect to be able to return it if it's defective.You will never get your $200.00 back or have the unit replaced unless of course there is a forklift hole through it or something obvious like that. Amazon \"cuts and runs\" and leaves the unit to you and the manufacturer who is supposed to have \"in-home-service\" if the unit is found to be defective after you unpack it and try to use it.Well, you better check the Funai warranty to find out if they even have a service center in your area that can come out to your home (which you will have to do yourself because when my unit showed up on my doorstep D.O.A. I called them and they could not locate anyone in my area. I had to call the Funai service number and press \"2\" to find the nearest service center which, BTW, was just about 40 min away. I found it astonishing that the service folk at Funai couldn't find one...what kind of service center doesn't have a list of \"ceritfied\" service centers for there call center? I find it odd that a technical company doesn't have a database of these centers for the call center to use... ?!?!?!)We bought this unit as a surprise gift for the holiday and received it on Dec 7th, I checked the unit immediately to make sure it was ok (which is why we got it early!). After finding that the unit was D.O.A., I called the mfg right away, and guess what...? I had to leave a message. Wow. Now there's some customer service. Well after a day and a half I got no return call, so I persistently kept calling the service number and finally got to talk to a human (BTW, the message got responded to 3 days later.). They told me I had to get a replacement from Amazon (which seemed odd because of their return policy but I contacted them about it anyway). I sent Amazon an email and they directed me to the web page regarding the return policy. I replied asking them to push the mfg for some resolution and they said sorry we sympathize with you but we can't help you.Gee thanks for the sympathy card but, for a $1000.00 I expected a little more. Maybe on Dec 25th they could come and sing Kumbyah with me and my family and make us feel all warm and fuzzy?(I don't mean to sound materialistic but, I am tired of people taking my hard-earned money and handing me junk in return with no path to resolve an issue in a reasonable manner.)As of this writing (Dec 14th) I still have not seen or even heard from my local service \"certified\" center. I am completely unimpressed with there customer service and have no faith in the product or there ability to support it. Thanks Funai and Amazon for a wonderful holiday. My year long savings gone and my surprise gift is a bust. Right now I am sitting on a paper warranty worth $1000.00.Do yourself a favor and spend a few dollars more and buy your next TV from a locally trusted store. You will have a better chance at getting some courteous and prompt service if in the event you should need it. Also make sure you buy a unit from a different mfg. Buy from someone who knows what customer service is about. Funai really doesn't care all that much if you spent a grand on their product. They'll take your money and complacently get around to you and your silly problem on their terms.", "Date": "December 14, 2005"}, {"Title": "Great value, great delivery", "Author": "H. Bobb", "ReviewID": "RWMMMY4996WHB", "Overall": "5.0", "Content": "I couldn't be happier with this purchase. The delivery was professional. The picture and sound are great. This was a true bargain.", "Date": "December 21, 2005"}, {"Title": "6 Month Review", "Author": "J. Bryant", "ReviewID": "RAB3VN26NL5M", "Overall": "4.0", "Content": "It's a good buy.  I made sure I was aware of it's limitations.  Great picture so far.  sound is terrible but surround sound is not too expensive.  This is a great buy for the informed prepared buyer.", "Date": "March 25, 2007"}, {"Title": "Very good deal!", "Author": "Brian M. Keenan", "ReviewID": "R392DEQ1XBGQKR", "Overall": "4.0", "Content": "For the price this is a great tv.  The audio from the rear speakers is ok,  but that is the only thing I can say is unsatisfactory.  I have owned this product for several months and am very pleased with it's performance.  The picture with HD signal is awesome!  Also I have a progressive scan DVD player and it looks beautiful.  I've had people comment on how good it looks.  My Brother wanted to know when I got the HD DVD player, he was shocked that it was not an HD player.  You won't be dissapointed with this product or the price.BK", "Date": "March 2, 2007"}, {"Title": "Great TV at a great price", "Author": "J. Crowley", "ReviewID": "R3IHR9DJDF0DT", "Overall": "5.0", "Content": "I bought this TV before Christmas when it was on an extreme sale.  I didnt know what to expect, seeing that this was an EDTV instead of HDTV, and that \"what you get is what you pay for\".  When the TV arrived, i was pleasantly surprised.  It had a better picture than the 42in LCD Westinghouse TV i bought from Best Buy a week before!  I returned the Westinghouse one to BB, and kept this one.  I am very happy with it, and would recommend it to anyone.  I am still working on getting my computer hooked up to it though, as the TV has no VGA or DVI connector :(", "Date": "December 31, 2006"}, {"Title": "Great TV for a great price.", "Author": "J. Ford", "ReviewID": "R1FHYO2RB01D7E", "Overall": "5.0", "Content": "This was a great TV! I bought it probably a year or so ago and it served my family well for endless hours of television entertainment. Even though it was EDTV, it looked identical to HDTV. I've since given this to my sister for her to use in her college apartment.Because it's a 'monitor' and not a TV per se, it does not have a coaxial cable input. This can easily be remedied by running the coaxial cable through your cable box or DVD player.", "Date": "September 29, 2008"}, {"Title": "All I can say is WOW!!!", "Author": "M. Borys", "ReviewID": "R2Z7UZYJ0YNCGS", "Overall": "5.0", "Content": "If you are thinking about getting this TV DO IT!!! I bought it for my boyfriend for christmas and all I can say is that, for the money, it is amazing. The only thing I can say negative about it is that it is not cable ready. The picture is amazing. We love it so much I wish I would have ordered 2!!!", "Date": "January 18, 2007"}, {"Title": "MY 42 INCH PLASMA", "Author": "Antonio Baker", "ReviewID": "R3OSIBW02KZVOX", "Overall": "3.0", "Content": "This television is pretty good for the 699.99 that I paid for it.The sound is not great. I hooked up a souround sound system to mine.The picture is pretty good! I am pretty happy with this television.", "Date": "March 8, 2007"}, {"Title": "This is not a HDTV.", "Author": "NJer", "ReviewID": "R2R0H9NTHI41A2", "Overall": "3.0", "Content": "This one looks like a HDTV, but it is not, it is a EDTV.", "Date": "March 7, 2007"}, {"Title": "Great picture", "Author": "I. Bruce", "ReviewID": "RW4HM0NFT5FRE", "Overall": "4.0", "Content": "This LCD Monitor has a great picture and a good price. However if you do not mount it on a wall, and use it on the stand, the inputs are a little diffucult to get to. Overall very satisfied so far.", "Date": "January 10, 2007"}, {"Title": "READ!!!!", "Author": "Philip Jones \"Me\"", "ReviewID": "R1WEK1NMKCD5YV", "Overall": "1.0", "Content": "If you don't mind spending $800 on a smashed screen and waiting 4 months on a solution Dealing with the poorest customer service I have ever delt with, then this is the perfect T.V. for you.", "Date": "January 11, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "42\" plasma Monitor\nED compatible, 16.7 million color display\n16:9 widescreen aspect ratio, 1000:1 contrast ratio\n852 x 480 pixel resolution\n41.68 x 4.56 x 26.69 (L x W x H)", "Name": "Sylvania 6842PE 42-Inch Flat-Panel EDTV Plasma Monitor", "ImgURL": "http://ecx.images-amazon.com/images/I/51XWBC8M8QL._SY300_.jpg", "ProductID": "B000BTQPAO"}}