{"Reviews": [{"Title": "Impressive HDTV - Sony does it again", "Author": "Robert \"Robert in Seattle\"", "ReviewID": "R2G5B8WCG9ZD4Q", "Overall": "5.0", "Content": "Just bought the KDS-55A3000 at Best Buy a few days ago. I bought the Sony Blu-ray BDP-S300 a few months ago and loved the great sound and picture but I did not have full HD. So after much research I settled on the KDS-55A3000 to replace my older Sony 53\". My first Blu-ray disk I tried with the KDS-55A3000 was Casino Royale. I sat at the edge of my seat through the whole thing. The level of color clarity and contrast is stunning. The action was very smooth and no detectable jitter of the frame was seen. The off air tuner found all my digital channels in the area.The screen geometry is consistent and the blacks are a true black. One thing I noticed after setting up the tv is that there is a fan in the back \" It was so quiet, I did not hear it but saw the light from the projector and noticed the fan\" so ventilation is going to be important. If you have a bright room, this could also be an issue. The picture does fade a bit in a brightly lit room.  The software is well thought out and has more features that you will ever need. Great set-buy it!", "Date": "August 24, 2007"}, {"Title": "Simply Amazing.  Exceeds all of my expectations", "Author": "insly \"insly\"", "ReviewID": "R1TDXJ53SNC2YY", "Overall": "5.0", "Content": "First off, I've been a fan of Mitsubishi's in years past, never really gave Sony much thought, due to their cost vs. lack of features, in my opinion.Well, in this case, giving this TV a shot was the best choice I've made TV wise in my life.  The color on the set is AMAZING, with the native 1080p/24 and 120HZ motion, it is like you're shooting the movie yourself.There are a total of 6 1080P inputs, including Component and PC-IN, which is rare for a TV of this price.All in all, this is the first TV that I have legitimately no complaints with.  I've only had the TV for about 1.5 days, but usually by then in TV's I've had prior, I'd already found something I didn't like about it, that I would simply put up with.  This is the first TV that I can't find anything that I don't like about it.Time will be the true test, but so far this is definitely a winner and I can't imagine finding anything with a better picture in this price range.Enjoy!", "Date": "August 12, 2007"}, {"Title": "Three Dimensional Image", "Author": "Kurt D. Krinke \"K2\"", "ReviewID": "RN4EJO6YTRAH1", "Overall": "5.0", "Content": "I work in the broadcast/post production industry and see HD Video every day on high quality studio displays that are designed to accurately reproduce color and show imperfections and detail in signals.When I started looking at displays for my own basement I looked for accurate color, clarity in motion for sports, a theater mode to make DVD movies look and feel like they do in the theater.I looked at LCD, Plasma and Projection TV in my quest for a new TV.  The Sony A series was a clear winner as it delivers and excellent picture, 120hz  image processing and plenty of inputs.No matter which size you choose, this series is a winner.", "Date": "December 21, 2007"}, {"Title": "Yeah - this is it!", "Author": "D. Cherry", "ReviewID": "R1EB8LN7A83I15", "Overall": "4.0", "Content": "I did the research, bounced back and forth between LCD and Projection, DLP and SXRD, 46 inch and larger sets. My family really wanted the bigger set but I knew the cost of large LCDs were out of my price range. Once I agreed to look at 50-55 inch sets I knew I was going rear projection. I narrowed the list to Sony and Samsung. I really wanted the Samsung DLP because it sounded cool (millions of mirrors...), all the NFL hype, and I've had a couple of rebate problems with Sony products (and I usually do hold that against companies). I also liked the black glossy case of the Samsung TVs. But it ultimately came down to picture quality. What is the since of having something big if it doesn't deliver the best picture? I got the KDS 55A3000 without having seen it in person. Multiple website reviews were very complementary, and I have to say this is a GREAT TV. Shipping was a little crazy as it shipped from a location 20 minutes from my house, yet it took six days to get it (but it was delivered one day before the 'expected' delivery date). Didn't get any help with the setup from the delivery guys and I think in my case that was a good thing. Set up my NON-HD DVD Player and Receiver and watched \"HEAT\". Movie looked great. Don't worry about fan noise or color wheel distortion on this TV.", "Date": "December 12, 2007"}, {"Title": "WOW!  Best tv I have ever purchased!!!!!!!!!!", "Author": "elvisat1000ft", "ReviewID": "R3A659D20X1PJT", "Overall": "5.0", "Content": "The Sony SCRD 55A3000 is perfect right out of the box!  I almost bought a Bravia LCD, but this tv cost half as much and on HD content, it's hard to tell them apart.  The delivery was with Eagle, not one problem, they carried it in and waited untill I hooked it up and turned it on.  I really was leary of ordering online and getting delivered a beat-up box with damaged goods, but that was certainly not the case. I saved $540.00 with amazon.  Best deal around!!!!", "Date": "December 28, 2007"}, {"Title": "Be Aware of Eagle Delivery Service", "Author": "Gary S.", "ReviewID": "R24SECLI041QWX", "Overall": "4.0", "Content": "TV is excellent.  View it in action at your high-end Audio Video Store, as they will have a local cable or satellite provider, not the canned stuff shown on all HD televisions in the big-box stores. Then you will see what you get at home.Forget about what Amazon says about  \"Amazon's White Glove Delivery Service.  We believe that your purchase deserves a special degree of handling and delivery. To achieve the highest customer satisfaction, we provide a white glove delivery service that is designed to ensure that your purchase arrives damage free and in a timely manner.\"\"At your home delivery experts will place the carton in a room of your choice on the ground floor, unpack the product, and remove all packing materials from the residence. If you find signs of damage to your product, simply refuse delivery, and you will receive a refund.\"No so. The TV is well-packed by Sony, but my beef is with the Eagle delivery service. They were an hour past the four-hour window, first brought the wrong item, a sofa, from the truck on their too-small dolly.  Then took the sofa back to their truck for the TV.  When they got it down the driveway, instead of using the two handles SONY provided on the carton to carry it, they removed the TV outside, and may have incorrectly carried (which I found by reading the manual) the TV into the house.  But only after I told them of the Amazon instruction.  The delivery man showed me a *different* delivery ticket which did not say \"2Man Inside Unpack Detrash.\" But this is on the one I signed after the delivery.  I gave them a gratuity for moving our old TV to another location.  Wished now that I had asked Eagle if I could have picked up the TV in my truck.In summary, have a responsible person at home to make sure Eagle takes the SONY box inside by the handles, then removes the TV and places it on your stand, and follows the Sony instructions: \"Place one hand in the hole on the lower portion of the rear cabinet while grasping the top with the other hand.  Do not hold the by the pedestal or the front panel of the TV. Doing so may cause thes parts to break off.\"Enjoy your Sony Bravia SXRD", "Date": "December 11, 2007"}, {"Title": "Just great", "Author": "vadim4o", "ReviewID": "R1SWHTEJHSMEHN", "Overall": "5.0", "Content": "If you want big screen HDTV, why to pay twice as much for \"cool\" Plasma or LCD (unless you absolutely *need* to mount it on the wall)?Delivered by Eagle, no complains.", "Date": "January 14, 2008"}, {"Title": "This replaced my other Sony", "Author": "L. Lattie", "ReviewID": "R18MR5DRPXXXIN", "Overall": "5.0", "Content": "After doing a fair amount of research, I decided to buy a rear projection vs. plasma/LCD simply because I was not going to mount it on the wall.  I also decided to go with Sony because I really liked my old one.This is a fantastic TV.  I don't get into all the tech details, but it met all my expectations and exceeded some.  The picture is great, the sound is better than I thought it would be, plenty of inputs and the 1080p Blu-ray is amazing on this TV.Finally, Amazon was a great way to buy.  Great price, good delivery  You can't go wrong with this TV- especially from Amazon", "Date": "January 6, 2008"}, {"Title": "sony motionflow 120htz should be the new standard!!", "Author": "EDUB", "ReviewID": "R1L7TETH4X5XG6", "Overall": "5.0", "Content": "this tv is awesome!!! what more is there to say. from the moment i saw the picture on it @ a local retailer i knew right away this was to be my new tv. a few weeks later BAM there it was in my living room. 55\" of pure zen!! there is nothing bad to say about this screen...the picture is insane, sony did great with this motionflow 120 htz technology. other manufacturers claim to have the same 120 htz technology, but none, i repeat none, can produce the type of image quality that this screen can, trust me i looked. they may be able to clean up the jitter effect of other screens, but none reproduce the image. movies seem to pop out @ you. i have both blu-ray(ps3) and hd dvd(xbox 360) players(they're the same as far as i'm concerned) and all i can say is WOW! whether movies or games, they all look great! not to metion directv hd. i'm a home theater installer and whenever i demo this out to my customers they get out the credit cards and say \"i want one!\" sony has really outdone themselves with this one. i'm already saving up for the flat panel kdl-52xbr5 for my gameroom, and a 40\" for my bedroom. it's the flat panel versions of the same screen. i highly recommend this to anyone looking for there next tv. believe me and all the others that have already purchased this - look no further than these sony screens! you'd be foolish to. you won't be disappointed.", "Date": "January 3, 2008"}, {"Title": "Excellent", "Author": "Pete S", "ReviewID": "RE875N82MUYDD", "Overall": "5.0", "Content": "A great TV. Purchased in early January, I've only had it for about a month now, but have been nothing but pleased thus far. Picture clarity is fantastic, as is the color, and it's loaded with enough options to make any viewer happy. It's been said by some that the menu system is complicated, but any who have even the most basic understanding of modern-day tech navigation will have no problem at all. Plenty of inputs to accommodate most components.I only have three complaints, and all of them are VERY minor. The first is that the TV lacks a USB input, so connecting a camera or memory stick for slideshow viewing is not possible. In its place is a PC input though, so one could easily play the show on a computer, or even burn a DVD of the photos to play in a DVD player.The other two gripes are even more minor... the \"mute\" message stays on the screen at all times (when muted), which annoys me only b/c when watching a DVD I use only the 5.1 speakers, and it would be nice to just press mute rather than have to scroll the volume down every time. The other gripe is that the \"TV\" input cannot be removed from the input selection list, unlike all of the other inputs. I don't use the coax input at all since I have an HD cable box via HDMI, so I would like to get it off the top of the list. As I said, these are about as minor as one can get.Just as a warning to any that aren't super informed about HDTV tech, this is a rear-projection system. That means four big things:1) It will take a healthy 30 seconds to put a picture on the screen once turned on, and even then it will be dark for another 30-45 secs until the lamp warms up.2) Since it does run off a lamp, which is estimated to last about 8,000 viewing hours, it will eventually need to be replaced, which will cost about $150-200 but can be easily done by the owner.3) The TV is approx. 16\" in depth, which means it CANNOT be wall-mounted, and needs to have a substantial base to sit on.4) Since it is a projection system, viewing angles become very important. Viewers looking at the TV from extreme left or right angles will see a darkened, faded picture. An even more important consideration is vertical viewing angle. Unlike LCD or Plasma, this cannot be viewed from much below or above the set, lest you get the faded picture. Estimate the height your eyes are at when you watch TV, then plan your TV stand purchase accordingly to get the center of the screen as close to that height as possible.Those points listed above are not complaints, as I was fully aware of those factors prior to purchase. I have listed them here to help describe the product in full.All in all, a great machine that we've been very happy with. And really, a well-performing, 55\" 1080p screen for this price is a bargain that's hard to beat.", "Date": "February 5, 2008"}, {"Title": "SONY KDS-A-55-3000 SXRD /I CAN SEE CLEARLY NOW", "Author": "Dwight Delarge", "ReviewID": "RXF8C3VP1B3HV", "Overall": "5.0", "Content": "THE SONY KDS55-3000 HAVE MET AND EXCEEDED THE REAR PROJECTION HDTV EXPECTATIONS.  CLEARLY THEY HAVE(SONY) SEEN AND MET THE LCD QUALITY OF PICTURE IN THE REAR PROJECTION FIELD. DEEP DARK BLACKS, EXTREMELY HIGH RESOLUTION, AND VIBRANT COLORS MAKES THIS IN MY OPINION, THE BEST REAR PROJECTION HDTV I HAVE EXPERIENCED TO-DATE.THE DELIVERY WAS GOOD, ON TIME AND PROFESSIONALLY HANDLED.  I AM MORE THAN SATISFIED WITH THE SERVICE FROM AMAZON.COM", "Date": "December 25, 2007"}, {"Title": "Very Satisfied , Quality Sony TV", "Author": "American Liberty", "ReviewID": "R2YIXCOLKF78MW", "Overall": "5.0", "Content": "Does not take up much more space than a flat screen and performs very good. I would buy it again", "Date": "December 14, 2012"}, {"Title": "Great value, great picture", "Author": "Omar L. Gallaga", "ReviewID": "RLLOH2RHB0FQX", "Overall": "5.0", "Content": "Sony Bravia SXRD KDS-55A3000 55\" 1080p Rear Projection HDTVReally beautiful picture and very easy to set up.  We considered the 52\" Bravia LCD, but couldn't justify spending so much more for comparable picture quality when we didn't really need a flat-panel.We did a lot of research and the reviews here and on Cnet were big factors in making our decision.We're using it with DirecTV HD channels, a PS3 at 1080p and an Xbox360 with an HD-DVD add-on at 1080p over component. All produce a fantastic picture. WE couldn't be happier.Only negative is that it takes longer to turn on than our older Toshiba HD RP set.  But other than that, no complaints.  The built-in digital tuner picks up a lot of local HD channels and works great, too.", "Date": "February 8, 2008"}, {"Title": "Great HDTV if you can find it.", "Author": "Sudhir P. Moolky \"sodapop\"", "ReviewID": "R2DSSLIM7A7EW3", "Overall": "5.0", "Content": "Sony is discontinuing this great RPTV. It has an Editor's Choiceaward on cnet.com, grab it if you can. This TV is simply stunning whenpaired with my Sony PS3. Spiderman 3 and BBC Planet Earth look awesomein 1080p.Ordered it through Amazon/Crutchfield. Shipping via Eaglewas a little bit inconvenient, they shipped from the East Coast onMonday and arrived in Portland, OR on Friday. However, it arrivedlate morning so it didn't get loaded on the local delivery truck.I was told I could pick it up but my deal included white gloveservice (deliver and set up on stand) so I had to wait till Mondayfor that. While I did manage to get to their tracking web site, itwas pretty much useless as there was an entry for pickup on the EastCoast and then a local arrival entry 5 days later. Nothing in between.Service by Amazon and Crutchfield were good though.", "Date": "February 5, 2008"}, {"Title": "Beautiful picture", "Author": "Kristina K. Moore \"Sunnykmoore\"", "ReviewID": "R3A3G4G5I6WN7", "Overall": "5.0", "Content": "This television is absolutely crystal clear . . . we just wish we had more HD channels to watch on it.  I am very satisfied and would purchase again from Amazon.  We had it delivered by Amazon's white glove service and it came with a cracked screen, Amazon was quick and efficient in getting it returned (we refused the initial delivery) and they got us a new one out immediately.", "Date": "January 12, 2008"}, {"Title": "Best TV I ever purchased!!", "Author": "J. King", "ReviewID": "R2BL58VFYRSNGD", "Overall": "5.0", "Content": "I received this TV yesterday, and right out of the box it blew me away!!  The picture is absolutely stunning.  If you are looking for an excellent RPTV, you will not go wrong with this one.  It's one of the best investments I've ever made.And Eagle delivery was excellent as well.  They were courteous when they called me to set up a delivery time, and the two drivers were also friendly and courteous.  The whole purchasing process from Amazon was excellent from start to finish.", "Date": "December 22, 2007"}, {"Title": "How did I watch TV before?", "Author": "Dominic A. Apodaca", "ReviewID": "R1MN4Q71IV8C32", "Overall": "5.0", "Content": "I just bought the TV yesterday.  It is Amazing.  Everything looks great on it (SDTV/HDTV).  With my xbox 360 (component), it looks great.  I now need to pick up a VGA cable so I can go up to 1080p for my HD add on.  The only draw back is that there is so many settings.  I am going to have to go through it but everything looks good with the default settings.  There are very few projections that have this amount of connections.  This is the best all around TV for Games, movies, and TV", "Date": "December 17, 2007"}, {"Title": "Best HDTV 55\" SXRD projection.", "Author": "Jerry R. Reynolds", "ReviewID": "R3DWH3TBE7Y50Q", "Overall": "5.0", "Content": "I own a 42\" LCD projection Sony and a 40\" Bravia Flat screen. This HDTV rivals both of those HDTV's.Any person who wants to save $$$ on the popular \"flat screen\" This SXRD is highly recommended!It's full 1080p picture is the best color and sharper picture than my 40\"Sony Bravia flat screen.You will not be disapointed with this HDTV. It's reviews are true to the word.Voted best overall picture by CNET and other profesional tech reports.Very happy with this TV!", "Date": "January 28, 2008"}, {"Title": "Great Value!", "Author": "D. Bradt", "ReviewID": "RUHJ5A4QJFGAA", "Overall": "4.0", "Content": "Very happy with the transaction. Great value when you compare the bang for the buck.", "Date": "January 20, 2008"}, {"Title": "PC input problem", "Author": "Petrucci \"Book lover\"", "ReviewID": "R9YDR8IM6NHP2", "Overall": "4.0", "Content": "I am really happy with my purhase so far, the picture looks great. My only problem with the TV is that it cannot do 1:1 pixelmapping in 1080p when I hook up my computer to the TV. The picture looks distorted, certainly not 1080p.If you are planning to use this as a computer monitor, go with something else.", "Date": "December 22, 2007"}, {"Title": "Lamp blew after a year and a half", "Author": "G.M.", "ReviewID": "RLKQA1EPLA1TM", "Overall": "1.0", "Content": "We loved this TV until the lamp blew after only a year and a helf and we had to pay $296 with taxs and shipping to replace it.  It blew a couple days into the Winter Olympics and Sony kept delaying shipping so we missed most of the games.  Very unhappy with the product and SONY customer service!", "Date": "February 24, 2010"}, {"Title": "Bravo for Bravia!", "Author": "Grand Poobah", "ReviewID": "RCIZW1HH8A9NM", "Overall": "5.0", "Content": "This RP (Rear Projection) HDTV was recommended to me by colleagues that own them.  I am glad I listened to them.SUPERB picture quality (it won a best picture award in 2007) and plenty of inputs (the side inputs are very convenient). GREAT TV FOR SPORTS (120 hz)!  TV is 82 lbs., 36\" tall, 50\" wide, and 16\" deep.  I also recommend the TV stand by Pinnacle Design (mahogany wood/glass shelves, sells @ Best Buy for around 300 bucks, SKU# 8181674).Don't spend the extra money on an LCD or Plasma!  This TV has a better picture and sells for around $1,750 (Feb 2008).  If you must go Plasma, stick with Panasonic or Pioneer.  If you must go LCD, stick with Sony, Sharp or Samsung.  Still, you will be spending $2,500 to $3,500 going the LCD/Plasma route.  Save the money and spend it on your cable/satellite bills, a surround-sound system, Blue Ray DVD player, kids college fund, or a few nights out on the town with that \"special woman\" in your life.Make sure to read the manual as it covers the many different functionalities of this outstanding TV.  I know it sucks to read a manual...but trust me... you will learn tons of valuable information.You will not be disappointed with this TV!  You can thank me later.Grand PoobahSony Bravia SXRD KDS-55A3000 55\" 1080p Rear Projection HDTV", "Date": "February 27, 2008"}, {"Title": "Very nice TV", "Author": "Daniel Ficca", "ReviewID": "R1844XD4LMX7N6", "Overall": "5.0", "Content": "I wanted a 50+ inch TV for my living room and the only affordable option was a rear projection. I was impressed by the picture on the 55A3000 within minutes the TV was setup and the defaults even looked really nice. This TV has tons of different picture settings so as I spend more time with it I should be able to get it to be even better. I encourage anyone to check the reviews on CNET.COM before buying any electronics and this TV is a CNET editors choice for Nov. 2007. I also have a 42 inch Panasonic plasma and this TV looks just as good.I was a little nervous about buying from Amazon because of the shipping. Eagle was actually really quick and all around did a good job. I live in Philadelphia and it seems they ship out of Harrisburg so that might have had something to do with the speed. Eagle gave me a 4 hour window for delivery of 12-4, but since I had to work I left my work number for the driver and he called 30 minutes before delivery (which was before 12:30) and 2 guys came in, set the TV on the stand and offered to take the box with them.Everything went perfect and I saved almost $500 over BB and CC when tax is included.", "Date": "December 28, 2007"}, {"Title": "Great product --ontime shipping lacking", "Author": "andrew", "ReviewID": "R1IRJE0G839L5Z", "Overall": "5.0", "Content": "I love this tv.  I have owned the a2000 series and now the a3000.  The only problem was the shipping.  First it was well past the date.  I was told they had tried to contact me and basically was told it was my fault.  The number they tried to reach me on was an unkown number.  I don't kno any respectable company that calls on unknown numbers.  I don't answer them and I'm sure you don't either.", "Date": "December 3, 2007"}, {"Title": "nice but complicated", "Author": "panda \"panda\"", "ReviewID": "R2M3K6MRKHR7Y3", "Overall": "4.0", "Content": "I bought this TV from Circuit City because it was actually cheaper on sale than at Amazon (unusual). (I paid $1700 +tax)The TV is beautiful with thin edges on the screen giving a desirable \"all screen\" look.On HD channels, the picture usually looks beautiful - but there are some exceptions (might be the particular show - also I receive my signal from cable)The problem with this TV is that it is entirely too complicated - the picture and video menus allow you to control an overwhelming number of variables. I think for the average person, this is confusing and complicated.I did try the suggested settings from cnet review, but I really don't understand all of the variables. A little less choice and more automation would be better.My other complaint is that non HD channels may actually look worse than a regular tv - this may be true for other HD tv's as well.I am experimenting with the myriad of settings, and there are times when the picture is stunning - I may end up liking this tv more in the future.", "Date": "January 17, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full HD 1080p Picture Resolution\nBRAVIA Engine� EX\n1080p Input, HDMI� x3 (1080/60p, 24p,CEC, xvYCC)\nDMeX compatible - BRAVIA® Internet Video Link Ready\nBRAVIA®Theatre Sync�", "Name": "Sony Bravia SXRD KDS-55A3000 55-Inch 1080p Rear Projection HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41BevCz25%2BL._SY300_.jpg", "ProductID": "B000TME4EW"}}