{"Reviews": [{"Title": "A \"Must Have\" for family tv viewing!", "Author": "Sheri \"musical lover\"", "ReviewID": "RG2EVIMEB0GXX", "Overall": "5.0", "Content": "We love our TV Guardian!  It is so simple and yet so effective.  It mutes the volume when offensive language would be spoken and it places a written text on the screen that is not offensive but keeps the flow of the movie or show going.  At first it seems odd for the sound to drop out while you are watching a program, but you get used to it very quickly and after a short while you are amazed how much bad language you would be exposed to without the TV Guardian.  It is very difficult to watch tv without the TV Guardian now because we are so used to having the foul language filtered out.  I would not hesitate to purchase this product.  In fact, we are giving it out as presents this Christmas to our family.  I thought it would only work with DVD movies, but it actually works just as well with the regular TV channels.  Basically, anything that uses \"closed captioning\" will work with the TV Guardian (there is one exception, for some reason - Universal Studio movies DO NOT get filtered.  I think they use a different format for their closed captioning?).  Again, we love this thing!", "Date": "December 12, 2007"}, {"Title": "I KNOW TVG PRODUCTS OUTSIDE AND IN - EXCELLENT PRODUCT - TOO BAD WE DIDN'T HAVE IT YEARS AGO!", "Author": "Wilcox1976", "ReviewID": "RH4JV68SKUY2Q", "Overall": "5.0", "Content": "TV GUARDIAN AND CURSE FREE TV are terrific products. Why does Hollywood have to spoil an otherwise fantastic movie with a lot of really foul and disgusting language. Well with TV Guardian you can stop that!APPLICATIONS: Virtually all programs have closed captions (except some DVD's).  TVG reads those captions and mutes the audio for the phrase.  If you have it enabled it can place a replacement phrase on the screen. It has a switch to disable it if you want to watch Christian-religious programming without filtering.ACCURACY: Most of the time the accuracy is very good but there can be certain times when bad words can slip through.1) Closed Captions are not accurate: TVG will miss word if is not in the caption.2) Closed Captions are garbled: if the closed captions are not clean, TVG can miss them. example: Weak TV signal, Tracking on VCR miss adjusted, DVD picture quality issues.3) TVG has not synchronized on the Closed Caption signal: TVG Take a second to synchronize to the CC signal. Words can slip through during fast forward/rewind, changing channels etc.4) Captions not aligned: This can happen with some broadcasters. The captions and spoken words are not in alignment so TVG mutes at the wrong time and takes out words it shouldn't or vice-versa. Live programming/newscasts can be a problem for the same reason.BREAK-IN PERIOD: Not for the TVG, but for viewers.  TVG filtering takes a little getting used to.  Initially you may not like it but stick with it for a month and you will wonder why you watch TV without it!HOOK-UP: TVG is a filter and as such it has to be hooked up between your TV and the source of the programming (DVD, VCR, Cable/Satellite box). TV Guardian will not work with your TV's internal Tuner or if it has a VCR or DVD built-in it will not work with that either. The 101 will handle Composite video and line level audio from Red/White/Yellow RCA jacks/cables. That HAS to be the input to the box. It does have some screw connectors for coaxial cables but, in this day and age, forget about them you will get better picture and Stereo sound by using the AV outputs. (The output coaxial connector is a throwback from days when TV's did not have AV terminals).FAQ FAQ FAQ FAQ FAQ:Suppose I have more than one source do I need more then one TVG? NO. Most sources can be \"daisy-chained\" together e.g. the output of one device can be fed into the input of another device and finally to the TVG. If that is a problem, then the model 201 and 401 have 2 inputs OR you can use an AV switch box.Can I use it with Dolby 5.1 Digital Audio? Only for orange Coaxial connections (no Toslink optical connections). Use one of the Audio inputs/outputs for that.Can I use it with my HD Television? YES! HD TV's like most things today are backwards compatible. It is more of a question of what kind of signal connections from your source are you going to use. HDMI connections will not work - Contact TV Guardian or Family safe Media for a model 501... it will handle two HDMI input connections.So what kind of sources are compatible with my HDTV? Any type (VCR, DVD, VCR/DVD Combo, Cable Box, Satellite Box, TiVo, old Pioneer Laserdisc format) that has standard AV connections Red/White/yellow.What about Component Red/Green/Blue (YPbPr) connections? If they are in the Standard Definition 480i format then there is a connection workaround that can be used.What about Component output in higher resolutions? That can be tricky, but there is a workaround for that too, however that connection would not support on screen captions.Can I use TVG with BluRay Player? YES and NO. BluRay DISCS do not have closed captions, but some standard DVD's do. So you can use a BluRay Player with Standard DVD's that have closed Captions but not with BluRay discs. You have to use connections that are compatible with your TVG too, NO HDMIDo I have to see the captions on the screen? They are distracting: NO.There are 3 caption modes:NONE - no captions at allON - always show captionsCUSS - Replacement captions to cover muted phraseHow reliable is the model 101-Curse Free TV? The units are very reliable with careful use and can last many years.Hints:1)Do not use pencils or pens to change the recessed switch settings in the back. Pencil Graphite powder is conductive and will short out the switches. I can repair the unit if that is the case.2) Use care when installing and removing the RCA jacks - the connector in the back is easily broken if plugs are forced in and out. Use a gentle twisting motion when installing or removing. If the connector gets broken you will have audio and picture quality issues. The broken connector can not be repaired it must be replaced - contact me since I do repair them. Do not attempt to resolder it since it will damage the circuit board and make the unit unrepairable.3) AC adapters do go bad. If you see horizontal bars rolling up or down the screen you may have a bad adapter. I sell perfect replacements that are the correct size, voltage and current rating.4) Connection issues with the RF screw on connector. If this is a problem and even if it is not, you will get the best picture by using the bottom RCA cable connections to your TV set.  Forget about the RF output.What is the red capped coaxial connector used for? NOTHING. It is a feed through connection for when the unit is unplugged. Since TVG's do not use RF signals from a coaxial cable  as an input it serves no purpose.  Why is it there? Just purchased the device (RF Modulator) that way. VCR's used to have this type connections.I have a model 101 but it does not filter.  What can be the problem? Most of the issues here can be broken down into connection problems or there are no closed captions to be used for filtering.Connection issues: The unit works only on Video and Audio Line level inputs (Yellow/White/Red). They feed to the Top row of RCA connectors. The bottom row of RCA connectors are hooked up via a cable to an available input on your TV set. Note that some newer sets are eliminating the Yellow Video connector and incorporating into the Component Video Connectors. In that case normally the Green connector can be used to hookup the Yellow video signal. Once you have it hooked up fire up the Source (play a tape or DVD etc), plug in the TVG (red light on front) and select the input you made the connection to on the TV. You should see the source material playing on the TV. IF you unplug the TVG power the picture on the TV has to go away. If it does not you are not \"looking\" at the TVG with the TV's input. DO NOT HAVE ANYTHING HOOKED TO YOUR TV's ANTENNA INPUT. If you do that source will not be filtered. Do not use either of the screw-on connectors on the TVG box.Caption issues: If there are no captions TV Guardian is not Fail Safe... It lets everything through. It will only filter if closed captions (and bad language) are present. To test this, while TVG is connected correctly, Set the Caption switch to the \"ON\" position.  You should see rolling captions on the screen.  IF YOU DON'T IT IS BECAUSE THERE ARE NO CAPTIONS AVAILABLE. For the sake of testing, play a prerecorded VCR tape (just about all of them have Closed Captions). If TV Guardian filters at all the problem is not TV Guardian.You can contact me if you need help.", "Date": "October 6, 2011"}, {"Title": "a wonderful thing to have if you have kids and don't want to expose them to all those terrible words!!", "Author": "SCRAPPYHAPPY \"LOVE TO SCRAPBOOK!\"", "ReviewID": "R2Q540QDRGWQR4", "Overall": "5.0", "Content": "I LOVE our TVGuardian!!  they are phenominal.  It lets us still watch tv, but I sure wouldn't watch it without it!  It mutes the bad words on the tv.  I don't know why hollywood feels they have to ruin a good movie in the first place, but they do!  This helps us as parents still protect our children and watch a good show...you still have to watch the sexual content though, it doesn't get rid of any visual!", "Date": "January 2, 2008"}, {"Title": "Outdated but great value", "Author": "Fire/Medic/Dad", "ReviewID": "RH8D8YRT6MDLF", "Overall": "4.0", "Content": "This is possibly the oldest version of the TV guardian and uses coax cable hook ups.  Might not work for your TV/video player.  We have a DVD/VCR combo and don't use HD features so this works great for us.  Our kids enjoy watching some of the movies we're also more interested in that are maybe PG but still have a lot of language that isn't acceptable in our home. Buyer beware, a few production companies don't use \"cc\" closed captioning (they use \"English Subtitles\", similar, but slightly different) so the TV guardian won't work on them.  Make sure you see \"cc\" on the label of your movies before you watch them with your kids.", "Date": "March 6, 2012"}, {"Title": "Works well if have correct equipment to use it on.", "Author": "Paul Newhouse", "ReviewID": "R3RKMMGM1MG5KO", "Overall": "3.0", "Content": "I chose this rating because it works good on older vcr/dvd players but does not work with newer ones because there is no \"cable\" input to them.At the time I purchased 2 of them for each TV I have, but one is a flat screen with a new dvd player and it won't hook up to it.So I have a unit worth over a hundred dollars sitting in the closet. Money wasted!!!!!!!  Not enough information when I bought it......I recommend it for people who have old equipment.", "Date": "January 25, 2013"}, {"Title": "Watch Movies & TV free of unpleasant language!", "Author": "Randy A. Barnes", "ReviewID": "R3BNCNR5OWFN4N", "Overall": "5.0", "Content": "The TVGuardian and this distributor deserve the highest rating possible because they both work to get rid of the lowest language in anything you view through a TV, DVD or VCR!  After the TVGuardian is connected (which is very easy to do), you just sit back and enjoy what you are viewing without worrying about all that unnecessary bad language.  This isn't just for people who have kids.  I actually purchased my first TV Guardian when my children were grown!  I purchased this one for some close friends of mine who are in their sixties!  As you can see, I recommend this product for anyone of any age who wants to eliminate unnecessary bad vocabulary.", "Date": "March 15, 2013"}, {"Title": "wont work if you watch tv through receiver", "Author": "D. Palmier \"schnauzermom\"", "ReviewID": "R40P6IB3FQIFF", "Overall": "1.0", "Content": "Won't work if you watch tv through your receiver.Tech support was great they quickly got back to us but sadly said thatwill not work when you watch tv through a receiver.I so badly wanted this to work.I wish they had a way for it to workhave to return", "Date": "July 10, 2013"}, {"Title": "unfortunately it doesn't work with my magnavox dvd player", "Author": "William Huggins", "ReviewID": "RQDKWSEZ78C8O", "Overall": "5.0", "Content": "I am very impressed with the professionalism and honesty of the seller of the tv guardian.They were extremely helpful and courteous with their information on returns and credited my account as soon as they received their product back.I will definately do business with them in the future and recommend them highlyA very pleasant shopping experience......Bill Huggins.", "Date": "December 9, 2011"}, {"Title": "Great item to own!", "Author": "Laura Faulk", "ReviewID": "R3A118G2BN5FZ4", "Overall": "5.0", "Content": "All of our family uses the TVGuardian and we couldn't watch TV or DVDs without it! I am so pleased that this item is still available through a reputable seller. We have used this seller for repair service of another TVGuardian we bought. He is the best!", "Date": "May 2, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "The TVGuardian automatically filters profanity and other offensive phrases while you watch your favorite movies or television shows.\nEasily Connects Between a TV and VCR, Cable Box, Satellite Receiver, and most DVDs*.\nStrict and Tolerant Filter Settings - 95% accurate in muting profanity of closed-captioned sources.\nThree Closed-Caption Settings - Strict, Tolerant and Off.\nLimited One Year Manufactures Warranty", "Name": "TVGuardian: The Foul Language Filter", "ImgURL": "http://ecx.images-amazon.com/images/I/51fzY00o9ZL._SX300_.jpg", "ProductID": "B000WZ16RY"}}