{"Reviews": [{"Title": "Best plasma at this price right now", "Author": "Robert E. Huebner \"early adopter\"", "ReviewID": "RBPZKPZ97IC57", "Overall": "5.0", "Content": "I was an early adopter of Plasma technology and have owned a Pioneer 50\" Plasma as my main display for a few years now.  I love Plasma in general, so decided, now that prices are coming down from the stratosphere, to get a second plasma set for a bedroom TV.  All I can say is things have really come a long way!  Early plasmas had problems displaying detail in dark scenes, but new models such as this Samsung have come much closer to solving this problem.I auditioned dozens of sets at multiple dealerships and did a lot of side-by-side comparisons and adjustments, and determined that these newest Samsung sets represent the best blend of performance, quality, and cost.  My requirements were to have at least 2 HDMI slots, since this is the future for high-definition connectivity, be 37\" or 42\" in size, and have the best quality picture I could afford.A lot of on-line advice pointed to the Panasonic as the one to get so I went into this fully expecting to end up with a Panny, but after much side-by-side between the Samsung 4253 and the newest Panasonics, there was no contest - the Samsung has more natural looking color gradiations, the Panasonic looked odd and banded in appearance.  I verified this at multiple vendors and side-by-side.Be careful however not to get re-directed to the previous generation Samsung models, many of which are still on the market and sold as new.  Samsung seems to be replacing their lined up with these newer sets in a graudal manner.  At least two other 42\" models ending in \"2\" instead of \"3\" can be found at various retailers.  To me, these older sets did not measure up to the visual fidelity in the \"3\" series.  Over time I'm sure Samsung will make \"3\" versions of their other sets, so if you need one with a CableCard tuner or something, I'd wait a while.  Also I wish this set had more stretch options for dealing with 4:3 inputs.  The only options for HD signals are 16:9 or 4:3 with bars, neither of which helps deal with HD signals that are letterboxed AND 4:3 (common for cable boxes that up-convert letterbox SDTV material).  I'm not sure which sets do have these stretch modes, but I beleive some do.Also, Plasmas are moving very fast right now, with Pioneer due to release new models any day, among others.  Waiting a bit longer if you're in no hurry may turn up a set even better than this at the same price.  But as of Spring 2006, I am very confident this is the best 42\" plasma in the ~$2k range.", "Date": "June 4, 2006"}, {"Title": "Samsunt HP-S4253", "Author": "Ricky R. Dearstyne \"RD\"", "ReviewID": "R2FQ9C1FY2V83W", "Overall": "1.0", "Content": "I purchased this plasma via Amazon after extensive research in store and by reading many reviews on-line.  The purchase and delivery process went smooth.  That's where my good comments stop and the problems began.  The TV had a great picture, awesome in fact, but there was an audible buzzing sound as soon as the TV was hooked up.  Time Warner came to my house 2x and gave their equipment a thumbs up.  In fact they brought their own plasma, high def TV and hooked it up without a problem.  This is when Samsung's \"authorized\" service people came into the picture.  After 2 trips to my house, they took the tv away for service, brought it back 11 days later, and it still buzzed.  I refused to accept delivery.  The service people are now trying to blame the wiring in my house or the cable equipment(again).  Samsung has to this point refused to give me an exchange or refund my money. Seven weeks after purchasing this product in good faith, all that I have to show for it are an increased cable bill (for high def) and a mounting plate on the wall where the tv should be.  I make these comments about service, because when you buy a product like this, the service is an important component; just as important as the product itself.", "Date": "September 24, 2006"}, {"Title": "Nice TV but has glitches", "Author": "Kevin Mccarthy Jr. \"kmccarthy\"", "ReviewID": "R3HLZ24NTBEM1H", "Overall": "4.0", "Content": "After spending 6 months researching HDTVs I got this Tv over Memorial Day weekend from Amazon for a great deal, $1899.99.  No shipping and no tax can't beat the price for one of the better plasmas on the market.But there are a couple of issues with this tv.  Don't buy it over the panasonic because of its PIP option.  The PIP can only be used when a HDMI tv feed is on or another hookup besides componenet for television viewing.  This leads to the other problem.There is a glitch with the HDMI.  So if you are utilizing the AV ports for a playstation or DVD player the tv can't understand which source to pick.  So if you are watching tv,  But then want to watch a DVD you can change the source to the DVD player (the AV input) but when the movie is done you can't switch back to the HDMI input.  The tv no longer recognizes the connection.  This was a great pain for me.  I purchased a HDMI/DVI wire for my cable box.  And the first time a changed the source to the AV for my playstation and I was able to play it but when I was done the HDMI feed was no longer an option.  So I spent the next day and a half going through my connections and calling the cable company which told me to contact my tv manufacturer.  Samsung said that the tv has a glitch and the tv must be reset (there is no mention of how to reset the tv in the owner manual).  So now  everytime a change the source to the av port I must reset the tv whcih consists of unplugging the tv waiting 30 seconds, hitting the power button on the tv itself 10 times, plugging the tv back in, turning the tv on and switching the source.This problem doesn't occur if your cable is hooked up via component and the picture is basically as good as the HDMI feed(I will proably switch it back to component once a get over that a spent $100 on a Monster DVI to HDMI cable and won't use it.Other than that te tv is great.  It has a much better appearance over the panasonic.  HDTV is awesome.  SD is ok; comes in better for some some stations than oters.  Speakers are above average.  Overall this is a very impressive tv if you can get beyond the glitch.  Sports are amazing feels like you are there, nature shows are extremely impressive.  The TV has great colors and true blacks.", "Date": "June 29, 2006"}, {"Title": "one sexy plasma", "Author": "D. Babiy", "ReviewID": "R2PBWRWSQCXS0X", "Overall": "5.0", "Content": "I did a bunch of comparison shopping before I settled on this one. In this price range it was down to 3 plasmas, the Panasonic TH-42PX60U, Hitachi 42HDS69 and this Samsung HP-S4253. I did my research online, and there are plenty of people praising all the models, each with their own issues. Apparently the Panasonic has \"clay-face\", Hitachi has a green push, and this Samsung is a \"buzzer\". I went to best buy and circuit city to take a look for myself. Each store I went into I felt differently... because stores don't calibrate the monitors they get and I was seeing different results. Customers play around with the image settings, leave it looking crappy, and others judge the TV based on what they see without checking settings. Anyway, after I played around with the settings of the all the TV's... I did notice the Hitachi's green push which bothered me enough to take it off the list. Now the Panasonic does have a great picture but the case (matte silver with matte black frame) just makes it look a bit cheap and not as slick as the Samsung. The Samsung with its shiny black finish looks much richer in my point of view. Since picture quality is great on both monitors the only things that was worrying me is to get a \"buzzer\" which quite a few people complained on forums about. Its natural for all plasmas to buzz a little bit when your ear is 1-2 ft away. But some say they get buzzing sitting on the couch. I decided to take the chance and made sure when delivery came, I took it out and turned it on before I signed for it with the deliver guy. If it was going to buzz loudly I was planning on simply declining it, but luckily I got a good one.Now I must say I don't know how SD quality picture compares between the Samsung and the Panasonic since I don't have them side by side and in store they were all showing HD pictures... but I have to say that SOME SD channels on my Samsung look crappy while majority of the others are perfectly fine, it really depends on the quality of the broadcast. I watch mostly HD and DVDs so i'm fine.Regarding burn-ins... all plasmas suffer from this, so just try not to watch anything with black bars on the side for too long... and its also recommended that for the first 100 hours you \"Break in\" your TV by watching things with picture settings at no more then 50... which is a bit dull, but I'm willing to deal with it for a bit if it prolongs the life of the set in the long run.Also if you want to calibrate the monitor yourself you can get the AVIA dvd calibration... or you can try the settings I got.DNIE - Turn it off (it makes the blacks way too black and you loose shadow detail)Contrast - 80Brightness - 67Sharpness - 20Color - 50 (I don't have the color filters to properly adjust this, but it looks great to me so I left it at 50)Color Temp - Cool 1 (the warmer temps make things a bit too orangey for me, just pay attention to whites when changing this)", "Date": "November 16, 2006"}, {"Title": "Great buy, better than last year's model's", "Author": "Chris Caspen \"HDTV\"", "ReviewID": "R2Z9EEVUR4IEL7", "Overall": "4.0", "Content": "The Samsung HP-S4253 42\" Plasma HDTV is definately a step up in all areas from it's previous Samsung plasma TV models.  It's able to produce a 536 Billion color gamut.  This sounds like a big number, and it is, but just for comparison an LCD generally produces about a 6 million color gamut (some are higher and some are lower) yes that's million and not billion.  A single chip DLP projection TV will produce even less then that.  However, 536 billion is not a huge number when compared to other plasma TVs, infact it typical of most Plasma TVs (Another reason for Plasma over LCD).  The 10000:1 contrast ratio is one reason this gamut is possible on a plasma.The Samsung HP-S4253 42\" Plasma HDTV features two High-Definition-Multimedia-Interface inputs which is ideal for your next generation DVD players, your HDTV source (satalite/cable), or your 7.1 surround sound system.  2 inputs are better than 1 epecially when it comes to HDMI, where an HDMI splitter retails for over $100.  The television also is equipped with a built in ATSC-tuner so you'll be ready for free over-the-air High definition or digital broadcasts.  The television looks brilliant from both a graphical stand point and also an aesthetic one.  The HP-S4253 looks beautiful with a sleek piano black finish which can easily be mounted on a wall or set on any suitable surface.  It has to be one of the most aesthetically pleasing plasma's on the market, as long as you keep it dust free as it seems that dust is more noticable on this television than others.", "Date": "May 22, 2006"}, {"Title": "DID THE COMPETITION WRITE NEGATIVE REVIEWS?", "Author": "Alexander J. Graham \"Grahamboat\"", "ReviewID": "R202XXEKD96JS6", "Overall": "5.0", "Content": "If you are reading these reviews you are probably considering buying a Samsung HP-S4253 from Amazon. Three weeks before I purchased this set I read all of these reviews as well as reviews from other sites. While the majority of all reviews were positive there were enough negative comments to make me pause. I have always suspected that many \"consumer reviews\" are written by the representatives of both the manufacturer and the competition, so I take all reviews with a grain of salt. The following is a synopsis of my experience.Even though I have purchased many expensive items from Amazon, I still had some hesitation in ordering an HDTV on-line, but a $400 savings over any \"Big Box Store\" gave me the courage to give it a try. I chose Standard Delivery a.k.a. free shipping. The set arrived 10 days after I placed my order. It was delivered by two men from the freight company who carried it up my stairs and set it up on my stand and removed the boxes from my house. I always tip these guys as they go beyond what's required.The cable company was coming the next day to hookup a high definition set top box, but I wanted to see how it looked with just digital cable, so I hooked it up with the plain A/V cable. The setup was easy, mostly automatic. The picture and sound were truly magnificent.The cable guy, sorry I couldn't resist, came the next day and installed an Atlanta Scientific Explorer 8000 set top box, a DVR with 80 hours of record time and HDMI connections. As I wanted a better DVD to go with my new TV, I also order a Samsung DVD-VR335 form Amazon. This unit is a combination DVD player/recorder plus VCR which has the ability to upscale DVD's when hooked up with a HDMI cable. HDMI cables are the best and easiest way to hookup any HDTV. They simply plug in and carry both the audio and video signals. Because a digital signal is either on or off, I believe you don't have to have the most expensive HDMI cables for great results. So I have a HDMI hookup from the set top box to HDMI #1 on the TV and a HDMI hookup from the DVD player to HDMI #2 on the TV. These connections work flawlessly and couldn't be easier to install.This TV looks great right out of the box, the color is the best I've seen, the definition is superb and the sound is excellent for any stand alone system. If you see this set in any store where the picture doesn't seem better than others in this price range, keep in mind that the store can detune the Samsung if they wish to push another brand. Other negative review comments such as buzzing are probably due to improper cable hookups. The issue of watching standard television on a wide screen high definition television is a compromise. The Samsung HP-S4253 handles this compromise better than most as it gives you four options, Standard (faces become a tad stretched), zoom1 ( great picture but cuts off the bottom and top), zoom2 (also good but I prefer zoom1), or 3:4 ( shows the same picture that you are use to in a letterbox - be careful of burn in during the 1st 100 hours). A click of the remote button allows you to cycle though all formats. Believe me you will enjoy watching standard TV on this set as the picture is so much clearer and the color is more natural.My conclusion is that this is a great set at an outstanding price and you can't go wrong with it. My only minor complaint is that I am back to having to use three remotes to take advantage of all the options I now have. Normally I just use the set top box remote for most of my viewing.", "Date": "November 22, 2006"}, {"Title": "The wait is over!!", "Author": "Gizmo Guru", "ReviewID": "R1IH9MYFS14KFK", "Overall": "5.0", "Content": "I bought the Sam's Club Version (S4233) Manufactured August 2006, same as this TV in every way Except mine has a cool looking stand. The legs \"swing and lock\" into place in the Sam's version. I didnt like the dome shape stand on the retail version (S4253).Anyway, let's get down to the performance. I install Plasmas all the time. I install the Mitsubishi Diamond, and Medallion series plasmas (1080P), I have also installed the High end JVC 1080P LCD's too. And all kinds of in between brands. After coming home and looking at my $200 sear's APEX CRT tv, I thought it was time to take the plunge into HDTV. EXCEPT I am not going to pay $5000+ for a TV. Not even $4000. SO I started the tedious process of looking for a HDTV.If you are reading this then you are probably on the hunt for an HDTV. Let me tell you right up front, you have probably seen the best Plasma TV locally (or at a friends) already and no amount of homework, forum trolling is going to make the decision easier.  If you buy a Plasma made in 2006, they are all virtually equal in comparison. I am talking of major brand names, not generic off-name brands like visio, Ilo, etc etc.I cannot tell a difference between this Tv and the $5750 50\" Mitsubishi Plasma I just installed last week. Here is an important note: It all comes down to signal quality. Get yourself a good Updated cable set top box with HDMI out. Now get yourself the OPPO DVD player (here at Amazon of course) and you have yourself an HDTV experience waiting for you!!The price is 25% less than what I paid now at Amazon, so add it to your cart. DO not let the price make you think there is something wrong with this TV Just because it doesnt cost $2000-$5000. There is a real price war going on, and Samsung is going to come out on top.This TV has all the hookups you need: 2HDMI, 3Component, plenty plenty. The Tv makes no buzzing sound. It has no hangups at all. The DNIE feature is cool, it makes the image even better. And now a word about standard definition: I kept hearing about standard def tv not looking good on some HDTV's. This one is amazing on SDTV!! The kids were amzed at Spongebob, and my wife loves to watch her Lifetime channel in SD now. I wish I could have saved the money, but thats how it goes. Any TV you buy is going to drop in price Very SOON after you plug it in, so go ahead and get over it now.ESPN in High definition is awesome!!! Oh by the way, get a decent Over the air antenna and you will be surprised at the amount of free tv stations that are passing right over your house!!!I would buy this TV again in a heartbeat.", "Date": "October 20, 2006"}, {"Title": "Great TV for the price", "Author": "Kyle Kubas", "ReviewID": "R3IRYX81Z7WJ7Y", "Overall": "5.0", "Content": "I bought this tv 2 weeks ago and I dont regret it. There are plenty of jacks for anybody who has a lot of components to plug into their tvs. Picture is georgeous. I am using my xbox360 on it i am blown away every time i turn it on. As mentioned in previous reviews this and every other plasma tv is prone to \"burn in.\" Turn the contrast down on the tv for the first 100-200 hours of use to help prevent it and dont leave static images on the screen for more than 2 hours. Use the built in screen burn protection features as they get rid of every burn in issue i have had with the tv so far. I recommend this tv to anyone looking into HDTV as this is my second HDTV. Never going to back to standard tv.", "Date": "September 26, 2006"}, {"Title": "Great TV-Great Price-Great Picture", "Author": "P. Brogno \"PB\"", "ReviewID": "R2BNZNDB4JED1K", "Overall": "5.0", "Content": "I purchased this TV on black friday from BestBuy. I was originally planning on purchasing the Panasonic 42 inch plasma( I have many Panasonic products and they have all been incredible, TV's, DVD player, receivers, etc)However after waiting in line from 4am I was one of the many unlucky people that couldn't get one.I starting talking to the manager and he said that this BestBuy only is selling the Samsung 42 today only for $1,199. Originally $1700+This TV is replacing the 26in HD Samsung tube TV in my living room. I have brought home at 5 tv's previous to this one before my wife said that picture looks good.1-Winbook LCD- Junk2-HP LCD-Junk3-Syntax or something- waste of time4-Polaroid-Stick with making cameras5- Samsung DLP- Pixels galore with standard cable.So finally I set this up, tune in HD and it looks great!!  Now the true test. I changed the station to a regular cable channel in standard definition and it looked good. I got the stamp of approval finally.Sorry for the long details, but it took a long time to finally get a new tv for the living room.  Here are some additional comments:-I was told and also read that for the first month or two watch the plasma in either movie mode or standard-NEVER Dynamic mode. Reason why you are training the tv with bright colors off the bat, you should work it in slowly. Standard is nicer than movie mode in my opinion.HD broadcast looks great- Don't worry about burn it(dont go crazy) Samsung as a built in pixel mover that adjust the pixels every 2 minutes. This is seamless to the person watching. Also they have some built in tools that in the case that you do get \"image retention\" you can run these utilities and they can correct them.SD broadcast is nice- much better than some tv's I have seen. I recommend being at least 7 feet away from this tv for optimal quality. Honestly, even from 2 feet I didnt see an pixelation.Gaming- There is a game mode that you can turn on for the input you use for games. They look great regardless of the input.DVD- Awesome through component inputs and S video.Audio- You can customize these setting. If you turn on the special sound T-something, it echos sometimes. I have adjusted mine and it is perfect. I have a home theater in the basement so I only use the tv speakers for this Samsung.Overall- The design is beautiful, it's a technical piece of furniture. The tv is about 90 pounds so it is heavier than some LCDs. If you are looking for a Plasma TV in the $1200-$1700, this is the best overall bet.", "Date": "December 8, 2006"}, {"Title": "Samsung HP-S4253 is a Winner! Breathtaking HD Picture Quality!", "Author": "I. Jacobs", "ReviewID": "R1BMXOH6ED8HR1", "Overall": "5.0", "Content": "When I ordered this Samsung HDTV, I had no idea what to expect simply because I had never seen a true HD picture. Boy was I blown away when I turned on the Yankee game and saw the pores on the players' faces and each blade of grass. The set is beautiful and the inputs are numerous. I don't know why Cnet and Consumer Reports didn't like this set very much but I am here to tell you that this set is amazing! The only thing is: Be careful with burn-in. Don't watch it a lot with black bars on the left and right. If you get this plasma, make sure you have HD programming because it is as good as any HD picture out there!", "Date": "September 19, 2006"}, {"Title": "Terrible customer service and the set buzzes", "Author": "pettybogie", "ReviewID": "R3IGL8L5YWOHYJ", "Overall": "2.0", "Content": "After a lot of research I bought the Samsung S4253, It has a great picture but I have had a buzzing problem with the set since the day I installed it. This is a very common problem (see  [...] This is a very loud buzz that can be heard anywhere in a room, even when you turn the volume of your receiver up. After waiting almost a month for a repair, a Samsung repairman came over and said that the set needed to be replaced. He also indicated that Samsung knew that there was a buzzing problem with plasmas (including the 50 inch) made during a specific period at the Mexico plant (and I was the third replacement that he had recommended). He indicated that Samsung would contact me about the replacement set and that it should take a couple of weeks.After a week of waiting for a call, I called Samsung today and the rep said that they had no record of any replacement set being authorized. Apparently in their computer, my case said \"resolved\" and that the tech had determined the error was with the cable box which he had adjusted. After voicing my extreme displeasure with this response he said he would contact the tech and get back to me. He called back after about 15 minutes and said that I was correct, the tech had confirmed that my set needed to be replaced, BUT the tech had not filed his Service Action Work order (SAW). Samsung could thus not replace the set until the SAW was filed with them, and they could not control when the tech did this. Once the SAW was sent in, I should expect a replacement in around 10 days. I explained that I had waited almost a month for a service visit (too long for me to return the set to the store, which has a two week replacement policy), and had already waited one week for Samsung to get back to me. Now they were saying that I still had to wait for the SAW to be filed (which could take any length of time) and also faced an additional 10 day wait beyond this.I then asked to speak to a supervisor and discovered that things were much worse than I had feared. I was put onto Erin. She recited Samsung policy as follows:- After the SAW is filed the Regional Service Manager makes a decision about whether to replace the set or not. This takes 7 to 10 days. She had no real response to the question of how they could over-rule a tech that THEY had sent out. So I still don't actually know for sure that the set will be replaced.- If they agree to replace the set (which I had assumed they had, given the tech's assurance), it takes up to 5 days for them to contact the customer to confirm replacement.- It then takes 10-15 days to receive a replacement set.I mentioned that given that they now knew that the tech had advised that a replacement should happen, she as a supervisor should short circuit the process and set in motion the replacement delivery. No such luck - she had a script and was not going to deviate. The Regional Service Manager would make the call, end of story.So the bottom line, avoid this set until you are sure that the buzzing problem has been sorted out.", "Date": "October 31, 2006"}, {"Title": "Great TV!", "Author": "GDBean123RTP", "ReviewID": "R1HQSTTHCBCFYY", "Overall": "5.0", "Content": "VERY HAPPY. Arrived ahead of schedule. Easy to setup and great onscreen guide. Great picture and $600 less than what Best Buy advertised the same TV for May '06. Also got free shipping and you save on tax. This is the least expensive place to buy this TV, trust me I really shopped around.", "Date": "June 28, 2006"}, {"Title": "Excellent Buy", "Author": "Paul Martinka", "ReviewID": "R3MQ1KZYKZN645", "Overall": "5.0", "Content": "I don't think you can get a better 40-42in flat panel television for the price range of the samsung.  I spent about 3 months researching and comparing plasmas and lcd tv's before I bought this one.  I had decided on buying a Lcd a couple of weeks ago.  My friend when out and bought a sony bravia 40in lcd 2 days before I was going to buy the same television.  I am really gald I didn't.  His STD picture off of Direct TV is terrible.  According to Sony that is as good as it will get until all of Direct TV is completly HD, and who knows how long that will be.  Then I started researching all over again, going to best buy and watching all of the tvs, sharp, sony, lg, panasonic, and samsung, with HD channels with out HD.  I could not tell any difference between the samsung, panasionic, and lg televisions in HD.  The sony was 2nd and the sharp 3rd.  The plasmas were much better in STD.  So at that point I focused on just the plasmas.  The blacks are much better, the picture is sharper, and the fast actions programing is much, much better with a plasma.  To make a long story short I chose the samsung because of price ($800) less than a pioneer.  Burn in protection that the panasionic doesn't have, and just a better look of the TV case compared to the LG.  And the samsung has PIP.  Since I had the TV for the past week I can not complain about the picutre, it is totally fantastic on HD, and very good on the STD chanels.  The sound is better than average for 2 speekers.  the easy of use is also great.  My father who is an electronic moron could set this up and use the tv.  The tuners also bring in channels over antenna that I never new were avaible.  The antenna HD chanells are excellent, the STD channels are so, so.  Stick to cable or satellite for STD channels.  My only dislike it the PIP is not actaully PIP.  It is more like a dual monitior.  You have to have to different sources connected for the PIP to work.  And then they both cannot be coaxel.  So the PIP is knid of a joke.  But if you want a 42in plasma for a heck of a good price with a awesome picture, that is simple to use, pick the samsung you will not be disappointed.  By the way I don't know what all the fuss is about the buzzing my doesn't buzz.", "Date": "November 29, 2006"}, {"Title": "Great TV - Terrible Delivery from Electronics Expo", "Author": "J. Barr", "ReviewID": "R1SSGYY28PE7O8", "Overall": "5.0", "Content": "I ordered this TV from Electronics Expo, while I got a good price, the whole process was an absolute nightmare. TV is great, looks amazing, but I think everyone here has a right to know about the terrible service offered by Electronics Expo. Read on for my whole tragic order process.They took my order, took my money from my checking account, and then one day later I received an email saying that my order had been cancelled. I called them up and some guy told me that they did not have anymore of these TVs left and they over estimated the amount they had in stock (??????????). So I requested my money back and he said they could not refund me and I would simply have to wait around until they get more TVs in!! (which was another \"couple of weeks\") Total nightmare!! I wanted to just go buy this TV somewhere else but they forced me to buy through them despite the fact that they DID not have any of the requested item in stock!!!!Customer service was rude and inconsistent in all of their responses! I called back later that day and asked for a manager and got on the phone with a surprisingly nice woman. She told me that they actually had 6 TVs left in stock and that one of them was mine and would be shipped out. So the person I talked to before had just cancelled my order in error for whatever reason. I got another email saying my order wasn't cancelled. Then I got ANOTHER email saying my order was cancelled AGAIN (from the same idiot I am guessing). I called back and they said that email was for someone else and not meant for me (????). So then my order shipped out three days later (I only know because I called them) via some 3rd party shipping company. No tracking number, no insurance, nothing. Just the rep at EE said, yes it shipped. Guess what happened?The next day I wake up to a phone call at 8am and its some guy saying he wants to deliver my TV this afternoon at 5-6pm, I say great! I sit around my house until 9pm and receive no phone call, no email, nothing. Guy shows up at 9:45, no apology, nothing said. Fine, whatever, just give me my TV. Turns out, its some older guy and his poor PREGNANT wife. U serious? This company sends out one guy and a pregnant woman to deliver a 1500 dollar, 100+ Lbs plasma TV???? I couldnt stand by and watch her try to carry it up the stairs so I just did her job for her. What kind of shipping company would do this????? I get upstairs and then the delivery guy just wants me to sign so he can leave. Uh...no, we are going to set up the TV and turn it on to well, you know, make sure it actually WORKS ok. He says \"I don't know how to..\"  WHAT?? Ok, whatever, I will just do it. \"No you cannot, company policy\". PFFT I dont care, I paid over a thousand dollars for this thing. Im unpacking it. So I UNPACK, SET UP, AND TURN ON. Something that the delivery company SHOULD have done.End result, TV worked fine. Its a great TV for the price but DO NOT order if it is being sold through Electronics Expo, they are the worst online sellers I have ever come across.", "Date": "April 4, 2007"}, {"Title": "Great Value - Awesome Quality", "Author": "R. Gibbs", "ReviewID": "R1Z6W25DCMNJGF", "Overall": "5.0", "Content": "I looked at all the available Plasma and LCD screens in this size range and the Samsung 42\" plasma was the absolute best choice. I also looked at retail stores and they were all at least $500 more expensive that Amazon's prices, for the exact same plasma!!Some people say that LCD is better than plasma etc etc, but for this size I think the samsung plasma is superior to the current LCD technology. So I figured that by the time they make LCD better (and cheaper) I might be ready for a new screen, but until then I'm very happy with this one!And it looks so cool mounted on the wall!!!!", "Date": "November 9, 2006"}, {"Title": "Outstanding!", "Author": "RMS \"RMS\"", "ReviewID": "RYYEGH69VSEG3", "Overall": "5.0", "Content": "By far, the best electronic purchase I made this year.  I am thrilled with the Samsung.  After months of research, mostly due to display technology, I went with this manufacturer.  As for the comparison to HDTV delivered from tube sets', there is no challenge.  Often, when I what's new become the norm, I flip between the analog and digital HD version of the same broadcasted event, say a nature program.  The difference is outstanding.  If I had only one CON, it would be this: \"This, as with all plasma TVs, runs hot\".  That is, where a normal tube set, up to about 37\" operates using roughly 120-watts of electricity, this set consumes hefty 320-watts of power.  This result produces an exponential increase in the amount of heat emitted from these sets.  That is, about three-times more than what comes from a CRT(TUBE)TV set.  The slight cost increase for electricity is a small price to pay for unparalleled clarity and definition.  Another way of looking at it is that a plasma set can serve double-duty.  No more cold winter nights!  Lastly, don't waste your money on expensive HDMI cables.  Having the cable TV technician on-site, I tried both the HDMI and component forms of hook-up.  Component was the clear winner.  According to the \"cable guy\" 85% of all HD TVs he installs, produces the same results I found.  Save the HDMI connections (two of them on this set) for the new Sony PS3 or XBOX 360.", "Date": "November 6, 2006"}, {"Title": "Beautiful TV...", "Author": "C. J. B. Smith", "ReviewID": "R3LW94DP0VX6PV", "Overall": "5.0", "Content": "Being a canny Scotsman, I researched the subject of flat screen TV's to death before parting with my hard earned cash. I didn't make a mistake - this TV is a beauty. I've not suffered from any of the glitches that other reviewers have experienced. Top tip - if you like me you don't have HD TV set up - buy a good quality HDMI cable and link it to your DVD player - the picture quality is simply breathtaking.", "Date": "September 25, 2006"}, {"Title": "One Sweet Plasma", "Author": "Couch Potato", "ReviewID": "R3S4KS89YAI5XH", "Overall": "5.0", "Content": "This TV in one word is awesome!  To truely appreciate it though I would recommend getting a high definition receiver from dish network or one of the others.  The detail of the high definition programs is unbelievable. I may never go outside again!", "Date": "August 26, 2006"}, {"Title": "Yet another glowing review of this great TV!", "Author": "Colin Cushing", "ReviewID": "R2XQSNE1HO6YRQ", "Overall": "5.0", "Content": "I bought this TV last spring and wanted to wait a few months before reviewing. My review after a week would have been 5/5 and today it would be 6/5 if I could give it that. I did a lot of research and comparing with other sets and confidently chose this Samsung. I'm convinced I made the right decision.Delivery: I was not home when the TV was delivered but regardless, setup was very easy. The set came assembled on the stand in the box, so it was just a matter of opening the box and lifting it into place. You might be able to move it into place on your own but it would be risky and I wouldn't recommend it. With 2 people it was no problem.Picture: I am still amazed by the picture quality and continue to annoy my wife whenever I see an especially nice image (\"Look at how great this looks!!\"  \"Yes dear I know, you've shown me 1,000 great images. It's very nice. I get it.\"). HD channels, especially Discovery and ESPN, border on ridiculous they look so good. Non-HD channels don't look fantastic but that's not the TV's fault.Sound: Very good for a TV. If I have the TV volume up and the volume on my speakers up I get an echo effect so I use speakers-only while my wife prefers TV-only. The echo effect is likely due to something I've done wrong in setup but I haven't really investigated thoroughly since I'm OK with only using one or the other (TV or speakers). I haven't experienced any of the hissing noises that other reviewers mention.Size: for an average TV room, I would not recommend getting a TV any larger than 42\". It is obviously quite noticeable but doesn't take over the room or look ridiculous. Any bigger would start to look imposing and silly, in my opinionAesthetics: probably more of a personal preference issue than any other aspect, but I think the color (all black) and the overall shape and lines combine for a very sleek looking unit that would look great in any room.Price: I thought it was a decent deal when I bought it for $1,999 (April 2006). I see now that the price has dropped considerably which makes buying this TV a no-brainer. I will definitely be buying another one when we get a bigger place and have the room for it.Do I need to recap? Great TV!", "Date": "January 16, 2007"}, {"Title": "Excellent TV for the price", "Author": "peter campanella \"jack\"", "ReviewID": "RB2RYM9LZ0VW1", "Overall": "5.0", "Content": "After 9 months of research I found that the Samsung HP-S 4253 plasma out-performs all other plasma televisions on the market other than your hi-end televisions such as JVC and Bang and Olufsen.  I believe this is the best plasma on the market for the price.  The reviews are true about the sound, from this plasma it is not the best, but that is what makes this TV affordable.  One of the reasons why the Panasonic is more expensive is basically the sound system.  The Hi-definition is absolutely unbelievably lifelike.  Be sure to purchase an HDMI DVD/VCR player for the full effect of Hi-def on DVD's.  Though I have found that if something was not filmed in Hi-Def, it exhibits a large amount of contrast, which I cannot find how to reduce. (like Seinfeld dvd's.)I found that the inputs on the Samsung are enough for me.  Even though I would have liked the sd card slot offered on the Panasonic, it is not the reason why you would buy a television.  After finally seeing the Panasonic, Samsung and Pioneer next to each other at Circuit city, it is more than obvious that this Samsung has the greatest amounts of color and brightness.  I do wish there was a DVI port but its easy enough to buy an adapter for your computer.  It does come with a VGA port, which I guess is good enough.The one thing I found to be a bit disappointing is the fact that you cannot use the picture in picture function with other TV channels (broadcasts) if you are using HDMI or component cables.  PIP ONLY seems to work between watching HDMI and Component.  It does not work between Component and Component (meaning 2 sports games at once).  Kind-of a minus for me, can't watch the Yankees and the Giants at one time!!! BUT if you have your cable hooked up via coaxle you can achieve \"broadcast\" PIP, but there goes your Hi-Def.  (by the way the Panasonic does not come with PIP).I believe the design is exceptional, the glossy black border is new to this 5th generation and it really compliments my living room. The design is very modern compared to most other flat screen TV's.  I also had a horizontal space limitation which completely cancelled out the Panasonic and the Phillips. Be sure NOT to purchase the Samsung HP-S4252, the \"2\" is last years model, easy to tell the border is not glossy. I still do not understand why Samsung did not incorporate a swivel in the stand.  The new LCD TV's that came out at the same time and have a swivel. Very odd???Packaging, is very compact, and very easy to carry and take out of the box.  It is Samsungs, \"lift-up\" design.  I got the TV for $1,700 at PC Richards, I did not like Amazon's policy of once it is received that is it you cannot return it...... I wanted to see the TV and make sure there were no imperfections, they also plugged it in and tested it out for me.  Remember PC Richards is not a corporation, they HAGGLE.  Best Buy and Circuit city will not budge with prices.  I also purchased the 5 year warranty, which I highly recommend.Overall I have found so far that the Samsung is an excellent television, it gives off a lot of heat, typical with all plasmas, but other than that I have not had much of any disappointments in my viewing experiences.  This television was well worth the money and I would recommend this to anyone in the market looking for a flat screen television!!!", "Date": "September 25, 2006"}, {"Title": "Great Plasma which has exceeded expectations", "Author": "Jeffrey A. Sindewald \"Bears fan\"", "ReviewID": "R30GARE9TTVY8S", "Overall": "5.0", "Content": "In November 2006 I purchased the Samsung HP-S4253 Plasma TV from Amazon and what a great purchase it has been. I decided to wait a couple of months to write a review. I didn't want to give a out of the box initial reaction and wanted to get some time under with the television before sharing my thoughts.  Here they are:PICTURE QUALITYThe picture quality on this television is outstanding.  We receive television signal through Cable TV.  I have a HD cable box with both Component Video and HDMI.  Both hook ups look great really.  HDMI is how we have the Samsung hooked up now and don't see a reason to change.  The colors are very bright and vibrant.  I would say that before we bought the TV off of Amazon.com, I was at Circuit City several times looking at the Samsung and judging picture quality.  The HP-S4253 picture in Circuit City was good enough to buy the TV but in reality is fantastic when you get it in your home.  Standard Def TV channels through our cable box is fine. I have read other reviews which questioned the quality of the picture on standard def channels and I disagree.GAMINGFor a short period of time, we had a XBOX 360 hooked up to the HP-S4253 and the picture was spectacular.  Its a better picture than our 50\" Samsung DLP we have the XBOX 360 hooked up to.DVDWe have a 480P DVD player hooked up via component video cables. Picture is very good.  Once again vibrant bright colors make movie watching a joy.SHIPPING FROM AMAZONThis was an area that exceeded my expectations.  I have to admit I was a little nervous shipping this TV from their warehouse.  I had never shipped a TV before.  Usually, I have picked my TV's up at a local store and brought them home myself.  Well shipping a plasma TV via over the road truck service is no big deal.  Amazon customer service was extremely helpful and Eagle trucking customer service was great as well.  Drivers unpacked the Plasma and put the box in the garage.  I would recommend asking the drivers to wait while you hook up your cable box, dish or gaming device to make sure the TV is working properly and didn't suffer any damage during transit.Buy one you won't regret it.", "Date": "January 31, 2007"}, {"Title": "Samsung HP-S4253 42\" Plasma", "Author": "Peter A. Modrich \"pm\"", "ReviewID": "R24K7QB3URN6T0", "Overall": "5.0", "Content": "I purchased this model from Amazon in September 2006. After two months the picture began to stutter and eventually freeze after the set was on for over two hours. Turning the set off momentarily would correct the problem. A Samsung tech came and replaced the motherboard inside the set. In January the picture stutter and freeze began again and the Samsung tech returned and replaced the motherboard again. Its March 2007 and the problem has begun again. On June 30th the Samsung tech returned because of picture and sound freeze. He installed another new motherboard and told me to let him know if I had any other problems. Before he could load his tool box into his van the picture started to freeze again. I called him back, he scratched his head and said \"That isn't right\". He suggested the problem might be the comcast box except the same problem occurs while watching a DVD. He grudgingly admitted the set might be defective. I doubt I can get a refund but I am going to ask Samsung to send out another set. Stay tuned. The tech's only solution is to replace one defective component with another defective motherboard. When it works properly I've enjoyed this TV, but I would not buy another Samsung TV.", "Date": "October 2, 2006"}, {"Title": "Samsung HP-S4253", "Author": "K. Jowers", "ReviewID": "RMXG9KR2WLDDM", "Overall": "5.0", "Content": "I've had my new Samsung Plasma TV for about a month.  Very nice picture, easy to set up, and looks great in our family room.  I was a little hesitant because I've never ordered anything this big (or expensive) online, but I have had no troubles at all.  TV was delivered quickly and I purchased it for a great price through Amazon.  I would recommend both the TV and the ordering process to any who are interested.", "Date": "August 31, 2006"}, {"Title": "Better than the S4095 1080p LCD", "Author": "James Lin", "ReviewID": "RXPUJJOML8P3Y", "Overall": "5.0", "Content": "I've had this TV for about 5 months now and I've been very happy with it.Back in June 2006, I purchased the Samsung S4095D (1080p LCD) and I had to return it after a month.  The backlight was splotchy and the black levels were really disappointing.  The overall image quality just wasn't very good for a $3000 (at the time) TV.A few months later, I bought the S4253.  At first, I was wary about the relatively low 1024x768 (rectangular pixels!) resolution.  After using it for a week though, I realized that from about 6 feet away, I couldn't tell that the S4253 has a lower resolution.  However, I could definitely see the better contrast ratio and no weird backlight issues.I've been watching upscaled DVDs and playing Wii on it for the past couple of months, and everything looks great.  If you have a Wii, definitely get a set of component cables.  The difference is night and day.The PC input works great too, but you have to uncheck \"Hide modes that this monitor cannot display\" in the monitor properties tab under Display Properties.  This will let you select 1366x768 resolution, which is a proper 16:9 resolution that matches best with this TV.  If you use 1024x768, the image will be stretched.Pros:- Excellent image quality and contrast ratio with no backlight bleeding or  splotching.- Good sounding speakers (much better than the tinny S4095 speakers)- Lots of inputs in the back and side.  See my photo in the photo gallery above.  I have hooked up a PS2 (component), Oppo 970HD, HTPC, and a Wii (component).- No issues with burn in even after long gaming/TV sessions.- Excellent viewing angles.- Cheaper than LCD TVs.Cons:- Slight green tint.  I think this can be fixed with some color settings tweaks and maybe some tweaks in the hidden service menu, but I haven't really tried.  It's really not very noticeable.- Slight buzzing noise from the back.  I don't notice it unless I mute the TV and listen for it.- Heavier than an LCD TV.Notice that I didn't list the 1024x768 resolution as a con.  A TV that is about 40\" or 42\" doesn't really need 1080p.  I've seen both and the better image quality of the plasma really outshines the higher resolution of the LCD.", "Date": "February 4, 2007"}, {"Title": "Gorgeous looking Plasma/Worthless customer service", "Author": "JCB \"jcbscb\"", "ReviewID": "R2QUZUITV3OLGO", "Overall": "1.0", "Content": "I have had this Plasma for a month now and love the picture. The connections are plentiful and the set itself is nice looking as well. Guess what though I am one of the lucky ones who has a BUZZER. I know you all wish you had one too. Well if you do have a BUZZER then I am sorry. Samsung's customer service is worthless they are deplorable. This plasma would get 5 stars even with the loud BUZZING sound if Samsung's customer service would be helpful to their customers. As of right now I am suppose to get a replacement from Samsung, but no one their will tell me when. I wont get into the whole story, but bottom line their are many BUZZING 4253 and 5053 Samsung plasmas out there and no one at Samsung will admit to it, nor will they help you in a timely manner!!! Stay clear from this plasma and look else where!", "Date": "November 8, 2006"}, {"Title": "great value", "Author": "Aurea jewels \"jewel fool\"", "ReviewID": "R1UVX3L435MOX7", "Overall": "4.0", "Content": "After much searching and reviewing I decided to purchase the Samsung HP-S4253. It had all of the requirements I was looking for, great price and great picture quality. Very easy to set up and delivered in record time. I had a small problem with the TV recognizing the HDMI input from my cable box but that was the cable company's fault. Samsung sent a service person out right away and they were able to get around this flaw so that I could take advantage of the superior quality picture from the HDMI. I highly recommend this TV and Samsung.", "Date": "August 7, 2006"}, {"Title": "Company Complaint - LOVE the product!  Please read.", "Author": "Chris Nelson", "ReviewID": "R2TGF1ZBVC1MCE", "Overall": "1.0", "Content": "I love this TV!  I own two 50\", and one 42\"...I was trying to order another 42\".  What I absolutely HATE is this company.  Amazon claims there's a glitch in their system which won't allow me to leave feedback for this company, so this is my only means of doing so.  Here's the story:First, understand that my wife and I have been Amazon customers for over 2 years.After 15 days of waiting, 9 phone calls to LCDMART, and 3 phone calls to Amazon, I finally cancelled the order for my plasma screen through Amazon.The SAME day I cancelled the order, I FINALLY received a call from LCDMART and the representative told me that I'd receive my TV within 3 business days, and that he was emailing me a tracking number.  He claimed that Amazon takes 10 business days to submit orders to his company...from experience, I find that very hard to believe.  I waited until the following day, and not having received my tracking number, I called yet again, and was told by John at LCDMART that he was emailing me a tracking number immediately.  I did not receive it, so I called YET AGAIN, and was told that I would not receive a tracking number until the following day.  I asked \"How can I receive the TV by tomorrow if you don't have a tracking number today?\"  I then asked when I would receive the TV.  I was told, \"I don't know.\"I asked to cancel my order, and the representative for LCDMART said, \"No.  I can't cancel your order.\"  I repeat, he said, \"NO!\"After a few choice words, and my persistent demand that my order be cancelled, he put me on hold, then told me my order was cancelled.This company is doing Amazon a great disservice, and is damaging its reputation.  LCDMART did not return a single phone message, or email inquiry.I'm sure LCDMART will find some reason to make me look like an unreasonable customer, but read the reviews...I'm not the first to experience this, and this \"feedback bug\" appears to have been in effect since 5/2007, so NO feedback, negative or positive, has been submitted to this company since then.Buy the product, you'll be happy.  Just don't use LCDMART.", "Date": "August 29, 2007"}, {"Title": "Im very sad!!!!!", "Author": "Frache", "ReviewID": "R2NDR25UIIF8RG", "Overall": "1.0", "Content": "The TV was great for the first 8 month, until in the past 2 weeks a lots of blues dots star in the top of my screen, I dont think that you pay for a HD TV with 42 \" and be happy with that kind of fails. I was reading a lot of review in the web and this is an error from the manufacture. but the coustumer service is very poor, I dont know if I will buy another.", "Date": "August 24, 2007"}, {"Title": "Well Done Samsung", "Author": "J. Hepler", "ReviewID": "R3DZUCQTE7BBIU", "Overall": "5.0", "Content": "The HD picture quality is top notch. The majority of the HD content that I view is from the local over-the-air broadcasts. For my extended service I use DirecTV. This is where I was surprised on how well it delivers the picture. I have a Samsung 50\" DLP also, and while HD content looks great on it, regular programming displays rather poorly. I have noticed this to some degree comparing other DLP, Plasma, LCD sets, but Samsung really delivers a clean image with the HP-S4253 that is ignorant of the signal.The sound quality is fine for a set in this price range. The virtual surround stuff does a good job at tricking your ears, but there is no replacement for an actual home theater system if you are looking to really experience your programming.The functional features are solid, but nothing that really is not on similar models from other vendors. The external appearance of the set is very nice, but I care more about the part that you look at 99% of the time, rather than impressing any one who may stop by. The remote is fine, but Samsung does not put \"back\" button on their remotes. Most folks use a universal of some sort anyhow.Eagle shipping did their job. They called ahead, arrived on time and placed the television on the stand for me.Here are a few miscellaneous notes that may be helpful:Burn-in is less of a problem with modern plasma sets, but should still be taken seriously. It is noted in the product guide, as are the simple instructions to avoid it. In short, don't leave a program on with a dark fixed image for more than a few hours at a time during the sets first few weeks of use. That includes, of course, the  vertical or horizontal bars that may appear when the programs aspect ratio is not the same as the unit. For example, I made sure to toggle the zoom every 30 minutes or so during the first few DVD movies I watched that had horizontal bars.If you are near a major city (within 25 miles) pick up an antenna and check out all of the HD programming that is out there now. Not only is it FREE (minus the antenna cost), it is a noticeably better image than the HD content you pay for on cable or satellite. The local towers send out an uncompressed image and typically use as much as 30Mb, while our beloved cable and satellite providers must compress a multiple HD channels into as little as 5Mb. The HD content on paid providers still look very good though, so don't let this deter you from subscribing to those if you are interested in some the channels they offer.Enjoy your new TV.", "Date": "April 11, 2007"}, {"Title": "Great screen for the price", "Author": "O-Dawg", "ReviewID": "RST4VIV9M1RJY", "Overall": "5.0", "Content": "Like everyone else, I shopped around for months looking at all the brands and types of TVs that are out there.  I finally landed on the S4253.  There simply is not another HDTV this size with this picture quality for this price.  Look all you want, you will return here empty handed.  Sure there are some LCDs out there that are razor sharp, but they are around 3x the price.  I'm not really willing to go that far. Every single other plasma (and LCD) in this price range looked terrible compared to the Samsung.  It even looks good while its off, the glossy piano black finish is great.This is the first device that I actually used the various settings on, they do work.  Movie, standard, dynamic.  The different settings of zoom, so you can eliminate the letterboxing that some shows have.  (also getting rid of pesky advertisements some channels run at the bottom of the screen) Nice blue LED around the power button and it makes a little Tivo'ish sound when you turn it on & off.  It even has a simulated surround effect it creates with its two speakers.  It works.  It made me check my surround receiver a couple times to make sure it was not on.  You can clearly hear things behind you.  Its a pretty neat trick.Anyway, in closing, great set.  The only problem I can think of is that it doesn't have a DVI input on it, only SVGA.  Which isn't really a problem, I was just sort of hoping for one.  Plenty of other inputs.  Composite, S, HDMI.  It even has connections on the side so you can hook things up temporarily without having to get behind it.I can't leave without mentioning Amazon.  They were $500.00 less than my local brick and mortar.  Great shipping with Eagle too.  I called the company once I saw it was in my city and asked if I could come pick it up several days early.  They agreed with no hassle.  Great purchase and great overall experience.", "Date": "March 30, 2007"}, {"Title": "First time HDTV", "Author": "M. Paul \"MP\"", "ReviewID": "R35ZPTISNRGNPV", "Overall": "5.0", "Content": "After considering several discriminating factors (size, price, user reviews and etc), I was tied between Panasonic and Samsung 42\" Plasma screens. I compared Samsung HP-S4253 and Panasonic TH-42PX60U at the local CircuitCity and BestBuy stores several times. You could not go wrong with either brand.Comparison at the stores:TVs and sound systems are things that you have to go see/hear yourselves before buying. Every body has their personal preferences. Picture quality was the most important factor for my wife and I. Personally, Panasonic had better whites (HD - Discovery channel) compared to Samsung. Other than that, overall color and picture quality (HD movies) looked better on Samsung. My wife could not really tell the difference between the two anyway, except she found the Samsung cabinet more aesthetically pleasing. Based on the specs, Samsung has better features than Panasonic. We decided to order the Samsung from Amazon for ~ $1250 (savings of about $350 with the free wall-mount rebate).At home experience:We got the TV on 12/12/06, about 12 days after ordering. The EGL delivery driver helped me to carry the TV upstairs and unpack. Unfortunately, I didn't have a cable connection upstairs, so I connected an internal antenna and a DVD player with component video output to the TV. The setup was quite intuitive enough. I was lucky enough to get a couple of HD channels over the air (WOSU-HD and ABC). The reception was quite impressive even with a couple of old rabbit ears, something I bought a couple of years ago for $20. I was very pleased with the HD picture quality: good resolution, color, and clarity. Ordinary DVD movies looked good too. I expect the picture quality to improve when I get an upconverting DVD player and Dishnetwork with HD channels. Just don't have the money for it now. I don't hear any buzzing noise as some folks commented. I wish plasmas had individual color settings (Red, Blue, and Green) like the CRT's and DLPs, but the movies are good enough with Dynamic color setting. This is definitely a great TV overall.", "Date": "December 19, 2006"}, {"Title": "Great TV, price independent", "Author": "JcR", "ReviewID": "R24GAL6LE8VMFF", "Overall": "5.0", "Content": "I researched TV's for a few weeks before purchasing this one.  I read the pros and cons of plasma vs lcd, and reviews of individual models.Initially, I was concerned about plasmas and elevation.  I read that the higher the elevation, the more work the TV has to work to make the picture, often causing a buzz noise.  Most TV's are rated to 6500 ft, and since I'm at 4500 ft, I thought it would be all right.  There is a slight buzz that can be heard if you stick your head behind the set, but can't be heard otherwise.Picture quality is impressive in HD, as expected.  What wasn't expected was the very good picture quality for SD channels as well.  I have a large rear projection Hitachi HD set as well, and the picture quality of non HD channels is almost embarrassing, especially compared to this Samsung plasma.Shipping through Amazon was very fast and Eagle was great to deal with.  I love buying through Amazon due to free shipping and no sales tax.I recommend this set to anyone interested!", "Date": "December 10, 2006"}, {"Title": "Great TV with minor issues", "Author": "John F.", "ReviewID": "RWFTEDNX0B3MV", "Overall": "5.0", "Content": "All in all this is a great TV and for the money I think it is one of the best things going.PROS:Picture: This TV has an excellent picture.  When I upgraded my cable to HD cable I noticed an even better picture.  I sit about 12 feet from the TV and, even when I'm watching a non-HD signal, any pixelization that you get goes unnoticed. So way to go on the picture, Samsung.Inputs:  A ton of inputs.  Two HDMI, PC input, coax, etc.  I use Comcast and both cable boxes that I have from them only have a DVI output, so you need to get a DVI-HDMI cable to view HD signals.CONS:Sound:  The sound is sub-par.  I guess it's safe to assume that anyone in the market for a higher-end TV is going to also have a home theater receiver for sound.  In my case, I don't like to mess with my home theatre receiver for watching \"regular\" TV (the news, etc) so I use the TV's built-in speakers.  When watching something deep bass tones (i.e., music, explosions, or someone with a deep voice) the speakers make a muffled \"farting\" noise as if they are blown.  (sorry, can't think of a better way to describe it).A firmware bug?:  There seems to be a bug with the firmware of the TV that when you switch sources, say, from TV to HDMI to watch a DVD the video will switch but the audio will not.  Most of the time you will loose sound all together, but on more than one occasion I have switched to the HDMI source and I see the movie but still hear what I was watching on TV.  Cycling through the source selection a second time will fix it.Again, all-in-all this is a great TV and would definately recommend it.", "Date": "November 3, 2006"}, {"Title": "Beware of the Buzz", "Author": "Alan \"Chicago, IL\"", "ReviewID": "R16UOPFGWBZR9Y", "Overall": "3.0", "Content": "When my TV arrived, I had the delivery guy wait while I plugged it in.  When I did so, I was able to hear an audible buzzing coming from the unit, which is not normal according to all the electronics message boards that I did my research on.  I then refused delivery and shipped it back to Amazon and will try ordering again, but did not want to take a chance with Amazon's strict policy about not exchanging TVs over 27 inches. It looked great for the few minutes it was at my place and I think it will be a great TV if I am able to get one that does not buzz.", "Date": "September 27, 2006"}, {"Title": "It Burns", "Author": "Ben Sumner", "ReviewID": "R2ZJDXWU1Q4PXX", "Overall": "2.0", "Content": "I'll skip all the good details about this TV - others can cover that. Here's what I found. I'm told by experts it's a good TV, assuming you don't watch something on 4:3 ratio for more than 2 hours at a time. The screen burns lines along the side, showing up when you watch something in wide screen. And get this... it's not covered by the warranty! While Samsung says there are things you can do to help 'fix' this, the fact that this happens should be unacceptable for any consumer. The vast majority of TV programming is still in 4:3 ratio and it's not ideal to stretch everything out just for the sake of the TV's health. I also don't care that this is covered in the manual, common knowledge among TV geeks, or that this isn't specific to Samsung TVs (it may even be common for most plasmas and LCDs). To protect the consumer, there should be an on-screen warning or something far more obvious than text in the manual.So be warned if you intend to purchase this, or any other wide-screen TV for that matter. Don't watch anything in 4:3 ratio.", "Date": "September 24, 2006"}, {"Title": "Buy this plasma and you won't regret it!", "Author": "T. Schwinn \"Shwnster\"", "ReviewID": "REGAOMRYBMAS1", "Overall": "5.0", "Content": "After a year and a half of price watching and comparison, I purchased this plasma from Amazon for $1149.  What a deal.  Eagle shipped and set up in my house within 7 days of completing the order.  I use satellite for my HDTV and recently purchased a UHF amplified antenna for local channels.  I was shocked at the quality of the over the air broadcast.  It is actually equal to the satellite.  The picture is flawless and i don't get any buzzing that some of the other reviewers complained about.  This is the best TV I have ever seen!  Even the channels that don't broadcast in HD look great!  I tried cable HD but canceled and went with satellite when I saw the difference at a friends house.  No comparison.  I recommend setting all of the video to 50.  The vivid setting is just not realistic.  You can move the brightness and contrast up to 60 in a darker room.  Any higher and you do get some pixelation in some darker scenes.  I run my video through the 2 HDMI connections and my audio through my surround sound receiver.  I tried the internal speakers just to get an idea of the quality of sound and it was fine.  Can't really compare to a good 7.1 system though.  The plasmas in the big department stores don't do these screens justice.  With an up converting  1080i DVD player that I also purchased through Amazon, I am totally satisfied.  They say these plasmas will last far longer that the old tube tv's.  I hope so.  The only thing I would change about this Plasma is the gloss black frame.  It looks great until you turn on a light or get sun in the background.  If it was matte finish there wouldn't be any glare at all from the side of the picture but in a dark room that wouldn't matter anyway.  I really can't say enough about this plasma.  Best purchase I ever made.", "Date": "April 24, 2007"}, {"Title": "Samsung HP-S4253 42\" Plasma HDTV", "Author": "C. Raney", "ReviewID": "R1NS3CXYYBQBAJ", "Overall": "5.0", "Content": "We are very happy with our new TV.  The picture quality is great and was very easy to set up and use.  This was by far the most TV for the money, you won't be disappointed.", "Date": "April 14, 2007"}, {"Title": "Excellent TV", "Author": "Daniel E. Brown \"Dan\"", "ReviewID": "R2R9RC7GBFOQ22", "Overall": "5.0", "Content": "I purchased this TV about amonth ago and so far its been fantastic.  Great picture, nice set of controls, plenty of inputs, and incredible hi-def movies.", "Date": "March 8, 2007"}, {"Title": "Love this TV!", "Author": "Robert P.", "ReviewID": "R3CZLC31NK0S3L", "Overall": "5.0", "Content": "The price was right but I was concerned about other reviews which warned of a 'buzzing' sound. I have been using the TV for over one month now and have never heard buzzing. Great sound and picture and sleek styling. Very happy I bought it. Unit sold through Vanns without any problems. Shipped by Yellow, upon arrival there was a large oily stain on the outside of the box which fortunately did not penetrate through to the inside. TV protected by multiple layers of polywrap and placed inside a sturdy Styrofoam cocoon. Unit was undamaged. The delivery person went above and beyond in helping to transport unit inside, when delivery only specified curbside. Saved a lot of money. Overall, a good transaction.", "Date": "February 19, 2007"}, {"Title": "Worked fine for six months then buzzing sound!", "Author": "Beau Gray", "ReviewID": "R488G6MNO83", "Overall": "1.0", "Content": "Samsung is dropping off a replacement tomorrow 2/18/2006 after service tech said the panel was defective - after 6 good months a buzzing sound could be heard even over nominal audio levels and I have a surround system. Customer service while worked to resolve the issue wouldn't have gotten to this point if I didn't call every week for an update and repeat the story over and over again after sitting on hold for 10-20 minutes.On top of that the 1 year warranty doesn't \"reset\" with the replacement TV so if this one starts buzzing in 6 months I'm screwed. That's the moment when the service tech pulled out a brochure on  Samsung's extended warranty program - what kind of BS is that?I purchased in July of 2006 was very happy with HD image, not too good with standard digital cable though- My 36\" flat tube looks a lot better with standard cable.  Let's hope the replacement keeps quite. Good luck!Bottom line quality is number one in my book so I can only give it 1 stars and that's only because it had a good picture on HD programming", "Date": "February 19, 2007"}, {"Title": "Flippin sweet", "Author": "Chad S. Haupricht \"TV lover\"", "ReviewID": "R30UOR2ARUX0G4", "Overall": "5.0", "Content": "This tv is awesome. I have yet to upgrade to high def surround sound, but to be honest I truly don't care! This was the first thing I installed in my new house. Yes there is a little bit of glare at certain times during the day, but its not to the point where the picture is distorted or made to look bad. It has great sound for having only tv speakers. The brilliant colors in the picture bring out so many highs and lows that I can't bring myself to watch tv in anyother room in the house. My DVD's look great, especially explosions. Band of Brothers made me feel like I was part of the action.I highly highly highly recommend this tv for those of you who want to make the jump to HD. It comes with a big stand for sitting on an entertainment center. I chose to mount it on my wall with a tilting wall mount. Mounting this tv to the wall couldn't be any easier. These places charging a few hundred dollars are a rip off. I had it mounted and hung in less than an hour. Its under 80 lbs. so you will need help setting it in the mount, but other than that it is ready to fire up right out of the box.I want another one.....", "Date": "February 19, 2007"}, {"Title": "Great plasma TV", "Author": "A. Louise", "ReviewID": "R3TPIWN9LACP1X", "Overall": "5.0", "Content": "I purchased this TV for my wife and myself back in April. I recently purchased one for my son for his birthday. Obviously, I am very happy with it. The TV has great High Def images. My son periodically calls me to thank me for it. He and his wife love it. He is also a video game fan and says that his XBOX 360 games look great on it.It's a terrific TV and the price is right. We bought both of the TV's from Amazon - free shipping, no taxes...it's a can't miss deal!", "Date": "February 14, 2007"}, {"Title": "best value around.", "Author": "D. Porter", "ReviewID": "R1RMI4Y7KSVO67", "Overall": "5.0", "Content": "I would first like to address the buzzing that everyone seems to complain about.  Standing less than two feet from the tv with the sound turned completely off, yes, I can hear a little buzz.  This is a 42\" tv.  The recommended viewing distance is AT LEAST ten feet, not two.  Plus, if you are going to spend this much money on a tv, you are a fool if you don't buy a sweet surround system to go with it.  In this case, you will never hear buzzing.  After much investigation, the buzzing in plasmas is normal, especially at higher altitudes, but it is not significant enough to bother me.Overall, I am very satisfied with the purchase.  If you want the absolute highest resolution in the world, buy an LCD, but you should be prepared to pay twice as much for it.  For me, that was not nearly worth the extra money, and the plasma offers the truest colors.  Comparing the colors to LCD side by side in the store, there was no comparison.  In the color vs. resolution battle, color won.This tv was a great purchase so far (I've had it for a month).  It is not by any means perfect, but for the $1300 I paid for it, I would not dare complain.  If you want perfect, pay the ten grand it's going to cost you.  If you want a great tv at a great price, buy the samsung.", "Date": "January 30, 2007"}, {"Title": "great tv", "Author": "Timothy A. Sides", "ReviewID": "R2WUA5YVTJG0OW", "Overall": "5.0", "Content": "first let me say.....nnnoooooo  hissssssss...i have had it for about 1 mo. now. this is a great tv. the picture is great. it lookes good with reg. tv too. i had it hooked up to reg. tv before i got the HD. it had a great picture then. i looked at alot of tv's, but got this one on the reviews i had read. it is a great tv for 1250.00 i paid to the door. i hope you can tell i love this tv. thank you  ( timbo )", "Date": "January 9, 2007"}, {"Title": "Great TV, Great Price", "Author": "Thomas H. Pickard \"Tom's Music Fun\"", "ReviewID": "R9MBTPL0PVQKY", "Overall": "4.0", "Content": "I have had this set for around 2 months and it is a winner.  I gave 4 stars only because I can't give anything 5. Sound is fine if you don't put in tru-surround.  Plenty of volume as well.  I also have a Sharp Aquas LCD 32\" in my play room and it has better sound but the picture can't compare with the Samsung.  I shopped on line and saw the set at BB and CC and talked to salesman about plasma to LCD and generally was referred to plasma for best picture quality and now that I own one I must say that I would save the money you would have to spend for a large non-plasma.  It does have a ghost on the screen when scenes change and it goes to black but I guess that is the nature of plasma.  They have included features to help if the screen burns in that I haven't had to use yet.  Was told by several reliable people that burn is is not as big a problem with the newer sets.  The first thing you read in the literature is they are not responsible for burn in but I think they are being careful and it is no a big issue anymore.  Amazon had the best price which at the time was $1259.00  I see they raised the price over the holiday. It was $1799.00 at BB over the holidays so without state tax and free shipping it is worth the wait.  It is too big to fit in your car. If you want great tv for a great price this is one that does it all.", "Date": "December 28, 2006"}, {"Title": "Fantastic TV, both in picture quality and price", "Author": "eddie", "ReviewID": "R2MONZWQ4KNENV", "Overall": "5.0", "Content": "This TV has awesome picture quality, very sharp, and you can't beat the price. Personally, I also like the aesthetics of the glossy black bezel as compared to some competitors (e.g. Panasonic). No buzzing noises either, which I was a bit concerned about after reading some reviews. But even if there were buzzing noises, Eagle Freight USA (Amazon's delivery company for large products) will help you set up the TV and give you a chance to test it out to make sure there are no problems. If there are, you can just refuse delivery. Bottom line is, awesome TV with beautiful picture and you don't face any risks.", "Date": "December 8, 2006"}, {"Title": "Nice Plasma", "Author": "Bruce Freeman", "ReviewID": "R1BRPCR3P2YZ58", "Overall": "5.0", "Content": "I just received my new HP-S4253 and I am running an HD DVR from my cable company via one of the HDMI inputs.  The HD picture is really sharp and clear and the SD picture is pretty clear and it does a good job with skin color looking natural.  Items that are black are really black and have good detail from my viewing position(about 7 feet back and about 2 feet off center). One of the concerns I had when researching plasmas was the low price for the Samsung.  I'm a believer that you get what you pay for and I'm sure there are 42\" plasmas that are far superior however for the price ( just over $1200) I think you would be really hard pressed to find a better TV.  One thing I do recommend is having a surge protector/line conditioner to clean up the power which helps with the picture.  I have read several reviews here on Amazon that said their TV had a \"buzzing noise\".  I have not experienced that as of yet and I hope to be able to report so after a while.  I still have my 7 year old DVD player which I have connected via the s-video input and the picture is very respectable but I hope to be upgrading that shortly to an upconvert DVD with an HDMI output.  Any way that is my input on this TV and I hope it is useful to those of you on a budget like myself.", "Date": "December 6, 2006"}, {"Title": "Fantastic Product  - UH OH Not so fast!!!!!", "Author": "K. Anderson \"Picky Consumer\"", "ReviewID": "R24J7BYTPR31JV", "Overall": "5.0", "Content": "I really don't know how a flat screen tv or any tv for that matter could show a better picture.  I am elated with my purchase..the look of the set as well as the picture is superb.  I did a LOT of research before I decided on the Samsung, and needless to say I will be purchasing another one!This model rocks!!!!Well needless to say I spoke to soon.  After only 4 months the darn thing went out on me.  First it started flashing rainbow colors then after a day or two NO picture at all.  I've already been w/o my tv for a week now the service people are telling me that the part is on back order and it will be another two weeks at best before it's in.SO, I have to go approx. 3 weeks w/o a tv and Samsung is essentially saying - sorry, tough luck!!Needles to say I'm PISSED!", "Date": "December 1, 2006"}, {"Title": "Be careful of dead pixels", "Author": "Shu Pei \"Jingren\"", "ReviewID": "R1NHO2TFU0YAUR", "Overall": "3.0", "Content": "Our HP-S4253 was bought last Thanksgiving. It was a great plasma TV at the beginning, marvelous HD resolution, vivid color and many useful jacks on the back.However, recently a bright red dot appeared in the center of the screen. This dot is most eye-catching when the background is dark.I called the service center of Samsung and was told that only one dead pixel was not a service issue. Their policy was a seven-dots rule. If you have fewer than seven bright, sometimes flashing red dots on your plasma screen, sorry, that's your own problem.Later I found that every TV manufacturer has its own \"pixel policy\" to deal with complaints about such dots.Customers at a store can open the box and check the TV on spot. But if you buy a LCD or plasma TV online like I did, you are taking a chance.", "Date": "March 8, 2007"}, {"Title": "Caution above 5500ft", "Author": "Jerome F. Tozzi", "ReviewID": "R1ACN0Z756VUE9", "Overall": "2.0", "Content": "Both seller (Tiger Direct) and Amazon fail to disclose in the tech summary that these Plasma's have major issue's at altitudes above 5500 feet! Final tally after returning the item:Shipping to me, $171.50Shipping back to Tiger Direct, $251.94Plus I purchased a Samsung 1000watt home theater system that worked for twenty five minutes before it quit, so back in the box for another shipping charge of $21.86. LOL $400.00 and change for nothing! If you read this do yourself a favor and buy locally! It's nice to save a few bucks when it all goes good! But be prepared to loose big if the items are defective! At least locally you can return it with no out of pocket expence.Also Amazon has a sweet rep of being the hardest company to contact via voice, making things even more complicated.. I'll just chalk it up to lessons well learned, and hope I save a few of you the experiance..", "Date": "March 1, 2007"}, {"Title": "Disappointing Support", "Author": "Will", "ReviewID": "R3M8ULT5X6N1IE", "Overall": "1.0", "Content": "I got this TV after reading the positive reviews here, and at first I was pretty happy with it. It looked nice whether on or off. However, it developped a super bright blinking red pixel in the center of the screen after about 3 weeks of use, which is impossible to ignore and has completely ruined my TV watching experience.I've tried reaching Samsung support but they always seem to be experiencing \"very high call volumes\". I was finally able to get through, but they refused to do anything about it until at least 10 pixels are dead, \"like the warranty says\". Sure, it says so, but what would an aribtrary number like that mean in terms of user experience? I would rather throw the TV away than having to endure another blinking red pixel. What this says is that Samsung doesn't care about its customers.", "Date": "January 9, 2007"}, {"Title": "tromeo1", "Author": "Romeo J. Tcheutchua \"Jules R.\"", "ReviewID": "R3748RX07XA2ZS", "Overall": "5.0", "Content": "I'm usually very passive about writing reviews but I couldn't hold back on this one... I bought this Samsung HP-S4253 HDTV at [...] Dec 12 and received it a week later. I have been searching for the right for an HDTV for months and spent a lot of time on the internet and in stores comparing different TV Makes and plasma vs LCD. I bought one Sambre 42\" from a military exchange, great price, but I wasn't very satisfy with it, I returned it and continue with the search until I found this Samsung HDTV.  In short, this is the most satistfied item I ever bought! I loved it right from the moment i took it out of the box, it looks very appealing. the image quality is just one word - amazing!!! I connected it to a Samsung DVD recording with an HDMI cable and and played on 8020i mode, there's just no better image quality you could have gotten else where. it's basically like viewing real life through the mirrow... even with new the 8020p mode, the normal eye will not really notice any big difference in quality. It has a good sound quality too, the remote controle has everything you'll espect from a beyond-average, user's guid tells you everything you need to know in simple terms. the color desplay is very pure, the black depth is so great that when I compared it with my small LCD monitor TV, I just don't want to look at LCD again. besides, there's nothing you're missing out with LCD on this plasma, it's got a 60,000 hrs life spand and a burn in control technology. with the satisfaction from this tv quality, I wouldn't mind if I had to pay a couple hundred dollars more for it. Have already made up my mind to stick with Samsung for electronics.", "Date": "December 26, 2006"}, {"Title": "Love this Plasma!!", "Author": "Douglas P. Cooper \"Dcooper\"", "ReviewID": "R3S7KFB6VW2BQ8", "Overall": "5.0", "Content": "I too compared the panasonic and over many weeks made the decision to go with this samsung; I have to say its great!! forget all the mombo Jombo stuff people talk about, like pixation and saturation points.  Basically the picture is so sharp and so clear and so real with colors; its just the best! Buying it through amazon was a pleasure.  If you buy a plasma at the wonderful walmart (sarcasm) they give you curbside delivery; meaning they will drop it at the curb or in a garage and goodbye.  Amazon had it brought into my home; set it up on the stand and took all the boxes and garbage away!! very pleased with amazon and this recent purchase! good job!", "Date": "December 10, 2006"}, {"Title": "Simply Stunning", "Author": "Mr. Anthony M. Miller", "ReviewID": "R35X9A8OQTERME", "Overall": "5.0", "Content": "I don't think you can get a better Plasma  panel television for the price of the Samsung. I spent about a month researching and comparing plasmas at local stores and reading reviews before I settled on the #4253 Samsung. All I can say is WOW! The look and feel of this product is right up there with the Pioneer Elite with it piano black finish. I hung my plasma on the wall, so I had to remove one of the most beautiful TV base supports that I have ever laid eyes on. I have not even hooked up a HD feed yet, but the SD channels are clear and crisp. I do not claim to be a videophile, but I do know what looks good and for the amount of money that I spent on this TV I am elated. Once again Amazon.com rules and will always be the first place I shop.", "Date": "December 3, 2006"}, {"Title": "Fair Warning", "Author": "Mark Wilshire", "ReviewID": "R176H925H03SCZ", "Overall": "2.0", "Content": "I purchased this Samsung on November 11th after doing extensive research and reading all of the reviews.  The set arrived in great condition two hours before the UM vs. Ohio State game (great timing).  The picture is amazing and I was completely satisfied until the set started \"buzzing\" about 6 hours after I turned it on.I called Samsung to complain and they quickly sent out a technician.  After changing the power supply, which didn't help at all, the technician called Samsung who explained that Plasmas inherently \"buzz\" and I should sit further away from the tv.  Psh, are you serious?  I spend $1400 on supposedly one of the \"best\" plasma manufacturers around and this is the customer service I get?  I'd expect this from a Wal-Mart plasma, but not a Samsung.Bottom Line:  Clearly, Samsung makes a great tv, as you can tell from the many wonderful reviews on this site.  I'm just warning that this \"buzzing\" glitch is not cleared up yet and you too may fall victim.  Its not like I'm trying to score a new tv here.  Mine is only 4 days old, and as much as I enjoy leaving the office to wait for the technician between the hours of 1 and 3, I'd much rather have a tv that performs as plasmas should.Best Bet:  Buy the 42 inch Panasonic plasma for the same price - less the \"buzzing\"", "Date": "November 22, 2006"}, {"Title": "Big headache, buy another HDTV.", "Author": "Scott Cohen", "ReviewID": "ROQ2VM5UPIWG9", "Overall": "1.0", "Content": "My family has been considering an HDTV for nearly two years now, and the prices for them have gone down considerably. We felt that it was the right time to jump in and buy one. I did research online and compared a lot of DLPs, LCDs and plasmas sets. We decided against the DLP because of it's size and picture quality at certain angles.We decided to go with plasma and picked up this Samsung set. We got a great price on it and we were really excited about it. We finally get the set home, take it out of the box, set it up, and... nothing. Nothing happens. We plug it in, set up our HD set top box and the TV has no picture! We tried to troubleshoot it but nothing happened. We thought the TV broke en route to our home.We called Samsung's technical support, and they had someone come out to fix it a week later. The repairman came and replaced some part in the TV. Wow, the TV looked great! I watched a concert in HD and watched a football game in HD. Then, the set broke down, 3 hours after being repaired! There were artifacts all over the screen, and the colors became washed out and green. At first, I thought there was an issue with the HD feed. We changed the channels but oddly enough the TV was displaying everything wrong. We called Samsung again and they came back out to repair it. An hour after they left, the same problem came back, but now, a string of pixels in the middle showed as green and red. The TV died again. The repairman came back three times in one day to \"fix\" it but nothing. We contacted the store where we purchased it and they refunded us and we chose a Panasonic 42\" plasma. It arrived today, and it worked out of the box, like it should.Samsung is a reputable brand but I would have second thoughts before buying another Samsung television. We may have just gotten a lemon, but after four repairs, it was unacceptable. I would buy another set. We had a heavy paperweight sitting in our living room for a month and Samsung refused to replace the entire set. Thankfully the store empathized with us and let us get a new TV. This TV was a big headache... buy something else!", "Date": "November 17, 2006"}, {"Title": "Excellent plus MP3 and JPG", "Author": "John Becker \"JBB\"", "ReviewID": "R32PJF01HS9VGD", "Overall": "5.0", "Content": "The TV was delivered, un-boxed and checked out by the delivery person.Works great and as I bonus, I found it is great for watching digital pictures from the USB port and listening to music from a USB memory stick.JohnColorado", "Date": "November 14, 2008"}, {"Title": "Graet TV for the price!...Do Not Hesitate to Buy", "Author": "S. Fallon", "ReviewID": "RDAQ3SDLCDCOR", "Overall": "4.0", "Content": "I bought this TV on 10/31/2006. It's been one year. I have had absolutely no problems whatsoever. I've noticed a few people's comments about a blue pixel showing up on the screen..I have not had this problem.I did have my screen professionally wall-mounted.But, I don't think the professional installation has had anything to do with long-term quality.I originally paid $1599.00 for this TV from a big-box store. I can't believe the price is around $950-$999. There may be newer versions with supposedly better features, BUT, for the price, this TV is great! The reason I bought this TV was that 2 guys who worked in the store personally owned this unit. I figured they must know what they are doing.Some have commented about the buzzing noise when the volume is turned up--I keep the volume on zero and feed it through a stereo system so I have never had the humming/buzzing problem people are talking about. However, I have turned off my stereo and used the volume built into the TV and did notice a humming sound.If you are considering buying this TV but do not plan to hook it up to a home stereo of some sort..you might want to reconsider buying this unit. But, if you plan to use your stereo volume---then no problem. I guess the humming could be considered a drawback.  One interesting anecdote about this unit. It will definately induce envy from your friends and family.One of the selling points of this TV,to me, was it's piano-black-finish edges. This gives it the look of the expensive Pioneer Elite TVs. I don't personally like flat screen TVs with the greyish borders--they tend to look plastic and cheap. This TV looks expensive! It's a show-stopper if you wall mount it like I have, very clean and neat looking.  Overall I want to state that I have no specific allegiance to Samsung. I am not a Samsung employee. I do not own Samsung stock. I used to think of Samsung as a low to mid quality Korean electronics maker.If you had told me 5 years ago I would be paying $1599.00 for ANYTHING Samsung..I would have told you, you were crazy! Overall, I have been very satisfied. I would not hesitate to recommend this TV, especially for the price as it stands today.", "Date": "November 9, 2007"}, {"Title": "Good picture, fair sound !  Horrible customer service!!!!", "Author": "M. Perret", "ReviewID": "R342S9540F5MZT", "Overall": "2.0", "Content": "If you want a product that comes with the service you expect do not buy Samsung! the customer service is horrible.", "Date": "August 1, 2007"}, {"Title": "Great TV", "Author": "Christopher Bergeron", "ReviewID": "R1ZV1TW8MXX576", "Overall": "4.0", "Content": "A great set.  Good sold picture, the sound is nothing to write home about but certainly more than enough for most TV.  Hard core movie buffs will want to pick up a surround sound anyway.The \"Buzz\" that you will read about in the other posts.  It is there.  I also use mine as a PC monitor and when there isn't any volume I do here it.  It is very low and I didn't even notice it until I read about it here.I think I'm going to keep this one for a VERY long time.", "Date": "April 24, 2007"}, {"Title": "Awesome Picture!", "Author": "Willy M \"krayzie\"", "ReviewID": "R1OMNS58GY9OTM", "Overall": "5.0", "Content": "Just bought this TV and received it within a week, Eagle was good with shipping, and they set up the TV to test it before they left...As for the TV, beautiful picture. Connected it to my PS3 via HDMI and blueray movies look amazing! Also, I connected an old bunny-ear antenna to it and it picks up local HD channels easily as well as regular SD.The glossy cabinet is very eye-catching and have been getting compliments since the first day it arrived. Also, it brought a soft cloth to keep it clean and avoid scratches (Works GREAT to clean the PS3's glossy finish as well).I definitely reccomend this TV, great picture for the price!!", "Date": "April 5, 2007"}, {"Title": "Samsung HP-S4253 42\" Plasma HDTV", "Author": "S. Givens", "ReviewID": "R1HCVUZC8G8SX0", "Overall": "5.0", "Content": "Absolutely love my new Samsung TV.  Beautiful picture and great features.No burn in or ghosting as of yet - I have turned the contract down to 60% for the first 200 hours as some websites have recommended.Highly recommend this TV for anyone considering a new flat panel purchase, and I am one tough critic!  If there were any negatives, I would divulge!", "Date": "March 8, 2007"}, {"Title": "Great Plasma HDTV", "Author": "Fred J. Scharmann \"fjs3\"", "ReviewID": "R3TITBUJVFIRH8", "Overall": "5.0", "Content": "No problems with this set at all.  It offered all the connections I wanted and the picture is fantasic.  All my friends that have a plasma tv have commented that this set is as good or better than the ones they have.", "Date": "February 19, 2007"}, {"Title": "Great price, great picture, great sound.", "Author": "K. Anthony", "ReviewID": "R22LKYXPL9OOGA", "Overall": "5.0", "Content": "I decided on this the Samsung plasma after a month of research and paid $1369 (no shipping/no tax) on Amazon.  The TV arrived 1 week early and I am 100% satisfied so far.  I was a little concerned about the buzzing noise before buying, but I DO NOT hear this buzzing noise people keep talking about.  It sounds fine, but I do plan to hook up surround sound to enhance the experience.Overall, this TV looks sleek, picture is outstanding, sound is fine, and price is just right.  GREAT VALUE and I would buy it again.", "Date": "February 17, 2007"}, {"Title": "Excellent TV", "Author": "Anthony Paik", "ReviewID": "R37TTN2NOZZ4ZW", "Overall": "5.0", "Content": "Good picture quality & decent built-in audio.  I hooked it up to my regular analog cable as I watch more DVD.  And I am satisfy with the resolution I get from $19 cable TV.  And of course the quality of movie I see.Amazon delivery took about 1.5 week and it was free.", "Date": "February 12, 2007"}, {"Title": "Well satisified", "Author": "Jarold D. Smith", "ReviewID": "R1VJTNUYHPXWAW", "Overall": "5.0", "Content": "After much research found this to be the best buy for the price. Fast delivery and was set up by delivery personel in a matter of minutes. The picture is suburb and we are enjoying the playoff games. Would highly recommend the T V and Amanzon.Jarold", "Date": "January 19, 2007"}, {"Title": "Samsung HP S4253 42 Plasma HDTV", "Author": "Dolly", "ReviewID": "R1HGJRGFZQMDX0", "Overall": "4.0", "Content": "The only complaint I have is that you have to raise and lower the volume with the remote by pushing the button for each increment vrs just holding the button.", "Date": "January 12, 2007"}, {"Title": "Awesome TV, Excellent deal, Painless delivery", "Author": "B. K. Lamb", "ReviewID": "R2KMH2E6IHXFA2", "Overall": "5.0", "Content": "Ordered the TV, was contacted by the shipping company, they were here when they said, unpacked and even set the TV on the cabinet (important for me as I'm in a wheelchair), even cleaned up the packaging materials when they left. The TV performance is great, with \"regular\" cable the picture is good but not great, I hooked up an external HD antenna to get our local HD broadcasts and WOW! What a difference!I do find the pictures settings (it has several modes) to be a little hot.... too much contrast and washes out the darks, but using some of the different settings, a broader tonal range is easy to accomplish. Viewing angle is fantastic, picture is clear and visible anywhere in the room. Sound is a little hard for me to hear the midranges, but I'm old and a little hard of hearing, so I don't know that this is due to the TV or me.All in all, an excellent TV, very nice styling, easy to use menus and controls... highly recommended!", "Date": "January 11, 2007"}, {"Title": "Great picture, great value for the money.", "Author": "Dave Lopez", "ReviewID": "R3NC91KCZFM3FI", "Overall": "4.0", "Content": "Samsung, for the money, probably has the best plasma on the market. Picture is great, television has great sound out of the box. Plenty of inputs and features. Only issue, and this is the same for most lower end plasmas, is a buzzing noise you will notice when you have the sound at low levels. I have mine on a surround, so it not as noticable. This buzz is prominent when the picture is calling for a lot of white or brightness on the screen. Shipper was first rate, not a complaint with delivery or customer service.", "Date": "January 11, 2007"}, {"Title": "Great TV!!!!!!!!!!!!!!!!", "Author": "Tuff Trucks \"Steve\"", "ReviewID": "R2RKD25EF2GAY6", "Overall": "5.0", "Content": "When you read through all the reviews on this and other TV's, you get a feel of what the consensus is out there on this or any other TV -- this one is the Qaeda raw.  For the price, looks, style, quality and available connections, this TV is all that I'd hoped for in my purchase selection.  I'm utterly satisfied with the clarity, inputs/outputs, and its looks -- stunning TV.  I'm very satisfied with my purchase...", "Date": "January 9, 2007"}, {"Title": "Love at first sight", "Author": "Karla A. Velasco \"culichiland\"", "ReviewID": "R273EO61RV5B4", "Overall": "5.0", "Content": "I will admit I was a little apprehensive about whether I was making the right choice when I picked this Samsung but since I've had this wonderful plasma I've been happier with it everyday. It was very easy to set up and looks fantastic. Everyone who has seen it has complimented my choice. The picture is very crisp (I havent hooked up the HD service yet and Im wondering if I really need it). The colors are bright and perfect, all of them except the black. The TV has a bit of a problem when a lot of what you're viewing is dark. Other than that its been great. I've played a few X-box 360 games and Gamecube games on it and the picture couldnt be better. Its a great size too, not too big and definetly not to small. This helps when playing the video games because when you play multiplayer it splits the screen but you still get great resolution and plenty of screen space so you dont strain your eyes. This is a great purchase AND price for anyone looking for quality and name-brand assurance.", "Date": "January 9, 2007"}, {"Title": "Excellent Plasma...NO BUZZZZZZ!!!", "Author": "J. Bagdonas \"sloopjb74\"", "ReviewID": "R17PUH71UZKOK0", "Overall": "5.0", "Content": "Purchased along with the larger HP-S5053 Samsung...had delivery agent \"Eagle Global\" unpack both at time of delivery after showing them the infamous Amazon buzzing reviews...both escaped unscathed...great sets...great pictures...great sound...50' interfaces well with the Panasonic SA-HT740 Home Theater System...42\" easily wall mounted...more than enough inputs and outputs than you'll ever need...simple and easy to use remotes...prices (42\")$1,279 and (50\")$2,069 still $350 to $450 less than the big electronic stores...ordered direct from Amazon...free shipping...very pleased with entire experience!!", "Date": "January 9, 2007"}, {"Title": "Good deal - great picture - remote needs a better design - speakers are mediocre", "Author": "a4andrew", "ReviewID": "ROZWCFIB40AQ0", "Overall": "4.0", "Content": "I've had this TV for over 3 months now.  No question the picture is extra crisp in HD (though I can't really compare it to but a 20+ year old Sony 27\" near flat screen trinitron).  The menu controls are pretty well laid out.  The component plugins in the back and sides were a little difficult to figure out, but trial and error eventually saw me through.  The (universal - nice!) remote is big and the only thing that bothers me so far is that to change the channel, the enter button is 3-4 inches below the number buttons, or you can just wait until 1 or 2 seconds later as it accepts your button presses.  The speakers pretty much tops out at the 50% zone.  If you have a livingroom with 10 people who are talking, your TV will lose out to your guests' volume.  Also on a side note, the lettering on the bezel was scuffed a good bit when I received it, though has nothing to do with performance of the TV.", "Date": "January 3, 2007"}, {"Title": "The Quality of the TV and Amazon are both Out-of-This-World", "Author": "Neal G. Bourda", "ReviewID": "R1PRU1CD226F1H", "Overall": "5.0", "Content": "The TV is flawless in every way.  It is a must buy. Speaking of flawless, Amazon free shipping is simply the best.  I ordered it on Friday, November 24, 2006 (the day after Thanksgiving) and I received it less than one week later on Wednesday, November 29, 2006, in perfect condition.  Amazon sent the plasma via Eagle USA a shipping company that specializes in shipping large frieght. I would most certainly order another plasma from Amazon again. Thanks!", "Date": "December 6, 2006"}, {"Title": "Worth every penny...", "Author": "Jim from Philly", "ReviewID": "R2DVZ44MAWIVWK", "Overall": "5.0", "Content": "I'm a typical guy. I work all day and when I get home I like to watch a little TV. Well, with this Samsung Plasma I find myself watching more than a little TV. I bought this model at Best Buy a few months ago and couldn't be happier with the purchase. I compared the Samsung with other models that they had and quickly came to the conclusion that this was the best in it's price range (or out of it's range, for that matter!). The picture is incredible and it offers plenty of connection options including 2 HDMI inputs, and a composite input on the side of the TV if you need to connect your Video Camera.One important feature if you have kids is Pixel Shift. My son loves to play Video games and this helps prevent any burn-in by subtly shifting the screen every few minutes by a few pixels.HD channels look great as expected and setup was quick and easy. Looking forward to the day when ALL stations wil broadcast in HD.Jim", "Date": "October 29, 2006"}, {"Title": "Burn In", "Author": "GadgetGuy \"B-Ha\"", "ReviewID": "RR4CGTXI164HF", "Overall": "3.0", "Content": "I've had this TV for a little over a week and am disappointed with its performance.  I got it for a good price ($1300 at a retail store), and was really pleased with look of the TV in my room.  The styling is really nice.  It went down hill from there.  I watched my first episode of 24 on the TV and thought the dark scenes looked terrible.  There is way too much noise and a lot of pixelation in dark/shaded scenes.  I owned a Vizio VP42 Plasma that did a much better job at displaying dark scenes.  This wasn't a deal breaker though.  Then I noticed the TV makes a buzzing noise.  Its only something you can hear when the TV is muted, but it is still irritating.  After watching the TV for only a week using toned down settings, I have an image burned into my TV.  I am extremely [...] when it comes to burn in.  I don't play video games on it, I just watch TV.  I keep the brightness and contrast down to protect the screen.  The logo from our local Fox affiliate is permanently burned into the screen after only a week of use.  A week!!  This isn't the only channel I watch....in fact, I only watch this channel about 1/10th of the time.  I tried the image wash thing for several hours, and watched a channel with no static images for several hours and the burned image is still there.  If you get this TV, you better make sure you are extremely careful.", "Date": "February 14, 2007"}, {"Title": "I like it, but wish I would have bought the Panasonic TH42PX600U", "Author": "S. Jensen \"Digital Maven\"", "ReviewID": "R322OIY9HTK8QT", "Overall": "4.0", "Content": "Let me start by saying that I am a first time plasma owner, therefore my perspective has changed over the last 5 months of ownership as I've become more experienced with these TVs.  When I first took it out of the box I would have rated this a 5, but now that I've owned it for a while and compared to other TVs...it gets a 4.  Don't get me wrong...I like it, but there are some things to consider.  As also pointed out on cNet.com, the set does have some noise and artifacts that linger from time to time.  For example, when I'm watching a game and switch to another channel...remnants of the score box will sometimes linger on the screen for about 60 seconds.  It's not the end of the world, but it is something that can take a bit of the luster out of a $1,500 TV purchase.  Also, this is not a 1080i television.  For a few hundred more dollars...you get upgrade to a 1080i and be ready for the real future of HDTV.  What keeps it at a 4 are the following: the HD picture (when not switching channels the picture is awesome and the blacks are very black), the number of video/audio connection alternatives, the PIP feature and the eye pleasing design.  I hope this helps.  Happy shopping!", "Date": "January 16, 2007"}, {"Title": "Great Plasma", "Author": "Jared Lee \"stewies ipod comm\"", "ReviewID": "R2WE5C9VZ8X3HM", "Overall": "5.0", "Content": "I love how this tv looks.  HD channels look absolutely fantastic.  My PS2 games also look amazing.  I can't say enough how great the set looks with it's black finish, illuminating eye, and sleek look.  The internal speakers sound fine but turned them off since it creates an echo effect in conjunction with my external speakers.  2 coaxle inputs for cable & antenna. It has pixel shift, white screen, and sweeping screen to prevent burn in.  haven't had burn in yet so I have to wait and see how effective it is.PIP doesn't allow you to watch 2 tv stations at once.  when i change cable/antenna channels, the audio cuts out for a second shortly after the image appears. I usually plug an audio cable from my computer to play mp3s thru my home theatre system, but it requires that i plug in a video cable in as well or the entire source won't be detected.Overall, fantastic TV and i think i made the right choice after all the research. I'm nit-picky about a few things but still probably better than most out there", "Date": "November 22, 2006"}, {"Title": "1 Year and Still Great Picture!  Plasma Still da Best Quality Color picture ever", "Author": "R. Amrhhein \"Danny T\"", "ReviewID": "R43NK4ZTTEE", "Overall": "5.0", "Content": "Had this TV for a year now.On all the time No Buzzing sounds. All I do is play with my TV settings on regular coxial cable to make it look better than my friends DLP with that HDTV from directv. That feels so good to better and not even to be trying. This thing looks like 1080P on a 720P DVD Player.Only the pioneer plasma matches this badboy.", "Date": "July 12, 2007"}, {"Title": "Burn in", "Author": "PJM 4840 \"PJM4840\"", "ReviewID": "R3CB2L2YQGW4VW", "Overall": "2.0", "Content": "This product was purchased 10 months after comparison shopping and on line reviews. The picture was great until this weekend when I noticed vertical burn in lines whch approximate the boundaries of non-hd broadcasts. Samsung's tecnical department blithely notes such burn in is common and that it is never covered by warranty. The commercial hype by Samsung about their built in system to prevent burn in is just designed to sell the product as the technician admitted it does not really help. Samsung should be honest and let prospective purchasers know the real % of their sets which experience the problem. My friends have Panasonics which have never had the problem even after 3 years usage.", "Date": "April 9, 2007"}, {"Title": "Value Plus!!!", "Author": "Dennis OKeefe \"Tex Upport\"", "ReviewID": "R19PJWOZ2V41S", "Overall": "5.0", "Content": "Great Picture..Great Sound..That's what you expect from an HDTV..This has both", "Date": "March 22, 2007"}, {"Title": "Samsung HP-S4253 42\" Plasma HDTV", "Author": "T. Thompson", "ReviewID": "R25B9L3LASY29H", "Overall": "5.0", "Content": "What can I say? After all the research. Samsung picture quality clearly the best. Love it ... Love it. Buy it you will too. Rich, Modern design complements my home perfectly. Purchasing another Samsung 50\" Plasma for home theater this spring.TT/CHICAGO", "Date": "March 8, 2007"}, {"Title": "Amazing Picture Quality", "Author": "F. Menezes", "ReviewID": "RQCQ4Q85Z1J1N", "Overall": "5.0", "Content": "I've had this set for over a month now. The picture quality is amazing and the Black frame looks great too. I've had no problems with the Sound. It works perfect for me. Amazon Customer service was great too!!", "Date": "November 9, 2006"}, {"Title": "Highly Recommended", "Author": "Victor Pantoja", "ReviewID": "R2TFIW3DZR6QC5", "Overall": "5.0", "Content": "I purchased this TV in March for about $500 less than traditional stores. This TV is amazing but you must invest in high definition in order to truely maximize it's potential. This TV is perfect for high def sports and programs and awesome with an XBOX 360. A word of caution though. Lower your settings to about half way in order to avoid nasty burn in during the first 200 hours of viewing. Other than that this TV is an excellent choice.", "Date": "May 14, 2007"}, {"Title": "Samsung HP-S4253 42\" Plasma HDTV", "Author": "TazzD", "ReviewID": "RCK5DOUU999QJ", "Overall": "5.0", "Content": "Fantastic Picture & Sound.  Great Price.Samsung HP-S4253 42\" Plasma HDTVSamsung HP-S4253 42\" Plasma HDTV", "Date": "April 10, 2007"}, {"Title": "No Hassle Service", "Author": "Stormin Norman", "ReviewID": "R233I2BX6MTAFL", "Overall": "5.0", "Content": "I searched a long time for a great bargain in a 42\" Plasma HDTV and found it through Amazon.  The price was right; the picture and overall quality of the Samsung HP-S4243 42\" Plasma HDTV is excellent; and, the delivery was on time an hassle free.  The delivery person showed up as scheduled and uncrated the unit to ensure there was not physical damage during shipment.", "Date": "March 5, 2007"}, {"Title": "nice product", "Author": "Woo-young Ahn", "ReviewID": "R2P8ZJE855E2TD", "Overall": "5.0", "Content": "it was good so far.no problem at allIt was good for price, too.", "Date": "February 11, 2007"}, {"Title": "Great price for a great tv", "Author": "Lolly Dolly", "ReviewID": "R3H4CSAQC4Q72O", "Overall": "5.0", "Content": "I saw this tv in 2 major stores for about $500 more than i paid on amazon. Not to mention there was no tax and the shipping was free. All the money i  saved made me feel much better about having to spend it on a tv stand, component cables, and hd dvd player.Aside from that, the tv itself is great. The picture is amazing. I have it in a small area but it doesn't seem to be overwhelming large.", "Date": "February 7, 2007"}, {"Title": "Happy Customer", "Author": "kool rider \"tvbuff\"", "ReviewID": "R3SEHGVVYV8AT", "Overall": "5.0", "Content": "This is our first Plasma TV and we love it.  Based on the reviews, we couldn't decide between this one and the Panasonic, we decided to go with Samsung because of it's black piano finish.  It goes well with our furniture and we have no complaints about it's performance so far.I ordered it on the 19th and was delivered on the 23rd, in time for Christmas. The Shippers (Eagle) brought it in, unpacked, connected it and offered to even take away the shipping box. We really liked their service.", "Date": "January 19, 2007"}, {"Title": "Awesome!", "Author": "Linda Lee \"Linda\"", "ReviewID": "RZX2ZPGT1G94I", "Overall": "5.0", "Content": "Awesome says it all!  Great HD picture!  Good sound!  Nice to look at!Linda Boyd", "Date": "January 11, 2007"}, {"Title": "Plasma Samsung HDTV", "Author": "Mary A. Mallon", "ReviewID": "R2JMYD2A1PXWRP", "Overall": "5.0", "Content": "Beautiful.  This is the 42 inch.  I can't say anything bad about it.  Turned it on .. no adjustments needed.  The black frame does get dusty and it shows (unlike the silver frames) .. but the black looks nicer against the wall.  Nice picture and color .. easy to hook up your equipment.  I haven't signed up for the HD Cable and the picture is still very sharp.", "Date": "January 10, 2007"}, {"Title": "First Plasma", "Author": "John R. Naughton", "ReviewID": "R2XQBWHYIWB3DY", "Overall": "4.0", "Content": "Not knowing what to expect, I was pleased with the picture and the sound.  But, this review is more about Amazon than the TV.  The price was very good and the delivery was excellent.  The delivery personnel unpacked the TV, installed it and waited to be sure picture and sound were functioning properly.  They were willing to wait and repack the set if I had chosen to refuse the item.  All went very well and I am pleased with my choice.", "Date": "January 9, 2007"}, {"Title": "Awesome Service", "Author": "R. Raffanti", "ReviewID": "R3NSAQTZJLA33Z", "Overall": "5.0", "Content": "The two 42\" plasmas I purchased were delived ahead of time and without damage.  They are being used in a fitness workout room and will likely remain on for most of the day.  They will be used by office tenants and will be tested with the public.  They have been in service for 30 days without a problem.  We have also added a timer box that will terminate power to the TV so that if it is left on it will power off at 10 p.m. and back on at 5 a.m.  Feedback on the quality has been positive.", "Date": "January 9, 2007"}, {"Title": "Amazing picture, great value", "Author": "C. Nelson \"Plasma Hound\"", "ReviewID": "R6ZKW5L4ASQH2", "Overall": "5.0", "Content": "Like I said, the picture is absolutely stunning. That is, of course when you are watching an HDTV broadcast, or a DVD (especially if you have either an up-convert DVD player, or the real deal HD DVD or Blue Ray). When you are watching a non-HDTV broadcast, the picture is marginally better than a standard non-Plasma. But, hey, let's face it, regular broadcast shows aren't why we buy HDTV ready TVs. The color saturation is one of the best I've seen at any price point from any set, and the contrast is phenomenal. There are very flexible options for color, sound, and burn prevention in the on-screen menu. I should mention that if you are watching a channel in 4:3 format (and there are black bars on the sides of the screen), for any length of time, when you switch to a 16:9 channel, you will see some ghosting. No problem, though. You can get a DVD to run that flashes colors randomly to \"erase\" these lines. There are plenty of inputs for your home theater needs, and the shiny black finish is icing on the cake. This is a terrific deal for a truly beautiful picture.", "Date": "January 4, 2007"}, {"Title": "Excellent product", "Author": "Vincedf", "ReviewID": "RJ4YR8OM3J6Z5", "Overall": "5.0", "Content": "I Bought this hdtv for a little over $1200 and received it in 10 days using the free shipping option. I have found no \"buzzing\" problems using the tv speakers and/or my home theater system. Great picture in hd, and set it up was fairly easy. I also both a set of two hdmi cables for $4.99 each.I highly recommend this product.", "Date": "December 24, 2006"}, {"Title": "I expected better...", "Author": "Emmy B", "ReviewID": "RX6D5B528WTKD", "Overall": "2.0", "Content": "I owned this TV for 2 weeks before I packed it back up and returned it. I did my shopping and Samsung is a respected brand. This TV has some nice features. However I was extremely disappointed with the picture quality on this TV. After the initial \"ooh and ahh\" of watching television in HD wore off, I was left feeling like I'd wasted an awful lot of money. The picture on HD stations is \"pixally\" especially when there is movement in the picture. Football games were the worst. The TV doesn't seem to read the signal fast enough to provide a crisp HD experience. The TV also distorts skin tones. I spent hours upon hours adjusting the color and settings but never found anything that made me feel I'd made a good investment. Pay the extra money and get the Pioneer. I found that the difference between the Samsung and the Pioneer was as big as the difference between non-HD and HD quality. I now use the same signal and same HD box but with the different TV and I get TERRIFIC picture and sound quality.", "Date": "November 14, 2006"}, {"Title": "Appearance is good, but picture can't compare", "Author": "J. Hong \"jesse\"", "ReviewID": "RZFBZ4U144XR7", "Overall": "3.0", "Content": "The new HP-S4253 apears better than last model S4252. The sleek black finish surrounding the display did please me, and would definitely match my black tv stand. When I went to the store, I was amazed by the way Samsung, Toshiba 42HP66, and Panasonic TH-42PX60U present life-like colors. All three popular models render pictures similarly. Toshiba even has the best price.But when I did a side-by-side compare between Samsung and Panasonic, things turned out differently. They both maintain the fidelity very well. But Panasonic's picture is much cleaner whether it's still or transitioning. Samsung on the other hand can't suppress noise (flickering lines & dots) from coming out in the corner or some off-center area. We have done the comparison in four stores, my friend and I both agree. That feels like a film being played too many times starts to get slight wear (of course, not that significant), as opposed to Pana which is virtually noise-free.Although Samsung's finish seems to make the display bigger (not sure it's also scratch-proof), but hey.. you paid for a 42\" tv, why pretend? :P If you are looking for the best quality and picture, go for a Panasonic!", "Date": "July 19, 2006"}, {"Title": "42 inch plasma samsung tv caught on fire", "Author": "Lori C", "ReviewID": "R2ICLU0IGET3EW", "Overall": "1.0", "Content": "We purchased our tv in Dec 2006 for $1699 plus tax.  In July 2012, our 5 1/2 year old tv caught on fire.  When the technician came out to look at it- he told me that they no longer coat the part that caught on fire with plastic for this reason. Samsung apologized for our tv catching on fire and was glad that noone was hurt, but that was the extent of their compensation for our tv catching on fire.  The tv had a 5 year warranty and it was just out of warranty.  I think it is horrific that they knew there was a problem, but did nothing to recall the tvs that were out there.  It is extremely scarey to have your tv catch on fire and I am extremely disappointed in the way they handled it.  We dealt with their ECR, which is the executive customer relations.  We will never buy another samsumg product in our household.", "Date": "July 18, 2012"}, {"Title": "Great until . . .", "Author": "Michael S. Youngs", "ReviewID": "R2CHQ3Z3MIG2XH", "Overall": "1.0", "Content": "the blue \"dots\" appear. I've had this about a year-and-a-half and the entire left side of the screen becomes a blue smimmer of varying translucency after about 1-2 hours of use. This has started to spread to the middle and top of the screen and is ruining the experience of watching anything. Anyone have any advice? Samsung customer service said they never heard of this, but it seems that I'm not the only one with this problem (and no more warranty). YIKES!", "Date": "August 31, 2008"}, {"Title": "Satisfied Customer", "Author": "R. Fleece", "ReviewID": "R3LOML5AEOI6VZ", "Overall": "4.0", "Content": "At the time of purchase 1080I sets are about $1200 cheaper than the new 1080P.  At the time of this review I have had this unit for 1.5 months and have had no problems yet.  This is my first plasma and first digital television.  I am very impressed with the picture.  The color is amazing.  I have noticed some pixilization during live action but for the most part not bad.  I would recommend this set to anyone looking for a plasma set as long as stations are not sending 1080P signals and the price difference is so great to upgrade to a 1080P set.", "Date": "January 11, 2007"}, {"Title": "Best TV for the Price", "Author": "Taylor M. Green", "ReviewID": "R1NLCZHEOWSSNN", "Overall": "5.0", "Content": "Just got this little puppy and let me tell you, the picture is totally outstanding.  And, it's like the tv was built for gaming... I plugged in my XBOX 360 and it was a different experience gaming.Some people are claiming to have problems with the tv's audio, but in this day and age, if you're going ahead and buying a 42\" plasma tv for your home theater, you should also be investing in a great surround sound system.  This will eliminate any question marks on sound (though my tv has not shown any problems with its built in SS).", "Date": "October 25, 2006"}, {"Title": "blue dots???", "Author": "amazon shopper \"don\"", "ReviewID": "R3KBCTA1Q8ZZJZ", "Overall": "3.0", "Content": "I got this tv for christmas and for the first few months I have no complaints. but after a few months I've noticed tiny blue dots in the center of the screen.  Can anybody tell be what this is. It comes and goes and can be very annoying.  Other than that its a decent tv for the price.", "Date": "April 25, 2007"}, {"Title": "Great Plasma and great seller", "Author": "Doron Rice \"dodo arch\"", "ReviewID": "R3G9Z1JHIBA51H", "Overall": "5.0", "Content": "I Love buying from Amazon, they had the best price for this amazing TV and the delivery was much faster then they said. The Plasma TV is amazing, I enjoy every minute of watching it.", "Date": "November 19, 2006"}, {"Title": "The picture was great for awhile. Turned into junk after a few years.", "Author": "Dime the Reviewer", "ReviewID": "R10LD4GUPBH5PB", "Overall": "1.0", "Content": "I bought this TV in 2006. Shortly after I experienced a \"diffusion problem\" aka \"blue sparkles\". I had it serviced under warranty and tech replaced the entire panel. I wish they would have given me a different TV though. This did remedy the first problem.The TV had a great picture. It died in 2010 outside of the extended warranty. It developed these massive pixelated lines across all sources and channels. The lines made the TV unusable.Upon researching the problem, the solution is most likely a panel replacement. I'm unsure if you can even do that now since the TV is so old. When I had the first panel replaced it was $1000 which Samsung paid for (warranty).I gave the TV away for 100 bucks.PROS: TV displays 1080i which is rare for a \"720p\" set. I bought this when 1080p was very new and nothing was using it. We are still unfortunately far away from full use of 1080p (over the air, tv etc). The glossy black border was a nice touch. No swivel stand but this wasn't typical for Plasmas in 2006.CONS: Screen is INCREDIBLY reflective. Light bounces off like a window. I have a new plasma which has a coating that reduces glare. It's night and day to this set.BUZZZZZZZZZZZZZZZZZZZ. The Plasma is VERY loud. You have to turn the volume up significantly to overcome it. My 50 inch is quieter. This must have come with technology advancements. This sucker is heavy and must weigh 100 lbs. My 50 inch plasma is actually lighter.. The TV also gets very hot. Much hotter then my 50 inch.This TV was marred with problems. Google and you will find. Most common now is people find that it shuts off and won't turn back on.I stuck with Samsung for my replacement TV for the living room and bedroom. I hope this was just a one off thing for them and the others will last much longer. I was close to dumping them but Sony burned me harder with product failures so I avoided them.DON'T buy this TV used. It's a ticking timebomb.", "Date": "January 4, 2011"}, {"Title": "SAMSUNG TVS DONT LAST", "Author": "A. Ehrhardt", "ReviewID": "R349TTSLZFWTHY", "Overall": "1.0", "Content": "TV DIDNT LAST 2 YEARS .GREAT PICTURE FOR 23 MONTHS. IT COSTS AS MUCH TO FIX AS IT DOES TO BUY ANOTHER. I WONT BUY ANOTHER SAMSUNG!!!", "Date": "January 4, 2009"}, {"Title": "Awful TV", "Author": "Yosmar Alfonso Pineda \"Maracucho\"", "ReviewID": "R924LQM59UJ1V", "Overall": "2.0", "Content": "For my opinion its a tv with normal capabilitys is just big... when you are playing with gaming console with the HDMI cable it sometimes get blue a few parts of the SCREEN so is annoying for the sight... and ITS NOT 1080P resolution", "Date": "September 13, 2007"}, {"Title": "Almost a great TV", "Author": "R. G. Hedrick \"Randy\"", "ReviewID": "R3SY27GW2VS9OE", "Overall": "2.0", "Content": "Bought this TV and loved it at first. About 3 months after purchase It developed a hum in the audio on the component connections. Called Samsung and they sent someone out who took the TV away and repaired it. Came back and had it now had a hum on the output side (going to the receiver) and 4 months later it also developed a problem with the screen (blue spot on the bottom left hand side). Called Samsung again. They sent out yet another (non Samsung Authorized repair center). They've had the TV now for over 15 days and no update from them. My advice to you is don't count on Samsung repair. They are worthless. Also, it should be known that this TV does not support variable output on the sound so you'll always have to adjust at the receiver (just a note). If the TV worked correctly, I'd probably give it a better review. It is nice, but if you have problems at all, you'll be in trouble. Buyer beware!!! Samsung will not take care of you if you have problems!!!!", "Date": "September 11, 2007"}, {"Title": "Excellent TV", "Author": "amy \"book bug\"", "ReviewID": "ROSPD8KLLZ509", "Overall": "5.0", "Content": "this tv was a great purchase... everything i wanted in my first plasma tv... description was accurate... quality is excellent", "Date": "January 13, 2007"}, {"Title": "Great All Around", "Author": "J. Gordon", "ReviewID": "R40H36X7FCVYC", "Overall": "5.0", "Content": "Great TV, no problems with a buzzing noise like I had read about. Simple to setup and use. Great picture. Order was shipped well before expected date and the Eagle Delivery guy was friendly and helpful. He waited while I set it up to make sure I was happy before I had to sign for anything. Would definitely recommend.", "Date": "January 9, 2007"}, {"Title": "Amazing Value, Amazing Quality", "Author": "M. Salimbene", "ReviewID": "RP1HVJ1IMX53Z", "Overall": "5.0", "Content": "The buying experience (from Amazon) was perfect beginning to end.  The item arrived earlier than expected and the picture is truly amazing, especially on the HD networks.No buzzing or any of the other problems that others have complained about.  Of course the TV makes some noise if you are 3 inches away from it with the TV on mute, but lets be serious, it couldnt possibly interfere with anybodys viewing experience.This was an amazing bargain for $1,279 (free shipping, no tax) and I will likely get one for myself soon.  This item was a gift for my parents.", "Date": "January 3, 2007"}, {"Title": "Fantastic Deal, Great TV", "Author": "Trevor Kight", "ReviewID": "R1K3JSSEVA59B4", "Overall": "5.0", "Content": "This is the best TV available in this price range on the market right now. The picture is deep and incredible, and the glossy black exterior is extremely elegant (giving it a huge leg up on the boring sliver Pan. 60U). Buy this TV, you will not be dissapointed!", "Date": "June 29, 2006"}, {"Title": "clear, bright picture", "Author": "J. Rinzel", "ReviewID": "R68VP5HPITY9J", "Overall": "5.0", "Content": "We love our new TV.  It is great for watching sports.", "Date": "March 9, 2007"}, {"Title": "Okay for the price.", "Author": "Shaun Holdaway \"Blaine the Mono\"", "ReviewID": "R13AANZMFD8DLS", "Overall": "3.0", "Content": "I did a lot of research and I picked this TV for the good value.  I was truely happy with this set for the first few months until the blue dots started showing up.  The random blue dots only show up when I'm stretching a standard definition show and they only show in the top left part of the screen.  It also seems to be related to the audio as I can see the beautiful \"northern lights\" change with the audio.  If you only watch Hi-def then I would still recommend this screen.  If you feel lucky or like a random 'northern lights' experience then I still recommend this screen. :-)", "Date": "May 7, 2007"}, {"Title": "Great TV while it lasted", "Author": "Richard J Pastor \"Flyfisher\"", "ReviewID": "R3P0MXB8DZT275", "Overall": "1.0", "Content": "Beautiful tv for 31 days.  Samsung sets new standards for lousy customer service.  Initially they told me 7-14 days before someone would call to make an appointment to look at it.  It has been 17 days and the phone hasn't rung.  I live in a major metro area.  Dell, Apple and others set high standards and expectations for customer care.  Stay away from Samsung.", "Date": "April 13, 2007"}, {"Title": "Best HDTV for the price !", "Author": "W. Ignacio \"best bang for the buck *always*\"", "ReviewID": "R3QKBIY473YYIF", "Overall": "5.0", "Content": "Great price, unbelievable picture quality and has a lot of inputs.", "Date": "January 16, 2007"}, {"Title": "Audio glitch part 2?", "Author": "Marc214 \"Marc214\"", "ReviewID": "R7DAEZQP0K7NG", "Overall": "3.0", "Content": "I recently purchased the S4253 after much indecisiveness.  I purchased the tv for $1399 with a free basic wall mount.  I was looking for anything too fancy, but for the price and size, I really couldn't complain. For the most part the overall look and ease of use is great.My current connections include my first gen xbox through component input, and standard cable through coax, with no plans to go HD in the near future.  However I read that if you got an Up Conversion DVD player, it would aid in picture quality.  So a week later, I purchase the Samsung DVD-R135, Samsung Progressive-Scan DVD-R/-RW Recorder with HD Upconversion.NOW, FOR THE GOOD AND THE BADTo get the full use of the dvd, you have to connect using HDMI.  The good, I can say that the quality of my standard cable have very much improved.  DVD playback is great.The bad, if I use the dvd to watch cable, I get noise and loss of sound level.  I don't know if it's the dvd causing the noise or the tv, but dvd playback sounds great!NOW, here's another possible audio glitch. When I'm watching tv through my basic cable and I switch to either Xbox (component1) or dvd(HDMI1) I will not get any audio.  This happens moreso when I power on either devices prior to switching to that input on the tv.  When this happens, I just have to power off and back on.  Now, this has happened more frequently than I care for, and may be the deciding factor of whether or not I'm going to exchange or just return the tv all together.", "Date": "January 2, 2007"}, {"Title": "BUZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ Watch out!!!!!!!!!!!!!!!!!", "Author": "Diya Shari", "ReviewID": "R21DIE8REHMHNW", "Overall": "1.0", "Content": "I bought this TV from Fry's Electronics for $1399.00, I was going to buy the Panasonic TH-42PX60U BUT The Samsung looks a lot nicer than the Panasonic and for $100.00 more I thought it will be better TV as my sales person told me!!!I brought it home and it's easy to set up but the picture was not that clear and I got a BUZZZZZZZZZZZZZZZZZZZZZZZZ coming out from the back of the TV.Took it back the next day and bought the Panasonic for $100.00 less AND 10 TIMES BETTER PICTURE AND QUALITY.Go with the Panasonic and don't wate your time.", "Date": "January 3, 2007"}, {"Title": "Excellent T.V. !!", "Author": "paul jeska", "ReviewID": "R1WQA7ZFY65W8Q", "Overall": "5.0", "Content": "Fast free delivery, smooth transaction, awesome price from Amazon. This Samsung works flawless. No problems here.... Thanks Amazon!", "Date": "December 14, 2006"}, {"Title": "help me.", "Author": "A. Dang", "ReviewID": "R2WC3FN4A37ANA", "Overall": "3.0", "Content": "My mom bought this and it's our first plasma. Can anybody tell me why when I change channels there are flickering static like lines in the center? It lasts for atleast 1 second.", "Date": "August 14, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "720p, 42-inch plasma TV with integrated high-def ATSC tuner; measures 41.5 x 30.1 x 13.4 inches (WxHxD) with stand\nSamsung Digital Natural Image engine improves contrast, white level, picture detail and incorporates digital noise reduction\n1024 x 768-pixel resolution,16:9 aspect ratio, 1300 cd/m2 brightness, 10,000:1 contrast ratio, 175-degree viewing angle\nConnections: 2 HDMI, 2 component, 2 composite, 2 S-Video, 1 digital coaxial, 1 digital optical\nTwo stereo speakers, 10 watts apiece (20 watts total); SRS TruSurround XT virtual surround sound; Color temperature control YES", "Name": "Samsung HP-S4253 42-Inch Plasma HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51FHVGX5P2L._SY300_.jpg", "ProductID": "B000ELOQGE"}}