{"Reviews": [{"Title": "Excellent product at a great price!!", "Author": "PapaRaver", "ReviewID": "R3UZDH46E1LOSR", "Overall": "5.0", "Content": "I have been researching plasma screens for about a year before I finally decided on a Panasonic.  I was headed towards the consumer model with all the options, (which was a Consumer Reports best buy and the top rated CNET plasma), but then I found this model.  It's the professional version with the same screen.  It comes with inputs for component, composite, s-video, and PC.  You can order other input cards for HMDI or any other input device if you want it.  It doesn't have speakers or a tuner, which is okay for me since I have a DVR and I use my surround system.  All I needed was a great looking screen and this is it.  I shopped around for pricing on all the shopping sites, and there are some shady places that sell opened boxes or reconditioned screens for a \"better price\".  Some try the old bait and switch or try to sell you the massive extended warranty.  Panasonic won't honor the warranty from some of these stores too!  Beware!  The best price from a reputable place is from Tiger Direct.  I hadn't ordered from them before, but I figured I'd have Amazon's buyer protection if I needed it.  They shipped my order the same day and it arrived six days later via ABF Freight.  I had ordered a Peerless SF-660P wall mount for it that arrived the same day, thank goodness!  (I got it from the Peerless Industries website, if you're interested.) Everything is perfect and I couldn't be happier with how this screen looks on my wall.  It has the best picture of any screen I've looked at.  I highly recommend it.", "Date": "May 14, 2005"}, {"Title": "Exceptional", "Author": "Brian J P \"Brian P\"", "ReviewID": "R2S5P8A4FLZUCM", "Overall": "5.0", "Content": "This is by far the best for the highest quality 50\" HDTV that you can find.  New model 8 replaces this one -- only difference is 1080p, in addition to the 1080i which this model 7 is capable of.  I have looked for this size HDTV for 5 years and have found this to be superior to just about everything on the market...the one caveat is that this is just a TV screen (no speakers are included).  The optional TV stand works very well if you do not wish to hang the unit.  My purchase from Tiger Direct was flawless -- product arrived quickly and in perfect shape.", "Date": "October 20, 2005"}, {"Title": "Panasonic 50\" Plasma 5 Year Followup", "Author": "Pocketchange \"Pocketchange\"", "ReviewID": "R3DSDFKM4K3RVI", "Overall": "5.0", "Content": "After hanging on my bedroom wall for a half-decade and looking at the current crop of new available displays, I'm not looking to improve this (old) selection..nothing equals this displays picture.I picked up a cheap ($100) Magnavox Blu-Ray from WalMart and after my first movie, I don't think being without 1080P is a big loss in the long run, especially after viewing the current offerings..Maybe when someone comes out with smell-o-vision?", "Date": "March 19, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "50-inch widescreen, high-def, flat-panel gas-plasma display; measures 47.6 x 28.5 x 3.7 inches (W x H x D)\nDesigned to stunningly high specifications for business and professional use; 1,366 x 768 native pixel resolution\nExpandable connection options through 1 vacant and 2 swappable rear-panel terminal board insert slots\nStunning 3,000:1 contrast ratio, better-than 160-degree viewing angle\nOffers 8 watts per channel x 2 for use with optional speakers", "Name": "Panasonic TH-50PHD7UY Professional Series 50-Inch HD-Ready Flat-Panel Plasma Display", "ImgURL": "http://ecx.images-amazon.com/images/I/31K2CPD99BL.jpg", "ProductID": "B00065XUQU"}}