{"Reviews": [{"Title": "ONE STAR ONLY", "Author": "Ktowntn Chicago \"ktowntn\"", "ReviewID": "R21CON2FAWA2NA", "Overall": "5.0", "Content": "My revised review.  I am unable to change the original 5 star rating to 1 star.  After almost 3 years.  my picture is getting progressively darker with horizontal shadow bands prominent.  Samsung's website provides service center locations for other product they make.  However, their website requires you to call an 800 number just to get a service location.  I was hung up on my 2nd attempt to get through.  I wasn't belligerent or angry. I was just reluctant to give out my personal info, ie name address, phone number, etc just to get a service location.When i told told the person on the line my name was \"John Smith\", I was quickly disconnected.  Sadly, funny.", "Date": "February 14, 2004"}, {"Title": "Wow", "Author": null, "ReviewID": "R1XR3DCDW1LMI", "Overall": "5.0", "Content": "Purchased this TV at Amazon.com after fiasco with an un-named online retialer. The TV is great. I spent about 3 months researching the field before I made my decision. I made at least 7 trips to Best Buy (not to confuse with bestbuyplasma.com grrrr...) looking at all the Sonys, Samsungs, Sharps, Hitachis, etc.  I have no clue how Best Buy can sell so many TVs these days. Prices are SO MUCH higher there than on Amazon. People either don't do research or too affraid of online purchases. I did pick up Samsung HD DVD player there though, only $20 more than online. I don't remember DVD model, the one that does 720p up-convert and has DVI out.This TV is cheapest you can find in 32\" 720p category that offers tremendous bang for the buck. Some reviews mentioned over-saturated red color, some mentioned flaws in picture quality. This is not true, plain and simple. This TV requires some tunning when unpacked from the box. Duhh... It took me about an hour to go through calibration and tuning. The results are amazing. Use DVI. Use DVI. Can I say it again? DVI is digital connection. Throw away all your fancy Monster Cables. It is unfortunate and makes me feel sad when people say how great DVI Monster cables are. I understand that analog Monster Cables are of high quality while perhaps being too pricey. With digital connection you either have a picture or you don't. There is no \"in-between\": no noise, no color change, no blurring is even possible. I am yet to see a DVI cable that would not transmit 0 and 1. $15 cable from Menards(!) worked just beautifully. Any and all DVI cables are equal.I went with gold plated S-video cable ($10 from Menards) for my older satellite dish that does not have DVI output (waiting for my HD pack now :) S-video is analog signal and requires some care, hence gold.Now bad things (not enough to reduce to 4 stars though): 1. Only one DVI input. I will have to buy DVI switch box.2. Setup: it takes some time to figure out correct set of modes(menus) for true digital (DVI) connection. The trick that helped me resolve the problem was connecting TV via old-fashioned composite cable along with DVI. This allowed for tracking menus even when no pitcure can be seen on DVI input.3. Speakers: I am not a great fan of elephant ears in TVs. TV looks much cleaner without them, fits very well in my not very large room. Combined with ($600) Infinity Total Solutions(TM) 6-Speaker System (TSS-750PLT) this TV is a peice of art in a frame. The downside was that I still had to pay for speakers that now sit in my garage.(...)", "Date": "June 18, 2004"}, {"Title": "4 stars for movies, 5 for PC and video games.", "Author": "SpaceMonkey", "ReviewID": "R37L8J03A5U98G", "Overall": "4.0", "Content": "I'm no expert on Televisions, but I've read enough about them to write a useful review for you.  First off, as stated by another reviewer, the response time (16 milliseconds) is one of the fastest available and should be a big selling point for this screen.  Similar screens by other companies such as Dell for example have response times of 20 or 25 milliseconds.  The higher the number, the more \"lag\" or \"ghosts\" will be seen while watching movies.  Be sure to ask about response times of any LCD screens you look at.  I bought this TV over amazon.com and overall I'm very satisfied.  I mainly view DVD's, video games and surf the internet with mine.  I don't watch television much so I can't give you a review of that.  From what I've read, LCD screens are not the greatest for regular television viewing; however, HDTV will look awesome as soon as it becomes the standard.  Here is the equipment I'm using:  I have a samsung HDTV dvd upconverter player.  It's a newer dvd player that enhances standard dvd's up to minimum HDTV standards (720p or 1080i).  I used the DVI connection via a $100 monster cable which can be found on amazon.  It doesn't pay to own this TV if you plan on viewing anything with composite (S-video) connections.  The component video is extremely better especially hooked up to a progressive scan dvd player (480p).  When viewing DVD's through my player, there wasn't much difference between picture quality using the DVI input (720p or 1080i) or the progressive scan component connection (480p).  This is only true because of the DVD player I'm using; DVI is still the best connection you can get for any TV.  The DVI input for this TV should be a major selling point because it will be used for any HDTV signal.I rate movie viewing 4 stars because of a few flaws.  The flaws can be seen while watching older dvds.  Most movies looked great from start to finish except during certain scenes:  I watched \"Good morning vietnam\" in (480p) and the picture experienced some lag.  The actors lips were not moving along to the audio; the picture was trying to catch up to the dialogue - very annoying.  The same thing was experience while watching a newer dvd entitled \"Cabin fever\" in (720p).  Whenever a movie had fog or rain or mist in the foreground around the actors like in \"Master and Commander\", the image would get somewhat grainy in (720p); however, the rest of the movie looked great.  Aside from that, other movies seemed to look great from begining to end.  All three Lord of the Rings movies looked stunning in (720p) - hardly any flaws; the same was true with all three matrix movies.  Overall, it is a good set to watch movies on, but it depends upon the quality of your player, the connections and the quality of the DVD.  Older dvd's experienced alot of lag along with a few newer ones.  But, a majority of newer dvd's (from the last 5-7 years) looked great.  They looked better than a CRT model - using my set up.I feel that the real great thing about this TV is the ability to hook it up your computer.  You no longer have to sit in front of a little 15, 17 or whatever sized screen.  You can sit on your couch, put the keyboard in your lap, and surf the net on a 32\" just like you were watching TV.  If you use a computer often for the net or typing or even PC gaming, this is definatly the TV to buy.  The computer image was flawless.  I play simcity4 and it looks amazing.  Again, the equipment you hook up can play a big difference in the results you get.  I have a 2.4ghz Dell 4600 with a DVI output.  I haven't hooked up the PC via component connection yet and I don't know if you can. This is more than just a TV, it's a huge computer monitor and this was the main selling point for me.  Highly recommended for PC use.Lastly, video games look amazing as well.  I have my Xbox hooked up through a high definition pack via a component connection.  Games such as Halo, Tigerwoods 2004, Unreal Championship, Splinter cell etc. look crisper and cleaner than on any CRT that I've seen.  I've played xbox on a samsung 30\" HDTV CRT with the high definition pack and this LCD screen still looks better.  Overall, This is a good buy.  I have a few complaints about some movies, but most have no problem with lag.  This could have something to do with the player I'm using so don't let that discourage you from buying this.  One thing to keep in mind is that as time goes on, dvds will increase in picture quality up until high definition dvds comes out.  As soon as that happens, this TV shouldn't experience any lag at all - hopefully.", "Date": "June 8, 2004"}, {"Title": "Handsome quality, still takes getting used to", "Author": null, "ReviewID": "R1P4SYEQTZQ0QQ", "Overall": "4.0", "Content": "This screen is a total indulgence for me. I waded through a lot of the jargon to familiarize myself with the technology, but in the end, it was still a sort of irrational decision. The box is huge, but the set is optimally sized, with the case not much larger than the screen. The detachable speakers have stayed in the box, which was a selling point for me. Wish I could have bought the screen more cheaply without the speakers at all. The connections are pretty robust, yet it took me several attempts to bring up an image. I'm neither the biggest geek nor the biggest technophobe, so getting the devices to communicate was less obvious than I may have preferred but ultimately do-able. So many options can turn into a tragedy of riches.Picture quality is quite good but quite different from the blur of a CRT. It's very bright, which works well for dark images, and it gets over ambient light very well. The composite connection yields really poor results, but who really expects to use that? The component connection is far, far better, but even that reveals screen artifacts unknown in a CRT, such as the distortion of lines moving across the screen. Progressive scan DVD players are reported to improve this (I don't yet own one).Without a lot of video sources or comparisons to other LCD or plasma, I can't reliably steer a potential buyer toward or away from this product, but aside from a few minor quibbles, I'm quite happy thus far with mine.", "Date": "March 5, 2004"}, {"Title": "You get what you pay for sometimes.......", "Author": "Robert Merivel", "ReviewID": "R10YB805X63WIF", "Overall": "2.0", "Content": "The $2999.00 sale price at Fry's Electronics made this one hard to resist.  We knew that some reviews mentioned on the Internet stated that there were red hue problems in the flesh tones.  Those concerns turned out to be true. Faces were way too red, making news anchor-people look like they had been out in the sun too long.  We really did not want to return it for the price was great compared to others we had seen in this size range.  We just could not tolerate it considering the amount of money demanded for this type of television, so it was returned.", "Date": "March 17, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "16:9 widescreen aspect ratio and native 1,280 x 768 resolution (HDTV viewing requires external set-top box decoder)\nDual-tuner PC picture-in-picture lets you watch TV and use your PC simultaneously or watch 2 TV shows at the same time\nDolby Digital decoding; 10 watts per channel with 5 built-in speaker outputs, a subwoofer output, and 2 detachable speakers\nHigh 600:1 contrast ratio, exceptional 500 cd/m2 brightness, long 60,000-hour lamp life", "Name": "Samsung LTN325W 32-Inch LCD TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41FQCZPVPYL._SY300_.jpg", "ProductID": "B0000A2UAK"}}