{"Reviews": [{"Title": "Weak.  Very Weak.", "Author": "C. Coutts \"The Sailor Man\"", "ReviewID": "R596IA06IE483", "Overall": "1.0", "Content": "I am the first one to admit that I love my toys, and while I have mellowed in my old age, I have owned a lot of audio and visual equipment over the years.  I was really excited to be getting my first flat screen TV, and figured a product from Phillips Magnavox would be a good one.  Well, I was wrong.  Let me begin by saying that this TV is only four and a half months old!  Major technical issues have arisen in which the TV makes horrible noises and shuts itself off.  I looked around online and found lots of other people have had the same problem as well.  Then you have to call their technical support, which is just a great way to kill some time before they come back and tell you to take it to a local service center, and that labor is coming out of your pocket.  They will however let you know \"how sorry they are to hear that,\" about 7 or 8 times.  Not a great product, poor service, not super cheap either.  Try another brand, especially if you are going to spend this kind of money.", "Date": "October 9, 2006"}, {"Title": "DO NOT BUY THIS TV!!  IT blew up in flames!", "Author": "L. Mccabe", "ReviewID": "R14ADTK9PXRV3D", "Overall": "1.0", "Content": "I bought this tv about 1 year ago and thought it was a good deal for the money, the picture its great with satellite tv, although it did have some sound issues.The other day My 2 year was watching a video and all of a sudden we heard a huge pop saw flames in the back, and then it started smoking and burning. I called customer svc to complain, a supervisor called back the next to apologize and they said they would send a brand new tv, but i am still waiting.", "Date": "May 16, 2007"}, {"Title": "i hate magnavox", "Author": "Bradley G. Niemann", "ReviewID": "R2I6EPE3PL4LSN", "Overall": "1.0", "Content": "i get the tv, it breaks and i feel like killing myself. thats about it. buy a samsung or something that has more than a 3 month warrenty. also, tons of repair places next to where i live dropped the mag. account because it was causing them too much money repairing all their crappy products for the warrenty. i hate magnavox.", "Date": "April 2, 2007"}, {"Title": "KEEP YOUR MONEY!!", "Author": "Gail Campbell", "ReviewID": "R1C5QPOEX7YWVR", "Overall": "1.0", "Content": "Less than two weeks out of warranty and the screen goes blank. Magnavox tells me tuff, it is out of warranty.BAD BAD BAD product and BAD BAD BAD company to do business with!!", "Date": "December 22, 2006"}, {"Title": "poor reliability", "Author": "Ed in Phoenix", "ReviewID": "R1WRM5QFBUGT58", "Overall": "1.0", "Content": "This is my second one. The first one lasted 3 weeks and started turning itself off. I took it back to the dealer and like an idiot decided to try another one. It worked for 13 months and started to do the same thing the first one did. Magnavox said there were no recalls and I was out of luck since it was a month out of warranty. I don't know yet what it will cost to fix but after paying $1000.00 for it and it lasting only 13 months, you can be sure that it will be the last Philips/Magnavox product I purchase.", "Date": "August 26, 2007"}, {"Title": "Just purchased", "Author": "Matt C \"MTC\"", "ReviewID": "R1E7L3LJSTYZ5X", "Overall": "4.0", "Content": "I've read some reviews saying that people are dissapointed in this tv but I'd have to disagree. I only paid $654 at Circuit City because it was an open box special and on sale. I might be a little dissapointed if I paid over 1000. Plays dvds near HD with a S-video cord on a cheap dvd player. We don't have HD tv or even digital cable until next month but regular cable still looks better then with our 20 inch SD RCA which we paid 400 for. The remote is pretty horrible, The speakers are descent but our stereo makes up for it.", "Date": "October 16, 2006"}, {"Title": "You can't go wrong for $650", "Author": "Forza Catracha \"jcva13\"", "ReviewID": "RUO2F3CMAHQSQ", "Overall": "4.0", "Content": "I got this TV on a 300 discount, plus I had 50 dollars on gift certificates good on the store I purchased it from. I was very hesitant to buy a Flat Panel TV because the image doesn't look that crisp on the floor displays at stores. And paying 1,000 bucks for a 26 inch TV is not my idea of investment. So I decided to give it a try. For the price I got this you can't get better or bigger TV's. BTW got an 18 month no interest financing.Most negative reviews I have read got me concerned but some problems are avoidable or easily solved by simply reading the owner's manual. A/V cables work much better than the regular coaxial and I read component cables make the image even sharper.What I like- DVD's look Better, specially since I like widescreen versions over full screen, so now I can take full advantage of this feature.- Video Games look better. Hopefully I can get a New Gen console to get the most out of this HD TV- The virtual surround sound is better than the 27 inch JVC TV I replaced.- Can connect different devices, no need for a reciever anymore, unless you want real surround soundWhat I don't like- Remote has confusing buttons- No volume display unless you configure it but you see an icon on the screen for a while- Menu is not as intuitive as it could be.If you can get it at a bargain price you can over look the imperfections and be satisfied with your purchase. It is enough if you don't have to many HD capable devices or non at all, or as an introduction to flat panel hdtv's", "Date": "January 22, 2007"}, {"Title": "worst gift ever", "Author": "barbara", "ReviewID": "ROJWPOMNYZ1OM", "Overall": "1.0", "Content": "after purchasing this TV for our parents 60th Anniversary, it seems we have given them nothing but strees & aggravation, not the pleasure we thought a wide screen LCD TV would provide. It is just returned form the TV repair shop for its latest 2 week visit. This is the 3rd breakdown in less than 5 months. At this point with all the replaced parts , they have a rebuilt TV &  maybe had the pleasure of their TV 3 out of 5 months!Dealing with Maganavox is madding!", "Date": "November 18, 2006"}, {"Title": "Not bad at all!", "Author": "L. MCCOLLUM", "ReviewID": "R2RR8UK40GQQ7D", "Overall": "4.0", "Content": "At first, I was unhappy.  I couldn't get the Autoprogram to work (just about the only annoying feature on it).  Once I finally got Autoprogram and satellite TV to work, the picture was really grainy.  I was so disappointed.  I was ready to send it back.For some reason, the picture got better after the first day (go figure).  I felt like a complete idiot after I opened the manual and found directions to hook everything up RIGHT THERE- duh!!To me, the remote is fairly intuitive and thankfully uncomplicated.  The only thing harder to figure out was the View button and that button with the check mark.  Once again, after reading the simple directions, I learned quickly what they were for.Most manuals are hard to follow or not easy to read.  I think that affects why most people will resist reading the one for this TV; however, it's a simple read and it'll save you a lot of grief.I got it for less than $700- more than I want to spend to sit in front a box but far less than you would spend for a picture this quality.  I've looked around for a while and one of the only other TV's this crisp was the 26 inch Magnavox that sold for just a few bucks less.  Other good TVs were at least $200+ more, so this TV is a good deal.I was enthralled to learn that you can download upgrades for this TV on the manufacturer's website.  You plug a memory stick into your PC.  Download the upgrade to the stick.  Plug the stick into the USB slot on the TV.  Follow the directions for the upgrade and the TV's upgraded.From what I hear, the newest Magnavox LCD TVs have only minor difference from later models.  Doing upgrades might save you from upgrading to a newer model if internet upgrades are performed every few months or so.NOTE:  You can't stop the upgrade or remove the memory stick during the upgrade.Once you learn its \"system\", this TV is easy and it looks great.  Read the manual!", "Date": "March 16, 2007"}, {"Title": "great TV, Great rpice", "Author": "defcon888 \"wanna be rockstar\"", "ReviewID": "R24Q1DKK64YVN4", "Overall": "5.0", "Content": "I bought this TV about a month ago. I also bought the 3 year extended warranty. I love this TV. I read some of the negative reviews and while those users may have had problems, I don't think it is indictitive of the overall product quality. You get lemon's in all products (ask me about my Ford Mini-Van). But, I digress, I bought this TV to replace an old tube TV that crapped out on me after 6 years (RCA). To replace it with a another TUBE TV was going to be around $500+ and this one was $699. I am glad I spent the extra cash for this TV.The picture is amazing, and I have Comcast Cable and they have many HD stations and WOW WOW. I did a comparision for a regular Jay Leno versus a HD Jay Leno.......the colors and the clarity was like night and day. My DVD's look better even though it is just a regular DVD player.My kids hooked up there XBOX360 via the HD option of the XBOX.....drop dead amazing. The games take on another life. I am not into Video games but I was floored watching my kids play it.Bottomline: if you are looking for a started HDTV, you can't go wrong with this one...especially for the price.", "Date": "March 5, 2007"}, {"Title": "DO NOT BUY", "Author": "Bk", "ReviewID": "RE645IDBHBLXU", "Overall": "1.0", "Content": "DO not buy this TV or any other TV from this brand. Piece of junk. Stopped working after 2 years. Waste of money..", "Date": "December 9, 2013"}, {"Title": "I LOVED THIS TV FOR YEARS, BUT IT DIED ON ME", "Author": "Che", "ReviewID": "R1RZ5PLNJYBMW4", "Overall": "4.0", "Content": "I PURCHASED THIS TELEVISION FROM CIRCUIT CITY IN 2007 AND AFTER HAVING THIS TV FOR 4 YEARS, IT JUST STOPPED WORKING. I WAS WATCHING TELEVISION ONE NIGHT, THE PICTURE WAS BLURRY, COMING IN AND OUT IN WAVES. I THOUGHT IT WAS MY CABLE, SO I TURNED OFF THE CABLE. I LEFT THE TV ON AND NOTICE THAT THE BLACK PICTURE WAS STILL COMING IN WAVES. I TURNED OFF THE TV AND IT NEVER TURNED ON AGAIN. IT JUST DIED! THE FOURS YEARS I HAD THE TELEVISION, I THOROUGHLY ENJOYED IT, AND I AM DISAPPOINTED THAT IT DIED ON ME. THE TV TECHNICIAN THAT CIRCUIT CITY PROVIDED TO ASSESS THE DAMAGE STATED HE WAS SURPRISED THAT THE MAGNAVOX LASTED THIS LONG. THE TECHNICIAN STATED HE HAS BEEN CALLED IN TO ASSESS MY SAME MAGNAVOX NUMEROUS TIMES AND WOULD NOT RECOMMEND IT. I WOULD ONLY RECOMMEND THIS TV IF YOU CAN GET IT FOR $250-300, SINCE THATS HOW MUCH CIRCUIT CITY IS WILLINGLY TO GIVE ME SINCE ITS A TOTAL LOSS. THE TECH STATED HE WOULD RECOMMEND SAMSUNG, SONY, OR PANASANOIC, BUT HAS DONE SOME REPAIRS ON SAMSUNG. I'M PLAN ON PURCHASING A SONY.", "Date": "July 19, 2011"}, {"Title": "Bad TV", "Author": "KuriousKats", "ReviewID": "RQHGXPI6VPAK4", "Overall": "2.0", "Content": "Was initially impressed for a while as it had good picture and sound, etc.  Then the picture would sometimes go out but volume remain, sometimes there was a picture but no volume, sometimes neither - all of these were resolved by resetting it (unplug it and replug it).  It was a pain and I've never had to do that before to any other TVs but OK it was resolved.  Then it also started turning itself off a few times.  Now the TV has apparently died and probably cheaper to replace than repair since it of course waits to die until after the warranty expired.", "Date": "May 28, 2010"}, {"Title": "DON'T BE FOOLED!!! Cases filled against Magnavox /Philips over their power supply and screen issues on these LCD TVs", "Author": "Jackie D. Buffat", "ReviewID": "R2BW6H2MM79PCK", "Overall": "1.0", "Content": "I purchased this 32MF231D/37 TV and under a years time it started shutting off after running for 20 minutes and would not come back on unless it sits for an hour. Then the other day I turned it on and there was no picture, no sound, and the green power light keep going off and on. I did some research to see if it could be fixed and found many complaints about these sets with bad capacitors on the main PCB, power supply and screen issues and the whole board going out. The cost of a new board runs about $350.00. See my point??? I could buy a new one for that price. I will never buy another Magnavox /Philips again. Don't waist your money!!!", "Date": "January 29, 2010"}, {"Title": "Cant beat it for the price", "Author": "Brandon Smolka", "ReviewID": "R2Q8MI85DTE106", "Overall": "3.0", "Content": "Great TV for the price; calibrate it though, otherwise its way too rich looking. FYI, It DOES have a digital tuner, contrary to what it says above. (ATSC IS a digital tuner!)", "Date": "November 17, 2008"}, {"Title": "At first great, but pixs went out 1 month after warranty!", "Author": "Brooklyn Met Fan \"Joe T\"", "ReviewID": "RN61SO8OY9UH1", "Overall": "1.0", "Content": "I liked this tv a lot.. but one month afer the warranty expires, the picture goes out.. i get the sound, but absolutely no pictures... magnavox indicates that it needs repai.. I take to get it fixed and was told over $600 because display and controller need to be replaced!  I did research, and found many similar situations with magnavox on the consumer complaints website... i looked for complaints with other manufacturers and couldn't find as many nor as recent as those listed for magnavox... i do not believe it to be an isolated incident!  if you do buy, get the extended service plan with it... I didn't get the repair done and opted to get another TV....", "Date": "February 27, 2008"}, {"Title": "A Good Starter HDTV", "Author": "Josh Czech \"Joshua Czech\"", "ReviewID": "R350TLT0278CEC", "Overall": "4.0", "Content": "I got this product last August and it is still working to my satisfaction.  I admit there are some kinks that are minor flaws to me, such as the picture turning off then on every so often, and the component cables are under the back portion rather than behind the screen.  However, I got this for around $700 out of box from Circuit City and as a college student, this was a good buy considering I don't have a huge income.  It's better than the regular television I had and watching HD programs and playing my PS3 (with HDMI cable) makes the pictures look amazing.  Even my DVD's look better b/c of this widescreen television.  I customized my picture and sound quality to my liking so I have no complaints there.  The sound problem that others have did not concern to me.  Like I said, I'm still in college so this is a good alternative for me until I can afford to upgrade to an even better product that I can play in my own home and get some BOSE speakers.  My advice though is if you can afford to spend money on a new HDTV, do your research and pick a product that has better quality than this television.  Good luck in your searching!", "Date": "December 23, 2007"}, {"Title": "Trouble...", "Author": "Rice Delman", "ReviewID": "R1XXEJHGTATYD", "Overall": "2.0", "Content": "Seemed like a good deal until I noticed that the HDMI input didn't work.  It's been in the shop now for a week.  I'm hoping it just get replaced or I get store credit at Circuit City.  Buyer beware, you get what you pay for.", "Date": "November 9, 2007"}, {"Title": "magnovox lcd 32 inch", "Author": "Clyde E. Baxter", "ReviewID": "R14I072SR6Z7I3", "Overall": "5.0", "Content": "i don't know what lies in the future, but this tv is great.  good picture, good price, great price.  the part where it fills in the hd and movie to full screen is tops.", "Date": "January 28, 2007"}, {"Title": "Love this TV", "Author": "texan", "ReviewID": "R3406ZHZOS5U9W", "Overall": "5.0", "Content": "I read the negative reviews here.  Then I read that Consumer Reports listed it as a \"Best Buy.\" I decided to trust CR and haven't regretted it.  This is a great TV with great HD picture and pretty good SD.", "Date": "November 27, 2006"}, {"Title": "Good after a rocky start", "Author": "Michael", "ReviewID": "R12VZ8P2ZJK3ZF", "Overall": "4.0", "Content": "I purchased one of these from Magnavox through a well known auction site (not e Bay.  It arrived with no power cord but they sent me to a service center a few miles form my house and they handed me one---if they had told me that it wasa standard PC type power cord I could have saved the gas.there were problems out of the box.  the connections are vertical not flat against the screen.  That makes it easier to hide the cables but harder to connect them---especially S Video. The standard picture settings are not that great.  I found some suggestions online about what to do with them.The picture actually seemed to improve after a few days. I am happy with it so far.", "Date": "January 8, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "32-inch LCD TV ready for HDTV right out of the box; measures 36.5 x 21.6 x 8.5 inches (WxHxD) with stand\nIntegrated NTSC, ATSC tuners; QAM tuner compatible with unscrambled HDTV cable reception\n1280 x 720-pixel resolution, 500 cd/m2 brightness, 800:1 contrast ratio, 8 ms response time\nInputs: 4 composite, 2 S-Video, 2 component, 1 RF, 1 HDMI\nTwo stereo speakers, 10 watts apiece (20 watts total)", "Name": "Magnavox 32MF231D 32-Inch Widescreen LCD TV", "ImgURL": "http://ecx.images-amazon.com/images/I/51SM3H3H48L._SY300_.jpg", "ProductID": "B000FBF24I"}}