{"Reviews": [{"Title": "A very good HDTV", "Author": "vham \"Transformation\"", "ReviewID": "R29FESLBMC13PO", "Overall": "4.0", "Content": "I dumped my old Mitsubishi CRT-based rear projection HDTV when we moved to another house. That TV was a back-breaker to move. To replace it, I found this one after much research on the Net and with visits to Fry's, Circuit City, and Best Buy. I found no independent reviews of this model on the Net. However, the specs for this TV impressed me. What I most wanted was the ability to receive 1080P sources natively and connect to a PC with a DVI connector. This TV seems protected from early obsolescence with the plethora of connectors: HDMI, ieee1394, and component video. I did confuse the specs with those of the other TVs I researched. I thought that, like other similar Mitsubishi models, this one has memory card (SD, MMC, etc.) slots and USB connection. I was disappointed to find out when it arrived (in late July 2006) that it did not. However, this was not much of a loss for me. I was impressed by the quality of the picture. I was worried about the quality of rendering standard 480p DVDs and standard def TV. However, watching DVDs was a joy. The color was well saturated and accurate. The picture was bright. It was definitely an improvement over my old HDTV. Watching standard def TV was tolerable, though one could definitely see its lack of detail. My small children seemed to enjoy watching their cartoon shows on the standard def channels, though. With cartoon drawings, the graininess of SDTV is much less noticeable. Watching 1080i HDTV was very satisfying. But I'm too cheap to get HD cable, and I don't watch TV that much, anyway. I'm waiting for the HD-DVD or BluRay players to become more available and affordable.", "Date": "August 21, 2006"}, {"Title": "Best picture found after a month of research!!", "Author": "G. Wheeler", "ReviewID": "R2RFO7T0W8Z0MX", "Overall": "5.0", "Content": "I received my new Mitsubishi 57\" DLP TV yesterday from Best Buy, and waited while Direct TV installed my HD signal.  All I can say was that I was blown away by the quality of the picture in HD.  Guys if you are like me and love football you are going to love watching it on this set in HD, it takes it too another level.I must have read every article on the internet and publications regarding Plasmas, LCDs, and DLPs.  After comparing prices on 50\"+ TV sizes in all three formats, I came back to this TV and purchased it.  I caught this TV on sale at Best Buy for $2512 plus additional 10% off coupon that I had and applied it the total to bring the TV down to $2200 (what a deal).  The very next week Best had the TV at $3000+.If you do not need a slim TV to go on the wall then this is the TV for you!Are you ready for the some football!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "August 11, 2006"}, {"Title": "WOW", "Author": "Michael J. Tenney", "ReviewID": "ROUYCYWZUU2NQ", "Overall": "5.0", "Content": "This is unreal. Super picture. Awesome sound. Great service from Amazon. I ordered this Wed and received it Friday. The delivery man even helped me unpack it and put it on the optional stand I bought. Plenty of hookups for all your components.", "Date": "August 25, 2006"}, {"Title": "BUYER BEWARE & Stock up on LAMPS!!!", "Author": "Terri Limbert", "ReviewID": "R20HG753XLC74N", "Overall": "5.0", "Content": "PAY NO ATTENTION TO THE FIVE STAR RATING, that was when I first bought it. Bought TV less than a year ago, lamp has already burned out. Today is Friday, won't have it till Tuesday!! Before buying I read the lamps last 20,000 or so viewing hours, this is UNTRUE, today I'm told by the customer service department they only last 3000-4000 viewing hours!! What a CROCK!!! Wouldn't be so bad if you didn't have to pay $229.00 per lamp and have to take the whole wall unit apart to change it out!!!! UNACCEPTABLE!!! BUYER BEWARE!!! Perhaps the LCD or Plasma would have been the way to go. Very dissappointed!!", "Date": "August 10, 2006"}, {"Title": "Loving the Mitsubishi WD-57731", "Author": "R. Gordon", "ReviewID": "R1FXHILF3F23NG", "Overall": "5.0", "Content": "I originally purchased the Samsung HL-S5687W but was not happy with the picture.  Standard Def broadcasts were very unappealing and the high-def pictures tended to be blurred when there was much action going on.I couldn't be more happy with the Mitsubishi.  Even standard def programs are improved.  720p looks amazing on this TV.  I can't recall seeing a better picture on any Plasma, LCD or DLP TV.  I can't wait to get my HD DVD player and experience 1080p on this TV.", "Date": "September 9, 2006"}, {"Title": "Outstanding picture!", "Author": "Brad Fulbright", "ReviewID": "RLISNWQ5ZKWML", "Overall": "5.0", "Content": "I researched many types of TV's - plasma, LCD, etc. - before deciding to purchase this one and could not be happier.  I was a little concerned about the life expectancy of plasma technology and I didn't care about mounting the set on a wall.  The high def channels are superb and the standard def channels are better than what I expected.  The sporting events I watched over the weekend - NFL and US Open tennis matches were incredible in high def.  The sound quality is tolerable, but I would recommend hooking this TV to a surround sound system as mine is to enjoy the whole package.My experience with this purchase from Amazon was easy and delivered as expected with no problems.  I also purchased the matching stand through Amazon as well and could not be happier with it.", "Date": "September 11, 2006"}, {"Title": "Almost Perfect", "Author": "S. Ferguson", "ReviewID": "R15A4BGW3B5BMI", "Overall": "4.0", "Content": "The Good:1. Great array of inputs.2. Great on screen guides.3. Great display of SD signals.4. Outstanding display of HD signals. Can't wait for some 1080p content!5. Great customization options for color, brightness, etc.6. Easy to use (even in the dark) remote.7. Out of box settings aren't bad at all. You could tune down the brightness and color temp. and do nearly nothing else and it would look fine. The videofiles will want to further tweak.8. At 88 lbs, I could move it myself if I could get a handle on it. If Mitsu incorporated some molded handles in a thought out location, us bachelors could move it solo.The Bad:1. Processing fire, ticker tape and fast water movement (think surfing scenes) becomes pixilated. Hopefully better processing is included in latter models.2. Switching from SD to HD signal takes about 4 seconds... even 720 to 1080 takes a few seconds. This MAY be more of an issue with the POS (piece of sh*#) DirecTV HD receiver which earns my frown of the year award for customer ripoff/ lousy design in an overpriced, under-engineered electronic device category.3. Cannot split screen between TV and CPU. What's the point then I say!4. To go from TV to CPU (set at a higher resolution like 1080 x 1920) you have to first tune to an HD (720 or 1080) station. Otherwise the CPU display is distorted and you receive an \"invalid signal type\" message.Overall:I doubt you'll find a better TV for the price. I've learned to live with the bad and you can too.", "Date": "March 8, 2007"}, {"Title": "amazing features, outstanding quality", "Author": "volsmd", "ReviewID": "R2GYAY3NJ3TKXB", "Overall": "5.0", "Content": "After doing much comparison shopping, I decided to go with this Mitsubishi over comparable Samsung and Sony models.  I am completely satisfied and highly recommend this set for anyone considering a DLP.  Picture quality is crisp, well defined, and highly customizable.  This color settings need to be adjusted out of the box for the best picture.  (I recommend using the Bright setting over the Natural and Brilliant options).  In fact, the HD signals are so good that you don't want to watch basic cable.  The design is elegant.  One issue with DLP sets is something called the rainbow effect.  I would read about this before purchasing any DLP set.  Either way, I haven't noticed this issue at all with either HD signals or basic cable.  In my opinion, the picture is flawless.  With all that said, there are a few things I would like to change.  The depth dimension is slightly long but of course if depth is an issue, then I would go with a Plasma TV.  The second issue has to do with PIP.  The set only allows PIP from 2 individual signals (coax vs. RCA, coax vs. HDMI, etc).  In order words the cable signal that arrives from one source cannot be used to provide PIP.  The final issue is the delay in changing channels with the remote.  Not sure why this happens.  Of note, this is not an issue when using another source to change channels such as TIVO or the VCR.", "Date": "October 28, 2006"}, {"Title": "sports heaven", "Author": "The Sheriff", "ReviewID": "R1BYRS5AX444RU", "Overall": "5.0", "Content": "The image quality for this DLP monitor is as good or better than any Plasma or LCD screen I've seen in the past six months!  The high resolution (1080x1920) makes the nature shows and sports programs (i.e. football) quite enjoyable to view; plus, with HD and the 57\" screen, DVD movies are seen at a whole new \"speed\". So far, I'm impressed.", "Date": "August 15, 2006"}, {"Title": "Excellent TV, Games look gorgeous, but a small issue...", "Author": "Sean Knudsen", "ReviewID": "RQOU89FK48DWH", "Overall": "4.0", "Content": "First off, I actually bought this TV at Best Buy ($1,899), but Amazon is a great place for customer reviews, and I would've bought this TV from Amazon had they been able to ship it to Alaska, but oh well. This HDTV is great. Not perfect, but awesome anyway! I did a lot of my own research in deciding what type of HDTV to buy, the whole LCD vs. Plasma debate, etc... It seemed to me that rear-projection DLP sets were the way to go, providing the best possible picture for the money. So I was off to find the right DLP, and decided to go with Best Buy, as they got it up to my remote town in northern Alaska for only $100! Anyway, I got it all hooked up and it is truly an awesome sight compared to the \"little\" 32-inch Panasonic CRT it replaced. It's fairly light for it's size, too, weighing in at only 96 lbs., which was much lighter than the 32\" TV as well. It has oodles of hook-ups in the back, plenty to satisfy the audio/videophile in me. It's got a number of different screen formats to choose from, depending on your source. I was wanting to find one that didn't always stretch the regular 4:3 ratio of standard TV, you know, where it makes everyone look fat and squished... This TV can display standard format, stretched format, expanded format, zoom format, etc...... It's got plenty.As far as performance, this TV rocks. I bought this TV for the future, as there's not a whole lot of 1080p stuff out there right now, but there's plenty of 720p and 1080i media. I use this TV for a lot of gaming, and let me tell you, going from standard definition on a CRT to 720P on this TV will blow you away! I changed the setting on my XBox 360 from standard to widescreen/720p for playing Test Drive Unlimited, and the difference was amazing, I could hardly believe it could look so much better, but it does.The reason I only gave the TV 4 stars is that there seems to be a small issue relating to some games. When I play DDR Supernova or DDR Extreme 2, the video timing is off by about a 1/4 second. On most games and/or DVDs this is not even an issue, but when you're playing with a game that is all about timing (many sports games suffer from this problem as well) it makes it all but impossible for a good score without \"adjusting\" your own timing, which is pretty hard if you're dancing to a song with 180+ bpm. Anyway, I've contacted Mitsubishi support and am waiting for their reply. It seems from doing some searching on the net that this might be an issue with rear-projection DLPs as a whole, not just this particular one. I will post again if I find a way around it.Which brings me to another topic, the warranty. Wherever you buy it from, make sure you buy an extended warranty for it. In the end it will be worth it, and you won't end up like that other guy who left a poor review above. Best Buy offered a 4-year total care plan for $400, which is totally worth it, since a new lamp is close to $300, and they'll send you one of those for free if it goes out, as well as fix or replace the TV for free if it breaks. I don't know where that other guy got his, but he won't get anywhere dealing with Mitsubishi themselves. Buy from a reputable dealer like Amazon or Best Buy or Circuit City, etc, as they will offer warranty service and great customer relations.So, anyway, this TV rocks, and I can't wait to hook up a Blu-ray player to this thing and watch some great-looking movies. I am very happy with the TV, and in spite of the minor timing issue on those games I mentioned, I would definitely recommend this as a must-have TV.", "Date": "February 21, 2007"}, {"Title": "TV is Awesome; Amazon is NOT!!!", "Author": "JS", "ReviewID": "R1NGUXJNDXNC9F", "Overall": "3.0", "Content": "I ordered this TV from Amazon in March and waited for 3 Days to have it delivered, which was no problem.  Them problem came when I noticed that the box had been opened already after the delivery guys were gone.  I didn't think much of it at the time and went ahead and plugged it in.  Immediately I could tell that something was wrong and opened one of the service doors to find that the mirror was shattered into 1,000 pieces.  After 1 hour on the phone with Amazon customer service (which is in India) they told me that the only solution was for them to contact their Hardline department to request pickup and a refund. There is no direct contact information for the Hardline department so you jut have to sit and wait for them to contact you. Then they send you a number for the shipper to schedule pickup, and they will process your refund after they drive your TV to Cincinnati. Every step of this process takes a few days and after they all pile up, you have to wait several weeks with no money and no TV.  After I received my refund, I drove straight to Fry's and bought the WD-57732 (next step up) for $250 less than what Amazon refunded me. Ultimately, if my TV had arrived perfect from Amazon there would have been no issue, but dealing with their Customer Service is an absolute crotch kick and should be avoided if at all possible.  Don't buy this through Amazon to save more than $500, because the headache you will have if something goes wrong isn't worth the money.P.S. The TV is amazing. It looks spectacular with my 1080i sources and I can't wait to get HD-DVD or Blu-Ray and see how great that 1080p looks.", "Date": "May 15, 2007"}, {"Title": "Bad Customer Service", "Author": "Donna Barrett", "ReviewID": "R3MJ3MMCEPV1XL", "Overall": "1.0", "Content": "If you live in Maine, don't buy this TV. You can't get anyone to come and repair it if you have a problem. I bought this TV 3 months ago and I noticed a spot on the screen. The service agreement say that if you have a problem with in 30 day they will send an authorized service tech to your home to fix it. I called and they gave me the number of two techs. One tech say that Mitsubishi doesn't pay him enough to come to my home to fix it, the other won't answer his phone. I am very disappointed. I have called Mitsubishi several times and I wait on the phone for 30 or 40 minutes. They try calling the techs and they get no response either. I am now waiting for a supervisor from Mitsubishi to call me back in 1 business day. 3 full months and nothing. I am at my wits end. I don't know what to do. Very bad service.", "Date": "May 11, 2007"}, {"Title": "Cable Card", "Author": "Oliver L. Johnson", "ReviewID": "R2RQH9A2JP3K7F", "Overall": "3.0", "Content": "This TV has a great picture, sound looks, you name it.  However there is one problem with the cable card.  I have had the cable company replace the cable card twice because it will not hold high difinition stations after several hours of use.  Afterwards, I contacted the company where I bought the TV and they decided to replace it.  Will see how the cable card works in the new one.", "Date": "September 24, 2006"}, {"Title": "Bought this when it first came out in 6/06 but lamp and tv both out", "Author": "H. Chang", "ReviewID": "R3S3O0WY41BYW8", "Overall": "2.0", "Content": "Really happy with everything...but not even one year and the lamp burned out and tv won't turn on.  It's on about less than 3 hours a day!Very disappointing, thank God I live in Los Angeles where there are services techs available...just hope it all works out!", "Date": "May 20, 2007"}, {"Title": "Phenomenal Television -- Unbelievable VALUE!!!", "Author": "K. Willing \"purplemoongirl\"", "ReviewID": "R1P7G870MIO0JO", "Overall": "5.0", "Content": "My family and I could not be more pleased with this incredibly beautiful product.  The design as a whole is simply stunning and the screen quality is excellent!  It was delivered just a few days after it was ordered.  We got a call to schedule the delivery once it was in town, and the delivery folks were careful and did a good job.  You have not enjoyed television programming in all its glory until you have watched the Discovery HD Channel.  Truly remarkable.  The colors are brilliant and the detail you can see in high-def will make you never want to watch an ordinary (or even smaller) television again.  This was well worth every penny and I would highly recommend it!  The only caution I will give is that the set up is not completely intuitive, so having a friend who knows the ins and outs of that would prove helpful.  Also, until you get the adjustments right, you might think the TV quality stinks -- there are some setting adjustments you will have to make before you can see this HDTV as it is meant to display.  So . . . having said that, if you take the plunge on this -- oh so worth it! -- make sure you have it properly hooked up and using the right settings.  If you don't like this TV once it's set up and working, you HAVE to have it set up WRONG.  :-)", "Date": "March 9, 2007"}, {"Title": "Stunning picture - Great price", "Author": "M. Moore", "ReviewID": "R1SD58PHL3NL10", "Overall": "5.0", "Content": "After doing a lot of searching, we settled on this tv and got a great price from Amazon with free shipping and no tax. I ordered it on a Friday and it was delivered the following Wednesday. I'm not an audio/visual pro and it took me about 30 minutes to get the cables hooked up the right way but after that I was done and our entire family coudn't stop staring at the picture or commenting on how crisp and beautiful it was. At 1080p, you can buy this now and know that no better technology is coming out anytime soon. I am planning on hooking up a surround sound system in the next week and will follow up on this review. For now, I could not be any happier with the picture quality, physical appearance of the television, or anything else. I haven't been this happy with a purchase in a long, long time.Update: a few weeks later, this tv is still incredible and I have zero regrets. HD programming is astonishing at 1080 and if you happen to like video games, this is the set. We have a playstation 3 hooked up to it and the quality is perfect. I've never seen so much clarity in games, at both 720 and 1080. Unreal.", "Date": "February 8, 2007"}, {"Title": "Great Picture, but....", "Author": "J. Sadleir", "ReviewID": "R698VCRG9RENP", "Overall": "3.0", "Content": "The set does deliver a great picture but to get the high definition from a cable box you have to use the HDMI or Componet inputs on the TV.  Thats all well and good but those connections on the TV don't pass closed captioning for those of us who are hard of hearing.  My wife isn't so happy with me having the volume up so loud.  No where was this mentioned in any of the Mitsubishi literature that I read before buying the set.If I had bought it from a local store instead of Amazon I would have taken it back.", "Date": "October 25, 2006"}, {"Title": "Happy with set and with Amazon purchase", "Author": "Matt in Charlotte \"Matt\"", "ReviewID": "ROFLPFKUTAJJ", "Overall": "4.0", "Content": "I was a bit nervous about ordering this bulky an item from Amazon, but everything went smoothly.  The set was delivered by a friendly guy who helped me put the set in my cabinet and do the basic hookups.Set works well.  Picture is bright and sharp.I saved at least $500.00 by ordering the set here.  I have no complaints with the set or the purchase experience", "Date": "November 1, 2006"}, {"Title": "Customer service nightmare!", "Author": "R. Heijden", "ReviewID": "RRP1I4QZVKXEM", "Overall": "1.0", "Content": "Buy this TV and you risk having to deal with the almost none existent customer service that Mitsubishi offers.We bought this TV and it broke, we called customer service but 3 months and dozens of calls later we still have a broken TV. They keep promising that a local repair tech will contact us to make an appointment. But nothing happens and when i call back they respond by saying that they will try to find a local repair tech?! Don't try to interrupt their preprogrammed routine or else these (barely English speaking) Asian representative's get confused and will likely drop your call while your on hold, only having to start the whole thing all over again! I'm writing this as I'm waiting for an estimated hold time of 85 minutes.This seemed like a good way to spend my time :)Ray", "Date": "February 14, 2007"}, {"Title": "Two Major Repairs In Less Than Two Years", "Author": "Ravenmaniac", "ReviewID": "R1R7R4KKNBYJF8", "Overall": "1.0", "Content": "I purchased the WD57731 from The Big Screen Store in August 2006.  In November 2007 the light engine died.  It took two weeks for the tech to come to the house to inform me that he couldn't fix it there.  Two weeks later, I get a call informing me that the parts were backordered.  The TV was not repaired until January 2008.Now, in September 2008, the TV won't even turn on.  I've tried the unplug overnight trick and the reset button trick.  I called for service three days ago, talked to a machine, no return call.  I called again today, Tuesday, talked to a machine.  Four hours later, still waiting for a return call.  I agree with the post suggesting a class action suit.  Is there a lemon law for TVs?  By the way, I also called Mitsubishi customer service.  I did speak to a person, but they were no help.  They said to call them after the service is delivered.  I guess my next stop is back to the Big Screen Store to discourage their customers.", "Date": "September 16, 2008"}, {"Title": "Loving our new television", "Author": "L. Arrieta", "ReviewID": "R21C3NCH6SXFXP", "Overall": "5.0", "Content": "We received this tv about a month ago and all I can say is Wow!  I love the color, especially the HD channels, they are so sharp.  We had shopped for a big screen for a few weeks and finally decided on the Mitsubishi 57\" DLP.  I am happy with our choice.  Especially since it was alot cheaper on Amazon than buying it at Best Buy or Circuit City, and with free shipping!  This is our first big screen TV, and have no regrets choosing the Mistsubishi - It's a great TV!", "Date": "June 11, 2007"}, {"Title": "BASEBALL IN HD, CANT WAIT FOR FOOTBALL SEASON!!", "Author": "RANDY L. \"RANDY\"", "ReviewID": "R52LQG59A9FE0", "Overall": "5.0", "Content": "This TV is awesome. Picture is unbelievable, don't even need to get eye  glasses now (saved on that). Paid $1,630, free delivery. It is a big TV, but then again, do you really want anything smaller? Got a nice 61\" Oak Stand at Bernie & Phlys for $400 (about what I saved from not buying this TV from Circuit City (they wanted $1999)) and it fits perfect.The 2 guys from Eagle were great, brought it in, unwrapped it, checked it out and took the trash (gave them $5 each, kind of a lot for a 2 second job, but I was so excited). Got a few channels that came in HD over my basic cable, but then my wife went down and got a special for 1 year with HBO/SHO/STAR for only about $9 more a month. Now get around 30 channels in HD? Haven't flipped through them all, wife steals the remote. Get this TV and have fun.", "Date": "June 6, 2007"}, {"Title": "Great HDTV", "Author": "Robert Bell", "ReviewID": "R30W5N8OJWQIRP", "Overall": "5.0", "Content": "For the Price, best value you can get. No problems, set-up easy. You won't regret buying this HDTV.", "Date": "May 24, 2007"}, {"Title": "Mitsubishi WD-57731 57\" 1080p DLP HDTV", "Author": "D. Johnson", "ReviewID": "R2Z5DKO0HK0QR", "Overall": "5.0", "Content": "Excellent product at excellent price. Delivery within 1 week and delivery service unpacked TV and took packing materials with them.", "Date": "May 19, 2007"}, {"Title": "Mitsubishi WD-57731", "Author": "M. Candiello \"electronics buff\"", "ReviewID": "R1QQ4SUZWWH0UR", "Overall": "5.0", "Content": "After watching this TV for over a month now, I couldn't be more pleased. The 1080p DLP HD really makes a difference. I already own a rear projection Mitsubishi with 1080i CRT and it's no fun watching that format anymore. What a beautiful picture with the DLP!  The colors are brilliant, and you feel like you could step right into the picture. It is also great to know that you don't have to worry about burn-in in this format.  Amazon also made this purchase as easy and worry-free as it could possibly be. Another hint: By reading a previous review, I got a great tip on doubling the manufacturer's warranty by purchasing with my  VISA card through VISA's enhanced services program.", "Date": "April 14, 2007"}, {"Title": "Hugh Def TV", "Author": "R. Huggins", "ReviewID": "RNUREEJ1GL4S1", "Overall": "5.0", "Content": "I'm quite pleased with the quality of the picture on this wide screen high Def TV.  I would recommend this product to anyone interested in a high def wide screen TV.  This is my second Mitsubishi TV (the first one is a rear projection set that is around 10 years old and still works, but does not offer the high definition that I wanted).", "Date": "January 9, 2007"}, {"Title": "Great customer service Great TV", "Author": "Jerald A. Nyman Sr.", "ReviewID": "R269H2DWNE6IVW", "Overall": "5.0", "Content": "Ordered my set after comparing many brands, and then going to the local Circuit City where both sets wich made the final cut were on sale. Did a comparison of both and determined that the Misubishi was the best even though it was a bit higher.Amazon shipped first business day after order, was in Detroit area 4 days later and I picked up so I could set it up and use in less than 1 week. The only problem with unit is its built in sound. If you have sound system use it for proper sound. I am totally satisfied after 2 days with my purchase.Jerald Nyman10-27-06UPDATE: I have owned this TV for three weeks now and am enjoying the pleasure it brings too my living room. If this model is on your list find dealer who has this unit and others you may like so you can compare before purchasing.Jerald Nyman11-17-06", "Date": "October 28, 2006"}, {"Title": "Close but no cigar.", "Author": "Lewis Camacho \"Lewie\"", "ReviewID": "R1A1AQK5G7WDJM", "Overall": "2.0", "Content": "I bought this at best buy cause it was a great deal. $2080. With one year to pay it off. It had great connectivity: 2 hdmi, 1 dvi, 2 firewire, 2 component, 3 s-video/composite. But when it came down to it this baby could NOT candle motion. It would break up and look TERRIBLE and that was the Hi-Def! The standard def left motion trails and that was from a progressive scan dvd! Great on paper but doesn't deliver the goods. I returned (b.s.-ed that it was broke to avoid a \"restocking fee\") and got me the 61 inch samsung hl-s6187. Now that's a frickin performer. Not as much in the way of connectivity but the picture is amazing (as good as CRT but way smaller package). So buyer beware on this one. Oh and the contrast ratio on this Mits is atrocious! Something like 545:1 !!!!!!The samsung does 10000:1 !!!!", "Date": "November 24, 2006"}, {"Title": "Run Fast, Run Hard (AWAY!)", "Author": "Barry J. Craig", "ReviewID": "R1LGXJRMH7E6ZM", "Overall": "1.0", "Content": "10 months worked fine. If you want to shell out big bucks for that amount of time, please buy. We are on our fourth lamp. Mitsubishi sent a local rep to assist...said he couldn't fix the tv. Still under the first year warranty and constantly put off by customer service. This is now 13 months and still a no-fix situation. Told we will be contacted in another week. This is totally unsat. I personally will stay away from any DLP tv in the future.", "Date": "July 19, 2008"}, {"Title": "Support is non-existent", "Author": "Debra T.", "ReviewID": "R1LX9KBKOVKEK2", "Overall": "1.0", "Content": "I have had the TV exactly one year, seocnd lamp has burned out. Ihave faxed my documentation to the Tech Support Group twice, the first time they threw is away, some excuse about not seeing my address which was on the cover letter. Just faxed it a second time they were to call as soon as it was recieved, did not happen. The tech support person said that they know there are design problems and that the lamp overheats, they claim they will continue to replace the lamps for no cost. Getting them to send on is a hassle, being out the use of the TV for a week every few months is inevitable. Mitsubishi should replace these TV's.", "Date": "April 17, 2008"}, {"Title": "The TV's great, Amazon not so much.", "Author": "W. Wheeler", "ReviewID": "R2C6YYZMBC0EAC", "Overall": "5.0", "Content": "I finally got the TV, just not from Amazon. The TV is everything you'd want: great picture, good features, easy setup. The sound is just OK, but you'll want a surroud sound set up anyway.Amazon on the other hand, had some issues. The TV arrived damaged in shipment. No problem,not their fault. Their answer: we'll refund your money in two weeks. But I want a TV!?! Sorry, we don't have that TV at that price anymore. You're welcome to buy it from one of \"our other vendors\" for $200 more, but we can't help you.So I bought it a brick and mortar store that delivered in one piece. I guess the savings was an illusion anyway. (But the TV is great)", "Date": "June 26, 2007"}, {"Title": "Amazing Picture, amazing TV", "Author": "M. Smith \"Smits\"", "ReviewID": "R177037MM6OTQH", "Overall": "5.0", "Content": "As of now, I couldn't be happier.  I'm using an Oppo 981 DVD player which for standard definition DVD, you can't get any better.  My old one fizzled out so I got this one and on my Mitusubishi: Amazing.  I've got my Xbox 360 plugged into it and when my girlfriend asked WHY I had to have such a \"nice\" TV, the xbox came on and she said, \"Oh.... I see why now\".  I still haven't upgraded to Digital Satelite yet but from what I've seen, this TV is top notch and i couldn't be happier!  Highly Recommended!!!", "Date": "May 6, 2007"}, {"Title": "Mitsubishi WD-57731 57\" 1080p DLP HDTV", "Author": "Julie Aldrich", "ReviewID": "R2DUSZP8KURU1L", "Overall": "5.0", "Content": "I was very skeptical to buy such an expensive and large item off line. I was affraid of it being damaged during shippment. However, to my surprise, it arrived safely and it great working order! I love it!! The picture, and quality, are outstanding and the service was GREAT!! Thanks!", "Date": "March 16, 2007"}, {"Title": "Amazing Picture", "Author": "Jessica M. Smith", "ReviewID": "R3RNYUN324TUPS", "Overall": "5.0", "Content": "Great TV, I've had it for about a month now, and couldn't be happier, the picture quality is amazing, especially with the HD signal.. well worth the money for the TV.", "Date": "February 19, 2007"}, {"Title": "Incredible Value and Great Picture", "Author": "Special K \"specialK\"", "ReviewID": "R3C6PDH39F6VCU", "Overall": "5.0", "Content": "We were orginally going to buy a front projector to use as a TV/Movie viewer. We don't watch a lot of TV or movies but when we do, we want it to look great. After researching LCDs, Plasmas, Front Projectors, ect.. we saw this rear projector in a Fry's store and were sold. The picture was great.Now it's in our home and HD is incredible on this baby! Regular TV is ok, but usually has to be set to the \"stretch\" format to look decent. We just signed up for HD service from our DirecTV satallite company.DVDs look incredible! and so far I've only played 720p DVD's since I don't own a 1080p DVD But the processor in this TV allows for up to 1080p (p for progressive as opposed to interlaced).I heartily recommend this television set.PS. get the warrenty (3yr) because the first bulb ($200-$400) is covered and will surely be used up before the warrently runs out and the cost of the warrenty is less than a bulb.", "Date": "January 24, 2007"}, {"Title": "Excellent product- best purchase overall", "Author": "Candice Marquette \"lost in pages\"", "ReviewID": "RSTSLSP8P3EX9", "Overall": "5.0", "Content": "We love this TV. Even the delivery was awesome. Great picture, sound, size etc. Not too big, just right.  It has performed wonderfully and we couldn't be happier. Setup was a breeze. I would highly recomend this televison and I spent months researching all the products out there before settling on this one.For the money, I don't think it can be beat.", "Date": "January 3, 2007"}, {"Title": "Great picture, poor design details", "Author": "J. Battan", "ReviewID": "R3C62BYASOQ89V", "Overall": "3.0", "Content": "I love this TV's picture quality when it has a nice hi-def source.  Simply awesome picture when viewing my local PBS station using my cable's non-HD signal.  Amazing difference when viewing a stations SD source vs its HD source.  Picture with an external antennae isn't bad.  Sound is good.  Price is really cheap compared to the competition.However, it has a number of problems that lead me to not recommend it.  First, it has two very loud fans that are quite noticeable and annoying during quieter moments in a broadcast/movie.  (No, after a month I haven't gotten used to it.)  The remote is okay, but there's an amazing delay between button push and the TV doing something, sometimes as long as five seconds.  The TV is really slow (4-5 seconds) to change channels.  The Favorite Channel feature doesn't seem to work.  Sometimes it says a source is SD when it's actually HD; if I then press Info, it'll then change the notation.  If a signal isn't present when the TV starts, it puts a message on screen saying it'll shut down in a minute; when a signal becomes present, the message stays on screen for up to a minute longer.  It doesn't always recognize my hi-def camcorder when plugged into the Firewire port; when it stops recognizing it, I have to unplug the cable, power cycle the TV, and try again.  Sometimes there's an obvious delay between the sound and the picture when viewing DVDs (this could be a problem with my cabling).If I had purchased it from a store like Fry's that has a 30 day guarantee, I would have taken it back.I recommend you check out the Sony LCOS systems; that was my second choice.", "Date": "October 15, 2006"}, {"Title": "Not happy", "Author": "rrbcpratt \"rrbcpratt\"", "ReviewID": "R3OKP6934G19ZX", "Overall": "1.0", "Content": "I purchased my TV less than 1 year ago. Tech service is now ordering the second lamp. SO at this point we are watching our old 37 inch that we have had for many years. Love the TV when it is working.", "Date": "June 22, 2007"}, {"Title": "Excellent Picture", "Author": "John C. Wood \"JC\"", "ReviewID": "RMVIMBOILWG86", "Overall": "5.0", "Content": "I investigated TV's (Plasma vs LCD vs DLP),extensively before upgrading to HDTV. It paid off, because I couldn't be more happy. I'm still using a POS cable company, with the usual poor signal and no HD, but am getting an HD satillite next week. But even with the poor signal, the color is intense and the picture fantanstic. The \"free shipping\" though falls under the catagory of \"You get what you pay for\". It took a week to get it delivered, (two day lay over in Sacramento and a three day layover in Portland), and I had to hand truck the TV and the stand the 400 feet from the neighboring intersection.", "Date": "October 4, 2006"}, {"Title": "Great experience with this TV", "Author": "Patrick McAuliffe", "ReviewID": "R1I0NOWZ9ZAOPJ", "Overall": "4.0", "Content": "I bought this TV from COMPUSA (wow, that place was a disaster) back in the fall of 2006.  I watch a lot of TV and this set has worked fabulously.  It still connects with all the modern day electronics thanks to the HDMI and the picture is still fantastic.  I never researched the TV after I bought it and was suprised to see all the complaints.  I am only now on here because the lamp finally gave out, after over 6 years.  I think that's pretty good and consider myself lucky.  The TV is kept in our basement/media room where is stays pretty cool year-round and there is plenty of open space around it so mabye that helped from the over heating issues some people have mentioned.  I will get another lamp and hopefully will get the same or similar life out of that one.  If not, I'll definitely update this post.", "Date": "January 30, 2013"}, {"Title": "Stay Away at all costs !", "Author": "samuel meola \"Sam\"", "ReviewID": "R9WXNISS58YLC", "Overall": "1.0", "Content": "I have owned this TV for about three years now. What an absolute disaster...I am on my fifth lamp with what I call normal use.The tv keeps getting hot and shutting down.My newest lamp worked for 7 days and then quit.No wonder these DLP televisions did not last long.", "Date": "September 26, 2011"}, {"Title": "Must be Lucky", "Author": "Bruce Vayne", "ReviewID": "RUQW5A5C16U3Q", "Overall": "3.0", "Content": "This TV is great. I must be lucky as I have had it 4 1/2 years and have not needed to replace a bulb yet, I do leave it on as much as possible as I read in the manual that it is better to be on continuously over a period of time rather then on and off multiple times in the same time frame.  Don't know if that is the reason or not.  I bought a replacement lamp a year after owning it just in case and still have not needed it of course now I'm getting closer to the 5 year mark which is what they advertise them lasting.Update 12/10/12DLP chip is failing unfortunately.  I guess my luck has run its course as far as this TV is concerned.......Luck off", "Date": "August 27, 2011"}, {"Title": "Do Not Buy This TV", "Author": "Jay Gilbert", "ReviewID": "RB973MUYREJR4", "Overall": "1.0", "Content": "Had this tv since 2006 and have been through 6 lamps in 5 years and Mitsubishi will not support this problem. They state a bulb is only warranted for 90 days. There customer support is horrible. They are like talking to a robot. I am currently looking for a replacement. Waste of money.", "Date": "August 10, 2011"}, {"Title": "Simple Amazing Picture Right Out of the Box!!", "Author": "imezb \"Bryan\"", "ReviewID": "R36XEPR8JW23AM", "Overall": "5.0", "Content": "I was thoroughly impressed with this TV's picture right out of the box. Crystal clear and truly a joy to watch.The bulb went out after 1 1/2 to 2 years and the bulbs are expensive, so that is the only downside I've seen.", "Date": "January 19, 2011"}, {"Title": "Do NOT BUY this TV", "Author": "mrclean", "ReviewID": "RZUWO6TQ2XTHD", "Overall": "1.0", "Content": "I have had this TV for 3 years. I've gone through 3 lamps @ $210, $190, 165 and now I need two more this year at $130. The picture is great but there are other TVs that wont cost you thousands in lamps. I am very disappointed in my choice.", "Date": "September 11, 2010"}, {"Title": "Don't buy this TV", "Author": "Andrew S. Baxter \"Andy B\"", "ReviewID": "RLKPEOJML1N79", "Overall": "2.0", "Content": "I have had this TV for little over 2 years and have had to call for service 4 times.  I've gone through 2 lamps a heat sensor and a color wheel.  Don't get me wrong, when it works it has one of the best pictures you can find.  I just don't like not having a TV for 2 weeks each time something happens.  It also does this thing once in a while where it will not start the picture and then you have to wait for 5 mins or so and then \"try\" again.  I'll never buy Mits product ever again.  I paid a lot of money for this to break down.  I should have bought a Samsung or an LCD.", "Date": "November 13, 2008"}, {"Title": "Too much to replace lamps!!!!", "Author": "Shannon Wells \"babymattsmommy\"", "ReviewID": "R9ORSBJ9PLC7R", "Overall": "1.0", "Content": "We have had this TV since Feb. 2007 and are on our second lamp.  That's $500 dollars per year.  I'm glad I have the no interest payments, but it probably would have been better to buy a more expensive plasma or LCD then this piece of garbage.  Oh, it's the second one we had too.  The first one was taken back and exchanged for one that would work.", "Date": "May 3, 2008"}, {"Title": "Love it", "Author": "Bargain Shopper", "ReviewID": "R2HWAO8KN3FM9R", "Overall": "4.0", "Content": "First Tv  arrived broke, could of happened from any retailer. Was replaced with no hassle it was appreciated kinda worried about an online purchase like this but after its said and done no complaintsTv is touchy though likes to find reasons to shut off but give it a minute it usually turns right back on. had it almost a year now never repaired it and i think its only picky in hot humid conditions so you have to spoil it with a cool room in the summer. Blu ray is breath taking on it got to love 1080p", "Date": "March 18, 2008"}, {"Title": "disapointed", "Author": "A. Holtz", "ReviewID": "R3O23330PRQMAL", "Overall": "3.0", "Content": "I bought this tv from best buy feb/16/2007 right out the box no display model. i was blown away with the quality, great picture hd is awsome on this set, and the price was right. 6 months after having it, it beging to over heat alot cutting off automatically. now not even a year old the lamp blew. never had the problems with the noise like i seen in other reviews. i am really really disapointed about havimng to replace the lamp so early. i just hope it was a fluke the lamp went so soon. buyer beware.", "Date": "January 25, 2008"}, {"Title": "Having problems with my Mitsubishin WD-57731", "Author": "H. M. Hoshino", "ReviewID": "R2YUNG2KZHR4EZ", "Overall": "3.0", "Content": "I bought the Mitsubishi WD-57731 from Amazon and at first I really loved it. But after the Manufacturer's warranty ran out. I had problems with my Lamp Driver. The WD-57731 wouldn't even turn on. I had to send it in for repair on 08/07/07, which cost me over $600 dollars. That isn't the first problem, because now I have a problem with the Lamp which needs replacing. And that happened yesterday 01/13/07, a fine way to start out the New Year.I sure hope this will be the last of my problems, because when it is working it is a really great tv but for how long???Get the factory warranty, you will need it.", "Date": "January 14, 2008"}, {"Title": "Look out for clock issues, Great picture! Poor Tech Support!", "Author": "Patrick T. Mcnamara", "ReviewID": "R1Y7LVO07K9X82", "Overall": "3.0", "Content": "I love the picture quality and functionality of this TV.  I have owned it for 9 months.  I noticed the clock wouldn't keep accurate time, nor would the auto clock set work or daylight savings auto adjust.  Called Mitsubishi and their reply was that the clock is not meant to be accurate?  They will not even try to fix the problem (within factory spec.).  Menus, auto-tune  and timer rely on accurate time. Clock looses 2 1/2 minutes a month.  They told me to set the clock ahead a couple minutes to compensate?  WOW!!!!!  Best Buy Disagrees!!!  They were told the same.  They are now going to exchange the TV for a different one.", "Date": "January 10, 2008"}, {"Title": "great picture", "Author": "Lawrence H. Bowen", "ReviewID": "R2EUERXAP4MHWK", "Overall": "5.0", "Content": "This tv is awesome.  The hd shows scream out of the set.  It is better than being there.  Vann's was great and quick.  It arrived before I had time to make room for it.", "Date": "September 13, 2007"}, {"Title": "Awsome Picture", "Author": "F. Cortez", "ReviewID": "R1ZA3AUS6IN64Z", "Overall": "5.0", "Content": "First time ordering such a large item through amazon or the internet.  The experience was great.  Tracking information was provided quickly and the Mitsubishi arrived on time and in perfect condition.  At the time of ordering I was saving $400 to $600 from the local major retailors.Now for the HDTV, again first time purchasing large screen HDTV.  I did a lot of reasearch and since space was not a problem for me, the rear projection was the best choice for the money.I can now say after having this set over 7 months, it is AWSOME!  The picture quality both on HD and regular is fantastic.  Sports viewing in HD is absolutely the best!  Everyone that has seen the HDTV is just amazed at the quality of the picture.Highly recommend both the set and the vendor.", "Date": "September 6, 2007"}, {"Title": "great buy", "Author": "PB", "ReviewID": "R16RBLU7OWWA39", "Overall": "4.0", "Content": "This tv is great, had to wait for our HD Dish to be set-up but you deffinately could not find a better HD TV for the price i'd reccomend it to anyone", "Date": "June 30, 2007"}, {"Title": "Excellent Picture, Price Point", "Author": "J. Olarte", "ReviewID": "RVE4H5CKVT8K0", "Overall": "5.0", "Content": "I bought from Amazon on Dec 06 and everything went smoothly, quick confirmation and fast delivery Great picture out of the box. Cox HD is unbelievable, SD is OK. DLP is the best bang for the buck. I'm totally happy with my purchase and experience with Amazon.. NCAA BB Finals tonight on HDTV. This is what I bought it for!!!", "Date": "April 2, 2007"}, {"Title": "DO NOT BUY ONLINE", "Author": "J. Breedlove", "ReviewID": "R348WNZF56D8LX", "Overall": "1.0", "Content": "Let's start off by first saying that this is a really good t.v. i was worried to buy online and then it turns out that my worries were right.  it came to my house with a busted mirror.  and thats AFTER they said that it was going to take an extra week to get to my house. now i have to wait for a refund, but not until amazon receives my t.v. back.  so i probably have to wait another month before i can actually use that money to go buy the t.v. from best buy. if you get the shipping service from EAGLE GL, BEWARE!  they have the worst customer service and phone etiquette.  DO NOT BUY ONLINE.  it isnt worth it.  take your money to a retailer in your area and buy it there.", "Date": "April 17, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Technologically advanced high-definition 57-inch 1080p DLP TV with two built-in HD tuners; measures 51.5 x 36.3 x 18 inches (WxHxD)\nDigital cable ready with CableCARD slot; QAM tuner compatible with unscrambled HDTV cable reception\n1920 x 1080-pixel resolution; 150-watt TurboLight lamp system focuses light more efficiently\nConnections: Composite (3 in, 1 out), S-Video (3 in), Component (2 in), HDMI (2 in), RF (2 in), Firewire (2 in), PC DVI (1 in)\nTwo stereo speakers, 10 watts apiece (20 watts total); coaxial digital audio output", "Name": "Mitsubishi WD-57731 57-Inch 1080p DLP HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41CQ63874AL._SX300_.jpg", "ProductID": "B000FVCOGC"}}