{"Reviews": [{"Title": "Awesome TV", "Author": "mrfatpockets", "ReviewID": "R7OILQJ43BEK1", "Overall": "5.0", "Content": "Just picked it up this weekend and let me tell you i have no regrets. Right now i have my Xbox 360 and PC hooked up to it. 1080p res on my computer is un-freaking-believable, and 1080i on the 360 is the best. For the people that complain about grainy a picture... Of course if you have standard definition hooked up the picture is going to be grainy because that type of signal wasn't meant to have that many lines of resolution(every HDTV is like that).  For example, take an already low res picture on your computer (jpeg) and increase its size 3x and convert it into a bmp... but why would you buy an HDTV if that's what your hooking up to it? $2000 to watch regular tv, why not just upgrade?", "Date": "November 13, 2006"}, {"Title": "GREAT HDTV - standard def, not so great", "Author": "L. Singleton \"Avid_Reader, Technology Nerd\"", "ReviewID": "R1GK0XQLXI5449", "Overall": "4.0", "Content": "Have had this TV for 3 days now, so this is a very early diagnosis.  The HDTV signal from my Dish Network HDTV feed is absolutely STUNNING on this TV.  No Ghosting, edges are razor sharp, colors are bright and perfect.  Watching the NFL on HDTV is one of the joys of life.This TV is really well-equipped.  From the power swivel base (my kids love that feature) to the automatic formatting of different channel signals to the split-screen PIP, this TV has a lot going for it.Minor complaints:  1)  the standard def channels look fuzzy and ghosty.  None of the available adjustments really make it much better.  Cartoons seem to do fine, but regular shows are not so pretty.  2)  the DVI input assumes (incorrectly in my case) that you are using that input to connect a computer, thus none of the \"TV adjustments\" are available for that input.  That's not a problem if you are using HDMI from your cable or satellite box (which I will be doing as of tomorrow 12-6-2006) but if you have an older HDTV receiver like I do which only has a DVI output port and not an HDMI port, you are stuck with minimal adjustment capability.  That's why I think the standard def channels look so bad right now - after I get the TV signal coming in via the HDMI port I will have more adjustment options and I think I can make the picture get much better.I bought at Fry's electronics for $1989 and got a 5-yr in-house repair and replacement warranty for $259, so I think I got a pretty good deal on the set.Bottom Line:  If you have a lot of HD content to watch, this is a great 37\" 1080p set to choose.  It equips you for HD DVD and Blu-Ray DVD players and sets you up for the future.", "Date": "December 5, 2006"}, {"Title": "Two minor complaints", "Author": "Paul R. Wohlgemuth", "ReviewID": "R1C93W5GR7OII8", "Overall": "4.0", "Content": "The overall quality is excellant but I have two complaints. When one changes channels the display indicating which channel is now playing is very small and difficult to read. The actual time for the channels to change seems a bit sluggish also.", "Date": "January 3, 2007"}, {"Title": "Mitsubishi LT-37131 37\" 1080p LCD HDTV", "Author": "davron", "ReviewID": "R1QEO2DOIA1JTR", "Overall": "5.0", "Content": "I've always have purchased Mitsubishi products; VCR, TV's,etc and have NEVER been let down. My very first big screen 40\" TV when they first came out with them and when it cam time to haveit serviced they even reimbursed me all my money back because the service dealer couldn't repair it like they said the could.This was the TV I was looking for and for the price they [Amazon] had it was good.The price has come down on this TV @ Circuit City but by the time they add in the sales tax it would be the same.Everybody was ever came over to my house and seen the picture have marveled at it.The swivel base was a bonus but overall I would reccommend this TV to everybody for this size 37\".LCD TV's last 3x longer than plasmas, weigh less than plasmas and uses less energy than plasmas etc.Ron", "Date": "January 3, 2007"}, {"Title": "Awsome Quality", "Author": "Jae Kang \"Kayak Fisherman\"", "ReviewID": "R3DXGYFZM6TMP2", "Overall": "5.0", "Content": "Received my LCD TV a week ago from Amazon.  First, I tested the LCD TV via my Panasonic DVD player via HDMI connection.  The screen quality was as expected with any HD LCD, but I was impressed with brightness of the screen.My next test was through my PC via DVI cable.  I was very impressed with the sharpness and the quality... it seemed as good as any monitor that I have seen...just much much bigger.  I was very pleased since one of the main reason that I wanted to purchase 1080p screen was that I wanted to use it as both HD TV and computer monitor.  This LCD now sits on top of my computer desk.The next day I got my cablecard installed from Cox.  The cablecard seemed little slower than my digitial cable box in surfing difference channels.  Also, another downside was that you don't get the digital TV guide.  But, I am very happy with the fact that I am only paying $2/month for the cablecard instead of $10/month and did not have to located any big cable box next to the TV.  Of course, the HD picture quality was simply beautiful.One of these days, I will test out the full 1080 with blu-ray DVD players.Oh... the motorized swivel base comes pretty hand...", "Date": "December 26, 2006"}, {"Title": "very satisfied", "Author": "David Hughes", "ReviewID": "R21B0AF7HPIWNO", "Overall": "5.0", "Content": "This is my first High Definition televisoin purchase so I'm not an expert but the picture is great, it has PIP and 2 HDMI.", "Date": "January 3, 2007"}, {"Title": "Very, very good...but not excellent", "Author": "Scott \"Scott\"", "ReviewID": "R43QKPR8R9G7K", "Overall": "4.0", "Content": "I did a lot of shopping around for this size (37\").  Basically, I needed a 37\" and I also wanted to have full 1080p, which narrows the field down to three models (this one, the Sharp Aquos, and a Westinghouse model).  After reading a lot of reviews and forums, I went with this one.  Overall, I am very happy.  It is a great TV, with a great picture, and you won't be disappointed with it.  However, there are a few minor issues to point out...First of all, it is pretty expensive compared to comparable models or even larger plasmas.  But I bit the bullet, because I was limited in the size my cabinet would hold and I wanted 1080p (for the PS3/Blu-ray). Also...1) it doesn't have great black levels...it does alright and is not that noticible when watching TV (even HD), but became more pronounced when watching DVDs, and especially Blu-rays.  Again, it isn't \"unwatchable\", but you will notice deep blacks as gray and slightly pixelated2) some non-HD TV channels are fine, but others are poor quality (blurry, etc)...this may just be an HD-TV issue in general, and not neccessarily an issue with this particular model.  Some non-HD channels are fine.  Generally speaking, the HD channels are great.3) it does not have optical digital audio output...this may not be a big deal to some, but it was to me (and quite shocking too, that a new TV of this quality would not even have the option of optical digital audio).  It has a digital audio output, but it is coaxial only (the RCA style coaxial, not the scew on type).  The issues for me were that, first of all, optical audio is better quality.  And secondly, the only digital audio input on my my Sony surround-sound receiver is optical.  I was able to find a convertor online (for about $20) that converts the digital coaxial to optical and make it work, but I'm probably losing a little audio quality in the process.I just wanted to point those items out, but they shouldn't dissuade you from getting this model.  It is a great TV.  About a month, after I purchased mine Consumer Reports rated it less than favorable (something like 14th out of 16 in its size).  But again, it was the only 37\" model with 1080p that they tested (the new Sharp Aquos hadn't been released yet when they wrote the review).  So in my case, I really didn;t have much of a choice.", "Date": "April 23, 2007"}, {"Title": "No issues, simple set-up", "Author": "Ski", "ReviewID": "R2CZVX8SY2MPCR", "Overall": "5.0", "Content": "I've had this TV for about 7 months, and it's been flawless. I looked at TV's for 2 years before going with this one, and I heard all the set-up issues. This TV was perfect right out of the box until I decided that I just HAD to change something because it couldn't be that simple. I ended up resetting to defaults.The only \"issue\" would be that sitting close watching standard def is lousy, but I have yet to see an HD set that doesn't make SD look bad. There's no problem if you sit back 6'+ feet.___________________Edit: Well, two years later and there's burn in on the right side where the picture from a SD signal stops. It just happened and it's very obvious while watching DVD and HD programming. Very disappointing.", "Date": "July 13, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Technologically advanced 37-inch 1080p LCD HDTV; measures 36 x 26.8 x 13.3 (inches) with stand\nDigital cable ready with CableCARD slot; QAM tuner compatible with unscrambled HDTV cable reception\n1920 x 1080-pixel resolution; 4D Video Noise Reduction system provides a cleaner, clearer picture\nConnections: Composite (3 in, 1 out), S-Video (3 in), Component (2 in), HDMI (2 in), RF (2 in), Firewire (2 in), PC DVI (1 in)\nTwo stereo speakers, 10 watts apiece (20 watts total); coaxial digital audio output", "Name": "Mitsubishi LT-37131 37-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41BWXG8K92L._SX300_.jpg", "ProductID": "B000FVELPY"}}