{"Reviews": [{"Title": "Excellent piece of equipment", "Author": null, "ReviewID": "R2RQCH7XBBWG9U", "Overall": "5.0", "Content": "I've recently purchased this rear projection television and I'm very impressed to say the least. I've owned a Samsung 40 rear projection prior to this, which was also a very good TV, but nothing compared to this JVC bad boy. Some nice features include a DVI jack for future (some present) digital connections, a center channel input (although I've tried it and the sound is less than acceptable, perhaps its my receiver), numerous multiscreen displays including dual tuning for split screen, and most importantly exceptional picture quality. I believe it's the internal line doubler that creates such sharp pictures, or so they say. The clarity is really astounding for a projection TV, and what's more, the clarity is not limited to HDTV broadcasts, but the picture on regular cable is amazing as well. Let's face it, most of us do not spend most of our TV viewing time having access to HDTV broadcasts and receivers. Albeit a fortunate handful, but for the rest of us this television has excellent picture quality across the board. I highly suggest watching the Monsters Inc. dvd with a player using component connections. The clarity is breathtaking, many picutres truly appear to be 3 dimensional. But instead of relying solely on reviews, go out to your local electronics store, and take a look for yourself at this television against other manufacturers. And don't listen to large chain store electronics sales employees, they don't know what they're talking about. Happy shopping!", "Date": "December 3, 2002"}, {"Title": "JVC AV-48WP30", "Author": "Ronald Gmiterek", "ReviewID": "R74YGVBD2F7QO", "Overall": "4.0", "Content": "Just got it on Saturday July 13, 2002.The picture is amazing. The only downfall is, to have that amazing picture, you have to watch DVD's. I have BEV as a satellite supplier. Most of the channels are clear, except for some, it seems the picture is too big for the channel.Now, I've upgrade from a 10 year old JVC 27\" (Best TV I've ever had). The picture just looks huge, I'm sitting approx. 11 feet away. The ideal viewing distance is suppose to be 9.5 feet.It's just so huge. Now, that may just be because I upgraded from a lot smaller to a lot bigger TV.I've watched approx. 10 movies on it, and WOW, I would never be able to watch them on anything else (unless it's bigger).Other little tidbits, is that when the movie is in letterbox (2.35:1), you still have the black lines on the top and the bottom. You can zoom in even more, but then you lose some of the picture. (my wife is very disapointed with this).To use the full screen when you are watching a 4:3 tv show or movie, the picture seems a little bit stretched, just takes a little of getting use too.If you are watching the TV from angles greater than 30 to 40 degrees, you really can't see very much.Besides what I've mentioned, it is a great TV for a great price, and a big plus, you can use the speakers for the Center channel of your receiver.I've also played my PS2 and XBox on it, it just blows your mind how detailed the games are now.I'm also having a technician coming in to make all the fine tuning on the TV (I don't want to lose the warranty, if I do it myself). So I will let you know if it makes it even better.I would give this TV a four and a half star, it lost its half a star because of the things I've mentioned above. And that is an assesment based on three days of having it. Give me a year, and I'll let you know if it has improved.", "Date": "July 15, 2002"}, {"Title": "Worth Every Penny", "Author": "William Carroll \"InjuryExpert\"", "ReviewID": "R2EL5Z0CWMDS89", "Overall": "5.0", "Content": "...For me, this TV is everything I want and more. Great picture? Check. Spend a little time learning how to calibrate it or buy the excellent AVIA disc from Amazon. Great sound? Check. It would sound better connected to surround sound, but it does a pretty good job in my living room? Easy connections? Check. About a million of them, including component video, connections in front for video camera or games, and the (boo hiss) DVI - the latest copy protection [stuff]. But if there is copy protection [stuff] coming, you'd better have it. The TV looks great in any room - not cheap particle board like many. Good remote. Easy to set up. I have nothing bad to say about the JVC ... so if this is what you're looking for, easy and good, you've found it.", "Date": "June 9, 2002"}, {"Title": "Excellent TV for being an 'early' HD model.", "Author": "Ed Hurtley \"geek\"", "ReviewID": "R2FZ3FRH0W8OZB", "Overall": "3.0", "Content": "I just bought one of these used.  It is my first HDTV (not counting watching HD TV through my computer.)As these reviews are almost all from when the TV was new, I figured I would write a review from the current perspective.First, the downsides:It only handles 1080i, not 1080p.  Plenty for everything I've thrown at it; but those who have Blu-ray may want a 'real' 1080p TV.It has two 1080i-compatible component connections, and one DVI.  No HDMI; although the DVI port works just fine connected to my HDMI-output HD DVD player via an HDMI to DVI cable.It has dual (now obsolete) NTSC tuners, but no digital ATSC tuner.  Therefore, the tuner is essentially useless.The picture-in-picture can handle two HD inputs, but it can be a little flaky.It is a rear-projection TV, which means that it has a rather limited viewing angle.  The picture looks great as long as your eyes are level with the top of the screen or lower, but playing Wii games that require standing up on it are difficult, because the picture dims very quickly when viewed from above.  Likewise, the sideways viewing angle is about 90° to be at full brightness.  It drops off quickly thereafter.Now, the upsides:Finding one used can be cheap.  Potentially significantly cheaper than a new HDTV.The CRT-based projection system means that it doesn't have a high-power light bulb to burn out.  The one I bought is now six years old; and the picture is very bright. (when viewed from proper angles.)In spite of the admonitions that the DVI port isn't computer-compatible, it works perfectly with my MacBook Pro.  It supports 720p, or 1080i; with excellent picture reproduction.But, the DVI port does not have sound, so even through an HDMI adapter, you still have to use analog stereo audio (or use a receiver.)The picture looks wonderful, wether from an ATSC tuner (in a VCR/DVD Recorder, connected via component,) HD DVD, computer, or Wii.The sound, while only stereo with faked surround, is good.  I have found no need to re-connect my receiver.  Good volume, good tone, and enough bass.", "Date": "August 8, 2009"}, {"Title": "Keeps on ticking...", "Author": "Irishlady", "ReviewID": "R1TR7RUYR47WLZ", "Overall": "5.0", "Content": "I've had this TV for more than 2 years and it still works as well as it did on Day One. I found a stand for it at Target so it sits about 18\" off the ground now, and it is like being in a movie theater. I've been very pleased with this TV and would recommend it if it were still on the market.***I wrote the above review In 2007. It's now late 2008 and I'm still happy with this TV. I figure I'll keep it until the day it dies--and hopefully by that time there will be cheap flat-screen TVs with some great technology for me to move up to.***I took the plunge in July of 2009 and bought a new 50\" plasma. I gave this TV to a neighbor in exchange for some work in our house, and he loves it. It's still working fine for him. (April 2010)", "Date": "December 18, 2007"}, {"Title": "A beautiful machine..........", "Author": "MrsCDWhite", "ReviewID": "RUJD8UIUWTRG1", "Overall": "5.0", "Content": "A beautiful machine, we spent days doing our research and decided on this model. The size is perfect, the picture is outstanding. The only drawback is the gaurd does give off some glare. We stood back and watched the customers go by it, to see what the reaction to this model would be, they stopped everytime to watch this model in action!Watching DVD's is a whole new experience and an exciting one!", "Date": "August 3, 2003"}, {"Title": "Nice tv but.........", "Author": "M. Beason", "ReviewID": "R3SSJF9HLQ787G", "Overall": "3.0", "Content": "I have one of these televisions and after two years a convergence thingie went out on it.  Looked like you were seeing everything in double-vision.  Luckily I had an extended warranty on it as it would have cost 600.00 to fix it.  They had it about a week.  It does have a great picture but I am afraid JVC will not be getting anymore of my money in the future.  I also had a JVC stereo receiver that went out in five years. Every other stereo receiver I have had in my life I had to give it away.  Apparently none of the letters in JVC stand for dependability", "Date": "February 24, 2009"}, {"Title": "Great bargain", "Author": "K. Tidwell \"ktljt\"", "ReviewID": "R2B07SV7X1T1U5", "Overall": "5.0", "Content": "I have had my set since November 2003, one of the best deals on the market for a projection HDTV monitor.  No troubles out of this set, excellent picture, lots of features and inputs.", "Date": "December 21, 2005"}, {"Title": "Would give it ZERO stars if that were an option...", "Author": "M. Wolford", "ReviewID": "R318XU73QMK0MU", "Overall": "1.0", "Content": "We purchased this television in April 03 and loved everything about it until  a year and 3 months later.  As we were watching t.v. one night, all of a sudden we heard a loud pop and the screen went blue.  My husband got the manual out and tried to get it working but to no avail.  Unfortunately, I did not buy the extended warranty because I thought that it was covered for more than a year.  I called JVC and was told that I would have to call and have it repaired myself.  We ended up having to send it to a shop and paid an extra $500.00 for the repair.  I was more than upset because in my opinion, when you purchase a $1600.00 television, it should last longer than a year before needing repair unless you damage it yourself, which we did not.  The receipt for the repair says they had to replace an output and install a CRT insulator kit.  I swore then that I would never buy another JVC product again, but was at least glad that our t.v. was working again.  Now, two and a half years later, it is going out AGAIN.  This is the biggest waste of money I have ever spent and I am so disappointed with JVC.  I am not usually one to write reviews, as a matter of fact, this is the first I have ever done, but I felt compelled to do so because I am so disgusted.  For those of you who have already purchased, I hope that you never have to go through the ordeal that we have had to go through.  For those of you considering purchasing, I would look into buying another brand.  Instead of wasting another $500 to have this t.v. fixed for maybe another two years, we are just going to buy another t.v.", "Date": "March 4, 2007"}, {"Title": "Piece of garbage", "Author": "S. OLEARY", "ReviewID": "R31Q52ONAGT73P", "Overall": "1.0", "Content": "I wouldn't buy another JVC product if they were the only company on Earth.  I purchased my TV in Nov of 2002.  It had to have a part replaced in Feb 2003!  Of course, it had to go in the shop for two weeks until the part they ordered was received.In all, there have been about 5 service calls, with 2 trips to the shop.First, the TV would shut itself off.  No, I didn't have the AutoOff function turned on.  Then we noticed the clock was way off all the time (it would lose several minutes a day).  Then, sometimes when we turned the TV on, there would be sound with no picture.  We had to unplug the TV for several minutes, then try again.Finally, after all that, the TV appeared to be fine, until recently when we noticed the menu would go all pink.  The picture was fine, just the menu was off.  I was afraid this was a symptom of a larger problem, so I made yet another service call.  Once again, the TV is in the shop, and has been since Dec 1st.Now my initial warranty period is over.  I expressed concern to JVC but, in typical fashion, they spouted the company line.Question:  how many times does the TV have to break before JVC realizes that they sold me a lemon and should replace it?Warning:  never buy from JVC.  They are crap.", "Date": "December 15, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "48-inch 16:9 rear-projection HD-ready TV with direct-digital DVI input; 47.25 x 49 x 24 inches (W x H x D)\nDIST (Digital Image Scaling Technology) upconverts all incoming signals to full 1080i high-definition resolution\n7-inch, 4-element cathode-ray tubes, protective screen shield with antireflective coating\nDual-tuner picture-in-picture with 12 Multi-Index-Window to select your favorite channel from a range of thumbnail images\n4 MEGA 10 BIT 3D Y/C comb filter, scan velocity modulation, a multitude of audio/video inputs", "Name": "JVC AV-48WP30 I'Art Pro 48-Inch Widescreen HDTV-Ready Rear-Projection TV , Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/51DVF6EM6JL._SY300_.jpg", "ProductID": "B000066R7X"}}