{"Reviews": [{"Title": "Great Value for the Price!", "Author": "Callista M. Salazar-cobb", "ReviewID": "R2KRG7EZCWSAHT", "Overall": "4.0", "Content": "My husband and I love this tv. It fits in our smaller bedroom so nicely on the wall.  It also has a very crisp, clear picture.  Remote is pretty basic, but it works.  The sound could be a little better, but for the size and price, it's a great deal.", "Date": "November 22, 2006"}, {"Title": "Did not receive the TV", "Author": "Paul Hyde", "ReviewID": "R3925GZ0SPK75W", "Overall": "1.0", "Content": "I have not received the TV yet.  I am very frustrated.  I order this TV and paid immediately and still waiting 2 months later.", "Date": "June 20, 2011"}, {"Title": "Average TV", "Author": "MaxShiraz", "ReviewID": "RVE54EGI437M3", "Overall": "2.0", "Content": "TV picture and sound are just average. Mine lasted less than a year before it broke, hence the 2 stars. I'd rather spend more and get a better TV next time.", "Date": "July 3, 2007"}, {"Title": "Cheap - but possibly worth the price", "Author": "Anon Ymous \"Big Watch Fan\"", "ReviewID": "RXXLRJTP3HSIL", "Overall": "3.0", "Content": "I was surprise to find the TV arrived all scratched up, not like the picture - but because we had an immediate need (no TV makes things somewhat urgent lol) we kept it.It has performed admirably in spite of the huge scrapes along the side (not exaggerating, looks like someone took a screwdriver to it)All in all, a decent deal - just be aware it may arrive banged up.", "Date": "August 19, 2010"}, {"Title": "Poor quality sound and picture", "Author": "Goldengate \"Goldengate\"", "ReviewID": "R1RCFEHNMGIKI8", "Overall": "1.0", "Content": "I won this TV in a raffle... so it was FREE... (technically it cost me $1.00).  It's worth that, but not much more...sound quality is terrible and the picture is fuzzy.  Black colors look more like browns.The price seems really high given how much flat screens have come down.  It's basically the size of a computer monitor and is almost $400!I'd recommend you keep looking.", "Date": "January 24, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "20\" LCD screen; slim, flat panel design fits almost anywhere\nHigh Brightness: 450 cd/m2\nContrast Ratio: 500:1\nHigh Speed Response Drive: 16msec or less\nWide View Angle: H: 170 degrees, V: 155 degrees", "Name": "Emerson 20\" LCD TV with Side Speakers, EWL20S5", "ImgURL": "http://ecx.images-amazon.com/images/I/51T63FNQ9JL._SY300_.jpg", "ProductID": "B000GKE870"}}