{"Reviews": [{"Title": "This is the plasma to get", "Author": "bob", "ReviewID": "R231EQRSRQTDVW", "Overall": "5.0", "Content": "I have been researching HDTV's for about five years.  When I finaly decided to take the plunge, there was no doubt that this television was the one to get.  The picture is amazing -- from ANY source -- HD or not. The blacks are BLACK\", the colors are vibrant and the flesh is natural.  Further, the justification of fullscreen programming looks great -- it is not distracting at all.The controls are very simple, but infinintely tweak-ableThe television is also expandable -- with card slots to allow for almost any type of input.  It comes standard with component, s-video, composite, and computer input.  (If you want hdmi or dvi, you have to purchase a separate card, and install it in the extra expansion bay).since it is a commercial monitor, it does not have a built in turner or speakers (though you can add those).  I saw this as a plus -- why pay for built in speakers, when I planned to run the TV through my home theater anyway? As for the tuner -- it is not that big of a deal to just use a cable box.The television is very simple -- a black frame with NO buttons on front.  Nothing to distract you from the picture.In addition, since it is fanless, it is nearly silent.", "Date": "January 31, 2006"}, {"Title": "Top notch excellent value plasma display", "Author": "G. Zhu", "ReviewID": "R3D2438W7NIA8B", "Overall": "5.0", "Content": "I don't usually give 5 stars to an electronic device, but this one is exceptional, it very well deserves all the hype it has generated for the following reasons.1. Crisp high quality HD picture. I have watched the Lord of the Ring, WTTW HD on this monitor, the picture quality is astonishing. I view it from all different angles in my living room, no change of quality of the picture can be seen at all.2. Thin profile, light weight. I can carry it all by myself during the installation.3. Eagle Globel shipping is fantastic. The unit was not only delivered 5 days before its estimated arrival date, but also the delivery guys helped me carry the double-packaged box inside of my house, and unpacked it right in front of me, to show the display in excellent condition.I have owned the unit for about a week now, so far the only down side I have noticed is the unit does have a humming sound when it is extremely quiet, but un-noticeable during day time.I give it three thumbs up if I have an extra one.", "Date": "March 30, 2006"}, {"Title": "Sssshhhh!!!!!", "Author": "Scott Burton", "ReviewID": "RGKLD99GXM64M", "Overall": "5.0", "Content": "Stop spreading the word! I'm worried they'll stop making this killer display at this price.I have 2 and know lots of other owners. We use them in professional and home settings. There isn't a better deal for picture quality, flexibility and price. Know what you're buying though: you'll need to supply your own tuner & sources, speakers and stand.This is the ideal display for anyone who wants to work plasma into a serious home theater installation. Everything you need for a well-programmed custom install - direct-select inputs, multiple resolutions and aspect ratio options, full color and greyscale control, modular input boards - it's all there, I could go on. It's true that there are better choices for pure picture quality, but that's a very small and expensive list.The 50-inch is probably ideal for most large family rooms but the 42 is a great all-around display.", "Date": "July 12, 2006"}, {"Title": "Excellent shopping experience with amazon.com", "Author": "Laurence Burdett", "ReviewID": "R1MQFTBHUF75H6", "Overall": "5.0", "Content": "I recently purchased the Panasonic TH-42PHD8UK through amazon.com.  Other reviewers have commented on the product itself and one should read the reviews at cnet.com as well.I mostly wanted to comment on the shipping process as I was initially hesitant to order such a large, expensive item via the internet.  I was eligible for and selected the free Super Saver Shipping.  The shipping was done by a company called Eagle Global Logistics (EGL) and was very efficient.  About a week after placing the order I was contacted by EGL by phone and they offered me a choice of days for delivery.  The delivery came on the agreed day within their stated four-hour window.  It ended up arriving seven days sooner than the estimated delivery date.The plasma screen itself comes securely suspended in styrofoam and a cardboard box, which itself is suspended in styrofoam and a cardboard box--all of it original Panasonic packaging.  The EGL deliverer brought it to the door with a dolly, and he and I carried it inside.  It couldn't have been a smoother process.I chose to get the older stand (Panasonic TY-ST07-K) as I prefer its look to that of the 08.  I had a hard time finding this model but was able to get it from a site called ProjectorMounts.ca and had it shipped from Canada at a resonable price.  (I also experienced good service from them.)  By the way if you are considering this stand you should know that it is made of plastic, which I didn't realize, but it does the job and doesn't look plastic.", "Date": "April 30, 2006"}, {"Title": "Missing a few things", "Author": "Typewriter \"Typewriter\"", "ReviewID": "RNXZRVIHJI2PY", "Overall": "4.0", "Content": "I just got this TV 3 days ago. It provides a beautiful crisp image. Navigating the menus is sometimes a bit of a problem, as they're not set up as intuitively as a lot of TVs I've owned.My only real complaint would be the initial set up of the TV. I pulled it out of it's box, and only then did I realize (my fault probably) that it doesn't come with a stand. Because of that, and because no store near me carried the stand designed to work with that TV I had to get a wall mount. So the TVs price is TV + Stand. And depending on what you want to use the TV for you'll have to get adapters. I went to plug in my R/G/B cables from my X-Box 360 and they wouldn't fit. The R/G/B cables on the TV were for BCN or something like that. So I had to go and buy the adapters for that. Five of them to get full usage of the TVs ports. So price is now TV + Stand + 5 RCA-BCN converters. And theres no place on the TV (that I could find) to plug in regular cable television. I have no idea what kind of converter I'm going to get for that, but I'm sure theres one out there.If none of that bothers you though, then get the TV. It really is the best image/size/quality that you'll get for this price.", "Date": "December 4, 2006"}, {"Title": "Great TV when it works", "Author": "Kevin Harriott", "ReviewID": "R34I5VILFS3HQR", "Overall": "1.0", "Content": "Great TV. Picture is awesome. Enjoyed it when it was working. Needed repairs at 15 months (not under warranty) Cost $700. Needed repairs again for same issue at 18 months (three months later). Another $700 projected. Decided to replace TV", "Date": "September 3, 2008"}, {"Title": "Perfect", "Author": "Victor Ramirez \"Donvi\"", "ReviewID": "R2UFLOE8MNJLKA", "Overall": "5.0", "Content": "I bought this tv like year ago and I can tell you that is the best image I have seen from plasma and lcd. Very sharp and incredible color. 100% recommended.", "Date": "September 23, 2007"}, {"Title": "Love this Panasonic TV!!", "Author": "windchase", "ReviewID": "R2Z0GJ9EXKKW0S", "Overall": "5.0", "Content": "We have had this TV for 5 months now and LOVE it!! It has stunning color, amazing clarity and is very simple to use and install. We studied the reviews and chose this one for both it's size and it's cost. We could not be happier with our purchase.", "Date": "March 23, 2007"}, {"Title": "Still Satisfied 18 months later", "Author": "D. KNUDSON \"dk\"", "ReviewID": "R1566VUS7INHM2", "Overall": "5.0", "Content": "I have this TV for almost a year and a half and have no complaints.  I bought the optional HDMI and DVI add-in boards and they work perfectly with my home theater PC and cable box.One thing to remember is that this model has fewer inputs than the consumer models, it does not have an internal tuner or speakers either.  So keep that in mind if it matters to you.  For me I don't need these extras, plus this model is easier to tweak than the consumer models.At this point though you may want to upgrade to the TH-42PHD9UK.  It's cheaper and one generation newer.", "Date": "December 16, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000B7VB3W"}}