{"Reviews": [{"Title": "Great TV!!", "Author": "Chris Anderson \"Pher\"", "ReviewID": "RJA8FWXPXGL07", "Overall": "5.0", "Content": "i got this tv back in christmas 2008, it is still going strong, sharp is an amazing brand, you will be very happy with this tv, the speakers are pretty good, if you want better sound, hook up a theater system, works great for xbox 360/computer monitor, we have had zero problems with this tv, havent had to call tech support. i am now looking into buying a 32\" inch sharp aquos television, because i love this brand, Keep It Up Sharp!!!", "Date": "November 29, 2009"}, {"Title": "Good small TV/Monitor", "Author": "Tag", "ReviewID": "R3AHP0IMRVC87L", "Overall": "4.0", "Content": "I've owned my Sharp LC19SK24U for almost 2 years and used it primarily for a PC monitor at first and now it is a 2nd TV. I bought it on sale for about $230 in Nov 2007, which was about the same price as a stand-alone PC monitor at the time. As a PC monitor, it has an acceptable picture... nothing great.What I love is being able to switch to the TV with a simple button click on the main remote. (There are 2 remotes.) This saved me from buying a TV tuner for my PC. All you have to do is attach a video cable to it and you're all set. The TV picture is adequate, but not exceptional. Obviously, you can't be too far away from a 19-inch screen to see, but if you do watch from across a room, the tiny speakers must be turned up to max, which isn't very loud at all. There is some distortion at higher levels, which is expected from a small TV.  However, if you want better sound, hook auxiliary speakers to the rear jacks. There is a nice feature that automatically adjusts the brightness according to the ambient light in the room, which is handy at night.There are 2 remotes. One full-featured one and a small basic one that magnetically attaches to the base, (or your refrigerator for that matter if you use it in the kitchen.) The basic remote has a built-in LCD clock & timer, on/off, volume and channel up/down. There are two sets of input RCAs on the back, S-video, HDMI, an analog PC jack, and a small ?mm headphone jack.Overall, it's a good small TV.", "Date": "August 22, 2009"}, {"Title": "I have bought 9 of these", "Author": "CDP", "ReviewID": "R29ZZ56QJI4HJT", "Overall": "5.0", "Content": "I bought the first one about 5 years ago.  We have 3 in bedrooms, one for outside, and have given 5 as presents.", "Date": "January 17, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Display type: Flat-panel LCD\nScreen resolution: 720p (1366 x 768)\nAspect ratio: 16:9\nContrast ratio: 400:1\nTuner type: NTSC, ATSC, QAM", "Name": "19\" Sharp 19SK24U WideScreen 720p 1366x768 HDMI VGA Black LCD TV LC-19SK24U.", "ImgURL": "http://ecx.images-amazon.com/images/I/31lnJQ9hBdL.jpg", "ProductID": "B000ZMBKMK"}}