{"Reviews": [{"Title": "Quality TV and Great Customer Service", "Author": "\"karenjr\"", "ReviewID": "R1FFUZJI256INH", "Overall": "5.0", "Content": "We purchased this TV last year. The quality is great, it has a sleek look and has a great remote.  We had some problems though. After the TV was on for a while, we experienced a loud crackling in the sound, then the sound went off and the TV went to a blue screen. I contacted customer service in CA.  They were GREAT.  They were very responsive and they shipped me out a new TV under the warranty.I would highly recommend this TV.  It has good resolution, a great picture, sleek design and a good price.  Their customer service was top notch and very responsive.  This is a high-end LCD TV.", "Date": "February 9, 2004"}, {"Title": "Excellent", "Author": "\"jsulliucsb\"", "ReviewID": "RHTW5GS0TGP68", "Overall": "5.0", "Content": "I love the picture on mine. Everybody walks into the room and says how much they like it. Very good industrial design!", "Date": "September 15, 2003"}, {"Title": "BEAUTIFUL PICTURE...BEAUTIFUL DESIGN", "Author": null, "ReviewID": "R1DSTHBNZ5PUXN", "Overall": "5.0", "Content": "THERE IS A REMOTE THAT COMES WITH THIS MONITOR/TV!!! ONE OF YOUR REVIEWERS CLAIMS THERE IS NOT. IMPRESSIVE DESIGN... FRIENDS AND FAMILY LOVE IT!!!", "Date": "September 30, 2003"}, {"Title": "Well, Nichols you are simply wrong! 5.5 Stars!", "Author": null, "ReviewID": "R2M0Y0VVPEP5CK", "Overall": "5.0", "Content": "There would be no sound when ever there was a quiet scene inanything i was watching. Response: Why would a 'quiet' scene need sound? Isn't greatthat 'no sound for a quiet scene'?And customer service was the worst I have ever experience. Afriend of mine had the same problem with his tv. So please stayaway from this TV.  Really? Ans: Tatung is very famous for its good customer service, notonly in the US, but also in Taiwan and Europe. Are you kind ofsalesman from another competitor? Because I don't think youreally own this TV, and possibly you know nothing about it.Now turn to the review: The TV itself is very good in colorreproduction, and the response time is short (which means verygood for game playing). Moreover, the overall appearance is alsovery nice. Well made LCD TV! I strongly recommend it to everyone.", "Date": "January 28, 2004"}, {"Title": "Remote", "Author": "Woody", "ReviewID": "R15RRY88K0YMB0", "Overall": "5.0", "Content": "Yes, the specs do say there is no remote, but it DOES include a remote.", "Date": "March 27, 2005"}, {"Title": "DO NOT PURCHASE ANY TV BY TATUNG!", "Author": "N. Biever", "ReviewID": "RFG5M1X9IWQHN", "Overall": "1.0", "Content": "Note: I would rate this product and company with zero stars if given the option!Do not buy this TV.  I owned another Tatung television  and tried to have it repaired under warranty.  The TV, however, must be shipped to the company for repair - at the customer's expense.  So their warranty requires $200+ right off the bat.  So after my first disappointing experience with their customer service, the set quit altogether.  Of course, the warranty period had expired now, but we still had only owned the TV for 2 years.  I contacted customer service again and was told I could have it repaired by shipping it to them and paying a mere $700.  So instead of wasting my money repairing this lemon, I plan to take my money and purchase a TV from a reputable company like LG.Congratulations to those of you who enjoy and appreciate the products and service of the Tatung corporation.  The rest of us suckers now realize we should not waste money on their rubbish.", "Date": "July 10, 2007"}, {"Title": "THE HORROR!", "Author": "Elizabeth Moe", "ReviewID": "R1ZG5BFNBZ5WQT", "Overall": "1.0", "Content": "I have had better quality TV's from the Goodwill store. I bought my Tatung TV about a year and a half ago. Mine was actually a bigger one than this one but same brand. Right from the begining it had problems with the screen going out whenever it had an all white background on whatever show or commercial we were watching. I called customer service and they told me to do a reset and that it was probably my cables. I got tired of calling them and them not helping me so I just lived with the problem. Now, just a little over a year of having the TV, it just won't even turn on anymore. I paid 798.00 for this piece of crap and they won't honor their product. I guess its ok for a 798.00 TV to just stop working as long as its been over the one year warranty mark. This company should have stuck to making microwaves. I would NOT buy anything from this brand ever again. Try Goodwill, you will probably get more for your money.", "Date": "July 5, 2007"}, {"Title": "0 star for this piece of junk. Not a very good tv.", "Author": "Andre", "ReviewID": "R1PXX4G3A7737F", "Overall": "1.0", "Content": "This LCD monitor may look good but it's a piece crap. When watching tv,dvd or vcr the sound would go away. There would be no sound when ever there was a quiet scene in anything i was watching. And customer service was the worst I have ever experience. A friend of mine had the same problem with his tv. So please stay away from this tv.", "Date": "November 16, 2003"}, {"Title": "Disappointed", "Author": null, "ReviewID": "RGGF6M4BELIZ6", "Overall": "1.0", "Content": "Cheap, spray-painted plastic cabinet and poor picture quality. Sound was tinny and cheap. Picture exhibited ghosting effects due to slow panel speed. Should have spent a little more for a name brand. Customer service was practically non-existant.", "Date": "December 4, 2003"}, {"Title": "No remote control", "Author": null, "ReviewID": "R1SPN6UZS5HPVQ", "Overall": "3.0", "Content": "Read the specs.  Techinical data shows NO remote control.  I'm still looking.", "Date": "September 23, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "LCD flat-panel TV with wide 160-degree viewing angles; 20.5 x 13.3 x 4.53 inches (W x H x D) with stand\n17-inch LCD multimedia/TV monitor with NTSC TV tuner\n1280 x 768 (Wide XGA) resolution, high brightness (400 cd/m2), low power consumption (less than 60 watts)\nComponent-video, S-video, and composite-video inputs ensure optimum connections with any video source\nPicture in picture lets you watch two stations simultaneously", "Name": "Tatung V17AFTW 17-Inch LCD Flat-Panel TV", "ImgURL": "http://ecx.images-amazon.com/images/I/51DW5N6JTEL._SX300_.jpg", "ProductID": "B00007787T"}}