{"Reviews": [{"Title": "Perfection", "Author": "Bob North", "ReviewID": "R1UVJV29OTX0WP", "Overall": "5.0", "Content": "This TV is stunning. It is fairly simple... but it takes a few days to understand the subtle adjustments that make it perfect for you. I think that many people experience quick negative reactions to electronics... before taking a little time to learn how to properly operate the device. My tip is to read manuals in advance... something that becomes easy via Internet.The TV I replaced is a Sony 32XBR100... probably the best analog TV ever made. I loved using it for ten years with never a slight problem. It is on its way to a happy new home and life... which is saying a lot because it weighs 160 pounds. I have had my eye on HD for years. I have seen them all. There have been some fantastic products... but I will never be spending ten or more thousand on a TV... even if it comes with an all expense paid two week trip to Hawaii and a life supply of pineapple.I recently bought an excellent 23 inch HD Sony for a bedroom. On a return to the store for a cable... I stopped in my tracks for the Sony Bravia KDL-V40XBR1. This is a store with all 50 or so beautiful HD TVs on the planet. I thought, how did I miss this one. Well it just came out. I studied up, read the manual, checked around. It is rarely in stock as of this week. But, there it is. May I say that, yes... you can get a better image in SD on this than I could on my old perfect analog XBR. And, the HD is magnificent both via local cable and Direct TV.Since I was already equipped for a heavy tube TV, I thought that I would finally get Sony's 34 inch HD XBR which is said to be the standard for image. But, the new Bravia 40 inch is too spectacular to turn away from and the elegant style is a huge relief from watching TV on a device as big and heavy as a mule. No more 200 pound television for me.I am fussy as hell. I stopped buying anamorphic dvds because my 32XBR100 could not do them resolution justice on that expensive first Sony player that weighs as much as an armadillo. I have a great collection of standard aspect ratio classic movies. Now, I guess I should wait to buy dvd's until the new HD's arrive.Yes, it seems that my new Sony should have come with two HDMI sockets, but I will live through that omission. There are a lot more important issues to consider... but this TV is perfection. Sony may not have perfect sales instincts, but they are the best at making the best electronics that normal people can afford... if we remember that we Americans are not normal in this world of starvation and suffering. Sorry, it is embarrassing to be this fond of a consumer product... have to put it in perspective.", "Date": "October 16, 2005"}, {"Title": "I love this TV so much ...", "Author": "E. Lee \"E. Lee\"", "ReviewID": "R1AHX9MONTTBTO", "Overall": "5.0", "Content": "I bought two!  It true what they say about LCD TVs: the color saturation in not as rich as plasma TVs (the blacks are not as dark).  But what LCD TVs have is crystal clear, crisp moving pictures.  The 1080i picture quality of the Bravia 40 is so sharp its simply amazing.  I have seen many plasma TVs including the Pioneer Elite and the Bravia 40 beats them for clarity.  And if you set the Color Space from Normal to Wide, the colors are simply more vibrant.  (I am not sure why this is not the default setting for this TV).As a bonus, this TV also comes with a built in HD tuner and I can use it to pick up HDTV broadcasts using an antenna or using my cable company's basic service.  The other thing I like about this TV is that is has a VGA connector to connect to my laptop and the picture and sound quality there is excellent too.  LCD TVs don't suffer from the picture burn-in that plasma TVs do.  They are much lighter in weight.  And they have a longer life span.  The speakers are wimpy so buy a good home theater system to do this TV justice.", "Date": "March 13, 2006"}, {"Title": "Excellent", "Author": "Gaygeek", "ReviewID": "R35KFKS30PU6WB", "Overall": "5.0", "Content": "I was searching for a TV that would do justice as a computer monitor as well--this one fits the bill nicely. With a resolution of 1360x768 through the VGA connector, this LCD has better resolution than its plasma counterparts of this size, and no need to worry about burn-in on an LCD. TV quality is excellent as well--even stanard definition isn't bad, though you should not have expectations that any flat HDTV will do standard def justice compared to a CRT.Many inputs are available, though I agree it would be nice to have a second HDMI input. The TV is surprisingly light for its size and comes with a nice stand, or can be mounted.", "Date": "November 15, 2005"}, {"Title": "Fantastic! Within a few days you won't be able any more to enjoy watching a smaller TV", "Author": "Dimitrios", "ReviewID": "R32FILO7N24T72", "Overall": "5.0", "Content": "I made a rather big step going from a 21'' Sony TV set to the 40'' Bravia V type but I must say that the difference with anything else I have seen is simply huge and the quality of picture and sound are astonishing. I had heard before many times about the advantages of LCD screens comparing to the Plasma (no burned pixels, no life limit etc.), but I must say that the LCD technology has finally matured to a fine level. This model offers a 178 degree view and I have mounted it on a wall, 90 cm from the floor, where despite its weight of 40 kg it looks marvellously elegant. The set is just 12 cm thick (I think the smallest thickness I have seen in TV sets of this size) and there is no complexity at all for anyone who has the slightest exeperinece with older Sony devices.", "Date": "March 8, 2006"}, {"Title": "Very pleased!!", "Author": "Devious Wayz", "ReviewID": "R3VA4YXKFOV2PO", "Overall": "5.0", "Content": "I read and reviewed LCD tv's for close to a year before finally deciding to make this purchase.  I am quite satisfied with my choice so far!  I have had the tv for close to 2 months and ran it through the ringer with different applications.  Xbox, PS2, Gamecube, Xbox 360, upconversion dvd player, and digital cable.  Every application on this tv looks spectacular, excellant color depths, wonderful deep blacks(which can be hard to come by with lcd), and phenominal picture quality in all HD settings.The one complaint that I have with this tv is that it is quite time consuming to get the settings right with dffferent setups.  I went through numerous changes in my A/V equipment and each time I changed a cable I spent obscene amounts of time adjusting the picture quality again.  Although with that being said the hours upon hours of adjustment that I made to the set in order to get the picture to my likings was well worth the end result.Video games, even the last gen systems(xbox, ps2, and gamecube) look awesome with the right component cables.  Xbox 360 will blow your socks of and leave in you in complete awe of the clarity and crispness of a console video gamer.  Dvd's through HDMI is incredible and will have you glued to the tv for days!Bottom line if you have the 3 grand to put down on a tv.. this is the one!!", "Date": "June 2, 2006"}, {"Title": "Good TV", "Author": "J. Williams \"jomman\"", "ReviewID": "R1L7PKM1Y4K0ZD", "Overall": "5.0", "Content": "A good TV! HD pictures are excellent! Standard definition pictures are, of course, not great, but not awful at the same time. I am eagerly waiting for more HD material to watch, as the HD picture is stunning. This TV has a lot of picture parameters that can be adjusted, and I don't understand some of them. The manual assumes the reader understands all about \"white levels\" and other similar things, but it really hasn't hurt my enjoyment of my flat screen TV. More HDMI inputs would be a welcome addition. There don't seem to be the \"clouding\" problems the XBR2 and XBR3 models are currently experiencing.Jan 2010 - I have had this TV for almost 4 years! Still works great and gives a fabulous HD picture.", "Date": "January 11, 2007"}, {"Title": "It Is Okay", "Author": "Restoring Stationmaster's House", "ReviewID": "R1SGONDT8PCIRD", "Overall": "3.0", "Content": "Unfortunately I purchased this before the price drop, so I paid about $1,000.00 more for it almost a year ago.  I purchased it because Sony just seems to have better products. I purchased this model when I saw it at the store next to other plasmas and lcds.  If anyone is looking to purchase this I would suggest going and comparing it side by side.  The picture is incredible compared to other brands.  You will see what true black is compared to other tvs.After a year of owning this I find that the picture is very dark.  I have tried playing with all the settings and cannot get it to brighten up.  I am going to contact sony to see if there is a patch or something for this. Probably in 6 months I will have to replace it because I won't be able to see anything.Also, although I am sure that it would be the same for all wide screen tv's, when you watch something it is not on the full screen so you have a black border around the entire picture.  If I modify it to make the picture wider or zoom in it distorts the pictures and cuts off the closed caption.At its current price I would recommend itI will be looking at replacing this this tv shortly.", "Date": "February 10, 2007"}, {"Title": "Horrible!", "Author": "Natonia Brazington \"Toni\"", "ReviewID": "R3NQF3U0E37HO4", "Overall": "1.0", "Content": "Bought this TV 11/03/2006 for $2400 (before price drop).  It had a one year warranty.  Now less than three years after the purchase, it is defective with colored diagonal lines going across the screen.  No more Sony products for me!", "Date": "August 30, 2009"}, {"Title": "SONY SERVICE SUXS", "Author": "Kerrie Stewart \"Kerrie\"", "ReviewID": "R3GWZWGKLMOMJ3", "Overall": "1.0", "Content": "Actually i bought this TV online at another site. 4 months later it's still sitting on my living room floor & has never worked from day one! Sony's treatment of me has been disgusting. They don't want to fork out for the expensive replacement part so keep the service contractors coming back & forth trying all sorts of things. Logical solution would be to tell the service guys \"Hey try this, this, & this but if they don't work then here is the part to take with you to install so we don't have the customer waiting & inconvenienced.\"But NOOOO, Sony don't give a damn about their customers. It's impossible to reach anyone at Sony apart from a telephonist at the customer service # & when you do get someone with authority they don't return your calls in a timely way & are inflexible, unhelpful & just plain unsympathetic or concerned with making customers happy. My advice? Don't buy Sony because if you have a problem with your appliance their service is almost nonexistent. Also don't buy any large appliance online. Buy it at a local store where you can easily return it if something goes wrong. Needless to say i will NEVER EVER buy Sony again!", "Date": "September 13, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000BD54J8"}}