{"Reviews": [{"Title": "Has \"BIG THEATER\" appearance....", "Author": "G.J. Smith", "ReviewID": "R3KEE8DPKKZRX4", "Overall": "5.0", "Content": "Gives a Big Theater appearance when used in the rather small living room of a modular home.  As the manufacturer states:  there is no glare such as conventional screens produce, and it does have an amazing viewing angle.  Very easy setup to any other components. After owning most of the major brands, I recommend this product very highly.  A great price too!", "Date": "April 30, 2004"}, {"Title": "Excellent flat screen for the price", "Author": "Mark A. Dressler", "ReviewID": "R2K4SJ114X3RY", "Overall": "5.0", "Content": "I bought my Toshiba a few days ago and I have no complaints.  If you are looking for a good quality, mid-size flat screen, then this is the one for you.  The picture quality is perfect (stay away from Panasonic whose picture seems to be too dark), and being able to switch to a 16:9 is a wonderful bonus.  I use the TV's speakers and I think the sound quality is top of the line.  You can adjust the Bass, Trebble, and balance, while turning on or off features like surround sound.The television IS heavy but not out of the ordinary for its size.  I didn't find it front heavy, it fit on my current television stand, and it is quite stable.If you have questions about which 27\" flat screen to buy, stop searching for answers.  The Toshiba is the way to go.", "Date": "January 2, 2005"}, {"Title": "Almost perfect except...", "Author": "Susan R. Mackey \"da-kid1951\"", "ReviewID": "R3CC9HG3XCIPZ3", "Overall": "4.0", "Content": "I only have one negative comment about this newly released Toshiba design.  When switching stations, I hear a \"whump\" in the first moment of sound.  It seems like a dampening problem in the design.  Probably only audiophiles will notice it, however.  Other than that, I think it is an excellent buy for the money.", "Date": "May 14, 2004"}, {"Title": "Excellent TV with superior quality", "Author": "DS \"technologist\"", "ReviewID": "RL8W0K43MYT1A", "Overall": "5.0", "Content": "I bought this TV during Thanksgiving. I must say that I have absolutely no problems at all. It has very good picture clarity and sound. I was very tempted to get the Sony WEGA as I owned a nice Trinitron Sony for 4 years, but now I feel I have got a better TV for a lower price. I highly recommend this TV to everyone. This is a very good buy until you get into a house when you may consider a Plasma :-)", "Date": "March 9, 2005"}, {"Title": "Toshiba 4ever", "Author": "Raja", "ReviewID": "R17C2R0TP4K3S6", "Overall": "5.0", "Content": "I purchased a Sony KV-27FS120 TV based on reviews on [...] I got a deal for $325 and was quite happy. But not without trouble .. this one had geometry problems. The horizontal lines weren't horitontal at all, when switching on the TV,  a smoky white region would appear on the top of the screen just before the picture came. So I exchanged it for another piece thinking I must have got a defective set. Guess what, the 2nd piece was even worse, exactly the same problem as the 1st one, but also when turning on the TV, the picture would appear after a few seconds, and when it did the color tone was slightly green and then after 2 seconds it would come to a normal color tone. This got me frustrated coz I am quite a detail oriented person, things like these piss me off especially when you buy the top of the line model in its class, a Sony. I returned this junk and decided to go for a Toshiba 27AF44 which I got for $275 from BB. I looked for 2 weeks before deciding which one to go with. I looked at RCA, Samsung, JVC & Panasonic. Panasonic was impressive but it has problems with its contrast settings and the picture is way too dark. JVC is equally good but I decided to go with Toshiba based on the results I got from a few people and experts from [...] Never again a Sony !", "Date": "December 22, 2004"}, {"Title": "Great TV!", "Author": "Michael", "ReviewID": "R1TOJ2JVJP4L7E", "Overall": "5.0", "Content": "I love this TV. Great picture (using S-video from DVD player), great sound.", "Date": "January 10, 2005"}, {"Title": "Good except?", "Author": "Dennis in Texas \"Dennis\"", "ReviewID": "R2ILC7FJ8H5OCR", "Overall": "4.0", "Content": "After my 17 year old Toshiba television died this morning I did some research and decided to purchase the 27AF44 Toshiba flat screen this afternoon.  It looks as though I may have a defective set since there is a definate focus problem evident with the closed captioning and also with menu's generated by my satellite receiver.  The problem is most noticeable on both the right and left sides of the screen.  The center seams to be in perfect focus all of the time.  I will return this one to Best Buy tomorrow after work and see if the next one works better.  If not for the focus problem, the rest of the set works perfectly and the sound is remarkably clear and crisp.", "Date": "August 22, 2004"}, {"Title": "Excellent Buy", "Author": "Stoique", "ReviewID": "R20JBYXJARSBVM", "Overall": "5.0", "Content": "I've had this Flat TV for 2 years now, it has a sharp picture, great surround sound and very cool features. The most interesting however is that it gives pure sound when you connect the \"Headphone jack\" to the sound system. This gives me the option of either using the auxilary output or the headphones jacks with the same quality! Impressive! Toshiba rules!", "Date": "October 20, 2006"}, {"Title": "Great Picture-- not so great sound", "Author": "just joe", "ReviewID": "R22OTJ29BA0XXM", "Overall": "4.0", "Content": "I have had my set for almost 2 yrs. now.... picture is still nice, but speakers fade on and off.... so it gets loud and soft at different times during a show or movie (no A/V receiver at this time). My thumb gets a nice workout with the volume controls. Overall it is a good set when you can't go for LCD/Plasma.", "Date": "January 3, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0001CVBVE"}}