{"Reviews": [{"Title": "I never thought I'd buy a Sony...", "Author": "Kevin Nicholls \"jaded, aging hipster\"", "ReviewID": "RO6BBRTAA31HK", "Overall": "5.0", "Content": "...but after seeing this model in stores, I had to have it.I had been on the fence between the (slightly) less expensive Samsung DLP televisions, and some low-end 42\" plasma televisions in the same price range. I spent a couple of weeks researching forums, checking out different models in different stores and playing around with the display controls, and waiting to see how prices changed with different sales. Each time, the Sony KDF-XXE2000 (different stores had different sizes) came out ahead.The factors that really pushed me over were:1) Knowing that the bulb could be replaced for about $150 if you look around online (you can't fix a dim plasma TV at all).2) There was imperceptible lag (DLP sets are notorious for delays between the picture and audio), and3) The picture quality was far more natural.When I got this home, I connected it to a DirecTV HD receiver, an Xbox 360, a progressive scan DVD player, and a cheap set of rabbit ear antennas that I had laying around in my garage. I was delighted to find that regular 4:3/480i channels looked great -- which is a very serious concern when buying any HDTV. The DirecTV HD channels looked amazing, as expected, and the Xbox 360 was nothing short of jaw-dropping. Even my DVD's looked stellar, compared to my old Panasonic Tau. What really surprised me was that I could get HD channels with the rabbit ears. The SD channels barely came in at all (as usual), but the HD channels were razor-sharp, and had next to no dropouts or artifacts, which leads me to believe that the tuner in this set is well above average.The only thing I don't like (and I can't believe I'm saying this) is the number of inputs. Switching from OTA to the first component input takes five \"clicks\" on the remote. I'm sure there's a way around this, but it isn't obvious.As far as the \"screen door effect\" or \"silk screen effect\" that some allege exist on all projection sets, I can say that I've looked hard, and this model doesn't seem to suffer from either. Keep in mind though, this isn't the sort of TV you want to sit three feet away from when you're playing video games.Only your eyes can tell you which set is really best for you. I wouldn't suggest spending as much time as I did, but you really should go to a \"big box\" store and compare televisions for yourself. That said, I'm willing to bet that this one will make the top of your list.10/11/2006 Update: I don't know why this isn't possible with the included remote from Sony, but the Logitech Harmony remotes are able to tell the TV which input to go to, without cycling through *all* of the inputs. Now I've finally reached home theater nirvana.", "Date": "October 5, 2006"}, {"Title": "Projection is the way to go!", "Author": "Dale E. Hopkins, II", "ReviewID": "R609AY2E0ST4D", "Overall": "5.0", "Content": "After having shopped and tested widescreen televisions for the last year, I finally settled on this model. I was rather disappointed in the flat panel plasma televisions (potential life of only five years??!!) and LCDs and the rather artifact laden pictures they produced. I started looking at projection televisions (DLP and the like).I discovered that these televisions were not suceptible to burn-in like the flat panels. What that means is that you don't have to stretch the picture to fill the entire screen, which distorts a traditional picture image and makes everyone look shorter and wider. You can keep the aspect ratio as it was intended and not worry about the black bars at the side of the picture leaving permanent ghost-like bars on the screen.Another plus to this set is that the picture producing bulb, which lasts approximately 6000 hours can be changed by the owner and at little cost ($150). This beats the pants off of having to buy a new plasma television set every 5-years!The picture is amazing and the colour is vivid. It produces standard television signals fairly well, which was a surprise. We've discovered that certain channels and certain programmes manage to generate a better picture than others but it's fine enough. What really wows us is the HD stations and our progressive scan DVD player. The picture pops and you really feel like you have your own cinema in your living room. You have to adjust the picture to your liking and, if you don't have any experience with HDTVs, you'll likely be making adjustments for up to a month after you get it. You just discover different settings as you \"play\" with it. Oh, the \"silk-screen\" effect previous reviewers have mention is akin to the effect you'd get on a pristine movie screen at a cinema.The internal sound on the set is fine and there are a variety of options that reproduce the sound nicely. Chances are pretty good that these speakers will never get use as most people will hook such a set up to a surround system anyhow.There are numerous hook-ups in the back for VCR, DVD, Computer and video games. You shouldn't run out of inputs. There is also a few additional ports on the side of the set for easy access (PC or plug and play games).We love this set and it's brought us a lot of joy. Granted, some things could look better on this set, but it is in the way the original signal was sent. I've talked to a few flat panel owners about specific DVDs or cable shows and it's been confirmed that it is not something exclusive to this set.For its size, this set is incredibly light and easily moved for cleaning or plugging in new components.", "Date": "February 13, 2007"}, {"Title": "Motion blur, what motion blur???", "Author": "Jacob S. \"Suade907\"", "ReviewID": "R2M1BF1LTHAMHE", "Overall": "5.0", "Content": "I've read in many reviews on this site where people state they notice motion blur. I've watched a bunch of football games and played tons of xbox 360 on this sucker and I can't fathom how anyone can notice any motion blur. This tv is incredible and the best bang for the buck I've found yet. The colors are vibrant and just pop off the screen. The built in hd tuner picks up hd channels off of my basic cable. The favorites feature on the remote lets you seamlessly navigate hd-non hd channels. So for with hd-dvd and blu ray  source material this tv looks outstanding.", "Date": "December 9, 2006"}, {"Title": "Beautiful picture except for motion blur", "Author": "Jonathan Kuhn", "ReviewID": "R1QDMVX5ZZQ0DI", "Overall": "4.0", "Content": "Didn't buy this from Amazon, but wanted to post a review here just to inform those that are interested in this television.  This was actually a replacement TV for a 3 1/2 yr. old Samsung that had a couple problems with the image processor, and the retailer decided to replace rather than repair under the extended warranty.Anyway...I've had this Sony about 2 1/2 weeks now. The picture is beautiful,it has a ton of features, and it's easy to navigate through menus. One thing I do like is that you can adjust the picture setting for each input (cable, dvd, antenna, etc...).  I also connected a very old outdoor antenna that has been on the roof for probably 35 years, and HD picture that way was spectacular.The only problem I have is the motion blur with fast moving content. (I've not noticed this mentioned much in other reviews.) I watch a lot of football, which of course has a lot of fast moving scenes, and often times the area behind the fast moving object as it goes past becomes pixellated. My brother was over last week, and within 5 minutes of watching a football game was commenting about how much he noticed it.  (He jokingly said several times, \"I've got to get one of these $2000 TV's.) I never noticed this on my 3 yr. old Samsung. I knew motion blur was a big problem on older LCD TVs, but I thought it had been fixed with newer model LCDs. Once you notice the motion blur, you start looking for it all the time, and it becomes aggravating. I've noticed it on regular high def. shows as well sometimes. Now that Samsung has a new 46\" DLP out (HL-S4676S, I'm going to give it a try since I'm still in my 30-day period from the retailer.  If you aren't a discerning tv watcher, you may not even notice it, but I do. Other than that, I love the TV.", "Date": "October 8, 2006"}, {"Title": "Researched everything and this was it", "Author": "Chris C", "ReviewID": "R1OW88GI6107MB", "Overall": "5.0", "Content": "The Mitsubishi 36 CRT TV that I had finally died so I had to get a new set before football season ended. Im anal about researching, especially in this case given the choices and tradeoffs among the alternative technologies--LCD, Plasma, CRTs and Rear Projection. After several months of reading everything I could find and a dozen trips to the stores I decided on the Sony KDF46E2000. And it is proving to be an excellent set.Bottom-line, I found LCDs far too expensive. A Panasonic plasma was my 2nd choice, but the light intensity degrades over time and cannot be fixed...I dont want my TV in 5-years to be 20 less bright... and large format CRTs of any real quality just arent out there anymore. Rear projection LCD was my preference as I read about DLP having problems with audio delays, audio being out of synch with the picture, as well as rainbowing of the image. Among the competitors Samsung and Panasonic this Sony set had the best picture to my eyes, and the technical specs to match. The TruSurround audio quality is first rate, even though I also bought a low end Sony home theater system which sounds amazing for $180. I didnt see enough difference between the 1080i and the 720p to warrant going with much more expensive Sony 1080i equivalent, and unless you watch with your nose touching the screen, the differnce is not that great. 720p is such a leap over standard def and my family couldnt be happier. And the Sony quality is second to none...a big factor.", "Date": "January 12, 2007"}, {"Title": "Exceeded My Expectations", "Author": "Hornando H. Dando", "ReviewID": "R3V4JJDUN1W2AX", "Overall": "4.0", "Content": "I just picked up my Sony KDF-46 set today. I upgraded (to say the least) from a Toshiba 32\" CRT. Once out of the box, plugged in and cable attached, it did a search to find all analog and digital channels. It found 91 digital channels I didn't know I had.I got the best taste when I tuned into Discovery HD. The picture was absolutely amazing and the set had not even been tweaked yet (and I'm almost afraid to touch the settings).Colours were awesome and blacks were perfect. I know there are concerns with blacks but they are so good on the set, that I could see detail in the person's black sportscoat. No graying whatsoever. Woodgrains, silver and golds are also very nicely displayed. 3 different people have seen the set today and they liked what they saw, neighbour wants to get one too (smaller size).I do have a surround system hooked up, but even without it, the sound is actually pretty good. There is also an internal fan to cool the lamp, but I could not detect it. By the way, the manual says the bulb requires replacing around 8,000 hrs. A warning light flashes or you will begin to notice the picture darkening. It will take me about 4 years to hit that mark, but I'm fine with replacing the bulb if I have to, if it guarantees me the same quality I see now.It is very important to keep the set at eye-level to get the full detail. I also sit about 10 ft. away from my tv and it is still large enough without being too large. Perfect size. Anything bigger and I think I would have focused too much on small details as opposed to the actual picture. I don't think you need to go bigger unless you are at 12 ft. or farther from the set. Just my 2 cents.I have yet to set up the dvd and over-the-air antenna, but if what I have seen so far is any indication, I'm in for a treat. DVD will get either hdmi or component cables to ensure quality.Wish I would not have waited so long to upgrade my tv.Got a great deal on the set in comparison to flat panels. I also checked over the box before leaving the store to make sure there were no dents or creases (they sometimes pile boxes on top of each other).Very satisified with my purchase. Spent 2 days researching before making my decision. Would highly recommend it to friends and family.", "Date": "May 21, 2007"}, {"Title": "What a TV!!", "Author": "badger \"cp\"", "ReviewID": "R2R2FMW03A72HN", "Overall": "5.0", "Content": "For the price you can not go wrong.  This TV is Awsome.  Great Picture and looks.  I am very happy with this purtchase and would not hesitate to recommend to a friend.  I had a question and called sony support and they were great!", "Date": "October 22, 2006"}, {"Title": "Fantastic Picuture--Superb Quality", "Author": "M. L. Tomaino \"FitFreak\"", "ReviewID": "R3QN9MQ9FJDCPZ", "Overall": "5.0", "Content": "I was surprised that when Verizon Fios techs hooked this set up, they said-\"This picture is amazing, better than the Bravias that we hooked up today\"--All 3 of the techs came in to admire the HD TV--I love the picture and found that it is one of the best I have found to date. For the price, you can't beat the quality and performance of this set. Kudos to Sony for a terrific product at an affordable price. Would I recommend this set?, I already have and will continue to do so.", "Date": "March 18, 2007"}, {"Title": "Bang for the Buck", "Author": "J. N. Brabec", "ReviewID": "R21WT5I4C0XUJS", "Overall": "5.0", "Content": "To say the least, I am not on the cutting edge of technology. My last TV purchase was in 2001 (another Sony that was 2/3 the size & 2.5 times the price of this one). My goal was to upgrade from the old Sony as inexpensively as possible. This set fit the bill and amazon.com had it at the lowest price around at the time of purchase.I am very impressed with the quality of the picture and have yet to notice the \"silk screen effect\" others have mentioned. We upgraded our satellite service to HD after receiving the TV and found the difference amazing - an already great picture became even better. For TV speakers, the sound is good, but we still plan to add surround.For a grand or less, I don't think you can go wrong with this TV.", "Date": "June 12, 2007"}, {"Title": "A great set for the money", "Author": "NineseveN", "ReviewID": "R1R4PQSZ39VO8F", "Overall": "5.0", "Content": "Sony KDF-46E2000 46\" WEGA Widescreen TelevisionAfter looking around for 2 months, I finally decided to go with the Sony KDF-46E2000 as my new TV. My older Samsung 42\" widescreen projection television finally run its course after about 4 years of service, and I felt that my money would be better spent on a new unit as technology has advanced to the point to where picture quality was above and beyond anything I could get on my older Samsung even if it was repaired to factory-new condition. I initially thought about buying a plasma TV, but I didn't like the fact that they had a finite lifespan as opposed to a projection unit that could have a lamp replaced and be in practically new condition again.I've been running what I consider to be my \"test DVD's\" through my set since I got it, and I'm convinced that I made the right choice. The DVD's I use are a mixture of high quality transfers that all have certain aspects that make them stand out. For instance, Independence Day had a lot of colors and fast moving action scenes while The Fifth Element puts a lot of color and texture variation on the screen. Frank Miller's 300 has a unique color palette and a wide-range of high-quality still scenes and textures. So far, I am nothing but impressed with the Sony.Pros:Colors are amazing and brilliant. Artificial laser and light sources on movies really stand out (such as seen in the Star Wars movies or the Fifth Element). Skin tones and clothing can be very accurately represented if the settings are tuned correctly, finding the initial sweet spot for this took me less than 10 minutes of watching various scenes of high-quality transfer (non-HD) DVD's.The clarity and detail that can be achieved on this relatively inexpensive set is amazing. Things look very life-like (again, if you tune the settings towards this end). Plasma definitely has an edge over this type of projection set, but the differences on this size screen for most home viewers should be minimal and not necessarily worth the added cost of the Plasma units. The texture of wood, metal, snow, dirt, clothing and skin has a near life-like quality to it once the set is tuned properly. I've only done an initial calibration and it can only get better with further, more precise tuning. However, if the picture I have is what I have to live with for the life of this set, I will have no complaints, overall the picture is amazing and worth every penny (and then some) that I spent on the set.The sharpness of text in the menu system and on-screen text is perfect. Sub-titles are dependent on the DVD, but while they're not as clear or sharp as on-screen and menu text, they are acceptable.There are more than enough inputs to connect virtually every piece of equipment a normal home user would have.No unexpected visual artifacts can be detected at my regular viewing distances of 10-15 feet. Some people like to turn the sharpness up to high levels in thinking that it will give their DVD's a better picture, but it actually can have the opposite effect. DVD's are generally of a high enough quality that adding additional sharpness will produce artifacts and edges that shouldn't be there, giving the picture a jagged and pixelated look.The lamp life on this unit should be 4000 to 8000 hours, which should last 2-4 years at watching the TV 5 hours every day of the week. Though this lifespan can be significantly impacted by individual habits and conditions, a replacement lamp currently costs about $200 USD, which is not all that much considering replacing it should restore the picture to the condition it was the day you bought it (provided of course that nothing else has broken, malfunctioned or burned out). This is one of the larger benefits of going with a set like this instead of a plasma TV...once a plasma has run its course, you'll need a new TV, there's currently no way to restore the picture.Cons:None that I've really noticed yet. I think this set, especially considering the rather modest price, is a bargain and has everything most of us need and want in a home theater system.My initial settings for DVD viewing (tuned with THX Optimizer* and then honed in by eye):-Picture Setting (Vivid> Standard> Custom) = Standard, which is recommended by the manual for home use, I presume that vivid is suited to work better with in-store demos to catch your eye and compel you to purchase-Advanced Iris = Auto 1 - for signals with a larger variance between light and dark as in a typical movie-Picture = Max (100) - This is the contrast setting, and although common wisdom dictates that the contrast shouldn't be this high, so far this seems to be the best setting for the few movies and games I've displayed on the TV...though experience tells me that I may end up going down to the normally recommended settings of between 30 and 50 once I get through watching more films.-Brightness = 60-Color = 35-Hue = R7-Color Temp = Neutral-Sharpness = Min (0) - this should normally be left at zero or close to it for home viewing when using DVD or HD-DVD sources, all sharpness does is add artificial edges to sharpen soft signals (like regular TV), DVD's and HD content benefit more from leaving sharpness at a very low settings-Noise Reduction = Off - again, more for removing noise in TV signals, best left off-DRC Mode = High Density-DRC Palette = Custom (Reality 25 - Clarity 35)If you use the above as a starting point, you can then fine tune it to your liking as you go. With the above settings, I can see the blemishes and pores in facial close-ups and metal and wooden objects show through with detail on the grain and texture, things look very realistic. I will tune it further as I go, but the current settings are a very good starting point and way beyond the quality you'll get with older large projection or tube TV's.*As I understand it, you can find THX Optimizer on any Lucasfilm or Pixar DVD created from 2000 onward; I used one of my Star Wars DVD's for this.", "Date": "October 3, 2007"}, {"Title": "I should have bought the service plan.", "Author": "R. McHoul", "ReviewID": "RZEM2SXUP9462", "Overall": "3.0", "Content": "I liked this TV a lot until yesterday.  It has a picture as good as any plasma or lcd I've seen and the footprint is very small for a rear-projection.It's in my family room so it gets a lot of use and I have a big bay window which light shines through in the afternoons.  Even with that the glare is pretty minimal for most tv watching.  Altough I'll definately pull the blinds for serious watching of dvd's or big sporting events.So everything was going well until yesterday when the lamp blew out.  A brief look online and they are $200 to $250 for a replacement.  I'm not at all handy so I have no idea if that's something I can do myself.  If not, I'm probably looking at at least another $100 to $150 for a professional.The TV is only about 15 months old, so even though it's in my main room and is on almost constantly it seems a short lifespan.I NEVER buy service plans because when you think of how many electronics (tv's, computers, printers, laptops,dvd players, stereo's, mp3 players,video game consoles, etc.) and appliances (fridge, range, dishwasher, washer, dryer, vacuum, mixers, etc.) are in a typical household and how long they usually last, you're basically self-insuring against the one or two items which will fail before it's time.I guess the difference here is that this lamp WILL fail at some point and in my case quite quickly.  It just sucks that it happened to fail 4 days before the Patriots play in the Superbowl (I'm from Mass.).", "Date": "January 30, 2008"}, {"Title": "This is one great hdtv!", "Author": "NY2CO", "ReviewID": "R2UA497D7GRJ4S", "Overall": "5.0", "Content": "Have had this for a little over 2 months now and it is wonderful! I agree with the 8/31/2007 review by Keyur H. Desai especially re: the upscaling dvd player. I happened to buy the same one - Sony DVP-NS75H. I thought my regular dvd player would give a great picture but it didn't.  Definitely get one.I researched buying an hdtv for a long time, and decided on a dlp, either Samsung or Sony.  But I didn't like the reflective black cases on the Samsungs.  This has a slightly larger bezel than the Samsungs I was looking at, but believe me it's no big deal, especially since the color is an unobtrusive matte dark gray, with a matte silver on the bottom. And the screen is non-reflective also, unlike some lcds and plasmas. As for the sound, we have a smaller home, so I don't even have a 5.1 system, and the sound from this is all we need.I have a Comcast hdtv DVR, hooked up with very inexpensive hdmi cable (diito for the dvd player)that I got from ehdmi dot com. The hd channels are amazing, especially sports.  Tennis, football, baseball...all awesome...and my husband can't wait for hockey season.  He was skeptical about getting an hdtv (we had an excellent 6 year old Sony 32\" tube tv...now in our son's room).  Almost every night now hubby says \"I love this tv.\"  I haven't noticed any artifacts at all from this tv.We sit between 8 and 10 feet away, and even non-hdtv movies look good.  If they're 4:3, I can zoom and it still looks ok.  Though not like hd!When I first got it I used the tools on our Finding Nemo dvd to set the picture settings, but honestly it looked just fine right out of the box.I thought I wanted the 50\", but this one is plenty big for our space and the distance we sit from it. And this is so lightweight compared to the old Sony.  That thing weighed like 160 lbs.  I also thought I needed 1080p, but I didn't!  I can't see how the picture could be that much better to justify spending so much more money.The viewing angle is not an issue. Anywhere we sit it's perfect.  Sure, if you lay on the floor and look up at it, it will be darker, but who does that?  Or if you're way off to the side it looks darker, but we don't sit there to watch tv.I will buy the extended warranty from Sony Style, but not until the first year warranty is almost up.  I called them, and if you buy say a 4 year extended warranty, that includes your 1st year too, so it's only really 3 years past your normal included warranty period of one year.  I asked when is the last date that you can buy the extended warranty, and they said something like the 1st day of the month, one month before your warranty ends.  So if I bought it on 7/3, I'd need to purchase by 6/1.  But call them yourself to find out for sure.  I just figured why give them my money early, ya know?  And the extended warranties are based on how much the tv cost, and it is not at all expensive for a 900 dollar tv.  Definitely worth it for the peace of mind it will bring...so many things can go wrong.  I know I'll have to buy a new bulb in a couple of years, but that's ok with me, since this tv is wonderful.Buy it now while there are still some around for this price, instead of spending so much more for the newer model.Peace.", "Date": "September 21, 2007"}, {"Title": "Love it", "Author": "M. pantera \"MP\"", "ReviewID": "R3CARMEB672Q82", "Overall": "5.0", "Content": "This tv is beautiful.  For only about $900, you can buy the tv and afford to buy the protection plan (for only another $120), and have piece of mind.  The best thing about this tv is the cost-benefit.  The picture is bright and clear, and it has all the inputs you will need. I highly recommend  this set.", "Date": "July 23, 2007"}, {"Title": "Sony's Grand WEGA... W-O-W!!!", "Author": "Caryn", "ReviewID": "R3JTTY8NHTTM9T", "Overall": "5.0", "Content": "We ordered the Sony 46\" Grand WEGA from Electronic Express on Amazon. We received the TV in 3 days- the delivery service was extremely helpful- right to the TV's stand! Sony has it easy to lift off the packaging and unveil your new TV. Setup was automatic and simple. Color is beautiful and so clear. Amazon amazing deal!", "Date": "August 18, 2007"}, {"Title": "Has lasted years and years and years", "Author": "Peter James", "ReviewID": "R21PVBIZ2E7AX5", "Overall": "4.0", "Content": "While no longer my primary television, this one still serves up a great picture after all of these years.  I'm only reminded to post this review since the lamp went and I had to order a new one.", "Date": "February 3, 2013"}, {"Title": "Manufacturer flaw, stay away", "Author": "Michael R. Eisler", "ReviewID": "RKL7QAOQH89G6", "Overall": "1.0", "Content": "Bought this six ears ago and up until yesterday was happy with it. The TV indicated it needed a new lamp, so I replaced it. For five minutes I had a picture that was crisp and perfect. Then it developed a red tinted bar across the top of the screen. Researching of the web determined it was a manufacturer flaw and is very expensive to fix. I called Sony, which admitted the flaw, admitted it was extending the warranty on some projection LCDs, but this particular model was not included. So I asked for Sony to honor its no cost electronics take back program and schedule a pick up to recycle it. I was given a bogus web site and two bogus phone numbers. Sony in fact does not have such a program, unless you want to drive 90 miles to the nearest recycling depot to drop it off.I will never purchase another Sony product again.", "Date": "December 2, 2012"}, {"Title": "Do Not buy Grand Wega", "Author": "C", "ReviewID": "R25N2B6XIFTS54", "Overall": "1.0", "Content": "Having purchased a Grand Wega a couple of years ago you will find that the Optical Block for this product will fail. Once it starts going dont expect much assistance from SonyCheck out 'Optical Block problems Sony' on the web for more details.Would not recommend any of this line of Sony TV's", "Date": "December 14, 2011"}, {"Title": "Excelent TV", "Author": "James", "ReviewID": "R12NAJS1SU9EPI", "Overall": "4.0", "Content": "I bought this TV used from a younger couple who upgraded to an LED. I would have to say that this was an excellent replacement for my 52\" RCA. We have not had any trouble with this set. The colors are awesome. We watch movies on Blu-ray and spend quite a bit of time gaming with the PS3.My wife hated the 52\" but loves this 46\". We use HDMI for most of our input devices.", "Date": "November 24, 2011"}, {"Title": "A good 'old' t.v.!", "Author": "Amy Weierman", "ReviewID": "R1EOU7BLU41DRJ", "Overall": "5.0", "Content": "I purchased this t.v. right after the Chicago Bears won the NFC Championship in 2007.  I was NOT going to watch a Bears Super Bowl on a 26\" glass-tube t.v.!  After much research and shopping, I settled on this set because it was in my price range, size range, and the picture looked great.  I have not been disappointed in my decision one bit.  It's not a 'flat-panel' that you can hand on a wall, but is thin compared to old tube t.v.s, and fits easily up against a wall or in the corner on the stand that was designed by Sony.  I realize that nobody will be purchasing this t.v. anymore, given the new models available and the price of this t.v., but it's time to replace the bulb ($85 every 2 years) and I was contemplating \"upgrading\" to an LCD or LED model.  I saw the link for this t.v., and as I watch my son slay zombies in hi-def as I shop, I am still really impressed by this t.v., and thought I'd share my joy.  In the 4 1/2 years I've had this t.v., the only issue I have had with it is with viewing angle.  At more extreme angles, it is difficult to see the picture - oh, well, nothing is perfect.  I'm getting a new bulb, the LED tv will have to wait at least 2 more years!", "Date": "September 25, 2011"}, {"Title": "High Maintenance Costs", "Author": "Donavon", "ReviewID": "R2214A0YOB25W6", "Overall": "1.0", "Content": "The main thing you want to consider before buying this TV is the replacement of the lamp.  I bought mine in Nov 2006, replaced the bulb in Oct 2008 $200, replaced it again 8 months later in June 2009 $150, again 7 months later in Jan 2010 $150 and today 10 months later it has gone out again which will be another $150.  And to top it off, this lamp is on back order so Ill have to hunt around for 3rd party places.$650 in bulb replacement costs over 4 years.  Most of us plan to keep our TV's for 10-15 years especially since we all paid so much for them.  First bulb has the 2 year life, after that 6-10 months life on replacements.  Pay that every year for 10 years and your looking at $1500.  Hidden costs if you ask me.In addition my friend bought the same TV except it was the 50inch the same day I bought mine.  He has replaced his bulbs in the same timeframes as I.Don't get me wrong, the TV quality was fantastic so long as your lamp is bright.  If the bulb wasn't so short lived and a high cost, I would give this 5 Star's however I must give it 1 star because its unrealistic to have bulbs go out this much.  You basically pay for the cost of the TV and through the life that you keep this TV you will eventually spend the money on bulb replacements that eventually will add up to the cost of another TV.  So if you keep this for 10 years, you will be paying for two TV's but only have one TV.I will not buy another bulb again.  I will be looking at buying another TV that's not Sony.", "Date": "November 24, 2010"}, {"Title": "Not Worth The Money Or The Hassle", "Author": "Ruth Frechette", "ReviewID": "R5XFG0EU2X8BB", "Overall": "1.0", "Content": "We loved this TV when we first purchased it but... 3 years later, 2 replaced lamps, and over $300 spent for those lamps, the TV is now no longer working.  In the end, not work the money or the hassle.", "Date": "February 17, 2010"}, {"Title": "STAY AWAY FROM SONY REAR PROJECTION TV", "Author": "John P", "ReviewID": "R1L3UFAWKIZ4DJ", "Overall": "1.0", "Content": "I bought this TV new in 2007 for 1,200. Within 1 year I had to change the Lamp. Within 2 years the TV would not work and I was told that it would cost 500 to repair. I did some investigating online and found out the rear projections made by Sony were always breaking down. i.e.Lamp housing melting (MELTING!!!)etc...They were so bad that Sony had to add extended warranties on certain parts found in these products after enough people complained. Finally Sony stopped making rear projection TVs all together. I have had Sony products for 30 years and have never experienced anything like this.Sony will not honor their obvious design flaws and failed attempts to make a reliable product.As one TV tech put it \" they are still trying to catch up with the new technology\". That tells me they are experimenting with my money and that doesnt sit well with me.SORRY SONY YOU LOST A GREAT CUSTOMER!!", "Date": "November 2, 2009"}, {"Title": "Sony Grand Vega", "Author": "Richard J. Wagner", "ReviewID": "RWISJ32580A7X", "Overall": "4.0", "Content": "Purchased 11/06 and has performed flawlessly.  Have PS3, PC, VCR, DVD bridged thru to Bose audio system.  Viewing angle is pretty good, dims a little when greater than 45 degrees off center.  Next one to be Sharp Aqueos as they have a better picture.", "Date": "November 9, 2008"}, {"Title": "GREAT TV UNTIL YOU REPLACE LAMP", "Author": "Gegory C. Hall", "ReviewID": "R3S6KX1ZHL1TX0", "Overall": "1.0", "Content": "We loved the Sony KDF-46E2000 until 2 weeks ago. The projection lamp needed replacing. I purchased a new one and replaced it. Tv came on for about 10 minutes then wouldn't come back on. I had 3 blinking red lights on power button. I contacted Sony and they said the lamp door was not on right. I checked and it was. So I called a tv repair man. They came out and fixed the activor switch. 140.00. Tv then had a red band at top of screen. Contacted Sony again. They told me to take it to a certified Sony repairman. The problem is there are no Sony repairman in my area. They are 2 hours away. After arguing with Sony they finally offered me a new tv for a discounted rate. A 1599.99 tv for 768.00. But I already spend 300.00 for new bulb and repair service. The engine light is failing on the KDF-46E2000. TV is only 16 months old. Very disappointed. So don't try to change projection bulb without a repairman.", "Date": "July 26, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "HD (1280 x 720) Picture Resolution (LCD Chip)\n3 LCD Chips (R/G/B); 921,600 Pixels Each\nCinema Black Pro for excellent contrast ratio\nConnections: 2 HDMI (Rear) and 3 Component Inputs (1 Side/2 Rear)\nDRC MF-V1 (Digital Reality Creation MultiFunction V1) technology", "Name": "Sony Grand WEGA KDF-46E2000 46-Inch 3LCD Rear Projection Television", "ImgURL": "http://ecx.images-amazon.com/images/I/41KBP3VZZDL._SX300_.jpg", "ProductID": "B000G143P6"}}