{"Reviews": [{"Title": "Simply an amazing experience", "Author": "R. Hardy \"gearhead\"", "ReviewID": "R3LIUXPCQ1PY1S", "Overall": "5.0", "Content": "I've had this TV for a month. I purchased it from Vanns ( through Amazon ) for about $100 more than it is now. It was an amazing experience. I ordered it on a Thursday and it arrived in perfect condition on the following Monday via Yellow Freight. Even though it was only supposed to be \"curbside\" delivery, they put it on a dolly and brought it all the way into my residence ( that's were a little tipping doesn't hurt... ).I won't go into any technical details because the web is full of them. Since the proof of the pudding is in the eating, I can attest to the fact that I have never seen a better picture on any TV, anywhere. The fact that I can take an SD card out of my 1080p HD camcorder and play it back by inserting it into the TV just blows my friends minds!If you get this TV, make sure you break it in for at least 200 hours. Search for \"Plasma break in\" on the internet and follow instructions that you will find in the AV forums. This will help prevent possible \"burn-in\" that can happen if you leave a TV show or a video game running with a static logo or image on the screen for a long time.", "Date": "October 2, 2007"}, {"Title": "Best TV I've ever seen!", "Author": "Jeff", "ReviewID": "R86ZEM16O3FLB", "Overall": "5.0", "Content": "I purchased the Panasonic TH-50PZ750U Plasma television after doing exhaustive research using Consumer Reports, CNET, Amazon.com reviews, etc., and by staring at and comparing TV's at Best Buy, Sears, Tiger Direct, Fry's, etc. This is by far the best picture I have ever seen on any TV. I don't care what anyone says, plasma beats LCD by a mile. Everyone who has seen my new TV wants one for themselves. Usually, the first comment uttered is about what an amazing picture it has.I have Dish Network as my satellite provider and before ordering their HD package I wanted to see how well standard definition looked on my new TV. Let me tell you, the picture was so amazing I seriously considered not ordering the high def package because I figured what's the point. The picture was already beautiful; super crisp and clear with extremely deep blacks, and no trailing pixels like you see on the LCD's when there is a lot of movement on the screen. However, I figured with high def it can only get better so I went ahead and ordered the Dish Network package. The installers used one component cable and one RCA cable to connect the DVR receiver to my TV and much to my disappointment, the picture actually looked worse. The tech told me they were out of HDMI cables but if I replace the cables he gave me with an HDMI cable the picture would be much better. Although I think Dish is responsible for providing the correct cables, I was desperate to improve the high def resolution, so I ran out and picked up an HDMI cable. Once I replaced the cables with the HDMI cable I was floored by how amazing the picture looked. The HD picture blew away the already amazing standard def picture, which I did not think was even possible.The HD picture is so crisp and clear that it's like looking through a window. I watched Man vs. Wild and it seemed like I was actually riding along side Bear on his make shift raft.This TV will not disappoint! It has 3 HDMI inputs, one in the front and two in the back. The TH-50PZ700U only has 2 HDMI inputs, which is why I chose the TH-50PZ750U model. It also has convenient handholds in the back panel that make it easy for two people to carry. (It's fairly heavy) I was able to program the TV remote to control my satellite DVR receiver and my DVD player. I attached my Nintendo Wii and the graphics look very good although the Wii's graphics aren't anywhere near as good as a PS3 or an Xbox. My standard DVD player does not upconvert, however all of my DVD's look absolutely amazing. A Blue Ray player isn't even necessary, although it has made its way onto my Christmas wish list.I purchased the TV from Electronics Expo through Amazon. I received the TV exactly one week after I ordered it. It was shipped via EGL. (Eagle) The shipper called me one day prior to delivery to set up a drop off time. They brought the TV into my home and helped me lift off the top of the box to verify that there was no damage. The TV arrived in perfect condition and works flawlessly.I did not wall mount the TV as I have a nice entertainment center so I used the stand that comes with the TV. The stand assembly only takes about two minutes. (Just a couple screws and it's done) There are two metal shafts that fit into holes in the bottom of the TV and then two screws are ran into each shaft to connect the base to the TV. It's very well balanced and heavy so there should be very little concern for the TV ever tipping unless you live in an earthquake zone. (They include straps to connect it to the wall in case you do live in an earthquake zone.)One final thought, the serial number is required to register your TV, so before setting it up in a dark area or in an entertainment center, it might be wise to find it and write it down first. There is a very small black sticker on the right hand side of the TV with the serial number on it. If you purchase this model I'm sure you will be very pleased with your wise decision.", "Date": "February 24, 2008"}, {"Title": "none better", "Author": "R. S. Babb \"steve\"", "ReviewID": "R2SELXKWWNT7H4", "Overall": "5.0", "Content": "After many months reading about HDTV I bought this item.TV is the greatest.A lot of money,but when seen by myself and others,we all forgot about price.I bought this tv off Amazon,6AVE was seller.This dealer was great.Delivered on time,no damaged.", "Date": "October 18, 2007"}, {"Title": "Great TV, Superb Spearkers", "Author": "H. Suthar", "ReviewID": "R9T3TRCBBHN0", "Overall": "5.0", "Content": "Unless someone has extra $1500 to spend on pioneer, this is the second best TV. After researching for months, i came down to pioneer and panasonic 1080p TVs. And based on price, i choose panasonic. After setup, when first started it, i was sure about good picture quality, but completely blown away by terrific speaker sound.Right now i am just watching non-HD channels and standard DVD with Oppo DVD player. The kind of superb picture quality i am getting, I do not even feel need to go for HD channels or HD DVD.", "Date": "December 30, 2007"}, {"Title": "Panasonic TH-50PZ750U 50\" 1080p plasma HDTV", "Author": "L. King", "ReviewID": "RX01B7WHZKKJM", "Overall": "5.0", "Content": "I could not find this TV locally for a good price. I paid over a $1000 less on Amazon compared to what Best Buy - Magnolia Room is charging for the same HDTV.This is my second Panasonic plasma HDTV (my other is a 42\"). The styling is much better than previous models. I have not had the television professionally calibrated yet, but the picture and sound is outstanding.I highly recommend this HDTV over the even more expensive Pioeneer Elite. The picture quality is crisp and clean, while the video processor seems to have little to no lag time.", "Date": "January 11, 2008"}, {"Title": "Great TV", "Author": "Craig Matthews", "ReviewID": "R3CJLSOEQMRHHH", "Overall": "5.0", "Content": "Great TV. I waited a long time to get a Plasma and the price on Amazon (via 6ave Electronics) was too good to beat. Delivery was on time and in excellent condition. Even the HD DirecTV installer that came to my house was impressed with the picture.", "Date": "October 3, 2007"}, {"Title": "Highest rated", "Author": "ellieg", "ReviewID": "R3CXO0TWN7AT1C", "Overall": "5.0", "Content": "There is a good reason Panasonic HDTV are rated highest by the leading consumer magazine.  This set, out of the box, is incredible.  Easy to set up and we have not had to do any calibration.  Picture is clear and crisp; true blacks; no distortion.  Sound is so great we are delaying the purchase of a surround system.  Great price; shippping right on time.", "Date": "February 17, 2008"}, {"Title": "Beautiful Plasma", "Author": "Brett A. Yeater", "ReviewID": "R22N3I73TLB386", "Overall": "5.0", "Content": "This plasma is beautiful.  It seems very resistant (though I can't guarantee immune) to Image Retention.  Go through a 100 hour break-in of the TV.  Keep the picture on normal and make sure you always Zoomed using the Aspect button.  Do not use the 'vivid' picture setting for at least 20 hours, don't leave movies paused without turning off the TV.  If you are going to play a video game, wait until the break-in is complete AND set the picture quality to 'normal' to reduce the brightness and reduce Image Retention possibility.The clarity and beauty of this TV, once broken in, is absolutely spectacular!  Blu-Ray DVDs are crystal clear, HD Cable is great too.  Normal DVD's look very good as well.  The built in speakers are far better than I imagined they would be.  I was considering an auxiliary sound system, but the sound on the TV is so good, I decided I don't need one.For the price of this TV (<=$2500), you cannot find a better deal.  I looked at and compared the Pioneer to this one.  There are some very minor differences, however, not nearly enough to justify $1000 more for the Pioneer.  In terms of picture quality, I found little or no difference between the two.Highly Recommend this TV.", "Date": "May 2, 2008"}, {"Title": "Panasonic TH50PZ750U Plasma TV", "Author": "Michael G. Miler", "ReviewID": "R1922FILSNQELW", "Overall": "5.0", "Content": "This TV is everything it was touted to be. It was very easy to set up and with the HDMI connections the picture is excellent. I would reccomend the 50\" 700 or 750 model to anyone.", "Date": "April 28, 2008"}, {"Title": "Great Picture!  The Sound is Warbly during solid-colored screen transitions.", "Author": "Christopher", "ReviewID": "RPEAMOW8HX8YJ", "Overall": "3.0", "Content": "I tried resolving this [sound] issue with Panasonic to no avail.  From researching and trouble-shooting to actually chatting (during their business hours), I tried it all.  There are many references to this issue online; look it up first!  I've heard of a mysterious update or fix, but so far it's mostly legendary.  I doubt I will go down this street again when it comes to a big money ticket item.", "Date": "August 3, 2010"}, {"Title": "Great Panasonic Plasma!", "Author": "Loves Shopping", "ReviewID": "R1591FWLAIB5DQ", "Overall": "5.0", "Content": "This is a wonderful addition to our family room  We've had so many people over, for the Super Bowl, for example, and have a great time watching movies and documentaries.  It has added panache even to the election process.  Thanks for a great product. It is everything we hoped it would be.", "Date": "February 6, 2008"}, {"Title": "I love it!", "Author": "D. Wisner", "ReviewID": "R1KXU11TBYE8WW", "Overall": "5.0", "Content": "What more can I say?  Everything from the ordering, shipping, to the end product was a great experience.  I did a bit of research before making such a large purchase, and it was worth every minute.", "Date": "April 7, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p HD Plasma Panel (1920 x 1080 pixels)\nPro-Setting & Studio Reference Modes\nAnti-Reflective Coating\nMax. 5,000 : 1 Contrast Ratio\n3 HDMI inputs (1 front)", "Name": "Panasonic TH50PZ750U 50-inch Plasma Flat Panel 1080p HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41ni%2BgCM46L._SX300_.jpg", "ProductID": "B000SG3DDM"}}