{"Reviews": [{"Title": "Sharp TV", "Author": "R. Freese", "ReviewID": "R1FBGZ4XG98YEU", "Overall": "5.0", "Content": "When the old TV died, this one had the best review / price ratio.Have not been disappointed.  Good TV,  Good Picture. A whole lot less money than some others. Have only had it a comple months so reliability is unknown.  Sharp has moved itself ahead of Panasonic, Toshiba and Sony on my personal approval list.", "Date": "September 9, 2007"}, {"Title": "4 out of 5 stars", "Author": "Eric Bush", "ReviewID": "R1MLM7BCO4DCKP", "Overall": "4.0", "Content": "This television is nice if you need to save space.  I have limited space and needed room behind my tv to set speakers.  However, the picture is not as clear as I had anticipated.  Besides that, it's a nice set.", "Date": "September 10, 2007"}, {"Title": "Beautiful for Digital", "Author": "Edward M. Monchak \"rtstuff2\"", "ReviewID": "RTXQN6ZIW8SQZ", "Overall": "5.0", "Content": "For a change I didn't buy this TV from Amazon, got it at a small USCG exchange.  The good - It has a beautiful digital picture using an antenna, I actually pick up 64 digital channels with an unpowered antenna here in Florida. It also aquires analog signals fairly well but who cares they're going away next year anyhow.  The sound is pretty good, not at all tinny.  Nice easy to use menu, switchable display ratio from 4:3 to 16:9 letterbox format for digital viewing.  Has a sleep timer, V-Chip, color temperature setting and all the standard stuff. Uses only 60 watts power.  The bad - no HDMI input, but does have component level, S-video and standard video inputs and it has digital audio output.  For the price you won't go wrong on this nice little set.", "Date": "April 26, 2008"}, {"Title": "Fantastic Value", "Author": "S. J. Northrip \"SamN\"", "ReviewID": "R3KMAPCMPMHN", "Overall": "5.0", "Content": "This is really a neat TV. Fits in an amoire and the footprint was only a bit taller than a much smaller screen TV. Have it hooked up to UVerse and the picture and sound operate optimumly. Paid $299 at Best Buy two weeks ago. Sharp has excellent quality, and when it's time for HDTV will definitely consider the Aquos. Noted one reviewer said the sound was tinny. Not so with mine. The sound in fact is quite good. The more I think about the price the sound is even better!!!", "Date": "February 10, 2008"}, {"Title": "Good all around LCD flatscreen TV", "Author": "Thomas N. Gilmore", "ReviewID": "R17PQWH7V3GE3T", "Overall": "5.0", "Content": "This is a great TV for a small bedroom or office area. I paid $350 for it after barginning with the salesperson when I bought a Toshiba 37\" set for my family  room. The discounted price in the store was $399.", "Date": "April 19, 2008"}, {"Title": "Poor Sound Quality", "Author": "D. Davis", "ReviewID": "R3S4RWZFS426E", "Overall": "2.0", "Content": "The sound quality is so bad you feel like you're listening to something out of a tin can.  The picture is great, but the sound is hard to overcome.  The audio is digital dolby - not stereo.  We are going to return it and pay the 15% restocking fee for something with better sound quality.", "Date": "November 27, 2007"}, {"Title": "Great 2nd TV if you understand what you're buying", "Author": "bartlabs", "ReviewID": "R1W2EC8FH7G502", "Overall": "4.0", "Content": "I wouldn't recommend building your home theater around this unless your needs are basic, but it's a great TV for the money.  This set is ideal when your video sources are primarily standard def in 4:3 format, such as from a basic cable or satellite set-top box, but you don't want to buy something that's going to be obsolete right away.  If you're thinking about buying this you should understand that this set can handle HD signals (over the air local channels or component input), but the picture isn't full HD quality.  Audio from built-in speakers isn't great, but it does have a digital output.", "Date": "August 9, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "20\" LCD TV\n500:1 Contrast Ratio\n4:3 Aspect Ratio\nHeadphone Jack\nComponent Input: 480p Progressive Scan - x1 Composite Input x1 S-Video Input - x1 Digital Audio Output - x1 Analog Audio Input (L/R) - x2", "Name": "Sharp LC20SH7U 20\" LCD EDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41HtSVyJNUL._SX300_.jpg", "ProductID": "B000OH1NLO"}}