{"Reviews": [{"Title": "Wish I had bought this one...", "Author": "RC", "ReviewID": "R2RS8B73PFIMQK", "Overall": "5.0", "Content": "I researched the 81 and 71 series for as long as they had been announced (~ 6 months, since CES show).  I got all hopped up about the \"100k\" contrast ratio on the 81 series due completely to the new \"LED\" backlighting.  Well, at AVS forums, one guy bought both, and concluded that it only mattered when the screen was totally black (like the black bars on the top and bottom of the screen when watching a wide screen formatted movie, or a fade scene), and then only a little.  The general conclusion seemed to point to the 71 series being the sleeper hit so far this year (dunno about the xbr5, but some reports put this one right with it), and that the 81 series wasn't worth the extra grand or more.Too late for me, because I rushed into BB to pay up front for an 81 series tv as soon as the store had the sku in their system (4 weeks before they even showed up).  Yeah, I got to use a 12% off good customer coupon, but in the end I could have had a 52\" 71 series instead of a 46\" 81 series (especially seeing how heavily discounted they are now on Amazon).  The anti-motion options in the 81 are only available in \"movie\" mode, and are buried in the menus, and only has an on/off option, versus the 71's easy to navigate 3 level options for the anti-motion feature.The reviews point to the colors and picture appearing just about the same between the 2 tv's when the screen or a large portion of it wasn't all black.  Other than that....get this one.  It is worth the premium over the 61 or 65 series.  As long as you can live with a glossy / semi-glossy screen (versus the xbr4/5's matte screens), you won't be sorry.  As for me, I'm wondering if I should bite the bullet and be one of those turkeys who uses the 30 day guarantee to return the TV and get a 71 series...it is a lot of money not to be totally satisfied with the purchase.  Best of luck.", "Date": "September 6, 2007"}, {"Title": "One Word - AWESOME !!!", "Author": "Timo \"T\"", "ReviewID": "R39L8LMP9OKJUN", "Overall": "5.0", "Content": "I have literally waited years for an HDTV with all the right specs (120Hz, 1080p, high contrast, 3 HDMI (1.3) inputs, x.v.Color, etc.), but finally it's here, and the long wait has been well worth it. It is simply awesome.I was very tempted with the Sony XBR4, but this one beats the Sony hands down on looks, contrast, clarity and especially price! The many features it has and the specifications it supports are probably hard to find in terms of signal input (such as hi-definition programming or discs that are available now), but I wanted to be relatively future-ready. Both the screen and the edge around it are highly reflective, so if this would bother you, or you have light coming from behind you as you are watching, this one may be too shiny for its own good. I was initially worried about the reflection, and I don't quite understand why the bezel around the screen itself has to be so shiny as well (maybe to match?). Having said that; the \"glossy\" screen makes this LCD TV look like a high-end plasma screen, and it is probably going to compete with the best plasma's out there. The contrast is simply incredible, and the light output was so bright that I had to tone down the brightness setting, and increase the energy saving mode.And this is exactly where personal preference comes in. You may see this screen in a store where it is cranked way up for certain settings, and you may not like the contrast, brightness, or color. There are - of course - ample settings to play with and it is quite possible to \"dial in\" what you like best. So don't be disappointed in the store, and don't give up on this Samsung just yet - give it another chance by trying one out at home. Just as you need to select the proper viewing size, so that everything looks normal and not too stretched or squeezed, the color, contrast and saturation settings need to reflect a normal picture. And then there are settings (like the x.v.Color) that will do injustice to the image, if the input signal does not utilize this color-space.There is a now (in-)famous blue Samsung light on the bottom of the screen that can be set to be on when the TV is on, or on when the TV is off, or always on, or always off. Using an HDMI connection, turning the TV off also turns our connected receiver off, and vice versa. You can name each input on the TV with a specific name-tag, such as DVD, game, and so on. The few \"bad\" things that I have noticed are blurry contours of fast-moving subjects (when you look close) or occasional slow frames / jumpy picture for a short time. These may be due to processing by the TV, may be due to incorrect settings, may occur already in the players or may actually be in the (compressed) signals itself. These problems have occurred watching blu-ray movies using a Sony PS3, and DVDs on the PS3 or on a Pioneer DVD player. Not a super big problem, but it is something I keep noticing and worrying about. Our one & only PS3 game so far looks fantastic, and I haven't noticed any movement issues while playing that. I was also very worried that standard DVD's and our home-made picture DVD's would look relatively bad, but they are still OK to watch and they look absolutely fantastic on this new TV as compared to our old one. With the TV set to 1080p, I do not see a clear difference in a DVD signal put out as 480p compared to the same DVD signal up-converted to 1080p by a pioneer DVD player or the PS3. If anything I would say the PS3 looks better. There is definitely a tremendous difference when you look at something on DVD (up-converted to 1080p) and then look at the exact same footage on a blu-ray disc (both played on the PS3). There is so much more detail that it puts a lot of the blogs and discussions (about seeing a real difference with 1080p or not - on a 40 inch screen) to shame. See the 2 images of Planet Earth footage I have also posted. The pictures were taken from about 9 feet away, using a tripod. The DVD was set to up-convert to 1080p. TV settings were exactly the same for both images.We're not using the sound of the TV itself, so I cannot comment on that at all.Pros: 3 HDMI (1.3) inputs, super clear panel, INCREDIBLE clarity and color; a great system with lots of hi-tech specifications.Cons (all relatively minor):Highly reflective screen (although this makes the picture quality awesome!).Highly reflective edge. When the TV is off, the reflective screen is bad enough, but with the shiny edge it can look really bad.No \"name tag\" for HD-DVD player or Blu-ray player in the menu list to assign to HDMI input (very minor point - I agree - and may be fixed by future updates?).In short - look no further. This is the one you want.This is a review of the Samsung 4071F.The following products have also been mentioned and are also available from Amazon:Sony Playstation 3 (PS3)Planet Earth", "Date": "October 10, 2007"}, {"Title": "four and a half stars really", "Author": "Ryan H. Smith", "ReviewID": "R2C27R0R4NQAZA", "Overall": "4.0", "Content": "i do very much like this set. i think it has the best picture of any lcd out right now and i do mean compared to the sony xbr4/5, toshiba regza cinema series and the sharp aqueous models. for the money it cannot be touched and in absolute terms only a pioneer kuro is going to give a better image.if you are a moive watcher like i am then beware of using this set with bd and hd dvd players at 1080p/24. the resulting image is pretty, but frame drops and a slow-motion like effect aare very common. you will need to run at 1080i/p/60 to get a smooth image. the reason is that this set is actually 1080p/30 and the translation of the differeing frame rates is poorly implemented. many people do not know about this b/c they are using 60 field based sources and think everything is fine. i have tried the following on 3 different sets and the negative effects mentioned above happen every time. here's how to duplicate this issue:set the TV however you want (amp on or off makes no difference)set the hd dvd player or bd player to 1080p/24use an hdmi cableput in a movie that is 1080p/24 (pretty much all of them)turn on the player and tv and play the movie.you will see stutter, frame drops and slow motion on and off. sometimes it's REALLY, REALLY bad, other times it'll last for 2 seconds.aside from this warning, i do recommend the set because it's got an excellent picture, is well built and should offer years of great use. i suspect samsung will fix the issues i mentioned above if enough people call them.update: i called samsung and a level 3 (the highest level) tech said they know about the issue i described and are wokingon a firmwre fix. when it will arrive he coul not say, but he said it will arrive for sure.a great set and one i recommend.", "Date": "November 12, 2007"}, {"Title": "Nice But.", "Author": "T. J. \"Tom\"", "ReviewID": "RZLEVMJGOQUT6", "Overall": "5.0", "Content": "I did a month of research before buying this HDTV. I just received it yesterday. I rate it a 4.5 out of 5. I'm not disappointed. The number of ways to connect other components to it is incredible.. 3 HDMI, 2 Component, a VGA and even a USB input. It even has 2 coaxial style inputs for cable TV AND off air antenna. The picture quality is nice but there is some pixilation on fast action even with the 120Hz refresh rate (but better than a 60Hz LNT4061) .  There is no perfect picture HDTV yet; at least that is true to the discerning eye. Analog TV still rules for fast moving action scenes and will be for years to come even after the analog broadcasts are shut down in 2009. I'm really a picky sort of person though and even with that, I think this TV is superior to the Sony, Toshiba, or Sharp. It all depends on what your particular eye sees so buy the TV that you find pleasing to your eye. For me, the other contenders were the Sharp Aquos R-Series 42\" 120Hz (LC-42RX1W) and the Toshiba REGZA 42\" 120Hz (42LX177). I really don't think I would have done wrong if I bought either of those either. I just happen to like the looks of the Samsung picture and the cabinet style the best.  The Sony Bravio was nice too but I saw two at different stores that had LCD flaws so I decided not even to risk it (both had a line through the screen starting at the left side and then fading to the right that was only visible on certain TV pictures; it was as clear as can be at times and was very annoying)..A few things worth noting about this Samsung. These are negatives but don't think that means I don't like this TV, it's just that it has so many positives, it's much easier just to list the negatives and I think these issues are worth mentioning:1) Remote control needs to be pointed at the TV or it will not work. This surprised me as I thought all TVs (other than the no-name brands) had excellent remote control functionality. It will control other things like your cable box and such but I haven't checked that feature to see if the remote works better with other equipment. I verified this poor remote sensitivity at the store later and found that it's not just my unit.  You have to aim it at the TV for the remote to work.  This compared to my older Sony which I can point in the opposite direction and it will still work. Don't get me wrong, I've had worse in earlier AV equipment, it's just not up to par with modern AV equipment as far as sensitivity.2) Only one tuner. For the picture-in-picture, it is only analog, not digital.  That is, you need a second source for PIP and even when you have a second soruce, if you dicide to have the second source on the main screen and use the Samsung tuner as the PIP, it will only work with Analog TV (not HD or Digital). ALSO, you have to navigate through a menu to turn on the PIP each time, i.e., it's not just a click on the remote (like it is with the Sony). Not much thought was put into the Samsung PIP feature at all.I will mention one outstanding feature that I think deserves it above all others since it's not a topic commonly discussed. It has a fabulous ATSC tuner. I have another HDTV that I installed in my motorhome two months ago. It's a smaller (15\") Toshiba.  It also is a 2007 model. I thought it had much better digital over-air reception than my older ATSC tuners but this Samsung even blows that away. The digital over-air reception has no freeze frames at all (so far) and I now get all networks in digital over-air here at home (Kirkland, WA). This compared to an older ATSC set-top box I have that would only pick up steady reception on a clear day with no wind and did not get all the network digital channels. I live amongst huge trees. Digital TV off-air is something I thought I'd never be able to receive reliably.  With this TV, I get it, and get it reliably. It's windy today too and still not a blip on the TV like I would have with my other ATSC tuners. With that said, I have no idea how good the other ATSC TV- tuners are of the TVs I've listed as contenders in this same class. They may be just as good but they certainly can't be better at least from my perspective.Edit 11-15-07Now after having much more time to view this TV, I've seen many imperfections in the picture. I found that there is an annoying attribute with certain screen scenes that I can only explain as a triple shadow effect when the 120Hz motion is active. I was able to reproduce this at a scene of a movie over and over again by rewinding then playing again with and without 120Hz active. Before I was able to confirm this I thought it was the HD input but now I am positive it is the TV only when 120Hz is active but less so in the \"Low\" setting.  I highly recommend that other owners confirm this issue.  It is illusive and to some it may not be a bothersome problem. The best type of scene to clearly see this issue is a scene when a book is being open focused on the text of the page.For a fine example, watch Casanova HD; half way through the movie there is a Scene when Casanova is going through someone else's notebook while the other person is in the other room. Watch when scene pans to the front of the book and he opens it. As he opens it, there is a triple shadow of all the text in the notebook. If 120Hz is turned off, the shadow is gone and it's a perfect picture during this same scene. This happens in a lot of other instances of any HD video, but more subtle. I would now rate this HDTV a 3. It certainly does not deserve a 5.  I cannot change the 5 star rating in this edit feature so I'll leave it as is.", "Date": "November 11, 2007"}, {"Title": "Great Value - Great Picture", "Author": "G. Troutman", "ReviewID": "R6WH3K7DSIY72", "Overall": "5.0", "Content": "UPDATE: January 11, 2010Just a few weeks past two years of ownership and just in time to increase my spending for Christmas 09 - my Samsung stops working. No picture, no sound, just a clicking from the circuit board that NEVER STOPS; had to unplug the unit to silence it. Sudden stoppage, too, with perhaps 3 seconds of warning via frazzled picture before the end.Sumsung's consumer web site and hot line personnel weren't of much use for the repair since I didn't buy the extended warranty. They both directed me to a repair facility 2 hours away which refused to travel to my town to work on it and discouraged carry-ins. If you don't have a warranty and you're not living in a top 50 metro area you're going to have to use local talent to fix one of these.The good news is that a local repair shop sent a tech out who fixed the TV in less than an hour. The problem: capacitor failure. According to the tech, most LCD and many plasma TVs were built with what his company considers substandard capacitors. When they replace them his company uses higher quality parts than OEM and he assured me they rarely had recalls for \"cap\" problems on the same TVs. Six capacitors and some soldering later, I'm back in business.The BETTER news is that even after two years of developments in TV technology, I STILL receive raves on the picture and sound quality of this TV.  Even the repair tech was impressed and he sees all brands and types in his work!OK, so it cost me $275 for in-house repair. I'm not happy about that - but I'm still happy with the viewing experience from this TV, and I still haven't seen anything in the stores that make me want to dump it for something better.Samsung LNT4071F 40\" 1080p 120Hz LCD HDTVAfter waiting for years for that elusive HDTV with the most compelling mix of features, quality and price - here it is, at last! Some of the other reviewers pointed out a number of flaws with this unit, from the shiny screen and case to the ditzy remote to the 120Hz hijinks, etc. They're absolutely right, I admit: it's not perfect. But if you wait for the perfect set you'll spend many more months searching for it - months that you could have spent enjoying yourself watching THIS unit.The picture quality is better than many plasma sets I've seen in friends' homes and in store displays. The contrast level is incredible for an LCD,  displaying shadows that look like shadows, while still retaining the details in the dark areas. The range of video controls gives you quite a depth of control over the picture quality, and the unit even remembers the last video setting for each input, separately, so that you don't have to readjust when you change from cable to DVD to air antenna to PC to satellite to USB, etc. down the list of more inputs than most people will have reason to use. The unit has excellent audio for a TV, especially after you take time to tweak the many available sound options. The screen even physically swivels 20 degrees in either direction for optimum placement!I've had mine for two weeks, and I'm still amazed at the quality of the total package: picture, sound, connectivity options, menu setup, physical appearance. I've spent several hours, yes, tweaking the video settings to my personal preference, but the Samsung setup menu is easy to follow and provides a huge number of options as I noted earlier.And that's what I believe to be the source of many of the complaints - people are used to the mature technology of analog TV, with everything standardized to a comfort level of bland conformity and very forgiving of all but the most extreme signal errors. Digital TV's high res displays showcase the flaws from all the odd inputs and off kilter signals that were masked on analog sets. Until all input sources provide a consistent, high quality video signal calibrated for digital displays, the better digital sets will have to offer many adjustment possibilities, and digital set owners will have to frequently interact with their sets to adjust out those flaws. You have to work for that great picture!Maybe a few years after the 2009 move to all digital is complete most content providers will take more effort to deliver an industry standard, consistent and quality signal. Until then, buy this set and have one of the best pictures you can finagle from an LCD.", "Date": "November 19, 2007"}, {"Title": "The Best TV I've Ever Had", "Author": "David W. Chace", "ReviewID": "R2DQ6PHBW94E4Q", "Overall": "5.0", "Content": "I saw one of these at an electronics store and was impressed with how far the technology had come, as I'd been visiting the store and looking at the latest 40\" 1080p Samsung LCDs for over a year.  This was the third model they put in that display slot in the time I had been keeping track.The TV was for my bedroom so I had been thinking a smaller 37\" model would be more suitable, but I had never actually seen a 37\" 1080p TV in a store.  As it turned out 40\" was just about right, although a little bit wider than I would have hoped due to the built in speakers.  Maybe my eyesight isn't what it used to be, but sitting about six feet from this set I find that a 40\" diagonal isn't too big.When I first saw this model at the store, and read about its new 120Hz refresh, I knew it was finally time to stop window shopping and buy my first 1080p television.  So I went online and found it at Amazon for about $500 less than what the store was charging, and I ordered.One of the first things that impressed me about the set was how well it handled regular low-definition television broadcasts.  Looking closely at the screen I've never see any of those squarish scaling artifacts that I've sometimes seen with other LCD TVs displaying an image at less than the native resolution.  So when I watch regular low-def TV channels I see only the image that was intended, and I see it as clearly as possible.Where this set really shines, however, is at 1080p, so shortly after buying it I got myself a Playstation 3, an HDMI cable, and a couple of blu-ray disks.  Final Fantasy: The Spirits Within and the BBC documentary Galapagos both look fantastic in 1080p.  This is beyond what was possible with any television I've ever owned before, including the 1366x768 Sony LCD I bought just a few years ago.The audio on this TV is perfectly good as far as my ears can tell, but I'm more of a visually oriented person, so I can imagine that some people might want to pair it with a set of 5.1 speakers for the ultimate high-definition theater.The remote is fine, and probably has more functions than I'll ever use.  Basically I just programmed the TV and customized its display mode when I first set it up, and I don't expect to mess with it too much in the future.  I find the favorite channel button useful for quickly returning to the channel that allows me to watch using my VCR and its tuner after channel surfing.The picture size button lets me choose zoom and aspect ratio.  I rarely have to touch this button as I keep it on 4:3 for regular TV and 16:9 when watching blu-rays or DVDs through the HDMI.  Occasionally a TV channel will show a program letter-boxed and then I sometimes zoom the picture to fill the screen, but that's the only time I've used it thus far.  I've seen other TVs that have a mode that expands a 4:3 picture to fill a 16:9 screen by stretching the edges of the picture so that the center does not become distorted.  I haven't found anything that fancy on this model, but I'm perfectly happy with the 4:3 mode for regular TV.As far as the 120Hz refresh that sold me on this product?  As far as I can tell it does exactly what it's supposed to and makes movement real smooth.  But I figure the human eye can barely distinguish events that occur within 1/60th of a second, so I imagine that the visual difference between a 60Hz refresh and a 120Hz refresh is actually fairly subtle.To sum up, this is by far the best and most capable television I've ever had.  I suspect that just about anyone who wants to watch either regular or high-definition content will be satisfied with it.", "Date": "November 11, 2007"}, {"Title": "Great set", "Author": "HailAlmaMater", "ReviewID": "R3GQWBL1U345JF", "Overall": "5.0", "Content": "I looked at a lot of LCD TV's and generally was not happy with the \"blocks\" that appeared when watching sports or when fast movements showed on the screen.  I checked out some of the 120Hz sets, and the picture of the Samsung and Sony XBR seemed the best.  The kicker was when I saw the Samsung advertised for $1699 at Fry's, after seeing it for $2699 at Best Buy.  Well, 2 hours later, with ad, Best Buy price matched and gave me 2 years no interest financing.  That was just too good to pass up.My prior TV was not able to show HDTV (no tuner).  I plugged in the coax to the TV (I have no box from the cable company), and now have all the networks and PBS channels avail in either 720P or 1080i - my god what a difference.  I was watching the Ken Burns World War 2 program in 720P and couldn't take my eyes away.  In fact, I'm watching PBS much more now just because of this TV.Have a upconverting Denon DVD hooked to this device and the picture looks great.  It does 720P or 1080i upconvert, but 720P looks better to me.  I tried setting the 120HZ AutoMotion at the different levels while playing movies, and it gives the movie a bit of a video game effect, esp. those with lots of special effects.  High is too much, but at low its actually pretty nice.  With sports, it seems low works fine.", "Date": "October 19, 2007"}, {"Title": "The LNT4065F is a better value", "Author": "Matt", "ReviewID": "R2HSLQ05ELNJ3E", "Overall": "4.0", "Content": "ORIGINAL: Just my opinion, but I think the LNT4065F is a better value right now (as of 02/2008) until \"true\" 120hz LCD HDTVs are widely available in the US.  This TV has a beautiful picture but why pay the extra money for 120hz when it cannot due 5:5 pulldown of 24p sources and can cause the Triple Ball Effect.  The 120hz is a useless feature unless you have a true 120hz source input.  Sources that are not 120hz (such as 1080p24 or 1080p60, ALL Blu-Ray/HD-DVD MOVIES) can be \"distorted\" by the interpolated frames causing the appearance of ghosting/shadowing (Casanova HD notebook scene).  Because there are NO US LCD HDTVs that currently support 5:5 pulldown (and I have checked extensively), I am buying the LNT4065F for now and will buy a new model 52\" or 57\" once the 120hz and LED dimming have been perfected in a year, moving the 40\" to the bedroom.EDIT:[...]Just read forum.blu-ray.com and after a professional review, it has been determined that the statement in the product manual \"disabling the Auto Motion feature results in 60hz\" is incorrect; this HDTV always functions at a native 120hz.  This HDTV CAN perform accurate 5:5 pulldown of 24p content IF AND ONLY IF Auto Motion Plus is set to off.  I now amend my review to state that this HDTV can be worth the extra money for the videophile film purist if you leave the Auto Motion Plus feature off (at all times).Please note: this is NOT necessarily the case for the 81F series (LNT5281F) as the internal circuitry differs and there are conflicting reports.", "Date": "February 13, 2008"}, {"Title": "Impressive Display with a Few Quirks", "Author": "E. Dahl", "ReviewID": "R2PS27G1Q9VT6J", "Overall": "4.0", "Content": "I've owned a 4071 since November, and I'm very happy with it overall. It's generally a beautiful display, but a few small quirks keep it from being perfect:1. On small objects moving horizontally, you'll occasionally get a \"triple ball\" effect, where ghost images of, say, the football or baseball you're watching will appear ahead of and behind the object. This occurs even when the 120Hz feature is turned off on my set.2. Shadow detail is lacking in extremely dark scenes. As long as there's a bright object or two on screen, you're fine, but if the entire frame is dim, it's very hard to achieve an appealing picture. Things get muddy. I've seen this result using a variety of sources, including a DVD player using component inputs, Comcast HD cable on component and later using HDMI, a Mac Mini connected to the PC input, and an XBox 360 using HDMI.Apart from those issues, I'm very happy with the display. colors are bright and vibrant. Contrast is very good. Menus are sensible and very easy to navigate. The 120Hz option is nice for live sporting events, but not something you'll want to use on movies, as it lends them a distracting, artificially smooth look.", "Date": "January 14, 2008"}, {"Title": "Waiting for replacement TV... will post a revised review later", "Author": "Centrare", "ReviewID": "R3P90NX2DN6RI1", "Overall": "3.0", "Content": "I've had my eye on the Sony 40\" XBR4 since January.  The prices have been all over place and lately have been much higher than when I first started shopping around online.  I went to Best Buy to check to do a visual comparison of the XBR4 vs 4071.  I was impressed with the image quality of the 4071, so I placed my order here on Amazon.  A couple of days later, I noticed that I had not taken advantage of the free Samsung Upconverting DVD player, so I called customer service and after a 15-min conversation, a free DVD player was on its way to me.  I hope to purchase a blu-ray player in June!Both products arrived within two weeks.  The CEVA delivery guys were very friendly and set up my TV and attached directly to the cable.  Within a few minutes, I had lots and lots of channels, many of them HD.  I was very happy with the picture quality.  I went out and rented a few videos and the DVD player worked great.  Well, I had a dinner party this past Monday night.  I decided to put an MP3 CD into the DVD player (which I'd done before and it worked great).  The music had been playing for about 3 hours and one of my guests wanted to see the picture quality of the TV, so I picked up the TV remote and pressed the \"source\" button.  The TV channel displayed for a few minutes and then the TV went black.We went through the troubleshooting procedures in the instruction book with no luck.  After my guests left, I unplugged everything and I tried to get the TV to come back on.  There was power to the TV because the blue light was glowing, but all I got was a clicking sound and red flashing lights on the lower right indicator panel.  I did some research on the web and I think there is a problem with the power panel.  I called Amazon the next afternoon.  They directed me back to Samsung.  The Samsung person told me that because I purchased the TV online, they would not service it and she directed me back to Amazon.  So, I called Amazon and the agent apologized for the problem and said customer service was backed up and someone would call me the next morning.  Well, yesterday no one called me, however, when I checked my email this morning Amazon had already shipped me a new TV.On the one hand, I'm thrilled that the problem is being resolved.  On the other hand, I'm wondering about the power panel problem along with the Samsung DVD player.  I had pressed the \"source\" button several times before the night of the dinner party and had no problem switching back and forth.  Once my new TV arrives, I will update this review and hopefully give it 5 stars.COMMENTS ABOUT THE TV:  I like the favorites button on the remote but wish it could be more prominent.  It's buried at the bottom of the remote with a bunch of other buttons.  Sometimes the commercials seem louder than the programs even though I've turned the \"volume control\" on.NOTE:  Be sure to read about Amazon's Post-Order Price Guarantee in the HELP area.  I check the price of this TV on a daily basis.  To date, Amazon has issued 3 price guarantee refunds. I still have 8 days left -- unless they now honor the new ship date for the replacement TV. Requests must be made within 30 days of the item's shipment date.  Overall, my customer service experience with Amazon has been excellent!", "Date": "May 15, 2008"}, {"Title": "I LOVE IT!", "Author": "Ryan Madsen \"Super RY\"", "ReviewID": "RU7DXCFYMFSTE", "Overall": "5.0", "Content": "I bought this tv in early October.  I could not be happier.  I bought it after weeks of research and price comparison.  This tv has everything that I was looking for (120hz processor, 1.3a HDMI, 1080/24p).  I have no complaints,and nothing but wow's from friends and family.  The Blu-rays look absolutely amazing!  I never seen anything like it.  Some reviews complain that the 120hz is sometimes jittery.  They just don't know how to operate their tv's.  The anti-blur feature has 4 settings.  High, Medium, Low, and Off.  What people don't understand is that when you select the OFF feature the tv still runs at 120hz.  It just disables Samsung's anti-blur technology. I usually keep mine in the Off or Low settings.  Putting it in High mode actually give the picture a 3-D effect.  It's weird.  It makes movies look like the actors are on a stage performing right in front of you, kinda like you're watching a live play.  Bottom line, if you're watching Blu-rays or Hd-Dvd, this tv is a must.  HD channels look incredible, and the tv is small enough that standard channel look great too.  My only worry was that this tv would be too small, but its perfect!  And if/when I do decide to get a larger tv, when the technology improves, this tv will be perfect size for the bedroom!  Buy the LNT4071F, you will NOT be disappointed!", "Date": "December 21, 2007"}, {"Title": "Amazing!!!!!", "Author": "Gustavo Alvare \"DjSkIbS\"", "ReviewID": "R3FCJF81S0LQ8R", "Overall": "5.0", "Content": "I just received this tv 2 days ago. I ordered it with the free shipping from Amazon and I received it 2 days ahead of time. Service was great and no problems what so ever. As far as the 4071 LCD, I don't think I have enough words to describe it. The quality is incredible. Picture is amazing with directv HD 1080i and 1080p Blu-Ray is amazing. This tv has a lot of different settings for the type of picture you need and it is just perfect. The 120hz feature is great but only when necessary. It's so powerful if you put it on anything more than low the image looks like an animation. It is great for watching sports because it reduces all the blur. I don't recommend getting anything bigger than a 40\" for a room because my room is big and the tv looks huge. It has all the connections you would need and the 25,000:1 ratio is incredible. I have been watching tv for hours now and still can't seem to concentrate on what im watching because you get too busy observing the quality. I don't know what else to say, there is no other tv that can compare to this one at the moment except for the 4081 and it is not that much of a difference as some people may think. Don't think twice about purchasing this tv and the price is great also!!!!!", "Date": "November 8, 2007"}, {"Title": "Great TV with even greater potential with firmware update.", "Author": "TNT", "ReviewID": "R5MDOYJD1UW89", "Overall": "5.0", "Content": "This is a review of the 4071 which I bought at Amazon, and I will have a separate section at the end which addresses my experience with Amazon.Why I chose the 4071:I wanted something for my bedroom and since my viewing distance was close, I wanted an 1080p set as I CAN tell the difference between 1080p and 720p at that distance.  I didn't consider Plasma because of burn-in and size.  It basically boiled down to the SONY 40\" W3000 and the 4071.  I originally bought the SONY as I am a BIG SONY fan when it comes to video.  The SONY in retrospect had a slightly sharper picture, but I was more impressed with the 4071 overall even compared to the XBR4, especially the blacks.  Blacks look black on this set as opposed to dark grey.  I originally went with the Sony because it was cheaper, but when the set I bought had dead pixels and Amazon had a similarly low price plus a Harmony remote, I went with the SAMSUNG.When I was shopping for HDTVs, I would go to many stores to look at sets.  One thing I would do is look at the picture quality of the sets without paying attention to the models or manufacturers.  After seeing hundreds of sets, I noticed that I kept preferring the Samsung sets, especially the 71 series.  One thing in particular which caught my eye was one of the Pirates movies on a 4071.  It was stunning.  It somehow had a more 3D look to it compared to all the other sets.  ALMOST as if you were looking out a window.  It is like the ONE girl who stands out from across the dance floor.  I would later find out that the reason the set looked so good was largely due to Auto Motion Plus or AMP (More on that later).  So, I took my family to look at HDTVs, and everyone felt that the 4071 looked better than the other sets, including the XBR4.  Even my spouse who does not care much for these things was impressed.Now about the Auto Motion Plus.  AMP is Samsung's take on the 120Hz technology which doubles the screen rate of conventional TVs.  You may have noticed at some stores, they have a demo of AMP with one half the screen with it turned ON and the other half turned OFF.  I would stand there and watch this demo and I really didn't understand what was so great about it.  I didn't notice much of a difference between the two sides.  Well it turns out, that the reason I didn't see a big difference is because on older sets with older firmware, the AMP effect is not totally turned off EVEN WHEN SET TO OFF.  So, what I was actually seeing was a comparison of AMP On to Amp Off but ACTUALLY ON LOW.Now AMP has its share of fans and critics.  Some think that it looks like a Soap Opera.  This is because people are used to film at 24 frames per second.  Now if you ask me, I prefer the Soap Opera effect as I feel the closer to real life, the better; and real life has infinite frames per second.  Now AMP is not perfect.  Most notably, it has what's popularly known as the Triple Ball Effect (TBE) and stuttering.  TBE is an artifact that is seen when an object such as a ball, travels across the screen at high speed.  The ball looks like three balls instead of one, due to the nature of the way AMP processes the image.  Honestly, I rarely see this and when I do, it doesn't bother me much.  Now stutter on the other hand bothers me very much.  Stutter is when the picture pauses or jerks, in succession.  When I first got my TV, this happened very rarely and only when AMP was turned on to Low, Medium or High.  It did not happen when set to Off (AMP was still on, albeit at a level lower than low).  TBE happened on all settings.  Now, Samsung came out with a new firmware update (v1013.1) which was supposed to fix TBE (at least on OFF and LOW) so I installed it.  With the new firmware, the AMP is really off when off and therefore exhibits no TBE or Stutter.  So everything should be fine right? No.  What happened was that the picture quality got dramatically worse with AMP off.  That picture that so impressed me when I bought the set was gone.  It turns out that AMP actually makes a VERY noticeable difference in picture quality.  Remember that split screen demo I mentioned before?  Well I ran it again, and now the side with AMP ON looked FAR superior to the side with AMP OFF.  So, I turned the AMP on LOW to watch TV and Blurays.  Now, the stuttering was worse than before!  So I called Samsung to ask for the old firmware so that I could switch back.  However, they DO NOT have the older firmware for downloading.  So I'm stuck with either watching with AMP OFF (which still looks pretty darn good) or AMP LOW, (which looks AMAZING but hiccups every once in a while depending on the source material.THE GOOD NEWS is that SAMSUNG is aware of these problems and is working to fix them in a future update.  The other thing is, NOT ALL SETS EXHIBIT THESE PROBLEMS.  Some sets seem to stutter more than others, while some don't stutter at all.Other things I like about the set:I like the touch sensitive power switch located by the blue light.  By the way. the light can be selectively turned on or off (On always, Off always, On when set is on, On when set is off).  I also like the touch sensitive buttons on the right side (Very Sexy and matches the touch sensitive feature of my PS3).PQ with standard definition is good.  The PQ with SD is much better than the SONY I had.  SD on the Sony was close to unwatchable.  I was not able to compare SD to an XBR though.Other things I DON'T like about the set:The remote that comes with it is not great.  You have to point it towards the bottom right corner of the set in order for it to work.  The good news; the issue is with the remote, not the sensor, as my Harmony universal remote (which came with the TV) has no problems.  Also, the layout of the buttons is not great. For example, the Favorite Channel button is mixed in at the bottom with a whole bunch of other buttons.  Also, the \"back lit\" remote only has 5 back lit buttons.  The ch +,- vol +,- and TV for some reason.  The Sony remote was way better although not perfect either.I wish it had a zoom feature.  The inexpensive Vizio has a zoom.  The Samsung should too.The set is an amazing DUST MAGNET. There's a reason the set comes with its own cleaning cloth.  With it's glossy screen and finish, it attracts dust like pigpen.  It gets a little better after a few days but be prepared to clean your TV a lot.The set does not accept Dolby Digital through it's HDMI input and therefore does not pass it through to the receiver, although it does output Dolby Digital for HDTV.Despite the issues with TBE and Stuttering, The picture quality MORE THAN makes up for it.  Also, these problems will be fixed (hopefully) soon.Even without AMP, the set is a great set.  IMHO, AMP just makes it really shine (when it works). To be fair, I can watch an entire movie without stuttering, and the next movie may stutter several times.  I suspect it is source dependent.Now, AMAZON's DELIVERY:Delivery is handled through their white glove service.  From what I can tell, service varies greatly depending on the local contractor you end up getting.  My experience was not great.  As someone else mentioned, it is imperative that you track your shipment on the MOVER'S website and then CALL them to confirm.  I called and was able to get the TV delivered the day it arrived at my local hub.  Then they called a week later to schedule a delivery for the set.  I said sure if you have another one, deliver it. ;) So, without getting into the details, the guys are late and I had to pick up my kid from school.  I had everything set up, and all I had to do was plug in a few cables which were already connected on the other end.  It took me literally 45 seconds.  I turned it on and wanted to check for screen defects.  The guy rushes me for a signature and says, as long as the TV turns on, that's all they are responsible for.  I wasn't comfortable signing, but since I was already late, I just singed and left.  Luckily there was nothing wrong with the TV.  Other people seem to have better experience with the delivery, but I wasn't impressed.In conclusion, the set is great, and will become even better with updated firmware.  EVEN WITH the current issues, I would still buy the set over again.  I was wary about buying the set from Amazon considering the potential issues if the set had problems, but for the price, I couldn't resist.I highly recommend  the Samsung LNT-4071.  A brick and mortar purchase may be better if you can find a competitive price though.", "Date": "February 14, 2008"}, {"Title": "Review of LNT4069F - matte version of LNT4071F", "Author": "S. Kim", "ReviewID": "R2A7THV3ZPKHRC", "Overall": "5.0", "Content": "I have to say I'm very pleased with my purchase of the Samsung LNT4069F LCD TV.  It's my first LCD TV I have ever owned.  I purchased this along with the Peerless Articulating Arm TV mount (SA740P) and satisfied with the results.  While I'm no expert in the LCD TV field, I've learned some things while researching for my LCD TV:*LNT4071F has the glossy LCD screen, LNT4069F has the matte LCD screen.*LNT4069F/71F weighs half as less than LNT4065FI've been carefully watching the price of the LNT4071F and seen it here as low as $1519 shipped.  I purchased mine for $1400 shipped (but elsewhere, sorry Amazon!).  So be on the look out Amazon consumers!  Best way to keep track of the price is to add it to your shopping cart (while logged into your account) and notices will appear on top of the shopping cart page.", "Date": "January 31, 2008"}, {"Title": "Well worth the money", "Author": "javalover", "ReviewID": "R3AYE22RXXO6IM", "Overall": "5.0", "Content": "I had been holding out for a while on getting an LCD TV until recently when the prices reached my price range.  I read the reviews and compared the 42\" aquos Sharp, Sony (40v2500 & 40v3000), and Samsung models (4061, 4065, and 4071), and on paper the 4071F offered much more for only a little bit more money.  To make sure that I made the correct choice, I checked out these 6 TVs at 2 different frys.  I was impressed with the contrast and general image quality of the Samsung 4071F.  Installed at home, high-def sources look gorgeous (OATV as well as my xbox360).  One thing that I was impressed with was how decent standard analog TV looked (not much blocky or blurry artifacts) - much better than what I had seen on other sets.A couple caveats...as mentioned earlier, the glossy surface does collect dust and be careful that there are no bright sources of light directly in front of the TV, otherwise you may suffer from some glare.Overall, the Samsung 4071F is a great LCD TV that looks elegant and is definitely worth getting.", "Date": "October 8, 2007"}, {"Title": "Well Done Samsung! One Amazing TV...", "Author": "A. Aziminia", "ReviewID": "RSOT4CXUC4K4I", "Overall": "5.0", "Content": "First, before i get into the TV itself, a few words on my experience with Amazon and Eagle Shipping.  For such a large purchase  my experience with the Amazon sales staff was nothing short of spectacular.  I purchased this TV well over a month ago and as many of you know during the initial 30-days if the price drops you can request the difference from Amazon.  Well, during my 30-days the price dropped on 3 separate occasions. In each instance the Amazon staff where more than happy to refund those amounts to my credit card with no questions whatsoever. And in each case i received the refund witin 5 business days. Simply great!Regarding Eagle shipping, I know many have written about their bad experiences with them but i have to disagree.  Five days after i ordered my TV i received a call from Eagle.  They set up an appointment for a couple of days and told be to expect the delivery between 9am-3pm which was not a big deal. At 11:45am the driver rings my doorbell and is very polite and brings in my TV.  This TV was for my bedroom which is on the top floor so the delivery man brought it up 3 sets of stairs straight in the bedroom.  He was willing to hook it up and everything but my new bedroom furniture had not arrived so he simply opened the package and checked the contents with me to make sure there where no damages to the set.  There wasn't so i accepted the delivery and he was on his way.  He was extremely professional and the overall experience was fantastic so kudos to Eagle Shipping!Now the TV itself!!! WOW! What a picture!I am a huge sports fan and i cannot believe the clarity in the picture.  I have been researching HD sets for well over 6 months now and had settled on the LN-T4065F when i saw the spec sheet for this TV so decided to wait.  And it was well worth it.  Ever since this TV arrived, i've had a huge grin on my face everytime i was a show.  The 3 HDMI inputs is fantastic because i can use my HD cable box, up-convert DVD player, and PlayStation 3 using just 3 cables to reduce the clutter.  Blu-Ray movies and the PS3 games are simply phenomenal. The 25,000:1 contrast ratio and auto-motion plus technology make the picture unreal. I stood in the store for hours comparing this to Sony 40\" XBR4 and could not see any difference to justify the almost $800 more in price.The one con that others have mentioned is the triple-ball-effect (TBE) which is a bit annoying and am hoping a future firmware update will fix it. But for me it's very minor and hardly worth worrying about.Overall, this TV is phenomenal.  I highly recommend it to everyone and in fact my brother is placing an order for one as well.", "Date": "January 3, 2008"}, {"Title": "Great TV", "Author": "Kyle", "ReviewID": "R2MUZ1CNRH9VIX", "Overall": "5.0", "Content": "I took back a LN-T4066F and got the LN-T4071F within a week since the 66F unit I obtained had major 'flash lighting' and the 71 series just looked better for the same area of money.The PQ on this set is amazing. I'm using a PS3 with an 800 Series Monster HDMI and so far I am nothing short of blown away. The Auto Motion Plus 120Hz mode seems odd to me as it makes the picture almost too smooth and feels rushed. I haven't watched a movie where I think it improves the experience, but I'm hardly a videophile. I personally think that AMP makes programming feel like it was filmed like a soap opera (smooth quick panning).The aesthetics are great but constant upkeep. The piano black color is nice but it collects dust like it is its job. I haven't figured out how to keep this set clean. The glossy panel isn't that big of a deal unless you're watching a very dark movie and have lights behind you. Even then I find it a minimal distraction.If you buy this TV, you won't be disappointed. Be prepared to fall in love with everything that is HD.Also, for what its worth, don't compare sets in store. Read about their pros and cons online. I checked a local BestBuy the other day and all of their TVs were on stock settings [which made the colors look absolutely ridiculous].", "Date": "October 3, 2007"}, {"Title": "The best thing goin'... TODAY!!!  Whoooh!", "Author": "Gordon Freeman \"Smell the ashes\"", "ReviewID": "R36ZVS9W05Z16L", "Overall": "5.0", "Content": "If you want/are ready to take the digital/HD plunge then Samsung's 71 series is the best way to go.  As a rule the details I mention will be the comparable whether on the 40\"/46\"/52\" Samsungs.  We purchased the LN-T4071F.My wife and I started looking in earnest last year around the Holiday season.  Indeed, there was much out there to wade through but in the end we felt that if we had jumped then we might have had an \"I coulda' had a  V8!\" moment.  We subscribe to Consumer Reports and I have my ear to the ground re: what will be the next great thing.  We knew some added-value feature sets were in the pipeline.  Are we glad we waited!Besides the fact that Samsung's display is stellar (even on the 61/65/69 series) the feature we find of greatest value is the 120Hz refresh (not available below the xx69F series).  When this motion setting is used it makes any program, even old 480 standard movies and whatnot, look more fluid when action or fast movement is on the screen.  And what it does for 720p and up is remarkable.  This feature is relatively new to digital TVs and worth the price of admission when compared to the old sets that only use a 60Hz refresh.Also, the 25,000:1 contrast ratio is noticeable even compared to 10,000:1.  The features on this set that also attracted us are the 3 HDMI ports and the USB 2.0 port.  We have lots of digital pics and viewing them on this gorgeous screen is something we look forward to.We got the set only a few days ago and just got a digital and HD upgrade from our cable provider and WOW!, the images are just as vivid and \"Live and in person\" as what is seen on display at the stores.  We coupled this 4071F set with a Samsung 1080P up-converting DVD player and indeed even standard, old-world DVD's look crisper, especially with fast motion on the screen.  Its not quite HD/Blueray but a noticeable improvement for regular progressive scan DVDs.  Per other reviewers we are waiting for the dust/cost to settle on these two high-deg standards.Why do we recommend this set so enthusiastically even over the Sony Bravia XBR series (which also has a 120Hz refresh)?  I won't throw down the spec #s and whatnot; instead I'll relate an anecdote.  We had already settled on the Samsung 4071 but were still researching the best deal we could get online (of course we located the best, by far, deal on Amazon -- under fifteen hundred shipped).  I was in Bxxx Bxx and looking at the digital TVs displayed on a wall just to reinforce our opinion.  I was at a distance so as to see as many sets at once, regardless of size, and my eye settled on a particular set.  I thought my eye had settled on a Phillips.  I was surprised!  I ogled the set some more while letting my eye flit to other sets to validate what I was seeing.  There was a tag on the wall that I thought had ID'ed the display as Phillips but when I went to read the specs I discovered the set I was looking at was indeed the very model we had settled on.  Serendipity indeed!  The tags had been so close together I mistook the TV for a Phillips which was next to the Samsung 4071F.  This unbiased \"test\" solidified our choice.You could look at the Samsung xx69F series which also has the 120Hz refresh but it's contrast is 20,000:1 and, as a rule (online at least) costs the same as a xx71F.  And the 81F series (Magnolia Home Theater labeled)?  Way too much more coin for a minimal viewing improvement (LED illumination might be the way of the future but not for a $1000 premium.A selling point for me as well is the ability to hook up a PC either with a VGA connection or using a DVI-to-HDMI converter.  I won't bother with getting a 1/8\"-to-2RCA connectors to get sound through the TV speakers.  I'm going to use my dedicated speaker set for the PC (Logitech G51s).A final word: I saw that another reviewer thought the 120Hz refresh was basically bogus.  Not so!  If you are considering this set go to Bxxx Bxx or Cirxxxx Cixx and have the sales person enter the on-screen menu and select \"Display Mode\" under the Picture settings.  You'll see one half of the set at 120Hz vs 60Hz.  Just wait for the demo pictures to get to the football viewing.  You can't miss the dif!", "Date": "December 19, 2007"}, {"Title": "A great TV", "Author": "Linda J. Thomas \"justlinda2\"", "ReviewID": "R1CJRZOKRYE9TO", "Overall": "5.0", "Content": "My husband and I researched HDTV's for a couple months, read about them, went to various stores to view them and ultimately decided on this HDTV.  So far, we are more than pleased, lot's of things to learn about it, starting with the remote, but we are pleased.  Amazon delivered what they advertised, and the HDTV was delivered very quickly.  I would recommend this TV, and buying it from Amazon to anyone who is searching for this type of setup.  By the way, we also bought the Blu Rey DVD player to go with it...it's very cool!!!", "Date": "November 8, 2007"}, {"Title": "One Amazing Television", "Author": "William Dierssen", "ReviewID": "R1LULFW4AGIOSK", "Overall": "5.0", "Content": "I've lived with this TV for just over one month now, so let me share my observations: Wonderful. Exceeds expectations. Quite simply amazing. What more is there to say?Being in the video production business since the early 80's, when the promise of high definition television was first whispered, I was more than ready to receive. So, I spent some time getting up to speed on current HDTV technology, which was considerable but necessary with so many variables in play. (Wikipedia is a great place to start learning about all things related to HDTV.)After much research and comparison shopping on-line, I targeted the Sony XBR series. I was entirely decided to go Sony, when I went to look at the set in person at my local Circuit City store. I marveled at the dizzying array of flat panel video. \"Wow, they all look great!\" I thought. The Sonys were real stand outs too.Then, across the room, I noticed a picture that just stopped time. -- It was the Samsung 71 series playing a Blu-Ray version of \"Pirates of the Caribbean\". I thought I was looking through a window, it appeared just that real. Almost too real! Well, now I was smitten with the Samsung 71 series. (Incidentally, Samsung and Sony share an LCD panel factory.)I went to the Best Buy store around the corner and they happened to be featuring the Samsung 4071 TV, and were really talking it up as \"the best TV for the money, on the market today\" (December 2007).Well, I went home with those experiences and started checking around for the best price. Far and away it was Amazon.com. They were hundreds less than any other retailer. In addition, over the next 30 days the price dropped 350 more, which was refunded upon request. Brilliant!I too was contacted by Eagle Freight for a delivery day, but because the soonest they could deliver was the middle of the following week, I just went to their warehouse and got the TV with my car. I wouldn't recommend it, but I was anxious to get the set!Once I got the TV home, my wife and I un-boxed it and it was simply a plug and play operation. The picture is thrilling right out of the box. There are loads of options for picture adjustment but the defaults work fine as a starting point.As for content, we get high def TV signals pulled in off the air with a Terk antenna. Broadcast HD is stunning. A Sony upscaling 1080P DVD player handles our 'legacy' dvds really well too. And finally an Apple TV box for streaming internet video, movies and digital photos, straight to the TV screen. Simply amazing!!I have noticed some of the drawbacks that others have seen in this TV too, yet I think that they are minimal and certainly not deal breakers. I highly recommend this set, unconditionally and without qualification. Buy or die!...", "Date": "January 7, 2008"}, {"Title": "grrrrrrrrreat tv!", "Author": "V. Sturza", "ReviewID": "RSTFAFXCC6HO8", "Overall": "5.0", "Content": "This TV is super-nice. I spent over a month looking for the best TV. The conclusion was - for LCD Samsung or Sony, for plasma Panasonic; so, I decided to get an LCD. I went to all kind of stores looking for Samsung & Sony, and of course the best out there at the time, for a reasonable price was Sony XBR4 and Samsung 71F, both of them with 120Hz technology.Many of u guys know that the only difference between Sony and Samsung is the contrast black/white, which I can say is very true, I stared so many times at this two TV's...I have the TV for about a month and I have no complains; I use it with a sound system and everything is ok.So, I recommend this TV and it is a really good bargain!", "Date": "November 22, 2007"}, {"Title": "Wow", "Author": "Orville Bernard Jr.", "ReviewID": "RUXCZQJCIF4N1", "Overall": "5.0", "Content": "After some intense research, I decided to buy the LNT4071F. Man, I made a great decision. The television is beautiful. The colors are stunning. I hooked it up to my PS3 to watch a Blu-ray movie for the first time and the clarity is unbelievable. This TV is worth the price. Amazon's free shipping was also pretty helpful. Eagle called to set up a delivery date a couples after my shipment was processed. They even set it for me, which was awesome. You cannot go wrong with this BUY.", "Date": "November 6, 2007"}, {"Title": "Samsung + 1080P + 120 Hz = WoW", "Author": "A. Tjahyadi", "ReviewID": "RGHAVN6UUICM0", "Overall": "5.0", "Content": "I just got this TV yesterday. This TV has the right size for my apartment, not too big and not too small. I opened the box and after I connected it to my PS3, I was speechless (1080P & 120hz). After playing with the settings, this TV gets even better. 120Hz technology is just amazing for my eye (you can adjust the setting too for the Auto motion Plus 120Hz). You can't go wrong with this TV. ! I was thinking to buy a Sony but after comparison in local circuit city, I can see Samsung is better. IMHO, this TV beats the hell out of Sony Bravia XBR 120Hz!!I had 32\" Westinghouse and the quality is totally different (both craftsmanship & video quality). I got nothing to say but WoW for this TV. Bye2 Westinghouse & Sony.", "Date": "October 24, 2007"}, {"Title": "I would not recommend this TV for customer service", "Author": "Karen Hanus", "ReviewID": "R8R2LQXF62NOW", "Overall": "3.0", "Content": "Line appeared on TV less than two weeks after purchase. Took another two weeks to get in a repairman who said he would request a new TV. Samsung refused to cooperate saying they would replace screen - I wanted whole new TV for having such a short time. Amazon was OK - they agreed to replace TV no charge but inadvertently cancelled order three times due to it being on backorder and them not sending me the confirmation that I would wait (perhaps too many departments working on problem?). They cancelled backorder then reordered then cancelled then told me they would send someone to pick up bad TV. I refused this saying I wanted a replacement first. Amazon agreed then a company called the next day to pcik up defective TV - that type of stuff kept happening. Took almost two months of phone calls and e-mails  to get replacement via Amazon - finally TV was in stock and got a good cust service rep who actually called me ten minutes after replacement arrived to verify it had been delivered. Amazon needs to work on c.s but they genuinely tried to reconcile problems and deal with my frustrations. Funnily enough we got a call from repair service (actually a camera shop) a full three months after we initially reported problem saying the new screen was in. Took a long time and many false starts but Amazon came through and price and picture were worth it in the long run. Knock on wood - TV has been good for the last few months.", "Date": "April 26, 2008"}, {"Title": "Amazon stands by their sale; Samsung does not stand behind their product", "Author": "Love Machine", "ReviewID": "RFN6W3D8OQGA4", "Overall": "3.0", "Content": "TV failed catastrophically about five weeks after purchase.  Samsung sent technician who replaced almost every part and could not repair TV.  He agreed TV was a lemon and said he would put in request for replacement.  He called about a week later and said he had ordered a new panel.  Told him I did not want to repair the TV and asked what happened to replacement request and he said he never sent it.  By this point Amazon agreed to send brand new TV and I expressed my displeasure to Samsung about TV failure, repair failure, and bad attitude of technician.  I faxed them a detailed record or my experience and have not received a response despite five or six follow up calls.  Now that it works TV is great but I would never buy Samsung again due to beyond shoddy customer service.  I was initially worried to buy a big-ticket item from Amazon.com but they have taken great care of me and stand in stark contrast to the lack of follow up and general disdain shown by Samsung.  Amazon forever, Samsung never - next time I will buy Sony even though I was very excited by this TV and it works well now (for how long I don't know).", "Date": "April 14, 2008"}, {"Title": "good picture", "Author": "patch adam", "ReviewID": "R21N8RJSSS5537", "Overall": "4.0", "Content": "this is a very good tv if you have a totally dark room. only reason why i didn't give it a 5 star is that there is a glare when you have the light on and it hit either the border or the screen. so be warn that there is a glare. other than that, the picture is great.", "Date": "February 10, 2008"}, {"Title": "SAMSUNG LNT4071 is an Outstanding Television that Beats the SonyXBR", "Author": "D. Nocera", "ReviewID": "R3521ZQTSMJJWU", "Overall": "5.0", "Content": "I have been a Sony guy my whole life.  I am a video professional and all my gear has always been Sony.  Until a month ago I had a 15 year old 32\"Trinitron XBR television. . . The power supply went and I felt it was time to upgrade.  When I bought the XBR in 1992 it cost around $1600 so I decided to see what kind of HDTV I could get for the same money. . .  I of course started with the Sony 40\" Bravia XBR4 which at the time was priced at $2300.  It had the best picture of any lcd I had ever seen. . .  However there was quite a buzz on internet forums about the Samsung LNT4071 and a few of my friends said the Samsung had as good a picture as the SonyXBR.  One of my friends went and picked up a 4065 on black friday for $1200 and I went over to his house to put his Samsung through its paces.  We watched different HD content and I was blown away by the high contrast, vivid picture.  There was no question the Samsung had a picture as good as the Sony!  I knew if I was going to invest in a tv I wanted to get the Samsung with some of the latest features, high contrast, 120Hz, 10bit processing.  At the time the Samsung 71 and 81 were two latest greatest models.  In early January Amazon had the 71 listed for a little over $1500 with free shipping!  I went to a retail outlet to check out the 81 which has LED Smart (Back)lighting which boosts the contrast ration from 25,000 on the 71 to 500,000 on the 81!  This feature alone adds $1000 to the sticker price!  I didn't see much of a difference between the two tvs other than the slightly darker blacks.  I guess the LED's also have a longer life than the fluorescent back light. . . But was it worth an extra $1000?  Not in my opinion.  The LNT4071 has a beautiful, high contrast image so I didn't feel the somewhat darker blacks were worth the extra grand.  However, if you want the absolute highest-end LCD tv than go with the 81.My mind was made up  when the price of the TV began to slowly creep up as the end of the peak television buying season came closer to its end.(Thanksgiving to the Superbowl)  Amazon really had the best price on this tv and shipping was free which I couldn't believe.  The TV arrived three days early with a few pro-active phone calls to the shipping company to check on the order's status.I've had the TV for about a month now and after watching this year's superbowl in High Def I can say this tv has an absolutely outstanding picture!  The superbowl looked 3D.The Auto Motion Plus feature I keep turned off most of the time.  Its really only useful for documentaries or live sports where the frame rate is already high.  Using it on movies or tv shows which film at lower frame rates makes them looks artificial and un-natural especially on the highest setting.  I also recommend tweaking the color, the default color settings are over-kill and headache inducing.  Check out the AVS Forum for specifics [...]", "Date": "February 9, 2008"}, {"Title": "My year long research proved well worth it!", "Author": "N. Duvall", "ReviewID": "RS3QVBUD12UGH", "Overall": "5.0", "Content": "I had been looking for an HD TV for well over a year and spent a lot of time researching all the options available on the market. I wanted to get the most for my money, yet have a TV that would last me for years to come, and one that could keep up with the ever-changing HD technology. The Samsung LNT4071 is everything I had been searching for and exceeds every expectation I had. Once I had narrowed it down to this particular model, I was watching the prices at all the other major retailers and it kept hovering between $1750-$2000, even during/after the holidays. So when I saw it for $1500 on Amazon, I knew I'd better pull the trigger fast. The picture quality is out of this world, almost too realistic at times, especially combined with a Panasonic DMP-BD30K 1080p Blu-Ray Disc Player. This set is so bright & crisp it will literally hurt your eyes the first few times you watch it, I'm not even kidding. Playing XBox 360 is amazing!!! Seriously, watching TV, movies and playing games is now an experience, not just something to do when you're bored! If you're worried about not having a warranty, buy a 4-Year Service Plan for Televisions $1,500 to $1,999.99, that's what I did! And if you're worried about shipping, don't be! Eagle Logistics is fast and reliable and will make sure everything is delivered safely and in one piece. I'm an extremely picky person, but I did my homework and found the Samsung LNT4071F to be hands down the best option on the market in its size & price range. You can't go wrong with this one, I highly recommend it!", "Date": "January 16, 2008"}, {"Title": "Excellent television with one minor flaw", "Author": "M. Arakelyan", "ReviewID": "R1B3LRM40OBFFU", "Overall": "5.0", "Content": "Before purchasing this TV, I did a lot of research as many others have. I decided on the Sharp 46\" 62 series given the specs. But before I bought it, I decided to go to Best Buy to see it for myself. Once I did, I thought it produced a decent picture, but it wasn't anything that blew me away. Directly above the Sharp was this Samsung. I tried to pay attention to the Sharp, but my eyes kept creeping up to the Samsung. Before I knew it, my total focus was on this TV which produced a smoother, sharper, more saturated picture. I decided I could not possibly buy the Sharp after seeing this TV.My mind was made up and I eventually bought the Samsung here on Amazon and could not be happier. Once you see this TV, you won't go back to anything else.The one flaw this TV has is the triple ball effect (TBE). This is most evident when watching sporting events such as golf. When the ball is struck and the camera pans the ball as it is up in the air, you see 3 balls instead of one. Hopefully Samsung fixes this issue with an updated firmware.Given the flaw, it is not extremely distracting and should not deter you from getting this TV. I assure you will not be disappointed.", "Date": "December 21, 2007"}, {"Title": "Priceless...", "Author": "DerekT \"electrical engineer\"", "ReviewID": "R1KRMNKLN293DA", "Overall": "5.0", "Content": "I bought this TV from Amazon back in December and decided now to write a review after I have had some time with this LCD.  All i can say is that even now when i go to an electronics stores (ex. best buy, circuit city) i still get impressed with this TV.  This is by far the best purchase that i have made in the past 4 years for my house.  Some people claim to have had simple problems with the TV but i have not and its still flawless.  I have a sat. and a ps3 connected to this system with every HD channel that i could purchase.  If you want to be amazed watch HBO-HD, Showtime-HD, Stars-HD, or any of the other pay HD channel on this system but if you want to be truely BLOWN away watch a Blu-Ray movie...!WOW!  This TV is so great that i think even my girlfriend is with me just to be able to watch it whenever she wants. Just kidding, but seriously I could get into every detail and aspect of this TV but that is not necessary because this TV sells itself.  Therefore my opinion is BUY IT AND YOU WONT BE SORRY.", "Date": "May 8, 2008"}, {"Title": "Nothing short of awesome", "Author": "R. Wagner III", "ReviewID": "R35X7AK2CC8Z7P", "Overall": "5.0", "Content": "This is literally the best picture on a TV I've ever seen for being less that $2000. It arrived 3 days early, delivered by CEVA who did a great job setting it up and confirming it was working. After close inspection I couldn't find a single dead pixel. I hooked it up to my computer and cranked the resolution up to 1920x1080 and it was breathe takingly sharp. This TV could easily be used as for a desktop monitor as it is every bit as crisp as my 21\" CRT monitor. Playing PC games on it was also such a pleasure, no ghosting at all. If you have a video card that can run games at that resolution, it can be very immersive as the wide screen literally stretches out just to the edge of my forward field of view.As for the 120Hz feature, I found that it looks great on anything that isn't heavily compressed. As an example, most cable/satellite TV providers compress the image on shows, this causes the 120Hz to behave poorly. I found having it set to Low for TV was perfect. Even for movies I only use the Medium setting, but it really does make a huge difference in the quality of the picture. Everything flows beautifully.", "Date": "May 2, 2008"}, {"Title": "Samsung LNT4071F", "Author": "S. Hooper", "ReviewID": "R2J1F4OCAAER53", "Overall": "4.0", "Content": "WOW! Fabulous!! 4.5 starsI have researched LCD TVs for quite a while: about 7 months. I was set on purchasing the SONY XBR4 series, but could not justify paying $2400 - $3400 for a TV. So I just kept reading reviews from CNET and the AVS Forums, in addition to Amazon reviews. Eventually I settled on this one. I have had this TV for about 2 months.I am very pleased with the quality of the TV in terms of aesthetics, and signal output. I had cable, the signal was not all that great for local channels, as expected. Now, I have a dish and the local channels seem to be fairly clear. This is something I did not expect based on the reviews which have clearly stated that the standard signals are always low quality. Anything which takes advantage of 720p or 1080p are awesome to watch whether video games, DVD or HDTV.The Eagle Delivery service was fairly good. I would not say great, because they did not contact Amazon when they could not reach me. Someone transposed two digits of my phone number. Anyway, the TV sat in their warehouse for about 10 days -- no good. Had that not happened, I would have had my TV in 4 days. The quality of the TV is worth the wait. I was just annoyed by the local delivery agent.I tried to recreate the triple ball effect to no avail. I tried to recreate it playing Soul Caliber II and watching The Matrix. I had the  Auto Motion Plus set  to high with game mode on. I have firmware v. SS03.The settings I use for picture quality and color are found on the specific pages related to this product on the AVS Forums. I would suggest to use what they offer as a guideline with a mind to tweak as you become comfortable with the remote and the effect of the settings.Anytime Connections works well. I have a Samsung Upconversion DVD player, 1080p7. When I turn it on, the source from which the TV draws it signal automatically switches. It is quite seamless. (See review of Samsung 10807p).The only things I don't like are: when the TV is muted, the mute bar on the lower left side of the screen stays static. When watching movies using my amplifier, I have to lower the volume of the TV to zero. Secondly, the clear trim on the sides are a pain to clean. They are not solid pieces; I have small fingers so I can dust inside them. but not easily. Minor, but annoying.The one time I spoke with Samsung customer service, they were helpful and friendly. They even stayed online while I tested the solution they provided for me. Do not use the automated online chat as the people who work that end of customer service do not seem as knowledgeable.", "Date": "April 23, 2008"}, {"Title": "Unreal", "Author": "Edward C. Stansbury", "ReviewID": "R1TX2XPSGRIFCR", "Overall": "5.0", "Content": "Only way to describe this is awesome.  Shopped around for months and compared various models (Sony, Sharp, LG) but for the price, this TV blows away the competition.  At a local Circuit City they had this TV right next to a Sony playing the same movie on Blu Ray, and there was no comparison.Next to my wifes engagement ring, this was the best purchase I've made so far.", "Date": "March 21, 2008"}, {"Title": "Samsung: Fantastic performance, but QC future releases", "Author": "Barbara H. Holaday \"Bobbie Holaday\"", "ReviewID": "R23DTRI9MGV8GE", "Overall": "5.0", "Content": "This Samsung model truly deserves its five-star rating, even though the first one I received was a bummer.  The first time the TV was powered up on January 29. a vertical red line appeared to the left of center on the screen, and this annoying red line was perpetual.  When the COX cable technician arrived that same day to upgrade my digital receiver to a digital HDTV receiver, he told me the red line was definitely a factory defect.  I immediately contacted Amazon.com by phone, and was assured that the defective TV would be replaced by a new one as quickly as possible.  Amazon.com really deserves five stars for their prompt action on the replacement.  At the time the LNT-4071 was out of stock, but Amazon.com worked miracles and by February 13, CEVA/Eagle brought a replacement TV and took away the defective one.  Their delivery men commented that they seldom have to return a Samsung television set.  I commend CEVA/Eagle for their courtesy in contacting me prior to delivery on arrangements.  While their first delivery person seemed a bit unsteady in handling the large package, CEVA/Eagle sent two men the second time, both of whom were courteous, helpful and professional.  A word to Samsung would be that while this terrific HDTV deserves the five stars, they should really improve their quality control and never let such a defective model be released and delivered to a customer.When I first decided to upgrade to a large flat-screen television with high definition, I researched various brands for months before selecting this model.  I looked at Sony and Vizio and others in a store, and I read many reviews from customers on Amazon.com online.  The Samsung LNT-4071 was the right size, the right price, and from what I'd seen and read, had the best picture and the most happy customers..  So you can understand why I nearly passed out when my newly delivered television came up defective.  Not only did it have the everlasting red horizontal red line, it emitted an unpleasant smell like burnt carbon whenever I walked near the TV.  I didn't realize the smell was a problem until my second delivery TV was up and running with no nasty odor.Now I can appreciate all the great things other reviewers said about the exquisite clarity of the picture, the true-to-life colors, and the ease-of-use of the user's manual for adjusting the detailed setting controlling picture mode, contrast, color, brightness, and so forth.  Some reviewers complained about the reflective screen and border areas, but my room does not provide enough direct lighting to cause such reflections.  Besides, I believe the glossy screen is partially responsible for the amazing precision in picture quality.  Because I'm connected to cable, I use the COX remote control, which allows me to switch from the television to the DVD player to the VCR by just clicking buttons.  I might add that the sound is stereo quality and simple to adjust.Kudos to Amazon.com for their immediate response to my disappointment over my first defective HDTV.  Thanks to Samsung for providing such great television enjoyment, which outperforms the highly touted, more expensive Sony Bravia. My advice to Samsung is to check your quality control division closely before sending out any more defective models.", "Date": "February 14, 2008"}, {"Title": "Expensive, yet excellent TV", "Author": "J. Piotrowski", "ReviewID": "REED8QKC0KH91", "Overall": "5.0", "Content": "So, there's a lot of other reviews on here for this TV that are quite extensive.  So, I won't repeat what they stated about the specifications on it, I'll just give my insight on it from one month of ownership.  To begin with, I was looking for a TV in the 40\" range, as that's what my space can accomodate.  This size constraint, plus the fact that I'd be playing an XBOX 360 on it, kind of ruled out plasma for me.  I read the reviews on CNET, Consumers' Reports, etc. and started narrowing down my choice to either Sony or Samsung [which is essentially the same, since Samsung makes a lot of the glass/pannels for Sony].  I saw overall that the Sony's were much more expensive for not much better picture.  It ultimately came down to which Samsung.  I started out looking at the LNT-4065 [which I really liked], but then when the -71 and -81 series came out, I liked those a lot better.  I chose the 4071 over the 4081 mainly due to price and the fact that the off-angle viewing was better on the 4071 than the 4081.  Now for my take on the TV after one month.  There's been a lot of discussions back and forth about Samsung going with a shiny finish on the screens versus the matte finish.  I've found that I have no problems with reflection off the screen as long as I'm on a different plane [level] than the light is.  I do find that the light reflects off the bezel around the screen no matter where I sit.  When I do get relection off the screen, it's no worse than my old CRT TV with a glass screen.  As for the 120Hz, it only makes a subtle difference, mostly on the moving \"tickers\" on the bottom of the screen when watching certain shows.  The TV is able to pull off-air HD very well.  I don't have an upconverting DVD player, but the TV itself does an excellent job of upconverting 480p on its own.  Haven't tried the PC input.  The TV does a better job than most displaying standard 480i cable shows.  Didn't see any real problem with off-angle viewing [it VERY subtle compared to cheaper brands].  I must repeat that this TV has ample inputs, which was a strong selling point for me.  Also, Amazon's delivery service [I think it's called Eagle] was excellent and they delivered the TV on time and took away the packaging.  Also, at the time of my purchase, the 4071 was $500 cheaper than either Best Buy or Circuit City or Sears.  Overall I'm extremely happy with my set and I would buy one again.", "Date": "January 15, 2008"}, {"Title": "Like it so much I bought another..", "Author": "G. Geist \"kgirls\"", "ReviewID": "RQBDKZTXQ53JZ", "Overall": "5.0", "Content": "I got the 40\" and is pretty much perfect. The picture looks better than the XBR4 and no more \"screen door\" affect while watching sports.I like it so much I ordered the 52\" for my home theater room.", "Date": "October 10, 2007"}, {"Title": "Best Product, Best Supplier", "Author": "JayD \"OnlineShopper\"", "ReviewID": "RB6HN31SPEFZ8", "Overall": "5.0", "Content": "Completely satisfied with the product and Amazon.  At this time, the Samsung LN4071F is most likely the best 40\" set on the market today, especially considering the price.  The brightness and overall picture quality are stunning.  Amazon brought in a tremendous savings over the best local SALE price (I figure well over $400) and the delivery couldn't have been any better (w/available tracking, pleasant local delivery contact and the local delivery appointment was kept on time).  Everything was as expected and I couldn't be any happier.  Thanks Amazon!PS - There are a lot of older, inferior models being sold retail today at nearly this price point, why not wait a week and not have to compromise on what you end up with!", "Date": "April 8, 2008"}, {"Title": "Perfect", "Author": "Aaron J. Benek \"Gorbulox\"", "ReviewID": "RMIZM9YEPQS5Q", "Overall": "5.0", "Content": "Nice television, great picture.  Can't complain.  Even though the item was an \"open box\" item, the damage was extremely minimal (minor scuffs on the bottom front left corner) and for the price it was well worth it!Having both a 120hz and a 60hz model of approximately the same size and contrast ratio...I can tell you that the 120hz does make a difference.  The Auto-Motion feature really adds a new dimension to the blu-ray movies that I already own.  It does take a bit of getting used to - but now I wouldn't want to watch movies on a tv with a lower refresh rate...the 60hz without Auto-Motion just looks choppy to me.", "Date": "March 31, 2008"}, {"Title": "No HD TV is 'there' yet. This one is close.", "Author": "pvbAustin", "ReviewID": "R311BHPK5VOWKK", "Overall": "4.0", "Content": "I held off buying a hi def TV for two reasons:1. They were stupid expensive2. None of them had a consistently great imageAround Christmas time 2007 price issue seemed to go away and with features like 120hz panels and image smoothing using frame interpolation it seemed like the image quality was getting better (consistently).This set seemed like a perfect balance of price and features. The image has been fantastic, it really looks great...as long as the signal from the cable company isn't too compressed. The styling on the outside of the set is also very nice. I especially like the glowing blue power button that turn the TV on/off with a gently stroke of the hand.My main disappointment with this set had been the performance of the Auto Motion Plus. When it is working it looks great. The problem is that I can't really keep AMP turned on. When the AMP is on you often times get this very distracting slow motion effect. It is so distracting you can't watch a show with this feature on. It is a little annoying to have to keep turned off the key feature of the set. I've spoken to Samsung CSRs, they have assured me a fix is on the way. They're not sure if it's a firmware fix or a hardware + firmware fix, but they have promised me a fix is coming.If I can get the AMP to work on this set I would give this TV 5 stars. Other people have complained about the Triple Ball Effect. I honestly didn't notice that too much, but I think it was because I was so offput by the slow-mo, or stutter effect of the AMP.I think one thing to keep in mind is that all HD TVs have some sort of issue/flaw. If you go in with that expectation this is a fine set to own. I'm just glad flawed HD sets no longer cost 15k :-).I use this TV withTiVo TCD652160 HD Digital Video RecorderandOnkyo TX-SR605 7.1 Channel Home Theater Receiver (Black)with these speakersONKYO SKS-HT240 Home Theater Speaker Kitsome time soon I will replace my old Samsung 1080i upconverting DVD player with thisPlaystation 3 40GBOne more note: my couch is about 7 ft from the TV and 40\" is plenty big.", "Date": "March 29, 2008"}, {"Title": "WOW, absolutely stunning!!!!!!", "Author": "L. Cornwell", "ReviewID": "R23SS9GL2WBOPE", "Overall": "5.0", "Content": "I did a lot of research before taking the LCD TV plunge and everything pointed to this tv.  I was debating between a lower series 46\" or this 40\" for about the same price, the 40\" won out due to a lot of the added features.  I got this one mainly for the 120hz that I had heard so much about.  The 120hz works like a dream, makes NASCAR look like you are really there.  Funny thing is it makes movies look almost too good if that is even possible, it makes them look more like video rather than film.  A really go example of this is in Bourne Identity HDDVD chapter 12, \"Paris Pursuit\".  Watching it with 120hz on high makes it look like a soap opera on tv and not a film.  The black levels are amazing.  The only way to truly describe this tv is stunning!!!", "Date": "March 28, 2008"}, {"Title": "Pretty nifty!", "Author": "Plano Gal", "ReviewID": "R3UIL8ZK37602T", "Overall": "4.0", "Content": "I am pretty impressed with this t.v. It is pleasing to the eye. The picture is clear, and the color quality is nice. I like that it puts the t.v. channels in order, unlike my last HDTV. It is pretty fair at stretching an image to fit the screen (not perfect, but good). It is really good for gaming. My kids love to run a cord from the computer to the t.v., and play on-line games with it, a rather nice feature.I dislike the glare factor, but it could be worse. I have it in a bright room. It catches one of the window's images, but if I close the window it is o.k. I am not sure I like the shiny rims around it, but you get used to that fairly quickly. The sound is pretty good.I dislike the remote. You have to concentrate to find things. You have to point it very directly at the t.v. and there is a good little lag time for it to change the channel...I would definitely buy this again!", "Date": "March 20, 2008"}, {"Title": "Great TV!!! See review about 4069", "Author": "AER", "ReviewID": "R1U85OTUBNJ7AE", "Overall": "5.0", "Content": "The Samsung 4071 has produced excellent color quality and is a great TV. Local stores price them much higher than you will find on the internet. I bought this TV b/c I had to return my 4069 due to slight damage on the frame during shipping. Both TV's are similar in set up with the 4071 having a few added features.The frame is a bit larger than the 4069 and shiney as opposed to non-reflective. This only makes a difference when the TV is turned off, so if you do not care for the mirrored look you will be happy with the 4069. It does not bother me but I did really like the non-reflective style better.I have the same review for this TV as the 4069 (see review on Amazon). It has a few extra options, that, in my opinion, I did not need to have for a better viewing experience from the 4069. There does seem to be better color saturation because of the higher contrast ratio. Otherwise, both TV's have the same features and are the exact same TV other than a few differences, like the frame (look) is bigger on this b/c the speakers are on the sides and backside instead of underneath like the 4069.You can read about the features for both on the product information to find the differences.This TV as well as the 4069 are great TV's and Amazon's customer service was outstanding with all my questions and my return of the product as well as a prompt refund when they received the damaged item. It was completely hassle-free with no strings attached.", "Date": "February 8, 2008"}, {"Title": "LCD From Heaven", "Author": "M. T. Mounce", "ReviewID": "R1KHEULW5SG13K", "Overall": "5.0", "Content": "First of all, the deal on this TV was amazing. The price was a steal at the time of purchase compared to MSRP. My friend purchased the LNT4061F recently, so I had a chance to compare them. Would it be worth it at retail price compared to the next model down? Not really, since the only noticeable difference to me is the 120hz.Secondly, the fact that for a couple hundred more bucks compared to the previous model I got 120 frames per second on my TV was especially nice. I usually appreciate that kind of refresh rate when I'm playing games on my PC. Having that on my TV makes the movements look eerily realistic and somehow fake at the same time... You'll either love or hate the effect. Some people liken it to watching someone moving in front of a green screen, but to me it's almost like it's more three-dimensional watching them whether it is an HD or STD signal. It's practically the reason why I purchased this TV over the older model. Watching Batman Begins on an HD-DVD player on this TV was jaw-dropping!I bought this TV primarily for my XBox 360, and let me tell you it performs wonderfully. Sure, any new/decent TV nowadays can output in 1080p, but again it's the 120hz that makes the games look even better. Best of all, my dang screen isn't cut off anymore like on my old CRT HDTV! Now I can see that ammo counter in the corner! I also hooked up my PC and played some games on it... it was more than I could imagine... and I have a 22\" widescreen monitor!Honestly, the reason why you're paying extra seems to be the 120hz refresh rate. I haven't any triple-ball effect watching NFLHD or ESPNHD and mine is set to High. I should also note that my TV was manufactured in October 2007, so perhaps the older models have the issue. There is a firmware update available, but my TV doesn't have it, nor do I plan on upgrading since I don't have this particular issue. I highly recommend you preview this TV's 120hz image before you purchase because as I said, you will either love or hate the effect. Fortunately, you can turn it off... but if you do, it would be a waste and a pity!", "Date": "January 23, 2008"}, {"Title": "Very pleased", "Author": "Arnold Pulda", "ReviewID": "R3KRYM2CA8IDO3", "Overall": "5.0", "Content": "I bought the Samsung LNT4071 through Amazon. I am thrilled with all aspects of the purchase. The 30-day price protection is amazing, since the price on these puppies seems to change every day. I bought it at $1610; within a few days it fell to $1493, only for a few hours, as it turns out, but I caught it at that price, called Amazon, and boom! they refunded me the difference immediately. Shipping was excellent, by Eagle. Easy to trace as it came across the country; Eagle was very responsive when I called them, and delivered it as promised, on a Saturday morning. Two guys brought it in, took it out of the box, and tested for power and checked for any damage -- of which there was none. The picture is spectacular. I could not be happier with this purchase.", "Date": "January 16, 2008"}, {"Title": "New TV For Living Room", "Author": "Rens Methratta \"ExpenseView.com Admin\"", "ReviewID": "R2MK9ZFP8065ZX", "Overall": "5.0", "Content": "My 13 year old CRT finally died and I started to look for a new flat screen afterwards.  A little research and LCD seemed to be the obvious choice.I always believe in going for the best you can get because purchases like this last a long time (hopefully).  So I figured I'd need an 1080p with HDMI 1.3.  I read the reviews and then went to the store and narrowed my choice to the Sony XBR4 and this samsung.I chose the Samsung because it's contrast ratio is amazing (25000:1).  This is incredible.  Sony's is great as well 18000:1.  But the Samsung was cheaper and it had better picture quality, so it was the obvious choice.The samsung has glossy top which gives it the great contrast, but it can cause reflection (I've heard).  I haven't had an issue with this though.Good luck on the tv hunting.", "Date": "December 18, 2007"}, {"Title": "Samsung LNT4071F 40\" 1080p 120Hz LCD HDTV", "Author": "William Penn", "ReviewID": "R256HC7TMF2MG0", "Overall": "5.0", "Content": "Like others, I spent months researching HDTV's looking for all the features and attributes incorporated in this set. When I read about it, I went to my local TV stores to see it and compare it to others, notably the Sony XBR series. I quickly determined the Samsung picture quality is superior and this is the set I wanted. I ordered it from Amazon and can't say enough good things about their service. The set arrived in six days within the appointed time slot and was carefully unpacked and setup by two very considerate delivery men who removed all packing materials. My set is hooked up to Direct TV with the HD option. I have found all of the positive comments contained in other reviews or magazine articles and evaluations to be absolutely true. I am completely satisfied with this TV and have no complaints. Some reviewers expressed concern with the glossy screen, it definitely enhances picture quality and after a few days viewing, sets with matte screen look dull. If the features and appearance of this set appeal to you, don't hesitate to buy one, you won't be diappointed.", "Date": "December 13, 2007"}, {"Title": "Samsung LNT4071F", "Author": "James Meyer", "ReviewID": "R2XRFEZDR2CPRA", "Overall": "5.0", "Content": "Samsung LNT4071F 40\" 1080p 120Hz LCD HDTVBought this TV from Amazon on Sunday night, and Eagle delivered it on Wednesday morning. Eagle set it up and tested it before leaving.  The TV is performing excellently.  This is our first LCDTV, so I can't speak to technical comparisons.  However, for the price, this TV is hard to beat.", "Date": "November 28, 2007"}, {"Title": "Samsung LNT4071F 40\" 1080p 120Hz LCD HDTV", "Author": "Russell J. Marceau \"Russ Marceau\"", "ReviewID": "ROYFG02J1UFN", "Overall": "5.0", "Content": "I was skeptical about purchasing this HDTV over the internet, but it was so easy and practical.  The HDTV is the best investment I have made in years.  Picture is crisp and shart and almost looks 3-D sometimes.  It makes you feel like your are there.  I would recommend this TV to anyone who is in the market to purchase a new HDTV.  The 25,000:1 aspect ration is the best.", "Date": "December 1, 2007"}, {"Title": "Nice TV, as long as it lasts...", "Author": "Johnny", "ReviewID": "R36BTOIFOYLXP6", "Overall": "1.0", "Content": "The TV is a nice unit, except that it has a 'birth defect'.  Within 18 months of purchase it started clicking and not powering on right away, and eventually stopped working.  This is the second Samsung I own which had the same problem.  A few hundred dollars later, a TV repair shop replaced the power supply board and got it working again.  I wrote a more detailed report for the LN-T4669F model.  Samsung will completely ignore you because the 12 month warranty has expired.  Buyer beware!", "Date": "November 8, 2009"}, {"Title": "Very pleased", "Author": "J. Mcdaniel", "ReviewID": "RO0HA5NQM62U0", "Overall": "5.0", "Content": "I was very pleased with this purchase and haven't had any problems with the unit (I've owned mine for 9 months as of this writing).  It seems very intuitive and easy to use.When I was researching my purchase, I was concerned about the glossy finish causing glare or being easily damaged (I have two small children) but I selected this unit based on the specs and aesthetic look.  I definitely recommend looking at actual units in stores (I used Circuit City and Best Buy for my comparison shopping).  Anyway, the glossy screen hasn't been a problem for my home / use after all.I had also planned to mount this TV on the wall (to keep it safe from the little crazy people who live with us). After setting it on our console I was surprised at how stable it was and decided that the wall mount was unnecessary.  I may still decide to mount it someday but since we already have a console that we use to store our A/V components in I don't see a need to.", "Date": "November 17, 2008"}, {"Title": "GREAT BUY", "Author": "B. Wilmott", "ReviewID": "ROP5ISLTVHAK9", "Overall": "5.0", "Content": "Picture quality is oustandingBlu-Ray looks amazingGames look amazing120hz looks amazingalthought there is slight blurring sometimes during cable televisiona nd sometimes in movies, its not enough to make a difference in my opinion of this tv.  Its excellent.Got this tv at almost 50% retail price so I cant complain.If youre searching for a tv, then go no further than this.If your product is shipped using CEVA then make sure you call them to check on your tv.  They are really nice guys and I found a depot near my home and went and picked the tv up 5 days early.  They even let me pull my car in the warehouse and helped me load it up.  Their service is highly recommendable.10/10", "Date": "July 26, 2008"}, {"Title": "Awesome TV", "Author": "Xpert37", "ReviewID": "RJFISVSLIY1IZ", "Overall": "5.0", "Content": "I bought this TV about a month ago.  The blu-ray movies looks awesome on this TV.  The standard definition TV is so so, but I guess you purchase this TV mainly for blu-ray and high definition sports.Overall a good TV but I think the newer series (650) may be a bit better in terms of specs.  But they are still $1500 or more so since I only paid $1234 for this TV, it was well worth it.", "Date": "July 23, 2008"}, {"Title": "Gorgeous TV & Picture", "Author": "J Sherwood", "ReviewID": "R2MTVJ8O2NNFEE", "Overall": "5.0", "Content": "I ordered this TV late night July 1.  I got it around 11:00 this morning through CEVA.  The delivery service doesn't affect my opinion of the TV, but CEVA was excellent.I immediately hooked up my PS3 and HDMI cable (Cables to go 3 meter 10.2gbps, bought from amazon) and after fixing the sound and video output settings (I had it hooked up via DVI and RCA cabling, and my old TV only accepted up to 1080i) it worked beautifully.  Even without being hooked up to my surround sound system, the sound quality is good.  It won't blow you away, but given the form factor of the TV it's still better than I had expected and good enough that I'm not desperate to hook up better speakers.I popped in Blade Runner on Blu Ray and noticed the picture was a bit fuzzy.  I then checked and found that the PS3 was outputting 1080i as that was the best my old TV could display.  A quick change to 1080p and away I went and was absolutely amazed by the picture.  I didn't see any judder, and the colors were magnificent.  Black levels seem good, but I have it in a room with windows so I can't make it completely dark to really get a good feel for it yet.  The glossy screen looks nice when it's off, but is a little noticeable when you've got a direct light source on it.I bought mine as a refurb from Warehouse Deals by Amazon, which ran me less than 1100.  It came in the original box, has no dead pixels, and works perfectly.  There was some tape adhesive on the bottom over maybe two square inches, but that will come off easily enough once I find where I put the cleaner.  This was my first time buying a refurb product from anyone apart from the manufacturer, and it's been great.  Very worth saving $400.Amazing TV.  I'd say it's definitely worth the $1500 Amazon has it for, but paying less is always nice too.", "Date": "July 9, 2008"}, {"Title": "Fantastic TV", "Author": "N. Habboub", "ReviewID": "R3ITMH209IXFDY", "Overall": "5.0", "Content": "I love this TV. No issues with it at all so far. I am not sure if the 120Hz technology is full matured yet. I think the other model without the 120HZ is just fine. The reason I bought this is because the 120Hz model was discounted at a similar price to the model without the 120Hz.", "Date": "May 15, 2008"}, {"Title": "Samsung 40 inch 1080p 120Hz", "Author": "Samuel Lazcano", "ReviewID": "R1AFE9BCZU4D7A", "Overall": "5.0", "Content": "Excellent Samsung 40 inches LCD TV and easy to control and with nice features, item as new even though listed as refurbished, excellent seller and excellent customer support.", "Date": "May 11, 2008"}, {"Title": "Awsome TV.  Most Bang for your buck.", "Author": "Michael Schmitt", "ReviewID": "R2PR3Q8VUTNGUY", "Overall": "5.0", "Content": "Absolutely the best LCD TV for the price.  I would not waste your money on the 81 series.  the 71, has an awsome screen and really deep and vivid colors.  I do not  have an HD source yet, but I do have an upconvert Samsung DVD player. Makes things look really, really good.  Can't wait for the blu-ray disc players to drop in price to take full advanteage of the HD capabilities of this TV!", "Date": "April 7, 2008"}, {"Title": "Awesome", "Author": "C. Williams \"Mike\"", "ReviewID": "R3B1MREAMXRHS1", "Overall": "5.0", "Content": "Long store short, this TV is everything I hoped it would be.  Watching HD and/or DVDs are unreal.  With the contrast ratio and the 120hz processor, it looks like you are looking out the window.", "Date": "April 4, 2008"}, {"Title": "Very nice, worth the wait", "Author": "Ian Rushton", "ReviewID": "R278NGWM7TOVIC", "Overall": "5.0", "Content": "I did a lot of research on 40 inch LCDs and was down to this one and the Sony Sony Bravia XBR KDL-40XBR4 40-inch 1080p LCD HDTV and decided to go with the Samsung because it was cheaper and offered similar features.  I have been very pleased with the TV it has a really nice picture.  The form factor of this TV makes it very easy to mount on the wall.  It has been interesting monitoring the price of this TV, on amazon it fluctuated $300 in 2 months, so my advice is watch the amazon prices they seem to be seasonal.The only complaint I really had was how long it took to get the TV, not the shipping, but the time until the shipping.  It was shipped with the white glove service, they were excelent, showed up when they said they would and unboxed the TV and waited until I checked it out.After getting the TV I started the process of hooking things up, the only real issue I had was my mac-mini, Samsung doesn't seem to like the resolution over a standard VGA cable.  So I went round the local big box stores looking for cables, they wanted $60 for a simple DVI to HGMI cable, what a ripoff, I eventually ordered the cable off Amazon and got it in a couple of days for $15.  Got one for the video Cables To Go - 40320 - 2M (6.5ft) Velocity HDMI to DVI Digital Video Cable (Blue) and one for the audio Belkin Audio Y Cable Splitter 1-Mini Plug/2-RCA Plugs (6FT).  This turned my mac-mini into a great media PC on this TV.I haven't had to do any of the tuning of the TV like in other reviews, but I haven't watched any sports on it yet.  Waiting for college football in the fall.", "Date": "March 22, 2008"}, {"Title": "Best Picture I have seen on a LCD", "Author": "Michael", "ReviewID": "R2QC3JM7S5SUF9", "Overall": "5.0", "Content": "It took some convincing to bring myself to pay an extra $200-$400 over other 40\" LCD's.  But after bringing it home and hooking it up I was thouroghly impressed; and glad I did.  The picture is stunning.  Contrast is excellent.  The color is bright and vivid. Be sure to turn on the 120Hz feature to help with fast motion.  This TV does as good as any LCD I have seen with fast motion.  Veiwing angle is excellent.I recommend comparing this TV side by side with others in a big box store.  That is where you really can see the difference.  The blacks are blacker, the colors brighter, the detail is finer, and motion is crisp.", "Date": "March 21, 2008"}, {"Title": "Samsung LNT4071 40\" LCD Television", "Author": "WB \"WB\"", "ReviewID": "R2R3C68BQZBAIZ", "Overall": "5.0", "Content": "This television is definitely the best of all models we looked at, and we looked at many models in the 37-42\" size range.  I have had it for several months now and have had no regrets.The 1080p picture is extremely crisp and the 120Hz refresh rate virtually eliminates the motion blur prevalent in LCD TV's.  We enjoy watching college basketball, and the blur on many of the other sets was very noticeable.  The Samsung is extremely sharp especially with HD signals.  The only blur I am able to notice is on standard def signals and it not objectionable and much less than for the competing sets we compared.The sound is surprisingly good.  The set has acoustic vents on each edge of the set which dramatically improves the sound quality.  I have Bose speakers connected to the set, but only find it necessary to use them occasionally.  The sound from the built in speakers is natural and full.  Many of the other sets we compared were tinny and thin sounding.The set is somewhat more expensive than other models of the same size.  If you are mainly looking for a high quality image rather than the largest set for the money it is the best choice.", "Date": "March 15, 2008"}, {"Title": "Top of the Line 40\" LCD", "Author": "B. Tyus", "ReviewID": "R9XAKPOSFQAQA", "Overall": "5.0", "Content": "I received the Samsung (LNT4071) quickly through Amazon with no problems or hassels.  I've had this tv for 4 weeks and the picture quality is oustanding.  The HD channels are crystal clear and I haven't even tried out the full 1080p with bluray, but I could only imagine it would be out of this world!  Just take the chance for yourself folks... you will see!", "Date": "March 11, 2008"}, {"Title": "Absolutely Incredible", "Author": "Terry Moore", "ReviewID": "R2VXXOTXH2R66G", "Overall": "5.0", "Content": "Samsung LNT4071F 40\" 1080p 120Hz LCD HDTVTwo months after purchase and at least once a day I think, \"Wow, what an incredible picture.\"  There can not possibly be another TV on the market with a better picture.  I highly recommend it.", "Date": "February 29, 2008"}, {"Title": "This TV rocks !!!", "Author": "V. Nadig", "ReviewID": "R30EQ9A386FM3N", "Overall": "5.0", "Content": "Well, as everyone, I perfectly agree in saying that the TV rocks... We have had the TV for around 2 months now and I must say its amazing... The picture quality is too good.. Especially the HD channels... The 120HZ feature though is not much helpful. It does render the motion slow a few times, but things are fine if this is turned off... Of course you can hardly notice the difference in quality with it turned on...We did a lot of research before going for this particular model.... I literally freaked my wife out with frequent visit to shops to compare the prices and features !!! And not to forget by invading almost every website on Internet... Finally we found one we were looking for....Most importantly the TV is too good for its price.... We got it from Amazon when the price was as low as $1449 (with free shipping and a Logitech Universal Remote).. Seeing the price variations in last month, we got the BEST deal...", "Date": "February 6, 2008"}, {"Title": "Good purchase, great item.", "Author": "G. Aguilar", "ReviewID": "R1IS8G7BV9GBGB", "Overall": "5.0", "Content": "First I reviewed several tv sets before buying this one. I compare and read features as well as all negative comments about such items. At the end I made the decision to get this Samsung LNT4071F 40\" 1080p 120Hz LCD HDTV. I can tell you, I love this tv and at the price I got it, it makes me really happy. Let me tell you, HD channels look amazing, you have to work a little bit with the features of color, bright, sharpness, and contrast, as well as controlling the black intensity but once you find the ideal; according to your preferences you will feel within the environment you are viewing.  Movies? great if they are HD otherwise is just a waste of such a great electronic devise, so if you really want to enjoy your home theater, you have to plan for a blue-ray disk player or a HD-DVD player, I would go for a HD-DVD player, but that is just me because my bias against Sony and their market practices.  After all I would greatly recommend this HDTV.  Amazon purchase was easy, the delivery was excellent,they set an appointment for delivery, they were right on time,they unpacked and tested the item. This was the best purchase ever", "Date": "January 29, 2008"}, {"Title": "Awesome TV, especially for the price!", "Author": "AirborneLion", "ReviewID": "R3185IU8HV8S9V", "Overall": "5.0", "Content": "This is an amazing 40\" TV for anyone who watches a lot of movies, plays a lot of video games or wants to use it as a monitor for their computer; or all three! I use it for all three myself. The picture is one of the best I've ever seen, especially if you hook up your components via HDMI.It has tons of connections. More than anyone other than an audiophile or videophile will ever need. You can even hook hook your speakers to it! This was a feature new to me. I'm used to having to buy a receiver.Long review short, this is the best bang for your buck in its price range. Espceially if you want a bright, gorgeous picture and full HD.", "Date": "January 28, 2008"}, {"Title": "Amazing picture quality, like looking through a window", "Author": "Dan", "ReviewID": "R34W6E8CJOIFPX", "Overall": "5.0", "Content": "This TV hands down has the best picture quality I have ever seen. It doesn't even look like a movie anymore but like you are there live, filming it yourself. AMAZING STUFF!", "Date": "January 26, 2008"}, {"Title": "GREAT  T.V. /  GREAT SERVICE", "Author": "Edward Redman \"Redhawk\"", "ReviewID": "R3PCD6A1YS7C6X", "Overall": "5.0", "Content": "Best T.V.I have ever watched since we had our first Sylvania 24\" in 1952. It's quite a change to the Samsung 4071 LCD. It blows your mind. Ballgames are better than being at the game and a lot less money!!! WOW!! WHAT A PICTURE!!!  The Eagle shipping (white glove service) was a surprise. I didn't expect that!! Amazon was a GREAT experience thanks to their low price and FREE SHIPING.  THANKS AMAZON for the great SERVICE!! We are not used to that kind of service up here in MAINE!!", "Date": "January 19, 2008"}, {"Title": "Great Purchase", "Author": "David Estlack \"Retired and Loving it!\"", "ReviewID": "R2JGDLY8P9DP9I", "Overall": "5.0", "Content": "Samsung LNT4071F 40\" 1080p 120Hz LCD HDTV  I ordered the Samsung 4071 from Amazon on Wed Dec 12 and delivered on Mon Dec 17 - FAST!  Eagle called Fri PM for day to deliver.  I requested next day, but they don't deliver weekends.  I read all reviews and negatives caused me to hesitate.  Continued research at local stores and finally decided to go for it.  Not disappointed, great TV, except for remote.  Could not program for DVD, etc.  Have cable remote and it works everything.  Only use Samsung remote to change internal TV settings.  We moved up from an old color 19\", had about 20 years, to this 40\" - was very dramatic.  This TV did not look so large in the \"big box\" stores.  It is huge addition to our living room, but so much more enjoyable.  Wife was out of the house when the TV was delivered - I thought she was going to have a heart attack when she walked in and saw this big 40\".  After adjusting to it, she enjoys watching this TV as much as I do, now.  Not sure how to effectively use and enjoy the 120Hz feature, but hope to learn soon. Have noticed what other reviewers may be talking about when they complain of \"flashes\".  True, our old analog 19\" never acted like that.  For us, the \"flashes\" are not distracting enough to matter because this TV is way better.  We turned the 120Hz off, for now.  Exceptionally happy, so far.  I guess only time will tell.  If this one lasts another 20 years - WOW!  Samsung and Amazon both ROCK!  Amazon was hundreds below local dealers.", "Date": "January 15, 2008"}, {"Title": "Better than my Sony!", "Author": "R. Diaz \"HD Guru\"", "ReviewID": "R25MM0G0B6675M", "Overall": "5.0", "Content": "I bought my 1st HDTV on impulse.  I thought I didn't have much to loose, it was a 32 Sony as a replacement for a TV we only watched 1 hour or less a day, good price, good name, what the hey. Testing the water I guess.  I have only bought Sony until now.  I did my homework for the 2nd HDTV.  The more I researched the more I liked this Samsung.  Then I saw it in a local retailer, I was SOLD! The picture has the sharpest picture I found.  Sure the Sony XBR5 is great but at near to twice the price of this Samsung.  So the picture and the reviews sold me, then I shopped around for the best price, thank you Amazon!  Now after getting it home and plugging it in that's what will keep me buying Samsung for a long time to come.  I spent hours, seemed like days, setting up the Sony, but I plugged in this Samsung and started enjoying it within minutes. No wonder they are #1! AWESOME HDTV!", "Date": "January 15, 2008"}, {"Title": "Great Product - Best TV out there", "Author": "J. Kutsikovich", "ReviewID": "R3RMKBO20U2G95", "Overall": "5.0", "Content": "I recently purchased the LNT4071F and have been nothing but impressed with the quality of picture on both HD and standard def inputs.  The semi-gloss screen smooths out motion and provides a deeper, realistic looking picture.  I have had no problem with any sort of reflection, which is what others had written about.  The automotion plus function does have kinks, making some scenes in movie look almost cartoonish, but I just turn it off at will.  The contrast ratio is great, the cabinet is sleek and fits well at roughly 6-7 feet away from my couch.  I had spent a few months going to Best B and Circuit C checking out a variety of TV's and the LNT4X71F were the best.  The closest TV I would place to this one was the Sony Bravia 46BRX4.  That TV looked great, but head to head, it was an obvious choice.", "Date": "January 13, 2008"}, {"Title": "Unbeatable.", "Author": "John M.", "ReviewID": "R1RU39XFUI2MEN", "Overall": "5.0", "Content": "I did a lot of research before purchasing this TV.  It is pretty much the best 40\" 1080P TV out there right now.  The picture quality is superb.  Movies, TV and games look great.  Blacks are pretty black.  Amazon's delivery was excellent.  The delivery persons unboxed and tested the TV before leaving.  Shipped very quickly.  No tax, free shipping and saved almost $1000 off the price of big box stores!", "Date": "January 12, 2008"}, {"Title": "Great purchase, price & delivery - set up", "Author": "J. D. Laurie", "ReviewID": "R3MR8IWLU0H7BA", "Overall": "5.0", "Content": "I shopped price on this item and found the lowest price at Amazon.  I selected the free delivery option and when I went on line a week later saw that the price had come down $200.  A phone call to Amazon resulted in crediting my account for $200.The TV set up was surprisingly easy. The set comes with the factory defaults set to the dynamic (brightest) setting and I changed it to standard.  For some reason my set was in \"shop mode\" which caused it to reset every 30 minutes to the factory settings.  I was able to change out of shop mode after a visit to the support section of the Samsung web site.This is the best picture for a TV under $1500.", "Date": "January 7, 2008"}, {"Title": "Samsung is the best", "Author": "G. Martin", "ReviewID": "RZMHUV1M94H60", "Overall": "5.0", "Content": "I just purchased this Samsung and let me tell you it will blow you away.  I went to Circuit City looking to buy a 42\" Sharp Aquos, saw the 40\" Samsung and had to have it.  With the new 120hz technology, HD just got even better.  Sound is very good and the cabinet is clean and free from buttons and the like.  I have programmed my Dish DVR 621 remote to control the LCD. (used code #738) Press and hold down the small TV button at the top of the Dish remote until all the small buttons light up.  Put in the code and press the # button.  Now you can control the Samsung LCD with your Dish remote. (Power, Mute, and Volume up and down) Hope you enjoy your purchase of the Samsung LN-T4071F as much as I am.  Be aware that the 71F does have a glare factor, however once you turn it on the glare is not a problem.  If glare bothers you then go for the 61F.", "Date": "January 14, 2008"}, {"Title": "Superb", "Author": "Carlos A Bas", "ReviewID": "R2C1455Y1LPB9H", "Overall": "5.0", "Content": "I bought one of these in 46 inches. Before buying I was somewhat reluctant because of its shiny screen. As it turned out, it isn't a problem, on the contrary, it seems to help in delivering brighter colors and deeper blacks. This TV is absolutely superb.", "Date": "October 8, 2007"}, {"Title": "First day - New to HDTV - Very impressed", "Author": "Ray", "ReviewID": "R1RYHCD3PNY3M1", "Overall": "5.0", "Content": "For starters, the set was delivered by Eagle USA. Some people have reported bad experiences with them. For me, everything went perfectly.I've only had a couple hours to play with the TV, and then only with daytime fare. (Oh yeah, I forgot to mention, Eagle showed up at 7:00 am just like they said they would.) (Note to any retailers who deliver and set up HDTVs at the customer's home: You should do this job in late afternoon so the customer's first viewing experience is during prime time.) The TV is currently hooked directly to the cable, so the only HD content I can get right now is the network broadcast stations in New York. Only one is broadcasting in 1080i, and the picture is remarkable. All the hype you've heard about HD providing a 3D kind of effect is true.Now the bad news. The other broadcast stations are broadcasting what they call HDTV at 720p. The picture is actually worse than SD. I think they're taking an SD signal and encoding it at 720p. The result is crystal clear compression artifacts. I blame that on the broadcaster, not the TV. The TV actually does a very good job of enhancing SD content, but when a digital signal comes in, they probably assume (naively) that the people at the source knew what they were doing.I can highly recommend this TV for its quality, features, etc. But it's only as good as the signal that goes into it. Make sure you know what you're going to be able to watch. Just because something comes over the air as HDTV doesn't mean it was HDTV all the way back to the camera. Upsampling a low quality signal to HDTV makes things even worse. And when something is called \"digital\", watch out. That's going to be 480i, and it could be so compressed that it will look like a third generation videotape in EP mode.", "Date": "October 31, 2007"}, {"Title": "Almost perfect", "Author": "David A. Wagner \"dw\"", "ReviewID": "RL0Y2T3SVD8ZN", "Overall": "3.0", "Content": "Let me start by saying this product exceeds my expectations in many ways.  It's picture is better than any other TV I've seen on the market.  I love the 120 Hz motion technology and the ability to disable that function, or reduce its efficacy.  Contrast is also better than any TV i've seen.  Downside is that motion sometimes has a halo effect.  That is, when an object is fast moving, there can be a blur around it. This can occasionally be fixed by disabling the 120Hz, but that doesn't always alleviate the problem.  Additionally, the images can go slo-mo for no apparent reason.  Finally, the images can break down with boxes and blur.  These things happen infrequently, but are troublesome enough to raise concerns for new buyers.  I am not sure any TV is any better, but this should be something manufacturers aim to fix next generation.", "Date": "February 13, 2008"}, {"Title": "Very Happy!", "Author": "J. L. CLAASEN II \"FUN Techies\"", "ReviewID": "R33LXWB7VQXLYR", "Overall": "5.0", "Content": "When I make my technology purchases, I do a lot of research on product review sites and customer review sites. This product is top rated. It is cutting edge and I am very happy with my purchase. It has great functions, looks great, love the fact that it rotates on the stand, and it is great TV for Condo's, Apartments, and houses. I bought this to watch it in the living room and will be moving it into the bedroom eventually. It is not too big (since I had a 51\" before) and I regularly play my Xbox 360 Elite on it, and it looks awesome!I recommend this product.", "Date": "November 1, 2007"}, {"Title": "I am embarrassed at how much research I did only to have the tv fail in 2 months", "Author": "Golfing Fool", "ReviewID": "RT52I0H6V8JJS", "Overall": "3.0", "Content": "Family and friends told me I spent more time reviewing what HDTV LCD to buy than purchasing a car or a house.  Ha, I thought --- I am getting a Samsung 4071 where 90+% of the reviewers are happy.  I never thought I'd be one of the 10% to have the TV TOTALLY FAIL.  No picture, ghosts, then grey screen.I had been very happy despite the fact price went down more, newer models out - I had no complaints.My big concern --- the threads and reviews I've read about Samsung's service, warranty and people having to wait 30 days or more to get a power or control panel.  Time will tell and I'll update the review re that.I got rid of a perfectly good, 10 year old 32\" Sony only to upgrade to something that fails in 2 months.  Pretty scary.UPDATE:  It is SUN 6/21 and I still don't have my tv... The Samsung outsourced repairman is local and has replaced several things - still not working.  Has ordered supposedly the last two possible parts/display boards it can be and should be out here Monday.  He says failure rate is 1-2% and that is considered good and that they fix them.  He still endorses the product over other brands.  While I recognize this is who is buttering his bread, Samsung service center and this repairman have been relatively responsive in phone calls, calling back, etc.  To me this is a big portion of customer service.  Will update if it ever gets working.Update on 2/14/09:  The last component that could be replaced without just getting me a new tv, was finally replaced and all has worked superbly since then --- way back end of JUN08.  Samsung tv repair representative said it was like getting a new tv since all the replacements were newer.  In any event, everything I had thought it would be --- love it.  Spoiled, just ordering a new Samsung 19\" for my bedroom.  Despite all the initial issues, am happy with Samsung product", "Date": "June 8, 2008"}, {"Title": "Stop buying this TV! I want to get it on sale", "Author": "Jeff Eberl \"Jeffeb3\"", "ReviewID": "R20559OZ6TA83H", "Overall": "5.0", "Content": "It's horrible.  It's the worst TV ever.  Now stop buying them so amazon will get them in stock and make them cheaper for me.  Since Christmas, I decided I wanted this TV, and I'm just waiting for my savings to equal the price.  It would help a lot if you people would stop buying them from amazon...Just to add to the conversation, I noticed a lot of people compare this TV to the sony's.  One great reason that I decided to get this TV over the Sony is that the reviews at the sony say things like, \"This is a great TV, I've got oodles of money, and I was able to spend it on something my friends are impressed by\" and the reviews for this TV say \"I've been doing lots of shopping, comparing, and researching, and I chose this TV\".Look at the reviews, it's totally true.  Now amazon, find me a deal on this TV!", "Date": "January 28, 2008"}, {"Title": "Fantastic TV", "Author": "John A. Smith", "ReviewID": "R3L61AEJJ8TKB2", "Overall": "5.0", "Content": "I bought this TV a month ago and couldn't possibly be happier with the picture quality and design.  This TV is beautiful, I can't imagine HD content looking any better than it does on this screen.", "Date": "December 11, 2007"}, {"Title": "Samsung TV", "Author": "CGBF", "ReviewID": "RH0ZBFF1GFU0", "Overall": "5.0", "Content": "AT the time I bought the unit Amazon had the best price and FREE delivery to my door with set up. I have had trouble free viewing with this unit and WILL BUY ANOTHER ONE with new updated equipment SOON. Probably from Amazon again. CGBF", "Date": "November 29, 2013"}, {"Title": "GREAT BUY!", "Author": "Jnice", "ReviewID": "R2YB5ILBQCF39P", "Overall": "5.0", "Content": "I purchased this item several years ago. IT HAS BEEN AN AWESOME BUY! GREATEST INVESTMENT I HAVE EVER MADE! Only downfall I have is that now, several years later I just bought a 60 inch for HALF the price. LOL. No complaints here as back then, this tv was AWESOME and still is.", "Date": "November 13, 2013"}, {"Title": "Capaciters Go Bad", "Author": "Ed", "ReviewID": "R29WDEWFQLLIV1", "Overall": "3.0", "Content": "I bought this Samsung only to find that there are faulty capacitors installed in many Samsung TVs.  Samsung will do nothing about it and there was a class action lawsuit against Samsung: Samsung lost.  I will never buy another Samsung product because they will not stand behind what they sell.  The company has gone downhill.", "Date": "February 25, 2013"}, {"Title": "Fluttering of picture", "Author": "Johnnym", "ReviewID": "R30ABJ2GUXZ1LZ", "Overall": "2.0", "Content": "Have for almost 5 yrs. Now picture flutters all the time and Samsung indicates it is internal hardware. I was happy with TV until this. I spent a lot of money on this TV and would expect to get at least 10 yrs out of it. May think about buying a different brand in the future.", "Date": "October 15, 2012"}, {"Title": "Good TV but has it's flaws.", "Author": "chriscw72", "ReviewID": "R1KLRPKFYEV8NO", "Overall": "3.0", "Content": "This is actually a pretty good TV set. For it's time it was top of the line and i remember when i first witnessed the performance of the 120 hz display in Best Buy I was blown away by the realism of the images on the demo Blu Ray. Once I purchased the TV, the 120 Hz actually became quite annoying after awhile, and I noticed some image blurring in fast moving scenes which was completely the opposite of what was supposed to be purpose of the technology. Plus, apparently this model was manufactured from the start with a defective capacitor in the main power supply board. The TV started making a clicking noise and would not power on less than a year after purchase. I was able to find a replacement board for a decent cost on a third paerty website and I actually replaced it myself. Since then I havent had any difficulties, but this television has become basically obsolete in the face of newer, more brilliant LED tv's. My advice if you're considering a purchase........shop around for an LED instead. If you already own this TV, sell it for all you can get and upgrade to an LED at first opportunity.", "Date": "June 8, 2012"}, {"Title": "Great picture while it last", "Author": "Ext", "ReviewID": "RY15OUXWOG0FX", "Overall": "2.0", "Content": "I purchased this TV in the fall of 2008 for around $1,200.  The TV has not been moved, and has been kept indoors at 68-72 degrees the entire time it has been owned.  The picture was origionally wonderful and I got two solid years of enjoyment out of it.  However, about 5 months ago, the TV starting taking time to \"warm up\" and required anywhere from 5-45 minutes to recognize the video signal.  About 4 months ago, the TV started to develop verticle lines of dead pixels and experienced a bad ghosting effect for the first hour of operation.  Within the past 2 months, the TV has lost the ability to light the picture uniformly, resulting in the right side of the TV's picture being to dark to actually see the content.  The product's 1 year warranty has long since expired and Samsung has been completely unwilling to offer any support.  The TV was great, but for the price, I expect far more than two and a half years of utilization.", "Date": "December 7, 2011"}, {"Title": "Great television!", "Author": "eric", "ReviewID": "R2YANKIR5WHQ3Y", "Overall": "4.0", "Content": "I purchased this television Feburary 2008 and recently upgraded to a larger television last month. I stuck with Samsung based on how much I liked my LNT4071F. I moved this to my workout room because I refuse to sell it since it still is such a nice looking and performing television. I highly recommend this television!", "Date": "September 1, 2011"}, {"Title": "My first flat screen TV", "Author": "J. H. Carpenter", "ReviewID": "R32G05P72CUFX4", "Overall": "5.0", "Content": "I love this TV. I purchased it several years ago. The price was great and the set-up service can't be beat. They delivered it, set it up and made sure it worked before they left. How can you match that service. Amazon is the best of the best!", "Date": "August 24, 2011"}, {"Title": "Do NOT Buy Samsung", "Author": "steph1978", "ReviewID": "R2T3Y85OLWCPK9", "Overall": "1.0", "Content": "We bought this TV less than three years ago. We never were happy with the image quality and less than three weeks ago the display went out. Just got off the phone with Samsung and found out that there was nothing they could do for us. It's hard to believe you spend that much money for a TV and it goes out in less than three years. DO NOT BUY SAMSUNG JUNK.", "Date": "May 2, 2011"}, {"Title": "Best TV I've ever owned", "Author": "Dash", "ReviewID": "R3SI0UZTQEUNT2", "Overall": "5.0", "Content": "This is the best Tv I've ever owned. While that isn't saying much, this TV is excellent. I bought it used off craigslist and made sure to do my homework before I bought it. With all the reviews on amazon and everyone raving so much about it, I couldn't pass it up for $600! I haven't mounted it on the wall yet, but that will come soon. I have everything hooked up to this tv, my satellite, my xbox 360, and I use it as a second computer monitor for watching netflix and movies. I have had no problems whatsoever. Wonderful tv and wonderful picture.", "Date": "July 13, 2009"}, {"Title": "buy it!", "Author": "jb jelly \"car pro\"", "ReviewID": "ROUZXM9JWVIKF", "Overall": "5.0", "Content": "simply awesome!! the 120hz on high is a little funky, but I think technology for transmitting will help that.", "Date": "March 1, 2009"}, {"Title": "LOVE this thing", "Author": "mjs", "ReviewID": "R1DAQ7IMU2OGZW", "Overall": "5.0", "Content": "This has to be the best piece of electronics that I have ever bought. I have had it for almost a year and I still love to look at it. It has a really smooth design and is just simply attractive. I love being able to just walk by and touch the power bar and have it turn on. There is no need to search for some small power button like most TVs.When I originally purchased it I had satellite with HD and I thought the video was awesome then. I just upgraded to a PlayStation 3 and watched Blu-Ray movies. What can I say I fell in love again. The colors are just so crisp and clear. I can hardly stand watching SD TV.I would not trade it for anything. Well, maybe the 46 or 60 incher.", "Date": "October 13, 2008"}, {"Title": "Great LCD TV", "Author": "S. D. Stokes", "ReviewID": "R2F75M5SJTARA9", "Overall": "5.0", "Content": "My first HD TV. Very happy, the TV arrived early and was unpacked and tested in my house. The set hooked up easy using HDMI cables to my DVD and Dishnet SAT. Set up was easy and the picture is great. HD programs are the way to go, sooner that all TV is made in HD the better, find that we watch mainly HD programs. Have not found the need to change settings much, the factory ones seem fine. Sound is good but a full surround sytem would be a good upgrade.", "Date": "May 27, 2008"}, {"Title": "We love this TV.", "Author": "Fabi Prabhakar", "ReviewID": "R3BWEH8Z0CNN8M", "Overall": "5.0", "Content": "This is a great TV, everything we hoped it would be. It has amazing picture and it looks great too. BTW, this is our first HD TV and we absolutely love it.", "Date": "April 8, 2008"}, {"Title": "Samsung LNT4071F 40-inch 1080p 120Hz LCD HDTV", "Author": "Donald L. Smith \"Pop\"", "ReviewID": "R1A1SRYFSSLBFL", "Overall": "5.0", "Content": "Order this HD TV as an \"Open Box\" product. I always cross my fingers when ordering a refurbished or open box product, but Amazon's policy of 30 day guarantee or full refund makes it easier. This TV was delivered in a factory new box and is in perfect condition. The picture on this baby is crystal clear right out of the box. Even tho I did make a few adjustments to the tuning. The price was much less than a \"store bought\" new TV. The picture is so life like, especially the golf tournaments, that it's almost like looking at the real thing through a window. I HIGHLY recommend this.", "Date": "April 7, 2008"}, {"Title": "Beautiful", "Author": "E. Bennett", "ReviewID": "R18A75HJFNGRQO", "Overall": "5.0", "Content": "I had been looking for my first HDTV for more than a month, trying to find the best one for the best price. I went to a major retailer to look at one and the Sales associate wanted to show me the one he thought had the best picture, of course it was not the one I was looking for but I obliged. I fell in love the instant I saw it. The picture was better than any I had seen in the previous month of looking. I went home and looked it up on the internet and found it here for $1000 less than the retailer. It was very easy to set up and the controls are very user friendly. I just can't watch baseball in the 120 Hz mode, but that is easily fixed by the push of a button.", "Date": "April 6, 2008"}, {"Title": "Great TV", "Author": "W. Pabst", "ReviewID": "R110XZNQM1MVNI", "Overall": "5.0", "Content": "I purchased the 52 inch (LNT 5271) model last September and like it so much that I just purchased the 40 inch (LNT 4071) model for the bedroom.  The picture on the Samsung 71 series far exceeds that of other brands I've looked at.  With Amazon's no tax and free shipping, I purchased these TVs for $1,200 and $800 less (52 inch and 40 inch, respectively) than what I would have paid at BB and CC.  Can't beat that!", "Date": "March 10, 2008"}, {"Title": "Samsung 40 120hz", "Author": "K. Kappelmann", "ReviewID": "R1PIEDK38KOOYS", "Overall": "5.0", "Content": "I have had my TV for about a week now and it is great.  The inputs are great and the picture is amazing.  This is a great TV and the Amazon service it great.  I was worried because some reviews said it was difficult to get any help or answer from Amazon.  But they have a great option that you input your number and hit call me.  Then the phone rings and connects you to a live agent!  No dialing a 800 and phone menus then waiting on hold, straight through to the agent! Wow!  I also had a good experience with the free delivery (ceva).  I would also recommend that you call the delivery co once it is close to your delivery date.  Just to verify the ETA and check the status.  The only negative thing I noticed was that the tracking info on Amazon did not update.  It just showed the  delivery date and that it left the warehouse.  Last but not least the price of this TV was untouchable.  Thanks Amazon!", "Date": "March 5, 2008"}, {"Title": "Awesome HDTV", "Author": "DSV", "ReviewID": "R24URENLDENT2R", "Overall": "5.0", "Content": "I waited quite a while before I finally purchased an HDTV - I read numerous reviews and did a lot of comparison shopping prior to deciding on this TV.  I am extremely pleased with the TV - great picture, sound - easy to setup - and controls are very user-friendly.  The TV was also delivered several days sooner than expected.  Overall quite pleased with the whole experience.", "Date": "March 3, 2008"}, {"Title": "Couldn't ask for a better LCD TV", "Author": "R. Wild", "ReviewID": "RJG61E19SJP2", "Overall": "5.0", "Content": "This TV is awesome! I had a Samsung plasma a couple of years ago and the picture was very grainy. This has the best picture I could imagine. I did some research and found out that this is model is the best bang for the buck. While the 4281 has the LED backlighting, It isn't worth double the money.I ordered it through Wearhouse Deals. It is obviously an open item. The only thing wrong, however, the only things missing was the remote and the cleaning cloth. Since I already ordered the Harmony 890, no prob!! Not having the remote that I wasn't going to use anyway is totally worth paying the $1200 less. In the end I only paid $1350 including shipping.", "Date": "February 27, 2008"}, {"Title": "As great as they said", "Author": "B. Brockman", "ReviewID": "R7ST87W3CID04", "Overall": "5.0", "Content": "Amazon has done it again.  I explored all the various HDTV's, and because of the value(one third off), and the great reviews, I decided to purchase it.  The first one arrived damaged, and Eagle did a great job of helping me out.  Their white glove treatment is the best.  The television was replaced, with no hassle, and it works like a charm.", "Date": "February 21, 2008"}, {"Title": "oustanding LCD", "Author": "e", "ReviewID": "R150TV041YL128", "Overall": "5.0", "Content": "Bought this and the XBR-4 for different rooms. Mount this puppy in a room without bright windows because of relectivity. This has a perfect picture folks. For bright rooms get the XBR-4 series.", "Date": "February 17, 2008"}, {"Title": "4071F Rocks", "Author": "jhill", "ReviewID": "R375REDTYU6QFE", "Overall": "5.0", "Content": "I've had the Samsung LNT4071F for about a month now; picked it up for the big name. Being from New England the score was a drag, but the picture was ( and still is ) fantastic.Out of the box, just about plug and play. The set comes with three configured modes (dynamic, standard, movie) to choose from and don't think that is it. Each mode is configurable. For that mater the on screen menu is easy to use and just about everything can be tweaked so if you're a normal guy you can choose from the standard modes and if you're a super geek you can tweak everything to your hart's desire.One of the best config items I like about the set is that you can configure / customize each source input; so if you have a cable box, blue ray, and a xbox 360 like myself you can customize each source just the way you like it.My family loves hockey and watching these fast passed games on this set is unbelievable.I have not tried the PIP or plugging my laptop into it, but everything else is like I said; Fantastic!If your thinking about a large screen (lcd or plasma) you got to consider this set; its that great.", "Date": "February 13, 2008"}, {"Title": "Great TV for a Great Price", "Author": "Craiger \"Craiger\"", "ReviewID": "R3GKIB5RPBZTHY", "Overall": "5.0", "Content": "After weeks of looking around at many TV brands, I decided to go with the Sumsung LNT4071F. It not only did it have the best picture, it also had the best features at the best price. I can't recommend this TV enough.", "Date": "February 11, 2008"}, {"Title": "Excellent", "Author": "Semajjsj", "ReviewID": "R3UQ5OPCQ4JY8E", "Overall": "5.0", "Content": "I spent months and months researching and finally decided on this one.  I have to say this is probably one of the best purchases I've made.  I'd recommend this model over any other system including the sony bravia models. The only con to this unit is sound.  The sound definitely wasn't as bad as I had anticipated.  One last thing, the issue of \"glare\" is a non issue.  My 10th floor apartment faces east and the whole place gets extremely bright in the am.  No issues with glare despite the brightness...", "Date": "February 9, 2008"}, {"Title": "Great Product, Great Service from Amazon!", "Author": "Karen L. Mauro", "ReviewID": "R335DXY06KOGEV", "Overall": "5.0", "Content": "I recently purchased a 40\" Samsung LCD High Definition TV from Amazon.  The entire process from ordering to delivery was flawless.  The TV is amazing; the price was lower than the local stores; the gentleman who delivered it was polite and helpful.  He unboxed the TV and placed it on the table for me.  I would definitely order from Amazon again.", "Date": "February 9, 2008"}, {"Title": "Overall a Great TV", "Author": "Amazon Customer", "ReviewID": "R1ZSV48JDNWEOR", "Overall": "5.0", "Content": "I've had this for about a month now and am impressed with the quality of the picture.  I had to play with the color levels when I first got it but besides that it has worked flawlessly.  I really enjoy watching BlueRay films on it.  Watching Digital Cable on it is disapointing but I upgraded to HD Cable which looks amazing.  Amazon's service was fantastic and the delivery was smooth.  They gave me a 4 hour window and they were there in the first few minutes.  Overall I would recommend the TV, but only if you buy it from Amazon since the price is so much cheaper than the retail stores.", "Date": "February 8, 2008"}, {"Title": "Absolutely satisfied", "Author": "Craig Michaelsen \"vikingservices\"", "ReviewID": "R2YRG5XTG1ZPCM", "Overall": "5.0", "Content": "Our purchase and shipping experience was without problems.  I researched for a while and settled on the Samsung and have not been disappointed.  The display is set up to handle inputs from our antennae, satallite, PC and Wii game.  I think the picture is on par with a plasma unit and its lighter (weight) and energy efficient are added bonuses.  The 120hz feature does make a difference when watching fast action sports, but I still see a little blur when watching hockey.  The only improvement I think Samsung needs to make is with the remote control; awkward feel when using and I would like to get directly to a source (PC/Game/Ant/Sat) as opposed to chaining through the inputs.cheers", "Date": "February 8, 2008"}, {"Title": "Excellent LCD", "Author": "Thomas Gooch \"GCJmfg\"", "ReviewID": "R1QGD8ZD8U5Z92", "Overall": "5.0", "Content": "Packed very well, no problems in the fast shipping. The picture on this TV is exceptional. Highly recommended product!", "Date": "February 8, 2008"}, {"Title": "Excellent", "Author": "Chris Newhouse", "ReviewID": "RLPFXBH93KC28", "Overall": "5.0", "Content": "This tv is amazing.  The quality of image is great.  The only problem is the speakers which I'm guessing would not be an issue, since you already own or plan on owning a home theater system.", "Date": "February 8, 2008"}, {"Title": "Samsung LNT4071F 40\"", "Author": "Duane A. Lueders \"Luedd66\"", "ReviewID": "R1DUX2GKH2S5JQ", "Overall": "5.0", "Content": "This TV was exactly what we wanted, it was delivered before the projected delivery date. Amazon's white clove delivery was everything they claimed it would be. We also have a rear projection 55\" HDTV there is no comparison between LCD HD and rear projection HD. If your in the market for a HDTV go with the latest technology and buy a LCD. The TV is mounted on the wall in our bedroom. The TV is light enough that two people can mount it, no professional help is needed. One recommendation make sure you attach all cables before hanging it on the wall as the rear plugs are not easy to reach if you use a flat wall mount.", "Date": "February 8, 2008"}, {"Title": "Samsung Model LNT4071", "Author": "Mark Roberts \"MKR\"", "ReviewID": "R2J8A4M8IA3V0L", "Overall": "5.0", "Content": "Picked it up earlier this year, Absolutely pleased with this screen just as advertised the picture quality is better than anything else I looked at, the response time on it is good cannot rave enough about all the outlets it has.  Still trying to figure out why USB Port doesn't work for me. Picture is such high quality that I rarely will see anything televised that will match 1080P closest so far are sporting events at 1080I.Also the trucking company that Amazon uses was on time and very professional (I was apprehensive after having read a bad review about the delivery service).  I definetely recommend this product.", "Date": "January 28, 2008"}, {"Title": "Very Pleased", "Author": "Duane M. Brophy", "ReviewID": "R1WSB9VDM0BEVN", "Overall": "5.0", "Content": "I am very pleased with my Samsung HDYV.  With the 3 tuners, I now receive the DTV cable programs without the need of a cable company set top box. I receive the local HDTV channels with a small indoor GE Quantum HDTV antenna. The stations are at least 15 miles from my home.I would recommend this Samsung HDTV to my friends.", "Date": "January 27, 2008"}, {"Title": "Eye Candy", "Author": "Ross Schweiger", "ReviewID": "R135HTTXHWTKNH", "Overall": "5.0", "Content": "I purchased this TV from Amazon just 2 weeks ago and have been nothing but impressed. I have to agree there are slight issues with the 120Hz frame rate (lags the picture now and then in regular dvds and with basic cable), but it's nothing that I cant live with. The few HD channels I pick up over the air are incredible, picture on basic cable is clearly improved compared to old TV.. its just PRETTY. Hookups are plenty and easily accessible. Sound is great, though not a lot of bass. But who isnt going to add on a theater system with this thing anyway!? Wondering why there isnt a power button ON the tv along with other touch sensitive controls (AWESOME!!) so dont lose remote. Overall, worth every penny!! Youll be glad you went with this one for sure, especially when all the other technology out there catches up. Why not be ahead of the curve?", "Date": "January 27, 2008"}, {"Title": "Completely satisfied", "Author": "Serge Franche", "ReviewID": "R2PSSG4DBBBW22", "Overall": "5.0", "Content": "I am stunned that I had no problems at all from the vendor shipping date to the installation process.The TV works without flaws and like advertised.The TV  generates a lot of heat so have a room with AC during summer.", "Date": "January 26, 2008"}, {"Title": "Excellent tv", "Author": "R. Alderman", "ReviewID": "R31B8W5EQHUXYF", "Overall": "5.0", "Content": "I researched for months before finally settling on this tv.  By far in the price range I set for myself, this tv was the crown jewel.  Walking around Best Buy it easly had the best picture of any tv in the store.  The 120 HZ really shines and gives a very realistic look to BluRay movies.  I'm not sure of the sound as I have a full surround sound system hooked up.  The tv is sharp looking.  I have mine in a brighter room, so there is a little glare but nothing that should deter you from buying this tv.  I used the factory settings right out of the box, didn't even adjust anything, though that's up to you and your preference.  Looks great on the wall and I'm happy.  The only regret I have is not getting the 46 inch version.  That's it.", "Date": "January 26, 2008"}, {"Title": "Spectacular", "Author": "hrmajsty", "ReviewID": "R1UP5K059EWJG7", "Overall": "5.0", "Content": "This HDTV is better than we had hoped, and we did a LOT of shopping around. It is lightweight, a cinch to hook up, and Amazon had the best price we could find. The picture is outstanding. Highly recommend.", "Date": "January 24, 2008"}, {"Title": "Best picture possible.", "Author": "Everett C. Springer", "ReviewID": "R1WV9SN1Q71UVP", "Overall": "5.0", "Content": "Good research usually leads to desirable product selection. This reviewer used nonprofit consumer organizations, commercial product reviewers, manufacturers product specification sheets, distributor displays and months  of time to select the best possible high definition television set for my specific situation.  The Samsung LNT4071 40\" 1080p 120Hz LCD HDTV arrived only days after being ordered, and as soon as I arranged for the installation of the HD DVR/receiver on my Dish Network system, I was ready for the moment of truth. The picture is even better than expected - it has to be the best picture possible.", "Date": "January 24, 2008"}, {"Title": "Great TV! And came in great shape!", "Author": "Hilary Rhodes", "ReviewID": "R3MT3YLOUKEKEC", "Overall": "5.0", "Content": "I don't have long to write this review. But I want to review it before I forget! If you are:a. Thinking of buying this TV but are not sure.b. Are thinking it will be to smallThen just get it! It's perfect! Great TV!Be sure to calibrate it once you get it!", "Date": "January 24, 2008"}, {"Title": "AWESOME!!!!!", "Author": "Albert F. Busby", "ReviewID": "R82BSYYIUO0R0", "Overall": "5.0", "Content": "WOW!!! amazing picture from all angles. slight artifacts on the edge of the screen, but that could be because I'm using standard dvds with an up converter instead of blu-ray discs!!!! but anything connected via HDMI looks awesome!!!!!!!!!!!And also most things that aren't!!!!!!", "Date": "January 23, 2008"}, {"Title": "AWESOME SERVICE", "Author": "Joyce E. Elledge", "ReviewID": "R1H8CSC1ZN7J7M", "Overall": "5.0", "Content": "I only have enormous praises for this purchase. We saved ALOT of money and recieved an awesome product with nothing less than exceptional service. Our item was shipped and recieved fast. The delivery people could not have been more accomidating. I WOULD RECOMMEND Amazon.com to anyone and our tv also. Samsung LNT4071F 40\" 1080p 120Hz LCD HDTV", "Date": "January 20, 2008"}, {"Title": "Exceptional pictue", "Author": "puppet10", "ReviewID": "RP0XQE9TZHDIB", "Overall": "5.0", "Content": "Truely beautiful picture and stylish looking.  Bright and clear.  SD is good and HD is very good.  Only thing that could be better is if I had more HD channels to watch.One thing I would mention is I don't use the 120hz motion because it looks a bit unnatural but that could be because I'm not used to it and/or because of what I was watching with it (it didn't look that unnatural for sports, but much more unnatural on normal TV programs).The only other thing I would mention is the optical output from the TV does not pass through digital audio from sources connected to the TV with HDMI connections.  I'm not sure how common this is for LCD/Plasma TVs but its slightly annoying because it means I need to hook up all devices directly to my reciever using more optical or coaxial inputs.", "Date": "January 19, 2008"}, {"Title": "The Samsung 4071F is the pinnacle of EVOLUTION", "Author": "C. Allen", "ReviewID": "RT05WJWXYYXU8", "Overall": "5.0", "Content": "I am 100% satisfied with my purchase, as well as dealing with Amazon and Eagle. Eagle is definitely a company I can trust, the driver who delivered my set was one of the most down to earth guys I've ever met, we had a 30 minute conversation about all our favorite bands, and he was even a fan of my college football team haha. But anywho, the set was delivered in 4 days (from shipping to receiving), Eagle shipping was extremely fast and professional (I saw no white gloves sadly), I highly recommend doing business with them.Now on to the set itself: This set is FLAWLESS, and don't let the 40\" size fool you, this thing is MASSIVE, it looks like a giant in my apartment den, I love it! The motion/PQ is smooth as butter and absolutely gorgeous, two of my friends commented that movies don't even look like movies anymore, they look LIVE and in your face (it was freaking her out haha). I have all the connections Ill need for the upcoming year as well. I have noticed some \"vapor trails\" with the AMP on high (small, very faint heatwaves of an actors body when they move fast), none on Low and Medium, no TBE (triple ball effect when watching sports) and no stutter..*knocks on wood* hopefully Samsung will come out with a universal firmware to fix the issues for unsatisfied customers, but overall I am 110% satisfied with my purchase, this TV is the PINNACLE of evolution, I can't get enough :)", "Date": "January 19, 2008"}, {"Title": "Samsung LNT4071 40\" LCD HDTV", "Author": "W. W. White", "ReviewID": "RU0C5S5RU9KLQ", "Overall": "5.0", "Content": "This TV is amazing. It is really clear and the blacks are totally black. The sound quality is good and the set itself looks sleek.", "Date": "January 18, 2008"}, {"Title": "Great LCD", "Author": "D. Dahl \"dahlhouse24\"", "ReviewID": "R185JFNA7KKU0Q", "Overall": "5.0", "Content": "I bought this TV based upon other reviews, the great price and free shipping from Amazon.com. I already own a Hitachi 42\" plasma, and wanted to try a LCD for my other room. This is a very clear and bright HDTV. The whites are whiter and the blacks are deeper. The features I like best are the ablity to connect to a USB devices such as my Kodak digital camera and my flash drive. I can instantly view digital photos or listen to mp3 files using the Wiselink connection. This HDTV has a clear screen like a plasma, not the typical screen of most LCDs, so glare can be a problem. I personally prefer it.", "Date": "January 15, 2008"}, {"Title": "Great TV", "Author": "Mark A. Craig", "ReviewID": "R3OVO17YIL3LWY", "Overall": "5.0", "Content": "Great TV, just got the 40' version, thought about the 46 but the 40 is plenty big.  I love the auto motion, some people think its \"too realistic\" but you can set it to medium or low, or turn it off.  Anyway, picture looks great, especially with blu-ray, definately worth the money to add one.  Slick features, lots of imputs, and great contrast ratio.  Only negative is the PIP is a little weak, only one tuner etc, but i don't really use it much anyway.  Do yourself a favor and get this TV.", "Date": "January 12, 2008"}, {"Title": "Unbelievable picture!", "Author": "R. Hofer", "ReviewID": "R2JCI73ZO58TRR", "Overall": "5.0", "Content": "I am an avid movie watcher and extremely picky when it comes to my monitor.  This monitor is hands down the best value right now in the 40\" sets and is as good, if not better than, the slightly more expensive Sony XBR4 series (actually the LCD panel proper is the same as the Sony XBR4 as Samsung manufactures Sony's panel for the XBR4 sets).  Once properly adjusted--although it is alright out of the box if you like poppy look--and viewing from a high definition source (I use a PS3), the picture quality is totally unbelievable!  The black levels are perhaps the best out there--comparable to the Kuros--especially if one uses the energy savings mode on auto and properly adjusts the set.  Now I find myself wishing the movie theaters were even a fraction as clear as a Bluray playing on this monitor!  Given 20/20 vision, I recommend a viewing distance of 5' for best resolution of the finer details and no more than 7' in any case, although preferences about this will definitely vary.  The Auto Motion Plus, a highly touted feature which creates more screen frames than is in the source in order to clear moving objects, is interesting but not for everyone; it DOES sharpen moving objects using some fantastic technology but the effect is unsettling for some and very strange if on high.  I cannot comment on the speakers since I have not used them, but they are stylishly implemented in the frame, which itself is beautiful.  The only complaint I have is the high-gloss finish, while beautiful, scratches and shows dust very easily and must always be cleaned using only a jewelry cloth (which is provided with the set).This set is just a wonderful piece of technology from Samsung, and this is not coming from a big fan of Samsung even!", "Date": "January 11, 2008"}, {"Title": "Great TV for the money!!!", "Author": "Ryan D. Wussow", "ReviewID": "R2MLXIM9VRPDE6", "Overall": "5.0", "Content": "I have owned this tv for about 2 weeks now and have watched many movies and played many games on it. I work as a Dish Network Installer and have seen many tvs but this tv has came in on top for me. Hooking up the Xbox 360 and Xbox 360 HD DVD Player was the best thing I could have done. Now I can play my games the way they were meant to be played. The HD DVD's are fantastic on this tv. The one thing I can say about this tv is that it is amazing in all ways. The picture quality is just stunning and the sound from the two speakers is just as stunning. I really don't use the tv speakers because I own stereo system that works well with this tv. The only drawback on this set is the 120hz feature. I have put it on high during a football game and sometimes the screan starts to skip like. I just turn this feature off and everything is back to normal. I just hope this feature will come in handy one of these days. Other then that I love this tv.", "Date": "January 8, 2008"}, {"Title": "Kudos to Samsung!", "Author": "Harry Philips", "ReviewID": "RA42SDP1522U5", "Overall": "5.0", "Content": "Arrived and set up by Amazon delivery.  Well, they got it to work for them ... I still needed to connect the cable box, dvd, and surround sound.  I had the basic unit working within 20 minutes!  Great pic ... the envy of all my  neighbors who have plasma or other brands!  After five days, I am totally delighted ... and it has more 'bells and whistles' than I'll probably ever use.", "Date": "December 19, 2007"}, {"Title": "Great TV, Great Service", "Author": "KayJo", "ReviewID": "R11ZV0N86LCDOC", "Overall": "5.0", "Content": "What more can you want....  I bought this TV on the Saturday after Black Friday.  Received a call from Eagle that it had arrived at their site on Wednesday and they delivered (within the promised delivery window), unboxed and set it up on Thursday. I couldn't be more pleased.  Also, the price of the has TV dropped three times since I purchased within Amazon's 30 price guarantee window.  I called their customer service # and received my refunds with absolutely no hassle.The TV itself is beautiful.  Has all of the inputs I need and more.  I have it hooked up to a Sony Home Theater system and a Verizon Motorola DVR.  Everything is working great.  It gets my vote.", "Date": "December 18, 2007"}, {"Title": "Samsung LNT4071F", "Author": "D. Wurth", "ReviewID": "R2JBYSWHBPISLE", "Overall": "5.0", "Content": "I've had this TV now for over 1 month and my family and I love it. It is everything I expected and more. Also, I am again very impressed with the service and communication from Amazon.", "Date": "December 16, 2007"}, {"Title": "Samsung Customer Service  - Zero (0) stars", "Author": "A. Durbin \"ravenfan\"", "ReviewID": "R3II3Y5WIHJEGD", "Overall": "3.0", "Content": "I bought this 12/12/07, and I figure if anything would go wrong it would within 6 months.  Well just yesterday... a vertical green line appeared from the top to bottom about 1/3 way into the left side.  You can't tell its there if you are watching a show that has a lot of movement.  But when the action slows down it very obvious and annoying.  Other than that the TV is 5 out of 5 stars.  Its rather unfortunate, since the $1500+ price tag you would think a couple dead pixels no big deal, but a whole line?edited on 4/7/08Just to follow up its been 6 weeks...no TV, no word on when it will be fixed....there is some good news though My local Comcast has been billing me for the HD package I signed up for $75 and Blockbuster online ($29) and I also receive a letter notifying me about a monthly payment for a tv sitting in a repair shop....Wow this is awesome I get to pay over $200 a month for not watching any TV or movies.  WOW Samsung you are the best.EDITED 6-26-08Finally after 3 months I have rec'd a full refund back to my credit card from Amazon.  Since I made the purchase in December and the \"Known green line problem occurred\" in January they (Amazon) were able to accept a return and picked it up in April 2008.  They understood that SAMSUNG customer service is below acceptable standards.I purchased the SONY XB4 40\" from BEST BUY.  I also purchased the 4 year warranty.  Yes it was about $2200...lot of money but the TV is better than the Samsung no distortion, better quality, and a piece of mind that I have a warranty from BEST BUY that says anything goes wrong I get gift card for the purchase price of the TV from BEST BUY, no waiting for pickup, repair or calling customer service...etc.On a side note AMAZON is one of the best online retailers and I will continue without hesitation to buy small and big purchase items...I will however stay away from Samsung manufactured products...or at least anything over $100", "Date": "February 25, 2008"}, {"Title": "Simply awesome", "Author": "Dirk Ramsey \"Audio Video guru\"", "ReviewID": "RDWVRKLKS7PFY", "Overall": "5.0", "Content": "Incredible picture.  After looking at the top of the line Sony Bravia's, this LCD wins the picture award.  You will not be disappointed.  Add a Blueray player and you are in for the ride of your life.  Make sure you have HDMI that supports the 120hz speed (monster 1000 will be your best bet).  Highly recommend.", "Date": "December 16, 2007"}, {"Title": "Nice TV", "Author": "KLOE", "ReviewID": "R3UFZAYNEGSC7L", "Overall": "4.0", "Content": "Nice TV, 100% better than my 35\" analog, but not as good as my 50\" and 42\" Panasonic Plasma TV's, bought this TV mainly to hook up to PS3", "Date": "July 13, 2008"}, {"Title": "samsung color tv", "Author": "J. Froehlke \"froke\"", "ReviewID": "R2QUVR7UH8UKUC", "Overall": "5.0", "Content": "I bought this Samsung t4071 from amazon.com. The service was great. I got it a couple of days before they said I would get it. It came by truck and they unboxed it for me. I am very happy with this tv. froke", "Date": "April 20, 2008"}, {"Title": "I couldn't ask for a better tv!!!", "Author": "Susan L. Mcclain", "ReviewID": "RAOTSO2RIT5XD", "Overall": "5.0", "Content": "Well first off, I'd have to say its a huge upgrade from a 25 inch stereo tv! I had the luxury to comparing it to a 40\" sony bravia kdl-2500 series and it blows it out of the water it every catergory. The 25000:1 dynamic contrast ratio gives out rich in depth colors and the clarity of the picture is very noticable when i look at the sony bravia's 8000:1 dynamic contrast ratio. the 120 mz frames per second actually really does give a nice smooth frame transition which at first before i even bought it i thought it wouldn't matter. The 3 hdmi outputs i don't even know what to do with two of them. i got a ps3 and thats all i really need on it besides my next investment a bose sound system. The blu-ray picture is very noticable compared to a dvd's 480p on it. All around its a good lcd tv and i would recommend to any one thats looking for a good quality lcd tv, because this one isn't no push over!", "Date": "December 31, 2007"}, {"Title": "Interpolating makes 120hz pointless", "Author": "A. Stadtler", "ReviewID": "R6M0WTER19YIT", "Overall": "3.0", "Content": "This tv looks awful with 120hz on because of the dumb interpolating technology they added, make sure you go look at this thing in the store with 120hz on to make sure you can bare it.  I would personally buy the cheaper 60hz version (last years model?) or if you really want a 24p tv look at the pioneers they do 3:3 pulldown (72hz) no interpolating.  I still gave it 3 stars because it looks good without the 120hz feature on but, thats what you're paying extra for.", "Date": "November 15, 2007"}, {"Title": "Samsung TV", "Author": "Yee Thao", "ReviewID": "R1WJU5DSI7X391", "Overall": "5.0", "Content": "I am extremely satisfied with this product.  The picture is great, and the sound is great too if you don't have any speakers or any sort of sound enhancing device.", "Date": "January 21, 2008"}, {"Title": "Excellent Buy...more bang for your buck!!!!", "Author": "C. Shaw \"shawdawg\"", "ReviewID": "R1EYVLENVNLW66", "Overall": "5.0", "Content": "I have been researching flat panels for a few years now and i know the technology continues to change, but the television meets all my needs and has the ability to upgrade using internet or usb drives. I love it and would recommend to anyone that it's a must have....", "Date": "January 9, 2008"}, {"Title": "Wansinn (incredible)", "Author": "Mob Barley \"B4MDS\"", "ReviewID": "RRGZHMJOU0WE0", "Overall": "5.0", "Content": "I went from a monster CRT to this lightweight and the experience is incredible.  Expectation management...a normal screen on an analog transmission (480) looks the same on the lcd.  1080p on the other hand is like watching real life.  You can see zits, eye poop, and hair roots.  The 720i pictures on digital tv come across crisp and clean.  I violated my individual component rule and purchased the Samsung HT-X250T DVD Home Theater System alongside...great decision.  The two pieces talk to each other and the upscaling presentation to the lcd is as I mentioned...incredible.  Our viewing distance is only ten feet, so the combination is rather intense.  I also have it hooked up to a computer to stream video from the internet and a game console...both of which just bring me back for more.  As for the white glove delivery service...you cannot go wrong.  It will take a couple of extra days but depending upon the price from the big box stores, you will save anywhere from two to five hundred dollars on the transaction.  Too bad I'm not getting paid to tell you this combo rocks.  Incredible.", "Date": "January 4, 2008"}, {"Title": "Fabulous", "Author": "S. Rohar", "ReviewID": "RQWQ6K4I2Y5K7", "Overall": "5.0", "Content": "Could not be happier with the product and the service.  The entire order went like clockwork and the TV is amazing.", "Date": "January 13, 2008"}, {"Title": "buy it", "Author": "Myrene Viray", "ReviewID": "R518FS7FMS0RF", "Overall": "5.0", "Content": "This is the best 1080p Hd television on the market. Buy it. Wanna get away? Go to airmyke.com for cheap tickets and packages.", "Date": "October 21, 2008"}, {"Title": "Samsung LNT4071F HDTV", "Author": "Martin F. Lim", "ReviewID": "R2698BYOZSI0C8", "Overall": "5.0", "Content": "Great TV. Very satisfied with the overall quality after using it for about a month. The pictures are bright and vivid. The high contrast ratio enhances picture sharpness. The PIP is a not user friendly.", "Date": "February 16, 2008"}, {"Title": "Samsung", "Author": "Freeman Mahoney", "ReviewID": "R26FR1F7AHPXQN", "Overall": "5.0", "Content": "Exceptional product. Deliever very good. Driver knowledgeable about how to unpack and set up unit. Would recommend everyone step up to this model.", "Date": "February 14, 2008"}, {"Title": "No Title", "Author": "Thomas W. Raines, Jr. \"novice\"", "ReviewID": "RYIMGYRWOM7VE", "Overall": "5.0", "Content": "We are very pleased with both the quality of the picture produced by the set and with the ease of use of the many features provided.", "Date": "January 13, 2008"}, {"Title": "motion still noticeably digital", "Author": "geriga", "ReviewID": "R3K72D8G9HXEQE", "Overall": "4.0", "Content": "I like the tv, but I bought it b/c the motion was supposed to be fluid. It's definitely not always so. Maybe there's a setting I'm not seeing though.", "Date": "February 1, 2008"}, {"Title": "Amazing picture", "Author": "Skoot 51", "ReviewID": "R28UXS82347L1V", "Overall": "5.0", "Content": "Amazing picture. Watched my favorite college team for the 1st time on HD and it was exciting! Takes TV viewing to a whole new level. Amazon delivered as promised. No complaints.", "Date": "November 17, 2007"}, {"Title": "ASPECT RATIO OPTIONS?", "Author": "Jonathan Ashley \"donovan_ashby\"", "ReviewID": "R8AS9Y1ALTD0B", "Overall": "5.0", "Content": "Can anyone comment on the ZOOM/ASPECT RATIO options of this (or any) TV?Unfortunately no one comments on this very much, even though to me it's a deal-breaker.  Pixel dimensions, contrast ratios, etc. are all moot if to get the most out of my widescreen TV I have to crop or distort the image.On most flat panel TVs, the zoom function is limited to content wider than 16X9; if widescreen content is narrower than 1.85:1 (which it often is, especially on broadcast TV, with it's trendy \"semi-widescreen\"), my options are to stretch the image (no thank you; Vincent Donofrio's head is thick enough as it is), zoom in (thus cutting off the top and bottom), or watch it in standard TV ratio (and settle for black bars on the top, bottom AND sides of the image- what a waste of screen space!).On principle alone, I am offended by the stubbornness of TV manufacturers who refuse to address this discrepancy, at the expense of the consumer's home viewing experience.Some manufacturers MUST have done so, but if so they aren't advertising it enough.Any advice, about this model or any other, would be much appreciated.THANKS!", "Date": "January 14, 2008"}, {"Title": "Pioneer VSX-1017TXV-K", "Author": "Mark S. Buske", "ReviewID": "R3OC9145JPXPDO", "Overall": "5.0", "Content": "This Pioneer receiver is one of the best values I have found. The sound reproduction of a recent NFL playoff game broadcast in Dolby Digital 5.1 was just like being there sitting in the stands of the Green Bay stadium.I bought an XM radio mini tuner cube and the connections were simple. this product gives great bang for the buck. I am totally pleased with my purchase of this Pioneer product.", "Date": "January 12, 2008"}, {"Title": "Do not buy from Amazon", "Author": "Nicole", "ReviewID": "R27QGSMPTHXK9", "Overall": "1.0", "Content": "I'm not sure how the quality is on this TV, but if you would like your TV in a resonable amount of time I would not buy it from Amazon. I ordered my TV on June 14th,it is now June 26th and I have still have not received it. I did track my item on CEVA and it has been sitting in a warehouse an hour from my house since June 21st. I would highly reccommend buying from a different company.", "Date": "June 26, 2008"}, {"Title": "Not a \"true\" 1920x1080 RGB.", "Author": "Lucem", "ReviewID": "R3TO5WS6JHSUVM", "Overall": "3.0", "Content": "Some technology seem to go backwards.These Samsungs HDTV are not \"true\" 1920x1080 panels.They use a special technology called Pentile or similar.This means that there is NOT 1920x3 RGB Vertical stripes. Instead they use a RGB pattern with less pixels (3,147,264 to be precise)resulting in a chroma sub sampling effect that can be visible with HD-DVD, BlueRay and Computers.True 1920x1080 panels have 6,220,800 subpixels.Don't believe me?Google \"Pentile Displays\" or \"Clairvoyante\".", "Date": "December 27, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "120Hz LCD panel for clear motion and fluid frame transitions\n25000:1 dynamic contrast ratio\nHD-grade 1920(H) x 1080(V) pixel resolution (1080p)\nWide Color Gamut CCFL backlight\nFast 8ms response time; 3 HDMI inputs", "Name": "Samsung LNT4071F 40-Inch 1080p 120Hz LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51bxo2xYM%2BL._SX300_.jpg", "ProductID": "B000U9ZCQS"}}