{"Reviews": [{"Title": "Toshiba is KING of HDTV", "Author": "B. A Reichle", "ReviewID": "RUKRFFZ794GLG", "Overall": "5.0", "Content": "Ask most video heads, and they will agree Toshiba is the best. I had a 53hx71 that I recently sold, and I bought this set from Amzon last week. The shipping was the only headache and most of that was me wanting some instant gradification.I live in LA and the TV was shipped out 5 hours away... but yet it took a week to get... thats stupid. Its annoying when you track it and it says its at LAX (20 mins away).. I wanted to walk it home!The actual TV is AMAZING.. the regular cable looks great, and this is the first series I have seen that you dont noticed regular tv being stretched!! The HDTV rocks, the only negative thing I can think of is having to adjust all the inputs because its shipped with the contrast at 100!...take that down to about 48...Seriously, this tv is a HUGE bang for a small buck.", "Date": "October 19, 2004"}, {"Title": "Big bang for your buck !", "Author": "VC", "ReviewID": "R22S5T5PJ96DF2", "Overall": "5.0", "Content": "I write reviews for various gadgets and restaurants and this is the 1st time when I do not have anything negative to write about the quality. I bought this TV back during 2004 Thanksgiving sale from BestBuy and paid about $1350. It took about few weeks for the picture tube to break in and show its real colors ! Then I had a technician from best buy come over and calibrate it (as you may already know that Rear Projection TVs need calibration, but if you have the bestbuy protection plan they would do it for free at your home). Ever since then all my friends come to my place to watch the big games, movies and even to play xbox in widescreen - and everyone just drools over the picture quality. The picture is crisp, specially when watching HD content and watching movies on DVD. I do not watch analog channels since almost all of them are in HD now for a small difference of $7 or so per month. I looked at Sony, Samsung and Toshiba - Toshiba won the race by a mile. Here are a few things worth mentioning about Toshiba 51H84:- Picture is absolutely crisp- Colors are beautiful (try watching Shrek on it)- Even movies in 4:3 look great- Size does matter ! I was about to settle for 42 and I am extremely glad I pushed myself to 51\"- The multi-choice zoom feature will satisfy your appetite to zoom any sort of programming.- 7 inputs including HDMI (I use Component and am satisfied)The only negative:- Doesn't have a built in HD tuner, so you cannot use its cool Split (2 screens) and Channel Scan feature (split screen in 12 screens).  It has 2 inputs for Antenna, I connected one to the cable box and other bypassing the cable box, so I can screen the channels in analog (using TV's analog tuner) and then watch it in HD.There is a false rumor that Toshiba's doesn't do a good job with green - Not true ! Myself and few of my friends spent hours looking at 3 different brands and Toshibas (after calibration) does the Best job with all R G and B (Sony RPTV didn't do a good with Reds) !Calibration is the key - make sure you spent some time to tune it after few weeks of picture tube breakin period.I would recommend this TV as a big bang for your buck !", "Date": "March 26, 2005"}, {"Title": "Unreliable at Best", "Author": "mtp137 \"- I Try to be Fair\"", "ReviewID": "RQQ6LWOKEWX2P", "Overall": "2.0", "Content": "This is my first big screen tv. I was excited to get it home, and had no idea what to expect. The picture did not seem as clear as the in store picture had seemed when watching Dish Network, however it was amazing when watching DVD movies.About 2 weeks after getting it home, it made a 'pop' sound and the convergence went out of whack. I re-adjusted it and it was fine... until it did it again, and again usually about a week apart.Then about a month and a half later, while watching  a movie, it did the same 'pop' noise, only this time it shut itself off. It would not turn on, and the red power light was flashing. I unplugged it and plugged it back in and it worked.The service call was to be the following week, that weekend it turned off again, and this time nothing would bring it back.The service tech had to take the chasis with him and 2 days later they returned with it, saying they had replaced 2 of the chips, (related to convergence), and 2 fuses.The picture was much improved in all cases and I thought, \"OK, I just got a TV with a couple of bad chips.\"Exactly 2 weeks after the repair, it made a 'pop' sound and the convergence went out of whack. I re-adjusted it and it was fine... until it did it again 2 days later. I am awaiting the repair tech, who will be coming in 2 days from now, and hoping it doesn't go all the way out again.IF YOU WANT TO VISIT WITH A SERVICE TECHNICIAN TWICE A MONTH...This may just be the TV for you.", "Date": "January 12, 2005"}, {"Title": "Great TV for the Money", "Author": "Tom Welling \"Tom\"", "ReviewID": "R3AL90S7GV4YDK", "Overall": "5.0", "Content": "Well I have had this TV now for almost a yr. When I was looking at getting an HDTV I did so much research. I read a million reviews and user opinions. I first bought a 50\" Samsung DLP. What an amazing TV. Still to this day, that TV is the best TV for the least amount of cash. Don't get me wrong. No DLP is cheap. I put the order in at Brandsmart. Then I went home and realized that I didn't need to spend $3800 for a TV. That included a stand and 5yr warranty. So the next day called my sales guy and canceled the order. I first was going to buy this TV, but went with the DLP. Well after feeling buyer's remorse I got the Toshiba 51H93 instead. I got it for $1350. It came to around $1750 after delievery and 5yr in house service contract. I was sold!!!So about the TV. The remote is cool. It lights up Blue so you can see in the dark. The picture is actually very nice. It all depends on your connection. If you have HDTV from your cable them get this TV. Regular-Digital Cable is def alittle blocky, but not nearly as bad as most Rear Projection TV's. It has a built in converter to make even a regular cable go to 1080i. Don't expect that it will equal HD though. On a DVD or HD signal, the TV is breathe taking. I have had no problems, knock on wood so far. I have an Xbox hooked up, very crisp picture. There is plenty of connections (2 HD), and SD card reader (can take out SD card from digital camera and just plug it in and see your pictures-very cool). The speakers are amazing. I still can't believe that a TV has such a good sound. The bass is overwhelming. I actually had to do into setup and lower the levels. I have a nice surround system which compliments it well. But most of the time I just use the TV unless there is a big game or DVD on.If your looking for a cheap HDTV, look no further. The technology is definitely outdated (rear projection). But for the price you can't beat it. Just remember, even if you buy the best LCD, in a yr from now the new model will blow away your older one. So why spend $4000-$10000 on a TV that will be outdated in less than a yr. This is why I went with a Rear projection. I figure spend the least amount now for the best you can get, and then in a yr or two I can get a better TV. Just think, you can get a $8000 LCD now or buy one $4000 now and then in a few yr's spend another $4000 on a newer LCD. I would bet the farm that the second LCD will be far superior to the $8000 now. I think you ge the point.Well good luck in your purchase and enjoy your new Toy. Take care", "Date": "January 28, 2005"}, {"Title": "Great TV", "Author": "LOUIS PAONE \"drlgp\"", "ReviewID": "RWELGN5Z7SMON", "Overall": "5.0", "Content": "This is my first large screen TV and I have to say I am impressed.  I got it about a month ago and was very surprised how easy it was to set up ( bass, treble, picture etc).  The instruction booklet is actually easy to follow, which is a surprise in itself.  I have a dvd and vcr hooked up to it and have to say the picture quality is excellent.Just a couple of things I have found out when I got the set that should be known.  When you get the set delivered wait an hour or so before you turn it on. This will bring the set to room temperture.  It may sound foolish, but if the components of the tv are cold and you immediately turn the power on they could get expand to quickly and could crack. The set may have been in a delivery truck for a day or two in a cold climate.When you finally do turn the set on make sure you hit the one touch control on the front, it automatically adjusts the unit for your environment.  One other thing. For some reason the manufacturer adjusts the contrast to 100.  I would knock it down to about half of that or whatever you are comfortable with.Remember this is a projection tv so the best way to view it is about ten feet away and in a sitting position.All in all, so far I am very pleased with the set and recommend it highly.", "Date": "February 24, 2005"}, {"Title": "Fun while it actually worked!!!", "Author": "Future", "ReviewID": "RB54BAFDJN7TH", "Overall": "1.0", "Content": "I just got this tv 15 days ago and was perfect up until today and it decided to make a slight pop noise and the screen turned black and then the power light started flashing red and now it wont turn back on. I unplugged it and all the cables and an hour later tried again and still the same thing, just a blinking red light. So I decide to call Toshiba and they dont even have 24x7 support. It was only 7:30pm and there normal hours are 8am - 7pm. Thats pretty bad when a multi billion dollar company cant even have 24x7 support. I am not the only person I see in these reviews that got the same kind of lemon. If Amazons return policy would except this back I would return it in a second. If it cant even work for a month thats pretty bad.UPDATE!!!!!!IT IS NOW 7 WEEKS LATER AND THE REPAIR SHOP DOING THE WARRANTY SERVICE STILL HAS MY TV. THEY HAVE ORDERED MULTIPLE PARTS AND STILL CAN'T FIX IT. I COMPLAINED TO TOSHIBA MULTIPLE TIMES IN THE LAST 3 WEEKS ABOUT THE QUALITY OF SERVICE I AM RECIECING AND THEY WILL NOT DO ANYTHING ABOUT IT. I HAVE TALKED TO 3 SUPERVISORS AND THEY ALL SAY I JUST HAVE TO WAIT FOR THEM TO FIX IT AND ALSO THEY WILL NOT OVERNIGHT PARTS TO HELP GET IT FIXED FASTER. THEY SAY THERE SHIPPING/PARTS DEPARTMENT ISNT CAPABLE OF OVERNIGHTING PARTS.TOSHIBA WILL NOT JUST REPLACE THE TV EITHER THEY SAID IT HAS TO BE REPAIRED.THE ONLY COMPENSATION TOSHIBA IS EVEN OFFERING ME IS A 3 MONTH EXTENDED WARRANTY. WHICH THEY SHOULD GIVE ME BY DEFAULT JUST BECAUSE THE REPAIR IS TAKING SO LONG.I WILL NEVER BUY FROM TOSHIBA AGAIN AND I WILL NEVER ORDER ANYTHING OF THIS SIZE AND PRICE OFF THE NET EVER AGAIN.SPEND THE FEW DOLLARS MORE AND BUY IT LOCALLY SO YOU CAN AT LEAST TAKE IT BACK.!!!!!!!!!!!!!!ANOTHER UPDATE!!!!!!!!!!!!!!!!!!IT IS NOW OVER 10 WEEKS LATER AND THE REPAIR SHOP STILL HAS NOT FIXED IT AFTER ORDERING OVER 8 DIFFERENT PARTS. TOSHIBA STILL REFUSES TO SEND ME A NEW REPLACEMENT. NOW AMAZON IS SAYING THEY WILL NOT DO ANYTHING TO HELP ME EITHER. DONT BUY NOTHING FROM TOSHIBA!!!!!!!!!!!!!########## ANOTHER UPDATE TO THE OTHER UPDATE ############It is now 3 months later. I still do not have my TV back from the repair shop. The Repair shop named J Rudy Associates in Pittsburgh Pa USA is the ones that have my TV and still are unable to fix it. Toshiba is STILL unwilling to do anything besides make me keep waiting for the TV Repair shop. Amazon WONT do nothing unless Toshiba sends them a Fax'd Paper saying they arent going to fix it. So no matter how I look at it I just spent all this money to be RIPPED OFF!@#@$@*^#%&$!@!", "Date": "March 3, 2005"}, {"Title": "Stay Away from this TV", "Author": "Mike A. Arguello \"Mike A.\"", "ReviewID": "R2EB0XP9S6UL1X", "Overall": "1.0", "Content": "I owned the tv for about 3 weeks, then all of a sudden the tv turned off.  The little red light on the front was blinking and there was clicking sound when I unplugged it and tried to turn it on again.  A service technician came out and ordered a new part for it.Then less that 4 days later the unit made a pop sound and the picture schrunk about 3 inches on the left and right sides - no luck.Luckily, I bought it from a local store and can return it , no questions asked.I suspect from reading other posts that this Toshiba has put a real lemon on the market.", "Date": "March 12, 2005"}, {"Title": "Toshiba 51H84", "Author": "Timothy McGrath", "ReviewID": "R3P8LFA5K0PCKF", "Overall": "5.0", "Content": "I have owned this tv for 7 years and have never had one problem. Great picture quality I could not be happier. Paid 1400 new with the 3 yr extended warranty which I never neede to use.", "Date": "May 8, 2011"}, {"Title": "Old technology?", "Author": "DB", "ReviewID": "R1YKWFUV8T0NV7", "Overall": "5.0", "Content": "I have owned the Toshiba 51H84 since 2004, and I am still very happy with it.  It has performed flawlessly for thousands of hours since then. As for its technology being outdated (RPTV), and its maximum resolution being less than the maximum available (1080i), I think it has taught me to sympathize with those throwbacks who hang onto their vinyl LP's.  As my ears are unable to distinguish between digital and analog sound due to a long history of attending rock concerts, my eyes still function quite well (with correction).  I find that the latest generation of HDTV's, especially with hi-res digital content, yield a very \"digital\" looking result. I also own a 1080p 120Hz LCD TV which often gives an unreal overly digital looking result. The anachronistic RPTV yields a more realistic experience similar to film IMHO. I will keep watching my RPTV until it quits for good.", "Date": "January 28, 2011"}, {"Title": "Been a Good Buy", "Author": "R. Excellence \"ExC\"", "ReviewID": "R2OOE8CC5UK6ZS", "Overall": "4.0", "Content": "Had the TV going on 5 years now and with the crazy prices on flatscreens this holiday season, its time to reclaim some space.  Sounds like as long as it lasts pasts the first couple months, it'll be good for a long time.  Loved the tv since I've had it and never had a problem.  Well, odd issue's with resolutions hooking it up to a pc media center through HDMI, but thats nothing a custom resolution couldn't fix. I never had to deal with the customer service, so I have no opinion.", "Date": "November 23, 2010"}, {"Title": "Excellent HDTV! Great Value.", "Author": "sammydjr \"Sammy D\"", "ReviewID": "R21G0H8KUJ7XEQ", "Overall": "5.0", "Content": "This is my first large screen TV purchase and I must say it was a great choice. For the money it is amazing what this TV offers especially considering the 51\" screen. Today's flat panels in that size are just too expensive and from the testing I did you can't see a difference between flat panels and this when in HD. Maybe once the 1080p stuff takes off but not as of today. The TV was easy to set up, it has small built in rollers and is easy to move around and the instruction booklet was actually easy to follow. I have a HDDVR, DVD player and VCR hooked up to it and have to say the picture quality is excellent especially with the big action DVD's. I would also say that the regular cable, non-HD view on this TV is better than any flat panel out there. If you can get this TV for less than $1000 I would say it's a must if you have the room.", "Date": "November 11, 2007"}, {"Title": "Valid about 5 years ago", "Author": "PeteyL", "ReviewID": "R2BLH9U5SFSD9Q", "Overall": "5.0", "Content": "Been hammering on this thing since NEW back in 08? B4 the BIG LEDs' prices started to drop thru the floor & I don't regret the purchase. If you can get one cheep enough ($200 MAX) then it could be a good addition to a rec. room.", "Date": "October 6, 2012"}, {"Title": "Fantastic", "Author": "Bassman \"Bassman\"", "ReviewID": "R127SIC0R5WFN8", "Overall": "5.0", "Content": "My first big screen HD TV.  For the money I am shocked at the value this TV offers.  I know people who spent $1000 more for a TV that doesn't even come close to the quality picture that this television has.  It also has a fantastic built in audio system that is more than capable of holding its own...Not much to gripe about here.", "Date": "October 21, 2004"}, {"Title": "Frustrated Customer", "Author": "Unhappy Customer", "ReviewID": "R1ZPH9XJDNKFUF", "Overall": "1.0", "Content": "DO NOT GET THIS TV unless you want a really large paperweight!  A few weeks after delivery the TV stopped working, and could not be repaired.  Repairman said that he is called to repair several of this model a week and recommended returning it and getting something from a different manufacturer.  Tohiba customer service was very unpleasant and it took sever weeks of arguing to get it returned.  I have just purchased a SONY and am looking forward to receiving it.", "Date": "May 6, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "51-inch widescreen (16:9 aspect ratio) HD-compatible projection television featuring CrystalScan HDSC upconversion to 1080i/540p\nHDMI (High-Definition Multimedia Interface) HDTV input provides a pure, uncompressed video connection with DTV receiver or set-top box\nPowerFocus HD CRTs enhance sharpness and brightness; PowerFocus HC lenses offer 50 percent higher contrast than other lens systems\n3D Y/C digital comb filter with Vertical Contour Correction accurately processes RF and composite-video (DVD, VCR, camcorder) signals\nDFine high-speed velocity-scan modulation improves the definition at picture edges", "Name": "Toshiba 51H84 51-Inch HD-Ready Rear-Projection TV with HDMI Input", "ImgURL": "http://ecx.images-amazon.com/images/I/51X4NF8Q4BL._SX300_.jpg", "ProductID": "B0001YI90S"}}