{"Reviews": [{"Title": "So bad you would think they'd recall them.", "Author": "Autumn May", "ReviewID": "R2WQCJP5ZY8BZ", "Overall": "1.0", "Content": "I am shocked that the few reviews for this TV have been positive. A quick check on the internet for this Polaroid model will show endless counts of nothing but misery dealing with tech support, warranty service and refunding.After six months of owning one, it suddenly would not turn on for me. Apparently the 19 inch widescreens are experiencing lots of power board failures. I had to complain to customer service for over an hour, including hold time, before speaking with someone higher up about how I wanted nothing to do with their company.While they absolutely refused to authorize a refund (because the store I bought it from said that it was out of their hands after 30 days) she finally agreed to send a pre-paid label out so I could ship it via FedEx for replacement or repair. Otherwise I would be out thirty dollars just to send it out.It has been received at the repair center in CA, USA and customer service informed me that they do not even try to fix any tv \"that small\" and want to send a replacement - the only problem is that \"there are none in stock\". The TV came from the factory in March but they don't have any more? Sounds suspicious to me. I was told to call back in another two weeks for an update.A lot of internet reviews sound like the story I'm going through - many customers end up waiting months on dead-end updates from customer service until they DEMAND to have their money refunded. If I don't see a new TV soon (which is very likely to malfunction again) I am going to have do the same thing.Before you decide on this \"money saver\", research this model and what consumers have to say - most of it is pretty ugly.", "Date": "September 27, 2007"}, {"Title": "DO NOT PURCHASE POLAROID PRODUCTS!!!", "Author": "Michael Cooper", "ReviewID": "R118FEFU5R02KD", "Overall": "1.0", "Content": "I purchased a Polaroid flat-panel television over three months ago. After owning it for less than two weeks, it stopped working. I spoke to Polaroid's service department, and received a return authorization number. I shipped the unit back to them and kept a record of the tracking number. I made repeated calls to their customer support center. Each time I called, they informed me that they had no record of my television being returned. I reminded them each time that I had a tracking number and signature proving that it had been received. When this was understood, I was told \"We show plenty of these televisions in stock. I'm not sure why your replacement hasn't been shipped out. I will do everything I can to get your replacement out today. Call back in a couple of days, and we'll give you a tracking number so that you can know when to expect it.\" Over a dozen calls and two months later, I am STILL calling back daily trying to get the replacement shipped to me. Each time I call, the same conversation occurs. I have spoken with several managers, and many service techs. But, NOTHING EVER HAPPENS!!! If I can help one person not make the same mistake, it will be worth the $320 that I wasted. Save yourself a LOT of headache. Purchase another brand.", "Date": "December 11, 2007"}, {"Title": "Best small HD TV I've seen", "Author": "Jorge Noyola", "ReviewID": "R1QAKK24676VJB", "Overall": "5.0", "Content": "Before embarking in buying a large HDTV I decided to experiment a little and see what kind of HDTV availability I had in my community without spending much money. I found this excellent TV at Walmart for $277 (they were $267 just one week before but they seem to be in very high demand, I had to visit 4 stores before finding one!). I did my research before deciding to get this one, and I chose it because it has dual tuners - It receives current TV signals from an aerial antenna, cable or satellite system as well as the HDTV signal from my basic (yes, basic!) cable connection without any external box (well except for the satellite system). It does double as a high res computer monitor (has a VGA input) and has composite, S-Video, RGB and HDMI inputs as well. The quality of the image is just short of being perfect. At home I hooked it up to my standard DVD player using the S-Video input, and mixed the output from my satellite box and the basic cabe in a single coax (you can get a $3 coax splitter to do this) and connected it to the coax input. I also connect my laptop ocassionally to it. I don't have any other HD equipment yet so I can't comment on the reliability of the HDMI interface or the other RGB inputs but I have no reason to think they won't work appropriately. The sound is also impressive, it has several preprogrammed sound modes and the simulated surround is amazing, you could almost swear you have real surround. And it does have a digital coax sound output.I compared this TV with a 19\" Sanyo (uglier, bulkier, and limited video inputs) and with 19\" Phillips, Samusungs and LG's (all of them also quite good, but at least $350). At this price, it can't get any better - Best price to quality ratio (any cheaper than this will get you some unknown Chinese owned and made brand). The TV is made in China but has excellent quality.", "Date": "June 18, 2007"}, {"Title": "Get it - and get it right!", "Author": "The BanjoNut", "ReviewID": "RTKW9VHKMYKCQ", "Overall": "5.0", "Content": "Why can't anyone list this wonderful little HD TV correctly.  I purchased one at \"Wally World\" and it works GREAT!  The sound is very good too.  It has the normal HD TV inputs plus the ATSC tuner.  And it even has VGA input so I can connect it to my notebook PC and watch my MLB.com baseball games on a better screen.This is a true HD TV.  The resolution is 850:1 an NOT the 400:1 as shown in Amazon.com.Buy this for your bedroom or any small room application.  It's great!", "Date": "June 5, 2007"}, {"Title": "Good buy for the money.", "Author": "real gamer", "ReviewID": "R3VWVC3LOF82QG", "Overall": "4.0", "Content": "I purchased this TV at walmart in my local town and am very pleased with its performance. The contrast ratio is 850:1 with the maximum resolution of 1440 x 900.", "Date": "June 8, 2007"}, {"Title": "Surprising Good for a Lesser Known Brand", "Author": "Joshua T", "ReviewID": "R2YNWIJFAIT7HF", "Overall": "5.0", "Content": "The deciding factor in purchasing this unit, which should be more widely publicized: there is noticably less movement blur. The refresh time on this unit is 5 ms, not 8 ms, as in most other current units.The picture is startling sharp, as sharp as any I have seen. 900 x 1400 resolution, not the 768 x whatever on most other units. I live within a mile of the broadcast tower, and I am amazed at the quality of the picture--using fifteen year-old rabbit ears!Perhaps some oversaturation of the colors, but this should be easily corrected, as the television offers a choice of \"viewing modes\", as well as the ability to individually correct the colors.Obviously, after three days, I cannot report on the durability of this unit. So far, I am very pleased with the purchase.", "Date": "March 23, 2008"}, {"Title": "Great Lil' TV", "Author": "Zaeris", "ReviewID": "R31YI8XD5745CS", "Overall": "5.0", "Content": "Have had this Polaroid LCD TV for at least 5-6 years, It gets used every day. Never had a problem out of it. It has an amazing picture quality and no shadow, or ghosting. Stills works as great as the day we bought it. Went from watching TV and Xbox 360 gaming on it to using it as a PC monitor. My only complaint is the bezel on the right/left of the screen is think, so it would be odd to duel/triple monitor with it, witch i might do.", "Date": "February 29, 2012"}, {"Title": "good value", "Author": "supermannt", "ReviewID": "R5KDTP7ES5W3L", "Overall": "4.0", "Content": "It's small, and doesn't look like much, but in the year I've had this TV there have been no complaints. The picture quality is good, though the sound could be better (I hooked it up to my modest home theater system). It's extremely durable. I transport it all the time (I bring it with me on long trips so I can play my ps3). Overall, this is a good bedroom TV, and cheap. This is an entry level HDTV, and for the price there can be no complaints.", "Date": "February 2, 2011"}, {"Title": "Price (& Size) are Right!", "Author": "Melissa Rivers", "ReviewID": "R194YOFBPSFSG2", "Overall": "4.0", "Content": "Living three flights up tends to limit some of the purchases I make; the Polaroid 19\" HD TV fit the bill perfectly. At around $200 from 'the Great Wall', it was an absolute bargain in my book, and light as a feather. Not a whit of trouble in set-up, especially with an HD cable system, and it connects so easily to my laptop for better definition when editing digital images.I'd tried 2 other LCD TVs from bigname manufacturers, and both had pixels out as soon as I got them home. Not the Polaroid. Hopefully, this one will last like that TV I bought way back when that hung in there for almost 20 years (and this one is SO much lighter than that behemoth!).Why can't gadgets last like they used to (I'd settle for lasting even half as long, really, but going out anywhere from a day to a month past warranty is simply too suspicious).I'm so impressed, I'm going back for another one.", "Date": "March 22, 2008"}, {"Title": "Wow, we've had no problems, very convenient in any room!", "Author": "Chris Gregory", "ReviewID": "R3EYFD3GO1GVE5", "Overall": "4.0", "Content": "I am perplexed that this tv has so many negative reviews???  We've had ours for six years, and it was inexpensively purchased at Wal-Mart.  It has given us no problems whatsoever.  The setup was easy and channel searching seup feature was also easy.  For its size, it has a great viewing screen.  We're happy with ours!  Polaroid TLA-01911C 19\" LCD HDTV", "Date": "January 12, 2014"}, {"Title": "Still chuggin'", "Author": "sk;gjp'fjskgjskljg", "ReviewID": "R2QNTYP0A1N0IQ", "Overall": "4.0", "Content": "We bought this tv (in a larger size) back in 2007. After a couple of years, We also had the same issue of it not turning on. It actually happened twice. Thankfully we new someone who was able to fix it for only $50.00. And since then, it hasn't happened. After having this tv for 6 years its gone from being or main tv, to being our bedroom tv and works/looks as good as it did the day we bought it.", "Date": "March 23, 2013"}, {"Title": "Good TV", "Author": "Matthew B. Dowell \"Mbd06b\"", "ReviewID": "R32C85YFLEICXK", "Overall": "4.0", "Content": "I owned this TV for a year, before it got stolen.It was a wonderful little TV, and had decent features you would expect for 19in at such a low price. Ratatoulie looked great on this little value.I probably would save up for a bigger TV next time.", "Date": "April 13, 2009"}, {"Title": "This TV is a lemon", "Author": "D. King", "ReviewID": "R1WJKK73B74A36", "Overall": "1.0", "Content": "I purchased this TV about 9 months ago.  I turned it on one morning and the sound came on but the video flashed the Polaroid banner and then went blank.  A call to Customer Service was very unhelpful.  In hindsight I did web research and found this TV has a sytematic problem with its power board.  What a name that is suppose to stand for imaging quality, you would think that Polaroid would show more regards for their reputation and take responsibility for this lemon.  Instead they have taken the approach of let the buyer beware.  I personally will never purchase another Polaroid product and I will warn as many people as I can.  Everybody makes mistake, great company accept responsibility for their mistakes and provide their consumers with an acceptable solution. Polaroid did not take this approach.", "Date": "April 5, 2009"}, {"Title": "Excellent Budget 19\" HD LCD TV!", "Author": "Discman", "ReviewID": "RPQNVNPIDP8FF", "Overall": "5.0", "Content": "This was my first/current LCD HDTV. I bought it refurbished for cheap and its been running Perfectly. Screen is nice, large, and bright, displaying standard quality Tv nicely, as well as game systems like the PS2. This Tv also has connections for EVERYTHING: antenna, coaxial, Composite, component, S-Video, HDMI, and VGA. Whatever device you have, it will work with this Tv! Also doubles nicely as a Pc monitor with the VGA input. Speaker sound is nice too. Recommended!", "Date": "August 5, 2008"}, {"Title": "Excellent TV for the Price", "Author": "Richard S. Vertrees \"Guardian\"", "ReviewID": "R1BSL7HCMF05B5", "Overall": "5.0", "Content": "I was a little bit skeptical about buying this TV over the Samsung equivalent which was only $40 more but after owning this product for seven months I am very pleased. I have had no problems with it, the picture is great, and sometimes it stays on for hours at a time with my 360 or PS3. Even if anything does happen to it, I bought the two year warranty that Wal-Mart offered in case anything does happen to it.Great product for the price, probably best for a bedroom or office as opposed to a living room however.", "Date": "April 29, 2008"}, {"Title": "8 months and still going strong", "Author": "Irish Kamikaze", "ReviewID": "R3B31RULCS73Z", "Overall": "4.0", "Content": "I purchased this tv back in August from Wal Mart because I needed a little LCD for my bedroom. It's sole purpose is to watch the tube while in bed before I crash out for the evening. Since the time I have purchased it up until now, I have had absolutely no problems with the set. My 360 has gone through the trials the same amount of time as this tv and I had the honor of the \"red ring of death\" to be sent in to repair and this little tv is still trucking.I guess some people have bad luck with products as those who give this puppy a fairly to good rating lucked out.", "Date": "March 3, 2008"}, {"Title": "DEFECTIVE PRODUCT", "Author": "Sabo", "ReviewID": "R2OUKAADWQH4Q1", "Overall": "1.0", "Content": "Two years ago I purchased two(yep! 2) Polaroid, 19\" units (FLM-1911 to be exact).  The display worked fine but the remote contol receiver failed on the first unit at eighteen months.  By failing, I mean that it became \"Hal\" and changed channels, changed volume flipped between TV andr monitor mode and totally took control of itself.  There was no stopping it!  Polaroid said: tough - out of warranty.  However, they did agree to ship me a refurbished \"similar\" unit for a mere $XXX which was about the discounted price of a new unit.I bit, they shipped.  First the wrong control was shipped.  When that was corrected, the unit provided proved to be unrepaired and would not work.  A replacement for the replacement was provided.  It never worked right either and I gave up and bought a different brand.At twenty-six months the second unit went into \"Hal\" mode!  I said design problem!  Polaroid said: tough - out of warranty but for a mere $XXX they offered to ship a refurbished unit....", "Date": "November 26, 2008"}, {"Title": "One year life cycle", "Author": "J. Lohman", "ReviewID": "RG23JC8NHBVV", "Overall": "1.0", "Content": "We've had this TV in the bedroom for almost a year, 15 years old Sony CRT better TV. The picture seemed out of focus. Sound quality was poor but would get loud. Buttons are on the side hard to see. Remote would not control Dish so have to use two remotes, The 15 year old Sony's remote works with dish and dish remote works with Sony TV. One sunny day and this TV stopped working, no picture after polaroid screen but have sound. What to do with a $200.00 TV that does not work. 1). Send off to get fixed $50.00 for shipping plus parts/labor (find a box, etc..). 2). Find someone local to fix lol.. 3). Trash it, you rich American buy new one!", "Date": "October 11, 2009"}, {"Title": "bad buy!", "Author": "L. Schofield", "ReviewID": "R39S067KIQ47RI", "Overall": "1.0", "Content": "TV quit tuning up and down after only a few months of use.  From what I've read on-line this isn't a new problem with Polaroid TVs.  Cust Service couldn't figure it out. Bad buy.", "Date": "November 12, 2008"}, {"Title": "Poloroid TV has been an Awesome Product", "Author": "Von Preussen \"kaiserlichehoheit\"", "ReviewID": "R343TNM1AT39LQ", "Overall": "5.0", "Content": "I purchased two of the 19\" Poloroid Televisions. I bought them when Circuit City was in business. These Television Sets are still working just as good as the day I purchased them.The Picture quality is clear and crisp and the colours are awesome. I couldn't be more pleased for such an inexpensive buy. I think it was less than $125- in 2008. I am stunned over the bad reviews. As far as I am concerned its a great TV. In fact one of the Televisions was passed along to my Handyman. He and his Family love it and also areimpressed with its quality.", "Date": "November 29, 2013"}, {"Title": "Dead In Three Months - Not Recommended", "Author": "C. Hill \"CFH\"", "ReviewID": "R362OV2KUZZAMB", "Overall": "1.0", "Content": "This Polariod 19\" LCD TV worked great for approximately three months and then the screen suddenly stopped working after it is on for about 30-minutes. When it worked the picture was great and it had decent sound, which makes it that much more disappointing that it failed so quickly.Normally I would go into greater detail about the TV's features and overall performance, but it just doesn't warrant that much effort. Do yourself a favor and look at the large majority of negative reviews on this lemon before you consider buying it.Not Recommended!CFH", "Date": "August 29, 2012"}, {"Title": "Dead  TLA-01911C", "Author": "Dave", "ReviewID": "R3MQHZGHTF49AF", "Overall": "1.0", "Content": "TLA-01911C Dead.  I bought this TV used from a friend, but with the manufacture date of 2007 I never figured a name brand TV would just die after a few years.  After reading other comments I noticed all the warning signs...  The screen would freeze while watching digital cable.  After the freezes become more frequent, startups started to take longer. During the slow startups the screen would seem fuzzy, with bands of the picture being out of whack.  It would take longer and longer for the TV to be clear after startup, then the screen became white.  The TV would no longer work, It would just be a white screen with lines in it.SO DO NOT BUY, IT WILL BREAK, AND IT WILL BREAK SOON.  I seem to be one of the lucky ones, as others broke within the warranty period and had to deal with horrible tech support.", "Date": "April 19, 2011"}, {"Title": "Automatic settings are as lousy as the parts", "Author": "S. Ty", "ReviewID": "R1RISVVWJBILLT", "Overall": "1.0", "Content": "This T.V. has its idea of how to auto crop the screen. So if you use an old 15 pin on the device, good luck getting it centered and the right resolution. And if you even do, the image gets doubled over so there are shadows of everything on screen. And better yet, sometimes the entire display will just not appear - like magic.HDMI is just as bad. You can even use a powerful utensil like nVidia graphics adapter software, but the fact remains, you'll never get there because you can't see the start menu. Yep, no matter how many times you default this thing, the monitor thinks it knows what it's doing and chops off all sides of your display. Even if you get the software up, the darn monitor still stretches images no matter what you do.Lastly, the resolution is 1440 x 900. Now don't be surprised, but that's not good. That's not widescreen (16:9) nor fullscreen (4:3) it's 16:10, meaning faces will be stretched and circles look like ovals.All in all - don't bother. There's no manual overdrive because Automatic failure is the way of the future.", "Date": "June 15, 2011"}, {"Title": "DO NOT BUY!", "Author": "K. Miller", "ReviewID": "R38Z20BSWSOC1L", "Overall": "1.0", "Content": "I have had my Polaroid for 2 year and now it does not work. The screen went blank. I can still hear it, but can not see anything. When this happened I looked online and MANY people are having the exact same problem. I'm a poor college kid who bought this tv to save space and money. I don't have any money to replace the tv so now I'm stuck. Do not buy this tv unless you want to throw your money away!", "Date": "November 24, 2009"}, {"Title": "WORST LCD TV ON MARKET, DON'T BUY IT !", "Author": "MC", "ReviewID": "R30R1A9UPCQK0D", "Overall": "1.0", "Content": "Just after one year it started getting blank screen occasionally. Now,  2.5 years it went off definitely.", "Date": "June 6, 2009"}, {"Title": "Great Picture - Did I Go Deaf?", "Author": "Thomas E. Hodapp \"Tom\"", "ReviewID": "R1YWLSA1BQCXF0", "Overall": "1.0", "Content": "We initially got this TV because it was priced right and it was a perfect fit for the kitchen - the standard television box just took up too much space on the counter.  Initially, we loved it.  It had a great picture and the sound quality was fine.  After a few months, the sound started to cut out for brief periods of time and then cut back in.  We thought it was our cable service - until we turned on a TV in the other room. The periods of time that the sound would cut off got increasingly longer in duration until - eventually - we had no sound at all.  We contacted Polaroid.  They wanted us to ship it back to them (paying for the shipping) PLUS send them $155.  We weighed our options and opted to get a different TV for approximately the same amount of money as that would have cost us.  So far, we're perfectly happy with our Vizio VA19L HDTV10T.", "Date": "March 17, 2009"}, {"Title": "Polaroid TLA-01911C", "Author": "B. Engle \"brianengle4\"", "ReviewID": "R1V99Z8UQCJSQ3", "Overall": "1.0", "Content": "Bought from Wal-Mart 13 months ago. Unit just began freezing periodically. If left on any length of time it will freeze about once in two hours (requiring unplugging to reset). Read that it is likely a bug in the firmware that prevents it from dealing w/ digital signal dropout and/or switching from analog to digital signals. All I know is that the drop-out occurs when a channel transitions from programming to advertising or vice-versa. Don't really like the set anyway, as HD programming shows up horizontally compressed so that everything looks unnaturally narrow (and there doesn't seem to be any way of customizing the resolution in HD mode). DVD signals look fine, however, aspect-ratio wise. The TV was cheap (about 260). I would highly recommend that anyone considering this set go to Costco and buy a good Japanese or Korean brand instead for about the same money. Polaroid was a great badge in its day (although never known for TVs), but they're fourth tier dog food these days, along side other once-great brands like Westinghouse, RCA, Zenith, Quasar, etc. Don't waste your time and $$$.", "Date": "January 25, 2009"}, {"Title": "HORRIBLE. DON'T BUY!", "Author": "L. Herrick", "ReviewID": "R8LO44IHT0DFD", "Overall": "1.0", "Content": "I got this television for Christmas and like clockwork, a few months after the warranty had ended, it wouldn't turn on anymore. It went completely dead. The TV had been treated very well and nothing else could have caused the problem.I called Polaroid and of course they had nothing to say to me. DO NOT buy televisions or cameras from them, they are trying to exploit people who need the cheaper option.", "Date": "July 13, 2008"}, {"Title": "WORST TV EVER!", "Author": "Mag \"mag\"", "ReviewID": "R2925BWU4PRDO", "Overall": "1.0", "Content": "When the TV works it is fine but that is WHEN it works which is rarely. I am currently struggling to get the DVD player to work that is built into it. I get HORRIBLE reception and more important... the DVD player DOES NOT WORK EVER! And it will stop in the middle of playing DVDs. I wish I had never bought this piece of $#^! before I knew this one was a dud my mom bought a smaller version and it is HORRIBLE also.POLAROID! SHAME ON YOU!!!!!!!!!!!!!!!!!", "Date": "June 1, 2010"}, {"Title": "Horrible all around!", "Author": "Theysaythetruthhurts", "ReviewID": "R1B13R7NPLIWAF", "Overall": "1.0", "Content": "Mine wasn't this exact model, it had a built in DVD. Literally after 5 weeks it stopped working. 8 months down the road the up and down channel buttons don't work on the remote or tv, and the only was it turns on is by the tv (universal remotes won't fix the prob either) 12 months down the road screen goes black you can hear sound I can change the channel by typing numbers in the remote, and I can change the volume. But no picture what do ever!! Anyone that would give this a 5 star hadn't had it but a couple days. I would give it zero stars if I could.", "Date": "May 1, 2012"}, {"Title": "Hate this TV", "Author": "Sara Bear", "ReviewID": "RA53OH2S2PWNM", "Overall": "2.0", "Content": "This TV was great when we first got it. Unfortunately, that was very short-lived. The sound is still okay, but the picture is completely shot. Colours are faded and there are permanent dark shadows on the screen. We have not caused any damage to the TV ourselves. Really disappointed in how this TV has deteriorated.I would not recommend a Polaroid TV to anyone. They are not well-made at all. Polaroid should stick to cameras, which they seem to know much better.", "Date": "March 19, 2012"}, {"Title": "Do NOT buy a Polaroid TV", "Author": "Angela", "ReviewID": "R30BFM4VYQHJ76", "Overall": "1.0", "Content": "I purchased two Polaroid TVs from Walmart (19\" HD LCD TV & DVD Combo) and a 33\" HD LCD TV & DVD combo).  The 19\" will only display an image for 3 seconds and the 33\" had a dark streak in the center of the screen and the DVD play does not work at all).  Walmart will not exchange (nor do they carry the crappy TVs) and Polaroid is non responsive.", "Date": "January 8, 2012"}, {"Title": "Won't last long.", "Author": "Fred", "ReviewID": "R1Y3FJ50U16LQR", "Overall": "1.0", "Content": "I bought this TV 3 years ago at a big box store.  4 months ago it started to malfunction. It would turn on to just a white screen. I would turn it off then back on again, the picture would be there but no sound. After turning off then on again it would come back on.  Now a few months later, it won't turn on at all. Dead.  I would assume that a TV should last longer. I have a Big tv in my living room that is 10 years old and still working without issue.  This TV is crap when it comes to longevity.  Buy something else.  Considering how cheap other brand TVs of this size are now-a-days, I wont even bother trying to get it fixed.", "Date": "January 5, 2012"}, {"Title": "Frustrating tv!", "Author": "Terrance", "ReviewID": "RZ18RLE4FWG55", "Overall": "1.0", "Content": "After about 2 years the tv audio would clip out.  Then later the picture wouldn't show unless we warmed up the tv for about 5 minutes.  When you first turn it on it you have to wait and turn it on and off for a while to finally get a picture. Won't buy another Polaroid tv as far as I can see.", "Date": "April 26, 2011"}, {"Title": "Love It but Leave It!", "Author": "LadyReah", "ReviewID": "R2XMTTQF1BV5V3", "Overall": "1.0", "Content": "I bought this to replace a flat screen in my bedroom that had washed out colors. I fell in love with the vibrancy of the colors in the store. For the next 2 years I really loved this t.v. But at 2 years and 3 months old it just quit one day. After a bit of research online I found that not only was this a problem with this model but that many others felt that dealing with customer service was a nightmare.Yes, it is an inexpensive t.v. But I expect that even an inexpensive t.v. would last longer than 2 years with only occasional use. I have an old Magnavox that gets considerable more wear and tear that is still going strong after nearly 15 years.Polaroid did not get my money for a replacement nor will they until I see that their products are higher quality and that customer support is considered helpful.", "Date": "December 12, 2010"}, {"Title": "NON-SUPORT", "Author": "Mark S. Harsch", "ReviewID": "R2XFJAUZ2OCJNW", "Overall": "1.0", "Content": "I have Polaroid 32' widescreen, and all the Digital channels are not compatible with the digital tuner that's in the TV'  When I called product support, told me told me that LIFE IS NOT FAIR!!,neither is Polariold! that there was noting they could do.", "Date": "August 15, 2009"}, {"Title": "polaroid hemorrhoid", "Author": "Johnnie M. Dobson \"polaroid hemorrhoid\"", "ReviewID": "R33RI43DKEQKSI", "Overall": "1.0", "Content": "dont want to even give it a star but maybe i should given that my $1000 flat screen polaroid 40\" lcd lasted a grand total of 23 months before going kaput. i must have gotten a \"good\" one judging from all the reviews ive read from multiple sites. shame on polaroid! i gave them a chance and now I am paying for their faulty design and virtually nonexistent customer service. everyone who is demanding a recall on these products is absolutely right. RECALL!-RECALL!-RECALL! jd", "Date": "January 28, 2009"}, {"Title": "Avoid this product and company at all costs!!", "Author": "Janice A. Walsh \"Janice W.\"", "ReviewID": "R204VWZ553WXCX", "Overall": "1.0", "Content": "I bought this TV with the built in DVD for my one year old son.  The picture was decent in ths store and the price seemed right so we bought it right before Christmas.  Within 3 months the DVD player stopped working.  I contacted the company and was met with nothing but a series of transferred blame, followed by an offer for me to PAY to have it shipped to Califonia so they can take a look at it.  No thanks!  Avoid this product and this company at all costs.  They do not stand behind their customers or their products.  As a side note and only slightly less annoying, I also was going through 4 batteries a week to keep the remote working.  What a waste of time and money.", "Date": "March 31, 2008"}, {"Title": "didnt receive....want a refund!!!!!!!!!", "Author": "albertnleela", "ReviewID": "R2KIQUMK50OGSR", "Overall": "1.0", "Content": "got sick for 11months other ppl took over hm never recieved this item. I wwant my card on file credited asap....i cant believe this. when i contacted my son he explained it never came, we moved within 2 wks because of my illness. were now in miami....", "Date": "November 22, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Polaroid TLA-01911C 19\" LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51iSmmoY9HL._SX300_.jpg", "ProductID": "B000PY9SLS"}}