{"Reviews": [{"Title": "You may want to know more than what the manual tells you...", "Author": null, "ReviewID": "R3TPKQXMF7TTCI", "Overall": "4.0", "Content": "I really like the TV.  I like the way the picture looks, considering that I spent $1500, and not $5000.  I've had my TV a few days, so I can't tell you how it holds up over time (I'll be back).  This review is a \"tell you what you may want to know from day one\" as much as it is a review.  I hope I can help prevent you from damaging your projection TV by telling things not mentioned in the manual.An earlier review (different website) gave the TV one star out of five because he said after eight months he had side bars permanently burned into his screen, and he felt the manual's \"don't use 4:3 mode more than 15% of the time\" wasn't enough information.  Keeping this in mind, I never use 4:3 with gray side bars (I can live with the \"Just\" stretch.)The manual says nothing about a break in period (it didn't say \"this TV has new technology and doesn't need a \"break-in\" either).  I've read several internet articles that recommend special treatment the first 100 hours--have the contrast turned down.  This TV doesn't list \"contrast\" but I'm assuming \"picture\" is the same thing.  One said 250 hours (most said one hundred).  Everyone said turn down the contrast (or in our case, I think `picture').  One said to turn down other things (well, you need some brightness, or else no light gets to the screen and that can't be a good break-in either J.  Several articles on projection TVs said \"Wow, after the breakin the picture became really great!\"  My second day I thought it was looking better than the first.  One site said \"don't just turn on your TV for 100 hours and say `I'm done!'\", that the turning the TV on and turning it off (so that the components warm up, then cool down, etc.) was a part of the conditioning.As delivered, the TV setting was on \"vivid\" which has the highest picture.  I turned that all the way down.  I hooked a computer LCD monitor up to my DVD player through an S-video, and ran component cables (red, green, blue) from the DVD player into the TV so I could compare the pictures.  The TV seemed to error on too much red (people skin color), so I changed color temperature to cool, and there was too much color, so I turned down the tint.  This gave people a more natural looking skin color.  This isn't a criticism of this particular model--one website named three TV brands and said they all give you a TV with the contrast (or picture) turned high and probably too much red.  For comic relief, one guy mentioned that the stores put the most expensive TV's in a category on \"vivid\" so they look better than the less expensive TVs.One site said that the large the projection TV, the more likelihood of problems like burn in .  I'm paranoid about the TV logos in the lower right corner if the logo is solid white (I sent ABC an email pleading with them to change to something half transparent so the colors underneath come through.)  News channels with a running ticker at the bottom of the screen-never!  Right now while I'm breaking the TV, I'm not playing any cartoons.  My understanding of the break in is to run the circuitry without a heavy load on the lamps (like driving your new car 50 miles an hour on the highway).  To me, the cartoons are very very colorful, equivalent to playing a normal movie on vivid.  Wouldn't that defeat the purpose of the break-in?  I hope to find something about this on the internet.Biggest complaint- I've already seen with two of my widescreen DVDs that they don't quite fill the screen from top to bottom (slight slivers of blackness at top and bottom) and none of the zoom modes will fix this.  Those DVD's are now banned from the TV(I'll play them on my computer).  One review site said the problem was that this TV only has four Zoom options, and other TVs have more.  Maybe later I'll get a new DVD player that can send out a signal with various zooms and then I would just put the TV on standard aspect (no zooming) to accept it.  Perhaps this is my biggest complaint against the TV, that the basic \"zoom\" can't make it zoom all the way in each direction.  From reading the manual, I would have thought it would zoom completely.TV gets 4 of 5 stars for excellent price to performance ratio.  I wanted to give 5, but if all this stuff I found on the internet is true, then when I bought the TV, I could have read the manual, turned it on, and misused/abused it during the first few weeks of use.  I don't know how much new lamps cost, or what I would pay for the labor.  The guy with the problem of the burned in side bars said that one would cost $500 total (parts and labor).", "Date": "January 3, 2004"}, {"Title": "Gorgeous image", "Author": "E. Cove \"arzec\"", "ReviewID": "R1MHFF6GFSXN3M", "Overall": "5.0", "Content": "Since I just got this, I can't comment on its reliability, but mine looks and works great.  First off, the PT-53WX53 seems to be pretty lightweight - relatively speaking - compared to other 53\" HDTV's.  The image was pretty good right out of the box.  It has some brightness presets, and mine was set to \"Vivid\" which is probably too bright for most situations.  I changed that, and also brought down the color saturation.  Once I did all this, the image looked very good.  All I have right now is analog cable, which looks grainy on many channels.  But DVD's are crystal-clear: sharp, gorgeous color and contrast.  I did a little homework, and a couple of other RPTV brands (Hitachi and Mitsubishi) consistently came up as having superior images, but I think the differences are negligible - only hardcore videophiles could have a problem with the PT-53WX53's image.  I highly recommend this television.Added: I've since upgraded to digital cable with HD.  The regular digital cable images are fine.  But HD on this set is fantastic!  Crystal-clear, great definition and color.  I'm very satisfied with this set.", "Date": "August 23, 2003"}, {"Title": "Big Clear Picture--Small(ish) Price", "Author": null, "ReviewID": "RQC9BYNWNP9W4", "Overall": "5.0", "Content": "I've had my Panasonic PT-53WX53 for about two weeks.  The unit's picture quality is excellent, and the sound is decent even using only the built-in speakers.  For optimum picture quality, you'll likely need some set-up.  Fortunately, the cable guy who installed my HD box loves his work, and spent about 30-45 minutes tinkering with various controls.  When he was done, I was left with a sparkling, amazingly clear picture.  The one drawback: once you've seen HD, you can't go back.This unit is an excellent value.  Why spend several times more for a plasma, unless you *really* need that extra 21 inches of space (this unit is about 25 inches deep, versus 4 or so for a plasma).", "Date": "November 25, 2003"}, {"Title": "Spectacular Purchase", "Author": "Lucas Acha", "ReviewID": "R28CBVFBHLTXY7", "Overall": "5.0", "Content": "I just bought this HDTV, and I love it! The picture on my progressive scan DVD Player is superb. This is the Perfect system for the room I have it in. My surround sound hook up in addition to this Set makes watching DVD seem like going to the movies!", "Date": "August 7, 2003"}, {"Title": "EXCELLENT, EXCELLENT, BUY !!!!!!!!!!", "Author": "Shawn", "ReviewID": "R1GTBPF6GLPPV6", "Overall": "5.0", "Content": "I bought this TV last month but before I did, I surfed the web for about 2 weeks to read reviews and compare prices. I even went to the Electronic stores that sold the models to see which one was more appealing. This model in each and every store I went into was CRYSTAL CLEAR, the picture was GORGEOUS. The Amazon price is so/so but right around the store price. I bought mine from a MErchant affiliated with amazon and WHAT A DEAL I got !!!!!!! $350 cheaper then the Amazon price.   When I got the TV 8 days after ordering, it was delivered and opened. I then realized how big it was compared to how small it looked in the store. I WAS PLEASED. the sound was EXCELLENT, picture perfect. I bought some home theater speakers and WOW. AMAZING !!!!!!!! 1 tip- when fine tuning the picture set it while your on a nature/wildlife show/channel its a good measuring stick for picture tuning.negatives-per channel watt output is only 15w, and it doesn't really look good inside a enclosed wall unit. other then that I LOVE IT !!!!!!!!!!! YOU WILL TOO !!!!!!!!!", "Date": "March 12, 2004"}, {"Title": "Panasonic PT53WX53 or PT47WX53. Why pay more, for less?", "Author": null, "ReviewID": "R3LMPT47C34NUT", "Overall": "5.0", "Content": "If you want a nice HDTV and have the room, I recommend the 53\" rear projection PANASONIC.Take a look at the Amazon reviews, Circuit City (or Best buy, can't remember which has reviews between BB and CC). The reviews were so stellar that I actually bought it sight unseen and shipped it from Amazon. And man!, were they right....the features and clarity is amazing (remember to lower brightness and no game systems for 1st 100 hours to avoid burn-in...also, avoid playing in 4x3 mode with vertical black bars for same reason).When you do all the math, it is cheapest to buy from Amazon (but only with an Amazon Credit Card) becuase it sells for $1499 at Amazon plus $119 for shipping... but then there is NO TAX (most states) and with the Amazon CC you get Triple point for Amazon purchases (and for every $2500 points you get a $25 Amazon Gift code in the mail), so that gets you *almost* enough points for $50 in Gift codes. Even with free shipping promo's or the $100 GC from BB, Amazon beats them becuase of the no sales tax.IMPORTANT: Everything I have read and heard from tech people in the industry (not you minimum wage CC or BB sales clerks) say that Plasma is too young of a technology, doesn't generally come with a tuner or speakers, costs a ton more and has a lifespan measured in hours (instead of years). My research suggests your plasma will last 5 years (and start to get fuzzy in about 2) and the rear-projection will last approx 20 years (but will of course need some maintenance over that time frame). Also, I have also heard that you should stay AWAY from LCD Projection TV (just get the standard 3 gun projector type) becuase the LCD type is driven by a bulb that costs $200-$300 and blows out every 5000 to 8000 hours (but indications are that your first one will happen in approx one year...which seems even faster than the the hourly guestimate). In fairness the bulb (on some models) is user replacable and the bulb may come down in price if the technolofgy catches on, but i wouldn't bet on it.The panasonic 53 inch has a native resolution of 1080 (and I believe you need a converter box to scalle the 720 broadcasts....it does regular old cable without a box , but becuase it is digital the picture ain't amazing with regular cable...but that doesn't matter to me...I wanted the HDTV for DVDs and when I eventually feel like shelling out more $$ for HDTV cable.).BTW, My last box was a rear-projection and died in about 6 years, so I was NOT ready to buy another rear-projection. But after research I found that my old box was notorious for a very high failure rate...there was even a class action lawsuit. I would mention the manufaturer, but it wouldn't matter becuase it was branded under multiple names and they don't make it anymore, so I don't want to prejudice people against a brand becuase of one particulr (defective) 6 year old model. However, I will say the manufacturer was NOT Panasonic. Suffice it to say, that I was all gung-ho for plasma and NOT looking for rear-projection, but after all the research and info I got, rear-projections in general, and the 53\" panasonice model specifically, won the contest hands down !If you have info that counters all this, please post for others to see...These are just my opinions based on my experiences/research and this is a big purchase...the more opinions the better. Panasonic Part Number: PT53WX53 (They also make the same unit in 47 inch: PT47WX53)", "Date": "April 22, 2004"}, {"Title": "Panasonic 53\" HD ready TV.  Best set for your $$ hands down.", "Author": "Jeff Simon", "ReviewID": "R3M7A9MSGDU21T", "Overall": "5.0", "Content": "I had a long time to research which TV I was going for and if you want a theater style experience with lots of great features, and fit it into a budget, get this set.  The biggest consideration in my opinion AFTER image quality (which is outstanding, but that's been dertermined in other reviews) is Aspect Ratio and how the TV deals with the two different formats.  (There are several aspect ratios, but I'm speaking on 16:9 \"theater\" & 4:3 \"television\")  This set does a good job of giving you several basic formats in which to choose from.  If you're looking for a TV that you can completely fine tune your picture with several zoom settings, this may dissapoint.  I found that they've included the perfect mix and I constantly find a perfect aspect ratio for me.  One setting titled \"JUST\" takes a 4:3 image and keeps the center 2/3's in original aspect and gradually stretchs the remaining 1/3 equally to the edges, this gives the most pleasing results for TV viewing.  On another note, Please read the manual for any TV you purchase.  The manual of this set says to not use the 4:3 drop down (which will make a television (4:3) signal display in the correct aspect, but will leave you with bars on the left and right of the screen) should be used LESS THAN 15% of the time.  If you don't you'll get image burn in.  And nobody wants that.  I would recommend Panasonic TV's to anyone, this is my second, and I will continue to purchase them in the distant future.", "Date": "May 14, 2004"}, {"Title": "panasonic53", "Author": null, "ReviewID": "R3NRRL1IJAME7V", "Overall": "5.0", "Content": "Panasonic repeatedly had the best reviews. Im sorry I bought from another retail outlet. I couldnt beat the price $1395. plus a dvd player thrown in.", "Date": "December 22, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "53-inch widescreen projection television with 1080i/480p resolution; 49.1 x 51.4 x 25 inches (W x H x D)\nDVI-HDTV input; 2-tuner PIP with 8-bit PIP image processing, PIP scaling, and multiformat PIP (HDTV compatible)\nProgressive Cinema Scan (3:2 pulldown) provides faithful reproduction of film-based programs\nMotion-adaptive 3D-Y/C digital comb filter enhances resolution by removing blurred edges between colors and reducing dot crawl\nDigital velocity-modulated scanning improves the definition at picture edges", "Name": "Panasonic PT-53WX53 53-Inch Widescreen HD-Ready Projection TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41YSA5P24DL._SX300_.jpg", "ProductID": "B00009YAHK"}}