{"Reviews": [{"Title": "Very Impressed", "Author": "L. M. Stucky", "ReviewID": "RKSR7DJZVPPIM", "Overall": "5.0", "Content": "I've had this set for over two years.  The picture is beautiful with DirectTV HD. I play it around six hours a day and no problems. If I had waited I could have bought it for half the price I paid for it. 65 inches and a beautiful picture for way under $2000.", "Date": "April 14, 2009"}, {"Title": "The BEST", "Author": "C. Proffitt \"csp\"", "ReviewID": "R10ESES6NQKXWN", "Overall": "5.0", "Content": "This tv is the best. We love it and have nothing bad to say about it!", "Date": "March 29, 2008"}, {"Title": "Great reliable TV", "Author": "R Reynoso", "ReviewID": "R3RMV77AO987II", "Overall": "5.0", "Content": "I have owned this TV for 7 years now. Has worked flawlessly. Great picture quality and sound. Works like new.", "Date": "March 4, 2012"}, {"Title": "Wonderful!", "Author": "Sherry R. Gillis", "ReviewID": "R22VBIR95KC063", "Overall": "5.0", "Content": "Wonderful TV, perfect picture, easy to have and watch.  Best TV I've ever had.  The high-def makes sports look like you are there.  GREAT!", "Date": "October 28, 2011"}, {"Title": "Amazon's order is terrible", "Author": "Jason Tu \"Dog Photo Man\"", "ReviewID": "R3G2IPEACV2OPS", "Overall": "1.0", "Content": "I will say that do not order any big item such as this TV from Amazon. Once your order, you can not return or cancel. Second day after my order, I decided to cancel the order. I was told that I could not cancel it but I can refuse the shipment. Guess what, after I told the shipping company that, Amazon asked me to pay for the shipping twice. Besides Amazon's price not being competitive, the customer support is lacking all the help you can get. Do not order any Projection TV from Amazon, unless you are planning to cancel or change your mind. It is a terrible web experience. I will not order it again from Amazon.", "Date": "July 8, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "65-inch widescreen (16:9 aspect-ratio) HD-compatible projection television featuring CrystalScan HDSC upconversion to 1080i/540p\nHDMI (High-Definition Multimedia Interface) HDTV input provides a pure, uncompressed video connection with DTV receiver or set-top box\nPowerFocus HD CRTs enhance sharpness and brightness; PowerFocus HC lenses offer 50 percent higher contrast than other lens systems\n3D Y/C digital comb filter with Vertical Contour Correction accurately processes RF and composite-video (DVD, VCR, camcorder) signals\nDFine high-speed velocity-scan modulation improves the definition at picture edges", "Name": "Toshiba 65H84 65-Inch HD-Ready Rear-Projection TV with HDMI Input", "ImgURL": "http://ecx.images-amazon.com/images/I/51X4NF8Q4BL._SX300_.jpg", "ProductID": "B0001YI9ZS"}}