{"Reviews": [{"Title": "For Big Screen Lovers Who Dont Want To Spend Too Much", "Author": "I Like Food", "ReviewID": "R2BVSBP9EHZIS6", "Overall": "4.0", "Content": "I just received this television and finally have it working. Although my experience so far has been with the local HD channels using an over the air HD antenna, it has still proven its worth the money.I come home every night after work wanting to watch TV on a \"nice\" TV. Sure there might be minor tweaks that you can do to enhance the picture but come on, It's not that noticable and definately not worth $500 to get a guy to come tune it for you. Out of the box this TV does very well. The red is a little sharp but its nothing you cant easily take care of going through the settings. The overall picture quality is absolutely beautiful when watching HD TV. I got to see our Minnesota Vikings get the crap beaten out of them by the Bengals with outstanding quality.With the large screen size that it has, watching TV series programs like \"Lost\" etc. really make a difference.I also purchased the GW12 TV Stand and it looks amazing in the house. Be aware how ever to make sure you have enough room for the TV in your living room. I had to move some of my couches back to the dining room to get a more comfortable viewing distance, but since I know Ill be moving out soon I knew it wouldnt be too bad for too long. But make sure you have at least 12 feet of distance to the TV screen. Remember that the TV is about 3 feet deep and that you will want to calculate that into your measurements as well. The Sony TV stand is shaped perfectly for the TV so there's no excessive space taken up.To use the full power of the TV I purchased the HD DVR from Direct TV to be able to record everything I miss and still be able to watch it in HD. HD programs are much more clear, vivid and sharper than what they looked like on your standard TV.One con is the lack of picture in picture. You'd think it would be nice with a TV this big but I suppose Sony had a reason for dropping it.The Speakers are pretty nice for the size of the TV but with a screen that big you should consider purchasing a home theater system or receiver set with seperate speakers.The remote control is kind of corny looking but hey its not the main point here.TV is also very light weight for its size and ways at about 150lbs.Overall I definately love this TV and think it was well worth the price. I looked into buying a DLP but it just didnt catch my eye as much as this rear projection LCD. Sony has definately improved the darkness of the black on the LCD TV's knowing that there were problems in the past.", "Date": "September 21, 2005"}, {"Title": "Do not buy this from sony", "Author": "Douglas G. Brown", "ReviewID": "R7R6JOYNLI5XO", "Overall": "1.0", "Content": "Had this tv for 3 years an now have an optiacal block problem.$1000 to get it fixedAll these tv's will end up with this same problemSony support is blowing me offLearn from my big big big mistakeGoogle it and you will see there is even a class action law suit going onI would stay away from all there tv's.", "Date": "February 28, 2010"}, {"Title": "Fan-tastic!", "Author": "Jess A. Farber", "ReviewID": "R7MP9HZUD8JN5", "Overall": "5.0", "Content": "I've always loved Sony TVs. Had a 48\" model for about 15 years and just traded up to this 60\" hi-def model. OMG! It's spectacular ... from the size (better than being in a movie theater) to the exceptional picture quality to the brilliance of clarity and color to the overall experience. Also, got an unbelievable price from BrandsMart ... $1,298! Whatever you pay for this, it's worth it if you're a TV junkie ... especially for sports. Even golf is exciting to watch.", "Date": "May 25, 2007"}, {"Title": "Should be a recall- Sony is aware of defect", "Author": "Teresa \"Teresa\"", "ReviewID": "R2QEM9TVXDGM24", "Overall": "1.0", "Content": "We loved this tv, until we replaced the bulb at $100 each three times. Then blue dots started to appear on the screen. Slowly the entire screen became covered with these dots. Sony warranty was over, extended warranty says they can't replace the optics block at the tune of $1400 for the part alone. After some research, I found that there are lawsuits against Sony for not recalling this product for this reason. Instead, after calling them, they offered me a \"discount\" that is non-negotiable on a smaller model for the inconvenience of having purchased the original unit.I would not recommend buying this unit without a great deal of research. [...]", "Date": "March 24, 2011"}, {"Title": "Optical Block problems", "Author": "Michael Turvaville \"Freon\"", "ReviewID": "R14FQY57QIT14Q", "Overall": "1.0", "Content": "Do not buy this, do a google search on sony lcd rear projection televisions and you will find class action lawsuits about a optical block defect that shows up about 2 years of use. Sony has the worst customer support i have ever dealt with in my entire life. There are thousands of people stuck with these dust collectors that cost more to fix than they are worth.", "Date": "April 18, 2009"}, {"Title": "Stood the test of time", "Author": "Angela Moss", "ReviewID": "R2YZAEYXES7MEK", "Overall": "5.0", "Content": "We bought this TV new back around 2007, have moved twice, and have loved it the whole time.  Never experienced any issues, love the picture quality and just plain big size of it.  It is perfect for my wife, family  and I to enjoy everything from The Real Housewives to Disney movies.  The set is 14\" deep and weighs 150 lbs.  Its actually really easy to move with two people, and I've even moved it by myself (sliding on towels across the floor).Only one HDMI input (multiple component inputs)Overall a great buy, great value. We are very pleased", "Date": "November 19, 2013"}, {"Title": "Great TV....", "Author": "Johnny Z", "ReviewID": "R2MRZQHRRTFSDI", "Overall": "5.0", "Content": "Bought mine in 2005 and haven't had a single issue with it...Opened the back a few years ago and dusted the inside...Has been moved at approximately 6 times over the years...Great TV....", "Date": "January 24, 2012"}, {"Title": "Sony Optical Block problem", "Author": "Amazon Man", "ReviewID": "R2RAP8XX3GGZFP", "Overall": "1.0", "Content": "Sony has an issue with their LCDs called Optical Block problem and after the warranty is up has refused to repair this issue. I bought their 60 inch model back in 2005 and paid $3500 and now will cost $1200 to fix. Google it and you will see.", "Date": "January 20, 2012"}, {"Title": "Great TV", "Author": "Adolfo", "ReviewID": "R3J5YGCJT40XTH", "Overall": "5.0", "Content": "I had this TV for over 6 years and I have not ever had any problems with the TV Iv used it withBlu-ray movies,laptop and video games and no problems.", "Date": "October 19, 2011"}, {"Title": "Good picture works great", "Author": "Peter G", "ReviewID": "R1C05HT3NHRUFW", "Overall": "5.0", "Content": "We got this for about 4 years now and the TV is pretty good. Using with Blu-Ray and DVD most of the time, the picture is one of the better ones. It has enough inputs and even our PC works fine on this screen. No issues whatsoever. Great TV!", "Date": "October 16, 2011"}, {"Title": "The worst TV", "Author": "Crash", "ReviewID": "RHD1IS5XNXVRR", "Overall": "1.0", "Content": "I still own a old Emerson 19inch that out lived the Sony! The Emerson cost $100 in it's day and the Sony $2,500. The optical block is going out and we have replaced 2 lamps! I just found out recently that this is a major issue with this TV and from what I have researched Sony will do nothing to help! We also had a Sony Home Theater System die! Sony used to be the best quality! Not anymore!", "Date": "October 14, 2011"}, {"Title": "We love it!", "Author": "V. V. Sanchez \"vanessa\"", "ReviewID": "R2LZWPLXUF7R7X", "Overall": "5.0", "Content": "This television is great!  The screen size and enhanced/adjustable surround sound, make your tv viewing experience/gaming experience....LIFELIKE!  Just like the actual theater!  We recently upgraded from a normal television to this! The high quality sound and picture are unreal!!!!!  You do not need surround sound or enhanced/detached speakers with the built in sound system.  We love it!  It is PERFECT!!!!!!", "Date": "November 20, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "3LCD Technology\nWEGA Engine System\nCinema Black Pro\nATSC Integrated Tuner with CableCARD Slot\nWEGA GATE - Easy Operation Guide", "Name": "Sony KDF-E60A20 60-Inch LCD Rear Projection Television", "ImgURL": "http://ecx.images-amazon.com/images/I/3168QT61R2L._SX300_.jpg", "ProductID": "B000A1CGH4"}}