{"Reviews": [{"Title": "Great TV just in time for football season!", "Author": "S. DELANCEY \"stinger_bee\"", "ReviewID": "R3EI73RZYHJ3I1", "Overall": "5.0", "Content": "I have had the Magnavox 42MF437B 42\" LCD HDTV for about 4 months now.  I couldn't be happier with the purchase.  First of all, we use this TV in our Family room with a DIRECTV HD DVR.  I have it set to use the 1080i display from the HD DVR (1080p not available).  The picture is very crisp and bright on HD channels that are available.  Even using 1080i, fast motion does not seem to have \"trails\" as I would have expected.  I've experimented with 720p vs. 1080i and, to my untrained eye, the higher definition setting even in interlaced is better.Let me go backward for a minute to when I received the TV.  The box itself is pretty ingenious.  If you bother to read the directions (which, for once, I actually did), the box is quite helpful in setting up the TV.  It allows you to mount the stand and plug in the lower speaker in a safe and secure manner prior to standing it up.One of the reasons out side of the features this TV appealed to me was the fact that is is 40.9\" wide.  We have a TV cabinet that I really did not want to replace that could only accommodate a 41\" wide set.  I had been looking for something that would fit this range so that my +$1,000 TV wouldn't cost me +$2,000 in furniture.  Once I assembled the TV it slide in perfectly with virtually no gap on the side of the cabinet.  It sort of has a built in look now.  The menus for setting up the TV are fairly intuitive and easy to configure.In the beginning, I was using Dish Network standard service and pulling HDTV over the air with an RCA antenna.  This was serviceable but the signal from the OTA side was too week to have reliable service.  The TV did just find with the OTA signal when environmental conditions were just right (read, after the sun went down).  I am much happier with the DIRECTV HD service now.All in all, this is a fantastic TV for my needs and would highly recommend it to anyone considering a 42\" 1080p TV.", "Date": "June 28, 2007"}, {"Title": "Nice set - may be able to do better for the money.", "Author": "B. Saxton \"bsax\"", "ReviewID": "R3C9LC48QTZMGZ", "Overall": "4.0", "Content": "I have this TV and I am very happy with it. It has a very nice, bright, crisp picture. It has TRUE 1080 - be careful when looking at sets. 1366 X 728 pixels is 720P HD. 1920 x 1080 is full 1080i/p HD. Often times sellers give the pixels and then say the TV takes 1080i input - this does not mean it can display all those pixels though! Check the pixels if you want 1080, it should have 1920 x 1080 pixels. It has lots of inputs including 2 HDMI (3 would be nicer but many TVs just come with 1).Now, this is not the most full-featured model and you may be able to find more features for your money. It does not have picture-in-picture (bummer). The menus are navigable, but sparse and somewhat awkward (but not too bad). The automatic format detection is a bit buggy - it may try to automatically change the aspect ratio during the middle of shows and movies and that can be annoying. You just need to manually set the TV to Widescreen in this case.Overall, I am very happy with the set.", "Date": "September 3, 2007"}, {"Title": "Broke in 2.5 months", "Author": "D. Sun", "ReviewID": "R3SG69TMK61OD7", "Overall": "1.0", "Content": "I enjoyed this LCD, even though several sources not to trust Magnavox/Philips electronics. The Magnavox has really cheap speakers, a non-universal remote, problems with bright reds, but it was still a decent LCD for the price and had a max res of 1080P. However, after 2.5 months the Magnavox developed a bad column of pixels, which ruined the display.", "Date": "July 18, 2007"}, {"Title": "Great Value but not perfect", "Author": "Bocatrip", "ReviewID": "R2G7T4DP85UYQV", "Overall": "3.0", "Content": "This is one of the first tvs being sold today with 1080P in LCD in a budget price range. The picture is excellent and it has many imputs. The speakers are removeable as well but you can connect to a home theatre. The one negative is that on a solid light blue or grey background like a sky or sea scene you will notice a dark line going down the center of the screen. Other than that the unit is fine. You can't go wrong for the price. I could spend $500-$1000 more for a 42\" LCD but would it be worth the extra bucks?", "Date": "August 23, 2007"}, {"Title": "Has Problems!", "Author": "Mayoral", "ReviewID": "R3JC8IT7D0MFBO", "Overall": "1.0", "Content": "When I first got this tv I was amazed at how I got such a good deal.  The picture quality is excellent and the price was great.  After about 3 months it started having problems.  It started taking longer and longer for the tv to turn on.  Now it takes about 10 to 15 min to turn on.  Also after 6 months it is starting to have trouble with the ATSC/Qam tuner.  HD channels are starting to go blank.  I wish I could return it but now I am stuck with it.Thanks Magnavox.", "Date": "January 10, 2008"}, {"Title": "Big Mistake", "Author": "L. Simle", "ReviewID": "R828BFWBESE91", "Overall": "1.0", "Content": "We had the TV about 3 months before the pic just screwed up...you couldn't watch it at all.  Trying to get it fixed was the worst!  You can't just take it back;  they find a certified TV repair person in your city (which took a month), the repair people called and made an appt for 1 1/2 weeks out. They finally come find the problem, order the part (took 2 weeks) , make another appt(one week later) and come replace the bad part.  Worked fine for another 2 months but has started the whole process all over again.  When it works, great picture.  All in all, we lost about 2 months of viewing waiting on for the run-around to come full circle!", "Date": "May 9, 2008"}, {"Title": "reasonable", "Author": "K. Basham", "ReviewID": "R3D26LFCHNA81I", "Overall": "2.0", "Content": "It took a software update to make this tv perform correctly.  previously, the only time i was happy with the picture quality was for a fraction of a second when switching between the menu and normal viewing.  for some reason, just exactly then, the picture became GREAT.fiddling with brightness and tint and contrast, etc, only generates slight changes in screen appearance.we touched the screen with bare fingers when we installed it, and seem to be cursed with an eternal unerasable smudge.seriously:  no proctective, cleanable barrier between the lcd and the world?we have yet to get any hdtv equipment.  no telling how things might improve", "Date": "August 11, 2008"}, {"Title": "Good set for the price", "Author": "ACDII", "ReviewID": "RHYRFP97HSGJW", "Overall": "4.0", "Content": "I bought this just before Christmas in 2007, and hookup of it was simple, just plug in the HDMI cable, and turn it on, the set did the rest. Picture quality is very good, only exception is some darks pixilate, but that could be the source, and not the set. It is hooked to a Directv HD DVR, some channels come in very clear, others, not so. Sound quality is very good in that is gives a sense of surround, even though it only has two speakers. The fact it has multiple inputs makes it a very good set, I can hook my PS3 to it, the Diretv HD to it using the HDMI, and my Upconvert DVD player to the Composite, and output the sound via Optical to my Stereo, and still maintain full 5.1.One flaw I came across, and it is a strange one, there occasionally is a lighter area in the center of the screen that can be seen during periods when the screen is black, like between commercials, or night scenes in a show. Here's the strange part, if I wipe my hand across the screen, it goes away, and doesn't come back for months. For what I paid for this, I can gladly live with that problem. So nearly 2 years in service, and not a single complaint.", "Date": "November 12, 2009"}, {"Title": "not a bad tv", "Author": "Yair Marx", "ReviewID": "RMPHO323H5363", "Overall": "4.0", "Content": "i've had this tv for almost a year now. it looks great with my verizon fios hd service. i havent had any problems with it, so i dont what others are talking about. good bang for the buck", "Date": "August 21, 2008"}, {"Title": "Usage", "Author": "Jim", "ReviewID": "R2ZJN80YO9TU21", "Overall": "5.0", "Content": "I bought this set from another vendor.  So far haven't had any problems, Excellent picture, great color, can't say anything about reliablility, only had it TV for a week.  Seems to be a great TV.", "Date": "July 24, 2007"}, {"Title": "It's OK", "Author": "E. Anil", "ReviewID": "R2VXDMX0LF8N0J", "Overall": "4.0", "Content": "Very good quality and everything but I just found out it doesn't even have picture and picture feature. I didn't look for it but I would expect to have that feature, which TVs don't have this nowadays? I have 90 days to return, I may return and get something else if I find other things to bother me.", "Date": "July 25, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "42\" LCD HDTV with ATSC/Qam tuner\n1080p HD resolution for the ultimate in HD picture performance\nVGA input to connect to your PC\n176 degree viewing angle side to side and verical\n2 HDMI, VGA, 2 Component and 2 S-Video inputs", "Name": "Magnavox 42MF437B 42-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41gkV6slF-L._SX300_.jpg", "ProductID": "B000OWKIRO"}}