{"Reviews": [{"Title": "Oh yeah!!  Sock it to me with this!", "Author": "Twiddles42", "ReviewID": "R2RB920EFRHT2Z", "Overall": "5.0", "Content": "No stupid \"Dynamic contrast ratio: 8000:1\" gimmicks that merely flicker the backlight when the set's AI decides it ought to be, which is disconcerting and not to mention misleading in terms of real display quality...Just a true, real contrast ratio that allows numerous shadow and hue detail that you're not going to see so clearly in any competitor's 32\" set.No washed out or dull colors, either - this Sony is a worthy replacement for dead-end, electricity guzzling, heat generating CRT technology.And I looked at 6 brands, looking at every nuance, black level, color saturation, sharpness, detail, features, menu functions, et cetera, noting all TVs were at out-of-box conditions.  I'd love to namedrop the worst ones, but that's a no-no...  Here's a hint - those models are \"inexpensive for their size\".  :)Sony costs more, yes, but the difference in visual quality is formidable - worth every penny. Detail is exceptional, and sharp.  Other models may not be as bright, may give edges jagged lines, colors may be flat, and so on...If you are a videophile, this is THE set to get. Every setting under the sun can be changed (brightness, 'picture' (contrast), tint, et cetera).  And this monitor also, much to my surprise and delight, includes filters to make DVDs (MPEG2) and broadcast signals look less grainy/noisy and sharper.  You bet I'm a happy couch potato.Casual viewers would probably be satisfied with any competing model, but why?  As with lower quality screen technology, the hardware quality is bound to be lower as well. You do get what you pay for.  If you read up on competing models where people say \"it broke after 1.5 years\", you'll see a pattern forming...And if you looked at the competing model next to the Sony, you'd be tempted to buy the Sony anyway. Even if the cost difference was a mere $150.I also apologizing for sounding like a shill for Sony.  I'm not.One small addendum (06/30/07):  The stores' labels say it's 1600:1, the sticker on the left side of the monitor claims 8000:1.  This TV set does alter the backlight's brightness - solely on the level of ambient light in the room, not the incoming signal.  Either way, I've still had no negative issues with visual quality on DVD playback, NTSC TV, HD broadcast, or PC display (if your computer cannot handle 1366x768, try 1280x720 if possible.)", "Date": "June 20, 2007"}, {"Title": "Simply the Best in Every Way!", "Author": "Mighty Mac", "ReviewID": "R6QSD5T7DYHVI", "Overall": "5.0", "Content": "We're in the \"senior citizen\" class and were looking to replace our 27\" Panasonic tube TV (which did serve us well for more than 10 years.)  Being in our 70s did not mean I didn't THOROUGHLY check out and compare EVERY high-rated 32\" LCD HDTV on the market--at Sears, Circuit City, Wal-Mart and other brick&mortar; stores.  I searched on-line, read technical reviews, and paid particular attention to what buyers said about the products.  The hands-down winner for us (and apparently all accompanying buyer-reviews) is this awesome Sony product.  It is in our opinion simply the best in every way.  Period.  (\"Consumers Report\" magazine recently also ranked this product best in its category.)  [...]Now we enjoy a superb television picture with startling sound clarity.  I like it when a plan comes together.", "Date": "October 18, 2007"}, {"Title": "fantastic television!", "Author": "soulelement \"soulelement\"", "ReviewID": "R1L1TAITWALYOD", "Overall": "5.0", "Content": "I am a first-time buyer of a HD-LCD and just picked this television set up yesterday. Overall I am very pleased with the performance I am seeing. I went through two Samsung television sets: the first being the Samsung LN-S4095D 40\" 1080p LCD and the second being the Samsung LNT3253H 32\" LCD HDTV (after realizing I needed something smaller). Both models are full of video-tearing and audio-muting issues that Samsung has failed to resolve, so I decided that before any of these problems severely affected me, I would return them before the 30-day return policy expired. The sales person even mentioned that the LNT3242 model by Samsung was returned to his store over 7 times by the same customer (possibly in hopes of finding a non-defective set).I ended up purchasing the Sony KDL-32S3000 and am very satsified with the purchase. I was initially hesitant to purchase a Sony, especially after hearing about the issues of clouding on XBR2 & XBR3 models.. but it seems now that most issues have been resolved for both the S-Series set & the new XBR4 model. I can certainly say it out performed the two Samsungs I purchased, especially in terms of picture quality. While both manufacturers have good television sets, the Samsung, while maintaining softer imagery, did not have as sharp and vibrant of picture-quality. From what I understand, the new Bravias (2007) are equipped with a 10-bit video processor, unlike the previous Bravia Models equipped with 8-bit processors (BR2-3 Models); thus creating more vibrant colors & making previous models look inferior. Sound-wise, this TV also does better than the Samsungs. The Sammys had a less than mediocre output from the speakers (no deep lows whatsoever & mostly high-ends).In terms of the User Interface, the Sony sports a menu similar to that of PSP and PS3 interfaces. It can be confusing for the first time user, but I find the system to be rather easy to navigate through. The set itself is loaded with many options for tweaking video output, but does not have enough options to flexibly tweak color temperature (I.E. cool, warm, etc). It also comes with an Internet Link option, mainly for streaming HD to your television from the Internet using a proprietary Sony device. I am not sure if I would take advantage of this, but the option of having it is nice. The built-in tuner was also able to pick up a variety of HD 1080i and SD 420i channels. They look fantastic on screen.If you are a gamer looking to use your PS3 on this, you will be pleased to know that games do output on this set at 1080p resolution. DVDs also display (according to the television information) at 1080p. Mpeg2-noise reduction is also available, in case you would like to reduce the amount of noise on DVD output. There is a PC-input on this television, which also displays very nicely, but only displays at a max resolution of 1360x768.From my understanding, the only major difference between this set and the XBR4 set (the higher end consumer model) is the option of having \"motion-flow\" 120-hz display; however, according to other users who have purchased the XBR4 set, motion-flow is still not fully developed. Apparently, the system creates artifical frames in between frames in order to create a much more fluid and realistic picture (which I hear is quite amazing), but this also creates artifacts and other miscellaneous noise in the process. All in all, the picture quality is improved with this system, but whether you want to take a 200-300 dollar gamble on this is purely up to you.I am usually not inclined to give products a 5-star rating and I do believe that there are products that are far-superior.. but this television is definitley worth its bang for the couple extra bucks.", "Date": "July 25, 2007"}, {"Title": "Best In It's Class Period", "Author": "ZGR8DCVER", "ReviewID": "R1G84O279JEVIX", "Overall": "5.0", "Content": "I have owned this TV for a month now and I am nothing but happy. Without getting into spec's and all that just put this TV up to any of the competitors and you will see the 200.00 difference. I highly agree with the other reviewer in all regards, you pay a little more than the others, but you get a lot more. This is a high quality set that will last you for long enough until new technology makes it obsolete. I have put this set up to the competition, both owned and viewed in store, more than once and the difference is clear. In an unrelated note I asked a salesman at a high end electronics store what XBR meant and he said, \"it looks better.\" (BTW this TV is nicer than the old 32\" XBR) My point is you can talk all day about contrast and backlight etc. etc., but in the end how does it look and how well is it made. Well after owning many a Sony in the past and in addition to this one, they have the BEST picture and are built to last, end of story. So, you could buy that cheaper model but in a year or two you may regret it! And in case you are wondering I DO NOT work for Sony or any of its affiliates.", "Date": "July 18, 2007"}, {"Title": "Good looks, great picture, Sony reliability!,", "Author": "Jim Green \"Jim\"", "ReviewID": "R1K10TC0KDJNIV", "Overall": "5.0", "Content": "I went over to Best Buy yesterday and took a look at all 3 of Sony's 32\" LCD TVs. The KDL-32S3000 looks better than the 32M3000 becuase they have put a black stand on it instead of silver. The XBR does not look as good becuase they changed the speaker to a shiny black rectangle at the bottom that looks cheap. For looks I would go with the 32S3000. The XBR is supposed to be technically better though. The 32M3000 is their base model being phased out now. The picture on all 3 is great and I could not tell the difference.I am very happy with this purchase. The TV has very good looks, sleek and discreet. The equivalent Samsung and Sharp had frames too shiny and looked cheap. The picture is great. SD cable looks very good, better than on my earlier Samsung 30\" Slimfit. Audio is very good. Best of all is Sony reliability. My previous experience was the Samsung 30\" SlimFit. That had bending issues at first and was replaced. Then it refused to turn on, and customer service was rude and unhelpful. The Slimfit has major reliability problems. I am very happy with this Sony that replaced it.Adding to this review after 2 weeks of extensive use. I compared this TV to Sony's 37\" KDF-37H1000 LCD projection TV. This 32\" LCD TV won out because:1. Sharper picture on HD signal - the KDF-37H1000 is a little more blurry. (Note the KDF-37H1000 picture is better than no-name brand LCDs). The Sony LCDs had better focus.1a. LCD TVs have a brighter picture. The Sony TVs have 3 picture settings: i) Vivid (very bright, what you see in Best Buy, ii) Standard (less bright, what looks better at home), and iii) Cinema (softer, more reds and earth shades). On the KDF-37H1000, you have to set it to vivid to watch even at home. On LCDs, you have to reduce brightness becuase they're brighter pictures.2. SD cable on LCD TV is much much better than on KDF-37H1000.2a. Motion was much cleaner on the LCD TVs. Sports blurred on the KDF-37H1000. I watched a bit of \"8 below\" Disney's Alaskan adventure with lots of white dogs and snow, and it looked bad, blurry and soft on the KDF-37H1000.3. LCD TV has much less depth. Looks sleeker. I also tapped my fingers and felt around the frames on the 2 TVs. The LCDs were firmer and fit better. The KDF-37H1000 frame was looser and cheaper materials like a toy.4. Maintainence costs - the KDF-37H1000 will require $200-400 bulb replacement in 1.5 years. The sales people said this could even happen in less than a year due to bulb malfunctions, just like in a floor lamp or any lamp. Note, Sony is phasing out LCD projection TVs in favor of SXRD, Hence, parts for the KDF-37H1000 will become harder to find. The KDF-37H1000 lamps are already $400 (Sony parts are always costlier - look at their digital camera memories, compared to Canon's).4a. The complex combination of chips, mirrors, projectors, lamps on a projection TV is more prone to break than the simpler LCD technology. I am an electrical engineer and design integrated circuits for a living.5. The KDF-37H1000 generates more heat than LCD, but much less than plasma.6. The KDF-37H1000 has moving parts, such as the cooling fan, etc., All of these are more prone to malfunction.7. Consumer reports rates the LCD TV reliability higher than projection TVs after looking at consumer repair data. Projection TVs had higher rates of return and repair.7a. The folks at Best Buy told me they saw higher rates of returns due to reliability on the KDF-37H1000 than on Sony's LCDs.8. The LCD TV has higher pixel count 1368 X 768, compared to the KDF-37H1000's 1200 X 720. This leads to sharper picture and better focus.9. Screen door effect on KDF-37H1000. When objects on screen moved, their individual pixels did not move as a group. The picture was constantly dissolving and reforming. Faces had spots that appeared and dissappeared.10. 2-3 years from now, I can put the LCD TV on a dresser in my bedroom as a 2nd TV, or put it in my study as a computer monitor. Cannot do this with the KDF-37H1000.11. Moving - when we move houses, the LCD TV will ride easily in the seat in my Honda Civic. Cannot do this with the KDF-37H1000, which will have to go in the back of the truck with my wife.The KDF-37H1000 was better than the Sony LCD TV in terms of:1. Sound was much better becuase larger speakers and probably more pwerful amp.2. A few more features and options that I will not use.3. Larger screen. However, you must sit further back to avoid seeing spots and motion blurs.Note the KDF-37H1000 is an excellent TV and very reliable compared to no-name brands. Definitely more reliable than the Samsung Slimfit TVs. We just came out of a bruising warranty battle with Samsung, and their reliability and customer service is pretty bad. The KDF-37H1000 does look very good compared to Samsung or Westinghouse LCD TVs, which had cheap and shiny frames. However, the KDF-37H1000 is just not as good as Sony's 32\" LCD TVs. If you want a bigger screen than Sony's LCDs, go 46\" or 55\" projection. The SXRD projection TVs had better motion. If you're thinking of 37\", get an LCD.One thing Sony's have going for them is Sony reliability. I work for IBM and we design integrated circuits for Sony's products. They require a 100 defective parts per million quality level from us. This is very good in the industry.One other note: We only have standard SD cable channels 2 to 99. Yesterday we found that if we disconnect the cable box, connect the cable directly to the TV, go to Channel 2 and hit the channel down button on the remote, we get the 4 HD networks in HD for free! ABC, NBC, Fox and CBS, plus a local HD PBS channel. Try it at home kids and don't tell Comcast! The HD picture is amazing.", "Date": "October 16, 2007"}, {"Title": "Shocking performance", "Author": "David M \"professordavid\"", "ReviewID": "R218EPS4FSYZ9W", "Overall": "5.0", "Content": "No, I was not electrocuted, but I am ecstatic. I just acquired this HDTV from Costco (different model number,  KDL-32SL130, but apparently same as 3000 but with different trim). The manual has both model numbers on the cover.We purchased another LCD HDTV (Sharp Aquos 32\" over two years ago). I thought it was good, but this tv far exceeds that earlier technology. The picture has well saturated colors, exceptional blacks, and a level of detail that appears to exceed its real resolution (sometimes it's not the specs, but the actual apparent performance). I get my signal from cable although I wonder what the reception would be for air hdtv signals.Besides the extreme satisfaction with picture quality, the sound is also good. It is tough to be more complimentary since the best sound still comes from auxiliary sources, and I am relying totally at this point on the tv's internal speakers.A problem I have observed in some LCD tvs is their inability to accommodate image speed or fast-moving images. The real test is probably sports viewing, but I have insufficient evidence to a concrete assessment. However there have been NO lags in responding to motion so far in a variety of programming. There is a lag in channel changes. It takes about 3 sec for the picture to compose after a change. A little slow for fast grazing... perhaps my settings are not yet optimal. I need to explore this further.I will also add that hdtv satisfaction is dependent on signal sources. For example, CNN Am show uses awesome cameras and their reception is impressive. On the other hand, TNT is broadcasting older shows which are not as impressive. Some of the dedicated  high definition networks such as Universal HD, many Discovery channel shows, etc. have frequent outstanding content.Finally, what about regular definition, but digital signal television? Most are acceptable, not breathtaking. Mainly again limitations with content. Graininess is apparent in most older shows. Certainly better than regular definition even though not hd. This is clearly a function of the imaging capabilities of the Sony Bravia.I am not taking it back. It's my first Sony. Oh, and my wife, who doesn't typically care about high definition signals... says, now that's a sharp, rich picture. So go for it. Geez, at Costco it was $750. The Amazon price is  higher. What an inexpensive way to get HDTV.", "Date": "November 29, 2007"}, {"Title": "A beautiful 32\" HDTV", "Author": "Art", "ReviewID": "R3BDPL6VHCHV6H", "Overall": "5.0", "Content": "I'm not an HDTV guru by any means, but subjectively, this is a great TV set. The price premium for this Sony model (compared to some other brands I checked out at various warehouse stores, such as Westinghouse, Samsung, LG) provides you with an on-screen setup menu that's easier to use than most other's I've seen (similar to the PS3 user interface), a timeless and classy black cabinet design that won't look dated in a few years, and very clear and crisp video quality, whether it be from lower resolution composite/s-video sources, or 1080i over-the-air HD reception or from the PS3's HDMI output.  I would not hesitate to recommend this model.  One note- there does appear to be quite a bit of on-screen glare when watching it from extreme angles, but that could be due to the way I have it positioned close by my windows in the living room.", "Date": "August 25, 2007"}, {"Title": "Don't hesitate, get this TV", "Author": "Jocaju \"JR\"", "ReviewID": "R40RXE5I5OFON", "Overall": "5.0", "Content": "I couldn't be happier. I and my PS3 are very happy with this HDTV. Before I decide to buy this TV, I was thinking in buying a cheap 32\" 720p, but after reading in some forums and reviews that you really should go for a better TV and not for the price, they are right, this TV has 8000:1 contrast ratio compared to 850 to 1000 on cheap models and also with this set you can rely on Sony, an well known brand. My sister bought a Westinghouse 32\" 720p back in October and now 2 months later the TV keep turning off by itself very often, so go with Sony. I still have analog cable, so I was doing a search for channels and besides my 71 channels from Comcast, this TV also found 52 digital hidden channels that my other TV couldn't get it, inclusive some HD channels, like on my area Discovery is 44 and TLC is 45, but between Discovery and TLC there were 3 more channels like 44.1, 44.3 & 44.4, this was awesome, and one of the HD channels is ABC, now I'll be able to watch Lost in HD. YEAH.Also I would like to thank for all of these reviews, they were realy helpfull. I did order this TV last week from circuit city, was on sale for $850 and only $10 3 day-shipping, but now this week the TV is on regular price for $1,100, so amazon has the best deal now.", "Date": "December 18, 2007"}, {"Title": "Without a doubt, best 32\" LCD money can buy!!", "Author": "D. Reed", "ReviewID": "RVT3FOOYAABD", "Overall": "5.0", "Content": "\"You get what you paid for\" is a common saying these days, especially with electronics, and when it's about TVs, it speaks the truth. I've had two prior HDTVs before settling down with this Sony BRAVIA KDL-32S3000, a Vizio and a Sharp. Granted they provide a nice HD picture, it just seemed they could be better. I bought this Sony from all the reviews I've read, and from the fact that I constantly look at it when I go to a major electronics store, comparing it between other companies and other Sony TVs as well.  Once I got it home, properly calibrated it, the picture quality was stunning to say the least. The colors really do pop on this TV set, more so than the other TVs that I have own. Contrast ratio really does make a difference when it comes to LCD TVs, and I'm not talking about that Dynamic contrast ratio with crazy numbers like 7000:1 to 15,000:1, I'm talking about the \"true\" on-screen contrast ratio. This 32S3000 Sony provides up to 1600:1 on-screen contrast ratio, which for an LCD is very good. The other two TVs I owned had 1000:1 and 1200:1, and yes I can notice the difference.  Typical of any big name company, Sony in this case, TV build quality is top notch. Built like a tank, this TV speaks quality. I like especially the matte black look bordering the TV, as I'm not a fan on the piano black trim some TVs have. No worries of backlight bleeding or hot spots on the LCD screen, everything is uniformity, much improvement over Sony's last generation of BRAVIA sets.  2 HDMI inputs, 2 Component inputs...all which that can accept a 1080p signal. Now this is not a 1080p TV, but it can accept the signal and down converts it to 720p, or the 1366x768 native resolution. This is cool, as I can send a 1080p signal from Playstation 3 and it will accept it with no problem.  HD content is quite amazing, from cable to Blu-ray movies, they all look good on this Sony set. You will be amazed.  Simply put, if your even thinking of getting this TV, do it! You will not be disappointed.", "Date": "December 15, 2007"}, {"Title": "Best $900 I ever spent.", "Author": "Bob Obb", "ReviewID": "R1G4UCNOQVW2X7", "Overall": "5.0", "Content": "I was immediately blown away after hooking up this TV. It comes with three picture presets (Standard, Vivid, Cinema) that make calibration virtually pointless. They're just that good. Whether I'm playing the PS3, watching movies, or just browsing pictures, I'm seeing details I've never noticed before on my previous HDTV (51\" rear-projection). If you're looking for a TV of this size with the best possible picture, look no further.", "Date": "October 1, 2007"}, {"Title": "hdtv", "Author": "Robert H. Ostrow \"bobo\"", "ReviewID": "RBSEK44TX2PXN", "Overall": "5.0", "Content": "a clear winner, from appearence,clarity of picture and sound. Also amazon price was better by $200 then \"best buy\"", "Date": "September 18, 2007"}, {"Title": "Greatest Home Office TV", "Author": "Annette Winston", "ReviewID": "R3RAXEGX4P4BBB", "Overall": "5.0", "Content": "First, I cannot say enough good things about how easy it was to order this TV, and to set it up. I basically took it out of the box, hooked up the cable, plugged it in, and told it to go search for channels. It was fantastic. I even decided NOT to rent a cable box, figuring when I want to watch HBO and SHO, I can go to the living room and send the guys back here to watch a football game! The picture is so much clearer and crisp than any TV I have ever owned. The sound is great. What a great buy. Delivery took about 5 days, and was worth the wait. Great job, Sony and Amazon.", "Date": "December 24, 2007"}, {"Title": "Excellent TV", "Author": "Thomas Richard Kennedy \"Tom\"", "ReviewID": "R77SSG83HFOIM", "Overall": "5.0", "Content": "In my opinion, Sony offers the best picture in LCD tvs.They do cost a bit more than other tvs, but they areworth it. Special deals such as free shipping and notax help offset the extra cost.", "Date": "September 17, 2007"}, {"Title": "George Plesa", "Author": "George W. Plesa", "ReviewID": "R1DSMY02I10TM0", "Overall": "5.0", "Content": "We have its 40\" big brother in the front room and it has performed flawlessly. The color is superb and HD is out of this world. Even SD is excellent using Dish TV. This Xmas my wife wanted a TV for her quilting room which doubles as my weight/treadmill room so I went shopping. I almost went with the 32' Regza but the Amazon reviews indicated a potential problem with the set failing to power up. Every manufacturer has duds but the comments regarding timely service were disturbing. I opted to spend a little more on the Sony 32\" and not have to worry about problems. The biggest complaint about Sony is always the price but I don't care to buy things twice. I get to the top of the line and I don't look back. The 32\" has the same excellent picture as the 40\". The TV needs to run for a few days for the color and the screen to break in. A two year old could set up the TV and run the remote control.", "Date": "January 9, 2008"}, {"Title": "Excellent Picture", "Author": "G Squared \"Gary\"", "ReviewID": "RO67X267GVCDV", "Overall": "5.0", "Content": "After much research we decided to pay more for this Sony than we otherwise would have paid for other 32\" flat screens.  The picture is outstanding and the sound quality more than adequate.  We invited some friends over who recently purchased a different brand flat screen and have HD reception.  They couldn't believe the difference in picture quality.  Although she isn't a sports fan, she wouldn't allow us to turn off the football game; she was mesmorized by the beautiful picture.The set was delivered ahead of schedule by a courteous driver.", "Date": "December 28, 2007"}, {"Title": "Even a novice can operate this one", "Author": "R. Cave", "ReviewID": "R3B8XKXOEZEM9R", "Overall": "5.0", "Content": "I got this tv for my mom, and she is not easily changed from her rotary dial telephone or her dial tv.  But when she saw the size and quality picture, she was very impressed.  Then came the remote.  She easily learned how to surf and operate everything, with ease.  So I guess I would rate this tv \"Excellent\" and \"Easy to operate\".", "Date": "February 13, 2008"}, {"Title": "Awesome TV", "Author": "Richard Sandrock \"Richie\"", "ReviewID": "RS735S9MC58UV", "Overall": "5.0", "Content": "This is my first HD set and it is amazing.  From set up to watching it took under half an hour.  After playing around with the controls and reading the instruction book I have a good understanding of all the TV's functions in about an hour and a half.  There are so many places to plug in DVD players and video game systems in the back, I don't need my RF switch box anymore.  Consumer Reports rated this the best of the 32 inch HD flat screens and they are correct.  I recomend this TV to anybody.", "Date": "November 17, 2007"}, {"Title": "Fantastic!!!", "Author": "C. Polanski \"CJP\"", "ReviewID": "R2QMF5XYEGF585", "Overall": "5.0", "Content": "I have now owned this television (Sony Bravia KDL-32S3000) for about two months and feel I have used it enough to write an adequate review. So here it goes:Picture:I have the set hooked up to a HD satellite receiver via a HDMI cable. I must say that HD picture is absolutely amazing. Detail is crisp, and colors are vibrant right out of the box. (I have made minimal setting changes and have found the factory settings to be quite right for me). Sports on the set are fantastic. Even when watching a fast paced hockey game there is no blurring from the quick motion.For non-HD signals, the picture is quite good. I do not yet have a HD or up-conversion player for my DVDs, so I watch all of them in standard def hooked through basic red, yellow, and white AV cables. The picture (like any HD TV playing a non-HD signal) can be grainy when looked at closely, but from my couch it does not look bad at all. Next purchase is the PS3!Sound:Very nice compared to other sets of the similar size. The sound created by the speakers is full and not \"tinny\" like cheaper sets. For movies and sports I prefer to turn on my stereo system and get much deeper bass and even crisper sound, but I find the sound from the TV very good in most situations.Features:The on screen menus are extremely easy to use and well thought out. Only complaint here is the two HDMI ports. Most comparable sets in this size and price have threeI bought this set to replace a Samsung LNT3253H that I had for about a week. (The set had multiple known audio and video problems right from the box - My fault for not doing enough research before the purchase.) I am very glad to have purchased this set. The extra cost was justified to get a well reviewed set from a reputable brand. Another side note for those doing research: This set along with the Sony Bravia XBR KDL-32XBR4 were the two highest rated 32\" sets by Consumers Reports for 2008. I will never go with anything other than Sony again.", "Date": "April 28, 2008"}, {"Title": "Easy set up/great picture", "Author": "J. Henningson", "ReviewID": "R2OF33V8RUY2KF", "Overall": "5.0", "Content": "This TV produces a beautiful picture on both standard and HD inputs. The color balance, contrast and motion response are all excellent, right out of the box.  Different types of inputs (ie. cable and different DVDs) may benefit from slight tweaking, but this is easily done on the fly via the remote.  Ignore the young geeks in the big box stores who want to charge you for installation!  Buy this set, do it yourself and enjoy...", "Date": "March 8, 2008"}, {"Title": "A beautiful TV", "Author": "James McCarty", "ReviewID": "R3S3ZN1BFW105F", "Overall": "5.0", "Content": "This is my first HDTV. I originally purchased a less expensive brand and was very disappointed by the picture. The Sony is well worth the extra money. I am very impressed by the quality of the blacks. Also, my viewing area's lighting varies greatly; this set automatically compensates very well. I also like the broad range of inputs. The TV allows for future expansion of me system. All in all a great TV!", "Date": "January 15, 2008"}, {"Title": "Far Exceeded My Expectations", "Author": "Matthew Hutchinson", "ReviewID": "R1JVMNCVR539JP", "Overall": "5.0", "Content": "I bought this based on several consumer reviews I read here and on other sites, and what I'd seen on display at Best Buy and Circuit City.  I ordered it from Electronic Express on Feb 8, with free shipping, and it arrived on Feb 14, 5 days before the latest estimated delivery date.  Very nice.My entertainment center's TV cabinet is 31.6\" wide.  My old CRT is a 27\".  I'd spent several months researching HDTV's and HD technology in general, and was expecting to have to settle for a 26\" HDTV to fit in my cabinet.  You can imagine my excitement when I discovered that 32\" HDTV's actually do exist that are small enough for my cabinet, though I only found 3, including this one.  At 31.1\" wide, this TV fit beautifully.My wife and I subscribe to digital cable through Time Warner.  Our plan includes 21 HD channels, including HD versions of all of our premium channels.  Time Warner also offers an HD pack with 4 additional movie channels exclusively in HD, so we decided to try it for a few months.  We watch close to 50 movies a month, so it made sense for us to add a few extra channels to really get as much out of our new TV as possible.  I know DirectTV offers a lot more HD channels, but having used them once before, my experience found that reception is exceedingly poor during storms, and DirectTV doesn't offer local channels.After hooking everything up, I turned it on for the first time, and turned to one of the HD channels.  I was sorely disappointed with the poor picture quality, until I realized I needed to switch the input source from TV to HDMI.  Then, suddenly...:: jaw drops ::I WILL NEVER GO BACK TO STANDARD DEFINITION!HD truly is a whole other world.  Images are crystal clear, and colors are more vivid than I ever thought possible.  In fact, the signal being fed by Time Warner provides a superior image than even the over-the-air HD signals that stores like Best Buy and Circuit City have piped into their display models.  Consider that food for thought if you're planning on sticking with the TV's built-in HD tuner.  If you can afford a digital cable subscription with HD channels, I highly recommend it.The TV supports 1080i, but the picture is interlaced, and I've found that its native 720p offers better overall image quality.  I've read that choosing between one or the other depends on what you're watching - action-packed programs such as sports being better suited for 720p, and 1080i for everything else.  Personally, I don't watch sports.  I hate sports.  But, I love action movies, and I've chosen to view everything I watch in 720p, even if I'm watching a documentary.  720p just looks that much clearer to me, because each frame is drawn all at once.Go to any electronics store and you'll see that the picture quality on all of their display model HDTV's are set on Vivid.  The brighter picture is designed to grab your attention and 'wow' you.  I tried the setting out at home, but I found it surprisingly overwhelming.  I switched to Standard, and immediately found it perfect for home viewing.  I especially love the TV's Light Sensor.  When enabled, it automatically detects the ambient light in the room and dims the picture to match.  It makes for incredibly pleasant viewing at night.After watching a few of my new HD channels, I switched on my XBox 360 Elite.  I have its HDMI cable connected to the second HDMI port on the back of the TV.  Words cannot begin to express how much better XBox games really do look in HD.  If you own a 360 Elite, and you have friends who've been pressuring you to upgrade your TV to really enjoy the visual power of the console, I urge you to heed their advice.  I can finally clearly read the HUD in Call of Duty 4, and Halo 3 is now a truly cinematic experience.  I downloaded a trailer for Clive Barker's Jericho the other night.  There's a screenshot of a scene from the trailer you can see at most gaming web sites.  It features a close-up of one of the members of the Jericho team - the woman with the butch hairdo.  The image quality of the trailer when viewed on the 360 Elite connected via HDMI is identical to the picture quality in that screenshot.  It totally... blew me... away...I'm also now finally able to take advantage of the 360 Elite's ability to upconvert standard DVD's to 720p, and it does an incredibly impressive job of that.  It's nice to know I'm not going to have to shell out another $170 for a stand alone upconverter to enjoy my current DVD collection.  One thing to note is that any upconverter's ability to produce an HD picture is dependent not only on the quality of the chip it's using to convert, but the quality of the DVD itself.  Some DVDs will absolutely shine when upconverted while others may produce some digital noise.  For example, The Matrix displayed a lot of digital noise while Superman Returns was spotless.  Keep that in mind if you already own a 360 Elite and are shopping for a stand-alone player.  Having said that, I'm going to wait another year until Profile 2.0 of Blu-ray is released and compatible high-end Blu-ray players come down in price.  I know that the PS3 has a built-in Blu-ray player and is future-proof with its inherent internet connectivity, but I have zero interest in its games.In summary, I couldn't be a happier with my new Sony.  I've already got the next week's worth of my favorite movies set to record in HD, and I can't wait to see them.  I've already watched Spider-Man, Videodrome, The 6th Day, and Bram Stoker's dracula, and they all looked spectacular.  You really can see every single pore on peoples' skin.", "Date": "February 18, 2008"}, {"Title": "Great TV, better price at Costco", "Author": "Edna", "ReviewID": "R1P602ZIY5LIND", "Overall": "5.0", "Content": "Thanks to everyone for the great review and comments for the TV.  Found the same TV, at Costco KDL-SL130 (only difference is the type of plastic used) for $ 849 and free shipping also.  Need to print out the $ 100 off coupon first then order on the website.ThanksEdna", "Date": "October 18, 2007"}, {"Title": "KING OF LCD", "Author": "Thaddeus Flanders", "ReviewID": "R275RL4OTV3NQ1", "Overall": "5.0", "Content": "first i must start my review by sayin thanks to the boys & girls who have postes such helpful reviews.second i want to say thanks to amazon for givin its customers the ability to express there views about product that they've purchased.my name is THADDEUS i live in the caribean on the island of ST.KITTS. it took me 4 months of readin reviews & comparing with other brands. the reason for this is because where i live we don't have best buy, circuit city, walmart etc......where u can go in & see the actual tv, & get some sone to explain the spec to you. thus made me read & read & read reviews. i finally made up my mind & purchase the \" SONY KDL 32S300\", not because i have other sony products but because of good customer reviews.THE LOOKS-: beautiful right out of the box, with a neat shape & a black finish. it doesnt have too mush inches on the sides & the table top stand give it s square look all around.other brands have a square shape but an oval table stand, which kinda kill the design.THE WEIGHT-: its not too heavy, & its not too light. the weight is just managable with a nice balance feel to it.THE CONTROL-: the control has a precision feel with the right button spacing, which wont have ur finger tied up. the \"HOME BUTTON\" is very fun to use, also the OPTION, WIDE, & INPUT button give u a short cut to PICTURE MODE, SOUNDS & EXTERNAL INPUTS with have to directly going to settings.THE SET UP-: the set up was easy for me because it is similar to the ps3 & PSP XMB........\"XROSS MEDIA BAR\". if u have either systems it should be an easy set up. if u dont it should still be an easy set up.PICTURE:  STANDARDbacklight- minpicture- 90bright-  60colour-  90hue-  0colour temp- neturalsharpness- minnoise reduction- highmpeg noise-  highADVANCED SETTINGS:black corrector- highadvance c.e-  highgamma-  offclear white-  highcolour space-  widelive colour-  highSOUND:  customtreble- 2bass-  maxbalance- 0surround- onsound booster- highsteady sound-  onvolume offset-0SCREEN:wide mode- wideauto wide- offdisplay area; normalvertical size-  0VIDEO OPTIONS:  cine-motionvideo 1,2,3- autocomponemt 1,2 - autohdmi 1,2 -  autoAUDIO OPTIONS:mts- sterospeakers- tvaudio- variableCHANNEL:cable- onCLOSED CAPTION:cc display- offanalog cc-  cc1digital cc- service 1  display options  customcharacter size- standardcharcter style-  7character colour- whitecharacter opacity- solidedge type- outlinededge colour- blackback ground colour- nonePARENTAL LOCK:country- usarating- offunrated- allowEXTENAL INPUTS:auto.Svideo 1- offvideo 2- offHDMI SETTINGS:hdmi control- ondevice auto power off- ontv auto power on- offGENERAL:language- englishinfo banner- offpower saving- offlight sensor- offpc power management- onthis is the setting i use &  get super excellent picture...even with standard cable.MOVIES:well im impressed with the clear, bright colours, the clean crips quality. the sound did a great job  for just 2 front speakers & to consider its a 32\" tv. you have to see for your self......MUSIC:i listen to rap, r&b;, dancehall, pop, rock and ive found that no matter what type or genre i listen to i got good sound quality. the vocals was clean, the bass was boomin enough and the over-all experince is great.GAMES:i have a ps3 and i have it hooked up using the sony hdmi cable. the one that comes with the usb cable.  motor storm: ive played dust devil, mud pool, coyote ridge and my favourite tenderizer. the mud looks real as real can be . u can see every grass & every srub.  unchared- drakes fortune: the jungle looks lush, the water looks stunning & the level where eddy chases drake in the jeep is beautiful, the light seemin dowm in the trees is jaw-dropin  devil may cry 4: watchin nero use his devil bringer in play never look so good. mission 7 is what i played & the lighting is awesome. when using dante have him do the million stab combo...that is eye candy  ridge racer 7: this game is fast & i never see any blur....ive played shadow caves & lost ruins........as expected the garss is green, the dark in the tunnels is fabulous.  resistance fall of man: when u have the bulleyes its fun to see the bullets fly across the screen. when u throw a grenade the effect is just staggerin...every particle u can see them like u were in the gameNOTES:ridge racer is a full 1080p gamethe setting does aply to all inputs. you will have to set all individual settin to each input...ie  video, component 1&2 etcits best to set the back light to min. setting it to high will make the picture too bright and generate too much heat. also the tv will burn more electricity. if u go too close the tv when the backlight is on high u can feel the heat on your skin.the volume has a neat bar when you increase or decrease the volume. other brands has huge bars when you increase or decreaseif electricty goes while watchin the tv, when it somes back the tv will automatically comes on. note a good idea, because if u have to go work & you are @ WORK when electricty comes back the tv will be on all that timeu can name your inputs...instead of video 1,2,3 u can give them names like ps3, dvd player etcCLOSING:  in closin i gave ths tv the rigorous test. i threw everything i thought of at ths tv & all i got was stunnin picture & excellent sound.i just cant stop watchin it..........thats my only prob.thanks amazonthanks sonythanks ladies & gents  thaddeus flanders", "Date": "August 28, 2008"}, {"Title": "A very good buy!", "Author": "Leweycat", "ReviewID": "R3RMPDELUMC9K6", "Overall": "5.0", "Content": "Great picture. Great Price. Scary packaging. The UPS delivery driver was so sure it was trashed he opened the box. Not so. It was perfect inside and works very nicely as a TV and DVD monitor. Highly recommended!", "Date": "March 16, 2008"}, {"Title": "Sony will never dissapoint you....", "Author": "William Blandin \"WEBG2000\"", "ReviewID": "R19E6P5R88FSEX", "Overall": "5.0", "Content": "I got this Sony Bravia in early January and after doing a lot of research on the internet an brick and mortar stores like C.C. and B.B. honestly I can say it was the best choice ever.The setup of my cable, digital channel, DVD and PS2 was a snap. It took a few minutes to recognize the NTSC and digital channels.Menus are very intuitive that I have not read the owner manuals yet.After almost 30 days checking LG, Sharp and Panasonic brands finally I went with this Sony Bravia with no second thoughts.Definitivelly I would strongly recomment this model over its competitors.", "Date": "February 5, 2008"}, {"Title": "Sony products - never disappoint me!", "Author": "H. Horton", "ReviewID": "R2C6I3Z45937J4", "Overall": "5.0", "Content": "Thanks for all the previous reviews, I chose this TV and without any hesitation I want to give it 5 stars. Sony products have never disppointed me, nor did this one. I strongly recommend it for a mid-size bedroom. You will be thrilled with its beautiful pictures!", "Date": "December 17, 2007"}, {"Title": "satisfied consumer", "Author": "kanga roo", "ReviewID": "R34OZKVJ8XJWAD", "Overall": "5.0", "Content": "This is an excellent product with wonderful sound and picture quality. It arrived on time and I am very pleased with it.  After shopping around I would say I got a good deal.", "Date": "December 11, 2007"}, {"Title": "Lasted Only 2 1/2 Years, And Sony \"Was Balony\" On Customer Service", "Author": "WJK \"Consumer Advocate\"", "ReviewID": "R130CEQOOO0MHY", "Overall": "1.0", "Content": "The high amount of heat that comes off, and the high electricity use with this 2 1/2 year old Sony Bravia S-Series KDL-32S3000 32-Inch 720p LCD HDTV that recently went bad, are horrible buyer benefits! Sony wanted me to take that tv to an authorized Sony repair shop and pay $50 to find out why the picture went out with no guarantees that they would pay for parts and/or labor to fix it. I thought it was throwing $50 of good money after the bad $900 that I had paid for the TV only 2 1/2 years ago.Sony is missing the boat on this, as I told them on the phone, after being transferred twice all over the world to different Sony subcontracting customer service facilities, that I hardly used this TV over 2 1/2 years, and I had a very expensive APC UPS with a state of the art surge supressor built in constantly connected to this TV set.  They said that it sounds like the kind of circumstances that they might pay for either the parts and/or the service to repair it, but they could not make any promises.  They insisted that I had to bring the TV to one of their authorized repair shops, and pay a non-refundable $50 service charge to find out if the problem was caused by me or a defective TV.  I think Sony, and any other TV mfr, miss the boat when they think \"short term\".  They should have said that if the TV problem was their fault, then Sony would refund the $50, and then fix the TV at no charge to me.  I found out from the repair shop that all these LCD TV's are \"new technology\", and it is not uncommon for the \"optical blocker\" or the \"main board\" to go out.  I think the excessive amount of heat that this non-LED TV puts out will cause problems for many owners down the road.  I have now lost my long term brand loyalty to Sony TV's!  I went with the VIZIO XVT373SV 37-Inch Full HD 1080P LED LCD HDTV with VIA Internet Application, and I'm very happy with it, so far.", "Date": "October 3, 2010"}, {"Title": "Awesome TV. Vanns Service Excellent!", "Author": "TV Guru", "ReviewID": "R1L8OH72SCLZ4S", "Overall": "5.0", "Content": "This is an awesome TV! The first set I received from Vann's was damaged by the shipper, and Vann's customer service was excellent! Their sales people were very helpful when I had questions about this set. I also wish to add that analog cable picture quality is very good with this set, the best I have seen out of all of the many sets that I looked at. And this is using an 8 way splitter no less! I will be buying from Vann's again in the future!", "Date": "March 30, 2008"}, {"Title": "Beautiful, right out of the box!", "Author": "Larry Darnell \"old movie buff\"", "ReviewID": "R1MK02KRQPNHSJ", "Overall": "5.0", "Content": "This was my first HDTV purchase and I couldn't be more pleased.  I had looked at other competitor's sets and read many, many, reviews and I chose the KDL-32S3000.  From reading some of the more critical reviews, I was concerned that I might have to spend a lot of time tweaking the set in order to get the optimum picture, not so, it was beautiful right out of the box.  I ordered mine when it was available from Amazon (directly) at a great price and with free shipping.Equally as impressive was the delivery service, Eagle.  The two young men that delivered the set were just great!  They unpacked and set-up the unit, taking plenty of time to familiarize me with its basic operation.  I have seldom received such courteous service!", "Date": "March 27, 2008"}, {"Title": "Perfect Choice!!!", "Author": "Rene Peralta", "ReviewID": "R3NSX14K9W779S", "Overall": "5.0", "Content": "I am extremely happy with the purchase of this LCD TV Set. I went to best buy so I can get an actual look on the image quality of different sets. This Sony TV stood out completely from the other 32\" models. I purchased the TV set. I set my cable box and my PS3 to it. The picture is excellent!!!! Games are flawless and the cable looks great.", "Date": "March 26, 2008"}, {"Title": "So far so good!", "Author": "Themuddman", "ReviewID": "R3VG4O54URM1EP", "Overall": "5.0", "Content": "I've owned this set about a week now. No problems at all setting it up. I'm getting a great picture using a UHF antenna pulling in the local HD broadcasts from over 25 miles away. Colors are bright and picture is extremely clear. Blu-ray discs are not at all fuzzy as some reviews have stated. The picture seems to \"jump\" off the screen. My only regret is I couldn't get a bigger set due to a home entertainment center I purchased and don't want to part with. I do get some glare with my window shades up in the daytime while watching at extreme angles. Everything I own with the Sony name on it has performed great. Highly recommended.", "Date": "March 20, 2008"}, {"Title": "Very good choice", "Author": "Miguel Valls \"Mike\"", "ReviewID": "RINNIPQW0BFP5", "Overall": "5.0", "Content": "I think that is a very good choice. Exelent image, exelent sound enough imputs. Recommend 100%.", "Date": "March 18, 2008"}, {"Title": "To 720P Infinity & Beyond...", "Author": "Planet X \"Kid Danger\"", "ReviewID": "R1KC533DCD1SSH", "Overall": "5.0", "Content": "I picked up a Blu-Ray player about three months ago (really nice $300 Sony one - forget the model #) and have been playing it through my HP high-def computer monitor that achieves 1080i and have been happy with everything, except the 22\" screen size.I had my heart set on a 40\" Bravia originally, but the 2K price tag was a bit daunting...so I went with this and expected to be slightly let down with the 720P maximum.NOT IN THE SLIGHTEST!!!Having just upgraded from a 12 year old Sony Trinitron (still running great) to this might be reason to be suspect as to why I'm so initially bowled-over, but not being a newbie to high-def, I assure you, I'm a tough cookie with a picky eye.Every image I've piped through the unit so far (Blu-ray, standard dvd, analog cable & original XBox) has been beyond my expectations.  My only gripe is that Sony cheaped out and didn't include at least ONE set of cables!  I mean, after ponying up 1K (including WA sales tax), I'd like at least an RCA 3-way or (the more helpful), an HDMI patch?  Oh well - luckily I live close to a Radio Shack and can give them the business.Besides this minor distraction, I remain blown away by Sony's near flawless track record with me and my audio/visual purchases from them over the last 25 years.  From my first Walkman to this, my first Bravia, I eagerly await their next leap into outdoing themselves yet again.", "Date": "March 12, 2008"}, {"Title": "32\" Sony Bravia", "Author": "critique101", "ReviewID": "R17J6Q9WEN3Y3N", "Overall": "5.0", "Content": "I love it. It has a very clear picture even with only standard cable. I also appreciate all the extra features like the low power option as well as the timer to turn the televison on. I am a deep sleeper and it works well with my alarm clock. I can choose time, channel and volume that I would like to wake up to without changing my current channel or volume.", "Date": "March 1, 2008"}, {"Title": "I like it!", "Author": "Wiley Quan", "ReviewID": "R1IP246CGRUZW5", "Overall": "5.0", "Content": "This is my second Sony TV, I think they have the best picture, bar none.This particular model has internal HD tuner, for example ch 5 and 5.1 is available.  The 5.1 has HD where the picture is much much sharper.I highly recommend this model.", "Date": "February 8, 2008"}, {"Title": "and it works!", "Author": "Y", "ReviewID": "R3JPG7E7I5GYNI", "Overall": "5.0", "Content": "After buying a Samsung LNT4069FX, I initially wanted the Samsung LNT3253H but got spooked by the sound/noise complaints. Although I didn't really want to buy a Sony, the 32S3000 had such good reviews that I bought it. It is a very nice set, I don't have any clouding issues that still seem to affect the XBR series. In retrospect though, for a small family room the 40 was a little too big and this 32 just barely sized enough, I would've gotten a 36/37 inch instead. I got the 32S3000 through Amazon/Electronic Express and delivery through FedEx without any problems.", "Date": "February 6, 2008"}, {"Title": "Had this TV six years and it's still going strong as picture is as clear as the first day I got it!!!!", "Author": "Lisamarie Benito", "ReviewID": "R3GJICPYD8FXU0", "Overall": "5.0", "Content": "I bought this TV in 2008 for $850!!! Ouch!!! But back then flat screens were expensive. Anyway, this TV is great. The quality that we've come to expect from Sony. The picture is as good as my Samsung LED 1080p TV. Just is small I may replace it with a bigger 46\" for my bedroom but it won't be because anything is wrong with the tv. Just would like a bigger picture. Great little tv.", "Date": "January 20, 2014"}, {"Title": "GORGEOUS picture!!", "Author": "Cheryl Crow", "ReviewID": "R626TX20EYIJ7", "Overall": "5.0", "Content": "This tv is worth every penny. The picture is so clear. I am glad that I was able to find it when I did. I have got great use of it. Highly recommended.", "Date": "December 12, 2012"}, {"Title": "Excellent set among the class", "Author": "Johncoruna", "ReviewID": "RPR4N2WS523WB", "Overall": "5.0", "Content": "I bought this set long time ago, october 2007, and I gotta say I'm very pleased with this tv still today.It's very difficult to go wrong with Sony.HDTV images are great for the price.", "Date": "June 14, 2009"}, {"Title": "Great TV! Found it as a bargain!!", "Author": "Iron Man \"JON\"", "ReviewID": "ROZ9DXVTXXQ1P", "Overall": "5.0", "Content": "Got this TV as a bargain from Circuit City--its an open box item. The rep said it was returned by the customer not so long ago. I was hunting for an LCD tv since I figured it was now time to upgrade to digital. Found this on the open-item section. Price was reduced to more than 35% of the brand new retail value. I was VERY interested.I quickly scanned the TV for any superficial flaws I could find i.e. nicks on the body, scratches on the screen, I didnt find any. I quickly realized I had a bargain and quickly bought it.Everything that came with the TV was still intact except for the box. Hook up wasnt that hard. This TV is just plain amazing! Everything was extremely sharp. If you have digital service with your cable provider, you will see a very sharp image on your TV, although its only a 720p.The location of the connection ports is placed just exactly where I need them. The controls were very user-friendly, not a lot of pacing to do when you get to the menu, everything was simple. Colors are sharp and solid, no washing outs here. The speaker output is quite loud and no distortion. This is one of the features that drew me to Sony. We have another HDTV at home which is a Sharp AQUOS and the sound output doesnt even compare with Sony. There are times when you just need the TV plainly without using the theater systems and the Sony delivers with just its own sound.Although an open-box item, Circuit City still offered the same return policy and manufacturer warranty. So I basically didnt lose anything except for a steep discount from its brand new price. One of the best purchases I made in my lifetime!", "Date": "December 1, 2008"}, {"Title": "Great value for price", "Author": "Nicholas Schmidt", "ReviewID": "R3AFIWTTVY69KJ", "Overall": "5.0", "Content": "I am a videophile.If I am going to pay over a thousand dollars for a TV then it better look really, really good. I've been through two other brands looking for the perfect 32\" TV, and neither looked as good, were as quiet, or functioned as well for high-def movies and video games as this KDL Sony model. I don't write reviews often but I feel compelled to share my complete and utter satisfaction. And no, I don't work for Sony... I am just a frustrated consumer that went through two other brands of LCD TVs and was wholly dissatisfied until the Sony. I was having many problems with the other sets, such as blurry picture quality, lag with video games (especially problematic with Guitar Hero), freezing issues during movies, lighting problems in the corner of the sets, and probably the most annoying of all... the low, constant buzzing sound of crummy electronic components in other brands. Good lord that drove me crazy.So, like I said, this Sony model was the third 32\" TV that I tried after unsuccessful attempts with Olevia and LG. I chose it because I experienced none of the problems that I have previously listed that were apparent in the other sets. Yes, the cost is fairly high for this set, relatively speaking. But my philosophy is that if you are going to be paying a lot to get an HDTV over an SDTV then you really owe it yourself to not skimp on the quality and make sure your purchase is going to bring you value in the long run. I have had the TV for about 7 months now and I cannot begin to describe my satisfaction over a product that works as it should and produces brilliant picture quality.There are plenty of hook ups in the back (2 HDMI and 2 component, among others). The body is sleek and minimal, though rather spartan. It's just a great buy all around. Never had an issue. Never had to worry about anything. Just a great TV.", "Date": "November 14, 2008"}, {"Title": "Sony Bravio S-Series", "Author": "David C. Howell", "ReviewID": "RNDM69RR579LB", "Overall": "5.0", "Content": "I am very pleased with this item. It came promptly and was very easy to set up.", "Date": "June 30, 2008"}, {"Title": "My Two Cents Worth", "Author": "lemontree", "ReviewID": "R21NO0NG1FAW9J", "Overall": "5.0", "Content": "I have had this Sony for 4 days now and could not be any more pleased with it,than I am.Picture quality is great.The hook up was easy. To anyone that has MSNTV2 and are looking for a new tv and want to pay the price for it than this is the one for you.", "Date": "March 24, 2008"}, {"Title": "Just what I wanted", "Author": "B. Burke", "ReviewID": "RFJVV2LZK1TKA", "Overall": "5.0", "Content": "This is a GREAT TV for the price.  I haven't had the HD installed yet, but can already see an improvement in the picture quality.  It fits perfectly in my entertainment center that I'm not yet ready to part with.  A lot of models have several inches on the sides that take up extra space unnecessarily.  This one doesn't so it suits my needs.  GREAT features also.  Couldn't be happier.", "Date": "February 18, 2008"}, {"Title": "Quality Product", "Author": "L. Myers", "ReviewID": "R13E9XRG3X1FH6", "Overall": "4.0", "Content": "I have this LCD HDTV for about two months.  It is simply a quality product.  I'm no expert but it was easy  to set up and easy to use and the picture quality is as good as it gets.", "Date": "January 20, 2008"}, {"Title": "Great set", "Author": "C. Fox", "ReviewID": "R2ESIE4A9U36LZ", "Overall": "5.0", "Content": "I replaced my bedroom 23\" Panasonic LCD with this unit.  Very glad I did.  The setup was a piece of cake, lots of options to customize the settings, and the documentation is surprisingly good. Sony makes a quality product, I will be looking to replace my living room 42\" with a 52\" Sony soon.", "Date": "January 4, 2008"}, {"Title": "Pretty Darn Good", "Author": "Jeffrey Spica \"Jeff 1953\"", "ReviewID": "R2NR0CGOXD7B4L", "Overall": "4.0", "Content": "I spent the extra money and got the Sony. It was well worth it. I was especially pleased with the setup menus. You don't have to be a techie to understand the process.", "Date": "April 8, 2008"}, {"Title": "Crisp image.", "Author": "Machina", "ReviewID": "R2Z6GZ7KCQALV5", "Overall": "4.0", "Content": "I was hesitant about getting a 720p display, but I was surprised at how much I didn't mind it.This display produces a nice crisp image. However, it isn't without faults. There is ghosting which can be seen in movies, although it hasn't been an issue playing video games. The colors aren't very accurate if you calibrate with DVE on Bluray. They are spread throughout a quarter of the color range. But if you calibrate with the original AVIA, fooling around with the wide color gamut can get you really good results.Overall, the image it produces is very nice and I enjoy watching it.", "Date": "February 25, 2008"}, {"Title": "A great TV, but Hell to set up", "Author": "Michael R. Riggs", "ReviewID": "R1SH05TI811FAN", "Overall": "5.0", "Content": "The picture on this television is sharper than any other I have ever seen on any make or model of TV. The colors are bright, never bleed, and the remote is a marvel of simplicity. I can't wait to watch my first Red Sox game on it! But listen to this: the delivery man offered to set it up for me (no charge) when it arrived from Amazon and, like a fool, I declined the offer. My old TV was still set up, waiting for a friend to come and take it away. A few days latter, my pal relieved me of the old clunker and I connected all the cables etc to my new Sony - no sweat. But when I turned the set on, it couldn't find any of the million or so channels that I get from my satellite TV vendor. I looked in the Sony manual and sure enough there was a tech support number. When I dialed the number, I thought I had gotten the local New Delhi Curry House by mistake. Not so, the pleasant, sing-songy voice on the very distant other end of the line informed me. She asked me what Model I had purchased and thus began our nearly 2 hour journey into the mysteries of the totally unintuitive and labyrinthine menu system of the Sony Bravia KDL-32S3000 32\" 720p LDH HDTV. By the end of it, she and I like all survivors of brutal combat, cared much more about each other than about India, America, or Sony. Together, we had brought my new TV into contact with DishNetWork. We still email occasionally. I am sure our friends and children find it strange that we never talk about our experiences in that inhuman struggle - but Set-up is Hell - so we change the subject when ever it comes up. Was it worth it? Damn right it was! But still, you would think that the brains that created such a wonderful TV could have worked out a simpler, more sensible way to get it to speak to a satellite.", "Date": "February 13, 2008"}, {"Title": "Sony KDL 32 S3000", "Author": "Samuel Critton", "ReviewID": "RWXGCYH5QHH6F", "Overall": "5.0", "Content": "This is close to the finest smaller LCDs on the market. Great picture and detail in HD and my only gripe would be the sound quality. I use it in my bedroom and the size is great.", "Date": "February 22, 2008"}, {"Title": "Very pleased", "Author": "R. Givens", "ReviewID": "R1WPMTXMM26O1X", "Overall": "5.0", "Content": "I am very pleased with this product.  The picture is excellent. It was easy to set up and use.  Shipping was on time.  Good value for the price.", "Date": "December 20, 2007"}, {"Title": "Excellent Deal", "Author": "Scott Cammarano", "ReviewID": "R1ENKEPW5Q3A6F", "Overall": "4.0", "Content": "Excellent Price, saved $330 compared to retail and cheaper than any other place offered by $100. Product was well packaged and received in Mint Condition. Have no regrets and very pleased with this tv's performance and features. Goes very well with my PlayStation 3 and HD DirecTv Receiver.", "Date": "April 5, 2008"}, {"Title": "disappointed", "Author": "Kevin Mcallister \"Kevin McAllister\"", "ReviewID": "RU9HZZNK54LD0", "Overall": "2.0", "Content": "I, like everyone else, expected the Sony Bravia 32\" to be flawless. However, I have to say that I am disappointed in the picture quality. Purchasing this solely for blue ray discs, I am sorry to report that there is a noticeable fuzz on the screen when playing blue rays(you can only notice this from a couple feet away;) but still . . . I expected a crystal clear picture in return for my $800 investment. I am considering purchasing a Sharp Aquos 1080p; however, it has come to my attention that there is no discernible difference between a 780p (Sony Bravia) and a 1080p in the 32\" class.That being said, I am still a tad upset. Standard dvd's do not always look good; and some look awful. Blue rays are better and vivid, but that fuzz on the screen really vexes me.", "Date": "February 18, 2008"}, {"Title": "Too many problems, bad customer support", "Author": "Igor Sukhenko", "ReviewID": "R1WNY0H3JXG4YB", "Overall": "2.0", "Content": "My new SONY KDL-323000 TV has several problems.1. Closed Captions work only with regular connection. When I connect my TV to a cable box or DVD player using HDMI or Component inputs, Closed Captions disappear. Turning it On and Off is not helping. Technical support blames my cable box, but why in this case can I see CC from the same box using the coaxial input?BTW, when I submitted technical support request online, I never got any response at all.2. Standby light is always Off. Supposed to be On.3. When I connect my laptop to the TV according to the manual I can see picture, but sound is missing. I tried different audio cables, but it did not help. Technical support could not tell me exactly what kind of audio cable to use.Too many problems for $1000 TV. I am really disappointed.", "Date": "January 29, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "HDTV with ATSC¿ Digital Tuner\nBRAVIA Engine¿ full digital video processor\n16:9 HD Resolution Panel (1366x768)\nLive Color Creation featuring WCG-CCFL backlight\n1080p Inputs - HDMI¿ (x2), YPbPr (x2), PC Input (x1)", "Name": "Sony Bravia S-Series KDL-32S3000 32-Inch 720p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41Qt7lbEdvL._SX300_.jpg", "ProductID": "B000P6R6CY"}}