{"Reviews": [{"Title": "Excellent Set", "Author": "J. Jones", "ReviewID": "R1TJC3Q2FAJW4V", "Overall": "5.0", "Content": "I have had mine since January 2006.  No problems at all.  We had planned to buy an HD Plasma, but when I saw this one I was blown away.  This set is EDTV, not HDTV.  In the store this set was on the same channel as the HD's were on.  The Signal was in HD (must point that out) and this EDTV dominated the room.  I could not see spending more money on a smaller TV with a less impressive picture. For the hose heads out there, 480p IS considered HD.  Can you recieve 480p on a standard def tv? No, you cannot.  480p displays twice the detail as 480i (standard).Pros:  ***Cost verses HD of the same size  ***Unbelieveable Picture.  Looks equal to or better than most HD sets.  Including  Sony, JVC and Mitsubishi.  ***Large, but not too imposing  ***Very easy to use remoteCons: ***Limited connections in the back  ***Somewhat hard to find instockI don't have any complaints about this product.  I would buy another just like if I had the need to do so.  Check this TV out before making a purchase.  You might find yourself pleased, and saving a ton of cash.Update****  In respones to the other review from a retired person.....  I am an engineer.  480i only displays 240 lines of resolution at one time, and shifts the other 240 lines in the next cycle.  480p displays ALL 480 lines at the same time.  That being said. 1080i displays only 540 lines at one time and shifts the other 540 in the next cycle.  the diffference between the 2 displays is a mere 60 lines of resoultion at ONE TIME and about $1000 or more.  1080p and is another story, and will show a little difference between 480p and 1080p.  A similar comparison would be between a 600mhz computer and an 800mhz computer.  The increase in performance is very slight, and hardly noticeable.  The best way to see this is to go to a store and view this set when going toe to toe with a true HD.  Bury your ego, and  you will note that the difference between the 2 formats is not worth the money.", "Date": "July 25, 2006"}, {"Title": "Great value for the money", "Author": "J. Jacques", "ReviewID": "R17L86ZG4DUE4E", "Overall": "5.0", "Content": "I did a LOT of research when looking for a TV and ended up deciding on the Panasonic TH-42PX60U (720p), when I went to the store to shop they had this EDTV version just beside it and it was very hard to tell the difference in picture, unless you were standing within 5 feet. The PD4260U was what I left with (on sale Sears for $1199!). I could not warrant spending the extra $800 for the one I had picked when I could hardly tell the difference in the picture. I have not yet used it with HDMI connection, but with HD cable service and component connections, the picture is incredible, even when downcoverted to 480p, progressive scan DVD also looks perfect, and even regular cable looks really good. Not a bad choice if you don't want to spend the extra $$$. My neighbor just bought a 40\" Samsung LCD HDTV and actually returned it and exchanged it for the same Panasonic EDTV set because he found the picture much clearer.", "Date": "October 30, 2006"}, {"Title": "480P is not HDTV but LOOKS GREAT", "Author": "whatthe... \"dogsandcats\"", "ReviewID": "R1284ZW399ZA6U", "Overall": "4.0", "Content": "this is the 9th generation of plasma screen technology for Panasonic...which scores just second to Pioneer according to leading editorial reviews...the Digital Mandate will occur in 2009...the 4 major networks are the only ones federally required to go digital...if your like me and you have DirecTV sattelitte...i know i enjoy about 100 other channels...these other channels are no time soon going to be airing anything HD programming that is 720p or 1080i...but they will be at least required to stream us 480P (progressive) which is the quality of a DVD movie that is played on a progressive scan dvd player, which only benefits if you own at least an EDTV or HDTV...bare with me because i type as fast as i think...we are talking about \"native resolution\" which means the pixels which are all squished together on the screen dont change to accomodate the tv signal so the best thing is to match the tv signal which for most all daytime programming and regular satellite or cable programming will be only 480P and thats not even until 2009 so right now its only 480i, and the best match for that signal is 480p because the only conversion is done inside the tv...if you have a HDTV set with a native resolution of 720p or 1080i or 1080p, the hdtv has to do much more processing of the origianl 480i signal to \"upconvert\" it to match the native resolution of the HDTV...the signal again as i stated earlier for all channels including daytime television is going to be at least 480P but not until 2009.**some clarification**i am giving you a overall viewpoint of video resolution standards so for the super detailed people i cant define EVERYTHING...i am trying to keep it simple...beat in mind another factor...when i say content is only 480i that means the original...only true high definition is material like Lost, CSI which by todays standards is shot with an HD camera to fully realize the potential...older stuff will just be converted at the televison studio and then streamed to us as a 480P signal...Now if your really only watching tv at night the Primetime line up on ABC, CBS, NBC, FOX and have paid extra for your High Definition packages like HBO HD, HDNET, or want to watch NFL football package in HD then...YOU HAVE TO GO TO THE REAL HD TELEVISIONS...that have a native resolution of 720P or 1080i or 1080P...in this case the Extended Definition 480P sets will fall short of excellence...and yes...I own the Panasonic 480P EDTV for my bedroom which is connected to my regular Directv Tivo which is great because watching foodnetwork or cnn or fox news only streams out 480i so i dont benefit from an HD tv set...and for the livingroom i run a Sony rear projection with the native resolution of 720P which is a High Definiton tv and yes...its professionally calibrated to my room lighting specifications...and yes...FOOTBALL ON SUNDAY IN HIGH DEFINITION IS WORTH EVERY PENNY...well there you have it...just depends on what your overall tv watching material is going to be...is it daytime regular stuff that will only max out at 480p in 2009 and most likely stay that way for another good 4-5 years because face it...its not cheap for the cable networks to upconvert all their programming...or will all your watching be...Primetime programming...like Lost, Greys Anatomy, Football HD on sundays, Desperat Houswives, CSI...all these channels benefit from an HD set...and contrary to one opinon...there is a difference...now granted any picture if the tv set is not properly tuned for a good color balance and contrast and brightness setting...anything can look average..so last thought dont ever just assume the picutre you get when you plug it in as the best picture...every set should be slightly adjusted to your likings and to your room...but thats another whole story...email me if you have any questions that you think i could handle...bye", "Date": "November 17, 2006"}, {"Title": "Great Plasma! Watch out for the description!!!", "Author": "Simon Becerra", "ReviewID": "R1KC7JLDCZYRGZ", "Overall": "4.0", "Content": "We bought this TV a month before we moved in to a new house and it just sat in the box during that time. It was killing me. When we finally set it up I was let down by the description on AMAZON. It said that there a SD CARD reader and that there were S-VIDEO inputs(1) on the front of the unit. Neither one was there. If it would not have been a huge hassle boxing it up to return I would have. Aside from that it is the best picture I have ever had. The detail and the colors are amazing. Real easy to set up out of the box and Crutchfield has great support. Great looking unit up the mantle. Would recomend it to a friend but make sure you know what you are buying before dropping the plastic. If there is the slightest doubt go buy it at an electronics store you trust.", "Date": "August 4, 2006"}, {"Title": "My SECOND Panasonic Plasma", "Author": "N. Drake", "ReviewID": "R35QONPF02SQ7I", "Overall": "5.0", "Content": "This is the second Plasma EDTV that I have purchased.  The first was in May of 2005, during which time I did extensive research on HDTV and EDTV.  I also looked at DLP's, LCD's and Projection, which none really appealed to my needs.  I narrowed my decision to the Panasonic models. I look at other brands, but cost, reviews, and instinct lead me to the Panasonics. Before purchasing, I went into Circuit City to compare the difference in picture quality between the HDTV model and the EDTV model. Now I could see a slight difference, but not enough to rule out the EDTV model. Of course there was a price difference, but my deciding factor was that the majority of TV viewing is not broadcast in HD. So I figured the HD component was not a big issue and would be seldom used. Plus, I'm sure it will be a number of years before all television channels are broadcast in HD. At that time, I will consider buying a HDTV plasma. I would also mention that I ordered an HD cable receiver from Direct TV and the HD broadcast of the HD channels looks great on this plasma.  This has been a great buy and that's why in November of 2006, I bought the same model that I had purchased in May of 2005.  I am truly pleased with the quality of the plasma and recommend it without hesitation.", "Date": "January 11, 2007"}, {"Title": "Panasonic edtv", "Author": "Terry L. Henderson \"The Terminator\"", "ReviewID": "R1C1636WTSS35I", "Overall": "5.0", "Content": "After much research, I still had some questions regarding the performance of the EDTV vs HDTV, but since my purchase of the Panasonic 42PD60U TV, I couldn't imagine the HDTV version being \"that\" much better.  This TV has an incredible picture and is very user friendly.  A great value!", "Date": "January 9, 2007"}, {"Title": "Hard to believe it's not 1080p", "Author": "Stephen Norquist \"S. Norquist\"", "ReviewID": "R343TKJTER2ZK0", "Overall": "5.0", "Content": "I have been researching TV's for the last few months and doing some serious demos of the various types of sets, DLP, LCD Plasma etc.Today I was in Tweeter comparing 1080p sets. All the sets were displaying the same satellite HDTV signal.I was studying the Samsungs, Sony Bravias and Pioneer Elites when I spotted this 42\" Panasonic. I was amazed with the picture, it was so sharp, had such high contrast with such deep blacks, natural colors and 3D depth of image.I looked closer and saw that it was a 480p plasma. I couldn't believe it. I sat there scratching my head. Here was a $999 480p set blowing away $5000 1080p LCD and plasma sets!How could this be? How can this set be so good? I still don't know but will do further research. Understand this set is not HDTV, it is EDTV with a maximum resolution of 852 x 480. However it clearly produced a better looking picture than all the 1080p sets including the Panasonic ones!Quite a miracle.", "Date": "January 26, 2007"}, {"Title": "Plasma", "Author": "Eugene H. Lowe", "ReviewID": "R3609YH59Y280X", "Overall": "4.0", "Content": "The TV is perfect and the delivery time would have been perfect if it wasn't through Global Eagle or whatever the co's name was. It took them eons to find an availbale delivery date, then I waited 4 hours and stayed home from work, then it finaly was delivered 4 hours after that. Thank goodness my roommate was home by chance.", "Date": "January 9, 2007"}, {"Title": "Best thing ever bought !!!!", "Author": "andyj", "ReviewID": "R26R7MW6S37YHP", "Overall": "5.0", "Content": "Bought it in 2006, today is 2012. Works as new, no problems whatsoever. Just now bought full HDTV LED Smart TV, and You know what , this one has better picture...So now in comparing, it made me understand how really good TV this is.", "Date": "May 16, 2012"}, {"Title": "Panasonic TH-42PD60U 42\" Plasma EDTV", "Author": "G. Ramirez \"G-Mo\"", "ReviewID": "R1DO9IQPN4BGT1", "Overall": "3.0", "Content": "I recommend this TV be used with a HD receiver to get the best out of it.  The TVs surround sound isnt that great, you can see a litle shadowing when viewing up close, but looks great from normal viewing distance.  It is very bright which is good.  The remote is great, it is pretty large with big buttons.  I also recommend connecting DVD players, HD Tuners, etc. with the HDMI connector, it reallly make the movies look and sound better.  You dont have to buy an expensive cable, I know amazon sells some for like $1.50.  Over all this TV is great for the bedrooms, but for the living room, try getting a 1080p plasma, this one is only 480p", "Date": "September 7, 2007"}, {"Title": "Great picture", "Author": "Larry L. Hoefener", "ReviewID": "R6GHI407VWGG0", "Overall": "4.0", "Content": "Outstanding picture from Dish Network. Really loved the golf pictures from Hawaii, one even looked 3-D. Great pictures using the antenna, even though some distance away.(rural area)  Love the HD shows received, even the non HD's have super color.  Find ourselves watching more of the HD sites than the non sites.  Viewed a newer LCD and it wasn't even close.  Brand of the LCD was not good(Polaroid) but still much,much better picture on the Panasonic.  Sound is very acceptable.  Not being an audiphile, I am not concerned with surround sound.  Only knock is the lapse time changing channels.  Haven't timed it, but channels do not pop up instantly.  Expect a several second delay.  If you had an older Dish Network system, you know what to expect.", "Date": "January 6, 2007"}, {"Title": "Great for movies on DVD", "Author": "T. Ross", "ReviewID": "R13P8TOROB2O2G", "Overall": "5.0", "Content": "DVDs look fantastic on this set. The blacks are extremely black and the colors are gorgeous. The 852x480 screen resolution makes the set less than ideal for HD content, but it's hard to beat for standard content. If you're going to be watching standard DVDs and TV anyway, definitely consider it.Other Pros: Excellent contrast. Solidly built. Decent speakers for casual use. Easy setup.Other Cons: Price advantage of EDTV vs. similar Panasonic HDTV plasmas has eroded. Remote lacks direct source selection buttons. Missing some of the screen saver features of Panasonic's \"corporate\" plasmas.", "Date": "November 29, 2006"}, {"Title": "Great set, but potential problem if you use both cable and antenna", "Author": "Peter B. Degroot", "ReviewID": "R16CZW4C8YVR6M", "Overall": "4.0", "Content": "This TV has a great picture rivaling many true HD sets. I agree with most of the comments in the other 4- and 5-star reviews in this regard.The only complaint I have is one which probably won't affect many other people. I have analog-only cable plus an antenna for local HD broadcasts. While the set has tuners for both cable and antenna, it's an either/or choice, and it is not easy to switch back and forth. I have an A-B switch to switch the antenna input on the set between cable and antenna. The only way to switch tuners in the set, however, is to select antenna or cable as the input, then do an automatic channel scan. Once you do this, you are locked into either the antenna set of channels or the cable set. Manually editing the channel list to include, say, the cable channels in the antenna list doesn't work, because you are still locked into the wrong tuner. So, the only way to switch from using the antenna to using the cable is to switch the source via the A-B switch, then go to Setup, select the appropriate input and do an automatic channel scan. This takes about 5 minutes. I finally ditched the A-B switch, set the TV up for antenna, ran the cable signal to my VCR, and I switch to it to watch the cable channels.If you get your cable via a cable box, there shouldn't be a problem. The cable box is the equivalent of an external tuner, like my VCR. Note that there is also not a problem with satellite dishes and external antennas. Antenna signals can be combined with the output of the satellite dish without interference by a device called a diplexer and sent to the dish's set-top-box, where they are properly sorted out again.", "Date": "November 19, 2006"}, {"Title": "Incredible Picture!  Thoroughly satisfied.", "Author": "T. Granville \"Bohemian\"", "ReviewID": "R14GZZRWB5VIZO", "Overall": "5.0", "Content": "The picture quality of this EDTV is unbelievable.  I purchased this after extensive research and in-store comparisons.  When placed next to a true HDTV with identical content, this TV looked deeper, clearer, and more vivid.  I have very discerning tastes and am not easily impressed, but I must tell you, this EDTV easily holds it's grounds with top tier HDTV's. DVD's were absolutely awesome.  I picked this because it fit right into my budget and had the picture that I desired.  I had a 42\" ESA Pasma EDTV before this one and I gotta tell you, the difference is like comparing a yugo to a 2006 porsche.  For an EDTV, this is the best available, hands down.  I would swear it was true HD.  I highly recommend this set.  This Panasonic ED is better than most other companies top HD's.", "Date": "July 25, 2006"}, {"Title": "EDTV is NOT High Definition by any standard.`", "Author": "Richard Chernicky", "ReviewID": "R3O5KJF9IYPSXY", "Overall": "1.0", "Content": "If you think 480p (EDTV) is High Definition you are VERY mistaken.  By \"DEFINITION\" the term \"High Definition\" (HDTV) refers to 1,080 scan lines of resolution.480p (progressive scanning) is the EXACT same resolution used in a Standard Television's 480i (interlaced scanning).  The difference being a full screen refresh rate of 1/60th of a second used in 480p images opposed to 1/30th of a second used in 480i images.  A negligible difference may be noted when viewing very fast action segments of a program or sporting event.If you want High Definition Television, look for a model capable of displaying 1080i or even better yet the latest available 1080p models.Retired Senior Technical Specialist (AT&T;)", "Date": "August 30, 2006"}, {"Title": "EDTV isn't HDTV by any stretch of the imagination...", "Author": "Mugwomp McGillicuddy \"rarrarjinx\"", "ReviewID": "R9P8I7N5GWGBQ", "Overall": "1.0", "Content": "If you can't see the difference, get your eyes checked. There is nothing you can do to make a non-HD signal look anything like HDTV; garbage in, garbage out. And no, turning your sharpness to 100 doesn't count as HDTV. A friend had his new HDTV hooked up wrong, using s-video from his HDTV reciever - was very excited at how great his new tv looked. I pointed out, that, no offense, that isn't HDTV. He was confused - we got some component cables, hooked it up right, and his jaw was to the floor. There is NO COMPARISON.*If you can't see the difference, see an eye doctor - you may be nearsighted. Before eye-surgery, tv was fuzzy without glasses on.*If you had to settle on ED over HD, telling yourself its \"just as good as HDTV\" is about as reasonable buying a Prius and saying its as fast as any sports car on the road; you bought it to Save Money. Be happy with your purchase but don't embrace ignorance on technology. And realize, people aren't coming by your house for football because they'd rather watch it in HDTV, its not because you do bad BBQ.", "Date": "November 13, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000F6WK5M"}}