{"Reviews": [{"Title": "Toshiba figured it out!...", "Author": "Someone said so...", "ReviewID": "R2DZN9NMVGTYWT", "Overall": "5.0", "Content": "Let's just say I have had my experiences with LCD TV's. I have a Westinghouse (which has 67+ Reviews on Crutchfield alone, a Sharp and a Samsung) With all that said, this Toshiba puts them all to shame. All the Extras hooked up: PS3, HDTV Sat, HDTV Over Air and of course SD Sat; without any doubt this TV on a whole Blows away the competition (coming from a Die Hard SONY fan) The important stuff; 3 HDMI inputs, TV Optical Out, Ability to select Direct Input when changing Video Inputs(this is important when programming Universal Remotes), A ton of Video Settings and of course it is simply Beautiful.Designed in the image of the Classic Sleek pricey Pioneer Elites or the always gorgeous hard to find LG LCD sets; it's absolutely clean on the outside in the surrounding fairly thin jet Black Bezel...The speakers are hidden, but yet they sound amazing(Adjustable settings). The Picture in SD is beyond ANY other I have seen on an LCD. In HD the set will blow you away, guaranteed! Over the Air reception of HD is spectacular; I picked up 10 channels (5 HD) I did not have before. My PS3 comes to life, especially in Game Mode; all this and I have no space to mention the PC input. The Remote is better than most TV Universal remotes, with the odd exception of it not having a direct on/off CC button(Odd!)..Toshiba has truly figured it out and has set a New Bar for all those \"other\" Manufacturers to follow. Go compare all the specs on Crutchfield! But Do not let the Amazon price fool you; Toshiba has given the best absolute quality at below average Name Brand pricing...Everyone I have shown the set to, has been in Awe!...then when they hear the price, Forget about it!", "Date": "May 2, 2007"}, {"Title": "Great Buy, Great Quality", "Author": "Chet Ragsdale \"Marine Veteran\"", "ReviewID": "R343SZVIJKDXX6", "Overall": "5.0", "Content": "I pondered for quite a while on a Panasonic plasma or this Toshiba LCD. After having seen the Panasonic in lineups at a few stores and noticing how head and heels above all the others it was, I really wanted it. But after reading reviews and pros and cons about Plasma versus LCD and all of that...I couldn't quite shake loose the price of the plasma set. I continued studying and came to this Toshiba Regza...I read some online reviews and Toshiba's own facts.I decided I would take a chance on the Regza and save 400 bucks in the process.I ordered it from Amazon.com. They shipped it via their 'white glove' delivery service. I live in Arizona and it came from Pennsylvania...intact, no problems! And Amazon covered the freight! Can't beat that.I was a little perturbed at first , because I have no HDMI connections on any other equipment I have, so had to do a little engineering to get it all connected correctly. The booklet with the set, was a little weak on hook ups. So you might need to know, or have someone who knows how, when you hook it up. Especially if you have any components. My stuff is older...as I don't or can't buy NEW equipment every six months when they change as fast as they do now. Long story short, I managed to hook everything up and got my surround sound working and DVD/VCR combo too, and cable box, (although I want to go back to DirecTV). For my local HD channels I connected the Terk antenna described here in one of my other reviews. You cannot go wrong with it for local HD or Digital channels, so check that out.Watched the Indy 500 and the Coca Cola 600 today in HD and both were excellent! Have to say the FOX HD on the Nascar race was superior! Excellent TV, Excellent picture quality and fairly easy to use controls and remote. The stand and tv build took about 5 minutes. I , for one...don't like the fact that most TV stands now , cost as much as a TV should. So, I went to Home Depot , bought some red oak for about 80 bucks and built my own stand!Overall Excellent buy and highly recommended!UPDATE: 1 YEAR LATER...still EXCELLENT and I UPGRADED! Now have HDMI DVD and HDMI receiver...sound quality and video quality even MORE improved! Only BluRay could be better and not sure how much!", "Date": "May 27, 2007"}, {"Title": "Excellent Value", "Author": "Artset Outset", "ReviewID": "R350VCZ63RW5UH", "Overall": "5.0", "Content": "First, thanks to all of you who have posted reviews. They are a tremendous help in making purchasing decisions. After receiving word from a Circuit City salesman that they make no attempt to adjust the demos on the floor, I realized that I had little else to work with. It only takes a slight difference in the brightness and/or contrast settings of side-by-side units to influence an opinion.This LCD HDTV has a great picture. I have several sources, but the over-the-air HD broadcast channels are by far the best. I cannot imagine a better picture. I did cycle through the menu and made some adjustments to the \"out of the box\" settings to optimize it. Yes, it is a 720p as opposed to a 1080p but I doubt my eyes would ever detect the difference and 1080p sources are only a future possibility for me. The color across the spectrum is close, but not perfect. Skin tones are excellent. Contrast is very good. I have watched a lot of sports and have seen no problems with response lags. I am an electrical engineer and I understand all of the specifications. I agonized over them at length. So what? Your eyes tell the story.Audio is typical. The expectation of home theater quality is unrealistic. I like the volume leveler cicuit. Loud advertisements make me crazy. I haven't tried routing the audio output to my home theater system, yet, so I don't know whether I will get \"Stable Sound\" or not.Eagle did an excellent job with delivery. It took 2 weeks from when I placed the order to receive the unit. They called in advance to schedule the delivery and called an hour before they arrived. The two guys attached the stand and waited for me to turn it on before they left. This was a courtesy offered so they could take the packaging with them. They informed me that had the unit been DOA or defective, they could not have taken it with them at that time. They also told me that they had delivered over 500 flat screen TVs of various types and had never had one that was DOA or defective. They said that many of their deliveries had been for refurb units. I guess that information would make me feel even worse if I was one of the reviewers that had experienced disaster.What could be improved?-It only has one coax input. I would like to have one for ATSC and another for NTSC. I did not find another choice that had this available.-The VGA input has a limit of 1024x768. The full native resolution would have been better. I am going to go to a video card with a DVI output in my PC using a DVI to HDMI adapter cable to overcome this limitation. I hope that works. I haven't tried an HDMI input, yet.-The station recall feature on the remote does not understand the subchannels (ex 58-1) and is useless for the over-the-air digital source. It reverts to the analog channel (ex 58.)-When you mute the sound, it defaults to CC display. This is actually a nice feature except that when I change it via the menu, it reverts back the next time I cycle power.- The remote is solid but not arranged completely the way I would have expected and I am going through a learning curve. Every manufacturer does things differently. I wish it was backlit.I hope this helps you. Circuit City had this unit for $1500 after taxes. I paid $1200 through Amazon. I like the idea of being able to return the unit \"for any reason,\" but I am too cheap to buy the peace of mind.", "Date": "May 28, 2007"}, {"Title": "Very Pleased", "Author": "Oxman", "ReviewID": "RLZJOLZ8IDV3T", "Overall": "5.0", "Content": "I have been very satisfied with this HDTV. I knew when I bought it what I really wanted was at least 46\" and 1080P-- but this model saved me a LOT of money and also domestic tranquility (there are things more important than TV). So, the way I look at this purchase is that it is my starter HDTV and in 3-5 years I'll sell it and for what I paid for this set get the set of my dreams. In the meantime I am very happy. My wife enjoys it too, all the more that it does not overwhelm the living room-- she hasn't admitted it, but I think she likes the way it looks.Having had it for a month now, I am convinced that there would be little point in getting any 42\" set with 1080P, at least if you sit back 12 or more feet as we do. I appreciate the quality of non-HD content, and of course the HD is stunning. The PC connection is welcome and the output at 1024 x 768 from our laptop is amazingly good. This set also has all the connection options we needed.Highly recommended.", "Date": "August 17, 2007"}, {"Title": "Nice Bang for Buck", "Author": "D. Cardinal", "ReviewID": "R1W7DZAJ09KESV", "Overall": "5.0", "Content": "After quite a bit of research, I decided on this model.  Its sweet, the g/f cannot stop looking at and going, \"wowwwww\".  Fairly simple to set up right out of the box.  The picture is impressive.  Good selection/layout of inputs.  Remote is okay.  Sound is solid.  All around good lcd tv.The only con with this product is that the packaging is probably not enough to sufficiently protect it.  The first one I got was damaged, but amazon/partner stood behind their product and immediately sent me another one.  Very impressed with the level of customer service.", "Date": "June 22, 2007"}, {"Title": "Very pleased", "Author": "Joshua Stone \"MOUNTAIN BIKER\"", "ReviewID": "R266I3BYHTTF5Z", "Overall": "5.0", "Content": "Toshiba REGZA 42HL67 42\" 720p LCD HDTVThanks everyone for helping me make my decision.  I always turn to amazon and cnet for reviews and I am thrilled with my recent purchase of this lcd tv.  The picture is stunning in hd and the sound is awesome.  I have not had a chance to hook up my surround sound but even without it the sound blows me away.  I purchased my hdmi cables from amazon for 12bucks each and they work great.  After comparing this tv in best buy it was just as good if not better than more expensive units.", "Date": "July 19, 2007"}, {"Title": "Great TV, Everything I Expected", "Author": "Gadget Guy", "ReviewID": "R3EDEBQLWNU5RS", "Overall": "4.0", "Content": "After months and months of research I finally went ahead and purchased the 42 inch 720p REGZA.  The reviews here at Amazon and over at AVSForum were all spot on.  This is a great TV and you will not be disappointed.One of the main factors in my decision making process was the need for good Standard Definition programing.  I knew it probably wouldn't look as good as on an older TV, but I was presently surprised by the quality.  Regular Analog channels don't look that impressive...but standard definition digital channels look great.  A little tweaking of the color settings and you'll be very satisfied with the standard definition channels.As far as the HD programming it looks perfect.  One thing I realized after looking at all the models in the showrooms is that once you get your TV home and in your living room, unless you have another one sitting right next to it, you'll be satisfied with the HD picture quality (especially after altering the picture settings).I cannot really speak to the quality of the speakers as I have my TV hooked up to a surround sound system (which I would advise).  I just bought the Pioneer HTP-2900 for $199 and it's worked perfectly.Now for the only negative in the whole review.  The only reason a 5th star wasn't awarded is that my first TV arrived damaged.  I was unable to be home for EagleGL's delivery, so I had my doorman sign for the package.  After arriving home from work I unpacked the TV.  The box was in great condition, as was the outside of the TV.  But once it was plugged in you could see the spiderweb-like crack that filled the screen.I called Amazon and they handled the return without a single issue.  A day after I filed my exchange request I received an email notifying me that the replacement had shipped.  2 days later the replacement was at the shipping hub nearby, but since I couldn't be home during delivery hours I called EagleGL to see if I could pick it up from them there.  They said of course, so I went out and picked up the TV that afternoon.  They helped me examine it for any damage before I signed for it and then loaded it into my truck.Receiving a damaged TV is definitely a huge let down, but Amazon handled the entire return with speed and class.  Every time I spoke with an Amazon rep they apologized countless times about the hassle the defective item has caused. Once again their customer service did not disappoint.Final word: this TV was an excellent purchase.  You'll be hard pressed to find a similar high quality TV for around $1100.", "Date": "September 23, 2007"}, {"Title": "Beats out all other flat-panel LCDs. Only LG comes close.", "Author": "Sri", "ReviewID": "R3LB2R8YR6LQFH", "Overall": "5.0", "Content": "I spent hours/weeks figuring out which flat panel LCD tv to buy. I spent hours in Best Buy, Sears, and other retailers looking at the TV than had the best picture quality. This TV wins and beats out the much more expensive Sony.I was working with a budget of 2000$, so if you wanna buy something better, buy the Pioneer Plasma TV for the best ever picture quality.", "Date": "July 11, 2007"}, {"Title": "Disappointed", "Author": "Regret", "ReviewID": "R3CHBVYPQ6FJDF", "Overall": "1.0", "Content": "I purchased this tv based off of the many great reviews here at Amazon. I had narrowed my decision down to two tv's, this one and the Sony Bravia (40 in). I have to say that I've been pretty disappointed so far. I had to call the Toshiba service department (who referred me to the local repair shop) to get the sound working right out of the box. Roughly a month later I started hearing the sound vibrate when there is a lot of bass. This occurs regularly now and I'm considering purchasing a speaker system to counter it. I shouldn't have to do that...I regret buying this tv and would love to return it and go with the Sony.April 5, 2008. Since posting this review I've had 4 brush off's from the Toshiba service dept. Additionally, the tv now blacks out intermittently. I'm basically stuck with it at this point as all Toshiba will say is call my local repair shop.", "Date": "February 24, 2008"}, {"Title": "Fully satisfied todate", "Author": "Lonnie G. Diedering", "ReviewID": "R2HTHKCAWO63XQ", "Overall": "5.0", "Content": "While I am of the older generation, I still enjoy a quality product. The Toshiba REGZA 42HL67 has proven, so far, to be that kind of product.  The sharpness and overall picture quality have been great.  I am a golfer and really enjoy wanting golf in HD.  I had no problems in setting it up or understandng the menu.  For info, I am on DirecTV.", "Date": "June 8, 2007"}, {"Title": "Amazing LCD for less price", "Author": "Gaurav", "ReviewID": "R2NBH95A9VR8Z6", "Overall": "4.0", "Content": "I got this TV from butterfly around 4 months back. To summarize my experience in one word...awesome. Good clear picture without any complicated controls. Easy to adjust to your personalize picture settings. 4 good picture presets already programmed in the TV for those who prefer the easy way out. Audio is pretty average though....but thats good enough for me. Seriously, you wont get a better LCD TV for such a low price.Highly recommended!!", "Date": "October 22, 2007"}, {"Title": "very satisfied", "Author": "Keith L. Anderson \"Legrande\"", "ReviewID": "R2TH7GKRWQEBUR", "Overall": "5.0", "Content": "I don't make large purchases very often, I spent a lot of time going from store to store (large retail local stores you name it I went there), I looked at all of the screens. some looked pixelated, some didn't handle red very well, and the ones I liked were out of my budget.  I started considering an on-line purchase initially for the cost. I checked reviews, and then picked the best reviewed screen within my price range, that was 42' in size.  I never got to look at this modle in a store and was very worried it would have screen trash, it arrived, I opened the box and set it up (easily) plugged in my cable and .. Hummmmmmmm I was in heaven. it didn't have 1080p but its picture surpassed some of the 1080p screens I saw that fit my price range (I.E. not the best brand)  Highly recommended.", "Date": "July 5, 2007"}, {"Title": "Toshiba Regza 42HL67 42\" LCD TV", "Author": "JT", "ReviewID": "R2KDZ8ELT4H117", "Overall": "5.0", "Content": "This is an excellent television especially for the price. Excellent picture quality from HD, SD, and DVD inputs. Good picture quality with VCR input. Color and contrast is excellent and viewing angle is also very good. This television has an attractive black cabinet with a nice gloss black bezel. Build quality appears to be quite good.Other impressive featues of this television include an easy to use on- screen menu with numerous adjustment options for picture and audio and an abundance of component video and HDMI inputs.I highly recommend purchasing a good quality HDTV cable kit to ease the pain of connecting all of the components to the TV (video games, VCR, DVD, digital cable box, etc.). I purchased a nice cable kit at a local wharehouse club for about $70 which had everying I needed to connect this TV.The TV was purchased from Amazon through their third party Beach Camera. Delivery was through Manna Freight. I had no issues with the service from any of these parties.", "Date": "January 12, 2008"}, {"Title": "I like it.", "Author": "CJL \"CJL\"", "ReviewID": "R2GDLE312PNRFS", "Overall": "5.0", "Content": "I am not technically qualified to compare this product with others, but I can attest that it provides what the novice would consider a beautiful picture.  It arrived quickly, was easy to set up, has lots of easy connections, and we love it.", "Date": "December 28, 2007"}, {"Title": "A Consumer Reports Best Buy", "Author": "Robert William Younger \"poppy\"", "ReviewID": "R96YMZUKN5OVZ", "Overall": "5.0", "Content": "Looked up the reviews at consumer reports and found this model to be rated \"best buy\" . I am very pleased with this LCD High Definition TV.plays Standard Broadcast,Digital,HD and DVD's at the top rated quality and also at best price.I highly recommend.", "Date": "November 19, 2007"}, {"Title": "Great TV, even more attractive price", "Author": "Jeff Chisholm", "ReviewID": "R2460CGDWOF3PQ", "Overall": "5.0", "Content": "Just got this from Amazon.  In spite of the fact that I used standard shipping, the TV was in my apartment less than 4 days after I purchased it.This TV replaces an older Pioneer 40\" HDTV whose lamp fried and I didn't feel like spending $350 to replace the lamp, when I could just spend $1,100 to get an entire new TV.  The leap in picture quality is extremeThe Good:The picture is extremely crisp, the screen is very bright and clear.  The setup procedure is very intuitive and easy to use.  The stand that it comes with is very sturdy and easy to connect.  The sound quality is very strong if you happen to not have this connected to a stereo.The three HDMI connectors is a huge value for anyone that has a multiple HD inputs (PS3, Xbox, DVD player, cable, satellite).The bad:While the remote control isn't difficult to figure out or anything, it's ridiculous just how many extra buttons there are on the thing.  There have to be at least 100 buttons on the thing.  Maybe even close to 200.  I would imagine that I will never touch 90% of the buttons on the remote", "Date": "November 15, 2007"}, {"Title": "Toshiba 45HL67 Review", "Author": "Jose Casillas \"Jay C\"", "ReviewID": "R2B3CYUQPSS0JR", "Overall": "5.0", "Content": "Shopping for an LCD was quite extensive and mind numbing at the same time. I'm extremely happy we went with the Toshiba.I can't stress how rich the colors are even the blacks are great. There's a feature for those of you who game that enables shorter refresh time, Xbox 360 looks great on it. The menu functions just work, very easy to use. I also love how many inputs it has.You won't be disappointed with this LCD, the price is great too.", "Date": "July 16, 2007"}, {"Title": "Great TV overall, slight annoyance with PC input...", "Author": "Derek D. Pedersen \"boxoman\"", "ReviewID": "R1F0EBV7PUPG67", "Overall": "4.0", "Content": "Till 2 days ago, I would have given this TV a 5/5. The picture is great, the price is fair, and it looks sleek.  To comparible TV's it has a good contrast ratio as well.My only problem with this TV is that it does not support widescreen display from a computer monitor (VGA port).  only 640x480, 800x600, and 1024x768.  This means, that if you plug in a computer, you are only going to get a 4:3 picture.  You can switch the tv to display the 4:3 stretched, but that is not great looking.Im going to see if i can find another cable (maybe an HDMI adapter or something?)anyway, as long as you dont need to plug in a computer monitor, this is a really great TV.", "Date": "August 30, 2007"}, {"Title": "Excellent LCD for the price, Toshiba all the way!!", "Author": "Pirate Morgan \"thepiratemorgan\"", "ReviewID": "R24ZM1N72OALQ0", "Overall": "5.0", "Content": "This is my third Toshiba TV, sold one to make room for this one and still have a 50\" Rear Projection that has NEVER given me any trouble eight years running(Knock on wood). For the money -- 42\" for $1,019 including S&H; from another web site, this is hands down ... THE LCD to get. If your looking for LCD's that is. Good picture quality with standard definition programming despite the poor standard def. signal we get from our cable company. I have seen reviewers complain about this TV's standard definition picture, but you must realize the old addage ... junk in = junk out. No TV can \"clear up\" a poor signal. Remember also that these TV's are meant to be viewed from a distance, be sure to buy size appropriate for the room as too big means a grainy looking picture. Unbelievable, but in the case of High Def. TV's ... bigger isn't always better a.k.a. size DOES matter!! This sets High Definition picture is incredible ... looks 3D. Don't worry about it being only 720P as cable providers (at least mine) are only feeding 1080i anyways and it fills this screen size nicely with excellent detail. You can count the blades of grass during PGA tournaments or watch the dust flying around each contestant during their post-performance review on American Idol(Somebody needs to dust out there in California!). If you want a High Def. set above 42\" in size, you'll want 1080p capability to reduce possible pixelization. I don't have Blue-Ray or the defunct HD-DVD to review but my 480p Progressive DVD player picture is very clean on this TV. If you buy a High Def. TV you ABSOLUTEY need a \"High Def. Set-up Disc\" such as AVIA, etc. Borrow one from a friend, maybe Netflix rents 'em, or straight up buy one with the coin you saved buying this tv. These DVD's help tune in the picture as most TV's are sent out of the factory with extreme color saturation and brightness (an attempt to stand out from the crowd in the showroom). And you ABSOLUTELY have to somehow get High Def. content running through this TV such as \"Over-the-air\" rabbit ears, HD cable box, HD satellite box, Blue-Ray player, or the now-defunct HD-DVD player. Not doing so should be listed as one of the seven deadly sins... Failure to provide a high tech., high def., flat screen LCD TV an appropriate signal!!!! PS- Always connect equipment with the highest level connector available to you. Ex- If your cable provider box has an HDMI output ... use it. You'll get the best picture that way. And don't be fooled by \"Monster Cables\" for HDMI cables (or any other cables for that matter). Unless you have a \"Theatre Rooom\" and spell and call it such ... you're an average joe or jane like me. That means go to a web reseller (mycablemart, ect.) and buy an HDMI cable for $ instead of $$$$$. A digital signal is either there or it's not, no such thing as \"signal degradation\" like an analog connection.As for \"problems\" other reviewers are having here ... 1)Yes, they're right, these speakers can't handle a lot of bass. My old analog TV couldn't either. They're simply not made for a wide range of acoustic, Not too many TV speakers are.2) Delay in start up ... read the manual people! States that is a power saving energy star feature that CAN be set off for instant power up.3)Sluggish remote ... I do have to agree with this one a little, not extreme though. And when sun is glaring toward it (Infrared Radiation) it does have a less of a remote \"field of vision\". Ehhh, I draw the blinds then and it just makes the picture look that much better ;-)", "Date": "April 1, 2008"}, {"Title": "Love it!", "Author": "embdaw \"Erin\"", "ReviewID": "RGMQ3R4XANOTD", "Overall": "5.0", "Content": "Fantastic TV...after months of researching and comparing,  I went with the 42\" Regza and am VERY pleased with my purchase!!  Dont think twice on this one... believe the reviews...it is as good as everyone says!", "Date": "October 18, 2007"}, {"Title": "Toshiba REGZA CD Television", "Author": "Leo Windy", "ReviewID": "RBY0I6MMA901E", "Overall": "5.0", "Content": "This set meets all of my needs. It displays the standart definition signalI receive with a sharp clear picture.", "Date": "August 28, 2007"}, {"Title": "My TV has Infant Death Syndrome and Toshiba says 3 months to fix", "Author": "J. Day", "ReviewID": "R2UR8VV7O8VQTD", "Overall": "3.0", "Content": "The TV itself is great. I purchased it December 2007. Everything was going great and we were enjoying it a lot until the power supply went out in the TV (March 2008). We contacted the store we purchased the TV from and they sent someone out to take a look. After confirming the power supply needed to be replaced they told us that it would be June or July before they could get the parts. The repair company and the store we purchased the TV from both said that having the customer contact Toshiba directly usually results in a better response on getting parts.We contacted Toshiba directly, they assigned a rep to our problem, and we haven't heard anything back since. Each time we call Toshiba to get an update on the parts for our TV, they tell us that the rep has all the information and will call us back. They refuse to let us speak with the rep they assigned to the case, and they refuse to let us speak with a manager at Toshiba's call center.When asked why it takes so long to get parts for a new model TV, the response from Toshiba was, \"Well, we make a lot of TVs and some of these parts come from overseas\".I have had other Toshiba products and been very happy with them, but this experience with their customer service has turned me off of purchasing Toshiba products in the future.The real kick in the pants... we even purchased the \"extended warranty\" when we bought the TV and it has done absolutely nothing for us.The TV is really nice... when it's working but for the last month or so all I've had is a big dead black square hanging over my fireplace.Something is disturbing is that before purchasing this TV I couldn't find any bad reviews of this TV (a few complaints about the \"green problem\").  After having the TV for a few months, I see that other people are having the same type of issues with their TVs and getting the same response from Toshiba's customer service department.If you are getting ready to purchase this TV, I'd wait a few more months to see if any more bad reviews pop up around the Net.", "Date": "April 14, 2008"}, {"Title": "Picture is great... audio is terrible", "Author": "R. Sirovetz", "ReviewID": "R2A1UZBY3NHX9Y", "Overall": "4.0", "Content": "I liked the price of this T.V. I was a little upset that the week after I bought it the price went down $66, but it was still a lot cheaper than the local stores. Out of the box the picture definately needs to be adjusted, but with some tweaking the picture looks about as good as my 61\" projection in the living room. The speakers on this T.V. aren't what I expected. I realize that the overall size of the unit makes it difficult to have quality speakers, but if it's turned up more than half way and there is any bass at all coming through it sounds awful.", "Date": "May 28, 2007"}, {"Title": "solid purchase", "Author": "J. Qualters", "ReviewID": "R2SPSN6W2PUN7L", "Overall": "5.0", "Content": "did much research on three technologies before I settled on this set...two \"best buy\" reviews from consumer reports sealed the deal...got a great price from Amazon at less than $1,000.00 after seeing same set in Circuit City for 1400.00...set up was easy...only complaint, if you want to call it that is that I don't think consumers are aware that not every channel they watch is going to be terrific...how the signal is sent and whether it is accomodated by 720p or 1080p is the issue...also, my research was right, at app. 10 to 12 feet 720p is plenty and 1080p is a luxury and advertising hype... stand next to a 720p and 1080p in Circuit city and I defy you to see a difference, except in price!!!service from Amazon and Wholesale AV where the set came from was excellent...received set in 2 days!!! at a shipping cost of 42.00!! Tech Direct wanted $150.00 shipping for the same TV...", "Date": "February 23, 2008"}, {"Title": "Great TV!", "Author": "Creb", "ReviewID": "RZJ6BDMGX5753", "Overall": "5.0", "Content": "After considerable research I chose the Toshiba Regza 42 inch HDTV.  I was heavily influenced by the Consumer Report \"Best Buy\" designation and the sale price ($1,100.00) I got at Circuit City.  This was slightly higher than the Amazon price, but, if I got a defective unit, I thought the return process would be easier at a local store.  I chose this unit over the comparable 1080p unit because all reviewers have indicated that there is minimal picture difference in a screen this size.The picture, even with SD input, is excellent.  Also, the sound is surprisingly clear and robust;I don't feel any need to add a stereo amplification and speaker system to improve the sound quality.  The set-up process was simple and intuitive.  I did purchase an upconverting DVD and this provides a significantly better picture than from the SD input.  I will probably wait until the fall, when broadcast programs are back and more HD channels are available, to purchase a high definition signal through my provider.All in all I am very pleased with the television and would highly recommend it to others.", "Date": "February 17, 2008"}, {"Title": "VERY happy with my new Toshiba REGZA 42\" LCD", "Author": "Philly Dawg", "ReviewID": "R2DYL2P0AVYZU8", "Overall": "5.0", "Content": "I'm no expert - this is my first HDTV, my first flat screen, my first LCD - but I'm VERY happy with my new toy, which was bought in time for my New Year's Eve party.  (It won very favorable reviews at the party as well.)Hook up was easy - I did it myself.  The picture is great.  It's easy to use.  Consumer Reports called it a Best Buy, and my experience, so far, is that they were right once again!!", "Date": "January 17, 2008"}, {"Title": "Great bang for your buck!!", "Author": "A. Anders \"cowboys fan\"", "ReviewID": "R3ARCK8UZZ38U5", "Overall": "4.0", "Content": "Excellent tv for the price. Haven't got HD thru directv yet, but I'm very happy with the picture non-HD. I would recommend getting home theater speakers with it as the speakers on the tv are good but not great. Remote control is easy to use. Overall, I'm very pleased with the tv in the short time I've had it.", "Date": "October 31, 2007"}, {"Title": "Great buy", "Author": "RD", "ReviewID": "R391YU75PYXTOO", "Overall": "5.0", "Content": "The picture and sound quality was even better than expected. This TV was rated a \"Best Buy\" in a recent issue of Consumer Reports. I would not hesitate to recommend the Toshiba 42HL67, especially at the price available through Amazon.", "Date": "October 30, 2007"}, {"Title": "Solution to connect a PC", "Author": "J.Grau", "ReviewID": "R3OPGBG0IL74BE", "Overall": "4.0", "Content": "I agree with the reviwer that found poor the RGB port to connect a PC, but let me tell you that it was the only weakness I found myself with this TV, and the solution is a HDMI to DVI cable, and it works great a full resolution using of course the DVI output of your video card.", "Date": "September 20, 2007"}, {"Title": "Awesome LCD TV", "Author": "N. Martowski", "ReviewID": "R77D260B7JZF5", "Overall": "5.0", "Content": "This is a fantastic TV for both the quality and the money. The 720 actually has a better picture than the 1080. The 1080 blows out the whites quite a bit and didn't have as good deep blacks. It comes with many high-end inputs and the look is great. I would not trade this TV for any of the more expensive ones if someone offered to swap. Frankly, the picture is undeniably sharp and I watch a lot of sports in HD. Let's just say I've really been enjoying the NBA playoffs this year. If anyone is thinking about taking the plunge into the HD world, you can not go wrong with this TV. I'd be happy to respond to any questions but if you go look at this TV and compare, I think you'll be sold.", "Date": "May 24, 2009"}, {"Title": "I love it!!!", "Author": "Valerie B \"PDX Val206\"", "ReviewID": "RIQZNYJAWCLE8", "Overall": "5.0", "Content": "What can I say???  I am thoroughly enjoying this HDTV.  I too was influenced by the Consumer Reports \"Best Buy\" tag and picked one of these up at a locally owned area retailer for $999.  Installation in my home was delayed while I decided whether to bite the cable bullet or not (I didn't), but since hooking up a $20 Radio Shack antenna have been wowed on a daily basis.  The OTA HD picture on this TV is fantastic!I've got this hooked up to VHS/DVD combo and picture there is awesome as well.  Have yet to try HDMI...Bottom line--fantastic set.  I LOVE IT!", "Date": "February 8, 2009"}, {"Title": "Just an Excellent TV, Beyond It's Price", "Author": "Evan Hochberg", "ReviewID": "R2QCK3G707S9H6", "Overall": "5.0", "Content": "This TV is absolutely terrific. It's out of box video quality doesn't really need to be adjusted beyond personal preference. Doesn't look the best in store because it's sitting next to 5000$ Samsungs, but once it's home, it's truly incredible. I never thought I'd be able to afford quality like this. Do not hesitate, put away buyers remource and get it. It can be found for $800 plus tax and shipping if you look hard. If you can't find it for less that $1400, it may be better to look at a samsung, but I still can't say enough positive things about this TV.I'm not big into sound because my apartment is small and I have to keep quiet anyway, so this is the only area where it may be lacking, but it's got so many connections for 5.1, etcc, it doesn't matter.Please, do yourself a favor. It's way more affordable than it should be. Seems like one of those too-good-to-be-true deals, but it's not.", "Date": "April 18, 2008"}, {"Title": "We love this TV", "Author": "T. T. guy", "ReviewID": "R2NT2IILNYO4KJ", "Overall": "5.0", "Content": "The price was the best we found. Consumer Reports rated the Toshiba 42HL67 highly and delivery and installation went soothly-just follow the steps on wiring from your cable company. The picture is terrific in HD and SD and the remote is not complicated. Anyway, once set, you use the cable box remote.Our only complaint are the speakers which don't seem very powerful or clear but we were planning on upgrading before we bough the TV but decided to wait to make sure whatever we bought was compatible. The set looks nice and sleek in our family room. After tons of research, this set does it for us.", "Date": "March 22, 2008"}, {"Title": "Great TV, sluggish remote interface", "Author": "Andy E. Radvany \"Rad\"", "ReviewID": "R16CKDJKCI6TF8", "Overall": "4.0", "Content": "TV rocks.  Great picture, sound, interfaces, price.Problems.Slow to power up.  On powering up if not recently used takes 5 seconds before it responds with the reassuring click that the remote worked.  This has caused a fair amount of chaos among new users trying to figure what is not working.Remote not compatible with direct TV... not a choice to set TV to...  Whose idea was that?  Still trying to figure away around this problem.Direct TV remote does not interface with TV very well.  It is sluggish and inconsistent.  Still trying to fix this.Still awesome TV.", "Date": "March 9, 2008"}, {"Title": "Great LCD TV", "Author": "SWnyc \"sw LA\"", "ReviewID": "RE5KFD7XL88P6", "Overall": "5.0", "Content": "I bought this TV through an Amazon merchant last April.  I have nothing bad to say about this TV at all.  The picture is great and the value was excellent.  I highly recommend this LCD!", "Date": "February 7, 2008"}, {"Title": "Very Good...", "Author": "vinsy \"vinsy\"", "ReviewID": "R14G7MJZEB2IKW", "Overall": "5.0", "Content": "This is a very handsome set, both on and off. HD performance is very good, I would say on par with the more expensive brands. SD is very acceptable. The set provides a lot of options to tweak the picture, including noise reduction.My piece was in perfect condition, no stuck pixels or clouding issues.", "Date": "August 2, 2007"}, {"Title": "Ordered through Tiger Direct - NEVER RECEIVED", "Author": "M. M. Sharma", "ReviewID": "R2DK0UZY82DCMK", "Overall": "1.0", "Content": "We ordered our new TV in December, and never received it. Tiger Direct shipped through Yellow Freight, who are INCREDIBLY inept. We tracked our package online, to find that it was on the loading dock, but were not contacted.  They eventually sent a postcard (their 1st communication to us) which stated that if we did not call to schedule a pickup immediately we would be charged a holding fee.  We called and set up a delivery, and had to have someone home between 9AM and 3PM. My husband took the morning off, I took the afternoon off.  At 2:45 I called to see where the delivery was, and was informed that there was no delivery scheduled.  After many phone calls, Yellow Freight eventually admitted that they had lost our shipment.We contacted Tiger Direct, and received conflicting information. One rep told us it would take 10 days to investigate, after which their only option was to send us a refund (b/c we purchased through Amazon). The other rep told us it would take 2 business days for the inquiry and then they would ship us a new TV.  But Tiger Direct never offered to take the lead in contacting us - we have to make all phone calls and follow up.At this point, a MONTH after we ordered the TV, the charge is still on our VISA but we have no TV, no resolution, and no hope in site.  We will (of course) dispute this charge with our credit card, but I strongly recommend that you NOT purchase from Tiger Direct.  (The TV, we are confident, is probably wonderful... but I now wonder if we'll ever find out.)", "Date": "January 27, 2008"}, {"Title": "Broken one.", "Author": "Sergio Valdez", "ReviewID": "R3BIOB4CC1XXNG", "Overall": "1.0", "Content": "I received this from Amazon.  They shipped it via Eagle USA, their specialty carrier.  It had the LCD broke. It even included a spyder web on top!  I've been waiting for more than a week now for Eagle to pick it up.  I also received last month two defective Panasonic 50\" Plasmas (from Amazon's warehouse_deals) and had my patience tested by Amazon.  With the last order I also got a 46\" LCD Samsung.  It worked!!!!!!  1 out of 4 TVs in good condition.  No wonder Jeff Bezos is not making any money?", "Date": "August 22, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Includes - Remote control, batteries for remote, pedestal stand, Owners Manual\n42-inch Diagonally Screen 1366 x 768 (720p) Pixel Resolution\n16 - 9 Widescreen Aspect Ratio\nWide 176-Degree Viewing Angle\nCinema Mode (3 - 2 Pulldown)", "Name": "Toshiba REGZA 42HL67 42-Inch 720p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51n3HtFcpwL._SX300_.jpg", "ProductID": "B000MY39HK"}}