{"Reviews": [{"Title": "Not perfect, but for a 1080p 46\" for less than $1100, it's almost there.", "Author": "P. Denney", "ReviewID": "RN73CFTBGZU3A", "Overall": "4.0", "Content": "I bought this a week ago, and have been thrilled with it so far.  I have only noticed 3 negatives: (1) the lamp is a bit too noisy (though I have heard this is temporary, and mine is starting to get better); (2) the viewing angle is not great -- but it is not supposed to be great on rear projection; and (3) there is a bit of pixelation (however that is spelled...) on faster, more colorful scenes.  If you can live with those once in awhile, the TV is more than worth it given the priceThe HD picture is great.  I have watched several football and basketball games, and it looks simply amazing.  It also looks great for movies, and while the black levels aren't great, they are good.  The TV's sound is quite good, too.  Am I an expert?  No.  But I've been watching HDTV for over 3 years on a 30\" TV, and this 46\" model looks simply amazing.", "Date": "December 5, 2007"}, {"Title": "Awsome!!", "Author": "T. Cannon", "ReviewID": "RY9VEQ2F2RQET", "Overall": "5.0", "Content": "WOW!!! i bought this tv 3 weeks ago and have had no problems with it. I game with this tv with my ps3 at 1080p and it is just a speachless picture. I would recomend this tv to any one who is looking for a big full hd tv for this price.  No problems at all, even pick up digital channels withought a digital cable box!!", "Date": "December 23, 2007"}, {"Title": "Best television in price range", "Author": "Michael Kent \"movie lover\"", "ReviewID": "R7GPBPI6LLAV6", "Overall": "5.0", "Content": "I have had this television for about 3 months. It used mainly for watching movies but the kids like watching cartoons on it also and even the regular cable doesn't look that bad. I own a Toshiba HD A-30 HD DVD player that is capable of sending a 1080p/24 signal which this tv is capable of displaying. The picture is perfect. I have not needed to tweak any of the settings for colors. The only settings I change are on my HD player depending on if the movie is HD or standard DVD. The viewing angle is fine. Some people freak out cause you can't see the picture if you are sitting at a 179 degree angle from the tv, but who does that? That spec is useless to use to determine how good a tv is if you are not realistically going to be viewing from that angle. All in all it is a great tv for the price. The other Bravia series which are $1000 more for the same size are not worth it in my opinion.", "Date": "January 14, 2008"}, {"Title": "Absoloutly AWESOME!  Best 1080P for the money period", "Author": "Cory D. Wilson", "ReviewID": "R4E7X5OPVQSZF", "Overall": "5.0", "Content": "I first found this TV at Fry's electronics and immediately was blown away from the sleek design, picture and price.  At that point in time it was $1200 but further research lead to finding it on here for under $1100 and even further research found if I went straight to ABT's site (the sell of the TV) the TV was $50 cheaper.  I searched flat panels, DLP's, Plasma's, and this TV came to be the best bang for the buck period.I say unless you are wanting a TV you can mount on the wall, you won't be disappointed with this thing.  The viewing angle is the best I've seen for a projection TV.  It gets a little darker when viewing it from the side, but it never seems to loose a lot of brightness at any angle.  The TV is every bit as slim if not slimmer than Samsung's Ultra Slim DLP series.  The Picture quality is hands down top notch and theres still a lot of tweaking that I need to do and I can achieve even a better picture.  I've heard about delays in gaming that make gaming systems unplayable on certain TV's, but this one is not one of those TV's.  Right now all I have is a Wii hooked up to it (hopefully a PS3 too within a month or so) and it looks and plays awesome.  Hooked up my old HTPC to it and the picture is as clear as a monitor.  Setup was very easy, as the TV uses the XMB (Xross media bar) and its designed for easy setup and instant fun straight out of the box.  Don't have money for a home theater System yet?  Well neither did I, and I can honestly say the speakers on this TV are top notch and unbelievable.  Definitely the best set of TV speakers I've ever heard!If there are any cons I can only think of one and thats that since its a rear projection TV (and not LED based) it uses a projection lamp thats rated for 8000 hours.  Now I did the math and that basically means your lamp will most likely last 3-4 years for an average person, or 333 days straight if you just leave it on all the time, but eventually your still going to have to deal with it and its an average of $200 for another lamp.  I knew that before I bought the TV so I guess in that aspect its not a con.", "Date": "May 9, 2008"}, {"Title": "Great TV", "Author": "Michael W. Lamb", "ReviewID": "R2YH4UKTUUDND8", "Overall": "5.0", "Content": "Sony is closing out their line of LCD rear projection TVs to focus on Plasma screens.  They are offering great deals on their KDF Bravia line.  I bought mine through Amazon with free shipping.  The TV itself has an excellent picture and good sound quality.  Unless you really need a thin TV to mount on the wall, this HDTV is an outstanding bargain.  Where else would you get Sony quality, a 46 inch screen, the Bravia engine, and 1080p resolution at a price like this?", "Date": "May 3, 2008"}, {"Title": "THIS TV IS AWESOME!!!", "Author": "L. Huffman", "ReviewID": "RQV77Q7RUCT54", "Overall": "5.0", "Content": "I have had this TV for a week and I absolutely love it!!  The picture is outstanding and the PS3 games are unreal!  There is absolutely nothing wrong with this TV.  Sony has quit making rear projection TV's as of February to focus on pure LCD, so get one while you can!", "Date": "February 22, 2008"}, {"Title": "Brutal Customer service and quality", "Author": "JJRomo", "ReviewID": "R3IK5V6JFT8TB8", "Overall": "1.0", "Content": "The lamp in my television failed after about 250 hours of use, when the life is supposed to be 6000-8000 hours.  The replacement costs $300, after the $1300 cost of the television a little over a year ago.The parts of this tv failed easily and the Sony service center was no help at all.  No one was willing to help me or even describe the problem to me.  There was no assurance that it was a problem other than the lamp and that the problem wont happen again.  Its possible that it will and I will have to buy a new lamp every year.  Sony's service was horrible and no help.  I would never recommend this product and would advise anybody against buying any Sony product!", "Date": "October 1, 2009"}, {"Title": "GREAT TV AND CUSTOMER SERVICE", "Author": "JAMES", "ReviewID": "R37WE8JLP50XJJ", "Overall": "5.0", "Content": "My old 27\" TV finally gave out after 14 years. I started looking at the new widescreen sets and decided on a 42-50\" screen size. I had to learn about 720,1080, HD, LCD, DLP, Plasma, rear projection. I looked at TV's for 2 months and decided on the 46\" Sony rear projection. I wanted to buy online but most online retailers had 10% of their customers unhappy with their purchase. I decided to buy from Amazon as I had a couple transactions from them I was unhappy about and they made it right with me. Their price was also low on this TV. So I ordered the TV and it was delivered by a local air freight company in 1 week. I am happy about the quick delivery and also the TV is AWSUM! For the money I spent on this 46\" Sony I would of only got a 40\" plasma set. The plasma sets may have a slightly better picture but not much. This Sony has great audio also. I would recommend this TV and also Amazon for their customer service.", "Date": "March 28, 2008"}, {"Title": "You need a sony bravia 46E3000", "Author": "C. Badrov \"Chuck\"", "ReviewID": "R11D96VQVLGOSF", "Overall": "5.0", "Content": "The sony bravia 46E3000 is a tv that you need to have.  It's 46 inches of goodness to your eyes.  The picture is great and the size of the screen is big enough for a decent size living room.  It's a rear projection tv which means it's signal from your video game console is going to be lightning fast.  It's a perfect tv for anybody.  I play video games on it, watch sports on it, and everything in between.  My friends come over to my house and watch the colts games and they can't stop staring at my tv.  It's so much fun watching knowing that i have an awesome tv and that they are jealous.  haha.  Everything from Late night with Conan O' Brien to the discovery channel looks awesome.  I've had this tv for almost two months now and haven't looked back.  This tv is 1080P capable so i am good to go for years to come and I really think I made a good decision with this tv and that you should think about it also!  Have a good day and I'm gonna go watch some tv now!  Bye!", "Date": "January 4, 2008"}, {"Title": "It's A Sony", "Author": "Shadowsurfer", "ReviewID": "R1V3QPVTEA6PEY", "Overall": "5.0", "Content": "After alot of time reserching LCDs, the best TV out there does not exsist anymore which was Sony WEGA KD-34XBR970 34 FD Trinitron Digital HDTV. More reserching uncovered that Sony will bring there rear projection line to a close just like the CRT line. Nowing this I starting reserching rear projection. Sonys 46E3000 & 50E3000 has their lastest LCD techology inside just like KD-34XBR970 did. By far it the best piture. About the lamp, after it burns out you got to replace it. Its very easy with its own siding door on the side. The lamp slides out easy and slides right back in. When the lamp burns out and you replace it -You Get A Brand New Sony TV. When a LCD burns out you junk it and buy a new one. Make sure when buying HDTV it comes with 1080i and 1080p. 1080i is the fake HD that is sent over the airwaves which is only 530 lines of res. 1080p which is 1080 line is real HD is for HD DVD & Blue Ray. When recording with the Samsung DVD-R160 1080p Upconverting DVD Recorder , record in 480 lines when the display reads that you are in 1080i mode and then when you playback it becomes 1080p. If the display reads 1080p then you can record in 1080 mode which is rare. Cablevision provides a free upgrade HD cable box. When the display is not HD the 46E3000 has 4 different display mode to choose from , a easy click on the remote. After tweeking my Sony KDF46E3000 it is by far the best choice.(Nov 21,2007)Update Today Jan 12, 2008. Just watched the Packers-Seahawk SnowGame.Totally the Best HiDef Game I've seen Thank You Sony.", "Date": "November 20, 2007"}, {"Title": "Stay away from this model!!!", "Author": "Bucket", "ReviewID": "R2R4HGTY8V4Q8Q", "Overall": "1.0", "Content": "Be wary of this Sony model.  There are major Optical Block problems and even refurbished ones fail again.  Blue blobs and green tint to the picture.  There were class action suits against Sony, covering a wide range of sets, including this one.  Don't waste your money!", "Date": "January 12, 2012"}, {"Title": "Expected Better", "Author": "K. Rutkosky \"AmmoSlinger\"", "ReviewID": "R27PV0H7Y0C98Z", "Overall": "1.0", "Content": "I'd done a little research for a 1080p bedroom TV for movies and gaming: I like CRT and DLP rear-projection pictures much more than LCD's and Plasmas - obvious drawbacks are size and weight.  This TV is a 46\" 16X9 at only 55lbs and 12\" deep:  Even so, I thought perhaps it would be too large for my master bedroom but 46\"-50\" are in the perfect range (viewing from 6' to 11' - kids always want to be close).  I came across this TV at a \"Barn Burner\" sale with great financing so I couldn't resist ($1099 + 18mos 0%).  Even though the 3000 series was newer and had no reviews, I defaulted to this because of the Sony name and the 2000 series reviews I'd read - bad mistake in my case.The TV is great overall: Resolution, inputs, sound, and most other specs.  The picture was awesome out of the box but I lowered some settings for my taste and durability.  The first week I owned it - flawless picture:  Beginning week two, problems began.I first noticed an occasional 'flicker' in color and brightness which then became very common.  Next, whites and grays developed a yellow haze embodied in part to all of the object (i.e. snow, fog, clouds).  I manually adjusted every setting possible, reset several times, and tried again.  The handbook noted nothing like this: I even tried removing the bulb to ensure seating and this made no difference.  After hours of my time, I called Sony: They wanted to begin a log and try troubleshooting from scracth - wouldn't advise if they were aware of this and I couldn't take any more troubleshooting on a 12 day-old TV.As further comparison, I used BluRay HDMI input, DVD HDMI, DVD 480p (super vid cable), DVD SD and SD cable - all had the same problems.  When I played the same material on my 4+ year-old Hitach 1080i HDTV, all were perfect.  Determiniation: (at least) this TV was a lemon.Obviously, this thing is going back.  This was my first Sony TV so not a good introduction: I can still give them slack because of the newer design and maybe an older tried-and-true model (like SXRD - their DLP) will perform well.  That or I may go with a Samsung Ultra-Slim DLP or LED DLP (newer).Better luck to others.", "Date": "October 14, 2007"}, {"Title": "16 days old", "Author": "junglalien", "ReviewID": "R3JJ8N546AT2VU", "Overall": "1.0", "Content": "Well i've had this TV 16 days and hardly ever used it. Well it just died. When I turn it on the green power led blinks for awhile and then it turns red and starts to blink. I was in the middle of updating system software on PS3. Well it says don't turn off PS3 while updating or it may ruin the PS3. What am I supposed to do now? The TV also has bad silk screen efffect. Support doesn't open until 9am. I hope they have an answer....", "Date": "November 22, 2007"}, {"Title": "Amazon credit statement not true, no 18 mos free interest", "Author": "Dannie S. Shryack \"TrueInLending\"", "ReviewID": "R3OVETXDB2BU2N", "Overall": "3.0", "Content": "I took the Amazon Visa credit card.  $30 credit plus 18 mos no interest.  Have talked to credit card at Chase-Amazon and they have me at 16.24% interest. They said the interest rate depends on your credit score.  My score is over 800 and they issued the card with $9500 limit.  I do not think the free interest statement is true.  The TV is good with a nice price.  Should not be in a sunny room and I knew this.  We watch at night with curtains closed.  Have seen this TV in my area at $1169 and $1299 plus taxes and delivery charge.", "Date": "December 26, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full HD 1080p (1920 x 1080) Picture Resolution\n3LCD Technology\nBRAVIA Engine EX full digital video processing system\n1080p Input, HDMI x2 (1080/60p, 24p)\nDMeX compatible - BRAVIA Internet Video Link Ready", "Name": "Sony Bravia KDF-46E3000 46-Inch 1080p 3LCD Rear Projection HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/412iXa4v7VL._SX300_.jpg", "ProductID": "B000SSRC2I"}}