{"Reviews": [{"Title": "great LCD!!!!", "Author": "dbern77 \"dbern77\"", "ReviewID": "R3BH4DRZ39CRWO", "Overall": "5.0", "Content": "No tv  out there can match the Toshiba for the price and quality of this unit. I went around to the various stores, CC, Best Buy, Etc. and for the 720p/1080i 37 inch lcd's , this was far the best. The color ratio is outstanding with a 12,000:1. I was thinking of going with a 1080P, but for tv under 37 inches i was repeatedly told the human eye wouldnt be a able to tell much difference. You cant go wrong with this LCD!", "Date": "April 15, 2008"}, {"Title": "Very Satisfied", "Author": "T. Case \"Gadget Hound\"", "ReviewID": "R34ZCNHNDGOMYL", "Overall": "4.0", "Content": "I recently purchased this TV from Amazon. I bought it because I wanted the largest TV that would fit into the space I had (forty inch TVs were too big, 32 inch too small, but 37, just right) and the Toshiba was within my budget. I did no comparison shopping, per se, in that I did not look at any TVs in a show room, nor have I watched any other large screen HDTV for comparison purposes. However, I read a lot about various brands and talked to work colleagues--each of whom after extensive comparison shopping and armed with a larger HDTV budget than I, purchased a Sony. (Oh, I might have paid more for a Sony, but only the 37 inch Toshiba and smaller HDTVs had Amazon Prime shipping with UPS, which seems much simpler than the white glove shipping offered on the other 37 inch TVs I considered--I notice that the Toshiba now gets the white glove treatment. Ha! Ha! Lucky break for me, I say.) Since I have a 5.1 surround sound system, I don't use the TV's built-in amp and speakers. I have an Apple TV as a source and rent iTunes HD movies (which are 720p quality). With these caveats in mind, I am quite happy with the quality of the viewing experience. The auto brightness feature coupled with a non-glossy screen somehow manages to eliminate the glare from my reading lamp that is right next to my chair and only slightly off perpendicular to the TV screen. The TV's anti-glare capability continues to impress. As for actually viewing a HD movie, we have. For example, we rented August Rush from iTunes last weekend, and, with the TV's \"movie\" option selected, the images were bright, detailed, and smooth and the colors were lifelike and not overly vivid (if you like vivid, the \"sports\" option supplies it or you can fiddle with the settings). When the first HD images appeared on screen, I made an exclamation, \"Oooo, I like it!\" and thought, \"this was worth the money!\" I'm very satisfied, but perhaps my expectations were low--my only viewing comparison is against our old 26 inch standard definition Sony. Caveat emptor?", "Date": "March 29, 2008"}, {"Title": "37\" Toshiba is an Exceptional TV", "Author": "Jesse \"DPL\"", "ReviewID": "R3REKIGI84MG1Q", "Overall": "5.0", "Content": "Purchased this TV after much research. I do mean much research.  The picture quality is excellent.  It was easy to set up and is attractive.  The sound is very good also.  I looked at many TV's side by side and this one had as good a picture as the higher priced ones and better than the tvs in the same price range.  Don't even think of getting a 1080p.  I was told by experts and I saw for myself that with this size screen you cannot see the difference, besides 1080p programs are not even broadcast yet and will be years before they are.I am so pleased I made this purchase.  There are so many to pick from but I believe I got one of the best. Another runner up was the Panasonic 37\".", "Date": "September 4, 2008"}, {"Title": "overall good", "Author": null, "ReviewID": "R2W2UZE7WQDXQG", "Overall": "4.0", "Content": "Some software problems:Remote control makes mistake occasionallyOnce, it turned on only the audio but the video was not running. I had to switch off/on the TV to get the video back.Quality:good video and audio quality. channel change over the ATSC tuner is ok. Not too fast but ok (I've seen very slow tuners).HD is very good. To be a 720p I'm impressed.A little bit heavy but the gloss frame is cool.Overall, very good HD Tv for $840 bucks !!Thanks Amazon", "Date": "June 4, 2008"}, {"Title": "great tv for the price. Amazing pic", "Author": "R. K. Williams", "ReviewID": "R2EQL7PI8WDX3O", "Overall": "5.0", "Content": "I actually was planning on getting a 1080 tv for our newly remodeled den. However, after spending so much on our renovation on the house, I decided to go \"cheap.\" Trust me, the pic is amazing. I may one day get the 1080 40 inch 120hz, but I couldn't be happier with this purchase.Oh....and in our area, the pic with an antenna is MUCH better than what we get on our cable HD channels. Go figure! (keep that in mind for football games). Regarding that, the auto channel select for Antenna works better than any tv I have ever had. Selects both the analog and digita channels.", "Date": "October 12, 2008"}, {"Title": "Poor customer service", "Author": "James M. Schmittler", "ReviewID": "R2MPORVF4IX58", "Overall": "2.0", "Content": "The first 2 months with my new tv were awesome. Great picture, great sound, lots of connections. However after just under 3 months the LCD panel went out. Luckily the warranty covers this. Unfortunately however, Toshiba's customer service sucks and its been almost 1 month since i first called them and its still not even being worked on. Do no buy this tv because if it breaks, you're screwed!!!", "Date": "August 11, 2008"}, {"Title": "Doesn't turn on consistently", "Author": "T. Boemker", "ReviewID": "R1AI6EI11VMXCQ", "Overall": "2.0", "Content": "I press the power button; the power light changes from red to green, but no audio or video.I press the power button again; the power light turns to red.I press the power button; this time I have audio, but no video.I press the power button again.I press the power button again; this time I have both audio and video.This happens almost every day, sometimes twice a day.", "Date": "November 25, 2010"}, {"Title": "Never buying Toshiba again", "Author": "Liam Grey", "ReviewID": "R3M9ERM8LHGIFX", "Overall": "2.0", "Content": "I've had this TV for over a year and I'm not happy with it.  Out of the box the picture and sound were both good, just what you would expect for the money.  After some time however you discover a particular problem.  What I've learned from tech forums since purchasing mine is that many owners of this model are experiencing the same problem.  Often when you turn the TV on after it's been off for a while you will get sound but no picture.  So you turn it off, count to three, then turn it on and hope you get a picture this time.  I usually don't have repeat this routine more than twice.  Usually, anyway.  Many people on the tech forums for Toshiba reported having to do this many times.  Worse yet they have gone through the whole song and dance routine with Toshiba's support and the long and short of it is this: Toshiba is aware of the problem, Toshiba doesn't have a solution for the problem, Toshiba doesn't care.  It would help if this TV did what a lot of others do and made a beeping sound when turned on.  It takes a few seconds for every flat screen to get the video going.  For this Toshiba that would be a particularly convenient feature since you don't know once you turn it on if you are going to get a picture at all.  But you at least don't want to second guess yourself as to whether or not you turned the thing on successfully while you wait.  Secondly when you feed video to the TV from a PC through the PC-in connector, the upper right hand corner of the screen is frequently distorted - a problem I've since been able to attribute solely to the TV and not any PC.  So now I just wonder when I'll switch this on and never get a picture again, while I wish I could go back in time and buy the Sony Bravia.  You pay more for Sony but you can seldom go wrong with one.", "Date": "February 17, 2010"}, {"Title": "Died after 18 months", "Author": "K. Carlson", "ReviewID": "R1SBYLT0MPGQ1Z", "Overall": "1.0", "Content": "It was a great TV until the screen failed 18 months after we bought it. Just a big black blob in the middle of the screen, with the picture brightening slightly toward the edges. Why do TVs have such short lifetimes these days?", "Date": "November 8, 2009"}, {"Title": "A very good TV at an excellent price", "Author": "Ronald G. Glover", "ReviewID": "R3JIPEVG0E0B0K", "Overall": "5.0", "Content": "My wife and I are extremely satisfied with out new Toshiba 37 inch HDTV.  We have it placed in our bedroom and have DirecTV's DVR playing through it.  We are extremely pleased with the bright, sharp and clear picture.  We only wish that we had found this type of LCD TV before buying the 52 inch Mitsubishi rear projection TV that we have in our living room.  It is 3 years old now and we live in dread that the $300 bulb sill burn out every time we turn it on.", "Date": "July 10, 2008"}, {"Title": "Can't go wrong", "Author": "Dino \"NMBR13\"", "ReviewID": "R3SSPVJ4MYZ0WY", "Overall": "5.0", "Content": "No complaints.  Can't beat the quality for the price.  Same price at Best Buy as it is on Amazon.  Beautiful picture and easy to use remote and menu's. Sound is hooked up to my home sound system so don't know or care what the TV speakers sound like.", "Date": "April 21, 2008"}, {"Title": "Nice TV for small price", "Author": "Merry Farmer", "ReviewID": "RGJZ3UO7X57XO", "Overall": "4.0", "Content": "I bought this tv based on size and price.  I already have a Sony LCD 1080 in another room.  This tv is better than the Sony.  The Sony's non HD stations look terrible.  The Toshiba non HD look good and the HD stations look great!  Very nice tv for the money.", "Date": "July 12, 2008"}, {"Title": "Great TV!!", "Author": "G. zambrana \"Good Day\"", "ReviewID": "RP0EJTE3H69VP", "Overall": "5.0", "Content": "Owned this tv for years, very happy with it. Toshibas have never let me down and I don't think they ever will...EVER!", "Date": "July 29, 2013"}, {"Title": "Has been an awesome TV", "Author": "joerussell1", "ReviewID": "RSGNUUSIFUV5L", "Overall": "5.0", "Content": "I bought this TV 3 or 4 years ago and it has been perfect.  I have been using it for HD tv and as a second computer monitor (since it has every connection known to man in the back.)I think I got it new for around 600 bucks... and it is the best TV I have ever owned.  Still looks as good as the day I bought it.  I love Toshiba products (have a laptop from 7 years ago that is still running like a champ) and I will continue to buy.If you are looking for a television this size and are buying a used set... this is the one to buy.  Do not buy off brands!  Very bad experiences with them.", "Date": "June 20, 2012"}, {"Title": "Toshiba should recall this TV", "Author": "parise", "ReviewID": "R2IZWRZLOCPPGH", "Overall": "1.0", "Content": "Had to turn TV off and on from start to get picture. Died in second year. Toshiba had extended the warranty on this TV due to problem and paid to fix it, only problem is they replaced the board with the same problem board. Died again after a year. Toshiba said, too bad not their problem. Toshiba only warranties the repair for three months. I wont buy Toshiba products anymore. TV should have been recalled.", "Date": "February 16, 2012"}, {"Title": "JUST A PEICE OF JUNK", "Author": "T J  From Pa \"T J\"", "ReviewID": "RYKB95LV161NZ", "Overall": "1.0", "Content": "Had this TV for over a year. It's just a mess. Just cracks real loud and goes blank then it wont let you shut it down, just sits there cracking and hissing. Have to pull the plug. Toshiba would not replace it. They'd repair it but with no loaner. This is a off and on problem so it could take a week or a month. Don't think the wife would be able to go without it for that long so we live with it. When it finally dies for good i'll go back to Panasonic. 5 years with no problems on my 50\". Just go my Blu-Ray player from Amazon and Toshiba was'nt on my list.Moral is Buyer beware of Toshiba !!!", "Date": "August 9, 2010"}, {"Title": "Never again!", "Author": "C. Peters", "ReviewID": "R25L8CNBUA2G94", "Overall": "1.0", "Content": "I've bought Toshiba for years and have never had a problem. I have a Toshiba Television in every bedroom, my den and my living room but this is the last Toshiba I'll ever buy. Pro: when it works it has a beautiful picture. Cons: It hardly ever works. I have to turn the set on and off multiple times to get it to come on and at times it just goes blank. The sound goes off for no reason and you have to turn it off and then back on for the sound to return. I looked on the net to see if anyone else had the same problem and found I was far from alone. Why Toshiba hasn't recalled this set is beyond me. Bye Bye Toshiba!", "Date": "November 18, 2009"}, {"Title": "very good for its price but ....", "Author": "F. D. lorenzo \"fdl\"", "ReviewID": "R203HP8F0A8X3B", "Overall": "3.0", "Content": "Some problem over hdmi:you must switch the tv on only after your device has been activated or you may get the fuzzy-snow-screen.It has *only* two hdmi(s).Audio is good and so is the picture.1080i format is available.It's one the best money-worth hd TV on the market.", "Date": "March 7, 2009"}, {"Title": "Customer Service???", "Author": "J. Bell \"How bout them 'eers\"", "ReviewID": "R27YB1YMBN98NI", "Overall": "1.0", "Content": "TV purchased in May.  I was pretty happy with the picture for the relatively low price of the TV.  TV has some limitations in picture quality that you would expect when you have a bargain price.  Picture went out in October. Six weeks later find out the the part for repair will not be available till March 2009.  Not a good sign! Still waiting for Toshiba to resolve the issue.", "Date": "December 4, 2008"}, {"Title": "Great T.V.", "Author": "Jeffrey S. Fenster", "ReviewID": "R37RFCLHC551SM", "Overall": "5.0", "Content": "This is the first T.V. that I have ever bought, and it is amazing.  The picture quality is superb, the only downside is it doesn't have 1080p.  But that resolution isn't even noticeable on this size tv.  I don't use the built in speakers so I don't know if they are any good.  I highly recommend this tv to just everyone.", "Date": "November 2, 2008"}, {"Title": "Never received it", "Author": "Amazon Customer", "ReviewID": "R16N10GLZMS4PZ", "Overall": "1.0", "Content": "We ordered it and waited for a few weeks and tried to contact the seller.  Unable to contact them, Amazon canceled the order.", "Date": "July 3, 2010"}, {"Title": "Nice Picture at a Good Price", "Author": "STL Cardinal Fan", "ReviewID": "R3AOQKHACLDLXH", "Overall": "4.0", "Content": "I'm happy with this purchase.  Delivery was no problem. Set up was easy.  The picture is very good.  I added a sound system to this TV and now it sounds as good as it looks.  I'd recommend this TV with no reservations.", "Date": "June 17, 2008"}, {"Title": "Skip 720p - Spend a little more for a great 40 inch 1080p", "Author": "Ben", "ReviewID": "RFBAS2A31O8J6", "Overall": "3.0", "Content": "I wanted a medium sized bedroom HDTV without paying a high price for a premium model.  After reviewing 37 inch HDTV's, I decided the Toshiba 37AV500U had great reviews and it was relatively inexpensive.  Installation and setup with standard cable went fine.  The picture was good, but not great (I am spoiled with 1080P on two other high end sets that I own).  All was well until I tried to delete unwanted channels.  The manual says you can hide channels in the setup menu.  The deleted (hidden) channels kept coming back, and worse yet unused cable channels started to appear when the channel up/down buttons were used.  I contacted Toshiba customer service and basically got nowhere.  They said there was an update for the TV that would fix the problem.  I had the local Toshiba service rep come out.  He said there was no update for this TV.  He tried in vain to delete/hide channels and gave up.  He agreed it was a defect in the TV.  I could not find a report online about this problem, so maybe it was a one off.  I returned the set and decided to try a different model.  I upgraded to the Samsung LN40A530 (a 40 inch 1080p) for about a third more than the Toshiba.  The difference in picture quality, ease of use, remote control, etc., was amazing.  Well worth the extra money.  I expect that with broadcasts going all digital in less than a year, large 720p sets will soon be dinosaurs.  My advice is to pay no attention to people who claim you cannot see any difference between 720p and 1080p at 37 to 40 inches.  It was obvious to me.  In my opinion Samsung makes a much better HDTV than Toshiba.  Comparable to, or even better than Sony, and that says a lot.", "Date": "July 21, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "37\" 720p HD LCD TV\nHigh Gloss Black Finish\nDynaLight Dynamic Backlight Control\nPC Input, 2 HDMI", "Name": "Toshiba 37AV500U 37-Inch 720p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31Z7xYQPnNL._SX300_.jpg", "ProductID": "B00140U230"}}