{"Reviews": [{"Title": "Amazing picture!", "Author": "Leby \"Leby Allen\"", "ReviewID": "R1JME7MI5YOEOX", "Overall": "5.0", "Content": "I recently purchased the Samsung 46 inch LCD (LN-S4692D). I bought this TV because I loved the style and the no glare aspect of an LCD was appealing to me. When I got it home, I was very dissapointed with the picture quality. The analog channels were unwatchable and I think buying a $3000 TV for a handful of HDTV channels is crazy. I then switched to this plasma because when I asked Best Buy associates to turn the channel to an analog channel, I was very pleased with the picture. I purchased it, took it out of the box and I didn't even have to make any changes! The difference between this plasma and my old LCD was astonishing. Almost every channel is crystal clear and the blacks are deeper than any other TV on the market (even the Pioneer). It's also brighter than the Pioneer, if that is an issue for you. If you are serious about picture quality, purchase this Panasonic. The 600U has a cooler design than the 60U and a cable card which are very important to me. The digital camera slot is pretty cool too.  So, if you are in the buying stage and still wondering if you should go LCD or plasma, here is my take:Only go LCD if you play video games, have an extremely bright room and watch TV a lot during the daylight hours, or plan on using your monitor as a computer (LCD's are immune to burn in.) If you want a clear picture with eye popping color, buy a Plasma but not a cheap one, buy this Panasonic. Good luck shopping!", "Date": "November 17, 2006"}, {"Title": "Awesome Set!!!", "Author": "AlphaGeek", "ReviewID": "R27MQAL98SQ0M5", "Overall": "5.0", "Content": "This plasma set is one of the best rated in the 42\" category by most of the plasma sites.Love the twin HDMI connectors, which I use to connect an HDMI Panasonic DVD player, only one cable is required per connection for video/audio. Cable is inpervious to EMI (Electro Magnetic Interference) and Crosstalk, since it's digital and all it does is transfer ones and zeroes :) (Note, for this reason, there is NO need to spend $60 and up for the high end cables like Monster. I've bought the $4 cables from Amazon and they work great).Unit also has a cable card slot (which I don't use), PC port, and SD card slot for watching photos on your TV.The sound is very good, unit is rated at 31 W Output Power, and has four speakers (including two woofers), very good channel separation, and sound that is very nice and crisp, which should be more than enough for anyone except an audiophile in my opinion.Colors are vivid, and the images are ultra sharp.I've only had mine for about 10 days, so I have not calibrated mine yet until it's broken in. Also, I don't have HD service through my cable provider, since Time Warner is transitioning to Comcast in our area, and they're have been out of HD converters & DVRs for weeks now - Thanks Warner Cable...)The remote control is intuitive and well laid out, with big buttons, and a size that feels just right for even smaller hands. Keys are not backlit, but that's about the only fault I could find with it.A word of advice for folks that have bought plasmas and prospective buyers, is to take the set out of \"torch\" mode (very high picture setting, intended for showing the TV in brightly lit store showrooms, which increases wear on the screen phosphors) and lower this setting as when your unit is new to minimize burn in (see Panny's instructions below). After the first 100 hours, the unit should give you around ~60,000 hours of trouble free viewing, which translates to around 20 years of 8 hours/day viewing.Keep in mind that this phenomenon is not unique to plasma technology, CRT (Cathode Ray Tube), can and do suffer from burn-in if not used properly).Here's what you need to do per Panasonic instructions (should be applied to all brands, not just Panasonic). When your plasma TV is initially installed, the first 100 hours of use is known as the \"break-in period.\" During this time, to minimize any risk of image retention, you should:  1. Make sure the plasma TV is in a viewing mode (aspect ratio) that completely fills the screen. The panel is shipped in this condition, in what is called the \"Just\" mode.  2. Turn down the Picture setting (in the Picture menu) to +0.  3. Briefly engage the 4:3 mode and confirm the side bars are set to \"Mid\", or \"Bright\". This can be adjusted in the Set Up menu.  4. Always return the display mode that fills the screen (such as Just, Zoom, Full, or H-FILL).  5. Try not to view channels with stationary backgrounds or logos for extended periods of time.  6. Avoid extended display of static images (video games, computer images, DVD title screens, etc.).After following the brake in period, you should buy a calibration DVD like Avia or Digital Video Essentials (~$40), to calibrate the unit and get the best picture possible.Mounting the unit on a wall is pretty straight forward. I've bought theEasyMount EZLCDP-02 (see my review on it, along with step-by-step install instructions), so overall I am very happy with our purchase.Pros: Awesome picture, sound, plenty of connectors, built-in HD tunner,PC port, sleek and sexy looking set, valueCons: Remote control's keys not lit", "Date": "February 23, 2007"}, {"Title": "Best 42\" Plasma on the Market  for the Money!", "Author": "G. Roberti \"Lube Man\"", "ReviewID": "ROAS3FJ3XV2DG", "Overall": "5.0", "Content": "I was on the HDTV hunt for our family room for close to a year and my issue was that we had a cabinet built some time ago for a 36\" giant tube TV, so I had size restrictions. I did my homework both online and in the stores and this is the TV we bought based on best picture for the dollar. We have this TV for about a month now...our source is Comcast HD Cable connected via Component Cables, and the picture is awesome! We also have an Oppo upconverting DVD player connected via HDMI and it too is unbelievably clear with near HD quality....plus a Sony 5 DVD player connected via Component input and that is very clear for a 480p picture.I too was going to go 42\" Samsung DLP or Sony 3 LCD (they fit) but with the off axis viewing being somewhat tricky as to get that nice clear HD picture from anywhere in the room with them, the plasma was the way to go. You can sit ANYWHERE in the family room and get a perfect picture, period!..center, left, right, standing (watching football) and even the kids laying on the floor right in front get a great picture. We had a 8yo Sony 41\" rear projection (standard definition TV that fit) and I guess you can imagine how much better this is. We also have 23\" HD LCD in the kitchen and 32\" HD LCD in our bedroom, so we are no strangers to the HD experience...but this TV is so bright and crystal clear, I can't tell put in words how fantastic the picture is. Like a lot of others, we looked at the model down, the 60U, but this model has an anti-glare screen, faster processing of the signal, MUCH better sound system, Cable Card capabilities (we don't use it), and the SD card input in the front so we can view our pictures from our digital cameras, which by the way, is a very cool feature!....and all this for around $100 to $150 more, which I think is really worth it. Plus, it has a little nicer look with the silver mixed with the black edge around the screen versus the all silver 60U model. The sound is so good, we find ourselves not using the surround sound system as much...the bass is very prominent and the voices are very clear, way better than your normal TV sound system.The onscreen interface for all the internal controls is very easy to use and if you look on some of the High Definition forums for this model on the Internet, some people have posted the settings they use to get an even better picture. We went with the Panasonic for another reason as well because it was the only model that had the controls on the FRONT of the TV for the Volume, Channel, etc....and the Auxiliary Inputs too (if I can't find the remotes, teenagers!). Most 42\" plasmas we looked at...Samsung, LG, and Hitachi had all the controls on the sides of the screen and Auxiliary Inputs on the sides behind the screen so if you want to plug in the video camera or a video game, it's a bit of a hassle, especially in our cabinet. As for playing video games and being concerned about \"burn in\" issues, this TV has an anti-burn-in technology to prevent this from happening in terms of a counter scanning line input onto the screen and a screen saver that senses the still image. The Panasonic has the best screen, 9th Generation technology, with a 60,000 hour HALF LIFE....double the other brands! Now that this TV is in the $1.400.00 price point, it's a no brainer to purchase if you are in this price range. I bought from a brick & motar store in NJ that matched J&R;'s (NY) price at the time ($1,450) but I have 3 friends that have bought from Amazon...a 56\" Samsung DLP, a Sharp 32\" LCD, and a Sony XBR 60\" rear projection LCD...each sale went flawlessly and delivery was great with all the TVs arriving in perfect condition (I installed all 3 TVs so I know). Buy this TV, you will be thrilled, and from Amazon with the utmost confidence!", "Date": "January 29, 2007"}, {"Title": "Plasma Heaven", "Author": "CBW51 \"drummer\"", "ReviewID": "R2TI8RH0Y1SKK2", "Overall": "5.0", "Content": "When you make a decision after exhaustive research and that decision is right, what a great feeling. It's been just over one week and my Panasonic TH-42PX600U 42\" Plasma is absolutely fantastic & perfect for our bedroom. We had a 37\" HD tube set but knew that I had to go flat screen to get the best picture in 1080i. While the picture is clear and crisp right out of the box, callibrating the set after the initial 100 hours is recommended.  I use the Video Essentials DVD which, when done correctly, will enhance black and white images as well as color and sharpness. I strongly suggest the standard setting for normal viewing as the vivid setting that you see in the stores will fatigue your eyes in a normally lit room. The dual HDMI is great (don't bother purchasing those expensive HDMI cables. I bought mine from Amazon for under $40 which included overnight shipping and they work perfectly). I'm glad I chose the 600U over the 60U; the surroundsound setting with 2 base-reflex subwoofers and 4 tweeters is superior to the 60U, the full black frame is better looking and I also enjoy viewing photos using the SC Card Slot.  This plasma is awesome and an incredible buy at $1,288.99 on Amazon through Vann's including shipping. It was delivered by Yellow Transport and the driver carted it into my home and allowed me to check the condition of the set before he left. Welcome to Plasma Heaven; by far the best plasma set/features for the money.", "Date": "February 27, 2007"}, {"Title": "Fantastic", "Author": "J. A. Deal", "ReviewID": "RXCHTJ63QZO8Y", "Overall": "5.0", "Content": "PANASONIC TH-42PX600U 42\" Plasma HDTV TelevisionI have had this Model for about 2 months and It is great.I stongly recommend the 600U over the 60U because of the cable card slotand the surround sound.The picture is like nothing I have ever seen before.It is so clear and crisp and true color as though you are looking at areal scene through a window.NFL Football games are in my opinion better than being there live.", "Date": "February 1, 2007"}, {"Title": "Great TV", "Author": "JT", "ReviewID": "RODNTOFU1UMZU", "Overall": "5.0", "Content": "As with other reviewers, I also researched LCD TVs before purchasing the Panasonic TH-42PX600U plasma.  I currently use cable with the cable card ($120 to purchase through cable company) due to limited satellite reception.I strongly considered purchasing a Samsung 40\" LCD or Sony 40\" LCD, but found the Panasonic Plasma better at handling faster movements (sports, action movies, etc.).  I also have a 32 inch LNS3241D Samsung LCD which is a great TV.  I recommend the Panasonic if your considering a large flat screen TV.I would highly recommend this Panasonic Plasma TV.  I would also recommend looking at the Samsung for smaller rooms.  The Panasonic Plasma beats the larger Samsung LCDs for overall sound and picture.  Great TV for the price ($1400 shipped).", "Date": "March 10, 2007"}, {"Title": "10 out of a possible 9", "Author": "Anthony R. Brown \"Broome St\"", "ReviewID": "R3NN8HK3VBTLBX", "Overall": "5.0", "Content": "Bought this TV some weeks back from Amazon (subcontractor was Vann's). The TV is absurdly good. Vivid colors, great sound, easy remote, nice looks. Service from Amazon and Vann's was terrific. May buy a second in 50\" for another room.", "Date": "April 27, 2007"}, {"Title": "great off air picture", "Author": "Mr. Fan", "ReviewID": "R3D68FMDSDQBDU", "Overall": "5.0", "Content": "I was really surprised with the off air reception.  One of the reasons I have not bought an HDTV is that the picture tends to appear less than impressive from most broadcast sources.  Imagine my surprise when, hooked up to an antenna, I get crystal clear pictures, without artifacting.  The picture off of a progressive scan dvd are excellent as well though slightly softer.  Overall, I would say that this is one of those purchases where I got a lot more than I expected.", "Date": "March 20, 2007"}, {"Title": "Excellent", "Author": "Croom Lawrence", "ReviewID": "R3E105DHC0HQ7I", "Overall": "5.0", "Content": "Very happy with the purchase of the Panasonic TH-42PX600U 42\".  I thought I would end up with the Samsung, but looked elsewhere on reports of buzzing. Two things mattered to me, high resolution picture and high quality sound - very happy with both with the Panasonic.  I would definately recommend the TV and the Amazon service was great as usual.  Enjoy..", "Date": "January 21, 2007"}, {"Title": "All I can say is - WOW!", "Author": "E. Smith", "ReviewID": "R1HRCWOFSMYPVT", "Overall": "5.0", "Content": "I have been looking for over a year for a Plasma HDTV. I had pretty much settled on the Panny because it seemed to have the most bang for the buck. Once I decided that, then the decision became whether or not to buy the monitor or the full blown consumer model, or something in between. I got my TV from Vann's and the price difference just wasn't that much, so I bought the top of the line TV with 2 HDMI inputs, 4 speakers (including 2 sub-woofers), SD card slot, CableCard, etc. etc.  The sound on this TV is quite good, not exactly surround sound, but pretty deep bass for included TV speakers. The remote is adequate, but not very intuitive IMO.  But the picture, I mean, that IS the reason we buy TV, right? Even if you don't watch much Discovery Channel, you will find yourself drawn in to the awesome displays! I can't wait to get my antenna and start picking up even more HD signals...", "Date": "March 11, 2007"}, {"Title": "Completely satisfied.", "Author": "Ryan Mcdonald \"iamabeliever\"", "ReviewID": "R1JQ4EVOBOD0ET", "Overall": "5.0", "Content": "The product was delivered on-time by a professional delivery service.  He even helped me carry it into the house.  Hook up was fairly easy - you'll need a buddy to help lift and fit into position on the stand - it's feakin' heavy.  The picture quality and sound quality are very nice.  Not one complaint.", "Date": "May 7, 2007"}, {"Title": "Provide flexibility", "Author": "OceanSpray", "ReviewID": "RL6CQM1MVLHXH", "Overall": "5.0", "Content": "I've had the television for a few months now, and it performs fine.  Picture quality is good and having the extra speakers provides an excellent option when you don't feel like powering up you home stereo amp.  Flexibility is actually the keyword here, especially regarding all the input/output options.  My experience in the past has been this type of flexibility will pay off years into the future when you're trying to piece together a configuration for a secondary setup (e.g., in a guestroom) using odd bits of equipment lying about the house.The cablecard is also a valuable and flexible option.  I'm using one and it works fine.  It allows the superior Panosonic tuner to do the tuning without the STB clutter (or you can use the STB somewhere else).", "Date": "April 30, 2007"}, {"Title": "even better than I expected", "Author": "M. Nichols \"classic tv fanatic\"", "ReviewID": "R1GHYOVS2ZB94U", "Overall": "5.0", "Content": "I have only had this tv for a little over a week and I have to say I am very pleased so far. The colors are every bit as good as my old CRT and the picture quality is superb even though my cable signal is still analog(I am working on this). I love watching everything in 16:9 instead of the old 4:3(which by the way you can select this option if you still like watching a boxy picture. I have my DVD recorder hooked up using HDMI connection and it is wonderful only having one cable for sound and picture. I also have my computer hooked up using the RGB connection and this works great. Now I can watch tv and surf the web all on one display. My only gripe is that even though this tv has picture in picture, you cannot use this fuction in the PC mode. I was very disappointed when I tried watching tv and the computer at the same time and figured out that I couldn't. I recommend getting this plasma while you still can because the new models for 2007 does not have PC connection, or TV Guide and from reviews found elsewhere the sound is not as good as it is on this model. I was blown away by the sound quality. I find that I don't need to use my home theatre as much because of the bass that this tv puts out.", "Date": "April 29, 2007"}, {"Title": "Great TV", "Author": "Perry Voorhees", "ReviewID": "R10B5ZTA7676YU", "Overall": "5.0", "Content": "At the time of purchase this TV was rated very highly in consumer digest,, (#2 I believe)worth every penny. Sound is fantastic, it actually has some base to it which is rare for TV sound", "Date": "April 18, 2007"}, {"Title": "Very very impressed", "Author": "Andre L. Aragon", "ReviewID": "RQP33M4XI6KO7", "Overall": "5.0", "Content": "When my wife and I finally decided to take the plunge for an HD television, we knew we were in for trouble since our current television was a high-end Sony WEGA.  In other words, the bar was already set high for picture quality.I did some preliminary research of plasmas, LCD's and rear projections and settled on the Panasonic.  Needless to say, since bringing the television home, we haven't been disappointed in our decision.The multitude of features and overall picture quality can't be matched for a television of this caliber.  And the nice thing, it's a television that can also grow with your needs.  From the PC input feature (I'm typing this review with my laptop hooked up to the television) to the ability to connect the multitude of devices, it's a feature loaded television with the picturea AND sound quality to match!  (It's also great looking too with the black border... something to \"add\" to your room).Highly recommend this television to anyone shopping the market!", "Date": "March 31, 2007"}, {"Title": "Fantastic Television", "Author": "R. Warila", "ReviewID": "RS2V24EDWS6AX", "Overall": "5.0", "Content": "I bought this plasma three weeks ago after many months of research.  Originally I was going to buy an LCD, but considering I watch mostly sports, I went with the plasma.  Much better picture for fast action.  NFL playoffs were unbelievable in HD. Standard def. pictures are better than most other HD TV's that I have seen. TV was well packaged and shipping was fast. I highly recommend this TV.", "Date": "January 22, 2007"}, {"Title": "still the best, 3 years later", "Author": "W. H. Robbins", "ReviewID": "R3R8XHH7RG611O", "Overall": "5.0", "Content": "We bought this Panasonic TH-42PX600U from Electronic Expo more than three years ago and it's still one of the best TVs we have seen and heard.  The only trouble with it is we want to hang out watching TV rather than doing housework - LOL!  We have been thinking about upgrading to a newer, larger model but this one still looks and sounds so good we can't justify it.", "Date": "April 5, 2010"}, {"Title": "+2 year living with the Panasonic Plasma", "Author": "Mrgold35 \"MRGold\"", "ReviewID": "R2NQVDBA8NGG6S", "Overall": "5.0", "Content": "I purchased this set over 2 years ago (for $1280 total in Feb 07) to replace my old Panasonic 32in CRT TV.  This was my 1st step into the HDTV world and I researched my plasma/LCD choices for many months before deciding on this particular model. It was hard to compare models at the department stores because none of the sets are calibrated correctly and the store lighting was too bright. It was the reviews from Amazon and CNET that convinced me to go with this Panasonic model.Pros:- Excellent range of colors (need to calibrate settings after break-in)- Deep blacks- Very good sound quality with or without home theater system, balance sound from TV speakers.- Exceptionally wide viewing angle- Excellent DVD and Blue-ray image with up-converted PS3 and Denon S-301 home theater.- +2 years of flawless operation with no hint of warranty issues- Quick start ups, fast channel changes, ease of use- Zero burn-in issues and zero temporary image retention- Attractive design- Exact same picture/sound quality with HDMI or component/audio cables (channel changes a little quicker with component cables)Cons:- Depending on signal, SD can be a little grainy and sometimes the occasional digital \"pixilation\" on HD broadcasts (Comcast fault, not Panasonic)- Glare/reflection because of smooth screen- No lazy Susan base like newer models- Still need the Panasonic remote to change inputs or aspect ratio- Heavy compared to same sized LCDI recently purchased in Feb/09 a Samsung LN-46A650 1080p 46inch LCD HDTV ($1580 with shipping) to replace the old 42\" Panasonic plasma downstairs.  I've heard and read how much the LCDs have caught up the plasma in picture quality and I decided to give the top rated Samsung a chance.  I belong to several Audio/Visual forums and I downloaded the calibration settings from other Samsung owners that had their set professionally calibrated. The only advantages the Samsung had was 4 HDMI inputs, swivel base, and a larger screen by 4 inches, after that is was all Panasonic.  The +2 year old Panasonic had a sharper HD/SD picture quality, superior sound quality, faster start up, quicker HDMI channel changes, easier to calibrate and it required less tweaking depending on SD/HD signal.  After one week, I had to return the Samsung because it just wasn't worth spending that much money for decreased image/sound quality.  I replaced the Samsung with the Panasonic 58 inch 1080p TH-58PZ800U ($2,089 + $200 5 day ground shipping) and I am extremely happy with both of my Panasonic HDTVs.Side note:  Comcast in New Mexico never told me I needed to configure my Scientific Atlanta 8300HD DVR to output 480p/720p/1080i signal for my HDTV. The default settings on the 8300HD look more like upconverted 480i/480p on the TV. Once I figure this out on my own, HD really came alive on both Panasonic HDTVs.UPDATE May/2013: I am +6 years with this TV and the picture and sound quality is still good as new.  The TV is now moved into the master bedroom and only sees about 20% of the entertainment duty compared to when it was the main TV (replaced with 58 inch Panasonic TH-58PZ800U, 5 out of 5 TV).  I still have a HD Comcast DVR connected along with a Panasonic DMP-BDT220 Blue-ray player with wireless for Netflix streaming (only two HDMI in the back of TV). The silver look design is a little out dated compared to the all black LCD/Plasma screens of today.  No regrets on this TV purchase.", "Date": "February 24, 2009"}, {"Title": "Great picture, deep blacks w/ minor flaws", "Author": "A. Agha \"Business, Web and Operational Strate...", "ReviewID": "R2SR94WDKOFJKB", "Overall": "4.0", "Content": "I love my TH-42PX600U.  It has an amazing picture and deep blacks, which is great for movies.  The picture is fantastic when watching sports in HD.  AND, amazing sound!  Only a couple of small down-sides to this:1.  Only one tuner, so to watch split-screen or picture-in-picture, you need to have an external tuner (like a VCR)2.  Takes about 5 seconds to turn on.  I think this maybe some power-saver mode.3.  Remote is a bit clunky.  Not the nicest remote in the world.  It gets the job done, but I find the round nav a bit difficult to use.Overall though, I dig it.  If faced with the option to buy again, I would.", "Date": "January 13, 2008"}, {"Title": "Great TV and really good customer service", "Author": "TribecaNY \"JA\"", "ReviewID": "R2UFHAEYHV5ZAQ", "Overall": "5.0", "Content": "Many have written about how good this TV is so I won't go into detail.  I bought it in 2007 and it is still in great working order.  I have had absolutely no problems with it. I am writing this now because this morning we had occasion to use Panasonic customer service and we were very impressed with it.  We needed assistance with setting up the system gain with peripherals after some renovations were  done in the TV room. Although the warranty had expired, for a very nominal fee, we got the assistance we needed.  It was effortless and fast, and the agent was very knowledgeable.  Thanks to her, our TV is back up and working perfectly again.", "Date": "August 17, 2013"}, {"Title": "The sound!", "Author": "N. Barreto \"Dany\"", "ReviewID": "R362DGPELR92C3", "Overall": "5.0", "Content": "The TV is great, the image is very clear, can watch your photos from the SD card easily, but the best thing is the sound!! The speaker system with 3DBBE really works and makes you enjoy your movies.", "Date": "March 8, 2007"}, {"Title": "Great, but not the best", "Author": "Rick S.", "ReviewID": "R9DD06U5YTSZL", "Overall": "4.0", "Content": "We purchased this plasma for the bedroom and the Pioneer PDP 5070HD for the family room.  The Pioneer 42\" (4270HD) was more expensive than the Panasonic, and it is unfair to compare a 42\" to a 50\".  However, while we really like the Panasonic, the Pionner is clearly superior - review on that product page as well.", "Date": "November 4, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "42 inch 720P HD Plasma TV\nDeep Blacks, Bright Whites, and up to 29 Billion Colors\nProgressive Scan\nWidescreen 16 - 9 aspect ratio\nUp to 10,000 - 1 contrast ratio", "Name": "Panasonic TH-42PX600U 42\" Plasma HDTV Television", "ImgURL": "http://ecx.images-amazon.com/images/I/512cQSBAc6L._SY300_.jpg", "ProductID": "B0019J8F6W"}}