{"Reviews": [{"Title": "Shockingly Good, but the 8000 will be the Kuro replacement", "Author": "David A. Leon", "ReviewID": "RK5W8AUXG6TO4", "Overall": "5.0", "Content": "I was a committed DLP fan before undergoing a conversion experience on Friday April 17th.  I had planned to replace my Samsung DLP with a Mitbushi DLP or LaserVue.  In the final hours, I just couldn't go through with it.A major Los Angeles vendor set up a display with the UN55B7000 sandwiched between a LaserVue and a Kuro 151.  The results were pretty plain to my eyes.  The Luxia pretty well crushed both of them.  The cult of Kuro will denounce me for heresy and blaspheme, but this is what I saw.  About 1 hour of fiddling with the settings on LaserVue did not change the situation much.  The Kuro was locked in at calibrated settings which the employees would not allow me to change.  Evidently, it was fully tuned up.  Once again, this left me with the impression that a fully calibrated Kuro is an over-rated beast indeed.  No wonder Pioneer quit the market.The bottom line:  I bought this unit the next day.  It took about 2 hours to tune up after I took it out of the box.  [Use the natural color setting.  Customize motion smoothing to 7 for jitter control and 7 for blur control, or shut it off entirely]  Since then it has been pretty astounding.  Unbelievable color.  Unbelievable reds.  Unbelievable contrast ratios.  Unbelievable black levels.  Very bright.  Generates no perceivable heat.  Does not get hot.  The detail and sharpness and depth of image is truly astounding.  I have never seen anything that can compare, and I have been shopping for several months now.ConsI am still questioning the merit of the 120Hz motion smoothing technology.  It does weird things to slow motion instant replays.  It does stranger things to 24fps movies.  Seems to work best with live actions sports and HDTV programs shot on digital.  You can always turn it off. Blu-rays seem more natural with the technology switched off. Ultimately, Blu-Ray looks magnificent either way.AdviceA word of advice for the first reviewer and everybody else.  You should never, never, never use the speakers on your HDTV.  All HDTVs are equipped with pathetic 10 watt reference speakers that stink.  All HDTV owners should invest in some sort of home theater surround sound system.  It doesn't have to be that expensive.  Even a $300 Home Theater in a Box will make a world of difference.", "Date": "April 22, 2009"}, {"Title": "Amazing TV - will not disappoint!!  UPDATED 9/23", "Author": "D. Lewin", "ReviewID": "RKMAU2CR4R1EZ", "Overall": "5.0", "Content": "UPDATED BELOW 9/23/09...I have had this TV for about 2 weeks now and could not be more pleased!  My A/V setup was in place when it arrived and all I had to do was connect the HDMI to start watching television.  I am running HD cable (HDMI), Wii (Component), Blu Ray (HDMI), and a camera (HDMI) all through the Denon AVR-1910.  Only the HDMI out from the Denon to the TV is needed as it switches and upconverts all video.So after I plugged it in, cable channels started appearing...except for 2 HD channels - just got a black screen.  I spent 45 minutes adjusting resolution ins/outs on the cable box, receiver, and TV to no avail.  Finally, I rebooted the cable box, and there they were.  Yes, I should have tried that first.  Anyway, everything has been running without issue.I must say, this picture is flat out gorgeous.  I spent a lot of time researching TV's and checking them out in the stores; LG, Sony, Sharp, Toshiba, LCD, LED, etc... but I always came back to this Samsung LED line of sets.  I had read reviews talking about \"searchlights\" in the corners, and conversely, dark spots in the corners.  The former issue I never really saw firsthand.  The dark spots though, I did notice in the stores.  It seemed more prevalent on the 8000 series, and in some cases I didn't see them at all.  When it came down to it though, I found the overall picture so stunning that the dark areas didn't affect me (it was REALLY subtle).  I was also suspicious that the sets in the stores that are constantly turned on may have something to do with it.  I am pleased to say that I don't see any artifacts on my new set.  The picture brightness is very uniform throughout.  Couldn't be happier!  If you've seen these TV's firsthand you know the thinness of the set is beyond compare.  Mine is on a stand, but on the wall it would look amazing (too bad speakers aren't this thin).As far as the picture goes, if you are pushing an HD signal to it...WOW!  The picture is so vivid, bright, and detailed some scenes truly start to look 3-dimensional.  Not sure what effect I'm really seeing but that's what it looks like.  We had friends over and the kids were watching Kung Fu Panda in HD.  All the guys were standing there behind the kids mumbling about the amazing picture.  Standard def pictures look fine as well, certainly better than my old DLP.  But make no mistake, the payoff is in the HD content.So I find myself tweaking the picture each day....2 notches lower on the color, 1 higher on the gamma, 1 more for backlight, etc... it's pretty much at the point where all channels look fabulous and I don't need to adjust anything else.  I'd say, expect to do that on any TV you get.  I tried a cnet configuration that they recommend for dark room viewing and I hated it!  Immediately switched back to my personal settings.  The great thing is that the accurate colors and different configurable settings on this TV provide the flexibility that makes it nearly impossible NOT to get a perfect picture!  BUT everyone's TV room, own eyes, and preferences are a little different.  Because there are so many setting combinations, finding the perfect configuration for you will just take a little time - don't expect to have it straight out of the box.  As far as contrast goes, awesome! In a scene of Iron Man (Blu Ray), when Tony Stark crashed his own companies party, Jeff Bridges is wearing a tux with a white scarf.  I could see the ever-so-slightest off-color herringbone pattern in the scarf next to the black jacket - and it wasn't a close up.  (Not kidding, it was kind of neat!)....so just based on that scene, I'd say the contrast and sharpness are top notch.The 120hz motion effect is great as well.  If you haven't yet, go see a demonstration in the store - you really need to see it to understand the hype.  It is definitely pretty cool, but I have added some blur and judder back into my settings because it kind of freaked my wife out a little bit.  Incredibly smooth, but definitely not how you'd see a movie in the theater.  Many scenes end up looking fake, or like you're standing there watching a play on stage.  Just know that it's completely adjustable or can be shut off entirely.  Again, your personal preference will dictate the settings.I'm also happy to say that the Denon upconverts the Wii video nicely and it pops out on the Samsung in full-screen looking great.  I imagine PS3 or XBOX games with HD output look as good as Blu Ray.  I also got the wireless adapter and hooked up to my Windows Media Center to browse pics and movies.  Works great - no issues there.The only oddity that I have seen is the fluctuating back light during dark scenes.  Other reviews point this out as well.  If a scene goes really dark, like rolling the first credits after the movie, yes, the entire screen will dim.  Switch back to a bright scene and the brightness pops back on.  When it happens it's noticeable, but it doesn't happen often.  I only see it in an extreme contrast change as described above.  In my opinion this is a small price to pay when 99.9% of the experience is breathtaking.Overall, this set delivers an incredible picture that is hard to beat.  I read a lot of professional reviews and they always find a few negative things to focus on, like \"the moiré on the fence in the 16th fight scene when the guy drops his gun was noticeable.\"  Huh?  They also say 240hz is better than 120hz.  Yes, if your name is UNIVAC and you are analyzing a test pattern.  Real people can't even sense some of these things!  I stopped paying too much attention to these after a while.  Stand in front of these sets, adjust the pictures, and you will figure out what looks good!  For me, this was it - I absolutely recommend this television!UPDATE: 9/23/09 - Fluctuating Backlight Fixed!  Just want to say that this TV still impresses me every time I watch it.  As to the fluctuating backlight issue... I found a post that explained how to go into the service menu and turn this off.  It's called CE Dimming and can be set to on or off in both Standard and Movie modes.  I turned it off in the Standard mode and it worked without issue.  You do need to go in and readjust your picture settings since it resets them, so write them down beforehand.  Otherwise, it worked fine and now I have to say the picture is 100% solid.  Here are the instructions: With the TV off, push Mute, 1, 8, 2, Power. Scroll to \"Advanced\", press 0000 - don't hit enter.  Scroll (down arrow) to CE Dimming and hit Enter.  Select Movie or Standard, and hit the left or right arrow to switch it off.  Done, hit power.  Turn on the TV like you normally would and Auto-dimming is now off!", "Date": "September 3, 2009"}, {"Title": "Beautiful television, great picture, poor sound, menus and limmitations", "Author": "Jeff Gates \"Literary Gangster\"", "ReviewID": "R2TTNSHP7KO15M", "Overall": "4.0", "Content": "Pros:1- amazing size to performance ratio. This TV is incredibly thin. You will have to see it to believe it. At just over an inch thick (not to mention 55\" from corner to corner), this television boasts some of the best stats available, compared to any other brands/models out there.2-LED back lighting. This feature is what initially caught my eye. When I first saw it I noticed immediately how incredibly deep the blacks were. This boost in depth of the color plate seems to permeate the entire color spectrum, allowing for deeper, more remarkable fullness when viewing all forms content.3- base statistics. The contrast ratio (although I have read many conflicting, reports, including the manufactures own specification information, which makes it difficult to place an exact quantitative value), 120hz, 1080p, 4 millisecond response time, USB x2 connections, LAN access, ect... They are all there. This television has the capabilities to seamlessly bind your computer or local area network and your home theater into a truly coherent \"media center\" provided you have the gumption.4- \"Xbrite\" like display. I call it this for lack of a better option. The screen itself of this LCD is not matted like many of its predecessors, it is glossy resembling a plasma TV or some of its smaller LCD PC monitor cousins, which allows it a brighter, fuller color clarity. This could be considered as \"bothersome\" by some because it allows for more apparent reflections of light, casting it back into the viewers eye, but the shear intensity of light emitted by this TV puts this claim to rest.Cons:1- Menus. After spending multiple hours removing my previous television, measuring and cutting holes in walls, fuddling with cables, and vacuuming dust bunnies and drywall dust, I found my self at the heart of my disappointment with this TV. Navigating the menu system. Don't get me wrong, it is not difficult, but it is entirely cumbersome. To start off a simple task like switching sources is made time consuming and attracts attention because you have to hit a minimum of 3 buttons on the remote to switch to your closest input. This may seem like someone complaining that you have to turn the faucet on to fill a glass of water but just play with it for a bit and you will see what I am talking about. The menus themselves are all animated and take a moment to load, which adds to the frustration when trying to navigate through them, and when you get to the input you want you have to manually exit the menu by pressing the \"enter\" or \"return\" button on the remote. This problem could have been easily alleviated by having shortcut buttons to the individual inputs on the remote, like most other manufactures offer.2-Sound.  The sound quality is greatly deteriorated by the fact that the speakers on this model face the opposite direction of the screen. Reverberation off a wall is not an adequate substitution for direct focus. The sound quality is not bad in itself, such as being  boxy, tinny or deteriorating with increased volume, it is just not as full as others that I have heard (but this is to be expected being the form factor that it is). It will be necessary to have a surround sound system  with this TV, but you probably already have one if you are seriously looking at this model.3 Limitation of inputs. For some insane reason, Samsung  preemptively decided which inputs (HDMI) you could use for which devices and placed limitations on those inputs as they saw fit. This is entirely lame and a let down. Scrolling through the menu selections on various HDMI inputs you will notice that a good majority or your picture modifications are not adjustable according to what input you have currently selected. Despite changing the labels of the inputs and reorganizing HDMI inputs, you are not able to get the full gamut of picture corrections that you payed a lot of money for. This, for me, is the biggest let down of the television. There is nothing worse than seeing a whole slue of options that are supposedly available, but are \"grayed out\" for some unknown reason. I expect, at this price and ability,  to be able to fully customize each input that the televesion has, regardless of what peripheral I am connecting to it.This con might not prevent you from purchasing this TV, but you should be at least aware of it. I have a lot of different devices connected at any given time, ie. blue ray, dvd, vhs,  xbox 360, ps3, wii, xbox, n64, psx,  snes, nes, pc, camcorder, camera, and some flash based devices, like some of the newer ipods/iphones, and it really bothers me that I cannot change the settings to what ever fits my needs best.4- Dynamic contrast. This feature seems to be a blessing and a bit of a curse. On one hand you get dark, rich colors, and on the other you get much darker whites when the majority of the screen is dark in hue. You only need to scroll through the menu system of the TV on a static, dark background to see this flaw in action. How dynamic contrast works is that it lowers the backlighting of the television when it senses most of what it is displaying is dark, which makes any contrast in hues, i.e. whites to blacks, much darker than they would normally be.  This may not be a deal breaker for some, but depending on what you watch, there is a noticeable difference. I personally like to watch a lot of the space/nasa documentaries, and when they show Hubble images of deep space that are for the most part black, with just a few pin points of light, you notice that that you are loosing quality/brightness of image (as compared to other flat panels without this dynamic contrast perk).5- Lack of inputs. This downfall is the price you pay for having such a small form factor I guess. 4 HDMI is ok, minus them all being individually limited, but there is only one component in, no composite/S video in at all and the stereo out is a 3.5mm jack so you need an adapter, which is not included. The TV does have optical audio out, so if you have a somewhat capable/newer surround sound system you will be ok, provided you spend the money and buy the expensive cabling to connect it (heaven forbid that your receiver is more than a few feet away or else you are going to feel it in your wallet). Another problem that all of these digital connections bring, that is rarely advertised, is that there is a lot more optimization involved to make them work normally. Say \"good by\" to just plugging things in and having them work. If you don't have a lot of patients for reading user manuals or trial and error, it might be necessary to pay the extra cost for having some \"Geek\" come to your house and make everything work properly for you.Another slight annoyance is that this TV does not offer any sort of video out. A slight inconvenience really, but I would like to keep my options open.6- 120 hz it more like \"beauty is in the eye of the beholder\". Some people like its effects on movies/games, I personally have turn it off to make the TV look normal to me. You really need to evaluate the feature for your self and make a decision. For me, it looks like it increases the frame rate at times and slows it down in others, which gives the overall viewing quality a \"hurky-jerky\" feel. Others that have seen the feature on my TV say it gives it more of a 3D quality or that it is more like looking out a window, as apposed to viewing a TV. Its effect is much more noticeable while viewing certain media such as , blue ray, DVD's or video games. I can barely notice it while watching HD/SD content from Comcast (1080i/480p respectively).7-\"Media Center\" short comings. What, no youtube? Even my phone has that. I would also like to see WMC connectivity, a flash enabled web browser, and come to think of it, bluetooth, so you can connect a qwarty keyboard to actually take advantage of it all.  This would truly bump this TV into an upper eschelon, rivaled by no other device to date.SummaryAll in all, I think this TV is feature rich with a few let downs that could be corrected with a bit of ingenuity (hopefully made possible in the way of firmware upgrades, putting the LAN feature to good use). I would not personally recommend this TV to any of may friends because I would not want to hear them complain, but I would tell them to come over, play with it and decide for themselves if it is the right choice for them. Knowing what I know now it would be hard to say if I would upgrade again from what I had previously (LG 50px4dr) to this TV, but I can truthfully say that the picture quality on most devices (cable, xbox 360 and others (NOT PLAYSTATION 3, I get a weird snowy pixelated effect on the home screen that drives me crazy and was the reason I bought a new TV in the first place)) is vastly superior to most other televisions that I have seen. The bottom line is that you need to play with this television for a bit before you purchase.", "Date": "April 7, 2009"}, {"Title": "Samsung LED 7100", "Author": "Pickelw", "ReviewID": "R2GKVJ0BIZ4K93", "Overall": "5.0", "Content": "Wow! Do you want the best picture available today. Look at the Samsung 7000 series LED TV.I have had this for a week now and am very, very pleased with the set. I have the 7100 series from Best Buy. This is a special model only sold through Best Buy. It is the same as the 7000 except for some cute little add ons. One being the ability to scroll through a series of museum paintings. This allows you to use the set as a picture viewer/screen saver and when used with your audio system makes a nice back drop for a party or something of that sort.  You can not add pictures. It also allows you to go to the internet and use Yahoo widgets and about five other widgets. There are also a couple of games built in.  Will most people use these features? Probably not!The other feature is the Touch Of Color which I really do not care for anyway. The 7000 is generally $300 cheaper than the 7100 so you chose.The 7100 series is on sale the week of Apr 28, 2009 for $3,100. This is a $600 price drop. This is the same thing that happened to the Sony 240 hz set. In January 2009 it was $3,900 and is down to $2,800.  If you want to wait, it will drop more but that is technology.My wife usually does not say anything about the TVs we have except if she can not get the remote to turn everything on. She and my son were watching James Bond - Quantum of Solace on bluray. She told me that it was like sitting in the director's chair on the set. The quality of the bluray screen is so clear that it takes on a 3D appearance. The colors are true, the whites are white and the blacks are black. There is no bleeding or blurring of motion.  The dark scenes are just as life like as the light scenes.If I spend this much on a TV, then I will also have a good sound system so the built-in speakers are not a problem. The TV remotes are not that useful. The small round remote is useless. Again, I have the set connected to an amp, a cable box, a bluray player and an old VHS player. I use a programable remote so I do not use the Samsung remote.The thinness of the set makes the set shrink from the viewer. I mean my old 56' cabinet was two feet deep. This set is 1 and 1/4 inches deep. It hugs the wall so well that it does not dominate the room even though it is 55\".  The most important part is that there is little to no heat generated by this set. It uses 40% less power than an LCD of the same size. This should help the set last longer and save power on AC and set top use as well.When using this set to compare pictures make sure that you look at about a dozen different high definition stations. The high definition stations are not all the same! HDNet1, HDNet2, The Science Channel, and ABC in my area are tremendous with the quality in the order shown above. The worst are CBS, PBS, and TBS. There is a big difference in video and audio quality of these stations. Again, look at several stations your area may be totally different.I had planned to purchase the Sony 240hz TV. I am so glad that I did not. The matte finish on the Sony does little to cut down glare but really, really mutes the picture. The colors and picture on the Sony are also muted by the matte finish.The picture on the Samsung LED is like looking through a really, really clean window. In other words - awesome!Pro: Picture quality.Con: Price.", "Date": "April 29, 2009"}, {"Title": "OMG!", "Author": "Robert J. Kierski", "ReviewID": "R2RO9U8AB1XW21", "Overall": "5.0", "Content": "First, let me say, this is not my first big screen HDTV.  In fact, this is replacing a 62 inch DLP.  So I wasn't expecting to be WOW'd by this TV...  but I was.  I don't have a way to compare the DLP and LCD side by side -- the DLP is dead.  But I don't recall the DLP's image being as clear and vivid as this image.  The DLP was able to display 1080i/720p which is about as good as you're going to get from digital broadcasts.  But even on DVD's with lower resolution, the image appears more life-like.There were a number of other expectations I had.  Some of them were met, some where not, some were exceeded.  I will go into details of each.1)  Setup:  I was expecting to have to assemble something.  But the unit was shipped in a fairly large box fully assembled.  I suppose if you intended to mount yours on the wall, you'd have to disassemble the stand.  As for me, I intended to have it sitting on it's stand.2)  Swivel base:  I didn't expect the base would allow it to swivel side to side.  Because the TV is so thin and I've put it in a place that used to be occupied by a 17 inch thick DLP, there is plenty of room for the TV to swivel so you can sit on one side of the room or the other and still be in the sweet-spot.  That's probably not a big deal for those who are buying the TV for it's 1.6inch depth.3)  Connections:  I was disappointed in several ways.  The information on Amazon indicated this TV has 2 RF inputs. It has only 1.  My DLP had 2 RF inputs so I could connect my cable to one, and antenna to the other.  In my area, with a moderate size antenna, I can pick up about 50 HD channels Out-of-the-Air.  My cable company rebroadcasts only about 15 of those digital signals, and periodically changes what channel they're on.In an attempt to make the TV very thin, it appears they've given very little room for high quality connectors.  I had to remove the boot from my CAT6 (network) cable.  I had to shave one side of the boot of my RG6 (RF) cable.  Without these modifications, I couldn't use those cables.In an era of HighSpeed internet, I would have expected the network connection to be a GigE, but it appears to only be 100BT.  While 100BT is theoretically enough to stream even the highest resolution media to the TV, my media servers, media receivers,  and PC all have GigE.  When I switched to a GigE switch, I noticed considerable difference in viewing experience.  A GigE chipset would have probably added only about $30 to the price of the TV -- not a big deal.I was however very impressed with this TV's ability to be a monitor my my laptop.  I plugged it into the VGA connection and was surprised to get full 1920x1080 resolution.4)  Yahoo Widgets:  It's certainly a neat idea to be able to see certain information on the screen, but the widgets that are available are unimpressive.  You can get most of that information on your Cell phone, without interfering with your TV watching experience.For about 3 years, I've looked for a way to watch YouTube videos on my HDTV.  The YouTube  widget leaves a lot to be desired.  As far as I can tell.... there is no way to associate the widget with your YouTube account so you can't subscribe to channels, mark favorites, set up play lists, or view your history.  The image quality seems to be better than I expected and it appears that it selects the HQ feed when available.  Even attempting to search is rather difficult because the on screen keyboard is the worst I've ever used.  The keyboard doesn't wrap side-to-side or top-to-bottom.  If you're on the key in the top right, and the next key is in the bottom left, you have to move across a million keys to get to the one you need.  In it's current state, the YouTube widget is worthless.5)  DLNA:  Very disappointing.  I have 3 media servers that have different implementations of the DLNA (non)standard.  The media receives I've used that interact with the DLNA servers have a variety of flaws, but this TV is probably the worst of them.  It's slow bringing up the lists of available content, and tends to refuse to play simple content, or doesn't play them correctly.  I was hoping to replace the media receiver attached to my DLP, but I'm not able to because it has faster, better support for the DLNA server, as well as supporting SMB.  If the TV can't do DLNA well, maybe Samsung should think about supporting SMB instead (this TV doesn't).6) AnyNet+:  This works a lot better than I expected.  I bought a Samsung BD player with this TV.  There are a couple of things I can't do with the BD player except with it's remote, but for the most part, it's a seamless experience.  It would be nice to have a BD button on the remote -- there's a TV button.7) Image:  Based on reviews I'd read elsewhere and here, I was expecting to have issues with various aspects of the picture.  I haven't had any of the \"spot light\" or \"dark corner\" problems that people have reported.  This TV has incredible darks, brights, and colors.  If you get a chance to watch Survivor on this TV.... Do it!  Some of the scenes are breathtaking.I have noticed however, that the picture looks \"too good.\"  The high contrast, clear detail, and motion smoothing tend to make the picture too good.  It's a little disturbing.  I've had to adjust some of the picture settings to add a little imperfection.8) Glare:  I was expecting to see considerable reflection on the high gloss screen.  With the DLP, during dark scenes, I could see my reflection staring back at me.  With this screen, I don't see that reflection.  In fact, I don't see any reflection.  I haven't figured out why that would be -- it's a high gloss screen.9) USB media player:  I'm impressed that this TV is able to play so many formats.  I have media in some odd formats that I've had difficulty playing -- even in Windows Media Player.  This TV is able to play them.  I'm dissapointed though that it's not able to play VOB files from the USB.  It will play them with the DLNA player, so I would think it should pay them from a USB stick.  But it doesn't.I compared this TV with the 8000, and 8500 in the same size.  When the TV's are sitting side-by-side, you're 5 feet away, and looking for specific differences, you can see those differences clear as day.  When you look at each TV by them self, or if you're actually watching a move or show, it's hard to pick up those flaws/differences.  Even watching the same feed with them side-by-side, I couldn't justify spending the hunderds of $$ more for the minor improvements of the 8000 or 8500.Reading back, my review sounds very negative.  But I'm very happy with this TV.  It's much better than the DLP it's replacing both in picture quality and features.", "Date": "November 6, 2009"}, {"Title": "THE 7000 BEAT MY 650 PLASMA AND MY FRIEND'S KURO", "Author": "PhillyBill \"PhillyBill\"", "ReviewID": "R10FCRS1ZTQMP6", "Overall": "5.0", "Content": "Update on March 8, 2010:Just wanted everyone to know that over Olympics weekend, we had a guest who considers himself THE world judge of HDTV (you each know of someone like this....quote facts and figures all day...), and he owns a Pioneer KURO Plasma. According to him, it is the Gold Standard of big HDTV.Well - there he was, sitting in our living room, totally silent as he watched the Olympics on our 7000 series HDTV. After a few minutes, he spoke up and told my wife and I that the picture was as good or better than his 'sacred' KURO! (I could tell he was sort of hissing out the words...)He also noted that our 7000 looked better in the daytime (this was on a Saturday afternoon in our living room with large windows on one side). Out of respect, I did not bring up the much bigger heat and power consumption of his KURO, to spare his feelings.....Same guy called me this past weekend to ask more about it, and that he was out looking at buying one! Not that I was gloating or anything........I of course just had to post this great compliment from a KURO owner to you all!No question this is the best TV investment we have ever made.Oh, our setup rocks the house: Comcast HD box into a Yamaha RXV765 receiver with 5 channel surround with ORB Audio MOD2 speakers and their 10\" UberSub (killer combo-better than big theater sound, and Samsung BluRay player. We mounted the TV on the wall with hidden cables above a low boy where we store the equipment and DVD collection.KURO? No - KUDO's - to Samsung for a job very well done.Many folks still wonder about the newer LED/LCD vs. Plasma.I was one of them. After months of research, I picked the 58\" B650 Plasma.It is always tough to audition in a store, but we felt it beat out the big LCD's.Well - read on.Had it 3 weeks, waiting for it to 'break in', which it did (the phosphors have to age and become uniform - took about 50 hours of viewing to achieve.)Was able over time to get a great pic (in dynamic mode), but it never quitelooked as great as our Samsung 40\" B630 upstairs.Then I measured the power consumption after we noticed the heat coming off the screen. Uh - 550W average, with peaks up to 700W in certain brght movie scenes!My wife and I play the set quite a bit, and some quick math told us the heat and cost was just too much a price to pay for something that will hang on the wall for years to come.  Back to the stores for more auditioning.After another few weeks of looking we bought the 55\" UN55B7000 LED/LCD.Almost the same size - but 1/4 the power after reading up on it.Out of the box, this set looked as good or better than the plasma.Black levels as good - color balance even better - My test BluRay that has a number of tough to get right grey/black scenes is Terminator Salvation. Looked better on the 7000.I use that, and UP, which really tests the color saturation.And this is in the default movie mode, which comes up when I use my Samsung BluRay player.With minimal tweaking in Standard Mode, I got it looking even better.No heat. Long term cost way down over the plasma.SUMMARY - I was able to own both in my own home and do my own tweaking and comparing, and all things considered - The LED/LCD 7000 beat out the 58B650 plasma.Hope this provides some input for others that are trying to decide.Consider all the factors - the heat and power as well as the picture.", "Date": "January 27, 2010"}, {"Title": "Great depth, clarity, and detail, but disappointing blur & jutter", "Author": "David A. Leon", "ReviewID": "R2BLFL931FP8PQ", "Overall": "4.0", "Content": "I took delivery on this HDTV on April 18 of 2009 so I have now owned the HDTV for approximately 4 weeks.  I guess that makes me as experienced as any owner with this unit.ProsAmazing depth, clarity and detail of the image.  The color is excellent.  The black levels are amazingly deep.  Reds are as red as the LaserVue.  LED side-lighting means very low power consumption, and virtually no heat production.  It is 1.2 inches thick, although I do not regard that as a substantial feature.ConsThere is still motion blur, ghosting and after imaging on LCD HDTVs.  The Luxia 7000 is no exception.  This unit is no exception.  You may be used to it if you have owned LCD for several years.  You may not notice it if you don't watch sports or fast action movies.120Hz motion smoothing works fine for broadcast sports.  It does not work with Blu-Ray movies.  It does wacky and bizarre things to 24fps movies.  The motion looks fake or phony.  The lips of the actor frequently get out of synch with the sound track.Overall it is good HDTV.  Still, I regret giving up my Samsung DLP, and I will return to DLP land as soon as my target model hits the market.  DLP works better for movies.", "Date": "May 13, 2009"}, {"Title": "Awesome tv for videophiles and regular joes alike", "Author": "D.L. Boyd \"Drew\"", "ReviewID": "R3UIS3IOW7GEX", "Overall": "3.0", "Content": "I purchased this tv after several months of research since I wanted this to be a quality tv. I understand the merits of plasma and they do have their uses for particular situations, but for me, LED LCD was the way to go. You might save a little money by going to the 6000 series model since all it lacks I believe are the internet widgets and so far, I haven't made too much use of them. If they come with a Netflix widget, then it will be well worth it! There are a couple of things to consider with this tv. First, the sound on it isn't the best as in volume and such, but chances are if you are spending this much on a tv, you have a home theater as well and it's a moot point. Second, some of the connections were difficult to make on the tv because it is so slim. Some connectors might be too bulky to fit so just be aware you might need to get slimmed downed ones.I haven't purchased the wall mount for this yet as I live in an apartment, but it would look so good on the wall. Some thought this was a too big of a tv for a 8' viewing distance, but it is awesome! It's almost like being in a theater. The tv tuner on this model is very good too, I was pleasantly surprised how nice the sd channels came out.I'd recommend this any day, even over the 6000 model because even though the widget library may not be too great now, it has lots of room to grow and with a tv purchase like this, I like the opportunity to upgrade. I haven't even tried the media streaming aspects of the tv so it can only get better :) Do buy the wireless attachment though unless you have a cat 5 run close to the tv. It makes life easy and you don't notice it even there. Hopefully as I learn more about tweaking the tv, I'll love it even more. I'm still figuring out this whole 120hz thing since there are many options, but it's nice to have flexibility. It's also nice that it comes with a cool dumbed-down remote for those who are electronic-adverse :) Regular remote could be designed better, but I've used much worse.UPDATE: Turns out that Samsung went with a different model for their internet apps for 2010. Looks like maybe there won't be any widgets for netflix but is part of the 2010 model lineup. With that in mind I'm disappointed that there isn't going to be a software upgrade for the B-series model to support the new scheme and leaves me wondering if they'll do this every year. I would skip this model if you care about internet apps and go with this years C-series. Or if internet isn't a concern, go with the B6000 series and save some money. I still love this tv, but very disappointed in the \"futureproof\" aspect.", "Date": "April 9, 2010"}, {"Title": "sam68", "Author": "Roland S. Almer, Jr.", "ReviewID": "R3C8QBU8IS5X9C", "Overall": "5.0", "Content": "\"I have been comparing HDTVs for some time now. I would say that the way to go is LED. I bought the 7100 (silver edge @ Best Buy) and I just love it. Setup was quick and easy. The colors and clarity are out of this world. Great for watching sports! Many reviewers have commented on the speakers, but in a pinch it will do. The sound is as good as my Mitsubishi - 55\" that I'm replacing. If you can get a home theater system you wont regret it. I also bought a Samsung - Blu-Ray Disc Player and a Whalen - 3-in-1 TV Stand.", "Date": "September 8, 2009"}, {"Title": "Delighted with MY TV!!! Samsung 55 LED 7000", "Author": "Wilie Coyote", "ReviewID": "R10Z2FVXY3ICVB", "Overall": "5.0", "Content": "Received my Samsung 55 LED 7000 TV 1 hour ago and I am ecstatic. $1699.00 no interest for 24 mos., free shipping in 3 days and no 8 1/2% tax. This is $300 better then best local at Frys. and with tax savings and delivery charge!! Was delivered by Pilot Transport. They wheeled it into my living room, unpacked, set it up on my fireplace and hooked up cable and electric. Took about 15 minutes. I am 70+ yrs old and can not lift or use my hands well. The man from Pilot, Orlando Amayas, was really nice and above and beyond in his service.I read the quick setup guide and ran it through time set, channel scan and started watching.Picture is brilliant!! Have in a well lit area and cabine is beautiful Love the  controls and the little mini-remote. This is a replacement for my Samsung 40\" HD that is three yrs old and now destined to my home office.I looked at the 8500, 8000, and the 7000 side by side at Frys. I really couldn't see any significant difference so the 240HZ at bigger bucks didn't make any sense to me. My son has the 8500 and he is a sports nut and says he can see the difference but of course with much younger eyes. Do the side by side your self and see what you think for yourself. If any changes or problems I will update this. For now, I am a happy camper in Houston. Go Aggies!!!", "Date": "March 5, 2010"}, {"Title": "WOW factor is there!", "Author": "Kevin C. Hadacek", "ReviewID": "R163UV7VR7EOP0", "Overall": "5.0", "Content": "1. Pilot delivery was excellent, help remove from the box and gave a quick inservice of the tv and remotes.2. Right out of the box TV was beautiful.  WOW factor is there.3. I have not experienced any of the negatives discussed in the reviews.4. Connected to the internet with no problem, updated software immediately.5. Love this TV, best that I have.  I have 3 other Samsungs and have never had an issue.6. If you are undecided, go to Best Buy and look at this TV!", "Date": "February 4, 2010"}, {"Title": "Outstanding Picture!", "Author": "Burty", "ReviewID": "R21937W56F3OYG", "Overall": "5.0", "Content": "Looked at a million tvs and read as many reviews before choosing this one.  For us it came down to picture quality alone (not the thin-ness or looks at all) and seeing it in various stores, it always seemed to have a brighter, sharper picture than any of it's rivals. Now it's home, on the wall and connected to our HD DVR and it is superb... stunning, pin-sharp picture quality. It does look great too though, much less obtrusive than our previous smaller, but bulkier 42inch Plasma.", "Date": "September 7, 2009"}, {"Title": "Incredible", "Author": "Charles P. Johnson", "ReviewID": "R21NP56ZM6SWXF", "Overall": "5.0", "Content": "This Television is the best on the market.  Hands down.  the future is here.  This LED back lit tv is wonderful.  Producing the deepest blacks and most vibrant colors I have ever seen.Watching Blu Ray on this is beautiful.PLease be aware that Samsung, like most companies care more about their picture then their sound.  I have a Bose 321 GS III with an OPTICAL AUDIO CABLE (also important) along with this TV and Blu Ray makes one hell of an experience.Do yourself a favor and buy this TV!It's Brilliant.", "Date": "June 7, 2009"}, {"Title": "Great price! Great TV!  and about delivery, quick start and Wii", "Author": "Amazon frequent shopper", "ReviewID": "R3N5Y2WB3H9FDR", "Overall": "5.0", "Content": "We're usually Sony TV buyers but got sold on the LED idea when we saw how great the screen picture is when viewing from the side - not distorted. Sony does have LED but it is still new which means still expensive. The Samsung 7000 came out a year ago so is now half of what it cost last year! (Now that there is already an 8000.) The 7000 is the same as the 7100 sold in Best Buy except for the frame or something minor. Through Amazon, as of last week, we got this for 300 dollars less than buying local, no tax and no delivery charges - super deal, couldn't resist, though this is the most expensive thing we've ever bought on Amazon.Delivery was very good. Amazon advertises that the TV can be at your place in 3 days. For us, that meant it was in our city in 2 days. The delivery company didn't call us on checkout but did call us the day after it got to our city (4 days). They gave a 3 hour window for the next day which is pretty good and were here as they said (Got TV in 5 days from ordering.) Brought the TV just where we wanted it. Didn't unpack it because it was cold? They said to wait 2 hours. I'm no expert so I don't know if that was the truth or an excuse. But they were really nice. They gave instructions on unpacking and keeping the packing in case of a return or exchange.Quick start is quick! Out of the box, plug, find channels and go! Already mounted on a stand out of the box. Love the picture as is without fine tuning. The back is designed maybe a little too slim, though. Not much space to get the connection for an ordinary cable in - had to squeeze it in its slot - couldn't use the screw type with no space to screw it in. There's much more space for HD connections which we don't have. Maybe when we add a blu-ray, etc.Viewing distance with LED truly doesn't matter as the local sales guys say. We were afraid 55 would be too big for a 6-8 feet distance but it isn't.Wii - if you don't already have one, you may need an HD-Wii cable (35 at gamestop, maybe cheaper elsewhere, plus there are 3rd party types). The original Wii cable has only 3 connections; you need the 5. Without it, we had sound, no color and fuzzy images. With it, and with Wii settings - Screen - TV resolution set to 480p, great!This is Day 1 and we're loving it!", "Date": "February 27, 2010"}, {"Title": "This TV is great but delivery was even better", "Author": "E. Ronald Mills \"Who Cares Man\"", "ReviewID": "R1W28QTBJQY9E3", "Overall": "5.0", "Content": "Others have written better reviews than I could so I'll just concur. Picture is great, sound is not as bad as others find (much better than my old 27\" Samsung) and it is a pain to set up. Just consider it a 42 pound picture & frame and hang it on the wall - spectacular.What I want to rave about is Amazon's delivery. I ordered this on Black Friday for $2200, free shipping. It was in town the following monday and delivered to me on tuesday. Three days for order to delivery - WOW - now that's service.", "Date": "December 5, 2009"}, {"Title": "Excellent but not perfect", "Author": "W. Hernandez", "ReviewID": "R2QXB18OHA5YJH", "Overall": "5.0", "Content": "Let me first say this is the fourth LCD TV I'ved owned,second Samsung.I can understand all the gripping about the uneven picture in dark scenes,however after proper calibration which includes going into expert mode and shutting off CE Dimming I must say the picture is outstanding,color,contrast,black levels are spot on.I used Video Essentials to calibrate the brightness,contrast,color,tint and sharpness.This tv is well worth the money.My only grip is the internet wigets thingy which is too slow for me.", "Date": "November 23, 2009"}, {"Title": "Samsung UN55B7000", "Author": "John Resciniti \"John\"", "ReviewID": "RUOVZLCMNQU8B", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1TXOTYCZH1HKXembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1TXOTYCZH1HKXrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1TXOTYCZH1HKXchiDiv\").innerHTML = document.getElementById(\"cv_mo1TXOTYCZH1HKXhiddenPre\").innerHTML;\n};\ncv_mo1TXOTYCZH1HKXrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1TXOTYCZH1HKXso;\t   \n\n\nfunction cv_mo1TXOTYCZH1HKXloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1TXOTYCZH1HKXso = new SWFObject(swfLocation, \"cv_mo1TXOTYCZH1HKXAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1TXOTYCZH1HKXso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1TXOTYCZH1HKXso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1TXOTYCZH1HKXso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1TXOTYCZH1HKXso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1TXOTYCZH1HKXso.setAttribute(\"height\", swfHeight);\n          cv_mo1TXOTYCZH1HKXso.setAttribute(\"width\", swfWidth);\n          cv_mo1TXOTYCZH1HKXso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1TXOTYCZH1HKXso.write(\"cv_mo1TXOTYCZH1HKXflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1TXOTYCZH1HKX', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1TXOTYCZH1HKX';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1TXOTYCZH1HKX', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1TXOTYCZH1HKXloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1TXOTYCZH1HKX\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1FJJSLB0BF0UE\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1FJJSLB0BF0UE\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RUOVZLCMNQU8B\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1FJJSLB0BF0UE/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1TXOTYCZH1HKXduration')) {\n      document.getElementById('cv_mo1TXOTYCZH1HKXduration').style.display='none';\n    }\n    cv_mo1TXOTYCZH1HKXloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1TXOTYCZH1HKXloadSwf(movieID, playerVersion) {\n   return _cv_mo1TXOTYCZH1HKXloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1TXOTYCZH1HKXnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1TXOTYCZH1HKX', 0, h);\n}\n\nfunction cv_mo1TXOTYCZH1HKXresetPlayer(w,h,bw,cc) {\n  cv_mo1TXOTYCZH1HKXnewHeight(h);\n\n  cv_mo1TXOTYCZH1HKXso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1TXOTYCZH1HKXso.addVariable(\"cacheCode\", cc);\n  cv_mo1TXOTYCZH1HKXso.setAttribute(\"height\", h);\n  cv_mo1TXOTYCZH1HKXso.setAttribute(\"width\", w);\n  cv_mo1TXOTYCZH1HKXso.write(\"cv_mo1TXOTYCZH1HKXflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1TXOTYCZH1HKXRollOverImg = new Image();\ncv_mo1TXOTYCZH1HKXRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81HaaJ1v7uS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1TXOTYCZH1HKXpreplay = document.getElementById('cv_mo1TXOTYCZH1HKXpreplayImageId');\nif (cv_mo1TXOTYCZH1HKXpreplay) {\n  cv_mo1TXOTYCZH1HKXpreplay.onmouseover = function() {\n    cv_mo1TXOTYCZH1HKXpreplay.src = \"http://ecx.images-amazon.com/images/I/81HaaJ1v7uS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1TXOTYCZH1HKXpreplay.onmouseout = function() {\n    cv_mo1TXOTYCZH1HKXpreplay.src = \"http://ecx.images-amazon.com/images/I/81HaaJ1v7uS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1TXOTYCZH1HKXpreplay.parentNode;\n\n  var cv_mo1TXOTYCZH1HKXcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1TXOTYCZH1HKXcurrentClick) {\n      return cv_mo1TXOTYCZH1HKXcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:40 MinsI payed more for the LED vs a plasma, or traditional LCD, but I'm kinda looking for slim, and as much energy conservation as I can get for a flat panel display. I'm a front projector fan, and have one for my basement theater, but this is in a very well lit living room and needs to be bright. This certainly is bright enough! It's replacing an old 32\" Hitachi CRT. That was a great TV in the day, and is now in our bedroom. Now I just have to get some decent furniture to replace the old unit that held our TV and tons of nick-nacks. It's mounted on an articulating wall mount, and there's just a folding table under it for now just to hold the receiver and various set top boxes, etc. All the nick nacks are in boxes for now. We need some decent shelving!Oh yeah, it's about the TV, eh? Get into the expert settings and turn off the auto contrast thing.  It dims the screen for dark stuff. It's mostly noticed during the credits, but it's annoying. While power is off hit \"Mute, 1, 8, 2, power\" Scroll to \"Advanced\" then type \"0000\" and scroll dimming thing. There are many other things to scroll thru and play with, but didn't have the guts to mess w/ that. I bet there are some cool features tho! I turned off the Motion Plus stuff after reading many tech reviews that say it's bull.BTW this video review feature sucks. I'm just trying my 3rd export option in quick time since my first file was too large, the second file was incompatible (M4V). Lets hope MPEG 4 is ok. Ok, so MP4 is not supported either. My original .mov is, but it's too large. WTF do you want, Amazon? Lets try AVI...success!", "Date": "January 10, 2010"}, {"Title": "Amazing! LED all the way!", "Author": "Big Mike \"Bigtymer\"", "ReviewID": "R8UCDTMQJQ51O", "Overall": "5.0", "Content": "I waited long enough for a T.V like this to come out. I have holding out on buying a T.V as they are always coming out with newer technology.  I am very please with my purchase.  I have not played around with the settings but this picture is truly amazing. My dad had an older Samsung and he was amazed how the picture has changed since he purchased his about 2 year ago. The slim depth is just plain mind blowing. I also got this t.v for a great price after the huge promotional discount Amazon offered. A little part of my wishes that I would have splurged for the 8000 series but I am very happier with the picture.The one concern I had after reading everyone's review is the overpowered LED bleeding through the edges of the T.V during the dark scenes.  I have not really noticed this at all. I think some people are just overly critical on things.  If you really pay attention to it you might notice it but if you are just watching the picture itself you can't notice it.  So don't base your decision on this issue.", "Date": "November 9, 2009"}, {"Title": "Great if you only expect it to last 5 months", "Author": "Kenneth C Wakasugi", "ReviewID": "R35LNGDBECB2J", "Overall": "1.0", "Content": "I really loved the TV, but it quit working only after 5 months.  This is the second Samsung TV that I have owned.  The first was a 46 inch LCD TV and six months after the one year warranty a row of dead pixels appeared in the middle of the TV.  That cost me close to 800 bucks to fix.  I decided to upgrade to an LED TV. There are plenty of other manufacturers of LED's but I purchased another Samsung because of the picture quality and the reviews. The picture was great, but it only lasted 5 months.  I don't know, but I have owned two Samsung's and they both broke one lasted 18 mo and this one 5.  Buyer beware!  If you buy this be sure and get the extended warranty!", "Date": "July 26, 2010"}, {"Title": "LED - The future of TV", "Author": "Dave T", "ReviewID": "R36KLMVWAGOISU", "Overall": "5.0", "Content": "The future of TV is LED, sharper colors, deeper blacks and almost a 3d looking picture in some cases and 40% less energy usage.  Now is this the best LED tv, no.  Most people will say it will be the Samsung 9000 series tv 55 inch coming soon at $7000.00.  The new Samsung UN55C7000 might be a tiny bit better but again you will pay a lot more at $3000.00.  Right now this TV at $1800.00 is a steal with free shipping and no sales tax and even 3% less if you have an amazon credit card.  This TV was $3000.00 a year ago like the new UN55C7000 today, and if you wait another year I'm sure the UN55C7000 will be $1800.00 too.  But the wait never ends, next year will always be a better tv at a better price.  The only problem I came across with this tv was the auto dimming as others have said.  It doesn't happen often, and most of the time the auto dimming works, making night scenes darker and more realistic, so I would not recommend turning it off.  But you may see the picutre go a little darker all of a sudden in dark scenes.  Like I said it doesn't happen often and watching Star Trek the other night with dark scenes I didn't notice it.  I would recommend watching this tv at a store with dark scenes before you buy it just to make sure you are happy with it.  Overall this is a great TV and I would buy it again.Update: Firmware update from 1013 to 1017 solved some of the auto dimming problems.", "Date": "March 15, 2010"}, {"Title": "Absolutely Beautiful Picture, Minor Drawbacks", "Author": "Benjamin A. Minshall", "ReviewID": "RCZ9M5TXNGK2M", "Overall": "4.0", "Content": "The most important feature of this TV is the absolutely incredible picture quality.  This cannot be overstated; the picture quality is fantastic.  Based on picture quality this is a 5 star product, however the following keep it from being an overall 5 star TV:1) The built-in sound is pretty lousy, but I bet most people will use it with an external receiver.2) The menu system is clumsy and even makes something as simple as switching inputs a pain in the butt requiring multiple button presses.  Picture-in-picture requires navigation of several menus to turn on.3) The Internet features are so slow and clumsy to use that they're basically worthless.  I can open my laptop and complete my Internet activities in less time than it takes the widgets to load on the TV.4) Limited inputs.  The component input and the composite input share the same RCA plugs, so only one or the other can be used at the same time.  No s-video.Overall these are minor distractions from what is really a great TV.", "Date": "March 10, 2010"}, {"Title": "Awesome TV!  Very pleased!", "Author": "Freddy G", "ReviewID": "RN5W8KLOHTP9M", "Overall": "5.0", "Content": "I bought this TV on January 29 with Amazon's 24-month free financing promotion to replace my old Samsung 50\" DLP, which I've had for 4 years and is still working perfectly.  Shipping was free and the TV was delivered right on time on Wednesday, February 3 by Pilot Delivery Services.  I was told by the delivery men that they usually unpack the TV and turn it on to make sure the TV works, but because my TV had been in the cold delivery truck for almost 2 days (I live in Chicago), the delivery men recommended that I give the TV a couple hours to reach room temperature.  I heeded their warning and about 2 hours later, I finally turned on the TV and WOW!This TV definitely has a great picture and I am very pleased.  I watch HDTV via an HD/DVR Comcast cable box and the picture is amazing. I have the TV connected to the cable box via HDMI 1, to a PS3 slim via HDMI 2, to my laptop via the PC input, and to my Samsung surround sound receiver via a digital optical cable.  All connections produce vivid images and great sound.  I have not really messed with any of the picture settings, as I think the picture looks great without tweaks.  I do put the picture on Movie mode when I am watching a Blu Ray on the PS3, but I put the Dynamic Contrast back on (default setting is OFF on Movie mode).  A lot of people complain or don't like the 3D-ish look of the Dynamic Contrast + 120hz refresh rate, but we really like it and always leave it on.Although this TV only has a single tuner, I was able to get the Picture in Picture to work with 2 different channels, by splitting the cable before reaching the cable box, then using an HDMI from the cable box to the TV and a coaxial cable wire from the cable box to the ANT IN of the TV.  Be sure to do a channel search on the TV input to obtain the channels for the sub-PiP screen.  Note the sub-PiP screen will only show the local/over the air channels available in your area (at least for me), but the good news is that you can get the HD feed of those local channels on the sub channels (channel 2-1, etc).Probably the best evidence I can give is the constant positive comments my wife gives me about TV.  She was against the pricey purchase from the beginning, but she has definitely been won over and that should give the TV enough credibility on its own.  We had a Super Bowl party and everyone kept raving about the TV (picture and thinness were the biggest comments).The only feature of the TV that I have not been able to utilize is the Internet connectivity.  I tried to connect the TV to the Internet via my cable modem (wired through my wireless router), but I was not able to get past the Internet Gateway portion of the Internet Connection test.  Therefore, I cannot currently access any of the widgets, though I am not too disappointed as I would not normally not utilize them - I just wanted to see how they looked.  I am sure the problem is with my wireless router (firewall or something), so I do not blame the TV.  I should try going directly from the TV to the cable modem, but I have not tried that yet.Lastly, this TV looks great mounted on the wall.  I was going to buy the Samsung Ultra Slim mount, but I decided to get a far less expensive Cheetah Mount (also from Amazon) for around $30 with shipping and it works perfectly.  I used a slight tilt on the mount and the TV hangs perfectly from the wall.  I was very happy to save the $100 or so with the cheaper mount.  I used the savings to purchase the Samsung-backed 3 year extended warranty from Amazon as well.Overall, perhaps I am not as technically picky as most people who buy TVs at this price range are, but I have absolutely no complaints about this TV and am very happy with my purchase.  I would recommend this TV to anyone and one of my friends recently purchased the 46\" 6000 series model after viewing my TV.  I will update my review if I come across anything I forgot to mention or any negatives I encounter.", "Date": "February 14, 2010"}, {"Title": "Amzaing color, flimsy optical output door", "Author": "Pete Chen", "ReviewID": "R2HGR55I85TT0R", "Overall": "4.0", "Content": "This TV has amazing color and great internet functions. But the door of optical output is very flimsy. It was snapped off within a month. I searched the Internet and found that other customers have exactly the same issue. It is not possible for me to return the TV just to fix this. I have to tape the cable to have to fixed. So be very careful with that optical output door.", "Date": "January 12, 2010"}, {"Title": "Amazing Picture", "Author": "Sooner Techy", "ReviewID": "R2RR1WJ3EHRLV8", "Overall": "5.0", "Content": "I purchased this product just before Thanksgiving and it was delivered in time to watch all of the football on turkey day.  All I can say is that you have to see it to believe it.  My wife and I are still amazed at the clarity and sharpness of the picture.  We keep noticing our local news anchors facial imperfections, and can see details that I am sure we could not see on our previous television.  The sound is good, but I also purchased a Samsung Blueray home theater in a box, and they work flawlessly together.  I looked around and compared several televisions before purchasing this one, and I have not been disappointed.  The delivery went very smoothly, the television was shipped and ready to be delivered within two days, I received a call the night before to set up a 2 hour delivery window.  The delivery person and I carried it in, unboxed it and I made sure it worked before they left.  It is a great television and a great purchasing experience.  I was a little leary about purchasing something like this online, but Amazon made it very easy.", "Date": "December 21, 2009"}, {"Title": "Awesome TV", "Author": "Dcall717", "ReviewID": "R1TITP7HRR1NRT", "Overall": "5.0", "Content": "This tv is great.  It is thin and bright and has a great viewing angle.  It was shipped very well by a freight company that looks like they deliver a lot of TV's for Amazon.  They had 3 or 4 on the truck when they arrived, and opened the box to check for damage before having me sign the shipping order.", "Date": "December 14, 2009"}, {"Title": "Beautiful (With Some Minor Flaws)", "Author": "Zyde \"zyde\"", "ReviewID": "R27Q0C80HGWLLA", "Overall": "4.0", "Content": "Pros:  This creature is beautiful.  Super thin and super lightweight and has a \"wow\" factor when people come over.  HD tv shows, xbox games, and Blu-Ray movies are amazing.  Lots of groovy extras in the menu system (like recipes).Cons:  Sound from the tv speakers is bad.  Fortunately, I use a separate speaker system and it rocks our living room.  Also, we notice some sporadic, barely noticeable \"pauses\" every once in a while.  It was explained to me that we should have gotten the 240hz one instead.  They rarely happen, but now I wish I'd gotten the 240.", "Date": "December 2, 2009"}, {"Title": "Very disappointing", "Author": "Dennis Jakobsen", "ReviewID": "R2AWA2SB2P1182", "Overall": "1.0", "Content": "I have had this TV for 4 month now and I am not happy with it at all.  It has two major problems.It generates a humming noise that is very distracting during silent parts of a movie or a show.When watching movies or TV at night with the light dimmed it is like someone shines a flashlight from the back in each cornet - this is especially bad during a dark scene where you will have problem seeing what is going on.  I have a picture of how bad it is so contact me and I will email it to you - you will not believe it.I have spent so many hours on the phone with Samsung support on this - they have sent a technician out to look at the TV twice - he acknowledged that problem but was not able to correct it, he even said it was a general problem with this units.  To me this is totally unacceptable for a new top of the line TV so I asked Samsung for my money back, but they refuse to refund me, and said there is not more they can do to help me, despite the issue is obvious and their own technician acknowledged the problem.Samsung does not stand behind their own warranty, and when you talk to them they do not really care about the issues you are having, they just want you to go away not not boarder them - I am very disappointed in the product and also in the way I have been treated by Samsung.  I would strongly recommend NOT buying this TV.", "Date": "March 28, 2010"}, {"Title": "Samsung LED tv 55", "Author": "Adrian Rodriguez Jr.", "ReviewID": "R2B5MKZG03RTOC", "Overall": "5.0", "Content": "Absolutely love this tv. Great picture quality and features. Easy to move by one person only. Slim design makes it look ageless.", "Date": "December 26, 2013"}, {"Title": "Superman TV!", "Author": "Magix", "ReviewID": "R3LRYZ7D2PKIOE", "Overall": "5.0", "Content": "Still working after 4 years (thank god) :Dfor that time (2009) was the best and in are little apt still is!Even if today (2013) you want to buy it I still recommend it.", "Date": "December 7, 2013"}, {"Title": "It works as expected.", "Author": "RP", "ReviewID": "RMPFFQBWDT510", "Overall": "5.0", "Content": "Functionally it works as expected. Very nice pictures with rich colors... have it for over 2 years now, still doing well...", "Date": "November 9, 2013"}, {"Title": "Great TV", "Author": "CO V LUONG", "ReviewID": "R4285Y9DEWZJX", "Overall": "5.0", "Content": "Have it for over 2 years & love every momentThin & crisp picturesThe HDMI connection is awesome for plug in Apple TV - now we can stream iPad or watch iTunesFestival on TV", "Date": "October 31, 2013"}, {"Title": "Best t.v for the money", "Author": "D. Hudson", "ReviewID": "RW2H2VLO87QDT", "Overall": "4.0", "Content": "I have had this t.v for a couple of months now and I am still thrilled with it. I read every single review on amazon twice before I put down this hunk of money. I was absolutely prepared to take this back if it didn't hold up to my expectations.Here is what I found with my t.v.Corner light- Yeah Its there. It is very subtle however. My husband didn't see it until I got up and walked to the t.v and pointed it out and no one else has noticed it either. I only saw it because I was really trying to look for it and all the light were out. I wanted to make sure this didn't become annoying later so I put in my copy of Lord Of The Rings widescreen edition and I am telling you it's very very faint.Ghosting- I have seen this once. During the same movie, in the beginning, the screen goes completely black for about 20 seconds. In the middle of the t.v the black seems not so black. Not white or cloud-like, just not as dark. I tried different lighting and nothing seemed to effect it. I put in several other \"dark\" movies and I never saw this again.Shudder/jerkiness- I haven't seen this with my set.Sound- Okay sound blows! I knew it would though and plan on getting surround sound in the near future. The thing is you have to keep adjusting the sound but it's not the end of the world.3D- It is pretty cool. We watched the new Star Trek movie in 3D and it gave the movie a nice depth. Nature shows look awesome in the 3D.Overall- I love this t.v. The picture is fantastic. So clear it takes some getting use to. The 3D is cool even if it doesn't take off. I bought this as a bundle with the 3D kit and the 3D Blu-ray player for 2700.", "Date": "September 15, 2010"}, {"Title": "Love this TV", "Author": "William Gilmyers", "ReviewID": "R23PLQO17UR6D2", "Overall": "5.0", "Content": "Stunning picture, incredible clarity.  Like looking through a window.  Flashlight effect visible when there is no picture on the screen, but otherwise not noticeable.  Not worth grading down. Super happy with my purchase.", "Date": "August 7, 2010"}, {"Title": "blurring, pixelation and reflects room lights..", "Author": "Shanthi K. Pendyala \"linux enthusiast\"", "ReviewID": "R2SAHFCZ815TP4", "Overall": "3.0", "Content": "I actually bought the samsung 7100 55\" led tv at my local Frys. The only difference between the 7100 and 7000 is the red touch of color around the bezel. it seems this TV suffers from the downside of both LCD and plasma. there is blurring and pixelation in fast moving scenes like a LCD TV and the glass reflects room light/windows like a plasma. why Samsung did not go with a matte finish is beyond me.  power consumption is very low and picture looks good (close to a plasma) as long as the scene is not fast moving. I have comcast HD and it appears most channel still don't broadcast in 1080p (as of july 2010). in my opinion a 720p panasonic plasma is the best value out there if you want to upgrade to HD.", "Date": "July 20, 2010"}, {"Title": "exceptional clarity", "Author": "T R Messer \"T R Messer\"", "ReviewID": "R3OUJW4JF436WW", "Overall": "5.0", "Content": "Even after a month I am still amazed at the clarity and vivid colors,easy to use remote. The only down side is the speaker system on the set. Don't even bother, it needs an amplifier or other surround system. Definately worth the money spent.", "Date": "May 29, 2010"}, {"Title": "Definitely a great TV", "Author": "Mark \"McAwesome\"", "ReviewID": "R1UKG10VTT3YBA", "Overall": "5.0", "Content": "I research for 3 months for a new tv and after checking out all of the TVs for myself and reading all of the review this TV made the most sense for the money and what I needed.  I have a 6.1 sound system xbox 360, PS3, HD DVR and everything runs through my receiver via HDMI.  This TV has a great picture and provides many options.  I would suggest if you calibrate it you custom your 120 b/c it makes it look soap opera like.  If you calibrate it right it gives you a clean finish like a plasma.  The only things is it does get a little blury at times when watching sports, but then you can turn it back on.  Also it has an automatic drop to 24 hz when watching bluray which is its native resolution.  This gives you a much cleaner look.  All in all I am very happy with my buy...and I am a very picky shopper.  The only thing I don't like the fact that you have to pay extra for the wireless internet adapter....which I don't even use that much b/c they don't offer Netflix.  Hope this helped...", "Date": "May 28, 2010"}, {"Title": "Awesome", "Author": "F. Thomas \"electrolover\"", "ReviewID": "RSRSNHRMX5BQO", "Overall": "5.0", "Content": "It's a great TV. I just can't think of anything negative to say. There are features to nitpick and complain about but those are minor issues and this is not the top of the line TV so obviously it won't have all the bells and whistles. Picture quality is awesome. The only slight issue I have noticed is that when the picture goes to a black screen you will see the uneven lighting of the Led backlight coming unevenly and awkwardly from the edges of the screen. Also IMO 120 Hz feature is a gimmick. But overall there is nothing to complain about. Available connections are Awesome. One thing that I find annoying is having to dive into menus and submenus to get to features that should either be on the remote or should but in the main menu instead of having to press several clicks on the remote to get to.", "Date": "May 27, 2010"}, {"Title": "Very Impressed", "Author": "FoReigNeR", "ReviewID": "R24VPUL5I839K9", "Overall": "5.0", "Content": "I love this tv. Blu-rays, HD satellite and video games look great.  Had to buy a separate wireless enabler costing 80 bucks because my router was too far. I don't use the internet option much but I've tried streaming movies from Amazon and Blockbuster with no problems. The PC link is great too. You must load the \"PC share\" CD and install to you windows OS in order to make it compatible. Screen looks great. Pictures come to life. Luckily, I've not experienced the problems of many reviewers here.The tv gets used about 8 hours a day, every day. 5 months later, everything still works fantastic. I especially love the usb port to allow me to share pics and vids onto the huge screen when company is over. The only minor complaint is that the tv isn't the sturdiest thing on the base. With about 6 connections on one side of the tv, it tends to slightly lean in that direction. No biggie, but still slightly noticeable.  I won't deduct a star for it.  Maybe I can place a few legos to prop it up evenly.Friends and family love the tv too.  My house has now become \"the place to be\" when big sporting events and pay-per-view fights are happening. Although the low power consumption saves me money, I now spend a fortune on chips and dips.", "Date": "April 30, 2010"}, {"Title": "light from corners and problems with dark scenes", "Author": "C. Cote", "ReviewID": "RD8VD56WC0RYC", "Overall": "3.0", "Content": "this is a beautiful and thin tv. the picture looks great most of the time. the edge led system ruins this tv for me though. every so often i notice that there is light coming from the corners. this really irritates me. also, on darker scenes from movies/tv, the backlight sometimes turns way down. when the scene changes the backlight turns back up. there is no consistency when it comes to dark scenes with this model. i couldn't fix this without making the picture quality suffer. i'm not an expert with television settings either. i returned this one for the LG lh90. the lg doesn't use edge led system. very pleased with the LG.", "Date": "April 20, 2010"}, {"Title": "Great piture and graet price", "Author": "Don Brice", "ReviewID": "RHL69GYHM8OQ1", "Overall": "5.0", "Content": "I purchased the 7000 series tv but when it was delivered I ended up with the 8000 series.Amazon was just as shocked as I was but said it was an error on their part. The piture is great and for 1799 for an 8000 series I am totaly happy.Servies was good and on time. I've had the tv over a month and had no problems. I did purchuse a wireless link stick from newegg (rosewill rnx-n1) and it worked fine, I was able to get the filmware updates with no problem.", "Date": "April 19, 2010"}, {"Title": "awesome HD picture", "Author": "Robert Decoteau Jr.", "ReviewID": "R3E8SLBW2EKJTN", "Overall": "5.0", "Content": "This TV replaced a Toshiba 57\" DLP, which I thought was the best picture I'd seen. The contrast, sharpness and color brilliance on this Samsung 55\" LED is incredable!Samsung UN55B7000 55-Inch 1080p 120 Hz LED HDTV The HD Discovery Channel is just like your there! The remote is easy to navigate. The TV is 1.2\" thick, hangs on the wall and has WiFi, which allows me to wirelessly connect to the internet through my computer's wireless modem and watch streaming movies. All this and Amazon sells it for an incredible price.", "Date": "April 15, 2010"}, {"Title": "tv is great but still yet to find out what went wrong", "Author": "Samuel Jung", "ReviewID": "R277WPH6NU49FH", "Overall": "3.0", "Content": "Bought the tv and it worked perfectly fine for a few days.  After about 3 days the picture went completely out and all that was working was the sound.  Awaiting for someone from Samsung to come to my home to correct the problem.  Maybe this is an individual problem or maybe this occurs often with these types of tvs.  This is my first purchase of this type of tv.  Other then that, received the product at a great price but it took a little long to finally arrive.", "Date": "April 10, 2010"}, {"Title": "DO NOT BUY THIS TV - Half of your screen will go dark!!!!", "Author": "Jae Jeong \"No more Samsung\"", "ReviewID": "R9TVLNMEQDE43", "Overall": "1.0", "Content": "I bought this TV (the exact model) last year July and recently I started noticing that half of the screen is getting darker than the other half.  In addition, there's a spot that lost the color.  I contacted Samsung Customer Service and they sent out third party vendor to replace T-COW part.  After that we still had the issue.  Now the technitian says it needs a new LED Panel wihch means basically replace the 90% of the tv.  I contacted Samsung Customer Service again to see if (and hoping) they can replace the tv instead of keep fixing it.They said \"We will try to replace parts until we can't resolve the issue\".  I understand if they try to replace one or two parts, but we're talking about whole LED panel.  This is rediculous.  I told the service rep. that I won't buy any Samsung product anymore and she said there's nothing I can do.  I am just following the protocol.", "Date": "April 8, 2010"}, {"Title": "Great LED LCD TV!!!", "Author": "Michael J. Bober \"M Bober\"", "ReviewID": "R2FSK6H721E00Z", "Overall": "5.0", "Content": "Ive had this Tv for about 3 weeks now, and all i have to say is great things. Picture quality straight out of the box is pretty good, but improved a bunch after calibration. Very much improved on electrical efficiancy as you can tell by no heat coiming from the tv what so ever. Tv is at room temperature everywhere on the case, no heat coming out the top like regular LCD tv's. Menu is much better than other reviewers have complained about. I consider it to be one of the better menu's out there. When it comes to the 120Hz settings, you have to play around with the settings for quite a while to get it set up for what is best for you. My settings were 3 and 3 for best overall picture without having to turn it off. Is made to be turned off when watching anything other than fast moving sports like football. But overall i would rate this tv a 9.25 out of 10! Of course a plasma tv will have a better overall picture experience because of motion blur, but will use ten times or more electricity than this one.", "Date": "April 2, 2010"}, {"Title": "What a great TV..", "Author": "Michael J. Maier \"Flopguy\"", "ReviewID": "R29X2OEPD920ZE", "Overall": "5.0", "Content": "What a great TV. I was blown away. This is my 2nd LCD TV my other is a 720p. Right out of the box is played great. Easy to hook up. I think what I like the most is how clear it plays regular dvd's. I could just image how well it would play Blue ray. I have watched a lot of hockey in HD and the movement is great wit no blurring or shuttering that I could see.I read enormous amounts of reviews before I bought this and finally pulled the trigger and I am glad I did.I mounted it on the wall and the whole thing sticks off the wall less than 2.5\". My Old LCD stuck off the wall at least twice that.I ran an ethernet cable to it and get my stock quotes and weather. It also downloaded it software update. I am still playing with the internet side and I am not fully utilizing that yet. I did browse the internet, but that is a little cumbersome. You use the remote to arrow around the key board. They have a youtube widget that is cool and can play full screen, but like the computer it is blurry if you do full screen.I was worried about shipping such a large item, but amazon's delivery brought it inside the house for me. Samsung also boxed the TV pretty well to protect it.", "Date": "April 1, 2010"}, {"Title": "UN55B7100", "Author": "HD Nut", "ReviewID": "R3F0FK7904JCLG", "Overall": "5.0", "Content": "I had this TV for 1 month. It was very good right out of the box. It has a lot of different settings to adjust the picture to your preference.I tried the CNET settings and I really didn't like it. The speakers are ok.I hooked up some Boston acoustic computer speakers for everyday viewing. I leave the Onkeo receiver for the Bluray player. Saves some energy.Bluray is great displays in 1080p with 24fps.It has an \"energy display\" meter. Press info on the remote and is displays a gauge that shows LED vs Conventional.(Sure hope it doesn't mean a tube tv.) Colors are amazing. Watching Sports is very nice with the 120 htz setting on \"clear\".The default setting is a little strange on movies and shows. But you can adjust that as well. It has great black levels and colors that pop. I had to turn some settings down because of the intensity of colors.But to me that is what makes this TV so good is the ability to adjust it. The only setting that is not adjustable is the local dimming. There is a post in the comments section, but it only works on the movie & dynamic settings.And you have to go into the back menu to get to it. I'm kind of used to it now. (I almost forgot to mention it!)I do not have it hooked up to the internet, so I can't comment on that. But I did hook it up to my Toshiba laptop via HDMI and it displays it perfectly. Any 1080p videos on line look great.It has 4 HDMI and only 1 component, so if you have older equipment you may want to upgrade or consider a different set.Now for the \"flashlight issue\" Yes, it's there but if you turn down the back-light, you don't really notice it. I have it set on 6 for tv and 5 for bluray. We've been watching 24 with mostly dark scenes and haven't noticed it. we also watch in a darkened room.I have to say, I agonized between this lcd, and plasma. I had a hard time with the different issues with plasma(energy, burn in, break in)The plasma are better in energy use but they are still high.Overall we are very happy with this set.I'll write again if anything else comes up.Happy shopping!", "Date": "March 30, 2010"}, {"Title": "Performs well", "Author": "J. W. Barnett", "ReviewID": "R3FPMF2O182KBN", "Overall": "5.0", "Content": "This LED TV performs as advertised and has a beautiful picture.  The only negative concerning the TV is that the speaker system is weaker and needs a home theater system for louder volume. We purchased the Samsung 5.1 channel blue Ray home theater system HT-BD3252.  We had read some reviews from people that have had connection problems with these units where the picture did not match exactly with the sound from the home theater system on playback etc.  We have not experienced any of these problems, and everything has run exactly as it is supposed to right out of the box.  Parties with those complaints may have a slower cable or Internet feed to their TV. Inasmuch as we have very fast Internet and cable we have not experienced any problems at all.  I would recommend the tv and the home theater system.", "Date": "March 22, 2010"}, {"Title": "Awesome Picture", "Author": "M. Stepka \"DJ Mikey\"", "ReviewID": "R2MC9EY8Q0IVX7", "Overall": "5.0", "Content": "I Love my new LED TV.  Picture is so crisp and clear.  I have had many people over that have 1080P DLP Projection tv's and they wonder how the LED looks so much clearer.  It must be the contrast ratio.  The blacks are truly black and the picture is very bright even when the lights are on.  Awesome TV", "Date": "March 21, 2010"}, {"Title": "Great picture and easy set up!", "Author": "A. Kayser \"kayz\"", "ReviewID": "RL7C1HNL1KZP4", "Overall": "5.0", "Content": "I took it out of the box, hooked up the Samsung Sound Bar and satilite fed and was looking at a great picture! Sound was great also! Also hooked up Blu-Ray from Samsung, so easy a Caveman could do it! I made some picture adjustments using the numbers my son gave me from his Samsung 46in., a Best Buy Geik did his!, looks great!I used hdmi cables from Amazom (9.99)1.3 cat2 and optical cable that came with sound bar. Don't think you need the expensive ones! I have been watching for three weeks so for so good! I am 65yrs.old, it was not that hard to do!! Bob K.", "Date": "March 21, 2010"}, {"Title": "Love It", "Author": "Douglas Aoyama \"douger1la\"", "ReviewID": "R3RVXANB3WJFTG", "Overall": "5.0", "Content": "So I've only had this TV for about a month, but I absolutely LOVE it.  Love the sleek design, picture quality, and flat profile.", "Date": "March 18, 2010"}, {"Title": "Samsung 55\" LED HDTV", "Author": "R. Widney \"bobwid4\"", "ReviewID": "RGUUR7FGC98O3", "Overall": "5.0", "Content": "An awsome Wide screen HDTV. Picture is a 10 out of 10.  and very attractive unit.  Sound leaves some to be desired but I have connected the sound through an AV and external speakers = Much improved. Easy setup and fairly easy navigation through menus.", "Date": "March 18, 2010"}, {"Title": "complete review in case your on the fence.", "Author": "Jeffrey Withhart \"collegestudentjeff\"", "ReviewID": "R2T9I0PL49U4ZC", "Overall": "5.0", "Content": "Ok i researched and price shoped. Compared eveything out there for under $10,000. The un55b7000 is by far the best thing out there. Is it perfect? No. But it tries really hard.First of the negatives.1- soundSound is the most commented on negative aspect of the tv. The speakers on there own are adequate but i think the problem most people have is the picture is so amazing they expect the sound to match. I found the sound to be decent and loud enough to hear fine and im in a room thats 20' x 25'. The sound is mostly clear, by this i mean its the subtle things that get muddled up. On a 1 - 10 on sound alone if i was blindfolded and asked to rate the sound of a typical show i would give this set a 7 or 7.5. So its not gunna wow ya but your not gunna be so unhappy you want to take the tv back.2- The menusThe menus are ok but are also not the most user friendly. My wife thinks it too complicated but i have no trouble navigating it. The only source you can directly switch to is the TV. But c'mon who shells out this kinda money for a tv and doesnt have cable or satalite? so if you switch to tv you have to push the source button 3 or 4 times to get back to hdmi. Again not the end of the world but hey. I love the backlite on the remote.3- The 120hZ automotion plusI agree with most of the negatives saying that when its on it looks kinda home movie or jumpy like a scene from lost  lol. But this can easily be turned off or in my case turned down to a minimal setting.Now the good1 picture.Isnt this why we bought this tv in the first place. Ive had this tv about a week now and i feel like i have a great picture without usung one of those home calibration discs or worse yet paying some man to come set my tv the way he thinks it shoudl be. Some people complained about the bright corners or uneven backlighting. I will say that out of the box i did have the same issues. But just by lowering the led backlighting(not the tv brightness mind you) i was able to fix both of these. Now the blacks are so black their like black ink and the whites are crisp. My wife was against the purchase until she saw the picture. Shes a fan now for sure.2- inputsLots of em. And for me i have a sony receiver and it has 7 hd inputs that all run to the tv on one hdmi so all those extra hdmi ins are just resting for now.3- the thinness.Is that even a word? well if not it will be soon. I have the samsung slim mount picture frame deal. Its so close to the wall it looks like its built into the wall.", "Date": "March 17, 2010"}, {"Title": "Prepare to be blown away...", "Author": "Christopher Smith", "ReviewID": "R3SGMCVUTFBB8T", "Overall": "5.0", "Content": "This TV is incredible! I researched LED tv's for a while before deciding this was \"The One\" This Tv will change your level of enjoyment while watc hing your favorite Movies/Shows! IT'S THAT GOOD! I cannot say enough about the picture quality. Everyone who has come over and looked at it has been speechless at it's vibrant colors, and the rich beauty of it's display. If you need further proof go to Best Buy and see this TV on display, then prepare to see it change the dynamic of you living room with it's sleek stylish modern look and feel.I have an LCD and it looks great...but this TV looks INCREDIBLE!If you are on thev fence...don't be. This is the one you've been looking for!", "Date": "March 10, 2010"}, {"Title": "Big and beautiful", "Author": "J. Dow", "ReviewID": "R1CLL23C25RSO2", "Overall": "5.0", "Content": "Easy set up, great picture, excellent price. Beat Best Buy by $400+ considering no shipping, no tax.", "Date": "March 4, 2010"}, {"Title": "Great Unit.", "Author": "D. Brown", "ReviewID": "R92TW47QRZP8W", "Overall": "5.0", "Content": "We have the UN55B7100WF which has the internet capabilities over the standard 7000 if I am correct.  The picture quality is unreal for this whole line of TV's.  The 1.177\" thickness of the unit is amazing.  I am blown away at the quality with the standard Cable box which only displays at 1080i instead of 1080p.  I haven't tried a blueray player yet, but I am certain that it will surpass all my expectations.  This is the first addition to our Home theater.  The speakers on the unit are decent, but not home theater quality, but with even that said, I still rate this TV as a 5 out of 5.  Very pleased and impressed with this unit.", "Date": "March 1, 2010"}, {"Title": "Great Decision", "Author": "Steve", "ReviewID": "RRRUCVPBJ38QM", "Overall": "5.0", "Content": "After an exhaustive research project of about 1 month I came to the conclusion that the UN55B7000 was for us.  We were replacing a Sony WEGA 42\" projection LCD HDTV that was suffering from the dreaded blue smoke/cloud caused by the optical block.  After using the new Samsung for a few days now I must say WOW, what a huge difference.  We weren't reacting to the truely spectacular picture quality because of our Sony problems but because the details this screen shows out performed our Sony when it was new.  5 years of technology improvement really shows through in the 7000.If you are reading this then you are where I was in th beginning wondering which one is right for you and your family.  Well look no further this is the ticket.  You might read about the shiny/glossy screen causing problems, well my living room is brightly lit in the morning with the large picture window facing east which is perpendicular to the TV, we have no issues with the glossy screen.  In fact we both commented on how the picture looks brighter than the Sony did in the morning.I've not hooked up the widgets so won't speak to them, although I have to admit I'm not in a hurry as we aren't interested in checking the weather with a widget or updating our Facebook from the TV.  Plus the laptop is in the other room for those activities, in addition we have a PS3 that can do that as well, more or less.If you are still undecided I suggest visiting [...] as you will find a wealth of information from the members of this great audio visual forum.  Your brain will melt from the information but you will go away knowing what to do, I believe.Enjoy your new Samsung as we are enjoying ours.", "Date": "February 26, 2010"}, {"Title": "As Good as it Gets...", "Author": "Dave", "ReviewID": "R33MVCQN6MGW7C", "Overall": "5.0", "Content": "My only negative is the wireless internet connection.  It works OK but too slow to be very useful.  One good surprise was the way it handled a 16 gig usb chip filled with photos and music.  Everything looks and sounds great with a good user interface and logical default settings.  As for the TV picture itself I've found none better...", "Date": "February 14, 2010"}, {"Title": "Great TV", "Author": "R. Dech", "ReviewID": "R2I2UQSLDKO617", "Overall": "5.0", "Content": "Picture quality is fabulous on this set.  The internet widgets are pretty cool too once you understand how you can configure them.  If you get this TV and do not have a subscription to high def, you are missing the whole point of having this TV.  The recent price drop plus the free shipping was too good of a deal to pass up.  It was delivered within a week.  Excellent service from Amazon.", "Date": "February 1, 2010"}, {"Title": "Excellent Picture quality", "Author": "Ed Agudelo \"EA\"", "ReviewID": "R27FH7291NDMZ9", "Overall": "5.0", "Content": "Very happy with my purchase.  TV's picture quality is excellent easy to set up.", "Date": "January 9, 2010"}, {"Title": "A New Viewing Experience - Extraordinary", "Author": "P. J. Crecca", "ReviewID": "R25J2USXYM5FT7", "Overall": "5.0", "Content": "This new Samsung LED is a new viewing experience.  When watching good HD TV programming or blu-ray the picture is pretty close to 3D, the charaters come alive. I've had NO issues with the back light issue so many reviews seem to be complaining about with these LED sets. Even though this set is 120hz, sports are also fantastic. As a 2007 buyer of Pioneer Elite 61\" Plasma (albeit 1080i), and several newer LCD sets - this Samsung LED unit takes the picture quality to a whole new level.", "Date": "January 1, 2010"}, {"Title": "Love it, easy as pie to get started", "Author": "David Ben Gerson \"Internet Doc\"", "ReviewID": "RTWUSXFNCWW7V", "Overall": "5.0", "Content": "Was a little concerned about the reviews concerning set up but the price couldnt be beat.  Set up was too easy...this is the first time i've experience real \"plug and play\".  Hooked it up to my antenna, not more than 15 minutes on its own and i was watching Football! The pic is unreal, i could read the fine print of the car commercials, from my kitchen!", "Date": "December 15, 2009"}, {"Title": "Beautiful TV, great picture", "Author": "J. Hamilton", "ReviewID": "R2OEXMJZ07ZMY0", "Overall": "5.0", "Content": "I'm not an audiophile, but in my humble opinion, this is a great TV.  The picture is stunning.  My son and I just watch the World Series on it, and never once lost the ball in the picture due to slow frame refresh or the less-than-240 MHz rate of 120.  Nor have I seen any of the issues referenced by others regarding the 8000 series and issues with \"lighting from the corners\".  I pulled out a 65\" Mitsubishi Diamond, and put this in the hole it created in our entertainment center.  Even though it's 10\" smaller, it's 1000% better.  The only downside I see right now is that it's hard to turn the TV off now... I should be reading more books!", "Date": "November 6, 2009"}, {"Title": "Great TV", "Author": "R. Niesen", "ReviewID": "R1TVAADKJOEXWR", "Overall": "5.0", "Content": "This is a great TV.  There are a few minor issues, first the viewing angle is not the best, but I always have the best seat so not an issue.  The second issue is there is minor bleed through in the four corners from the lights but you have to look for it to see it.  It needs some adjustments out of the box to make it look good and get rid of the ghosting and juddering.  But after that it looks amazing in movies TV, and video games.", "Date": "October 20, 2009"}, {"Title": "Top of the line", "Author": "Matt Mullins", "ReviewID": "RAF265JO4J0HE", "Overall": "5.0", "Content": "Had this TV for about a week and it lives up to the hype. I've never seen a tv with a blacker black. My wife's first comment when it was pulled of the box: \"Wow, that is thin!\". Amazing that they can fit such a fantastic product into 1.5\" of depth. The only thing I would note is that I did see what some say about the light bleeding in from the edge. I noticed it at night during an almost completely black scene. I actually didn't notice it until I thought to look based on others' comments, and it's very discrete. It doesn't degrade the viewing experience at all. If that's something that would bother you, stop looking at your tv and start watching your tv.", "Date": "October 15, 2009"}, {"Title": "Inconsistent backlighting. Annoying dynamic contrast features.", "Author": "Chuck Norris", "ReviewID": "RW7AORVE727BT", "Overall": "3.0", "Content": "This TV was fine ... If you're not watching a movie that has dark scenes you won't notice anything. But the backlight (as with many LEDs) is inconsistent. If you're looking at a black but lit screen you'll see cloud like inconsistencies in the lighting which is really distracting.That annoyance can be mitigated by decreasing the brightness and this issue is common with most LED TVs.ALSO! It has this TERRIBLE dynamic contrast setting that tries to decrease the brightness to yield more saturated blacks in darker scenes. But it does it in steps - it's not gradual. So you think you're having power issues or something as it flickers a bit.  Think this is an easy feature to disable? Think again my friend! If you google it you'll find forums that show you how to enter the maintenance mode on the TV. This involves doing some finger gymnastics on the remote and a sequence that resembles a learning disability test - Look at this page! Now don't! What was on the last page? Once that feature is disabled the TV is much better!Besides the above the TV is great:- Speakers are fine given their size.- It's a great looking TV.- Can be VERY bright for bright rooms.- Great picture.- Impossibly thin.- Very light- Consumes very little power- No buzz whatsoever (as you might have with a plasma)I AM borderline (read: completely) OCD. I point out these issues to others and while many saw what I was talking about many others were like, \"What are you talking about! You're so crazy OCD, man! Seek therapy!\"", "Date": "June 7, 2013"}, {"Title": "for the money it's okay", "Author": "As Wilson \"As Wilson\"", "ReviewID": "R187EY7NO1BJP5", "Overall": "4.0", "Content": "We enjoyed most everything this tv has to offer, to include the slim line body style, as well as viewing films in the 3d(which take some getting used to), beautiful slow & stills.  As far as sound, we had it hooked up to our bose surround sound, so I cannot confirm the sound issues.  What we did have a problem with was when we watched an action film or anything which objects move across the screen quickly (& we watch alot), the pixilation issues that happen around objects as they move across the screen quickly or fast. The tv just can't seem to keep up. It's very annoying and never happened with our old DLP.", "Date": "November 23, 2009"}, {"Title": "Excellent TV", "Author": "Mark Krieger", "ReviewID": "R31BBN1M3W45BL", "Overall": "5.0", "Content": "Picked up the UN55B7100 from Best Buy this weekend (identical to 7000 except it is Gray ToC instead of red).  I love this TV.  Upgraded from LNT4061F from Samsung.  It is so thin its amazing the wall mount screws don't go through the screen.  At less than 50lbs without the stand it is substantially lighter than any traditional 55 inch lcd or plasma.  The colors are vibrant, the blacks are solid and the picture just seems to pop.  I haven't done any calibration or adjustments so I'm thinking it only gets better from here.  Hooked up to surround sound system so I can't say anything about the speakers.  Yes, it is more expensive than many similar sized tv, but I really think it's worth it.", "Date": "June 7, 2009"}, {"Title": "Great Product", "Author": "C. Retrum", "ReviewID": "R3LKGNDYH728EW", "Overall": "5.0", "Content": "Sleek, elegant, and efficient, this TV's picture quality is only rivaled by Samsung's new plasmas.  If you're a gamer then go with LED TVs like this.  If you're a film guru go with the plasmas.", "Date": "May 28, 2009"}, {"Title": "Condition of TV Received not as stated", "Author": "Amazon Customer \"FOTOWAG\"", "ReviewID": "R2TEAPKJWO5LYR", "Overall": "1.0", "Content": "I Sent in a review last week.  Apparently it was  ignored.  CEVA truckers were great.  They unboxed and tried to set up TV.  Remotes where not with the TV. None of the accessories were shipped. No remote remote (small unit) Programming CD, harness clips, etc etc.  Couldn't turn TV on to see if it worked. Called Amazon Customer they provided a credit to buy a remote.  Had to go to Samsung to get a remote that worked.  After setting up TV we found that the top side bezel was bent and pushed forward about 1.5 inches.  TV playing but I'm concerned with stress on the LED screen; Might fail in the future. Product was not as specified \"Like New\"????I would like a replacement.", "Date": "October 5, 2010"}, {"Title": "Happy with the 7000, but....", "Author": "Robert J. Dengler \"me si too\"", "ReviewID": "R28CJ81JFL0383", "Overall": "4.0", "Content": "After less than twenty four hours with my new Samsung 7000 LED 55in TV, it is a great tv except one thing, I wish it was twice as big! If you stacked one on top of the other, that is the size I wish it was.I am just a normal tv watcher with a wife and two little kids. All the add ons I probably won't use. I have it in a family room in between two windows. I wish the tv was the size of a picture window, so size has it over features as far as I go.  And I can see now why my friend who is into DLP's says the bigger the screen, the better.That aside, the 7000 looks great, the TOC is nice and with the little kids, it's nice not having buttons exposed for them to play with.I have mine set on the settings out of the box except I switched my picture to Natural instead of Standard. We seem to like watching the tv with a light on in the room at night. I didn't notice any reflexion.I use the universal remote from Comcast and I like just having one remote.The four star rating is only because I wish it were bigger for where I have mine and the lack of HD channels. But that's not the tv's fault....Update: I have had the 7000 now for a month and so far so good. No humming, buzzing, or flashlighting. The only thing I use it for is watching tv and dvd's. We watched the Princess and the Frog on non blue ray dvd and it was a great picture. I still have not broke down and bought a blue ray player yet. I have not used any of the add on's on this tv, just watched tv and dvd's. I don't think I'll ever use them.  One note, my little 2 year old climbed up on the stand we have it on and put some marks on the screen, (it's not glass).  I paid under $1800 for mine. Now they are more since Amazon seems to be sold out of them. We are happy with ours and once the electric bills comes, we will probably be just as happy.", "Date": "March 12, 2010"}, {"Title": "Stick to Plasma", "Author": "B. Brown", "ReviewID": "R14U8FLR7DDZ94", "Overall": "2.0", "Content": "Bought this TV and watched it for a few months.Plasmas still produce a better and smooth picture quality.I sold this and purchased a Samsung plasma.  Much better!Don't waste your time with LED backliit LCD.  It's simply not there yet.  Give it a few years.", "Date": "November 14, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Ultra-slim 55-inch LED HDTV with full HD 1080p resolution for the sharpest picture possible\nLED technology enables a true-to-life range of picture brightness; uses 40 percent less energy than conventional LCD TVs\nInternet@TV online content service from Yahoo!, Flickr, YouTube via your broadband connection\nInputs: 4 HDMI, 1 component, 2 USB, 1 Ethernet, 1 PC, 1 optical digital audio output\nIncludes detachable swivel table stand; measures 51.7 x 39.2 x 12 inches (WxHxD) with stand", "Name": "Samsung UN55B7000 55-Inch 1080p 120 Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31kKlPqPxcL._SX300_.jpg", "ProductID": "B001UHMVR2"}}