{"Reviews": [{"Title": "Excellent Buy for $200", "Author": "10th Legion \"10th Legion\"", "ReviewID": "R185XOHQ6CKPA7", "Overall": "4.0", "Content": "I got this on a 3-day pre-Christmas sale at Best Buy.  For the $199 price I paid, this TV is a great buy.  If you pay more than $300, there are many other comparable 19-inch TV sets to chose from.  This Sharp ships with two remotes - one designed to be used in a kitchen wall-mount set-up. The kitchen remote comes with a magnet suitable for keeping on your refrigerator door.  The other remote is a conventional remote.  No problems in the week I have had it.  I agree with the other reviewer that the resolution is fine, particularly on a digital-HD channel.  So if you can get this TV on sale or want two remotes, this is a great unit to get.  If you are looking at a price of $300+, I recommend shopping around.", "Date": "December 27, 2008"}, {"Title": "Great TV AND Great Monitor!", "Author": "Scott M. Gall", "ReviewID": "R3QUGD5L50E97N", "Overall": "5.0", "Content": "I use this for my PC monitor in our home office as well as a TV for our guest room (it's an office/guest room).  And works great as both!  The remote that attaches to the unit with a magnet is GREAT!  Nice for when guests come over so that they have no problem finding it. Of course being designed as a TV first and a monior second to graphics and reolution suffers slightly on the PC side.  But actually quite little compared to others I have seen.I also attached my Xbox 360 and it looks amazing!!  If you don't have a full living room to game it, or like me your family is often using that space you have your console in your room/office this is perfect!!!  I orginally bought this mainly for for use with my Xbox and I am not dissappointed.  Easy to switch between TV, PC and Console and it automatically adjusts resolution, color and brightness to each.I have owned this for about a month and I would give it a definite 5 out of 5 in my book", "Date": "December 27, 2008"}, {"Title": "Very poor audio", "Author": "Dizzie", "ReviewID": "R16S151ITT4YUD", "Overall": "1.0", "Content": "The very poor audio output from this TV is in Sharp (pun intended) contrast to the picture quality, fit and finish.  I normally watch my small TV while seated at my dining table.  The TV is on the table. With factory settings, the maximum audio output is so low it is below my normal listening volume when I am seated across from it. Audio output was totally useless when viewed from my kitchen area while cooking and cleaning up.I opened the settings menu and boosted the treble and bass to their maximum settings to boost audio output. That helped a little but the output is still below acceptable limits by a lot.  I should not have to listen to the TV at the maximum volume setting of 60.  I do not listen loud and I am not hard of hearing.Sharp spent more money and attention to the kitchen timer/clock remote than they did to audio output and they did not even include RCA audio outputs so the TV could be connected to an external analog amplifier or preamplifier. I also have a 46\" Sharp Aquos LC-46D62U and the audio output is equally dismal.  I get around that by watching it through my stereo system. Apparently many (maybe all) Sharp TVs are lacking in audio performance. I will never buy another Sharp product.This television is stunning appearance but tragically flawed.  Don't be fooled by a pretty face.", "Date": "March 1, 2009"}, {"Title": "Performance of Sharp Aquos LC19D45U", "Author": "Donald P. Fisher \"Troutboy\"", "ReviewID": "R1GWYEZFC47UAZ", "Overall": "4.0", "Content": "The picture quality is excellent, the audio is good as long as you are in the same room. The set is located in the kitchen and we eat in the dining room---we have the sound turned all the way up to maximum and it is barely audible. Otherwise I think this is a great TV for the money.", "Date": "February 9, 2009"}, {"Title": "Unsuitable picture", "Author": "Desert Rat", "ReviewID": "R1MGSPBFP8FX58", "Overall": "1.0", "Content": "I hope that the one I got was just a lemon, but had to return it (which is very easy with Amazon's system).I have two other LCD HDTVs in my house on Cox cable. The house is wired with cables to most rooms, and this one was for the kitchen to replace an old Sony CRT set.I am fussy about the screen image, so spend some time adjusting the various settings on the menus. Both my other TVs, a Sony and a Toshiba, now have excellent pictures.I spent several hours over three days trying to get a decent picture on the Sharp. It was very dark, and when I got it lightened up, the contrast was too flat no matter how I adjusted that. The color was way off and no matter how I fooled with Color and Tint, could not get a decent picture. I like to use a closeup of faces to adjust the Tint, and when I got a face, I hit Freeze to keep it there. However, as soon as I opened the Menu, the Freeze went off. That is too bad, as it would help to have it stay there while I adjusted the skin tones.It is ironic, as the ten-year-old CRT Sony has excellent, bright and properly-colored pictures on all channels, so I just put that back and will use it until it dies (as have cable, no problem when stations all go digital).As others have found this model to be good, I can only assume that this one was defective, but I don't want to go through all that hassle with a replacement, so just asked for a refund.", "Date": "February 6, 2009"}, {"Title": "Viewing Sharps", "Author": "Howard Dean", "ReviewID": "RGLIL3ZZ8UAHE", "Overall": "5.0", "Content": "We were looking for a TV that operate's in varied lighting conditions, sun, and darkness. Sharp tech's had it, it's great veiwing.", "Date": "January 14, 2012"}, {"Title": "Sharp Aquos LC19D45U LCDTV", "Author": "kanipape", "ReviewID": "R2ZU1TCAF6L465", "Overall": "5.0", "Content": "You know I forgot just how many products I had gotten from Amazon. So I'm looking at my list of items that are still working, amazing Amazon you never let me down. Great job.Sincerely", "Date": "December 29, 2011"}, {"Title": "Sharp Aquos LC19D45U", "Author": "Pat", "ReviewID": "R3SZSVS7CKMZ78", "Overall": "5.0", "Content": "If it has AQUOS on the front, you can't go wrong.  I bought this TV to mount on the wall in the bathroom where I can soak in the tub and watch my favorite programs or catch the news while preparing for work but could have used this TV anywhere in the home.  The picture is amazingly sharp and vivid.  Sharpe Manufacturing makes their TV'S to receive both analog and digital broadcast without having to adjust anything to do so.  The TV knows what to do with either signal and without having to pay extra to the cable provider for digital service.  The TV arrived on time in perfect condition from Focus Electronics and Appliances through Amazon and I could not be more happy with all involved.  Thank You!", "Date": "June 27, 2010"}, {"Title": "Picture's great, Sound's terrible", "Author": "Marjorie Parks \"Marge The Cook\"", "ReviewID": "R32WTVP7JBCISU", "Overall": "5.0", "Content": "The buy is terrific. The picture quality is also great but the sound is minimal.  I'll have to get some speakers.  Very easy to use.", "Date": "December 19, 2009"}, {"Title": "Grerat for the Kitchen or Bath!", "Author": "Jenn", "ReviewID": "R2ZS231DHTS8C0", "Overall": "5.0", "Content": "I bought this TV 2 years age on black friday when circuit city had it 1/2 off for $200. I have it in the kitchen hooked to a surround sound system. I love it! There are 2 remotes, 1 magnetized to stick to the fridge with a timer and clock. and another regular remote. I am going to buy another one for the master bath. Great tv!", "Date": "November 22, 2009"}, {"Title": "Fits the bill", "Author": "H. Bargmann", "ReviewID": "R17AFZO5ECBZLP", "Overall": "4.0", "Content": "This is a great TV for close up viewing. Fits in our kitchen area just right. Dose'nt have the best backlite so some channel programs don't show up very good but the sharpness and color are great. If the backlite were better, I'd say you could'nt buy a better 19\" TV. I also have a  26\" Sharp so I can compare. The Sharp Aquos is with out a doubt of better quality, no way you could call it junkie.The extra remote is nice but we dont use it very much. Sound is good and there are more then enough inputs. The manual makes setup and operation of the TV easy. Ordering from Amazon was easy and shipping was quick. The price was right so I would give this TV 5 stars except for the backlite.", "Date": "March 30, 2009"}, {"Title": "Great Product!", "Author": "Steam Maker \"vulcan drifter\"", "ReviewID": "R3DHOESSQ6GZA7", "Overall": "5.0", "Content": "This Aquos now takes the place of two items, PC monitor and TV. And it does not need a Digital converter, either!!!! Great Digital picture reception with just an regular antenna. Worth every penny I spent!!!!!", "Date": "February 5, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Sharp's AQUOS 19-inch HDTV LCD TV slim design with a distinctive small foot print.\nBuilt-in ATSC / QAM / NTSC Tuners for DTV and analog TV viewing\nHDMI¿ Input for convenient connection to a digital device\nPC Input conveniently turns your TV into a PC monitor\nBuilt-in Magnet Remote", "Name": "Sharp Aquos LC19D45U 19-Inch 720p LCD HDTV", "ImgURL": "http://218.201.42.40:8080/ecx.images-amazon.com/images/I/41Fdk3IKMRL._SX300_.jpg", "ProductID": "B0017UH1GI"}}