{"Reviews": [{"Title": "Seriously Consider This Samsung 52\" TV", "Author": "Samsung Fan", "ReviewID": "RYTS6WTXSFUA6", "Overall": "5.0", "Content": "I have had my TV for nearly a month now and I love it. I am coming from a 27\" CRT TV, so of course, I'm going to be impressed. However, here are a few things I would like to pass along to those of you in the market for a new flat panel TV:* LCD versus Plasma:If you are having a hard time deciding between LCD and plasma, LCD has nearly caught up with plasma in terms of being the better flat panel TV. You still pay a bit more for a comprable LCD though. If you are hooking up a PC to your TV, will be pausing live TV, or anything else that keeps the picture still for a while, definitely consider an LCD as plasmas still have their problems with ghosting. I was in a Circuit City recently and looked at a new plasma TV with all the \"anti burn-in\" technologies built in. After accidently leaving an image on the screen for 4 hours, there was obvious \"burn-in\" on the screen.* Screen Size:I originally started looking at 42\" TVs, but realized that the picture quality is so good on HDTVs that you can buy a much larger TV even if your seating distance is only a few feet away. So, I limited my search to the 46\" - 52\" range. Another factor to consider is whether or not you want to spend extra for a 1080p set or settle for 720p. Most experts will say that you can't notice the difference between the two in a set smaller than 50\". So, you may want to save the money and go with 720p. Also, I was worried if my TV would look too \"big\" in my family room, but trust me, it looks great. I'm so used to the screen size now that anything smaller just doesn't look as nice anymore.* HD and SD Channel QualityThe HD channels look fantastic. I have an HD package with Dish Network and all of the HD channels are incredibly clear. The SD channels are certainly bearable, but a big step down from watching SD channels on my 27\" CRT TV (in terms of picture clarity).* PIPThis feature will not work for most people as you must have an analog signal. Those of you with digital cable or satellite TV will not be able to use it. For everyone else, it seems like it would be ok.* SoundI didn't have as big of a complaint as everyone else did. I could hear everything loud and clear. I will soon be hooking it up to a home theatre system to improve the sound, but as for basic TV speakers, they seemed ok to me.* PriceIf you are considering a TV purchase, buying from Amazon is a must. They typically have the lowest price (much lower than big box stores) and you don't have to pay S/H or taxes. The customer service was excellent any time I contacted them with regards to receiving a price adjustment. The delivery service was good too.* Picture SettingsMost people will complain about the \"Dynamic\" mode of the TV saying that this is what the big box electronic stores use to make the picture look brighter, sharper, etc. This is true, but keep in mind that if you want to use the DNIe (Samsung's picture enhancing engine), you will need to use \"Dynamic\". I'm still figuring out if DNIe is worth having on, but what I did was set my \"Dynamic\" settings to be very similar to the \"Standard\" settings. This way the screen isn't so bright. As for the rest of the picture quality settings, I left most of them the same except for a few minor adjustments for my personal liking.* No Auto-MotionThis was definitely a struggle for me. Do I buy a 46\" 6 series to get Auto-Motion or a 52\" 5 series? I've seen fast moving action scenes in both sports and movies and you can at times pick up some jutter (especially when the background is also moving). If you are really picky, consider getting Auto-Motion (which you can set to off, low, etc), but for most people the 5 series with out Auto-Motion is fine. I don't really notice anything most of the time unless I am really looking for it.* BonusSince you've taken the time to read my long review, here is a little bonus. After you buy this TV (or any Samsung), register it online and they will give you an additional 3 free months of product warranty.Happy Shopping!", "Date": "July 9, 2008"}, {"Title": "GETTING BETTER SOUND", "Author": "Christopher Nickels", "ReviewID": "R2KID0LVJEXYLB", "Overall": "5.0", "Content": "From the AVS Forums. These sound settings will bring your sound to life.\"Official LNXXA550 Calibration/Settings Thread\"A lot of people have used these audio settings and reported dramatic improvements:Mode: CustomSRS TruSurround XT: OnAuto Volume: OnTV Speaker: On(# of clicks):Balance: 0100Hz: 8 clicks right300Hz: 8 left1kHz: 4 left3kHz: 3 right10kHz: 5 rightTurn it up and enjoy the ride. . .Great Pic and more than adequate basic sound!", "Date": "April 29, 2008"}, {"Title": "Great Value", "Author": "Secret Santa", "ReviewID": "R2RXZBO0K74M39", "Overall": "5.0", "Content": "A while ago I got a Philips 52PFL7422 LCD from Costco.  I couldn't get the Philips to look right, even after adjustments using DVE, so decided to return it and get a different brand / model.After some research and in-store comparisons, I decided to get the Samsung LN 52A550.  I checked Amazon and the price was less than I paid for the Philips, and I trusted Amazon, being a satisfied customer of theirs for years.From the start the Samsung was MUCH better than my previous set.  It had none of the issues I had with the Philips.  I was surprised how well the colors and black levels looked before I did any tweaking.  Wanting to get the best picture I could, I set all the enhancements off and used DVE (Digital Video Essentials) to fine-tune the set.  The result was a great picture, not overblown like store displays, but not dim or washed out either.To summarize, here is my opinion of the pros and cons of this set.Pros:1. Great contrast - adjusted backlight, contrast and brightness so the blacks look great and whites are not blown out.  A really nice, not-too-bright, natural looking image.2. Great Color temperature and Tint3. Menus are well organized and VERY comprehensive - many advanced adjustments are available without entering special service menus.4. USB photo and music interface was nice and menus were comprehensive.5. Clean-looking frame and pedestal.6. Noise Reduction and Dynamic Contrast modes, when needed, offer subtle enhancements without degrading the image.7. Great HD quality from Blu-Ray/PS3.  Games and Blu-Rays look fantastic. Even older non-HD DVD's look very good.8. Great HD and Good SD quality from Cable Box (after adjusting the factory default contrast down to mid-60's, sharpness down to around 0, edge enhancement off).9. Good quality from Wii and Playstation 2 - contrast, etc. settings similar to Cable Box.  The games looked surprisingly good even though they are 480i or 480p.  Be sure to not ovewrdrive contrast or sharpness.  Use backlight to brighten if necessary.10. HP Laptop (with NVidia graphics) connected via HDMI looked great.  TV displayed various resolutions properly without chopping off the top or sides.11. Low glare screen.  Not as matte as some others, but definitely not high gloss like other Samsung LCD's.  This was a must-have for me due to the bright room where the TV is installed.12. Very good off-center viewing angles. - MUCH better than my previous LCD set.13. Remote has good-sized buttons and a backlight.Cons:1. Sound is hollow unless you perform some adjustments (see AVS Forums for suggested settings).  Not really a factor for me since I connect up to an external stereo system anyway.Didn't Try:1. VGA/PC Video input.2. Digital sound outputs.3. Composite video input.All-in-all I am very happy with the purchase and with Amazon shipping and customer service.", "Date": "June 4, 2008"}, {"Title": "Great HDTV, great price, great buying experience", "Author": "Jammer", "ReviewID": "R2TQULGUN3LTSE", "Overall": "5.0", "Content": "I researched the daylights out of HDTVs every day for a month before finally buying the LN52A550. Among other TVs, I had previously eyed the Samsung LNT5265F (last year's model), but was turned off by the glare of the shiny screen on that and other Samsung LCDs (looked at them at Best Buy and they WERE excessively shiny). Also, the 8ms pixel response time of those models was a bit slow for sports, with noticeable motion blur. But then the LN52A550 was put out, which has a matte screen and 5ms response time, and at $2,054, I was sold. (The price beat Best Buy's by $450 and that was before another $200 in sales tax.)I've had the TV almost three weeks now. This TV has phenomenal picture, color, and contrast. Fast response time is great for sports and movies. I have a Sony 1080i upconverting DVD player and movies look great. HDTV signals (Comcast cable with 1080i) look absolutely stunning. There are tons of settings for picture adjustments; the menus are very easy to navigate. I would've liked a few more zoom and aspect ratio adjustments for the 1080 modes, but what's there is adequate.For me, one high-priority selling point on the Samsung LCDs is the contrast ratio/black levels, and I have to say I was very impressed with this one's. My father has a 52\" Vizio LCD and the black levels (more like dark gray) are not even in the same ballpark as this model's. Very dark shade of black. Almost as dark as on my Sharp CRT.As other reviewers have noted, the sound is pretty weak, but that was absolutely zero factor in my decision because I use a Dolby Digital surround receiver and haven't used the speakers on any TV in my living room for a decade. I can't say how the sound of this model compares to other TVs; I'll just say that if you own a $2,000 TV, you should own an audio receiver and decent speakers.As some might be, I was a little nervous to online-order a 52\" TV (for fear of dreaded dead pixels and having to ship it back, mainly), but everything went great. The delivery took six days from when I ordered to when it arrived. The delivery guys unpacked it, moved it where I wanted it and let me hook it up and turn it on to make sure everything was working. Also, under Amazon's 30-day price guarantee, I've gotten refunds totaling $165 because the price went down to $1,889 since I ordered. Amazon refunded the difference no questions asked. Great service, great TV, great experience all around.", "Date": "May 19, 2008"}, {"Title": "Buyer Beware of Samsung Customer Service!!!!", "Author": "Elizabeth", "ReviewID": "R24ACWBDZOXAND", "Overall": "1.0", "Content": "I have no complaints about the television, but about the Samsung company itself.  People who purchase from Samsung need to read this review to know the nightmare that may be in store for you should something go wrong with your new television.  I would STRONGLY urge anyone who purchases a product from Samsung to make sure you purchase the extra in-store warranty that guarantees immediate exchange at the store you purchase it from in case anything goes wrong.  That way, if the tv breaks, you don't have to deal with Samsung Customer Service and can simply get it exchanged at the store you purchased it from.  We purchased the 2007 model of this t.v. on December 23rd, 2007 and it broke within a month of us buying it.  The LN52 A550 is the model t.v. that they will be replacing it with after 8 months, yes, you read that right, 8 MONTHS of wrangling with Samsung Customer Service department.  We paid for a $2,000 television and got to actually watch it with enjoyment for about a month before these awful lines started spreading like a virus all over the screen. Samsung literally has the absolute worst customer service department I've ever worked with.  I am not alone in this, other folks have had the exact same horrible experience as me (see the forums on Samsung).  They make great products, but they do not back up those products with quality support.  They will miscommunicate, not call you back, be rude to you when you call them, drop the ball and never move forward on your case until you practically make it a full time job in your spare time to call them.  I've had to call them close to 20 times in the last 3 months.  Today when I called, I found out that they had closed me case and listed my television as FIXED when it was broken beyond repair and we were supposed to already be in the review process for a new television.  I'm not exaggerating about how bad this service is, so please, save yourself the time and aggravation and spring for the extra hundred or so bucks, just in case.  You will save yourself the cost of having to go to the doctor for high blood pressure meds after attempting to deal with Samsung's Customer Torture Department.  To top it off, our warranty on the replacement t.v. ends on the same day as our old, broken tv.  They won't extend it, even though it was all their fault that we had to wait so long for a new televison.  Buyer beware, is all I'm saying.  Good luck to everyone.", "Date": "July 11, 2008"}, {"Title": "Outstanding Television Doesn't Disappoint", "Author": "DuckFat", "ReviewID": "RCL8D3AL82NHQ", "Overall": "5.0", "Content": "This television is truly one of the best purchases I have ever made.  The picture is simply flawless with no dead pixels, high contrast, and absolutely even color over the entire picture.  I can't find anything bad to say about the picture at all.The menu system is easy to understand but a few functions take more button presses than they perhaps should.  The feature to display pictures from a USB flash drive is simple to use and your pictures will look incredible when blown up on the screen.  There were more connections than I needed but that's a good thing considering possible future needs.The only caveat is that the sound is a bit disappointing.  There is little low end puch to the sound.  I use it with an AV receiver so that isn't an issue for me.The outer edges are a shiny piano black and it looks great.  The screen being matte (unlike the higher end Samsung models) really cuts down the glare and that was a big selling point for us as our viewing area is near our kitchen and our old CRT TV really had a lot of reflections that were annoying.  No problem with the Samsung though.  I've only played regular DVD's on it so far and they look reasonably good as long as you are a few feet away.Normal (non-HD) programs look really good.  This TV does a good job of conversion to whatever signal you give it.  HD programs look incredibly sharp as you would expect.Overall, I would recommend this TV to anyone and Amazon as the company to provide it.  It's a great value even though there were a couple companies offering a (very slightly) lower price.  Amazon did a great job for me with this purchase (I was wary of ordering a TV like this over the Internet).  After the order, they emailed me that there may be a delay as they ran out of stock but it actually came on the first day of the original delivery window.  The delivery company from Washington DC did a fine job and they even waited for me to open the box to make sure it wasn't damaged.", "Date": "May 10, 2008"}, {"Title": "Making the right choice", "Author": "R. Adams", "ReviewID": "R8NJNTBS9Y606", "Overall": "5.0", "Content": "I had narrowed my choice for a new tv to either the Panasonic 50\" plasma or the Samsung 52\" LCD.  My daughter has the Panasonic which is a very nice set.  But due to the brightness of the room, I decided on the Samsung.  I've had it set up for the past week and all I can say is this is an amazing tv.  Regarding the price, local big box stores are selling this for $2799.  I paid $2338 at Amazon on April 2 and due to the 30 day best price policy, to date I have received $120 in credits to my card.  If you're in the market for a tv, I cannot say enough about the Samsung LN52A550P or Amazon.", "Date": "April 17, 2008"}, {"Title": "This is a Great Samsung LCD TV.  A+++++", "Author": "Sameer", "ReviewID": "R3KWRLQBQ5A5MO", "Overall": "5.0", "Content": "This is my first HD TV I have purchased in my life. I have been having this TV for 2 weeks now. There are no dead pixels. The picture quality and colors are great! The sound quality is average. There is no bass and/or treble controls on this TV. The sound on this TV is loud enough for a small room. If your room is really huge then it might not be loud enough for you. I would recommend for you to buy a home theater system for this TV to get the full amazing sound experience. The screen barely has any glare on it when I open all my windows when it's sunny outside. Standard and high definition channels look amazing on this TV if you use a HDMI connection. I don't see any ghosting when I play my video games or computer games. The menu system for this TV is very user friendly. I wish Samsung made bass and treble controls available in the menu options like the Sony Bravia TVs. Overall this TV is great!", "Date": "April 24, 2008"}, {"Title": "Simply Amazing", "Author": "The Magus", "ReviewID": "R2ZL55VNFOYISH", "Overall": "5.0", "Content": "It took me a long time to decide between this one, the 6 series and the 7 series.  What really did it for me was the matte screen.  They say the super-glossy screen of the 6 and 7 series helps the contrast, but I stared at both TV's in a Circuit City for a long, long time (a total of about 4 hours of time between about 6 visits at different times of the day/night) and I simply could not see the difference in that respect.  What I could see, clearly, was my reflection in the 6 and 7 series TV's, but not in the 5 series.  Though I did like the appearance of the 6 and 7 series better, the 5 series simply performs just as well IMO, costs less and doesn't have the irritating reflective screen.HD looks breath-taking, SD looks good too and gaming on this bad boy is fantastic.  It'd be nice if it had a DVI input instead to use as a PC monitor, but VGA is good enough.  Still can do 1080p over VGA, the colors look great and it makes a fantastic PC monitor.Just so everyone's clear, the 5 series is NOT a 120hz TV.  The 6 and 7 series are, not the 5 series.  Which is fine, cause I actually decided after much watching of the 6 and 7 series, I don't really like the 120hz feature.  It might be nice for live TV and/or sports and maybe gaming, but for movies and regular TV... it just doesn't look right to me.Anyway, I love it and so will you.  You won't be disappointed with this TV.", "Date": "July 28, 2008"}, {"Title": "Great TV for HDMI plus HDTV, not so great for old analog", "Author": "S. Purpura", "ReviewID": "R37COB7WKSZU0L", "Overall": "5.0", "Content": "When matched with TiVo HD, Time Warner HDTV service and a quality HDMI cable, the result is stunning for HDTV channels.  I find myself mesmerized by the output quality, and I don't want to go back to watching regular tv channels (even from cable).  Regular (compressed) channels from Time Warner are unimpressive (they look filled with noise).  Blueray is phenomenal.Even compared to my 47\" Panasonic plasma and Sony 32\" LCD which are about a year old, this unit's display of colors, including blacks, is far superior.", "Date": "July 7, 2008"}, {"Title": "Samsung and  Amazon Doesn't Disappoint Again", "Author": "infatuationjunkie \"infatuationjunkie\"", "ReviewID": "R1Z77LX9I5Z2YG", "Overall": "5.0", "Content": "I was so impressed with our Amazon Samsung 46\" purchase, that when my Dad said he wanted a big screen HD TV to watch the Olympics on I knew exactly where to go.To make sure he was comfortable with the purchase I took him to Circuit City to demonstrate all the TVs side by side and he agreed to go forward with the purchase.  Amazon saved him about $500 once you take delivery and taxes into account.  Delivery and service were excellent again.If you are not in a hurry I would keep checking the prices on Amazon over about 2 weeks time.  During the week he was looking, prices ranged about 50-70 day to day.  Now it is retailing $100 less than what he paid.", "Date": "July 22, 2008"}, {"Title": "Great TV, totally happy with it.", "Author": "RexB", "ReviewID": "R1E7L5G482IA6J", "Overall": "5.0", "Content": "I've been researching for months now and finally decided on the Samsung A550 series. I just got the TV 2 days ago, my first HDTV. I was originally planning on getting a 46\" but couldn't find the deal i wanted so i ended up picking the 52\". I was kind of nervous since i'm getting a larger sized TV than planned and might be overwhelmed with the size (9' viewing distance). When we got it set-up it was awesome. It was big but not overwhelming. The size was just perfect and couldn't be happier. I liked the matte/semi-gloss screen because i have 2 big windows behind the couch directly in-front of the TV and no glare at all even with the blinds open. This is one of the main reasons i opted for the 550 series. The viewing angles are very nice too since i have a love seat and a recliner chair on the side of my living room and it can be easily viewed without any problems. I didn't have HD service yet, so i just hooked up indoor antennas to pick up OTA (over-the-air) channels and the built-in digital tuner picked up both SD and digital channels and some HD channels. I was watching the NBA finals Game 5 and was blown away. I was getting 720p feed from ABC HD and the picture was awesome. I did also get some 1080i HD feeds from OTA and it looked great. I can't wait to get some HD channels (dish/cable) and PS3 bluray with this set. Right now my set-up is OTA and my laptop hooked-up to the TV so i'm just scratching the tip of the iceberg on the full potential of this TV. The sound is ok if you use one of the Amazon reviewers audio settings which i belive was taken from AVSforums and it is really worlds of difference from the default settings. Overall, this is a great and wonderful TV.", "Date": "June 16, 2008"}, {"Title": "There's a first time for everything", "Author": "Ian Sanderson", "ReviewID": "R1RC6YPF5R5SWS", "Overall": "5.0", "Content": "I'll admit..  I had reservations about ordering a 52\" LCD Television off the internet. My biggest concern was shipping.  In the \"old days\", you go the electronics store then begrudgingly call a friend who has a pickup and ask to borrow it for a few hours.  You and the salesman throw the TV in the back, strap it down.. pray it doesn't start raining, bring it home and have someone help to unload it.  Whew!Not the case with Amazon.I was amazed at how wonderful the entire transaction took place.  After deciding on this model, I placed the order.  A few days later, I received a pleasant call from a freight company in my nearest metro, Cleveland, OH.  The nice woman on the other line confirmed my address and scheduled a date and time for delivery.That Friday, a friendly driver showed up, unloaded the TV, and brought it right into my place.  Being somewhat cautious, I asked if I could inspect the TV.  The driver happily opened the box for me and we made sure everything was A-OK.  The TV was perfect.. not a scratch.The TV itself is, of course - excellent.  Blacks are deep and colors are bright and vibrant.  The gloss black frame looks traditional and is non-intrusive.  I would never recommend a silver or \"stainless\" frame for a TV--black is the only way to go.I will definitely recommend friends and family get their next TV from Amazon, and make it a Samsung!", "Date": "November 30, 2008"}, {"Title": "\"THE TV\" to buy", "Author": "M. Row \"0vercl0cked\"", "ReviewID": "R3I23YVQMI8SC9", "Overall": "5.0", "Content": "Look no further than this model series. We spent about 3 months researching the LCD HDTVs before we bought this. We weren't even considering Plasma. We are LCD fans, also owning a magnificient Dell 30 inch lcd (2560x1600 over dual link DVI).Per consumer reports, the top models were Sony, Samsung and Sharp. We researched the three and concurred with that. We did not consider Sony at all due to the price factor, being 2-300 more online. The Sony and the Samsung LNXXA550 were very similar in picture quality. The differences if any were too narrow to be practically discernable with the naked eye. The Sharp LC52D64U model we did consider, and almost ended up buying it at about 1600, but then when we saw the LN52A550 being offered here for ~1710 we grabbed it. We researched the Sharp and the Samsung in many BM stores, and the picture quality of the Samsung was much 'truer' than the Sharp. Had this been just at one store we could have attributed that to the settings, but this was the case at more than 2 stores. The Sharp picture seemed 'washed out' compared to this Samsung. If the Sharp had been the only TV in our living room we may not not have noticed this. But the Sharp was a 2007 model and the Samsung a 2008 model, and with the banding occuring in a good percentage of even the D64U series, the Samsung was our only choice. After reading the poor reviews of the speakers of this particular model, we just hooked it up to our 9 year old Music system receiver and the sound is fantastic, even though it is not 5.1.The 650 and 750 series are not worth the price difference, and if you plan to keep the TV facing a window, this model will save you the unpleasantness of a glare. The shiny screen of those models makes sense if you live in cave-like darkness (unless you like a nice glare in your view!). When we saw the 650/750 in BM stores, the 120 hz was barely noticeable (9 times out of 10 viewing situations). With some high action sports there was a slight difference, but we are not sports fans so the difference is not worth it at all.The 5 ms response, 30000:1 contrast ratio, the semi-matt finish and a price in the region of 1700 with a 30 day price match offer on Amazon got us to spring for this model. Get this TV, you won't go wrong.", "Date": "August 7, 2008"}, {"Title": "A550 vs. A650", "Author": "A. Kim \"Happy Owner\"", "ReviewID": "R3LRIEF0J6UWJJ", "Overall": "5.0", "Content": "Purchased LN52A650 from Circuit City and returned it for LN52A550 from Amazon. Since my purchase from Amazon, the price dropped twice and I requested adjustment and received credit for the difference totaling $102. Amazon has a great price and excellent customer service.As far as the TV is concerned, it is absolutely amazing. I'm watching Euro 2008 Italy vs. Spain as I type this and the picture quality is stunning. After experiencing both TVs, there isn't that much of a difference in picture quality between the A550 and the A650 model. In fact, I would say they are equal. The A550 model has less reflection compared to the A650 model. This was one of the reasons why I decided to go with the A550 model (The other reason being the price). The sound quality was horrible when arrived but after adjusting it with the setting recommended in this thread it made a big difference. It is not the best sounding TV out there but it is more than adequate.I'm very happy with my purchase of A550 and the service I received from Amazon. And in the process, I saved over $800 and also received a free HD TiVo with purchase.  Couldn't be happier.", "Date": "June 22, 2008"}, {"Title": "Very Happy Overall", "Author": "J. Brooks \"JB\"", "ReviewID": "R2X95XYDBC70HF", "Overall": "5.0", "Content": "I did a lot of studying of HDTV's before settling on this LN52A550.  Concerns about possible screen burn in, and higher heat/power consumption pushed me away from plasma.  For LCD's, Samsung seems to have the best overall quality for the money right now.Next - which LCD model?  If money was no object, I would have bought the Samsung 52A860 or 950 in a heartbeat.  With a desired budget of $2k or less however, the 860/950's were out of the question.  That left the 550 vs the 650 or 630.  In the end, all of the pro/con arguments about 60hz vs 120hz sets didn't sway me towards the 630/650. For starters, I really don't like the red touch of color on the 650.  After viewing and playing with the 52A550 at a local Fry's store, I decided I wasn't willing to spend another $400-500 for the 630 or 650 (I spent the money I \"saved\" towards speakers instead).  It seems that the 5ms panel of the 550 really helps with concerns about motion blur.  I really don't notice any concerning/annoying issues with motion blur myself. Lastly, I prefer matte screens over reflective ones.I am running this TV paired with an Onkyo 705 and PS3.  The picture of this 550 is pretty stellar overall.  Using the best calibration settings as defined by users on AVSForum, this TV looks STUNNING while playing blu-ray movies on my PS3.  Standard definition tv looks pretty good as well.  I have found however that while using these same settings when playing recorded HD content from my ATT cable service, the content comes across too dark.  I need to work out good calibration settings that work better with my AT&T; TV service.  I've never had to figure out and use different settings for games, movies, tv content before...but once I work them all out properly, it'll be no big deal.Delivery from Amazon was stellar.  It came in 2 days - a happy surprise.  The closest thing to instant gratification (without having to pay sales tax or shipping).  White glove service brought in the tv, unpacked it, placed it on my TV stand and powered it up to confirm it had a picure - it was much as I expected and more than what you get from most online retailers.  This is my 2nd TV purchase from Amazon, both have been good experiences.In the end, having paid $1580 for this 550 PLUS getting a FREE Samsung BDP-1500 Bluray player, I feel like I got a solid deal.  ($200 off Samsung BDP-1500 deal).  Not sure what I'm going to do with the extra Blu-Ray player yet, but it'll come in handy as a second player or as a good XMas present.Overall I'm pleased with this TV.  After about 2 weeks; thus far I can safely report there is no buyers remorse.  Sure, come 3-4 months from now the 630 will probably be the same price I paid for the 550 but thats the way things go when it comes to electronics purchases.  I'm sure this 550 will provide me with years of enjoyable performance, without breaking the bank.  I am giving it 5 stars because the Samsung 550 is still one of the best 52\" HDTV's avaliable today for the money.  Good product.", "Date": "November 30, 2008"}, {"Title": "Worth the money", "Author": "S. Pak", "ReviewID": "R2RQV30YN7MNV2", "Overall": "4.0", "Content": "I had the TV for about one month now. It fits the family's needs.Although I found other Internet vendors with lower price, I chose Amazon for its return policy.The 4/5 star is due to service quality, not on the product.The delivery arrived two days before the scheduled date. However, I had to track down the delivery company via the web search to arrange the delivery. Their initial attempt to arrange a date/time with my wife wasn't clear.  She thought the call was from a telemarketer so she hung up and the caller never made an attempt to leave a return call number!  Furthermore, the \"white glove\" service didn't mean much. The delivery man just put the box in the house and waited for me to sign off. I had to sign off before I could unpack. The driver wasn't willing to help unpack and I wasn't ready to unpack by myself. It's a two man job unless you're willing to lay the box down and possibly risk a potential damage to the screen. So I signed off before checking for damages inside... All was well though.Likes:- Great picture quality- 52 inch fits nicely in the family room- Reduced glare compared to 650 model- Clear picture even from a 1080p up scaling cheapy DVD player via HDMI- Can act as a terrific 1980x1080 computer monitor! Though you need a VGA cable and a PC sound cable- Swirling base allows me to enjoy the full dynamic picture range from various positions- easy and quick way to change the common settingsDislikes:- Sometimes while watching a football game in HD, fast movement comes out as a bit jagged. This is the only time I wish I had a 120Hz model like A650.- Like any other LCD TV's, when watching the TV from an angle, the dynamic contrast is lessened.- TV sound is acceptable, but I think you may need at least a subwoofer speaker connected to audio out to enjoy a movie, if the movie includes explosive sounds.- watching non-HD cable channels. Of course this would be the same with any other HDTV- only 3 HDMI.( Not enough for HD Cable box, Game Console, DVD player, HardDisk based HD media player)Recommended extras:HDMI cable (about 11 dollars via Amazon with shipping) - Mediabridge Ultra-High Speed HDMI Cable - 6ft - Version 1.3b1080p upscaling DVD player. ( *hilips models do a great job for the price: forty to sixty)Black TV stand - I bought a cheapy (again) from B*st B*uy for about 98 bucks. 48 inch stand works well", "Date": "November 28, 2008"}, {"Title": "Nice tv,Nice price!", "Author": "Anthony Ranalli", "ReviewID": "R32HBIIOV5YY9D", "Overall": "4.0", "Content": "You just can't beat this tv for the price. HD picture is very nice and non hd is good. Sound is bearable with the right settings (check AVS forums for audio and video settings)under ln550 link. Very happy with tv and no problems with delivery.", "Date": "June 30, 2008"}, {"Title": "Great TV Overall. Worth the Price!!!", "Author": "R. Nadimpalli \"RK\"", "ReviewID": "R3IW0JBFES09OW", "Overall": "5.0", "Content": "I bought this TV from Amazon a few days ago. CEVA delivered the TV to me 2 days ago well before the delivery commit date. CEVA service is good and I am completely satisfied with the delivery. There is one problem though. I did a mistake by not picking up the Special promo of Tivo DVR at the time of the order. I realised it later and called Amazon. There is a weird and laughable procedure to get the DVR added to my order. Amazon asked me to cancel my order and reorder the TV again with special promotion. I could not cancel the order since the TV is ready for shipping. Amazon representative told me that I have to refuse the TV when CEVA delivers it to me. I asked them why can not I ask CEVA to stop the shipping right away. Why should I wait unitl it is delivered to me. After a few conversations, I called up and asked CEVA not to ship the product to me. CEVA not willing to do it until they get the confirmation from Amazon :-) Again afte a few calls, Amazon asked CEVA not to ship the product. I reordered the TV with special promo of Tivo DVR. I had a problem again. Somehow, Amazon is charging the full Price of DVR at checkout time. Amazon could not fix the issue and they asked me to go a head and order the DVR with price. They gave me the refund later for the full price. In this whole process, getting my TV got delayed more than a week and I got frustrated with the number of calls I made to Amazon.  But in the end, I recieved the TV atlast. Even though there is a sloppy job from Amazon on this issue, their representatives are patient enough and their service is great. They could have done a better job though.  Having said all this, One thing I should say is all my happiness is back after seeing this TV. I did lot of research as any body else and I was debating between 550 and 650 models before I finally decided on 550. I was nervous cause I felt I might have done a mistake for not going to 120 Hz. All those doubts were blown away after I started watching this TV. Picture is absolutely stunning. Sound is not a problem after the suggested AVS Forum settings. I followed the same forum for the Standard mode settings and I could see good changes for the Standard Cable channels as well. HD channels quality is absolutely outstanding!! I feel there is no need of going for 120 Hz with my limited viewing of last two days so far.", "Date": "June 5, 2008"}, {"Title": "Great TV at a Great Value!", "Author": "E. Robles \"Grove226\"", "ReviewID": "R12HVOXHZMC63J", "Overall": "5.0", "Content": "I have had this TV since June. I purchased it and received a FREE TIVO unit as part of a Amazon promotion. After months of reserach and store visitng and standing in front of these things (and countless  \"Im just browsing\" encounters with salesmen, I finally picked this one over the Panasonic  50\" PZ800u (I couldnt get over the price for a 52\"  screen compared to a 50\", lighter set for wall mounting and what I felt were identical contrast ratios and color saturation over supposedly smoother motion)I also picked the 52a50 over the newer model samsung ln52a650 ( I sacrificed some contrast ratio and color saturation here but I couldnt get over the screen glare I was seeing in even the darkest store setups and I knew it would bug me at home as well because Id be looking for it). I should also say that I did not consider the television sound in the purchase (Panasonic 800 and 850 series are THS certified) as I have my set hooked up to my home theatre system and haven't used the TV sound at all. All in all a great purchase From AMAZON with no regrets.Having been to various stores to look at these things,(I went to all the big stores Sears,ABT, best buy, circuit city, Fry's, etc.)and there is no question that you wont get the kind of pricing and return policy on a brand new unopened box TV \"in-store\" that you will find on Amazon.", "Date": "September 6, 2008"}, {"Title": "Great set until the trouble starts", "Author": "Rock'n'RollSteve", "ReviewID": "RPB7YR8IUH6BF", "Overall": "1.0", "Content": "When I purchased this set in Dec. of 2008 I was quite pleased overall but now, 13 months later, there is nothing but frustration with this set and the Samsung company. I woke up one morning and tried to switch on the set to watch the news but it wouldn't turn on right away as per usual. It started making a clicking sound as if it was trying to power up. It finally came on after 4 or 5 minutes of said clicking  but when it did come on the picture had a pink/purple tint to it and the sound on the set was totally out (the built in speakers as well as the audio out RCA jacks). I immediately went to research this problem on the internet and found hundreds of posts from people complaining about the same trouble with a lot of models from Samsung (try it yourself...google \"samsung + power + clicking + trouble\" without the quotes). So far Samsung has been of absolutely no help and they even go so far as to not even acknowledge that there is a problem.Maybe by this point in time they have resolved the issue so the newer models will not be as troublesome but you never know. As for myself I will never purchase another Samsung product.", "Date": "February 3, 2010"}, {"Title": "Great TV at a Great Value!", "Author": "E. Robles \"Grove226\"", "ReviewID": "R12HVOXHZMC63J", "Overall": "5.0", "Content": "I have had this TV since June. I purchased it and received a FREE TIVO unit as part of a Amazon promotion. After months of reserach and store visitng and standing in front of these things (and countless  \"Im just browsing\" encounters with salesmen, I finally picked this one over the Panasonic  50\" PZ800u (I couldnt get over the price for a 52\"  screen compared to a 50\", lighter set for wall mounting and what I felt were identical contrast ratios and color saturation over supposedly smoother motion)I also picked the 52a50 over the newer model samsung ln52a650 ( I sacrificed some contrast ratio and color saturation here but I couldnt get over the screen glare I was seeing in even the darkest store setups and I knew it would bug me at home as well because Id be looking for it). I should also say that I did not consider the television sound in the purchase (Panasonic 800 and 850 series are THS certified) as I have my set hooked up to my home theatre system and haven't used the TV sound at all. All in all a great purchase From AMAZON with no regrets.Having been to various stores to look at these things,(I went to all the big stores Sears,ABT, best buy, circuit city, Fry's, etc.)and there is no question that you wont get the kind of pricing and return policy on a brand new unopened box TV \"in-store\" that you will find on Amazon.", "Date": "September 6, 2008"}, {"Title": "Awesome TV - couldn't be happier with it.", "Author": "Henry Weber", "ReviewID": "RWZ8PHCWJ74C", "Overall": "5.0", "Content": "This TV is amazing. You will love it. It arrived last week and was very easy to install (it was also lighter than what I expected. I was a little concerned of the weight because it was going on a glass top TV stand).The picture quality is outstanding. I had a few friends around on the weekend and they were all stunned by the quality.Some reviewers have commented on the poor sound quality. It's not that bad, but sure, it's not that great. But what do you expect? If you can afford this TV, then adding some decent speakers into the package shouldn't be too much hassle. The TV is designed to look great and clunky speakers on the side would take away from that.I'm a gamer as well and the responsiveness of the screen is fantastic.Overall, I am really satisfied with this purchase. 5 out of 5!", "Date": "August 25, 2008"}, {"Title": "Samsung LN52A550", "Author": "Gerald W. Hough \"Jerry Hough\"", "ReviewID": "R3QDRYG205C6QU", "Overall": "5.0", "Content": "Amazing in every way!!!  Picture quality is just incredible.  I chose the 550 series over the 650 or 750 because they both have a glossy screen that reflects everything.  Lots of windows in the room where I put my 550 and no reflection issues at all.  Also with the 550, I see no ghosting when watching football or the olympics, and the reds are great.  I can't see any reason to pay the extra money for the 120HZ and \"fuller reds\" of the 650 & 750 series.  I combined the new TV with a Samsung HT-Z510 home theatre system (not then available thru Amazon, but $399 at Circuit City)  They work very well together and the sound is excellent.Amazon white delivery service was also just great.  Delivered and set up in 5 days.", "Date": "August 13, 2008"}, {"Title": "Samsung 550 series HDTV", "Author": "Wine Lover \"JD\"", "ReviewID": "R2GDJ5RVNS6N19", "Overall": "5.0", "Content": "My recent purchase of a Samsung 550 series LCD TV has been a fantastic buy. I debated on purchasing the 550 series or one of Samsung's 600 series. After viewing both TV's side by side I could not distinguish the difference. I viewed fast action scenes and could not detect any edge blurring. The 550 performs fantastic in my room that has a great deal of sunlight. Amazon is the only way to go. They had great pricing, very professional delivery, and the TV showed up at my house in half the time they promised it would. I'm very pleased with the product.", "Date": "August 5, 2008"}, {"Title": "A Very ImpressiveTelevision", "Author": "Robert M. Guzman", "ReviewID": "R2M10M4RAKNXAX", "Overall": "5.0", "Content": "I've had the television (Samsung LN52A550 52-Inch 1080p LCD HDTV ) for a while now, and I must say it's the best TV I have ever had. The first time I saw a Samsung LCD TV was at my Son's house. The clarity was so impressive and the colors so crisp and clear that I decided right then, I had to have one. One thing I did do was to obtain a DVD that instructs you on how to properly set up the TV. It comes with some colored filters to maximize the colors and contrast as well as clarity. To sum it up... The Samsung LN52A550 is well worth the money. You won't be disappointed!", "Date": "July 23, 2008"}, {"Title": "Best LCD TV in that Price.", "Author": "Rohit Gupta \"RNA\"", "ReviewID": "R2WTVBZWHLDEOM", "Overall": "5.0", "Content": "I was deciding between Ln52a550 and Ln52a650. When I compared both the TVs side by side, they look 98% identical to me and $500 is a big amount for just 2%. And I also got PS3 with that savings. And Amazon is always the best.", "Date": "July 23, 2008"}, {"Title": "Stunning picture", "Author": "T. Bui \"moneky\"", "ReviewID": "R22XNLE1R4ZUT7", "Overall": "5.0", "Content": "A Great TV , picture contrast is the best on the market.  very bright, however, the sound quality is absolutely horrible.  For a picture this good, I think Samsung should improve on the sound quality.", "Date": "July 17, 2008"}, {"Title": "Save some money", "Author": "Jim", "ReviewID": "RY75Q5TMU7HLF", "Overall": "5.0", "Content": "1200 dollars cheaper than the newest generation Samsungs. Great picture, any improvements with newer models are probably not worth the extra money.", "Date": "July 14, 2008"}, {"Title": "Fantastic Television!!!", "Author": "B. Polacek", "ReviewID": "R3O4BERWN35U0Z", "Overall": "5.0", "Content": "We've had our Samsung LN52A550 52-inch 1080p LCD HDTV television for 2 weeks, it is fantastic. The sound was not the greatest so we purchased a $200.00 (low end) sound system which improved it dramatically. Our friends who have a Vizio did the same thing. We upgraded our Direct TV dish up to HD, an absolute must!!Amazon was the best to work with. I was hesitant to order something like this over the internet so I called them, they were so helpful. Had no problems with the shipping company, they were very accomodating and delivered the day they said they would.I would highly recommend this television and ordering it thru Amazon to anyone in the market.", "Date": "June 29, 2008"}, {"Title": "Samsung 52\" LCD HDTV", "Author": "PK", "ReviewID": "R3KISCAM28D46Q", "Overall": "4.0", "Content": "I would recommend this TV for anyone looking for LCD HDTV with less than 2000 budget. It has great picture and three HDMI inputs. For this price range this is the best LCD HDTV i have seen.", "Date": "June 25, 2008"}, {"Title": "Awesome!", "Author": "S. Alpert", "ReviewID": "R1Y4JWEFEROVR3", "Overall": "5.0", "Content": "I did a lot of research by going to local stores and reading reviews. This TV has an extremely sharp picture that rivals TV sets costing $800 more. Once I adjusted the sound (which made a significant improvement), I bought the Amazon suggested Pearless tilting mounting bracket & hooked it up to my stereo system. I had considered the 46\" but for less than $300 more I got the 52\"...I could not be happier with my purchase!", "Date": "May 30, 2008"}, {"Title": "This is it!!", "Author": "Amazon Customer \"atarik\"", "ReviewID": "R1APFQRF2BOC0M", "Overall": "5.0", "Content": "I found this TV after I ordered Samsung LNT5265F which is one year older version of this TV. Definitely canceled even though I have to pay return shipping fee. ($56) That was the right decision. The picture quality is great as much as expected with 30,000:1 dynamic contrast ratio and 5ms response time. CEVA did good job on delivery. They arrived on time scheduled. They opened the box to check if any damage on the product and put it on the right place. I set sound and picture fallowed by setting on the other review above. Seems working great. DVD up-scaling player working great with HDMI cable. My PS3 will be arrived tomorrow as the Blue-ray full HD disk player. Excited!! Highly recommended for the price and quality.", "Date": "May 13, 2008"}, {"Title": "Agree with all the info above! Awesome TV but...", "Author": "A. Mccormack", "ReviewID": "R12KGDK8JHU3WV", "Overall": "5.0", "Content": "This TV is fantastic as all have stated above... however a few things that are frustrating:#1 - The TV only has one tuner built in - which means PIP only works when switching from other inputs.  My old Sony had 2 tuners which was great for sports games and movies etc... I assumed without reading details this new TV would automatically have it.#2 - Remote Control has more difficulty upclose but great range from a distance - maybe its my inability to point correctly...Other than those simple items - this TV is awesome!", "Date": "April 28, 2008"}, {"Title": "Alex", "Author": "Alex Mezhibovsky", "ReviewID": "RECYO60O6RTRN", "Overall": "2.0", "Content": "If you need Close Caption (CC) feature, then you have to pass on this TV as well as all Samsung line - for some reason they do not support CC for HDMI and Component inputs, but only for AV input. Some cable boxes have CC feature, but it was not adequate substitution - very few channels are supported and it is out of sync with video (I have Comcast). I called Samsung customer support and was told that it is by design.I still wanted to keep this TV, because picture was good. But in three weeks it stopped working because of power supply failure. I called Samsung customer support - they said that technician will be dispatched to my home in two weeks only.So, considering both above, I decided to return it back to Amazon. Amazon handled it well despite it is a big item and shipping is not cheap.Bottom line - Samsung TV and service was not good for me, but Amazon is great.", "Date": "September 7, 2008"}, {"Title": "Superb TV, superb delivery, superb price", "Author": "E. Adamy", "ReviewID": "RL1S8SFRLJTWV", "Overall": "5.0", "Content": "We purchased this TV for lounge area in MBR. We agonized over 46\" versus 52\" and are extremely happy that we opted for the 52\". The picture is wonderful and the swivel base allows us to angle TV to either sitting area or bed. Very happy that we opted for the matte screen rather than the polished screen on the 650 and 750 as our room is very bright. We paid $1809 which was a very fair and competitive price at time we ordered and received $100 credit when the price dropped four weeks later (within Amazon's 30 day price protection window). We are in remote area of NM yet the set was delivered and setup in just 4 days.", "Date": "July 18, 2008"}, {"Title": "Horrible service from Samsung", "Author": "Dileep Koneru \"DKoneru\"", "ReviewID": "R3P8D3E66ISLSH", "Overall": "2.0", "Content": "My sister purchased this TV and in 2 months itself, they had some problem with the TV and it suddenly stopped working. There the real story started.....They had to deal with the most horrible customer care ever heard----Samsung's customer care...They kept the TV for 3.5 months just for repair....not for REPLACEMENT.....Seriously, the customer care of Samsung should improve atleast by 200 %..", "Date": "July 12, 2008"}, {"Title": "Excellent picture, great sound, wonderful bargain.", "Author": "Trevor Selle", "ReviewID": "R1VAWKXLJX68PO", "Overall": "5.0", "Content": "This TV is wonderful, my first generation HD-ready CRT RPTV finally bit it.  I wanted to wait for the full digital switchover to occur before I bought my next tv, but it was not meant to be.  After much research I chose this unit as it has a wonderful price/performance ratio among the top tier, 1080P candidates.  I was looking for a good 50ish inch tv going into a very bright and sunny room for 70/20/10 TV/xbox/movie duty.  $$$ / square inch cost of this unit is excellent, not much of a surcharge over the 46 inch unit which is nice.  I did the audio and video tweaks outlined in AVS forum, the tv is just plain awesome.", "Date": "May 2, 2008"}, {"Title": "Defective product", "Author": "kcat", "ReviewID": "R3RNJD3UL1D1NC", "Overall": "1.0", "Content": "Most of the reviews on the product are pretty good because they were written soon after the purchase. The problem is that there is a very common defect known as powercycling that hits these TVs in one to two years. In my case the TV stays on for about half an hour and then clicks on and off repeatedly by itself. There are thousands of complaints cropping up all over the internet about this issue. I purchased mine as an already two year old refurbished unit and so it never worked from day one. It is under warranty so I called Samsung which exhibited pretty pathetic customer service. For the first two phone calls they played dumb and suggested various plugging and unplugging techniques. After I did more searching online and learned how prevalent the problem is I spoke to customer service again and called them out on it. Now they said they will send someone to come by and fix it. We'll see. I would not purchase a Samsung TV again.", "Date": "July 18, 2010"}, {"Title": "Don't Buy", "Author": "Rob", "ReviewID": "R1UXTCRQ5GDMYY", "Overall": "1.0", "Content": "Do not buy, Only worked for 18mo and now won't turn on. class action suit on Samsung coming soon.", "Date": "July 3, 2010"}, {"Title": "Warranty Service Stinks", "Author": "Caveat Emptor", "ReviewID": "R2CN69BNBTTNJ1", "Overall": "2.0", "Content": "The vast majority of the reviews I read about this model were accurate: great picture, ok sound, nice features, etc. Unfortunately the model was too new to reveal its reliablility problems. Mine failed after 5 months of use and Samsung Warranty Services has been useless in resolving the problem. They referred me to a service center 60 miles away from me (I have now found one 10 minutes away - wish me luck) and these guys had my set for 6 weeks before claiming that they couldn't duplicate the problem??!!! They SAW the problem in my house, took it and then sat on it for 6 weeks. I called Samsung customer (dis)-service and they did nothing for me. The phone rep said it was between me and the repair company. I tried explaining that the repair company didn't know what they were doing after 6 weeks of futility, but to no avail. I can understand that things break, but the lack of warranty support from Samsung was absolutely amazing considering it was a nearly $2000 purchase. Go ahead and buy this TV, but pray that it doesn't break.", "Date": "June 5, 2009"}, {"Title": "Bad Delivery Damaged TV", "Author": "Patrick F. Hart", "ReviewID": "R255HDMQVT8DFP", "Overall": "2.0", "Content": "We ordered this product, in part, because of the free \"white-glove delivery\". The \"white-glove delivery\" consisted of one guy dragging this 52\" LCD TV out of a van, across my dirty driveway and up two flights of stairs. I was shocked!!! The delivery order stated \"two-man delivery\" The TV works but shuts off and then comes back on by itself. Amazon is sending another one. The delivery company is called Pilot Freight. I called them to complain, hopefully they will send two people this time!!!", "Date": "February 2, 2009"}, {"Title": "Was a good tv till year 5", "Author": "B. Patterson", "ReviewID": "RN4TR6EXIR2N1", "Overall": "2.0", "Content": "I have had this tv for about a month. Purchased from Amazon sold and shipped by Amazon.  They had a great price. I had a great experience with them.  The delivery date was set at a week and a half, recieved it in five days.  They also have great customer service, answered and resolved issues(created by myself).  Great set, was considering the 650, I did some reading of reviews and ratings.  Found that I did not think that the $400 more was worth it.  The 550 has a great picture, and plenty of features.  The only differences, I found, between the two are 30000 to 1(550) vs 50000 to 1(650) contrast ratio.  5ms(550) vs 4ms(650) response time.  60hz(550) vs 120hz(650).  I have seen there is already a higher hz level availible.  And the toc option (red color around frame).  I had considered paying the higher price tag for the higher contrast ratio.  I glad I did not because the 550 does a great job with the 30000 to 1 and the 5ms response time.  Very colorful and bright picture.  I now have extra cash for wall mount, and book shelves.  Highly recommened television and seller!UPDATE The tv now only power cycles. Samsung said there were undersized compositors and power supply module. They covered to replace at no charge, it was done by a tech at my home. It did not work and now the tv is estimated to be a $350 repair, that does not guarantee to be the fix.  Samsung will not do anymore, so it is now garbage and looking for a replacement.  I will never buy a Samsung product again.  I thought a $1500 tv should last a bit longer.", "Date": "December 12, 2008"}, {"Title": "Great TV", "Author": "Yeast Man", "ReviewID": "RBLJMON5F6675", "Overall": "5.0", "Content": "I had no problem with the tv. It is great so far. Glad I went this route and saved a few hundred bucks on taxes. The only issue was the delivery. This company used a delivery service CEVA. If you track your shipment you can actually schedule to get your product sooner. I found this out by tracking my shipment and calling the place. They gave a 4 hour window, and was 30 minutes passed the 4 hour window.", "Date": "November 4, 2008"}, {"Title": "Amazing Picture Quality and Value for your Money", "Author": "FunShop", "ReviewID": "R2T7QIJOAC45BX", "Overall": "5.0", "Content": "After only two weeks of ownership, I had to write a review and let others in doubt know how amazing the picture quality is on this TV.  Never having been a fan of LCD TVs, I have been in the plasma HDTV camp for about 5 years.  After purchasing 3 Panasonic Plasma TVs (including the 65-inch TH-65PX600U monster) and one Samsung 50-inch plasma, I saw my parent's Samsung LCD and was blown away.  Now, even their model is blown away by this one in picture quality.After applying the settings found on the AVS Forums, the picture on this TV is amazing.  I've really become a Samsung LCD lover now.Also, the delivery by CEVA was not too bad.  I got it one day early.", "Date": "August 14, 2008"}, {"Title": "Sweet HDTV For The Money", "Author": "shy", "ReviewID": "R2U3Y9AKOMDCNG", "Overall": "5.0", "Content": "I've been lusting after a HDTV for years and after getting some money back after closing the construction loan on my new house, I decided it was time to get one. After throughly researching 50+ inch LCD TVs in my price range, an older discontinued 52inch Toshiba REGZA was the only one that really appealed to me. But when it arrived three weeks late and damaged, I decided against having a replacement TV shipped to me (which would likely be shipped and delivered by the same morons who broke this one) and asked for a refund. I went back to researching TVs and eventually decided on the Samsung from amazon. The specs were better than the majority of others I'd looked at and it was $172 cheaper than the REGZA I was returning. Plus, it came with amazon's white glove service, which I would have gladly paid more for after what I went through trying to get the REGZA delivered and returned.The guys from Eagle called me the day before they arrived to set up a time to deliver and then arrived 15 minutes earlier than expected on the delivery day. They unpacked the TV and asked where I was going to put it. I explained that my dad and I were in the process of repairing one of the legs on the TV stand when they arrived or I'd have had them put it on the stand, so they set it up on the floor. I looked over the TV while one of the guys put the batteries in the remote so they could make sure it worked. The TV came on so we knew the remote and the TV worked. I've read good and bad things about Eagle's delivery service in other reviews, but I have nothing but good things to say about them. They were very professional and I wouldn't hesitate recommending them to others based on this experience.I've heard the original Xbox doesn't look as good on a big HDTV like this, but I have to disagree based on my experience. I've been playing Dead Or Alive 3 and the gameplay looks and sounds great. I knew there was a game mode, but hadn't read the manual enough to find out how to get there, so I just played in standard mode. My Wii was still connected to my 26-inch Vizio LCD at the time, but I didn't feel like disconnecting it and setting it up on the Samsung, so I decided to see how it looked with movies.I had an old Cyberhome DVD player I'd been given after installing a new DVD player over the weekend, so I borrowed some RCA cables and set it up... I'm in the process of moving so the majority my A/V cables and equipment are in boxes, at my old residence, or in use at the new house. Again, I've heard regular DVDs don't look very good on a big HDTV like this, but I have to disagree based on this experience. I popped in The Matrix and skipped to the \"I Know Kung Fu\" scene. It played beautifully, apart from a few skips which had to be the player because it was brand-new-just-opened DVD. It was during this scene that I switched between the various modes and noted that game mode was a bit brighter than the standard and cinema modes. After the Neo/Morpheus fight ended, I ejected the disc and put in a Philips DVD cleaner disc to run the cleaning program, knowing the DVD player lens probably hadn't been cleaned forever. Once it was cleaned, I popped The Matrix back in and selected the \"Lobby Shootout\" scene... one of my favorite movie scenes to test how well the display can process and render the scene because of all the bullets and debris flying around. I got chills watching the action unfold onscreen and thinking if it looked this good with just the standard RCA cables, just imagine how awesome it'll look with an HDMI connection on an upconverting DVD player (which will arrive any day now), Xbox 360 Elite (which I'll probably buy this weekend now that I have a nice big HDTV to play it on), and eventually Blu-Ray. I continued watching and when the sentinels start attacking the ship, there is a close-up of the sentinels that looked better than I remember it looking. Have watched a few other movies since its arrived and they've all looked really good. One movie didn't look quite as good as the others, but it was cheap B-movie where the production values weren't much to begin with. Movies on the upconverting DVD player look awesome, especially movies with high production values and movies from the major studios.Finally had a chance to test the Wii on the TV over the weekend and it was sweet. The biggest problem was figuring out where to put the sensor bar for the best control. Played House of The Dead 2 and 3 Returns and a pinball game my roommates gave me for my birthday. The colors and flashing lights on the pinball game were bright and colorful while the bigger screen made the different environments in HOTD feel more expansive. Bought a 360 Elite for the TV and games looks sweet as well.I haven't messed with the colors, hue, contrast, and other settings, but so far, the flesh tones and colors look great right out of the box. The various picture modes are fun to play with depending on what you're in the mood for. Full-frame DVDs fill the screen while widescreen DVDs have the usual top and bottom bars, but you can use the 16:9 zoom mode to have it fill the screen. I love widescreen movies, but its been fun to watch widescreen movies in 16:9 zoom mode.HD and SD channels look great, though obviously HD channels look better than SD channels, but SD is still watchable.Right now, I'm inclined to give it 5 stars. I bought it mainly for video games and movies, both of which look and sound great.", "Date": "August 6, 2008"}, {"Title": "Absolutely Stunning Picture Quality", "Author": "DM \"DipM\"", "ReviewID": "R1T3EXUGRX7DMJ", "Overall": "5.0", "Content": "Picture absolutely stunning. Vibrant colors, crystal clear HD output. Even SD Channels are nice. All I have is ordinary Philips VHF/UHF Antenna  I got from RadioShack and I am able to receive plenty of free-to-air HD Channels. The only issue sometimes I face is remote not responding promptly when I click buttons. I have to move my hands here and there especially Volume button to make it work. I think a decent Universal Remote Control will solve this problem. Other than that its absolutely gorgeous. Really Love this set.", "Date": "July 16, 2008"}, {"Title": "Samsung is the Best", "Author": "J. Morrow", "ReviewID": "R1V4GX6E3XSSSR", "Overall": "5.0", "Content": "Samsung LN52A550 52-Inch 1080p LCD HDTVI can't beleive this TV. The picture is perfect and the colors are out of this world. I would recommend it to anyone looking. And the price was unbelievable. Prices else where it was almost $500-$1000 more.", "Date": "July 5, 2008"}, {"Title": "HDTV  Great", "Author": "J. Frease", "ReviewID": "R16IOP86C2VQQT", "Overall": "5.0", "Content": "I bought a 52 inch Samsung HDTV from Amazon.com and it was a great deal after I compared it at local stores. Delivered right into my house a few days before they said it was to be here. Am looking for another one for bedroom and will be checking with Amazon.com often!!  Thanks again.", "Date": "May 27, 2008"}, {"Title": "A couple things to know...", "Author": "Brian Brodnick", "ReviewID": "R24M6BQS8591XE", "Overall": "5.0", "Content": "I recently bought this TV from Amazon.  It is simply awesome! Great picture (way better than I expected).  I visited Best Buy and CC a couple times to look at it and I thought the picture was 'average'.  Once I got this home and hooked up some HDMI cords (which I also bought online at amazon), the picture was absolutely amazing.  Watching nonHD sources is not awful, but it is amazing to see the difference.Couple things to share:1. Buy your HDMI cables online and early.  Dont spend $40-60 in a store when you can get decent cable online for under 10.2. Call CEVA as soon as you get a tracking number to schedule your delivery.  If you wait they will send you a letter basically saying that you need to call them.  This will take several days away from your viewing enjoyment.3. Surround sound is a must!  The speakers are not good for anything other than watching TV late at night when you dont want to wake anyone up.  Watching a movie with nothing but the TV speakers would be torture.", "Date": "August 17, 2008"}, {"Title": "Amazing Television", "Author": "J. Baumgardner \"swat16\"", "ReviewID": "R3TWMY2C8G5GJI", "Overall": "5.0", "Content": "I bought this TV after reviewing various televisions for months.  The picture is amazing!  I had read about glare problems with older models but I have this TV in a bright room with absolutely no problems.  I don't understand anyone that buys a tv this expensive and doesn't have it hooked up to surround sound.I would recommend buying the TV from Amazon and not another company thru Amazon.  Two days after I ordered from Amazon, they dropped the price and offered a free Tivo HD box.  I called Amazon and they shipped me the Tivo and credited me the difference no questions asked.  Since I couldn't use the Tivo with satellite, I sold it on Ebay for $198.  Amazon has credited me $100 so far.", "Date": "June 15, 2008"}, {"Title": "Fantastic TV", "Author": "J. G. Crawford \"Jack\"", "ReviewID": "R31F4GW2TQPH2", "Overall": "5.0", "Content": "I was going to purchase the LN-T5265F but was concerned about the glossy screen reflecting light so when I saw that the LN52A550 had the matte finish screen with the contrast ratio twice that of the 5265F, I realized I had found my TV. Amazon even delivered the set 5 days earlier than stated and the white glove delivery is wonderful. The picture on this set is outstanding! After adjusting the picture to my liking, I played a regular DVD movie through my Samsung DVD-1080P8 upconverting player and I was blown away at how great the picture was. I use my stereo to play the audio in Dolby Digital 5.1 and it really makes the whole viewing experience that much more exciting. This set is every bit as good, if not better than any Sony LCD TV and lower in price too. GET THIS TV!", "Date": "May 13, 2008"}, {"Title": "Defective TV model", "Author": "Tae Sik Han", "ReviewID": "R2EDTNU0H4Z8MC", "Overall": "1.0", "Content": "This product is defective and Samsung does not want to fix it. I bought it on August, 2008 paying $1,829. It did not work due to blown capacitor on September, 2010. One capacitor was replaced by a free service but again other two capacitors were blown off on one day of March, 2012. Samsung sent a technician to replace capacitors on power board but TV was not turned on. After a week the technician brought a new power board unit but it was a defective one. He found that old power board seemd to work but he told me that main board should be replaced. Samsung told me that they would pay parts but not labor fee. Technician told me labor fee would be $200. I asked Samsung to send me the main board so that I can replace with by myself. Samsung turned down my suggestion since I am not a authorized technician.  I had to spend total 3 days of my vacation days to wait for repair. With such price, it should be replaced with new TV. I can't still believe that 1,800 dollar worth of TV was out of order and does not function at all after 3 years of use. I WILL NEVER BUY ANY SAMSUNG TV DURING THE REST OF MY LIFE and I will not recommend any people I know not to buy any TV made by SAMSUNG and any other electronics by SAMSUNG.", "Date": "March 27, 2012"}, {"Title": "Died today", "Author": "D. DeVito \"astoria\"", "ReviewID": "R3P3GM587EX7NV", "Overall": "1.0", "Content": "Well, today my tv died. it's been almost 3 years for this piece of rubbish. I liked the TV alot but the Tv repairman (didn't know they still existed) came today and said i had a screen panel defect and there was nothing he could do about it. Better off buying a new one. So I paid about $1700 for almost three years worth of a tv. really not worth it in my mind.", "Date": "June 28, 2011"}, {"Title": "Value for money", "Author": "Awinash Jha", "ReviewID": "RRSA9WHNB9A78", "Overall": "5.0", "Content": "We spent a lot on the internet and stores, including Walmart, Bestbuy, CircuitCity etc, to find the best LCD TV for our living room. This is a awesome TV. What a picture quality. even during the day when curtains are open the quality is noticeable. Simply great TV.There is one downside to this model - sound system. You must buy a Home Theater system. We shopped around and got a 1000Watt 7.1 samsung theater system for $170. And now it is really great.Price offered by Amazon was cheapest ( Please calculate total dent on your pocket including shiping and handling).The best part was the shipping from Amazon. The guys called to schedule a delivery. They came upstairs and put the TV on the stand. Plugged the TV to ensure that it worked. What else one could want.", "Date": "March 13, 2009"}, {"Title": "Samsung 52\" LN550 TV", "Author": "Charliebird \"Charliebird\"", "ReviewID": "R1138XMBU1MVCN", "Overall": "4.0", "Content": "I am very happy with the TV - it's awesome.  However, I'm not very happy with Amazon.  The day I received the TV Amazon lowered their price for the TV by $110.  I contacted Amazon and their best advice was to send this one back and repurchase it at the lower price.  When I purchased the TV and talked to their online help, I was led to believe that if the price went down within a short period of my purchase, they would adjust it.  No such luck.  Their policy of absolutely no price adjustments after purchase should be published on their website.  Amazon needs to be more upfront with their customers.", "Date": "February 12, 2009"}, {"Title": "Amazing buy for an excellent price!", "Author": "J. Stahlhut", "ReviewID": "R33APJ3D3WNF2P", "Overall": "5.0", "Content": "After waiting a few years for prices to come down, I've heard that right now is about the best time to buy a HDTV so I went for it.  To get this TV for $1575, no tax and free shipping, I am very happy.  But the true question is... is this TV worth it.  I was definately torn between this 550 model and the 650 model. But with a $400 price difference, slight upgrades in the specs, and the fact that the 550 model has a more matte screen, I chose this TV.  But how does it look...... I'de say pretty amazing.  There are many reviews on here about the picture, but I would rather focus this review on glare... or lack there of.Glare for me was the single most important factor in buying a HDTV.  I instantly ruled out Plasmas, and read that the 650 has a glossier screen than the 550.  I placed the TV in a 25 foot valuted ceiling room, which includes a family room, kitchen and upstairs loft.  This room has 11 huge windows in it, all south facing, two of which have direct sunlight hitting the TV when the sun rises.  So basically during the day, this room is as bright as a room can be... and I have no means of making it any darker.  Aside from direct sunlight on the TV..... this TV has absolutely NO issue with glare.  None whatsoever.", "Date": "January 9, 2009"}, {"Title": "I just LOVE this Samsung TV!", "Author": "Rob", "ReviewID": "RMU8ZJFNJ8SW6", "Overall": "5.0", "Content": "I'm the type of person who does a lot of research before making a purchase like this.  I always educate myself on everything there is to know about an expensive item I want to purchase before making a final decision.  Through all my research, I decided on the Samsung LN52A550 and I couldn't be happier!  My decision making was based on quality, size and price.  I went back and forth between the 46\" Samsung LN46A650 with the 120Hz processor and the 52\" LN52A550 model with the 60Hz processor.  My dilemma was, should I sacrifice having a larger sized TV for a slightly smaller one that has a better quality picture with the 120Hz processor?  Since the two TV's were priced about the same, I wasn't sure which one to decide on.  After comparing the picture quality difference, in several Best Buy and Circuit City stores, I realized that there is such a tiny amount of picture quality difference that I'd go with the bigger picture.  However, one thing to consider about the 650 model.  Though the picture may be very slightly better, it has more glare than the 550 model.  Since glare was an issue for me with my old TV, this also helped me decide on the 550 model.  It has very little glare, especially compared to the 650 120Hz model.My other decision was should go with an LCD or a Plasma?  As soon as I found out how much more energy the plasma TV's use versus the LCD's, that choice was very easy.  LCD is the way to go!  Not to mention how much heat the plasma TV's put off and the fact that a plasma TV can produce image burn.  Since I wanted to play video games on my TV, a TV with the possibility of obtaining image burn was out of the question.All in all, I'd say go for this TV!  You will not be disappointed.  I've honestly done a lot of research and you can rest assure that you will LOVE this TV too!Thanks for reading.  I hope this review was helpful!Rob", "Date": "December 13, 2008"}, {"Title": "Great TV", "Author": "Kenny K", "ReviewID": "R22X2XX00DISA7", "Overall": "5.0", "Content": "Lots of research went into this purchase and I was originally sold on the LN52A650, however for the price of the 550 (which included a blue ray player!) I couldn't pass it up.  A side by side comparison at the local stores had the 650 only slightly better on picture but by itself there is little way to tell.  The extra $500 for the 650 just didn't justify the cost for us.  Matte screen works well in our window friendly living room.  With the swivel base, just turning it slightly solves any glare issues.  Picture is fantastic in HD and outshines the old Toshiba rear projection HDTV we had.  Delivery was quick - 2 days earlier than promised.  They unpacked it and made sure everything worked before they left", "Date": "December 10, 2008"}, {"Title": "stunning picture!!!!!!!!!!!!", "Author": "Vicki L. Young", "ReviewID": "R1DSCY6J6XQFY8", "Overall": "5.0", "Content": "we are absolutely satisfied with this purchase! would recommend it and the shipping was excellent, the packaging and set up was a breeze. the quality and sound are awesome. we would have paid over 2200.00 in the store here so we saved tons of money purchasing this with amazon.com!", "Date": "November 1, 2008"}, {"Title": "Incredible picture", "Author": "Larry D. Wolfgang \"Wolfy\"", "ReviewID": "R2GT6H56M0IQ5Z", "Overall": "5.0", "Content": "I did the research and ordered my Samsung LCD from Amazon because they offered this item at a great price with free shipping.  It arrived within two weeks and I am delighted with the picture quality, clarity and ease of use.  Samsung made impressing my wife with the A550 easy.  One complaint, I wish the remote control sensors were on the upper portion of the panel instead of the lower right corner to better pick up the remote signal.", "Date": "October 29, 2008"}, {"Title": "very pleased", "Author": "M. Dalangin", "ReviewID": "R29ZXOJ2N00ZZ7", "Overall": "5.0", "Content": "I upgraded to this Samsung HDTV after a full year enjoying my SHARP LC-42D64U.  I wanted to get LC-52D64U, but I was scared I would get one that has banding.  I've been fully enjoying this Samsung HDTV for a couple of weeks now and it's just awesome.  I followed some calibration settings from avsforum.  Also, I can't complain about the sound for this tv since I have an Onkyo TX-SR705 receiver for my 7.1 surround.", "Date": "September 29, 2008"}, {"Title": "Breakneck delivery! Glorious picture!", "Author": "M. A. Velez", "ReviewID": "R228KO1FWOMDR5", "Overall": "5.0", "Content": "I ordered my Samsung on Sunday at 11:40pm. It shipped on Monday morning. Received a call on Thursday confirming delivery for Friday. I received it Friday at 12:30pm. Plugged in PS2 Guitar Hero: Aerosmith through S-Video and it looked amazing. I plugged in my Home Theater/DVD player through Analog, and I was extremely surprised at how great \"King Kong\" looked. My sofa is twelve feet away from the LCD, but it looked flawless. Then I got a Mediabridge 1.3b HDMI cable($7) and plugged the Home Theater/DVD through HDMI. Glorious picture!!! I watched \"Live Free or Die Hard\", and it was perfect. I even got three feet away from the LCD and the resolution looked perfect. But I know I will never watch it from that close. I can't wait to see what it looks like when I get a Blue-Ray player. This LCD is GREAT. The transparent menu is NICE!!! I believe the sound is pretty descent once you tweak it, but I use my 5.1 Surround always. I'm very happy to have it hanging on my wall like a piece of art, and very pleased that Amazon came through every step of the way. It was a peaceful transaction.", "Date": "September 28, 2008"}, {"Title": "Great TV for the price", "Author": "L. Nosan", "ReviewID": "RQ2LUSAZL8UG2", "Overall": "5.0", "Content": "After several weeks of researching different brands of LCD flat screens and reading reviews, I decided to buy this one.  I just happened to read a review about Amazon and am VERY glad I did.  Their delivery service was superb and I ordered the TV on a Sunday and had it in my house on Tuesday.The TV is more than I expected, it has a great picture and was very easy to setup.  I plugged it in and it did the rest.  I have enjoyed the \"easy to read\" menu and the host of color and sound settings that allow you to set it up exactly how you want it, however, the default settings were just fine too.I highly recommend Christopher Nichols review on how to set the sound settings, once I did that the sound was 100 times better.My son plays XBOX 360 with his buddies on Live and the picture makes you feel like you are actually in the game, it's unbelievable!!Great purchase and I will tell all my friends and family to look at buying Samsung and using Amazon for their purchase.", "Date": "September 20, 2008"}, {"Title": "Awsome TV", "Author": "P. Galassi", "ReviewID": "R1DP1R7AQ2XIIF", "Overall": "5.0", "Content": "I have to say, the delivery from Amazon was very professional. TV works great on HD channels. HD attenna was purched to take advatage of the HD channels. Samsung Blueray and this TV gives the veiwer a stunning movie expierence. I would reccommend this TV for the price and value. This TV delivers eom.", "Date": "September 18, 2008"}, {"Title": "best price", "Author": "basscat", "ReviewID": "R1U5E0F82NBS2J", "Overall": "5.0", "Content": "After shopping around, Amazon had the best price for this product. We like the TV but agree with everyone else about the sound quality.", "Date": "September 14, 2008"}, {"Title": "TV set from Amason reveiw", "Author": "Robert L. Bishop", "ReviewID": "R3F1LR9XBVBZVR", "Overall": "5.0", "Content": "Good service from supplier, both the shipper and Amazon, and satified with the 52\" Samsung TV", "Date": "September 14, 2008"}, {"Title": "Finally made the JUMP", "Author": "dbowen12900 \"deal searcher\"", "ReviewID": "R1135DFEJ39PRJ", "Overall": "5.0", "Content": "After researching TV's to death we finally settled on this one and we just love it.  We have not regretted it for one second.  For those who have been reading and reading for ever, stop and just make a decision already.  A great TV for a great price.  Adorama and Amazon are the way to go.  We were very skeptical about  making such a large purchase over the net. but WOW, talk about saving money and they deliver.  Shipping was fast and product was new and in perfect condition.  Highly recommend this item and this site.", "Date": "September 14, 2008"}, {"Title": "Samsung Satisfied", "Author": "plh", "ReviewID": "R10QAOTBOBVA3G", "Overall": "4.0", "Content": "Samsung LN52A550 52-Inch 1080p LCD HDTVNice clean look to the TV. Excellent picture. Fair sound improved with an auxilliary sound system. Haven't been able to get the PIP to work but otherwise very satisfied.", "Date": "September 8, 2008"}, {"Title": "Paid over $2k and the TV only lasted 5 years!", "Author": "Bryant Orr", "ReviewID": "R1ITDYX7SWQPO1", "Overall": "1.0", "Content": "It now has a thick line down the middle which could be caused by one of two things according to a repair service.  Either the the T-com is bad which will run approximately $350 to repair or the Panel is bad which is around $900.  Either way, with TV's having dropped so much in price it just doesn't make sense to repair it.  I will buy a new TV, but it won't be a Samsung. I expect to get more than 5 years out of TV.", "Date": "July 8, 2013"}, {"Title": "Samsung products do not last!", "Author": "Won't buy Samsung products again", "ReviewID": "R2RFRGFZD9840B", "Overall": "1.0", "Content": "I have owned this TV for 4 years. I have never written a review before, but after the problems I have had with Samsung products I just had to. This TV was great while it lasted, but it went out last night. A repairman came to fix a recall on the capacitor but it still doesn't work. I also have a Samsung washer that I have had for 2-and-a-half years that went out twice. It works intermittantly. I bought Samsung because I wanted quality products. I also own a fridge, dryer and a printer by Samsung. I paid for the extended 2 year warranty on the washer and a 3 year on the TV. Conveniently they both stopped working after the warranties expired. My experience with the company has been painful. I will never buy a Samsung product again, and would highly recommend you do not buy their product either. Although they are great while they work, their products do not last. Nothing like buying disposable, thousand dollar products. Save yourself some money and headaches and by a different manufacturer. I am sitting by waiting for my other products to break. They are getting old. At least 3 years!!!!", "Date": "December 19, 2012"}, {"Title": "Died 3 years from Aug 2008 manufacture date", "Author": "Lap Tran", "ReviewID": "R3GFEN1E9AIY0P", "Overall": "1.0", "Content": "I had purchased this tv back in Nov 2008. The manufacture date is Aug 2008.It died Aug 14, 2011. The right half of the screen alternates between flickering and displaying vertical green and red bars.The warranty is only one year from the date of purchase. Random tv repair guy gave a quote of $340 to repair some faulty board.", "Date": "August 16, 2011"}, {"Title": "Beware buying this TV.", "Author": "David Nox", "ReviewID": "R1LWPZ3PG0T72G", "Overall": "3.0", "Content": "I purchased this TV in may of 2008.  Tryed to turn it on last week and I just heard clicking like it was trying to come on.I read on the internet that many people had the same problem with these TVs. The problem is they were built with the wrong Power supply capacitors.So 2 1/2 years later I took the chance and called Samsung. They ran my serial # and they said yes my TV was one of the ones known to have the problem.They sent a TV repair person out and fixed it for free. It took him 10 minutes to open the back unplug the board and replace it.It's working fine now. My TV repair person told me he has been fixing these TVs with this problem for 2 years at least.So far after the repair with the upgraded capacitors he has never had a call back. So it should be okay now.If Samsung didn't cover this repair (The warranty expired 1 1/2 year ago) it would havecost 200-400 to repair it. I understand this are guides on the net showing how to solder and repair it yourselfbut you are better off try to get Samsung to fix it if you can.", "Date": "November 15, 2010"}, {"Title": "Great TV with one minor annoyance...", "Author": "Matthew Keough", "ReviewID": "R26RO68901W6XG", "Overall": "4.0", "Content": "I have owned this TV for several months, and definitely enjoy the picture size and quality.  As many people have pointed out, the default sound settings are not very good, but you can improve them by modifying the settings or hooking the TV up to an A/V receiver.  The only problem I have with the TV is when hooked up via HDMI, when I change inputs (DVR to DVD player) or even change channels where the resolution changes (720p to 1080i), there is delay where the screen goes black and a \"Searching for Signals\" message appears. Occasionally during this process is an audible pop.  I don't fully know the reason for this, but after searching on the internet, it has something to do with the \"HDMI handshake\".  Regardless, the solution is to just hit mute when changing inputs.  This can be annoying and detracts from my enjoyment of the TV; that's why it is getting four stars.", "Date": "August 2, 2009"}, {"Title": "Great Buy!", "Author": "mike", "ReviewID": "R3TWU5PDKXEX6E", "Overall": "4.0", "Content": "I purchased the LN52A550 about a month ago. Great product. Alot of LCD buyers wish they would have bought a larger unit after their initial purchase. I had planned on purchasing the LN46A550. I could upgrade to the 52' for a few hundred dollars more. A no brainer. Great color and deep blacks. Great matte finish for no glare in a sun bright room. No regrets.", "Date": "February 26, 2009"}, {"Title": "great value", "Author": "Felix Fidelibus", "ReviewID": "RTFLJ1RJ6BDDV", "Overall": "5.0", "Content": "Since ordering my Samsung, I have nothing but good things to say about it.  The resolution is awesome, the setup was very easy.The whole purchase experience was not difficult at all and the price was amzazing.Make sure when ordering that you also buy HDMI cables ahead of time to ease with the installation.", "Date": "February 9, 2009"}, {"Title": "Excellent TV", "Author": "Sam Sagar", "ReviewID": "R28V6OL6BR438S", "Overall": "5.0", "Content": "I was looking for 52\" SAMSUNG for about 6months. I was considering the LN46A630 as it had 120hz but the screen size was small and 120hz was waste of money in my humble opinion. So I finally decided on this TV.Price:At the time of purchase, the price at amazon.com was the best price I have a seen from reputable seller plus the $200 GC from Samsung made it even sweeter.Shipping:The delivery was thru CEVA and I was a bit worried. The delivery guys were professional. They unpacked the TV attached the stand and set it up on floor as I did not have my TV stand ready at the time. They made sure the TV was working before they left. I also noticed that their truck was half full of all kinds of HDTV's so they must be experienced doing this stuff.TV:It is heavier for a single person to handle carefully. The picture was amazing. The factory settings are OK to get started but try changing the settings and you will get the picture that you like in a few minutes.For the picture brightness, you can change the brightness settings OR change the Power Saving Mode to HIGH setting this will reduce the brightness of the picture and also reduce the power consumption. These is a lot information on calibration settings in the internet for this TV that will give you an idea to get started but there is not much to calibrate as some nerd squads make you think.I am watching this TV at a distance of 10 feet and it is perfect. I have not tried Bluray but the standard OTA signals in 720p and 1080i look amazing. 480 signals look OK but this TV is not built for 480 signals.I am happy with the 60hz. I was into getting a 120hz but after watching the difference between them at a local store, I decided that is is not worth the additional $$$. I would spend the additional money on getting a nice Bluray player. I personally feel that 120hz is more of a hype created by the manufacturers.The sound is OK to get started but I hooked up my Home Theater after a few mins of setting up the TV. It does not do justice to use this TV without a home theater system. I wish Samsung just not include the speakers and give us a price break for the speaker costs.I wanted a Samsung HDTV and now that I have one, I could not be more pleased. Highly recommend this TV.", "Date": "February 7, 2009"}, {"Title": "Samsung LN52A550 Great...but...", "Author": "James Lash \"jlash56\"", "ReviewID": "R2VB4QXSLLDU24", "Overall": "4.0", "Content": "Great quality, only thing keeping it from 5 stars is the lousy speaker quality. If you have a home theater system, not an issue, if not, you may have to do what I did...which was buy one. I do love this tv.", "Date": "February 5, 2009"}, {"Title": "Outstanding picture from Samsung, Outstanding Delivery from Amazon", "Author": "nigelengr", "ReviewID": "R8FJ0GB6HDIVE", "Overall": "5.0", "Content": "Simply put, the Samsung 52A550 is an excellent TV.  I have no worries about potential glare because this is in my basement. That said, this TV has the matte screen vice the glossier \"Clear Panel\" on the 650. After calibrating with DVE (not professional, but good enough for me at least), this set is a sight to behold. If you are seated too close (3-5 ft), you will see blurring during fast motion, but I highly doubt even 120Hz sets would rectify that at such a close distance. The set compared to my other HD LCDs, has a good SD picture but, as expected, HD is where it really shines.  After thinking my FiOS connection looked great, I put in a Blu-Ray movie and was very impressed. Additionally, PS3 and Wii games and activities look great.  I was a little more nervous about the Wii since it doesn't have HD output, but with the component cables (never tested the Composite), things look great. Upscaling DVDs don't look like blu-ray, but do look like HD. Haven't tested VHS tapes to date. For those who complain about the sound...if you are going to spend $1500 and up on a TV, whether it's Samsung, Sony, or any other manufacturer, just spend another $150-$200 on a basic surround sound system.  Even the basic ones will perform well.  I had an existing HT setup, so didn't worry about that.  Yes, the TV speakers are tinny and weak and the SRS (virtual surround) doesn't really work unless you are in a closed off room (open floor plans, need not apply).  You could argue that for the money, you should get premium sound...I just say the price of your set would increase by 25-50 percent, if not more. Outstanding sound in a small package is a challenge and these are TV manufacturers.  You can't convince me that a different manufacturer suddenly has premium sound whether or not the speakers point out or down.Lastly, I was extremely nervous (but the price trumped that) about the delivery service.  I was even more nervous when my email said I had Pilot and not CEVA.  Obviously, I cannot speak for Pilot nationwide, but in the Philadelphia area they were excellent (the set was delivered to Delaware County just outside the city prior to them driving out to my place in Chester County).  The day after I ordered, they called to set up an appointment and gave me an afternoon window.  They showed up during the first half of that window a week after ordering.  Yes, one of the guys looked like he was in a gang before he tried his hand at delivery, but I could care less about that than about the services rendered.  They verified they had the correct address and carried the TV into the house and set it down.  I wondered if that was it when the lead guy pulled out the paperwork from his back pocket, put it back in, and asked where I wanted the TV.  I told him the basement and showed him where it was. No moans and groans about navigating the landing, he just told the other guy where they were going and moved it downstairs.  After expecting due to all the negative reviews that the journey ended there (and being happy it was at least in the basement, they opened the box, lifted the TV up on my stand, connected the cables, turned it on, did the setup, and had me verify and initial the checklist they had (yes, no BS line about it's cold out, so warm up the TV first).  When I ordered my TV, it didn't even have the banner on the Amazon page for White Glove Delivery, or Enhanced Delivery, just Free Delivery.  All I cared about was getting the TV on the stand, but setting it up was a nice touch.  I would have verified it worked anyway before they left, but again, nice that they did it for me.  After a tip for each of the guys (without them waiting around looking like they were lost), they were on their way. No complaints with Pilot (understanding that they aren't the same everywhere).Bottom line, excellent TV by SamsungRidiculous price by Amazon (30% off when I pulled the trigger)Excellent delivery from Pilot (Philly region)", "Date": "February 4, 2009"}, {"Title": "Great TV, Great Price", "Author": "B. Sadler \"ET1(SW)\"", "ReviewID": "R11X16VD7WMFBY", "Overall": "4.0", "Content": "CC was going out of business here in town and I was determined to get the best deal I could on a new TV. They wouldn't budge on an open box LN52A550 from $1600. Although I thought this was a good deal at the time...I just felt I could do better. Christmas came and went, the store closed, and I had not purchased a TV...in fact I was kicking myself for not buying the TV at that 1600 price. I then found the same TV, for 1498 w/ what was advertised as \"free shipping\" and it was out of state, so tax free. I jumped on it. Then through the course of the purchase, I learned that there was a $58 shipping fee. Anyway, besides the horrible shipping conditions, and shoddy delivery service chosen by Amazon, the TV has been great! The picture is beautiful, sharp, clear, bright, and rich. The speakers are on the bottom and back, which take away from it's ability to get the sound out to you on the couch, but they do a good job until you can get a surround system. The controls are easy and comfortable. I don't like that \"TV\" is always selected for a source to view, since I'm not using it should be grayed out like the rest. I am very happy with my purchase and would buy the same TV again.", "Date": "February 3, 2009"}, {"Title": "Samsung", "Author": "Richard Metzger \"Richman\"", "ReviewID": "R3BZP4K1JL3ZRA", "Overall": "4.0", "Content": "No issues with amazon - everything went smoot. Small cosmetic defects with the TV, Amazon custom service was great handling this issue- It was nice talking with and dealing with People as opposed to email customer service like so many other online companies. TV is awesome - have watached many sporting events and action movies in the last month and havent noticed any delay that you read about with 60hz LCD's.", "Date": "December 28, 2008"}, {"Title": "Happy as a clam", "Author": "Ted L. Clark", "ReviewID": "R2V4RKG8JKZCK8", "Overall": "5.0", "Content": "The Samsung 550 52 inch is a good buy.  The picture is the best I've seen on ANY TV (from cable) and it's perfect size for our family room (viewing distance about 9 ft).  I also like the matte finish screen since we do get some reflections in the room. I opted against the 650 model since I don't need the added color on the frame and the extra contrast and inputs.", "Date": "December 12, 2008"}, {"Title": "GREAT BUY  GREAT PRODUCT!!!!!!!!!!!!!!!!!!!", "Author": "M. Johnson", "ReviewID": "R1U6KS7XBVGS6Y", "Overall": "5.0", "Content": "I JUST GOT MY NEW SAMMY AND IT IS GREAT BETTER THAN EXPECTED WHEN YOU FIND THE WRIGHT SETTINGS . I WATCHED WALLI ON BLUE RAY AND WOW ITS AMAZING. THE TECHNOLOGY TODAY WE R VERY LUCKY TO BE APART OF THIS GENERATION OF TVS VIDEO GAMES AND ALL ELECTRONICS. ANYWAY I JUST WANTED TO ADD I UPGRADED TO THIS TV FROM A 42\" 720P PLASMA ALSO SAMSUNG GREAT TV ALSO BUT LET ME SAY MONEY WELL SPENT WITH THE LN52A550 VERY SHARP HIGHLY RECOMMEND!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "December 10, 2008"}, {"Title": "Samsung Ln52a550 LCD HDTV", "Author": "Alex", "ReviewID": "R7GNTWBLH88Y6", "Overall": "5.0", "Content": "Great LCD TV.  Bought this from Warehouse deals for a GREAT PRICE!  There were just some slight smudge marks on the screen border and stand from the stickers that mostly came off with some cleaner.  I also own the LN46a550 and my family and I love both!  Great TV for every day viewing including sports!!!Do yourself the favor and just buy it!TV was delivered via PILOT.  They just brought the TV into the house.  I had to ask them to unpack it.  I inspected it then signed off the form.  They did not wait for me to check to see if it worked or not.  Luckily, everything went well.  NO TIP FOR THOSE GUYS!", "Date": "December 4, 2008"}, {"Title": "Good choice for the money", "Author": "K. Moore", "ReviewID": "R2NX29I0OO9X0", "Overall": "4.0", "Content": "I have owned this television for three weeks.  The picture quality is top notch when viewing an HD signal.  There are two items that have been minor disappointments.  1.  The PIP only works with an analog signal.  I didn't realize this before I made the purchase.  2.  When watching football the image sometimes has a hard time keeping up with the action and you will see a partially blurred picture.  This set is great for watching movies and regular television however.", "Date": "December 2, 2008"}, {"Title": "Samsung  LCD 1080 P 52\"", "Author": "A. falls", "ReviewID": "R3CTBGGGD6TX9Q", "Overall": "5.0", "Content": "Great t.v. Excellent price. No sales tax and free shipping. Very pleased with purchase. Hundreds cheaper than any stores I went to, including COSTCO.", "Date": "November 26, 2008"}, {"Title": "Samsung LCD \"It's AWESOME\"", "Author": "DVols \"DVols\"", "ReviewID": "R3RLIWFOQ7UYMU", "Overall": "5.0", "Content": "I purchased this TV along with the Samsung Blue Ray DVD player and three of the 1.3 HDMI cables offered via Amazon for a very reasonable price. The TV is AWESOME. I did an extensive research on all similare type LCD TV's (52 inch) and have found the Samsung 52A550 to be just incredible. The picture is crystal clear and the hookup process was easy. I was worried about the 60hz vs 120hz and have found that I cannot tell the difference. There are some fuzzy images in the backgrounds on various channels but that is more likely the type of camera used and not the TV. When you go to true HD viewing (ie ESPN, HGTV) the picture is beyond words. Either way, HD or Standard viewing, this TV performs. When I used the Blue Ray DVD player. OMG, what a picture. All in all I am very pleased with this purchase and would recommend this TV to anybody, espcecially for the price. Also, regarding the glare, there is NONE. I was amazed.  As for the white glove dilevery, that was great too. The driver from Pilot Trucking drove to my door, unloaded and unboxed the TV, made sure it worked and took the trash out with him when he left. All in all excellent service. Thanks AMAZON....", "Date": "November 24, 2008"}, {"Title": "Great TV", "Author": "Mike in STL", "ReviewID": "R1RYENURMO3M8A", "Overall": "5.0", "Content": "I chose the LN52A550 becuase it had a non glare screen. The picture is excellent. There is motion blur as with all LCD's but you have to look for it to notice it on this TV. The 5MS response time helps to minimize the effect. If you have a room with windows this is a great choice.Amazon's price was excellent and the shipping company CEVA was on time and made sure everything worked. This is the second TV I have bought from Amazon. Two of my freinds also purchased TV's from Amazon with no problems.", "Date": "November 17, 2008"}, {"Title": "Excellent TV, no complaints", "Author": "A. Pauley", "ReviewID": "R144IGVX5HTXGS", "Overall": "5.0", "Content": "I bought this in May 2008 and could not be happier with my decision. If you are condsidering this TV you may also be looking at the 6, 7, or 8 series Samsung LCDs of the same size. I did not find the faster refresh rate worth the money to upgrade to the 6 series, and one feature I like on this TV that the higher series change is the screen protector. This TV has a typical LCD screen, where as the higher level \"touch of color\" models put a reflective piece in front of it. This is just a matter of opinion, but for day-time viewing there is less glare with this screen.Picture quality is excellent, I play lots of Xbox 360 and watch lots of movies (DVD, HD-DVD, Blu Ray) in full 1080p and the picture is stunning. The other TV I was considering (similar in size/price) was the 50\" 1080p Plasma from Samsung. When it came down to it I got a better deal on this one and that pushed me to this set, but here is what I considered with the plasma-Plasma has deeper colors  (+)Uses more power (although it can be calibrated to help) (-)Plasma has a glass screen=more reflective in daytime viewing (-)If you are looking for an everyday, anytime use TV, this will be a good choice. If you are a hardcore gamer, have a darker room with no windows/low light, then plasma may be the way to go, and if you want to shell out the extra cash, go for a model with the 120Hz refresh rate, but personally I did not find it worth the money.The only complaint I have about this TV is the sound- not so great. My wife prefers to just turn on the TV and watch it (not deal with the receiver, just stick with the basics) and she is not bothered by the sound, but I have it hooked up to surround sound (most of you probably will) and therefore I could care less how the stock speakers sound. I will probably be purchasing a smaller version of this same set later on for regular viewing and move the 52\" into a game/movie room, and at that point the TV speakers will be disabled. Just something to keep in mind if you don't plan on using this set with a surround sound system.", "Date": "November 12, 2008"}, {"Title": "Excellent product and delivery", "Author": "R. ZENG", "ReviewID": "R2FMNBDEXHRM9E", "Overall": "5.0", "Content": "Beside the excellent picture quality, I really like the USB connection. I can put many of my photos on the wall with huge picture frame.The delivery was as good as you get. Two days earlier than Amazon.com estimated. Service guys were very professional.", "Date": "September 11, 2008"}, {"Title": "samsung 52 inch", "Author": "Warren G. Murphyt \"warren g murphy\"", "ReviewID": "R1U7C6Q39GPVLL", "Overall": "4.0", "Content": "I bought the samsung 52 inch lcd tv and i am very pleased with my purchase so far.i would recomend this tv to anyone who hasnt made there mind up.best picture ive seen on a television and so many extra functions.", "Date": "September 11, 2008"}, {"Title": "Fantastic picture for the price", "Author": "Kevin A. White \"Irritated from Atlanta\"", "ReviewID": "R32G34XHBF6DA1", "Overall": "5.0", "Content": "Picture quality is excellent, great value for money. Sound average, but with a screen this size a 5.1 or 7.1 sound system is essential for the full affect.", "Date": "September 10, 2008"}, {"Title": "Great TV!!!", "Author": "Matthew Owen", "ReviewID": "R1WEWDZL8KN9N0", "Overall": "5.0", "Content": "I bought this TV a little over a month ago, and have been extremely satisfied with this purchase.  I was a little concerned because of what others had said about SD broadcasts looking worse than their CRT TV, but I've found that after calibrating the TV, the picture for SD digital broadcasts is just fine.  It does pail in comparison to 720p and 1080i that some stations broadcast, as expected.  Those pictures are simply amazing.  I highly recommend this TV.", "Date": "September 9, 2008"}, {"Title": "Simply Increadable!", "Author": "R. Precourt", "ReviewID": "R41OBP331YV2O", "Overall": "5.0", "Content": "I am very impressed with this TV.  I've always loved the Samsung LCD TVs and feel that they have a much better picture than other brands, but this one is amazing!  Picture is brilliant and has the most vibrant and true colors I've seen.  I enjoy watching TV more than I ever thought possible (and this is my 3rd HDTV.)  I also love having a 3rd HDMI input right on the side as well as USB.  I highly recomend this product and especially recomend purchasing it through Amazon, as I saved nearly $800 overall compared to buying it elsewhere.", "Date": "September 7, 2008"}, {"Title": "samsung LN52A550 52 Inch 1080P LCD HDTV", "Author": "khanh \"Okinawa\"", "ReviewID": "R1RNRSZ4RWZ6U0", "Overall": "5.0", "Content": "My family and I realy enjoy this great brand name Samsung LN52\"A550 1080 LCDHDTV. We have do researched finaly we decided to buy this model.The price is better than local store plus free shipping and handling.  Thank you", "Date": "September 7, 2008"}, {"Title": "Samsung 52\" LCD TV", "Author": "Joni \"Joni\"", "ReviewID": "RIFX96U9E1KIM", "Overall": "5.0", "Content": "Completely satisfied with fantastic picture, price and service. Amazon's white glove delivery was exceptional...delivery service set up and tested TV, they were excellent! I have purchased many items from Amazon over the years, but this was the biggest ticket item; at first I was a little apprehensive, but Amazon has always provided outstanding customer service and delivery. They did not let me down! I highly recommend the Samsung television and Amazon for any purchase.", "Date": "September 7, 2008"}, {"Title": "Just what I wanted", "Author": "Guy C \"g\"", "ReviewID": "R3LW9PYZTECTRG", "Overall": "5.0", "Content": "First time I've ever had an lcd tv, and it was worth the wait. This tv is fantastic for the price. Don't think you can really beat samsungs picture quality, I've done a lot of side by side shopping and this one is the best.  I have very low tech hook ups and don't expect a lot from a tv, but this one really has \"wow\"ed us.", "Date": "August 31, 2008"}, {"Title": "Samsung 52in HD-LCD 1080", "Author": "Marcanthony Salvatini", "ReviewID": "R1HGDYPHXW638D", "Overall": "5.0", "Content": "Great picture; display is awesome. I did a fair amount of research before buying and Samsung is on par with and many say better than Sony. I used Amazon as the best price at the time at any retailer  (Best Buy, Circuit City, etc)was a least $700 higher (1700 vs 2499). That doesn't count the free shipping and no sales tax. Great product, great price. Doesn't get much better", "Date": "August 30, 2008"}, {"Title": "Excellent TV for the price", "Author": "TMF", "ReviewID": "R39BXX2JCDQ41M", "Overall": "5.0", "Content": "I am extremely pleased with my purchase.  I work in video, so I knew the good deal that I was getting with this model, but I was a bit timid about such a large purchase online.  The TV arrived and the freight carrier brought it in and unpacked it for me to check it.  Everything was in good shape, and after the installation the TV is as good as advertised.  The unexpected feature that I like the most is the ability to play a slide show of digital pictures via the USB port.  It's pretty cool.", "Date": "August 29, 2008"}, {"Title": "Fantastic Purchase", "Author": "David Holloway", "ReviewID": "R2KPXDGIE3STL4", "Overall": "5.0", "Content": "Just purchased the Samsung 550 model and couldn't be happier.  The purchase from Amazon went flawless.  Being from the older generation it was a challenge buying something I could not physically see.  I have purchased many things through Amazon of a smaller monetary value and knew they could be trusted.  So I put my fears aside and made the plunge.As I was waiting for my Samsung to be delivered I went back on Amazon's website to get the dimensions to wall mount the tv.  I found the price had dropped $30.  I gave the customer service department a call and true to their word they sent me a refund of the $30.  I know this sounds like a scripted promotion for Amazon but great experiences should be shared.After literally months of research between LCD and Plasma.  The Samsung 550 LCD got my vote for best picture and best price.  Time will only tell but so far so good", "Date": "August 29, 2008"}, {"Title": "Excellent HDTV....Great Value for the Price!!", "Author": "M. zeglen \"Starman\"", "ReviewID": "R2Q1AX6IJCKVSF", "Overall": "5.0", "Content": "I spent months researching HDTV's on-line and in stores, debated between 46\" or 52\" and then came across this Samsung on Amazon.  Besides the tv's specifications and features, the overall positive reviews on this site were influential in my purchasing decision.  Although hesitant to make such a large purchase on-line, I decided to pull the trigger and go with this 52A550  and have had absolutely no regrets!  The picture is awesome.  The images are crisp, clear with vivid colors and dramatic contrast.  The speakers are average and certainly adequate for routine viewing.  The sound can be improved somewhat by tweaking the equalizer function, but is lacking in treble and bass.  However, teamed up with a home theater system, the sound is awesome and the tv speakers become a moot point.  Even the remote is impressive.  Sleek, ergonomic styling with full functionality, large buttons and an optional backlight--nice.  CEVA delivery was flawless. They e-mailed me when ready to deliver and were out the next morning. Very courteous and polite, they unpacked the tv (swivel stand attached), set it up on the stand, made sure everything was in working order and went over all the box contents with me.  Very pleased with all that. Price is excellent.  Same tv at the local BB and CC was $450+ more,PLUS 6% sales tax. Even received a $116.00 Amazon credit from their 30 day (from shipping date) price drop policy! Free shipping and set-up,no sales tax, Amazon price credit----an excellent buy and great value!", "Date": "August 28, 2008"}, {"Title": "Sweet!", "Author": "James M. Mckinney", "ReviewID": "R3CAXIF2X1203P", "Overall": "5.0", "Content": "Love this TV! As with all HD televisions, you really need at least a digital signal to get the best picture. An HD signal is even better. If you don't have either of these, then the picture may actually appear worse than on a tube TV. In other words, if you only have analog cable or a broadcast signal, this TV (and others like it) won't do you much good (except on DVD or other high quality sources). Your situation should improve when broadcast signals go to digital next year.The only things I don't like about this TV are more quibbles than anything else. I wish I could turn off the chimes that play when the TV is turned on or off. Those seem unnecessary to me. The 32 inch Samsung we have allows you to do this, but this one doesn't. Also, I don't see a way to add text to the channels in the list. I don't think this TV has that option, so you either have to know your channels by heart or have a guide handy. The remote doesn't operate a VCR/DVD unless you have a Samsung player with that capability. That option is only on their high-end players, so it's mostly worthless.", "Date": "August 25, 2008"}, {"Title": "Samsung 52 incher", "Author": "Dennis G. Lange", "ReviewID": "R2BU068X5MRAEA", "Overall": "5.0", "Content": "WOW... Great deal. Picture looks awesome. 2008 olympics motion picture looks great. Menu options are user friendly. I pluged in my USB mem stick with pictures to show a Slide show and it worked flawless. Very happy. Shipping was faster than expected... Smooth transaction. A++++++++++ did I mention I am very impressed with amazon.", "Date": "August 21, 2008"}, {"Title": "Excellent TV at a decent price", "Author": "FrogRacing", "ReviewID": "R2VNVQXJ886NOS", "Overall": "5.0", "Content": "This TV works great and it is probably one of the best deals of the moment for a 52\" LCD. The PIP is a little bit tedious to use especially that the main source cannot be the TV but one of the external source (the TV/Cable can only be the sub-picture).The delivery that was supposed to be by 2 people in house, ended up just being a single guy that I had to help to get the TV out of the box. They just turn the TV on and check that we have sound and image and that's it. They also recommend you to keep the box for a month in case you have to return the TV (the TV has to be sent back in the original box). So this delivery service is not that useful.", "Date": "August 12, 2008"}, {"Title": "Awesome new TV", "Author": "Alex J. Serafin", "ReviewID": "RKHUCKR9ZSYN5", "Overall": "5.0", "Content": "I got this TV as an upgrade to a 42\" Samsung plasma TV.  So far, I have loved every minute.  Do not listen to any of the negative complaints about the poor sound.  If you're spending 1700+ on a set like this, then you've probably (or should) have an equally impressive surround system.  This having been said, it is still worth your time to use the sound calibration that is under the reviews.  The display is simply amazing.  I would recommend checking out [...] and searching for calibration profile to get the best picture out of your new TV.", "Date": "August 10, 2008"}, {"Title": "great tv", "Author": "Rich D. \"Rich D.\"", "ReviewID": "R232UA5UJI6ADG", "Overall": "5.0", "Content": "We've been watching our 52\" Samsung for 4 weeks and love it.  Since we tend to hold on to TV's for a long time, I have contemplated the brand and features of big screen HD TV for years and this TV exceeds my expectations.First is the decision over size.  Where we put the TV is not a big room but with all the friends with big screens  I queried, none said they wished they got a smaller TV.  If they were to buy again they'd buy larger!  A 46\" would have been fine but I convinced my wife to go 52\" and it is outstanding to view even at 10 ft away.This set has plenty of hook-ups for electronic gadgets.There are technical measurements of brightness, clarity,  sharpness and picture refreshing.  Take a trip to BestBuy and check out all the competition.  I did and this set is second to none.  Also remember, it won't be long and another generation of TV's with better numbers will be out, so just buy it now and enjoy it.You must do your homework to see how much more HD TV is going to cost you per month.  In my case by bundling tv, internet and telephone with Comcast, it is costing much less than it did before.There are negative reviews on sound and suggestions on settings to improve sound.  I like the sound and there are many ways to enhance it.  My suggestion is to use the Custom setting but not use any (-) positions.Buy with Amazon.  I ordered on a Sunday and the TV was delivered the following Thursday.  The delivery men carried it in, unpacked it, hooked up to cable, DVD and power, turned it on, ran a check thru the stations and gave instructions on the features to us before our sign off and their departure.At $1800 this set is at least $500 less than BestBuy when you factor in sales tax. There are no shipping charges with Amazon, I don't know about BestBuy delivery.Have patience getting used to the new controls and don't be surprised to find you will be spending more time watching TV.", "Date": "August 9, 2008"}, {"Title": "Great TV at the right price", "Author": "Axton Boy", "ReviewID": "R3G010Q84O961I", "Overall": "5.0", "Content": "After six months of research, my wife and I decided to purchase this TV. Not a moment of regret. Set up was a snap and the ability to 'tweak' the sound and picture is a nice feature. Delivery (by CEVA) was flawless, actually arrived two days before promised.As mentioned by others, the sound is a little weak. How noticeable this is depends on what type of TV you are replacing.A nice set for a good price.", "Date": "June 30, 2008"}, {"Title": "Spectacular HD Video", "Author": "V. R. Maribojoc", "ReviewID": "RGOOQIO0EHCX9", "Overall": "5.0", "Content": "Just received Samsung LN52A550 52\" LCD model, and connected HD camcorder thru HDMI and picture quality is excellent, also set up to view HD & SD channels off-air antenna for broadcast and was amazed how vivid channels displayed. Sound was decent, but recommend Hi-Fi surround sound system for overall satisfaction. Did my research comparing many different LCD & plasma brands and this was the best price for the normal features it offers with this particular Samsung LN52A550 52\" model, very pleased with purchase from Amazon.", "Date": "June 15, 2008"}, {"Title": "Great Set and Service!", "Author": "M. Disla \"MD\"", "ReviewID": "R1HIL21HAXNRYK", "Overall": "5.0", "Content": "So far, I love this set. It is sold at a great price and Amazon does a good job taking care of its customers. The delivery company delivered earlier than expected and was very convenient  in setting up an appointment for delivery. Would recommend this set and Amazon to anyone!", "Date": "May 27, 2008"}, {"Title": "Very Happy", "Author": "Chris S", "ReviewID": "R27HFULTJY9QGH", "Overall": "5.0", "Content": "We have had tv less than a week. I did a lot of research for my first HDTV purchase and I think this tv gives one of, if not the best combo of size, quality and value. The picture quality is superb and as most of the other posts say...the sound could be better. Although my next purchase will be a surround sound system...the sound tweaks mentioned in another post work wonders in the mean time. The sound is more than adequate.We have HD cable from comcast, but my wife still does not like the way non-HD channels look on the tv (although its no fault of the tv itself). I tried the regular channels in a \"stretch mode\" to fit the 16:9 screen and do not like the look. I think regular channels look best in 4:3 480P (only negative is black on the left and right of screen). HD channels are perfect and xbox 360 looks fantastic as well.I had no problems with delivery. Two people from CEVA came, opened the box, set up the tv and hooked up the cable. It came in perfect condition and arrived when it was set to arrive. You can track your package on Amazon and CEVA's website. They call you and set up an appointment, although I was given a six hour window.I bought my tv through Amazon even though it was a few dollars more than the cheapest price. I did this because of the other sellers return policies on tv's over 37 inches. Since I was new to Amazon, this was something I could have easily missed. I may have been worried about nothing...but some of the return policies seem a bit less friendly...be sure to look into it before purchase.Overall...very happy with Amazon and Samsung!", "Date": "May 12, 2008"}, {"Title": "Love the LN52a550", "Author": "Brandon J. Sos", "ReviewID": "R3BGZAIS4QDM0J", "Overall": "4.0", "Content": "If you are like me you have probably been reading all the reviews to get a good handle on the pros and cons of this TV.  As everyone else has said, this TV does look beautiful, but I'm going to avoid reiterating everyone else's comments and add my additional impressions.A few pro's others have not mentioned.USB Plug - This is a really cool option Samsung added to this set.  My sister returned from Alaska shortly after I set the TV up and for fun I decided to test drive it in front of my friends.  The TV recognized the camera was attached and showed the pictures.  This really impressed my friends and surprised me, since electronic aren't usually that \"easy\".Control - When I watch movies I like it DARK.  There is a little annoying light on the bottom of the TV that some designer thought was a good idea, I don't.  Luckily you can turn it off and the fisher price sounding start up and shut down melodies.Details - The piano finish bezel, the relative short TV depth and the cap to close off the bottom after you remove the stand all are great details.  When mounted this TV is a thing of beauty and the details add to it.Cons:Cap on the bottom - To make the cap stay on the bottom of the TV, after you remove the stand, you have to insert 2 screws you removed when taking the stand off.  I didn't read the directions close enough and missed this step, so now the TV is hung and the cap doesn't stay in all the way.  It is my fault for not reading the directions close enough, but come on this could have been fixed by designing a better cap.Plugs on the Back - The Plugs on the back face backwards which is not great for slim mounts.  There is about 1 inch between the TV and my wall and I had to cut a relief hole to take pressure off the wires.Boot up time - There is a short lag in the TV boot up time and turning off.  From what I know this is pretty par for the course, but its a little tough to know everything is starting ok.Additional Notes:-Pay attention to how you plug the component cords.  I unfortunately got two of the colors mixed up and was very frustrated for a few hours until I switched them and everything was fine.-TWC used very high compression on their signal.  I didn't know this until I had my 52 incher on the wall (I couldn't see it with my 32 in HDTV).  Don't freak out thinking your TV isn't as good as you though it was because you are noticing compression artifacts, in fact its SO good that you can see them.-I read one review that said CEVA will work with you and they were very right.  I tracked my package until it got here, called CEVA and picked it up from them the next day.  They will deliver it for you, but if you are impatient like me you will want to pick it up too.  Note: The box is really big and filled up a big portion of the back of my Expedition.In conclusion I would highly recommend this TV to anyone of my friends and family.  If your still contemplating STOP and just buy this TV, you will love it.", "Date": "August 19, 2008"}, {"Title": "Samsung satisfied", "Author": "Robert Masters \"Rmasters3\"", "ReviewID": "R3FF6PEB8R3DPQ", "Overall": "4.0", "Content": "Have had this about two weeks, and am pleased.  Value is excellent, and have seen the same set at local Best Buy, etc. for $500-$600 more. Had two repair issues that have been handled well and quickly.  The base has unstable and a replacement was send immediately, it arrived damaged and another was sent.  Also had a line at the top of the screen and Samsung had new parts in and installed (at our home)within 4 days. The base issues were probably shipping related, the circuit boards were for an intermittant problem but Samsung didn't quibble.  Picture is excellent, doubt I could be much more satisfied for the money.", "Date": "July 13, 2008"}, {"Title": "Malfunction", "Author": "Cheng-Chung Huang", "ReviewID": "R274YIKUYWPKI3", "Overall": "3.0", "Content": "After few months normal operation the unit could not display the input from the computer through it's D-connector terminal anymore.", "Date": "December 10, 2013"}, {"Title": "They don't make them like it used to.", "Author": "Nala", "ReviewID": "R3W387MRU3J59E", "Overall": "3.0", "Content": "We bought this TV in May 2008 and paid $2,000 for it.  Lately, there are color blocks/stripes showing up on the right side of the screen.  We are a little upset at this.  We are not going to buy another Samsung.  The Sony TV on our second floor was bought in 2003 and it is still working well.", "Date": "September 3, 2013"}, {"Title": "Great picture while it lasted", "Author": "mu1yvi", "ReviewID": "R3NWEYZ793PD18", "Overall": "2.0", "Content": "Purchased in January 2009. Beautiful picture but wide vertical green stripe suddenly appeared down middle. Lasted 4 yrs 7 months.Repair shop says it's shot. Panasonic 42\" bought at same time still going strong.", "Date": "August 7, 2013"}, {"Title": "Known defect that Samsung won't address", "Author": "Matt", "ReviewID": "R56RONH08SGFV", "Overall": "1.0", "Content": "Beware - poor quality and poor customer service!  Bought this unit just over 5 years ago, now the right half of the screen only displays colored vertical lines.  Repair technician said the panel is bad and will cost ~ $600 to fix.  I called Samsung, but their call center people won't deviate from the script that says, \"sorry, you're out of luck.\"  It must be a known problem since they created a dedicated website \"samsungoowpanelrebate\".  Waiting for the class action lawsuit.  In the meantime, I'll be looking at a Sony...", "Date": "July 23, 2013"}, {"Title": "Never buy their products", "Author": "Gorddi", "ReviewID": "RYN41UXXT0W4Y", "Overall": "1.0", "Content": "I bought one of their high end LCD TVs. The remote kept eating batteries so I asked for a replacement. They sent me one after a long process since they didnt want to, but the replacement has the same problem. I asked for a third remote but now my TV is out of warranty so I have to buy a remote. They obviously do not stand behind their products. Do not buy Samsung... they are junk.", "Date": "July 23, 2013"}, {"Title": "Broken in less than 4 years", "Author": "Sheila Long", "ReviewID": "R3DSDTXJXEPV1S", "Overall": "1.0", "Content": "TVs used to last 20 years. This one lasted less than 4. Yellow stripe across the screen... The tv is now useless. Will buy a Sony next time. Not impressed with Samsung products.", "Date": "July 17, 2013"}, {"Title": "GREAT", "Author": "kevinmyles", "ReviewID": "R1ONJWTI85A8X1", "Overall": "5.0", "Content": "This TV was perfect and it has satisified me since the day I had bought it and still have it till this day", "Date": "June 29, 2013"}, {"Title": "Samsung HDTV", "Author": "OREN P. REICH", "ReviewID": "R1KZUWG3EUE6VJ", "Overall": "5.0", "Content": "This has been one of our best buys. This set has the best picture of any previous sets we have owned and has served us well. The cost was reasonable and I highly recommended this unit to anyone that is looking for a high quality HDTV.", "Date": "March 10, 2013"}, {"Title": "Didnt last very long after warranty was up", "Author": "James A \"James A\"", "ReviewID": "R26TB3AUBX1PIA", "Overall": "3.0", "Content": "Great price when I got it, in fact counldnt find a better price for almost a year, but ther was a recall on it and that was fixed easy enough but have had other problems and probably won't get a Samsung again, unless giving a great extended warranty", "Date": "December 28, 2012"}, {"Title": "Samsung Ticket # 5103796219]", "Author": "UNHAPPY CUSTOMER", "ReviewID": "R2RANWDNZWIVTW", "Overall": "1.0", "Content": "SAMSUNG HAS HORRIBLE CUSTOMER SERVICE!!! I PURCHASED A $2600 TV THAT ARRIVED BROKEN!! I CALLED CUSTOMER SERVICE AND THEY SAID IT IS NOT THEIR PROBLEM, BE VERY CAUTIOUS OF THIS COMPANY!!", "Date": "July 26, 2012"}, {"Title": "TV will now power up.", "Author": "Sad_TV", "ReviewID": "R1FR037UJVY69V", "Overall": "3.0", "Content": "Had TV for 3 years and now it will now power up. I think I should have gotten more then 5 years for a $1800 TV. Called Samsung and they will cover the repair if it's related to the power supply or capacitors.", "Date": "April 11, 2012"}, {"Title": "Ghosting issue resolved", "Author": "M. Polasek \"Miss Martha\"", "ReviewID": "R2XDM1B9FKSM0K", "Overall": "5.0", "Content": "Purchased this model in Oct 2008 with no problem until recently.  Screen started ghosting and was darker on the right side of the screen.  I contacted Samsung support and did a \"live chat\". The tech asked me a bunch of questions and then had me reset the whole thing to the original factory settings and problem was solved! He had me use the remote that came with the TV and press and hold down the EXIT button until the TV turned itself off. Then, I turned the TV back on and went through the setup process and TV screen was back to normal.  I like doing live chats because it seems I always get better service than when speaking to a person over the phone.  Hope this helps anyone having this issue.", "Date": "February 17, 2012"}, {"Title": "Great TV For The Price!", "Author": "Samuel C. Lee", "ReviewID": "R1HBIW1M0YBQN3", "Overall": "4.0", "Content": "I've had this TV for about a year now, and there are no problems whatsoever.  Picture quality is awesome.  HD comes out crystal clear.  Before purchasing this TV, I looked at the 6 and 7 series, Sony XBR8, and some plasmas.  All had very good picture quality, but not enough to be worth the extra hundreds of dollars.  I watch mostly sports, and a lot of people say that the 60 hz isn't optimal for it.  I think it's fine.  The lag isn't very noticeable unless you compare it side by side.Sound quality is pretty good considering that they're TV speakers.  At factory settings, they were a little mid-y, but it can easily be adjusted through the menu to produce decent sounding speakers.  If you want the best sound, you shouldn't be listening through a TV anyway.  So for what it is, the sound is pretty good.Features-wise, the 550 is much more limited than the 750, but I figured I'm not going to do much with the TV besides watching it.  I think one neat feature of the 750 is that it can be hooked up through a LAN so that your computers can communicate with your TV.  I don't really need that though, so the 550 was perfect for my purposes.Overall, I'm very satisfied with my purchase.  This is one of Samsung's cheapest, full 1080p TVs out.  I recommend it to anyone that's looking for a TV, but is on a budget.", "Date": "January 21, 2010"}, {"Title": "Great Television, Great Value", "Author": "Vasilios Douvikas", "ReviewID": "R6U41DLWS40ZJ", "Overall": "5.0", "Content": "I bought this television on Black Friday 2008 at Black Friday prices which included a free Samsung Blu-Ray player. Over a year later and two moves, the television still has a great picture and a great appearance. In fact I have purchased 2 other Samsung 550 series televisions for my parents and they love the picture also.", "Date": "December 19, 2009"}, {"Title": "Smart decision", "Author": "D. Devine", "ReviewID": "R10G4QP5OX0WHQ", "Overall": "4.0", "Content": "Everything in great working condition.  I was concerned about sound because I live on the water.  Sound is awesome.I am big sports fan and heard concerns about 60HZ vs upgraded models.  I am very happy with model and purchase was a very good move.", "Date": "November 18, 2009"}, {"Title": "Awesome", "Author": "Shawn Adams \"Dune\"", "ReviewID": "R3CZGK606BZ2IA", "Overall": "5.0", "Content": "I have owned this TV for going on a year now. It has been fantastic. The picture quality is insanely clear. I've watched plenty of fast action sports and could not discern any \"motion blur\" whatsoever. There's literally tons of info on the internet as how to tweak the color settings in the TV's menus to make it really pop out and to save you some life out of the set. The set itself is really beautiful as well. We've had tons of compliments on the asthetics and piano finish. Overall a fantastic buy..especially at what it is now compared to when I bought mine. Good luck and happy viewing.", "Date": "July 16, 2009"}, {"Title": "NICE QUALITY TV", "Author": "Burg Buff", "ReviewID": "R13B9ASUD5IWYX", "Overall": "5.0", "Content": "This tv has an outstanding picture!All functions were easy to operate.Setting up the picture quality was a lot easier than I was led to believe.The only knock I have against this tv is the sound system.Very mediocre.Since I am am using a seperate sound system anyway this problem is notreally an issue for me.I would suggest anyone purchasing this tv to considerdoing the same,but otherwise a tv well worth the money!", "Date": "June 2, 2009"}, {"Title": "Time to buy!", "Author": "DebofAmber", "ReviewID": "R213WU1BLYFP3B", "Overall": "5.0", "Content": "Between the recession and the introduction of the 240Hz LCD TV's, the price for this big beauty is down nicely.We watch movies, Hi-Def cable shows and kid shows in my family, mostly, and this TV does a fantastic job with each.  If your focus isn't on sports, this is an excellent television and a very good deal right now.If you haven't bought a TV in a few years, or this is a step up, be warned!  there are a lot of options and features to work with.  It is worth your time to learn them, but it does take a little time.  If you routinely upgrade your computers or cell phone every couple years, you'll be fine.  If you don't, be prepared to spend some time learning what this beast of a TV can do for you.I recommend it and would buy it again.", "Date": "April 25, 2009"}, {"Title": "Great TV, also works great with a PC hook up", "Author": "Jane Gallagher", "ReviewID": "R1BAI43SI6BYRS", "Overall": "5.0", "Content": "I've purchased this TV for about 6 months now and I'm very happy with it. Here's some guidance for new buyers:- Initially I was a little disappointed because when you don't have HD, the image does seem a little pixelated. However, use the Samsung software option in their menus and enable the automatic smoothing, and you'll see quite an improvement.- I hooked up the TV to the computer and it works great. A PC resolution of 1280x800 is sufficient. It's easy to browse the net, watch videos, checks email and type out documents on the TV, it's great. I do recommend a wireless keyboard and mouse with this setup.- If your PC doesn't support PCI-X (PCI Extreme) video cards (which are the cards that handle HDMI output -- and that is desirable because one HDMI cable can carry both video and sound), then you need to hook up 2 cables, one for video (get a long VGA cable) and one for sound (standard 3.5mm RC jack), and connect the 2 cables from the PC to the TV.- Lots of people complain about the sound not being amazing, but you really don't notice any mediocricy if you hook up the TV to a surround sound system. Problem solved.All in all, for me this TV was a really worthwhile investment.", "Date": "April 21, 2009"}, {"Title": "This is a nice tv :}", "Author": "S. Gain", "ReviewID": "R2S2CLFGPAF694", "Overall": "5.0", "Content": "I've owned this tv for a few weeks and i have to say i am very happy with it. The picture with Xbox 360, Playstation and blu-ray is fabulous.Also a plus is that you hardly get any glare from windows or lights in the screen. Only downside I have really seen is that the speakers in the tv don't have good sound. Though this isn't really a problem considering i don't use them anyways. And the price for the Tv was the cheapest high quality television i could find.", "Date": "April 19, 2009"}, {"Title": "So Far So Great!!", "Author": "Needle In the Hay Hay", "ReviewID": "RZUTRTIR5T1RR", "Overall": "5.0", "Content": "I have had the TV for about a month now and love it! The sound is not the greatest, but if you play with it a little bit you can get it to sound pretty good. I will be buying surround sound soon so it's not a big deal to me. I have not noticed any motion blur (being it's 60hz). Definately recommended! I hope it lasts along time...", "Date": "April 16, 2009"}, {"Title": "I own two of them.", "Author": "bloodshot", "ReviewID": "R3ANRY9ERHNS00", "Overall": "5.0", "Content": "I liked this tv so much, I bought a second. I can't express how clean looking this television is. Mounted on a wall, it really adds to a room. Watching HD content on this tv really makes it shine and with a $1500 price tag, it's tough to beat.", "Date": "April 16, 2009"}, {"Title": "Samsung TV - LN52A550", "Author": "C. Mason", "ReviewID": "R19KE4LWA4R4GC", "Overall": "5.0", "Content": "This TV is fantastic.  Colors are sharp, has all the ports you need, and bunch of settings to tweak.  And it's Samsung so quality wise you know you can't go wrong.  The only issue with the TV, which many people have complained about is the sound.  Follow the sound settings from this site, [...] and those sounds settings are gone.  Nothing else to say about the TV itself as it's perfect.Beware of shipping from Amazon's shipping carrier.  They say you get some special handling shipping where the carrier sets the TV up for you to insure it works.  This is not the case at all.  They do the same thing all other shipping carriers do...drop you package off and leave.  If you have this type of shipping make sure you turn the TV and test prior to the shipper departing in case the TV has a defect.  Other than this issue, shipping was EXTREMELY fast when ordering from Amazon directly.", "Date": "April 13, 2009"}, {"Title": "The Most Serious WOW for this price EVER!", "Author": "D. Simmons", "ReviewID": "R1MHVR88RTBU44", "Overall": "5.0", "Content": "So I did all my homework for months on big HD TV's.  What size, what specs, and how I could BEST spend my money.  After all the research, I confidently went with this....and I have never, never regretted it.  Friends and family, who themselves have big screen TV's, have all commented on how eye popping and absolutely amazing the picture looks.  And with 3 HDMI inputs, it handles my brighthouse cable, Blu-Ray, and my XBOX 360 which is great for those with many different consoles to consider.  The non-glossy is very much the way to go here for all of you considering the 650. I know it features a few more hi-tech features, but for the money difference and the gloss issue, spare yourself, the 550 is the best.  And unless your TV room is mansion huge, 52 inches is perfect, please dont get hung up on sizes larger than that.  My couch sits a good 9-10 feet away and I wouldn't want it any bigger.  I paired this TV with the Samsung HT-TZ512 home theater (~$400) and have been on cloud nine ever since.  The \"anynet\" feature between samsung components is really nice.  You know, it was such a dillemna for so long, with all the choices out there, and especially given these are such big ticket items.  But this combo is a sincere winner, even for audio/visual philes.  So to sum it up, add this to your cart and dont look back.  And then thank me later :^)", "Date": "April 11, 2009"}, {"Title": "Amazing TV", "Author": "hookkicklegend", "ReviewID": "REJVY9C6F5U4V", "Overall": "5.0", "Content": "After searching for a few months for the right TV I chose this one and I was not disappointed.  I was contemplating higher models with the auto motion detection, or the 120hz as aposed to the 60hz here, but after comparing it to a few of my friends TV's there was not a noticeable enough difference for me.Bottom line, this is the best bang for your buck and is an amazing TV.Picture is absolutly amazing.", "Date": "April 10, 2009"}, {"Title": "Spectacular TV!", "Author": "Raymond F.", "ReviewID": "R28BABLCR5B5VE", "Overall": "5.0", "Content": "I'm the kind of guy who, if it cost more than $100, researches before he buys. I did tons of research and read scores of reviews on TVs and finally decided upon the LN52A550. The price was right for such a large screen and the reviews everywhere on the web raved about it. And they weren't kidding.  We received it on a Thursday, and I can still remember my jaw dropping open while watching Survivor that evening.  It looked 3-D! The colors are rich and glorious. I have no trouble with reflected light on the matte screen. The television itself is beautiful with a black lacquer-like finish and will be a welcome addition to anyone's living room. Oh, and I'm really glad I got the 52\". I thought about the 48\" and was afraid the 52\" would be too large for my smallish living room, like I'd be in the front row of a movie theater. But it turned out to be wonderful. I could even see going larger if I had the budget.Some kind soul posted a full lineup of tweaks here on Amazon.com that you can make to the settings to get an ideal picture. Out of the box, I found the sharpness settings to be too much, resulting in what looked like a highly-compressed JPG. Dialing that down and adjusting the black levels a bit resulted in a stunning image. I did wrestle with skin tones for a few days, until I realized that some of NBC's studio footage just appears off to my eye. For example, NBC Nightly News host Brian Williams always looks a little bluish to me sitting behind his anchor desk, but then they cut away to a reporter in the field and the skin tones look fine. The Tonight Show with Jay Leno looks a little heavy in the magenta to me, but other shows/commercials look fine. After a day or two, I decided to leave the color at factory settings and just relaxed and enjoyed the picture.  I will say that both of the aforementioned shows, as well as NBC in general, have the sharpest Hi-Def picture of any major network, in my opinion, even if the skin tones are slightly askew.Let me also compliment Amazon.com.  I ordered the TV and it was sitting in my house 48 hours later. No shipping charges, no tax. Amazon is a first-rate retailer that has won my loyalty with their low prices and excellent customer care.By the way, I also ordered a Sony PlayStation 3 as a Blu-ray player, and I'm so glad I did. Yeah, it was about $100 more than a stand-alone player, but it's far more versatile. Besides being able to play Blu-ray discs and DVDs, you also have a gaming system. But more than that, I can connect my computer to the PS3, and via a $20 piece of software called MediaLink, I can access the music, photos and videos on my Mac and display them on the gorgeous LN52A550 screen! It even has a web browser built in, which is a bit awkward to navigate, but brings the web to your living room as well. Again, kudos to Amazon who delivered my PS3 within 24 hours for free!Call me one happy customer who is thrilled with his new home theater purchases.", "Date": "April 6, 2009"}, {"Title": "Great TV!", "Author": "Michael \"Michael\"", "ReviewID": "RJZPZN1N3I8DJ", "Overall": "5.0", "Content": "My 27\" CRT TV died after \"only\" 17 years. After much research, which I found more confusing than helpful, I settled on the Samsung LN52A550 based on the recommendation of someone who sells TV's. We have been very, very happy with it for the 2+ months that we have owned and used it. It was easy to connect to our old components (amplifier, DVD player, etc.). The picture quality is phenomenal! I do recommend, however, that you connect some external speakers, like we did. Nothing wrong with the internal speakers, it's just that they are mounted on the back of the unit so you really have to crank up the volume if that's all you have.", "Date": "April 5, 2009"}, {"Title": "Great TV for low Prize", "Author": "Le Marc", "ReviewID": "R31S283ZK6UWRY", "Overall": "4.0", "Content": "I have purchased two of the Samsung LNXXA550 series, I could say that it is own of the best options on the marked since it has a decent prize. The first one I bought was 40 Inch, later I saw it too small and bought the 52 inch one.Image is pretty clear, the only thing I didn't enjoyed much was the sound, sometimes it was to soft for my taste (Video games), but when you hook it up to a Home Theater or Stereo, it does the magic.It's a nice option, with a great prize and nice features.", "Date": "April 5, 2009"}, {"Title": "Addressing the Sound Complaint", "Author": "ilande", "ReviewID": "R39SBCRV3V106G", "Overall": "5.0", "Content": "This television is an excellent product. When I purchased it, I wanted the best TV I could get for the money, so I chose to wait until the newer models were announced and this unit had a price drop. Saving $500 makes you feel a lot better about a purchase, doesn't it?TO ADDRESS THE SOUND COMPLAINT: A lot of people are complaining that the speakers in the TV are crummy. I beg to differ. I am an adult male who enjoys movies and the occasional video game, and I have found these speakers, to although not amazing, are very impressive for not being seen and being kept within the TV itself. If you are worried about the sound quality, and you DO care about sound, but you are not in the upper echelons of the \"audiophile\" classification, then you will enjoy the sound. It's big, it's whole, it's good. Although, there's not a TON of base, but if you realize there is no subwoofer then no surprise.BEST TV I'VE EVER WATCHED ON, HANDS DOWN. WILL BUY SAMSUNG AGAIN!", "Date": "April 3, 2009"}, {"Title": "Best In Class", "Author": "R+", "ReviewID": "R50KE81MS0R08", "Overall": "5.0", "Content": "I did a good two weeks of research before selecting a TV and I'm 100% happy with my choice. Samsung is a leading manufacturer of LCD panels and actually sells their screens to other companies -- and their expertise shows. The screen is amazing, especially when calibrated properly, and at much lower cost than some other brands (which may be using a Samsung screen anyway!). The number and variety of rear inputs is impressive and will suit my needs just fine. The actual TV housing is sleek and arrived without a scratch. No dead pixels on mine either. I really can't say much else than buy it now -- I couldn't bring myself to purchase any other 52\" LCD TV.", "Date": "April 3, 2009"}, {"Title": "Samsung 52 in. LCD", "Author": "Stephen J. Miller", "ReviewID": "R1W2KANZEWLZDV", "Overall": "5.0", "Content": "I found this Television to be an outstanding value.  The picture is amazingly sharp.  Darks, lights, and colors are all of very high quality.  In addition the menus for adjusting the picture, color, and other aspects of the television are clear and fairly easy to get to.  All in all the set has an excellent picture and is user friendly.  In addition, the price could not be beaten anywhere else I shopped.  The only detractor from the entire buying experience was the shipping.  Delivery took 4 days longer than expected.  However, I did use the free shipping, and when the set did arive the delivery company set it up for me and checked the television to be sure it was working properly.  That is pretty impressive for a free service, so the extra couple of days was worth it.  I am fully satisfied with my purchase and feel I got an excellent deal.", "Date": "April 2, 2009"}, {"Title": "great tv", "Author": "LIKE GOOD PRODUCTS", "ReviewID": "R1PGO2D875TH5N", "Overall": "5.0", "Content": "This  TV was a good price from Amazon. Worked well right out of the box. I was worried about this model because there were newer ones out. If you are looking for great picture and price, this is the tv for you. If you can find one now. The sound is not great but just hook it up to the stero. you will love it!", "Date": "April 1, 2009"}, {"Title": "Samsung 550 LCD TV", "Author": "Lester P. Smith", "ReviewID": "RCQDRE4JTLMBG", "Overall": "4.0", "Content": "I have been looking at the 52\" LCD's for a while and finally decided on the Samsung 550. It is everything I wanted as far as picture quality. I do have a complaint with the sound. It doesn't have the quality that I was expecting. I am looking for a reciever and surround system now for it. I have always planned on adding a receiver anyway, so the sound quality isn't much of an issue. Other wise it is a great product.", "Date": "March 31, 2009"}, {"Title": "Very Nice", "Author": "J. Morgan", "ReviewID": "R29CNMSRCAVILM", "Overall": "5.0", "Content": "So far I have really enjoyed this TV. After careful consideration I decided on the 52\" 550 over the 46\" 650. They were roughly the same price and so I decided on the bigger 52\" over the slightly better picture quality and 120HZ of the 650. So far I am happy with my decision. This set has very nice blacks and many adjustments to make the picture look great. I recommend it to anyone.", "Date": "March 29, 2009"}, {"Title": "Samsung 52 inch", "Author": "E. Bay", "ReviewID": "R3QVLYAVQPE3JC", "Overall": "5.0", "Content": "We love our new TV from Amazon.  We received it the same week in which we ordered it and it was brought into the house and set up in the location which we wanted it by the driver of the carrier.  I would recommend this TV to anyone.", "Date": "March 27, 2009"}, {"Title": "Another Great Samsung Product", "Author": "Bodhi", "ReviewID": "R1WU27DR3EH59X", "Overall": "5.0", "Content": "I purchased this without an extended warranty- Great TV!  Amazon/CEVA delivered early and I live in the country hundreds of miles from their shipping locations.  Samsung may have a rough customer service team but you hardly need it!  I have a samsung BDP-2550 hooked to it through HDMI and picture is great!", "Date": "March 27, 2009"}, {"Title": "Real Nice! Just like a piece of furniture!", "Author": "Davey S. Wong \"b-balldsw\"", "ReviewID": "R24F1QLPV3AEW2", "Overall": "5.0", "Content": "I recently purchased this LCD and really enjoy the picture! Sound is Ok, but will get surround sound. Back to the picture, it's amazing especially the HD channels, such as Animal Planet, HDNet, HGTV and the Food Network!Another plus, is the overall clean and sleek design! The price was too low to pass up, Delivery was very smooth. For all you, future buyers, definitely consider purchasing through the Internet, you will save money!! Go with the Samsung LN52A550!!", "Date": "March 20, 2009"}, {"Title": "Samsung TV", "Author": "K. Reynolds", "ReviewID": "REZC8924PLIA0", "Overall": "4.0", "Content": "I got a great deal on this tv through Amazon.  [...]  Love the set but worth noting is that the picture quality is not at its peak unless you are getting broadcast in digital.  I would highly recommend this set if you get the same deal that I did. (even without the promotional from NFL)Love it!", "Date": "March 20, 2009"}, {"Title": "Great HDTV", "Author": "Old Lady \"Techno stupid\"", "ReviewID": "R1LKBB9CDTCLH0", "Overall": "5.0", "Content": "The new set was delivered quickly and set up was fairly easy.  We love the size and picture quality.", "Date": "March 8, 2009"}, {"Title": "Very Pleased", "Author": "Matthew Blackburn", "ReviewID": "RZCQM2PMUNB4Q", "Overall": "5.0", "Content": "This is my first LCD tv. I was very nervous about buying on online. I wanted a Samsung but it seemed like it was kind of a crap shoot with getting a good one or a bad one with the rebooting issue but i decided  to go for it anyway. I couldnt be more happy. I love the tv. The picture is amazing. Sound isnt that great but i use surround through an amp so doesnt effect my tv watching. The 6 or 7 series does have a better picture i know. But i myself just couldnt get past the red touch of color design. I think samsung realy dropped the ball with that whole thing they have the best picture hands down but really screwed up with that design. So i went with the 5 series and i could not be happier. Ive had my tv or a month now and no rebooting issues so ill keep my fingers crossed. I would deffinitley recommend this tv to anyone.", "Date": "March 8, 2009"}, {"Title": "Great delivery and great TV", "Author": "John Horton", "ReviewID": "R18QJGYAHQ1M0B", "Overall": "5.0", "Content": "I was nervous about ordering such a large item from Amazon without delivery and set-up but when the Pilot shipping subcontractor arrived (as scheduled) he brought the carton in, unpacked the TV, placed it on the stand, plugged it in, put batteries in the remote, turned on the TV, connected the HDMI cable I already had, and made sure everything worked properly - all within 10 minutes - then removed all the packing materials.  I was very relieved about this service.  The TV has a very crisp and detailed picture, even on non HD channels or sources.  The sound is also of good quality.  I am not technically brilliant and did not interconnect the TV with surround sound or tweak the picture fron the factory settings.  It just looks and sounds great.  It is connected to a DirecTV HD receiver and an old combo VHS/DVD player.  I don't watch enough movies to justify a blu-ray player.  Both the TV and Amazon at $500 cheaper than the the Navy Exchange or Best Buy sale price with tax and great delivery service was, in my opinion, a great decision.  John H.", "Date": "March 1, 2009"}, {"Title": "LIVING UP TO EXPECTATIONS", "Author": "R. L. ALLEN \"COGIT8\"", "ReviewID": "R24EPN2P8HJ2SX", "Overall": "5.0", "Content": "I chose this Samsung because the 46 inch version of this model was the best-rated one in its size in Consumer Reports (which I trust for everything).  The picture is excellent, the onscreen menus logical, clear and easy to use.  The sound is OK (as noted in CR), but I have a home theater system to make up for that.  The only caveat I have is that there appears to be some sort of issue between Verizon's Motorola set top boxes when hooking up with an HDMI cable.  No serious trouble for me yet, but apparently Motorola and Samsung are pointing fingers at each other.  I have had to unplug the Verizon FIOS set top box a couple of times to get it to reset (the Samsung was reporting \"No Signal.\"  Online blogs seem to think the problems lie with Motorola.  I discovered the problem when I called Verizon about set top box problems with a box hooked to a Phillips TV in the house, and they were surprised that the problem I was reporting was not the Samsung.", "Date": "February 27, 2009"}, {"Title": "Samsung Television", "Author": "John B", "ReviewID": "R3BAV3DA504RQ7", "Overall": "4.0", "Content": "So far I have no problems with this television.  It is everything I expected it to be.  Even though I don't watch a great amount of television the lower price allowed me to justify its purchase.", "Date": "February 27, 2009"}, {"Title": "Great TV", "Author": "Joel L. Mayo", "ReviewID": "R3AS3AMSJCJ79P", "Overall": "5.0", "Content": "This is a great TV and it came with a super price. I was concerned after reading some of the nightmare stories about the shipper, but I had no problems there at all. Bottom line is that this was a flawless transaction and a super product.", "Date": "February 27, 2009"}, {"Title": "Richard\"s TV Samsung LN-52A550", "Author": "Richard", "ReviewID": "RGGYYN2WXUOGN", "Overall": "5.0", "Content": "Delivery by Pilot was on schedule. Unpacked item, set it up and took empty carton away.Great picture! See no difference in fast moving scenes compared to the 650 model. Poor sound but, used Christopher Nickels recomended settings(see his Amazon rieview)and sound immproved 90%. I use my home theatre system for music, movies and DVDs, however. Extremely satisfied with this product.I have always been happy with all products I have ordered from Amazon in the past and highly commened them on their service.", "Date": "February 24, 2009"}, {"Title": "Great 52\" LCD TV...", "Author": "G. Dave", "ReviewID": "R1P1BQW7F3XC6I", "Overall": "5.0", "Content": "Arrived in just 4 days! Could set up in less than 1/2 hour and hoked up to my DISH via HDMI cable. The picture quality is superb in HD mode. Also, hooked up my PS3 and the games look awesome. Blue ray DVDs are just amazing. Sound quality is good when you turn on surround sound mode on TV. However, I intend to hook it up with 7.1 system to achieve full potential of this amazing product.", "Date": "February 24, 2009"}, {"Title": "Good quality LCD tv", "Author": "J. Mcmahon", "ReviewID": "R2VNZGS38YPUC0", "Overall": "4.0", "Content": "Bottom line, this is a good Hi-def LCD tv.  I bought my first one (46\" LCD) Samsung from Amazon, and was so impressed that instead of getting something cheaper in another product for my second purchase, I paid a \"little\" extra for the quality that I knew what I was going to get with the Samsung.  Haven't had any complaints except audio.  It works fine, but the speakers are on the bottom of the flat screen..Hence, if you have a tv cut-out over a fireplace like we do, it may look great, but the sound gets lost in the cut-out...Obviously, this isn't a factor if you're using a seperate audio system...All-in-all, a good quality LCD tv.  I'm hooked on Samsung if I ever have to purchase another one.", "Date": "February 22, 2009"}, {"Title": "Great TV for Great Price", "Author": "F. Fowler", "ReviewID": "R1HKG4S9MEW24Z", "Overall": "5.0", "Content": "I have had the LN52A550 for almost a month now and am very pleased with it. It is my first LCD TV and spent several weeks researching different brands prior to purchasing through Amazon.  Amazon had the best price. The matte screen works well in my great room which has three walls of windows/doors. Very little problem with glare. Picture quality is great. Sound quality although downgraded on a lot of reviews is what I would expect from a TV. Never thought any TV would put out great sound without a home theater system. CEVA was the delivery company and did a good job. Scheduled delivery, was on time and did all I asked to check the TV before leaving.If you are looking for a 50\" or larger flat screen this is a great buy for the price.", "Date": "February 21, 2009"}, {"Title": "Very happy with the TV", "Author": "L. Kopylovsky", "ReviewID": "R3S006A1X4SUHH", "Overall": "5.0", "Content": "We are very happy with this TV. It's incredible with HDTV receiver. The sound is not so great, it's recommended to by separate sound system", "Date": "February 20, 2009"}, {"Title": "Great TV - husband loves it!", "Author": "Robin Kelleher", "ReviewID": "R1MKPQ32AWP6L9", "Overall": "5.0", "Content": "No complaints except the tinny sound.  Easily fixed once hooked up to good speakers.", "Date": "February 6, 2009"}, {"Title": "Excellent picture quality! But...", "Author": "Ra Quazar", "ReviewID": "RGUGU5SF3NND6", "Overall": "4.0", "Content": "Great picture. Very easy to set up. The delivery men arrived on time and were very professional. Even wiped their feet on the door mat before entering. The only thing I didnt like was the \"feel\" of the remote control and the location of its numeric keypad. Holding the remote upside down felt more natural in my hand, than right side up. And changing channels using the keypad was awkward on my thumb. For this, I rate 4 out of 5 stars.Update:  tv started  making loud nonsense noises and picture would be warped  several months after purchase. Fortunately it was still under mfr warranty so samsung sent a  technician over and he replaced the mother board. Okay...tv was working fine up until  fall 2012 when half the screen would black out and/or colors would be all wrong. Tv would flash. Bottom line : tv is no longer viewable. Had to replace. Owned it less than 5 years. Later learned samsung new about this problem with many of their models and offered repair replacement for certain listed models. But not mine. Very disappointed. Never buying samsung again.", "Date": "January 29, 2009"}, {"Title": "Great Value for the price!", "Author": "lanman66 \"Chris H\"", "ReviewID": "R2BHEVDIBRVV2F", "Overall": "4.0", "Content": "I had been looking at both this model and the LN52A650.  Before purchasing either of these, make sure you take a look at it in the store.  Most of the time the settings on the TV in the store are not adjusted optimally, but even still, it should give you a good idea of what it will look like when you get it home.  In my case, looking at identical images on both this and the 650, i could not tell the difference.  I do occasionally notice slight jaggedness on the edges of fast moving images, but generally this is ONLY when i am closer than 5 feet to the screen.  As with any HD set, if you are watching Standard Def tv it will be quite pixelated.I am satisfied with this set, and glad i saved the extra money i would have spent on the 650 or higher models, especially with how quickly the technology is changing!", "Date": "January 28, 2009"}, {"Title": "Love My New Samsung", "Author": "Alexandra Guajardo \"bargain hunter\"", "ReviewID": "R2SY1LP2DAHYV0", "Overall": "4.0", "Content": "I purchased my tv almost a month ago and I have to admit I love it. I had been wanting an LCD for a while but kept talking myself out of it because of the price.  I priced this one at a couple of stores and then at Amazon.  Amazon had the same price but the extended warranties were cheaper, it was free shipping and of course no taxes.  I saved over $250 by purchasing through Amazon than the local stores.  I did find a site that many mention here and found the best settings/calibration for the tv.  I have to say they really do make a difference.  My sister has the exact same tv and mine has a better picture just because of the settings.  Although a lot of people are not impressed with the sound, I have no complaints.  I ordered it on a Monday and it was supposed to be delivered the next Tuesday(a little over a week). Instead I received a call on Wednesday from CEVA and they delivered it on Friday of the same week.  The two guys took it out of the box, set it on my tv stand and hooked it up to make sure everything worked. They offered to take the box with them as well.  My 1 and only complaint is that it hasn't been the full month since I ordered it from Amazon and it's already $110 cheaper.  From reading other posts, I see that they don't reimburse you the difference.", "Date": "January 28, 2009"}, {"Title": "Great TV", "Author": "C. Kallmeyer", "ReviewID": "R2C2SUPB5GMIVC", "Overall": "5.0", "Content": "The TV is fantastic, never had a flat screen before this.  Nice clear picture, can even watch it clearly from the kitchen 25 feet away.Even the box it came in was great, with handles on the sides for easy transport of the big thing.", "Date": "January 27, 2009"}, {"Title": "Great LCD Television", "Author": "Richard M. Deteresa \"Rich\"", "ReviewID": "R3FVQOEDEQF08D", "Overall": "5.0", "Content": "This is a great TV at an excellent price.  Picture quality at high definition is amazing, and standard def looks great too.  Colors are vibrant, just be sure to select the display mode that fits your room.  I can't really comment on the audio since my set is hooked into a home theater system, so the built-in audio isn't being used.", "Date": "January 26, 2009"}, {"Title": "Great TV.  Somewhat outdated compared to new models.", "Author": "TC \"Electronics Freak\"", "ReviewID": "RCBJCOU9BJW12", "Overall": "4.0", "Content": "This is a fantastic TV, which I bough over a year ago.  My only gripe is that with the 60hz refresh rate, the screeen jitters a little when watching golf and football, which is why I gave it 4 stars.Regardless, I have no regrets about this unit, and am thinking about buying an updated version for the basement.", "Date": "January 25, 2009"}, {"Title": "No regrets", "Author": "Jeff Cheap", "ReviewID": "RJQDCNVHQV14Q", "Overall": "5.0", "Content": "Very nice tv, and Amazon delivered it perfectly, right on time. Only problem was adjusting the sound like others have mentioned, but once that was done, the tv looks and sounds great.", "Date": "January 22, 2009"}, {"Title": "A lot of bang for your buck!", "Author": "A. Freeman", "ReviewID": "ROUD6EP55R2GT", "Overall": "4.0", "Content": "1st, off let me say how happy we were with the white-glove delivery of this product. I was very hesitant to make a purchase like this over the internet, but decided the price on Amazon compared to the retail store price (plus no taxes or shipping) was worth the risk. The delivery was prompt and everything was set up and checked before they left. The service was as good or better than the service I paid for years ago through a local retailing for a similar item - plus it was free!Now, on to the TV itself. I went and looked at TVs this size for weeks before settling on this model. The difference in price between Amazon & a retail store was at least $400, if not more. The picture quality is fantastic, and the non-reflective screen is great in areas where glare/reflection would otherwise be a problem. Overall a really nice TV at a great price.Note:There are some complaints posted here about the sound on this product and it is not fantastic. I did the recommended adjustments, but was still not satisfied. I found it sounded better when I put on a couple of dvds that I was familiar with and adjusted the sound based on what I thought it should sound like - but to each his own. That said I did notice a HUGE difference when using HDMI cables in both the sound and the picture quality. Using the HDMI cables I found no problem with either.", "Date": "January 22, 2009"}, {"Title": "samsung tv A-ok", "Author": "SE in NY", "ReviewID": "R3KKS8BYRXA1Y4", "Overall": "5.0", "Content": "I've had this tv for a couple of months so far and am very happy with it. It is my first big screen tv.  I spent months looking in all the retail stores and even attempted to buy at one time but the salesperson was pushy and wanted me to buy a $400. extended warranty and extras that I didn't think I needed. I had a budget for what I wanted to spend and didn't want the pressure to spend more than I wanted to, so I left.  With Amazon, there was no pressure.  I just did a little extra homework on the internet and chose this item because of price, quality, good reviews and the major brand name.I used the Amazon credit card with a 2 year 0% financing deal and also found that at the time Amazon had the best price by almost $200 over the big stores.  I was worried about buying over the internet, in case I had to do a return, but other reviewers had said they had no problem with Amazon and that convinced me to buy, especially at such a great price.  The video games look great, the blu ray and hd are great. Good sound but even better through the stereo.", "Date": "January 20, 2009"}, {"Title": "Bring On The Super Bowl!!!!", "Author": "Mario", "ReviewID": "R2FLTMJB6FS6HG", "Overall": "5.0", "Content": "Ordered this TV on Thursday morning Jan.15th. Amazon gave me a delivery date of Jan.22. TV was delivered to my home on Saturday Jan. 17th at 10am. Wow! I didn't even get to track for days on end. Watched the NFL playoffs on it and the picture was all I was hoping for, no motion blur at all. Having owned a DLP HDTV for the last 3 years, I was sort of unsure about LCD's, the ones I had seen at stores were very pixelated while showing fast motion scenes. I have a 5.1 surround sound system so I don't have an issue with the sound. Picture on HD is very crisp and clear, SD on the other hand is watchable. I'm glad I pulled the trigger and purchased this TV from Amazon, they had the best price, I paid no taxes and recieved fast free delivery. No B&M; store in my area could match that. Buying from Amazon was pain free, no extended warranty pitches from salespeople.", "Date": "January 18, 2009"}, {"Title": "Excellent TV and Excellent Amazon.com Service", "Author": "J.Go.", "ReviewID": "R2H1FS1BZVDECB", "Overall": "5.0", "Content": "Received this set within a week of ordering it via CEVA (in Late November 2008). With the factory TV settings, the picture and sound both seemed average. I was disappointed as I had expected a lot more based on the reviews.  With minor tweaks to the settings, the picture and sound quality improved dramatically.  I LOVE this TV now.  The sound isn't too bad either (better than average for TV viewing).  Will probably buy a smaller one for the other room :)", "Date": "January 18, 2009"}, {"Title": "Tv lasted for one year and got lines....had to trash it", "Author": "Martin T. Wilde", "ReviewID": "R3RBF6MX1DK9IO", "Overall": "1.0", "Content": "Don't buy unless you get buyer protection plan...I didn't and lost big time....  I paid 1,550.00  12/13/08  good luck and try to buy USA", "Date": "January 18, 2009"}, {"Title": "Awesome TV.. we're loving it", "Author": "V. Monforte", "ReviewID": "R25AUW97T9ICWO", "Overall": "5.0", "Content": "We are very happy with our TV. I can connect my laptop to it and watch international TV, we also have our Apple TV connected and can rent HD movies which are spectacular on it. Our living room has lots of windows and there is almost no reflection on the screen. The sound could be better but we got a Bose CineMate for about $500 and the sound issue is gone.", "Date": "January 16, 2009"}, {"Title": "GREAT TV GREAT PRICE", "Author": "Kathleen Hansen \"RUMMAGENUT\"", "ReviewID": "R3K8EHRXGGFFGF", "Overall": "5.0", "Content": "I AM EXTREMELY HAPPY WITH MY NEW TV AND JUST AS HAPPY WITH MY PURCHASE FROM AMAZON.COM", "Date": "January 15, 2009"}, {"Title": "Another excellent product from Samsung", "Author": "Ed S.", "ReviewID": "R9HUW76Q9KX43", "Overall": "5.0", "Content": "Two years ago I bought a 40\" Samsung (720p) and was thrilled.  I've had this 52\" for a month and am even more thrilled.  Amazon was great in delivering the set in less than week...delivery guys showed up when they said they would...set is great and was easy to hook-up...no glitches and I did change the sound settings as described in a blog on this site and it really did enhance the audio!  Pricing was great and still less than anything advertised to this point - even though prices on HD TVs continue to fall. The free shipping and no sales tax are hard to compete with.  And I got a $25 Amazon gift card.", "Date": "January 14, 2009"}, {"Title": "like mike say JUST DO IT!", "Author": "Jeff Westmoreland", "ReviewID": "RQENVLV56DOFH", "Overall": "5.0", "Content": "Never purchased anything on-line before so was very warry about purchasing a tv for my first purchase. Went to all the chain stores to pick out which tv I wanted, and went back, and went back. Wanted to make sure which one would be the best for me. Everytime I left the stores it was always the 52in 550 series. I tried talking them down to the price that amazon had and they all said they could not go that low. Still was scared to order a big purchase like that on-line. One store even went on-line to check out the price because they said it couldnt be that low. Boy was he surprised, but of course he tried talkin me out of purchasing it from amazon, questioning delivery charge,and if they were even an authorized dealer, if it would be a new tv, and of course the one I was questioning ( big purchase like that on-line) Well after months of searching and my son telling me JUST DO IT!  I did and boy i could not be any happier. Love the tv the price was unbeatable and delievery was smooth and to my schedule. the only bad thing is all the shopping I do on-line now", "Date": "January 12, 2009"}, {"Title": "All I can say is Awesome", "Author": "James Morgan", "ReviewID": "R1DXEES4FWZXLN", "Overall": "5.0", "Content": "I compared several brands and several models. I was torn between this model and the newer 650. I decided for the money difference this was the best buy. I have no complaints other than learning all the bells and whistles. You can sit anywhere in the room and get a clear picture. Yeah, the speakers are not that great. Neither are any of the other makes and models. If you are spending this kind of money on a TV, invest in surround sound. You will not be dissapointed.", "Date": "January 12, 2009"}, {"Title": "wonderful", "Author": "onawaygram", "ReviewID": "RDCWXWWZA5GQN", "Overall": "5.0", "Content": "Great picture, and we don't even have Hdtv hookup - just Dish Satelite. Delighted that the screen is so non-glare.  It faces 3 big picture windows that we can leave open.  While it is true that if you look really hard you can see muted images of the windows, they do not distract from the picture. It is a beautiful addition to our living room.", "Date": "January 12, 2009"}, {"Title": "This TV is awsome!", "Author": "James T. Gearing \"Mad Donkey\"", "ReviewID": "R5UP7VO023H80", "Overall": "5.0", "Content": "I did a good amount of research before deciding on this tv. It is replacing a 36\" Sony XBR. In my opinion the only other brand that comes close to the same quality picture is Samsung, and at a much  better price. I ruled out plasma early on, due to the glare the screens give off. That narrowed it down to a Samsung LCD. I spent most of my time comparing the different models. I spent almost and hour looking at this one and the next model up with the 120hz side by side in a bestbuy, and I honestly saw no reason to get anything but this one. The 120hz actually takes away the natural blur that can happen with motion, and instead shows you details that your eyes wouldnt be able to see in real life, its a strange effect that makes things look like they are happening in fast-forward. I prefer to see things closer to reality, even if things blur a bit when moving fast.I thought I'd also mention something kind of hard to find details on, the calibration setting, once you get the tv. Your vision may be different, but these are the setting that worked best for me.*Backlight 2* (This is a light built into LCDs, I found any higher then 3 gave me a headache after 10 minutes, to bright.)*Contrast 75**brightness 52**Sharpness 0* This creates fake white lines on the edges of objects, useful for SD, but in HD it has a negative effect on the picture (really bad on HD games, xbox 360, etc.), even set to 10 - 20 it can ruin a HD picture.All the other \"special\" setting in the menu should be shut off, they use to make the  TV look brighter for when its on the sales floor, and will only give you a headache if you use them.I spent a good deal of time coming to these settings, hope they help!", "Date": "January 12, 2009"}, {"Title": "A - 1", "Author": "Leonel E. Romero", "ReviewID": "R1VCWTUX8S5V10", "Overall": "4.0", "Content": "The picture quality on the 550 is great. The sound on the other hand is not. You can adjust it to make it sound better, but if you put it in an entertainment mode the sound is not adjustable,and it sounds hollow. That issue was easily fixed once I hooked up my surround sound to it.All in all, I say it's a good TV, I'm satisfied with it. The picture quality is good, colors are vivid, and it's easy to navigate through the menus. I recommend it to anyone who is looking for a lcd and has or will be getting a surround sound system.", "Date": "January 11, 2009"}, {"Title": "Great TV", "Author": "Helgersb", "ReviewID": "R2YIYRS5YM6BRG", "Overall": "5.0", "Content": "This TV is excellent and I would reccomend it to anyone.  The picture is excellent, I debated for a long time on getting the 650 but didn't like the red frame or the more expensive price.  With the 5ms response time of the 550 I don't think you could tell the difference between the two.  If there is any slowed or blurred movement it is not significant enough for your eye to see it.  The picture looks great in both HD and regular cable, we have 10 HD channels and all others are regular cable so we do watch it a lot on cable only channels.  I really don't understand why there are so many comments on the sound, it is the same as every other tv I have ever owned and I plan on eventually getting surround sound.  I had planned on doing it right away before I got the tv due to the comments on how bad the sound was, but after recieving it the sound is fine.  The shipping was fantastic, it arrived 3 days earlier than expected.  They called 2 days ahead to schedule a time, and the driver called when he was approximately 30 minutes away.  He unloaded the tv and I willingly took it in the house and made sure there was no cosmetic damage and that it worked properly.  You can't beat that for free shipping, I don't think Best Buy will drop it off at your driveway for free.", "Date": "January 9, 2009"}, {"Title": "be careful", "Author": "Adam Renwick \"adam\"", "ReviewID": "R21G0H6VR8SW54", "Overall": "4.0", "Content": "i purchased this tv in july of 2008.  it sat in the box while i was gone, and i finally hooked it up in October 2008.  i've since had to send it to get repaired twice.  once for the power supply and a second time for the board.  everything has been replaced except the sound box and the screen.  luckily it was still under manufacturers warranty.  i had head bad things about deal with samsung customer service, but i had no problems.  i called them up, they gave me a local repair shop and they came out and picked up the TV and fixed it. picture is great on the TV otherwise.  i really like it.  i would recommend buying the extended warranty just in case.  i didn't and now i'm hoping nothing else goes wrong with it", "Date": "January 9, 2009"}, {"Title": "Great picture but the audio is below average.", "Author": "C. Shih \"Bonecracker\"", "ReviewID": "R3PQ55KC0BNA4V", "Overall": "4.0", "Content": "The television picture is great and the options are very user friendly, however the audio is not very good at all. The volume of the audio fluctuates when it goes from a HD channel to a non HD channel. I'm not sure if that is a problem of the TV or Direct TV. Otherwise the TV is very good for the price.", "Date": "January 9, 2009"}, {"Title": "I bought two of these!!", "Author": "michelle", "ReviewID": "R11XY8BHNRMHGI", "Overall": "5.0", "Content": "I purchased two of these for a gift to our family. I had been shopping around and this price beat every one else. We couldn't be happier with our new TV's. I was very happy with the delivery. Man brought them in and unpacked them, plugged them in and turned them on. Delivery was great.The Tv's have a wonderful picture. We have surround sound on one and the other just using the speakers on the TV.  I am very happy with my purchase and will not hesitate to buy from Amazon.com. This is my first major purchase from Amazon and it will not be my last.MichelleNaples, fl", "Date": "January 7, 2009"}, {"Title": "Expectations met", "Author": "Kapil C. Biswas \"KCB\"", "ReviewID": "R2SSF7CDFDRN0N", "Overall": "5.0", "Content": "I was glad that the TV was shipped according to Amazon's schedule and on time. The white gloves delivery was impressive. No problem with the tv, I am glad that tv is working fine too.", "Date": "January 6, 2009"}, {"Title": "Samsung 52\"", "Author": "Mary", "ReviewID": "R1066EIF33D20Z", "Overall": "5.0", "Content": "This is a great TV for the price - picture is fantastic and as good as they get.  Recommend it for anyone looking for a large screen TV.", "Date": "January 6, 2009"}, {"Title": "Samsung 52 inch LCD TV", "Author": "Jon A. Forman", "ReviewID": "R13XM2CDOG7SQC", "Overall": "5.0", "Content": "This TV meets all my expectations. Great picture, easy to set up and easy to use. The sound is good for a TV but any sound buff would want to attach a better system.", "Date": "January 6, 2009"}, {"Title": "Great LCD", "Author": "Leonard D. Mcmillan", "ReviewID": "R3XZJDS6QHNA5", "Overall": "5.0", "Content": "Fantastic LCD. Super picture. Easy to use. Sound Bar sucks, but that is another product to review from Samsung.", "Date": "January 6, 2009"}, {"Title": "Great picture and more", "Author": "Ortho Engr", "ReviewID": "RBJC6GD6CMIQS", "Overall": "4.0", "Content": "Am very satisfied with the Samsung 52 inch LCD TV.  the picture is amazing especially in hi-def.  The controls are very intuitive and easy to configure.  and there were plenty of connection options.  i've set it up to use with my laptop (am trying to figure how i can get one for my desk at work!) as well as cable, and DVD players.  The built in sound was just a little tinny and i was dissappointed that there is only one mute level (no soft mute).  also, the RCA plug sound output level is not adjustable by the volume control (can't figure why this is so) but could port the sound out of the headphone jack which does.  but these were relatively minor issues in a set that i am very happy with.", "Date": "January 6, 2009"}, {"Title": "Great TV and delivery", "Author": "K. Halloran \"bridgenet\"", "ReviewID": "R2WA53JCJVXVMZ", "Overall": "5.0", "Content": "Bought 4 LCD TV's this year for Christmas, 3 Samsung and a Sony Bravia.  The LN52A550 was a gift for my parents and had it shipped directly to them.  Delivery was on time for all TV's and had no problems or damage.  CEVA people were great.  Picture on the TV is awesome in HD (Direct TV).  Sound is not the best (no bass), although did not attempt to adjust, just playing it through some old stereo speakers which have great bass.  Price was better than all others, 1 week delivery, and easy tracking.  Great TV.", "Date": "December 28, 2008"}, {"Title": "Very Nice Picture", "Author": "MAC", "ReviewID": "R1O7JX5KT6045T", "Overall": "4.0", "Content": "At first TV did not look very impressive, but when you hook up HDMI cable...VERY NICE!!!  Do not attmept to watch in regular cable mode...must have HD to really appreciate picture quality.  Some blurry motion when watching games in regular mode, but clear picture and better sound when hooked up with HD cables.", "Date": "December 27, 2008"}, {"Title": "Samsung 52 inch LN52A550", "Author": "Robert A. Duggan \"Bob Duggan\"", "ReviewID": "RS2TX9LIP6V5", "Overall": "5.0", "Content": "This tv is awesome-do not make the mistake I did at first-use HDMI cable -the picture explodes from the set-brillant colors and almost looks 3D! I have a 42 inch Toshiba Regza which is great but my 46' Mitsubishi Big Screen died after 14 years and I needed a bigger TV for my living room- this TV was perfect! TV showed up in three days in my living room! Amazon by far had the best price.  Looked at the 650 but didn't see the value or appeal for the \"touch of red \" , 120 HZ or other options. I'm a sports nut and sports are awesome on this set! LCD vs Plasma? Don't see the advantage for plasma and they still have to convince me the life cycle for plasma has improved. Go for it-- you won't be disappointed. Sound not great, but use sound system.  I'm using an old Sony and it works fine---spend more for Bose if you can, or save for the future! Got a Wii for Christmas and it's awesome on this set!", "Date": "December 27, 2008"}, {"Title": "A great TV at a great price", "Author": "GoddessofhisWorld \"GoddessofhisWorld\"", "ReviewID": "RKKC565JE3XWI", "Overall": "5.0", "Content": "I love my new 52 inch Samsung LCD HDTV. The picture is fantastic. I highly recommend this television.", "Date": "December 27, 2008"}, {"Title": "Happy with Samsung LN52A550 LCD TV", "Author": "Bud", "ReviewID": "R1FTRVZR2XWNZL", "Overall": "5.0", "Content": "Prior experience with Amazon.Com gave me confidence that my purchase could be safely made. Reviews of comparable products, and pricing helped me choose a model which met my needs, and budget. I am very happy with my experience. Delivery was made on time too!", "Date": "December 24, 2008"}, {"Title": "Highly recommended", "Author": "George L. Nagy", "ReviewID": "R19W7WVRSKH2II", "Overall": "5.0", "Content": "The TV is easy to set up and operate. The HD image is sharp. A sound bar can enrich the sound and is recommended. The price is reasonable compared to Sony which is comparable in quality.", "Date": "December 22, 2008"}, {"Title": "As Expected", "Author": "M. Wells \"electronics lover\"", "ReviewID": "R1XEVZT0MPMV7M", "Overall": "5.0", "Content": "I say this HD LCD TV is as expected because two months prior to purchasing this 52 inch TV I purchased the Samsung 32 inch TV of the same model number. After installing and using the smaller version I was convinced that the best large screen TV I could buy would be the Samsung of the same model number.I have not been disappointed. The install and connect procedures are simple and easy to follow. The picture is amazing and the controls are so easy to use that my wife can use them. Not to make fun of her ability it is just that she has remote control difficulties.I also purchased the Samsung 1080p upconvert DVD player. It is what they call Anynet. That means that the TV will automatically recognize and connect the player. It is a great function. Absolutly no set up procedure when it is connected.", "Date": "December 21, 2008"}, {"Title": "great tv and great price from amazon", "Author": "Ronald Smith", "ReviewID": "R3ENVEZIFT8SVQ", "Overall": "5.0", "Content": "great experience all around-got a great tv at a truly unbeatable price-bought 3 samsung sets this month from amazon and the whole process couldnt have been better-this is the only way i will buy electronics (and who knows what else)-am a truly satisfied customer and with the money i saved it was like getting the smaller 22'' tv for free-thank you", "Date": "December 16, 2008"}, {"Title": "bad audio", "Author": "Jerald E. Galloway", "ReviewID": "R2P5GMBMJ4IK0P", "Overall": "4.0", "Content": "Excelent picture bad audiohad 2 service calls first call repairer said nothing wrong.second came after factoty rep called me, very impressed by factory interest. they replaced some stuff with only a slight improvenment in audio. after checking around it seems all mfgrs like tin can sound and we are stuck with it", "Date": "December 14, 2008"}, {"Title": "Stunning!", "Author": "CC", "ReviewID": "R32KX04N83U9IP", "Overall": "5.0", "Content": "An absolutely beautiful television.  The detail and clarity are amazing, the set-up couldn't be simpler, and changing settings and channels on the menu is childsplay.  I received a free Samsung Blu-Ray player (BD1500) with this TV and it works beautifully on all my existing DVDs, even my DVD+Rs.  The HDMI interface between the TV and player is really cool as the TV and Blu-Ray player functionality are highly interlinked with the Samsung \"Anynet\" functionality.  Cool stuff.  No HDMI cables included, but you don't have to shell out $30-$50 for one.  I went to [...]and got a 1.3 cable for[...].  And the in-house delivery is great too.", "Date": "December 8, 2008"}, {"Title": "so glad we got this tv", "Author": "Purchaser", "ReviewID": "R246N193UKKBM3", "Overall": "5.0", "Content": "we just bought ours and are now enjoying this beautiful tv.  we've had it now for 3 days and the 52\" size is just stunning and the picture is awesome.  the shipping process through amazon was painless and the shipment came on time.  probably like you, i was skeptical of buying through the internet such a huge item, but amazon was painless and the tv is fantastic.  great bargain for the price.  i hope that our new samsung tv stays this way (i've read the other reviews!) and that i don't have to find myself dealing with samsung warranty service.  i'm keeping my fingers crossed!  everyone seems to be knocking the speaker quality, but i don't think the speakers are that bad to be honest.  i'm not one of those high-tech type people, so maybe i don't know what i'm missing.  but the speakers on this tv sound fine to me even when i watch dvd movies.  overall i'm happy that we got this tv.", "Date": "November 26, 2008"}, {"Title": "GREAT TV!!!", "Author": "L. Freeman", "ReviewID": "R1JOIFGSQHNRQO", "Overall": "5.0", "Content": "i brought mine after reading the reviews here and i couldn't be happier...everything you guys said was right on point. i'm glad i opted for this over the 46\" 650 model(tooo reflective). i highly recommend this set if you're looking for a 52\" LCD with a great picture that's not too expensive.", "Date": "November 12, 2008"}, {"Title": "Nice TV", "Author": "D. Norris", "ReviewID": "R2O5PINALFSLAD", "Overall": "5.0", "Content": "Got it off of \"Amazon's warehouse\" deals for $1350 delivered to my front door.  Can't beat that price! I was wary as a friend said most of these TVs on those deals are returns and so I might get a lemon.  Well, it looked to me the remote/manual pkg wasn't even opened so it's possible I got a new set.Anyway, it's waaaay better than my 5 year old Hitachi 720p rear-projection behemoth.  Much slimmer and lighter so I can put it back against the wall.  There's also many more picture adjustment features that you can get off of various audio/visual forums.  Picture is crisp and clear and the sound for so little speakers is awesome.  Haven't bought a Blu-Ray player yet to see what those movies look like on it yet, but I'm sure it's awesome judging from ESPN hi-def broadcasts and XBox360 games.", "Date": "November 11, 2008"}, {"Title": "Great TV!!!! Samsung ln52a550", "Author": "H. Long", "ReviewID": "R2SZKDUKB81DI0", "Overall": "5.0", "Content": "I have had this TV for 2 months. I wanted to get over the honeymoon phase before I wrote a review. Now this is my first HDTV, so I can't compare to a whole list of other models but it doesn't take a genius to figure out that this TV has a great picture. The whites are very white and the blacks are very black. Having cable TV with HD is amazing. If you set this TV to the right setting I just can't see another TV looking too much better(I found the settings at ATV forums-do a google search). I love watching football in HD. Everything is so clear and, at least for me, I do not see any trailing with the fast moving pictures of football. I don't have a blu-ray yet so I really haven't seen this TV at it's absolute best but I can't wait!If you are debating on this TV or another, I can tell you that you can't go wrong with this one - get the 52 inch - you can never go too big.I didn't see the need to spend the extra $500-600 for the 650 which added another hdmi or 2, the 120hz and the touch of color. That's just my opinion but if you have the extra $ why not. But I love the piano black that surrounds this TV. It's very clean looking.As for the sound I never really listened to it. I have a Harmon-Kardon surround sound hooked up.Overall I can't see this TV being beat and I would definitely recommend this TV!!I did buy the extended 3yr warranty but I haven't had a single problem thus far. The price I paid for the TV - $1800", "Date": "October 27, 2008"}, {"Title": "Samsun LN52A550  52 Inch", "Author": "T. Goode", "ReviewID": "RXFG9SVOFE264", "Overall": "5.0", "Content": "Great HDTV - I would recommend buying this TV to anyone.Colors look amazing!Menus are easy to figure out.It is a little slower flipping between stations.", "Date": "October 25, 2008"}, {"Title": "Just wondering if it's me or the tv", "Author": "G. DePalma", "ReviewID": "R1OBZ4ESQ0YHWB", "Overall": "4.0", "Content": "I recently got this tv because I read the reviews on here and thought it sounded like a great tv. I love the size and all...only my problem is the picture quality. I tried adjusting everything on the menu but I still don't get a clear picture. Some of the channels are fine...others aren't. So is it the picture on the other end...or the tv isn't right?? If the picture was crystal clear I'd give it 5 stars. Not sure if I want to return it as it is a large item. So I am somewhat unhappy unless I can adjust it somehow...or maybe when digital comes in Feb. it will be better.", "Date": "October 24, 2008"}, {"Title": "Samsung is the way to go!", "Author": "Ryan Endres", "ReviewID": "R31MOMX6HIQWDV", "Overall": "5.0", "Content": "I purchased this TV through Amazon about a month ago and love it. After I made a few adjustments to the picture it was ready to roll with my DISHtv setup.  Super quick white glove delivery.I sit about 11 feet away from the screen and cannot see any artifacts while viewing HD content.  The sound (as others have stated) on the tv is pretty bad.  This is not an issue for me since I always use my home theater setup for sound.This is hands down the best method to buying a TV.  Why go to BB or CC and pay more?", "Date": "October 21, 2008"}, {"Title": "Samsung 52\" LCD HD", "Author": "Jackie L. Knapp \"Jack Knapp\"", "ReviewID": "RB5BPJMO198FB", "Overall": "5.0", "Content": "I couldn't be happier with my new Samsung.  Awesome picture, easy to use, very flexible on inputs, etc.  The delivery from Amazon was excellent as well.  The driver set up the TV and removed the packaging...all in all an outstanding experience.", "Date": "October 21, 2008"}, {"Title": "Excellent CSR support form Amazon and Ceva", "Author": "JohnFrum", "ReviewID": "R3ROOQTW32GRCD", "Overall": "5.0", "Content": "I am not an expert on TVs. I did research on Consumer Reports and the Amazon website and other websites. This TV got very high marks.  I also visited other forums to get the proper settings to adjust the audio and video. I think this TV provides excellent performance, but I do have enough experience in televisons to comment on technical issues. We are quite happy with the picture.  I can say that buying this TV was much more pleasant than dealing with Best Buy or Circuit City.  At BB and CC there is so much pressure to buy the extended warranty, overpriced cables, set-up charges etc.  The salespeople at BB and CC might not be on commission, but I know for a FACT that those salespeople who sell the most extended warranties get more hours and more \"rewards\".  The people at Amazon were easy to deal with and knowledgeable. Delivery was very smooth and hassle free. Very good communication with Ceva, the delivery people.  They were prompt, neat, and a pleasure to work with.  I was initially hesitant to buy a large TV from Amazon, but now I will never hesitate to buy a similar product from Amazon.  The price from Amazon was $400 less than the local CC store, and $200 less than the CC website ( which the local CC was reluctantly willing to match).  No sales tax and no delivery fee saved me another $200.  So I saved $400 right off the top. Combined with the zero pressure and easy delivery and buying from Amazon made a ton of sense.", "Date": "October 16, 2008"}, {"Title": "Great 52 Inch HD TV", "Author": "S. Scherer", "ReviewID": "R38Z0NF3C8XBWX", "Overall": "5.0", "Content": "I decided to go with the 550 series because of its value.  It provides a fantastic picture and looks great in any room.  I didn't feel the 650 series was worth the premium after comparing them side by side.Also, don't expect much functionality from the USB port in either the 550, 650, or 750 series, as the TV is very picky about what it will play.Something worth noting, the over-the-air HD tuner is fantastic in this unit and makes for a great viewing experience.  It picks up stations noticeably better than my other HD TV did in the same position.", "Date": "October 13, 2008"}, {"Title": "Awesome!", "Author": "Eric P. Sloan \"Clemsonsloan\"", "ReviewID": "R2GBZJ01FMVYI6", "Overall": "5.0", "Content": "Great service, awesome tv for an awesome price.  Will use amazon for all future electronic needs.", "Date": "October 12, 2008"}, {"Title": "great tv from samsung", "Author": "Ramon Orquiz Jr.", "ReviewID": "R1PLLD3AF9L3CF", "Overall": "5.0", "Content": "Love this tv , excellent picture, easy menu and good sound. I own a 32inch version and i was so pleased i replaced my 53inch panasonic crt in my living room. I highly recommend this tv for movies ,games and sports. Baseball looks great in HD ,If your very picky football in HD might have a very little blur because of the speed the 120hz helps. You really dont notice it unless you really look for it. If you really picky and dont mind the weight, heat and power usage, look at some plasmas from samsung and panasonic . But if you want a LCD this the best one out their and i am very happy and i am sure you will love it to. Amazon white glove delivery is great is great I have used it before and its great. Best price i could find in town by 400 dollars and no tax or shipping. I hope this helped.", "Date": "October 12, 2008"}, {"Title": "Samsung 52a550. . .Great TV! Great Price!", "Author": "Mr. Magoo", "ReviewID": "R2X1I0Z4ZSKYB7", "Overall": "5.0", "Content": "First, I am not an audio/video expert. So, I did a lot of shopping before I finally pulled the trigger on this one. I went to various retail centers (Best Buy, Fry's, etc.) to scout pricing and viewing performance of the different models.Samsung LCD HDTVs have the best user ratings. The 52a550 is a great buy. It works great in my room, which is a kind of bright. The menu, interface and remote are easy to learn. My NFL Sundays are INCREDIBLE, now I wonder why I waited so long!", "Date": "October 10, 2008"}, {"Title": "Save yourself some money, buy this", "Author": "K. E. Maas", "ReviewID": "R36B7X5LUT7WJ8", "Overall": "5.0", "Content": "I was trying to build a home entertainment center with some kind of restraint.  It would have been easy to spend twice as much as I did for a comparable sized TV by going for the 650 or 750 Samsung series.  I ended up getting this TV because I didn't think the 120hz was worth the extra $400-$600 and didn't really think the glossy finish on the higher models would work in a basement used to entertain with lots of lights.  My only worry was that the picture quality would be lower than the newer TVs.  That thought went out the window the second I turned this TV on.I have a PS3 and an HD DVR both hooked up via HDMI.  They both work flawlessly and look gorgeous.  Blu-ray discs look spectacular and with some guidance from the AVSForums I was able to calibrate the TV to get unbelievably accurate color.  Seriously, the 120hz capability to play discs at 24 frames per second and the auto-motion features seem overkill to me.  I have over 400 DVDs and they look fantastic.  People throw around the terms \"unwatchable\" and \"horrible\" way too much when they want to justify spending twice the price of this TV for the newest model.The Samsung 5 series may be a bit older, but the quality is still fantastic.  I've never been more happy with an electronics purchase.Only cons:  Do note that if you're getting a TV this large, you better be getting a decent receiver / sound system or at least a home-theatre-in-a-box since the speakers on the TV are pretty low quality, but that's not what you're paying for.", "Date": "October 6, 2008"}, {"Title": "Nice HDTV!!!", "Author": "Y. Deng \"Robbie Deng\"", "ReviewID": "RCL3NH4NFWZG5", "Overall": "5.0", "Content": "I got this nice piece of HDTV within the scheduled time frame. Picture quality is very good. No concern at all.", "Date": "October 6, 2008"}, {"Title": "Excellent TV but......", "Author": "An old soldier", "ReviewID": "R5Z0UNLLLDOFA", "Overall": "5.0", "Content": "If you're planning on using the OPTICAL OUT (sound) feature of this television, keep the following statement from Samsung's manual in mind:\"When the source is a digital component such as a DVD and is connected to the TV via HDMI, only 2 channel sound will be heard from the Home Theater receiver.If you want to hear 5.1 channel audio, connect the DIGITAL AUDIO OUT (OPTICAL) jack on the DVD player or Cable/Satellite Box directly to an Amplifier or Home Theater, not the TV.\"also:\"The difference between HDMI and DVI is that the HDMI device is smaller in size and has the HDCP (High Bandwidth Digital Copy Protection) coding feature installed.\" If connecting your computer for playing Blu-Ray, use a HDMI (#2) connection (not DVI).Color brigtness is good but not excellent. For those watching sports, consider Samsung's 600 series (LNA650), which has 120 hz scan frequency. (more expensive, of course)One of the nice features of this television, is you can hook it up to your pc. Just remember to set your computer's scan frequency to 60 hz BEFORE you connect the two.As for the positive remarks concerning this tv-they've already been mentioned in the other reviews. I DO RECOMMEND this tv wholeheartedly, though.", "Date": "October 3, 2008"}, {"Title": "great price!", "Author": "Lucy B.", "ReviewID": "R2YGMKULPM4S0W", "Overall": "4.0", "Content": "Have had this TV about a month and love it. Amazon's price was the best around and the delivery was quick. Company delivering the TV took it out of the box and tested it to make sure it worked before leaving. We paid to have it installed for us and was told we didn't need any additional equipment from our cable company. Not sure if this is true. The channels that broadcast in HD format are incredibly clear. The ones that do not are average but still an improvement over our old TV. We do notice some shadowing on a few channels. Still, would definitely recommend this TV.", "Date": "September 30, 2008"}, {"Title": "samsung tv 1080p", "Author": "JR  COR", "ReviewID": "R3K00EFZXT5SRB", "Overall": "4.0", "Content": "The Samsung 52\" 1080p  is a really good tv.  I have had it for a month now, and everything looks good and sounds good. When using a blue-ray player the picture quality is great. when just looking at non HD tv shows the picyure looks normal; no big differances can be seen. Overall the tv looks nice and the remote controll is cool.", "Date": "September 26, 2008"}, {"Title": "Great product. Can't wait to get my surround sound system", "Author": "M. A. Butler", "ReviewID": "R1RC0G5LP04VDE", "Overall": "5.0", "Content": "Just got mine and so far I love it. The sound isn't the best but it will do for non-audio files. Can't wait to get surround sound.", "Date": "September 11, 2008"}, {"Title": "I like it", "Author": "Michael R. Zebrun", "ReviewID": "R3DE70U2I4IVSL", "Overall": "4.0", "Content": "This is a nice TV.  I installed it myself in no time on a TV stand with limited know how.  I went on-line to get different opinions on the TV settings that provide the best sound and picture.  My wife originally thought is was going to be too big for us, but now she thinks it's beautiful.  The TV was great to watch the olympics on.  Movies come in very nice and we don't even have a blueray.  We're very happy with our fist lcd flat panel.", "Date": "September 6, 2008"}, {"Title": "Great quality and value", "Author": "RacerX", "ReviewID": "R3H4B9RBUW7RSV", "Overall": "5.0", "Content": "Love it.  It's one of my best purchases this year.  We moved from an older Sony WEGA and were deciding between this and the 46 inch, and between this and the Series 6 (120 hz).We chose this over the Series 6 as we didn't feel the added functionality (for us mostly the 120 hz - reduced blur) justified the price premium (around 500$)We chose the 52 over the 46 as it's more impressive (obviously) and our room is large enough to accommodate the 52, and the price difference was not that high (200)Pros:- Easy to setup and connect with my Digital IO Cable box, Home theater, WII, VCR (yes, still have one)- Great quality.  Colors are vivid, darks are fine.  Go to circuit city and compare with some of the other brands.- Great price- Lots of great reviewsCons (and workarounds):- Sound is not perfect, as everyone notes.I have a home theater, so this isn't a big issue.  Also, as mentioned in other reviews, you can improve the sound by changing sound settings (AVS forums)- Remote is not universal.The remote only controls the TV.  Not ideal, but no biggie.  Just went out and bought a cheap universal remote to control all of my devices.  Don't have all the TV functions on the universal remote, but think there are some fancy ones that may.- PIP is limited(compared with my older Sony)I wanted to have each screen showing a different channel (we have Digital IO, not standard cable), but that's not possible (at least I don't know how).  I was able to set it up so the kids can watch TV on the left screen, while my wife uses WII Fit on the right.Suggestions:- Buy HDMI cables online versus at a local store- If you want PIP to show WII, one way is to connect the WII to a VCR (DVD) route the RF cable from the VCR to the back of the TV.  You can use one of those RF adapters instead.  (The quality may not be as good as the video)", "Date": "September 6, 2008"}, {"Title": "My New Samsung", "Author": "Henry Tomasso \"Jesus Loves U\"", "ReviewID": "R3VK88FVE82EGY", "Overall": "5.0", "Content": "I can not be more pleased with my new Samsung TV. From the safe shipping process, too the tv's performance. It's picture is fantastic. It has been wonderful to watch the Yankees in HD on this 52\" screen.  The colors are unbelieveable! I am greatful to save so much through Amazon - truly!", "Date": "September 5, 2008"}, {"Title": "This is an excellent HDTV for the price.", "Author": "Electronic genius \"B\"", "ReviewID": "R2MZXGETVUOQ8Q", "Overall": "5.0", "Content": "I am extremely pleased with this product. I did lot of searching and I am satisified with stunningly good picture. I am an hard to please guy.", "Date": "August 29, 2008"}, {"Title": "Worth every penny !", "Author": "Athma", "ReviewID": "R1AWL4SSYLX56H", "Overall": "5.0", "Content": "Wanted to get the A650, but the price difference didn't seem worth the feature difference. Very happy with performance so far!!!", "Date": "August 27, 2008"}, {"Title": "Great Quality at an even Greater Price", "Author": "Martin Joseph Monet", "ReviewID": "R3T7MXI1RXM24K", "Overall": "5.0", "Content": "I had been thinking of buying a larger screen LCD TV for about a year but I needed to wait because I bought two 37\" TV a year and a half ago for $1,000. each. Then I found this 550 model Samsung at such a great price, I didn't want to pass up this opportunity. The TV is great and I haven't even gotten HD put on it yet. Also I couldn't believe it when the delivery service completely set the TV up for me.", "Date": "August 26, 2008"}, {"Title": "SIMPLE REVIEW - Non-Technical", "Author": "Sharon Hagen", "ReviewID": "R31KTO8HS0PAKB", "Overall": "5.0", "Content": ":-)  :-)  :-)Happy!  Happy! Happy!This TV is hanging over the fireplace and is awesome. It has changed our entire living room.Almost bought the 650, but am glad we settled with a less-glossy screen. Not quite sure I buy the 120Hz hype. We are watching the Olympics now and I don't see anything that needs improvement.", "Date": "August 9, 2008"}, {"Title": "Awesome TV at a reasonable price---Update!", "Author": "Charles J. Ferraris \"video nut\"", "ReviewID": "R1JLIA4T1FLNOJ", "Overall": "5.0", "Content": "August 8, I left the following review:I purchased this to replace a 48\" DLP TV that I couldn't move upstairs, this has an excellent picture, light (for its size) and looks as nice as it functions.  Now I just have to get new equipment to be able to display the 1080p that my old DVD player can't provide.  If I had the need for another, I'd buy it, without the need to look elsewhere.Now it's December 13, and here's my update.  I have had this television for 5 months now and have since added a Samsung HT-Z410T 5.1-Channel 5 Disc Home Theater Surround Sound System (Set of Seven, Black) to compliment it, and with the Anynet+ connectitivity, I am able to load my dvd player, and the TV automatically changes to the HDMI input for the DVD, then when I turn it off, it automatically changes back.  This TV has always had a great picture from day one, and in retrospect, this is by far the best value for a TV.", "Date": "August 8, 2008"}, {"Title": "great price, product, and service", "Author": "stemer", "ReviewID": "R2D7FNY95AP93L", "Overall": "4.0", "Content": "I ordered this great hdtv on July 30th, had it in my home up and running on august the 4th. kudos Amazon and CEVA!!!", "Date": "August 7, 2008"}, {"Title": "The best TV I've ever purchased.", "Author": "K. Cook", "ReviewID": "R1LD0H3AAMQH9M", "Overall": "5.0", "Content": "Holy crap, this TV rocks! I had reservations about ordering via amazon, but the delivery was awesome. the TV is flawless and they have even credited back 116.00 since the price dropped to 17xx.xx after I purchased it. I saved over 600.00 buying from Amazon instead of locally.Check out AVSForum for picture and sound settings.", "Date": "July 30, 2008"}, {"Title": "Nice TV", "Author": "M. Lietzke", "ReviewID": "R1TWNITIPAD97O", "Overall": "5.0", "Content": "I have nothing to add about the TV that already hasn't been written by another reviewer.  It's a great TV.I will write a little bit about the delivery though,  I ordered my TV from amazon on 7/20 and I got the call from CEVA on 7/28 to schedule delivery.  They would only offer a delivery window of 10-2 on Tuesday or Thursday, and I am not able to sit around at home for 4 hours in the middle of a workday.  So I asked about picking the TV up at their warehouse, and they are extremely flexible about that.  I was told to show up anytime between 8am and 7pm.  The warehouse is just a couple miles from me so that's what I did and it worked out great.  The dock attendant unboxed the TV to show me that it was undamaged, then helped me load it into my vehicle and off I went.  For me, this was far more convenient than me having to wait around to accept the delivery at home.Overall I am very pleased with my purchase from amazon.", "Date": "July 28, 2008"}, {"Title": "Outstanding", "Author": "A. DeHart", "ReviewID": "R2GHLJI344NMKB", "Overall": "5.0", "Content": "Outstanding product.  I couldn't have asked for a better television/LCD panel.  I've been impressed with it from day one and I'm still impressed.  I'd buy it again in a heartbeat.", "Date": "July 7, 2008"}, {"Title": "Perfect HD Television", "Author": "D. Abrams", "ReviewID": "R2R3ADFOALG8M6", "Overall": "5.0", "Content": "This is my second Samsung HDTV - I also own a rear projection DLP set that I bought about two and a half years ago. This set is superior in all respects but especially in showing non-HD stations and in the quality of the sound. I like the fact that the screen has a matte finish and can't imagine why anyone would spend another $500 more for the top of the line model.", "Date": "July 7, 2008"}, {"Title": "Excellent TV", "Author": "Tolstoy", "ReviewID": "R3IXINSAGPHL9J", "Overall": "5.0", "Content": "I bought this TV one month back and its excellent. I was looking for 46\" TV, but when I found deal on this TV with free Tivo, I got this one and I am not sorry. SD quality is not very good, but HD and movies (not blu-ray) are fantastic, Sound quality is poor, but I am using my owm speakers.", "Date": "July 5, 2008"}, {"Title": "Wonderful TV - Best Bang for the Buck", "Author": "M. Winterroth", "ReviewID": "R1C01W9QDMG2JI", "Overall": "4.0", "Content": "This is a great TV, and a great value. You cannot beat the specs for the price. CEVA's white glove service is a bit lacking (the delivery guys could not wait to unload the TV and leave), but it was delivered with no defects and problems. As mentioned below, I ordered the TV and got the free TiVo, and immediately sold it on eBay for $220. That, coupled with the $75 I just got from Amazon's post price match led to a $1,604 net price. With free delivery and no tax, I could not find a better price for a TV with top specs anywhere else.The sound fix from an earlier reviewer helped things some, but you really need to connect this to a sound system for the total package. With the money I saved, I bought a Sony HTCT-100 soundbar system, and everything works great.Even without the TiVo deal, this TV is a great price. It performs great even in bright rooms, the blacks are deep, and there is no discernible motion blur in HD sports broadcasts. Even standard def channels look quite good, which really surprised me.In all, a great TV for a great price. Just be sure to add a sound system...********* UPDATE 11/17/2009 *********I have had the TV set for a little over a year now, and wouldn't you know it, once the original warranty expired, I started having severe problems with it. I will be watching TV, and then all of a sudden, the screen will scramble, and turn itself off and on again. Sometimes the set will reboot properly, and sometimes it will endlessly click on and off until I pull the power cord. If it reboots properly, the problem will manifest itself again randomly.I have searched the internet, and this does not appear to be an isolated problem. Needless to say, I am quite disappointed in the TV, and now have the added hassle of trying to get it fixed by Samsung...Tread carefully.********* UPDATE 11/19/2009 *********Faith restored. Samsung rep came out and fixed the TV. Even though it was 1.5 months out of warranty, it appears Samsung has a grace period of 3 months to resolve any latent issues. Appears to be working fine once again!", "Date": "June 29, 2008"}, {"Title": "Wanted the Sony XBR4 46\"", "Author": "R. W. Mattson", "ReviewID": "R3JGXVDAFE1RKW", "Overall": "5.0", "Content": "I've been looking to purchase an LCD TV for a very long time.If you compare price to features this is the best value for your $$.Watching Tiger woods win the US Open this year in HD was amazing.I wanted the Sony XBR4 but I'm very happy with this Samsung 550.", "Date": "June 26, 2008"}, {"Title": "Excellent HDTV", "Author": "Mark J. Gaier", "ReviewID": "R2SD22A2HBS03Y", "Overall": "5.0", "Content": "I am very impressed with this TV.  I have it hooked up to a home theater sound system though because the audio from the TV isn't very good.  The only thing I wasn't happy about is that I feel I was misled into thinking that I would be receiving price protection for 30 days from the purchase date if the price fell.  Well, the price fell $100. within 2 weeks and Amazon said the price protection did not apply because they were only the broker in the deal and didn't supply the product.", "Date": "June 24, 2008"}, {"Title": "Don't waste time at Big Box Stores", "Author": "R. A. Easterly \"Price hawk\"", "ReviewID": "R1GRB6ZXB7XYZ9", "Overall": "5.0", "Content": "This superb lcd tv. Amazon does awesome job. Was delivered via Ceva(White Glove Service) in less than a week after placed order. Drivers brought this 85# box into the room, unpacked it and set on tv stand for me...just like your local appliance store says they do. Do Not be concerned about buying on line if from Amazon.com. They gave me several hundred dollars in credits since price dropped after it shipped...continue to do so until 30 days after ship date. Simply outstanding business model. You can not go wrong. Look out Best buy!!!!!", "Date": "June 19, 2008"}, {"Title": "Beautiful picture", "Author": "Penny Pinching Polly \"Check out my website fo...", "ReviewID": "RQHBKJA4QTAYT", "Overall": "5.0", "Content": "I purchased this television in February of 2008 after doing weeks of research and comparing the picture quality to other HDTVs in store.I could not be happier with this television.  I have had it for over a year and it has survived two moves, and a toddler spilling a drink down the front of the LCD screen.Once you view an action movie or a sports game on this Samsung, you will never be able to stand watching it on a lesser quality television.  If you are a serious gamer, you will fall in love with the resolution, clarity and smooth motion.If you are in the market for an LCD HDTV, you must buy a Samsung!  I cannot wait until I can buy the Samsung LN32B550 32-Inch 1080p LCD HDTV with Red Touch of Color to use in my bedroom for movie watching and as a computer monitor.", "Date": "May 5, 2009"}, {"Title": "Great TV", "Author": "Christopher K. Waide \"ckw\"", "ReviewID": "R1L55S2ZA6423F", "Overall": "5.0", "Content": "For the price, couldn't find a better deal. The picture is clear, and bright. Love it.", "Date": "March 13, 2009"}, {"Title": "Great 'bang for your buck' HDTV", "Author": "E. Assande", "ReviewID": "R2LJOJWWVIZ2XC", "Overall": "5.0", "Content": "The Samsung LN52A550 is one of the best 'bang for your buck' TVs you can find today. 1080p with great color and matte screen for low reflections. The only thing better would be the 630 or 650 with 120Hz/AMP but they may not be worth the cost adder for some.", "Date": "December 1, 2008"}, {"Title": "An HD TV Worth Every Penny", "Author": "R. Garrett", "ReviewID": "RJNKBFNH6JU27", "Overall": "5.0", "Content": "This TV is an excellent choice, the clarity,color,and resolution are really remarkable.  The menu functions are extremely user friendly compared to other models I tested.This TV should satisy even the most discriminating consimer.", "Date": "August 24, 2008"}, {"Title": "USER MANUAL", "Author": "Max D. Hawkins", "ReviewID": "R3RHREE3TVG83S", "Overall": "5.0", "Content": "The Samsung 52\"LN52A550LCDTV is awsone.  However, the USER MANUAL is awful!  Tiny light in color print.  Tiny white print on gray back ground.  Even the page numbers are dark on black.", "Date": "July 22, 2008"}, {"Title": "Highly recommended", "Author": "Sitaram Krishnamurthy \"Sitaram\"", "ReviewID": "R13SV0ODZOT90K", "Overall": "5.0", "Content": "So far it's been a great TV. We bought it in the last week of May 2008 and prices have been dropping. Worth the price. Amazon's (of course white glove delivery is through some other company) service was great.With PS3 and netflix membership (lots of blu-ray) we are really enjoying watching this LCD.", "Date": "July 17, 2008"}, {"Title": "Love It.", "Author": "W. Jackson", "ReviewID": "R2UK19A8FJFPWB", "Overall": "5.0", "Content": "It's everything I expected it to be. Great picture, and as far as the sound goes, there's a mode that will improve it on the remote. Besides, if you've got a home entertainment system to hook up to you'll be fine.", "Date": "July 14, 2008"}, {"Title": "I love this TV", "Author": "M. Lewis \"EnckePan\"", "ReviewID": "R2YK64OG8O8923", "Overall": "5.0", "Content": "This TV has been great for me.  The whole line of Samsung LCDs in this generation has gotten great reviews and what I have seen lives up to them.  The image is crisp and bright.  The colors are good.  The menu system is clean and easy to use.  It also has all the inputs I need.  The sound on the TV itself is good, though I have to admit I hooked it up to a home theater system so I generally keep the TV volume at zero.", "Date": "July 1, 2008"}, {"Title": "Great TV!", "Author": "Ewa Zakrzacki", "ReviewID": "R2A5HCUC8NBYXJ", "Overall": "5.0", "Content": "LOVE this TV!!  Was debating between and 46\" and 52\" and Sony vs. Samsung.  Really glad I went with this one.  Only one red, yellow, white input on the side, so had to go out and buy HDMI cables for my Wii and cable box.  Would definitely recommend this TV!", "Date": "June 30, 2008"}, {"Title": "Great LCD TV!", "Author": "Uncle B", "ReviewID": "R3OGQXL6MERH8", "Overall": "5.0", "Content": "Great picture quality and very good sound after performing the calibrations from AVS forums (both audio and video calibration).", "Date": "May 1, 2008"}, {"Title": "Samsung LN52A550 LCD TV", "Author": "Thousand Oaks PC Club \"BK\"", "ReviewID": "R3AQSHU3G0OQ1L", "Overall": "1.0", "Content": "This set was highly recommended so I was very disappointed when I heard the terrible sound quality of the set. Apparently the speakers facing down had a very negative effect. It was so bad that I exchanged this set for a Sony after two days. When you pay $1600 you should receive acceptable sound. In this case the audio sounded muddled and like it came through a can. No amount of fiddling with the controls was able to correct it. At least 4 people heard this set and all commented almost immediately how poor the sound was. One plus. The picture was excellent. DO NOT BUY ANY SAMSUNG WITH SPEAKERS POINTING DOWN unless you intend to use your stereo system with the set.", "Date": "February 4, 2009"}, {"Title": "Samsung 52-inch LCD HDTV", "Author": "J. Kulhawik", "ReviewID": "R1L7HKA4RZEWIL", "Overall": "4.0", "Content": "We love the tv.  The picture when in HD is fantastic.  The only drawback is the sound.  The speakers are in the back.  We had to hook up extra speakers in order to hear it.  Over all we are very pleased with our purchase.", "Date": "June 12, 2008"}, {"Title": "Samsung was at the top of its game from 2006-2008", "Author": "G. Denick", "ReviewID": "R1QVFPXVLATSY6", "Overall": "5.0", "Content": "I purchased this HDTV directly from Amazon in 2008. The video quality is outstanding, with zero blur or SOE (\"Soap Opera Effect\"), for this was before the foolish gimmick of increased Hz/refresh rate began to be implemented by electronics manufacturers in order to sell more TVs to uninformed consumers who had already purchased HDTVs and should have been, by alll accounts, no longer in that market for such a thing. Bright, vibrant, and crisp, looking at this display is like gazing through a magic window. Call me \"old fashioned\", but I swear to you, Samsung's monitors from this era are the best to ever be released. I've wondered if perhaps they cut costs on materials and quality in recent years, now that they've already established such a strong reputation, and can coast a bit on the branding effect (not to mention, the market is much more competitive now, and the consumer base has already been saturated with these products, which must make it more difficult to sustain profits).I also have a 40\" Samsung that I purchased way back in 2006, and that is still my favorite TV, to this day. Its video quality is unrivaled (better even that this 52\"), and its audio is downright unbelievable for an LCD. People often think there is a receiver attached, the sound has so much depth, quality, and clarity. I wish that Samsung had retained that level of excellence in the audio portions of their LCDs, for it's the one thing that this 52\" is lacking. The sound on this Samsung is tinny and more typical of what you generally hear in flat panels... it's a shame, because I know Samsung (as well as the other manufacturers) can do better than this... I have the proof in my living room!", "Date": "February 9, 2013"}, {"Title": "TV works great, but delivery could be better", "Author": "Walter L. Brumfield \"Gadget Freak\"", "ReviewID": "RTUAVLD3N58ZV", "Overall": "4.0", "Content": "I received the TV as promised after a mix up in scheduling the delivery. The TV was in great condition. I did have a problem with the delivery. They came late past the window of time they gave me and didn't give me a call 1 hour before. I had to call them to get the status. There was only one delivery guy and I had to help him bring the TV into my home. Good thing I didn't need the TV upstairs. He didn't do any testing to make sure the TV worked. Overall I was please with the price and the TV itself.", "Date": "April 20, 2009"}, {"Title": "what a tv", "Author": "Roger Bauer", "ReviewID": "R2VOU2BH37L7JB", "Overall": "5.0", "Content": "I was sceptical in the begining about ordering such a expensive item from Amazon but was I wrong. TV arrived on time and in perfect condition. The Samsung 52 inch lcd is a monster of a tv. We couldnt be happier. Thank you AMAZON!!!!!!", "Date": "October 24, 2008"}, {"Title": "Wait before you buy this..", "Author": "Epdoc", "ReviewID": "R2TVLS1AKGQSRK", "Overall": "5.0", "Content": "I needed a TV when I moved to my new apartment and wanted to replace a 50in Samsung DLP that I had sold.  I saw this on Amazon and decided to take the plunge and buy it.  It has lived up to my expectations.  The pictures are great.  I only rarely see pixelation on dark screens. One time I did notice some weird screen door artifact when watching the MTV video awards show in HD (there were crazy flashing lights and a lot of camera panning during the scene).  The audio isn't great but it is sufficient until I save up for a good surround sound system. Otherwise I'm happy with the TV.I was however disappointed in Amazon.  I noticed a few days after getting the TV that the price had dropped.  This continued to fluctuate, reaching a low of $110.00 less than I had paid for it (within 2 weeks of my purchase). I called Amazon about it since they have a 30 day price protection guarantee that I've used in the past.  They-- meaning their call center in India-- told me a policy they had for years was discontinued just 2 weeks before I bought my TV. She was rude and hung up on me. I emailed their customer service and eventually got part of the price difference back, but it was a hassle to deal with them-- very unlike my experience in the past.  So, I still recommend this TV, but if you want to buy it on Amazon, I would definitely wait and watch because the price fluctuates a lot...", "Date": "October 18, 2008"}, {"Title": "great buy", "Author": "Damian P. Gallagher", "ReviewID": "R12GHCI21EO3TW", "Overall": "5.0", "Content": "very happy with purchase and price, which was below any retail store of web-site...the only thing to consider is if youhave a lot of equipment as in surround sound and cable, the cost piles up and may be similar to buying at retail store and getting the service for less because of purchase....Great TV", "Date": "August 30, 2008"}, {"Title": "Samsung 52\" LCD HDTV", "Author": "Amith Chalasani \"AP\"", "ReviewID": "R2RA6GPIGWO4UJ", "Overall": "5.0", "Content": "I brought this  tv from amazon and really great tv.I dont have any complaints i changed the sound system  little bit and working great.I will recomnd this tv.But  buy the  better cables i brought s video but didnt work for me i brought  diff one its working fine.", "Date": "August 24, 2008"}, {"Title": "My first LCD flat screen : AWESOME*******", "Author": "Prasant Bai Reddy", "ReviewID": "R1D3GDHHE9MT24", "Overall": "5.0", "Content": "All the reviews on this site really influenced my purchasing this awesome TV. Easy setup, mounted on to the wall with an articulating mount within 30 minutes and all set to enjoy the incredible peice. Given the price at the time of purchase ($1709 shipped to my door), I cant get another better deal in the whole world. Family is happy and enjoys it to the infinity. Freed up lots of space in the room, no messy wires outside. If you are looking for one, go buy this. Lots of inputs, also got the verizon FIOS with mediamanager can play my music and photo slide shows on this TV....JUST GET It....U WILL LUV IT.", "Date": "August 20, 2008"}, {"Title": "A GREAT DEAL", "Author": "David C. Detavernier \"D.D.\"", "ReviewID": "RVJWLX6D1ZOMM", "Overall": "5.0", "Content": "I also grabbed one but at another store (on line) for cheap $1,599.00  A few minutes later they cancelled the deal but honored mine,shipped!One day I will look back and say I paid how much!!!Any how the LCD is sweet and with a bit of tweaking its already amazing not a single bad pixle or blem. Well surround suound just came in I guess thats the cherry on top and that I did get at Amazon thanks.", "Date": "August 9, 2008"}, {"Title": "Great TV", "Author": "JMC \"jmcmik\"", "ReviewID": "R2T84ZGDREVBIF", "Overall": "4.0", "Content": "I bought this HDTV one month ago and so far I have no regret. The price on Amazon.com was great (under $1,800 USD) - versus $2,200 and more with American TV, Best Buy, etc (price including delivery and taxes). Amazon cannot be beat for sure. In addition of this I got the Tivo DVR free, so in some ways I bought my new HDTV for $1,550 USD!!! A 52' HDTV for only $1,550. Well GOOD BUY Best Buy, American TV, and other electronics stores...Regarding the TV, HD programs are amazing (great image, sharp, clear, bright). However, digital/analog programs are quite bad (the image is grainy). When you get such a good HDTV, it's above all to watch blu-ray/HD DVD and HD channels.I will order from Amzon again soon.", "Date": "July 11, 2008"}, {"Title": "LCD TV is much better than the Service of Amazon", "Author": "Gary Brown", "ReviewID": "RD2F706FD3V3K", "Overall": "4.0", "Content": "I love the TV that I purchased from Amazon. It is great and the picture is amazing. You cant and wont go wrong with this LCD. However, I will never purchase from Amazon again. First, I was told and promised that the unit was in stock and given a ship date and then a delivery date. The LCD shipped out 2 days later than the date I was given. I was still promised by CS at Amazon that the TV would arrive by the given delivery date...guess what? it was 2 days late arriving as well. Then I had a delivery set up for between 11:00AM and 3:00PM (they said they needed a 4 hr window and if the driver would be late, that he would call to inform or see if it would need to be rescheduled). The driver did not show up until after 5:30PM and NO call to let me know. He was then to unpack the TV and remove the trash. Nope, didnt do that either. I will never buy from AMAZON AGAIN.", "Date": "July 28, 2008"}, {"Title": "Bad Delivery", "Author": "Bob Hoskens", "ReviewID": "R2X2AS6QM0HBRO", "Overall": "2.0", "Content": "I bought this Samsung LCD, in part, because of the \"white-glove delivery\". The company that delivered it is called Pilot Freight Services. It was supposed to be a two-man delivery. One guy with a van showed up and dragged my 52\" LCD across my driveway and up two flights of stairs!!! He just set it in my living room and I had to ask him to help me take it out of the box and set it on my TV stand. The TV worked for a while and now shuts off and on frequently. Amazon is sending out another TV. I will NOT accept delivery if only one guy shows up. Beware of Pilot!!!", "Date": "February 4, 2009"}, {"Title": "Samsung LN52A550", "Author": "G. Bradshaw", "ReviewID": "R1I0FM0B8V9KT4", "Overall": "4.0", "Content": "I ordered this TV from Amazon based on reviews from other Amazon users and CNET. I received it within a week in excellent condition and the delivery driver offered to set it up for me, but I wasn't ready for it yet (estimated delivery wasn't until the following week). As has been stated before, the picture on it is absolutely amazing, but the audio sucks really bad. I already have a surround system, so that isn't an issue for me. It's a shame the manufacturer didn't put more time and energy into a decent audio system for this TV. If they had, I would have given it a solid five stars.", "Date": "September 3, 2008"}, {"Title": "Good TV, Good Price", "Author": "Mark Bonnin", "ReviewID": "R1583NVM1ZPJIW", "Overall": "5.0", "Content": "I have had this TV for around 3 weeks and it looks awesome.  Amazon shipping was quick and professional.", "Date": "August 23, 2008"}, {"Title": "Every Bit Worth The Money!!", "Author": "S. Medina", "ReviewID": "R1E1HNVH6TSTUT", "Overall": "4.0", "Content": "I purchased this TV on 7/8/08, I kept close view of the tracking (due to some of the reviews I read about Ceva). On 7/13 I saw it arrived at the local Ceva, I placed a call to the office and they said it was there. Now they inform me that they only come in my area on Weds & Sat (this was Sunday), I decided that rather than wait 3 days I would pick it up myself! I arrived and quickly left with my TV, once I got home was in great condition!! The picture with some adjustment is fantastic, the sound is pretty horrible but I knew that from the reviews. Bottom line you cant find a better deal anywhere...GREAT TV!EDIT: Amazon's 30 day price guaranty is beautiful...It's the 16 of July and I've save $170 on the TV, it's like the gift that keeps giving!", "Date": "July 14, 2008"}, {"Title": "LOOK NO FURTHER. SIMPLY SPECTACULAR!", "Author": "G. Cohen \"GadgetGuy\"", "ReviewID": "RQJ8W2KH4OFQO", "Overall": "5.0", "Content": "Short and sweet review: ABSOLUTELY GORGEOUS LCDTV. I am technical expert and have seen and setup many lcd and plasma hdtv's and if you are thinking about this latest offering from samsung, then look no further. It is that good. 1080p via blu-ray or hd dvd players is breathtaking, when the tv is set up correctly and tweaked. NEVER use the factory default dynamic settings. Those are for store displays only. USE A HIGH QUALITY HDMI CABLE from monoprice.com and you will be blown away. MOVE OVER SONY, SHARP AND TOSHIBA! Get one of these puppies while they are hot and for a hot amazon price of $2300 ( what I paid)with free shipping and no tax. You will not be disappointed!", "Date": "April 10, 2008"}, {"Title": "What about the scratches?", "Author": "aicram62", "ReviewID": "R3SR4UNU4MHBKS", "Overall": "5.0", "Content": "Did anyone purchase one that said there were scratches on the frame/screen?If so, how bad were they? Can the scratches be measured and added to the description? I don't want a scratch I can see from the sofa on my television.", "Date": "February 18, 2009"}, {"Title": "Perfect", "Author": "David A. Evans", "ReviewID": "RCLTQ2I4KEYPQ", "Overall": "4.0", "Content": "Excellent TV, does all I need it to do. Easy to use and set up.Delivery service was fantastic, even unpacking and testing unit before leaving.A pleasure to do business with.", "Date": "June 26, 2008"}, {"Title": "Awesome - best bang for the buck", "Author": "Alexei Frolikov", "ReviewID": "R3F0T0W8C3YE1B", "Overall": "5.0", "Content": "Did a lot of research. It was between two Samsungs. Looked at the two side by side - really no need for a 120Hz. Also, make sure you turn off both LCDs - newer ones are really shiny and you can see your own reflection in it.This is an awesome LCD - I am very pleased with this purchase.", "Date": "May 27, 2008"}, {"Title": "closed caption problem", "Author": "Sidney I. Prashner", "ReviewID": "RLUK6Z1RSQGYV", "Overall": "4.0", "Content": "Using a DVR from my cable network, Grande, I am unable to enable or disable  the closed caption option using either the remote that comes with the TV or the remote with the cable box. I have to use the controls on the box for this function.  Otherwise, the Samsung is great.Also, I have bought items from other companies because Amazon does not have telephone service for orders. I like to buy on the phone rather than on the  net.", "Date": "December 1, 2008"}, {"Title": "Excellent picture... a couple of negatives", "Author": "M. Sullivan", "ReviewID": "RT1IHHI1NZL42", "Overall": "4.0", "Content": "This TV gives an excellent picture. Two things I do not like about this TV: 1) Sound is awful, even with the tweaks suggested. 2) Very reflective. That was the most disappointing and really the only reason I was swayed from Plasma as I'm always hearing how LCD doesn't reflect, but this one does. I've got a Philips LCD in the bedroom that does not reflect. One other thing I don't like about this TV is they went with the piano black finish which adds to the reflectiveness of it. Overall I'm happy with the TV, but my next purchase will be a plasma.", "Date": "September 5, 2008"}, {"Title": "I threw it off my 8th floor balcony and it still works!!!", "Author": "Darrin S. Vogt", "ReviewID": "R3OFT6UEG8DVNE", "Overall": "5.0", "Content": "This thing is like a piece of iron.... but its a machine made of chips and plastic I think", "Date": "April 28, 2009"}, {"Title": "Not a good TV... Maybe OK TV but HDTV is flawed...", "Author": "G. Schenck", "ReviewID": "R2E3AC4SGF2BJ2", "Overall": "1.0", "Content": "Update.  We also purchased a Blue Ray player which, when playing a BR or DVD has a very good image.  At least with BR, we didn't see any pixelization with fast cuts or significant motion so it appears I may have given this TV a bum rap.We use Optimum's IO cable and I even paid for a service call only to be told that this was how the stations broadcast.  I agree with some of the comments here that the problem appears to be caused by the signal quaility from my cable co.  I have to question the whole value of HDTV if the cable companies are unable or unwilling to provide the data volume needed for maintaining a high quality picture.  May of the so called HDTV stations look worse in some ways the our older analog set showed normal stations because, while not as sharp, we didn't get pixelization.That said, if the image doesn't move a lot and it is one of the better stations (they seem to vary as to the quality based on station and to some extent program being broadcast) then the image can be breathtaking.Finally, there is one thing that is the TV's fault.  That is, you can't enable closed captioning when using HDMI cable to connect to your cable box.  This seems really bogus.  I don't need CC but my Mom is partially deaf so we like to turn it on when she visits.Oh well... live and learn! :-)------------------------We recently purchased one of these.  I confess I don't have a lot of experience with HDTV.  This is the first HD set we've purchased.We are very disappointed.The picture quality suffers from a number of issues.  The main problem is that any motion leads to pixalization.  You see this manifest itself in various ways.  Any time a scene changes or a cut in made, parts of the picture becomes pixilated for around 1/2 second before it recovers.  This might be tolerable but certain shows, music videos, etc. that involve lots of short cuts becomes fairly unwatchable.  Certainly NOT as good as a normal CRT TV even though it is hi-def.  Watching sports is painful at best.  Some types of images seem to really cause problems.  For example, if the image has fog or is of water or involves moving lights then it becomes particularly noticeable.  We do have HD programming and so this is not an issue with the signal.In additional to the pixalization, the picture at times suffers from bleeding (movement leaves a smudge or track behind.)  We also get this weird effect where parts of the image seem to move independently of other parts.  For example, if a person is wearing glasses, the glasses seem to bounce slightly up or down or side to side by small but noticeable amounts.  I'm not sure what would cause this, perhaps some aspect of digital compression?I feel let down by the reviews here on Amazon.  The problems we experience are not subtle so I'm mystified as to why the reviews are so overwhelmingly positive.  Buyer beware!If I could return it I would.", "Date": "December 13, 2008"}, {"Title": "Very Good but not great", "Author": "Paul Martin", "ReviewID": "R31OX3VVPFTS7Q", "Overall": "4.0", "Content": "I was a little bit spoiled with my 57\" Hitachi rear projection TV. I think most people will tell you that a CRT is still better than Plasma or LCD when it comes to picture quality. Since the room I chose to set up my entertainment center in was smaller than the previous room, I could no longer use a rear projection unit. While I am not sorry I purchased this set, I am a little disappointed with the picture this set provides when not viewed head on. If this TV is viewed from an angle, the colors wash out - greens are not so green, reds are not so red, flesh tones are not as normal. This can be resolved if the TV is on the base by rotating the TV but it is not possible if wall mounted. Even with an ISF calibrated set-up, the picture does match my previous TV.  Items in some sports programs seem to blur when the camera moves (i.e., the green grass when the camera follows a golf shot). I am told that this is not as effident in the A660 but I can't attest to that. Other than these minor problems I am very satisifed with my purchase - especially for the price.", "Date": "June 20, 2008"}, {"Title": "Great TV .. so-so Amazon service ..", "Author": "Robert Wingard", "ReviewID": "R2GP4Y45496WHR", "Overall": "4.0", "Content": "I bought this item the second day it was on sale.  Price at that time was ~$1890.  Next day the price dropped to $1848 PLUS the free TIVO.  I wrote Amazon, asking for the price reduction, and was informed that I didn't actually buy it from Amazon, but from 6ave Electronics, so they wouldn't do the reduction.  I wrote 6ave and never got a response.The TV is great .. audio is weak, but OK .. I use a AV so it's no big deal.  Picture is outstanding .. a friend gave me his  Monster Calibration DVD, and it helped tweak the set a bit.All-in-all, very satisfied with the item, not so much with Amazon this time.", "Date": "June 6, 2008"}, {"Title": "sound", "Author": "John D. Plunkett", "ReviewID": "R137AUNIGGG7HS", "Overall": "3.0", "Content": "hdtv ln52a550  THE SOUND IS NOT GOOD. IT SOUNDS LIKE A CHEAP RADIO. I TRIED ALL THE SOUND ADJUSTMENTS BUT IT MAKES LITTLE DIFFERENCE. NO MATTER IF YOU PUT IT ON MUSIC,GAMES ,NORMAL OR ANY OF THE OTHERS IT STILL DOES NOT SOUND LIKE YOU EXPECT A HDTV TO SOUND. I ALSO ADJUSTED THE FREQUENCES AND THAT WAS OF NO HELP", "Date": "August 26, 2008"}, {"Title": "Poor Quality and Customer Service", "Author": "J. Abramson \"lajoe\"", "ReviewID": "R20OJISVNK0OA8", "Overall": "1.0", "Content": "20 Month old TV picture died (still has sound). No service in San Diego, and no response from authorized repair center after 3 calls. Bad circuit board which seems common if you Google search Samsung TV problems. Samsung service told me I was out of luck. Parts/labor to repair was quoted at over $500 when I finally got a Sears repair man to come out. For a premium quality product like Samsung, they take no pride in quality and have poor customer service. BUY AT YOUR OWN PERIL.....\"", "Date": "November 12, 2008"}, {"Title": "Picture quality very nice, but sound is horrible!", "Author": "David Bates", "ReviewID": "R2F8FXE8P2ILJD", "Overall": "3.0", "Content": "Just plugged in my new TV after reading glowing reviews around the web.  The picture is great, the price is great.  Unfortunately the sound sounds like it is coming out of a barrel.  I'm sure the speakers are fine, but they are somewhere shoved up inside the set so that they sound like they are coming out of a tube.  Just make sure you plan on buying a sound system for this one...", "Date": "April 25, 2008"}, {"Title": "Very few complaints", "Author": "Jordan Brown", "ReviewID": "R130NKFO93DX49", "Overall": "4.0", "Content": "[ Updated review after about four months ]I'm neither a videophile nor an audiophile, so my review is necessarily limited.  I also don't watch broadcast TV, so I'm only using it as a monitor and speakers for a Blu-Ray player, Wii, PlayStation 2, and a computer.  Most components are routed through a Harman-Kardon AVR247 and thence via HDMI to the TV.  The computer is attached directly via a VGA connector.The TV basically plugged in, turned on, and works fine.  Not a lot to say there.  The picture looks fine, certainly competitive with anything in its class.A few complaints:- The first time I tried to use my Harmony remote to power up the system, it crashed the TV.  Black screen, wouldn't respond to any controls.  Had to unplug it.  This has happened perhaps three times.- Initially, my receiver was out for service, so I was using the TV as a switcher and using its speakers.  It didn't seem to accept the idea of an input with no video, so I couldn't play music from my Squeezebox.- It has discrete codes to select its various inputs, which is what you want if you're using a high-end remote like the Harmony.  However, when it's selected to the VGA input, if the computer is off the monitor goes into a power-saving mode.  When in the power-saving mode, only a few commands will wake it up - not including the discrete input select commands, and not including the discrete power commands.  Oops.  (Worked around this by having the Harmony send the \"input select\" command first to wake it up.)- The main connectors come straight out the back.  That seems obvious, but when you're talking about an HDMI connector with associated not-very-flexible cable, there's not enough space for a close-to-the-wall mounting.  You'd either have to dig a hole in the wall or add a right-angle connector.  Some competitors have their \"back\" connectors pointed to the side, both making them easier to get to and avoiding clearance problems for the connectors.- In PC mode the PC didn't automatically detect that the monitor could do 1080p (1920x1080); the best it thought was available was 720p.  However, the PC video driver allowed me to specify my own parameters and I was able to set it to 1080p.- It takes over ten seconds to power up.  That's an eternity when you're waiting for it to power up so that the remote can set it to the right input.[Update 2011-12-27]Still happy.When my AV receiver's video section failed, I tried using the TV's speakers.  We hadn't used them in a long time and hadn't remembered how much better real speakers are.  I think I saw something somewhere about exactly how to set up the TV to get the best quality sound it has; maybe it can be better.[ April 2012 ]It started having trouble turning on - it would turn on, get halfway through its startup melody, and reset.  Only after repeating that for several minutes would it come all the way up, at which point it was fine.  Online research indicated that the problem might be a failed capacitor.  I still had it under extended warranty, so I had a tech come out and, indeed, he pulled the back off and replaced four or so capacitors and it was fine again.  The job was done in perhaps twenty minutes, start to finish.", "Date": "July 31, 2008"}, {"Title": "TV Very satisfied - delivery/shipping real pain", "Author": "V. Madugula \"TopNothch Buddy\"", "ReviewID": "R2BJ23KRBJGCGA", "Overall": "4.0", "Content": "I got the TV last week. CEVA Logistics used by Amazon to deliver the TV has horrible shipping service. On the scheduled day of delivery, the driver calls after 1/2 hr he missed the schedule time zone(after I call to the company n times to track my packages). And he says, by so and so time he has schedule dto leave from my house. I say, he is alreayd late and I had to pick up kids and be back .. he says either take it in next 5 min or he is leaving. He says I can re-schedule next week( and they work only Tue- Fri delivery). And driver calles me 5 times in 1 minutes and says I did not return his call knowing it is his call when I call him after 10 min. Driver/ shipping service is horrible and does not let open the box to screen if atleast TV screen is good/damaged. Driver he has to out of duty by 05:00pm. Ridiculous - he comes 2 hours late and pushes so much. Amazon, please select a decent delivery company like FedEx or UPS where people are not so harsh as CEVA logistics.", "Date": "May 12, 2008"}, {"Title": "Grandmas dilemma", "Author": "KJD \"Legend59\"", "ReviewID": "RJP96BKEJ5LQN", "Overall": "5.0", "Content": "Years ago,when you could walk into Sears and buy an RCA,Zenith or GE tv set,go home and choose between channel 2,4,5,7,9,11,and 13 for Leave it to Beaver,Walter Cronkite,Lawrence Welk or Bonanza....and no manual needed and tv was FREE,it was so simple.There were no YEARLY models like a bumper or tail-light change on an automobile.Now,you choose from 29 different makes,each with 39 different models and a manual an inch thick with writing so small you need a microscope to read it.When it used to be vertical and horizontal adjust with brightness and contrast,it's now aspect ratio,dynamic contrast,usb ports,1080p,umpteen cables and we'll do the dishes for ya!..Ha!....not only that but get cable or dish network and be sure to have rg59 and not rg6 for the digital revolution,get a converter box along with it's remote to go along with the tv remote to go along with the dvd remote...well you get the idea....in the meantime,grandma fell asleep while you fumbled through the remote jungle and Lawrence Welk isn't on again untill next Sunday night!  How's the tv you ask...FANTASTIC!....but the modern age is supposed to be simpler folks and when I walk into a bank and they tell me the computer is down,it's not simpler...they don't have my records available.I still have my money in the bank,I just can't get to it.When the cable tv goes out,I still have my tv but I can't watch it.....and..did anyone say anything about FREE tv?  There are more buttons on three different remotes than you will ever use in a lifetime just to watch the Lakers or Babs.So,to sum up this little review,I still watch 2,4,5,7,9,11,and 13 and grandma can't see the numbers on the remote to change a channel let alone know what CNN is and says,'screw you',she'd rather watch her trusty,rusty Philco with the rabbit ears....I miss the good ole days.  To improve the sound,I did use an old stereo amplifier with 4 speakers to get some theater ambiance and bypassed the tv's nasel stuff up tinny honk and BAM!....it's wonderful.The Lennon sisters sound beautiful and the HD is clear,crisp and Babs looks great!....This stuff isn't exactly user friendly for folks over...well you decide...and do I recommend it?....OH YEAH!...Samsung has got it goin on...I also recommend the good ole days....and simple...grandma wasn't as grouchy.", "Date": "May 26, 2008"}, {"Title": "Looks great now!", "Author": "Sankwon Lew", "ReviewID": "RXFR4GX6UEVHE", "Overall": "3.0", "Content": "Just received the TV.  Phyiscally, it looks gorgeous, and was actually bigger than I expected.  Amazon delivery service was awesome, as they hand delivered to me, and unpackaged it and made sure it worked before they left.I don't have HD setup box so I'm not sure if that is needed, but when I just plugged in my regular cable to the TV, i see standard channells as well as HD channels.  For example, I see CBS on channel 2, but if I go up in the numbers, I see a channel 1-2, which is CBS HD (it says so).CBS HD channel looks better than standard CBS channel.  This leads me to believe that I am getting the HD channel correctly, without the HD Setup Box.  If that is the case, I am quite disappointed with the Quality of picture on these HD Channels on this TV. I have watched HD channels on other TVs, and they looked so much sharper than this TV did.I give it a 3 for now, because I maybe missing something here, but so far, I'm not overly satisfied.------------------------*****8/24 Update*****I got the HD setup box, and I do get HD channels.  However, when I compare the quality of these HD channels with quality of HD channels WITHOUT the HD setup box, there is no difference.  This TV already has a HD-Tuner, so therefore, HD Setup box is not necessary to watch HD channels.  However, you do need them, if you want to watch beyond the standard HD channels.  I took out the setup box, because I only watch the standard channels in HD, and I found setup boxes to be too slow when navigating.Anyway, after watching these channels for couple of months now, I really like them.  I think I had unbelievably higher expectation for the HD channels, and this is not realistic for HD chanels, which only come at 760P.  I have yet to watch blue-ray, which is at 1080p.  FYI, currently Verizon FIOS is the only option if you want full 1080p on your cable TV.", "Date": "June 13, 2008"}, {"Title": "It's cheaper at Best Buy", "Author": "aristotle", "ReviewID": "R1EJ7Z1JRS1MUV", "Overall": "3.0", "Content": "It's cheaper at Best Buy. Use 10% or 12% off coupon and you will end up buying this one for under $1700.00Hope this helps.", "Date": "May 26, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full HD 1080p Resolution\nWide Color Enhancer\n3 HDMI Inputs\nUSB 2.0, HDMI-Cdc", "Name": "Samsung LN52A550 52-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/515S%2BqosBIL._SX300_.jpg", "ProductID": "B001415EMI"}}