{"Reviews": [{"Title": "Great TV - Amazing", "Author": "A. English", "ReviewID": "R19G9950GH49I9", "Overall": "5.0", "Content": "Unless you want an inch thin LCD TV, this should be your TV of choice. I went to Sixth Avenue where they had an exceptionally large selection of LCD and Plasma TVs. This TV had the best picture quality of any LCD TV they had. I was planning on getting a Samsung 1080P 120Hz thin LED TV (could not quite swallow the price of the 240Hz) model until I read reviews of streaks in the picture quality when watching the TV in a dark room. I then moved on to the less expensive non LED Samsung 240Hz LCD TV which is still $400 more than this Toshiba. Luckily, the salesperson asked me to take a look at this TV first. This TV is back-lit LED which makes the TV thicker, but provides better picture quality than the side-lit LEDs in the thin Samsung. The 240Hz was a real bonus--especially in a TV that sells for this price. I have had the TV for a month now and could not be happier with it. I have had friends that visit comment that this TV has the best picture quality they have ever seen in any TV. This is the best 46-inch LCD TV you can buy that sells for a price that's unbelievably low when compared to the competition. It might not be the thinnest LCD LED TV, but it does have the best quality picture in any LCD TV. It is just one awesome TV.", "Date": "September 2, 2009"}, {"Title": "Superb LED LCD TV right out of the box!", "Author": "T. J. R. \"way up north\"", "ReviewID": "R32UEWT3E30X0E", "Overall": "5.0", "Content": "Ordered this TV around the beginning of August. Amazon shipping said to expect it on the 14th. It arrived on the 12th, lucky I had just returned home because I was all set for the 14th! Anyway, The delivery guy carries it in, takes it out of the box and set it on the stand for my old Sony Bravia.(Since I didn't put the new stand together yet. He then helps me take the old TV down to its new location in the basement rec room. (Nice of him!) We plug in the new Toshiba and I connect it to my cable HD DVR box with the new HDMI cable I also purchased from Amazon. It works! Beautifully! The sound is better than expected. The picture, especially the HD channels is great and the colors and contrast are fantastic. Everything I expected and more. The Dolby sound leveling seems to work (still checking). Our collection of wide screen DVD's looks great. Maybe because of the Resolution+ upscaling. So check out all the features and compare the price with the only LED TV somewhat similar: Sony's BR8 series. I think you'll be very pleased with this new Toshiba 46SV670U (55SV670U is similar). By the way, mine was manufactured in JULY 2009!I'll update this if problems develop.Well, it's now October and this TV is still the best. And it's great to be able to plug in a SD picture card and watch a slideshow or plug in an USB flash drive and play music or other media.I'll update this if problems develop.*******************************************************************June 22, 2010 --- Sorry I haven't updated before this but we've been so busy enjoying the OUTSTANDING picture quality, I guess I haven't had a chance. Yes, this TV is still amazingly brilliant in every way. Audio is good for normaal viewing but of course I switch on the sound system speakers for all the big sound DVD movies. No complaints. At all.*******************************************************************May 19, 2013 --- Believe it or not but I'm going to risk fate and add to my review. The TV is still working great and it's used for everything: cable, Wii, Blu-ray, DVD, streaming Pandora and Amazon Prime.", "Date": "August 19, 2009"}, {"Title": "Glare and big size, but otherwise, awesome TV for the price!", "Author": "JPMDallas77 \"JP\"", "ReviewID": "R2XKL766BENV3Z", "Overall": "4.0", "Content": "1st, let me say this, I upgraded from the Toshiba 46XV545U 120Hz LCD T.V. (bought in April 2009, it got stolen :( \"Last year's model\").  The picture on this one is noticeably better. In fact, it is awesome, BUT this TV has a couple drawbacks that people should be aware of, and I think its why it is $700 off its MSRP only a few months after it came out:1) Case size: If you're expecting one of those \"thin\" LED backlit LCDs like Samsung's, look elsewhere. This TV is 4-6\" thick, thicker even than the straight LCD I replaced.  Also, it has about 3-1/2\" fascia around the screen itself.  This is also much more than my old TV, presumably to hold the LED backlights.  So, the case is bigger.  This fact, combined with the design, makes it look old, like a 5 year old LCD. I much preferred my old Toshiba in terms of design.2) Glare. Maybe I didn't look closely enough at the description, but my last Toshiba had a matte finish on the screen, which given my sunny living room, was a huge plus and should not be underestimated.  This TV has a glossy finish on the screen, which results in lots of glare.  This affects watching TV during the day big time and unless you have a dark media room, you need to be aware of this.3) Backlight \"halo\" around bright objects on dark backgrounds, flickering. UPDATE: This problem was fixed by a firmware update, so disregard.  Picture great now.  There is still some halo effect around bright lights on dark screen, but this is endemic to local dimming LED technology.  Its basically the best they can do right now.  Much better than the alternative!UPDATE: I have had the TV for a little over a month now 1/14/10, and I have to say I really love the picture.  It is truly one of the best you can possible get in this price range.  The DynaLight feature (local dimming technology for the LED backlights) make the blacks very dark once I got the firmward update from Toshiba.  Highly recommend, so long as you're aware of the size of the TV and the glare issue.I have begun to notice some tinny, buzz sound from the TVs internal speakers that might be what another reviewer referred to as a problem with audio coming in on HDMI after a couple of hours.  All my inputs are HDMI, so this might be the issue.  I usually use external speakers, so this isn't a problem for me. I'll check on a firmware update in a couple months.  Otherwise, its a great TV, especially at today's price!!", "Date": "November 27, 2009"}, {"Title": "Warning - a detailed experience with audio failure and Toshiba support", "Author": "JD", "ReviewID": "R2625NAZGXWHK8", "Overall": "1.0", "Content": "We purchased this on March 22, 2010 and the same night the audio went out for the first time. It just becomes very fuzzy and unintelligible. We phoned Toshiba tech support and were brusquely just handed off to a local service center to coordinate our own service. The service tech advised he had to wait several days for Toshiba to instruct him on what to do but was sure a simple firmware update via USB would fix it.Several calls and days later he advised Toshiba was instructing him to order and replace the main board. His exact words were \"good luck getting this board from Toshiba, if it were Sony or Samsung or anyone else it would be a few days but Toshiba is terrible in supplying parts, they are always in permanent backorder.\"He was exactly correct.Three weeks later we still have no working tv and appear no closer to one. We have over half a dozen calls to Toshiba, who at best are bored and rude consistently on every call. We had this \"escalated\" to a higher department and were contacted by that person at Toshiba to say they also have no idea when this part will arrive but would try to pull a board out when one did. Otherwise, wait. The entire \"customer service\" plan is to just see if a board arrives before thirty more days passes and if not - we have not been able to get any answer on what happens then either.And that they condsider a thirty-day plus time period to fix a brand-new tv perfectly good service. We still have no date or time or solution for a new tv we still cannot use a month later on April 25. Nor is anyone at Toshiba willing to do anything more than tell us to just wait until they may get the part -which again they have just a \"back-ordered\" status on and zero info of any solution.Update- April 29: called again and again requested the supervisor, denied and told someone will get back to us in 24 hours. Still no status on the main board and no interest by Toshiba in helping us.We decided no more Toshiba products for us, period. I am now trying without success to contact Toshiba Corporate somehow but nobody at Toshiba will step up and resolve this and all refuse to provide any contact for Corporate.Be very wary buying any Toshiba - it truly is the most apathetic, just terrible service we have ever encountered.They are incredibly uninterested and impotent in anything approaching customer service.Update: 5/11/2010 - the main board seems to have arrived at the local parts center - we found this out on our own by calling the local tech, nobody from Toshiba (Marna) bothered to call us or follow up as repeatedly promised. We still do not have a working tv as it is now having the board replaced over the next four days by the local tech.Update: 6/24/2010 the main board was replaced about a week ago finally which seemed to fix the garbled sound problem, however now the sound is failing completely. We have no sound at all on any ports - using HDMI or fixed audio or RCA or Component. The tv speakers also have no audio. Called Toshiba again, I have been told someone in \"advanced troubleshooting\" will get back to us.Again I asked them to simply replace this lemon TV and they will not, want us to go through parts troubleshooting again. Toshiba advised replacing the TV would take even longer than replacing a main board. Which they just replaced once already.This should be illegal. We are now getting in touch with the California consumer affairs and trade office through government to see if anyone can help us get this resolved.", "Date": "April 27, 2010"}, {"Title": "Garbled audio", "Author": "L. Glenn", "ReviewID": "R2OIBMETKQX62I", "Overall": "3.0", "Content": "I purchased this TV on Jan 2, 2010. This is a great TV and the picture is awesome. The on screen menu is okay and slightly complicated for those that are not tech savvy and there are many things in the book you really need to read.This TV has the newest in technology when it comes to picture quality and it could have improved on the sound quality, but most of us having TVs like this hooked up with surround sound systems. The speakers are hidden and there are preset sound outputs you can have to create standard and simulated surround sound from two speakers.Other than the picture, the TV has an issue with the sound. When you play a DVD disc from a regular DVD player with HDMI capabilites to this TV, the sound garbles and reverberation begins afer an hour of play. Toshiba America says I am and a group of people have this rare problem. They did not offer to fix it and they said they were working on the problem. What does that sound like to you?So, I purchased the newest Toshiba BDX2000 Blu-ray player and played a blu-ray movie with the sound output from the TV and the sound never garbled throughout the movie or even skipped a beat, Great!I then played a regular DVD disc on the blu-ray player and after an hour of play, the sound starts garbling from the TV again. Toshiba had instructed me to turn off certain features to prevent this, under the HDMI settings, you are to turn off Deep color, lip sync and instaport. If it did not resolve the issue then use RGB (red,green and Blue) cables instead of the HDMI cable and for the sound, use left/right audio patch cords.We as consumers or customers should not have to fiddle around with this.We buy these expensive TVs to utilize the newest technology, HDMI.The cabling is not an issue. The versions of cabling is another gimmic for manufacturers to charge youbig money for pretty cables.I was going to retire the older DVD player, but instead kept it to play DVD disc with the RGB cabling and the sound connected through my stereo so I did not have to keep dealing with the garbled sound. I have over 600 DVD movies. I now have one blu-ray player with no blu-ray discs.So, you make the choice. Do you want to be apart of the rare group of people with this problem and how will you know if yo are getting a good set or not.", "Date": "February 4, 2010"}, {"Title": "Very pleased with this TV.", "Author": "Jason B. LeBrun \"urban nerd\"", "ReviewID": "R21C5ZQEBZI4SU", "Overall": "5.0", "Content": "I'm really impressed with the quality of the image of this television, especially given the price I paid. I had been looking at the Samsung LED panels, and although they were beautiful and vibrant, the increase in image quality didn't seem commensurate to the increase in price. So, I had given up on getting an LED-backlit panel, until I discovered this Toshiba. It was just released, and I was a little nervous about getting it sight-unseen, but I decided to take the plunge, and I'm glad I did.The colors really pop out. The LED backlighting makes a *huge* difference for blacks. On my old 46-inch TV (a Sharp AQUOS), when watching dark movies, or standard-def stuff with black bars, the blacks would glow pretty noticeably in a dark room. Of course, this was par for the course for an LCD panel at that time, and it wasn't the worst thing ever.With the proper configuration on this Toshiba panel, when viewing SD content in a dark room, the black bars fade into the darkness almost perfectly. Sometimes you can notice the selective backlighting. If there is a small bright object on a black background, it will have a slight aura from the section of backlight being on. If you connect a computer, set a black screen and move a white mouse pointer around, you can actually identify the backlighting elements. It's more cool, than annoying. I guess because of the way the human eye works, you really don't notice the panels/auras under normal viewing.The media player functionality is pretty much worthless... it wouldn't play any of the movie files that I had on hand. Since I have an HTPC attached, it's not much of an issue. I basically bought the TV to function as a monitor.Pros:*Nice solid blacks due to the dynamic backlighting*SD content from my Wii and DVDs displays beautifully.*Plenty of connections*Lots of complicated picture settings. I'm not a pro when it comes to calibration and viewing configuration, so my opinion is less valuable here.*Pretty decent sound for stock TV speakers.*Power-saving off mode to reduce parasitic power drain*Pretty low power for the size under normal operationCons:*The VGA input doesn't support HD resolution (!!) -- luckily, all of my computers have DVI/HDMI output*Sleeping the display (when a computer is attached, eg) results in an annoying \"No Video Signal\" announcement  bar to be displayed.*Sleeping the display also turns off sound (this is a minor nitpick, and soon won't matter since I'll have an external sound system)*Sometimes the image size options don't suffice for getting the picture to fill the screen properly. I really miss the setting on the AQUOS that widened things more as you approach the side. It usually resulted in a full-screen effect for SD content. The Toshiba options are to cut off part of the screen, or have black bars. Of course, due to the LED backlighting, the black bars are not noticeable which is nice.", "Date": "October 31, 2009"}, {"Title": "Great TV, now that the \"bugs\" are worked out.", "Author": "Craig \"Craig\"", "ReviewID": "R267H2VOJJVSRW", "Overall": "4.0", "Content": "I went to our local electronics store to buy a Sony 46\"LCD, when I saw the Toshiba, for $1099 I was blown away! An LED backlit LCD TV for that price, I had to have it. I've had it 9 days, and I really do like it in many ways. Amazing picture, esp. on HiDef. But, I have the dreaded \"garbled sound\" after 2-3 hours. I contacted the store, and they agreed to take it back if I wanted, but I really don't, if I can get it to work correctly. Toshiba suggested replacing the HDMI cable with component video (DVD to TV), and also audio cables,  I find that unacceptable. The Tech on their hot line, call 1-800-631-3811, was very helpful. He first suggested ditching my 1.3 HDMI cable & replacing it with a 1.4 cable. I ordered one, will find out in a week, after it arrives. He also suggested going into the setup menu, and under AV, HDMI, shutting off the \"Deep Color\" option, I did this tonight. Lastly he acknowledged that they had a firmware update they were working on, and it would be sent to me on 2/17, in the form of a USB flash drive that I can plug into the service port on the side & I could update the firmware myself. I will know more in a week or 2, so unless I have further problems in the meantime, I will wait & install the new cable, & then the firmware, & will update my comments then.I took a chance on it when I bought it, I believe this model just came out in Sept 09', so I will be patient,to a point.UPDATE: I was contacted this week (after asking for the the 4th or 5th time) that a \"Fix\" for the Garbled sound problem had been developed, and that I could call my local factory authorzed service center. I set up an appointment, and was pleasantly surprised when they tol me they would come to my house to repair the TV.Stay tuned, more to follow.........................OK, here's the final verdict.Buy a cheap HDMI cable.If you have the \"garbled sound\" problem, Toshiba has a fix, they will replace a board, under warranty, and provide in home service if it's less than a year old. They installed mine about 10 days ago, and the problem is now gone.", "Date": "February 10, 2010"}, {"Title": "In the end a ripoff  - 1 year old", "Author": "Andrew Lopucki", "ReviewID": "R1RGZ905IY4CNF", "Overall": "1.0", "Content": "The main flaw with our previous HDTV (Samsung) came when it failed completely (green screen of death) after only a little more than two years of use.  The problem appeared to be on the board that controls TV signal decoding.  Well Toshiba has topped that.  With little more than one year in, the sound is failing in very ugly ways.  We can work around it by switching back and forth to other input channels (that seems to reset the problem) but for $1300 I expect perfection for at least 5 years, NOT barely 1 year.We originally liked this TV after sniffing out specs on new HDTVs and going to the store to try to compare screens.  This one had the best overall brightness and clarity.  However, that hardly matters when the thing has a fatal flaw.Some other drawbacks:1) There is a border around the screen several inches wide.  Obviously the closer to edge-to-edge screen the better since the rest is just distracting away from the image.2) (a complete surprise!) there is only one coaxial input on the TV.  We have been using analog cable and HD over the antennae (airwave broadcast) for years.  With this TV, it took us a while to figure out that we could still do this by buying a coaxial switch.  Unfortunately that means that to switch from Antennae to Cable requires flipping the manual switch and then changing a setting from the remote control menu.  This is tiresome so we have all but abandoned the cable channels completely (on this TV anyway.)Non-issues: some complain that this TV is too thick (mostly compared to the Samsung model.)  We don't wall mount, so for us this is a complete non-issue as you can't tell how thin it is in the entertainment stand.  I suppose others might prefer the svelte look of the Samsung but there is something to be said about people who would buy a TV for the look of the case over the look of the TV image it produces (and the reliability of the product too given my previous experience with Samsung TVs.)", "Date": "February 5, 2010"}, {"Title": "Awesome and impressive TV", "Author": "Jason Garth A. Brown", "ReviewID": "R3JN30AMR41PNM", "Overall": "5.0", "Content": "Awesome TV! Beautiful blacks and impressive colors. You can even geek out on extreme adjustments to the color if you wanted to. The only disappointment was the fact that it's not a true 240hz feature. Which technically they don't say it is, but to insinuate with the whole Clearscan 240. One would infer that it is 240hz. None-the-less.... The picture quality is still extremely beautiful. And just as stated previously, it is not flat like the Samsungs and Sonys, but there is a very good reason for that. It is LED Back-lit. The extremely thin ones are LED edge-lit. This TV comes with a feature called Dynalight in which the LEDs actually turn off to give you the blackest blacks capable of any TV. And when you see it, it is impressive. So who needs ultra-thin when your picture quality can't be beat.Don't overlook this TV, it is an awesome set, and for the price it can't be beat. Oh and did I mention it is easy to use. The onscreen instructions are pretty self explanatory and it has a lot of options but it doesn't feel daunting. Great TV!", "Date": "April 13, 2010"}, {"Title": "Great Buy", "Author": "W. E. Brown", "ReviewID": "RPYQJPO39NIFB", "Overall": "4.0", "Content": "I had a Sony Bravia 40\" 60htz ... That went in the divorce settlement (ouch) .. so I decided to search online for a replacement. Have had the Toshiba 46\" for about a month and I am very happy with all aspects of the TV with the exception of the Glossy Screen. After having a Matte screen for so long, and not having to deal with the glare .. the glossy screen I could do without. Other than that, Great Value and I would recommend this TV to all that are looking.", "Date": "April 11, 2010"}, {"Title": "Had for 4 months and is great", "Author": "Rich T \"Rich\"", "ReviewID": "R3Q93AK3WWYEOB", "Overall": "5.0", "Content": "I got this in November and it's now February. The picture looks great - I highly recommend the 240Hz with LED backlight version. It looks even better with blue ray. The picture has fuzz when it's not an HDMI connection, but that's the type of wire used for the connection. They used AIG for shipping and they showed up on time and helped me carry it upstairs to my apartment.I would definitely buy from them again.", "Date": "February 8, 2010"}, {"Title": "Awesome bang for the buck!", "Author": "Notre Dame Man", "ReviewID": "RYWP8BMTNDD5U", "Overall": "5.0", "Content": "I waited about 10 months to post my opinion of this TV. Like some other folks here, I bought it at 6th Avenue Electronics.  I went into the store with cash for a similar, but much more expensive Sony unit.  The sales person told me to first look at some Pannasonic plasma they had on sale, which I didn't think looked great, and then he showed me this TV.  It was sitting in a row of Samsung and Sony TVs, and out of the 10 or so in the row, this TV clearly looked the best.  The color looked very rich and vibrant.  Then he told me the price, which was 700 bucks cheaper than the Sony I was going to buy.I refuse to buy anything this big without reading reviews, so I went home and did some research.  Worst things I saw were some cases of faulty audio, and a lack of internet hookup.  I decided to go with it....I have a 27 inch monitor for my pc...I really didn't need internet hookup on my TV.  Even better, Amazon had it on sale, and when I went back to 6th Avenue, they matched the price!  I felt like a winner at this point.... 900 bucks cheaper than the Sony, and it honestly looked better than the Sony in the store.10 months later, this TV is incredible.  I have both the PS3 and 360, both hooked up via hdmi ports, and they look stunning.  I watched Saving Private Ryan on it last weekend, and was just amazed.  And this is 10 months into owning it!!!!!  High Def TV looks amazing, and even regular cable looks alright also.  And, I have no sound issues at all.This TV is one of the best budget purchases I have ever made in my life. I may buy another for my basement! The most rewarding part was when I helped my buddy hang his $4000.00 Samsung half inch thin LED TV, and then hear him say \"Dude, your TV looks better than mine.\"", "Date": "August 16, 2010"}, {"Title": "Great TV - when you get a good one", "Author": "Caroline", "ReviewID": "R1G8QPV7FS7V7E", "Overall": "4.0", "Content": "Out of the box this TV is a beauty. It is heavier than most slim-design models so be sure to have a friend or partner ready to help.Set up is easy - plug in, tweak a few menu settings and you are ready to watch some great TV. I am pleased with the picture quality of SD and HD channels. The TheatreWide feature makes action movies come to life; it is even great for every day viewing save for slight distortion on the edges of the picture.Note that the screen is not matte - has a very shiny surface so probably not a good fit for a sunny room. I have it in a room with a large sliding glass door and window - no problems for my preference.The sound is good - I can have it turned up to a good volume to enjoy a movie or sports and it isn't blasting throughout the whole house.Overall I really, really like this TV - cresting on loving it.Now on to the negative: it is now May 11 and I have finally had this TV for a whole week now. Mind you I ordered it on MARCH 7TH; yes M-A-R-C-H.The first unit delivered was damaged in transit and had to be shipped back to the seller buy.com who is in California. The shipping alone took one week each way then another 3 day processing time for them to pull a replacement TV to ship ... back to the midwest 7 days later.2nd TV - a LEMON. When you turned it on there was a 7 second delay - 10 seconds of picture - then turned itself off for 20 seconds - then back on. Every so-often there would be no picture at all - not even to see the menu or input options - this was fixed by unplugging the unit & plugging it back in per instruction of a Toshiba tech.The audio either didn't work or had a significant delay which replicated an echo chamber. Buy.com sent instructions for the manufacturer to process a replacement and arrange for pick up - which took another week.I have two other Toshiba TVs that have been great (a 27\" digital that is now 10 years old; a 19\" analog that has to be nearly 20) and in my experience has longevity so I was surprised by this faulty unit.With this 2nd TV / lemon - [...] consented to start the replacement process once the TV was in the shippers possession vs. waiting another week until it was returned to their warehouse. Hello - thank you!This was the biggest regret for buying online - that there was no brick & mortar store to deal with locally and returns had to go through the shipping game. All & all this hassle of saved me $700-$800 from buying from a store. You decide if it is worth it to you.", "Date": "May 12, 2010"}, {"Title": "Worthless junk with no service or backup", "Author": "Unhappy", "ReviewID": "R3JRN9D6HDICDK", "Overall": "1.0", "Content": "I bought two 40\" REGZA's at the same time.  One is used heavily and is ok.  The other, used very, very little, has developed the streaks.  It is two years old and the local TV Expert/Repairman asked, \"Did you buy a warranty?\"  Of course I didn't.  He said, \"You are out of luck.  The display is bad, Toshiba doesn't care, and it will cost as much as a new set to get another display.\"I bought it at Best Buy #938 in Flowood, MS 39232, and they assured me that the Toshiba was as good as the two Samsungs I purchased at the same time, and in fact assured me it was as good as any in their store.I will never, ever buy anything by Toshiba again.JK", "Date": "June 6, 2011"}, {"Title": "Bad Sound worse Customer Support", "Author": "Dan L. Peffer", "ReviewID": "RHAHDZCC3AFSZ", "Overall": "1.0", "Content": "This set has a faulty sound board. There are no replacement parts in the pipeline.If you get one that has the bad board you wont get any support from Toshiba.Buyer Beware!Made claim in Sept. on the phone with CS as I type, betting I will get another brushoff.Never had such bad support for a product. Can't express my frustration explicitly, enough!", "Date": "April 12, 2011"}, {"Title": "BL Grapevine, TX", "Author": "Bob L", "ReviewID": "R3S0578SGPSIWM", "Overall": "3.0", "Content": "I rated picture quality and audio low due to an issue Toshiba is aware of but hasn't yet fixed.  When using HDMI inputs to the TV from any device (FIOS set top box, Samsung BluRay, etc.) the audio becomes distorted after about 2 hours. To overcome this problem I am using the ColorStream inputs instead of the HDMI.  ColorStream isn't affected with the distortion, but in my opinion the picture quality isn't as good as with HDMI.  Toshiba support claims they are aware of the problem and are working on a firmware fix.  It took me 2 months to report the problem (12/21/09)because I only had one HDMI device and wanted to eliminate that as the cause.  I will update my review when Toshiba has fixed my problem.", "Date": "January 10, 2010"}, {"Title": "Great tv but sound issue", "Author": "chevyburb", "ReviewID": "R19D0N81K6T1XX", "Overall": "4.0", "Content": "After about a month the sound started acting up. We thought nothing of it all I had to do was change source and all was good. We are getting a new sound system so that won't be a issue soon. I love the picture. The only other think is that it has a very shiny face and well if u are like me and have kids well I have to clean it every other day or so cause of finger prints. But still love the tv.", "Date": "May 19, 2011"}, {"Title": "Lost Picture after 2 months", "Author": "Brian Lee Robinson", "ReviewID": "R2P611HXFA9ZE1", "Overall": "3.0", "Content": "I purchased one of these TVs from a large web retailer back in December 2010.  We were quite pleased with the picture quality up until February 16 2011, when the screen went black and did not return.  The Toshiba tech folks were civil but not helpful - there's just not much that can be done when one of these goes out.  The TV is at a Toshiba warranty shop now, getting out who knows when.Caveat emptor.", "Date": "February 20, 2011"}, {"Title": "Toshiba Rega 240Hz LED", "Author": "Marshall Brasken \"Marsh16\"", "ReviewID": "R3EANBZDX17EOU", "Overall": "5.0", "Content": "This television was on display at several Best Buy Magnolia Rooms. The set was out performing Panasonic and other LED's and plasma's including Samsung and Sharp in the same category as well as units in higher categories. The LG and Sony efforts didn't even come close. It was our opinion that some of the 4 and 6,000,000 to 1 contrast ratio sets were also not providing as good of video quality. We were informed that this set may have a factory sound card defect but we haven't experienced that issue. We have it hooked up to U-Verse and have been complemented on the picture quality by family, neighbors, friends and even AT&T; tech's. After a few months we decided to add a Panasonic blue ray surround sound 5.1 1000watt home theater system. The installer wasn't sure if the two would be compatible. He was amazed how well Rega Link and Verialink coupled up. We are so pleased, we also ran an Ethernet line to the Blue Ray.  This set is a well kept secret and I would recommend buying one if you can. Oh, and buy the way, I called Toshiba's Customer Service about how the remote works and got instant service.", "Date": "January 3, 2011"}, {"Title": "LED Backlit LCD TV, not LED TV", "Author": "JC \"JC\"", "ReviewID": "R2OA0EYPEI2QQ", "Overall": "5.0", "Content": "Just to let you know Underhill, Samsung doesn't make a single LED TV, they make an LCD that's backlit with LED lights instead of CCFL lights. The only LED you can purchase right now is a 12 inch LED from Sony which runs about $7000, that is a TV screen made up of lots of tiny LED lights. The \"Samsung's LED\" TV's as they call them are nothing but a traditional Liquid Crystal Display like any other LCD except the lights behind them are different. Plus the Samsung one isn't totally backlit only edge lit so the contrast in the middle of the picture isn't the same as the outer edges. So do some research before you buy, LG and Sony both make very good fully LED backlit LCD TV's, not just edge lit, so you get much more even contrast across the whole screen plus the benefit of \"Local Dimming.\"", "Date": "October 21, 2009"}, {"Title": "This is why you do research!!", "Author": "Happy Customer!!!", "ReviewID": "R3CQZYJQKDDXR1", "Overall": "5.0", "Content": "This TV is a superb TV!!! The colors POP because the black levels are the best on the market, 240hz refresh rate makes sports look AWESOME!!! Not a better TV out there, especially for the price!!!", "Date": "February 5, 2010"}, {"Title": "Awesome TV but the sound sucks", "Author": "Troy E Bartlett", "ReviewID": "R22PQRAH53GFZ", "Overall": "3.0", "Content": "So we got this TV around Feb. 16, 2010 and I loved it right out of the box.  The picture is great, HDMI cable is great, Blu-ray DVDs are great, my PS3 games are great.  Then came the sound problems.  I didn't know what to do so I called Tech.  They thought it was my cable and to contact them and if it wasn't that call my local Toshiba dealer.  Well, nothing worked so we returned it and got another one.  Once again things were great until the sound problems started occurring again!!!  So, I decided to read some reviews and see if other people were having the same problems.  To my surprise more people than I expected have had the same problems.  I changed some of the settings and if that doesn't work I may change my HDMI cable as suggested in a previous review, and then call Tech again.Good luck to all.  It is a great TV, minus the sound problems, if it happens to you.", "Date": "April 26, 2010"}, {"Title": "Known Regza issue", "Author": "jtech50", "ReviewID": "RDXVOH2EUPNO5", "Overall": "1.0", "Content": "I have had the same vertical lines issue with a Regza model 52HL167 but am fortunate since it's taken over 36 months to show up. I say fortunate because this is a well known issue with 52\" Regza's from the 2008 year models (looks like the same with the 40\" and 46\" as well) and sometimes this begins to show up as early as 18 months. There are stories/angry customers all over the internet, just Google the issue. The consensus is that Toshiba support says \"sorry you're out of warranty\" when you let their customer support know. The problem is that the LCD panel is defective and the only solution is to replace it for roughly the cost of a new TV. Toshiba is losing lots of customers over it and I am expecting someone to eventually file a class action law suit due to the size and scope of the issue. My future purchases will be either a Sony or Samsung . . . no more lousy Toshiba's!", "Date": "November 15, 2011"}, {"Title": "picture true", "Author": "Richard J McLean", "ReviewID": "RE12WSEO9WXZE", "Overall": "4.0", "Content": "only sound was average. Since I wanted it as part of an in place sound system the TV sound is not used, but heard through the present speakers and receiver. This works out very well. This is my second Toshiba TV in less than 4 yrs. The first was excellent, but technological developments in the intervening years has made this a worthwhile investment. The picture itself is definitely a large improvement.", "Date": "January 11, 2011"}, {"Title": "Great value", "Author": "wunderer", "ReviewID": "R3K8JDHAYQ3RJP", "Overall": "5.0", "Content": "This HDTV fit my needs perfectly and at a super price point.  It's not the slimmest but that was not a issue for me.  240 Hz and LED back-lighting sold me.  It has all the inputs and outputs you need.", "Date": "July 7, 2010"}, {"Title": "Toshiba REGZA  46SV67OU 46-in TV", "Author": "Regina E. Haskins", "ReviewID": "R1MPAG6JW2VGLF", "Overall": "5.0", "Content": "This TV is teriffic!!! Great picture; sound quality is the best (I have a hearing problem in one ear, but this sound system is fine); fits exactly in the corner of my living room on a corner cabinet. Amazon chose and execellent vendor for delivery and the delivery person could not have been more helpful and polite.  Everything's great! What else could you say?!!!", "Date": "May 27, 2010"}, {"Title": "Tight fit", "Author": "The Skeptic \"Wolf Ranch\"", "ReviewID": "RIZBNIV7ZQHYA", "Overall": "5.0", "Content": "I purchased a TV entertainment enclosure from IKEA.  It said it would accommodate most TV's up to 46\".  The Toshiba 46\" fit into it like a glove. It took some precise measuring for the mount but I managed to get it in with the base setting on the bottom of the enclosure, leaving a 1/2\" opening at the top.I realized at the beginning it would be more or less permanent, so I cut an opening in the enclosure rear panel to have access to the connections, about a 10\" X 10\" opening.I also realized that the heat build-up from the TV could be a problem.  Contacting Toshiba via email, they responded immediately and agreed there would be a problem and their warranty would not cover it.  So on the Plan B.  I installed a quiet muffin fan, about 4\" square, blowing out from the opening I had cut.  Then I installed a switch at the electric outlet to control the fan.  There is some noise from the fan, but ever so slight, and it disappears once the TV sound is on.  The cooling is excellent, with the top of the TV barely warm after hours of operation.My suggestion is to avoid tight-fitting enclosures to mount your TV!", "Date": "June 12, 2010"}, {"Title": "The Good and Bad", "Author": "M. Bogusky \"MB\"", "ReviewID": "R1L23IYVMJQVXI", "Overall": "2.0", "Content": "TV arrived today 5/24/10 from Amazon.com distributor.Good: Shipping condition, picture qualityBad:TV manufacture date is August 2009! Really, almost a year old!  Not as good a deal as I thought I was getting.PS3 via HDMI does not work at all except in 480p.  PS3 via component cable supports all formats, so its not the PS3.Menu is lacking and fixed audio output audio is so low that my stereo is near full blast to get sound.Looks like lots of menu options are greyed out.  Expansion?  I've read of firmware upgrade (mine is dated Feb 2009).  Anyone know what if there is a new one out?Already on the fence about returning it and its only a couple hours old.", "Date": "May 24, 2010"}, {"Title": "Picture not what I expected", "Author": "Amber M. Ward", "ReviewID": "R1Z1UA57VBXDO9", "Overall": "3.0", "Content": "We researched and researched before deciding on the Toshiba LCD-LED.  When it arrived, we were so excited only to be disappointed by the picture quality.  HD channels look pretty good. Non-HD look very grainy.  Sometimes the picture size switches from show to show or even on commercials.  It gets annoying when the size moves to a small box on a big screen.  We are not completely unhappy with this product, but I would not purchase again if given the chance.", "Date": "April 16, 2010"}, {"Title": "Regza", "Author": "R. L. Underhill", "ReviewID": "R1HTUPUYTO5GVA", "Overall": "2.0", "Content": "I purchased a new Regza in June 2009. Three months later the picture has vertical blue lines and when red is displayed, I get vertical red lines running from top to bottom. They fade in and out when each color is displayed on the screen. Very distracting for an expensive TV. I called Toshiba and they didn't seem to care. I looked on you tube and found others that have the same problems.Would I buy another Toshiba Regza ? Hell no.Now, I have to find a repair center and haul it over there. Lucky me.I think I'll try Samsung LED next. No more LCD'sIf you own a Regza now, better hope is doesn't start the vertical line crap.", "Date": "October 16, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p Full HD CineSpeed™ Display with Built In ATSC/QAM Digital Tuner for Over-the-Air and Cable-in-the-Clear Digital Tuning\nFocaLight™ LED Backlight with Local Dimming\n2,000,000:1 Dynamic Contrast Ratio\nClearScan 240™ with New Backlight Scanning Technology\n4 HDMI™ Digital Inputs (1 Side) with InstaPort™ and REGZA-LINK®2", "Name": "Toshiba REGZA Cinema Series 46SV670U 46-Inch 1080p LCD HDTV with LED Backlight and ClearScan 240, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/319dkG8Nu2L._SX300_.jpg", "ProductID": "B001TOD3K0"}}