{"Reviews": [{"Title": "Boy, was I pleasently surprised!", "Author": "M. K. Russell \"Techy Guy\"", "ReviewID": "R1NUI5XI7XLBP7", "Overall": "5.0", "Content": "I began my search for an LCD HDTV/Monitor over a month ago and purchased 4 other similar items before purchasing this ViewSonic VT2430 and returned the previous 4 for poor performance.  I was actually looking for a unit which included a DVD player for use in training lectures.  But, I couldn't find the right combination so I decided to settle on a unit without the DVD player, since those that are built in are all cheap players.  This way, by keeping the TV and the DVD player separate I can always update the player as needed (BlueRay!).  I looked at a LOT of HDTV/Monitors and chose the VT2430 for its native 1920x1080 pixel resolution.  This works out perfectly with the 1920x1080i signals coming via my cable.  And...the pictures are absolutely stunning!  More so than I even expected, even already knowing the quality of Viewsonic monitors.  And there are plenty of options for modifying and managing the images from all inputs.  One reason for returning a Toshiba unit was that it's native resolution is 1680x1050 pixels, which, when fed a 1920x1080 pixel signal (HDTV) stretches the image vertically...without any way of correcting the distortion.  In fact, the manual states that \"image size adjustments are not available with 720i and 1080i signals\"!  VERY poor planning as most cable signals are either 790i or 1080i.  The PC image obtained with the VT2430 is absolutely awesome.  I'm typing this review with this monitor with the resolution set at 1920x1080, a perfect match with my PC.  There are at least 10 other resolution settings that work as well - just lower resolution results.  Regardless of the resolution sent from my PC, the VT2430 automatically adjusts for the best picture with each setting.  Very neat.The audio was another problem I found with all of the other units I tried.  Most of them were either too low in volume or, when the volume was turned up became very distorted.  Not so with the VT2430.  Plenty of clean sound at all volume settings, including loud enough for filling the rooms where I do my training.The image I get from my (LG) DVD player, which upgrades to a 1080i output via an HDMI cable, is very good.  I also have a BlueRay player which puts out a 1080p signal, which, again, perfectly matches the resolution of the VT2430, for a beautiful picture.  The overall picture of this monitor is far more accurate, clean, and viewable than any of the other monitors I looked at.  The dynamic range is very wide, including the darker colors and grays and blacks, not quite up to my 52-in Samsung (Over $2,300!), but closer than any other comparable sized monitor.  Physically, I like the fact that the monitor can be tilted back for watching from higher positions.  Also, the flat stand can be quickly removed for transporting in its original box, which I do often when I'm training.Great monitor.  I would recommend it to anyone.  I would, however, downgrade its rating by 1/2 point for not having a DVD player.  But, that is not what it is!  ViewSonic does sell an LCD HDTV/DVD Combo monitor, but it has a lower pixel rate designed more for 720i resolution, which is OK for most uses at this smaller size.  But, having been a TV studio tech in charge of adjusting and maintaining studio monitors, I became too picky and always need(!) the best.", "Date": "April 22, 2009"}, {"Title": "Easily surpasses expectations", "Author": "J. DiMarco \"Professional Skeptic\"", "ReviewID": "R3F72132FP0UIR", "Overall": "4.0", "Content": "Why a ViewSonic VT2430 24-inch 1080p? The VT2430 24-inch was selected as the smallest set compatible with our dinette area. The decision was helped by my experience with another 1080p. Some highly reputable reviewers tend to dismiss 1080p in a set this small (disclosure: We have a nice 19\" Sharp 1080p, too).One thing usually overlooked as regards sizing is how legible English subtitles appear at typical viewing distances. The 24-inch set gives ample legibility for the furthest viewer (11 feet) without sacrificing detail for the closest (7). Tech recommendations specify a minimum screen size of 40 inches for 10 feet viewing distance --- much too large to keep in our dinette.The range of available sound power available is stunning. Why have an energy-saving LCD HDTV, if you have to add a power-burning amplifier to get adequate sound? With our VT2430 a family member with some hearing difficulty has absolutely no auditory problem. Except to test, we have never used a sound level much over half what the VT2430 delivers. With my older Sharp however, the maximum sound level is inadequate whenever a window air conditioner runs in a 10' x 16' room.We were concerned about our over-the-air reception due to the effect of a new metallic roof on our attic-mounted antenna. With just a cheap, indoor, amplified antenna we pick up more stations than with pre-roof, standard TVs, and indications are that an external antenna will eventually restore the PBS stations lost due to their reductions of transmitter height with transition to DTV.Set-up and remote use are very easy. The best surprise was perhaps the on-screen DTV program \"Guide\" the VT2430 provides. The program listing was not expected and is sometimes very convenient, as our local newspaper does not carry DTV channel listings yet. Wish my old Sharp had that feature.With its many positives and superior quality this set would rate 5 stars. Since we have not owned our VT2430 a year, it would be unfair to attest to its durability so soon, however.", "Date": "June 3, 2009"}, {"Title": "Great 1080 bedroom HDTV", "Author": "notmicro \"notmicro\"", "ReviewID": "R1MUZ42RBBC9UX", "Overall": "4.0", "Content": "This unit's main claim to fame is that, at this time, its about the only 1080p HDTV available in this size-range which has the full set of video inputs. I decided to take a chance and upgrade my old 23\" 720p \"HD-ready\" bedroom set, since I was hankering to go up to 1080 with a built-in ATSC tuner. And yes I can definitely tell the difference from 720.ATSC tuner: works fine, reasonable sensitivity, broadcast 1080i is spectacular of course.QAM tuner: I've just been experimenting with clear-QAM, which my CableCo now provides quite a bit of (I do not yet subscribe to digital cable, and have no set-top box). The only annoyance is that when I use the set's handy programming function to manually \"name\" each channel (up to 8 characters I think) it sometimes looses some of the entries. Also every once in a while some \"hidden\" channels suddenly start showing up, and I have to manually \"hide\" them all over again. Luckily in Cable mode the tuner correctly intermixes legacy NTSC analog and clear-QAM digital channels transparently; I don't have to switch modes.HDMI from DVD player: I use it with an upconverting DVD player; aspect-ratio has to be changed manually. Wide-screen DVDs look great.HDMI from computer: from my older Mac laptop's DVI output; worked great and the Mac's video auto-sensed the full 1080 screen size and set it up as monitor #2 which was VERY convenient; I didn't have to adjust anything. The image was perfect. I suspect that if people experience problems with PC video, they may be encountering issues with their video cards or drivers, and not the monitor.Composite video: I've used it with an old VCR, no problems. The upconversion is OK; this depends greatly on the quality of the source of course.Sound: I don't use the built-in speakers; I've got the audio-output connected to my sound system.I haven't tried these inputs: VGA / Component / S-videoThe picture quality of the panel is reasonable for this low price-range - its certainly better than my old 720 panel, especially the black-levels - but its not going to win any videophile awards. Sometimes the blacks are a bit \"plugged\". I notice a very small amount of light-leakage around the edges when the screen is black.", "Date": "May 19, 2009"}, {"Title": "Two Tv's, both defective", "Author": "Kelly Jordan", "ReviewID": "REHEOOZ7C1SEX", "Overall": "1.0", "Content": "Received the TV very quickly, and worked fine when first out of the box and hooked up through component cables and a DVD player. After being turned off the first time, however, whenever I tried to start it up, it would go to the ViewSonic logo, sit there for a few seconds, then restart itself! No button input (from remote or the bottom panel) would work.I called ViewSonic, and the phone tech had me try the \"hard reset\". Did not work. The said it was something defective in the hardware, and to return it.I requested a replacement through Amazon, and, again, received the replacement very quickly. The same exact thing happened with this one! It would work the first time, then go into a loop any time after that! I even hooked this TV up in a different room, thinking it could be some sort of power surge.I am guessing that ViewSonic put out a bad batch. No replacement this time, just a refund.", "Date": "February 24, 2010"}, {"Title": "Worked for 30 minutes", "Author": "K. Byrd", "ReviewID": "R18HKVGAREBH9C", "Overall": "1.0", "Content": "Plugged it in, nice picture and sound for a guest bedroom. Turned it off. Next day turned it back on...kept rebooting. Figured it was the cable box. Nope. With just the power cable plugged in kept rebooting....also noticed one stuck pixel. Called tech support. Told it had to be into service for the software to be updated. Asked if I could do this myself, negative. Nice. Viewsonic used to be \"the\" company for quality. Maybe this is a one off. Going back for a refund instead of replacement.", "Date": "May 13, 2010"}, {"Title": "Avoid this monitor at ALL COSTS!!!", "Author": "J. Greear", "ReviewID": "R13WOJH5OWJIZF", "Overall": "1.0", "Content": "This monitor is a KNOWN LEMON MODEL.  If you just google the model number you will find NUMEROUS situations where someone bought this, it got the \"endless loop startup logo\" problem, they got it replaced, and the replacement did the EXACT SAME THING.I got the endless loop bug only the SECOND TIME I turned this monitor on.  The CSR at viewsonic knew EXACTLY what the problem was when I told him and said the only solution is to send it back and get a replacement.  Viewsonic is WELL aware if this more than common problem yet the only way they will acknowledge it is if you call them with a broken one.Amazon should NOT be selling this monitor at all.  STAY AWAY!!", "Date": "April 30, 2010"}, {"Title": "does the job", "Author": "fried003", "ReviewID": "R37UKDC9MOYBLQ", "Overall": "4.0", "Content": "This replaced an old Panasonic tube TV in a bedroom. At first I bought a 22\" VIZIO that I couldn't see the picture from where I normally watch the TV. This 24\" set is watchable from the same angles as the 22\" VIZIO that was un-watchable.  The picture is fine.The old Panasonic volume at level 4 was much too loud & level 3 was much too low. This TV has a better volume graduation scale as I can hear at a suitable level.The TV has a sleep timer to shut-off after X minutes, but I wish it also had a settable clock function in order to have it turn-on automatically at a given time, like an alarm clock - but it doesn't.Can be used as a monitor also.  A decent-sized 1080p LCD-TV at a great value - what's not to like.", "Date": "April 16, 2009"}, {"Title": "Worth its price", "Author": "Scharn", "ReviewID": "R2ZV4JXJQV49Y0", "Overall": "5.0", "Content": "Overall I am very pleased with this TV and it suits the purpose for which I bought it: a 12x12 room with VESA wall-mount.  The physical appearance is great and it's very easy to use.  I tried all of the inputs and here's what I found:- HDMI is perfect for Blu-rays; the DVD up-conversion is so-so (there can be digital artifacts several times in an entire movie)- The component looked (to the naked eye) the same as HDMI- The composite looked much better for DVD than HDMI/DVD, but it still wasn't awesome. This is why I rate the picture quality as 4 instead of 5.The sound quality is acceptable.  It's nothing to go WOW over but it certainly is clear enough to comfortably enjoy in a 12x12 room.As a computer monitor, the VGA hook-up is perfect.  If I wasn't using it as a regular TV, I'd use it as a PC monitor in a heartbeat.  Crystal clear text and did not see any ghosting of any kind.If you are trying to code a universal remote to this TV, enter codes for Philips / Magnavox (if Viewsonic ones are not in your manual).  With that said, I was not able to find one where the \"Input\" button worked on the universal remote (and I tried quite a few).  Volume, channel, and TV power all worked fine with Philips / Magnavox codes.WARNING: Do -NOT- try to use a Panasonic DMP-BD60 Blu-ray Disc Player with this TV; there was a terrible amount of artifacts (Blu-ray was bad and DVDs were unwatchable).  When hooked up to different devices, both the TV and player work fine.  I ended up switching to a Sony BDP-S360 Blu-ray Disc Player and it works perfectly with this TV.", "Date": "November 10, 2009"}, {"Title": "Research more before buying.", "Author": "CABLE_GUY", "ReviewID": "R1OJQ1VQ7ISJNE", "Overall": "1.0", "Content": "At the time I bought it, it was the only 24\" 1080 tv available and 24\" was just the right size for my application. Sorry i bought it.The first one arrived and it didn't even power on. Sent it back.The replacement came...*The sound from the speakers is terrible. I could swear there are two tin cans attached to the front of the unit.*There is a bug. When selecting Channel 53-1 the tuner automatically then changes 22-1 every time.*When you have a mix of analog channels with digitals the channel changing is very slow. Some channels take about 3 seconds to change (cable TV source).*The on screen menu is tiny. Hard to see the text.*I think the buttons on the remote are not layed out very well.*The pedestal does not tilt. It snaps into place (one time only) and locks straight ahead.*Had the TV about a year now and starting to see the back light seep around the edges. Don't know if that will be an issue in the long run.*On the plus side, when you do get a good HDTV signal source, the picture is very good.Do more research if your thinking of getting this TV.", "Date": "December 31, 2009"}, {"Title": "Inexpensive TV with plenty of inputs - backlighting issues", "Author": "W. M. Barber", "ReviewID": "R3DKFKC6Y34CIM", "Overall": "3.0", "Content": "We got this to go in our bedroom and tried to put it where our old CRT TV was (on top of a 6 drawer dresser a few feet from our bed) and it was too high the viewing angle from the bed was too steep and the picture was too dark. We moved it to a eye level position on a lower dresser and that was much better but we can still see the back-light bleeding through in the middle of the top and bottom of the screen - a minor annoyance and something we can live withA note to those of you with TiVo's out there the Remote code for this TV is 0310 (it's the Gateway TV Code - Viewsonic is missing from TiVo's list)", "Date": "September 11, 2009"}, {"Title": "Good deal!", "Author": "Robert Bethel", "ReviewID": "R325Q9PW4Y1F6S", "Overall": "5.0", "Content": "The only beef I have with this product is the lack of easy connections. Everything is on bottom requiring tipping the TV over in order to connect anything. I really like the ability to adjust the viewing aspect on the remote, easily adjusting between 4:3 and wide-screen modes. For the price, this unit is great! I would have given it \"6\" stars if the connections for additional sources had been more convenient.", "Date": "September 23, 2009"}, {"Title": "Beware this tv", "Author": "Alan M. Lynn", "ReviewID": "R1KN0CWU8PI1OW", "Overall": "1.0", "Content": "Viewsonic 2430 LCD TV/Monitor. I unpacked the TV, it is a good looking TV. I did the setup and watched for about an hour. I set the sound to SRS, this may be important. I turned off the TV, when I went to turn it back on it would only show the start screen, then it would recycle endlessly.In my pre-purchase review I had not heard of this. A call, or 3, to Viewsonic and they had me try a \"reset\" which was to either unplug the unit, or not, and hold the \"menu\", \"channel +\" and \"power\" buttons and then release all three. This has apparently been tried by numerous customers besides myself with no results.One person put forth that this is an issue with the SRS. People who did not use this did not, as far as I read, have this problem, maybe.For the few minutes it worked it looked nice.Google vt2430 reset to see the results.", "Date": "May 21, 2010"}, {"Title": "Worked for about 3 hours", "Author": "J. Pratt", "ReviewID": "R32SHY2ZNST9WL", "Overall": "1.0", "Content": "I had high hopes for the VT2430. Read some pretty good reviews but also read a lot of reviews about the set having some issues. I figured a few people had some bad luck with their non working sets. I hooked it up to my xbox 360 and played for about 3 hours. It looked pretty good. The next day I go to turn it on and it kept cycling the Viewsonic logo.Called ViewSonic and the rep seemed to know right away that it was defected. Bad news he said id that they have none in stock and I could send it out for repair. Thankfully the place who shipped it to me, J&R;, allowed me to send it back for a refund. Gonna spend a little more this time and go with a better brand name.", "Date": "March 24, 2010"}, {"Title": "Great buy, makes PS3 games look AMAZING!!", "Author": "Michael T. Allen \"Mike Allen\"", "ReviewID": "R15UK9LD6P9AXV", "Overall": "5.0", "Content": "Reading some of the other reviews I thought this tv was going to be decent. and since it was on sale for $250.00 I decided to get it. I was completely surprised! It really is 1080p HD and it operates the 1080p at 60hz.The picture quality is amazing and it's very bright. If this is your first HDTV remember that ALL HDTVs have a viewing area. So if you are a little higher or lower than the tv the quality will seem off.If you have a ps3 or blu ray player just get an HDMI cable and it will blow you away. I have this in my bed room so the sound is more than enough, I normally have the sound on 18 and that's only like an 8th of how high the volume goes. The menu is a little tricky to get the hang of at first. But after a little while you get the hang of it. Also the remote isn't exactly ergonomic and can seem weird but all of the buttons are positioned good and it's very easy to use.If you hook it up to a ps3 make sure you go into the ps3 settings and disable all other display sizes but 1080p because the ps3 will automatically default to 720p sometimes. I've played Borderlands, Fallout 3, Red faction, Metal gear solid 4, litle big planet, saint's row 2, and a bunch of rented games and it just blows me away everytime.The 24\" isn't even small. My previous tv was one of the older bulky 27\" Tv's. The screen is almost the same size, and since ps3 games are in HD the game will fill out the screen perfectly with nothing chopped off the edges. Even co-op or splitscreen games are perfect fit on this tv, it's just a Beast!Don't listen to reviews that this tv is anything but exceptional, especially for only $250.00 it's a Great deal! I would definitely buy it again.", "Date": "January 4, 2010"}, {"Title": "Great TV, even better monitor", "Author": "Andy", "ReviewID": "R1TBDPD3JTN01U", "Overall": "5.0", "Content": "I chose this TV because I live in a studio and don't have enough room for both a TV screen and a computer screen.  I was already using my computer to watch movies and living without a TV, but only so much is available online (particularly live events).  It was very hard to find a screen with high enough resolution to work as a computer monitor, but this TV was a perfect match!First, on TV attributes, the picture quality is great and many non-HD channels give me an option to \"zoom\" and fill the screen if needed.  I also have a 20-yr old Nintendo and a 25 year old Atari, another reason for getting the TV, which work terrific and automatically stretch to fill the entire widescreen without too much distortion.  My only gripes are channel management is a bit clunky and the blue power button right on the front is a bit of a distraction.  Sound is also mediocre but obviously you're not going to find $500 speakers on a $300 TV.  I output the TV through my receiver stereo speakers and the sound is much much better.As a computer monitor this TV really excels.  Resolution is consistent with what you'd find on a standard widescreen monitor, so there's no blurriness common with outputting a signal through a standard CRT.  Also after several LCDs over the years this is my first with no dead pixels.  Great job to ViewSonic on quality control.  I haven't tried gaming yet, I probably wouldn't push it anyways, but DVD movies output just as if I had a DVD player hooked up to the TV directly.  Just perfect all around as a monitor, though if you use Windows I suggest switching the theme to one that allows extra large fonts if you find yourself squinting.", "Date": "September 29, 2009"}, {"Title": "Great product but WARNING:Do Not Turn On SRS!!!", "Author": "JakeTheJaw", "ReviewID": "R18O6HFWIV3KCZ", "Overall": "2.0", "Content": "This monitor should come with a warning label \"Do Not Use SRS Audio\" ...  It will jack the firmware of the monitor and you will be stuck with power cycles over and over, rendering the tv/monitor completely useless.  No amount of reset attempts will fix it.  If I could do anything to take back turning that feature on I would.  I loved this monitor when I bought it, waited for it while it was sold out, used it for gaming and a couple movies, and all of it looked amazing.  I was shocked, pissed, and angry when I read two other reviews that had this warning and of course it was only after mine had suffered the same fate.DO NOT TURN ON SRS AUDIOI now get to play the manufacturer return game and hope my next one looks as good and sounded as good as this one did before I changed that one setting and killed the unit...DO NOT TURN ON SRS AUDIO", "Date": "June 27, 2010"}, {"Title": "Out of the box broken : power cycles on and off.", "Author": "S. D Shearman \"SShearman\"", "ReviewID": "RSQT9OTN7YK1M", "Overall": "1.0", "Content": "As with others, the unit I received is broken--powers on and off over and over again. The viewsonic logo appears for a moment when the unit is on. Craptacular.Worthless. Returning. Roll the dice, maybe you'll get a good unit.", "Date": "May 29, 2010"}, {"Title": "A little TV with a bright future", "Author": "B. Barnum", "ReviewID": "R3K4KSQQX95SHI", "Overall": "4.0", "Content": "I read lots of reviews before I bought this TV. One review said the sound was tinny? It's way not! I set mine to music and it sounds awesome, if you set to surround sound it's very loud. the tv is slow changing channels with just a coax directly into it, but I got a HD box from the cable company and since then it changes quickly and I have to admit the HD channels do BLING off the screen. Very awesome TV for an even better price!No complaints, I love it and may consider buying a bigger Model for the living room. If you're like me and read a lot of reviews and are deciding what TV to buy. This is it!!! Buy it now. Trust me!", "Date": "November 23, 2009"}, {"Title": "Two defectives in a row", "Author": "Scott \"Scottso\"", "ReviewID": "RY818DVD2XFDZ", "Overall": "1.0", "Content": "Beware this TV.  I bought this small TV to use as a small screen in my office connected through HDMI to my blu-ray player.The first set worked fine out of the box.  I turned on the TV, got the pretty Viewsonic \"parrot\" logo and set the input to HDMI. I loaded up a movie, adjusted the TV options to my liking and watched the whole thing.  I then powered it off for the day.  The next day, I turned it on, got the pretty Viewsonic logo and here is where it went bad.  The set then turned itself off, turned itself back on, showed the logo, over and over again -- apparently stuck in some sort of \"reboot\" cycle.After unplugging everything and plugging everything back in to no avail, I made the call to Viewsonic.  The tech support guy had me try to hardware reset the TV (menu, channel + and power) to no avail.  At this point he told me to just return it to Amazon for replacement since I had just bought it.  This is what I did.I also took the time waiting for my replacement to Google for others with the same issue.  Mine is apparently not an isolated incident.Amazon shipped me a new one promptly.Being suspicious after reading of others having the same issue, I plugged in my blu-ray player, powered up the replacement TV, made my menu adjustments and immediately turned the TV off and back on.  This replacement TV had exactly the same issue as the first.Again I called Viewsonic tech support.  I explained the situation to the tech support guy and this guy told me it was a firmware issue with some of these TV's and that I would have to ship the TV to Viewsonic for repair.  Frankly it wasn't worth my time and effort and all the paperwork they wanted me to fill out (and credit card info to cross ship) and I opted to just return this second TV to Amazon for a refund.Obviously there is a known (to Viewsonic) issue with this television.  I can only conclude that some combination of menu choices tickles this firmware issue and I will be spending my money on another brand.", "Date": "April 20, 2010"}, {"Title": "Good Value", "Author": "LakersFan \"Rick\"", "ReviewID": "RRZ7TBKF7YLMO", "Overall": "5.0", "Content": "Bought this ViewSonic 24 inch LCD TV about a month ago.  It is worth every penny for the fraction of what a full 1080p cost.  Most 720 LCDs for the same size cost this much.  Very happy with this purchase!", "Date": "October 19, 2009"}, {"Title": "great tv!", "Author": "J. Jones", "ReviewID": "R6XR5U4J1WKJ2", "Overall": "5.0", "Content": "We are very pleased with our new television.  It fits perfectly in the space we purchased it for, and has really good picture resolution, crisp and sharp with excellent color.", "Date": "September 18, 2009"}, {"Title": "i can see clearly now...", "Author": "DFunkular \"...be calm...\"", "ReviewID": "R2Q9TDYE8I3I6H", "Overall": "5.0", "Content": "this television works great. the speakers don't put out the greatest audio, but going into the settings and turning on the surround sound works fine. after fiddling with the settings for a while the sound can be adjusted accordingly. it's not that big of an issue unless you don't have a home theatre receiver. the video is great. the stand doesn't do much in terms of adjustment, but it works fine. overall this TV works great.", "Date": "August 11, 2009"}, {"Title": "An excellent Bedroom TV for the KIDS!", "Author": "Tarun Chachra \"Tarun Chachra\"", "ReviewID": "R1VZ6K72OQMSYN", "Overall": "4.0", "Content": "My kids have been asking for their own TV for a long time and we did not really want to give one to them...however we finally decided it was time to put one in their bedroom...without breaking the bank.I looked everywhere and even checked out various brands...this was the best value and a known brand so I went with it.  It includes the documents, a remote, batteries, the stand, and that's about it...simple and useful.There are a variety of connectors on the back..  HDMI, RCA, RF (for cable/sat), PC (VGA connector for computers), Computer sound IN (see below)and Microphone Input.One thing that put this over the top for me when I received it was the ability to take an output from your computers sound card and plug it into the TV...meaning all computer sound would be played back on the TV speakers.  (Yes the TV speakers STINK...as they all do in small LCD's).We connected this to a RF signal from our Satellite Tuner in another room...so no HD picture.  However, it does such a great job of playing standard definition that it is very hard for the kids to differentiate...yes I can see the difference but they cannot.  The best thing is if they do tune in to a HD channel they see a letterbox format image...Why then have I rated this a 4/5 - Simply because the package arrived and looked like it was a RETURN...but since everything looked like it was in new condition I was ok with keeping it.  Thankfully we are always assured of a great product via AMAZON.", "Date": "July 22, 2009"}, {"Title": "Very Pleased", "Author": "Benjamin P. Piccola \"ppiccola\"", "ReviewID": "R1RRTL46BCV25H", "Overall": "4.0", "Content": "I purchased the VT2430 three weeks ago to replace the 10 year old tube tv in our travel trailer. Currently this is the only 1080p in this size. It fit in the space on the existing swivel pedestal the old tv was mounted on in the entertainment center. I drilled 4 screw holes and was in business. We carry a Sony playstation to use the upscale 1080p conversion on regular dvd's and play the blue ray dvd's. The VT2430 has excellent picture quality and the VT2430's surround sound mode really helps the sound quality when playing dvd's. The non glare screen is a major plus for use in the travel trailer, because of the bright light from all the windows. I always had to cover the windows during the daytime to cut the glare from the old tube type tv. With the VT2430 The curtains are open and the picture is great from any angle and no glare!I give it 4 stars because the base, to me, is a negative. It seems to flex too much when the trailer is moving, I am not sure the base will handle open highway traveling without breaking off. So we take it down to move, which is just a minor aggravation. I sent two email questions to View Sonic support three weeks ago asking about the base but still have not received a reply.  I still recommend it because of its overall performance.", "Date": "May 29, 2009"}, {"Title": "DISAPPOINTED", "Author": "Marie E. Macri \"creation gal\"", "ReviewID": "R2LWRAZXZ4GCJQ", "Overall": "1.0", "Content": "Sadly -- this may not be anyone's fault except the shipper.  The box was crushed when it arrived -- it should have been put into another box for shipping.  I suppect it had been dropped.  The on and off power button would not work.  All you could get was a picture of 3 birds on the front of the screen.  I contacted the manufacturer and they even sent me the \"reset\" instructions -- but never could get to the \"menu\".  I really can't review the product since it didn't work.  I had followed the instructions on how to assemble the product -- but once I had snapped it into the base -- to return it -- I could not snap off the base but instead had to unscrew the base to put it back in the box and return it.  5 Stars to Amazon that refunded my money immediately when the received the returned product.  It looked \"nice\" and would have been the perfect size for what I needed.  Not sure I will try ordering TV products on-line again.  Too much chance for breakage with shippers being so careless.", "Date": "June 7, 2010"}, {"Title": "Don't deal with ViewSonic.", "Author": "Edward W. Roddy \"Ed Roddy\"", "ReviewID": "R3C1IVY2C7BBMD", "Overall": "1.0", "Content": "I received my ViewSonic on 6-7-10> Started to Set it up, The next morning when I went to turn it on it didn't turn on just set there and flash a picture of three birds off and on. I couldn't even turn it off only way to stop it was to unplug it/ I called VtewSonic customer support hoping that there was a reset button. The reply was that my problem was a firmware problem and the set would have to go to the ware house to be taken fixed. They sent me the paperwork to return it (at my expense!). The set was recieved on 6-16-10 at the warehouse and today is 7-2-10 and I haven't recieved anthing from them, I have emailed them with no response. Ask me if I ever will buy ViewSonic again?", "Date": "July 2, 2010"}, {"Title": "Surprised by how good it is!", "Author": "4mger", "ReviewID": "R2V3V27FUX426T", "Overall": "5.0", "Content": "Got TV yesterday. Setup was simple. Picture looks great even when not connected to HD. Only thing to improve is the sound. It is not the worst I have seen, but it is not perfect. That being said, sound is acceptable. Overall very happy. Price from J&R; with free shipping was great. Delivery was super fast. Bought on a Saturday, delivered on Tuesday!!!", "Date": "November 18, 2009"}, {"Title": "Built-in Surround Sound, huh? NOPE!", "Author": "Sam I Am", "ReviewID": "R1L9AJY0N7U2P8", "Overall": "3.0", "Content": "First of all, this TV is well worth the $260 I paid for it. Blu-ray movies look outstanding. My PS3 games have never looked better. It's got a built-in QAM tuner that gets OTA HD, and the HD channels are great quality. The remote feels good and is easy to adjust to, and the sound is not nearly as bad as the reviews would suggest. I really got a deal on this TV. There's just one flaw. No, no, let me correct myself: there's just one HUGE FRIGGING FLAW!See, I've had four of these TVs. On three of the four, I turned the TV off while I had the SRS Surround Sound activated. I turned the TV back on, and was greeted with a startup loop. On the fourth TV, the one I'm using, I have never turned on the SRS Surround Sound, and I've gotten flawless operation every time I use the TV.Hear me out, okay? It's not as scary as it sounds. It's just a weird glitch with the TV. I can't stress this enough: Don't use the included SRS Surround Sound, and you'll be fine. I've contacted Viewsonic, and they're working on the problem. Hopefully, with the next batch of televisions, this issue will be resolved.", "Date": "May 5, 2010"}, {"Title": "Can't miss for the price...", "Author": "Timothy P. Anderson \"Pig198\"", "ReviewID": "RG0P6KEU92LQ8", "Overall": "4.0", "Content": "We finally decided to upgrade the TV in our bedroom, and I initially began shopping for a 720p unit. When I stumbled on this 1080 ViewSonic, I was intrigued. The reviews were fairly positive, and the price was outstanding (cheaper than most 720's). I knew ViewSonic made fairly sturdy computer monitors, so I decided it was worth the risk. It arrived well ahead of the estimated delivery date (thanks, Amazon), but the carton was badly damaged. I was a little nervous, but the interior packaging had protected the unit. I mounted the TV to the wall using a mount purchased from Amazon, and I connected it to our HD receiver box with an HDMI cable. This has thus far proven to be one of the best purchases I have made in recent years. I can echo the comments about the tiny menu text, but other than that, this TV has exceeded all expectations. For those who have criticized the sound, what do you expect? I find the speakers to be more than adequate for set of this size. They handle the sound well in our modest bedroom. The comments about viewing angle are accurate, but they were expected. The mount I used is easy to adjust, and only a slight angle is needed to bring the picture in clear as a bell. With the exception of those who received units that did not work (or failed shortly after install), if you bought this TV expecting more than you got, then I really have to question your common sense. For the price, this TV is a bargain.", "Date": "April 22, 2010"}, {"Title": "ViewSonic VT2430 24-Inch 1080p LCD HDTV", "Author": "Jagdoran", "ReviewID": "R1WPN7KCHQ3RSJ", "Overall": "5.0", "Content": "I had not heard of this brand before this purchase but they were one of the few who carried a 24\" LCD TV(actually mis-advertized it's 23.5\") I had a restricted  cabinet opening so it worked out perfectly. I was also impressed with the 2 yr. warranty and the 1080p resolution. I would not hesitate to recommend this to family or friends.", "Date": "November 12, 2009"}, {"Title": "Ergonomically sleek...yet it still needs kinks to be worked out", "Author": "V. Potosme", "ReviewID": "R3V5KNVHTICFRH", "Overall": "2.0", "Content": "I recently purchased this product after seeing it on the ViewSonic website at B & H photo. I was looking specifically for a VS because these looked very attractive to me; our church uses them for the Wii systems and they always look great. Not to mention I like the birds on the logo xDIt came yesterday via UPS after 6 days of waiting (had to ship from New York to California), and within 2 hours after I set it up it went into a continuous restart mode. After further research online it seems that if you change the SRS sound setting from off to on (which is an advertised specification of the product), it glitches the monitor into restarting itself.I also had problems with the ViewSonic Customer Support. They seemed to have a lack of...how to put it? Work-ethic. I would literally wait 6-7 seconds for \"George\" to reply to the things I told him which frustrated me to no end (because my house is basically a dead-zone, and I kept thinking I lost the phone call)This is very disappointing, I was hoping to become a longtime customer and the very first thing I buy from them is defective and their customer support is lacking.", "Date": "May 13, 2010"}, {"Title": "Watch out if you want to use it as a PC monitor.", "Author": "Rebecca Muir", "ReviewID": "R1LOAOB02ERART", "Overall": "4.0", "Content": "I bought this TV to use as a TV and a dual monitor for my computer. The TV part is great. The problem is in the PC mode. The 1st one I got had the PC image shifted 4\" up from the bottom of the screen, and the top part of the image wasn't visible. This was true when setting it up as a single monitor as well. The \"starting windows\" text was at the top of the screen rather than in the center and 4\" of black was at the bottom. Adjusting the vertical postion didn't fix it. ViewSonic tech support had no solution except to exchange it. The second TV I got had a similar problem in pc mode, only it was the left 1\" that was blacked out. Horizontal adjustment got it to 1/2\" and since I am using it as a second monitor, it didn't bother me enough to return this one. So, I recommend this as a TV, but if you ever plan to use it as a monitor, test PC mode right away. (BTW, ViewSonic customer support is not outsourced overseas, another plus).", "Date": "September 22, 2010"}, {"Title": "Good as it Gets for $$$", "Author": "Devon Alexander", "ReviewID": "R3FQNDDYG0ECQL", "Overall": "4.0", "Content": "This was a very economical buy. I really can't think of any complaints rather than it's hard to view without 20/20 vision from a distance of more than 6ft. Keep your glasses on if you can. The sound is great and the hd-resolution is amazing when playing ps3 games and blue-ray. I'm using this for my college dorm and it doesn't get any better than this for a small room hd-tv It's also a great monitor for playing the latest games or viewing movies. I would recommend this to anyone looking for a small starter hd-tv.", "Date": "February 14, 2010"}, {"Title": "Good TV, great price.", "Author": "grounden1985 \"grounden1985\"", "ReviewID": "R3RHQQB4Z0YZZN", "Overall": "4.0", "Content": "I was looking for an HDTV for my bedroom and didn't want anything too big, but it had to be full HD (1080P) because I only planned on playing Blu-ray movies on it. I found this and thought 24\" was perfect for my bedroom, not to mention the full 1080P HD was a nice draw. I'd never heard of the brand so I was a little nervous, but at the price, I took a chance on it. I'm glad I did.The TV sits on a stand and is a sleek-looking black. It doesn't look or feel cheap, which I was expecting. But the real plus is the picture quality--it's just excellent. Some other reviewer mentioned dull edges and blocky shapes or something...maybe his TV wasn't set right because my picture is gorgeous. In fact, a Blu-ray movie on this looks better than on my 40\" name-brand HDTV in my living room. The colors and contrast are stunning. I can't rate how cable looks on it or how it looks as a computer monitor because I don't use those features, but for Blu-ray discs the picture is outstanding, even at 24\" (which I was told it wouldn't be because they say you need to have a larger TV to take advantage of HD. This TV does fine).The front of the TV has a cool power button that is lit up orange while off and turns blue when on. The brand logo shows briefly every time you turn the set on...it's some birds or something. But it looks stunning. Switching between inputs like cable, component, and HDMI is very easy. No issues with learning to use it. If you've had one HDTV, you should be able to work this fine without needing the instructions.The only issue I have is with the sound. It is not horrible, but it can sound kind of off at times, as if the sound is coming out through a box or something. Things often sound far way or hard to hear, depending on the movie. I am told that hooking up surround sound will fix this, but I don't want surround sound in my bedroom and in any case, it is not too much of a problem. If it were in my living room I may consider hooking up surround sound speakers but for my bedroom it is alright. Besides, it's not that bad...I give the sound 3 stars. It could be better, yes, but it is what it is and everything else is great on this set.I highly recommend this product for anyone wanting a good full high definition TV for under $300. It does the job.", "Date": "December 17, 2009"}, {"Title": "Great buy", "Author": "Casey's Mom", "ReviewID": "R32CRIZDGESDEU", "Overall": "4.0", "Content": "This TV is nice, great for the price. My only complaints are: when the tv first comes on you get a logo screen that cannot be deleted; the print font in the settings is __very small__ and so far I have not been able to enlarge it; the sound could be better, a little tinny. That can be changed but when I did I could not lower it to very low.  Although these are a bit irritating at times, I still like the tv.", "Date": "September 8, 2009"}, {"Title": "Very Nice TV", "Author": "David A. Comyns \"Dacman\"", "ReviewID": "R36W88V6MN0U5F", "Overall": "4.0", "Content": "This TV was bought to go in a travel trailer. So far it meets my expectations. I have always owned Viewsonic monitors, and figured their tv would probably be good also. Very nice for its size and price. Would highly recommend!", "Date": "May 19, 2009"}, {"Title": "Good picture, weak sound", "Author": "W", "ReviewID": "RXNX3SMNK98IN", "Overall": "4.0", "Content": "I purchased this particular TV for our kitchen because it was the largest set I could find that would fit on the counter under the wall cabinets. The picture is excellent when used with a cable box and very good without the box. The sound is \"tinny\". I solved this issue by plugging an old external sound system (powered woofer and 2 satellites)into the headphone jack and placing the speakers behind the TV.", "Date": "February 20, 2009"}, {"Title": "Nice TV-Major Malfunctions", "Author": "DashOneCharlie \"DashOneCharlie\"", "ReviewID": "R3SIN5UROW9S3Q", "Overall": "2.0", "Content": "I have purchased two of these, from two different vendors.  Both TVs worked great for a day or two, then both had the exact same problem.  The 'on/off' switch would stick, blink ominously, then remain stuck in the 'on' position.  Fortunately I got refunds from both vendors and the manufacturer acknowledged that this is a common problem.  Back to the drawing board!", "Date": "June 9, 2010"}, {"Title": "Amazon should black-list this TV", "Author": "F. Goel \"Vaibhav\"", "ReviewID": "R1PX0A658G9QOL", "Overall": "1.0", "Content": "I purchased this TV for my home and what I came to know when I received this TV,Its a piece of crap !!!It only worked for 2 minutes and after that it keeps on rebooting and every time I can just see the stupid ViewSonic logo.Its not worth buying, seems this model have some firmware issues and lots of people are facing exact same issue.I am returning this TV and would advice not to buy this one.", "Date": "May 20, 2010"}, {"Title": "had to replace this TV twice due to poor quality", "Author": "Quil", "ReviewID": "R2VP0OI6GZLWTS", "Overall": "1.0", "Content": "Ok, when I purchased this TV (the first time around) it lasted just a little over a month, and then would power cycle off and on and off and on (into infinity). The only way you could make it stop power cycling off and on would be to unplug it. I called ViewSonic (the manufacturer) and they were about as helpful as a box of rocks telling me they could only replace the TV with a \"refurbished\" model (read: USED junk that gave someone else problems previously). Then I called Amazon customer service who did actually replace the TV with a new on (same make and model). When I received the new TV and hooked it up it had a LARGE VERTICAL STRIPE on the left side of the screen indicating a defect in the build quality of the unit. I am now going to get a refund and go with a different television. I would not recommend buying this TV to anyone based upon my experience with it. Oh yes, and on some channels there is a LARGE GREEN stripe on the right side of the television as well. Not good.", "Date": "May 9, 2010"}, {"Title": "Returned for refund", "Author": "Michael P. Poletti", "ReviewID": "R11CUQIJT00JC1", "Overall": "1.0", "Content": "Bought this at Amazon good price $248.00 delivered hooked it up and it worked great. Turned it off for a while and when I went to show my wife it would not turn on only thier logo screensaver. I called support and they told me how to reset it but it did not work.She said it was a hardeware issue.Returned it for refund and bought a Sharp from Amazon as others have had this problem with Viewsonic.", "Date": "May 2, 2010"}, {"Title": "Easy to use, good picture but limited connections", "Author": "Andrig T. Miller", "ReviewID": "R1KLKTUO42K8JV", "Overall": "4.0", "Content": "I bought the Viewsonic VT2430 24-inch 1080p LDC HDTV as something to go with my PS3, and it works great.  The picture quality is really good, and from any angle.  When playing really fast action games, it really performs much better than anything I have ever had before.  I definitely recommend this for a PS3 setup, or for regular TV viewing as well, as it plays DVD and Blu-Ray movies beautifully.The only gripe I have is that it only has one HDMI connection.  My laptop has an HDMI output, and I would like to use it with the laptop as well as the PS3, but I have to disconnect one, and connect the other, which is a little bit of a hassle.Other than that, its a great product for the PS3, and movies.", "Date": "January 8, 2010"}, {"Title": "Don't look up!", "Author": "J. B. Oconnor \"JBOConnor\"", "ReviewID": "R3ORB9L0KPY1Y4", "Overall": "3.0", "Content": "This TV is pretty good all around, unless you need to look up at it. Like my LCD computer monitor it starts going dark quickly as your eye level goes below the screen. I bought it for my bedroom where it sits on a higher dresser. Since the base only allows it to tilt up (back) not down (pitch forward) it's almost indiscernible from a relaxed position in bed. I guess I'll have to mount it to the wall so I can tilt it enough to watch from bed.Our larger Panasonic LCD doesn't suffer from this degrading image from lower angles, but my LG PC monitor does. Maybe it's got something to do with monitor vs TV design?The sound is pretty good considering the little speakers. It's a TV for a small room, in the living room it wouldn't cut it but in a small room with the audio adjusted it's just right.There's a single HDMI, but component and coax inputs, so unless you plan on running a ton of HD hookups to it you should be fine.The screen format options are limited to full or 4:3, nothing more advanced. But those are the only options I usually use on my other TVs anyway.The picture, as long as you don't look from a lower angle as noted, is quite good. Side angles aren't as good, again, as the Panasonic LCD (and of course can never compare to the Panny plasma in the living room)As a back up TV this will do the job if you can get it for a good price. If you're looking for something more, spend a few extra bucks and get something with a better ability to be viewed from indirect angles. I bit due to the 1080p resolution, but honestly the 32\" Panasonic LCD we have in the other room blows this set away even though it's a 720p. At this size, unless you're on top of the set, you can't really see too much of a difference.", "Date": "December 25, 2009"}, {"Title": "Good for my purpose", "Author": "L. Quaglio", "ReviewID": "R1VMTBRA81B9WY", "Overall": "5.0", "Content": "I keep this TV next to my computer monitors so I can watch while I draw or surf. It has excellent color and is very clear. It might not suffice for purists but for me it's excellent. I have DirectTV but not HD so can't comment on that. I also use it to watch DVD's which works out good. As a computer monitor I find it a little lacking in clarity compared to my ViewSonic 903 and 912 monitors, but that wasn't my purpose so it's fine. The price was good and all in all I am pleased. I have always gotten good use out of ViewSonic products.", "Date": "November 24, 2009"}, {"Title": "1080p = FAIL", "Author": "The Zin Guy \"zin_guy\"", "ReviewID": "R28WWB3QKON620", "Overall": "1.0", "Content": "I bought this to replace another Viewsonic 22\" monitor because I wanted it to also be a TV.  My current Viewsonic is razor-sharp using a DVI link to an Nvidia 9600 GTS card.  This was an upper-middle-of-the-road card when I got it less than a year ago, but it does 1080p without breaking a sweat.The VT2340 performed abysmally at 1080p even with a high end HDMI cable.  Contrast was awful and color/brightness smear made it unusable.  I suppose as a TV you might get away with it, but nothing like computer fonts were tolerable.  I had it running side by side with my 22\" Viewsonic and the difference was so dramatic my informal poll of quite a few people was unanimous.Sent it back.", "Date": "November 6, 2009"}, {"Title": "Do not buy", "Author": "Khaisy Productions \"Khalil\"", "ReviewID": "RJGWTRV5WX2RB", "Overall": "1.0", "Content": "I have used it 4 times only and pictures went crazy on me weird vertical lines and horizontal lines with black images. Tech support were not that helpful either", "Date": "July 26, 2011"}, {"Title": "A little top heavy, but awesome picture for the price.", "Author": "Kyle R", "ReviewID": "R2KU7UVA58FFRA", "Overall": "5.0", "Content": "My only issue with this monitor/tv is that the device wobbles easily. However it has not fallen over yet. As long as you have it on a flat surface, and avoid bumping it, it should be fine.Other than that the picture quality is beyond great, the sound is what you would expect from built in speakers, and it connects well to my Xbox 360, PC, and TV Box. The switching between devices is also nice.One other point I will make is that it only has one HDMI port, so for me I have to switch back and forth to use HDMI on both my Laptop and Xbox. But if you do not want to have this issue you can use the VGA Port for a computer, the HDMI for a second divice, and the Analog Yellow, White, Red for a gaming system.", "Date": "May 23, 2011"}, {"Title": "view sonic and amazon five star", "Author": "George N. Shaw", "ReviewID": "R2HKO52E5GBX1U", "Overall": "5.0", "Content": "Easy is the key, got what I wanted, was what they said it was, and I love it and the price was right.", "Date": "January 17, 2011"}, {"Title": "Great deal!", "Author": "PhillyGuy", "ReviewID": "R2OUBWGQA5UGG", "Overall": "5.0", "Content": "I had read many different reviews before getting this TV and I was a bit skeptical when I read the bad reviews.  However, it was on sale for $180 as it was refurbished.  I figured since they had fixed whatever was wrong with it, it should be fine.  I have had the TV for about 2 months now.  The picture quality is great, after all, it is high def...).  I had no problem setting it up.  It attaches to HDMi, DVD player, svideo, and also has outputs for the stereo.  Also connects to my PC.  I use a regular antenna for HDTV, and I couldn't be happier.  I have no problems with the TV so far. As far as I can tell, it's a great deal.", "Date": "January 12, 2011"}, {"Title": "Nice TV for my apartment", "Author": "Tickle Fight", "ReviewID": "R1L5A9X8UHSGJK", "Overall": "4.0", "Content": "A good size for me in my room.  I got it for regular cable tv, and to play my XBOX 360 on.  It has a great picture quality when connected with my xbox.  Cable quality sucks.  My least favorite thing about this is that it has no audio output.  The only way to hook it up to a surround sound system is by buying a Y cable and connecting it from the headphone jack on the tv to the audio input on the surround sound unit.  If you do that, no sound will play through the television set unless you unplug the Y cable from the back, which is too much of an inconvenience for me.Overall, it's great for the price.  The audio output won't be a problem if you're not running cable directly to the television, and using some kind of mediator.  I'm satisfied.", "Date": "November 18, 2010"}, {"Title": "Picture perfect sound quality poor", "Author": "Andre77", "ReviewID": "R2JAP0W2K4QV0W", "Overall": "4.0", "Content": "This TV is alright. I got HD hooked up and the picture is great, however the sound quality is equal to that of $10 computer speakers. Dont be fooled by the picture when it shows the speakers vents on the TV. Its easy to assume the speakers are that size, but there not. Each speaker itself is about 1 inch in diameter.Overall though if I had to buy this TV again then I probably would because the price was so cheap (i bought it at [...] for $230 I'm more of a visual guy then an audio guy, but the speakers are tolerable and I guess you get what you pay for.", "Date": "September 26, 2010"}, {"Title": "definitely a BUY", "Author": "butch", "ReviewID": "R1XHKT9DTJNBOW", "Overall": "5.0", "Content": "I am 63, college educated, NOT TECH SAVY------easy to follow instructions in QUICK HOOK UP.....THANKS FOR ALL OF US \"OLDIES\"bought from AMAZON----SUPER COMPANYbutch", "Date": "September 2, 2010"}, {"Title": "Really great TV for a great value", "Author": "Raymond Gutierrez", "ReviewID": "R1WLHH51CIRY4C", "Overall": "5.0", "Content": "It's hard to find a full 1080p tv for this price, it is certainly a great value...My only real complaint which isn't even a big deal is that it could use more component inputs, I also thought there was two hdmi ports but there was only one...I still highly recommend this TV if you want a nice 1080p tv for your room...This is not built for the living room :)", "Date": "August 31, 2010"}, {"Title": "7 months after purchase it won't turn on!", "Author": "Susan", "ReviewID": "R328IKW8G8DQDU", "Overall": "1.0", "Content": "Good TV initially. I ordered this to watch tv when using my treadmill--I was less concerned about features. After a few uses I realized that turning it on was not a simple press and release of the power button. I began to press and hold the button, then add some \"I hope it works\" wishes. More and more I just resorted to the manual power button. But finally even that gave out. Eighty dollars ($80) later (shipping back to CA for repair) I'm waiting for the return of my workout buddy. I'm annoyed, but hopeful that our relationship will be even better than before...???", "Date": "July 9, 2010"}, {"Title": "Runaround from Viewsonic after TV died", "Author": "Rapiier", "ReviewID": "R3FLT6VMAK77W7", "Overall": "1.0", "Content": "Stay away from Viewsonic!  Purchased the TV from Amazon in April 2010; it stopped working in early June.  Faced with delaying tactics from Viewsonic when attempting to have it repaired.  The set dieplays the two bird display for a few seconds, then goes black.  Attempts to remedy via Viewsonic's web site/chat were unsuccessful.  Having difficulty with Viewsonic authorizing repair for the set.  For the short period that it operated, it seemed fine.  It is dark and silent now. Stay away from Viewsonic!", "Date": "July 2, 2010"}, {"Title": "good product, not enuf peripherals", "Author": "Blackhog", "ReviewID": "RE1YUFES4V8FQ", "Overall": "4.0", "Content": "got the monitor as described, in excellent condition.colour is vibrant, haven't plugged in the sound yet so can't comment on thatthis tv/monitor comes with a remote but functions are very limited.this product comes with only the power cable, the remote with its 2 batteries, and that's it.therefore i couldn't plug it into my computer right away, this is the only inconvenience i've encoutered so far... other than this, so far so good~", "Date": "June 5, 2010"}, {"Title": "great buy", "Author": "Thomas Miller \"master of tools\"", "ReviewID": "R6DOMNT3QVBOH", "Overall": "5.0", "Content": "awesome tv, great picture quality. the remote is a poorly laid out, and the tuner has a slight lag but i am very happy about this purchase", "Date": "May 29, 2010"}, {"Title": "OK for the price. Tilt ability is poor", "Author": "Mark D. Steger", "ReviewID": "R39ZBMG8KWCI1T", "Overall": "3.0", "Content": "The picture is a little dark, and most of the tilt capacity is for tilting up.  My TV stand was above eye level, so now when I sit on my sofa with the TV tilted as far down as possible, the picture is still not quite right.  I don't see why they couldn't make slight modifications to the stand to improve the downward tilt ability.Aside from that mechanical problem, the picture quality is mediocre.  Darker scenes look particularly poor on it, no matter what settings I adjust.", "Date": "May 4, 2010"}, {"Title": "Pretty Phenomenal Little TV", "Author": "J. Gonzalez", "ReviewID": "R1YOU758CF8YT8", "Overall": "5.0", "Content": "I recently deployed to Afghanistan and needed a TV to double as  monitor as well. So far so good I love the TV and the other Soldiers here comment on the picture quality and the sound quality and a few have borrowed it to play Xbox 360 and Playstation 3 on it and their games show up very nicely. Very simple TV to use right out of the box and hooking up to my laptop was a piece of cake. I would recommend this for anyone looking for an economical flat screen and required a 1080P resolution for a monitor or television and it is pretty inexpensive.", "Date": "April 28, 2010"}, {"Title": "Very good product for price.", "Author": "Gerald Williams \"booklistener\"", "ReviewID": "R1JCCZRU5I8GRE", "Overall": "5.0", "Content": "I am using this as a wall mounted television; I gave it five stars because I knew the deficiencies before I bought it.  Those is only one HDMI port and the fact it was 60 cycle.  I love it as a TV and really think it would make an even a better monitor.  I am glad I didn't get a bigger set because of how close I sit to it.  It is very easy to use and the picture quality is great.  I have the TV cable on the composit cables and the DVD player on the HDMI so I get 1080 from both.  I don't know if 1080 is necessary on a set this small but the picture is as good as I could want.  Once and a while some bluring on very fast action but that was to be expected with the 60 cycle.  The remote and programing are easy to use.  This set is just what I wanted; a TV to watch while I was on the computer.  I think the sound quality is fine; there is more than enough volume for as close as you would have to sit to a 24 inch set. The earphone jack could be in a better place but I won't use it that often.", "Date": "April 1, 2010"}, {"Title": "Great TV for the money", "Author": "Blondie \"Authentic\"", "ReviewID": "R17EAR5E04L8MZ", "Overall": "4.0", "Content": "Easy to hook up.  Great picture and the sound is very good as well. Worth the money.", "Date": "March 26, 2010"}, {"Title": "Colors and resolution when is used as monitor is not ok", "Author": "Dany De Cecchis", "ReviewID": "RY7P6JLTLZVGA", "Overall": "4.0", "Content": "In general the TV is really good, I used with a PS3 and as monitor with my laptop. When I use it as a monitor, through a HDMI monster cable, the color is pale and the desktop passes a little bit the edges of the tv. So, sharpness when is used as monitor is poor.", "Date": "March 18, 2010"}, {"Title": "T.V. for bedroom", "Author": "Amazon Customer", "ReviewID": "RXV24MC8JWWYV", "Overall": "4.0", "Content": "Got for son's bedroom. Use with cable box and playstation 3. Picture quality very good.", "Date": "February 12, 2010"}, {"Title": "ViewSonic TV", "Author": "Kat 'Man' DO \"Kat\"", "ReviewID": "RIDJSF0VT8XZK", "Overall": "5.0", "Content": "This TV was a Christmas gift for my 87 year old mother.  She is absolutely thrilled with it.  This is her first LCD HDTV and she is amazed at the quality of the picture, stunning colors and even the sound, which is far superior to what she is used to.I have owned 2 ViewSonic monitors over the last 10 years.  The fisrt one wore out after almost 9 years and the current one is fabulous (nice 21\" LCD)!  ViewSonic makes quality products!!", "Date": "February 6, 2010"}, {"Title": "Pretty Nice", "Author": "M. Randall", "ReviewID": "R1X24OWT5RPBUR", "Overall": "4.0", "Content": "I got a pair of these for my daughters.  For the price, I thought they were pretty good.  The pictures were good.  I thought some were a tad grainy for my taste but definitely a good value for the price.  They were quick to set up and work well.  A very good buy.", "Date": "February 2, 2010"}, {"Title": "Great picture and sound!", "Author": "Stanley T. Myles \"techsan68\"", "ReviewID": "R2P4PCFR71ZHOE", "Overall": "4.0", "Content": "This monitor/TV is a great performer, both picture and sound. My only complaint is that there's no Audio Out jack, only a headphone jack. This limits its use by the hearing impaired.", "Date": "January 30, 2010"}, {"Title": "Nice quality monitor at a fair price", "Author": "C. Chambers", "ReviewID": "R2STRQFXG8F6HH", "Overall": "4.0", "Content": "Very nice monitor that I purchased to place in my son's room for his video game addictions.  I have been very pleased with the video quality and performance of the monitor. The sound is decent also, for my expectations of gaming.  I purchased from Amazon before Christmas and the item arrived quickly.  It has been used for a month now and is performing very well.", "Date": "January 30, 2010"}, {"Title": "excellent tv", "Author": "Holden Drover", "ReviewID": "R1C58M48OYUJDN", "Overall": "5.0", "Content": "short on money but want an awesome tv? buy it. used with ps3 and optical surround sound... watched a documentary on earth(blue ray)...it was a beautiful experience... moving. changed my life", "Date": "January 17, 2010"}, {"Title": "LCD TV Monitor", "Author": "PiePix \"Pie\"", "ReviewID": "R1JWDYFMSMCRKU", "Overall": "5.0", "Content": "Wanted to replace our 13\" CRT kitchen TV with an LCD of larger size.  Liked the specs of this Viewsonic VT2430 24\" TV.  I was able to mount the new LCD on the existing wall mount the 13\" CRT rested on. Now when viewing evening news at dinner time we have a much better picture and overall improved viewing.  I am aware Viewsonic makes very good computer monitors and my confidence paid off with this purchase for use as TV.  This is just one of several things purchased from Amazon.com over the last several years.  Prices are very good and with shipping charges waived on items over $25...plus very fast delivery with normal option selected.", "Date": "January 17, 2010"}, {"Title": "Nice TV Screen - Very Poor Speakers, Poor Build Quality", "Author": "D. Kehoe \"Dan Kehoe\"", "ReviewID": "RKTBNIFS9EXMU", "Overall": "2.0", "Content": "I purchased this 24\" screen for use as a tv in my bedroom, and on the whole, I have not been disappointed.  First the good:  the screen size is adequate.  Coupled with it's 1080p specs, the screen also looks very sharp (even though I only have it attached to a 1080i/780p cable box).  It offers many different inputs at your disposal.  As mentioned, I'm currently using it as a tv, but I love that it can also be used as a computer monitor, even though I admit I have yet to use it as a monitor.  The price was absolutely great, when you consider there really aren't any other 1080p screens at this size on the market at this price point (under $275).The not-so-good: first off, one of the first things I noticed is how horrible the speakers are.  No matter what audio settings I tweaked, I could only describe the speakers on this thing as \"weak\".  Now, it's not the end of the world.  There is an audio jack on the back, which allows you to run an audio cable to an external speaker.  But if you're going to use this as a tv it becomes an extra expense if you don't already have a speaker or audio system to hook up with this thing...and trust me, if you're going to use this as a tv, you're going to want to hook it up to an external audio system, the speakers are that poor.  As for me, I have it hooked up to this handy little thing at the moment: Sony SRSBTM30 Bluetooth Wireless Speaker for iPod and MP3 PlayersAside from the speakers I have 2 other minor gripes.  The menu screen is rather small, which is fine if it's being used as a monitor, but when you're across the room (even a small room), you have to either squint or move yourself closer to the tv to navigate the menu.  Secondly, if you hook up this tv to an antenna (which I also did, as a back-up in case my cable box goes out), you may have issues using the on-screen guide as I did.  Try as I might, I just couldn't get used to how the guide works.  Unlike most guides on cable/satellite boxes, you can't keep the tv tuned to one channel while viewing the guide for another channel (unless I just haven't figured out how to do it).  But I've tried using it several times, and from what I can tell, that's just how it works.Anyway, I spent more time talking about the negatives, but actually, for me, the screen is quite nice, and I am very pleased with the tv.  But you should know that if audio quality is important to you, prepare to have an alternative in place.  I would definitely recommend this for use as a 2nd (non-living room) tv, with that one caveat (poor audio quality).---------------September 1, 2011Update:  The HDMI connection is no longer working.  I connected 2 different computers with the same cables to my main television, and the HDMI connection worked.  On this tv, it does not, so I think it's safe to conclude the problem lies with the TV, and not with the computer or the cable that I'm using.  I have owned for less than 2 years, so this is disappointing.  The search is on for a higher quality TV.", "Date": "January 10, 2010"}, {"Title": "Viewsonic TV", "Author": "John J. Murphy", "ReviewID": "RYS7YQ7P7VPUI", "Overall": "5.0", "Content": "Awesome picture and quality.  I bought this for my daughter for Christmas and she love the set.  We now have all the game and HD hooked to this set.  Nice quality picture and setup", "Date": "December 29, 2009"}, {"Title": "ViewSonic VT2430 24-Inch 1080p LCD HDTV", "Author": "Katerina Stanisheva", "ReviewID": "R3P2SXADMZSNX9", "Overall": "5.0", "Content": "Great quality for the price. I've only had it for a month now but I didn't have any troubles setting it up and haven't had any problems using it so far!", "Date": "December 28, 2009"}, {"Title": "Very Nice TV", "Author": "Mr Pink", "ReviewID": "R1X1OX14ZB8XOT", "Overall": "5.0", "Content": "This is the first LCD or HD TV I've ever purchased, bought mainly due to the reviews in this thread and the price. The picture is awesome viewing HD content from COX cable and I'm amazed watching shows such as Cops that I've never seen in HD. I haven't hooked a blu-ray up yet but I will soon and anticipate the picture being even better. As a consumer who has always routed TV sound to an external sound system I never really care about the factory speakers in TVs but I must say I think this set sounds pretty darn good through its speakers using the audio inputs from the HD cable box and can't agree with those who say it has bad sound.This is currently a great buy if you are looking to buy a smaller HD TV. It looks great in my 9'x 10' spare bedroom. Just FYI I always watch it with the room lights off.The free shipping from Amazon was super fast as well.", "Date": "December 13, 2009"}, {"Title": "Poor quality", "Author": "John Mack", "ReviewID": "RUIW4GPXRGACI", "Overall": "1.0", "Content": "I was excited to get this tv/montior for use with my Mac.  It worked fine and I was pleased, except for a few minor details.  The biggest complaint being the awkward picture of birds that appear when the Tv is turned on.  However after less than 3 months of use, the on/off button collapsed into the frame. This left the TV useless as it could not be turned on or off.  I contacted Viewsonic to see if they would repair it as the product was only 3 months old.  After much complaining, I was finally able to speak to a supervisor.  He informed me that the button is not covered under warranty.  \"The button is not covered as it was pressed.\"  I am still at a loss for how a button is not to be pressed.  This product was made with cheap parts and has poor craftsmanship.  On top of that the customer service is horrible.  No product that costs upwards of $200 should break after 3 months of light use.  I do not recommend this product or any other Viewsonic devices.", "Date": "April 14, 2011"}, {"Title": "great products", "Author": "Billy W. Kiggins", "ReviewID": "R3VZXXMO1ES4P0", "Overall": "5.0", "Content": "This is my third viewsonic product . All were excellent .  This 24 inch tv has a very high quality picture. Would highly recommend .  Also Amazon is very good at shipping orders quickly .  Thanks Viewsonic and Amazon", "Date": "October 15, 2009"}, {"Title": "Died just past the warranty expiration", "Author": "Victoid", "ReviewID": "R1WUTLX3P22O7M", "Overall": "1.0", "Content": "It stopped turning on.  I cracked it open, since the warranty was done, and it appeared the mainboard had fried.  Its main controller IC was dangerously hot when powered.  No obvious bad capacitors.  Just a bad chip.", "Date": "January 18, 2014"}, {"Title": "Viewsonic Made a Good TV", "Author": "Neil Adkins", "ReviewID": "R12Y4LNUBV4MZ4", "Overall": "4.0", "Content": "I've owned many Viewsonic monitors over the years and have been happy with them all.  No exception here!  I haven't upgraded to HDTV yet, but I put this TV in front of my old big screen & using S-Video I am satisfied with the picture & sound.  The picture is bright & clear. The sound is good for a small TV. I've had no problems with sound at all, I currently have this TV in a large room.The only negative is the blacks tend to fade out - (poor contrast during dark scenes).", "Date": "November 24, 2013"}, {"Title": "Nice picture", "Author": "Malcolm A. Williams", "ReviewID": "R6Q33SXICB3MI", "Overall": "5.0", "Content": "Great picture, crisp, sharp, great colour, Mom loves it! remote easy to use, sound is clear. A really good buy", "Date": "November 19, 2013"}, {"Title": "Worth the money", "Author": "Heather", "ReviewID": "R3N34D0V4COD3I", "Overall": "4.0", "Content": "Product was dusty and had a few scratches on the stand. Picture quality is great! Looks just like it does in the picture.", "Date": "March 5, 2013"}, {"Title": "Headache big time !", "Author": "Eleanor", "ReviewID": "R3PO9ESJCP0KXZ", "Overall": "2.0", "Content": "Have had nothing but a hassle with a repair problem on this TV ....that was only a couple of months old....had to send back( and pay at my expense for the shipping ) because remote would not turn TV off without TV coming right back on.....in service for over a month and a half and them was  shipped a replacement that has exactly same problem I sent first one in for. It is just not worth it.", "Date": "February 2, 2013"}, {"Title": "Short Life", "Author": "I.Thomas", "ReviewID": "R3R3TXL717HX01", "Overall": "3.0", "Content": "The ViewSonic was an ok TV it showed great reception, while it lasted. and that was not very long. after about twenty-four months it just stop playing; that was the end of the TV. Presonally I would not recordmend this TV.", "Date": "January 28, 2013"}, {"Title": "perfect size", "Author": "M. Ell", "ReviewID": "R23V876UFF9DA8", "Overall": "5.0", "Content": "This is the perfect size for my computer screen and I can also use it for tv.  Very happy with it.", "Date": "December 20, 2012"}, {"Title": "Viewsonic", "Author": "Chris Bourne", "ReviewID": "R34K6GMIH6363H", "Overall": "5.0", "Content": "Have been buying viewsonic for years and have never had a single thing wrong with any of them  just upgrading bigger and better", "Date": "November 28, 2012"}, {"Title": "It is a piece of junk!!!", "Author": "Basil Pinto \"The Baze\"", "ReviewID": "R1WCFKJ6LFQVMO", "Overall": "1.0", "Content": "Whatever you do, you must listen to me about this. I bought this tv brand new and it lasted me 1 total year. It broke down twice-first time I needed to have a filter changed and the second time it needed a mother/main board which my tv tech could not order because it was out of stock. Hence, it was basically dead. Trust me on this one-DO NOT buy viewsonic products-do yourself a favor and buy only name brand products-like samsung, sony, lg,panasonic, toshiba. It will be worth the few extra bucks in the long run. Don't say that I didn't warn you-do not even go near a viewsonic product.", "Date": "July 18, 2012"}, {"Title": "Start up loop!!!! strikes again.", "Author": "SalsaShark", "ReviewID": "R11KHCDI7CDQI5", "Overall": "1.0", "Content": "This TV worked great as a TV and computer monitor UNTIL....I activated Surround Sound.  I got the dreaded startup loop other people have described.I called ViewSonic customer service twice and both times the technicians acted clueless about this problem being connected to Surround Sound.  It's clear that ViewSonic wants to ignore the problem because if they admitted the issue is caused by normal operation of the TV they would have to re-call the product.Here is an email I sent to Viewsonic.I have LCD TV model number VT2430.  I am aware there is a problem with this model if you active the SRS Surround Sound feature of the TV.The TV is now in a startup loop and powers on and powers off endlessly.  It does not get past the ViewSonic parrot splash screen.After a quick Google search I found plenty of other people who have experienced this exact issue.  This issue is being caused by turning on SRS Surround Sound.  like all the other people with this problem It happened to me after i turned on Surround Sound.Is there a recall for this TV?I would like my TV replaced or repaired free of charge.Thank you.", "Date": "May 9, 2012"}, {"Title": "Expected better", "Author": "reddyfeet", "ReviewID": "R5SJJO4XXE582", "Overall": "2.0", "Content": "Nice initial video quality.  Audio array inadequate in size and tinny in sound.  Video display went south (horizontal lines, artifacts) inside of 5 months.  Sent it in for warranty repair/replacement over a month ago (at my shipping expense).  No response yet.Update:  It's a total write-off.  Their third-party warranty service address is evidently a black hole.", "Date": "April 19, 2012"}, {"Title": "DO NOT BUY", "Author": "Amazon Customer", "ReviewID": "R1QKTM2GE6NWGR", "Overall": "1.0", "Content": "Despite the bad reviews I purchased this item...big mistake. Some channels where digitally pixelated and sound garbled. Do yourself a favor and don't buy this item.", "Date": "March 2, 2012"}, {"Title": "failure in less than 60 days", "Author": "Jude24", "ReviewID": "REAV6LGHR01W", "Overall": "2.0", "Content": "I purchased two of these TVs. One to give to my grandson, and one to put in my newly remodeled bathroom. The one in the bathroom worked well for about two weeks. Then it began to turn itself off and on. It doesn't stay off long, but it is very annoying. I saw reviews here stating there are cycling problems when SRS is enabled, but I don't have SRS enabled, so it is not that. It was about a month after purchase that I installed this one, so naturally I am too late to return it to Amazon. I have sent an email to Viewsonic Support, we will see how that goes. I don't think the one I gave to my grandson has had problems. If it does, Grandpa is going to get MAD!", "Date": "February 10, 2012"}, {"Title": "bad quality control", "Author": "LGMR54 \"LGMR54\"", "ReviewID": "R3GKNWLQF5YK8F", "Overall": "1.0", "Content": "I received the TV and gave it as a gift to my sister. A couple days later I went over to check out the TV only to notice it had Dead Pixels! She had already thrown away the box so I cant return it. Amazon was great with their price and timely delivery. to bad ViewSonic has such a lousy quality control and allows defective TV's to be sold to their customers. This is probably the last TV I buy Online.", "Date": "January 6, 2012"}, {"Title": "TV", "Author": "Carl A. Heinrich", "ReviewID": "R39ST325LE5VXR", "Overall": "4.0", "Content": "TV was shipped at a reasonable time and was shipped in a secure box.  It was as advertized and is a good buy for the money.  The only negative is that there was no instruction book, but it was easy to figure out.  A good buy .", "Date": "December 30, 2011"}, {"Title": "Great TV bad sound", "Author": "aiv713", "ReviewID": "RWUMG0W7WMM1Z", "Overall": "4.0", "Content": "The product arrived in great condition.  We hooked it up and it has a great picture and lots of features.  The only down side is the sound is awful.  I'm hoping hooking it up to the surround sound will help.  Overall a good tv", "Date": "November 28, 2011"}, {"Title": "Fabulous HD clarity and ease of use", "Author": "Rose M. Griffith \"Rose M Griffith\"", "ReviewID": "RRMECG347V23U", "Overall": "5.0", "Content": "I purchased this TV primarily to use as a monitor with my laptop--nothing like side by side monitors for super productivity! It works terrific for doing Word documents and graphics projects. As a TV, the picture is amazingly clear. The remote is easy to use. It arrived promptly and in perfect packaging. I'm totally pleased with this product.", "Date": "October 15, 2011"}, {"Title": "Only Good For 2 Years", "Author": "Mark", "ReviewID": "R1LSNQXP3D3F9X", "Overall": "1.0", "Content": "My family bought the VT2430 for a bedroom only TV 2 years ago and it's now junk since the repair is more than half the cost of a new one.  I wasn't expecting the TV to last for ever but, 2 years and only on 2-3 hours/day if that.  As a main TV maybe less than a year.  Tech support was very good, they must have a lot of experience with product issues.", "Date": "September 9, 2011"}, {"Title": "Look elsewhere", "Author": "EFS \"woodchipmaker\"", "ReviewID": "R1IJDILVCYTTGA", "Overall": "1.0", "Content": "I purchased this TV/Monitor about a year ago and was never happy with it. I used it as both a TV and a computer monitor. The biggest issue with the TV is the time it takes to switch channels, 7-8 seconds is too long. The majority of the time I used this as a computer monitor where the picture quality is very poor. Now, just over a year old the unit freaked out, the picture is totally washed out, half of the input options no longer show up on the input menu, and the main configuration menu is no longer accessible - its garbage.", "Date": "July 23, 2011"}, {"Title": "don't buy this TV", "Author": "M. A. Soutar \"musicmamasu\"", "ReviewID": "R382CV1WDBV6D6", "Overall": "1.0", "Content": "I purchased this TV in March 2010 - in May 2011 the TV went dead and there is no repair for it around my area.  After complaining to the company, they said they would make an exception and repair it if I sent it to them in California.  The cost of shipping was almost $100.  (not worth it)  Lousy product - poor customer service save yourself some money and problems - don't buy it!!  Amazon should not be selling this product.", "Date": "June 24, 2011"}, {"Title": "ZERO RATING", "Author": "Anthony Kittrell", "ReviewID": "R2ISKZPH1C9YYE", "Overall": "1.0", "Content": "My TV failed after the 30-day return policy had passed and reading the other comments about dealing with Viewsonic customer support and returning the product just to get another defected one was enough for me to trash this piece of ....I want to do all I can to PUT VIEWSONIC OUT OF BUSINESS for selling this defective tv.  The best way to do that is to tell you to DON'T WASTE YOUR TIME ON THIS PRODUCT.  TV sets were known to last for years, so to have SEVERAL fail within months after purchase should make you question ANY purchase from Viewsonic.", "Date": "June 23, 2011"}, {"Title": "BETTER THAN COBY PRODUCTS", "Author": "AMIGO DE MEXICO \"FRANK\"", "ReviewID": "R21B2MRREDLY9W", "Overall": "5.0", "Content": "I purchased Viewsonic and Coby TV's at about the same time. The Viewsonic is far superior as a budget LCD. I have no familiarity with high end higher priced products of this genre and do not intend to. This product is excellent while the Coby counterparts are POOR.", "Date": "June 18, 2011"}, {"Title": "not bad for the buck", "Author": "robwayraw \"robert rawlins\"", "ReviewID": "R3IAHGP8HK5PVR", "Overall": "5.0", "Content": "I did lots of research prior to purchase.  For what I paid, I'm more than satisfied with all aspects of the television and planning to purchase a second.", "Date": "April 7, 2011"}, {"Title": "RIP Sept 9, 2009 to Feb 11, 2011, a good monitor while it worked.", "Author": "NLWPS \"Computer User\"", "ReviewID": "R5UTCP3MHCJWC", "Overall": "2.0", "Content": "I used the View Sonic VT2430 as a computer monitor. I did hook it up to my cable companies DVR for about 2 days and it worked fine until I purchased a TV to use. Beyond those two days never used the TV feature and only used it then due to a power surge frying the prior TV. As a computer monitor it seemed to work wonderfully up until minutes before it died without warning. I was using it without problem, left the room for ten minutes and when I came back it simply said \"No Signal\". When I tried using the remote to change the source it said \"Button Locked\". When I tried using the buttons on the bottom edge of the monitor I got the same \"Button Locked\" pop up on the screen. The pop ups were blue with white text however when the monitor showed the View Sonic logo it was in black and white after it died. Unit seems to power on and go into sleep mode as usual however simply can't use any signal fed into it. Even tried hooking it back up to my cable box. Same no signal error and same button locked errors. Manual says nothing about the bottom locked error. Device is outside of the 1 year warranty and I did not purchase any extended warranty so I am SOL I find. If you choose to get this device which did work fine for me for over a year... GET THE EXTENDED WARRANTY!", "Date": "February 12, 2011"}, {"Title": "Overall, it is fantastic", "Author": "William Farrar", "ReviewID": "R37H0Q9SJ5QTYS", "Overall": "5.0", "Content": "I purchased this tv with some trepidation. It had alot of mixed reviews. People either love it, or hate it.My experience is very positive. Very easy to set up.Color quality is excellent.I have not tried the monitor feature, but am confident it is fine.Over all for the money it is hard to beat.", "Date": "February 2, 2011"}, {"Title": "ViewSonic VT2430 24-Inch 1080p LCD HDTV", "Author": "R. Beal", "ReviewID": "R1QY7FWJ8HU2K", "Overall": "4.0", "Content": "Good value for what it is (inexpensive smaller LCD TV).  Like other HDTV's it doesn't produce as good a picture as a tube-type TV when connected to standard definition sources (composite or S-video)- not a fault, really, as they are all optimized for HD input at the expense of SD.  Pretty good audio for its size when tweaked through the setup menu.  Has few inputs and no audio output.  Slow to come on.  Annoyingly bright (for a bedroom) pilot light in front, can be fixed almost invisibly with a small piece of black electrical tape.  Decent remote.", "Date": "January 28, 2011"}, {"Title": "A great buy", "Author": "Carol A. McCutcheon", "ReviewID": "R106RMP9XR1ZS3", "Overall": "5.0", "Content": "What a great buy.  I have a view sonic monitor for my computer, but this is the first TV and I love the quality.", "Date": "December 26, 2010"}, {"Title": "Incorrect Specs", "Author": "Tom Woolley", "ReviewID": "R23GM1SP7MME5X", "Overall": "2.0", "Content": "Product specifications clearly state \"Digital Audio Out\" and \"Analog Audio Out\"...the only audio out on this tv is a 1/8\" stereo headphone jack... I guess that qualifies for \"analog audio out\"...", "Date": "December 21, 2010"}, {"Title": "disatisfied customer", "Author": "chuck blair", "ReviewID": "R1WUSV5B0TXGEK", "Overall": "1.0", "Content": "This TV worked great for 4 months then began to have a variety of problems that prevented use of the TV. Viewsonic repaired it and the repair lasted another 3 months, at which point other problems arose. This time Viewsonic replaced the TV. The replacement lasted 5 months and now it is completely dead. I have Viewsonic computer monitors that work great but they can't seem to manufacture a TV that works.", "Date": "December 17, 2010"}, {"Title": "Great monitor/TV", "Author": "TV guru", "ReviewID": "R2WS634MQM6ESY", "Overall": "5.0", "Content": "Got a great deal on this for $239.  As an extra laptop monitor, it is crisp and clear.  Some people have complained about the monitor image being off-center out of the box.  Yes, this is true.  However, simply run the Auto-Adjust function from the On-screen Menu, and it will perfectly center the image.As a TV, I've only tried hooking up a small antenna and tuning the local OTA HD channels.  All the local HDs tune in perfectly, and display a very nice picture.  TV audio is fine, and what you would expect for the two internal 5 watt speeakers.Overall, I would highly recommend this as both a monitor and small TV.", "Date": "December 13, 2010"}, {"Title": "Great deal!", "Author": "C.J", "ReviewID": "R2EXOFTXNXSIIZ", "Overall": "4.0", "Content": "Was a great find and purchase! i use it a second screen to multitask on my macbook, and it works pleasantly. the 1080p quality is a little mediocre, but still beats 720p. great deal and fast shipping!", "Date": "December 12, 2010"}, {"Title": "Fine TV, Except Factory / Default Picture Setting", "Author": "loanaranger", "ReviewID": "R64M8H5C5MVJU", "Overall": "4.0", "Content": "Everything as expected, including easy installation, except have had to fiddle with picture adjustments. The default picture was too dark, so much so it was difficult to see movie night scenes.", "Date": "November 21, 2010"}, {"Title": "ViewSonic VT2430 24-Inch 1080p LCD HDTV", "Author": "Larry L. Baker", "ReviewID": "R2GVF6QII18N6B", "Overall": "4.0", "Content": "I purchased the ViewSonic VT2430 for my 90 year old father who is very hard of hearing and watches the TV from his kitchen table.  If was small enough to fit between his kitchen cabinets and still was plenty large enough for him to see.  I was happy with the sound quality and the picture clarity.  Good buy for the price.", "Date": "October 24, 2010"}, {"Title": "Good Value", "Author": "Amazon Customer", "ReviewID": "R2U1ATOC017V8H", "Overall": "4.0", "Content": "The only \"hold out\" in our house that wasn't a relatively new flat screen TV was in our office.  The built-in corner bookcase dictated the size.  This ViewSonic 24\" replaced a 15-year old TV.The picture quality is good, especially with digital/ HD channels.  We didn't want a converter box in this location, but the tuner(s) found plenty of unscrambled digital and analog channels from our cable system.As with most LCD TVs, the off-angle viewing is poor, but since this is a smaller room, that isn't a concern.In a previous life I'd sold plenty of ViewSonic computer monitors, so I was aware of their better-than-average quality and reliability.  So far, we're not disappointed!", "Date": "October 18, 2010"}, {"Title": "Just what I needed", "Author": "Christine A. Anatra", "ReviewID": "R2I5Q3DFNY07ND", "Overall": "4.0", "Content": "I was looking for a smaller tv for the bedroom without paying a lot of money.  Just something inexpensive without sacrificing quality.  I read alot of reviews and the negatives on the reviews are so wrong.  The sound quality is very good for the size, I actually have to lower the volume alot and the picture quality is awesome.  I just have it plugged into my regular cable line and not HDMI so some of the lower channels when changing get a little hung up or don't change fast which really isn't a big deal.  It's only because of the connection.  Also, as far as the light on the tv staying on even when it's off I never notice, my alarm clock is brighter than that.  Great price and great product.  Happy with my purchase and I did alot of research before buying.", "Date": "October 13, 2010"}, {"Title": "Pleased but not ecstatic", "Author": "wagnet", "ReviewID": "R2C0TURUZI6T7G", "Overall": "3.0", "Content": "I bought this tv for my bedroom. I have it connected to cable and only use it for the most basic tv viewing functions. Picture and sound are very good. However....each time the tv is powered on you have to look at (what becomes annoying after a while) the Viewsonic Logo.  I can only assume this is being displayed while the tv is going through some sort of boot-up. Another annoyance is how sink'n long it takes this tv to change channels.  When I'm channel surf'n I want to buzz up and down through the channels to see what's on tv...click, click, click.  Nope, not on this tv. Expect to wait several seconds while it...does whatever it's doing...to get to the next channel. The problem might be in my cable connection, you say. Nope. I tested that. Connected my old tv back up. No problem. Tried the same thing on the other 4 tvs in my house. Nope. No problem.  Only on this Viewsonic.  Go figure.........", "Date": "September 29, 2010"}, {"Title": "My new TV", "Author": "Barnado", "ReviewID": "R2T17SGDNIEZ1X", "Overall": "5.0", "Content": "I did not have any trouble ordering my new TV on line at Amazon.com. My TV arived safely and was easy to take out of the box.  It as very easy to set up for use.  It is also very easy to operate.  I like my new TV.", "Date": "September 22, 2010"}, {"Title": "great tv and best price", "Author": "Ann M. Klopp", "ReviewID": "R3CGWK0925NJWQ", "Overall": "5.0", "Content": "I purchased this TV for my kitchen about a month ago.  The price was the best I found for a similar TV and it has been great.  I only tried the computer monitor option once so I gave it a slightly lower rating because I haven't much info on that.  But the sound is great, picture great, appearance is snappy.  I do have the TV in an eating area nook fairly close to where we sit so the sound may be different in a larger area.  But I think the TV is a very sound purchase.", "Date": "September 18, 2010"}, {"Title": "24\" ViewSonic", "Author": "Chi_fan", "ReviewID": "RIWTX9UJNU3OY", "Overall": "4.0", "Content": "Best value for the price. We needed a small tv for our workout space without investing too much. The tv was easy to set up and has a good picture. Order arived several days before the estimated shipping date using free super saver.", "Date": "September 11, 2010"}, {"Title": "Mom's TV", "Author": "ANNETTE ANDERSON", "ReviewID": "R1UW74XG5HBU1H", "Overall": "5.0", "Content": "My mother loved her birthday gift. The picture was awesome and sound was excellent. I am going to purchase one for myself. Thanks for helping me to make my mother's 73rd birthday great.", "Date": "September 7, 2010"}, {"Title": "Good but not Great", "Author": "Average Customer", "ReviewID": "R2HX67H7FTH2SU", "Overall": "4.0", "Content": "Worked right out of the box.  The screen does not have any visible dead pixels or obvious imperfections.  The picture quality is passable although not above average. When it is used as a computer monitor, the picture quality, and the colors, deteriorate.  There is no standby mode, or it does not work.", "Date": "August 7, 2010"}, {"Title": "Good Quality for the Price", "Author": "darkthorn", "ReviewID": "R1WD9NTNHRD5FV", "Overall": "4.0", "Content": "Remote is not good in the dark and the onscreen guide is very small and hard to read when in bed but the overall quality is very good and this makes a perfect bedroom TV.", "Date": "June 28, 2010"}, {"Title": "ViewSonic 24\" TV", "Author": "S. G. Gossett", "ReviewID": "R1WTH3AX1R40JF", "Overall": "5.0", "Content": "ViewSonic 24\" flat screen hidef TV  I bought this tv about a month ago, having never heard of this brand.  I used other buyers reviews as a guide and decided to take a chance on it.  I'm glad I did!  Love this tv.  The picture is just beautiful and the sound is great.  It also has a fairly wide range of viewing from around the room.  This is my first go round with flat screen hi def, But I know a great picture when I see one and proper sound when I hear it.... :-)  I also like the fact that you can change the angle to get the best picture at different heights  (it swivels up or down on its base)  I'm very satisfied and would recommend it to anyone.", "Date": "June 21, 2010"}, {"Title": "Does what I need it to do", "Author": "R. Zellner \"RZ\"", "ReviewID": "R3UXEKI6LR0UC2", "Overall": "4.0", "Content": "I bought this primarily as a monitor for work and I attached a $10 RCA antenna that gets me 60+ very good quality free t.v. channels.  You know for when the boss isn't around. All around the quality is good for the price and the auto-adjustment to my computer settings makes it simple to configure.The only minor negatives I found were that as a monitor, it would be nice if it tilted forward a bit as well as back and my VGA-to-HDMI connection wasn't recognized.  The VGA-to-VGA connection works great though.", "Date": "June 1, 2010"}, {"Title": "Great Buy!!!", "Author": "Jeffrey David Pilditch", "ReviewID": "R1ENG3H7ZP9908", "Overall": "5.0", "Content": "Great television and computer monitor.  Easy to use, program and set up.  Great buy for under 300 bucks, considering 1080p 24\" tvs are generally way over $300.", "Date": "May 15, 2010"}, {"Title": "GREAT SMALL TV!!", "Author": "Marco Cesar Campos", "ReviewID": "R2EUS6VRPUBHAC", "Overall": "5.0", "Content": "THIS TV IS JUST WHAT I HAVE BEEN SEARCHING FOR, I WANTED A HDTV WHERE I COUD PLAY MY PS3 WITH GREAT SOUND AND GREAT VISION. THIS TV MAKES THE WORK.", "Date": "May 13, 2010"}, {"Title": "A great TV with a few quirks", "Author": "KrystleNJ", "ReviewID": "RRO49WX2UOQ16", "Overall": "4.0", "Content": "This is one of the few small size LCD HDTVs that I could find that was full HD (1080P). I've had it for about 2 months now and haven't seen any of the problems that some of the other reviewers have reported.I purchased it for use in our kitchen and like it very much. The non-glare screen works very well there. I found that using the \"Sports\" sound setting gives a much better and louder audio output, than the default \"standard\" setting, from the built-in speakers.The picture is very sharp when I use it with Blu-ray discs, and the many different Zoom/Aspect Ratio settings help to eliminate any black bands while viewing them.I also enjoy receiving some of the cable channels in widescreen HD with the set's Clear-QAM tuner.However, I have noticed a number of quirks with this model:* The turn-on time until you get a TV display is about 12 seconds, which can seem like forever when you're in a hurry to watch something.* The remote control response can be flakey and sometimes lags. When I go to enter a new channel, I'll often hit a channel digit again, and then to go to channel \"XYY\" instead of just \"XY.\"* There is no memory for the Zoom/Aspect Ratio setting used for particular channels, so I have to keep changing between the 4:3 and Wide modes when switching channels.* When using the Recall button the set will sometimes stop going back to the previous channel.* The display originally appeared to have a faint green tint to it, but I adjusted the Tint setting slightly to the red (\"-3\") and I don't notice it any more.Other than these few items, the set works well (so far) and looks great.", "Date": "May 12, 2010"}, {"Title": "Great Picture for little $$$$", "Author": "Donald Binkley", "ReviewID": "R33LLU6LRVXPGS", "Overall": "5.0", "Content": "Needed a smaller picture for bedroom viewing, and was surprised at the high image quality.  Might just use for my photoshop monitor.  The image and sound contrals are so hidden at the bottom of the set's frame that they are hard to locate.  Only one HDMI input.", "Date": "April 25, 2010"}, {"Title": "BUY THIS TV!!!!!", "Author": "Marcus Hall \"Duuuuuuude\"", "ReviewID": "R261WF27E9EYA", "Overall": "5.0", "Content": "I bought this tv because I have a PS3 and I needed a cheap 1080p HD-TV, and boy am I glad I bought the Viewsonic. The games look great and the blu-ray dvds look amazing. I don't use it as a computer monitor so I don't know how well that works. Overall it was easy to setup, the volume is great (the tv's in my room, which is maybe 12' x 12'), picture quality is great, and even the remote is simple and nice. This is a great purchase for a great price. You can't go wrong here. Buy this tv now!!!!", "Date": "March 23, 2010"}, {"Title": "Great TV for a bedroom", "Author": "K.J.K.", "ReviewID": "R39JR1ML6YK4TX", "Overall": "5.0", "Content": "Good picture quality, easy to set up. Only had it a short while, but I'm impressed how nice it is for how little it cost. The only gripe I have is that it only has one HDMI connection.", "Date": "March 17, 2010"}, {"Title": "Kitchen TV", "Author": "valNmike \"ValNMike\"", "ReviewID": "R1YZBM7S35X75X", "Overall": "5.0", "Content": "We've been watching this (actually 23.5 inch diagonal) Viewsonic HDMI TV in our kitchen for several months now.  I haven't yet gotten another HD Verizon decoder for this TV, but even in standard definition this is a great TV. This is stupid on my part, because I spent a lot of time looking for a 1080p HDTV in this size.  I have only tried out the 1080i HD in another room (where we have the 1080i Verizon DVR) shortly after it arrived (before I installed it in the kitchen).  I use it with some external (computer) speakers with a subwoofer so I cannot accurately comment about its sound quality.  I have it on a wall mount above the refrigerator.  The one thing about this mounting position is I have to be careful when putting things on top of the refrigerator (below the TV).  This is because the control buttons are on the bottom of the unit... a good thing for reaching them when it's up high, but easy to bump and accidentally change something.  Fortunately, the remote control is easy to use to correct (reset) the settings.  The TV menu structure seems intuitive and easy to use.  It has several different inputs (see the product tech details) in addition to an HDMI input for the HD signal.  All in all, I'd buy another one of these if or when I am in the market for another TV this size, such as for a bedroom or as a computer monitor.", "Date": "February 17, 2010"}, {"Title": "Gift for mother-in-law", "Author": "J. Lynch", "ReviewID": "R12IV0T3KGP8JK", "Overall": "5.0", "Content": "This was a xmas gift for my 80 year old mother-in-law. It replaces her analog TV and digital converter box.  She has it hooked up to an indoor antenna and it works fine.  She's happy with it.", "Date": "February 2, 2010"}, {"Title": "Great value", "Author": "Flint Junod \"value shopper\"", "ReviewID": "RUUCQ08A16ESX", "Overall": "5.0", "Content": "This was a great value.  The price was lower than the unknown name models, and the performance is great.", "Date": "January 30, 2010"}, {"Title": "Nice", "Author": "Kile S. Vaught", "ReviewID": "RGALUFW50PAOE", "Overall": "5.0", "Content": "Very pleasantly surprised. The color and clarity exceeded expectations. Bedroom television and sleek and compact. I am very pleased!", "Date": "January 24, 2010"}, {"Title": "Great for College Gift", "Author": "Abby Normal \"Abby\"", "ReviewID": "R19SNLF1M2D5IV", "Overall": "5.0", "Content": "I gave this to my son for a birthday present after his tv died. He was too busy to open it up but when he did try it out, the picture quality was excellent. We are now trying to figure out a way for him to use it with his laptop for a monitor.", "Date": "December 8, 2009"}, {"Title": "DO NOT BUY!", "Author": "A. Sullivan", "ReviewID": "R2NQV6WFRI772N", "Overall": "1.0", "Content": "I have had this product for under three months and have kept it in perfect condition. I use it as an XBOX 360 monitor and also as an external PC monitor. It worked two hours ago and has randomly stopped working. TV screen goes gray with any input and have tried disconnecting and using one cord at a time to see if any input into the monitor works. Sound still works but that is it. Cannot access the menu and the TV will shut off randomly. When I call them for customer support the representative from the company was the least bit helpful and rude. I was told I need to sent it back to get repaired and they gave me an adress. I asked him if they could ship me a box to send it in, becuase being in the Army I do not have enough space for my own personal belongings, nevermind holding onto a 4ftX4ft box. The representative told me to go out and buy my own box, when I informed him I am not allowed to leave post except for certain weekends and I am not allowed to have a car in or around post, he told me he couldn't help me. This is unacceptable considering the TV is brand new and already broken. Instead of taking the $40 taxi ride and buying probably paying $50 to package and ship this back for a free repair, I have bought a new TV with Vizio, which are the TV's most of my friends have. Vizio is known for outstanding quality and customer support and I hope to never have to have another run in with ViewSonic and their customer \"support\" team.", "Date": "January 8, 2010"}, {"Title": "VERY HAPPY", "Author": "D. K. THOMAS \"LOONYKAI\"", "ReviewID": "R2FI3X8R0AK2JW", "Overall": "4.0", "Content": "I AM VERY HAPPY WITH MY PURCHASE OF THE VIEWSONIC VT2430. I WAITED 3 MONTHS TO WRITE MY REVIEW BECAUSE THERE WERE SOME REVIEWS FAULTING THE PERFORMANCE OF THIS TV. I HAVE HAD NO PERFORMANCE PROBLEMS WHATSOEVER.I HAD PROBLEMS HOOKING UP MY DVD PLAYER AND DIRECTV BOX FOR THERE WAS NOT A GOOD DIAGRAM OF HOW TO DO SO. BY TRAIL AND ERROR I MANAGED TO GET IT RIGHT, BUT NO FAULT BUT MY OWN IN NOT KNOWING WHAT I WAS DOING.THE PICTURE IS DECENT,COULD BE A LITTLE CRISPER. SOUND SEEMS FINE. I SIT LEVEL WITH THE TV AND APPROX. 5 FEET AWAY, ITS THE PERFECT SIZE AT THAT DISTANCE. THE TV LOOKS SHARP, I LIKE THE PIANO BLACK FINISH.I FOUND THE REMOTE EASY TO USE AND THE ON SCREEN SETUP SELF EXPLANITORY.I HAVE NOT HOOKED UP MY LAPTOP TO THE TV YET, BUT LIKE THE ABILITY TO DO SO.THIS IS MY FIRST LCD TV AND AM QUITE HAPPY THAT I CAN MOVE IT MYSELF, MY OLD TV WAS A 32 INCH AND TO HEAVY AND BULKY FOR ME TO MOVE MYSELF.ALL IN ALL I'M VERY HAPPY WITH MY PURCHASE.KAI FROM CA.", "Date": "August 3, 2010"}, {"Title": "Headphone socket issues", "Author": "P. Elliott \"Our Man Flint\"", "ReviewID": "R1DODRMMO5JE6L", "Overall": "3.0", "Content": "This is a nice unit and I had no troubles setting it up where I wanted it.  It's nice and light so it sits on top of the DVD and Tivo players.I was disappointed by the actual size of the picture, since I had measured our previous tube TV diagonally and determined the LCD replacement based on that, but didn't take into account the fact that the LCD diagonal screen size measurement was based on its wide screen shape and therefore the height measurement would end up being smaller than our current TV screen.  So watch out for that if you're replacing something you already have for the bedroom for example.  I eventually sent this TV back and replaced it with a 32\" for this reason and the headphone socket.Since this is in the bedroom, occasionally I was still watching a TV show after my wife had fallen asleep, so I used the headphone socket a few times to listen without disturbing her.  After maybe 5 times of using this socket (with a pair of Sony headphones), the removal of the headphone plug no longer returned sound to the speakers.  It seems that the headphone socket was apparently stuck in the open position even after taking the plug out.  I called Viewsonic support and they weren't able to help.  They gave me a case number and said they would call back with a returns number.  5 days later I gave up on them and just got a returns number from J&R; (the store it was actually shipped from) who would very helpful and since I was within 30 days had no problem taking it back.  As I write this, I am waiting for the credit to my account and I know it arrived at their offices yesterday, but this doesn't seem like it will be a problem.So in summary, I would suggest you take note of the actual screen height, not just the diagonal measurement when replacing your existing TV if you have one, and if you're never going to use the headphone socket, you should be fine with this model, which has perfectly fine looks, good picture and good sound for a small unit.  Of course, many people say 1080p at this size is not even noticable, and I would have to agree, and most HD shows are delivered in 720p so you're not going to see much of a gain over 720p models unless you intend to watch Blu-Ray I expect.", "Date": "September 23, 2009"}, {"Title": "Great Tv all arround, but difficult inputs", "Author": "Henri L. Jones \"Henri360\"", "ReviewID": "R38L3D2DXR4VKK", "Overall": "5.0", "Content": "Every thing about this Tv is Great from picture, sound, good surround sound, menu feature and good monitor with size. The only thing is how to hook up the differnt inputs. You have to do little bending and turnig in order to plug a cable to it in the back.", "Date": "October 6, 2009"}, {"Title": "Merry Christmas", "Author": "RonK", "ReviewID": "R33NML51JERO1Q", "Overall": "4.0", "Content": "Found a great deal for a pretty good TV. I'm sure it would be a great TV if I werent to cheap to to get HD from the cable company. :) Thanks for the Merry Christmas find of the season.", "Date": "September 2, 2011"}, {"Title": "Good value", "Author": "_nevermind_", "ReviewID": "R2LQIDYGEZ17VE", "Overall": "4.0", "Content": "This tv is a good value at this price. The 1080p high definitnion looks great. It is a little on the small side, but I live in a small apartment so it works perfectly. The options menu doesn't let you adjust screen brightness. Some movies are too dark to see clearly and I wish I could adjust this. Other than that, it is a good little tv.", "Date": "January 20, 2011"}, {"Title": "Awesome", "Author": "J-man", "ReviewID": "RETW4VYYYEB48", "Overall": "5.0", "Content": "I have seen quite a few HDTVs in my day and this is one of the best. I would highly recommend it!", "Date": "October 1, 2010"}, {"Title": "24\" ViewSonic", "Author": "Leenerdl \"The Queen\"", "ReviewID": "R27OSXOLSOWXWL", "Overall": "5.0", "Content": "Great picture, great price-very happy with this item. 24\" is not an easy size to find..............wish it had a DVD player, though.", "Date": "April 10, 2010"}, {"Title": "ViewSonic VT2430 24-Inch 1080p LCD HDTV", "Author": "Gordon D. Hart \"Gordo\"", "ReviewID": "R1Z7SIENE6GDT8", "Overall": "5.0", "Content": "Bought this TV for a Kitchen Renovation.  It was the biggest I could find that would fit the space I had available.  I would have preferred to get a bigger TV as I have been \"spoiled\" by my 50 inch in the Family Room.The TV works very well, the picture is excellent......I watched numerous GOLD medals won by Canadians at the Vancouver 2010 Olympics in Full High Definition while using the Kitchen.  Really haven't had a chance to rate the sound other than it appears to be adequate and if not will wire it into my Kitchen entertainment system.", "Date": "April 3, 2010"}, {"Title": "Excellent TV/Monitor", "Author": "Tyrell Towle", "ReviewID": "RGSOYU7ZKYF6T", "Overall": "5.0", "Content": "I recommend this TV for anyone looking for a good TV that's not too big.  It also acts as an excellent monitor.  It came with no dead pixels and it looks great.  The picture is perfect.  Sound quality isn't great but I've never owned a TV that had great sound built-in.  Get some surround sound speakers.", "Date": "December 11, 2009"}, {"Title": "If this is to be your PC monitor - stay away from it!", "Author": "Der Schoene Bahnhof", "ReviewID": "R2V57ZM5U7932", "Overall": "1.0", "Content": "I read good reviews on this flat TV/monitor and it was attractively priced. The form factor looked decent as well. However, as soon as I played a movie, it looked really grainy and edges were jagged.When I connected a computer through HDMI the image looked terrible. When the same computer is connected to a Dell 2409 though (with the same HDMI cable), the image on the Dell looks sharp and crisp.It seems to me that they are doing some kind of processing on the video signal, perhaps chroma sub sampling, which results in characters appearing jagged, with a halo around them. Thin lines look thicker than they should be, and don't even talk to me about web pages containing small text. Depending on the type of chroma sub sampling they are doing, this reduces the effective resolution by a factor of 2 or more. I can't confirm this is chroma sub sampling, but it looks like it. I haven't gone through checking whether it only takes YUV as input or RGB.Selling this product as a \"1920x1080 resolution\" monitor and \"brilliant\" display is just a marketing lie. Even if the actual resolution of the LCD panel is 1080p, the image processing that they are applying to the input signal makes it look more like a 960x540. Furthermore the initial setting out of the box looks a bit soft and way too bluish.As a cheap TV it may be ok, but other competing products from Samsung that I have seen at the same price show a crisp picture when connected to a PC.My recommendation: there are better products out there. Don't buy this one. As for me I just returned it as it will not fit its intended use (mostly as PC monitor and sometimes as TV).", "Date": "December 11, 2009"}, {"Title": "Not as good...", "Author": "tonyji", "ReviewID": "R2QSRMV3Z9VKFG", "Overall": "1.0", "Content": "I got this TV from Dell's online store. It came the next day after I placed the order. To assemble it is easy but the screen size is quite small and doesn't look like 24\". The sound is terriable and the picture isn't sharp at all so I decided to send it back. Called dell's customer service and somebody from India(I guess?from the accent) answered the phone. It took about 25 minutes and the guy alwasy put me on hold. Finally I received the label.When I tried to disassemble the TV I found they made it impossible for you to disconnect the stand, it is locked in permanently. So I had to unscrew it and it took me more than 20 minutes to put everything in the box. That thing is going to take a road trip soon.Will never recommend it to anybody. It is cheap stuff. Will buy a reputable brand like Panasonic and Sony. Viewsonic isn't worth the money. With $100 more you can get high quality ones.", "Date": "July 29, 2010"}, {"Title": "DO NOT BUY", "Author": "Buckaroo", "ReviewID": "RDWDFMJTVLQI4", "Overall": "1.0", "Content": "Nice monitor.I'm using it for a TV right now, computer later.Audio has limitations.I'm happy.ADDITIONAL:Set died at six months.Screen stuck at boot and pink.Repaired under warrenty, took four weeks.Still a major pain.Problem with HDMI, sometimes it sees a source, somtimes it doesn't.Usually I have to restart it or the source.The monitor is a total pain.I don't have confidence that it will last to long.I got it because V.S.'s CRT's were very good, this is NOT.Look elsewhere, like Samsung has been pretty good.", "Date": "April 2, 2010"}, {"Title": "poor sharpness, no definition", "Author": "C. Ho", "ReviewID": "RZNKZ8JBJC13N", "Overall": "2.0", "Content": "After reading the good reviews, I brought this unit couple weeks ago.  I am using it for TV only and have it plugged into my Comcast cable.  The color is good and natural, the quality of the speaker is so-so but surprisingly, it can be very loud.  I use it in the kitchen and have to set it at about 20%; otherwise, it will be too loud.For no apparent reason, the unit received no signal from the cable after one week.  I noticed that when I turn it on, the Viewsonic wallpaper, the three birds appears in grey. I tested it by hooking it up to the PC, same thing happened, no signal from the PC either.  But after some plugging and unplugging, miraculously, the color and the signal came back.  It's been another week, so far so good.  I hope it is not some loose wire inside the unit that caused the problem.Anyway, my major complaint is that the picture on this unit has absolutely no definition, I don't know if it is because I do not have HD channel or what, but the quality of the picture is so blend that my old Samsung box TV's picture is better.  It is especially bad on light color objects, you only see a patch of color and not much more.", "Date": "October 5, 2009"}, {"Title": "perfect for my needs", "Author": "Thomas R. Allen Jr.", "ReviewID": "R1YFR2QLC46BY3", "Overall": "5.0", "Content": "i got this thing specificaly to watch my roku player in my bedroom late at niteall i did was plug it in and turn it on.ta dai was using a laptop beforethis is way bettergreat picture on standard settingand i haven't even watched a 720p film yet (all roku can pump out for now)im using Giant as a 1st flick cause its old and 4:3 just to check it outlooks greati'll do some tweaking soongreat right out of the box perfect little bedroom tv", "Date": "November 2, 2009"}, {"Title": "EXCELLENT FEATURES,....BUT...", "Author": "M. Chang", "ReviewID": "R3PQPZ54QCVBME", "Overall": "4.0", "Content": "I am essentially pleased with this tv set, but had to go through many steps before I can say this:  I am moderately hearing impaired and depend upon CLOSED CAPTIONS to complete my understanding of any dialogue.  I was able to get the captions on the TV SETTING, but no matter what I did, reading and rereading the manual, could not get captions on the HDMI..high definition settings.  When I first emailed the VIEWSONIC website I was returned with a very polite email..and the directions were just a repeat of the manual.  After two or three more back and forths, I was advised that the HDMI does NOT support captions. I then wrote to J&R;, the seller of this tv set.  They were very cooperative and contacted VIEWSONIC on my behalf.  The rep was also advised that VIEWSONIC, indeed, does not suport the captioning on HDMI.  I felt that I was going to have to spend the rest of my VIEWSONIC viewing on the TV setting, in order to get the captions.  However, when my cable service people learned of my problem, they were able to get captions through my cable features.  I am now enjoying the full enjoyable features of the VIEWSONIC TV, no thanks to them.", "Date": "November 6, 2009"}, {"Title": "cool", "Author": "Robert L. James \"Gabriel\"", "ReviewID": "R2ZY3P3NM74S99", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1RIBKOMMU84ZGembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1RIBKOMMU84ZGrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1RIBKOMMU84ZGchiDiv\").innerHTML = document.getElementById(\"cv_mo1RIBKOMMU84ZGhiddenPre\").innerHTML;\n};\ncv_mo1RIBKOMMU84ZGrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1RIBKOMMU84ZGso;\t   \n\n\nfunction cv_mo1RIBKOMMU84ZGloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1RIBKOMMU84ZGso = new SWFObject(swfLocation, \"cv_mo1RIBKOMMU84ZGAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1RIBKOMMU84ZGso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1RIBKOMMU84ZGso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1RIBKOMMU84ZGso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1RIBKOMMU84ZGso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1RIBKOMMU84ZGso.setAttribute(\"height\", swfHeight);\n          cv_mo1RIBKOMMU84ZGso.setAttribute(\"width\", swfWidth);\n          cv_mo1RIBKOMMU84ZGso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1RIBKOMMU84ZGso.write(\"cv_mo1RIBKOMMU84ZGflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1RIBKOMMU84ZG', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1RIBKOMMU84ZG';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1RIBKOMMU84ZG', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1RIBKOMMU84ZGloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1RIBKOMMU84ZG\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3P9EE92OSDN28\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3P9EE92OSDN28\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2ZY3P3NM74S99\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3P9EE92OSDN28/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1RIBKOMMU84ZGduration')) {\n      document.getElementById('cv_mo1RIBKOMMU84ZGduration').style.display='none';\n    }\n    cv_mo1RIBKOMMU84ZGloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1RIBKOMMU84ZGloadSwf(movieID, playerVersion) {\n   return _cv_mo1RIBKOMMU84ZGloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1RIBKOMMU84ZGnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1RIBKOMMU84ZG', 0, h);\n}\n\nfunction cv_mo1RIBKOMMU84ZGresetPlayer(w,h,bw,cc) {\n  cv_mo1RIBKOMMU84ZGnewHeight(h);\n\n  cv_mo1RIBKOMMU84ZGso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1RIBKOMMU84ZGso.addVariable(\"cacheCode\", cc);\n  cv_mo1RIBKOMMU84ZGso.setAttribute(\"height\", h);\n  cv_mo1RIBKOMMU84ZGso.setAttribute(\"width\", w);\n  cv_mo1RIBKOMMU84ZGso.write(\"cv_mo1RIBKOMMU84ZGflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1RIBKOMMU84ZGRollOverImg = new Image();\ncv_mo1RIBKOMMU84ZGRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91pv0YCgpES._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1RIBKOMMU84ZGpreplay = document.getElementById('cv_mo1RIBKOMMU84ZGpreplayImageId');\nif (cv_mo1RIBKOMMU84ZGpreplay) {\n  cv_mo1RIBKOMMU84ZGpreplay.onmouseover = function() {\n    cv_mo1RIBKOMMU84ZGpreplay.src = \"http://ecx.images-amazon.com/images/I/91pv0YCgpES._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1RIBKOMMU84ZGpreplay.onmouseout = function() {\n    cv_mo1RIBKOMMU84ZGpreplay.src = \"http://ecx.images-amazon.com/images/I/91pv0YCgpES._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1RIBKOMMU84ZGpreplay.parentNode;\n\n  var cv_mo1RIBKOMMU84ZGcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1RIBKOMMU84ZGcurrentClick) {\n      return cv_mo1RIBKOMMU84ZGcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:30 MinsThis is a great Dolby Digital LCD TV. Great sound. Easy hook-up. I read bad reviews about this tv, but in my opinion, they're wrong. There's nothing wrong with it. It looks good in my bedroom. I recommend this television.", "Date": "June 16, 2010"}, {"Title": "Sound quality", "Author": "lorraine dutkiewicz", "ReviewID": "R38X3IFAZQINSN", "Overall": "3.0", "Content": "Had I know I may not have purchased 3 of them. Pic quality & ease of out of box hook up was great", "Date": "September 6, 2010"}, {"Title": "Not good for use as a PC monitor", "Author": "Adrian LaVallee", "ReviewID": "R34TCE618W0R53", "Overall": "2.0", "Content": "I bought this HDTV for dual use as a monitor (95% of the time) and as a TV in our Travel Trailer (a few weekends a year).  So the first thing I did was hook it up to my PC, as that is what matters most.  The results were extremely disappointing.  Text was blocky, diagonal lines looked jagged, and essentially the entire screen looked like it had gone through an \"emboss\" filter.  This is with my desktop at a setting of 1920x1080, the panel's native resolution.  It should look pixel perfect, just like the 22\" Vizio 1080p I was expecting to replace.  Instead, it looks like the image has been scaled up from their stated \"optimum PC resolution\" of 1360x768 - way too low resolution.  Why a HDTV/monitor with a true 1080p panel has an optimum resolution of anything OTHER than 1920x1080 is beyond me.  Regardless, I sent it back, and am out $45 return shipping (purchased from J&R; through Amazon, who I see is not currently selling this unit anymore, perhaps too many returns).  From now on, I won't be buying a TV/Monitor online without seeing it somewhere first!!  I'm giving two stars instead of one as a benefit of the doubt that as a TV it may look fine.  I didn't even try it as such.", "Date": "March 17, 2009"}, {"Title": "Parrots... Parrots... Parrots....", "Author": "Q", "ReviewID": "RQSRFQXTQBEU1", "Overall": "1.0", "Content": "Did you know that the bird is the word? If you don't like birds, don't buy this tv... sooner or later the birds will come at you and you will scream.", "Date": "June 2, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001KLEUOA"}}