{"Reviews": [{"Title": "It's a Great Television", "Author": "Hank \"Tech Lover and Outdoors Guy\"", "ReviewID": "R1FZVGUQ47MY6T", "Overall": "5.0", "Content": "Okay, Big Deal on the number of HDMI Ports.  3 or 4, what does it matter.  I bought a television first and foremost for the picture, then sound.This LG has a great picture.  Granted, its my first HDTV, but I could not be happier.  I have compared it to some sets in bargain, mass \"Mart\" type chains and I can see a difference.  1080p in 32\" is not commonplace yet, but it does make a difference.  Fast motion sports and other similar types of viewing remain very fluid and no jagged edges appear.The sound is above average, but I certainly do not expect it to sound like my home theatre system.This TV is one that I would recommend to everyone.", "Date": "December 11, 2008"}, {"Title": "I should have bought another Samsung", "Author": "D. Alexander", "ReviewID": "R1VG7MSRPFVK75", "Overall": "2.0", "Content": "I have a Samsung 52A650 in my living room -- great set. Unfortunately, the specifications on the Samsung 32A650 do not show that it has the same 120HZ frame rate as its big brother. The LG 32 - 70, however, is listed as having a 120HZ frame rate and its their top of the line model so I bought it. I also separately bought an LG Blu-Ray disc player to match with this TV.Both TV's are fed from the same video source. The picture quality on the LG is markedly inferior to that of the Samsung. The color range is narrower, the picture loses definition in the shadows and it seems grainy. No contrast, fineness, brightness, etc. adjustments are able to improve it to come close to the Samsung. Also, the LG Blu-Ray play does not appear to up-convert regular DVD discs to higher resolution. I have an up-converting DVD player connected to the Samsung and the picture quality of a standard DVD disk played on the upconverting DVD player is clearly better than that of the same DVD played on the LG Blu-Ray player.The LG products are okay, but no more than OK. I wish I had ignored the specifications and bought the Samsung 32A650 instead.", "Date": "January 29, 2009"}, {"Title": "Brilliant Picture", "Author": "Marek", "ReviewID": "R3QX2D825U62O8", "Overall": "5.0", "Content": "I got this TV as a replacement for an old CRT for the bedroom. I was nicely surprised that the TV has DTV and HDTV tuners and through my Cable service, without a cable box, it scanned and added plenty of DTV and HDTV channels that look absolutely stunning. It beats hands down the picture quality I get from the supposed HD DVR cable box I get from my cable company.As far as other features on the TV, I love the Smart Sensor which automatically adjusts the picture brightness based on the room's lighting. In other words, the image gets bright in the mornings when there's full sun shining through the window and gets dimm at night, without ever loosing any picture quality.Lastly, stop by and talk to your local TV repair shop to know which brand to buy nowadays. They are the best place to find out based on how many repair complaints they get, how expensive repairs are and how long do they have to wait for replacement parts from the manufacturer. Yes there are better and at the same time more expensive brands over LG like Sony and Panasonic, but LG has a solid track record so I got it recommended as a mid-range TV that won't give you headaches.", "Date": "March 24, 2009"}, {"Title": "First HD TV", "Author": "T. Jeter \"toptom\"", "ReviewID": "R36LCLLVJ2Y3IG", "Overall": "5.0", "Content": "This is our first HD TV and so far we couldn't be happier.  There was no problem setting it up and the audio features are great.  I really like the amplified voice and the way it maintains the sound level when a commercial comes on.  Our picture window is opposite the TV but we have no glare.", "Date": "January 14, 2009"}, {"Title": "not a bad TV, especially for the price I got it at!", "Author": "Mulder2012 \"\"Why is it that every time I ...", "ReviewID": "R1LGG42EOQIXK1", "Overall": "4.0", "Content": "I bought this TV to accompany a PS3 I received as a christmas gift.  The picture quality is excellent!  The intelligent sensor is an awesome addition because I have three windows in my room so as the sun begins to set it can get very bright depending on the cloud cover.  I don't understand some of the other reviewers saying the sound quality is not up to par and the remote control is of poor quality.  I have had absolutely no problems with either!  I also bought an HDMI cable from Amazon (Premium HDMI v1.3 Cable (2M/6ft.)) to hook this TV into my PS3.  I do have a minor issue but I'm not sure if it's the PS3, the HDMI cable, or the TV.  PS3 games that can display in 1080p (e.g. Metal Gear Solid 4) will not do so correctly.  When loading the disc the picture will freeze.  I found if I turn off the TV and turn it back on it will unfreeze but only very temporarily.  If I change the display setting on the PS3 to 1080i or less it will work fine.  Blu-ray movies in 1080p do play fine also which has me totally perplexed.  Anybody know why this happens???", "Date": "February 8, 2009"}, {"Title": "Great TV", "Author": "Luis F. Gonzalez Hernandez", "ReviewID": "R3T4O17JN5PSUO", "Overall": "5.0", "Content": "This TV exceeded my expectation.  The HDTV tuner works really well, the multiple inputs are more than enough to satisfy my needs (Cable Box converter, DVD, HDMI Inputs, etc.).The USB functionality is really cool.  I plugged in a small USB extender that had come in some other thing I bought, and to that I can plug my Western Digital external Hard Drive, and browse through photos with a stunning really amazing color display in the TV, and I can even listen to my MP3 as I browse the photos, all done through the USB with computer at all.  Trully a great buy !Cons: it will not play video files on your hard drive, nor will it access your hard drive over a network. The TAGS for the different inputs cannot all be customized.", "Date": "May 25, 2009"}, {"Title": "A Great TV for the price", "Author": "S. Hannon", "ReviewID": "R7ELZC9XD1T4F", "Overall": "4.0", "Content": "This is a great TV for the price. In fact, I paid the same price for an LG 32\" with 720p from one of the electronics chain stores in September. The picture is amazingly clear with brilliant color, the remote control is easy to use, the sound quality is great.It was disconcertingly pricey to get the necessary \"go-withs\" - HDMI cable and high-joules power surge strip ran about $120 and that was buying the low-end models. Also, the TV seems a bit wobbly on the pedestal, so it is vital that buyers use the screw to attach the pedestal to the TV stand, if they aren't using a wall mount. I am very satisfied with the purchase and would recommend it to anyone.", "Date": "March 18, 2009"}, {"Title": "Nice Picture", "Author": "Terry Dunning", "ReviewID": "RZ1HFS3EKERP6", "Overall": "4.0", "Content": "The picture on this HDTV is really spectacular. The intelligent lighting feature makes the clarity great in any light. The sound is very even though the volume could be better.I am happy with my purchase and after using it for more than a month I would recommend it to my friends.", "Date": "February 5, 2009"}, {"Title": "Wonderful picture", "Author": "Sean R. Prussel \"TV boy\"", "ReviewID": "R1GGYKHZNQAD05", "Overall": "4.0", "Content": "I don't believe you can get a better picture quality on a 32\" than the LG70 1080p and the price is unbeatable. Sound quality leaves a little bit to be desired so if you are into stereo surround sound a sound system is a must with this TV, otherwise the nest pic you can get on a 32\".", "Date": "January 20, 2009"}, {"Title": "Great buy!", "Author": "J. Davis", "ReviewID": "R2PLB6YSSN68O1", "Overall": "4.0", "Content": "Set looks great right out the box with no adjustments. Beautiful unit, and I recommend reagrless of if the 120mhz note was a error on Amazon's side. If you can really tell that big a difference anyway, I really cannot. I currently just have an HD antenna hooked up and it looks amazing....one of the best small sets  on the market right now for the money. Makes my friends Sony Bravia look like S.", "Date": "November 14, 2008"}, {"Title": "Very pleased", "Author": "Kerrin Britton", "ReviewID": "RZAD1513AG3KB", "Overall": "5.0", "Content": "I haven't bought a new TV in over ten years and the last one I had was a hand-me-down from my grandfaher (so yes, pretty old).  My new TV is big and shiny and pretty.  The remote it comes with works very well and I can actually adjust the color scheme if I want.  The set up was quick and easy.  Took it out of the box, had my brother set it up initially and done.  I moved a few weeks later so I had to take off the base and reattach but that was still very easy to do.  This may not be the most helpful review but just know that my tech-loving brother picked this out for me and he is jealous that he didn't get it first.", "Date": "May 4, 2009"}, {"Title": "This TV is fantastic!", "Author": "Lisa R.", "ReviewID": "R32XLAJZGOJ127", "Overall": "5.0", "Content": "I've been researching flatscreens since the end of last year and finally decided on the LG. I couldn't be happier! The clarity of the picture and the incredible sound were worth the wait. I spent two days on my couch watching the Masters & I don't even like golf that much. The price from amazon.com was also better than Best Buy. I'm glad I shopped around.", "Date": "April 16, 2009"}, {"Title": "So far...so Great", "Author": "BVI GAMER", "ReviewID": "RHPAO8D8Q2R84", "Overall": "4.0", "Content": "This product was actually gifted to me.Pros: Stylish, no dead pixels, great amount of connection options, smart features (for energy saving), runs cool, great response time during gaming, basic controls on side of TV (for those of us that sometimes loose the control- which is user friendly btw)Cons: Sound is average (not a small home theater as pitched- though with my surround I never notice)Overall: I'd recommend it. In fact I have and my cousin's should arrive shortly.", "Date": "April 6, 2009"}, {"Title": "Great Picture and Sound!", "Author": "Steve B.", "ReviewID": "R1U6LYNPRW905T", "Overall": "5.0", "Content": "I am very pleased with my purchase.  I would recommend this TV to anyone.", "Date": "April 3, 2009"}, {"Title": "Best dollar to performance ratio around!", "Author": "Steve A. Worth \"The Dreamer\"", "ReviewID": "REOO5Z9OVNTDJ", "Overall": "5.0", "Content": "This is an amazing TV. The quality of the picture is phenomenal.  It is not a 120hz (as those larger than 32\" are in the lg70 series) and they to not claim it to be (I check LG's site) but it still gives 24p performance.  You can stand up very close and the clarity is there.  I do not use the built-in speaker as all my sound runs straight to the Sony receiver so I can't talk about that aspect.  So, if you want 1080p (and you know you do) in a 32\" size, I wouldn't hesitate.  Enjoy", "Date": "March 4, 2009"}, {"Title": "Pleased with quality. Met my expectations.", "Author": "Sheila", "ReviewID": "R2ZDZASH5MJFB6", "Overall": "5.0", "Content": "Product was what I expected. It was easy to assemble. It is light weight and picture is excellent.", "Date": "February 15, 2009"}, {"Title": "nice, but...", "Author": "Michael F. Brown \"old guy videographer\"", "ReviewID": "RILENSXMSZ8K1", "Overall": "5.0", "Content": "I recently got the LG32 inch and it setup and runs like a dream. Really pretty picture, color balance. Everything, except.....no audio outs on the set. I was all ready to hose it into my surround sound system and no go. If you don't have an optical audio cable input (I don't), you're just out of luck.", "Date": "September 12, 2009"}, {"Title": "Awesome 1080p television for the price.", "Author": "G. Mock \"SnackPack\"", "ReviewID": "R3AZEPYTARI0KQ", "Overall": "5.0", "Content": "This TV is amazing. It's 32\" 1080p which is already hard to find, and is also a great price for a 120hz lcd television. It also has plenty of HDMI and other ways to connect whatever you need to connect. The picture quality is amazing, with many options to customize it to fit your preferences. Not only is the picture amazing, but the television itself is quite sexy, with red accent along the edges. It also comes with an easy to use remote and an owner's manual CD.If you're looking for an LCD television that is the perfect size, 1080p HD, and a great price, pick this one. You won't regret it.", "Date": "January 28, 2009"}, {"Title": "It's a great tv, but not as advertised.........", "Author": "P. Neely", "ReviewID": "RB6GO66MSUU5E", "Overall": "4.0", "Content": "I've had this tv for a little while now and it looks great.  When i first got it, I only used the RCA video in plugs, but it still looked pretty good. Now that i have the HDMI cables and a HD dishnet box, it is as good as it gets. The only con i have found is that many vendors advertise this tv as having \"4 HDMI ports\" and \"TruMotion 120Hz\".WRONG! It has 3 HDMI and 60Hz. Maybe the larger models ,but not the 32 inch model LG 32LG70.Other then that confusion, this is a great TV. I got mine at best buy for $699.", "Date": "December 27, 2008"}, {"Title": "False Advertising Indeed", "Author": "R. Michael Neumann \"Philosophy Department, Tr...", "ReviewID": "RNBUFTDER8ARU", "Overall": "2.0", "Content": "This unit is advertised as having 4 HDMI inputs. It only has 3. If that's not bad enough, the 120mhz spec is also false. Together these two false claims take what would be a top of the line 32\" LCD for a fair price down to an average LCD for a high price. I don't know which company is responsible, but between Amazon and LG this is really weak sauce.", "Date": "November 19, 2008"}, {"Title": "Review of LG 32 inch TV", "Author": "Grafton H. Hull \"Yoda\"", "ReviewID": "R1AIQVC8F4PJNT", "Overall": "5.0", "Content": "I found this item to be every bit as good as reviews suggested.  It is beautiful and has a great picture.", "Date": "October 18, 2008"}, {"Title": "Great TV", "Author": "Miss Deb \"Deb\"", "ReviewID": "R3F6DPK42EMH0H", "Overall": "5.0", "Content": "I bought this thing many many years ago when the prices were still high and 1080p was new. I love the LG brand.", "Date": "January 13, 2014"}, {"Title": "Great TV", "Author": "J. Perry \"Zak\"", "ReviewID": "R24VFWYOK75HB6", "Overall": "5.0", "Content": "This was a great tv in it's day. I bought this years ago. I think for its time it had a great picture.", "Date": "April 2, 2013"}, {"Title": "Good quality for the long haul", "Author": "Paul Matthew Pool \"coopoo18\"", "ReviewID": "RVAOJ71RJ2GXS", "Overall": "5.0", "Content": "I did my research and purchased this for $600 back in the summer of 2009. I wanted something that would last the long haul of technology upgrading and serve as a dual-monitor with my computer.I have used this as my PC monitor for over two years now, HD gaming and watching Blu-ray movies and DVD's continually, on top of the standard browsing. It has never given me an issue and has worked flawlessly from day one.Photos look great, sound is decent (most companies will skip on the sound and focus on other areas since they assume many will buy separate systems for their sound but this, compared to other stock TV's has a decent speaker system built in) and the image quality is outstanding.At times, especially on a cloudy day with the windows open the intelligent sensor can be annoying, constantly adjusting with the change in light from cloud cover, but it is easy enough to turn off and worthwhile to leave on during regular use.The ability to control the TV from the side panel has been a huge blessing. having it as a computer monitor I rarely sit at a distance and it is nice to be able to adjust the volume or change the input (also used with our WII) without having to pick up the remote and aim it at a TV a two feet away.The audio options are excellent, 3 HDMI ports are nothing but needed these days.I recently had to buy a Blu-ray player since the windows 7 upgrade to my PC disabled my blu-ray abilities (HP Pavilion dv5-1183cl, forums claim known issues). I went with the new Sony BDP-S580 Blu-Ray Disc Player (Black) and could not be happier with the combination.Excellent TV, small enough to not be the center of attention in a room, but large enough to really see everything in movies/gaming.", "Date": "March 9, 2011"}, {"Title": "Great TV, Love IT...", "Author": "MB \"MB\"", "ReviewID": "R1RWYNSD7R977H", "Overall": "5.0", "Content": "I got this TV during ThanksGiving weekend for a very good price, setup was easy, also pluged it with my computer and just love it.", "Date": "July 31, 2009"}, {"Title": "32LG70 highly recommended", "Author": "H. Nelson", "ReviewID": "R2LK591VJABCHX", "Overall": "5.0", "Content": "LG makes LCD panels at their state-of-the-art factories used by many other labels.  The 32LG70 is a first-rate product with a good looking glossy black case, friendly menu, and excellent color.  While it does not have the deep blacks of plasma, it compares favorably with any and all 32 inch LCD panels.  The entire LG70 series are top of the line and highly recommended.LG 32LG70 32-Inch 1080p LCD HDTV", "Date": "June 11, 2009"}, {"Title": "false advertising", "Author": "Joorge", "ReviewID": "RH7EG6FOLCOYW", "Overall": "1.0", "Content": "This 32LG70 was supposed to have 4 HDMI ports but only has 3. It's also suppose to have TruMotion 120Hz and does not!!I called LG and was told that it was limited by my Comcast Cable connection. When I pressed them, I was told that the 32\" model didn't have TruMotion 120Hz. They said they are not responsible for what Amazon claims on their site. I pointed out the specs on the LG site and they quickly updated from 4 to 3 HDMI. LG said a manager would call me tomorrow. I'll see.", "Date": "November 12, 2008"}, {"Title": "Awesome TV..", "Author": "G. Howard \"HardWorkPays\"", "ReviewID": "RK78LZ2MFR7N1", "Overall": "5.0", "Content": "I like this TV.. My 2nd LG.  Remote should be back-lit, but... Good inputs, it hangs well on the wall.  I like the Red/Side finish to it. Good product, good price, and Amazon shipping was timely.", "Date": "May 15, 2009"}, {"Title": "Nanwalli", "Author": "Nancy E. Wall", "ReviewID": "R2QV7SEGX2R2J7", "Overall": "4.0", "Content": "Love the TV, but the stand is not very sturdy.  Really, a strong breeze could knock it over.  I live in CA and earthquakes are a constant threat. I'm going to have to buy a wall mount to ensure it doesn't fall and break in an earthquake or other inevitable accident.", "Date": "April 15, 2009"}, {"Title": "Excellent Monitor for the price!", "Author": "M. Swift", "ReviewID": "R3HLREENVWAAS", "Overall": "4.0", "Content": "With all the crying over a 4th port that isn't actually available this TV is getting a bad rating for basically nothing. I hate it when people can't find their tissue.This screen looks great is is priced right for the size. Highly recommend it!", "Date": "November 23, 2008"}, {"Title": "Not Worth It", "Author": "RobertR", "ReviewID": "R3DXJMIIZ9GITK", "Overall": "1.0", "Content": "If you are planning on using an HDMI device with 1080p on this TV, be careful.  I had a problem with the TV flickering when my Playstation 3 was set to 1080p.  LG support was horrible, they eventually told me to use component cables and forget about the HDMI.  LG has poor support and the picture quality on this TV does not compare to the picture quality of the 32\" Samsung I exchanged for this one.  If you are in the market for a good HD TV check out Samsung.  They may cost a little more but they are well worth it.", "Date": "February 12, 2009"}, {"Title": "Typical Amazon-- Wonderful!!", "Author": "MarshaE \"Jade\"", "ReviewID": "R3I57UP7A1GPO0", "Overall": "5.0", "Content": "Thank you again Amazon.... This is typical of your products-- Understand why Consumer Reports wrote you as exceptional re: Customer Service.... Continue the great work!", "Date": "December 22, 2008"}, {"Title": "Best TV yet", "Author": "Roy L. Switzer Jr.", "ReviewID": "R2RL0KPNB2N12P", "Overall": "5.0", "Content": "I have owned many televisions and most brands, without question this LG has the best picture and color. It has more features than any previous television that I have owned, including every adjustment that anyone could ever want to make to color,picture,sound and interior lighting conditions. Even with all the adjustments I have found for my vewing I prefere the factory settings. The sound has a feature that keeps the volumn at an even level when a comercial or local broadcast comes on. The sound does not have quite the quality of some of the sets that I have owned, but is quite addiquate. Best tv for the price or several hundred dollars more that I found while shoppinp for a new tv.", "Date": "March 30, 2009"}, {"Title": "Is it on yet?", "Author": "Bobby", "ReviewID": "R3E4IW7U0QVNXE", "Overall": "3.0", "Content": "It literally takes several seconds to turn on, very weird.  My two main complaints are that the color looks really washed out when viewed from  angles, and the sound is very \"tinny.\"  I bought this model because of the amount of color settings, and I am still tweaking it after several weeks.  I think I need to buy a CD to help adjust the colors and maybe that will help with the angled viewing problem.  However, my sister's Sony Bravia seems to have a much better picture when viewed from angles, hers is 780p and mine is 1080p, and she didn't have to adjust the color settings.  Couldn't beat the price for a 1080p, less than $750, and the white glove service was great.  I had them deliver to my workplace.  They called me ahead of time and I met them at my car and they put the TV into my trunk for me!", "Date": "February 2, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "LCD HDTV features an elegant & distinctive lower edge tear drop design with swivel stand\n1080p Full HD resolution 1920 x 1080p with 4x HDMI v 1.3 digital inputs\nISFccc caple of professional calibration for picture performance\nInvisible speaker system for richer more balanced sound & a polished look\n15,000:1 Dynamic contrast ratio", "Name": "LG 32LG70 32-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31X2WnErLkL._SX300_.jpg", "ProductID": "B0019LPXXS"}}