{"Reviews": [{"Title": "Knockout TV set", "Author": "Just a photog", "ReviewID": "R3COWYPVPZJ16E", "Overall": "5.0", "Content": "We replaced an 18 year old 27\" CRT set with this one and it's a beauty. I am a TV news cameraman with thirty years in the business so I look at a lot of high end monitors at work. When I went to the store I didn't expect to get a great set in this size and frankly 720P didn't excite me much either. After looking at top tier sets from Sony, LG, Samsung, Toshiba and Mitsubishi I ended up on the Panasonic. I was shocked at how good all the upper tier sets looked but the Panasonic seemed to have a little better detail down in the blacks and seemed to track highly detailed scenes with less digital noise than the others, but it was close accross the board. The off air ATSC tuner is excellent and the set has all the inputs you could reasonably need. I do not intend to plug in an iPod so that wasn't a factor in my choice. My DVD player is older and does not pass audio through the HDMI output so I connected it to the set via the component outs and I feel no need at all to upgrade to a BlueRay player. At this size this is a wonderful combination. My general feeling is that if you watch a lot of HDTV that is live or tape such as sports then Panasonic flat screens just seem to pull a little more quality out of the signal. For movies it is more of a level playing field. This is pretty subjective but it's how I see it.It's amazing how far your money goes in this stuff anymore.", "Date": "August 17, 2009"}, {"Title": "Works Great, perfectly fits the budget!", "Author": "Tony Thiel", "ReviewID": "R26XEXHK9HIXPG", "Overall": "5.0", "Content": "We have a 50\" Sony SXRD Projection TV in which we paid over $5,000 for including the stand!  I love the TV but when your Electricity bill is over $300.00, you need to find ways of cutting down on the utilities.  Besides that, this TV needs to have its projection lamp replaced once a year at the cost of over $300!  Even at discount places, this lamp is still over $250!  Think about replacing that lamp every year.  In no time, you would have spent enough to purchase a brand new 40 - 50 inch LCD TV.  This Panasonic TV is not only smaller but Star Energy rated, so that should save some on the energy cost.In the bedroom was an old Toshiba 13\" CRT type TV and watching movies on it wasn't much fun, so what better time to replace the bedroom TV.  Since I'm retired and have a limited income, my budget was under $350 and this fits the budget perfectly.I read somewhere that the size of the TV one should buy should be based on the distance (in inches) from the TV to where you'll be sitting; divided by 2.5.  After measuring the distance, I came up with 80\", divided by 2.5 and it comes out to 32 inches.  A 32\" TV would have been perfect but too big for the stand I wanted it to sit on, so I settled for this TV and I'm a happy camper!  Besides, it would have been beyond my budget! I do wonder however if this is just another advertising ploy to sell you a larger unit?  I think that dividing the distance by 3 works out just as well.In comparison, the Sony has a softer smoother image while the picture on this TV is more vivid and has more contrast.  Having worked at a large Electronic Store, I have noticed that most people prefer a brighter more contrasting image when it comes to TVs and monitors.  I still prefer the Sony because the picture (to me) is a bit more realistic but that's just a minor complaint.One concern was choosing between a 1080P and 720P monitor. But from what I've been told, it makes a difference on a larger TV (40\" or more), but not so much with the smaller screens.  I tend to agree with that since it's all about the number of pixels (dots), the distance between each pixel and their size.  Have you ever noticed on the old CRT TV's that the smaller the TV, the better the picture quality?  That's because (without getting too technical) there's a set number of pixels horizontally and vertically on a CRT, and the smaller and closer the pixels are, the better the image. On the smaller screen size, the pixels are smaller and closer together which makes the images clearer.  The number of pixels does make a difference, but only to a certain extent.  It depends on the area to be filled.  On this size TV, the 720P works very well and you won't see a major difference if it had 1080P.Another concern was whether to purchase a new DVD player.  Hooking up an old standard DVD player to an HDTV didn't make any sense.  So I had to consider a Blu Ray or an up-converting DVD player.  That was an easy decision since we have about 2000 standard DVD's.  Replacing all those with the Blu Ray equivalent would get costly (about 10-20 grand), so an up converting DVD player was the obvious choiceSo I purchased the Sony HDMI DVP NS710H up-converting player, and combined with this TV, works great!  The picture is stunning and I couldn't be happier.  No, it's not quite as good as having Blu Ray, but it does improve the image of a standard DVD considerably.  However, the up-conversion only works if you hook it up via an HDMI cable.  So please be aware of that!You can hook your PC video output to this T.V. via a 15 pin VGA cable and the image looks fairly decent, but you may have to adjust the Horizontal and the Vertical positions on the TV, and the resolution on your graphics card as well.  The native resolution for this T.V. is 1366 x 768, but you can try the different resolutions that your graphics card has to offer and find one to your liking.  The process is fairly simple if you have the right cables and a 15 pin VGA output plug on your PC. However some of the newer graphics cards only have DVI outputs, so you will have to get a DVI to VGA converter.  Right now, I have this set up to output my Netflix movies to this T.V.(Addendum as of Jan 16, 2010)  I now have a Roku HD player for watching Netflix and Amazon movies and it works wonderful.  Now I don't have to mess around with flipping back and forth from Computer monitor to the T.V.  It was becoming a pain and the PC is unusable while it was being used to stream in the movies.  The only thing you should be aware of is that you NEED some kind of a router for it to access the internet and use HDMI cable instead of the provided composite cable for best results.In regards to the poor viewing angle; It IS disturbing that the description of this TV states that the wide 178 degree viewing angle ensures clear images even when viewed from an angle.  This is clearly not the case as far as my TV is concerned.  Well maybe to their point of view, having a clear image versus a washed out image are two different things.  However again, it's a minor complaint because how often are you going to watch it from the sides?Picture Quality (when hooked up to Cable, DSL, Antenna)?Excellent IF you're getting good reception from your provider.  But keep in mind that if your reception is poor, this TV will NOT improve the image quality.  In the copy world it's referred to as \"Garbage In, Garbage Out\".  That simply means that if you try and copy an illegible image or text, don't expect the copier to suddenly make it clearer and sharper.  I am not aware of any TV that has what may be called an \"Image Clarifier\" but may be possible in the future.  But as of now we know that NOT all channels will come in clear, and so this TV will only output what's coming in.Sound Volume?  It has plenty for a bedroom.  In fact, I had it on a little over halfway and my wife who was in another room downstairs asked me to turn the volume down.  However, audio output is only 10 Watts (5W +5W) and the speakers are located underneath: to the left and to the right of the stand. So this TV is meant for a bedroom or a similar environment.  It is not meant to be the main TV in a large room connected to a surround sound system.  That, I have on my 50\" Sony TV.  It is also not meant for a noisy environment such as a garage while you're working on your table saw or doing laundry, or in a Kitchen while you're running the garbage disposal or the dishwasher.  No, it's not meant to compete with other surrounding noises.  So please keep that in mind when making your purchasing decision.Outputting TV sound to a sound system or Speakers:  It DOESN'T have a Headphone Jack, and please be aware that this can only be done via an OPTICAL cable.  So whatever you're connecting it into must have an OPTICAL (Toslink) input.  You can purchase a third party converter such as the GENFEN but be aware that there are two versions (The cheaper model does NOT convert Hi-Def (5-1 Dolby Surround Sound) audio.  Another option is to purchase one of the Behringer MS### Speakers which has an Optical input.The SD card viewer:  Would have been nicer if they had a USB port instead where you can plug in a flash drive or an SD card reader.  There are so many different types and sizes of SD cards that if you don't have the right size, it won't work.  As an example, I have a Nikon D200 (uses an SD card) and an Olympus C3040 Camedia Camera (uses a Smartmedia card) and neither one will fit into the TV's card reader.  I could purchase the right size SD card, insert it into my SD card reader and transfer pictures into it, but why go through the extra expense and effort?The IPOD Docking Station:  I don't have an IPOD, but I'm willing to bet that it's a nifty little feature that a lot of people can use.  Lots of people out there with IPODS!  I have the less expensive Sandisk for listening to music while I work outside or walk and it serves me well.The Controller:  Easy to read with LARGE LEGIBLE buttons for Old tired eyes like mine!  Two of my favorites are LAST (to flip back and forth from the last channel watched) and MUTE (for those annoying commercials!)I know that this has been a lenghty review, but I hope that I've given you enough information for you to make an intelligent purchasing decision.  I love this TV and would highly recommend it for it's picture quality, stylish look and it wasn't too long ago that you couldn't touch an LCD T.V. like this at this price! AWESOME!", "Date": "December 21, 2009"}, {"Title": "Fantastic TV", "Author": "Sir Spends-a-lot", "ReviewID": "R3MAF5GDBV7V0D", "Overall": "5.0", "Content": "I just received this TV yesterday and all I can say so far is WOW!!!!It is in our bedroom and looks great (picture and aesthetics wise). The iPod dock is also very nice. The sound is excellent for a small (?) TV.One thing to note. Unless you are a magician, be sure to use long needle nose pliers to get the screws started into the stand/base when attaching it to the TV. Very hard to do with just a screw driver.My only complaint so far is that the sleeper timer does not have a dedicated button on the remote. You have to go into 2 different menu screens to get to it. My way around that was to set each of the 5 timers the TV has so that each one goes off at 11pm Sunday night through Thursday night. This obviously is not an issue if you are using it somewhere other than a bedroom.P.S. - Don't be swayed by the talk about size of your TV and the viewing distance. This 26\" is a perfect size for our bedroom (sits on 5 drawer dresser about 12ft from my pillow). The charts for LCD TVs had me at a 42\" minimum, which is not true IMHO.", "Date": "May 29, 2009"}, {"Title": "Setup hint for attaching stand", "Author": "Nahant Rocks", "ReviewID": "R2CBSKJZVOATBF", "Overall": "5.0", "Content": "Great TV, a nice replacement for a recently deceased Sony Trinitron (RIP, old friend).  Setup was straightforward, all went smoothly once we got it put together.Thanks to previous reviewers, I expected some issues with attaching the stand to the TV itself and was not disappointed.  There are 4 short bolts that you have to insert, that connect the stand to the TV frame.  The threaded holes for each bolt are at the end of a 1- to 2-inch deep (or so) tunnel in the back of the TV frame, so you can't get them started by just screwing them in with your fingers and finishing up with a screwdriver.  The manual suggests that you do this by laying the TV screen-down on a towel, but  (unless you have a magnetized phillips head screwdriver, maybe - I don't) the bolts just fall sideways off the screwdriver, down into the bottom of the well, with no easy way to get the bolts started in their holes.  I have needle-nose pliers but they weren't useful - tunnels too narrow.Instead, I started with the TV screen-down on a towel on a table, slid the stand into position in its slot on the frame, then carefully rotated the TV and stand upright.  That way, I could use my \"fat\" phillips-head screwdriver to balance the bolt on the end of the screwdriver, and carefully insert the bolt on the tip of the screwdriver, horizontally into the tunnel.  Even though you can't see where you're aiming, it wasn't hard to find the holes and all 4 went it quickly doing it that way.", "Date": "December 23, 2009"}, {"Title": "Superb value", "Author": "Dr.Z \"Hadshad\"", "ReviewID": "R3O5Z9JIVPDAHC", "Overall": "5.0", "Content": "The Panasonic TC-L26X1 LCD TV is a superb choice for an entry level 26\" set. I ordered it from Amazon on June 2nd (free shipping) and received it on June 5th in excellent condition. Setup was a snap and the picture is great. Sound is so-so, but adequate for a small set. I hooked it up to a Samsung Home Theater and now the sound is fine. You should be aware, however, that the only audio out connection on this set is a Digital Audio Out port requiring a Digital Optical cable. This is only necessary if you want to connect the TV to a home theater or wireless headphones (also of the Digital Optical type). In addition, you can't find a better price than Amazon's. I tried Best Buy (they don't carry the model], and Bernies, who had it on sale for $499.99, but wouldn't come down on the price. All in all, a great set at a great price.", "Date": "June 11, 2009"}, {"Title": "Excellent TV", "Author": "B. Register \"Scott R.\"", "ReviewID": "R3AF7DNK56KO83", "Overall": "4.0", "Content": "I needed a replacement TV in the kitchen and wanted a flat screen to save space.  I ordered the TC-L26X1 as it was the largest that would fit in the space I had available.  I've had the TV for about a month and I'm extremely pleased so far.  The only reason I didn't rate it with 5 stars is due to the one con below.  For some folks this will not be a factor, and truthfully it is not a significant factor for me either.Pros:  - Outstanding OTA digital tuner (brings in two more channels than my Panasonic TH-42PZ700U)  - Excellent Picture  - IPod dock and on-screen interface is an extremely nice feature!  - Two HDMI inputs  - Digital audio outputCon:  - No RCA or headphone audio output.  Not a big deal, but wanted to interface with a Bose Wave radio for better sound quality in the kitchen environment.  The digital audio output would work great if I had a stereo receiver in the kitchen.This TV is an excellent value and I would not hesitate to purchase the 26\", 32\" or 37\" for a bedroom or small space environment.  As usual Amazon provided an outstanding price and shipping service.", "Date": "June 29, 2009"}, {"Title": "Great Set, Especially for LCD Newbies", "Author": "IRG", "ReviewID": "R595DQ1F1JFHQ", "Overall": "4.0", "Content": "We spent weeks checking reviews, checking out actual sets in various stores and finally decided on a Panasonic, despite other brands (Sony and Sharp) being maybe $20 to $30 cheaper for this size (or close to it) during Black Friday and Cyber Monday sales.I took friends and had them say what they liked best, without telling them what we liked. Three of the three people who traipsed thru stores picked the panasonic over the sony, sharp and toshiba models that were everywhere. It's all about what you see and it's always gonna be a crap shoot because as everyone will tell you, what you see in the store may not be the same as what you see at home, depending on cable provider/type of input, setup options, etc.Ironically, everyone selling Panasonic has raised their prices in last week or two. (You could get the 32 inch for $399 or lower. THen it went back up to over $500. The 26 inch had reached a low of around $329 but then went back up to $400 and over for some merchants, with $349 being the lowest that we found, from Amazon.)We had been considering a Hannspree 28 at $299, but not only could we not see it, the day we went to order, it was sold out everywhere. THat was the day when we looked at our old set and said: Enough already. 11 year-old Sharp had served us well (old CRT) but seriously, time to enter the LCD world. We could barely see the onscreen cable guide. It wasn't easy to bite the bullet when we needed a smaller set and the 32-inch models were so cheap. (But we have no room in our bedroom and it would have been a huge (no pun) mistake to get a 32 inch as we only have about 8 feet tops from the cabinet and our bed. And that's the ONLY place we could place it. Heck, this unit would be big in our living room. (City living but we actually have \"large\" rooms, they are just not wide rooms and that's where you get limits.)The box did indeed have some bumps, etc on it and it made us a bit nervous that the Fed Ex guy did not have it on the cart the right way up (Why does no one look at the arrows on the boxes?)But it seems to be intact.Frankly, the interior packaging was worrisome. THese manufacturers don't seem to believe in any real padding or protection for these very delicate screens. I get junk stuff that costs nothing with more secure interior packing materials and real padding than this TV. (Panasonic: Pay attention!)The trickiest part of assembly was the small screws that held the stand in place. It would have helped to have had a magnetized screwdriver because it took us a while to get each one in the proper way.As others have noted, it's a very bare bones info for setup and we had it up and running in like 10 minutes (it took longer to move stuff to get at the back of our old TV and our TW cable box to unplug old set and its cable.)Here's the best part for us, as Time Warner-dependent folks: The pix quality with just the regular cable input on back (and three component in connections) is fantastic. Which makes us wonder how astounding the HDMI will be (We would need a new box and we've heard about lots of problems with all of the HDMI-equipped boxes that Time Warner uses, which are all Scientific Atlanta (now Cisco?). Tons of online forums filled with complaints.)We were concerned that pix quality would be compromised without another box. Now, we can wait. (And we'll see how HDMI works by connecting our new Sony laptop to the HDMI connection on the set.) We really don't want to mess with another box as we have lots of other stuff attached, including Slingbox.Setup was fast. The options are relatively limited, but really, how much do you need if the pix looks good?The onscreen setup is fairly intuitive (if you've ever used a cable company remote), so you can access features easily.The two things we loved about this model were the iPod dock (for select iPods, nanos, touch and phones--don't waste your time calling the Apple stores. THey can't tell you which units work. They refer you to Panasonic.) because we have friends who have lots of stuff on their units and this is a quick way to share (video, photos). We haven't tested that yet.The other feature is the easily accessed on left side SD card. We love this, especially for friends and family who want to share photos. Very quick and easy. Small lag time between accessing photos (their is a slideshow feature).A word of caution: We don't know if it's just our unit, or all of them, but you have to be very careful taking the SD card out. It seems to stick and you have to try the in/out bit a few times and then gently pull it out. (This has never happened on our computer or our camera, so...)My only gripes, as it is about all these models: Speakers should be upfront, not underneath, but sound quality is still more than OK. (We're not looking for theater quality in this size room.) And the bases should turn.The other thing is this whole shiny black cabinet. HATE that quite frankly and it does pick up glare due to the windows and lights we have in the apartment.But the viewing angles are good enough that we can watch the TV from the bathroom about 12 feet away and it's not all that bad in terms of color or \"depth.\"The DVDs (regular, not blue ray) we've played so far look outstanding. (Almost as great as they do on our Toshiba laptops, which have exceptional resolution. We often watch on the fly while traveling.)One last thing: We could not mount this on a wall so it's on a stand that raises it so its now about 46 inches off the floor, which is maybe a foot or more higher than our bed. So we can't vouch for how it looks when you look \"up\" as you do with a wall mount.All in all, we're pretty satisfied. Now, let's hope for some long-term reliability and several years of use out of this. (We're spoiled. We had Sony and Sharp units, big ones, over the years that each lasted over a decade. We had smaller models that lasted 15+ years! We're not big on buying just to have New New New.)  Only time will tell.FYI: I believe this model was one recommended by Consumer's Report.", "Date": "December 3, 2009"}, {"Title": "Wonderful 26\" LCD for the money", "Author": "SixBurgh", "ReviewID": "R24XQ77AFXEEN", "Overall": "5.0", "Content": "I love this LCD TV. My Sony 21\" tube TV of twenty plus years finally started to go out on me so it was more cost effective to buy a new LCD TV rather than fix the old Sony. The clarity of what HD channels I have on cable are wonderful. I have basic cable and most digital channels are converted down to analog but it still displays the analog channels fairly well. I've read most LCD's don't do a nice job with analog signals. The speakers are mounted underneath the TV but do sound surprisingly good. You can't expect home theater sound from any of these types of speakers or even much bass but voice clarity if great. I also looked at a equivalent Sony model in this range but settled on the Panasonic as it seemed to have more vivid color. The remote control is well laid out and does the job well. I won't be using the iPod dock and have no opinion on it but have used the SD memory card slot. The TV has built in software for the SD card for viewing digital photos and it displays photos well, of course this also depends on your camera as well. Can't go wrong with the Panasonic Viera TCL26X1 if your looking for a 26\" for the bedroom or kitchen.", "Date": "June 23, 2009"}, {"Title": "Poor viewing angle", "Author": "Viking Fan", "ReviewID": "R3VITKO913A6L", "Overall": "3.0", "Content": "I've owned the TV for about 2 months.  One thing to be aware of is that the viewing angle on this TV is very poor. I have it in my Kitchen and as soon as you get a few feet from straight on viewing you can see the picture start to fade.  I can't believe no one else has mentioned this.  If have to watch this from the side or below you would want to look for a different TV.  Unfortunately i think most 26inch TVs have poor view angles.  I have heard the LG is good.  If I would have bought this at a local store i would have taken back because of the viewing angle.  Otherwise seems like a nice TV and if you are viewing straight on has a good picture.", "Date": "November 28, 2009"}, {"Title": "just what I was looking for", "Author": "Amazon Junkie \"Ricky\"", "ReviewID": "R1D9GENDWOE0WQ", "Overall": "5.0", "Content": "I had looked at this model in the 32\" size at Best Buy and thought it had the best picture but they didn't sell the 26\" I have been reading reviews for over a year and this model always had good reviews. I replaced a 27\" tube TV and was not sure if the sound was going to be as good in a LCD flat screen. I watch it from bed and it is about 12 feet away, and the sound quality is very good. I found it on Amazon for less than $400.00 and am glad I purchased it. It has a slot for a SD camera cardon the side which I wasn't aware of. I always had to connect my camera with a cable which I always had to find to view my pictures on my other TV. The digital HD stations are great. I wasnt'able to view the HD stations before because the cable company required a converter box which I didn't want to spend the money for.", "Date": "September 28, 2009"}, {"Title": "Great TV", "Author": "Dr. Goodbook", "ReviewID": "R2M1H9BWO8YCVQ", "Overall": "5.0", "Content": "I like everything about this TV.  Great picture, user-friendly remote.  Not into the high tech stuff.  Just wanted a TV for the bedroom that got a good picture, and this one is definitely the best set I have ever owned.", "Date": "August 1, 2009"}, {"Title": "Good TV for the price", "Author": "Blue", "ReviewID": "RX4P4X0ULN8IJ", "Overall": "4.0", "Content": "This is a good TV for the price and the perfect size for a bedroom. It came packaged in an enormous box that protected it well in transit. This TV is fairly lightweight and was easy to assemble if you use needle nose pliers to insert the screw into the base. I love that this TV picks up digital and analog channels including some of the music-only channels. The picture is a little dark, but changing the setting to \"Cinema\" helps somewhat without changing all of the color options. Although it still looks dark during night scenes. The sound is very quiet, but adequate for a small room.  It sounds a little hollow or tinny in quality no matter how loud it is turned up, but you get used to it. I like that you have the option to change the picture format, since not all shows are in 4:3 and not all movies are widescreen. However, even though the TV itself is wide format, you have to use the \"Zoom\" format for any widescreen programs to fill the entire screen unless you want the people to look short and fat. Unfortunately, the zoom format means the picture is blown up and therefore you lose a lot of quality. If you don't have much to spend on an LCD HD for a small room, this is a good TV. I feel like I got the features that I paid for and as a bonus, the TV looks much more expensive than it actually is.", "Date": "September 14, 2009"}, {"Title": "Great deal!", "Author": "ThinkGadget", "ReviewID": "R2G07TMN0CXD4X", "Overall": "5.0", "Content": "I bought this TV on Amazon.com.  It arrived quickly and in perfect condition.  I couldn't be more pleased.  The iPod integration, which is an added bonus even works with my iPhone.  It was disappointing that the movies and podcasts play in a small window - but they would look terrible if they went full screen, so I can't complain.  I frequently use the dock just to recharge my phone overnight!  I'm a very satisfied customer.", "Date": "July 1, 2009"}, {"Title": "The best digital photo frame out there -- plus it's a TV with iPod dock!", "Author": "R. Thompson \"sixseven\"", "ReviewID": "R2Y64JMUJDXEW6", "Overall": "5.0", "Content": "This unit beats the pants off of any digital photo frame out there! With that off my chest let me explain.The ONLY reason I bought this TV is because I was getting tired -- really tired -- of digital picture frames with their 7 to 10-inch screens.  These devices are far too small to accurately display anything more than a casual snapshot, and they're relatively expensive to boot.Oddly enough, as TV manufacturers have begun competing increasingly on price, some important features -- like media card readers that allow displays to create slideshows -- are being left out of many sets.  To me this is a crucial feature that I've enjoyed on all of my TVs over the past 4-5 years.  I do a lot of photography and this ability is important to me.The X1 has an SD card-reader built into the side.  Even better, the Viera X1 TV is large enough to serve as a digital frame that's roughly the size of a framed and mounted photo enlargement; the actual screen size is 13 x 23-inches.  The slideshow settings are easily accessed via a single button on the remote, and work very well.  If you want an even larger display, there is a 32-inch model available on Amazon called the Panasonic TC-L32X1.Now, some of the photo frames -- being specialized single-purpose devices -- offer more in regards to special effects, like fades or tiling between images.  The X1 has limited special effects, but it does offer a few good transitions and (more importantly) does a great job showing off your photos in a way that allows you to seem them from across the room -- not just from across the desk.To me this is a no-brainer.  At roughly $370 there are some 10-inch frames that are nearly as expensive, but none of those will do your pictures justice.  A few of them might display MP4 video files, but none of them offer the full-fledged media-centric flexibility that this unit offers.  Plug the X1 into any HD video source over HDMI, connect other Panasonic gear and create a system that turns off and switches settings at the touch of a single button.  And, you can also incorporate your iPod (it comes with an external iPod dock) to add both audio and video.More importantly, by using this method you have an energy-efficient free-standing display that's not tethered to a computer.  To take this concept to an even higher level, I plan to mount my AppleTV to the back of this unit using the H-Squared TV Tray, as this will give me a very sophisticated slideshow display with room for a massive photo gallery, audio for backgrounds, and the ability to interact with my iTunes library.I can't find anything negative about the X1 and this unit is very highly recommended!  I have enjoyed using it so far, and everyone who sees it asks me where they can buy one, as they all want to do the same with their photos...", "Date": "October 19, 2009"}, {"Title": "Needs additional audiooptions", "Author": "G. Nelson", "ReviewID": "R2U4XZXSYYAFSQ", "Overall": "4.0", "Content": "Nice looking picture. We bought this to sit next to our spa in back yard under a cover. There is no headphone jack or analog audio out option, and the internal speaker volume is insufficient for this application. We hook this to our DirecTV satellite rcvr via under-deck component and left/right audio cables. And we have added an OPPO DVD player. We now must look at adding a reciever to allow for additional speakers due to not enough volume from this unit. Overall, the unit is nice, has great picture, and lots of input options. Just not the right audio output options for us.", "Date": "October 13, 2009"}, {"Title": "It's okay...just okay...", "Author": "R. Gordon \"Tech Enthusiast\"", "ReviewID": "R3HFSQBAZYLUQX", "Overall": "3.0", "Content": "Photos from my iPod are not viewable on the TV.  Every other thing on the iPod is viewable, but not photos.  This is a crazy oversight.HDMI volume is very low.  Even when cranked up, it's about 50% of the volume from the cable signal.No VESA standard mounting options.  Panasonic is just being greedy here.The last gripe is a biggie: there is no analog audio out, only optical.  If you plan on adding speakers to your setup, keep this in mind.  Not even a headphone audio out.  Adding external audio will add significantly to the TCO (total cost of ownership) of this TV.Now the good stuff: iPhone is supported via the iPod dock.  You get the 'not-supported' nag on the iPhone when you plug it in, but, it's fully functional.As far as the TV specific features are concerned, it's great.  It's only when you go to expand the setup that you see its flaws.", "Date": "January 25, 2010"}, {"Title": "An Excellent Introduction to the World of HD", "Author": "Devvon Eubanks", "ReviewID": "R3DQI9QB7629GO", "Overall": "5.0", "Content": "So far, I have had the 26\" Panasonic Viera HDTV for about a week now, and I must say that it is nothing short of amazing.  I really love a lot of things about this TV, but of course, there are one or two minor issues that I have with it.Overview:For the longest time, I wanted an HDTV to replace a 5-year-old, 14.5\" Toshiba SDTV, especially since I used it primarily to play my PlayStation 3 via Component cables.  The picture was so small that I could barely see subtitles and other things happening on the screen, and the screen was cut-off at the sides for a few games and movies.  I then received a 26\" RCA HDTV w/ Digital Tuner & Internal DVD Player for Christmas from my father.  The TV was nice, but after reading a few reviews and seeing the TV in action w/ my PS3 games and DVDs, I found out that the TV was poor (contrast kept going in and out periodically) and RCA had sketchy customer service.  Also, while looking at reviews for the RCA, I came across the 26\" Viera HDTV on Amazon, which was rated #1 at the time.  Not only did it offer about 20x the contrast of the RCA, but it was $70 cheaper and seemed to be very reliable and perfect for my room.  So after a few days, my father returned the RCA and ordered the Viera from Amazon.  In a nutshell, this TV blows the RCA (and other small-scale HDTVs) out of the water.Pros:Firstly, the setup for this TV is super-easy.  I do agree with some other reviewers that a magnetic screwdriver greatly helps in screwing the stand in place, but it's not too bad even if you don't have one.  And once the TV detects your analog & digital channels upon start up, navigating through the channels and menus is a cinch.  I was able to set up my PS3 via HDMI with no problems at all.  Even the remote is nice and easy to use!Secondly, the screen is gorgeous.  I've seen a lot of HDTVs in-store, and the bigger displays occasionally have very pretty screens, but most of the smaller HDTVs that I've seen (like the 26\" ones) either look bad or they look just \"okay\" to me.  In my view, some of these TVs can suffer from ghosting (blurring of fast-moving action) and slight \"pixellation\" (image is not totally clear; looks like \"snow\").  I am happily proud to say that neither of these problems show up in this TV.  The image is very clear right from the start, especially when connected by HDMI.  All of my PS3 games almost look brand-new, with beautiful contrast, vivid color, and sharp textures, and DVDs don't look half bad either.  I currently have no Blu-Ray movies in my possession, but if they're anything like my PS3 games, I'd say that owners of this TV are in for a real treat.Finally, the viewing angle (especially in comparison to the 26\" RCA HDTV that I had) is pretty good.  The color of the TV hardly washes out at all, unless you're moving all the way to the side of the TV, but even then the screen's color still holds up well.  The RCA slightly changed in contrast even when I went from a sitting to a standing position.  The Viera?  Hardly at all.Cons (well, kind of):The only thing that I have to harp on about the TV (and it's not terrible, believe me) is the sound quality.  Now, for a bedroom or a small and quiet area in the house, the sound of this TV is more than enough.  But if you are expecting to get a lot of sound from this TV in a larger room, I'd consider either getting some external speakers or getting another HDTV.  For my PS3 games, the sound quality is great.  If I put the volume bar up to \"6,\" that is just right, if only somewhat loud.  Also, I have a Tritton AX180 analog stereo headset that I have tested on this TV, and the sound quality using these is even better.  However, the problem with the sound for me comes when playing DVDs.  Maybe it's just playing DVDs on my PS3 or something, but whenever I tried to play movies that had scenes where there was talking (even in the middle of action scenes), it seemed like the voices were a bit soft, but the action was loud.  I had to adjust the sound quite a bit to try and see if I could balance the audio between these two areas, and I was somewhat successful.  Just be prepared to make some possible adjustments to the audio if it isn't working out for you.Other Thoughts & Concerns:At the time of my order (December 31) the total price of this TV was $300 flat, which (considering the quality of this TV) was an amazing deal, not to mention that there were VERY few poor reviews of this product on a lot of websites.  Plus, when Amazon finally shipped this TV, it only took 2 DAYS to get to my home.  I have to thank both Panasonic and Amazon for not only offering me a great product, but for also sending it to me in a safe & expeditious manner.Also, I have not tested my Nintendo Wii, PC, nor any Blu-Ray movies on this TV to see about their quality yet.  However, I am certain that this TV will not disappoint based upon what I have experienced so far.  I also do not have an iPod, so I couldn't test the iPod dock that came with the TV.  I'm sure it's pretty nice, though.-----So, overall, if you want a nice budget HDTV with an excellent display, nice sound, and great features for a small to medium-sized room, look no further than the 26\" Panasonic Viera HDTV.  It isn't the best small-scale HDTV in the world, but at least for me, it comes very close.[5/5 Stars]", "Date": "January 11, 2010"}, {"Title": "Great as computer monitor / small room TV", "Author": "Gene Cloner", "ReviewID": "R1TGCFEG2CE6CK", "Overall": "5.0", "Content": "This is a very good entry level LCD TV for a smaller room or use as PC monitor. We got this to replace our old PC monitor and it also doubles as a TV for our Wii. The price (that I got) is comparable to store brand sets such as Dynex, but quality is as good as a Samsung/Sony.1. Setup: Note that a magnetic-tip philips screwdriver really helps to easily attach the base (takes ~5 min). Setting up this TV is very easy and most of it is done automatically.  When you turn it on, the menu guides you through setup of channels and inputs that you need to connect. The manual provides detailed information on how to connect different types of inputs (coaxial, composite, component, hdmi & PC).2. Connectivity: The set has an antenna input (to connect your cable, dish, VCR or antenna). It has two HDMI inputs (Do keep in mind that this is a 720p TV and not full HD. However, for a 26\" TV 720p would suffice and having 1080p does not noticeably increase picture quality). One component video input (Red,Green,Blue video + red & white audio), two composite video inputs (yellow video + red and white audio) and one PC input (VGA). NOTE: The audio for PC is shared with one of the composite video inputs. Unfortunately, no analog audio out (cannot connect normal / wireless headphone). It does have DIGITAL audio out that can feed in to an amplifier or receiver etc.3. Picture quality: The picture quality is good out of the box. There are many preset modes (standard which is medium bright, vivid which is ultra bright, cinema which is a bit dull, sports which is bright and game which seems to respond quicker). However, you can customize most of them and there is a separate slot for an additional 'custom' mode as well. I would rate the picture quality as comparable to many 720p sony/samsung sets which I saw in the store.The angle of view depends on how much backlight and brightness/contrast you set. If you set them too low, then the picture quality is good only if viewed straight. If you move to the sides there is significant fading. When backlight is set high, the picture looks good even from the side (~45-50 degrees).Setting as monitor is also easy. I had to adjust my output (video card) to 1280x768 and the TV is automatically set to that resolution. You can change this if you want.4. Audio quality: I was pleasantly surprised by the nice audio quality of this set. We have it setup in a relatively small room  (11x14). There was no buzz and it is clear. For the first time I heard quite a bit of minute background sounds (wind blowing, minute claps and shoe souds) when playing wii golf and wii tennis. The raquet sound was very clear and realistic. No complaints in this regard.5. Remote: The capabilities of the remote are awesome, but you have to go through a menu for most things. Unfortunately, the picture and sound settings for each input/each channel are not saved (except for 'game' mode. i.e. if you selected one of the hdmi inputs as 'game', then the TV switches to game mode whenever you chose that input). So it would help if you can smoothly switch from 'cinema' mode to 'sports' mode using a single button. You cant do that.6. Other features: There is an iPod dock and you can play your iPod songs and videos on the TV which is very nice. The TV automatically recognizes the iPod and switches to that mode. You can also charge the iPod using the dock. There is an on screen menu through which you can play songs/videos. However, you cannot play songs in the background and switch to 'PC' mode. I would have liked this feature.There is also a SD card viewer mode which can do a slideshow of pictures (jpg) and videos (mpg) on an SD card. This is also done automatically or through the touch of a single button on the remote.It has energy saving modes which reduce the display brightness a bit. When plugged in and not switched on it consumes 0.6W energy which is great for 'green' people.Overall, it is a great inexpensive TV with high picture and sound quality. Amazon's shipping was very quick and the box arrived in great shape through Fedex.", "Date": "December 31, 2009"}, {"Title": "Poor angle viewing", "Author": "StraightTalk", "ReviewID": "R2WE2EC94EKHEK", "Overall": "2.0", "Content": "I bought a 32\" 720P Samsung 2+ years ago because I didn't like the picture on the Panasonic lcds at the time. The Samsung was the best on CNET reviews for small size LCDs. For a second lcd, I bought this Panasonic TC-L26X1 for my son this Christmas and little has changed (added ipod dock). The picture is reasonable for the price and maybe comparable to lesser brands like Vizio but not a match to Sony or Samsung yet. My older Samsung lcd is still much better.The viewing angle on this is horrible. You might ask who watches TV from the side but this TV is only good straight up or at the most 30 degrees off center. The pictures turns cloudy > 30 degrees off center.Since it was on sale at Amazon, I took the plunge.Update:[...]HAPPY HOLIDAYS!!!", "Date": "December 9, 2009"}, {"Title": "I Really Enjoy this TV !!!!", "Author": "L. KAHL \"rnratchet63\"", "ReviewID": "R25KF08JYSTL5P", "Overall": "5.0", "Content": "I purchased this t.v. while it was advertised on the GOLD BOX DEAL and am very happy I did, because I got it at a STEAL! The first t.v. arrived sooner than I thought it would and I was so excited. I then unboxed the t.v. set in the bedroom and then the BIG MOMENT came and I turned it on and low and behold the screen looked smashed, my heart sank, I waited a couple of minutes hoping it was cold and needed to warm up, but the smashed screen look didn't go away. I immediately went to my computer and notified Amazon of the damage. Not only did AMAZON respond quickly by sending a new one out 1 day shipping at no cost to me, but picked up the damaged one at my house at no cost to me also. It took a little longer, but after watching the new set, that arrived in perfect condition it was well worth it. This is my first experience and I love it now I would love more and a big one for our living room, I am sold on this product and thanks AMAZON you made the exchange so easy for me. I am so relieved that there was no hassel in getting another one and then to get it so FASSSSSSSSSSSSSSSST!!!!!!!!!!! Thanks again AMAZON keep up the GREAT SERVICE!!!!!!!!!!", "Date": "January 12, 2010"}, {"Title": "Panasonic VIERA X1 26in HDTV", "Author": "E. West", "ReviewID": "R3HJU7BWQE2FRS", "Overall": "5.0", "Content": "Here is a TV that stands out even for a 26in set.  Easy to use remote and set up was a breeze.  As for the HD, it is one of the best advancements that has been put out and it is just as good on this 26in as it is on the 42in in the living room.", "Date": "December 18, 2009"}, {"Title": "Blind faith", "Author": "R Reynolds", "ReviewID": "R2GTB951E4IVV1", "Overall": "5.0", "Content": "Blind faith purchase. Walked through the stores, compared everything but not a 26\" Panasonic. For whatever reason the Panasonics were not on the shelves. Thought the Sony 26\" to be the best of what I compared with the reviews being mostly favorable. However, the reviews for the Panasonic were 5 stars across the board. Blind faith trust in the heavens and ordered it. Arrived on time with box slightly crunched here and there. However, interior packaging was excellent. No issues. Setup was simple. Instruction booklet straight forward. TV frame/stand looks good and appears sturdy. Plug in panel on back is understandable. Picture is great. Sound is OK. Sigh of relief, thank you heavens.Two months later and all is still good. I've re-compared the brands on the store shelves and I believe the Panasonic to be the best of the group. The picture quality is equal to that of the Sony. The little speakers in the Panasonic sound better than the little speakers of any other 26\" on the shelf. For general use, the little speakers are just fine with the receiver being utilized for 'real' sound.I'm not an electrical technician or anything of the sort. I can't discuss the fine tech details of why this is better than or less than any other 26\" TV. What I can say is I'm very satisified with this purchase. I feel a little lucky to buy without seeing first and ending up with what I would have bought had I seen it first. Strange.As of this time, from what I know, have seen and read, I would recommend this Panasonic 26\" and 5 stars are warranted.", "Date": "December 3, 2009"}, {"Title": "Excellent TV", "Author": "Big Guy", "ReviewID": "R2SV3G4OWD4RE0", "Overall": "5.0", "Content": "State of the art quality at a reasonable price. The HD picture is better than most TV in this price range.. The sound is acceptable, but not great. I added a matching Panasonic surround system. Now the sound is awesome. I am impressed.", "Date": "September 25, 2009"}, {"Title": "Great 26\" TV With the Best Price", "Author": "Suzuki Burgman Rider \"Hawkeye Fan\"", "ReviewID": "R2XCNY3VZ8ICC6", "Overall": "4.0", "Content": "I received this LCD TV yesterday after purchasing from Amazon at $299.99  The TV was delivered in a timely manner with Free Shipping. Packaging was excellent and setup proved to be quite easy.  We have this set connected to Dish Network on the secondary receiver which is not HD, so I really cannot comment on HD quality, but regular reception is quite good.  I do have a Panasonic VieraLink DVD recorder attached and the HDMI link worked just fine.  My DVD recorder upconverts to what is close to an HD quality picture.  I am very satisfied with the DVD playback.  I have seen some comments about how difficult it is to attach the included stand.  If you have available a Philips head magnetic screwdriver, this is not a problem at all.  The included manual is quite extensive and will answer any questions one might encounter with this product.  The warranty as stated in the manual is 12 months on parts and labor.  Overall, I am quite satisfied and highly recommend this product!", "Date": "January 27, 2010"}, {"Title": "Excellent TV", "Author": "John A. Russo", "ReviewID": "R2G91TZUZNQF4U", "Overall": "4.0", "Content": "Easy to set up.  Looks good.  Picture is excellent.  Bought for my daughter's dorm room.  She likes the iPod dock.", "Date": "September 16, 2009"}, {"Title": "Excellent TV", "Author": "Chas B \"Charlie\"", "ReviewID": "R1DPM7K9SHEP8A", "Overall": "5.0", "Content": "Excellent TV worked perfect right out of the box. The setup menu was easy to follow. I would buy another Panasonic.", "Date": "September 13, 2009"}, {"Title": "I have seen better", "Author": "pegger", "ReviewID": "RPCQOBBP3DGRW", "Overall": "3.0", "Content": "Well I bought this tv just after Christmas from Amazon.  To the extent that I paid an unusually good price, I can't complain.  Amazon was selling it for about $250.00 and I had received Amazon Gift Certificates for Christmas so I personally paid a lot less.I own a 40\" Sony Bravia, 1080p with an HD service.  So I know sort of what to expect in an LCD tv.  This one was meant as a secondary tv in our bedroom.Overall, don't get me wrong, the tv is fine.  It's a Panasonic and that usually is a good brand.  The biggest gripe that I have is using the timer feature.My wife likes to set the timer before going to sleep and this one takes about three clicks of a small button just to set the timer and then two clicks more to back out of the timer screen.  Plus, you only have choices of 30 / 60 / 90 minutes.  That may not be unusual, but I think my last tv had more incremental choices.I am a little frustrated by this tv.  I had not too long ago helped a family friend choose a Toshiba tv, same size, same 720i configuration, and that one was a charm.  I suppose I assumed that the Panasonic would be equally as nice and frankly, I don't think it is.  If it were not for the price I think I would go with either another Sony or Toshiba.", "Date": "January 27, 2010"}, {"Title": "OUTSTANDING !!!!!!", "Author": "Robert Hanrahan Jr. \"Invaders Fan\"", "ReviewID": "R16BQA3N7KRN7N", "Overall": "5.0", "Content": "The Panasonic TC-L26X1 LCD TV is outstanding. I ordered it Thursday and received it today (Saturday). The box was received in excellent condition and I had the TV set up in our bedroom in 10 minutes.  We had a 22\" Insignia tv that was purchased at Best Buy that was the worst in angle viewing the picture would almost black out at certain angles. I had to tilt it so that it could be viewed at a decent picture level. The Insignia TV would not accept the HDMI hookup from my Verizon Fios HD Cable Box, I could only use component cables.  Well this Panasonic was picture perfect upon turn on. It also accepted the HDMI cable hookup from my Verizon Fios Cable Box. The setup was simple from the remote and I love that I can connect my IPod to the IPod port that is supplied with the TV. This TV even allows you to view any videos or movies that you store on the IPod. Great work Panasonic on this exceptional TV. This TV was well worth the money that I spent. It seems that anytime aI purchase a Panasonic product that I am always pleased.  Amazon was the cheapest price and Fed Ex delivery was superb. Thanks Amazon and Thanks Panasonic ..... \"Just slightly ahead of their time\".", "Date": "November 28, 2009"}, {"Title": "Panasonic Viera TV's", "Author": "Hector D. Iglesias", "ReviewID": "R1ZLMERHLL1F9M", "Overall": "5.0", "Content": "I have 3 of them throughout the house and love them. Panasonic is what Sony used to be, excellent quality all around, and overall easy to use, friendly remote control (I refuse to buy anything Sony, but that is another story). You don't need to get used to it, it comes perfect for you.", "Date": "September 30, 2009"}, {"Title": "just what i wanted", "Author": "Sandra E. Chatelain", "ReviewID": "R5QNM8JRLEZZ0", "Overall": "5.0", "Content": "I always have my tv in a close-able cabinet.  This one fits well.  It's suitable size for the room.  The picture quality is excellent.  It is easy to install and use.  I did my \"homework\" before deciding on this one and expect many years of satisfactory use from it.  It is now hooked up with a Blue Ray player of another manufacturer (I would have gone with Panasonic there too, but they don't interface with Netflix).  Very satisfied with my purchases.", "Date": "September 29, 2009"}, {"Title": "couldn't be better and more pleased.", "Author": "Henry Pundyke", "ReviewID": "RVGBBMAMZS4P0", "Overall": "5.0", "Content": "I ordered and received this tv within a few days, the tv's discription could't have been more accurate.. My daughter and her friend put it together an had it up and \"running\" within a few minutes of opening the box, evrything was perfect.I have ordered a few things from amazon before and as usual their service was impecable. I deffinately would order from them again as every experiance has been a very pleasureable one, no complaints, not even a hint of one....", "Date": "September 27, 2009"}, {"Title": "One Heck of a buy!", "Author": "Hoosier Camper", "ReviewID": "R7HLFEWTOCO1W", "Overall": "5.0", "Content": "TV out of the box was close to perfect picture! Waited till HDNET had it's setup test pattern on and finished it up on that. Black is very good! Colors are excellent. Sharpness of picture is very good! One minor complaint is the picture dulls out if you are setting at the sides. Directly in front you cant beat the picture! OTA is the best HD but Dish network is very close behind. I think Panasonic did a great job on this one!", "Date": "September 26, 2009"}, {"Title": "Excellent value", "Author": "angfrommn", "ReviewID": "RR7ZMPY6VT2VH", "Overall": "5.0", "Content": "We have had this t.v. for a month now and I can say honestly that it is a great value for what you get. Excellent picture good sound great price. A+", "Date": "July 2, 2009"}, {"Title": "Sloppy packaging", "Author": "David J. Pines \"yrfrnd\"", "ReviewID": "R2ME56Q52BI9NZ", "Overall": "5.0", "Content": "This is a word of caution about how the item is packed in its box.  Somewhere between the seller and my front door, the box was damaged.  There was a large gash starting on the top flap and extending down the back of the box, with an additional hole in the upper corner of the box.Upon opening the top of the box (which the shipper or someone had slapped a careless piece of packing tape over the manufacturer's tape to make the box look good) it was obvious why the box tore and was slightly bowed from the impact it had received.  Only 2 pieces of foam at the corners protected the top of the set.  There were some 18 inches of unprotected TV (a 26\" model) exposed and vulnerable to any kind of blow.  I'm not sure whose fault this experience was: the shipper (UPS), the seller (doubtful they would let one with a damaged box leave the facility) or Panasonic, who clearly should be putting a full-width foam barrier across the top of their set.", "Date": "July 15, 2009"}, {"Title": "panasonic viera X1 26 in 720p lcd hd", "Author": "ed ferri \"ed f\"", "ReviewID": "R2W7QFFUMKEGH8", "Overall": "3.0", "Content": "It was very difficult to screw the monitor to the base without a magnetic tip screw drive.  Many will have trouble with this.Sound quality is awful on low, murmurred or whispered sounds.  May miss some of more important dialogue on many programs.", "Date": "April 18, 2010"}, {"Title": "Disappointed in the picture", "Author": "PerpetualMotion", "ReviewID": "R2ARFZ0UCRN04A", "Overall": "2.0", "Content": "I understand that LCD televisions don't always produce the best picture from angled viewing positions, but this particular unit requires being seated dead-on-straight-ahead of the screen to avoid loss of picture. In fact, if you're off to one side by a matter of a foot or so, the picture washes out badly...look at it from a couple of feet off the center line and more than 50% of the saturation fades away.I was also disappointed to find no audio out options on this unit...? No way to connect it to external speakers? Hmmm. Seems like quite an oversight.As someone who's enjoyed more Panasonic televisions than I can count over the past 15 years, it's a letdown to be writing such a less than stellar review now. Hopefully, my unit was a fluke, and not all perform as poorly as it did.", "Date": "February 15, 2010"}, {"Title": "Good price; Excellent quality", "Author": "R. Miller", "ReviewID": "R7339OO6BPV2M", "Overall": "5.0", "Content": "This Panasonic HDTV is an excellent buy with free shipping. The 26\" size is perfect for my apartment. I must turn it to face me at my desk or sofa; the base is soft on the bottom and does not scratch my furniture when moving it as my previous HDTV did. The picture is excellent; the sound is easily programmed between bass and treble. The black gloss cabinet can be instantly cleaned with a soft cloth. I highly recommend this item.", "Date": "February 7, 2010"}, {"Title": "Panasonic Viera 26inch LCD HDTV", "Author": "Charlene Edwards", "ReviewID": "RAAA4PE3APV7G", "Overall": "5.0", "Content": "Pleasantly surprised as to how nice a picture and sound on this television I must admit to being sceptical as it had such a reduced price, all the bells and whistles I want plus if I ever buy an I-Pod I am sure the I-Pod docking built in attachment will come in handy shame I cannot convert the I-Pod device to connect to my Sony Walkman,but thats life I guess. All in all I consider this television to be good value for the money.", "Date": "February 5, 2010"}, {"Title": "Great Price Good Size", "Author": "Abuela", "ReviewID": "R2SYR0STOIDBOQ", "Overall": "4.0", "Content": "I bought this for my Mom for her kitchen/dining room. She has it connected to digital cable, but not an HD box. The picture is not the greatest, but she only watches news in the morning and afternoon while cooking, etc. So it's OK. I didn't find problems with the viewing angle as one reviewer noted. We have it on the wall by the dining table and it seems fine no matter where you sit, including from the floor. I prefer 1080 for watching movies and HD programs, but this is fine as a secondary TV. I was lucky to get it when it was offered as a Gold Box deal for $259.99 and I think that for the price, it was a great deal indeed.", "Date": "February 2, 2010"}, {"Title": "What a GREAT deal!!!", "Author": "K. Lupo", "ReviewID": "R1V6SPJVE007YC", "Overall": "5.0", "Content": "We purchased this TV for my daughter for her birthday (actually 2 months early but I could not pass this one up)I set it up in her bedroom yesterday and when she came home she was very stoked. The ease of this TV for her is 5 stars. The picture quality is awesome and fits perfectly in her room. It also came with a docking station for her I POD Touch and that was an added bonus for her. The sound quality is very good and the price, well for $299 you can't go worng with this TV. If you are looking for a quality TV for a bedroom or for a child go with this Panasonic, it will be the best $299 you ever spent.And 5 Stars goes out to Amazon again, it took 2 days to arrive at my house and there was not a scratch on the box. I can see why Amazons profite were up for the year GREAT JOB!!!", "Date": "January 31, 2010"}, {"Title": "Great TV", "Author": "Samson's Mom", "ReviewID": "RZJV7J9EY5OGW", "Overall": "5.0", "Content": "Completely and utterly satisfied with all aspects of this product.  Terrific buy. Works wonderfully with my IPod touch 3rd generation. Able to use as monitor for my X-Box 360 as well as set up to record my play via my laptop, edit and upload to YouTube.  Built-in features to this television enables me to do everything I wanted to do with my electronics. Picture quality is great, no complaints!", "Date": "January 30, 2010"}, {"Title": "Super rather inexpensive smaller screen lcd", "Author": "Jack H", "ReviewID": "ROG3O4IY3CE0U", "Overall": "5.0", "Content": "This panasonic product was even better than anticipated after reading all the Amazon reviews.  It is the ideal lcd for the bedroom or other small room.  Don't let the 720p sway your decision to obtain one.  It's true that attaching the base can be rather challenging, but if you are prepared with a magnetized phillips head screwdriver, it becomes a no stress simple task.The ordering procedure and shipping by Amazon can't be any better.  My Panasonic, had to go to some previous sites before its final destination, but it arrived right on schedule and the carton was in excellent condition.  Once the base was on, I was viewing various channels and observing the excellent slide show feature using one of my SD cards, all within about 15 minutes.Amazon and Panasonic are highly commended by me.Jack H", "Date": "December 8, 2009"}, {"Title": "Great TV", "Author": "jean \"mnjninpa\"", "ReviewID": "R1UUYABOSY5RYA", "Overall": "5.0", "Content": "I ordered my 26 inch Panasonic TV to replace the 20yr old Panasonic that I have had in my bedroom for the past 15yrs. The old tv just wouldn't work with thesatellite service that we have. My new Panasonic is everything the old set was andmore. It has a lot of features on it that I probably won't even use but the qualityof the picture and the sound of the set is excellent. I did not add any external speakers. We set it up as soon as we got it and it has been playing for us ever since. I ordered the set on Friday and got it on Tuesday...which was another plus.I could not find a 26 inch Panasonic in our area and since that is what I reallywanted, I decided to order from Amazon as I have in the past with great results.This TV gets a 5 star rating from me...couldn't ask for better service from Amazon and the TV set is superb! Color, clarity is beautiful!", "Date": "August 28, 2009"}, {"Title": "Volume problems", "Author": "George O'Donohoe \"\"nite rider\"\"", "ReviewID": "RV5GY0HY4E5SY", "Overall": "3.0", "Content": "This TV had excelent color and picture. The sound was good if it was set at 80--Sometimes it would have to be set at 100! I sold it to a friend at a lost and I will never buy a TV over the internet again without checking the same one in a store live first. I do not think one should have to hook up a external sound device in order to hear the unit!", "Date": "December 18, 2010"}, {"Title": "Very Good Overall, but.......", "Author": "Leonard Kayye", "ReviewID": "R36OPCIDJ5A45P", "Overall": "4.0", "Content": "Overall this TV is very good.  When viewed straight on the picture quality is 5 stars but drops when viewed at an angle (common for LCD TVs), hence I gave the picture quality 4 stars.  As with most thin cabinet sets, the built in speakers provide so so sound quality.  There lies a very serious feature flaw.  The only audio output is optical.  It does not has a standard audio output and not even an earplug jack.  I have this TV in my kitchen and I don't have room for more sophisticated audio equipment; it was my intent to plug the audio into my Bose Wave as I had with my previous TV.  If this set had a traditional audio out or even an earplug jack, I would be able to make the connection to my Bose Wave.  But the Bose Wave does not have an optical input (sure, you can say that is also the fault of Bose, none the less, a TV should have more than one audio out option because there are many ppl would don't have audio equipment with optical audio in).  Otherwise this set is laden with features.  However, if I had known about the audio out flaw I would definitely selected a different set.  Good audio really enhances the viewing experience.  So, if you intend to connect your TV to an external audio system check to make sure it has an optical in.  If you don't intend to connect the set to a sound system or if your system has the optical in, you should be very happy with this set.", "Date": "March 26, 2010"}, {"Title": "Amazon delivers", "Author": "Gerald Feingold \"busy buyer\"", "ReviewID": "RPNGGU1IPX99V", "Overall": "5.0", "Content": "The Panasonic is exactly what I was looking for.  Picture quality, connected directly to cable, without an HD hookup, is very good.  Out of the box, the setup is relatively easy, although there are more settings that can be made for which I, at this time, have no use for (ie: controls for ipod). The memory card slots are very convenient, and the size of the set is a perfect fit for the armoir in our bedroom.  All in all this is a perfect set for a bedroom or a den.  Amazon delivered on time, as usual.", "Date": "March 23, 2010"}, {"Title": "So far I love it!!", "Author": "Vishal Persaud", "ReviewID": "R2DXOOQQ8AYSI8", "Overall": "4.0", "Content": "So I love this TV.I ordered it on March, 17th and I got a call from UPS the next day saying it would be delivered on March 18th. I was, to say the least, very happy.When I got home and saw the box, I thought that I bought a bigger TV than I had actually purchased...lol. The box was huge. And this is one of the things I didn't like. Yes, the TV has energy star on it and all, but it comes in one huge box, with lots of styrofoam and a smaller box, which actually has the tv. I'm sure there is a less environmentally harmful way to ship this TV.But I opened up the boxes took the TV out and now it was time to set the base up. And that is all you have to set up -- the base. There are 4 screws that you screw in (the box instruction were all that clear to me) and you're done. Well, even though its all the set-up you have to do, WOW!! did I find it hard. The holes for the screws are deep in these small openings and I had to drop the screw in the openings, hoping they would land in the screw holes. I eventually got three of them, but the fourth one refused to go in. If I had a screwdriver with a magnetic head, it would probably have been easier. But I didn't. Well, that 4th screw never went in. I gave up...lol. I brought it up to my room, hooked up my PS3 and it was great. The iPod dock is great. It works well with my iPod touch 3G. The sound it great. The picture is great. The remote works well. I bought an HDMI cable for my PS3 for $3.61 (or around that amount) to complete the package and everything works great.I have a small room, so the TV's size is perfect and I primarily bought the TV for gaming not for watching TV...lol. So far, I only have good things to say about this TV.For the price, I would recommend it to everyone looking for a good-sized, functional TV.I'm also leaving a link to the HDMI cable I bought, if anyone is interested: Hdmi High Definition Multimedia Interface 6 Foot Cable for Playstation 3 Ps3", "Date": "March 21, 2010"}, {"Title": "Great product for the price!", "Author": "Garret K. Kubo \"Budget-concious consumer\"", "ReviewID": "R2P62LA1XFEEZR", "Overall": "5.0", "Content": "I purchased this TV four weeks ago and have loved every minute of owning it.  It was easy to set up and is easy to use.  I have kids with Ipods and they love the dock that comes with the TV.  They use it to play their music and Youtube music videos (note: some Youtube videos will not play because of formatting issues).  I've also hooked up the TV to my computer using the HDMI cable and watched Netflix instant movies.Picture quality is very good.  I have two older HDTVs that are tube type televisions.  I didn't think that an LCD could match their picture quality, but this one does.  We watched the Winter Olympics on it and the ice just glistened and made you feel like you were watching events live.There are only two drawbacks I've experienced with this TV.  The first is that the guide on this TV is limited.  It only shows what is currently playing on each channel.  It would have been great if it at least showed you what was up next.  The second drawback is the viewing angle.  This TV is not viewable from an angle over 45 degrees and is best viewed head-on.For the price ($289), this was a great buy!Panasonic VIERA X1 Series TC-L26X1 26-Inch 720p LCD HDTV", "Date": "March 18, 2010"}, {"Title": "Good for the money", "Author": "Adrian Jimenez V \"AJ\"", "ReviewID": "R21R5AQ0PHH11X", "Overall": "4.0", "Content": "Really nice TV. I had some problems when I try to use the TV as a computer monitor. There's no way to fit the screen properly.", "Date": "March 17, 2010"}, {"Title": "It's the BEST TV I've Ever Seen", "Author": "Dale Garrett", "ReviewID": "R3RATNMFQVWE07", "Overall": "5.0", "Content": "You can't go wrong with this TV.  This TV is fantastic. Great picture and surprisingly good sound (considering the negative comments some reviewers made). I was looking for a 22\" TV for my office/den and I read all the reviews on Amazon and other web sites.  I visited several retailers to compare models but couln't find this one in a store. I have two Panasonic Plasma sets and felt confident in the brand so I ordered it.My cable company doesn't offer digital TV without premium channels and a cable box (which I have on both of my large screen plasma TVs), so I wasn't expecting a great picture on every channel when I hooked the TV up to basic cable.  What a surprise!  Every channel was crisp and clear, even better than what I get on the plasma TVs.I ran the initial setup and to my surprise the tuner picked up 45 digital channels in addition to the analog channels I was expecting.  I assumed the cable company had upgraded thier service, so I ran the setup again on my kitchen TV (19\" Sharp LCD), but it didn't detect the bonus channels I get with my panasonic. I'm ordering another 26\" Panasonic to replace the Sharp in my kitchen.This is the best value and quality you can find in a smaller screen TV!  Gotta LOVE IT!!!", "Date": "February 27, 2010"}, {"Title": "Good TV, but a pain to put together", "Author": "donny \"don130\"", "ReviewID": "RLL1RO55WNJR3", "Overall": "4.0", "Content": "The picture quality on this TV is great. The problem we had was that there are six screws that connect to  tv to the base. They are almost impossible to get on. The go down a two inch hole and it took thirty minutes to get them lined up and in. Not fun.The TV is also a lot thicker than other LCD tvs I have seen. Almost 30% thicker than a samsung of the same screen size.", "Date": "February 22, 2010"}, {"Title": "Good HDTV", "Author": "Dana F. Geiger \"ww2 student\"", "ReviewID": "R352AM7LEL3JWU", "Overall": "4.0", "Content": "I bought the Panasonic brand HDTV because when my Panasonic TZ5 digital camera failed under warranty, Panasonic service was first rate. They replaced my TZ5 in 10 days with what appears to be a brand new unit that works perfectly. That's outstanding warranty service. No hassles at all!This is my first HDTV. It was easy to set up, but I did need to read the manual to do so (which is to be expected for my 1st HDTV). The picture quality is fine and even more importantly my wife is happy with the TV.I did notice that I have to turn the sound volume on both the TV and the Cablebox to almost full on each of them to get adequate sound out of it. I can't get the TV to be very loud nomatter what, but it is adequate (but not more than adequate).I am entirely satisfied with the viewing angle. I often view from 45 degree off center, and have no problems at all.I noticed a small 'delay effect' in the picture where one portion of the screen is a fraction of a second delayed in updating the picture. It is sometimes noticeable but not a big deal.Also, I liked the color rendition on my old 19 inch Magnavox CRT better than the HDTV color, not just on this unit, but on all HDTV's that I have seen. HDTV color is just a bit less natural than the old CRT color. Also, the old CRT doesn't have the 'delay effect' mentioned above. But the HDTV has a very much sharper picture.The unit is very nice looking, with shiny black plastic and elegant shape. Overall I am happy with the unit and feel that I got a good deal at $300. I could have sprung for the 32 inch version for about $100 more, but thought that I would get my first HDTV experience as cheaply as possible. In retrospect, I think a 32 incher might have been a touch better, but the 26 inch is fine because we sit pretty close to the TV.", "Date": "February 21, 2010"}, {"Title": "Flat panel tv", "Author": "James E. Fluellen", "ReviewID": "R2ASSAANJOPCEU", "Overall": "3.0", "Content": "The Tv is good for the bedroom. The speakers could have a better quality sound. It's a very good product.", "Date": "February 18, 2010"}, {"Title": "This TV is great so far", "Author": "B Ry", "ReviewID": "R2SJ4KLRK14H38", "Overall": "4.0", "Content": "This TV is great so far. The black levels are a little weak,but you have to expect that with a 720. The set-up was more than a breeze! It looks good, my larger TV in the family room is slim, so this looks a little bulky. But it's the perfect size for my bedroom. It also picks up over the air HD which was very pleasantly surprising!Over all, I would recommend this product. If you really want a great picture, you will have to spend a bit more, but you definitely can't beat this TV for the price (I got it on sale through amazon).", "Date": "February 18, 2010"}, {"Title": "Great Picture, Easy setup and use; 3 day shipping, Thanks Amz & Panasonic!", "Author": "Speaker Guy", "ReviewID": "RY9N7M7G5XNDG", "Overall": "5.0", "Content": "This is a great little LCD flat screen TV for our den.  Fabulous price. $289.  Super picture on both analog TV (comcast cable) and HD, intermixed.  We are using it in a smallish den... approx 12 x 15, but sound quality and volume are more than adequate, and I have some hearing loss in 1k-4k range.  Color and picture were fabulous right out of the box.. I didn't even make any adjustments.It  does have a Toslink digital sound output connection if you have a newer receiver which accepts that output.  It is likely super cheap because it doesn't have a headphone jack, which would provide the dual benefit of analog outs and automatically cut off the tv speakers.  You can do all that with the menu and the digital output... Toslink... if you have a newer AV receiver.  It accepts an SD card for pictures, but haven't used that, nor the ipod dock.  Some reviewers have commented about the lack of a usb port for picture or mp3 viewing.  I noticed that a panasonic blu ray player accepted usb... I suspect you could pair that $118 blu ray/dvd upscaler to this tv... plug in usb pictures that way, but this is only a supposition.My one small beef was installing the base... not enough to drop a star.  Get yourself a pair of needle nose pliers and #2 medium sized phillips head screw driver if you do not have them,  before attempting the assembly.  You must lay the TV face down on a table (use a towel to protect it), then slide the base's steel attaching plate into the center of the bottom of the TV, and align the plate's 4 screw holes, slide each of the screws carefully down a 2 inch deep, 1/2 inch by 1/2 inch \"tunnel\" (using needle nose pliers) and then \"drop\" them into the holes, hoping they stand up.... stick the phillips head screwdriver down... catch the screw and screw it in.  Took about 10 minutes of fiddling instead of 30 seconds if it were better designed.  Again, not a star buster.I haven't used the TV with DVD, but am sure the picture would be impressive.Thanks Amazon and Panasonic for a stellar shopping experience.", "Date": "February 17, 2010"}, {"Title": "TV", "Author": "David G. Nelson", "ReviewID": "R2SVUM6X9A4MVL", "Overall": "5.0", "Content": "Have only had the TV for one night and watched the 2010 Winter Olympics in high def over an antenna feed.  Wow! Bright vibrant colors, deep blacks, fast response to fast moving objects. Basically the picture rocks and I haven't even hooked up my Blu Ray yet, I know that will be even more impressive.  Sound is really good too, then again I don't expect much from a TV, if I want good sound I hook up my surround stereo.  The Ipod dock is also a very well done feature.  Very easy set up, you will need a magnetic screwdriver to attach the base.  This may be the best value ($289) in electronics I have ever spent.  If anything changes, I'll update my post but off the bat I am impressed, as I usually am with Panasonic. Kudos on another great product.", "Date": "February 16, 2010"}, {"Title": "Great product!!!", "Author": "L. LaFranca", "ReviewID": "R3K1JQY9ZK3A5R", "Overall": "4.0", "Content": "You won't find this product any cheaper than here. For $289.99, it is a STEAL! I've had it for a week already and let me tell you how amazing this product is! It is easy to use, easy to configure. The picture and sound are great! My favorite feature about this TV is that they give you an ipod dock with it. This ipod dock can be used to play music, photos and.... *drum roll* MOVIES! Yup! You can convert your DVDs into .AVIs and easilly watch them on your ipod dock onto your TV! The quality is amazing and you won't be dissapointed.The only downside is that it takes about 5 seconds to turn on the TV after the button is pressed. But aside from that, GREAT product!Overall, 4.5/5 stars!", "Date": "February 13, 2010"}, {"Title": "Great TV for price", "Author": "D. Kehr", "ReviewID": "R1ZCTAUWSPFWXL", "Overall": "5.0", "Content": "I know that their are alot of expensive tv's out their for 720p but this one is the perfect size depending on what size is to your liking. The Ipod dock is a perfect feature for music lovers like me, it supports itouch 1st and 2nd gen, nano 1st gen through 3rd gen, the classic, ipod 5th gen video 60gm 80g, and 30g. It also charges your ipod while playing music or just using the tv. The price was pefect for this size tv because I saw much more expensive ones for the same size etc... It's very easy to set up, took me about 10min, the stand was easy to you just need a philips screw driver and includes four screws for assembly. It also has an SD slot for photo viewing on the left side of tv. For $289 and change this is a great tv with all of the features you want and more. I have seen other 26'' tvs for more but without ipod dock.The only thing I wish it had was a video out port other than that this is the best tv for the price. And I would buy this tv again if I neen another one and I would recomend this tv for all music lovers or just anyone looking for a great hdtv without emptying out your wallet.", "Date": "February 11, 2010"}, {"Title": "Great value. Love the iPod connectivity.", "Author": "M. Pessoa", "ReviewID": "R9HRBSDWMHO4T", "Overall": "5.0", "Content": "I purchased this as a bedroom TV to replace a smaller Toshiba model. This TV is on the big side for a bedroom model, but it has great features. The iPod connectivity works as advertised. I primarily use this feature to play back audio and video podcasts. The video doesn't come through in HD quality, but it's more than acceptable if you're catching up on a TV series, or following someone's video blog.I currently have this TV hooked up to Cablevision via a TiVo Series 3 HD DVR. The picture quality varies from channel to channel, but that's not the fault of the TV, it's the way HD is implemented on different networks. I've noticed that SyFy channel often looks grainy, but ESPN and NBC usually look very crisp.", "Date": "February 10, 2010"}, {"Title": "WOW!", "Author": "David M. Greenberg \"Order Critic\"", "ReviewID": "R2JAQPTEZ7SYHJ", "Overall": "5.0", "Content": "The title pretty much says it all this T.V. is great. i bought it when i moved into my new bedroom, leaving behind a 19\" insignia lcd tv. It's a huge change, first of all id like to say amazon did a great job with this, shipping was cheap (standard shipping costs the same as supersaver for this one guys FYI) and it took 2 days to get it to me when orginially the estimate was 3-5. i didnt realize 26\" was tht big reall i thought it was gunna be slightly bigger than my old tv but not at all i honestly think you arent able to tell whether this tv is a 26\" or a 32\". setup was easy the stand literally took 5 minutes to put on no big deal. i dont know how some people are saying the viewing angle is poor like i can sit under the tv without color change like my insignia had, game mode is intense, sound quality is good well (it gets pretty loud past the 45 decimal), picture qaulity is great, you can tell panasonic did awesome things with this baby. the 2 hdmi plugs are amazing if you play games and have a hd cable box. also the ipod connector is sick, the first night i had got it i wasnt getting my cable until the following morning i simply plugged my ipod touch in (works with almost all ipod models for music and ones that support video) watched hangover on the tv it looked great. once cable was installed i was in awe the picture is so good i think hd is a must have with this tv thats how much i think u lose with out it. and for this price i really think i should buy another one for my living room possibly the 32\" of the same version but that one must look HUGE, lol. any ways  i give this 5 stars, two thumbs up, etc. good job amazon for the price(in total $315 and accommodations of everything) and also thank you panasonic for making this tv so wonderful. this is definitely a best buy if your in the market for a TV.", "Date": "February 10, 2010"}, {"Title": "Great TV, my second flat panel, much happier with pansonic then previous", "Author": "Joseph \"Joe\"", "ReviewID": "R3EUC6HXWF8PBD", "Overall": "5.0", "Content": "Great TV even from angles, previous flat panel returned because couldn't see picture when darker colors.  Very happy with pansonic.  Use to install TVs for Best Buy and pansonic was always my favorite.", "Date": "February 10, 2010"}, {"Title": "Awesome TV, great price.", "Author": "N. Peelman", "ReviewID": "R1GDM7N3I9J27X", "Overall": "5.0", "Content": "I bought this set to use as a bedroom TV.  The size was right, it had all the inputs I would ever need, and it was priced just right.I also own a Samsung LN32B550, which is a 32\" 1080p set.  The display quality on both is excellent for their respective resolutions, but the firmware/software on the Panasonic is far superior.  The Panasonic quickly changes inputs and channels, the Samsung is so sluggish its painful.  That goes for the menu system as well on both sets.  The Panasonic is snappy and responsive, the Samsung is often slow and frustrating.Menus seem to stay up for just the right amount of time on the Panasonic before they disappear automatically.  There are some menus (like the Inputs menu) that never seem to go away on the Samsung until you dismiss the manually.  One of my biggest peeves with the Samsung is that you can't use an automate-able remote (like a logitech Harmony, etc) because you can't simply hit \"Source\" then a 1,2,3,4 to select the corresponding input.  You have to scroll through the inputs individually.  On the Panasonic, not only can you jump from input to input by its number, but you can disable any and all unused inputs.  On the Samsung you can't disable unused inputs manually, it will disable some automatically, but many of the analog inputs (including the OTA/Cable input) are permanently there.  And it will automatically disable inputs when the device is off.  So no switching to an input first, then powering a device on, it simply can't be done.In addition to a sleep timer, you can also set 6 programable timers; yes, you can use this TV as an alarm clock, and define what source/channel it powers on to.  I just wish you could set an ascending volume as well...I was skeptical about the usefulness of the iPod Dock, but Panasonic does a killer job of making it easy to use and useful.  I haven't tried out the slide show viewer when using an SD Card from a camera, but I am positive that it will do a similar, excellent job.It boils down to, I love my Samsung's picture quality.  I play a lot of xbox games on it and it looks simply stunning.  This Panasonic (and every other panasonic i've seen) can give it a run for its money in the image quality department, and you get a vastly superior interface.Bottom line, if you're looking for a small, cheap, useful set to put in a bedroom or a kid's room, or even the kitchen for that matter, this thing should be your choice.  My next living room TV will probably be a Panasonic plasma.", "Date": "February 9, 2010"}, {"Title": "Fine tv", "Author": "Trupright", "ReviewID": "RTLADRE2SD64U", "Overall": "5.0", "Content": "Lovely picture.  Easy set up.  I only wish it had a headphone jack.", "Date": "February 5, 2010"}, {"Title": "Good price as an Amazon.com Gold-box deal", "Author": "Amazon Customer \"tbb\"", "ReviewID": "RCEP11WK05UEL", "Overall": "4.0", "Content": "Had been thinking it was getting time to transition from my old television set to digital LCD.Since this was my first experience and exposure to one of these, I will not calim to be an authority on too many details. This came up on the Gold-box deals at a price which beat pretty much everything else I'd seen available, and one I was willing to invest in for my first 'go'.The picture quality truly is quite the improvement over non-digital/LCD, and well worth it. Sometimes I sort of shake my head in a double-take because the definition or quality is so ....real. You know, kind of like coming into sudden tight, clean focus over the Grand Canyon at the perfect time of day, or, maybe, (contrasting this to my old tv) the sun suddenly bursting through the clouds after a totally over-cast day, and bringing everything to 'light'.I like the iPod feature because I purchase a number of movies through iTunes an sometimes would like to enjoy them on a larger screen.The only negative I have on this is that it seems to have a lag-time of coming on after you power it up. The wait-time reminds me of our old tvs of the 1960s. But I can live with it. The rest of the advantages are well worth the wait.  I am very happy with this purchase.", "Date": "February 5, 2010"}, {"Title": "Great replacement TV", "Author": "M. Spears", "ReviewID": "R1X256X4AJPM8Y", "Overall": "5.0", "Content": "I bought this last month to replace my ancient 24\" CRT. This was the largest size that would fit in the available space for it, or I would have went with the 32\" at least. The picture quality and color are a very nice upgrade from my CRT. The sound when first setup was terribly low and I was quite disappointed. After a couple of days, I finally thought to look for, and find the settings for digital audio on my cable box and in the TV setup. Once I had adjusted those, it was like turning the power on the speakers. The audio is now very good, and as loud as I could want it. I paid $359 for mine, having missed the late December 1-day sale and too soon for Feb's new low price. I'm very happy with my purchase, and would buy it again, if I needed another TV.", "Date": "February 3, 2010"}, {"Title": "Tv works fine and looks good", "Author": "John Quartermain", "ReviewID": "R2UDY8F1ZNZ2CX", "Overall": "5.0", "Content": "We have owned this tv approximately a month and it is easy to use and has good picture quality. It is a very stylish tv and has plenty of inputs.After using this tv for a few years I am very impressed with the picture quality and trouble free operation of this set. I have since purchased two more Panasonic plasma tv's from Amazon.", "Date": "February 2, 2010"}, {"Title": "Great Product for Great Price", "Author": "Delilah", "ReviewID": "RSIRZSYOJGKFV", "Overall": "5.0", "Content": "What a deal - got this TV for only 259 at Amazon during their Holiday Sale and I love it. Best thing about it is that it can connect to your ipod.", "Date": "January 27, 2010"}, {"Title": "Best lightning deal I've bought", "Author": "mindfulmentat", "ReviewID": "R2E8LYABK1VG5F", "Overall": "5.0", "Content": "Panasonic is already renowned for their HDTVs, so when I saw this little beauty pop up on a lightning deal for $250 I had to grab it.  The screen size is a perfect fit for my small living room, the sound (unlike other HDTVs I've heard) is crystal clear no matter where I am, and the picture is very vivid.  There are several presets for the picture, though all are practically useless compared to \"Vivid\".  You can tweak any of the settings but I personally found that one the best.  They also have a \"game\" setting, which I was excited for as I own a PS3, but it too pales in comparison to vivid.  There's a handy iPod dock which I haven't used yet but am looking forward to.The only problem I can see is that for some reason when the TV projects a picture/screen with a lot of black it looks slightly grayish, but when it's a pure black screen the blacks look deep.  I don't know if that's the TV or my cords, and honestly I don't find it that bad.For the price, it couldn't be beat!", "Date": "January 27, 2010"}, {"Title": "It's a TV, it shows moving pictures", "Author": "Eran Belinsky", "ReviewID": "R1D938HUK4OXME", "Overall": "5.0", "Content": "We bought it to show movies from our laptops, so the picture quality depends anyway on the output of our laptops, and we use external speakers. All in all we're pleased with it - easy to operate, fair picture quality, simple instructions.", "Date": "January 26, 2010"}, {"Title": "Killer TV for the Price.", "Author": "Rockdoc \"Rockdoc\"", "ReviewID": "R21WAMMNC795JF", "Overall": "5.0", "Content": "This is a great TV for the money.  I'm using it wall-mounted in the master bedroom and it is the perfect size.  Setup was minimal and picture quality is fine.  The viewing angle is not a problem and the set's sound is good straight out of the box.  It was well packaged when shipped and arrived in two days.  I looked around before I purchased this TV and nothing I saw was comparable.", "Date": "January 17, 2010"}, {"Title": "Great TV  OK remote", "Author": "Dennis Minnick", "ReviewID": "R13VNZPWRJIU9O", "Overall": "4.0", "Content": "As a video professional I'm a pretty choosy buyer.  This set is great.  I'm completely pleased with the picture...nearly like my high end monitors.  The sound is OK for spoken word, but lack if you are listening to music, or a movie with hot sound.  the remote is poorly designed with all buttons feeling about the same.  You  need to turn the lights on to find things.  Some of the buttons could have been round to help find them in the dark.  Things like the sleep timer are a bit buried and could have been on a single button.  Panasonic has taken up a lot of real estate with \"VIERA\" buttons tha you will never use unless you have Panasonic DVD players etc.  All in all... great Picture, other things a bit lacking, but I like mine", "Date": "January 15, 2010"}, {"Title": "iPhone compatibility for videos?", "Author": "Resident Skeptic", "ReviewID": "R1IKYJF72DL00W", "Overall": "4.0", "Content": "Excellent product, but I am currently stymied by:(a) can't seem to play YouTube onto the TV from an iPhone(b) stored videos are not recognized by the TV as videosIt is true that the box does not say \"iPhone compatible\", but I had hoped ..Panasonic - are you listening?Other than this, the TV is the correct choice for a bedroom TV and I really can't complain.", "Date": "January 13, 2010"}, {"Title": "Tremendous value!", "Author": "Ron \"CFO\"", "ReviewID": "R2D4207UUHFIQ2", "Overall": "5.0", "Content": "I researched many 26\" boxes and found this to be of best value - great quality for a great price.  I have never had a bad experience with Panasonic.  Great experience.", "Date": "January 11, 2010"}, {"Title": "Wonderful TV!", "Author": "Patrick Payne \"Writer, History buff\"", "ReviewID": "RGM0KXIWN28VB", "Overall": "5.0", "Content": "I'd received a Blu-Ray player as a Christmas gift this year, which left me scrambling to replace my old, '90s vintage Daiwoo CRT -- a TV so ancient, it still had only the coax antenna mount as the sole connector on the set... -- and actually join the 21st Century with a flat-screen HDTV.After doing research, I picked the Panasonic. I could not have made a better choice. The price was excellent -- I shan't mention it, as I don't want to get Amazon in trouble, but it is an amazing price for the TV. After only three days (EVEN with the alleged \"slow-boat-to-China\" free Super-Saver shipping -- I wasn't expecting to be using the new TV till after New Years -- , the first in a long list of pleasant surprises with this set) the TV arrived. It came moderately well-packaged (though I wish that the FedEx people had had someone sign for the package, or at least rang the doorbell, as the TV sat just outside of a rainfall for a short spell), and setup was a breeze.As a hint for setting the TV on the pedestal -- if you have stamp tongs (essentially thin, flat, paddle-bladed tweezers) they work great for manuvering the bolts into the mounting holes.All told, from removal from the box to plugging in the set, setting up the TV took 10 minutes. Add a minute or two more to hook up my DVD and Blu-Ray players, and I was all set!I first tested the picture with an old favorite of mine, the Japanese movie \"Macross: Do You Remember Love?\" using a Sony DVD player rigged for all-region play. The disk was a HD-print, meant for high-end TVs like this. The picture was astounding. The colors were brilliant and vibrant, and the sound was crisp and clear. The picture was so sharp that I actually could see the pronounced film grain (The film WAS made in 1984, after all...) and even some reflections from the animation cels during the darker-colored sequences, things that did not show up on my old Standard-def tube.I then popped in the new Star Trek on my Blu-Ray player. Again, I was astounded. The picture was fairly sharp (though it will improve dramatically, I'm sure, once my HDMI cables arrive) with vibrant color and no fuzziness and artifacting (except, oddly, the blu-ray's timer bar when on pause was somewhat indistinct, but that was no big deal) and again the sound was killer. No pops, hisses, dropouts, just crystal clear and strong sound.The accessories you get also show Panasonic's level of care. Along with the usual items (remote, batteries, manual) they also included an iPod dock. The picture quality on iPod videos suffers a bit on the TV screen when compared to the DVD and blu-Ray picture, but it is the nature of the beast, given that those videos were originally engineered to be played on the iPod as opposed to a full-screen TV. You also get a cleaning cloth to use in wiping down the screen.Really, if you're looking for a good entry-level mid-sized HDTV, the Panasonic Viera is the way to go.", "Date": "December 31, 2009"}, {"Title": "Great PC monitor", "Author": "CGScammell", "ReviewID": "R1UTNYULB8GMDL", "Overall": "5.0", "Content": "Edit 21 May 2010:  The top of the screen is now showing black streaks.  These streaks all along the upper screen and are an inch long.  It's very obvious when there's a white background.  What is causing this?_____We don't have cable or SatTV (yet).  Instead, this beautiful little TV is hooked up to our computer/entertainment system with additional speakers for surround sound. Set-up was minimal and easy.  (A long-handled Phillips screwdriver is a must!)  I couldn't be any happier.Luckily the manual that comes with this detailed instructions on how to hook up this beauty to the PC.  However, on this 26\" screen you only get a 22\" viewing surface via the PC, and I had to manually adjust the angle via the \"Menu/Picture\" format.  There are two inches of black edges on the left and right sides of the computer screen.The remote control for this TV is a must, as we have to do all the DVD/PC operations via the remote control.  Full screen view returns when we switch to DVD viewing.My one complaint, if there is one, is that sound on this TV is mediocre at best.  But since our TV is hooked up to auxiliary speakers, this is a non-topic.  The additional speakers augment the full stereo experience of this system.", "Date": "December 31, 2009"}, {"Title": "Panasonic Viera 26", "Author": "Spanster \"Language lover\"", "ReviewID": "R2FLFP3OZQUZ4D", "Overall": "5.0", "Content": "I just got mine at 2:30 and I've been watching it now for a bit.  It's wonderful! I read all the reviews and my only concern was attaching the stand.  That did prove problematic, but, I used the tiniest bit of chewing gum on the end of the screw to create a bond between the screw and the screwdriver. (Gum must be chewed first:)) It worked well.  You could also use art gum or the tacky stuff that teachers always use to hang posters in classrooms.Ordered on the 26th and delivered on the 29th by FedEX; packaged well.  Ladies, you can manage this by yourself.  It's very lightweight even while in the box, and the instructions are easy to follow.I don't know lots about TVs but I know what I like. I feel like I've come into the 21st century!  Well, except for the rotary dial phone...", "Date": "December 29, 2009"}, {"Title": "Great Value for Top Brand!", "Author": "Ram Fan", "ReviewID": "RQIIBOCG5LX4I", "Overall": "5.0", "Content": "This LCD is perfect for a modest-sized bedroom.  The picture is what you expect from a Panasonic, but the kicker is the IPOD integration with a very useful interface (lets you listen to songs and watch MPEG4 videos on your IPOD on a full screen), and a SD slot for photos to boot.  Accessing the songs/videos on your IPOD is very easy since there is essentially a dedicated button for it on the remote (which is anything but flimsy).  Having 3 HDMI inputs is almost overkill but I guess you can never have too many.  I was lucky enough to get this for $260 but even at $300, it is a great value.  The sound is more than adequate, especially for a bedroom-sized area, and the overall look of the TV is fine.  Now, if I can only find an indoor antenna that picks up all my local stations...", "Date": "December 29, 2009"}, {"Title": "hd lcd tv", "Author": "George E. Groninger", "ReviewID": "R218AQ3EW3IZ6O", "Overall": "5.0", "Content": "This tv has a great picture and good sound. I received it in perfect condition and had no difficulty with hookup. The quality of my viewing experience has jumped up considerably with hd service as compared to my other flat panel tvs.", "Date": "December 16, 2009"}, {"Title": "Excellent TV", "Author": "KMM", "ReviewID": "R27CZA53FDIPAS", "Overall": "5.0", "Content": "The price was certainly right.  Panasonic is noted for its quality and this one is no exception.  Very nice picture and I love that it seems like a large screen, but fits nicely on a smaller table we use.I feel it is user-friendly in every way.  Quite easy to operate and navigate.Side view is the only lower-than-average score it gets from me, but that is the nature of LCD TV's anyway.", "Date": "November 13, 2009"}, {"Title": "Amazing Picture", "Author": "Sarah", "ReviewID": "R31W2YIGHDPAK6", "Overall": "5.0", "Content": "I love this TV so much I may buy a second for another room.  It has amazing HD picture, so much so that you feel like you can reach in and touch what is on screen.  The colors are beautiful and the iPod functionality is great!I agree that the sleep timer could be easier and I wish the buttons on the remote were backlit but I will get over it for the great picture.", "Date": "October 22, 2009"}, {"Title": "Good Quality", "Author": "Dad at home", "ReviewID": "R5NC04H02A5PZ", "Overall": "5.0", "Content": "2nd panasonic i have bought, both good quality. easy to set up, great looking screen and  a good price.", "Date": "October 20, 2009"}, {"Title": "Surprised and happy", "Author": "William A. Heisley", "ReviewID": "R2R03I1AZQWO8N", "Overall": "5.0", "Content": "I was delighted to find that, when I took delivery of my TV, set-up was simple, the picture is perfect, the sound is excellent AND the manufacturer threw in a free iPod dock that I didn't anticipate.  I like this TV so much that I haven't turned on my large Sony since it arrived.", "Date": "September 6, 2009"}, {"Title": "no headphone jack (Analog Audio Output)", "Author": "Customer \"Consumer\"", "ReviewID": "R36K850U5V27IW", "Overall": "4.0", "Content": "Overall a nice TV in its price range, we paid 260 the day after Christmas. We returned the same TV earlier, which we paid 300 because we decided to get Sony but saw attractive price so bought it again. Anyway, it has all those qualities mentioned by other reviewers. Just wanted to add about analog audio output. Amazon described \"Analog Audio Output: Yes\" under Product Features and Technical Details but it is not true. There is no analog audio output, it has only one audio output and which is digital. You will need adapter like this Digital Audio To Analog Audio Converter and y-cable like this 2 x RCA Male / 1 x 3.5mm Stereo Female, Y-Cable, 6 inch. Adapter comes with toslink (optical cable) so you don't need to buy one. I checked brand name TVs from manufacturers websites and all come with digital audio output. This feature will not matter for most people but a big matter for us who live in small apartment and wanted TV in every room and wanted to watch in high volume, especially at nights. I hope Amazon will fix its error.PS: DirectTV remote-control code for this TV is 10650.PS2: This TV is assembled in Mexico (in case you don't like made in China).PS3: I was thinking of these TVs Sylvania LC321SSX 32-Inch HD Flat Panel LCD TV and Panasonic VIERA S1 Series TC-L32S1 32-Inch 1080p LCD HDTV, which have headphone jack but both won't fit in the place we wanted to put a new TV.", "Date": "December 29, 2009"}, {"Title": "Awesome Picture", "Author": "Richard A.", "ReviewID": "R26OZEPOOJL10U", "Overall": "5.0", "Content": "Do not hesitate to buy this Panasonic. The picture is great and the set-up was easy. My 17yr old daughter and I had it set up in less than 30 mins.The picture is comparable to my Sony Bravia in the living room (HDMI)and it's currently hooked-up via S-video. Imagine if it was via composite or HDMI. I have always had good luck with Panasonic products and its NOT made in China!As for the stand, just lay it flat as recommended. My daughter had no problem attaching it. I agree, a magnatized screwdriver would make it easier but not necessary.", "Date": "December 25, 2009"}, {"Title": "Exceeded all our expectations", "Author": "G. Robinson", "ReviewID": "R24P28ZIPIXL4Y", "Overall": "5.0", "Content": "We have owned a Panasonic 42\" plasma system for a couple of years, & when i purchased that one, the pix quality on the LCD's simply did not compare very well.  So, I had some serious concerns if the 26\" LCD unit would be satisfactory.  It did not disappoint in any way, as the pix and sound quality was immediately superior to what I had seen before....there have been some serious improvements in the technology in a short time, it seems.This replaced a CRT-based 19\" Toshiba unit that we had used in our bedroom for over 6 years.  This is slightly wider, but still fit well in the room.  the remote operations were almost identical to our larger system, and easy to understand.  The digital tuner works extremely well, & the automated search even went faster than our larger system does.  Picture quality is superb...cant' say enough about just how pleased we are overall with our purchase.Ordered it from Amazon on Tuesday, and it arrived via FedEx (an overworked driver during the holidays, to be sure) on Thursday afternoon, late.  No problems with packing or shipping, and no damage to the container, either.  Panasonic always packs their equipment very well.We are considering buying another as a family Christmas present for our youngest daughter and family.....In closing, I'd certainly recommend this unit for the right room application.  Smaller screen size works well in a den or bedroom.", "Date": "December 6, 2009"}, {"Title": "Had for almost two months...", "Author": "Thomas B.", "ReviewID": "R22EH902QRJML3", "Overall": "5.0", "Content": "Bought this for our bedroom and we've enjoyed it since May.  The spouse really likes the included iPod docking station, to fall asleep to movies we've got on our iPod Classic.  The picture quality is great for a TV this size.", "Date": "July 7, 2009"}, {"Title": "Optimal picture setings", "Author": "P. Johnson", "ReviewID": "R1BLDE3NSUZYCP", "Overall": "4.0", "Content": "I received this TV today. No shipping problems and the set worked OK out of the box.I have AT&T; U-verse TV and am trying to get optimal settings in the picture menu.Someone with more savvy than me has probably figured out the best setting for Picture Mode, Contrast, Color and Sharpness.Now the picture is OK but not as good as I had hoped.Anyone?", "Date": "August 21, 2009"}, {"Title": "Four Plus ****", "Author": "M. Martin", "ReviewID": "R2F2KD3HXESP0N", "Overall": "4.0", "Content": "This is a great little television.  It was very well packaged and very easy to set up.  I would probably really rate this TV 4 and 1/2 stars if I could, because although the picture is quite good it is not perfect.  We have another 26\" 720p TV (Sharp) and I would rate that one slightly better.  You need to tweak the settings a bit on the Panasonic in order to reduce fading when viewed from the side, although the picture is very good when viewing straight on or at a slight angle.  My 26\" Sharp is slighly better for side viewing.  The picture from my Panasonic Blu-ray on the Panasonic TV is excellent.  I love the Ipod adaptor - it works great.  Sound is adequate from the TV - loudness is fine and sound is totally acceptable.  Since, I am running this TV through separate speakers I was not concerned about the TV speakers.This TV sits in a cabinet and just fits, so the controls on the side are useless for me.  I only use the remote - which is pretty straightforward and works fine.A prior reviewer had a cautionary note about 26\" 720p TVs and I am not sure why.  As noted both this TV and my 26\" Sharp are great. 720p is more than adequate for a 26\" TV.  I also have a 4 year old 30\" 720p Sharp that has an excellent picture and a 1080p 46\" Mitsubishi.  You definitely need to go to 1080p for a larger screen size, but not for a 26\".  This prior review also noted, \"I found the image highly variable from station to station, and the format didn't adapt to the signal as on other sets.\"  I am not sure what this comment means, but my Panasonic has a consistent image and does automatically adapt to signal changes as output through my Comcast box.You cannot go wrong with this TV for the price.  Amazon service was, as usual, fabulous.", "Date": "January 21, 2010"}, {"Title": "Has been a fine TV", "Author": "C. Bailey", "ReviewID": "R1TNDPVYIZWT40", "Overall": "5.0", "Content": "This TV was purchased for a friend and he loves it.  No complaints.  Panasonic makes good TVs. I have 2 Panasonic Viera 42-inch TVs as well and we've been completely happy with them.  Consumer Reports has continually given Vieras great reviews and considers it one of their \"best buys\" for price and performance.", "Date": "August 5, 2013"}, {"Title": "Should have gotten bigger...", "Author": "Sma57", "ReviewID": "R208ZB2T4G58WZ", "Overall": "3.0", "Content": "And the sound system is very poor. Also not enough ports for all the things my husband wanted to use the tv for. Next time I will research more. It was an excellent price at the time though.", "Date": "February 1, 2013"}, {"Title": "Great picture!", "Author": "Kurt E. Saberg \"Truthseeker\"", "ReviewID": "R7CDU1IKU8I9P", "Overall": "5.0", "Content": "I bought this TV for my kitchen as it is nice to catch shows while cooking.  It has been 3 years since my purchase and I am still very satisfied with the purchase.  The TV has been great and I have no complaints.", "Date": "January 1, 2013"}, {"Title": "nice tv", "Author": "Sonya153", "ReviewID": "R35S93OXJ9P3P3", "Overall": "4.0", "Content": "It fits on my dresser...good size TV for someone like me who does not need to feel like actors are in my living room!Never had a problem with it.", "Date": "December 11, 2012"}, {"Title": "used it for over 3 years now", "Author": "Joshua", "ReviewID": "R3EISXBS6UJXD2", "Overall": "4.0", "Content": "years down the line and its still working well. comes with everything you need and has some interesting features only pigger tv's usually have.", "Date": "November 25, 2012"}, {"Title": "Loved it then didn't love it; dead after 2 years", "Author": "Blaze", "ReviewID": "R1J2Z9QF5B9A86", "Overall": "2.0", "Content": "This TV stopped working at 30 months.When it was new, we thought it was great: nice picture, lots of (gimmicky) features, built solidly and the cabinet looks good.Then we started noticing the flaws: really weak tuner even with an antenna booster, very bad sound (weak and thin), digital output PCM is auto-switching with no manual option, so only DVDs and Roku work with my soundbar, not broadcast TV. Sleep timer never worked (it showed in the menu, but was greyed out). Does not work as well with other Viera Cast components as you would suspect.One night it suddenly would display for only a few seconds (no sound) and would not respond to the remote or the side buttons. Internet research suggests a dead main board which could be replaced except that it is not available at any of the usual sites for TV components (dicounttvparts, shopjimmy, sears, partselect).I've bought lots of Panasonic electronics over the years, but I won't be buying any more of their TV products.", "Date": "August 4, 2012"}, {"Title": "Pretty Rad TV", "Author": "HxC-All-Day", "ReviewID": "R38Q3BGHYVANLF", "Overall": "5.0", "Content": "For The Price Can't Do Much Better.. Plenty Of Inputs, Good Resloution, And Decent Sound Quaility.This Tv Shines As Far As The Extra's Are Concerned:IPod Dock, Vga Input, And A SD Card Reader Just To Name A Few.I Highly Recomend Great TV For The Price.", "Date": "July 19, 2011"}, {"Title": "Only one input option", "Author": "Drew \"Drew\"", "ReviewID": "RIIG84ED9KPBQ", "Overall": "2.0", "Content": "I've had this TV for over a year now and it works fine with my PC hooked up to it.  Unfortunately, I haven't, for the life of me, been able to get any of the other inputs to work (HDMI, component etc.).  I primarily bought the set as a PC monitor and am happy with that aspect.  However, 2 stars since I cannot get anything else to work with it.", "Date": "February 20, 2011"}, {"Title": "Great Bedroom TV!", "Author": "Orange Prop", "ReviewID": "R3GIC2AVQ5Q3XW", "Overall": "5.0", "Content": "Actually one of my favorite TV's in the house...and we have a few nice TV's. This TV is a steal for what you get. Quality throughout and shares nothing in common with big-box cheapy sets you see all over. We mounted tot he wall of our bedroom (never had a bed tv before) and find ourselves going in to watch movies more and more. Upscaling DVD player looks beautiful on HDMI and HD pic is stunning. She likes the iPod dock too which I though was a gimic but works pretty well. Win all the way around!", "Date": "February 13, 2011"}, {"Title": "Good basic TV", "Author": "V. Ivanov \"tech savvy\"", "ReviewID": "R3460GXR533PAM", "Overall": "4.0", "Content": "Bought it for my teenage kid's present; for his small bedroom. It has a lot of features for the price, fairly decent quality picture and sound(if anyone uses the TV as a sound emitting devise still). The I-pod dock is useful for the kid too. For the time I bought it, I would recommend to anyone on a budget. Now the technology is soooooooooooooo advanced, I will never buy this \"Quality\" TV today... Please, be fair, this will be true for any year old TV, any brand!!! So for my purchase then, I am happy.", "Date": "January 13, 2011"}, {"Title": "Panasonic HDTV", "Author": "Larry", "ReviewID": "RMXC5KKJXFKZN", "Overall": "4.0", "Content": "Bought this for my wife's bedroom.  Great tv.  We own many Panasonic Products and they are consistantly top performers.  This product was delivered in two days arriving xmas eve as promised.", "Date": "December 27, 2010"}, {"Title": "Good TV", "Author": "JarCie \"Cotton\"", "ReviewID": "R2ETS1I3UZHLVW", "Overall": "5.0", "Content": "I've had this for a few years now, works good, nice picture, more features than I use, and it has preformed problem free.  Consider that it was available at a very competitive price, I'm very pleased.", "Date": "December 21, 2010"}, {"Title": "Awesome tv!!! buy now!!!", "Author": "dual amp lover", "ReviewID": "R28KXDLAQBZA7U", "Overall": "5.0", "Content": "This tv is great and comes with an ipod dock which comes in handy when you just want to relax and listen to music. Everything about this tv is great, but the only drawback being the factory speakers. The speakers sound clear, don't get me wrong, but can't fill a large room without you turning the volume all or almost all the way up. Besides that the picture quality is great and HD channels are as about as good as your going to get with 720p. I definitely suggest that you buy this tv, i watch mine everyday and love it! Thank you Panasonic!!!", "Date": "December 20, 2010"}, {"Title": "hd tv", "Author": "otis", "ReviewID": "R3MWAB99LHU5NP", "Overall": "5.0", "Content": "Just the right size for our rv.  I like the extras, especially the ipod plug in.", "Date": "October 23, 2010"}, {"Title": "sound", "Author": "J. W. Barnes", "ReviewID": "R3UAKRM6JGKKT5", "Overall": "3.0", "Content": "This tv will not connect to my external sound system which is a older model. the tv i replaced worked fine with it. This tv has a digital plug that is not compatiible with my older reciever (and a digital cable was not furnished)The sound level is too low when on max. I have 4 other tvs with great sound systems, i wished i had stayed with sony.", "Date": "October 9, 2010"}, {"Title": "Out Of The Box ~ Beautiful !", "Author": "Ron G.", "ReviewID": "R3EE6LZQHE7M9C", "Overall": "5.0", "Content": "PROS:Received promptly ... out of the box beautiful.  The sound is as good as any, picture is perfect (no adjusting) necessary, pretty much \"plug n' play\".CONS:Nothing of consequence.  Would prefer a stand alone dedicated sleep button on the remote... as is you have to go into the menue three steps, I believe it is to set it, and I'm using this tv as the bedroom unit.I would recomend this Panasonic unit to anyone without reservations.", "Date": "June 7, 2010"}, {"Title": "I love this TV", "Author": "art chick", "ReviewID": "R3KH0P8BDIKYLK", "Overall": "5.0", "Content": "I am very happy with this TV in every way. I love it! Just be aware that unless you have HD service, the TV picture won't be in high-def. I hooked a game system up to the TV and then I was able to appreciate the HD.This TV was easy to set up and the sound and the picture quality is great. I have a smaller Toshiba TV at home and this Panasonic TV is MUCH better in terms of picture quality and ease of set up. This TV had all the right settings immediately, whereas with the Toshiba I had to adjust the color sliders a lot to get a good picture.", "Date": "May 14, 2010"}, {"Title": "GREAT Bedroom TV!", "Author": "Summers Pearl", "ReviewID": "R39JTIYHOW4FRI", "Overall": "5.0", "Content": "This TV has been GREAT!  In my bedroom, it feels like a bigscreen.  I have it set up about 10-12 feet away from where I sit in bed and I am loving it--the screen seems bigger than it really is.  Picture is crisp, though you will notice the non-HD channels look grainy, but that's not the TV's fault!  HD looks lovely on this screen.I'll address a few things:Appearance:  This set is sleek and attractive!  It is shiny and collects dust, but so what?  Dust your TV!  Not a biggie.  Contrary to some other reviews, I think the viewing angle is fine--the screen is easily visible even at some extreme angles.  Plus, it's a small TV--turn it a little!  It is not heavy or hard to move.  This is what I do.Sound Quality: Sound quality is totally fine for bedroom use, but if you want to use this in a larger room, you may want to get some additional speakers.  The speakers are on the underside of the TV which makes it look more streamlined but affects the sound level a bit.  I'm thinking about getting speakers even for my bedroom, but that's just me.  I like explosion sounds to boom.Remote:  The remote is easy to use, but I can't figure out how to fully sync it with my Fios remote.  This may just be because I'm technologically-challenged, but I currently use both remotes.  It partially synced, automatically--channel changes, etc., are on the Fios remote and volume/mute/power are on the TV remote.  Oh well.Haven't used the iPod hookup yet, but it's a cool feature to have!Overall, I am VERY pleased with my purchase and love having this sized TV in my bedroom.", "Date": "May 10, 2010"}, {"Title": "TV Broadcast Engineer Rates Outstanding", "Author": "Broadcast Engineer \"retired broadcast enginee...", "ReviewID": "RXNDXMK7M9ZJ7", "Overall": "5.0", "Content": "You have heard the story about the cobblers kids going to school with no shoes?  Well as a TV Broadcast Engineer I was use to working with the best equipment at work and average equipment at home.  Now with the DTV implementation completed I was ready to replace one CRT TV with a new digital set.  I did much research and finally decided that for the price and features the Panasonic TC-L261 was the best buy.  Oh... the price in Feb 2010 was only $289.00 not the $550 it is today.I received the new set, set it up, and immediately ordered a second set for the bedroom.I tested this set using some of the newest techniques and test equipment that I could put my hands on.  There is not a set for the money that could meet these tests like the Panasonic TC-L261 did.  Add the additional features like the slide shows with the SD cards, iPod hookup and you have a nice entertainment package in a compact size.The only improvement I could recommend is to allow me to input a longer loop of music for the slide shows.", "Date": "May 10, 2010"}, {"Title": "Beautiful screen.", "Author": "James Peterson \"YMMV\"", "ReviewID": "R3IJ7CC5ZASRUF", "Overall": "5.0", "Content": "All the features you can ask for in a small TV at a price great price ($245 when I bought it)Good sound volume and quality.Great features (inputs, adjustability)Great display (sharp and good colors)Great price.", "Date": "May 3, 2010"}, {"Title": "Decent TV", "Author": "None of your Business", "ReviewID": "R2HF1S23BCE00K", "Overall": "4.0", "Content": "I'm satisfied with this TV it took me forever to make up my mind on which TV to buy.  I haven't had a TV for almost 2-years, the last one I had was a Magnavox and it had a lot of sound issues along with a buzzing noise behind the sound that drove me nuts.  I keep the volume quite low and can hear it fine, the pictures quite clear, I love the ipod feature (since I live on my ipod).  The TV's a lot larger than I was expecting, the screen is more like 26.5 diagonally and the area around the screen is quite large as well, the TV itself is a good 4 1/2 inches thick!  I was a bit taken back by how thick it was.  The screws for the stand were a huge pain in the butt to put in.  In order to make a review for 6ave you have to make an account, so I just wanted to mention that I ordered the TV from them and it got here quick and was extremely well packaged, in two boxes with tons of peanuts.", "Date": "April 17, 2010"}, {"Title": "cwh", "Author": "Conrad W. Hawes", "ReviewID": "RFAZ57GUWN887", "Overall": "5.0", "Content": "I puchased this flat screen in Fevuary 2010 at a then cost of over $150.00 less, I have noticed every since that time the price has been going up. The picture when turned onn an angle facing you is very good, the contary can be said if your not exactly facing you. The remote control I found to be vey good. It's not an insant on, takes a couple of seconds. I am very happy with the TV all around. CWH 4/15/10", "Date": "April 15, 2010"}, {"Title": "Just What We Needed", "Author": "Robert Montgomery \"Bob\"", "ReviewID": "R2KZME538QEBVS", "Overall": "5.0", "Content": "Zero problems setting it up, and picture is excellent on the Standard setting. Calibration is easy, and everything works well and looks great.", "Date": "April 10, 2010"}, {"Title": "Great TV for the size and money.", "Author": "M. Wagner", "ReviewID": "RT2VJ7YUNWVF7", "Overall": "5.0", "Content": "This TV was everything I expected and more.  I am very pleased with it, the picture quality is excellent, sound is good quality for a 26\" TV.  One of the reason I purchased this TV was the viewing angle, and it is excellent.  After reading several reviews on this particular TV and other similar models, I am very glad I purchased the Panasonic Viera. I also appreciated the sale price.", "Date": "April 9, 2010"}, {"Title": "VIERA X1  PERFECT-10", "Author": "JAH7440 :)", "ReviewID": "R5ESBD5L9G9PP", "Overall": "5.0", "Content": "I HAVE OWNED SEVERAL PANASONIC PRODUCTS OVER THE PAST 35+ YEARS AND HAVE NEVER HAD ONE OF THEM FAIL.I HAVE A 19\" VHS COMBO,JUST TO MENTION ONE, THAT IS AS GOOD AS IT WAS THE DAY I PURCHASED IT.ALL THAT SAID LET ME TELL YOU WHAT LEAD TO THIS PURCHASE.I BOUGHT ANOTHER 19\" DVD COMBO TO REPLACE AND UPDATE THE FORE MENTIONED VHS COMBO.I BOUGHT ANOTHER MAJOR BRAND AT A BIG BOX STORE FOR A CHRISTMAS GIFT AND IT TURNED OUT TO BE JUST JUNK.I RETURNED IT AND WAS GIVEN ANOTHER TO REPLACE IT.THAT ONE ALSO HAD MAJOR PROBLEMS AND HAD TO BE RETURNED.I RETURNED IT AND GOT MY MONEY BACK.I LOOKED AT THE VIERA X1 AT THE BIG BOX STORE BUT IT WAS TOO EXPENSIVE FOR ME AT THAT TIME.I FOUND IT AT AMAZON AND THE PRICE WAS ALMOST 1/2 THAT OF THE BIG BOX STORE,WITH FREE SHIPPING AND NO SALES TAX.I PAID ABOUT THE SAME AS THE COMBO MODEL I RETURNED.RIGHT OUT OF THE BOX THE VIERA X1 26\" SHOWED THE QUALITY I HAD COME TO EXPECT IN PANASONIC PRODUCTS.THE LOOKS,FEATURES,PICTURE AND THE EASE OF SET UP WAS OUTSTANDING.LOOKING AT THE PICTURE AT AN ANGLE IS EXCELLENT.I COUPLED IT WITH A PANASONIC DVD I HAVE OWNED SINCE THEY FIRST CAME OUT AND HAVE A GREAT SET UP FOR THE BED ROOM WITH A VERY LOW INVESTMENT.I FEEL CONFIDENT IN SAYING THAT THE VIERA X1 IS ONE OF THE VERY BEST HDTV OFFERED IN THIS SIZE RANGE TODAY AND WILL NOT DISAPPOINT YOU! AGAIN ,IN MY OPINION ,YOU ALWAYS GET QUALITY WITH PANASONIC PRODUCTS.THE VIERA X1 IS A PERFECT-10! :)", "Date": "April 8, 2010"}, {"Title": "Perfect tv for my kitchen", "Author": "Savich \"PJ\"", "ReviewID": "R2T00TSFA2OT93", "Overall": "5.0", "Content": "I had a 27\" opening and this 26\" hdtv fit like a glove.  It almost looks custom.  TV looks great with its piano black bezel and base.  The biggest surprise was the ipod dock, didn't know it was included until I opened the box.  With 3 teens at home with ipods this was great. For watching everyday tv it's top notch.  Sports... it gets a little pixelated.  Other reason for my selection is name brand - panasonic.  I read a previous review stating one off brand was un-viewable closer than 8ft.Wife wasn't thrilled I replaced the standard tv because \"it still worked\", but she loves this tv the most.", "Date": "April 6, 2010"}, {"Title": "This is one great TV", "Author": "D. Castillo", "ReviewID": "R3F9ZFUUXDVH47", "Overall": "5.0", "Content": "If your looking for a space saver TV then this sets for you. The picture quality out of the box is unbelievable. It's hard buying a TV that you can't see in operation. But this one is one great TV.", "Date": "April 6, 2010"}, {"Title": "perfect size for my entertainment center", "Author": "Windy Chimes", "ReviewID": "R2MBS2QP7RNIBT", "Overall": "4.0", "Content": "As another reviewer said -- the sound quality is not so good,but ease of set up and use more than make up for that. Works great w/ my Roku box! I really like that you can change the picture output to zoom full 3/4 ect, for different viewing experiences...", "Date": "April 5, 2010"}, {"Title": "Very Good HDTV", "Author": "Peter E. Faulkner \"Music Lover\"", "ReviewID": "R2LYDIAW9IY180", "Overall": "5.0", "Content": "As always Amazon has the BEST there is to offer. This TV is not the top of the line but it's a very good TV for what I use it for. I love the I-pod connection, it's a plus. Keep up the good work Amazon. Thanks Peter", "Date": "April 5, 2010"}, {"Title": "love it !!!!!!!!", "Author": "Carol Kesling", "ReviewID": "R3HSDE3JYRSUYI", "Overall": "5.0", "Content": "i love this t.v.the only thing is the sound is not real loud, but speakers will help that. i very happy with the picture quality. although i only have hd on the living room t.v. its still great.. great price. i have always been happy with amazon !! would recomend to anyone.", "Date": "April 5, 2010"}, {"Title": "A good value", "Author": "S. J. Simmer", "ReviewID": "R1PYZRCSCAMDOJ", "Overall": "4.0", "Content": "Had no problems with set up.  Works right out of the box.  Nice picture quality.", "Date": "April 4, 2010"}, {"Title": "Great TV!", "Author": "Craig Breakspear", "ReviewID": "RDIPYBU25RPYH", "Overall": "5.0", "Content": "This TV was a great buy. Good Price, for a lot of features. Great picture, easy setup. The one thing I don't like a whole lot is the remote and the menu options. For example the Sleep function takes a few steps to put it on sleep more when it should be a one button press. Would like to see a lighted remote as we use it in the bedroom.", "Date": "April 4, 2010"}, {"Title": "Can't imagine a better picture than this", "Author": "B. Queman \"\"threegrills\"\"", "ReviewID": "R3HHT022CN4WY0", "Overall": "5.0", "Content": "The picture is, in a word phenomenal. I saw a video review (CNET, I think ) in which they were tepid in their praise, but from what I see, this is a first class LCD. Very good blacks, and very bright colors.  It has  Multiple HDMI inputs, composite color (which is what I use since my cable box does not have HDMI), an SD card slot, and an IPOD dock, which I probably won't be using.  It does not have one of those netflix -capable inputs,  but if I get downloadable Netflix, I'll just buy the box.Saw a PIXAR movie on it, and I was delighted, ditto the IMAX Under The Sea. Non HD looks great too.So yeah, very satisfied with this item!", "Date": "April 3, 2010"}, {"Title": "EVEN BETTER THAN EXPECTED", "Author": "RUTH LEWIS", "ReviewID": "R1LNIXSWECMB83", "Overall": "5.0", "Content": "Although this model was not as highly rated as some others by Consumers Reports, we decided to buy it because of our wonderful experience with our 2 year old Panasonic 50\" model, and the fact that it plays SD memory cards from our digital camera. All you have to do is insert the card into the slot and voila! it plays on the screen.Since we were limited in size due to the constraints of a built-in wall  unit, we could only fit in a 26\" set, which is the smallest available and not offered by all manufacturers. There was some hesitancy about ordering such an expensive and fragile item through  an online seller. Amazon came through with flying colors. NOt only was it received in about 3 days but the delivery guy even  brought it right into the house for us!All in all the whole experience rates 5+ stars!", "Date": "April 3, 2010"}, {"Title": "26\" panasonic viera", "Author": "senora sg", "ReviewID": "R1XNFG0P11PIR6", "Overall": "5.0", "Content": "We bought this tv for the bedroom.  It's a good size and has a good picture.  Sound ijust ok.  The design of the remote is not intuitive; also, it is difficult to see in the dark.  All in all, the panasonic is a good buy for this use.", "Date": "April 3, 2010"}, {"Title": "Great price", "Author": "Gerald Branson", "ReviewID": "RK62WVW4KRK52", "Overall": "5.0", "Content": "The 26 inch Panasonic is a very good buy. I check around many stores and could not find a t.v. with these features and picture quality. It is a perfect t.v. for the bedroom not to large but just the right size. The picture quality is very good and the sound is good for a set of this size. Remote is easy to read and not confusing. Overall for the price the Panasonic is most certainly very good unit.", "Date": "April 3, 2010"}, {"Title": "Best for the price", "Author": "Gordo \"The Online Shopper\"", "ReviewID": "RNB0BT0GNFBNZ", "Overall": "5.0", "Content": "Great TV for the price. Perfect for a bedroom. Panasonic did an excellent job on this one. This is the 4th HDTV I have bought. Great picture good sound and easy set up. For those who don't read the specs there is only one audio output that is optical digital so if you do not have the equipment to interface with it don't buy this one. If you do don't complain after purchasing this unit. By the way, there are adapters to convert the output if you really want to connect to RCA input jacks. The only problem I see is wall mounting. I will have craft an adapter to fit the wall mount bracket I bought. Not a real problem but it will involve some work. Buy this TV!! I would buy another in a heart beat", "Date": "April 2, 2010"}, {"Title": "Great TV", "Author": "P. Horne", "ReviewID": "R3RQ81JNQ9AZJ2", "Overall": "5.0", "Content": "This is a great set, especially for the bedroom!  According to the reviews I've read, we are one of the few who have it mounted on the wall.  The speakers underneath may not be the best option if you're using the stand, but with it on the wall, you can hear true surround....pretty awesome.  I like the fact that you have have small graduated steps with the volume.  Our old TV was too loud on one setting and too low on the next.  The picture is great.  We have not had any viewing angle problems.  The only negative I have to say, is the mounting option is not universal.  We had to get a piece of metal to fabricate a bracket in order to use our old mount.  Other than that, it's perfect.", "Date": "March 29, 2010"}, {"Title": "Best Buy for a 26\" LCD TV", "Author": "D. Calloway", "ReviewID": "R23QEU3CEE4SW3", "Overall": "5.0", "Content": "Excellent sound - good or better than any larger flat screen. LCD backlighting is uniform. Very easy to use. Best buy for a LCD TV within 19\" to 26\" size range. Be aware that the HDMI inputs are not compatible with the Dish Network VIP222 receivers, Dish Network claims that there will be a firmware fix in the future - use component hookup for now.", "Date": "March 29, 2010"}, {"Title": "Great Deal", "Author": "Lucinda O. Linder", "ReviewID": "R29GZ9B2T7XDM8", "Overall": "5.0", "Content": "I am very satisfied with our purchase. I compared many tvs for our bedroom and this had the best specs and price of all I could find. I have not changed picture settings yet but out of the box the picture looks real good. With a little work I know I can improve it. The HD channels look so good as well as the digital ones. The sound is average and I will probably add a small speaker system to it since its in the bedroom. I would say for the price and picture this is a winner.", "Date": "March 28, 2010"}, {"Title": "bedroom tv", "Author": "joseph sammarco", "ReviewID": "R1ONQ4JC21QK8Y", "Overall": "4.0", "Content": "Searched a while for this TV and am very happy with it. Great picture, pretty good sound and all this at a real good price.  The only thing that i would change is the remote just in one way.  For those who would use this TV in the bedroom, a back-lit remote would really be a plus to use the various features like timer, return and the like.  All in all, i like it.", "Date": "March 27, 2010"}, {"Title": "Good little TV", "Author": "J Parkes", "ReviewID": "R2DWW5U37XMTTE", "Overall": "4.0", "Content": "I've been very happy with this TV in the month we've had it. The picture is surprisingly good for such a small TV, especially a 720 unit. Its very graceful in appearance, and the ipod station is so simple to use.The controls on the TV and remote are easier to use than any I've encountered on any tv.To be fair, the picture is not as good as my larger Pioneer plasma TV, although still very respectable.  Some of the colors, especially blues, really appear to me more neon-bright than they actually should be, and the dark's aren't as rich. So, IMO its best use is as a secondary TV.The biggest negative to be aware of is that the picture quality plummets when viewed from more than about 30 degrees or so off-center.  It loses most of its color.For those of you like me using antennas:  the over-the-air tuner works marvelously, as long as the signal is strong. However, it is not as good at pulling-in weaker signals as other TV's/tuners I've had, and I can't get some weaker station signals that I could with my old set with digital converter box, and my main tv.  This is especially true with old analog signals (which obviously won't be a problem forever).For those interested in such things, the TV is assembled in Mexico.", "Date": "March 27, 2010"}, {"Title": "Great picture and sound but viewing angle is limited", "Author": "al \"alfalfa\"", "ReviewID": "R1SCWCDO11VBF5", "Overall": "4.0", "Content": "I purchased this Panasonic 26\" LCD TV because it has good sound.  Many LCD TV's seem to have very tinny sound.  This Panasonic sounds fine.  The picture is great but there is a noticeable drop-off in saturation as you move to 45 degrees on either side.  This is not a problem for us--we have it in the kitchen and always have a good viewing angle.", "Date": "March 26, 2010"}, {"Title": "Great buy! Good Quality", "Author": "R. Dukes \"Azazel 7\"", "ReviewID": "R19FH1134BRK3Z", "Overall": "5.0", "Content": "This is a great name brand product at an off-brand price! As long as you don't mind the lower resolution, this baby had everything we were looking for. I was surprised by the high sound quality in such a thin cabinet. The SD slot is a nice feature for viewing slideshows... have not used the iPod dock yet, but the interface looks very cool.", "Date": "March 25, 2010"}, {"Title": "Good TV for the money", "Author": "A Bit of it All", "ReviewID": "R3NF9PQWZVD8SK", "Overall": "4.0", "Content": "This is a great bedroom TV.  I would not recommend for a large room or high ceilings due to the audio.  It is not an issue in our bedroom, but I hooked it up in our living room (cathderal ceiling)to try it out and it was simply not powerful enough.  If you're torn between 720 and 1080, get the 720 and save your money.  1080 is great, but IMHO it doesn't matter in TVs smaller than 32\".  My only other complaint is that the remote is not back-lit.  That would have been a nice touch.  Can't beat this TV for the price.", "Date": "March 25, 2010"}, {"Title": "fantastic!", "Author": "Dana E. Tracy", "ReviewID": "R3SJ1QISO6CWNG", "Overall": "5.0", "Content": "After more research than I would care to admit, and reading every review I could find I ordered this tv.  It has an excellent picture, good sound, better viewing angle than many, and looks good to.  It is hard to go wrong with Panasonic and it more than met my expectations.  That being said, I first bought a 26 inch Sanyo at Walmart because it was local and I could return it if there was a problem.  It was an OK tv and got pretty good reviews but the viewing angle was not good and the picture not as sharp as I had hoped. For nearly the same money I ordered the 26 inch Panasonic and could not be happier.", "Date": "March 25, 2010"}, {"Title": "Good quality for price being so inexpensive", "Author": "leeny28 \"leeny28\"", "ReviewID": "R2DTS7APJR8M3M", "Overall": "4.0", "Content": "I was a little nervous buying this tv because the price was so inexpensive. It just seemed to good to be true but I am overall very satisfied w/ this brand not bad for only $289 plus free shipping cant beat that!! Thank you Amazon love this website !!!", "Date": "March 23, 2010"}, {"Title": "Great product", "Author": "Charles M. Jetmore", "ReviewID": "ROF4AB7GRAZP5", "Overall": "5.0", "Content": "Wow this is a beautiful tv.  I also liked the Ipod hook up.  You can't go wrong with this product.", "Date": "March 22, 2010"}, {"Title": "tv", "Author": "sq \"twin's mom\"", "ReviewID": "R2VCHKMNU3VNQG", "Overall": "5.0", "Content": "I absolutely love this purchase. I was afraid to buy a TV online after hearing stories ofreturns etc. I received the TV and put it together in minutes. One review had stated it correctlythat the screws are too long on the bottom and one needs a thin long screw driver..if that is a fault then thatsthe only one i can say exists. The size is perfect for my bedroom. Easy to set up and look is nice...so love this purchase..especially when the price was under $300.00 aswell", "Date": "March 21, 2010"}, {"Title": "Great Set", "Author": "David J. Foster", "ReviewID": "R34UWLCHO2C8YN", "Overall": "4.0", "Content": "Thought about bying a 22\" Samsung and was just about to do it until I saw this set for just a few dollars more.  Boy am I glad I got this one.  It fits much better in the living room and has a great picture.", "Date": "March 19, 2010"}, {"Title": "tv", "Author": "Janet A. Newton", "ReviewID": "R3LYRT95CUNQHQ", "Overall": "5.0", "Content": "I absolutely love my new TV.  Everything about it is great - do not have any complaints.  Would definitely recommend it to everyone.  My sister also bought the 32 inch one and loves hers also.", "Date": "March 17, 2010"}, {"Title": "Very nice T.V. at a great price", "Author": "Charles E. Oatley", "ReviewID": "R3O3HAVWJBUWWG", "Overall": "5.0", "Content": "I needed a T.V. for my office and this was a perfect fit. It's very easy to set up and use. The I-Pod dock is a great feature. It has a great picture. I have had other Panasonic T.Vs in the past and they have all been very good TVs. Buy it. You know you want to.", "Date": "March 16, 2010"}, {"Title": "Excellent display and many video inputs", "Author": "S. L. Tan", "ReviewID": "R3O1S6OTUJI3PW", "Overall": "5.0", "Content": "Many video inputs including 2 HDMI, component and composite inputs. More than what I am looking for. Also bought a Panasonic BluRay player which can share the same remote control. Great!", "Date": "March 13, 2010"}, {"Title": "Great TV for a Great Price", "Author": "BKOJR \"BKOJR\"", "ReviewID": "R2WSQQ98AKZXKQ", "Overall": "5.0", "Content": "This TV is Awesome.  It sits right up on our chest in our bedroom and it is a good size for viewing.  It was easy and  simple to set up and had no issue.  My IPhone works in the ipod dock.If you need a second tv this would be a good one to get.", "Date": "March 13, 2010"}, {"Title": "Great TV!!", "Author": "Benjamin Henshaw", "ReviewID": "R1CK2AP8GOI9PT", "Overall": "5.0", "Content": "Great television! Great price! This 26\" tv is the top of the line..for the money you can't beat it...I'm very pleased with this product thanks Amezon.", "Date": "March 12, 2010"}, {"Title": "Great Price, Great TV!", "Author": "S. Williamson", "ReviewID": "R2YMWUARTCB163", "Overall": "5.0", "Content": "I've owned this for 2 weeks and love this in my bedroom. I placed it on a Peerless mount 6' from the end of my bed. Sound is perfect, HD picture could be better but I can't really tell the difference between my living room LCD and this one. Overall I would recommend this to anyone who needs a smaller TV or just can't afford 150 or 300 more for 32\".", "Date": "March 9, 2010"}, {"Title": "Beautiful", "Author": "Janice Fox", "ReviewID": "R1LR099L1QNYHU", "Overall": "5.0", "Content": "It is just beautiful. I was able to hook up my Roku, dvd player and computer to this with no problem. The picture is just fantastic.", "Date": "March 9, 2010"}, {"Title": "Happy", "Author": "S. Dowling", "ReviewID": "RQN031V49P0B8", "Overall": "5.0", "Content": "This Panasonic Viera X1 more than met my expectations. Love it...The ipod docking station charges and plays, the photo slideshow works beautifully (Note: only SD or SDHC size memory cards fit in the slot, not memory stick, etc.) Very good price for what you get. Happy, happy!", "Date": "March 9, 2010"}, {"Title": "The best t.v. I have ever bought.", "Author": "Stacey B. \"Spiritgirl\"", "ReviewID": "RGPKOCVRW1O6L", "Overall": "5.0", "Content": "I have been searching for a television for months. Something that would fit into my budget. I only wanted to pay around $275.00, and this one came in at just 289.00. I kept going back to this t.v. on Amazon because of the price along with the  base for my IPOD. The brand name also made me feel trusting. I am amazed at how easy the set up was, especially because I do not have any fancy pay services like cable,or anything. So with the tuner in the t.v. it was perfect. Clear picture. Great color. The remote is very easy to operate. The sound comes from the back so I have the unit on my dresser on an angle the sound dances up and around the unit with ease. I am very, very happy with this product. It only took 3 days for the free shipping.I saw the price go up in a matter of days since my purchase. I recommend this t.v to anyone!", "Date": "March 7, 2010"}, {"Title": "Great TV 100% happy", "Author": "Spoonie11", "ReviewID": "R1AFWD58310MYB", "Overall": "5.0", "Content": "Tv is great, fits where i need it to fit. sound is good picture is good, all in all its the perfect tv. It went up 70 dollars in one day which i didnt understand but lucky for me i bought it weeks ago.", "Date": "March 6, 2010"}, {"Title": "Excellent TV", "Author": "S. Jensen \"Gamer\"", "ReviewID": "R2L5TKO78OC92Q", "Overall": "5.0", "Content": "Ok, I bought another PS3, and didn't like how it looked on my spare 32 inch tube TV. So I looked for flat screen TV that was reasonable in price and quality. First off I believe in Panasonic electronics. They are some of the best. I have a 42 inch plasma EDTV from Panasonic and have always loved the picture quality on it. I have even had friends comment on it. So after looking around, I came across this deal on Amazon for $289 for this 26 inch TV. It was smaller than the 32 inch I was looking for, but because I like Panasonic, and the price was right, I thought I would try it. Let me tell you, I was not disappointed. The picture quality is great, the games on the PS3 look fricking awesome, better than on my 42 inch Panasonic EDTV. I am completely impressed, and have enjoyed it. Set up was easy, putting the stand on took a little patience, but overall, you can't go wrong with this TV. The few reviews that mentioned the sound quality must be deaf. I play my PS3 and usually keep the level between 10-12 because that is more than loud enough. If I turn it any higher, it is too loud. You can also adjust the bass and treble levels. The digital channels look like HD quality on this tv. It is amazing, and the difference in size from a 32inch was not all that bad. I am happy with my purchase, and if Amazon keeps this price for a while, I will be purchasing another one.", "Date": "March 6, 2010"}, {"Title": "Nice TV at a Good Price", "Author": "K. E. Hamm", "ReviewID": "R1F5BK6LUIGWHE", "Overall": "4.0", "Content": "I purchased this TV at a good price based on positive reviews.  It is not the primary TV in the house and is for the bedroom.  It has a nice picture and has lived up to my expectations.", "Date": "March 4, 2010"}, {"Title": "Great TV at a Great Price", "Author": "E. Barnes \"The Pup\"", "ReviewID": "RJVMOTTWWBO1R", "Overall": "5.0", "Content": "My 15 year-old 27\" CRT began to crap out on me, and rather than repairing old technology, I decided to use my tax refund for an upgrade. A little bit of searching, and I found this beauty here.Pros:-iPod Dock works well, charges iPod while TV is off-Picture is great-Good number of inputs for its size-Remote seems powerful (works while facing the wrong way in a medium room)-Rich colors, sharp image-Satisfying \"click\" noise as the unit is turned On or Off, letting you know the device is working.-Speakers aren't great, but get the job done better than most flat-screens I've heard.Cons:-Viewing angle seems a bit strange to the side - seems to have a better vertical viewing angle, which works well for me since it sits higher on a chest of drawers in my living room. Horizontal angle is by no means terrible, but seems less than other Televisions out there.-Automatically switches to iPod input if iPod is docked while the TV is on. No apparent way to change that.-Remote buttons are made of a kind of \"hard\" rubber - doesn't stick well when placed upside-down on a rocker armrestOverall, I'd recommend it to just about anyone. It's not a cheap kitchen counter television, and it's not a home theatre television (too small for that), but it is a great little unit for the casual watcher. =)", "Date": "March 4, 2010"}, {"Title": "Wonderful TV set!", "Author": "J. Robbins \"media-junkie\"", "ReviewID": "R2UG10VAR5L8P8", "Overall": "5.0", "Content": "I purchased this television to use in my bedroom, primarily with my PS3 and computer as a monitor.  The picture quality on this television is spectacular, the blacks are vivid and true.  Compared to the 37-inch 1080p set that we have in our living room, I cannot detect any differences in picture quality.  Using both the HDMI or component connections, the video looks stunning and the sound quality is quite good for built in speakers.  I do tend to have to turn up the volume considerably more when using the tv with the PS3 than when watching cable or videos on from computer.  The setup was very straight forward, though attaching the stand was a bit difficult, a magnetic tipped screwdriver would have done the trick.  I'm extremely pleased with this tv and would definitely recommend it to anyone!", "Date": "March 3, 2010"}, {"Title": "Great Buy", "Author": "R. Cooper \"Coop\"", "ReviewID": "R1E8KER9JDGAO1", "Overall": "5.0", "Content": "I bought this tv for my son to replace a 19\" Magnavox lcd set. The 19\" Magnavox has a good picture but it is too small for a primary set. This Panasonic set, purchased at $289, was a great buy. When you figure in no shipping and no tax, it is hard to find a better deal for a new (not refurbished) 26\" tv. This tv has a great picture from all angles. So far, everything is as advertised and he is very happy with it.", "Date": "March 3, 2010"}, {"Title": "TV review", "Author": "Peter C. Haynes", "ReviewID": "R1TT3ZQCT2P3HV", "Overall": "4.0", "Content": "Great TV with great picture for the price.  We use it as a bedroom TV so not really concerned about how loud it goes nor have we tested that.", "Date": "March 3, 2010"}, {"Title": "Lacks good sound", "Author": "Ernie", "ReviewID": "R25I4NH8YUNB23", "Overall": "3.0", "Content": "This TV is great although it lacks good sound. No RCA jacks on TV or even a Headphone jack. I have it in a small office and there is no way to pump up the sound unless I want to spend big $$ for a home theature setup. It has a Opticle jack but it does me no good. It's to much trouble to send it back so I'll live with it.", "Date": "March 3, 2010"}, {"Title": "Extremely good TV for its price", "Author": "A. Sanchez", "ReviewID": "R33RU953LGE1G4", "Overall": "5.0", "Content": "I had done a LOT of shopping and was hesitant to buy this TV at first. It turned out to be perfect for what I needed. It's lightweight and easy to move around (because I do a lot of moving), and HD looks great.Two HDMI ports, which is enough for me (use it for PC display as well as for my xbox 360). Sound is great, picture is even better. I stream HD netflix through my 360 and it looks wonderful, and games look great too.The added iPod dock is pretty unique, but I wish you didn't have to be in the \"iPod mode\" on the TV to listen to music.As a monitor, the screen is great, had to do a lot of adjustment when I used HDMI though. The normal PC input looks just as good as the HDMI too,  but you don't have any sound unless you use speakers of course.If I needed another TV I would definitely purchase another, it was money well spent.", "Date": "March 2, 2010"}, {"Title": "Great TV for the Price", "Author": "L. Karanfilian \"IGGY Mom\"", "ReviewID": "RCFEGXEJCGKJ7", "Overall": "5.0", "Content": "We were looking for a smaller flat panel TV for our bedroom and found this one on Amazon for the great sale price!  I'm so happy that we went for this one.  The picture and sound are great and I love the Ipod doc.  It charges your Ipod while you watch.  Excellent deal for this little TV.", "Date": "March 2, 2010"}, {"Title": "great bedroom T.V.", "Author": "Barbara J. Stites", "ReviewID": "R27Q0G5ATLCJIV", "Overall": "5.0", "Content": "WE are very pleased with this T.V. Easy to set up and good picture quality. Good value for the price. Would buy the same again.", "Date": "February 28, 2010"}, {"Title": "excellent for the value", "Author": "Brian P. Szabo \"amazon junkie\"", "ReviewID": "R24DAZLOBJN5TJ", "Overall": "5.0", "Content": "this tv is great. this is our second panasonic and fits nicely in our bedroom. had an amazon GC so the tv only cost 249 out of pocket. i would recommend any of the panasonics to family or friends.", "Date": "February 28, 2010"}, {"Title": "Good input layout.", "Author": "J. Henson \"Monorail Purple\"", "ReviewID": "R2X8PJDEBY7Q45", "Overall": "5.0", "Content": "Perfect TV for a bedroom, spare room etc. Charges and plays form ipod easily - I would have preferred HDMI inputs for the ipod cradle so I could bring it with me on tripsOther inputs are well designed. I'm a freak about keeping my cords untangled and easily identified. No problem here.Sound is lack-luster but slightly better than the typical TVs from just a couple years back - attach components for a better experience.I'm considering buying a second one of these for the guest room.", "Date": "February 25, 2010"}, {"Title": "Absolutely Awesome!", "Author": "Edward T. Geha", "ReviewID": "R2WVET1BRHRPRU", "Overall": "5.0", "Content": "I knew this TV was going to be fantastic just by looking at it on Amazon, but it really exceeded my expectations.  Great size, great picture, great features.  And the iPod dock feature is absolutely incredible.  We have it hooked up to our main stereo system in the house through the TV's digital optical audio out port; it's like having a little DJ station in our house now. Play all your playlists, artists, albums, songs, whatever.  Awesome Feature! Definitely recommend this TV for a bedroom, workout room, dorm, apartment, etc.  We have ours in the area between our kitchen and main family room entertaining area, right in front of a pub table/chairs.  Great for watching games, listening to iPod, etc.  If you're in the market for a TV this size, BUY THIS ONE.  You cannot go wrong for $289 (current Amazon price w/ free shipping).", "Date": "February 24, 2010"}, {"Title": "Extremely satisfied", "Author": "A. Cardenas", "ReviewID": "R2A6YEWTNMS307", "Overall": "5.0", "Content": "I was looking for an LCD tv to replace my 10+ yr 19 inch in the bedroom. I had narrowed down my decision to a Samsung 26 inch but ran across this Panasonic on Amazon. After reading the great reviews and discovering the price was much lower than the Samsung, I decided to purchase the L26X1. Ordered it on a Monday and it arrived at my house that Wednesday thanks to Amazon's free and fast shipping. It was fairly easy to set up; I have to agree with others who suggested a magnetic screwdriver for assembling the base. This is my first LCD tv and I am extremely satisfied with it. Overall, I think this was a great purchase at a great price and I would highly recommend.**On a side note, when I connected the cable line to the tv, there were some faint white lines and a buzzing noise; no issues when hooked up to the DVD player though. After doing some research, I purchased a surge protector with coax connections and that resolved all the issues.", "Date": "February 20, 2010"}, {"Title": "Great value with a good picture.", "Author": "L. Millar", "ReviewID": "R28QX40NEC9I0H", "Overall": "5.0", "Content": "To be honest, I wanted to stay away from some of the cheaper brand LCD TV's when looking for a TV for the bedroom and when I saw this Panasonic 26 inch, I knew it had all the features I was looking for at a great price plus I had a spare IPOD classic lying around for the docking feature. The picture is good on both HD channels and SD channels. Smaller screens like the 26 inch can get away with picture quality issues that can affect the larger ones, so no complaints there. The IPOD functionality is excellent and overall it's a good bargain for a Panasonic TV. Downsides that have been mentioned before is the initial base installation ( Magnetic Philips screwdriver is a must ) and the audio speakers could be better, but I've yet to find an LCD TV that'll knock your socks off without a soundbar or home theatre setup. If it's used in the bedroom, the overall sound quality shouldn't be an issue, so I'd recommend this Panasonic LCD TV without reservation.", "Date": "February 19, 2010"}, {"Title": "Perfect TV", "Author": "George P. Homschek", "ReviewID": "R26TM3JREAN0PC", "Overall": "5.0", "Content": "absolutely one of the best tv's I have ever purchased and esp. at the amazon price of $289.99.Picture is a 10 the only concern is that the sound is a little small sounding however, I guess this is why it is so small.Would recommend for others to buy.", "Date": "February 18, 2010"}, {"Title": "Love it!", "Author": "amandalp", "ReviewID": "R3DKUHHK6728FA", "Overall": "5.0", "Content": "Shipped very quick! Just a great TV! Easy setup, beautiful picture. I don't have an Ipod, but maybe some day I'll have one, but the memory card reader is just a Gob send!", "Date": "February 17, 2010"}, {"Title": "happy customer", "Author": "P. dipietro \"book worm\"", "ReviewID": "R21EVYX8ZT8U7C", "Overall": "5.0", "Content": "This is a great set.  I had no problems setting up and the picture and sound are great.Small problem putting the screws in the base.Delivery by amazon was very fast even with free shipping.  I am very happy.", "Date": "February 17, 2010"}, {"Title": "Great TV!!!", "Author": "Connie Delago \"Flip\"", "ReviewID": "R5YP06NPKMJ6R", "Overall": "5.0", "Content": "Purchased this TV about a month ago for my 12 year old using his saved up money. Very easy set up, I did it myself before my son and husband came home. It only took a few minutes. Great picture and sound. iPod kit is an added bonus. My son loves it and so do we!!! Thinking of getting another one for his brother. A really great TV at an excellent price.", "Date": "February 16, 2010"}, {"Title": "Great Value LCD", "Author": "Paul 360", "ReviewID": "R2DQS8YYW95PH6", "Overall": "5.0", "Content": "Although this was my first HDTV purchase I did alot of research on LCD TVs and monitors under 28\".  The Panasonic VIERA X1 had everything I was wanted for watching Blu-Ray and DVD movies and for occasional TV watching.  It fits perfectly in my entertainment center located in my small den and can be viewed for every seat in the room without any problems.  The digital optical audio output allows me to send multichannel audio to my processor and hear even many TV broadcasts in 5.1 surround. The remote is adaquate but I would prefer to have some more direct channel options. Since it's under 30\" you can't tell the difference between the 720p and 1080p resolution.", "Date": "February 15, 2010"}, {"Title": "Panasonic VIERA X1 Series TC-L26X1 26-Inch 720p LCD HDTV", "Author": "gholmes \"PhotoNut\"", "ReviewID": "R3DE0OXXET220G", "Overall": "5.0", "Content": "Panasonic VIERA X1 Series TC-L26X1 26-Inch 720p LCD HDTVI read most of the reviews that exist for this Television. I completely disagree with those who gave it less than a sterling review. I found the picture to be astoundingly sharp, great color, tonality and contrast. These attributes are especially prominent on my Time-Warner Cable H.D. channels. I cannot comment on this in regards to non-cable viewing as I do not do that-ever.As we use this TV in our bedroom and the 26 inch size is perfect for our size bedroom. It's only about 2 feet past the bottom of the bed. I had a 32 inch Samsung for 15 months and it went bad, and would have cost $275.00 to fix it. Talked to Samsung and the factory gave me a 3 month extension to the factory warranty. However it would have cost around $100.00 to ship it back to New Jersey for factory repair. So I scoured the internet and wound back here at my favorite shopping place. I am enrolled in AMAZON PRIME so shipping was free for 2 day delivery. The unit only cost me $289.00 What a deal this was.About delivery. I purchased this on a Friday and since the Presidents day holiday fell over the weekend was promised delivery on the following Tuesday. This didn't happen tho-it came the following day, Saturday the 13th of February. How's that for service from Amazon?", "Date": "February 15, 2010"}, {"Title": "AMAZING PRODUCT FOR THE PRICE", "Author": "keperkjr", "ReviewID": "R2Q5NE8TVH73Q3", "Overall": "5.0", "Content": "This is my first HDTV, (i felt it was time to upgrade from the 19\" SDTV), and while i seen many other TV's in stores, this one is among the best in terms of picture and sound quality. The sound actually surprised me a bit considering what ive heard about TV's this size. Almost has a surrond sound feel to it. This also fits great in the bedroom.I was originally going to get a 26\" samsung, but somehow landed on this page by accident, and im glad that i did. The price of this beauty obviously got my eye, the savings was ridiculous, and free shipping was what had me leaning towards the panasonic.The Ipod and SD card features are also a great feature to have,and this works great with my PS3 (compared to my SDTV, im now able to see thing on the screen that i didnt even know were there lol) I definitely recommend buying this set", "Date": "February 14, 2010"}, {"Title": "Great little TV", "Author": "Martin Blinn", "ReviewID": "ROBVBFK1C33I9", "Overall": "5.0", "Content": "Easiest install ever. 5min from start to stop. Could do with some screwdriver insert as base mount requires long and magnetic tool. Otherwise brilliant. Sound is good, quality is good. Great features with SD card and iPod", "Date": "February 14, 2010"}, {"Title": "best $360 ive ever spent (so far)", "Author": "J. Linstead \"coolnerd\"", "ReviewID": "R2WP38JHIJDEUW", "Overall": "5.0", "Content": "I love my new TV. It works wonderfully and looks amazing!!!!! Especially going from one of those old 24 inch dinosaurs to this brand new flatscreen. It is perfect for small areas and has amazing picture quality. The sound is OK, it doesnt get very loud, but I could care less. I would recommend this to anyone looking to buy a new TV for their bedroom or small living room, but you have to have a small living room if you are gonna put a 26 inch. And the Ipod dock is very cool and you can manage the music with the remote, no need to get up and change it yourself. I also love the SD card slot. I can take the memory card from my phone and show off all of my funny pics to a group of people instead of handing around a 3 inch screen for them to look at one by one. All in all it is a great TV for basically anything, watching movies, gaming, viewing pictures and even listening to music.", "Date": "February 13, 2010"}, {"Title": "Very good quality, value, and overall performance", "Author": "Adventurer", "ReviewID": "RVPS2W8VCWXAY", "Overall": "5.0", "Content": "I'm in agreement with other reviewers who found that this model performs very well.  Picture quality exceeded my expectations.  My other set is a 1080p Samsung 650 series; this Panasonic does not take a back seat when comparing picture quality.  Works well on HD, analog, and video game sources.  Photo images are displayed well if a little slow to load.  Easy-to-use remote.  Sound quality could be better but is generally adequate.  Very good build quality, very good tuner performance, excellent picture quality, very good price making this a great value.  Definitely a winner.", "Date": "February 10, 2010"}, {"Title": "Great for a 720P", "Author": "Zeydeh \"semperveritas\"", "ReviewID": "RRMJCWV01IJ60", "Overall": "4.0", "Content": "This is a very good TV for a bedroom/second TV.  Actually getting good clean HD signals from an attic antenna.  Setup is easy and sound quality is reasonable for the size of the TV.  However the SD based slide show is painfully slow.  If this capability is important to you, look elsewhere.  Otherwise just great!", "Date": "January 29, 2010"}, {"Title": "Good  Panasonic Product", "Author": "Robert D. Martin", "ReviewID": "R1H2FZ11VK43MG", "Overall": "4.0", "Content": "I have 3 Panasonic TV's and they are all good. My 50\" plasma has a better overall picture than these smaller LCD tv's, but for bedroom use these TV's are great. The only drawback with all LCD TV's is that the picture is not as good when viewing from an angle. Overall the picture and sound on this TV is very good, no complaints. You don't need a 1080P TV for a TV of this size. Save your money and buy a 720P.", "Date": "January 27, 2010"}, {"Title": "Pretty Good Bedroom TV", "Author": "Gary P. Tanski \"shadoe\"", "ReviewID": "R3M8XHD8N5VG3A", "Overall": "4.0", "Content": "I purchased this TV to replace an old tube set I had in my bedroom.  I have to admit, I really purchased this on the basis of price.  I got one of those special Christmas deals.  I am not disappointed. The picture quality looks great to me.  I sometimes use the ipod stand.  It's a nice touch.  I do have one concern.  The remote is not the best bedroom type.  In the dark, it's difficult to figure out which buttons to push of even which end to point at the TV.  I bought a simple and cheap digital ready illuminated universal remote from Walmart to replace it.  Programming it was easy and the digital mode of the new remote allowed access to all the \"dash\" channels.  Other than the remote, this is pretty nice TV", "Date": "January 27, 2010"}, {"Title": "Very pleased.", "Author": "W. Rice \"WDR\"", "ReviewID": "R2LZVROPZBA4Z3", "Overall": "5.0", "Content": "I'm happy with the entired transaction and the product. Would have been nice if the slide show would display video and played your own music but I didn't buy the TV because of the SD slot.", "Date": "January 27, 2010"}, {"Title": "Very good for bedroom and straight ahead viewing.", "Author": "Paul", "ReviewID": "R371KNHOVN241L", "Overall": "4.0", "Content": "If you are looking for a \"modest\" sized television for your bedroom, with straight ahead viewing, you should be pleased with this television.", "Date": "January 27, 2010"}, {"Title": "Awesome tv!", "Author": "Janette Smith \"Jay\"", "ReviewID": "RTID3L9AIXU6S", "Overall": "5.0", "Content": "I absolutely love this tv for the price I paid for it. I love that it comes with the ipod dock as well!!!Definitely get this tv!", "Date": "January 27, 2010"}, {"Title": "Like it so far", "Author": "Stephen C. Martin", "ReviewID": "R1N0T27W9HV40N", "Overall": "4.0", "Content": "Considering that I had some certificates to redeem on Amazon and the tv cost me $185 I am very well pleased. The picture settings are a little sparse compared to the Sony 46\" tv I have but overall I am happy. The tv was easy to setup and use. Menus are easy to navigate.I would buy this tv again.", "Date": "January 27, 2010"}, {"Title": "great sound, clean look", "Author": "E", "ReviewID": "R1HDAYL0Q8FWNL", "Overall": "4.0", "Content": "we have a panasonic viera plasma and like it so we got the panasonic lcd 26 inch.  it is plenty big enough for our bedroom, we have it on top of a chest.  it has good picture (but we don't have HD in there) and great loud sound.  easy to set up dvd player with it.  has controls on the body of the tv as well.  great product.", "Date": "January 27, 2010"}, {"Title": "Great TV, especially for the price", "Author": "J. Ball", "ReviewID": "R3Q3M1EUSB0SPL", "Overall": "5.0", "Content": "This TV was purchased as a gift for my elderly mother.  The picture is so clear, the slimlined size frees up much needed space and is so very easy to setup and use.  You couldn't beat the price ($250) and free shipping.", "Date": "January 27, 2010"}, {"Title": "Don't wait!", "Author": "V. Williams \"VJ\"", "ReviewID": "R3CV7U80VI16A7", "Overall": "5.0", "Content": "Loved this tv so much I bought a 2nd one yesterday.  Sounds good, great picture, easy set up and price can't be beat!", "Date": "January 24, 2010"}, {"Title": "Win-Win!", "Author": "Peter M. Rutkauskas \"Rutna53\"", "ReviewID": "RF41OXCMYSSJT", "Overall": "5.0", "Content": "Best deal I could find ayywhere and got a great TV for 299.00. The picture is beautiful. I have it in the living room for now and it's way better than what we had. Highly recommend this set,buy one and you'll see what I mean. It's a win-win situation!", "Date": "January 24, 2010"}, {"Title": "Great second TV", "Author": "K. Kreider", "ReviewID": "R2UWLESBK4HTY7", "Overall": "5.0", "Content": "We bought this as a second TV for the exercise room.  The sound quality is noticeably lower than that of our main TV, but that doesn't bother us; we could attach speakers easily enough.  The set-up and operation is pain-free, and the picture quality is great.", "Date": "January 23, 2010"}, {"Title": "Good value", "Author": "TKOV", "ReviewID": "R3JE1L99WQF10G", "Overall": "5.0", "Content": "Clear picture, good sound quality and ideal for a guest bedroom. The view is good from angles. There are various inputs on the side of the tv which may be an issue running cables if you put this tv in a small cabinet.Overall, this is an excellent tv for this size and price.", "Date": "January 21, 2010"}, {"Title": "TV description on amazon is wrong regarding the \" audio analog\" output?", "Author": "Bulgakov \"Michael\"", "ReviewID": "R327JSUTXT2QIQ", "Overall": "4.0", "Content": "This was a good buy TV. I owned Panasonic before- they last long. But I am wondering if the description given by amazon is wrong? I cannot find audio analog output on this TV. It is a bit of inconveneince since you have to connect your headphones through an amplifier that accepts digital audio inputs. Can somebody find an analog audio output on this tv? Please let me know. I am thinking of returning it and getting a Toshiba 26\". Has anybody had an experience returning a TV to amazon? Do they give you a full refund? I would appreciate any advice. Any advice regarding the Toshiba tv?Thanks!", "Date": "January 12, 2010"}, {"Title": "Very good TV", "Author": "HiDefGuy \"MobileViz\"", "ReviewID": "R1BN1XF854TQNZ", "Overall": "5.0", "Content": "I missed the gold box special but ended up paying about just a few dollars more through Amazon's Warehouse Deals (it said factory sealed but with shipping box damage, but predictably the box was perfect and factory sealed, not an open box purchase). The unit looks great, the base is heavy and solid, and the picture is bright and crisp. Bargain of a TV set.", "Date": "January 8, 2010"}, {"Title": "a great buy on a great tv", "Author": "sunfire \"pontiac gal\"", "ReviewID": "R17D6P8X9LBM9W", "Overall": "5.0", "Content": "I bought this as a \"today's deal\" item and I am not one bit sorry.  Its a great TV.  It was very easy to set up and menu is understandable.  I took it out of the box, set it on my dresser and plugged it in and was up and running in 5 minutes.  I see no problem with viewing at any angle and the sound is very good and the picture is wonderful, even when the channel is not coming in on HD.  Some TV's pictures look like a cartoon when not in full HD, but this Panasonic doesn't do that.  I am very happy with this purchase.", "Date": "January 8, 2010"}, {"Title": "Looks good, when viewing directly in front.", "Author": "L. Bailey \"Lee\"", "ReviewID": "R2H1HX0JSL1BR0", "Overall": "4.0", "Content": "This TV replaced an older 4:3 CRT tv in our bedroom. Easy set up, as long as you use a magnetic screwdriver to hold the philips head screws that are used to attach the base.I used the recommended settings from the CNET review of this series of TV.Biggest complaint is the off-axis viewing. The picture deteriorates rapidly, at less than 45 degress to the sides.", "Date": "January 6, 2010"}, {"Title": "Very Happy!", "Author": "iowaFightFan", "ReviewID": "R30349Z33GL2OF", "Overall": "5.0", "Content": "First of all, I want to say thank you to Amazon. I purchased this LCD on one of their Holiday deals, and got it cheaper than anywhere else I had looked, plus it was shipped for free and tax-free!!Ok, now about the LCD. So far, I have used this LCD for viewing ipod videos, playing Playstation 2 games (my son anyways) and as a computer monitor.On the ipod videos, the picture looks pretty good. A bit grainy at times, but I am sure that is the video and not the televisions fault. The sound quality while listening ot music is much better than I originally thought it would be. I have zero complaints.My son is young, and enjoys playing video games while I am downstairs on our desktop getting Ebay auctions prepped for shipment and things like that. I hooked up the Playstation 2 to this TV, and let him play on there while I complete my tasks. THe picture on the LCD is amazing. Even better than it was on the old CRT tv, and I have seen many LCD's fail when the incoming video signal is not HD. Sounds quality is very good still as well.Lastly, I used it as a computer monitor. My actual computer monitor is a 17\" LCD, so I thought it would be nice to see how it looked on a 26\". The picture quality was very clear, and I watched some videos on it, and it looked amazing. Truely am impressed with this television all the way around.I would recommend this tv to anyone in the market for a smaller LCD. Absolutely no complaints at this point.", "Date": "January 5, 2010"}, {"Title": "Perfect for the bedroom or kitchen", "Author": "Lynn C. Thanarajakool \"Lynn Thana\"", "ReviewID": "R3O29RZGAATDL8", "Overall": "5.0", "Content": "I always feel like when I buy electronics and try to set them up nothing ever works the first time. This was so simple and easy to set up. I didn't have any problems or issues. The quality of the picture and sound is perfect for my room. i love that it has an ipod dock. It is also very light compared to my old tube tv that I replaced.", "Date": "January 4, 2010"}, {"Title": "wow....great tv for $259.00", "Author": "S. Velasquez \"electrico\"", "ReviewID": "R1TBC4JF2V9W45", "Overall": "5.0", "Content": "I bought this Tv for my sister who lives in a studio apartment in NYC using a Terk HD antenna and Panasonic blu-ray player. All I could say is Amazon sell them again at this price so I could buy one for a spare bed room. This Tv looks great! Wattta Buy!", "Date": "January 4, 2010"}, {"Title": "Great for the money", "Author": "Chuck Norton", "ReviewID": "R302I7N9ZLFPFR", "Overall": "5.0", "Content": "I couldn't be happier with this TV considering the price. Sure, there are a few minor things that I don't like, but for $259.99 on Gold Box I can't give it anything but five stars. I didn't have an issue with the set-up although using a magnetic screwdriver would have cut a couple of minutes off the base install. Using an HD antenna, I couldn't be happier with the picture. Watching sports (football and basketball) the last few days on HD were fantastic. Beautiful picture and the sound is perfectly fine if you aren't used to hi-def. I replaced a Toshiba 19\" flat-screen for a loft/office and have had zero regrets about the purchase.", "Date": "January 2, 2010"}, {"Title": "Excellent 26\" LCD", "Author": "P. Ritzen", "ReviewID": "R3I7HUBE5REHGX", "Overall": "5.0", "Content": "The wife and i have had our eyes on this TV for her game room for quite some time, and we finally purchased it when it came up as the Deal O/T Day for a mere $259,99. At that price, you simply can't do better than this. Once i attached the stand and hooked up her Wii, XBOX 360 and Logitech Z-5500, i turned it on and blew through the initial setup in a matter of seconds. We purchased an official Nintendo Wii component cable and it looks great on this TV, running at 480P. Since the wife's 360 is an Arcade version, it does have HDMI out but it came with a regular Composite AV cable which doesn't have the Optical out on the dongle so i pulled an HDMI cable out of my Onkyo HT-S6200 to see if the 360's sound would pass through to the TV set, and what do you know? It actually does! So now she has her Wii connected to the TC-L26X1 through Component + RCA Stereo, her XBOX 360 with an HDMI cable and a single Optical cable from the TV to the Logitech Z-5500, and it all looks and sounds fantastic. I can't say anything about the actual TV sound because whenever i buy a new LCD TV, the first thing i do is disable the internal speakers.PROS- Beautiful, vibrant and very crisp video from digital (XBOX 360 @ 720P) as well as an analog (Nintendo Wii @ 480P) signals.- Easy to use remote, quick and easy initial setup and a complete and easy to navigate OSD User Interface.- Accepts sound through HDMI, and passes it through to the optical out so cables can be kept to a minimum.- The price, even at $299 it's still a great deal.CONS- Only one Component input.- Attaching the stand requires either a Phillips screwdriver with magnetic tip or a pair of needle-nose pliers.", "Date": "January 2, 2010"}, {"Title": "Nice TV for the price", "Author": "T. Sumner", "ReviewID": "R3VKPPPCPO4JMP", "Overall": "5.0", "Content": "I bought this TV from Amazon this week.The free shipping got here in 4 days,WOW!!It was simple to setup and the picture quality is outstanding for a 26 in. tv.The Ipod hook up is great to as I just got an Ipod touch for Christmas.Its a great place to keep your Ipod and it charges it as well.Don't hesitate to buy this TV!", "Date": "January 1, 2010"}, {"Title": "Super fast shipping and a great TV!", "Author": "Yau Fong Chan \"Kylab\"", "ReviewID": "RX742G8KVU4P8", "Overall": "5.0", "Content": "Bought it on Friday and receive it on Monday with amazon prime. I only use it for PS3 and I am impressed by its image quality. I can see the picture clearly even at 170o angle. I don't know why some other users are complaining it has a bad view angle. I had a unknown brand 1080p before and this TV makes the 1080p a joke. I connect it to my iphone as well and it works perfectly. The volume is loud ( I only set at 25%) the sound quality is all right for a TV speaker. The only draw back is the play list does not display Asian language. At $260 this is one best buy!", "Date": "December 30, 2009"}, {"Title": "my first flatscreen", "Author": "WRP", "ReviewID": "R1NHZJIFEIEUBY", "Overall": "5.0", "Content": "I finally upgraded to flatscreen TV and could not be happier, especially because I got the Amazon Gold Box deal! The setup is easy if you follow the provided instructions. The hardest part is attaching the stand, which other reviewers have mentioned. I positioned the screws using needle-nosed pliers and tweezers - I suggest you do the same. I am a small female and had no trouble moving/lifting the unit. I live in an apartment with a small living room, so the 26\" is perfect. My only complaint is that the picture could be clearer, but it may just take more experimenting with the picture settings. As far as the angle viewing, I have absolutely no problem viewing the screen from any angle. I am definitely happy with this purchase.", "Date": "December 30, 2009"}, {"Title": "Wonderful TV", "Author": "MeTazDvl", "ReviewID": "R17OLIA822JAYH", "Overall": "5.0", "Content": "This is my second Panasonic Vierra.  We bought one of their first plasma sets 4 or 5 years ago and LOVE it to this day.  So when I saw this smaller set at such a GREAT price, I didn't hesitate to purchase it and am so glad I did.  I was replacing a 13 inch tv in my office since I had gotten a new Wii game just for ME.  The little tv was too hard to see the game on.  I ordered this set on Sunday and received it on Wednesday when I wasn't even expecting delivery until next week!I have the tv connected to standard cable and have a wonderfully clear picture.  Getting the screws into the base were a bit tricky, but a magnetic screwdriver did the trick and we had the tv on within 30 minutes of delivery.I highly recommend this tv!", "Date": "December 30, 2009"}, {"Title": "Great Set For the Bedroom. Outstanding Quality.", "Author": "M. Petruccelli \"TrentonHawk\"", "ReviewID": "R3N0CNGW15O0FL", "Overall": "5.0", "Content": "I bought this set about 2 months ago here on Amazon. The shipping was fast and the packaging of the set was perfect. I bought this to replace a 20\" tube in the bedroom. It is my first HDTV set purchase other than my 26\" Samsung Computer monitor which is 1080P and teamed with a Blu-ray DVD Rom player is stunning. Anyway back to the Panasonic, It's feature set is vast and just right. I have not used the iPod dock yet, but i am sure it works wonderfully. The picture on this set is crisp and clean with no distortion. I have Directv with the HR-22 DVR and set at 1080i or 720P delivers and outstanding picture on HD material. The setup of the TV was easy, as expected. On the HR-22 I just connected an HDMI cable and set the resolution and it was done. For watching sports the TV is flawless. I watch mostly NHL hockey and it is fantastic. My Sony Tube 36\" XBR WEGA of 10 years was always my preference for watching movies and sports, but now I take the Panasonic anyday, even though in my living room with the Sony is a high end 5.1 Klipsch reference speakers system and a brand new Denon 3808CI receiver that delivers incredible sound. I even bought the OPPO BDP-83 Blu-ray player even though I am only watching Blu-ray on the Sony at 480i. But the sound is fantastic. I know I did things backwards in the living room, buying an OPPO BDP-83 and the DENON 3808CI receiver, but it is all in preparation for my purchase of the Panasonic TC P50V10 Plasma I will buy next week after the new year. I am not a Panasonic fan boy by any means. I used to be a Sony guy, but now I research my AV products online for a while and will mix and match manufacturers to produce what I feel will be the best experience. The Denon for its price and the OPPO for it quality were the best choice. Back the the 26\" Panasonic. I just received a DMP-BD60 blu-ray player that I connected to the the Panasonic TV via HDMI and with Viera link it works perfectly. Picture is clean with no jaggies and the image has good contrast and black levels.All in all I would definitely recommend this TV to anyone looking for a set in the bedroom or a smaller room. Teamed with Directv and the DMP-BD60 it produces incredible images. Sorry I rambled a bit in my review about my gear in the living room witch had nothing to do with the 26\" Panasonic, but I wanted to give a bit of a background as to what I was viewing TV on previously to this purchase and what I intend to buy for my main viewing (the TC P50V10).", "Date": "December 30, 2009"}, {"Title": "Not Dissapointed", "Author": "J. Reyes", "ReviewID": "R3B5ZQM6Y8LHEL", "Overall": "5.0", "Content": "I bought this TV to give to someone as a gift. I was worried because it was cheap and of the negative reviews for the viewing angle. I cannot understand the viewing angle complaints. The viewing angle is fine. I have a 23 inch Samsung that has a worse viewing angle. On the Panasonic, you literally have to be all the way at the end of the TV for the picture quality to depreciate to the point where it is no longer enjoyable. Viewing angles for small TVs generally are not great. The sound is great and the Ipod dock is wonderful. It is great to watch all the videos you downloaded on a larger screen and use the TV remote. I wish there were more audio hook up options but the speakers are decent. I was stuck between this TV and the 26 inch Samsung but I am glad I chose this one. The negative reviews for the Samsung 26 inch TV dying after a year scared me away. Plus, Consumer Reports rates Panasonic as one of the TV brands that has the least problems. I am thinking about buying another one for my room. This is a great deal!", "Date": "December 29, 2009"}, {"Title": "PANASONIC TV", "Author": "REMO35 \"REMO35\"", "ReviewID": "R1KFVCSWUFTU96", "Overall": "5.0", "Content": "Panasonic VIERA X1 Series TC-L26X1 26-Inch 720p LCD HDTVTHE TV IS GREAT FOR THE PRICE. I LOVE THAT YOU CAN HOOK UP YOUR IPOD TO THIS TV AND PLAY YOUR SONGS FROM YOUR TV REMOTE.THE ONLY THING THIS TV IS MISSING IS A BETTER SPEAKER TO PLAY THE MUSIC. BUT ALL IN ALL I LOVE IT.", "Date": "December 28, 2009"}, {"Title": "TV", "Author": "E. Walter \"Pappy\"", "ReviewID": "R2MGOGSUFZVNSQ", "Overall": "5.0", "Content": "This is a great TV.  The picture quality is excellent.  It is well worth the price we paid.  It is the perfect size for our bedroom.  Excellent product.", "Date": "November 27, 2009"}, {"Title": "Limited Viewing Angle", "Author": "Higher Expectations", "ReviewID": "R2CNBYDS1NAFV3", "Overall": "2.0", "Content": "I've owned this TV for less than two months and am extremely disappointed.  I regret buying this model. Was considering buying the Samsung LN26B360 and am wishing I had done so. Very very poor viewing angle.  Not too bad straight on. Acceptable viewing angle is 30 degrees or less either side of center.  Talked to Panasonic Customer Service and was assured that the TV should be better than I described.  They recommended a local TV repair shop.  Took the TV in and after keeping it approximately one week they agreed fully with my assessment.  Hope I just got a bad one and this is not typical although the repair shop had no comment to this effect. Am thankful that it is used only in the bedroom.  One response to another review of this model said this was typical for LCD's.  Not this bad. Other brands I have seen since buying this TV are much better.", "Date": "February 24, 2010"}, {"Title": "Excellent Choice", "Author": "P. Dion", "ReviewID": "R3ASYCBN2JWEES", "Overall": "5.0", "Content": "This flat screen television is an excellent choice for a den or small area off your living room.  I have a 40\" in the living room but this 26\" is perfect for the wall that we put it on.  We have a brackett that allows us to move it to either side so depending on where you are sitting you can see it perfectly.  Excellent choice for anybody!", "Date": "January 17, 2010"}, {"Title": "Great TV", "Author": "N. Choudhury", "ReviewID": "R2M1HXQPB9KS2D", "Overall": "4.0", "Content": "This is a great bedroom TV. Just the right size and picture quality. I know this product will last for a long time to come. Really like the IPOD connection.", "Date": "January 9, 2010"}, {"Title": "Great TV for the price but...", "Author": "Legend9Nine", "ReviewID": "R1I9K9LVYX4M5F", "Overall": "4.0", "Content": "Has a great picture, easy to use. Things that make me give it 4 instead of 5 stars:Stand installation. There are four phillips screws that affixes the stand to the screen. This would be simple enough, but the screws need to set in recesses of about 1 1/4\", and the recesses don't guide the screw. I did it by lightly taping the screw to the screwdriver tip and guiding it blindly straight down until I could feel the screw engage.Outputs. The only audio output is an optical, so if you want to run sound through an older A/V system with RCA inputs only, you're out of luck.", "Date": "December 29, 2009"}, {"Title": "Panasonic Viera TC-L26X1", "Author": "tv fan", "ReviewID": "R3ABCDJS6R5ST9", "Overall": "4.0", "Content": "I purchased this tv for the bedroom-incredible HD picture-far superior to the much more expensive Sharp Aquos 32 inch that is in the living room. Even my ten year old daughter commented on that fact! However, standard def is fair to middling-but,except for a local cable news station (that is ironically not in HD) everything we watch is HD programming. The sound is ok, we are not hooked up to speakers or home theatre. Perhaps that would improve things somewhat. Excellent service from Amazon-I'm overall very happy with the set!", "Date": "October 28, 2009"}, {"Title": "Very Good Picture", "Author": "Resna", "ReviewID": "R1Q2BJTWDGFXXM", "Overall": "5.0", "Content": "I was skeptical about buying this brand of television since I had a Sony and reviews for Samsung were so good. But I'm glad I did because this is a wonder tv. The sound is more than I expected for the speakers to be in the back. The picture actually look better than my Sony! And the bonus is being able to use my Ipod Touch with it. I'm glad I made the purchase!", "Date": "October 23, 2009"}, {"Title": "Panasonic TV 26\"", "Author": "Marguerite", "ReviewID": "R2TK420L409HYP", "Overall": "4.0", "Content": "The TV is easy to use, has good picture but not as clear as I expected.  It wasn't large enough for small living room.  Also, at an angle the picture quality drops.  My large Panasonic has a beautiful picture but it is 1080p; I guess that makes the difference.", "Date": "October 15, 2009"}, {"Title": "Could not find the model we wanted in local stores", "Author": "Esther Turner", "ReviewID": "RQHWBMVDNI2MS", "Overall": "5.0", "Content": "We knew what model we wanted.  We were ready to settle for a 26-in. in another brand. Still none in the big box stores around us :( .  Buy a TV via Amazon.com!!?  'Sounded wierd to us, but Amazon was the only place we could find it.  It was delivered to our door in perfect shape.  Easy.  Lovely way to shop.  BTW, the price was lower than elsewhere (had they had it).", "Date": "June 4, 2009"}, {"Title": "Just a bit disappointed", "Author": "Yolanda", "ReviewID": "R10CMZIVS1WMDC", "Overall": "3.0", "Content": "Based on all the high reviews here, I thought it was a safe bet, especially at the gold box special price. Setup was a breeze and the appearance of the set itself is sharp looking. The iPod docking is a slick feature as well. The sound is okay, but would definitely benefit from some external speakers.  My issue is the picture quality. The picture is not crisp at all and during action scenes it gets a bit fuzzy. My mother loves to watch home shopping channels and the text is rather fuzzy. I bought two of these TVs and both behave the same. I think for the TV in the living room, I'll definitely be buying a 1080p.  However, the two people that received these TVs are both happy with the picture quality. They just wish the screen were bigger. :)", "Date": "January 2, 2010"}, {"Title": "Good Product", "Author": "J. Kens \"JAK\"", "ReviewID": "RR1B1ZAYDWFE6", "Overall": "5.0", "Content": "We've had this TV for a couple of weeks now. The picture is sharp, and the colors are vivid. We bought the 26 inch size because it fits in our cabinet. We are very pleased with our purchase.I like the fact that since we are on an antenna, we still can get HD broadcasts, and for no extra cost. We also like the fact that channel 62 is back to being channel 62 and not 118.", "Date": "June 17, 2009"}, {"Title": "Terrible Picture Compared to Samsung", "Author": "R. L. Carr \"Wonder Why\"", "ReviewID": "RDCQ8ZW910ILQ", "Overall": "1.0", "Content": "Purchased this unit for my Son's Bedroom.  So, we now have this Panasonic, 2- Samsung Plasma's, and a 32\" Samsung LCD  Compared to the Samsungs, the picture is terrible. Muddy, gray cast, and more red than I can adjust out. Picture does not look natural at all.It is far from slim...almost 3\" deep..and weighs 7lbs more than our Samsung 32\"!Don't waste your money on this one!...and oh yea, the viewing angle is TERRIBLE...if you get off-angle at all, the picture is washed out!TERRIBLE PRODUCT !!!", "Date": "September 4, 2010"}, {"Title": "Great TV, but size is not good for a living room!", "Author": "Youssef W. Hanna", "ReviewID": "R12YNEB7M8N3JP", "Overall": "5.0", "Content": "This TV is excellent! I don't have any complaints about it. Picture quality is amazing and, when I get the iPhone in a couple of month, I will definitely connect it to the TV.However, if you are planning to buy this for a living room, don't! 26 inch is small for a living room. My living room is 12.3 x 13.7, and I believe that a 32 inch would have been a better choice. This TV would work well for your bedroom, or a huge monitor for your desktop.And watch out about the return policy. You pay 15% of the price of TV and the shipping cost if you return it, so it is better if you measure your room, or check a 26 LCD tv in a store before you go ahead and buy this TV.", "Date": "July 26, 2010"}, {"Title": "Would have been great if it arrived in total working order", "Author": "A. Kessler", "ReviewID": "R3UKEIW3BKGL7K", "Overall": "3.0", "Content": "All in all the tv is a good purchase. I have an issue though. My tv arrived with the manual controls on the side of the unit not working. I can only change the channels/power off with the remote. It is under warranty though, and I will be hauling it 30 miles up the road to the nearest factory repair shop. :( Amazon did not want to take the product back because the box was too torn-up, even though it was within the time frame to be able to send it back to them. They also did not have this item in stock to exchange it.", "Date": "May 9, 2010"}, {"Title": "Good product for the Money & Open Box purchase", "Author": "David Locher \"DHL-EE\"", "ReviewID": "R1B7FOGXYBA96T", "Overall": "5.0", "Content": "PAid $260 for 26\" Panasonic LCD open box.  Like new condition, bought as a gift.Recipients son independently had purchased same set for his son.  Both enjoy thisproduct.  Panasonic has good reputation for reliability.", "Date": "April 24, 2010"}, {"Title": "TV", "Author": "S. Heath", "ReviewID": "RFBWNPDC584TR", "Overall": "5.0", "Content": "I really debated on buying a tv over the internet.  It seemed like a good deal for the price and the options but I was still skeptical.  One never knows how the product is shipped or anything.  But I was extremely happy when I received the product.  I received it days before scheduled,  packaged perfectly, no damage.  Perfect.  Love the TV.  Fits exactly where I wanted.", "Date": "April 13, 2010"}, {"Title": "versatile  product", "Author": "Robert E. Tennant \"the white eagle\"", "ReviewID": "R3M0D2V9F35J5D", "Overall": "5.0", "Content": "has many worthwhile inputs , will work especially well on my boat , where it is headed", "Date": "April 7, 2010"}, {"Title": "Bang for your buck!", "Author": "jules", "ReviewID": "RDMSI9KLQIX79", "Overall": "5.0", "Content": "Great TV for our office/guest bedroom.  Easy hook-up to my laptop as a second monitor.  Excellent viewing and sound quality for FIOS HD.  Very pleased with the purchase.", "Date": "April 2, 2010"}, {"Title": "Excellent TV for the price", "Author": "Shakil Zaman", "ReviewID": "R1FTS6XIDSK5F8", "Overall": "5.0", "Content": "This is one of the best deals I have seen on this type of TV.  I priced similiar units from Toshiba, Sony and Samsung, which were much more expensive with less features.  I am a big Apple fan and the fact that I can view my songs and video from my iPhone made me really happy.  The only drawback is the angle of view, which is not very good.  I would recommend this set to anyone looking for an affordable 27\" unit.", "Date": "January 31, 2010"}, {"Title": "Why I Didn't Give This Tv 5 Stars", "Author": "L.C.", "ReviewID": "RL6ZXS5C4IQU9", "Overall": "4.0", "Content": "The Panasonic Viera X1 is a very nice tv. The only problem is having to adjust the color,brightness,and contrast for different shows sometimes. I have a 23 year old RCA with black picture tube that never needs adjusting. It has a beautiful picture. If you can find a tv with the equivalent to a black tube in LCD, buy it!", "Date": "June 28, 2009"}, {"Title": "Great TV", "Author": "Camaslady \"Linda\"", "ReviewID": "R20KIWU8RN10QQ", "Overall": "5.0", "Content": "I purchased this TV becuse it would fit in my existing entertainment center.  I do wish it was taller, but I guess that's the way they make TV's these days.  If I can afford it next Christmas, I hope to get a new entertainment center and a larger screen.  Judging from the picture on this one, it will probably be a Panasonic.", "Date": "January 30, 2010"}, {"Title": "Great TV at Great Price", "Author": "WenHar \"Wendy\"", "ReviewID": "R2VUJR20WOUKYB", "Overall": "5.0", "Content": "Bought this as a Christmas gift for my  mom for her office.  She loves it.  Picture is terrific as is sound.  This was a great deal and I think I'll be buying it for my own office.", "Date": "January 9, 2010"}, {"Title": "Great TV, Not a Good Monitor", "Author": "Chris", "ReviewID": "R3E4BRFKDEDHDI", "Overall": "4.0", "Content": "Bought this TV to connect both the computer and Playstation 3 to the same screen. The TV looks amazing when connected to the PS3. When connecting the computer to the VGA port, that was completely different. It would not support a resolution higher than 1024 x 768. If you are looking to use this as a monitor, I would look at something else. If you just want a TV, then this thing is great.", "Date": "February 28, 2010"}, {"Title": "Great set at a decent price.", "Author": "Jesse M. Johnson Jr. \"Retspin\"", "ReviewID": "R1DHONZA9YSS66", "Overall": "5.0", "Content": "This was a Christmas gift for my teenage daughter. It has a good picture with a good viewing angle for an LCD. My daughter really loves the iPod interface and has used it to watch movies downloaded on her iPod, which she had purchased from iTunes. The iPod movies are not HD, but they still look pretty good on this set.", "Date": "January 30, 2010"}, {"Title": "Good TV but price seems high", "Author": "Terinka \"terinka\"", "ReviewID": "R2X0X0DJS3TKZD", "Overall": "5.0", "Content": "This is an excellent TV. Very sttractive and works just fine. I bought mine from Amazon in February 2010 and paid only $289.99 ($315.73 with the sales tax). I am surprised that the Amazon price (now, in June 2010, it's over $500) has gone up so much.", "Date": "June 28, 2010"}, {"Title": "grainy and no headphone jack", "Author": "David A. Westfall", "ReviewID": "R34Q5DLV7GQJG4", "Overall": "2.0", "Content": "720p on this size tv is quite grainy. but the real prob is there is no headphone jack. everybody I know has a pair of headphones. throw em out. wireless headphones won't work either, you know, the ones with the red and white plugs. you can plug em in to the 3 places on the tv with red & white plugs and they don't work. I know because I just got off the phone with Panasonic and they agreed that neither type of headphones will work and I needed more electronic gear and cables to enable the wireless ones to work. all electronics for at least the last 40 years have had a 10 cent headphone jack, until now. Panasonic - boldly going nowhere.", "Date": "March 31, 2010"}, {"Title": "The height of this TV is not 17.1 as listed. It's 18-5/8\" with base", "Author": "neenah2061 \"neenah2061\"", "ReviewID": "R11CC8J80U010B", "Overall": "4.0", "Content": "The tv is great, but watch out for the height.  The listing has the height listed as 17.1\" tall but,with the base it was 18-5/8\".The TV is great, but if you are trying to use it in a tight space watch out for it's height.", "Date": "March 5, 2010"}, {"Title": "Nice TV", "Author": "MK", "ReviewID": "R2PO7NASWOGA30", "Overall": "4.0", "Content": "Very clear picture and sound.  Very easy to set up.  The IPod docking station and all the other features this TV offers are all added bonus.  Great product for price.", "Date": "January 28, 2010"}, {"Title": "26\" Panasonic", "Author": "V. LEDONNE", "ReviewID": "R3E6PLSKE1130D", "Overall": "4.0", "Content": "This TV was purchased for our bedroom.  It's the perfect size and the picture is great.  Did not require alot of tweaking to great a great photo.", "Date": "January 28, 2010"}, {"Title": "Needs a dedicated sleep button!", "Author": "Amadeo A. Juarez \"andijtx\"", "ReviewID": "RX2VXT9G1VH73", "Overall": "4.0", "Content": "For the price, everything about this tv is great except for certain quirks. I use the tv for my bedroom and it is mostly so I can fall asleep to the tv sound and light. It is irritatting that I have to scroll through menus to find the sleep option instead of just pressing a sleep button for 15-30-45 min.", "Date": "January 27, 2010"}, {"Title": "Great item and price", "Author": "W. Wise", "ReviewID": "R2EHFWBP7VVCT3", "Overall": "5.0", "Content": "I am partial to Panasonic based on my past history with their TV's and was once again pleased with the product.  Very good television and a great price from Amazon.", "Date": "January 27, 2010"}, {"Title": "Panasonic VIERA X1 26 inch", "Author": "Robert T. Szalanski \"Pappaz\"", "ReviewID": "R2AXOEM01ZSXPQ", "Overall": "4.0", "Content": "This was the first time I purchased anything from Amazon and I was pleased with the reviews of all the products, the price, and the free shipping.The hints from the reviews on how to handle the small screws for the stand were very helpful so I used a pair of tweezers to guide the screws into the slots. Othewise the set up was very easy. The only issue I had was that I was not able to get the volume control on my cable remote but this was taken care of by Dish when they came to set up for HD.I was able to get a free HD DVR and free installation but I did not realize that they would also have to change or add another dish for the HD. I thought they just changed out the DVR but it did not cost me anything. When they change out the DVR you will lose all programs that you have scheduled to record and all that you have recorded but not watched. The installation went smooth and the cable remote now controls all applications on the TV so I do not have to use the Panasonic remote to control the sound.The picture is excellent now that I have HD but as was noted on several other reviews once you get beyond a 45 degree angle the pictures starts to wash out. I have the TV in a Small den so it is no problem for viewing but does not give a good impression as you walk into the room from an angle at look at the TV.As I said the price I paid was excellent but I would not have mind paying a little more for a picture that did not wash out from the sides.", "Date": "January 10, 2010"}, {"Title": "Viera TV", "Author": "S. M. V. Wyck", "ReviewID": "R19JLFAOW33ZWU", "Overall": "4.0", "Content": "The sound output is inadequate and there is no provision for an output to a separate amplifier or loudspeaker.", "Date": "January 7, 2010"}, {"Title": "Love it so far", "Author": "happy \"goodlife\"", "ReviewID": "R3HVQ5FY4FUU1Y", "Overall": "5.0", "Content": "Easy purchase, delivery and set up. Looks great, can not complain about anything. Let's hope it works for years to come, with minimal built in obsolescance!", "Date": "January 27, 2010"}, {"Title": "Don't Be Fooled", "Author": "Avery St. Clair", "ReviewID": "R157KIDWB0IH1C", "Overall": "2.0", "Content": "This TV might be an improvement on your old TV, or it might not.  I found the image highly variable from station to station, and the format didn't adapt to the signal as on other sets.  You'd be wise to be a more careful shopper than I was.  I replaced it with the same-size Sony Bravia, using the same Comcast signal, and the result is considerably better.  Few comparisons on earth are apples-to-apples; I'm just reporting on my own experience.", "Date": "January 20, 2010"}, {"Title": "love it", "Author": "sharall58 \"Sharall58\"", "ReviewID": "R1B742QTDXLPFH", "Overall": "4.0", "Content": "Just received this and I can't understand some of the other reviewers that talked as though it was just thrown in a box and shipped.  Mine came in the original Panasonic box- with everything including the batteries in pre formed styrofoam slots; it was perfect. I haven't set it up yet but I must say after reading that, I was concerned that I was going to receive it just thrown in box being banged around during shipping, not the case at all.  The television is beautiful, can't wait to see what the picture and sound are like I don't think I will be disappointed. Panasonic products are usually excellent as well as Amazon and what a great price!", "Date": "December 16, 2009"}, {"Title": "A thick monster", "Author": "D. Hong", "ReviewID": "R1Q7GVU5B0H3EJ", "Overall": "1.0", "Content": "The thickness of the unit was truly shocking upon opening the packaging, especially compared to a slightly larger 32 inch Samsung LCD that I bought.  I had to do a double take to make sure that a CRT wasn't delivered by accident.  The sound/video quality may be ok (as evidenced by other reviewers), but a LCD's appeal over a CRT isn't really the picture quality -- it's the design and, mostly, the slim profile.  Needless to say, I swallowed the return shipping that I needed to pay, and returned the item.", "Date": "March 16, 2010"}, {"Title": "Good for 18 months", "Author": "D. Higgins", "ReviewID": "R1J4P0WQVRVBN6", "Overall": "1.0", "Content": "Purchased the predecessor to this current model, which appears to be the same with the addition of an IPOD dock. While I have no issues with picture, setup, etc., I certainly anticipated the tuner would last more than 18 months.  I did not expect this from Panasonic and their curt response to my support email will cause me to choose another manufacturer in the future.", "Date": "February 28, 2010"}, {"Title": "This Tv Sucks", "Author": "B. Dcosta \"Bruno The Man\"", "ReviewID": "RBGIMXPD68CS9", "Overall": "2.0", "Content": "I will never again buy tv without looking at the picture quality first. Jeeezz the picture quality of this tv is just awful. I first used the composite cable and it looked blurry and then I thought I should buy HDMI it will probably bring the picture more like CRT TV. Guess what nothing changed it all the same blurry picture. Another problem is that POWER BUTTON on TV is not working for some reason but the remote works perfectly.If any of you have any suggestion for me please feel free to say it. It looks like I am not buy another tv unless it has the same crystal clear quality as the CRT tv has.", "Date": "October 30, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "26\" LCD 720p HDTV\nIncluded universal iPod dock provides a convenient way to enjoy music, videos and photos on your VIERA HDTV\nVIERA Image Viewer lets you share your digital photos with friends and family directly from SD cards\nVIERA Link lets you control your compatible Panasonic DVD recorder, Blu-ray Disc player, home theater sound system and HD camcorder, all with a single remote and helpful on-screen menus\nTwo HDMI inputs and PC input", "Name": "Panasonic VIERA X1 Series TC-L26X1 26-Inch 720p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51-qmsc5EFL._SX300_.jpg", "ProductID": "B001UE6MA2"}}