{"Reviews": [{"Title": "Vizio 22\" FHDTV 1080p  ....Mine is fine!", "Author": "Mack  R.", "ReviewID": "R2ACIRDVV8TALR", "Overall": "5.0", "Content": "I bought the Vizio 22\" 1080p LCD at Sams Club. The model number on the manual is(VO22L 10A) I'm not having any of the problems that the other reviewer is having like the slow channel or the small font on the channel display. I bought my first Vizio three years ago and have bought two more for the other rooms. None of them have given me any problems yet. Is it possible that there is something in the setup on his/her dish/cable receiver that could be causing this?Remember, if your TV is acting strange, there is a real good possibility that you are in need of proper setup. With all of the options in dish receiver and TV setups these days, it's really easy to have something on the wrong setting.One easy way to find out is to hook up a good old fashioned set of rabit ears and run your TV's channel set-up. If your television doesn't find digital channels, move the antenna or TV into another room and try it again. My experience is that location within the house is far more important than the quality of the antenna when receiving HDTV signals over the air. A lot of these TVs won't tune into a channel unless it has previously found it during setup... even if you manually punch in the channel number!Once your TV has successfully found the digital channels during setup, try moving the TV back to the location where you want it. There is a good chance that your TV will be able to pull in the signal. Be patient and experiment with different locations.", "Date": "January 21, 2009"}, {"Title": "Vizio 22\" LCD Works Great", "Author": "falmen", "ReviewID": "R4PQ1UGZHIMDF", "Overall": "5.0", "Content": "I bought mine at COSTCO one month ago.  The on-screen letters/numbers are 1/2 inch in height so I find them perfectly acceptable because I can see the channel numbers clearly.  The picture is fantastic.  I have no problem changing channels...it takes about two seconds for the channel to change.  (I'm using TimeWarner Cable.)  The Vizio name at the bottom of the frame is a soft orange when it's off, and a soft white when it's on, so it's not a distraction in the kitchen where I have the set.", "Date": "April 1, 2009"}, {"Title": "Excellent as a Monitor, Too", "Author": "Jim Moore", "ReviewID": "R244O67OX0K9Q9", "Overall": "4.0", "Content": "Like another reviewer, I bought the Vizio VO22L at Sams. My first Vizio, I'm impressed by it. Due to space limitations I need to use the same device for both computer monitor and TV, and the Vizio works great in that role. (According to Sams Club's web site, theirs is model V022LF (which is the model Vizio's web site advertises), while the Amazon/Target model is V022L. It looks as if the part numbers are interchangeable, as mine (from Sams) is labeled V022L on the back.In any case, the V022L has a nice display for HD content, but what impresses me more is the display I'm getting via a standard RGB connection to my desktop PC. I was worried that being unable to use the DVI-D connector from the video card would result in a degraded display, but the clarity at 1920x1080 through RGB is astounding (especially after running Microsoft's ClearType optimizer). All I had to do was upgrade my (nVidia) video driver and connect the monitor. I wouldn't think of using 1920x1080 on a smaller display, though, as (at least for me) the desktop features would be way too small.Two (minor) complaints: the sound quality isn't as good as I'd prefer (2x3W output), though for the PC it's fine (and there's a standard connector for audio input to the monitor); and, the remote lacks a dedicated source button for RGB (there's one for each of HDMI, TV, component, and AV), so I have to use the Input button to scroll through the list to select RGB. Those are quibbles, though.Another plus, the TV came with an HDMI cable.I'd certainly buy this model again.", "Date": "March 30, 2009"}, {"Title": "Very pleased: good TV at a good price", "Author": "amy o", "ReviewID": "R2P35CH0T330J6", "Overall": "5.0", "Content": "This TV was easy to set up and it works great. Appears to be a good value.  I bought it for my kitchen and would recommend it.  More positive reviews for this set can be found on Target.com.", "Date": "February 1, 2009"}, {"Title": "Great for bedrooms", "Author": "Michael H. Bishop", "ReviewID": "R35F60ECMPL7FU", "Overall": "4.0", "Content": "I bought this TV when my mother said she would get me a PS3 for Christmas.  Maybe I'm just over excited about it because it's a nice upgrade from a 15 inch Samsung, but I love this TV! This picture quality is great (even without HDTV) and I can't wait to play some HD games on it. I only have a couple minor complaints:The sound quality isn't great. BUT, there is a headphone jack that I plugged my stereo speakers into, so I use those speakers when watching TV which is great.  The other thing that is kind of annoying (not enough to return the TV, mind you) is the amount of time it takes to change channels. Channel surfing with the up-down buttons is fine, but when I enter channel numbers in it usually takes at least 6 or 7 seconds. But like I said, these are minor flaws that really don't bother me much.Overall this is a great TV, especially for bedrooms (gaming).", "Date": "November 30, 2009"}, {"Title": "Vizio frame light is annoying at night", "Author": "P. Buechner", "ReviewID": "R2GN5GTSIWATPL", "Overall": "3.0", "Content": "I purchased this TV for our bedroom.  While the picture quality and sound are both great one thing I was not aware of and find annoying is the light on the frame, with the TV in the bedroom, the light is on all the time. It is annoying at night and there is no way to turn it off.  It's like having a night light on all the time. We do cover it with a book but I must say...why is it there?  It is drawing electricity unnecessarity.  With all the studies of green products, you would think Vizio would make this an optional light.  It was one thing I never even thought about while shopping for a TV.", "Date": "September 25, 2009"}, {"Title": "Great picture!", "Author": "JTB", "ReviewID": "RC9DAQ94RSDXN", "Overall": "5.0", "Content": "I bought this TV for our kitchen, it has a great picture and works very well.  For the price, you can't beat it.", "Date": "July 20, 2012"}, {"Title": "DONT BUY THIS TV!", "Author": "C. Nakken \"It's P\"", "ReviewID": "R2MBTJRRMMJ5MJ", "Overall": "2.0", "Content": "I did research and thought this TV was the best for its price. I read the reviews, of course there are always some bad reviews, but I brushed them off thinking, eh this wont happen to me. So what do you know, I purchase the TV, it looks good, but then when plugged in, the picture quality is horrible!!!! Its blurry and the blacks are messed up, if you have it up a littler higher than viewing level the whole screen goes black. I was very dissapointed as this was a gift for my girlfriend. Thankfully Amazon is awesome and I am getting a refund.Thanks Amazon.", "Date": "May 24, 2010"}, {"Title": "Great TV, Picture", "Author": "L. Wiley", "ReviewID": "R3IMJCWM83Q6A5", "Overall": "5.0", "Content": "This TV is for a child's room and it was a really good buy.  The picture is awesome and it was very simple to mount on the wall.  The remote is easy to use as are the controls on the TV.  It came with an ample amount of input/output accomodations for a TV of this size.  I got it for about $50 less during a retailer's sale.  After we mounted and watched it, I was upset with myself for not buying a second one.  Love it!", "Date": "March 22, 2010"}, {"Title": "Love it...", "Author": "Elle Shopper", "ReviewID": "R2GIC82PUQXZ1V", "Overall": "4.0", "Content": "This is a great little TV, perfect for bedroom or den - awesome picture upgrade from my old standby, a 19\" Sony analog.  The sound isn't the best, but it's more than fine for a second TV, and can easily be improved by adding a very reasonably priced (20.99 at the moment here on Amazon) Logitech S220 2.1 Speaker System to the DVD player (you'll need an adapter - 5.1 Game Console Adapter Convert Rca Plugs To A Single 1/8) much improved sound for movies on DVD, the majority of my viewing. I can't read the set up display from farther away than about five feet - seems like it may have been scaled more for PC monitor use, but once it's set up you don't have to play with it much so that isn't a big deal to me.  I don't have cable or satellite, just use a flat, omni directional indoor antenna and get 16 channels; [...] says I shouldn't be able to get any without a large outdoor antenna so I am happy with that.  It was a bargain at just under two hundred dollars...I have no complaints.  I'd give it five stars if the sound was a little better and set up display more visible from normal viewing distance.", "Date": "February 28, 2010"}, {"Title": "Great TV, even better computer monitor!", "Author": "Mark Schneider", "ReviewID": "ROU3F5PJ0DWB9", "Overall": "4.0", "Content": "I bought this on sale at Target for $220 a month ago. Originally I was going to use it as a main TV in my living room as a first HDTV, but it was a bit small and I ended up buying a 32\" Sony for that soon after. So, being stuck with 2 TV's, I decided to put this one in the bedroom. I tried it on my computer with the comp cable and was blown away by it, so it's now my new monitor, and the bedroom now has cable after running a drop in from a splitter in the basement. The pic on TV wasn't perfect with the presets, but after a few minutes of adjustments it looks great to me. The only reason I'm not giving it a 5 is the slightly tinny sound, but I can live with that as a second TV.", "Date": "February 3, 2010"}, {"Title": "Over Sharpend", "Author": "A. Harrison", "ReviewID": "R20FGDRA90FG6Y", "Overall": "2.0", "Content": "I've had this TV for a few months now.  There is a lot to like about it, but... even with the sharpness turned all the way down to zero the image is still HEAVILY sharpened.  Not only does this make video/tv look funny and more noisy, it makes small text really hard to look at when playing video games or using as a computer monitor.  Every edge looks like a double line that your eyes can't focus on.  And completely forget about using Photoshop or doing any image editing, since the monitor doesn't show you the actual image.  Side by side with my laptop, there is no comparison.  The laptop has no sharpening and is much, much easier to look at and the text much easier to read.I don't know what VISIO's problem is.  I hate this stuff.  Its great that they have a sharpness setting for people who want it, but zero should mean zero, i.e. no sharpening.  They must have some marketing person or product manager whose dumb idea it is that everybody would want pixel level sharpening on all the time.", "Date": "April 4, 2009"}, {"Title": "Dim Picture - Terrible Sound", "Author": "Jane Diokas \"Midcentmodgal\"", "ReviewID": "R2L5YE3TUZHO96", "Overall": "1.0", "Content": "I am returning my Vizio TV today. It looked so good in the store and it was full hi-def, so I expected something pretty good. I bought it for a sunny kitchen and I could hardly see it at all the picture was so dim - and the sound was like a tin can - so annoying I just couldn't imagine getting used to it. In the meantime I bought a Samsung (only 780 hi-def) but the picture was so much clearer and brighter I couldn't believe the difference. I would steer clear of the Vizio.", "Date": "August 17, 2009"}, {"Title": "Do NOT But This TV!!!!!!", "Author": "J. Thomas \"2nd grade teacher\"", "ReviewID": "R3ZKNX8VPCCZP", "Overall": "1.0", "Content": "I'll agree that the picture quality on this TV is wonderful.  I have tried to convince myself that is enough, but it simply isn't.  There are two major flaws with this model that make it a total waste of money and a daily frustration.First, the channel numbers are so small, you simply cannot read them.  I read that in a review before I bought this TV and thought \"Oh, that couldn't be so much of a problem!\"  I have this TV in a very small room, so every chair is less than 6 feet away, and I CANNOT see the channel numbers!  Not only are they small (think point size 20 on your computer) but they are also light blue!  I never have any idea what channel I'm on unless I get up and walk right up to the TV.  If you are a foot or less from the set, you can see them.  Of course, how often is that?The second huge flaw is the time it takes to change channels.  This doesn't sound like a major problem either, but it is incredibly annoying.  You hit 03 and the input, and then (ONE one thousand, TWO one thousand, THREE one thousand, FOUR one thousand, FIVE one thousand, SIX one thousand, SEVEN one thousand, EIGHT one thousand, NINE one thousand, TEN one thousand) the channel changes.  If you like to flip through the channels to see what is on, forget it on this TV!!My last complaint is that the remote control is terrible.  The layout is horrible.  The channel numbers are at the top, but the balance (the place your hand holds the remote) is at the middle.  You can't comfortably hold it and press the channel buttons.  You have to set it down on your knee to press the buttons.  The buttons are tiny, and the channel up/down and volume up/down are on the opposite side than usual, which takes some getting used to.  The remote that comes with this TV has 10 keys that you can't even use (if you try, it will say \"This feature is not available\") like PIP, which take up a lot of room.  The keys are way too close together, so it is difficult to press them.  I didn't put this as a deal-breaker, because you can always go out and buy a universal remote - but should you really have to do that on a brand new TV?I thought the TV picture quality would be enough, but after 2 weeks of trying to cope with the small numbers and the huge lag-time in changing channels, it is going back to the store.  Don't buy this TV!  It is nothing but frustration!", "Date": "January 11, 2009"}, {"Title": "FLAWED DESIGN:  Can't add channels!!!", "Author": "Amazon Customer \"agilityman\"", "ReviewID": "R2GXT4V2NCSEMS", "Overall": "1.0", "Content": "This TV seemed like a great deal, decent picture and 1080P for a good price.Was I in for a shock when I took it home to set it up! We live between three major TV markets in different directions, and can get all their channels -- 51 of them! -- by pointing our rotating antenna toward the city whose channel we want to watch. When I pointed the antenna to City A and autoscanned the channels, it picked up those channels fine. When I pointed the antenna toward City B and scanned, it picked up the City B channels, but ERASED all the City A channels! I called Tech Support, and was on the phone for almost two hours. Got up to Level 3 Tech Support. No one could tell me how to add my channels back, or add individual channels so I could have all the channels of the three cities near me in my channel list. They finally admitted this TV will only work for people with one non-rotating antenna, and is not suitable for people with antenna rotors, wanting to get channels from cities in different directions. There was no warning on the box.BOTTOM LINE: DESIGN DEFECT RESULTS IN NO WAY TO ADD ADDITIONAL CHANNELS. UNSUITABLE FOR PEOPLE WITH ROTATING OR MULTIPLE ANTENNAS!!!", "Date": "November 19, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Native Resolution 1920x1080\nTrue 1080p Full HDTV, Computer support 1920x1080\nATSC, NTSC, QAM\n16.7 million colors\n2.5\" slim", "Name": "Vizio VA22LFHDTV10T-B 22\" Class LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51za87L17cL._SY300_.jpg", "ProductID": "B001KVCE1G"}}