{"Reviews": [{"Title": "Excellent TV!", "Author": "S. Sharon", "ReviewID": "RVMMBUQ0AYX9L", "Overall": "5.0", "Content": "I bought this TV online at [...]  on Thanksgiving day for $799 on the early Black Friday sale.  Forget the lines!This TV has been great so far.  Watched Wall-E in HD the other day, and was blown away!  I matched this with the Samsung HT-Z310T 5.1-Channel Home Theater Surround Sound System (Set of Seven, Black) and the AnyNet feature is a real perk.  Only needing one remote, and having the input source switch on its own when I put in a dvd or switch to TV is extremely convenient.The only con I would mention is that when there are dark scenes, or letterboxing, I have noticed a bit of backlight bleed from the top corners.  But I have a service call in to Samsung about that, and they are actually replacing my whole display panel (which will take care of the ONE dead pixel too).  They are doing this in-home, so I won't even have to lug this down from my 3rd floor apartment.Overall, this TV is outstanding, and the only reason to get the 530 or 550 is if you NEED 3 HDMI's instead of 2, or if you REALLY think you can tell a difference between 20,000:1 and 30,000:1 contrast.  I tried, and I can't.  Thanks for reading.", "Date": "January 4, 2009"}, {"Title": "I am loving this Samsung!", "Author": "Babs \"Barbinator\"", "ReviewID": "R3JGV6HOU4WZQ7", "Overall": "5.0", "Content": "I bought this Samsung tv on black Friday. I found it to be a great tv. The picture looks fantastic with my digital cable and Samsung Blue Ray player. The colors just pop and the picture is crystal clear. I hooked it up to a Samsung surround sound system and now it sounds fantastic too. I haven't had any problems with the tv or the other Samsung products I purchased. Easy to hook up and look and sound great! Loved watching the Super Bowl and am looking forward to March Madness!", "Date": "March 7, 2009"}, {"Title": "Best HD TV for the Price; period.", "Author": "Omar \"I tought what happened in Vegas, stayed...", "ReviewID": "R3O8ENUK3TXT3I", "Overall": "5.0", "Content": "I'll keep it simple and short: I worked as a manager for an electronics giant for a while and I've seen and compared many screens... No other panel in my opinion comes close to Samsung (and the similar models, like the 550 or 600) when it comes to quality/price ratio. If you're looking for 37 to 40 inch. there is NOTHING better than this in the market other than the elite units (non priced below 3k, so don't be fooled).", "Date": "January 13, 2009"}, {"Title": "Everything I expected", "Author": "Kenneth R. Van Wyk", "ReviewID": "R1ZIC5D5LERH0K", "Overall": "5.0", "Content": "I grabbed this TV over the holidays when I saw it on a few web sites. It seems Samsung did the 500 model as a limited production run for some reason, but it's exactly what I was looking for. Not only is it a great product at a fair price, but it's nearly 1 inch thinner than its brethren, which solved a space issue for me.Highly recommended -- if you can even find one any more.Ken", "Date": "January 7, 2009"}, {"Title": "Warning:  turns off and on", "Author": "ChicagoMari", "ReviewID": "R1KJI4TKCLMZ3D", "Overall": "2.0", "Content": "We've had this model for approximately two and a half years.  Recently I noticed the t.v. was a bit slow to turn on and as of this morning, it doesn't turn on at all and just clicks when you press the power button (on the television or the remote).  I googled \"Samsung television won't turn on\" and was surprised to find out that this is a common problem due to the capacitors that Samsung uses (I don't know if Samsung has resolved the problem or not).  My t.v. is no longer under warranty and so far Samsung is telling me that it will not pay for the repairs even if it's a capacitor issue.  After paying nearly $900 for this television when it was new, I am not very pleased about this.The picture on this set is great (when you can turn it on).  The sound quality was pretty bad so we purchased a home theater system (receiver and speakers) and the sound is fine now.I cannot recommend this television based on the capacitor issues.  No one expects their television to last a mere two years!", "Date": "June 28, 2011"}, {"Title": "Samsung 40 inch is BIG!", "Author": "Rita M. Horne \"Grammarita\"", "ReviewID": "R3S1O29ELQ8798", "Overall": "5.0", "Content": "This is a wonderful tv!! Price is great and so is the set! This is the third Samsung we have purchased from Amazon and all have been super!", "Date": "June 23, 2009"}, {"Title": "Nice tv, Cheap price tag", "Author": "Yolanda Guillermo", "ReviewID": "R11IKJ5W7BX0H1", "Overall": "5.0", "Content": "This tv is great for it's price. I got this during the thanksgiving holiday sales for only 799! Picture quality is really good and the xbox games look awsome in hd. I bought a blu ray player for this tv and the quality is amazing for it's cheap price tag. I recommend this tv to anyone who is on a tight budget.", "Date": "March 8, 2009"}, {"Title": "Just search for Samsung volume issues", "Author": "Robin M. Walshesky \"robin\"", "ReviewID": "R2ASLSBPWUCZGD", "Overall": "1.0", "Content": "Less than 5 years and this TV is worthless.  Volume continually turns itself off, then goes to static and we have to disconnect power to get it to work again.  Now the newest 'feature' is that the initial menu of specs on the left side of screen (which should only be there when you first get the unit) keeps popping up.  Samsung support is horrible and they tell me I need to get a technician to come look at it but can't tell me if the repair is covered or not.", "Date": "January 5, 2014"}, {"Title": "Read all Reviews First!", "Author": "n8ur9irl", "ReviewID": "RDX8CD75HA7NT", "Overall": "2.0", "Content": "Purchase date:11/28First call to Samsung 12/29 TV (Samsung model #LN46a500T)would not turn off kept coming back on , no sound from TV Speakers1/8 Repaired(repairman said that there was nothing wrong with TV but he would repair it anyway?)1/11 TV sound went out, loud buzzing sound and TV went black1/12 Callled Samsung was directed to the \"ECR\" dept was told the TV had to be repaied again. The repairman said he didn't think that there was anything wrong with the first repair and that they would put the old part back in. So they are coming tomorrow to fix my broken TV with a broken part.1 month old TV not working! And REALLY! I know how to turn off a TV.", "Date": "January 12, 2009"}, {"Title": "5,200.00 your kidding right? Goes for $800 at best buy.", "Author": "Aethor \"Army Veteran\"", "ReviewID": "R1T32TN5QNVP1C", "Overall": "1.0", "Content": "This external website has mispriced this item. There is no way it is worth $5,200.00 on SALE!!!  It is listed as $10,000.00 regularly. I would believe $1,000.00 and $520.00. But not that. That is why I put one star. I saw this price and had to stop anyone from paying that price.", "Date": "December 13, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001JLLFGM"}}