{"Reviews": [{"Title": "Best TV under $800", "Author": "Wurms", "ReviewID": "R1YBHPS4KPHNFL", "Overall": "5.0", "Content": "I set this TV up for a friend and the factory settings are not all that great.  I changed the settings to VIVID then turned off/low ALL the noise reduction, gamma, black, etc filters with color temp at warm.  Sharpness down to 20.  With those settings, WOW!!!  I was blown away with the picture quality on blu-ray discs via PS3 (Layer Cake, 5th Element, TMNT).  Absolutely gorgeous picture.  Played Battlefield Bad Company and it was a crisp, sharp, clean, beautiful picture.  Gaming looks great!!! If you are looking for a 32\" set, this is THE ONE! Best 720P 32\" out there.  Never seen anything better for this price.", "Date": "August 24, 2008"}, {"Title": "Not Bad For the Price", "Author": "Rick Buchanan", "ReviewID": "R23F9AS7FE0LKK", "Overall": "3.0", "Content": "My parents were looking for an HD replacement for their aging 32 inch CRT set, and they did not want to buy anything larger for their relatively small living room.  After doing some online research and looking at various sets in the store, I thought (and still think) the Samsung LN32A450 was significantly superior to this set.  In the store I thought the LG picture looked almost dingy by comparison.However, the LG was about $200 cheaper than the Samsung, and my parents bought the LG.  I set it up for them after swapping out their old cable box for an HDMI capable cable box, with no problem.  The instructions for assembling the base were very sketchy, but we figured them out.  I connected the set using an HDMI cable from the cable box, and component video inputs from their older Sony DVD player.At first the picture was very bad, even after setting the picture on the home setting.  I found Vivid to be unwatchable, and changing to Cinema was almost as bad. Shadows were blue and flesh tones were green. I did some more searching online, however, and found recommended settings for the set, on CNET.  LG has remarkably precise picture controls for a set in this price range, allowing for a ten point IRE adjustment.  After some playing with the menus (which are not very intuitive) I managed to calibrate the picture using the suggested values for red, blue and green.  The result was very good, if less than stellar compared to some other sets in this price range.  In a low light environment the picture is clear and crisp, and the color is very good.  Flesh tones after the adjustment were accurate.  Football in HD was very nice, with accurate color and no motion problems.  Non-HD cable movie channels were fine for modern films, and for black and white.  The contrast was not that great for non-HD channels. DVD playback from an older player without progressive scan was adequate, but the black levels were not as good as some other sets I looked at. This might improve with an upconverting DVD player. In full daylight I had a problem with glare, and a commensurate loss of detail in the picture. This was easily remedied by closing the drapes.I was able to program the universal remote supplied by our cable provider, and switching from cable to DVD and back is fairly simple. The sound can be set for a pseudo-surround mode, which was fine within the obvious limitations of such small speakers.  The sound is certainly as good as any other set within this price range.Bottom line, in my subjective opinion, is that the LG is more than adequate for the price after some calibration of the picture, but not as good as the Samsung LN32A450, and certainly not as good as a 1080p model (for example, the Samsung LN32A550), even in this size screen.", "Date": "December 1, 2008"}, {"Title": "4 1/2 stars...", "Author": "ThisThatNEverything \"thisthatneverything\"", "ReviewID": "RGO6A0MY2VQA4", "Overall": "4.0", "Content": "We have the 42\" in this TV & liked it so much we got this 32\" for our bedroom.  This TV is mainly used for gaming & it's great for that.  The picture is great & the sound is good in our smaller room.  The design of this TV is great.  It's a nice TV to look at.My only complaint would be that it's not as fast to change channels or to go from cable to game mode very fast.  It would be nice to be able to assign one button to switch back & forth between just those two (or whatever your needs are).Setup was fast and easy.I would highly recommend this TV.  For a smaller room anyway.  I can't vouch for the sound in say a living room or another larger room & I point this out because we sometimes have to max out our 42\" in this style in our living room & it's still not very loud but for a smaller room I'd definitely recommend this TV.", "Date": "November 13, 2008"}, {"Title": "GREAT PICTURE, amazingly user-friendly-idiot proof!", "Author": "catslave", "ReviewID": "RO46REIQZHQQE", "Overall": "5.0", "Content": "We are not early-adopters and don't want to have to go through alot of choices that to us are nitpicky and irrelevant just to get an electronic device to work. Our last TV was a CRT and literally took 45 minutes before you could watch TV.  This took less than 15, and that's because we did the optional auto channel search.  This set has zillions of bells and whistles that you can select when you feel like it, and the menus are all very intuitive and easy to use, not in techno-speak that makes you go \"huh?\"  There's even a huge red button on the front to turn it on and off! The remote is easy to use, too.  We had no problem with the sound, but the set is in a small room.  The picture is great, and very easy to adjust for sports, movies, games, etc.  Very easy to see from all angles of the room, too.", "Date": "December 11, 2008"}, {"Title": "Very Well Made 32inch LCD T.V", "Author": "REG", "ReviewID": "RYYZDHNBFJ7GK", "Overall": "4.0", "Content": "I just purchased this T.V and have loved it.  I have been using a sony lcd before this and picture is as good if not better.  The only downfall is the blacks.  They could be darker, but when your upgrading from a SDTV It wont matter.  I barely notice it.  It has a ton of ports for AV, HDMI and component.  I find the settings on this T.V are excellent to set the colors just right.  This T.V offers alot more than most 32inch LCD do, which makes it so appealing.  LG carries excellent products, they use sony parts I do beleive.  If your looking for a good gaming HDTV, That has alot of color features, good speakers,excellent features, as well quality and a name you can trust check it out.", "Date": "January 7, 2009"}, {"Title": "LG 32LG30 32-inch HD TV", "Author": "Heath", "ReviewID": "R3BRWAMN15GSBY", "Overall": "5.0", "Content": "I was worried about setting up this TV, but it was super easy.  I just unplugged everything from the old TV and plugged into this one and it worked on the first try!!!  The remote has good sized buttons, nothing tiny to find and is well labeled.  The picture is superb!!!  I would definately recommend this TV to people, in fact, I already have.", "Date": "January 26, 2009"}, {"Title": "BEST 32\" TV FOR THE PRICE", "Author": "Cute Chihuahua", "ReviewID": "R7YNDWJ0FATNX", "Overall": "5.0", "Content": "We purchased this TV for our bedroom several weeks ago after purchasing a 42\" LG 1080p HDTV for our living room and loving it.  I am very satisfied with this TV.  The picture is awesome to say the least. I love the LG brand because their product seems to be top of the line. This TV pretty much has it all. I only have one complaint and it is with LCD TV's in general. The sound is good but it doesn't get very loud.  You are not going to shake the pictures off the walls with this TV. Like I said though this is a drawback of all LCD TV's because there isn't much room fit larger speakers in it because of how slim it is.Pro'sStylish Design720p Resolution3 HDMI InputsInvisible Speaker System12,000:1 Dynamic contrast ratioCan be wall mounted or on a standLightweight for movingCon'sSound isn't very lound", "Date": "November 28, 2008"}, {"Title": "Excellent entry level HDTV", "Author": "Jurgen Wagemans \"Tech dude\"", "ReviewID": "R2M1TTT3QJWMPJ", "Overall": "5.0", "Content": "Read reviews before purchase and was not disappointed, clear and good colors easy setup and sleek design would recommend this for the price.In comparison with my Samsung 42\" this one is faster surfing trough the channels.", "Date": "February 21, 2009"}, {"Title": "Wow, what a TV", "Author": "K. Kun", "ReviewID": "R2RV7B3W4M0CBS", "Overall": "5.0", "Content": "I wanted a 32\" TV for my bedroom to replace a 19\" tube TV.  I purchased this product at Bestbuy when it was on sale for $447.99 and this TV is worth every penny.  The picture quality is good on low def channels and amazing on Hi def channels.  A lot of people complained about the speakers on this TV, I'm guessing they were expecting Bose quality to come out of these little 10w speakers.If you're looking for a 32\" TV with amazing picture quality, this is the TV for you.  The regular price tag of $599.99 would be asking more than this TV is worth.", "Date": "February 17, 2009"}, {"Title": "Great picture quality for TV", "Author": "Michael P. Wangerin \"mpw\"", "ReviewID": "R1L7Z5819LE9NV", "Overall": "5.0", "Content": "This product is excellent; I love the picture quality and brightness. It is also a very good looking design.", "Date": "February 5, 2009"}, {"Title": "Completely satisfied", "Author": "Bruce H. Speller", "ReviewID": "R1IMDNGF316EVC", "Overall": "5.0", "Content": "We purchased this tv for our bedroom, replacing a flat screen CRT set.  We have a 50\" HP Plasma in our living room, and the picture on the LG is every bit as good, maybe better in the low light of the bedroom.  The price can't be beat at this writing, and the bonus of free shipping and no tax on the purchase (we found an online vendor other than through Amazon), made the purchase a no brainer.  We had read a number of online reviews that noted some difficulty with setting the set up to operate with our Dish remote, but we had zero difficulty.  DISH network tech gave us step by step instructions to follow (we contacted them before the set arrived), and I had it out of the box and set up/working in no more than fifteen minutes.  I appreciate all of the tips online relative to how to tweak the picture and audio, but frankly didn't do any of that.  Picture and sound were excellent out of the box.  Prior to settling on this purchase we compared it to Samsung, Sony, HP, Sharp, and Toshiba;  price and picture quality made the LG the best choice for us.", "Date": "December 27, 2008"}, {"Title": "Do not buy! In fact, do not buy anything LG!", "Author": "H. Nguyen", "ReviewID": "R288Y7M0UMHHUE", "Overall": "1.0", "Content": "Avoid at all cost!  Unless you want to be using the buttons on your TV to change channels after only 10 months of use!  I purchased this TV less then a year ago, and ALREADY the remote is no longer responding.  I've tried changing the batteries, unplugging the the TV for an extended period, and still it does not work!  Called LG customer service and they think its the IR receiver within the TV that's defective.  Good thing I'm still within warranty?  NO! They have sent 2 technicians to attempt to repair my TV already, and neither of them was able to fix the problem.  Now my warranty has expired, and LG is unwilling to extend the warranty to fix a problem i claimed prior to the expiration, what a bunch of sly gooses!  Good god, I dont know how angry I am at this company!  I am never buying anything from LG again!", "Date": "September 21, 2009"}, {"Title": "Great TV", "Author": "Lora L. Degrado", "ReviewID": "RQWTONB9G6YYS", "Overall": "5.0", "Content": "I bought this LG 32\" LCD TV and its Great!The transition and delivery was better than expected.I would recommed this TV, the product looks good and the picture is amazing! I was a little affraid to order a TV over the internet, not seeing it in person, but I'm not any more.This is the first time that I used amazon.com and I now have used it again to purchase another TV for my bedroom.I am very pleased with my 1st purchase.", "Date": "December 27, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "LCD HDTV features Clear Voice technology which enhances dialogue sound quality with swivel stand and energy Star rated\n720p HD resolution 1366 x 768p with 2 x HDMI v 1.3 digital inputs\nInvisible speaker system for richer more balanced sound & a polished look\nLG Simplink allows for convenient control of other LG products using HDMI connection\n12,000:1 Dynamic contrast ratio", "Name": "LG 32LG30 32-Inch 720p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/3120VzL18CL._SX300_.jpg", "ProductID": "B0016NC08A"}}