{"Reviews": [{"Title": "A fair entry-level 1080p TV (UPDATED - Again)", "Author": "Vinnie A. \"CyberVinnie\"", "ReviewID": "RBBTLYTGJKRKP", "Overall": "4.0", "Content": "I AM UNABLE TO EDIT MY STAR RATING OR I WOULD DOWNGRADE IT TO TWO, MAYBE THREE STARS!!!I bought this for my bedroom last week and am pretty happy with it. I have a 40\" XBR2 in the family room and this model's picture is surprisingly comparable. I bought it through Amazon for MUCH less than BB or Sears. I do have a couple issues that prevent me from giving it five stars: first, it takes quite a long time for the picture to appear when you turn it on and switching inputs takes even longer than my XBR2. The other peave I have is setting the sleep timer; on most TV's there's a dedicated 'Sleep' button on the remote. On the S5100 you have to hit the 'Tools' button on the remote, select 'Clock/Timers', select your sleep time, then press the 'Menu' button to clear the on-screen menu. Wow! All-in-all, neither of those are that big of a deal, but the next issue is the one that's provoking me to call Sony Customer Service. There is a significant amount of noise in the TV's audio output -- especially at low volume. It sounds like the signal is over-modulated, but at higher volume levels it's not as noticable. I haven't tried a set of external speakers to see if the noise is still there, but I have tried component, composite, and HDMI inputs all with the same results. Perhaps I'll update this review with the results of my call to Sony.UPDATE 5/1: I called Sony about the audio issue; they wanted to send out a technician. I opted to have J&R; swap out the TV but the same exact problem exists on the replacement. I guess I'm going to take Sony up on their offer to send someone out. I can't tolerate this problem considering it is our bedroom TV and is often used at low volume levels.UPDATE 5/19: I just finished packing up the unit to return to J&R;, who have been great BTW! The Sony tech acknowledged the problem and said that Sony tech support would probably tell him to replace the digital audio board, but unless the board has been redesigned he didn't think it would resolve the problem. Sony Customer Service refused to help in any way; I asked for a refurbished XBR6 (last year's only 32\" 1080p model) to replace this unit, and they said no. I asked for a discount on a new XBR9, and they said no. As the owner of several Sony products, including a 40\" XBR2 and a 36\" Wega, I am really quite surprised by Sony's unwillingness to help resolve this issue. My brand loyalty has been shaken, and I will think twice before I buy another Sony product. BTW, I'm looking at the Panasonic and Samsung 1080 32\" models as a replacement.", "Date": "April 18, 2009"}, {"Title": "Unhappy with sound", "Author": "Ethan T Ezaki", "ReviewID": "ROJ3MOKW7YK9M", "Overall": "1.0", "Content": "I had the exact same problem as Vinnie A.  I had the KDL-32S5100 in my bedroom and the sound at low levels on this TV is horrible.  Multiple inputs HDMI, DVD player and Fios all sounded great on other TVs but this set made low level sound full of static.  I replaced my TV with Sony support and the same exact problem!  I now have 2 TVs to return that has become a major pain because sony doesn't want return TVs they want to exchange for refurbished TVs.  I have spent 8-10 hours on this problem and now I am very frustrated with the set and customer service.  Bottom line is if you don't use the speakers on this set then it is great 4 stars for picture (would be 5 but the DVD player only looks good if the total size of the picture is made to fit a 4:3 aspect ratio otherwise the TV stretches or zooms the image and distorts the picture).  HDMI picture is great off a PS3 blue ray.  Remember the sound is the problem for this set: You have been warned by 2 reviews that say this is a problem at low levels.  FYI I am trying to return the sets and look into other brands because Sony has lost their touch, which is sad because my house looks like a sony store.", "Date": "August 2, 2009"}, {"Title": "No Dolby Digital 5.1 audio ouput", "Author": "Michael Martin", "ReviewID": "R3591GG4GDTKKL", "Overall": "3.0", "Content": "Picture wise, this TV has been good/great.  I've had it now for a week and the picture is superbly better than the two year old Samsung 32\" LCD it replaced.  I did update the firmware but I still notice the contrast shift at times.  However, the one glaring issue with this TV (and all Sony KDL-xxS5100 sets as I've found) is the lack of Dolby Digital 5.1 audio output.Yes, the TV has an Optical Digital output that the manual states will output PCM audio.  However, it does not list that it is limited to only 2 channel linear PCM audio (which I later found listed under the HDMI input specs on the unit).  A call to Sony confirmed the flaw, and that it is intentionally done (though I am waiting to hear from a Sony engineer as to why this is).  Frankly, I never considered that an ATSC/QAM tuner would not output 5.1 digital audio since it is part of the signal.  And isn't HDTV all about high definition video and audio?This probably isn't a problem for most people unless they don't have a digital cable box and have surround sound, but either way, I'm not sure this can be legal.  And like I didn't have enough criteria when I was buying a TV before, but now I have to ask whether it outputs Dolby Digital 5.1??I'll update if/when I hear back from Sony.  In the mean time, I am returning the TV and getting the Panasonic 37\" 1080p (which outputs 5.1 and fits in my entertainment cabinet).", "Date": "July 6, 2009"}, {"Title": "2 Replacements, Various Critical Problems", "Author": "B. Plafke", "ReviewID": "R3I364WQJK8R9J", "Overall": "1.0", "Content": "(I urge you to read this review before making a purchase, I know I wrote a lot, but they outline some very critical deal-breaking issues.)My first HDtv, a Sylvania broke about after 2 years, and I decided to get this Sony after doing a bunch of HDtv research.  I'm using the HD capabilities for gaming (Playstation 3 at 1080p, Wii at 480p) and just getting a regular coaxial cable signal for my TV shows.1) First, as can be seen in various reviews for this TV, there are some sound issues.  The one I experienced was that, sometimes, the speakers would get very pop/crackling sounding and also have an echo on top of that.  This issue happened when you changed channels.  You'd land on a channel, and the issue would begin and would not go away unless you changed channels (I left it on for a couple hours just for testing purposes).  However, this TV has a new firmware on Sony's support site which apparently directly addresses this issue.  The first iteration of this model had the sound issue, but I got it before the new firmware came out, so I sent the first model back, and received the second one.  The second one came with the new firmware and there was no more sound issue as far as I could tell.2) This one bothered me more than the sound issue, as the sound issue only happened about once every 20-50 channel changes, and you could simply remove the echo sound just by changing channels.  It's a visual issue that was not fixed between my first set and the replacement one.  It's hard to describe; when a color would transition from a light color to a dark color in an image, you could see the actual separation lines of each gradient change, rather than just seeing a smooth transition of, for example, light blue to dark blue.  It looked sort of like when you throw a stone into a pond, and the water ripples out in a circle from where the stone landed in the water--so the outer ripple would be dark blue, the next inner ripple would be a lighter blue, the inner ripple after that would be an even lighter blue, and so on.  I thought maybe it was my PS3, my Wii, or possibly the HDMI/component cables I use for them, so I brought all of my equipment over to a couple friends' houses and tested my stuff on their Sharp HDtv and a different model Sony Bravia--the issue was not present on my friends' TVs.  However, the issue is present on both KDL-32S5100 sets I had.  This issue became very obnoxious when gaming, because it was very noticeable and pretty abundant.  It would appear in skies (drastically in skies for some reason), smoke, floors, walls, etc--anything that's mostly comprised of a solid color that has gradient changes--however, it does not appear on a static image (such as a wallpaper), only something animated.  It also appeared when using composite cables, and appeared on every display signal (480i, 480p, 720p, 1080i, 1080p).-If you have a PS3 and this model TV, change your system theme to \"Original\" then change the color to blue--this is a pretty easy way to notice the gradient issue.  Generally on the blue color, the bottom left hand corner starts out dark blue, then going to the top right, it changes to a light blue.  Around the bottom left hand corner when everything is dark blue, the gradient issue is very noticeable.  I asked my friends and family to see if they noticed anything, without telling them what the problem was, and every single one of them (even non-gamers who have no idea what the PS3's original theme or games' skies should look like) noticed the issue right away.  On any other HDtv I've ever seen, this issue is not present.  It may not be a big issue for some, but if you're getting an HDtv, it's probably because you care about the quality of your display, and you won't be getting decent quality with this issue present.-I had a Sony tech guy come out to look at the issue, and he said he's never seen the issue before (what a Sony rep would say anyway, whether or not he has seen this issue before :P) but said he wasn't sure what was causing it, or even how to fix it.  He did confirm, almost immediately, that this is a problem and shouldn't be happening.  Considering this happened on both sets of this model I received, it's either a) a problem inherent in this model, b) a problem inherent in a certain batch of this model, or c) I'm ridiculously unlucky to get two brand new sets of this model and have the same issue in a row, which is unlikely.3) After all of this, last night the TV stopped being able to receive signals from all 3 of its HDMI ports.  It was very, very odd.  My friend and I were playing around on the PS3 and everything was fine (not counting issue 2 described above).  We finished, shut the PS3/TV off normally and went to get some coffee.  Twenty minutes later we came back and turned on the PS3/TV, except the TV said it wasn't getting a signal.  So, everything was fine->we leave->we come back 20 minutes later->all 3 HDMI ports stopped working.  The composite ports work fine as do the component ports.  We had 2 different PS3s with 3 different HDMI cables to test out, and none of them worked on this TV, but they both worked on a friend's Sharp directly after.  Totally ridiculous.I'll update if I decide to give this model one last try and get yet another replacement, but right now, I'm looking into other brands.", "Date": "August 27, 2009"}, {"Title": "STOP!  STOP!  STOP!  Serious Audio Issues.  Recall?", "Author": "Jonathon", "ReviewID": "R2WL0Q1SLNL6K1", "Overall": "2.0", "Content": "I love Sony TV's.  They have always had a superior product but this time, this set is highly flawed and Sony is doing its best to still sell the inventory left at lower prices leaving you with an item to return or to tolerate.The audio is DEFECTIVE on units dated thru AUG 2009.  The sound bar on the screen will reflect this distortion on level 1-3.  Beyond 3 and up, the louder audio mixes in with the distoration so that you hear less of it.  It's ultra annoying at lower sound settings.I went into the menu trying various sound settings but was not unable to correct.  I then called Sony who said they would make a case number and that a Sony repair agent would have to insert a USB correction device.  Wait time was 2 months!I took mine back to Best Buy and the manager at the store said he could give me another set but that all of them were being returned with sound issues. He said that Sony was almost ignoring the issue trying to avoid a recall.Another feature missing was a zero 5.1 set up and only 1 HDMI on the rear JACKPACK.  One terminal for HDMI is insane in design but Sony does add two more HDMI inputs on the side of the TV for camera or camcorder connections.  You could use those if you didn't mind the wires.Avoid this Sony.", "Date": "August 24, 2009"}, {"Title": "KDL-32S5100", "Author": "Biswamber Pal \"bp\"", "ReviewID": "R3ODGWD49KDHHR", "Overall": "3.0", "Content": "\"I will rate this product on three parameters:1. How you use the product: From the outer looks at a first glance you may not like that much. As compared to other makers and even other lower model from Sony, this one looks much dull. I like the grill design of even the lower model 32L4000. Glossy touch on the outer frame adds a little shine to the frame, other wise it would have been the worst look-feel compared to the latest models of Sony LCD.I like the remote a lot. Allways feel like holding it, its so light and sleak, it works a little slower though, but thats not any problem.2. Things that are great about it: Good clear and sharp image. Good 1080P LCD for a decent price.First attahed this tv to my upconvertible dvd player with component cable. This setting gave good image quality, but nothing that i was expecting from a LCD. Then i replaced component with HDMI. This gave 1080i and i could see good improvement in the picture quality. I believe with blu ray player and blue ray disk with HDMI cable, the pictures should be excellent.3. Things that aren't so great about it: Poor looks. Brightness decreases when dark scene comes. It looks like you are watching a scene, and some one came and reduced the brightness for no reason and then in 2 to 3 seconds, again increased the brightness. Its really annoying. Many a times i have seen ghost images too. I complained Sony and it looks like these 2 problems are with most of the S5100 series of any size. They have a software upgrade released on 04/28, one can download it too, and they are sending that via mail. I have to see once it comes and that corrects these issues or not.Over all I would suggest you to buy from Sony but not at least this 32S5100 series.Accessories I Recommend: Blu ray player, HDMI cable\"", "Date": "May 11, 2009"}, {"Title": "Audio issues solved by update", "Author": "Humboldt", "ReviewID": "R2NVDN0GZLVP3K", "Overall": "4.0", "Content": "The previously reported audio issues are easily solved by simply installing a firmware update using a standard USB stick. Just google for \"KDL-32S5100 firmware update\" and go to the [...] site listed to download the update.", "Date": "November 30, 2009"}, {"Title": "Excellent TV", "Author": "John Overturf", "ReviewID": "RP32T57ZDEKFM", "Overall": "5.0", "Content": "After carefully scouring review upon review and then spending hours at various shops staring at the comparable 32\" models from Samsung, LG, and Vizio, we decided upon the Sony. The Sony had all the right features at the right price. We've since streamed both Netflix and Hulu (have to use a PC and its VGA connection, along with a standard stereo jack - more on this in a moment), and Blu-Ray looks fantastic. Others have complained about the picture quality of this model, that it was somehow duller than others. Before I purchased this model, I compared a Samsung right next to this one in the shop. The picture was nearly identical. Each had its own unique saturation levels (adjustable on the Sony), and I would have been satisfied with the picture quality of either. The Sony won because of the red accents on the Samsung, which would have driven me up the wall. Not to mention it was cheaper.The only thing I could complain about with this TV is the sound quality. The speakers produce quite a bit of high end and low end, without much in the middle. Of course, once it's hooked through our stereo system, that problem goes away, but for everyday TV watching, the sound is not as good as the last CRT flat panel we had. Further, streaming Hulu or Netflix sounds especially muddy with low end extremes and not much in the middle. Even after adjustments. Anyway, best to hook this puppy through a surround system.I gave it mediocre marks for channel surfing (which frankly I don't do too much) because it is slow to change channels.Overall I am very satisfied with this TV. I would recommend this to anyone purchasing their first high def set. It's a good bargain with fantastic picture quality and plenty of new fangled and old school hook ups. It does everything we expected and wanted it to do, plus a bit extra.", "Date": "January 1, 2010"}, {"Title": "Worst Product Experience and Customer Service Experience of all time", "Author": "Y. Goren", "ReviewID": "R2IIEU6EYD0GUJ", "Overall": "1.0", "Content": "I bought this product without first checking the reviews at Amazon.com (big mistake).  Installed it at home in bedroom, mounted it on the wall, etc.  Seemed OK.  Then, I used it late at night when others at my home were sleeping.  I used it at low volume levels (1,2,3,4,5).  At these low volume levels, the TV sounds terrible.  It sounds like you're tuning into a radio station with poor reception: staticy, crackly, etc.  Not just \"bad\" but \"terrible.\"  As a result, I can't use this TV at night unless its on MUTE.  Not a joke.So, I go online to see if others have experienced this.  Well, what do you know?  A handful of people report here on Amazon that they've had the same problem.  They explain that Sony ships them a replacement unit that exhibits the same problem.  Some say they have tried MULTIPLE replacement units.  Some have had a technician come to their home, verify the problem, but offer no acceptable solution.So, repeating history, I call Sony, have a replacement unit sent to me, and guess what?  It exhibits the same problem.  I update the firmware, same problem.So, I call Sony back and politely explain the situation.  Their response?  They can send me ANOTHER replacement unit (the propose the same \"solution\" and they expect different results!?!?) or have a technician come out to investigate.I am on hold and on the phone with their reps for HOURS.  I tell them I just want a TV that works.  I tell them to give me a different TV model as a replacement unit (even a lesser quality unit).  I don't care if it is new or refurbished.  They say NO.I tell them that what will likely happen (based on my experience reading customer reviews at Amazon.com) is that they will send me another replacement unit and it will exhibit the same problem.  I ask them: \"what will you do if I order and return replacement units each week for the next 5 weeks?\"  No answer.They tell me that they are not aware of this audio issue.  They say that they don't have any service bulletins on the subject.  I tell them that there are about 10 reviews on Amazon.com that specifically discuss this exact audio issue.  They explain that they do not have access to Amazon.com.  I realize that I have more information about the quality and problems of Sony products than the most senior customer service reps at Sony.  SONY SHOULD BE ASHAMED OF THEMSELVES.  Here is a well-documented problem, and they have no process (or maybe willingness) to recognize the problem internally.So here I go.  They will be sending out a technician.  I don't have to predict what happens because IT IS ALREADY DOCUMENTED VIA OTHER CONSUMER REVIEWS AT AMAZON.COM.I wish I ran a popular blog with millions of users and had the ability to attract the attention of Sony management.  I hope this posting isn't ignored by Sony like the other similar postings for this exact same product.I will never again buy a Sony product.  Their products have problems (OK, it happens) BUT they have a broken customer support process.  As far as I am concerned, they are DELIBERATELY ignoring their customers.  $#$%$ Sony.**UPDATE** 03/12/2010 - Sony sent out a repair technician last week (Thursday, 03/04).  The technician replaced the mainboard and the speakers.  Guess what!?  THE TV EXHIBITS THE SAME PROBLEM!  Surprise, Surprise.  Its clear to me that there is a design problem with this TV and that Sony is deliberately ignoring this problem.By the way, I purchased this unit using my airline miles via United Airlines.  I suspect that Sony offloads \"old\" or \"undesirable\" or (in this case) faulty merchandise at places like this.  I bet they choose to do this (rather than issue a recall, for example) and try to offload the bad merchandise, release new model numbers (making the bad products obsolete), and hope that the people that have problems go away (most people wouldn't be as persistent I am, I suspect).So, that same day (Thur, 03/4) I call Sony and tell them the technician's fix didn't work.  They tell me that I would get a phone call from a senior customer service rep within 3 days.  6 business days later and still no phone call.  And to add insult to injury, they send me a \"How was your customer service experience?\" e-mail, as if the case is closed!!!**UPDATE** 03/19/2010 - So, I call Sony and I say, \"Hey guys, you said you would call me back within 3 days and you didn't call me back.  So they say, \"Oops - I will make sure someone calls you back within 48 hours.\"  Guess what?  48 hours later, no call back.So, I call them, give them the entire back story, talk to one rep, talk to another rep and they say \"Oops, sorry we didn't call you.\"  They then proceed to tell me that they have a Service Bulletin for this TV model.  I was previously told that there was no Service Bulletin.  So I ask the rep how long ago the Service Bulletin was issued, and he says \"about a month.\"  WHAT!?!?!???After like 6 calls suddenly I'm told that there is a Service Bulletin for this model that indicates that \"buzzing\" and sound issues at low volume is \"expected behavior.\"  Ohh really?  So I proceeded to tell the rep calmly that I've owned and operated, ohh, 10 TV's in my life over the last 20 years.  My expectation is that when I turn on the TV the sounds that the TV emits is, ummm, listenable.  That is, there is no buzzing or static sound such that I hear a muffled sound but I cannot hear the music or voices or intended sound clearly.  I also asked him if he ever had the opportunity to listen to the sounds, at low volumes, coming out of this particular model number and he said no.  He continued telling me that the terrible sound is the expected behavior and there is nothing I could do.  I told him that I would not go away, despite Sony's obvious attempts to cause me to drop the issue.  He said he would personally check with the technical department and personally get back to me within 48 hours.  Guess what!??It's been 3 days and the guy didn't call me back!!!!  His name is Donn, his employee ID is CQWQ.  He represented himself as a manager.  I'll be calling Sony back on Monday to waste their time and mine.These guys are not cool.**UPDATE** 03/23/2010 - OK, so a Sony rep calls me back (on my home phone, not my mobile phone like I requested, so my wife got the call and I had to call Sony back).  They tell me that they will send me a replacement unit with a different model number!  Hallelujah.  They will send me a KDL32XBR9 (also 32 inch).  They tell me that they will not send this unit out until I send back in my original replacement unit (which I did weeks ago!).  I told them to check their records.  They assure me that they'll send out the KDL32XBR9 ASAP.**UPDATE**  04/06/2010 - Well, 13 days later, and I still don't have the KDL32XBR9.  Just called customer service.  On hold for 15 mins and 33 seconds.  They tell me that I will receive the unit within 5-7 business days.", "Date": "February 24, 2010"}, {"Title": "Strong value; not perfect, but nothing is", "Author": "Lars Johansson", "ReviewID": "R2C3D403SSLLPL", "Overall": "4.0", "Content": "Great, sharp picture.  Easy set up.  Extra points for the intuitive, well-guided controls for adjusting options for picture, sound, etc.  I usually will not even hit a TV's \"menu\" button for fear of never finding my way out.  The sound is very good, no \"tinny\" quality as noted by some but the TV is in an entertainment center and maybe it being in an enclosed space helps.I did end up turning off the auto-contrast control which tends to freak out when a DVD has dark scenes like night, in caves - any of the Underworld movies, Beowolf, others.  Even on the lowest setting, it kicked down the contrast/brightness (making it even harder to see what's going on as well distracting) repeatedly over short periods of time.The ultra-gloss black plastic screen frame reflects light far too well and the reflections can be distracting but are less intrusive if I'm engaged in a show.  The screen itself is fine for not reflecting in most cases, but if there's a window opposite the screen, daytime viewing is less than optimal.All that said, it's a great value for price/features/performance and I seem to have gotten it at the lowest possible price.", "Date": "May 22, 2009"}, {"Title": "Serious issues with this television", "Author": "Robert L. Jenkins", "ReviewID": "R37KLMTAO9IA40", "Overall": "1.0", "Content": "I purchased this television in March of 2009, and have had nothing but sound and pictures issues with it.  The sound goes out and will come back on in 10-15 seconds.  The picture sometimes goes out when switching from HDTV to a regular channel, or I get half a picture.I did the software update, but that did not help the problems.Sony sent me a refurbished television and it had the same exact problems.  I offered to pay the difference on a newer model, but they refused to do it.It is apparent that Sony does not stand behind their products.  There are serious issues with this model, and no amount of replacements or software updates is going to fix it.I own two Sony cameras and a blue ray player, but will never purchase another Sony product.", "Date": "February 26, 2010"}, {"Title": "a nearly perfect TV", "Author": "songseeds", "ReviewID": "R2GDE6GABQB2S8", "Overall": "4.0", "Content": "Received the TV from J&R; - who had added extra packing to the factory stuff (thanks J&R;).  Setup was easy - we have cable so I used a component input instead of the TV input.  Exchanged our SD cable box for a HD cable box and ZOWIE.  This TV looks fabulous.My only minor criticisms: 1) it hums - maybe this is a characteristic of all flat screens but when an image is displayed, there is a soft hum. Most of the time the volume of the audio drowns out the hum but during very quiet times, I can hear it. 2) the automatic stuff doesn't work well enough.  It has something called Steady Sound - supposed to balance out the loud and soft extremes but it needs to be more aggressive to pull it off.  3) It's supposed to change the viewing brightness depending on the light in the room - again, it needs to be more aggressive.  A solution = there is a fully functional menu that allows you to tweak MANY parameters and getting exactly what you want is not too difficult.In summary, if I knew these criticisms before buying this set, would I change my decision?  NO.  It is a gorgeous set with extensive connectivity and ample tweakability.  Seeing things in HD is like seeing them new again for the first time.  I highly recommend this set.", "Date": "May 7, 2009"}, {"Title": "Glare is intolerable", "Author": "Muffy", "ReviewID": "R2O21A7CL2AMN", "Overall": "2.0", "Content": "A major disappointment is the reflective quality of the screen.  Our room has high amount of light due to a wall of windows, but the JVC this tv is replacing did not have this issue.  After an afternoon of getting it hooked up, it is going back in the box for a return.Update:  I did return this model and replaced it with the more expensive XBR model which, despite what a Sony Corp rep told me over the phone, is a different screen and is NOT reflective.  Love the upgraded model and would recommend it to others with bright ambient lighted rooms.", "Date": "May 16, 2009"}, {"Title": "Nice picture - has alot of sound problems", "Author": "kobiOO05", "ReviewID": "RTI4U83CD62JB", "Overall": "1.0", "Content": "Hums at low volumeLoud pops and cracks when changing inputsPC audio is sent to input 2, while video is on input 1 when using hdmi cableWhat happened to Sony, I thought they made the best quality TVsThis is my first and last Sony TV( maybe any other Sony product )There is a good reason why all sizes of the KDL**S5100 are selling well below list price.", "Date": "January 20, 2010"}, {"Title": "terribly disappointing", "Author": "J. Scott", "ReviewID": "RQJGWFR8QX2DZ", "Overall": "1.0", "Content": "This was my foray into the world of HDTV.  Most research will show Sony are the leaders in HDTV technology and customer satisfaction, which makes this set a puzzling anomaly.Prior to purchasing this unit, I had read about problems users had experienced with the set's functionality.  Most reviewers claimed these issues could be cured with a simple firmware upgrade.  To Sony's credit, the upgrade couldn't have been easier and did seem to install and report properly.  However, it didn't fix my particular set's issues - the main being the intermittent loss of audio when connnecting via the HDMI ports, and the occasional loss of picture color and contrast.Those issues - and lack of rectification - were troubling enough.  But I also noticed that when I would connect via the component inputs (a DVD deck, for example) and listen through my external hi-fi, the audio was always slightly behind the picture.  No amount of pausing, rewinding, fast forwarding, or stopping the source would correct this annoyance, nor would any audio adjustments made via the TV's menu.  The sound was typically in sync when listening through the TV itself, but never when listening externally.  This is all not to mention that I could never seem to get the color balance quite right, no matter how small or dramatic the adjustments made.  There was not enough presence to the overall picture (even with the backlight on max), and the colors always looked unnatural to my eyes.  Further, even at 1080p, the picture always seemed to produce more than its fair share of pixelization.While the color balance may be nitpicky due to viewing preference, the other issues - particularly the out of sync audio - are not.  Needless to say, this is unacceptable - especially at this price and from Sony.  Don't let this deter you from trying out another Sony HDTV, just avoid this one.  (I actually picked up a 37\" Vizio 1080p for a few bucks more after returning the Bravia.  While I'm not crazy about its menu navigation, I have experienced no out of sync audio issues - it even has a menu adjustment for just such an emergency - and the picture is fabulous, with rich color and few digital artifacts.)", "Date": "January 12, 2010"}, {"Title": "Terrible Sound Quality", "Author": "Tutone56", "ReviewID": "R953XMII3MQ2D", "Overall": "1.0", "Content": "I purchased this TV for a bedroom.  It was relatively easy to set up.  The picture was just okay.  My complaint seems to be echoed here by other reviewers.  After about 20 minutes the sound quality was awful.  To hear it a normal volume I had to turn up the sound to about 50. At lower levels (10-15) I could barely hear the sound and there was a lot of static and noise. Not happy about the quality of this TV.", "Date": "November 24, 2009"}, {"Title": "DO NOT BUY THIS TELEVISION", "Author": "A Writer", "ReviewID": "R1A89HQMY26TF5", "Overall": "1.0", "Content": "I have had problems with the color fluctuating on this television since the day I got it.  Every time I call Sony they tell me to try some ridiculous thing like reset the TV or change the cables or whatever WHEN THE TELEVISION IS DEFECTIVE.  They sent someone to my house with a replacement TV of the SAME MODEL with the SAME problem, then came out again and put a new board in, same problem.  SONY refuses to replace the TV with a new model and keeps telling me it's my problem.  They also said they have had other complaints about the TV about the color and yet they do nothing about it!!!  I bought this TV when it was brand new and now I'm out [...] bucks and Sony couldn't care less.  I also work at one of the major TV networks in NYC and our entired network DOES NOT buy SONY products because of their poor quality and their poor customer service.  I would give this television negative stars if I could.  Stay away from SONY, they are terrible.", "Date": "February 1, 2010"}, {"Title": "Sound quality is terrible", "Author": "TechGuy", "ReviewID": "R2T9JBXOGM1KGV", "Overall": "1.0", "Content": "I had similar experiences to other people about the distorted and static sound at low volume levels.  This happened on 2 different TVs and is a real problem.  I do a lot of research and I was terribly disappointed with the quality of Sony.  I have always been a Sony fan, but obviously their quality is struggling.  The picture quality is great, but the noise issues are very disappointing.  I recently bought a Vizio for $100 less and I am very happy.", "Date": "December 19, 2009"}, {"Title": "Sony HDTV Greatness at an affordable price!", "Author": "Joseph L. Rodriguez", "ReviewID": "R2DV4BK92OEIGV", "Overall": "5.0", "Content": "Just received this Sony model on this past Saturday (day after Black Friday). Has worked perfect and it came (purchased from Amazon) with latest firmware update from August 4th. I was prepared and even had it downloaded into mu USB flash card but didn't need it. Image is pristine and looks terrific sending in 1080i from Directv and 1080p/24 Blu Ray from a PS3. Gaming also worked nicely. There are plenty of picture adjustments so tweaking to get the most optimal image will not be to hard. Sound was fine and with the latest firmware there has not been any buzzing. This 1080p HDTV for under 500.00 is a steal!", "Date": "November 29, 2009"}, {"Title": "Great TV, Great Price", "Author": "J. Pavlick", "ReviewID": "R1SXSQUG76QEM3", "Overall": "5.0", "Content": "This is my first HDTV purchase, and I'm quite content with everything about the set. The picture is great, there are ample inputs, and the setup was very easy. There are perhaps not as many picture tweaks available as on higher-end Sonys and Samsungs, but you are still getting a Bravia Engine 2 video processor in this set, and the price is really hard to beat. The only thing I'd like to point out is that one of the component inputs doubles as a composite, and you have to set which it is in the menu. This is not readily apparent in the manual and I found out by accident. Overall, I highly recommend this product.", "Date": "August 2, 2009"}, {"Title": "32\" Sony Bravia TV", "Author": "B. Ross", "ReviewID": "R1JW0BPIWV0FZ4", "Overall": "5.0", "Content": "I ordered this tv a couple of weeks ago and am very pleased with it and the speed with which it arrived.  I am not a techie and just wanted a good flat screen for my den.  I don't know what the other reviewers mean when they talk about a blurring of faces or things when there is fast movement. I have never experienced anything like that on any of my tv's.  I also own an LG 50 \" plasma and never had that problem on it.  The sound on this tv is fine for me and have no problems.  It was fairly easy to set up the colors to my satisfaction.  Something that I still haven't gotten right on my LG.  Overall I am very happy with the tv and with the service from Amazon.", "Date": "May 28, 2009"}, {"Title": "Awesome Right Out Of The Box!", "Author": "\"lola\" \"Lola\"", "ReviewID": "R9AORDFT19VYA", "Overall": "5.0", "Content": "I just bought this TV (3/18/09) and I am still playing with it.  It cost me $799 for the TV, $840 after taxes, $910 after purchasing 2 year purchase protection.  I just love it!  The colors are great, the sound is awesome, the sharpness incredible!  Easy to hook up to HD cable box, nothing to get it into the table top stand.  The HD channels look so real!  I am so glad I purchased this TV.  Once you've done your homework you'll see that Sony Bravia is the way to go!", "Date": "March 18, 2009"}, {"Title": "short life", "Author": "Boom", "ReviewID": "R328QSQS7PIUVW", "Overall": "1.0", "Content": "I bought this primarily to use as a monitor for my Vaio.  Getting the two to work together and get the correct resolution was a bit of work, but Sony support was helpful.  The TV worked great for about a year (and it has a one-year warranty).  After one year the screen would randomly get a dark yellow haze and the picture would act as if it were in slow motion.  This was for both TV and as a computer monitor.  Eventually it got unbearable and I had to replace the TV.I bought this because I thought Sony was a solid brand.  I have 2 other friends with the same TV and all they had to replace there's too after 2-3 years.  So much for Sony quality.", "Date": "August 7, 2011"}, {"Title": "Worst customer service experience in my life. Update doesn't work with Mac", "Author": "Slim624 \"Creative director. Dad. Southerner. ...", "ReviewID": "R1OVQHFICSW06U", "Overall": "1.0", "Content": "I'll never buy anything from Sony again after purchasing this TV. I have been on customer service calls 3 different times. Not only does the sound suck, my HDMI ports do not work on the TV. Upon first working with my cable company trying different HDMI cables, cable boxes and TVs, we discovered that it IS this TV which has a faulty HDMI port.On my first call with customer support, we tried resetting everything and then they suggested the firmware update which you download from their eSupport site. After downloading and saving to a USB, the update didn't work. So they were supposed to mail me the firmware update within 10 business days. That was Nov. 1st, 2010. I never received the update so I called customer support again near the end of November. Again, was supposed to receive the update via mail in 10 business days from that point. Again nothing.It's December 27, 2010 and my warranty is up today. I went and bought \"approved\" USB drives today to try again. Didn't work. So I decided to give one more call to customer support. After talking with the guy in India, he said my update is \"pending\" and I told him my warranty is up today and I need to replace the TV. He gave me a number to call and said to all them during normal business hours and he said \"they should be able to help you with the update and warranty\". So in other words, by 12am tonight my warranty is up and I will basically be stuck with this crap TV. When relaying this info to the customer service rep, he basically told me yes that I'm screwed.Goodbye Sony. It's all Samsung for me now.", "Date": "December 27, 2010"}, {"Title": "RG Shelton", "Author": "Russell G. Shelton", "ReviewID": "RHSIDQS1I2N0L", "Overall": "1.0", "Content": "Fairly good picture, having trouble getting light and contrast adjusted to my liking, the sound is the worst I have ever heard.", "Date": "May 2, 2010"}, {"Title": "Nice TV", "Author": "A. Ransom", "ReviewID": "R3U73AAF2J8SLC", "Overall": "4.0", "Content": "I love the TV and I've had it for about a month now.  Unfortunately, I don't have a blue-ray player, but the picture comes across great on Netflix through the Wii.  The sound is what you'd expect from a typical TV; nothing special.  If you want better quality, purchase a home theater set-up...  Also, I've noticed that the screen dims during dark scenes (not helpful), but later learned that this is in response to ambient lighting.  You can turn this feature off in the eco setting within the menu.  Works great now.  The stand is rather flimsy and plasticky; I'm only 150 lbs. yet every time I walk by the TV seems to sway.  I would recommend getting a wall mount if you can.  The only other thing I can think to mention is the appearance.  I kind of hate it.  I will say I'm very picky, but the bottom portion of the frame is horrible.  There is a clear strip that runs partially through the center that serves no aesthetic purpose unless you enjoy looking at cords behind the TV... Overall, I would recommend this TV to anyone.  The image quality is superb and it serves as an excellent addition to any room.", "Date": "April 29, 2010"}, {"Title": "Audio problems, seems to be a common problem", "Author": "T. Saldivar \"Targettee\"", "ReviewID": "R2SDLPQ7I62YT9", "Overall": "2.0", "Content": "Hi,I've just had the tv replaced, but the replacement has the exact problem.  Audio is awful at low volumes.  From reading others experience, this is common with this model TV.  What a shame, otherwise it is a nice tv.sincerely,bumbed outUpdate: 2nd replacement.  Had a certified Sony Technician come to try and fixed problem, he apologized, could not fix it.Update: third replacement, and guess what.  Same problem.  There is obviously a problem with a large batch of this model but they are not recalling them or fixing them.  By the way the third replacement TV we got was a refurbished TV.  After months of going back and forth, no solution yet.What a shame, I've been a sony fan since for over 25 years, this is my first bad experience.", "Date": "January 27, 2010"}, {"Title": "An excellent Entry-Level 1080p monitor", "Author": "Lang Chen", "ReviewID": "R3GWCORBCWDK15", "Overall": "4.0", "Content": "I bought this one for my kitchen to replace my Sony tube 24\" TV.  My set worked fine right out of the box. The color is not set to ultra stunning or too bright at default value.I noticed that the black level of the DTV signal was not to my expectation. I have two sets of Panasonic industrial plasma monitors, together with Sony's DirecTV/DTV receiver. I have been spoiled with the excellent black level from Panasonic monitors. No matter how I adjusted the color, brightness or \"Picture\" setting, I cannot get a satisfactory result.Then I changed the setting.  Instead of using the build-in DTV tuner, I used Sony's direcTV/DTV external tuner.  Immediately, even both of my sons noticed big difference. The black level meets the plasma level (especially on full HD football programs). Until then I discovered what this Sony TV can deliver!  Well, that picture is perfect, with Vivid colors (I am not talking about the exaggerated \"VIVID mode\" here. I meant a more realistic and rich colors) and deep black (but not to the point that you don't see shadow details.)I was only using the component connection. Notice that the commercials always mentioned that the HDMI is the best connection.  However, it depends on the video converter of the TV set and that of the source set.  If you use a high-end Blu-ray or DVD player, the component output may seem better than HDMI output because the video converter on the DVD player is better than the video converter on the TV set.  However, if the TV is also good, then you may (not must) get a better picture through the HDMI.  It depends! For this Sony TV, I tried Toshiba HD DVD player HD D3 (Or HD A3), it is an excellent DVD player too. I compared the component with HDMI and found that the HDMI renders a hair sharper image with very slightly detailed colors. The component wire is not the top-notch here. So the little \"worse\" image from component could be caused by either slightly inferier video converter from Toshiba or by the inferier component cable. I cannot determine here. However, with the Sony digital DirecTV/DTV receiver, I prefer the signal from the component input. Or at least that I can hardly tell which one is really better. So if you don't have a previous HD connection, buy HDMI.  Otherwise, do some brief \"comparison\" work before you decide which connection to use.Anyway, the picture quality of this Sony is satisfactory.  The 60hz refresh rate really does not matter that much when I view the HD football games.  However, the 1080p makes difference when you view close by the TV (This TV is in the kitchen).  Also it looks better too if you use as a PC monitor.  I did hook up my Dell Latitude to this Sony and the picture looks very clear and vibrant. I never expect the sound from stand alone TV set to be good. For the news in kitchen, it sounds ok. I hear talks clearly. Don't use its build-in speakers for concert purpose. I have a Denon receiver and Celestion speakers in my kitchen. So the sound is not a problem to me with this TV.Over all, it is an excellent choice as a monitor.  However, as a stand-alone TV, the picture may suffer a little washed-out. The sound may not be able to compete with the best but it is still ok, clear highs, low/no base.  I would give this Sony 3+ stars as a stand-alone TV but 5+ stars as a monitor.  That's why you see 4 stars on my rating.  But for my purpose, it is a solid 5-star monitor!", "Date": "January 5, 2010"}, {"Title": "Our Best Sony TV Yet", "Author": "Iris Dunson \"irisfromohio\"", "ReviewID": "R11OK2L75BAR2N", "Overall": "5.0", "Content": "Two decades ago, we became committed to the idea that for our family room/most used TV, it had to be a SONY. We had the WEGA and last year moved up to this one. Our home is small, so we prefer not to have anything larger than a 32\". It just isn't necessary. But the picture & quality, durability, ease of use.... just about every piece of criteria by which a good television is judged places this one at the top. Yes, some of the competitors have good products and for a kid's room or extremely limited budget, I give them a nod. However, we couldn't be more thrilled with this television and accompanied by Blu-ray, you almost nix the notion of the theater experience.We paid a little more for it, making the price Amazon offers the deal of the century!", "Date": "January 4, 2010"}, {"Title": "Great TV", "Author": "J. Hennis \"JenHen\"", "ReviewID": "R3SRPV17LCA47O", "Overall": "5.0", "Content": "Delivered by Amazon as promised. TV works great! All we have is Sony's in our house, all purchased from Amazon & never have had a problem. I recommend this TV to everyone!", "Date": "August 14, 2009"}, {"Title": "Sony almost has it right", "Author": "T. Heath \"theath\"", "ReviewID": "R3UB0ZAOFUQ8IB", "Overall": "4.0", "Content": "I enjoy this HDTV very much and the picture is 1st class.  My only issue deals with the sound quality. I find it is necessary to turn the volume up quite a bit to understand what being said on TV.  There is a setting \"clear voice\" which eliminates this problem but you must turn off the simulated theater stereo/5.1 setting.  In a nut shell if you want to understand conversation on TV at a normal volume you need to listen in mono.  I am looking to purchase a theater system to hopefully correct the problem.", "Date": "July 8, 2009"}, {"Title": "This was my first TV!", "Author": "Roberto Aleman Jr.", "ReviewID": "R815VHKA6Z0S7", "Overall": "5.0", "Content": "I bought this TV four years ago around the same time I bought my PS3, and it has served me unbelievably well. I've used this TV to watch cable TV, to play on my PS3, and even as a computer monitor.Unfortunately, I've never made myself an expert on the significance of technical specifications for TVs in particular. Luckily, I had a friend who was and he directed me towards Sony's Bravia series and I've been happy with the quality since. Maintaining and cleaning this TV is a breeze, and so is updating it (via a USB and simple instructions).I'm sure more modern things have come out since, but this will always be a great buy in my book.", "Date": "December 14, 2013"}, {"Title": "Excellent product", "Author": "William K. Cunningham", "ReviewID": "R23IM6J4FF39G9", "Overall": "5.0", "Content": "I have been using my Sony in the kitchen area for two or three years.  It has performed perfectly with an exceptional picture.  What more can you ask from a TV than it provides an excellent picture with no problems.  I have a larger Samsung in my living room with a similar experience.  I hope that my expectations are not just a fluke with tvs that meet them.", "Date": "February 10, 2013"}, {"Title": "Exellent", "Author": "Erik Robert Rosenkrance", "ReviewID": "R3HHNXWCOCPB4I", "Overall": "5.0", "Content": "It's great I've had it for over 3 years now is performing as promised and I can't say enough about it. It's awesome to work with my ps3 turns on automatically through the HDMI cable is 1080 P 032 inch you know I mean just perfect for any room a bedroom", "Date": "November 29, 2012"}, {"Title": "Worked well for 2.5 years but seeing ports fail now", "Author": "M. Prentice \"Splaktar\"", "ReviewID": "R2XV4J7DTNERO7", "Overall": "2.0", "Content": "I bought this TV 2.5 years ago and I was quite happy with the price and the TV for quite a while. I have not applied a firmware update to it yet.The only long standing issue that I haven't been able to resolve is that for a dark scene on the TV, the TV will dim so much that I can't see the details of what is going on. This happens in dark and well lit rooms. I've tried messing with the settings and turning up the backlight and brightness, but it hasn't really helped.The picture is clear and crisp and the blacks appear quite deep. I got it mounted up on the wall with no problems and the side ports are really helpful. But trying to access the rear ports while it is mounted is a major pain.My largest problem started only 2 weeks ago. I've been using my PS3 via HDMI for 6+ months with no real issues. Sometimes it seems a bit slow for the TV to recognize HDMI input from any source, but it generally worked. But now I've had my HDMI 1 and HDMI 2 ports completely fail. I want to attach DirecTV and the PS3, so I need 2 working ports. But now I've found that I only have a single HDMI port that works. I haven't used the ports all that much and the TV hasn't undergone any real traumas, so I'm not sure what the issue is other than just poor build quality.I'm currently in the market for a new 60\" 3D LED TV and these issues with Sony quality have me quite worried. I've more or less picked out a KDL60NX* but I'm having second thoughts now. I didn't order a 5 year extended warranty with this TV (didn't know that it was available or it was not available), but I guess that I will need to purchase one for my new TV.", "Date": "September 7, 2011"}, {"Title": "Typical Sony proprietary BS", "Author": "MARS from LA", "ReviewID": "R1RIWBXM28S762", "Overall": "1.0", "Content": "The dongle needed to be purchased for wifi access should be noted in large bold-faced letters on the box and or on the internet before all else.  The TV software is updated regularly and it loses your settings for amazon video.  Remember your password for SONYSTYLE als it will not forward password resets correctly.  SONY, get your act together.  Had similar problems in past with their itune version (weak).  Burned again by Sony.  TV istself is fine, but since I purchased it for Netfix and Amazon video and it works sporadically.  I must give it a 1 star rating - look eslewhere.", "Date": "August 8, 2011"}, {"Title": "Replace Screen Display after 12 months to the tune of $650!", "Author": "Blondie", "ReviewID": "R16HOS89YSRDCL", "Overall": "1.0", "Content": "I purchased this TV via Amazon.com on January 11, 2010.  On January 27, 2011, the screen went black, when I took it into the repair shop, they said I needed to replace the screen display to the tune of $650.00 - more than I paid for the TV ($500).  When I asked the technician if this was unusual after only a year, his replay \"these TV's are built for price, not for quality\".  Now, I embark on the long journey to see if the mfg warranty will cover this - I'm taking bets!", "Date": "January 29, 2011"}, {"Title": "Do not buy this TV!", "Author": "Lance", "ReviewID": "R3L3ZUL9SAKJ6O", "Overall": "1.0", "Content": "I bought this TV sight unseen assuming that it would be a quality product because of the brand name.  I was wrong.  The picture is not nearly as good as other brands in this price range, and I have had an intermittant problem with the power supply for the last 3 months.  The TV would turn itself off randomly, without any timers being set.  Tonight the TV fails to turn on, and Sony customer service fails to help.  I now have to take a TV ,that I still think of as new, to the repair shop.  I bought this TV 1 1/2 years ago.  Of course the warranty expired in one year.  I have never had to repair any other TV I have owned.  Very dissappointed in Sony products.  If this TV is unable to be repaired then I will be purchasing one from a company that is better known for their craftsmanship.", "Date": "January 28, 2011"}, {"Title": "Where has Sony QC gone???", "Author": "blenderchild", "ReviewID": "R2RJ9GT9NJKYOU", "Overall": "1.0", "Content": "I've managed to experience all of the glitches reported with this set:- audio cuts out (almost like old school station drift) from cable box. channel must be changed in order to rectify.- \"Red flash\"  where set tries to resolve background and skin tones... shifts back and forth continuously from red to neutral colors. VERY annoying. (try watching a hockey game, or an episode of the Office)- HDMI inputs seems to often not pick up signal (even working with SONY PS3 and SONY Sound Bar)On the plus side, black levels and resolution are good...UPDATE 1/2011: Even the 'easy' firmware update via USB does not work for me... looks like the USB port is shot and does not read the software on the stick (sent from Sony).  So now I am completely screwed and can't even take advantage of the firmware update. It's not worth having a tech look at the POS now that it is out of warranty.  Wow. Next set will be Samsung...", "Date": "December 23, 2010"}, {"Title": "Sony HDTV", "Author": "Larry H. Carl \"Lee\"", "ReviewID": "R1LKM54YR8IQES", "Overall": "4.0", "Content": "I am pleased with my Sony HDTV. It provides a high quality picture. I would rate it as similar in quality to Samsung.", "Date": "November 2, 2010"}, {"Title": "The Sony HdTv 1080p 32in s-series is awesome", "Author": "HarryC78", "ReviewID": "R1EAOWV1U8XTMG", "Overall": "5.0", "Content": "Thank you for the product. It is great the picture and sound qualities is the best state of the art. I would definite recommend friends to buy this TV at Amazon. The shipping was fast and everything was all brand new from the box.", "Date": "October 11, 2010"}, {"Title": "check thiss out", "Author": "James Williams", "ReviewID": "R3FEKBJ009VKBS", "Overall": "4.0", "Content": "thinking of getting bravia KDLS1500 but now i'm thinking twice after reading some reviews. my maw has the KDLS1500 and she has not had any prob. right now i have a new samsong and i cant get the stretch look out. its connected to my dellpc. On my moms kdl it can be put on zoom and that takes the stretch out. also i cant get the screws all the way in on the back. i'm stuck on wich one to go with. im still within the return option.", "Date": "October 3, 2010"}, {"Title": "I'm 68years old male", "Author": "Chiharu Nishikawa \"Maro\"", "ReviewID": "R2ELAD4VPNVY9H", "Overall": "2.0", "Content": "I do not trust Sony's Tech or Customer Service.A this unit was a refub.I had plan to use this  TV to as PC Monitor.Any way price was not bad so I ordered.Sure when I received PC connection was working Video and Audio but, When I switched HDMI port Audio is not working.I have two other 52\" Sony LCD TV thorse ones are works fine.I hooke UP Antenna, TV works All Channel but channel change time rug is way too lomg than others.My kitche's Vizio TV channel changes instantly.", "Date": "May 9, 2010"}, {"Title": "Main Board Failure", "Author": "M. Sue Mullaney", "ReviewID": "R3OHATQWR3K910", "Overall": "1.0", "Content": "Purchased the TV for the guest room 22 months ago. Therefore,it has been used very sparingly. A recent guest turned on the TV and there was no picture ,only wavy pixels. Sony sevice was contacted. After being on hold for several minutes,I was instructed to contact a local authorized service center. TV was taken to the center,who called back with a repair estimate. I was told the main board was defective. Total cost to repair=$493.Called Sony to request out of warranty assistance since the TV has such little usage in less than 2 years. After being passed around for an hour,I was told Sony would not share in the cost of the repair.After analyzing the situation, Instead of repairing it,purchased a new 40\" Samsung.Very disappointed in the Sony experience.Will never buy another one from Sony.", "Date": "April 13, 2010"}, {"Title": "KDL-32S5100 LCD TV with Sony blu-ray player", "Author": "Michael Lamson", "ReviewID": "R1IM3JCL8WNVZV", "Overall": "5.0", "Content": "I have had this TV four days and it has passed all acceptance tests. Dealing with a sub-contractor (Home Theater Store) of the merchant is a bit annoying and would be troublesome if there were damage or defects, but that did not happen. The tests were all run with a new Sony BDPS360 blu-ray player. I bought these products for the up-conversion of my collection of classic, irreplacable, out-of-print dance videos. The results so far are excellent.The oldest performances (e.g. the American in Paris ballet) look much better, showing much more detail of costumes, backgrounds, and expressions. Minelli reds no longer bleed. The image is somewat distorted; perhaps tinkering with the settings would help this. There is no technical information provided by Sony to help you with this.The newer dance videos (e.g. Kirov Dances Nijinsky) are breathtaking, better than a live performance in many respects when the camera work is first-rate.The only Blu-ray disc I have tested (the Robert Downey Jr. Sherlock Holmes) did not show much improvement over the upconverted DVD videos.The TV and player are very easy to use -- just load the disc and the player takes over the TV and figures out how to play it. It was easy to attach the stand. On the other hand, the setup instructions for the TV are wrong for satellite TV service.", "Date": "April 9, 2010"}, {"Title": "Using as a PC monitor", "Author": "Christopher Philip Westra \"Stimp\"", "ReviewID": "RRG8Q44KWNT4D", "Overall": "5.0", "Content": "Purchased this HDTV to use as a computer monitor for use in drawing/art software. The large screen makes working on PC much easier with much less eye strain. The image is excellent and exceeded expectations! Great for surfing web and reading mail/news etc. I also have game system hooked up as well and is amazing in the richness of color and contrast. In summary I do not regret this purchase and would recommend this product.", "Date": "April 3, 2010"}, {"Title": "Excellent tv for the price", "Author": "Abhijit Savant \"Abhijit S\"", "ReviewID": "R11ACMRGIELN0G", "Overall": "5.0", "Content": "I got this tv a month ago through a very good deal on Amazon. Its a great tv for its price with good picture and sound quality. I have not experienced any issues with it, its just one month old though. But I trust sony. Excellent product. Would recommend it to friends and family.", "Date": "March 21, 2010"}, {"Title": "Sony Bravia", "Author": "Steven A. Maaranen", "ReviewID": "R32I8AAT3M35F7", "Overall": "4.0", "Content": "The supplier delivered the item very promptly and in good shape, and kept me informed of shipping progress. The TV is the same model as two others we have in the house and performs equally well. There are slight and easy to understand changes in the menus from our other Sony TVs, purchased last year.", "Date": "March 15, 2010"}, {"Title": "sony tv", "Author": "Barbara K. Saiki", "ReviewID": "R19V816A5UFGYY", "Overall": "5.0", "Content": "excellent visual and ease of use....Sony Bravia S-Series KDL-32S5100 32-Inch 1080p LCD HDTV, Black", "Date": "March 7, 2010"}, {"Title": "Great for a computer monitor", "Author": "S. R. Bryan \"srbryan\"", "ReviewID": "R28Z94WS4VYWK9", "Overall": "4.0", "Content": "Not a lot to say since I own 4 Sony Bravias now, I kind of knew what I was getting. I use this particular one for my desk at the office and it works perfect through the VGA @ 1920x1080. Everything is clear and it fits the entire screen. I don't use the TV speakers so I have no complaints about the sound however other reviewers are really complaining about this \"sound issue\" and rightfully so according to their reviews. I would be careful of that but as for everything else, the TV works as intended.Minor note - initially for some reason I kept getting a \"no signal\" error on my screen even though my pc card was actually pushing the signal (it was set up as a multiple display and I could pan my mouse over to the Bravia). Other than a few minor hiccups it's worked perfectly. I just thought I would note that and that it has been working just fine since.", "Date": "February 12, 2010"}, {"Title": "Love it!", "Author": "Jennifer L. Mayes", "ReviewID": "R3L6BE7PHRFTUX", "Overall": "4.0", "Content": "I have no idea what ppl are talking about with the sound issues?  I've had mine for 5 months now with not one problem.  The sound is just fine.  I'm no its not a sound system, but for speakers on a tv they are very loud.  I keep mine usually at the 13 setting.  The picture quality is great!", "Date": "February 11, 2010"}, {"Title": "Great gift", "Author": "C. Degrove", "ReviewID": "R37540EC5LNAZV", "Overall": "5.0", "Content": "I purchased this for my girlfriend's birthday and we absolutely love it.  The picture quality is amazing and I could not ask for a better product.  The only problem is now I need another one for myself.", "Date": "February 8, 2010"}, {"Title": "Value and Quality", "Author": "K. Mays \"student\"", "ReviewID": "RGUK7LIU20OOQ", "Overall": "5.0", "Content": "I am impressed particularly with the sound on this tv! The built in speakers are above par when compared to similar products.The menu is simple and I appreciate all the features. Picture is true Sony brand quality.My only qualm, and this is superficial, is that when the inputs are to the side of the tv (probably for ease of insert if it is mounted) the cords can stick out beyond the tv. I just don't care to see my VGA cord sticking to the left instead of just heading straight down the middle. Then again, I am glad to have the PC input at all.Remember it doesn't have an HDTV tuner built in (for those who don't subscribe to cable)Finally, for the price you can't do better!", "Date": "February 7, 2010"}, {"Title": "Great 1080P TV", "Author": "David W. Monteith", "ReviewID": "R3129VDE4PWCBI", "Overall": "5.0", "Content": "I recently purchase this TV and I couldn't be happier. Perfect size for a bedroom or college dorm, and my bluray movies and videogames look great. The new firmwire on Sony's site fixed all the audio issues, all you have to do is download it to a flash drive. If your buying a 32 inch TV there is no better choice, buy with confidence", "Date": "January 30, 2010"}, {"Title": "sharp picture!", "Author": "V. J. Fortin", "ReviewID": "R1C2RGP7SOW3GW", "Overall": "5.0", "Content": "the picture on this tv is amazing,so sharp and clear,color is right on the mark.I'm not so electonically inclined but set up was a breeze on theSony Bravia S-Series KDL-40S5100 40-Inch 1080p LCD HDTV, Black", "Date": "January 17, 2010"}, {"Title": "Good price.", "Author": "Rona J. Donahoe", "ReviewID": "R32BQ897S3Y06A", "Overall": "5.0", "Content": "Best price we found anywhere.  The TV is what you expect from Sony: sharp, bright picture with good color.  Our daughter is very happy with it.", "Date": "December 30, 2009"}, {"Title": "Bedroom TV with alarm feature", "Author": "Dismoe \"Maureen\"", "ReviewID": "R183I3L365OB1I", "Overall": "5.0", "Content": "If you want a new bedroom flat screen TV 32 in., 1080 HDTV with an alarm feature, NO, not a Sleep Timer, this is the one.  I searched and finally found the Sony Bravia.  Alarm feature wakes you up at a certain time with a certain channel and the ability to determine the volume, and shuts off at a certain time. It's just what I wanted.", "Date": "December 28, 2009"}, {"Title": "Excellent HDTV", "Author": "Harold R. Becker", "ReviewID": "R1X1SLJGTO02EP", "Overall": "5.0", "Content": "Great TV for the price and size.We have several Sony products and have had excellent service from them all.We would recommend buying this TV.", "Date": "December 28, 2009"}, {"Title": "Very nice quality!", "Author": "David H. Ou \"david ou\"", "ReviewID": "RKC70Q7TZ4A4W", "Overall": "4.0", "Content": "When I first received this tv, it wasn't very good in quality. So I went to [...] to calibrate what was recommended for this tv. It looked amazing afterwards! Changing the colors really made the tv look so much better. The sound is very loud. Even at volume 1! The only problem I had was. Everytime I set calibrate the tv, it resets every time! So I had to buy a compatible usb flash drive to update the tv. After so many attempts, finally got it! Settings stayed the same, no more auto adjusting or anything! Played uncharted 2 with original tv settings. Oh man the game looked ugly! After calibration, just wow waaaay better. Recommend tv if you don't mine updating...", "Date": "December 25, 2009"}, {"Title": "Great TV", "Author": "Bigdaddy1", "ReviewID": "R2L6OFN7FMW0QK", "Overall": "5.0", "Content": "This television is excellent! Easy to install and connect to an HD provider. It was lighter then I imagined and has a clear Vivid picture quality. My dvd's look even better on this screen, I am completely satisfied.", "Date": "December 24, 2009"}, {"Title": "Sony Bravia sound quality", "Author": "S. Brown \"Jamaican\"", "ReviewID": "RE3XVPW93H8N6", "Overall": "3.0", "Content": "I like the TV, but I wish I would have saved for a bigger one. Also, sometimes when I am watching television, the sound just goes out on me and it's not muted.  I hope the speakers are not going bad! It is supposed to be brand new.  I've considering sending it back for a refund.", "Date": "September 24, 2009"}, {"Title": "Warning to Buyers: Need to Update it, but VERY VERY EASY", "Author": "Hasan Erkaya", "ReviewID": "RDP7ZQ1LHNJ9V", "Overall": "5.0", "Content": "This TV is amazing for your kids or a sub-room. For your main room, maybe not. However, the quality is flawless, especially if youre using HDMI cables to view it.Anyways to the main problem: The TV does require a firmware update. However, DO NOT BE SCARED. the only thing you need for the update is easy; a USB Port and 1 free program which takes 35-45 seconds to download from the website. Heres the link to the update:[...]Download this and put it on a USB port. The one bad thing is that the TV DOesnt read MOST USB ports, but keep trying different ones until it works. Once you update it, MOST problems will go away, ive had this TV for a while and never had a problem. I updated it and still have no problems. But as people know SONY always stands by their products.Good luck to all buyers", "Date": "November 18, 2009"}, {"Title": "It's Beautiful", "Author": "Ray Shackelford", "ReviewID": "R17WCJEGAXQNEZ", "Overall": "5.0", "Content": "I've spent the greater part of three months reviewing everything on the market.  But I always came back to the Sony full HD S series 32\".  I have cable with no HD set-up as yet.  I was hoping the Sony would give me a much sharper picture even without the HD.  (HD is coming to my area)  And it did that Big Time.  I plan on buying a Blueray next week with the Sony Soundbar System.  The Piano Black Laqure finish is beautiful.  It's surpassed all my expectations and blew by all the nay sayers and boy critics.  It simply doesn't get any better for the money.", "Date": "June 9, 2009"}, {"Title": "good set", "Author": "mistermaxxx08 \"mistermaxxx08\"", "ReviewID": "RS9J6W1LX8IE", "Overall": "4.0", "Content": "i really enjoyed the set and the visual is nice  and also  the sound.i dig the picture and tne way everything comes into viewreal easy and able to see.  i enjoyed the picture quality and overall tone and feel of the set.", "Date": "December 11, 2009"}, {"Title": "Newton's Sony Bravia Series Review", "Author": "Summit Credit Union", "ReviewID": "R15AA0V1ESREVZ", "Overall": "4.0", "Content": "I think this TV is good but in some cases i wish that they had more for this 32\" TV, like i wish that they had more video input for the back, but they only have one for tha side which is your main video. But everything else is good nothing bad about it.", "Date": "December 10, 2009"}, {"Title": "Not The Cheapest...But You Get What You Pay For!", "Author": "D. Harmon \"Retired Military Officer, Retired ...", "ReviewID": "R2G3RND4J0MYMQ", "Overall": "5.0", "Content": "Terrific picture, great audio and a pleasure to set up.  This Sony has excellent features and it even looks good.  I bought this one for bedroom use and it fits nicely.  Not cheap, but you get what you pay for and the expenditure was worthwhile!", "Date": "April 29, 2009"}, {"Title": "Great value!", "Author": "TV Reviewer", "ReviewID": "RJI0OI4ND2QP2", "Overall": "5.0", "Content": "I've always been a Sony fan, and this is our 4th set.  Amazon had the lowest price, and the delivery was prompt and professional.  Our TV arrived as promised, on schedule, undamaged.  The wait was only a few days, and we saved over $200.", "Date": "September 29, 2009"}, {"Title": "Sony BRAVIA 32\" HDTV 1080p", "Author": "David M. Boardman \"David M. Boardman\"", "ReviewID": "R14PT0VEVTFGXI", "Overall": "5.0", "Content": "As usual, great service from AMAZON with shipment on time as promised.  BRAVIA providing marvelous pictures both from station transmission and DVD/VCR playback.  A great product at a great price!!!", "Date": "May 21, 2009"}, {"Title": "great tv", "Author": "Erik T. Johansson", "ReviewID": "R3SHX3Y6PGFGRZ", "Overall": "5.0", "Content": "I bought this tv for my dorm and it is awesome everything looks so nice.  Great tv ands the price makes it even better.", "Date": "September 13, 2009"}, {"Title": "Very good sounding HDTV", "Author": "G. Laberman", "ReviewID": "R3C5Q8FW7H7B1G", "Overall": "5.0", "Content": "I got this TV for a bedroom and wanted something that sounded good because I was not going to put a sound system with it. Many of the flat panel TVs sound so tinny.", "Date": "April 19, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full Hd 1080P Resolution And Stunning Contrast\nFeatures Advanced Contrast Enhancer (Ace) For An Impressive Dynamic Contrast Ratio Of 30,000:1\nDigital Video Processor For A Superior Resolution\n2 Component And 1 Pc Are Provided To Connect All Of Your Hd Devices Including Playstation 3\nHigh-End Quality", "Name": "Sony Bravia S-Series KDL-32S5100 32-Inch 1080p LCD HDTV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41RUrQ%2BINRL._SX300_.jpg", "ProductID": "B001T9N0D0"}}