{"Reviews": [{"Title": "Let me clear up some misconceptions...", "Author": "hunter_aran", "ReviewID": "R1EZNV5XPKAFNE", "Overall": "5.0", "Content": "This is a great HDTV. Hands down is one of the most beautiful displays in this size. You can buy a fancier ultra-thin 32\" TV from Samsung right now but it's almost twice the price!Pros: The blacks are black! When you start it up, the Bravia logo appears on a black background and it's as black as when the TV is off! People say that edge LED lighting will make the blacks truer with less backlight bleeding but this TV is already great in this aspect. The colors and settings are very good out of the box for a few of the styles but need adjustment like any TV. The nice thing is that when you change your input, the TV remembers all the settings for that input! So it's like you never have to re-adjust your settings unless you plug your stuff in differently.The motionflow frame interpolation technology is astounding! 120HZ with the motionflow is  worth every penny for bluray and other high-def sources. That's why I waited for this over the XBR6. I however prefer the lifelike \"soap-opera\" look, but that's me (I have to say PE or the Pirates movies look stunning with it on!). You can turn it off or have this appear more more subtle (the default). The motionflow is basically a side-effect of the necessity to combat blurriness and the staggering \"judder\" effect inherent to LCDs. It adds one or more frames in between each frame of your source by interpolating entirely NEW frames that were never there by the TV's processor. technology is amazing, isn't it? You have to see it in person to get exactly what this looks like. Other companies are following suit but I find others like the 32 TOC Samsung have more motion artifacts (basically errors ie grabbing parts of the audience behind a fast-moving player in a sports event and dragging them along for the ride). Sony's Bravia processor is second to none. For upconverted sources not originally in 1080 and compressed 1080 cable, the motion technology is less noticeable. So the overall effectiveness depends on how clear the material is.This is important--with the game mode on, which turns off most processing, there is almost NO LAG. I am one of those demanding gamers who is very sensitive and complains about miniscule things like how much play there is in a joystick. So I can tell you that there is still a little lag but the game mode makes fast games like Smash Bros and shooters play like my CRT. So losing the motionflow in the game mode might seem bad, but it's only a small difference especially on something like the 480p Wii. And Wii games with anti-aliasing like Metroid Prime 3 still look AWESOME in contrast to what most say. The PS3 does look AMAZING either with or without motionflow anyway!Cons: Not many but the sound is tinny. What do you expect from such small speakers? If you spent this much on a 32 TV and don't have speakers then you should not complain.There is no headphone jack. I use a mixer with a control-room out to get around this and it works fine.The autodim is annoying but mainly happens for me when the room is VERY dark. In normal light I do not see it. And you cannot turn it off but with as many people as are complaining about it, all Sony has to do is release a firmware update to allow the switching on and off of it (Sony, are you reading this?)...CLARIFICATIONS-----Here are some points that I thought were incorrect in some other reviews so I felt compelled to make this clear to potential buyers.Okay some people just don't do their research in TVs. Sony's top line of HDTVs is the XBR line. The XBRs are split into the standard and then two higher end levels. Last year we had the XBR6s (standard XBR), XBR7s (larger fancier models) and XBR8 (larger still fancier models). This XBR9 IS NOT A REPLACEMENT FOR XBR8!! It replaces the XBR6 and the XBR8 was WAY more money and there was not even a 32\" one available! The reviewer who complained about there being no LED backlighting is wrong in getting upset because the XBR6 never had LED lighting and the XBR8 is a higher end unit which is different that the XBR9s. Sony will undoubtedly release an XBR10 and XBR11 or something to replace those two higher lines. Maybe in the next few years Sony will add edge LED lighting to the standard XBR line unless something like OLED takes off...Next the TV takes about as long to start up as my over 10-year-old Sony Trinitron 32\" XBR CRT does. Some models take longer some don't but it certainly is not 30 seconds! That reviewer must have gotten a problem unit or need a firmware update or something. Also, to change input, all you have to do is push \"Input\" then push that arrows up or down and that's it. Wow if that is too much for you, then technology is not your thing. Maybe you should hire someone to push the buttons for you so you don't have to. Come on.The thing has many inputs and, yes, some are on the side. On bigger TVs this would probably get covered up so on this one you can see some cabling if you have a thick cable that cannot bend easily. If you are clever you can use the cord-management strap to clean this up but my thick Monstercable does not bend that easily so I do see it. Oh well. So with thinner types of cables that bend back easily you should be fine. It's common knowledge that you get the same quality in a $5 HDMI cable as a $200 one because it is digital; getting a cheap thin one should solve the side cable-view problem. I wanted a more durable cable though.This is a relatively high-end HDTV that means it's designed to be used primarily to view HD content over a HDMI cables. That's why over half it's inputs are HDMI. So if you have a ton of stuff in composite or component, sorry, but Sony is trying to cater to the people who utilize the TV primarily for what it was designed for. Get a splitter/switcher or upgrade your cables to HDMI because, again, no matter how crappy your HDMI cables are, there is NO signal loss. There's an advantage to update anyway.Also contrary to popular belief numbers across different manufacturers ARE NOT EQUIVALENT. So comparing Lg to Sony to Samsung is not at all accurate. Think of comparing HP numbers in cars--measuring at the flywheel or tire gets you VERY different results and this often misleads consumers. Trust your eyes on a calibrated set with the same source. I can tell you this TV has more than enough contrast and is improved over last years model.----So far I have not had any problems with the TV and it looks amazing. I would recommend this to anyone and if you are internet savvy and find a good company to work with, you can find it for only slightly more than the closeout or last-year's KDL32XBR6 model--about $850 (or less, as in my case) :DEDIT: Thanks to other posters for mentioning this--Sony has released a firmware update that apparently makes the menus easier to navigate (faster?) and FIXES THE AUTODIM PROBLEM! I am trying to figure out how to install it now...", "Date": "May 5, 2009"}, {"Title": "Great TV, but a Few Issues", "Author": "Liann", "ReviewID": "R1YJ965JEZLBYI", "Overall": "4.0", "Content": "First, let me say this TV excels on many levels.  Picture quality is great, pre-set picture settings are almost spot on, but plenty of flexibility to adjust, decent off-angel viewing, matte screen deals well w/ bright lighting (we have a lamp directly across from the TV and only notice a reflection in truly dark scenes), and of course the long history of Sony quality standing behind it.  However, unless the 120hz is a must for you, see if you can get your hands on a XBR6 on clearance.  The XBR9 doesn't add much more, and you do lose some features, like the on-screen tv guide, PAP/PIP, and the proprietary input for things like the ipod dock, etc.Minor Issues:  Sound quality is decent for a TV of this size, but audiophiles will want to add an external speaker system.  The bezel is highly reflective, which can be distracting depending on the lighting in the room.  Another thing to note is that the input menu has to be navigated with the arrow keys on the remote - can't just keep hitting the input button to scroll through - so depending on your satellite or cable remote, like us (we have DirectTV), you may not be able to use it to change inputs, and will have to use the Sony remote to switch b/t the SD box and HD antenna.Major Issue:  The biggest drawback on this set, for me, is the function that automatically adjusts the backlight based on screen brightness, and, so far, we cannot find any way to shut this off.  (Note, this is NOT the same as the light sensor, which you can, and I think should disable, as I think it produces kind of a muddy picture in all but optimal room light conditions.)  For average viewing, this is not a problem, and we did not discover the issue until watching The Prestige on TV a few weeks ago - the movie has many dark, candle/lamp lit scenes, and the dark-bright-dark-bright adjustments made the movie almost unwatchable at times.  It wouldn't be so bad if the adjustment was smoother, but generally a couple of seconds after the screen brightness changes there is a abrupt and significant darkening or brightening of the screen.  So if your main interest is gaming or watching movies that tend to have a lot of dark scenes, then this might not be the TV for you.  Even though we use this TV mainly to watch TV and the occasional DVD from NetFlix, and so will probably have to deal w/ this only occasionally, it's distracting enough when it does happen that, if we'd known about this issue in advance, we probably would not have purchased the TV.", "Date": "April 4, 2009"}, {"Title": "Sony has fix for backlighting problem in the advanced contrast section.", "Author": "Ara \"Ara\"", "ReviewID": "R3MER6D4I1U14M", "Overall": "5.0", "Content": "We were unhappy with this TV and then found that Sony has fixed the back light issue so you can adjust it or turn it off and this has fixed the screen changing from dark to light with different scenes.  It was easy to down load this onto a usb memory stick and the TV automatically did the update.  The channels seem to change faster also. Here is the web site for downloading it from Sony - just make sure you follow all of the steps and read the info first.  They will mail you the update on stick also.[...]Darlene", "Date": "May 27, 2009"}, {"Title": "New or Return Unit?", "Author": "Bruce Norman", "ReviewID": "R3QSU0MP4VOMD9", "Overall": "4.0", "Content": "We bought this for our master bedroom - my wife loves the picture, thinks the sound is fine and doesn't mind waiting for 30 seconds or so for the TV to \"boot up\" as she believes that following the Energy Star guidelines is the right thing to do.The one issue we had is that this unit had clearly been opened previously. Although the box was sealed and it was delivered by the outfit Amazon uses in our area, when I opened the box, it was clear that this was probably a return unit. The packaging was not sealed with blue tape that you often see on Sony products and the screws for the stand were missing. I called the Sony hotline and they were very nice and willing to send me the four screws, but it would take about a week or so. So, I asked the agent for the size of the screws or the part number which took her only about 2-3 minutes to retrieve. She didn't know the size, but when she told me the part number, it was obvious that the 4 missing screws were metric (M5 X 12). So, a quick trip to ACE yielded replacement screws for 19 cents apiece and I was able to attach the stand and set the TV up.This experience has made me wonder about how carefully Amazon is monitoring its vendors. This was clearly not a factory-sealed item - so one immediately jumps to the conclusion that there might be other ways to sell items for less than just volume buying. However, I must say that our general experience with Amazon has been outstanding, so this could just be a one-off, isolated incident. Anyway, if you end up needing the correct screws to attach the stand, now you know to purchase M5 X 12.", "Date": "May 4, 2009"}, {"Title": "MUST READ - A step in the wrong direction for SONY KDL-32XBR9", "Author": "Dennis Otieno \"Ukweli\"", "ReviewID": "R3OWLTAQ6CZ6JK", "Overall": "3.0", "Content": "MUST READ - A step in the wrong direction for SONY KDL-32XBR9I bought two of these TVs a week ago and just set one up a couple of days ago. I am a true sony fan since the WEGA editions and have stayed true to them. My largest screen 46\" is the an XBR5 model and I have loved it since. So when it came time to buy TVs for my bedrooms, I naturally thought the latest XBR would be just as good. How wrong was I?PROS:Picture quality is very good, one of the best. Glossy finish is classy and the sound quality is as best as it gets for this size TV.CONSOK, last year's model the XBR8 line used LED lighting which is supposed to be much better (read the reviews). Why did we go backward with the new XBR9 models?The TV takes 30 seconds to come on from the time the power button is pressed! My old Sony comes on instantly ....what is wrong with this TV and why did Sony put it on the market with such an annoying flaw? This slow response also happens when you cycle between inputs, not just when you turn the TV on. So fi you press the input button to change inputs from your TV to your Blu-Ray/DVD player, expect to wait another 30 seconds before you can see a picture ...go make you a cup of coffee!The video inputs are on the side of the TV. So expect cables to be visible from the side of the TV unless you spend money rewiring your AV with L cables. Also be warned, if you currently have two separate devices using S-Video and composite video (yellow), then you'll have to find a converter or adapter for one device because on this TV, Sony decided to place both inputs on the same video channel! So you can only use one or the other and there is only a single audio connection on that channel! I have an old home theater system for my bedroom with uses S-video and I love it (it's one of those things you buy with low expectations and it surprises you)! I also have surveillance security cameras using composite video. Now I have to buy an adapter to convert one input or lose it!Also you cannot press the input button multiple times to cycle between inputs. When you press input key multiple times, you can cycle through the top -> button inputs list but you cannot cycle back around to the top unless you use you up/down arrow keys to change/select the input you want. Expect to wait an additional 30 seconds to see a picture each time you change inputs! This makes switch back and forth between inputs a time consuming annoyance!Finally, don't let anyone fool you that the changing contrast on dark scenes is a minor issue. When watching regular TV, recorded TV, DVD/Blu-Ray, or HDTV, it takes about 15 seconds into a dark scene then all over a sudden the TV realizes it's a dark scene and instead of compensating by brightening the scene for better clarity ... it makes it darker! So when watching dark scenes, be prepared for them to get darker and this is drastic and very visible. Then when you return to a bright scene, the Tv does the reverse and brightens the scene. This is also sudden and visible...not to mention annoying! This, feature has no menu options to disable. I have gone through my entire TV menu and disabled all the advanced picture enhancements and it's still annoyingly there! Trust me, this is a deal breaker for me!FINAL TAKE:If you watch HDTV or use AT&T; U-Verse, make sure you go to your receiver's Menu>Options>System Settings>Aspect ratio and change your TV size to 1080i for optimal picture.I wish I could suggest going back to the XBR6 model but I will loose 120Hz refresh rate plus I will get a TV that is about 2 -3 years old already ...doesn't sound right.I will be returning these TVs back to the store and replacing them with the Samsung LN32B650. I feel so sad and betrayed by Sony. It's like realizing that someone you have loved and been loyal to just betrayed you and you don't want to leave but you know that you have to; for your own sanity! So long Sony ...welcome Samsung...and you better act right!", "Date": "May 4, 2009"}, {"Title": "XBR9 = REDUCED SOUND QUALITY OVER XBR-6", "Author": "M. Frost \"1sttexan\"", "ReviewID": "RRD2QCWAZHIVL", "Overall": "4.0", "Content": "I bought an XBR-6 a few eeeks ago and absolutely loved it 5 stars. So I figured an XBR-9 would be that much better. Wrong!! The picture is great as long as you turn off all of the light enhancing features. Don't know why they even bother with them. Nothing beats self adjusting.  The 9 takes much longer to start up. Its like booting up a computer.The menu is more complex for no appearant reason.The XBR-6 has double the sound quality of the XBR=9. The sixes speakers are bigger and the surround sound is far superior to 9. I also find there to be a lag in the remote on the XBR-9. The 6 is instant in response. I bought the XBR-6 for $749. in early April. I got the XBR-9 for $969. on tax day. Now the XBR-6 is at $969. Seems like others are making the same discovery I did.", "Date": "April 22, 2009"}, {"Title": "Excellent Crisp Picture Once You Upload Sony Updated Software", "Author": "Amazonian \"Value Seeker\"", "ReviewID": "R2BZT3XMDKLAS", "Overall": "5.0", "Content": "Buying a new LCD TV can be a nightmare with all the choices. We had a Sony XBR4 which died 2 months ago after only 20 months but luckily I remembered that Mastercard doubled the one year warranty and got a check back for $1,080 to buy a new set. At first, I was drawn to the amazing $1,300 Samsung LED with what seemed to be the clearest picture (the store had the Samsung LED on it's own Blue Ray player which was deceiving). Then I went to a big box retailer and looked at all the LCD (and LED) sets on the wall. The Sony XBR9 had the blackest blacks and the best picture by far! Then I did some research and found out that Sony sends out a free USB stick with updated programing for an even better picture. The picture now is downright amazing and golf on HD looks like you are right there. If I only had $400, I would go with the Vizio at Wallyworld. But at a $700 price point, the Sony XBR9 is a great deal. Keep in mind that LCD's will only last 5 to 7 years given that LCD is less durable than the old tube sets. So if anyone knows where to get a cheap extended warranty please let me know. If you get the set, please remember to call Sony and get the USB stick to upgrade the picture!", "Date": "August 15, 2009"}, {"Title": "Sony XBR9 is Good", "Author": "cc2009", "ReviewID": "R3VBFD3QEIUSWJ", "Overall": "5.0", "Content": "Sony 32\" XBR9 is a good TV with great picture.I have read review that this model dim in and out and got darker on a dark scene. I found out if you used HDMI line with a upconverting DVD player, this problem will happen. I think in the process of upconverting 480 to 1080 it causes the dimming and darken effect in the dark scene. If you used component and composite line, this problem will be solved. Try it and enjoy your Sony 32\" XBR9.", "Date": "March 30, 2009"}, {"Title": "First HDTV", "Author": "Dustin Schroeder", "ReviewID": "R3HLN96CHO502L", "Overall": "5.0", "Content": "Well there was no review for this item so I figured I would right one. I recently started doing internet research since I wanted a new computer monitor and something to watch my Blu-rays on that was high definition. I wanted 1080P for maximum resolution and to make my Blu-rays look the best so the smallest you can get that in is 32' right now. Also right now there are only like 5 TV companies I think that have 32 with 1080P. After looking at them for a while I would say if you want the best it is this one I think it is the only one I found with 120hz refresh all the rest have 60hz. Also it had the second best contrast ratio but I think the Lg's was only 10000 above and all the others were way below. I was also looking at the Sharp AQUOS mainly because it says it has a gaming accelerator thing which it was still 60hz so I doubt that it would make up for it.  So in the end I went to best buy and bought one mainly because I wanted the 4 year best buy warranty since it is my first HDTV and so far everything seems to work great. It has a an advanced contrast adjuster which 2 times now has made the image darken during a movie for a a couple seconds but I probably just need to adjust the settings or shut it off. Also I have had heard people complain about the sound which I think is good when you put a movie on with the simulated surround sound on you have to turn the volume way up but it works nice.  Anyway this was my first review hope I did ok.", "Date": "March 19, 2009"}, {"Title": "Great TV but Pricey!", "Author": "JJ", "ReviewID": "R1FAXPGQZV3FY6", "Overall": "5.0", "Content": "Sony makes some of best LCD HDTV's and this 32\"XBR9 is no exception.This is a great set for anybody who wants 120hz, and doesn't care about getting a bargain deal on a XBR6.In regards to the picture dimming, this is an inherent factor that has plagued many of the past Sony models.You can turn off the light sensor for the auto dim, but presently there is no way to completely eliminate this problem.This is well documented on many AV forums.Other than this slightly annoying problem, this set excels on many levels.", "Date": "March 30, 2009"}, {"Title": "Nice tv, but has some issues", "Author": "timbers", "ReviewID": "RK6C10URZL6XI", "Overall": "1.0", "Content": "I received my 32\" xbr9 yesterday. The television has an excellent picture with great color as long as i sit directly in front of it. Once I go a little to the side the picture begins to wash out. So with two or more people in the room only one person gets the good picture. I also hear a popping noise every once in a while ( sounds electrical ). Also the picture about once every two minutes might freeze for a very split second then catch up to where it is supposed to be. Kind of missing a couple frames if that makes sense to you. Maybe I have a defective tv. I will give it a few more days and see if these things clear up.Update. I waited a few weeks to see if things cleared up. They did not. The electrical popping that seems to come out of the speakers is very annoying. Called Sony they said the tv is defective. They sent me another one. It seemed to be better. No popping noises until last night where it did it once. So now I have to call sony again. This will be my first and last sony. Hope everyone will be more fortunate with theirs.", "Date": "December 16, 2009"}, {"Title": "Not for Channel Flippers", "Author": "snookie24", "ReviewID": "R3GQBIB9TI6S3A", "Overall": "3.0", "Content": "Great screen, colors, and hues.  BUT it takes 5 seconds to switch between channels, and while you are switching, there is a blank black screen.  I am tempted to return it because I am a flipper and this wait is way too long and annoying!!", "Date": "August 25, 2009"}, {"Title": "Software Upgrade is a Must", "Author": "Alan J. Rothenstreich \"WiFi39\"", "ReviewID": "RZUM7LSUN0CE0", "Overall": "5.0", "Content": "This is an excellent television with great color, easy menus with a few idiosynchrocies.  First is to make sure you perform the software update available on the Sony website.  It makes a tremendous difference.  Also, make sure you check the video 2 settings to match what you have as far as connections.  Otherwise you can end up scratching your head unless you read the manual.  Once set up though the TV works great.Enjoy it.Alan", "Date": "June 28, 2009"}, {"Title": "Beautiful and High Quality", "Author": "O. Elmore", "ReviewID": "RMVUVONMVZ7H5", "Overall": "5.0", "Content": "I love this TV. I'm sure I would feel differently had I not updated the firmware before I even tried to use it, but since I did -- I LOVE THIS TV! I am going to try to put the link for the update at the bottom of this review, but Amazon may have a policy to delete links in reviews. If this happens, then go to [...] and follow the links for this model. You'll eventually find the update. Download it to a jump drive and plug it into the service port (the only one that'll take USB) with the TV off, then turn the TV on and things will take care of themselves.[...]UPDATEOkay, so Amazon did delete everything.  That's okay -- you know Sony has a website.", "Date": "October 12, 2009"}, {"Title": "Sony LCD TV's still lead the pack", "Author": "D. Mcclelland", "ReviewID": "R1GV4EM5241200", "Overall": "4.0", "Content": "This Sony TV produces an excellent picture. I have compared this to Samsung which is the next best in my opinion, and Sony still wins (although Samsung is catching up). The remote control is very easy to use and not packed with buttons that take a magnifying glass to figure out. My only gripe is that when using HDMI cables (the best) the TV takes a while to turn on and to switch between inputs. I'm not talking a few seconds, it can take up to 15 seconds to switch. It isn't just this TV but other Sony's as well. But the great picture and other features stiil make this the best in my opinion.", "Date": "June 26, 2009"}, {"Title": "Great Picture - Convenient Size", "Author": "John L Salyards \"Johnny Buzzhead\"", "ReviewID": "R1OFYM6OR6Z1TV", "Overall": "5.0", "Content": "Latest and greatest release - has the 120Hz scan rate so you get less of the stuttering from film conversions. Fairly wide viewing angle w/ great coloration - not overly saturated with cartoonish tinting.Lots of available adjustments, though works great out of the box.Doesn't seem to pass 5.1 sound from cable input through the optical connection to Sony's HTIB BDV-IS1000, though most people will probably use a sat or cable box and send the audio from there.Bravia Sync with the remote to other Sony boxes takes a bit of fiddling with to get the results you expect.Beautiful modern TV that fits in traditional size furniture!", "Date": "May 6, 2009"}, {"Title": "Deeply Disappointing", "Author": "DC Reader", "ReviewID": "R3IUVENA483HLY", "Overall": "2.0", "Content": "I purchased this TV to replace last year's 32\" XBR 6, which was unfortunately stolen from my home. The 32\" XBR6 was my first Sony and is a fantastic TV and perfect in every way as far as I'm concerned. I loved everything about it. The KDL-32XBR9 is meant to be a replacement for the XBR6, but it doesn't come close. The quality of this new model is disappointing to say the least. I gave it two stars because the picture quality is excellent as one would expect from a Sony. My issue is with the audio, which has given me problems right out of the box since I received this set last week.The TV makes popping noises when I change the channel using a cable box. Also, the screen has suddenly gone black but you can still hear the audio. I went on Sony's website to download the software update that was supposed to address the audio problems (which Sony is obviously aware of), but it did NOT help. Just to troubleshoot and make sure it wasn't the cable box causing the problem, I hooked up 2 other TV's to the same box and they worked just fine. I also hooked up my DirecTV box to this TV and still got the popping noises. I called Sony's customer service and they gave me the names of some authorized repair shops in my area, but when I called them and explained the problem they were stumped and had no idea of how to fix the problem. Therefore, this set is going back this week and I will probably end up getting a Panasonic or LG.Ironically, I also just purchased the KDL-40XBR9 for my living room and I love it just as much as I loved my XBR6. It was perfect right out of the box, and I could hardly tear myself away from watching football yesterday because the picture quality was stunning. Too bad I cannot say the same about the KDL-32XBR9.", "Date": "September 14, 2009"}, {"Title": "Looking Good", "Author": "Bonnie Dale", "ReviewID": "R3TRPMJQ43RI97", "Overall": "4.0", "Content": "As a result of some recent remodeling, we found that a new TV was in order.  We did our research and settled on the Sony product.  After checking local rtailers, we found that the very best price was at Amazon.com.  The TV arrived right on time and was easily installed, up and running, and being greatly enjoyed in no time at all.  The picture quality is wonderful.  Great company with a great product, offered through a superb website - it all adds up to customer satisfaction.", "Date": "June 22, 2009"}, {"Title": "Outstanding Colors - Stunning to watch.", "Author": "Bobby G. Bodenhamer", "ReviewID": "R23VCXX0C5XG9N", "Overall": "5.0", "Content": "The Sony Bravia XBR KDL-32-inch 1080p 120hz LCD HDTV offers a fantastic time of entertainment as you view your favorite programming on it.The colors are brilliant. I love the materials put out by the Discovery and the National Geographic programming. The nature scenes are absolutely stunning.I have been waiting for this TV to drop down in price to my affordable range. I have been waiting since last Christmas. This TV was worth waiting for.ThanksBob", "Date": "September 12, 2009"}, {"Title": "32XBR9 - amazing picture", "Author": "William J. Clark \"William J. Clark\"", "ReviewID": "R1V5YPYESCGJ19", "Overall": "5.0", "Content": "I purchased the Sony 32XBR9 after carefully reading all possible reviews on this site and others. I decided after my experiences with other Sony products, it was worth the money. I ordered the set and was told delivery could be expected by September 3, 2009. Amazon has speciality shippers handle their television sets, not UPS or Fedex. The TV arrived in the Columbus depot where the shipper Pilot turned it iver to a third party carrier. There was where the problem started. The third party shipper only delivered in this area once a week or when they had a big enough load to justify the trip. Well, the only day they would bring it was Tueday, Sept 8, almost a week after the promised date. I called Amazon customer service and complained that since the TV was a gift and the party was September 4, it wouldn't do me much good. They called Pilot, and a guy named Zack from the shipper moved heaven and earth and had another third party shipper pick up the set and had it here on the 4th in the morning, I can't begin to tell you how impressed and appreciative I was. They even refunded shipping costs even though shipping was free! Great service Amazon and Pilot!Now back to the TV (which is what this review was actually about). The TV gets an excellent picture. I immediately did the software update from Sony which was a breeze. The sound is about right for that size TV. The picture is amazing. Hookup was fairly easy though I did not get sound on HDMI2. Still haven't figured that one out yet and may actually have to read the manual. I went into settings and set the picture to vivid (default is standard). Really made a difference, though it is ceratinly a matter of taste. When I went to input, it highlights the inputs that are active so there is little confusion getting to the peripherals. I can't say I noticed the problems that resulted in the update as I put it in first off because of the reviews, but it certainly looks great now. It does take a few seconds to come on or change inputs, but I am really not so impatient that it bothers me. The picture is worth the wait If you are looking for a 32 inch LCD- this is the one! ....and Amazon beat best buy by almost 300 dollars  Sony BRAVIA XBR KDL-32XBR9 32-Inch 1080p 120Hz LCD HDTV", "Date": "September 4, 2009"}, {"Title": "Its all that I expected", "Author": "E. Golden \"nocman\"", "ReviewID": "R2WINAWDB4JH6M", "Overall": "4.0", "Content": "I received my kdl-32xbr9 last evening.While I was very excited to get it installed on its perch, I was also apprehensious that I might damage it. My wife and i worked together to place it on equipment stand and hook up the hdmi cable and the external audio cables.  The documentation is not very extensive in its explanations.However I found that the controls/menu were easy to understand what effect they were having.  I had read all the comments for this unit before I purchased it and was aware of the complaints on the audio and the issue with the advance contrast enhancer with the flashing. I even had sent off for my usb flash drive before the tv arrived to fix the issue.  The picture is incredible and very 3d looking. I use my stereo system on the sound and not effected by the small internal speakers.  I had been using a tube type hdtv for the last 4 years and was not blown away by the first time seeing of hdtv, but yet as in many lcd displays, there is just a more deeper and life like image than the video seen on the tubes.  I was able to purchase this set from j&r; music via amason one day last week at the price of $749.99 and then the very next day it went back up to $789.99. Now that was sweet.  I am sure that more expensive and larger flat panel hdtv will have more options perhaps, but the price rises quickly after this unit.  I had to save for six  months to get this but It is well worth the price. If you are like me and your family budget does not fit the over $1000 dollar lines of sets, then I would like to highly recommend this one.Edward", "Date": "July 15, 2009"}, {"Title": "Short Life span", "Author": "King", "ReviewID": "RABQMN9QBAA37", "Overall": "2.0", "Content": "This Tv is very flashy.It really looks great wherever you placed it. Picture and sound quality is great too including power comsumption. However I bought this Tv ending of August,2009 received it early September. 2009 and this Fabuary, 2011 the Tv power doesn't stay on again. I am a Sony gadget freak but this product has disappointed me.", "Date": "February 25, 2011"}, {"Title": "Great TV!", "Author": "William B. Houseman \"Bill H\"", "ReviewID": "R2J1OO4VDLWR6O", "Overall": "5.0", "Content": "While looking at TV's at Costco, it was easy to see that Sony had the best picture. After living with the Sony Bravia 46\" bought there, I decided on a 32\" for my office. The picture is superb! The picture appears 12 seconds after pressing the On button. There are plug-ins galore on the back, more than the average person will ever need. The sound system lacks a desk rattling bass, which is fine with me. The speakers are more than adequate for a large room and sound is very clear at low volume. It took around 30 minutes for the initial Auto-Search of the available channels, and it ended up showing a number of digital channels I don't think I'm paying the cable company for. TV doesn't get any better than this!", "Date": "February 5, 2010"}, {"Title": "newtoLCD", "Author": "M. shaw", "ReviewID": "R39LVI4U3YEIKP", "Overall": "5.0", "Content": "This is my first LCD HD TV so I researched quite a bit including reviewing various comments so thought I would provide my own.  The picture quality is top notch as well as the picuture flow.  Looking from the side is much better than even a few years back though no LCD TV is going to match the plasma or my old TV on the side...at least not yet.  The controls are pretty intuitive though a pain having to scroll through them. Sound is fine but like a previous commentor it \"pops\" occasionally.  Anyone else experience this?  A few things that made me cautious about this TV based on other comments were: picture quality not good?  Not sure what they are comparing but its great.  Side inputs?  This one really through me off because some people were really critical.  The TV also has rear inputs. The side inputs are convenient for getting connecting temporary equipment like a camera or camcorder and the wire do not show out of the side as the inputs are indented so not sure what this complaint is about.  As far as timing, takes a few seconds to turn and change channels...but no where near 30 seconds.  Sometimes I think some commentor are working for other manufacturers.  Top notch TV.", "Date": "December 18, 2009"}, {"Title": "Awesome Picture!!!", "Author": "J. Olarte", "ReviewID": "R2FEXRTM71MIB7", "Overall": "5.0", "Content": "I had it in my cart and when it dropped to $639 I pulled the trigger. I have it on my desk next to my PC 30\" monitor. I am very happy with the picture quality. I called Sony Support and they are mailing me the firmware update on a USB drive free of charge. Pilot threshold delivery was perfect. This TV is currently selling at Best Buy for $999 + tax. I visit Best Buy to see what I'm going to buy at Amazon!!!", "Date": "September 19, 2009"}, {"Title": "It is like watching TV for the first time.", "Author": "David Sierra", "ReviewID": "RB3V5PYTUC4N6", "Overall": "5.0", "Content": "The connections and setups are not as eseay as the manufacturer claims. Thanks to the HD Cable instalation technician who did the connections (TV, Blurays player and HD Cable Box) and the settings, I was able to enjoy TV like I never thought possible. When I watched PBS's News Hour I actually knew what was going on with a full screen view. Then came my surprise: PBS presentation of \"Benise - Night of Fire\". WOW!!! Colors came alive, backgrounds were clear, movements exciting, sound almost surrounded. Sony BRAVIA XBR KDL-32XBR9 32-Inch 1080p 120Hz LCD HDTV", "Date": "August 11, 2009"}, {"Title": "Sony BRAVIA", "Author": "Gerald A. Wheelock", "ReviewID": "RQG2DX6GURU2H", "Overall": "5.0", "Content": "I did some research on the type and model of tv that would fit my purpose. This model fulfills all of my expectations and at a good price.", "Date": "July 6, 2009"}, {"Title": "TV Lasted Less Than Three Years.  Planned Obsolescence!!", "Author": "Meg", "ReviewID": "R2WT1AJUS34845", "Overall": "1.0", "Content": "We bought this TV from Amazon less than three years ago.  It worked fine until recently when it started showing vertical bands across the screen.  It started with one or two then finally filled the whole screen.  When we took it to our TV Repairman, he said that this is not unusual.  These new TVs (both LCD and plasma), whether Sony, Samsung or any other maker all use the parts made in Korea.  Obviously, quality control is severely lacking in the TV electronic industry.  The repairman said it may be cheaper to buy a new one, depending on the problem.  I find this the worst kind of consumption to be blamed on the electronic makers themselves.  Just picture all of the three-year-old TVs loading up the land fills.  So, don't believe it when you hear people say that Sony is a better product.  They are all the same and don't count on them lasting more than three or four years.  Our old Panasonic tube TV lasted 20 years!  We consumers really should raise our voices on this kind of planned obsolescence.", "Date": "November 16, 2010"}, {"Title": "32 inch Sony Bravia 1080p 120 hz HDTV", "Author": "D. Anderson", "ReviewID": "RMF52B4GK2X0K", "Overall": "5.0", "Content": "I was originally hesitant to order a TV over the internet but I ordered a Sony HD TV from Amazon about 6 months ago and was very impressed with both the shipping and the tv so when our smaller tv died recently, I didn't hesitate. I ordered the Sony 32 inch 1080p with 120hz,  it was delivered on schedule,  about 20 minutes later I was watching HDTV.  The TV is excellent and the 120hz capability is definitely worth the few extra dollars .", "Date": "April 22, 2009"}, {"Title": "A steal for the price", "Author": "John Malenkov \"JS\"", "ReviewID": "R32CR12APNA3EH", "Overall": "4.0", "Content": "Pros: An excellent TV.  The picture is awesome.  Very good viewing angle.  I have never seen a 32\" TV display HD content so well.  The menu options are vast.  The colors are deep, rich , and vivid (pun intended).  Also, Sony's vivid color mode has been improved greatly (tried it on a 2005 TV, the colors looked cartoonish).  The USB ports are awesome.  Simply plug in a USB stick, and show off your pictures, or play your music.Cons:  Well, the sound is OK.  but, honestly, what they heck are you expecting out of that little speaker?  The default color settings were AWFUL.  This thing required quite a bit of calibration to get it looking like it should (if anybody wants the settings, reply with a comment, and I will give them).  The picture out of the box is why I docked this a star.Other thoughts:  As said many times before - UPGRADE YOUR FIRMWARE.  The download is available from Sony.", "Date": "March 8, 2010"}, {"Title": "Great TV for the money, but black level suffers at viewing angle", "Author": "JoeD", "ReviewID": "R2R5PDT2TFR2XJ", "Overall": "4.0", "Content": "I am very pleased with this TV for the price. This is my first HDTV and after watching NFL Playoff games on my friend's HDTV and not having one of my own, I said no more. I have viewed many flat panel TVs at friends' and families' homes in the past few years. Everything from a low end 22\" Sony LCD TV from Walmart to a 60\" Pioneer KURO Plasma TV and I knew if I was going to buy an LCD TV, I wanted the video quality to be closer to the KURO than the Sony from Walmart. This 32\" Sony XBR9 was the only good branded 1080p TV that I could find with 120Hz refresh rate for less than $600 and I am very happy with it.PROS:1. Clear 1080p LCD with 120Hz refresh rate that almost anyone can afford.2. Inputs, inputs, inputs!3. Good menu with a lot of adjustments and the menu will actually tell you what each adjustment does so it is easy to get the picture you want.4. Home Theater PC looks great on PC input or on the HDMI.5. Very classy looking front panel and a \"Bravia\" splash screen when you turn the TV on.6. Software updates are a snap if you follow the directionsCONS:1. When the TV is viewed at an angle of 45 degrees or more from perpendicular to the panel of the TV the black level quality decreases. I start to see grays and dark greens in the black colors. With our specific setup in our family room, there is a seat that is almost exactly 45 degrees and it is pretty noticeable.2. 32\" TV that is 31.5\" viewable!?!?! What is that? I knew before I bought it, so I can't really complain, but I thought this was one of the reasons we dumped CRTs.3. Before the software update this past summer, I would not have enjoyed this TV as much as I do now. The dynamic back-lighting is really noticeable to the point of being annoying. After reading reviews on Amazon, I downloaded the update and had it ready on a USB stick before I even received the TV. My kids started getting impatient while I was setting up the TV so I let them watch Cars out of the box without changing any settings. It was almost unwatchable for me and even my 3 year old complained that she wanted the other TV back (Toshiba 32\" SD CRT). I updated the firmware, turned off the dynamic back-lighting, and turned off Cinemotion. With those three changes, the picture improved dramatically.4. Side inputs. There are 9 inputs on the side of the TV, NINE! (1 USB, 1 PC input, 3 HDMI, 1 S-video, 1 composite video, 2 channels analog audio) All of the cables from these inputs stick out from the side and can be seen while watching the TV. Luckily, I have figured out how to use my home theater receiver to handle my 6 video sources and run one HDMI cable to the single HDMI input on the back.Even with these few cons that I can live with, this is a great TV for the price. If you are shopping in this price range, you will find more cons with every other TV than this one and less pros.", "Date": "January 25, 2010"}, {"Title": "Good little TV for the price", "Author": "S. Nelson", "ReviewID": "R2ORYQ829LDOSD", "Overall": "4.0", "Content": "I bought this TV to use as a computer monitor, but it turned out to not be so good for that. It has a ghosting effect. I talked with tech support and we went through all the possible settings. They even shipped me a USB with the updates. Nothing fixed my problem. So, don't buy this TV to use as a computer monitor.However, as for a TV - it's GREAT! Everything looks clean and bright. Video games also look awesome. I'm very happy with the purchase and will probably replace it next year and just use it as a TV only. Anyone have any suggestions for a computer monitor similar to this size and specs?", "Date": "January 5, 2010"}, {"Title": "Nice Buy", "Author": "U. Loper", "ReviewID": "R1WK56ROLNMSPV", "Overall": "5.0", "Content": "I got this tv about month ago and it is by far the best tv purchase I have ever had. The picture is sharp and the color can really give you a seizure it is so vivid. The only thing I notice is on a rare occasion when I would output the sound to my system, it would distort and short out but very rare. This was even after the firmware update.It also could be related to the optical cord i'm using or the system it is connected to. Other than that I stay glued to this thing for gaming and movies. I can't even come to watching movies without 120hz or higher now, i'm ruined lol.", "Date": "December 23, 2009"}, {"Title": "Great TV!", "Author": "Mary E. Sipe", "ReviewID": "R1CGLML0Y0QMSC", "Overall": "5.0", "Content": "It's really simple. Great TV! We did a lot of shopping around and settled on this model. It has not let us down!", "Date": "November 14, 2009"}, {"Title": "Perfect for my bedroom", "Author": "John Paul Jones \"John\"", "ReviewID": "R3W19QCAQI6BNP", "Overall": "4.0", "Content": "It's features are easy to understand and picture is clear. Price is cheaper than local store. One of the things I considered buying this because of my past experience as far as the quality is concerned. I owned a big screen (63') since 1994 and never gave me a problem, but I'm going to get rid of it soon for flat screen.", "Date": "October 28, 2009"}, {"Title": "very nice", "Author": "Tom H. \"TMH\"", "ReviewID": "R3EMJZ2LJCR6VO", "Overall": "5.0", "Content": "The Sony Bravia is all I hoped it would be.  The picture quality is excellent.  The menu items are helpful but not always easy to use.  I'm glad I have this unit with all the HD programming.", "Date": "October 21, 2009"}, {"Title": "Great TV", "Author": "Robert D. Beving", "ReviewID": "R1LUZUFH7VTI03", "Overall": "5.0", "Content": "A excellent TV at a great price.  Sony makes top of the line products and Amazon is a great source for them and much more.", "Date": "October 18, 2009"}, {"Title": "very good with caveats", "Author": "Reader Reviewer NJ", "ReviewID": "R3TNKJLMT8D6G8", "Overall": "4.0", "Content": "TV has some brightness issues which Sony resolved by way of call-in customer support.  Now works great.  Beautiful and very satisfied!", "Date": "September 27, 2009"}, {"Title": "I Bought the USED Amazon Set", "Author": "Gary P \"mighty_reader\"", "ReviewID": "R2R2O1TGIWF35B", "Overall": "5.0", "Content": "I was a little worried when I bought a used TV.  When it came the set had obviously been opened and set up.  The manuals were highly worn and the remote contained batteries.  The set however looked new.  It set up fine and has run fine for a month.  It is just like new and I got it for $100 less than the lowest price I could find.", "Date": "September 12, 2009"}, {"Title": "bravia xbr 1080p", "Author": null, "ReviewID": "R2NGP1UJ38D6Q2", "Overall": "4.0", "Content": "Great picture quality for price;however, slow to start and sometimes makes a slight buzzing sound especially if volume too high.", "Date": "June 26, 2009"}, {"Title": "State of the art\" LCD perfect for bedrooms or anywhere!", "Author": "Sammy Carr \"macking301\"", "ReviewID": "R2W2YR83J63XBX", "Overall": "5.0", "Content": "I think this Sony XBR9 is simply a perfect LCD TV. It has perfect quality and a vivid and accurate picture.I saw it in 2 stores and it stands out from the other 32\" TV's. Not the cheapest on the block but if you want the very best that you can get, this light and outstanding Sony will meet your needs easily.If you use 1080p resolution you will be able to tell how ultra clear and sharp the image is and its outstanding!Sony, you have done yourself proud with this baby!", "Date": "May 22, 2009"}, {"Title": "Finally Got it...Love it!", "Author": "S. Osati", "ReviewID": "RWP9ELLSU12R4", "Overall": "5.0", "Content": "So I finally got this TV for a multi reason based using. I just replaced my G5 with a Mac Pro and got a PS3 slim for the bed room as well while the older PS3 is hooked up to our 60\" Sony SXRD. I needed a larger monitor for my Mac Pro, but also wanted a TV for the room and we were originally going to go with the 24\" Cinema display from Apple. Amazing unit but is only for the computer and that is it. With that said, I turned to Sony.The XBR9 does a great job with blacks and colors so when my Mac is running and im in Final Cut or iPhoto, the picture quality is great (I went DVI to HDMI) and when I switch the input over to the PS3 (HDMI), everything continues to look fantastic. So Games/Blu-ray and TV are great.Again, I have to stress though like other reviewers, the XBR9 does not look as good as the XBR8 because its lower in the series! I mean look at the price difference for the love of god. So please, dont think that somehow Sony has gone back in their mindset. Just 2 different series.", "Date": "October 11, 2009"}, {"Title": "No bad...Not Great either!", "Author": "Dela Agbemabiese \"Tesla\"", "ReviewID": "R1YHUZGIFE1YKG", "Overall": "3.0", "Content": "I've been using this TV for about 22 days. Picture is great...I got deeper blacks and sharper colors than i did on my 26 inch samsung.This TV seriously lacks in features that the older models have such as the xross media bar, ethernet port. Being someone who rarely uses cable, i'll very much like news feeds from my tv, at my convenience. Sound is terrible...my girlfriend says her polaroid 22 inch has better sound quality, which is true.So what am i gonna do now? well, i'm going to sell this set or return it amazon, get my money back, add 600 bucks and get the 40xbr7...it might be an older model but i think it'll better suit my needs", "Date": "May 22, 2009"}, {"Title": "gorgeous television", "Author": "game freak \"brynne_knits\"", "ReviewID": "RSJTUE5CM9LR6", "Overall": "5.0", "Content": "I got this as a gift recently.  I am an avid video gamer and I have PS3/XBOX 360 and a Wii.  I am amazed at the response and color saturation.  I would highly recommend this television.", "Date": "April 10, 2009"}, {"Title": "Great TV for sale price, but COMCAST sucks...", "Author": "Joe", "ReviewID": "RTC51B22MFTTH", "Overall": "5.0", "Content": "This is a great tv for the $500-$600 dollar range. (I would never pay full price for ANY television.)Picture is great, sound very good from the small speakers with the TruSurround turned on. Just turn up the bass a little.Some have been complaining about the HDMI on the side, but you can get adapters that will angle the cords downward.Other complaints about things like the sleep timer, etc. aren't that bad. You should get a full manual with your tv, though. Or an option to go online and print one.When buying an HDTV, you have to consider two things: the picture of the tv you're buying and the HD input signal.Some problems people are having might have to do with the signal more than the tv.Always check from different sources--cable box vs. antenna input--if you detect a problem.Which brings me to COMCAST...Case in point--Comcast sucks.Through their cable box of choice, the Motorola DCH3416, you get a box that tells you, on the front, what kind of signal you're processing on any given channel.It's either 1080i or 480i. There are other options, but Comcast, from the box, deals in only those two flavors from what I can tell.And when you go from one to the other, you get a loud audio *POP*.And sometimes, when you go from HD to SD, you get a loud audio *POP*...and then no video. Audio, but no video.So, I also have the cable going directly into the antenna input.GO back and forth between HD and SD channels....no pop. No problems.This tv tells you what signal you're getting as well, 1080, 480, even 720.A simple Google search tells me that this problem has been going on for MONTHS for Comcast customers, and with other brands of televisions as well.It's the box, not the tv.Will Comcast fix this?Maybe in ten years, who knows?Also, they promised us DVRs in the Motorola box made by TiVo, and we're still waiting for that.Bottom line: great picture on the tv (for a good price), minor things you can live with, and Comcast sucks.", "Date": "January 14, 2010"}, {"Title": "Amazed", "Author": "backdoc", "ReviewID": "R1X760SPTACMQQ", "Overall": "5.0", "Content": "This is my first Sony TV.  I've only owned it for a few hours.  I hope my opinion doesn't change.I bought a PS3 Slim at the same time.  I connected them and watched \"Up\" on DVD.  The picture quality is nothing short of incredible.  I don't know if it's the PS3, the quality of the DVD, the TV or all of the above.  But, I've never seen a picture that I've been that impressed with.I read a few reviews here complaining of the inputs on the side and the picture brightness changing.  I didn't notice the picture changing brightness.  It could be I have a firmware version that includes the fix for it.  I'm not sure.  The inputs are a little unorthodox.  I have a regular HDMI cable and RCA cable plugged into the side.  I don't see them from the front.  So, I guess they aren't in the way.  But, I would have preferred them on the back.I recommend this TV.", "Date": "November 24, 2009"}, {"Title": "Great picture", "Author": "Edmund Ansara", "ReviewID": "R3QLDRTLZG9116", "Overall": "5.0", "Content": "The TV is very nice, bought this in 11/09, when 120 Hz was a big deal. Now, not so much, as higher refresh rates are out!", "Date": "January 21, 2013"}, {"Title": "don't trust gidiflex", "Author": "Stumpf", "ReviewID": "R2WAZGOH338IU4", "Overall": "1.0", "Content": "The vendor lied and sent a cheap replacement tv.  He did not have the advertised product.  BAIT AND SWITCH!  Do not use this vendor.  Gidiflex is a scammer.", "Date": "June 1, 2012"}, {"Title": "Also have audio loss issues", "Author": "Maureen A. Beaufait", "ReviewID": "R31EPURCCL9M64", "Overall": "3.0", "Content": "Love everything about it except the intermittent audio loss.  I just received my refurbished replacement.  It is way improved from the one I sent back.  It has happened a couple of times though already and it has only been 3 days.  I do have the update on a stick and will try that.  But my last one started out occasionally then increased over time. I will call them again and try to get this settled.For anyone stuck with this terrible flaw...when the sound goes out if I press pause on my comcast remote then press play right away it fixes it ( for that occurence)  I am not very tv tech saavy as others are who have posted reviews but at least I can get the sound back on rather quick and don't miss too much.Hopefully this might help any of us who are stuck with this unfortunate problem until perhaps an update comes out that will actually fix it.", "Date": "October 1, 2010"}, {"Title": "lcd tv, sony", "Author": "M. Belken", "ReviewID": "R2W3FA50NE5HQX", "Overall": "3.0", "Content": "Watch sound card. Mine stops working and then starts again when TV is turned off/on. Sony not very helpful. Would not purchase again. Will go w/ Sansung or Panasonic in future.", "Date": "September 21, 2010"}, {"Title": "Works great with my Oppo 83 and Roku", "Author": "D. Levy", "ReviewID": "R1D7AGWSNMFUAG", "Overall": "5.0", "Content": "The TV can loaded with the latest firmware.  It arrived in excellent condition, no damage to the box.  Setup was simple.  My Oppo 83 is hooked directly into a HDMI port; the picture look superb.  I just wish I had bought two at $697; the price is back up to $899.  My Roku goes into a second HDMI port, and it look great.", "Date": "March 17, 2010"}, {"Title": "Fine television", "Author": "Derek 1345", "ReviewID": "R1O5I52ECYNL25", "Overall": "5.0", "Content": "I bought this from Amazon.com in December 2009 for $699.Upsides: Sleek look, nice menus, beautiful pictures. Can't wait to check out Blu-ray on this. I like that it passes optical audio out; don't know if that's standard these days but I can see that will be useful when paired with an audio system. Love the picture- and sound-tweaking options.Downsides: Start-up delay (10-12 sec?), displays infobar at the top each time resolution is switched (480/720/1080), which is annoying when using it with a native-output DVR.", "Date": "March 2, 2010"}, {"Title": "Very Pleased", "Author": "Alex", "ReviewID": "R3GSPUNGPLV1S6", "Overall": "5.0", "Content": "This is the first flat screen HDTV that I have ever purchased.  I, like many others looking for HDTVs, did a lot of research before finding \"the one\".  I'm extremely satisfied with this as my first purchase.  I've owned it for a little over 2 months now and have gotten a lot of use out of it already.Right out of the box the TV not only looked great but had a sturdy feel to it.  This is a well designed TV and doesn't feel flimsy or cheaply made.  Other reviewers are complaining about some of the inputs being on the side of the TV - it's not a problem.  There is enough of a gap between the inputs and the edge of the TV where any cables plugged into the side inputs can be neatly tucked around and behind.The picture quality is amazing.  Playing PS3 and XBOX 360 via HDMI looks phenomenal.  Bluray movie and picture quality is amazing as well.  I also have this thing doubling as a computer monitor via HDMI.  There is a small ghosting effect on dark areas but I'm not surprised by that; this wasn't purchased with the intent of a gaming monitor for my computer but it's amazing how fun games are on a screen this big.  Watching streaming HD content off the internet looks great too.  The fact that this is 1080p and also 120hz makes just about anything look spectacular on here.  There really is nothing bad to say about the picture quality on this set.  All Sony Bravia television sets that I've viewed I have been very impressed with the picture quality.The sound is something that I was a little disappointed on.  The built in sound on the TV isn't bad by any means, however, it's not great either.  You can't turn the volume up too loud otherwise the sound will really begin to distort.  Low and mid volumes are the best way to listen with just the built in speakers.  I eventually plugged into an external sound system and it sounds much better that way.  I would recommend future (and current) owners to go this route to get the best sound quality.Other various built in features I think are a nice compliment to the set.  The menu functions are easy to use and navigate through.  There are a lot of options to change around and edit, which is a nice bonus I think.  The remote isn't bad either.  I didn't order a firmware update from Sony but instead downloaded the latest firmware from their website and installed it myself.  Wasn't difficult at all - the directions online to do this are easy enough to follow.Overall I'm incredibly satisfied with my purchase.  I would definitely purchase another one of these if given the opportunity, and would definitely recommend this set.  I was on the fence for several weeks deciding on which HDTV to get.  If you're looking for something you will really get your money's worth from - get this TV and I guarantee you won't be disappointed.  :)", "Date": "February 18, 2010"}, {"Title": "Christmas Gift", "Author": "James Porter \"j porter\"", "ReviewID": "R2KMV3QNL4AK47", "Overall": "5.0", "Content": "This was a Christmas gift to my daughter and her family.  The report I received was very positive.  I was told the image of the Wii games they play makes it look like real life \"When playing golf, you can see every blade of grass.\"  \"We Love it!\"", "Date": "February 14, 2010"}, {"Title": "Sony Bravia 32 Inch TV", "Author": "John", "ReviewID": "R1TXGOOW91581G", "Overall": "5.0", "Content": "The TV was received quickly from Amazon with delivery before the holiday. It was easy to setup and had excellent picture and sound quality. I had a cable with HDMI connectors ready when the set arrived. The internet can be accessed using a PC connected to an HDMI input on the TV set.", "Date": "February 14, 2010"}, {"Title": "Just Like the Big One But Smaller", "Author": "Robert G. Eason \"easong\"", "ReviewID": "R1EWRPCT236804", "Overall": "5.0", "Content": "I needed HDTV for the bedroom and wanted one that was wall mountable and viewable at a 12' distance. Having recently acquired a superb Bravia 55XBR8 for the living room I just wanted to scale it down a size or two. The picture qualities are similar, with true colors and dark blacks with few visual artifacts. This a great midsize TV for sports. Also I like the low-glare matte screen as opposed to glass, wish the bezel wasn't shiny either but that's where the style is stuck today. My only other complaint is the speaker bar at the bottom, not ugly but also not sufficient soundwise -- the audio can be ported out so no big deal. Like the larger TV, this one operates seamlessly with the satellite box, important since I live in a fringe area for broadcast (thus I can't speak to the over-the-air reception). I ordered the TV from Amazon seven days before Christmas and was assured it would arrive by the 24th -- the UPS lady rolled up with it at 3 PM on Christmas Eve.", "Date": "February 14, 2010"}, {"Title": "Sound & the Fury of HDTV", "Author": "Marty Wohl \"Film Buff\"", "ReviewID": "R14I3JIF266A7B", "Overall": "4.0", "Content": "Excellent picture and sound quality.  You must anchor TV to table stand if not wall mounting as it is light on its feet, sort to speak.A child or pet could knock it down effortlessly if it's simply on a console table.  It does have a pedestal base with pre-drilled holesto screw into a base table.  Still, it would be far better served to wall mount the set, if possible.(SONY XBR 9 - 32\")", "Date": "January 30, 2010"}, {"Title": "GREAT DEAL~", "Author": "Amazon Customer \"catlover\"", "ReviewID": "R1EYPBQRU1TWEF", "Overall": "5.0", "Content": "This is a great tv at a great price.  I am totally happy about it.  There were some earlier reviews I read about issues with the sound but I have had no problems.  And the styling is amazing.  I would highly recommend this product to someone looking for a new flat screen,", "Date": "January 28, 2010"}, {"Title": "Great Purchase - Very Happy", "Author": "Jeff G.", "ReviewID": "R32454NWP9Z3Z1", "Overall": "5.0", "Content": "Thrilled with the picture and feature set.  Sound is about the best of any tv speakers although it would obviously be enhanced by external speakers.  Felt it was a great value too at the price I paid during the Holiday Season. Was deciding between this high end 32 inch model and the low end 40\" S5100 model by Sony.  Glad I went with this one.", "Date": "January 27, 2010"}, {"Title": "Very easy to setup and use", "Author": "Michael P. Krowchuk \"Golf Nut\"", "ReviewID": "R2DOAUAN7CKQ6Q", "Overall": "5.0", "Content": "Sony has a reputation for quality and this product is no different.  Opened the box, installed 4 screws on the mount and plugged it in.  The TV has an easy on-screen set-up guide to ensure you get the most out of your TV right away.  Love it !!", "Date": "January 23, 2010"}, {"Title": "Sony Bravia 32in LCD TV", "Author": "G. Updike", "ReviewID": "R81TRGWY79SDW", "Overall": "5.0", "Content": "We have enjoyed the Sony TV.  After doing much research on LCD TVs and because we do not buy TVs very often - we chose this upscale Sony TV.  It has been as advertised!  Regarding some of the criticism on this TV that the screen seems to go \"dark\" sometimes which is likely tied to the energy saving features -- there is supposed to be a firmware upgrade; my TV was manufactured in November 2009 and it came from the factory with the firmware already upgraded.  However, we still experience the \"dark\" screen sometimes.  What I have discovered - is if I have a VCR connected and play a VHS tape from a recorded TV show - the screen will consistently seem to go dark frequently during the playing of the tape.  If I take that VHS tape and convert it to DVD, and then play the DVD on the Sony TV - it plays just fine and the screen does NOT go dark.  So - I'm not sure exactly what this means - except maybe just don't play VHS tapes to this Sony unless you first convert them to DVD.  Other than this annomoly - the TV has been great and I would purchase it again in a second!", "Date": "January 18, 2010"}, {"Title": "Home Run!", "Author": "T. Butler \"Average Buyer\"", "ReviewID": "R3KLQ3BRCEIXIM", "Overall": "5.0", "Content": "After 18 months of use, I bought a second one. Picture quality is outstanding, sound is amazing given the small hardly noticeable speakers. The remote is user friendly however, the on screen setup menu is a little confusing. Plenty of input connections and seems to be good on power consumption. Plan on using/viewing this XBR for many years to come.", "Date": "January 14, 2010"}, {"Title": "sony xbr9", "Author": "Luis O. Olitoquit \"Jun Bicol\"", "ReviewID": "R1E451FT0VQRMC", "Overall": "5.0", "Content": "i bought this tv on sale and put it in my bedroom replacing a Panasonic 27\" CRT.  The pictures are stunning especially on high definition.  The sound is ok for a 32 inch and the remote control is easy to navigate.  Overall this lcd is worth the price of 599.", "Date": "January 9, 2010"}, {"Title": "Sony Bravia 32\" LCD TV # KDL-32XBR9", "Author": "K. Quinn \"cautious consumer\"", "ReviewID": "R3D8NPQ8ZJMTYF", "Overall": "5.0", "Content": "This is our first HD TV and it is great!  Colors are clear and crisp, with deep blacks for definition.  We chosethis 32\" TV for excellent picture in both HD and regular TV formats, plus very good sound.  We have it in an area without surround sound and wanted rich sound.  When we put it on the music stations, we were very pleased.  We'd recommend this TV to our friends.", "Date": "January 1, 2010"}, {"Title": "Very Pleased", "Author": "Russell Foss", "ReviewID": "R2FA6TLDJNH85C", "Overall": "5.0", "Content": "I ordered this TV for my Mom a couple of weeks before Christmas.  At the time, the Amazon price was $100 less than local retailers.  My biggest concern was the firmware upgrade, so I made sure I had everything ready by downloading the upgrade myself from Sony.  I called Sony customer service to find out how to check which firmware version was installed so that I could determine if the update was necessary at all.  The TV had not even been delivered yet, but Sony support was very nice and told me where to find the information in the television setup menu.  Delivery was uneventful via FedEx and arrived on time.  I ALMOST did not even consider this televsion when I read another reviewer's comments concerning the side connections.  Luckily, I was able to find a display locally and determine it was NOT an issue at all for any that may be concerned.  I used all 4 HDMI ports, including the 3 on the side.  The cables can be snugly fit behind the televsion frame so that they are not visible.  The television had a recent manufacture date of November 2009, and was already upgraded to the latest firmware at the factory.  The picture was out of the box beautiful.  Blu-Rays, DVD's, and HDTV (comcast) are jaw dropping gorgeous.  It looks better than my 40\" Sony KDL-40V2500 that I have been very pleased with as well.  My mom loves this little XBR and I am very pleased.  When it's time to upgrade my 40\", I'm going for the XBR line.", "Date": "December 31, 2009"}, {"Title": "HD tv comments", "Author": "M. hansen", "ReviewID": "R2IDGGO6NTRLB6", "Overall": "5.0", "Content": "tv was delivered on time and in perfect condition. great pricehappy with the product and service. glad that I did not buy from a retail store", "Date": "December 29, 2009"}, {"Title": "Very good quality TV for the price", "Author": "Digitalover \"DIGITALOVER\"", "ReviewID": "R1HMMC7QV99LCN", "Overall": "4.0", "Content": "I bought this on thanksgiving sale. Similar size 32\" 720P were selling for 400+. But I am glad that I purchased this one from Amazon. There is no darkness so for. I think these new TV set got firmware updated already. The only complain is channel surfing. It take around 5 second to land on next channel. I use DishDVR. So no problem for me. The startup time takes 10 seconds. I can wait. No problem. Connected laptop. It is really crisp and clear. I dont have any complain about the sound. Over all I am very happy with the purchase. 1080P will be helpful to watch HD content on youtube and othere video hosting places. Future proof TV set.", "Date": "December 15, 2009"}, {"Title": "Great HD TV Value", "Author": "Richard A. Dangelo", "ReviewID": "R4VPOP5TRVC6Y", "Overall": "5.0", "Content": "This is my second Sony Bravia XBR.  The latest version is not only a better set but came with a terrific price.  This was an excellent value and a high quality product.  I am enjoying my new Sony Bravia very much.", "Date": "December 2, 2009"}, {"Title": "I do not regret this purchase!!!", "Author": "K. Herber", "ReviewID": "R37VP0NUG1CO13", "Overall": "5.0", "Content": "The picture quality is AMAZING! Especially when watching Blu Rays. I now truly enjoy watching movies at home. The sound was much much better than I thought it would be after reading others reviews. However, I did buy a Bose computer speaker system to enhance my movie watching enjoyment. This is my bedroom tv so I didn't see a need for a whole surround sound setup. It does take a few seconds to power up but I don't get anxious for it. Other people make it sound like they are missing the first 5 minutes of a show or something. It is literally like a 5 second wait but worth it for energy saving. I hate how long it takes to change the channel on any TV these days but I have a TIVO so I don't have to be annoyed by that feature. Everyone who comes over comments on how much they like my tv. Some have went and bought one after seeing how nice this one is. I did a lot of research before deciding and am very happy with my decision.", "Date": "December 2, 2009"}, {"Title": "sony lcd tv", "Author": "big al", "ReviewID": "ROH57NAINIZC6", "Overall": "5.0", "Content": "Great product, I really love hd. Spend the extra money for top of the line you won't be disapointed. Works perfect with my over the air antenna, if not better than direct tv. Save 30% from retail. Shipping was to my door, open box and plug in for free, beat that. I will trade with them again.", "Date": "October 7, 2009"}, {"Title": "Great LCD TV!", "Author": "Frank J", "ReviewID": "R2CP894W6GOGQY", "Overall": "5.0", "Content": "I recently upgraded from my old CRT TV and have been completely satisfied with my purchase. We did compare LCD TVs in a showroom and the Sony Bravia clearly had the best picture. It had sharp detail and the best blacks of all the brands. The only weakness is the sound because of the small speakers but there is an output so I can use my stereo system and it sounds great. If you have  home theatre system that will work as well.", "Date": "October 5, 2009"}, {"Title": "Excellent TV", "Author": "J. Chanto \"Chanto\"", "ReviewID": "R2JXTD5LIB6DQF", "Overall": "4.0", "Content": "I bought this TV only for gaming purposes and I do not have any complains.excellent tv", "Date": "September 12, 2009"}, {"Title": "Love This HDTV", "Author": "The Old Guy", "ReviewID": "RSZSUAXL6VG3S", "Overall": "5.0", "Content": "I got this for my ex-wife,YEP!!Still want to be kind to Her. Didn't have a lot of extra room however this fit just fine.  Works GREAT and Most of ALL \"She's very pleased.\"  Great Buy Wonderful Picture w/o being very over priced !!  The Old Guy !!Sony BRAVIA XBR KDL-32XBR9 32-Inch 1080p 120Hz LCD HDTV", "Date": "September 8, 2009"}, {"Title": "Nice TV, But LG is Better", "Author": "TKY", "ReviewID": "R37T1KO7GQK1E0", "Overall": "4.0", "Content": "We researched and looked at both this TV and the 32LH40 model from LG, and while the Sony is a very nice TV, the LG is nicer (and less expensive). Except for BRAVIA, which is Sony-exclusive, the LG and the Sony pretty much match each other feature for feature. Both are 1080p, 120hz, and 24p True Cinema. But the LG has 80,000:1 contrast to Sony's 40,000:1, and there are less artifacts on the LG with fast motion. We went with the LG.", "Date": "April 16, 2009"}, {"Title": "KDL-32XBR-9 Review", "Author": "Loyalty \"Loyalty\"", "ReviewID": "RGHIB59KLKD2G", "Overall": "5.0", "Content": "This Monitor is amazing. It has lived up to everything that is expected of it. The picture quality is absolutely stunning in 1080P. The sound is pretty nice as well, alot of people have complained that it isn't loud enough but for a Monitor it is plenty loud and I would'nt expect much more. I would like to clarify something that another review wrote about, they said it did not pick up thier basic cable signal. I don't what the problem was but I have basic cable and NO CABLE BOX and it picked up every channel I had before I got the Monitor and also picks up all the Music only channels now as well as a few HD (1080I) channels as well. I looked on the back and the monitor was made in July of 2009. I have no complaints about this Monitor what so ever. If you are looking for a 32\" LCD this is hands down the one to go with. I wished I had the budget to buy the 46 or the 52\" XBR 9. For those of you who don't know anything about the Sony XBR line, let me put it to you in an easy to understand explanation, Toyota has it's High End cars under the name Lexus, Honda has it's high end cars under the name of Acura and Sony has it's High End Monitors under the name of Sony XBR. If I had to complain about anything it would be the lack of info. in the paper user manual that came with it, I wanted toilet reads while I waited on the Cable to auto program and there isn't much there. lol Does'nt matter what size you are looking for get the XBR line and you will be absolutely blown away by what you get.", "Date": "October 21, 2009"}, {"Title": "TV Lemon", "Author": "csgarfinkle", "ReviewID": "RH1SKA75LRCL0", "Overall": "1.0", "Content": "My family has been buying Sony TVs since the mid-1960s. I already own two Sony Tube TV but decided it was time to purchase a new flat screen TV. I purchased a  Sony Bravia XBR KDL-32XBR9 based on my past experience with Sony products and consumer reviews. I put the new TV in my remodeled kitchen - the picture quality was great. Unfortunately, I lost the picture within a month. It seems the HDMI connections failed. I notified Sony Customer Service and within a week a technician came out and replaced the circuit board. The TV was back in business; however, within another month or so,  the HDMI failed again. I notified Sony Customer Service again and they promptly came out and fixed it again. This time I wasn't too happy so I wrote to the head of Sony USA and complained. I said while the Customer Service was great, I wasn't happy that a new TV would fail so soon. I wrote that I've bought 5 Acura cars since their inception and Apple Computer products since 1989 and none of these products have ever failed like my new XBR. I also explained that while  Sony does offer a refurbished TV in place of a problem TV under warranty that wasn't the point and explained that if I wanted a refurbished TV I would have bought one - I bought a new TV and expected it to work. After the head of Sony USA received my letter I got a phone call from a Customer Service Rep. She acknowledged my complaint and said because of my problem that Sony was going to extend my warranty for another six months. I told the rep while that was nice it doesn't do me any good since I already have  Sony Extended Warranty coverage. Well to make a long story short, the HDMI connection has failed for a third time last week. I put another call into Sony Customer Service using the so-called special phone number the last Customer Rep gave me. The new rep that answered the phone reviewed my case and then came back on the line and said because of the problems my TV was having, he would have to turn the problem over to a special group. The rep said the someone from the new group would contact me in a day or so. Well, that day or so has come and gone. So much for ever buying another Sony product. This TV gets one star for looks and nothing more. Now I know why DirecTV engineering no longer uses Sony TVs.", "Date": "March 5, 2010"}, {"Title": "Bad experience with Amazon and J&R; Electronics", "Author": "Rishikesh", "ReviewID": "R2UGCU2BN1LO59", "Overall": "4.0", "Content": "Hello:I had ordered this TV from J&R; via Amazon on the day after Thanksgiving 2009. More than 10 days later the order was canceled by J&R; stating that they were out of stock and all the while they were still advertising the TV on Amazon. As soon as I mentioned this to Amazon they took the advertisement off. Later amazon started selling the TV themselves. I asked Amazon (at least 4 to 5 times) if they could honor the transaction but to no avail. Later I contacted J&R; and they offered to sell me the TV for the same price (as on the day after Thanksgiving). Again their Billing department gave me a hard time. When I got the TV I found that it had a big white cloud right in the middle. I called Sony and exchanged it for a new one. Considering the hassle I went through and the price I paid for a 32\" TV, this was not at all a good experience.The TV as such is great. This is my first LCD TV; the picture quality is just great! everything else is good or OK. I would recommend ordering the TV directly from Sony, they sell it at the same price![...]", "Date": "January 30, 2010"}, {"Title": "Welcome to World of High Definition Television Sony Style", "Author": "Vincent E. Martin \"Darkbard\"", "ReviewID": "R2H91X73M4867K", "Overall": "4.0", "Content": "Bottom-Line: Despite the rather high entry price ($1199.99) I have nothing but enthusiasm for the \"Sony BRAVIA XBR 32-in LCD HDTV.\"I am a man; as my wife will most surly attest.  And like \"almost\" all men I love all things electronic; the more buttons, LED's, and controls, the better!  No, I do not spend all of my time buried knee deep in the written word, or studying the arcane and convoluted tomes of computer manuals.  I do take an occasional break and lose myself in the increasingly unwashed world of television.  And when I do I want to behold a picture that is bright and brilliant, and as vibrant and sharp as the world itself, and with sound that rivals the richness of my living room Bose 501's. So eventually I had to enter the sweet spot that is High Definition Television or HDTV.With the move to an all digital broadcasting standard next year the wife and I decided to replace our trusty 32\" tube Sanyo with a 32\" \"Sony BRAVIA XBR Series Black LCD Flat Panel HDTV.\"  At first I had thought to purchase the non-XBR model of this same screen size, but in the end decided to spend the movie and get something I knew we would grow into; after all the Sony BRAVIA XBR 32-in LCD HDTV has a whopping (4) HDMI inputs as well High Definition Composite Video, and (6) audio outputs!So, off to the Internet and Circuit City.com (and the brick & mortar storefront) I surfed to read, look, listen, and feel.  Sharp, Phillips, Vizio, Toshiba, Samsung, and Sony all fell under the Bards' discerning microscope.  In the end, after about a four month search and countless hours of rumination, the Sony BRAVIA XBR 32-in LCD HDTV came out the clear choice.I briefly considered Vizio because of the cost (they are wonderfully cheap), but I read too many horror stories about the unit(s) catching on fire, or those that just stop working after a year or so; I passed.  I passed too on the Sharp Aquos after reading review after review about their less than stellar reliability record.  After comparing the BRAVIA and the Aquos side-by-side on the showroom floor I have to say that the two displays were close, but in the end Sony got the nod because it is a name I can trust and almost all of the components in my home A/V system are Sony.The beautiful black Sony BRAVIA XBR 32-in LCD HDTV (model number KDL32XBR6) is a true flat-panel that offers up to 1920x1080 Full HD 1080p Resolution, as well as Digital Media Extender (DMex), BRAVIA Engine 2 Technology, Advanced Contrast Enhancer (ACE), Enhanced (XMB) User Interface with rich 3D Graphics, 24p True Cinema, and (4) HDMI (High Definition Multimedia Interface) ports.This plethora of video-enhancement features helps Sony BRAVIA XBR 32-in LCD HDTV deliver an excellent video image straight from the box.  The factory video settings were fairly accurate, though the screen was rather bright; a screen button on the slim-line remote control allows you to toggle through a number of pre-defined screen settings in order to tone down the brightness.  I plugged the television into the Dish Network ViP 722 HD satellite receiver via an HDMI cable and away I went, nothing could be easier.However the \"Sony BRAVIA XBR 32-in LCD HDTV\" will accept all matter of inputs including composite video, S-Video, and good ole coaxial cable.  Digital as well as analog audio outputs are available if you want to connect the unit to an A/V receiver.  I utilized the analog audio connection and I am quite please with the sound.  Be forewarned: if you use the audio out connections you will not be able to utilize the internal speakers.But if you do decide to utilize the \"Sony BRAVIA XBR 32-in LCD HDTV\" internal speakers, you can't go wrong they feature Sony's patented TruSurround SRS technology.  TruSurround delivers compelling 5.1 multichannel virtual surround sound experience through any two-speaker playback system, including internal television speakers and headphones.  High-quality virtual surround sound can be experienced with just the two hidden, downward-firing side-mounted 2.2-channel dome speakers built into the TV along the bottom of the display.All of the controls for the \"Sony BRAVIA XBR 32-in LCD HDTV\" are located on the top of the unit--not very convenient, especially if you place the unity inside of an entertainment unit, like I did.  Since the entire chassis is black including the control buttons, it has impossible for me to get at said buttons.  No matter, the remote control is excellent.First Impressions:The Sony BRAVIA XBR (KDL32XBR6)32-in LCD HDTV, is the company's top-of-the-line, 32-inch LCD high definition television and is the idea HD solution for our rather tight living room space.  It takes its place in the room without overpowering the space.  The picture quality is superb, and without peer.  The colors are rich and vibrant, sharp and deeply accented.  And the blacks are indeed black!  In addition to the aforementioned satellite receiver I have also mated the Sony BRAVIA XBR 32-in LCD HDTV with a black Sony DVP-NS700h up-scale HD DVD player and the combination of the two serves up a stunning picture.Speaking of the image, I have absolutely no complaints about it; in fact I could not be happier with the image quality and features the Sony BRAVIA XBR 32-in LCD HDTV brings to the viewing table.  My satellite HD receiver only offers 1080i resolution while the Sony DVP-NS700h offers true 1080p.  With (4) HDMI inputs, including one on the left-hand side of the unit, the unit is highly versatile and expansive.  The on-screen menus are many, but they are easy to use; I spend about 10 minutes familiarizing myself with the well laid out controls and I have now mastered them.I have lived with the \"Sony BRAVIA XBR 32-in LCD HDTV\" for almost a month now and I have to save that I love the set and do not regret my (expensive) purchase.  My spouse, who at first was a skeptic, loves the set as well.  The sleek design and black color complements the décor in our living room.  The picture can easily viewed from straight forward and slightly off-center; too far off center however and the image loses a considerable amount of brightness.Despite the rather high entry price ($1199.99) I have nothing but enthusiasm for the \"Sony BRAVIA XBR 32-in LCD HDTV\" and I have no problems recommending the set.  The set is just the right size for our rather uniquely shaped living room and is well worth the wait.  Now that she is in place and running I couldn't image viewing television without it.", "Date": "January 13, 2011"}, {"Title": "shipping by U.P.S", "Author": "William Zika", "ReviewID": "R2KNTO7A0QAFEC", "Overall": "5.0", "Content": "our t.v. was dropped off at our post office full of lock boxs,In a common area. (I didn't think that U.P.S was allow to deliver packages to a post office address) Needless to say my 32 inch sony t.v. was stolen. THE viedo and audio center where I purchased the t.v. from,Replaced it at once. so I now have my t.v. Delivered and signed for from FED-EX!! I tried to call U.P.S for three days, Could not get anyone to answer a phone. I will do my best to never ship another package by U.P.S.  Sincerely Bill Zika", "Date": "January 23, 2010"}, {"Title": "SONY XBR9 32", "Author": "Harland W. Weatherly \"HWW\"", "ReviewID": "R19RXU3G02QU3T", "Overall": "5.0", "Content": "This LCD is outstanding, it has a top-notch picture, the clarity is excellent, it is hard to beat this set!", "Date": "January 4, 2010"}, {"Title": "Great T.v", "Author": "W. Lopez \"Bob\"", "ReviewID": "R4DU5UC06K1FY", "Overall": "5.0", "Content": "Everything seems to be working except for a minor glitch when i played a game the speakers stop working but i fixed it.", "Date": "December 28, 2009"}, {"Title": "Great set", "Author": "BJB", "ReviewID": "R1KWSSJ0ZFTU4K", "Overall": "5.0", "Content": "Received Sony Lcd in a short amount of time. No problems after was hooked up. Just will have to get used to the short screen as compared to old style TV.", "Date": "May 7, 2009"}, {"Title": "HAPPY w/PURCHASE", "Author": "G. Boucher", "ReviewID": "RG2L2Y25IP2M1", "Overall": "5.0", "Content": "THIS TV WAS RECOMMENDED BY A FRIEND.  HIS SON HAS ONE AND LOVES HIS.  WITH THEIR HELP AND KNOWLEDGE, THAT'S HOW I CAME TO PURCHASE THIS SONY.", "Date": "October 21, 2009"}, {"Title": "Sound & picture quality issues", "Author": "pepper", "ReviewID": "R1H1B8JT63121E", "Overall": "1.0", "Content": "This TV is by far the worst Sony product I ever purchased. Despite multiple software upgrades. The picture quality in dark scenes is appauling. The HDMI connnction sound goes off, crackles and my new HD Cable box switchs back to 480I from 1080I.Its junk, don't buy it.", "Date": "January 19, 2012"}, {"Title": "Surprised--Not Worth the Money", "Author": "Ron", "ReviewID": "R1AL2FPGCHOEW1", "Overall": "1.0", "Content": "I have had this set for several months now.  Long time fan of Sony.  Have a 47\" KDL something upstairs and it's very nice.  Had multiple 27\" Trinitrons over the years, and 24\" WEGA--Loyal Sony user.  I bought this from Amazon even though the price was not quite as good as others.  Got terrific shipment and delivery.  Very satisfied with Amazon.But, this set is surprisingly poor.  Sound is tinny and the darn speakers sometimes vibrate. User interface (menus) are clumsy.  The Sony Internet Connection thing, Bravia Link or whatever they call it, is -not- available on this set.  Why not?  For close to [...] bucks you'd think they would put everything on it.  Picture is no better (and with the well known contrast problem, not as good as) sets at half the price.  I find it to be pixelated and not as sharp as I would expect.  I bought a 32\" Phillips set for my Mom at Sam's for half this price:  Better picture, better sound, easier interface...  Better set for half the dough.  Two of the HDMI inputs and the PC input on the Sony are on the SIDE of the darn thing so these thick cables stick out the side.  The base is cheesy and does NOT allow the set to rotate--what a rip off.I would NOT recommend this set.  Period.  I would not buy it again.  I will not buy another Sony.  Samsung or Toshiba will be my next buy...Uncle Ron", "Date": "September 26, 2009"}, {"Title": "XBR9 Not As Good As XBR6", "Author": "MattC", "ReviewID": "R1KV5WBZ1FXHPP", "Overall": "2.0", "Content": "Well as the title of my review states, I didn't like the xbr9 as good as the xbr6.I bought the xbr6 at Best Buy.I got it home and hooked it up and loved the picture and sound.I also liked the TV Guide feature and the PIP feature.I liked this tv so much that I decided to take it back after a couple of days and get the newer xbr9.This is probably one of the biggest mistakes I have ever made.I didn't like the sound through the tv speakers as well as the xbr6 and the picture to me was grainer.Well, to make a long story short,I boxed the xbr9 back up and returned it to Best Buy.I was hoping that when I got there the xbr6 that I had bought first was still there.When I walked back in the store, a surge of relief came over me.They hadn't sold my xbr6 yet.Remember, this was the only xbr6 they had in the whole town because it was an older model.I was so thrilled that I was able to trade my brandnew xbr9 back for my xbr6.When I got it home I started to breathe normally again knowing that I would never lose this model again.I agree with one of the reviewers on the xbr9 that the xbr6 is better.The xbr9 just looked and sounded so much worse in my house at the same exact hook-up place as I was using for the xbr6.Anyway, now I am so thrilled to have things back the way they were before. I made a terrible mistake. Luckily,I was able to undo the mistake I made.I think I thought in my mind that since I liked the xbr6 so much,I would really love the xbr9.Not so.I really thought the grass was greener on the other side but it wasn't for me.Sony Bravia XBR-Series KDL-32XBR6 32-Inch 1080p LCD HDTV", "Date": "May 11, 2009"}, {"Title": "Slow as turtle", "Author": "Bonsue Boulom", "ReviewID": "ROML6QEKGWTOY", "Overall": "1.0", "Content": "I am a big fan of Sony when it comes to TV. I bought 32XBR4 in 2007, trusted the brand so much, didn't buy extended warranty, a year and a half later, tv got virtical lines, took it to the repair shop, they told me it's the panel, and if I need to repair it, it will cost me $800 just replace the panel. I was so heart broken, could not look for another tv for about 6 months. April 2009, new 32XBR9 came out, I thought newer is better, because it should have new technology. I got all excited, went to Best Buy and got myself another Sony TV 32XBR9. At first it didn't hit me, I thought maybe because it's still new, 2 weeks has goneby, the damn TV was still too slow, 2X 1/2 slowwer that XBR4 I had before, plus the features, you have to use menu, there's no button on the remote, very annoying, inconvenient, and waste of my money, so I return it after 3 weeks. Right now, I am still hurt, and still without tv in my room, SONY is a BAD name for me.", "Date": "June 22, 2009"}, {"Title": "No Sleep Timer Button  :-(", "Author": "M \"M\"", "ReviewID": "R2DTY51GQXRG2C", "Overall": "3.0", "Content": "I viewed this TV in a store and liked it, but they couldn't show me the remote.  I was ready to buy it here, but I found several reviews that stated Sony has now removed the sleep timer button from the remote.  When are companies going to start 'getting it' that around 32\"-37\" is now the size TV used in bedrooms (easy on the tired eyes!) and the sleep timer button needs to be easy to set - clicking through menus is not going to cut it when I'm rolling into bed.  I'm going to buy a Toshiba that I also saw - looked amazing (yes and it has a sleep button haha)", "Date": "August 18, 2009"}, {"Title": "Watch out for Sony quality", "Author": "John F. Doyle", "ReviewID": "R2UX63KCL29P91", "Overall": "1.0", "Content": "We purchased the Sony 32XBR4 (a couple of versions ago) and we were very happy with it until last week. The picture turned into vertical stripes. Called Sony. Sorry, out of warranty. (by 4 months!) Repair shop said it's likely that the LCD panel is dead, meaning it's cheaper to replace the TV. I checked the reviews on Amazon of the TV we bought, and there are many reports of the same problem as our TV. Sony, are you reading this? People read this and don't buy your TV's. Our older 27 inch WEGA is still working like the day we bought it. How is it that the quality can go down so fast? I believe the issue is more widespread than just our TV. Grrrr.", "Date": "July 30, 2009"}, {"Title": "Not worth the money", "Author": "Scott Perman \"DSPerman\"", "ReviewID": "R2119I8BL634O2", "Overall": "1.0", "Content": "First of all, the next model down in the Sony line up is over $100 cheaper and almost the exact same TV.  This one says it is an XBR, but it does not have the crosslink menu.I have a 50\" sony XBR that I love, but this 32\" is a huge dissapointment.I cannot get it to work consistently with my DirecTV receiver, so it's going back and I'm trying a different brand.", "Date": "July 1, 2009"}, {"Title": "Not Competitive for Price", "Author": "Justin Anderson \"Justin Anderson\"", "ReviewID": "R2F4423FOP9PFI", "Overall": "1.0", "Content": "At one point in my life i was an avid sony fan.  Ive owned several Sony Trinitron TV's as well as various other Sony products.  I do not think this TV is worth its price point.  I was in the market for a new 32 inch LCD to replace my old 32 inch Samsung LCD from 2005.  I really was only going to consider another samsung or a sony, because of how pleased i am with my playstation 3.  I'm going to start by saying that the XBR9 has a nice picture, but thats where it ends.  The TV takes an honest 30 seconds to turn on, had an extremely cheap build quality, pathetic sound, and a design that is just not on par with a comparable samsung. The tv cant even pivot on its base.  The base of the tv is one of the cheapest looking piece of garbage bases that i have ever seen.  The set does not deserve the XBR branding.  In the end when i saw the samsung LN32B640 right next to the XBR9 at best buy there was no comparison.  The XBR looked like it was a VIZIO next to the samsung.  Needless to say i went with the samsung.  Take my advice go look at this tv in person before you make a decision.", "Date": "December 21, 2009"}, {"Title": "Sony Is Great But Now Looking For Large Plasma...", "Author": "Herbert S. Doane", "ReviewID": "R23QOLFZRHAWJI", "Overall": "5.0", "Content": "The Sony KDL-32XBR9 purchased from Amazon is excellent and so was the cost, but now looking for a large screen Plasma for Basement Family Room. Anyone have any suggestions, like Samsung or Panasonic and which model?", "Date": "October 15, 2009"}, {"Title": "Mine lasted about 14 months.", "Author": "M. Impson \"Woodworker\"", "ReviewID": "RNXVNNO1HP7ZO", "Overall": "2.0", "Content": "The picture was incredible while it lasted.  After about 14 months my 32\" HD Sony started displaying a double image.  The TV repair man said it was a bad solder connection that would have costed a couple of hundred dollars to fix.  I'm back to watching our old tube TV.  The old technology is much more reliable and costed a lot less.  Save your money, folks.", "Date": "July 22, 2009"}, {"Title": "piece of Trash", "Author": "Hans M. Petersen \"Michele Hemenway\"", "ReviewID": "R3CSKJ703OWSDL", "Overall": "1.0", "Content": "They wont' let me give it NO stars but thats' really what I would do if it would. This television is three years old and has died needing a completely new picture tube,etc for which we could replace it. DO NOT BUY THIS ; we thought it was all these wonderful things ,too, until it just died one day out of the blue and sony said \" good luck wiht that, the warranty on the set has expired.\"Sony would not do anything. Paid a fortune for it new.Piece of *****", "Date": "December 28, 2009"}, {"Title": "This is a strip down version of XBR6, sad to know SONY will makes their good name", "Author": "D. Hsu", "ReviewID": "R1V2CC2ECUD5NQ", "Overall": "1.0", "Content": "to this low. If you thinking of a dummy monitor this is the one. XBR9 is like a India car or a third world country product.", "Date": "September 23, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "A 16:9 Full HD 1080p Resolution Panel provides optimum resolution from any HDTV source that delivers 1080p content\nAdvanced Contrast Enhancer creates a dynamic contrast level of 40,000:1 to produce deep blacks in darker scenes and fine details in shadows\nMotionflow 120Hz technology reduces judder and sharpens fast-moving images for a crisp, more natural picture\nThe BRAVIA Engine 2 fully digital video processor uses unique Sony technology to reduce visual noise, improve color, and sharpen image\nGet versatile HD connection options with seven HD inputs, including four HDMI inputs and a PC input", "Name": "Sony BRAVIA XBR KDL-32XBR9 32-Inch 1080p 120Hz LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51ArchpMd-L._SX300_.jpg", "ProductID": "B001TKJ7XQ"}}