{"Reviews": [{"Title": "Low price leader", "Author": "Recursive \"Recursive\"", "ReviewID": "R116WQPDYKDMWE", "Overall": "4.0", "Content": "At least for now this TV seems like the low price leader among new 2009 52\" sets.  I am very happy with my purchase after 2 weeks of ownership.  I am watching it without any custom tweaking at all and blu-ray looks great, and ATSC digital broadcast reception via a RCA ANT1500 Large Multi-Directional Digital Flat Passive Antenna (White) is excellent too.I bought this sight unseen because the price was right and it seemed to have the important stuff and not the frills, which was just what I wanted.  Also previous models of the Aquos line got decent reviews.This is my first large LCD so I don't have much to compare with.  The features seem to be just a somewhat more mature version of last years features which is great if you don't want the dubious advantages (and expense) of things like 240hz mode, LED backlighting or ultra-thin screen.The built-in sound is decent with hidden, downward pointing speakers and I use it for live TV (ie News and Sports) but for movies I have it connected to an AV surround amp.Looks great mounted on the wall (nicer than on the stand).Pros:  - 10-bit screen  - non-glare screen  I have it next to large window and although you can certainly see the light reflected, it is a kind of matte look not a sharp reflection.  And the brightness of the screen can overcome whatever reflection there is except in dark scenes.  - 120hz mode  I really don't see a lot of difference so I tend to leave things in the regular movie mode, even for baseball  - good response time  subjective, nothing to compare  - good black  subjective, nothing to compare - plenty of connections - can custom label the on-screen menu inputs  well, it's important to me :)Cons: - no PIP  I don't care - no DLNA/Internet connectivity  I'm connected to a MediaPC so this would be redundant except for firmware upgrades which have to be done via a USB port (not sure if end user can do that) - the USB port is good only for service, not, for example, loading home pictures - again with a MediaPC it's not needed.The delivery via Amazon/CEVA was by a couple of very nice guys who brought it in, unpacked it, put it on the stand (which I later removed) and turned it on, which was exactly what I wanted and expected.  No dead pixels.  15 month warranty (12 month plus 3 more for registering online) which I hope I don't have to use.", "Date": "May 5, 2009"}, {"Title": "Excellent TV for the price!", "Author": "Scott M. Tingley", "ReviewID": "R8ZQSJB1JGDPX", "Overall": "5.0", "Content": "Just received this TV yesterday and had it up and running in no time at all. I have successfully connected my Cox HD-DVR, Roku (Netflix device), and Pioneer DVD player (1080p upconvert) to the TV...all with new HDMI cables. Visually this TV looks great, I like the piano black finish and the slight champagne gradiant at the bottom...will look even better once we get it up on our wall I think (wife likes the look too).Upon first powering it up I was greeted with a few simple setup questions all laid out nicely on a very easy to read menu system. Once done I was up and running on our Cox HD-DVR. I went to a basketball game that was on and being broadcast in 1080i. Wow, simply wow. Amazing picture quality...and I hadn't even tweaked the settings yet. After watching a few more channels I switched over to my son's Cars (Pixar movie) DVD to check out the 1080p upconvert and the 120Hz dejudder capabilities. I had never really been able to detect the difference of this in big stores, but wow in the Cars movie at home it was very evident and actually looked really cool. The animation was sooo much smoother, it took a little getting used to but now I'm just amazed at it. Some might not like it, but I think most will.SD channels actually look suprsingly ok. Was expecting them to look like total crap on this size TV, but they dont.Later in the evening I started to get down to adjusting the video settings to get the blacks a litter better and the color to be just right (for my eyes anyway). Took about 30-40 mins but I think I have everything set the way I like it, and it looks even better than the initial settings. Blacks are VERY good.For $1468 shipped, this is an amazing TV. Sure it doesn't have some of the newest bells and whistles...but for some of us who don't have a need for those or the added cost, its nice (ie, ethernet port, USB port, 240Hz, etc).There are only 2 little downsides I have come across:1) The sound is only so-so, but that was to be expected...most TVs just aren't spectacular. The sound is very clear, and voices are easy to hear/understand...but just no bass at all. So movies seem a little drab in the sound department. We will be adding a sound bar soon.2) The viewing angle could be a little better I think. The image gets a little washed as you move to the sides of the TV. I was able to minimize some of it by tweaking the backlight level and contrast/brightness. But still could be better. The stand on this unit swivels though, so we just angle it towards the couch or chairs we will be in and the problem is solved.", "Date": "May 8, 2009"}, {"Title": "Calibration Settings + Tips/Tricks", "Author": "April King", "ReviewID": "R3UGYPXFYFKQH4", "Overall": "4.0", "Content": "Since I have owned this TV for a few months now, I thought it would be helpful to share a few tips and tricks I have learned:PROBLEM: INCOMPATIBLE AUDIO SIGNALAll my A/V devices (360, PS3, Wii, Samsung DTB-H260F) were connected to my Onkyo TX-SR607 receiver with HDMI, which was set to output to my Sharp Aquos LC-52E77U. And, although the receiver was set to \"Audio TV Out\" off (and even with it on), the TV kept popping up this error:\"Incompatible audio signal has been received, please check the output signal.\"It only pops up for a few seconds, and only when I would switch devices or resolution or whatever. Still, pretty annoying. Connecting the devices directly to the TV via HDMI caused the same error - the only time it didn't happen is when there was 2ch 44.1/48Khz PCM involved.Unfortunately, unlike every other TV I have ever owned, the Sharp doesn't have a menu option to disable audio. Muting didn't help, either.The solution? Set the audio volume to 0. No more error!PROBLEM: NO DEVICE DETECTED (DVI -> HDMI)When I first got this TV, I plugged in my Mac Mini, using a DVI -> HDMI cable.  After using it for a bit, the TV would stop recognizing that the Mac Mini was connected.  It turns out that, whenever the Mac Mini would be rebooted or would go to sleep, the Sharp would refuse to recognize that it was connected anymore.The solution? Physically unplugging and plugging in the TV (not just pressing the power button), and disabling sleep on the Mac. I still have to do this unplugging dance occasionally - like for system updates - but not as often as when sleep was enabled. I guess that's the price you pay for a beautiful 1080p HDMI signal, as opposed to a letterboxed 1600x1200 VGA signal - the max this TV supports.CALIBRATION SETTINGSThis TV has some definite problems with blues in areas of high contrast.  Here are the best settings I have found, in order of their appearance in the menus:OPC: OffBacklight: +6 (you can adjust up or down a smidge if need be)Contrast: +36Brightness: -6Color: +1Tint: +1Sharpness: -1CMS Hue/Saturation/Value: 0Color Temp.: Low (leave at Mid for color managed devices like Macs, or OTA TV)R Gain: +11G Gain: 0B Gain: -10Fine Motion Enhanced: Off (leave on for sports if you prefer)Active Contrast: OffGamma Adjustment: 0Film Mode: Off (I used Advanced(Low) for sports)Digital Noise Reduction: OffMonochrome: OffRange of OPC: +16 Max, -16 Min (it is off, anyways)", "Date": "November 7, 2009"}, {"Title": "Fantastic Deal", "Author": "Thomas S. Danel \"ThomasD\"", "ReviewID": "R108S5RPAYNDLF", "Overall": "5.0", "Content": "This was my second LCD TV purchase in the last year, so needless to say I have been reading reviews and doing research for nearly a full year now.As soon as I saw this new 52inch 2009 model for $1450 I had to seal the deal, and I am very glad I did.There is no banding on my TV ( this was a previous issue with some sharp series, however I cannot say that no TV in this series has banding I only speak for the one I have)Straight out the box picture is amazing. I am still waiting for Satellite hookup, so for now I have tested my PC input, Xbox, and PS3. The picture on each one blew me away. I have not tweaked the video settings yet, because this is a new TV there are no calibration settings posted yet. Watched Underworld on BlueRay and was astounded at the clarity for the price.Yes, I have seen better pictures on TVs in the store, however these TVs were nearly 2000$ more than what I paid for this one. And the extra 2000$ does not justify the small incremental increase in picture quality IMO.As far as sound goes, I would suggest using at least a soundbar if not a full surround sound.Perfect TV for Value shoppers. This TV is by far the best bang for your buck that I have found in the last year.", "Date": "May 20, 2009"}, {"Title": "Great Set", "Author": "What the Frack?!", "ReviewID": "RG5LBWU3FW9IV", "Overall": "5.0", "Content": "I'm using this set with:Yamaha RX-V730 A/V ReceiverDefinitive Technology SSA-50Definitive Technology ProSub 800TiVo Series 3 HD w/ComcastXbox 360 w/HD DVDNintendo WiiEverything looks great on this set. Watching the Dark Knight was nice since you can actually see details in the areas that are dark. The colors aren't overly saturated and the picture is crisp. Shaun of the Dead in HD was also very crisp and detailed when the areas were bright.Xbox 360 is great on this set. The colors are very easy to look at and everything runs very smoothly on it.The screen cuts down on a lot of potential glare that may come onto it. There are more than enough connections for me. 15 month warranty and being part of the AQUOS Advantage Program in case anything happens.I'm not using any of the set's internal audio processing or outputs so I have no opinion of that. I'm also using a Harmony remote, so I will not be using the included remote unless I absolutely need to.I actually think I am going to use the power save features too. The OPC setting which allows the TV to sense the surrounding brightness and adjust it's own brightness. This is supposed to save power and extend the life of the backlight.I would totally recommend this TV for the everything that it is and for the price.", "Date": "June 22, 2009"}, {"Title": "Excellent 120Hz LCD TV", "Author": "K.Q.", "ReviewID": "R29GSHDX9O2SHT", "Overall": "5.0", "Content": "The dimming issue is due to automatically backlight adjustment being selected.  There is also the programmable setting to limit the range of this auto adjustment.  There is a noticeable picture contrast and sharpness if you turn of the auto adjustment, and pick a different video mode.  Each of these mode gives a set preference for backlight quality.However, you have to play with this TV for a few hours to find all the settings to customize this TV to your liking.", "Date": "May 17, 2009"}, {"Title": "Best Price for the Goods", "Author": "Praz993", "ReviewID": "R12BT0NGW2HM4E", "Overall": "5.0", "Content": "I shopped a long time for TVs as you probably are doing right now.  As of the second week of June, this was the best priced TV for the features and size by far.But you already know that.So I'll try and help with your apprehensions.  The TV arrived neatly packed and pristine.  Not a mark on the box.  The delivery man had me inspect and sign-off, which I would have insisted on anyway.Switched on, hooked up an XBox 360 via HDMI and sat back in awe.  Not a single dead pixel as people often fret over moderately priced sets.The picture is stunning, although you do have to switch off the silly LCD Power Conservation option (OPC).  It does not at all read ambient light well and dims the set too low.  I still have to play with it perhaps.Overall the set definitely shines as its spec sheet would lead you to believe.  Action is blur-free and crisp.  Colors are bright.  Contrast is, forgive me, Sharp.The only criticism I have, which is not that bad anyway, is that it does require a significant calibration to look its best.  Saturation, contrast, brightness, etc, all have to be significantly changed out of the box.  The easiest and cheapest way to do this is to use any THX certified DVD (Pixar, Star Wars, Indiana Jones, etc) and use the THX Optimizer.  Else, you could use Avia Home Theater 2.0 which is more cumbersome.  If you are truly scared of electronics, I supposed you could pay the local TV shop to come and steal your money to calibrate it.That being said:  If you are sitting here wondering why this TV doesn't cost more than 6ave is selling it for, BUY IT. You'll win.", "Date": "July 8, 2009"}, {"Title": "Happy with set so far", "Author": "J. Ducroiset", "ReviewID": "RY4INW4ATMYGS", "Overall": "4.0", "Content": "This TV looks great had a friend who deals with Samsung LCD's all the time he felt the picture was comparable.  I was looking for a TV that had some more advanced options without paying too much.The Amazon delivery was great.I was concerned innitially because the contrast ratio was not listed and I could not find any reviews because the set was new, but I am very happy with the features and the number of inputs the set has.  Also the picture is great.", "Date": "May 14, 2009"}, {"Title": "Great TV for Blu Ray, HD TV and Gaming!", "Author": "Mike Honcho", "ReviewID": "RLOX2UG6UJLMP", "Overall": "5.0", "Content": "Wow.  I had been looking at 1080p 120hz TVs for at least 6 months.  I lost track of how many reviews, articles and forums I visited during that time frame during my search for information on the best buys and TVs to avoid.I had my heart set on a Samsung, but one look at this Sharp on the floor at my local costco and I was hooked.The picture is great.  I would rate it equal to the high dollar Samsung red line TV my folks have.  Blu Rays look awesome, my FIOS HD service is phenomenal and gaming with my PS3 is an exciting experience.The TV has everything you need, a ton of HDMI hookups, easy to use remote and on screen menus to name a few.The only negative aspect of the TV is the sound.  It is adequate for normal use, but if you are used to any type of surround sound you will be wanting more than the built in speakers.  I did have a Sony surround sound system, but it was of an older variety and didn't have the HDMI or optical outputs.  I ended up hooking up my Bose Ipod dock to the TV....sounds great!!In my opinion this is a ton of TV for the bucks!  Costco had it for $1300....", "Date": "December 20, 2009"}, {"Title": "jaymiskray", "Author": "J. Williams \"jaymiskray\"", "ReviewID": "R3RT556XL0199Z", "Overall": "4.0", "Content": "Sharp LC52E77U 52-Inch 1080p 120Hz LCD HDTV, BlackThe picture looks good right out of the box. Very good price for a good TV. I wasn't thrilled with set-up options w/ the LCD, it isn't very user friendly. I also have a 65-inch Mitsubishi High Def DLP and the picture is very comparable, but I do like the DLP picture slightly better only because I notice the individual pixels on the LCD if I get a little too close. The advantage to the LCD is the 120 HZ compared to my DLP. The DLP can't handle a fast/busy screen (ie. a large flock of birds flying across the TV) but, the LCD has had no problems with the fast/ busy screens. Otherwise, I have thus far been very satisfied with my purchase.", "Date": "June 9, 2009"}, {"Title": "What a great find!", "Author": "J. Miller \"Videophile-In-Training\"", "ReviewID": "R38M9T673N8W0L", "Overall": "5.0", "Content": "My wife and I have been shopping around for a new TV.  We had a 32\" Sony Bravia in the living room and wanted to get something a bit bigger.  We looked at the 46\" Bravia for $898 at Wal-Mart and we also had our eye on the new Vizio 55\" LED-LCD TV which as of now is selling for $1248 which is down from $1648.  We happened to be at the BX and saw the Sharp Aquos LC-52E77U on display and was originally marked $1,700, then marked down again to $1,100 and one last mark down to $897.97.  Having done no research on this TV I was a bit skeptic at first because we had done some researching on others.  Sharp never even entered my mind.  We decided to just go ahead and buy it.  The floor model was THE LAST one they had.  We purchased it on Sunday and had to come back on Monday to pick it up so they could get it off the wall mount and got an extra 10% off.  It was in great shape with no scratches except on the stand, and those are hard to see and I could care less.I have to say I am very impressed with image quality, but not so much on sound.  Our 32\" Bravia had better sound, but after Black Friday we will be picking up a surround sound system and new blu-ray player for the living room and moving our other blu-ray player into the bedroom with the Sony.  For what appears to be a 2009 model, I could not believe this thing had 5 HDMI ports along with others.  I was impressed.  I haven't calibrated the picture quality yet as I have been extremely busy since we set it up.  Once I get to that, I am sure the PQ will be even more outstanding.  It may not be LED, but for the price and size I really don't care.  It already has amazing PQ as it is being regular LCD, and the 120hz refresh rate was something else I was looking for which this has.  If you can still find one, I suggest picking one up.  The factory settings for PQ won't be the best, but I did adjust a little with the different modes and it looks way better.  Will go into advanced settings this weekend and tweak it more.**Update 25 Nov 2010**I found amazing calibration settings for this TV from this link in AVS Forums which I have come to find a great source of info for audio/video equipment:[...]Contrast: 30 (keep this one below 32)Backlight: -10....+14 (OPC)Brightness: +2 (do not change this setting)Tint: -2Color Sat: -3Sharpness: 3C.M.S. Hue: Default Settings (all at 0)C.M.S. Saturation: Default Settings (all at 0)Color Temp: HighFine Motion Adv: OnFilm Mode: Advanced (do not change this setting)Active Contrast: OffDNR: LowIf you experience lag while playing video games, I recommend using the game setting accessible via the av button on the bottom of the remote under the flip panel.  I noticed considerable input lag while playing games on the xbox 360 and when I discovered this setting, the lag went away.", "Date": "November 24, 2010"}, {"Title": "Great TV", "Author": "adriftinpa", "ReviewID": "RB9T5IVY44LIU", "Overall": "5.0", "Content": "I picked up this tv feb. 5 2010 and all I can say is what a great tv. Had it set up and working in 15 min. Regular cable is so so but thats not the tv's fault. I got the HD box and service from comcast and wow, what a picture. Supurb picture with a sony 1080p upscaling dvd player. Super picture also with the computer. Have a dual output graphics card with dvi output. I adapted the dvi to an hdmi cable and now have the most awesome 52 inch monitor.****************INSTALLATION NOTE: When connecting your computer you MUST use input 6, hdmi or pc cables.YOU MUST HAVE AN AUDIO INPUT TO GO WITH THE VIDEO INPUT EVEN WITH A HDMI CABLE. There is a 1/8\" diameter audio input jack in between the computer video inputs on the back of the tv and thats what I am using. The tv will not recognize the computer without video AND audio input together it will give you an \"incompatible audio input error\" message. It took me a bit to figure this out. Lets see. The tv only has 20 watts speaker output so the sound is only fair. I have the tv volume off and am running the audio out from th tv to a home theater reciever which sounds great. I love this tv lets see how long it lasts. Register online with sharp and the will increase the warranty. by 3 months. I think I will still purchase an SquareTrade 3-Year Electronics Warranty.Updated Nov. 19 2010: Still working great have added a Panasonic Blu-Ray player last weekend.(See my Blu-Ray reveiw) Just a superb picture with the Blu-Ray. I did run into a problem updating the firmware via the usb port. It keeps telling me its the wrong update file, bust Sharps website insists it the correct file. I will have to talk to cusomer service. If anyone else has this problem please post a solution.", "Date": "February 24, 2010"}, {"Title": "Great Balance of Features vs. Price", "Author": "Jungle Mogul", "ReviewID": "R3V37NPCTWUT35", "Overall": "5.0", "Content": "I've owned my Sharp LC52E77U for six months now. Paid $1507 and received it early June 2009. I shopped lots of sets and felt that this was a great set of features for the price in this size screen. It's my 1st HD LCD and the picture quality is superb. I have not had any problems with the set and would recommend others purchase the set at the current lower price. There will always be new bells and whistles, but I am very happy with this set and don't feel that I would need (or use) a set with more features.", "Date": "January 7, 2010"}, {"Title": "Awesome TV; perfect size; good price (1.3k)", "Author": "Nitin Alreja", "ReviewID": "ROUORPC2YBFKV", "Overall": "5.0", "Content": "I recently purchased a Sharp LC52E77UN and gotta tell you, the TV looks pretty darn awesome. Firstly I would recommend the 52\" size to anyone if you have the space. Now onto the picture quality - I was a bit disappointed w/ the quality of some of the SD channels (abc, fox, etc..), however others like food and discovery channel were definitey above par - I blame it on the DirectTV subscription I get in this condo building. I am waiting to get my Mini-DVI to HDMI cable I ordered from amazon to see the difference in quality/sharpness of true 1080p when I hook my mac in. I checked out the HD version of the TV's older models in best buy and it just looks plain awesome.I'll post pictures and more details about the TV in the upcoming weeks as I get to play around with it more.UPDATE 08/21/2009Got my Mini-DVI to HDMI cable few days ago. The macbook to TV hookup is awesome and the picture is phenomenal - crisp and clear. I also followed the calibration settings found at avsforum and a bit of my personal tweaking and the video quality increased drastically for both SD channels and regular DVD's[...]", "Date": "August 25, 2009"}, {"Title": "Top notch LCD TV", "Author": "8tracklover", "ReviewID": "R1J67ZHRWU2ING", "Overall": "5.0", "Content": "I've had this TV for over a year now and I still think it's awesome.PROS:awesome picture even when it's bright in the room.great for sports.easy access to hook-ups.CONS:as can be expected with today's big screens, the sound is not that great, but a sound bar will fix that, right?", "Date": "June 9, 2012"}, {"Title": "Excellent Value for the price", "Author": "Zia", "ReviewID": "RGVBFRMWLYGT7", "Overall": "5.0", "Content": "I've had this TV for a little more than a year, it does everything well - can't get a much better value for the price.Pros - Everything except for the speakersCons - None, you should expect to hook up a TV like this to a Surround Sound System", "Date": "August 23, 2010"}, {"Title": "AQUOS blinking power light", "Author": "MEB & TJB", "ReviewID": "RIWZUVHLFU685", "Overall": "5.0", "Content": "I received my new TV and turn it on, and after about 15 seconds it shut down.  It did this 2-3 times again.  The power light blinked about once per second.  After looking on the internet, I found the factory reset--unplug the TV, press and hold the channel down and volume up buttons while plugging the TV back in.  After, that it turned on and stayed on, so (fingers crossed) it will continue to work.UPDATE:  still powering off.  Sending it back.It is a nice TV. I will leave the picture review, etc. to the previous posts.  I also have the 40 inch AQUOS model for another room, and it has the same basic connections and setup.", "Date": "June 21, 2010"}, {"Title": "A great value", "Author": "N. Kersey \"kudzu\"", "ReviewID": "R14NFFDWXXN0A0", "Overall": "5.0", "Content": "This TV is a great value. Quality at a reasonable price.The sound could be better but hooked to a good home theatersystem it is great.", "Date": "June 2, 2010"}, {"Title": "Sharp 52\"", "Author": "Rakesh Parikh \"RakStar\"", "ReviewID": "R2Q0FJWJ17GAMF", "Overall": "4.0", "Content": "For bang for the Dollar, this TV is a great deal.  The picture quality is really good. The sound isn't that great at all, but when you hook it up to surround sounds, it works great.  I haven't played too much with the features, but it seems to have the basics.", "Date": "April 12, 2010"}, {"Title": "I like it but...", "Author": "Mary \"happycamper\"", "ReviewID": "R1NCJDFDJYWEWZ", "Overall": "4.0", "Content": "We love it 4 stars worth!  I really appreciate the lady who left the settings for the picture in her review.  They help tremendously.  We watch old westerns on satellite and they seem to come in very dark and it's difficult brightening them.  anyone got a suggestion?  Otherwise, the vista is amazing!  The sound leaves much to be desired but we will hook up to our surround player.  Delivery was quick and efficient and the Amazon card really helps spread out the payments.  Overall it's a thumb's up and 4 stars!", "Date": "February 24, 2010"}, {"Title": "52\" LCD has an excellent picture and even better with Blu Ray 1080p", "Author": "T. Robert Deane", "ReviewID": "R2KSWNL8C3YI1C", "Overall": "5.0", "Content": "I bought this TV on sale for $1299.99.  Prior to buying I had my heart set on a 50\" Panasonic Plasma 1080p.  Walking into the store I noticed this model from 75 feet away...and it stood out picture quality wise against Samsung, Sony, Panasonic, and Toshiba.  I got it home and hooked up to a blu ray...that is where this baby shines...also...sports such as hockey, golf, and football really make the picture look amazing.  Literally, watching golf made me like I was in the tee box with the player.  I would highly recommend this LCD to anyone who is looking at buying this size set.  It is well worth the money at $1699.99.", "Date": "February 9, 2010"}, {"Title": "TV is awesome", "Author": "jazz lover \"jazz lover\"", "ReviewID": "R20ZUY6865KHK", "Overall": "5.0", "Content": "This tv is incredible. The picture is astounding and a great price. I got it for $999.00 from QVC and would do it again in a heartbeat. Did I mention I got this for $999.00!?!? Look out for more sales over the holidays and get this baby!! You will not regret it.", "Date": "December 5, 2009"}, {"Title": "Awesome LCD TV!!", "Author": "Richard A. Atwell", "ReviewID": "R2K108M7GKDLBY", "Overall": "5.0", "Content": "I bought this LCD TV from an Air Force BX on \"Black Saturday\" for $1199 and it came with a free sound bar.  Amazing deal since the lowest other price I found that weekend was $1399 w/o the free sound bar.  The only negative thing about the TV is the sound but most LCD TVs really need either a sound bar or home theater system.  Picture is awesome and I actually like the OPC function b/c my kids don't need to watch Dora etc. and raise my electric bill....I'll save the best picture for when my wife and I are watching it:)", "Date": "November 29, 2009"}, {"Title": "I am very happy with my purchase", "Author": "bruinjoe \"I love Jesus\"", "ReviewID": "R1DH492LIEEV1M", "Overall": "5.0", "Content": "I have been shopping for an 1080p LCD TV for at least six months.  The Sony TVs are just over priced.  The Samsung TVs have better picture per price point than the Sony TVs but they are also expensive.  Panasonic, Toshiba, and Sharp had the best value.  Costco had this Sharp model and the image was great.  I thought it was better than the Sony which was priced more for the same size.  Amazon had an incredible price of $1288 on this TV and I knew it was a good buy.  Costco offered it for the same price but I didn't want to pay for tax and delivery.  Amazon didn't have those costs.  I love Amazon.The TV was delivered in perfect condition.  The box was in great shape when it arrived at my house.  I don't have any problems with the TV yet.  I've own it for a month.  The picture is dynamite especially for the price.  This is a great value.  I later discovered that it was a Consumer Magazines best buy.  This only cemented my belief that this TV was a good deal.  The quality, styling, price, and performance for this TV is hard to beat.Unlike some of the other reviewers I think the sound is more than adequate.  I'm eventually going to use speakers from The Speaker Company with this TV.  In the mean time the TV's speakers are good enough.", "Date": "October 23, 2009"}, {"Title": "SHARP LCD TV", "Author": "M.P. \"M.P.\"", "ReviewID": "R36PDY68PPF5IS", "Overall": "5.0", "Content": "Very nice TV for the $. Nice looking TV, very slim. My only drawback was the adjusting it took to get the perfect picture. Its not great when looking from horizontal(whited out) but most LCD's have the same issue. But don't let this change your mind about it. Its a great TV and for the $ would buy another. Screen has a more textured look to it compared to my Phillips 42\" LCD. I was told its the anti-glare material on the screen which is better for the sun-room i have it in. Did much searching on the web and in stores. Liked the samsung's and sony's. But this TV looked very close to both of them. Can't tell the difference at home! BUY IT!", "Date": "October 23, 2009"}, {"Title": "Very satisfied", "Author": "Jacob A. Baadsgaard", "ReviewID": "R1BSF8QWQBSEX0", "Overall": "5.0", "Content": "I've had the TV for about a month now and am extremely satisfied.  While shopping for a 52 inch set, I compared the Samsung LN52A650 and the Sony KDL-52V5100 with this Sharp product.  After countless comparisons I decided to go with the Sharp for several reasons: 1) Picture quality was on par or even slightly better than the other compared sets; 2) Price was significantly less (snagged mine for $1,351); 3) Had all of the extras I needed without paying extra for those I didn't want or need.Couple of things you should be aware of: The built in speakers are very weak.  Before setting it up with my home theater, we had to have the volume on full blast to hear what was going on.  Also, the Sharp Aquos remotes are just kinda cheap. I knew about both of these issues going into this purchase but didn't mind as I had a theater to hook up to and a nice universal remote to use.All in all, this is by far the best bang for your buck for a 52 inch lcd tv.", "Date": "July 8, 2009"}, {"Title": "GREAT TV FOR THE MONEY..", "Author": "LadyLaraCroft \"Lara\"", "ReviewID": "R2D858WAG8TRFN", "Overall": "5.0", "Content": "About whoever compared this tv to a Samsung. I had a A750 model. I can say that the picture on this tv is better. The regular channels look better because the people look more in proportion and not pulled out looking. This tv has more picture adjustment controls than any tv I have ever seen. I don't find them confusing. I think they are fun.  Anyway I was able to buy this for under 1300 new. I would be paying close to 2000 or maybe more for a Samsung. The price difference is a big difference. I believe this is the Best lcd that Sharp has made thus far.  It comes with a 15 month warranty as well. No complaints. Nice TV..", "Date": "September 7, 2009"}, {"Title": "Sharp Aquos 52\" review", "Author": "citydude", "ReviewID": "R247P17PVJUIQZ", "Overall": "5.0", "Content": "I gave this review 5 stars for everything about the product, but not at all for the delivery arrangement.  This is not that I had any problem with the actual delivery, but the expectation of the delivery. I was advised by the seller (at the time of purchase on Amazon) that the delivery would be something like 7 - 10 days and it came within that time frame, which was fine by me, except that they didnt give any tracking number nor any other information about how to find out which day my tv was really coming.  Of course the problem was that I couldnt arrange for someone to be there since most of us work during the day hours.  In any case, the delivery people were good about it, and re-scheduled the delivery for the next day (since they called me in the afternoon at work to let me know they were at my house!).  In the meantime, I had emailed the seller and tried to call them a few times asking for delivery tracking information, to no avail.In the end, no harm, delivery was made within the time frame stated, and the tv set is great.If tracking info was simply given, then there would have been no stress or headache about arranging for someone to be there.", "Date": "October 1, 2009"}, {"Title": "sharp LC52E77U TV", "Author": "Kat", "ReviewID": "R28C8KP48YTMZT", "Overall": "5.0", "Content": "We had a 2 yr old sharp 42 inch 1080P, 60Mz  TV and it was wonderful, but was stolen when our home was broken into. We replace it with another Sharp 52 in. and the picture is even better on this one. It has the 120Mz. I would recommend  getting the 120 Mz. It is great, the picture is so clear and the delivery went great and we saved a lot of money, Amazon  was much cheeper than same TV at the store and it was on sale.", "Date": "September 1, 2009"}, {"Title": "switching from SONY to sharp....review in progress as of now", "Author": "NY_DOC", "ReviewID": "R256PE4UBDKTXZ", "Overall": "5.0", "Content": "Recived mine 2 weeks ago. CEVA put it in my patio,(didnt even bring it in), hauled it inside. I told driver that I need to check operational level of TV & he mentioned to take it with DELL(I bought frm DELL) if anything is wrong( so no + points for CEVA). TV box is fine, I tried looking for banding/cloud issue by connecting PC to TV ,but me & 2 more pairs of eye cannot find anything odd or any deadpixel. TV is running fine but HDTV qual is not as good as what I'm getting on my BRAVIA HDTV (720p) (thru cable). Bluray seems fine (again cannot find considerable positive difference b/w my old 720p o/p & this one). Overall, looks good. Cannot test 120HZ difference (or dont know how to). Oh!!! I turned off OPC first thing to make PIC more crispier...still figuring what settings should I pick for picture tuning. no PIP is bummer(still can live w/o it).Btw!!! I experienced some flashing on my PS3 while watching bluray thru it, it's just pic is gone and come bck every few sec for some time..I jiggled my HDMI connection on back of TV, & then plugged in @ side HDMI port..happend again with my DVD hdmi next time, I swaped ports..so far no flashing...Maybe cable fault or that hdmi port gone bad(i/p 6 labeled on tv)...Investigation in process...I'll write back update in 2 months...for now..it's 5 star(call me biased...huh)....I think 1-2month usage will determine it's faith. Overall no complaint(cant expect xbr for 1.3K)Update Oct 20-09: Flashing stopped for now, I came across differnt probe though..On HDMI (say PS3 or B.Ray),even OPC is off it's still acting up, A bright white scence when changed to darker or black scene, LCD light dims (very noticble), I double checked OPC is OFF, calibrated pic setting to best of my knowledge but it's still happening which result the pic quailty as light dims out alot going from bright to dark scenery. Anyone know remedy? I'm going to call sharp but I dont expect they can troubelshoot it over phone (i've tried bfore),maybe any setting to tweak or enable though?", "Date": "August 19, 2009"}, {"Title": "Our movie theater", "Author": "Karen E. Kaiser \"k vision\"", "ReviewID": "R2X5JLJ361AKZ7", "Overall": "5.0", "Content": "We hung this TV on the wall in our bedroom and hooked it up to a Yamaha sound projector bar.  It's like a movie theater in our home.  The picture was good, but when we played blu-ray movies on a new PS3, the picture was incredible.  I would recommend it.", "Date": "June 1, 2009"}, {"Title": "Great picture, even better price!!!", "Author": "Christian", "ReviewID": "R3M6HR0PFO8KP1", "Overall": "5.0", "Content": "I have a living room with 15 windows in it.  During daylight hours I have zero glare on the TV! I didn't think it would be possible.  The speakers on the TV are very bad, so I run the sound through a surround sound system and I turn the volume all the way down on the TV.  I ordered the TV on a Saturday and by that Friday it was in my living room ready for me to set up.  Very...very easy to set up.  Great TV, great price.", "Date": "April 7, 2010"}, {"Title": "Great Picture, Not so great sound", "Author": "J. A. Giesige", "ReviewID": "R13FS3210DJUFV", "Overall": "3.0", "Content": "This is a very nice TV with only one noticable flaw. The sound is very poor quality. I turned the TV speakers off completely and run it through the surround system. If it had better speakers it would rate 5 stars", "Date": "March 30, 2010"}, {"Title": "Disappointment...", "Author": "jcam", "ReviewID": "R11H77I82F7PS0", "Overall": "2.0", "Content": "I bought this unit based on the price and decent reviews from users.  However, I would have to say the picture and sound quality are inferior to Samsung units.  I own two Samsung LCDs (two 42 inches) and the difference in quality is immediately noticeable for me.I don't understand the design of the picture setup either.  You go into picture settings and do your tweaks but by the time you exit out of it, the screen readjusts slightly (most of the time it dims).  I would not recommend this unit nor will I ever buy a Sharp.THANK GOD for Amazon and their SUPERB customer service. They agreed to pick up the unit for a refund despite throwing the box away.  AMAZON.COM ROCKS!", "Date": "May 16, 2009"}, {"Title": "WTF - Price Jump!!", "Author": "Presley Faith", "ReviewID": "R1NRWHQ3XLHJ63", "Overall": "1.0", "Content": "What the hell??  I have been doing lots of research on LCD TVs and had finally zeroed in on this.  Was impressed with all the reviews and the price was great ($1550 on Amazon).  I put it in my shopping cart as I continued reading product descriptions, reviews, and other stuff before I finally was about to pull the trigger...  then when I go to my cart, the price jumped up to $1899!!!!  WTF??  Amazon is crazy.  I'm so pissed.", "Date": "June 24, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "52-Inch Full HD 1080p HDTV LCD-TV with 120Hz Fine Motion Enhanced\n10-Bit AVS Superlucent LCD Panel\n5 HDMI terminals, PC input, RS-232C Input\n4ms response time\nSpectral Contrast Engine XD for Deep Black Level", "Name": "Sharp LC52E77U 52-Inch 1080p 120Hz LCD HDTV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/313zMzll73L._SX300_.jpg", "ProductID": "B001RCTAT2"}}