{"Reviews": [{"Title": "Great picture, more connections would be appreciated", "Author": "A. Waterhouse \"Dr. S\"", "ReviewID": "R2GJEL6CUBXYQY", "Overall": "4.0", "Content": "This television has great image quality.  The only limiting factor seems to be the quality of broadcast images.  I didn't check all the specs and expected the connections to be similar to the LG70 series (as the LG60 series cost more)-wrong.  It lacks S-video altogether and a standard video connection on the back.  With my old Tivo, the only usable connection is the standard video on the side, and that has to be removed to connect anything else, such as the camcorder. LG 32LG60 32-Inch 1080p LCD HDTV, Gloss Piano Black with Scarlet Red", "Date": "January 17, 2009"}, {"Title": "Great value and great TV!", "Author": "Sylvie Steinbach \"Sylvie\"", "ReviewID": "R9VO9X3P5RDC2", "Overall": "5.0", "Content": "My 26' LCD Philips died on me 2 weeks ago after more than 4 years of service so I went shopping for a new 32' with the anticipation I may find a much better set. What a disappointment! I kept looking at the most recent TVs, going back and forth between BestBuy and Frys to only find a majority of Sansumg with very bad speakers, others with so so pictures like Toshiba/Sony and other clones (unless you go to the more expensive side of the stores where the plasmas are). Those 32' LCD TVs looked the same no matter who was the manufacturer! But the prices were still around 1000 dollars and +. I felt like I had landed on another planet, much different to the one I remembered visiting last fall...A year ago when I fist saw the scarlet at Frys , I was stunned by the beauty of the picture quality, the sound clarity and the black/red piano look design. I thought to myself that if I had to purchase a new TV, this would be my pick. It was placed near other competitors, fed by the same HD program source and it was simply amazing. So amazing that people were stopping on their track to watch that particular LG scarlet. At an original price of 1500 dollars, I thought this was out of my budget and I stop thinking about it...Well a year later, here I am shopping for real and can't find that stunning scarlet anywhere (too popular apparently (!?) or simple retired too early!). Some on Ebay go for high 850 plus shipping even though LG just released its new line 2009 (no scarlet anymore!). In my new mission to find the right TV, I did not find anything in store that gave me the same reaction so I went home, empty handed. I could not believe finding the perfect set for my situation had become such a hassle...I can't have a home theater as I live in an apartment building badly built (we can hear everything, I mean everything!). The extra bass system is a no no if you see what I mean...So I needed a TV that had great quality speakers placed on the side or on the front. Manufacturers of TVs like Samsumg don't build those any more as they want us to buy a lucrative home theater for another 500 dollars (or +) to compensate for the poor quality speakers placed, of course, in the back of the set so you can't have a good direct sound. It is a marketing plan that has worked very well apparently for the past couple of years. It explained the similar look and design we see now with those LCD TVs and the explosion of different home theater systems included the bar style (recommended by sales people if you live in an apartment!? Yes, sure...)I guess it had to be my lucky day when I found that scarlet on Amazon at the amazing price at about 550 dollars plus shipping. I knew it was the best price for any TV of that size and quality. I own few LG products already (one is a computer flat monitor LCD that I fell in love with for the same amazing picture quality). So I plunged, ordered on Thursday afternoon and received it the following Tuesday, from the East Coast to L.A. in perfect new (original sealed packaging) condition. What a fast delivery from that third party! And let me tell you, this TV is stunning looking and does have the look of the Grand Piano black shine and the red accent making it so unique.Easy assembly to add the foot and Voila! Set up is a breeze and it is the great picture I remember a year ago...The speakers are precise and powerful, the sound is so clear that you don't need to make your TV shout to enjoy a low voice dialogue between two characters. Absolute joy! Futhermore the sound adjusts automatically from the program to the commercials (no more screaming commercials, OMG!).This TV's entire system can be customized to your tastes and conditions (like my apartment). I can tell you, I AM PLEASED and I don't care that it is a 2008 model!!! If you can get one of the few remaining scarlet, please jump on it because the new LG line does not compare in esthetic...You won't be disappointed!", "Date": "September 3, 2009"}, {"Title": "Great TV", "Author": "Dawn", "ReviewID": "R1ENCKNUWASAEG", "Overall": "5.0", "Content": "I bought this for my Husband, to replace his old TV.  He loves it.  Works great, nice picture and color.  We moved and it didn't seem to be affected by the moving it around.  I would recommend it.", "Date": "March 23, 2012"}, {"Title": "good", "Author": "dingdong", "ReviewID": "R2WPN27WT37FPJ", "Overall": "5.0", "Content": "fast delivery.nice product.sound kinda sucks though so don't expect too much unless you have home theatre set up", "Date": "December 24, 2010"}, {"Title": "rg1050", "Author": "Robert Gindele \"Robert  Gindele\"", "ReviewID": "RG8KZWO909VBE", "Overall": "5.0", "Content": "This tv has a great picture and is easy to operate. Im more than satisfied with it", "Date": "December 8, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "Slim, bold, stunning design Scarlet LCD HDTV series only 2.4\" deep with swivel stand\n1080p Full HD resolution 1920 x 1080p with 4x HDMI v 1.3 digital inputs\nISFccc caple of professional calibration for picture performance\nInvisible speaker system for richer more balanced sound & a polished look\n15,000:1 Dynamic contrast ratio", "Name": "LG 32LG60 32-Inch 1080p LCD HDTV, Gloss Piano Black with Scarlet Red", "ImgURL": "http://ecx.images-amazon.com/images/I/31%2BNbHoFG5L._SX300_.jpg", "ProductID": "B0018SS3UC"}}