{"Reviews": [{"Title": "My First Plasma", "Author": "Ryan", "ReviewID": "RQBEHW6LKKW8T", "Overall": "5.0", "Content": "I previously owned a bulky 46\" DLP but decided I needed a new and smaller TV due to moving into a smaller place. I researched for a while and decided on this television, the deciding factors being 1080p, contrast, and refresh rate. I have to say, I'm very pleased.This is the first full HD television I've ever owned. After tweaking with the picture I stuck in Wall-E on Blu-Ray and was amazed by the clarity. I realized just how much I'd been missing out on HD with my other TV.I wish it has a PC input, but you can get HDMI adapters for that. The picture quality of an HDMI connected device looks awesome, but I've noticed it's a little dark with component devices like game consoles as well as cable and HD signal channels. Games look good though, even the Wii looks pretty good. I wish I could have tested out my XBox360 more on this set but it unfortunately broke two days after getting the TV. Figures...I bought this TV with hopes of getting the best Blu-Ray picture at this price range and I think I got it. At under $900 this TV is a steal.", "Date": "August 24, 2009"}, {"Title": "Nice Set While it Lasted", "Author": "Keith Thompson", "ReviewID": "RGLW941T5VTA7", "Overall": "3.0", "Content": "Loved the TV for the first 90 days. Beautiful picture, decent sound, plenty of connectivity options. Today it wouldn't turn on; the power LED blinked 7 times, then paused, then blinked 7 times repeatedly.I called Panasonic Customer Service, the guy had me unplug it, wait 2 minutes, plug it back in. Same result. He had me remove it from AC line conditioner and plug directly into wall socket, still dead. He tried to transfer our call to another department but no one answered. He said someone will return our call within 24 hours. Still waiting.Searching the Internet leads me to believe this problem is fairly common, and that Panasonic Customer Service is not terribly responsive.Considering my previous Panasonic Viera LCD only lasted about 3 years before developing cloudy gray areas (also common according to my Internet research), I should have thought twice about buying another Panasonic.", "Date": "October 12, 2009"}, {"Title": "Panasonic VIERA 42\" Plasma TV", "Author": "Gjenevieve Desaulniers", "ReviewID": "R1O3J3U02PC2WC", "Overall": "5.0", "Content": "We looked at all kinds of TVs and priced them at several different locations.  After carefully reviewing and looking into all the different TVs, we liked this one and were really thrilled to find it at such a low cost in comparison to all the other places we had looked.  The TV arrived in perfect condition and it was easy to set up.  We love the picture quality.  We are really thrilled with this purchase and would recommend it to everyone looking to buy a plasma TV.  One of the main reasons we wanted a TV like this was for the 1080p so we could play video games at that high resolution.  Our games look awesome on this TV!", "Date": "February 18, 2010"}, {"Title": "Great TV", "Author": "K. Zenuni", "ReviewID": "RVGAH5CNFJGXW", "Overall": "5.0", "Content": "when it comes to televisions, I only recommend a few brands such as Samsung and Panasonic, these 2 brands are known for top of the line HDTVs, this plasma model has all the latest features and options you want in a high end HDTV, it has great sound and crystal clear picture, also HDMI and camera connections make it easy to use your other gizmos with it, I was sceptical at first but i was convinced after owning this tv for a week, it simply is amazing, check out their site for more info about specs and all, for the $ you spend it is def one of the best.", "Date": "April 6, 2011"}, {"Title": "Excellent low cost basic plasma tv", "Author": "Clinton W. Salvato", "ReviewID": "R2KVECZE0NW0VW", "Overall": "5.0", "Content": "I recently graduated back in May, with an A.S. in Broadcast production and was looking for a good solid TV for entertainment, but also for work as well.I wanted a larger TV as well, because i'm visually impaired, so anything lower then 32\" is uncomfortable to watch from a distance, even 32\" can be pushing it from a distance.Anyway, I didn't have a large budget to work with just the money I got back from the school left over from the pell grant.  I went to best buy and I had intended to buy a 42 or 46 LCD but after talking to the sales person he recommended plasma as it's much more true to life reproduction of color and contrast.  I''m not new to display technologies, i'm just fairly new to flat panels and HD.  I am someone who is used to looking at a CRT. Until HD was born, they were the best display to reproduce content in it's entirety.This was the ONLY 1080p plasma TV best buy had in stock at the time, it fit the budget the size is almost too big for the studio apt i live in. 42\" is actually just perfect for the living room. any bigger would have been overkill.  This TV was purchased February 24th, 2010, so I'm reviewing it after several months of use.Now for the review of this TV:First of all, out of the box, this TV needs to be Calibrated for best performance, The standard setting is way too dim, also the color is slightly unbalanced, milage may vary depending on your set.  After I calibrated the set, which included both tweaking user menu and service menu settings the picture is fantastic.  I have no complaints over color, contrast or black levels now.  Black is black white is white, and other colors are reproduced very nicely.  I will make a note here, the content source also makes a very big difference as to how the TV display looks, not all sources are equal.  For example, if you have an old source (SD) the colors can be way off, or it's otherwise distorted and looks horrible, or you may have an SD source that looks great, same with HD, it comes down to how was the video processed before you got it how well was the source preserved (older content) is your display properly calibrated, etc.  One more note on this topic, HD displays tend to bring out content defects more as they are designed to show detail.  Problem is the detail isn't something the viewer always wants to see.Other parts of this TV review include, a good choice of inputs 3HDMI, 2 composite, 2component 1 s-video noVGA, but i use a dvi to hdmi adapter if i want to connect the laptop, which works extremely well.For best reproduction of HD content use HD size 2 in the settings this turns off overscan so your content is displayed without being cropped off.After almost 4 months of use, I had the stock power board go out in this unit,  I had it repaired under warranty with no problems.  I've been using it just about 3 months now since the repair and the set has worked beautifully.  The repair was done on july 14th, 2010, it's now October 24th, 2010.  Early failure doesn't change my review or view of products, as long as the warranty is honored.  Working with electronics, you just learn to expect the unexpected.  I did however make some changes to my setup, I took the single power strip i was using for the TV, blu-ray player, etc and stuck it through my ups on the surge protection only side as it has a very good line conditioner and noise filter and a few other things for protection against spikes and other power issues.Overall, I'm quite satisfied with the purchase.  Many people like the s series and G series and V Series of plasmas.  But really don't need the G series i have the blu-ray for vieracast, also i've heard the other models with exception of the s series either doesn't have the smaller model sizes or they're hard to find.  As far as the AR filter that's a moot point for me, the tv isn't  facing any windows and it's as simple as keeping the lights off during tv watching.  When it comes to 3D i'm still not comfortable with investing in a 3D tv until i'm sure the 3d effect won't aggravate seizure activity in someone who has a history.  So in closing this TV seems to be the perfect fit for a living room TV in a small apartment.", "Date": "October 24, 2010"}, {"Title": "I LOVE this TV!!", "Author": "Jeffrey Goins \"jwriter2005\"", "ReviewID": "RZ2HQ8R0LETE1", "Overall": "4.0", "Content": "This was my first HD tv, going from a 20 inch CRT.  I expected the picture to be better, but I was not prepared for the sharpness, beauty and detail I got from this television!!  Set up with my cable box and DVR (blu ray is coming soon) was quite simple.  As it happened, the first thing I found when I turned on the tv was the Erroll Flynn Robin Hood movie on TCMHD.  Every color (and there are a lot in the movie) popped so brilliantly it took my breath away.  I can not say enough about how gorgeous movies look on this set.This particular set does not have the anit-glare screen, and that it the only negative I have found.  It reflects a great deal of light, and it probably doesn't help that the tv is opposite a southern facing window.  I have purchased light reducing drapes which help some, and in the evening, I turn on the room light beside the tv, rather than in front of it.  The unit also has a cinema mode which makes the picture brighter.  On those occasions when I have turned off all the lights however...it's heaven!I'd recommend this to anyone looking for an excellent tv at a good price.  I specifially bought the U1 (2009 model) for the cost savings over the U2 and I'm glad I did.", "Date": "May 31, 2010"}, {"Title": "Panasonic Viera P42U1", "Author": "D. Snyder \"Professor DRS\"", "ReviewID": "R218GPK73PSCOF", "Overall": "4.0", "Content": "Overall very happy after a month with the appearance, ease of setup and picture quality.  I knew I wanted a plasma for under $1000 because I will use it only for TV and DVD/Blue Ray.  Did extensive research beforehand with Consumer Reports and online reviews.  My one concern based on the reviews was the frequency of the power supply blowing and service issues, so I did buy a service contract along with the set.  I don't have it wall mounted and was pleased with how sturdy and easy to assemble the TV on the stand turned out to be (unlike my Sony of 5 years ago).  I did have to call tech support once for setup help...was on hold for about 10 minutes but the person who came on the line was friendly and quickly guided me to one step that I had omitted (manual not crystal clear on everything).", "Date": "March 3, 2010"}, {"Title": "Nice TV, great picture, easy set up", "Author": "Madison Shops", "ReviewID": "R14OPU1OHAT6D8", "Overall": "4.0", "Content": "My last Panasonic 42\" was stolen in a home robbery.I bought it 4 years ago because it was the one of the highest rated by Consumer Reports at the time.  This is supposed to be the upgraded model and still highly rated by CR.  The picture is great, big difference with the 1080p.  It was simple to set up and offers lots of screen options.  I was not happy with the delivery.  I paid $99 for 1-3 day delivery and did not receive for over a week (7 days).  I am still requesting the refund which was promised.", "Date": "August 28, 2009"}, {"Title": "Excellent viewing", "Author": "Mark E. Greene", "ReviewID": "R3GFA67S2UQBNF", "Overall": "5.0", "Content": "The Panasonic brand seems to continue to set the industry standard for Plasma HD.  Couldn't ask for better performance at a very economical price.", "Date": "September 7, 2009"}, {"Title": "Excellent product, inferior packaging...would not recommend having this item shipped", "Author": "MegBeid", "ReviewID": "R2FR8479MR05JE", "Overall": "1.0", "Content": "My satisfaction with the TV itself has been very high.  I would say that the manufactur's product description is mostly accurate.  This product has a great picture quality, which isn't compromised even if you're viewing it at an angle.  However, I have the TV positioned so that it is directly facing a window that receives considerable sunlight in the morning hours.  During this time I have to close the blinds to reduce the glare and even then it is still noticeable.  Fortunately, I don't watch much TV during these hours, and if I really wanted to, I'm sure that repositioning the TV would solve the issue.  I enjoy the SD card slot, as it's a great party accessory to be able to display photos while hosting events.That being said, I believe these customer reviews are beneficial in two ways - the review the quality of the product as well as the entire purchasing experience.  Therefore, I feel compelled to share my experience and heed a warning to other consumers who are contemplating ordering this item online.When I originally saw this TV with a free shipping offer from Amazon, I decided to purchase it.  Big mistake.  The original TV I purchased arrived approximately 3 days later and, to my surprise, was only packaged in the original Panasonic box.  No attempt had been made to protect this delicate piece of equipment from the rough handling that take place during shipping. When I opened the box, there were four small pieces of styrofoam contoured to each corner of the TV.  There was also a superficial piece of foam roll over the screen, but that was it.  I removed the unit out of the box only to discover that the screen was shattered, looking like a spider web of broken glass. Disappointed, I immediately called Amazon and requested a replacement, which they were happy to arrange for me.  I specifically requested that the replacement be insulated better and marked 'fragile,' and the representative assured me that management looks at all products damaged from packaging/shipping to make sure the incident would not be repeated.  Nevertheless, the replacement TV arrived about 3 days later and in the exact same condition as the first one.  Same packaging, same shattered screen.  It's absurd to think anyone in their right mind expected  this TV to arrive in one piece with that kind of packaging.  And to let it happen twice is completely unacceptable - over $1,600 of merchandise was ruined out of neglect. I received a credit back on my credit card about 10 business days after they received the second TV, but the total time it took to receive my refund from the time I shipped it was about 21 calendar days. The bottom line is that I would highly discourage anyone interested in purchasing this TV to do so online.  After this experience I gave up and went to Best Buy instead.  I paid more than Amazon's listed price, but it arrived at my home in one piece and I have been enjoying it ever since.", "Date": "October 11, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001UE6M98"}}