{"Reviews": [{"Title": "Superb picture, great value for secondary tv, 1080p!", "Author": "LILass", "ReviewID": "R256K18NISC72I", "Overall": "4.0", "Content": "Pros:- Price- Picture quality- Includes clear QAM tuner- Can hide unwatched channels- Gets program guides for the DIGITAL (not analog) channels- Includes 1 of each key input type including good old composite & PC- Remote has favorites, digital program info, channel guide, sleep timer,+ - lots of extras for a small tv remote- BeautifulCons:- Picture gets substantially darker when viewed from even slightly below tv level (see below)- Stand does not pivot or tilt down, only tilts up- All screen menus are tiny- illegible text from over ~5' away @ 1080 res.- Poor remote design for use in dark bedroom (see below)- QAM tuner a little slow (see below)- No designated audio out to send tv audio to surround receiver, just a headset out- Two composite, component and hdmi inputs would've been better- I needed to add a passive switch for two old composite only components, but at least these are easy and cheap to add.- No hide/show channel shortcut button on remote (minor quip)Bottom Line Summary:This tv is the best price and value in the 22-26\" size range in 1080p, and its a better size than 22\". Highly recommended- you can't go wrong unless you watch tv from the floor (see below). I haven't attached it to a PC. I have a vcr, gamecube and dvd home theatre attached, and it's in my bedroom. I get cable and have NO cable box attached, and it gets all the analog and CLEAR qam HD and unscrambled digital channels flawlessly. I replaced a 20\" analog crt tv with this- yipee!Picture:Chrystal clear and vibrant but picture does get substantially darker when viewed from even slightly below tv level- not good for bed to wall mount or higher dresser situation or floor watching. I had to set the brightness too light for same-level viewing so it looks good from the bed. (My Samsung is not like this at all). It tilts up but NOT down so can't resolve that way.The QAM tuner loads the digital channels very slow the first time you tune them in after turning on the tv, then it caches them so they load fast the rest of that watching session. Next time you turn the tv on, it has to re-tune and re-cache so you need a little patience with that.Tips- watch non-hd channels in 4:3 and then they are pretty crisp too. I wish you could set a default picture size for HD (full) and for non-hd (4:3) so you don't have to keep switching picture size setting on the remote. (Cable boxes have this feature but I believe most tvs unfortunatly don't)I set the sharpness high, all other picture defaults are pretty good. Amazing picture!Audio:Default out of the box is with the surround sound off. I prefer this setting. I just configured the custom audio setting to be very high in bass and I think slightly higher than centre in treble. Some of the pre-defined audio settings are pretty good too, like music and movie.If you switch to surround sound, be sure to turn the volume down to 1 dot before, because the surrond volume is tons of db higher! The surround adds too much echo (in my opinion) and although it provides a more separated stereo affect, ultimately is way too tinny even with the bass all the way up.I was shocked to find no designated audio out on this. If you want to send the tv audio to an amp. your stuck using the headset out to do so; wierd. Fortunately that's on the back panel too and not the front. So I got a 3.5mm male to stereo RCA male cable at monoprice for a few bucks and am all set up.Remote:Nice extra features for a small tv remote but no illumination, and all the buttons are the same shape and clumped together with the number pad..ugh. I had to memorize the pad and now count and feel the key placements to find a button- ridiculous really, but I've managed to get it, mostly.Menu Navigation:They don't teach you how to do this in the manual so here goes- after you click menu button, it goes by default to the picture settings. To change to say, audio settings, use the left and right arrows to select a diffent menu from the turntable. Then use the up and down arrows to select a list item within the menu, then use enter and right/left again on the list items.To get out of the menu you must back out of the menu levels by repeatedly pushing the menu button.There is a timout setting for all menus in the options. After I figured out how to close the menu, I set that pretty long so it wouldn't close any menu on me too soon automatically.Attached VCR:I found my vcr picture is far better when viewed through ch3 rather than changing the tv's input to aux. It's also easier that way. Just turn on the vcr and change the tv to ch3. Turn the vcr off and the tv channels all just come back.", "Date": "July 2, 2009"}, {"Title": "Average TV only worked for 3 hours.", "Author": "Katie Howell", "ReviewID": "R2C214I2SSFHGB", "Overall": "1.0", "Content": "This TV has a very dark screen initially, but there are ways to personalize it.  The remote buttons are very small,  and the menu is too small to easily read, even at 8 feet.  The surround sound echoes, so you may opt for standard volume.  The picture is average on digital channels, but didn't have a chance to check out HD channels, because it stopped working before I had a chance.After 3 hours of viewing, the tv sporadically initiliazed, which stopped all audio and video.  After about 10 times of that, the tv said rescan channels, so I lost all personalization.  I tried only once more, but got the same result.  There is no support for this TV, unless you buy it on-line.I will not recommend this TV, no matter the price.", "Date": "November 27, 2009"}, {"Title": "AOC L24H898 24-Inch 1080p LCD HDTV", "Author": "lesd40", "ReviewID": "R2V9F58ZDM0RTX", "Overall": "5.0", "Content": "I purchased the item to replace a dead computer monitor...and I'm glad I did. As far as a pc monitor, it's great...big enough to run 2 applications side-by-side. With a touch of the remote (or button under the front), I can instantly switch to TV (digital or analog either or both). I chose the AOC, as one of my older monitors was an AOC lcd...and they have a warm mellow color, much like that of film, making this great for movie viewing. It has the full 1080p resolution, so I use an upconverting DVD player for the HDMI input. A great and true little multi-media display. The sound has much to be desired and isn't very dynamic, but my Altec-Lansing pc speakers take over that end of business. The controls are easy and intuitive. Also has svideo and composite inputs easily selectable via remote. Recommend the product as either a TV or monitor, or both as I use it.UPDATE: Bought a second one to replace a crt TV in the bedroom! Best audio setup: Run a 1/8\" stereo patch cord from the PC to the PC input on the monitor...then plug the amplified computer speakers into the headphone jack on the back of the AOC. You can now hear and control the volume levels of the PC or TV from the AOC remote. I have this setup on both AOC's and it works out great. An upscaling dvd player improves the look of standard movies through the HDMI input. For PC movies, you can use VLC (Videolan) player and adjust the aspect ratio to fill the screen. Lastly, some people complain about not being able to tilt the monitor downward (tward the floor) enough...I have found a thin book under the back edge of the stand solved the problem.UPDATE: 4/26/13 Still using them both, still work as they did the day I took them out of the box!", "Date": "June 12, 2010"}, {"Title": "I wish I read reviews before buying", "Author": "Melissa L. Harrison-dicicco \"m. harrison\"", "ReviewID": "R31K2EP69EMR7V", "Overall": "1.0", "Content": "I bought this model in a local store 2 days ago.  It looked great on the wall in the store playing a dvd, but when I got this home it was a totally different story.  To start off, the colors on screen are extremely dark.  Although this can be adjusted, at an accceptable brightness the images on screen get washed out. I could not get any realistic looking color...everything seems to be quite harsh, washed over in red and yellow-green tones.  The best viewing angle is straight on.  The clarity of the picture actually seemed to get better farther away from the set.  Close up, the picture is terrible! I will probably have to find another use for this tv as it is very subpar for my living room.  The lesson I have learned here:  do your research and don't let the excitement of a great deal (it's only good point)cloud your judgement... you get what you pay for!", "Date": "May 31, 2010"}, {"Title": "Great TV/monitor", "Author": "Valverde", "ReviewID": "R2E1CRAQTLTYIZ", "Overall": "4.0", "Content": "Great screen, great compatibility (I connect it to my cable signal, DVD player and Laptop), very good image, the only thing that I don't like about it is the sound, very poor for that big screen (big for a monitor); I think that could be better with an extra connection, a home theater may be, but I used it principally like a monitor for my laptop and works excellent for me, even I plug the audio input to my laptop so I don't need extra speakers.", "Date": "November 12, 2010"}, {"Title": "Great product!!!!!!!!!", "Author": "Eduardo Davidovich \"pollotedl\"", "ReviewID": "R1CZF6ASHQFO95", "Overall": "5.0", "Content": "Great product, image it's great but sound quality is not good, it's only OK.I used it on analog signal only.GREAT VALUE FOR THE PRODUCT QUALITY (I bought it for 299 USD$)", "Date": "July 17, 2009"}, {"Title": "Great product if used in the proper setting", "Author": "Nitrousbird", "ReviewID": "R2DDI6JIODF8F8", "Overall": "4.0", "Content": "I don't get some of the reviews for this TV.  24\" is way too small for a bedroom TV, unless you have it at the side of the bed, which is a little odd.  Most folks have a bedroom TV either at the foot of the bed or on the wall away from the foot of the bed - much too long of a distance for such a small TV.  This alone throws the small menu argument out the window, as it is easy to view at a normal viewing distance.  This isn't the kind of TV you should be hooking surround sound up to, so again a pointless argument.I bought this as a kitchen counter TV.  My biggest gripe is the stand, which causes the TV to sit higher than desired.  I had to tilt it then set it straight to fit under my cabinets in the recessed area under there.  Because I am tall, this caused me not to see the top of the TV.  Simple solution was to just wall mount it (foldable extension arm mount), which worked perfectly.  As a kitchen TV, it works great.  Sound is good enough for such a small TV.  1080p is unnecessary for TV-only use at 24\" (I wouldn't have paid extra for it), but I got it for a price I couldn't pass up, so that's a plus.Picture quality is good.  This is a great TV if used in the appropriate setting (bathroom, kitchen counter, child's TV where they sit up close, office desk, etc.).", "Date": "March 27, 2011"}, {"Title": "Excellent analog and HD picture and sound as either TV or PC monitor", "Author": "R. L. Thompson \"R. L. Thompson\"", "ReviewID": "R2D4W97591SAFW", "Overall": "4.0", "Content": "I originally ordered this to use as a PC monitor/TV. It was so good I moved it, to replace the small flat screen TV in our bedroom. The picture quality is crisp and sharp. The sound volume is much better than the Samsung tv it replaced. I don't usually turn the sound up on this AOC TV even to the half-way mark; it is plenty loud at one-third volume. (I should mention that it does not have picture-in-picture.)The menus are rather small and a little difficult to read from 10 feet across the room, including the channel guide. The channel guide shows only the channel you are viewing, there is no setting to view what is playing on all channels at any one time. So we rarely use that feature on the tv.There are lots of different video connections, including HDMI, plain old RG6 cable for our ATSC/NTSC (digital/analog) roof antenna, and composite (RCA) for our VHS tape player/DVD. The TV tuner doesn't seem to be able to resolve some of the digital sub-channels for a couple local stations, like the 24-hour weather; again annoying but not a deal breaker.The TV doesn't size the picture automatically to the correct zoom for tv shows or movies in 4:3 or widescreen, but there is an easy to use, dedicated button on the remote. If you want it, there is a 4:3 level 2 zoom-in that will cut off a tiny bit at top and bottom of a show, so that you can fill the width of the screen. Very handy bigger picture.Overall I very much like this unit. The panel and stand are very attractive, it came with no dead pixels at all, and the video and sound are excellent. There are lots of video connections, and customizations for brightness, zoom etc. I will definitely look to the AOC brand again for future purchases. I may even buy another one of these units so I can have it for a PC monitor again. Excellent for either use.Since I've mentioned a number of mildly annoying quirks, I didn't think it fair to rate it 5 stars, although that is how I truly \"feel\" about the quality and value of the unit.", "Date": "March 21, 2011"}, {"Title": "Do Not Buy!", "Author": "clh", "ReviewID": "R91OSC9M86VLX", "Overall": "1.0", "Content": "This tv is junk. I just recvd. one for a gift. It was purchased at ABC Whse. Within a couple of months the tv began to hum and I got wavy lines throughout the picture on certan channels. ABC refused to take care of it, telling me its the company's policy it be returned to the company to be fixed. Of course, the cost of returning it is out of my pocket. The company has still not sent my the info to return despite a phone call to them a month ago. Do not buy an AOC t.v. and don't buy from ABC Warehouse b/c while they are more than eager to take your money, don't expect any help from them if there's a problem. In fact, when I initially went in the salesman couldn't even find a number to give me to call AOC, he asked me if I had my product book. After a few choice words, he spent a little more time and found me the info I needed.", "Date": "February 11, 2011"}, {"Title": "let down", "Author": "carcrazy \"dan\"", "ReviewID": "R3MH3LMR5SSBXI", "Overall": "1.0", "Content": "since i had heard good things about aoc computer monitors i purchased 2 of their led televisions online, a 19 and a 24 inch. the 24 arrived with burned out leds. since i would have to ship it back and wait for a replacement or a repaired set i decided to keep it. the 19 inch also had a few burned out leds. the 24 also has a sound control problem that wont allow adjustment to a minimum volume for late night viewing. the 19 over the first six months of ownership developed a habit of turning itself off and not allowing it to be turned back for at least 30 seconds. probably a heat problem but it only happens about every 4 or 5 weeks. since both were brand new and of different sizes i would not recommend buying any aoc television.", "Date": "January 13, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "1920x1080 Resolution\nATSC with Clear QAM & NTSC Tuner\nHDMI, Video, Component, PC Input\n10,000:1 Dynamic Contrast Ratio\nWall mountable", "Name": "AOC L24H898 24-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41WaV4tt4GL._SY300_.jpg", "ProductID": "B001U3O9R6"}}