{"Reviews": [{"Title": "Great Value", "Author": "Michael D. Barton \"Cinder Block of the Apocal...", "ReviewID": "R244JAS9VTQUSG", "Overall": "4.0", "Content": "Typically when there is a fanboy war over LCDs, the fight comes down between Samsung and Sony.  Sonys are usually hailed as having better blacks while Samsungs [aka Sammys] are cited as having more accurate color.I had a 46V4100 [last year's V-Series a step higher than this S-series] and found it was a solid performer that was plagued by uneven backlight issues.After researching several sets, I decided to give Sony another chance.  At some point when buying an HDTV you have to accept that there will be compromises.For a \"entry level\" set, the S5100 does not disappoint.  Yes, SD content looks sketchy because of the huge amounts of upscaling that take place. That's true on any 1080p set.  And the compression that the cable and satellite companies use mean you will see blocky compression artifacts around the edges of some HD content.But from a picture standpoint, the colors are accurate, the shadow detail is good and the viewing angle for an LCD is outstanding.Physically, the set is handsome in a functional way but doesn't have any design pizzazz. Also, the bezel is reflective.  I know manufacturers do this so their products look \"nice and shiny\" but the position of the set in my room causes a noticeable glare on the left bezel- I thought it was severe backlight bleed until I looked more closely.The screen itself is glossier than most LCD screens- not as reflective as a plasma but it will still throw a reflection at you.  Probably not the best choice for a room with lots of direct sunlight.  I have the TV in a room under a ceiling fan and the reflection is noticeable but not distracting.  However, the reflection is nowhere near as diffuse as you'd expect from an LCD.I think this reflective screen helps with the viewing angle, though.  I'm sitting 6 feet to the left and 2 feet in front of the TV and the colors are almost as vivid as if I were sitting directly in front.  This is a rare LCD that can challenge a plasma on viewing angle. Usually you get 50 degrees off center from an LCD and your picture is washed out.Sony's xcross [pronounced \"cross\"] menu system [used on the PS3 AND PSP] is not on the S5100.  I don't consider that a big loss and you do get a remote button called \"tools\" that lets you get to commonly used functions without using the menu.  The interface is attractive and easy to use.The TV has plenty of connectivity.  3 HDMI, PC input [9 pin, not DVI], 2 component in, digital audio digital audio out... you get the idea.  2 of the HDMI ports and the PC input are on the left side of the panel, recessed far enough to protect the plugs.  Seems like a strange design choice.Finally, I will admit that there are some minor backlight issues [2 \"flashlight\" areas] but unlike the V4100, I have to look at them to notice them.If you want a big set and you're on a budget, this is definitely a set worth looking at.  I will warn you that it is very basic- there are NO extras on the TV.  So SD slot, no internet connectivity, no picture in picture, no Motionflow 120/240Those aren't issues for me.  In my opinion, most of those \"features\" exist to allow TV manufacturers to roll new TVs out each year and build in profit margin at then expense of people who want toys.  I'm willing to bet that as a pure picture and sound experience [ie no MotionFlow] this set is the equal of the V5100 series for $200-$500 less.PS- I apologize for not being able to review the sound but I have the set connected to a receiver.", "Date": "June 10, 2009"}, {"Title": "Nice TV for the price!", "Author": "X \"X-Man\"", "ReviewID": "R2GT2DIC5IINIQ", "Overall": "5.0", "Content": "I'm not a big TV person, so I can't compare this TV to others. I actually purchased this TV to play my PS3 on it, which is great!!!!! The games at 1080p look absolutely flawless. I can't really make a lot of comments about the functions, but there are a lot of them. Everything looks great and for the price it's great, and it's a SONY!Three months later, here is a review update:This is still a good TV, especially when I purchased it 3 months ago. However, over the course of 3 months the HDMI connections started doing some weird things.My set up is very simple: HDMI 1 is connected to my Digital Cable, HDMI 2 is connected to my SONY PS3 and HDMI 3 is connected to my SONY DVD upscale player. The problems I started having was the HDMI connections weren't reading the signals sent by each component. At first I though it was the digital cable, because I stopped getting a signal. So, I had my cable company come out to my house three times and the last time they exchanged the digital DVR cable box with a new one. However, I noticed that when I turned on my DVD upscale using the \"Bravia\" features, I could no longer get a signal from my digital cable. So I unplugged the HDMI 1 (digital cable) and connected it to HDMI 3 (DVD upscale), then I received a cable signal. Same thing was happening to my PS3 (HDMI 2). It was like the PS3 and the DVD player kept knock'en out the cable signal.So after hours of troubleshooting this ongoing problem, I realized, it wasn't my digital cable boxes, PS3 or DVD player, it was the TV itself and since it was over 90 days, since the day I purchased it, I couldn't return it to Wal-mart. So I called SONY and come to find out, SONY apparently knows about this problem. So SONY sent me a software update in the form of a USB drive. I received the USB drive, connected it to the back of the TV and the TV updated the software. The process took about 3 minutes and so far, everything is working fine.I guess the biggest problem I have with this situation is that, if SONY knows this TV need a software update, why don't they recall the TV or send the software update to each store that is selling the TV, so customers don't have to go through this madness? So I wrote this review to warn customers who's buying this TV and those who brought this TV of what to expect as you connect components to this TV using the HDMI ports over time. I would also recommend buying an extended warranty, just to be safe in the long run. I would also change my rating and give it 4 stars if I could, but I can't.", "Date": "August 26, 2009"}, {"Title": "KDL-46S5100", "Author": "nash123", "ReviewID": "R25GWY1BY63H91", "Overall": "4.0", "Content": "Got the TV about two weeks ago, and have been somewhat satisfied.  It took a while to get the SD channels look \"OK\" (sharpness down, etc), but I have concerns over the HD quality.  HD channels are pretty good except when we have dark scenes.  I get a lot of ghosting which I really hate seeing on a brand new TV. We have Comcast HD in Chicago, and we have really good HDMI cables. I applied the patch the day the TV came, and turned down the auto dim, and played around with all the picture settings including brightness, picture, sharpness... Anyone experiencing the same issues?  I have yet to try a DVD - I only have a standard DVD player, maybe I should get a Blu-Ray player too...I had a Sony 42\" Plasma (bought in 2004) before this and the dark scenes look much more grainy compared to my old TV on HD channels.I do not think I will return it but any comments to correct this issue during the return period are welcome.", "Date": "June 9, 2009"}, {"Title": "Wonderful television for the money", "Author": "Missy Stone", "ReviewID": "R3QVZ4DZBFYIWJ", "Overall": "5.0", "Content": "It's amazing how LCD televisions have come down in price. I have a 46\" XBR2 that I bought for almost 3x the price of this one around 3 years ago. And the funny thing is this television and my XBR2 have exactly the same specs--46', 60Hz, 1080p. It's amazing.This television is not 240Hz and it's not LED-backlit. But guess what, it is good enough! I sometimes can't help but feel that TV manufacturers add new features and increase specs so that they can justify an higher price. I think there is a term for this--planned obsolescence.I mean, you probably would get a slightly better picture going for an new XBR or football will probably look better with 120 or 240Hz. But I really can't tell the difference. And this slight improvement, in my opinion, does not justify the significantly higher price of these upgrades.Do yourself a favor and go for this model. I mean, today's top of the line models will also look ancient in a couple of years!", "Date": "December 9, 2009"}, {"Title": "Just as advertised", "Author": "Darren", "ReviewID": "R2PLV90ETXJMP5", "Overall": "5.0", "Content": "Very good quality TV.  Doesn't have some of the bells and whistles, like pict in pict, but very nice picture.  Built in speakers are ok but would look for another way to add sound.  Would recommend.", "Date": "May 26, 2009"}, {"Title": "Amazing.", "Author": "Cynthia Thomas \"C Thomas\"", "ReviewID": "RK2NBS0LXKR38", "Overall": "5.0", "Content": "I purchased this tv online, got a good price for it. Once I got it home it was a cinch to install. The picture and sound is amazing even without the HDMI cable. I would give more than five stars if I could. AMAZING.", "Date": "March 25, 2009"}, {"Title": "\"Ok for price\"", "Author": "Kat \"Reviewer @ Shivers Of Horror\"", "ReviewID": "RD5PRGR5XNUGJ", "Overall": "3.0", "Content": "I've had this tv since Jan 2010. So over a year now. Since day one the audio sometimes would cut out. I do have DVR and have only used DVR with this TV. And the only way to get the sound to come back on again would be to hit pause (on live tv) and unpause and it would come back. I've had 2 different DVR boxes, and I doubt that is the problem. I'm pretty sure its the HDMI ports on the TV. Even one of the cable guys from my cable company came out and said that he thought it was the HDMI ports. He said he sees them fail quite often on these newer flat screens.I have an Xbox 360 connected to it via HDMI and a Sony BluRay player hooked up to it. But have had audio/video issues off and on. Sometimes on Xbox I'll get a green screen. Other times the audio will completely cut out and not come back on for a minute or more. Sometimes installing the game to the hard drive solves the problem. But not always. I swapped the HDMI port for another one and it was fine.I also stream Netflix via the Xbox, and watch movies a lot on cable or DVD. I've noticed \"ghost\" images of what I'm watching get imprinted into the screen as black shadows. Eventually they go away, but they do get stuck there from time to time. I don't know if this is an issue with the TV or HDMI or something else entirely. But it didn't do it before. Its only started happening the last 4 months or so.It has had all these other problems since day one. But I figured it was my fault considering I purchased a display model from Walmart. It was their last one and it was a LOT less then a new one. Glad I have the extended warranty on it because I can see that I'll probably have to have it repaired soon.EDIT 1/25/13: My warranty is up this year, so I figured i better see about getting the issues with the audio fixed. Had a guy come over and replace the motherboard (which replaces all the inputs on the TV) and have had no audio issues since.", "Date": "June 5, 2011"}, {"Title": "Excellent television", "Author": "thedude", "ReviewID": "R7E3G84KX3NDS", "Overall": "5.0", "Content": "After years upon years of using a standard definition telvision, I decided to foray into the world of HDTV.  I was on a budget, and this item not only delivered on budget, but also on quality!My friend has a more expensive Bravia at his home, but there are virtually no differences from either of our sets of eyes.  The only differences would be the lack of some features, such as Picture-in-Picture, and a couple other minor features I don't usually see many people use.Blu-ray discs look sharp and beautiful, as do games.  Blacks and colors look excellent.  I feel like I am looking at a computer screen, and indeed, I can connect my computer to the television and use it as an extended monitor.  It looks stunning when I do this.3 HDMI inputs simplify use, though I am somewhat disappointed that Bravia link doesn't seem to work with my \"fat\" PS3.  But it's not a deal-breaker.For under $1000, this television is definitely worth a purchase if you have some extra cash laying around and are looking to jump into the world of HD!", "Date": "February 16, 2010"}, {"Title": "Excellent Quality, Excellent Price", "Author": "Miguel A. Aquino", "ReviewID": "R33HRD3NBW6D25", "Overall": "5.0", "Content": "Did tons of research before deciding on this 46\" model.  Video quality is superb, does excellent is most all scenarios, ok in low light scenarios.  For those of us that want the video image to look a very specific way, the settings menu is very intuitive, and does lend one to go into a great deal of manual adjustments.  For those out there who are a little Tech challenged, fear not, very, very easy pre-set settings are available, and TV works fine right out of the box.  Audio is good not great, but to be fair this is true for almost every HD TV, especially in this price range for a 46\".  I've have not owned this set long enough to rate durability, but based on my experience with Sony products, I'm not losing any sleep over any potential issue, we all know Sony makes quality electronics.  Still very excited about the purchase, verify satisfied customer.  Will update review if anything changes, but as of right now, no hesitation in giving this TV 5 stars.", "Date": "February 14, 2010"}, {"Title": "Love the set", "Author": "M. Manly", "ReviewID": "R1EG93K5KRLFJB", "Overall": "5.0", "Content": "We bought this for the bedroom - just to use as a TV.  It is better than we expected.  Easy to use.  We had it professionally installed and I was able to understand some features about the unit that I didn't know - for example - how to get HD through the TV without going through the cable box.  We are very pleased.", "Date": "December 16, 2009"}, {"Title": "Excellent Sony TV", "Author": "R. Wright \"Madison Bay\"", "ReviewID": "R3MEYLDW81S71A", "Overall": "5.0", "Content": "Purchased the 46\" Sony a month ago and have nothing but good things to say about it: easy to set up, sharpest picture I have ever seen, bright enough to work well in a very bright waterfront room.  Definitely a buy at $1,250.", "Date": "July 4, 2009"}, {"Title": "great tv!!!", "Author": "Jim \"Jim\"", "ReviewID": "R1OMZ7UAV866UK", "Overall": "5.0", "Content": "Set my 46V5100 up in a bedroom environment and have been wonderfully satisfied ever since. The picture is amazing, the sound quality works very well after a little simple adjustment to suite my individual preferences (base and treble) and the remote control is easy to navigate even in the dark. If the price works in what ever budget you have set than this is the TV for you.", "Date": "April 5, 2009"}, {"Title": "Dead in 6 months", "Author": "Game Junkie", "ReviewID": "R238L7B7AQZVJ9", "Overall": "1.0", "Content": "I purchased this tv in March 2009 and by September the HDMI inputs stopped working.  Great tv if the HDMI inputs hadn't always acted weird then one day the HDMI inputs just stopped working entirely.Just starting to work with Sony on getting it replaced/repaired.", "Date": "September 22, 2009"}, {"Title": "Crashes, Electronic problems", "Author": "Gary_G", "ReviewID": "R3O93LUFGF8B6B", "Overall": "1.0", "Content": "The set crashed 3 months after purchase.  It was repaired, then crashed after 2 months.  When it crashes, I am no longer able to receive any channel.  The controls fail to work - not only the remote, but also the manual controls on the side of the set.  I am only able to turn the set on and off with no picture, no sound.  I am very disapppointed in Sony as I previously associated them with quality.", "Date": "February 7, 2010"}, {"Title": "SONY BRAVIA S-SERIES KDL-46S5100 46-Inch 1080p LCD HD TV", "Author": "sixto hernaez jr.", "ReviewID": "R2STDD97WWTNE9", "Overall": "2.0", "Content": "I received the product damage as the item was poorly packed. I found out the item lacked the proper Styrofoam to protect it. Leaving the item to sustain damages.", "Date": "April 12, 2013"}, {"Title": "AWESOME!", "Author": "A. Santos", "ReviewID": "R1F7LIYE3JYWEN", "Overall": "5.0", "Content": "I purchased one for my mom's place when her sorry Samsung DLP broke. It's perfect! So perfect that I bought the exact same model when I moved out about 6 months later. Both are still solid, no issues, and I'm happy as a clam.", "Date": "March 11, 2012"}, {"Title": "Good picture quality, but the TV does NOT last.", "Author": "Amazon Customer", "ReviewID": "R36D5BGQEW1HA5", "Overall": "2.0", "Content": "I've owned this TV for about two years now. I'll be honest: I bought it on sale at Walmart. At this point, the TV is not new technology, but it gets the job done. Since I purchased it, my wife and I have been quite happy with it. Right up until 2 weeks ago.The TV, overnight, developed a thin black line that goes horizontally across the screen. It's incredibly distracting, and basically makes the TV almost unusable. It is, of course, out of warranty, so Sony will do nothing about it and the repair cost is far more than the TV itself costs.If you're looking for a bargain tv, look elsewhere! It's not worth 700 dollars for only 2 years of service.", "Date": "November 21, 2011"}, {"Title": "Awesome TV", "Author": "Tim Barber \"Tim Barber\"", "ReviewID": "R3NSTYSL28P1JO", "Overall": "5.0", "Content": "Has everything I need: three HDMI ports, great picture, and easy use.  No problems at all.  I've had it for over a year.", "Date": "October 27, 2010"}, {"Title": "Great picture, terrible durability.", "Author": "Ryno Redman", "ReviewID": "RSH2ORAIDKKQN", "Overall": "2.0", "Content": "When I first started using this TV I LOVED everything about it. Great HD picture, fast response, the works. But just 2 months after purchase, my audio started acting up.  Skipping & cutting out.  So I called Sony and they sent a software update.  That seems to have worked.  However, 9 months after purchase, when turning channels & switching between inputs, I get the \"no input\" screen.  I tried all HDMI ports, even a different HDMI cable, no luck.  It pops in and out very often.  Called Sony & they agreed to pay for the repairs because it's under warranty, but what happens when this comes up again in 6 months or a year?  I can already see the cost of this TV doubling inside 2 years.  I would not recommend this TV to anyone.  Get a cheapo set for less money. I thought Sony produced much better products, and I will not trust their brand ever again after this fiasco.  My parents had the same TV for 20+ years.  I guess they don't make em like they used to.  FYI- I bought my TV at Wal-Mart for $1000.", "Date": "October 21, 2010"}, {"Title": "sony bravia 46 \"", "Author": "Jacob Puister", "ReviewID": "R2R2YSK0NMNJ6X", "Overall": "5.0", "Content": "I have the sony bravia 37\" also. the 46\" is very nice and good for my living room Same quality very good I am pleased with the sony bravia. The only disturbing a bith is when I chaince channels it takes sometimes 5- 6 seconds I dont know iff this is normal. the 37\" bravis dont take that long Nd the same story with the control its to long.  jacob puister costa rica", "Date": "July 19, 2010"}, {"Title": "Great TV once you update the firmware", "Author": "Jonathan R Makovec", "ReviewID": "R2DCQOS2DLE9MP", "Overall": "5.0", "Content": "Don't have much to add other than it's a fantastic TV for the price.  I've had mine for a little under 6 months now, and when I first brought it home I noticed only one main problem.  There was some significant lag time before the TV would recognize a HDMI source.  Not a huge deal, but it was definitely annoying.  I looked online and saw this was a common problem but that Sony had addressed it with a firmware update.  Sure enough, I compared the firmware version it came with (can view this in the menu screen) and what Sony had on their website as the latest and it was an older one.  Easy enough to upgrade the firmware yourself as long as you have a USB flash drive.  Directions were self explanatory and it worked like a charm.  TV has been fantastic ever since.  Only other knock on it is the speakers.  I don't expect great sound from flat screens anymore, but the sound coming out of this is pretty decent.  My issue is past a certain volume, I'd get some annoying frame vibration noises from heavy bass during movies.  Recommend using a separate surround system for the audio with just about any TV anyway, which I do now.", "Date": "June 29, 2010"}, {"Title": "Really nice TV", "Author": "hector emilio amaya", "ReviewID": "R2C0831E6V1715", "Overall": "5.0", "Content": "This is a fantastic HDTV. I buy this brand because Sony has many years in the market, besides the prestige that all Sony Electronics have. Just look very good when comparing televisions at the stores, Sony has the most natural images, is neither very bright and not very dark, it's perfect! please buy a Sony will not be sorry.. One more thing.. It is light weight and very easy to move around..", "Date": "February 11, 2010"}, {"Title": "Incredible TV for the price", "Author": "Nicholas Good \"Nick\"", "ReviewID": "R1O8YRPC7K5P86", "Overall": "4.0", "Content": "Certainly it's not the latest 120hz or LED technology but... holy balls!  I got lucky and scored the display model at B*st B*y for $650!Picture is incredible.  Crisp, clear, color is very true, white balance was great out of the gate, little adjustment needed.  Lots of control for color balance, gamma, backlight (VERY important in my living room with huge sliding glass door facing the sun) and all the minor tweaks.Off-angle viewing is very good, typical wide viewing angles for LCD are there, with very little color distortion or contrast issues.VESA 300x300 mount, you can actually get a low-profile mount at Target to fit for under $60.  The frame of the TV doesn't seem very solid, once hung on the wall it vibrated quite extensively when disturbed.  Beyond that, no major issues with mounting or set-up.Not happy with 2 of the 3 HDMI ports being on the side of the TV, but that's being nit-picky.  Could use a few more inputs, but if you're in the market for a TV like this, you probably have a receiver with the needed inputs (as I do).  My only real complaint is the difficulty in getting through the menus for all the settings, could be quicker/better/easier interface, but again, nit-picky.Pros;-Color gamut-White Balance and Contrast ratio-size for price-off-angle viewingCons;-2 of 3 HDMI ports on side of TV (minor)-Menus could be easier to navigate (minor)-Stability of frame720p 42\" Plasma or 1080p 46 KDL-46s5100?  Overall, at under $800 I'd call this a no-brainer.", "Date": "February 6, 2010"}, {"Title": "TV", "Author": "G. Chavarria \"vitaltraining\"", "ReviewID": "R2UPMNDTXAZTBB", "Overall": "5.0", "Content": "Great buy for the price!  I saw similar models at Best Buy during the after Christmas sales and they were still about 50 bucks over what I got it for at Amazon on Black Monday.  TV still works great and have no complaints.", "Date": "January 31, 2010"}, {"Title": "Great HDTV, Great Price", "Author": "Howard", "ReviewID": "RHS53FH41PV4E", "Overall": "5.0", "Content": "Bought this for my mother-in-law.  Perfect size HDTV (46\") for her TV room which is about 12' x 12'.  Amazon had the best price, and the delivery men were very careful bringing it into the house and installing the HDTV.", "Date": "August 29, 2009"}, {"Title": "love it great tv for the price", "Author": "J. slagal", "ReviewID": "R6N4KEJEUQY0A", "Overall": "4.0", "Content": "this tv is awesome its good on the pocket to, picture is great if u have hd sources regular sd channels look kinda grainy but i figured it was normal, only issue i have found is the software update you will need for the hd inputs they just stop working after time but you can call sony and they will send u a usb drive u just plug into your tv, i picked this tv up for 750 +tax not a bad investment i have a ps3 hooked through the hdmi and it looks awesome and the bravia sync is definetly cool to use with the ps3 i can use my tv remote on the ps3 with the sync, overall if your looking for a good tv for everyday watching/gaming i recomend this one...i gave it a 4 instead of 5 because the hdmi ports issue should have been resolved by sony instead of me figuring out what happened by researching it otherwise it would of gotten a 5", "Date": "March 11, 2010"}, {"Title": "Problem with HDMI conn with Bose Lifestyle w/HDMI repeater", "Author": "Nutty Professor \"Awdnut\"", "ReviewID": "R3GTMYPKTIMAUJ", "Overall": "2.0", "Content": "Bought to replace my Panasonic 42\" plasma that was connected to Bose Lifestyle 35 with HDMI repeater/switching.  Never had any issue with the Panasonic but with the Sony can't get pic through HDMI connection thru Bose.  Going HDMI direct between Apple TV or Cable box is OK but thru Bose no can do.  Called Bose and was identified as problem with HDMI handshake (possible firmware issue with Sony).  Called Sony and was confirmed that TV need firmware upgrade (KDL-46S5100_ER411E229).  Downloaded the upgrade to my UBS storage and connected to the Sony TV,  firmware upgraded successfully.  Tried the result, you get barely some improvement (intermittent picture at varying resolution) but not watchable.  So be warned with this TV model and using with HDMI switcher/repeater like Bose or any other HDMI switcher, might have HDMI communication issue.BTW, it work if HDMI sources are directly connected to the TV but if later on upgrading with external HDMI switching might not work.  Also picture is OK for the price although my 3 year old Panasonic 42 plasma is definitely better contrast and fluidity.Sending it back to Amazon and getting another TV from local store which I can positively verify will work on the Bose Lifestyle using HDMI.", "Date": "August 28, 2009"}, {"Title": "Replacement lamp", "Author": "JMB \"JMB\"", "ReviewID": "R1YN976092N3OE", "Overall": "5.0", "Content": "Does the lamp burn out and have to be replaced on this model? If so, what is the serial number of the replacement bulb?", "Date": "September 15, 2009"}, {"Title": "NEXT TIME I LL BUY AN XBR SERIES TV", "Author": "Lenin Rodriguez \"LENIN\"", "ReviewID": "R1WGJELAAKXTYR", "Overall": "4.0", "Content": "ALL OK, BUT IS JUST TO PLAY GAMES ON ZBOX AND SEE  HD MOVIES, FOR REGULAR TV SUCKS", "Date": "October 12, 2009"}, {"Title": "Sony Bravia KDL-46S5100 46\" 1080p LCD HDTV Black", "Author": "L. Hansen \"Autoqueen\"", "ReviewID": "R2S3CP6U9RANR5", "Overall": "2.0", "Content": "Received this TV from the shipping company. The outside shipping vendor was very courteous and delivered this TV inside our home. The setup was a \"no brainer\".  Very easy.  The guide to plug in other components was very easy as well.  We have 2 other Sony Bravia TVs (32\" and 40\").  We have always been very satisfied with Sony products and this new TV is no exception.  The remote is very easy to use and the screen setup is very user friendly.  We have been shopping for this TV for some time and the best price was on Amazon, especially when you consider the free shipping and no tax.", "Date": "November 7, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "A 46-inch 16:9 Full HD 1080p Resolution Panel provides optimum resolution from any HDTV source that delivers 1080p content\nAdvanced Contrast Enhancer with Dynamic Backlight Control Dynamic Backlight Control creates a dynamic contrast ratio of 30,000:1\nUnique Sony technologies to reduce visual noise, improve color, and sharpen overall image detail\nThree HDMI inputs (up to 1080/60p input capable) , two Component YPbPr (1080/60i capable), and one PC input (HD-15 pin)\nBRAVIA Link compatibility lets you expand your HDTV's capabilities with BRAVIA Link modules", "Name": "Sony BRAVIA S-Series KDL-46S5100 46-Inch 1080p LCD HDTV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41RUrQ%2BINRL._SX300_.jpg", "ProductID": "B001T9N0E4"}}