{"Reviews": [{"Title": "Low Price Plasma Delivers", "Author": "newtonbosswell", "ReviewID": "R2GAW1AKUHJS1U", "Overall": "4.0", "Content": "As you can see this TV is priced to go!  $699 for a 42 inch plasma?  That's right.  The catch?  Well, It's only 720p.  But don't let that stop you from buying this sweet unit.  Here's the rundown: 1) Good Black Levels 2) 3:2 pull down for improved DVD playback 3) many aspect ratio settings 4) and many, many points of calibration.  Simply put, the picture is awesome and you will likely spend the first 10 hours in disbelief that the picture is this good for the price. The drawbacks: 1) Not 1080P 2) No S-video Input.", "Date": "December 8, 2008"}, {"Title": "JUST BUY IT!!!  Flawless Picture!!!", "Author": "Amazon Customer", "ReviewID": "RSAN18Z357DJG", "Overall": "5.0", "Content": "I bought this plasma after about 6 months of rewviews, research, and shopping. $699.99. Dont be fooled by 1080p. Your eye can't tell the difference unless you are within 5.5ft. Plasma Tv's have a faster refresh rate than LCD(even the 120hz LCD's), 100,000hr life, no burn issue anymore, and most have a better contrast.This TV is really awsome I compared it to the Samsung TOC(touch of color) series. The picture from a blu-ray player were virtually identical! This TV has many many settings that you can really tweak the color, contrast, etc. although you probably wont need them since it looks great out of the box. Sound is great as well, some reviews say different, but really is sounds great. Save you money dont believe the hype and bull about 1080p 120Hz LCD. You CAN get the same beautiful picture at a fraction of the cost.", "Date": "January 21, 2009"}, {"Title": "GREAT TV with few extras", "Author": "Joseph M. Weaver", "ReviewID": "R7ZX660B6LOKY", "Overall": "5.0", "Content": "Just got this tv and the picture quality if very good (as good as my higher end Samsung 50inch PDP).  It has limited inputs and no QAM tuner, but otherwise seems to be a very nice tv without all the extras.", "Date": "November 25, 2008"}, {"Title": "Update, Great set ***** 5 Stars", "Author": "Rob NY \"NY-Bob\"", "ReviewID": "R2QYN93LZDB0V3", "Overall": "4.0", "Content": "Received the set on Dec. 24th 2008Purchased from Amazon for $699 plus free shipping.Arrived in good condition, advised by delivery guy to inspect for any damaged. Stand was already mounted. Could not turn on due to cold weather it was around 29 degrees. Condensation immediately formed. Waited 3 hours. Had previously downloaded owner's manual, also read all adjustment comments here on AV Science Forum.First the case is beautiful, love the gloss finish and the swivel stand. Easley lifted by 2. The remote is not as classy as the case, has a low end feel compared to my Panasonic HD LCD remote.  To be fair all the buttons and controls are well laid out, it just doesn't have the solid feel and weight of the Panasonic.Connected to Component input from HD DVR Cable Box, turned the set on and immediately made the suggested picture settings. One note on the picture controls, the most extensive I've seen. If you're a tweak-er freak you'll be beside yourself.My Time/Warner HD signal up here in upstate NY varies greatly, on occasion it looks like standard TV. When good it's great. Have the optical audio out from the cable box to my Receiver. Cable remote setup was a bit of a problem, found the correct Samsung code, but then lost some cable box settings, like the guide and DVR list. The solution was first program the Samsung then the cable box itself, never noticed the box setup code was listed.After a few days I switched the component cable to HDMI (input 2), the picture greatly improved. I had to switch the cable box to HDMI sound.I made one other picture adjustment, switched from \"Film Setting\" to \"Standard\" from there I lowered contrast, brightness and cell. I felt the film setting added to much yellow to flesh tones and white graphics also had a cast. I am aware first 100 hours to lower contrast and brightness to condition the plasma display, even with lower settings the picture is great.Pro:PictureExtensive adjustment controlsCase finishSwivel standPriceCon:Low end remoteMute display stays on screen (although it moves)Would definitely buy again.After 300 hours still impressed. Got a Pioneer BDP-51FD Blu-Ray player, its built like a tank. I have to admit I thought suppose it doesn't knock me out. The setup was a bit complex, had to read the manual for sound options. Love the black gloss finish (matches the Samsung) and the display panel.As to the picture the set sings now, the picture details are amazing. More settings then I've ever seen, but then I never owned a player in this price range. I upgraded the firmware as well, a bit intimidating, but went well. Again the set display is truly fantastic.", "Date": "January 3, 2009"}, {"Title": "Great Television - Great Price", "Author": "Peter Solano", "ReviewID": "R3AM4UQHBF2B0F", "Overall": "4.0", "Content": "I purchased this Plasma for my parents for Christmas.  When we opened the box, everybodys reaction was wow.  I currently own a high end 42in Philips LCD, and this Samsung picture is much better.  Setting up the TV was very easy, and the on screen menu is straight forward and easy to figure out.  The remote control looks cheap and low class, but thats what you pay for I guess!  For those who are looking for a bargain Plasma without sacrificing quality, this is your television to buy.", "Date": "December 29, 2008"}, {"Title": "Great Price...No Complaints!", "Author": "Christopher P. Kittle \"Chris Kittle\"", "ReviewID": "R12KADR7JC1CEB", "Overall": "4.0", "Content": "This summer I bought a 50\" 1080p Samsung touch of color plasma and I have to say that I was seriously impressed.  In fact, together with Netflix and a Blue Ray player, my wife and I never go to the movies anymore.  Popcorn is cheaper at home.....and the picture is even better than the theater.  It was with that in mind that we bought this TV for our bedroom.  This 42\" plasma has been great so far.  We've had it for about a week.  Currently we don't even have it hooked up to a DVD player or a HD television channel.  I guess that means that I can only review what it looks like at standard definition (SD).  Still, at this bargain price, it looks great in SD.  I'm willing to bet that it looks even better with HD television or DVDs hooked in.  Heck, even if all you have is SD television I think it's worth it. Also, it's the perfect size for our bedroom....i.e.....it looks huge but just barely not too big.  If you're just starting into the TV market and don't want to spend too much but you want a lot of bang for your buck, this is the TV for you.", "Date": "December 19, 2008"}, {"Title": "Don't buy it", "Author": "Zane Ball", "ReviewID": "R1CU6SLH1RXRT7", "Overall": "1.0", "Content": "I bought this set thinking great price, limited but good enough features...perfect for what i wanted...until it self destructed about 24 hours after purchase. Screen went blank and a long crack appeared on internal glass. The rub is that screen cracks are inherently seen as misuse of the product and there is no warranty coverage regardless of what you say or do. I bought mine at Best Buy and they wouldn't help either and told me quite directly that Samsung would never cover any sort of cracked screen. A quick google search shows that I'm hardly the first person to have this problem with screen cracks or with warranty. Roll the dice if you want but make sure you have purchase protection on your credit card, document everything and even video tape the transport, delivery and installation to prove you haven't mishandled it in any way.", "Date": "December 16, 2008"}, {"Title": "very nice tv", "Author": "Leanard B. White", "ReviewID": "R3SCXMLAYC66FI", "Overall": "4.0", "Content": "nice tv. great picture. sound is pretty good. only one s-video slot so gamers will have a problem but overall cant beat price for what you get.", "Date": "January 13, 2009"}, {"Title": "excellent for the price", "Author": "Julia Setzer", "ReviewID": "R1QTMXFHCD3WA7", "Overall": "4.0", "Content": "I ordered the tv a few weeks before Christmas and received it a week later. The delivery person set it up and made sure that it worked. Everything was fine. I looked at more expensive products but decided on this one and am very pleased with my purchase.", "Date": "January 12, 2009"}, {"Title": "The best 42\" TV for Under $700", "Author": "Soulman \"Only the Best Value Will Do\"", "ReviewID": "R30UAPAWM9WD63", "Overall": "5.0", "Content": "I had a total budget of $1,000. I wanted to get the most for my money.  It's easy to get the best TV (when money is no object) but very difficult to find the best value.  At the end of the day, I selected this Samsung TV...with money left over to buy a blu-ray player.The bottom line is that this is a great TV for the price.  The fact is, on screen sizes smaller that 50\", 1080p is not a big deal.  And although this is a plasma and not an LCD, plasmas have some advantages versus LCD TV's (the blacks are \"blacker\", for instance).  Finally, you can get a 40-42\" 1080p LCD TV for less than $1000 but it's basically junk (at least as of today...but I'm sure that'll change in time).  This is a solid product from a solid manufacturer so you cannot go wrong...and I'll be enjoying it for years to come.Football is a whole new experience in HD.  This TV is basically idiot proof...it looks good out of the box.  Now the blu-ray technology is a bit of a different story.In all fairness, the other TV to check in this price range--which is a great TV also--is the Panasonic TH-42PX80U. Which ever one you choose, enjoy!", "Date": "January 12, 2009"}, {"Title": "Samsung PN42A400 42-Inch 720p Plasma HDTV", "Author": "Anastasiya Lotokhova \"armananova\"", "ReviewID": "R2PGV7F99JOC32", "Overall": "5.0", "Content": "I love my new TV. It has good picture quality and it works great. Thank you very much.", "Date": "January 9, 2009"}, {"Title": "very pleased", "Author": "Christopher J. Williams", "ReviewID": "R9BMSNSBM4XJ6", "Overall": "5.0", "Content": "I bought the 50 inch version of the A400 and am VERY pleased.  I am coming from a nice 55 inch HD mitsubishi and am completely satisfied.  This is, in my opinion the best bang for the buck in the plasma market.", "Date": "December 23, 2008"}, {"Title": "good buy", "Author": "D. Fischer", "ReviewID": "R2LS4FOGBL0LWB", "Overall": "5.0", "Content": "I originally had a 32 Toshiba LCD tv and saw this 42 Samsung plasma for only $700!! I have had it about a week and I have no complaints. I love it and think its a perfect size for a living room. Colors and quality are great for the price =)", "Date": "December 18, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001KOTTNY"}}