{"Reviews": [{"Title": "Nice performance, great value", "Author": "RIphoto", "ReviewID": "R1STI7REBBHNIC", "Overall": "5.0", "Content": "I just got this TV when Amazon dropped the price.  I am very pleased with it, its a terrific value.  The picture is amazing, its highly energy efficient costing only $1.14 a month to operate based on 6 hours viewing a day.  Its an Energy Star TV.  Sound is also good for what it is it has 2 X 5 watt speakers.  I saw the other review here and am a little perplexed as I've found this TV to be a great value for a standard 26\" LCD TV which is what it is.  I'd highly recommend it.", "Date": "November 28, 2008"}, {"Title": "Pretty good for the money", "Author": "Christopher R. Tinker", "ReviewID": "R3IBSEF1VD9KBD", "Overall": "5.0", "Content": "I purchased mine from best buy as I work at the store. I use it in my room so I can watch movies and stuff when my roommates are watching reality TV or something else stupid.Either way,...Pro's:-Great sound considering the size of the speakers, I would compare this to Sony Tv's to be honest. Can not get as loud, but same quality.-No glare at all. the matte finish diffuses all the light which is great.Cons:-Black level detail. In darker scenes/games you will lose much detail, but that is because of the matte finish. Its a trade-off for not having to deal with glare.-No optical out, meaning if you have a cheap-o home theater in a box with only 1 optical input, you will be limited for surround sound.The 5 star reasoning: The black level details are not up to par in my book. Maybe this is unfair because I sell TV's all day and see the best, but I think it could be better. Maybe not for the price though. Which is why I still gave it 5. I think the average user would never notice and would be very happy.", "Date": "December 29, 2008"}, {"Title": "Good performance, Excellent value", "Author": "Peter A. Stricker \"Aerospace engineer\"", "ReviewID": "R1MBU0NQ66JKLK", "Overall": "4.0", "Content": "I was surprised to see how great the picture looks, coupled with the extensive inputs/outputs, while the price was over 30% lower than  other comparable models. The only negative is that the screen cannot be tilted and the vertical viewing angle is not very good.", "Date": "December 13, 2008"}, {"Title": "Good picture and sound, decent value", "Author": "D. Glass \"engineer and inventor\"", "ReviewID": "R35E7MJHRQJN05", "Overall": "3.0", "Content": "I've had the Toshiba 26\" TV for 3 weeks, using it with both over-the-air and DirecTV HD service with RGB cables.  The sound is adequate, better than some other reviews might have indicated.  Color is very bright, contrast ratio is good.  My only disappointment is the unexpected \"de-pixellation\" (for lack of a real word) for signals received in 1080i resolution.  At 720p, which is the designed resolution and the product used by ESPN HD among others, the picture is HD-sharp; at 1080i there is some small-detail blending not present in our other 32\" direct view HDTV.  I found the details in the manual readable and helpful.For the price, and use as a second, lightweight HDTV or DVD screen, this Toshiba is a good value.  If you're after super detail and speed, pay a lot more for a larger Samsung 120-Hz LCD.", "Date": "January 2, 2009"}, {"Title": "A great television for the price.", "Author": "Kendrick L. Stokes \"Lusaric\"", "ReviewID": "R1LFXDQ2AYMUS3", "Overall": "4.0", "Content": "This is a great television that packs a lot of bang for the buck. It's loaded with features, small enough to be used in a bedroom yet large enough to be the center point of your entertainment system, and HD-ready right out of the box. The only downside is that, rarely, the set can actually crash when trying to process a really weak or garbled HD signal. It freaked me out the first time I saw it do this; I thought the thing had short circuited! But a quick press of the power button (and a new HD set top box from my cable provider) resolved the issue and it has yet to crash again. Others have complained about the viewing angle, but I haven't any complaints. Perhaps I just have mine more favorably placed than the others do?", "Date": "December 16, 2008"}, {"Title": "Impressive", "Author": "Vaughn Aimable", "ReviewID": "RPN1D1GXO0EIR", "Overall": "5.0", "Content": "With its many inputs the possibilities are endless. Picture quality is next to perfect! Great buy.I actually ordered the 'U' but received the 'R' model. From what I read the only differences are the layout of the on-screen menu and the layout for the inputs on back. The 'R' model seems to be manufactured after the 'U'. The inputs for the 'R' are found on the face of the back. That of the 'U' is on the bottom of the back meaning one must push up to get wires connected.", "Date": "April 8, 2009"}, {"Title": "Adequate Bedroom TV, but limited viewing angle", "Author": "Michael Jerchau", "ReviewID": "R1XJJ09LYBGU0M", "Overall": "3.0", "Content": "I recently bought the Toshiba 26\" 26AV502U and I actually received a 26AV502R.  I'm not sure what the difference is but from a google search there doesn't seem to be one.  The TV is the perfect size for a bed room and the picture is excellent if you view the picture from a small viewing angle (perpendicular to the TV screen).  If you move just a little more then 20 degrees or so to the right or left however, the picture quality declines rapidly.  So viewing degradation occurs at a much lower angle then you would expect.  So don't buy this TV if you can't view it straight on.", "Date": "March 28, 2009"}, {"Title": "Excellent product for the price", "Author": "Paul Seitelman", "ReviewID": "RTZ81B4Z063JE", "Overall": "4.0", "Content": "I purchased the Toshiba 26AV502U for $399 in January 2009 from 6th Ave Electronics in NY/NJ metro area. The picture quality and sound remain excellent for use in our kitchen where we have it wall mounted with a Sanus MF202. This  allows us to easily change the viewing angle but for most part we view straight-on.  I knew when purchasing this is not going to be par with a Regza/Bravia/Aquos experience. But it  delivers good performance for the price.Our viewing on this set is mostly news or evening prime time shows and some sports events. Sound quality is terrific. Our provider is Verizon FIOS. We have set the pic resolution to 720p. I do not think 1080i  adds  to viewing experience on a 26\" tv. I too agree some very dark movie scenes are difficult to view. We have the FIOS media DVR attached to another tv. I have noticed a red \"bleed\" (on something like a woman's dress) when viewing a previously recorded 'live' show but I have not seen this effect while viewing on demand or scheduled movies or shows. I assume problem is with the FIOS DVR quality and not the tv.We have used tv occasionally with a laptop but we need to reset the pic size and resolution  defaults for the tv everytime we go from FIOS to laptop and back again.", "Date": "April 24, 2009"}, {"Title": "What An Upgrade!", "Author": "Palo Girl", "ReviewID": "R37K6RBWW7HJTT", "Overall": "5.0", "Content": "I love this flat screen TV. I had bought a new JVC tube TV a few years ago which, surprisingly, went dead after just two years. So, I bought an old 20 inch tube off Craigslist for $20. I'm not that picky, and ignored my friends when they teased me about half my screen turning everyone \"green\" and the fuzzy picture. Still, I was sticking to my guns. Until I bought my 89-year old mom, a 22 inch flat screen a couple of months ago.I decided to pick a price point and when a 26 inch flat screen hit that point, I would jump on it. I had targeted this Toshiba and was tracking it on several sites. Amazon, in all their brilliance, dropped their prices the days after Christmas and scooped their competition. I also knew that I could trust Amazon, as opposed to sellers I never heard of, and so I bought this set from them. It arrived way before the promised date, and was fairly easy to set up. It works great, easy to use, volume is fine, despite a couple of reviews to the contrary. Would recommend this to anyone looking for an apartment-sized TV, or one for a bedroom. What a difference in viewing from anything I've had before.", "Date": "February 2, 2009"}, {"Title": "Great TV, Great Price", "Author": "Mary From The West \"MTM\"", "ReviewID": "R3LDER9RHNSKB3", "Overall": "5.0", "Content": "After much searching and researching I purchased this TV from Amazon as it was the best deal, with the features I wanted, for this model and fit my space limitations perfectly.Pros:Easy to set up. Good picture quality, good color, blacks look fine to me so can't agree with other reviewers, good remote, works well with over the air antenna. Sounds great with my cheap Pioneer surround sound. I'd rate the on board sound fine as well. I didn't find the manual at all difficult to interpret. I had it scanning channels with a cheap antenna 10 minutes after taking it out of the box. It picked up 32 over the air channels. I do live on a hill in a major metro area so that may help.  I've seen some digital signal breakup when viewing distant stations when there is heavy rain but you cannot fault the TV for that. I do not have this TV placed in an optimal viewing location, 8\" above ground level inside a built-in cabinet so the viewing angle is from above looking down, hardly optimal, and I still think the picture is fine. I was concerned about the viewing based on other reviews? Side angle viewing I would rate exceptional.Cons: None. Its a good TV for the money.Other: It would have been nice if my old Panasonic surround sound would pick up the Toshiba remote.", "Date": "January 10, 2009"}, {"Title": "BEST 26-inch TV you can buy", "Author": "ken2020", "ReviewID": "R1QQU95EMZVJV3", "Overall": "4.0", "Content": "I have two of these in my home, and both have been working flawlessly for several months. The tuner circuitry in this Toshiba is absolutely the best I've ever used. Even when signal strength fluctuates due to surrounding obstructions and interferences, the tuner has an uncanny ability to fine-tune the station and then lock the reception on the signal. Both the video and audio performance of this unit are superb, the onscreen navigation is well-designed and easy to operate, and the flexibility for different input configurations is excellent.  I'm especially thankful for the broad-width pedestal base, which provides a VERY stable placement.  The Toshiba pedestal for this TV is far superior to many others I've seen which tend to be small and therefore could allow those other TVs to tip.", "Date": "February 28, 2009"}, {"Title": "Buy this, you won't be sorry.", "Author": "NDGuy \"NDGuy\"", "ReviewID": "R1F1NS5TET90AR", "Overall": "5.0", "Content": "Before Christmas we looked at several brands ranging in price from $399 to $550 in the 26-32 inch range.  The Toshiba brand made the difference since the other sets in our price range were mostly off brand sets.  We received the TV in less than a week, delivered to the door.  Setup was easy.  The manual is complete and easily understood. This TV is located in an area of the house with a lot of sunlight.  Color is sharp with a minimum of glare.  Sound quality is great although we will be adding some external speakers for more depth.  For the price this is an excellent buy.  You won't be sorry.", "Date": "January 6, 2009"}, {"Title": "Priced well for a sub par tv.", "Author": "I call them as I see em.", "ReviewID": "R1O943YKMIUGM1", "Overall": "3.0", "Content": "The tv is cheap enough so if you want something for the kids to watch then go for it.  But, if you are intending this tv to be a favorite for many years to come then consider the Panasonic TC-26LX85 instead.First, the black level is very poor.  On dark scenes the black has a lot of brightness to it especially on the left side.  If you only watch full screen or HD then it's not as big a problem then if you watch a lot of 4:3 content.Second, the contrast depth is not that great.  Objects in the shadows will just be black, not enough contrast causes this.Third, the color is either washed out or over blown.  It seems it can be practicully both washed out and too much color especially in green.  The poor color rendition makes everything look more cartoonish then real.I am taking this one back and paying the extra $100 for the much better Panasonic.", "Date": "December 27, 2008"}, {"Title": "picture went black in 15 months", "Author": "Cynthia L. Vercolen", "ReviewID": "R1OZ85S6PVQJXC", "Overall": "1.0", "Content": "Was a good tv until the picture screen went black in less than a year and a half.  Toshiba refused to provide any assitance.", "Date": "March 25, 2010"}, {"Title": "Ok tv when it works right", "Author": "Carlos Lee", "ReviewID": "R18Z9ZNTXH3J42", "Overall": "2.0", "Content": "I've had this tv for 5 months and have had numerous problems.1:The sound goes out and you have to turn the tv off and on to get it back.2:The screen freezes and goes bright with no sound.3:The screen freezes and goes bright with loud anoying static.4:No recall when you go to the same channel twice.Note all this has happened more than three times.I have two of these tvs and the second one is having the same problem but only twice has it happened.These problems seem to be only happening with the 26 inch because I also have a 32 inch and have had no problems what so ever.I recommend another brand for 26 inch tvs.", "Date": "May 31, 2009"}, {"Title": "Usage, non-technical evaluation", "Author": "Richard K. Ellinger", "ReviewID": "R90KWTA1AWWFI", "Overall": "4.0", "Content": "This 3rd HDTV is for kitchen but bedroom, dorm, would be ideal. At 26 inch, the 720 resolution is fine with a beautiful sharp picture, whether the broadcasts are in 720 or the highest 1080 format. (analog still works, too.) We use it with the built-in tuner as there is no cable TV here and we don't have DISH. It took one call to Toshiba support in Illinois on a Saturday to understand how to find the autoprogram for the TV tuner. The manual could be better. Support was great, the TV automatically tuned in 63 TV channels in Mid Mar, 2009, with about half of them already in HD. (San Francisco area.) This is better than the earlier HD tuner on a far larger, more expensive TV which tunes only 43 channels on the same antenna. For movies, a single cable connection (HDMI) from the DVD player to the TV does it to see all the NetFlix movies and DVDs. We've had power failures here and tried reprogramming the TV with a different antenna with the same good result. The TV advertised 'deeper black' and it does seem to have a great contrast range because of this. Larger LCD TVs at 39in and 42in compare nicely with this little Toshiba 26 in.The remote control on the Toshiba can run the DVD, tape player, TV and the cable/satellite box. Even if it only did two, it's a big help. I wish the volume and ^v channel buttons were at sides instead of adjacent to each other in center. We use this in a lit room but in dim light it would annoying. I wish the control lit up.Our model is one from Amazon Warehouse resale as it had been returned and either tested or reconditioned. I can't find the claimed cosmetic defect. I've checked for stuck pixels on the screen - little dots of light - and can't find such a defect. Amazon ships fast, unlike some other sellers on their network.One person can uncrate the TV, attach the stand if not screwed on already, attach the antenna cable and plug in the DVD player cable. There are stenciled pictures of the cable ends next to where they plug in - neato! Add two batteries to the remote control. On the remote, slide the only sliding switch to TV, press power, then SETUP GUIDE.The TV should be ideal for games. The display is fast - I tried this on the computer. Sound is Ok but not what you should have for home theater. For theater, buy something over 42 inch with a big sound system, too.This Toshiba was good buy for our usage.", "Date": "March 30, 2009"}, {"Title": "Toshiba 26AV502U 26-Inch LCD HDTV", "Author": "Leaf \"Serena\"", "ReviewID": "RI7YXN660EDR8", "Overall": "4.0", "Content": "I have been using this HDTV for about two months and I think the picture quality of it is pretty good. Sound quality is reasonable with the price.  Overall, I would recommend to buy this product.", "Date": "March 19, 2009"}, {"Title": "Good Value, Above Average Performance", "Author": "ATUL SAINI \"Atul Saini\"", "ReviewID": "R23WA1MHFX8WYT", "Overall": "4.0", "Content": "I bought the Toshiba 26AV502U LCD TV from amazon.com for $369.99, I think is very good price for the performance of the TV. First the TV arrived on time as advised by Amazon but as I opened the box and switched on the tv there was no power sign and after struggling for couple of hours and calls with Toshiba customer care found that the TV was defective. My family was very disappointed and we had to ship it back, that is why I did not give it 5 stars. Anyhow the replacement arrived fairly quickly and it was working.Pros:I read other reviews regarding sound not okay but I did not found any issue with it, I think the dolby sound is great.I hooked up the tv with toshiba dvd player and there was no need for the dvd remote, in fact my son lost the toshiba dvd player remote.Picture quality is great, I'm using the $19 antenna from Radio Shack and get about 35 HD and Analog channels for free....isn't it great in this state of economy.Cons:Sharpness is little low, but considering the price, I think its okay.", "Date": "January 27, 2009"}, {"Title": "Issues happen less frequently after updating to firmware 1.02", "Author": "B. Chan \"trying to help\"", "ReviewID": "R3UV1DXLXV52RR", "Overall": "4.0", "Content": "After using the 26AV502U for a few weeks, I notice three minor annoying problems:1. While changing channels, if you land on an analog channel, there would be no sound.  Only way to get sound back is to change to any channel and back again.2. The first box in Fav Browser will not work correctly. (fixed with firmware 1.02)3. The TV would freeze up randomly.  So, just power it off and back on.My TV came with firmware version 1.0, I updated the firmware to version 1.02 and problems 1 and 3 seems to occur less frequently.", "Date": "January 25, 2009"}, {"Title": "Exactly what I was looking for", "Author": "TJHodie \"spyders mom\"", "ReviewID": "R378709GG5K6KK", "Overall": "5.0", "Content": "This TV was exactly what I was looking for at the price I wanted to pay. It has a great picture and great sound. Perfect TV for the bedroom and uses hardly any space.", "Date": "January 18, 2009"}, {"Title": "Good Buy", "Author": "Earnest", "ReviewID": "R1TVZGZW0CHMRT", "Overall": "5.0", "Content": "The price and the quality are just right for my purpose--a bedroom TV. It works well and has an excellent picture--particularly in HD mode.", "Date": "January 12, 2009"}, {"Title": "Great for LCD HDTV Newbies, but Audio is Lacking", "Author": "T. Hall \"adventure seeker\"", "ReviewID": "R1QFBYDIQDFRK5", "Overall": "4.0", "Content": "If you're on a budget and this is your first hdtv, this is a decent choice.  The picture is good (I found the Zeniths at the store to have the clarity and brightness I really wanted, but they were too large for my entertainment center and outside of my budget).  If your eyes aren't accustomed to HDTVs, you may not see the difference between this and a better model for some time.  A larger telly isn't meant to be watched up close, so consider your space when choosing a screen size.I recommend reading the manual and adjusting settings for the best picture.  And remember that you will only experience an HD (high definition) picture if the program is broadcast in HD.  In layman's terms, that means you can't polish a turd, folks! :o)  Don't expect a regular broadcast to look like the crisp, clean pictures you saw at Best Buy.If your DVD player has an HDMI port, buy the HDMI cable and use it.  I watched Beowulf with my son, and even he could tell the picture was incredible.  (The DVD brand is a factor as well...we use a Sony).For audio....you don't have to be an audiophile to realize Toshiba skimped on this aspect of their product.  It's a shame, and it almost made the rating go down to a 3.  AUDIOPHILES STAY AWAY.  I read the reviews and bought it anyway, knowing that I will eventually complete my setup with surround (receiver, speakers, subwoofer).  In my small place, I can have the volume maxed, and still need more.  And I'm not trying to blow the roof off.  When our heat kicks on or the washer/dryer are going, we have trouble hearing some things.  And I read the manual, tweaked for a week, and it's not loud enough.  I upgraded from an Apex!  The Apex even had a louder, fuller sound that didn't need to be pushed near max!  So it's a legitimate complaint.  If you're in a super quiet home, or in a room the size of a closet, maybe the sound is more than enough.  But for most busy homes (with other tvs, children, or home appliances), it will Not.If you're not on a strict budget, or you can wait a few more paychecks, save for a Samsung or Sony (or even Toshiba's better models).  If you don't know an Apex from a Coby and have a quiet living space, this will be fine.", "Date": "January 4, 2009"}, {"Title": "Toshiba 26AV502U 26-Inch  is a great TV at a great price", "Author": "Skypilot", "ReviewID": "RZLGU1T7GWO1Z", "Overall": "5.0", "Content": "I have had it for almost three months now and I can not find one thing bad about it. It does everything it promissed and more and was by far the best priced option for a 26 inch HD with good video quality.", "Date": "March 19, 2009"}, {"Title": "Great Television", "Author": "Raylene Coe", "ReviewID": "RYUWW3Y9RKQ6P", "Overall": "5.0", "Content": "It doesn't dominate the room, like many other digital TVs today do.  We love the picture clarity and sound quality.  It's a perfectly sized TV for our small beachfront home.", "Date": "September 14, 2013"}, {"Title": "GOOD TV THEN BAD TV, VOLUME GOES UP BY SELF", "Author": "POS-POC-POJ", "ReviewID": "R1IN7G17Z9NE7A", "Overall": "1.0", "Content": "Worked ok for two years then started to have volume issues where it raises the sound levels by itself. Unreliable TV, possessed TV, Don't but it. Stay with the known name brands. Otherwise, you will always remember when you are looking at another TOSHIBA, it is actually \"TO-S***-BA\"  POJ -Piece of Junk! Piece of sheet, Piece of Crap!", "Date": "December 28, 2012"}, {"Title": "Great for the price.", "Author": "Master Yoda", "ReviewID": "R2BTNYGKA436EA", "Overall": "4.0", "Content": "The picture is great except for one small thing. There is a purplish halo at the top and bottom of the screen. Most of the time though it is not noticeable. It only really becomes noticeable on widescreen content that has black bars on the top and bottom. Overall though, it really isn't an issue.Also, I bought a popular Blu-Ray Calibration disc that has a blue filter and used it for this TV and here are the settings....(read the notes at the end)Contrast: 90Backlight: 20Dynalight: OFFBrightness: 48Color: 36Tint: 0Sharpness: 0Advanced-Dynamic Contrast: OFFStatic Gamma: 0Color Temperature: WarmB Drive: 2G Drive 0Noise Reduction-CableClear: OFFMPEG Noise Reduction: OFFNotes:I did this calibration to the best of my eyes. It is not perfect but the picture looks great to me.I turned the backlight down to 20 because it was really too bright for me. I thought 20 really didn't strain my eyes at all. I also brought it down to 20 BEFORE I calibrated so the settings were calibrated at the Backlight on 20.The calibration was done in a completely darkened room at night. So it may not look as good in a lightened room.The source that I calibrated from was a Blu-Ray Player at 720p using an HDMI connection with all picture settings on the Blu-Ray player on normal/default.Overall, I am quite happy with this tv.", "Date": "April 15, 2011"}, {"Title": "Lot's of problems. Unusable after two years.", "Author": "D. Dale", "ReviewID": "R3NOOMQAUL1AYU", "Overall": "2.0", "Content": "We've had this TV for a little over two years and it is now unusable because white lines appear and the picture washes out every few seconds. Prior to that, I've had issues where the sound goes out, were it loses it's memory of channels we've programmed out, and where it won't turn off. I will not be buying Toshiba TVs any more.", "Date": "March 24, 2011"}, {"Title": "Great overall", "Author": "Kevin Krutsch", "ReviewID": "RDN8T8EUR85G4", "Overall": "4.0", "Content": "Bought this as a second TV for the house, and it's done the job quite nicely.  The picture is crisp, sound is plenty loud for the small room it is in, and it looks nice and sleek.The only issue I've had is that every once in a while, the TV will start to fade to white and then stay all white.  Turning the TV off and back on takes care of this.  This happens once every few months (so certainly not a real issue) and I'm not sure if it's a problem with this TV model, or just the one I purchased.  This also only happens when using the HDMI input (as far as I've experienced).", "Date": "February 22, 2010"}, {"Title": "Pretty much exactly what we were looking for", "Author": "LTZ", "ReviewID": "RINWWMMMLXR2O", "Overall": "5.0", "Content": "This TV was Pretty much exactly what we were looking for for our master bedroom.  We got rid of the box tv and went with this flatscreen.  We didn't need anything crazy and this offered a good value, good picture, very decent sound - so everything we wanted.", "Date": "February 15, 2010"}, {"Title": "Value, value, value!", "Author": "Patrick L. Mccabe", "ReviewID": "R3LFXZV7VBXXFD", "Overall": "5.0", "Content": "Product is exactly as advertised, arrived sooner than anticipated and was in A1 condition.  Toshiba seems to make a great product - the perfect TV for the kids in their play room.  Can be used with their games systems, computre, DVD and as a television.  Could not ask for more.", "Date": "June 1, 2009"}, {"Title": "Good Quality", "Author": "Nancy L. Street", "ReviewID": "R11U5FB6TVHY1D", "Overall": "4.0", "Content": "I bought this TV for the master bedroom for my husband's birthday. He was excited. We had a few issues with the shiiping, broken the first time is came, but after it got settled, we love it. The picture is a little dark but very good for the bedroom.", "Date": "May 23, 2009"}, {"Title": "Extremely Pleased", "Author": "K. Holm \"Cabin Guy\"", "ReviewID": "R3C5WG47JJP5AB", "Overall": "5.0", "Content": "I was a little worried about purchasing a TV on line, but read the reviews on this TV and decided to take a chance.  I couldn't be more pleased.  The picture is sharp and crisp.  The remote works great.  I have it mounted in my cabin bedroom.  Makes rainy days fun.  You won't be disappointed with this TV", "Date": "May 22, 2009"}, {"Title": "Decent value, could be better..", "Author": "Jordan Runsvold", "ReviewID": "R68ZX7QIKZ4PI", "Overall": "4.0", "Content": "Picture is nice with 2 exceptions - black level & backlight uniformity. This TV would be just fine in a brighter room, but I bought it for the bedroom & it just doesn't cut it in the dark.. Blacks are dark gray at best, & the backlight is pretty uneven IMO. Then again this is my first LCD TV, maybe I'm expecting too much. Just ordered a new Samsung to replace, hopefully that will meet my expectations.", "Date": "April 26, 2009"}, {"Title": "Good value for money, decent sound and picture.", "Author": "Groo8", "ReviewID": "R3DCTO75YMGWSA", "Overall": "4.0", "Content": "I got one of these over Christmas and I have been generally happy with it.  I use both HDMI and well as the AV inputs for a variety of video sources such as my Satellite dish, DVD player, old VCR and a media player.  I'm not much of an audiophile, so the sound seems okay to me (although I'm not one to turn the volume up really loud).  Picture quality is perfectly fine with me.I did notice that the screen freezes once in a while, especially when the input source is in a screen saver mode.  Thanks to reviewer B. Chan for pointing out the firmware upgrade, which I will try next.Overall, this is a great tv to have for a small room or bedroom.", "Date": "April 3, 2009"}, {"Title": "great TV", "Author": "J. Liu", "ReviewID": "R23D4BEXNKUSXF", "Overall": "5.0", "Content": "I bought this TV for a guest bedroom. Everything works great. I would recommend it to my friend.", "Date": "March 13, 2009"}, {"Title": "Toshiba to view", "Author": "Daniel B. Stockstill \"DocStock\"", "ReviewID": "R1086CFF5AIBN5", "Overall": "4.0", "Content": "Toshiba 26AV502U 26-Inch 720p LCD HDTVA happy choice for small room viewing. The Toshiba 26AV502U provides an excellent picture through each of the input options. The picture is at its best using the HDMI inputs as most would expect.Sound appears somewhat muddy but is more than adequate for casual viewing for all but the most picky audiophile.The remote is capable in handling 4 devices. Set up is straight forward for TV use with satellite. The slide-switch device/mode selector is somewhat less satisfying for large-fingered people like me but locks securely in each of the four positions.Price to performance, these small sets deliver a winning combination.", "Date": "January 28, 2009"}, {"Title": "HDTV for the bedroom", "Author": "Robert", "ReviewID": "RCSMXCY7YBYXV", "Overall": "4.0", "Content": "Bought this for Xmas present for the wife and put it in the bedroom. Decent size tv for the bedroom, wouldn't want any smaller. HD looks very good and my upconverted DVD's look good as well, just two short HDMI cables do the trick. Lots of good features and tweaks on this tv. I have a plasma for my home theater and this product confirms that the plasma is superior in color accuracy, black level retention, angle of viewing and SDTV. I replaced a 20 year old set so my Toshiba LCD HDTV still looks great. Overall, satisfied.", "Date": "January 26, 2009"}, {"Title": "Toshiba LCD TV review", "Author": "Nathan John Presley \"Nate-Dogg\"", "ReviewID": "R1HV94UKFFD3MM", "Overall": "4.0", "Content": "I worked for Toshiba in their TV assembly plant, so I was somewhat biased. I kinda have this love/hate relationship. I want them to be the best, but I am skeptical of their products. The LCDs were made in Japan when I worked there, so I assume that could still be true. This set is great. There may be better sets out there, but for the price I paid, I don't think this set can be beat. I love the digital tuner and the HD capability. I am already planning on how I can afford to replce my other 2 sets with and LCD. This set looks good; it doesn't look bulky or like a computer monitor, as I've oticed some LCDs can & do. Inherently, the LCD is a bit pixelated, but that's the nature of the beast.", "Date": "January 14, 2009"}, {"Title": "Seems good so far", "Author": "Jim in Rochester \"Jim\"", "ReviewID": "R2ZLMNEGOY5XR2", "Overall": "4.0", "Content": "I picked this up as a TV for the bedroom. I was thinking about one of the store brands for a few dollars less or pay the same for a bigger display. Ultimately I decided to bet on the Toshiba name. Time will tell. Delivery was fast. Set-up was easy. I have it hooked up to an extra HD-DVD player I had. HD and standard DVD material look very good at 720p. Volume seems fine for a bedroom set, no additional audio system hooked up. So far only one complaint; I couldn't program the TV remote to operate the DVD player, and they're both Toshiba products. That's one of the reasons I went Toshiba and now I have to use two remotes. Not a big deal but an unnecessary inconvenience.", "Date": "January 12, 2009"}, {"Title": "Excellent picture and good remote coverage", "Author": "E. Jespersen", "ReviewID": "R1KUJTRC7OC9N2", "Overall": "5.0", "Content": "This is our second 26\" LCD.  Our first was a Westinghouse with DVD included which we really like accept the remote control coverage is poor. We did not need a DVD included for this second purchase but did want to ensure it had good HD characteristics.  We are extremely satisfied with the picture and also the remote control coverage.  Price was also good.", "Date": "January 10, 2009"}, {"Title": "Toshiba 26\" HD TV", "Author": "Richard Trzeciak", "ReviewID": "R2ZENH6D1LAXJK", "Overall": "5.0", "Content": "When we first got this TV and hooked it up, we were a little concerned because the picture wasn't as clear and crisp as we thought it should be---but when we hooked up the HDMI cable, the picture became everything, and more than we thought it should be. A great buy!!!!!", "Date": "January 6, 2009"}, {"Title": "Looks great. Sound is just OK.", "Author": "MizKitty417", "ReviewID": "R14APD51P6C4VL", "Overall": "4.0", "Content": "This is my first HDTV (if you can believe that) but I looked around for several weeks before getting this. First of all, my laptop, DVD player, and VCR are all Toshiba and they've worked great. Also, you really can't beat the price. If you look for a sale, you could probably get this around 375-400 dollars. Those made by Samsung, Sharp, and Sony cost much more. If you have a medium sized livingroom, bedroom, or den this will probably fit your needs. Assembly and learning the features did not take me too long (about 1 and 1/2 hours). The picture looks great! If you have a movie buff or big sports fan in your family, then you may want something else. The sound on this is not that great. I have a 10+ year old Philips TV in my spare room and the sound is better on that one. But I'm pretty happy with this so far.", "Date": "December 31, 2008"}, {"Title": "Great TV for the money!", "Author": "Maureen Abel", "ReviewID": "R3KIBBI1VSPJ2O", "Overall": "5.0", "Content": "Received this for Christmas.My first LCD HDTV.Colors are clean and crisp.Screen is bright.Easy setup,right out of the box.Have not found anything to be negative about.Still going through the big manual.Thought I wanted a 32\" but turns out the 26\" is perfect. Not to large.It does not overpower the room.Really like that I don't get reflected light on the screen.Its a great gift!", "Date": "December 30, 2008"}, {"Title": "Good LCD, nice value.", "Author": "Ryan Pease \"EconomicWarrior\"", "ReviewID": "R28P1RG80OH0BH", "Overall": "5.0", "Content": "I recieved this T.V. for Christmas 2008.  It is a nice tv packed with all the features of the larger ones for a smaller size and price.  The only slight downside to this model is that it has a slightly slower channel change rate when it is directly connected to a cable sourse than some of the more advanced models.  This is a little perplexing because this model changes channels alot faster when it is tuning to a digital or HD channel than a standard def, cable channel...  It is not so slow that it becomes annoying, just enough to be worth a mention.  Would reccomend and would buy again.", "Date": "December 26, 2008"}, {"Title": "Not up to usual Toshiba standards", "Author": "Karl R. Schneider", "ReviewID": "R2OMPW0P20VNAM", "Overall": "3.0", "Content": "I bought a 37\" Regza a few months ago and like it but this smaller Toshiba is way inferior...the vertical viewing angle is limited to about 10 degrees...which makes for very poor pic quality if the watcher isn't pretty much smack in front of the screen.Not impressed.I'm editing this...with a couple of books, I was able to tilt the screen to get a better viewing angle which made a BIG difference.  The television has a wonderful picture if you're looking at it directly...that's my only point here.  But then people don't usually look at a Rembrandt from way off to the side, do they?", "Date": "November 6, 2008"}, {"Title": "keep your reciepts", "Author": "Jonathan Barnes \"luckydux\"", "ReviewID": "R2VWNLQOOESNLY", "Overall": "4.0", "Content": "I bought this for my parents for Christmas at a price of 349.95 with free shipping.  It was being sold by Tigerdirect through Amazon.  I'm not sure who is at fault politically, but I ended up paying $125 for shipping.  After many emails and conversations and of course both companies playing the blame game, I still don't have and won't get my money back.  I could have ordered this TV at many other places for the same price and free shipping but choose AMAZON because I wanted one other item on their site.  If I would have saved the promotional web page when I ordered, this would all go away.  Sooo, in the future I will save all pages when ordering especially from AMAZON, and recommend everyone do the same...great TV though :)", "Date": "March 3, 2009"}, {"Title": "Nice when it works..which isn't right now", "Author": "D. Klutts", "ReviewID": "R2ASF7H7IUW94D", "Overall": "1.0", "Content": "Bought this tv from circuit city when it was going out of business. It wouldn't work as a regular tv not even when I hooked up several differnt antenas and multiple convertor boxes trying to get just local hd television. So I then hooked it up to my computer. It worked for a while then one day while I was playing one of my games it just went black. the green power button is still on, it even makes a sound when I turn it off (after I hold down the power button on the console or the remote for about 12 seconds. I'm just glad I have this second montior because the toshiba is black and not working. I wouldn't recommend this piece of junk to anyone.", "Date": "May 4, 2009"}, {"Title": "Thought it would be have a better more vivid picture", "Author": "Wendy Reed-dimeas \"WRD\"", "ReviewID": "R2FUM4BT4U5HS7", "Overall": "3.0", "Content": "I guess I should have bought a plasma. This tv is fine, but you must adjust the color, brightness, contrast etc. for every channel. I don't think it's the tv. But unless you are sitting right in front of it the quality of the picture changes. I guess that's because it's an lcd, like my laptop. But for the size and the price and brand, I think it's a good deal. I have been enjoying it much more than my 20\" Tosiba analog flat screen.", "Date": "February 5, 2009"}, {"Title": "Great", "Author": "Gary M. Powers \"Gary Powers\"", "ReviewID": "R1IE41BJA39J0N", "Overall": "5.0", "Content": "Great Product, Excellent Shipping Time especially over the holidays. Easy set and excellent product. Great Service. Thanks", "Date": "January 29, 2009"}, {"Title": "Flat Screen TV Review", "Author": "Karen A. Dailey", "ReviewID": "RIFMKSCZHXGOZ", "Overall": "4.0", "Content": "Accurate item description. Excellent customer service and pricing, prompt delivery, and overall complete satisfaction with the product. I will continue to do business with Amazon.com without hesitation. It was a very pleasant experience.Karen, Boston, MAToshiba 26AV502U 26-Inch 720p LCD HDTV", "Date": "January 27, 2009"}, {"Title": "Great TV", "Author": "R. Landon", "ReviewID": "R1KY6B4NXBG4PS", "Overall": "5.0", "Content": "I bought this TV for my bedroom and it is the perfect size. It doesn't take up much room at all. Great picture and sound quality. Very energy efficiant.", "Date": "January 23, 2009"}, {"Title": "Review of the Toshiba 26 in LCD", "Author": "Calvin S. Givens", "ReviewID": "R30FZBXB7FOM60", "Overall": "4.0", "Content": "So far so good on the purchase of the Toshiba 26 in Lcd. The picture quality is fantastic,very good picture. We are pleased with the purchase.  Thanks,  Cal.", "Date": "January 23, 2009"}, {"Title": "DO NOT BUY!!", "Author": "M. Jones \"stumped at first\"", "ReviewID": "R37YRIX03UANOT", "Overall": "2.0", "Content": "Nice picture but I had this tv for 6 months and it's now in the repair shop. cost to me: $225.00. bought it for $450 out the door and now I'm in for $700!! no more toshiba's for me. check out samsung and panasonic instead. just a heads up guys, check out consumer reports.matt detroit, mich.", "Date": "July 12, 2009"}, {"Title": "Toshiba 26 inch not as good as I had hoped.", "Author": "Rick Price", "ReviewID": "R250VDQAGBP8X0", "Overall": "3.0", "Content": "The sound is fair and the picture quality is ok if you are basically right in front of the set.  I purchased the tv only a couple of weeks ago and still am stumbling through the 59 page instruction manual.  Good luck on this unless you are an expert in tv features and operations.  Would I buy it again?  Maybe.", "Date": "December 15, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001EHN7TY"}}