{"Reviews": [{"Title": "Excellent LCD with overall ease of use", "Author": "M. Moreno \"IpodL\"", "ReviewID": "R29HHS52PR3MAG", "Overall": "5.0", "Content": "I bought this TV in June 2008 and have found it to be an absolutely great buy. I bought my at RC Willey. Yes, I read the CNET review and the reviewer marked down the TV because of the dark shades changing. I looked at this in the store for several minutes and have lived with it for a month and have not noticed that problem at ALL! Personally I think they guy shot down the SONY because Samsung is running TV advertisements on CNET. This is a super sharp TV with excellent colors and deep deep blacks. This TV is much better than the old 2007 W. Here is why I bought this TV...It is super clear in digital broadcast and does a much better job in Analog/420p SD (old) transmitions than any other TV I have seen (no jaggies..thanks to Sony noise reduction/DSP). Sony knows Bluray- they invented it, they know what skin tones should look like like (they own a movie studio), thier menus are really easy/simple to use (vs. Samsung 650), it has a built in TV guide (You can get rid of that Monthly cable box fee) and it has future expansion capability. On pure picture quality vs. Samsung 650: * Picture: It is pretty darn close in digital broadcast. I looked at both side by side. Samsung has a slight edge on clarity in analog broadcast. Samsungs have more glare, Sony is a matte screen but blacks on samsung are pretty darn good because of the glossy screen. When viewing a BluRay DVD though, the Sony slightly more details. No fade from bright to black issues on sony as noted by CNET (he must have had a protype system). Colors are nice a bright and bravia 2 engine is even better than XBR4 or near it. I have heard the Z series may be better but they don't make it in 52'' yet. * Menus: Samsungs menus are made for Engineers (lots of tweeks, but really confusing for average user).  If you doubt it, download the user manual to the A650 and KDL524100 and see for yourself. If you and your family are highly technical, go for the Samsung. If you don't want to fiddle (aka get lost in menus), but get an excellent picture, go with the Sony. Sony's are really simple and easy to use, plus it automatically find digital channels and is somehow able to display all the channel icons (it is like I have a built in cable box).* Features: The Sony may not have the Ethernet and built in weather/news of the 650 Samsung, but it does have the built in TV guide and future expansion. Realistically, if you want Internet in your TV, you are better off connecting an external device (Playstation, Apple TV, etc). The TV guide feature in the sony is great and the Bravia Sync is a big plus (especially when you use a Sony DVD upconverter 1080p (nice one at costco)- why?...TV remote controls it all. Sony Picture n' Picture is nice as well allowing you to view pictures/video from HDMI while at the same time viewing cable TV (regardless if it is SD or HD signal)* Asthetics: My favorite feature on the sony is that the power buttons on on the top of the TV... helps with preventing kids from turning tV on/off. I believe Samsungs are too low. I personally didn't like the Red on the Samsung and the glossy screen.  The remote on the Sony is really easy to find/use vs. the Samsung. But the Samsung's remote lit up at night...which the Sony's does not.Bottom line: if you are a videophile and your family (wife) can deal with the techno menus (plus you want to upgrade the firmware to fix the Samsung A650 on/off bug), get the Samsung. If you want the a super clear  Picture (videophile made easy), easiest to use LCD with features that make every day TV viewing smooth and easy... The sony is excellent- Plus it is future expandible.Recommended Evaluation settings: Picture mode custom, backlight 7, Picture 95, Brightness 45, Color 50, Hue 0, Color temp Neutral, Sharpness 4, Noise Red. off, MPEG Noise red. off, Advanced settings-> Black corrector: med, Advance C.E Med, Gamma off, clear white low.", "Date": "July 1, 2008"}, {"Title": "Best 52\" LCD HD-TV for the money", "Author": "Ali S. \"review_monster\"", "ReviewID": "R3DMW06IXKYCGF", "Overall": "5.0", "Content": "I did a lot of research when I decided to buy a 52\" TV. I'm a student and a part-time salesman at a fortune 100 company in consumer electronics. After weeks or perhaps months of preparation and research I narrowed down my options to the Samsung A750 and the Sony bravia w4100. Now I did have a Samsung A550 and a Sony Trinitron High Def CRT at home and they were both pretty impressive but I figured that Sony does a better job in 52\" or larger category after observing the w4100 and a750 for several days at work.First off lets talk about the screen. The 50'000:1 contrast of the Samsung vs. 30'000:1 contrast ratio of the Sony. The way Samsung measures its contrast ratio is radically different from Sony, that is why Samsung never discloses its \"TRUE CONTRAST RATIO\", but Sony does. In this case sony's true contrast is 3,000:1. Whatever the true contrast ratio of Samsung, it is not superior to that of Sony's. This is something that most experts  agree on. It is easy to blast your dynamic contrast ratio but not your true contrast. Some claim that the Samsung produces deeper blacks but my answer is that this is due to Samsung's glossy mirrored screen and it has nothing to do with performance. The mate screen of sony absorbse white light coming from backlight or any ambient lighting from the room. This causes the blacks not to appear as deep or fake as the samsungs. Plus, Samsung manufactures all of Sony LCD screens so in terms of screen capability they are equal. If you have a bright  room go for the sony, the screen is slightly brighter and not reflective like the Samy. The backlight for Sony seems to work brighter but its not as evenly distributed as the Samy, this is clear in the dark.Second factor I checked for was the TV engine. We have the Samsung's Dnie Pro vs. Bravia 2. Well there is no question that bravia 2 is the clear winner here, being utilized by Sony XBR6 and XBR7 which go for about $4000 dollars while the Samsung's DNIE pro is built to compete with the lower end Sony Bravia Engine Pro. Sony's Standard TV quality is excellent and the Samy is just as good but i noticed that Sony's colour was more natural ie. colour of grass in baseball. Also sony covers  over %90 of colour Gamut while Samsung covers only %70, this maybe why skin tones and greens look more natural on the Sony.Next up was refresh rate and here both run at 120 Hz and here Sony has dramatically improved over the XBR4 series in motionflow. Samsung also does really well in 120 Hz category so I say they are both a tie here.Sound is another important factor for my decision, i blasted the 7 series at work and noticed poor sound quality in extreme volumes while the Sony better retained its quality. However the Samsung was capable of delivering deeper Bass probably due to its built in Subwoofer. Sony allows you to adjust voice volume and enable steady sound to prevent commercials from freaking you out in the middle of your favourite tv shows. But be aware this may cause low volume in sudden loud scenes in movies.Finally last thing I looked for was design. Samsung 7 series looks fabulous with its glass like frame and a touch of red, but that is the problem for me, \"red\". I don't fancy a red TV and I think it's one of those fashion trends that would soon be \"old fashioned\". Sony however retains a more masculin design with fine glossy black frame and metal speakers at the bottom.Its a pretty close call but having used both Sony and Samsung (sony for longer) i feel that sony is more capable of delivering quality products as most Japanese manufacteres do. Also sony has great customer service vs Samsung i have had a sony TV break once and there was a repair man at my door step in less than 12 hours servicing my TV at home (bulb replacement in a old projection tv). Sony is the innovator here while Samsung is the follower, that's one reason why i chose the sony. Biggest factor for me was the superior Sony TV engine and better design. Oh and by the way sony is slightly thinner.Sony is the best your money can buy for a TV overall, as it always has been since the day of Trinitron. [...]Pros:- Excellent Picture Quality- Deep dark blacks- Motion Enhancer- Covers 90% color gamut- Vertical viewing angle- Great Sound/Audio performanceCons:- Horizontal Viewing Angle- lacks picture Shadow details", "Date": "September 22, 2008"}, {"Title": "Great investment", "Author": "Dr Watson", "ReviewID": "R2YAARACBLD5SD", "Overall": "5.0", "Content": "***Updated*** (with new settings post firmware upgrade)I have had this TV for 5 months now and could not be happier. This set produces excellent picture quality, amazing black levels and vibrant colors. The new Bravia Engine 2 also improves with 120Hz motion processing from Sony XBR4 line. My TV is located in a well lit room so the semi-matte display was a must. This TV delivers many useful settings to let you have the full freedom of making this TV truly yours. The PQ on 1080p material such as blu-ray movies or games is phenomenal. Broadcasted 1080i/720p HD sources look very good too - all depending on your provider and signal strength. SD quality is good but again it varies from channel to channel.For everyday use, this TV will get some immediate props for its' picture delivery from any viewer. If you like sports, you can expect unrivaled video processing of fast action. If you enjoy movies, this Sony offers a combination of settings to complement the true 24p cinematic picture.Since blu-ray movies are still expensive I have done a lot of testing by watching normal DVD's on my PS3 - and I have to tell you, those DVDs look better that HD broadcasts from Comcast. It feels almost unreal when you get to watch older movies with such clarity as if they were shot just a few years ago.If you need some starter settings to get more accurate reproduction of colors and detail, feel free to use my settings (post update v.202):Picture AdjustmentsPicture mode: CustomBack Light: MinPicture: 94Brightness: 52Color: 45Hue: 0Color Temperature: NeutralSharpness: 5Noise Reduction: MediumMPEG Noise Reduction: OffAdvanced SettingsBlack Corrector: OffAdvanced C.E.: OffGamma: OffClear White: OffLive Color: OffWhite BalanceR-Gain: -1G-Gain: -1B-Gain: -4R-Bias: -3G-Bias: 3B-Bias: -2Motion Enhancer: StandardCineMotion: Auto1Screen MenuWide Mode: FullAuto Wide: On4:3 Default: OffDisplay Area: Full PixelKeep in mind that sets and environments vary - so you don't have to use these settings verbatim. But it should give you a good start without a professional calibration. Just make sure not to leave the setting at the default given Vivid - since companies set most TVs at the brightest picture setting to compete against other sets in the bright store rooms. Otherwise you may be get a second hand tan from the picture =)Sound quality is excellent if you are not planning on using a more powerful sound system. The TV offers plenty of ports - so you can easily connect to many devices at once.I hope you love this TV as much as I do. Enjoy!", "Date": "September 6, 2008"}, {"Title": "Very good HDTV and Amazon delivery service is great too!!", "Author": "W. Chan \"Wilchan.com\"", "ReviewID": "R3FCEZU9Y646XP", "Overall": "5.0", "Content": "This is my first HDTV and this one fits my budgets. Both picture and sound quality are great.I was comparing this one with Samsung 650 and Sony XBR4.  XBR4 is very nice, but with $800 more it is way over my budget. I like the contrast on W4100 better.  I believe XBR6 will have same contrast ratio or even higher, but price will be definitely much higher too.  Samsung 650 definitely has better color on HD content, due to its 10bit panel maybe, but the glossy screen will produce too much glare in my family room where it has windows all around.  I was debating if 10bits panel really matters during the shopping process. But now, the TV is setup in my room and I feel very happy with the color (as I won't remember how 10bit panel on Samsung's looks like in Frys or Circuit City :) ).The PQ on HD content is very good in local cable 1080i and 720p HD broadcast.  SD content PQ is decent if you keep the Wide mode at Full mode.  If you skretch to zoom to take up the full screen, the result is not good at all.The sound quality is good too out of the box.  I don't have home theater system, therefore, built-in sound is important.So far, I enjoy this HDTV set a lot.Amazon white glove service is nice too.  They call before delivery and they unpack and setup the TV set for you.  I got this set for $2399 from Amazon a week ago and the TV arrives within a week.  Excellent.", "Date": "July 27, 2008"}, {"Title": "Excellent - but with a couple quirks", "Author": "Eric Persson", "ReviewID": "RBG1HU74MIMBD", "Overall": "4.0", "Content": "Bought this from Amazon, best price by $400+ from local stores and lower then other sites, and the Amazon reputation!!! White Glove delivery was 4 days earlier then anticipated and was flawless. They brought it in and set it up, turned it on and left...Over all I LOVE this television. My 'quirks' later are minor compared to the overall excellence of this.Picture is sharp, bright, and clear, even with sporting events. Sound is excellent, glare (I have two large windows in the room) is low compared to a glossy TV.I have played one DVD and watched cable television from it. The cable sourced unencrypted 720 and 1080 HD broadcasts that fill the screen are AWSOME! The others are better then my old 37\" as they equate to about a 42\" but I feel cheated because they don't fill the screen without losing the edges of the picture. This is a transmission issue not a TV issue.I bought a Bravia audio system at the same time and while it took me a little while to find all the settings in both devices once you do it works well. When you switch between functions (TV or Video) the TV and Audio system decide who's speakers to use and switch between them. You can override that but the initial setting work.Now the quirks....- I did a full auto search then digital channels only, some digital channels that I can direct access do not get enabled in the search. I can access them if I enter them in the TV Guide (which works well) but if I manually scan up or down it skips them.- Then I noticed that some channels that were locked out arbitrarily come back to live. When I go to them I get no signal. Occasionally \"can't decode signal\" which is an active encrypted channel, but I locked these out manually.- The PIP is frustratingly limited as you can only use it with the PC input. I often used PIP when watching sporting events and another show.- The PAP (picture and picture) is also arbitrarily limited as you can only use the TV input as the sub screen, then another input as the main screen. You can switch back and forth between them and get audio from the live one but not maximize then switch. I had an older tube TV that allowed PIP and then another that allowed 4x PIP and you could switch between andy of them.- The buttons to get the PIP and PAP are convoluted. There is not a single key to get them, takes about 3 to 4 key strokes.- The remote is out of ergonomic balance. The control buttons in the middle do nothing during normal TV operation and the channel and volume are all the way down the bottom putting it off balance when using it. They could have se the control buttons at the top to mimic the volume and channel.- Manual is good at best. Some of the steps to reach a goal are missing so the last step like `and push the control button' are there but how to get to that control button is left to the user to figure out.- No Coaxial audio out, there is Optical and HDMI.- TV Guide is very good. It also takes a litte 'smarts' to set up. One thing missing I had with my old Guide + Gold was the ability to schedule shows so the channel changed automatically or if you had shut it off, the TV would turn back on when the show started. The ability to schedule would have been nice.", "Date": "August 28, 2008"}, {"Title": "Took my time selecting a TV, glad I did.  Great LCD set, read on...", "Author": "Beatnik", "ReviewID": "RCG451T7J8DD2", "Overall": "5.0", "Content": "I would be the first to complain and I don't write reviews to rave, this is unusual for me.Incredible Picture, bright, lifelike color representation.  Without mentioning a word most everyone that watches the TV comments on how great the picture is.  Almost hard to believe.  I have another relatively new LCD (Samsung and Samsung DLP) and a Plasma (Panasonic) set.  HD programming on this set makes HD on the others look like Standard Def.The way the set displays motion is unlike any other TV I have seen or owned, very cool experience to watch a scene pan left or right.  It doesn't look like TV, it looks like HD film.Intuitive menus and remote, easy to plug and play with most any hook up and source.  I have a PS3, Cable Box, Pre-Amp and Apple Computer all hooked up, it took minutes and everything worked right away.  You can even use the interactive TV menu to label each port.  Could not be easier to use this, very natural and simple system.  When switching sources they are listed by both port AND source, for example \"HDMI1 Cable, HDMI2, Game, HDMI3 PC etc\".Blows Samsung setup and menus away, Sony makes the Samsung interface seem complicated, clumsy and unattractive. I have had 2 Samsungs and am very happy to have purchased a Sony this time. Obviously the picture takes priority over the setup and interface, again the Sony picture is preferred as is the no glare screen. I also think the remote design is terrific, good size and layout.The design of the TV is stunning, beautiful work all around.  Sony was at the forefront for MANY years and started to lose ground to Panasonic and Samsung.  Sony is back...", "Date": "October 16, 2008"}, {"Title": "Words cannot describe how happy this TV makes me", "Author": "Alan Fong", "ReviewID": "RS5WLA2FY14JN", "Overall": "5.0", "Content": "I love this tv. It is aesthetically pleasing. The visuals it produces are great. The motionflow and cinemotion make watching dvds, even old dvds, a totally different experience. Videogames are awesome. Good to go 5 minutes out of the box. Since its a sony I know if something happens to my TV, like dead pixels (knock on wood) i know that sony customer support will take care of me. no flaws i can think of with this tv. I hope it lasts 5 years +**UPDATE**It has been a month. all the pixels are intact. I got cable TV with HD channels, and it looks so good on this tv, i dont care what im watching, as long as its in HD. a troubling thing is sound seems to be cutting out sometimes. I dont know if its the cheap $2 HDMI cables i got here, but if i change the channel and change back, it works again.I am still very happy with this TV, especially for the price I got it at**UPDATE 2**It has been 4 months and my TV is still going strong. I no longer experience that weird sound issue, and there are still no dead pixels. I am still very happy about my purchase", "Date": "July 7, 2008"}, {"Title": "Home Theater Store = BAIT & SWITCH", "Author": "Travis Dao", "ReviewID": "R2YJYOZY6ESU25", "Overall": "1.0", "Content": "First off this is not a negative review of the Sony BRAVIA W-Series KDL-52W4100 52-Inch 1080p 120 Hz LCD HDTV. This is negative review of the seller Home Theater Store which pulled a BAIT & SWITCH on me when I tried to order the TV through Amazon. After I ordered the TV I received an email from Home Theater Store saying I was eligible for a free Sony upgrade to the KDL52W5150. I called Home Theater and told them I did not want the upgrade. They said they would ship out the TV I ordered (KDL52W4100) within 24 hours and I should receive the TV in 2 days. After not hearing from them 2 days later I call Home Theater and this time they tell me they do not have my TV anymore. ??? They say it's defective. I asked them when will they receive a new shipment of the TVs they said they will not receive anymore of the 52W4100. They told me I can either cancel my order or get the Sony upgrade KDL52W5150. Needless to say I was infuriated and cancelled my order. As of now they are still offering the KDL52W4100 on Amazon when they've told me they don't have it in the warehouse. I will never order from Home Theater Store and I strongly suggest Amazon remove their listing of this product.", "Date": "November 19, 2009"}, {"Title": "Very Happy", "Author": "Wayne", "ReviewID": "R3FODHWVIBJXT3", "Overall": "5.0", "Content": "I've had this TV for about a month and couldn't be happier.  (I'm also happy to be done with comparing 30 different models of big screen LCDs every time I go into a store!)I debated between this and the Samsung LN52A650.  Side by side the Samsung's picture seemed brighter in the showroom.  But then I decided that it was almost tooo bright.  The other major factor was that the Samsung A650 has a shiny screen like the plasmas do even tho it's an LCD.  I'm so glad I didn't go with that as our viewing room has a window at the back and there's plenty of reflections on the screen in any black areas of the picture.", "Date": "August 13, 2008"}, {"Title": "I love this TV!!!", "Author": "J. Williams \"Just Some Guy\"", "ReviewID": "R1OIMYB18MNY5D", "Overall": "5.0", "Content": "After much research and local store visits for side by side comparisons, I decided to get this TV as my first ever HDTV.  This TV is gorgeous to look at even when off, and the display is fantastic.My decision came down to this set, or the Samsung 650 model.  That said, my room has a lot of windows and natural light, so the glare would be horific on the Samsung.  The Sony is a pleasure to watch, night or day.Highly recommended TV.  Its a Sony...you just cant go wrong.", "Date": "July 27, 2008"}, {"Title": "Beautiful", "Author": "Matt_Foley", "ReviewID": "RTE60JQ04DLBV", "Overall": "5.0", "Content": "I've had the tv for about two weeks now and it has been great.  The HD picture is amazing of course, my SD programs look great and Blu-ray movies are virtually flawless.  I moved up from a 42\" Plasma, which has been a great tv.  The LCD is definitely brighter in my very open living room.  I chose this over the Samsung 52\" 650 model.  While the Samsung has a slightly brighter screen and Consumer Reports loves the tv, it's very glossy screen simply reflected too much light for my viewing location.  The more matte finish on the Sony has been perfect.", "Date": "September 17, 2008"}, {"Title": "Best LCD TV Around", "Author": "Kapil Dukle", "ReviewID": "R2BCT9Z6332WH6", "Overall": "5.0", "Content": "I have owned both LCDs this year - the popular Samsung LN52A650 and the Sony KDL52W4100. I have no hesitation in saying that I prefer the Sony way better than the Samsung. Here's why:Plus:- Amazing picture quality - natural colors, amazing black levels, sharpness, clarity on SD broadcasts- Superior motion enhancement (Motionflow) even on high setting. (superior to Samsung A650 AMP)- Stylish looks and design- Decent speakers although I prefer to use my external home theater speakers- Semi-matte screen reduces glareMinus:- Menu layout cumbersome  (too much vertical scrolling)- No remote backlight- No swivel standThe minuses are minor issues that I can live with. Overall this is one of the best TVs you can buy at a fair price.Highly recommended!!", "Date": "November 5, 2008"}, {"Title": "Just what we expected..", "Author": "Amazon Woman", "ReviewID": "R3REKZDNZDO34O", "Overall": "5.0", "Content": "We were impressed. We were looking for same equivalent of tv with the Samsung brand..it took us awhile to decide and were so relieved we went with Sony.Whew! Sleek-looking, picture is great, no need to close our windows when watching tv because no more glare!What a difference. This is actually one of the major deciding factor why we went with Sony not Samsung, even though Samsung is a little bit less expensive.", "Date": "October 5, 2008"}, {"Title": "The proof is in the family room (plus a White Glove delivery review)", "Author": "Debbie Lee Wesselmann", "ReviewID": "R3JWFICNO5T8QM", "Overall": "5.0", "Content": "Technical specifications don't mean much to the average consumer until he turns the set on and sees exactly what all those numbers mean.  This Sony Bravia's 1080p, 120 Hz, high contrast specs result in a huge, crisp, vibrant picture that will have you standing there for several moments, dumbfounded that the images are actually inside your house.  You know then that those specifications were worth every penny.Like many, my final decision came down to the Samsung LN52A650 52-Inch 1080p 120Hz LCD HDTV with Red Touch of Color and this Sony.  Side by side in the stores, I judged the Samsung a better, crisper picture except when letters stayed on the screen (as in a film title or advertisement), and then the Samsung had ghosting where the Sony stayed steady.  Both performed better than other brands when viewing the picture from a slight angle, important if you plan to have several people in the room watching at once.  I chose the Sony, however, for two reasons:  one, our family room has a lot of windows and therefore, glare; and two, the price and promotions offered at the time of purchase.  The Sony screen is not as glossy as the Samsung's, and I thought it would deal better with the light conditions in my home.  The Sony blacks are deep, but more matte, one reason I think the Samsungs look better in the showroom but might be more difficult to view in a home.The set-up menu is intuitive except for the TV Guide feature, which cannot be used if you need a cable box to unscramble the signal, as is the case with most cable HD content.  The remote is easy to read without being bulky.  You can change the screen fill (wide zoom, normal, full, zoom) with a touch of a button without accessing the set-up feature as well as control a compatible Sony Blu-Ray player (ex. Sony BDP-S350 1080p Blu-ray Disc Player or Sony BDP-S550 1080p Blu-ray Player) through the Bravia Sync feature.  With 4 HMDI, one PC, and 2 HD component inputs, the set can handle a variety of hook-ups.  There are also some esoteric features such as DMeX compatibility (to connect a special Sony DVD to the television on the back/side), and voice zoom.  The 120 Hz Motion Flow keeps blurring to a minimum during fast action, historically a problem with LCD technology that is only rarely evident on this Sony.  If you are buying an LCD to watch sports, you will definitely want a 120 Hz refresh-rate set like this.Unless you have HD satellite or cable, don't waste your money on this set.  The enormous screen enlarges standard digital content that looks acceptable on a smaller (say, 42 inch) set into imprecise images.  Once you watch a DVD or Blu-Ray on this set, you'll know how lousy standard digital signals are in comparison.  I suggest a smaller LCD set for people who want standard signals but high-quality images during DVD playback.WHITE GLOVE DELIVERY REVIEW:  When you check out, at first you'll see that the television is not eligible for Free Super Saving shipping.  As long as you see the free White Glove Delivery box on the product page, don't worry.  (Note: White Glove Delivery was free when I ordered; it may not be when you read this.)  When you finish the process, you'll see that the shipping has been deducted.  We received a phone call from the delivery company as soon as Amazon shipped, then again two days after they received it.  We didn't get much notice:  they called Friday afternoon to say that they wanted to deliver it Saturday afternoon.  From ordering to delivery, it took a week.  The White Glove Delivery can be deceptive, however, since only one man arrived, and then he asked my husband to help him carry the television over the threshold and to the room where we wanted it set up.  If you are disabled or unable to help carry it in, or if you want it carried to an upper floor, make sure you tell the delivery company this when they call to arrange delivery.  While LCD screens are light compared to the old projection televisions of comparable size, the shipping weight is listed at 99 pounds (I think it's lighter than that -- more like 70.)  The service will lift the television out of its box and set it on the stand.  If you want, the delivery person will remove the packing material.  He will plug it in and (possibly) connect to your cable/satellite provided you already have the connection accessible.  Do not expect the service to hook-up all your devices to the set.  It is merely a subcontracted one-man delivery service.-- Debbie Lee Wesselmann", "Date": "January 7, 2009"}, {"Title": "Perfect!", "Author": "David", "ReviewID": "R30W8Q8AZ2H4LA", "Overall": "5.0", "Content": "Like most big screen shoppers, I did a ton of research and ended up with the 52W4100.  I got it last week and couldn't be more impressed.  The SD channels look good, the HD channels are unbelievable.  I've got a room with a ton of windows and the matte screen really does a nice job reducing the glare.  I really like the look of the whole package.  I can't wait to get a BlueRay player.  I am 120% satisfied with this TV.", "Date": "October 14, 2008"}, {"Title": "OH MY GOD, 1000 STARS  SO FAR", "Author": "GSC", "ReviewID": "R3MARQU6IBO7AT", "Overall": "5.0", "Content": "Edit: 11-11 TV is still going strong never had a problem with it!Just got this TV but after all the TVs Ive had this picture quality is truly AWSOME. Just wrote a review for my Sharp I like to but this one has a digital picture of HD quality and even my DVDs Look SO much better it is truly UNREAL. I love Amazon but didnt purchase either thru here.BUY THE EXTENDED WARANTY!!!Let me give you a little background on my TVs Ive had 5 brands of TV, in the last 4 years all HD. First was a off brand big tube very heavy TV I think the brand was Dish. It blew up in 3 months. Then I got a 52\" JVC rear projection that was ok but had to replace the bulb in a little over a year, then a loose connection cousing 3 service calls and finally a replacement, it lasted 3 years. Was a good TV but the picture was fading cant say I wasnt a little happy it got replaced. While we had the JVC we got a 52\" Panasonic Plasma again picture was ok, but it ran very very HOT,it was like having the oven on in the bedroom, It went out in about 6 months and after the service tech couldnt repair it We got the 46\" LCD Sharp, even this one developed a line in the picture after about 3 months, contacted Sharp and after Emailing a Picture of the line in the picture they immediately sent out another TV and picked up the old one they were very nice and very easy to deal with, and the replacement has worked great for almost 2 years now. For a less $$$ amount I would recommend the Sharp Aquos LCD, It was the best till I got my Sony. But my best recommendation is always buy the extended warrantys there worth it.I dont do gaming or hook up my computer ect to my TV just my satelite and DVD, however it has 4 HD connections, monitor connection, in and out you know the rest, pretty much everything if your in to that you know what to look for.All I can say again and again the picture quality is far beyond any TV Ive owned, it runs nice and cool, very light for its size and HIGHLY RECOMMEND IT.One more thing I will never buy Rear projection or Plasma again.  LCD ROCKS!!!Update: Dec2009 Still LOVE this TV Totally Awsome ONLY WISH MINE WAS PRICED THIS CHEAP!!! LOL Also us as computer monitor a lot now, stream netflix Works Great!!!", "Date": "August 12, 2008"}, {"Title": "Great, But, Why No 10-Bit Display?", "Author": "C.G.S.", "ReviewID": "R2R69W06YMPXUE", "Overall": "4.0", "Content": "I ordered this television from Electronics Expo via Amazon and it arrived a little over a week from the ordering date. They originally said they had the television in stock and it was ready to ship, however, I called them up a few days later and they said they were awaiting restocking of this television from their warehouse and then they would ship it. I contacted Electronics Expo a few days later after that and they informed me my television had been shipped and they gave me a tracking number and a phone number to call the shipping company. I arranged for the shipping company to deliver the television the next day. Surprisingly, there was only one delivery guy, so, I had to assist him carry the television downstairs, which was not a problem, however, there should probably be two delivery guys.Now, regarding the television itself. Last March, I purchased a Sony KDL-V3000 40\" LCD (2007 Model), which I am very satisfied with. So, please keep in mind that I am sort of comparing this older model to this newer television, since my eyes are so use to the older model. Essentially, for some reason, Sony downgraded this years W series to a 8-bit display from a 10-bit display last year. My V series from last year has a 10-bit display as well and this was sort of my benchmark when comparing and contrasting my new television to my older one. Though probably only noticeable to someone in my situation, that is, someone who is so use to a 10-bit display, the difference of quality of the color and vividness is noticeable (though marginally) of a 10-bit display vs. an 8-bit display. It's hard to explain. The colors are just more deeply detailed and more vivid on my older 10-bit display. So, if extremely vivid, jump at you color is your primary concern, you should probably consider an XBR television or even last years 10-bit display LCD's. I'm not sure why Sony downgraded their non-XBR series this year to 8-bit displays, whether it be economically, maybe cutting back on input costs to increase their profits or maybe they're seeking to entice consumers to spend that extra cash and go for the XBR series. Again, let me reiterate, you would probably only notice this marginal difference if your eyes had been so already accustomed to the 10-bit display, like mine.All in all, I'd say this Sony is a solid television. For a 52\", the television is pretty light and it only took two people to mount it to one of those mounting stands, which, you remove the base and screw the television onto the mounting stand. The picture quality is above average and the frame of the television is aesthetically pleasing. As always with a Sony, the layout of the settings are intuitive and well designed. The 120hz setting has improved the motion flow of the picture, however, the picture can look too video-like if put on high setting. The illumination of the Sony emblem is neat, though, it can be distracting while viewing, thus, I keep it off. Though, I do miss the vivid detail of a 10-bit display, you can't go wrong with a Sony.", "Date": "November 21, 2008"}, {"Title": "No TV is perfect, but this is close, great value for 120hz refresh", "Author": "JM5", "ReviewID": "R3BRHFPFLVEVEI", "Overall": "5.0", "Content": "I debated long and hard on the Samsung 750 vs the Sony. The Samsung had more features, 10 bit, internet built in, but in the end I went with Sony. I really didnt like the red trim on the Samsung, and i've never had a Samsung.  I've had 5 Sony TV's, including 2 XBRs, and have NEVER had a problem. Never.  They are predictably great at rendering a great image...The one thing about the Sony is that it is SO good, it makes some non-blu ray movies played through a Blu-Ray device (PS3 in my case) that they look like a video.  This occurred w Star Wars Phantom Menace, and it looked horrible, like they shot it in a home. It seriously looked like a video!  I thought this might be an anomoly, so I tried Planet of the Apes (non blu-ray) and it was not as bad, but similar.  That said, I've not made any adjustments to the tv settings (Picture etc..) I just went with it right out of the box. So, it may just be me ... We'll see.  I'll report back.  But overall: LOVE the TV.  Amazing picture.", "Date": "August 9, 2008"}, {"Title": "Do yourself a favor and avoid any Sony TV", "Author": "NeverSonyAgain!", "ReviewID": "R2MVTSIY1FNNPM", "Overall": "1.0", "Content": "I bought a new 52 in. XBR9 back in Oct. 2009 for $1,900, and the LCD panel has already gone bad after 22 months. Cost to fix = $2,800! I called Sony and they could care less! Offered to sell me another set for a reduced price. I wouldn't spend another penny on their products! Need more proof ... just look at some of the other 1 star reviews on their TVs.  I'm not alone.", "Date": "September 7, 2011"}, {"Title": "Everything I wanted in a HDTV", "Author": "Ronald D. Strack \"Gandalf the White\"", "ReviewID": "R17ET6FF8VRN2D", "Overall": "5.0", "Content": "Connectivity is a snap with 4 HDMI available plus component and s-video.  The TV looks great even before you turn it on.  The picture is exceptional.  Motion blur really not an issue.  Connected a PS3 and the Blu-Ray movies are almost 3D. I would recommend this TV especially with the great price I got thru Amazon.", "Date": "July 29, 2008"}, {"Title": "Light Sensor", "Author": "Ross A. Williams", "ReviewID": "R36VCKWO0I407B", "Overall": "4.0", "Content": "I read the objection that the backlight and contrast keep changing. You are right and it can be controlled by going to General Setup settings and turning off the light sensor(see pg.42 of instr. book. Now, the Bravia is a spectacular product. But,the default settings are a disaster. It took me a week to adjust the set to it's full potential for optimum viewing.It's worth all the trouble.", "Date": "January 30, 2009"}, {"Title": "For the $$$$$ Good TV", "Author": "JL Boss", "ReviewID": "R1NW5CGNBG9N21", "Overall": "4.0", "Content": "Okay, I don't put a lot of faith in reviews. What I did know is I wanted a larger HDTV so I found myself reading a lot of them. I like many of you reading these reviews, was searching for the best LCD HDTV for the best value. I mean these things are expensive right? So why I am writing a review you might ask? Because I hope that half of them ones that I read were an honest opinion, not a paid employee writing a review. This is my honest story: I knew I wanted a new HDTV and I had narrowed my search between the Sony W or X series and the Samsung 850 or 950 series. I already own a 32\" sammy, and am very pleased with it, so my heart was already with the Samsung. Then I saw a 52\" Samsung 850 at a local electronics store and OMG, man what a beautiful picture. I went back 3 nights in a row before I took my wife to show her. But this store only had an V series Sony to compare with, not a W or an X series. At the time, I didn't know there was very little between the the V and W series (very little) and they had neither the newest Sony or Samsung. Knowing I wanted to by a larger HDTV, I drove 150 miles to another city where I could view the TV I wanted side by side. I wasn't disappointed. The store we chose had all of the brands sectioned by TV size. Each size playing their own movie, a great concept in my opinion. We looked at all of the 52\" TV's and I thought, yes the new sammy is slimmer than the Sony, but is that worth the higher price? Yes the sammy has a very slight edge in picture quality, but I have a skylight in my family room and it would have a higher glare in bright light, is that worth the higher price? I read the reviews, I went to another store in a different city and viewed Sony V, W and Samsung 850 side by side, I worked both remotes and I definately felt the Sony was the best value. As viewed in the showroom, I really wanted the 850 Samsung, but in my opinion, it wasn't $500 dollars higher picture or function quality. I chose the Sony W series. The remote was easier to use and I knew I would be very happy with it once it was in my family room. I have had it for a month now and I am VERY please with the picture quality of my Sony and even more pleased with the ease of the remote. Did I mention I am already an owner of a 32\" Samsung? Do the remotes have the same options?..... basically yes but the ease of use goes to the Sony. In my opinion the Samsung 850 was not worth $500 more than the W series Sony, a little bit more...($100)...maybe, but in these hard economic times, not that much more bang for the buck. If you buy the Sony W series, you will not be disappointed. It has an awesome picture and you would only notice a slight difference if it were right next to an 850 Samsung. You will be very happy once this TV is in your TV viewing room.", "Date": "January 10, 2009"}, {"Title": "The Best of the Best!", "Author": "Gerald M. Lawton \"bmrshoe\"", "ReviewID": "R1C66YTZJBDP04", "Overall": "5.0", "Content": "Did a lot of research. Narrowed choice to Sony W4100, Samsung LCD A650 and Panasonic PZ800 Plasma. Saw all 3 at Best Buy and that clinched it!  Picture was great on all 3, but not bright enough on Panasonic.  Reviews on Samsung had a lot of negatives so opted for Sony.  Couldn't be happier.  White glove delivery was great!  Picture is superb, even SD (Comcast cable), HD absolutely awesome!  Replaced a 52\"  JVC lycos, which was great, but this is way better, plus no bulb to replace every year..  Setup was easy (white glove did this),  Only downside on purchase, Amazon lowered price $200. since purchase, but that's okay.  I've had a month to enjoy!  Buy it, you won't be sorry!", "Date": "December 22, 2008"}, {"Title": "Sony Bravia", "Author": "Robert Mason", "ReviewID": "R239O5HMU9G29", "Overall": "5.0", "Content": "Excellent and speedy delivery. Ordered it on Saturday and it was delivered and set up on Wednesday (4 days). Very easy to set up. Very intuitive controls, instructions and features. Excellent speakers. Excellent picture. We do not have cable; the TV is hooked up to our old $19.99 set of rabbit ear antennas. We get all the free broadcast HDTV programming without any difficulty and with excellent reception. Very easy to connect laptop to set. DVD and VCR hook-ups also very easy.", "Date": "September 4, 2008"}, {"Title": "Warehouse deal worth it", "Author": "Winnie T", "ReviewID": "R1W6SSFU8W76A2", "Overall": "5.0", "Content": "I got this Sony 52 inch LCD (W series) from Amazon Warehouse Deals, it was listed as an open box. The price was a STEAL, ($1700) and it was in PERFECT condition. The picture is incredible. EVERYONE that sees the picture on this TV is absolutely blown away. It looks great on the wall. I am 100% delighted with this product, thank God I did my research. I have an HD cable box, Denon AV Receiver with Mirage sattelite surround sound and a bluray player. My receiver is not HDMI, so I'm using optical audio from cable box and bluray - the sound is awesome. My TV watching is limited to sports (football and golf look spectacular), PBS (HD is stunning), and an occasional on-demand HD movie. I'm going to invest in the Planet Earth (BBC video) series, I hope it comes in bluray.-You won't go wrong with this TV - it's a lower price point than the XBR series, and I'm not aware of missing any features or picture quality. If I could justify the cost of an XBR, I would have done it, but with such a great price on an open-box W series, I couldn't resist.", "Date": "February 16, 2009"}, {"Title": "Sony KDL52W4100 lives up to expectation", "Author": "Kenneth M. King \"kansasbeachbum\"", "ReviewID": "RKX5VHE92O65O", "Overall": "5.0", "Content": "Like countless other HD TV buyers, I did a lot of research before pulling the trigger on my new Sony 52W4100.  It was time to finally quit entering prices in my spreadsheet and dive into the HD world.  Our existing Sony 32in XBR was still awesome but after watching our new Sony HD I can't believe I waited so long.  We are thrilled with our purchase.  Setup was easy and the picture is crystal clear.  The HD channels are scary clear.  Colors are bright.  Samsung was an option but I went with Sony because of our past experiences with Sony.  We purchased the Sony Bluray S550 at the same time.  My DVD's look better than ever.  I have watched and rewatched Pirates of the Caribbean and Lord of the Rings.  WOW!", "Date": "February 7, 2009"}, {"Title": "As promised...", "Author": "E. Au", "ReviewID": "R2W9PHZLQ08XNB", "Overall": "5.0", "Content": "Got a great deal via Amazon.com...You really have to make sure that the incomming signal is in fact full HD, as lower quality signals will look worse with the higher resolution.  So generally, the Blu-ray has worked well, but some of the less-than-HD quality feed (even although on an HD broadcast) such as pre-recorded sports highlights not in HD, don't look great, and actually look better on my EDTV Smasung Plasma (actually, the full HDTV feed looks pretty good on the  480p set).  I got pretty caught up in the whole 120Hz HDTV...not sure if there is much of a difference...at least the hundreds in price difference...but like I said, got a pretty good deal at just over $1800.Ed", "Date": "January 20, 2009"}, {"Title": "SONY 52-inch HD-Bravia", "Author": "Patricia Ranney", "ReviewID": "R6O7LVWC40QEI", "Overall": "5.0", "Content": "Here's a truly non-technical review from a person who just uses a TV for a TV. . . !I purchased a Sony Bravia W-Series KDL-52W4100 52-Inch 1080 p 120 Hz LCD HDTV on 12/01/2008. I was originally set to buy the Samsung 650, primarily because of the bells and whistles and Consumer Reports' review. However, there seemed to be a lot of on-line comments regarding glare, and that kept me from rushing to hit the \"Buy\" button. And like everyone else, the size of the purchase in an on-line transaction was making me nervous.A few people at Amazon had lucked out buying from Amazon's Warehouse, and I had been checking that site every now and then. Then. . . there it was. . . the 52-inch Bravia -- the only thing \"wrong\" was a damaged box. Other reviewers had made Warehouse purchases with slight damage to the product, and that damage was generally nothing more than where sticker glue remained! So, now I had the opportunity to buy a \"mint\" Sony TV, which had better sound than the Samsung (the poor sound was a common complaint that was mentioned among Samsung purchasers). I had owned a couple of Sony sets in the past, and they had given me years of good service, so I knew that Sony had a solid track record -- something that couldn't be said about Samsung. Personally, I hadn't always found Consumer Reports' reviews to hold up (I'm the only person I know who bought a Honda Accord that turned out to be a lemon). True, there weren't some of the bells and whistles that the Samsung had, but I got to thinking about how many times I've fallen hook, line, and sinker for the bells and whistles on other products (think \"computer\"), and then I never used them. If I bought through the Warehouse, I'd end up paying about $600 less than for the Samsung that I wanted and about $300 less for this Sony than if I bought it directly through Amazon.com. Hey, what the heck! I bought it!Delivery took a little over a week. I didn't realize it, but even with the Warehouse, the delivery was \"white glove,\" so the set was carried into the house, pulled out of the box, and plugged into to ensure that it worked. I've yet to find the \"damage\" on the box! Everything was perfect!I've had the set for about a month now, and I'm VERY happy that I made the purchase. Other reviewers have commented that the colors aren't as bright on the Sony as on the Samsung. Honestly, if they were any brighter, they'd blind me. The picture is fantastic. I finally traded in my regular Time-Warner cable box for one that allowed me to hook up the HDMI cable that I also bought through one of Amazon's retailers (I think I paid about $6; I got the cable with the gold), and I can tell you that as far as the reception goes in the Saratoga, NY, region, that cable is an absolute necessity for SD. Without the cable, the SD reception is somewhat fuzzy, and reading anything on the screen is difficult. With the HDMI cable, the SD reception is nearly as good as HD. When you change boxes, you need to set up the TV again, though. Another advantage to the HDMI cable -- you can get rid of all those other cables, although the person at Time-Warner told me that I would still need them. It takes some time for the cable box to start working with the TV, so you might think differently, but believe me, within 15 minutes, everything starts to work.Although the menu set-up for other features is not as obvious as it could be, after a couple of tries, you can figure it out, so that's not a big deal. And, after all, how many times do you really need to change your settings? The menu needs to be controlled from the Sony remote, but controlling the regular functions (e.g., volume, channel-changing) can work with your cable's remote. I really like the fact that I can change the sound to adjust it so that voices are clearer. Sometimes movie-sound is very muffled, and it's hard to hear what's being said; this has made it much more pleasurable to watch movies, as I can hear a lot of those things where I used to say, \"What did he say?\"I don't have a sound system, DVD player, games, or anything else hooked up to this TV, so I can't comment on how those items work with it. We're hooked up to dozens of movie channels, so we're content to use it as a television. I'm re-watching nature shows (e.g., Planet Earth) and other movies I've seen, and it's a whole new experience. I love old B&W; movies, and they are an absolute delight to watch. Everything looks like it is in high def. One need not be into high-tech gadgets and color to thoroughly enjoy what this set brings all on its own.I very highly recommend this TV -- and suggest that you keep an eye on the Warehouse if you're not in a rush. Hey, you never know!It has been FOUR -- yes, FOUR -- years since I bought this set, and I still love it. Nothing has gone wrong, the picture is still perfect, and I still endorse Sony full-heartedly. Prices have gone WAAAAY down since I bought this TV, so it's probably a steal now.Because technology has advanced from where it was when I bought this set, if I were going to buy another large Sony TV, I would look for one that has apps installed on it so that you don't have to go through several steps to access something like Netflix or Amazon. Beyond that, though, I would buy this set again.", "Date": "January 16, 2009"}, {"Title": "So far, so very good", "Author": "pro foto", "ReviewID": "RHWJB6J6VC137", "Overall": "5.0", "Content": "I was apprehensive about ordering such a large ticket item from Amazon (or any online company)but this has proven to be a very smooth and money-saving transaction.  I ordered this tv (along with a blu ray player in a promotional deal) on Christmas night from Amazon.  The shipping date I received was to be December 30 with an expected delivery of January 6.  I received the Blu Ray on the 28th and the tv today about 4:00 PM, much sooner than expected.The Amazon site when I placed the order didn't show White Glove delivery but the shipper's site did.  The one delivery guy and I moved the TV off the truck, carried it across my yard and brought it into my living room; together we hooked it up - one HDMI cable from the cable box so that part was not too tough!  It would have been, however, very difficult for one person (either the delivery guy or me) to have moved this tv into my house alone.It would be handy if Amazon's site had showed a rear view of the set. I didn't think about this issue until almost the last minute; the tv's input and output panel are on the left side of the tv as you look at it from the front - the \"s\" side if you're looking at \"Sony\".  If your cable box, etc are on the right side of the TV, as mine are, you may need a longer HDMI cable than you originally thought.  (The inexpensive 6 footer I ordered through Amazon, which works great by the way, barely reaches.)  I have ordered two of the ten footers to eliminate worries when I hook up the Blu Ray and other components.The tv looks good in my living room (and will be much nicer when I get it mounted next week) and has been a pleasure to watch this afternoon and evening.  The matte screen is great.  Virtually no reflections and I have a bright living room. I have read other reviewers who have commented that this tv's screen is not as bright as the Samsung's - I found this to be true when comparing them side by side in Best Buy; however in my living room this tv is plenty bright without the reflection issue.  The instruction booklet is thorough to say the least.", "Date": "December 31, 2008"}, {"Title": "great tv", "Author": "janet", "ReviewID": "R1J9BH723H5H4D", "Overall": "5.0", "Content": "We spent a lot of time researching televisions before buying. (The reviews on Amazon were very helpful)  The tv is great! We have a very bright room and there is absolutely no glare. The 120 Hz makes a big difference when watching football or hockey. The set up was easy.  The delivery person was less than helpful, but we are really glad we bought this model.", "Date": "December 12, 2008"}, {"Title": "Sony Bravia W-Series KDL-52W4100 Review", "Author": "M. Schmidt", "ReviewID": "R2R23295AYRXXM", "Overall": "5.0", "Content": "Order new via Amazon.  Excellent delivery service.  Debated between this Sony model and Samsung LN650, but debate ended after seeing excessive glare on Samsung screen.  Picture is superb, could not be happier.", "Date": "November 16, 2008"}, {"Title": "LOVE THIS TV", "Author": "PAN", "ReviewID": "RUPO753V22O7O", "Overall": "5.0", "Content": "I LOVE THIS TV.  I AM NOT A VIDEOPHILE, JUST YOUR AVERAGE JOE.  I MUST SAY FOR THE PRICE THIS THING IS INCREDIBLE.  WORKED GREAT RIGHT OUT OF THE BOX AND THE PRICE I GOT WAS UNBEATABLE.  SHIPPED FOR FREE, ORDERED WEDNESDAY AND HAD IT THE NEXT MONDAY.  EVERYTHING ABOUT THIS WHOLE DEAL IS POSITIVE AND I WOULD ORDER ANOTHER TODAY IF I NEEDED IT OR HAD THE MONEY!", "Date": "November 12, 2008"}, {"Title": "Avoid this unit at all costs!", "Author": "Dean", "ReviewID": "R3CN5LLXMRY7HH", "Overall": "1.0", "Content": "LCD 52\" screen has \"crapped the bed\" after just two years of use. After contacting Sony customer support... I was informed that my 1 year warranty would NOT cover this issue. They in turn wanted me to spend an additional $600 to purchase a refurbished unit as a replacement. Currently, there is a known problem with the Bravia 40\" tv's and maybe it doesn't end there. You must be nuts to do business with a company that won't stand behind their craftsmanship.", "Date": "November 19, 2011"}, {"Title": "Another victim of the vertical line problem on the Sony  KDL-52W4100", "Author": "Mike W \"mike34734\"", "ReviewID": "R267TMBFV821DG", "Overall": "1.0", "Content": "My Sony BRAVIA W-Series KDL-52W4100 started developing the vertical line problem just over the one year warranty period.  We have been living with it since the line was fairly faint.  Not the line is getting more visible and is very annoying to watch.  I used to be a fan of Sony but no longer.  I have 3 older Samsung flat panels, 2 LCD and 1 Plasma and they are all still providing excellent video.  This \"upgrade\" turned out to be a big mistake.In the days before plasma and Lcd, I only owned Sony TV's and they had great pictures and long life.  That is no longer the case.  This panel failure is a well documented and known defect that Sony seems to be ignoring.  Way too many people are having the same problem, especially with this model.  It should have been recalled.I will be shopping other brands soon to replace this disgrace on my wall.", "Date": "October 25, 2011"}, {"Title": "Buyer beware if considering a Sony TV", "Author": "Joe E. Fleegel", "ReviewID": "R2ZD38T7KPZI0D", "Overall": "1.0", "Content": "This is just a fair warning to those considering any Sony TV.  I dished out $3,000 for a Sony Bravia KDL52XBR4 3 1/2 years ago.  In the last few months the TV has developed ghosting images, double images, and vertical lines throughout the screen.  An authorized Sony repairman said I have a bad LCD panel, as did the independent tech that Sony sent out.  Both commented that it is a common problem with Sony TV's.  Cost to replace the LCD panel was quoted to me at over $2,400, so Sony's solution was to offer to sell me another Sony at a price only $170 less than I could buy on my own.  I am not throwing away good money after bad by rewarding Sony's terrible quality with another Sony purchase.  Go to \"I have a defective Sony TV\" on facebook.  It is monitored with a heavy hand by Sony, but it will just give you an idea of the thousands and thousands of defective TV's that Sony has produced.  I'm just saying..", "Date": "October 18, 2011"}, {"Title": "Bad Panel after owning 27 months.", "Author": "Rudy Lawrence Mamula", "ReviewID": "R1JF0WRG5SZNQ2", "Overall": "1.0", "Content": "The panel on our unit quit working after 27 months of use.  I've been reading this is common for this TV.  Unsure what the deal is.  TV worked fine and then all of the sudden vertical lines appeared on the screen and the general color keeps fading in/out.  We have an extended warranty and were told that it will cost $2400 just for the part to fix the bad panel.  At this point, the warranty company hasn't made a decision as to how to proceed with the problem.We own quite a few Sony products in our home.  My husband did a great deal of homework before purchasing the set.  I'm highly disappointed in its longevity...and the fact that others seem to be experiencing the same 'bad panel' issues out of Sony's manufacturer warranty timeframe.", "Date": "June 3, 2011"}, {"Title": "Disappointed in the Sony Bravia W series KDL-52W4100 52 inch 1080 120Hz LCD HDTV", "Author": "Happy, in VA.", "ReviewID": "R3CEIQVFBF5SRW", "Overall": "1.0", "Content": "THIS WAS AN EXPENSIVE TV AND WE EXPECTED IT TO LAST A FEW YEARS.  LESS THAN 18 MOS FROM TIME IT WAS INSTALLED GOT WHITE HORIZONAL LINES WHICH ARE IN THE MIDDLE OF THE SCREEN, VERY ANNOYING.  OF COURSE 1 YR WARRANTY AND THEN YOU'RE ON YOUR OWN.  DON'T EVEN CONSIDER THIS TV IF YOU'RE LOOKING TO BUY, WE WERE VERY CAREFUL, NEVER MOVED THE TV AFTER INSTALLATION, NO GAMES WERE PLAYED ON IT, AND TAKEN VERY GOOD CARE OF IT.  SO DISGUSTED WITH THIS PRODUCT, $2000.00 TV SHOULD LAST LONGER THAN 18 MOS.", "Date": "August 29, 2010"}, {"Title": "everything was good for the past 18 months but the panel went bad last week", "Author": "Jenny \"SonyBuyer\"", "ReviewID": "R35VQZDY3A9A7C", "Overall": "1.0", "Content": "maybe a bad luck. my 52w4100 went down last week after i purchsed it 18 months ago.the panel went bad. verical lines were all across the screen. the color faded...I am looking for a new TV to replace it. just felt I can't trust SONY anymore...", "Date": "August 10, 2010"}, {"Title": "Screen went black after 18 months", "Author": "1st time installer", "ReviewID": "R31NZZKKKJCEGM", "Overall": "1.0", "Content": "I purchased my 52 inch Sony Bravia on January 18, 2009.  Until three days ago I loved it.  Anyone who came in my house would comment on a clarity of the image.  Delivery of the set by Amazon was flawless.  Three days ago we were watching the TV and the screen went black.  No prior warnings, it just went black.  The only reason we knew it was not off, was a small blinking red light on the bottom right corner.  A phone call to Sony only told us \"it's an LCD panel error\" and we needed to have a certified Sony repair service come to the house.  Well, the repair man just left (a $95 house call).  The estimate to replace the T-CON part is $537.  This is very disappointing after spending over $1800 on this set only 18 months ago.  My advice is to choose another brand, or invest in the extended warrenty.", "Date": "August 4, 2010"}, {"Title": "Stay AWAY !!!! Panel went after 18 months $2700 just for the part!", "Author": "Bryan K. Jones", "ReviewID": "R1KWCW2KB2ENH4", "Overall": "1.0", "Content": "Bought this tv and after 18 months the panel is going bad. Sony wants $2700.00 just for the part not including the labor. That is more that the TV cost and I could afford to buy 2 tv's for same cost as the panel. Stay away from this tv!!! Sony support will only offer a small dsicount which is still higher than the cost of a new tv.... Stay AWAY!!! If you are smart you will buy another tv and not this one. Sony support will be no help at all...", "Date": "April 30, 2010"}, {"Title": "Problem with TV", "Author": "A. Zhu", "ReviewID": "R3KF0EY8P3X3HL", "Overall": "2.0", "Content": "I bought this TV last summer.  It performed so well that I bought another one 6 months later.  Now some black lines started to develop on the screen of the first one.  The factory warranty already expired, and replacing the panel is so expensive.  Very disappointed.  Just hope the second one will fare better.", "Date": "November 18, 2009"}, {"Title": "Surreal", "Author": "Nancy Yeh", "ReviewID": "RW3BALB9AK5XR", "Overall": "5.0", "Content": "Picture quality is like whoa.This tv will spoil you... once you watch movies/tv with this, you'll think other tvs have poor quality.I watched blu-ray dvds on this.... and it's a little bit toooo clear. It made the movie look fake almost because it felt like I was on the actual movie set. You have to adjust the picture to Cinema lighting or else it's too real.", "Date": "March 14, 2009"}, {"Title": "work of art", "Author": "J. Radmer", "ReviewID": "RKF5WLHGH86MY", "Overall": "5.0", "Content": "this tv is a work of art.  when you get a show in high def you might as well be there instead of watching the show.  The set up was great.  It took us longer to agree on a tv stand then it did the TV.  The only negative is the sound.  We've gone from a projection tv to this Sony and my husband does not like the sound on the Sony.  We've hooked it up to our stereo receiver and speakers and now everything is great.", "Date": "March 14, 2009"}, {"Title": "Magificent!", "Author": "B. Peck \"Cook book reader\"", "ReviewID": "R3VXGC0FTX4H5Q", "Overall": "5.0", "Content": "Our Sony Bravia is all that we had hoped for and more. Amazon's delivery was all that was promised and 4 days early. I did a lot of reseach before making my selection which is always a good thing but nowhere did I find words describing the joy of coming around the corner, seeing the Bravia picture and repeatedly being overwhelmed. Go for it!", "Date": "March 7, 2009"}, {"Title": "Awesome TV Awesome Service", "Author": "Valeria B. Campbell", "ReviewID": "R3V76D1W358JK2", "Overall": "5.0", "Content": "I could not have ask for a better TV. The screen both on and off is simply awesome. The delivery sevice was as impecable as the TV", "Date": "March 7, 2009"}, {"Title": "Excellent value", "Author": "Northwest Guy", "ReviewID": "R24BSI97C6TQ36", "Overall": "5.0", "Content": "This is a great value.  I think the picture is every bit as good as the more expensive XBR model.  Ordering was easy, the item shipped promptly and arrived on the day I was told. Set up was very easy and was connected to my Sony STR D-920 receiver that  I also purchased.", "Date": "March 4, 2009"}, {"Title": "Excellent TV", "Author": "Thomas Truong \"TNT007\"", "ReviewID": "R2MGFV74LK1KAW", "Overall": "4.0", "Content": "I got similar one (46\") for my uncle during last Xmas at Costco for a great deal.  After hooking it up for him, I was so impressed by it.  I decided that I have to get one for myself too, except it is a 52\". You can't go wrong with either one.  Sony or Samsung 650 or above are the best.", "Date": "March 3, 2009"}, {"Title": "The best value in a great Sony set (but if you didn't get it at your price, you may be luckier than your realize)", "Author": "Samuel Chell", "ReviewID": "R16V7QJT6TG0SF", "Overall": "5.0", "Content": "Sony was determined to dent into upstart Samsung's market lead even before the most recent price reductions.  The V and W Series for 2007 (designated as 3000 models to distinguish them from the 2008 models, listed as 4100) replaced their 10-bit processors and color panels with a more common 8-bit configuration.  The change represented a cost savings to Sony, which in turn was passed on to the consumer, who previously had practically been \"conditioned\" to expect to pay premium prices on all Sony models.  But the consequence was also \"aesthetic\": the new processors are capable of representing 256 color hues compared to the 1024 gradations of the previous V and W models.The difference is perhaps not as great as the statistics would make it seem.  The Sony W Series presents a sharp, stable, vivid and dramatic picture (including the \"deep blacks\" that Samsung once made such an issue of) that's capable of not only holding its own but standing out from the crowd.  It's only after studying a current V or W model for an extended period of time and alongside a current Z model that you become conscious of greater complexity, richness, and \"lifelikeness\" in the 10-bit color picture of the Z model (indeed the W picture may even seem a bit more dramatic and vivid than the Z picture, but there is undeniably some noticeable \"banding\" marking the edges of various color shades and hues).Bottom line: unless you're a serious photographer planning on using your flat-screen TV with your hobby or a cinematic connoisseur determined to get the most from a blu-ray player (presently the only sure way to enjoy a full 1080p rather than 1080i picture), this Bravia W is currently the best all-around value in larger-sized HDTV sets on Amazon.  But if you wish to experience state-of-the-art color reproduction, it will be necessary to look at a Z-series or the pricey XBR line of Sony sets.  Or, you might check Amazon's Warehouse Deals store for a 2007 model in the V or W series (designated 3000), but sacrificing such niceties as a 120Hz refresh rate.My old Sylvania 27\" CRT set lasted me almost 30 years.  Unless you plan to switch sets every other year, be willing to pay a couple hundred more for a set you'll have no 2nd thoughts about.  (Personally, I'd go for the 46\" Z set or, if money is tight, the 40\"V3000 for around $800!  The 120 Hz (and next year 240) refresh rates add even more artifice to the film-viewing experience, at times making you feel like you're watching an action event on quaaludes.)", "Date": "March 3, 2009"}, {"Title": "STOP WAIVERING AND JUST GET IT. IT'S WORTH IT.", "Author": "Phillip Dell \"SPIRE78\"", "ReviewID": "R3OQ86YAWERY3X", "Overall": "5.0", "Content": "AFTER WEEKS OF GOING BACK AND FORTH BETWEEN THIS AND THE SAMSUNG 120hz I FINALLY CHOSE THE SONY FOR THREE REASONS. ONE, IT'S A SONY. TWO, NO GLARE FROM THE SCREEN LIKE THE SAMSUNG. THREE, IT'S A SONY. THE PICTURE IS AMAZING, THE MENU IS EASY TO USE, AND OVERALL IT'S A GREAT SYSTEM FOR THE RELATIVELY LOW PRICE FOR A 120hz. BY THE WAY, HERE'S ANOTHER TIP. SAVE THE MONEY ON THE MONSTER HDMI CABLES, GET THE CHEAPER MEDIA BRIDGE (UP TO DATE 3b WHICH WORK EVERY BIT AS WELL) HDMI CABLES AND GET A MONSTER POWER CENTER HTS1000 FOR AROUND A HUNDRED BUCKS. YOU WILL NOT BE DISAPOINTED.", "Date": "February 22, 2009"}, {"Title": "Just got this Tv 2-13-09", "Author": "C. R. Capps \"Cubs\"", "ReviewID": "R39D07ATWDHYOZ", "Overall": "5.0", "Content": "I was looking for a 52\" TV to complete a loft in my house. I did the usual go to Best Buy, check out the going out of business sale at Circut city. I found that I really liked the 52\" Bravia 120hz tv. However, i didnt want to spend $2,500  plus tax on it. While at Circut City a gemtelmen told me to get the model number of a tv I liked and check out Amazon. I put the model number in and got the tv for $1,869. Majer M&J; inc is who I bought it from. I revieved a confirmation e-mail including a tracking number. I ordered the tv on a Sunday morning and got it Friday afternoon. Make sure you give them a phone number since the driver calls you when he is near your address and needs you to sign for the tv. The TV is awsome. Hung it yesterday and it has an amazing picture. I already have a 60\" Sony DLP and I thought its picture was really good, and it is, but this tv is much crisper and a treat to watch. I dont know if I would pay $2,500 plus tax for it, but at the price on Amazon, its a good buy. I was a little nervous to buy a tv on-line, but it went smooth and was a great experience. Another side note. I go the Cheetah universal mounting bracket for $30.00. Worked awsome. Stores want $250.00 for the things!!! Dont do it!", "Date": "February 14, 2009"}, {"Title": "Perfect for superbowl", "Author": "Robbinedin \"ss\"", "ReviewID": "R1T0YBZL6SGJZ9", "Overall": "5.0", "Content": "Got this before 2 days from amazon. My first HD tv and love it. I am not in position to comment on any technical stuff. Choose over samsung bcoz of glare .i have a very lighted room and sony looks great in daylight too. Used setting mentioned in one of the review and looks great. sound is great like everything else.what else can i say love it.I bought TV for 1846 on feb 2nd09 and yday 3/3/09 price was 1431. called csr but nothing.no pm policy. $400 drop in a month is crazy. I guess they fix their policy and act or will lose lot of customers.", "Date": "January 30, 2009"}, {"Title": "The picture is big and clear", "Author": "PT Cruiser", "ReviewID": "R3JTPZXG1MO8W8", "Overall": "5.0", "Content": "We bought this TV this summer, about 6 months after buying a Sony Bravia V-Series KDL-40V3000 40-Inch 1080p LCD HDTV for the living room.  We were going to wait for the 15 year old rear projection set in the family room to have a problem before replacing it, but after watching the other HDTV and especially after watching movies on the other one, we just couldn't wait.  The HD is so much clearer and after having the big rear projection set, it was nice to have the smaller footprint.We're were very happy with the first Sony and when we looked at other brands, side by side, to us there seemed to be a difference.  The colors looked more natural and the picture clearer.  We noticed on some of the other brands that the colors were bright, but not quite real looking.  Now, that could have been the way they had them adjusted in the store, but the Sony just looked better, even at several other stores.Set up was simple.  We connected it to a Blu-ray player Sony BDP-S350 1080p Blu-ray Disc Player and have a Wii  connected to it with Wii HD Link Component Cable.  Everything hooks up easily and there's a separate panel on the side to connect things like a computer or video camera.  The Blu-ray works seamlessly with it.Two thumbs up for this TV!", "Date": "January 24, 2009"}, {"Title": "bright picture", "Author": "alchemyiam", "ReviewID": "R1WT4VVO28PPMG", "Overall": "5.0", "Content": "We have had the Sony now for approx 3 weeks and so far so good. We had been using our sons LCD system, but he needed it back and unfortunately it was difficult to go back to our old non HD system after being spoiled...After going thru all the reviews we narrowed down to the Samsung 650 and the Sony 4100. reasons for this was overall good reviews and reliability data.I eliminated the plama screens because they do seem duller than the LCD displays. I did the comparisons at C OSTCO, but unfortunately they did not stock the Samsungs or a 52\" Vizio. The Toshibas also looked pretty good, but weren't 120HZ.Of all the LCD Tv's the Sony overall seemed to have a brighter picture, has 120Hz, 2 year warranty (C ostco), reasonably priced at 1799 at C ostco and also was concerned about shippment of such a big and somewhat delicate item.Not sure if 120Hz is really worth it, but want something that will last esp. as we get Blue ray.Whats interesting is that I thought I had some bad pixels at first, but eventually discovered that some of the TV camera shows have flaws that can be noticed...", "Date": "January 19, 2009"}, {"Title": "Great: Price/Performance/Delivery", "Author": "Dennis Bowcut \"dbowcut\"", "ReviewID": "R3J8KBJOO4TOMV", "Overall": "5.0", "Content": "After going nuts for months analyzing HD TV specs and comparing 52\" sets in stores I bought a Philips 120hz model at Costo who do have a 90 day return policy as I was leery of buying something this big and fragile on-line with cross-country shipping.Long story short, the Philips had a few issues, it was returned, and I \"bit the bullet\" and went with Amazon for the W4100.  My considerations went by the way because the TV arrived in six days, was unboxed and put on a stand by the bare handed White Glove guys, and the set has run as advertised.The sets I compared were the Samsung 650, the Philips, and the Sony 4100. 120hz was important consideration for sports and action movies, and I didn't want to spend over two grand.  The Samsung's screen is nearly as reflective as most plasma sets, a deal breaker for my very bright room.  The Philips was best for that but for its power-cycling, re-sizing, and sound issues.Watch for Amazon deals on this TV.  For the price of the warehouse store Philips, I got a TV that has more features, a marginally better picture (although a bit more reflective), and a Sony Blu-ray S350 and four movies thrown in!  And this doesn't cover the included delivery and set-up.Sony Bravia W-Series KDL-52W4100 52-Inch 1080p 120Hz LCD HDTV", "Date": "November 25, 2008"}, {"Title": "Love this TV, Sony does Amazon price matching", "Author": "Raj", "ReviewID": "R33SUCZLFUC235", "Overall": "5.0", "Content": "We just bought this TV from the Sony Style retail store directly rather than through Amazon for a few reasons.  The Sony store was willing to match the Amazon price, which seems to continuously fluctuate from day to day.  The normal price at the Sony store was $2,999 and the Amazon price when we saw it was $2,300.  That's a big difference.  Sony did not charge me for shipping either.  And a cursory review of their warranty seems better than what I can get from Amazon.It's a great TV, we just didn't want to pay the regular price.", "Date": "July 15, 2008"}, {"Title": "Very Good TV", "Author": "Reader \"reader\"", "ReviewID": "R31HW1OTYTC44E", "Overall": "5.0", "Content": "I had banged my head for a decision between Sony kdl52w4100 and Samsung ln52a650 but ultimately I went for Sony. No regrets at all. Honestly, I am enjoying this Sony TV a lot!!!", "Date": "February 9, 2009"}, {"Title": "....just outstanding!!", "Author": "K. Lonidier", "ReviewID": "RGK7C8DFUXO7P", "Overall": "5.0", "Content": "First LCD tv we own.  The Amazon delivery was extremely fast - delivered in 2 days. The picture is outstanding. The TV and everything about it is suberb.  No complaints whatsoever.  I waited a month to review in case I could find something wrong. I cannot say enough nice things about it.  The price paid here on Amazon was $700 less then BB.  Shipping free. No tax.  What more could you want?  I would not hesitate to recommend this TV or Amazon for the purchase.", "Date": "November 11, 2008"}, {"Title": "Great Product, Great Service", "Author": "Stanley T. Myles \"techsan68\"", "ReviewID": "R21JHQWJLG803O", "Overall": "5.0", "Content": "I must admit I was nervous ordering a high-ticket item like this HDTV on the Internet, but the price Amazon offered was too good to pass up. I was pleasantly surprised! The TV was delivered on time, and the White Glove set-up was smooth and painless. So far, the TV has performed great. I saved a lot of money and got great service. What more could I ask for?", "Date": "October 22, 2008"}, {"Title": "Sony HD is the BEST.", "Author": "Mel \"Shutter Bug\"", "ReviewID": "R18O1TDGLAODD2", "Overall": "5.0", "Content": "[...]All my old movies look like High Def. The picture from the Satelite is amazing and Sony is the clearest best picture I have seen in HD. The non HD channels are OK but not great.  I think it is because the HD channels are so flawless the regular stations can't compair.I think the people having trouble are not using good HDMI cables.  You don't need the best cables but use good cables.", "Date": "September 26, 2008"}, {"Title": "This TV should be recalled", "Author": "DD", "ReviewID": "R28NFWSR4VI7JX", "Overall": "1.0", "Content": "Bought mine in 2009. Not even 5 years old yet. Just developed lots of judder during any motion sequence. Almost unwatchable. Contacted Sony hoping they would ship me a new TCON board. Nope. Do a search online for this TV and all you see are TCON issues widespread. My house is full of Sony products. Never again. Purchased SONY headphones for my daughter for Xmas. Just returned them yesterday. I can't believe they will lose a long time customer (20 years +) for a $200 board. F them.", "Date": "December 18, 2013"}, {"Title": "Needs New LCD Panel", "Author": "Ray R Rardin", "ReviewID": "RO6J9FFATX2Z9", "Overall": "3.0", "Content": "Bought the KDL-52W4100 120Hz LCD HDTV for the Super Bowl in 2009 for $2000.00.  Over the last few months the picture quality has eventually eroded to a point where it is unwatchable.  Had a technician look at it and was informed that the LCD panel needed to be replaced.  Well, the cost to replace is more than a new LCD HDTV 240Hz would cost.  I gave the product 3 stars because: (i) over the last 4.5 years when the HDTV was working it was easily a 5 star product (picture quality was excellent), (ii) having an HDTV that was purchased for $2000.00 only last 4.5 years is easily a 1 star product.  Hope this helps in your HDTV purchase.", "Date": "October 8, 2013"}, {"Title": "State of the art whenIi bought it", "Author": "Boston traveller", "ReviewID": "R2HZCTCCVDJU5L", "Overall": "5.0", "Content": "I expect there are better performing, lower cost flat screens out there now, but when i bought it, this was state-of-the-art.  i expect to be enjoying its great picture for many more years.", "Date": "May 23, 2013"}, {"Title": "Still working great!", "Author": "P. Carras \"Peter\"", "ReviewID": "R3V3OVCWU78KDK", "Overall": "5.0", "Content": "Purchased this Flat Screen a few years ago and happy to say it works great. We added a surround sound with it so I don't know about the speakers on the TV. Would recommend it to anyone. Thanks", "Date": "March 26, 2013"}, {"Title": "Needs new panel", "Author": "Portlander", "ReviewID": "R31I108LNULY7Z", "Overall": "1.0", "Content": "After less than 5 years of owning this TV the lcd panel went out. Sony will only cover it under warranty for 3 years. for $2,000 brand new back then I wish it would have lasted for longer then 4.5 years.", "Date": "March 8, 2013"}, {"Title": "The Best Picture!", "Author": "J.DEL", "ReviewID": "R2MPK9J3M9W4DU", "Overall": "5.0", "Content": "The \"W\" series is the best picture quality of all the Sony series, hands down! Blu-ray movies look insanely realistic. Standerd dvd movies look super crystal clear with a blu-ray player. Plus, I have (20 channel) basic cable and with built in digital channel serch, I pick up all the digital music channels and over 20 HD channels without a cable box!You will not be disapointed with this tv!", "Date": "April 4, 2011"}, {"Title": "Great TV", "Author": "I tell it like it is", "ReviewID": "R3HAY0GVSOAP11", "Overall": "5.0", "Content": "Have had this television for almost two years.  Have had nothing but compliments on this TV.  Have it paired with a Bose 5.0 surround sound, HD Satellite, and a PS3 for Blu-Ray.  I am not an expert by any means in the audio visual field, but I am very pleased with this television.  Liked it so much, bought the 40\" model for the bedroom.", "Date": "January 22, 2011"}, {"Title": "Horizontal ghost lines on screen after 22 months, no help from Sony........", "Author": "caw", "ReviewID": "R2I0NTP97YZ2WV", "Overall": "2.0", "Content": "On 02/14/2009, we purchased a Sony Bravia Kdl-52W4100 from Sony through Amazon. When we received the TV, we were quite happy with the performance and picture quality. Approximately 22 months later my husband noticed two horizontal ghost lines approximately 6 inches from the top of the TV. These ghost lines were also located on the right side of the TV. The lines in the center of the screen are 6 inches long and 3/4 inch wide. The right side lines are 3 inches long and same width as in the center. Sony support was contacted and as with all reviews, we were sent from one customer service/tech to another. All customer service/tech reps were not located in this country and were quite hard to understand. Since Sony is recognized as a reputable company and has great TV reviews we did not purchase an extended warranty. This was a huge mistake to not purchase the extended warranty. Sony personnel advised that there was nothing that could be done, other than contact a local Sony certified service provider. I do not have faith in the TV service providers in this area, therefore, my husband opted to look up these issues on-line. After reading several Sony complaint/repair forums my husband has ordered a T-CON board from ShopJimmy.com. After consulting with ShopJimmy personnel, my husband was advised to take the TV apart and look at the serial number on the T-CON board. Good thing he took their advise, because the serial number was not the same as quoted on several T-CON order sites. To make a long drawn out story short, please heed my warning if you intend to purchase this model TV, unless months down the road you want to put up with a hassle from Sony customer service/techs and Sony not willing to assit with any, I mean any help.", "Date": "December 25, 2010"}, {"Title": "excelent LCD TV my family love it", "Author": "daddydani", "ReviewID": "R39I8HCFTGCT7F", "Overall": "5.0", "Content": "the best LCD TV, is an excellent choicemy kids, wife, parents and friends love it", "Date": "October 17, 2010"}, {"Title": "Best 52\" at the price.", "Author": "Bulldog", "ReviewID": "R2VCI2FP7G4DSV", "Overall": "4.0", "Content": "I love my TV... Had it for 1 year. besides its only 60Hz, the price was great $1299. still cant be beat on a 52\" Sony!", "Date": "October 3, 2010"}, {"Title": "Sony Bravia W-Series 52 inch LCD HDTV", "Author": "S. Lape \"Cam man\"", "ReviewID": "R3M15YU3SYFRLQ", "Overall": "5.0", "Content": "This TV is awesome!  We are so happy to order it from Amazon.com and shipping was quick.  It arrived in excellent condition and setup was quick.  We had HD already so we connected the Direct Tv to the big screen in 20 min.  The picture quality was incredible in HD and great in regular Tv.  The sound is average but we have it hooked up to an entertainment system to enjoy movies and video games.  We believe in Sony and wouldn't purchase any other brand.", "Date": "March 13, 2010"}, {"Title": "tv- amazing, experience-not", "Author": "A. Morris \"akmorris\"", "ReviewID": "R1TRA9W36E6APU", "Overall": "5.0", "Content": "The TV was a gift and has been thoroughly enjoyed by the recipient. Definitely recommend the TV! VERY light, great picture, great sound!I was not pleased, however, with the experience. I have bought off Amazon hundreds of times and always had a great experience! This time, Im afraid, was not the same. I ordered the TV 10 days before Christmas and it arrived a week after Christmas (which isnt fun when it is a present). It was impossible for me to get in touch with the shipping company. I tried calling several times and emailing with no response! They finally called my house phone to set up a time (an 8 hour window of time I had to be home on a weekday) and when they showed up it was only curb delivery- which was not stated anywhere! We had about 8 inches of snow on the ground and I was at home by myself with a one year old leaving me unable to carry the huge box inside until someone else got home. I thought I was making it easier on myself by having it delivered with \"free shipping\", but looking back would just go to the store so I could guarantee arrival before Christmas and would have someone with me to bring it inside the house.", "Date": "January 17, 2010"}, {"Title": "nice flatsceen TV, good sound", "Author": "Donald G. Vandeventer", "ReviewID": "R1Y5DLFJQXVC1B", "Overall": "5.0", "Content": "nice TV, mounted it on a swivel wall mount, very eisy to watch, from most any angle. speaker bar on front so it projects sound in the direction it is facing", "Date": "November 1, 2009"}, {"Title": "I bought this one year ago", "Author": "James Unger", "ReviewID": "R3L4Z9EICM5EH", "Overall": "5.0", "Content": "I decided to wait one year after purchasing this to write a review.  After one year this TV has performed flawlessly.  It is a great value, beautiful picture quality and easy to operate.  I watch hockey, which is a fast moving game and the 120 Hz is just the anwer to the fast puck movement.  Fast delivery and easy set-up.  A completly satisfied purchase.", "Date": "September 21, 2009"}, {"Title": "frank", "Author": "Frank J. Gutmann", "ReviewID": "R5RN6D26FX5U7", "Overall": "4.0", "Content": "So far I am pleased with my TV. However I am not to happy with the remote control, the mute button  and other bottons are too small & will tend to slip below thremote face. I contacted sony but got no satisfaction from them. they said I should buy a universal remote. thats no help. maybe Amazon can do somthing. please TRY. thank you.", "Date": "July 7, 2009"}, {"Title": "Greatest Present a Guy Could Receive!", "Author": "Joe G. \"bigjoegun\"", "ReviewID": "R2BAGDQULL9PJD", "Overall": "5.0", "Content": "I have had this TV for 8 or 9 months now.  I received it as a house-warming gift from friends and family.  I tell you what, it has been a wonderful thing so far.  I've had no problems with it at all!  The picture quality is outstanding when watching HD channels!  It's pretty decent when watching non-HD channels as well but really great with the HD channels.  The sound is terrific as well.  My family and friends did a tremendous job in researching and picking out a TV for me and I cannot thank them enough!  I totally recommend this set for anyone who is looking to buy an HDTV for themselves or like my wonderful family, for a present to for someone who totally was not expecting it nor feels they deserve such a thing.", "Date": "June 23, 2009"}, {"Title": "Sony 52\" Bravia", "Author": "Elizabeth Tyree", "ReviewID": "R2ZJKVUL5IR0SH", "Overall": "5.0", "Content": "Our Sony arrived promptly and was set up carefully by the deliverymen, who forgot to remove the packaging but I don't hold that against the product, which is everything one would expect from a Sony: perfect picture, tremendous glare resistance, no-brainer operation, great audio.  I'm not sure I understand all the hoopla about motionflow but trust I will appreciate it once football season begins.", "Date": "June 3, 2009"}, {"Title": "Nice TV", "Author": "J. A. PELLETIER", "ReviewID": "R1GDXQWGROKRJA", "Overall": "4.0", "Content": "Bought this to replace a 42\" plasma and it is very crisp and clear.  Husband is really excited about it!  So far so good!", "Date": "June 2, 2009"}, {"Title": "Great Big HDTV", "Author": "Tommy McMullins \"TLM\"", "ReviewID": "R21G7BD176HJGZ", "Overall": "5.0", "Content": "I have had my Sony 52\" LCD HDTV for over 5 months now.  I have finally nailed down great settings for my HDMI ports and component ports.  I must say with the incorrect settings my TV didn't come close to what I thought it should look like... after my last batch of setting changes the tv really sparkles.", "Date": "May 22, 2009"}, {"Title": "Great Picture", "Author": "Eunice", "ReviewID": "R3TVGZAYS7UWRG", "Overall": "5.0", "Content": "TV is awsome.  It works really well in my living room with lots of windows.", "Date": "May 7, 2009"}, {"Title": "Excellent TV", "Author": "its_okay", "ReviewID": "RC1PQYKS9BELV", "Overall": "5.0", "Content": "I've had the TV since March 2009.  TV arrived in excellent condition.  TV is excellent, anywhere you sit, the picture is excellent.  So clear, you can see lint on newscaster's jacket.  Excellent price in Amazon.  I got it for less than the price they have it now.", "Date": "May 1, 2009"}, {"Title": "Excellent TV", "Author": "Ivette Salazar \"mom\"", "ReviewID": "R2DIR0N8Z0PC3C", "Overall": "5.0", "Content": "Short and Simple:  Great Picture, great price, the white glove delivery made the whole purchase hassle free.", "Date": "April 30, 2009"}, {"Title": "Predictable, Seamless, No surprises.", "Author": "William M. Farnsworth \"Penn State Bill\"", "ReviewID": "R3TL1ODXZJCZFV", "Overall": "5.0", "Content": "Good job Amazon.com! This purchase went just as you promised and as I expected. The product is as described, delivery was on time and billing was flawless. I'll buy from Amazon.com again. As for the 52\" Sony HDTV ... it's perfect for my situation. It's in a large family room that has lots of natural light, upgraded to a HD cable signal, viewing angles are good ... also paired with a Sony PS3 for blu-ray service and the internet browser. It's a really nice set-up!Sony BRAVIA W-Series KDL-52W4100 52-Inch 1080p 120 Hz LCD HDTV", "Date": "April 20, 2009"}, {"Title": "Incredible!", "Author": "VMB", "ReviewID": "RAA0EQAVLN52P", "Overall": "5.0", "Content": "This is an amazing lcd tv.  Our family absolutely loves it!  The picture quality is outstanding.  This was our first large electronic purchase off of Amazon and the service was great!  The delivery company scheduled a certain day and time, unboxed it, tested it out and disposed of the box.  Overall, we had wonderful experience and would buy again from Amazon.", "Date": "April 15, 2009"}, {"Title": "Great TV, great price, fast delivery.", "Author": "W. Sproat", "ReviewID": "R7C3FT7L7IYPL", "Overall": "5.0", "Content": "After doing quite a bit of research, I narrowed down the field to this TV and the Samsung equivalent.  The picture is great, there are plenty source inputs, and the on-screen set up is intuitive enough to navigate quickly.  I ordered the TV on Sunday afternoon and it showed up Wednesday morning - excellent service from Amazon.  And the price was lower than the local sale prices and even Sam's Club.  Highly recommended.", "Date": "April 15, 2009"}, {"Title": "SONY 52\" LCD BRAVIA", "Author": "William F. Lamb \"xkebuff\"", "ReviewID": "R3NSFM4HKFKVIN", "Overall": "5.0", "Content": "I love the TV. I was lucky enough to be doing some construction on the wall behind the TV mount, so I could hide all of the wires. The TV's picture is incredible, and the 120 HZ processor make sports viewing crystal clear. It has become the focal point of the room. I've seen this TV for up to double the price I paid, and delivery was a breeze, with the delivery men calling prior to their arrival.", "Date": "April 15, 2009"}, {"Title": "Harsha", "Author": "Harsha Rudrappa \"harsha\"", "ReviewID": "R1XEJK7G7J3KKN", "Overall": "5.0", "Content": "Great TV for the price, pictures are great, sound is pretty good although I have a home theatre. Remote is easy to handle. Delivery was a little late as the one who delivered it could not reach my place in time. However Amazon had given him sufficient time.Overall this is the best tv I have ever got.", "Date": "April 14, 2009"}, {"Title": "My New Sony Bravia Television", "Author": "Trina Y. HarrisWhaley \"Trina Whaley\"", "ReviewID": "R24X6N1YCX4F18", "Overall": "4.0", "Content": "I am very pleased with my new Sony Bravia W-Series 52 inch television.  It is a wonderful source of entertainment with many options.  My husband is mesmerized by his birthday gift.  The cost was also great!!!", "Date": "April 14, 2009"}, {"Title": "Fantastic", "Author": "Cody M. Harkins", "ReviewID": "R2S73KPJM6IBDO", "Overall": "5.0", "Content": "I have nothing negative to say about this product.  Great support from Amazon and shipping was a breeze.  I would advise anyone looking for a TV to do it thorugh Amazon.com without any reservations.", "Date": "April 14, 2009"}, {"Title": "sopny bravia lcd tv", "Author": "H. Hale", "ReviewID": "R1S9YUUUC0ENPH", "Overall": "5.0", "Content": "Amazon sent this in a timely manner, delivery crew called ahead to verify delivery date and time, set up was professional.  Product is a nice looking tv, works great, easy to navigate menu items, would definately recommend this tv.  First Sony I've had, it replaced a 40\" tube mitsubishi that finally bit the dust. The screen has definately cut down on reflections.", "Date": "April 13, 2009"}, {"Title": "Great TV, Great Price", "Author": "Marc Dominick", "ReviewID": "R2ML9ZXKT7EOXW", "Overall": "5.0", "Content": "I upgraded to the KDL-52w4100 from a rear projection Sony SXRD and couldn't be more pleased.  Very sharp picture easy to setup.  This TV was selected over the Samsung because the hint (evident touch) of color is hideous and the two TV's produce very similar picture quality.  Amazon did a wonderful job with on-time delivery and efficient set up.  I am a satisfied customer who would recommend this product to anyone in the market.-Marc", "Date": "April 13, 2009"}, {"Title": "Great picture and great deal", "Author": "hd rider \"seeg05\"", "ReviewID": "R2ZEV6EGBQGQDK", "Overall": "5.0", "Content": "Sony BRAVIA W-Series KDL-52W4100 52-Inch 1080p 120 Hz LCD HDTVI'm thrilled with this television.  I have Samsung and Toshiba HD Flat Panels (LCD and DLP) and the picture on the sony is as good as both.  The 120HZ refresh is sweet.Buy it, you'll love it.", "Date": "April 12, 2009"}, {"Title": "BIG", "Author": "Ann Olsen", "ReviewID": "R15MKTCG3577FL", "Overall": "5.0", "Content": "As I grow older, it gets harder to see and hear the TV.  This Sony really changes all that!  I am relaxed and comfortable, and enjoying my new flat-screen very much.  I did quite a bit of research before ordering from Amazon, and the delivery men were very helpful and knowledgeable.  Thank you for making this purchase exciting and wonderful!", "Date": "April 11, 2009"}, {"Title": "GOOD TELEVISION FOR THE MONEY", "Author": "T. C. QUICKENDEN", "ReviewID": "R2XGELBGRYM0MH", "Overall": "4.0", "Content": "TELEVISION LOOKS GREAT.  ONLY PROBLEM WITH IT IS THAT SONY HAS A FEATURE FOR LIGHT SENSITIVITY.  IT CAN BE TURNED OFF EASILY, WHICH WILL BRIGHTEN THE TV FOR DAYTIME VIEWING.  AT NIGHT, I'LL PUT THE FEATURE BACK ON BECAUSE THE TV WILL BE BRIGHT ENOUGH TO ACTUALLY GIVE YOU A HEADACHE.  DON'T BE FOOLED BY MY REVIEW.  THIS TV IS A GOOD ONE.  GREAT COLOR AND PLENTY OF ADJUSTING ABILITY FOR THE PICTURE.  JUST KNOWING HOW TO ENHANCE THE PICTURE WITH THIS FEATURE MAKES A BIG DIFFERENCE DURING THE DAYLIGHT HOURS WHEN YOU FINALLY DIAL IN YOUR PERFECT PICTURE.", "Date": "April 10, 2009"}, {"Title": "love this tv", "Author": "newchus", "ReviewID": "RIJGCTJWAFJS5", "Overall": "5.0", "Content": "I am really glad we got this tv. It has great quality and it has a \"low profile\" which fits well in our house.  We needed the non glare glass which Sony makes on large TV's.", "Date": "April 8, 2009"}, {"Title": "Sony 52' LCD 52W4100 1080p 120Z", "Author": "R. Hancock", "ReviewID": "R292RD90V99CP6", "Overall": "5.0", "Content": "Great product at a very good price. Outstanding picture very happy with the Sony product.", "Date": "April 7, 2009"}, {"Title": "sony lcd tv", "Author": "William P. Adkins", "ReviewID": "R35SYWXHYBLWT8", "Overall": "5.0", "Content": "To be honest i was hesitent to buy online.But the tv was priced just right.So i bought it,only to have amazon cancel the order the next day! The price was wrong on the website.It was actually two hundred dollars more.So i paid the diff,tv shipped really fast.Got it in two days by pilot.Just like if u bought it from sears, they set it up and everything.Best tv out there,was going to buy xbr6 but the w is just as good and a thousand dollars cheaper, by the way amazon gave a one hundred dollar gift card for the misprice. amazon, great prices,fast shipping,great customer service. U can tell i shop alot from them!lol....UPDATE 3-26-13. TV STILL LOOKS LIKE THE DAY THEY DELEVERED IT.SONY HAS THE BEST PICTURE QUALITY THERE IS.IF YOU KNOW WHAT YOUR DOING AND ADJUSTING EVERYTHING,Calibrating etc..Would LOVE an 80 inch Sony lcd.I beleive that they have an 70 inch for like $18,000.THEIR PICTURE IS THE BEST ,BUT NOT FOR THAT KIND OF MONEY.", "Date": "April 7, 2009"}, {"Title": "Absolutely Orgasmic", "Author": "Androly-San", "ReviewID": "R2F96V0QQO0925", "Overall": "5.0", "Content": "If one of the inputs was bigger, I'd make sweet love to this TV, that's how beautiful it is.", "Date": "April 7, 2009"}, {"Title": "52\" Sony Bravia KDL-52W4100", "Author": "BJ Lewis \"BJ\"", "ReviewID": "RYMIZN75UZAEV", "Overall": "5.0", "Content": "I am very pleased with my television purchase.  Amazon customer service was great.  The product was received in excellent condition and the product arrived much faster than expected.", "Date": "April 7, 2009"}, {"Title": "money well spent", "Author": "JJ Subi \"JJ\"", "ReviewID": "R2EUGK9WPPZ5B5", "Overall": "5.0", "Content": "Have loved this purchase since the day it arrived. After calibrating picture a bit, I can not believe the superb quality of this model on bluray movies. Have not found 1 thing I dislike yet. HIGHLY RECOMMENDED.", "Date": "April 7, 2009"}, {"Title": "BEST PURCHASE", "Author": "ValMol", "ReviewID": "RZ9A1YIX9JR8M", "Overall": "5.0", "Content": "After MANY hours of research I can't tell you how awesome this TV is. It is sleek and light weight. If there was ever doubt that definition does not really make a difference in the sharpness of the picture, take it from me.  You can see lint on people's collars on this TV.  The vendor was cheaper than most and I received it 3 days ahead of targeted delivery date.", "Date": "April 6, 2009"}, {"Title": "gotta have HD", "Author": "Robert H. Higgins", "ReviewID": "RWDG8I2U8GXOT", "Overall": "5.0", "Content": "You really need to have HD for this TV to perform.  The product is just fine right out of the box with no major adjustments for color etc...  I am not a videophile, but enjoy a good picture - this sony delviers a great picture and great soound to boot.  Non HD programming can be fuzzy exspecially against same programming in HD.  Overall fantastic TV", "Date": "April 6, 2009"}, {"Title": "Great TV and great shipping/service from Amazon", "Author": "Cheryl Mcdonough \"Goddess Is A Verb\"", "ReviewID": "R1RI5ZJ2MK4E3R", "Overall": "5.0", "Content": "The Sony Bravia 120hz is a great TV and got a great price from Amazon - the best price we've found.  Would not have bought it online except that Amazon offered \"preference shipping\" which was free plus they bring in the TV, unwrap it and make sure there is no damage. Sounds too good to be true but that's what they did and the TV was easy to get running and has a wonderful picture.", "Date": "April 6, 2009"}, {"Title": "Sony 52\" 5 star", "Author": "NJM", "ReviewID": "R1U4XSGJ8RUZCT", "Overall": "5.0", "Content": "This is a great item, the picture is wonderful no problems with set up, delivery was as promised and we saved $500. over Sam's club price.", "Date": "April 4, 2009"}, {"Title": "Very good TV set and service", "Author": "Aimhigh \"aimhigh\"", "ReviewID": "R13I89IBL2JJLE", "Overall": "4.0", "Content": "I have ordered this TV set from AMZN, but the price was labled wrong then was cancelled by AMZN automatically. Late when the price up and down serveral times, finally I got this TV set, quality is very good. AMZN provided very good service too.", "Date": "April 3, 2009"}, {"Title": "Awesome TV for the price", "Author": "K. Biesheuvel", "ReviewID": "R2P1XEVZ7PZCFI", "Overall": "5.0", "Content": "Reviews are never my thing but for this TV I give it 5 stars and my time writing this review. Awesome TV, works great with my PS3 and bluray movies. The clarity is great @ 120 hz. Makes my old HD set seem like a commodore 360 PC.", "Date": "April 3, 2009"}, {"Title": "Great TV for the price", "Author": "Semon Akbashev \"the1unclesam\"", "ReviewID": "R1V8QFMX2G6YDT", "Overall": "4.0", "Content": "I own a samsung and this sony, I must say that in terms of features the sony is better than the samsung. The picture quality is great and there were no dead pixels when I received it.The volume is a little weird, on some channels you need to turn it up to hear something while on others the volume is fine around 20.Picture in picture is also a little annoying (considering it does not really have it).Other than that, good price, good delivery time, and great TV.", "Date": "April 3, 2009"}, {"Title": "Foreget PIONEER. This is THE TV.....", "Author": "Mister Greene \"Electrolyte\"", "ReviewID": "R3ITXMT6IBVIMS", "Overall": "5.0", "Content": "Sony BRAVIA W-Series KDL-52W4100 52-Inch 1080p 120 Hz LCD HDTVI bought this TV five weeks ago after a long time consuming research. It did not disappoint me. I believe it exceeds the expectation of the Pioneer Kuro. Awesome picture quality and design. It is a jewel of the crown for my living room. I waited to write this long just to make sure everything works as I imagined. Right now, I'm having a little problem with TV Guide. It is showing 'Pending'. I need to dig in deeper to see what did I do wrong.I even hooked up a PC with wireless keyboard and mouse to it. (I really wanted to have a media center but I had to settle with a spare Sempron PC). Video card easily recognized Sony TV at 1,920x1,080. Now I can watch streamed or DVD movies at this resolution. I'm a happy camper.I highly recommend this TV. It has been a long time since we are using SONY brand electronics. It is still living up to its expectations.", "Date": "April 2, 2009"}, {"Title": "Excellent Product", "Author": "G. Sharma", "ReviewID": "R2SWZ3HFMYDA6L", "Overall": "5.0", "Content": "One of the best LCDs for the price. The menus are easy to navigate. After some customization the picture is perfect. Really like the deep black that the TV delivers. Colors are crisp. Well worth the price.", "Date": "March 29, 2009"}, {"Title": "Bravia 52\" Sony", "Author": "mickey moe", "ReviewID": "RH68WOYVDM42I", "Overall": "5.0", "Content": "We were very pleased with the service and delivery of the Sony TV. I would definitely recommend Amazon.  This is the second Sony Bravia wepurchased from Amazon and would do it again.", "Date": "March 27, 2009"}, {"Title": "Great TV", "Author": "Brent", "ReviewID": "RQQFTS3IHNRSH", "Overall": "5.0", "Content": "Great TV, the picture looks great, the sound is better than other televisions.  The Sony was chosen over the Samsung because the Samsung has more of a glare in lighter conditions. Amazon had good service, but its yo-yo pricing on this TV is interesting.  I first looked at this TV when the pricing was around 1800.  I bought it for 1650, then price went down to 1595 before I received the TV, I called Amazon and they matched the lower price, but it was only at this lower price for a day, then it went back into the 1600's, then it went up to 1900 now it is at 2000.  This is all within a months time. I haven't checked the price every day, but I am sure it has changed even more then I indicated.  I'm developing a hobby of checking the price since it is fun to see what the price will be on a given day.", "Date": "March 26, 2009"}, {"Title": "SONY GREAT PURCHASE", "Author": "Daniel J. Kummer", "ReviewID": "RQG5ZU551RBOZ", "Overall": "5.0", "Content": "I bought this LCD from warehousedeals.com....I didn't know Amazon had a warehouse.  Best price anywhere.  Perfect delivery in a amazon box.  the Pilot delivery men unwrapped it in my living room.  Technically the set is perfect.  Great purchase.  I looked at Vizio 55 and Sharp 52 with 120 hz, but the Sony was the winner because of the price I received at Amazon warehouse.", "Date": "March 26, 2009"}, {"Title": "SONY 52W4100", "Author": "Sailorborne", "ReviewID": "R3N6W42JMHS3A2", "Overall": "5.0", "Content": "Outstanding product.  I was hesitant to make such a large purchase online, but couldn't be any happier.  I also purchased the Sony Blu Ray which and linked it up with the TV and a Sony surround souund.  It's not the best of the best out there, but for the price and quality, there's nothing comparable.", "Date": "March 23, 2009"}, {"Title": "great picture, great sound", "Author": "Eric", "ReviewID": "R15RLR7BICNXL7", "Overall": "5.0", "Content": "It's almost been a month and so far, so great!  Have always had good experience with sony products (knock on wood).  My first LCD tv was a 40 inch of the older W series and all is still good after more than a year.  This one exhibits great picture and great sound...the 120hz refresh rate does make a difference.  Great price with Amazon too.  I highly recommend it!", "Date": "March 22, 2009"}, {"Title": "Sony Bravia", "Author": "Ngburg \"NewGrad09\"", "ReviewID": "RJ9916IYJ7Z0D", "Overall": "5.0", "Content": "We love our new Sony Bravia.  Great picture quality and sound, easy to set-up and use. Product delivered without any problems.", "Date": "March 21, 2009"}, {"Title": "Sony TV", "Author": "W. Jansen", "ReviewID": "R2A7HOV5FPXEKJ", "Overall": "5.0", "Content": "Simply the best price around.  Awesome deal.  The TV's not too bad either.  :-)", "Date": "March 20, 2009"}, {"Title": "Watching TV all the time now!", "Author": "Daphne H", "ReviewID": "R3KQCMHNZS0KY4", "Overall": "4.0", "Content": "Great picture and just in time for the return of Tiger and March madness. Easy to set up.", "Date": "March 19, 2009"}, {"Title": "Pair Your Purchase with the Playstation 3", "Author": "David Cleaver", "ReviewID": "R1QMY5G0PIN6S7", "Overall": "5.0", "Content": "Purchased this Sony model through Amazon on 3/8 and it was delivered 3/12.  Free white glove delivery ($60+ value)was prompt and efficient. The final comment by the delivery team was \"this must be a popular tv because this is the third KDL-52W4100 delivered today\", and it was only 8:15am! The picture quality is stunning.  Connected to a Playstation 3, there is almost a three dimensional viewing effect.  Even standard dvd's look exceptional upscaled through the PS3's HDMI connection.  Standalone sound quality is fine but if you have a 5.1 system hook it up and enjoy.  Finally the price, I purchased it @ $1,649.  With the $30 credit using the Amazon Visa card, net price was $1,619.  The cheapest price from BB and HHG was $1999.  Adding sales tax difference, I saved over $500!", "Date": "March 17, 2009"}, {"Title": "KDL-52W4100", "Author": "Michael Royston Turner", "ReviewID": "RKLUDB3F0RX0R", "Overall": "5.0", "Content": "After comparing and seeing this LCD next to others at the store I am very pleased. The picture and anti-glare screen are fantastic. Sound quality is also very good.", "Date": "March 17, 2009"}, {"Title": "wanted it, got it, happy with it", "Author": "Mercedes Thorp", "ReviewID": "RSQ306WN0KIU8", "Overall": "5.0", "Content": "We saw this tv at sams club, and I knew right away we wanted it.The picture was the best we;ve seen,but the price was pretty high for us so we waited for a year and the price come down some.When, we were ready, we checked it out on line at different places.I asked my husband to check to see if Amazon had it and they did.This was not only the best purchase we made it was even  better for the price.The difference was such that we also purchased a blue ray and receiver. It looks beautiful on my wall and the quaility you can't beat.we get so many compliments on it .We tell everyone to check out Amazon first before they buy.It also was delivered it less than a week.We are very happy THANKS AMAZON FOR MAKING IT POSSIBLE!", "Date": "March 17, 2009"}, {"Title": "Awesome TV", "Author": "Andy \"Andy R\"", "ReviewID": "R3CFS2Q75SO5RJ", "Overall": "5.0", "Content": "This TV is just awesome..  And Amazon's white glove delivery surpassed my expectations. For the past few days since I got this TV, I've tried HDMI 1.3 Blue Ray, DVD, HD channels on Dish network, even SD channels..  The video is eye popping..  I was almost sold on getting a pioneer plasma, but I am glad I made this purchase. The Sony W4100 is worth every penny I spent on it.. You could not go wrong with this TV..Cheers,Andy", "Date": "March 16, 2009"}, {"Title": "Amazing Picture!", "Author": "Armando Castaneda, Jr. \"jr123184\"", "ReviewID": "RLWNK2OWSZ04P", "Overall": "5.0", "Content": "I just got one of these beauties today(3/13) after ordering it Saturday(3/7).  The price was great and the delivery service by CEVA was really good.  I set the TV up with my PS3 and a Mediabridge HDMI 1.3 cable I also got from amazon for $9.99.  After optimizing the picture with THX, the picture was just amazing.  Blurays look very detailed and dvds look pretty good.  The 120Hz precessing gets rid of ghosting and makes for a smooth image.  I highly recommend this tv to anyone looking for a great product from Sony at a very low price.", "Date": "March 13, 2009"}, {"Title": "Excellent Picture and Quality", "Author": "G. Mosby \"GM\"", "ReviewID": "R1HFD74TJ2QPBH", "Overall": "5.0", "Content": "I got this TV on the 2nd of March. The people from Howards TV & Appliance had it out of the box set up and running in less than 20 minutes.Pros:The picture is increditible, or \"WOW\". It looked as good as it did in the showroom.I have made only a few adjustments to the settings and the picture is perfect.I had heard the stories about how non HD TV looked on an HD set. I can honestly say some of them are near HD/1080 perfect. I have Verizon Fios and this may have something to do with picture quality as well.Easy to navigate around the options on the remote.With all the input ports on the tv, easy to hookup my dvd recorder, Blu-ray player and surround sound system.The picture quality with Blue-Ray is astounding.Cons:I have not found any yet.Minor, when i first turn on the set, it seems to interfere with the Verizon cable box and i can't use the remote for changing channels or to look at program info for about 3 to 5 minutes.This is a great TV and i would recomended it to my friends.", "Date": "March 12, 2009"}, {"Title": "Amazing TV", "Author": "D. Strecker", "ReviewID": "R2N7NJQ6WP062Z", "Overall": "5.0", "Content": "I could not be happier with this TV.  I am quite particular and find no short comings with this Sony.", "Date": "March 8, 2009"}, {"Title": "Really Nice", "Author": "Z", "ReviewID": "RULUNJEHB1NQ9", "Overall": "5.0", "Content": "Product shipped on time, delivery took it inside the house to upstairs, unpacked and checked everything to make sure it's ok. TV is great overall.", "Date": "March 7, 2009"}, {"Title": "Review of sony tv", "Author": "Duane Walker \"Dew\"", "ReviewID": "R1X4VZ683116UO", "Overall": "5.0", "Content": "I purchased this tv after alot of research and I love it. The picture is crystal clear. Thanks sony for a great tv.", "Date": "March 1, 2009"}, {"Title": "Beautiful", "Author": "Phone man", "ReviewID": "R3HAKT1T4AOTDG", "Overall": "5.0", "Content": "The title says it all.  I've seen this LCD in stores on display, and this model always stood out among the rest. I've now had the pleasure of watching tv on this very big screen for a few weeks now and I am most satisfied.  Colors are great, 120hz refresh rate, syncs well with sony's bd550 blu ray player, one remote controls both. Blu ray is so sharp on this panel, I nearly had a tear running down my cheek the first time I watched a movie on it. Shipping was great and on time as scheduled. I have always been afraid of purchasing something this expensive online, but I am most satisfied with this purchase.  I want to  thank Amazon as well as I had an issue with the transaction and was resolved appropriately. I recommend this LCD to anyone within its budget.  It's not cheap, but it's worth it.", "Date": "February 28, 2009"}, {"Title": "excellent television", "Author": "D. Wollstadt", "ReviewID": "R3SM057FG8XQYJ", "Overall": "4.0", "Content": "I am very satisfied with this television.  It has a great picture and the only reason I didn't give it 5 stars is it was a little hard to get it just right.  The picture is extremely adjustable through every different color (including blacks and whites).  The sound is better than any other television in the price range/size without any additional speakers.  With the surround sound it is amazing.", "Date": "February 28, 2009"}, {"Title": "Sony TVand BluRay", "Author": "Morris W. Pearson", "ReviewID": "R2Z3QY8NBJX4HN", "Overall": "5.0", "Content": "Entire project was very easy.  Very good product description and pricing was very good, better by far than Sam's.  Delivery was on time.  Delivery people were prompt and courteous.  They set up the equipment and did some initial checks to see if it would power up.  Overall evaluation was excellent and I would recommend Amazon again.", "Date": "February 26, 2009"}, {"Title": "Great buy.", "Author": "Rodney Stuart \"Colleyville.Tx\"", "ReviewID": "R3OPF10V6KNQ2W", "Overall": "5.0", "Content": "I did lots and lots of shopping and this is what I purchased. I paid $1897.95 through Amazon.com. You will not be disappointed. I have always had great luck with Sony products.", "Date": "February 26, 2009"}, {"Title": "Excellent TV", "Author": "J. G. Mejia", "ReviewID": "R2C38ULVIBSNT5", "Overall": "5.0", "Content": "I bought this TV last month to upgrade from a HD projection TV.  The picture from HD sources is awesome; it is great even from standard def programs/movies.  The sound is good enough for programs that don't need a surround system (news, cartoons, etc). The price was excellent; amazon beat the others by several hundreds of dollars; no problems with the free shipping either; I received it several days before the initial delivery date.", "Date": "February 24, 2009"}, {"Title": "1080P Man", "Author": "Donald L. Davis", "ReviewID": "R2NLTTX0FCX6HN", "Overall": "5.0", "Content": "I made the purchase at Amazon.com because they had the best price, not to mention the free shipping and the tax break.  The TV was delivered in a satisfactory time and manner with inside delivery and setup.  I am very satisfied with the product and the convience of the Amazon.com purchasing process.", "Date": "February 24, 2009"}, {"Title": "Great Tv took this over the samsung 52 model", "Author": "M. Sandoval", "ReviewID": "R29W2S9UQ6B7NI", "Overall": "4.0", "Content": "Awesome Tv after much debate over this model and the Samsung model i finnaly decided going with the Sony model over the samsung.For the simple reason a major flaw with the samsung is that it glares extremely bad to give it greater color in blacks.While the Sony gives more of a natural charcoal color when comes to black and doesnt glare like the samsung. That and i wanted to keep every electronic in my home theater one brand. Sony Ps3, Sony LCD, Sony Floorstand Speakers.Only one Flaw  that i come up with is the remote really does need a glow or backlight.The Tv Guide feature is amazing for me a person who has cable without a cable box it helps when tv guiding. Its brings up a feature similar to a DVR without the Recording feature but it lets you view past channal times and future title times. And allows Timer Reminder Set up for your favorite shows.", "Date": "February 22, 2009"}, {"Title": "Best LCD TV", "Author": "Tony D. Pham \"Tony\"", "ReviewID": "RIO1B8G6JOJJK", "Overall": "5.0", "Content": "I was debating b/w the LG and Sony but I decided to go with Sony b/c it's well known and been on the market for years.  I'm glad I picked it b/c its pictures are unsurpassed.  Very vivid, clear and high contrast.  120Hz motion flow is great.  I hooked up with my HD direct TV/ DVR and broadcasted on 1080i, my goodness the pictures are awesome.  I then hooked up to my blue-ray player and played it on 1080p and you have no idea how clear it is.  It's almost like you're there, seeing it live, rather than on TV.  It's that high-def and I'm so happy with it.  Amazon shipped it w/i a week but the TV came with the broken bevel, I called customer service and no problem, they sent out a new one the next day and I received it 3 days later.  Very happy and highly recommend Amazon and this Tv to everyone.", "Date": "February 21, 2009"}, {"Title": "Sony Bravia KDL52W4100", "Author": "Russell Agate \"Rusty\"", "ReviewID": "R28YYKQE9HH1Q6", "Overall": "5.0", "Content": "This HD television is all that I thought it would be. Excellent picture quality and easy navagation  with the remote control. I have a sony projection that is now fifteen years old and still working perfectly. I just wanted to switch to Hi Def while the deals were so good. My experience with Amazon went without a hitch and I was very satisfied with their service.", "Date": "February 21, 2009"}, {"Title": "Love Amazon, Love the TV, Love the Service!  Amazon Rocks!", "Author": "B. Betts", "ReviewID": "R2J6XLTOMOEOV5", "Overall": "5.0", "Content": "Man, I cannot say enough about how great Amazon is.  This TV arrived today in perfect condition with free of charge setup by Pilot Freight (a shout out to Pilot Freight-great service).  They said they'd be here by 2:00 and they were right on time.  Delivery was less than a week and earlier than Amazon said, so kudos to them!I know it must be scary to order an expensive TV from Amazon, however, fear not!  The TV is amazing, the picture is unbelievable and everything from Amazon has been perfect and beyond the call of duty!  I would not hesitate to order anything from Amazon.  What's great about Amazon is you can read reviews and decide whether you want to buy or not.  The reviews usually do not steer you wrong.  They are always right on the money.If this is your first HD TV, as it is mine, and you have had a 27\" POS for 17 years, then you'll understand my complete and utter joy at having this in my home.Thanks to Amazon and thanks to Pilot Freight!", "Date": "February 20, 2009"}, {"Title": "Excellent TV", "Author": "Steve L.", "ReviewID": "RSTFHBSCNQYB8", "Overall": "5.0", "Content": "I've owned this TV for about a week now.  I am very happy with the picture and the price I paid.  The picture is very good with standard definition signals and DVD, and excellent with high definition signals.  The motionflow setting truly does work as advertised by eliminating most motion blur.  There are quite a few options in the picture settings menu so you can tweak the picture to your liking.  I didn't see any difference with a couple of them though.  Blu Ray discs look wonderfully clear and crisp, and in some cases quite stunning at 1080 24/p.  Overall I am happy I purchased this TV.  When I was shopping I wanted the best \"bang for my buck\" as this TV purchase was going to be my last for quite a while.  When I compared price, quality of the picture, and features, this TV won out.  I am satisfied that this TV will be my \"main\" TV for quite some time.", "Date": "January 17, 2009"}, {"Title": "Great for watching football", "Author": "Gary Clark \"electric warrior\"", "ReviewID": "R1XQDA2K0AHS7P", "Overall": "5.0", "Content": "Great for watching football.  Arrived in perfect condition and one day ahead of schedule through Amazon's contracted freight company.  A lot less money than Costco or BJ's.", "Date": "January 15, 2009"}, {"Title": "Great tv - Need HD Cable", "Author": "Big Red", "ReviewID": "RMMANSA5G1O6Y", "Overall": "5.0", "Content": "We love this tv.  The picture is just beautiful - it looks better at our house than it did even at one of the big box stores.  I have to admit, we were a little leary based on the picture that we saw at the big box stores, but we read all of the reviews and pulled the trigger anyway.  We were not disappointed.  However, it should be made clear to everyone that to get the most out of this tv, you really need to have HD cable connected to the tv with an HDMI cable.  When we first got the tv, we did not have an HD cable box (it did not have an HDMI port), but we did within a couple of days.  The improvement was just amazing.  We had no idea that it would make that much difference.  The key to the amazing picture on this tv is hooking it up to amazing sources.  Blu-Ray looks phenomenal as well.The Amazon delivery for this item is great!  They bring it into the house, take it out of the box, and set it on your stand for you!  You would pay a lot for that service from one of the big box stores!We highly recommend buying this tv and buying it from Amazon!", "Date": "January 14, 2009"}, {"Title": "Sony w4100 is the TV you want", "Author": "Rick Munoz", "ReviewID": "R3L6N2ZJF13WS6", "Overall": "5.0", "Content": "I researched my new tv for 3-4 months.  I went to Best Buy, Cuircuit City, and a few others to see for myself, several times.  My wife was sick of it!  Just pick one, she said.  So one day we went in to Best Buy, we both saw the XBR6 and w4100 52 inch, and we actually preferred the picture and color of the w4100.  I bought it for ~ 2300, if i could go back I would buy it thru Amazon for ~1900 and save the tax, live and learn.  But here are a few of my impressions, hope they help:1)  The picture is great, I can't imagine it better.  I read a review that said the XBR had more vivid color.  When you get the w4100, under the picture menu, you can set it to vivid or cinema or standard or custom (make your own).  I like mine on vivid, the colors are amazing.  And you can really tell the diff between settings.2)  Glare really is important.  My TV sits in our living room, a skylight and reflections from the front door ruled out Samsung and Pioneer.  REALLY glad I went with Sony's matte like surface.  Yes, when the screen is completely black, you can barely notice some areas not as dark as others.  But no glare is fantastic.3)  I made my final decision irreguardless of price.  I figure I am going to be living with this tv a long time.  Narrowed it down to Pioneer plasma kuro- the picture is just not bright enough plus glare issue, and the Samsung models, all with too much glare, even with limited light.  I really wanted to buy the latest Samsung 8 0r 9 model with the backlight for the 55 inches it has, but that glare was too, much.4)  52 inches is plenty big.  I had reservations going from a 10 year old 60 in bohemoth projection tv, but after you experience true 1080p HD, you dont even notice the diff.  you just enjoy tv more.5)  GET A Sony PS3.  Blue-ray is the best (TV prof reviewers use it as the gold standard), plus you can put your photos and videos on it with ease thru a usb cable.  Friends come over and i show them the latest pictures of trips, etc, on my beautiful tv, they love it.  More features on PS3 than I thought, plus my kid loves Little Big Planet, phenomenal vid game. (don't bother with 25$ remote, the vid game controller is much easier to use, mine just sits there)6)  Mount it on the wall, if you can, it just looks better than I thought, tried it both ways.7)  I have cable tv with a few hd channels, huge diff in picture quality.8)  Anywhere you buy it, it will be shipped to the store, no one has it on hand, might as well get it from amazon shipped to you and save a bundle, (Again, no tax)9)  HD TV is phenomenal, step up, you'll love it.10)  Sound from tv is good,  good enough for my wife, definitly loud enough.  I need surround sound.7)", "Date": "January 13, 2009"}, {"Title": "Awesome Picture!! Great Deal!!", "Author": "L. Yee", "ReviewID": "R2ICP5TQS5XP0N", "Overall": "5.0", "Content": "Bought this new Sony KDL52W4100 plus a free BDPS350 blue ray player just before XMAS at Circuit City for $1748 plus $153 tax plus $10 recycle fee for a total of $1911. BB and VideoOnly wanted $500 more.Beautiful picture with minimal glare with the matte black finish screen. Samsungs have too much glare with their shiny finish. Only gripe is non-lighted remote. Using a cheap indoor antenna with great results. Dont waste $$ on pricey HDMI cable. A cheap $2.00 cable provides a beautiful picture with DVD's, did not try any BlueRay discs yet.", "Date": "January 12, 2009"}, {"Title": "Sony KDL-52W4100", "Author": "D. Vagnoni", "ReviewID": "R1JYCN473MEYWD", "Overall": "5.0", "Content": "This TV is great. Picture is amazing. THe people actually look real while watching Fios in HD or Blu-Ray movies. PS3 games also look amazing. Sound from the TV is great too. I highly recomend this TV. Would buy again in a heart beat. As noted by others, TV does get rather hot after watching for a time.Received the White Glove delivery from Pilot. They actually did an excellent job. Delivery was on the day scheduled (albeit they were late but it was weather related). They took the TV into the house, unpacked it, and put it on the stand for me. They also stayed around and made sure it worked (and I didn't even need to ask them to do so).", "Date": "January 12, 2009"}, {"Title": "Great TV - Better with Calibration", "Author": "Mohamed Ziauddin \"M Ziauddin\"", "ReviewID": "R3LPWZWT3267RS", "Overall": "5.0", "Content": "Pros:After recently upgrading from a worn out CRT 1080i-only TV, this is a huge improvement. After proper calibration, the blacks are very deep while retaining the bright white. The colors are also vibrant, especially on Blu-Rays and on my PS3.I use this TV for normal cable television viewing and for Blu-Rays and video games on my PS3. Through HDMI 1080p the picture is so detailed and clear compared to our last TV. The 24p playback along with 120hz give movies a much smoother feel. I know some people don't necessarily like this, but I to me it makes the TV all the better.Another thing I really liked was the fact that this TV passes 5.1 surround sound through the optical output, while some TV's downscale the 5.1 signal to a stereo signal. This allows me to have my PS3 on and at the same time get sound from cable television.Cons:The remote is a bit ugly, but its functional. I use a universal remote, so no worries there. Also the clear band of glass underneath the screen makes the TV look much better, but if you don't use the provided strap to put cables into, you can see them through the glass. The glossy exterior of the TV is a semi-dust magnet, but not as much as my PS3. Just use a micro fiber cloth and try not to leave fingerprints. There is also only one coaxial input, so if you are planning on connecting a satellite and cable connection, you must use a switcher.", "Date": "January 10, 2009"}, {"Title": "Sony flat screen HDTV", "Author": "Paul J. Mallon", "ReviewID": "R321WDZFCI5XJV", "Overall": "5.0", "Content": "The picture quality on this unit is amazing even without the HD programming.  Older DVD's come alive with more detail and broadcast shows have better definition.Had a problem getting the HDTV to 'automatically' detect the Blu-ray player when hooked up with the HDMI cable but it finally 'found' it after I went to one of several menus available to select input media.  Now its fine and the Sync feature (turns on the Blu-Ray and starts the DVD automatically) is working as it should.Great set, great price and well worth the investment.  Waited over 3 yrs for prices to finally come down.  Worth the wait for the Sony.", "Date": "January 10, 2009"}, {"Title": "Sony 52\" lcd HI-DEF", "Author": "Abbas Mohsenine \"abe  miami\"", "ReviewID": "R22Z1J3HJ9XUH9", "Overall": "5.0", "Content": "One of the best tv,s I have ever bought. Smooth picture and brilliant colors and same angle view as front view. Speakers are a bit weak if you do not have surrond sound attached. I would buy this Tv again If I have to without thinking about it for a second. Must have Tv for anybody who likes the best pictuers and quality.", "Date": "January 9, 2009"}, {"Title": "Kudos to Amazon!", "Author": "B. Henegar", "ReviewID": "R3PDOISQ8ZM1XV", "Overall": "5.0", "Content": "I ordered the Sony KDL-52W4100 on a Monday. it was delivered Thursday afternoon - and I paid $0 shipping - as well as $0 sales tax - over a $200 savings combined. Amazon's price was the same as the big box retailers in my area. But, in addition to the sales tax issue, neither of the local outlets had the TV in stock. That meant waiting on shipment anyway - and they wanted to charge me a shipping/delivery fee.As for quality, I buy Sony for a reason. This TV doesn't disappoint me at all. The picture is spectacular! I have it connected to a DirecTV HD receiver, but am currently only receiving my local channels in HD. The HD channels are brilliant - but even the non-HD satellite channels are incredible.I found the TV easy to set up. The onscreen menus were easy to follow. I haven't begun to dig into the more advanced features - I'm still enjoying the amazing quality of Sony combined with HDTV. I bought this model mainly for the 120HZ Motionflow technology. I turned it on during setup - and haven't yet turned the feature off to compare the difference between 120HZ and 60HZ.If you want quality, buy Sony. If you want to be amazed, buy the KDL-52W4100. If you want a good deal, buy from Amazon.", "Date": "January 7, 2009"}, {"Title": "Sony Bravia 52\"", "Author": "T. Russell", "ReviewID": "R1DDL759RMEOEF", "Overall": "5.0", "Content": "Wow! We love the TV. The menus are a little tricky at first (reading the manual helped!) but otherwise we couldn't be happier.", "Date": "January 6, 2009"}, {"Title": "LOVE IT", "Author": "C. Teague", "ReviewID": "R1ZK84KBYYQH1B", "Overall": "5.0", "Content": "I love this TV, it's huge and the picture is beautiful. Great Sony quality. We don't buy anything else anymore.", "Date": "January 6, 2009"}, {"Title": "Beautiful picture, beautiful price", "Author": "Roger Musa", "ReviewID": "R28F1THLKGOPRL", "Overall": "5.0", "Content": "This Sony television, in my opinion, has all of the highest qualities that I was looking for in an LCD TV. I have noticed the greatness of the 120 Mhz motionflow in comparison to the 60 Mhz televisions, especially when playing an action movie or an action game on PS 3.This thing has 4 HDMI inputs as well. LCD backlighting was not really a big selling point for me and frankly I don't think it justifies the price increase.Overall, I'm very happy with this beautiful picture.", "Date": "January 4, 2009"}, {"Title": "KDL52W4100 review", "Author": "Michael Dileva", "ReviewID": "RA4UKBONCWOSB", "Overall": "5.0", "Content": "This 52\" W4100 series set is almost as good as the XBR series and costs significantly less.  It plays well out of the box with many improved features over the previous 3000 series.Viewing angle, brightness, audio and compatibility with Sony Blu Ray are great.  HDMI audio/Video with the 120 Hz motion smoothing is outstanding.Truly a great buy for anyone", "Date": "December 12, 2008"}, {"Title": "Great Product", "Author": "R S \"Rick\"", "ReviewID": "R27CAF5K42RNGA", "Overall": "5.0", "Content": "Received mine yesterday, was to be delivered by 12/9 but came the next day. Very easy to hook up.  Great picture and sound, everything it was advertised.  Got a great price with free shipment.  The only thing I made a mistake on was thinking that it had white glove delivery, my mistake since amazon only has white glove delivery on the products they sell and not from a 3rd party.  Again, my mistake for not reading all of the description.  I am very pleaesed with the purchase.  Sony Bravia W-Series KDL-52W4100 52-Inch 1080p 120Hz LCD HDTV", "Date": "December 11, 2008"}, {"Title": "excellent television, with great delivery", "Author": "M. Zehngut", "ReviewID": "R3EC5GCQ9DQOXA", "Overall": "5.0", "Content": "This set is fantastic.  Excellent picture and sound.  I have had very good luck with Sony TVs, having had an old 19\" set last for well over 20 years.  This set is very easy to set up and use, and has an excellent picture.  I shopped for months and decided on Sony over Samsung mainly due to the matte screen vs. Samsung's glossy, reflective screen.  Delivery was not \"white-glove\", but was one delivery person who helped me lift the set onto a stand and removed all packing materials, which was fine for my needs.  I highly recommend this set.  Amazon's delivered price was excellent as well.", "Date": "December 7, 2008"}, {"Title": "Best TV I Ever Purchased", "Author": "P. Crawford", "ReviewID": "R5CGQHSEIZQB2", "Overall": "5.0", "Content": "Arrived sooner than expected and in perfect condition.  Delivery Man did not unpack and remove packaging...partially my fault as I didn't know it was included in the delivery.  The TV is Great...picture is amazing, features are very user friendly.Price dropped by $85 within a week of purchase...wondering if Amazon has a 30 day price guarantee?", "Date": "December 6, 2008"}, {"Title": "Amazon Customer service absolutely first rate 100% tops!!!", "Author": "Gawken", "ReviewID": "R10YS04OJ9HKW", "Overall": "5.0", "Content": "I ordered the Sony 2 weeks ago, after doing some research, in part because of Amazon's great price, and the reviews I read here. I admit, I was a tad nervous about ordering a big-ticket item from an online retailer, having never done it before. The set arrived exactly when scheduled, the afternoon of the 11th. The guy from my cable company came the next morning, the 12th, to hook it up. We take it out of the box, put it on the stand. He connects it, turns it on..we have sound, but NO picture. So we call Sony..they say try a few things..( thank God the cable guy is here) no luck..NO pic..nada..zilch...so Sony gives me an Event #..( sounds like a FEMA event) and the number for one of their authorized repair outfits..I call, and the guy arrives the NEXT day, the 13th, on time, exactly when scheduled.a miracle..We lay the set face down on a blanket, he takes it apart..tests a bunch of stuff..he thought there might have been a loose connection..no joy..he calls Sony, on his tech support line..they go through more options..finally decide that the whole panel, AND possibly one or two boards, are kaput, and have to be replaced. It will take a week or so to get them, and then they have to turn my living room into a TV repair shop. At this point I say to myself..NO WAY..not gonna happen..so I call Amazon..just start to tell my story to the lady who gets my call...after one minute, she says \"SIR, STOP!!! I'm so sorry that happened to you.. We'll send you out a new set today, and the people who deliver it weill pick up the old one at the same time..\" I am stunned. NO WAY it can be this easy. Truly a great way to do business. BTW...talking tot he repair guy and the Sony tech, it seems like it's unheard of for a set to be bad right out of the box...neither of them new of it ever happening before. All I can say, if I had boufght it from Best Buy or Circuit City, no way would they have been as eager to send me a new one..so, for me..I'm 100% sold on Amazon...however..I'm gonna miss all the footballgames theis coming weekend on my big new set...", "Date": "November 24, 2008"}, {"Title": "Sony Bravada 52 inch LCD T", "Author": "Timothy Maher", "ReviewID": "RJP1E54HB82HW", "Overall": "5.0", "Content": "The TV is fantastic!!  Great picture and sound!!  I cannot thank Amazon enough for this product, the price was the best I have ever found and the shipping was excellent!  Ordered the TV on a Monday, it came that Friday! Thanks Amazon!!", "Date": "November 24, 2008"}, {"Title": "Great TV", "Author": "Timothy Butler", "ReviewID": "R15YKYHJA66X9K", "Overall": "5.0", "Content": "Did a lot of research on LCD tvs and actually purchased a much larger type.  Our son talked us into returning it and purchasing this Sony for the 120 hz and we're glad we did.  Picture is fantastic.  No complaints.  Amazon delivery was perfect as well.", "Date": "November 23, 2008"}, {"Title": "Great product", "Author": "Damian G. Karlo", "ReviewID": "R2PI6G2KCP76OD", "Overall": "5.0", "Content": "I was a little leery to purchase such an expensive and delicate item over the internet and have it delivered to my home. I have to say that I can't be more pleased with my purchase. The television arrived quickly and in perfect condition via Amazon's \"white glove\" delivery, and I have been enjoying my favorite programs in HD ever since!", "Date": "November 23, 2008"}, {"Title": "great tv great delivery time", "Author": "jaj \"jerry\"", "ReviewID": "R2WBMBNUTBVCJI", "Overall": "5.0", "Content": "ordered the sony kdl-52w4100 on friday and received it the next wednesday - delivered and brought into the house and set on the stand.  (Also ordered some Blue ray movies at the same time - it's saturday and they're still not here - went by smail mail.)  After ordering, there was a difficulty in getting the Amazon credit card to clear the purchase but was cleared up in a short time.  Amazon responded to my communications very quickly.  This tv gives a picture that is probably as perfect as you can find.  The picture is great right out of the box.  The colors are accurate and not fake looking like some sets.  Faces don't have that clay-like look of some others.  The cabinet is nice looking  and when the hdmi cables are threaded correctly, no wires are visible even through the clear cavity built into the lower part of the set.  That design is actually rather neat looking.  The sound is good for tv only sound.  I have a sound system hooked up and it is very good.  I chose the sony not only because of their reputation but also I think they stand behind their product better than Samsung and some other brands.  So far I am very pleased.", "Date": "November 15, 2008"}, {"Title": "Really Nice !!", "Author": "Frank", "ReviewID": "R29W2A99FYZGON", "Overall": "5.0", "Content": "Have had this LCD TV for 2 months now and am very happy with the quality picture it produces (especially in HD). I have a DVR connected via HDMI cable and optical output going into surround sound system. If you are going to wall mount, it does take a little effort to remove the stand. You also have to be careful lifting the unit due to the gap between the speaker and the bottom of the TV. Much lighter than a plasma and gives off less heat too. With the recent price drop, this is an outstanding deal !", "Date": "November 9, 2008"}, {"Title": "Awesome Sony 52W4100", "Author": "LCD convert", "ReviewID": "R3BXP886XAYHL6", "Overall": "5.0", "Content": "This TV is awesome. Well packaged, easy set up(stand already attached). Picture is amazing for all types (hd, standard def, blue ray). I have tried other brands and Sony is the best. I waited for the 52XBR6 to come out to compare, but I think the picture is better on this one. Seems brighter, better view from angles (and whiter), and much cheaper. The XBR screen seemed a bit more shiny also. The w4100 screen is a little more shiny that some cheaper models but much less than the high end Samsungs and the Plasmas. For now close to 2K this is a great deal.The flowmotion 120HZ is worth the extra money. Works well especially for TV and sports. I like it on the mid setting for movies, but my son likes it off? So that is a personal preference.Only slight negative is maybe the stand does not seem that sturdy.. I wonder how the TV would hold up in an earthquake?Now at least I can stay home and see some great TV, sports, and movies on my 52\" SONY LCD...  **** the economy.", "Date": "November 3, 2008"}, {"Title": "I can't imagine a better picture!", "Author": "Gerundive \"gerundive\"", "ReviewID": "R1O8RWZUGL2W8Q", "Overall": "5.0", "Content": "The best picture quality I've ever seen!  Mine is hooked up to my Alienware 'Hanger 18' DVR/Computer with a Blu-ray burner.  I don't even bother going to the theater any more--I just wait till they come out on Blu-ray, and I'm FAR more comfortable at home.  The 52\" HD screen of the Bravia in my small studio apartment may as well be the big screen at the theater--in fact, it is MUCH better!", "Date": "October 27, 2008"}, {"Title": "Great LCD TV", "Author": "J. Moskowitz", "ReviewID": "R37KK953E1ZEMN", "Overall": "5.0", "Content": "Picture and sound are great.  Lives up to all my expectations.  Using it with Comcast CableTV.  HDTV crystal clear.  Plenty of inputs.  TVGuide feature works with cable, but only displays basic channels.  I use the TV input (direct cable feed) for live HDTV, rather than the Video (DVR connection) or Component (HDTV and up conversion) inputs that are connected to the cable box.Quick delivery.", "Date": "September 18, 2008"}, {"Title": "Sony LCD TV", "Author": "Howard A. Kosick", "ReviewID": "R2MXC31MG2R4OD", "Overall": "5.0", "Content": "I did a lot of research on the LCD TVs and decided to go with the Sony due to my previous good experience with Sony products and the high ratings on this product.  Out of the box I had trouble seeing the picture in bright conditions.  However after adjusting the backlight and contrast settings the picture is great in bright and nighttime conditions.  I also have a Sony receiver and blu ray so the the remote integration has been much easier than with other brands.", "Date": "January 31, 2009"}, {"Title": "my review", "Author": "William I. Kannawin", "ReviewID": "R3FNUJ9XZBTJNW", "Overall": "5.0", "Content": "TV works good...just a little slow in delivery...arrived in good condition...delivery man was friendly and helpful.", "Date": "January 20, 2009"}, {"Title": "Sony 52\" HDTV", "Author": "Kathryn S. Thomson \"MCT\"", "ReviewID": "R2QPDMGOHOWQPQ", "Overall": "5.0", "Content": "Once I settled on the Sony 52\" HDTV, I priced several sellers and found the Amazon price to be very competitive. However, what clinched the sale was the home delivery and set up (complete with removal of all packaging). The whole process worked to perfection, with the television arriving in a timely manner and the set up team doing an excellent job unpacking the set and placing it into operation. The television itself is a marvel and works especially well in a room that receives a fair amount of sunlight during the afternoon. Needless to say I'm well-pleased with my purchase and the sales process.", "Date": "January 18, 2009"}, {"Title": "In time for the digital tv switch, and way to go Amazon!", "Author": "LawyerMom", "ReviewID": "R3I2RBHJZ3RQNJ", "Overall": "4.0", "Content": "My parents have been looking to replace their 20 year old big screen television for awhile now and took advantage of my being around for the holidays to purchase the Sony Bravia W-series 52 inch lcd tv so that, lucky me, I could set it up for them.  I will mention that this TV is being used solely for free, over the air digital broadcasting and not for cable or satellite TV, so I will review it as such.First, Amazon was, well, amazing.  We purchased the TV on the Friday afternoon after Christmas, told it would arrive between Jan 6 - 15, but actually received it on New Year's eve, less than 3 full business days after ordering it!  Amazon's delivery contractor was excellent, their tracking system was on top of the order from beginning to end, and they had two guys bring in the television and help set it up on our tv stand.  Score.  After getting a good look at the size of this TV (it's like the size of 2.5 of me!), it is not the sort of thing you would want to load into your car and try to bring home on your own.  This is not even to mention that Amazon's price was at least $300 below the local big electronics retailer (that's not even including the tax I would have had to pay).Set up was brilliantly simple (which is good, b/c I'm a moron when it comes to electronics).  My parents don't speak English, so I was pleased to see that once setup was complete, the TV pretty much worked itself.  I set the TV up with the new Sony bluray player we got using an HDMI cable (Amazon's prices, again, the best for those cables); hooked up our very old vcr with the old analog (3 pronged, red, yellow, and white) cable; hooked up the old rabbit-ear antenna (relieved I didn't need to buy a new one); plugged all these pieces into a surge protector and ta-da! It worked!  I also love love love how the TV instantly detects the external components, so you can put in a videotape, DVD, or bluray disc and push play, and the TV will automatically go to your external device.  (This is good, again, for the electronically challenged among us.)  I should add that there are 4 HDMI outlets on this TV, a PC outlet, and room for at least 4 analog components.Lots of features on this guy:  auto-sensor for ambient light; excellent speakers; Bravia sync which synchronized the TV to our bluray player so they turned on/off in unison; free TV guide programming; power saving options; etc. etc. etc.  Unlike another reviewer, I actually really like the remote control.  It's incredibly user-friendly.  The only thing I would change is that the home button and circular trackpad be moved to the bottom and the channel & volume buttons be moved to the middle.The picture is good.  I think, though, that I was expecting a lot better.  There is still some evidence (or more evidence than I'd prefer) of pixelation despite all the fanfare regarding the 120Hz and digital signal.  Potential buyers should take care in picking the appropriate sized TV for their room, as this will only emphasize the pixelation if you get a TV too large for your space.I don't know if this is something that will get ironed out in the future, but the letterboxing (i.e. the black bars on the sides or on top & bottom of the program being viewed) is kinda annoying.  You can switch from channel to channel or even (when on the same channel) from program to program and you'll see different variations on the letter boxing.  I was watching the local news which had no letter-boxing, then they'd run a commercial that had letterboxing on the sides of the screen, then the next commercial would have letterboxing on both sides AND on the top and bottom of the screen, etc. etc.  Sony made it easier to deal with this with the simple touch of the \"Wide\" button on the remote, but you have to adjust it with every single program and/or channel.  It would be nice if there were some way that this was fixed universally or if Sony could have automatically adjusted the picture to the perfect zoom.  (Sigh, maybe I ask too much.)  As I said, perhaps this will be ironed out once the networks adjust to only digital signals.Very happy with the purchase and I think you definitely get your money's value with this tv.", "Date": "January 3, 2009"}, {"Title": "White Glove, Waste of Time, Great TV.", "Author": "M. Mills \"UK Mike\"", "ReviewID": "RYXHK9PSFKIB2", "Overall": "5.0", "Content": "I waited until this TV was in stock with Amazon.com rather  than buy it through an Amazon Vendor. The reason being I wanted to take advantage of the White Glove Delivery. My advice to you is dont waste your time. if you are going to buy this TV then get it from the cheapest source which is most likely  Amazon, however dont have to high expectations on White Glove delivery. I was originally told delivery would be before Christmas, however I had phone call Christmas Eve and was told delivery could be 12/27 at the earliest. When the  guys showed up they took it out the box and plugged in the Power That was it. They were in the house 6 minutes. If you struggle with HDMI cables, Surround System etc you might want to consider Geek Squad or a local vendor for  set up although it is vry easy .TV is Fantastic though and outways by far the poor attitude and actions of the delivery company.", "Date": "December 30, 2008"}, {"Title": "Great TV from Sony!", "Author": "R. A. Meinhard \"tech guy\"", "ReviewID": "RU2G6RVI1BYYM", "Overall": "5.0", "Content": "This TV truly delivers - great picture, great looks, 120 Hz and a matte screen, which was an important factor in the decision.  Looked at the  Samsung 650 (screen was too glossy for our situation) and the Samsung 630, but the Sony was on sale and had just as good a picture, to my \"subjective\" eyes...  Also gave serious consideration to the Sony 52\" XBR6, but just couldn't justify spending the extra $600 - I bought a new Denon 2309 receiver with the money I saved!  Very happy with the purchase!", "Date": "December 30, 2008"}, {"Title": "BEST CHOICE EVER", "Author": "David N. Douglas \"Dave\"", "ReviewID": "R2YT6B48W5NL87", "Overall": "5.0", "Content": "I looked for 6 months and finally decided with consumer reports reporting this as a great tv I took the credit card and ordered it...WONDERFUL AWSOME. I have been a TV TECH for 20 yrs was concerned with the blur of a lcd but with the 120 hz blur circuit there is no blur.... and I would say the search is over...ENJOY", "Date": "December 12, 2008"}, {"Title": "Very Happy!", "Author": "Dawn R. Hadley \"MN Dawn\"", "ReviewID": "R1OX9RJEYPL2FD", "Overall": "5.0", "Content": "The TV is awesome! Amazon is great to deal with. Not much more a person can say!", "Date": "October 21, 2008"}, {"Title": "So upsetting", "Author": "Matthew Yates", "ReviewID": "R3I7NP8499RFKD", "Overall": "1.0", "Content": "I bought my tv on April 19th last month.  The picture was beautiful for four days, then these lines appeared and would not go away. In the menu, there is a customer support number, I figured I would need to just reset the tv to make the lines go away. The lady walked me through it and nothing happened.  She said a service technician would have to come out and look at it. The service guy came out the next day and determined the panel was bad and needed to be replaced. I contacted the store I bought it at and they informed me they do not have any and wont be receiving any more of the 52w4100's.  They offered me a store credit, but I would still have to come up with $600 to get the xbr.  My friend works at a service center and he reassured me that it would be like brand new if they changed the panel. I felt comfortable about having it changed. It took another two weeks for the service man to get the parts in and an available service time for him to come fix it.  He arrived, changed the parts and nothing happened. Sony sent bad parts. Before, there were lines in the tv, but it could still be watched. Now, I cant even watch it.  He called sony right away and they told him they would call me in two days to inform me of the exchange policy.  Two days later they called and first offered to upgrade me for $400 to a tv that is $200 less than mine on their own site.  Then they told me they could only send me a refurbished one, that they didnt have any new ones and it will take 19 days for it to get to me.  That was very upsetting. I called customer service back and asked them why it would take so long and that they have new ones in stock on their site that ship the next day. The picture was beautiful for 4 days. If I could do it again, would buy a samsung.", "Date": "May 11, 2009"}, {"Title": "Defective upon receipt", "Author": "Timothy D. Williams \"T Williams\"", "ReviewID": "R15KFOBYWU0II", "Overall": "1.0", "Content": "This TV arrived defective upon receipt.  The box looked flawless, but it was dropped or something went wrong somewhere.  The screen would blink in and out.  Audio generally worked, but would not occassionally.  Contacted Sony hotline.  Did some gymnastics and convinced them the TV was set up correctly.  Got permission to use local service company for warranty work.  Needs new LCD panel and board.  Parts out of stock.  This is the 5th week and no TV yet.  I hope this is extremely unusual as I have had good luck with Sony in the past.UPDATE:  1 part arrived when promised.  2nd still on back order.  Called Sony.  They elevated the case and offered a new TV in replacement.  I said fine.  10 more days and the new TV arrived.  In total it was 6/7 weeks.  New TV is working great.I could have returned the damaged TV to the vendor, but they charge freight even for damaged returns on TV's over 27\".  Would have been faster, but I didn't see why I should pay any additional costs.I am happy with the new TV.  My rating reflects the repair experience with Sony.", "Date": "November 3, 2008"}, {"Title": "Amazon's poor pricing, or, how to lose 300 dollars in 30 days", "Author": "M. Blubaugh", "ReviewID": "R3OUEECO1O5HAC", "Overall": "4.0", "Content": "The television is great with numerous settings to customize your viewing experience.However, I had been price watching this television for over a month until I finally decided to buy it. 30 days later, the price had dropped 300 dollars and after talking with Amazon about this, they essentially told me that it was too bad.I understand it's the nature of electronics to quickly drop in price, but 300 dollars in 30 days is outrageous, particularly when Amazon couldn't care less.", "Date": "March 11, 2009"}, {"Title": "So far so good!", "Author": "Daniel R. Garcia", "ReviewID": "R3VN8EWEXHF2E0", "Overall": "4.0", "Content": "Excellent,Easy to purchase,Safe shipping,Easy set-up,Great picture,Exvellent audio,Please send info on extended warantee!!!D. Garcia", "Date": "April 13, 2009"}, {"Title": "52 inches Sony Bravia W series TV", "Author": "P. Luu \"Microman\"", "ReviewID": "RY3LNSBY5WR8Z", "Overall": "4.0", "Content": "This unit displays sharp image. However, the background scene is dimer than a conventional CRT TV. The sound system is aquedate for normal viewing. One can add surround sound via their stereo amplification system.Overall, good TV with easy to operate remote control.", "Date": "March 2, 2009"}, {"Title": "Assembled in USA", "Author": "J. Callanan", "ReviewID": "R3VFIVEX4BHG38", "Overall": "5.0", "Content": "A friend of mine recently bought this television and I hooked it all up for them. When I was behind the TV I couldn't believe it... The manufacturers tag on the back said \"Assembled in USA\"This was shocking that of all brands, SONY actually was assembling this product over here. I will certainly be looking into this set. The picture quality is stunning, has all the inputs one would need, and it's assembled in the USA! I've never been a Sony fan, but this really makes me rethink that.", "Date": "February 25, 2009"}, {"Title": "Great TV", "Author": "hopskipper", "ReviewID": "R1QBROBNH6A65W", "Overall": "5.0", "Content": "The 52\" Bravia is my first flat screen HD LCD and I am very pleased with it. I was about to go with the Samsung but the shiny glass screen was too reflective and the styling wasn't very good. This Bravia keeps the looks simple, it has a thin glossy black edge with a non-reflective screen that looks good even with lots of light in the room. It was very easy to unpack and set up. I'm still not sure if the motion enhancer is really worth anything. I have yet to get a Bluray player to see the full potential of this tv. I can say that regular DVDs running on a PS2 look great. The only HD I've seen so far is the free HD channels on Comcast which look really clear. I installed a low-profile wall mount and it looks beautiful up on the wall.I was hesitant to buy such a large electronic device from Amazon but decided to give it a try after all of the good reviews. They delivered very promptly and the package arrived in perfect condition. I recommend going to a store to actually see the TVs in person then buy it here.", "Date": "February 20, 2009"}, {"Title": "Awsome TV", "Author": "R. Merriman", "ReviewID": "R2NJ93EB1X86LP", "Overall": "5.0", "Content": "The TV is great.  What a picture.  If you are new to the HD world, check with your cable company to see what the interface is.  With Time Warner, I could not make use of the TV Guide functionality and had to settle for the clunky Time Warner guide.  Having the cable box handle the channels is not optimum.  When you get by the cable interface, the performance is great.", "Date": "February 20, 2009"}, {"Title": "Sony TV", "Author": "James E. Nolen, Jr.", "ReviewID": "R6TU9MNIOQAAW", "Overall": "5.0", "Content": "Have been very pleased with the recent purchase of the Sony 52 inch TV.  It was delivered right on time, unpacked by the carrier and set up.  Have had no problems with it and it has a beautiful picture.  No complaints at all.", "Date": "February 14, 2009"}, {"Title": "Great picture for Sony series W", "Author": "Jay Blumberg", "ReviewID": "RP0HPDEO3V9NQ", "Overall": "5.0", "Content": "The Sony 52\" series W delivers outstanding picture quality and sound. Really no need for surround sound. HD channels are superb.", "Date": "January 30, 2009"}, {"Title": "great tv", "Author": "Internet Shopper \"Tim\"", "ReviewID": "R3UIM65C3C3ZS3", "Overall": "5.0", "Content": "This tv was purchased for my dad.  Arrived fairly quickly.  Good quality and sharp compare to my toshiba 52\".  The screen output is very clean.  No fading or ghosting when watching movies.  Did not get to play around with the setting yet, but think the qulity is good enough.", "Date": "January 27, 2009"}, {"Title": "Sony Bravia", "Author": "Harold L. Eder \"HD Nut\"", "ReviewID": "RJQGPWPVKM7SC", "Overall": "5.0", "Content": "This TV was everytihng I had hoped it would be and has exceeded my expectations. It looked great in the electronics stores and even better in my living room. The delivery was super quick.", "Date": "January 26, 2009"}, {"Title": "Excellent Purchase", "Author": "JC", "ReviewID": "R39BL2AFAPLI4B", "Overall": "5.0", "Content": "The TV arrived as promised and was in good condition. I am very pleased with the purchase.", "Date": "January 17, 2009"}, {"Title": "INITIAL REVIEW AFTER 5 DAYS OWNERSHIP...SONY BRAVIA W SERIES 52 INCH", "Author": "James Karam \"Jim...car nut\"", "ReviewID": "R3L7MVIXI1R3F", "Overall": "5.0", "Content": "Thought I would give our first impressions of this 52 inch Sony LCD.  The White Glove delivery through Amazon was very good.  We elected to keep all the packing and box just in case the set had an issue.  So far, no problems.  The set came with the stand already assembled.We had previously prepped the wall over the fireplace to mount this unit.  We did, by the way, purchase a Cheetah Mount for $35.00 and change with $10.00 shipping.  Those in store (Circuit City, Best Buy, ABC mounts for $200 + dollars are just way to expensive (read this overpriced!) in my book.  We were very impressed with the construction and design of this wall mount which is rated up to 180 lbs.  This new set comes in at 71 lbs.DO purchase your cable connections as well as wall mounts through the internet.  Just a ton of money to save and very quick delivery.  E.G. 2 HDMI gold tipped 10 foot cables for $3.99! + shipping.But, I digress.  We came from a 46 inch Analog rear projection Hitachi.  Purchased it brand new in 1997 and spent, cough...$2,200!!  That set has performed flawlessly and is presently in our sons and his familys great room.  This state of the art flat screen just jumps at you, almost 3d ish.  Im sure you folks out there who have migrated to this flat screen technolosy in the last few years would not be as impressed as we are (going from an LCD from 3 years ago to this unit today).I did a lot of research on these flat screens and had narrowed it to the SAMSUNG equivalent and this unit.  The reviews for this unit on the AMAZON web set were very helpful and is one of the reasons I wanted to post our impressions.  We lucked out on the money saved by watching for promotional codes in electronics on AMAZONs site.  Our total cost for this set, with NO shipping or sales tax, was $1,599.99!A site we found very helpful had to do with CALIBRATION of this set by users like you and I.  Here it is[...]Be sure to read through this whole calibration topic as other users have provided their settings.  To some degree this is subjective as the sets environment will affect your ultimate viewing pleasure.After letting our set run with its factory default settings for the last 5 days, I felt that I needed to tweak the blacks on our set.  My son thought that the blacks (night scenes) lacked definition.  So, I adjusted the settings to mirror what OFF_ONLINE posted at the above web site.  The only change to his settings I made was to increase the backlight from 50 to 70.  Im leaving these settings in place for a while to see how the set reacts to daylight running and in 480i mode as well.We DO like the matte finish of the screen.  The set is mounted in an unlit area over the mantle that faces out towards a row of 3 sets of windowed french doors.  As you can imagine there is a lot of natural light that flows directly at this set.  That matte finish just mutes the glare.  A big plus for this set.All in all, this 1st impression of 5 days ownership, is a big PLUS!Jim & Mary", "Date": "January 14, 2009"}, {"Title": "Sony 52\" LCD - Excellent", "Author": "J. Lewis \"beach bum\"", "ReviewID": "R2HETAQIHH8EX3", "Overall": "5.0", "Content": "After waiting two years to save, and then researching all the options, I chose the Sony 52\" LCD W4100, which was an excellent choice.  I read many reviews on Amazon and Consumer Reports, plus many trips to different stores to look and test.  I just purchased this TV (Nov 2008), and have had no problems.  The picture and sound is awesome.  I looked at the other options: Samsung, etc, and they were good too, but in the end, I chose the Sony.  I will add one note about the Samsung touch of class model.  I was very close to purchasing it b/c it was $200 cheaper.  However, when I compared the volume, I discovered the speakers on the samsung pointed down, and it did not sound very loud at the maximum level.  When I checked the volume on the this Sony, WOW, awesome, excellent!!!  That was the only difference and main reason I went with the Sony, plus the normal quality of Sony.  I recommend a Blu Ray player (which I purchased with my TV) if your a movie buff, like me, it is amazing picture, and well worth the investment.", "Date": "January 4, 2009"}, {"Title": "Great TV", "Author": "Gregory Peschka", "ReviewID": "R3QRGN9PSKLPIL", "Overall": "5.0", "Content": "This TV is everything they said it was. Terrific picture that depending on the show makes you feel like you could reach through the screen and touch it! Easy to set up and switch between add ons. I am 100% satisfied with this product.", "Date": "December 30, 2008"}, {"Title": "GREAT T.V.", "Author": "K. Burklew \"shovel rick\"", "ReviewID": "R3BZAVJV6P070L", "Overall": "5.0", "Content": "perfect picture,be sure to get H.D.M.I. cord with it, be sure to have H.D. subscripstion", "Date": "December 17, 2008"}, {"Title": "Sony Bravia W-Series KDL-52W4100 52-Inch 1080p 120Hz LCD HDTV", "Author": "Maycon", "ReviewID": "R1ARI8UXOKFSZY", "Overall": "5.0", "Content": "Amazon's services is excellent.Great product and good price too. I will recommend to friends and others.", "Date": "December 12, 2008"}, {"Title": "52 inch Sony HDTV", "Author": "Lewis C. Thomas", "ReviewID": "R2AEF8G2UM87JK", "Overall": "5.0", "Content": "Excellent HDTV,worked right out of the box!  Shipping was very prompt. I received it in three working days, WOW. Monday Night Football at it's best!!!", "Date": "November 9, 2008"}, {"Title": "Great TV!", "Author": "S. Avnet", "ReviewID": "RHN5HD6C3OL5Y", "Overall": "4.0", "Content": "Great picture, very good sound(for an LCD).  Fantastic price on Amazon compared to any retail store and CEVA was fast and professional with their delivery, placed the TV exactly where I wanted it, helped to hook up the TV and stayed around until everything about the TV was checked out.I was highly pesimistic about ordering such a large, expensive TV through amazon and having it shipped, but everything went smoothly and I would highly recommend it for anyone else.CONS:TV is pretty slow whenever switching video modes (cable to DVD)and also has a lengthy delay whenever swithcing from a HD channel to a non-HD channel.", "Date": "February 12, 2009"}, {"Title": "Great Replacement Choice", "Author": "Frank \"Frank\"", "ReviewID": "R10CPKTH4JAJUB", "Overall": "5.0", "Content": "I originally bought the Samsung LN 52A650.  On/off problem could not be fixed on the Samsung.  Got my money back from Samsung and purchased this set. There is no discernable difference between the two sets except the Sony turns on and off at viewers command, not at random because of some defective part.", "Date": "February 9, 2009"}, {"Title": "Very Happy Customer", "Author": "C. Webb", "ReviewID": "R1Q2FTNSKGCITZ", "Overall": "5.0", "Content": "Purchased TV after doing lots of research between Sony and Samsung.  Delivery was just as planned and set up was easy.  Really like the picture and fairly easy to learn all settings.  Thought Amazon's price was very reasonable.", "Date": "December 15, 2008"}, {"Title": "Home Entertainment", "Author": "Ryner 24 \"Weirdsmoke\"", "ReviewID": "RP3BDJLGNYCGH", "Overall": "4.0", "Content": "This tv has great quality, if I'm playin games, watching cable, DVD's or Bluray, it's excellent.", "Date": "November 30, 2008"}, {"Title": "52\" Sony W4100", "Author": "Larry G. Brown", "ReviewID": "R3JIAU58GN3AVA", "Overall": "5.0", "Content": "Received the TV in a week and the box was in perfect condition and nothing wrong with the TV from shipping as that was a worry to me that I would receive it damaged and have to do a return so I was happy and the carrier was very careful unloading it in front of me.....Thanks", "Date": "September 18, 2008"}, {"Title": "Don't Buy This TV or Any Sony", "Author": "David A. Ramos \"Dave\"", "ReviewID": "R2KQ4QZ942PPEY", "Overall": "1.0", "Content": "After two weeks, our TV developed a problem with the picture.  It had a sawtooth pattern on the top and white spots throughout.That was SIX WEEKS AGO!I've spent hours on the phone with Sony, their service departments, and Qualxserve, the company Sony outsourced service to.  Bottom line, our TV has still not been repaired.  Parts have taken weeks to arrive.  At first, they thought it was the video processing board.  Qualxserve replaced it, but it did not fix the problem.  They ordered a new display panel, but that won't arrive for several more weeks.When you call Qualxserve, there is never an available agent.  The system dumps you to an answering machine, but no one ever calls back.  I escalated to Sony directly, begging them to simply relace the TV, but to no avail.This is, by far, the worst experience I have ever had with a product or their service departments.  Do not buy this TV or any other Sony product.  I'm also not sure it was worth the savings to buy from Amazon.  I can't believe that Best Buy would do this to their customers.", "Date": "December 2, 2008"}, {"Title": "on time-perfect", "Author": "Venkatakris R. Jala \"kris\"", "ReviewID": "R13KRCHS3KLLU", "Overall": "5.0", "Content": "Sony Bravia W-Series KDL-52W4100 52-Inch 1080p 120Hz LCD HDTV is a good buy with sony blue-ray player, which came free along with tv.", "Date": "February 20, 2009"}, {"Title": "Great TV", "Author": "J. Hennis \"JenHen\"", "ReviewID": "R2P37RI8I7DVNQ", "Overall": "5.0", "Content": "We have had our tv for 2 weeks now & absolutely love it!! Amazon.com delivered & set it up for us & even programmed the channels. The tv has a very clear picture & we don't even have it set up for HD yet. I would recommend this tv & Amazon.com to everyone. This was the first major product I had ordered from them & have no complaints at all!", "Date": "February 9, 2009"}, {"Title": "Sony Bravia 52\" 120Hz", "Author": "SeeMeHere \"UseeMeHere\"", "ReviewID": "R36XJ8V18V78UM", "Overall": "5.0", "Content": "This seller are realy reliable and can be trusted, you'll be sure your staff will be delivered on time. I got my Sony LCD 52' TV and it was so great it works no problem easy to navigate all channel the Best TV I have.I'll give then 5 Star.Sony Bravia W-Series KDL-52W4100 52-Inch 1080p 120Hz LCD HDTV", "Date": "February 6, 2009"}, {"Title": "superb picture awesome sound", "Author": "Bhawani bhojwani \"we love sony\"", "ReviewID": "R5VQ7A0PCV5AE", "Overall": "5.0", "Content": "we bought this tv after a bit of research and sony never fails ,its upto the expectation.and amazon delivery was on tme.", "Date": "February 6, 2009"}, {"Title": "Great Value", "Author": "GS", "ReviewID": "R24SRHTWBEEMUH", "Overall": "5.0", "Content": "Ordered this with hopes it would arrive for the Superbowl (10 days before the big game and estimated to arrive the Friday before) and was surprised when it arrived 4 days early. Freight guys verified delivery the night before, and they were great, carried in the new set and had it set up in just a couple of minutes.Should also mention that if I felt it worthwhile I could have easily bought the XBR, but after considering everything I wanted the set to do, and doing an in-store side by side comparison, I figured it was better to pocket the extra cash. Better yet, got free shipping, free set up, no tax, and.... saved more than $500 over what a friend paid only one month before at a local store.And the picture? To be honest, bought this for the resolution in bluray movies via a Sony 350 unit, but, as mentioned also wanted to watch the Superbowl on it. The local channel here via satellite dish is SD but hooking up an old pair of rabbit ears, rescued from the basement, brought in the station's digital HD signal...  Wow, the clarity was phenomenal and the 120Hz resulted in no discernable blur. Not much of a couch potato in the summer, usually too much to do outdoors; however, that said, looking forward to watching a little golf and baseball on this later in the year as well.Don't usually write product reviews, but was so impressed with the transaction and the product that I felt it was warranted in this situation.", "Date": "February 4, 2009"}, {"Title": "Bravo for Bravia!!!", "Author": "T. Lepisto \"Tom Lepisto\"", "ReviewID": "RNTHFSQBYFXXG", "Overall": "5.0", "Content": "Purchased the 52\" Sony from Amazon, was going to buy one @ Sam's but they changed models, this was the upgraded one, plus it was a better deal.  Great Service and delivery, plus I purchased the Sony Sound Bar DVD and the IPOD Dock, It's hung on the wall over my fireplace with the Soundbar underneath. What a system, it automatically selects the input device, functions are controlled by Sony Remote (Except for Direct TV, (bummer)) But I rate this 10 out of 10, and Amazon is the BEST, the other stores do not compare!!!!", "Date": "December 14, 2008"}, {"Title": "shaff from florida", "Author": "Shaffie Mohammed \"SHAMM\"", "ReviewID": "R36U1D403KQMKH", "Overall": "5.0", "Content": "FIRST THANKS TO AMAZON.COM YOUR SERVICE WAS OUTSTANDING THE DELIVERY WAS QUICK.THIS TV IS,A  WOW,THE PICTURE QUALITY IS GREAT SPORTS UNBELIVABLE FRONT ROW SEAT EVERYTIME.", "Date": "December 12, 2008"}, {"Title": "sony kdl52w4100", "Author": "Terri L. Hill \"todd hill\"", "ReviewID": "R4HSNB1QHWKLE", "Overall": "5.0", "Content": "simply awesome, that says it all. I researched many tv's and the reviews I read on this tv helped me in making up my mind in buying it. All the positive reviews were dead on. No negatives as of yet.", "Date": "December 12, 2008"}, {"Title": "Fantastic Purchase!", "Author": "Katherine J. Walker \"Mimi\"", "ReviewID": "R23LVJCMEC7VR8", "Overall": "5.0", "Content": "The picture on this TV can't be beat!  The only complaint is it seems to \"skip\" every so often but I'm not sure if it is the TV or our cable lines! But it doesn't matter--I love the TV", "Date": "February 10, 2009"}, {"Title": "Great product by sony", "Author": "Eng Saar Bibla", "ReviewID": "RK1X1LZDMBEL7", "Overall": "4.0", "Content": "I'd start with why I gave only 4 star. Well, the product was supposed to arrive on the 8th, but it arrived the day after. When there's no other TV at home, it makes a diffrence.The TV itself has great picture. I find that you have to readjust the picture, as it is set for a store with lots of light, where at home usually this is not the case. So either use vivid, or use custom.Sound is brilliant, and the menus are quite easy to get the hangon.", "Date": "January 6, 2009"}, {"Title": "Bait and switch", "Author": "Amazon Customer", "ReviewID": "R2WW3OVRE5YUQ2", "Overall": "1.0", "Content": "Been a dedicated Amazon shopper for years, now until.....Ordered this set and Blue Ray package, on the web site for a good price, thought was a fair amount, not a crazy deal like a software malfunction that dropped the price of the TV dramatically.Got an e-mail next morning stating that they canceled the order due to \"incorrect pricing\" of the TV, so I canceled the entire order.If AMAZON PERSONEL are reviewing this/these opinions; FYI canceling a large order just for a few extra bucks and pissing off a dedicated shopper, in this economic environment, is a dumb thing to do.", "Date": "March 3, 2009"}, {"Title": "noise from inside of this new tv kdl-52w4100.", "Author": "Steve Tong \"snowy\"", "ReviewID": "R38U74S8URW1YK", "Overall": "2.0", "Content": "Bought this new tv kdl-52w4100 last Dec.Popping noise come most likely from the heat causing plastic structure contraction. Has Sony's svc came by different techenicians twice so far. First one opened the back cover and put it back, he said it should work. But, if it does not, then no way to fix it. It did not work. So, called another svc guy. He showed up and adjust the \"picture\" to lighter brightness. He said that way won't consume too much electricity and less heat will be generated which will help. It did not help.This popping noise is so annoying when you are concentrating to watch program.Is anyone experiencing this problem. Otherwise, it's a very good tv.", "Date": "March 12, 2009"}, {"Title": "No discount here", "Author": "Kevin N. Sharp \"kevster\"", "ReviewID": "R80M8ILWQTR3D", "Overall": "5.0", "Content": "This TV is promoted as on sale.  Thats not the case.  You can buy cheaper elsewhere.  Why are internet vendors doing this? TImes are hard and they try to spoof a fake discount.Bah Hum bug", "Date": "December 29, 2008"}, {"Title": "Good TV, Terrible Customer Service from Sony", "Author": "Craig Dickson \"Independent Software Consultant\"", "ReviewID": "R2IMJT4IX8YQ96", "Overall": "1.0", "Content": "I purchased this TV through Amazon.comDuring the process of setting up the television at my house the tiny strap on the back of the table-top stand that is meant to be used for bundling up all of the cables fell apart in my hand when I tried to unsnap it for the first time. It is a tiny piece of plastic about the size of a large rubber band. Clearly this part is fragile at best, but it came apart into 3 separate pieces when I first touched it. It was clearly defective.I contacted Sony customer service on their \"Customer Service\" hotline (1-239-768-7547) and after being on the phone for over 30 minutes I was told that Sony would not replace the part, but I could have the privilege of paying $2.25 for the part and another $6 for shipping via UPS.They even had the audacity to try and blame the white-glove shipping company that Amazon.com used for breaking the part.So if you are counting that's $8.25 for a tiny piece of plastic (which probably cost 10c to manufacture), that was defective when I received it, on a television worth over $1,800 when I bought it.Poor form Sony, you just lost a customer who owns 2 previous Televisions, a Camcorder and a DVD player of yours.So my recommendation is to not purchase anything from Sony unless you are OK receiving this kind of customer service.", "Date": "April 6, 2009"}, {"Title": "Who Pays for Amazon's Pricing Mistake...the Customer of Course!", "Author": "Steelers Fan", "ReviewID": "R115MCGTX51RYA", "Overall": "1.0", "Content": "I have always been pleased with my shopping experiences at Amazon until today.  Yesterday, I purchased this television at what I thought was a good price, considering it will soon be replaced by a newer model.  This morning I received an e-mail (see contents below) indicating that my order has been cancelled due to an incorrect price.  I had an order confirmation for a price of $1431.20.  The currently posted price is now $1649.98.  That's over $215 difference.  Needless to say, I called customer service and ended up talking to the clueless, brainless robot Izhe C.  All she did was recite the contents of the e-mail, and even after admitting Amazon made a mistake, said there was nothing she could do about it.  She went so far as to mute the phone and not even listen to what I had to say.  Normally, you pay when you make a mistake, but not when you're Amazon.  They think it's a great way to cover their a** by cancelling orders and making the customer pay for their alledged pricing mistakes.  I wonder what would have happened if I ordered the TV, then called the next day and said \"I made a mistake, I don't have as much money in my bank account as I thought\".  Would they allow me to cancel my order with no penalty?  If this is the way they choose to treat their customers, then not only have they cancelled this order, but any future orders from me as well.E-Mail Contents===============Greetings from Amazon.com.We regret to inform you that an error caused the following item(s) tobe displayed at an incorrect price:Sony Bravia W-Series KDL-52W4100 52-Inch 1080p 120Hz LCD HDTVIn accordance with our posted policies on pricing, we are unable to offer this item for the incorrectly posted price. Therefore, we have cancelled your order for this item.At any given time, despite our best efforts, a small number of the millions of items on our site may be mispriced. We do, however, verify prices as part of our shipping procedures. If we discover that an item's correct price is higher than our stated price, we will, at our discretion, either contact you for instructions before shipping or cancel your order and notify you of such cancellation. This policy is posted in the Help section and is accessible through numerous other areas of our web site.We apologize for any inconvenience this may cause.We value your business and hope that you will give us a chance to serve you again in the future.Sincerely,Customer Service DepartmentAmazon.comPlease note: this e-mail was sent from a notification-only address that cannot accept incoming e-mail. Please do not reply to this message.", "Date": "March 3, 2009"}, {"Title": "Another Victim", "Author": "Patrick Mcghee", "ReviewID": "RKVC1M1M8VRN0", "Overall": "1.0", "Content": "I'm not going to repeat what the others have said. I will only say that it has been confirmed that a few people actually received the TV at that $1461 price. That is what makes me upset the most. I don't understand why my money is any different.", "Date": "March 3, 2009"}, {"Title": "what a joke", "Author": "E. Preston", "ReviewID": "RVQKNNLG6IF2G", "Overall": "1.0", "Content": "We ordered this product from Amazon after some careful online shopping for what seemed like a comparable deal to other offers.  Authorization was put on our credit card and we were looking forward to our new TV!  Only we were told told a day and a half later that the product was not available for the price advertised by Amazon (i.e. they didn't want to sell it for such a low price afterall....)  The order was removed from our account, but the hold put on our credit card remained for days afterwards.  Amazon shouldn't be able to retract an offer like this - in the time it took for us to order the tv and be told it wasn't available we missed out on the same deal online elsewhere.  Very disappointed.", "Date": "March 3, 2009"}, {"Title": "Another EXTREMELY disappointed Amazon customer", "Author": "maxjackdaniel \"mjd\"", "ReviewID": "R1IR73ML6RTHU7", "Overall": "1.0", "Content": "Same ISSUE with Amazon - ordered for $1431 and the next day got a cancellation email...to top it off - I know for certain the same TV was shipped to other customers - a credit (ranging from $20-30 towards next purchase) was offered to other customers for this trouble - when I asked for the same credit - was denied...in addition to that Amazon still has to reverse charges on credit card", "Date": "March 3, 2009"}, {"Title": "Buyer Beware!", "Author": "James V. Eulo", "ReviewID": "R2YUB32PKG4ZLA", "Overall": "1.0", "Content": "I wrote a previous One Star review which never appeared regarding my attempt to purchase the Sony 52 inch W Series HDTV.  I ordered the TV at $1431.00, gave my credit card information and received a purchase confirmation and expected date of delivery.  The very next day, like others, I received an email advising me that they had canceled my order, and referring me to their Policy section.  Now I've noticed that this very same HDTV price remains stuck at the same price of $1649.00 without changing from day to day like it did before.  I find that peculiar.  Needless to say, I am extremely unhappy with Amazon.com and the way they've handled this so called error.  BUYER'S BEWARE!", "Date": "March 3, 2009"}, {"Title": "Bad Business", "Author": "W. Hudgins \"Redsox Fan\"", "ReviewID": "R13X2WAGLSSU0P", "Overall": "1.0", "Content": "Waited a long time to get a good lcd tv. When I saw the Amazon price for the Sony kdl-52w4100 120hz lcd I jumped on it. I received a confirmation email and shipment date right away! Next morning an apology from Amazon : NO CAN DO!! I believe once I got the confirmation email with the price and delivery date, they should have kept their word!!", "Date": "March 6, 2009"}, {"Title": "The Heat is On!", "Author": "Dr. BT", "ReviewID": "R16MQVABRADXFL", "Overall": "1.0", "Content": "Excellent picture quality 5/5 stars...makes most Blu-Ray movies look like it was recorded from digital camcorder.  Games on my PS3 or XBox360 looks fantastic. Here's the big but...Within an hr the tv is on...room starts getting hot.  Its a noticeable source for heat...like a little furnace.  On top of the TV gets real hot with heat blowing out of it and the whole tv feels hot...so if you're putting this in a non-circulatory entertainment room you will feel it.", "Date": "August 29, 2008"}, {"Title": "Outstanding!", "Author": "Stephen Millsap", "ReviewID": "RQEMG87A2S7MO", "Overall": "5.0", "Content": "I wanted to find a LCD that met my expectations.  This new Sony with the 120HZ is fantastic.Great TV overall.  No problems at all.", "Date": "May 28, 2008"}, {"Title": "Amazon Sucks!", "Author": "John Young", "ReviewID": "RKRE4VKCFLA23", "Overall": "1.0", "Content": "I ordered this TV from Amazon and canceled my previous order from another vendor, the next day I received an email the next telling me that Amazon has canceled my order. Now my other order is gone because the sale was over. This is not the first time Amazon did that to me. Buyer, beware!", "Date": "March 9, 2009"}, {"Title": "Do not see what all the hype is about.", "Author": "T. Jones \"The Tool Man\"", "ReviewID": "R1FISEKGF4LEXE", "Overall": "3.0", "Content": "I bought this TV about a week ago.  I have a seven year old RCA tube TV that has as good of a picture as this one.  It's all right, I guess, but with all the ravings about this TV, I thought I was really getting something.  Maybe it's because I don't have high def...?  For over the air analog broadcasts the picture is actually worse.  Yes, I know we'll not have those in a few more months.  The digital picture seems \"jerky\" to me and the remote must have been designed by someone that never uses a remote.  The volume and channel buttons are at the very bottom of the remote instead of being in the middle.  It's not comfortable to use since the remote is not balanced in your hand.  Also it ONLY controls the TV.  You'd have thought with a $3000 TV, they'd supply a universal remote... sorry.  If you have satellite, you will have to use your satellite remote to turn on the satellite box and change channels and your TV remote to use the TV.  It's like going back in time.  If you have high def. cable, you'll have to use your high def. cable remote to control your cable box and the TV remote for the TV.  I did get the satellite remote programmed to work some parts of the TV, such as volume, channels and input, but that's all it will do and you must still keep the TV remote to do anything else.  I thought maybe I was not seeing how to program the remote for other devices so I checked with Sony and they said that I was correct that the remote only works the TV.  I'd give it another star if the remote was decent.  Too bad Sony, you dropped the ball on this one.", "Date": "July 3, 2008"}, {"Title": "RUN AWAY RUN AWAY", "Author": "Donald Keylon \"Captain\"", "ReviewID": "RX6LHB15E6AEY", "Overall": "1.0", "Content": "What a total farce, Blu ray beats HD.... HDMI Cables?? Compatibility???$4500 dollars for NOTHING!! OK so I bought into the hype that Blu ray won the HD Race. I buy into the interoperability of SONY and THE hollywood ONLY serving HDMI Cable... I buy a new $3500 TV (Sony 1080P/24-52\") and a new Sony Blue Ray Player and a new BLUE RAY FILMED MOVIE for three TIMES the price of a standard DVD and put them together only to discover that I have black lines (letterbox) on my TV, The picture is a little worse than a standard DVD, the menu system works like a $27 VCR. The \"Interoperability\" between the Sony TV and the SONY BD works about like free air digital TV. And the Audio is like listening to a 3 transistor radio...What a total JOKE!! ANYONE CONSIDERING UPGRADING TO ALL THE \"NEWEST\" because of ALL THE HYPE, Leave your money in your pocket. Go buy a cheeseburger and put the remainder in a 401k. When what you have breaks, get new average price stuff. When you pay all the big bucks for all the best you get NOTHING NOTHING NOTHING!Maybe someone else's BD/TV actually works (oh wait a minute, ALL BD is Based on SONY technology....)Sony (who made my PSP, PS3, Nav System, TVx5, BD Player and PDA has seen the last of my credit card.MY NEW $500 BD Player hooked up to my new $3500 52\" LCD TV, wants to operate in PAN-N-Scan mode in order to utilize the other 30% of the $100 per square inch real estate I bought from sony.I though Pan-N-Scan died with Beta Max....In closing, you would get the exact same experience (Maybe better with a $27 480i DVD Player, a $99 \"Home theater system\" and a No Name Rear Projection 50\" DONT BUY DONT BUY DONT BUY", "Date": "December 26, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "16:9 Full HD 1080p Resolution (1920x1080p) LCD Panel\nMotionflow™ 120Hz - clear, smooth motion for DVDs, TV\nDMex ™ compatible; allows seamless feature upgrades\nEnhanced XMB™ with 3D graphics incl. TV Guide\nHDMI™ x4, HD Component x2, PC Input", "Name": "Sony BRAVIA W-Series KDL-52W4100 52-Inch 1080p 120 Hz LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41dOn3QdNCL._SX300_.jpg", "ProductID": "B0017Q8B70"}}