{"Reviews": [{"Title": "How to Fix Audio/Video Problems", "Author": "Sean J Biehle", "ReviewID": "R2C6MF985UBAY2", "Overall": "4.0", "Content": "I agree with many of the other reviewers that this is a solid TV for the price.The sound and picture issues appear to be associated with the version of the firmware that ships with the product. You can upgrade the firmware rather easily by downloading the update (42pfl3704d_f7_fus_aen.zip) from the Philips Support site ([...]), loading the appropriate version to a USB drive, unplugging your TV and then plugging the USB drive into the available port on the side of the TV. When you plug the TV back in and power it on, the firmware will upgrade automatically.Direct link: [...]One final note, I tried to copy this firmware from a Mac to a USB drive and the TV would not recognize it. I advise to download the firmware to a PC and then copy to your USB.", "Date": "January 17, 2010"}, {"Title": "NO Warranty possible", "Author": "RockClimber", "ReviewID": "R1TQ3RSINN6TY2", "Overall": "1.0", "Content": "We bought the tv in January and have had problems ever since.  Without warning the sound instantly goes to a blaring static sound.  No voice or other sounds, just horrible static.  Picture remains fine.  We called Philips and they said we could trade our new tv for a \"refurbished\" unit.  OR we could get it serviced if we sent it to Bartlesville, OK (no service in OKC or Tulsa) or Denver, CO.  What good is a 1 yr warranty if there is no place to do warranty work or they will only send you someone else's headache.  Will do all I can to prevent others from getting ripped off by Philips.", "Date": "December 1, 2009"}, {"Title": "Service Issues Override Anything Else", "Author": "K. C. McInnis", "ReviewID": "R1MQ8OTF4ON2MN", "Overall": "2.0", "Content": "The same weekend I received my TV, it broke for the first time.  It would only display the Philips logo and never an actual picture.  After talking to their service center, it was going to take weeks to fix the problem.  Then, a couple of days later as I was deciding whether to return the TV or have it repaired, it worked again.  The same problem came up every few weeks and would take an hour or so of reset before working properly.Then, a couple of months after I bought it, the picture tube went out.When it worked, the picture and sound was fine, but what good is a TV that breaks a few days or months after you buy it?Nothing could convince me to buy another Philips product based on my experience.  I bought this TV based in part on the good reviews here, but I was very disappointed with my purchase.", "Date": "November 1, 2009"}, {"Title": "Greatest HDTV in it's Price Range!!", "Author": "C. Peterson", "ReviewID": "ROPRN37X0PW3U", "Overall": "2.0", "Content": "After doing alot of searching for a HDTV, I choose this model and brand.I orginally had purchased a Vizio 42inch 1080 HDTV for 699$, I then seen this tv at Target for the exact same size, most of the same specs, but some better!!!I hooked up the Phillips HDTV, and I must say it is EXCELLENT! The picture is much clearer, the design is more stylish, remote control doesn't feel cheap or look cheap compared to most tv's in it's price range.UPDATE - 3 years later the tv has stopped working. It won't power on, and only makes a buzzing noise, it. Was gear while it lated. Maybe I should have kept the Vizio, because at the time Phillips was known as a better tv brand, but as of today Vizio is ranked with the bigger brands such as Sony, Lg, Panasonic, Samsung and etc.", "Date": "May 8, 2009"}, {"Title": "Great TV - Found Remote Code That Works", "Author": "Anya", "ReviewID": "RPZ1CXCAF45MD", "Overall": "5.0", "Content": "This television's picture is crisp and bright, and the sound is clear. Against the competition currently out there, I'd say this a great buy for your money.For anyone experiencing problems programming their cable remote to work with this television, try placing a 1 before code 0054, meaning you should enter \"10054\". After extensive searching, this was the only code that actually worked.", "Date": "May 21, 2009"}, {"Title": "Just an all around great tv!", "Author": "D. Centers", "ReviewID": "R32V4AAMDPYWOQ", "Overall": "5.0", "Content": "I purchased my tv about four weeks ago and love it! I had no troubles setting it up and customizing it. The picture is far better than I had anticipated and the sound is pretty good. Of course, when I run it through my surround sound system it's like sitting at the movies. I love this tv!! I only paid $750 for it making it one of the best buys of my life. If you want to enjoy an excellent television that is simple to use, this is it!!", "Date": "August 7, 2009"}, {"Title": "Really poor customer service and warranty", "Author": "Roger L. Lloyd", "ReviewID": "R2UZEECNUNPYQS", "Overall": "1.0", "Content": "I have been waiting six weeks for a resolution from the warranty department at philips.  They have never called me back once.  Every time I call its another 2 to 5 business days to resolve the case.  Finally received a resolution today and they offered to give me 1/2 of the orginal purchase price.  Awful company.  Bad Service.  Poor customer relations.", "Date": "January 27, 2010"}, {"Title": "Dead in less than 24 hours!!!", "Author": "Eric N. Johnson \"jbj920\"", "ReviewID": "R4YK37PFF5NDE", "Overall": "1.0", "Content": "Bought this TV, set it up without many problems and watched for 1 hour.  Turned it on the next morning and watched for 1 hour, then tried to turn it on for a third time and there was NO PICTURE OR SOUND!!  There were only whitish/gray lines on the screen... absolutely no picture no matter what we tried.  It's hard to believe a TV like this would die in less than one day.  Will return it and will NEVER BUY ANOTHER PHILIPS AGAIN!!!  Back to Sony, where we know we're getting a quality television.", "Date": "March 4, 2010"}, {"Title": "HDMI Ports Fail", "Author": "DrWaites", "ReviewID": "R2059UBH9W8MOU", "Overall": "1.0", "Content": "Two out of 3 HDMI ports failed in the first week of ownership. I installed firmware update, and they worked for another week. Then, mysteriously, both failed again. Overall, this TV is not worth the hassle. I am going to return to the store ASAP and get a quality product. This is the worst consumer electronics product I have ever purchased.", "Date": "February 1, 2010"}, {"Title": "Don't waste your money!", "Author": "Buster Darr", "ReviewID": "R267QUOL1EW67V", "Overall": "1.0", "Content": "Bought this 2 years ago for around $600. For 1080p, the picture quality wasn't that great. Now, at 2 years, the backlight inverter is dead - have sound, but no picture, unless you shine a light on the screen. Don't waste your time calling Philips customer support to inquire about parts - they're about as helpful as a bikini in a snow storm. They could sell me a new remote, or refer me to their \"partner\" Encompass, who doesn't list the part as available, either. At this point, I'm trying to decide whether to pay nearly $70 for a new inverter and replace it, or just bite the bullet buy a new non-Philips TV.If you're still thinking about buying this, do a search for \"Philips 42pfl3704d/f7 black screen\" or \"Philips 42pfl3704d/f7 problems\", and if you do actually buy this piece of crap, don't complain that you weren't warned. Call me crazy, but I think that a $600 TV should last more than 2 years, and manufacturers that don't support their poorly-made products should be held accountable and forced out of business by attrition of their former customers.", "Date": "April 21, 2012"}, {"Title": "Works for 2 years then black screen", "Author": "Pissed in NY \"Nissy\"", "ReviewID": "R2SGPU6KJED97B", "Overall": "1.0", "Content": "\"If you purchase Philips tv's, you'll be sorry. They last 2 years then you get a black screen. Philips will claim that there's no issues with their tv's but if you google \"problems with Philips tv's\", you'll see all the problems with them after 2 years. I spent $1100. on a 42\" LCD and it lasted 2 years. They won't help me and to have a repair service look at it, it's $350.00 and they state that it will happen again. Wasted money that I can't afford. Don't say you haven't been warned.\"", "Date": "February 14, 2010"}, {"Title": "Change of Mind", "Author": "Gloria D. Crosby", "ReviewID": "R17GB7I8KNF8X3", "Overall": "3.0", "Content": "I received this television and in less than 24 hours the sound went out. I did contact Philips and they located a service man to come out and diagnose the problem, which by then had no picture as well as no sound. In all fairness, I must say that Philips told me from the beginning that if it couldn't be repaired, they would replace it or refund my money. I did contact the seller and asked if losing the sound was a existing problem to which they promptly replied and said no. I do believe them. I have also been contacted every couple of days by the seller to ask if I had received service and if the problem had been resolved. I must say that I was surprised to receive their response as I had assumed that once I purchased the television they would not bother to respond. I must say that the problem was never with the seller but I can only assume with the television itself. I was also refunded a substantial amount of my purchase price in a show of good business and professionalism by the seller. I can only emphatically say that I have had nothing but excellent dealings with the sellers I have purchased from on Amazon.com.", "Date": "November 16, 2009"}, {"Title": "Worked for 13 months - Now black screen", "Author": "C. Burch", "ReviewID": "R137V5AP1CWD2D", "Overall": "1.0", "Content": "Purchased the TV December 14, 2009.  Worked good, picture quality was just OK but was satisfied until today.  Exactly 13 months after we bought the TV and 1 month out of warranty the screen stays black.  I would not recommend this TV to anyone that wants a long lasting television.", "Date": "January 14, 2011"}, {"Title": "Issues but apparently resolved by Firmware Update", "Author": "J. Dingus", "ReviewID": "R2YWSKDTM1DLU9", "Overall": "3.0", "Content": "I've been looking for LCD TV's all of February, purchased a Sanyo from Walmar on 2/6 which lost sound and video after 15 days. Returned easily, thanks to Walmart's 90 day return policy. I'm leary of anything from HHGregg since they only have 14 day return policy or an extended warranty for $199.00! Best buy is 30 days return. I decided to stick with Walmart / Sam's club / Target for 90 day return. Found this at Target for $649.00. Got it home, powered it on, and ..... no signal on HDMI1,2,3, Video 1,2 or Cable. Mucked with settings finally rebooted and presto.... picture and sound. Turned off for the night, next morning... no sound on any. Muched with settings, reset etc. Nothing. I finally downloaded the firmware update from Phillips and that fixed the issue. I'm going to give it 30 days but will return it if I have any problems and go with a different brand.Features are good, picture and sound are great. No problem if they keep working.", "Date": "February 27, 2010"}, {"Title": "GREAT TV", "Author": "A. Stuckey", "ReviewID": "R4LIG2VGGXAMT", "Overall": "5.0", "Content": "My husband and I have been looking at LCD HDTV's for months. We have looked both on line and in stores. After reading many reviews, I considered thIs Philips to be the perfect buy. Also doing  additional reseach on his own, my husband approached me with his \"perfect buy\" which turned out to be the same tv.We noticed on Amazon.com that this tv was on sale at Target for  $699.00 with free shipping. After a quick trip to Target to physcially look at the quality of this tv, we found the $ 699.00 deal at the local Target store. We were so impressed with the quailty of this tv that we bought it.The price was right ...the tv is GREAT quaility!!!", "Date": "September 11, 2009"}, {"Title": "Superb TV", "Author": "VakarianGirl", "ReviewID": "R10BP7YHLFDY1Q", "Overall": "5.0", "Content": "This television was a steal from Wal-Mart for $498.  I was skeptical about buying this at first because I've seen so many HDTVs display standard definition horribly.  However, we took the plunge, and after hooking it up, I can say I'm thoroughly impressed.  SD looks fine, not blocky and pixelated like I see with most other HDTVs and that's even with the wide setting applied so that the picture fills up the entire screen.Also, Xbox 360 games and Blu Ray movies look absolutely gorgeous - it's like being in a movie theater.  We've had this TV for just over a week now, and it has transformed everything from gaming to watching movies.  The colors and display are spot on!  The TV speakers aren't the greatest, but we run the sound through our home stereo system.  My only gripe is that the audio output RCA jacks aren't variable, but we just a use a universal remote to switch over to our stereo and adjust the volume that way.IMO, this TV outperforms many other LCDs I've seen, Sony and LG included.  We don't need all the bells and whistles - just a great display and with this TV, that's what we've got.Philips customer service is also superb.  Once we unpacked the TV and set it up, we realized the remote didn't work.  A new remote was sent immediately no questions asked, and it arrived within a week.  This could've been a minor inconvenience, but we had another Philips remote that worked with it.I highly recommend this TV - it is absolutely the most bang for the buck you'll find anywhere!", "Date": "April 27, 2010"}, {"Title": "Phillips 42PFL3704D/F7 42' 1080p lcd hdtv", "Author": "Pauli", "ReviewID": "R1Y6NIDS3MNRHV", "Overall": "5.0", "Content": "I was a little leary about buying a Phillips LCD,so I went to a local box store and looked it over.I was amazed at the clarity and presentation of the picture.Awesome color acuracy and detail almost rivaling my Samsung42\" which costs $1700.00.Everything about this TV is simply outstanding..except for the sound which isnt that great on mySamsung either...but it goes thru a home theater surround system anyway)I think this Phillips TV cost me $668.00no tax and shipped free....you cant beat that!  I have a JCV BLU RAY DVD hooked up to this Phillips and its just asawesome as the picture on my Samsung which has BLU RAY DVD hooked up to it also.For less than half the price of theSamsung I have a great 42\" LCD in my bedroom now.If you get the chance buy one of these bad boys and save yourselfa few hundred bucks over the price of SAMSUNGS AND SONYS.Although Samsungs and Sonys have more buttons,bells and whistlesthe final picture is just as good....go check one out for yourself", "Date": "January 10, 2010"}, {"Title": "Top Quality Picture...Great Value", "Author": "Brian E. Moore \"A Seeker of Life's Simple Ple...", "ReviewID": "R21HSV6AZ6PF0D", "Overall": "5.0", "Content": "The picture is sharp and impressive.  Coming from a 720p TV I wasn't sure if there would be a big improvement.  I was impressed.  Highly recommended.  Go buy it!", "Date": "December 18, 2009"}, {"Title": "Has lasted so far, pictutre is still good", "Author": "Beatriz A. Viera", "ReviewID": "RYHLZ7J4AYT73", "Overall": "4.0", "Content": "I bought this TV somewhere back in 2009 or 2010. Picture is still good, but not as good as new models. Considering the current price though it is a good buy.", "Date": "December 25, 2013"}, {"Title": "Best television ever!!!!", "Author": "Tamara", "ReviewID": "R274Q36UO2ZLVG", "Overall": "5.0", "Content": "No clue how anyone can complain about this television! I've had mine over three years and not so much as a hiccup. I'm dying to find a new smaller screen for my bedroom but can't find anything to compare to the glare contrast. This television has ABSOLUTELY NO GLARE!! Without a doubt, my best television investment ever.", "Date": "June 27, 2013"}, {"Title": "HDMI problems (only HDMI3 working)  (HDMI1 and 2 not working)", "Author": "NY Golfer \"Steve\"", "ReviewID": "R1LVCT0X6RFPPG", "Overall": "4.0", "Content": "I have a Philips TV model 42PFL3704D/F7 and the latest software updates installed.  Lately HDMI1 and HDMI2 stopped recognizing connected equipment but HDMI3 continued to work fine for all equipment (TV Cable Box, ROKU box, Philips DVD home theater).The Philips support team suggested the child channel locks might be turned on so I went there (MENU, FEATURES, CHILD LOCKS, etc.) and locks were NOT turned ON for any channel.  BUT, I did turn locks ON and then OFF for each of the HDMI1,2,3 channels anyway (just the the fun of it).That seemed to fix my problem!!  All HDMI1,2,3 ports work fine now..... so there may be a software bug there somewhere (not a hardware bug).  I also attached my son's XBOX to one of the HDMI ports that was not working so that may have \"shocked\" it into working.  Anyway, they all work now and I'm happy again.", "Date": "May 7, 2012"}, {"Title": "Kevin", "Author": "ThaRoost", "ReviewID": "R1X173KZZZA3CV", "Overall": "2.0", "Content": "I bought this TV 2 years ago from Wal-Mart and it was a nice TV. I paid around $650. I had never had a HD TV before that so it was a really nice upgrade. After about a year the picture quality seemed to deteriorate though. I can't pinpoint what it is that changed but it's not nearly as sharp as it used to be. I mainly play games on my 360 and Ps3, as well as netflix. The sharpness of textures and the color is just not what it used to be. Recently it has also been starting to lose audio at random. I thought it was the HDMI cable at first so I replaced it and eventually it happened again. On netflix I'll see mouths moving and no words come out, just kind of a muffled ambient sound. I've tried the firmware update, I've tried all new cables and I've tried adjusting all of the settings on my 360 and PS3. Nothing seems to help. Luckily I just bought a 32\" panasonic viera for my bedroom, but even at 10 inches smaller and only 720p, it's incredible how much better the picture is than this 1080p 42\" phillips. So looks like i'll be sticking this guy in the bedroom and putting my panasonic in the living room. I wish I would have known this wasn't a quality TV when I bought it, cause I thought I was paying quality price. You live and you learn I guess. My suggestion to anyone considering this TV... Get a Panasonic, Toshiba, Sony, or Samsung. You may think you're getting a deal by saving a few bucks, but it's going to cost you, and with this set most likely much sooner than later. It's a crying shame when a cheaper, less resolution screen looks better than this set. It's also a shame that I only got 2 years out of this set, which is seemingly longer than most according to other reviews.", "Date": "February 4, 2012"}, {"Title": "Great TV / HDMI ports went bad after 2 years", "Author": "Jose", "ReviewID": "R3FFMAFC3G51YB", "Overall": "5.0", "Content": "I bought this TV in December 2009 at Walmart - back then I thought it was a steat at $628. Bought the 2 year extended warranty and took the unit home. Hooked it up to my Xbox, Samsung Bluray, HTPC and cable, and fired it up. I was pleasantly surprised at the brightness and clarity of the picture. Sure its only a 60hz display, but it handles action scenes in hidef movies and video games just fine. What is especially awesome is easylink over HDMI - if you have a compatible device, like my Bluray, it fires up the TV and sets it to the appropriate HDMI input when you power on the player. One thing that I could do that I couldn't with a Toshiba 32\" TV, was get sound over HDMI from my HTPC - the Toshiba TV has an issue with HDCP from the ATI graphics card in the PC. The Philips had no issue - sounds and looks great!The only issue I've had so far are that 2 of the 3 HDMI inputs went bad earlier this month. Called the company that handles the extended warranty and they sent out a tech to look at my TV at my place. He came out and found it to be a bad \"digital main\" - apparently these TV's have two \"main boards\", a digital where the usb and HDMI's are and a larger analog one where the cable, RCA and component inputs are. The tech came back a week later with the part and replaced the part in no more than 15 mins. I was able to watch him as he took the unit apart, if anything goes out after my warranty expires I feel pretty confident that I could replace either of these boards or the power supply. I've looked online and the cost is pretty reasonable for these. I guess the only thing I couldn't replace would have to be the display or backlighting components, in which case I would just replace it.So far the TV has gone back to being great. I don't regret buying the TV - its performed awesome, even though it gets heavy use. My TV runs sometimes up to 16+ hours a day switching channels, inputs and power cycles and I have yet to have a major issue that would change my mind about this unit.", "Date": "December 14, 2011"}, {"Title": "It clicks but won't come on...", "Author": "Steve", "ReviewID": "R1GQ6YDU3B8ZNJ", "Overall": "1.0", "Content": "Brought a 42\" Philips Flat panel tv. Made in Dec 09. When I hit the power button, it clicks, the white LED light stays on for 8 seconds, then clicks off. The screen itself never comes on at all (not even the \"Philips\" startup screen) and there is no sound from the speakers. I removed the back and I don't see any bad capacitors. The fuse appears to be good as well. I do hear a VERY slight buzzing noise coming from the power invertor board but I don't know if that is a problem or not. Can someone help? I have a soldering gun but I don't know which part needs to be replaced....", "Date": "November 14, 2011"}, {"Title": "TV works well", "Author": "A. McCool", "ReviewID": "R2IDZKVEE8LWV1", "Overall": "5.0", "Content": "I purchased this TV refurbished around 1.5 years ago.  It has worked perfectly ever since.  I have had none of the issues that anyone talks about.  However, I do always have this plugged into surround sound / home theater, so I never use the internal speakers.  The only thing I would ask for is more HD component inputs.", "Date": "October 21, 2011"}, {"Title": "Buyer Beware", "Author": "Melody Hill", "ReviewID": "R3B20B0YYPKUMH", "Overall": "1.0", "Content": "I have had this TV a little over a year. A couple of days ago, it went off on its own and I thought it was a fluke because the TV came right back on with the remote and worked fine.  Then the next day, I sat down to watch a movie and it would not turn on.  After about twenty tries, it stuck on the Philips logo for a while, then turned itself off again. I eventually got it to work long enough to watch a movie. Now, the thing won't even get to the Philips logo. It just comes on and the power light blinks at me.  Apparently, after reading a lot of other reviews, this is a common problem with this TV. Firmware update? Don't waste your time. And especially don't waste your hard earned money on this piece of crap.", "Date": "October 10, 2011"}, {"Title": "13 Months and its DOA", "Author": "Dark Magician", "ReviewID": "R22LGON9TBE7BL", "Overall": "2.0", "Content": "I bought the TV from WalMart just over a year ago April 2010, by June 2011 the picture has gone black. Apparently the components inside this tube will malfunction within a two year period, it doesn't matter how well you take care of this TV it wont last but a year or two and your warranty will be conveniently expired. I suggest you spend the extra money on a Japanese brand HDTV.", "Date": "June 17, 2011"}, {"Title": "Good solid TV", "Author": "DaveEconomist1969", "ReviewID": "RAGO0DE0E476C", "Overall": "4.0", "Content": "This was a price point purchase. Very pleased with the quality although sports and fast moving video games are not as clear as one would hope. Philips technical support is very good. The base is flimsy which isn't safe with young kids. Wall mount is the best way to watch this TV.", "Date": "April 19, 2011"}, {"Title": "Basically happy with this, but...", "Author": "James Donahue", "ReviewID": "R2M9ANGVPY9D2", "Overall": "3.0", "Content": "Bought at Target in Aug. 2009.I'm basically happy with it. Last summer, it would not turn on completely, freezing at the initial Philips screen. A call to customer service got me an update on a thumb drive, and I haven't had any problem like that again.I'm a little confused on settings though. Is there no easy way to take a 16:9 image and squeeze it down to 4:3? Some stations take old 4:3 programs and stretch them out to fake widescreen, and they look awful. I'd like to squish these shows back to proper dimensions. Is there no way to do this? (You can on my parents' widescreen TV, a different brand.)Also, when I view 4:3 programs on DVD (my DVD player is also a Philips), I have to jump through hoops to get it to play properly with black bars on either side-- changing several settings on the DVD player every time. And I had to figure that out by myself--customer service was no help. They told me it was the wrong encoding on discs, but that's not true. This should be automatic, yes? (DVD player connected via HDMI, if that makes a difference.)UPDATE: I recently had to buy a new DVD player, and I no longer have the 4:3 problem with discs anymore. They play at their intended dimensions. (It's a Sony. Odd that it plays fine w/ the Philips TV, but the Philips DVD player had problems.)", "Date": "January 27, 2011"}, {"Title": "Great value - excellent picture", "Author": "CompShark", "ReviewID": "RXAOZAGRDFD2B", "Overall": "4.0", "Content": "I bought this 6 months ago, and haven't had any issues with it like others have described.This was purchased as a bedroom TV (no surround sound, video game console, etc. - just FiOS) and I got it due to the very low price compared to others for a 1080p display.  The picture is amazingly clear and bright.  The only downside, which some others have commented on, is the piano-black finish that seems to show dust a little more than similar items with a matte finish - but that's a very minor issue - just dust it  :)Some others have complained about the sound quality, but it seems fine and plenty loud to me, but again it's just in my bedroom.Overall, very pleased with this purchase and highly recommend it.", "Date": "October 7, 2010"}, {"Title": "Cable Box Connectivity", "Author": "GRMarc", "ReviewID": "R3RNV1C6M4TMKE", "Overall": "4.0", "Content": "We purchased this TV for the family room a few months ago and discovered a minor HDMI connectivity problem.  After a short period of time the screen, after a 25-40 minute time period of channel surfing, went completely green.  We had sound but no picture.  We had an extended warranty (problem occurred after 30 days) and they sent out a technician.  It was decided a board needed to be replaced and it went to the shop.  It was returned in 7 days and the problem still occurred.  In the meantime I had hooked up my 32\" Philips to the cable box and experienced the same problem.  The 32\" was in an upstairs bedroom with a direct wall connection (no cable box) and never had a problem.  Called Phillips.  It was then a found out Phillips has identified a connectivity \"hiccup\" (their word) with their TV sets and some cable box manufacturers.  One of them was Motorola which I had.  Their techs are working on it but they have no idea when the problem will be resolved (periodic call-backs to Philips will be required for updates).  RESOLUTION  --  DISCONNECT HDMI USE COMPONENT CABLES & NO MORE PROBLEM", "Date": "October 6, 2010"}, {"Title": "Great Experience", "Author": "J. DeJesus", "ReviewID": "R3D5H4QGDNVYY0", "Overall": "5.0", "Content": "TV looks wonderful and everything just works! What can I say for the price it is well worth it. I cannot comment on the sound since I have had it hooked up to a surround sound system since day one.", "Date": "June 7, 2010"}, {"Title": "Excellent value for the money", "Author": "GS", "ReviewID": "RTEF7K4RGZ1ZB", "Overall": "5.0", "Content": "I bought this TV at COSTCO 2 months ago. It works great.It has vivid colors and great picture. Would buy it again.The only (minor) complaint is about the remote, which feels pretty cheap.But we never use it...", "Date": "May 2, 2010"}, {"Title": "TRYING TO WARN EVERYONE I CAN!!!!", "Author": "Liz", "ReviewID": "R2PTB4DW7B3XSU", "Overall": "1.0", "Content": "Amazon has to take this TV down!!! It is a TV that WILL I repeat WILL Malfunction after a year!!! How ironic since the warranty ends in a year. I refused to write a review until I spoke with the people at Phillips and heard it from their mouths. NO REFUND (even though there are several complaints) I read the reviews (which of course were not so abundant over a year ago when I bought the TV ) and they are true. Anyone who has this TV and does not have the power supply problem is one LUCKY MF! I wasted money, HARD EARNED money on this TV that I will not get back. But I will do my best to prevent other people from doing the same!!! Good Luck Everyone. It is a good deal at first but a sad story in the end!!!!!", "Date": "January 26, 2011"}, {"Title": "If you're having sound issues download the firmware update.", "Author": "M. Dermody \"Miraj\"", "ReviewID": "R1GCUA54IHJECP", "Overall": "5.0", "Content": "Purchased this TV 3 days ago. Each morning the tv didn't have sound. After reading a review elsewhere ended up going to Philips website and downloading the firmware update. This fixed all of the sound issues. No problems what so ever afterwards. Great picture, great sound, awesome price for the size of the TV. Had purchased it for $598.", "Date": "March 18, 2010"}, {"Title": "No Sound.", "Author": "A. Jones", "ReviewID": "R19XWKKHB5KD8N", "Overall": "3.0", "Content": "The picture sucks so bad and the sound goes out. This TV irritates me so much. Philips will be hearing from me tomorrow, I've called twice.", "Date": "March 8, 2010"}, {"Title": "Wonderful TV!", "Author": "D. R. Slack", "ReviewID": "R11EYYQIT88ID4", "Overall": "5.0", "Content": "This tv was purchased at Sam's Club for about $689. (I try to make most of my purchases through Amazon but I'm not keen on having a tv shipped.)  Did not have time to search reviews as it was a surprise xmas gift from mom.  I knew we wanted a 42\" LCD with 1080p, 120Hz display.  From all the tv's fitting this on display the Philips looked the best in store.I planned on spending a couple hours setting it up but was happily surprised to have had it from box to watching in about an hour.We are very happy with everything about this TV.Our neighbor bought a 42\" LG a few months before us and paid closer to a grand.  Not sure what his settings are but ours has a much clearer and brighter pic.My cousin got a 50\" Sony Bravia a week before us and except that his tv is bigger we can see no difference in picture quality.It is now May 2013 and the tv is still going strong!  We do have an odd problem with the sound, we have to turn the volume way up before it kicks on sometimes.  Annoying but not so much of a problem that we feel the need to get it fixed or replaced.", "Date": "January 15, 2010"}, {"Title": "Disposible TV", "Author": "Sharon Francis", "ReviewID": "R3RP3KLLMLK1UG", "Overall": "1.0", "Content": "This LCD had decent screen quality and at the time (2 years ago) was a deal at $1200...but now it doesn't work...no customer service and a $600 repair bill with no quarantee something else won't go wrong, I will just be buying a new LCD, definately NOT a Phillips.  Went online and read hundreds of complaints of this brand.  Amazon should not sell this brand.", "Date": "March 21, 2010"}, {"Title": "A Good HDTV with Great Picture Quality for the Money", "Author": "Family Guy", "ReviewID": "R3CSLYZSM77GLE", "Overall": "5.0", "Content": "I got it from Walmart with 498 today. The quality of picture is clean, crisp, clear and wonderful design. Very easy to assemble and set up. Please remember to download software in USB thumb drive and upgrade before using.Sound has good loud volume with average quality but not very crisp like Samsung but not buzzing too. Remote looks a bit cheap and I could not feel the remote buttons well, response varies at different angle and ranges.At least, it is easily the best available large 1080p HDTV for the price (at least for now).", "Date": "April 24, 2010"}, {"Title": "Great TV, but not enough inputs", "Author": "Aaron J. Lucas \"aaron j lucas\"", "ReviewID": "RNFVIZ54O9UX0", "Overall": "4.0", "Content": "the picture is great on this tv, im suprised how great this looks for a tv i spent $600 on to my door. my only complaint so far is that theres only 1 set of component inputs and no vga input. other than that it a great tv and a super price.", "Date": "March 18, 2010"}, {"Title": "Great TV & setup", "Author": "Laine Agee", "ReviewID": "R21EVQ12NVFNPV", "Overall": "5.0", "Content": "When the tv came, the delivery man not only delivered it, he unpacked it and set it up for me.The tv is great! I especially like the fact that the commercials are not louder than the tv shows!", "Date": "February 3, 2010"}, {"Title": "THE REMOTE RECEIVER IS BAD", "Author": "Waly \"Techie Architect\"", "ReviewID": "RNMFJ706TJJY3", "Overall": "1.0", "Content": "A 32 inch Philips LCD that is just a little over a year old (just out of warranty) can no longer receive signals from a remote.  This means that you cannot control the volume, the channel or the on and off.  Do not buy this brand.  It just is not worth it.", "Date": "January 31, 2010"}, {"Title": "Do not buy this from STANDARD-ELECTRONICS.COM!!", "Author": "Gggirlgeek \"Mel\"", "ReviewID": "R3W3J78IOD67TK", "Overall": "4.0", "Content": "BEWARE!  Do not buy this from STANDARD-ELECTRONICS dot COM!!  As of now they are are listing it for a too-good-to-be-true price along with everything else on their site.I have no proof yet because I didn't take the bait, and they have only been open since December 2009, but it looks like they have no consistent business address, they are associated with a site that asks for Western Union payments sent to London when you order, and any contact info found on them comes up as bogus or as a residential listing for sale.They look too-good-to-be-true to me!", "Date": "February 3, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p resolution; ATSC / QAM / NTSC\n29000:1 dynamic contrast ratio\n16:9 widescreen aspect ratio\n6.5ms response time\nPixel Plus HD engine", "Name": "Philips 42PFL3704D/F7 42-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/413xAOeXa-L._SY300_.jpg", "ProductID": "B001LP6LPG"}}