{"Reviews": [{"Title": "Fantastic HDTV!", "Author": "M. McPherson", "ReviewID": "R28JGBE5NF2RYS", "Overall": "5.0", "Content": "I don't know if I have a different model than the first reviewer, but I have none of the issues that were written about. My menus disappear quickly and are easy to navigate. Got this tv setup by running the channel programming, and then I set it up on a desk before I wall mounted it. I was watching NFL football in HD 1080i and it's amazing!!  The colors are bright and true, and I hate to say, truer color than my more expensive Samsungs, not to say they aren't great tv's also, but the crispness of the picture and black levels are awesome.  What I also like about this tv, is that you can change the screen mode, and it keeps the setting for regular tv not in HD, it will keep the wide mode, which fills the 16:9 screen with no black sidebars, yet when on an HD channel, it will display true 16:9 HDTV format. Also, on some LCDTVs, regular tv broadcasts look like crap, but not on this set, regular tv is smooth and good looking, and not pixelated and jagged. I am very picky about lcdtvs, I took back a Visio after I got it home and it looked horrible compared to my Samsungs. This TV is made by Funai, who also makes Phillips and Sylvania sets, and it certainly ranks up there with the best in picture quality, and for less money.  I fully recommend this TV.", "Date": "December 10, 2009"}, {"Title": "Nice product - but one annoying feature", "Author": "S. Winthrop \"Tourist\"", "ReviewID": "R3KUFSG6A77X9G", "Overall": "3.0", "Content": "I guess I should have changed the channel while I was staring at this TV in the showroom. Every time you change the channel an annoying (and LARGE) menu screen pops up that obliterates the top-left corner of the screen with:1) The name of the show being televised (not bad)2) The type of format display you selected as your default (Zoom In, Automatic, 14.x display, etc.,) I don't really need to be reminded.3) The LANGUAGE mode you selected...come on...This pop-up menu is LARGE and blocks out a very big portion of the picture. It also takes too long to load and disappear - so it's very annoying while 'surfing' through channels.I looked through the manual to see if there is a way of disabling this feature; but alas, I couldn't find one. I'll call Customer Support and if the popup cannot be disabled - I'm considering returning it.", "Date": "June 8, 2009"}, {"Title": "Worth The Price", "Author": "Rob Haines", "ReviewID": "R35TTVLEDE1EJV", "Overall": "4.0", "Content": "The Good:Great picture and resolution for the money. Adequate features and super easy setup. Analog image is excellent, and switching display settings is very simple. HDTV is as good as any major brand.The Bad:Why is it inexpensive? A few reasons: 1st, no VGA-in port. If you want to connect via VGA for your pc or laptop you're out of luck. Remote is cheap and lacks features. Does take about 1/2 second to switch between channels, but the channel display is a non-issue.The Ugly:No optical audio output. Major bummer for connecting older receivers. I bought this for my studio/media room, but without an optical out it's not what I planned. My bad for not checking, but, still a decent upgrade from my old 32\" 1st gen lcd.Overall Opinion:All in all you get a good quality, Japanese-made lcd tv (with less ports) for a great low price. The onscreen channel display really isn't an issue near as much the lack of in- and out-puts. If you use HDMI exclusively that's not really an issue, 3 HDMI's are more than adequate. Remote is basic, but overall easy setup and excellent picture on this tv is a win for the budget-conscious consumer.", "Date": "February 1, 2010"}, {"Title": "Don't Waste your Money", "Author": "Anastasia", "ReviewID": "R2SBITDKDANJT6", "Overall": "2.0", "Content": "I, like another reviewer, have an issue with the HDMI inputs on this TV - they don't work.  I did get this TV at a bargain, and after 9 months, would not buy again at the bargain price.  There are 3 HDMI and 2 RCA ports on this television.  Now that I'm unable to use HDMI, I can only connect 2 devices to my TV.  I also purchased this because it is a 1080 model, but I am unable to obtain the better quality picture using HDMI cables.There is a software upgrade on the Magnavox website, but it only corrected the issue for 2 months.  Additional attempts to re-fix the issue with the upgrade have failed.  Now only parts are covered on the 'warranty,' and the estimate for repair is 50 - 75% of my purchase price.Bottom line, this TV has a known issue.  Don't waste your money on this model.", "Date": "March 13, 2011"}, {"Title": "On Sale Superbowl Weekend at Target for $499.00", "Author": "J. Cammack \"Qtrready\"", "ReviewID": "R387D5CL3WUFIZ", "Overall": "4.0", "Content": "Bought for $499.00 plus tax at Target on Superbowl weekend.  Had a $100 giftcard and sold my standard definition 34\" for $150....so it only cost me $325.00 tax included.  Bargain.  I bought a blu ray player w/wifi and netflix ready.  Been watching great movies for a month and a half.....no problems.  Use with Tivo.  Nice sound.  Use headphones for loud movies.", "Date": "March 11, 2010"}, {"Title": "No regrets, an overall bargain", "Author": "DIYer", "ReviewID": "RNBFHKYL4SFF4", "Overall": "4.0", "Content": "I purchased via a different online vendor (sale plus another discount paid for the shipping) - the TV's box was well-packed with Styrofoam and the box took a beating (ala UPS) - but no damage to the unit. I've had the unit about 3 weeks and thus far, I have no complaints - nor do I expect any (fingers crossed, of course).  As another reviewer noted, the remote is basic - very basic, but functional.  I too was slightly disappointed with a few of the input limitations, however there are a host of alternatives with which to tinker :)  I'm not particularly impressed with the stand - it \"looks\" nice, but it sure doesn't feel very stable - the base is plastic, a rather thin-feeling plastic, at least to me.  If the unit is never going to be moved, I suspect it's a safe set-up, however if there is any chance of the thing being moved regularly (e.g., plugging items into the back where all the input jacks are housed) or perhaps reachable by small children, I'd vote for securing the thing to the wall or whatever it is housed in - just to be safe.The picture is as clear as any other 1080's I've seen, but I haven't viewed my unit right next to another, therefore my observation is just that, my personal observation.  The sound is much better than I expected - at times I've caught myself looking over my shoulder or similar as I've heard the \"smaller sounds\" quite clearly - a crackle of a tree branch has made me look to see what I broke or dropped :)Sure, I wished the remote and the units itself had a few more \"perks\" (e.g., the time on the display....who knew I'd ever miss it?), but for the steal/price, I simply cannot find enough to whine about to make me regret the purchase.  I'm not a big Magnovox fan - I'm a Sony-aholic....but truth be told, if it didn't say Magnavox on the unit, I'd be none the wiser!", "Date": "March 2, 2010"}, {"Title": "Dead", "Author": "Babybuttoneyes \"Dennisjrat\"", "ReviewID": "R3PXWTITTMZS5S", "Overall": "1.0", "Content": "Like the rest, dead already, had a nice picture and good sound while it lasted. for a newer tv i wouldexpect it to last longer.", "Date": "August 25, 2013"}, {"Title": "Great buy for the money", "Author": "Jay Johnson", "ReviewID": "R1ZBXGJEM9R0DQ", "Overall": "4.0", "Content": "For a very basic LCD 1080p television, this one really performs well.  Using only HDMI sources and connecting through my receiver, I had no issue with the lack of VGA input.  The picture quality is solid, and this puppy has lasted me 5 years with no problems whatsoever.", "Date": "May 29, 2013"}, {"Title": "Will Only Last A Couple Of Years At The Most", "Author": "Pchykeen", "ReviewID": "R3NKCD4X86NBSR", "Overall": "2.0", "Content": "Magnavox 42MF439B/F7 42-Inch 1080p LCD HDTVBought this TV from Target on January 31, 2010. Replacing the TV on November 5, 2012.TV is now merging it's HDMI ports. There were no warning signs or anything. TV worked fine on Sunday, but screwed up on Monday. Originally had cable connected to HDMI 2 and blu-ray player connected to HDMI 3. Moved cable to HDMI 1, but now I can view cable on all HDMI settings. I can no longer have my cable and my blu-ray player connected at the same time because nothing works.If you are looking for a long term investment with a television, this is not the one for you. We have a 4 or 5 year old 32\" Vizio 720p in the bedroom that has a much better picture and much better features.This is not the best TV. When we had regular cable the picture was grainy and lacked that HD look. When we switched to satellite, the picture got better, but still has issues at times.The remote control didn't even last a year and we never used it. We always used the satellite controller.I'm sorry we bought this. We should have waited, but the price was right. We should have known better.", "Date": "November 6, 2012"}, {"Title": "Ten months on and we probably wouldn't buy this again.", "Author": "pcgeekbydaysuperdadbynight", "ReviewID": "R3JYIRB7DMIEBB", "Overall": "3.0", "Content": "Overall it's been an ok TV and as such I won't give this TV two stars.Here is the list of our issues (cons):- Video quality of the over the air tuner is sub-par compared to our older zinwell non-HD converter box.  Basically, the TV doesn't to a great job smoothing the edges of video.- Poor upscaling.  Our old TV was a 36\" Sony SD TV and our Nintendo Wii looked great on it.  On the Magnavox, the video from the Wii is not sharp at all and frankly looks like of crappy.- Does not display the current time/ next program info.  This is something we especially missed when we moved from our Zinwell-Sony combo to the Magnavox.  The Zinwell would always show you the current time and current program name.  You could press another button and even find out the name of the next program and the channel name.  The Magnovox only shows the number of the channel you are on.  There is an \"Info\" button to find out the name of the program, but there is no way to find out what's going to be on next.- Slow start up.  After pressing the power button on the remote or TV, it takes 16 seconds before you hear or see anything (actually after 2 seconds it does print the text \"Digital Television\", which very aggravating).- Some 5.1 audio sounds like there's a speaker at the bottom of a barrel.  We just use the built in speakers for audio.  When some programs with 5.1 audio (usually HD commercials) come on, it sounds like the sound is coming from some dark tunnel.- Dot by Dot. Dot by Dot is a mode where the TV will show the exact resolution that it is receiving.  This means that if I connect a 1280x1024 output from my computer, the TV won't upscale it.  Unfortunately, the 42MF439B/F7 does not allow you to select Dot by Dot for 1080p and as such, the graphics are slightly blurred and not as crisp as they could be.  However, Dot by Dot is supported for 1680x1050.- HDMI switching.  This is the worst issue.  The 42MF439B/F7 has 3 HDMI inputs.  We use 1 for our Blu-Ray DVD and 1 for our Computer output (to watch Netflix movies and the like).  Twice this year, the TV get's into a state where, no matter what is connected to HDMI 2 or 3, it will only show what's connected to HDMI 1 when you select HDMI 1, 2 or 3.  This is very infuriating.  I called Magnavox support (aka Funai support, the actual manufacturer of Magnavox and Philips products) and they were completely helpless.  This issue happened back in July and just this past week.  Amazingly, the problem went away both times after swapping the cables a bunch of between HDMI 1 and 3.FYI, while researching the HDMI issue, I found that the Philips 42PFL3704D/F7 is the exact same TV but with a different logo.Pros:- 1080p video looks great and 2 channel audio sounds pretty good.  The 2 channel audio output is also nice.- The 16:9 streching/zooming is pretty good.", "Date": "November 27, 2010"}, {"Title": "Doesn't last long", "Author": "snoop", "ReviewID": "R12ETA21T2ATQ4", "Overall": "2.0", "Content": "Great picture-sound ok-plenty of connections(no digital audio out though). But if you google this model and problems, it's not a pretty picture. Alot have failed, including mine, with the same problem. Although it can be repaired, Can't say I'd recommend buying a tv that has a known issue.", "Date": "November 27, 2010"}, {"Title": "HDMI Doesn't Work", "Author": "Ryan Jetton", "ReviewID": "R318474KL7CTR9", "Overall": "2.0", "Content": "I had the same problem as the other folks.  After about 1 year, all of my HDMI inputs failed.  Out of warranty.  Nothing they can do.  Have to buy a new TV.  Don't waste your time.", "Date": "June 14, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "42 in. high-definition LCD WXGA display\n1080p resolution; ATSC / QAM / NTSC\nClear Pix Engine Plus; Dynamic contrast\nAdaptive 3 Y/C comb filter\nPicture and sound control", "Name": "Magnavox 42MF439B/F7 42-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZlC1bT1JL._SX300_.jpg", "ProductID": "B001THHVPA"}}