{"Reviews": [{"Title": "Great Picture.  Poor sound", "Author": "GG", "ReviewID": "R2SWBTQE62F9F9", "Overall": "4.0", "Content": "The picture on this unit is absolutely outstanding which makes the \"tin can\" sound of the speakers all the more disappointing.  Bought this unit for it's compact size and good looks.  Hit the mark there.  If using a seperate amp/speaker is an option then buy this TV otherwise shop for one with better sound.", "Date": "November 27, 2009"}, {"Title": "Dont Listen to the poor reviews.", "Author": "Daniel P Elo", "ReviewID": "RNHAOALBP1VWP", "Overall": "5.0", "Content": "My girlfriend needed a bedroom TV that sits about 6 feet away from her on her dresser.  She isn't a big electronics junky, but i am.We purchased this TV from a local electronics retailer today and are blown away by the quality of the picture. I am comparing this to the 1200 dollar 52\" plasma we have that we bought last year and the 42\" LG LCD that we purchased a few years ago.The picture is crystal clear when connected via HDMI. Colors are bright and natural.Sound: Everyone has complained about it, but for someone who is EXTREEEEEEMLY picky about electronics, the sound is perfectly fine for the bedroom.  It's clear and produces plenty of bass for such a small tv.If you are expecting to put this in a large family room to watch a big football game with 5 or 6 people, it may not be loud enough for you, but for a bedroom TV it is perfect.I usually dont review items, but i feel like the reviews for this TV are so flawed that someone needed to step-up.My background: Computer Engineer: Used to work at Circuit City. Proud owner for Many electronics and very knowledgeable.", "Date": "September 11, 2011"}, {"Title": "Great Value for money if it didn't break", "Author": "Regulas", "ReviewID": "R1JQJKGO612AF6", "Overall": "1.0", "Content": "I edited this review and gave it a one star because it quit working after two weeks. Tiger direct (The seller) was real good about taking it back and refunding my money.Bought this for a bedroom TV and it works great. Got it for $199 from Tiger Direct through Amazon and the value for money can not be beat. Full 1080P and computer capable makes this one of the best buys I could find.Shopped around and some of these at this size are going for $300 to $400 at only 720P in stores and some did not even have a PC hook up either.The only downfall is if you have it sitting high up you can not tilt the screen downward. I put a spacer under the back of the stand to tilt it forward for better viewing. It does tilt upward.The on screen display is hard to see from a distance too but I can live with the faults for the price I picked this up at. Have not plugged a computer into it but Viewsonic has been making computer monitors for a long time and this would probably be a better monitor than TV although the TV works just fine. I had to refer to the manual to figure out how to scan for my digital cable TV signals but once I pressed the right buttons it scanned all of them with the QAM tuner with no problems.", "Date": "November 30, 2009"}, {"Title": "Good but had to adjust audio to remove tinniness", "Author": "gamehammer", "ReviewID": "R2L8WHAL1NIH9V", "Overall": "4.0", "Content": "Great picture! But had to adjust audio to reduce tinny sound.After awhile I noticed the tinny sound on NBC 3-1. I use earphones, so its becomes annoying.  The salesman suggested a sound system. I tried adjusting the audio.What works is adjusting the audio. Set the treble to zero; This doesn't turn the sound off but will reduce the tininess.I like the hdtv picture and having a secnod PC monitor. The sound could be better! Its a keeper for the price and size. I choose it over the new LEDs.", "Date": "December 15, 2010"}, {"Title": "Works well as a PC monitor", "Author": "Michele Aguirre", "ReviewID": "R142TT138KRGCO", "Overall": "4.0", "Content": "I bought this TV/monitor new July 2009. I've been very pleased with it and have had zero issues. I like the HD input, which allowed me to connect my graphics card to it via a HDMI cable. The SVGA input also worked well. My only negative is that the speakers are average. However, I had separate speakers, so it wasn't really an issue for me. The color of the LCD is very good for both TV and PC applications. Usage with PC games, I would consider it excellent for video quality.", "Date": "October 24, 2010"}, {"Title": "Andy's television review", "Author": "andy", "ReviewID": "R2PZLX2ZLX3PA1", "Overall": "4.0", "Content": "This HD TELEVISION IS ONE THAT I WOULD RECOMMEND TO ANY ONE THAT NEEDS A TELEVISION IN A SMALL PLACE.  BECAUSE THIS IS A 22 IN. HD TV WITH ALOT OF POWER WITH AUDIO, THE PICTURE IS ALSO QUITE CLEAR.  IT ALSO HAS ALL THE MAJOR HOOKUPS INCLUDING HDMI, AND A HOOKUP FOR COMPUTERS.", "Date": "October 4, 2010"}, {"Title": "Poor Sound quality", "Author": "Seba", "ReviewID": "R11IZ0DHSJBH5P", "Overall": "2.0", "Content": "I bought this product to use it as a monitor for my laptop, but when i try to use the Full HD resolution (1080) the icon's edges looks very bad.Also the sound when you are using the TV is depressing.", "Date": "July 26, 2010"}, {"Title": "HDMI woes", "Author": "Todd Fischer \"Todd\"", "ReviewID": "R3NBOKEZXL0Y3V", "Overall": "3.0", "Content": "I bought this as a monitor to use with an HDMI device I have.  I also have a ViewSonic VX2260WM, which works fine with my HDMI device.  With my new VT2230 HDTV, there is no output when I connect my HDMI device to the VT2230.  It could be the device - I don't really have a way to know.  However, it is odd that my device works with another ViewSonic device that is also a 22\" LCD monitor.", "Date": "June 29, 2010"}, {"Title": "I've never seen a buggier television", "Author": "Tom F", "ReviewID": "R2YCMSS3HU6JQB", "Overall": "2.0", "Content": "While the core features of the TV are decent and the image display is what you'd expect, the TV really suffers from being buggy and some bad usability choices.  Half the time I turn the TV on the color is missing...I need to adjust the saturation on it until it comes back.  On a weekly basis the TV will display garbage instead of my HDMI signal.  The usability of the menus leaves a lot to be desired as well...for instance, if you accidentally enter the picture mode using the buttons on the TV itself you'll need to use the remote to get out of it.Yes, none of the issues above is really a deal breaker.  Once you get past these bugs the TV is usable...but would you rather be using your TV or hitting these same issues repeatedly?  There are many other TVs on the market...do yourself a favor and pick a better reviewed one.", "Date": "December 12, 2011"}, {"Title": "Broke when the warranty expired!", "Author": "mart", "ReviewID": "R212JUEGOKEOZ4", "Overall": "1.0", "Content": "The tv started to have a mind of its own. Lost ability to display picture or produce sound. Would not respond to the remote or the onboard buttons. Minutes later it may perform the action. Do not buy.", "Date": "October 15, 2011"}, {"Title": "WORST TV TO BUY", "Author": "T31", "ReviewID": "R3U6D83AT9RS9Q", "Overall": "1.0", "Content": "I DONT KNOW WHERE TO BEGIN. I BOUGHT THIS TV FOR MY DAUGHTER FOR CHRISTMAS (2009). IT CAME, BEAUTIFULLY PACKAGED, AND THE 1ST TWO WEEKS IT WORKED FINE. AND THEN THE TV WOULDN'T CONNECT TO THE CABLE. ITS LIKE THE CABLE AND THE TV WOULDN'T CONNECT AT ALL. I THOUGHT IT WAS MY CABLE COMPANY. CALLED THEM OUT AND THEY WERE LIKE.....\"SORRY ITS YOUR TV!\" SO I CALLED THE COMPANY FOR THIS TV. WE WENT THROUGH THE TROUBLE SHOOTING AND NOPE, IT DIDN'T WORK. SO, I HAD TO FIND A BOX, AND I HAD TO WRAP IT UP AND I HAD TO PICK IT UP AND TAKE IT TO FED EXPRESS. WE WAITED APPROXIMATELY 5 WEEKS TIL WE RECEIVED THE TV BACK FROM THE COMPANY. WELLLLLLL, WHEN I RECEIVED IT BACK, IT WAS PACKAGED WRONG AND SOME ITEMS ON IT WAS BROKEN. SOOOOO, I HAD TO SEND IT BACK! MY DAUGHTER XMAS GIFT WAS STARTING TO BECOME A NIGHTMARE! SO IT TOOK ANOTHER 5 TO 6 WEEKS TO RECIEVE IT BACK....AGAIN. SO THEN THIS TIME IT WAS PACKAGED GREAT. LOOKED GREAT, SOUND GREAT, EVEN WORKED GREAT....FOR ABOUT 2 AND HALF MONTHS. 1ST THE TV WOULDN'T SHUT OFF. MY DAUGHTER HAD TO ACTUALLY UNPLUG IT FOR IT TO CUT OFF. SO WE WERE LIKE, LOOK JUST UNPLUG IT...LOL! THEN, THE TV JUST COMPLETELY STOPPED WORKING LIKE 3 WEEKS LATER! SOOOOO, WE HAD TO SHIP THE TV OFF TO THEM AGAIN!!!!! SO ABOUT....A MONTH LATER WE RECEIVED A BRAND NEW TV. WOW!?!?!? THINKING THAT THIS TV HAD TO WORK. NOPE, APPROXIMATELY 5 MONTHS LATER THAT TV STOPPED WORKING TOO! LOL!!!!!!!!! SO MY HUSBAND (WHO WAS IN AFGHANISTAN THROUGHOUT THIS WHOLE ORDEAL) HAD, HAD ENOUGH OF THIS VIEWSONIC DRAMA! HE TOOK OUR DAUGHTER TO WALMART AND BOUGHT HER A SANYO (HDTV). I GOTTA SAY WE HAVE HAD THIS TV NOW FOR A LITTLE OVER A YEAR NOW....AND IT WORKS BEAUTIFULLY. BUT BE WARNED ABOUT THIS TV FROM THIS COMPANY. THEY HAVE GREAT CUSTOMER SERVICE BUT THEIR TV'S ARE GARBAGE!", "Date": "September 20, 2011"}, {"Title": "This Viewsonic T.V. is a Rip-Off!! Here's why:", "Author": "Seth Bullock \"Dr. Natural\"", "ReviewID": "RW5T755H5624L", "Overall": "1.0", "Content": "I bought the VT2230 one Year ago from another WebSite, that was Pitching it as a \"One Time Only, Super Deal!\"I had bought another \"Viewsonic\" product before, a Monitor for my \"MacBook Pro\" Computer,  and was very impressed with its price and its Quality. So I figured that this VT2230, for sale at a \"One Time Only,  Super Reduced Price\" -- sold by a A Big Computer WebSite was going to be a Good Deal on a Quality T.V.  I am reviewing it here at \"Amazon.com,\" because  I have bought a LOT from Amazon.com since 1998, and Amazon.com has ALWAYS been Fair with me whenever something went wrong {only a few times} with something I had bought from them! Their Prices are always Lower than most other Websites! And I have never seen Amazon {itself} lie about somrthing they were pitching!The \"Viewsonic VT2230\" is Very Good-to-Excellent regarding its Video Output.It is its Audio that Sucks! Another Reviewer in this thread described the Audio as \"tin\" sounding. That description is correct, but is ALSO A BIG UNDERSTATEMENT.  The 2 Speakers' Audio is indeed \"Tin\" sounding!But the MAIN problem is that the Audio-Output is Almost NON-EXISTENT, LITERALLY! The Audio Output is SO WEAK, that even when used as a Computer Monitor, attached to my \"MacPro\" and/or my \"MacBook Pro 17 Inch,\" I had to lean to within 2-3 Inches from the Speakers with the Volume control turned all The Way up to hear the Words.  And still, the Volume was TOO WEAK even as a Monitor! To make matters Worse, it has ONLY ONE  Inferior Audio Input/Output jack! To add adequate Sound, you'll need a Complete & Separate Audio Output System that will Bypasst he Tin-sounding Speakers, and you will have to do some elaborate jerry-rigging  with the extra Sound Source's own Wires and Switch!This is the SECOND  problem with the VT2230--It will Cost MORE to Equip it with an Adequate Sound System than it will cost to buy the same size & quality HD T.V.,  with ITS OWN built in  5-10 Watt Per Channel of Audio Output!The THIRD & Last thing wrong with this T.V., is that I can't get the \"Viewsonic\" Company to do ANYTHING to make this waste-of-my-Money T.V. right! They will NOT acknowledge the Lack of Audio, so they won't let me Trade it in and give me ANY Credit towards Buying another one of their Normal T.V.s. That's BAD Business!Forget the Computer Company {\"PC & MAC CONNECTION COMPUTERS\"} that I bought it from- they wouldn't make any accommodation with me, even though I only hooked it up one time  & had it turned on for a total of 15 Minutes. And EVEN THOUGH THEY ADVERTISED IT with words like \"A One Time Only Sale\" and \"A SUPER DEAL\" and \"ONE OF THE BEST VIEWSONIC HD-TVS\" that they had ever Sold {I still have a Copy of their On-Line AD}, they wouldn't talk with me after the First Time I confronted them with their False Advertising!Still, it is \"VIEWSONIC\" that should have made some type of deal with me, BECAUSE just like ALL T.V. companies--they have their own Department of \"REFURBISHED T.V.s\"--which are Their NEW T.V.s that were returned by other Customers during the Warranty Time Period, which they then sell as \"Refurbished TVs.\" at Substantial Discounts.  All I wanted/Need is an Add-On Audio System at a reduced Price!  Even if they did that, I'd still be paying way too much for that size T.V.!By the way, the Audio Output WAS/IS NOT specified in the User's Guide Technical Specs. If I had known that Before, I would have never even paid 25 cents for the VT2230!Last, I studied ELectronics in College and have worked in Electronics for over 15 years. Each of these speaker's Output is NO MORE than 250 Mili- Watts --that's no more than 1/4 Watt per Channel! This is indeed barely Audible to the Human Ear!", "Date": "July 21, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "22-inch LCD HDTV offers Full HD 1080p resolution; doubles as PC monitor\nClearPicture electronics eliminate noise, increase contrast and detail and optimize color for rich, vibrant images\nHigh brightness of 300 nits, high dynamic contrast ratio of 8000:1, and 1920 x 1080 resolution\nInputs: 1 HDMI, 1 component, 1 composite, 1 S-Video, 1 PC\nIncludes removable stand; measures 20.9 x 16.6 x 8.4 inches with stand\nImmerse yourself in the action with Full HD 1080p resolution for incredibly precise images\nIntegrated ATSC/NTSC/QAM tuner and multiple connectivity options including HDMI with HDCP players and computers.\nPerfect for kids rooms, dens, kitchens and other small spaces in your home\nRevel in the unparalleled definition and detail delivered by 8000:1 dynamic contrast ratio\nSuper-fast video response and advanced image processing ensure extreme clarity in all your HD entertainment", "Name": "ViewSonic VT2230 22-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/519pqZsM3RL._SX300_.jpg", "ProductID": "B001P4S5V6"}}