{"Reviews": [{"Title": "Great TV", "Author": "C. Helmer", "ReviewID": "R2MVISKN4MB9MJ", "Overall": "4.0", "Content": "I purchased this TV to replace the big tube TV in our bedroom, and have been extremely pleased with it. The viewing angle is extremely wide compared to other LCD TV's I have looked at in the past. I don't know if that is a product of the technology getting better in time or if it's specific to Vizio. The picture quality of HD signal rivals my 1080i native 50\" plasma. The menu/software is fairly intuitive and gets you setup in short order. The only reason I did not give this a 5 star rating is due to the built in guide, which will show you what is on the current channel only. It would be nice to have some memory in the guide allowing you to view other channels schedule as well. I know that most of the converter boxes are doing this so it seems this would be a fairly cheap addition. Another poster mentioned that you cannot change the picture format & that it was not Closed Caption capable....which is simply not true. I can select from normal, wide, or pan for my standard def signals. Of course, if you're watching HD you are forced to use wide....which you'll get with any widescreen TV?!? Closed Captioning is also available.Wall mounting this TV only requires a light duty wall mount as the TV itself only weighs 17 lbs. I picked up a mount at Best Buy for $29, mounted the TV to the wall, and now have the top of my dresser back.", "Date": "December 28, 2008"}, {"Title": "Wonderful LCD, Great Value", "Author": "L.C.S.", "ReviewID": "R12NYAF7K5V1X", "Overall": "4.0", "Content": "I recently purchased this television for my bedroom. It's the perfect size to give a \"widescreen feeling\" and HD experience in a bedroom without being overbearing. This is my second Vizio, and I made the purchase after owning a 42\" 1080p for a year. In fact, I returned a 26\" LCD by another maker that I had purchased on Black Friday. Although that TV had some nice qualities, I was not completely satisfied and I found myself worrying about the life of the TV and the manufacturer's rather poor reputation for handling repair/replacement issues. When the price of this 26\" Vizio dropped to only $50 more than I had paid for the Black Friday deal, I jumped at the chance to go with a television with the quality, performance, and reputation of Vizio. I did extensive research and shopping (looked at a lot of TVs both at stores and in friends' homes) before I bought my first Vizio and again when looking for a 26\" TV, and I am one of those who will tell you not to be fooled by people who claim that their [certain other brands] TVs are far superior to Vizio. It's simply not true but some need to justify paying too much money. Of course some TVs may be superior in some ways, but Vizios compete solidly in the side-by-side viewing comparison and features offered.For those who haven't shopped LCDs much, please note that all major manufacturers, including Vizio, tend to have more than one (often several) models of the same size with widely varying characteristics. So if an X brand TV is priced competitively with a Vizio, do not assume that because the other TV is X brand with sexy advertising that it is superior and a better buy. It's likely that the X brand-big-advertising-budget-manufacturer TV is their low-end model with inferior specifications/quality. Vizio offers excellent pricing throughout all tiers of its product line, so a high-end Vizio will be cheaper than a high-end X brand but only a low-end X brand will be priced similarly with a high- or mid-range Vizio. Thus the value of Vizio is pretty great.The picture of my 26\" is excellent and I definitely get that \"wow, I can't believe how beautiful this picture is feeling\" when I watch. The range of viewing angles seems really good (especially compared to the TV I returned). There are many options for picture customization so please play around with the settings to get them to your liking (i.e., backlight setting too high out of the box, picture becomes richer when lowered). There are ample inputs. Like with my 42\" I am surprised by how well the TV's audio creates virtual \"surround sound\" with the TV's own speakers. The setup and menus are really self-explanatory and anyone who's ever used a DVD player or any basic electronics can figure this TV out without even reading the manual. The TV has a sleek look and feels solidly constructed.Vizio has a strong reputation for customer service (although I have not personally had to contact anyone regarding my TVs). They also throw in extras that many companies do not which increase their market position in my opinion--like including an HDMI cable with larger TVs and providing in-home service for TVs 30\" or larger--and other nice touches that separate them from no-name (and some big name) manufacturers and increase value to consumers.", "Date": "December 30, 2008"}, {"Title": "Make Your Own Comparison.", "Author": "Rikki79", "ReviewID": "RU0L0V3HIJ1L5", "Overall": "4.0", "Content": "We are satisfied with this 26\" LCD tv. It was purchased because of favorable direct comparison with other well known manufacturers as well as recommendations from friends that have experience with the brand. We have a problem free 37\" 1080p Magnavox LCD for movie viewing, and use the VIZIO for sports and casual viewing in the kitchen. The set is recessed in the island, so the screen is lower than eye level.  The picture is great, as detailed as our larger Magnavox, which offers greater resolution. The volume can be raised quite loud to overcome ambient noise and can be tailored to render good sound quality even being enclosed in a cabinet. The speakers are down firing, but somehow sound clear nonetheless. The images can be seen easily off axis, but at extreme angles it does lose contrast.  It was easy to set up, scanning and adding 60 more digital cable channels than the outgoing analog set did. We do not have a cable box on this set yet so it will not pick up pay channels, but all are very clear in non-HD digital. DVD's look great, and of course network HD is stunning. Old analog content can blur and artifact, so if you favor this type of programming this might not be the set for you.  The remote fits the hand nicely, has direct access to captioning, screen format, input, and has a led to confirm button presses, but lacks back-lit keys.  There are 2 HDMI inputs, v1.3, a game port on the side, as well as coaxial, pc and analog. The stand could be stronger, and does not swivel, but it does the job.", "Date": "January 1, 2009"}, {"Title": "Good TV at Great Price", "Author": "Johnathan M. Burger", "ReviewID": "R1FKOBSH1Y3GTL", "Overall": "4.0", "Content": "Bought this at a discount club store.Use it as a computer monitor, ps3 gaming and some tv watching.Picture is clean, sharp with vivid colors. 2 hdmi ports is great.Some problems with my mac mini using dvi to hdmi cable-can't get screen sized properly, so I went with VGA. It looks awesome during video playback.Speakers are loud and sound quality is decent for the size of the speakers.", "Date": "May 2, 2009"}, {"Title": "Returned it after 6 days.", "Author": "P. Stein \"Bengals Fan\"", "ReviewID": "RZGRK7TZ18QG4", "Overall": "3.0", "Content": "I just returned this TV after 6 days.Pros:  Great over the air picture.  Great HDMI when it worked.Cons.  Ranged from great picture, to  all pink, to no picture at all on HDMI settings.  When I changed to over the air, perfect picture.  Back to HDMI, no picture.I kept rebooting, kept checking my connections.  I think I had a bad HDMI board.  I was disappointed as I paid $ 248 plus $ 20 for the 3 year extended protection package.  As Vizio requires you to ship the TV to them in California, at your expense, for all warranty work on TVs under 32 inches, it wasn't worth keeping.I returned this, and went next door to Sams Club and purchased the Vizio VO 320E for $ 338.  This 32 inch size qualifies for in home service. I took Sams extended warranty.  The quality is so much better than the 26 inch.  Cable inputs are sensibly placed, not like the 26 inch model that requires you to perform acrobatics to hook up.  Great picture and sound on this one.  A Consumer Reports Best Buy.Original review on Vizio 26.I purchased this TV 2 days ago at Walmart, on sale at $248.  Paid $ 19.99 to extend the warranty to 3 years. However, the Walmart warranty doesn't kick in until the Vizio warranty ends.  Excellent PQ and VG sound.  I expect to return the TV this week.  Why?  Vizio Warranty: With TVs less than 32 inches, Vizio requires the customer to ship the TV-at your expense- to some unidentified location.  Not good.  If they don't find a warrantied problem, you pay return shipping and probably the diagnostic cost.On day one, the sound went out, and I had to pull the plug out, to reboot and get the sound back.  On day 1, and day 2, the TV sometimes was all pink when turned on.  More rebooting.  Given the Vizio warranty terms, I don't want to take a chance and keep it.  If there was a local authorized service center, I might take a chance.", "Date": "November 23, 2009"}, {"Title": "Pretty damn good!", "Author": "W. Hockaday", "ReviewID": "R2A1RQY3HWGILY", "Overall": "5.0", "Content": "The best thing you can say about your experience with product is this: We bought this TV from Target on Friday as a gift and by Saturday we were looking for one for ourselves.  I brought it to my girlfriend's mother and set it up for her to replace her old TV.  Everything plugged in and turned on in the most self-explanatory fashion possible. After hitting the remote once or twice the TV had scanned and programmed everything else... and after seeing how good it looked and the amazing deal we got for it, we immediately decided we were getting one for ourselves.When I went to buy the 2nd one I saw the same guy working who helped me with the 1st TV. He noticed I had bought one and then had come back to buy another one - he said a fellow bought one yesterday too and came back earlier today and bought 3. For 279.99 you can't beat this.  Should it not be on sale and return to the sea of comparable prices for TV's this size, it's still a strong front runner! I would NOT spend an extra $100 because a TV says SONY when I know how nice this one looks.", "Date": "November 30, 2009"}, {"Title": "Wasted Money", "Author": "Julie", "ReviewID": "R278CAB2CEGXSH", "Overall": "2.0", "Content": "I bought this tv about 8 months ago and have used it moderately. When I got home and set it up I immediately noticed that the viewing angle is awful. You have to be directly infront of the tv (neither higher or lower) to see the picture clearly. If you are not, you get a distorted picture that looks similar to a photo negative. Also, the setting is locked on Widescreen which cannot be changed and can be annoying when it warps your movie. Most recently, the sound completely stopped working, and I have yet been able to fix it. Sorry I wasted my money. Next time I plan on investing in another brand and higher quality.", "Date": "February 7, 2011"}, {"Title": "Awful awful awful", "Author": "M. Gros", "ReviewID": "RKULY1DLHCDGB", "Overall": "1.0", "Content": "I'm on my second Vizio television of the same model.  I had alot of the same complaints, poor picture viewing from an angle, looks like a photograph negative, etc.  If you fiddle around with the brightness it can be fixed.  About 10 months in to my first TV a line appeared in the center of the screen.  I called Vizio support, they advised me to be new High Def cables, which I did, and it did not fix the problem.  Then they told me to contact my cable company to make sure it wasn't a problem with the cable box.  They came out and hooked up their own TV and it worked beautifully.  After a bunch of back and forth they agreed to replace the TV with a \"recertified\" TV.  That took weeks to come through.  Now, we are just over the 90 day warranty on a recertified TV and guess what?  It doesn't work.  It just poof, shut off and the Vizio logo won't light up.  I will never buy another Vizio product again.  I could live with the not so perfect picture but I can't live with a TV that doesn't work.", "Date": "April 30, 2011"}, {"Title": "Nice while it lasted", "Author": "K. M. Floyde", "ReviewID": "R1NSENFWMXGJWT", "Overall": "3.0", "Content": "I bought this TV in July 2009 and 33 months later, it simply died without any warning.  I live alone and only watched it for an average of 3-4 hours per day, so I'm pretty disappointed with its limited lifespan.  It was a good TV while it lasted, but I'm going back to Sony or Sanyo for the next one.", "Date": "April 28, 2012"}, {"Title": "Nice TV", "Author": "J. Muzzall", "ReviewID": "R2GMULNB8FHWMF", "Overall": "5.0", "Content": "I got this TV for my son last summer for his birthday.  He had an old box style TV on his dresser so I got this TV to hang on the wall and open up some space.  I have to say this TV is nice for the price I paid for it, it is small but yet big enough for him in his bedroom and it was easy to hang on the wall so it did what I needed it too.  The only I have to bad about the TV, and it is not all on the TV but some on the room and layout itself, but at some angles it is hard to see when he plays his Wii.  I have to say though the color and the volume on this TV are real nice and I would recommend it to anyone wanting a TV and not worrying about a 1080p TV with high refresh rates.", "Date": "November 25, 2011"}, {"Title": "It didnt last long!", "Author": "Chad G \"Chad Greenslade\"", "ReviewID": "RCVVM1LURSU75", "Overall": "4.0", "Content": "I very much liked the tv but i wish it would have lasted longer then 2 months the screen started missing up and had to send to repair shop! But buy it used i should have checked it out further other then that I would buy from company again after investagating further!", "Date": "October 21, 2011"}, {"Title": "Great TV", "Author": "PeterCW \"Peter w\"", "ReviewID": "RFGIMF9G7CMY5", "Overall": "5.0", "Content": "This TV was in excellent shape on arrival. No blemishes on the unit. Everything works like new; I enjoyed saving money buying this TV.  Will do it again when the need arises.", "Date": "February 22, 2011"}, {"Title": "Almost a great tv", "Author": "Eric Severson \"Peace & Joy\"", "ReviewID": "R1X19Q4WU0T2LX", "Overall": "3.0", "Content": "Overall this is a good tv and most people would be happy purchasing it at this price. It has great picture quality when you hook up an HDMI device. Sounds like any other flat panel, not great but gets the job done in a small area. It's got a great range of plug in's as well which is always nice.Despite all the good I will never purchase another Vizio tv in my life. My problem with this tv is that when you have a dark video or clip (or a dark background even if you're using this as a computer monitor like myself) in a video the television screen actually gets darker to the point where it becomes extremely difficult to make out what's going on the screen. A prominent example would be the opening credits of a movie. You'll have a regular picture, then it will cut to a black screen with a name written across it. You'll notice the color and brightness instantly fade out to where it's difficult to read. Then it will switch back to a scene....where the screen brightness is very dark but immediately switches back to normal if there are enough bright colors.Trying to watch entire films that are purposely dark is an absolute nightmare. Inexcusable to me. If you can live with this problem then this tv probably isn't too bad a choice for you.", "Date": "February 3, 2011"}, {"Title": "OK, but lack convenience features of other TVs", "Author": "B. Vernaglia", "ReviewID": "R13A7HVKWE6EWA", "Overall": "4.0", "Content": "I purchased this TV from Target on sale.  Really good price but I had to call around to find in stock.  It was moving like hotcakes off the shelves when I was there.For the price, this is a good deal.  Picture quality and sound is a step below my 32inch Sony, but certainly good for the price.  However, and this is a big however, it lacks some convenience features which I really like, and thus will have to return this TV.Specifically, the WIDE mode button has been removed from the remote control, despite what it says in the manual.  I had a very nice talk with tech support, who were great, but said that the manual referred to the older model.  So, this means that if you flip from one channel to another, you need to navigate through the menus to change the widescreen mode.  OK, not a deal breaker, but very annoying.  I use this feature all the time on my Sony.What is a deal breaker is the lack of choices for wide screen modes.  There are only 3 (normal, panoramic, and wide).  These do not cover the various options you might need.  Specifically, it lacks what Sony calls \"ZOOM\".  \"ZOOM\" would allow you to zoom in while retaining the aspect ratio.  This is important if you are watching non HD sources where the 4x3 picture is letter-boxed.  You cannot zoom in to fill the whole screen.  For me, this is a big problem.I've given four stars deducting 1 for these problems.  If these are not concerns for you, this is a great TV at a great price.  If they are, do not buy this TV.", "Date": "December 4, 2009"}, {"Title": "Very Nice", "Author": "Jake Sach \"Jake\"", "ReviewID": "RBSQKNKSRNZ7V", "Overall": "4.0", "Content": "Bought the tv[...]. AWESOME! I got it hooked up to my xbox at 1080i and it looks stunning. Regular tv in hd looks amazing. Worth the money.Downside..Not really any output jacks for audio? Only a stereo headphone output jack but that will do because i bought a stero to rca wire on amazon.Button layout is akward.", "Date": "June 16, 2009"}, {"Title": "Vizio VA26L NO GOOD", "Author": "Lacy N. Atkinson", "ReviewID": "R3GJAS25KLACXX", "Overall": "1.0", "Content": "Purchased Vizio VA26L in Jan 09  Began to show streaks when turned on in about a year.  At first only took a couple of minutes to clear up...Progressively got worse..Called Vizio at about 13 and half months..Informed me warranty was only 12 months..Now wont come on at all at 1 year 4 months...NO help from Vizio...Sound was never very good...I will never buy another Vizio product...", "Date": "May 18, 2010"}, {"Title": "Couldn't even get it set up", "Author": "ken", "ReviewID": "RNATKAFK8GG7H", "Overall": "1.0", "Content": "Picked up the item at Walmart and returned it the next day.  The first problem I encountered was the remote having a weak signal.  It took some time just to get the remote to work during the initial setup.  Once we finally got the remote working and the tv setup we were unable to receive any reception and picture. Tried multiple antennas which worked on other tv sets but no progress. Also tested the location by moving other tv sets to the same spot and had no problems getting reception from the other tv sets.  Having this much trouble just getting the tv setup we gave up and returned the set. Learned my lesson and would never pick up a vizio again. I should have read these reviews on the product before making the purchase.", "Date": "September 13, 2010"}, {"Title": "Pretty Good TV", "Author": "Michael", "ReviewID": "R3M69LXAACY0EB", "Overall": "5.0", "Content": "This TV is great, very light, easy to setup, and easy to use. Speakers seem to put out plenty of juice for most uses and are better than most standard included speakers. My only complaint was that I fiddled with the color/brightness/contrast for awhile to get the best picture which was somewhat annoying. But other than that no problems or other complaints. Plenty of inputs. Side inputs are great. Even if your DVD player/xbox/etc is hooked up to say HDMI 2/AV 2 the TV seems to switch right to it with one button without going through HDMI 1/AV1 which is nice. Also while playing Xbox 360 through HDMI, the TV says it is playing as 1080p, but I know I can't really tell the difference between 720p/1080i/1080p especially on a 26in.Over all very pleased and would recommend, but you can sometimes get a 32in for about the same price. So if you are thinking about getting this TV, check out some of the 36in too.Mike", "Date": "January 20, 2010"}, {"Title": "Very nice for the price!", "Author": "Pico de Gallo", "ReviewID": "R29LSNSVRL58YX", "Overall": "4.0", "Content": "Having seen the VIZIO brand at out local Target store, I initially shunned it thinking that a higher-end and better-known brand such as Samsung, Sony or Toshiba was probably better. Recently I noticed an article in Consumer Reports that top-rated a VIZIO LCD TV so I took another look and I'm glad I did.I bought a smaller -- 26-inch -- VIZIO just to watch TV which for us generally means breaking news and political coverage. For TV series and movies, we have a larger Sharp AQUOS LED LCD TV with an LG BD390 Network Blu-ray Disc Player and a 650-watt five speaker sound system; this system can't be beat at any affordable price. The VIZIO simply can't compete with the Sharp setup but, of course, it only cost a fraction of what we spent for our \"serious\" rig.Setup was simple though, inexplicably, no assembly instructions for the TV itself were included; I assume there was a sheet of instructions which did not make it into the box. Assembly instructions are not included in the VIZIO manual or the Quickstart Guide but it was pretty easy to figure out how to attach the stand and supporting collar to the LCD TV itself.There are plenty of input connection choices; our Apple TV unit feeds HMDI 1 and looks great on-screen.The screen image is very good -- not up to the Sharp LED TV, naturally -- and the sound output is average for built-in speakers.We got a great \"Cyber Monday\" price on the VA26L at Target but had to go to two stores before we could find one in stock; this popular model was sold out online.We are happy with our VA26L and would recommend it to others looking for good performance, quality and value at a reasonable price.", "Date": "December 2, 2009"}, {"Title": "Three years and passed a way!", "Author": "Josef Holzer \"Josef Holzer\"", "ReviewID": "R1L2WJSARMH985", "Overall": "1.0", "Content": "It was a TV to me that was a tv that drove me crazy. The picture started to fade becaouse I had it on the high setting. And at the end it started to having problems in receiving over the air channels. And sometimes the remote wouldn't respond. The rgb always had some problems using as a computer screen. And some times I had to re scan to get info displayed. And at the end it started to get really hot and smelly and noisy.", "Date": "September 25, 2013"}, {"Title": "Satisfied customer", "Author": "pete", "ReviewID": "R26DD4S5YYWV83", "Overall": "5.0", "Content": "I would like to thank Apex for patiently rectifying the problem I had with the previous tv. Their customer service was friendly and very helpful and made sure I was completely satisfied. Thanks again and I will continue shopping with Amazon.", "Date": "September 22, 2013"}, {"Title": "It works fine. Great deal!", "Author": "gcentrel", "ReviewID": "R2KE6QXCIP4UPB", "Overall": "4.0", "Content": "Had it for a month and so far so good. I'm thinking of getting another one for a computer monitor.", "Date": "January 12, 2013"}, {"Title": "Excellent for home", "Author": "Kannan", "ReviewID": "R1QJPWBE5FOAEY", "Overall": "5.0", "Content": "We really love this TV.  This can be even connected to laptop using cable which is around 20 dollars. I don't see any negatives.", "Date": "November 29, 2012"}, {"Title": "Good For Two Years", "Author": "D. Madole", "ReviewID": "R3TWTSAH9ROQXW", "Overall": "1.0", "Content": "I purchased this TV two years ago and just today the screen went black.  Have perfect sound, but no picture now.  Vizio says the \"backlight\" needs to be replaced on my dime.  Enjoyed the tv while it worked, but $250 plus for repairs is quite expensive ($150+ per year) to watch \"free\" tv.  There was no warning, just one night it was working and the next morning it wasn't.  Vizio has lost a loyal customer.  What a shame there's fewer and fewer quality products that last.  Vizio is now a brand better suited for the garbage heap.", "Date": "September 9, 2012"}, {"Title": "red and blue streaks", "Author": "Sheri Foglio", "ReviewID": "R32L5CFYOE9D1U", "Overall": "3.0", "Content": "We owned the tv approximately 1 1/2 years when a red stripe showed up when turning on the television.  It would go away after a few minutes so I wasn't bothered that much by it but eventually it stayed on longer and longer.  Luckily I had purchased the television from Costco so it had an extra year of warranty.  I called in a couple days prior to the expiration.  After several phone calls and trouble shooting ideas they said that they would replace it.  I had the option of sending in this tv and they would send one back after receiving it or I could give them a credit card number and they would send the replacement and give a credit when they receive the returned tv.  They did send a prepaid label! I chose the second option....hopefully this one is good because they only give a 90 day warranty on it.", "Date": "August 15, 2012"}, {"Title": "Buyer Beware ! Sets develop screen lines just after warranty.", "Author": "Maxx", "ReviewID": "R3FBUHUV3Q49C", "Overall": "1.0", "Content": "I bought this unit in 2010. About 1 - 2 months after the 1 year warranty period expired my set started developing vertical lines. These have expanded over time and now cover about 1/2\" of the screen when I turn it on. As it warms up it reduces to a few lines. Visio wouldn't do anything after the 1 year warranty & it is not an isolated incident:[...]", "Date": "August 11, 2012"}, {"Title": "Amazing screen quality!", "Author": "Heletikus \"Heletikus\"", "ReviewID": "RQV5IT4L15V9E", "Overall": "5.0", "Content": "I must say that I am delighted to watch TV on that amazing hi definition screen ! So flat, so powerful, so clear!Thanks a lot!", "Date": "May 30, 2012"}, {"Title": "Vizio 26\" Tv", "Author": "Egghead", "ReviewID": "R2815D64YZLFB6", "Overall": "5.0", "Content": "Nice TV.  I have several TV's from Vizio and have had no problems with them.  I did find a cheaper price from Costco, but they charge tax and take a lot longer to get.", "Date": "December 21, 2010"}, {"Title": "A Pain to Use", "Author": "TrincoDog", "ReviewID": "R3GPV8E6ISOZ6T", "Overall": "2.0", "Content": "I will never buy a Vizio product ever again.  My brother purchased for us a Vizio 26\" TV and a Vizio Soundbar.  They both look and sound great (when they work), but are impossible to use.  The soundbar was returned.  Sometimes it worked and others it didn't.  The sound would only come out of one side.  And technical support was NO HELP.  It was returned and we purchased a set of Sony speakers instead from Amazon, which work GREAT, by the way.  As for the television, the same problem is sound.  NOTHING is labeled \"in\" or \"out\".  After connecting the receiver to EVERY jack on the tv, none of them work as sound out.  And of course, technical support is no help.  I am considering having him return the television as well and purchasing another brand.  Vizio is just not user friendly.", "Date": "July 3, 2010"}, {"Title": "I definitely love this TV.  Thanks to my brother who purchased it for me.  I love it, but I don't like the colour it's a black.", "Author": "Leola", "ReviewID": "R3SM2EBBH8GRFX", "Overall": "4.0", "Content": "I would definitely recommend this product to someone else.  it's very good product.  I would like to give 5 stars to the seller.  I bought the TV from Amazon via an independent seller.  He was very understanding and very kind.  There was a problem with the shipping label.  He responded to my email within less than a hour.  He is just as nice and the crispness of the TV.  I have no regrets and no complains would definitely recommend this brand and this shipper without hesitation to anyone.  I love it.", "Date": "July 2, 2010"}, {"Title": "26\" Vizio HD TV", "Author": "Paul Clemente", "ReviewID": "R3RPEXRK4PMGAB", "Overall": "5.0", "Content": "Absolutely one of the best tv's I've ever purchased. I bought a Samsung and sent it back it was so poor! This is my second Vizio (I have a 42\" HD in my Living Room) and I swear by them!You'll not go wrong with Vizio.", "Date": "June 26, 2010"}, {"Title": "Wise Choice", "Author": "Smitch", "ReviewID": "R28ME96LSA0BB1", "Overall": "5.0", "Content": "I purchased this item as a second monitor for my hard drive. I'm a graphic designer and didn't need a new computer but simply a larger \"viewing space\" and this works perfect. It was exactly what I wanted to spend and my laptop communicates seamlessly with this product. I am pleasantly surprised. I got two for the price of one! Would highly recommend.", "Date": "May 6, 2010"}, {"Title": "Horrible Viewing Angles", "Author": "D. Molino", "ReviewID": "RBEDUI3VM6C75", "Overall": "1.0", "Content": "I have had this tv for a few months now.  Other reviews warned about this which I fooishly ignored.  Indeed the picture is good but only directly in front of the screen.  Any angle from left, right or above and  the picture washed out.  Viewing from below, the picture darkens considerably.  Ours is in a cabinet a couple of feet above eye level.  I have tilted it down to watch while in bed.  In any other position the picture is a disaster.  I should have returned it when I had the chance.", "Date": "December 10, 2009"}, {"Title": "verry upseting", "Author": "running spirit", "ReviewID": "R312CM43C7OVOY", "Overall": "1.0", "Content": "i had recently given tools now a good review because i ordered a vizio 26 inch tv and when it got here the connector where u plug the coaxial cable was broken, so i told them about it and they responded emediately to my request for return,, i was verry happy and gave them a good review,,,  but omg i can not beleave the replacement they sent me,, first off when i opened the box i could not beleave the awfull smell it seriously smelled like cockroaches when i took out the tv it was full of roach crap i mean plastered with roach crap, the screen was all sratched up and in two spots there was deep scratches to the point that it looked like 2 big white dots when the tv was on, the picture itself was so dark i couldent even watch it, it smelled really bad,, i honestly cant beleave how low someone will go to sell crappy things when this tv was advertised to be in like new condition,, this is false advertisement, i honestly think i should call a lawyer and show him the crap u guys sent and sew u for sending me a pile of roaches, and something that does not work, the remote control was missing the cap for the batteries, i will never again order anything from u guys or any electronics on the internet period,, i took pics, u guys suck, i still can not beleave u sent me such a thing.", "Date": "March 20, 2012"}, {"Title": "Crappy Refurbishment", "Author": "Enzocap", "ReviewID": "R1BM4QWFY4BZ4L", "Overall": "1.0", "Content": "Decided on trying a refurbished TV - bad idea.  I hooked up the thing for my parents to their old Dish Network receiver.  Being that they don't really care about HDTV or picture quality too much, we still use a coax connection down to another floor.  I connected the coax to the DTV interface on this TV and it shorts out if you wiggle the cable because the connection on the TV is loose.  So now I have to go to a website, fill out a claim, and apparently ship the TV back to them.  It says \"send the unit freight prepaid and insured\".  Not sure if that means they are expecting me to pay for shipping and insurance, because I am not. Amazon will be hearing from me if they even try to make me do so.  Stay away from this TV, it is refurbished in Mexico.", "Date": "September 11, 2011"}, {"Title": "Black screen after 2 1/2 years of ownership", "Author": "Jeff Meyer", "ReviewID": "RNNHX9SNIVLRM", "Overall": "1.0", "Content": "I had been very happy with the video quality and the sound, over the last 2.5 years.  I turned it on yesterday and only got sound, and a black screen.  I've done searches on vizio problems and found similiar complaints about this model and other vizeo products, see [...].  I treat all my electronics with the care they deserve.  The last TV I had must have lasted 10+ years before it went out.  Are they making these to be disposable and I wasn't informed?", "Date": "September 9, 2011"}, {"Title": "Wow! Alot of scratches!", "Author": "James G", "ReviewID": "REDOVM9O8OBXW", "Overall": "2.0", "Content": "I want to be honest with everyone. My TV arrived in a very used condition even though the manufactured date was November 2010. It was dirty and had numerous scratches on the frame, thank God the screen was not damaged. The seller placed a label on the side of the box and it clearly states that the TV's cosmetics have moderate damage! :(This was my first and last refurb. Also, I did not receive the owners manual. I bought this TV for the low price, but I didn't think this is what I would get. I used a scratch remover designed for automotive paint with almost no results. This will be a learning expierience. Next time I will buy new.", "Date": "April 28, 2011"}, {"Title": "Disappointed with purchase", "Author": "Daqtest1", "ReviewID": "R3BL73AQELBX2F", "Overall": "1.0", "Content": "I purchased this product only to find that the picture tube is going bad in it.  The hardware looked perfect, the remote like new and the box wasnt in too bad a shape so I thought this was a great buy.  When I set it up and connected it to my sattellite system via a technician, I was standing in front of it and thought the picture quality was remarkable but once I sat on or laid in my bed it was awful.  The screen looks like a photo negative so the only way to watch this television is sitting up almost level to the screen.  I've tried moving it around to see if that'll remedy the problem but was unsuccessful.  I had it checked out to find that the picture tube is about gone.", "Date": "January 30, 2011"}, {"Title": "Buyer Beware Vizio does not stand behind their products.", "Author": "D. Franki", "ReviewID": "R2UDHU6A1VQN64", "Overall": "1.0", "Content": "Bought a Vizio 26 inch TV 14 months ago. Turned it on this morning. Sound no picture. Did a search online and found hundreds of similar complaints. Not just with the model I have but throughout their product lines. Some people are out $1000.00 due to this company. So I called Vizio and was told the company has taken a hard line to do nothing about this issue. If I want it fixed I have to pay for it myself. What happened to televisions that last 10+ years? Save yourself some aggravation buy from another company.", "Date": "February 19, 2010"}, {"Title": "don't buy it - mine broke in the first 2 minutes", "Author": "Karen Trail \"hurry_mom\"", "ReviewID": "R8XE189TXYZEA", "Overall": "1.0", "Content": "i kid you not - we got a GREAT price - 248.00 at walmart and got it home and put it up on wall.  turned it on to scan channels and once that finished, we were able to see 2 channels before the whole thing died.we messed with it for a while, called vizio help line - who incidently, were pleasant and helpful.  after discussing what happened - picture went from full screen and shrank in from the edges to a small dot of nothing - they told us the backlight had burned out and it was SHOT.  had to take it back within an hour of purchase.we turned around and bought a sanyo.", "Date": "November 24, 2009"}, {"Title": "Just got this, have to wait for a while to see....", "Author": "Patrick Nguyen \"Trance Music\"", "ReviewID": "R8SQYEV1DCAGU", "Overall": "3.0", "Content": "OK, I saw couple bad reviews on this TV, well I got this TV for $185 at Target, after taxed it's about $200.  it's a good deal, but let's see how long it's last:)  So far I like it, with no problem yet.", "Date": "May 3, 2010"}, {"Title": "Terrible TV -", "Author": "D. Shelley", "ReviewID": "R1JTBHBWQYGYBJ", "Overall": "2.0", "Content": "I've owned a Vizio 26L for less than 4 months - it broke: the power just stopped working.  They make you pay for your shipping and handling and the wait time for issues is longer than 2 hours.  I have never owned any TV that does not last longer than 10-14 years.  The worst brand of TV I have ever bought --  I would never ever buy another one.  Customer service sucks", "Date": "January 22, 2009"}, {"Title": "BAD PICTURE RIGHT OUT OF THE BOX", "Author": "C. Barnes", "ReviewID": "R2IYXORZSDEB6Z", "Overall": "1.0", "Content": "I bought this at Walmart for $308, brought it home, hooked it up and wham... The picture flickers and the people are purple and the color is very distorted.  After it warms up for 1 hour or so this corrects itself, so I have watched it.  I don't know that much about HDTV's but this tv seems to be permanently fixed for wide screen format so everyone is spread out and appears very wide.  Couldn't find anywhere where you could change this.Needless to say, this is going back ASAP.", "Date": "April 19, 2010"}, {"Title": "awesome picture quality!", "Author": "RA", "ReviewID": "R3W0IO4FDLPPLJ", "Overall": "5.0", "Content": "this tv lokks great and is worth the cash. no problems and got a great deal!", "Date": "September 26, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Product: Vizio VA26L 26 in. HDTV LCD TV\nMPN: VA26LHDTV10T\nFlat Panel Type: LCD TV\nLCD Response Time: 8 ms\nScreen Size: 26 inch", "Name": "Vizio VA26L - 26\" Widescreen 720p LCD HDTV - 2400:1 Dynamic Contrast Ratio - 8ms Response Time", "ImgURL": "http://ecx.images-amazon.com/images/I/51MIZ6kDeJL._SY300_.jpg", "ProductID": "B001G8RMLA"}}