{"Reviews": [{"Title": "I guess third time was the charm", "Author": "Christopher Varela", "ReviewID": "R3FSHVR9M7Z422", "Overall": "5.0", "Content": "I've been through 3 t.v.'s so far. The first t.v. I bought was my first HDTV ever but the picture was just not that good. I felt like it wasn't a good upgrade from SDTV. The second t.v. I bought had a really good HD picture and an acceptable SD picture, but no matter what I watched the picture was always dark for some reason even if I increased the brightness or contrast. That t.v. also lacked the inputs I needed for different things like my cable box, game systems, etc.After deciding to give it one more shot, I stumbled upon this t.v. with it's great specs and many inputs. I have to say that this t.v. has excelled my expectations. From Standard definition channels to High definition channels, this t.v. is a winner. It is so bright even during the daytime (funny how others mentioned this too lol) and it has those inputs that I wanted. So far I've played my Xbox 360 on this t.v. and the picture cannot be beaten. The picture is so crisp and clear that it puts those other t.v.'s I had to shame. Oh and about the picture being dark, it can't be. I only have the settings on the \"Game Mode\" that this t.v. has and I can see every detail there is in the games. I haven't even brought up the brightness or contrast yet and there is no need for it! There is even an option in the menu to make dark scenes even more clear!The sound on this t.v. is also good. I thought I had my surround sound speakers on when using the t.v. but I actually was using the t.v. speakers and yes they were that loud at a low volume setting. So here is how I sum it up:VIDEO: 10 out of 10I have not yet been disappointed with the SD or HD picture of this t.v. Whites are white, blacks are black.AUDIO: 10 out of 10If something ever happened to my surround sound speakers, I wouldn't care because it will be like they never broke.INPUTS: 9 out of 10It's nice that they're 3 HDMI inputs but I wish there was a second component input. But since everything is going HDMI these days, this is not a problem.PRICE: 10 out of 10I've seen this t.v. going for up to $899 but I bought it for $699. What a steal at this price.OVERALL: 10 out of 10Finally I have found the t.v. that I have been looking for all this time. I had to wait until 2008 to get it, but it was definitely worth the wait. If you have been waiting to get an HDTV, then now is the time to get it. You won't be disappointed.", "Date": "June 18, 2008"}, {"Title": "Great buy", "Author": "Christopher P. Walrath", "ReviewID": "R2NN7B9B6T4YYS", "Overall": "5.0", "Content": "I was looking for a new bedroom TV and decided on a 32\" LCD.  As I already own a 42\" Toshiba Regza for the Living Room, I wasn't all that worried about having 1080p for the bedroom model.I shopped around for this one a lot and could not decide between Sony, Samsung or Panasonic.  After 2 trips to Best Buy, I decided the Samsung probably had a bit more vivid color and a swivel base.  I ended up purchasing the Panasonic, however because the Samsung seemed to be less \"solid\" in construction and the Sony was about $100 more with what appeared to be a worse picture quality.I've had the TV for a little over a month and it has been flawless.  I actually think it has a better picture than my 42\" Toshiba.  It was very easy to setup, pulled it out of the box, plugged it in and went through a very user friendly setup.  I like how the speaker is hidden, and is of surprisingly good sound for an LCD.My only potential complaint is if I ever decided to mount it on the wall, the base is pretty weird in pulling off, which requires you to tip the screen on it's side.", "Date": "August 8, 2008"}, {"Title": "Best TV I've ever owned", "Author": "Willow Wolf", "ReviewID": "R2WXRHUKX1OZS", "Overall": "5.0", "Content": "I was really surprised at how good this TV is. The picture is perfect, no matter what kind of lighting is in the room, from full daylight to dim nighttime. It comes on quickly, and the automatic channel programming is just about flawless. The onscreen menu lets you control everything to set your preferences as desired. The HD programming (broadcast over the air) is just awesomely crisp and clear.", "Date": "June 18, 2008"}, {"Title": "Great Picture/Easy Set Up", "Author": "Spike", "ReviewID": "R31UK1YMWDRCNC", "Overall": "5.0", "Content": "Panasonic TC-32LX85 32-inch 720p LCD HDTVI am very pleased with my recent purchase. Set up is simple. The remote is great. The picture is excellent. I can actually watch in broad daylight with the sun shining and there is no window reflections, shadows, etc. I have had friends who have HD service comment on what a nice picture and didn't believe when I told them I don't have HD service yet. I would highly recommend this product.", "Date": "April 26, 2008"}, {"Title": "Great TV for the price", "Author": "MRH", "ReviewID": "R23HY6G50NC4KD", "Overall": "5.0", "Content": "If you are looking for the best value in a 32\" LCD, I would highly recommend buying this TV.  I compared several brands on price, features, picture quality, etc, and the Panasonic was a clear winner in this price range.I had actually purchased a Vizio set, but returned it because the picture quality was poor on standard-def signal, and the features included in the set were not the same as what Vizio stated on their web-site.After shopping and comparing this Panasonic to similar priced models from Sony, Samsung, and Toshiba, I decided on the Panasonic, and I have not been disappointed.  The picture quality is great for HD (as are most HD sets these days), but what sets this apart is the good picture quality on standard def TV.  Also, the features were exactly what I was looking for, and at the advertised sale price was too good to pass up.So to sum it up, if you're looking for a good quality 32\" LCD, I would definitely take a long look at this Panasonic model.", "Date": "November 12, 2008"}, {"Title": "Panasonic TC-32LX85 32-Inch 720p LCD HDTV", "Author": "Papa Al", "ReviewID": "R1NXGAN6TENHQ4", "Overall": "5.0", "Content": "I bought this 32 inch 720 Panasonic LCD TV after buying the 26 inch 720 version for my bedroom. I wasn't sure that 720 would be as good as 1080. I've read that you don't need 1080 for these size screens and their right. Once you see HD you won't want to watch analog broadcast. The remote is large with easy to see numbers with the lights on. My only con would be that the remote has the same shape on both ends and in the dark it's easy to have it pointed in the wrong direction.", "Date": "October 23, 2008"}, {"Title": "Decent pic for the price!", "Author": "vacationer", "ReviewID": "R1YMXRTUJKX0X2", "Overall": "4.0", "Content": "I bought 2 of these TVs for my office and bedroom.  I paid $579.00 and really didn't spend much time comparing them to other 32-inch LCDs.  So far I am quite happy with them.  Neither is setup on HD channels so I'm running regular digital signal.  I know Best Buy has this TV and it was about $80 more at the time so this was a good deal.Only thing that I was a bit disappointed in was the fact that there is no PC input option on the TV.  You  can spend the money to get an after market up-converter for about $100.  It would have been nice to switch to a large screen for my computer when I wasn't tuned in to TV.  It was my fault not to look at the description more carefully but in all honesty, it really wasn't important and a nice feature to have had.The sound isn't bad for what I use it for (background noise) and the picture is quite clear.  I definitely would consider a higher contrast ratio if this was your primary TV.  After these two and a Samsung 750A61 DLP HDTV, I would be hesitant to buying less than 10,000:1 contrast ratio. Again, it's not a high-end LCD TV so you get what you pay for and I'm pleased for my environment.  Skin tones are very nice surprisingly and the regular color saturation in normal mode is very nice.", "Date": "October 29, 2008"}, {"Title": "Panasonic stands behind their product.", "Author": "Bill W.", "ReviewID": "R2XRNO5UMYUJWU", "Overall": "5.0", "Content": "Great TV. Great picture.After the set had been here for one week it quit working. Called the Panasonic telephone number in the owners manual. They called a repair shop and coordinated a time for them to come to my house. They were here in three days, kept the TV for two days and returned it in working condition. Good support and much appreciated.", "Date": "September 16, 2008"}, {"Title": "Best Picture for it's Size", "Author": "K. Gordon", "ReviewID": "R1JOQOCXSTPAK8", "Overall": "5.0", "Content": "This Panasonic 32-inch has the darkest black shades and fastest color transitions of any hdtv this size I've checked out before.  What really makes this tv so great is it's receiver.  It is able to find many of the digital cable channels that are not really part of my cable service, so it is like a bonus! It is 720p, but at 32-inch you won't find much difference in 1080p at this screen size.  It works so well with this tv, and the color menus are able to let you adjust so much, and have your custom setup saved, if you switch to one of the preset ones.  It is not affected by sunlight, and the built-in sound works so well I sometimes turn off my theatre sound system.  For the money its a great buy and I'm considering a second one for another room.", "Date": "October 26, 2008"}, {"Title": "TC-32LX85 is Very Good", "Author": "Lyle R. Trager \"Lyle T\"", "ReviewID": "RSTEU0WK8B9O8", "Overall": "5.0", "Content": "Bought this on Amazon several months ago now. It is my first LCD. I've owned Panasonic Plasma's for a few years. This set is great. Only complaint would be that blacks are not as good as on the Plasma's but over all very pleased. I have not seen any written reviews of this set yet and I would like to see some recommended settings. This was easy to set up. Very happy!", "Date": "July 7, 2008"}, {"Title": "excellence", "Author": "Shariese", "ReviewID": "R3N50ZHIEYFWNM", "Overall": "5.0", "Content": "I bought three televisions in the last six months.  And this television is much better than my 47 inch 1080p.  And the Magnobox isn't very great.  The picture blows away the competition and it cheaper.  I would definitely recommend this television.  Buy it.", "Date": "September 9, 2008"}, {"Title": "Color decoding is way off", "Author": "I call them as I see em.", "ReviewID": "R1A1D6M5FEOCWO", "Overall": "3.0", "Content": "What the heck, is everyone color blind?  I mean this things color decoding is way off.  Way too many things have green hues.  (Not everything, it's not a defective set.)  Gray like hair almost always has a green cast, faces can even have green casts.  I hate green casts more than any other.  It's a shame because the rest of the pic is fantastic. It makes regular stand def look like HD.  When it doesn't throw in a green cast on something the pic is beautiful.  I'm at odds of whether I should send this unit back and go with the 3rd best set (Samsung uses way too many other panels instead of their own to make it worth chancing buying one of theirs) which is the Sony or not.Addition 1I would like to add that it was packaged very well by Panasonic.  Mine went from NJ (or NY?) to CA in just the Panasonic box which had corner styrofoam and additional fitting foam (spray foam that increases in size) all around the panel and a thick cardboard box. It might have helped that it was not double packaged so UPS could see that it was a LCD tv and not to mishandle it.Addition 2The green hue seems to be when the color should be either light yellow, gold/yellow, or some kind of gray (not all grays).  There is a current commercial for Ester-C that shows the problem. It depicts two oranges talking.  The back half of the one on the right is green when it should have been yellow.It's not everywhere, but I certainly wish they would have gotten it right. I probably won't return it but what a blunder by panasonic.Addition 3:In a Feb review the reviewer stated his had very poor horizontal viewing angle.  I can only state mine is very good.  I can be all the way left or right and as long as I can still see the picture it still has very good color and contrast.  Panasonic must have started using someone else panels or something because their panel is designed differently and should allow near 180 degree viewing.I still wish the colors were better. The color is so ridicules that it looks like people were colored in with crayons.  There is no way to make people either appear too magneta or too green/yellow and the best setting is a little too much of each (-5 tint).UPDATE:I've had it for a few months now and can just say this thing is very sharp!  The color issue seems less now that I'm not as hyper sensitive on the issue.  I guess after owning it for awhile you stop looking for problems and start enjoying it.I did go back to the store and check out the more expensive Samsung 32a650 and the sharpness was very poor on it (yes, it was an \"S\" panel).The colors and contrast do not drop off on the Panasonic when viewed from the side but the contrast wasn't that good to begin with.  Now that plasmas are falling by the waste side maybe panasonic will work on their LCD line more because I think they are on to something with the way they twist the lcd to improve off angle viewing.", "Date": "January 12, 2009"}, {"Title": "Great set", "Author": "P. B. Savino \"Brian\"", "ReviewID": "R3FEOQC89U95X4", "Overall": "5.0", "Content": "I'm very pleased with this LCD tv. The HD is crystal clear, the color options are endless and it looks and feels even bigger than the 32 inches that it is. I'm using antenna television and it might as well be direct TV or cable with how great it looks on this set. It's a beautiful set and the price can't be beat for this kind of quality.", "Date": "August 19, 2008"}, {"Title": "Bought for birthday present", "Author": "S. Bounds", "ReviewID": "RUWVF3J89E1LT", "Overall": "5.0", "Content": "I bought a Panasonic model 32LX70 from Amazon about a year ago and was so happy with it that my siblings and I bought this model for our father as a birthday present. He watches a lot of sports and likes it so much he told his sister-in-law and she also bought one from Amazon.Greeat product, easy setup, outstanding quality for the money.", "Date": "August 8, 2008"}, {"Title": "Good TV", "Author": "David \"WVU Fan\"", "ReviewID": "R2MISAUC5WAU8F", "Overall": "4.0", "Content": "After seeing the Panasonic in Circit City and Best Buy, I decided it was the best deal over the Sony, Samsung and LG. All four were similar in picture quality but the Panasonic was more competitively priced.  I then found this set on Amazon for $566, free shipping and no tax.  It would have cost $700 plus tax at Circit City and Best Buy so I saved about $183. I am pleased with the TV so far (have had it about 3 weeks)", "Date": "November 25, 2008"}, {"Title": "Great little TV for second room", "Author": "JM \"yayi\"", "ReviewID": "R1CI0TR54EMQ1U", "Overall": "5.0", "Content": "I like this TV so much that I went and order a second one! Colors are very accurate and viewing angles are really great. I calibrated the TV to the CNET suggested settings. I mounted this TV to the Peerless PA740 articulating arm mount. They go great together. Overall, between the TV and mount, I saved over $400 ordering from Amazon compared to local Circuit City or Best Buy.", "Date": "October 2, 2008"}, {"Title": "Terrific TV at a great price", "Author": "Michael Hennessy", "ReviewID": "RRA7WRDEXHUWS", "Overall": "4.0", "Content": "Panasonic has been making awesome TV's for decades and their flat panel technology is every bit as competitive as their tube TVs were.  The picture is clear and sharp and set up was a breeze. Unlike some Panasonic remote controls of years past this one is sensibly laid out with good size keys and clearly marked functions. I especially like the \"format\" key that allows you to set standard resolution pictures to the 4:3 format, while leaving Hi-Def stations in full screen mode.I saved several hundred dollars over local prices in an area where Best Buy, Circuit City and the big department stores are going at it hammer and tongs for market share.  The delivery was on time and overall, the service was first rate.The only reason I'm rating the product 4 stars is that it's a 720 versus 1080 dpi and the speakers are not great, but hookup to my home theater system made that a non-issue.  However, when it comes to bang for the buck value, this was a five star deal all the way!I knew what I wanted and Amazon helped me get it on time and on budget.", "Date": "September 23, 2008"}, {"Title": "Couldn't be happier", "Author": "Joe Thomas", "ReviewID": "RD34EPH062J5L", "Overall": "5.0", "Content": "I bought this tv for my in laws and couldn't be happier.  I originally bought them a Vizio Plasma and was not happy with the picture quality, especially because the tv was so reflective it was unwatchable at times or transistor radio sound from the speakers.  This Panny was comparable price and had such good reveiw on here and on the AVS forums that I decided to go with this tv, site unseen.  This tv blows away that Vizio.  The first comment when my father in law had when he turned on the tv was the picture is like 3 D and so much brighter and clearer than the Vizio.  Also the speakers blow the Vizio away.My in laws are blown away by the picture.  I adjusted the picture settings and very impressed.  Its so user friendly and they are in their 60's and not into the tech stuff.  They are finding this tv easy to use.I have owned a Sony 32XBR2 and Sony 40S3000 and this tv has a nicer picture than both of those tvs.  Don't spend extra money for a Samsung, Sony, or Sharp and get this tv while you can. Forget that its not 1080p that is meaningless at this size.  At this price around $500, this tv is unbeatable.", "Date": "December 17, 2008"}, {"Title": "Perfect", "Author": "A. Quereau", "ReviewID": "R2SFWQSO5IPNVH", "Overall": "5.0", "Content": "This TV is everything I could want: great picture, classic black design, and easy set up.  And I got a fantastic price by searching through Amazon.com.  Definitely no regrets!", "Date": "November 2, 2008"}, {"Title": "Best standard-definition performance, anti-glare (matte) screen", "Author": "Leo Franklin", "ReviewID": "R1C45EV13I24RT", "Overall": "4.0", "Content": "For the price this 32\" LCD TV has the best performance out there, you may find cheaper options (Viewsonic, Westinghouse or even Toshiba) but none of them can match the picture quality of this TV.It's primary strengths are:- Great overall picture quality with good black/contrast levels- Best \"Standard Definition\" (i.e. non-HDTV) TV performance I've seen in this class- Anti-glare screen - this TV has a 'matte' screen unlike may other manufacturers who are using 'glossy' screens resulting in glare while viewingThe only disadvantage I could find is lack of an analog (VGA / RGB) PC Input, this can be solved if you have a computer with DVI out and use a DVI-HDMI cable.Not all channels out there are in HDTV, to some extent we are all going to watch Standard Definition (SDTV) TV for the next few years.Keeping that in mind, and considering this TV has excellent SDTV performance it is a great buy at the current price of under $600.", "Date": "November 30, 2008"}, {"Title": "another great Panasonic product", "Author": "P. C. Hinke", "ReviewID": "R1J9DIM3CYQ9W9", "Overall": "5.0", "Content": "I keep buying Panasonic products and keep getting great results with them. This TV is great. I did a lot of research before buying it and I think I made the right choice over Samsung & Sony. I buy Panasonic for their durability also so we'll see how this TV does in that regard.", "Date": "November 25, 2008"}, {"Title": "Great HDTV", "Author": "Barbara L. Milligan \"Grandma Barb\"", "ReviewID": "R1AH67TP4Q1HWT", "Overall": "5.0", "Content": "This HDTV has a great picture. Good sound, is unbelievably lightweight. My daughter loves it. It was her Birthday gift.", "Date": "November 10, 2008"}, {"Title": "Panasonic TC-32LX85", "Author": "Radu V. Rusu", "ReviewID": "R338Z1PE6JDYZ4", "Overall": "5.0", "Content": "Excellent TV at an affordable price. Great picture quality, easy set-up, easy to use. Couldn't be more pleased with this choice!Great service from Amazon.com!", "Date": "September 19, 2008"}, {"Title": "Great TV....Great price", "Author": "Tony D.", "ReviewID": "R167AI4J9ETHQ4", "Overall": "5.0", "Content": "I looked at TVs at Best Buy and Walmart to check out features and picture and sound quality. They were all very similar. When I saw this one on Amazon for one hundred dollars less than Best Buy's sale price I couldn't believe it so I bought it. It was delivered within the week, brought into my house and unpacked all for no additional cost. As far as the TV goes I could not be happier. This thing is great and very easy to set up.I am still in awe of the picture quality over my thirteen year old set.", "Date": "October 9, 2008"}, {"Title": "Great product", "Author": "Jay Jay Vee", "ReviewID": "R2O639FEKCT6UH", "Overall": "5.0", "Content": "Based on the other reviews I bought the Panasonic TC-32LX85 LCD HDTV.  The picture is great.  Very bright and clear.  It does dim a bit off to the sides, but I never watch at that angle anyway.  Was a bit worried with UPS delivering as it seems they manage to destroy everything these days.  Box was torn up and retaped with clear tape.  Luckily nothing inside was damaged.  Great TV and I wouldn't hesitate to buy another.", "Date": "October 3, 2008"}, {"Title": "Great price, great TV!", "Author": "ak3883", "ReviewID": "R2XW9XZV6A4XAZ", "Overall": "5.0", "Content": "If you do some research you will quickly find that this is one of the top-rated 32 inch 720p LCD's on the market today, with the other one being the Samsung 32A450.  However it has been discontinued recently, so it will continue to get harder and harder to find.  I found this at Best Buy for STEAL at $499, brand new.I bought this set for the bedroom, and as a secondary HDTV.  The out of the box settings were pretty good, just a few adjustments.  HD channels from my Comcast DVR looked sharper on this LCD than on my 56'' DLP(which is a few years old).  Even analog or SD digital channels don't look that bad, not as bad as I would have thought they would have looked.PROS:-Great all around picture quality, HD channels look fantastic.-Outstanding viewing angle.  Panasonic uses IPS panels to achieve this, the viewing angles blow my Samsung T240HD monitor away.-You can edit digital channel labels(7 characters too!), Samsungs only let you name analog channels, cable or OTA.-Solid ATSC reception, picked up every channel my other sets do.-3 HDMI inputs.-TV styling/cabinet looks sharp.CONS:-No PC input-No \"Just Scan\" or 1:1 pixel mapping aspect ratio.-Power cord attached to back of set, cannot detach.  I think this is the first set I've came across that had this.-Menu navigation not as smooth/intuitive as Samsung TVs.  Channel labeling was very cumbersome, you cannot change channels as you add/remove/label them, it's all done on a menu with the current channel on in the background.-Slight hum, people are exaggerating this.  I have extremely sensitive hearing and can hear many high-pitched sounds that other 26yr old people cannot.  The hum can barely be heard in a dead silent bedroom as you are falling asleep.This TV is an all-around great performer.  If you were thinking about getting a secondary HDTV(or even a first HDTV) and don't want to spend a fortune, run to Best Buy and see if they have any more.  $500 is a steal for a set this great.  The Pros FAR outweigh the cons.", "Date": "January 20, 2009"}, {"Title": "32 in. HDTV Panasonic", "Author": "Bruce W. Hodgson", "ReviewID": "R2SFUQR1HZTLO4", "Overall": "4.0", "Content": "The TV has a great picture and the remote is easy to navigate but it has two 20watt speakers built-in. These don't quit give out the quality of sound one wants. I still feel the set is a value but needs sound system.", "Date": "October 19, 2008"}, {"Title": "Beautiful picture, beautiful price. Not enough component connections.", "Author": "Seth C. Short", "ReviewID": "R32WKNJV4WVFEX", "Overall": "5.0", "Content": "I ordered this TV from BuyNow, based on a review from CNET. They said the picture on this TV was the best they've seen, except for the Samsung LN32A450. The Samsung is $100 more than this TV, and I could barely justify $500, so I got this one. I don't regret it. It's got a wonderful picture, decent sound, and my Xbox 360 looks great on it.I mis-read the connections, and thought it had two component plugs. I was planning to put my Xbox on one component input and my DVD player on the other. Instead, I've got my DVD/VCR hooked up to a composite connection. The picture into that input isn't ideal, but it's still pretty decent, and if I want to play DVDs I just play them through my Xbox and it upsamples for me.My Tivo looks great on the S-Video connection, too, although the TV is so accurate that we can clearly see the compression artifacting in programs that are recorded in \"Basic\" mode. I'm going to have to get used to that. That's a good thing, though, since it shows that the picture on this TV is that much better than the one on my 27\" Trinitron.So, if you're looking for a great 32\" TV at a reasonable price, this is your best bet. We'll have to see how it holds up quality-wise, but I'm pretty confident since Consumer Reports rates Panasonic as one of the most reliable brands.Oh, and by the way, I'm very satisfied with how BuyNow treated me. I ordered this TV, and when I got it I was upset at myself for not realizing that it didn't have enough component ports, and I wrote to BuyNow asking to send it back. They got back to me 2 days later with a RMA authorization and a prepaid UPS label and everything. I decided to keep the TV once I got it hooked up (I realized I would have to compromize on picture if I went with a different model, or pay more for the Samsung), but I was surprised and pleased that they accepted my request without fuss.", "Date": "December 22, 2008"}, {"Title": "lcd tv", "Author": "M. Carlin", "ReviewID": "R2AS99VW7EMVZV", "Overall": "5.0", "Content": "This is a great set, the color and the picture quality are fantastic,and it looks great from different angles,something I noticed some other sets did not do as well.We are very happy with our new tv and would recommend it to anyone.", "Date": "December 13, 2008"}, {"Title": "Great TV, Great price, Great service!", "Author": "D. Crosby", "ReviewID": "R1J4T4K42G2LM5", "Overall": "5.0", "Content": "This is our third Panasonic TV.  This one is for my office (32\"LCD)  The others are a 42\" plasma (bedroom) and a 50\" plasma (family room).  The quality of these TV's are the best I have seen.  No problems with any of them.  We now have the whole family hooked on them.  The price of my 32\" was great.  $200. less than anything I could find around town.  The servers was great as well.  Had it here within one week.", "Date": "December 12, 2008"}, {"Title": "this  tv is  awesome", "Author": "C. Barnett", "ReviewID": "R1TSEYMJQ2JYUF", "Overall": "5.0", "Content": "After reviewing other customer review i bought this tv so  no regrets. It's  awesome great picture,and very good sound quality.For under $500 you cant beat that. Anyone shopping for a good tv go and get this one.", "Date": "December 10, 2008"}, {"Title": "I love my new TV", "Author": "Joan P. Walkovitz", "ReviewID": "R2HLWN75V4LYY0", "Overall": "5.0", "Content": "This TV is wonderful.  I also added an HDMI cable.  It looks and sounds great.", "Date": "November 19, 2008"}, {"Title": "Panasonic TC-32LX85 32-Inch 720p LCD HDTV", "Author": "Ron R.", "ReviewID": "RKA5R0IOXAOUR", "Overall": "5.0", "Content": "Panasonic TC-32LX85 32-Inch 720p LCD HDTVA terrific HD picture, even though it's only 720p.  A great set for a second or third room.  I am Panasonic all the way anyway - absolutely the best!", "Date": "October 24, 2008"}, {"Title": "panasonic tc-32lx85", "Author": "Kerry L. Boulay", "ReviewID": "RZH6S8YOU5SKN", "Overall": "5.0", "Content": "This TV is great and exceeds all my expectations. the service at 6AVE WAS OUTSTANDING DELIVERY WAS PROMPT AND IT WAS DOUBLE PACKED. Thank-You Amazon and 6AVE. for a stress free shopping experience", "Date": "December 13, 2008"}, {"Title": "Razor Sharp Picture", "Author": "Frank Phillips \"brother in arms\"", "ReviewID": "R3EEXBQO5IF6UD", "Overall": "5.0", "Content": "Purchased this TV for master bedroom. Perfect size as room is quite large, 19' x 20', and you can easily see the picture and read the screen text from the bed. Colors and clarity as well as resolution are outstanding. TV arrived in a couple of days and setup was easy. Great value from Amazon....", "Date": "May 8, 2009"}, {"Title": "Very good", "Author": "Pablo Gomez", "ReviewID": "R2OEP096HD2PUA", "Overall": "5.0", "Content": "Very good LCD Tv.Escellent image, functionsThe speakers' sound is too weak, but if you connect with a home theater it won't be any problem.", "Date": "April 13, 2009"}, {"Title": "Smooth", "Author": "Dave L \"Yellow Jacket\"", "ReviewID": "R37I6MFPRLBLCD", "Overall": "5.0", "Content": "I bought this one at the same time that I bought the 50\" plasma.  Though I have already had a problem with the plasma, this one has been up to expectations.  Easy to set up, and I have no idea what is meant in other reviews about green casts....the picture & color are excellent.", "Date": "March 15, 2009"}, {"Title": "Happy w/Panasonic and eMotronics as seller", "Author": "N \"Nate\"", "ReviewID": "R32HDF39JJ706M", "Overall": "5.0", "Content": "After reviewing info and comments on line about this Panasonic item, I'm fully satisfied with the solid black frame and the quality of the picture. It set up without problem right out of the box.  I selected eMotronics for lowest price at the time and high ratings from comments. My only concern was that I could not find a physical location/address for the company, and was hoping for closer shipping point. From UPS tracking I learned that point of origin was Miami -- my location is Oregon -- so it had a long trip, but thankfully without damage. Shipping in plain exterior carton without markings and original sealed carton inside. No markings outside for \"top\" \"this side up\" or \"don't stack on side with screen\" might well lead to problems -- and might well be recommended.  I would buy from them again, if price were right.", "Date": "February 28, 2009"}, {"Title": "Somewhat disappointing viewing angle and PQ, but well priced", "Author": "Is It Dead Yet", "ReviewID": "R2E1MU9CB5BIOH", "Overall": "3.0", "Content": "To start, I have reviewed three other hdtvs on amazon (including a 32'' magnavox). In deciding on a replacement for the 32'' magnavox lcd for the living room, I visited Video Only to shop for my next set.My eyes were sqarely on the Sony KDL-32M4000 (price $649), I have the 26'' model which is a superb performer. While discussing some opinions with the sales clerk, he turned my attention away from the KDL-32M4000, claiming:''The KDL-32M4000 is not manufactured by Sony, but by Vizio.''''The Panasonic 32-inch blows the Sony out of the water.''After owning both sets, I believe this to be just 'sales talk'.After hearing this, my attention had become turned toward the Panasonic TC32LX85. The Video Only clerk was pushing to sell me the Panny.The store had just gotten a bunch of them in (mine was manufactured January 2009), and being hard to find in stores, I was persuaded to get one. The clerk also told me the Panny outperforms the Sony in every respect due to the Alpha IPS panel. There was no display model of the Panny (I wish there had been), so I was taking a shot in the dark.Whats more? The Panasonic TC32LX85 was priced to sell (clearance price: $480!) as its 2008 model run is coming to an end. 2009 Models are coming soon!At $170 less than the Sony, I saw this as the steal of the year! I swiftly purchased the Panny.Upon getting home and setting it all up, the plusses and minuses were quite discernable.The Good:On the plus side, this tv has a very attractive bezel appearance and a very nice remote. Color detail is top notch (again, Alpha IPS) and the most natural I have seen. The menus are easy enough to navigate.The dual 20 Watt speakers produce excellent sound and lack the feint hiss that is heard on the Sony models.Performance with HD content looks good, plus there are 3 HDMI inputs.The Bad:This tv had trouble picking up all over-the-air channels, I had to go through auto channel setup 4 times before it would pick up all the channels. Auto setup is quick enough though (takes about 5-10 minutes).Externally there is no menu button, so don't lose your remote! There is also only one Component Video input. Also beware if you like your inputs on the left-hand side of the tv (from the front), they are on the right side.Even being IPS panel, the viewing angle on this set was surprisingly bad and quite narrow with darker areas of the picture (most lighter colors and shades of grey are unaffected).Vertically, it is not too bad, but horizontally, any dark-colored or black areas present in the picture take on an extreme dark-blue effect, and it masks fine details, quite annoying.The Sony loses a small bit of color fidelity when viewed off-angle , but it was'nt nearly as noticable or inhibiting as the blue-effect that is plainly seen in dark areas on the Panasonic.Picture quality was inferior to my 26''/32'' Sony hdtvs and especially with SD/DVD (even after fine-tuning CNET's calibration settings). The picture is just not as sharp and detailed as the sony, but its still a good quality picture (bright colors look slightly better).After noticing all of this, I decided to return the Panasonic the next day and picked up the Sony 32M that I originally had my eyes on (albeit, for $170 more). The same clerk was there when I arrived and seemed baffled that I chose the Sony over the Panny. Viewing angle and PQ are most important to me and the Sony wins hands down (the higher price is justified). I think the Video Only clerk either seemed to be a bit biased toward panasonic or they just wanted push the TC32LX85 models that were on clearance. Regardless of the bad points, the Panny is still a great hdtv. Just be sure youre sitting at least 6 feet away from it, or the viewing angle will become quite bothersome. At the price I found it for (again, 30% off at only $480!), I recommend anyone to call around and try to find it at that price because its one of the best deals I have seen on a 32-inch hdtv in a long time.", "Date": "February 10, 2009"}, {"Title": "Good SD picture, plenty of inputs", "Author": "Scott Alexander", "ReviewID": "R101C5X1ENH251", "Overall": "5.0", "Content": "This TV is for a second room in my home.  My main TV is a Panasonic 50 1080p plasma, so most of my review will be a comparison between the two.Setup:- Time Warner Explorer 8300HDC, connected HDMI- Toshiba HD-DVD A30, connected HDMI- Wii, connected via componentPros:- Good SD scaler.  There is enough SD content viewed on this TV for me to comment on it and since this set native resolution isn't as high as 1080p AND the set size isn't too large (32\"), SD viewing is very enjoyable.  Panasonic's scaler does a good job of upscaling this content.- Plenty of HDMI inputs.  My two year old Panasonic plasma has only two HDMI inputs and this newer set has three!  Component input is limited to one, but this input is being phased out- Discrete inputs -- a universal remote works very well with this TV- Game mode (the TV inputs have direct labels on screen).Comparison:Picture: I *do* prefer the plasma look over the LCD.  That isn't to say that the LCD picture isn't very good (it is), but the colors on the plasma is better than this LCD.  For the room that this TV is in (brighter, in general), this set does a wonderful job when there is plenty of lighting.  Most viewing is about 6-8 feet back and its viewable angles are plenty fine.Audio: Good sound, no complaints here.Remote: Great ergo feel.  Smaller remote than the plasma's set, but very similar.Setup:  Back lighting tweaks (very useful on LCDs)!  Not sure if each input can save different settings (haven't checked), but there are enough adjustments that I care about.I'm very happy with the set and would recommend it to anyone specifically looking for an HDTV set in this size and specifically aren't looking for 1080p (mainly on budget).  This is the third Panasonic set I've ever owned and I'm not disappointed.", "Date": "January 26, 2009"}, {"Title": "Second LCD 32 inch, Ist Sylvania NO, 2nd Panasonic YES!", "Author": "Mickey M. Jones", "ReviewID": "RQZ5X7XSAPPOC", "Overall": "4.0", "Content": "I started my adventure 1 week ago, when I went to Costco to pick up a Samsung 32 inch LCD at $599.99, then I saw a 32 inch Sylvania with what looked to be a great picture. So at $399.99 I thought what the heck, I will give it a go....well, it had horrible color variations, I think it had really poor response time, although I can't find that specification anywhere. I think there is a reason for that.So after finding out that the Samsung has 3 different manufacturers of their front panels, only the S for Samsung is the good one, (It is found at the end of the model number on the TV) I studied up and since I already have a Panasonic Plasma 42 inch which I love, I got the Panasonic TC-32LX85 at a local store in Indianapolis which is having a sale and I got it for $559.99 +tax.The picture is crystal clear and the sports on ESPN are pretty good for a LCD. I am used to the remote,(Other Panny) although I don't think it has a recall button that tells you what the display is giving you, ie, 720p, full etc.I will have to see if it is under some other button I don't know yet. One downside, it only has 1 component input, and I have a Nintendo Wii and a DVD player that have the same hookup I want to use. I guess I will just have to upgrade to a blue ray :) with HDMI input.So today I am happy with this new TV!", "Date": "January 17, 2009"}, {"Title": "flat screen hdtv", "Author": "Steven Frimmer", "ReviewID": "R3VM1PGHO784XX", "Overall": "4.0", "Content": "watching tv on a 32-inch flat screen hdtv is far superior to watching it on regular tv, and depending upon the room size, 32 inches is good. also, a 720 set is just as good as a 1080 and much cheaper", "Date": "January 14, 2009"}, {"Title": "Best Picture Ever", "Author": "Juanita Thomas", "ReviewID": "R2XWGIMZBK2XDJ", "Overall": "5.0", "Content": "After my so great Vizio TV broke after only a 1 1/2 yrs, I bought this panasonic and it has the best picture I have ever had. Such vivid pictures and color. With the HD channels, you feel like you could just reach out and touch them. If you want a great TV, buy this panasonic - you wont regret it.", "Date": "December 27, 2008"}, {"Title": "WORTH THE MONEY", "Author": "PC", "ReviewID": "R1W4ZL4XEZM6R8", "Overall": "5.0", "Content": "I purchased this tv three years ago ($1200) to put into my entertainment center. At the time, the Sony and Samsung were rated very high for a 32\" screen size. After careful review I decided for the price and quality the Panasonic was a better choice. I am now in the market for another tv that size and I decided to google the same model # and see that the price is less than half. I will certaintly be purchasing another Panasonic TC-32LX50.", "Date": "December 27, 2008"}, {"Title": "Panasonic Viera TC-32LX85", "Author": "K. Halcomb", "ReviewID": "R13GN6K93W73ZB", "Overall": "5.0", "Content": "Incredible picture for an outstanding price.  Previewed it at a local store before buying and the quality was just as good as more expensive models.  Saved $200 buy buying it online.", "Date": "December 7, 2008"}, {"Title": "Excellent HDTV", "Author": "Jason D. Daniel", "ReviewID": "RI4U33SLBB1IF", "Overall": "5.0", "Content": "I did a lot of research before purchasing this TV as this is my firstHDTV purchase. I went to several retail outlets(best buy, hhgreg, circuit city, sears, etc..) to view picture quality and hear sound quality of several brand names. Boiled down to Samsung, Panasonic, and Sony. Finally made my decision based on customer and professional reviews and price. I paid $545 for my TV with no additional shipping cost or tax, had ground shipping and the TV showed up at my door two days, yes TWO days later on a Saturday. Really enjoyed watching football that weekend on the new set but had Direct TV come out the following Thursday and install my HD DVR reciever. WOW!!! I am totally satisfied with my purchase. HD picture quality is AMAZING on this set. Sound quality is great as well. I could not be any happier with the TV or the process of acquiring it.", "Date": "December 1, 2008"}, {"Title": "good buy", "Author": "John A. Stobbe", "ReviewID": "R1F6IWR8TGDHKQ", "Overall": "5.0", "Content": "great TV, inexpensive, but gets the job done. Bought it as a gift and was shipped very quickly.", "Date": "October 26, 2008"}, {"Title": "Panasonic TC-32LX85 32-inch 720p LCK HDTV", "Author": "M. Napier", "ReviewID": "R105QYVBH44QR1", "Overall": "4.0", "Content": "I researched tv's both on-line and in-store.  The price was less than at the local electronic store.  I didn't pay taxes or delivery and didn't have the hassle of hauling the set home.  I placed my order on a Tuesday morning and the set was delivered Thursday before 10:00 a.m.  Perfect condition, exactly what I ordered, best price, at my front door.  What could be better.", "Date": "November 29, 2008"}, {"Title": "LOVE MY TV", "Author": "Linda Libeer", "ReviewID": "R14ZUIQLTGKS7V", "Overall": "5.0", "Content": "Perfect for my needs - gets excellent reception and great audio.  So glad I purchased it, I bought another just like it for my bedroom.", "Date": "July 11, 2013"}, {"Title": "Panasonic 32 inch flat screen", "Author": "Tom Wolf", "ReviewID": "R2F2CLOXN38OA5", "Overall": "5.0", "Content": "Very satisfied with this product. Easy to install and use.Quality picture and reasonable price.I would recommend this product.", "Date": "July 9, 2013"}, {"Title": "its a viera", "Author": "ang nc", "ReviewID": "R35RT0791ATUHK", "Overall": "5.0", "Content": "we wanted a hd tv for our guest bed room and this baby fits the bill . great picture and features just the right size", "Date": "February 24, 2013"}, {"Title": "Panasonic TC-", "Author": "Mykle Moys", "ReviewID": "R4MJJXFAHW2PD", "Overall": "5.0", "Content": "Have been enjoy it, now if I could just get some of the channels without having to pay Comcast for a whole bunch of junk!", "Date": "January 30, 2013"}, {"Title": "Panasonic 32 in. 720p", "Author": "Edufizzle", "ReviewID": "R2985DWJTKCMBJ", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3BQYITGJF5528embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3BQYITGJF5528refresh_preplay() {\n\ndocument.getElementById(\"cv_mo3BQYITGJF5528chiDiv\").innerHTML = document.getElementById(\"cv_mo3BQYITGJF5528hiddenPre\").innerHTML;\n};\ncv_mo3BQYITGJF5528refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3BQYITGJF5528so;\t   \n\n\nfunction cv_mo3BQYITGJF5528loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3BQYITGJF5528so = new SWFObject(swfLocation, \"cv_mo3BQYITGJF5528AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3BQYITGJF5528so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3BQYITGJF5528so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3BQYITGJF5528so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3BQYITGJF5528so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3BQYITGJF5528so.setAttribute(\"height\", swfHeight);\n          cv_mo3BQYITGJF5528so.setAttribute(\"width\", swfWidth);\n          cv_mo3BQYITGJF5528so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3BQYITGJF5528so.write(\"cv_mo3BQYITGJF5528flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3BQYITGJF5528', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3BQYITGJF5528';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3BQYITGJF5528', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3BQYITGJF5528loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3BQYITGJF5528\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mPDVQGJ1CMI0R\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mPDVQGJ1CMI0R\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2985DWJTKCMBJ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mPDVQGJ1CMI0R/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3BQYITGJF5528duration')) {\n      document.getElementById('cv_mo3BQYITGJF5528duration').style.display='none';\n    }\n    cv_mo3BQYITGJF5528loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3BQYITGJF5528loadSwf(movieID, playerVersion) {\n   return _cv_mo3BQYITGJF5528loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3BQYITGJF5528newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3BQYITGJF5528', 0, h);\n}\n\nfunction cv_mo3BQYITGJF5528resetPlayer(w,h,bw,cc) {\n  cv_mo3BQYITGJF5528newHeight(h);\n\n  cv_mo3BQYITGJF5528so.addVariable(\"resetBandwidth\", bw);\n  cv_mo3BQYITGJF5528so.addVariable(\"cacheCode\", cc);\n  cv_mo3BQYITGJF5528so.setAttribute(\"height\", h);\n  cv_mo3BQYITGJF5528so.setAttribute(\"width\", w);\n  cv_mo3BQYITGJF5528so.write(\"cv_mo3BQYITGJF5528flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3BQYITGJF5528RollOverImg = new Image();\ncv_mo3BQYITGJF5528RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81xzu887cjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3BQYITGJF5528preplay = document.getElementById('cv_mo3BQYITGJF5528preplayImageId');\nif (cv_mo3BQYITGJF5528preplay) {\n  cv_mo3BQYITGJF5528preplay.onmouseover = function() {\n    cv_mo3BQYITGJF5528preplay.src = \"http://ecx.images-amazon.com/images/I/81xzu887cjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3BQYITGJF5528preplay.onmouseout = function() {\n    cv_mo3BQYITGJF5528preplay.src = \"http://ecx.images-amazon.com/images/I/81xzu887cjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3BQYITGJF5528preplay.parentNode;\n\n  var cv_mo3BQYITGJF5528currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3BQYITGJF5528currentClick) {\n      return cv_mo3BQYITGJF5528currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:33 Mins", "Date": "February 23, 2011"}, {"Title": "Superb TV - after 1 year of use.", "Author": "DocJ2005 \"DocJ2005\"", "ReviewID": "RJI80KYY1R2EK", "Overall": "5.0", "Content": "I bought this TV in Christmas '08 for my wife for use in our Master Bedroom.  After a year, I have nothing but good things to say.I did a pretty good bit of research on this product, having owned a Panasonic 42\" plasma prior to this.  I got it in conjunction with another Panasonic 37\" LCD for Christmas, and both are spectacular.  The hue/green tone problems mentioned in the \"most helpful negative review\" just don't play out with our TV.  The colors pop, the screen is bright, and the sound is very good.  If I was sitting 3 inches from the TV with high-tech color calibration gadgets, could I uncover some imperfection?  I suppose so.. but would it matter?For everyday use, this TV delivers a crystal-clear image that is light-years above the CRTs of recent memory.  If you have a nice source (such as DirecTV HD boxes), a TV this size looks great in 720p.  There's just no need for 1080p unless you're getting above 37\" - 42\".  For the price listed now, it's a steal.  I spent about $300 more just a year ago.Overall, another first-rate TV from Panasonic.", "Date": "December 4, 2009"}, {"Title": "My Wife Loves her new TV", "Author": "Herman W. Duncan \"Wayne D\"", "ReviewID": "R2G9PI8AVLI2SM", "Overall": "5.0", "Content": "The shipping container arrived with a four inch hole in the side, but the TV was not damaged. It installed easily and my wife loves it! Thanks.", "Date": "April 13, 2009"}, {"Title": "Panasonic Flat Screen", "Author": "Emily \"Emily\"", "ReviewID": "R1K2ZIBBP2XXDW", "Overall": "5.0", "Content": "Bought for family Christmas.  Fast shipping, looks great.  We have really enjoyed it.  Our 1st flat screen, very happy with it.", "Date": "February 9, 2009"}, {"Title": "My new Panasonic TC-32LX85 32-Inch 720p LCD HDTV", "Author": "John Irby", "ReviewID": "RFT8TNUVKU63E", "Overall": "5.0", "Content": "This product is the best of its kind. The quick setup is straightforward and hassle free. On my old fashioned TV, watching a golf tournament involved a lot of guesswork. On putts, I couldn't see the hole until the ball disappeared into it. Now it's like being there. Everything is changed now. When watching a news anchor or an actor, you can see his makeup. You can see tiny details on the face. Once the power went off for a few seconds and it took me about a minute and a half to redo the setup. Now I could probably do it without referring to the manual. I had done a lot of research before getting the Panasonic, and I believe it paid off.", "Date": "February 9, 2009"}, {"Title": "Great value", "Author": "Eric S. Holtam", "ReviewID": "R20001H4D41QPM", "Overall": "4.0", "Content": "I ordered this before Christmas 2008 for $499.  Its now $700 and I'd still recommend it.  The picture is great and the sound is adequate for our smallish bedroom.  The menu system is intuitive and getting to the sleep feature is easy which is nice since we watch tv in bed.  The TV does take a bit longer than most to turn on but once its on it looks great.  I had to play with the color settings to get it to the way I like but its now a beautiful picture.  I've used both component and currently HDMI connections.  Both were crisp and clear.", "Date": "February 6, 2009"}, {"Title": "extremely good LCD TV", "Author": "Zhigang Mei \"David Mei\"", "ReviewID": "R3GT62JU6MSK6A", "Overall": "5.0", "Content": "the picture is vivid, and clear. We play PS3 games on this TV. It behaviors well. It has 3 HDMI ports. We also use it as a monitor, if you your computor has a DVI port.", "Date": "January 30, 2009"}, {"Title": "Excellent HDTV", "Author": "Rachel P \"rachel\"", "ReviewID": "R2P30VP11YFY3T", "Overall": "5.0", "Content": "I bought this TV about a week ago. It was easy to set up - in fact the base was attached when I removed it from the box. I hooked it up to my non-HD satellite service and I'll admit I wasn't wowed, but it was a definite improvement over my old anaolg set. But then a few days ago, I upgraded to HD satellite service. That's when I was really wowed! It's an HDTV so obviously you don't get the full benefit of HD without HD service (duh! yes, I'm blond :-) The picture on this TV is so clear and crisp -the blacks are really black, and it has good shadow definition while maintaining the brightness I like. Even my satellite installer said it had an excellent picture, and he sees HDTVs all day long.I had to tweak the picture settings quite a bit to get the colors, brightneess, and backlight right for me, but it was easy enough to do.The speakers are not bad, but they are not great either. However, I also bought the Panasonic Blu-Ray Home Theater (which I also gave a 5 star review) with 5.1 channel surround sound, so I only use the TV speakers at night when I need to keep the sound down anyway.I can't gush enough about Panasonic! These are excellent products, and together they make for one awesome home entertainment system! I have a small living room (12x13) and this 32\" TV works perfectly. A 37\" or 40\" TV would have provided more of a true theater environment, but I didn't want the TV dominating the room.I looked at Samsungs and Sonys in the stores yesterday, and the price tag for one with a picture as good as this was way over $1000. I highly recommend this TV.", "Date": "January 28, 2009"}, {"Title": "Big Improvement", "Author": "Mary E. Walters", "ReviewID": "R1SACI90GDI7YN", "Overall": "4.0", "Content": "I really like my new Panasonic 32inchLCD HDTV. Best of all, it didn't costan arm and a leg. I have 2 older TV's, 25 and 19 inches, and this is somuch brighter and bigger. I'm happy to have it!", "Date": "January 27, 2009"}, {"Title": "Great set for gaming, etc.", "Author": "Jeremy Sharp", "ReviewID": "R1MNM1070RNCK1", "Overall": "5.0", "Content": "I'll try not to repeat what others have already said, but I will add another very positive review of this TV. Here's my setup:-TV connected to Sony receiver via optical cable-PS3 connected to TV via HDMI-Comcast digital cable HD box connected to TV via component cablePros:Picture - I'm certainly no videophile and thus can't really comment on technical details of picture quality, but I will say that it looks fantastic as far as I can tell. Blu-ray movies look amazing (especially Dark Knight - blacks looked really good) and the PS3 picture blew me away when compared to our SD set. I found my calibrations on AVS Forums.Menus - easy to navigate and change picture settings.Connectivity - others have mentioned the lack of PC input, but this didn't matter for me. Plenty of connections.GAMING! - there is NO NOTICEABLE LAG on this set. When I was doing research, this was a major issue with other sets for anyone playing games like Rock Band, Guitar Hero, and first person shooters. This set has none that I can find. Big plus for me.Cons:Remote - looks a little cheap but functions well.HD Cable - could be our cable provider, but the picture doesn't look as good as I thought it would.All in all, I'd give this a 4.75 if possible. I love it, and after one month of ownership it's just getting better. 720p is plenty of resolution for a set this small and the distance we're watching from (6-8 feet). Highly recommended!", "Date": "January 26, 2009"}, {"Title": "Very pleased", "Author": "Gary P.", "ReviewID": "R13BB79C28LXO5", "Overall": "5.0", "Content": "After doing some research and reading reviews I selected the Panasonic TC-32LX85.  I am happy with the picture on standard signal. I don't need the HD. The sound is great also. I have absolutely no complaints.", "Date": "January 21, 2009"}, {"Title": "Panasonic 32 vieta LCD TV", "Author": "M. joanTretter \"camper\"", "ReviewID": "R2XZ7ZPBEIVZBQ", "Overall": "5.0", "Content": "Just as expected. Excellent TV with a great picture. Seems bigger than a lot of 32 inch screens but of course that is not possible.", "Date": "January 21, 2009"}, {"Title": "GREAT TV", "Author": "\"RB\"", "ReviewID": "R14GVT2CHYQEDE", "Overall": "5.0", "Content": "This tv is fantastic. This is the 2nd one of these I've purchased and this one was given as a gift at Xmas. Highly recommend BUY-IT.", "Date": "January 19, 2009"}, {"Title": "Panasonic TC-32LX85 32\" HDTV", "Author": "T. Smith", "ReviewID": "R3AG086VB9C1WQ", "Overall": "5.0", "Content": "This is a great TV.  Facial tones are excellent and all colors are vivid.  At present some TV stations broadcast in both analog (i.e. channel 8) and digital (i.e. channel 8-1).  The analog reception is grainey which is expected, but much better than my previous 10 year old TV.  When I change channels to digital the reception is crisp and clear and I use the rabbit ears antenna from my old TV.  I researched reviews on TVs and the 2 or 3 reviews I found recommended this Panasonic in the 32\" size.  It has great reviews from buyers and I can see why.  Less expensive than a Sony and I'm quite pleased with it.", "Date": "January 17, 2009"}, {"Title": "Great TV", "Author": "Martin 71", "ReviewID": "R2QOR4W8TGKF03", "Overall": "5.0", "Content": "I've had this TV for four months now. I got it from Sixth Avenue, and the free shipping was terrific. DHL did the delivery, and there was no damage what so ever. The guy even offered to carry it up to the second floor for me, and then waited patiently while I opened the exterior carton to check the interior one.I live in a suburb outside of Chicago. I get my signal over the air with a rooftop antenna. I get nine HD signals and three SD signals that I surf regularly, and another thirteen SD signals for when I'm really bored. CBS (2-1) is occasionally a little iffy, but all the other signals are at 95% - 100% all the time (the set has a nifty signal meter).The wide screen HD shows are fantastic. At first, the images were overpowering. I used the Custom picture setting to tone everything down, and now it's perfect. Even though the set is 720p, you can see the difference between a 720p and a 1080i signal. It's not much, but it's there. As for the complaint about a green hue, either the guy set it up wrong or it's a defective set.A friend of mine has a (top of the line brand name) 37\" 1080i set that cost twice what this one did. He gets HD over the wire. There are lots of HD channels, but not that much HD material. HD material on an HD channel doesn't seem to have much 'punch' to it. SD material on an SD channel is weak. I'm not sure if it's the TV, the service, or he hasn't 'tweaked' it properly, but I like my setup better.The only complaints I have are that switching between channels is slow, nearly a second, and the remote could be laid out better, but both are tolerable.All in all, a great set at a great price. Highly recommended.", "Date": "January 14, 2009"}, {"Title": "Exceptionally good value!", "Author": "K. Hitchcock \"traveling retired Boomer\"", "ReviewID": "RSXPZW1ZTYOJZ", "Overall": "5.0", "Content": "We got the TV as a gift for our parents. It was delivered quickly, and was super-easy to unpack.The set-up process was fast and easy. We connected the dish receiver box to the TV, plugged in the TV, and it worked. We followed the directions for set-up and it was a breeze. Everything should be this easy!The picture is super-sharp and clear, easily visible from oblique angles. Our parents are enjoying this TV very much, and have not had one bit of trouble with it. All in all, every electronic device we buy should be as good and easy to set up as this TV. We'll buy one when our present TV finally gives out. We highly, HIGHLY recommend this Panasonic TC-42LX85, without hesitation. Get one!!!", "Date": "January 12, 2009"}, {"Title": "good buy", "Author": "R. Dutt", "ReviewID": "R17LUHH9BTLIUT", "Overall": "5.0", "Content": "very prompt shipping. excellent TV will all the bells and whistles. great picture and a good price. can go wrong", "Date": "January 12, 2009"}, {"Title": "panasonic 32 inch lcd", "Author": "Frank Sullivan", "ReviewID": "R8OA8SXRNKG1C", "Overall": "4.0", "Content": "purchased product 3 wks ago - brilliant colors, good sound, easy to operate.  would recomend to friends and family.", "Date": "January 12, 2009"}, {"Title": "Great, solid TV", "Author": "A. Munich \"A.M.\"", "ReviewID": "RSLWPDWF2UTMF", "Overall": "4.0", "Content": "I purchased this product after watching the price go up and down for some months and while doing research on LCD TVs.  My husband and I needed a replacement for the bedroom, and knowing that many who buy LCD TVs wish they'd gotten a bigger screen, we went for the 32\" instead of the 26\". We looked at this and a couple of Samsungs, having dismissed the rest of the competition after viewing 32\" LCD TVs at several local stores (and after hearing bad things about Sony LCD TVs).  We wanted dependability, deep color resolution, and great viewing angle -- we have a bright bedroom and wanted a great picture. We are not disappointed at all.  The images are crisp and colorful, and the color scale seems more correct than with other TVs we viewed.  I also love the SD photo feature, where you can just slip in a disk on the side to view pics. I have not yet plugged in any external media, so cannot say much about that. The set up was very easy (we simply have it on its stand on a dresser).  One gripe I do have (and why I gave 4 stars and not 5) is that the remote, while logical, is not as 'easy' as with our old analog TV.  I would have liked the \"sleep\" feature to be its own button, rather than part of the menu (so you need a couple button clicks to access it), and I would have liked a 15 minute sleep option, but it starts at 30 minutes. Small gripe, but important in my world since we are using the TV in our bedroom and will definitely be using the \"sleep\" function all the time. Otherwise, it did not take long to intuitively learn the remote.  All in all, a great TV if you're looking for one in the sub 37\" range.", "Date": "January 11, 2009"}, {"Title": "Very Satisfactory", "Author": "Leo E. Bennett", "ReviewID": "R1Q4UOAPZWFZVS", "Overall": "5.0", "Content": "As we have a 42\" in Michigan and now the 32\" in Arizona we can make comparisons. Both performe excellently one is on cable the other on antena.We especialy injoy the SD card function. Both the 42\" and 32\" are very clear and well balanced color.  (And the cardenals wone yesterday)", "Date": "January 11, 2009"}, {"Title": "Bon Marche", "Author": "M. S. Schulman \"hedonist\"", "ReviewID": "R11NRLOMD1N0OP", "Overall": "5.0", "Content": "THe picture is pristine and the sound is above average.The hook up proceedure was easy,even, for a moron such as myself. I am well and truely happy with this purchase.", "Date": "January 8, 2009"}, {"Title": "Great picture and features", "Author": "Jesse L. Underwood", "ReviewID": "R2L3G0X738L45V", "Overall": "5.0", "Content": "This set has so far met all of my expectations.  My first LCD TV.  Very happy with the picture and sound quality.  In this size set, the 720p quality is excellent.  Still haven't hooked the VCR, DVD, amp, etc. but there are plenty of connections to make it easy.", "Date": "January 7, 2009"}, {"Title": "I like this TV", "Author": "John M. Cornell \"CMMGUY\"", "ReviewID": "R2QBW0TLGC8ZZO", "Overall": "5.0", "Content": "I bought this TV on cyber Monday for $499.99, free shipping.  I have 3 LCD TV's.  For the money, it is the best TV I have.  The picture is very crisp and there is no hesitation between channel changing.  My next LCD TV will be a Panasonic.", "Date": "January 7, 2009"}, {"Title": "GREAT TV FOR ITS LOW PRICE", "Author": "Julio A. Diaz", "ReviewID": "R31XS0SPVPAD24", "Overall": "5.0", "Content": "I did alot of research before I bought my first HD LCD TV. This was the perfect one. It was on sale for $499 so I had to jump on it. It has got better then all the rest picture quality. The sound is ok need a little bit more bass, but I have powered sub-woofer that rocks the wall so Im ok with it. But it sounds pretty damn good with out it. This TV picked up channels I didnt even know existed. I was shocked. I have Standard Cable and I already knew what channels I have. This TV picked around 10-15 more channels with out a cable box. WOW, good tuner. You wont go wrong with buying this TV. Stop your research now and buy it. I would have paid more for this TV now that I know what its capable of.", "Date": "January 6, 2009"}, {"Title": "Love my TV", "Author": "cynic", "ReviewID": "R32W5Y15EELO25", "Overall": "5.0", "Content": "I am so happy with the purchase of this TV. First of all, I saved well over 2oo bucks compared to the prices at the local chains on sale! Second..I was wary of purchasing a big electronic item online for fear that I wouldn't have a local store to run to if I had problems.  My fears were unfounded, and I purchased the TV on Monday and received it from halfway across the country by Thursday in fine order.  The set itself is handsome and elegant.  Set up is a breeze, even for someone electronically challenged as myself. The picture and brightness are great at any angle at any time of the day.  The colors, tints and hues are spectacular and natural at the same time.  My only frustration is that I don't believe I can select closed captioning only when I mute the TV (like during a phone call).  If I set up closed captioning, I have to have it on all of the time.  But that is no big deal and I can't recommend this Panasonic product highly enough!  This was a totally satisfying purchase on all levels.", "Date": "January 6, 2009"}, {"Title": "Panasonic 32", "Author": "Larry R. Berreth", "ReviewID": "R39K4P5XJILCC7", "Overall": "5.0", "Content": "Purchased a Panasonic 32\" for a spare bedroom. It took a little while to get due to out of stock. Dealer explained that. It turned out to be a beautiful tv right out of the box. Mother in law will be happy lady..Thanks to all.", "Date": "January 6, 2009"}, {"Title": "What a Picture!", "Author": "Over The Hill", "ReviewID": "R14LOVJCEA82LH", "Overall": "5.0", "Content": "I don't have hdtv, but don't worry the standard definition picture on this Panasonic is fantastic with my Direct TV, s-video cable, and after calibrating the picture with numbers I found on the internet. Skin tones are great, the sound is fine, and I won't be in any rush to upgrade to hdtv, although it probably would be unbelievable.I spent a lot of time researching tvs, and it looks like it payed off. I got a great price, too. I would have had to pay a $100 more for anything comparable.", "Date": "January 5, 2009"}, {"Title": "Great TV", "Author": "R. Leverette", "ReviewID": "R2L0M6CNM2PQAY", "Overall": "5.0", "Content": "This is my first LCD TV and I love it.  I know they say that 32 inches isn't that big for a flat panel TV, but I thought my 28 inch crt TV was big.  This one is monstrous.  Picture is great, sound is great.  I don't doubt that there are better TV's out there but if this is your first venture into the world of HDTV's you won't be disappointed.  I haven't gotten the full HD experience yet since I don't have digital cable or a blue ray player.  But even regular TV is more crisp and clear.  The only thing it doesn't have that I would like is a hookup for a computer monitor.  But it does have s-video, so you can still do that if you want.  Just have to use a different connection.", "Date": "January 2, 2009"}, {"Title": "Panasonic LCD Flatscreen 32 in", "Author": "M. R. Berry", "ReviewID": "R3KTGXCAWTIZ1Q", "Overall": "4.0", "Content": "Came very quickly. Was easy to set up and was satellite ready right out of the box. Did not have a HDMI cable with the TV to connect to the source. Works very well, colors are bright and sharp. No complaints at all.", "Date": "December 28, 2008"}, {"Title": "Panasonic TC-32LX85 32-Inch 720p LCD HDTV", "Author": "Sam Yacuzzo", "ReviewID": "R2PLCFVFSJ9NJR", "Overall": "5.0", "Content": "Outstanding picture and performance. Even the speakers are good. I have used it for a month and have been very well satisfied. Setup was quick and easy. My old antenna with rotor picks up 36 channels of HDTV in the Buffalo/Rochester area.The old videos on tape and CD look better than ever. I looked at many models and Panasonic was always among the very best.This was an exceptional value.", "Date": "December 24, 2008"}, {"Title": "great TV", "Author": "nvr cook \"nvr cook\"", "ReviewID": "R3W2NWY2RK88W5", "Overall": "5.0", "Content": "Love this set. It arrived quickly and runs very well. Picture is excellent!!Easy to program.", "Date": "December 6, 2008"}, {"Title": "PANASONIC 32\" JUST AS GOOD AS SONY AND OTHER COMPETITORS", "Author": "E. T. \"AVID MOVIE WATCHER\"", "ReviewID": "RJOHX3XFF0M1D", "Overall": "5.0", "Content": "TELEVISION HAS OUTSTANDING PICTURE QUALITY.  ALL I DID WAS REMOVE TV FROM BOX TAKE OFF THE BASE STAND BECAUSE IT WAS ALREADY ATTACHED AND MOUNT ON THE WALL.  THE HDMI CABLE I RAN FROM CABLE BOX TO TV AND I WAS WATCHING HD IN IN UNDER 10 MINS.  THE WALL I MOUNTED TV ONTO HAS THE SUNRISE GLARE IN THE A.M. BUT THE TV IS STILL BRIGHT ENOUGH TO HAVE A VERY GOOD PICTURE EVEN IN THE MORNING.  I'VE OWNED 2 SONY'S AND CURRENTLY HAVE A MITSUBISHI 60\" DLP I KNOW OUTSTANDING PICTURE QUALITY WHEN I SEE IT AND THIS PANASONIC CAN HOLD IT'S HEAD HIGH.", "Date": "December 6, 2008"}, {"Title": "Simply Amazing!", "Author": "E. Martinez", "ReviewID": "R3ITMSORFUM8EK", "Overall": "5.0", "Content": "I bought this TV for a great price and the results have only been phenomenal. If anyone is still on the fence, buy this!", "Date": "December 5, 2008"}, {"Title": "excellent purchase", "Author": "S. Wagner", "ReviewID": "RCUTZTCP1CM5M", "Overall": "5.0", "Content": "First LCD TV i've owned.  I read reviews of it on here as well as similar models on CNET and Consumer Reports.  All said and done, it's lived up to my expectations.  A fantastic image and very easy to set up.  Had it for a month now with no complaints.  The sound is good as well.", "Date": "December 2, 2008"}, {"Title": "Really nice starter set", "Author": "Michael A.", "ReviewID": "R1XZ7ZWBG5TLOG", "Overall": "4.0", "Content": "This set is GREAT for the new HDTV owner.  Coming from a standard TV, you will find the clarity amazing. The automatic color level tends to lean to the red but is easily adjustable to suit your preferences.  Lots of control over the picture quality, HDMI (no DVI ports), RF, Progressize Scan inputs, component and a nifty SD media port for viewing JPEG files make this a good all around set.  For the 570.00 price I paid , I could not be happier.  Eventually I'll replace all my TVs with this model.  I highly recommend this set for anyone on a budget looking for a nice HDTV.", "Date": "September 18, 2008"}, {"Title": "perfect", "Author": "W. McParlin", "ReviewID": "RHIMMC9RNRPPP", "Overall": "5.0", "Content": "needed a TV that was good quality for a good price. I received both elements with my purchase. I hope my future purchases work out as well.", "Date": "September 15, 2008"}, {"Title": "panasonic 720 LCD", "Author": "Cherril A. Gillette", "ReviewID": "R36VOKINNDEMQI", "Overall": "5.0", "Content": "This is my first flat screen. I like it. It's the perfect size I think. Easy to use (Can't find a way to turn on/off without the remote). Great picture.", "Date": "September 10, 2008"}, {"Title": "Best 720p LCD out there.", "Author": "Kenny", "ReviewID": "R34TP3U6CAS6CG", "Overall": "5.0", "Content": "Nice disign & good connections. Bright, colorful, well-detailed HD image like all Pannys.Perfect tv for a bedroom.1080i only. But can you tell the difference from 1080p...? Not me.", "Date": "October 14, 2008"}, {"Title": "Best LCD HDTV for the money", "Author": "E. McKeever", "ReviewID": "R1JDZC7ZAMIZ8S", "Overall": "5.0", "Content": "Panasonic has a very good HD picture.  We bought one for each of our son's for Christmas and consider them to be an excellent value.", "Date": "October 14, 2008"}, {"Title": "Panasonic TC-32LX85 32-Inch 720p LCD HDTV", "Author": "John E. Denehy III", "ReviewID": "R1GPDXR61QJZQ3", "Overall": "5.0", "Content": "Very good TV for the picture and set up. A good value. It has a very good tuner for changing channels .", "Date": "July 4, 2008"}, {"Title": "Great service", "Author": "Ali Eminov", "ReviewID": "R16ZTIG090HE71", "Overall": "5.0", "Content": "Panasonic Viera TC-32LZ800 32-Inch 1080p LCD HDTVThe product was delivered promptly and works beautifully. It is everything I expected it to be.", "Date": "December 25, 2008"}, {"Title": "Be aware of the shipping", "Author": "J. Jennings", "ReviewID": "R33003C9EEAULC", "Overall": "3.0", "Content": "Recently acquired the TC-37LZ85 through vendor Sixth Avenue Electronics (Amazon.com vendor).  The TV was delivered by UPS in a battered, torn box with insulation peanuts falling out of box.  The box also had been puctured in multiple places. The box looked as if it had been in a war and lost.  There were no markings on the box to indicate which end was the top.  I should have refused the box, but I did not.  Inside the box was another box which contained the TV.  This box was upside down.  The styrofoam insulation blocks that supported the TV were broken in several locations.  The TV was loose in the box.  TV was inspected and there were no visible broken parts.  It was easy to hook up and in no time I was sitting back watching my first flat screen.  The TV arreared to have not been damaged.  Bottom line.  Good picture and more than I expected.  I still should not have accepted the delivery.  My advice. Do not order from Sixth Ave. Electronics.", "Date": "January 7, 2009"}, {"Title": "amazing tv", "Author": "K. Vonstrandtmann", "ReviewID": "R3GQLVB3IX2B95", "Overall": "5.0", "Content": "I just got my xbox 360 back so now I can try the tv.Image 10/10I went to my friends house who has a 42 inch 1080i lcd tv. I thought 1080i was better,  they used blu-ray, it looked good but from 6 feet away there there were weird dots and stuff near the image, none with this panasonic.Sound 10/10Hear everything, thats good enough for meWorks 10/10I got it from a bad seller and it still works perfect...Blacks 9/10I didnt notice the tv was on, it looked like the tv was off black. Then I turned it off, I noticed a slight change in colorTotal 9.75", "Date": "December 20, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "1366 x 768 Resolution\n10000:1 Contrast Ratio\n178 Degrees Viewing angle for maximum viewing capacity\nViera LinK HDAVI Control lets you operate all of your home theater components by pressing a single button on your TV's remote control\nInputs include: 3 HDMI (1 side), 2 Composite video (1 side), 1 S-Video, 2 Audio inputs (for video), 1 Component . SD Memory card slot (SDHC compatible).", "Name": "Panasonic TC-32LX85 32-Inch 720p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51dq65kX-wL._SX300_.jpg", "ProductID": "B0014CV92G"}}