{"Reviews": [{"Title": "Best value in 1080p", "Author": "A. Lewis \"Prometheus One\"", "ReviewID": "R34HKNIPU1P0EG", "Overall": "5.0", "Content": "I have had this TV for a about 6 weeks. This TV has fantastic color and resolution.This TV as indeed at \"best buy\" from a leading consumer magazine. I never considered a JVCbefore. My brands were Samsung and Sony. But, after buying this JVC, I have become a big JVC fann.Everyone who as seen this TV is amazed by the rich colors and excellent resolution.We use a DirecTV HD box as a source as well as a Panasonic blue-ray player. Both giveperfect colors.My next project will be to hook this TV up to a Fit-PC2 to create my own, very inexpensiveentertainment center able to play any movie any time.I do not know what the one negative reviewer was complaining about. You can pay 2x for comparableTV from Sony or Samsung.I can't say enough good things about this TV. If you buy it, I am sure you will be happy with it.The only negative is that the styling is \"unique\" and takes a bit getting used to. The bluelight accents are a bit weird but, when you match it up with the blue lights on the DirectTV HDDVR then it actually looks spectacular.", "Date": "October 3, 2009"}, {"Title": "Does everything well", "Author": "Joseph M. Richards", "ReviewID": "R1SOMQLGQ2BYVD", "Overall": "4.0", "Content": "This TV does everything well. Its a well rounded TV that does everything you need it too. The picture is very good but not the best. The features are very good but not the best. You see where I'm going... The sound quality is better than average also. The ipod dock is very slick and tucks away nicely. If you want a set that does everything very good and no flaws this ones for you.", "Date": "October 18, 2009"}, {"Title": "Great tv for great price", "Author": "C. May", "ReviewID": "R2SKCVURDO1VMP", "Overall": "5.0", "Content": "We bought this tv because we have one we bought almsot two years ago and wanted one for our downstairs. Two years ago the tv was double the price we paid for this one and it did not have the ipod dock on it, but it has been great so we knew what we were getting.In reference to the blue lights across the bottom, I too found it a bit odd but they can be turned to either low or completely off. Just scroll through the menu using the remote and it's fairly easy to find.Overall, great tv for great price and we are very pleased, enough to buy two of them.", "Date": "December 17, 2009"}, {"Title": "Love it so far", "Author": "Cathy Hall", "ReviewID": "R29Q0ZIGYJYY5K", "Overall": "5.0", "Content": "We have only had it a few weeks.  So far we really, really, love it. The picture is perfect.It was easy to set up.  But mostly we LOVE have the ipod doc with it.  !!!!", "Date": "October 1, 2009"}, {"Title": "Could be better.  Good price for 42 inch.", "Author": "Router user", "ReviewID": "R1U8J6683RB3NS", "Overall": "3.0", "Content": "I am comparing the JVC to a 40 inch sony that was about the same price. I am by no means an expert when it comes to flat panel TV's.I did not buy from this site. One of the national clubs has a better return policy. I purchased  the sony and JVC at the same time. I am returning the JVC. The Sony controls and remote are superior in most aspects.  A plus for the JVC is that it can control multible boxes.  I can use the remote to control a Panasonic VCR.Most of what I have to say are based on using QAM on Comcast (no cable box). With the switch to all digital I found that Comcast in my area (northern suburb of Chicago) has put the digital starter stations on QAM. This means if you have a QAM digital tuner on the TV you can get these stations. Almost all large screen TV's have QAM. I also get HD on the broadcast channels as part of the basic service.The Sony found the stations (about 100 of them) and put them in a fairly logical order. It is harder to switch digital station on the JVC remote because because of the key placement for sub-channels. I have not seen any reviews that address the time it takes to change stations. The slow speed of changing stations on the JVC is the main reason I am returning it.  This is not a TV for a channel surfer.  Even switching between input sources was very slow.It does manage the switching between wide screen and 4:3 very well. Much better than the sony.The JVC had an Ipod dock. My teenage sons really like this, they were disappointed when I told them I was returning it. I thought the quality of watching IPOD videos on the TV was poor but I am not part of the IPOD generation.If I was only using the tv through a cable box I don't know that wouldn't be more favorable toward the JVC. It is a larger screen for the same amount of money and the slow channel changing would not be an issue.", "Date": "December 29, 2009"}, {"Title": "Review of JVC 42\" HDTV", "Author": "L. Farrell", "ReviewID": "R3KYKK139QCSO6", "Overall": "5.0", "Content": "Between the free shipping and no sales tax, purchasing through Amazon easily saved us more than $100 on the total cost. The product is excellent, with a great picture, sound and well-positioned controls that take up a minimum of space on top of our entertainment cabinet - and the sleek style makes it a great addition to the family room, even when it's turned off !", "Date": "January 31, 2010"}, {"Title": "Should have checked the features....", "Author": "SteamboatBruce", "ReviewID": "R37VCUFNFG0WEF", "Overall": "3.0", "Content": "A leading consumer magazine listed this as a Best Buy.  And I desperately needed a TV.  So I bought it.  It's okay, I guess, but I should have investigated a little more in a store.  Compared to my old (dead) Sharp Aquos, here's what I'm missing:1) PIP2) Too much reflected light from windows3) Whenever the source is changed, it *always* defaults to a view mode that only shows 95% of the available image.  I *always* have to switch the view mode to the \"right\" one.  No way to set a different default.That's it.  Only using it with a PS3 (blue-ray DVD + games) and PC.  But it's not dead, at least.", "Date": "September 10, 2009"}, {"Title": "Highly recommend!", "Author": "kelly \"kelly\"", "ReviewID": "R2JTCD25OB023L", "Overall": "5.0", "Content": "I wanted a new TV for my bedroom. I have a 40\" Sony in my family room and absolutely love it and wanted another, but they didn't have any in stock. I saw that this TV was on sale at our PX, I figured what the hell, I'll give it a try. Plus, I couldn't pass up the great price. So glad I bought it! I can't imagine anyone being disappointed with this TV....", "Date": "August 23, 2010"}, {"Title": "Jvc = The Inventors of the VHS....", "Author": "Edison Gomero", "ReviewID": "R35V6HG6P07G6U", "Overall": "5.0", "Content": "Spectacular.....this Jvc Tv is ONE of the best comparing to my family and friends Tv's, they have Sony,Panasonic,Toshiba and Samsung........they won't offer a teledock or OMNI SOUND but they are good. The price $$$$$$$$ and the quality that Jvc offers is GREAT ...makes them \"The Best\".As having a GOOD reputation among their JAPANESES competitors is an EXCELLENT television......you will love it....JVS = Victor Company of Japan....Whenver you purchase an Electronic device;...if is japanese everything will be ok...MADE IN JAPAN = MADE FOR LIFE..**********", "Date": "April 27, 2010"}, {"Title": "Good TV over all", "Author": "D. Suidikas", "ReviewID": "R2B85JRDE87D12", "Overall": "4.0", "Content": "We ordered this TV for my Dad who is 86 years old.  The main thing we went for was the sound since he is very hard of hearing.  We based our decision on other reviews giving it good marks on sound quality.  Also, Consumer Reports had rated it better than average on sound.  Fancy features were not important in our decision; ease of use was.  It has a user friendly menu and was easy to program.  The TV came from NY and travelled 2/3 the way across the country in 5 days (NY to TX).  The seller (J&R; Music World) added extra protective packaging and the unit arrived safe and sound.", "Date": "February 19, 2010"}, {"Title": "Best Value, Great Quality, and Unique Features", "Author": "N. Kujawski", "ReviewID": "R2GC9K00A35UE7", "Overall": "5.0", "Content": "My wife and I bought ours a couple of weeks ago and I don't think we could've found a better value.  The picture quality on HD is great, PLENTY of inputs and input types (I hookup my laptop with the HDMI and play games via wireless keyboard and mouse which is quite an entertainment experience).We use the iPod/iPhone hookup when doing housework or just hanging around.  Having our 250w stereo hooked up makes it simple (no wires) to listen to our music at good quality.  The built-in speakers are fine for watching shows but for movies I'd recommend using a surround or other sound system.One thing to note, we bought ours at a local retailer and the first one we had to return because there was something wrong with the input where it was showing some channels as complete static but the replacement has had zero problems aside from I can't stop watching it!", "Date": "March 10, 2010"}, {"Title": "JVC LT-42P300", "Author": "Allen A. Vogt", "ReviewID": "RNXQTCD0D6HB2", "Overall": "5.0", "Content": "I was particular impressed with the service .I am pleased with the set .I use FIOES and the set up was a bit involved ,probably those who have no experience would not be able to set it up .", "Date": "October 12, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "W flip out IPOD dock", "Name": "JVC Home JVC  LT-42P300 42-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51uV5qqmfcL._SY300_.jpg", "ProductID": "B001UHHK5K"}}