{"Reviews": [{"Title": "Love this set for the kitchen!", "Author": "Ron \"Ron\"", "ReviewID": "R38SYUAPFV6SV6", "Overall": "5.0", "Content": "We just got this little gem for our kitchen and it's just wonderful! The automatic Plug & Play setup found all the DTV, cable, and DTV air channels automatically. No need for a cable box with our Comcast cable service but you'll need a box if you want premium cable channels, on-demand, etc.The LCD panel sits on a clear stalk which attaches to a nice oval base with a swivel-tabbed screw. No tools needed. It then fits into the hole in the base of the LCD and it can be tilted front to back. Since we use it in the kitchen, we have it tilted back. The swivel is stiff at first but it works well and tilts a few degrees off the vertical back and forward. When it's first attached, it appears to tilt forward so just firmly hold the base and push the monitor back.The sound when set to Standard mode can seem a little tinny but it's better in Movie mode. The picture always needs to be adjusted at first since the standard settings are always too bright and too saturated. Reducing the contrast and the color setting helps produce a more natural picture. The tone is set to Warm2 but I find setting it to Normal works better. There are lots of ways to tweak the picture and the sound to achieve pleasing results.NOTE: Amazon says this set has RED Touch of Color and that's WRONG. It's CHARCOAL.This is a perfect LCD TV for small spaces and kitchens. We love it!", "Date": "June 9, 2009"}, {"Title": "Nice Design. Nice Picture. Nice Price.", "Author": "maxbrod", "ReviewID": "REZJW5AIX835Q", "Overall": "4.0", "Content": "In this price range, this had all the features and specs and the quality I've come to expect from Samsung LCD panels. It's a small set for the guest room, so what I wanted was all-around quality and small footprint. The design, however, set it apart from competing models I was considering. It's elegant, contemporary and sleek without being conspicuous.Also, I want to point out a factual error in the reviewer below who claimed that the unit's screen points downward. It's not fixed in that position. The vertical angle can be adjusted to suit your viewing level.", "Date": "June 29, 2009"}, {"Title": "The Devil's in the Details", "Author": "Robert J. Emmons \"rjemmons\"", "ReviewID": "R1LS61ALSR34PM", "Overall": "3.0", "Content": "The stand for this TV holds it in fixed position, and the TV screen is pitched slightly downward from vertical.  I contacted Samsung, and they actually told me it should be placed above eye level for pleasant viewing.  I need to place it on a standard kitchen counter, and that means you are looking down on a screen that is pitched downward from vertical.  This makes it unpleasant to view.The TV's audio is fairly weak and tinny, although that seems to be a common complaint about this size TV regardless of manufacturer.  If you buy a small TV to save space, you certainly don't expect to need external speakers to get good audio.The picture and reception are great.  The menu for configuration is great.  You can set it to show stations that are 4:3 and 16:9 in their proper proportions, and it remembers which stations are which.  I am always amazed when I go into a bar and see a Major League Baseball game being played by short fat players.  Don't the proprietors know you can re-configure the aspect ratio of the TV to show normally proportioned players?  Do short fat players make the customers feel better?I returned the Samsung LN19B650 TV with regrets.  If I planned to mount it on a wall, I would probably have kept it, even with the, apparently common, fairly weak and tinny audio.", "Date": "June 3, 2009"}, {"Title": "This LN19B650 is not better than the LN19A650", "Author": "Not My Real Name \"Mt. Rainier\"", "ReviewID": "R2LXTLB9QY4NEI", "Overall": "1.0", "Content": "I had already purchased the 19\" LN19A650 with Touch of Color from Amazon and remain very satisfied with that model (see my review). In fact, I wanted another TV and debated getting a second one of those. But its Amazon listing had a link saying \"There is a newer model of this item\" and I clicked on it, taking me to this LN19B650. This second listing said it too had Touch of Color but the images for it did not show color at all. Well, one image did show a line of red at the bottom of the case, but that image had a rectangular pedestal whereas all of the others had an oval pedestal. Which image(s) do I believe? Does it have TOC or not? I visited non-Amazon websites and they also said it had TOC. Ok, I believed the listing may have had some images wrongly placed, but I just had to believe they would not have text stating TOC if it were not so.Flash forward to receiving it and taking it out of the box. The set looked smaller than the LN19A650, but I first assumed they streamlined the case. When I attached the TV to its oval pedestal as per instructions, the whole thing leaned forward! Oh, that is a deal-breaker! How cheesy! Unlike the images online, this screen actually tilted forward! For starters, the curved plastic pedestal stem is attached by twist screw to the plastic oval to make an angle (!), and its other end only extends into the case about two inches using gravity to hold it on, so you can image the weight of the case upon this skinny angled stem causing these plastic connections to give a little, hence the leaning forward. I had to play with it to minimize the lean, rocking the TV back and forth, but never could get it to be vertical. Everytime I walked in the room, my eyes flinched at the TV, it always looked like it was tilting to fall. There was no denying the visual effect. And, why should anyone have to play with the lean to try to fix it? This is a three hundred dollar TV set, not a bent ten-cent drinking straw that can't straighten up! There should be no need to fuss with its posture! The dang thing should be vertical, right out of the box. The set could easily be rocked, too. I'm not saying it will fall over, as the oval base is wide, but to be able to rock the case on its stem with your hand is a major design flaw. And then it still leans when you let go! Strike one.Ok, I let it sit awhile on the counter, turned on. The screen definitely looked smaller than the LN19A650. I used a ruler and indeed the screen itself was only 9 inches high while the LN19A650 is 10 inches high. Yet both are advertised as 19\" (diagonal) with no mention of actual L & W. Give me a break. Strike two.By this time, it was my face that was getting the red Touch of Color, and I took a flashlight and shone it everywhere on the black case to find where in heck do they think they have hidden the red color that was so very prominent on the LN19A650? Folks, there is absolutely no Touch of Color anywhere on this TV case! Yet the Amazon listing says so, and so does the manufacturer's box it comes in! So, this means that Amazon's images with the oval base were correct all along in showing no TOC (in contrast to their text), and that one image with the rectangular base that did show the TOC does not belong in the listing! Strike three!In summary, they said the LN19B650 was a \"newer model\" of the LN19A650, as if the models are related. As if the newer one is improved, or better? My mistake to think that. Folks, the LN19B650 has a smaller screen, a completely black case with clear edges (no TOC as advertised), and tilts forward like a cheap POS.While I believe that Samsung makes the best quality picture out there right now, I have started the Amazon return process on this 19\" model. Also, today I bought a 23\" Samsung 2333HD monitor with TV tuner from a Staples store down the street, for less money that I paid for this 19\" from Amazon. I'll rate that one after a while. But at least it has a tilting feature where you can adjust the angle of the screen! No unsturdy and intolerable lean!", "Date": "July 11, 2009"}, {"Title": "Great TV for its price", "Author": "Jason S. Chiu", "ReviewID": "R3PGKLAWBC7D5L", "Overall": "5.0", "Content": "This TV is great. The picture is amazing but the sound is a little bit soft. I think you will eventually live with the sound. The casing is beautiful and it will brighten up any room. I researched other models and they can't compare for the picture quality.", "Date": "July 10, 2009"}, {"Title": "Audio is very week", "Author": "B. J. Coyle", "ReviewID": "R2AWOM75U9DRET", "Overall": "2.0", "Content": "I purchased this TV last week. The audio is so week you can hardly hear it turned all the way up.Also, you can not read the controls on the front of the TV. I called Samsung and we reviewed all of the steps re: volume and the volume did't change. The Samsung Rep. recommended that I purchase a Receiver to improve the volume. I told Him that I also own another 19\" LCD HDTV and it has four times the volume. So I guess thats just the way it is. The picture is really great. I do plan on returning the Samsung and get the other brand. I am very disappointed. I thought theSamsung was the best.", "Date": "August 14, 2009"}, {"Title": "Samsung 19\"", "Author": "LLW \"LLW\"", "ReviewID": "R1JCGJ0RIYKTRH", "Overall": "4.0", "Content": "Great value and best quality i could find for a small set. the controls are all on the front so you dont have to fumble for them and the design is symmetrical vs. some sets that add curves to the overall dimensions.", "Date": "December 23, 2009"}, {"Title": "99%", "Author": "T. Frey", "ReviewID": "R2PFZ85U8AOPUC", "Overall": "5.0", "Content": "The product is great except Amazon has incorrectly listed the item. This model is not \"touch of color\" Red as its listed. That was the prior model. The corrent modal [this one] is \"touch of color\" grey.", "Date": "September 17, 2009"}, {"Title": "Samsung 19\" - GREAT TV", "Author": "H. Clay \"CC\"", "ReviewID": "R2KOQHU3SOIQ88", "Overall": "5.0", "Content": "I ordered this TV as a replacement for the one in our kitchen. Actually it was a Christmas gift for my wife. We both absolutely love it. It has a great picture and looks great with silver/black appliances we have. I know some have complained about the sound quality, but for us it is perfect. I think it would also fit good in a small bedroom or such. Get it, you won't be disappointed.", "Date": "January 17, 2010"}, {"Title": "pluses and minuses Samsung 19\" TV", "Author": "M. H. KAPLAN", "ReviewID": "RCCZQ7K4W5WBX", "Overall": "3.0", "Content": "Nice looking, sleek TV. Picture quality and station reception is superior to a Sharp brand in my possession.  Problem with fit of power input in back of TV; the plug is NOT a good fit, and I had to tape it down to get the set to work. Sound quality is harsh and tinny.  I would have second thoughts about buying it again.Samsung LN19A450 19-Inch 720p LCD HDTV, Black", "Date": "September 12, 2009"}, {"Title": "According to Samsung - NOT 120 Hz", "Author": "ClassicPost", "ReviewID": "R25S03HEOJJ9UD", "Overall": "4.0", "Content": "I've been looking for an affordable lcd with 120Hz refresh.  I came across this unit, seeing that the description, in multiple places, claims 120Hz.  I also went to Samsung's (the manufacturer) page for this model.  It explictly says the unit does NOT run at 120Hz.Check it yourself in the Specifications page - \" LCD 120Hz = No\"", "Date": "October 11, 2009"}, {"Title": "Excellent product.", "Author": "R. Davis", "ReviewID": "RHRAZTZ2D4W19", "Overall": "5.0", "Content": "Beautiful picture and easy setup.  I had read other reviews that said the screen tilts downward.Actually, when first installed on the mount, the screen tilts downward 5-10 degrees.  But youcan tilt it back.  Just hold the base, and gently but firmly tilt the screen back.  It will go 5-10degrees back from vertical.", "Date": "February 26, 2010"}, {"Title": "Stand and TV Leans Forward", "Author": "D. Montgomery", "ReviewID": "R38MYTIOCB4EKB", "Overall": "4.0", "Content": "While there is no question the technology on the TV is second to none, the product 'leans' forward about 7 degrees whereas it should be perpendicular to the area it is placed.I called Samsung and they shipped me a new stand, but it still has a slight tilt forward.", "Date": "January 30, 2010"}, {"Title": "What did he say?", "Author": "Webster", "ReviewID": "R30A7O9CHED31G", "Overall": "3.0", "Content": "This T.V. is fine save for the sound quality which is not great. Many is the time when the sound seems garbled.", "Date": "June 28, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "19-inch LCD HDTV with 720p resolution--great for smaller rooms\n15,000:1 dynamic contrast ratio, 8ms response time, Wide Color Enhancer 2 for more vivid colors\nStylish Touch of Color design; game mode speeds up image processing response\nInputs: 1 HDMI, 1 component, 1 composite, 1 PC, 1 optical digital audio output\nIncludes removable stand; measures 18.6 x 14.3 x 7.5 inches with stand", "Name": "Samsung LN19B650 19-Inch 720p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/5132n8aM%2B8L._SX300_.jpg", "ProductID": "B001URA3FO"}}