{"Reviews": [{"Title": "Toshiba 55SV670U review", "Author": "G. Sontag", "ReviewID": "R1810OI0DCSQEB", "Overall": "4.0", "Content": "I have had this Toshiba 55SV670U for about one week. My decesion to pick this set over the Samsung 7100, Samsung 950, Sony XBR8 and LGH90 did not come without a carefull examination of the picture quality on all the sets.  (I eliminated plasmas as they appeared rather dim to me.)My desire was high brightness, sharpness and high contrast ratios. The weight and thickness was not that important as I only planned on moving this set once or twice. I will be looking at the picture more often than looking at the side view.This model Toshiba is now using a similiar front layer as Samsungs and it has improved the contrast ratio signifiantly. The blacks are much darker using this front material.  I know it will reflect lights from behind me,  but I'll block the window with a shade.... I would rather have that problem 10 % of the time than have the matte finish distort the picture 100 % of the time.The only way to improve contrast ratio is to locally dim. All the above do locally dim except the Samsung 7100.  I questioned how the Samsung 7100 could have a single backlight and be able to make selected areas blacker. I found this Samsung  set to have a slight blue hue over the whole picture. However, the Samsung 7100 would have been my second choice.The Sony XBR8 and the Samsung 950 had the best pictures  - just too expensive for the RGB backlighting and Just not worth$ 1500 to $ 2000 more to me.The Toshiba 55SV670U gave me the local dimming, an  anti-reflective coated contrast window,  120 HZ scan rate and a bright  long lasting LED display. I am completelty satisfied with this set.... and with and with its much lower selling price.Drop in Mr and Mrs Smith in Blu Ray and you will ever regret purchasing this Toshiba", "Date": "August 7, 2009"}, {"Title": "So beautiful that I wept.", "Author": "M. Bertrand \"Apathetik\"", "ReviewID": "R11P4FY0SZ1E79", "Overall": "5.0", "Content": "I had spent a year researching and saving for a TV. I had originally decided on the Sharp 65\" Special Edition....but then the 2009 models started to show up.I went around to my local stores and started to check out the latest and greatest of 240hz teli's and checked out the Samsung LED which was the only LED tv I could find in town. I was impressed and decided that the Sharp was no longer enough.I started to research the big three LED/240hz/55\" TV's I could find, the LG, the Samsung, and this the Toshiba. I ended up buying this one because my research pointed to it being the best.I waited for 6 weeks while Amazon said they didn't have them and eventually bought it from Beach Audio through Amazon. I mounted it up on the wall myself and sat down to see how it looked...I popped Mission Impossible in the ol' blu-ray player, cranked up the 7.1 surround, and watched....It was amazing. My wildest dreams were surpassed by light years and I wept in the warm glow that filled my living room. This TV is amazing.Also, Regza-link seems to work with Bravia-link since everything else I own is Sony. It was really hard choosing Toshiba over my old friend sony...", "Date": "July 20, 2009"}, {"Title": "A TV to Love ...", "Author": "R. Ghasemi \"wankel lives\"", "ReviewID": "R1UIP58AHEU7BV", "Overall": "5.0", "Content": "I consider myself a tech savvy. I've been following consumer TV lineups and technology for months. from samsung to vizio, yes I checked them all out! This Toshiba does it the best in its class with solid picture quality and performance. if you are looking for an eye candy go get a samsung, but if you want performance in all aspects then this TV is for you.I bought this set from amazon and had it for about 2 weeks now. The picture is amazing and the blacks are inky, deepest I've seen around! video processing is outstanding, handles motion really well. This LED TV delivers a great cinema-like experience.Pros:-Stylish single glass design-Deepest inky blacks - Kuro like-superior video processing - nicely removes judder and blur without adding video-game look-amazing screen uniformity-packed with pro-settings and tweaking menus, graphs, ambient light sensor and auto brightness feature-Local dimming in its best-no blooming, clouding, ghosting or flashing issues (known issues with LCDs)-details in gray-black tones visible-great valuecons:-reflective screen (helps to achieve better contrast but could be an issue if you have a lot of windows)-heavyI'm very happy I returned my samsung LED for this unit. samsung LEDs (6000, 7000 and 8000 series) suffer from screen uniformity issues!Buy this unit and you won't be sorry.", "Date": "December 21, 2009"}, {"Title": "Toshiba Regza 55SV670U", "Author": "S. Gray", "ReviewID": "R1XPF2UZAMNQT5", "Overall": "5.0", "Content": "Puchased this from Beach for 1,575, no tax free ship, best deal I have seen.  Slow start to the order process but once picked up by Manna, very smooth process, delivered by two men, unboxed, inspected, they lifted it out for me.  Got it hooked up and everything synced.I have been reading prof and user reviews for weeks on this thing.  Nearly spent more on a plasma but I felt I needed a bright screen due to this going into a bright room.  The room area as bordered by the seating is around 13' x 14', with the main couch looking straight on from around 13' feet away and a loveseat at about a 45 degree angle x 8 feet away from the screen center.  The 55\" seems perfect for this space. This room flows into the kitchen area and from the kitchen table 18-20 feet away the picture is still awesome.I compared to side-lit models and felt this screen with full backlight provided better uniformity, especially after scene changes.  It seemed to me that the thinner, side-lit models took an extra second for the brightness to become uniform..I have not noticed that on this screen, scene changes even from dark to light and vice-versa seemed to adjust instantly.I was concerned about the reflective screen as there are many windows, when the TV is off you can see everything, when on the brightness overcomes any reflection.  My other concern was over viewing angle.  I see no distortion, loss of color or brightness from over 60 degrees off front dead center(total 120 degree field of view) which more than covers where anyone could view this tv in my room.  I spent a whopping 5 mins playing with settings and still get the \"wow\" factor, given time I will take a more scientific approach with the settings.  This is a beautiful TV and I could not even imagine why anyone would spend an additional 1,000 to 2,000 dollars for some percieved big difference in picture quality.I am convinced that generally, people use review forums to complain about problems, and most people do not take the time to write about good experiences.  So, when you read 100 reviews you might see 20% average or poor reviews thinking 1 in 5 are unhappy, but in reality those that are happy dont bother, so, the actual % who are happy/satisfied I would bet are in the 95% range.  This is true with anything you might buy.Went to BB and a couple of other retails to see this against other models.  At first I did not even look at prices, as I wanted to focus on pic quality.  I did not seen anything I thought looked better.After exhaustive review reading I do understand that a prof reviewers job it to point out flaws.  CNET must have 100,000 dollars in meters, software, and gizmos to evaluate a tv screen.  If you read their reviews I am not sure I feel comfortable buying anything.  The flaws pointed out on this TV simply cant been seen by me, a person with high expectations and 20/20 vision at least while I wear my glasses.  Maybe if you put their $8,000 top pick right next to this TV I could be convinced I could be 10% happier, but for the average consumer its just not worth rediculous money.  Two neighbors have walked in over the last couple days and stopped dead in their tracks looking at this picture.  Sports are fluid in movement and it feels like the puck or basketball is on its way towards me on the couch.All in all could not be happier with this TV.", "Date": "April 6, 2010"}, {"Title": "Two thumbs up", "Author": "jomammah", "ReviewID": "R1VRS3TKW10PIF", "Overall": "5.0", "Content": "There isn't much original feedback for me to add. Most of it's been said.The picture is vivid, and is the most accurate out of the box I've ever seen. All I did was turn the 'color' and 'brightness' down a little (I've always preferred a slightly subdued picture).I was initially concerned about inputs. My TVs are always plumbed into my stereo and home theater systems. I use my preamp as the audio hub and my TV as the video hub. None of my gear is new enough to have HDMI, but there were still sufficient connections on the TV.Someone please tell me if I break a rule here about naming magazines...There is a professional review in the Nov 09 Home Theater Mag (it's also online). It's one of their recommended TVs. A well known cosumer mag (that likes to sue if they're named and quoted) ranks Toshiba LCDs as some of the least trouble prone LCDs, and recommends the REGZAs.If I have any quality troubles down the road, I'll update this. Right now, I am completely satisfied. Let me add that Amazon was on the ball too. Again. TV was here four days sooner than promised, and in excellent condition.02 June 2013 Update.................Still love it. It's survived, IDK, 20-30 power blips from storms since I got it. No problems, still love the picture.I normally wouldn't update electronics this far down the road; but the TV's listed as still being available. It's also almost $900 more than I paid for it. You should contact the seller and offer a more reasonable price. I think you'd be happy with the TV.", "Date": "October 25, 2009"}, {"Title": "Great value in this TV", "Author": "S. W. Massey", "ReviewID": "RSS4B4A3X36M", "Overall": "4.0", "Content": "I also did a lot of research when looking for a new LED tv.  You cannot find another tv that has the same features for this price.  The closest was the Samsung unb6000.  Samsung matched everything the toshiba had except the local dimming and 240 hz refresh rate.  The thickness didnt matter to me becuase the Toshiba is only 4 inches deep, so you really could hang both sets.  My only complaints about the 67OU is the screen can give off some glare and the color green is not as accurate as it should be.  Oh btw - I paid $1000 less for the Toshiba!", "Date": "October 14, 2009"}, {"Title": "Excellent 55 inch TV", "Author": "D.M. \"online shopper\"", "ReviewID": "R1Z73A8I3Q7XSX", "Overall": "5.0", "Content": "When I was looking to upgrade from my 46 inch Sony Bravia, which I loved by the way, I looked at everything out there. I read reviews on all the 55 inch models and kept coming back to this Toshiba. It is a beauty. Picture quality is amazing. This tv is Huge compared to my old Sony.If you are in the market for a 55 inch LCD/LED, this tv is a great choice. It has more features for less money than any television out there. Bought mine at a local appliance store, which came bundled with a blu ray player and HDMI cables, surge protector, etc. for under 2k.Compared it to plasmas which all seemed too dark to me. I even looked at a 58 inch Samsung plasma on the display which had burn in on the screen. The clerk said it had only been there a month. When the screen went dark you could see the burn in. That completely turned me off to plasma.You cant go wrong with this tv for the money!", "Date": "January 13, 2010"}, {"Title": "Great picture, good value", "Author": "Bruce Bussert", "ReviewID": "RA07UMHUJAA67", "Overall": "5.0", "Content": "After reading a few reviews, I opted to purchase the TV from Amazon.  The back lighted, LED feature with local dimming was the one feature that I really wanted.  Every manufacturer is going to LED lighting, but those are mostly edge-lit LED and don't have local dimming. Plus I have other Toshiba products and have been pleased with the reliability.  The price seemed like a bargain compared to other TV's with similar features.The TV came in about a week.  The trucking company offered to bring it inside, unpack it and make sure it worked, but being an engineer, I shooed them away and did it myself, with my son.  Unpacking was easy.  After removing a few plastic gadgets from the bottom of the shipping carton, it lifts right off.The TV worked great when first plugged in.  (Had to move the 2 year old 40\" SONY to the basement).  The picture is absolutely stunning - turn on ESPN Sportscenter with their new color schemes and you will be amazed- absolutely floored.  The change in brightness from the older SONY to the new Toshiba was like night and day.  The colors just jump off the screen, and the blacks were black black black.  I haven't noticed any blooming like a few others have reported, and if the local dimming causes a few stars to disappear in a space scene, I haven't noticed that, either.  One of the first blu-ray movies I watched was the Fifth Element - absolutely breathtaking, even if I was watching it in 1080i (colorstream connection, since we didn't have enough HDMI cables around).Are there some things I don't like?  Yes.  For one, the TV is really thick compared to other LCD's, about 4.5\" I'd say (without looking it up).  And the picture does fade (loses contrast) if you go move than about 30 degrees off dead straight looking at it.  That's OK for me, I've got a big room and sit about 16' from the screen.  (With the 40\" TV, you can't really appreciate the hi-def from that distance, no one's eyes are that good!).  The sound from the built in speakers is just adequate (they apparently point straight down out the bottom of the unit), but I've got a surround system for when it counts.I mounted it on the wall - easy to remove the base and convert to a wall mount.  I purchased a tilting type mount, not because I want to tilt it but because the stand off distance was a little more and the back inputs are not recessed very much.  And due to a quirk of the SA 5300 DVR Time Warner gave me (if you use HDMI, the output to your sound system will be only 2 channel unless you switch the DVR to digital sound instead of HDMI, but then you don't get any sound from the TV), I have to use the bulkier colorstream cables with the cable box.I was a little torn when I made the decision to purchase.  Should I get a new 3D or opt for year old technology with a good value.  I opted to wait a couple of more years for 3D, and I'm glad I made the decision.", "Date": "April 6, 2010"}, {"Title": "Great performance and value", "Author": "Ray Adams", "ReviewID": "RKF2E02QRXREN", "Overall": "5.0", "Content": "I researched and compared all the major brands, both plasma and LCD, in 52- to 55-inch size before making my purchase.  Looks very good when off, and great when on!  Very good sound from internal speakers, great amazon delivery service, and great value.  In \"real-world\" viewing, I've never noticed any of the few shortcomings that some online and print reviews have mentioned as minor issues.I'm not a videophile, and there may be units with better specs, but you can't beat this Toshiba's 55SV670U combination of features, performance, and price.  Thoroughly satisifed with purchase and highly recommended.", "Date": "December 22, 2009"}, {"Title": "Awesome TV for a great price", "Author": "C. Kapoor", "ReviewID": "R2ZBEWULUISP90", "Overall": "5.0", "Content": "I have had this TV for about two weeks now. Upgraded from a 32\" Sony LCD.Few things to add on top of other reviewers.1. Like the title says, its a awesome TV for a great price. When I bought this TV it wasn't available in-stores for me to check out in person. I took a risk in trusting an expensive purchase solely on reviews and it paid off.2. The blooming issue that some reviewers mentioned is a very minor issue IMO. Its only sometimes noticable when there is a pitch black background with lighting on a specific object.3. This TV has a 120 Hz refresh rate with ClearScan technology from Toshiba. Clearscan, as far as I understand, basically interpolates frames generated with the 120 Hz refresh. Commonly people get confused between frame rate and refresh rate. HDMI content that is generated by your cable box or Blueray player has a frame rate of 60 Hz. This is always constant. The LCD TVs available in the market these days offer refresh rate of 60,120 & 240Hz. So basically a TV that has a 120 Hz refresh rate would simply display the same video frame for two successive refreshes. As you can tell a 240 Hz TV won't get you too much more than a 120 Hz TV. So I would like to ask all you future buyers to not give in to the marketing fluff . Buy a TV only after understanding all the features.4. Some initial units of this TV had a sound issue where there was some random audio echo. I haven't seen this issue with my TV and from what I have learnt on the web, people who saw this problem got firmware updates that fixed the problem.All said and done, TV with super deep blacks, great styling and awesome picture quality. Highly recommended.", "Date": "March 31, 2010"}, {"Title": "Beautiful LED TV!", "Author": "R. Bonner", "ReviewID": "R1ZRFDZY50NKO", "Overall": "5.0", "Content": "Phenonimal television and at a terrific price compared to other LED's of the same size.  Extremely easy to wire up to a surround sound system and even easier to operate with nothing but a stellar picture!  Worth the wait and do not regret a single thing about the Toshiba LED 55 television.", "Date": "September 8, 2009"}, {"Title": "Amazing picture, brings everything to life", "Author": "A. L.", "ReviewID": "R1TSONZTQCKED5", "Overall": "5.0", "Content": "I've had multiple Toshiba LCDs in the past, and often wonder why people overlook their televisions time and time again. The technology is excellent and the prices are great. If you have a room that can handle a glossy screen, there's nothing better than this TV save the UNB8500 from Samsung, and look at that thing's price.The black levels on this tv are phenomenal - just get everything calibrated. I'd suggest a trip over to AVSForum to the owners thread, there is some great advice there. At this current price is nearly impossible to pass this TV up.", "Date": "March 20, 2010"}, {"Title": "Awesome TV!", "Author": "Maverik", "ReviewID": "R2A9SSZ8V1XQOD", "Overall": "5.0", "Content": "This set replaced an ageing 62\" Toshiba DLP HDTV which has served me well for several years.  Before buying it however, I did the research, read the reviews, and checked them out in the stores.  I eliminated Plasma's because IMHO, they look dull, dim, and boring.  The only thing they have going for them is their blacks.  Their whites look dirty.So, plasma's were out.  Looked at LCD and LED sets from Samsung, Sony, and LG.  Samsung, I will never buy Samsung products again.  Their customer service sucks.  I tried getting a 24\" monitor (only a year old) repaired under warranty and they won't repair it, what they will do is keep sending you refurbished replacements that are in worse shape then what you sent them to be repaired.  So, I'm done with Samsung.  Sony is cool but very expensive and LG wasn't up there.So, the Toshiba's picture quality and features are unbelievable.  Not only does this set have those inky blacks that plasmas are known for, it has the brightest, cleanest whites you'll ever see.  I am so glad I purchased this set over any other.  Out of the box, the picture is amazing.  And there is so much stuff to tweak to get an awesome picture.  The screen is beautiful, the picture quality is amazing, and there's enough inputs to satisfy anyone.The delivery was perfect.  Pilot did an excellent job and the TV arrived in perfect condition.  All in all, this set is a steal for what you're getting.  And as always, Amazon is great!Alan", "Date": "April 25, 2010"}, {"Title": "Awesome T.V. and a good value", "Author": "TechGuy Az", "ReviewID": "RPVVMK4C9P9SE", "Overall": "5.0", "Content": "I just recently bought this tv.  Very good quality and compared to others in its class, a very good value.  I did a lot of research before settling on this tv.  I looked at Sony, LG and plasmas from Panasonic.  I wanted a bigger tv and was coming from a still pretty nice 40\" Sony Bravia.  I wanted to get another Sony, but they were just too expensive for the size that I wanted.  LG is nice too, but they are kinda new to the LCD tv market.  Panasonic had great values on their tvs, but I'm not so big on picture burn in and large power consumption, which plasmas have.  I happened to look at this tv because of it's design and the energy star compliance that it has.  The TV is gorgeous, especially on top of the tv stand I also purchased the same day for the tv.  I ordered from Vann's.  The experience was great.  The was no sales tax or delivery fee.  Delivery was problem free and the tv arrived in good working order.  I would definitely recommend this to any of my friends.  The only problem I have with the tv is the sound quality.  I good surround sound system will fix that problem.", "Date": "July 17, 2010"}, {"Title": "Toshiba SV670U", "Author": "Matt \"Custom\"", "ReviewID": "RM3VK0LNDTRD0", "Overall": "5.0", "Content": "This TV is great overall and even greater value for the money.  The feature that separates it from the competition is the ability to control dejudder and 120/240 separately.  Some media looks bad when they are both turned on, so ability to turn off dejudder great if you don't want the movie to look like it was recorded with a camcorder.The remote could have been better:  even though you can program certain buttons to switch you to specific inputs (dvd, sat, tv, etc), you have to hold down the buttons for a few seconds for them to actually switch to that input.No one can complain about picture quality on this tv.  The blacks are exceptionally dark.  If you make a side by side comparison to a high end 2010 plasma tv when both are turned off, the plasma screen looks so gray that it seems like it is turned on.  The difference is even bigger when they are both actually on.Brightness, colors, inputs, looks, build quality are top notch.  No complaints so far.", "Date": "July 13, 2010"}, {"Title": "WOW!!", "Author": "Sandra Neville", "ReviewID": "R2KIX15TK9TUXL", "Overall": "5.0", "Content": "Fantastic picture..i can't give the sound 5 stars only because it is not surround..a great buy! Oh and did I mention how unbelievably amazing the blueray movies are on this set?  You really should check out this TV!", "Date": "December 27, 2009"}, {"Title": "Best TV I had in years", "Author": "Rahul Chaudhary", "ReviewID": "R1545KCQ22K9HE", "Overall": "5.0", "Content": "After over a month of research, I finally decided to Toshiba 55\" for my small home. I wanted a TV that met the following criteria: :::: No Internet ConnectivtyI prefer my TV and Internet connected device to be separate. And here's why-  -- Virus, Anti-Spam issues: I don't want to install anti-virus and anti-spy software on my TV.  -- Upgrade: There is always a new version of the software (like Flash, SilverLight, etc) being released and its difficult to keep upgrading to new s/w to view channels  -- Performance: Every new version consumes more CPU/Memory and eventually it will slow down my TV's rendering capability too. Think about it, we change our laptops every 3 to 4 years, not because the display doesn't work. It's basically because the computer has gone slower.  -- Refresh cycle: Most TVs last 10-15 yrs, by making them software driven, companies are trying to force us to refresh TVs every 4 yrs, just like PC. :::: Full LED BacklitFull LED backlit provides consistent lighting across the screen. EdgeLit might be thinner, but will not offer even back lighting for such large size. :::: Thin PanelWide Panel makes the TV big, but offers no real value. :::: Connector accessibilityI was looking for TV that provided HDMI, D-Sub connectors near the edge of the TV so that it's to connect even after wall mounting it. :::: At least one year old model Hoping that after a year, the manufacturer would have resolved design/product issues. :::: Amongst top 5 in picture & audio qualityI couldn't be happier with my choice.Pros: + excellent connectivity all connectors are pretty close to the edge of the TV, so I had no issues attaching cables after wall mounting my TV. + awesome picture quality. didn't notice any blurring or other issues because of local dimming. Good contrast with deep blacks. + nice sound definitely not the best in the industry, but still good enough. + edge to edge glass panel complete glass panel makes the TV look beautiful even when turned off. The glass is glossy and attracts finger impressions, but still not bad, as I don't touch so often. + HDMI 1 or D-Sub with stereo audio I connect my PC video (via DVI-HDMI adapter or D-Sub) and audio (standard audio out) and enjoy movie.Cons: - no surround sound speaker would have preferred them. Overall.... totally worth the money.", "Date": "August 16, 2010"}, {"Title": "Toshiba LED matches Samsung LED", "Author": "R. W. Sharp", "ReviewID": "R2R66F4IJ6ICO6", "Overall": "5.0", "Content": "I recently purchased this TV after longing for a Samsung LED TV. The Toshiba was about $700 cheaper but I have a picture and sound quality that is equal to the Samsung LED TV. When playing Blu-Ray movies and regular DVD's my Toshiba BDX2700 wireless Blu-Ray player up converts the older DVDs to darn near blu-ray quality. I would easily recommend both of the great products. Watching Sports Center on ESPN is worth the look see just for the colors and I mean drop dead beautiful colors that are used on their sets.", "Date": "July 9, 2010"}, {"Title": "Excellent Choice!!", "Author": "Kumar Dhanyamraju \"Kumar\"", "ReviewID": "RDK0XU1UPKBB", "Overall": "5.0", "Content": "I have purchased this unit about three weeks ago. Looked at the competition such as LG, Samsung and Sony. They were a bit overpriced, especially the Samsung and Sony are way over-priced. I was upgrading from a Sony 52\" 1080P 120Hz LCD model. The Sony's picture quality is undoubtedly outstanding. This Toshiba with LED takes HD to a new level. Excellent color, contrast, and brightness. Several adjustments to fine tune pic to your taste. You might hear that the Greens are not the best, just need to drop Red down in the RGB setting. As known, Red is opposite of Green. I love the shiny screen, I do not have any windows or light source facing the TV, that makes a huge difference. Took a little bit of playing around to get the picture right, as the colors were deep and saturated. Seen complaints about sound quality, none noticed yet. Love the Dolby sound level feature where, all your channels play at the same sound level, very nice. The remote is multi-functional as well. And now for the 240 clearscan, I do not see any difference or improvement over the 120Hz Sony in this particular respect. This is about 4\" thick, does not matter to my set-up, plus as many noted we will be looking at the screen straight. If you are looking for an LED TV, you will not be disappointed with this unit. Outstanding colors, pic quality, sound quality, decent remote and the SD channels look decent also. First program I watched was the PGA Golf on NBC and it was just incredible. Watched a few BD and DVD's, just outstanding performance. Overall, very pleased, lived upto all the expectations for pic quality improvement over the LCD genre. Did purchase a 3 yr warranty from Square Trade, just in case. Will be upgrading to a Wi-Fi blu ray from LG and it will be a whole new world of TV watching!!!!!!", "Date": "March 31, 2010"}, {"Title": "Toshiba LED LCD HDTV", "Author": "B. Warren \"Sports Fan.\"", "ReviewID": "R3HM3QFJYBM6RT", "Overall": "5.0", "Content": "Great picture.  NFL Playoffs and Super Bowl were awesome to watch.  BlueRay movies are crystal clear.  Shipping form the vendor was Fast!", "Date": "February 7, 2010"}, {"Title": "Best purchase ever!", "Author": "M. Fields", "ReviewID": "R1604VVZOJT5VW", "Overall": "5.0", "Content": "We love this tv. Never gave us a bit of trouble.  Playing modern digital bluray movies on it and it is simply stunning.  I can not thing of one negative thing EXCEPT the sount quality is not that great.  But for us the sound is just fine.  We don't need anything more and if we did we'd just buy a nice 7.1 system.  I do not like 3D tv's so I went with this one.  For the price I feel like I stole something.", "Date": "September 12, 2011"}, {"Title": "dont think of it as ancient... 2009 was a good year!", "Author": "Daddy Longlegs", "ReviewID": "R37XRHQTYASDVP", "Overall": "5.0", "Content": "I just sold this TV for $900 USD.  I bought it about two years ago from a local trusted family a/v store.  I didn't sell it because I got tired of it.Anyway, as a brotherly peice of advice, for life in general, do NOT rule out older electronics!  Good stuff like this TV holds its value, just like an undriven Mercedez.In the process of selling this TV from craig's list, people approached me as if I should cut the price in half, because of reasons like this:\"You are asking $900 for this TV which was made in 2009, and has been used for two years.  I can get a brand new TV the same size, with everything the 2009 does and more, and it will have a better picture.\"These people are sadly mistaken.  Don't you be mistaken either, esp if you need a bargain and picture quality.", "Date": "August 14, 2011"}, {"Title": "buyer beware!!!", "Author": "gr3ml1n", "ReviewID": "R27KAFOROLHX8I", "Overall": "1.0", "Content": "this tv is not worth spending your hard earned money on. its a waist of time and hassle to spend your money on a comany that when something goes wrong, the company will not take the required steps that it needs to take to have the unit repaired. (even if it is stated within the warranty). i had a problem with mine and it took me to call the better business bureau to get any thing don and that was after 6 months of begging and pleading my problem to toshiba! DO NOT BUY this!!!!!even after i had call the BBB and got toshiba to send me a new tv, the new tv is having awful issues with overactive backlighting, screen flashes and picture blockiness. the first one i had when it worked did'nt have that!. i am a repair tech myself and i know what is right and what is not a right in a tv picture, but toshiba seems to think they know what im seeing better than me who is standing right in front of the problem! absolutely without a doubt this company needs to wise up. there are better companies out there with way better products! toshiba your not worth the time a day. from now on i dont even look at anything that has a toshiba name on it and i would advise all else to do also! goodbye toshiba!!!!", "Date": "June 14, 2011"}, {"Title": "Great Flat Screen!", "Author": "Marie Ana Jurado", "ReviewID": "R1SG8BH1W02PWM", "Overall": "5.0", "Content": "I have had this tv for about 9 months now  and I do not regret the purchase. This is a very affordable and all do flat screen. It was so easy to connect, and yes I even did it with NO help. It's connected to my receiver, cable box and all my other audio and visual appliances. I needed a large screen for the location in the house but not one that was too big. TV has no glare and is visible even to the smallest degree for a side view. Before purchasing the flat screen, I was also looking into the new 3D tv's, but I am so glad I didn't buy those. I am a big movie and video fan, but a 3D tv just seemed too much for not much of the thrill. Besides, I am not a fan of wearing the glasses after my eye operation. I am very happy with this TV and I am so glad this one sits perfect in my home.", "Date": "May 26, 2011"}, {"Title": "TOSHIBA", "Author": "Juice", "ReviewID": "R2DSTLE425WOO8", "Overall": "5.0", "Content": "I purchased a Tosiba 55\" LCD/LED TV. It is all & even more than expected. Amazon shipped everything on time & in excellent condition.", "Date": "November 2, 2010"}, {"Title": "nice TV", "Author": "nursing05", "ReviewID": "R2ILRCRI7YQH4D", "Overall": "4.0", "Content": "I bought this TV because my husband did a lot of research on the LED TVs and found this TV to be rated very well. I bounced back in forth this TV or the new Samsung 8000 series. Basically the price is what was the deciding factor. This LED has a beautiful picture. The only complaint that I have which was the same complaint I had with a previous LCD from Toshiba is when you have had the TV on for hours the sound gets distorted and I would have to turn it off and then back on and it would be fine. Well with this model, the TV does not have to be on all day for it to happen. It happened within 30 mins of us hooking it up. So that ticked me off pretty much. I was hoping with a newer model they would have fixed that problem. I had been bugging my husband to get surrounds hooked up for 2 years so we finally went and bought 7.1 in wall and ceiling surround and now that the sound is  not going through the TV we do not have that problem. Overall this LED is a great TV for the price IF you do not plan on playing the sound through the TV.", "Date": "October 23, 2010"}, {"Title": "Toshiba Regza 55V670U", "Author": "John Q Public", "ReviewID": "R2KB2EPBKWPUIN", "Overall": "5.0", "Content": "We bought this same model but in the 46\" last April for the master bedroom at a local dealer. Fell in love with it. Then our Sony 60\"XBR2 started to go out for the second time, (First time was under factory warranty, second time it was not under warranty) so we bought this one for the family room. It is one great TV. For the money you cannot go wrong, great picture, great blacks and a lot of adjustments on this TV so you can tweak it to how you like the picture to be. I paid over $3,500 for that Sony, and bought both Toshiba's for less than I paid for that Sony. Sweet!", "Date": "July 29, 2010"}, {"Title": "TOSHIBA 55SV67OU", "Author": "WOODY", "ReviewID": "RAGS7XMP6YWLP", "Overall": "5.0", "Content": "ALL I CAN SAY THAT THIS TV IS AWESOME THE BEST HD PICTURE I HAVE EVER SEEN,TAKES A LITTLE TIME TO GET IT CALIBRATED,BUT GO TO [...] AND SELECT THIS MODEL ITS A GOOD STARTING POINT.I DID HAVE A LITTLE TROUBLE WITH MY OLD HD CABLE BOX,SO I CALLED TOSHIBA AND THE TEC TOLD ME TO UPGRADE THE BOX TO A NEWER ONE WITH HDMI OUTPUTS THAT TOOK CARE OF THAT.DON'T KNOW TO MUCH ABOUT THE SOUND AS I RUN THE TV THROUGH MY 5:1 A/V RECEIVERI WOULD RECOMMEND THIS TV TO ANYONE LOOKING FOR A LED BACKLITE TVAND THE PRICE WAS RIGHT FROM AMAZON 1559.00 WITH FREE SHIPPING.", "Date": "April 5, 2010"}, {"Title": "Started well - premature failure", "Author": "Larry Baxter", "ReviewID": "RAV8VD272VRFW", "Overall": "1.0", "Content": "We bought a Toshiba REGZA about 18 months ago and were very satisfied. However, it just developed a major screen problem (1 inch by 3/8 inch dead spot), only a few months past the 12 month warranty. We contacted Toshiba, who was \"unable to assist us with the cost of the repair.\" It is out of warranty so they are within their rights, but it was a major cost to our limited budget and I would be reluctant to recommend it to others.", "Date": "July 31, 2009"}, {"Title": "release", "Author": "More stuff", "ReviewID": "R429SW98QUHQS", "Overall": "5.0", "Content": "I like what I've read about the SV670 line, will hold off on the Samsung un55b6000 for now. Big deal on the shipping it's pre-release no reason to give it a single star.", "Date": "June 11, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p Full HD CineSpeed™ Display with Built In ATSC/QAM Digital Tuner for Over-the-Air and Cable-in-the-Clear Digital Tuning\nFocaLight™ LED Backlight with Local Dimming\n2,000,000:1 Dynamic Contrast Ratio\nClearScan 240™ with New Backlight Scanning Technology\n4 HDMI™ Digital Inputs (1 Side) with InstaPort™ and REGZA-LINK®2", "Name": "Toshiba REGZA Cinema Series 55SV670U 55-Inch 1080p LCD HDTV with LED Backlight and ClearScan 240, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51K%2B9ezNTjL._SX300_.jpg", "ProductID": "B001TOD3KA"}}