{"Reviews": [{"Title": "TC=L32G1 2 thumbs up!", "Author": "D. Posey", "ReviewID": "R1O6MV1NX1KZIE", "Overall": "5.0", "Content": "Very nice picture and sound. I picked it up for $634. delivered. Sub vendor Beach Camera. Steal of a deal for the new model. The G1 has a very good screen format options. I can't tell you how surprised I was at the sound. Many LCD's have poor sound do to the hidden speakers. The price we pay for style. The speakers are placed at the bottom. Down firing. All in all love my purchase.Con:1.The warranty. If they can't fix it over the phone you will have to carry it in or pay for the upgraded warranty. Larger models are in home service.2. No Ipod dock like the x1 models. It would be nice to have the option to buy as a add on. (Can't find any options for it)3. (Maybe) No 1080p support for PC. 720p looks better when viewing standard cable. So this depends on your primary use. @ 32\" you can not discern the difference in viewing movies/TV. Only when using the computer. The text etc will look much cleaner. If you primarily use PC get the S1 model or spend the money for 37\"G1.* Very nice quality, Solid feel, nice style *", "Date": "May 13, 2009"}, {"Title": "A great, inexpensive LCD TV without bells and whistles.", "Author": "Justin Kace", "ReviewID": "R320FALF1KMTWT", "Overall": "5.0", "Content": "This is an excellent deal no matter which way you look at it. For $465 with free shipping (Prime member) and no tax, this one is a no-brainer.The picture is sharp - maybe not as sharp as its more expensive big brothers, but sharp enough for any casual TV viewer. Be sure to find the right picture format for your purposes (I like \"justified\", although others with weaker eyesight might like \"zoom\", while others may prefer the wide angle if they are avid HD video fans. There are enough picture features to adjust it to your liking, including extensive color settings and more. And to top it all, it's just plain easy to adjust using the included remote.One caveat: you may find the maximum volume setting a bit low when you first plug it in, and you might even turn the volume up to 100% or so in bigger rooms. But there is an easy fix: go into menu, then audio settings, and adjust the base audio level to max, then when you go back to your remote you'll find you have enough volume/headroom to enjoy any movie with plenty to spare. I don't need a 2.1 or 3.1 speaker system; it's sound is good as it is. I'm an audiophile, but I just don't see the need to spend money on an extra speaker system to match up with this inexpensive, but good, TV.Assembly? What assembly. The only thing you need to assemble is the stand, which consists of four screws. Easy peasy.This baby is plug and play - I had it up and running in under 15 minutes. It features a very intuitive settings format.All in all, a great product at a ridiculous price. Highly recommended. If you just want a no frills LCD TV with HD, and you don't plan to build a screening room or theater, this is the ticket. Get them while they last!", "Date": "December 8, 2009"}, {"Title": "Agreed.  Two thumbs up!", "Author": "One Guy", "ReviewID": "R2VW02NF763ADY", "Overall": "5.0", "Content": "I had been reviewing tv's for months before purchasing this G1.  At 549 shipped from Amazon, I jumped on it.  I found many stores discontinuing this model and became nervous, but all doubt was removed when item arrived with in home set up.  I feel this tv will make a great addition to my bedroom, but currently it is my main living room tv.The picture is great.  Anything at or above 720 looks amazing, some things at 480 make me question if it is in fact higher.  Contrast is very good, and I love that it has a 120Hz refresh rate.  Any glare is what I would consider to be minimal (although better placement on my part would eliminate this all together).Speakers are fantastic (I do have an onkyo receiver and speakers that I no longer feel I have to use for EVERYTHING).  Set up is straightforward and remote layout is pretty good.  Also, although I have yet to have an opportunity to use the Vera Link, I think that will be a great feature.Although a little more pricey than others it this size I feel it is a great value for what it offers and was glad I made the decision to purchase this tv from Amazon rather than whatever was on sale at my local Walmart.  If you are looking for a 32inch tv, I believe you will satisfied with this as well.", "Date": "August 26, 2009"}, {"Title": "Panasonic TC-L32G1", "Author": "Brudy", "ReviewID": "ROS0AKM5XNYU6", "Overall": "4.0", "Content": "We bought this TV for our bedroom, and it we like it very much. The set is easy to set up, and the picture is great. Based on some other reviews, we were concerned about the sound being too weak. The speakers are small and are at the bottom. We listened to the TV in several stores and had the turn the volume way up (more than other brands) to hear it clearly. However, at home this is no problem at all.Our one big complaint is the remote, of all things. It cannot be used to control any other device. For example, you can't use it to turn on a satellite receiver. The TV remote is the only device that can select the input for the TV. So if you want to switch between satellite and VCR, you need to use the TV remote. But once satellite is chosen, you need to use the satellite remote to switch satellite channels. It gets worse if you want to use features on the VCR remote (e.g., search). This is not a problem with the remote for a 2-year-old 50\" Panasonic TV we own. We called Panasonic about this under-featured remote, and we were told to fax our concern to a number, and maybe they would send us a better remote. After doing that and hearing nothing, we called Panasonic again and were basically told \"Are you crazy? We don't do that.\" So the choice is to either use multiple remotes or buy a better one yourself.", "Date": "August 30, 2009"}, {"Title": "Amazon beat anyone else by $250 on great TV", "Author": "Literate Shoe Lover", "ReviewID": "R1XNJ4S0WE4H0B", "Overall": "5.0", "Content": "Great TV - perfect in our small living room. I can finally see the actual writing on the sports scores!  MUCH clearer than the Panasonic lower line.Also, Amazon beat *everyone* else's price by $250 - $500 here including free shipping, $750 the cheapest elsewhere. The locals who promised to beat anyone's price wouldn't touch it!!", "Date": "September 13, 2009"}, {"Title": "Great Value", "Author": "Julie Anne Rosario", "ReviewID": "R2438OBWNOVW06", "Overall": "5.0", "Content": "Let me start of with saying there are hundreds of HDTV's to chose from in many different sizes . If you are looking for something for a study or bedroom this is a great choice. I finalized on this Panasonic because it had a great picture and was priced well.Things to consider1. You will want something with good HD and SD quality. This set delivers in this aspect!2.  Motion blur. Can be detected if you look hard enough in movies with fast sequences but not enough to negatively impact the viewing experience3. Sound is good for stock speakers but most will use a surround system anyway.4. Don't have to worry about burn- in5. Easy to use remote and menu's, picture adjustment is needed as in all HDTV's but luckily CNET dose that for you.6. Reliability. I have 2 other Panasonic HDTV's and have had no problems at all.  There is a reason Panasonic is rated so high in reliability.8.Outstanding priceCons:1. Blacks are not as deep as with Panasonics plasma's but with the black level problems on their recent plasma lines (Check CNET) it may be wise to stick with LCD at this timeSummery: Hard to go wrong with this Panasonic LCD  .", "Date": "March 16, 2011"}, {"Title": "Good Buy", "Author": "TMG AZ", "ReviewID": "R1AH684TZTAM2A", "Overall": "4.0", "Content": "Good company, good product, good buy for a 32 in LCD. Very easy setup. Reasonably good speaker volume. Very clear picture.", "Date": "April 9, 2010"}, {"Title": "Great TV For The Bedroom", "Author": "Curt", "ReviewID": "RXDJZX5DK7WRG", "Overall": "4.0", "Content": "We purchased the TC-L32G1 in January after a bad experience with a TC-L32S1 in December (see my review there). The TC-L32G1 has worked great. The initial set up was easy and the colors, contrast, controls are good. We like the features. The only down side is the sound. It is more than adequate for our bedroom. We do notice a difference in sound between some channels so the volume variance in some cases is due to the broadcasting station. If you are purchasing this TV for a living or family room you will probably want to invest in a surround sound system. The overall purchase experience with Amazon was A+. I would recommend this TV for a bedroom or an office or den.", "Date": "March 3, 2010"}, {"Title": "Love Panasonic", "Author": "Bruce Lee \"Let-it-be\"", "ReviewID": "R20U2V8GXVJD8O", "Overall": "5.0", "Content": "We are very please and happy with the price we paid at Amazon. Panasonic has a good quality picture, sound and good product. For those who do not have pay cable and using roof top antenna, the reception are great and in HD reception. Very very clear pictures with regular antenna. Hope this will help your decision. Thanks.", "Date": "January 13, 2010"}, {"Title": "Ok except missing analog audio output that was listed in specs", "Author": "RK Tally \"RK\"", "ReviewID": "R1Q04E7VZTBI2Y", "Overall": "4.0", "Content": "We like this TV, but had to replace a stolen TV and needed one with analog audio output so we can play TV sound on stereo system and this doesn't do it.  We chose this model for that reason becasue the online specs said it had one. However, when we got the TV ther was no analog audio output jack. So we had to go out and purchase an new receiver to use the digital audio out from the new TV. We spent more on the TV than our insurance paid to get the analog audio out and then had to pay for a new receiver, so are out of pocket over $300.", "Date": "January 11, 2010"}, {"Title": "Superb LCD", "Author": "outlaw164 \"webmaster\"", "ReviewID": "R3GHNHY6Y09U3G", "Overall": "5.0", "Content": "Really enjoying my Panny 32 inch in the bedroom. What a difference from my old Sony 19 inch analog set! Just the right size considering my viewing distance. Don't experience low volume as many reviewers have attested. Setup was a no-brainer, just read the instructions provided and follow the on-screen menus. Picture quality is awesome - bright and crystal clear. Remote is easy to learn. Just wished I'd taken the leap much earlier to enjoy my favorite late-night shows in outstanding color balance and clarity. Big thumbs up!", "Date": "January 19, 2010"}, {"Title": "120hz but no motion smoothing...", "Author": "John W. Miller", "ReviewID": "R2UR0R8O84QFE4", "Overall": "4.0", "Content": "I recently purchased 3 different 32 inch LCDs.  The first was a Samsung LN32B360C5D.  Its a 32 inch 720p LCD with a 60hz refresh rate.  After seeing a friends LCD with a 120hz I was hooked and quickly took mine back to best buy to upgrade to the 1080p 120hz Samsung LN32B640.  Now this was a gorgeous LCD!  Absolutely stunning.  So good in fact that watching regular DVD through a blu ray player on this LCD was... AWESOME!!  I was sold on 120hz rate even more.  Old DVD after old DVD was brought back to life with an amazing 3D quality that was outstanding.  But the price for this unite was 800.  Almost double what I paid for my original Samsung.SO... After watching both LCDs... one at 720p and the other at 1080p I decided that it was not the HD quality but the extra hz rate (120hz) that did the trick.  Dont get me wrong.  1080p is better than 720p even at 32 inch.  Marginal but the sharpness is with out a doubt there.  So I decided that I could do without the 1080p as long as I could get the 120hz and maybe save a few bucks.  Which led me to this LCD.UPDATE:  it was brought to my attention that what i was looking for was motion smoothing not 120hz.  so if you have read my review up until this point i am sorry for wasting your time.  my only question with regards to motion smoothing... when you watch a movie on this tv  through your blu ray player you get \"motion smoothing\"??  how is that?", "Date": "September 15, 2009"}, {"Title": "Very good tv", "Author": "Ernie", "ReviewID": "RYHS90GXPJP3F", "Overall": "5.0", "Content": "Very good quality, much better than my Sony.  The unit powered up with minor user inputs and required NO adjustments as the picture and sound were perfect.J&R; also added extra packing material which protected the tv from UPS's shipping and rough handling.  The box did not fare as well.", "Date": "September 11, 2009"}, {"Title": "Great Tv At A Low Price LETS GO PANASONIC!!!!!!!", "Author": "Philip Skowronski", "ReviewID": "R2F1BD78QIH2UG", "Overall": "5.0", "Content": "I Purchased This Tv From B& H Photo In New York Got It For 399.99, Its A greta Tv For The Price. Picture Clarity Is Great. Sound Is Great. & It Has Plenty Of Inputs. I Really Like The SD Feature. You Can Plug Your SD Card Into it & View your Pictures. I Highly REcommend This Tv For anyone Looking For a 32 inch tv. THe Picture Is Better Than Sonys 32 inch, & The price is better than samsungs 32 inch LETS GO PANASONIC!!!!!!", "Date": "December 8, 2009"}, {"Title": "Beware Samsung!", "Author": "Thomas Waggle", "ReviewID": "R2KPRJYXH8UZNR", "Overall": "5.0", "Content": "Hey, just a word of warning about SAMSUNG and SONY,Read several reviews of SAMSUNG LCDs and you will find that yes they have a gorgeous picture, but they often STOP WORKING within a year or two, and the reviews report that their CUSTOMER SERVICE IS HORRIBLE.I have read some reviews for comparable SONY LCDs again a somewhat decent product but many have complained of EXPENSIVE REPAIRS AFTER WARRANTY EXPIRES.Panasonic on the other hand has a great reputation for CUSTOMER SERVICE.I am planning on buying this TV for my Mom for her bedroom.I have a Panasonic 46\" Plasma and I LOVE IT.  BTW THE BEST PLASMA ON THE MARKET NOW THAT PIONEER IS DEAD.", "Date": "December 1, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "1366 x 768. PC Input\nDynamic contrast 20,000:1 for the brightest whites and darkest blacks\n3 HDMI inputs\n120 Hz Motion Picture Pro 3 for razor sharp moving images", "Name": "Panasonic VIERA G1 Series TC-L32G1 32-Inch 720p 120Hz LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51AxIqhb%2B3L._SY300_.jpg", "ProductID": "B001UE6MAC"}}