{"Reviews": [{"Title": "Samsung Is The Way to Go for LCDs", "Author": "Jorge J. Coelho", "ReviewID": "R3M4L5BHQKQU8U", "Overall": "4.0", "Content": "I now own three LCDs. Two of which are Samsung. I've always liked the fact that Samsung packs in a lot of features and quality for a reasonable price. For the past two years, I have been putting off replacing the TV in our family room, a 7 year old Sony 36XBR800, which is a mammoth of a set. However, our finally caved in for a number of reasons: (1) pricing on flat screens dropped, (2) wanted a television that supported HDMI, and (3) wanted a set that would help with the glare on the TV.The glare on the TV was, believe it or not, the tipping point. Our family room has lots of windows, and the blinds don't block out all the sun, so with the old set I would get a lot of glare in the middle of the day coming off the TV. It was bad enough where sometimes I would just give up trying to watch anything. I did some research and LCDs do the best job cutting down the glare because of the matte finish on the screen. Plasmas tend to have a glossy finish, which reflects more sunlight. Plasmas also tend to eat a little more energy than LCDs. Those two points sold me on the LCD.Although I will have to say that overall the Plasma, in my opinion, does a better job of handling moving images than an LCD. LCDs have been known to have issues (\"judder\") with fast moving objects onscreen, which is something you may typically get while watching sports or playing video games. To correct this issue, TV manufacturers have introduced refresh rates, which you'll see advertised (60 hz, 120 hz, 240 hz). These refresh rates help to cut down the noise you get around the edges of moving objects. However, you'll notice that while watching some programs without fast-moving action the onscreen content can sometimes looks like a cardboard cutout. It's always a good idea to use the higher refresh rates for sports and games and save the lower refresh rates for all other programming. With that said, I looked at some sports programming on both 120 hz and 240 hz sets and the improvement was marginal. At the time of my purchase the cost to go with a 240 hz set was almost $500 more (over 120 hz), which was not worth the marginal gain. If the gap came down between the two refresh rates I would definitely reconsider, but remember that you are paying for a fix by the manufacturer to the technology.So, after all my research between the two competing technologies I still went with the LCD because my main concern was glare and here are the breakdowns of my pros, cons and \"somewhere in between\" for this set.=====================PROS=====================+ Price: At the time of my purchase it was hard to find many other sets offering the same quality with the same feature set.+ Inputs: With 4 HDMI, 2 Component, 2 Composite, 2 USB and 1 PC input you'll have enough to plug in all the most popular components (e.g. video game systems, DVD/Blue-ray Player, DVR, etc.). You'll be able to hook up a card reader and browse pictures on the TV, watch movies from your camcorder and anything else you can think of doing with all those inputs.+ Picture Quality: The quality of the picture at 1080p is simply amazing. You will not be disappointed. At this size of a screen and with such a high-quality of picture you'll see things you've never noticed before in your favorite movies and shows. There were times when I felt like I was watching a movie live. It felt like a theater performance.+ Ability to Combat Glare: Mission accomplished. On a number of occasions I have been able to switch picture options in the middle of the day to be able to see what I am watching.+ Options: If you like tweaking than you'll like this TV set. You can tweak settings by input, which means that you can get an optimal picture and sound all the time no matter what source you are using. The menus are also easy to navigate and understand. I've used TVs in the past where all the options were buried, which wasn't the case with this set.=====================NEUTRAL====================== Internet Connectivity: This is what I would classify as a \"nice to have\" feature. It's nice to be able to browse YouTube, view pictures from Flickr, check sports scores, read news and more all using Yahoo! Widgets. However, there's a bit of a lag with all these features between the remote and the onscreen menu. For example, you'll notice that if you're searching for a video on YouTube, you won't be able to crank out the search text in a few seconds. It may take you some time, but nonetheless it beats crowding around a small computer screen. In short, I'm not going to stop using my computer to watch videos on YouTube or read the news, but it's nice to occasionally have the option to do it on my TV.= Speakers/Audio: Nothing amazing here. I would say it's slightly better than average. Then again, I am using the TV with a home theater system, so the sound on my set is turned off, but I did test the sound for the purpose of this review. If you sink this much money into a TV you should do yourself a favor and get a decent home theater system to complement.=====================CONS=====================- PIP: I was disappointed with the Picture in Picture options. I was hoping that the Picture in Picture would allow me to select an input other than the cable or antena hooked up to the TV, but that was not the case. On my old Sony I was able to play a game on a console, while having HD programming via my cable box on the PIP display. Basically, I was able to use any input for the TV as the source for the PIP. Samsung limits this option.- \"Judder\": I mentioned this earlier in the review and I have to say that I did notice this when watching sports and playing video games. I did notice an improvement when setting a higher refresh rate, but you'll still notice some noise. Part of it may be psychological as well, since I know the issue exists. There's also a game mode under the picture settings that further corrects this issue, but you lose some crispness from the picture. Again I want to mention that this was a minor issue and I almost classified it as neutral, but though it was worthwhile to point out.Overall I would give this set an 8.5/10. If I had the opportunity to go back I would still have gotten the same TV. If the price difference between the 240 hz and 120 hz was somewhere around $200, I would have made the jump to improve the picture slightly for gaming and sports. However, I am still amazed by the quality of the picture and it's the best TV I've owned to date. I love to tweak and this set meets that need very well with an endless array of options. I'm enjoying all the same programming as before, but with a much bigger smile.***************UPDATE***************Amazon.com recently announced that with their Prime Membership there was now access to free streaming movies and TV shows. While this not available for my TIVO I looked through my Samsung Widgets, which I previously glossed over, and found out that with a quick firmware update I can now stream Amazon.com VOD. I have never had a need to use any of the widgets or any of the Internet features, but 2 years after my initial purchase and the TV is still proving to be current.", "Date": "August 2, 2009"}, {"Title": "Best LCD for the Money", "Author": "C. Bradshaw \"shaw\"", "ReviewID": "R1T13VZ723HDUA", "Overall": "5.0", "Content": "This LCD is the best of both size and quality.  With the additional 300 off that amazon was offering a couple of weeks ago, it was a bargain for what you get.  Samsung is top quality in my opinion right now.Here is the good:Great picture.  3 extra inches worth more to me than 240 hzGlass screen makes picture more vivid and handles glare with ease.Touch of color makes it look really nice hanging in my living room.Could be better:Sound is average at best.  Most will hook it up to external speakers so it doesn't matter that muchRemote is decent but needs more quick buttons to control PIP and other tools that you have to navigate through a couple of menus to changeBad:Nothing.  You will not be dissapointed with this bad boy!", "Date": "June 18, 2009"}, {"Title": "I'm surprised...", "Author": "et", "ReviewID": "R2KJFLR1DQENEW", "Overall": "5.0", "Content": "I'm surprised that more people aren't buying this set, or at least reviewing it (which typically is indicative of sales).  Really with this set there are only two things that may bother your run-of-the-mill average TV watcher, and that is 1. Glare, 2. Flashlighting/clouding (backlight shining through).On 1 I can honestly say the glare doesn't bother me at all.  Some people may not be able to deal with it because they are picky and/or have a really bright room this TV is going into, but that is not an issue to me.  Just personal opinion.  I would never let that be a factor to me unless it truly bothered me, and it truly does not with this set.On 2 I can say that I did have some initial problems with clouding and it being visible.  I used settings posted on Cnet for this TV.  They are kind of dark, but you get used to it.  This prevents clouding from being as noticeable, but some backlight will bleed through, and it's especially apparent on large TVs.  How apparent is it?  I am very picky and although I can notice it on a completely pitch black screen, it really doesn't bother me that much during normal TV watching.  I have my backlight set at 3 (out of 10), standard mode leaves it at 8.  This is way too bright and you will most definitely see some bleed through.There are a few recommended fixes if you have clouding that is poor around the edges.  Wiping the entire TV side to side and up and down with a microfiber cloth has worked in limited cases, as well as loosening a few bezel screws along the TVs edge to loosen the pressure and keep the backlight from shining through as brightly.  Also limited success stories on this method and I even tried it with no such luck.  Changing my settings was the action that gave me the best result.  Photographs have proven even TVs that appear as if they have no apparent clouding to the naked eye actually do have clouding, so don't stare at your TV for hours looking for this imperfection, simply find a setting that seems to remove it upon a glance at the TV and move on.Some other cons to point out that you may or may not know about and/or normally wouldn't think they will bother you but might actually.  The off angle viewing of this TV is not good.  You will see the TVs contrast change dramatically even moving your head 2 feet from the center of the TV sitting 10' away.  How big of a deal is that to you?  Depends.  Some experts have said that this TV is best for one-person and adding multiple people with different viewing angles renders this set to not be preferred.  Do I believe that?  Not really.  I think for most families sitting an appropriate distance from this set probably won't be too irritated at the slight off angle viewing issues.  However, it is noticeable and the best angle by far is directly in front of the set.  Keep this in mind--maybe check it out in action at the store first if you are buying this set for a family.Another thing to keep in mind is that the TV has an included rope you screw into the back of the TV and tie off on a screw in the wall.  Very silly design and completely retarded to put on and even easy to look over when you purchase the set.  But guess what?  Use it.  This TV is top heavy like mad and easily could tip over.  I've also heard some complaints on the PIP and remote and audio as well on this TV, but I don't use any of them so I won't comment.  I also don't play games so I won't comment there, although I hook my computer up and it looks just fine.People like to hear potential negatives in reviews more than positives I think, so there is my list.  I consider myself pretty picky but overall I think this TV is an excellent buy at a sub-$2,000 price point.  If you can afford a $5,000 LED LCD with the latest technology, why are you even considering this set?  While the PQ might be comparable to more expensive TVs (truly this TV looks that good), lesser auxiliary issues like tying a rope to a wall to keep the TV from falling shouldn't even be something you should care about.  PQ is great from cable to blu-ray to PC on this set and I really don't think you're going to be disappointed if you purchase and this is your price range (or a little above).Another big debate is whether or not to go with the 52B750 with a higher refresh rate.  The truth is that your eyes will never tell a difference between the two refresh rates.  I have read that there are lesser cases of backlight bleeding with the 52\", but that's probably partly due to the fact that the 52\" is 3\" less in size.  I'm still in the return period and I could get the 52\" if I wanted, but I simply think that's not the best buy.  This TV is.Lastly I will point out that the LCD panel used in this particular set is a CMO Panel and not a Samsung panel.  Approximately 60% of Samsung's don't use Samsung panels, so don't worry that you aren't getting an authentic Samsung; it is pretty common.  The CMO panel a lot of experts complain about, but they also complain about the S-PVA panel used in the 46\" version of the B650 or the 52\" version in the B750.  The difference between the two is negligible to the everyday user, not to mention side-by-side the two panels are almost identical in specs.  If you've heard about this before and it's concerned you, or if you are hearing it now for the first time, consider it extra information and nothing else that should sway your opinion on purchasing this set.  Lastly I will say that if you are someone who thinks 42\" or 46\" is fine, just buy this TV.  The price difference is insignificant and very rarely have I ever heard of someone buying a bigger TV than what they wanted and complained about it later.  My dad likes to complain it's too big, but that's because his TV is best for viewing under a microscope and he's not used to watching things bigger.  Bigger is better.  Overall I give this TV a solid A.", "Date": "September 15, 2009"}, {"Title": "Wow!", "Author": "Stafford H. Baker", "ReviewID": "R32S1CFVHIT9MP", "Overall": "4.0", "Content": "I just got this yesterday and was immediately blown away by the picture quality, especially when compared to the 50\" 720P LG plasma it replaces. The difference was as astounding for me as the plasma was over regular def TV.  For live HD such as CNN and local news, the Samsung easily matches the sharpness and clarity one sees in the big box showrooms.  I'm not so sure about other HD broadcasts.  Some shows seem too bright, but when I adjust down the contrast and brightness, other shows are too dark.  The colors also seem to vary more from one show to another than was the case with my plasma.  I hope to be able to sort this out over time through the many easily accessed menu adjustments.", "Date": "May 7, 2009"}, {"Title": "Samsung LN55B650 Review", "Author": "J. M. Foerster \"Jmike\"", "ReviewID": "RACHJ9RVGG15L", "Overall": "5.0", "Content": "I have had this item approximately three weeks and it has met all of my expectations.  As a Plasma TV owner, I wanted to replace and older TV with an LCD since they use less power and create less heat.  I did a good deal of research but this TV was too new to have been rated.  I trusted in the quality and ratings of Samsung brandmates and was not disappointed.  It has a bright and beautiful picture; more adjustments than anyone could ever need; and many other features (such as internet connectivity) that I have yet to try.  I especially like the media viewer, since I shoot only digital photos when traveling.  This TV is so good, it shows up the flaws in my cable HD service that I never noticed before.  I highly recommend this TV to anyone looking for a large screen TV in the LCD format.", "Date": "June 4, 2009"}, {"Title": "Great value", "Author": "Mark my Words", "ReviewID": "R1GEVG07QQ9GMP", "Overall": "5.0", "Content": "Considering this is in Samsung's 6-series line (read: budget), the features and picture quality are top-notch.  Like most people, I considered an LED backlit (not perimeter lit) higher end set.  While I agree that the black level is nicer on the LED lit sets, it is not twice as good to justify the price.  Same thing with 240Hz, it's an improvement, but not a must-have.  3\" vs 1\" thick... once it's on the wall, 7' away from you, I doubt you'll care much.With a TV like this, you want to spend time reading up on settings to tweak it for your room and your tastes.  But, out of the box, the TV performs beautifully, the color and contrast are excellent.  Sound... well I'm not sure, since I don't use the onboard speakers.I was able to get this with the free blu-ray player for $[...] shipped, turned the player around on [...] for [...] bucks so the set was $[...] net.  Edit: I absoultely CANNOT believe it is selling for 2600 bucks now with NO free Blu-Ray player.  Since when do electronics go UP in price?  Next thing you know, OLED will go obsolete before LCD.If you are considering a TV this size, definitely go down to your local shop to check out the bezel as it definitely has some red highlights and is a bit bigger underneath the set than some of the more minimalistic designs out there.  That design element may bother some.  Depending on the wall color behind the set (ideally should be a neutral dark color) you may not even notice it.", "Date": "July 14, 2009"}, {"Title": "GREAT HDTV !!!!!", "Author": "Stephen W. Zisk Jr.", "ReviewID": "RY8GHX3NMGFXC", "Overall": "5.0", "Content": "Samsung hits another home run. I received my LN55B650 HDTV two days ago. Put it on my bedroom wall and WOW !!! Great sharp picture, deep colors, and a very nice appearance. In the past year, I've purchased two other Samsung HDTV'S for my other rooms, and I am very pleased with all of them. I purchased this HDTV, using Samsung's $[...] instant rebate. This put me over the top in deciding to buy. Received my television two days earlier than scheduled. Delivery by Pilot was first rate. White glove setup. I was very pleased with their service. This HDTV is everything and more. I have researched a lot of HDTV'S and as of this review, I am very satisfied with what Samsung has produced. If you are looking for a HDTV of this size, buy this Samsung and you will not be disappointed.", "Date": "June 4, 2009"}, {"Title": "ln55b650", "Author": "Gary L. Mixon", "ReviewID": "RT23B59U4KN6O", "Overall": "5.0", "Content": "After much shopping around and studying the specs and reviews on many different tvs, I purchased a new Samsung ln55b650.  I narrowed my choices to Samsungs new lcd tv and their new led tv.  I couldn't tell a lot of difference watching the two tvs in the store so I went with the 55 inch lcd.  I couldn't be more pleased with my choice.  The picture quality is even better than I hoped and after a months usage I have found no problems with the tv.I would recommend the tv and I would definitely order it again from Amazon.  The price and the delivery service make Amazon my first choice for any new appliance.", "Date": "June 4, 2009"}, {"Title": "Samsung LN55B650 55-Inch 1080p  - Fantastic Picture", "Author": "S4str", "ReviewID": "RKA1DIHTABCOV", "Overall": "5.0", "Content": "BLUF:  Fantastic set, great picture in HD or 480i (superb up-conversion), stylish design.Upgraded from a Samsung 56\" DLP....like night and day.  Having owned previous LCD sets from Sharp, I was leary about purchasing another LCD TV.  While the Sharp LCD (15\" 480i and 32\" 1080P) both had good pictures, they were not significantly better than my Samsung, 56\" 1080P DLP in either a 480i (both sets) or 1080P (the 32\").That said, I saw the LN55B650 in Best Buy and was impressed, so I proceeded to do several days of research and pricing on the internet and decided to take the plunge....purchased the 55\" and 32\" versions.- Blue Ray:  Crisp picture, deep blacks and true colors...looks like you can almost step into the picture.- HD Signal:  As good as the Blue Ray picture.- Non-HD Signal:  Great upconversion with superb detail.- Controls:  A lot of adjustments, most of which I don't touch.  Planning on bringing in a professional to fine tune both sets.", "Date": "July 4, 2009"}, {"Title": "Beautiful!", "Author": "J. \"Walker\"", "ReviewID": "R2EF6T3U90X6OL", "Overall": "5.0", "Content": "Let me give you some history first...i had originally ordered an LG plasma from HSN...it came twice with chards of broken glass...and the delivery was awful (Civa?) and took several weeks to arrive.  So i was somewhat reluctant to  purchase on-line again. So when Amazon shipped this so fast and Pilot delivered it with great service, i was very pleased.  However, afterward, i noticed a tiny scratch in the screen that showed a white dot when the screen was dark in that corner...Thought i could live with it since i was sick of sending back TVs, but obsessed over the small dot when i saw it.  I notified Amazon who offered a small discount or a new TV.  I picked a new TV.  Within a few weeks, I had a new TV delivered and the old one taken away. Amazon was great and the same delivery guy was very pleasant.  Now the TV...it is so sharp and crisp and beautifully big that i don't want to stop watching TV.  I have a fairly new LG 42\" in the bedroom and thought it was good until i watched this one.  Glad i didn't wait for an LED or whatever is next, because i can't imagine a more perfect TV.  Haven't figured out the extra capabities such as streaming, but can't wait.  Almost ordered the 52inch, but glad i went a little bigger.  It's Great!", "Date": "June 10, 2009"}, {"Title": "Now THIS is HDTV...", "Author": "ClemTigerFan", "ReviewID": "R106SCV4KMN7BN", "Overall": "5.0", "Content": "Samsung's new 55\" LCD is truly incredible.I'm not a videophile and don't want to try and provide a technical review...but can say that the picture quality of this Samsung LCD is [by far] the best that I have reviewed to date (compared to Sony, Sharp, Panasonic, and LG).Sound quality is the same as most other flat screen TVs.The only thing that I'm trying to get used to is watching movies on Blu-ray. It is so real that you feel like you're sitting in the studio. Hopefully this 'soap-opera' effect will be temporary.", "Date": "May 19, 2009"}, {"Title": "Initial thoughts.", "Author": "U. Endrabi", "ReviewID": "R1CVQBU2P1SYRF", "Overall": "5.0", "Content": "Ordered TV from amazon.com delivered by Pilot. It was delivered a day sooner than the earliest date promised. Overall experience w/ Pilot was way better than CEVA.As for TV, I bought Sony KDL 52v5100 but I was so disappointed with Sony's picture quality and features of that tv that i decided to break my loyalty with sony after so many years. I will need to post an update as it has only been 24hrs since i got this tv, but my initial reaction is that it seems to be great. looks are good and it is full of features. beats a comparable price-range sony anytime. picture quality is also very good. one thing i noticed though, is that there is a gap b/w the glass surface and the actual LCD (less than 1/8inch). keeping my fingers crossed, as i have heard bad things about samsung customer service.Update #1: Ok here is an update. For some reason the tv keeps forgetting fav channels!! This may not be relevant for many ppl but I have hooked up CATV cable directly into the tv. So when I add a fav channel, a bit later the channel goes missing from the fav list. The same thing happened to different channels at different times. Flipping channels though is much better - actually its pretty awesome. I was used to Sony, which takes annoyingly long time to change channels. But like I said, this may be a non-issue if you are using a cable box.Also, hooked up LAN cable and it would not pick up automatically so had to input all IP/DNS addresses. Internet activity is a bit slow (probably due to slower processing). Yet to check out how DLNA works. USB functionality is great - plays almost all video files, displays pictures in crisp quality, plays music etc.", "Date": "July 9, 2009"}, {"Title": "Jaw-Dropping Display, Hook-up Shortcomings", "Author": "KMac \"kaf\"", "ReviewID": "R3AJ5NEW6CA738", "Overall": "4.0", "Content": "Firstly, let me say right out. I am truly amazed at the 3d effect of all digital media displayed on this TV. I am now a witness to being in the studio to watch the filming of MI-III, Transformers, The Dark Knight and others (\"soap-opera effect\"?). That's the incredible depth of this display. I have 2 others widescreens, plus one dead Sony (this one replaced it), as a comparison, plus the half dozen friends that have their own Widescreens. Nothing compares. I am considering that my display may be an anomaly - the picture is stunning.Well now for the bad...Believe it or not, although the TV has HDMI x 4.... (You send the perfect HDMI digital audio and video to the TV) Samsung decided that the audio output would be stripped of all but a left and right channel - that's right - ala 1980 2-channel output from the \"audio out\" jacks fed back to your amplifier/receiver. In my previous setup ALL of my audio/video went to the TV (which did output surround audio). My DVD Players and HD set top box audio also went to the amplifier/receiver. This allowed the ultimate flexibility with PIP. I do use PIP often, my wife and I snuggle while she watches \"murder she wrote\" and I watch UFC (LOL), and also every NFL Sunday. I might add that the LN55B650 built-in Tuner WILL send digital sound(i.e. 6.1 etc.)via the audio out, so it is possible - and all the more irritating. It is a poor decision to whack the HDMI audio input down to 2 channel audio output - why not allow the surround sound content to be output - strange...I recommend checking this out before purchasing any SAMSUNG brand - dont get surpised like I did ( in my particular set-up, my amplifier cannot accept input from all 4 of my sources, so going to the TV gave me the extra inputs - I may be forced to buy another amplifier, which I do not want to do)And on the PIP...The PIP only allows one Source selection... DVD OR cable box OR satellite, etc... THE OTHER SOURCE MUST BE THE BUILT IN TUNER. This is a disappointment. The previous 3 TV's in my home (2 still in use)could choose any 2 sources. I have read that when using PIP, only analog channels are displayed, this is not true, the QAM tuner will show ANY content - digital or analog, but the consumer should be able to choose his 2 sources for PIP display.NOW.... that said, I re-emphasis, the LN55B650 display is absolutely jaw dropping and almost makes up for the other shortcomings.... a strong 4 rating, I wish I was watching it right now.......", "Date": "June 15, 2009"}, {"Title": "Best Father's Day Ever!!", "Author": "mowinemdown", "ReviewID": "R31M00JC8KKE7F", "Overall": "5.0", "Content": "I have never seen a better picture than the one on this Sammy.  HD content on it is simply jaw dropping to my eyes.  Way too bright out the box, but a few adjustments to contrast and backlighting brought it to an awe inspiring level. This replaced a 62inch Mit$u DLP (broke after just 3 years) and I couldn't be happier. No more fan noise, no more green push, no more suckiness of the Mit$u.  I dusted off the xbox 360 HD-DVD player and watched Transformers again. This TV actually made me like the movie. Much much better than my theater experience.  Black levels were excellent and the colors, Oh my!!! This thing is almost 3 dimensional at times.The Auto Motion Plus feature works as advertised, but I changed the judder reduction to 3 and the blur reduction to 10.  No soap opera video with these settings.  I haven't had the set calibrated yet, but I can't imagine it getting much better anyway.  Maybe a year or two down the road, I'll look into it, but I'm just scared to touch anything now.The negatives are small, but must be noted.  The internet connectivity is very gimmicky as the Yahoo widgets are limited.  I checked out Yahoo News, and it has a bunch of headlines, but no full stories.  It is also painstakenly slow to navigate.  The menu system in general is pretty slow also.  There is a touch control panel on the front bezel that can control volume/power/channel/source, but there are no visible labels. I thought there might be some way to illuminate the panel, but could not find anything in the manual.  This makes the front panel touch buttons fairly useless.I for one love the design of the front bezel and it compliments the TV perfectly.  Who wants a dull black box when you can have the glass over red carbon fiber look! Ok, I went too far there, but I like it.Overall, this is a fantastic product and I hope to enjoy it for years to come. When the economy gets better, I will be getting me a blu-ray player to feed this beast. It's so hungry for HD...", "Date": "June 22, 2009"}, {"Title": "I love this TV", "Author": "John M. Kirkpatrick", "ReviewID": "R27OC911RXZ9BO", "Overall": "5.0", "Content": "I reviewed TVs for some time and ended up with this model after much reading and comparing of different models.  My critera were picture quality, size, cost and brand in that order.  I did not want to spend over $2K, but wanted a TV in the 50\" to 60\" size with a great quality picture. Brand was only imprtant that it be a name brand, but did not care which one.  I did not care if the TV was Plasma, LCD or LED.I had a hard time deciding between this model and the Panosonic G10 50\" plasma (G10 was less $ but picture quality was lower in my opinion but not by much.  If cost is a primary driver then I would go with the G10 and save the dollars.  My reasoning rulled out LEDs that are to bleading edge from a cost standpoint, 240 hz was the same and I could see no differnece in quality, and from what I could see neither had a better picture at all but just cost more.  I did not need the thin panel an LCD provides I know in the near future they will be the standard, but too much price difference today.  This Samsung has the best picture of any TV in the store bottom line, looking at them all side by side this model always had the best picture by a wide margin.  That includes the LED, 240 hz models and even ones that cost 2x as much or more.Since getting it home the only coments we have had is the picture is too good - \"I did not know that actor had a small scar\".  We have not gone out to a movie since getting it, why would we when we have a better picture at home.  Two of our friends left our house asking for the model number so they could replace thier TV - it really is that good.  My son thought the picture was so good he felt the actor was going to walk out the side of the TV when they walked off camera.If you are looking for an excellent picture in a 50\" plus size at a reasonable price this TV is perfect.PROS  Picture Quality, Size, Internet (use it to watch NetFlix movies), Automatic detection of components, Very Large Viewing AngleCONS  Sound just ok (plan on surround sound), Reflections (has a much more shiny face than my other LCD TVs, think about where you will put this model and if that is a problem look for another model)", "Date": "January 1, 2010"}, {"Title": "LCD vs LED", "Author": "C. Dinh \"Happy Camper\"", "ReviewID": "R2L761V2FBZPCV", "Overall": "5.0", "Content": "After ordered the LCD with Amazon, I read some reviews and found out that CEVA, shipping company was lousy.  That is not the case here for me.  They were very professional, 2 guys carried it into the house, and even asked if I want to have the LCD out of the box.  I didn't want it out and all I had to do was to sign a piece of paper stating that buyer does not want the unit out.  They called and scheduled the delivery and very on time.  I have to give them A+ for delivery.  Can't ask anything more than this from buying on Amazon, NO TAX & FREE SHIPPING - I love it.Samsung makes a beautiful unit, lucky me that I didn't waste money for Sony, much cheaper and same or better quality.  Buyers out there, don't be fooled by the products displayed in the store.  Because LED is the new phase, so what they do is they place the LCD and LED side by side for comparison.  I saw these two units at the store and the LCD was no match to the LED.  The reason is this, at the store the place the LCD on the lower solution and that makes the LCD look cheap.  After I got the unit, turned it on and the picture is beautiful, flawless, awesome.  Making the football season is amazing on the HD.  The red touch is very cool to some.  That means you can turn on or off the unit with a soft touch in the front without using remote control.  The sound is OK to me.  I am looking to buy another Samsung when the price is right.  Goodluck to all with Samsung.", "Date": "October 5, 2009"}, {"Title": "Outstanding television", "Author": "Red Green", "ReviewID": "RURGRAHU4WB7C", "Overall": "5.0", "Content": "Purchased the LN55650B to replace a Samsung 56 inch DLP, and it is a huge improvement.My biggest concern in researching the television was how it well it would work in a very bright room.  I have three picture windows in my living room, each of which is at least five by eight feet.  I get a large amount of ambient light during the afternoon which made watching the DLP very difficult for several hours.  No problem with this set.  Yes, there is some reflection, but the picture is very good.  I've watched movies, television programs, and sports with great satisfaction.  Don't let reviews scare you that warn against reflection.I was also pleasantly surprised with the quality of sound from the television.  I have a home theater that I can use, but usually I don't bother switching over to it.  For movies, yes, not for much of anything else.This is the best television I've owned.  I've owned at least a dozen...", "Date": "September 18, 2009"}, {"Title": "A Masterpiece!", "Author": "F. Massoud \"theSPHINX\"", "ReviewID": "R1JIY0AME3GYRG", "Overall": "5.0", "Content": "Like everyone else on Amazon, I spent a year researching and reading up on LCDs. I made my choice in February 2009 and bought a LN52A650. WOW! Even better than I read and thought...Well, we got burglared and guess what, I was in the market again. I wanted to order the same model but it had gone up to $2299 (I had paid $1815 in February). Obviously very popular and the new model had come out. So I looked at the LED series (the UN7000 and UN8000) and the LN55B650. I went to a Best Buy, compared them side by side, and guess what, there was no difference in picture quality.I've had the LN55B650 for a month now and let me just say this: I'm in consumer heaven! Read all the 5 star reviews of the LN52A650 - it applies to this model and expect to be blown away!", "Date": "July 30, 2009"}, {"Title": "Very Dissatisfied with This Model Samsung", "Author": "Guitar Operator \"Guitar Operator\"", "ReviewID": "R1X40LUTCW9TUS", "Overall": "2.0", "Content": "For almost one year it was the best TV in the world.Shortly before the warranty expired it developed \"grid lines\" on the right 1/3 portion of the screen. At first it was hardly noticeable and when it became clear there was a real problem the warranty had expired.We tolerated the grid lines and tried to ignore them as much as possible. Some times it was easy depending on what colors and images were on the screen, other times it was aggravating. By the end of only the second year there was large swaths of orange and yellow colored bands overlaying everything including the menu screen. This is when I looked into getting it repaired.Samsung was unwilling to work anything out even though it was only a few weeks past the one-year warranty expiration date.I went online to Samsung to locate a repair center.We live in an area where the closest authorized service center is hundreds of miles away.This TV has since dropped in price by more than half than when we first purchased it.I looked into replacing the motherboard, which can be bought for less than one hundred ninety bucks -but one must feel confident and have some basic skills, and if that isn't the problem fixer, then you have blown your money.I am a certified PC Technician and will attempt to repair it someday, but if one were to take it to a local unauthorized repair shop, they would charge you almost three hundred (maybe more) to fix it. Is it worth it? The jury is still out.My girlfriend watches high-action sports and movies. She bought an LG 50\" plasma television and couldn't be happier. No blur whatsoever. 6000Hz refresh rate (yes, that's SIX-THOUSAND Hertz)3 Million black contrast depth, no screen burn, long life.We paid sixteen hundred bucks for the Samsung 46\" LN model when this first came out and for that amount of money you should get more out of it than just one year of service. In the \"old days\" appliances would last 15-30 years. We would have been happy with five years.It was the best LCD I have seen when it worked correctly, but due to short lifespan and poor customer service policies, I would be apprehensive about buying any Samsung products in the future.Because of this experience, if I found a similar product in the same price range, I would most likely buy it in fear of repeating the same problem/mistake again.I hope Samsung reads this review.", "Date": "July 30, 2013"}, {"Title": "Bull's Eye for Samsung... almost!", "Author": "Bow CochinoKonnichiwawow \"The gaming enthusiast!\"", "ReviewID": "R16XSK2QDJOXPF", "Overall": "5.0", "Content": "I purchased my Samsung LN55B650 here from Amazon almost exactly 2 years ago. Long after the novelty and excitement of the purchase has worn off and much experience with the TV has been gained, I now feel I can write an honest review.I received the TV from the kind shipper who helped me set the display in my home and verified it to be in working condition.HARDWARE: WEIGHT / SIZE / HEAT DISSIPATIONThe TV is heavy (~60 pounds). Unless you've professionally competed in an IronMan contest, you won't be able to safely move this TV around without the help of someone else, due to its weight and grand size. I don't consider this a con, but it is something to consider if you live alone.Considering the size of the TV, it actually runs quite cool! I've owned a 32'' Samgsung LCD that honestly produced more heat than this 55''. I run the TV mostly with the backlight at 80% max and brightness setting on 50% max, yet when I place my hand over the display, I can only barely feel the heat. In a 18 sq. ft. room, air conditioned at 74 degrees F, the temperature in the room does rise, but hardly noticeable.About 5 minutes after turning on the TV, there are popping sounds that continue to occur about once every minute or so until about 20 minutes have passed. After this time, the popping sound stops. After turning the TV off, the popping resumes for about 20 minutes, then stops. This is normal and is simply a result of parts expanding/shrinking as a result of heating/cooling parts. The noise is noticeable over medium audio volume, but it's minor and infrequent.CONNECTIVITYI mainly purchased this TV to do gaming and occasional movie watching. With the 2 sets of component inputs, 4 HDMI inputs, and 1 standard composite video input (something not seen in most new flat panel TVs these days), I've had no problems connecting all my old and new game consoles. Almost all of the ports are located on the back, but a few are located on the right such as 2 USB ports, 1 standard composite video/audio, and 1 HDMI port, giving flexibility to various home setups.I do have a couple gripes about the audio output. I enjoy using headphones when I play games or watch movies/shows, but there is no headphone output jack on this TV. Instead I had to buy an RCA (male) to 3.5mm stereo (female) jack so I could connect my headphones to the TV's RCA output jacks. To make matters worse,, the TV does NOT allow you to adjust volume of the RCA output unlike some other TVs, so I was forced to listen to my headphones in maximum volume (unless you have a headphones with adjustable volume).SCREENThe swivel is especially useful in large rooms to accompany various seating arrangements and allows about 60 degrees of free movement.The viewing angle is quite good, but blacks do become less rich when viewed at about a 30 degree angle. I thought this would be a problem, but it actually doesn't negatively affect my viewing experience. If and when I view the TV at an angle, I quickly become accustomed to the difference in black color. Fortunately, other colors seem to stay vivid at angles. It's only the black color that seems to be affected by viewing angles. The weakened blacks can be largely corrected by adjusting the black settings in the \"advanced settings\" menu as mentioned in my \"COLOR SETTINGS\" section.In various rooms, I've found that glare exists in almost all lighting conditions unless of course the room is completely dark. Glare is worst when the room is about about 60-80% pitch black (such as during sunrise or sunset), and there is a sharp light entering the room that can be reflected from the TV screen. During these lighting conditions, viewing the TV is VERY difficult. I am forced to either pivot the display to prevent light from hitting the screen or increase the backlight of the LCD to minimize the effect of the glare, both of which are inconvenient and yield mixed results. However, although glare is almost always visible in my lighting conditions, most of the time the glare is minor and not an issue. I don't consider the glare to be a con of the LN55B650, because that is the nature of glossy screens, but if glare is a problem for you stay away from this TV! (You may want to consider a non-glossy matte screen like the highly rated 55'' LG Infinia  55LW5600 instead.)COLOR SETTINGSThis TV offers countless color settings including the basic ones like contrast, backlight, saturation and brightness for users to adjust to their liking. The TV does offer finer color settings like red/blue/green range, but I haven't needed to adjust these since the TV already displays superb picture quality after minor changes to the basic settings.One special picture setting I've not found in many other TVs is the option to increase the darkness of blacks. Located in the \"Advanced Settings,\" there are 3 black levels the TVs allows when connected via HDMI: off, dark and darker. I've found that the \"dark\" setting give excellent, rich, realistic blacks while the \"darker\" settings makes things too dark causing the picture to lose details. I've found these dark settings really useful, as they significantly improve the black levels, especially when viewing the TV from an angle.AUTO MOTION PLUS: BLUR REDUCTION / JUDDER REDUCTION\"Auto Motion Plus\" is Samsung's umbrella term for blur and judder reduction. It is basically the only reason manufacturers are now producing TVs with 120-240 HZ capability. Blur reduces motion blur while the judder setting adjusts the fluidity of motion, and each can be independently adjusted.When Auto motion Plus (both blur/judder reduction) are enabled, I notice a significant difference in videos that are 30 frames per second or less (\"fps\") [most cable/satelite signals and movies are in 24/30 FPS]. Motion becomes much more fluid and blur definitely does reduce trails following high motion scenes (sometimes referred to as \"ghosting\"). For video content playing in 60 FPS or more, I notice no improvement using the Auto Motion Plus (if you want blur/judder reduction for 60+ FPS content, you need a 240 HZ capable TV).  However, there are side-effects to using these blur/judder settings. On higher blur reduction settings, sharpness is very subtly softened. On high judder reduction settings, you may occasionally see water-like outlines following objects that move. Both of these side effects can be virtually eliminated by reducing the blur/judder reduction settings to about 50%. At this point, I notice neither the aforementioned sharpness decrease nor the water-trail effect. You can disable Auto Motion Plus by decreasing the blur/judder to 0 or by enabling Game Mode which eliminates all post processing effects applied by the TV.GAME MODEGame Mode is aimed at video gamers to minimize the input delay (\"lag\") between the time a button/action is performed on the game controller and the time the action is performed on screen. This delay is caused by the TV applying effects such as blur/judder reduction.I do not notice the input lag for most games when Game Mode is off, but for certain game genres, however, the input delay is noticeable such as for high action racing, shooters or fighting games. For these genres, I recommend users to change to Game Mode for reduced input lag. Changing back and forth between enabling/disabling Game Mode is not really a nuisance and can be done with only about 3 button presses on the remote control.USBWith the USB ports on the right side of the TV, you can connect flash drives or USB hard drives to display pictures or videos or play music stored on your device. The TV is a little picky with format options and resolutions that it will accept, but when you have your files in the proper format (The accepted format specifics are described in the manual.), the resulting convenience and picture quality is amazing.  At first I thought I would never use this feature, but I now have a portable 2.5'' USB hard drive dedicated to storing movies so I can play them at any time on this TV. Convenience doesn't end there. The TV can also read subtitle files if you have a video with compatible subtitles. Navigating the drive is a breeze, as you can sort your media by title, date, author, folder name and more. Fast forwarding and rewinding is quick. Also, if you turn off the TV in the middle of a movie, the TV will remember where to resume next time you replay the video.DLNAThe Samsung PC Share Manager (include on a disc that comes with the TV or downloaded through Samsung's website) software that allows you to stream your PCs media to the TV is minimalistic, but it does the job and does it reliably. I've had no problems streaming music and movies the few times I've used it. You play the files using a similar interface as you use when accessing files from USB. Ffter you setup your PC with the Samsung PC Share Manager, your TV gives you the option to view files stored on a networked computer.ONLINE APPS / \"WIDGETS\"Probably the only feature lacking in this TV are the widgets. They are all TOO SLOW and unresponsive to be useful on a need-basis. For this reason, I have only used them a handful of times. Fortunately, widgets / \"smart apps\" are unimportant in my eyes and more of a perk. If they were faster, I definitely see myself using the weather, Youtube, or news widgets though.MISCELLANEOUS: CONTROLLER / TV BUTTONSThe controller design is actually quite good. The buttons are large, fat, easy to press, and have large text written on them, making finding the features I want and using the controller a breeze. It helps that all the buttons are logically mapped too. To top it off, there is a button to turn on a light inside the controller so you can read the buttons in the dark.Unfortunately, the receiver for the controller is terrible. You need to aim the controller DIRECTLY at the lower right hand of the screen for the TV to to register your remote control button presses. It's an annoyance that I have yet, after 2 years, gotten accustomed to, and I doubt I ever will.The black bezel on the TV is attractive, though it seems Samsung decided in favor of looks over functionality when designing the basic buttons located on the TV. Instead of buttons like on most TVs, you get touch sensitive pads. This has resulted in many accidental button presses on the TV. More annoying is the fact that the the text labeling each button is very dim and small, so much so that it is nearly impossible to read in even most day light conditions ( I have clinical 20-20 vision, mind you). So, if you want to adjust volume, change channels, or simply power off the TV by using the touch pads on the bezel, you pretty much need to put your face right in front of the buttons to read the text.SUMMARYThe Samsung LN55B650 is an excellent TV and still is a bargain compared to many of today's newer models of TVs due to its top notch picture quality. It features a solid USB media playback feature / media streamer that you would normally need to purchase separate devices for similar functionality. The TV has numerous picture settings, sure to please any TV enthusiast. Many inputs means more flexibility in entertainment options. To top it off, it has low heat dissipation!My only gripes with the TV are with the supplemental features including:-no headphone jack/ no volume control for stereo output-slow widgets (\"smart apps\") makes them almost unusable-weak controller receiver means you need to aim directly to the lower-right-hand corner of the TV when using the remote control-touch sensitive pads with very fine/small text labels on front of TV make using the panel controls difficultIf I could rate this a 4.5 instead of a 5, I would. I know the features I have complaints about are minor, but they are features I consider at least lightly important (except for the widgets). However, I don't feel that a 4 would accurately describe the overall quality of the item, so I rate it 5.", "Date": "March 26, 2012"}, {"Title": "manual should be better", "Author": "R. Corson \"alternity\"", "ReviewID": "RW2RYCHG9LKIW", "Overall": "4.0", "Content": "Nice TV, but the manual isn't very accurate. The menu paths described in the manual won't get you where you want to go. The manual is just wrong. Perhaps it was written for a different or older model TV. The directions will get you started in the right direction (usually), but when you hit a dead end, you're on your own. It's a puzzle or game for you after that. I've solved most of the puzzles, but some of the puzzles I haven't solved yet. Also, it appears that the manual was translated from Korean into English and not done very well. Some of the grammar is strange. I suppose a lot of people never read the manual, but it's important to me to have a good manual in order to discover and use all of the capability of the TV.", "Date": "January 4, 2010"}, {"Title": "Awesome TV", "Author": "B. Robichaud \"CuriousGeorge\"", "ReviewID": "R4Q4I6OHLWO9D", "Overall": "5.0", "Content": "This is a truly beautiful television. It has the size and quality to be the center of any home theater. The display is crisp and sharp with little if any distortion or fade when viewed at fairly extreme angles. The menu is top notch and easy to use. There are more than enough inputs for just about any situation.My only complaint after a few weeks of use is the choice of placement and design of the control buttons on the set itself. They are way down in the lower right corner and are not physical buttons but instead touch sensitive areas of the bezel. While they are attractive in the sense that you can''t see them, they are also a problem in that you can't see them! My guess is Samsung has decided most people never use the buttons and instead rely entirely on the remote. I would prefer they just put the buttons behind the bezel so they are still not visible and don't break up the otherwise gorgeous look, but still allow them to be usable.", "Date": "December 22, 2009"}, {"Title": "AMAZING", "Author": "Cali Girl", "ReviewID": "R3UYT1DHPJS161", "Overall": "5.0", "Content": "wish i had chosen the LED version, but that would have cost even more. But I looove this tv", "Date": "October 30, 2009"}, {"Title": "Awesome", "Author": "I. Adler", "ReviewID": "R2PX8FTZJF0UVQ", "Overall": "5.0", "Content": "This is my third Samsung in the past 4 years.  I started with the first gen LED DLP which crapped out and then was replaced by the hl61A750 which is an amazing piece of work and is still kicking.  I also purchased my first LCD as the ln40a650 which has since been moved to my bedroom to make room for the ln55b650 which I will review here.This TV is amazing.  Some may dislike the bevel in the middle but I don't even notice it, partly due to the fact that my center speaker is blocking it.  I currently have the tv on a stand slightly higher than eye level, which is somewhat unfortunate.  Straight on this picture is the best I've seen as of yet except for the DLP.  Off center though you lose a little bit of depth and things become kinda purple/blue.  My setup is just a couch in front of the tv though so I only have that problem when I'm in the kitchen and watching.  Colors look natural and beautiful on this set, which keeps up with the Samsung standard I have grown to love.  To watch DVDs I now use my PS3 and they look great.  I believe I've turned off the AMP feature as I've noticed there is slight input lag especially when it comes to gaming. (Tested in demo mode w/ games like guitar hero where you can see the difference)  For TV and movies it might not be bad, but I'm ok with how it looks normally.  24p works flawlessly with blu-ray and the picture is amazing.  Wall-E is the only movie I have since it came with the PS3 but it's great.  Blacks are black and the whites are white.  Completely satisfied with this TV.I purchased this TV for $1800 here I guess during some amazing 2 day special because the price has been fluctuating.  But at that price it can't be beat.  If you're considering this set, just get it.  you won't be let down.", "Date": "October 8, 2009"}, {"Title": "55\" of great viewing", "Author": "Sandra B. Norton", "ReviewID": "R3BUSUI3GOXZ5F", "Overall": "5.0", "Content": "I recieved this TV about a month ago, I absolutely love it.  I know that this TV has the very best picture of any TV that I have ever seen.  Coupled with my new Sony Blue Ray player, the viewing experience is marvelous, simply marvelous.", "Date": "October 5, 2009"}, {"Title": "Great TV", "Author": "I. Lockwood \"Jtown\"", "ReviewID": "R2UHU9FR26GK9J", "Overall": "5.0", "Content": "We replaced our three year old Panasonic 50 inch plasma with this TV. It was just as big an improvement as we saw from our Mitsubishi HD projection to the Panasonic. The results are borderline 3-D on all HD channels. This is a great TV! Delivery and set up makes Amazon miles ahead of hauling it home from Best Buy. I saved shipping and sales tax.", "Date": "June 12, 2009"}, {"Title": "Great 55 inch TV", "Author": "Dhruv Srivastava", "ReviewID": "R2UJGR0UBNDFAD", "Overall": "5.0", "Content": "The TV is absolutely beautiful. I did contemplate between the 240Hz ln52b750 and this model and am glad that I choose the ln55b650. The larger screen size is surely a plus.HD channels are great to watch. The only drawback is that when you watch non HD channels the low video quality is also magnified, since the TV outputs all details of the picture.I did see the opera affect on some channels but that got fixed once I switched off the 120Hz.I would surely recommend this TV.", "Date": "June 4, 2009"}, {"Title": "Great TV I have the similar LN55B640", "Author": "Rebecca", "ReviewID": "R2F9XRK0BRHU9B", "Overall": "5.0", "Content": "I have just recently bought the LN55B640 which is the sister model to this one.  It is a great TV. I had first had the 58 Plasma and exchanged it for this because the plasma made a slight humming noise esp during bright white scenes which I found annoying.  This is a great switch. I find that the black tones are very good for an LCD picture quality is very similar to that of the new Samsung LED at a much cheaper price. Be aware you will need to adjust the settings most likely when you get this TV out of the box. I need to switch a lot of the settings including the Auto Motion Plus feature. It comes set on Standard which I found to be a bit superimposed looking and a bit bizarre for some shows and movies.  For those of you who have the feeling the TV looks \"Too real\" of like it was shot with a great home video camera all it is is the Auto Motion Plus feature under Picture - Picture Options on the settings Menu, just set it to \"Off\" or \"Clear\" which I like for most shows.  Hope this helps.  Good luck and this was a great choice for me!! :)", "Date": "June 15, 2009"}, {"Title": "So worth it!", "Author": "Donna Alzaga \"mamadonna\"", "ReviewID": "R2F0HLYJ8KGKF6", "Overall": "5.0", "Content": "I ordered my TV when there was a promo for free blue ray player with a Samsung TV purchase. It was delivered within the early part of the following week.  I am very pleased with the picture quality and other features of the TV. And with a free sony blue ray player, I really think I hit the jackpot with this Amazon deal.  I will highly recommend this to anybody.", "Date": "July 11, 2009"}, {"Title": "Awesome TV & a great response from Amazon!", "Author": "Kirk T. Kern", "ReviewID": "R1RQU2D9X6EHTB", "Overall": "5.0", "Content": "Amazon was amazing.  I ordered the unit in the AM on Mon and it was shipped and installed on Tues by 5.  Better response time than the local electronic store(s) delivery windows.  The 100,000-1 contrast ratio really makes a difference and gives animated films a 3D like appearance.  I had some conecerns about viewing SD cable channels on this larger screen.  This Samsung does a good job with scaling and displaying standard def feeds. When running 1080P it is just plain beautiful. I didn't like the touch of color frame on earlier models but this one is more muted and is much better looking.  This is one great TV being offering by an impressive vendor.  I certainly plan to buy my next one here as well becuase the TV/DVD combo I ordered was the best price around and both arrived next day.", "Date": "July 5, 2009"}, {"Title": "DON'T BUY SAMSUNG!!", "Author": "I HATE SAMSUNG", "ReviewID": "RQC464LUUK4VD", "Overall": "1.0", "Content": "Have a t.v. just like this one which will be 3 years old in July.  BROKEN 4 TIMES. 1ST time, 2 weeks past 1yr anniversary of purchase date. Contacted Samsung president about warranty and basically got a \"tough luck\". Each time it has been fixed, it cost $350. It's broken again and I'm done. By the way, my sister had an equally as horrible story with Samsung phones.  She gave up and bought a different brand.", "Date": "May 12, 2013"}, {"Title": "Short lifespan", "Author": "Brbnkseaj", "ReviewID": "RUAVKKHLI6FHH", "Overall": "2.0", "Content": "We bought this tv in early 2010, and it made a loud pop and the power died in January 2013.  I had two other big complaints.  One was sound quality.  Voices were always drowned out by background noises.  If you are going to pay this much, you shouldn't have to buy a separate sound system.  My other complaint was lag time when changing channels.  If the next channel had a different resolution, the screen would flicker for a few seconds before finally adjusting itself.  One other issue I had was that I had to use a Samsung remote when switching between my Samsung blu-ray and the tv.  The remote I normally use is for the Charter cable box.  Everything else about the tv was very nice.", "Date": "January 26, 2013"}, {"Title": "Terrible quality", "Author": "Samsungsucks", "ReviewID": "R36XENAM5GA4OM", "Overall": "1.0", "Content": "Tv is not built to last. Had it 2 & 1/2 years and now it won't turn on.  $2,000 down the drain.  If you make the mistake and buy this tv buy the longest extended warranty you can find.  Samsung is not built to last. Buyer beware.", "Date": "July 18, 2012"}, {"Title": "Great TV", "Author": "snook", "ReviewID": "R2EBWLLIIIERF7", "Overall": "5.0", "Content": "Had this TV for about 2 years now and the picture is just as good as day one. HD channels are very sharp with excellent picture quality. Remote is fairly easy to operate and has options to customize the picture to your likeing. Very pleased with this LCD Samsung TV.", "Date": "February 1, 2012"}, {"Title": "Great TV!", "Author": "SocialgirlAB", "ReviewID": "R3NIPH9A8VFJSO", "Overall": "5.0", "Content": "I ordered this TV refurbished so I got a great deal and it came in brand new condition, it looks awesome and the picture is great too.  I don't know why some people are complaining about the glare issue because I have mine on in my living room with all of the lights on and no glare issue, it looks great. We had a Samsung LCD before this one and it was about 5 years old and we had no problems with it at all so we wanted to stick with the Samsung brand and I am glad that we did!", "Date": "May 17, 2011"}, {"Title": "Great TV", "Author": "Matthew N. White", "ReviewID": "R1T3V1XYQ6SJ5L", "Overall": "5.0", "Content": "Picture quality is top notch on this Samsung. Most people that visit make mention of the TV and picture quality which is better than the Bravia and Sharp Aquos our family members have. In fact, we have friends that bought the same tv after seeing ours when they visited for dinner.  The Red tinged frame of the tv is fine as long as direct sunlight is not shining on it. While the frame is the only improvement we would suggest, it is tolerable.Recommend looking at other reviews to find optimal picture settings for de-judder which should be adjusted for bluRay movies.", "Date": "December 18, 2010"}, {"Title": "Samsung 55inch LCD TV", "Author": "Oliver L. Johnson", "ReviewID": "R3VEQ1SBAL4KDS", "Overall": "4.0", "Content": "Not problems with the TV itself but the delivery time took way too long.  They promised it by a certain date but it did not arrive until 5 days after the promised date!  Next time I will buy at a store.", "Date": "November 2, 2010"}, {"Title": "BEAUTIFUL", "Author": "BALLS803", "ReviewID": "R1B7HC79XN9THQ", "Overall": "5.0", "Content": "What a beautiful tv. The look of it alone not even on is awesome. I love the red outer shell to it, it is a great addition to the tv. The picture is phenomenal. I also enjoy how you can hook an ethernet cable up to it and use the widgets. Yes it is slow, but still nice to have the internet weather etc. at your fingertips only by using the remote that it comes with. Also the disk that allows you to download samsung share on your pc is great as well. You can use it through your ps3 to do a slide show of pics. I had it running during my daughters first b-day with a bunch of pics that we had taken of her during her first year. Everyone loved it. Good job Samsung. This is not just a TV is is a entertainment center for sure.", "Date": "October 25, 2010"}, {"Title": "Best T.V I have ever owned", "Author": "Edu #33", "ReviewID": "R2TYU1RW5RGRHD", "Overall": "5.0", "Content": "Just awsome, plain and simple. Got mine used for 1,300.00 and really could not tell it had been used at all. Samsung is #1", "Date": "October 9, 2010"}, {"Title": "SAMSUNG AND AMAZON ARE BEST", "Author": "JDAWG", "ReviewID": "R3S4Y0GDF5I9BR", "Overall": "5.0", "Content": "OMG SAMSUNG AND AMAZON YOU HAVE TEAMED UP TO AMAZE ME. i am now even happier having come back to review this tv and seeing i saved hundreds by buying when i did. i am a samsung dude. they have ahd me as a loyal and happy customer since an old flip phone i owned 10 or so years ago. it was well made and pretty. SAMSUNG YOU MAKE GREAT PRODUCTS WELL, unlike lets say GM, motorolla, and too many other businesses to name, that make garbage, and subsist on lies and bail outs, samsung you are amazing and i love you. the only con of this tv, and really its on you for not doing ur research, the screen is shiny. this has pros and cons, basically, dont buy this for a bright room, its not even a con, but some ppl complained so i thought id enlighten you, its ur fault for not doing ur research. other than that perfect, and exceeds all my expectations. we bought our fisrt lcd from samsung because everyone was already saying samsungs are great, and based on that old ass cellphone i was willing to take the plunge. when we bought this new tv there was no question it would be a samsung. it is really such a beautiful tv. do yourself a favor and buy a samsung, seriously, the rest are garbage, dont believbe their lies, read reviews. now on to amazon. WOW. just WOW. WAY TO BLOW ALL COMPETITORS PRICES OUT OF THE WATER, AND SHIP ME THIS HUGE TV IN 3 DAYS FOR FREE, AMAZON IS ALSO AMAZING, JUST LIKE SAMSUNG, I LOVE YOU BOTH. DONT EVER CHANGE, I WILL BE YOUR CUSTOMER FOREVER BECAUSE YOU ARE BOTH HANDS DOWN THE BEST BY SO MUCH ALL UR COMPETITORS ARE A JOKE. srsly, I tell everyone to go to u guys. it really is refreshing fopr a large company to not suck and lie and be evil. dont ever doubt your choices to be upstanding and good people, i spread the gospel every chance i get with a huge grin on my face, just as i do now :)))", "Date": "August 13, 2010"}, {"Title": "Great Samsung customer service", "Author": "Kerri Hawkins", "ReviewID": "R34RC20EJOBQRR", "Overall": "5.0", "Content": "I've owned this television for a little over a year. I could not be more happy with the quality of the picture and sound. About a week ago, it started a very odd flickering (like an old movie projector) which grew progressively worse. I hopped online because usually if a product has a known defect, there are complaints all over the internet. However, it seemed my problem was unusual because I found almost nothing. The television was one month out of warranty, so with little hope I called Samsung customer service. To my surprise, they extended my warranty for three months and scheduled a service call within two days. The repair crew showed up, swapped out some circuit boards, and the television is beautiful once more. Shocked and pleasantly surprised at the level of service.", "Date": "August 8, 2010"}, {"Title": "Samsung LN55B650", "Author": "M. Thomas", "ReviewID": "R1IWWVGHXD1NTQ", "Overall": "5.0", "Content": "After 60 days in home viewing I can honestly say that Samsung LN55B650 is an outstanding LCD HDTV.  I did compare  to this years LN55C650 and really did not notice any difference in picture quality.  I did debate over LED backlit, 3D ready & such but always came back to the B650.  The red touch of color does standout but it grew on me.  Overall, no complains.  I am very happy with my purchase.", "Date": "June 22, 2010"}, {"Title": "Best tv for the money", "Author": "EZ ED", "ReviewID": "R2ZFDZ3J76EJ4F", "Overall": "5.0", "Content": "I painfully reviewed several lcd tv's (including LED) on price, contrast ratio, inputs, size, and reputation from a few websites and going to stores to see the tv's in person.  Kept finding myself returning to the same 2 brands...samsung and LG.  The final choice was made based on my components.  I do not own a Blu-ray (yet..hahhaha) or any other high end device that require HDMI.  My components are about 5-6 yrs old and work fine, but lack HDMI inputs.  All 2010 and late 2009 LCD/LED models have HDMI only, which would mean a component upgrade also.  The B650 has the best of all worlds with HDMI and component and composite inputs for all of us who do not yet have the latest and greatest of electronics.  DVD's look awesome by the way...can't wait to get a blu-ray.  I also own a 40-inch samsung lcd with 60hz and 1080p, and with the HD package from my satelite provider there is a distinct difference in clarity b/w them.Family and friends will be awe-inspired with the picture. The picture is literally out of the box, without adjustments.  Currently,  I am trying to persuade my dad to buy one in order to replace his 11 yr old box-monster 4:3 tv which is dying a slow death.  Extremely pleased with my purchase.  I hope to get more than 6 yrs out of this one than my lcd Hitachi.And 1 more thing...purchased the tv through amazon.com, not another on-line retailer.  I was highly skeptical of buying something so large and expensive online.  Checkout was extra secure with my credit card and shipping was well coordinated and on-time. Setup was a easy out of the box.  I looked into calibration online for this tv just for a little tweaking, but everything was a bit costly.", "Date": "April 11, 2010"}, {"Title": "Samsung Is The Way To Go!", "Author": "Metalman", "ReviewID": "R3NMI004S7NRAC", "Overall": "5.0", "Content": "I purchased this TV for $1,499 from one of the major retail electronics stores about 3 weeks ago and so far I couldn't be happier. I'm loving this TV. I have other LCD TV's in the house and the Samsung outshines them all as far as picture quality is concerned. I have it hooked up to my FIOS set top box and Blu-Ray player via HDMI and the picture is stunning! The blacks are deep and the colors are vibrant and accurate. I haven't even played with the picture controls or calibrated it yet. But so far it looks great right out of the box. One thing worth mentioning is that when you have the 120hz enabled movies tend to look like they were shot with a digital video camera. They lose their film-like look. Sort of the way a soap opera looks. But if you disable this feature then movies will look more film like. Some people like the way movies look with the 120hz enabled. I personally like the look of film so I keep it disabled. I only enable it when I'm watching a fast moving event such as a soccer game etc. Another thing I'd like to point out is that the screen on this TV is shiney. It does not have a matte finish. I personally love the way the glass screen looks. I feel it makes the picture look clearer. I have 3 other LCD TV's all with matte screens and they don't look nearly as good. The same goes for my laptops. I have a laptop with a matte display and one with a glass/shiney display and the shiney display looks so much clearer. However, with that said, I can see where some people may not like the glass finish if they have bright windows sitting directly behind the TV. My windows are on the side so I don't have that problem. Overall I couldn't be happier and am so glad I decided to go with a Samsung TV. I orignally was going to get a Vizio but after comparing the picture qaulity between the 2 TV's the Samsung was a no-brainer. I don't see how anyone couldn't be happy with this set?", "Date": "April 9, 2010"}, {"Title": "Fantastic TV", "Author": "abe", "ReviewID": "R1YBVO1MNM8M2X", "Overall": "5.0", "Content": "This tv is great. I took it out of box, put it on my tv stand, pluged everything in and it worked great. I have my digital cable dvr box and ps3 connected to it via HDMI. The HD channels look great and the watching Blue ray movies is amazing.I'm not a up on all the latest tech but I think this tv is one of the best I've seen. The picture quality is fantastic and it is very easy to set up.", "Date": "March 8, 2010"}, {"Title": "very nice picture", "Author": "V. Briggs", "ReviewID": "RV6DZ9VRIBKZ8", "Overall": "5.0", "Content": "Got this Samsung LN55B650 to replace a large DLP, very pleased with upgraded picture quality of this LCD.  Updated firmware easily, no problems to date.  Amazon delivered on time as promised.  As others have mentioned, you probably don't want to use the TV speakers though as they don't sound as good as my DLP so I picked up a soundbar system to remedy that.", "Date": "March 4, 2010"}, {"Title": "Still Happy with Choice", "Author": "Adron D. Blaylock, Jr. \"dale\"", "ReviewID": "RW8ANPOL4BZHE", "Overall": "5.0", "Content": "I spent a ridiculous amount of time looking for the perfect TV. I finally settled on the Samsung LCD 55 inch. A month later and I am still happy with my choice. The two things I was worried about was glare and motion blur. Both of which is not an issue for this TV. I don't see how the picture could get any clearer. I paid $2,000 at Sears counting taxes and delivery. Don't overthink it and don't spend a lot of time getting hung up on the specs. In summary, this is a great TV and I have no issues after a month of use.", "Date": "March 1, 2010"}, {"Title": "Fantastic TV!", "Author": "Charles D. Thompson", "ReviewID": "R33NIIADX4700B", "Overall": "5.0", "Content": "I love this TV.  The picture is bright and sharp.  The colors are vivid without looking artificial.  The flesh tones are excellent.  I researched extensively before purchasing this TV and believe I have made the best choice.I have not yet connected it to a home theater sound system, but until I do the built in sound is quite nice.", "Date": "February 15, 2010"}, {"Title": "Good Product, Good Service", "Author": "Peter Allen \"Rockcrawlin\"", "ReviewID": "R8OD9B5XQQU43", "Overall": "5.0", "Content": "Love the TV.  Love the Price.  Love the Service.  Couldn't have been a better transaction.", "Date": "February 3, 2010"}, {"Title": "a Best Buy", "Author": "T. Hiemenz \"seabreeze14\"", "ReviewID": "R3E3WK393BPK8Z", "Overall": "5.0", "Content": "I spent weeks doing 'homework' before buying this TV.  Went to multiple stores and did side by side comparisons and finally decided to get this one.  I was really nervous about buying something like this online but now I am glad that I did.  Amazon is amazing!!!  Ordered the TV on Friday and it was delivered Monday.  I never heard of the trucking company that brought it to my house but the driver insisted we open it up and turn it on and helped with everything.  The TV itself is amazing.  It provides an excellent picture right out of the box so that anyone can hook it up without professional assistance.  Everyone who has visited in the past month has reacted the same way--Best picture they have seen yet on an LCD TV!  Having the Yahoo Widgets (internet access) at your fingertips while being a couch potato is really cool.  I have decided the TV is smarter than I am!", "Date": "February 3, 2010"}, {"Title": "Brilliant Crystal Clear Picture", "Author": "Barbie Girl \"Barbie Girl\"", "ReviewID": "R3FZIHCE4734AJ", "Overall": "5.0", "Content": "We purchased this Samsung  55\" Flat screen LCD TV in December and we absolutely think it is the best purchase of the year.  The color is brilliant and the picture is crystal clear.  We would highly recommend this TV to anyone looking for a fine quality TV.  The only thing I would recommend is adding  a home theatre or Surround Sound as the sound  is just average.  We own two other flat screen TV'S,  a 32\" Magnavox LCD  and a 36\"  Sharp LCD which are about a year old, but we have found the Samsung out performs them by a long shot.", "Date": "January 30, 2010"}, {"Title": "Better than the Panasonic Plasma", "Author": "J. Winkel", "ReviewID": "R3518E08U6A4CL", "Overall": "5.0", "Content": "I recently bought this TV and a Panasonic 46G10 plasma (both from Amazon).  Both TV's have a stellar picture, however I think I like the Samsung LCD better.  That and the additional features of the Samsung over the Panasonic make the Samsung my pick for the money.  When watching HD from satellite there are sometimes some visible waves in the Panasonic (at a side angle).  I don't know if it is a less than perfect signal or what, but they don't show up on the Samsung.  Both are perfect with Blue Ray.  I had originally ordered a 54\" G10 instead of the Samsung direct from Panasonic, and due to delays I cancelled the order and bought the Samsung. The Samsung arrived 3 days later.  I have been grateful for the delay since.", "Date": "January 18, 2010"}, {"Title": "Great TV", "Author": "D. Joslyn", "ReviewID": "R2VZAUF1HVJQKA", "Overall": "5.0", "Content": "This is now the third LCD tv I have owned and by far the best.  The picture is clear and crisp and just amazes me every time I sit down to enjoy a movie.  I also like the fact that you can hook into the internet with this TV was a little disappointed that Nexflix isn't avaible but maybe that will change.  The speakers are fine but you should think of upgrading for the full effect.  This is a big TV so make sure you have the room for it and the viewing distance if you look at them in the store it seems they double in size when they are in your living room.  The only bad thing about this TV is the gloss screen will reflect the light but its not horrible and easily fixed.  Over all I would say if you have the money and the space for this TV then put it in your top three.", "Date": "January 12, 2010"}, {"Title": "Spectacular HDTV", "Author": "R. C. Thomas \"MultiWizard\"", "ReviewID": "R3HML9JSL9B6N", "Overall": "5.0", "Content": "I ordered this television back in May.  At the time, there were next-to-no reviews for this set.  Since this was my first HDTV purchase, I wanted to make sure I was making the right choice for such a big-ticket item.  Well, due to money-saving issues and pure paralysis over making a decision, it took over a year to make a choice.  I had been back and forth between LCD and plasma, different brands, and read everything I could get my hands on.When I finally decided to buy, I went to see this model in a local store. Amazing picture quality.  I compared it to the other Samsungs there, the Sonys, and Sanyos.  No contest. I ordered it from Amazon.  The delivery guys brought it as scheduled, removed it and set it up for me.Every time my girlfrind comes over and sits in front of the set, she says the same thing: \"I love your TV!\"  Her mother had just purchased a 52\" Sanyo and she said it's not even close to the picture quality of my set.As far as the set itself: I have it on top of a tv stand on the pedestal stand it came on.  There has been no tilting like some reviewers have written about.  I have no fear that the set will fall over at all.  The picture quality is great.  The screen is extremely shiny, so if you have a lot of lights/windows that will be facing the screen, you may want to go for something with a matte screen.I almost never use the sound as I have it hooked up to a surround sound system, so I can't comment on the sound.  Over the months that have passed, I have been getting used to the set and I've noticed some slight backlighting in the lower corners on a black screen or when playing a letterboxed film.  Nothing too bad; it's hardly noticeable.I have both my Cable box and my PS3 connected through HDMI to my receiver and then HDMI to the TV. One note: don't overpay for HDMI cables.  I ended up getting gold-plated 1.3 ones from a vendor on Amazon for $6.99 each and they work great.The one thing that I don't like, and this is a MINISCULE gripe: As far as I can tell, there is no way to access Game Mode without going three steps into the main menu.  There is no \"one-button-push\" to toggle it on and off.  I do find it helps with lag while playing online with the PS3 (especially Rock Band/Guitar Hero and Call of Duty) and it would be nice to not have to jump through hurtles to get to it.So, after all that, I have to say that I LOVE this set!  I'm very happy with the purchase from Amazon. I can't recommend the experience enough.", "Date": "January 4, 2010"}, {"Title": "Price and size matters", "Author": "R. Ramos \"rxrz\"", "ReviewID": "R1SSMX8K7QG05B", "Overall": "5.0", "Content": "I ordered this tv after looking at models in local retailers and found that for the price and size, Amazon's price was competitive.  I was dissapointed that this model was on sale earlier in the year for about $1500, but timing is everything.  With their special financing, free blu-ray, and free delivery, I was hard pressed not make the purchase.  I scheduled my delivery between 10:00 am and 1:pm on 12/28/2009, and the delivery was made by 12:30 pm without any problems.I would not consider myself a video/audio specialist, so in layman's term, the picture quality is crisp and clear.  The set up was fairly quick and easy.  I made the HDMI connections for my HD FIOS receiver and PS3 and was impressed with the clarity.  Coming from a an RCA 1080i DLP, one could see a big difference.  As I played Termiator Salvation on my PS3, the character detail and movement was impressive.I did consider the 52\" version LN52B630 for around $1289 around Christmas, but Amazon was out stock and I did want to take advantage of the special financing.  When I compared the specification between the LN55B650 and LN52B630, most fo features were similar except for the speakers and media peripherals.  I would recommend that you take sometime and go to a local retailer to see the picture quality.  I did learn that what you see is not always what you get since picture settings on models can vary and the lighting in your home can impact the overall picture quality you will experience.If you want to save some money and Amazon has it in stock, the 52\" model is a good buy.  I am very happy with the 55\" model and now need to take the time to read the manual and get the best settings for picture quality in my entertainment area.  One draw back is that will the tv offers internet connectivity, in order to do this wireless, you need to buy a Samsung Link Stick which is another $75.Overall, great picture, good features, and competitive pricing.", "Date": "December 30, 2009"}, {"Title": "WOW", "Author": "Thomas D. Connolly", "ReviewID": "RQXPDFT5VBI6L", "Overall": "5.0", "Content": "NOTHING LEFT TO SAY after seeing the perfomance of this televion except WOW!7*.It is crystal clear ,LIKE looking through a window glass.", "Date": "December 1, 2009"}, {"Title": "Great TV!", "Author": "Donald P. Siegrist", "ReviewID": "R1GNG3TQJC3I39", "Overall": "5.0", "Content": "After having this TV for a couple of months we are loving it!  We have had good experience with other Samsung sets which is one of the reasons we went with this one and it has not disappointed.  Picture is great, extremely light for a 55\" TV and it was our first 1080i TV.  I have not played any true 1080i source through it yet but we have been very happy so far.  I would recommend this set.", "Date": "November 7, 2009"}, {"Title": "Great HDTV", "Author": "T. Prince \"Bamaking\"", "ReviewID": "R1SRI8NQ9117K8", "Overall": "5.0", "Content": "Great HDTV, picture is fantastic.  Don't know about audio as I have it hooked up to a home theater.  I have it hanging on a wall so it takes up no space at all.  Easy to set up, only needed my neighbor to help me lift in on the wall.  What can I say, I'm getting older.  Great for watching football or blu ray.  Recommended.", "Date": "October 11, 2009"}, {"Title": "Amazing Picture!", "Author": "L. Joyce", "ReviewID": "RMEUWNWJYZHZP", "Overall": "5.0", "Content": "We love our new HDTV. The picture is sharp and vibrant. The onscreen menu options are easy to use.", "Date": "October 1, 2009"}, {"Title": "Samsung knows TVs  -  This is a Beauty", "Author": "Mark Wilkinson \"SparqMark\"", "ReviewID": "R3B4XE2JUEM20P", "Overall": "5.0", "Content": "I have had this TV for around 2 Months now and I must say that I am impressed with the overall styling, picture, and feature set.  I was looking at the 240hz models and in the 52\" models but decided on this one because it was under 2K and was 55\".  I also spoke with friends that have the 240hz TVs and they say that the effect is probably too much on anything except sports.  The picture through HDMI on this TV is not short of phenominal!  The colors are rich and vibrant and it is tack sharp.  You will need to turn the backlight down to around 7.  I was concerned about glare because I have huge picture windows opposite my TV.  The glare from the windows is very little.  This may be helped by the way I mounted it and turned it down (angle) to help with glare.  The glare is about 20% of about what my projection TV was!  If it does not bother me in my living room then it probably would not bother most.  My picture windows are about 3.5 feet by 10 feet and there are 3 in the living room and 3 in the adjoined kitchen.  To say the least I am very pleased with this purchase.  I just hope that I do not have to ever deal with Samsung support because I have had a bad experience lately trying to get my bd-p1500 blu-ray player replaced.  I upgraded the firmware and it would not play ANY blu-ray movies rented at BB.  I sent it in and they sent it back saying nothing is wrong with it.  This is lame!  Dear Samsung... you make great products.  Stand behind them so we can keep buying them!  If this TV is in your budget and you want the best bang for your buck then this is it....  Sparq", "Date": "September 15, 2009"}, {"Title": "Excellent product!", "Author": "L. Lovell \"Linda\"", "ReviewID": "R2PL8DO0TCALQL", "Overall": "5.0", "Content": "After shopping for a new TV, both online and in store, I decided on this Samsung tv to meet my needs. I had decided to purchase from a local store, but once I realized how much less expensive it was to buy from Amazon, I immediately ordered from them.  One week later I had the TV sitting in my living room, ready to hook up to my satellite system. But then I decided to wait till satellite provider could upgrade me to HDTV, which they did 3 days later. Loving this TV ever since. Exactly as described!  Reviews from other customers was so much help.", "Date": "September 11, 2009"}, {"Title": "Highly recommended", "Author": "S. Smith", "ReviewID": "R2LZIBH0XVT5AY", "Overall": "5.0", "Content": "Pros:+ Terrific picture quality (especially after I calibrated it)+ Wide range of adjustments available to fine-tune picture+ No \"judder\" when playing 24fps Blu-ray movies+ Worked perfectly out of the box+ Very good valueCons:- Doesn't have anti-glare screen-\"Auto Motion Plus\" feature just makes picture looks strange (but can be easily turned off)- Default picture settings out of the box are WAY too bright (like every new TV I've seen)- Not the most advanced TV on the market (which is probably why it works out of the box)I bought this TV to replace an old rear-projection DLP.  First I considered a plasma, but was put off by the power consumption, heat output and heavy weight.  Pioneer is also getting out of the plasma TV business entirely, which worried me since they made arguably the best plasma TV on the market (the Kuro).  Next I looked at the new LED TVs, which are super-thin and look great in the store...but I also found a lot of reports of them being kind of buggy.  So I decided to go with a high-quality 55\" LCD released this year that had 1080p and a 120Hz refresh rate.  This takes us to this TV...The bottom line is that this is a great TV.  It has much better picture quality than even the 1080p TVs made just a couple years ago.  It worked perfectly out of the box and there were no bugs, video glitches or imperfections of any kind...it simply works, and works very well.  Sound quality is on par with the built-in sound in other TVs.  Factoring in the reasonable price it's a no-brainer.  More advanced TVs exist, but cost more money, seem to have more bugs and deliver marginal improvements in picture quality  - not a reasonable trade-off in my book compared to what you get from a high quality LCD right now.Like every new TV I've seen, the out-of-box settings are way too bright.  Setting the picture mode to \"movie\" and turning down the backlight to 6 produced a great-looking picture, and calibrating it using Digital Video Essentials: HD Basics [Blu-ray] made it outright amazing.  For those who like to fine-tune the picture this TV has every control you could want, and probably several you haven't ever heard of.  The menu system is well laid out and easy to navigate.It also has a bunch of extra features that are fun to play with, but are ultimately better left turned off.  Auto Motion Plus is supposed to make fast-moving images look better, but to my eye all it did was make the picture look strange.  The Edge Enhancement and Digital NR features sharpen edges and remove video noise, respectively, but they also introduce video artifacts of their own and are probably best left off as well.  Finally, the Sharpness settings is *artificial* sharpening - it makes the picture seem more detailed, but also makes it look extremely gritty and noisy - I suggest setting it to 0.  These aren't unique problems to Samsung; similar features on other new TVs have the same problems.If I could change one thing about this TV, I would give it a more glare-resistant screen.  There is probably a trade-off between how sharp the picture is and how well it resists glare, but this thing is SHINY.  If you have a very brightly lit room it could be a problem for you.If you want very good performance for the money from a proven, trouble-free design, you can't go wrong with one of these LNxxB650 models from Samsung.  They look great, are light weight, consume little power and they just plain *work* without any fuss.", "Date": "August 25, 2009"}, {"Title": "Samsung hdtv", "Author": "P. Short", "ReviewID": "R37HQ7S3YZGF8Y", "Overall": "5.0", "Content": "Delivery,excellent. Great picture, easy set-up. Fantastic picture color and clarity. Would definately recommend this tv to anyone and also buying it from amazon at a much lower price than best buy or sears.", "Date": "August 23, 2009"}, {"Title": "Nothing better", "Author": "erlingson", "ReviewID": "R3JCBX5QTHBPU1", "Overall": "5.0", "Content": "Fantastic.After a very long time of reading revues, and after having consulted a number of people (my son beeing among them), I am proud to be able to say that I made the rigth choice. This TV has the best picture that I have seen around. So when I left Sony after 40 years of beeing a \"stone hard\" Sony - fan, I am pleased that my choise was the rigth one. The sound is marginal, but I'm sending it out on my separate sound system, so everything is cool. Maybe put some more work into the manual. Make it easier to read for us \"baby-boomers\" that have started to loose some eyesigth. Amazone was great, and everything came within promised timeframe. Thanks!", "Date": "August 17, 2009"}, {"Title": "Best TV Yet", "Author": "CaptainComet \"delder19\"", "ReviewID": "R1C9FPMTO12WBG", "Overall": "5.0", "Content": "This has got a great picture. Both the 1080p Blue Rays played from a PS3 and the cable HD (still 1080i) look good. Setup was pretty easy. Only thing that took any time was the optional Internet connection. Only thing I don't like is that if the unit is powered off, there is a red indicator, but if the unit is powered on there is no indicator.", "Date": "May 19, 2009"}, {"Title": "This TV not as great as reviews would have you believe", "Author": "Kenneth W. Harbin", "ReviewID": "R3I0V1DVEXA6QD", "Overall": "2.0", "Content": "We purchased the first LN55B650 on 7/3/2009 and it was delivered a few days later. It had a great picture but we noticed two thing right away, the TV was not level and that glare was bad.  You can see every light source on the screen even a table lamp or indirect light from a window. I originally thought this was normal so I just thought we would have to deal with it.The TV was preassembled with the pedestal and was set on our built in entertainment center.  The set leaned drastically to the left and forward and continued to get worse so we called for service.  By the time they were out in late July in was leaning an inch to the left and a half inch forward.  The pedestal is actually installed on this set from the factory and there is no adjustment.  The replacement set arrived on 8/4/2009 and it was level to start with but over just a 2 week period it was as bad as the first.  After going through 2 of these with the exact same issue we decided to look for a different TV.  We thought about the LED version but if Samsung can't design a simple pedestal that works, what else have they missed? This is certainly a design flaw, the second set was over 1 1/4\" out of level from the top to bottom and an inch forward by the time our Sony was delivered yesterday.Thank goodness for the 30 day return policy where the set was purchased.  We upgraded to the Sony KDL-55V5100. What sold us on the Sony was when we were talking with the salesman about the glare on the Samsung and the he actually turned off several of the TVs  for comparision.  The glare on the other brands was terrible compared to the Sony even with the sets off. That along with Sony's picture quality and reputation made the choice very easy.  After getting it home yesterday we are glad the Samsung didn't workout, the picture quality of the Sony is drastically better especially considering the glare we experienced with the Samsung. The Sony has no visible glare from the windows or lamps and that alone is a great improvement and the unit sets straight and level.Not sure how the review on this and other Samsung products are so good, if you could experience both the Samsung and Sony in your home as we have now the choice would be easy. The base is also very substantial on the Sony and looks very nice in our entertainment center.If you decide to go with the Samsung it will come with a couple of scews and a nylon string. The instructions say this is a safety measure to keep the TV from tipping over on a child. The real use of the string is to overcome the design flaw and hold the TV to keep it from tipping if you use the included pedestal, I would put it on immediately!This model has a lot of cool features, if you can deal with a tilted screen or plan to mount it on the wall and don't mind the glare issues this may be the set for you.  I have pictures of this unit posted on some other reviews but do not see an option for pictures on Amazon. They are posted on Bestbuy if you want to take a look to see what I mean by TV leans.", "Date": "August 31, 2009"}, {"Title": "WOW what a picture", "Author": "S. H. Wood \"Draven_Wraith\"", "ReviewID": "R8MBYM3SR8AYO", "Overall": "5.0", "Content": "I looked and looked for just the right LCD tv for the right price, didn't care if it was sony, RCA, samsung, but when i watched my sisters samsung LN55B650 I fell in love, the picture was so clear and crisp, and what got me was it wasn't a HD DVD or Blu-Ray it was just a plain ole DVD. So I started shopping, at first I was looking at no more the (...) bucks and around a 52\", I was just about ready to get the LN52B650 at sears for (...), and after taxes I was up to (...). I went on amazon looking for an old movie DVD when I notice a samsung LN55B650 for (...), to make a long story short I spent (...) on this bad boy and man I am going over my DVD movies again. This TV is great and it's even better because of the price, Sears is pricing this puppy for (...).", "Date": "February 16, 2010"}, {"Title": "Great picture but auto motion plus is useless", "Author": "Michael J. Hathaway", "ReviewID": "R3STCBV35VMSO7", "Overall": "2.0", "Content": "This LCD Tv has a stunning good picture quality, but as soon as there is any fast motion, there is still a great deal of jutter or blurring of the image.  I returned it for this reason.", "Date": "October 15, 2009"}, {"Title": "EXCELLENT 55 INCH LCD TV", "Author": "Norm \"battery buyer\"", "ReviewID": "R26QVYST10JYES", "Overall": "5.0", "Content": "EXCELLENT TV, ARRIVED IN 3 DAY'S EASY TO SET UP AND PICTURE IS BEAUTIFUL LIKE BEING AT THE MOVIES.NORMAN LAFAYETT,LA", "Date": "July 6, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "55-inch LCD HDTV with full HD 1080p resolution for the sharpest picture possible and red Touch of Color design\nSide-mounted USB port for displaying JPEG/MPEG files and listening to MP3 audio\nInputs: 4 HDMI-CEC, 2 component, 2 composite, 1 PC, 2 USB, 1 Ethernet, 1 optical digital audio output\nIncludes removable stand; measures 51.6 x 35.2 x 12.1 inches with stand; 15-watt x 2 bottom mounted speakers with subwoofer\nSRS TruSurround HD", "Name": "Samsung LN55B650 55-Inch 1080p 120 Hz LCD HDTV with Red Touch of Color (2009 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/314sP1pGZzL._SX300_.jpg", "ProductID": "B001WHICF0"}}