{"Reviews": [{"Title": "Sony KDL-70XBR7", "Author": "J. Pna \"jp\"", "ReviewID": "R3P4JYLN3128V6", "Overall": "4.0", "Content": "This is an actual review of this TV. Not sarcasm. I bought tv about a 1 1/2 ago for about $6,ooo from amazon. Shipping was quick and hassle free. If I would have had problems with set, which I didn't, amazon would have picked it up with no problems, as they did with other sets prior to finding this tv.I am impressed with television, it has a great picture and very sharp. Colors are right on and can be tweaked very easily if the need arose. Sound is poor but not a concern when hooked up to a decent surround sound system. Sony also has provided a premium in home service contract if needed. Overall I am happy with set. Of course as with all technology it will become out dated soon.", "Date": "March 21, 2013"}, {"Title": "Big TV at its best", "Author": "Perry E. Camp \"PC\"", "ReviewID": "R2E4D13FPSY9D4", "Overall": "5.0", "Content": "true 1080p video with bells and whistles to make it usable. The sound is good (I never use it because it is part of the theater experience) the video and adjustment features terrific.  I haven't found a problem with it yet.", "Date": "April 21, 2009"}, {"Title": "There are so many arguements AGAINST this TV.", "Author": "M. Gariti", "ReviewID": "R3JF9AV840RAU6", "Overall": "1.0", "Content": "First off, if you're just looking for a beautiful 70\" 1080p TV, you can go with virtually any other brand, get full 480Hz 3D, and only spend $2500-$4500. Did I mention that this TV doesn't even have LED backlighting? All of those cheaper sets will, which provides a clearer picture and a 5-10x longer lifetime. Oh, and this one's not 3D, either.  Secondly, if you ARE anxious to spend in the area of $20,000 to $30,000 for a TV, just wait 2 months for 4160p (4k) TVs to come out. 4k TVs are up to stadium sized (like a Jumbo-tron, up to 420\"; but also room-size, 34\"+) The picture is marvelous, and they provide 3D without 3D-glasses. (Once again, no 3D at all on this one).", "Date": "January 21, 2013"}, {"Title": "First one didn't work", "Author": "Roubaix Rider", "ReviewID": "R283ASOBQ1GXIQ", "Overall": "3.0", "Content": "Ordered this puppy for my wall.  Delivered and wrapped in about 100 yards of cardboard and weight a ton.  First attempt to mount it resulted in structural damage to my wall.  Had to reenforce my foundation and add in some joists to support the TV.  After construction completed, my family sat down to an impressive view of yards and yards of a blank screen.  All we saw was a billion black pixels.  \"Ship it back and will send another\" Big A said.  Easier said than done, I had to scourge around in a dozen dumpsters to get enough cardboard to make a box big enough (I foolishly turned the original box into a kids playhouse/tank) and used 10 rolls of duct tape to package this monstrosity.  Next hurdle was trying to pack this roughly 10 foot by 5 foot box into my Kia Rio sports car.  Finally had to just duct tape it to the roof.  We looked like a Schweizer 1-26 as we headed off to the UPS drop off station.  I could tell that the UPS people were impressed with my box making skills.  Now anxiously awaiting the second unit to arrive, and shipping was only half price!  Life is good.", "Date": "January 18, 2013"}, {"Title": "Great TV", "Author": "Manuel E. Martinez", "ReviewID": "R1AG0JQ2CU3ZR3", "Overall": "5.0", "Content": "I bought this TV several months before I had my house forclosed.  The image is excellent.  The dimension is fantastic.  The weight of this TV is amaizing considering it is of a jumbo size.  The only drawback (temporary) is that because its size, its hard to fit in my mobile home.  I recomend this TV.", "Date": "December 14, 2011"}, {"Title": "Shipping way too expensive, cleaning accessories are a rip off!", "Author": "tybrenis", "ReviewID": "R2M0WBBRTZJFW5", "Overall": "3.0", "Content": "Hi,I recently purchased a few of these televisions - one for my yacht, one for my limo, and a few for my workout room. The television itself is decent but I was really let down to find that after paying over $100,000 for my five televisions, I still had to pay shipping! What a rip-off! $9.99 for supersaver? What kind of bs is that? Also, the screen cleaning cloth that is sold sperately is $3.99. Imagine that times five for all five of my televisions. After liquidating my son's college fund, I have decided that I will have to just suffer and clean the television using windex and bleach, rather than spending the $4 on cleaning accessories. Overall, not very satisfied.", "Date": "November 21, 2011"}, {"Title": "When I Do.", "Author": "The Most Interesting Man In The World", "ReviewID": "R3UEC4BRFMH8Z", "Overall": "2.0", "Content": "I don't always watch television... But when I do, It's on a TWENTY-TWO THOUSAND DOLLAR FLAT SCREEN! Seriously though that's a lot of pretty penny's. At that price it better shoot out holograms and fully service you.P.S. Only 1 left in stock, somebody better jump on this.", "Date": "October 24, 2011"}, {"Title": "Not sure...", "Author": "Smissingers", "ReviewID": "R3LP5Y9OK7NFCT", "Overall": "3.0", "Content": "Not sure if I actually want to spend $22,000 for this TV, or just want to spend $22,000 on a TV.", "Date": "August 17, 2012"}, {"Title": "Not Impressed", "Author": "Pogi", "ReviewID": "R23JP2N8M4980Y", "Overall": "2.0", "Content": "I bought 5 of this at my mansion, its very attractive to look at but my maid stole 1 of them.", "Date": "September 27, 2011"}, {"Title": "Eh..", "Author": "Elisaul Cordova", "ReviewID": "RH5BRU1AXO9HO", "Overall": "3.0", "Content": "bought 3 of these so i can watch the tv while i am in the restroom, resolution is ok, i have seen better 1090pI is the new deal.", "Date": "April 13, 2011"}], "ProductInfo": {"Price": "$21,999.99", "Features": "16:9 Full HD 1080p Resolution Panel (1920x1080)\nMotionflow 120Hz technology delivers natural motion\nBRAVIA Engine 2 PRO fully digital video processor\nAdvanced Contrast Enhancer circuit (ACE)\nDMex capable", "Name": "Sony Bravia XBR KDL-70XBR7 70-Inch 1080p 120Hz LCD HDTV (2008 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41gabZd-0HL._SX300_.jpg", "ProductID": "B001GIPMNK"}}