{"Reviews": [{"Title": "Very Happy With this TV", "Author": "Petros", "ReviewID": "R2K8LBGLH9EM3", "Overall": "5.0", "Content": "We could not be any happier with our purchase of this Plasma.This TV was my family's first venture into the world of HD. We considered many factors, such as screen size, price, on-going maintenance expenses, and getting something that we would be happy with for a good number of years. We were first drawn to Projections, because of the huge screens available for reasonable prices, but were turned off by the good possibility of having to purchase a new expensive bulb every year of so. LCD's were nice, but their price in larger screens was significantly higher than Plasmas, and they have the problem with the viewing angle. In the end, we decided to go with a Plasma no smaller that 50 inches, because we didn't want to feel as if we needed a \"bigger\" TV a few years down the road.Before purchasing the LG 720p, we tried the same resolution in the Insignia 50 Inch Plasma. That was in our house for one day when we decided to return it to get something of better quality, which turned out to be this LG. The price of the LG was only a little more than the Insignia, but the quality was so much better.The picture is phenomenal. I cannot tell any difference between the picture on this compared to Plasmas that cost 4-5 times as much. Even non-HD channels look great on this.The appearance is very nice as well. The color of the case is \"piano black\" which looks really slick.We bought the Init Wall Mount for this TV, and it works great. It was simple and fast to install.The only possible negative with the LG was the sound. This was the one area where we actually liked the Insignia better. On some stations, we have to crank the sound up to 60 or beyond. With our Wii, it only needs to be in the teens. So the issue is probably more with my Cable Provider and/or Cable Box. But as I indicated, we did notice better sound with the Insignia.There was an issue when we first got the TV out of the box and hooked it up. There was a white vertical line on the far right-hand side of the TV that ran the entire height. You could see some blurry images through the white, so I knew it wasn't just a aspect ratio setting. This line started going away the second day of viewing, and by the third day it was gone completely and have had no problems with it since (we have now owned this for about a month). Maybe it just needed to get \"broken in\"???We also purchased a 4-Year Extended Warranty from the store we got this from, mostly for peace of mind on this investment. Their Extended Warranty does cover burn-in, so that is a good thing to know just in case one of the kids leaves it on. But hopefully we will never have to use it.Overall, we are thrilled with this TV, and we wholeheartedly recommend it.", "Date": "June 29, 2008"}, {"Title": "BEWARE!!!!", "Author": "A. Wright \"AW\"", "ReviewID": "R22PLP9XU0NPZF", "Overall": "1.0", "Content": "Purchased this TV back in 2008, a few weeks ago I lost my picture and sound (only loud buzzing noise), only to realize that my internal screen had multiple hair-line cracks. Did not use this as my primary tv because it was in my basement, so it was never used daily and was very well kept. Unsure what the cause was for the cracks within the screen, as there was never any physical damage done to it at all. Called LG to \"no avail\" since the manufacturer warranty expired. Appears to be a common problem that should be addressed by LG, but will likely continue to be ignored by LG. I would stay clear of this model, whether it be new or used!!!", "Date": "July 8, 2011"}, {"Title": "Fantastic Picture Quality - most screen for the money", "Author": "Daniel F.", "ReviewID": "R6YXPKW4JSFHZ", "Overall": "4.0", "Content": "We bought this TV a couple months ago at Best Buy. This is a great TV for the money. It's big of course, and it has a bright sharp image. The resolution is fantastic. (When watching nature shows you can see an individual hair on a lion's ear...awesome).  My house is now the place for the kids to come to to watch movies. We will probably host our first real Superbowl party around this machine too.  It has inputs for just about everything, and my next test will be to run an s-video cable to it from the laptop.I gave it only four stars because I'm not 100% satisfied with the audio. It's good, but I think it could be sharper and deeper. Comcast HD has a music channel (Palladia) and the sound from the TV doesn't do concerts in HD justice. I have to crank it way up to get heavy sound when watching action movies.Bottom line: Excellent image and features. If you are planning to combine this with a home theater audio set up, you won't go wrong.  If you expect home theater quality audio off this set, you will be disappointed.", "Date": "December 28, 2008"}, {"Title": "Broke after 2 years", "Author": "John", "ReviewID": "R2HQSWRZU3AM5S", "Overall": "1.0", "Content": "I have the same problem as the other 1 star review. No picture, only sound. Even the sound is distorted and lots of hissing/buzzing noises. It looks like there's a crack inside the panel but there has never been any physical damage to it.", "Date": "April 26, 2011"}, {"Title": "TV works just fine", "Author": "Jesus \"Vegetable Spit\"", "ReviewID": "R1BJP3SOVFC3YJ", "Overall": "4.0", "Content": "We have had this for over a year now. It's working like a champ! Hooked up external speakers for dirt cheap and now dont need to go to the movies. Got it all at the palm of our hands. Great picture and what else can you say about a TV. It just works MAN! Go get one and make those electronic places bargain for your business always. We did! Got the TV for under $900 @ Howards.", "Date": "January 15, 2010"}, {"Title": "Buyer beware", "Author": "Leslie Carl", "ReviewID": "RS6AAMPHAV435", "Overall": "1.0", "Content": "Product is a year old and picture has gone out - - sound, but no picture. Wall mounted, no other means of damage. Just shoddy electronics.  LG tells us they can't do anything about it.  This is the last LG product I'll buy. Buyer beware - pick a different brand!", "Date": "February 28, 2011"}, {"Title": "Amazing Picture! Amazing Gaming Display!", "Author": "Timothy Bell", "ReviewID": "R1LZX02LTBY30E", "Overall": "5.0", "Content": "Purchased this TV from Best Buy for under $1000. Already owned a 42\" Westinghouse LCD, Upgraded to this machine! They said it was a 720p screen, but when I hooked it to my PS3, it displayed in 1080p without issues. Burn-In has not been an issue.By Far the Best Plasma for the price on the Market! Go get yours...", "Date": "January 30, 2009"}, {"Title": "u get more than 1080 i", "Author": "Bulent Kucukozcan", "ReviewID": "R13LVS87OB26HF", "Overall": "5.0", "Content": "this TV is the bomb ,  regular cable channels look great on it and of coursehd . but the hidden gem is , it displays more than 720 p. that's right 1080p not i , but p .i tested it with the ps3 first , i didn't believe it first , than i tried the xbox360 and i got the same thing . i made sure its the same model . read it on the back of the TV and the box . it says 720p .But it does full 1080p . i originally got this TV in the store , as advertised it is 720p.but look to my surprise .i wanted to compare price to amazon .i over payed 300 dollars ,which is OK . i am happy . so folks get it from here , u wont be sorry .u get more than it says . just wanted to share thisit's been more than 3 years i own this , work flawlessly", "Date": "September 29, 2008"}, {"Title": "Bad product and cust service", "Author": "T. Robbins", "ReviewID": "RK4OMFY82EA2F", "Overall": "1.0", "Content": "Called LG electronics after a plasma 50PG20 4 months old color green is ghosting on the screen.  After spending time with cust service giving ser# mod# faxing receipt Getting a RO number and calling the service co they had no records called back LG and they had no RO # But they had my phone and name??? placed on hold for 20 min twice!!! still can not resolve the issue I was told LG had bad cust service after I purchased their product never again will I buy a LG productDo not Buy this TV", "Date": "May 11, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0016P2NIA"}}