{"Reviews": [{"Title": "Perfect size for a home office", "Author": "A. Boston", "ReviewID": "R3GOTAAWPLQYQK", "Overall": "5.0", "Content": "I work out of my home office, and I'm a self professed tv addict. I'd never had one in my office before, but figured out just the perfect spot to wall mount it, and next thing you know, I had this Dynex in my hand. I'm not a supremely picky person, but I've never had a more affordable brand tv(insignia, dynex, etc)because in that respect I stayed snobby. My living room tv is an LG. But for the price of this, I was willing to waver on brand loyalty, yetI wanted to do my homework before just randomly buying any old thing. I went to a big box store to look before making a decision, and for the price thought this was a great buy. I also considered just buying a widescreen 'computer monitor', but figured at least with this, if I ever want to use it elsewhere and hook it up to a real cable box, this was perfect.I mostly use it with a PC, hooking it up with a VGA cable. I've been streaming my comcast cable tv shows, and watching dvds played off the PC. I'm really happy with how easy it was to put up, the picture quality and sound. Not one thing I can find that I don't like. I found a great cheap wall mount at ikea, and this was up within an hour. I was a little nervous being I'd never wall mounted a flat screen before, but after a few weeks I realized 8 pounds of tv is not that big a deal, and I've become quite comfortable with it.", "Date": "June 24, 2010"}, {"Title": "Good for its price.", "Author": "Yeshua Clark", "ReviewID": "R2IABYXDPK0L88", "Overall": "4.0", "Content": "Pro's: Light weighted. It is good for video games, especially if you want to plug up your console by HDMI or Component. You will get a full 720p. It feels almost portable because of its light weight. I believe it is portable enough to fit in a computer bag and a suit case bag. Bookbags, maybe.Con's: Compare to a regular base television that shows Composite quality. The words aren't as readable or clear. If you are going to use this HDTV for Composite. Just forget about it. It is pixelated. If you are connecting a PC/CPU to the HDTV. It doesn't support as many resolution, just 1024x768 in 60hertz of course.", "Date": "May 26, 2010"}, {"Title": "Nice ...", "Author": "William Kren", "ReviewID": "R7KUFNVYUAZWJ", "Overall": "4.0", "Content": "This little flat screen is everything I expected.  I'm using it in my office - it's doubling as a computer monitor.  I'm very pleased.", "Date": "February 28, 2012"}, {"Title": "GREAT VALUE, GREAT PICTURE", "Author": "HOWARD G BIERBAUM", "ReviewID": "R3JG4F7B2I7UUT", "Overall": "4.0", "Content": "This is a great no frills, easy to use TV. It's Best Buy's house brand, which means it's made in China and it's cheap. However, when compared side by side with a Samsung 19\" LCD TV, the picture was every bit as good and it was $80 cheaper ($99 on sale at Best Buy v $179). There's even an equalizer built in so you can tweak the sound.Will it last? According to the BB salesman, he sees very few Dynex returns and he told me it's a fine entry level TV for the money. It comes with a one year warranty but I purchased it on my credit card, which automatically doubles the warranty to two years, so I'm not too worried.", "Date": "January 22, 2012"}, {"Title": "great so far", "Author": "randall hockenbroch", "ReviewID": "R2KTPK7M4VELVP", "Overall": "5.0", "Content": "I just bought the dx19e220a12 and so far it is great,the tuner picks up all the local stations available and perfect,I would recomend this to anyone.", "Date": "January 19, 2012"}, {"Title": "Good monitor, good price, disappointed by latency", "Author": "Christian", "ReviewID": "ROVEB2YA3MCX9", "Overall": "3.0", "Content": "Picked this up for $80 at Best Buy a year ago. 1024x786 just fine, but the problem is that signals have about a 100ms latency on at least the VGA and RCA adapter. This makes it very difficult to play video games of any genre but \"puzzle\".", "Date": "August 2, 2011"}, {"Title": "No Inputs Work Correctly", "Author": "Steve C", "ReviewID": "R3CBTL3WZHOJGW", "Overall": "4.0", "Content": "This unit has a good display and a sensitive tuner but none of the external inputs work correctly. When I connect my HD DirecTV receiver to the TV it won't work with either the VGA or HDMI inputs which both say \"Out of Range\" no matter if I try 480P, 720P or 1080i. The Component input works but the picture size is not correct, it's compressed vertically and I have to set the TV to Zoom to fill the screen! It does work OK with a Roku box using HDMI though. It seems that set top box makers need to standardize HDMI and component outputs.", "Date": "July 28, 2011"}, {"Title": "Decent quality; generic brand", "Author": "pennywyze", "ReviewID": "R2VQJHU5GWKUFE", "Overall": "4.0", "Content": "I recently purchased the Dynex 19\" LCDTV, and while I can say that I got it for such a good price (57 dollars total), there are a few gripes worth noting. First, the good.The Good.1. I really liked the sound. I found that the sound on this TV is superior to alot of high end brands, and audio can be tweaked giving you the options of frequencies, bass, treble, balance, preset or customizable sound altogether that will be saved to \"memory\". The sound is really good.2. I also liked the size of this 19\" inch which looks more along the lines of 21\". Unlike most TV's that are measured diagonally including the borders, this TV size is accurate.3. It's lightweight. It's also quite thin, though a little on the bulkier side when compared to high end models that are constantly trimming down.4. The color is fantastic. Also, the picture customization is some of the best I've seen. There's even dynamic contrast amongst a slew of other options such as contrast, brightness, sharpness, film mode etc.5. It's a 720p television that also supports 1080i (NOT upscaling in game mode)With that said, here are my gripes...1. The remote is not responsive. It's very laggy. You may want to use a regular universal remote; and it does support it.2. Although the sound is great, I heard a low, buzzing noise that's not noticeable unless you're very close to it.3. This TV does not pick up digital or local channels by antennae. Instead, it will tell you that your signal is too low. Perhaps this is an issue with my particular purchase, but I'm also thinking that these TV's lack a quality tuner altogether. I got constant freezing problems when trying to set up autoprogramming and it is an absolute nightmare. The TV will constantly freeze or shut off and back on again. This doesn't happen when connected to a device such as DTV, cable, set top box etc.4. This is not a good brand television for video gaming. I hooked up my Xbox 360, and every game appeared very blocky, non-hd or low res and washed out. It was comparable to using a standard VGA cable on a 360 and I was using HDMI. I also tested PS3, PS2, Gamecube, Xbox (which was a little better than the others to be honest) using component video cables (red, blue, green...stay away from composite which is yellow, red and white)...and again, games looked bad. A regular SDTV is better than this for gaming. I was really disappointed.5. If you're planning on using devices like Roku to watch Netflix MAKE SURE you have HDMI cables and nothing less. Composite (which is already crappy, but looks fine on my portable DVD player when streamed) looks the absolute worst on this TV. Washed out, color bleeding, low res (comparable to a 240p or 360p youtube video) and a little too digital. In fact, it's comparable to the old Laser disc or VCD quality. It's that bad. Use HDMI. It will clean the picture considerably and produce acceptable results.Overall, if you're looking for an extra TV and a decent sized LCD for a ridiculously low price; I'd recommend this. However, if you're picky about picture quality, local channels and video gaming; I'd say otherwise.As of right now, this TV makes a great TV for my daughter to watch Sesame Street on Roku or cartoons via through HDMI cable. It does provide good sound and a good enough image that you're going to constantly tweak, but with the digital tuner being an issue, resolution and picture tweaking; this TV can be more bothersome than a welcome addition.Also, there are much better generic TV brands on the market that have better picture quality such as Craig, which is unheard of but an outstanding generic brand.", "Date": "September 11, 2012"}, {"Title": "Dynex DX TV.", "Author": "Donald Haglin", "ReviewID": "R3ACT01KHFFWEN", "Overall": "4.0", "Content": "It seems to work well, we have only had it a short time.  The screen has a scratch on it but otherwise seems to work OK.", "Date": "January 20, 2014"}, {"Title": "Moving on up", "Author": "Denika Watson \"Denika Watson\"", "ReviewID": "R3EL9L5930UC9B", "Overall": "5.0", "Content": "Great starter tv for my daughter, great transition from the old tube tv to something more modern looks great in my kitchen since she got a bigger model", "Date": "November 18, 2013"}, {"Title": "i love it", "Author": "casey", "ReviewID": "R18Q4GCCBXN9SQ", "Overall": "5.0", "Content": "great great picture i put this in my kids room and hung it on the wall the picture on this tv is even better than my 42inch sanyo tv in my room great buy", "Date": "February 22, 2013"}, {"Title": "Small but cool!", "Author": "D. Samuel", "ReviewID": "R2U1JGSD6W6D9J", "Overall": "4.0", "Content": "Most of you guys are probably like this is only a 19 inch its way too small! Well mine came it in about 2 days after the shipping process was finished, got it on my table, and I realized: \"Man this IS small!\" But I turned it on turned off sound sound (because it sounded like it was coming from another room) turned my xbox on 720p and wow! 720p on the tv is worth the 19 inch! And it can even go up to 1080p! Believe it or not I got it for only $100! This tv is worth the money! I got tv because I got the AVermedia game capture hd which needs a hd tv to play/record off of. I give 4 stars because the tv lighting is only a couple years, but thats not anything to worry about!", "Date": "October 1, 2012"}, {"Title": "Almost there...", "Author": "Mcbaine", "ReviewID": "R1IQ04WOI6TKE6", "Overall": "3.0", "Content": "Allis well if u need a monitor but doesn't really tune to digital channels at all but maybe with a converter or a amplifie, to boost the reception or antenna  would be an even better buy.", "Date": "April 27, 2012"}, {"Title": "tv suck", "Author": "chris", "ReviewID": "R2LWMHDR9FS3L", "Overall": "1.0", "Content": "don' t work . can' t see picture or get sound . i can' t get any light from it", "Date": "March 3, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "1366 x 768 resolution supports 720p signals\nTwo 2W speakers with simulated surround sound\nInputs include 1 composite, 1 component video, 1 HDMI, 1 PC, 1 PC audio, and 1 RF\nUltraslim (2.5\") design, VESA compatible, for wall mounting (mounting kit, sold separately)\nContrast ratio (1000:1) and 210 cd/m² brightness", "Name": "Dynex DX-19L200A12 19\"  720p 60Hz LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41KMvbi6%2BaL._SX300_.jpg", "ProductID": "B001ANZPFQ"}}