{"Reviews": [{"Title": "Excellent image for it's price", "Author": "Gabriel Baptiste \"gabeb2000\"", "ReviewID": "RMM0LP2KA69DT", "Overall": "4.0", "Content": "After owning this set for over a month, and spending a lot of time researching the best bang for the buck in the 50 inch and larger category, here are my impressions:The only real compromise you will make in purchasing this TV versus the more expensive models is the contrast ratio, it just doesn't get as truly black as other far more expensive models.  There are a few occasions when you will notice this: on letterboxed super wide screen Bluray content, and on some graphics on broadcasts and playing some parts of video games.  But that's it...the dynamic contrast of this 52\" Philips/Funai is certainly adequate for 98.3% of all other content.Also note that the picture right out of the box is in no way representative of what this set can achieve.  Out of the box settings are way too bright, the color is hyped, and the resolution was set to a mode that created scaling artifacts on a 1080i input.  As soon as these were adjusted to more realistic levels, and the picture set to \"unscaled\", the screen quality came to life.There are many controls for how the image is displayed, play with them to get close to what pleases your eye, and then write them down when you are happy.  From there you can tweak up and down to achieve close to perfection.I like my picture somewhat on the dark side (akin to the movie theatre experience) which also lowers power consumption.  Here are some settings you can use as a starting point (Firmware version 13).  Try these before calling in the expensive home theatre guy to calibrate your set:Contrast 38Brightness 67Color 33Tint 0Sharpness 3Temperature - WarmDynamic Contrast - OnDigital Natural Motion - OnNoise reduction - OffMPEG noise reduction  - OnColor enhancement - OnPicture Format - UnscaledVertical and Horizontal - Adjust to fit your source material so that the image fits perfectly into the screen.Something no one has mentioned here is the ability to display your digital photos from a USB flash drive...the quality is phenomenal, the ultimate slide show!!  You can also play music files from a flash drive.Also, please note that this set has upgradable firmware.  There is information on the Philips site for the latest version (correcting many of the issues that have been brought up in previous reviews) and the instructions for upgrading the firmware are in the manual.  The set I purchased was already up to date as it was unboxed.", "Date": "February 15, 2010"}, {"Title": "Amazing HDTV for the price.", "Author": "Mir T. Ali", "ReviewID": "R233FLHEERK9Y", "Overall": "5.0", "Content": "I was able to find this HDTV, under a 1000 buck, and for the price this is truly a bang for your buck. It have 4 HDMI slots which is quite adequate, plus it got the standard audio and video slots. The Picture quality is quite amazing. The 120 Hz of video processing gives a very sharp and clear picture, and personally, its hard to discern the difference between the 240Hz HDTVs and this one, so its a smart buy. It was quite easy to install, and make sure you got an adequate stand for this, cause the Tv is huge. The speakers are pretty good, but don't expect surround sound from it.The Remote control is alright, not really a great fan of it, but it gets the job done. Otherwise this TV is a great purchase.", "Date": "January 8, 2010"}, {"Title": "Excellent HDTV", "Author": "Tony Crosby", "ReviewID": "R3W2RVJCH74UQH", "Overall": "5.0", "Content": "We received this television for Christmas.  We haven't even purchased an upconverting DVD player yet and we are blown away by the picture quality from a component connection.  Playing Wii games and now with our newly installed HD satellite, we couldn't be more pleased with this television.  Contrast and response time seem great.", "Date": "December 30, 2009"}, {"Title": "Not a Quality Panel", "Author": "RRB", "ReviewID": "R1X5SCSCSRCZDE", "Overall": "2.0", "Content": "Purchased this from a wholesale club two weeks ago.  I was disappointed with several things.  First, standard definition programming looked noticeably worse on the Philips than it did on our other LCD TVs, including a 2 year old Sony 50\" LCD.  Additionally, High Def programming was not on par either.  Watching several football games, I noticed that the field texture was patchy and moved as the picture panned across the screen.  It's almost like when you take a youtube video and it looks good in the small window on your monitor but when you try to display it full screen it gets blurry and patchy.  Well, that's what it's like with this Philips.  I attribute this to being an inferior panel being used in the TV.Additonally, colors were way off on this machine.  While I don't have fancy software to try to calibrate the TV, I was unable to get accurate color representation on the TV.  When the wife notices and comments, you know that it has to be bad.There are very few reviews on this TV on the web, and while most have been very favorable, I cannot say the same.  I bought this at a wholesale club at a substantially less price than Amazon is selling it for, and all I can say is that I got what I paid for.  Philips is not a major player in the LCD TV business and is owned by Funai and they now have the naming rights to Philips.  These are not the same Philips TVs you may have bought even several years ago.  Ultimately, we returned the TV and purchased a different brand and are much happier with the picture.  I cannot recommend this TV.", "Date": "January 10, 2010"}, {"Title": "T-Con Board for Philips 52PFL5704D/F7 NEEDED!", "Author": "James W. Worley \"James Worley\"", "ReviewID": "R39R2RZYOYGHL5", "Overall": "1.0", "Content": "T-Con Board for Philips 52PFL5704D/F7 NEEDED!This TV was purchased a couple of years ago and now needs a T-Con Board.Searching for one!Does anyone have one?", "Date": "June 9, 2013"}, {"Title": "Died less than two and a half years.", "Author": "MaddMatt", "ReviewID": "R398O7XDMG1PUZ", "Overall": "1.0", "Content": "I bought this TV in December of 2009 at Sams Club for $1100, and in April of 2012 less than two and a half years after purchase, it no longer will display a picture. Several times I have unplugged and waited as long as overnight, but the TV still will not display a picture, just sound. Do not buy this TV or any Philips TVs, unless you like disposable TVs.", "Date": "May 11, 2012"}, {"Title": "BROKE 4 MTHS AFTER PURCHASE/BEEN AT REPAIR SHOP OVER A MONTH!", "Author": "C. Smith", "ReviewID": "R3HH6M0WEH2RE1", "Overall": "1.0", "Content": "We bought this television after a great deal of research Superbowl weekend.  We came home the Friday night of Memorial Day weekend to find the television would no longer come on (only 4 mths after purchase).  We called Philips and they told us the name of a repair person, who was not available until after the holiday.  We called and realized the repair person was over an HOUR away and would not come.  Called Philips back, they \"escalated\" our call and told us it would be 24/48 hours before anyone could get back with us that they did not have any one closer.  Two days later, a representative calls and says there is a certified Philips repair technician twenty minutes away and to call them.  We do, and after speaking with someone two different times, get an appointment to come the next morning.  They literally come in and take the television.  It is now July 10th, and I am staring at a blank wall!  The repair company does not call us, we have had to call them repeatedly, and finally had to call Philips to get them to call back. They claimed they ordered one part, and that did not work and they were ordering another part.  Then a week later we went through the same calling ordeal to find out, that new part was defective and they were ordering a new one \"that day\".  It has been another week, so we called on Wednesday, Philips said to give them until Friday and if we had not heard from them by then, to call back.  We called back yesterday and Philips said, \"They are so sorry it is taking so long.  The repair company is doing the best they can and Philips is trying to get the parts to them as quickly as possible.\"  If we do not hear anything by Tuesday or Wednesday, we are suppose to call back.  We are so frustrated and would NEVER have bought this television if we had known the problems we would not only have with it, but with simply having it repaired!  DO NOT BUY THIS TELEVISION!", "Date": "July 10, 2010"}, {"Title": "Very Nice, Really", "Author": "Wil Ogden \"Pantros\"", "ReviewID": "R2V9YG0NFKF3I0", "Overall": "5.0", "Content": "We got this at a club store for under $1k.Also got a blu-ray player and the latest Star Trek Blu-ray.It's really incredible how awesome the picture quality is on this. It takes a little getting used to the individual whiskers/pores showing on actor's faces. There is a very distinct awareness of depth. It's not 3d, but just a simple awareness of depth.I also tried my old Firefly DVDs. And again I was blown away by the detail and clarity.My last TV was a 42\" LG plasma. So it shouldn't be that much difference, but it is.Then I turned on regular programming. Pixelation all over the place...Took me until the end of the first quarter of the big game to find the OUTPUT RESOLUTION setting on the HD cable box. Once I had that set to 1080i, the quality of picture was near perfect. Cable doesn't come in 1080p around here.The blacks are as black as the TV's case. I've noticed an occasional digital blur, but for the most part the movement is not blurred at all.I'm not a sound guru, but the TV sounds good to me.", "Date": "February 8, 2010"}, {"Title": "Don't buy this, you will regret it later!!!!", "Author": "T. Oliver \"tishica14\"", "ReviewID": "R36TBH5A32WV1D", "Overall": "1.0", "Content": "I hardly ever review products but this needs to be heard. Do not buy this product. Like others who have reviewed this product, I purchased this about 2 1/2 years ago at Sam's club. Unfortunately I did not buy the extended warranty.In the beginning, the picture quality is great and the tv works great. But unexpectedly one day I get up to turn it on and nothing happens. There is no picture, no sound, nothing. I contact Phillips who referred me to a local dealer. I take it in to the dealer who called me a few days later with bad news. The tv needs a T-Con/Panel. It would be repairable if \"Phillips\" would make it available. He advised that Phillips discontinued making this available to anyone.I called Phillips and basically was told that I would have to purchase a new tv because there was nothing they would do since I am out of warranty. After speaking to her about my disappointment she referred me to their parts company \"Encompass\" who advised me that what I needed was a LCD Panel. She also advised me that this was no longer available. So basically in a nut shell, you have $1,ooo tv that is unrepairable and you are stuck like chuck….So please don't make the mistake I made, do not purchase this tv, if you do please by the extended warranty. Companies are not making tvs to last these days. That really sucks because in the end the consumer is the one who is getting screwed especially  when they decide to discontinue parts that will increase the life of the tv.", "Date": "November 29, 2013"}, {"Title": "don't buy from phillips!!!!!!", "Author": "Sandra Jones", "ReviewID": "R2F7NCVN1SYEKA", "Overall": "3.0", "Content": "This tv was perfect except for the fact that after a little over 2 weeks of owning it, we got a thick green vertical line going down the center of the screen. Phillips said it was defective!!! and they wanted to send us a REFURBISHED ONE TO REPLACE THIS ONE....and we would have to pay to ship our tv back to them...now obviously it was still in warranty, plus we bought the extended warranty. we only had it a little over 2 weeks, and they wanted to replace it with a USED tv....so we spent around 1,400 for a tv that would be replaced within 2 weeks. AND ON TOP OF THAT...the replacement tv would only have a 90 day warranty...so, that would mean that we were screwed out of our intitial 1 year warranty and the extended 2 year warranty....AND THEY WERE ALSO VERY RUDE AND NOT HELPFUL AT ALL!!!! If you own this tv already, take a good look at the manual and read through the warranty, I can guarantee you will not be happy with what is written in there. If you end up having a problem with your tv, you are basically screwed out of the money you spent for the tv!!! I WILL NEVER BUY A PHILLIPS PRODUCT AGAIN!!  After having this problem, I did some research and found many other people complaining about phillips lcd tv's...and the horrible customer service!!! So do yourself a favor and don't buy this tv unless you want to take the chance of having a problem with it, and then not having a good company to back up their products and provide good service to their customers.Luckily for us, the store that we bought it from is very understanding and willing to take it back so we can buy a different brand tv.  THANK YOU BJ'S!!!!!!", "Date": "March 30, 2010"}, {"Title": "Fifty Two Inches of crystal-clear High Definition", "Author": "A. Soler", "ReviewID": "R3C5QGQD8HMM1S", "Overall": "5.0", "Content": "I bought this LCD TV five months ago, to upgrade from a my previous Philips 42PFL5332D/37 42\" 720p LCD. I wanted to go bigger and 1080p and 120hz were too cool to resist. I was not disappointed, Watching a Blu-Ray movie is so phenomenal on this set, it feels like you are watching the studio's master copy. 120hz makes Video Games, Sports and Live broadcasts so lifelike and fluid, just dont use it for movies, it creates a \"soap opera effect\", this can be disabled by turning off the \"Digital Natural Motion\" in the OSD Menu. The chassis is handsome, with rounded edges reminds me of a giant I-phone. The clear plastic trim adds a sleek sophistication and looks nice compared to other dull square all-black sets. There are two mini-woofer drivers on the back of the TV as well as \"invisible\" tweeters, this TV is supposed to have improved audio over other HDTV's, I wouldnt know because I use a 7.1 Channel Surround system instead. 4x HDMI ports, its future-proof. Only drawback is its plain-jane remote, pick up a logitech harmony and youre all set. Let me put it to you this way.. I went to see my San Diego Chargers play the Tennessee Titans on Christmas Day, 8 rows from the field, but I actually still missed watching it on this Philips! its that good.", "Date": "March 11, 2010"}, {"Title": "Great Value", "Author": "TanMan", "ReviewID": "R1XIOEAGP383J1", "Overall": "5.0", "Content": "I also bought this at my local wholesale club (you know, the one next to the largest big box store in the world) for less than a grand. I have 3 inputs connected to it - the cable box, an upconverting DVD player, and the PS3 - all using HDMI. And there's still one free HDMI port on the side. The audio output (S/PDIF only, so I needed a coax/optical adapter) is connected to my 5.1 surround sound system.The video looks amazing. This replaced an older 50\" Toshiba LCD (1080i max, 1 DVI input, about $2,500 and it was a deal!), and the difference is astounding. It's mounted on a stand we got for it, in the middle of a custom wall unit, so it's a bit recessed.The initial setup uses a wizard to guide you through your preferred settings - you see two pictures next to each other, and pick the one that looks better to you. So you don't need any special calibration software, just follow the wizard.Using HDMI cables made a big difference. I originally connected it to the PS3 using component cables because the HDMI cables I had ordered hadn't arrived yet. When they came, I switched cables, and the difference was huge.The remote is only for the TV - it's not an all-in-one. But what would you expect? The remote is perfectly adequate for controlling the TV.The only thing I can complain about is the sound. The speakers are in the back of the TV, so the sound projects at the back wall, and as a result, it sounds muffled. I have no idea what they were thinking with this design. However, it doesn't matter if you hook this up to your surround sound system - we just always use the surround sound now.We liked this TV so much we bought a second one for the game/exercise room. That one is mounted over the fireplace and is open on the sides, and the sound on that one is fine.Great TV. Amazing value.", "Date": "February 9, 2010"}, {"Title": "Great LCD for the price! Sleek looking even when off. LOVE IT!!!", "Author": "Bree", "ReviewID": "R3B6L892890NZN", "Overall": "5.0", "Content": "My husband & I have been in the market for a larger TV for about 6 months, reading reviews, comparing picture quality, etc. This TV was displayed next to a Samsung of the same caliber; the picture quality was undoubtedly better, AND the Philips was $500 cheaper. We obviously went for the Philips and it was a breeze to set up (I did it myself). I have never been too satisfied with the sound quality of previous LCD sets, and have usually used them with home theater systems, but the sound on this TV is actually quite good! We are amazed at the picture quality & the visual preference guide when you are doing the set-up really helps to get everything just as you like it (side by side options, like at the optometrist). The 4 HDMI inputs, and countless other inputs make setting up any sound/dvd/blu-ray/gaming systems a breeze. I was also able to easily program our universal remote to control the tv (a necessity for me). We watched Lord of the Rings last night, and the visuals are stunning. I recommend this TV 110% and am actually talking my parents into replacing their 47\" with this one. Excellent purchase for the price.", "Date": "February 7, 2010"}, {"Title": "Very nice TV for the price", "Author": "P. Gabriel", "ReviewID": "R1ZFI9OS16K5U9", "Overall": "5.0", "Content": "Found this TV for under $1000. Very happy with the picture quality and amazed by the picture clarity from blu-ray.", "Date": "January 6, 2010"}, {"Title": "Don't buy Phillips 52 LCD", "Author": "H. SOULE", "ReviewID": "RKNKMIJTCSJN0", "Overall": "1.0", "Content": "Purchased Phillips 52\" LCD from SAMs in 2009.  Five years later it would turn on, it would just click.  Long story short it ended up being slave inverter board.  It worked for 5 days and same thing happened again.  Through research I have seen this many times with Phillips and not worth fixing.  It's too bad because other than that I loved this TV.", "Date": "April 7, 2014"}, {"Title": "philips 52pfl5704D/f7 jUNK.", "Author": "mavondra", "ReviewID": "R10M1I9M3RIYB", "Overall": "1.0", "Content": "I bought this tv at Sams with a 1 year warranty in 2009. 16 months latter the picture went out but had sound. I colld Sams and thay had a tecknician came and put a boad in the tv. 24 months latter same problem again, no picture just sound.I am going to get a new tv and it will not be a philips.", "Date": "December 20, 2013"}, {"Title": "Excellent HD Television", "Author": "AceOfSpAdes", "ReviewID": "R38BOIP2ZZ3D9P", "Overall": "5.0", "Content": "Purchased this HDTV for under $1K early 2010 and I of course have been doing shopping for a LCDTv for quite some time then.When I ran across this TV being displayed next to Sony,Sharp,Samsung and a few other brands I was simply amazed how the quility on the Philips not only looked as good as the Sharp but looked better than other displays there Sony included.Normally i'm a Panasonic fan but when I compared them I had to go with tyhe Philips.What you get 120hz processing,480i,480p,520p,720p,1080i & 1080p.4 HDMI connectors,1 USB for firmware upgardes and Picture & MP3 playback,2 component,2x-composite,2x-s-video Plus2 more audio options. Unfortunately no optical.Have tested Blu-ray playback with the Sony Playstation 3.And the colors are rich & deep and the resolution is very sharp. The black levels are excellent on Blu-ray play back. Alos should mention that the tv handles 24hz playback excellently just as the director intended.Standard TV depending on what service you use I have tested with Bright House and Verizon Fios cable.Bright house standard picture was acceptable but you could plainly see digitization during some shows depending on the channel you are watching.Bright house HD content was very nice at 1080i and again this depended on what HD channels you were watching.Verizon Fios cable standard is above acceptable the standard picture quality is a bit moresoft than sharp but there is no digitization that can be seen good detail and excellent motion.Verizon Fios cable HD programming: I dare say it's close to Blu-ray quality on most HD channels of course not quite as sharp or deep as a BR movie but very impressive.The sound on this TV again depends on service Brighthouse the sound is loud and acceptable through TV speakers.Fios The sound is very very low requires me to turn on home theater system to hear it properly.On a note the speakers are placed behind the casing so this also muffles the sound and they do sound decent not excellent this is where Sony's TV came ahead thier sound was more crisp and louder.From edge to edge the Tv stays bright in all corners and also stays sharp in the corners as well.I have tested PC hookup and was pleased Surfing the net at 1920x1080 was sharp and easily able to read it was as sharp as my Computer monitor.Also tested Crysis,Gears Of War and a few other games on the Tv they looked incredible on the Philips and there was almost no tearing presnt when I had Vsync off in game my PC monitor tears terribly the Philips TV surpassed my 23\" LCD monitor that I use daily on my PC.Xbox 360,Wii and of Course Playstation 3 playback same discovery it looks sharp and plays well.The Playstation 3 games do sound much better through my Surround system since thier games support DTS sound.something Nintendo and M$ do not offer in thier games.All in all this product is awesome and I hihly recommend this set to anyone that does not wanna spend Sony or Samsung prices but want the same quality.Just make sure to do your home work before purchasing any TV this is an investment and should be something that fits your price range and needs.", "Date": "July 15, 2010"}, {"Title": "Great for the price!", "Author": "Yvonne Hunt \"Mystique\"", "ReviewID": "R1ZVIKHBMEGNTN", "Overall": "4.0", "Content": "I bought my Philips from a wholesale club for Christmas.  I had been looking and comparing features of several models.  This one was on display in the club and actually was on.  I saw very little difference between the Philips and more expensive models.  Best of all they told me I could bring it back within 90 days if I was dissatisfied with the quality. After a couple of months with several adjustments, I think I finally have it set up properly.  I don't see as much blurring.  The best picture is watching a movie on blue ray.  It is crispy clear.  When watching regular television, not sure if the transmission of that station affects the clarity of the picture.Now that I look back on my observations in the club, they probably were playing a dvd on blue ray.  The real test is when you try it with your local HDTV provider.The remote control is so cheaply made, we are still unable to get the battery cover back in place.  I don't understand why such a nice looking set would have such a drab looking remote.  The buttons need to be larger and raised a little bit making it user friendly.  My other tv has a shiny black laquered remote matching the set perfectly. But as someone else said, it gets the job done.I am pleased with my first HDTV flat screen.  It looks real good on my wall.", "Date": "March 3, 2010"}, {"Title": "great tv for the price", "Author": "Jeffrey mr. video \"video freak\"", "ReviewID": "R1MUV5YO0LPYFG", "Overall": "5.0", "Content": "tv is great, good picture, can't beat this tv for the (...) from a club store, trying to find a surround bar for under 200 that will enable me to hear the voices above the sound in movies for its in a large bathroom and running the jetted tub its hard to hear what people say without turning it up real loud, right now i have a computer speaker system hooked up to the headphone jack, i cut the two little speakers off of that system and added two good speakers, but still cannot control adjusting the voices to be heard over the background music like on my living room surround sound, not sure if this tv will work with a 5.1 surround bar or not, tried working with the equalizer inside the tv menu but no difference, i have hd cable, hdmi cables looked great, but had to hook up component cables because i have a toshiba dvd recorder and the hd box keeps giving me that dreaded copyright message you have to turn off when you change channels on the box, of course not the tvs fault, the cable boxes fault, so if you can find this tv for a great price its worth it, for my brother has a samsung and my parents have a 47 in phillips and the samsungs may have a little bit better of a color but not much, im glad i saved the money and bought this phillips, if anybody can help with a recommended surround bar to help hear the voices better please comment, i would love to hear someone that has this tv and the same problem how you fixed it, remember this is in a large bathroom so i just want a soundbar, not a surround sound system, don't hesitate on this tv, although you probably will be hard pressed to get this tv for one grand again, buy it if you can, the remote is just fine for me, i don't understand the big fuss, its not pretty but i have no problems with it, good luck", "Date": "March 13, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001RPMTTW"}}