{"Reviews": [{"Title": "Good to Excellent, Significantly better than CCFL?", "Author": "Gregory L. Dauria \"daurigl\"", "ReviewID": "RVHDMRSSWXO75", "Overall": "5.0", "Content": "I originally ordered the Samsung LN40B650 and was fairly certain that I had made a good choice.  I don't know why but I starting second guessing my decision, which led me to review the Samsung LED LCD televisions.  While the reviews were not extremely glowing, the Samsung UN40B6000 looked like it could better the picture of the CCFL LN40B650 and I canceled the order for CCFL and went with the 6000 series LED television.  One of the \"cons\" of the edge-placed LED televisions is a noted lack of screen uniformity but that is for larger screen sizes and I thought the 40 inch screen would not be as prone to that problem.Some thoughts and observations:1.  The clear screen is very good - I have 3 windows, and a bright ceiling light; there are no reflection problems. In some of my earlier posted Amazon photos, a window reflection was evident on the screen, but not really noticeable in real-life viewing. I found, however, if I looked for the reflection, I could see it. I reshot the photos in lower light to better illustrate the performance of the UN40b6000. The first photo shows how good the screen image is when viewed directly on; this quality remains solid to 15 - 20 degrees of center. The image does lighten but I disagree that it rapidly deteriorates to poor quality even up to a viewing angle of 45 degrees; it's still a good image.2. Out of the box the picture is good, but after using the settings recommended by CNET, with some slight personal adjustments, the picture for many Blu Ray pictures are as good as I've seen.3.  Despite the stated mega contrast ratio of 3,000,000:1, the gamma setting needed to be adjusted to at least +2 or +3 (highest) values to keep dark scenes properly contrasted. One interesting fact regarding the off-center viewing is that contrast for dark lit scenes actually improves.4.  The sound is NOT bad; the two UN40B6000 rear/downward firing speakers in custom mode produces respectable sound for a television set.  Now, if you want theater-quality surround sound, then this TV is going to fall far short of such expectation, but what set would not?  My suggestion is to go into sound mode; select custom, select graphic equalizer (set 100HZ to max; 300HZ to 3/4 range); set SRS Trusurround HD to \"On\" and give a listen. If you're still not happy, buy a sound bar.5.  The backlit remote is nice for nighttime viewing and is fairly user friendly.6.  The Samsung Blu Ray and UN40B6000 automatically recognize one another which may play a role in the exceptional picture that is produced.The bottom line is that UN40B6000 produces a very good to excellent picture, and the sound is decent for a television set - is it worth the couple of hundred dollars more than its CCFL counterpart?  I cannot say with certainty, but my hunch is that it is. However, where its performance may exceed say the LN40B650 is most likely limited to direct viewing +/- 20 degrees off center. After that the CCFL set may hold an advantage.Update 9/25: I have read the reviews regarding limited viewing angles, but I have not noticed the dramatic degradation that has been observed by others.  For comparison, I have placed 3 images under typical dark viewing conditions (note all camera settings are in static manual mode, no photo editing performed). The series of photos uploaded on Amazon do not come close to the actual picture on the screen in terms of quality, but they do demonstrate relative difference in picture color and contrast as the viewing angle is moved from center - please note photo placement captions. Overall, I am VERY happy with the UN40B6000 performance and have every intention of keeping it. The picture is outstanding when viewed directly, and may diminish with increased viewing angle, but it's more of an excellent to good, than a good to terrible.  My wife keeps complaining that the picture is too good - that it's like watching a movie being made instead of viewing a movie - it does not make sense to me either.UPDATE 1/22/10: In the comment section I was asked the set's height with stand.  When I performed the required action by using a metal measuring tape positioned on the right side of the TV, the set went into store demo mode that displayed features of the TV - I needed Samsung technical support to get me out of the stored program. On the plus side - at 23:00, Friday night, I had a technician within minutes. Samsung did not understand why it happened but it did, and they directed me out of the program. FYI, I measured over the front buttons on the right side of the TV and I now believe the metal tape simultaneously contacted two buttons which initiated the store demo program - do not take a measurement in that fashion!  If for some reason the store display comes on, from menu, go to \"plug and play\" and advance to section that has choices \"store demo\" or \"home use\" select \"home use\" to exit the program.", "Date": "September 16, 2009"}, {"Title": "Beautiful picture", "Author": "James F. Stoicheff", "ReviewID": "R1ADT4BQEHH14V", "Overall": "4.0", "Content": "We bought this TV because it had the best picture, period. The rest is, as they say, gravy. That said, there's a lot of gravy.Pros:Fantastic pictureA lot of HDMI inputs (4)Easy to set upAttractive and lightweight designCable HD looks greatThere's some control of the Panasonic receiver/DVD player through the TVPhotos on USB thumb drive look gorgeousCons:The Ethernet connection is nice, but it should do more: I want access to my Ethernet HP Media Vault, and the Internet offering (USA Today news stories, weather, and stocks) is meagerOne of the PIP options must be to the RF coaxial inputThe cons are minor, especially since I wouldn't have cared or noticed if the features weren't included at all.", "Date": "August 6, 2009"}, {"Title": "Lovely picture", "Author": "Winter", "ReviewID": "REGYQGDJ4TGAT", "Overall": "5.0", "Content": "We just upgraded from a 10yr old huge tube tv to this.  Granted that anything would be awsome in comparison, the picture is fabulous, its very light, thin, and energy efficient.  It is weird not having any buttons on the tv itself, but I can kind of see why.  Since it is so thin, the wire placement in the back is a bit strange, or different I should say from the monster tube tv we had.  We had to get a HMDI cable to go with it to connect our DVD player, but other then that, no other item was needed.  If you are going to mount it on the wall, you will need to purchase that separately. Luckily the DVD player we had was new enough to be an upconvert to Hi-def.The picture looks like you are standing next to the film crew as they are filming the show. It's very strange.  Even Kungfu Panda looked more 3 dimensional if that is possible.", "Date": "June 21, 2009"}, {"Title": "video games, sporting events, and dvds.. oh my", "Author": "Joshua A. Patrick", "ReviewID": "R1DHKJFSP1DXMO", "Overall": "4.0", "Content": "I really wanted to give this a 4.5/5, but that isn't an option. I bought this TV with 3 things in mind: sports, movies, video games. The picture on this TV is absolutely incredible; it's on par with any picture on any hdtv out there. It did take a lot of adjusting to get the picture (color, contrast, dejudder, etc) to the level I wanted. I suggest using a THX certified dvd to calibrate it, for those who do not want to pay to have it calibrated. The factory settings for the TV are not good, but after tinkering with it for quite a while, I think the picture is near perfect. Unlike regular LCDs I've been accustomed to, the colors on this LED are better. Blacks are blacker, whites are whiter. Also, I'm a very big video game player, and this TV displays my 360 games (using an HDMI cable) better than any TV I've ever used. Also, there is no lag while playing, which I've noticed before on some HDTVs. Sporting events are crystal clear and crisp without appearing fake, which was a \"must\" for me while shopping. The clear and crisp picture isn't just for sporting events; it also looks great for all HD channels, particularly Discovery, Travel, Food Network. It makes you feel like you are there. Another thing I like about it is simply the way the TV itself looks and is designed. It's very thin and light weight, which is great. I also really like the \"touch of red\" design; it's just nice to look at.With all those good things said about the TV, it is not perfect. Probably my biggest issue came up while watching my first dvd with this tv. The LED edge-lighting can cause an issue during scenes that are intended to be very dark/black. However, after some adjusting (again), I got the picture to look the way I wanted it to. (Note: this was a regular dvd played on an upscaling dvd player; NOT a blu-ray. I can't say how a blu-ray would look on this tv or how the backlighting might affect it). A VERY good thing about this tv in respect to this problem is that you can have different settings for each input. For example: the settings I chose for picture quality for video games, dvds, and cable are all different. However, all three of these use different inputs to the tv, so when I decide I've had enough cable and want to play a game, I switch it over and my settings do not need to be adjusted; they are saved individually. My second issue: sound. This TV simply has mediocre sound. It's not bad, it's not great. My biggest problem with the sound is that when switching between a video game, dvd, and cable, I had to adjust the sound dramatically for each one. That's more of a nuisance than a true problem though. Lastly, alot of people complain about the viewing angle of this tv. Personally, I do not have a problem with it at any of the angles in the room in which I have this TV, so that hasn't been an issue for me.So in conclusion: If you are like me and want to use this TV mostly for video games, sporting events, and movies, I highly recommend it as the picture quality can compete with any HDTV out there. Do be aware of the edge-backlighting issue for black/dark scenes in movies and be prepared to adjust each of your inputs to compensate (cable, games, dvd players, etc). And you might want to invest in surround sound, if that is an issue to you. If you want a GREAT picture for the reasons above, this is a very good option.", "Date": "January 8, 2010"}, {"Title": "Stuning Picture", "Author": "Rod", "ReviewID": "R3A513MP0I2QRC", "Overall": "5.0", "Content": "*UPDATED*Well I purchased this two weeks ago from Best Buy and I have enjoyed it since then. I have now a better understanding to write a better review.I like it's ultra slim design and its light weight. I didn't needed more help than little help from my wife to carry the whole package to the second floor. I did it alone to carry off of my minivan and I'm not a wrestler. I did assembled the stand in a few minutes very easily.This is my first HDTV. I have been following HDTV technology for years but was until now that I was able to purchase it. I have watched a lot of TV's  since 5 years ago in every store display with every combination of inputs and I think I can notice when a movie is Blue Ray connected through HDMI or composite video to when a TV set is connected trough other Video inputs and video sources (DVD).I have my set connected to a Samsung BDP3600 Blue Ray, however I have not purchased any Blue Ray movie yet so I tested with a couple of DVDs and the image is excellent. I can't tell if is the TV or the BDP3600, but I see it like a Blue Ray movie. I can't wait to play a blue ray movie on my set. DVD's look gorgeous. *UPDATE: Computer Animated DVD's look gorgeous. I tried Harry Potter DVD and it is not the same video quality as Shrek II. Blue Ray movies seems very nice as expected, darker scenes seems grainy, I believe that is the ISO sensitivity of the film not an issue of the Blue Ray. If that is true new movies are going to be shotted with HDTV or higher area film, if I'm not wrong, most movies are 35mm film.HDTV over the air (1080i) looks very nice and is pretty quick to change from HDTV channel to HDTV channel. I have satellite broadcast, however it does not offer HDTV signals :(.*UPDATE. I have plug ed my USB thumb drive with a racing .mkv file and I was amazed of the quality of video I saw in this highly compressed file (3hrs in a 1.1GB file). All the scenes look very nice with vivid colors and very detailed even the fast moving scenes from on board cameras.*UPDATE. I would have expected to read my Ethernet disk drive to play this videos, but is not able to connect a network shared drive. The blue ray player is able to do it, however is not able to play .mkv files. So I need to copy them to my thumb drive and play them directly on the TV.*UPDATE. Infolink is good, but you are not able to select cities from other countries for weather update.Unless other reviewers say not, mine has buttons, they are touch sensors discrete icons in front of the TV i.e. power button is beneath the SAMSUNG logo.PROS:- Excellent Picture- Slim Design- Light Weight- Stylish Design- Discrete Buttons (some owners might have not notice them)*UPDATE - Ability to play a lot of audio and video formats including .mkv, video files.CONS:The only thing that I have discovered is that Picture in Picture can only be done with an HDMI input and Air. I have not been able to have PIP with Air and the analog A/V input from my satellite nor the satellite with the HDMI input. I have not installed the Ethernet and might a firmware upgrade solve this.*** UPDATE ***I did connect the set to my Ethernet, firmware upgrade was done and it didn't solve the PIP issue. There is also no way to swap the images of PIP. Not too much of a concern for me.I'm pretty happy with my purchase.", "Date": "July 20, 2009"}, {"Title": "Excellent Quality", "Author": "Lee Mellott \"Work at Home Author\"", "ReviewID": "R1GUF1VP45OGWN", "Overall": "5.0", "Content": "I am the type of person who likes to buy good quality and keep it for a long time. But my many years old Sony was turning everyone and everything blue. Definitely a great TV for a Smurf or Blueman fanatic but not the best for general viewing. So out to look for a new TV.I am not an electronics buff so exact specs etc. is not something I really wanted to study. Instead I opted to look for the TV that had the best visual picture.And the Samsung TV has an outstanding picture. The color is vivid and rich and the depth perception is amazing. At some points you feel the characters are in the room with you. In addition the TV looks great from a straight on or side view. The quality of the anti blur makes watching fast paced sports very enjoyable.Many of the TV's we looked at boasted a high quality picture, but we saw a huge difference when we stepped back from the screen. The color on this one just stood out.In addition the TV offers a sleek design. It has a lustrous black finish that sets off the wide screen beautifully. The screen has just the right amount of reflectivity so you can easily view the picture without glare. At 40 inches this flat screen is large enough to give a movie type feel but not so large as to overwhelm an average size family room.  Another big plus is the TV is more eco friendly then others.After viewing the TV's in the store I was lucky to find it on Amazon where it was for a window of time around $1200 with free shipping and no tax. $300 less than if I had purchased it in the store. Since I know I will have this for many years it is an excellent value.Set up was easy, it looks great in the room and we are really enjoying our new Samsung.~ Lee Mellott", "Date": "December 6, 2009"}, {"Title": "It's a great TV.", "Author": "Steve", "ReviewID": "R2146DNA6GF4VQ", "Overall": "5.0", "Content": "I own 3 Samsung TV's and this is the only LED / LCD of the bunch.  So, the question is, \"Is it better than the other CCFL TV's?.  Well, the answer is, \"Yes, in almost every aspect.\"  I also want to state that I like all of the TV's I have and they are all different.  Keep in mind that there is no perfect TV, not even the top of the line plasma's.These are the things that I like...1. The black on this set is what I would consider \"inky black\".  I have seen better, but not by much.  With the lights in the room off, I can see that the black bars on wide screen pictures are not totally black, but almost.  I'm not much of a fan of watching a TV in total darkness. In fact, I have a light mounted behind my wall mounted 52 inch that I use on a regular basis.  Having some light in the room has two advantages.  First, it makes the blacks seem a little darker and second, it reduces eye strain.2. The contrast is better then my other two TV's by a wide margin.  It makes the TV very 3D looking.  There is a little crushing of black levels in some scenes, but that can be adjusted at the expense of the deepest blacks and contrast.3. The color is phenomenal compared to the 52 inch which is about 3 years old.  It is very vibrant and at the same time, more natural. Samsung claims that the color spectrum has been increased to about 97% of the available spectrum and I believe them.  I can see many more color variations than I can on my big set.4. The sound is very good for a TV.  I didn't expect it to be that good.  It is better than both of my other two TV's.  I have a external surround system on my 52 inch because I can't stand the sound of it.  This TV is much better.5. Power usage is very low on this set.  I have a Watts up? meter connected to the TV and the power varies between 60 watts to 97 watts.  On average, it runs between 90 to 97 watts.  Of course, you can increase the back light which will increase the power usage to about 135 watts, but that is not necessary, even in a very brightly lit room.6. The bottom line is that this TV has the best picture I have seen in my home.  Sometimes I say to myself, \"WOW!\".  It's that good.These are the things I don't like...1. Like other posters have mentioned, some shows seem like you are watching a stage play or a soap instead of a finished movie. If you've ever watched a movie in the making, you will understand what I am saying.  It's not always that way though.  Blue Ray seems much better in this regard.  It also seems to be somewhat related to the amount of 3D image presented.  I think what we're seeing is a closer representation to to the recording process and we're not used to it.  Oh well, it's not a deal breaker and it only happens on some shows.2. As for off angle viewing, there is a difference.  There seems to be a slight lose of contrast when viewing off angle.  I has the effect of lessing the effect of black crushing so in a way, It could e considered a benefit.  It is a very minor issue.The bottom line is that the picture is exceptional.Also...From what I've seen in the stores, most plasma's looked washed out in comparison to LCD's, except for perhaps the top of the line Pioneer plasma's.  Plasma's also have very serious problems with burn in, even though they deny it.  You have to be very careful with plasma, even to the extent of not watching too many shows in a row that have black bars.Keep in mind that even LCD's can have stuck pixels if you leave a static picture on it too long.  At least, that's what the instructions say.  My LCD computer monitors don't seem to have any problem with it, so I'm not sure this is really a problem. In the end, LED/LCD is a great compromise between the best plasma's and LCD.  I think one of the best things is that I can watch this TV for about 4 hours using the same amount of power that my 55 inch with surround system uses in about 1 hour. At my present usage, this TV costs me about $1.40 per month to run and that is running 7 to 8 hours a day.One more thing...I adjusted the set using CNET settings and I had to change some of the settings because they do their adjustments in a totally dark room.  Still, the picture is very good.  I also noticed that there was some judder until I set the auto-motion to smooth.  All of the judder went away, very smooth motion now.  I have one little complaint about the settings that you find online and that is that they always set it for a totally dark room.  I don't know many people who watch TV that way.  In a lit room, it usually causes the picture to looked washed out.  A few adjustments takes care of it.", "Date": "February 12, 2010"}, {"Title": "Best picture to date", "Author": "Neil Mcpherson \"koolkid\"", "ReviewID": "R3M15ZAKBREFEU", "Overall": "4.0", "Content": "Pros:You should make sure you can afford this TV before you go see side comparison between it and other LCD TV's in an a store. Because you'll either be walking away with the Samsung LED, or walking away with a product you are certain looks inferior.I do not see the image degradation viewing it from an angle like others have.Cons:Yes, the sound is poor like the other reviews said. The speaker will even reverberate (if that is a word) while the volume if even turned down low. Mounting the TV on a wall does produce better sound than when it is free standing.It's been said before, but I'll say it again. It is absolutely ANNOYING having to hit the \"exit\" button after selecting an input source. I have never seen this on a TV before. This prevents me from using replacing the Samsung remote completely. You can use a universal remote to change input source, but then you have to go back to the Samsung remote to hit \"Exit\" to get the selection display off the screen. If anyone knows a workaround, please let me know.", "Date": "December 2, 2009"}, {"Title": "Absolutely no problems.  Great TV!", "Author": "M. Davis", "ReviewID": "RJQCT4N9CTW28", "Overall": "5.0", "Content": "I did a lot of research on all the reviews before purchansing this tv.  I have had no problems at all that some others had mentioned.  Picture is incredible.  The glare from various windows in the room is very minimal (you have to actually look for them to even notice it).  Sound is actually much better than I had expected from some of the other reviews.  At the time I ordered this tv, I went to other local stores to see if they could beat amazon's price.  They actually told me I should order the tv from amazon at that price.  They couldn't come close.  I had found a steal!  Zero complaints with this LED.", "Date": "November 16, 2009"}, {"Title": "The Best LED HDTV available", "Author": "Darwin Membreno", "ReviewID": "RYW5QDDZ4D9QD", "Overall": "5.0", "Content": "As an Engineer, and Tech lover, this is The Best LED (Light Emitting Diodes) HDTV 1080P,I make my own research (Like 3 month)before buying one of the Best HDTV on the market and I finally found this one that I can describe Like (WOW) And I will tell you why: It has great picture, amazing Dinamic contrast: 3,000,000:1, Motion Tecnology 120Hz giving you the feeling that you are backstage seeing the actors in real and natural movement, I also want to mention this TV have Virtual Surround sound (Simulate a sorroud enviromentin the room you are watching) But you also can Buy the Home Theater if you want, 40% less energy consumtion that LCD (Energy eficient), DTV Tuner build in, Picture in picture, and have to say that this TV has the best picture cuality on the market available, power, volume, channel etc on the TV and a remote controller with Light Button to see at night, it is so thiny 1.2 Inches easy ultra slim wall mount like you hang a frame, 4 HDMI Port (Ver. 1.3 ready), 2 USB, PC input, Ethernet, RF In, Componet, digital audio, No black Color Problems on screen when seeing a picture like Batman Like most LCD, vivid colors, Ultra Clear panel, and the lovely touch of color giving it an artistic touch, I use it with me PlayStation 3 and Blu-ray Movies, I just can say my wife and I are very pleased with This LED HDTV. BEWARE!!! PLEASE UPDATE THE FIRMWARE TO VERSION 1012.0 FROM SAMSUNG, THIS UPDATE WILL IMPROVE HDTV PERFORMANCE. AGAING THIS TV IS THE FATHER OF ALL HDTV. 100% RECOMMENDED! Please check often [...] (Support and Download).", "Date": "June 24, 2009"}, {"Title": "Beware of very poor viewing angle", "Author": "Avi", "ReviewID": "R2LXYXFR6X5BUH", "Overall": "2.0", "Content": "I got the 40\" 6 series LED sidelit TVs and was initially very impressed with the slim-design, finish and picture quality. I hung it like a picture using the slim-mount system and was very pleased on purchasing such a beautiful TV that could be almost flush to the wall. However I quickly noticed that picture quality dropped sharply if I was only 15-20 degrees off center. I have a  8' wide sofa about 10 ft from the TV and the picture is great when I view it from the center but really bad (washed out and with no-depth) if I'm sitting on either side. I even tested it repeatedly from various angles and found that after around 15-20 degrees teh picture quality drops but then remains consistent. This is not what I expected from Samsung's latest line of products.I really like the TV's design but find that the viewing angle and picture quality issue is probably too significant to compromise. I am surprised that no one else seem to have mentioned this with the exception of the CNet review. Maybe I have a faulty set - but it seems unlikely since the picture is great if I'm dead center-front of the TV.", "Date": "September 16, 2009"}, {"Title": "High quality Picture, Master craftmanship and Poor sound systems", "Author": "Haricharan", "ReviewID": "R3BGM8D9DM6UJ2", "Overall": "4.0", "Content": "This is the TV, which I was waiting for a long time. I heard they (Samsung) are launching this new world TV long time back and grabbed one 6 series immediately it hit the market here in India. Price is tagged at INR 1,25,000 (USD 2,500) but i got a better deal for INR 82K (USD 1,600). Extremely sexy high quality TV, I can say I have not seen a better color composition in any other TV. Picture quality is Crystal clear on HD videos and best if you use HDMI cables too. It's even better on Dish TV technology like Tatasky / Airtel digital. As the term LED, this TV uses LCD TV with LED backlighting instead of florescent lights. The term is disputed here because they don't use 100% LED as it supposed to be. But in current market scenarios this is the best in quality and you still have to call it a LED because of its better technology. I rate this TV 5/5 for sheer display and elegant looks. Picture quality is also 5/5.The only disatisfaction in this masterpeice is its sound system, very poor sound system i rate 2/5, I am facing lot of problems with sound vibrations on the back panel of the TV called sound distortions. Samsung technicians themselves commented that this problem is known and they fixed this in 7 series (most ironic is no sales guy explains this problem here in India to customer, its your luck if you get better product for your price) . I have called the service agents plenty of times to fix this big flaw in this series (six sereis). They are calling the fixture as the remedy but I am not satisfied with this rectification. I am planning to go for home theater to fix this nuisance for ever; but it's really costly an affair now.As overall this TV is 4/5 if you can live with sound problems or you have some different solution to fix this only issue. Or wait for new model which does not have this problem at all.I will keep posting more updates as and when I come across. I will also post remedies for the problems which I come across with this TV, which would help you guys in making better decision on buying this product.Have Fun. Don't miss this super technology. You will repent if you go for ordinary LCD. This is the future. Believe it or not.\"Be the First\"", "Date": "September 17, 2009"}, {"Title": "just the facts", "Author": "Chris Ward", "ReviewID": "R14LTHXBAK1E36", "Overall": "5.0", "Content": "just wanted to commment on my new purchase of the the un40b6000.  I have been holding off for several years before taking the high definition plunge.  I decided on purchasing the samsung edge lit led tv versus just the lcd version.  I have to say for the most part I have been very impressed with the picture.  right out of the box the tv was easy to setup and not that confusing on the menu options. Everything was pretty straight forward.  HDMI cables are so much easier than having to mess with with all of the component and fiberoptic cables.  Just plug and play.  The picture quality is great and like many other comments have stated it might be to good.  I have noticed especially on blue ray movies that the shows have lost their movie look.  The picture is so clear that the movie looks like it is being performed on a stage. It is hard to describe in words seeing is truly believing.  The only problems that I have run into with this tv is when I hooked up a samsung blueray player.  It seems that there is a default program called samsung anynet+. If you dont disable the program from the blueray player it locks up the blueray player. Easy fix if you know the solution.  Anyways if you are on the fence with a tv purchase this is a good product.  If you can wait on purchasing like any electronics everything will get better and cheaper. The only advice I can give you is that get ready for some extra expenses.  HDMI cables are not cheap.  However the cheapest cables work just as good as the most expensive.  If you are an existing customer with dishnetwork you can negogitate the service fee for having your hd service turned on.  Go aheah and get a blueray player with the tv.  Even the standard dvds look awesome on it.  good luck and hope this review helps.", "Date": "March 16, 2010"}, {"Title": "super samsung", "Author": "Joseph Giglia", "ReviewID": "R31B4B0H70ZFRX", "Overall": "5.0", "Content": "Samsung is always on the cutting edge. I'am a samsung kinda guy, so excuse the preferance. This set is amazing in every aspect. Before its turned on it looks great just sitting there, Everyone who sees it compliments the design, the TOC, even though it does nothing for performance .Although I have mine on a entertainment center, you can hang it on the wall,like a painting, 1.2\" wide. 4 hdmi ports which is awsome, usb, pc, internet, digital audio, component connections,everything one would need, configuration options in the menu are very generous. One does not buy a flat screen for its speakers,so hook it up to a surround sound system, and enjoy. If you think the picture looks great in the store, when you get it home,adjust  the menu option for home use, not store use and you will be amazed at the results, WOW factor on HD, super WOW on Blu-Ray.I was able to purchase this at a special price of $1259.00, a no brainer.", "Date": "November 8, 2009"}, {"Title": "Outstanding TV", "Author": "Justin Kelley \"J Kelley\"", "ReviewID": "R2T5ONP8MSDGBM", "Overall": "5.0", "Content": "This TV is incredible, especially with Blurays.  The 40 inch model is the perfect size for a medium sized bedroom.  Very user friendly. No complaints.", "Date": "October 9, 2009"}, {"Title": "Great video, fair audio", "Author": "Big Al 2000", "ReviewID": "R2ORGG7VNTDR8I", "Overall": "4.0", "Content": "The picture quality is fantastic, even for fast-motion sports. Speakers are a bit 'tinny'. This set has only one tuner, so you do not get the picture-in-picture capabilities for two simultaneous stations.", "Date": "June 12, 2009"}, {"Title": "Great LED LCD TV", "Author": "David Chatenay", "ReviewID": "R28H9K73CTZH7X", "Overall": "4.0", "Content": "This is one of the best LCDs on the market right now. The picture quality is excellent, the black levels (once tuned properly) are top notch for a LCD TV. The viewing angle is also very good. The set itself is very sleek, I love the black border and the touch of color. Connectivity is excellent, the remote is very confortable (although a bit chunky for my taste). The menu system is quite straightforward.There are a few things that are not perfect though:-there are no buttons on the set itself (at least I didn't find any), so you have to use the remote to turn it on/off.-the HDMI ports are on the side, making for a bit of a cable mess if you have heavily shielded cables. Having them toward the bottom would have been better.-the Motion Plus technology is a mixed blessing. On documentaries, it gives a stunning, life-like aspect to the picture. On some types of movies (animation for example) or for games, it's not so great though, and it's better to turn it off.-coming to the contrast level: I also have a Pioneer Kuro plasma screen (50\"), which has one of the best contrast and image quality. Although this TV has an amazing picture quality, and will easily outperform a lot of other LCD screens, it's still not up to the level of contrast from the Kuro...Overall, I'm very satisfied. You can find cheaper LCD screens of course, but the image quality justifies its price.", "Date": "June 4, 2009"}, {"Title": "Looks amazing, even when it's off!", "Author": "Rodney Eddi \"Gastroenterologist\"", "ReviewID": "R2ZZC5AS564W22", "Overall": "5.0", "Content": "I purchased this set from [...] for $899.00 (after $300 coupon) and received it last week. First of all, it's a pleasure to just look at this set on the stand. It looks stunning. Turn it on, and it will blow you away. Setup was quick (maybe 10 minutes tops, including installation of the base). I am using Amazon HDMI cables ($6). Picture quality is superb. Cable channels look amazing. Even cable news channels look like a piece of art! Pop a blue-ray disk, and the clarity of picture will blow you away. The TV is extremely thin. Sound quality is pretty good (I don't agree with previous reviewers). Samsung menu system is pretty organized and easy to use. I haven't tried the network option, so I can't comment on that.The superior quality of the picture takes some toll on movies. Most movies lose their \"movie look\". It is like watching a show on broadway. I guess this is the problem with HD. You can adjust the mode and play with the settings to somewhat decrease this effect, but it will take time to get used to it.there are multiple options for changing the settings. You can change picture mode, color warmth, darkness, black level, and many more settings.Overall, this is a technological masterpiece at a bargain price. If you are looking for a TV with superior quality and technology without breaking the bank, get this one. You won't regret it.******************************************************************UPDATE (April 13, 2010): I did some research on movies losing their \"movie-look\" and looking like soap-opera. This is mostly related to 120 Hz effect. If you turn off this option, movies look more natural.", "Date": "April 3, 2010"}, {"Title": "Amazing picture, great television", "Author": "D. Sarro", "ReviewID": "RDQMKL3ARHX7A", "Overall": "5.0", "Content": "This television is amazing. I don't care that the sound isn't that great because I have a surround sound system...most people should when investing in a nice television.  The picture is difficult to beat.  The complaints of the poor picture from side views are completely false.  THere are always going to be a few bad apples in a review of a product because people will always find something to complain about, either that or they got a damaged TV.  Picture looks as good from the far angles as it does in the center. There are many nice features such as the mp3 input and ethernet capabilities.  This TV is a nice purchase!", "Date": "February 27, 2010"}, {"Title": "Love it", "Author": "ffsue", "ReviewID": "R1L9IA771ZDN8X", "Overall": "5.0", "Content": "I just go my new Samsung UN40B6000 &  absolutely love it.  Easy to set up & has a beautiful picture.  I love the energy saving aspect as I am an environment friendly gal.  The sound is great too.  My hearing isn't what is used to be & have been pricing out Bose 3-2-1 system because I don't want to run a bunch of wires around, but was amazed at the sound from the tv at a low volume.  The Samsung warranty for additional 104.99 is a bargain too.  I didn't buy mine throught Amazon (wish I did), but found it somewhere else for $200 cheaper.  Didn't have free shipping though so actually saved $120.  The other website (will not name) tried to push me on a 3 yr plan for $299.  If you are someone who likes to insure your high end products (like me but I didn't pay $299) buy through Amazon & get the warranty.", "Date": "February 18, 2010"}, {"Title": "Great set, great price!", "Author": "B. Kivell", "ReviewID": "R2NXDZA9QX16RJ", "Overall": "5.0", "Content": "This is my first HD TV, so my impressions might be skewed, but I just love this TV. I did a lot of research on different TVs, and have always loved Samsung. I was looking at LCD sets until I saw this in person at Best Buy, and when the price here at Amazon dropped to just a couple hundred above my preset limit of $1,000 (at the time of purchase!) I decided it was worth the extra cash. Easy to set up, and picture quality is outstanding.", "Date": "February 15, 2010"}, {"Title": "LED Definitely Worth the Extra $$$: This TV is Awesome", "Author": "H. Freeman", "ReviewID": "R1E2A2IPAGUXXU", "Overall": "5.0", "Content": "I'm simply blown away by the picture on this set.  We got an entry level Panasonic HD (around 23\") when HD sets first came out, and it served us well, but we were ready for something a little bigger and more modern.  For the longest time, I had my eyes on the Samsung LN40b630.  That's a great LCD TV, don't get me wrong, and it was featured for a great price on Amazon.  But then I decided to hop into a Best Buy just to see the picture on the 630 up close, and I just found myself staring at this beauty.  Okay, yes, LED may be a clever marketing tool, and LED is really a subset of LCD... all I know is the picture on this set is vastly superior to that on the LCD sets that I saw.  And for an investment of $200-$300 extra, this was a no-brainer.  The ridiculous (and I mean that in a good way) contrast ratio, the Auto Motion Plus 120Hz, the multiple modes you can choose from and customize yourself whether you're in a dark or light environment... you really get what you pay for, in my opinionThe next step up, the 7000 series, has a ton of interactive features, but other than that, it appears to me to be very similar to this model, so why bother?  If you want the best picture at the best price, and aren't really concerned with Yahoo widgets and internet connectivity, the UN40B6000 is the way to go.A crystal clear picture, and being able to watch fast moving without any blurring truly makes watching sports an experience, and something else I've learned is that some channels or networks come across as higher resolution than others.  In the first day or two after we acquired this set, we watched a few things here and there on various HD networks.  Last night, my wife and I watched \"How I Met Your Mother\" on our CBS affiliate, and were blown away at how crisp the picture was.  As I had heard others described, it's as if you're on the sound stage watching it, rather than viewing it through a video feed.  And then there are other HD channels that look amazing, but not quite to that level.  But I'm assuming the big events probably look the best... and to that end, I'm looking forward to checking out the Super Bowl (and the LOST premiere) on this bad boy.  And I look particularly forward to watching our first Blu-Ray film.The one thing I find annoying is that I have to purchase a Samsung Wireless LAN Adapter to get the Infolink service to work (and not to mention the Netflix streaming capability on the Samsung Blu-Ray player).  Be that as it may, that is honestly the only negative that comes to mind.  I love this TV.  Besides the picture, the 1.3\" thickness of the set is something to behold.  And 40\" was the perfect size for our living room.So if you're on the fence and have a couple of models in mind, trust me, throw in the extra bucks if you can spare them, and go for this LED-LCD set.  But don't take my word for it, go to your local electronics store and look at the televisions for yourself.", "Date": "February 2, 2010"}, {"Title": "Awesome Television", "Author": "J. Swenson", "ReviewID": "R2BRUMTT6PRFOA", "Overall": "5.0", "Content": "After much deliberation, I decided to go with the Samsung (UN40B6000) 40-Inch 1080p 120 Hz LED HDTV because of the awesome picture and contrast ratio. The TV is a superb device for movies, video games, cable TV, and a computer monitor.The TV's minor fall backs include a slight decline in quality if viewed from the side and horrible speakers.  The glare from the screen isn't an issue because of the sheer light that is projected from the TV; however, there is a slight reflection from the frame of the TV.Overall this is a great television!", "Date": "January 31, 2010"}, {"Title": "Only one component video - but great picture", "Author": "OaktonMom", "ReviewID": "R3F4TX4RO8CBAK", "Overall": "4.0", "Content": "The picture is fabulous on this television. Only two downsides:* The sound is ok for \"in TV sound\" as a backup but sounds like it is coming out of a cave. There is no bass whatsoever, it is very tinny. Thank goodness we hooked up to a speaker system.* Only one component video input. This is highly annoying - we have a Wii, an Xbox 360, a old PS2, and a DVD player and only the Xbox can do HDMI.  Would have preferred to at least see two component video inputs. In our case we'll ditch the DVD since its redundant with both the Xbox and PS2; but annoying that there is limited backward compatibility to older devices since it means we have to buy a switch.Would give this 5/5 for the awesome picture quality but that lack of a second component video is not cool", "Date": "January 27, 2010"}, {"Title": "Great picture and easy to set up", "Author": "Mike Powalski", "ReviewID": "R1ASB00PBRYTVD", "Overall": "5.0", "Content": "I looked around for quite some time  before taking the plunge on this TV.  We have had the TV connected to both a HD DirectTV box and an SD DirectTV box.  The picture was obviously better when connected to the HD box but I was quite surprised at how well it did displaying SD(480).  When comparing the image to other HD lcd tv's in the house the Samsung was far better at displaying SD tv.  The sound isn't the best and I think is sounds better if you turn the SRS off, but I plan on connecting to a surround sound system anyway.  One thing to consider is the lack of connections for devices that do not have a HDMI port.Pros:  Incredible HD display and excellent SD picture quality.  Very thin along with a narrow bezel allows for placement in spots some 40 inch TV's can't fit.  Easy to setup, the menus are intuitive and the remote is easy to use.Cons:  Average sound from the built in speakers but it is OK just not up to par with the display.  Lack of connections for devices without HDMI ports.", "Date": "September 12, 2009"}, {"Title": "best wide screen i have ever seen", "Author": "D. Stephens", "ReviewID": "R194TT5E8R31QG", "Overall": "5.0", "Content": "By far the best quality picture i have seen for a 40 in. flat panel.easy to set up and menu is very user freindly", "Date": "November 13, 2009"}, {"Title": "Thank you Samsung", "Author": "TRYTHAI \"TRYTHAI\"", "ReviewID": "R37LXNSN9AL8KJ", "Overall": "5.0", "Content": "Hooo!! I just purchase thie Samsung LED TV today. It is a dream come true for me. I have been looking for over a month for a new TV. I was read and read, Ask and ask the sale person for every knowlage I can before I buy this one. Wow what a good decision. I had a Magnavox 32\" 720p that quit working after 3 years. Think it because I start to play Blue ray with HDMI in to it. I set auto out put from the blue ray but I think I force 1080p in to my 720p. Called Magnavox they know exectly what happen (like it happen often) my power board was burn out. So any one that have 720p becareful. I know that Samsung is a very good brand, but I don't know how good it is until i seen this one un40b6000. The price was out of my range, and I was setting down with 60hz Samsung 550 model for around $1,000. I purchase the 6000 for little over $1300. I worth the money. I though my Magnavox was good picture, but not even compare to this samsung. 40\" is way big enough for me, and i think it is the right size for any room unless you are in a hall or sport bar or very big room. I love the auto sound setting it help a lot. My wife and I was always got mad at the net work station that crank up the sound of comecial too lound, and we have to keep adjust volume up and down on our old TV. After we seted the auto sound we now are relaxing not jump up and down like before(more peace full feeling if you know what we mean). I notice that on the sit com the sound of back ground laughing is also smooded not jump up to disturb you nerves. WE LOVE IT!!. You can turn it off when you watch the movie to get special sound effects. the finish is beautiful the base ia a real class not plastic, looks very classy. I play Wall-E, Die hard, Across the Universe, Battle of great Brithan.Hoo we never seen any think like these Blue ray. Thank you Samsung for build the best TV for us cosumers. This is truly a Cadilac of TV.I can't wait to watch Tennis US opon on it.Pro: Great picture, color, sport pictures is like you are standing beside the player. Blue ray is so sharp it's unreal, great sound from little speakers. I don't have cable or disk, and don't have to deal with these pay TV provider the try to BS us about buying HD TV signal from them. The true is you can get HD off the air from every digital brodcast, which they all are. My on the air picture is so charp, and it free. I am getting over 60 chanals over the air, and it growing. If I want to watch the late release movie I just rent them from Redbox.com for $1.00 a night.Con: The screen have refexion like Plsma a litlle, The cable hook ups should be on the bottom, only one RCA input(I gusses samsung want you to use HDMI for all conection,", "Date": "August 28, 2009"}, {"Title": "Love My Samsung LED TV", "Author": "cordlessmike", "ReviewID": "RS6MKZKKT1B80", "Overall": "5.0", "Content": "Purchased the UN40B6000VF in January of 2010. My only regret is paying for Best Buy's extended warranty, as this TV has never malfunctioned in any way in the two years that I've had it, and I don't expect to need the extra 3 years of warranty protection.  I love the sharp and vibrant picture.  I had the Geek Squad come out and calibrate the video output, which did improve the picture somewhat, but again, it was so good to begin with that I could probably have skipped this as well and been just as happy.  If I ever need another TV, I'm going with Samsung.  This TV provides real quality not only in the picture and sound (I'm using a Samsung soundbar and wireless subwoofer which Best Buy threw into the deal -- they sound awesome!) but looks fantastic in my living room.  Probably by now, Samsung has come out with a newer model, but if you're looking for a great 40' LED TV, you can't go wrong with this one, in my opinion.", "Date": "February 1, 2012"}, {"Title": "10 Star HDTV", "Author": "D. Zacharie \"denzack\"", "ReviewID": "R25OQWF9S6TFYA", "Overall": "5.0", "Content": "I hooked up my new Samsung 4 days ago and I am stunned by the beauty of the picture.  I can't imagine a better picture being possible. It replaces a 32\" Sharp HDTV which I moved to my bedroom and as good a picture as that one delivers, they are worlds apart. This unit should be defined in its own category of Ultra High Definition!  I'm not big on quoting specs and comparing i or p scans, or refresh rates, but I know what I see and this one is one of a kind.  I couldn't be happier.", "Date": "May 30, 2011"}, {"Title": "Great Price!!", "Author": "John R. Nicholson \"bullsfan99\"", "ReviewID": "RGVXN39I7RON7", "Overall": "5.0", "Content": "I have owned the UN55B6000 for about a year. The picture is fabulous. I saw the UN40B6000 at Sears on clearance today. After all the discounts the final cost was only $435. OMG it was the last one and I had to buy it. Picture is GREAT! Look for a good deal since these are last years model. The 2010 UN40C5000 is selling for at least $899 and it is not 120HZ.", "Date": "September 20, 2010"}, {"Title": "Having really enjoyed and what a big difference!", "Author": "Marcia", "ReviewID": "RJE1HNYHZPUGO", "Overall": "5.0", "Content": "Ordered the Samsung LED from Modia. The first one came in cracked by the shipper. With a very good service department and excellent assistant manager at Modia was able to replace the Samsung LED. I have seen other flat screens and I had my hesitations about the new flat screens. I'm impressed with the LED with it's sharpness and brightness and the easiness of operation. The adaptability of the other devices is amazing. I will be using Modia again for my next purchase. Thank you, MODIA", "Date": "September 20, 2010"}, {"Title": "Excellent", "Author": "Alejandro Rat", "ReviewID": "R3OU4SQO0QF2U1", "Overall": "5.0", "Content": "all ok, good seller, the item was better than i expected i will buy again soon at this store.", "Date": "September 7, 2010"}, {"Title": "Beautiful picture", "Author": "Bruce Gladstone \"beglad\"", "ReviewID": "R31Z2T94VDA3WQ", "Overall": "5.0", "Content": "It really does provide a great picture and all the inputs you could ever need. Easy to setup my Logitech Harmony 1000 to control it.", "Date": "June 24, 2010"}, {"Title": "Great Buy - Problem with InfoLink", "Author": "J. Larson", "ReviewID": "RQNZ8XJ005FWO", "Overall": "4.0", "Content": "My first LED TV and I am very pleased. Picture in HD is outstanding. Set up is simple and uncomplicated.Touch of red adds a little class. The only reason I will not rate it five stars is I am having problem accessing the info link (purchased the linkstick)feature. Have had to phone tech support numerous times with different solutions based on what technician you get. Now appears to be a problem with my router blocking this feature and neither Samsung or my ISP provider seem to be able to solve this. I did download the software upgrade.Aside from this disappointment we love the TV. Fortunately Amazon offered the Samsung soundbar FREE which enhanced the quality of the sound considerably as the TV sound is just average. For the price I paid from Amazon it was a good buy.", "Date": "March 11, 2010"}, {"Title": "Great Picture", "Author": "Dudley G Robertson \"Ground Hunter\"", "ReviewID": "R2BPR4YFWDA6MN", "Overall": "5.0", "Content": "Dilivery was on time and the driver helped take the TV upstairs.  Comcast came and hooked up a HD DVR and the picture was great.  He used a very large component cable.  He said it would be as good as HDMI.We noticed a buzz from behind the set that was intense at times depending on how dark the picture was.  I ordered an HDMI cable from Amazon and hooked the set up with that.  The buzz went away and I believe the picture looked a bit better.  The sound seemed to improve also.The set produces a great picture.  We are very happy with our purchase.", "Date": "February 14, 2010"}, {"Title": "Excellent Picture", "Author": "K. Culp", "ReviewID": "R3U0CG6HR37OPH", "Overall": "5.0", "Content": "Shipped and purchased at Amazon and very pleased. There is a big difference between 720p and 1080p that I didn't really understand till seeing it in \"the real.\" But, you will need a blu-ray player to pick up on it, not convinced too many programs broadcast in HD at this resolution. Remote is a little complicated, always searching for the right button. Wish the HDMI was more in the center for on the wall install, a HDMI cable 10 ft long barely worked. Of course, this HDTV is thin and sound \"works\" from the speakers - but be careful and keep the volume down, a home theater system really helps. I love it, but Samsung price gouges on accessories.", "Date": "February 7, 2010"}, {"Title": "Horrible Customer Service", "Author": ".R. Campbell", "ReviewID": "RSP0OJTL2TMND", "Overall": "1.0", "Content": "Buyer Beware.  I purchased this unit in 12/2009 for a guest bedroom.  After about 200 hours of viewing, the panel on the TV went bad.  The repair estimated was $1,300.00.  I had paid almost $2,000.00.  Unfortunately, the set was no longer under warranty and Samsung refused to offer any accomidations.  I reseached the issue by googling \"Samsung UN46B6000 panel problems\" and found that it was a common problem.  Even though this TV set looks good, it is only meant to work for a year or two.  Samsung's customer service was horrible.  I give this product and Samsung the lowest rating.  Truly be wary of this TV set.", "Date": "July 19, 2012"}, {"Title": "Brilliant", "Author": "D. W. Moretz", "ReviewID": "R308U5N993BDKT", "Overall": "5.0", "Content": "The Samsung UN40B6000 is a pleasure to watch. We mounted the TV on our bedroom wall. Picture is great... Much better picture than our first generation Samsung LCD TV.", "Date": "October 19, 2009"}, {"Title": "waste of money!", "Author": "M. Walters Jr.", "ReviewID": "R3G7XPOC7POF3X", "Overall": "1.0", "Content": "i went thru 4 sets from bestbuy and all had a terrable buzzing noise coming from the back of the tv. it also has a very poor viewing angle. move left or right the picture washes out. also the led lights made it hard to get natural skin tones on the screen every persons face was to bright no matter what setting the tv was on or how i ajjusted the setting. my samsung 40a650 does not have any of these issues. i took the fourth set back and got the samsung ln46b750 , this set beats the led in every aspect. the blacks are better the white is not overly done and skin tones look natural. c.net also rated the 750b series better then the samsung edge lite led tv's.", "Date": "September 24, 2009"}, {"Title": "NEEDS INSTRUCTIONS!!!!!!!!!!!", "Author": "Texas \"Texas\"", "ReviewID": "R27MVI1FT7DNRK", "Overall": "5.0", "Content": "Outstanding product with full documentation on EVERYTHING! Beleieve you would even hook this up to the space station! HOWEVER- NO INSTRUCTIONS on how to assemble the stand; just three pictures in four languages! Quite a chore!", "Date": "March 21, 2010"}, {"Title": "Wow! What a great TV!", "Author": "Robert A. Graham \"DigHer\"", "ReviewID": "R1BH8K2G6XALGW", "Overall": "5.0", "Content": "This is a fantastic TV!  The picture, the sound, everything is perfect for us.", "Date": "January 25, 2010"}, {"Title": "First LCD T.V.", "Author": "J. Myers", "ReviewID": "R2OXQ3OYDCQANO", "Overall": "5.0", "Content": "Bought my first LCD from Amazon and everything went perfect.Great price $1250.00,free shipping and no sales tax. The T.V. arrived ahead of the scheduled delivery date.The delivery guy was on time,and he opened the box to make sure it would power up. I had it set up on the stand and running within minutes.I was hoping for a little better picture with S.D. TV. I have Dish Network and thought the digital would be acceptable.Needless to say I ordered H.D. the next day, WOW!!I love it,what a picture.I see no loss of picture quality when viewing from the side. Maybe a little lighter is all.", "Date": "November 18, 2009"}, {"Title": "Incessant Buzzing Noise", "Author": "Franklin", "ReviewID": "R2PJUE4SBDYMGU", "Overall": "1.0", "Content": "I am about to return my second TV; both were plagued with the same horrible buzzing noise. This noise was only present if a video signal was live, and appeared to be related to backlight strength (set it dimmer and it's quiet, set it for normal viewing and it sounds like you're watching a movie from within a tanning bed).", "Date": "October 5, 2009"}, {"Title": "Good News and Bad News", "Author": "Virginia", "ReviewID": "R3TEFWX9IQ9EM2", "Overall": "3.0", "Content": "The UNB406000 arrived from Amazon in perfect condition and on time. Overall the TV provides outstanding performance; annoyed however, with the channel scan limitations. Pro:1.The UN40B6000 provides a great picture, stunning sharpness, excellent overall color. Excellent ATSC digital tuner, except for the user tool limitations (see cons).2.Low power consumption. The load power measured about 65 watts or about 0.095 watts/square-inch for the 40 inch LED-lit screen. By contrast, my Samsung 61 inch DLP HDTV measured about 210 watts or about 0.132 watts/square-inch. Line voltage measured 122 volts at 60Hz. The measured values are from an APC 1300 UPS using the built-in digital load watt meter. The wattage in either case varies according to picture preference settings and scene to scene variation.Con:1.Unlike the other Samsung HDTV's I have purchased in the past, the UN40B6000 will not easily combine TV channels from other cities or directions. I live between several cities. I do not have cable or subscription satellite service, only broadcast reception with an outside antenna oriented with a rotor. Every time I want to watch channels from a different direction the auto scan must be run; which first eliminates all previously stored channels. Re-aiming the antenna is quick; but to run the auto scan every time is absurd. Also, there is no method to manually add a real digital air channel should a broadcaster use a virtual channel of the same number. See [...] for definition of a virtual channel.2.The multimedia USB interface overall does work; however there are exceptions. All my NASA HD recordings, direct from the NASA C band channel on AMC 6, are recorded in mpg format to my PC's hard drive. When transferred, none of these files played with the UN40B6000 USB interface, although they play without problems on my PC.  Not too surprising, other mpg recordings do work without problems. I believe the difference is the specific mpeg decoder used to record the files to the hard drive.3.No S-video input. It would be really nice to play my super VHS tapes with the an s-video connection.4.The internet connection is useless. While the internet connection does work, accessing weather, stocks, news while watching TV is useless; obviously my opinion.", "Date": "October 24, 2009"}, {"Title": "Samsung Luxia 6000", "Author": "Ed \"None\"", "ReviewID": "R18E6BMMXNBIYJ", "Overall": "4.0", "Content": "I bought the new Samsung Luxia 6000 40in. LCD LED display and I'm a little concerned with the level of artifacts on non HD broadcasts. Anyone have any similar experience or suggestions? Good HD broadcasts are stunning, so I think it may be the signal. Still, I would like lower grade signals to be a little cleaner.Also, does anyone have any experience with Samsung upgrading their software? I noticed they have an option to do so in the menu, just wondering if they ever do it?", "Date": "May 27, 2009"}, {"Title": "tinny sounds", "Author": "R. A. ELLIOTT \"r.e.\"", "ReviewID": "R15LDUDDCWDO5T", "Overall": "3.0", "Content": "I currently own a samsung 40\" lcd...and i love the Tv. But as i read your reviews,i also seem to agree that on most samsungs,the sound just doesnt \"cut it\"  so to speak. I quickly purchased a Samsung Sound bar,which is fantastic. Ive been looking at the new led that samsung is now promoting,but again ive heard issues with the tinny sound. Hopefully samsung can work out this minor problem,cause they do make a great looking tv.", "Date": "September 19, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Ultra-slim 40-inch LED HDTV with full HD 1080p resolution for the sharpest picture possible\nLED technology enables a true-to-life range of picture brightness; uses 40 percent less energy than conventional LCD TVs\nInfoLink RSS feeds of news, weather and sports from your broadband connection\nInputs: 4 HDMI, 1 component, 2 USB, 1 Ethernet, 1 PC, 1 optical digital audio output\nIncludes detachable swivel table stand; measures 38.7 x 27.1 x 10 inches (WxHxD) with stand", "Name": "Samsung UN40B6000 40-Inch 1080p 120 Hz LED HDTV (2009 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/518TbzB0VmL._SY300_.jpg", "ProductID": "B001UHMV90"}}