{"Reviews": [{"Title": "NO BETTER DEAL  FOR A PREMIUM LCD HDTV!", "Author": "Bruce R. Nelson", "ReviewID": "R2H3CVJ3693DIW", "Overall": "5.0", "Content": "I spent over a year researching AND trying out flat panels to find what, in my opinion, is the best deal for a premium LCD HDTV. By \"premium\" I mean a full HD set, over 40\", 1080P display and, very important 120HZ which VIZIO calls \"smooth motion\". It turned out that the one set that met all my requirements, BEFORE price considerations, was the VIZIO SV470XVTa1 120HZ set. The picture is BLAZINGLY crystal clear, colors are perfect and, VERY IMPORTANT if this is to be the users primary display, is the benefit LCDS enjoy over plasmas...NO GLARE or REFLECTION off the screen! Just check out any LCD vs plasma set on display in most any store..you could comb your hair in front of a plasma and it reflects almost every light in sight. NOT so with LCD. Now here is the BEST PART of this review...you can buy a brand new VIZIO like mine described above for UNDER $1300. In some cases I've seen under $1250.  You can not beat VIZIO for the best deal on a premium LCD HDTV...period! (Oh, yes, FOUR HDMI ports also!!!) One more point...VIZIO professes to be \"Made in USA!\"", "Date": "December 19, 2008"}, {"Title": "Best TV ever", "Author": "Opm85", "ReviewID": "RIY0FBLHQTG4O", "Overall": "5.0", "Content": "I have owned this T.V. for about 6 months and I love it.  My bro. in law and father in law both have Samsung T.v.'s with 120hz refresh rate and I have to say the Vizio looks just as good if not better. The best part is I spent about $500.00 less than both of them and got a larger screen.  The smooth motion sometimes has issues with horizontal lines spaced close together.  I have owned two  of this particular model.  I returned the first one because Costco dropped the price by $300.00 a week after I bought it and wouldn't give me the difference without returning the old one.  Both of them have outperformed my expectations.  I am running a Sony blue ray player, a Wii, and an Xbox 360 into it.  They look amazing with the exception to the Wii which doesn't do to well with this big of a screen as it is only capable of 480p. Overall, I would suggest this set to anyone, get this TV.  It is amazing, and if you don't believe me go demo it side by side to any other tv in it's class.  You will find that the quality is just at good as a Sony or Samsung for a lot less money.", "Date": "April 21, 2009"}, {"Title": "Never written a review but felt compelled for this TV!!!", "Author": "A. Khan", "ReviewID": "R3FNGSTUOKLQNM", "Overall": "5.0", "Content": "I spent a couple months researching & trying out LCDs. I have tried & returned other LCD tvs during this time. CostCo had this TV for $999 after a $300 coupon & I pounced. This is by far the best of the 3 TVs I have tried so far. The picture is excellent & the sound as well. 4 HDMI ports are pretty useful as I am already taking up 3 with my cable box, blue ray player, and laptop. Another thing that is equally important is the way the back ports are accessible. Vizio makes them accessible from below which makes a lot of sense when mounting to a bracket. The bracket does not end up covering the ports (unlike with the Philips models, very poor design). Have only owned it for a month now so cant think of any negatives yet.I have a need to buy another TV soon, & this one is on the top of my list.", "Date": "January 25, 2009"}, {"Title": "Great tv until it died!", "Author": "P. Powell", "ReviewID": "R2UP9BQF0A1KSC", "Overall": "1.0", "Content": "I bought this tv in jan '09. Yesterday one of the HDMI ports went out. Today it won't even turn on. The word VIZIO lights up and the screen is black. This is one of the same problems many other people have had that also purchased their sets after jan '09. I think they must have changed something in the tv and dropped the price so everybody bought them. It just makes me mad to know that a manufacturer knows something is not right and they still sell their product anyway. Guess I will be switching to another brand.", "Date": "September 23, 2010"}, {"Title": "Dont Buy this TV", "Author": "Elisha Lear", "ReviewID": "R3ETNRVW7ER9PI", "Overall": "1.0", "Content": "MODEL NUMBER: SV470XVT1AI purchased a Vizio TV for $1, 000 about 18 months ago. The backlight has gone out and we were told by Vizio that this could not be fixed and we had to buy a new TV. They refuse to compensate us in anyway. The TV is going to cost $325 to repair. We will never buy a Vizio again and will tell as many people as we can not to buy one either.", "Date": "September 9, 2010"}, {"Title": "Bad Picture with Any Motion - Don't buy it!", "Author": "M. Scott", "ReviewID": "R160KITUAR4R8Q", "Overall": "1.0", "Content": "I just bought this TV getting ready for a superbowl - I will return it tomorrow.  The picture is horrible and blurred with any motion.  I wish I had read the reviews before picking this thing up and wasting my time.", "Date": "February 4, 2010"}, {"Title": "terrible product", "Author": "Kathleen Cisneros", "ReviewID": "RGIALALC1Y8GH", "Overall": "1.0", "Content": "Don't buy Vizio anything. Poor quality and terrible customer service. My HDMI ports failed in less than a year and Vizio won't fix it.", "Date": "December 29, 2009"}, {"Title": "Vizio 47\" LCD HD SV470XVT 1A", "Author": "W. Miller", "ReviewID": "R1A52M1H5OY169", "Overall": "1.0", "Content": "Purchased this Vizio tv back in May 2009 needless to say after doing a lot of research on this one...it got us anyway. Dec 2011 no video after many of weeks waiting for parts the service guy could not repair it. Thank heaven we bought the extended warranty cause we are getting a full refund and are currently looking into another brand TV. Buyer beware of this one.", "Date": "January 23, 2012"}, {"Title": "Do not buy this TV until you read this!!!!!!", "Author": "Hector rodriguez", "ReviewID": "R3QYRFAKRMBM2A", "Overall": "1.0", "Content": "This TV Broke almost 3 months after I bought it. The screen went green and I could not see anything on it. The repair man vizio sent to my house told me he had problems with his as soon as he took it out of the box. The TV could not be fixed so vizio sent me a refurbished one. I shelled out 1300 dollars and ended up with a refurb that is nothing more than a repaired set. At this point i'm just waiting for this one to break and start the cycle all over again. I am truly dissapointed with this company and will never buy anything from them again.", "Date": "June 22, 2009"}, {"Title": "Best 120 Hz Deal", "Author": "Daniel A. Robinson \"darobin\"", "ReviewID": "R3W1JYSTTDB9MA", "Overall": "4.0", "Content": "I have been an owner of Olevia setsfor several years.  Recently picked upa 47 inch Olevia and found it had pixelproblems, so returned it and went forthe Vizio.First, I have to say that the Vizio hasmore features than the Olevia -- and the120 hz refresh rate is simply fantastic.You have to adjust it though -- for thesituation, sports, etc.The Vizio has great sound from its on boardspeakers -- and it looks great.All of that said, I have to say that Oleviaoffered what I believe to be the best picturequality of almost any LCD out there -- it isa shame that the company went down (perhapsthey will return -- they're still reachableby phone).But all in all I am very satisified withthe Vizio and would consider it again ifI ever make another purchase.", "Date": "January 25, 2009"}, {"Title": "No problems..", "Author": "John Dough", "ReviewID": "R1H99IK432BK7M", "Overall": "5.0", "Content": "Looked up my TV here to get the specifics so I could finaly buy a wall mount. After seeing how many 1 stars it's gotten I thought I'd share my experiance with it.  I bought this TV off of Craigslist 2yrs ago and have never had any problems (knock on wood).  I guess it's the luck of the draw.", "Date": "May 27, 2012"}, {"Title": "Excellent LCD TV", "Author": "Eugene Evans \"Fasteddie\"", "ReviewID": "RXKL4A8ZE420I", "Overall": "5.0", "Content": "This an excellent tv,especially for the price.The 1080p is true hd and the blacks are very dark,while the colors are very vibrant.The 120hz refresh rate works very well on this tv and better then most at a higher price!!The sound is good for a tv,but not the best.Dont get me wrong,its a nice sound,but Im just used to having a full surround sound hooked up.I give this TV 4.5 stars out of 5..I have owned lots of LCD tv's and Vizio continues to impress me,even more than Sony or Samsung!!", "Date": "April 30, 2012"}, {"Title": "Owned 2 years and Love it!", "Author": "Barefoot", "ReviewID": "RFI51D01X7DLF", "Overall": "5.0", "Content": "I have had this tv and used it for over two years for games, sports, and blue ray movies on my ps3.  I love it, and have no complaints!  Highly recommend it.", "Date": "June 23, 2011"}, {"Title": "Not bad for the price", "Author": "Mark Beare \"Bearey\"", "ReviewID": "R3TIYNIB89KO54", "Overall": "4.0", "Content": "I have been pretty happy with this TV. I actually bought it off a friend when he left the country. Definitely would get an LCD TV with a higher refresh rate next time though as you do notice blur when watching sports.", "Date": "June 8, 2011"}, {"Title": "Beautiful Picture, remote failed.  Returning TV", "Author": "K. Wolford", "ReviewID": "R2B8A2ZQHET8R", "Overall": "1.0", "Content": "Unreliable as heck.  Beautiful when it was working but the remote kept not working the TV.  I had to constantly turn it on and off to reset the TV.  I will go back and spend a little more $$ and get something that will last more than a month.", "Date": "January 17, 2011"}, {"Title": "It was an okay tv until it broke", "Author": "B. ANDERSON", "ReviewID": "R2YGVNZFV2WII9", "Overall": "1.0", "Content": "I bought this TV in January. The picture was good, 120hz refresh rate was awesome. However, the picture would get choppy and lag a little bit. It could never show a perfect black, you could always see the backlight on. About a month into owning it the TV broke. It would not show a picture at all, just a black screen white random white lines everywhere. Anyway, from the beginning I wasnt sure how good these Vizios were, I took a chance but it did not work out. Will not own a Vizio again. Now a happy owner of a Samsung plasma, and FYI, plasmas look much better.", "Date": "March 5, 2009"}, {"Title": "Worked great for 3 months, then it broke", "Author": "B. Creswell", "ReviewID": "R315BCSBXKFMDD", "Overall": "1.0", "Content": "Loved the tv and got it at a good price, but then after about 3 months it got into a state where it would work for about 30 mins, then the picture would go black with weird lines all over the place. Need to read more reviews before I buy cheap stuff :( Gonna go get a samsung tonight.", "Date": "August 22, 2009"}, {"Title": "Worst TV Ever", "Author": "B. R. Oja", "ReviewID": "R3GLB4X2KUA4XQ", "Overall": "1.0", "Content": "Normally I don't pay too much attention to bad reviews. Products normally work, and I'm generally happy, so I was excited when I bought the TV. Two months later, when all the black pixels turned red, the excitement waned. I called the warranty department, and they said the TV was \"dead on arrival\", and they'd call me in two days to replace the TV. Three days later, they called and offered to repair the TV in three to five business days. After correcting them, they eventually said they'd replace the TV and call me in seven to ten business days to set up a date for the exchange. They said I wasn't getting screwed, I was getting a new TV! If only I could get my money back... I regret not purchasing a name brand TV.", "Date": "June 8, 2009"}, {"Title": "Seems to be a lot of the same problems.", "Author": "Kevan Doblinger", "ReviewID": "R1UF4DJ3DDO3FB", "Overall": "1.0", "Content": "This pixel problem seems to be more prolific than I thought. The same thing happened to my TV. A couple months with an ok TV and then one night all the black colors somehow went red. Even for the inputs I play games on. Plus, even when it was working, for games at least, it's a bit laggy. All LCD's seem to a bit though. It's just that when I play online games, it REALLY matters and those little fractions of a second make all the difference.", "Date": "August 12, 2009"}, {"Title": "black pixels turn red", "Author": "Jeff Seldin \"bookster\"", "ReviewID": "RA04IWNR99Z3Y", "Overall": "1.0", "Content": "I recently purchased a Vizio 47\" hdtv. In less than 2 months all the black areas of the picture turned red.Vizio offered to send a repairman to my home. However, I didn't have time to wait for repairs on a 2 month old set.When I called Vizio tech support they were aware of the problem. What's up with that! Selling a TV with a know defect?Do yourself a favor and spend the extra money and get a Sony or some other brandPS I returned my set to Costco and got the Sony 46\" set. Better color picture etc", "Date": "August 9, 2009"}, {"Title": "Vizio SVT", "Author": "Efrain L. Gonzalez \"nolesfan7870\"", "ReviewID": "R279N4BHRRB5VE", "Overall": "1.0", "Content": "I purchased the SVT on Jan 6, 2009. By jan 9, the bass on the speaker had blown out and the sound was all distorted.  I returned the tv on Jan 31 for a new one and when I got it home there were two boxes one was empty and the other one had all the contents. the empty one did contain plastic bags that the contents would've come in.  Obviously this was not a new tv.  I plugged it in and about an hour later the house smelled like something was burning. Needless to say it was the tv.  The burning smell has somewhat gone down so it doesn't smell so bad but the other night as I was watching it the remote just quit working.  The only thing it will do is turn the volume up and down and mute.  I have cases open with Vizio and Costco as that is where I purchased it. Vizio is sending a new remote so we'll see how that goes.  Anyways just thought I'd put this on here and see if your experience goes better then mine.", "Date": "February 9, 2009"}, {"Title": "\"Made in the USA\"", "Author": "Crystal", "ReviewID": "R1QROPJZ0SVAEF", "Overall": "1.0", "Content": "Don't be fooled by this \"Made in the USA.\" It is assembled in Mexico. Clearly states it on the box. But, Americans are stupid and they believe everything any schmuck with a badge tells them. :) I'm sure this is a great TV. It's just probably a great TV that wasn't made in the USA.", "Date": "February 16, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Displays Resolutions up to 1080p.Includes Remote Control. High Definition with Built-In HDTV/ATSC Tuner. Video Features: Dynamic Contrast\nContrast Ratio: 6500:1. 5ms Response Time. 1920x1080 Resolution. 16:9 Widescreen Aspect Ratio\nOperational Features: V-Chip Parental Control, Operational Modes: 500 CD/M2 Brightness.3 Speakers Bottom Fixed Speakers\nOperational Modes: 500 CD/M2 Brightness.47\" Screen HDTV Television with LCD Technology\nAccessories Included: Quick Use Guide. 1 Year Warranty,24.2 lbs.", "Name": "V VIZIO - 47 LCD TV - Widescreen", "ImgURL": "http://ecx.images-amazon.com/images/I/41Qtu3PMMML._SY300_.jpg", "ProductID": "B001J17FAW"}}