{"Reviews": [{"Title": "LG 47\" LCD, 47LH40, A++", "Author": "E. Bertini", "ReviewID": "R3GC3OY2JK5F1J", "Overall": "5.0", "Content": "First thing I want to say here is that I spent 2 weeks in and out of different electronics stores, comparing technologies and brands and features to narrow down the best HDTV's in the 46-47\" range.  Of coarse the Sony Bravia was the #1, but it is over $[...].This TV came in on my #1, for it's 120Hz \"TrueMotion\" picture, and true 1080p quality. So I bought it.For three weeks now I have had the pleasure of owning this HDTV, and let me make some things straight about other reviews.1. The TrueMotion 120Hz feature is a little strange at first. What it does, is it puts a skinny Blur around the outline of an object in motion, causing that object to look LIFELIKE when it moves. This applies to people walking, trees swaying, and footballs flying. After about two days of watching, you may get used to it. I got used to it, and LOVE IT. It is now weird for me to watch other TV's without this.  However, if you do not get used to it, you can turn off the TrueMotion feature and just have a 120Hz refresh rate.2. The lip-sync. The LG TV is as smart as they come.  It will take about 4 hours of TV time for it to calibrate itself to your cable-box or satellite-receiver.  Also, depending on your HDMI cable usage, the problem can be solved by going on Amazon.com and buying a $[...] \"Digital Audio Cable\" and using that for your TV sound rather than the HDMI cord. Again though, easy fix once you get to know your TV.3. The 47LH40 has smart picture capability. Which kicks Butt. My TV Room has two great big windows directly across from this TV. By enabling the Smart Picture feature ON, it will sense the light in your room, and adjust its backlight accordingly. I do NOT get any glare, and the picture is always razor sharp!4. Little-known fact, is that LG makes the TV tuners for Samsung, Sony, Sharp, and Toshiba. So naturally, they will put the best technologies in their own TVs, making it one more reason to love LG.5. It has 4 HDMI inputs! Which means virtually every component you want to connect (PS3, XBox, DVD player, Blueray, etc...) can connect with the best HD picture.6. The 80,000 : 1 contrast ratio is deeper blacks for dark-shows and movies.  This is truly noticeable. I replaced my 4 year old Samsung 32\" HDTV with this one, and can not believe how much this actually can be noticed once you have another TV to compare it to.  My old one had 60,000:1, and deep-blacks would appear \"pixelated\"...  but any scene, day or night, a lot or a little detail, looks just as good (or better) than it would in person!Now that I have given you a few reasons to consider this TV, I just want to say that in the past 3 weeks of me owning this, it has been nothing but excellent. My TV shows have never looked more realistic... Football and (preseason) Hockey make you feel like you are in the stands! And Video Games (PS3 specifically) make you feel part of the game.  It is truly a great TV, at a great price, and I highly recommend it. Just have patience, if your lip-sync is off for the first two days, give it time to adjust, or watch the owners-CDROM they give you, you'll find out how to fix that. Everyone's cable input is different so the Tuner needs time to adjust itself.Hope this helped!", "Date": "September 21, 2009"}, {"Title": "Fantastic TV, but turn off the Trumotion", "Author": "Bret Mulvey", "ReviewID": "R2NL87AEJ9Z75O", "Overall": "4.0", "Content": "Beautiful, crystal clear, bright, high-contrast image. Nice price.I've seen people complain about strange blurring effects or unusual motion. That's the Trumotion technology--turn it off! My brother is an installer and he's heard of people returning LH40's because of this problem. Turn off Trumotion and the picture returns to normal.The Trumotion defect is easiest to spot in a scene with rough camera movements. I first noticed it in a scene inside a helicopter where the camera was kind of jumping around to show how rough the ride was. Instead of showing the correct scene, Trumotion, even on low, smoothed out the ride and it looked like the actors were just floating around the scene in a weird way. I turned off Trumotion and everything looked great.I guess Trumotion could have its uses, but it should be off by default.This TV also bleeds some backlighting out the back of the TV. In a dark room, when the scene goes dark, you may suddenly realize that the wall behind the TV is lit up. It's a little distracting because of that, but most of the time I never notice it.All the connectors are back-facing which makes it a little bit harder to wall-mount.Despite these issues it's a beautiful TV. Trumotion is easily turned off.", "Date": "May 17, 2009"}, {"Title": "Great Deal, Amazing picutre. Buy it!", "Author": "Jared Bergenstal \"JaredBSF\"", "ReviewID": "RWAQFRHYIIDAA", "Overall": "5.0", "Content": "Just purchased this TV two days ago from a local home entertainment store. Got it for $1050, a steal! Since Best Buy had it for 1079, I got the price down a little more.I did lots of research and read tons of reviews.  I was considering the Sony V5100 series and all of the Samsungs 650 series and up.  This beats both of them.  Do not listen to bad reviews about LG, none of them apply to this tv or any of LG's newer TVs, and don't compare pictures between this and other TV brands at best buy or FRYs because TV calibration can be way off at those big chain stores.I compared side by side at home entertainment stores with the Sony (way overpriced) and the Samsung 630B and 650B.  The Sony is nothing special looking on the outside and the picture doesn't blow you away.  The Samsung, you lose so much detail in the color because the screens are way too bright.  I saw side by side the Samsung's reds were so pink and its greens so bright and fake, a red flower on the LG was dark and beautiful and you could see all of its fine lines and folds...however on the Samsung it was pink and the lines and folds faded because you lost that detail.  Samsung just looks to artificial and bright for me and I don't like that.  Also the LG isn't a glossy screen so you never have to worry about light reflecting from the screen. The blacks are very nice as well, I mean it isn't an LED or plasma but the average consumer cannot tell that much anymore with LCDs becoming so good.The LG was recommended by two very good home entertainment stores over the sony and the Samsung.  It is just such a good deal and I liked the picture more, truer colors, very deep blacks and a classy look on the outside. Not to forget the speakers are much much better than the Samsungs, and the LG has the intelligent sensor which detects light in your room and adjusts the panel for how bright or dark you room is, to make picture calibration automatic and more accurate for the setting.It is a truly amazing TV for the money, I mean if you want to overspend for a SONY go ahead and if you want the top, top of the line, this obviously isn't your set but it is a damn good TV. I mean keep it for 4 or 5 years and then the next big thing LED or OLED will be out, so whats the point in spending $2K+ today when in a few years your TV will be old news.Go for the bargain and just get this TV, its an incredible set.", "Date": "July 20, 2009"}, {"Title": "Holds its own against higher rated TVs", "Author": "Chris", "ReviewID": "R2UBE9L8RJZAKS", "Overall": "5.0", "Content": "As this is our first HDTV, we did a lot of homework, both online and in stores, on 46/47 inch TVs before buying the LH40.  After our online research we were ready to buy a Panasonic G10 plasma, but after visiting many stores to look at TVs (2 Best Buys, American TV, NFM, Sears, and even slumming at Target and Walmart), a 42 inch LH40 had really caught my attention.  After finding the 47 inch version on display at Best Buy, we both decided that it performed as well at the higher-rated Panasonic G10s.  We decided whichever went on sale was the one we'd get.This TV even held its own against the awesome Samsung LED it was displayed next to.  If budget is not a concern, go with a new Samsung LED, but if you want a great 46 or 47 inch TV for close to $1000 (our specific goal) then this is the one.  I know some plasma fans still slam LCDs for color (black) accuracy and off-angle viewing, but this TV performs as well as the lauded G10 under normal lighting.", "Date": "July 9, 2009"}, {"Title": "Very good TV", "Author": "Prime", "ReviewID": "R38CBNY0O6YJ7O", "Overall": "4.0", "Content": "We just got this TV a couple of days ago, our 42\" Phillips Plasma died and the B--- B-- 4 year warranty gave us store credit for a new 42\" Plasma. After looking at the 42\" TV's my wife and I decided to go up in size. This TV has video that is better than the plasma that we replaced, has 4 HDMI ports, with one on the side which is great for hooking up video games real quick, and the HD video from my cable company is amazing. I found myself watching the third Mummy movie (horrible movie by the way) just because the picture was so great. Are there better TV's out there? Yeah, of course there are, but for the price you get great video quality and many features that some like and others don't (Truemotion). If you like watching sports in HD this is a great TV.", "Date": "October 7, 2009"}, {"Title": "A great deal - fabulous product", "Author": "anotherme \"guest\"", "ReviewID": "RYEMGQFEELTO1", "Overall": "5.0", "Content": "I was so impressed with the Amazon service on this, Free Delivery included complete setup and install. I am currently using this with regular cable signal and it is great! Just use the setting to let the TV choose the view by program. Eventually I will go to HD cable, but need to get an HD tivo first, so this is great. Without HD input, it doesn't use the whole screen, but it is still huge. Very clear picture and easy to use setup screens.", "Date": "November 3, 2009"}, {"Title": "A Real Beauty", "Author": "Kateyras", "ReviewID": "R21MS9GX2MT48O", "Overall": "5.0", "Content": "This is a beautiful TV.  Anyone who said it looked \"cheaply made\" must be looking at another TV, because this one is gorgeous.  The frame is absolutely the prettiest out there.  The set up couldn't be easier and the picture is beautiful too.  I also got an LG Blu Ray player and watched Master and Commander and Transformers the first day and refused - refused - to even consider returning this unit.  The sound is good too.  We have Home theatre and have not even bothered to turn it on most of the time, the sound from the TV is that good.  If you want an over 40\" with a matte screen, it is LG or Sony.  the Sony was $500 more and absolutely not worth it.  This LG has a better picture, plenty of connections, good sound and is much prettier to look at than the Sony.", "Date": "December 29, 2009"}, {"Title": "Fantastic LG & Amazon Experience", "Author": "Webhead", "ReviewID": "R22DVPU0ES0UK7", "Overall": "5.0", "Content": "OK, so I reviewed TVs for months until my eyeballs were about to fall out of my head.  Our old 90s Toshiba Theaterview projection TV was about to bite the dust for the fourth time.  I had decided not to have it repaired again, but to replace it with an LCD of comparable size.  Finally I decided on either Sony or Samsung and was leaning heavily toward Samsung.  Samsung had great reviews, BUT I saw many reviews where customers' brand new TVs just died.  As I read more I discovered Samsung had a power supply problem and that the repair process was so agonizing that some customers just bought new TVs.  That turned me away from the Samsung brand to the Sony.  I was just about to commit when I accidentally stumbled on the LH series by LG.  I was impressed with the reviews and the specs were amazing.  Once I saw the Amazon price for the 47\" I knew I had found my TV.  I'd like to mention quickly that Amazon and CEVA were awesome.  TV was scheduled for the 29th and I got it Christmas Eve morning!  CEVA was great with phone calls and the delivery guy was extremely courteous and timely.  The TV?  Superb...  I'd put this TV up against any Sony or Samsung.  Picture quality is stunning, especially through our new Sony Blu-ray player.  Even our standard Dish channels look great on this TV.  I was surprised as I had been told standard channels would look awful on an HD television.  The control options built into the unit are very nice and easy to use.  In my opinion the sound is also very nice for built-in speakers.  The quality is crisp, clear, and the surround sound mode is impressive.  I've only had this TV for 6 days, but so far I would recommend it to anyone.  Great job LG, Amazon, and CEVA!UPDATE 11-25-2010:Still a fantastic TV after 11 months.  We've enjoyed everything about it.  When I bought this for the family last Christmas I also got a Sony Blu-ray player.  DVD and Blu-rays look great and we stream NetFlix through the player as well.  Yes, the NetFlix movies look great too.  I have been very impressed and pleased with this TV.", "Date": "December 29, 2009"}, {"Title": "Best large TV for the money.", "Author": "Gwen Sands \"Nita\"", "ReviewID": "R2I4PEIN0G7JJB", "Overall": "5.0", "Content": "Great picture. Delivery people set-up in a matter of minutes. Saw this size TV at Best Buy, Handy TV, Sears and Wal-Mart. Amazon beat their price by $350.00 and up. No shipping or handling fee.", "Date": "October 26, 2009"}, {"Title": "Great TV and value", "Author": "B. Zerangue", "ReviewID": "R3VYCRP1EBH99Q", "Overall": "5.0", "Content": "This TV looks great and the picture is sharp and clear.  Good price. I do notice some lip sync delay at times but the problem may be that I have't learned how to adjust everything correctly.Amazon delivered as promised, no shipping and on time.  I have recommended Amazon to all my friends.", "Date": "October 15, 2009"}, {"Title": "WOWOWOWOWOWOW", "Author": "Blu-estLight \"MyEnglishIsGood\"", "ReviewID": "R2CLKDZ4A9LSOT", "Overall": "5.0", "Content": "This TV is really awesome. Great price miught I say first. $1099.99. That's a steal when looking at the comparable models. What sold me on this TV was when I saw it handle Transformers BLU-RAY. Man-oh-man... it was crazy nice. These compare well tot he higher end Samsung Models.APPEARANCE- The TV is stylish, and I really like how slim it is, and also the framing on the TV. Its a nice glossy and elegeant design. The LED power button gives a little accent of color on the bottom right which looks nice.Construction Quality- No complaints here. Everything looks awesome. It was super-easy to mount it on the wall.. and I gues its gonig to be hanging there for a  few years. SO EXCITED!!!Ease of USE - Controls are great. A nice remote. Easy to set up. The ports in the back are very easy to  distinguish.Picture Quality - The picture really is top notch. I've had another SONY 1080P 40 inch TV, but this one seems to be better. I think its the 80,000:1 contrast ratio and 120hz. I couldn't be more pleasedSound Quality - I'm not going to dock anything really. I don't use the sound form the TV because I have speakers. Through mys peakers, the sound is AWESOME!Connectivity - Easy to attach stereo cords and device cords. 3 HDMI slots!! Wow, cable, PS3 amd BOX hooked up all at the same time? What could be better?FINAL:I don't really see any cons with this tv.. I have to say I'm impressed.", "Date": "September 25, 2009"}, {"Title": "Great TV but does have the lip synch issue", "Author": "toolivestew", "ReviewID": "R2CVD2NLKJR81C", "Overall": "4.0", "Content": "I did see some reviews that mentioned a lip synch issue (sound and picture not perfectly synched), but they were so few that I took a chance. THIS TV DOES HAVE A LIP SYNCH ISSUE. The difference between the picture and sound went from barely noticable to maybe .25 second delay of the sound. I hooked my Comcast cable box up to my home receiver via an optical audio cable and didn't have the issue when listening through my home theater system.I called LG customer support and they acknowledged that this TV has a lip synch issue when using an HDMI cable. They put me in touch with a local technical service and they were at my house within 3 days to update the firmware on the TV. Now that the firmware is updated the issue is resolved.Now that the issue is resolved I love this TV. The picture is great. When first powering the TV on, the picture looked kind of wierd. I had read reviews indicating that the \"Tru Motion\" can make the picture look strange. I turned that off and the picture looked better. I couldn't be happier with the picture on this TV - espescially for the price.The sound of this TV is about what you would expect. Nothing special, but definitely adequate.I also like the Matte finish of the screen. I have windows directly across from the TV and there is absolutely no glare.I would recommend this TV to anyone with the disclaimer that they should expect to either run the audio through a home theater system or expect to work with Customer Service to get the firmware update to fix the lip synch issue.", "Date": "February 27, 2010"}, {"Title": "1 year after purchase, TV seemed to be failing; now working again", "Author": "C. Quinn", "ReviewID": "R3KTJNY3KRA4QD", "Overall": "3.0", "Content": "If I had reviewed this TV a month ago, it would have been a five star review.  The picture quality is magnificent, commecting up peripherals is a snap, the sound is great- all in all I was extremely happy with this purchase from March 2010.Right up until 3 weeks ago when the TV started turning itself on and for no apparent reason.  Sometimes the problem doesn't appear for hours, sometimes the TV turns on and off 10 times in an hour.  The problem began when the TV was 2 weeks out of warranty, and though I have tried the solution suggestions found online, nothing has helped.  Googling the problem reveals this is has been an issue with LG TVs for years, yet LG can't provide any guidance on what to do other than to replace the TV.  Call me crazy, but I think a $1000 TV should last more than 12 months.I'll never buy another LG again- great picture is only useful when the TV stays on for the duration of a sitcom.update from June 2013: So after all the problems, I relegated this TV to the spare room for months where it almost never saw use.  Now it has seemingly fixed itself and no longer turns on and off spontaneously.  No explanation for the improvement because I didn't do anything to fix the problem.  Upgraded to 3 stars since the TV is working again.", "Date": "April 14, 2011"}, {"Title": "No Ordinary \"Entry Level\" HDTV", "Author": "Leif Sheppard", "ReviewID": "RA109C6S9IPDH", "Overall": "5.0", "Content": "To begin with, though I'm an ardent film collector, this LG television is my first foray into the HDTV market. It's replacing a 27\" RCA CRT, a six year old television that still functions perfectly. However, after finally aquiring a PS3 Slim and attempting to get into gaming, I found my poor CRT was simply out of its league. Also, now that many Blu-Ray prices are dropping (particularly on older titles), I thought it'd be great to have a system capable of handling proper Blu-Ray transfers of favorite films like \"The Road Warrior\", \"Outland\", and \"Barry Lyndon\" (all of which never had a proper restoration on DVD, and two of which are sadly still unavailable on Blu).For those who have no idea where to begin understanding what to look for in a HDTV, CNET is an invaluable research resource. Their in-depth reviews of various models are some of the most helpful out there (though they do not have one for this particular unit). Also of interest are their articles that explain in detail what difference certain features make and what HDMI cable you should buy (seriously, don't spend more than $10). After doing my due diligence, I decided this LG model struck the absolute best balance between low price, huge screen size, and abundance of higher-end specs.Setup was a breeze, all that's required is a screwdriver to screw in the included base. I was able to install the base and setup the TV myself, but considering this unit weighs around sixty pounds you may want someone else to assist (the delivery driver will usually help). Then it's just a simple matter of plug-and-play. There's also a cover for the bottom stand hole in case your unit will be wall-mounted. The menus are very user-friendly and easy to navigate, and there's even instructions included directly on the TV. There is a small setup booklet included, but the bulk of the manual is on an Abobe Acrobat file in the included CD-ROM. No issues with the remote either, the buttons are nice sized and well mapped-out.A fatal error many frugal yet selective television consumers make is buying a cheaper entry-level HDTV like this and expecting it to somehow perform like a $3500 plasma unit. It's just not going to happen. However, considering the gorgeous picture on this model and the relatively low price tag, it's difficult to justify paying more for a \"better\" LCD or a potentially problematic plasma. For instance, I considered some of the new LED LCD models, many of which offer a refresh rate of 240. But I simply couldn't make a discernable distinction when compared to this model (which has a rate of 120), and the image simply wasn't impressive enough to warrant the massive price tag.The Blu-Rays I've tested (which included \"Quantum of Solace\", \"Mongol: The Rise of Genghis Khan\", \"The Phantom\", and \"Glory\") all looked - in a word - incredible. The sheen of clarity on each print was jaw-dropping (though \"Glory\" has a good deal of grain still present). DVDs look great as well, just not as sharp as Blu-Rays. My wife and I spent an entire Saturday going through the extended edition DVDs of the \"Lord of the Rings\" trilogy on this model, and I simply have no complaints to report. The screen is large enough to provide a cinematic effect (especially in a bedroom), the movement onscreen was fluid, and the colors leaped off the screen. Even a series like \"Battlestar Galactica\", where the picture was intentionally degraded to give it a 'grittier' feel, looks gorgeous on plain-jane DVD.The TruMotion feature isn't the failed experiment so many reviewers claim it to be. Under the correct circumstances, such as a high definition NFL game, the effect works wonderfully. Films, however, aren't quite built for this sort of thing. The TruMotion feature effectively removes the atmospheric sheen on the film print to the extent that it causes certain scenes to look amateurish, as if shot on home video. It's difficult to explain without example, but if you visit a floor model at a local store, many retailers will let customers toggle with the settings.Also, regarding the infamous \"lip synch\" issue, I've watched hours of cable in addition to multiple DVD and Blu-Rays and I haven't had a single problem. My model was manufactured in February 2010, so it's possible they've updated the firmware on the latest models. In fact, I really can't find any serious faults with this model, it's as if this unit was made specifically for my needs. Perhaps the greatest compliment I can pay to this model is to say that I don't feel as if I bought an \"entry level\" television. For now, it's five well-earned stars, I'll update later if any issues arise.", "Date": "March 3, 2010"}, {"Title": "LG TV should be a top consideration for LCD shoppers", "Author": "Misanthrope™", "ReviewID": "R3F1BJKQX5365D", "Overall": "5.0", "Content": "I got this TV for my bedroom, mainly because I got the LG 55LH40 55- Inch 1080p 120Hz LCD HDTV, Gloss Black for the living room, and it was awesome.Both TVs have a beautiful picture, and the sound is fine (to me) without attaching a surround sound system. I think I'm going with LG products on TV's and Blu-ray players for the foreseeable future, as the quality appears to excellent. Hopefully, they won't become like Sony and after many years let everything go to pot. I can't bring myself to buy anything Sony anymore, with all the products that I've had by them more recently that fell apart far too soon.Just a word about the delivery if bought through Amazon -- it was a wonderful experience with the first one, the 55 inch. I was able to schedule a delivery time range, and when they brought it, they took everything out of the box, set it up, and took all the trash away, so no TV box out for trash pickup advertising to everyone what we got. However, on the 47 inch, it was a one-man job through a different delivery service, Pilot, and it was not white-glove -- he just left it with us inside the door. Regardless, I would buy a TV from Amazon again in a heartbeat, if I need one. The savings is too good, with prices better than local and no tax usually.I would also suggest the LG BD 370 Network Blu-ray Disc Player for those in the market for a Blu-ray player, especially with Netflix streaming.", "Date": "March 1, 2010"}, {"Title": "Great LG Television!", "Author": "Kenneth Marcum \"Harley Man\"", "ReviewID": "R1JVFUICUUIYIS", "Overall": "5.0", "Content": "We have three LG televisions in our home, and have nothing bad to say about any of them.  This 47inch has wonderful sound and great picture quality.  When connected to a blu-Ray player and a surround system, you almost feel like your in the theater!  Grab some popcorn and enjoy the show!Never buy anything on the judgment of one reviewer. As with all my reviews, the above is only my opinion or observation of an item that I own or have tested. Consider that it is possible that I may have either purchased/tested a faulty unit or an exceptionally good one. Your experience may differ from mine, better or worse. Paying attention to the up or down trend from several reviewers will help you make an educated decision on whether or not the item is for you.Best of Luck!!", "Date": "January 7, 2012"}, {"Title": "A GREAT  TV !!", "Author": "Joyce", "ReviewID": "R8Y697NGYRJ8A", "Overall": "4.0", "Content": "This was a gift for my husband.  However we both get to enjoy it. There is a clear picture from any angle.  We enjoy watching the Discovery and National Geo. and everything just comes alive on the screen.  Beautiful!!", "Date": "August 27, 2010"}, {"Title": "Great quality and price.", "Author": "wlee", "ReviewID": "R2G7TPTAL1RFIJ", "Overall": "5.0", "Content": "I've owned this for about 8 months and everything has been great. The only complaint would be the built in speaker sound is weak but I guess it is the case with all flat panel TVs. You would need an external speaker system if you want a decent sound quality but I mainly watch TV shows over the air so it is (barely) fine for me.", "Date": "June 26, 2010"}, {"Title": "47\" LCD LG 47LH40 -- Screen Issues", "Author": "Ian P. Blunt", "ReviewID": "R3IEOXNGK5REQZ", "Overall": "4.0", "Content": "Ordered from Amazon.com on 7 April, was delivered on the 14th. \"White-glove\" installation team unpacked the TV, mounted on it's stand, connected all the cables, and took the packing material away. A+ on delivery. That being said, once the TV was in place and powered on, the left half of the screen was very gray and bright, while the right half was perfect. In addition, the left side had significant \"ghosting\". I called LG support, who ran through a number of suggestions, including unplugging, holding the power button for 30 seconds, re-calibrating, all to no avail. LG contacted a local technician, who promptly called, listened to the symptoms, and promptly told me that I would likely be better off just returning this for another TV, although they'll still send someone out to inspect next week. 4 out of 5, however, as otherwise, the TV installed and configured very easily, and all features appear to be as advertised. I look forward to having a functioning unit to enjoy.", "Date": "April 14, 2010"}, {"Title": "Awsome LG TV", "Author": "Jefferson T. Edgerton \"Jeff Edge\"", "ReviewID": "RQC39D4EPBKVX", "Overall": "4.0", "Content": "This is my first LCD Tv but I have owned a Sony Vega HD for several years. This one is mounted over the fireplace and I could not ask for a better picture. Yes you get a little edge issue when the room is completely dark but that was expected due to the reviews that I had read. It is a must to turn off the Motion technolgy. Great buy!", "Date": "March 11, 2010"}, {"Title": "Everything it says it is!!!!!", "Author": "Rockford A. Holliday \"rockman\"", "ReviewID": "RDU8AEC00COX6", "Overall": "5.0", "Content": "I read reviews, visited a couple of electronic/appliance stores (to pick the minds of sales people), and talked to people who had purchased TV's prior to making my selection and am completly satisfied with my decision to purchase this product.(LG 47LH40 47Inch 1080p 120Hz LCD HDTV)  At first I was skeptical about the purchase of such a large electronic item on-line but Amazon.com took care of delivery and it worked fine when it was hooked up. Never had to make any adjustments, picture clarity was perfect, and the sound was better than expected. (Although my next purchase will be a theater suround system)  I have 2 daughters who are waiting for tax checks so they can but the same thing. Such a mesmerising picture I find myself only looking for HD channels to watch.", "Date": "February 21, 2010"}, {"Title": "Our first flat screen", "Author": "Mikes Cycle Shop Inc. \"mtn\"", "ReviewID": "R37A0SXP8Y5TH9", "Overall": "5.0", "Content": "I am not a tv expert ,but I have not found anything to complain about on this product.", "Date": "February 6, 2010"}, {"Title": "Lip Sync problem persists", "Author": "Glenn M. Welt \"Glenn Welt\"", "ReviewID": "R2H1VK1RK52IO6", "Overall": "3.0", "Content": "Freinds call me a gadget Guru because I attend every CES Show and constantly update to latest technologies. Like other reviewers, I spent time comparing all plasma, LCD and LED flat screens in the 46-47\" category, 60Hz to 240hz, $700 to $3000. On January 31, 2010, I chose the LG 47LH40 at Frys and believe it still has the best picture of any under $2200 available today. Unfortunately, the audio sync problem is real.Initially, everything worked perfectly with my connection to Cox Cable. I hooked audio to my Philips Home Theatre System with a digital audio cable connected through a convertor because my Philips HTS only has an Coax audio input. The convertor worked fine with my former Samsung DLP. After a few hours of TV watching, I started noticing that perfectly synced sound would start to slowly change until the sound from the TV became very different from Home Theatre System. Thinking it might be a problem with my Philips HTS or the digital/coax convertor, I changed the home theatre system to a Samsung with a digital audio input. Same sync problem persisted. I even tried changing digital cables.After 2 weeks of frustation and no success with the annoying audio issues, I returned this TV.", "Date": "February 13, 2010"}, {"Title": "Exelent", "Author": "Guadalupe", "ReviewID": "R3B8WE14YZALP3", "Overall": "5.0", "Content": "this TV is a perfec for play on X360 or Ps3 the image is beautiful", "Date": "January 30, 2010"}, {"Title": "Lip Synch Problem", "Author": "David S \"David\"", "ReviewID": "R2ZSA3USISEII9", "Overall": "1.0", "Content": "Had this TV for 20 days before returning it for a Samsung LED and then returning that for a Sony XBR.  The LG has some real lip synch problems (go to Best Buy's site if you want to see more).  When watching HD channels the voice would come a split second after the lips moved.  When I brought the TV back to Best Buy there was no argument.  The three associates I dealt with all mentioned that many of the LG's were being brought back for the same issue.  They did mention that there may be an update through LG but I was not going to keep a TV with known problems that I would try and update through a USB.  Stay clear of the LG LCDS until this is fixed in my opnion.", "Date": "September 8, 2009"}, {"Title": "my new tv", "Author": "T. Czuppon", "ReviewID": "R1IU436SLPW2WB", "Overall": "5.0", "Content": "The tv arrived into the city in which I live in 4 days prior to my picking it up.  I received notification from the delivery company nearly 10 days after they received it.  Had I waited for the delivery company to deliver it, it would have should up at my house at least two weeks after the delivery company received it which would have made it a week late from the date received from amazon.  I realize it is a busy time, however, the delivery company needs to contact customers sooner and more effectively.  A post card in the mail is not what I would call an effective notification method.", "Date": "February 3, 2010"}, {"Title": "It needs immidiate FW fix- but after the fix it works.", "Author": "Z. Unger", "ReviewID": "R1M3GFYXL42PND", "Overall": "4.0", "Content": "UPDATE:The fix solved the problem. now it's working great.-----------------------------------------------------The TV was great, I thought I did a great deal!But then at the 2nd day I connected it to HDMI to see HD, and the lips sync issue that I saw in other reviews appeared...I called LG service which told me loud and clear- we have a problem with this TV, we need to do a FW update, and you have to wait at home for our technician to arrive.Does it still sound like a great deal?(Regarding the technical issue- I will update you once the technician will arrive...)", "Date": "November 3, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "LCD HDTV features an elegant & distinctive design with swivel stand\n1080p Full HD resolution 1920 x 1080p Trumotion 120Hz panel for clear smooth images even for fast action scenes with 4x HDMI v 1.3 digital inputs\nIntelligent Sensor Mode LG's Smart Energy Saving Technology, Energy Star 3.0 compliant\nInvisible speaker system with Dolby Digital 5.1 & Clear voice for richer more balanced sound & a polished look\n70,000:1 Dynamic contrast ratio", "Name": "LG 47LH40 47-Inch 1080p 120 Hz LCD HDTV, Gloss Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41T0thnyYJL._SX300_.jpg", "ProductID": "B001VKYAKE"}}