{"Reviews": [{"Title": "Great HD has never been so easy", "Author": "Daniel Limbach \"Reader, writer, gadget guy\"", "ReviewID": "R1SBRVLCIFF9KX", "Overall": "5.0", "Content": "I've been researching 40-42\" HD TVs for months, looking for the ideal match for my needs that fit my budget of under $1,000. I looked at plasmas, 120Hz LCDs, 40\", 42\", Sharp, Sony, Panasonic, Samsung, Vizio, Westinghouse, and LG.I finally found it - on sale for almost two-hundred off (exactly eight-hundred-and-nine dollars). Would still be a great value at a thousand dollars.I'd rather have too much control than too little with my electronics. The 42LH30 delivers all the control I want and more, but it also provides several nice presets for the type of content I'm watching (movies, sports, games, standard). It also lets me build 2 presets myself for exactly what I want. I can be picky or I can be lazy and still get a great picture for any situation.The 50,000 dynamic contract ratio and 5ms refresh speed make for a superb picture/performance combo.I was very close to going with a 120Hz 42\" Vizio. They have been getting decent reviews. When the LG 42lh30 went on sale, it was a deal I could not refuse.Some things I really like.1) Outstanding picture (no compromises with colors)2) Great performance (sports and movies don't judder at all so far)3) Energy Star (several low power modes - I love flexibility)4) Lighter than most (easy to hang on wall - I use an articulating arm)5) Anti-glare awesomeness (I have lots of windows in my 3-seasons room)6) Outstanding PC screen (when I just have to surf on the 42\")7) Upconverting DVDs look phenomenal (blu-ray player is next purchase)8) Sound is more than acceptable on TV (I usually output audio to my Home Theater system if I will be watching for more than a few minutes)Things I would change:1) Only 3 HDMI ports (Fine for me now with cable box, DVD player, and PC)2) I'd prefer a matte black bezel instead of a gloss finish3) Maybe add an SD-card reader (my DVD player has SD and USB reader, fortunately)", "Date": "June 1, 2009"}, {"Title": "Lip Sync problem fixed", "Author": "Gweff", "ReviewID": "R12NJGB2TB9AC", "Overall": "4.0", "Content": "Overall a great TV.  I had bought a samsung, but it was too thick for my taste.  I did notice the \"lip sync\" problem when using the TV's speakers to watch TV.  This is a problem with how the TV gets the digital input from the Dish DVR that I am using.  The fix is to hold the MENU button on TV (on Left side of TV) at the same pushing the MENU button on the the remote control.  Then enter \"0000\" for the code.  This will access the system menu.  Go down to \"Lip Sync\" and adjust the number up or down till the lip movements matches the sound coming out of the speakers.", "Date": "September 4, 2009"}, {"Title": "Excellent HDTV", "Author": "Ken", "ReviewID": "R1U52MXYVTQ5WS", "Overall": "5.0", "Content": "I have had this TV for about four months now and I am very happy with my purchase.I actually ordered the LG 42LG50 (through Amazon from TigerDirect) but they must have run out of them because they sent me the better LG 42LH30.Excellent color, great response (for a 60Hz), SD signals (VCR) look surprisingly good, the menus are intuitive, the remote is laid out very well, and it has a great overall look.The only down side that I wasn't expecting is that it has no analog audio out (no RCA L/R out) so you'll have to have a digital receiver if you want run the sound through external speakers.", "Date": "August 16, 2009"}, {"Title": "Excellent TV Compared to the Competition. . . .", "Author": "C. C. Mantis \"Exposed\"", "ReviewID": "R27GU6UNJU2J25", "Overall": "5.0", "Content": "Have been searching for a nice 42\" LCD 1080 and ran across this one. Compared to the competition LG seems to more than hold it's own, plus the price point is excellent. Other reviews share the good points so I won't go into them only to mention that I found this to be the best 'bang for the buck' in 1080 LCD 42\" TV. While LG is not yet considered a major brand in America, I purchased many LG products when I lived in Thailand in 2005.I found them to be excellent products then and still do now. Overseas LG sells all sorts of products. One could almost say it's the GE of Asia - except LG TV's are superior to any GE product - by a huge margin.I also have a 50\" Panasonic Plasma that I purchased a couple years ago when that model was rated #1 by Consumer Reports. This LG has a superior picture and is perfect for what I need it for.If you buy one - you'll be happy.", "Date": "December 9, 2009"}, {"Title": "My love for this LG", "Author": "Angela Floyd \"that wasn't a question\"", "ReviewID": "R1AFZCHA5RCZT2", "Overall": "5.0", "Content": "I am a woman, a gamer, and a movie fanatic. I asked my husband 6 months ago for my own lcd tv right after I got my xbox 360. I spent the weekend in awe. We have a 46 Sony Bravia (changed the inches since someone felt the need to correct it, LOL) in the family room and in my opinion it doesn't compare to my 42 LG. The features are user friendly and the HDMI cable just enhanced every feature about it. My movies were crisp and clear. I would recommend this tv above all else and the price was excellent. I wanted the 120hz because I thought I would have to worry about ghosting while gaming but this tv did not disappoint and I saved a couple hundred bucks. I searched and researched and searched again for a tv and I am happy with my choice. Extremely happy. I just need to wait patiently for Ghost Recon:The Future Soldier to come out and it would make it complete. For now, I'll just sit back and keep playing COD:MW2. Thanks LG.", "Date": "February 15, 2010"}, {"Title": "Very nice LCD TV", "Author": "Joel B. Schwartz", "ReviewID": "R3J7J7NYOAZBJH", "Overall": "5.0", "Content": "Great set with very good picture quality. Lots of HDMI inputs but be aware there are no S video inputs. Only becomes an issue if you are trying to connect older components. There isn't any speaker outputs either. You can still run sound through your stereo by picking up sound output off your DVD or Bluray player directly.", "Date": "November 1, 2009"}, {"Title": "Amazing TV for the Price", "Author": "Michael Krynski", "ReviewID": "R3U22T9OJ3B4DN", "Overall": "5.0", "Content": "I bought this TV for a little over $800 and it has been worth every penny. The picture is crisp and the response time for sports is superb. This TV also has great built-in sound. I was thinking about buying a surround sound system to go with this TV, but there's really no need.The only CON I can think of is that sometimes I hear a buzzing sound when the TV has been on awhile and a lot of white is displayed. But it's hardly a problem, since it only occurs rarely.I'd definitely recommend this for anyone.", "Date": "May 24, 2009"}, {"Title": "Easy Set-up - great picture & sound", "Author": "Chris Honcik", "ReviewID": "R2S7JK344JIZ0F", "Overall": "5.0", "Content": "We bought this for my dad, who is 76 and not great with all things technical.  He unpacked it and set it up all alone with only the help of the enclosed instructions.  I had a chance to see it the past weekend and the picture and sound are super.  We have not tried a BD player attached to it yet, but for TV watching and DVD's it has a great picture and plenty of sound volume for my dad.  The 3 HDMI ports are more than he will ever need.  We do not have the unit attached to cable or satellite, and the tuner in this TV works fine with the signal from an antenna.", "Date": "March 15, 2010"}, {"Title": "lovin it", "Author": "M. Sulkey \"stoked@home\"", "ReviewID": "R2ACGJ6LKX5N04", "Overall": "5.0", "Content": "I've had this tv for two weeks now and i'm really enjoying it. I spent a lot of time researching this lg and other tvs. After weighing the pros and cons and figuring the budget it would have been silly to not have made this purchase. For $200 more I would have gotten the 120 hz. I strongly recommend this tube you will be extremely happy. I was also happy with datavision and the delivery. All was quick, good condition and lots of communication.", "Date": "March 11, 2010"}, {"Title": "lg dose things right!!", "Author": "Chris L. Ashworth", "ReviewID": "R20EKKKJLLULUF", "Overall": "5.0", "Content": "LG has Again done it right. There's only one Thing wrong with this TV, the sound.It's tinny and dose not handle Bass very well at all. Other than that this TV is excellent!", "Date": "March 5, 2010"}, {"Title": "Great TV, Great Sound!", "Author": "Techie_h \"Techie_h\"", "ReviewID": "R1QFZ0564IUZ6V", "Overall": "5.0", "Content": "I did not buy the TV from Amazon, but from Fry's. I got it with an LG BD370 Blu-Ray Player. The video quality is just amazing! This TV comes with SRS Trusurround, and Clear Voice II, which for some odd reason is not active by default. You will need to enable it manually from the menu. I got a pretty high end HDMI cable from Monster(which I think is not really a great deal - I did not want to wait for a cable by ordering online), and the quality is just awesome! I love the TV, enjoy it with a Blu Ray or with PS3/XBOX(no Blu Ray on this though)!", "Date": "February 21, 2010"}, {"Title": "Great Buy", "Author": "E. Simmons", "ReviewID": "R2TDJ2ECXNPZ2", "Overall": "5.0", "Content": "I Love this TV. I got the 42LH30 on sale at Frys for 499. This was almost 300 less than other retailers. All of the features are great. The set up is easy and the ease of mounting made this a great buy. I recommend this to everyone.", "Date": "January 31, 2010"}, {"Title": "Great HDTV and Great Price!!", "Author": "Jeffrey Smith", "ReviewID": "R3Q2PWU10HTR1E", "Overall": "5.0", "Content": "Purchased this TV 2 days ago and it has a brilliant 1080p picture.  Works great with out Blu-Ray player also.  Purchased at hhgregg for only $649.97!!  It really pays to shop around for the best deal.", "Date": "August 30, 2009"}, {"Title": "Great easy-to use LCD TV and I'm the first to get it!", "Author": "George J. Walters \"Walvestor\"", "ReviewID": "R17TF0XCH51QOD", "Overall": "5.0", "Content": "I searched Amazon and the internet to find something new in LCD TV's. You can't get much newer on March 23rd (date of this review) than a March 17th intro date. This is my first LCD TV and it was easy to set up... just plug it in and go. Or be adventurious and hit the menu button and tweek it to you own liking.The 50,000:1 contrast ratio is the best for any LCD now on the market. It also has a built-in  speakerless surrond-sound system (part of the LCD frame) No one but LG has that yet.", "Date": "March 23, 2009"}, {"Title": "A Cloud in Mid-Screen", "Author": "Eddie Diaz", "ReviewID": "R3N9KY3G401H6V", "Overall": "2.0", "Content": "I'm here waiting for UPS to pick up my LG 42\" 300 which I took out of the box just three days ago. As soon as I turn it on, I noticed a cloudy area in the screen, about 3/4 length and 1/4 area of the screen. This was easiest to see just as the Tv was turned on for that second or two before it finds the channel. When I had something on with bright colors, I really didn't notice any difference, but when the colors were dark, or when I turned on a black and white movie the cloud was quite visible. I called LG directly who informed me that their were no LG technicians available and worse, didn't know when one would be avaiable. The advice was just to return the set to the store. I suppose this is the best advice because I had just gotten it and there were problems already, but I was surprised that LG wouldn't want to keep a TV that was already in my home from being returned to the store and ultimately (I suppose) to them. I was willing for a techinician to take a look at it because I liked the picture quality at those times when the cloud was not noticeable. I don't think I want to take the chance of getting another LG and will order another brand instead.", "Date": "March 29, 2010"}, {"Title": "Loving it!", "Author": "A. Wood \"luvromance\"", "ReviewID": "RQ3KAXF5PWP0A", "Overall": "5.0", "Content": "First off, the chart with the specifics is a bit off, this tv does offer simplink, and I love it.  Hook it up to the blu ray dvd with the hdmi cable, and turn the tv on, the blu ray goes on, or vice versa.  Tv also recognize the input when it's on and it will go to that input for the most part.Awesome picture, the color is amazing and bright.  Audio is great too.  I've had this for a few weeks and I have no complaints. I love the design on this as well.  I'd recommend this to anyone.  Even though, I got a great deal, I'd get this again if it was at regular price.  When compared to other brands for this size and the 1080p, this came out the winner.I'll have to say with comparing blu ray dvd and regular dvd, the detail is a bit more, along with audio, but playing a regular dvd is just as great.More than enough inputs, so that's another plus.  My only disappointment is that this does not offer a S video input, however it does have the old fashioned monitor 15 pn input.  However, getting a blu-ray dvd player that plays divx was a good solution, so I'm happy either way.I highly recommend this tv ;o)Also, if you will be using a wall mount, i went with a tilt wall mount, I was happy to see that there is still room for me to move it so that I can reach the inputs if i need to add cables to it.", "Date": "March 22, 2010"}, {"Title": "Couldn't have asked for more", "Author": "Patrick Healy", "ReviewID": "R28LTD36GWO9O9", "Overall": "5.0", "Content": "This TV was a great price at the time of purchase and delivers a beautiful picture. The HDMI-5 ports worked wonderfully and I've used ever connecter on the back of this thing. I really love this tv even though 42\" isn't very big by standards now. The only thing I would change is that the remote is a little tough to respond and the sensor could have been on the tip of the tv vs the bottom but I'm not going to split hairs. My next TV will be an LG.", "Date": "August 4, 2013"}, {"Title": "LCD DE BUENA CALIDAD", "Author": "Leonardo Gonzalez \"LEON\"", "ReviewID": "R34IBHWRU6CL39", "Overall": "4.0", "Content": "COMPRAMOS UNO DE ESTE TIPO EN LA TIENDA LG DEL SAMBIL CARACAS EN ENERO DE 2011, ESTABA A BUEN PRECIO DEBIDO A QUE HAY UNA NUEVA LINEA MAS MODERNA, TIENE BUENA CALIDAD Y CAPACIDAD DE CONECTAR TU PC, HOME THEATRE, ETC. SI QUIERES UN TV GRANDE CON ACEPTABLE CALIDAD Y NO QUIERES GASTAR MUCHO DINERO ESTA ES TU OPCION EN LCD, SI DISPONES DE ALGO MÁS DE DINERO PUEDES ADQUIRIR ALGO DE MEJOR CALIDAD INCLUSO DE LA MISMA MARCA, PERO NO TE DECEPCINARÁ PORQUE TIENE BUENA CALIDAD.", "Date": "May 4, 2011"}, {"Title": "Not one regret.... I love it", "Author": "Craig", "ReviewID": "R2PCXH645DV6X2", "Overall": "5.0", "Content": "I've had this tv for over a year now and it still works like I just got it out the box, I LOVE everything about this tv, the picture and sound is great. I'm a gamer so i mainly use it for my 360 and PS3 slim, I play for marathon sessions and not one hiccup yet. The gloss black finish on the tv matches my stand and consoles as well as the LG blu ray player I have. No I'm not an LG spokesperson but I swear by their products. I've never had anything made by LG go wrong, I definitely recommend this TV", "Date": "May 3, 2011"}, {"Title": "Great TV, Great Price", "Author": "atmess", "ReviewID": "R28BN7C22JPPJ2", "Overall": "5.0", "Content": "Couldn't be happier with a TV! Great TV & a great price to go with it!", "Date": "September 24, 2010"}, {"Title": "Great buy", "Author": "Michael C. Heiber", "ReviewID": "R2V3FR0IA8D1ZZ", "Overall": "5.0", "Content": "I got this TV at a great price and I am very happy with my purchase.  This is my first HDTV and from what I can tell the picture is great. The sound from it won't be suitable for people into home theater, but those people should get a home theater surround system anyway.  I mainly watch sports on it and it has worked great for the NHL playoffs this season!", "Date": "May 19, 2010"}, {"Title": "John M", "Author": "John H. Mcdonald", "ReviewID": "R32WK7WDPCO7NU", "Overall": "3.0", "Content": "The TV is fine, my issue is with the manual, it does not even mention the remote control.  the DVD that comes with the TV is just like the written manual nothing special in it.  I am not sure why they even provide a DVD. The remote has features that are just not understandable and the on screen set ups does not address the remote.  Another thing that I don't understand is in the set up it goes thru a clock set up even to include day light saving time but a clock/time never appears on the screen.  It does have a feature to automatically turn on and off, so I guess that is what the clock is all about, but auto on and off is not important to me.  I bought the LG because of the name.  I previously had a 42\" Philips and had no problems but in looking at reviews many people did have problems with the new 42\" Philips so I decided to pay more money for the LG.  At this point I am not sure if it is better or not than a Philips.", "Date": "May 4, 2010"}, {"Title": "Great TV Great Value", "Author": "Siobhan Aller", "ReviewID": "R3K7Z77XIH553A", "Overall": "5.0", "Content": "This television is awesome. It was incredibly easy to set up right out of the box. I do not know a lot about electroncs and i was able to set it up and connect DVD and video games with ease. The picture is fantastic clear and crisp and great color. I am very happy with my purchase and am estatic about the great price.", "Date": "April 5, 2010"}, {"Title": "its a great tv", "Author": "bct1009", "ReviewID": "R1Q0OJIXYXXRCP", "Overall": "5.0", "Content": "Everything was just like is said it was and shipped fast.  Great price for a really good tv.", "Date": "February 19, 2010"}, {"Title": "LG!", "Author": "Angela C. Ritter", "ReviewID": "R1R4VYTOK30I1U", "Overall": "5.0", "Content": "I've had my 42-in LG television for 3 months now and it is great! Easy setup, great picture. Great buy!!", "Date": "October 5, 2009"}, {"Title": "An excellent 42\" LCD 1080p TV", "Author": "R. DeAngelis \"dixter\"", "ReviewID": "R7YCU3216VWKV", "Overall": "5.0", "Content": "This is a great TV, and we are very pleased we chose to buy 2 LG LCD TV's from Amazon at the same time.  While everything is nice about this TV, the SOUND QUALITY is what really surprised us.  Coming from our experience with earlier flat panel TV's, we expected the \"thin, thansistor\" sound and fully expected to have to invest in some kind of external surreound sound system.  Not so at all!  If we go surround sound it will purley be for the subwoofer and the 3D effect.  The sound on this TV is great!!!!", "Date": "March 26, 2010"}, {"Title": "solid TV", "Author": "PS \"PS\"", "ReviewID": "R3FFV5OLPTCC9R", "Overall": "4.0", "Content": "It is a solid TV set with a minor flaw, the TV may stop responding to the remote control and will need to be reset. Since this is a new model I hope that this would be the only issue with it. Also, do not buy this or any TV of more than 20in from ADORAMA, they charge a restocking fee and will not accept the defective TV at the store, you'll be forced to ship it to their warehouse at your expense.", "Date": "March 12, 2010"}, {"Title": "Smart choice", "Author": "Ms Gamgee", "ReviewID": "RU2Z7SQ3C6JRO", "Overall": "5.0", "Content": "We received this LCD TV about 2 weeks ago.After a month of research i was ready to purchase an LCD TV in the 36 to 40 in range... i did not want to spend more then $700 and i wanted a company that had a solid customer support background and low rate of failure across the board for their products..  This automatically took Samsung out of the running... they have low customer support and the rate at which their LCDs fail is fairly high within the first year.  Also Sony and Toshiba because of Customer support and price.So this left Panasonic and LG as the top brands (excluding others due to various other reasons).Panasonic was all sold out of there 2009 models so the logical choice was LG... But how did they compare on quality..SoundSuperb, compared to almost all other brands(that i have heard), and much better than Samsung.  Sound is crisp and clear (with the volume all the way up only the slightest amount of static is heard) ... Very low volume is also no problem either..sound still comes across clear. The speakers are hidden, and provides ample bass.PictureSD(standard definition) is scaled well.. SD is what you expect it to be .. not perfect.. but still viewable, which is a plus.. I have seen many LCD TV's in the last few months that look horrible through SD TV or component consoles.HD(High Definition) is nothing short of amazing... there is not much more to say on this subject other then it keeps up with anything else in this price/size range.Black levels are dark but do not over power any of the darker scenesWhites are bright and pureColors are crisp and accurateThis LCD TV stands up to the best of pictures in this price range.SetupSet the TV on a small entertainment center that is smaller then the TV itself, the small stand that comes with the TV even without screwing it in is PLENTY sturdy to hold the TV up by itself..The only revision to this would be if you have kids that are a bit rough and they knocked into it pretty hard it could tip... but it would have to be fairly hard..It was extremely easy to setup, which only took about 5 minutes on basic cable.. with more channels comes a longer setup time .. but that is to be expected ..Overall **FOR THE PRICE** this is the best possible deal I have found for an LCD TV in the 40in range.DeliveryWe received this TV before the estimated delivery date by DAYS!In perfect condition and ready to go. (if you have a small car *Yaris* it will take some serious maneuvering to fit) we did it though.I will update as the months go by", "Date": "March 11, 2010"}, {"Title": "Great TV", "Author": "J. Alderson", "ReviewID": "R21ZCJ40PDSB0E", "Overall": "5.0", "Content": "This TV meets every expectation I had for it.  I am blown away by the picture quality in HD on my blu-ray disks.  The sound is very clear and crisp.  For those who want to feel like getting a surround sound experience, don't expect it from the standard TV, use the hundreds you saved on the TV and get a decent 5.1 system.  Back to the TV... regular TV channels look great, and dont get distorted when stretched to full screen.  Overall I would suggest this TV to anyone who wants the best bang for your buck.  I garuntee you will be happy with this purchase!", "Date": "February 27, 2010"}, {"Title": "LG TV", "Author": "J. Sitko", "ReviewID": "REFKYU8XEQXG6", "Overall": "5.0", "Content": "The TV works great and was delivered as promised.  I was extremely easy to set up and I was watching it witin 15 mins after takng it ot of the box. NO dead pixels either.  A great buy from a great vendor!", "Date": "May 15, 2009"}, {"Title": "Tv", "Author": "raymond f wood", "ReviewID": "R1EGTRMPNFQLMI", "Overall": "5.0", "Content": "Bought this tv at a great price and put it in my rv. This tv has taken a beating,great price will buy from them again. Thanks", "Date": "October 31, 2012"}, {"Title": "bzzzzzzzzz", "Author": "Espresso  drinker", "ReviewID": "R3VBMJWDAIVSKJ", "Overall": "1.0", "Content": "I thought that after reading the reviews on this that I was getting a great deal.  Well I installed it and turned it on and you hear a buzz noise when the sound is heard.  it will not happen on volume 1-10, but then again, you cannot hear anything on that.  once you go above, there is terrible feedback buzzing noise.  The picture also is a little grainy.so i am waiting for amazon to come and get it as it must go back.  very dissapointing.  will look for a good price on samsung as they are much better as i have a 46\" and love it", "Date": "May 18, 2010"}, {"Title": "No good", "Author": "M. SMITH", "ReviewID": "R2D7UQMKB2ITPD", "Overall": "1.0", "Content": "I was very dissapointed at this 42' LCD  HDTV by LG.  A White cloud dominates the picture when scenes are dark. The edges have light leaking out. I should have stuck with a more reliable brand. From my understanding LG has poor tech support they want you to just ship out the product back to seller. What a hassle! Buttonline LG sells a lot of lemons so be careful.", "Date": "May 13, 2010"}, {"Title": "Awesome TV", "Author": "Jon", "ReviewID": "R3G62KBAQW4M8D", "Overall": "5.0", "Content": "Was skeptical at first when I saw you guys were shipping via CEVA as I had never heard of them but overall it was a great experience. Arrived 2 days before estimated ship date and service was a million times better than UPS or FedEx. The delivery guy brought the TV inside opened the TV and plugged it in to make sure it worked. The TV itself is beauuuuutiful. Picture quality excellent, sound awesome, 3 hdmis, easy to mount can't beat the price.", "Date": "February 15, 2010"}, {"Title": "Very Good product", "Author": "A. Heusse \"AH\"", "ReviewID": "R3EG6HPMYA5ZW8", "Overall": "5.0", "Content": "Very good product - good quality.But, It will be excellent if we can give name to a channel and be able to use PAL (and not only NTSC).Good to LG for building TV with a 110-240V 50-60Hz alimentation -> I will bring my TV in Europe when I go back in my country in few years !", "Date": "October 11, 2009"}, {"Title": "TV", "Author": "Ashley Anderson", "ReviewID": "R2CL5W5ZBGSP5F", "Overall": "4.0", "Content": "I am loving this TV. Great picture quality. You don't have to adjust color unless you want to but if you do there are many adjustments you can choose from. The only problem I have is that it doesn't fill out the entire screen unless you go in and zoom it but then it cuts out some of the picture. I have it set on adjust according to the program but only some shows fill out the screen. Not a big deal because it fills out most of it except the sides and I have gotten used to it and don't really notice it now.", "Date": "November 1, 2009"}, {"Title": "Great TV and it was even broken on delivery!!!", "Author": "Michael Stevens \"Michael\"", "ReviewID": "R35EQUOTO0ZQCP", "Overall": "5.0", "Content": "This was a disappointing experience. When the TV was delivered, the shipping box looked pristine, but when I opened it, I saw that the Styrofoam packaging was shattered. When I checked out the TV, I saw that the front and back halves of the enclosure was broken. There were broken pieces of the enclosure on the bottom of the package.I was very disappointed, but I hooked up the TV and it worked perfectly. I loved the quality of the product despite the damage.I would have re-ordered the same TV, if it would have been available for the same price and shipping, but it was not.I have had positive experiences with all parties (Adorama and Amazon)and will receive a full refund after the return.Michael", "Date": "March 13, 2010"}, {"Title": "Strange \"Power-On\" Indicator", "Author": "kenski", "ReviewID": "R1OTPPFUVC12JJ", "Overall": "4.0", "Content": "The TV picture is great.  I did have some issue with the HDMI connection being not tight enough, but I am blaming that on the cable (see below, you can read my review on that page).The one other issue I have with this tv is the strange little \"bump out\" it has on the bottom edge of the tv on the right hand side.  If you click on the picture to zoom in, you can barley see it, but its there.  It looks like a little chrome bubble.  In person, it really stand out to me.  When we first took it out of the box, I thought the chrome edging along the bottom of the tv had been damaged and was pulled away in that one spot.  It turns out that when you plug it in a colored light shines into this bubble and shows you it has powered.  And the light changes color when you turn the tv on.I have to admit it probably would not look as bad if the tv were on a stand.  But ours is mounted on the wall and every time I walk by it... it still looks like a defect instead of a design feature.  Maybe it's just me.PS, this is the cable I had an issue with.  Diamond HDMI20 Premium HDMI Cable , 20\" - Black", "Date": "February 17, 2010"}, {"Title": "Good qualty v/s price", "Author": "Gonzalo Vera Alvarez", "ReviewID": "RDGJDGF9D0F01", "Overall": "4.0", "Content": "I had a LG 42 no Full HD, and I bought this, because have good design and CDR (50.000:1). The bad thing is the response of the remote control, this is very slow to change between channel.", "Date": "June 27, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "LCD HDTV features a slim profile contoured edges with swivel stand\n1080p Full HD resolution 1920 x 1080p with 3x HDMI v 1.3 digital inputs and PC input\nInvisible speaker system with Dolby Digital 5.1 & Clear voice for richer more balanced sound & a polished look\nSuper ISFccc caple of professional calibration for picture performance\n50,000:1 Dynamic contrast ratio", "Name": "LG 42LH30 42-Inch 1080p LCD HDTV, Gloss Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41DbNji4snL._SX300_.jpg", "ProductID": "B001V5J7NY"}}