{"Reviews": [{"Title": "Outstanding Full HD Bang for your Buck!", "Author": "Neil C. McEvoy \"CorkyMuldoon\"", "ReviewID": "R2H2MA14PZW6NA", "Overall": "5.0", "Content": "I've had great experience with LG products - so my purchase of a 47\" Full HD set from LG seemed logical.The picture on my 47LG50 is terrific!  Setup out of the box was very intuitive, although I would recommend that the set's picture be set to \"standard\" instead of \"vivid\" (torch mode is set by default).Even when powered off, this set is beautiful.  Its piano black case frames the 47\" screen very well, although it is more susceptible to fingerprints.The set offers three HDMI 1.3 inputs and more connection options than one would normally need.I couldn't give this set a stronger recommendation!", "Date": "June 6, 2008"}, {"Title": "Great color and picture....", "Author": "tony", "ReviewID": "R2XUJCCFM227WT", "Overall": "5.0", "Content": "Pros - The TV has great color and picture quality. It's worth it for the price listed. No Motion blur with Verizon FIOS cable.Cons - The TV gets a slight distortion on certain camera angles when watching high action sports such as football. This is very unnoticeable to most of my friends but I'm a very picky person and can tell on certain camera angles or plays when watching sports the TV tends to get static.The speaker system has a Tru SRS surround feature which is useless along with a clear voice option. The speaker/surround feature could be better. I just use the default sound options for no added surround features from the TV.A few things to take in to consideration.1 - Make sure your TV room as adequate space. If you don't have at least 10-12 feet between you and your HDTV of this size you might get nausea. The TV can be overwhelming since its 47 inches big and looks totally different in your living room compared to in store.2 - Make sure you fine tune the colors and lower the back light as it's very powerful. My Tv is tuned to a 60 backlight 80 contrast 55 brightness.3 - Make sure you get an extended warranty with any HDTV you buy even if its not this model. HDTV's are highly susceptible to dead pixel lines. Most warranty's don't cover a dead pixel line unless it covers a certain area of the TV.4 - Use a HDMI cable that's oxygen free and shielded. You can buy one online for like 10$ instead of 100$ at your local shop.", "Date": "February 12, 2009"}, {"Title": "Amazing value for the price!", "Author": "C. Ransom \"queenransom\"", "ReviewID": "RK8RK6HONIZ8V", "Overall": "5.0", "Content": "We priced many tvs and this one was the best bargain for the money! Like the previous reviewer stated, I couldn't give this a higher rating. It's a great LCD!", "Date": "June 6, 2008"}, {"Title": "Great TV at great price!", "Author": "S. Michael", "ReviewID": "R2Y6ONGEDCH9TW", "Overall": "5.0", "Content": "A friend of mine has been spending hours the past several weeks trying to find that perfect LCD TV.  I think he must sank 40+ hours into the project by now.  He did eventually settle on a 40-42\" (can't remember which) Sony for about $1500.I walk into a close-out sale and walk out with a LG47LG50 in less than 15 minutes for $899.  Now, I'll be the first to admit that not doing proper research into a high dollar purchase is not wise, but this TV is amazing!  Lots of connections and a brilliant picture that is easy to customize.  I've put my PC, a game console, and my over-the-air antenna up to this LG and all look great!  My research-heavy friend came over to see it today and was thoroughly impressed with the set.Best thing about this TV is how intuitive the menu user interface is.  Everything from the physical remote control to the antenna tuning interface just makes sense.  I'm not saying my 85 year old grandma can run with it, but I believe most people will have absolutely NO problems navigating the myriad of options on this set.PROS:- Great, large picture- Good price- Intuitive menus and button layout- Attractive set (hidden speakers)- Lots of connectivityCONS:- Glossy black finish makes finger prints and dust easily visible- It's light.  It's couple pounds lighter than other TVs this size.  This could be a con as it feels \"cheap,\" or it could be a pro in that it's light and easy to move.  Not a deal breaker.BOTTOM LINE:Great set at great price.  Would highly recommend.", "Date": "March 1, 2009"}, {"Title": "Amazing Full HD", "Author": "Nick", "ReviewID": "RAFGW885HURPU", "Overall": "5.0", "Content": "This is a great television. It's got all the advanced options for people, like myself, that enjoy tweaking settings on their gadgets. The matte finish is perfect for rooms with a lot of ambient light, both natural or artificial. The color of the television is extremely impressive, especially after it's been calibrated.As with most LCDs the blacks are a little lacking, but the contrast is pretty good overall. The matte finish is really nice at preventing glare and reflections. Images and color are pretty uniform across the screen and off center viewing is very impressive, compared to some older LCDs. My screen has some issues with blotchy, slightly darker areas, on the left side, but it's very subtle and only shows up in very specific instances. My wife doesn't see it at all and I can't seem to \"unsee\" it, but it's a very minor issue.There are a ton of connection options (multiple HDMI, component, RGB, DVI, etc), which make this TV pretty future proof and allow users with older video equipment to upgrade their TV without having to replace their other gear.My favorite thing about the LG50 is that it can be calibrated to professional standards using the built in user menus. All one needs is a colorimeter, a calibration DVD, and some calibration software and you can make professional level adjustments to the color settings. It's not for everyone, but if you're into geeky stuff like that, you'll appreciate the option to do so. If you're not into that kind of advanced adjustment, there's still a lot of other more simple adjustments that can be made to help improve the picture quality, as well as presets.On top of all that, you're getting full 1080p, high definition resolution.", "Date": "February 27, 2009"}, {"Title": "Big Bang for the buck", "Author": "P. Nelson \"AV Lady\"", "ReviewID": "R3S0UD6VKYEEJ4", "Overall": "5.0", "Content": "When I first saw the price of this TV (999.00) I wondered what was wrong with it. Nothing, as it turns out. I bought it because of the price and the brand. I have a 32 inch LG 1080 flat screen that I have had for 3 1/2 years (you don't want to know how much it cost). It worked perfectly out of the box and has never had service. That's a heck of an endorsement these days! One unique thing that sold me on the 47\" LG50 was the height.  It is taller than the other flat screens of similar size so you don't get that extreme horizontal picture. It's more like watching a movie theater screen ratio. I watched 2 movies in a row yesterday and it was totally hypnotic. So, That's it, I love it and I'm sure you will too. Got mine at Best Buy and they delivered and set it up for me-no extra charge.", "Date": "August 7, 2009"}, {"Title": "I'd buy another one just like it.", "Author": "papa criss", "ReviewID": "R1I5Z9ES0S3F3O", "Overall": "5.0", "Content": "After spending months looking at all kinds of TV's I got back to basics. What was I going to do with this TV and where was I going to do it. I put it in the living room hooked up my Roku (via hdmi) my cable, my PS3 and my  computer. Blueray is stunning. Netflix HD looks awesome on it. World of Warcraft is totally killer on it and my cable needs to be upgraded to HD. I spent literally a hundred hours looking at nearly every size, make and model. The store managers at Costco, Best Buy and a couple of high end video/computer stores all thought I was going to take up residence. I picked it up brand new for $999 plus shipping. Last year I bought my brother an LG 42\" plasma for a wedding present. His is killer too. For me, it's LG all the way.", "Date": "March 13, 2009"}, {"Title": "Great TV!! Great Price", "Author": "E. Holyak", "ReviewID": "R2F1VZ5TVECQW5", "Overall": "5.0", "Content": "I purchased this TV right after Thanksgiving, so I have had it for 2 months now. I paid $1268 for mine & I have seen this TV on Amazon for under $1100 as of 01/21/09, so hold out for that price.Let me start from the beginning. The \"White Glove\" delivery was fantastic. The guys did a SATURDAY delivery, which blew my mind, and actually moved my behemoth 36\" CRT, little over 140 lbs. Great customer service! As soon as the couriers opened the box, it was beautiful. Picture was beautiful coming out of the box. Hooked up my new Blu-ray and watched 300 and The Hulk. Great!!!As with all LCD's, not the greatest of sound, but also not the worst. But you buy a HDTV for the picture quality not the sound. Get surround sound for great sound.All in all, great TV for the price. No buyers remorse here.", "Date": "January 22, 2009"}, {"Title": "Wonderful TV for the price!!", "Author": "D. Tuter \"shopaholic\"", "ReviewID": "R1E2JW78EFCDUB", "Overall": "5.0", "Content": "We purchased this LG 47\" back in July of 08 and we love it!! We have not had any issues with the picture or sound.  I do believe it's one of the best TV's on the market for the money.  We paid $1399.00 with free shipping and compared to some of the other deals out there, I don't believe you can go wrong with this TV.  Like other products on the market there are bound to be some with defects, but I do know that LG stands behind their products 100%.  If your considering a new HD TV this one is outstanding.  Add surround sound and it's wonderful!", "Date": "December 7, 2008"}, {"Title": "Great TV, BUT...", "Author": "R. V. Downing", "ReviewID": "R2QUJUU8K2QLX8", "Overall": "4.0", "Content": "Although I did quite a bit of research before buying, I'm no TV expert so take what I say with a grain of salt. I may not be using something correctly or what not.A very solid 47\" TV. Sleek styling, picture looks great, price was certainly right. I have experienced speakers rattling during certain programs and this is with the volume turned down well below it's maximum threshold. Menus are intuiative and coming off my 24\" Sanyo Flat Screen Tube TV this is definately a dream come true. As long as quality holds up for the long haul, no question about this being a solid TV. I do have second thoughts about getting a 120 Hz TV as I primarily watch sports. I can definately see the infamous \"motion blur\" during broadcasts, however I don't know that it's worth the extra $1000 or so for a TV that has the higher refresh rate. After much soul searching I was able to come to the conclusion that I would be more upset if I had spent $2500 on a TV but you may have some thinking of your own to do if you watch a lot of sports.If you're not looking to spend over $2000 on a big screen, then this a definitely a good buy!", "Date": "September 16, 2008"}, {"Title": "bought one in Dec. 2008", "Author": "G-MAN", "ReviewID": "RGJUMZRZVN6V8", "Overall": "2.0", "Content": "Bought @ Best Buy ,8 months out of warranty tv turned itself on,,changed channels and max on volume in the middle of the night,LG repaired for free 9-10-2010,started again yesterday,LG said they would pay for parts only this time,this seems to be a factory defect ,what do you think? TV is out of control!TV repaired 08-07-2012 no charge from LG,technician said it will be back,new part same as old part....", "Date": "July 20, 2012"}, {"Title": "Great TV", "Author": "Chris Montgomery \"VIPER\"", "ReviewID": "RTAZEWM5H1DDU", "Overall": "5.0", "Content": "I did a lot of research....and own multiple other flat screens.  I put this TV outside in our outdoor kitchen/living room.  Great picture from all angles, and light conditions.  Great TV...great price!!!", "Date": "February 2, 2009"}, {"Title": "Its just Perfect", "Author": "Anand Gopalan", "ReviewID": "R27O3L2VZVK5ZQ", "Overall": "5.0", "Content": "I brought this TV last week, I got good deal on [...] along with free Blueray DVD Player LG BD300. I have not installed the Blue ray yet. The picture quality is very good. I have connected my Standard def Direct tv, using the SVideo and the quality is good. I am totally happy with the purchase. This one does not have 120MHZ, which I think is overrated.The sound quality is good, but not great, I think you need external speakers for it. I would highly recommend it you are looking a decent TV at a good price.Anand.", "Date": "December 27, 2008"}, {"Title": "Got a LG 47LG50  47 - inch tv", "Author": "W. plunk", "ReviewID": "R1APBCML0OT240", "Overall": "3.0", "Content": "This  47LG50 was a exchange for our Panasonic Plasma 42 inch that webought 3yrs ago from Circuit City. The Panasonic went out 3 months before the extended warranty was up. We waited 5 1/2 month to get the exchange do to panasonic selling their parts department and they could not get the parts.After picking out the 47LG50 we had it a total of 6 weeks and it went out.:(Circuit City came out and within 2 weeks LG replaced the whole inside of the TV. We now have a great TV. :)I would recammend this TV if you buy the extended waranty.", "Date": "December 16, 2008"}, {"Title": "Love LG but disappointed in the Dynamic Contract Ratio", "Author": "James A. Harkins", "ReviewID": "RUJ4O1M667LB6", "Overall": "3.0", "Content": "I am a big LG fan and would buy from them again.  This TV has a great picture but I am disappointed in the contrast ratio.  If I had to do it all over again I would have spent a couple of extra hundred to get a nicer 120Hz version without dynamic contrast or went with a Sony Bravia which look pretty awesome right now.Still love LG though, just bought this one based on the LG name rather than taking a look at it in store first.", "Date": "January 7, 2009"}, {"Title": "Excellent LCDTV. Bad for Play Station 3", "Author": "RB Electronics", "ReviewID": "R2TWWMXE0BTH9K", "Overall": "4.0", "Content": "I've had this tv for a couple of months and had no complaints until i connected my PS3 via HDMI, for some reason it has a lot of problems running 1080p resolution under HDMI since it cuts the image with a message saying \"invalid format\" while you are playing or navigating thru the menu screen. DON'T BUY THIS TV FOR A PS3, lots of issues.", "Date": "July 10, 2009"}, {"Title": "LG SERVICE SUCKS", "Author": "GUITARWANNABEE \"GWB\"", "ReviewID": "R10AY5HVGCNWVW", "Overall": "1.0", "Content": "After having an LG47 LG50 LCD 80 days the picture goes out and after their tech replaced the mother boards the unit still does not work.It is now three weeks later and I want a new set and LG will not budge on this.They want me to miss another day of work so they can try and fix it again.This set is less that 3 months old.One day of lost wages and three weeks of paying for HD cable that I cannot get.B.S.DO NOT BUY LG PRODUCTS.L.G.= LAME GARBAGE", "Date": "October 5, 2008"}], "ProductInfo": {"Price": "$1,499.99", "Features": "LCD HDTV features a slim profile contoured edges and a silver chrome accent with swivel stand\n1080p Full HD resolution 1920 x 1080p with 3x HDMI v 1.3 digital inputs and PC input\nInvisible speaker system for richer more balanced sound & a polished look\nISFccc caple of professional calibration for picture performance\n15,000:1 Dynamic contrast ratio", "Name": "LG 47LG50 47-Inch 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31IY9tnzg6L._SX300_.jpg", "ProductID": "B0016P7GYG"}}