{"Reviews": [{"Title": "Very Happy Birthday to Me!", "Author": "E. Baker", "ReviewID": "R1WO0BROA02K5X", "Overall": "5.0", "Content": "I've had my new LG for a week and I'm thrilled with it.  We bought this T.V. to replace an older 19\" CRT for the den, where my wife and I end up watching T.V. in the evenings because the kids are doing homework or entertaining in the room with the big HDTV.  The picture is so crisp, and the colors so vibrant, that I find myself looking for excuses to turn it on and watch it.  I'm afraid to admit it, but I may actually prefer my new 32\" LG to my 60\" Sony!  I liked the swivel base, so I was choosing between this set and a Samsung at the same price point.  The pictures were very, very similar in quality, but I chose the LG because it was a newer model than the Samsung, and the Samsung was really at the low end of the Samsung line, while this LG is more in the middle of the LG line.  The picture was great out of the box, although the T.V. is packed with features allowing you to tune and tweak the picture settings to your heart's content.  I'm also very happy I didn't spend more money for a 1080p set.  At 32\" the 720p resolution looks awesome, so I can spend that extra $150 on something else.  Add to all the above the fact that the set looks fabulous sitting in its cabinet, and you have a great value.  Thanks LG!", "Date": "April 25, 2009"}, {"Title": "Great choice for small room", "Author": "Ron and Patty", "ReviewID": "R3CWY86GNNJHO1", "Overall": "5.0", "Content": "This TV deserves another 5 star rating!  It's perfect for our bedroom.  The picture and sound were great on standard settings right out of the box, although it has several alternate pre-sets and infinitely tweakable custom settings.  The big menu is very intuitive but it also has a quick menu that pops up in the lower right corner for quick changes to common things.  The remote is small and has well spaced, easy to use buttons.I wanted a solidly built TV with decent sound and my wife wanted no clutter and simple operation.  This one is all black, no \"bling\" but has enough features and connections so we could use it for more than a standalone TV.  The \"invisible speaker system\" is pure genius and gives a surprisingly full sound without needing a speaker system and amp (no clutter).  More importantly (to me since I'm a bit hard of hearing), the clear voice and auto sound leveling (quiet parts automatically turned up while commercials don't come out blaring) both work well.  It's one of those \"set and forget\" things. Here are more pictures and specs: [...]A technophile could hash over the finer points and compare this to others in its class, but as far as I'm concerned: it's a new model, has a clear, bright picture, the faces and landscapes all look realistic, and it has great sound, so how much better can it get?  Of course the news and some commercials are still way over the top with color saturation and contrast, but that's not the TV's fault.6ave get's five stars too.  I'd never heard of them until I saw this item, but 2 minutes on their website convinced me they were organized and reputable.  It came wrapped in a second box with foam peanuts all around it to prevent shock.  The order was placed on Sunday and it arrived Wednesday morning in perfect condition.  They are in the same league with NewEgg, B&H; Photo and BuyDig.  Also UPS called us to make sure someone was home to sign for it.One last thing... the manual power switch and all the other side controls/connectors are on the right side out of view, and that little bump on the bottom frame (on the right) is a subtle status indicator light that glows red or blue.  The main jacks are all on the rear left (as you would face the screen) and it has a built in wire guide that can help keep a few wires neater.Overall we are both very, very pleased and now we are planning on replacing our big rear projection box with a sleek LCD TV, probably a bigger version of this one.So get off the Samsung bandwagon and get this one before they sellout.  Nothing against Samsung at all, but some marketing genius has stolen the attention from other well engineered new TVs available on Amazon.", "Date": "April 22, 2009"}, {"Title": "very good set", "Author": "Johnny Beans \"vaboy118\"", "ReviewID": "R3ID68CV2W71B3", "Overall": "5.0", "Content": "this was on sale at BB.  Ordinarily I'm not that crazy about lg.  The samsung in the same size had A LOT more reflection.  if this is an issue for you, think hard about the LG.  This set has an excellent picture, good sound, and it is easy to adjust the picture.  No need in my opinion for 1080 in this size (or any other size unless watching a lot of blu-ray.)  Big features of this set were light weight (easy to move) and very low reflection from other light sources.I'd get it again.", "Date": "April 19, 2009"}, {"Title": "Fingers Crossed", "Author": "TheRaccoonMan \"TheRaccoonMan\"", "ReviewID": "RKWV6VRPVQ78V", "Overall": "4.0", "Content": "I bought this TV on 7/7/09. After I'd set it up and fallen in love with it it malfunctioned-I turned it off and it wouldn't turn back on. I returned it to Best Buy and exchanged it for the Sharp LC32SB27U that the salesman there had tried to convince me to buy in the first place. (The Sharp was on sale and saved me around $70.) That was okay...but I didn't like the Sharp very much. The pedastal is much better w/the LG and the picture was better right out of the box. I kept the Sharp until 7/14,when I simply threw up my hands and went back to BB and exhanged this for yet another LG. (Ironically, the LG was now on sale. It cost less than the Sharp had cost when IT was on sale. Karma.) Once again I'm in love w/the set. The picture is fine and everything about the set seems more substantial than the Sharp. But will it last? I sure hope so. I'm not wealthy and a new television is a big deal to me. (I'm using this as my primary TV,while most of the reviewers seem to consider it too small for that.) I'll come back in 6-9 months and follow up on how the set's doing. I've got my fingers crossed.Update 9/27:  I had reported a problem with my DVD player with this TV. I'd believed that the LG didn't have enough plugs to run my ancient DVD/VCR combination player and my wife's Wii system. The DVD combo is so old that there's no outlet for an HDMI cable. There ARE enough outlets on this TV. Finally I got things hooked up correctly, and my DVD player, the TV and my wife's games are all coexisting cheerfully. The strange thing I now have to deal with is that my DVD player won't work properly unless I run it through my cable box with a coaxial cable hookup to the TV. Instead of using the DVD player through the input menu  I use the \"cable\" input. Harmless but strange-this is no doubt a result of using very old equipment and the AT&T; Universe. So I no longer have issues of any kind with this TV.", "Date": "July 14, 2009"}, {"Title": "Great Secondary HDTV", "Author": "Arcticfusion", "ReviewID": "R3GFS0EBI25CV5", "Overall": "5.0", "Content": "I bought this TV about two weeks ago and love it.  I have a 46\" Samsung in the family room downstairs, but wanted a HDTV upstairs in the bedroom.  For a 32\" 720p HDTV this thing is great.  I have my rabbit ears hooked up and the tuner brings in all the locals that I can get.  I found the TV on here and read good reviews from most other sites and got a hold of 6th Ave Electronics for a price match of the best I could find ($[...]).  I used them before and they had the best price on the receiver I bought and matched the price on this.  Shipped and got here in two days.  Looks great in the bedroom and picture is clear and great.  Perfect TV for a secondary room as 720p is good enough on a TV this size.  Would be a great gamer TV too.", "Date": "June 30, 2009"}, {"Title": "Not good for SD TV", "Author": "Lutetia", "ReviewID": "R35GNDYF1JPBN8", "Overall": "4.0", "Content": "I ended up purchasing this TV over a comparable Samsung model as it was cheaper and I liked the \"Energy Saving\" button on the remote for ease in adjusting brightness.My biggest problem is SD channels look fuzzy. HD channels of course look bright and beautiful - however, as Comcast only offers about 10 HD channels - the rest look blurry! And I understand that that's a common problem with HDTVs. I also understand some HDTVs handle SD better than others - I don't think the LG handles it very well.Another issue I have with this TV are the black levels. I bought this TV to replace a 5 year old 18\" AOC LCD TV and it lacks in picture quality, however its black levels are actually better than the LG's! I switched back and forth several times while watching, \"Harry Potter and the Sorcerer's Stone\" and I adjusted the settings on the LG - the black was much darker on my old AOC and the picture seemed richer because of it - the LG seemed washed out.I researched this LG model and found how its black levels were not rated as highly as the Samsung. I think a little extra money would be worth it to have better black levels.I also don't care for the matte screen. It does reduce glare but I think picture quality is sacrificed.", "Date": "October 12, 2009"}, {"Title": "My First HDTV", "Author": "Mark P. Solowsky \"MpS\"", "ReviewID": "R1AISIQPIQHONG", "Overall": "5.0", "Content": "Well after much research and a budget in mind LG 32LH20 got my attention and kept my attention. I was looking for more bang for my buck while getting quality in return without going over budget. So many brands to choose from yes but Although I fell in love with Vizio the audio was lacking and the contrast ratio was small compared to LG and I love Samsung but they were out of my budget. LG had the best picture quality with a high contrast ratio and tweaks galore to adjust the picture as you see fit. the audio is top notch for a 32 inch. so for the best picture and audio for the 32 inch Lg was the way to go for me. I also like the invisible speakers and the ports in the back its very clean looking and out of the way. I'm a big movie buff so I brought a blu-ray player as well. Lg I'm a happy man!Sincerely,Mark- Hackensack, NJ", "Date": "September 24, 2009"}, {"Title": "Excellent HDTV for bedroom", "Author": "W. Cheuk", "ReviewID": "R22KCOTXH04DWP", "Overall": "5.0", "Content": "Great for smaller rooms...relatively lightweight...easy set-up...impressively bright, crystal-clear 720p HD picture...easy-to-use remote...QAM tuner picks up \"hidden\" HDTV signals without need for cable box...downside: \"hidden\" built-in speakers slightly \"tinny\" with average overall sound...regardless, a good overall value: bought new for under $425 + free shipping just prior to Labor Day.", "Date": "September 11, 2009"}, {"Title": "LG 32LH20 32-Inch 720p LCD HDTV", "Author": "R. Clarke \"Blessed\"", "ReviewID": "R2BNHCG152BFR0", "Overall": "5.0", "Content": "LG 32LH20 32-Inch 720p LCD HDTV, Gloss BlackI HAVE BEEN LOOKING FOR A 32 INCH 720P LCD TV FOR MONTHS NOW AND CAME ACROSS THE LG 32 LH20 AND GOT MORE THAN I BARGAIN FOR. THIS TV IS AMAZING. I RECENTLY OWNED A VIEWSONIC 32 AND A VIZIO 32. NOT ONE OF THEM COMPARED TO THE LG. PICTURE COULDN'T BE ANY BETTER, THE SOUND IS OUTSTANDING. WHEN PLAYING MY PS3 OR WATCHING TV THE CLEAR VOICE FEATURE BRINGS OUT SOUNDS THAT YOU DIDNT EVEN KNOW WAS THERE. SET UP WAS A BREEZE AND FINDING THE RIGHT PICTURE QUALITY AND SOUND ONLY TOOK A FEW MINUTES FOR ME. THE RESPONSE TIME WAS SUPER FAST WHEN CHANGING CHANNEL OR WATCHING OR PLAYING GAMES. YOU GET 2 HDMI,COMPONENT,COMPOSITE ALL WITH EASY ACCESS IN THE BACK OF THE TV. IT HAS AN ENERGY SAVING FEATURE THAT IS AWSOME. THE MOST I LOVE ABOUT THE TV IS THE SOUND AND THE PICTURE. WITH PREVIOUS LCD TV EITHER THE COLORS WAS TO BRIGHT OR TO DIM, THE SOUND WAS NEVER HOW YOU REALLY WANT IT AND RESPONSE TIME WAS SLOW. IF IT WAS ONE 32 LCD TV I WOULD RECOMMEND IT WOULD BE THE LG 32 LH2O. THERE IS NO COMPETITION.", "Date": "July 21, 2009"}, {"Title": "Works for me", "Author": "Peter Hughes", "ReviewID": "R1Z8V2578Z1DIR", "Overall": "5.0", "Content": "This was our first LCD TV and we are pretty happy with it. It is in our rather small bedroom a couple of feet from the foot of the bed and to tell the truth it is really too big. We could have gotten a 26\" or even a 22\". One review mentioned the sound, actually it is the best built in TV sound I have heard. Another review mentioned a wobbly stand. There are four screws you have to put in after pushing in the mounting piece, I guess if you have brain damage and refuse to do anything correctly ever in your life, yours might wobble too. The screen looks great from all possible angles, the only thing I would change is that the images look oversharpened sometimes. I don't know if that is the signal we are getting, or something the TV is doing, or if we might even be able to change it if we hunted through menus for a couple of days. Not to say that the menus are hard to handle, it is probably no better or worse than any other in that respect, it's just that engineers generally get carried away. I was disappointed that content from our local stations is not HD, or is still 4:3 format with jaggy graphics. I guess they are just too cheap. But network content getting our signals over the air is pretty much full screen and immaculate. The control is sturdy, simple and well laid out. For example, the buttons are different shapes and sizes, and the power button is well separated from the channel change button. If we move this set elsewhere and get a smaller one for the bedroom, I would get the same thing.", "Date": "October 14, 2009"}, {"Title": "good tv", "Author": "Funkytrojan", "ReviewID": "R3CF1NQ5KUPWGC", "Overall": "3.0", "Content": "Tv went out after two months.  Was fixed under warranty.  Has worked great ever since. Repair was 14 months ago.", "Date": "December 31, 2010"}, {"Title": "Great TV for the price. We love ours!", "Author": "The Coach \"Kayak Fisherman\"", "ReviewID": "R3VOI1WRJQSGP2", "Overall": "5.0", "Content": "This TV is exactly what we wanted. This is a bedroom set, and we were not as concerened with having every \"cool\" feature on the planet as were were with have a quality TV with a good picture and sound. So far we have ZERO complaints. The sound is really good. Our old TV had speakers that seemed to project sound down instead of out. Most of the time we don't have this one turned up past 10 or 11 (out of I guess 100) and it fills the room fine. The picture is crystal clear and the presets are nice - movies, sports, etc... The black casing is nice and clean looking. My wife loves the sleep timer! Plenty of features (more than we can deal with) and setup was so easy it was silly.I wanted to talk about the seller here: Sixth Avenue Electronics (6ave on Amazon) is the best! I, like most people, hesitate a little to drop this amount of money online. The reviews for 6ave were outstanding, so we gave them a shot. MAN are they good! Communication ALL ALONG THE WAY and they make sure you are happy. I could not ask for a better seller online.", "Date": "December 24, 2009"}, {"Title": "Amazing TV", "Author": "B. Burke", "ReviewID": "R1IXOPFRKT7EZF", "Overall": "5.0", "Content": "Great picture.  Great sound.  Easy to setup.  Easy to use.  Really attractive design--the unique shape of the bottom edge of the screen keeps the TV from looking like a great big computer monitor, in my opinion.  Have owned this TV for about 6 weeks now--it's one of the best purchases I've made in a long time.  Great price too.", "Date": "December 12, 2009"}, {"Title": "LG surprises me...", "Author": "Amazon Customer", "ReviewID": "RBOZK2YZBZ1MG", "Overall": "5.0", "Content": "I had been looking for a mid-sized TV to put in my kitchen for my 2 year old daughter.  While I didn't really want to cheap-out, I also didn't want to break the bank for a 2nd set.  After all, she is only going to be watching cartoons and childrens' shows.Well, I did some research and picture comparisons in Best Buy, and I had narrowed it down to 3 different sets.  A Sony, a Samsung, and this LG.After inspection in the store, I dismissed the Sony, and found that the Samsung and the LG had very comparable pictures, with bright, vivid colors, and NO ghosting at all, even during a HOCKEY game.  Impressive.The difference was, the Samsung was [...] more, and actually had LESS picture-customization features.  The LG actually blew me away with the amount of picture-tweaking it allows.  I haven't seen ANY other set offer as much.  If you can't find a picture you like on THIS set, then you will not find it on ANY set.There is even a cool picture-calibration feature that takes much of the guess-work out of the process.Now, some people may balk at this being only 720p...and to be honest, I was looking for 1080p...but again, I didn't want to break the bank.I decided not to go with the 1080p due to the price, and the fact that no Blu-Ray player would be connected to this, and most broadcasts on cable are in 720p anyway.Well...I have to say...the picture is BRILLIANT.  720p looks AMAZING anyway, and most of the childrens' shows are not in HD either.  The set makes EVERY channel look great...even standard definition.For [...], I could NOT be happier.  And I cannot recommend this TV enough at that price.While the glossy black finish does attract fingerprints, the screen has just the right amount of anti-glare to it, that ambient room light does not affect the picture quality.The sound on this TV is another great feature.  Most TV's of this size have poor sound quality.  This is an area where this set shines.  There is an option called \"Clear Voice II\", that really makes dialog VERY clear.  Great feature.So...if you are looking for a 2nd TV that provides a GREAT HD picture, great sound, attractive design, tons of customization, and a nice anti-glare screen, and will not empty your bank-account....look no further.LG has done the consumer right by this product.", "Date": "December 20, 2009"}, {"Title": "My favorite T.V... A must get!!!", "Author": "J. Petersen \"Kangaroo102\"", "ReviewID": "RC9AJOVA4C6LO", "Overall": "5.0", "Content": "This is a great T.V. There was fast shipping. It is very easy to set up. It is light. It shows images very well on the t.v. This is one of my favorite tv's I have owned. The screen is bright and it lasts a long time. A very great buy!!!!", "Date": "August 17, 2009"}, {"Title": "LG 32-inch LCD HDTV", "Author": "John M. Bozick", "ReviewID": "R11PPX0NTHP3E7", "Overall": "5.0", "Content": "Great price here in comparison with the competition in stores. We really like the clarity and size as well as the modern technology.", "Date": "January 16, 2013"}, {"Title": "Excellent monitor for the price", "Author": "M. Wang", "ReviewID": "RNRR7337DQI6R", "Overall": "4.0", "Content": "This monitor has a very good picture for the money. Currently it's $250, so it would make a perfect dual monitor set up for $500.", "Date": "November 19, 2012"}, {"Title": "Another Great LG Flatscreen!", "Author": "Kenneth Marcum \"Harley Man\"", "ReviewID": "RVPYDKFG4ZNJZ", "Overall": "5.0", "Content": "We purchased this LG for our bedroom.  It is perfect for our room and provides excellent picture quality and sound! Like going to the movies in your bedroom.  I own three LG televisions and unless something drastic happens to this brand, it is the brand we will buy again when these finally wear out!  Very pleased with all of them!Never buy anything on the judgment of one reviewer. As with all my reviews, the above is only my opinion or observation of an item that I own or have tested. Consider that it is possible that I may have either purchased/tested a faulty unit or an exceptionally good one. Your experience may differ from mine, better or worse. Paying attention to the up or down trend from several reviewers will help you make an educated decision on whether or not the item is for you.Best of Luck!!", "Date": "January 7, 2012"}, {"Title": "el observador", "Author": "Rafael Mauricio Roitman B", "ReviewID": "R1A3FSQV9VKR7X", "Overall": "4.0", "Content": "I have been using this tv for almost two years and it works perfect, the image and sound sre really good, i will recomend it with out hesitation.", "Date": "November 11, 2011"}, {"Title": "HDTV Great Buy", "Author": "Charlie", "ReviewID": "R1OL5CG4JUCWQL", "Overall": "4.0", "Content": "This TV provides as good a picture at 720p as our 49-inch 1080p.  The 720p format is perfect for this size screen.", "Date": "September 11, 2010"}, {"Title": "super TV", "Author": "L. Hill", "ReviewID": "RHDX1TER63LXE", "Overall": "5.0", "Content": "For TV's generally only one thing matters - the screen quality.  I went down to my local store and watched all the TV's on display side by side.  for 32\" tv's in the 720p category, hands down this tv had the best image quality.  All LG had to do to win me over was to deliver on the basics - decent price, decent looks and decent functionality.  no problems there.  this tv looks nice, it's easy to use and the sound is great.  I've now had this TV for over 6 months and am still very happy with it.I have to say at first i didn't care about the energy saving function, but I really like it now.  Because LCD screens are so bright nowadays, when watching the TV at night the energy saving function allows me to instantly dim the screen in steady increments.  really good feature.Normally I used to be really only into Japanese tv's, but the S. korean brands really seem better.  saying that though having looked at the other tv's in the shop recently and the new chinese brands seem really good.  bottom line - it ain't always the brand, it's really down to what's being put in front of you.", "Date": "May 8, 2010"}, {"Title": "Excellent HDTV", "Author": "S. Hudson \"suzyq\"", "ReviewID": "R11FNPVTDI2EPF", "Overall": "5.0", "Content": "I would definitely recommend this HDTV to anyone looking for this particular size. The picture quality is truly amazing, it was everything I expected.  It has lots of features for settings for sound and picture quality.  My husband is super picky, so I did a lot of research before settling on this one, and might I add, he loves it too!", "Date": "April 6, 2010"}, {"Title": "Nice product even though it is LG's older model, it still beats many TV's in same class.", "Author": "N. Cao", "ReviewID": "RKB9FOCYVVQ2I", "Overall": "5.0", "Content": "the only thing is if it had more connections from back panel it would be great.Else, it works great as we compared many other LCD sets.", "Date": "April 3, 2010"}, {"Title": "the best choice for games", "Author": "Nerrel", "ReviewID": "RPXZJFHCUAU96", "Overall": "5.0", "Content": "picture quality can be very subjective and you'll often see reviewers claiming their particular tv is best; however, if you're not interested in opinions and want a tv whose quality can be proven for a fact, the LG is it.  unlike other brands which exaggerate the contrast and color to look more vivid, LG instead makes it their priority to create the most accurate picture possible; in fact, their tvs without dispute have the most color accuracy available in this range. even with 'vivid' mode turned on in the store, it was clear to me that the LG looked much truer to real life than the samsung next to it which, despite 'looking good' in a general sense, bizarrely distorted human skin tones.  the number of features LG includes for picture adjustment are another an indicator of how serious they are about getting an accurate picture. even in this entry level set, the vast menu of options gives you more control over picture than most brands do with their top of the line models.  the picture wizard feature, despite sounding like another gimmicky add on, is so surprisingly useful and simple that you'll wonder why something like it isn't included in all tvs- just match your picture to onscreen test patterns and your tv will be calibrated to give the truest picture. how trustworthy is it? i tested the picture using a THX optimizer and absolutely nothing needed to be readjusted; the tv's internal test patterns were every bit as accurate as the optimizer's. the tv even includes filters for red, blue, and green, so you don't need to wear THX's goofy blue glasses to do the color setup.  if you have fancy calibration discs and color sensing equipment you can even set white balance through a 10 point IRE, which ensures that every shade of gray will be reproduced without color intrusions. most people, myself included, won't have the equipment to do that but it's impressive that the tv allows that level of adjustment.  motion blur is nearly non-existent for most colors, although very dark shades do still tend to blur slightly on light backgrounds. overall, the tv is as close to blur free as you'll get at this price. the black levels, although not the absolute darkest out there, are also more than good enough. the tv does a good job of scaling up 480p content from dvds and games, making it a good choice if you have a lot of standard def material. the scaling and image processing are also unbelievably fast, which is good if you're interested in playing video games without lag. a game mode is included, but even with the full image processing on the tv doesn't measurably slow down, making such a thing unnecessary.  the only complaint i have with the overall quality of the tv is that there are two stuck pixels, which couldn't be fixed no matter what i tried (thankfully, they're easy to ignore). otherwise, i've been completely impressed with the quality of the picture and adjustment features. once it's been set up you'll have a tv that not only looks great in a general sense, but also looks the way it's *supposed* to, which is something not all competing tvs can deliver. it works beautifully for tv, movies, and video games all the same. if i had to choose again, i'd go for the LG without thinking twice.", "Date": "March 13, 2010"}, {"Title": "One of the Best LCD TV in its price category", "Author": "C. Pak", "ReviewID": "RXBWCB6YKTBKK", "Overall": "5.0", "Content": "After reviewing several 32in LCD TV's in this price category, I settled on the LG. If you are looking for a sub $400 720P LCD, this one has to be on the top of the list. The TV has multiple calibration features to fine tune the picture. The calibration features are extensive and better than most compared to its competitors. The clarity and the overall picture quality is excellent and the 720P resolution is more than adequate for the size of the TV. The sound quality is good and the \"Clear Voice' feature is actually functional and useful. The digital tuner is excellent and you will be surprised what additional channels it will pick up even with basic digital cable.The included user manual is sub par. It only has the very basic setup functions and features. Go online to LG and download the full manual. The online manual has extensive information regarding the features and functions. This unite is highly recommended. Best in class features, function, picture quality for the price.", "Date": "December 23, 2009"}, {"Title": "LG 32 inch 720p LCD", "Author": "Herman A. Potter \"Herman\"", "ReviewID": "R3USTMPQDYVA8C", "Overall": "5.0", "Content": "Bought this to replace older TV in bedroom for wife. She loves everything about it. takes up less space, better pic and sound and extremely better looking. Quick delivery and even better price. Thanks", "Date": "December 9, 2009"}, {"Title": "Terrific TV", "Author": "Don Gray", "ReviewID": "RW9XHMNRC6UUA", "Overall": "5.0", "Content": "I bought this TV for my daughter as her primary TV in a small living room.Delivery was by UPS, no problems.  I thought the package was damaged but the actual TV package was inside another box with good padding.  So even though the exterior box was torn the inside package was intact.The plastic base is not very heavy.  It would be better to mount it on the wall but there is a hole in the base to allow putting one screw through the base into the surface below.I was unsure about picture quality of 720p but it is great in HD with DISH satellite--far better than I had hoped for. Color is excellent.  The brightness is good even thought the room has lots of natural light.  Sound is good.  The only negative for me is that this TV causes my very expensive one year old 40 inch 1080i TV to look pale in comparison.I bought this TV from \"Sixth Avenue Electronics\" through Amazon.com for the total of 406.96 including shipping, no problems with the transaction.", "Date": "November 30, 2009"}, {"Title": "Great Product at a Great Price", "Author": "M. LEE", "ReviewID": "R1BKK8HEJ8JLHT", "Overall": "5.0", "Content": "I did extensive research both online and in stores before choosing this model. I chose it over a number of competitors, including the Sony, Samsung and Panasonic counterparts. The LG is a second set for limited use in our den.  It is attractive, easy to use, has all the features I could want, and has excellent picture and sound quality for the price.  The initial set up was very easy.  In fact, my 9-year-old son did  it.  I had to fiddle with the picture for awhile to get the quality I wanted and am not using the factory settings.  But the on-screen menu is easy to use for this and other purposes.  The picture quality is a bit disappointing with regular cable, but I'm considering an upgrade in my cable service to take advantage of the HD capacity of the set.  Sound is very good for TV speakers.One negative is that the owner's manual is very limited.  For example, I tried to set up parental controls, but needed to enter a password to do this.  I can't find the initial password to get me started. And the manual says nothing about this.  So I will have to call the manufacturer for help.The Amazon price for this set was $409, with no tax and free shipping.  That compared to $500 at Best Buy.  And Butterfly Photo got the set to me in less than two days even though I went with standard shipping.After a month from the date of purchase, I am a very satisfied customer.", "Date": "November 28, 2009"}, {"Title": "Great TV For Bedroom ......... Go Get One", "Author": "Barran Lahouti", "ReviewID": "R1PJMECG7WDAZP", "Overall": "5.0", "Content": "I bought this TV for my bedroom about 3 weeks ago and I must say that I am very happy that I selected this brand and model. The picture looks great and color is also fantastic. Especially this model allows you to set the picture and the color to your taste among other user's option that this TV set offers. I strongly recommend this brand for a bedroom or a medium size living room. The sound quality is wonderful for these types of rooms. The remote works fine and the related menu is very easy to understand and follow. The price performance ratio is great and well justifies purchasing this TV set.", "Date": "October 25, 2009"}, {"Title": "Great first LCDTV", "Author": "NH603", "ReviewID": "R1Y0X3KZBJKRHD", "Overall": "5.0", "Content": "This was my first LCD TV purchase so I wasn't too sure what I was getting myself into.  I did some extensive research and was trying to decide between this LG and a similar Panasonic LCD TV for about the same price.  After going to the store and seeing pictures from both TVs I went with the LG because it definitely looked better than the Panasonic in person.After experiencing this TV for a couple weeks, I can say that I'm definitely happy with my decision.  The picture and sound quality are superb.  The pre-set picture settings are really handy and I actually found the standard setting to produce a better picture than anything I tried to set on my own.  While it may not have all the bells and whistles that many similar TVs have, it's picture and sound cannot be beat for the same price.  I find myself wanting to watch more TV just to see how clear the HD channels come in.  I've even had a lot of comments from guests about how nice the TV set itself looks, not to mention the superior picture it produces.  For an LCD TV it also has great sound that comes from its \"invisible speakers,\" which makes for an even better experience.  I highly recommend this LCD TV for anyone looking to get a lot of bang for their buck.", "Date": "September 29, 2009"}, {"Title": "Nothing better", "Author": "John Moreno", "ReviewID": "RQL5JBRGMV9LD", "Overall": "5.0", "Content": "This tv was my first HDTV purchase and i cannot believe how beautiful th epicture is. i had friends over and they were amazed at the picture quality. they were even more amazed  when i told them the price of it!!!!! beautiful picture lots of ports swivel stand, what more could you need?", "Date": "September 10, 2009"}, {"Title": "It was exactly what I ordered and the shipping was timely!!!", "Author": "Brooke Koenig", "ReviewID": "RZF2V7KR89ANY", "Overall": "5.0", "Content": "It was exactly what I ordered and the shipping was timely!!!  Sound is great, picture is great.", "Date": "September 9, 2009"}, {"Title": "rowan/detroit", "Author": "R. Rowan \"rockn\"", "ReviewID": "R1UGXF71Z2FW5I", "Overall": "4.0", "Content": "Great tv for the price! I use it in the bedroom. Great picture & decent sound. I was pricing 26\" sets & got this 32\" for almost the same price. I use the cinema mode setting for the best looking picture. Very satisfied", "Date": "November 4, 2009"}, {"Title": "Excellent TV for the money", "Author": "J. Karnes \"college student\"", "ReviewID": "R32UBAK240HEAI", "Overall": "5.0", "Content": "I bought this with birthday money and it is worth every penny. I don't watch too much TV but got it mostly to use as a monitor for my laptop. It doesn't come with a VGA cable but you can pick one up at Target like I did for about $15 which isn't bad considering how useful it is. The TV came very well packed and was extremely easy to put onto the stand. I don't intend to wall mount it and the stand it came with is very stable and I have it sitting on a desk 3 feet off the ground. The TV also swivels on the  stand about 45 degrees. Since the resolution is only 720p its not great for a monitor but it isn't bad at all. Text is sometimes hard to read but that is easily fixed by enlarging text in your web browser.I went to several [...] looking for the right TV. I watch a lot of sports and a lot of the TVs in the stores had so much motion blur during fast motion it would've been very upsetting to purchase such an awful TV. I think the problem was the screen refresh time because most of the TVs in the store had a 6ms refresh time while this has 4. If you plan on watching sports or fast action movies do not get anything higher than 4ms or you will be disappointed. I really liked the Samsung but in the end decided I didn't want to pay neither the CA sales tax nor the CA recycle tax so I decided to purchase online. If you don't have a large sales tax or a BS recycle tax then you might be better off purchasing in the store so you don't have to wait for it. Strangely enough very few stores carry LG but I decided to take a risk and buy it online and it has paid off very nicely. I wouldn't even think of trading this for another one (that is until 3D TVs come out).As a TV it is great all around and the menu offers a variety of settings so you can really play around and see what suits you best. The energy saving feature is another plus that goes above and beyond what I got this for. I am using about a 20 year old set of bunny ears and I can get most local stations in HD though your mileage may vary depending on where you live. Don't waste $$ on an \"HD antenna\" if you don't need it--it's just a cruel marketing ploy to get you to buy something a standard set of bunny ears will get you just fine.The only drawbacks I found with this TV is that it has no jack for earphones and it only has 2 HDMI plugs. I don't use HDMI for my set up so its not really a drawback for me but it may be for others. Since I mainly use the TV with my computer I just use my computer's earphone jack but since the volume on this TV has a great range, I found I don't really need earphones as it can be heard just as clearly at a low volume as it can at a higher volume. The speakers give it a surround sound type feel and since they are \"hidden\", I think it looks better aesthetically than say a Vizio that has them jutting out on the bottom.Overall its a great TV for the price and I would purchase again if given a second chance.", "Date": "October 9, 2009"}, {"Title": "Good Buy", "Author": "Judy Munday", "ReviewID": "R1BASPFHE6R51W", "Overall": "4.0", "Content": "This is  a good television.  It is for my guest bedroom.  It has a good pictures and fits my needs.  For the price this was a good buy.", "Date": "December 6, 2013"}, {"Title": "LG 32'", "Author": "Misael", "ReviewID": "R8BNTTCYXL2SQ", "Overall": "4.0", "Content": "Great TV I have this product for a while now and I do not have any issues with it. It sounds good, pictures is good also", "Date": "November 21, 2013"}, {"Title": "LG TV", "Author": "Thomas E. Urtel", "ReviewID": "R19OK7YUBFEJQH", "Overall": "5.0", "Content": "I'm extremely pleased with my new LG TV in all reguards and would buy again!", "Date": "April 3, 2010"}, {"Title": "Definately Worth The Price", "Author": "StephanieLynn \"Stephanie\"", "ReviewID": "R2NCDIHIXVETBR", "Overall": "5.0", "Content": "Love the product, but the picture is only excellent quality if you have HD service through your cable or satellite provider. Customer service was excellent as well. I would definately do business with them again...", "Date": "April 2, 2010"}, {"Title": "best 32'' tv for the money", "Author": "Edward G. Sippel", "ReviewID": "RBXLDBAIEZHBX", "Overall": "5.0", "Content": "i researched all 32 inch tv's b-4 buying the lg. i am a samsung person but i have to say this lg has changed my mindabout performance and value, and what you would normally pay for a tv with all of the features lg packed into thisawesome 32 inch lcd tv.  LG has a new fan and i will buy lg in the future.", "Date": "March 30, 2010"}, {"Title": "In love!", "Author": "chrisrox44", "ReviewID": "R37HS3W1GV8YML", "Overall": "5.0", "Content": "I love my new TV! I have cable and still have not received the HD cable box for it yet but the picture is still great with regular channels. The set up and setting adjustments are pretty easy to figure out as well.", "Date": "March 30, 2010"}, {"Title": "Great TV, great price", "Author": "Snufi1967", "ReviewID": "R19HR0WC90A42N", "Overall": "5.0", "Content": "Very, very happy with my new LG LCD TV.  Awesome price, great tv, and of course, stellar price.  Thanks again, Amazon.", "Date": "March 27, 2010"}, {"Title": "LG 32\" 720p LCD TV", "Author": "R. DeAngelis \"dixter\"", "ReviewID": "R22Y7Q9PSKRG4", "Overall": "5.0", "Content": "This is a great TV, and we are very pleased we chose to buy 2 LG LCD TV's from Amazon at the same time.  While everything is nice about this TV, the SOUND QUALITY is what really surprised us.  Coming from our experience with earlier flat panel TV's, we expected the \"thin, thansistor\" sound and fully expected to have to invest in some kind of external surreound sound system.  Not so at all!  If we go surround sound it will purley be for the subwoofer and the 3D effect.  The sound on this TV is great!!!!As far as choosing 720p vs. 1080p - we found the \"conventional wisdom\" to be true that 1080p is not necessary on a 32\" LCD TV.  The 720p 32\" LCD TV has a very comparable picture to our 42\" LG 1080p LCD TV that was purchased the same day.", "Date": "March 26, 2010"}, {"Title": "Great TV", "Author": "Kenneth J. Carter \"Ken\"", "ReviewID": "RISEEAE8SLCO5", "Overall": "5.0", "Content": "This TV was all that I could ask for.  It exceeded all my expectations.  I would recommend this TV to anyone interested in great quality in a 32 in tv.", "Date": "March 3, 2010"}, {"Title": "Better than Sony and costs less", "Author": "Paulo Ricardo B. Soares", "ReviewID": "R24PL43UL8T8K0", "Overall": "5.0", "Content": "I had read that LG was making one of the best TVs recently, but wasn't very sure about that. Now i see it is true! It is much better than the Sony or Panasonic of 720p. It is a very good buy for the price.", "Date": "March 1, 2010"}, {"Title": "Could not be happier!", "Author": "Joseph Thomas", "ReviewID": "RLCZFVNQ3WNMB", "Overall": "5.0", "Content": "I have now bought Two of these HD LG Televisions, and the second was not to replace the first one i bought. Need i say more? This TV is simply amazing. Sound is awesome, picture quality is sharp and crisp and the gloss black finish it has, is so sexy. I'm a hardcore gamer and have out-grown my 19'' PC monitor so i decided to upgrade. I'm so glad i went with LG. I have both my PlayStation 3 and xbox 360 connected and this TV did not disappoint. HD movies looks sharp and crisp and with a great response time, there is no ghosting on fast paced action scenes. The only downside to this television is that my girlfriend fell in love with it, so in order for me to continue gaming with no interruptions, i had to purchase a second one for our bed room, which i just did. If you are on the fence about this HD TV, wait no longer, this is the one for you!", "Date": "February 26, 2010"}, {"Title": "Fantastic TV", "Author": "ZT", "ReviewID": "R268PLDQYGW7N5", "Overall": "5.0", "Content": "Amazing television.  We upgraded from an older Sony Wega 32 inch to this.  The picture is amazing looking, set up was easy, it runs perfectly with our PS3 and 360 on component cables.Very pleased with this purchase.", "Date": "February 23, 2010"}, {"Title": "Good Sound Quality", "Author": "cali lady 1", "ReviewID": "R2ACGR9FDV3NXB", "Overall": "5.0", "Content": "I feel I should comment on the sound quality of this TV, because it's good.  What little bit of research I did before buying an LG led me to believe that sound quality isn't really a selling point on many LCD's yet.  You don't want it to suck, but you're probably not going hear anything worth writing home about.  If that's true, then the sound on this thing is great.  I had a pair of external speakers I planned on using, and the TV speakers sounded way better.  My only note is that dialogue sounds a little quiet in comparison to background music, but I haven't really played with the settings yet.Great picture.  Easy to set up.  Light.  And the menu functions are very intuitive.I wanted a good TV for a good price, and at $378 I think that's exactly what I got.", "Date": "February 5, 2010"}, {"Title": "GPETE", "Author": "G. Peterson", "ReviewID": "R1MD6QKKRFSXZM", "Overall": "5.0", "Content": "Selection was based on previous reviews. As a result I got just as I expected. Especially like the sound quality from such a thin profile.", "Date": "January 27, 2010"}, {"Title": "Pretty nice 2nd TV", "Author": "N. Huguley", "ReviewID": "R123ASBOZ7V3LN", "Overall": "4.0", "Content": "Since we bought the big TV for the living room a year ago, we decided to ditch all our old CRTs and get a smaller set for the bedroom. 1st impression of this TV is very nice. I did allot of research to find the best I could, for the money I wanted to pay for a bedroom set, and this TV filled the need nicely. The only real complaint in the reviews on this, and other sites, was the angle of viewing for this set was much less than the others in this price category. To be honest with you, I just don't see it (merit to that complaint). I am very impressed with this unit. Keep in mind it's price point, and the fact that it is not full 1080P. I know 1080P is way overkill unless you are dealing with displays over 40\". so I just didn't even think about the 1080p units for the bedroom. Set up was a breeze and we really didn't even need the manual. It is very user friendly menu on screen. Of course, we are not the huge \"Home Theator\" type, so for our needs, this was a good purchase. We are very happy with it.As far as the viewing angle, since that was the weak link on this unit compared to others. All other scores were higher, even compared to some of the higher priced units. But, laying on the bed, there isn't allot of viweing angle issues anyway. but the wife was sitting in a chair against the wall in the bedroom, way outside of the 20 degree angle they say is the limit for this TV, and she claimed she could see it just fine. When I inquired to her about it, and told her of the issues the reviews complained about, she did say, \"sure, there is \"some\" ghosting, but it is watchable, and not that bad...\" Keep in mind she was probably near double the angle limits stated about this TV. So, dunno. .I just don't see that weakness really. I highly recommend this set for someone looking for this size and price.. You wont' be disappointed.This set should maybe be a 5 as far as I am concerned, but rarely give 5s due to there is always room for improvement. So, compared to the others in this class, it is a 5. But, I wish it was more like my higher end TV in the living room that has hardly any bezel, and mostly screen seen. The bezel on this one is thicker, kinda normal for a year or two ago..  And the little RF \"bulbous\" thing on the right bottom is kinda weird looking IMHO..", "Date": "January 20, 2010"}, {"Title": "32\" LG Flat Screen TV", "Author": "John McClure", "ReviewID": "R1GGPS75058M3K", "Overall": "5.0", "Content": "This is my second LG flat screen TV.  Have had no problems.  Remote is especially nice...... well laid out, easy to read.  Great menus, easy to use.  720p is more than adequate for 32\".  Have no issues with this unit.", "Date": "November 11, 2009"}, {"Title": "great t.v.", "Author": "A. Jordan", "ReviewID": "R3SGRKQBFF7HK3", "Overall": "5.0", "Content": "I love this dtv, as the base turnes so I can also see it from the kitchen!!  great color", "Date": "November 4, 2009"}, {"Title": "32 inch tv", "Author": "Liquid Gold \"Liquid Gold\"", "ReviewID": "RM0CN5OYQZAS5", "Overall": "5.0", "Content": "it was very easy to set up. it arrived promptly in excellent condition. we have not had any problems with it. there is a glare with an extreme angle, but it swivels, so it is easy to adjust. love the swivel. very good size, not crazy-theatre big, but much better then our old 19-inch tv. very attractive, sleek and black. excellent \"green\" options. very, very good tv for the money.", "Date": "October 25, 2009"}, {"Title": "Great TV, Even better service", "Author": "Joshua M. Strader", "ReviewID": "R1IWKQUFVETI5R", "Overall": "5.0", "Content": "TV works great and the service was the best I have ever had. The shipping people messed up and returned it to the company. They were great and 2nd day air mailed it to me to make up for the lost time.", "Date": "October 21, 2009"}, {"Title": "A Great TV", "Author": "Sam", "ReviewID": "R2D4NB9UD0WLFU", "Overall": "5.0", "Content": "I was skeptical to buy this TV because the previous LG 26\" I had bought shut off sporadically after about 40 minutes.  But i was pleased to see when i replaced the old with the new how drastically better the quality was.  The energy save features are great and the sound and picture does not lack in the slightest bit.  5/5.", "Date": "October 21, 2009"}, {"Title": "Reconsider before buying LG if you intend to use a PS3 via hdmi", "Author": "Christopher M. Nolen", "ReviewID": "RU12A36H8LGI1", "Overall": "2.0", "Content": "I purchased this tv after reading the generally excellent reviewson this site; I should have researched further.If you have any intention of hooking up a PS3 to this tv, run aninternet search on LG, PS3, and hdmi problems before you do so.I'm sure the tv works fine for most who connect a PS3 via hdmi;however, based on the sheer number of internet posts, there isclearly an issue with doing so for many people.", "Date": "December 28, 2009"}, {"Title": "this tv is F#%@ing Awesome!", "Author": "B. Carter", "ReviewID": "R3QIB9KJR4KIBA", "Overall": "5.0", "Content": "I needed a tv for my dorm, so I did some looking around and I found this.  If I had the money, I would've gotten a 50+ in 1080p OLED tv, but being 90% cheaper ($408.06) I bought this one (and I've always been a fan of LG Electronics).  Video = 10/10.  Audio = 10/10.  It's everything a great tv is supposed to be.  The only feature it was missing, imo, is \"soft mute.\"  I miss that one from my last tv.  Still, this is one purchase you will Not regret. xD", "Date": "November 16, 2009"}, {"Title": "P.O.S", "Author": "rocklover11", "ReviewID": "R24SMJ1MAJBCZY", "Overall": "1.0", "Content": "If you like T.V's that last about a year, buy this one, p.s this will be the first and LAST LG for me!", "Date": "June 29, 2011"}, {"Title": "Good overall TV, but the sounds sucks....", "Author": "J. Koehler", "ReviewID": "RY5O3HUOGYK6V", "Overall": "3.0", "Content": "Overall I am happy with this TV.  It is used in a small room that is just for my kids basically.  Picture quality, remote functions, color, etc. are all good.  The sound on the other hand just is horrible.  We have it almost on full blast to hear it during movies.  I know this can be fixed with a good surround sound, but for the kids they don't need all that fancy gadgets.", "Date": "March 20, 2010"}, {"Title": "THE Best 32\" LCD on the market.", "Author": "Uncle Rico", "ReviewID": "R1DFAC5YPYCWUQ", "Overall": "4.0", "Content": "I am a very OCD shopper and must research each and every product I buy. Yes, I am in therapy for my problem. :) This TV has been superb. I have been to Best Buy comparing different models for the past month. No joke. Every review I have read and every salesman I have spoken to agree that the LG is hands down better. The picture tuning options and the sound wuality is what tops this LCD. A perfect TV for the bedroom.The only gripe I have with this LCD is that the inputs are all in the rear of the TV. I wish they had put it on one of the sides.  Otherwise, I would have given a five star rating.", "Date": "January 13, 2010"}, {"Title": "Good LCD TV", "Author": "H. Murray \"moneyman\"", "ReviewID": "R3DZQL462PNI4D", "Overall": "4.0", "Content": "Good TV with excellent picture quality.  Easy set up and easy to sync with satellite provider's remote.", "Date": "October 16, 2009"}, {"Title": "GARBAGE!", "Author": "SoFloBusinessMan", "ReviewID": "R1OX72S7WEHC7W", "Overall": "1.0", "Content": "Lasted only 2 years, used for about 7 hours a day, 5 days a week.blowing! boom, black.never buy LG AGAIN!", "Date": "February 3, 2010"}, {"Title": "Manufacturers need to show price honestly", "Author": "K. Landrus", "ReviewID": "RT9SXQ1IMI9XQ", "Overall": "1.0", "Content": "I haven't bought this TV, and won't bother, I'm sick and tired of Manufactures pricing games forcing us to add the TV to our cart to find out the price. This is a waste of my time when I am shopping for a TV.  Manufacturers need to honestly display the price on the search results, and product pages!", "Date": "December 30, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "LCD HDTV features with swivel stand and energy Star rated\n720p HD resolution 1366 x 768p with 2 x HDMI v 1.3 digital inputs\nInvisible speaker system with Dolby Digital 5.1 & Clear voice for richer more balanced sound & a polished look\nISFccc caple of professional calibration for picture performance\n30,000:1 Dynamic contrast ratio", "Name": "LG 32LH20 32-Inch 720p LCD HDTV, Gloss Black (2009 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41cCPst1psL._SX300_.jpg", "ProductID": "B001V5J7Q6"}}