{"Reviews": [{"Title": "There are Issues with this LED HDTV Its not all Good!", "Author": "B. Morgan", "ReviewID": "R2RHDPRUTAZNIO", "Overall": "3.0", "Content": "If you are looking for a latest technology LED HDTV you probably have come across this LED panel from LG.  I read the other reviews on here and am a little suspicious some of these people might work for LG?O.K There is good as well as bad and it certainly isn't all bad, but don't be fooled by some of the over zealous reviews on here about this product.  It looks great in the stores but might not do as well in the realities of your home. Please read on.The Good!The panel looks great cosmetically, its slim, the boarder is there (its just that it doesn't protrude from the screen like most its contained within the glass panel it self.  The price is competitive.Picture clarity under ideal viewing conditions is impeccable. 1080P and 1080I modes ee this TV perform at its best.  Connected to a Blu-ray player playing 1080P, with the all the blinds closed is top notch!!The Not so Good.The screen has some serious glare issues (as it's a glass screen) If you have this screen anywhere near a window(s) especially behind you the viewer, it's really difficult to get your eyes to focus out the images reflected from behind you.  My much older Westinghouse LCD has an anti-glare screen and copes much better than the LG does in usual viewing situations like this.  The 120 Hz True-motion setting just doesn't work and causes some serious pixel issues.  This effect can be seen clearly around people on screen.  The Panel works O.K when this feature is turned off.  Calibration and cinema mode settings seem to work just fine.Low resolution viewing (lower than 720P) is not that great and again is out performed, in my personal opinion, by my much older Westinghouse TV)I have found some strange issues watching recorded programs on my DVR such as \"Flash Forward\" the other night which had a great deal of dark scenes. It seemed almost like I was watching in Low resolution, the picture quality was not at all good.  However watching the latest Star Trek on Blu-ray is just outstanding - so I don't know if this is an issue with resolution, black levels or 1080I versus 1080P settings.Conclusion:If you are looking for a LED panel and have ideal viewing conditions and your primary input is going to be HD sources especially DVD's on Blu-ray, then this is the TV for you.  If you are going to be watching multiple TV programs in more realistic household settings you may want to look at other options with screens that are less glossy.", "Date": "April 2, 2010"}, {"Title": "Just Wow", "Author": "Scott Baker", "ReviewID": "RIW3CVYANJCIC", "Overall": "5.0", "Content": "I bought this for my brother for Christmas.  We set it up on Christmas day, and just sat and marveled at the picture quality.The only knock on this TV is the alternate ON/Off switch which is hidden on the bottom.  I don't know why they installed this feature, but it caused us a little stress when we couldn't figure out why the TV wouldn't turn on.Other than that (which is so minor), the TV is perfect.  I'm jealous!", "Date": "January 6, 2010"}, {"Title": "LG 47sl90 has beautiful picture", "Author": "Jim", "ReviewID": "R3O7DJF678ZLCM", "Overall": "5.0", "Content": "I bought this TV about three weeks ago. I still have an analog cable connection, but I was surprised at how nicely the TV upscales it. The sound is pretty darn good for such a thin TV, but I do plan to hook it into a separate audio system.My wife has a neurological disability and spends a lot of time with the TV. She really enjoys the new picture. One problem she has had is remembering which buttons to press on the increasingly complicated remotes that come with TVs and other electronics. LG included a very simple second remote that deals with only the basics. She is finding that a delight to use.I also bought an LG BluRay player and connected it to the TV. With the TV off, I put a disc in the player and was surprised to see the TV turn itself on, ready to play the disc. That makes things even easier to use.I can highly recommend this TV.", "Date": "December 7, 2009"}, {"Title": "LG LED Flat Panel", "Author": "Tom E. Poturica \"tepot\"", "ReviewID": "R20RK5ITM6EVAY", "Overall": "5.0", "Content": "One of the main reasons to get this flat panel over others is the lack of glare.  I looked at all brands and they all seemed to display the stores mercury vapor lights quite well except for the LG models.  There is no glare from my windows or overhead lights at home.. it is very nice.  The other beauty of this set is the clarity and display of colors that I didn't know existed.  We popped in Nemo for the kids when we first got and stared in disbeleif at how beautiful the charecters were in bright tropical colors...  It is also only about an inch thick and weighs only 40 pounds so easy for 1 person to move or even mount on the wall.  I couldn't be happier with this model from LG.", "Date": "January 27, 2010"}, {"Title": "Excellent choice", "Author": "Dr.B.Anil kumar \"Anil\"", "ReviewID": "R2X5LYK8ZA9Z3H", "Overall": "5.0", "Content": "I have this LG SL90 for the past 2 weeks.The picture quality is excellentEven the sound quality for such a thin TV is goodThe black level is excellent and I didnot find any motion blur even in fast action scenes. I am using LG bluray player through HDMI connection.", "Date": "February 27, 2010"}, {"Title": "LG SL90 LED/LCD TV", "Author": "Frederick J. Vollmer", "ReviewID": "R2K0SQ0PWMRIVE", "Overall": "5.0", "Content": "Exceptional picture. Compared TV's at Best Buy but noticed they didn't have this model on display (SL). Easy setup plus many fine tuning adjustments for about any picture quality you would want. Was very satisfied (five star) on service & shipping from this seller. Could not be more pleased.", "Date": "December 25, 2009"}, {"Title": "Great TV, bad TruMotion!", "Author": "Houston Jowell", "ReviewID": "R259J4VBK7ZX7H", "Overall": "5.0", "Content": "This TV is fantastic looking, but for watching movies the TruMotion setting must be turned off. Otherwise, the movies move like cheap shot on video movies. Very strange. After that's shut off, everything looks outstanding.", "Date": "February 11, 2010"}, {"Title": "Better than expected", "Author": "M. Fenwick \"harleymick\"", "ReviewID": "RNJQU2U53B9CR", "Overall": "5.0", "Content": "Bought the 47SL90 just before Christmas after researching many HDTVs including Samsung and Sony.  Overall the LG is better than I expected.  Picture is just fantastic, with super bright colors, great blacks and whites, contrast,  tru-motion video, etc.  Being hearing impaired in the human voice audio frequencies, the Clear Voice feature is great.  I can finally watch TV without closed captioning, or turning the volume up. Although I found the audio quality satisfying, I have added a Bose speaker system with sub-woofer to make it even better. Watching Blu-ray through my PS3 makes the movies jump out at you.  Fantastic!", "Date": "January 9, 2010"}, {"Title": "Absolutely Fantastic", "Author": "J. S. Patel \"Jigar\"", "ReviewID": "R17EAAEFEQ1SF0", "Overall": "5.0", "Content": "I was in Sam's Club and I saw this TV in opened items.It was slimmest TV in out there. I talked to store manager and he tested it for me to have a look it and check all the functionality.The TV looked great. It is not even an inch thick from the side. It has plenty of inputs and great features.I bought it for under $600, which is a great deal and I don't think it I have ever found something that cheap compare to MSRP.I have PS3 hooked up with TV. All Blu-Ray movies looks stunning. Even DVDs look really great.I watched broadcast channels only and all of them looked really great. It has USB connection option and it can play many file formats, which is great. You just hook up your external driver of thumb drive and start watching movies and photos.I am very tech savvy person and this TV is not Internet ready, but it does it job as TV really well and I am loving it.", "Date": "September 23, 2010"}, {"Title": "Incredible!", "Author": "Ron", "ReviewID": "R33F1D8LD1PB48", "Overall": "5.0", "Content": "OK....Even though I bought it at Sams Club as an Open Item and \"Orange Tagged\"...(you buy it you CANNOT return it) for $485.00......I would have STILL paid over $1000.00 for it once I had it set up running my DirecTV....Amazing Picture....I think Sam's still has some for around the $800.00 range..NEW........WELL WORTH IT!!", "Date": "October 2, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "LED Technology uses a full array of LED lamps which control the level of brightness for amazing clarity and color detail\n120Hz TruMotion Technolgy virtually eliminates motion blur for fast motion clarity\nIntelligent Sensor automatically optimizes the picture to the lighting conditions of the room for an enjoyable viewing experience\nFull HD 1080p resolution fro enhanced picture quality\nMega contrast ratio of 3 million to 1 provides sharper image quality", "Name": "LG 47SL90 47-Inch 1080p 120 Hz LED HDTV, Glossy Black", "ImgURL": "http://ecx.images-amazon.com/images/I/31xiwzWjQKL._SY300_.jpg", "ProductID": "B002QWHAPI"}}