{"Reviews": [{"Title": "The Sharp LC65E77UM Aquos LCD TV - Sharp Delivered!", "Author": "Steven Addair \"Ironman\"", "ReviewID": "R343P32Q0WJNJ0", "Overall": "3.0", "Content": "I have had this TV for a couple of weeks now.  I waited a month from the day I ordered it to the day it finally arrived.This TV is not heavy and it was easy putting it up on the wall mounted rack.  I was pleasantly surprised.Let me get this straight to anyone who is concerned, the gold bezel is like a faint gloss on the bottom of the TV.  Hard to notice.  I am not certain why they put that light color on the set, but you have to strain to notice it.  When set up on in my theater room, this is not noticeable in any way.  Don't worry about it if you are dithering on purchasing this set because of the gold bezel.The picture is stunning and excellent.  It is the best picture I have ever seen on a set.  It's got some interesting features, for example the TV has a built in ambient light sensor which ramps the brightness of the picture up and down based on the light surrounding the TV.  Turn it off.  It dulls the picture quality in darkness.  I have found no way to make it useful.Folks, this TV has two major flaws but there is a work around for the first so bear with me.  The second issue, only time will tell.First, the TV seems like it is designed to be the hub of all of your HDMI components.  The folks at Sharp assume that everyone will rush to buy a Sharp AV receiver, Sharp Blu-Ray player, etc. and have them work together with their Aquos Link.  They are dreaming.In my setup, I use a Pioneer AV receiver, a Panasonic Blu-Ray player and a DirecTV DVR, Satellite Receiver.  All is HDMI and state of the art.I wanted to pipe all of my HDMI components through the Pioneer AV Receiver and send an HDMI video signal to the Sharp TV.  Works fine except the Sharp TV pops up a message \"An Incompatible Audio Signal Has Been Received, etc., etc.\".Folks, I turned off the audio of the TV (selectable from the Sharp Menu), turned off the Aquos Link and I still got the message.  Turns out, the TV REQUIRES PCM audio NOT HDMI only!!!!  Even if you turn off the speakers on the TV, it still pops this silly message up.Interestingly, there are only two ways to get this message off the bloody screen.  First, you can turn the volume off the Sharp TV down to zero.  Voila!  The message goes away.  The other way is to find a way to disable a pure HDMI audio signal from your AV receiver.Okay, I found a work around by turning the volume to zero, but you would think that Sharp would be more interested in working with different HDMI components that are not Aquos Link.  Nope, they don't.  Very disappointing.There is a second flaw that I do not know if it will fix itself or not.  The bloody set \"pops\" loudly every few minutes or so.  It's like the plastic is settling when it heats up.  It's a strange noise but seems to be reducing over time.  I don't like this problem as I don't have a work around.  Time will tell.Hindsight being 20/20, I think I would get a Sony or Samsung 65 inch LCD knowing what I know now.  They are more expensive by 25% or so, but these two issues should not be in a high end TV.--------------------------------------------This is an update to my earlier review.  One month after ownership.Couple of things I would like to report.  I have downgraded this TV to two stars.1.  The \"popping\" sound hasn't gone away.  It's still popping as often as ever.  This is very annoying.2.  I have 4 pixels that have gone bad.  They are very noticeable on the screen.  they appear as white lights on the screen on a dark background.3.  The screen wants to adjust itself when it thinks it is too bright a picture.  Even when I have this feature supposedly turned off.  When moving from scene to scene, this \"adjustment\" is visible and annoying.  It distracts you from the movie.4.  One thing I forgot to mention in my earlier review, I attempted to pipe all the HDMI components into the TV (as Sharp seems to think this is the best way), then pipe the sound output to my Pioneer AV receiver via a fiber optic digital (can't output HDMI from the TV).  The TV DOES NOT pipe the native sound through from the components.  The result was a downgraded sound from the TV to the AV receiver.  This is why I decided to keep the AV receiver as my component hub because I wanted to enjoy the surround sound as the sending component (Blu Ray) meant it to be heard.My observation / advice is:  don't buy this set.  Sharp needs to work on the end product for a year first.  Too many issues.  Again, the picture is excellent.  No complaints about the picture quality other than the dead pixel issue and goofy auto brightness feature that won't turn off.------------------------------------------------------More info on the dead pixels.  Just had a warranty person from Sharp come by and he found 10 more dead pixels on the screen that are not as bright or noticeable.  Hopefully sharp replaces this beast as that totals 14 dead pixels.As far as the popping sound.  I am told I will have to live with it.---------------------------------------------------------Latest update - Sharp replaced the set quickly (they paid shipping both ways).  Their shipping company helped take the defective set down and put the replacement set up.Only one dead pixel on this set.  Much better and acceptable.No popping sound either.I am much happier with the Sharp now that I replaced the defective set.  One thing to remember is that my defective set was one of the first ones out of the new manufacturing plant.  This replacement seems to work fine.Thank you.", "Date": "October 11, 2009"}, {"Title": "Great experience with Sharp USA....", "Author": "M. D. McLain", "ReviewID": "R23MGV4AJ6MHA3", "Overall": "5.0", "Content": "I originally purchased a floor model 65inch Aquos LCD TV model 65D64U from Sears in September 2009. Sears had the floor model for some time and placed it on clearance with a price that was unbeatable. I trucked the TV home and it looked pretty good for the first two weeks. Shortly afterwards however, two ghost like horizontal bars streched acrossed the screen that were about one inch in length each. I left it alone hoping it was a bad input or poor signal from my Dish Network HD box. The lines persisted, even with other components hooked up to different inputs. Needless to say, I was not very happy with the picture as the bars were awfully distracting.I contacted Sharp via their Aquos Advantage online chat and was told to take several pictures of the problem and send via e-mail to their customer service. I did as instructed and recieved a phone call the next day. The representative set up an in-home repairman visit for the next business day. The repairman came as promised (and on time) and related that the problem seems to lie within the screen for which he can not repair. He called Sharp and notified them that he can not repair it. I was told that I should recieve a call from Sharp within three business days as they had to send a request to the powers that be to determine if they were going to exchange the television, or attempt to repair same.Sure enough, I recieved a call within three business days from Sharp who promptly advised me that they will exchange the television, free of charge, which includes shipping and returning the old unit back to them. Even more astonishing I was told that my current television is \"old\" and has been discontinued. I thought \"great, now I am going to have to come up with the difference for a new model TV\". But, not only did they not give me a hard time about the \"old\" discontinued model, but they advised me that they were going to exchange it with their newest model (LC65E77UM)! I was told it would be shipped via freight and may take several weeks to recieve. I only waited a week before it was carried in my front door.This newer LCD exchanged TV looks great and has noticably better picture quality than my previous. I wrote this review because I am a skeptic when it comes to manufacter warranties, especially when it comes to high end electronics. I expected lengthy repair orders, shipping it to them, and being without a TV for a month or two. However, the time I notified them of my problem, to recieving a brand spanking new (upgraded) TV, was less than a month. Only paperwork required from me was to fax a copy of my proof of purchase. They took care of the rest. I applaude Sharp for upholding their warranty and resolving the issue quickly and hassle free. I will definatly continue to buy Sharp products knowing that they stand behind them when they fail!", "Date": "December 24, 2009"}, {"Title": "One year later and this set still ROCKS.", "Author": "J. Poliseo \"Joe\"", "ReviewID": "RCNHEHK5SK4A5", "Overall": "5.0", "Content": "UPDATE:  It's been one year since I posted my original review and I stand by every word.  I simply have not seen better picture quality (sharpness, brightness, color saturation, etc...) on any other LCD set, of any size, than the one that sits in my family room.  The picture remains stunning and the set has performed flawlessly.--------------I just hooked up this set and am thoroughly impressed.  How can you beat this for the money?  What do people look for in any TV set?  Picture quality!  Look no further folks - the picture quality is absolutely superb (no dead pixels).  Why would anyone want to pay more for a Samsung or Sony?  They undoubtedly make very good 65\" sets.  But what are you getting for the extra thousand dollars?  An ethernet connection?  240 Hz technology?  Both features are completely overrated in my humble opinion.  You won't be disappointed with this Sharp Aquos.  It's stunning.", "Date": "October 22, 2009"}, {"Title": "best value for your investment", "Author": "An Amazon Customer", "ReviewID": "R1XK2P0HLFZ7UK", "Overall": "5.0", "Content": "1) The best HD set I've owned when it comes to picture quality; there's no better way of describing the picture quality of this set than the reviewer 'Audio-Video Nut' has put it \"The picture of this set is beyond compare to the other LCDs and Plasmas. The HD is 3-D like.\"2) The worst HD set I've owned when it comes to sound quality.3) I have not heard any 'pop' sound; I believe Sharp has fixed the problem at this point in time.4) The set is light; ready on the stand out of the box.  Service from the seller (Audio & Video Center) is excellent; service from the carrier (PIM) is horrible.5) Overall, I believe this set gives you the best value for your money.  I am actually looking into buying a second set, instead of the planned Samsung UN55B8000 (55-Inch 1080p 240 Hz LED).", "Date": "November 27, 2009"}, {"Title": "The best 65 Inch LCD", "Author": "Audio-Video Nut", "ReviewID": "R3DDOTTNMPJ7VK", "Overall": "5.0", "Content": "The picture of this set is beyond compare to the other LCDs and Plasmas. The HD is 3-D like. Actually I can see the variations in HD Camera quality as I switch HD channels. I have mentally created a list of HD channels(Sports/Movies/etc) with the best picture quality. The set's sound quality is OK, but if you have surround sound system like I do, nothing to complain about. Another issue with surround sound systems built in, is the total lack of high SPL BASS(20 Hz or lower) to be realistic. I've had this TV since 10/06/09 and have not noted the quality issues(popping noise and dead pixels). I did find though some of the HD cameras that some of the stations are using have dead pixels or need to be calibrated(Used Blue-Ray and switched HD Channels). Picture and Sound quality aside, the best feature I love about this set is the OPC. This feature controls the Brightness and Contrast in the viewing environment. With a huge skylight in my Family room, the ability of this set to mitigate a very bright environment and use so little power is amazing. With the OPC showing 2 green leaves at 12 noon, the set consumes 330 watts. When the sun goes down, the OPC shows 8 leaves and consumes 130 watts. Wow! Thats like having your cake and eating it too! Totally amazing!", "Date": "November 25, 2009"}, {"Title": "Sharp Aquos!!! There are noe better!!!", "Author": "JPR", "ReviewID": "R1D4G43805ZJ6V", "Overall": "5.0", "Content": "I did a lot of research before I bought this TV. I purchased mine about a year ago, and everyone who comes to my home asks me what kind of TV it is. I viewed it side by side with a Samsung 240Hz LED at a Best Buy Magnolia Store in Kansas City. There was no doubt in my mind the Sharp had the better picture. It is crisp, & clear, with no haze of the blacks like my Sony's. I almost never take the time to write reviews, but Sharp has won a very loyal customer here, and you will not be sorry if you purchase an Aquos TV.", "Date": "November 27, 2011"}, {"Title": "Best 'affordable' 65\" LCD on the market, AquosAdvantage earns their keep", "Author": "N. L. Steele \"Early Adopter\"", "ReviewID": "RNAQ10U7H81OB", "Overall": "5.0", "Content": "This set was purchased to replace our substantially older LC-45D40U also from the Aquos lineup. We've always been happy with the Sharp LCDs, as they tend to present the best features and picture quality at their pricepoint. Historically customer service was a question mark for Sharp, but in recent years they've stepped their game up and are doing everything they can to maintain customer loyalty. I'll mention more about this later, but first the set itself.Bought this in January '10 through another e-tailer for $2778 and felt it was a great deal. Generally, the price of 65\"ers hasn't come down since and in fact has risen in some instances. If you do go for an online deal be wary about counting \"free delivery\" against your pricepoint as this will likely wind up being a non-option. Free delivery is often UPS delivery and you would not want UPS handling a box this big with something this delicate in it. Plan on spending $100-$300 for a freight service if you'd like not to have to send the first unit back. Be wary of e-tailers offering extended warranties as well. You'll want and be offered Sharp's Aquos Advantage extended plans by Sharp themselves at the point when your Sharp warranty is about to expire. The cost of this is substantially less than third-party warranties, and the manufacturer (while they do subcontract to the same local repair shops the third-party services use as well; AKA people who likely hate their jobs and will take it out on your TV) MAKES THE TVs and CAN REPLACE IT WITH A NEW ONE OF THE SAME OR LATER MAKE. Every third-party warranty I've had (including the one Circuit City lied to us about the terms of on our other Sharp set, and the one I stupidly purchased with this set) include terms that allow them to replace your set's parts with non-standard parts and replace it with a refurbished set of a different make but \"equivalent function.\" They also generally contain terms that allow their inaction until not covered by \"other warranties\" including the manufacturers, so subtract a year from whatever the sales person is telling you. You'll want to stick with the manufacturer for something this expensive and after I tell you about my experiences and at last notice a 3-year extension with them would run about $450 and be worth every penny.If you buy this or any Sharp set, ensure that the firmware is the latest version from Sharp's website (and be sure to use a FAT formatted USB drive without anything else on it to update). The firmware SIGNIFICANTLY improves picture quality on this set. Also, use \"User Mode\" in \"AV Modes\" when you calibrate as this mode provides the greatest dynamic range and flattest starting point from which to calibrate; DO calibrate, don't go with someone else's settings online as the sets themselves vary within product line (I've now had two of these and they calibrated to significantly different numbers to get the same picture).Be aware if you're buying a set this large that standard definition television and poor connections are not going to provide you with the most satisfying experience. This size even at 10' or 11' demonstrates the flaws in poor quality signals. Thankfully it rewards you equally for good connections and source material. I've never seen movies like I've seen when playing blurays via my PS3 connected by HDMI and in 1080p 24fps mode. The picture is crisp, the darks are super dark, the brights are blinding, there's good shadow detail, and only the most trivial of pan juddering (that would otherwise be corrected by Film Mode being set higher). If you're playing these and getting an oddly soap opera video quality, try adjusting the \"Film Mode\" under \"Advanced\" to the \"Standard\" setting as this will disable the interpolation that creates this effect when watching 24fps tagged materials.I shopped for a long time, I looked (and encourage you to look for yourself) at LED edgelit, LED backlit with local dimming, and CFT backlit sets from Sony, Samsung, Vizio, Sharp, and Panasonic. None offered a better picture for anywhere near the price. Each manufacturer has their own quirks that you should make yourself aware of (AVSForum is a great place to find these in owner's threads) before buying. I've even compared this set to the later Quattron 60\" models (810 and 820) from Sharp and do not find a picture quality improvement worth giving up the 4.5\"es of real estate (which actually adds up to a few square feet of picture space when converted to area).When I went shopping, it was with a singular goal in mind: To buy the biggest TV I could afford with excellent picture quality. The 65E77UM satisfies that goal and then some.Pros:-**Huge** set (we moved up 20\" with this and the difference is phenomenal); it's obscenely big-**Excellent** picture quality (with updated firmware)-Nearly no lag for video gaming (search online, lag is ~1 ms in Game AV Mode which disables post-processing; this stomps on other sets, especially Samsungs which cannot disable much of their post-processing; I play both Xbox 360 and PS3 games on this set and they're phenomenal)-Comparatively lower energy draw than equivalent or even smaller plasmas-Brighter and less glossy display than Plasma and many contemporary LCDs for rooms with uncontrollable ambient light-Excellent connectivity-AquosAdvantage customer service can't be beat (see below)-At this price, you'd be looking either at LED sets that are 2' smaller and the same price or 2.5X as much, or half of another manufacturer's CFT-lit set. The Sharp handily bests their price (and their picture quality in my opinion)-Excellent adaptability to environment and calibration (brightness range, OPC, and depth of user calibration options)Cons:-*Way* non-standard VESA mounting pattern (there are only about 3 or 4 mounts that will work with this set)-Built in speakers are not on par with the picture and size (but if you're buying a ~$3,000, 65\" TV and don't have a home theater speaker system of some kind, you need to reassess your priorities)-You'll pay for what you get with shipping a set this large (plan to spend $100-$300 out of pocket for freight)-So many settings to adjust color (basically 5 per color) and gain that some users may find it difficult to calibrate (but I find this a significant plus as this is my hobby and I enjoy trying to get as much out of my investment as I can using DVE's calibration bluray)-Minor juddering in pans that can be corrected with film modes, but then creates soap-opera effect I find more off-putting (this issue is common to all LCDs)Asides:-If you're cross-shopping this against current sets that have ethernet connectivity, bear in mind that most of the devices you likely have attached to your set have this (Xbox, PS3, Tivo, even AVRs often have this these days; to me this is a non-issue)-The gold bezel is a non-issue. you can't actually see it as it winds up looking like reflected light on the bottom edge-This set is deeper than LED lit sets, but given the greater size, lower pricepoint, and equivalent picture quality, I can do without a giant iPhone. This set is actually very handsome and I'll try to post some photos once I've got my wires hidden-If you're mounting yourself, this set has the advantage of being much lighter than an equivalent sized plasma (BUT DO check the VESA pattern against any mount you consider buying, it's very non-standard)-For folks having a hard time finding this information, Sharp confirmed that the contrast ratio on this set is 50,000:1 (better than the native contrast on Panasonic plasmas for comparison)Aquos Advantage Customer Service from Sharp:While Sharp didn't have a great customer service reputation for a few years when their sets experienced banding, they've come lightyears ahead of even other manufacturers in order to encourage a loyal customer base. My set developed an issue with the panel after 6 months (basically a red line halfway down the screen on the far right). I posted a picture and description of the issue to Sharp's Facebook page and received a call within 48 hours. Their CSR worked with me and the local shop (who managed to fight them the entire way) to try and repair the issue. He consistently called on my cell and house phone to follow up and see what service quality was like. At the end of the day the set had to be replaced, Sharp sent a new set out, took the old one back, their delivery people mounted the set and let me test it fully before signing, and they even gave me a 3 year extension on their warranty from the day I signed (i.e., if this set goes, it'll be replaced with whatever the next best set is). I was offered a brand stinking new LC-60LE920UN, and after staring at a 60\" 810 and 820 set at the local BestBuy, I opted to take the LC-65E77UM instead. The newer sets just don't make that much better picture than the 65\", and with a 3 year warranty, if this set goes they may even be producing he 68\" led edgelits by that time in which case I'll move up in features and size. I couldn't be happier with the speed or care that Sharp handled my claim with. All manufacturers and third-parties will use local shops for their warranty work, but only a manufacturer can offer you a new set to replace it. They've even offered me a set at a deep discount to replace my out of production 45\" that has banding issues that cropped up after Circuit City's warranty had expired. I've *never* had this good an experience with customer service, and I *am* the squeaky wheel.To be completely honest, I could live with this set for the rest of my life and be giddy every day to watch it. Be ready to turn into a picture snob. Be ready to have your friends embarrass you by bragging about your TV to your other friends. It's worth every penny and then some.", "Date": "August 21, 2010"}, {"Title": "Excellent HDTV", "Author": "Derek White", "ReviewID": "R3HI5RV4VK2ORQ", "Overall": "5.0", "Content": "Pros:1) Fantastic picture, colors, etc.2) Deals with fast motion very well (no discnerable problems in handling motion)3) Great price.4) No dead pixels5) Easy menu and setup.6) Great looking set (I'm not really sure what people are talking about regarding the gold bezel. If it has a gold bezel, I sure can't see it. It looks all black to me.)Cons:1) My set leans backwards slightly instead of standing perfectly vertical. I'll contact customer services about this.Note: I have no idea what the internal speakers even sound like because I only use my Denon receiver and home theater speakers and I haven't seen any error message about incompatible audio like at least one reviewer has.", "Date": "January 14, 2010"}, {"Title": "Love it!", "Author": "Kevin T. Hackshaw \"The Original Trini!\"", "ReviewID": "RG3SJ6362UP3B", "Overall": "4.0", "Content": "So I upgraded from a Samsung HL61A750 LED based DLP to this bad boy and thus far I am very satisfied. I really wanted something bigger as well as something that i could wall mount eventually (currently I have it sitting on the stand). I looked around for quite a bit and was pretty much set on picking up a 73\" Mitsu DLP when I saw this TV sitting in a corner. It was being clearanced out for $1800 and I figured, why not? Have had it for the better part of a week, so no, this is definitely not a long term test but more initial impressions.Physical Design: Well to be honest, it pretty much looks like all the other LCD's out there. Black frame (Slight bronze finish at the bottom, but not very noticeable), no shiny bits and only a small green led in the right corner to let you know the unit is on. No real complaint there.Setup: Has a good # of HDMI (4) and component inputs. Overall, hookup is easy, had my Xbox 360, Media PC, PS3 and Directv HD DVR hooked up through my Denon AVR-890 pretty quickly. The onscreen setup process takes a couple of minutes and the OSD screens are easy to navigate.Remote: Horrible. really horrible. Get a Harmony asap. When you consider that this is supposed to be one of Sharp's higher-end units, this remote really does feel down market. It's not very ergonomic, not backlit and the buttons just feel funny.Sound: Sound from the built-in speakers is ok. I mean, really, if you're going to get a 65\" TV that a picture that rivals the one in the theater, why not get some speakers? People complain about speakers all the time and really, it's a stupid argument.Picture: Thus far, really good. The pic off Blu-Ray through my PS3 is excellent. 1080p/i through Directv is also really good. Of course the image from standard-def can be pretty bad, but then again, I didn't buy this TV to watch standard def. Running my Media PC through HDMI was also an unexpected plus-I wasn't expecting it to look that good. Xbox 360 (using the Xbox 360S) also looks great.I'm still messing around with the settings to get it just how I like it. On that note, Sharp gives you an abundance of user-configurable settings that can help you set a great picture. However the manual does little to explain some of them (I had to google a couple of the advanced settings). That being said, I messed around with things until I got a picture I liked.I know Sharp is phasing out the 65\" and focusing mostly on the 55 to 60 market, so if you can find one of these at a great price I'd say jump on it. I paid $2074 for this with tax, shipping and a 5 yr service plan at Brandsmart in Doraville, GA. I'll update this review after I've had it for awhile. This is my 1st Sharp after having 2 Samsungs and a JVC LCD and thus far, this Aquos definitely impresses.", "Date": "August 9, 2010"}, {"Title": "excellent product", "Author": "Wayne M. Allen", "ReviewID": "R2QTPQCGXZBLSM", "Overall": "5.0", "Content": "Very nice packaging and easy setup guide. Best picture Quality I have everseen. Colors are unbelveiable. I would highly recommend this to any serious sports fan!Better then being there.", "Date": "March 26, 2010"}, {"Title": "Best TV I have ever owned.", "Author": "R. Gilbert", "ReviewID": "R3MYXVJ5IQ9887", "Overall": "5.0", "Content": "I would 100% recommend this product to anyone.  The picture quality is superb, absolutely no motion blur, and the viewing angle is incredible.  I mounted this unit on the wall in about an hour and was watching HD video from there.Absolutely no glitches with it, delivery was on time, and the guys were very professional getting the unit out of the box and ready for me.100% satisfied.", "Date": "March 4, 2010"}, {"Title": "otto's amazing \"amazon\"", "Author": "Otto Horvath \"electronic maven\"", "ReviewID": "RCQFSUBXCQ5WA", "Overall": "5.0", "Content": "The best 65\"lcd hdtv we had yet!!!!  It is a very nice looking lcd tv with a beautifull picture&great; product!!!Never mind the \"gold bezel\"it is look just like the whole frame is black!!Anyway it makes are basement like a litle CINEMA specially with playing Blu-ray disks.", "Date": "February 10, 2010"}, {"Title": "DON'T BUY THIS!!", "Author": "bigdog", "ReviewID": "R2AQUS31GUU7AW", "Overall": "1.0", "Content": "Save your money.  Don't buy this piece of junk!We bought one and 2 years after good use it broke and now they want $5000 to fix it.  That's morethan the cost of the machine.A $4000 dollar TV shouldn't last 2 years!This is the biggest rip off ever!Sharp should be ashamed of themselves for such a crappy product!Any questions, please feel free to contact me.  I am posting this on every review board I can find tosave everyone their money.  AVOID SHARP!!", "Date": "December 8, 2010"}, {"Title": "Goes great with my gold trim bathroom.", "Author": "Thinh Dang \"No stock\"", "ReviewID": "RIZF3VLP48V9L", "Overall": "5.0", "Content": "Pro,Great price, nice picture.Con, Gold trim?,..me no likely.", "Date": "October 11, 2009"}, {"Title": "Cheapest 65in lcd on the market and it shows!!!", "Author": "J. Akins", "ReviewID": "R3C869H6Z8OT9", "Overall": "3.0", "Content": "First my set up.I have Dish network that is not HD.It is hooked up to the TV using S-Video.I have the OTA antenna hooked to a Panasonic Digital DVD recorder.I am using HDMI from the recorder to the TV.The picture using Dish Network is not any better than my old Sony 57in CRT TV and not as good as my 27in Olevia lcd TV.Just letting you know that unless you spend the extra Dollars for the HD programming this TV will not be HD on SAT even on local HD broadcasts( I have no Idea why my Olevia has a better picture,both are using Dish Network ).When watching the OTA broadcasts the picture is much better.But even when the broadcast is in HD The picture is still no better than my Olevia Tv.The picture is not that bad but is not that great for a $3,000+ set.The SOUND is really bad even wide open it is still really low and is not very clear.I know I will be in the market for a Home theater system.As you can see I am a little disapointed with this Tv.I am not an expert on HD TV's but I had expected much better.When you first get this set go in to the menu and turn off the OPC it just makes the picture Dimmer and this picture needs all the help it can get.I have not noticed the popping the other reviewer mentioned.Once in the week I have had it when I turned it on and the sound was cutting in and out very fast.As for the Gold Bezel you have to look very close to even see it.If that was my biggest complaint I would be a Happy Camper.I would have Rated this TV 2 1/2 stars instead of 3 if it were possible.I do not recommend this TV as a good buy for the money.I am ashamed to let people I know how much I gave for a set with this picture quality.If any one has any suggestions on how I can improve the picture Quality short of paying extra for HD on dish network.Feel free to let me know.Thanks jakins", "Date": "October 12, 2009"}, {"Title": "Why the GOLD bezel ?????", "Author": "Davyo", "ReviewID": "R2PLHIBJAC95Y2", "Overall": "3.0", "Content": "Since this 65\" Sharp has not be released yet my review is only about one thing that I do know about this Sharp so far.I been waiting for a while for this Sharp to get released and then the pictures and info finnaly come out, its got a GOLD bezel ????What in the world is Sharp thinking ???Is the gold suppose to match everything else in my hometheater set-up,,,,, like my Gold colored HD cable box and my Gold colored BluRay player and my Gold colored HD DVD player ?When will these stupid panel makers figure out, most, if not ALL, of us consumers of us want a matt black bezel that does not reflect room lighting and we dont want shinny gloss black or chrome or gold or red accents on out flat panels !!!!I will probaly buy the Sharp 65\" LCD when it's released, but I will buy it \"in spite\" of how it looks and not \"because\" of how it looks.I will also buy a can of matt finnish black spray paint from HomeDepot to paint over the gold accents.CheersDavyo", "Date": "September 24, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "65-Inch Full HD 1080p HDTV LCD-TV with 120Hz Fine Motion Enhanced\n10-Bit AVS Superlucent LCD Panel\n4 HDMI terminals, PC input, RS-232C Input\n4ms response time\nSpectral Contrast Engine XD for Deep Black Level", "Name": "Sharp AQUOS LC65E77UM 65-Inch 1080p 120Hz LCD HDTV with Gold Bezel", "ImgURL": "http://ecx.images-amazon.com/images/I/41uonxvdE4L._SX300_.jpg", "ProductID": "B002GYW8MG"}}