{"Reviews": [{"Title": "Experienced Installer's Opinion", "Author": "Jonathan B. Smith \"Geeky Brute\"", "ReviewID": "R21LBUWWBQV2J0", "Overall": "5.0", "Content": "Please read all other reviews for in depth likes and dislikes of this WD-65C9. If this TV seems like it may be right for you, then consider my advice.Having installed hundreds of televisions for B***B**, I've seen just about every brand and model of HDTV available, priced from a few hundred dollars all the way to $30,000 for boutique sets.  With plasma and LCD sets, picture quality can vary wildly.  However, with any new DLP projection HDTV, of which only Mitsubishi models remain, you are guaranteed a vibrant picture with deep blacks and no ghosting.Everyone should be assured, the C9 series has the exact same image quality and 3D readiness as the 737 and 837 models, and at a significant discount.  In my opinion, the very few additions to the 737 and 837 series are unnecessary and not worth the money.  I purchased this TV on one of it's low-price swings, and at around a thousand I feel like I stole it.  Projection sets of this quality were priced around $6000 only a few years ago.  But these prices won't continue to go down.  It isn't cost efficient for any company to sell such a large piece of electronics for much less than $1000, not to mention if you can get free shipping.So my last piece of advice to anyone interested in this TV, definitely buy this WD-65C9, but watch the price fluctuations, and make sure you get a fair deal.", "Date": "February 25, 2010"}, {"Title": "Great price and value", "Author": "Melvin M. Shimizu", "ReviewID": "R1FED9ZQX51T5M", "Overall": "5.0", "Content": "I chose the DLP over the plasma/lcd because of my reviews on the internet showed that there is practically no difference in picture quality and the prices are so much better for the DLP.  I wanted the Mitsubishi because of the name and I wanted the biggest screen for the price.  The price break seemed to be at 65\" so that is what I went for.  The price on Amazon was at least $300 cheaper than at the stores plus no sales tax would be another $120 in savings.  No shipping and handling charges was another plus.  The Fedex guy helped me carry the TV in even if it was curb side only.  Very good purchase and I have bought a sound system as well from the same vendor to complete my system.", "Date": "September 22, 2009"}, {"Title": "Mitsubishi wd-65c9 dlp", "Author": "Gary L. Anderson", "ReviewID": "R3HKLLSZHEXIEG", "Overall": "5.0", "Content": "Absolutely fantastic, from the ordering, shipping and arrival. The picture is fantastic. I have had football parties every week since I received it and the response has been great. My guest can't believe the picture quality and price I paid. I also ordered the hdmi cables from amazon not only for this dlp but for 2 other lcd's I have in my office and kitchen. I have it hooked up to dishnet hdtv programming. I have left all the settings for the Mitsubishi at the original factory settings. the hd movies (picture) and with my multi-channel receiver is fantastic I highly recommend this over any of the largest LCD's. Mitsubishi WD-65C9 65-Inch 1080p Flat panel DLP Home Theater", "Date": "November 4, 2009"}, {"Title": "WD-65C9", "Author": "Jim", "ReviewID": "R1JRMKBHOG2637", "Overall": "5.0", "Content": "Great TV with amazing color.  It is extremely bright with great definition.I do not like the 120 HZ mode since it seems to cause a fuzzy picture.  I opted to disable the 120 HZ processor and just use the 60 HZ mode and it handles sporting events and fast motion just fine with no hint of blurring or ghosting.  The TV handles the SD channels just fine and even those look great but, of course, not as good as the HD channels.After searching for more than a year on a DLP TV, I decided that this one met the price and quality requirements that I demanded.  So far, I have not been disappointed.  It took a while to find a setting that I liked but after some tuning it is one of if not the best looking picture that I've viewed.", "Date": "September 12, 2009"}, {"Title": "Excellent TV-WD-65C9", "Author": "J. S Thomas \"Jethro\"", "ReviewID": "R1YP45IFSXA32B", "Overall": "5.0", "Content": "I wont hash over all the details, however, I have owned several HDTV's LCD and Plasma and purchased this due to its size and price.  I had looked at several stores which had the tv but the picture quality was so so.  The sales people said it was due to all the tv's running off one box.  I came across this TV on Amazon with the Pinnacle stand included but offered from TigerDirect.  I crossed my fingers and took a chance with everthing showing up within a week of ordering.  I had the stand together in about 15-20 mintues.  The tv looks like it would be heavy but its not and was easily placed on the stand.  The picture is set to brilliant and was simply amazing and HD channels.  I put in a blue ray and was just blown away by the clarity and detail and colors and darks.  Mits has done an outstanding job of providing large screen HDTV for bargain prices compared to LCD, Plasma, LED which easily are 2-3 times more.  If your looking for big screen for movies, games, just everyday viewing this is it...I would recommend a UPS battery backup just in case of power outtage with the TV due to an internal fan that cools the bulb.  The only negative i can see is having to replace the bulb. However, a buddy of mine that turned me on to this tv has had his for over 2 years and still on same bulb.  Just get it and get your socks blown off when you watch it...its that good of a picture..........UPDATE 2/2...going on 6 weeks now and it seems the picture is actually Sharper due to bulb breaking in...no issues at all.  One thing I did do is buy a battery backup in case of power outage as this can save you a bulb.  If the power goes out the battery backup kicks in and will continue to power the Tv and most importantly the cooling fan in the TV so it does not over heat and burn out...well worth the cost as I already had a power outage and the backup worked as designed.  I see one person gave the TV ONE star due to it being damaged upon delivery.  This should be disregarded as the TV is INCREADIBLE and the stand is excellent. I Tiger actually credited me back $100 on my purchase as the TV/Stand Combo dropped $100 since my purchase and within their price match period.  This TV will knock your socks off and xbox and playstation games come alive on the screen......", "Date": "December 23, 2009"}, {"Title": "No longer in love with this TV.  It's been only ten months.", "Author": "Austin reader", "ReviewID": "R2Z2TVNNNHTU05", "Overall": "2.0", "Content": "I drifted away from watching TV over the years.  There are just too many commercials to make watching it very enjoyable, both on cable and local.  Recently I started renting and buying TV series on DVD.  I have found watching shows this way to be so much better, in all ways.  I decided that since I now watch a bit more TV, and always rent movies rather than go to theaters, I needed a better TV than my seventeen year old analog set, which is still in very good shape, I must add.  As I compared picture quality to my old set, all new Plasma and LCD sets just didn't measure up.  Then I found DLP.  Wow!  This TV, is amazing.  The first HD broadcasts I watched just blew me away:  It is as if the people on TV are in my den with me.  It is really that clear.  Hooking up my blue-ray player completed the almost mystical viewing experience. This TV was so easy to get up and running.  The programming took about ten minutes.  Yes, as others have said, you will need to tweak the settings to maximize picture quality, but that's true with every TV out there.  Big deal, you'll sail through the process if you have a brain.  The manual is not great, in truth, so just stay calm and follow the on-screen menu.  The only negative, a few days into ownership, is that you cannot have separate channels set for antenna vs. cable feeds:  If you scan for one, you wipe out the other.  That is a big drag if you use an A/B box to bring in local HD channels on an external antenna, so keep that in mind. Also, once you switch to external speakers, the volume is no longer controllable from the TV setting on the remote.  You need to program the remote to \"see\" your stereo.  Strangely, there are no codes given or instructions how to program the remote.  I had to call Mitsubishi.  That was easy and quick, but kind of silly.  In the future they need to include the codes and instructions.  Other than those two negatives, above, I really like this TV.  The price is very right, and the picture is great.Update: 7/2010  The tuner on this TV is terrible, and I mean TERRIBLE!  It takes far too long to switch channels if you are not using a cable box.  It also periodically adds channels that are not broadcasting.  I still love the picture and I still recommend this TV, but it is probably not meant for non cable box users.  Bluray is still amazing.  Update: 1/2011 The main circuit board has failed.  The internal speakers are dead and I can no longer access channels in a linear progression (ie. 3>4>5, etc.) using the remote.  While the picture is still superb, the internals are garbage, as I see it.  Warranty work will be done in two days at no charge.  I expect new board to fail within a year. UPDATE:  New board put in, left speaker is dead.  New speaker put in, everything fine, for now.  UPDATE: 6/2011: Sadly, I must give this TV a NOT RECOMMENDED rating for anyone who is going direct from their cable to the TV. It simply has a terrible tuner that continues to get worse, over time. It now adds four to ten non-broadcasting channels each time the cable company tweaks their feed. I have a newer TV to compare this one to, and the newer one has no trouble \"knowing\" which channels are actually broadcasting. I get very tired of having to erase scores of added channels that just give you a blue screen. If you have a cable box tuner, I would imagine this TV will work, for you. All direct folks, pass it by. UPDATE, 8/2011: The right speaker failed. Now that this TV is no longer under warranty, I made the right move: I clipped both internal speaker leads, ran wires neatly out the side and connected a $50 pair of SONY home theater speakers. The sound is now GREAT! The left speaker failed months ago and was replaced, under warranty. The internal controller board failed, as well. All in all, great picture, garbage internals. UPDATE: 12/13: The internal tuner has failed on the main board.  You cannot watch TV for longer than ten minutes without the unit shutting itself off. Watching DVD's and ROKU is no problem, so the channel tuner is definitely the culprit.  Buying a new TV, today.  Never again will buy a Mitsubishi.  Paid about $900 for less than four years of use.  A definite bummer, as I see it.", "Date": "March 19, 2010"}, {"Title": "Great so far!", "Author": "John J. Cummings", "ReviewID": "R1GNQR6YR6KGUU", "Overall": "4.0", "Content": "bought this Tv a few weeks ago. so far so good! i don't want to jinx things, but i've got no complaints. this tv replaced a sony 50\" bought about three years ago. besides the size increase, the picture appears sharper. on another note, i also believe it's a much more attractive tv too. my sony had a silver \"frame\" around the screen, while this tv has a black one. which is a lot less noticeable than the sony.the only thing i would suggest would be that calling a delivery, a \"white glove\" delivery, led me to believe that the \"installer\" might actually know more than me as far as installation goes.......NOPE! the guy actually told me this was the first mitsubishi he had ever installed! didn't exactly instill confidence in me. while there was no problem, i'd hate to see what a un-\"white glove\" install is.", "Date": "October 9, 2009"}, {"Title": "A must buy", "Author": "Research Fanatic", "ReviewID": "R2U42LMA88C6KI", "Overall": "5.0", "Content": "Television a breeze to setup.  Picture quality excellent!  Controls were easy (my wife can actually switch between DVD and cable on this set)  Also hooked up the blu-ray which is a must for a TV of this magnitude.  My friends who have smaller more expensive LED and LCD televisions are jealous.  I don't need to mount on a wall, so the DLP was perfect for our home theater and gaming room. The price difference is dramatic with no loss in quality.  Playing Wii tennis is crazy fun on this set.", "Date": "December 18, 2009"}, {"Title": "This TV is the BEST!", "Author": "Troy Thoennes \"Electronics Guru\"", "ReviewID": "R1FU289QJX2V9Q", "Overall": "5.0", "Content": "Let me start off with you are going to LOVE this TV! I researched into buying a new HD television for over a year. I stopped and looked at all the \"big box\" stores to compare. I was impressed from the get-go with the picture quality in DLP projection TV's. I had a 52\" \"tube\" projection TV for almost 10 years, so that was another reason I leaned more towards DLP over plasma and LCD. You can read the millions of reviews out there to get an idea of what kind of HD television you want, but you don't need to. If you simply want a big TV, this one is the only great idea. Plasma's are nice if you want a 55\" or smaller - but side-by-side I believe this Mitsubishi has a better picture. Add the fact that this TV is light. Probably one of the nicest things about this TV is the company itself. When the TV arrived, I plugged it in and turned it on, but in the top left corner the picture was distorted. I called up Mitsubishi, and within 3 days had a local technician at my house. Turns out all the problem was the mirror bounced out of the bracket from shipping. And wholla, picture perfect. I have NEVER had a company listen to my problem and actually fix the problem - especially so quick. You will not go wrong with this TV - enjoy!", "Date": "May 14, 2010"}, {"Title": "One Week!", "Author": "GamePlayer30 \"RW112\"", "ReviewID": "R2S3108NZ7ES0F", "Overall": "4.0", "Content": "I purchased this TV on March 7, 2010 and it was delivered to me on March 19. I was very happy with the TV for one week, but then it went black. When spending more than a grand on a item the company should have better QC. I am hoping I just got a bad lamp/bulb, but time will tell. Well, now to start the battle with Mitsubishi and Amazon to set things straight. I will update on how things go.Edit:Well, Mitsubishi sent me out a new lamp. It was as easy to change as a light bulb. It seems as of now that is was just a simple lamp/bulb. The TV is looking great again.You cannot beat the price, size and quality of the picture with any other TV.Pros:PicturePrice3d ReadySizeDid I say how great the picture is?Cons:Speakers(but most TVs these days slack in this area)Remote, solid but options and style needs some workMenu system(TV options) - Poor layoutI think there maybe a small problem with displaying Standard Definition in the proper aspect ratio(4:3 Narrow). I think it is losing a touch of the width in that setting.", "Date": "March 26, 2010"}, {"Title": "Poor picture?!!? Oh wait, there it is! Thanks Dell!", "Author": "H. Stapley \"Electro-phile\"", "ReviewID": "R1IRTORYZGCTJU", "Overall": "5.0", "Content": "OK, so I bought this from Dell for $970+/- with tax and free shipping. Paid on Sunday night, received Wednesday morning, longest two and a half days ever. After the delivery guy left I set it up, plugged in the cable(basic, no box) and my computer(3-way sli, hddvd/bluray, no joke) and turned it on.I almost cried, the picture was grainy, focus was off, picture didn't line up. Why did I ever buy this!!After 5 minutes of messing with the setting in the advanced settings section, WOW! It topped my old Samsung Plasma hands down and is every bit as good as my Toshiba LCD and thats without spending longer getting the setting dialed in.So, like many HDTV's, default setting suck, this one really sucked but after a couple of minor tweaks I have a 65\" 1080 thats ready for 3D for under $1000.Pros:Price, seriously, find a 50\" Vizio for $1000 let alone a name brandPicture, My friends 240hz LED is the only thing ive scene come close, he paid twice as much and no 3D.Menu, Its simple, maybe too simple for some but it was alot easier to set up than my other tvs.Cons:Stock setting, almost wet myself when I first saw the picture but whatever, its all good now.Remote, Not the worst ive ever scene but for a 2009/10 TV you'd think back lit and/or bigger buttons would have been added.No USB, well, not really. It has one but its for \"Service\" so maybe they will have firmware in the future to open it up but my computer can deal with the usb input as can my bluray so no biggie.Don't bother with the newer models from Mitsubishi, all the extras it has don't amount to the $500-2000 more you will pay, this is the TV for you.", "Date": "May 26, 2010"}, {"Title": "A Fantastic TV & A Great Value", "Author": "J. Westerberg", "ReviewID": "R39DDVUBNJY48N", "Overall": "5.0", "Content": "I got this TV at Circuit City on sale for $1,200 (floor model - last one in stock) a few months before they went out of business. So this is a great price... It's a fantastic TV and I have had it for nearly 2 years and (knock on wood) have not yet had to change out the projector lamp. I have a Sharp LCD HD TV and a Samsung LCD HD TV in other rooms and this produces, by far, the best picture. I have a very old laser disc player, an old dvd player, a blue ray player, TiVo and the Cable Company's HD DVR all hooked up to it... plenty of inputs... the audio out goes to my home theater and sounds tremendous. And I got all this working on one remote (RF30 Master Control)... but I digress...By the way my sister opted to purchase a Sony Grand WEGA HD tv about the same time I got this... her picture is horrible... blue bands of light and blobs of color drift across the screen... the color is faded, she is limited to watching B&W; movies on TCM... and she is now involved in some kinda class action law suit regarding the quality of her TV. I'm very happy I opted for this Mitsubishi...", "Date": "January 25, 2010"}, {"Title": "Nice TV but ...", "Author": "JB", "ReviewID": "R27N3AEFBOUHY3", "Overall": "4.0", "Content": "Bought this nice TV and worked great for about 2 weeks and then noticed several white dots and about 75 black dots on the screen.Called in Warranty and they will pick up today and install a new light engine .Hope that solves the problem !Other than that nice picture and sound could always be better on all TV's but OK .Will keep  review updated next few weeks on resolution  !Update: Repair was great and TV is GREAT !", "Date": "January 25, 2010"}, {"Title": "Mitsubishi 65\" DLP", "Author": "id10tech", "ReviewID": "R29UI4WQ7YH0RG", "Overall": "5.0", "Content": "Just set-up television tonight and it was a breeze.  The picture had me worried because I had bought this before looking at other DLP's.  I can say that this picture has my LCD owning friends in awe.  At this price you get by far a better bang for your buck.  Looking forward to picking up a #D unit for this TV and see how that works out...because I CAN!", "Date": "December 2, 2009"}, {"Title": "LOVE IT!", "Author": "Colleen", "ReviewID": "R3PYFX77RLEYAU", "Overall": "5.0", "Content": "I got this 65 inch Mitsubishi the other day - it replaces a 56 inch Samsung. The size is awesome and the clarity is wonderful! It is in the corner of a room so DLP is perfect and a great savings. Amazon's delivery service was exceptional. It was on the TV stand, plugged in and hooked up to cable in less then 10 minutes. I can't wait to try the 3D!  A friend spent over 4K for a 52\" plasma. For a little more then 1K - this is an amazing buy -and just as clear as hers. The picture is truly HD! Too bad my living room wasn't bigger - that 73 inch or 82 inch would have been sweet!", "Date": "November 29, 2009"}, {"Title": "Green light of death", "Author": "Power-On-PC", "ReviewID": "RLLXZNJC3A9DV", "Overall": "3.0", "Content": "Here's how I found the problem;While switching from my cable connection to my PS3, the TV when black as if the signal was not found. Then I noticed the green power indicator light start to blink. Now at this point you have two options, wait for the light to blink about 20 times and wait for the TV to turn off or just hold the power button for a few seconds and the TV will do a force shutdown. Either way the TV will turn off and you will have to turn it back on and try again to select the TV input device you want to use at that time. Eventually it will work but it may take two to four tries. I saw the problem right away and when I looked up the issue on the web I saw lots of people with the same issue. I called HSN to have the TV replaced. I suggest you test the TV on all HDMI inputs to make sure you don't have the issue when you receive your TV and have it replace ASAP.", "Date": "January 11, 2011"}, {"Title": "Amazing Picture at an Amazing Price", "Author": "britus", "ReviewID": "R2OJE6PIERDS2P", "Overall": "5.0", "Content": "We have had this set for 2 months now. Each time we watch this TV on a great HD transmission, we are blown away by the unbelievably detailed images and fantastic but realistic saturated colors. At a price of around $900, this must rate as an absolute bargain.  Those of you contemplating an LCD or Plasma TV, just stop for a minute and re-think your requirements.  With cost, quality and size all a magnitude better than other format equivalents, don't end up regretting your expensive decision up the road.  If your TV image doesn't cause a sharp intake of breath, then you probably don't have the correct TV or you have paid 4 times the price!!My only other comment is that this TV does NOT appreciate component cables, you MUST use a FAST HDMI cable.  At a cost of $25-50 or so, this is a small price to pay for stunning pictures, especially if you have just save $2500+ on the TV.", "Date": "August 4, 2010"}, {"Title": "Exceptional value!", "Author": "Gregory Zduniak", "ReviewID": "R37STO7Z8MIWPC", "Overall": "5.0", "Content": "This TV is by far the best value for your money you will find just about anywhere. Like many of the reviewers previously, I have owned many TVs over the years; Sharp, Sony, Toshiba, Pioneer etc. Those TVs ranged from projection, LCD to plasma. This is my first Mitsubishi and my first experience with DLP. I couldn't be happier.While it does take a little time to \"warm up\" when it is first turned on, the resulting image is well worth the very short wait. Colors are vibrant and picture detail and sharpness are both outstanding. Every time my son visits (he's into the latest technologies) he repeatedly comments on how great the picture is. I have had the TV for 2 months now and I have absolutely no complaints. I heartily recommend this unit.", "Date": "June 2, 2010"}, {"Title": "love this!", "Author": "M. Carmosino", "ReviewID": "R1ZIBIAS9OHZSV", "Overall": "5.0", "Content": "I love this TV.  It is  flat screen but does have a part that does stick out a little.  But who cares. For the price it is awesome.  The picture is great, its 3d ready, great for video games and movies.  I always find myself saying \"I love my TV\" to myself when I'm watching.  Definetly would recommend.", "Date": "February 1, 2010"}, {"Title": "Beautiful Picture", "Author": "S. Warner", "ReviewID": "R1TJPCN5QJO1UO", "Overall": "5.0", "Content": "After much research, I bought this television to replace another Mitsubishi DLP that was a few years old. It still worked fine but had older technology. The picture on this set is beautiful. It is very sharp and clear and a noticeable improvement over my previous set at the same resolution.My only negative is that it lacks front inputs, but otherwise I would highly recommend.", "Date": "December 27, 2009"}, {"Title": "An amazing TV!!!", "Author": "Bosco", "ReviewID": "R1LHHHYZA71S23", "Overall": "5.0", "Content": "People who say to steer clear of DLPs are crazy.  This tv is awesome, and while it may take a little more maintenance to keep it going(cleaning the filter and vents), it should provide you with a huge, beautiful picture.  Heat buildup will kill this machine and its bulb, so keeping the vents and filter clean are a must.  Bulb replacement is easy and cheaper than the older models...only $99 direct from Mitsubishi.If you're in the market for a 52-58\" LCD or plasma, truly consider the 65\" C9 DLP.  You'll get much more screen for less money.  People complain about the speakers, but I've found the work just fine.  I have it hooked up to a sound system, but use the tv speakers when I'm just watching cable.Don't hesitate...BUY THIS TV!", "Date": "February 3, 2010"}, {"Title": "Fantastic Bang for your TV Buck", "Author": "John A. Oathout \"RebateKing\"", "ReviewID": "R2I8XWUAMCLC3D", "Overall": "5.0", "Content": "We paid over $2,000 for a top-notch 42\" Samsung LED television about a year ago for our living room and the picture quality on that TV is nothing short of spectacular.  While the price of that TV has, of course, continually dropped it still is hundreds of dollars higher than this Mitsubishi television which has given our living room another nearly TWO feet of viewing space during family movie night!  I purchased this Mits TV from another on-line retailer at the ridiculous price of $967 including shipping.  (Less than $950 if you include the cash back I'll also be receiving.)  For the return of your digital dollar alone, I'm giving the Mitsubishi five stars.  But read on, all isn't perfect in the Land of TV Oz.While the picture quality of the Mits may not be quite as good as our present LED Samsung?  The Mits makes up for it in sheer size and bang for the buck.  With high-def sources?  I think one would be hard pressed to see the difference between it and other high def TVs - without paying out the composite jack for that slight elevation in picture quality. Avatar (the blockbuster) was absolutely incredible in blu-ray on the Mitsubishi and that my friend, is one big reason we bought the TV - to get the most out of high def programming.  This TV excels to the nth degree in that catagory.Our Samsung TV is a featherweight. But even with the Mitsubishi's enormity I was pleasantly surprised to find my teenage daughter and I easily lifted the Mits beast onto our existing TV stand without an issue.  It also was easy to fine tune the position of the TV as well due to what must be felt-like pads on the bottom of the unit. But not so much sliding friction you'd loose the TV off the stand. Excellent.I was also pleasantly surprised with the picture quality while the TV was functioning as a ridiculously large monitor for our home theater PC.  The Mits seem to handle the text size better than the Samsung did - maybe because of the Mitsubishi's sheer size.  So that experience was actually better than on the Samsung - although I would give the Samsung the slight edge in monitor picture quality and clarity.Here's a few, so far minor annoyances with the TV.  As other reviewers have similarly observed here, the remote is rather stodgy and the placement of the directional keys makes me think the engineers must have been hitting a little too hard on the Sake the night before they did the CAD on the computer for the remote...Their skinny and difficult to push.  The remote overall has a cheap feel and looks like something you'd get with an off-brand TV at Wal-mart.  While the Mits TV won't win any beauty contests itself for design - in stark contrast to our beautiful Samsung - it's like comparing TV apples to oranges.  Or my mother in law's Lexus to her son's four-by-four F350 truck.  His truck ain't pretty but man it's BIG...and it gets the job done!  Judy also paid probably a couple thou more for the Lexus than Jeremy did for the Ford too.  Same holds true for the Mitsubishi vs. Samsung.A more annoying problem, in my opinion, with the design of the remote and/or TV user interface.  It won't play completely friendly with my Harmony 890 universal remote - which up until this point - would control every component in our LR theater system - both old and new. (I think it even caused the toaster to pop on one occasion.)  Switching inputs on the Mits is apparently a real challenge for the Harmony because it's looking for a particular sequence of button pushing that the Mits remote goes through to get to particular inputs - something apparently unique to this line of remotes.  Boooooo! Several hours of searching on the net for a solution yielded no working answers.  Yes, one could point the finger at Harmony as the problem but since the Harmony works with thousands of other components - old and new - I'm blaming Mits engineers for the weird interface and button pushing sequence.While I might complain about the cheapy remote - it's interesting to note that fewer buttons might also mean fewer mistakes in trying to do what you want to do with the TV.  While the wife and I were gone at work?  The kids had no trouble figuring out what to do to connect and play their Playstation to the new TV.  Not true in the past with the Samsung and it's bountiful buttons.Something else that I don't remember seeing mentioned in other reviews for this TV is the heat the unit produces.  Bring out the party nuts people, because if you stick a bowl behind the left side of the TV no doubt in about 15 minutes they'll be nice and toasty!  While the TV might qualify as energy star compliant, I wonder how many micro degrees in room temperature elevation the TV causes because of this heat output.  Maybe it's negligible.  Maybe it's not - but working behind it was slightly uncomfortable because of the heated air - at least, towards that end of the TV.The DLP bulb issue?  Could be a plus if, as others have also noted, you can buy the bulb now for a $100 and have a like-new picture when the thing goes South in however many years it takes to do that.  Heck, the TV might even outlive my fancy-pants Samsung if the rumors about unfixable flat panel TV fade is true.As the price of 3D glasses come down, we'll probably buy a pair for the novelty and the curiosity of how well such a system in the home works.  But I too think that 3D might be just a fad.  Wasted money for extra features you don't need?  Naaaahhh...if it works well?  Great!  If not?  Who cares.  This TV still functions as a \"I can't believe I only paid this much...\" high definition unit.Overall I'm extremely pleased with this purchase and I've been unable to find a similar deal on an equally sized TV anywhere else at this price level.John", "Date": "August 19, 2010"}, {"Title": "One of the best ways to go big", "Author": "Edgar H Chan", "ReviewID": "R1LFPZCQ8XFQ4I", "Overall": "5.0", "Content": "I bought this November 2009, and still haven't needed to replace the bulb. Granted, I changed the picture settings from the default \"Brilliant\" to \"Natural\" and turned down the brightness some, because it looked too intense before. I heard that default picture settings tend to be that way to jump out at you in brightly lit stores, but that more toned down settings look better at home. Anyway, getting a 65 inch picture for about $1000 back in 2009 was one of my best purchases. I'd seen and preferred the smoothness of the picture of a rear-projection DLP before, and with Mitsu I could get a honking big picture at a price that still stands up 4 years later. It's not as thin as a flatscreen but at about 15\" it's still pretty shallow. I was getting a stand for my amp and XBox anyway, and the stand is already deeper than 15\" so I wouldn't have gained any space with a flatscreen. Mostly, though, you couldn't get a 65\" LCD plasma that cheap, back then or even now. I wanted big. I did consider a projector, but my friend had that and although the image was large, it wasn't that bright.The only weird thing was in mid-2013, it would start shutting itself off after awhile. I thought the bulb was going bad and did a bunch of research on error codes and the \"blinking green light\". Some suggestions did say to replace the bulb first, but turns out my issue could be fixed with a firmware update. I just downloaded the new firmware, put it on a thumb drive, and plugged it into the USB service port. Followed the instructions on screen and my set has been rock solid since (it's now a few days before Christmas 2013).I am so glad I went big. It's true that you can enjoy a show on almost any size screen. I still liked Inception on the crappy seatback screen on a plane flight. And I regularly stream and enjoy movies and TV shows on my phone. But 4 years later I still smile every time I sit down in front of this big screen. My only regret? Since Mitsu stopped making rear-projection TVs, sometimes, just sometimes, I wish I'd gone even bigger.", "Date": "December 22, 2013"}, {"Title": "Best bang for the buck", "Author": "Darla Laurence", "ReviewID": "RGERZ5AI5JRAO", "Overall": "5.0", "Content": "Bought this through amazon from comp usa - Comes on a semi for delivery, which he had to park about a 1/4 mile away and dolly it to my house. was packed well no problems fired right up. Picture seems to improve over a few days, either it breaks in or your eyes adjust to it. I spent a good month researching and looking at 100's of TV's. This was the most I could get for the money, looks as good as anything else out there. Most of the TV's on display in the stores are turned down to energy saver and look like crap next to one that is not, have to wonder if it isn't a way of pushing you to certain models. This TV I have owned for a year now with 0 problems. I noticed it does much better in sunlight than my old tv. If sunlight came in my window it would glare out my old tv, this one stays viewable, must be either filter on screen or projection that helps. Was concerned about \"projection TV's\" as I have seen the old ones and how dim they were and the small viewing angles, but this has a screen that is crystal clear and bright and can be viewed from anywhere in the room. Very happy with the purchase.", "Date": "February 2, 2011"}, {"Title": "Love It!", "Author": "Brian P. Hecimovich", "ReviewID": "R232BCSOTGGVCO", "Overall": "5.0", "Content": "For the price I could not want anything more - I searched and searched when looking for a new larger tv, after hours and hours I decided on this one.  6 months later I'm still very satisfied - pictures are crystal clear with beautiful colors.  Couldn't ask for more.", "Date": "January 30, 2011"}, {"Title": "GREAT TV", "Author": "James Beals", "ReviewID": "R3CPV5MUKAGAWB", "Overall": "5.0", "Content": "Bought this tv a month ago.Set-up was the easiest I have ever done.Only problem I had was hooking up the dish network box.This was no fault of the TV. It was a BAD HDMI PORT on the dishnet box (From what i could find out this is a common problem with dishnet hd boxes).Picture is Outstanding, I was in a couple of places today looking to upgrade my av receiver and noticed that none of the tvs in these stores had as good a picture.Not even smaller models.If you don't want to hang it on a wall,DLP is the way to go and you can't beat the price.", "Date": "January 20, 2011"}, {"Title": "Great TV while it lasted", "Author": "SQL4Fun \"sql4fun\"", "ReviewID": "R1QE29ZOYAS2XA", "Overall": "1.0", "Content": "I love this TV.  I purchased it over a year ago and it is fabulous.  I was a little leery of purchasing a TV through the internet but I would do it again.  My son always asks if it causes eye cancer because the screen is so large.  It has a beautiful picture.  If I had to complain about anything on it, it would be the sound but hey if you are going to own a TV this size with a Media Center PC attached, you really should have a surround sound system.  That is next on my list!Just a note - I do love this TV BUT it now has white and black spots all over the screen.  While I have not had a service repair person over, all the forums on the internet suggest that it is the DLP chip going.  This would be costly to have replaced.  It is a huge disappointment to have this issue after only 1 1/2 years of owning it.", "Date": "September 17, 2010"}, {"Title": "Nice", "Author": "Scott", "ReviewID": "R2OYSEZBO8Z19K", "Overall": "4.0", "Content": "Great TV for the price.  I have allways been a fan of the DLP tv's and have a brick wall where we like the tv so not being super thin wasn't a big dealIt was actually thiner than the samsung dlp 50\" we have.  It doesn't seem to disperse much heat at all.  The quality is outstanding and you can see it at any angle.  My daughter doesn't like that it doesn't have Picture-in-Picture (it might but i dont know how to turn it on if it does)  The set up color features suck but you can spend 20 or 30 minutes \"dialing\" it in how you like in several different modes like video game, bluray, and tv.  I would buy it again.", "Date": "July 23, 2010"}, {"Title": "Don't Let Mitsubishi's 'low end' advertising fool you.", "Author": "Tom Boucher \"Computer Geek\"", "ReviewID": "R3UDKYFIX3POAI", "Overall": "5.0", "Content": "See the review here on Amazon from the TV installer.  This TV is a solid purchase for anyone considering > 55\" TV that won't break the bank.  Don't let the need for plasma or LCD based televisions fool you into thinking that you must spend almost 3x the price of this for that technology.  If you want to go big on a budget, the DLP TVs are still a solid purchase.My 8 year old 57\" Sony CRT Projection television popped a gasket and failed on me earlier than I wanted it too and before I was ready to make a 'big' purchase.  I had dreamed of remodeling my bonus room to go full projection with movie screen and all that jazz but that was a significant investment to do what I wanted to do.  I'd hoped to get another few years out of my CRT Projection but there were no parts available, and it appears that at least in my area no one wants to fix TVs, just sell you another one.So with help of AVSForum and a few other resources I decided that this version of the 65\" DLP TVs from the folks at Mitsubishi was for me.First and Foremost if you are coming from an older style CRT projector YOU NEED A STAND.  There is absolutely no base on this thing as far as height goes compared to older generation televisions.  Right now we have it sitting on a desk as I have been unable to find a stand that works how I'd like it.  I'd like one that can hold a large center channel (Klipsch RC-3) and some larger sized pre-amp/amp (Outlaw 990 and Outlaw 7700 amp) and the stands I have found so far aren't 'tall' enough on the shelves.  I'm most likely going to design and make my own.I've watched a Blu-Ray movie on it, and about 15 to 20 hours of DirecTV HDTV on it, along with about 10 hours of PS3 Games  I will admit that it looks markedly better than my older television but I think that's a combination of technology change and how the HDMI connections better communicate what mode to switch into.  I'm not 100% certain but it's a lot easier to tell (via info button) what resolution is coming out of the DirecTV receiver or the BluRay player so I'm able 'see' what resolution I'm really at.  Also the upgrade from 57\" to 65\" viewing is pretty amazing.As far as the 'detractions' you'll find about a DLP TV I am not seeing them.  The TV is silent even after hours of viewing so there is no 'fan noise' that is reported about the light.  Also, the light itself is inexpensive to replace ($99) compared to other brands of DLP TVs so the argument of a $300 light bulb is not an issue.  You still need to replace it but $99 is easier to swallow than $200 - $300 i've seen for some models.I've also heard there are ways to add the software available for the higher model (737) vs. this model to add some features.  Search engines are your friend on that one.Delivery worked as advertised.  I wasn't home to see it but my wife reports that other than getting it to the door they're not much help.  Fortunately the TV isn't terribly heavy and it's an easy two person job (due to size more than weight) to move it where needed.  The box makes a great castle for the kids to play with as well.", "Date": "May 31, 2010"}, {"Title": "65\" HDTV Mitsubishi", "Author": "J. Eppinett \"TouchOfEvil\"", "ReviewID": "R341KMGVED3YDB", "Overall": "4.0", "Content": "Very good set for the price. However i ordered a cheaper model from comp usa and they upgraded the order to a newer model free of charge. The set has a very decent picture for such a small price tag on a 65\" set. It's very light and looks great with the gear/tower speakers next to it.", "Date": "May 23, 2010"}, {"Title": "Joining the Crowd", "Author": "James A. Brownfield", "ReviewID": "R22ND8OVYQ2LYY", "Overall": "5.0", "Content": "I have to agree with the other reviews.  This is an excellent TV for the price.  It does take some experimentation to find the optimum configuration, and I find the setup menu screen navigation unintuitive, however it's difficult to beat the price/performance ratio.", "Date": "April 29, 2010"}, {"Title": "The King's views", "Author": "Ronnie L. King", "ReviewID": "R1R9WGEA6ZULZO", "Overall": "5.0", "Content": "This is a very good product easy to use, 3D ready, has great colors, picture is very clear & sharp. Would recommend this product to anyone.I have had great satisfaction with Amazon's choices of vendors. The vendor for The product I received was From Paul's TV they were great to deal with very helpful on answering question on e-mail right away.", "Date": "April 11, 2010"}, {"Title": "Great tv for the price", "Author": "ferrethouse \"ferrethouse\"", "ReviewID": "RSGAAMV1EIBAO", "Overall": "5.0", "Content": "It's a great TV for the price.  And the picture has been stunning on movies I've rented.  I'm either going to need to upgrade to the HD cable package or cancel cable to get the free HD local channels.", "Date": "March 19, 2010"}, {"Title": "The most bang for the buck.....Fantastic Large Screen HDTV", "Author": "goosedude \"goosedude\"", "ReviewID": "R63CCBG3R7WD0", "Overall": "5.0", "Content": "This model was on sale recently from a certain computer maker based in Texas at a ridiculous price that was so low I could not resist.It was replacing a 65\" 4:3 Rear Projection HITACHI Ultravision (which is still fantastic to this day) so being flat was not a necessity.I have plasma, LCD and old style projection HDTVs so a DLP was a new choice for me.Size and features were the biggest factors for me........price and the manufacturer sealed the deal. There is no better big screen bang for the buck than Mitsubishi DLPs in my opinion....this model easily lives up to their reputation for quality big screens of the 80s & 90s.I am honestly amazed at the picture quality....once calibrated properly it easily matches if not surpasses my other HDTVs (which are Sony, Phillips, Toshiba, Hitachi).But for a 65\"+ sized HDTV which is already 3D Ready for a price that is 1/2 that of comparable in flat panel size??? Ridiculous.Yes there is a wait for the DLP to start up and shut down completely....but its not a major bother.I have all my sources hooked up via HDMI (Xbox360, PS3, Comcast HD DVR) and had no problems setting up with new sources being automatically detected and the TV Prompts you to make settings for each input.What amazed me the most is the weight of the TV itself......the Hitachi it was replacing is easily 80-100+lbs......this 65\" DLP was lighter than my 47\" LCD Screen. If not for the size of the screen itself a single person could easily move the unit as needed. It was easy to move the Shipping box with a dolly to my back porch and then slide it into place. Also it's depth is not that much......so if you have room for an entertainment center....this TV will easily fit in such a space.I purchased this unit with the Mitsubishi Matching base for WD-60735, WD-65735, WD-65736 DLP TVs made matching stand......and the TV base slides perfectly into the stand creating a seamless look.I am researching & preparing to purchase the items that will allow me to utilize the 3D of this TV and will update my review accordingly.", "Date": "April 10, 2010"}, {"Title": "Great TV", "Author": "Steven Maziarka", "ReviewID": "R3TOGTD3ES64AC", "Overall": "4.0", "Content": "I upgraded from a 50\" Samsung DLP television to a 65' Mitsubishi and so far the TV has been spectacular. It took awhile to get the HDMI portion to work but once I got the cables up and running the TV has lived up to everything I was expecting.", "Date": "September 19, 2009"}, {"Title": "Don't buy this TV.", "Author": "Persistent Tim", "ReviewID": "R2XYTG3L32EZ5H", "Overall": "1.0", "Content": "I've had this less than a year and nothing but problems.  The size/price are great but the reliability is awful.  Mitsubishi fixed it once under warranty but it took countless calls, two visits by a repairman and weeks of waiting.  The picture is good and I love the size but I will never buy a Mitsubishi or rear projection TV again.  Buy a smaller TV or spend more on a Vizio or something.", "Date": "June 27, 2011"}, {"Title": "C9 and 737 Series Use Same Manual But 737 is Better", "Author": "Rick Truelove \"Swingin' Richard\"", "ReviewID": "R238LHZ9AN1XP8", "Overall": "5.0", "Content": "I saw a 65 inch C9 at a friends house and really loved the picture.  So, I started watching for a sale and, as usual, the best deals were on Amazon.com.  I found a great deal with free shipping (from the Home Theater Store) and ordered that bad boy.  Two days later the vendor called me and offered a free \"upgrade\" to the WD65737.  I had noticed that the \"retail price\" of the C9 was more than the 737 but the sale price was about 150 bucks less. Home Theater Store told me that was because technology is always driving down the price when newer models come out.  As the WD65737 is a newer model, with newer technology, the \"retail price\" may be less than the C9 but the current (street) price of the 737 was a few hundred more.  I accepted the free upgrade, and I'm sure glad I did.  Now for the TV...This TV has the best picture I've ever seen on any HDTV.  Deep, realistic reds, blues and yellows along with the blacker than black (never knew this was possible) blacks and the tight contrast make this thing come to life.  Field sports and auto racing are better than live.  You really must see a big American flag on a nicely groomed football filed to understand what I'm saying here -- I had to see it to believe it.The speakers aint great for music and action adventure movies, but I always use the surround system for that stuff any.How 'bout that picture!  Do yourself a favor and go check out a 737 model at your local TV store and shop Amazon for the best price.  And don't worry about giving up picture quality for size -- this 65 inch is way tighter and brighter than even the 37-inch HDTVs I've seen.Get yourself one -- you wont be sorry.", "Date": "January 30, 2010"}, {"Title": "DO YOUR SELF A BIG FAVOR AND DO NOT BUY THIS TV", "Author": "Mark Twain", "ReviewID": "R3NMZUA4C90QM5", "Overall": "1.0", "Content": "look up blinking green light of death, it is very common with these TV's.  Parts are unavailable from Mitsubishi because everything is on backorder.  Whether they actually honor warranty or not remains to be seen for me... waiting over a week now with no working TV and only the blinking green light.  DO YOUR SELF A BIG FAVOR AND DO NOT BUY THIS TV", "Date": "October 19, 2010"}, {"Title": "Mitsubishi WD-65737", "Author": "Steve A. Libertore", "ReviewID": "R2W4DUV5TSR0HY", "Overall": "4.0", "Content": "I bought a WD-65C9 but the supplier upgraded me for free to a WD-65737. I am very pleased with it so far. The picture quality is gorgeous and the ease of set up was good.", "Date": "January 27, 2010"}, {"Title": "Question about DLP", "Author": "Allen Rosenberg \"TenThumb\"", "ReviewID": "RR6HK64GQPTGM", "Overall": "3.0", "Content": "Consumers be aware of the nature of the DLP bulb. Eventually it will burn out like bulbs do. Can the tv owner replace it or is a tech required? Otherwise it is an impressive technology that shares the color wheel concept used in the original 1930 era tvs.", "Date": "September 27, 2010"}, {"Title": "It not bad", "Author": "C. Spellman", "ReviewID": "R31JPJGFEI1MYZ", "Overall": "5.0", "Content": "I would rate this a 4 1/2 over all. Its not bad once you figure out how things work. I paid $1049. so I think I got a good deal. Not every channel will be perfect. Some channels are shrunk on the screen and when you use the format option to fill the screen up, it distorts the pic a bit. We do a lot of gaming so its wicked for that. Not a bad TV. Its a better buy that paying 3 or 4 times that for a smaller LCD.", "Date": "January 3, 2010"}, {"Title": "WARNING!!  Do not buy from CompUSA or Tiger Direct.  Setup fee of $399 extra!!", "Author": "Sadat H. Khan", "ReviewID": "R3DQH4LXJ0BO83", "Overall": "3.0", "Content": "The WD65C9 picture quality is Ok at most.  I have owned a Samsung DLP 61 for past 2 years and this tv is far inferior. It takes upto 30 seconds for the Mitshubishi tv to turn on, and then another 5 minutes for the picture to 'liven up'.  But the biggest problem is COMPUSA.  Their customer service is the worst I have ever faced.  I was unaware of the \"NO white glove\" service policy from COMPUSa, so they just left my TV in front of my main house door.  It was very hard for me to setup the TV considering I'm a older person. I have purchased two big screens tvs from Amazon before and this is the first time I had curbside delivery.  I called and Compusa said they will have to charge me $399 for setup fee.  And the worst part was the rudeness of the customer service people.  I mentioned I will write a letter to their manager and he laughed and said he was the manager and he would tear up the letter.  Yes, i'm not making it up, he really did actually say it.  Do your self a favor buy from company you can actually get help if you have a problem.  BTW they dont have a reurn policy unless if you have a defective product, then you can only get store credit at best.", "Date": "March 18, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Smooth 120Hz\nExclusive 6-Color Processor\nPlush 1080p 5G Improved 12-bit Processing\n3D Ready - 3D video, gaming and dual-screen features require compatible 3D source devices, 3D glasses and IR emitters\nImproved Video Noise Reduction", "Name": "Mitsubishi WD-65C9 65-Inch 1080p Flat panel DLP Home Theater", "ImgURL": "http://ecx.images-amazon.com/images/I/41zEJI7FX0L.jpg", "ProductID": "B002HHLGDE"}}