{"Reviews": [{"Title": "GREAT VALUE", "Author": "Margaux Paschke", "ReviewID": "R3DGV6E7MKQWJY", "Overall": "4.0", "Content": "I have this model with the dvd included (DX-LDVD19-10A) which makes it a little thicker but still slim.  I was told at Best Buy that the Dynex brand is their in-house brand, which gave me pause, but so far so good.This television is for a guest room and I was not prepared to spend the money for a 1080i set that would be not be used often.  Space was another issue that needed to be addressed and having this tv/dvd combo saved space, messy wires and an outlet.This set is 720p with a 60 Hz refresh rate.  There was no noticeable motion blurring when watching an action movie on the set.  There is a \"S video\" connection as well as a HDMI.  It even allows you to connect it to a pc to be used as a monitor.  There was no USB port but for the price of under $150, I really cannot complain.My only complaint is the washed out colors and that print is not as crisp as I would like (or used to on our Samsung 1080).  I will continue to tinker with the color settings to see if this can be improved.  Although this tv cannot compare to a Samsung or Sony, it looks better then the LG set that was twice the price.I would recommend this set for kids, kitchens, guest rooms or those on a tight budget.  This HDTV television is a bargain!", "Date": "June 27, 2010"}, {"Title": "Good value TV - still running well!", "Author": "Danny Yu", "ReviewID": "ROZ2R9HUSQ4RR", "Overall": "4.0", "Content": "I bought this TV from Best Buy roughly 3 years ago and it's still running fairly well.Originally, it was used for cable TV, but I also use it as a monitor.A few thoughts:- It's a good value TV, but remember that it's 720p. It's relatively inexpensive.- The menu is well designed. Easy to use and navigate through. It's also easy to use without the remote too.- The picture quality is decent, but it's fairly good for movies, tv shows, and computer use. When I play games on my PC with this TV, the picture quality is smooth. The only part for me that is a concern is sports. Again, it's decent, but certainly not top-notch for a 720p TV.- I like that the idle red light is not intrusive and stays relatively low key.Overall, a good budget 19 inch TV. It's good for all purpose use and for computer use as well. This TV has endured frequent use in the past 3 years and still is running well. Good buy.", "Date": "September 18, 2011"}, {"Title": "Great little TV!", "Author": "Kate", "ReviewID": "R13EVGNX8U56G6", "Overall": "5.0", "Content": "I bought this TV as a floor model from Best Buy for $99. Because it was a floor model there was no remote so I purchased an RCA 3 device remote for $9 which took less than a minute to program and use with the Dynex. This cute little TV fits well in my small basement room. It was quick and easy to set up.It works great with my Wii. I have a nice crisp picture and it's just big enough for two players... any more than that and I imagine the screen could get a little cramped!I am annoyed that it constantly deletes my digital channels when I lose signal, but I'm in a basement and only get one channel anyway so no big deal, right? And I mostly use it for Netflix anyway as there are no wires for the Comcast cable down here in the basement.I have used some of it's great basic options such as sleep timer, energy saver for the brightness,etc. I have not tried to hook my laptop up to it yet as I need to purchase and HDMI cord first. Basic A/V hookups for my Wii work great though and are conveniently located.I couldn't have made a better decision when I purchased this Dynex floor model at Best Buy!", "Date": "June 21, 2011"}, {"Title": "epic fail", "Author": "bandanajack", "ReviewID": "R2PQZTE0GBWY87", "Overall": "1.0", "Content": "this tv is on its way back to seller.  picture quality is much less than one expects from a new lcd and something about the actual dimensions of the tv, as opposed to the \"19\" class\" deignation don't permit a normal picture display in any of its zoom settings. regular display is either surrounded by 1-2\"black borders squeezed to the dimensions of a 14\" tv, or expanded to lop off the top and bottom half inch.  and this is with myriad zoom possibilities provided by both its programming and the cable remote. i am SO annoyed.", "Date": "February 9, 2011"}, {"Title": "Don't buy Dynex", "Author": "S. Bradley", "ReviewID": "R978CMLJM1Y6Z", "Overall": "2.0", "Content": "We've owned a Dynex 32\" LCD TV for 3 years and 1 month. It has begun turning itself off and on--basically power cycling. It will cost more to fix it than buy a new one. Note that Dynex is the house brand for Best Buy and that they do not stand behind their product. Basically, you need to view this as a short-lived disposable TV because that is how they are manufactured.", "Date": "January 1, 2011"}, {"Title": "Beware", "Author": "Lisa Rogers", "ReviewID": "R1R6YQN2FEU7HS", "Overall": "2.0", "Content": "Bought this for watching DVDs while on treadmill (honestly not used much).  Interestingly I kept a log.  Over the 18 months we owned it my wife and I used the treadmill approx 150 hours (weak I know).  The unit was used for essentially the full 150 hours before it went out.I won't buy a Dynex again.  I don't recommend anyone else buy this unit either.  Very disappointed.  More e-waste to send back to china.", "Date": "September 9, 2012"}, {"Title": "Dynex products are junk!", "Author": "robert28456", "ReviewID": "R1N2K5Z04BXSJ1", "Overall": "1.0", "Content": "I bought the 26\" LCD (720p) Dynex TV from Best Buy about a year ago, so I have some experience with this TV and I have to honestly say that it's a piece of junk! Here's why.1) The ATSC tuner is crap. Simply put, it's crap! MANY of the channels that I get with my cheap, $10 over-the-air hdtv converter box I cannot get on this TV, and I have a huge Channel Master 3671 antenna with a pre-amp. What a disappointment.2) After programming the channels, if for some reason the reception on a particular channel decreases, the TV AUTOMATICALLY removes that channel or channels from memory. In order to be able to view those channels again, I have to rescan ALL of the channels, which takes several minutes to complete because this TV still scans for analog channels--lame! During this time I cannot use the TV with my computer or any other input device.3) When connecting a computer using the VGA connector the video is HORRIBLE. I suppose that's expected, but when connecting my computer using a DVI to HDMI cable, there's no way to route audio from my computer to the audio input on the television. In other words, when the HDMI connector is plugged into the TV there's no way to select an alternate audio input. If you want to hear sound when connecting your computer, be sure that you have a computer with an HDMI output that includes sound. A DVI connector on the computer will not transmit audio in most cases AND you cannot use an analog sound cable from the computer to the TV. This TV shuts off all audio input when the HDMI connector is plugged in.4) The TV shuts off when connecting my computer using an NVIDIA card set at a refresh rate of 60hz, which this TV supposedly supports. In fact, this TV supports only up to 59hz. When I change the advanced settings on the video card to 59hz, then the TV stays on most of the time. Garbage!Spend a little more money and buy a Samsung, or Sony, or Panasonic. Don't buy a Dynex, you'll regret it!", "Date": "January 3, 2011"}, {"Title": "Great picture--poor sound.", "Author": "Eric R. Fisher \"fishface42\"", "ReviewID": "R139BFV5E8LT7X", "Overall": "3.0", "Content": "I have model 10C, the same as 10A without CD.  Chose this model for precise size fit in kitchen; it is ¾\" lower than other 19 inchers.  Have had 3 years of reliable service. Before digital cable box, picture was very good on analog feed. With an HD cable box, it delivers a superb picture, sharp and clear with great colors.  Stations can vary on color qualities.  Had to fiddle to get the optimal settings, finally settling on Zoom-Wide [nothing is cut off] and Picture-Custom.  This review is shorted two stars because of poor sound quality (no surprise)--ok for spoken word, but tinny for music.  As the cable company provides multiple music channels, this is a shame as I would like to hear classical music as I cook.  The output for external computer speakers [earphone output on left side] does not cut off TV speaker nor provide good sound to external speakers.", "Date": "December 6, 2013"}, {"Title": "Great tv, small and bright", "Author": "THein", "ReviewID": "RVQNI5S4A3NJ1", "Overall": "5.0", "Content": "This tv is now mounted on the wall in my childrens bedroom, and it is perfect! The kids love it, and the picture is great. Tons of menu options to tweak the picture and sound exactly to your liking and great quality picture and sound when your done. The cords it comes with are nice and long as well, although they are just the power cord and the regular 3-plug (red, yellow and white). So I would buy a component cable (if it were not in the kids' room) But it also has all the ins you could possibly want (cable, regular 3-prong, component, VGA(computer monitor) USB and HDMI) and is super easy to set up. And 19 inches is surprisingly large when its widescreen! Very good buy!", "Date": "March 4, 2012"}, {"Title": "Decent for the price", "Author": "Ice Cream Man \"Neighborhood Dope Dealer\"", "ReviewID": "R3LCRRKZQ1W6PJ", "Overall": "4.0", "Content": "This TV is pretty okay for the 150 bucks i spent on it.  Movies and Television shows look fine.  My main issue is when playing Playstation 3 or Nintendo Wii, the quality is pretty bad imo!  They looked a lot better on my old school \"big box\" set.  Also it's a major pain in the arse trying to get older video game consoles & VHS/DVD players to work.  The TV will initially not be able to pick up a signal.  What I have to do is first turn on my PS3, then quickly switch over to the other console.  Very annoying.  But if you really just plan on watching TV & Movies, this will do.  I've only had it for 2-3 months, so i'm unsure of long term quality.  I'll update this if any problems occur.", "Date": "October 10, 2011"}, {"Title": "Item was Damaged", "Author": "Jim", "ReviewID": "R2EE57KT5FZSM3", "Overall": "3.0", "Content": "I received this item damaged. It looked like a good tv for our guest room but I am going to have to find another one as our company is arriving tomorrow.", "Date": "October 8, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Dynex DX-L19-10A - 19\" LCD TV - widescreen - 720p - HDTV", "Name": "Dynex DX-L19-10A - 19\" LCD TV - widescreen - 720p - HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41A4jEWyyqL._SX300_.jpg", "ProductID": "B002RJSSOM"}}