{"Reviews": [{"Title": "Shockingly bad. OneCall is useless.", "Author": "J. Watton", "ReviewID": "RAGO028NMDAWF", "Overall": "2.0", "Content": "At this moment I am writing this review from a computer that is hooked up to the XBR10 and i'm trying to focus on the words but they keep phasing in and out. If you don't know, this is because the XBR10 \"Package\" is composed of two parts. The first is the TV which is a beautiful, super slim, piece of equipment with a glossy screen. As far as i know it is the thinnest TV on the market and in order to achieve such a slim design, the video inputs (HDMI, Component, Composite inputs) were taken off the TV and moved to the second piece of equipment called the Media Box. The general idea here is that you plug your video sources (DVD, BluRay, Games) into the back of the Media Box instead of the TV and the Media Box sends the information (your movie and game video) to the TV via a wireless link. The following review will discuss the pros and cons of this design:1) The TV -  +Super thin TV.  +Screen is all one piece meaning that there are no edges anywhere like previous models.  +Touch Screen controls that light up.  +No visible speakers.  +Very pleasing design.  +Lots of yahoo wigits that show things like news reports and sport updates.  +Lots of video channels like youtube and paid channels like Amazon OnDemand.  +++Auto Dimming in dark scenes can be turned off.  -Glossy screen with plenty of reflection.  -Average picture quality on par with XBR6.  -Poor black levels.  -No wireless internet, requires wired connection (considering the original price tag this is absurd).  -No video inputs on TV (see #2 Media Box).  -Wigits and online video sources take forever to load.  -Fewer video tuning options than previous models.  -Fewer video inputs than previous models.  -Same remote as past models.  -Sony logo doesn't light up.2) The Media Box  +Neat concept.  -Adds an extra piece of heat generating equipment in your living room.  -No wireless connectivity.  -Prone to wireless interference.  ---Doesn't work unless it's pointed at the TV from across the room. (This works exactly like a remote control in that you have to point it at the TV in order for it to function. So to imagine how dumb this design is, imagine sitting on your couch with the Media Box in your lap with it's face pointed at the screen in order to send the video signals to the TV. That is exactly how the XBR10 operates.)As mentioned, the TV itself--with the exception of the power cord--has no physical inputs. This means things like HDMI and Component inputs can't be plugged directly into it. No, instead you plug them into the Media box which then communicates the signal to the TV via a wireless link. And while this may sound on the surface like a cool idea, and indeed makes possible benefits like the super thin screen the TV incorporates, it is extremely poorly implemented here.You see, the Media Box must be pointed directly at the TV in order for the wireless link to reach it... Let me repeat that: the Media Box must be pointed directly at the TV in order for the wireless link to reach it...as if it were nothing more than a big remote control. To give you an idea of how stupid this design is, all you have to do is think about how a simple entertainment center is setup:  -Electronic equipment like DVD players or video game consoles sit next to or underneath the TV facing you.  -From the back of these devices come their video connectors (HDMI, Component) which you plug into the back of the TV in order for their video signals to be displayed on screen.Now imagine the exact same setup except that you have to plug those same devices into a separate box instead of the TV. In a sane world this would be jake and would make perfect sense because in a sane world you would simply give that separate box a home right there next to the DVD player or the Game console--facing you like all the others--and everything would work fine in this orientation. But Sony's world is not sane.Now continue to imagine that setup, except introduce the caveat that the Media Box MUST BE FACING THE TV TO IN ORDER FOR THE VIDEO SIGNALS TO REACH IT (not underneath it, not beside it and not even right behind it) and you have the conundrum that is the XBR10. There is simply no physical way to make this work without either moving all of your electronics away from the entertainment center and putting them in the middle of the room so you can plug them into the back of the Media Box also in the middle of the room, or instead by running cables from the back of the devices in your entertainment center across your living room floor and around the back of the Media Box in order to plug them in.I also mentioned that you need a wired internet connection in order to use most of the TV's new web features. This also means that you'll have to run a CAT 5 cable across your house from wherever your Router is into the back of the Media Box in order to make use of them. (You'll also need a power source in the middle of your living room in order to plug it in.)Needless to say, i was slightly stunned when i came to this realization a few hours into my not so proud ownership of this device. Case in point of this lunacy: right now the Media Box is sitting directly behind my TV, in fact, the two pieces of equipment are basically touching each other, and still the signal is dropping at regular intervals (about once every five seconds). Now consider all i've said, and then think about the fact that the TV cost $4500 at launch.Sony discontinued this series almost immediately after it was introduced in the states and while there has been a lot of speculation as to why this happened, the reason is crystal clear to me: this thing is a poorly designed, poorly thought out and poorly engineered piece of junk that simply doesn't work.Have an entertainment center? This TV is not for you. Don't have an entertainment center? This TV is not for you. Have some sort of oddball setup where it's ok to put the media box on your coffee table and point it at your TV? Then maybe this will work for you...so long as you don't have a wireless router or a cell phone.As for the picture quality, well, when it works it's on par with my XBR6, so nothing new in the PQ department in the past three years of development at Sony labs. And of course, my XBR8 blows them both out of the water. New features? Well, if you like a bunch of yahoo wigits and online paid and free video stores where you can purchase movies and watch them right on the TV then there's a fairly big selection built right in. Keep in mind that you need a wired internet connection hooked into the back of the Media Box for these to work, and it's also worth noting that even with a fast internet connection, the performance of these features is terrible. So be sure to arm yourself with plenty of spare time and a lot of patience if you plan to do something as simple as check a football score through a yahoo wiget--it's going to take a chunk of time to load.Actually if you're really interested in the online functionality the XBR10 has to offer, might i suggest you simply hook an internet enabled computer up to it and use the TV as a computer monitor--that way you'll get it all plus a whole lot more without the maddening lag.Finally, due to my complete inability to get this thing to work with my setup, I naturally tried to return this to OneCall and while these guys were more than happy to sell me this TV, to say they weren't quite as nice when I attempted to return it would be an understatement. After calling their return department I had the misfortune of being greeted by an incredibly smug and patronizing individual named Patrick.After politely explaining that the TV didn't work with my setup, and explaining that no, i didn't have the Media Box pointed directly at the TV--how was that supposed to work in an entertainment center exactly? He explained to me in his condescending way that there was nothing they could do for me beyond accepting a return shipping fee and 15% of the purchase price. ($500)But this doesn't work with my setup, i protested, are you sure there's nothing you can do for me? No, he said, because we can't sell it new.Now keep in mind this is the third TV I've bought from them in two years, and even though the guy knew this he still wouldn't budge one inch on the return policy: no offers to charge me a 10% instead of a 15% restocking fee. No offers to waive or reduce the return shipping fee. Nothing. And far worse than any of that, the tone of his voice was dripping with contempt from the moment the call began. All else could have been forgiven--I know it's a tough world out there and returning items, especially TVs, is an expensive proposition--but I just couldn't abide the overall tone of this man's voice when I was simply trying to inquire about the return of a lemon of a product that, in my view, he had essentially sold me after i had been a loyal customer for two years.So my advice is to stay away from the XBR10 and to not shop at OneCall unless you're absolutely sure that the TV you want to buy isn't going to end up being a big paper weight in one of your spare bedrooms.", "Date": "October 25, 2010"}], "ProductInfo": {"Price": "$4,499.99", "Features": "Edge Lit LED Lighting\nBravia 1080 Wireless Technology\nMotionflowTM 240Hz technology\nDLNA® compatible with photos, music, and video\nExceeds ENERGY STAR® 3.0 guidelines for energy efficiency", "Name": "Sony KDL-46XBR10 46 inch Full HD 1080p 240Hz LED Flat Panel HDTV", "ImgURL": "http://218.201.42.40:8080/ecx.images-amazon.com/images/I/41BH14V8QTL.jpg", "ProductID": "B002Q9KNO6"}}