{"Reviews": [{"Title": "Not bad, crap sound though", "Author": "N. H Kan \"War horse\"", "ReviewID": "R1KWJQQ5VGH809", "Overall": "4.0", "Content": "At first, i pretty much used this in a small corner to play Modern Warfare 2.  The picture is pretty darn good and i had no problems spotting people from far off if i sat close to the screen (3 ft. from my face).  I think i tweeked a few settings to get it to look the way I wanted, but once i did, it was awesome.The only thing i don't like about this tv that really got on my nerves are the speakers.  They are absolute crap.  From what i hear, this is a common trait in Dynex tvs.  It's like having an old radio playing in the bathroom while your ears are submerged in water, muffled and echo-y.  Since i was always playing so close to the thing anyway, i went and bought a pair of headphones and an extension cable for it and plugged it into the jack in the tv and the sound was pretty good then.  Wearing the XBox headset while gaming was interesting though.  I think if you can buy a cheap pair of powered speakers that have a standard headphone jack, it should solve the problem too.About 6 months ago, i started using this as my computer monitor.  It's native resolution is 1360x768 (which means that 720 picture is actually upscaled to that, but it does a good job of it), and if you use it as a computer monitor, it has to run at that resolution or everything looks like soup.  If you do have it set to that resolution, everything looks awesome.  Unfortunately for me that is kind of a low resolution (old monitor was 1280x1024), but i can't afford a monitor that would utilize my computer's max potential.  My computer is on 24/7, and i have this set to go to screen saver after 10 minutes and turn off the monitor after 10 minute after that.  I have had no problems with the tv acting up or anything, though it takes a few seconds to turn on, which is kind of annoying coming back after it's been powered off and you want to get on and check the weather real quick before stepping out.  So it's not the best computer monitor choice.Overall, it's a reliable tv with good picture and crap speakers, but using external speakers fix that for the most part.  It makes an ok computer monitor and it has lasted me over a year with no problems.  Between the price and picture quality, i'd have given it a 5 star rating if the speakers weren't absolute crap.", "Date": "November 19, 2010"}, {"Title": "Wall Mount", "Author": "Dblain", "ReviewID": "RFKN10TF8IEZ", "Overall": "4.0", "Content": "I'd like to know if there is a specific wall mount needed for this television?Or is it just a size fit that is important as far as mounting.:)I've never mounted a television before.In all seriousness, this is a question more than a review.Although I obviously own the television or I'd not want to mount it. Mine has worked well long over its warranty, my only complaint is that the internal speakers don't have enough oomph all on their own.", "Date": "March 22, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "TV", "Name": "Dynex DX-L22-10A - 22\" Class LCD TV - widescreen - 720p - HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31lEWvJMUsL._SX300_.jpg", "ProductID": "B002RJN9LY"}}