{"Reviews": [{"Title": "This TV is wonderful", "Author": "Steve", "ReviewID": "R3BRLG4EONYUIH", "Overall": "5.0", "Content": "I picked up this Vizio 32\" LCD for $399 at Sears.  I was planning on getting a 720p TV but I couldn't pass up 1080p for the price.  The picture is incredible, blacks are very dark!  I did notice a little trouble with a horizontal line appearing at the top of SD broadcasts, adjusted the picture a bit and that is gone!  The speakers are not fantastic, there is very little bass.  They do have an equalizer but I haven't played with it.  Overall this TV is a great deal and even at $500 performs like a much more expensive TV!  I would highly recommend it.", "Date": "November 23, 2009"}, {"Title": "Great TV for the right price", "Author": "Mike Moose", "ReviewID": "R3UYKQPAZQQL75", "Overall": "5.0", "Content": "Just picked this one up at Target for $399 - can't go wrong with this purchase for that amount.  It's a perfect size if you plan on sitting 6' - 7' from the TV.  There is a bit of pixelation with scenes that have lots of fast movement, although you really need to be looking for it.  Most people won't even know it's there, so I wouldn't get hung up on it.  The HD channels look great.  I'm really impressed with the color and the black levels.  The stand was easy to set up, the finish on the TV/Stand is high gloss and it looks great. The best thing, I didn't need to do any fine tuning to the picture.  Right out of the box it looked great.  The sound is good, not great, but better than the Samsung I own.  There are enough connections to hook up a blue ray player, Xbox 360 or PS3 and sound peripherals.  I highly recommend this TV.  Everyone talks about Samsung, Sony and Sharp - but I believe Vizio is equally as good.  If you find it for $399, make the purchase.", "Date": "December 4, 2009"}, {"Title": "Vintage Box Sounded Better", "Author": "laura", "ReviewID": "R3MB4KHBNDM8TQ", "Overall": "4.0", "Content": "This is our first flat screen and the picture is amazing, although I am comparing it to our 1990 vintage GE television.  We got a great price of 460 from Target which included tax and shipping.  We received it it one week which I think is exceptional.  My only complaint is the REAL tinny sound and I am NOT an audiophile. As my 13 year old said, \"It makes my ears bleed!\"  Luckily, I had a pair of Bose speakers that I use for my laptop and now the sound is great.  I hope Vizio improves the sound quality because that's what sold me on their brand...the \"soundtrack\" in the commercial!", "Date": "December 3, 2009"}, {"Title": "Very happy", "Author": "Midwest Chris", "ReviewID": "R39FYDGKRRCNM2", "Overall": "5.0", "Content": "Picked up this tv today at Wally World for $399. Great price for a 1080p 32\". I have waited and waited to pull the trigger on a flat screen and this was well worth it. Set up was simple, and while I don't currently receive a lot of HD stations the ones I do get are amazing. My sister and brother in-law have a Sony XBR 1080p that they paid 6 times as much as this tv (2 years ago) and my wife and I both think this picture is as good or better than theirs. The sound quality is adequate, if buyers expect better from any LCD they need to get a home theater set up. Mine is in a bedroom and the sound is fine. Need to pick up an HDMI cable so I can run Blue Ray from my son's laptop. Very happy with this purchase.", "Date": "December 6, 2009"}, {"Title": "Very good TV for a PC monitor", "Author": "Dareshiranu \"Nessuno\"", "ReviewID": "RU4UQXA0XIN1U", "Overall": "4.0", "Content": "I found a good deal on this beast around Black Friday. It does a fine job as a computer display with a few idiosyncrasies. Ideally, I would think you'd want to use the hdmi input as it is a digital input, however Vizio in their vast wisdom has denied us the ability to adjust all the settings necessary to stretch the desktop to fit the screen V-Size is disabled. You can adjust H and V position and H-Size and almost make it fit the screen, just a small black band at the top (or bottom, I suppose) of the screen. I felt that was a trivial concern since the overall size of the display was so immense. But a couple of days later I was puttering around in some spare parts and came across a dvi to rgb converter plug that had come with some video card or other (previously I was using a dvi to hdmi cable). Long story short I hooked up the connector to a cable I had laying around and to the TV and lo and behold a full-screen image and crisper than that of the hdmi. Now in my world rgb is an analog input and dvi/hdmi is a digital output/input, so I can't imagine how the got a 1080p signal over rgb looking so good, and I know that they can't send hdcp over that rgb but I'll take a nice sharp picture anytime. I still have the monitor hooked up on another input for hdmi so I can play blu-ray at full rez, or so I hope... I haven't tried it yet. But overall a fine TV with plenty of inputs, despite its lack of dvi or display port. And the panel looks good, I'm moving from a 24\" benq that did hi-def and this looks as good color wise. Game playing is just fine. I've never used a screen refresh rate higher than 60hz anyway so unless someone is doing something seriously wrong or you have some kind of vision defect I'd say this is a great value. BTW, I'm sitting maybe two feet away from it, so I couldn't miss any artifacts/dead pixels/ghosting.", "Date": "December 13, 2009"}, {"Title": "What A Great Buy", "Author": "Jonathan Merz \"CId24\"", "ReviewID": "RYRPQA1X4951H", "Overall": "5.0", "Content": "I purchased this TV back in Aug 2009. I did a lot of research before buying this TV. I really wanted a Mitsubishi 60\" TV DLP, but being in college living with my parents wasent worth buying just yet. I ended up buying this TV at target for less the 500 bucks. I have a vizio blu ray player, my XBOX 360 hooked up HDMI, and my computer hooked up VGA. All look Amazing!!! Great price for a wonderful buy!!!", "Date": "January 19, 2010"}, {"Title": "Great TV for any price in my opinion", "Author": "Mark M", "ReviewID": "R2LY1K3BF58LYH", "Overall": "5.0", "Content": "I should say right up front that this is my first HDTV, so you can decide for yourself whether to lend any credence to this review.  But my wife and I love this TV and are very happy with our purchase.  The picture is vibrant and there is no glare as there was with our old school TV.  The remote is simple and very easy to use.  The TV is very light and easy to maneuver.  The sound is pretty good.  In fact, it threw us off at first because we were both hearing sounds that came from the other side of the room.  We also got the set for $50 less than other retailers PLUS there was no tax and no shipping, so we easily saved over $100.  We paid $415 for a 32\".  Lastly, the TV came in about 2 months sooner than expected.  We are VERY pleased with every aspect of this purchase.", "Date": "December 23, 2009"}, {"Title": "Perfect 1080p Monitor for my Older Computer!  Flickered first, but now A-Okay w/ few adjustments.", "Author": "DC", "ReviewID": "RHM8F14RIH3S6", "Overall": "5.0", "Content": "This 1080p monitor is a SWEET monitor for my older 2004 eMachines C3070.  The display is crisp and clear and I love everything about this display.Ran into a huge Flickering problem at first and was a bit alarmed and had thought I had to return this beautiful thing.  Small adjustments in the timing under Advanced Settings under Display settings within Control Panel fixed this issue and it was beautiful.  Any other setting than 1920 x 1080 resolution will look obviously blurry.The quality of this Vizio is comparable, if not better than much higher quality units like Sony, Samsung or Panasonic that I've compared at Walmart and Bestbuy.  The quality of the screen is similar to that of the glossy effect that you find and see in the latest laptop screens!  Because of the large size screen, internet news sites seem like Newspapers!If I can find the section within Amazon to upload my Vizio Manual with My Personal adjustments, you will find it here and I hope it helps relieve some headache and avoid returning it or something... dc", "Date": "March 16, 2010"}, {"Title": "Great Buy!", "Author": "Heather Ducote \"bookbagged\"", "ReviewID": "RE4S26RIE5N16", "Overall": "5.0", "Content": "While I was shopping for TVs I noticed that this one had superior picture quality when compared to the similar Sony's and other high-end TVs.  We have had this TV for more than a year and have not had any problems.  The picture is clear, and very bright.  It's easy to hook up all your electronics to, as well.  We have a Wii and a PS3 hooked up to it and there's still more ports for more game consoles, and the picture quality with games is excellent as well.  We have also hooked our computer up to it and use a wireless mouse and keyboard and it works very well with just RGB, we didn't need to use HDMI to get good quality. Sound is pretty good as well, we don't have a surround system and I don't notice any problem with the sound in movies or anything like that.This is definitely a great purchase, especially if you want a flat screen but can't afford a high-end brand.  We are very pleased with it.", "Date": "March 19, 2011"}, {"Title": "Perfect bedroom tv", "Author": "Chines \"MagnaRider\"", "ReviewID": "R2OB9EQFI3S9ST", "Overall": "5.0", "Content": "I have owned this tv for a couple years now with no problems.  I read the reviews on this model before purchase and there are a few defects out there that had screen problems, which convinced me to buy the extended warranty.  Kinda wish i didn't now, because I have no problems.  The design is much more appealing than other 32 inch vizios, but this one is a little higher in price.  You get what you pay for, however.  Unlike many other cheaper vizio 32 inch tvs, this one is 1080p.  I know i know, on a 32inch the difference of 1080p and 720p is minimal to unnoticeable...perhaps that is true, but I have at least that piece of mind that my blue rays might look better.  Additionally, at 60hz, the refresh rate is perfectly fine for a 32inch.  I have noticed no delay or problems with refresh rate...even with fast paced gaming like MW2.  My only complaint, I wish larger tvs were cheaper.  32 inches is great for a bedroom, but kinda sad for a living room.  :(", "Date": "December 11, 2010"}, {"Title": "Not bad", "Author": "James N. Diley \"Tech, Mech, and DIY\"", "ReviewID": "R1LW1YP6MYPJ7I", "Overall": "4.0", "Content": "Great picture, certainly not the ugliest TV out there, I only have a few complaints:1.) HDMI compatibility with my computer. Sometimes the image would blink, and sometimes it wouldn't \"unblink\" and I'd have to turn of the TV and turn it back on.2.) VGA connection (RGB) would make the monitor go blank occasionally when running full screen programs3.) Remote sucks! And to add insult to injury, there was very limited support for universal remotes. Also, shares same IR channel as the 42\" LG I have. Vizio and LG? What?!4.) Very limited menu options5.) Occasional tearing would occur in games (if you don't know what tearing is, google image search \"video tearing\"). Settings and card were fine, so that leaves the TV to be at fault.Not a big deal though, I can live with it.", "Date": "October 14, 2010"}, {"Title": "Cheap doesn't always mean low quality", "Author": "Ray Pringle", "ReviewID": "R3GKMB2L5AQQ3R", "Overall": "5.0", "Content": "Pros: Great low priced display, good picture quality, enough color/brightness settings in the menu to calibrate effectively, remote is simple and well thought out, the bezel is very nice looking, looks just as good as a display thats twice the price, full 1080p.Cons: Speakers are really bad (I hooked my bose up immediately), no bluetooth sync, the auto backlight dimming was very annoying until I figured out how to shut it off. You could say it's only 120hz but I knew this going in, I didn't feel 120hz was worth $100 more.Comments: Overall I'm very pleased with this display, I picked it up at BJ's for $399 and bought a PS3 and Minority Report blu-ray the same day. As soon as I hooked it up it was ready to go, I watched Minority Report and the quality was amazing. I've had no problems with 60hz, no ghosting, lagging, or halo that others have described.I also had the same problem with the plugging my PC in with HDMI as a previous reviewer. There was a black border around the output and I couldn't adjust height/width in the tv's menu. I was able to fix this by going into the ATI display settings and enabling overscan, this made it possible for me to stretch the output.Overall this is a great display at an even better low price, if you're not picky about refresh rates and don't need the bells and whistles then buy this tv.", "Date": "June 24, 2010"}, {"Title": "Worth the price!", "Author": "Antonetta H. Pellegrino", "ReviewID": "R2H24LWJ3EV71Y", "Overall": "5.0", "Content": "I recently purchased this product about 2 weeks ago for my Xbox 360 and it has been absolutly amazing. The 1080p picture is very detailed and clear, and it runs very smooth on the Xbox. There has never been any screen lag whatsoever. If you are looking for a top of the line TV to take full advantage of a console's or Blue Rays 1080p picture, this is your best bet! Buy with confidence", "Date": "February 27, 2010"}, {"Title": "Very Nice Television", "Author": "Walter Tingle", "ReviewID": "R2NG7VM01OFN35", "Overall": "4.0", "Content": "I did a bit of homework, and this TV stood out among the finalists. The price is right, and the specs are good. When I got it home, I hooked it up to an ancient antenna. Wow! The stations which came in decently on analog TV are razor sharp. I have to exchange a cable box this week, but if the cable output on HDMI is only as good as the over-the-air signal, this TV is worth every penny.", "Date": "February 14, 2010"}, {"Title": "Vizeo HD", "Author": "Paul H. Douglas", "ReviewID": "R21T0CQCRDCDGI", "Overall": "5.0", "Content": "Excellent product.  Great price, 1080 pixels for price of 720.  Easy set-up, great picture, & sound quality.  A definite winner!!  Great bargain.", "Date": "January 30, 2010"}, {"Title": "Fantastic!!!!", "Author": "Shannon E. Philipp", "ReviewID": "R16NEUW8BWVM25", "Overall": "5.0", "Content": "We bought this tv for our daughter to take away to college.  She loves it!!  It looks great, has excellent picture quality, and was a great value. Definitely would recommend this product.", "Date": "January 7, 2010"}, {"Title": "This is a good T.V.", "Author": "Rose", "ReviewID": "R1IRD445UTUZXJ", "Overall": "5.0", "Content": "I love this T.V.  The only slight negative is that the sound isn't the best, but I don't have speakers which I guess I should have.", "Date": "December 24, 2009"}, {"Title": "TV", "Author": "Tink", "ReviewID": "RQWJITSL6OII2", "Overall": "3.0", "Content": "I loved the looks of this TV and it was working ok but after about 5 days the picture started messing up.  Think I just got a bad one cuz the reviews on this were great.  Haven't replaced it yet but would buy another one of this brand.  My money was refunded promtly.", "Date": "February 12, 2010"}, {"Title": "Tips over too easily - now it's broken", "Author": "TOPJOB7 \"topjob7\"", "ReviewID": "R1DJAE1SUANFXN", "Overall": "2.0", "Content": "We only had this TV for 3 months when a slight bump to the stand it was on dumped it over and broke the screen.  Vizio so far won't take responsibility even thought their inadequate stand is at fault.  This and the sound quality means 2 stars, despite the decent video quality.If anyone has a broken TV of this model with a good screen please let us know as maybe we can repair one of them!I recommend wall mounting this model - as we'd intended to do before it broke - or put it out of harms way on a very stable table.  It tips easily both forward and backward.Otherwise, the video quality is very good, the controls, remote and setup all work well.  Note that his model is 60Hz.  We found the sound quality barely adequate - if you want good sound you will need to add speakers.  The side-mounted control buttons are nice when you don't have the remote, and are hidden from view while watching the TV.We didn't find the white glowing \"VIZIO\" logo under the screen bothersome, but rather kind of cool.  It isn't all that bright, but some people might find it annoying in a dark room.", "Date": "March 19, 2010"}, {"Title": "lemon", "Author": "L. Rick", "ReviewID": "R38P1SCCGNBY1B", "Overall": "1.0", "Content": "I happened to get a lemon. Once the tv was all hooked up and ready to go it worked for about 20 minutes then the screen went black. Was not a happy camper!One thing that was great was Amazon! They were great with the return, so easy I couldn't believe it! They also sent another one (tv) out so fast was amazed again.Will admit I was worried about sticking with the same tv, but this one has been working fine. Figured I just got a lemon the first time around. I would rather that had not happened of course but was so pleased with the manner in which Amazon took care of everything.", "Date": "January 8, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Shipping: Currently, item can be shipped only within the U.S.\nThis VIZIO HDTV exceeds the current minimum standards by 15% saving you money on your utility bills\nCurrent Version 3.0 ENERGY STAR TV products Specification require that all qualified televisions address both active and standby power\nDynamic 50,000:1 Contrast Ratio allows for deeper blacks and brighter whites\nFull HD resolution giving you razor sharp clarity, crisp and clear images and an absolutely amazing viewing experience", "Name": "Vizio VL320M 32\" LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51a5e%2BjQeyL._SY300_.jpg", "ProductID": "B00293T50W"}}