{"Reviews": [{"Title": "Another Great Buy From Vizio!", "Author": "Matthew Durr \"Amazon Connoisseur\"", "ReviewID": "R179EOMN3BB54B", "Overall": "5.0", "Content": "As a future college student, I have looked for, researched, and tried out many small HDTV's to use as a computer monitor/HDTV for my dorm room. The employees at Best Buy stated that if a TV wasn't over 46 inches big, you couldn't tell the difference between 1080p and 720p. However, he didn't know what he was saying. At relatively far distances (i.e. normal watching distance for most TV's) the difference between 1080p and 720p is small to none. However, from a short distance (like 4 feet for a 42 inch, or 1.5 feet for a 24 inch) you can easily tell the difference in resolution. This is where this T.V. comes in. As a computer monitor, I will be close up to the screen, reading tiny text like the text in this review! Now that the main issue has been sorted out, it's onto the main review:  Contrast-5000:1 may seem like a big number, but that is only dynamic. Although I couldn't find the static/typical contrast, it is probably around 900-1000. However, since this set has a relatively low brightness (300 cd/m2), blacks looked blacker than normal, which is a good thing.  Resolution- 1080p...enough said!  Motion- 5 ms means that button presses on any device (like a keyboard or game console) happen with only an unnoticable .05 second delay, which is lightning fast. However, since there is no 120Hz, there will be noticeable motion blur on extremely fast action scenes. This tv is relatively small, so motion blur won't be a big problem for normal watching and gaming.  Feature Set/Presentation- since this is an ECO HDTV, it uses far less power than previous models, if your into the whole energy saving thing. SRS TruSurround is always a good thing for making movies and other sounds \"pop\" but when that program is run through 3 Watt speakers, you can't expect much. The 3D comb filter, now standard with many HDTV's, helped to put out a wide color scheme; at least that's what my friends said they saw, I'm colorblind, so color gamut specs really don't apply to me. The white/black look touches off my 360, but it can only match with so many things.  Overall Value- for a little over $300, you get full 1080p, a relatively \"large-small-screen\" great for a computer monitor, and the confidence that you got another good HDTV from Vizio.  Hope you liked the review!", "Date": "August 29, 2009"}, {"Title": "Speaker hiss, logo won't turn off", "Author": "Adam", "ReviewID": "R2PM29Q26B4DZY", "Overall": "3.0", "Content": "When playing digital broadcast television or HDMI digital audio such as from a blu-ray or DVD, the built-in speakers have substantial hiss reminscient of a distant analog television siginal.  The headphone jack (the unmarked hole in back of the left edge of the monitor) also has audio static, although the static was only noticible when I used my $[...] Maxell dhp-ii headphones and unnoticible on my $[...] Inland heaphones.  I bought one of these televisions at Costco and swapped it out for a replacement due to the audio static, and both units had the same audio static.  I work around this by connecting my headphones directly to my blu-ray player and keeping something plugged into the telvision's headphone jack.Also, if you are going to use this television as a monitor always playing video-only signals, you should be relieved to know that the audio static apparently does not occur until it is asked to play audio.  So, if you are just going to connect the monitor to an HDMI computer video card with no audio, you may never have to deal with the static.Another drawback you should be aware of is that you need an external AC power switch to get the unit's logo light to turn off.Finally a really minor complaint is that selecting VGA input from the remote control requires a multi-key sequence that has a fast enough timeout that I often have to try twice.  The other inputs have their own buttons on the remote control, so this problem only applies to VGA, which will become less popular in the future anyhow.In spite of these drawbacks, if you think of this device as a video-only monitor with a good number of inputs that, as a bonus, includes speakers and a broadcast digital TV tuner that can be used to catch the news occasionally, it is cost competitive with similar computer monitors that have no speakers and no ATSC tuner.", "Date": "September 15, 2009"}, {"Title": "5 stars within its class", "Author": "R. W. Russell \"midway42.org\"", "ReviewID": "R3HU3WC8I0CAQJ", "Overall": "5.0", "Content": "By \"5 stars within its class,\" I mean this is an excellent set if you don't compare it to much more expensive TVs with far more features.  If you're just looking for an HDTV in this size with a really great picture and simple operation, and at a bargain price, this one qualifies nicely.  It's currently being featured at Costco at a deep discount. (March 2010).I connected mine to an over-the-air antenna, and the HD picture out of the box was simply outstanding.  Another advantage that this model has over many of its competitors is the front-facing speakers and strong audio output.  I previously bought a Samsung P2770HD with similar specs, except that the audio output from its down-pointing speakers was really poor, even at max output.  I took it back to the store.  You can hear this one in any room with the volume control at less than 50%.Some reviewers have criticized this set because of its tinny sound (described as \"hiss\" or \"static\" in other reviews).  That's largely because the default audio tone setting is \"flat,\" and you can change it in the audio submenu.  I set mine to \"rock,\" which improved the bass and cut the tinniness.I didn't have any of the other problems cited by other reviewers such as color bleed or a logo that won't go away.  No logo on my screen.I'm not a fan of Vizio in general, as it's by no means a top of the line manufacturer, and their sets rarely show up on any preferred list in Consumer Reports and the like.  But I decided to take a chance on this one due to Costco's generous return policy.  If it disappoints me within 90 days, I can take it back for a full refund.  But first impression on this one is that it will be a keeper.", "Date": "March 17, 2010"}, {"Title": "It's great but....", "Author": "Peter B. Perkins Jr. \"HandsomePete\"", "ReviewID": "R1XUFWAPPOL805", "Overall": "3.0", "Content": "This TV is easy to use, has a good array of inputs on the back, and even has a headphone input.  My biggest complaint is the light bleed especially the edges.  Coupled with Blu-Ray the picture is amazing but when my eyes aren't attracted to the edges I'm looking at that spot that supposed to be dark but is kind of shiny-ish.  If you know what I am talking about and really don't care then I highly suggest this TV and brand in general for the ease of use and low prices but if you are easily distracted like me you should probably look for something else...", "Date": "October 7, 2009"}, {"Title": "Excellent all around.", "Author": "Michael W. Bennett", "ReviewID": "R3R0630K5QSYU1", "Overall": "5.0", "Content": "Delivery was as promised, and the television is wonderful. The picture is great, and my only regret is that I did not purchase a larger screen.", "Date": "October 1, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Size:24\"; Viewable: 23.6\" diagonal\nNative Panel Resolution: 1920 x 1080\nSignal Compatibility: Supports 480i (SDTV), 480P (EDTV), 720P (HDTV), 1080i (HDTV), 1080P (FHDTV)\nContrast Ratio: 5,000:1 (with DCR)", "Name": "VIZIO VX240M 24-Inch Full HD 1080p LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51TQe89LzyL._SY300_.jpg", "ProductID": "B002J290FI"}}