{"Reviews": [{"Title": "Great TV for the price", "Author": "Trooper Thorn", "ReviewID": "R20BHHUU3MMFH7", "Overall": "4.0", "Content": "This TV is quite impressive, especially for the money.  There are plenty of inputs, many of which are conveniently located on the side of the panel.  As far as the picture goes, the color is fantastic, and the contrast is pretty good as well.  Where this TV falls short is the uneven back-lighting.  In a low light setting watching a dark scene, you can see portions of the screen are brighter than others, which can be annoying at best and distracting at worst.  Aside from that, I have no complaints with the television.  Were money no object, I'm sure the Proscan would rate lower, however the value you get out of this TV for the price is hard to match.  It is a very fine budget LCD HDTV.", "Date": "February 2, 2010"}, {"Title": "Excellent for the price", "Author": "Lilly St. James", "ReviewID": "R3I4TJ37L5UCUE", "Overall": "5.0", "Content": "I bought this for my workout room and for the money it is excellent.  It was easy to set up and the picture quality is very good.  I have a $3500 1080p TV in my main room and the picture quality is only somewhat better.  For the price this thing fully delivers.  We looked locally at TV's and couldn't even get a 720p for this price.If you are going to nit pick or expect a $1000+ TV, then get your head screwed on right, it is not a high end TV but it is definitely not crap and the thing I really like about it is I have it up a little higher so I can see it to work out with but I can even see the picture and colors true when I'm on the floor stretching.+ Amazon prime $3.99 overnight shipping to my door.  The local store couldn't beat that if they tried.", "Date": "February 28, 2010"}, {"Title": "Great TV at a Great Price", "Author": "quovazi \"The Missing PIECE\"", "ReviewID": "R2HG6PF8ZVPAI0", "Overall": "3.0", "Content": "Bought this TV when it was on sale at costco for $399.  Excellent picture quality, adequate inputs (3x hdmi, 2x component, 1x composite/s-video), and a nice sound system.  It is also very slim in depth compared to other non-ultraslim flat screens.Why I wouldn't give this tv 4-stars:No USB input, second component input, or L/R audio output (you will have to buy a Y-audio cable for audio output).When there is no sound on an input the speakers make this small popping noise.  I don't know why that is.  To accommodate the noise, I put the tv on mute and the popping stops.Another shortcoming is the remote control range.  It does not work if it is more than a 30-degree angle from the receiver or not at the same vertical level.Overall, it is a great tv for a great price.", "Date": "December 23, 2009"}, {"Title": "Sound board gone after 3 MONTHS!!", "Author": "Disappointed!", "ReviewID": "R33NABN3WXAGBT", "Overall": "1.0", "Content": "I bought this TV last November 2009. After 3 month and half, sound board went out and there was no sound from TV. We called Proscan and tech came out to find out what is wrong. He ordered parts and we waited until parts delivred to us. After 2 weeks, we did not get parts, so called Proscan. A rep said it is on back order, but he could not tell us how long will it take. I requested to replace the TV since we may not use TV after slightly over three months. The rep said if technician authorize repalce, then I may get a new TV. IF NOT, YOU HAVE AN OPTION TO THORW IT AWAY....What a poor customer service they provide!! Worst TV and Wosrt customer service.", "Date": "March 24, 2010"}, {"Title": "Don't buy this TV!", "Author": "RNB", "ReviewID": "RAB2ML8Q2U97W", "Overall": "1.0", "Content": "This TV is a lemon.  The power board on mine went out eight months after I bought it, and the FBI would have a hard time tracking down the manufacturer, ON Corporation.  Best Buy can't even get in touch with them.  Save your money and buy a good television.", "Date": "March 18, 2010"}, {"Title": "It never worked", "Author": "Yenju Wang", "ReviewID": "R3CDL6EPB382M5", "Overall": "1.0", "Content": "The TV screen went completely black after less than one minute when first powering on. When I turned it off and turned it on again, it did the same thing. I believe I got a defect one and had returned it for a refund.", "Date": "May 29, 2010"}, {"Title": "Great resolution, terrible everything else...", "Author": "B. Maugans", "ReviewID": "RIQ6GAJ3403GF", "Overall": "2.0", "Content": "I was seeking a small LCD TV for my bedroom, so I wanted something cheap.  The price was definitely right on this one and the specs looked good as well.  After unpacking it and hooking it up, I discovered why the price was so cheap.  The resolution was great, but unfortunately every other aspect of the picture was terrible.  Blacks were too dark but increasing the brightness to reasonable levels completely washed out the image.  Colors were just plain WRONG - most things appeared too blue and way oversaturated.  Reducing the color output to a manageable setting took all the \"pop\" out of the image.  And these problems were not even the worst: all but the brightest scenes showed large amounts of dithering so that darker areas became a pixelated mess.  This made everything but the news and sports basically unwatchable due to the distraction of it.  After trying for a week to obtain a watchable picture I gave up and returned it for a Sharp 32 inch set and couldn't be happier.", "Date": "May 9, 2010"}, {"Title": "Poor color depth sometimes yields pixelation and color banding instead of smooth color gradations", "Author": "John Rylander", "ReviewID": "R2738JJ3051HF6", "Overall": "2.0", "Content": "Edit to put the bottom line right at the top: if occasional pixelation of scenes really would bother you a lot, this is not the TV for you.  If that's a only minor annoyance, since it only happens in certain circumstances (dark or other almost uniformly colored areas), this could be a great bargain TV for you.Basically, it appears that the color depth is unusually low, perhaps 16-bit (32 shades per primary color) instead of 24-bit (256 shades) somewhere in its processing.  The result, most common in dimly lit scenes but appearing often when there are large areas of very slightly differing colors, is that instead of various shades of a color imperceptibly blending together along a continuum  (e.g., dark gray smoothly deepening to very dark gray), you get a very discrete stair-stepping of colors (e.g., dark gray suddenly switching to very dark gray)--what's often called \"color banding\", though it occurs more in flickering splotches than in bands, all depending on the scene's coloring.At first I thought this must be due to the cable company's over-compressing the signal, but no: I noticed it on a very HQ Blu-Ray disk as well.  When I moved that same Blu-Ray disk player and disk to a friend's nicer TV, the color banding/pixelation vanished.", "Date": "May 3, 2010"}, {"Title": "Great TV For The Bedroom.", "Author": "BigCityChicken", "ReviewID": "R6EI950KMPBD0", "Overall": "4.0", "Content": "Set your expectations realistically folks. At this price range you're not gonna get a reference television. I just purchased this set for my bedroom and am very happy with it. My cable company signal sucks (Comcast) but once I fiddled with the parameters, I think I have obtained a pretty decent picture within reason for this price range. 4 stars relative to the price range.Pros: Bang for the buck. This is the strongest point.  Lot's of connections.  Surprisingly good sound with LOUD volume.  Lot's of options to adjust the picture (good thing, because your gonna have too).  HDTV signals can look magical (obviously much of this depends on the broadcast signal).Cons: Has some difficulty with black resolution...some black images look like ink stains from an underwater squid. This is the worst point.  Like many LCD's, it has a hot picture that can burn the eyes over time. Get a backlight.  Mediocre picture straight out of the box. You are going to have to adjust the parameters and fiddle with the sharpness/digital noise  reduction.  Colors too florid out of the box. Some of the reds look pinkish. Some of the greens look like an Irish haze. Tint rather Wizard of Oz-ish.  Delay between channels when switching.  Generic remote.", "Date": "April 30, 2010"}, {"Title": "Not worth it...", "Author": "S. Cook", "ReviewID": "R3AAW1B0DW5GEZ", "Overall": "2.0", "Content": "I read SO many reviews on this product before I purchased it and they were all very positive. I was really excited when this TV arrived. It arrived yesterday, and we hooked it up and put on Princess and The Frog, with every movement on the screen, the picture pixelizes and you can see boxes of color. I can't even imagine how bad it would be if we were watching a fast paced movie. This is a normal movie, with no fast action, and the TV couldn't keep up with the speed. I am really disappointed and considering returning the TV. I hope this helps.", "Date": "March 18, 2010"}, {"Title": "Don't buy this TV", "Author": "Lance R. Minka", "ReviewID": "R2F7DGSYBPFEDH", "Overall": "1.0", "Content": "I purchased this TV and it was a mistake from the get go. The overall picture quality was fuzzy and blurred. After 4 days the screen would go blank and the only way to turn it off was to unplug it,the power button and remote did not work. When I plugged it back in and turned it on the TV would work for a little while then go blank and the sound would turn off. After doing this a few times the picture and sound would not come back on at all,but if you tapped it on the top you would get a picture and sound for a second and it would die again. So I went to Kmart and bought a 32 inch RCA and the picture is crisp,clear and 10 times better. It's a good thing Amazon has an excellent return policy and easy to return procedure or I would be really ticked off. DON'T WASTE YOUR TIME AND MONEY ON THIS PROSCAM TV.", "Date": "April 13, 2010"}, {"Title": "As a Value 32\" 1080 This Gets 5 Stars", "Author": "C. C. Mantis \"Exposed\"", "ReviewID": "RS550BXSO6XY9", "Overall": "5.0", "Content": "The word is Value here. For the price paid I'm satisfied and enjoy this TV. Have had it for about 4 months now and use it daily for approx 5 hours or so. Let me get the one little negative out of the way up front. The color is difficult to tune in and has no automatic color options. It also does not compare to my 50\" 720 Panasonic Plazma I use in living room which has absolutely great color.Having said that I have gotten the color to a pretty good balance by using the following MENU settings on my TV:Picture Mode = STANDARDBrightness = 50Contrast = 50Color = 48Tint = 1Sharpness = 3Color Temperature = Standard and I leave at 50 for all three settingsDNR - AUTOThis works for me but you'll probably want to tweek a little to your liking. Be aware - You can spend hours and still end up in frustration if you are looking for perfection. If you want really sharp vivid colors - get another TV - like Panasonic. You'll have to pay more, but you'll get better colors.On the plus side once the color is set I like the picture. I can use this for a monitor if I ever want to - like when I'm thinking about hooking all my TV's, Computers, Music etc to the Internet and cancelling Comcast TV. Some form of master controller will allow this TV to work well watching I-TV via one of the DVI inputs to the controller which connect to a computer. So on that account I'm also glad I got this TV.I gave it a 5 star rating based on the price paid as well as the 1080 monitor capabilities. I see where some folks have had problems with their TV's. I believe lower prices means cutting corners, and one of those corners is probably Quality Control. Either you get a good one or you don't. This is just a guess, but chances are my experience is not unusual. I've got a good one going on 4 months and hope it lasts. You probably will too, and if you don't and you buy through Amazon, save your box and send it back if you have any problems.One more note: If my memory serves me, I believe Proscan used to be a very high end TV line back in the 80's and 90's. They must have sold out and the new owner decides to bring pricing down to reality. Could be they still offer a high end series - but I didn't see anything with a quick check.", "Date": "October 11, 2010"}, {"Title": "Dead before 90 days old", "Author": "S. H. Birge \"Lucky\"", "ReviewID": "RDPQZP9TK3LXJ", "Overall": "1.0", "Content": "I must say I thought I had a great deal when I purchased this TV. Out of the box it looked and worked great, but low & behold within 90 days the TV is dead... I called the 800 number to Proscan, but only got a recording. So I put in an online warranty claim, but after 2 weeks I still haven't heard anything back. It has a blank screen, no sound and is unresponsive; only thing that happens when you turn it on is the red power light turns blue. So it seems to be a power issue. With that being said, I can rule out a power spike; it was hooked up to a surge protector and power conditioner. I guess you get what you pay for. Personal advice, pay a little more and get an extended warranty.", "Date": "September 8, 2010"}, {"Title": "Watch Out!", "Author": "MarciaBrady", "ReviewID": "RUJRS0GK2Q5VM", "Overall": "1.0", "Content": "Remote control did not work when TV arrived but we tried to make do with the U-verse remote. Volume controls stopped working after about 4 weeks. TV completely quit working after 6 weeks when it oversurged and caused minor electrical damage before problem was discoverd. Proscan has sent packing materials for us to return it for \"repairs\" and I gotta give Customer Service 2 thumbs up - very professional and helpful. We'll see what happens when the TV is repaired returned to us.", "Date": "August 27, 2010"}, {"Title": "A very nice HDTV for the price.", "Author": "Michael A. Leyva", "ReviewID": "RCT61SQS94PC7", "Overall": "5.0", "Content": "I bought this HDTV for a room that I watch TV in every now and then. I really didn't want to spend a lot of money for it. This set really exceeded my expectations. The picture is very crisp and has great color. Everyone that's come to my home and watched it, have been surprised at how good it looks considering what I paid for it. I highly recommend it to anyone who is on a tight budget.", "Date": "March 25, 2010"}, {"Title": "I give this TV a so/so rating based on black levels alone.", "Author": "AdamH \"Adam\"", "ReviewID": "RWK7X6KJ9MISR", "Overall": "3.0", "Content": "Bought this tv looking for an inexpensive tv for nightly viewing in the bedroom.  Didn't need anything huge nor expensive with all the bells and whistles.  Read every review i could find before purchasing and it seemed like the buyers who got a working set out of the box were very happy with the performance.  The worst reviews all seemed to come from buyers receiving dead sets or a tv with dead pixels.  Received the set 3 days after ordering and considering i used the free super saver shipping i was VERY impressed.  The tv's internal tuner picked up a ton of local OTA channels but i instantly noticed the poor black levels.  I have fiddled with every picture setting since i received the tv and still can not get to a very satisfactory picture quality.  The worst picture is evident anytime we watch a DVD.  Considering movies have more dark scenes than most any television program it sometimes becomes unbearable to watch them.  When watching most television the tv has satisfactory picture quality but the darker scenes in TV shows and movies are rough.  The speakers on this tv are on the verge of being a unusable.  This pushes me towards my next purchase of a moderately priced sound bar so i don't have to install speakers throughout my room.  Overall, i suppose i have to say for $350 and 3 days of shipping the purchase was worth what i paid but i'm glad i only have to use the tv for 30min-1hour per day tops.", "Date": "April 12, 2010"}, {"Title": "The worst TV that I ever purchased", "Author": "Alejandro Salas", "ReviewID": "RNTLOK3J9HA76", "Overall": "1.0", "Content": "The worst TV that I ever purchased:TV started to failed 2 days after purchased, picture is very dim, there is no way to make it brigther, had a dead pixel 1 day after", "Date": "March 27, 2010"}, {"Title": "useless", "Author": "disturbed", "ReviewID": "R1MOQS97XMN598", "Overall": "2.0", "Content": "the remote control doesn't work and you can't use a universal remote so really what good is it--this was purchased for a bedroom", "Date": "July 9, 2010"}, {"Title": "Not a better TV for this price", "Author": "Hari Sriram", "ReviewID": "R1ZDO239N6SYTK", "Overall": "2.0", "Content": "I never recommend this TV to anybody, not worth to buy. Picture quality is OK and Sound quality is better.After 3 months, I returned this TV because it change channels on its own after few hours of continuous watching and requested amazon to take it back but they rejected as it crossed a month after buying. So, I approached proscan customer service to repair....I think i am not lucky", "Date": "September 22, 2010"}, {"Title": "bad product....", "Author": "G. Bringas \"stormshadow\"", "ReviewID": "R3987J7FD2LMJH", "Overall": "1.0", "Content": "maybe it is just bad luck but i received the product non-functioning. led power is on but no picture. i consider myself tech savvy, i do reverse engineering on some consoles and built my own gaming pc. having to wait for two weeks to get it because of free shipping, and this happens. should have listened to my wife to spend a little more and get name brands.", "Date": "June 16, 2010"}, {"Title": "Excellent Quality, Excellent Price", "Author": "Arye Michael Bender", "ReviewID": "R14D5L3G1N18QI", "Overall": "4.0", "Content": "Though I've only had the set for about two weeks, am most impressed with the image quality, sound, and overall design.  If the product continues to function at its current level, it will have been well worth the price.There is a hitch. This is the second shipment of the product.  The first one had problems with resolution and focus.  I tried every possible permutation of the settings, but the quality remained unacceptable.  So I contacted Amazon and they arranged for me to send the set back. Before my refund arrived, I decided to give Proscan a second chance.  Amazon was immediately helpful. So they sent me a second Proscan which is was flawless from the get-go.Appreciate Amazon for making my transactions painless.", "Date": "June 4, 2010"}, {"Title": "Pleased thus far", "Author": "Amazon Customer", "ReviewID": "R1BYUKBT9SLGEL", "Overall": "4.0", "Content": "I was shopping for a large screen to use as a computer monitor and discovered that buying a TV with the tuner and extra inputs was very little more money.  I was apprehensive about a few of the reviews, but it appears that if it gets past the point of infant failure, you'll do fine.The screen is HUGE to use as a monitor on my desk, but am loving every inch of it.  The brightness is a bit high, but I am still working on adjusting it to my liking.  Playing a video file is a wonderful experience.  Gone is the watching a postage stamp effect.  The only downside is the built in sound.  A bit tinny with weak bass.  But with the tiny built in speakers, I guess that is to be expected.  One other nit pick, when using the HDMI input fed from my Mac mini's DVI output, the sound is non functional.  There is no provision to input analog or digital audio on a separate connector like my old Panasonic had.  If you use the VGA input, yes, there is a separate audio input that mates up with it, just not if you choose to do the higher clarity on the the HDMI.  (Yes, I know that HDMI carries audio, but not when fed from a DVI source.)I was able to enable the full 1920x1080 resolution on my Mac by installing SwitchResX and the hints that Mr. Hicks gives in his review further down the list.  The panel mistakenly reports back to the video card that its native resolution is 1440x900.  I am assuming that is a firmware bug.A few other random notes:-Tuner sensitivity is very good.  I pull in everything transmitted form the Sears and Hancock very well with a rooftop antenna.  -No cable sub.-UPS banged up the box pretty bad.  Several holes and complete tears.  Bad enough that i took pictures before I opened it.-The sound is LOUD.  The scale goes from 0-100 but you will rarely need to turn it above 10.", "Date": "May 25, 2010"}, {"Title": "1080 HDTV with 1950s inconvenience", "Author": "Tired of Walking", "ReviewID": "R2BSYWVS8H9VSL", "Overall": "2.0", "Content": "Purchased this at the beginning of summer while it was on a ridiculous sale. When the TV arrived, it had a few minor issues. 1) The image would get a bit of static after it warmed up. 2) The remote never worked.After spending a week filing customer service complaints and requests with the maker (ONCORPUS), I finally heard from someone asking to verify my purchase date and location (Amazon.com). Then nothing for a month. I sent emails to the representative from ONCORPUS and heard nothing. I filed another service request (can only be done online) and the representative got back with the excuse that he had never received my email confirming my purchase date/location. Glad I kept my emails. A week later I received a replacement remote in a box with no note or paperwork. Guess what... still doesn't work.I hope your Proscan works the first time around... and you don't have to get up and down every five minutes to adjust the volume and turn it off.", "Date": "September 23, 2010"}, {"Title": "Good basic 1080p TV", "Author": "There's No Stopping Space Vikings T. Edwards!", "ReviewID": "R6WSU2D4FDQB5", "Overall": "4.0", "Content": "I picked this TV up a few months ago so I could get my 360 and PS3 off of my computer monitor.  Clearly I knew I wasn't getting a super high end TV but at the end of the day all I wanted it to do was work for gaming on a functional level.  To that end this TV met all of my expectations and exceeded them.Games look fine, there's no ghosting, fine text is easily readable, and the color and resolution are nice enough.  Compared to other 'better' TVs I've seen I would say that the colors are perhaps a little washed out, not quite as rich as other TVs I've seen.  I've read of people playing around with various settings to get a better look overall but it's not something I'm well versed in or have tried yet.  When switching inputs, or sometimes when firing up a game, the screen will display an odd green graphical pattern briefly at the bottom of the screen.  The response time on switching inputs is also a little slow by comparison.Movies, both DVD and Blu Ray look good, they more or less adhere to what I've seen with games.  I'd say the visual quality, or lack thereof for lack of a better way of putting it, is a little more apparent in a movie than it is in a game.  I recently watched some older movies and some of the darker and brighter scenes made this very clear.  It's still infinitely better than the SD TV I had previously but there are discernable differences between this and other perhaps more pricey choices.Cable TV to me looks worse than my SD TV for the most part.  I don't have digital or an HD pack (don't watch enough TV to warrant the cost) so most of what I get in my package isn't high definition.  The HD channels I do get look great but for some reason all of the other channels just don't look right.  I don't know if it's a factor of not finding quite the right display settings, of which I have tried many, or if the flaws of the actual programming are more apparent.  The typical cable show looks somewhat distorted and fuzzy to me.  It isn't however so bad that I'm going to backtrack to my previous TV.The built in sound isn't great either.  Whether the game/movie/show is to blame or not you may find yourself battling with the volume controls at time to find a reasonable balance.  I encounter this the most with movies, and the \"Voice\" sound setting helps, but I do have to do a fair amount of volume juggling with the stock speakers.  I'm personally looking in to getting a surround sound setup which will likely remedy the problem but out of the box the sound isn't amazing.  This is probably true of most stock televisions but there it is.Features?  Well there really aren't any.  At this price I guess that's to be expected.All things considered it's a great TV for the money.  A more discerning aficionado could surely argue against this TV with great validity but I think for a more pedestrian consumer looking for a basic upgrade this is right on.  For me this was my first HD set short of my computer monitor, so while I find myself greatly behind the technology curve this time, I'm sure there will be plenty of others just like me.", "Date": "June 7, 2010"}, {"Title": "I'm never going to a movie theatre again", "Author": "U.N. Owen \"'The past is prolgue...'\"", "ReviewID": "RDHDFQEQ9D21P", "Overall": "5.0", "Content": "I'd been wanting to get a new TV now for...awhile. Finally, the opportunity arose that I could. I always am a cautious shopper; I never rush out to buy something without checking out all options - I ultimately want to get the best for the least (I'm a NYC'er - it's in my blood).It was between this Proscan, and a 'competitor'.I finally went with the Proscan - I could NOT be happier. The price? The closest competitors were at LEAST $100 more. Ease of set-up? A SNAP - just plug the HDMI cable from my cable box into the TV.The picture: AWESOME.", "Date": "May 19, 2010"}, {"Title": "Great tv", "Author": "AF Whigs \"Whigs\"", "ReviewID": "R1SFIKQKBLADLW", "Overall": "4.0", "Content": "We bought this when our old 27\" Sony died after 10+ years of service.  THis is our first flatscreen, and I have to say that I'm very pleased, overall.  HD broadcasts through Dishnet look fantastic, as does streaming content from Netflix.  DVDs look great, depending on the quality of the source material, of course.  There are plenty of options for adjusting the picture, but in general the basic default settings are very good, I just change the temperature to \"warm\", and it suits my tastes perfectly.The only downfall of this tv is the sound.  It's not a huge issue - it sounds fine, and actually is easier to hear than our old Sony (dialog and quiet moments, etc), however I find the tone settings to be a bit lacking.  There's not much bass response, and overall changing the bass & treble settings has an effect, but it's not super-dramatic.  The remote has a button to switch between various sound options quickly, which is nice.  THis tv is also very LOUD - we have the volume anywhere between 1-12, tops, depending on what we're doing (videogames are usually at about 1 or 2) - and I think the volume goes up to 70.So, to really get good/great sound, you need to hook this up to some external source - a stereo, surround sound unit, soundbar, etc, which I plan to do.  So overall I'd give the tv a 4.5, because the sound is an issue, but it's not a deal breaker by any means.  It's \"good enough\", but it would've been nice if it was better.UPDATE - NOVEMBER 2011:  So we just upgraded our satellite with direct tv (1080i, old setup was max 720p), and got an upscaling dvd player because our old standard dvd player broke.  NOW I can really see what this tv can do, and the picture is truly spectacular.  Any programming in HD looks just jaw-droppingly fantastic.  Another nice thing about his tv is that the matte finish of he screen deals with glare very well. It's rarely an issue.  So, 18 months later, it's still chugging along and I'm happer than ever with this tv.", "Date": "May 19, 2010"}, {"Title": "Worked out well for me.", "Author": "Derek C. Lindberg \"Derek\"", "ReviewID": "RBAQ1HPXIYBCH", "Overall": "4.0", "Content": "I was a little apprehensive about buying this television since the reviews were very mixed.  I took and chance and it paid off. This TV was easy to unpack and set up.  The only complaint I have is about the color black which is often shows the pixels or squares in movies that depict outer space.  I have plugged every kind of device into it and it has performed well. (Devices Macintosh computer SVideo. PC HDMI and SVideo. Sony blueray player with netflix, xbox 360, Wii).  Don't be afraid of the early reviews, it looks like they have the issues fixed in later production models.", "Date": "June 14, 2011"}, {"Title": "Very Nice", "Author": "CaptDave", "ReviewID": "R3MVZCBYI6A4J3", "Overall": "5.0", "Content": "I'm no expert, but this unit looks great, has all the different inputs I needed, and the price was right!I would recommend it!", "Date": "April 17, 2011"}, {"Title": "Can't pass it up at the price", "Author": "jackgjr", "ReviewID": "R3AH54NP5NPJNE", "Overall": "4.0", "Content": "Is this TV as good as my 55 inch plasma? No it is not in the same ballpark.  BUT, 1080p with 2 HDMI ports that work, and can be used as a monitor, no one in their right mind could pass this up for $299 and $3.99 next day shipping with Amazon Prime.  I've had no problems with mine, and can tell you the sound, picture and EVERYTHING about this set is much better than what I have found with other \"budget\" sets.  I give the set 4 stars as a TV, but would give it 10 stars as a bargain.", "Date": "March 28, 2011"}, {"Title": "First one wouldn't recognize the remote, Second works great", "Author": "K. Vesper \"Honest Reviewer\"", "ReviewID": "R246BZJCF1V1EL", "Overall": "3.0", "Content": "I just bought this 399 from a major retailer beginning with W and ending in mart.  My first one, like other reviewers, wouldn't recognize the remote.  It was manufactured in Sept. 2009.  I exchanged it, got one manufactured in Oct. 2009 and it works just fine.  Can't beat it for the money, but I certainly understand the frustration of others who have had the remote issue.  All I can say is try another.", "Date": "August 5, 2010"}, {"Title": "OK for the price", "Author": "W from Chicago Metro", "ReviewID": "R1Q7IB4NF3ICVA", "Overall": "3.0", "Content": "I have owned this monitor for about a month.  It works fine.  It was easy to setup except that in order to get a reasonable picture I had to manually adjust the settings--not a big deal but it took some time to get it right.  The picture is adequate.  I have used it on gaming machines, DVDs, and HD TV.  It is not even close to my Samsung Touch of Color TV, but it was not in the same price league.  The sound is better than I expected and certainly adequate for a smaller room.I got it for my \"napping room\", so I watch and sort of sleep.  For that purpose it does the job.  If you are looking for much more than adequate for a small room, you might want to look elsewhere.If it holds up, I'll be happy.", "Date": "April 24, 2010"}, {"Title": "Very good value for the 1080p dollar", "Author": "C. Yee", "ReviewID": "R13E7DKZXHGAR5", "Overall": "4.0", "Content": "This is my first medium-plus-sized flat-screen TV purchase (unlike my early-adopter friends, who rushed to spend $4+ figures on the first-generation 720p plasma flat-screens a few years ago, I was content to wait patiently until 1080p became available in the mid-3 figure price range, which is now), and overall I have to say I'm pretty satisfied.As a first-time LCD-TV buyer, I can say little about how the picture quality stacks up against other new LCDs (but friends who know better than I tell me it's \"decent\", if not spectacular); but it is, of course, a big jump up from the CRT I had been watching prior (and for which I paid about the same amount, 15 years ago!).So far, after a couple months of use, I can say:PROs: excellent value for money, decent build quality (no \"dead\" pixels I can see, which I was worried there might be), a great step up from a CRT TV (if you're one of the few people left doing that), pretty good ATSC reception (pulls in some pretty weak TV channels my ATSC converter box generally didn't), good connectivity options (very happy with the 3xHDMI and 2xComponent inputs, but the single Composite video input necessitated a composite input switchbox, which was cheap to add).CONs: No-frills exterior (any finish you like, so long as it's gloss-black plastic), power-on takes a couple of seconds (or maybe, all flat-sceen TVs do?) during which TV briefly makes some odd popping and clicking noises (not loudly, but in a quiet room you do notice), channel memory occasionally \"forgets\" settings (so that channels you wanted skipped, unskip themselves from time to time), IR remote sensor tucked into lower RH corner (so if TV is set in a cabinet, remote is blocked from the entire RH side of the room - unlike TVs with center-placed IR sensors, which can pick up remote commands so long as you can still see the screen), remote codes not well covered by aftermarket remotes (you're fine if you use a \"learning\" aftermarket remote control, but it would have been nice if this brand was popular enough for aftermarket remotes to have its control codes as presets).Overall, if this is not a great TV, it's not a bad one at all; and for someone (like myself) finally upgrading from that old CRT, you really can't beat it's value-for-dollar price at this point (so far as I can tell). So far, I'm a pretty satisfied customer; and odds are if buyers don't expect too much from this TV, I would think most people would be as well.UPDATE: After reading mention from another reviewer here, that ProScan is related to RCA (how exactly, I didn't quite catch), I thought I'd report that some aftermarket universal remotes *can* be programmed to control this TV without having to be \"trained\" to do so, using preset codes for \"RCA\" model TVs. I've discovered this is true, for both Philips and GE universal (NON-\"learning\") remotes. Note that none of the listed \"ProScan\" control codes work, but one or two of the codes under the \"RCA\" brand DO work. So, if you're one of the folks who like consolidating all your devices onto one universal remote for everyday use, I can report this TV can be used with them also, just so long as you try TV control codes for \"RCA\"-brand TVs. I hope someone else out there can use this tip.", "Date": "August 4, 2010"}, {"Title": "Great Product Great Price", "Author": "SM \"DealFinder\"", "ReviewID": "R39ZYGOE3J1HUO", "Overall": "5.0", "Content": "I was very happy when I fired up this TV and saw the resolution.  It is sharp looking and the picture quality is great.  It sounds good.  Great product.", "Date": "March 13, 2010"}, {"Title": "Don't buy 1080p doesn't work.", "Author": "J. Fields", "ReviewID": "R1Z1D918TUDFAK", "Overall": "1.0", "Content": "I purchased this tv June 7, 2010 and received it on June 8, 2010. The box looked like it had been used. I am wondering if these are use sets being sold as new. I connected it to my directv receiver which I already had another 1080p set connected and working. I ran the HDTV setup it came back and said TV is not 1080p compatible but is only 1080i. The picture is fuzzy on most programs. I called Proscan the cs rep told me to contact Amazon if I did not want to send the TV to a repair shop out of state. Amazon only offers a refund because this model is no longer in stock. That sucks. Now I have to send it back for a refund or get a brand new television repaired.", "Date": "June 12, 2010"}, {"Title": "Just DON'T Do IT!", "Author": "Chriss Heart", "ReviewID": "R2DZC8L54IUTHB", "Overall": "1.0", "Content": "I would absolutely LOVE to review this TV!  I couldn't believe the price and immediately placed my order.  This was supposed to be for my son's room and he eagerly watched for the FedEx man.  It was out of the box and hooked up before the guy was back in his truck...and I should have had him wait to take it back with him...before he got to the end of our road we knew that we had received one that would not make it through the \"infancy stage\" as another reviewer put it!  I read all the reviews and kept my fingers crossed that I would get one that would actually turn on - but this was not the case...there was only a blue screen.  The remote did not work either and there was never any volume.  We tried the connections in other rooms with other jacks and replaced the batteries in the remote 3 times...NOTHING!  And to make things worse, Amazon could not replace it because they were out-of-stock, and I had to wait 2 weeks for a refund after packing it all in the box and waiting for an appointment for UPS to pick it up.  Unfortunately there is not anything less than a one-star rating!!!", "Date": "July 12, 2010"}, {"Title": "UPDATED REVIEW: Excellent monitor for the price", "Author": "J. Bradley Hicks", "ReviewID": "R3IXEVXWZD7HZN", "Overall": "5.0", "Content": "I was in the market for a circa-30\" LCD display that could double as a television, and if you've priced things in that size range, you find out quickly that as soon as you go above 27\" diagonal, you're into four figures (at the moment). So you could have knocked me over with a feather when Amazon gold-box specialed this 32\" 1080p monitor with a TV tuner for about one third of the price I was seeing for other 30\" 1080p plain monitors. And I was very pleasantly surprised at how fast Amazon got it to me, considering I took the free shipping option, expecting it to get here within three weeks, only to have it arrive in three days. It is huge for a computer monitor, it is bright, the colors are strong and well-balanced right out of the box, and setup was a breeze. I don't see how anybody can call this a bad monitor, or a bad TV, for the price. And the digital tuner in it is excellent, picking up about a dozen channels that my other TV with a digital tuner, plugged into the same source, couldn't.REVIEW UPDATED WITH NEW INFORMATION, PLEASE READ: This monitor reports its default resolution to Windows as 1440x900, and I previously rated this monitor 3 stars for misleading advertising, especially when at least three tech review sites also agreed that the packaging is misleading. On the contrary, while the monitor is reporting wrong information to Windows, this really is a 1080p monitor, and it really does give near-1080p resolution even in Windows. If you are having trouble getting it to support its full resolution, try this: assuming you have it hooked up to your video card via HDMI or DVI-D, set it down to 16-bit color (and apply changes), then set the size up to 1680x1050 and apply changes, then set the resolution to 59 Hz and apply changes. Now Windows will let you set it to 32-bit color. At 32\" size and 1680x1050 resolution in Windows, and full 1920x1080p for TV and for its component inputs, this TV/monitor is an insanely good bargain at this price.", "Date": "March 20, 2010"}, {"Title": "Good value for the money!", "Author": "AnimalLuVer", "ReviewID": "R11NSHLYNG6B0N", "Overall": "4.0", "Content": "Every reason to buy more of these if you want a really good TV for less money.  The colors are fine  This is a value product, so there are some things you'll have to live with.  Specifically, there is a certain lack of brightness that is bothersome in night scenes and such.  I cannot find any way to correct that in the controls, but it wasn't bad enough to cause me to return the item.  People who have a well-above average EYE for picture should not buy this.  On the other hand, the contrast is probably good because the darks are dark, and that's one of the key criteria in most TV ratings, although not one I care about.", "Date": "June 12, 2011"}, {"Title": "Great HDTV for low price!", "Author": "Joshua", "ReviewID": "R131U4QV4XKBWX", "Overall": "4.0", "Content": "This HDTV does basically everything. Its not the best in class 1080p 32 inch out there but most others will cost you several hundred more for not much of a difference.There is but one flaw with this Tv that I didn't like. It is not Energy Star qualified. Meaning its kinda hot and uses quite a bit of juice.Other than that its perfect.", "Date": "May 31, 2011"}, {"Title": "Proscan great value for price", "Author": "B. Corbin", "ReviewID": "R39REL6BJ9X4OU", "Overall": "5.0", "Content": "Was looking for LCD in that price range since christmas.  Finally popped up in a brand I recognized.  Proscan is made by RCA and I have a 42\" that's been fine for two years.  Supplier delivered quickly and kept me informed.  Easy to assemble and set up.", "Date": "March 25, 2011"}, {"Title": "Proscan 40\" flat screen tv review", "Author": "Barbara Fernandes", "ReviewID": "R3SNIB0DUX9A16", "Overall": "4.0", "Content": "The set was delivered and set up on May 26, 2010.  A little less than 2 weeks later it just turned itself off.  I checked to make sure the cable was working and it was.  Each time I tried to turn it on, the light turned from red to blue and immediately shut off again.  I called Amazon who told me to call Proscan.  I called Proscan and, since I had the set unplugged for a day, was told to reconnect and try again.  It worked.  The tech told me it probably was some dust or something in the outlet.  Unfortunately 10 minutes later it went off. Same thing all over again.I called Proscan back and it was suggested I check the cord that was attached to the set.  It seemed firmly attached to the set, but I pushed it in.  Sure enough the set turned on and it's been working now for 2 days.  Since it took almost 2 weeks to turn itself off, I will wait and see. If it happens again, I will request that it be picked up and a new one delivered. It's so nice having a flat screen TV. What took me so long.By the way, having free delivery, no tax and free hook-up was incredible!Thanks,Barbara Fernandes", "Date": "June 15, 2010"}, {"Title": "Buzzing audio", "Author": "BaHa22", "ReviewID": "R1CIJCI0B7SXZS", "Overall": "3.0", "Content": "Purchased this item from Amazon at a great price. I liked everything about this TV but the audio had a constant buzzing that was louder than the regular ringing in my ears. I removed all audio sources, one by one, but the buzzing persisted. Placing the unit in Mute mode stopped the buzzing and that was OK as I used an external stystem to augment the audio. The problem there was that the mute icon stayed on the screen as another distraction. Unfortunately I can't live with either of these issues. Am returning it to Amazon and would have preferred an exchange, but only a refund was offered as it is listed as out of stock. Too bad as I felt the picture was excellent and the size is perfect for my use. Would have given it 5 stars if the audio acted like it should.", "Date": "June 10, 2010"}, {"Title": "Great TV for the price", "Author": "X. kuang \"JK\"", "ReviewID": "R29IERB95TLD11", "Overall": "5.0", "Content": "Bought this TV for $348 & received in 5 days with free shipping. Surprise to see how good it look in piano black. Picture quality is much better than expected & can't beat the price on this TV.", "Date": "May 2, 2010"}, {"Title": "Great value, HD programming looks GREAT!", "Author": "Heather Migdon \"Heather Migdon\"", "ReviewID": "R9VG8MRMZWBL9", "Overall": "4.0", "Content": "HD programming looks amazing on this television.  I can't believe I got it for less than $350 with free shipping.  TV was delivered about 72 hours after I ordered and was super simple to set up.  I won't give it 5 stars because standard definition programming is a little light/grainy for my taste, but probably only noticeable in comparison to HD programming.Volume is wonderful!  I listen on less than 10% of full volume, and it is plenty, believe me.I couldn't be happier.", "Date": "April 14, 2010"}, {"Title": "Perfect for my bedroom", "Author": "Kevin Burns", "ReviewID": "R39FI6VRM68OB0", "Overall": "4.0", "Content": "First of all, this is the second TV I've purchased from Amazon.com and both times has been great in regards to shipping and packaging.  I ordered this on 3/3/10 and received it the next day for only $3.99 more because I signed up for the Amazon Prime trial membership.  Hard to say if I'll keep Prime but it is worth it if you do a lot of stuff with Amazon (free two-day delivery on anything you buy is pretty sweet).  Anywho, this TV was just what I needed in the bedroom.  I knew I wanted a 32\" LCD and didn't care too much about all the bells and whistles as that's what the Samsung LN52A750 in the living room is all about.  When looking for the most inexpensive 32\" LCD's on Amazon I found this Proscan model.  Not only did it appear to be the cheapest 32\" LCD, it was also 1080p which was icing on the cake.  I pulled the trigger and got the TV the next day at my doorstep.  Any competent person can take the TV out of the box and put it on the stand that comes with it in about 1 minute (there are 4 screws that attach to the base).  I hooked it up and ran a standard-def DirecTV receiver into it and was good to go in a matter of minutes.  The picture on SD through this TV isn't awesome but it isn't the TV's fault.  It's not bad either...the picture was what I expected.  Not to be content, however, I ran in the living room and took the PS3 off the main TV and went HDMI from it into the Proscan.  The first thing I did was pop in the Netflix streaming disc and fire up some LOST (Season 3 Episode 8 to be specific).  The HD picture was very nice!  After watching the entire episode, I played around with some games on the PS3 and they all looked great.  There wasn't any noticable lag while playing, and being a gamer I know how that can be of importance but from my limited gaming so far on this set I'm confident that there won't be anything to worry about.  The sound is OK - again, this isn't my main TV, it's for the bedroom.  I can hear the TV and that's honestly good enough for me.  Another good thing about this TV is the bezel.  I absolutely HATE some of the bezels on the market for some of these LCD's.  I mean, don't they realize people gotta hang this stuff on their walls?  Do you really need an LCD TV bezel that has PANASONIC or SANYO writen in huge white letters across it?  Bleh!  The Proscan is very sleek in it's design IMO.  As just about all LCD's have, this one has the manufacturer's name across the front but it isn't in bold font and doesn't jump out at you every time you walk by it.  So in summary, the picture is good, the sound is fine, the appearance of the TV when off is quite nice.  Overall I'm very pleased to have this in my bedroom and would recommend it to anyone thinking of getting a 32\" LCD.", "Date": "May 5, 2010"}, {"Title": "AWESOME TV!!!", "Author": "Carl W. Taylor \"tv addict\"", "ReviewID": "R2FL1GT4ISE6JJ", "Overall": "5.0", "Content": "My Proscan arrived within two days of ordering it. It is a great tv. The picture is beautiful and the sound is great. I reviewed a lot of tv's and decided on the Proscan and I am happy I did. My husband Carl purchased this for me and I am thankful. I am bedridden with MS and so I watch alot of tv. I love the bigger picture. \"GO! Proscan\"", "Date": "April 29, 2010"}, {"Title": "Nice TV", "Author": "SM \"DealFinder\"", "ReviewID": "R9NF7A3YYW4M8", "Overall": "5.0", "Content": "I was pleasantly surprised by the quality of the TV.  The picture looks great.  Its full 1080p.  The colors and contrast are bright.  I watch a lot of sports and the 6ms response is more than adequate.  It sits in my bedroom and I really enjoy it.", "Date": "March 16, 2010"}, {"Title": "Black in two days", "Author": "Spence", "ReviewID": "R1D0DGMRQ1I94S", "Overall": "1.0", "Content": "I bought this T.V. for a seemingly good deal. We had it for two days and on the third day we went to turn it on and it went black. The manufacture Proscan was good they accepted to take it back and repair it, shipping it both ways. I contacted Amazon and they took it back and credited my account And I didn't have to pay for shipping.Pros: its a good deal and if something does go wrong Amazon and Proscan are good as far as far as customer servicecons: it broke after the 3rd day.The picture wasn't that impressive. I just got a TCL, for allot less and it has a better picture.to sum it up, don't get the TV maybe I got a lemon but... maybe not.", "Date": "November 10, 2010"}, {"Title": "great for the price", "Author": "alexei27 \"...tryin to reason with hurricane s...", "ReviewID": "R270O5DZPJ6QAE", "Overall": "4.0", "Content": "I got this TV on a daily deal for $299, which at the time was the least expensive 32\" 1080 p resolution TV I'd ever seen. I've had it mounted to my bedroom wall for about a month. No problems whatsoever. This is our first HDTV and its stunning!!The TV was easy to set up. We have a small cadre of cables to stream netflix...or use the laptop and all work perfectly.No complaints thus far!!", "Date": "September 22, 2010"}, {"Title": "Good value for the money", "Author": "mrh06827", "ReviewID": "RCP2XA9BQ12JG", "Overall": "4.0", "Content": "I bought this to replace an old 20\" analog set in a spare bedroom.The picture is perfect although I am not using a HD cable box, just a digital converter from the cable company.Volume at 1 is almost too loud for watching after everyone has gone to bed.Glad I bought it.", "Date": "May 19, 2010"}, {"Title": "We're happy!", "Author": "F. McKenna", "ReviewID": "R3DF60PDFD1DVK", "Overall": "5.0", "Content": "Great picture, great sound and just the perfect size!  Easy to set up!  Priced right too!", "Date": "April 22, 2010"}, {"Title": "Awesome TV for its price", "Author": "Heidi Braswell", "ReviewID": "R2KJ11UL1F5XZ6", "Overall": "4.0", "Content": "Tv works really good. The HDMI for game play works really well and looks amazing. Overall nothing bad to say about it.", "Date": "October 14, 2013"}, {"Title": "Proscan makes poor quality TVs", "Author": "Mark Twain", "ReviewID": "R14U46CAMDPDPR", "Overall": "1.0", "Content": "I bought this TV over other brands because amazon had a great deal on it. After 4 months of light TV watching the TV started to turn off on its own. I contacted Proscan and they said that he power board was probably faulty and they mailed me a new power board to have a technician install it. I was lazy and didn't have the board swapped out and after a month the TV just didn't turn on anymore. I called amazon and they shipped a brand new TV in a couple of days with no questions asked which was great. After another 6 months my replacement TV had the same problem and didn't turn on. The problem this time was that it was out of warranty and amazon or Proscan wouldn't fix it at this point. I read online that this was actually a common problem with Proscan because they use cheap parts in their production process. Do yourself a favor and go for a major brand known for better quality.  As for me I went to Costco and bought a TV there because of their no hassle extended warranty.", "Date": "August 22, 2013"}, {"Title": "Fine", "Author": "Charles B. Bowen", "ReviewID": "RCLGUGS3RF0HZ", "Overall": "4.0", "Content": "It was an OK TV.  Plenty high quality for the price.  I used it mostly for an oversized computer monitor.", "Date": "February 13, 2013"}, {"Title": "It has worked great for me", "Author": "Galen", "ReviewID": "RUAJEQFJPFAI5", "Overall": "4.0", "Content": "Seeing that this is a off brand TV i decided to go ahead and take a risk by buying it. i have owned it for about 2 almost 3 years now and so far it has giving me no trouble at all. looking over the reviews many people had trouble with it being defective and needing to return it, this may be a hit or miss situation but all i can say is that the picture is crisp, the sound is nice (although does not go extremely loud), and it had plenty of ports for me to plug a few different things into (i have my computer, cable, ps3, and wii all plugged into it at the same time) i do play video games on it and watch blue ray movies and again have had no trouble.", "Date": "January 7, 2013"}, {"Title": "Completely happy with this TV", "Author": "Don", "ReviewID": "R3BRD30QFIVZ9C", "Overall": "5.0", "Content": "I got this for almost half the retail price on an Amazon Lightning Deal 18 months ago. It's not a big screen as they go, but works well in my viewing space. This model is no longer available, but the brand is; this is my second Proscan TV and I'm a fan. I'm no techie so can't speak about those kinds of details. But I've had no problems, watched a good picture with true 1080p and would buy another Proscan.", "Date": "December 18, 2012"}, {"Title": "please help", "Author": "MIke", "ReviewID": "R1CW310CXWKNPP", "Overall": "4.0", "Content": "I bought this TV a few years ago and it has worked perfect. unfortunately the base stand was accidentally thrown out and I can't find a replacement anywhere. Does anyone know where I can get a replacement base stand for this??", "Date": "November 6, 2012"}, {"Title": "Did Not Last", "Author": "Pd's Review", "ReviewID": "R1WN7EMNBM62RB", "Overall": "2.0", "Content": "After two years and only 50 hours use the main electronics board went out.Looked like a simple color/tint problem that could not be fixed from the picture menu.The ANE company, doing their customer service said it would cost $200.00 to repair.So, no more Proscan.", "Date": "March 5, 2012"}, {"Title": "Gift", "Author": "Robert", "ReviewID": "R2E0GQJQY32K86", "Overall": "4.0", "Content": "Appears to work fine.  UPS tore the box, but everything works. Arrived as scheduled and set-up was easy. Satisfied with order experence and would recommend to friends.", "Date": "December 26, 2011"}, {"Title": "Descent, but not lasting.", "Author": "Maximus Ellis", "ReviewID": "R2XHC3D812Q2JN", "Overall": "3.0", "Content": "I bought this TV last April & it just died. Fortunately Amazon has been very helpful about the return.I gave it three stars because it was a great tv at a great price, & thats pretty much it. it was cheap, so what ever.going to pay a little extra this time.I would stay away from Proscan products.", "Date": "October 29, 2011"}, {"Title": "great tv for price", "Author": "monte91", "ReviewID": "RDPRQBAKUDIQI", "Overall": "5.0", "Content": "ordered this tv at costco when it was on sell for 300$ about a year ago. tv still works great and have no issues at all. only thing is the resolution when hooked up to my pc has trouble displaying older games, but besides that its great. too bad for all these negative reviews on a perfect tv and you can't be the price.", "Date": "July 10, 2011"}, {"Title": "Excellent Buy!", "Author": "Mackenzie", "ReviewID": "R1VL1Y6STQ5GEH", "Overall": "5.0", "Content": "I was wary of buying this television because I'd never heard of Proscan before but the amazing price and great customer feedback won out.  Lucky for me it worked out for the best.  The television took a really long time to arrive (nearly 3 weeks) but when it did I was 100 percent satisfied.  It was easy to set up, easy to navigate through the menu, has great picture quality especially for the price (not as great as a Sony but close), and there have been no technical difficulties.  I'm happy.  The only recommendation I can make is that if you are going to set it up to a receiver, it is best if it is an HD receiver.  You can still use the receiver if it's not HD but you will only be able to run the sound through he receiver and you'll have to run the video through your cable box.  It's not a big deal it just means multiple remotes or a little extra work when using a universal remote.  Of course none of this is my televisions fault, just my outdated home theater system.  I definitely recommend the purchase.**8/11/11 Nearly a year later and we are still very happy with this television!  I still definitely recommend the purchase.", "Date": "August 23, 2010"}, {"Title": "Great TV for the price", "Author": "J. R. Novak", "ReviewID": "R7UMIJC2BKL3W", "Overall": "5.0", "Content": "This TV looks great, and is unbeatable in the price category.  I was skeptical when I bought it for $300 during an Amazon deal-of-the-day giveaway (before even looking at one in person), but I was pleasantly surprised when I first set it up.  The included stand it sets on is very sturdy, to the point where it was near impossible for me to remove it when I was moving locations.The picture quality is good, however the backlight seems to be lackluster when compared to others.  It won't be the brightest TV set you come across, but that might not be a shortcoming as it should ease up on eye strain.  The lack of a DVI port is also worth noting, but VGA adapters are quite cheap (< $1 if you know where to shop) to overcome this.The only other shortcoming this TV has is in its handling of Standard Definition signals.  Colors are very washed, and there is no \"crop\" function for 16:9 letterboxed SD signals (there is a \"zoom\" function, but it seems to overcompensate by 5-10%).  As more and more channels become HD, however, this will become less of an issue.All in all, six months later, I am very happy I purchased this set.", "Date": "January 1, 2011"}, {"Title": "The picture, sound was great but the TV is a Lemon", "Author": "SummerBlnd \"MEM\"", "ReviewID": "R6TRLUP2CWTMP", "Overall": "1.0", "Content": "DO NOT PURCHASE THIS TV - for the 6 months I had it, it was working fine.  Then all of the sudden it shut off on it's own.  Then it shut off entirely.  I brought it to a repair shop, the shop owner said never buy this brand of TV it's a piece of junk!!  So now I'm out of a TV and out of $500 . . .", "Date": "October 27, 2010"}, {"Title": "NOT NATIVE 1080p", "Author": "Doug bob college", "ReviewID": "R2S3CKDTHFXSIR", "Overall": "1.0", "Content": "what else is there to say? its not native 1080p meaning it stretches and contorts pixels to fit the signal into 720p its garbage. works fine at 720p if thats all you care about. higher than 720p output from any computer will show this screen's awful. 1080p from a ps3 seemed to work ok in game, but when i opened the internetbrowser you can see the pixels are all contorted in the text. HDMI vga/dsub dvi none of it will work well over 720p.i saw a review saying ppl cannot tell the difference between 720p and 1080 on such a \"small\" screen but that is boloney, and especially when the tv isnt native 1080.", "Date": "April 10, 2010"}, {"Title": "Great TV for the money", "Author": "HoppyLinda", "ReviewID": "R1CVTL7VZZ17II", "Overall": "4.0", "Content": "I've been using this TV in my bedroom for a couple months and the only thing I can find wrong is the sound could be a little better. Hooking up a couple speakers would solve this. It's a great TV and certainly worth the money. I'm glad I got it.", "Date": "August 22, 2010"}, {"Title": "Not too bad at all.", "Author": "Thoraxes", "ReviewID": "R1H6RTKCY3Y3XG", "Overall": "5.0", "Content": "I was looking for a TV that I could fit within my budget, and boy was I surprised when I found this one.Although I was worried about earlier reviews, my TV came in a perfect condition, the box looked completely unharmed, and I have not had any problems with the television yet. It displays in 1080p like a champ, there's no refreshing audio buffer (which sometimes cuts out sound on cheaper HDTV's, and overall, it's great.Daily uses by me:TVPS3 gamingWii gamingComputer MonitorBlu-ray via HDMI with PS3NetflixIt's a good TV for a good price and it does deliver where it counts. For this price, this television is definitely worth it.", "Date": "July 12, 2010"}, {"Title": "Great buy for $300", "Author": "Kevin", "ReviewID": "R1V2W0RRJYICDW", "Overall": "5.0", "Content": "The picture and sound were far better than I had expected from a $300 1080p TV.  I would definitely buy another.", "Date": "July 11, 2010"}, {"Title": "nice tv", "Author": "David C. Kosec", "ReviewID": "R1SVEISVM9ASLS", "Overall": "5.0", "Content": "nice tv for the money was for a master bedroom and worked out well easy to program and for the money a good value.Would buy another if needed", "Date": "July 11, 2010"}, {"Title": "Amazon's the best.", "Author": "Justin Case \"Frank\"", "ReviewID": "R3TW7T9EMPG7JR", "Overall": "4.0", "Content": "I purchased this item through Amazon's Gold Box one day special the price was great. Unfortunately it arrived with a slight problem, the screen was two different colors, half light half darker. I emailed Amazon. I received immediate notification that email was received. With in a short period of time I received an email from Amazon telling me how to return item. Soon I received another email telling me they had shipped another unit, once it arrived to please return the broken set. Within a few days the new set arrived, it works perfectly. I shipped the other set back, received confirmation from Amazon that they received it, & I will be getting money back on the shipping. Amazon is the best. The Proscan is a great 1080p set. I bought this for xbox gaming and now I find myself plugging it into my laptop, nice monitor. Thank You Amazon!", "Date": "July 10, 2010"}, {"Title": "Great first HDTV", "Author": "Anjanette Reedy", "ReviewID": "R1NBLKEDBVKS0H", "Overall": "4.0", "Content": "I did a lot of research before purchasing this tv.  The reason I picked this one: I'm not really into brand name things, size because a 52in seemed way too big for the room I was going to put it in and I wanted something bigger than 32in and this was the perfect size in between,  1080p, the lighting is great, the contrast is great.  The only thing about this tv is the sound could be better, other than that this tv is great for the price.  I think my next tv will be a 32in and I'll pay the extra price for the LED instead of LCD, which makes the lighting better, not that it isn't but I saw the difference at the store and didn't think I really cared but now I do.  Basically if you get a tv every 10-20yrs like I do than you want the best, pay the extra money for a nice one and the \"bells & wistles\"", "Date": "July 10, 2010"}, {"Title": "1 for 2", "Author": "vajamala", "ReviewID": "R2XXTWHRMVT8SU", "Overall": "3.0", "Content": "Bought two tv's for my beach house based on price and reviews.  The picture seems to be good, but one of the two tv's isn't receptive to the remote.", "Date": "July 9, 2010"}, {"Title": "nice quality at amazoning price!", "Author": "jz", "ReviewID": "R20K9E3LHDIB6E", "Overall": "4.0", "Content": "well i've had the monitor for about a month now. it's used primarily as a computer monitor, and for that it's the best i've seen so far in this price range on sale ~299$. 1080 dpi res realy makes this a great deal. the speakers are loud but not too bassy tho. the picture is clear, sharp and colourful with lots of adjustments and settings. i stream some web videos on it, play some medium def games, and had it connected to digital cable as regular tv and it works just super with great clarity and picture and sound.i'm pleased and happy with the purchase on this sale.best quality and price HD 1080 screen seen to date!recommended!", "Date": "July 9, 2010"}, {"Title": "Excellent TV, fastistic sales price from Amazon.  A winner!  Proscan 32LB45Q", "Author": "Pat", "ReviewID": "RLKC9140OO5N2", "Overall": "5.0", "Content": "I was at first skeptical about the brand - Proscan is not the well known name brand and not sure of the picture and quality.  I usually buy big names electronics like Sony, Panasonic, Sharp, Philips etc.. for their quality and reliability...  But I could not pass up the real good sales price at Amazon and I need a good LCD TV for my bedroom.  I was pleasantly surprised at the superior picture quality and clarity of this Proscan 32-inch LCD-TV.  I write very few reviews but the picture and quality of this TV was so good that I have to write this up.I hooked this TV up in my bed room to the standard cable box in normal 480i and the picture quality is superb, of course not as detail as the 1080i or 1080p you get from blu-ray.  I also hooked this up to another HD cable box and the picture was superior.  I purchased another no-name brand 24-inch LED TV also at 1080p resolution and was very disappointed at the picture quality when I hooked it up to the exact same source.  This smaller TV did not produce a good picture with the regular 480i source and the picture looked like a 3D movie without the 3D glasses, with red and green washed out at both sides of the pictures.  I decided to return that TV.This Proscan TV is absolutely a winner.  With the sales price from Amazon, this is an incredible deal - almost too good to be true - but it is TRUE!  The picture is clear, the color of the skin tone is very natural.  The overall color quality of the picture is very smooth and soothing, not too vivid or strong, just like the natural color.  I am very impressed with this TV.  I compared this TV to the picture quality of my main big LCD-TV (Sharp Aquous) and found little difference in the color and quality of the picture.  The sound was good and loud. The earphone volume was a bit weak and I have to turn it all the way up even when it was connected to the external PC speakers.  I wish there were RCA type audio output but this is minor compared to the wonderful quality of the color and picture quality.  2 HDMI inputs are a plus and this is 1080p.  Everything worked.  I did not experience any of the shortcomings stated in other reviews.  In fact, I do not find anything bad about this TV except the weak headphone audio output.  Most of the 32-inch TVs are at 780p but this Proscan is at 1080p.  The blu-ray picture at 1080p was absolutely stunning.  Excellent buy and Amazon shipped it with free super-saving to arrive in just two days!  Can't beat this.  Excellent TV, excellent Amazon service!", "Date": "June 13, 2010"}, {"Title": "Pleased with this TV.", "Author": "L. Y. Smith \"close account\"", "ReviewID": "R1P12ICDKLK7JH", "Overall": "4.0", "Content": "Not familiar with Proscan brand, but I'm happy with this product. The special price was great, especially for a 32\" LCD HDTV with 1080p. The setup was easy and the picture is really good. The only negative is changing channels hesitates too long. I definitely recommend this product.", "Date": "May 22, 2010"}, {"Title": "great tv for the price", "Author": "M. Marsh \"M. Marsh\"", "ReviewID": "R3ZHM5ISEDMEL", "Overall": "5.0", "Content": "I was looking for a 32 inch tv for our bedroom and looked at numerous tvs and reviews. I wasn't sure about buying a brand that is not well known and was worried that the price of this tv meant poor picture qaulity. After looking at the reviews on amazon and a few other sites, I decided to purchase this tv. It arrived quickly, in good shape, and was easy to get up and going. The picture looks great at the distance from the bed to the tv stand. If you get too close, or too far away, it appears a bit \"grainy\" but 10-15 feet is just right. I have had this tv for about a month and so far, no problems with powering on and off or anything else. Very happy with the purchase!", "Date": "April 19, 2010"}, {"Title": "Nice 1080p TV but...", "Author": "Kenneth Parker \"The Computer Nerd\"", "ReviewID": "R1SO256SR4E0VT", "Overall": "4.0", "Content": "THIS TV DOES NOT CONTAIN A TV TUNER. TO WATCH OVER THE AIR TV (FROM ANTENNA) YOU WILL NEED TO HAVE A CONVERTER BOX.Things you don't need 1080p for:1. Sattelite / Cable / TV2. Game Consoles1. Satelite/Cable/TV doesn't not even stream 1080p content. The maximum content produced for TV programs is 1080i which is a little worse than 720p. YOU WILL NOT SEE A DIFFERENCE IN QUALITY.2. 1080p isn't needed  for  PS3/Xbox 360/Wii on ANY TV. 98% of all the games only use 720p. The Xbox will let you select 1080p but the actual game will run in 720p upconverted to 1080p (so you don't see black bars). The reason is the hardware is very old and the games can't run smoothly at 1080p (they developers don't even design the game to be 1080p).Things you need 1080p for:1. Bluray Movies2. Netflix (or any other 1080p streaming site).3. Future Proofing1. Bluray movies are mostly made to be 1080p. You will notice a big change in qaulity on a 1080p movie vs. 720p. HIGHLY RECOMMENDED.2. Netflix and a few other sites have lots of movies that will stream in 1080p HD.3. 1080p will become used in everything, even TV / Games, in the short future (2013-2014). Future proofing is never bad.See what you need the most and decide if this TV is right for you. 720p TVs generally cost less than 1080p ones.The ProScan name is owned by RCA.[...]This is an RCA TV.", "Date": "April 7, 2010"}, {"Title": "Finally found the right TV for the Living Room", "Author": "CDL", "ReviewID": "R56IYXM358QZZ", "Overall": "5.0", "Content": "After searching endlessly for the perfect TV for a newly decorated living room, I ran across the Procscan 40 in. on Amazon.  The price was great compared to other sites.  The TV is just the right size for the living room, not too big/not too small.  I didn't use the stand that came with it but it fit nicely into the swivel stand I had.  I would recommend the TV to others.", "Date": "March 28, 2010"}, {"Title": "an excellent tv for the money", "Author": "Island boy \"Ronnie\"", "ReviewID": "R14PKRGZ418869", "Overall": "5.0", "Content": "Overall, very happy with the purchase... especially for the money. Ridiculous value. Only negative was the sound, you'll definitely have to get additional audio equipment but it's worth it. Good times after getting different speakers.", "Date": "March 24, 2010"}, {"Title": "NO customer service even while under warranty", "Author": "Rhonda", "ReviewID": "R2BM1XGJ0NKYEF", "Overall": "1.0", "Content": "I purchased a  40 inch Proscan TV from Walmart.com , June 6, 2010.This was my first flatscreen tv.  Within 2 months the TV started giving me problems. By the first of October it would not turn on.I have a year warranty.A call to Proscan sent me to Sears repair service. A repair man came right out and told me the problem would be fixed within 2 weeks.It is now Jan. 28 and I still have a broken TV. I have made numerous calls.. went to walmart .. tried everything I know to get my TV fixed or replaced.NOTHING.I am very disappointed with the way this has been handled.As a single mom on a very limited budget, I can not go out and purchase a new TV.I had faith in RCA (manufacturers of ProScan) I trusted Walmart.I have 3 phone numbers and when you call one.. they tell you to call the other.I just do not get it.Proscan 858.546.4448Sears Repair  888.977.6722number the actual repair person gave me to call 1.800.469.4663I have no idea where to go from here, therefore I will email everyone I can find and post on complaint boards until someone can help meSuperbowl Sunday is right around the corner.Rhonda Williams", "Date": "January 28, 2011"}, {"Title": "WTF!", "Author": "Lynette D. Linder", "ReviewID": "R2IKVYNH8UOJPH", "Overall": "1.0", "Content": "I just purchase this T.V 9 days ago and guess what!... Its not turning back on... I unpluged it and pluged it back in... Thinking maybe it got over heated or something... Its been two hours now and still nothing. I missed my favorite show \"JUDGE MATHIS\" and now im really pissed... I hate this T.V. I did get warning signs a couple days ago when I was playing my PS3... The screen was keep going black... Its a great price, picture is awesome with a HDMI cord and sound is alright. But the problems isnt worth it. Now I have to spend a extra $200 on a name brand T.V. Ill probably try the toshiba or samsung.., Thanks for reading because this is a WARNING!", "Date": "March 12, 2010"}, {"Title": "Worth the sale price of $399.00", "Author": "Melvin Hopkins \"Melvyn\"", "ReviewID": "RDIE6PYUL8B71", "Overall": "3.0", "Content": "This monitor is a great deal at $399.00.  The picture and features aren't amazing, but definately works well for a monitor or bedroom television.", "Date": "July 13, 2010"}, {"Title": "Proscan 40\" hdtv", "Author": "marann", "ReviewID": "R1IL2M9ZZ72BOF", "Overall": "5.0", "Content": "I am extemely pleased with my purchase.. The TV arrived as promised and although the box was in bad shape the TV was perfect..", "Date": "June 30, 2010"}, {"Title": "Good entry level TV, great price", "Author": "Pohemi", "ReviewID": "R1P4OMLBF2O7BG", "Overall": "4.0", "Content": "Works great at full 1080p with my PS3 hooked up by HDMI, but does not like running at 1080p coming through HDMI from my PC. Also consistently sets itself to 59hz when running from PC. Native resolution is 1440x900 (720p) so not the greatest display for hooking up to your PC (but still looks good at 1680x1050). Works great for anything else, I have an amplified over-the-air antenna connected, tuner works great. My biggest complaint is the software/firmware/onboard menu (or lack there-of). Basic settings options for display, no fine tuning though. Also...only headphone and digital coax out...could have used a set of rca out for simple sound...had to use headphone jack since my coax and optical channels are all occupied on my receiver. Oh well. Overall, a good TV at a fantastic price (three hundred shipped during a one day only deal at Amazon). Can't go wrong for 32 inches of 1080p at that price!", "Date": "June 23, 2010"}, {"Title": "One heck of a HDTV for the money.", "Author": "Diablo2k", "ReviewID": "R1ODQ048BAMWRN", "Overall": "4.0", "Content": "This is my initial opinions on the HDTV, I have had it for one day now. After Turning it on my first thought was, \"This is one big monitor\". My previous was a 32\" 720p Insignia. The sound quality was a little disappointing. Theres just no bass what so ever. I plan on getting a speaker bar for this TV. Maybe the PYLE 6-Way 300 Watt Multi-Source Wall Mounted Sound Bar - PSBM200Picture quality also was a little disappointing at first, problem is my cable's DVR only outputs 1080i/720p so I downloaded some uncompressed 1080p videos and was really amazed at the picture quality. Can't wait to get a PS3 and watch Avatar in 1080p.For what I paid for this TV I am really happy so far. I did get a SquareTrade Warranty as some reviews lead me to believe this TV isn't the most reliable, we will have to see. Only reason I am giving this 4 stars is the lower than expected sound quality, wish I could give this 4.5 stars so 4 will have to do.One thing important to note is that the pic above of the inputs is not accurate. All the inputs are in the back, there is no side inputs. you have the same number of inputs but there in a different layout.", "Date": "June 19, 2010"}, {"Title": "tv", "Author": "Kenneth M. Smith \"mike\"", "ReviewID": "R1GP1YODGCA7AL", "Overall": "4.0", "Content": "Best value for the money Picture clean and sharp.  priced below even the big box stores", "Date": "May 3, 2010"}, {"Title": "Proscan", "Author": "C. brown", "ReviewID": "R2S5W79087H19T", "Overall": "4.0", "Content": "The tv plays great,but putting the tv on the stand..... it just wont go. The directions are vague and the stand will not fit into the tv. But it is a great buy", "Date": "April 14, 2010"}, {"Title": "Great working Bargain", "Author": "Joseph Hayes", "ReviewID": "R37WU8G31SZPOZ", "Overall": "3.0", "Content": "Arrived earlier than promissed. Works great. All features as described. A bargain compared to other sources (Costco, Walmart, etc)", "Date": "May 16, 2010"}, {"Title": "great deal and buy", "Author": "Theresa Demartini", "ReviewID": "R10OQKIWU2EXK5", "Overall": "5.0", "Content": "this was a great dreal on this size LCD tv set and makes a nice second set for a second setaway from the livingroom/family room.", "Date": "April 29, 2010"}, {"Title": "This TV is awful!!!", "Author": "Nick", "ReviewID": "R7AST8LJ04Q6O", "Overall": "1.0", "Content": "Don't waste your time with this TV.  I bought it because the price was too good to pass up for a 1080p 32\" HDTV, but I was sorely disappointed when I plugged it in.  Maybe I got a lemon, but it the picture was busted.  There was an image, but it was like you were looking through thermal imaging goggles, except that everything was blue and green.  It's hard to describe, but just know that it was unwatchable.  Thinking the problem may be my receiver, I tried another receiver and my Xbox, all with the same crazy picture.Needless to say, I returned this the same day I got it.  Don't waste your time.", "Date": "July 12, 2010"}, {"Title": "works great", "Author": "Jeff", "ReviewID": "R1AKYRVA5GI86M", "Overall": "5.0", "Content": "I bought this TV for my mother. Open up the box, plug it in, and the picture is there!Picture quality looks good. Sound is really loud, a little bit too loud actually. Viewing angle is good, no complain there.Not sure about the tuner since we use Dish.", "Date": "May 7, 2010"}, {"Title": "Surprised", "Author": "Michael Dowdle", "ReviewID": "RYO778TV6TKQU", "Overall": "5.0", "Content": "Wow what a value,  great picture,  easy set up,  All this for $100.00 less than Vizio.", "Date": "May 6, 2010"}, {"Title": "good job", "Author": "P. anderson \"blackknight\"", "ReviewID": "R2GA2FWC040OAB", "Overall": "5.0", "Content": "I received the tv on time and it was just what i researched and expected good job", "Date": "March 25, 2010"}, {"Title": "HORRIBLE!!!!!! DO NOT PURCHASE!!!!!!!!!!!", "Author": "Amanda", "ReviewID": "R3JG6T8POFJ3L2", "Overall": "1.0", "Content": "This was the WORST investment I could have made! I should have just been willing to spend a little more money for quality.  My tv wasn't even a year old yet.  It took THREE weeks for someone to come out and even look at it and they just told me it would have to be replaced, no parts could fix it.  Then to add injury to insult, had to be passed around from every number and get very little help with Customer Service, if you would call it that.  I DO NOT recommend Proscan to anyone! Save a little more money and invest in the well known brands, I have learned that valuable lesson! BOO Proscan!", "Date": "February 2, 2011"}, {"Title": "happy but1 issue", "Author": "William Marker \"Bill\"", "ReviewID": "R1CO9PSYY8QEXK", "Overall": "4.0", "Content": "Great TV for the money. the only feature I do not like is you cannot mute the headphones with the mute button.", "Date": "June 5, 2010"}, {"Title": "WORST!", "Author": "E. Volltrauer \"urekab\"", "ReviewID": "R1FEGY2JQHAT2L", "Overall": "1.0", "Content": "I did not want to even give this one star, but you have to put a rating. If they had negative ratings I would give it a negative 5! I got this tv on sale and was so excited, but when it got here the inside of the screen was cracked like crazy. When I called to get a new one they would only offer me a refund and not a new tv for the sale price I had paid. Now no tv I can offered. Thanks a lot! WORST SUPPLIER EVER!", "Date": "June 11, 2010"}, {"Title": "Proscan 1080p 60Hrz", "Author": "Timothy J. Varhol \"Tim Varhol\"", "ReviewID": "R28C8B14VZCS49", "Overall": "4.0", "Content": "Cheap price when I bought it but wish it was a 120Hrz instead of 60 refresh rate or motion. Works good with my up conversion DVD 1080p though just not normal tv I think.", "Date": "May 17, 2010"}, {"Title": "david", "Author": "Charles Dalton", "ReviewID": "R2DLH7F6QA1L0M", "Overall": "5.0", "Content": "works good just plug in and turn on.Picture quality very good40 inch hdtv, good price, flatscreen, hdtv, 1080p, lcd, 40 inch,", "Date": "April 19, 2010"}, {"Title": "Birthday Gift", "Author": "Scarlette Benzkofer", "ReviewID": "R3FD3FUTBQ65SG", "Overall": "3.0", "Content": "This purchase was a gift for my son. He did have some problems with the set up. Not sure about anything else", "Date": "July 9, 2010"}, {"Title": "wdelmo", "Author": "William H. Delmonaco", "ReviewID": "R3LG3Q2DBAROS8", "Overall": "5.0", "Content": "Dear amazon very pleased with all the ratings and then some.Tho had I known the price would be reduced by #50.00 one month after my purchase I would have waited to make my purchase. Being only one  month and being a come back customer it would be a nice gesture on amazon's part for a credit of $50.00 for further  purchases.  Thank You William H. Delmonaco", "Date": "June 24, 2010"}, {"Title": "The worst TV I have ever purchased. Spend a little more and get a good TV.", "Author": "R. Soto \"sflamrbuyer\"", "ReviewID": "R185Z5EJN7AL8O", "Overall": "1.0", "Content": "Spend a little more time and money and get a good TV. The worst purchased I ever made. Picture is crapy as well as the sound.", "Date": "June 7, 2010"}, {"Title": "Updated review...", "Author": "A Professional Consumer", "ReviewID": "R2I7A757MAQVCE", "Overall": "5.0", "Content": "Update: I did finally receive this TV, and it is a great TV for the price. For any price as far as that goes. Great color, good sound, handy connection locations. I would highly recommend it, just be aware it is NOT 2-day shipping.When I finally receive this TV, I will review it. But, for those who have not purchased it yet, BEWARE: the \"2-day shipping via UPS or Fed Ex\" is dead wrong. I ordered thinking I would have it in 2 days. When I didn't, I contacted Amazon and they said \"Oh, well for big items it isn't 2day shipping\". I asked why their website said it was 2-day (even with a 1-day option). They didn't really say, but refunded me some money (not sure how they determined the amount; maybe they have a pain and suffering factor), and said these always ship via special carrier. I asked them to change the web page, but it has been 5 days and it still says 2-day. MEANWHILE, I finally got a call from the trucking service and they will deliver it a mere 13 days after I ordered it. The shipment originated about 250 miles from where I live. I should have driven over to get it.", "Date": "February 24, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Tuner Mode : ATSC\n2 HDMI andf 1080P\nResolution: 1920 x1080 - Contrast: 1300:1 - Brightness: 500cd/m\nResponse Time : 6ms - Digital 3D Comb Filter - Noise Reduction\nComponent, VGA, S-Video, AV input", "Name": "Proscan 32LB45Q 32-Inch 1080p LCD HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51jxNN20iuL._SX300_.jpg", "ProductID": "B002YT8CKA"}}