{"Reviews": [{"Title": "Great picture, Not enough connections", "Author": "Mr. Efficiency", "ReviewID": "R6AV4TNNS751E", "Overall": "4.0", "Content": "I'm only going to comment on the rear connections. Only one set of component in, which is fine because anyone who wants to use this great TV, should have updated equipment. But my cablebox ONLY has component, so I can't use any other outdated systems...everything else must be HDMI to take advantage of TV. Since this is a bedroom tv, not a big deal.Next...audio quality is poor. Which is fine because most ppl who have a nice TV will support it with extra speakers. I bought the TVee Soundbar because it's simple and doesn't need a receiver. Well...the TV only has ONE audio out. and it's a digital (Toslink) audio out. Website says TWO audio out. I guess they're counting the headphone jack. Looks like panasonic got a little lazy and didn't bother to include support for older devices. Now I'm up a creek because I'll either need to buy a toslink to rca converter or take the dive and get a receiver....but who the heck has a receiver in the bedroom?!", "Date": "March 29, 2010"}, {"Title": "Gamer still happy after 2 years", "Author": "A. Nelson", "ReviewID": "R1B2HV9SRZ1DUV", "Overall": "5.0", "Content": "This is a review for model # L42U12. Got this TV when we moved into our new place 2 years ago, and am still happy with the purchase! At the time, it was on sale for $799. I'm a gamer, so I've not only got HD cable, but also a Wii, PS3, Xbox360, and PS2 hooked up to this bad boy.Set-up and Appearance:Took practically no time at all to set up--basically plug and play. Make sure your TV stand is at the height you want the TV to sit, though, because you can't adjust the height with the components that come in the box!Inputs:LOVE the inputs on this TV. I'm using 3 HDMI (Cable, Xbox360, and PS3/Macbook), 2 Composite A/V (PS2 and Macbook), and a Component (Wii) inputs without any problems, and there's also S-Video and PC inputs that I'm not using. It's easy enough to change between inputs using the \"Input\" button on the remote, and you can name the inputs on the menu screen so you don't have to remember which is which. Also, I can screen share with my Macbook even though I have to output the video and audio separately. This TV is great--I can tell the TV to pull video from HDMI 3 and audio from Video 2. No joke! (Go to Menu > Audio > Advanced audio, and you can tell it to pull audio from a source other than where the video's coming from).Picture:The colors are amazing and the blacks are nice and deep. After gaming on this thing for 2 years, I'm still not noticing any ghosts (ie, screen burn) or color variations. Games have HUD-type elements that stay frozen on the screen for hours at a time, so this was a concern of mine.Audio:My one gripe: the bass is terrible. Have changed the settings to -8 because it rattles and hums and generally sounds awful. Probably need to set up an exterior sound system, but it's only really a problem when watching movies.To sum up, this TV is a gamer's dream, and I would be happy to purchase another Panasonic Viera in the future.", "Date": "August 1, 2011"}, {"Title": "Excellent buy", "Author": "JS", "ReviewID": "R8C3JXZJSNAYN", "Overall": "5.0", "Content": "Wow... That is all I need to say about this television. For the price its a really good buy.Picture- I use my TV to play PS3, Xbox and watch movies (HD and SD) and I gotta admit, it blows some of the Sony TV's out of the water! Really good picture.Sound- The sound is actually pretty good if you have the right setup. At first, without tinkering in the settings, it will definitively sound bland. But if you setup the sound with the built in equalizer, then it really starts to sound great, especially with PS3 games, AMAZING! Although, I do recommend buying a small sound system for watching movies, gives you a better feel.Appearance/Construction- Whats wrong with it?? Its not too heavy, it fits anywhere and it looks great. Done deal. Very solid.I paid 800$ new for this bad boy and am never going back to any other brand except Panasonic. It really was worth the cash!", "Date": "February 24, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Panasonic VIERA / 42\" Class / 1080p / 60Hz / LCD HDTV Motion Focus Technology with subpixel control\nMotion Focus Technology with subpixel control 178° viewing angles\n20W 2-speaker system Ultraslim design measures 4-2/5\" deep Secure Digital memory card slot\nBuilt-in HDTV tuner inputs Include 3 HDMI (1 side, 2 rear), 1 S-video (side)\nTrilingual (English, French and Spanish) on-screen menus ENERGY STAR qualified", "Name": "Samsung TCL42U12 Pana Tcl42u12 42 Inch 1080p", "ImgURL": "http://ecx.images-amazon.com/images/I/41zl0SeVUtL._SY300_.jpg", "ProductID": "B002HUQBY0"}}