{"Reviews": [{"Title": "Does not disappoint", "Author": "Jordan", "ReviewID": "R1FIL8KAEULMFQ", "Overall": "5.0", "Content": "Got this as my main Christmas present and frankly, the performance was exceptional straight out of the box. I'm using HDMI cables with all my stuff, so that may contribute to the wonderful display, but even on its own, this device has done nothing but impress me. Set up was very simple, taking less than 6 minutes to get it all set up on my dresser. The colors are vivid and the lines are clear and the remote that came with it really adds to the experience. Living in a college dorm, space is a significant constraint, but not with Vizio. Thanks to their super-thin screen, I was able to fit in on top of my dresser, getting around the other clutter that had made the space previously unusable. By far, the best Christmas present I have ever gotten, I plan to have many more happy years with this TV in college and beyond.", "Date": "January 26, 2011"}, {"Title": "Great value!", "Author": "J. Stephan", "ReviewID": "RTLYRZ074G4YS", "Overall": "5.0", "Content": "Picked this up at Cosco's for a total of $463.00 and can not believe the value!  The Vizio M320VT LED LCD HDTV really exceeded my expectations.  I have no opinion regarding the audio capabilities of this TV as it's being run silent (audio taken care of in 7.1).  The picture however is fantastic-", "Date": "December 18, 2010"}, {"Title": "Convienient", "Author": "Drewphonix", "ReviewID": "R22UHL9AOQR9W6", "Overall": "5.0", "Content": "This TV is better than I expected. Not only is it easy to set up and hook up to your home theater, but the image is super crisp. It took me a whole 5 minutes to set it up. Plus it has many features that make this item an even better purchase. (Just read the description.). I'm happy!", "Date": "October 15, 2010"}, {"Title": "Great!", "Author": "Justin", "ReviewID": "R1CKD29GRT0OU4", "Overall": "5.0", "Content": "Let me start out by saying thia is an awesome TV. I bought 2 at Costco for $399 each. The box, manual and Vizio support says 100000:1 Dynamic Contrast ratio not the 50000:1 listed. The picture is super nice. I would reccomend this TV to anyone looking to buy.", "Date": "December 28, 2010"}, {"Title": "Vizio has poor sound.", "Author": "noname", "ReviewID": "RM397UOO1VLVI", "Overall": "3.0", "Content": "We purchased this Vizio TV from Amazon and have had sound problems right from the beginning.  Vizio has been very responsive but the problem is still not solved.  Sometimes the sound will go out and we have to turn the TV on and off or toggle channels to get it back.  The TV also resets on occasion, of course only when something important is happening with the scene you're watching and you loose the TV for 20 - 30 seconds till it comes back on.Vizio has sent a rom update and then sent a technician to replace the main board.  At this point, the problem is still not solved and we don't know what the next step is.", "Date": "July 26, 2011"}, {"Title": "Amazing picture!!!", "Author": "Nathan Tothero", "ReviewID": "R32T81WYT44TIF", "Overall": "4.0", "Content": "This TV is amazing for the price the picture is absolutely gorgeous and the ease of use is phenomenal. Just hook up and go.But the sound quality is really poor. It's loud don't get me wrong but with everything I play or watch it tends to bring out the background noises and drowns out the voices of the characters.PROS**Great pictureGreat priceEasy to use and set upReally light and thinCONS**Really poor soundNot as many outputs as i would've likesNote** I recommend getting the model VSB200 sound bar for this television because it has the fiber optic input you need for it to work. STAY AWAY from the model VSB205, it wont work with this television.", "Date": "July 27, 2011"}, {"Title": "Vizio M320VT", "Author": "nottoold", "ReviewID": "RRP5GOYCJQ5RI", "Overall": "4.0", "Content": "Being very much a Sony person when it comes to electronics, it was difficult for me to move to the Vizio brand. What moved me was the amazing picture quality that this set provides and the recommendation of family members.It was easy to set up, just plug and play. I found that the ambient light sensor did not work well in that each time the scene changed, the TV would almost flicker for a second. I turned that off and it was great. It has a few factory settings you can choose from, I like the \"movie\" setting which seems to have the best mix of lights, dark's, and contarst. The quality of the picture almost exceeds my Sony with a Bravia 3 engine.I had to fiddle with the sound settings quite a bit before I found a setting that pleased my ears. I'm still not too thrilled about the quality of the sound, but for a bedroom TV, it's adequate. Also turned off the SRS True Volume as that seemed to make the sound change with each scene change.All in all if you would like an amazing picture with adequate sound with HD 1080 for under $450, this would be a set to consider.", "Date": "March 16, 2011"}, {"Title": "Perfect", "Author": "Caladius", "ReviewID": "R1G2WM3B2G3BRU", "Overall": "5.0", "Content": "Ok so i purchased this from tigerdirect refurbished for $299. Amazing prize for what ive seen elsewhere new. It got to my house and i set it up, I am using this as a computer monitor and immediately noticed the ms lag between my mouse movements. After further tweaking with the settings menu I found out that you need to set the picture mode to \"Game\" that unlocked a hidden option in the advanced menu for \"Fast Response\" which drastically reduce this lag to nothing. I am 100% happy with this purchase and think it is a good buy for those looking for a main tv, pc monitor, or a secondary tv for when you have friends over who bring their consoles with them for gaming.Pros:sleek designeasy set up1080p4 hdmi inputsCons:menu instructions not very helpfulSound quality deters from higher end tvs (to be expected, I just use computer speakers)", "Date": "January 6, 2012"}, {"Title": "New Vizio HD TV..A Winner", "Author": "Carole Williamson", "ReviewID": "R2LUCWDUUVO4IG", "Overall": "5.0", "Content": "We had a larger Vizio HD TV in our bedroom and have loved it! It was a natural thing to purchase the same brandwhen it came time to replace our old TV in our living room. Again we have a winner! The golf and other sports thatwe watch are particularly clear and colorful. It was easy to set up....I re-connected it myself(73 yr. old woman) with an HD cableafter the cable man left! I have called Vizio twice now to ask how to connect my VCR and then my new DVD...they have been VERY helpful, hanging with me until we were operative. Quality, friendly tech service is a big draw for us.", "Date": "May 31, 2011"}, {"Title": "NIIICCCEEE!!!", "Author": "kgirl", "ReviewID": "R2TV4IPEUDICTM", "Overall": "4.0", "Content": "Bought at Cosco last night.  Great picture and not having a problem with any of the negative (what few there was listed in the overall reviews) reviews posted by others.  I have found this unit easy to set up and enjoying the easy to navigate extra options for the tv settings.  I did turn off the light sensor as that was bothering myself and my husband.  Looking forward to using this in our bedroom for many years to come.  This is our second Vizio. Our first is in the living room and it's about 4 years old.  No problems with it.", "Date": "December 7, 2011"}, {"Title": "I love it! Works amazing with xbox!", "Author": "Anthony", "ReviewID": "R42O0M568AYJM", "Overall": "5.0", "Content": "I dont know why people are complaing about the sound on this tv.....its perfecly fine....this is my third day with the tv and no problems at all....the price of this tv is amazing.....if your looking for a good bedroom tv i would defintly go with this", "Date": "September 17, 2011"}, {"Title": "Visio flatscreen  very good value for money.", "Author": "Tina", "ReviewID": "R1L04KVLDZ82FX", "Overall": "4.0", "Content": "I am pleased with my purchase.  I consider this television a very good value for money.  The item was delivered on time and shipped to Jamaica within one week of my order being placed.  The installation was easy and I have no problem so far.", "Date": "August 10, 2011"}, {"Title": "VIZIO M320VT", "Author": "C. Buckley", "ReviewID": "R2X6ISDGYHAJS7", "Overall": "5.0", "Content": "Got this TV to go in my bedroom and I am very impressed with it.  The menus are easy to navigate and use.  The picture quality is great.  The TV is very light and super thin too.  Excellent buy!", "Date": "July 28, 2011"}, {"Title": "Great picture and enough HDMI connections", "Author": "Damien", "ReviewID": "R3R2EN96T6US07", "Overall": "5.0", "Content": "First TV sent did not work, amazon replaced it with no hassle and fast. sometimes its a hit and miss with buying tvs, its life.TV has 4 HDMI which is good if your have alot of things that use that type of connection, for me its Directv,ps3, and Computer.It has a audio optical out connection that works for each input connection so you can connect it to a receiver for 5,1 Dolby digital surround sound.Remote is universal so it can control other devices.I bought this tv as a replacement to an 5 year old Vizio 720p tv. and I enjoy this new tv very much, nice clear picture", "Date": "July 1, 2011"}, {"Title": "wonderful tv", "Author": "Sherrie M. Ferguson", "ReviewID": "R3GBVWM81VEHC7", "Overall": "5.0", "Content": "I bought this TV for my 9 year old grandson. The graphics on this are so clear when he plays his xbox. The TV is so thin and light weight. We are so happy with everything about it. I'm so happy I went with the led lcd 1080 32 inch hdtv.", "Date": "December 29, 2010"}, {"Title": "Fantastic Picture ... Decent Sound ... Great for PC Monitor ...", "Author": "Steffan Piper", "ReviewID": "RKAI996OCPTWG", "Overall": "4.0", "Content": "I purchased this with the specific intent of using it primarily for my PC monitor in my office, which is a 18 by 20 foot room. I also have it hooked up to a Blu-Ray DVD player for whenever I choose to switch over and watch something other than the internet.The image is stunning at 1080p and gives incredibly sharp images with full color and absolutely no 'ghosting' or pixelation. Some people do not care for the imaging that 1080p gives Hi-Definition footage, rendering a partial 3D effect, but you can make very quick adjustments in the settings as the menu is actually very easy to navigate and scale it back.Using it as a PC Monitor though is the perfect size at 32\" and crystal clear. The only piece of advice I can give about using this as a PC Monitor is to make sure you have an adequate video card.The sound issue though that people are concerned about while using it as a standalone device does leave something to be desired. There are presets though that can be fooled with and used that will give you a better sound. The sound out-of-the-box though is probably the first thing you'll mess with, but I wouldn't call it a deal breaker.", "Date": "February 16, 2011"}, {"Title": "Won't break the bank, but it won't blow you away, either", "Author": "Tommy M.", "ReviewID": "R3TEIL848RHUTP", "Overall": "3.0", "Content": "UPDATE 4/11/11: I have returned this TV to Costco. The blotchiness on the edges --likely faulty LED components-- became too distracting; the defect appeared to be getting worse, in fact. One of the people at the return counter gave us a curious sidelong glance, in a way that indicated to me that this was not an infrequent occurrence. Additionally, Costco did not have this unit in stock, either there or at two nearby stores. So either they were sold out, or Costco has stopped buying them from Vizio. Only one 32\" LED TV was available, in fact: a Sony Bravia for about $500. Costco still had a variety of Vizios of other screen sizes.My previous score for this TV was 4 stars.Original review follows below:Note: I am not an HDTV expert; this is the first one I have ever personally owned. My unit is connected to over-the-air (OTA) broadcasts via coaxial, an Xbox 360 via component, and a Roku HD (720p, older model) via HDMI. I do not have cable or satellite TV, and I have not tried to connect my computer to this unit via the DVI port.Setup is quite straightforward. Simply plug it in, turn it on, and tell it if you want to watch TV via the coax, HDMI, or DVI. Batteries are included for the remote. I did not have to consult the manual to figure out how to set up the TV; the on-screen instructions were simple.I've had this unit for a couple weeks now, and I've been satisfied by the overall image quality, aside from some whitish blotchiness on the edges when the signal is \"letterboxed,\" leaving black bars on the top and bottom. When watching OTA, there is occasionally some slight but noticeable pixelization when images transition rapidly, although these are probably artifacts within the signal itself; it never happens when I'm playing a 360 game.Physical connections are easy to reach, and the side of the unit has buttons to adjust all functions, in case you misplace your remote, or its batteries die. The side opposite the controls has several HDMI ports, and a USB port to view images or listen to music (this unit does not support video via USB). I can also confirm that the component inputs -- located on the back -- will accept 1080p (many older HDTVs are restricted to 1080i through this connection).The remote itself looks and feels a little cheap, and its glossy surface is easily smudged. But the buttons are firm, unlike the squishy kind seen in earlier Visio remotes (my parents own two Visios: a 55-inch LED-lit model, and a 24-inch non-LED). The unit also takes a good ten seconds to turn on. Changing channels is also pretty sluggish. Scanning for over-the-air broadcast channels is also quite slow, even by basic HDTV standards, but you shouldn't need to do that very often.Controls to adjust picture quality are quite extensive and fairly self-explanatory. Some controls, however, will require consulting the manual, as the informational text can be ambiguous. There is only one \"custom\" preset, but that's common even on high-end units. The other built-in presets offer a variety of noticeably different settings for given circumstances, such as sports, movies, and console gaming. I didn't notice much lag when playing video games. When you choose the gaming preset, there is a \"gaming mode\" option that allegedly reduces latency, but I didn't notice much difference. I do recommend keeping noise reduction set to \"high\" if you watch OTA television.The speakers are quite underwhelming, but this is to be expected in a unit with so little physical depth. The \"Flat\" default preset is particularly weak; I recommend using the \"Rock\" preset to add some much-needed low-end response. But an external audio system, even a cheap one, would probably be better than the speakers on this unit. I was unimpressed by its virtual surround sound and other audio tweaks and have left them disabled. There's one setting that is supposed to keep the audio level consistent so that commercial breaks are not loud, but it didn't seem to do anything. In fact, with this setting enabled, the sound levels scaled around erratically, regardless of what was being broadcast.It's a decent unit for the cost. It does not have Ethernet or wireless connections, but it actually appears less expensive (for now, at least) to get a separate gadget for that, like a Roku or Apple TV; televisions with such features tend to have other things bundled along with them, making them cost more when all you really want is the Internet connectivity.", "Date": "March 14, 2011"}, {"Title": "barely used in 16 months now we have no sound", "Author": "brian", "ReviewID": "R282FU67ABGH2S", "Overall": "1.0", "Content": "We sat down last night to watch a movie and got greeted by a high pitch constant buzz, no sound but we do have picture, tried all the fix its mentions online to no avail.this is a spare tv for us so its not used very much and i will never buy another Vizio product we will stick to the reliability of Samsung which we have in our main living room.Nothing is a good price when it lasts this length of time , in saying that the picture quality is good...lol\"****Before you purchase a vizio tv please check consumer reviews for sound problems, they have major issues****", "Date": "December 30, 2013"}, {"Title": "Wtong Product! Sent the E32ovt instead of the advertised M32ovt!", "Author": "Cam", "ReviewID": "R1EZDCCJVN6GE2", "Overall": "2.0", "Content": "The only reason I am giving 2 stars instead of one is because shipping was prompt. I don't know what is up with these 3rd party company's lately but its beginning to be very aggravating! I am trying to order 2 of these TV's to use recording studio monitors and this is the third 3rd party company who has displayed the M32ovt and has shipped the E32ovt! One almost shipped at 37\" TV! This would have been fine except I need 2 TVs the same size to use on a computer and I already have one M32ovt! Luckily I caught the other 2 company's before they shipped but to make it worse I called the company's and they actually changed the description to the right Product number almost as fast as I could log back on to Amazon and look! As if to try and cover their tracks! I was beginning to lose my faith in Amazon until I called Amazon and they assured me that the company will be forced to send me the right TV! If not their contract with Amazon will be terminated!", "Date": "December 21, 2013"}, {"Title": "Good", "Author": "Amit Kumar Sinha", "ReviewID": "R1TU0M3KFL37U7", "Overall": "5.0", "Content": "TV is good. I like it very much. Picture quality is very nice and other feature is also good. Sound quality is very fine. I liked it very much", "Date": "December 11, 2012"}, {"Title": "Great TV", "Author": "Leftovers", "ReviewID": "R3JLQ3XOL7GILR", "Overall": "5.0", "Content": "I laughed the other day when I heard a radio add for a 32 inch TV for $350. I got this refurbished for $280, and its fantastic quality.I have it hooked to my PC via HDMI. The sound is perfect for basic computer sound, and  adequate for most basic entertainment, like streaming TV shows. If you want theatre experience, the speakers probably won't come into play. When using Windows the TV is on a seperate sound driver than my sound card, so I can't play both at once. If you have extra outputs on your sound card, then it would be easy, but probably wouldn't do much.Note: The picture from Windows 7 didn't occupy the whole screen (about 1/2 black on all sides). I recently installed a video card, and it adjusted the image to the whole screen, no problem. Also, before the video card was installed, the picture didn't appear to be full resolution, but now it looks perfect.", "Date": "November 30, 2012"}, {"Title": "Audio problem", "Author": "Flatman", "ReviewID": "R1E0RIYK1MU3X0", "Overall": "2.0", "Content": "I am surprised that the audio problem - sound suddenly stops or starts skipping - is not an issue for most reviewers. This is a known defect in this model. So far the 'fix' is change channels then return to the original station. Picture is great but the audio issue can be quite annoying.", "Date": "December 24, 2011"}, {"Title": "It's a TV", "Author": "Joseph Johnson Jr. \"Jaythree\"", "ReviewID": "R3OWQ84MVEP274", "Overall": "3.0", "Content": "I bought this TV because a friend of mine had the 23\" version and it was beautiful (and i bought from him).  So I decided to buy this one.  I guess I didnt hook at the Hz because I didnt think they would go through all the trouble to make a 60Hz LED TV.  Wrong.  I have another less expensive Vizio that shows 3000 times better.  The sounds sucks and not very clear.  The menus are as simple as they should be and you to to go to too many places to get from one thing to another.  The picture is ok, but no where near that of the 23\" version.  I would throw this away before I sell it or give it to someone.  I gave it 3 stars because it's a Vizio and i like them as a brand.  But this tv is just a TV and lacking a lot of features that should be standard on any new TV.", "Date": "May 5, 2011"}, {"Title": "You get what you pay for.", "Author": "Shon \"refractured\"", "ReviewID": "R1EWLFX65S2XYM", "Overall": "3.0", "Content": "So this TV was an excellent price.  I was looking for a decent new 1080p LED set and enjoyed my previous Vizio Plasma previously.  Well this TV unfortunately was not quite up to spec.  I'm no videophile, and I probably can't speak to the technical details others might, but I was definitely annoyed by the edge lighting as it bled into the image.  I did read this is fairly common for edge lit LED sets, and turning down the backlight can help (honestly I didn't know this until recently).  Other than the bleeding, the most part, the colors were great and I didn't really notice any sort of motion blur or things of that nature.  I wasn't blown away either.Yes, the speakers are crappy. But that wasn't an issue for me since I have a nice receiver.My main issue was with how this set handled signal switching (if thats the proper term). For example, I have a PS3, 360 and an Apple TV, all through 1 HDMI from my receiver.  I typically watched netflix on my 360.  However, every single time I load up a show, the signal disconnects and I have to power cycle either the TV or my receiver for it to establish the connection again. bad bad bad.  It also had a hard time detecting my Apple TV when the receiver switched to that input.  This, coupled with the mediocre picture quality and backlight bleed prompted me to return the TV.One thing I'll hand Vizio is that the product packaging was easy to unpack (and pack), doing no damage to the box.  The screwdriverless screws to attach the base are also a convenient touch.  I can't say the same for the LG I just ordered.  So setup time with the Vizio is actually quite less.So if you're looking for a budget TV, and its not going to be your main TV, this could fit the bill.  I can't recommend it as centerpiece for your home theater.", "Date": "August 16, 2011"}, {"Title": "disappointed", "Author": "Jacob Oz \"Kristal Oz\"", "ReviewID": "R10YA6FZ5AN9AX", "Overall": "2.0", "Content": "we had high expectations for this television for our bedroom given the Vizio promise, however, it was not long before off and on the sound would \"wobble\".....I contacted Vizio customer care and was told it was due to our Verizon Fios connection and we required a compatibility device that no one at Verizon ever heard of, I have also discovered the \"wobble\" sound when watching a DVD which has nothing to do with the Verizon connection now our warranty is expired we have no choice but to turn the tv off and on again to regain sound - not optimal when involved in a show.....bottom line I will never buy Vizio or recommend it again our other sets include Samsung, Sony and a small Phillips for the kitchen all perform great", "Date": "December 14, 2012"}, {"Title": "Be conscious with the LED", "Author": "Vaneisabel1", "ReviewID": "R3HIXEWVSJLQR4", "Overall": "4.0", "Content": "The tv picture is really nice. The tv case is very very thin. Like all the LED....  This is why in most of them the sound isn't loud and crisp. (This is my second LED and the first one is a 26\" Sharp and has the same issue). I think this is to keep the tv in a low budget range.", "Date": "January 3, 2012"}, {"Title": "Vizio 32' 1080 LED LCD HDTV", "Author": "Harvey", "ReviewID": "R12XNKRUW8K3NA", "Overall": "4.0", "Content": "W/the help of Consumer Reports I made my choice choice, size, and price. I have also heard others take of Vizio quality, 1080 over 720,LED,LCD, and HDTV performance.I don't watch a lot of TV and have experienced the ease on doing computer stuff on my sons TV. I am a person that in most part research before purchase.", "Date": "March 30, 2011"}, {"Title": "awful", "Author": "mel_517", "ReviewID": "R2D5ZNPJ1DOVLU", "Overall": "1.0", "Content": "Do not buy this tv!  I've had the piece of junk for 3 months, I'm not even done paying on it and its not working rite.  The volume won't stop until it goes up as loud as the tv allows or keeps going down until its at 0 with no sound.  It does not stop in between.  The lighting dims off and on for no reason.  A huge waste of money.", "Date": "September 7, 2011"}, {"Title": "return to costco", "Author": "H. Bowman \"Mailman\"", "ReviewID": "R116XAUAV2TLCE", "Overall": "2.0", "Content": "I picked up this 26 on Sun....Hooked up HDMI cable...Sparkles from the top of screen...So I decided to use the cables that are supplied by cable company....3 video-2Audio......No more sparkles....Now there is a pencil size line across top of screen...well I called Costco Tech and they could'nt help...They hooked me up to Vizio.....No help! I just returned the tv on Mon...The techs were very good....But I did'nt want a repairman.....The sound is very Tinny...I decided to pick-up the 32 samsung LCD next week...Costco has it on sale....The picture looked pretty cool....Plus....the 26 is a little small.......Costco has best return policy....90 day return...extra year warranty.....", "Date": "June 7, 2011"}, {"Title": "Bad Unit, Worse Tech Support", "Author": "GoodRead65", "ReviewID": "R1H2YNLCZI5403", "Overall": "1.0", "Content": "I think I got a bad unit out of the box. That in and of itself isn't especially damning - it happens. The picture quality from both the satellite reciever and DVD player was poor, even compared to my old analog television. I also tried upgrading to Composite video cables. However what I really didn't appreciate is an incorrect tech support phone number in the manual AND being handed a line by the online tech support person. Here's a snippet of their wisdom:Vizio: OK the DVD player would only need just composite cables or just component cables. And the coax cable you are using from the receiver to TV will not give you HD quality.Mi: But it doesn't hurt to have both the component & composite cables hooked up right? I'm not looking for HD quality but I expected at least as good as my old television. I'm wondering if I got a bad unit since both the DVD & Cable picture quality seems to be \"off\".Vizio: I would use just the component cables for the DVD player and look into upgrading your cables to the cable box if you are able to.Mi: Okay but, as I said, the DVD picture quality isn't good either, almost like it's out of focus.Vizio: It is probably because you are using both component and composite cables.Mi: Sorry, I don't believe that is it. I looked at the installation instructions and there are two sets of cables - one with three connectors (red, green, blue) and one with red and white. It shows them all plugged in.Vizio: Vizio has left the conversationYep, that last line was Vizio tech support hanging up on me.Update: I returned my unit to Sam's Club and bought a Samsung HD model. This one worked fine - same cables same everything.", "Date": "December 26, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p HD with Razor LED backlighting for brilliant color and contrast\nLess than 1.62\" thin (max depth 7.94\")\n50,000 to 1 Dynamic Contrast Ratio\nSRS TruVolume and SRS TruSurround HD audio\nAmbient Light Sensing technology", "Name": "VIZIO M320VT 32-Inch 1080p LED LCD HDTV with Razor LED Backlighting, Black (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZL0jZOxfL._SY300_.jpg", "ProductID": "B003PGX0VM"}}