{"Reviews": [{"Title": "I thought I was going to buy a Samsung", "Author": "Greg Balko", "ReviewID": "R3G1C4QLVJG2A3", "Overall": "5.0", "Content": "I recently decided I was going to purchase a new TV.  I went online and spent a lot of time researching everything.  It seemed like the Samsung UNC8000 was a well liked set by most reviewers.  It is a edge lit LEd set with the added feature of local backlight control.So I go to BB to look at this set.  I'm in a relatively bright area and I see flashlights in the bottom corners.  No guessing where the light source is located.  I think to myself, \"self, how terrible will this look in lower light?\"  So I go into the Magnolia room and spot the Samsung UNC9000, the flagship.  Really beaytiful looking set.  Turn it on and it is flashlighting also.  I ask the guy to turn on the other TV in the room.  We are watching Beowolf and the scene goes black.  The Samsung turns dark gray with corner flashlights and the other TV goes pitch black.  I can't tell the bezel apart from the screen.  \"Oh my God!\", I said, asking what TV I was looking at.  Turns out it was the Sony HX909.  I didn't remember reading much about it.  More about the PQ.  Gorgeous is all I can say.  The colors were dead on.  The trumpet in Beowulf was gold like a trumpet should be.  Turn around and it is dull yellow on the Samsung.  The dark blacks of the Sony create so much contrast that all you can say is Wow!  I really tried to get the Samsung to match the Sony.  I lowered the backlighting, made sure it was in cinema mode and that it had its backlight control on.  It still looked terrible compared to the Sony.  I then tried to make the Sony look bad.  I put it in torch mode and there was no flashlighting and it was still pretty impressive.So I knew I need to research a little more.  Turns out what separates this set from the masses is its full array back lighting.  Said another way,  Most sets use LED lighting along the sides.  This allows for cheaper manufacturing costs and thinner profiles with the downside of poor screen uniformity and annoying flashlights and waterfalls of bright light on a dark screen.  The backlit sets puts the LEDs in the back behind the display.  This adds the benefit of a more uniform appearance and much better black levels. The only downside I have heard of with these is the cost and halos around bright objects on dark backgrounds.  Last year several manufacturers made full array sets.  Samsung made the UNB8500, which cnet rated as one of the best sets they ever tested. Now all they make are edgelits.  It seems that Sony, LG, and Vizio are the only makers left.  Rumor has it that Sony is getting out of the game. Having seen the two technologies side by side,  The full arrays are worth every penny. Better get one while you can as it looks like the manufacturers are taking a step backwards in PQ and focusing more on thinner, gadgets, and 3D. I guess that they are too expensive to make and thus hard to market and sell.I have not seen the Vizio.  The LG 9500 IMO is a really nice set but did not have as nice of blacks as the Sony. For the Sony...Televisioninfo.com rates this TV very highly except for its MSRP of $3,500.  Cnet also rated it very good, criticizing it for some blue tones on black and also for its price.  My set is calibrated (You can get very good settings for free off of AVS forums) and I see no blue tones on black.  If you look around you can find this set for $2,300 online, which in my opinion makes the best LED out there at a good value.", "Date": "November 19, 2010"}, {"Title": "This dark horse has the best PQ that's available within Sony's 2010 HDTV lineup", "Author": "jtorion", "ReviewID": "ROYEBS1JX4UQ1", "Overall": "5.0", "Content": "Hello- I am no expert here & I normally don't write reviews for things.  But I've noticed this LCD/LED TV only had 1 review for it, so I'll show it some love.  I've had it for a day now and after tweaking the \"out of box\" settings just a bit, this panel just came to life.  It displays some very vibrant colors, crisp whites & very, very deep blacks. The sharp/clean image detail is way beyond my softer more subdued looking XBR2.  Although my XBR2 had better off axis viewing, the HX909 is pretty darn good when it comes to this.  This may have something to do with the HX909's Glass Monolith panel design, which by the way is very cool looking.  The panel comes with a swivel base that can be tilted back 6 degrees.  The internet hook-up via ethernet cable works great.I replaced my older 60XBR2 with this 52HX909 and the PQ makes up for the loss of 8\" in panel size.  IMHO, I feel that the HX909's full array back lit led w/local dimming makes this panel the best option that's available within the 2010 Sony HDTV lineup.  I only care about 2D, therefore 3D does nothing for me. Also, I'm not a gamer.  Although this TV lacks some of the on board gadgets that the LX900 series has, it certainly makes up for this with it's far superior PQ. Based on the better PQ I would go with a full array back lit w/local dimming panel over any edge lit/some local dimming(NX810) panels any day. Whatever panel you may decide to go with, just enjoy your new TV.Good Day!", "Date": "October 23, 2010"}, {"Title": "xbr52hx909 reviewed", "Author": "jesse", "ReviewID": "R189SEQ15EG3PF", "Overall": "5.0", "Content": "I have had my tv for 4 weeks now and I must say I still get impressed by it's picture. Today I watched Train spotting on standard dvd via my Sony bdps550 and I was amazed how good it made the 480I look. It looked almost like a blu ray. The picture was perfect it had that film texture perfect brightness. This led is so good because it uses white led light it does not have a blue tinted light like so many lcd /led panels;call edge led. You see if  you have a blue led it will tint your white color and it will offset all the other colors.  So when you go out and look at a big tv wall compare the white colors on this set to others. You will notice other sets make the skies way too blue and peoples face look off color and on outside footage you lose the golden glow of the sun.  The other great thing about this set is the part that also makes it expensive; it is the back lit led. It allows sections of the panel to have no light which gives you great black levels \" it makes a dark movie like Batman\" look great and you don't lose detail in the surround parts which may need to be lighter.  The hd off the air antenna looks great and leaves you wowed and the remote is so cool too it has a power key on the underside so you can use your index finger to power the set. Now you don't have to make your way to the top of the remote to turn it off.  Lastly the 3d part. You may not care about 3d but you will like it when you see it. Remember this led has  the best picture you can buy so 3d is just an extra feature. ps if its outside the budget checkout the kdl55hx800/810 it's also good. One more thing always use monster cable and monster power. good luck I hope this helped", "Date": "October 10, 2010"}, {"Title": "An Excellent Performer", "Author": "Jack \"Flash\"", "ReviewID": "R37XM5DPDXJEIN", "Overall": "5.0", "Content": "I've been using my HX-909 for a couple of months and continue to be impressed with the quality of the picture it presents.  The best description I can give is that it it's like looking out an open window.  The LED backlight makes for vibrant colors.  The black level is by far the best I've seen on an LCD set.  It's nearly as black as the black plastic frame around the screen.  The glass in front of the screen does an excellent job of eliminating glare from other sorces.  The set is not a power hog by any means.  My Kill-A-Watt meter shows an average draw of about 130 Watts with normal programming although that figure can drop quite a bit if there is a lot of dark in the scene, when some of the LED backlights are off.Fast-moving scenes are rendered very well by the HX-909.  Whether that's due to the 240 Hz processing or just Sony's basic technology I don't know but I do know that I've never seen any juddering.  Picture quality seems more reliant on what's being fed to the set, rather than it adding any artifacts of its own.  Also, as another reviewer noted, the way this set upconverts regular DVDs is pretty amazing.  It really is hard to tell many of them from Blu-ray discs.The number of inputs (4 HDMI, 2 component, 1 composite, 1 PC-RGB) is certainly adequate.  The internal speakers are located in the bottom of the cabinet and are down-firing.  Their sound is somewhat better than one might expect but you really need a home theater sound setup to do justice to the picture.  I'm using a Sony HT-SS370 with mine along with a Sony BDP-S570 Blu-ray player, all using HDMI connections.  HDMI is also used to connect a Comcast HD box to the home theater.Now, that remote control.  It is both a pleasure to use and frustrating to use.  It is nearly 10\" long, 2\" wide and has a concave surface.  It fits the hand quite nicely and many of the buttons are well laid-out.  The buttons themselves have a \"clicky\" feel, unlike the rubbery feel of most remotes.  The volume and channel up-down toggles are large and easy to find.  The muting and jump buttons are quite another matter, however.  They are located at the sides of the volume and channel toggles and are tiny, measuring only 1/8\" x 3/16\".  Also, the distance they travel when pushed is very small.  They barely move at all.  Large fingers can have problems pushing them.  This can be a pain if you need to mute the set quickly, such as when the phone rings or the channel you're watching blasts you with an overly-loud commercial.  As for the extra power button on the back of the remote, one has to wonder why it's there as there certainly is no hardship with using the power button on the front of the unit.Be aware that the \"manual\" that comes with the HX-909 contains a mere 21 pages and contains only the most basic information.  The real manual is accessed by pushing the Guide button on the remote.  It is very complete but is somewhat of a chore to navigate with the remote.  To get to some of the subjects it contains requires drilling down through several pages.These are fairly minor gripes, however.  If you are looking for one of the best viewing experiences available today on an LCD set you will certainly like the HX-909.", "Date": "November 16, 2010"}, {"Title": "It's Just The Best!", "Author": "F. Maria", "ReviewID": "R1T20YFK8OLJTM", "Overall": "5.0", "Content": "Why I Chose This TVI did not buy this from Amazon.com but wanted to share my experience with you all just the same.  I chose this TV with the Help of the salesperson from another store. I told him what I was looking for and the lighting situation in my living room.  He recommended an LED LCD over a plasma TV based on me telling him that I would be viewing the TV while the room might be brightly lit.  I told him that I did not want an LED LCD with edge technology because of the issues that other online purchasers reported with some models of other brands on various web-sites.  Prior to speaking to him, I had done some research and I knew that if I were going to get an LED LCD then it would have to be one that had full array technology.  That is when he recommended the Sony XBR-52HX909.  I didn't necessarily want Sony but I didn't want plain edge technology even more.  I didn't want Sony because I usually find their products to be too proprietary and not always user friendly except for the PS3 because PS3 is just the best.Size of TV for My RoomI sit 10 feet away from this TV.  It is the perfect distance.  I initially had a 42 inch TV and I thought that I should only upgrade to a 46 inch.  I would have made the mistake of a lifetime if I did that.  My 42 inch was more wide then square but this TV is more proportioned.  Given that fact along with the high quality of this picture, I certainly made the right choice.  It is a true perfect fit for the space.How the TV Looks In Your HomeAesthetically speaking, this has got to be the most chic TV that I have ever seen.  The only word for it is elegant.  You might have to dress up your living room around the TV...It's that pretty.  Even when the set is off, you are staggered by the beauty. You'd being doing something else in the room and catch a glimpse of the side of the TV or the way it looks on the stand and it just takes your breath away.How the Picture LooksTo watch a TV movie or TV drama show on it is pure joy.  Even the TV commercials and regular broadcast news look splendiferous. Everyone's complexion looks just right and beautiful.  Blu ray looks its very best on this set and I think that the 3D experience is JUST RIGHT.  There is a tone that is struck regarding light and dark that is breathtaking. It is so-o easy on the eye that I find myself more and more watching TV with my glasses off and I've worn glasses for most of my life.  Mind you, it's not that the picture is overly bright; it's just that they do colors well on this set.  The only way that I can describe this is to say that the display and colors are soothing, peaceful, and varied.It Took Minor TweakingThe colors pop nicely but not before I had to do some tweaking.  I normally don't like continually changing settings to have to seek out the various viewing modes.  I just want to watch TV.  That being said, the problem that I initially saw was on the channels that broadcast sports.  They looked dull to me.  I could always just select the \"sports\" setting but  then I knew that I would be making the TV too bright, thus shortening the life span of the TV.  I had no intention of doing this to such an expensive set.  So what I did was selected the cinema setting.  I raised the Hue one notch to \"R1\" (controls the red colors) and I raised the \"sharpness\" and \"color\" (saturation level) settings to \"55\" respectively.  This was only five points over the default setting.  The color temperature is set to \"neutral\".  These minor tweaks made all of the difference in the world.  The red colors popped and, I'm telling you, the color blue is a thing to behold on this TV.  In the \"advanced\" setting, I left everything as is except for the \"live color\".  I set that to medium.  These few tweaks did the trick.  The picture is gorgeous no matter what content I am watching.  Oh, by the way, I did this under the \"common\" memory setting so that the settings remain the same across the board, no matter the content.  Simple.The Internet On This TVI had to do an internet update when I first received the TV.  This is apparently common now with most new TVs and receivers that have the internet on them.  I used an Ethernet cable and attached it to the LANs port on the back of the TV with the other end going into the back of my router.  I was immediately connected to the net and was up and running in no time.  I don't stream anything so I can't speak to this.  Once you watch a Blu Ray movie...nothing else will do. I just disconnected the Ethernet cable when I was done.The remote ControlThe remote control for the TV is a well thought out design.  I was impressed with this because I normally stay away from Sony products because they usually have the most nonsensical menu layouts and the most non-user friendly remote controls.  However, they got it right this time.  It makes sense.  It's functional.  Every function button you could possibly need is at the touch of your hand except for the sleep timer button.  If you want to find the sleep timer, you have to push the \"home\" button on the remote control, then scroll left to the settings menu, then to preferences and then to clock/timers.  It is in that menu that you will find the sleep timer.  The good news is that the menu navigates so well that you get there rather quickly.  It's just a stupid thing to do.  I truly believe that Sony must want you to leave your TV on all night.  If that is not so, then they should put the sleep button on the remote control where it is on every other manufacturer's TV and receiver remote.  What's really funny about it is that I called Sony technical support to ask them where it was and he couldn't locate it either.  I actually stumbled across it. It is just so counter-intuitive.The TV MenuThe TV menu is virtually the same interface as the Play Station 3 Menu.  In my opinion, that is the smartest menu that I have ever used.  They also have what is called an \"I manual\" button on the remote control.  Brilliant.  Press this to learn the ins and outs of the TV set.  I promise you that you will learn your set quickly because of this feature.The 3D experienceIt is wonderful on this TV.  If you are one of the many people concerned about eye strain or nausea then...worry no more.  There were no headaches or nausea from anyone that viewed it on this TV when they came to my house.  Remember how I mentioned earlier that The TV is soothing to the eye.  Well, when you are watching a movie in 3D, there is no overwhelming strain on your eyes.  It's just a great experience.  I have some 3D movies and my favorite is the movie \"Piranah 3D\".  This is a fun, over-the- top movie.  It has gore in it and I hate gore but it is done so well that you don't see gore.  You just see some serious man-eating fish tearing up some people.  It is a true back-in-the-day horror flick. It makes you grab the person next to you in a fun way.  My point is it's the perfect movie experience in 3D.  Of course the kids animation movies all look great and \"Alice and wonderland was excellent in 3D.The 3D GlassesThe glasses are good looking, fit well and work well.  Naturally, they need to communicate with the transmitter that sits on top of the TV so, if you walk out of the room while you still have the glasses on you will break the connection.  That makes sense so just sit the glasses on the table so the transmitter can still communicate with the glasses when you walk out so that the signal will not be broken.The 3D TransmitterYou just sit it on the top or bottom of your TV and you are in business.  You plug the other end into a port in the back of the TV.  It worked immediately.  Once you turn your Blu Ray player on, the transmitter and Blu Ray player sync to each other.The 3D Blu Ray PlayerI am using the Play Station 3 as my 3D player as well as my Blu Ray player.  It works extremely well since the Play Station 3 is one of the, if not, the best Blu Ray player out there.  While the PS3 plays HD Master Audio (lossless) on regular Blu Ray Discs wonderfully, it does not do it on the 3D movie discs.  It drops the sound down to DTS. I still get many options of sound i.e. discrete etc. (but not HD Master Audio).  I had to do a lot of research to confirm that it doesn't do it for 3D movies.  I hope that they can do an update for that.  If not, I'll have to look into purchasing a 3D player that does that because I'm used to that sound now.  It's not killing me but...I'm not happy about it either.This TV Plays Very Well with OthersI am using the Onkyo TX-NR708 receiver and the TV works extremely well with it.  I am using it for 7.1 channel surround sound.I Can Watch TV with Receiver off Or OnOn the TV I have the ARC Channel turned to \"off\" and on the receiver the ARC Channel set to \"off\" as well.  The \"Bravia Sync\" on the TV is also set to \"off\".  With these three things set to \"off\", I can watch TV when I want without having the receiver on and I can use the regular TV volume for sound.I have my receiver HDMI control set to \"on\" and I have the TV HDMI control set to \"off\". That way, my receiver controls the HDMI and all of my other equipment passes through it including the PS3 and my other HDMI devices. This TV will allow you to do this but be sure to turn your TV volume down when you feel like watching TV with the receiver on.  Another reason why this is important to me is because I don't upscale anything.  I love my black and white station in its original aspect ratio and the stations that are in the 16:9 aspect ratios come through in their original format. I then have the one HDMI cord going from the receiver's HDMI \"out\" and then into the TVs HDMI \"in\" and I don't have to worry about the fact that is says  ARC HDMI on the TV input port because I disabled it.", "Date": "April 17, 2011"}, {"Title": "Great size, ease of use, 3D compatibility and internet content!", "Author": "Christian Lenoir", "ReviewID": "R2DYNM8YC2W6M8", "Overall": "5.0", "Content": "I purchased this TV because I wanted something big (believe me, 52\" is huge) and also with options for expanding possibilities, such as from its compatibility with internet ready content and 3D capability. The menus are a breeze. I read some reviews saying it took long to flip through the menu and/or channels, but that is not my impression and I think the menus are not only easy to understand but are also \"visually intuitive\", and changing channels and menu screens is a relatively quick process for me. Even entering text (something you would assume would take forever on a TV remote) is not that gruesome: if you're accustumed to texting on a cellphone, then you'll do fine (e.g.: to enter a text string to do searches in Youtube). you probably need a separate computer handy upon setup as some of the internet content (Amazon, Netflix, QrioCity) will require you to set up accounts and or activate your TV by entering a code. The setup process is easy and walks you through with no problem. Keep in mind the box is big: I think like 150 pounds, but it is quite sturdy and very well packed so don't worry about the box breaking while you handle it. The image looks great. I was worried the blacks wouldn't be so good on a LED TV but they seem rich enough for me and the design is slim and classy with a neat gloss black finish on all of the front screen area (including frame around the LED screen, so that all the front panel looks of a uniform glossy black blend). The on screen displays (such as for displaying info while viewing TV) are not too bothersome and appear on fade in boxes at the top and/or bottom which don't cut off too much of the image. When you navigate the system menu, you can even see the TV channel in the background which is also useful. My setup process found a ton of new TV channels (analog and digital) which I didn't even know were there, though some are duplicated and it took a while to de-select those I didn't want to shop up (but the option for hiding channels is well thought and easy to do)", "Date": "February 3, 2011"}, {"Title": "Great TV, Period", "Author": "AjayLA", "ReviewID": "R1P3TBJ8H4YJR2", "Overall": "5.0", "Content": "It may be last year's model, but this TV has nothing the new ones don't, and fits nicely between 46 and 55 inch TVs.  The full array backlighting renders blacks that are as deep as those on a plasma.  The picture is stunning, especially after customizing it according to the recommendations on CNET. I don't intend to watch a lot of 3D, there being so little content, so the lack of emitter and glasses is not significant -- and later, if and when content emerges, upgrading will be simple.  Even turned off, the set is very handsome, presenting no border and a muted silver frame.  It was not a great deal at $4,000, but at less than half that price -- mine was an open box from Fry's -- if's a steal.", "Date": "January 26, 2012"}, {"Title": "Incredible Black Levels, Performance & Design with Good 3D", "Author": "R. Sen Sharma \"Rhubarb\"", "ReviewID": "RU3WKD6SRC9GJ", "Overall": "5.0", "Content": "Great 2D with incredible contrast and black levels. The only downside is, in extremely dark/black scenes with very bright/white visuals such as text, I will on occasion notice blooming. This is only noticeable if you look for it, and I've never had anyone else comment on it while watching with me. The 3D is good, but you need to keep your head fairly straight or cross-talk will creep into the visuals. These are minor quibbles, and I continue to be blown away by this TV. A great upgrade from my old 46 inch Sony W3000 model.", "Date": "December 30, 2011"}, {"Title": "Just amazing...", "Author": "Opentoe", "ReviewID": "R3NDEKFLF81XF9", "Overall": "5.0", "Content": "This TV is just amazing. Right out of the box I was amazed at the picture and it just got better upon making picture adjustments. Even cable HD cable TV playback looks just awesome. I thought I would never like an LCD TV, but when you get one with a high quality resolution, full LED array, it just doesn't seem to get better. I've seen the Samsung, LG and Sharp models and this one kept coming out on top with the picture. I don't really care about 3D stuff and Internet but hey it is there.", "Date": "February 17, 2011"}, {"Title": "THIS IS A GREAT TELEVISION", "Author": "Roger", "ReviewID": "RDCOL5FHB8KC4", "Overall": "5.0", "Content": "If anyone has any doubts about buying this television (which is now a little out of date since a newer model has come out), I would tell you to not hesitate for a moment.  This television offers the best LED/LCD picture quality of any set I have checked out.  I bought this set this past Spring and I continue to be blown away by the PQ every time I turn it on.  It might be considered a little different when it comes to moving around in the feature-rich environment, but you get used to it. I've seen easier to managed menus...but, again, it's not horrible.I do like 3D and the only experience I would rate as better than this Sony has been my 73 inch Mitsubishi Diamond Series (WD73840) - and that's quite a bit larger so I have to qualify this statement.If you are interested in this bad boy, do not think twice about buying it because you will never be disappointed IMHO.  The 2D experience with this Sony is unmatched...and for those who have watched this television for any extended period of time, you know exactly what I mean.  Join the club!", "Date": "November 13, 2011"}, {"Title": "A pleasure the 52HX909", "Author": "Dublchin", "ReviewID": "R1BG90L0KAPEIU", "Overall": "5.0", "Content": "I did not buy from Amazon but I'd like to say its overall performance has been excellent. As all products have pros/cons, my experience tilts the pros in its favor. The deep black is impressive as all the pro reviews state. Out of the box the picture looks great but can be overpowering after awhile, its so bright and vivid at least in my room setting (shady room). After 3wks+ ownership and some tweaking with tips from online sources its a pleasure. Blu-ray even more stunning as I watched Dark Knight again...a very different experience from prior tv. The blackness of the panel really brings to life all the colors even in the dark scenes and 1080/24 resolution BD playback seems to have made a significant difference. Frameless appearance fits well in my room setting.Some usage feedback, the settings menu navigation to adjust picture should be up front at 1st level instead of 2nd level to even 3rd level menus then need to back out of each menu level to see the picture effect can be tedious if doing it for any length of time. Some settings show a small horizontal bar to set/view the effect but some menus take up half the screen so its difficult to judge picture effect at times. However, like the remote that comes with it, even controls PS3 DVD playback and I like the automatic port switching when you turn-on/off PS3 goes to/from cable. Don't like the cables/port arrangement to insert perpendicular to back of TV prefer if it was insertable parallel to back panel, as my wall bracket is closer to the wall and thick cables hard to fit easily so had to switch to thinner HDMI cables.My only viewing gripes have to do with HD cable as each station tends to have varying degrees of color saturation and sometimes the red overpowers the flesh tones and the blood in some scenes have a tinge of purple/fuscia as opposed to blood red, very obvious when another red object in the scene or its just the producers poor choice of color for fake blood, otherwise stunning for other stations especially sports. I've learned to ignore it to just enjoy watching or could bring in a pro tuner for a marginal tweak IMO.The speaker volume in my room requires 50-75% vol setting but once you setup w/external soundbar or HT system its better and can back it down to 30-40% of range...native TV should have sufficient sound capacity for this price range. 52\" Size is great for me (as I had a 720p/1080i 42\" LCD which I loved) the combination of newer panel tech/electronics and full array local dimming has apparently refined the picture quality to a new level than when I bought my old panel years ago. The debate plasma/lcd, choice is simple for me w/this panel, plus it generates almost no heat maybe 10 degrees above ambient room temp. Have not tried 3D as I was only interested in basic 2D capabilities and satisfied with purchase. Going to wait for a mature direct view 3D experience as I don't like wearing the 3D glasses to watch a movie.", "Date": "August 6, 2011"}, {"Title": "Looked great for the 20 minutes that it worked", "Author": "Joshua Graessley", "ReviewID": "R3TCTUAKXFO40W", "Overall": "1.0", "Content": "After receiving the TV, I attached a Sony PS3 and left it updating. When I came back, the TV had turned off. After turning it on again, the unit would power on then off almost immediately. The standby light would flash 5 times. Sony Tech support indicated that a technician needed to get to the TV to figure out what was going on. I opted to return the TV.I did end up ordering a different Sony (55NX810) which has a gorgeous design though the edge lit backlight leads to image quality that isn't quite as good. Much to my dismay, the new 55NX810 came with two dark spots. Sony is working to get the TV repaired.Looking at other reviews, it seems I'm not the only one that had this problem.", "Date": "February 11, 2011"}, {"Title": "Do yourself a favor and avoid any Sony TV", "Author": "NeverSonyAgain!", "ReviewID": "RG7JC2MSGXM9T", "Overall": "1.0", "Content": "I bought a new 52 in. XBR9 back in Oct. 2009 for $1,900, and the LCD panel has already gone bad after 22 months. Cost to fix = $2,800! I called Sony and they could care less! Offered to sell me another set for a reduced price. I wouldn't spend another penny on their products! Look elsewhere.", "Date": "September 7, 2011"}, {"Title": "First one lasted 3 hours", "Author": "futureup", "ReviewID": "R2O989E1R7GKJM", "Overall": "2.0", "Content": "So excited, new TV here in time for the Super Bowl! All hooked up and ready! Wake up Super Bowl morning, go to turn on the brand new Sony, NOTHING! Nothing, but a flashing red light. Tech comes to the house that day. Bad board? It was on for three hours! Oh great. Pull out the old Sony.Super Bowl on the old T.V. Wait three days for the brand new one. So excited. Open the box, and, screen is cracked from corner to the top. Hmmm... Now, waiting again, already have the payment book, but no T.V. It's not a low cost unit. Come on Sony, you can do better than this!", "Date": "February 10, 2011"}], "ProductInfo": {"Price": "$3,999.99", "Features": "Sony XBR-52HX909 52\" 1080p 240Hz 3D LED LCD HDTV", "Name": "Sony XBR-52HX909 52\" BRAVIA LED Backlit HDTV with 3D", "ImgURL": "http://ecx.images-amazon.com/images/I/51f8Yk-F21L._SY300_.jpg", "ProductID": "B003Q55A4W"}}