{"Reviews": [{"Title": "Great price verses quality", "Author": "Stan", "ReviewID": "R3OP563JJTFCP7", "Overall": "5.0", "Content": "I actually bought this TV at Sam's club where the going price for it was $598.  It was a real bargain at that price too.  The other TV I was considering was an LED version that is also 42''.  I just could not justify paying an extra $250 for the LED version when this is the same thing with only the regular backlighting, which is actually guaranteed to last longer.I'm not actually using this for a TV, rather, it's being used for a computer monitor.  At first it was a little hard to configure but you have to make sure that your resolution is in one of the VESA formats like 1920 x 1080, 1360 x 768, 1024 x 768.  You also need to make sure the picture mode is set to \"game\" so there is no hesitation between what has been done with the mouse and what happens on the screen.  The game mode fixes any hesitation.I looked on Newegg dot com for large format monitors at 42'' and they were all well over $1000.  There really is no reason to buy one of them when you could just get one of these for so little, and have it do the same thing.Another positive is that the picture is very sharp, brilliant, with plenty of contrast.", "Date": "October 20, 2010"}, {"Title": "Overall a very good tv", "Author": "Dan", "ReviewID": "R2PEPA5J7UWA5O", "Overall": "5.0", "Content": "I purchased this tv in early December of 2010 and have been very pleased with it, with an exception or two. When watching the tv, the volume would periodically get louder. I soon discovered that the tru-volume feature caused this. After turning that feature off, it works like a charm. The picture is very clear and crisp regardless of what I watch on it (sports, sitcoms, etc.)but getting 240hz would have been nice. This tv was definitely better than what i had expected for the price. I will definitely look at Vizio for any future tv's that I may buy.", "Date": "January 7, 2011"}, {"Title": "Good Value for the Price", "Author": "Jeff V", "ReviewID": "R2D7VRYKF3ERAX", "Overall": "4.0", "Content": "Picked this up at Sam's Club on Black Friday for $528.  Not talking about a door buster either as I strolled in at 2PM when the rush was long gone.  Fantastic picture and the 120hz keeps all the action of football and movies very smooth.So far so good after a few weeks in regards to problems.  Very easy to get out of the box and set up.  Oddities so far: commercial volumes are louder than programs...slight annoyance but have noticed that on other HD signals / TVs.  Actual sound quality is very good.Voice / sound and image can be slightly off.  So you'll hear speech but notice the speaker's mouth isn't quite in sync.  Have seen this via non HD cable and on a DVD played on an upconvert DVD player via the HDMI input.  Weird...Remote inputs have a slight delay before the channel changes or something happens.Small annoyances at worst so far.  But again, for $530 bucks, pretty tough to beat!", "Date": "December 5, 2010"}, {"Title": "Great picture, but No Audio Outputs!", "Author": "Paul Fisher", "ReviewID": "R1G5FMWEOGPYEU", "Overall": "4.0", "Content": "My son talked me into getting this one because of the 120mhz refresh rates.  Indeed the picture on HD is very good.  The audio is okay, too, but there are no audio outputs. I should have checked, but I just assumed it would have audio out.  When I hook up my audio system through my HD box, the audio is ahead of the video, so that doesn't work either.  Funny thing is that the lesser expensive Vizios have audio outputs, but some higher end models do not.  You would think that a simple thing like that would come on this otherwise very fine tv...", "Date": "March 18, 2011"}, {"Title": "Terrible TV", "Author": "Jason M. Jewell", "ReviewID": "R3A4FCW50UNDJQ", "Overall": "2.0", "Content": "I knew VIZIO was a budget brand before I bought it, so I was expecting some disappointments. My previous roommate had a VIZIO, though, and it seemed fine, so I decided I would buy this one because I knew what I was getting. The TV is fine for most things--the picture quality is actually very good when playing high quality 1080p video. The biggest problem is the sound. The TV comes with with features called SRS TruVolume and TruSurround HD audio, but FOR THE LOVE OF GOD please turn these off AS SOON AS YOU GET THE TV. I left these features on for a couple months, and they completely ruined most movies I watched. Whispers were impossible to hear on max volume, and music and applause were painfully loud even on low volume settings. I also recommend keeping the audio equalizer on \"Flat\" to reduce this problem.There are also sometimes problems with the audio and video synchronizing. Lips move and the sound is off. This can be improved, but not always eliminated by changing the video settings to \"Game\". When you do that, though, you can't customize the brightness, contrast, etc.Complaint #3 is that the TV is extremely slow to change channels, turn on, or switch inputs. The screen is black for at least 5 seconds every time you change the channel, and the audio has an even bigger delay. I've timed the TV when I turn it on, and it sometimes literally takes 30 seconds for the TV to turn on and show an image.To summarize, I now have the TruSound features off, the equalizer on \"Flat\", and the Video on \"Game\" because any other settings cause problems. There's basically no way to customize the audio or video settings without ruining the viewing experience. That said, now that I have the settings fixed, watching movies and TV isn't so painful. Overall, though, the TV has not met my expectations, even for a lower-end HDTV.", "Date": "October 6, 2011"}, {"Title": "Its a Keeper!", "Author": "Anna", "ReviewID": "R5IXAU9CE0DDD", "Overall": "4.0", "Content": "I got this tv at a very good price and it has been going strong.  Like every tv, you have take your time to adjust the picture, nothing is perfect.  I didn't care about the \"true-sound\", so I turned it off, it would shoot up the volume randomly.  Easy fix.  The picture looks great when watching HD channels or upscaple DVD player/Blu-ray player.  Like I said, nothing is perfect, so If u get a bad apple, just return it(pain in the butt) but it is possible.Pros: Price, Size, 120Hz, 4xHDMI, PC inputeCons: Wish it was 240Hz, LED Black Lit, an inch thick and 52-inch wide....but i would be spending another $1000 :)", "Date": "December 15, 2010"}, {"Title": "Sick of it", "Author": "Brien Cleaton", "ReviewID": "R2FRI8ZI44M2DO", "Overall": "2.0", "Content": "Not long after I got this tv the volume went out sometimes and it would just randomly cut off while I'm playing my ps3. It takes FOREVER to get the connection from my hdmi cable to by ps3. Sometimes it won't even work. The other day I had to cut it on and off over 10 times to get it to work. It's EXTREMELY frustrating!", "Date": "April 6, 2013"}, {"Title": "Great for watching Anime", "Author": "Rachel Lietzke \"Missy Bowie\"", "ReviewID": "R2YCH5TZQO6WFS", "Overall": "4.0", "Content": "I rent a lot of anime, and this is my first HDTV. My old 32 inch SDTV was inherited form my grandma when she passed away about five years ago the only problem with that it kind a blinks in certain parts when I watch DVD's.  When I play certain video games (I have a PS2 and a Gamecube) there the lag problems and the noise reductions also the screen darkens at random, snowy screen and sometimes no sound when I turn it on but other then that this is ok. I would recommend this brand to anyone who wants to buy a HDTV on a buget.Update: I recently figure it out this HDTV has a game mode on it so i'll be more enjoyed to play video games without the annoyed lagging I found out eariler(although in the process move my old TV and my PS2 to a different area in our houses basement). The Video and Audio has imperfections as I owned a old cable box form Time Warner that was like five years old when we move to appleton from brillion and if we need a new one it will be expensive to get the equipment, that's what my dad said when he got his first HDTV(in 2008 that was purchased from Best Buy) to replace a TV that went to hell after it was origianly bought about fifteen years for our basement. And when I watch anime DVD's I watch them on a old DVD player (it was a Mangavox brand and it was manufactured in March 2003 but it was purchased for a father's day gift that same year) that's hook up on a DVD Recorder the voice acting can sometimes hear a whisper, it's annoying but I can deal with that. Video wise form another review the screen can sometimes darken at random but with the movie mode helps but when I watch TV in general I keep on the home mode but the picture can be distorted at times.  This TV is ok but I'm worried that I might have problems with when I get a blu-ray player (as i'm planning to buy one soon) and hook it up to one of the HDMI inputs, but overall these are small problems that can easily overlooked.", "Date": "August 8, 2011"}, {"Title": "Best value for money TV at the time when we bought it and still going strong,", "Author": "Justin Lake", "ReviewID": "R3V9S1RIS5AEFC", "Overall": "5.0", "Content": "Great TV for the price. Got this on Black Friday 2 years back, it was on sale for $400 and at that time it was a killer deal for a 42 inch.The picture quality is as good, the blacks are dark there are several picture mode setting and you can change it to suit your mood/eyes.In fact the quality is as good as the newer Samsung I bought for my other room. The sound loud enough for an apartment living room, I never had a need to turn the volume up all the way as it was way to loud.The number of inputs and outputs on the TV is great, there is both analog and digital option.The TV works flawlessly with my Xbox and there is no input lag or ghosting.The 120 HZ gives the video a nice smoothing effect too.All in all after owning this TV for 2 years, not at all disappointing,Vizio might not be a named brand but they have some good products, make sure you do enough research before you get one because unlike named brands they are not consistent across models, some are good some poor.", "Date": "November 29, 2013"}, {"Title": "Fantastic TV", "Author": "Donald D Matthews", "ReviewID": "R3LFMCMKL5RQQO", "Overall": "5.0", "Content": "Can't say enough about this TV - Price was great, 4 hdmi inputs and fantastic picture quality make this a perfect tv for any room.  I have a Sony Bravia 46\" in the living room and this was for the remodeled den/spare bedroom.  Wall mounts easily and works so well that I compare the picture as good as or better than the Sony (couple years older but a lot more expensive and good for it's time).  Great design that adds to the rooms usefulness and decor.", "Date": "February 13, 2013"}, {"Title": "Vizio TV", "Author": "ntim", "ReviewID": "RQTC39KCSLHD4", "Overall": "5.0", "Content": "I've been very happy with Vizio. Easy set-up, great picture and easy to set up for Amazon Prime. I recommend Vizio to anyone looking for a good tv at a great price.", "Date": "July 22, 2012"}, {"Title": "A Solid \"3 1/2\"", "Author": "njw", "ReviewID": "R2I350PGHMITZQ", "Overall": "3.0", "Content": "I purchased the Vizio e421va for my bedroom two months ago. Bottom line - (1) it has a very good, bright picture, (2) great contrast, (2) and it gives you all the basic features of an entry-level LCD hdtv. Basically, it does everything it advertises it will do. If you want more features & better quality just know that the price range will begin to skyrocket. For the price, this has been a solid value for the money.  Sure, you can do better.  But, you can also do a LOT worse.  The reviews regarding the SRS TruVolume feature are definitely accurate.  But it's simple to disable and it takes less than 30 seconds.  I've not had any problem with channels changing slowly.  That may have more to do with the cable/dvr system through which the tv is connected.  Or, it could be a defective tv.  I would categorize the tv as a solid \"3 1/2\".  I found one refurbished and got a tremendous deal.  No complaints.", "Date": "February 5, 2012"}, {"Title": "Great Tv at a Great Price!!!", "Author": "Anita Rush", "ReviewID": "R1B1U7SDB3ZRVM", "Overall": "5.0", "Content": "Best Buy I saw all Christmas on this TV. Even a better deal than could be had at Walmart on the same exact item!!!!", "Date": "December 26, 2011"}, {"Title": "Nice upgrade from my old LG 32\" LCD", "Author": "R. C. Dickey \"RC\"", "ReviewID": "RP90KVOIV36K9", "Overall": "4.0", "Content": "I'm pleased with the picture and the sound is better than my old LG.  I did have to turn the ambient light sensor off and put the scene mode to cinema to get the Dish Network IR remote to work properly.  The RF remote worked fine.  I've read online other TV brands are having issues with Dish Network IR remotes so I don't think this is the TVs fault.  Overall I'm very pleased with this model.  It could have had a separate composite connection rather than the combo composite / component input.  For the $499 I spent I think it is nicely equipped.", "Date": "December 19, 2011"}, {"Title": "Love it", "Author": "dave6017", "ReviewID": "R1PL88P8UKG770", "Overall": "4.0", "Content": "This TV is very nice.  I've owned it for about 1 month. I was on a $550 budget.Pro's:  120mh refresh rate is what sold me. I was actually looking at other models of Vizio, most internet ready, but none of them had the 120mh refresh rate.con's:  No audio output. and not internet ready, some stations get a white line across the very top of the screen but I beleive it's caused by the cable box. only one set of RCA connections.  Kids already lost remote, i think all remotes should have a finder like cordless phones.Over all great buy.", "Date": "June 4, 2011"}, {"Title": "BEAUTIFUL PICTURE/EASY SETUP", "Author": "VISTA VIEWER", "ReviewID": "RTP2W8IE4WQ0G", "Overall": "4.0", "Content": "AFTER MUCH RESEARCH AND READING REVIEWS I DECIDED ON THIS VIZIO. I DON'T NEED ALL THE EXTRA PLUG-INS OR BELLS AND WHISTLES. THE SETUP WAS A BREEZE. FOR FIRST TIMERS WITH HD, THE PICTURE WAS 3D-ISH BEFORE HOOKING UP HD RECIEVER. SOUND DOES SPIKE HOWEVER. I'VE HAD TO ADJUST THE AUDIO SEVERAL TIMES WHEN CHANGING CHANNELS. I LIKE THE REMOTE. NOT TOO MANY TINY BUTTONS TO WORRY ABOUT. OVERALL, THE 120HZ WAS THE BEST BANG FOR MY BUCK.", "Date": "May 4, 2011"}, {"Title": "Very slow to pickup HDMI signal", "Author": "strevor", "ReviewID": "R2KQCN84CZQNB1", "Overall": "2.0", "Content": "While the HD signals look great, if you have any channels or game consoles (like Wii) that don't support HD, the picture is awful in those lower resolutions. All my Wii games look terrible with jagged edges. Yes it's true that this is because 480i is the best Wii can do, but my old Panasonic HD TV looks much better with the Wii. Some Wii games look so bad, it negatively affect your ability to play them well on this TV. Since most of the programming I watch is either 1080i or 1080p it's not too much of a problem now, but you should be aware of this. It does HD well, but it does lower resolutions terrible. The biggest complaint I have is that it takes the TV 25 seconds to recognize the HDMI input signals! So when I turn on the TV or switch inputs, it takes 25 seconds of black screen every time before a picture is visible.(This is no exaggeration, I have timed it). I have tried different HDMI cables, and different inputs, and I see this with any device I hook up to it via HDMI, including my HD XL Tivo, and Panasonic DVD player. The remote control does not work well. You have to point it in the exact right place, and even then you have to hit keys multiple times before they register. All-in-all, I would not recommend this TV if you want to use HDMI input from your DVR, or if you still watch any non HD channels or own a Wii.", "Date": "March 5, 2011"}, {"Title": "Great TV at a bargain price.", "Author": "J. Gann", "ReviewID": "R3QZ0AY9ZZCICR", "Overall": "4.0", "Content": "Most of the negative reviews I've read seem to be newbies whining.  Haven't really had any sound issues yet, but I normally use a separate surround system for that purpose.  The set is nice looking on the wall.  The picture is outstanding given I paid $450 for the set on sale from Tiger Direct.  I don't use it for my primary viewing, as it is just for my home office.  I like the look of the remote, but have to agree that it can be a bit slow and has to be pointed directly at the lower right hand corner of the set to work.  A universal remote fixed this, but it is something Visio should address.  I like the lit logo on the front of it, as it makes for nice night light.  I've got Sony TV's that have the same lit logo and I paid several times the price for those.  This is my second Visio HDTV, as I have a 26\" on the wall of the master bath.  Stunning picture on that set as well.  Well worth the money and highly recommended!", "Date": "March 29, 2011"}, {"Title": "Too many problems", "Author": "R. P. Kelley", "ReviewID": "RNI5O03W4Z0CU", "Overall": "2.0", "Content": "When this TV is working, it's great.  Unfortunately, it seems to have too many glitches.  Nearly every time I use the television, it malfunctions.  Typically what happens is that I will be watching something and then, out of the blue, the volume will get incredibly loud and then the TV will randomly turn off and then turn back on, sort of resetting itself.  At other times, I am watching something and the volume will just randomly increases and decreases.  Another volume-related problem is that when I am watching something and music comes on, such as from a commercial, the music is disproportionately loud as if the music was on an entirely different volume than the rest of the audio.Generally, the picture on this TV is of great quality, except when it randomly darkens.  This is especially annoying when watching something with a darker picture to begin with, such as a night scene.  When this happens, you cannot see anything.  Fortunately, most of these problems resolve themselves if you turn the TV off and turn it back on, but this is so annoying, especially if you are watching a sporting event like an NHL playoff game.", "Date": "May 4, 2011"}, {"Title": "lemon", "Author": "hoddyburch", "ReviewID": "RUDD1S2YNTP8D", "Overall": "2.0", "Content": "When I turned on the TV it had a line of megapixels burnt out all the way down the center of it so I had to return it. The sound was also not good at all. It would be really loud then really soft even after I adjusted all of the settings. I will say that Amazon was amazing with the return though. That the reason I will continue to shop here! I also am very pleased with the LG 42LD450 that replaced the Vizio.", "Date": "January 11, 2011"}, {"Title": "Great picture!", "Author": "tmd70", "ReviewID": "R280JAY6J7NE63", "Overall": "4.0", "Content": "This television has a beautiful picture and, overall, we're very satisfied with this purchase.  The only issue that I have with this TV is that the sound is all over the place.  When a commercial comes on, the sound gets considerably higher, making you turn the volume down, and then back up when the program comes back on.", "Date": "December 31, 2010"}, {"Title": "Just returned sound kept cutting out", "Author": "Melanie", "ReviewID": "R13Y66RKDXKBXK", "Overall": "1.0", "Content": "We kept this tv from mid December 2010 to January 4th 2011 and just returned it due to the sound periodically cutting out.But the picture quality on HD channels was excellent.And the picture quality on blue ray disks is the best i've seen yet (this is the second tv my husband has tried thus far).", "Date": "January 4, 2011"}, {"Title": "VIZIO E421VA", "Author": "cynn", "ReviewID": "R3T2SM97L9RPB5", "Overall": "5.0", "Content": "Really like this TV  !!  HD pic is great!  Sound quality is excellent and set up was easy.  Glad i took friends recomendations...would definitely purchase another VIZIO !  Amazon had fast delivery !!", "Date": "December 31, 2010"}, {"Title": "vizio", "Author": "George Hickey", "ReviewID": "R2IMTC2S39VIIV", "Overall": "4.0", "Content": "Sound jumps in volume during commercials and non-verbal portions of programVIZIO E422VA 42-Inch LCD 1080p HDTV with VIZIO Internet Apps, Black", "Date": "September 14, 2011"}, {"Title": "Is a composite input too much to ask for?", "Author": "George Ostrom", "ReviewID": "R2RGDIN138LJSM", "Overall": "3.0", "Content": "Just got this TV at my parent's house to replace their old 32\" tube TV. The picture is great with a bit of manual adjustment, and the sound is ok. My parents still enjoy watching VHS, DVDs, and game systems that use composite video connections (Wii, n64, etc.), and it was a big disappointment to find out that this TV has so many HDMI inputs yet only 1 component input and 0 composite inputs. Even routing everything through the AV receiver, we still need to buy a $50-$100converter box to turn the composite video into a poor quality HDMI signal. I realize that composite is a dying connection, but if you are looking to connect any device without an HDMI or component output, do NOT get this TV. I bought a smaller vizio a few years ago and still love it, but this TV has definitely made me lose some respect for the brand.", "Date": "January 22, 2011"}, {"Title": "Vizio needs to revamp this model", "Author": "John \"Casual User\"", "ReviewID": "R2BNF30JZSPDAQ", "Overall": "3.0", "Content": "My mother in law got this during a visit and she wanted all of our opinions.  I have to say we were unimpressed it was dull and sound not full.  But after my brother in law turned up the backlighting it was bright and looked like it should.  Conections wise it has all hdmis and one componet input and she had a standard cable box and dvd player so she will have to upgrade one.  As for upgrades Vizio should have more inputs and better preset color settings.  I would get a different model but still like vizio.", "Date": "December 29, 2010"}, {"Title": "HDMI inputs always oversample / support friendly but unhelpful", "Author": "Amazon Customer", "ReviewID": "R151LOVS9GYRF", "Overall": "3.0", "Content": "I can't get a decent image on the TV when using HDMI input from my HTPC.  From what I can tell based on reading the manual, the panel will always oversample (i.e. no 1:1 pixel mapping) when displaying an image from the HDMI input.The person I spoke with claimed to be in the Utah support center and they spoke good English.  I probably misunderstood the guy when he said he could help me after I gave up all of my personal information.  I took that to mean that he knew the answer to my question.  What he probably meant was that he would be allowed to attempt to help me after I spent twenty minutes telling him all of my details.  In the end, he admitted that he didn't understand the question and didn't know what oversampling was.I asked to speak to third-level support but got frustrated before having any success.  The \"party line\" is, from what I can tell, that it's ATI's fault since the panel works via analog RGB input.  However, since the manual seems to indicate that oversampling is always on, not much that a video card maker could do!Also, the EDID information is wrong.  The panel reports at 60Hz.  Interestingly enough, the manual indicates that you should run it at 60Hz with no explanation of the reasoning.  Why would I buy a 120 Hz panel to run it at 60Hz?When you evaluate this unit, I recommend treating it as if there is no HDMI input.. analog RGB only.  Worth investigating whether HD movies can be watched this way.  I think that something with HDCP makes that impossible.I originally rated this two stars.  However, since the manual is available online and since everything I said above does seem to be found in it (although probably takes more expertise than most of us have), I went ahead and changed this to three stars.", "Date": "February 13, 2011"}, {"Title": "This TV should be declared a health hazard!", "Author": "ThinkJoy", "ReviewID": "R2L0M9PMXVQRLX", "Overall": "1.0", "Content": "We purchased this tv in December 2010.  We had no complaints about the picture.  The sound was a nightmare and I truly believe we have permanent hearing damage.  We had to sit with the remote in our hands the entire time the TV was running to adjust the volume, which would randomly go \"from 0 to 150\" or vice versa.  The voices couldn't be heard on broadcast TV, DVDs, recorded TV, or streaming TV.  Any music or sound effect was so loud that we often had to completely mute the TV; we could't hear any voices over the music/sound effects anyway.  After about the fist week, the TV would completely lose audio several times a day.  Changing the channel would restore the audio.  This happened more and more frequently over the next 2 months.  In late January, the TV began cutting itself off and back on; this occurred more and more frequently until we returned the TV in March.  We only waited that long because we had changed TV providers at about the same time we bought the TV and it took a while to figure out where the problems were.  We replaced the Vizio with an LG and couldn't be happier.  The picture on the LG is much better, too.", "Date": "April 3, 2011"}, {"Title": "Never buying a Vizio again.", "Author": "F. Szczepanski", "ReviewID": "R3B4TLQ5QHN0I6", "Overall": "2.0", "Content": "Tech support was nice, but unhelpful. The problems that I've had with this TV, along with its inconsistent operation leaves me longing for the wonderful days I spent with my Samsung DLP TV. (1) Remote is crap. Buttons are hard to press; (1A) Cannot use the remote in front of the TV, only off to the side or if I hold the remote high up. (2) Menu options randomly locked out in certain viewing modes, including 1080P, the highest advertised box setting! I had to switch BACK to 1080i with my PS3 to access most menu settings! WHAT THE HECK?! (2B) Smooth Motion -- ON by default - will make video look BLURRY, JERKY, and of POOR QUALITY. I finally found that was the cause of my weird HD TV viewing after wasting an hour on the phone with a Verizon tech who had to suffer with me. I turned it off, and the TV finally look sokay... (3) Switching between inputs is HORRENDOUSLY slow. My old DLP (3-4 years old) switches inputs twice as fast. (4) What's up with the VIZIO logo being lit up, whether the TV is on or off? Highly unnecessary... almost pretentious... For a TV of this 'quality', I would have to say I will pass on ever buying another VIZIO if this is what the fastest-growing LCD TV seller in America is up to... back to Samsung for my next TV.", "Date": "December 14, 2010"}, {"Title": "BOUGHT 2 ONE DOA", "Author": "Danielle Hall", "ReviewID": "R178RLLIKWUIOB", "Overall": "2.0", "Content": "BOUGHT 2 OF THESSE TV'S. CAME IN YESTERDAY ONE WAS DEAD. HAD A CRACKING NOISE COMING FROM THE VENT IN THE BACK OF THE TV, AND IT WAS ALL DUSTY. (DID NOT LOOK NEW EVEN WHEN IT SAID IT WAS NEW). THE OTHER TV WAS FINE.", "Date": "January 4, 2011"}, {"Title": "42\" Vizio E421VA", "Author": "M. Tripp", "ReviewID": "R5KGBLU1G30Q7", "Overall": "1.0", "Content": "This television was a huge disappointment. It was a gift, which I will be returning promptly.Pros: Xbox 360 games look alright on full resolution 1920 x 1080p, but the television shows that it is only 60hz, not the advertised 120hz.Cons: Sound will constantly go out, and HD television channels constantly lag. The Trusurround, truvolume and Smoothmotion options are a joke. You'll want to turn them off immediately, or everything will look and sound horrible.I thought Vizio was a good company, but I'll be looking into Panasonic, Sony or Samsung.", "Date": "January 16, 2011"}, {"Title": "Very upset", "Author": "Sherry", "ReviewID": "R35RRNFA2576V1", "Overall": "4.0", "Content": "I got this TV and didn't open it for two months. Once I did not only were the screws for the base missing but the HDMI 1 didnt work!!!!!!!!!!! I was replacing a bigger Vizio that wasnt as new but at least everything worked on it.", "Date": "March 15, 2011"}, {"Title": "Stay away from this model", "Author": "ABC", "ReviewID": "R29GCRNO9SHJVM", "Overall": "1.0", "Content": "This TV looks apealing with big screen size and decent quality of picture. But it has the WORST reliability!! my TV died in 2 days", "Date": "August 5, 2010"}], "ProductInfo": {"Price": "$599.99", "Features": "1080p Full HD\n120Hz refresh rate\n50,000 to 1 Dynamic Contrast Ratio\nSRS TruVolume and SRS TruSurround HD audio\nAmbient Light Sensing technology", "Name": "VIZIO E421VA 42-Inch 1080p LCD HDTV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41MrrQRAvSL._SY300_.jpg", "ProductID": "B003VQQVDA"}}